[{"name":"Ace of Aces","year":1991,"developer":"Artech"},{"name":"Action Fighter","year":1986,"developer":"SEGA Enterprises Ltd.","url":"b#Action%20Fighter%20%28USA%2C%20Europe%2C%20Brazil%29%20%28Rev%201%29.zip","filesize":58064,"score":5.9,"genres":"Action > Racing / Driving > Top-down > Arcade > Shooter > Automobile > Flight / aviation > Motorcycle","desc":"<p>This is a top-down vertically scrolling shooter, in which you start off as a motorbike. You are quite vulnerable to attack at first, but power-ups come in the form of a Sega van which you have to dock with. The first time you dock you get double fire, the second time gives you a rocket, the third gives a rear force field, and the fourth invulnerability.</p><p>By destroying cars and bikes that appear on your way, you can collect A-F letters. Collecting A through to D allows you to change into a sports car which is less vulnerable to attack, but not as nimble. Collect all the letters in order to be able to transform into a high-tech plane. This is the final stage of one of the five missions. Only the high-tech plane can guide you to your destination in which your main target is hiding.</p><p>There is also a time limit in which you have to complete the mission. It is advisable to transform into the high-tech plane as fast as it is possible.</p><p>Picking up flags gives you bonus points with 10,000 points gaining you an extra life.</p>"},{"name":"Addams Family, The","year":1993,"developer":"Ocean Software Ltd.","url":"b#Addams%20Family%2C%20The%20%28Europe%29.zip","filesize":182429,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Addams Family</em> is a side-scrolling platformer based on the movie of the same name. The player takes the role of Gomez who searches for his missing family members. To find them he has to explore six different parts of the mansion, e.g. the woods, which are basic platform levels: the player moves from left to right while jumping a lot and avoiding enemies. Some of them can be dispatched of by a jump on their heads. </p><p>The main difference to the other versions of this game is a unique level design. There is also a life meter which allows to get hit more often before dying.</p>"},{"name":"Aerial Assault","year":1990,"developer":"Sanritsu Denki Co., Ltd.","url":"b#Aerial%20Assault%20%28Europe%2C%20Brazil%29.zip","filesize":95039,"score":6.8,"genres":"Action > Side view > 2D scrolling > Shooter > Flight / aviation","desc":"<p>In <em>Aerial Assault</em>, you play the Freedom Fighter who must destroy five targets, including the Vinsk, CB-53 Bomber, \"El\", and two cliff fortresses. During each of the five missions, you will encounter enemy jets, choppers, submarines, jeeps, parachute bombs, and several other enemies which you must destroy. Shooting either the spinning fighters or the small flying helicopters will earn you a power-up that allows you to upgrade or downgrade your firepower. There are three difficult settings: \"Easy\", \"Normal\", and \"Hard\". You will not be able to complete the game if you select the \"Easy\" setting.</p>"},{"name":"After Burner","year":1987,"developer":"SEGA-AM2 Co., LTD.","url":"b#After%20Burner%20%28World%29.zip","filesize":206606,"score":6.3,"genres":"Action > Behind view > Arcade > Shooter > Flight / aviation","desc":"<p><em>After Burner</em> is an aircraft shooter. The goal is simple: use your F-14 Tomcat and shoot as many enemies as you can. This aircraft has two weapons: lock-on missiles and Vulcan cannons (basically machine guns). In some versions there is an option to let the cannons shoot automatically all the time.</p><p>The game is viewed from behind the plane with you fighting wave after wave of enemy fighters. But at heart it offers the usual shooter mechanics, meaning you spend most of your time dodging and shooting. Sometimes you come across a friendly supply plane and if you dock with it you can replenish your missiles.</p><p>The SEGA Master System adds a boss fight at the very end. Despite being called <em>After Burner</em>, all other console / computer ports are based on After Burner II.</p>"},{"name":"Agi Gongyong Dooly","year":1991,"developer":"Daou Infosys Corp."},{"name":"Air Rescue","year":1992,"developer":"SIMS Co., Ltd.","url":"b#Air%20Rescue%20%28Europe%2C%20Brazil%29.zip","filesize":88350,"score":6.6,"genres":"Action > Side view > 2D scrolling > Helicopter","desc":"<p><em>Air Rescue</em> is similar to Choplifter!. You are a pilot of a helicopter and the object is to rescue hostages without being shot down by soldiers, jeeps, tanks, choppers, and ground-based missiles, and bring them back to base. A maximum of four hostages can fit into the helicopter at any given time, so it is necessary to make more than one trip. You can choose from a variety of weapons that you can use to shoot down enemies. There are five rounds, which take you through theme parks, burning skyscrapers, army bases, sunken submarines, and caverns. The round ends when you have taken the required number of hostages to the bases.</p>"},{"name":"Alex Kidd in Miracle World","year":1986,"developer":"SEGA Enterprises Ltd.","url":"b#Alex%20Kidd%20in%20Miracle%20World%20%28USA%2C%20Europe%2C%20Brazil%29%20%28Rev%201%29.zip","filesize":79711,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>Many centuries ago, on the planet Aries, there lived a boy called Alex Kidd. For seven years, he lived on Mt. Eternal studying Shellcore, an ancient art that makes one strong enough to break rocks into pieces. As he was leaving the mountain one day to travel to his spiritual homeland, a dying man told him that the peaceful city of Radactian was in grave danger. Before taking his last breath, the man gave Alex a piece of a map and a medallion made of Sun Stone.</p><p>There are eleven locations in which Alex must explore, each of them has its own unique dangers. In each location, Alex can collect bags of coins, which can be used to buy items at the shop and are used to help Alex get through each location (eg: motorcycle, peticopter, power bracelet, etc.) There are also traps that Alex must avoid like the ghost that chases him. He can also collect the Telepathy Ball that will help him read people's minds.</p><p>Later, Alex learns that in order to save Radactian from destruction, he must first defeat Janken the Great, Emperor of the planet Janbarik (he got his name from his expertise at the game of Janken -- or what people call \"scissors, paper, stone\" in the Western World. Janken has sent his henceman all over Radactian to prepare the game for Alex as he passes by them. In order to get past them, Alex must win three times at Janken. If he loses, he is turned to stone and vanished from Radactian forever. Later on in the game, Alex must play with the same henceman, but only this time, when Alex wins, they decide to play dirty.</p><p>Alex uses his fists to wipe out some of Janken's enemies such as birds, sea horses, bats, monkeys, frogs, and a few others. If his quest to save Radactian from the evil hands of Janken becomes difficult, he can instead use the power bracelet to perform the \"Shocking Waves of Destruction\", an ancient trick in the art of Shellcore.</p><p>Before Alex comes face-to-face with Janken, he should rescue his brother, Egle, from imprisonment, and get the letter and two medallions.</p>"},{"name":"Alex Kidd in Miracle World 2","year":2017,"developer":"SEGA Enterprises Ltd.","url":"b#Alex%20Kidd%20in%20Miracle%20World%202%20%28World%29%20%28Unl%29.zip","filesize":251914,"score":"","genres":"Action > Platform","desc":"<p>Alex Kidd in Miracle World is a 2D platform game. The player must finish levels and overcome obstacles and puzzles in both scrolling and single-screen environments.</p>"},{"name":"Alex Kidd in Shinobi World","year":1990,"developer":"SEGA Enterprises Ltd.","url":"b#Alex%20Kidd%20in%20Shinobi%20World%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":125683,"score":7.5,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Alex Kidd continues his adventures in <em>Alex Kidd in Shinobi World</em>, featuring remixes of the music you heard from Shinobi, and featuring the common enemy: Ninjas.</p><p>The Dark Ninja, whom was banished 10,000 years ago, has returned to rule Miracle World. He also takes young Alex's girlfriend and use her as a sacrifice. To help Alex defeat the Dark Ninja and rescue his girlfriend, a god enters Alex's body, causing Alex to become a ninja master.</p><p>There are four rounds, with three levels each, and has Alex travel through locations like office blocks, construction sites, shipyards, and jungles. He must go through each level defeating ninjas and other wildlife. In the last levels, he must defeat bosses including Kabuto, Heli, Robster, and Hanzo. To survive some levels, you must learn the secret jumping technique, described on page eight of the game's instruction manual. You start the game with three lives and are presented with an energy bar with three units, but you'll lose one if an enemy touches you. Furthermore, If you lose all three energy units, you lose a life, and if you lose all three lives, the game is over.</p><p>Additional energy units can be obtained by collecting hearts that can be found by breaking treasure chests. The maximum units you can get is six. From there, the heart is replaced by a mini-Alex. Collect this and you've earned yourself an extra life. You'll get hearts if you have less than six units. </p><p>You can also get weapons like spears and power swords by breaking these treasure cheats. However, if you're lucky, you can obtain a Tornado icon, letting you transform into a tornado while mini-Tornados whirl around the screen, seeking enemies. This allows you to either go left or right so your enemies get sucked in and are knocked out. </p>"},{"name":"Alex Kidd: BMX Trial","year":1987,"developer":"SEGA Enterprises Ltd."},{"name":"Alex Kidd: High-Tech World","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Alex%20Kidd%20-%20High-Tech%20World%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":81880,"score":5,"genres":"Action > Strategy > Side view > 2D scrolling > Platform > Regional differences","desc":"<p>A new arcade has hit town, and Alex and his friends decide to check it out. Sadly, they have no idea where it is, so it's up to Alex to find the eight map pieces cleverly hidden inside the castle. </p><p>Getting all the pieces is only the start, he must then fight his way through a forest filled with ninja assassins, enter town to do required tasks, obtain a travel pass, then get through a second forest filled with other nasties. The question is: will Alex make his way to the arcades before 17:00?</p><p><em>Alex Kidd: High-Tech World</em> allows you to resume a saved game. All you have to do is enter a password, and the game will be resumed right where you left off. The game is time-based, and events can only happen at certain times. For instance, certain characters will appear when thirty minutes of each hour is up. </p><p>During the game, you can access a status screen, which helps you keep track of the time, what floor you're on, and how many map pieces you collected so far. There are six floors inside the castle, including the attic. On some floors, there are phones which you can use to either to ask a character for help, or order a pizza. There are also alternate solutions to some puzzles in the game. The demo at the start of the game may give away one of the map pieces.</p>"},{"name":"Alex Kidd: The Lost Stars","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#Alex%20Kidd%20-%20The%20Lost%20Stars%20%28World%29.zip","filesize":120849,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Alex Kidd: The Lost Stars</em> has similar gameplay like in the other Alex Kidd games, but this one's easier and designed for kids. Once again you play Alex, whose mission is to run through each location, knocking down enemies, and obtain the six miracle balls. These balls are hidden inside the strangest places like golden eggs, the Fantasy Zone ship out of action, clamshells, Christmas presents, pumpkins, and desk bells.</p><p>Alex must then venture in outer space to defeat the evil Ziggurat. Locations include Toy World, Machine World, the World of Make Believe, Water World, and Monster World. You will even tour through the giant's body. Once you obtained the six miracle balls, you have to run through all the locations again, but these repeated locations introduce new enemies. </p><p>With all the locations, you're under a time limit, and as usual, if the time expires, you lose a life. Alex starts the game with nothing, but during the game, he can collect power-ups that give him extra time, and allow him to shoot enemies or jump higher.</p>"},{"name":"ALF","year":1989,"developer":"Nexa Corporation","url":"b#Alf%20%28USA%29.zip","filesize":75874,"score":4.4,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p>Help ALF try to get to Mars to see his friends Skip and Rhonda!  ALF's latest adventure takes him out of the Tanner household and into suburbia, the depths of subterranean caves, the bottom of the lake, and even the moon!  As ALF looks for parts to build his space scooter, he is continually hounded by the ATF (Alien Task Force)  who will stop at nothing to keep ALF from reaching his goal.  However, ALF is not completely defenseless, as he can buy and trade for items that will keep him out of sight and away from their clutches.</p>"},{"name":"Alien 3","year":1992,"developer":"Eden Entertainment Software Ltd.","url":"b#Alien%203%20%28Europe%2C%20Brazil%29.zip","filesize":156124,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Sci-fi / futuristic > Horror > Licensed","desc":"<p><em>Alien³</em> is a video game based on the movie of the same name. The plot of the movie picks up directly after the end of <em>Aliens</em>. Ellen Ripley, the main character of the <em>Alien</em> series, is in cryo-sleep aboard the spaceship Sulaco. Unfortunately, an alien or two has stowed away on the Sulaco and wreaked havoc within the ship. Thus, it crashes on the prison colony planet Fiorina 161. Ripley and the unarmed prisoners have to figure out a way to survive the aliens terrorizing the colony until help arrives.</p><p>The gameplay of the various <em>Alien³</em> conversions varies from platform to platform. This version is a side-scrolling action game with large maze-like levels. At each level, you have to rescue all the trapped prisoners and then make your way to the exit, all while surviving multiple alien attacks.</p>"},{"name":"Alien Storm","year":1991,"developer":"Team Shinobi","url":"b#Alien%20Storm%20%28Europe%2C%20Brazil%29.zip","filesize":125250,"score":6.5,"genres":"Action > 1st-person > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Shooter > Sci-fi / futuristic","desc":"<p>The aliens are invading Earth, and it's up to the \"Alien Busters\" to wipe them out and destroy their creator. The Busters consist of Karla, Gordon, and Scooter. Each one of them has their own weapons and special attacks.</p><p>When you start the game, you can select any one of these characters to play as. There are six missions to complete (eight in the Genesis version) with several stages, and each mission has you blasting aliens all the way to the end, from the streets to the mother ship where you'll meet the mother of all aliens. Unfortunately, blasting these aliens will not be an easy task, as they get tougher in every mission, and are capable of hiding into objects such as plants, postboxes, trashcans, drums, and several others. Each mission has an objective such as rescuing people destroying a UFO.</p><p>When you deal with a few aliens, flying heads will appear, which you can shoot to collect life or energy (by the way, life is important to you, since if yours get empty, you're dead). However, rather than using your ordinary weapons, you can use the special attacks that are enough to kill the aliens you currently see. These types of attacks vary depending on the character you choose at the start of the game. For instance, Gordon summons a U.S. Air Force Jet that drops bombs across the street, while Scooter is able to teleport out of his present location, and leave a series of bombs that will blow up aliens on sight, he will then re-appear. However, using your character's special attack uses up a lot of energy, and if you have little or no energy, you can't use it.</p><p>At the end of some missions is an alien boss, which you must destroy in order to complete the mission. Also, at the end of everyone, you have to enter buildings where you participate in a shooting gallery. The object is to kill aliens popping up from several locations with the building. </p><p>You can play <em>Alien Storm</em> by yourself, or with another person.</p>"},{"name":"Alien Syndrome","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Alien%20Syndrome%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":135300,"score":6.5,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p><em>Alien Syndrome</em> is based on the arcade version of Alien Syndrome. However, some distinct changes have been made. The level layouts have been changed and the game now features a flip screen instead of scrolling, which causes the enemies to always appear in the same location when entering a new location. The game is also now littered with hazardous tiles on the ground that will kill the player if they step on them and these tiles will fire the occasional shot that needs to be avoided. The tiles can only be temporarily disabled by shooting them. Unlike the arcade version the first player is always Ricky and the second player is always Mary and the players take turns instead of being able to play co-op.</p>"},{"name":"Altered Beast","year":1989,"developer":"Team Shinobi","url":"b#Altered%20Beast%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":138242,"score":6.2,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform","desc":"<p>You are a hero raised from the dead by the god Zeus to rescue his daughter Athena. With scenery inspired by Ancient Greece, you have to fight hordes of undead and demons, with a boss at the end of each level until you meet the god Neff, who holds the girl captive.</p><p>The <em>Altered Beast</em> title refers to your shapeshifting abilities. In this platformer, you can collect spirit balls by defeating two-headed wolves, allowing you to mutate into different beasts such as a werewolf, a dragon, a tiger, a bear and others depending on the version. Each form, tied to a level, comes with special abilities such as flight and powerful attacks, easily superseding the basic set of punches and kicks in your human form.</p><p>The game can be played in single player mode, or in same-screen multiplayer co-op mode.</p>"},{"name":"Andre Agassi Tennis","year":1993,"developer":"TecMagik Entertainment Ltd."},{"name":"Arcade Smash Hits","year":1992,"developer":"Images Software Ltd.","url":"b#Arcade%20Smash%20Hits%20%28Europe%29.zip","filesize":84259,"score":6.5,"genres":"Action > Compilation > Arcade","desc":"<p><em>Arcade Smash Hits</em> is a compilation of three classic Atari arcade games, previously unreleased for Sega Master System:  Centipede,  Breakout, and  Missile Command. This release adds short introduction sequences to each game.</p>"},{"name":"As Aventuras da TV Colosso","year":1996,"developer":"SEGA Enterprises Ltd."},{"name":"Assault City","year":1990,"developer":"Sanritsu Denki Co., Ltd.","url":"b#Assault%20City%20%28USA%2C%20Europe%2C%20Brazil%29%20%28Light%20Phaser%29.zip","filesize":137990,"score":6,"genres":"Action > 1st-person > Side view > Rail shooter","desc":"<p>In the latter half of the 21st century, robots have been engaged in labor in dangerous places, housework, etc. Then suddenly, the control system used to function these robots plotted a revolt against the human race, and ordered every robot to annihilate all of the people. The robots robbed them of their weapons, and occupied various military bases and factories. The war robots that were manufactured there murdered men one after another, and the survivors organized a resistance and went into a full-scale offensive against the enemy's army. You are Joe, and you swear that nothing can stop you from destroying the control system which forces the robots to kill.</p><p><em>Assault City</em> is a one-player shooter. At the beginning of the game, you participate in a little shooting practice, where you must shoot squares that contains pictures of robots, and avoid shooting squares that contains pictures of humans. In the levels that follow the shooting range, you must kill robots that appear and attack you. If you are hit by these robots, some of your energy will be lost. Occasionally, shooting the power-ups that appear will result in more weapon power or more life. At the end of each level, you need to defeat a boss in order to proceed to the next level. The game ends when you lose all of your energy. You have unlimited continues, however.</p><p><em>Assault City</em> comes in two flavors: the control pad version, as well as a Light Phaser version.</p>"},{"name":"Asterix","year":1991,"developer":"SEGA Enterprises Ltd.","url":"8#Sega%20-%20Master%20System.zip/Asterix%20%28Europe%2C%20Brazil%29%20%28En%2CFr%29%20%28Rev%201%29.zip","filesize":1,"score":8.1,"genres":"Action > Side view > 2D scrolling > Platform > Classical antiquity > Licensed","desc":"<p>The Romans, who fail to conquer one final Gaul village, kidnap Getafix, the druid brewing the magic potion that gives all the inhabitants supernatural strength. Vitalstatistix, the village chief, orders Asterix and Obelix to find him, keep him out of Caesar's hands and bring him back at any cost.</p><p>In seven rounds, you can play either with Asterix or Obelix, and in the bonus stages (accessible when you collect fifty bones in a single round), you control the little Dogmatix. The heroes can jump, punch, swim, throw obstacles, grab vines or ropes and they have distinct moves. Obelix moves slower, but is able to manipulate objects, while Asterix has much more speed. Both characters can be played alternately according to the level. In the two-player mode, you each choose a character and clear areas in turns.</p><p>Aside from the traditional moves, there are special potions that melt ice, create makeshift bridges or blow up blocks. The game contains many familiar characters and scenery from the comic books.</p>"},{"name":"Asterix and the Great Rescue","year":1994,"developer":"Core Design Ltd.","url":"c#Asterix%20and%20the%20Great%20Rescue%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1,"score":6.4,"genres":"Action > Side view > 2D scrolling > Platform > Classical antiquity > Licensed","desc":"<p><em>Astérix and the Great Rescue</em> received a unique version for Sega's 8-bit systems. It follows the same story as the Genesis version, but offers unique levels and gameplay mechanics.</p><p>To rescue their friends Getafix and Dogmatix from the Romans, Asterix and Obelix must make their way through five levels of platforming action, encompassing Gaul, a Roman encampment, the forest, a Roman galley and the city of Rome itself, fighting animals and Roman soldiers. Each level consists of six smaller stages, with the final stage being a boss fight.</p><p>During the levels, players can switch between Asterix and Obelix at any time. Both friends have slightly different abilities: Asterix moves faster and can jump higher and is the only one who can crouch to get into crawl spaces. Obelix can push heavy objects out of the way, has a more powerful punch than Asterix and can jump on top of enemies to destroy them or to bounce off of them. He can also use his punches and bouncy jumps to destroy brick barriers. Only Asterix can use the magic potions that can be found in the levels, of which there are four varieties: levitation potions allowing him to fly, bomb potions giving him projectiles to throw, cloud potions allowing him to create platforms in mid-air, and a disguise potion that allows him to pass by any enemy undetected. The only special ability Obelix can use is his mega-punch: more powerful than a regular punch, it takes some time to recharge after use.</p><p>Besides the potions, other pick-ups include coins and money bags for points, chickens and chalices as health power-ups, a sickle for temporary invisibility, the Mega symbol for temporary super-strength and a red heart for an extra life. The game features a password system that allows restarting from any of the five main levels.</p>"},{"name":"Asterix and the Secret Mission","year":1993,"developer":"SEGA Enterprises Ltd.","url":"c#Asterix%20and%20the%20Secret%20Mission%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform > Classical antiquity > Licensed > Regional differences","desc":"<p>The druid Getafix is out of magic potion, and Astérix and Obelix are set out on a secret mission: to find the necessary herbs, so he can brew the potion again.</p><p>In this side-scrolling action game, the player can choose to play either Astérix or Obelix at the start of each one of the six levels. Although the main setting of each level is the same to both characters (forests, caves, deserts, underwater stages, waterfalls and such) the level design for each one may vary. In two player mode (Master System version), players will take turns playing as Astérix and Obelix. Both characters jump (by pressing button 2), punch enemies and break blocks (by pressing button 1). Astérix can run (by pressing and holding button 1 while moving) and double jump (by pressing 2 in the middle of a jump). Obélix is stronger and can break several bricks in a row when jumping over them (pressing 1 while jumping), and can also slide down hills (by pressing down at them).</p><p>Astérix can get some potions (thrown by pressing up and 1), which can break rocks, kill or shrink enemies. Obelix can get miniature menhirs which can be thrown (by pressing up and 1) against enemies. Both characters can also get bones throughout the game, granting access to bonus stages where the player controls Dogmatix. Some levels also involve minor puzzle solving, like pushing switches or moving rock blocks.</p>"},{"name":"Astro Warrior","year":1986,"developer":"SEGA Enterprises Ltd.","url":"b#Astro%20Warrior%20%28Japan%2C%20USA%2C%20Brazil%29.zip","filesize":43451,"score":6.3,"genres":"Action > Top-down > 2D scrolling > Shooter > Direct control > Space flight > Sci-fi / futuristic","desc":"<p>Basic Sega shoot-em-up in which you must guide your ship through three zones while avoiding hazards. Your only weapon are bullets as your only defense, but if you shoot the flashing red pieces on the terrain, chances are that a green ship will approach you, and if you collect this ship, your weapons will be upgraded so that you shoot a laser beam instead. Keep collecting ships and you can shoot up to three laser beams at once. </p><p>At the end of each zone, you will come across a boss that takes multiple hits to kill. If you manage to conquer all three zones, you are back to where you started. The whole point of this game is to earn as many points you can without losing all of your lives.</p>"},{"name":"Astro Warrior & Pit Pot","year":1986,"developer":"SEGA Enterprises Ltd.","url":"b#Astro%20Warrior%20%26%20Pit%20Pot%20%28Europe%29.zip","filesize":66375,"score":7.4,"genres":"Compilation","desc":"<p>Two games on one cartridge:</p><ul><li>Pit Pot: The Magical Castle</li><li>Astro Warrior</li></ul>"},{"name":"Ayrton Senna's Super Monaco GP II","year":1992,"developer":"SEGA Enterprises Ltd."},{"name":"Aztec Adventure: The Golden Road to Paradise, Nazca '88","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Aztec%20Adventure%20~%20Nazca%20%2788%20-%20The%20Golden%20Road%20to%20Paradise%20%28World%29.zip","filesize":85815,"score":5.9,"genres":"Action > Diagonal-down > 2D scrolling > Pre-Columbian Americas","desc":"<p>Aztec Adventure is a traditional action/labyrinth game in which the player assumes the role of Nino, an explorer whose aim is to find the Aztec Paradise.</p><p>The labyrinth is full of Aztec mythology creatures and other ancient Mexican references.</p><p>Although it is a maze game, the controls are very simple and easy to manage.</p>"}]