[{"name":"Back to the Future Part II","year":1990,"developer":"Images Software Ltd.","url":"b#Back%20to%20the%20Future%20Part%20II%20%28Europe%2C%20Brazil%29.zip","filesize":108071,"score":5.6,"genres":"Action > Side view > Top-down > 2D scrolling > Isometric > Arcade > Beat 'em up / brawler > Puzzle elements > Licensed","desc":"<p><em>Back to the Future II</em> is a collection of five arcade and puzzle games.</p><p>Based on the second installment of the popular Hollywood series <em>Back to the Future</em>, this movie conversion has Marty McFly and Doc Brown travel through time to stop their arch-rival Biff from changing the future. The game consists of five parts, each inspired by one of the movie's most memorable scenes:</p><ul><li><strong>Hoverboard Chase</strong>: A Paperboy clone without newspapers, but with isometric levels and lots of enemies to dodge.</li><li><strong>Jennifer Rescue</strong>: Guide Marty's girlfriend Jennifer out of the house without her meeting one of the four family members. Open and close doors to make the persons go from one room to the next in this top-down puzzle sequence.</li><li><strong>Beat Biff</strong>: A side-scrolling beat-em-up sequence in the tradition of Double Dragon. Fight your way through a grim 1985 by jumping, hitting and kicking at Biff's lackeys.</li><li><strong>Band Puzzle:</strong> Rearrange the mixed-up parts of an animated picture of the school band in this sliding block puzzle. The clock is ticking.</li><li><strong>Hoverboard Chase 2:</strong> Another hoverboard sequence, similar to the first one, only this time set in 1955.</li></ul>"},{"name":"Back to the Future Part III","year":1991,"developer":"Probe Software Ltd.","url":"b#Back%20to%20the%20Future%20Part%20III%20%28Europe%29.zip","filesize":135177,"score":5.6,"genres":"Action > Side view > Top-down > 2D scrolling > Isometric > Arcade > Western > Licensed","desc":"<p><em>Back to the Future III</em> is a collection of four arcade games. Marty McFly and Doc Brown have traveled back through time to the year 1885 - and they're soon deep in trouble when they face \"Mad Dog\" Tannen's gang and have to find a way to return to the present. This game takes four scenes from the Hollywood movie <em>Back to the Future III</em> and turns them into arcade sequences:<em> </em><em>Buckboard Chase</em>*: Doc Brown goes horseback in an attempt to save Hill Valley's lovely school teacher Clara. This game of quick ducking, jumping and shooting alternates between a side-scrolling and a top-down perspective.</p><ul><li><p><strong>Shooting Gallery</strong>: The name says it all. A classic game of aim-and-shoot, spiced up by hidden extras and bonus targets.</p></li><li><p><strong>Pie Throwing</strong>: Meet the Mad Dog gang. They have guns, and you have... cream pies. It's an isometric version of the shooting gallery, only with ammo. And the targets shoot back.</p></li><li><p><strong>The Train</strong>: Basically a side-scrolling beat-em-up on train wagons with some ducking and jumping. Get rid of the mechanics and collect speed logs to push the engine to a magic 88 mph.</p></li></ul>"},{"name":"Baku Baku Animal","year":1998,"developer":"Sega AM3 R&D Division","url":"b#Baku%20Baku%20%28Brazil%29.zip","filesize":147949,"score":6.9,"genres":"Puzzle > Real-time > Falling block puzzle","desc":"<p>The Minister approaches the King to tell him that his only daughter, the Princess, wants a new pet. But the King says she already has too many, and she can't take care of so many animals. Thus the Minister purposes a contest of skill and daring to select the Royal Zookeeper. Master Piggy then sends his pupil, Polly, to participate in the contest.</p><p><em>Baku Baku Animal</em> is a variation on the very often copied Tetris type of game. The game has three different play modes: practice, normal and hard. It also can be played by two players against each other (except for the Master System version).</p><p>The objective is to pair animal heads with their respective food. If a rabbit head comes falling, you must make it fall on a pile of carrot tiles, dog heads with bones, panda heads with bamboos and monkey heads with bananas. There is a bonus item, the \"BB coin\", which will appear from times to times, and remove piled tiles from the playfield. Removed tiles will be sent to the opponent's playfield all at once, increasing the difficulty of the task. Polly will face several contestants, and she'll win when her opponents get their playfield piled to the top.</p>"},{"name":"Bank Panic","year":1986,"developer":"Sanritsu Denki Co., Ltd.","url":"b#Bank%20Panic%20%28Europe%2C%20Brazil%29.zip","filesize":22920,"score":7.1,"genres":"Action > 1st-person > Shooter > North America > Western","desc":"<p>As a gunslinger, it's your job to protect a bank from bandits while taking care not to shoot innocent customers. The bank has 12 doors in front of 12 teller windows, with only three doors visible at a time. Shooting is done simply by pressing one of the three buttons to shoot the left, middle or right door. The player can move his viewpoint left and right to reveal new doors. People only appear behind the doors that are currently visible on screen, except for the rare outlaws who will pop up to steal a cash deposit from a teller window the player isn't watching. Indicators at the top of the screen show how much time it will take before someone will show up at a door. </p><p>If a bandit appears behind a door, you have only a few seconds to shoot him before he shoots you. If you shoot him too early (i.e. before he sticks his gun out at you), it is considered unfair and gives very little score, but if you're too late, he'll shoot you and you lose one of your three lives. Sometimes a bandit will stick dynamite on one of the doors. You must then shoot the dynamite to get rid of it. If you take too long, the bomb explodes (even if it's offscreen) and you lose a life. </p><p>If you're lucky, a customer will appear behind the door and deposit a bag of gold coins. If you shoot any of these people by accident, you also lose a life. Sometimes a bandit will suddenly take the customer hostage and replace them in the door. </p><p>At other times, a cowboy will appear with a stack of hats. Shooting off all the hats before the door closes grants a cash deposit and a big score bonus. Others will be tied up with rope. If you shoot the rope, there's more money for you, because not only will you receive one bag of gold coins, but you'll get three bags of gold coins. </p><p>There are more than ten rounds in <em>Bank Panic</em>, and each one ends when a person behind all 12 doors was able to throw you a bag of gold coins. The rounds get difficult the further you get. For example, in later rounds, a few bandits will block your shot, and you have to then shoot twice. Also, regardless of what round you're on, there is a time limit.</p>"},{"name":"Basketball Nightmare","year":1989,"developer":"SEGA Enterprises Ltd.","url":"b#Basketball%20Nightmare%20%28Europe%2C%20Brazil%29.zip","filesize":143828,"score":6.3,"genres":"Action > Sports > Diagonal-down > Basketball","desc":"<p>The captain of the home town basketball team is leading his team to win the All-American Championships. But then the captain had a strange dream, nightmare in fact, where he was playing basketball against all these strange creatures in exotic locations.</p><p><em>Basketball Nightmare</em> is a basketball game where the player plays basketball against strange humanoid creatures on the court where the creature lives. The player must play and defeat each creature before moving onto a new place with a new harder opponent. The player starts of playing against Wolfs in the Forest and then, upon defeating that opponent, moves on to play Frogs at the Pond, One Eyed Aliens at the Waterfall, Vampires in the Skeleton Cave, Geishas in the Bamboo Forest, before finally playing against Samurais at the Shrine. If the player loses a match then that match can be replayed until won.</p><p>The player at the start of each match gets to pick how long the match duration is out of the options of 15, 30, or 45 minutes (not in real time) before being placed on the court. When on the court the player always plays towards the right of the court. First the player tries to get the ball from a throw by a well timed button press. When the player has the ball the player has the option to move, pass the ball, and jump. When jumping the player can shoot, with the accuracy of the shot depending on the timing, or just simply pass. When defending the player can cycle through the field or just simply run into the opponent to challenge for the ball. There are a few penalties that the player can get including but not limited to Travelling (not passing after jumping), Charging (Sometimes called when the player with the ball runs into an opponent), and Pushing (Sometimes called when the player without the ball runs into an opponent) with all the penalties resulting with the other team getting the ball on the side of the court.</p><p>Also there are two more modes called CPU vs CPU, where the player can get the CPU to play itself and Versus Play to play against a friend. In both modes the player or players pick one of the 8 nations that are USA, CBA, CHN, JPN, URS, DDR, CAN, and FRN all with a character representing a player of that nation. All the rules are the same as single player mode.</p>"},{"name":"Batman Returns","year":1992,"developer":"Aspect Co., Ltd.","url":"b#Batman%20Returns%20%28Europe%2C%20Brazil%29.zip","filesize":125486,"score":6.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>From Sega 8-bit specialists Aspect comes one of many adaptations of Tim Burton's 1992 superhero sequel <em>Batman Returns</em>. Like other versions, it is a side-scrolling platformer. While very similar to the Game Gear version, the Master System version has slightly different levels and gameplay mechanics.</p><p>Batman must move through five stages on his way to defeat the Penguin. These include the streets and rooftops of Gotham City, Max Shreck's department store, the sewers, and the Penguin's lair. For the first four levels, a route can be selected from two options, allowing for different paths through the game.</p><p>Enemies standing in Batman's way can be defeated by throwing the Batarang at them. At the beginning, the weapon's range is very limited, but it can be expanded by collecting powerups. Other tools Batman can use are a grappling hook to pull himself up to higher levels or swing across dangerous areas, and his cape, which can be used as a parachute, for more control during falls.</p><p>Unlike in the Game Gear version, there is no health bar: a single hit will kill Batman. To compensate, the game contains a generous amount of extra lives.</p>"},{"name":"Battle Out Run","year":1989,"developer":"SEGA Enterprises Ltd.","url":"b#Battle%20Out%20Run%20%28Europe%2C%20Brazil%29.zip","filesize":98998,"score":6.7,"genres":"Action > Racing / Driving > Behind view > Arcade > Automobile > Street racing","desc":"<p><em>Battle Out Run</em> is Sega's answer to Taito's Chase H.Q. You drive a red sports car and must apprehend eight target vehicles in selected cities across the USA, including Los Angeles, Chicago, Miami, and New York. You have to do this while avoiding yellow cars and other obstacles. Halfway through the eight stages, you enter a shop that allows you to upgrade your car and get some nitros, as long as you have money, and you will be rewarded if you apprehend the vehicles. This can be done by bumping into them to disable them.</p>"},{"name":"Battletoads in Battlemaniacs","year":1996,"developer":"Rare Limited","url":"b#Battlemaniacs%20%28Brazil%29.zip","filesize":146083,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Platform","desc":"<p>The three battletoads Zitz, Rash and Pimple are in Tibet to witness the presentation of the Psicone Gamescape, a virtual reality machine. All of a sudden a monster jumps out of the gameworld, captures both the Psicone CEO's daughter &amp; Zitz and takes them back into the Gamescape. Of course Rash and Pimple will have to enter the Gamescape and rescue them.</p><p><em>Battletoads in Battlemaniacs</em> is another game in the Battletoads series by Rare. Much like its predecessor, it blends fighting game elements (in the style of Double Dragon) with other kinds of gameplay, like racing levels, \"snake riding\" levels and such. There are some bonus levels between some of the regular ones, where the player can collect extra lives.</p><p>Buddies can team up and defeat the opposition together in the two coop-modes available. In mode A, players can hit each other while in mode B, they can't.</p>"},{"name":"Black Belt","year":1986,"developer":"SEGA Enterprises Ltd.","url":"b#Black%20Belt%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":80226,"score":6.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Beat 'em up / brawler > Post-apocalyptic > Martial arts > Licensed > Regional differences","desc":"<p>In this game, you play Riki. Kyoko, your beautiful Japanese girlfriend, has been kidnapped, and in order to rescue her, you must get through a tireless army of enemies. These enemies come equipped with weapons that include whips, knives, swords, and flamethrowers, but Riki has to make do with his well-trained martial arts body.</p><p><em>Black Belt</em> is a side-scrolling game that is split into seven chapters. During these chapters, you are fighting Chinese Kung Fu men, wrestlers, jujitsu men, eagles, ninjas, and black women. When you get halfway through the chapter, you will fight a different enemy than one that you encounter before. At the end of each chapter, you have to defeat several bosses before continuing on to the next round. Each type of these has their own personal strengths and weaknesses.</p><p>Once you touch an enemy or boss, you will lose energy. once you lose all energy, you lose a life, but more life can be restored by getting the cake when it comes across the screen in mid-air, or by defeating an enemy that will come at you halfway and you receive a bonus for doing so.</p>"},{"name":"Blade Eagle 3-D","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#Blade%20Eagle%20~%20Blade%20Eagle%203-D%20%28World%29.zip","filesize":114096,"score":5.5,"genres":"Action > Top-down > 2D scrolling > Shooter > Space flight > Sci-fi / futuristic","desc":"<p><em>Blade Eagle 3-D</em> is a vertical shoot-em-up which has no story involved. You just have to shoot your way on three planets (you have to travel through space first), blasting as many enemies as possible. Along the way, there are several bosses that you have to defeat. The later ones drop a power-up, which you can use to upgrade your ship. Some of the power-ups include double shots and laser beams. Another power-up gives you the ability to have an extra ship on your side and will join the fight, and will later serve as a backup. <em>Blade Eagle</em> is designed for play in conjunction with the Sega 3-D Glasses. If you play without the 3-D glasses, it will look like as if there are two of your ships, not just one. If there are four enemies approaching you, they will look like eight.</p>"},{"name":"Body Slam","year":1986,"developer":"SEGA Enterprises Ltd."},{"name":"Bomber Raid","year":1989,"developer":"Sanritsu Denki Co., Ltd.","url":"b#Bomber%20Raid%20%28World%29.zip","filesize":114671,"score":6.7,"genres":"Action > Top-down > 2D scrolling > Shooter > Flight / aviation","desc":"<p>Fly your plane through five levels, shooting enemy planes, submarines, helicopters, and other enemies along the way, and use your equipped cluster bombs if necessary. You need to destroy a target that is outlined in your mission briefing. You have three lives and limited cluster bombs. To help you along the way, you can shoot a power pod to score points, increase your firepower, and gain some help from fellow squadrons.</p>"},{"name":"Bonanza Bros.","year":1991,"developer":"SEGA Enterprises Ltd.","url":"b#Bonanza%20Bros.%20%28Europe%2C%20Brazil%29.zip","filesize":108418,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>Mobo and Robo Bonanza are enjoying their favorite television show when the picture crackles and a shadowy figure of a mysterious stranger appears on screen. This figure asks them to collect certain items that he has placed inside various buildings to test his security force. If they return the items successfully, Mobo and Robo will be rewarded. The two of them state that they will get the job done in just three minutes. However, little do they know that each building is packed with security guards who will raise the alarm if they are caught red-handed. Fortunately both Mobo and Robo are equipped with bullets that can knock the guards unconscious for a few seconds. An $100 reward will be given out if Mobo and Robo are apprehended.</p><p>As either Mobo or Robo, you must collect all the treasures before leaving the ten buildings and shoot any security guards that get in your way. Remember that you are under a time limit. An in-game map will help you locate the treasures. There is a bonus stage after three buildings, where the object is to collect the gold bars in a limited amount of time without  one of the three spotlights shining on you. If it is possible, hide behind open doors. If you manage to get all the gold bars, 10,000 points is added to your score. There are three of these bonus stages, but each of them varies.</p>"},{"name":"Bram Stoker's Dracula","year":1993,"developer":"Probe Software Ltd.","url":"b#Bram%20Stoker%27s%20Dracula%20%28Europe%29.zip","filesize":144204,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Horror > Licensed","desc":"<p><em>Bram Stroker's Dracula</em> is a side-scroller platform game loosely based on the 1992 film of the same name. Players take the role of Jonathan Harker whose mission is to destroy Count Dracula by first heading to Transylvania and then London.</p><p>Jonathan Harker can move left and right, jump and attack with a weapon, the most basic of which is a knife. The status display on the screen shows Harker's health bar, countdown timer to complete the level and currently held weapon. Throughout the levels question mark boxes (similar to the Mario games) can be found, attacking these will reveal power ups which include health restoration, timer increase and new weapons. Among these new weapons are axes, daggers and a shotgun. Question mark boxes can also be used as platforms to reach other areas and enemies. Each stage is divided into two sections: the \"Daytime\" and the \"Nighttime\". These are entirely different levels comparable to stage 1-a and 1-b. Harker must jump to various platforms and obstacles and defeat minor enemies throughout the levels. The end of a Nighttime level is usually guarded by a boss creature who must be defeated to progress.</p>"},{"name":"Bubble Bobble","year":1988,"developer":"Taito Corporation","url":"b#Bubble%20Bobble%20~%20Dragon%20Maze%20%28Europe%2C%20Brazil%29.zip","filesize":131203,"score":7.8,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform > Direct control > Fantasy","desc":"<p>This is an enhanced port of the original version.</p><p>The game now has 200 levels, new items like the peacock feather, blue book, and a blue crystal chalice have been added, and there are also 2 new mini-boss fights. The game also has hidden rooms which allows players to rack up bonus points and find items that are needed to see the best ending. The endings themselves have been changed to be a bit more cinematic.</p><p>Super Bubble Bobble is a mode in the original version that happened after the player beat the original set of levels and had to beat them again with the enemies being swapped around. Beating this would allow the player to see the true ending. This version of the game lacks this mode as the 200 levels are considered one playthrough.</p>"},{"name":"Buggy Run","year":1993,"developer":"SIMS Co., Ltd.","url":"b#Buggy%20Run%20%28Europe%2C%20Brazil%29.zip","filesize":162317,"score":7.2,"genres":"Racing / Driving > Diagonal-down > 2D scrolling > Fixed / flip-screen > Isometric > Real-time > Direct control > Off-roading > Track racing","desc":"<p><em>Buggy Run</em> is a game that lets players race dune buggies in a championship over 15 possible tracks (plus 4 in 2 player mode) each winning money that can be used for dune buggy upgrades. There are 4 different modes that can be played in single player mode that includes Race, Vs Com, Freerun, and Battle.</p><p>In the main mode Race the player is given $20,000 starting cash that can be used to upgrade the buggy. The upgradable features of the buggy are Tyres (grip), Engine (speed), Suspension (limits bounce), Steering (cornering), Transmission (performance). All the upgrades cost $10,000 for level 2, $30,000 for level 3, and $50,000 for level 4 however the player doesn’t need to get them in order. There are also special upgrades to buy that includes $5000 for a mine (drops behind and if another car hits then it is blown up until reset), $5000 for Nitoro (gives the players car a short speed boost), and $10,000 for extra capacity of special items (starts with 2 slots to a max of 6). Special Items must be used in the order they're placed in the slots.</p><p>Within the race the player will be racing 4 other cars to a race to the chequered flag on an isometric scrolling track. Some hazards on the track are lumps and jumps, bumps, rough road and mud. Appearing on the track are special power-ups that are red or white boost and extra money also a random that selects between the two. The prize money for winning is $30,000, 2nd gets $20,000, 3rd gets $10,000, and last gets $5000 to spend on the upgrades and power-ups between races. There are 3 stages of racing that is beginner, intermediate, and expert that have 5 races each. The player must qualify for the next stage or else it will be game over.</p><p>In Vs Com the player plays the computer one on one on any track of the player's choice. All the upgrades for the buggy for the player and the computer are done though allocating a set number of points to varies upgrades. All the item slots can by used for either the nitoro or mine. </p><p>Freerun is a time trial where the player races alone without upgrades on any track against the clock. </p><p>Battle mode is where the player picks 3 computer players to battle on a round arena with the objective to knock the opponents off with the last player on the arena winning.</p><p>There is also a two players mode that include Race, 1P vs 2P, and Battle.</p><p>In 2P Race there is $30,000 for both players to upgrade there cars before placing them on a track with a fixed overhead view where they play 2 computer opponents. There are 4 different themes to pick from.</p><p>1P vs 2P is just the two players battling it out on one of 4 tracks each with 4 different themes. Buggy upgrades are done though allocating a set number of points.</p><p>Battle is the same as single player battle only with 2 players and 2 computers.</p>"}]