[{"name":"California Games","year":1989,"developer":"Epyx, Inc.","url":"8#Sega%20-%20Master%20System.zip/California%20Games%20~%20Jogos%20de%20Verao%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":1,"score":7.3,"genres":"Sports > Side view > 2D scrolling > Fixed / flip-screen > Tricks / stunts > Olympiad / mixed sports > Skateboarding > Surfing > Bike / Bicycling","desc":"<p><em>California Games</em> was the original \"Extreme Games\" – what today's generation might call \"X-Games in the sun\". Players can select sponsors (absent in some versions) and compete in events such as skateboarding, footbag, surfing, roller skating, flying disc (frisbee) and BMX. The surfing event is ranked by judges, which give a score to help the players improve their routine.</p><p>The Atari versions (2600 and Lynx) of the game omit the flying disc and roller skating events, while the Genesis version omits only the flying disc event.</p>"},{"name":"California Games II","year":1993,"developer":"Epyx, Inc.","url":"8#Sega%20-%20Master%20System.zip/California%20Games%20II%20%28Europe%29.zip","filesize":1,"score":5.7,"genres":"Sports > Behind view > Side view > 2D scrolling > Olympiad / mixed sports > Skateboarding > Snowboarding / skiing > Surfing","desc":"<p>California Games II is the sequel to the smash hit 1988 game.</p><p>This time you compete in: hang-gliding, jetski, skateboarding, body boarding and snow boarding.</p>"},{"name":"Captain Silver","year":1988,"developer":"Data East Corporation","url":"b#Captain%20Silver%20%28Japan%2C%20Europe%2C%20Brazil%29.zip","filesize":137433,"score":6.5,"genres":"Action > Side view > 2D scrolling > Platform > Regional differences","desc":"<p>In <em>Captain Silver</em>, you play the role of Jim, a brave young lad with a taste of adventure. You embark on a journey to find Captain Silver's secret treasure hoard, which is rumored to be hidden on an island in the Eastern Seas.</p><p>There are six scenes in the game. During his travels, Jim will explore villages, fight his way on board ships, venture through caves, and wander around tropical islands. In each of these six scenes, Jim must use his sword to kill cats, rats, bats, witches, skeletons, and other creatures that are waiting for him. When Jim touches, or is shot at, by a creature, he loses one of his lives, but when he kills a creature, he can collect some gold that they leave behind, which can be used to buy items from shops. However, rather than getting gold, enemies leave behind some gold containing one of the letters that spell the word \"CAPTAIN SILVER\". If Jim manages to get all of these letters, he will be awarded an extra life.</p><p>Jim may only use his sword to start off with, but once he collects a fairy that floats toward him in every scene, Jim will be able to shoot stars at enemies, making his kills more efficient. The maximum number of stars that he can have is six. There are other power-ups that Jim can collect in the game. These include the \"clock\" power-up, which gives Jim extra time; the \"boot\" power-up which allows Jim to jump higher; and the \"coffee?\" power-up, which enables Jim to shield himself from creatures until he is hit by one.</p><p>There is a boss in each scene, which he must defeat in order to proceed to the next round. There is also a certain time limit, which Jim must complete the scene before it expires. If he does not, then he will lose a life.</p>"},{"name":"Casino Games","year":1989,"developer":"Compile"},{"name":"Castelo Rá-Tim-Bum","year":1997,"developer":"Tec Toy Indústria de Brinquedos S.A."},{"name":"Castle of Illusion starring Mickey Mouse","year":1990,"developer":"SEGA Enterprises Ltd.","url":"b#Castle%20of%20Illusion%20Starring%20Mickey%20Mouse%20%28USA%2C%20Europe%2C%20Brazil%29%20%28Rev%201%29.zip","filesize":141735,"score":8.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Sega's 8-bit systems received their own version of the Genesis' Disney platformer. The story and main theme remain the same, but the game has its own unique levels and slightly different gameplay mechanics.</p><p>To save his girlfriend Minnie from the wicked witch Mizrabel, Mickey must venture into the Castle of Illusion. Crossing six levels (including a magical forest, a toy land and a candy world), he must collect the gems of the rainbow in order to confront and defeat the witch.</p><p>Each level features unique obstacles, enemies and a final boss. The enemies can be defeated by jumping on top of them. An alternative way is to pick up objects lying around (like rocks in the forest or blue balls in the toy level) and throwing them at the enemies. Mickey's ability to pick up things and carry them around also leads to some sort of puzzle-oriented gameplay. By placing objects in the right spot and jumping off of them, he can get to areas that are otherwise out of reach. In some levels, he also has to collect keys to open doors. A unique type of object is the treasure chest - by jumping on top of one or throwing it, Mickey gets access to its contents, which might include extra lives, a health power-up or coins to collect for points.</p>"},{"name":"Champions of Europe","year":1992,"developer":"TecMagik Entertainment Ltd."},{"name":"Championship Hockey","year":1994,"developer":"Electronic Arts, Inc."},{"name":"Chapolim x Dracula: Um Duelo Assustador","year":1994,"developer":"SEGA Enterprises Ltd.","url":"b#Chapolim%20x%20Dracula%20-%20Um%20Duelo%20Assustador%20%28Brazil%29.zip","filesize":56190,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Horror > Licensed","desc":"<p>Vampires' population in Transilvania has increased a lot lately, and there's not enough human blood to feed them all. To solve this demographic problem comes Chapolim!</p><p>Chapolim X Drácula: Um Duelo Assustador (which translates Chapolim vs. Dracula: A Frightening Duel) is an authorized \"hack\" of Ghost House, with Ghost House's hero, Mick, replaced by Chapolim (or El Chapulín Colorado in original Spanish), a famous Mexican character from a TV series. Chapolim is a parody to superheroes in general. He dresses a red grasshopper costume with a yellow heart in the chest with the leters \"CH\". He also usually carries his Marreta Biônica (Chipote Chillón in the original, Squeaky Mallet in English) a red (toy) hammer.</p><p>At each stage, Chapolim must defeat five vampires that are in torpor within their coffins. The coffins are locked, so he must first find the keys to unlock them. He'll find the keys killing the most diverse enemies that haunt the mansion he's in, such as ghosts, bats, fire blowers, mummies, etc. Once he's got a key, he must unlock a coffin and then defeat the vampire who sleeps there.</p><p>In order to kill his enemies, Chapolim can jump over them or punch them. Every once in a while, his Marreta Biônica will come flying from one side of the screen to another, and if he jumps over it, he'll catch it. Chapolim can also punch the lights of the mansion: they'll flash and paralyze his enemies.</p><p>Chapolim starts with 3 lives and no continues. He'll be healed by collecting treasures through the castle, and will gain additional lives at every 50,000 and 150,000 points.</p><p>All the text in the game is in Portuguese.</p>"},{"name":"Chase H.Q.","year":1991,"developer":"Taito Corporation","url":"b#Taito%20Chase%20H.Q.%20%28Europe%29.zip","filesize":90360,"score":6.8,"genres":"Action > Racing / Driving > Behind view > Automobile > Crime","desc":"<p>As an undercover agent of Chase Headquarters, your job is to patrol the streets and track down five criminals. You are given a mission briefing before you start which gives information on the suspect and what car they drive. Then you drive across the city without crashing into other cars, and catch up with the criminal's car. To arrest the suspects, you must keep bumping into their car until it is no longer functional. And you have to do this under a strict time limit. You can't afford to crash into cars or buildings or you waste time getting on the road again. </p><p>However, once you've caught up with your suspect, you are given more time. Your car is also equipped with turbo boosts, which you can use to gain extra speed if you are way behind the criminal. Each arrest is based on a \"suspicion\".</p>"},{"name":"Cheese Cat-Astrophe starring Speedy Gonzales","year":1995,"developer":"Cryo Interactive Entertainment","url":"b#Cheese%20Cat-astrophe%20Starring%20Speedy%20Gonzales%20%28Europe%2C%20Brazil%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":227175,"score":6.4,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Hola! Sylvester's alter-ego, Dr Cheesefinger, has captured Speedy's girlfriend Carmel and took the whole cheese supply with him. With the help of some other Looney Tunes characters, you can fight back through a large number of platform levels.</p><p>Speedy can throw his hat or jump enemies to defeat them. To get an ally, you need to collect certain objects (e.g. carrots for Bugs Bunny) and in the meantime, you also have to free your captured friends. Ay, carumba!</p>"},{"name":"Cheril Perils","year":2020,"developer":"The Mojon Twins"},{"name":"Choplifter!","year":1986,"developer":"Coleco Industries, Inc.","url":"b#Choplifter%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":67775,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Helicopter","desc":"<p><em>Choplifter!</em> is a side-scrolling action/arcade game that puts you in command of an attack chopper. Your mission: Go behind enemy lines and rescue up to 16 hostages per level. Be careful, though, because tanks and enemy aircraft will try to stop you - and they won't stop shooting while you are rescuing those hostages!</p><p>Originally released for Apple II home computers, Choplifter! was later ported to the arcades and a number of video game consoles. Many imitators and homages would follow.</p>"},{"name":"Chuck Rock","year":1992,"developer":"Core Design Ltd.","url":"b#Chuck%20Rock%20%28Europe%2C%20Brazil%29.zip","filesize":203442,"score":7.5,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Chuck Rock is your typical average caveman. He likes to spend his Sunday afternoons watching football and drinking beer. Unfortunately, his peaceful existence is interrupted one day when his wife, Ophelia Rock, is kidnapped by the village weirdo, Gary Gritter. So, Chuck is rather upset about this whole situation and you have to help him make things right.</p><p>The game is a side-scrolling platformer. Chuck fights a variety of dinosaurs using his belly-buster attack and a jump kick. Occasionally he has to pick up and throw rocks to defeat enemies and allow him to jump to greater heights.</p>"},{"name":"Chuck Rock II: Son of Chuck","year":1993,"developer":"Core Design Ltd.","url":"b#Chuck%20Rock%20II%20-%20Son%20of%20Chuck%20%28Europe%29.zip","filesize":324683,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>The story in this Chuck Rock game takes up a little while after the end of the first game.  As you may remember, Chuck Rock had to rescue his girl, Ophelia from the bad dude Gary Gritter.  Well, he was successful in his efforts, and now Chuck and Ophelia are married.  Eventually, they have a son, named Junior. Chuck works in a factory, where he develops great skill at carving automobiles out of stone. A rival manufacturer becomes jealous of Chuck's abilities and kidnaps him.  Now it is up to Junior to rescue his dad!</p><p>The gameplay in this sequel is similar to the first game, but with some minor differences since you are playing as Junior, rather than Chuck. This is a side-scrolling platform game with occasional rock-moving puzzles thrown in. Unlike Chuck, Junior carries a club that gives his attacks further reach.</p>"},{"name":"Cloud Master","year":1989,"developer":"Taito Corporation","url":"b#Cloud%20Master%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":105261,"score":6,"genres":"Action > Side view > 2D scrolling > Shooter > Fantasy","desc":"<p>You play a small character who floats about on a cloud and shoots small balls of energy at bad guys who fly at you from the left and right of the screen. You can collect powerups and visit shops to upgrade your offensive and defensive powers. There are a number of different stages which are punctuated by a mini-boss half way through and a big (literally) boss at the end.</p><p>This is one of the only games ever made which features flying noodle bowls and bears with guns.</p>"},{"name":"Columns","year":1990,"developer":"SEGA Enterprises Ltd."},{"name":"Comical Machine Gun Joe","year":1986,"developer":"SEGA Enterprises Ltd."},{"name":"Cool Spot","year":1993,"developer":"The Global Team","url":"b#Cool%20Spot%20%28Europe%29.zip","filesize":150985,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p><em>Cool Spot</em> is a colorful 2D platform game featuring the 7-Up mascot as the main protagonist. The game objective is fairly simple and straightforward. The player character has to collect enough number of cool points throughout each level in order to find and rescue his captured uncool Spot buddies and complete the game.</p>"},{"name":"Cosmic Spacehead","year":1993,"developer":"Codemasters","url":"b#Cosmic%20Spacehead%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":198744,"score":6.5,"genres":"Action > Adventure > Side view > 2D scrolling > Arcade > Platform > Puzzle elements","desc":"<p>Linus had crash landed on a distant planet called Earth, and made his way back home again. Trouble is, no one believes his tale of the planet he discovered! Your job is to help Linus make his way back to planet Earth so he can take some pictures to convince his friends. Gameplay consists of two parts, an adventure and arcade action. In adventure mode you can explore lands, find objects, and talk to people. Sentences can be constructed by using the pointer to select actions or objects on the screen (This is similar to the interface LucasArts used in games such as Maniac Mansion). To reach many new locations involves the action mode, where you will need to cross treacherous landscapes and evade dangerous creatures. This portion resembles a side scrolling platform game. Once you've cleared an action sequence, you will not need to do so again if you decide to revisit a location. Whenever you wish you can receive a password allowing you to continue the game later from the same point.</p>"},{"name":"Cyber Shinobi, The","year":1990,"developer":"SEGA Enterprises Ltd.","url":"b#Cyber%20Shinobi%2C%20The%20%28Europe%2C%20Brazil%29.zip","filesize":129482,"score":5.4,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>In the previous game, an evil army of villains, known simply as \"Zeed\" , but some of them escaped, however. </p><p>Time has passed and it is the year 2XXX where atomic power plants in countries around the world are attacked, and plutonium, which was the equivalent of 100,000 megatons of explosive power, was stolen from these plants. The words \"Cyber Zeed\" was always written at the scene of the crime. Later, the world realized what Cyber Zeed had planned to do: use their nuclear capabilities to terrorize the world. Every nation sent their best forces to stop this threat, but all of them failed. </p><p>Joe Musashi came forward to this great evil, and he is required to fight those who rose from the ashes and put an end to this threat.</p><p><em>Cyber Shinobi</em> is a one-player game that consists of six rounds. You need to fight ninjas that get in your way using your fists and legs. You can also defeat them using special attacks and ninjitsu. Power-ups can be collected along the way, which will give you more shots, ninjitsu, power, and life. A boss needs to be defeated at the end of the round.</p>"},{"name":"Cyborg Hunter","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#Cyborg%20Hunter%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":78475,"score":6.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Metroidvania > Cyberpunk / dark sci-fi > Licensed > Regional differences","desc":"<p>It is the year 2242. You are Paladin, the galaxy's toughest bounty hunter. Cyborgs are about to take complete control of the universe under the direction of Vipron, their evil leader. You are sent to the cyborg fortress to get rid of all the chief cyborgs in each of the seven areas. </p><p>The game screen is divided into three sections. This includes a first-person view of the map, in which you can see objects that are coming your way. There are two types of objects: red objects indicate the lower cyborgs, while white ones indicate the chief cyborgs. Next to it is a map of the area, your life and psycho power count. Below these is the action screen. </p><p>In each of these seven areas, there are several floors which can be reached via the elevator. At the beginning of the game, your only weapons are your fists, but weapons can be collected throughout each area, which include psycho punch, ray gun, light gun, and bombs. Power-ups like extra life and psycho power can also be collected. If you use the psycho punch or psycho gun, your psycho power gets depleted, and when it is empty, you must stock up on some more. You can also get shields that will protect you from laser beams, and jet engines so that you can fly over hazards.In some areas, you defeat a boss which leaves an ID card, which you can use to access other areas of the fortress. </p><p>Some chief cyborgs are easy to kill, while some are hard. You will just have to work out which weapon works best with them. The game ends when you lose all your life. </p><p>You are not alone in this mission. You also have Adina, your contact back at headquarters. Follow her instructions carefully and you may survive.</p><p><em>Cyborg Hunter</em> is based on the Japanese-only animated TV series Borgman.</p>"},{"name":"Cyborg Z","year":1991,"developer":"Zemina Co."}]