[{"name":"Daffy Duck in Hollywood","year":1994,"developer":"Probe Software Ltd.","url":"b#Daffy%20Duck%20in%20Hollywood%20%28Europe%2C%20Brazil%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":317100,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Looney Tunes platformer <em>Daffy Duck in Hollywood</em> received a unique version for Sega's 8-bit systems. While similar in story, concept and themes to the Mega Drive version, the 8-bit version has unique level designs and also several differences in gameplay.</p><p>Players control Daffy Duck, who is hired to reacquire Yosemite Sam's Golden Cartoon Movie Awards, stolen by the nefarious Doctor Duck Brain. Daffy has to make his way through six different worlds of three levels each. Each world is based on a movie genre including western, horror, adventure, sci-fi and more. At the beginning of the game, the six levels of the first two worlds can be selected in any order. Completing all six unlocks the levels of the next two worlds.</p><p>Each level consists of several sections. The entry to the next section only opens once Daffy has dispatched a number of enemies in the current section. To to so, Daffy is armed with a bubble gun. Shooting bubbles at enemies makes most of them float away, some however are invulnerable and must be avoided. Daffy can upgrade his gun via bubble power-ups, making it shoot faster, in different patterns or with more power. Also available are magic wand power-ups which summon a \"fairy duck mother\", preventing Daffy from losing a life by absorbing the next hit - otherwise, each hit is instantly fatal. Golden clipboards give continues while dollar signs, gold coins and diamonds can be collected for points. Not every level contains one of the Movie Awards, and collecting them isn't even necessary to finish the game. Yosemite Sam won't be pleased however if not all are recovered.</p>"},{"name":"Dallyeora Piguwang","year":1995,"developer":"Open Production"},{"name":"Danan the Jungle Fighter","year":1990,"developer":"SEGA Corporation","url":"b#Danan%20-%20The%20Jungle%20Fighter%20%28Europe%2C%20Brazil%29.zip","filesize":142946,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > RPG elements","desc":"<p>Long ago, in the distant land of Moralos, in a time when vast jungles still covered the Earth, an evil presence emerged from its tomb beneath the ground. His name was Gilbas, and he was about to destroy the inhabitants of the land. Aganan, a great warrior, was summoned to save the troubled land and put an end to Gilbas by sealing him in the tome from where it came.</p><p>Unfortunately, Gilba was successfully resurrected and another warrior, Danan, was called. His quest is to locate the three sacred objects that Aganan used to defeat Gilbas: \"The Orb of Light\", \"The Amulet of Light\", and \"The Knife of Light\". </p><p>There are about four rounds to complete, and has Danan going through exotic locations defeating enemies such as valkyries, ogres, bees, spiders, and several others. At the end of each round, you come face to face with a boss, which takes quite a number of hits to kill with your sword. Once they are defeated, they are likely to give you one of the objects that you need to defeat Gilbas. More to the story is then revealed.</p><p>Assisting you with your journey are three animals: an eagle, a monkey, and some other animal that I am unfamiliar with. To get these animals to help you, however, you will need to collect three of their tokens that are found in yellow chests. These animals are quite useful in dangerous situations. The eagle, for example, can get a hold of you and fly you to safety if more than one type of enemy surrounds you. Anyway, you can get these animals to help you at any place, at any time, as long as you have three of its tokens. Yellow chests can also reveal extra strength, extra time, or extra health.</p><p>The game ends when you run out of time, or when you lose your health, and there are no second chances, unless you manage to find some elixirs, which are rare. </p>"},{"name":"Dead Angle","year":1989,"developer":"Seibu Kaihatsu Inc.","url":"b#Dead%20Angle%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":111248,"score":5.9,"genres":"Action > 1st-person > Behind view > Shooter","desc":"<p>In this game you play the role of a man whose girlfriend has been kidnapped by a ruthless mafia boss and you need to find her quickly. </p><p>The gameplay involves you having to shoot all the mafia henchmen before being able to fight the level boss. The game is view as a 1st person/3rd person hybrid where you are shooting in first person but you can see the outline of your character. To avoid getting shot you have to make sure you are not in front of an enemy as when you are your outline turns red and you are vulnerable. You can duck for cover but you automatically pop up after a few seconds so timing is everything. There is also a time limit for each level and more enemies to kill as the game progresses.</p>"},{"name":"Deep Duck Trouble starring Donald Duck","year":1993,"developer":"Aspect Co., Ltd.","url":"b#Deep%20Duck%20Trouble%20Starring%20Donald%20Duck%20%28Europe%2C%20Brazil%29.zip","filesize":250655,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>Donald meets Hewey, Dewey and Louie, back from their latest adventure with Uncle Scrooge. But Uncle Scrooge has been cursed by a pendant he found while adventuring, and is now floating in the air like a balloon! He gives Donald his adventurer's diary and asks Donald to retrace his steps and return the pendant to its rightful place - this is the only thing that will return Scrooge to normal.</p><p><em>Deep Duck Trouble</em> is a platform game where you play as Donald Duck. You must make your way through four different areas of the island - the jungle, an inlet, a volcano, and a valley - and defeat bosses at the end of each area. Donald can defeat enemies by jumping on their heads. He can also defeat them by kicking bricks which will may then hit his enemies. Donald's trademark temper also comes into play: if he eats a chili pepper, he will become furious and plough through anything in his way, whether it be bricks or enemies!</p>"},{"name":"Desert Speedtrap starring Road Runner and Wile E. Coyote","year":1993,"developer":"Probe Software Ltd.","url":"b#Desert%20Speedtrap%20Starring%20Road%20Runner%20and%20Wile%20E.%20Coyote%20%28Europe%2C%20Brazil%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":191237,"score":6.5,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>This is a platform game starring Looney Tunes famous Road Runner(who you control) and nemesis Wile E. Coyote. Road Runner can jump,  eat birdseed to replenish life and run,  of course! Holding the D-pad down speeds him up. The clock is ticking and if you run out of time a try is lost,  collecting stars adds time to the clock.</p><p>There are various items/powerups and bonus areas. 3 difficulty settings,  choice to play with or without music and/or sound effects and an option to play the game music while not in game.</p>"},{"name":"Desert Strike: Return to the Gulf","year":1992,"developer":"Electronic Arts, Inc.","url":"b#Desert%20Strike%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":202897,"score":7.8,"genres":"Action > Diagonal-down > Isometric > Shooter > Helicopter > Contemporary > Middle East > War","desc":"<p>The first game in the Strike series. A year after the Gulf War, a self-styled general named Kilbaba (Muababa in the GBA version) takes over an Arab Emirate and threatens to start World War III against his western enemy, the United States. The whole world holds its breath as the President has chosen you to destroy Kilbaba and his terrorist army before he launches a nuclear attack on the world!</p><p>You must fly a specially designed AH-64A Apache on a series of missions to rescue missing-in-action characters, destroy power plants, blow apart SCUD missiles, etc. to take out the enemy defense while trying to find out Kilbaba's plans.</p><p>The player controls the helicopter from an overhead, isometric perspective. The Apache is equipped with three weapon types: a machine gun and two types of missiles of different strength. During the missions, the player must beware anti-aircraft guns, missile launchers and tanks, outmaneuvering enemy fire or destroying the enemy weaponry. The Apache is destroyed if its fuel runs out, or if the armor (functioning as health) is completely depleted. However, armor can be replenished by bringing back MIA soldiers and prisoners of war back to the landing zone. There are also fuel, ammo and armor pickups available on the field.</p>"},{"name":"Dick Tracy","year":1990,"developer":"SEGA Enterprises Ltd.","url":"b#Dick%20Tracy%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":99985,"score":6.8,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Shooter > Licensed","desc":"<p>This is one of the games based on the Dick Tracy movie. You are Dick Tracy, a police detective who enjoys a peaceful life with his wife. But his wife's father is murdered by a local gangster named Big Boy Caprice, and Dick Tracy is now out for revenge. The game doesn't follow the exact plot of the movie, but simply lets Dick Tracy fight his way through several levels until he faces his archenemy.</p><p>This is a platform shooter/\"beat-'em-up\" game. Plenty of gunmen will attack our hero from all the sides. Dick can only move to the right or to the left. He can use his pistol gun to take out enemies who are in front or behind him. Since he can't approach enemies who attack from the depth of the screen, he can dispose of them using his machine gun. When the enemy is too close, Dick will punch him instead of shooting.</p>"},{"name":"Digger Chan","year":2011,"developer":""},{"name":"Dinobasher Starring Bignose the Caveman","year":1993,"developer":"Optimus Software","url":"b#Dinobasher%20Starring%20Bignose%20the%20Caveman%20%28Europe%29%20%28Proto%29.zip","filesize":140276,"score":"","genres":"","desc":""},{"name":"Disney's Aladdin","year":1994,"developer":"SIMS Co., Ltd.","url":"b#Aladdin%20%28Europe%2C%20Brazil%29.zip","filesize":285145,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Sega's 8-bit systems received a unique adaptation of Disney's 1992 animated film <em>Aladdin</em>.</p><p>Like other versions, it is a side-scrolling action game. The player controls Aladdin, making his way through a variety of locations, including the streets of Agrabah, the Cave of Wonders, the Sultan's palace and more. Gameplay takes several different forms: some levels are chases, where Aladdin runs automatically, but must be made to jump over chasms or rolling rocks and barrels, evade falling objects and avoid getting caught by a guard. Other levels are platforming affairs: Aladdin must run, jump and climb, find keys or switches to open doors while searching for the exit. Rocks can be collected and be thrown to dispatch enemies or hit buttons otherwise out of reach. Finally, there are also several magic carpet rides in the game, in which the level scrolls automatically and the player must make sure to avoid any obstacles in the way.</p>"},{"name":"Disney's Ariel the Little Mermaid","year":1996,"developer":"BlueSky Software, Inc.","url":"b#Ariel%20the%20Little%20Mermaid%20%28Brazil%29.zip","filesize":106635,"score":5.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Help either Ariel, the gleeful little mermaid, or Triton, her father, foil the evil Ursula, who has transformed everyone into small, green worm-like creatures, including the character you don't initially choose.</p><p>Rescuing requires you to simply swim into the unfortunate little victims as they hang about at fixed places in the watery world; while fending off and dodging enemies like eels, clams, sharks, and several other sea meanies. Friends like Flounder and Sebastian can also be summoned for a little helping hand.</p>"},{"name":"Disney's Bonkers: Wax Up!","year":1998,"developer":"Al Baker & Associates","url":"b#Bonkers%20Wax%20Up%21%20%28Brazil%29.zip","filesize":302787,"score":6.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Madame Who-Said has been coating famous Toons in wax to make statues for her Wax Museum, and the next victim will be Bonkers! Now he needs to stop her, free his pal Lucky and find the Toon Toaster to un-wax the Toons.</p><p>In this platform game, the player controls Bonkers through several levels where he must find 7 pickle clues. By pressing the pause button, a compass is shown, with the number of remaining clues and the direction of the next one. Bonkers can run (by holding button 1), jump (button 2) , duck and slide (by running and pressing the opposite direction on the d-pad).</p><p>Bonkers will find several items to restore his health (like cups of coffee, donuts, slices of pizza and badges) as well as some bonus items. He'll also find some of his friends, like Marylin, who'll show him the way to bonus levels, where he must find pieces of the Toon Toaster. In these bonus levels, Bonkers will ride a mine cart in a rail course, trying to collect items.</p><p>After a row of sub-levels, Bonkers will have to fight a boss, usually villains from the TV show.</p>"},{"name":"Double Dragon","year":1988,"developer":"Technos Japan Corp.","url":"b#Double%20Dragon%20%28World%29.zip","filesize":98172,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Direct control","desc":"<p>Set in a post-apocalyptic New York, <em>Double Dragon</em> is the story of Billy and Jimmy Lee, twin brothers trained in the fighting style of Sou-Setsu-Ken. Together, they manage a small martial arts training school, teaching their students in self-defense. One day, Billy's girlfriend, Marian, is kidnapped off the street by the \"Black Warriors\", a savage street gang led by a man named Willy. The Black Warriors demand the Lee brothers disclose their martial arts secrets in exchange for Marian's freedom. The Lee brothers set out on a rescue mission to crush the Black Warriors and save Marian.</p><p>Using whatever techniques they have at their disposal, from the basic punches and kicks to the invulnerable elbow strike, as well any weapon that comes into their hands, the Lee brothers must pursue the gang through the city slum, industrial area and the forest before reaching their hideout to confront the big boss, Willy.</p><p>The NES version of this game also has an additional VS. fighting mode for one or two players. Players choose from a field of six different characters (Billy and 5 of the enemy characters) and enter into a one-on-one fighting match. Players have to punch, kick, jumpkick, and even use a weapon against their opponents until someone's health bar is fully drained. The winner is the last one standing.</p>"},{"name":"Double Hawk","year":1990,"developer":"Opera House Inc.","url":"b#Double%20Hawk%20%28Europe%29.zip","filesize":87673,"score":5.8,"genres":"Action > Behind view > Fixed / flip-screen > Shooter","desc":"<p>In the early 1990s, violence was spreading across the globe, and the disturbances centered exclusively around a group of international terrorists whose purpose is to terrorize and massacre the innocent. The United Nations ordered two seasoned veterans, John Jackson and Jack Thomas, to destroy the syndicate.</p><p><em>Double Hawk</em> has two settings: easy and difficult, and the gameplay is similar to Cabal, in which you have to kill a group of enemies before a meter runs out to proceed to the next level, and these enemies include soldiers, tanks, choppers, snorkelers, and more. Your journey will take you through jungles, wastelands, villages, seashore, and finally, to the mountain. During the way, you can get different power-ups that include bombs, machine guns, rapid fire, and more speed. There are five missions, consisting of four levels each, including a boss level.</p>"},{"name":"Dr. Robotnik's Mean Bean Machine","year":1994,"developer":"Compile","url":"b#Dr.%20Robotnik%27s%20Mean%20Bean%20Machine%20%28Europe%2C%20Brazil%29.zip","filesize":121694,"score":7.8,"genres":"Puzzle > Anime / Manga > Real-time > Falling block puzzle","desc":"<p><em>Dr. Robotnik's Mean Bean Machine</em> is a version of Puyo Puyo with a storyline involving characters from the Sonic the Hedgehog games. The evil Dr. Robotnik decides to turn the citizens of Beanville into robots. It's up to the player to save them from their doom. The player drops pairs of beans into the dungeons, trying to create groups of four in matching colors. He or she must challenge Dr. Robotnik's robots to a battle and defeat them, and eventually face the Eggman himself.</p>"},{"name":"Dragon Crystal","year":1991,"developer":"SEGA Enterprises Ltd.","url":"b#Dragon%20Crystal%20%28Europe%2C%20Brazil%29.zip","filesize":62018,"score":6.4,"genres":"Role-playing (RPG) > Top-down > Real-time > Fantasy","desc":"<p><em>Dragon Crystal</em> is a dungeon crawler with RPG elements, along the lines of classics such as Rogue or Nethack. Without relying on a story, the game throws you into a randomly generated world which you should explore carefully - and most importantly, where you must survive! The complex, maze-like levels reveal their structure only after you cover the corresponding map areas. Your goal in each level is to reach a teleporter which will take you to the next one. There are also a lot of random items scattered around - weapons, armor, money, and food. Money allows you to continue the game if you die, food prevents you from starving. The enemies are visible on screen, and you fight them in real-time combat, moving around and pressing direction arrows to strike with the equipped weapon. You are always accompanied by an egg which will eventually grow up to be a dragon if you have leveled up enough.</p>"},{"name":"Dragon: The Bruce Lee Story","year":1995,"developer":"Virgin Interactive Entertainment (Europe) Ltd.","url":"b#Dragon%20-%20The%20Bruce%20Lee%20Story%20%28Europe%29.zip","filesize":125280,"score":5.4,"genres":"Action > Side view > 2D scrolling > Platform > Martial arts > Licensed","desc":"<p>Based on the 1993 movie of the same name, <em>Dragon: The Bruce Lee Story</em>  has Bruce Lee learn that he was born in America and he sets off to explore this new land. However it is a dangerous place and must fight to survive.</p><p><em>Dragon: The Bruce Lee Story</em> is a side-scrolling action game. Bruce Lee travels through various locations and engages enemies in martial arts. As Bruce Lee, the player can jump and attack. The direction button being pressed at the time of the attack determines whether Bruce will Punch, Roundhouse Kick or Low Kick. Power-ups are scattered throughout the levels and can be activated by attacking them. Bruce has a health meter at the top of the screen, when it is depleted he loses a life.</p>"},{"name":"Dynamite Duke","year":1991,"developer":"Seibu Kaihatsu Inc.","url":"b#Dynamite%20Duke%20%28Europe%2C%20Brazil%29.zip","filesize":93168,"score":5.9,"genres":"Action > Behind view > 2D scrolling > Arcade > Shooter","desc":"<p>Duke, armed with a machine gun and cybernetic arm, walks sideways through enemy bases, shooting snipers and engaging in hand-to-hand combat with bosses and the occasional knife-wielding soldier. An over-the-shoulder perspective is used throughout.</p>"},{"name":"Dynamite Dux","year":1989,"developer":"SEGA Corporation","url":"b#Dynamite%20Dux%20%28Europe%2C%20Brazil%29.zip","filesize":134815,"score":6.6,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler","desc":"<p>Side-scrolling beat 'em ups in which you must rescue a trapped female friend are nothing unusual. Being able to use direct-combat moves as well as collecting bonus weapons, and food for energy recharging, is pretty typical as well. Games of this type that were converted from the arcade to home computers are particularly commonplace - Renegade and the Double Dragon series are famous examples.</p><p>Where this one stands out, however, is the setting of your character as a duck called Bin (and his red buddy Pin), and with motion having a clear waddling appearance. The enemies to fight are all from the animal kingdom, but somewhat warped - crocodiles with boxing moves and cows armed with rocket packs for example. Bin has six levels to clear before he can rescue Lucy from Achacha's clutches.</p>"},{"name":"Dynamite Headdy","year":1995,"developer":"Treasure Co., Ltd.","url":"b#Dynamite%20Headdy%20%28Brazil%29.zip","filesize":199340,"score":8,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Regional differences","desc":"<p><em>Dynamite Headdy</em> is a platformer... with a difference. You control a little character whose main attack comes from his disembodied head. Yes, years before Rayman appeared, we already had a hero who used detachable appendages to attack his enemies.</p><p>Rather than the traditional power-ups, <em>Dynamite Headdy</em> enables you to swap your head for different kinds – such as heads that heal you or heads that stick on to walls. You use your head in order to climb up on platforms as well, as you can grab hold of things with it, and on certain stages of the Mega Drive/Genesis version it is used to turn the game into a side-scrolling shooter, as you gain a propeller, jet, or bird head. Basically, <em>Dynamite Headdy</em> is just a traditional platformer at heart.</p>"}]