[{"name":"Eagles 5","year":1990,"developer":""},{"name":"Earthworm Jim","year":1997,"developer":"Shiny Entertainment, Inc.","url":"b#Earthworm%20Jim%20%28Brazil%29.zip","filesize":251295,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Comedy","desc":"<p>A crow is chasing a worm named Jim, while in outer space Psy-Crow is chasing a renegade ship. The ship's captain has stolen an ultra-high-tech-indestructible-super-space-cyber-suit and Queen Slug-for-a-Butt has ordered Psy-Crow to get it, since it can make her more beautiful than Princess-What's-Her-Name. Psy-Crow blasts the captain and the suit falls to Planet Earth.</p><p>Back on Earth, Jim wonders if he is finally safe when an ultra-high-tech-indestructible-super-space-cyber-suit lands on him. Luckily Jim rests in the neck ring of the suit. The space particles then begin interacting with Jim, causing a light-speed evolution. Jim soon realizes he is in control of the suit.</p><p>Jim overhears the Queen's plans for the suit and decides to meet this Princess...</p><p><em>Earthworm Jim</em> is a 2D side-scrolling platformer with action elements where the player takes control of Jim, a worm wearing a spacesuit. Jim can shoot enemies with his gun or use his body (the spacesuit's \"head\") in a variety of ways to overcome obstacles, such as whipping it at enemies, grappling hooks to swing from them, or making it spin very fast like a rotor to hover for a short time.</p><p>While most of the game is made of standard platforming levels with a boss waiting at the end, some of the levels introduce different conditions than just reaching the end to complete them, like escorting a computer-controlled character and making sure they don't get hurt. Platforming levels are interspersed with some variations in gameplay as well, such as several space racing sequences or a bungie-jumping competition.</p>"},{"name":"Ecco the Dolphin","year":1993,"developer":"Novotrade Software Kft.","url":"b#Ecco%20the%20Dolphin%20%28Europe%2C%20Brazil%29.zip","filesize":221932,"score":7.2,"genres":"Action > Side view > 2D scrolling > Puzzle elements","desc":"<p>Travel through time along with Ecco the dolphin, in the only game that could call itself a \"dolphin simulator\". Indeed, you can do pretty much everything a typical dolphin does, including eating fish, surfacing in order to breathe, using your biological sonar and of course, jumping out of the water to amaze your friends.</p><p>The storyline is actually deeper that one may think by looking at the box illustration. As Ecco, you are the only dolphin who managed to escape from a giant whirlpool which sucked down your entire pod. The five shining stars on your forehead show that you are the chosen one to save them. But that task will be not be an easy one, as you will have to travel through time and space with the Atlantean time machine, and meet the mystical Asterite in order to defeat the Vortex Queen.</p><p>The main part of the gameplay in <em>Ecco the Dolphin</em> relies on exploring various aquatic levels. They are usually nonlinear, with submerged caverns and tunnels branching out from the main bodies of water. The navigation is impeded by islands that must be hopped over, volcanoes that spit hot lava, powerful currents, deadly spikes, and dangerous predators such as octopi and giant eels. The sonar ability has multiple functions: you can communicate with friendly animals, map out the nearby area (echolocation), activate glyphs, and eventually defeat enemies. Activating glyphs is necessary because they can unlock unexplored parts of the current level, including the exit that leads to the next area; some of them can even bestow the gift of invincibility on Ecco for a limited time.</p><p>You must keep an eye on the life and breath meters. Dolphins can't stay underwater for a long period of time and must return to the surface for air. However, the cavern systems may hide the occasional pocket of air as well. Every time you are hit by spikes, lava, or an enemy, Ecco loses health, and once it reaches zero you will have to replay the level from the beginning. The life meter can be replenished by eating fish or by finding healing clams, called the Shelled Ones, and communicating with them. It's possible to avoid most enemies, but Ecco can kill troublesome creatures using the death sonar or by charging them head-on.</p>"},{"name":"Ecco: The Tides of Time","year":1996,"developer":"Novotrade Software Kft.","url":"b#Ecco%20-%20The%20Tides%20of%20Time%20%28Brazil%29.zip","filesize":221272,"score":7.7,"genres":"Action > Side view > 2D scrolling > Puzzle elements","desc":"<p>The followup to Ecco the Dolphin, in which Ecco successfully destroyed the Vortex. Unfortunately, it turns out that the Vortex Queen followed it to the Earth and eventually destroyed the Asterite. All the world's oceans are threatened, and actually already doomed.</p><p>In order to restore the Asterite and finally defeat the Vortex Queen, Ecco will have to confront once again the tides of time, which have split into two possible futures, the regular one and the dark one dominated by the Vortex Queen.</p><p><em>Ecco: The Tides of Time</em> features even better graphics than its predecessor, and introduces a new gameplay mode in which the camera follows the dolphin from behind instead of from the side.</p>"},{"name":"Enduro Racer","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Enduro%20Racer%20~%20Super%20Cross%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":78577,"score":6.1,"genres":"Racing / Driving > Sports > Diagonal-down > Isometric > Motorcycle","desc":"<p>In this game you play the role of an endurance bike racer. The gameplay involves you racing against the clock to get to the finish line and jumping over ramps. At the end of each race you get points for how many cars or bikes you have overtaken with which you can upgrade your bike.There are various different terrain for you to race on including desert beach and dirt tracks plus a number of things to slow you down or even knock you off of your bike all together. The main idea is to find the best route through each level to shave off valuable seconds in order to over take more cars and bikes.</p><p>The Japanese version of the game has more Tracks than the European and US versions have. Among  them is a snow track which is one of the hardest tracks in the game, because there are a lot of stones on the thin road.</p>"},{"name":"ESWAT: Cyber Police","year":1990,"developer":"SEGA Enterprises Ltd.","url":"b#E-SWAT%20%28USA%2C%20Europe%2C%20Brazil%29%20%28Rev%201%29.zip","filesize":140539,"score":5.7,"genres":"Action > Side view > 2D scrolling > Platform > Shooter","desc":"<p>Crime is getting out of control in Liberty City, and to combat the problem, the LCPD establishes a new unit, called ESWAT (Enhanced Special Weapons and Tactics). Police officers who are promoted to this unit wear a cyber-suit that contains state-of-the-art military equipment including two Turbo-Booster Thrusters, extra ammunition, and increased protection. In order to become an ESWAT member, all a dedicated police officer has to do is arrest enough criminal masterminds to progress through the ranks, which include Captain, Assistant Chief, and Chief.</p><p><em>ESWAT: Cyber Police</em> is a horizontal-scrolling beat 'em up where you have to make your way from left to right and defeat a mastermind. There are 15 stages to complete, and have you patrolling through Liberty streets, car yards, stadiums, restaurants, the CBD, construction sites, and boat docks. While you're out on patrol, you can pick up ammunition, and the amount you get varies. For example, on some levels, ammo may be worth 10 bullets, while in others, you may get 60 bullets. Once you have obtained the cyber-suit, you wear it for the duration of the game.</p>"},{"name":"Excellent Dizzy Collection, The","year":1994,"developer":"Interactive Studios","url":"b#Excellent%20Dizzy%20Collection%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Proto%29.zip","filesize":99615,"score":"","genres":"Compilation","desc":"<p><em>The Excellent Dizzy Collection</em> compilation collects three Dizzy games previously released for the Aladdin Deck Enhancer:</p><ol><li>Dizzy the Adventurer</li><li>Panic Dizzy</li><li>Go! Dizzy Go!</li></ol><p>Go! Dizzy Go! is a Adventures of Lolo arcade-style puzzle game.</p>"}]