[{"name":"F16 Fighting Falcon","year":1985,"developer":"Nexa Corporation","url":"b#F-16%20Fighting%20Falcon%20%28USA%29.zip","filesize":21399,"score":4.7,"genres":"Action > 1st-person > Flight / aviation > Vehicular combat","desc":"<p>In this game, you are flying the F-16 Fighting Falcon, the most advanced jet fighter in the world. In this carefully crafted simulation, your mission is to take down all enemy jets and remain airborne as possible.</p><p>You are equipped with your standard gun, plus some missiles that you can use to take them down. There are ten levels. The number of missiles you have vary between each level. Furthermore, each level is difficult than the last with more enemy jet fighters that you have to take down.</p>"},{"name":"Fantastic Adventures of Dizzy, The","year":1993,"developer":"The Codemasters Software Company Limited","url":"b#Fantastic%20Dizzy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":191019,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>The evil wizard Zaks has cast a spell on the peaceful Yolkfolk, and while many fell under his spell, others have other problems to deal with, including Dizzy, who saw his girlfriend Daisy kidnapped and taken hostage by Zaks, and it's up to him to restore the Yolkfolk to normal and rescue Daisy from the top of the Cloud Castle's tower.</p><p>The most technically-advanced of Dizzy's adventure games in many ways, it was the only one to feature actual scrolling rather than a flick-screen system, the only one not to be released for the 8 bit computers the character originated on, the only one to originate on a console, as well as featuring many mini-games, such as <em>Bubble Dizzy</em> and an <em>Operation Wolf</em> clone. </p><p>Gameplay involves walking Dizzy through the levels, picking up objects and using them to solve simple puzzles. There are plenty of tests of arcade skill along the way as well, as gaps must be jumped and baddies avoided - starting with a limited number of lives, the player can earn more by completing Theodore's puzzle. Before rescuing Daisy the player must capture all stars that unlock the gates of the tower.</p><p>This game was later re-released on the NES with an updated Aladdin cart version. Updates include the number of collectible stars have increased from 100 stars to 250 stars, Dizzy now walks at a brisker pace, there are small terrain differences, some item placements have been rearranged, and the inventory system has become more simplified.</p>"},{"name":"Fantasy Zone","year":1986,"developer":"SEGA Enterprises Ltd.","url":"b#Fantasy%20Zone%20%28World%29%20%28Rev%201%29.zip","filesize":78403,"score":7.3,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The Fantasy Zone is a solar system consisting of eight brightly colored, fantastic planets. The evil Menons are trying to take over all of the planets in the Fantasy Zone by using misappropriated foreign currency to build their forces. It is the player's job to recover all of the coins and save the solar system! </p><p><em>Fantasy Zone</em> is an arcade style shooter for one or two players. The goal is to destroy all of the creatures on each planet and collect as many of the lost coins as possible. At the end of each level is a large enemy that will have to be defeated before moving on to the next world. At various points in the game, the player will be able to find a parts shop, which allows purchasing improvements for his spaceship, including better weapons and faster engines.</p>"},{"name":"Fantasy Zone II","year":1987,"developer":"SEGA Corporation","url":"b#Fantasy%20Zone%20II%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":162180,"score":7.4,"genres":"Action > Side view > 2D scrolling > Shooter","desc":"<p><em>Fantasy Zone II: The Tears of Opa-Opa</em> is the sequel to Fantasy Zone, in which you control Opa-Opa, a pretty colored ship with wings on its side. You must destroy the large creatures in each world before moving on to the next. Your task becomes difficult by other small creatures that happen to pass by. If you destroy a large creature, they will drop a dollar bill, which you can pick up and use at the shop to buy items and powerful weapons such as laser beams, x-way shots, and big wings. Another way to get money is to shoot certain kinds of enemies all in a row.</p><p>More often than not, some large creatures will reveal a warp gate rather than a dollar bill. You can go through the warp gate to get to another part of the land, and destroy more large creatures. Only one of them will have a warp gate in the form of a 'stop' sign - that is your ticket to the round boss, but you must defeat all large creatures in order to pass through it. Also like in the original can you walk on the ground to avoid approaching enemies, and spend money in the shop to get new weapons (but they only last for a limited time).</p>"},{"name":"Fantasy Zone: The Maze","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Fantasy%20Zone%20-%20The%20Maze%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":66603,"score":6.9,"genres":"Action > Top-down > Fixed / flip-screen > Arcade","desc":"<p>Sega decided to make their last game in the Fantasy Zone series different. You see, the gameplay now involves you going around mazes, collecting all the dots while avoiding enemies. You are awarded points for each dot collected, but they vary depending on their size. For example, small dots award ten points each, while you get 200 points for each larger dot you collect. Once you have collected all the dots in the maze, the enemies will turn into coins, which you must quickly get in a strict time limit and you move on to the next maze. Just before this, though, you get a statistics screen that shows the amount of time that you spent in the maze. Points are also awarded, but sadly, if you spent over sixty seconds in a maze, you won't get any.</p><p>Every world you travel to consist of three mazes, and after you complete all three, a bonus round appears where the object is to collect all coins before time expires. While you are collecting the dots in the normal mazes, you must touch the enemy's energy, a flashing red spot within each maze to avoid 2nd-generation enemies from entering the mazes. Some power-ups can be collected, which consist of weapons and speed boosters (big wings), which can be collected by landing on the circle which it is in. However, you need money in form of the amount outlined just before each maze. If you land on a circle while you are short of cash, a 'NO SELLING' sign will appear above it, and you have to collect some more dots and try again. </p><p>Also you can die by touching an enemy. When you die, a coin will take you place, and when you get resurrected, you can grab the coin. The game can be played with two players, but the same rule applies in a 2-player game.</p>"},{"name":"Férias Frustradas do Pica-Pau","year":1996,"developer":"Tec Toy Indústria de Brinquedos S.A."},{"name":"FIFA International Soccer","year":1996,"developer":"Extended Play Productions"},{"name":"Fire & Forget II","year":1990,"developer":"Titus France SA","url":"b#Fire%20%26%20Forget%20II%20%28Europe%29.zip","filesize":117703,"score":5.6,"genres":"Action > Racing / Driving > Behind view > Arcade > Automobile > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Part two in the Fire and Forget series, best described as Crazy Cars (also by Titus) with weapons in a futuristic setting. This game combines the genres action and driving.</p><p>In each of the five levels you need to blow your way to the front of the death convoy and shot down the leader of a group of terrorists, who plans to blow up a city. Your machine of destruction is a car with the ability to fly.</p>"},{"name":"Fire & Ice","year":1996,"developer":"Graftgold Creative Software"},{"name":"Flash, The","year":1993,"developer":"Probe Software Ltd.","url":"b#Flash%2C%20The%20%28Europe%2C%20Brazil%29.zip","filesize":185158,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Flash</em> is a side-scrolling platformer starring the eponymous D.C. comics hero. The game is divided into six rounds, each round has two stages and a boss fight. Within each stage, Flash must get to the exit before the time limit runs out, though the exit must first be unlocked by activating a switch.</p><p>Apart from a speedy protagonist, the game has some similarities to Sonic the Hedgehog, as the levels have a similarly complex structure with different passages and many optional areas.</p><p>While Flash moves very fast in general, he can also move with even higher SuperSpeed, but only as long as the necessary SuperSpeed energy is not drained. The energy is also used for performing vibrating attacks and can be recharged by at Star Food vendors scattered in the levels. Vibrating attacks can be used to destroy blocks (which contain either traps or power-ups) and to get rid of bad guys. For the latter, Flash also has a spin attack. He can use it only while moving, but no energy is required.</p>"},{"name":"Flashpoint","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Flintstones, The","year":1991,"developer":"Teque Software Development Ltd.","url":"b#Flintstones%2C%20The%20%28Europe%2C%20Brazil%29.zip","filesize":105121,"score":6,"genres":"Action > Side view > Fixed / flip-screen > Platform > Bowling > Automobile > Prehistoric > Licensed","desc":"<p>The Flintstones is a game based on the popular cartoon series The Flintstones by Hanna-Barbera Productions Inc.</p><p>It's weekend! Fred Flintstone thinks of only one thing: bowling with his friend and neighbor Barney.Unfortunately, his wife Wilma got other plans for him. Fred has to paint the living room and Wilma is not going to help him with it. No, she goes shopping.And if that's not enough, Wilma also tells Fred that his mother-in-law is coming over.</p><p>The Flintstones game is divided in four parts.</p><p><strong>Part 1:</strong> Painting the walls of your living room.To go to the bowling alley before it is closed Fred has to paint the walls as quickly as possible. To paint the walls Fred uses the tail of a living squirrel. Pebbles tries to leap out her playpen and starts crawling around and starts scribbling on the walls. If Fred wants to put Pebbles back in the playpen then he has to drop the squirrel, that immediately starts wandering off. When Pebbles is back in the playpen Fred has to chase the squirrel and dip its tail in the paint again.</p><p><strong>Part 2:</strong> Driving your car on the way to the bowling center.Finally, when all walls are painted Fred can go to the bowling alley!Fred has to drive to the bowling alley but unfortunately the roads are in a very bad condition. The road surface is dire and covered with rocks!And if one of the wheels hit a bump it will break off the car and disappear into the distance.</p><p><strong>Part 3:</strong> A bowling competition between Fred and Barney.At the bowling alley the following bowling parameters can be set: the spin and speed of the ball and the starting position of the player.Each turn gives two throws (except he gets a strike). A game takes ten turns. while a match takes three games.</p><p><strong>Part 4:</strong> Saving Pebbles at a construction site.On his way home Fred discovers that Pebbles has disappeared! Don't let Wilma find that out!Fred finds Pebbles at a construction site on top of some scaffolding. He has to climb the scaffolding to rescue her.If Fred fails to rescue his daughter then Barney rescues her and Fred will be branded as a failure!</p>"},{"name":"Forgotten Worlds","year":1991,"developer":"Capcom Co., Ltd.","url":"b#Forgotten%20Worlds%20%28Europe%2C%20Brazil%29.zip","filesize":153920,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Forgotten Worlds</em> features two characters known as The Nameless Ones, who both look like Arnold Schwarzenegger, one even has a mohawk. It's their job to rid the planet of the attacking aliens. </p><p>Guiding your character around the screen as they fly with jet-packs, guns on full auto, you control a satellite which you rotate around your character for the direction in which your gun is firing. At the end of each level is a boss which needs to be killed to progress.</p><p>Enemies that have been killed drop money. At the end of every level is a shop where you can buy weapons, armour, items and first-aid packs.</p>"},{"name":"Formula One","year":1993,"developer":"Lankhor","url":"b#F1%20%28Europe%2C%20Brazil%29.zip","filesize":71373,"score":7.5,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Oceania > Licensed","desc":"<p><em>F1</em> is an Official Formula One Racing Game. There are two modes of play available: \"Arcade\", \"Grand Prix\". In both of these modes you complete a certain number of laps (4, 8, or 12) and select which circuit that you want to race on. The circuits include San Marino, France, Britain, Germany, Italy, Portugal, Japan, and Australia. Some circuits are easy, while some are difficult. </p><p>There are slight differences between the two modes. For instance, \"Arcade\" allows you to select the circuit in any order that you like, whereas \"Grand Prix\" only allows you to fine-tune your car before starting a race. You also need to race a circuit in the order that they appear on the circuit selection screen, but you can skip a track if you want. </p><p><em>F1</em> is a 1-2 player game, meaning that if you have another player handy, you can compete against each other.</p>"}]