[{"name":"G-Loc: Air Battle","year":1991,"developer":"AM R&D Dept. #2","url":"b#G-LOC%20Air%20Battle%20%28Europe%2C%20Brazil%29.zip","filesize":106852,"score":6.1,"genres":"Action > 1st-person > Behind view > Arcade > Flight / aviation > Vehicular combat","desc":"<p>The Citizens Defence Force does not trust the United Nations to keep a troubled 21st century world at peace. It confiscates a horde of planes and warships, and as a UN loyalist, it is your job to shoot them down. Solving starvation and disease can wait, apparently.</p><p>The game is split into 8 stages, which are split into sub-stages over land and sea, each of which has a strict time limit, and a target number of planes to shoot down. They take place from behind your plane, which can be controlled with ‘up’ referring to ‘climb’ or ‘dive’, depending on player preference. You are armed with 10 missiles as well as standard weapons. The plane can survive a few hits, so watch the damage report as it goes from red to black. </p><p>Fail to complete a section in the time limit and you use up a continue, but the amount of planes previously shot down is not reset, making the second attempt easier Chase HQ style. As you destroy enemies you gain access to better planes, and the rank reported at the end of the game improves – this is also dependent on the skill level you play at.</p>"},{"name":"Gaegujangi Kkachi","year":1993,"developer":"Hicom Entertainment"},{"name":"Gain Ground","year":1990,"developer":"SEGA Enterprises Ltd.","url":"b#Gain%20Ground%20%28Europe%2C%20Brazil%29.zip","filesize":119308,"score":6.8,"genres":"Action > Strategy > Top-down > Fixed / flip-screen > Real-time > Arcade > Fantasy > Sci-fi / futuristic","desc":"<p><em>Gain Ground</em> is an arcade style action game with a bit of strategy thrown in. The goal is get all of the soldiers to the opposite side of the screen or to kill all of the enemies. Each soldier in the army has a unique specialization, from among 20 types. Each soldier can attack in two different ways, using either a normal weapon or a special weapon. The strategy comes from deciding which soldier would do best in which situation. Some weapons are better at dealing with certain enemies and obstacles than other weapons.</p><p>Players start with only three soldiers but can encounter other soldiers that can be rescued, by touching them. If the new soldier survives long enough to reach the exit, they can be added to the soldier inventory. The number of possible soldier in a player's army is over 30 soldiers. There are 50 stages total, divided into rounds of 10. At the end of each round, players encounter an enemy boss.</p>"},{"name":"Galactic Protector","year":1988,"developer":"SEGA Enterprises Ltd."},{"name":"Galaga","year":1985,"developer":"SEGA Enterprises Ltd."},{"name":"Galaxy Force","year":1989,"developer":"Sega R&D1","url":"b#Galaxy%20Force%20%28Europe%2C%20Brazil%29.zip","filesize":258695,"score":5.5,"genres":"Action > Behind view > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p><em>Galaxy Force</em> is a port of Galaxy Force II. It removes the energy meter, the speed controls and the fifth level. The enemy placement is largely revised.</p>"},{"name":"Gangster Town","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Gangster%20Town%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":72490,"score":7.2,"genres":"Action > 1st-person > Shooter","desc":"<p>In Gangster Town, you must use the Light Phaser to shoot unruly mobsters from the town, starting with a car chase, a walk through downtown, shootouts in a bar and nightclub and more. Bonus games, such as finding a key in a brick wall,  are included as you complete the game.</p>"},{"name":"Gauntlet","year":1990,"developer":"Atari Games Corporation","url":"b#Gauntlet%20%28Europe%2C%20Brazil%29.zip","filesize":82592,"score":7.4,"genres":"Action > Top-down > Arcade > Fantasy","desc":"<p><em>Gauntlet</em> is an action game where players choose characters and fight their way through hordes of enemies that assault them on the way to the end of the level. One or two players must make their way through 100 levels of mayhem and magic. </p><p>The game features a choice of four characters to play with, each with different weapons. Thor the Warrior has a bludgeoning battle axe, Thyra the Valkyrie has a close range sword, Questor the Elf has his long range bow, and Merlin the Wizard has magical bolts.</p><p>Ghosts, goblins and even the life-draining Death are among the enemies. Enemies stream out of generators, so destroy these before tackling the rest. </p><p>Keys are needed to open the many doors within the levels, and in some situations a door will contain only bonus items, not a progressive route. Scattered magic potions act like smart bombs and clear the screen of all enemies. Beware of poison though, this reduces the character's energy level.Treasure is abundant throughout the levels and adds to the player's score.</p>"},{"name":"George Foreman's KO Boxing","year":1992,"developer":"SIMS Co., Ltd."},{"name":"Geraldinho","year":1995,"developer":"SEGA Enterprises Ltd."},{"name":"Ghost House","year":1986,"developer":"SEGA Enterprises Ltd.","url":"b#Ghost%20House%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":22625,"score":5.8,"genres":"Action > Side view > 2D scrolling > Platform > Horror","desc":"<p>You're about to inherit the family jewels. If you can get to them, that is.</p><p>They're hidden inside the haunted mansion, which wouldn't be such a big deal if it weren't infested with Draculas, Bats, Fire Blowers, Mummies, and other deadly weirdos. You'll have to ward off or destroy everything that gets in your way -- no matter how grotesque it appears. Furthermore, you'll have to keep punching your way through the mansion until you find the secret key. You then have to use it to open one of the five coffins, defeat Dracula, capture the jewel he drops, and make your way out of the mansion.</p><p>You play the role of Mick, and everything is going to stop you from completing these tasks and making you way out of the mansion. You just have to punch, or jump on, your enemies to defeat them. And arrows will be flying from either direction and will attempt to hit you on the head, and you must either duck or jump on them for extra points. You can jump or touch lights to freeze everything on screen for a few seconds. Rather than punching, you can collect a sword on the lower level by jumping on it as it flies past you. The sword is useful when you fight Dracula or getting rid of Fire Blowers.</p><p>You start the game with three lives, and receive an additional life every 50,000 and 150,000 points. You also have an energy meter. You lose energy when you touch one of the monsters. When you run out of energy, you lose a life. You gain energy by collecting treasures scattered throughout the mansion, and it is restored when you kill a Dracula.</p>"},{"name":"Ghostbusters","year":1987,"developer":"Activision, Inc.","url":"b#Ghostbusters%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":65267,"score":6.5,"genres":"Action > Side view > Top-down > 2D scrolling > Licensed","desc":"<p>Based on the 1984 film of the same name, the Ghostbusters are the ones to call to \"bust\" any ghost hauntings. They do this through the use of nuclear-accelerated \"proton packs\" and \"ghost traps\", whereby the ghosts can be captured and transferred to a secure storage facility at their Headquarters. However New York City has suddenly become a very haunted place, and the number of ghosts has suddenly and dramatically increased. The Ghostbusters must reduce the paranormal psychokinetic energy, the \"PK level\" in the city, which represents ghost power, before the Temple of Zuul awakens and resurrects an evil goddess called Gozer.</p><p><em>Ghostbusters</em> is an action game that features an overhead-view and a side-view. From Ghostbusters HQ, the player must monitor a map of midtown Manhattan for \"ghost alarms\", as well as for casual, roaming spirits, and plot a route to the alarmed area. Once the route is plotted, the player then controls the purchased Ghostmobile as it drives through traffic. Here, the player is able to capture casual ghosts on the way if they are en route. When the haunted location is reached, the game switches to a side-view. Two of the Ghostbusters will take position, activate their proton beams, and toss a trap to the ground. The player must then use the two Ghostbusters to attempt to lead the ghost(s) over the placed trap. Once activated, the trap springs to capture any ghosts directly above it. A successful capture will earn the player money, which can then be used to purchase new Ghostbusters vehicles and new modifications for it. An unsuccessful capture will see the ghost fly away (after nastily sliming one of the Ghostbusters).</p><p>As the game progresses, the PK energy in the city increases. The Ghostbusters must keep it under critical levels by being constantly successful at busting ghosts. Eventually the Temple of Zuul will activate, and if the PK levels are still manageable, the Ghostbusters can venture there for a final showdown with Gozer.</p>"},{"name":"Ghouls 'N Ghosts","year":1989,"developer":"Capcom Co., Ltd.","url":"b#Ghouls%27n%20Ghosts%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":155374,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Direct control > Fantasy > Medieval > Horror","desc":"<p>Three years have passed since Arthur defeated the Demon King Astaroth and rescued his beloved Princess Prin-Prin (see Ghosts 'N Goblins). A new villain, the Great Demon King Lucifer (Loki in some versions) has become the new leader of Ghoul Realm. While returning from a journey, Arthur sees the Princess' castle and her village under attack by Lucifer's forces. While rushing towards her beloved knight, the Princess is struck by one of Lucifer's laser beams.</p><p>Now, Arthur must venture back to the Lucifer's palace and destroy the demon in order to rescue the Princess' soul and bring her back to life! And it won't matter whether he fights in his shining armor or in his underwear alone...the bravest Knight in the land isn't going to be stopped by some monsters! Although the game starts with graveyard and marsh territory familiar from the first game, later levels are set in a tower, a mass of skeletons, and a castle.</p><p>Players progress from left to right (from bottom to top in level 3), and have to hack down the aforementioned monsters with a sword. The journey includes ledges, ladders, lava pits and slippery slopes. Different weapons can be collected, by finding suits of armor inside chests. Each of the five stages has its own setting and a final boss.</p><p>In comparison to the first installment, gameplay was tweaked and some additions were made. Arthur can now fire vertically and is able to collect weaponry from fallen enemies. The landscape is littered with a number of treasure chests that erupt out of scenery, some of which are hidden and has to be found by way of a well-timed jump in a certain place. The treasure chest can be opened with projectiles resulting in one of three occurrences: the reward of a new weapon, some shiny new golden armour or a hostile wizard who turns the player into the old man or a duck. The golden armour gives Arthur a chargeable \"super\" attack which varied depending on the currently possessed weapon. These attacks range from a huge lightning bolt that cut a swathe both vertically and horizontally across the screen, to a spell that creates a mirror-like clone of Arthur, effectively doubling his attack power.</p>"},{"name":"Global Defense","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#/Global%20Defense%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":86719,"score":6.4,"genres":"Action > Side view > 2D scrolling > Shooter > Cold War > Sci-fi / futuristic","desc":"<p><em>SDI: Strategic Defense Initiative</em> is based around classic-style shoot 'em up action. It puts you in control of a satellite which must ensure that the wave of bombs aimed for the United States do not hit. Direction of motion and direction of fire are controlled independently - on the 16-bit versions you rotate the mouse left and right to direct the targeting, move it up and down to increase the range, and use the joystick to move the satellite and thus avoid any contact.</p><p>Each level is split into defensive and offensive stages. On defensive levels you must stop each unit as it heads towards the earth, a lá Missile Command. Offensive stages follow the old 'shoot it before it becomes a danger' philosophy, being free-flying shoot 'em up sections among a network of destructible (but worth saving) platforms.</p>"},{"name":"Golden Axe","year":1989,"developer":"Team Shinobi","url":"b#Golden Axe (USA, Europe, Brazil).zip","filesize":254442,"score":7.3,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Fantasy > Regional differences","desc":"<p><em>Golden Axe</em> is an arcade beat-'em-up game that puts players in the shoes of one of three heroes, each with his own reason for trying to overthrow the evil rule of Death-Adder, who - along with his forces of darkness - kidnapped and imprisoned the King and his daughter and stole the legendary Golden Axe.</p><p>This is a horizontal fighting game, where you basically take one of the three characters (the barbarian Ax Battler, a dwarf named Gilius Thunderhead or the amazon Tyris Flare) and bash everything which stands between you and Death Adder himself. Each character has a special magical ability that can be charged by kicking small blue creatures that drop a potion. There is also a green variety off this creature that drops food that replenishes your health. Some enemies ride dragons and a scorpion like creature. The enemies can be knocked off and you can mount the creature yourself and attack the enemies with it.</p><p>The game allows to play up to two players on a same screen, however in the C64 version this option has not been implemented. C64 version was also stripped off in the other areas, such as: only one enemy can engage the player at a time or there are only two types of dragons instead of three.</p>"},{"name":"Golden Axe Warrior","year":1991,"developer":"SEGA Enterprises Ltd.","url":"b#Golden%20Axe%20Warrior%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":145359,"score":7.6,"genres":"Action > Diagonal-down > Fixed / flip-screen > Anime / Manga > RPG elements > Fantasy","desc":"<p><em>Golden Axe Warrior</em> is a spin-off of the Golden Axe games, a series of side-scrolling Beat'Em Ups from Sega.</p><p>In ancient times a horde of giants rebelled against the elders and a brutal war ensued. Things looked grave until finally a hero, carrying the Golden Axe, appeared and drove back the giants. Since then, the kingdom of Firewood has been ruled by a family that had mastered the power of the nine crystals to ward off all evil from Firewood. Everyone lived in peace until one of Firewood's ministers betrayed his king and sold the nine crystals to Death Adder, one of the evil giants. Death Adder has hidden the nine crystals in nine dungeons, has unleashed hordes of monsters and is threatening to take over the world. Will there be another hero who can find the Golden Axe and defeat Death Adder?</p><p>Gameplay in <em>Golden Axe Warrior</em> is very similar to The Legend Of Zelda, meaning you will spend most of your time exploring the large overworld fighting against lots of enemies and looking for the dungeons in which the crystals are hidden. Inside the dungeons you have to fight more enemies, find treasures and keys, solve simple puzzles and defeat the dungeon's boss to get one of the crystals. In order to survive against the large number of enemies, you will be able to find many different weapons and three different spells.</p>"},{"name":"Golfamania","year":1990,"developer":"Sanritsu Denki Co., Ltd."},{"name":"Golvellius: Valley of Doom","year":1988,"developer":"Compile","url":"b#Golvellius%20-%20Valley%20of%20Doom%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":165994,"score":7.2,"genres":"Action > Diagonal-down > 2D scrolling > Platform > RPG elements","desc":"<p>In this game, you play Kelesis, a warrior who is sent to seek out Golvellius and rescue the beautiful Princess Rena. But in order to find him, you must defeat seven of his fiercest demons that were sent to stop you. These demons are found in caves throughout the valley floor, but in order to access these caves, you need to defeat some of the wild beasts that are scattered throughout the valley. When you kill these beasts, you will receive some gold, but when you are hit by these beasts, your energy will be lost. Some caves will appear when certain objects are struck with your sword. In some caves,you will find fairies, sorceresses, and wise women who will help you in many ways be increasing gold, giving you life potions, and restoring your energy.</p><p>There is a password save feature in this game. At the beginning of each area, you can enter a cave where a woman tells you what the password is, but if you die in the course of your quest, the password will already be revealed. By entering this password, you will be able to begin the game from the opening of the valley (if you get that far) with all your possessions intact.</p>"},{"name":"GP Rider","year":1993,"developer":"Sega AM8 R&D Division","url":"b#GP%20Rider%20%28Europe%2C%20Brazil%29.zip","filesize":210442,"score":6.5,"genres":"Racing / Driving > Behind view > Arcade > Motorcycle > Track racing > Oceania","desc":"<p><em>GP Rider</em> is an arcade like motorcycle racing game that players can race in all the tracks of all the 15 tracks of the 1989 Motorcycle Grand Prix. There is also an extra Arcade track for the player to race on.</p><p>There are 3 modes of play that are Arcade, Tournament, and Grand Prix. In Arcade the player races on only 1 track that is named Arcade. In Tournament players get to choose any number of tracks to race, from 0 (which defaults to the Arcade track) to all 15 available tracks. Grand Prix is where the player races in all 15 tracks in order of the 1989 season. </p><p>All races regardless of the mode played in the same way. The game is played on a split screen even if only one player is playing. A CPU character named Wayne controls the bike on the top screen if there is no other player playing. Wayne races like a real player would, having both good and bad races and occasionally making mistakes. The race is made up of a Qualify to determine gird position and then the Race where the player races 15 other races (including Wayne) over a predefined number of laps depending on track length. The track can raced in ether the wet or the dry (only dry in Arcade mode) and the weather can change from the Qualify to the Race. The races take place on flat roads with straights and curves simulating the layout of the real track. On the bike there is a fuel gage that simply counts down the seconds left of fuel and is automatically refilled at the completion of each lap. If the player doesn’t complete the lap before time runs out then the player will “Out of Fuel” and end the race in the placed down with other non-finishers. At the end of each race (accept in Arcade mode) the player will get points depending on there position before going onto the next race.</p><p>The player sets up the bike with some basic set ups that are all available from the start. In Arcade mode the player has the options of an Automatic or Manual gearbox with either High Gearing (better top speed) or Low Gearing (better acceleration). In Tournament and Grand Prix modes the options are extended to Engine type of Lean, Medium, and Thirsty which progressively adds speed while cutting the time available per lap. There is gearing that works the same as Arcade mode, and a tyre type of wet and dry depending on the weather.</p>"},{"name":"GP World","year":1986,"developer":"SEGA Enterprises Ltd."},{"name":"Great Baseball","year":1987,"developer":"SEGA Enterprises Ltd.","url":"c#Great%20Baseball%20%28USA%2C%20Europe%29.zip","filesize":1,"score":5.9,"genres":"Sports > Diagonal-down > Baseball","desc":"<p>Every play in the major league is brought to this diamond. So pitch, swing, and steal bases like the pros. Play ball !!</p><p>Play <em>Great Baseball</em> with another player or against the CPU. Next, choose to play with or against different teams including New York, Toronto, Milwaukee, Chicago, Seattle, Boston, and many others. Finally, select your pitcher and his specialty and stamina, and away you go.</p>"},{"name":"Great Basketball","year":1987,"developer":"SEGA Enterprises Ltd.","url":"c#Great%20Basketball%20%28World%29.zip","filesize":1,"score":5.6,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball","desc":"<p>Great Basketball is an 8-bit simulation of international basketball competition.  Choose from one of eight countries (USA, Canada, USSR, Japan, Cuba, Czechoslovakia, Italy, Hungary) and jump into the intense hoops action, featuring 5-on-5 play, defensive and offensive fouls, free throws, and three-point shots.</p><p>Single player mode is a double-elimination tournament.  Win a game, and you get to allocate bonus points to various RPG-style attributes like shooting, passing, and jumping.  There’s also a two player mode—but remember, only one team can win it all!</p>"},{"name":"Great Football","year":1987,"developer":"SEGA Enterprises Ltd.","url":"c#Great%20Football%20%28World%29.zip","filesize":1,"score":5.2,"genres":"Sports > Top-down > Football (American)","desc":"<p><em>Great Football</em> plays as a regular professional American football game. One has the option to choose from the AFC league or the NFC league and then choose from several fabricated teams such as the Bombers, Sharks, Beavers or Bucks.</p><p>During gameplay, one must choose from a number of play formations. The player can choose from running and passing plays to field goals and punting plays when the time is right.</p><p>In a one-player game, the player only competes on offense. The game starts out with the CPU ahead in score and the player must try to score enough points to win. The CPU will automatically kick-off after a possession is over, there is no defense to be played. In a two-player game, there is both offense and defense to be played. One must try to do whatever possible to win, whether it be through touchdowns and field goals on offense or interceptions and safeties on defense.</p>"},{"name":"Great Golf","year":1987,"developer":"SEGA Enterprises Ltd.","url":"c#Great%20Golf%20%28World%29.zip","filesize":1,"score":5.8,"genres":"Simulation > Sports > Behind view > Golf","desc":"<p>Keep your head down. Eyes on the ball. Grip the club firmly ... and swing. Welcome to the Sega Master's Tournament where you need to play better than \"par\" if you want to win.</p><p>So tee-up for some real fun. And remember to play with caution. This championship course has been groomed for a truly competitive challenge. Eighteen holes full of roughs, bunkers, and water hazards will put your nerves to a real test.</p><p>But not to worry. You've got some clever moves to meet the challenge of a \"dog leg\" fairway or a tricky green. So go for a sneaky slice or hard hook to outplay the rest. Winner takes all! FORE!</p>"},{"name":"Great Ice Hockey","year":1986,"developer":"SEGA Enterprises Ltd.","url":"c#Great%20Ice%20Hockey%20%28Japan%2C%20USA%29.zip","filesize":1,"score":4.5,"genres":"Sports > Top-down > Hockey","desc":"<p>In <em>Great Ice Hockey</em> one must use the Sega Sports Pad to play the game. One must stroke the roller ball to try and pass, skate, shoot and score! The team that ends up with the most goals as regulation time runs out wins.</p><p>The game plays as a regular hockey match. Two difficulty settings (junior and senior) are an option for amateur or more skilled players. The player is assigned the US hockey team and then can choose from a number of other opponents from various countries.</p>"},{"name":"Great Soccer","year":1987,"developer":"SEGA Enterprises Ltd.","url":"c#Great%20Soccer%20%28Europe%29.zip","filesize":1,"score":6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p>This version of <em>Great Soccer</em> is on the Sega cartridge. The other version of Great Soccer is on the Sega card and an entirely different game.</p><p>Dribble, pass, shoot and score! Two game selections are available to play. The first is a top-down perspective soccer game. The second is a 3rd-person perspective penalty kick contest. The team that scores the most goals in either game selection wins. However, if regulation time runs out in the regular soccer game mode, there will be a penalty kick shoot-off to determine the winner.</p><p>All the same rules apply to this soccer game as in a real life match. There are kickoffs, offside violations, slide tackles, corner kicks, out of bound throw-ins and goalie saves all during gameplay.</p><p>Choose from one of eight nations to compete in a match of professional soccer. The nations available are Argentina, West Germany, France, Brazil, Great Britain, Italy, USA and Japan —each with their own strengths and expertise.</p>"},{"name":"Great Volleyball","year":1987,"developer":"SEGA Enterprises Ltd.","url":"c#Great%20Volleyball%20%28USA%2C%20Europe%29.zip","filesize":1,"score":5.9,"genres":"Sports > Diagonal-down > 2D scrolling > Volleyball","desc":"<p>Assemble your six man team and take on the world! In volleyball, that is! Choose from one of eight different countries, including USA, the U.S.S.R., Cuba and Brazil, and play against the rest, either in goodwill matches, or on a worldwide tournament.</p><p>The game is very simple to play, and features a practice mode. You can try out the game mechanics there, and a coach judges your skill by yelling at you. If you fail to perform even the simplest tasks correctly, you'll have to do everything again.</p><p>Once you're confident enough to take on other teams, be sure to check out the tournament mode, where you play against the other teams to obtain the world cup!</p>"}]