[{"name":"Hang-On","year":1985,"developer":"SEGA-AM2 Co., LTD.","url":"b#Hang%20On%20%28Europe%29.zip","filesize":21620,"score":6.3,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Motorcycle","desc":"<p><em>Hang-On</em> is an arcade racing game, also bundled with the Master System and reminiscent of Pole Position, but with bikes. The player races against time, battling an unlimited amount of opponents on a highway. While the clock ticks down, he should try to maneuver past his opponents and to steer clear of obstacles on the side of the road. Beating the clock extends the time and draws a new backdrop to race in.</p>"},{"name":"Heroes of the Lance","year":1991,"developer":"Strategic Simulations, Inc.","url":"b#Heroes%20of%20the%20Lance%20%28Europe%2C%20Brazil%29.zip","filesize":255986,"score":6,"genres":"Action > Side view > 2D scrolling > Direct control > Fantasy > Licensed","desc":"<p>Based on the later parts of the <em>Dragonlance</em> book <em>Dragons of Autumn Twilight</em>, the heroes descend into a ruined city in search of the disks of Mishakal.</p><p>The gameplay consists of horizontal fighting with a maze like map using doors to change the view. The party consists of the 8 Heroes of the Lance, using one at a time and the player can switch between them at any time. Each character has different types of attacks and spells making them more suited to fighting different enemies as well as acting as lives.</p><p>One of the <em>AD&amp;D</em> games that takes a break from the usual RPG style.</p>"},{"name":"High School! Kimengumi","year":1986,"developer":"AM R&D Dept. #2"},{"name":"Home Alone","year":1993,"developer":"Probe Software Ltd.","url":"b#Home%20Alone%20%28Europe%29.zip","filesize":156410,"score":5.8,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Contemporary > Licensed","desc":"<p><em>Home Alone</em> is a 2D-sidescrolling platformer based on the 1990 movie of the same name. The player takes control of Kevin McCallister, who is accidentally left behind by his family when they go off on holiday. During this time, the burglars Harry and Marv break in, and Kevin must foil them.</p><p>Kevin is guided through several short levels in succession. To complete a level he needs to collect a number of valuables and lock them in a safe. Only a small amount of time is provided to complete the level as well as a limited number of tries. Levels consist of several floors. Kevin can move between them using stairs, beds that act as trampolines or using food lifts, boxes and cushions. There are also optional items such as hamburgers to collect for bonus points. Levels have an animal running around as well. Harry and Marv need to be avoided, they can be jumped over and they can be shot to stun them briefly. A shot burglar also spawns a bonus item. At the end of the level the score is calculated based on the points through collected items and the remaining time.</p><p>Levels are usually grouped in sets based around a theme such as Family House, Fun House, Green House, Power House and Haunted House. After an initial set of three levels, version four and five of each set are played switching the theme for each new stage. There are 29 levels in total. Each level introduces new graphics and environments, new types of items and ways to move between floors. There are also Bonus House levels without enemies where as many objects as possible need to be collected. Kevin then needs to dash to reach to the safe before time runs out or all the items are lost. There is no save function, password system or a level select; all levels need to be played in one go with the number of tries provided at the start.</p>"},{"name":"Hook","year":1992,"developer":"Ukiyotei Company, Ltd.","url":"b#Hook%20%28Europe%29%20%28Proto%29.zip","filesize":149731,"score":6.5,"genres":"Action > Side view > 2D scrolling > Fighting > Platform > Licensed","desc":"<p>In this video game adaption of the Steven Spielberg film <em>Hook</em>, the player takes the role of a grown-up Peter Pan, whose kids have been kidnapped by Captain Hook. Tinker Bell takes Peter back to Neverland where he must again become Pan and reclaim his children.</p><p>This particular interpretation is a side-scrolling action game, in which players must hack their way past Hook's denizens through 11 levels. These include forests, icy regions, and towns which Peter will have to jump, climb, and swim through. Magic items such as apples and pixie dust can be collected for special powers. When enemies are attacked, they simply put their hands up in surrender rather than dying, so as to make the game more child-friendly.</p>"}]