[{"name":"Impossible Mission","year":1990,"developer":"Epyx, Inc.","url":"b#Impossible%20Mission%20%28Europe%2C%20Brazil%29.zip","filesize":54678,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Sci-fi / futuristic > Spy / espionage","desc":"<p>You play a secret agent on a quest to stop the evil ProfessorElvin Atombender, who is believed to be tampering with national security computers. You must penetrate Atombender's stronghold, avoid his deadly robot creations, and acquire various pieces of a password to use in the main control room.  You have 6 hours to complete the game; 10 minutes are lost each time you die and 2 minutes are expended if you use the help function on your portable computer.</p><p>The robots, rooms, and puzzle pieces will be switched around when starting over which provides replay value.</p>"},{"name":"Incredible Crash Dummies, The","year":1993,"developer":"Software Creations Ltd.","url":"b#Incredible%20Crash%20Dummies%2C%20The%20%28Europe%2C%20Brazil%29.zip","filesize":116758,"score":6,"genres":"Action > Diagonal-down > Side view > Top-down > 2D scrolling > Tricks / stunts > Snowboarding / skiing > Automobile > Space flight > Licensed","desc":"<p>The Crash Dummies need to earn some money so they've taken on some odd jobs. And when it comes to Crash Dummies, the odder the better. Although it shares the same name, this game greatly differs from the NES version and other platforms. You play as crash dummy Slick, trying to earn money. The better you do, the more money you earn. If you don't earn enough, you must redo the level. The levels vary with events like diving off a building as a movie stunt, driving a car to test air-bags, skiing down a mountain, etc. Up to two players can play, alternating.</p>"},{"name":"Incredible Hulk, The","year":1994,"developer":"Probe Entertainment Ltd.","url":"b#Incredible%20Hulk%2C%20The%20%28Europe%2C%20Brazil%29.zip","filesize":369588,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p>In this side-scrolling action game you fight against your arch-enemy The Leader and his forces (Rhino, Absorbing Man, Abomination and Tyrannus).</p><p>Take control of the Hulk/Dr. Banner through five levels of action. City and Construction Site, Tyrannus' Labyrinth, Leader's Fortress, Leader's Interior, and the Final Confrontation.</p>"},{"name":"Indiana Jones and the Last Crusade: The Action Game","year":1990,"developer":"Tiertex Ltd.","url":"b#Indiana%20Jones%20and%20the%20Last%20Crusade%20%28Europe%2C%20Brazil%29.zip","filesize":128358,"score":5.6,"genres":"Action > Side view > 2D scrolling > Platform > Interwar > Licensed","desc":"<p>As in the movie (and the more famous graphic adventure), your task is to find the Holy Grail. Before this can be done you must find the Cross of Coronado, a shield and a diary. </p><p>This makes for a four-level arcade adventure combining climbs, exploration (with several routes through each level, and some traps) and puzzles. Indy is armed with his trusty whip to fight off foes, but can also get involved in hand-to-hand combat. The first level takes place in caves underneath Colorado, before you reach a moving circus train strewn with traps, a Zeppelin which is full of guards and ladders, and then Castle Grunwald in Austria.</p>"}]