[{"name":"James \"Buster\" Douglas Knockout Boxing","year":1990,"developer":"Sanritsu Denki Co., Ltd."},{"name":"James Bond 007: The Duel","year":1993,"developer":"The Kremlin","url":"b#James%20Bond%20007%20-%20The%20Duel%20%28Europe%29.zip","filesize":118531,"score":5.8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Commander James Bond is sent to rescue the daughter of Professor Michael Jones within a total of four missions, each with three levels. There are different objectives in each level such as reaching the exit, interacting with consoles and rescuing girls held hostage. Bonus points are earned for time remaining and briefcases collected. Along the way James will fight bosses based on familiar villains such as Jaws and Oddjob. The player's performance throughout the game determines how many seconds they have to complete the final mission before the area self-destructs.</p>"},{"name":"James Pond 2: Codename: RoboCod","year":1993,"developer":"Vectordean Ltd.","url":"b#James%20Pond%202%20-%20Codename%20RoboCod%20%28Europe%2C%20Brazil%29.zip","filesize":257569,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>In his second adventure, James Pond must retrieve the toys Dr. Maybe has stolen. Pond has been armed with an Inspector Gadget-style stretch device, which he can use to view higher areas or claw onto ceilings so as to slide across them.</p><p>The gameplay takes place across worlds themed around particular types of toys, such as sporting goods, candy, and aircraft. The levels scroll sideways, although a small amount of vertical movement is included. On each level Pond must collect 2 penguins and reach the exit, although there are usually multiple exits and lots of secret areas to explore. After completing each pair of two worlds (each of which has three sub-levels), a boss must be faced.</p>"},{"name":"Jang Pung 3","year":1994,"developer":"Open Production"},{"name":"Janggun-ui Adeul","year":1992,"developer":"Daou Infosys Corp."},{"name":"Joe Montana Football","year":1990,"developer":"BlueSky Software, Inc."},{"name":"Jungle Book, The","year":1994,"developer":"Syrox Developments, Ltd.","url":"b#Jungle%20Book%2C%20The%20%28Europe%2C%20Brazil%29.zip","filesize":151982,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>This 8-bit adaptation of Disney's 1967 animated film Jungle Book is slightly different from the other versions. Although most of the main elements remain the same, the most noticeable differences are in level design and some missing items.</p><p>The player controls Mowgli in his journey to the human village. Mowgli will swing on and climb vines, run and jump while facing enemies such as coconut-throwing monkeys, snakes and vampire bats. To fight them, Mowgli can throw bananas in eight directions. He'll also find upgrades and weapons such as boomerangs inside banana bunches. There are some boss fights with main characters of the movie, such as the snake Kaa.</p><p>The objective of some of the time-limited levels (or \"scenes\") is to collect 8 gems scattered around them. Other levels require the player to reach where the panther Bagheera is. The player starts the game with 4 lives and no continues, but collecting special items will grant additional lives and continues.</p>"},{"name":"Jurassic Park","year":1993,"developer":"SEGA Enterprises Ltd.","url":"b#Jurassic%20Park%20%28Europe%2C%20Brazil%29.zip","filesize":343685,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Licensed","desc":"<p>One of many games based on the 1993 blockbuster <em>Jurassic Park</em>, the version for Sega's 8-bit systems combines side-scrolling shooting action and platforming levels.</p><p>In each of the five stages of the game, one escaped dinosaur species must be recaptured. Each level begins with a side-scrolling driving section. Dinosaurs attack the car and must be fended off by firing at them with a crosshair. If the player survives long enough, a boss battle against an especially powerful dinosaur follows.</p><p>After the completion of the driving section the level continues with a platform section. The player must jump, duck and climb to survive moving lifts, floors that will crumble under his feet, environmental hazards like acid drops, steam leaks or giant boulders and more. Dinosaurs will of course also stand in the way, but can be defeated by using several weapons: a rifle, a grenade launcher and hand grenades. Navigating the often maze-like levels will lead to the dinosaur that must be captured and a corresponding boss fight.</p><p>The first four levels (featuring a Velociraptor, Pteranodon, Triceratops and Brachiosaurus) can be tackled in any order, but the final level, featuring the Tyrannosaurus Rex, is only unlocked when the others have been completed.</p>"}]