[{"name":"Kenseiden","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#Kenseiden%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":146847,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform > Regional differences","desc":"<p>In <em>Kenseiden</em>, you play Hayato, a fearless samurai warrior. You must get back the stolen swords and scrolls, and defeat the evil waiting in the Black Castle!</p><p><em>Kenseiden</em> is a one-player game that comprises of sixteen levels. Each of the levels are side-scrolling, with bamboo houses or dark, haunted caves as their backdrop. These levels see Hayato beseigned by ghosts, skeletons, and other spirits of the supernatural. On his side is his curved sword, which he can swish at will against the monsters. If Hayato comes in contact with a monster, he will lose some life.</p><p>At the end of each level, you will have to fight a warlock or one of their henchmen. More often than not, there is a hut with a sealed door, but the door is not unlocked unless a warlock or henceman is defeated. You gain a new special power whenever you recover a scroll from them. These special powers range from high jumping to the ability to whirl your sword around like a windmill.</p>"},{"name":"King's Quest","year":1989,"developer":"Sierra On-Line, Inc."},{"name":"King's Quest: Quest for the Crown","year":1989,"developer":"Tierra Entertainment","url":"b#King%27s%20Quest%20-%20Quest%20for%20the%20Crown%20%28USA%29.zip","filesize":77805,"score":7.3,"genres":"Adventure > 3rd-person (Other) > Graphic adventure > Puzzle elements > Fantasy > Fangame","desc":"<p><em>King's Quest: Quest for the Crown</em> is a remake of King's Quest using Chris Jones' Adventure Game Studio engine. Unlike Sierra's own earlier remake of the same game, this version features VGA graphics, an icon-based point-and-click interface, voices (optional) and MP3 music (optional).</p><p>In 2009 AGD Interactive released King's Quest I VGA 4.0, which can be considered a remake of their original 2001 remake. It contains the following enhancements:</p><ul><li>Newly enhanced game backgrounds and character dialog portraits</li><li>A new \"no dead-ends\" gameplay mode (optional) to ensure that the game can be completed from any point</li><li>Full narrator speech and lip-syncing for all characters</li><li>Windows Vista support</li><li>Native Ogg Theora movies, which means in-game cutscenes and movies will now play in Linux and PC emulations under Macs</li><li>Full digital speech and music tracks are now included as part of the download rather than being separate downloads</li></ul>"},{"name":"KLAX","year":1991,"developer":"Atari Games Corporation","url":"b#KLAX%20%28Europe%29.zip","filesize":52124,"score":7.8,"genres":"Action > Puzzle > Diagonal-down > Fixed / flip-screen > Arcade > Falling block puzzle","desc":"<p>An action/puzzle game, the object is to catch assorted color falling tiles and create rows, columns, or diagonals of a single color. Each level requires a different pattern to be made, and the tiles fall faster, more at a time, and in an increasing number of colors as the game progresses.</p>"},{"name":"Krusty's Fun House","year":1993,"developer":"Audiogenic Software Ltd.","url":"b#Krusty%27s%20Fun%20House%20%28Europe%2C%20Brazil%29.zip","filesize":164245,"score":6.6,"genres":"Action > Side view > 2D scrolling > Puzzle elements > Licensed","desc":"<p>Krusty the Clown's Fun House has been overrun by rats.  You must help him to herd the rats into trap machines to clear them out.  In order to do so, Krusty must manipulate his environment to set up pathways so that the rats are headed in the right direction.  Objects that Krusty move around include blocks, fans, and pipe pieces.</p><p>The trap machines are operated by other recognizable Simpsons characters:  Bart, Homer, Sideshow Mel, and Corporal Punishment.</p>"},{"name":"Kung Fu Kid","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Kung%20Fu%20Kid%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":80775,"score":6.4,"genres":"Action > Side view > 2D scrolling > Platform > Martial arts","desc":"<p>The wicked Madanda has just awakened from a sleep of several thousand years, and as the hero, your job is to use your kung-fu skills to fight the thugs in each of the seven rounds before reaching him, and you have 99 seconds to complete each round. The thugs tend to attack you from behind as well as in front. As usual,  you have to defeat a boss at the end of each round in order to proceed to the next round. However, round six requires you to fight several bosses. Bonus points are awarded at the end of each round for the energy and time that still remains.</p>"}]