[{"name":"Land of Illusion starring Mickey Mouse","year":1992,"developer":"SEGA Enterprises Ltd.","url":"b#Land%20of%20Illusion%20Starring%20Mickey%20Mouse%20%28Europe%2C%20Brazil%29.zip","filesize":308776,"score":8.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Mickey Mouse is reading an interesting book and suddenly find himself in a strange, dreamy village. He is told that a curse has been placed on the village, turning its good magic into bad one. The evil Phantom, who lives in the castle in the clouds, is responsible for that! Mickey decides to help the villagers and to defeat the evil Phantom.</p><p>This is a platform jump-and-run game. There is a time limit to each level. Mickey can jump, duck, climb, and defeat enemies by jumping on them and pressing the down arrow at the same time.</p>"},{"name":"Laser Ghost","year":1991,"developer":"SEGA Enterprises Ltd.","url":"b#Laser%20Ghost%20%28Europe%29.zip","filesize":113157,"score":6.4,"genres":"Action > Side view > 2D scrolling > Shooter","desc":"<p>Ghost City is a city that appears every 13 years and is full of goblins and ghosts who thirst for a living soul. A blond-haired girl called Catherine is being held prisoner in the basement of White Manor. To make matters worse, her soul has been stolen and taken to Ghost City, and it's up to you to get it back. Guide Catherine through seven chapters, using either the joypad or Light Phaser to shoot ghosts that haunt her. You can also use special attacks to defeat a group of ghosts. More often than not, there will be a boss that you need to defeat in order to continue the game. If you get hit by a ghost, you will start to lose life. If your life meter is empty, the game ends. In each chapter, you can shoot cracked walls, graves, and broken windows to get extra life or special attacks.</p><p><em>Laser Ghost</em> for the Master System is completely different from the original arcade game with the same name.</p>"},{"name":"Legend of Illusion starring Mickey Mouse","year":1998,"developer":"Aspect Co., Ltd.","url":"b#Legend%20of%20Illusion%20Starring%20Mickey%20Mouse%20%28Brazil%29.zip","filesize":264050,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Once upon a mouse, there was a kingdom that was ruled by the selfish king Pete. One day, a terrible shadow crept over the kingdom, threatening the lives of its inhabitants. The king's adviser said the only way to stop the shadow would be for the king himself to travel out and to seek the cure. But the cowardly king Pete preferred to stay in the castle, and sent a simple laundry boy named Mickey instead! </p><p>As Mickey Mouse, you will travel through various levels in this platform game. Mickey shoots an unlimited amount of little balls on the enemies, can jump, climb on stairs, hang on ropes, and perform other tricks. Mickey can also pick up items and put them in another place, for example to access a higher level or to break a treasure chest open.</p>"},{"name":"Lemmings","year":1992,"developer":"DMA Design Limited","url":"b#Lemmings%20%28Europe%2C%20Brazil%29.zip","filesize":126918,"score":7.8,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Point and select > Fantasy","desc":"<p>Your task is to rescue the Lemmings across 120 levels of fast-paced puzzling. These creatures simply walk blindly through the world in the hope of reaching safety at the end of the level - unfortunately, these levels include steep drops, gaps in the ground, barriers, and rivers amongst other hazards.</p><p>You are in control not of any individual Lemming, but of a cross-hair, which can be moved over any of the Lemmings. Along the bottom is a selection of functions that can be assigned to a Lemming, including climbing, floating, and bashing. You must click to select the appropriate function, then click on the Lemming to activate it. Each level has a different range of skills on offer, a different amount of Lemmings, and a different percentage target in order to progress.</p>"},{"name":"Lemmings 2: The Tribes","year":1994,"developer":"DMA Design Limited","url":"b#Lemmings%202%20-%20The%20Tribes%20%28Europe%29%20%28Proto%29%20%281995-09-04%29.zip","filesize":334745,"score":7.9,"genres":"Puzzle > Side view > 2D scrolling > Real-time > Platform > Multiple units/characters control > Point and select","desc":"<p>The sequel to Lemmings has a plot describing how the Lemmings have split into 12 distinct tribes. Each tribe has its own landscape and cultural identity - they include Egyptian, Circus, and Highland. However, Lemming Island is now in danger, and you must complete 10 levels for each tribe in order for them to reunite and reassemble the Talisman from the 12 pieces.</p><p>Across the 120 levels, there are over 60 skills, although no more than 10 are in use on each screen. The Classic tribe has the ones from the original and is perhaps the best option for first-time players. </p><p>The others range from digging methods such as a scooper (diagonally downwards) and club basher (horizontal), building skills such as a planter (takes time to produce the desired raise to the landscape) and a sand pourer, and various methods of movement including a Pole-Vaulter and a Skater (the only Lemmings who can cross ice). Some of these are only subtly different from others, and their exact uses are unclear, but there are 4 Trainer levels where you can select any combination of skills and experiment.</p><p>Unlike the first game, the player is rewarded for saving as many Lemmings as possible, rather than simply passing or failing. The ultimate aim is to save all 60 Lemmings through all levels, thereby earning a Gold Medal for that tribe - Silver and Bronze are also on offer. The player can also go back over levels in the hope of saving more Lems. </p><p>Because there are 12 tribes, and the player can switch between them at any point, you have to be stuck 12 times to be unable to progress. The game saves progress rather than using passwords as in the first game.</p>"},{"name":"Line of Fire","year":1991,"developer":"Sanritsu Denki Co., Ltd.","url":"b#Line%20of%20Fire%20%28Europe%2C%20Brazil%29.zip","filesize":183555,"score":6.1,"genres":"Action > Top-down > 2D scrolling > Shooter","desc":"<p>A man by the name of Jack infiltrates an enemy base and discovers a secret weapon. Soon he is hunted by disgruntled enemy soldiers who want their toy back. The game takes the players through six levels controlling Jack in an armoured jeep. The gameplay is shown through a top-down perspective, with the screen scrolling vertically at a constant rate. The jeep cannot access the top part of the screen, only two thirds of it and getting stuck behind certain objects blows up the jeep.</p><p>The jeep is equipped with an unlimited amount of bullets and about 50 missiles per mission. Certain objects in the air can only be taken out using missiles. After launching them, players can apply \"aftertouch\" to guide towards the target by moving left or right. The settings, including a factory and a jungle, sometimes have obstacles, also requiring the jeep to jump over rivers. There are three difficulty levels, the vehicle can take multiple hits and there are three lives per continue.</p>"},{"name":"Lion King, The","year":1994,"developer":"Syrox Developments, Ltd.","url":"b#Lion%20King%2C%20The%20%28Europe%2C%20Brazil%29.zip","filesize":279632,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Lion King</em> is a side-scrolling platform game based on the Disney animated film of the same name. The version for Sega's 8-bit systems is based on the 16-bit version and has the same general gameplay and the same level themes, but its own level designs and other differences.</p><p>The player controls the young lion Simba through ten levels, all based on locations from the film. In the first six, Simba is a cub, from level seven on he is an adult. The two forms differ slightly in abilities: young Simba can roll sideways, damaging enemies that are in the way. Only adult Simba can slash enemies directly with his paws, while both can use their roar to temporarily stun and jump on top of enemies to defeat them. Several stages end with boss fights against the likes of a hyena and an orangutan, with the final level consisting only of the fight against main villain Scar.</p><p>In most levels, various power-ups can be collected, many of which come in the form of bugs. These include health restoration, temporal invincibility and upgrades for the power of Simba's roar and slash. Other items to collect include extra lives and continues as well as diamonds which enable the playing of a bonus rounds after finishing a level.</p><p>In the bonus round, the player controls the warthog Pumbaa, who must catch melon seeds falling from the top of the screen. For every ten seeds collected, an extra life is awarded at the end. Accidentally catching bugs removes seeds, however.</p>"},{"name":"Lord of the Sword","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#Lord%20of%20the%20Sword%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":149206,"score":6,"genres":"Action > Side view > 2D scrolling > Metroidvania > Direct control > Fantasy","desc":"<p>The player is in the role of Landau, a man who must pass three tests in order to gain the crown of the land Baljinya, which for years has been rife with lawlessness and fear, and restore peace to the land. To pass the three tests, Landau must find the Tree of Marill, subdue the Goblin of Balala Valley, and destroy the Statue Of Evil.</p><p>Landau is controlled in a 3rd-person side-scrolling view. He can explore the world map (which can be seen by pressing the pause button) freely in a non linear way, but some portions of the map will be available only after defeating certain enemies or getting certain items. The Kingdom of Baljinya has towns and villages where Landau can stop to rest (restoring his health) and gather information from the people. There are also castles which can only be entered after completing certain tasks. Between those villages, towns and castles lie different kinds of terrains, like flatlands, dark forests, mountains and swamps. Those terrains are plagued by different kinds of monsters, some specific of each terrain.</p><p>There are two weapons which can be used by Landau: a sword and a bow. The sword can be used by pressing the button 2 while standing, kneeling or jumping. The bow can be used by pressing the button 1 only when standing or kneeling. Landau cannot walk and attack at the same time. Along his way he'll find new and stronger swords and bows.</p><p>Landau has only one life, but the game offers a continue feature which can be used up to 10 times.</p>"},{"name":"Lucky Dime Caper starring Donald Duck, The","year":1991,"developer":"SEGA Enterprises Ltd.","url":"b#Lucky%20Dime%20Caper%20Starring%20Donald%20Duck%2C%20The%20%28Europe%2C%20Brazil%29.zip","filesize":171030,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p><em>The Lucky Dime Caper</em> is a 2D platform game featuring Donald Duck in search of Uncle Scrooge's lucky dime, stolen by Magica De Spell.</p><p>The game is the 8-bit counterpart for Quack Shot (released only for Sega Genesis), which also features Donald Duck, but the story and gameplay are totally different.</p>"}]