[{"name":"Mahjong Sengoku Jidai","year":1987,"developer":"Sanritsu Denki Co., Ltd."},{"name":"Marble Madness","year":1992,"developer":"Atari, Inc.","url":"b#Marble%20Madness%20%28Europe%29.zip","filesize":93742,"score":7.2,"genres":"Action > Puzzle > Diagonal-down > Isometric > Arcade > Direct control","desc":"<p>The idea of this arcade game is deceptively simple: Guide a marble down a path without hitting any obstacles or straying off the course. The game is viewed from an isometric perspective, which makes it harder to stay focused on the direction the ball is to follow. There are tight corridors to follow and enemies to avoid. There is a 2-player mode in which players must race to the finish; otherwise you're racing against the clock.</p>"},{"name":"Marksman Shooting & Trap Shooting & Safari Hunt","year":1986,"developer":"SEGA Enterprises Ltd.","url":"b#Marksman%20Shooting%20%26%20Trap%20Shooting%20%26%20Safari%20Hunt%20%28Europe%29.zip","filesize":52245,"score":7,"genres":"Action > Compilation > Sports > 1st-person > Hunting > Shooter","desc":"<p>This cartridge bundles three games that all support the light phaser. <em>Marksman Shooting</em> and <em>Trap Shooting</em> were previously available as a bundle on a single cartridge, while <em>Safari Hunt</em> was released individually.* Marksman Shooting is a target practice game where one must shoot targets at an FBI shooting range. One must shoot the targets before they disappear and score enough points to qualify to the next round.</p><ul><li><p>Safari Hunt is a hunting game where one must shoot as many animals with a limited amount of ammunition. One must shoot the various game animals to acquire enough points to advance to the next round.</p></li><li><p>Trap Shooting is a clay pigeon shooting game where one must shoot each disc as it is thrown into the air. One must shoot the pigeons before they disappear into the distance and score enough points to advance to the next round.</p></li></ul>"},{"name":"Marksman Shooting & Trap Shooting","year":1986,"developer":"SEGA Enterprises Ltd."},{"name":"Master Games 1","year":1993,"developer":"SEGA Enterprises Ltd."},{"name":"Masters of Combat","year":1993,"developer":"SIMS Co., Ltd.","url":"b#Masters%20of%20Combat%20%28Europe%2C%20Brazil%29.zip","filesize":172771,"score":7.5,"genres":"Action > Side view > Fighting > Sci-fi / futuristic","desc":"<p>In the year 20XX, a U.F.O. lands in the area around Megalo City. A team is sent to investigate, but they find no trace of any life form inside. After a year has passed, the city's mayor, out of nowhere, decides to host a fighting tournament to determine the strongest fighter in the world. However, something sinister seems to be going on...</p><p><em>Masters of Combat</em> is a versus fighting game, where you choose one of the final four participants in the tournament and need to defeat your three opponents and yourself in a mirror match, before you can take on the final boss. Unlike most fighters, the game does not use \"up\" on the D-pad for jumping, but one of the other buttons, leaving one button for punches and kicks.</p><p>The game has three levels of difficulty, but the easiest mode ends after four of the five fights.</p>"},{"name":"Maze Hunter 3-D","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#Maze%20Hunter%203-D%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":78755,"score":6.5,"genres":"Action > Side view > Top-down","desc":"<p>You are trapped in a twenty-level maze, and your job is to make your way toward the bottom, and get out alive. Pick up the iron bar and use it to destroy enemies that get in your way. They will respawn a few seconds after they have been killed. Go down warp holes to warp to another part of the level. To exit, you must find the silver key that will open the locked door. Red balls will float around the screen, and destroying them will let you obtain a special attack which you can use to defeat enemies. Boxes labeled ? are scattered around the level, and destroying these will allow you to obtain armor, shoes, and the key that you need to exit. Requires 3-D glasses to play.</p>"},{"name":"Megumi Rescue","year":1988,"developer":"Aicom Corporation"},{"name":"Mercs","year":1991,"developer":"Capcom Co., Ltd.","url":"b#Mercs%20%28Europe%2C%20Brazil%29.zip","filesize":222287,"score":7.1,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > War","desc":"<p>Mercs is a shoot 'em up influenced by Ikari Warriors. You are an anti-terrorism soldier, and must rescue a former President from a Central African revolutionary gang. </p><p>You run through each of the 8 levels, which primarily scroll horizontally, shooting everyone before they can shoot you. At times you will have to shoot trees and other scenery to progress. </p><p>Finding strategic placings is important, especially as you can't shoot while on water. Most of the time you are on foot, but at times you can hijack vehicles of shot foes. There are improved weapons, smart bombs and energy recharges to collect. Each of the 8 levels ends with a large vehicle requiring multiple shots to destroy.</p>"},{"name":"Michael Jackson's Moonwalker","year":1990,"developer":"SEGA Enterprises Ltd.","url":"b#Michael%20Jackson%27s%20Moonwalker%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":134573,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Michael Jackson's Moonwalker</em> is based on the Michael Jackson movie. Mr. Big has kidnapped children and has nasty things in store for them, like drugging them and making them slaves. So it's up to Michael to use his magical powers and dancing talent to try to catch Mr. Big and rescue his little friends.</p><p>Michael Jackson can jump, throw magical stars, and dance to counter his opponents as he looks for the hidden children. Stages come in various shapes and sizes from some of Jackson's hit videos which take place in streets and graveyards.</p>"},{"name":"Mick & Mack as the Global Gladiators","year":1993,"developer":"Virgin Games, Inc.","url":"b#Global%20Gladiators%20%28Europe%2C%20Brazil%29.zip","filesize":152482,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Licensed","desc":"<p><em>Global Gladiators</em> is a platform game licensed from fast food chain McDonalds. While playing through the game's 12 levels you'll notice McDonalds logos, burgers and all sorts of family restaurant type stuff as you take Mick and Mack (the game's protagonists) on a journey to clean up \"Monsters of Slime World\", \"Toxi-Town\" and more.</p>"},{"name":"Mickey's Ultimate Challenge","year":1998,"developer":"Designer Software","url":"b#Mickey%27s%20Ultimate%20Challenge%20%28Brazil%29.zip","filesize":119067,"score":5.8,"genres":"Puzzle > Side view > 2D scrolling > Direct control > Fantasy > Licensed","desc":"<p>One night, as Mickey (or Minnie) lay in bed reading a book of fairy tales, he started to wonder how it would be to live in a far off land, in a magic castle. As he fell asleep, he woke up in the Kingdom of Beanwick, which is constantly tormented by earthquakes. Then, he offers his help to solve the mystery behind those earthquakes.</p><p><em>Mickey's Ultimate Challenge</em> is a puzzle game in which the player chooses either Mickey or Minnie to play with. They'll find five characters from the Disney's universe in the kingdom, and will be prompted to help them in several tasks.</p><p>Each task is a different puzzle, given by a specific character. Daisy, for instance, will ask help to clean the castle's paintings hanging on a wall. The task is in fact a memory game, where Mickey or Minnie must clean the pictures matching pairs. After completing one task, they'll receive a gift.</p><p>After completing all tasks, Mickey or Minnie must trade the gifts they won with the right characters. For instance, after finishing Goofy's task, they will receive his hammer. The player must then guess who among the other characters would like to receive that hammer.</p><p>Giving the right items to the right characters will allow Mickey or Minnie access to the last puzzle and character.</p>"},{"name":"Micro Machines","year":1993,"developer":"The Big Red Software Company Ltd.","url":"b#Micro%20Machines%20%28Europe%29.zip","filesize":154076,"score":7.5,"genres":"Racing / Driving > Top-down > Licensed","desc":"<p>If you're bored of racing Formula 1 cars, rally cars or MotoGP bikes in their natural habitats, the Micro Machines series could be for you. It involves racing miniatures representing particular vehicle types across a particular terrain found around the house. The Sports Cars race on the desktop, 4x4s in the sandpit, Formula 1 cars on a snooker table, and so on.</p><p>These levels were packed with variation. The Snooker tables has the track painted on, although this is open to deviation (as are most levels), and had you racing through the pockets and across the rim of the table. Tanks raced as well, with the chance of shooting out your opponent if they got directly in front of you. The desktop levels include binders to jump across, pencil-sharpeners to avoid, and lots of visual jokes in the open homework.</p><p>Viewed from overhead with small graphics, the races include up to 4 cars. In one player challenge mode you race through the 21 tracks in a set order, selecting your 3 opponents as you go along (adding a fair amount of strategy - ideally you should aim to eliminate the better CPU cars early on), eliminating one after every third race (assuming that you can finish in the top 2 of a race within your 3 lives). If you win 3 races in a row without using a continue you get a time-trial race which can earn you an extra life.</p><p>The real innovation of the game was in the multiplayer modes. You started with 4 points each, and when one car gets far enough ahead to force the other car off-screen, the slider moves in their favour. Once it reached the end (which involved beating them 4 times more than they beat you) you win the level, although if 3 laps were completed, the person leading at that point is declared the winner - with a sudden death play off if scores are level. 9 of the tracks are available in this mode, although you can also play this Head to Head system as a 1-player game across all the tracks.</p>"},{"name":"Miracle Warriors: Seal of the Dark Lord","year":1987,"developer":"ASCII Corporation","url":"b#Miracle%20Warriors%20-%20Seal%20of%20the%20Dark%20Lord%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":163794,"score":7,"genres":"Role-playing (RPG) > 1st-person > Diagonal-down > Turn-based > Japanese-style RPG (JRPG) > Direct control > Menu structures > Fantasy","desc":"<p>In <em>Miracle Warriors: Seal of the Dark Lord</em>, you have been asked to recover the Golden Seal which is being guarded by the Dark Lord Terarin. You start your quest by yourself, but you must find three other companions who will join you to defeat Terarin. You also must venture through five lands. You will find villages, towns and castles in your travels in these lands. In each, you will find or be able to buy weapons and armor (both for you and your companions), medicine and clues. You will also find caves, dungeons, and monuments that are scattered. Some you may enter unhindered. Others will be locked until you find the right person or learn the right spell. </p><p>Also within each land, you will encounter monsters such as evil merchants, Weasly wimps, Unmutaks, Great Lions, Gelfises, Zirods, and many more. Some of these monsters do less damage than others, and take more damage themselves. You can either attack them yourself using your weapons or spells, or make your companions attack the monsters themselves. When defeated, most monsters will either leave behind some coins, which you can spend to buy stuff at the towns, or some items, which you can also use to defeat monsters.</p><p>However, not all inhabitants are monsters. You will also meet merchants and travelers who might tell you where to go and what to do.</p>"},{"name":"Missile Defense 3-D","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Missile%20Defense%203-D%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":78618,"score":6.5,"genres":"Action > 1st-person > Top-down","desc":"<p>The east and west are attacking!  ICBM's and cruise missiles are flying, and it's your job to intercept them from a laser cannon positioned in space.  You have 3 chances to save each city.  Scene 1: Launch.  Shoot as many as possible from their launch point.  If you miss any, you can catch up with them in scene 2.  Scene 2: However many you missed in the previous scene, you have another chance to shoot them down.  If you miss them again, you have one final chance to catch them in scene 3.  Scene 3: The City - This is the last chance.  You must shoot them ALL down, if even one gets through, the game is over.  The game starts off fairly easy, but quickly ramps up in speed and the number of missiles launched.</p>"},{"name":"Moggy Master","year":2015,"developer":"The Mojon Twins"},{"name":"Monaco GP","year":1985,"developer":"SEGA Enterprises Ltd."},{"name":"Mônica no Castelo do Dragão","year":1991,"developer":"Westone Co., Ltd."},{"name":"Monopoly","year":1988,"developer":"Nexa Corporation"},{"name":"Montezuma's Revenge","year":1989,"developer":"Sinclair Research Ltd.","url":"b#Montezuma%27s%20Revenge%20featuring%20Panama%20Joe%20%28USA%29.zip","filesize":50210,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fixed / flip-screen > Arcade > Metroidvania > Platform","desc":"<p>You play as a treasure hunter named Panama Joe, whose goal is to find an ancient treasure hidden by Aztec warrior  deep inside catacombs. But beware, the catacombs are a large maze inhabited by monsters. Bouncing and rolling skulls, dancing spiders, disappearing and re-appearing chains and tons of fire await you. You'll have to find many keys and unlock doors in order to reach your goal. Panama Joe can jump and climb ladders, but doesn't have much to offer in terms of combat. That's why the monsters in the game should be avoided: a collision with an enemy leads to a premature death. He will also find amulets which make him invulnerable for a short time. Except for the Master System version, they are activated directly when picked up.</p><p>The Atari 2600 port is a truncated version of the game and has only 24 rooms instead of 100. The room layouts are more of an approximation of the original version than being a direct copy due to the limited power of the console. The ZX Spectrum version has identical room layouts, however, the rooms are arranged differently and a few were removed. The Normal Distribution port has both a retro and modern mode. While the retro mode attempts to be faithful to the original version, the modern mode offers enhanced visuals plus has scrolling instead of the flip-screen of the original.</p>"},{"name":"Mortal Kombat","year":1993,"developer":"Midway Games, Inc.","url":"b#Mortal%20Kombat%20%28Europe%2C%20Brazil%29.zip","filesize":381597,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy > Martial arts","desc":"<p>Five hundred years ago, an ancient and well respected Shaolin fighting tournament, held every 50 years, was corrupted by an evil and elderly sorcerer by the name of Shang Tsung. Shang was accompanied by Prince Goro, a warrior of the Shokan race (a four-armed half-human / half-dragon). Knowing that if ten tournaments in a row were won by the Outworld champion, the Earth Realm would be conquered by evil and fall into darkness, Shang entered Goro in the tournament and had him defeat the great Kung Lao. Goro has been reigning supreme as the undefeated fighting champion for five hundred years now. As the last tournament required draws near, Raiden, Thunder God and protector of the Earth Realm, enacts a plan to tip the scales in the humans' favor, Seven fighters step into the arena on Shang Tsung's mysterious island: Shaolin warrior Liu Kang, Special Forces operative Sonya Blade, the mercenary thug Kano, fame-seeking actor Johnny Cage, the ice-wielding Lin Kuei warrior Sub-Zero and his undead adversary Scorpion, and Raiden himself.</p><p><em>Mortal Kombat</em> is a side-scrolling fighting game. Fighting is set as one-on-one combat, allowing each player to perform a variety of punches, kicks, and special moves in order to defeat their opponent. When the opponent faces their second round loss, the winner can perform a finishing move called a \"Fatality\" on the loser. The Fatality is a move unique to each fighter that graphically kills the loser in a blood-soaked finale.</p><p>Mortal Kombat began its life as a 2-player arcade title. It is notable for its use of digitized actors to represent the game's fighters, as well as its use of copious amounts of blood during gameplay.</p>"},{"name":"Mortal Kombat 3","year":1996,"developer":"Midway Manufacturing Company","url":"b#Mortal%20Kombat%203%20%28Brazil%29.zip","filesize":270130,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts","desc":"<p>Shao Kahn has won. The Earthrealm is no more. In order to revive his Queen Sindel, the emperor Shao Kahn used the Outworld Tournament from Mortal Kombat 2 as a diversion while his Shadow Priests revive his fallen Queen on Earth. Once enacted, the dimensional bridge between the two realms connects, allowing Kahn's extermination squads to invade and destroy Earth, and enslave the population's souls.</p><p>A small team of Raiden's \"Chosen Warriors\" survives the attack: Mortal Kombat champion Liu Kang and his ally Kung Lao, Special Forces agents Sonya Blade and Jax, the shaman Nightwolf, the riot cop Stryker, the nomadic Kabal, and former Lin Kuei warrior Sub-Zero, who has gone rogue from his clan. Facing the warriors are the mercenary Kano, cyber-ninjas Smoke, Sektor and Cyrax, Sheeva, a female Shokan, the sorcerer Shang Tsung, and Queen Sindel herself.</p><p><em>Mortal Kombat 3</em> brings new elements to the 2D fighting series: multi-level playfields, \"Dial-A-Combo\" attacks, a \"Run\" button to speed up the battles, and \"Vs.\" codes, which unlock new powers and abilities once both players enter a code sequence in pre-match-up screens. Also included are more stage fatalities and finishing moves as each warrior attempts to go one-on-one with the Centaurian enforcer Motaro, and Shao Kahn himself.</p><p>Mortal Kombat 3 is the last traditional one-on-one fighting game game in the series to feature motion-captured digitized graphics for its kombatants, and introduces online network play to the PC version.</p>"},{"name":"Mortal Kombat II","year":1994,"developer":"Midway Manufacturing Company","url":"b#Mortal%20Kombat%20II%20%28Europe%2C%20Brazil%29.zip","filesize":394181,"score":7.9,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts > Regional differences","desc":"<p>The Mortal Kombat fighters, plus several new ones, return for a tournament held by the evil Shang Tsung of the Outworld. The action is one-on-one as before, and famed for its high level of violence and blood (other than the sanitised Nintendo version). There are 5 difficulty levels and optional credits, as well as the usual two player mode including same character duels.</p><p>To win the main tournament, the player must beat each of the other human players, before taking on Shang Tsung, Kintaro and finally Shao Kahn. Players have a range of punches and kicks available, as well as flying kicks, uppercuts, roundhouses, and the special moves, which vary for each player. These include throws, uppercuts, long-distance bullets, bicycle kicks and a teleport feature.</p>"},{"name":"Ms. Pac-Man","year":1991,"developer":"General Computer Corporation","url":"b#Ms.%20Pac-Man%20%28Europe%2C%20Brazil%29.zip","filesize":54166,"score":7,"genres":"Action > Top-down > Fixed / flip-screen > Arcade","desc":"<p>In 1981, a sequel to Pac-Man was introduced in the form of his girlfriend, <em>Ms. Pac-Man</em>. This sequel continued on the \"eat the dots/avoid the ghosts\" gameplay of the original game, but added new features to keep the title fresh.</p><p>Like her boyfriend, Ms. Pac-Man attempts to clear four various and challenging mazes filled with dots and ever-moving bouncing fruit while avoiding Inky, Blinky, Pinky, and Sue, each with their own personalities and tactics. One touch from any of these ghosts means a loss of life for Ms. Pac-Man.</p><p>Ms. Pac-Man can turn the tables on her pursuers by eating one of the four Energizers located within the maze. During this time, the ghosts turn blue, and Ms. Pac-Man can eat them for bonus points (ranging from 200, 400, 800, and 1600, progressively). The Energizer power only lasts for a limited amount of time, as the ghost's eyes float back to their center box, and regenerate to chase after Ms. Pac-Man again.</p><p>Survive a few rounds of gameplay, and the player will be treated to humorous intermissions showing the growing romantic relationship between Pac-Man and Ms. Pac-Man, leading all the way up to the arrival of \"Junior\".</p>"},{"name":"My Hero","year":1986,"developer":"Coreland Technology Inc.","url":"b#My%20Hero%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":23113,"score":5.3,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler","desc":"<p>Rescue your girlfriend from the clutches of an evil gang in this extremely unforgiving side-scrolling beat-em-up. The eponymous hero can only jump-kick and punch and must fight numerous thugs, pigs, bulldogs and frogs on his way to the gang's leader, Mohikan. A conversion of this arcade game was released on Master System card format.</p>"}]