[{"name":"NBA Jam","year":1994,"developer":"Iguana Entertainment, Inc.","url":"b#NBA%20Jam%20%28Europe%29%20%28Proto%29.zip","filesize":233659,"score":7.8,"genres":"Action > Sports > Side view > 2D scrolling > Arcade > Direct control > Basketball > Licensed","desc":"<p><em>NBA Jam</em> is a two-on-two basketball game You can play any NBA team, and you can play as players like Barkley, Starks, Pippen, and Grant. Each human player controls a single player, so choose your squad wisely to take team-mate skill into account. The game is action-oriented, and players can perform unrealistic slam-dunks. Full performance statistics are automatically recorded. The play clock and 3-point line apply, but other rules are largely overlooked.</p>"},{"name":"Nekkyū Kōshien","year":1988,"developer":"Whiteboard"},{"name":"New Boggle Boggle 2","year":1989,"developer":"MBitM"},{"name":"New Zealand Story, The","year":1992,"developer":"Taito Corporation","url":"b#NewZealand%20Story%2C%20The%20%28Europe%29.zip","filesize":143302,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control > Fantasy > Oceania","desc":"<p>One day, a kiwi tribe was having fun and games outside the zoo, only to be kidnapped by the evil-minded Leopard Seal, who plans to sell them at the black market. Fortunately, during the kidnapping process, Tiki, leader of the tribe, managed to escape the sack, and her job is to rescue Phee-Phee and the other kiwis scattered around New Zealand, and are held in cages in various locations that include Auckland, Rotorua, Waitomo Caves, Strait Cook, and Mt. Cook. </p><p>If Tiki doesn't rescue a kiwi in a limited amount of time, the devil will appear and try to kill her. When Tiki reaches the outskirts of each city, except Strait Cook, there is a boss waiting to meet Tiki, and kill her by using their own choice of weapons. Also making the rescue mission difficult are several nasties that attempt to throw their own weapons, like bombs and arrows, at her. To defeat these enemies, Tiki shoots at them using her crossbow and arrows. More often than not, when Tiki shoots at enemies, they will leave behind pieces of fruit that she can pick up for points. However, it is likely that Tiki may get other weapons or the letters E, X, T, E, N, and D. Collecting all these letters will result in an extra life, and as for the weapons, they include laser shots, bombs, and fireballs. </p><p>In some levels, a few areas are located further up than just left or right, and the only way that Tiki can go up is by snatching something off the enemy that gives her the ability to fly up. Other areas are underwater, and when Tiki goes underwater, her oxygen  meter decreases, so she has to rise up to the surface again to restore her oxygen levels. Apart from her own weapons, Tiki is able to squirt water at enemies if she gets to the top of the water.</p>"},{"name":"Ninja Gaiden","year":1992,"developer":"SIMS Co., Ltd.","url":"b#Ninja%20Gaiden%20%28Europe%2C%20Brazil%29.zip","filesize":163136,"score":8.2,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>The Master System version of <em>Ninja Gaiden</em> is not a port of the well-known NES game, but an entirely new game (this includes both a different story and different levels) developed by SIMS under license from Tecmo.</p><p>The story is also about the original protagonist, the Dragon ninja Ryu Hayabusa, who returns to his clan's village only to find it utterly destroyed and the inhabitants murdered. A single survivor tells Ryu in his last seconds that the Sacred Scroll of Bushido was stolen. With the power of the scroll its owner is mighty enough the gain control of the whole world. Thus Ryu swears to recapture the scroll and the avenge the annihilation of his clan.</p><p>The game is sidescrolling platformer/ beat'em up title and incorporates most of the mechanics from the NES games: Ryu can jump and attack with his Dragon Sword. Furthermore, he can collect different kinds of Ninja Magic (which again vary form the powers in the NES games), from shuriken to fire wheels, which can only be used finitely many times, as the use up energy which again must be collected. However, instead of clinging to walls and climbing them, Ryu can push himself off the wall in this game, which must be applied for instance by jumping and forth between two close walls to get higher and higher.</p><p>The goal of each level is simply to reach the end of the level before the time runs out. Each level is divided into several sections, and at the end of each level is a boss fight. After beating a boss, a cut scene is shown which continues the story about Ryu's quest for the Bushido scroll and his revenge.</p>"},{"name":"Ninja, The","year":1986,"developer":"SEGA Enterprises Ltd.","url":"b#Ninja%2C%20The%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":80220,"score":6.8,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Japan (Ancient/Classical/Medieval)","desc":"<p>Early in Japan's edo era, circa 1630, peace had continued in the western province of Ohkami until the feudal lord passed away. Gyokuro, an evil emperor, gained power and his oppressive rule caused great hardship to the people, and the princess who opposed him was confined to a dungeon somewhere in the Ohkami castle. Gyokuro has the Ohkami ninja under control at his command. Utilizing various ninjitsu techniques, in addition to the one that transforms them into a wolf, they protect him from the people who are his enemies.</p><p>You play Kazamuru, a great warrior who challenges the clan to a fight in order to rescue the princess. However, he can't rescue the princess unless he finds the five scrolls in the thirteen areas of Ohkami. On his quest, he must defeat various ninjas such as Kuno-ichi and Ninniku, as well as fire-blowing ninjas, slashing ninjas, and footloose ninjas. You'll explore grassy fields, shrines, river banks,  towns, and the castle itself. Some of the steps have varied gameplay. For example, you must avoid boulders in Step 2, must use logs in order to cross a river in Step 5, avoid being trampled on by horses in Step 7, and scale a cliff in Step 9.</p>"}]