[{"name":"Olympic Gold: Barcelona '92","year":1992,"developer":"Tiertex Ltd.","url":"c#Olympic%20Gold%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%29.zip","filesize":1,"score":7.1,"genres":"Sports > Side view > 2D scrolling > Fixed / flip-screen > Olympiad / mixed sports > Licensed","desc":"<p>The official game of the Games of the XXV Olympiad, held in Barcelona in 1992, featuring seven different events: 100M Sprint, Hammer Throw, Archery, 110M Hurdles, Pole Vault, Springboard diving and 200M Freestyle Swimming.</p><p>Gameplay features the typical button mashing formula used by Epyx during the 80s. 100M Sprint, 110M Hurdles and 200M Freestyle Swimming feature a button mashing sequence with just some changes: in the hurdles the player must hit the action key to jump over a hurdle (the timing sets the loss of speed) and in swimming, the sequence takes over one and an half minutes and the action button touches the edge for the return swim. In these events, the player initially faces a semi-final round and only qualifies for the final if ends in the top half. It's possible to watch the other semi-final.Hammer Throw combines a strong mashing sequence, along an accurate press of the action button to release the hammer, while Pole Vault combines an initial mashing sequence, a first tap on down to set the bar, then pressing up and the action button to release the pole and jump over the bar. Archery is a technical event where the player has three rounds with six arrows each, the winner being the one with the highest score on all three rounds.</p><p>The player can choose to compete for eight nations: Great Britain, France, Germany, Italy, hosts Spain, United Stats, Japan and the CIS (formerly the Soviet Union). Each nation has it's own sample of the anthem and a set of athletes to compete against the player. Each athlete is unique, and will perform differently according to the event: in some they are capable of breaking World Records, in others, lucky enough to get to a final or a top-6 spot. The competition is split in two tables: sorted by medals and by total score (the gold medalist gets 24 points, the 12th only 13).</p>"},{"name":"Operation Wolf","year":1990,"developer":"Taito Corporation","url":"b#Operation%20Wolf%20%28Europe%2C%20Brazil%29.zip","filesize":156156,"score":7,"genres":"Action > 1st-person > 2D scrolling > Arcade > Rail shooter","desc":"<p>You have been recruited for Operation Wolf, a desperate attempt to rescue prisoners from the enemy. Through a series of missions, you'll engage a variety of enemies, from soldiers to ninjas, patrol boats to helicopters, and more. Can you carry the day?</p><p><em>Operation Wolf</em> is an arcade game by Taito. It is essentially a bitmapped \"rail-shooter\", where you basically hold the gun and shoot just about everything that moves, while conserving your ammo and grenades. Shoot ammo/grenades and healing items on the screen to \"pick them up\". Your primary machine gun can kill everything if you hit it enough times, but you can also use the grenade launcher for really deadly targets like helicopters or armored cars. You can collect a machine gun which will allow you to shoot faster for a few seconds. </p><p>You'll be pummelled by a LOT of enemies. Some will be shooting, others will be tossing grenades, knifes, and more. Some are armored and requires more than a few hits, others dodges. You can shoot grenades and knifes out of the air if you aim well enough. There are also civilians running around which can be shot, but it's not beneficial. </p><p>Bosses appear at the end of some levels, and each has a specific weakness you need to exploit.</p>"},{"name":"Ottifants, The","year":1993,"developer":"Graftgold Ltd.","url":"b#Ottifants%2C%20The%20%28Europe%2C%20Brazil%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":111281,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Bruno is a baby Ottifant. It's an ordinary evening, and Bruno's dad is working late at office. Reason enough for Bruno's vivid imagination to run riot, thinking that his dad has been kidnapped by aliens! Jelly babies, that fell from his father's pocket on the way to work, blaze a trail to the office. Now it's up to Bruno to fight his way through hordes of terrorizing toys, Ottifant-eating plants, tear through gloomy caverns of doom and cut across a perilous jungle - workaday objects and boringly normal settings as seen through kids' eyes - and rescue his dad!</p><p><em>The Ottifants</em> for the SEGA Game Gear is a 2D side-scrolling platformer where the player controls Bruno through five worlds: starting with the house and the basement, through to the building site, the office and finally the jungle, whereas each world is in turn divided into three stages. Bruno's primary weapon is his trunk, which gives him the ability to blast enemies by firing sweets at them, or suck in objects like out-of-reach platforms or boxes by holding down the Fire-button. Furthermore, yellow, green and red lollies are spread throughout the stages. Gathering three of them activate one of Bruno's special skills and can - depending on the colour combination - transform the baby Ottifant into Superfant with the ability to fly, boost his speed with Speedy Shoes, give an extra Continue and more. </p><p>Picking up jelly babies, blasting enemies and collecting papers gives points and raises Bruno's score up to a fixed value of 9,999 pts. There are several entrances to secret rooms hidden in the five worlds. But, unlike the Genesis-version, the rooms are quite small and basic and there is no 1,000 point reward by completing them. On the whole there are two different tunes backing your journey through the game: one for the stages and one for the boss enemies. The varied background music and sound effects of the Genesis-game are completely missing, as is one entire world: The Garden.</p>"},{"name":"Out Run","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#OutRun%20%28World%29.zip","filesize":142112,"score":7.4,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing","desc":"<p><em>OutRun</em> is a racing game that allows the player to race across varied terrain in a readily available Ferrari, complete with a female passenger, over a series of short tracks.</p><p>Gameplay is viewed from just above and behind the car. The roads are full of sharp bends and hazards, contact with which can cause the car to roll and lose the player's time. On each section of track there is a fork in the road, allowing the player to choose which direction he or she wishes to go in. The player has to to complete five track sections in total, out of the fifteen in the game.</p>"},{"name":"Out Run 3-D","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#OutRun%203-D%20%28Europe%2C%20Brazil%29.zip","filesize":124032,"score":6.9,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Street racing","desc":"<p>This edition of the classic driving game takes the original and adds a 3D view, using the Master System's 3D glasses. Little else is modified. You still drive a red Ferrari on a road which forks into more and more levels. The main differences are the levels, which look slightly different, the fact that your Ferrari is slightly smaller than the original Master System conversion, and that there are three new sound tracks to choose from; <em>Midnight Highway, Color Ocean</em> and <em>Shining Wind.</em> The original <em>Magical Sound Shower</em> is still left for the traditionalists. There is also a significantly better graphics and the Beach was restored to the first stage and sluggish Rock Tunnel stage (whose graphics made crippling demands on almost all the home gaming platforms) was replaced by a dark road tunnel instead.</p>"},{"name":"Out Run Europa","year":1991,"developer":"Probe Software Ltd.","url":"b#OutRun%20Europa%20%28Europe%2C%20Brazil%29.zip","filesize":104578,"score":6.9,"genres":"Racing / Driving > Behind view > Automobile > Motorcycle > Naval / watercraft > Europe > Licensed","desc":"<p>The third game in the OutRun series, which revolutionised the third-person perspective style of racing games. The levels are set across Europe, as undercover agent Simeon Kurz attempts to recover his stolen car (and, more importantly the top-secret documents that were inside it) while escaping the police who wrongly assume him to be a vehicle thief. Unlike other titles in the series, you use a different vehicle on each level, with motorbikes and jet-skis adding variety and taking different skill to use. You must complete each level within the strict time limits, and the routes are dogged with other vehicles to avoid and overtake. You can choose between sound effects or music.</p>"}]