[{"name":"Pac-Mania","year":1991,"developer":"Namco Limited","url":"b#Pac-Mania%20%28Europe%29.zip","filesize":55897,"score":7.4,"genres":"Action > Diagonal-down > Isometric > Arcade","desc":"<p><em>Pac-Mania</em> is a variation on the game Pac-Man. You need to guide Pac-Man around a maze and eat all of the dots on the board to proceed on to the next round. Numerous, multi-colored ghosts also roam the maze trying to stop you. If you eat one of the power pellets in the maze, the ghosts will temporarily turn blue and run from you. Pac-Man can earn bonus points by eating the ghosts when they are in this state. The maze is now shown in isometric perspective and is larger than the screen which will scroll to follow the action. To help get out of tight spots, Pac-Man can now jump. But be careful, because some of the ghosts have learned this trick as well and you could end up in a mid-air collision!</p>"},{"name":"Paperboy","year":1990,"developer":"Atari, Inc.","url":"b#Paperboy%20%28USA%2C%20Brazil%29.zip","filesize":62613,"score":6.8,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Arcade > Bike / Bicycling","desc":"<p>The object of <em>Paperboy</em> is to deliver papers to your customers while inflicting as much damage as possible to the houses of your non-customers. To make things more difficult, numerous obstacles get in your way including construction workers, rogue tires, skateboarders, dogs and cats, cars, and even the occasional tornado.</p>"},{"name":"Parlour Games","year":1987,"developer":"Compile"},{"name":"Penguin Land","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Penguin%20Land%20%28USA%2C%20Europe%29.zip","filesize":57491,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control","desc":"<p>In Penguin Land, you must control a penguin trying to get his (her?) egg down to the bottom of the level, while tunneling through ice to get there. Special egg and penguin blocks may make things easier, while polar bears and falling rocks will almost certainly slow you down.</p>"},{"name":"PGA Tour Golf","year":1991,"developer":"Sterling Silver Software"},{"name":"Phantasy Star","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Phantasy%20Star%20%28USA%2C%20Europe%29%20%28Rev%201%29.zip","filesize":319323,"score":8.2,"genres":"Role-playing (RPG) > 1st-person > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Direct control > Menu structures > Sci-fi / futuristic","desc":"<p>Algol is a star system that consists of three planets: the green Palma, the arid Motavia, and the icy Dezolis. Recently, the formerly benevolent king Lassic converted to a new religion and begins to rule Algol with an iron fist. Nero, the leader of a rebel group, is brutally killed by Lassic's robotic policemen. His last words were addressed to his sister Alis: he implores her to find a warrior named Odin. Alis swears revenge against Lassic and embarks on a journey to find Odin and other companions who would help her defeat the tyrant. </p><p><em>Phantasy Star</em> is commonly considered one of the progenitors of Japanese-style role-playing games. Unlike Dragon Quest, it has distinct anime-style visual aesthetics, and contains many characteristic gameplay elements of the genre. Rather than being cast as an adventurer or warrior on an impersonal quest, the player controls a character with her own background story, motivations and desires. The game introduces the genre's typical template of specific non-player characters joining the party for plot-related reasons. The game is also notable for being one of the first RPGs with a pre-determined female protagonist. It is set in a sci-fi environment in which advanced technology and magic co-exist, somewhat reminiscent of Star Wars.</p><p>The core gameplay is influenced by Ultima games, with simpler turn-based combat against randomly appearing enemies, which is similar to Wizardry. The player navigates Alis over top-down overworld, visiting towns and dungeons that are represented by icons. Dungeons have pseudo-3D graphics and are maze-like. </p><p>The player can purchase new weapons, armor, shields, as well as healing and restoring items in towns, or find them in treasure chests in the dungeons. Each character utilizes unique weapon types (e.g. Myau uses claws or fangs, Odin handles guns and axes, etc.). Experience points are awarded for defeating enemies; after a character has accumulated a sufficient amount of those, she or he levels up, gaining additional maximum hit points (HP) and higher combat parameters. Some characters can cast magic spells, requiring magic points (MP), which also increase when leveling up. Characters can visit doctors in towns, recovering HP and MP. Game progress can be saved anywhere.</p>"},{"name":"Pit Pot: The Magical Castle","year":1985,"developer":"SEGA Enterprises Ltd."},{"name":"Pit-Fighter","year":1991,"developer":"Atari Games Corporation","url":"b#Pit-Fighter%20%28Europe%29.zip","filesize":216453,"score":5.3,"genres":"Action > Side view > Arcade > Fighting","desc":"<p><em>Pit-Fighter</em> is a 3rd-person fight game that features digitized graphics of real fighters and zooming effects. Players select one of three fighters (Buzz, Ty or Kato) to take on anyone who dares. At the conclusion of a match, players are individually awarded a Knockout Bonus, Brutality Bonus, and a Fight Purse. Every third match is a Grudge Match where players test the skills of each other. The last man standing is the winner of this three-knockdown match. Players fight their way to the Elimination Match to decide who wins the opportunity to dethrone the champion, the Masked Warrior.</p>"},{"name":"Populous","year":1991,"developer":"Bullfrog Productions, Ltd."},{"name":"Poseidon Wars 3-D","year":1989,"developer":"SEGA Enterprises Ltd.","url":"b#Poseidon%20Wars%203-D%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":130061,"score":5.5,"genres":"Action > Simulation > 1st-person > Naval / watercraft","desc":"<p>In <em>Poseidon Wars 3-D</em>, you have just entered the navy as a cadet and you must make your way up to Admiral. To do this, you must go out at sea with a submarine and destroy several enemy targets. Once you have defeated each enemy target, the mission is completed, and, upon completing some of them, your rank increases. Before defeating each target, however, you also need to destroy enemy jets, choppers, and submarines who will launch missiles or rockets at you. If you are hit by any of these, damage is inflicted to the submarine, but you can shoot down any of the missiles or rockets. You will need to keep an eye on the built-in radar and sonar to find out where enemies will hit next. Your fuel is limited, and can be increased by destroying certain enemies. The game ends when your submarine is destroyed or you run out of fuel.</p>"},{"name":"Power Strike","year":1988,"developer":"Macrospace Ltd","url":"8#Sega%20-%20Master%20System.zip/Power%20Strike%20%28USA%2C%20Europe%2C%20Brazil%29%20%28En%29.zip","filesize":1,"score":7.5,"genres":"Action > Top-down > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>The Earth is threatened by mutant plant life and their brainwashed human followers. Only one force can stop the evil vegetables from taking root: Power Strike, the most versatile jet fighter in the world.  Blast the enemy in the air and on the ground and save the planet from the creeping green menace. </p><p>There are six rounds to complete (three in the mobile version). In each round, numbers (from 1 to 8) can be found on the ground either enclosed by a ring, or in the air carried by a ship. Getting these numbers will upgrade your firepower. Get more of the same number for a maximum upgrade. Unfortunately, whatever the type of firepower you get, you will have a limited supply of ammo, so you need to stock up on the same type of firepower if you get too low. </p><p>At the end of each round, there is an end-of-round boss which involves shooting parts of its base in order to destroy it. Intermediate bosses can be found in the last three rounds (console version only).</p>"},{"name":"Power Strike II","year":1993,"developer":"Compile","url":"8#Sega%20-%20Master%20System.zip/Power%20Strike%20II%20%28Europe%2C%20Brazil%29%20%28En%29.zip","filesize":1,"score":7.3,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Direct control","desc":"<p>In the early 1930s, people have lived in poverty since the great depression in 1929. Being laid off from their job, a great amount of pilots became the sky pirates in order to survive. The sea and the sky near Italy have been plundered by them. You earn a living by shooting down these pirates.</p><p><em>Power Strike II</em> is a top-down shooter where you must select which weapon you want to use during the game, and then fight your way through various stages, destroying both air- and ground-based enemies along the way. You can upgrade your weapons by collecting power-ups that can only be found by shooting specific ships. You will need to defeat the end-of-level boss (by destroying parts of it) in order to proceed to the next level.</p>"},{"name":"Predator 2","year":1992,"developer":"Teeny Weeny Games, Ltd.","url":"b#Predator%202%20%28Europe%29.zip","filesize":113858,"score":5.7,"genres":"Action > Diagonal-down > 2D scrolling > Sci-fi / futuristic > Licensed","desc":"<p><em>Predator 2</em> is similar to its 16-bit counterpart. The player controls Lt. Mike Harrigan in a side scrolling view (instead of an isometric one) through 7 levels.</p><p>Mike has to fight drug dealers and must rescue a certain number of hostages at each level. The Predator's three-dotted laser aim is a menace to avoid, which can kill either the hostages or Mike himself. Gang members killed drop drugs which can be picked up for points (and sent to the drugs squad). At the end of each level a boss must be defeated.</p><p>Mike can move and shoot in all 8 directions, but can only stop and shoot up, down, left and right. Besides his pistol, Mike can also collect new weapons such as grenades, shotguns, machine-guns and rifles. Body armor can be collected for health and med kits for extra lives.</p>"},{"name":"Prince of Persia","year":1992,"developer":"Brøderbund Software, Inc.","url":"b#Prince%20of%20Persia%20%28Europe%2C%20Brazil%29.zip","filesize":112382,"score":8.2,"genres":"Action > Side view > Fixed / flip-screen > Platform > Puzzle elements > Direct control > Middle East > Regional differences","desc":"<p>While the Sultan of Persia is fighting a war in a foreign country, his Grand Vizier Jaffar orchestrates a coup d'état. His way to the throne lies through the Sultan's lovely daughter. Jaffar kidnaps her and threatens to kill her if she refuses to marry him. Meanwhile, the man the Princess loves is thrown into the dungeon. He has only one hour to escape from his prison, defeat the guards on his way, and stop Jaffar before the terrible marriage takes place.</p><p><em>Prince of Persia</em> is a 2D platformer that is commonly regarded as a progenitor of the cinematic platformer genre. Rather than following the more common jump-and-run mechanics, it focuses on careful advancement through fairly complex levels, emphasizing the protagonist's vulnerability and survival aspect. Rotoscoping technique is used to give more realism to the animation of the characters' movements.</p><p>The protagonist must avoid deadly traps, solve some simple jumping and environmental puzzles (such as stepping on pressure plates to raise portcullis), and engage in sword fights with the guards. The player character has an infinite amount of lives, but has to restart at the beginning of a level each time he dies, and must complete the game within an hour. The hero starts with three units of health, which can be replenished with small health potions or permanently increased with large jars.</p><p>The Game Boy Color and SNES versions of the game feature additional levels and new enemies. The Genesis version has a new intro, an altered set of graphics and four new levels.</p>"},{"name":"Pro Wrestling","year":1986,"developer":"TRY Co., Ltd.","url":"b#Pro%20Wrestling%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":59989,"score":6.6,"genres":"Sports > Diagonal-down > 2D scrolling > Wrestling","desc":"<p>Pro Wrestling is an action wrestling game for one or two players. By using different controller combinations you can perform a wide variety of moves to try and beat your opponent in a 5 minute match. In the one player version, you need to fight your way to first place (but the game will be over if you fall below 6th place). There are seven different wrestlers to fight before you can be declared the Video Wrestling Association champion!</p>"},{"name":"Psychic World","year":1991,"developer":"Hertz Co. Ltd","url":"b#Psychic%20World%20%28Europe%2C%20Brazil%29.zip","filesize":129307,"score":6.4,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>A scientist and his two female assistants work on ESP research in a remote science laboratory.  One day, a section of the lab blows up.  It turned out that the monsters kept for experiments escaped and took one of the assistants with them.  The scientist gives an \"ESP booster\" to the remaining assistant so she can go rescue her.</p><p>Your character possesses psychic power which she uses to blast away her enemies.  You start the game with few powers and eventually gain more as items dropped by monsters are picked up.  You control powers such as fire, ice, sonic waves, temporary invincibility, levitation, and more.  Press Down + Button 2 to access your arsenal of powers.</p>"},{"name":"Psycho Fox","year":1989,"developer":"Vic Tokai Corporation","url":"b#Psycho%20Fox%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":98746,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p><em>Psycho Fox</em> is a platform game where you play a fox and you must get through seven worlds, consisting of three areas each. At the end of each world, there are one of seven bosses waiting to destroy you, but some of the later bosses are exactly the same as the earlier ones. The title is a bit misleading because you can also play as three other characters including Hippo, Leopard, and Monkey Boy. Each character has their own disadvantages. For example, Hippo is much slower than the other three. However, all the characters share one thing in common: they can use their fists and punch enemies as they approach them. They can also jump on them and keep knocking them in the ground until they disappear off the face of the earth. If they don't make them disappear, they will pop back out again and set out for revenge. Obstacles are scattered through each area, including spikes, cannonballs, escalators, fireballs, and steam.</p><p>You start the game with three lives. Once you touch an enemy, you lose a life. Lose all of your lives, and the game is over. If the game is over, you can continue where you left off. There are several items to find, and these can help you on your quest, and one of these items are eggs. If you break any of these eggs, either the \"switch\" item or the invincibility item is revealed. If you're lucky enough, a white bag is also revealed, but more often than not, one of your enemies can pop out from inside the egg. One egg will reveal a bird which you can carry for the rest of the game. This bird may be nothing but a pest, as it hinders your progress, but you can throw it at enemies to knock them out. It can also be used as a backup, meaning that you can have enemies touching you, but it is the bird that is killed, not you.</p><p>There is little chance that you'll find a white bag inside an egg, unless you go up into a secret area, which can often be found if you jump on springs that are scattered throughout the level. These white bags are useless, until you get to the bonus areas, which are at the end of each area. In these bonus stages, you can place a number of foxes on a path depending on how much white bags you've collected throughout each area.</p>"},{"name":"Putt & Putter","year":1992,"developer":"SIMS Co., Ltd."}]