[{"name":"R-Type","year":1988,"developer":"Irem Corp.","url":"b#R-Type%20%28World%29.zip","filesize":196492,"score":8.1,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p><em>R-Type</em> is a side-scrolling shoot 'em up best known for its extremely tough and strategic gameplay. You control the R-9 spaceship as it launches a last-ditch effort to repel the evil Bydo empire.</p><p>The R-9 comes equipped as standard with a small gun which can only take down the smallest of enemies without firing several shots. By holding down the fire button, it can be loaded up so as to release a large burst of energy, eliminating all but the strongest enemies in its path. From time to time, pods will come flying in your direction. Upon being shot, they release an upgrade. The first one will invariably be the one called \"The Force\", which is a weapons pod that clings either to the front or the back of your ship, absorbing any enemy bullets or acting as a bumper with which you can fly head-on into them. You can also use it as an offensive weapon by firing it and pulling it back in. Mastering the Force is vital to surviving in <em>R-Type</em> since it must be used both as protection against bullet clusters, as a remote-controlled cannon, and in order to clear the screen from obstacles. Other upgrades give you target-seeking missiles or a bigger main gun. Different gun types, differentiated by their color, serve different purposes. The blue one sends laser beams bouncing across the screen (good for tunnels), the red one fires straight ahead, and the yellow one follows any walls it may encounter (good for artillery emplacements).</p><p>The stages of <em>R-Type</em> are made in an organic style, certainly inspired by H. R. Giger's artwork for the Alien movies. When it came out, it was considered trendsetting since it broke off from the stereotypical sci-fi mold of other shoot 'em ups. In part, the levels themselves are your enemy, which is exemplified by the fourth, where spider-like creatures weave webs that cover the screen and block your path or levels with intricate tunnel systems. Still, the levels are best handled with a combination of strategy and reflexes, without the memorization that is required of R-Type's contemporary rival, Gradius.</p>"},{"name":"R.C. Grand Prix","year":1989,"developer":"Imagineering Inc.","url":"b#R.C.%20Grand%20Prix%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":81630,"score":6.4,"genres":"Racing / Driving > Diagonal-down > 2D scrolling > Isometric > Arcade > Automobile > Track racing","desc":"<p><em>R.C. Grand Prix</em> is an R.C. racing game with customizable options. You can upgrade your car, by adding higher capacity batteries and gear ratios in addition to the usual racer elements such as better suspension, tires and motors. You compete against 3 other opponents in this 3/4 overhead racer.</p>"},{"name":"Rainbow Islands","year":1993,"developer":"Taito Corporation","url":"b#Rainbow%20Islands%20%28Europe%29.zip","filesize":98843,"score":6.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>While on a search for treasure, Bubby and his brother Bobby travel to the Rainbow Islands. Instead of finding treasure, they find out that the people of the Rainbow Islands have been kidnapped. Now it's up to Bubby with his rainbow power to save them.</p><p>This version of <em>Rainbow Islands</em> has some differences from the original Rainbow Islands.</p><p>Some of the differences include:</p><ul><li>This version is 1 player only.</li><li>While the player visits the same islands as in the other version, the layout of the individual levels has been changed.</li><li>The different colored diamonds the player collects throughout the 4 stages of each island spell out the word RAINBOW. Completely spelling out the word then defeating the boss of that island will earn the player a big diamond.</li><li>Getting a big diamond gives the player a cutscene where they can choose to have dialogue with a character or open a treasure box for a chance to receive an item.</li><li>The biggest difference is, if the player manages to collect all 7 big diamonds, an extra island based on Bubble Bobble will be available to play on.</li></ul>"},{"name":"Rambo III","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#Rambo%20III%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":123160,"score":6.6,"genres":"Action > 1st-person > 2D scrolling > Shooter > Licensed","desc":"<p>Player will take the part of Rambo in this light phaser game, battling their way through Afghanistan in a solo rescue mission. There are two reasons for him to fight alone: the first is that the C.I.A. doesn't want to stir up a war, and the second is simply because this is Rambo! The mission is to rescue Rambo's comrade Colonel Trautman from the Soviets. He was taken in as prisoner while he was delivering weapons to the Mujahedin freedom fighters and is being held captive in a prison camp. </p><p>An AK-47 and grenades are the only weapons available. Additional grenades can be picked up by blasting open containers such as pots and crates. The goal is simple: eliminate all the enemies that appear on screen to reach the next stage!</p><p>The first stage is a Soviet army base packed full of soldiers. The next stage is a village where the Soviets are hiding. Then the rest of the levels are the mountains, the prison camp, the Soviet camp (night escape), the cave attack, then the final stage with the face-off between Rambo and the Mil Hind helicopter.</p>"},{"name":"Rambo: First Blood Part II","year":1986,"developer":"SEGA Enterprises Ltd.","url":"b#Rambo%20-%20First%20Blood%20Part%20II%20%28USA%29.zip","filesize":75612,"score":6.8,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Licensed","desc":"<p>A vertical-scrolling shooter in the tradition of Commando, Ikari Warriors, and Guerrilla War. Rambo and his buddy Zane (who didn't appear in the movie) are charged with blasting their way through various levels and rescuing the hostages. Of course, it won't be easy -- soldiers, tanks, and other enemies will do everything they can to stop you from saving the day. Unlike Ocean's later First Blood License, a single hit kills you, and your weapon is a gun rather than knives.</p><p>The game is in fact a re-branding of Ashura (known as Secret Commando in Europe), which explains why there is a second character on offer.</p>"},{"name":"Rampage","year":1988,"developer":"Bally Midway Mfg Co.","url":"b#Rampage%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":118637,"score":6.5,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Fighting","desc":"<p>George, Lizzy and Ralph were just ordinary Americans, until an experiment went wrong, turning them into a Gorilla, Lizard and Werewolf respectively. Following this, the three of them plan to go round destroying buildings, and up to 3 human players can join in.</p><p>Smashing at the edges of the buildings for long enough will make them collapse. The police and military are after you, and will shoot at you, so try to destroy them (failing that, you can avoid the bullets). You will need to eat regularly, with things like plants on offer, to avoid shrinking back to being human.</p>"},{"name":"Rampart","year":1993,"developer":"Atari Games Corporation","url":"b#Rampart%20%28Europe%29.zip","filesize":111215,"score":7.3,"genres":"Action > Strategy > Diagonal-down > Real-time > Arcade > Shooter > Licensed","desc":"<p>Tetris meets shoot-'em-up, <em>Rampart</em> is a game combining strategy and artillery action. Build your castle from Tetris-style pieces, place your cannons, bombard the enemy, try to repair, do it all over again. The original arcade release has a single-player and a two-player mode; later revisions incorporate three-player gameplay.</p>"},{"name":"Rastan","year":1988,"developer":"Taito Corporation","url":"b#Rastan%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":130307,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Fantasy","desc":"<p><i>Rastan</i> features five levels of hacking and slashing gameplay with a boss at the end of each level. Numerous enemies assault you on your journey such as flying demons, chimeras, valkyries, piranhas, undead and more. Fight through to the end and save the land of Lograth from certain doom.</p><p>The game features different weapons such as axes, maces and fire swords, each with its own attributes like extended range or attack power. Armour can also be picked up in the forms of shields, cloaks and armour, reducing the damage from enemy attacks. Other items include rings (increase the speed of your weapon) and jewelry for bonus points.</p>"},{"name":"Reggie Jackson Baseball","year":1989,"developer":"SEGA Enterprises Ltd."},{"name":"Renegade","year":1993,"developer":"Technos Japan Corp.","url":"b#Renegade%20%28Europe%2C%20Brazil%29.zip","filesize":119853,"score":6.4,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Regional differences","desc":"<p>This is the scrolling beat 'em up by Technos which started the Kunio / Nekketsu High series. The original takes takes place in a Japanese city, whereas its western version named <em>Renegade</em> is set on the mean streets of Brooklyn. This conversion later produced unofficial sequels Target: Renegade and Renegade III: The Final Chapter. You must venture through to meet your girlfriend, and then rescue her from her kidnappers. This is split into five levels, taking you through the subway and the docks as well as some inhospitable streets. A wide range of aggressive moves are on offer, including headbutts, kicks, punches and flying kicks. Much of the game's violence is depicted in a fairly tongue-in-cheek style, with an element of attempted humour along the way.</p>"},{"name":"Rescue Mission","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#Rescue%20Mission%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":76712,"score":6.4,"genres":"Action > Top-down","desc":"<p>Your comrades are wounded and stranded on the battlefield.  The only way to get to them, is via a handcart on a railroad track.  Your job is to protect the medics, who are riding the rails to get to the wounded.  In their path, are hordes of enemies on the ground and in the air shooting everything from fireballs to rockets.  In addition to the chaos, there are land-mines lying on the track just waiting to be run over.</p>"},{"name":"Road Rash","year":1994,"developer":"Electronic Arts, Inc.","url":"b#Road%20Rash%20%28Europe%2C%20Brazil%29.zip","filesize":300100,"score":7.6,"genres":"Action > Racing / Driving > Behind view > Motorcycle > Street racing","desc":"<p><em>Road Rash</em> is an aggressive motorcycle racing game where the player assumes the role of a biker who takes part in a series of illegal races across the U.S.A. Starting at the back of the pack the objective is always to finish first on a linear course, overtaking the other bikers. This is achieved by driving very well or by playing it dirty, knocking opponents of their bikes using clubs, crowbars or your bare hands. The other racers fight back in a similar fashion and there are also hazards. All the races take place on the regular road with normal traffic (in both directions) and the cops, as well as occasional oil slicks and stray cows.</p><p>By winning races you can get promoted to a stronger division and earn cash with which you can buy a better bike. Whenever you're knocked off your bike or hit something you will have to run back to your bike and lose valuable time, plus your bike will suffer some damage. When the player crashes with cops nearby, it is possible to get busted and then you have to forfeit the race.</p><p>Like the whole <em>Road Rash</em> lineage, the game has arcade-like gameplay with no intention to be a motorcycle simulation. While the game has a two-player mode, this is not simultaneous.</p>"},{"name":"RoboCop 3","year":1993,"developer":"Ocean Software Ltd.","url":"b#RoboCop%203%20%28Europe%2C%20Brazil%29.zip","filesize":129438,"score":5.7,"genres":"Action > Side view > Top-down > 2D scrolling > Arcade > Platform > Shooter > Sci-fi / futuristic > Crime > Licensed","desc":"<p><em>RoboCop 3</em> is a side-scrolling platform shooter. You get missions (such as rescuing your colleagues who are being kept hostages), which are divided into several smaller levels. The levels usually consist of several platforms, and are heavily populated by enemies who shoot at you. You can gather special repair kits, which will be used to restore your health after you've completed a level. \"RoboCop 3\" is more of a shooter than its predecessors, having more and tougher enemies.</p>"},{"name":"RoboCop versus The Terminator","year":1993,"developer":"Virgin Games, Inc.","url":"b#RoboCop%20versus%20The%20Terminator%20%28Europe%2C%20Brazil%29.zip","filesize":278651,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>The Dark Horse comic book crossover of the two famous 80s cyborgs spawned various different game adaptations. <em>RoboCop versus The Terminator</em> on Sega systems is only loosely based on the comic.</p><p>The player controls RoboCop who during his duty of policing the streets of Detroit is lured into a trap by Terminators sent from the future. By uploading himself into the computer network, he becomes the seed from which the malevolent Skynet grows. Years later, in the post-apocalyptic future, RoboCop is reactivated and must help the human resistance by attacking and defeating Skynet once and for all.</p><p>The game is a platformer with heavy shooting elements and consists of 10 levels. Many enemies stand in RoboCop's way and must be destroyed via 8 different weapons. RoboCop begins the game with only a basic pistol, but other weapons can be found, including flame and grenade throwers, laser guns, self-seeking missiles and others. While all guns have unlimited ammo, only two can be carried at the same time and being killed means the currently equipped gun is lost.</p><p>The game is evenly split between present and future levels. Enemies in present Detroit include mostly street punks and other criminal elements while the future is of course populated by deadly machines: Terminators, robotic dogs and spiders and many automated guns. Each level ends with a boss battle, featuring Terminators, heavy tanks and RoboCop's famous adversaries ED-209 and Cain (aka RoboCop 2).</p><p>Some levels feature optional goals besides getting to the exit, like freeing hostages or destroying security cameras.</p>"},{"name":"Rocky","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Rocky%20%28World%29.zip","filesize":117759,"score":6.2,"genres":"Sports > Side view > Boxing > Licensed","desc":"<p>Play as Rocky Balboa, the \"Italian Stallion\" in this boxing game. You confront opponents in a specific order, from Apollo the remaining champion, to Lang an aggressive contender, to Drago the Soviet boxer who trains constantly. Before you have a fight, just like in the \"Rocky\" movies, you have to train. Practice your timing and punching strength with some sandbag punching before fighting Apollo.  Warm up punching a punching ball to become more faster and smarter to get ready for Lang. Then you will do some punching mitts training before fighting Drago where you watch the mitts and punch at the as they move. All of these trainings have qualifications such as punches per second, qualify and your combinations get better for the following fight. </p><p>During a fight you only have one meter under your name, that is the power meter. Your opponent has one likewise. Watching your power bar can tell you a lot about which way the fight is headed, either it's full and you can take more punches and punch more powerfully or it's low and you're in  trouble. Watching the opponents power bar will tell you when to take him down or when to block.</p><p>Between rounds you get a chance to freshen up and get some last minute coaching. During the one minute interval, your power will go up only half of what has been drained. </p><p>If you do happen to take a fall the controls are similar to Nintendos \"Punch out\", basically you just press the 1 and 2 buttons as fast as possible. Hopefully Rocky stands up and is ready for more.</p>"},{"name":"Running Battle","year":1991,"developer":"Opera House Inc.","url":"b#Running%20Battle%20%28Europe%2C%20Brazil%29.zip","filesize":115465,"score":5.6,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Shooter","desc":"<p><em>Running Battle</em> is a brawler-type beat'em up game where the player has to beat up waves and waves of thugs. The story is about a city taken over by the sinister \"M.\" and his \"Soldiers of Darkness\". You control a policeman called Grey who sets out alone to destroy the gang and avenge the murder of his partner Brody.</p><p>Unlike most games of the genre, the player can only move left and right, not up and down. The gameplay is very basic. The character's movements involve only punching, jumping, ducking and jump-kicking. A number of items, which appear in the levels, can be found. These include health regain, temporary boosts in strength and several types of firearms.</p><p>The game has five levels, each of them divided into sections and ending with a boss fight. The sections can be crossed completely without taking out a single enemy, only to leave the player is required to beat the enemies currently on screen. Unlike most beat'em ups, <em>Running Battle</em> is an exclusively single-player game.</p>"},{"name":"Rygar","year":1988,"developer":"Tecmo, Ltd."}]