[{"name":"Special Criminal Investigation","year":1992,"developer":"Taito Corporation","url":"b#Special%20Criminal%20Investigation%20%28Europe%29.zip","filesize":117933,"score":6.9,"genres":"Action > Racing / Driving > Behind view > Shooter > Automobile > Crime","desc":"<p>Three girls have been reported missing including the mayor's daughter, and Chase Special Investigations has asked you to track down five vehicles, mentioned in the mission briefing, who are believed to be involved in the kidnapping. Using a heavy-designed machine with a V6 DOHC 3000CC Twin Turbo Engine, five sets of nitro-fuel boosts, and a gun attached to the steering wheel (which you can use to damage the target vehicle), your mission is to patrol the streets and find these vehicles.</p><p>The gameplay is similar to Chase H.Q., but there are a few differences. For example, cars travel in both directions instead of one, and some of them will catch up to your car and shoot at you. At least once in every stage a helicopter does a fly by and drops you some grenades you can use to further damage the target vehicle. A guy on a motorcycle will catch up to you and throw grenades at your car. And, most importantly, as mentioned earlier, you can shoot at the target vehicle rather than just bumping into it.</p><p>Have fun driving around, but remember, there is a strict time limit, so I wouldn't waste time or keep crashing into things if I were you.</p>"},{"name":"Sagaia","year":1992,"developer":"Taito Corporation","url":"b#Sagaia%20%28Europe%2C%20Brazil%29.zip","filesize":135500,"score":7.3,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>Long time ago, the planet of Darius went into ruin but Proco and Tiat of Darius gave birth to a new planet and named it Orga. After the passing of many centuries, Proco Jr. and Tiat Young receive a strange radio broadcast from the galaxy. They discover the radio broadcast is a mayday signal from another descendant of Darius. They board the Silverhawk, preparing to defeat an evil force and journey to the galaxy.</p><p><em>Darius II</em>, or <em>Sagaia</em> as it is known in the West, is the second installment in Taito's shoot 'em up series. Its main distinguishing features are the non-linear level system and the enemies, which are different kinds of seafood.</p>"},{"name":"Sapo Xulé vs. Os Invasores do Brejo","year":1995,"developer":"SEGA Enterprises Ltd."},{"name":"Sapo Xulé: O Mestre do Kung Fu","year":1995,"developer":"SEGA Enterprises Ltd."},{"name":"Sapo Xulé: S.O.S. Lagoa Poluída","year":1995,"developer":"SEGA Enterprises Ltd."},{"name":"Satellite 7","year":1985,"developer":"AM R&D Dept. #2"},{"name":"Scramble Spirits","year":1989,"developer":"SEGA Enterprises Ltd.","url":"c#Scramble%20Spirits%20%28Europe%29.zip","filesize":1,"score":5.8,"genres":"Action > Top-down > 2D scrolling > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>Sega's take on the 1943 style of vertically scrolling shoot 'em ups was set in the future. Your fighter plane is aged and under-powered, yet you must face down large planes, tanks and ground targets to achieve victory. Each level ends with a close-viewed section of particular intensity before finally facing a boss. Smart bombs are occasionally found lying around, and can destroy everything on the screen, although you can't use them on the bosses. A simultaneous 2-player mode is provided.</p>"},{"name":"Sega Chess","year":1991,"developer":"Probe Software Ltd."},{"name":"Sega World Tournament Golf","year":1993,"developer":"SEGA Enterprises Ltd."},{"name":"Sensible Soccer: European Champions","year":1993,"developer":"Eurocom Developments Ltd"},{"name":"Shadow Dancer: The Secret of Shinobi","year":1991,"developer":"Team Shinobi","url":"b#Shadow%20Dancer%20-%20The%20Secret%20of%20Shinobi%20~%20Shadow%20Dancer%20%28Europe%2C%20Brazil%29.zip","filesize":220826,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p><em>Shadow Dancer</em> is a one-player game in which you control Shinobi. With the help of your dog, you must kill your enemies while you venture through locations such as airports, railroads, waterfalls, sewers, and more. Furthermore, you must find and disarm several bombs along the way before you leave each. You also have the option of using magic against enemies, which may consist of tornadoes or fireballs.</p><p>There are four missions you must complete; and each one has different objectives such as obstructing the enemies deadly mission, disrupting the enemy's supply route, raiding the enemy's industrial units, attacking the enemy's underground forces, and liberating and securing the shuttle's base. Each mission consists of three stages and there is a boss on each of the mission's final stages. </p><p>What's good about the dog, you say? Well, if you tell it to, the dog will maul enemies (provided that the dog barks at them when you face them) and distract them long enough so that you can shoot at them. Remember that you have a limited time to do this, as the enemy will eventually kick the dog off him. This causes the dog to yelp and shrink, making him powerless against them.</p>"},{"name":"Shadow of the Beast","year":1992,"developer":"Reflections Interactive Limited","url":"b#Shadow%20of%20the%20Beast%20%28Europe%2C%20Brazil%29.zip","filesize":139632,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>While very young, Aarbron was kidnapped and enslaved by the Priests of the Beast Lord. He grew up on drugs made to destroy his own will and turn him into the Beast Messenger, a powerful creature serving Maletoth, The Beast Lord himself. He did his job, until one day he noticed a man about to be sacrificed in a ritual, his face triggering ancient memories. As the sacrificial knife descended into the man's body, Aarbron recognizes his father's face. As his father dies in the altar, memories of his childhood and tormented past at the hands of the Beast Lord emerged, and as feelings of hate over his captors took over him, he swore revenge and fled the temple, knowing the road to avenge his father and redemption would be hard.</p><p><em>Shadow of the Beast</em> is a side-scrolling platformer with a side-shooter elements (by the end). The player has to navigate through several areas filled with enemies and traps, collecting keys and activating triggers that open new areas or give Aarbron the means to overcome a sub-boss. The number of moves the player has at disposal is limited: duck, jump and only two attacks: punch and a flying kick. While most enemies die with just one hit, the player must time each attack accurately. However, there are also traps of objects that cannot be destroyed and these require the player to jump, duck or move according the sequence. The player has only one life with 12 hit points that can be replenished by collecting some objects hidden in the level (like an off-route location or a under a megalith), which also contributes to the difficulty level.</p>"},{"name":"Shanghai","year":1988,"developer":"Activision, Inc."},{"name":"Shinobi","year":1988,"developer":"Team Shinobi","url":"b#Shinobi%20%28USA%2C%20Europe%2C%20Brazil%29%20%28Rev%201%29.zip","filesize":133772,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control > Fantasy","desc":"<p>You control a shinobi, Joe Musashi, who must battle his way through each level in search of hostages which must be rescued. You have shurikens, kicks and punches to defend yourself with, as well as powerful ninja magic which can clear the screen of enemies in one go.</p><p>Each level is broken down into smaller scenes, and hostages are guarded by big blokes who throw swords. Watch out for gun-toting enemy henchmen and ninjas.</p><p>Reaching the end of each level will find you battling it out with a boss. These range from 8ft tall giants to helicopter gunships.</p>"},{"name":"Shooting Gallery","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#Shooting%20Gallery%20~%20Shooting%20G.%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":46381,"score":6.6,"genres":"Action > 1st-person > Shooter","desc":"<p>Using your Sega Light Phaser, you are given a specified length of time to shoot as many targets as you can before the music fades out. The targets include birds, balloons, blimps, balls, and spaceships; some difficult, some not so difficult. As you progress through the rounds, the game gets difficult. For example, in Levels 3 &amp; 4, you have to shoot balls that pass through a set of pipes and come out the other end, and on Level 5, you can't shoot the spaceships if they are protected by a shield, and have to wait until the shield disappears, but not for long. The game ends when you don't shoot enough targets.</p>"},{"name":"Simpsons, The: Bart vs. the Space Mutants","year":1992,"developer":"Imagineering Inc.","url":"b#Simpsons%2C%20The%20-%20Bart%20vs.%20the%20Space%20Mutants%20%28Europe%2C%20Brazil%29.zip","filesize":145367,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy > Licensed","desc":"<p><em>Bart vs. The Space Mutants</em> is a platform game where the player goes into the role of Bart Simpson (from the TV show The Simpsons) and must stop the Space Mutants from invading Springfield.</p><p>On each of the five levels, Bart must collect (or get rid of) the ingredients that the Space Mutants are planning to use to build their machine, such as purple objects or balloons. He also has to collect enough \"proof\" of the aliens existence (brown coins left behind when they are jumped on), so his family members will help him when he meets a boss (characters such as Nelson and Sideshow Bob). This won't be easy since the Space Mutants are \"using\" human bodies as disguise. In order to discover who are the real Space Mutants, Bart must use his X-ray Specs.</p><p>The ways Bart can get rid of those objects sought by the Space Mutants are numerous. For instance, in the first stage, Bart must get rid of purple objects. He can dye them red, cover them, wash them, etc. Some even involve a little puzzle solving, like playing a trick on Moe to make him get out of the bar.</p><p>Bart also has some coins that can be used in many ways throughout the game, like buying things, getting devices operating, etc. Those coins are essential to solve some puzzles in the game.</p>"},{"name":"Simpsons, The: Bart vs. the World","year":1993,"developer":"Arc Developments","url":"b#Simpsons%2C%20The%20-%20Bart%20vs.%20the%20World%20%28Europe%2C%20Brazil%29.zip","filesize":168087,"score":6.3,"genres":"Action > Puzzle > Sports > 1st-person > Side view > Top-down > 2D scrolling > Fixed / flip-screen > Arcade > Cards / tiles > Game show / trivia / quiz > Platform > Skateboarding > Licensed","desc":"<p>This game is actually a compilation of smaller games belonging to different genres. Krusty the clown appears in the beginning of the game and presents a menu with five games to play (one of which is not available from the start): A jump-and-run game, where Bart must find an exit on a ship, while enemies fire at him and try to prevent him from reaching the exit; a card game, where you have five tries to find hidden cards on a board; a simple jigsaw puzzle; a series of trivia questions concerning the Simpsons; and finally, a platform-skateboard game (available only after you have completed the ship level). Needless to say all games are connected to the famous TV series \"The Simpsons\".</p>"},{"name":"Sítio do Picapau Amarelo","year":1998,"developer":"Tec Toy Indústria de Brinquedos S.A."},{"name":"Slap Shot","year":1990,"developer":"Sanritsu Denki Co., Ltd.","url":"b#Slap%20Shot%20%28Europe%29%20%28Rev%201%29.zip","filesize":106277,"score":6.5,"genres":"Sports > Diagonal-down > Hockey","desc":"<p><em>Slap Shot</em> is an ice hockey game with 24 national teams. They are divided into three pools with different skill levels and in single-player only matches between teams from the same pool can be played. The available playing options are exhibition matches or a tournament. Regarding gameplay, the player either controls the athlete with the puck or one from the defense (including the goalkeeper) and one button is used for passing and another for shooting. From time to time two athletes get in a fist fight and the loser has to visit the penalty box. Overall the graphics and gameplay are similar to Blades of Steel.</p>"},{"name":"Smurfs Travel the World, The","year":1995,"developer":"Virtual Studio"},{"name":"Smurfs, The","year":1994,"developer":"Bit Managers S.L.","url":"c#Smurfs%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":1,"score":7,"genres":"Action > Side view > 2D scrolling > Licensed","desc":"<p>The evil Gargamel has captured three of the smurfs, so that he can have them for dinner (Once again). One of the smurfs must go out on a dangerous journey and rescue the captured smurfs. Beat the first two bosses to rescue the first two smurfs, then you can take on Gargamel. Make your way through forests, swamps, mountains, mines and more. Also ride storks, mine carts and logs to defeat Gargamel and his minions and to rescue the missing smurfs. </p><p>On each level you must collect five stars in order to get access to the bonus level (You don't have to collect the five stars in order to get through the main level). On the bonus level, try to collect as many bonuses as possible before the time runs out. There are three bonus levels: \"The Dam\", \"The Mushrooms\" and \"The Butterflies\".</p>"},{"name":"Solomon's Key","year":1988,"developer":"Tecmo, Ltd."},{"name":"Sonic Blast","year":1997,"developer":"Aspect Co., Ltd.","url":"b#Sonic%20Blast%20%28Brazil%29.zip","filesize":458347,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Sonic Blast</em> was released for Game Gear in conjunction with Sonic 3D Blast (aka Sonic 3D: Flickies' Island) for Genesis/MD and Saturn. It boasted similarly rendered character sprites and colorful backgrounds. The game was yet another addition to the series, plus Sega had hoped it would be a boost to the dying Game Gear's title selection at the time. Brazilian based TecToy re-released the game for Sega Master System in 1997, a year after the initial release (while many may think this is a pirated title, TecToy is indeed licensed to produce and release games under the Sega name).</p>"},{"name":"Sonic the Hedgehog","year":1991,"developer":"Ancient Co. Ltd.","url":"b#Sonic%20The%20Hedgehog%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":146860,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform","desc":"<p>SEGA's mascot Sonic the Hedgehog made his debut in a famous Genesis title, but Sega's 8-bit systems got their own version of the platformer, featuring the same story and gameplay style, but different levels.</p><p>To stop the evil Dr. Robotnik, Sonic must traverse six zones consisting of three levels each. Most of the zones are based on those in the original game, but some are entirely new, including a jungle environment and a huge airship. Other unique differences are one level that scrolls automatically and one that is aligned vertically instead of horizontally. Most of the enemies (mechanized animals, defeated by Sonic's spikes when jumping or rolling) and power-ups (speed-ups, shields, extra lives) are the same as in the Genesis version as well. Sonic can pick up golden rings for protection (when hit, he simply loses all of his rings instead of a life) and bonuses: 100 rings gain Sonic an extra life, and 50 remaining rings at the end of a level allow access to pinball-themed special stages full of bumpers and springs. The final level of a zone is always a boss fight against Robotnik. Some of the boss fights differ in the Master System and Game Gear versions of the game, with special designs for the handheld version due to the smaller visible screen area.</p><p>Sonic should also collect the six Chaos Emeralds to keep them from falling into Robotnik's hands. In a departure from the original game, these are not hidden in the special stages but somewhere in the regular levels.</p>"},{"name":"Sonic the Hedgehog 2","year":1992,"developer":"Aspect Co., Ltd.","url":"b#Sonic%20The%20Hedgehog%202%20%28Europe%2C%20Brazil%29%20%28Rev%201%29.zip","filesize":218475,"score":7.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform","desc":"<p>Coming back from the vacation Sonic took after foiling the plans of Dr Robotnik, he finds that Tails and all his other animal friends are missing. Sonic finds a letter waiting for him, that reads:</p><p>*\"Dear Sonic,</p><p>Robotnik is back, and he's captured all the animals on the island! He is holding me in a place called the Crystal Egg. In order to free me, you have to find and bring the six Chaos Emeralds.</p><p>Robotnik made me write this. He says he's waiting for you, and he's created six really nasty robots in order to 'get rid of you once and for all.' I don't know what he has planned, but Sonic, please be careful!</p><p>Sincerely, Tails.\"*</p><p>That being more than enough motivation for him, Sonic races out to defeat Robotnik again.</p><p>The Master System version is totally different than the Sonic 2 for Genesis. Tails obviously doesn't accompany you, like he can in the Genesis release. Sonic can also <strong>not</strong> do his infamous buzzsaw roll by simply ducking and pressing jump.</p>"},{"name":"Sonic the Hedgehog Chaos","year":1993,"developer":"Aspect Co., Ltd.","url":"b#Sonic%20Chaos%20%28Europe%2C%20Brazil%29.zip","filesize":209542,"score":7.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform","desc":"<p>The inhabitants of South Island are in danger! Dr. Robotnik has stolen all the Chaos Emeralds which kept the power balance. Robotnik has thrown the Emeralds in a parallel universe and is keeping the red one. Sonic and Tails must retreive all the Chaos Emeralds before the destruction of South Island.This is the first Game Gear game where you can play either Sonic or Tails.</p>"},{"name":"Sonic the Hedgehog: Spinball","year":1994,"developer":"SEGA Interactive Development Division","url":"b#Sonic%20Spinball%20%28Europe%2C%20Brazil%29.zip","filesize":234600,"score":6.8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Pinball > Platform","desc":"<p>Dr. Robotnik plans on turning the animals of Mobius into robots by using his volcano powered Veg-O=Fortress factory. He has set up a pinball security system for this factory to keep all the captured animals from escaping. Now it's up to Sonic the Hedgehog to free his captive animal friends and put a stop to Robotnik's plans.</p><p>The game consists of four pinball stages. Sonic will have to get through the Toxic Pools, Lava Powerhouse, The Machine, and The Final Showdown to take down Robotnik. The levels consist of typical pinball fair such as bumpers, flippers, annd drop targets which open up gated parts of a stage. In stage 1 and 2 Sonic must collect 3 chaos emeralds, and 5 chaos emeralds in stages 3 and 4, in order for a chance to fight the stage boss. There are also the Bonus Cage special stage that can be played after a stage boss is defeated. During this portion of the game, Sonic can find items that will reward him with things like extra time, points, rings. continues, or extra lives. The game also offers a one last chance to return to the game after running out of lives by having the player attempt to stop a spinning number wheel on a four digit number that matches the player's last four digits of their current score. </p><p>This version of <em>Sonic the Hedgehog: Spinball</em> differs from the Genesis version as the stage layouts are different among other changes.</p>"},{"name":"Sonic's Edusoft","year":1991,"developer":"Tiertex","url":"b#Sonic%27s%20Edusoft%20%28Unknown%29%20%28Proto%29.zip","filesize":123401,"score":"","genres":"Educational","desc":"<p>Sonic's Edusoft is an unreleased educational game in the Sonic the Hedgehog series that was developed by Tiertex Design Studios. The game was to feature Sonic the Hedgehog and release for Sega Master System in 1991.</p>"},{"name":"Space Gun","year":1992,"developer":"Taito Corporation","url":"b#Space%20Gun%20%28Europe%29.zip","filesize":343862,"score":6.3,"genres":"Action > 1st-person > Arcade > Rail shooter > Sci-fi / futuristic","desc":"<p>2039 A.D. Man begins deep space exploration in search of new life forms and usable fuel sources. What he discovers is trouble.</p><p>Until now, the success of past explorations was causing the space effort to grow by leaps and bounds. Until now, the explorers had found little more than fungus and small insects as alternativelifeforms. Until now, the chief dangers had been those posed by the hostile environment of space. Until now, the aliens had not known about THEM.</p><p>On the ragged edge of the galaxy, other creatures that roam the stars discover humans and spaceships to be excellent sources of food and other resources. Prepared at the worst for clashes with rival exploration teams, the human crews can do little todefend themselves as wave upon wave of nightmarecreatures descend upon their ships and bases.</p><p>In response to their distress calls, the Federation has assembled a series of rescue teams, lead by their best military sharpshooters, to deal with the alien menace. As the leader of one of these teams, you must gun down the intruders and pick up the human survivors. Brave the maze of dark corridors that may lead to a deadly shootout between you and legions of monsters. Pick up survivors and extra ammo on the way.</p>"},{"name":"Space Harrier","year":1986,"developer":"AM R&D Dept. #2","url":"b#Space%20Harrier%20%28Europe%29.zip","filesize":167332,"score":7.1,"genres":"Action > Behind view > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>Run… fly… dodge those obstacles, but return fire on wave after wave of attacking aliens. Armed with a really big gun, you have to defend yourself against the alien hordes using your wits to navigate around the screen. But watch out for those end of level bosses!</p><p>Originating in the arcades, <em>Space Harrier</em> is a third-person rail shooter with pseudo-3D graphics, set in the same world as Fantasy Zone. The lone titular hero fights aliens with a fireball-launching cannon, which can also be used to transform the hero into a flying rocket. The protagonist is constantly in motion, but the speed of his movement can be regulated by the player.</p>"},{"name":"Space Harrier 3-D","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#Space%20Harrier%203-D%20~%20Space%20Harrier%203D%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":152911,"score":6.8,"genres":"Action > Behind view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Space Harrier 3-D is more like Space Harrier  1 1/2.  While it's not a direct sequel to Space Harrier, it was designed to take advantage of the 3-D glasses available at the time.  This game is considerably darker than the original and the sequel in both look and feel.  Even the digitized voices are deeper in tone, creating a sense of urgency about it.  Things are obviously not right in Space Harrier's world.  But if you're familiar with the original, the premise is the same; blow everything up and fight the boss at the end.</p>"},{"name":"Speedball","year":1990,"developer":"The Bitmap Brothers"},{"name":"Speedball 2: Brutal Deluxe","year":1992,"developer":"The Bitmap Brothers"},{"name":"SpellCaster","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#SpellCaster%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":299641,"score":7.3,"genres":"Action > Adventure > 1st-person > Side view > 2D scrolling > Metroidvania > Fantasy > Licensed > Regional differences","desc":"<p><em>SpellCaster</em> is an action/adventure game where you play the role of Kane, who has been summoned by Daikak, the great leader of the Summit Temple, where he trained in the ancient art of battle, to check on a group of warriors that were sent by him to guard a temple, but as he left, he felt grim certainty that the coming events would not be pleasant. Whatever the future held would forge him as certain as fire forges a strong sword.</p><p>The game takes place in two adventure formats: action and adventure scenes. In the action scenes, you take on a horde of enemies as you make your way toward the temple, being careful not to use up all your strength. Some of the enemies will drop one of two spheres: a blue sphere that, when collected, increases your strength; and an orange sphere that increases your energy. More often than not, there will be a boss waiting inside the temple, and you have to defeat them to continue with your journey. When you defeat them, a giant blue ball will be dropped, and that will give you maximum strength.</p><p>The adventure scenes allow you to select a series of commands that allow you to travel to new locations, talk to characters, look at various objects, take items, and use existing items. When you decide to look, you can either look at the terrain, or some other object. When you decide to look at any object, a pointing finger will allow you to highlight the object which you are interested in. You can also use various spells throughout the game, which can be used to defeat someone, help them. But they can be used to help you instead. These spells include:</p><ul><li>HAKUJI - Focuses your \"Ki\" energy into a beam of destructive light!</li><li>INDRA - Calls on the Thunder God to storm lightning on your enemies.</li><li>FUDO - Calls forth a great ball of fire!</li><li>KANNON - A kinder spell that returns the walking dead to the underworld. But it is not effective against all evil spirits.</li><li>MARS - Calls on the God of War to restore your strength.</li><li>HATTEN - Calls on the God of Winds to send a tornado or high winds against your enemies.</li><li>MAKIRI - Gives you the power to fly!</li><li>NOBOTA - Creates a shield impervious to all the enemy's missile at.</li><li>PASSWORD - Allows you to password a point in the game, so that you can resume at that point later.</li></ul>"},{"name":"Spider-Man","year":1990,"developer":"SEGA of America, Inc.","url":"b#Spider-Man%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":144948,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Kingpin is framing Spider-Man for planting a bomb in New York City. Spider-Man only has 24 hours to find the keys that will let him disarm the bomb and clear his name.</p><p>The game consists of eleven stages including boss fights and bomb defusal. The game has a counter that continually counts down until the bomb will explode. After the second stage, Spider-Man is given the option to exit a stage at anytime to return home and recover his health, but doing so will cost him precious time and he will have to restart the stage from the beginning again.Spider-Man must search through each stage thoroughly as the boss of the stage will only appear when all the humanoid enemies are defeated.</p><p>Spider-man can punch, kick, jump, and can also fire a webshot that will temporarily stun enemies. Spider-Man can also climb walls and use his webs to swing. Spider-Man can only use his web powers as long as his web cartridges are not empty. Spider-Man can refill his web cartridges by taking photos of the supervillains he comes across and selling the photos to the Daily Bugle newspaper.</p><p>The game has four difficulty levels with the hardest difficulty level Nightmare featuring random attacks from Venom.</p><p>A same titled game came out for the Genesis that features a similar story and general level progression, but the design of the levels are different.</p>"},{"name":"Spider-Man: Return of the Sinister Six","year":1992,"developer":"B.I.T.S., Ltd.","url":"b#Spider-Man%20-%20Return%20of%20the%20Sinister%20Six%20%28Europe%2C%20Brazil%29.zip","filesize":152834,"score":6.2,"genres":"Action > Side view > 2D scrolling > Licensed","desc":"<p>From the ingame intro:</p><p>\"Doctor Octopus is plotting the crowning caper of his criminal career... to rule the world.He has reunited the Sinister Six and with these super-villains together again, nothing stands in their way - except Spider-Man!\"</p><p><em>Spider-Man: Return of the Sinister Six</em> is a side-scrolling game which puts you in the role of Spidey throughout six levels against Electro, Sandman, Mysterio, Vulture, Hobgoblin and Doctor Octopus respectively. Some puzzle solving (like finding a key) is necessary to beat some levels. Spidey can duck jump, climb walls, punch, shoot webs to swing (by pressing punch and jump together) and perform a jump kick (by pressing the punch button twice). Collecting web cartridges allows Spidey to shoot limited web projectiles.</p><p>Although hard to die, Spidey has only one life, there are no items to recharge life (but killing some guys will do so) and only one continue.</p>"},{"name":"Spy vs Spy","year":1986,"developer":"First Star Software, Inc.","url":"b#Spy%20vs%20Spy%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":22670,"score":7.2,"genres":"Action > Strategy > Side view > Fixed / flip-screen > Puzzle elements > Spy / espionage > Licensed","desc":"<p><em>MAD</em> magazine’s comic strip of the same name comes to life in this game which was designed for one or two players. The split-screen shows both spies at the same time. Play with a friend or against the machine.</p><p>The black spy and the white spy are out to outsmart each other before the time bell rings. Find the needed objects (money, passport, secret plans and airport door key) by searching rooms in the embassy, which include desks, file cabinets and other furniture. Foil your opponent by setting creative booby traps in the various rooms (a bomb in a dresser drawer, for instance). Traps can be disarmed with objects found in rooms (a water bucket from a firebox on the wall will disarm the bomb in the prior example). When all the items are together in the secret briefcase, head for the airport door.</p><p>Fights ensue when both spies enter the same room and are armed with clubs.</p>"},{"name":"Star Wars","year":1993,"developer":"NMS Software Ltd."},{"name":"Street Fighter II","year":1995,"developer":"Capcom Co., Ltd.","url":"b#Street%20Fighter%20II%27%20%28Brazil%29.zip","filesize":394507,"score":7.1,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p>Before the flashy graphics, 3D animation and 30 hit turbo combos, there was the simple dragon punch and fireball. In this very scaled down version of the original Street Fighter II arcade game, you can choose from a select group of warriors including Ryu, Ken, Guile, Blanka, M. Bison, Chun Li, Zangief, Balrog and Sagat, each with a unique fighting style and special moves. Play through the one-player arcade mode and fight your way through each character in the game to the final boss, Bison, or play against a friend in two player mode.</p>"},{"name":"Streets of Rage","year":1993,"developer":"SEGA Enterprises Ltd.","url":"b#Streets%20of%20Rage%20%28Europe%2C%20Brazil%29.zip","filesize":210147,"score":7.9,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Beat 'em up / brawler","desc":"<p><em>Streets of Rage</em>, Sega's answer to Final Fight, follows the story of three young police officers (Adam Hunter, Axel Stone and Blaze Fielding) in a city controlled by a criminal syndicate led by a \"Mr. X\" where crime is rampant, which leads the three heroes to make a pact to leave the force and topple the syndicate by themselves.</p><p>Gameplay is straightforward and simple. Three buttons are used, one to jump, other to attack and another to perform a range attack from a support police car. Each character has a limited set of moves that include punching and kicking or performing a back attack (if in the open), two grapple moves (depending if holding the opponent in front or by the back), a flying attack, and if playing with another player two additional tag attacks, and different abilities: Adam is slow, but a good jumper and a hard hitter, Axel fast and also a hard hitter, but a lousy jumper and Blaze fast and a good jumper, but weak hitter.Levels are in typical arcade side-scroller fashion: move from left to right (with two exceptions), clearing screens from enemies one after another as fast as possible while avoid taking damage with a boss in the end. Some levels feature \"death drops\" where the player must avoid falling, while throwing enemies there at the same time, including a typical elevator level. Several items are scattered on the ground, from melee weapons and bonus points (and lives or additional police cars) to apples and turkeys (to restore health).</p>"},{"name":"Streets of Rage II","year":1993,"developer":"Shout!Designworks Co., Ltd.","url":"b#Streets%20of%20Rage%20II%20%28Europe%2C%20Brazil%29.zip","filesize":257721,"score":8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Beat 'em up / brawler > Direct control","desc":"<p>After Axel Stone, Blaze Fielding and Adam Hunter destroyed the evil Syndicate leader, Mr. X, the city became a peaceful place to live, and each one of them followed their own paths. One year later, after their reunion, Adam's brother Sammy returned from school to find their apartment in a mess, and Adam nowhere to be seen, and after calling his two friends, one of them notices a photo of Adam chained to a wall, next to someone they knew very well - Mr. X, who returned to turn the peaceful city once again into a war zone. Now, Axel, Blaze, Sammy, and Axel's good friend Max, a pro wrestler, must head out to stop Mr. X once again...hopefully for good...</p><p><em>Streets of Rage 2</em> differs from the previous title in several ways. There are changes in both graphics (characters now are bigger, more detailed and with more animation frames, and scenarios are less grainy) and gameplay (the rocket move was replaced by a special move that doubles in offense and defense along several new moves), along other new features such as life bars (and names) for all enemies and the radically different new characters.</p>"},{"name":"Strider","year":1991,"developer":"Capcom Co., Ltd.","url":"b#Strider%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":139444,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Sci-fi / futuristic","desc":"<p>The year is 2048 AD. In Russia, the evil Grand Master Meio has begun his insane plot to take over the universe. A lone figure drops from a stealth glider into Meio's base. He is Hiryu, Super A-Class Strider. His mission is to defeat the Grand Master and put an end to his plotting once and for all.</p><p><em>Strider</em> lets the protagonist run, jump, perform acrobatics and climb walls and overhangs. He wields a plasma sword, called a Cypher, through five levels fighting robots and guards, with mid- and end-level bosses.</p>"},{"name":"Strider II","year":1992,"developer":"Tiertex Ltd.","url":"b#Strider%20II%20%28Europe%2C%20Brazil%29.zip","filesize":118841,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Strider has been called into action to save the people of the planet Magenta, armed with a Gyro laser and matter converter. He must fight his way through a forest, a ruined city, underground colonies, a roof-top battle, and finally the prison ship in which the Megantan leader is held.</p><p>The gameplay is similar to the original, consisting of running, jumping and attacking, with a very dynamic central character. The laser gun can be used while standing still; moving attacks with the sword are still possible, with the two weapons combining similarly to the Switchblade games. Tokens can be collected, which will turn you into a robot to face the end-of-level enemies if enough are collected.</p>"},{"name":"Submarine Attack","year":1990,"developer":"SEGA Enterprises Ltd.","url":"b#Submarine%20Attack%20%28Europe%2C%20Brazil%29.zip","filesize":131343,"score":6.8,"genres":"Action > Side view > 2D scrolling > Shooter > Naval / watercraft","desc":"<p>In <em>Submarine Attack</em>, the player controls a submarine in an underwater environment. The player must shoot down enemies that are coming toward them using missiles either at the front or rear of the sub.</p><p>There are six stages in the game, and at the end of each one, the player has to defeat a boss who requires multiple shots to kill. One the player defeats a boss they proceed to the next, more difficult stage.</p>"},{"name":"Sukeban Deka II: Shōjo Tekkamen Densetsu","year":1987,"developer":"AM R&D Dept. #2"},{"name":"Summer Games","year":1988,"developer":"Epyx, Inc."},{"name":"Super Boy 4","year":1992,"developer":"Zemina Co."},{"name":"Super Boy I","year":1989,"developer":"Zemina Co."},{"name":"Super Boy II","year":1989,"developer":"Zemina Co."},{"name":"Super Boy III","year":1991,"developer":"Zemina Co."},{"name":"Super Kick Off","year":1991,"developer":"Enigma Variations Ltd.","url":"c#Super%20Kick%20Off%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%29.zip","filesize":1,"score":6.9,"genres":"Sports > Top-down > Football (European) / Soccer","desc":"<p><em>Super Kick Off</em> is an enhanced developed version of the popular football game developed by Dino Dini for consoles. It includes 40 teams (16 national and 24 club), along the ability to edit club team names and shirts and player names and looks. Game modes include friendlies, Domestic League and Cup (composed by eight English teams), European League (16 European teams) and International cup (eight team tournament). Training allows to practice free kicks, penalties or to pass, shoot and dribble without opposition. Players can compete head to head, or play cooperatively against the computer in the same team. Other game options include player speed, wind and grass cut, along the typical half length, offside rules, extra time and difficulty setting. All changes, from team edits to options, are stored in the cartridge internal memory.</p><p>About the game itself, it was one of the most popular of the time, featuring a top-down view with the ball not sticking to the players' feet being the most prominent gameplay feature.</p>"},{"name":"Super Monaco GP","year":1990,"developer":"SEGA Enterprises Ltd.","url":"b#Super%20Monaco%20GP%20%28USA%29.zip","filesize":102830,"score":7.5,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Super Monaco GP</em> is a first-person perspective racing game which allows you to race other cars around the famous Monaco Grand Prix course. You first must qualify for a position on the grid by driving round a shortened version of the course on your own. The faster you drive the higher placing on the grid. The actual race has you competing against 19 other drivers and as well as trying to beat them all you must get to checkpoints within a time limit or it is race over. You also have to stay ahead of a certain position which starts at 20th and gets lower the longer the race goes on.</p><p>The Genesis version of Super Monaco adds a complete career mode, however. In the career mode, your goal is to win a season of races. Unfortunately, you start with a relatively slow car. By challenging other drivers, you can move to a better team and car, and ultimately win the F1 World Title. As well as the famous Monaco course, others from around the world have been added, to give the game a longer shelf life.</p>"},{"name":"Super Off Road","year":1993,"developer":"Leland Corporation","url":"b#Super%20Off%20Road%20%28Europe%29.zip","filesize":63353,"score":6.9,"genres":"Racing / Driving > Diagonal-down > Fixed / flip-screen > Automobile > Off-roading > Track racing > Licensed","desc":"<p>Enter the world of off-road racing as 4 vehicles will face each other, on a series of tracks which are based around flipped and reversed versions of a core selection. Fame, glory and bikini clad women await your victories and the taste of dirt awaits if you fail. Let a computer car beat you and you lose one of your 3 credits.</p><p>Successful races bring more money, which can be used to soup up their machine. Boosts to top speed, grip and acceleration can be purchased, and your nitro boost must be kept topped up. If you are desperate for upgrades, you can buy into your spare credits.</p><p>Only your off-road driving abilities will be enough to pull you to first place in these races. Play alone or with up to 3 other players (depending on the version)  in this classic arcade game.</p>"},{"name":"Super Racing","year":1988,"developer":"SEGA Enterprises Ltd."},{"name":"Super Smash T.V.","year":1992,"developer":"Williams Electronics Games, Inc.","url":"b#Super%20Smash%20T.V.%20%28Europe%29.zip","filesize":102286,"score":7.3,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The year is 1999. The world's most popular television show is Smash T.V., an ultra-violent contest between two armed-to-the-teeth combatants, set loose in a series of deadly arenas that are filled to bursting with hordes of mindless beasts and killer robots. The aim of the game is to blast everything in sight and try to grab more cash and prizes than the other guy. Toaster ovens, VCRs, fancy cars and luxury holidays are there for the taking... for anyone who can survive long enough to enjoy them.</p><p><em>Smash T.V.</em> is an insane shoot-em-up from the brain of Eugene Jarvis, creator of Robotron: 2084. It retains that game's frantic style of play and two-joystick control method, but adds plenty of gore, violence, a hint of satire and that all-important two player mode.</p>"},{"name":"Super Space Invaders","year":1991,"developer":"The Kremlin","url":"b#Super%20Space%20Invaders%20%28Europe%29.zip","filesize":136909,"score":7.1,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Remember that arcade classic Invaders? Well this game takes it to the next level with harder aliens, bosses, power ups, and a variety of scenery!  Invaders come in several configurations for you to try to blast, and power-ups help you with more weapons to choose from.</p>"},{"name":"Super Tennis","year":1985,"developer":"SEGA Enterprises Ltd.","url":"c#Super%20Tennis%20%28USA%2C%20Europe%29.zip","filesize":1,"score":5.1,"genres":"Sports > Diagonal-down > Tennis","desc":"<p><em>Super Tennis</em> offers to control an unknown tennis player against a AI opponent, in various tennis courts, competing to win matches. The tennis players can be moved around freely on the court and the regular rules are followed. A third-person camera perspective is used, from a fixed perspective. The two buttons on the controllers are use to hit straight and fast, and to lob. When close to the net, volleys and smashes are also possible. Multiplayer is supported for two players, head to head or in a doubles game with or against AI opponents.</p>"},{"name":"Superman: The Man of Steel","year":1993,"developer":"Graftgold Creative Software","url":"b#Superman%20-%20The%20Man%20of%20Steel%20%28Europe%2C%20Brazil%29.zip","filesize":87916,"score":5.4,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Superman: The Man of Steel</em> is a side-scrolling platform game in which the player takes on the role of Superman.</p><p>A lot is wrong in the game: Lois Lane has been kidnapped by Brainiac, the Doom Star is orbiting the Earth and many deadly adversaries are roaming about. It's up to Superman to set everything right again.</p><p>As Superman the player has limited energy which is depleted when Superman comes in contact with enemies or their projectiles. Superman can jump, and attack. When Superman almost drops from a building he automatically starts flying. There's three different difficulty settings.</p>"},{"name":"Sydney Hunter and the Sacred Tribe","year":2019,"developer":"CollectorVision Games Inc."}]