[{"name":"T2 - The Arcade Game","year":1993,"developer":"Probe Software","url":"b#T2%20-%20The%20Arcade%20Game%20%28Europe%29.zip","filesize":257126,"score":6.7,"genres":"Action > 1st-person > Arcade > Rail shooter > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>This is an arcade rail-shooter based on the film <em>Terminator 2: Judgment Day</em>. Up to two players shoot through future and present levels as robotic killers reprogrammed to serve the human resistance. </p><p>Both players wield a machine gun with infinite ammo that lowers its firing rate (overheats) as it is continuously fired. A secondary weapon (missile launchers in the future, shotguns in the present) has limited ammo but deals heavy damage. Powerups inside the game world include secondary weapon ammo and coolant for the machine guns, and are shot to be collected.</p><p><em>Terminator 2: Judgment Day</em>, renamed <em>T2: The Arcade Game</em> for home conversions, features seven levels based on specific scenes or general concepts in the film. The first four levels act as a prelude, as the player guns down waves of metal Terminators across a post-apocalyptic Battlefield, a besieged Human Hideout, and through the security checkpoints of the enemy supercomputer SkyNet. After destroying the computer, players travel back in time to protect John and Sarah Connor, while also destroying every scrap of SkyNet research at the headquarters of its manufacturer. From there, players must fend off the indestructible T-1000 until the final showdown in the Steel Mill.</p><p>Assets from the movie are used when possible, such as voice clips from Arnold Schwarzenegger, and close-up digital stills of Robert Patrick for the final battle against the T-1000. The Genesis and SNES versions also support lightguns (the Menacer and Super Scope, respectively).</p>"},{"name":"Taz in Escape from Mars","year":1997,"developer":"HeadGames, Inc."},{"name":"Taz-Mania","year":1992,"developer":"SEGA Enterprises Ltd.","url":"b#Taz-Mania%20%28Europe%2C%20Brazil%29.zip","filesize":102814,"score":6.7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Oceania > Licensed","desc":"<p>One evening, Taz's father is telling an intriguing tale. Somewhere on Tazmania is a Lost Valley, and in that valley nests a huge seabird, so huge that one of it's eggs could feed a family for a year! Just think of the omelette one of those could make!</p><p>Thus Taz becomes fascinated and leaves in search of one of those eggs before his Dad has even finished the story...</p><p>Taz can Jump, perform a Spinning Jump and a Spin Attack. Munch roast chickens to replenish life. Gain extra points by moving quickly through the levels - there are six stages and each stage has two rounds.</p><p>There are a few other items and pickups such as:</p><ul><li>Spring: boings Taz up to high ledges.</li><li>Blocks: destructible.</li><li>1-UP: extra life.</li><li>Star: invulnerability. Unless you run into a bomb.</li><li>Bomb: does what it says on the tin.</li></ul>"},{"name":"Tecmo World Cup '93","year":1993,"developer":"Tecmo, Inc.","url":"c#Tecmo%20World%20Cup%20%2793%20%28Europe%29.zip","filesize":1,"score":6.9,"genres":"Sports > Diagonal-down > Football (European) / Soccer","desc":"<p>The World Cup rolls around once every 4 years for a chance for countries to show the world how good they are at this single sport, football (also known as soccer). Even though there was no World Cup held in 1993 the game <em>Tecmo World Cup ’93</em> has the main teams and rules the World Cup is famous for.</p><p>Tecmo World Cup ’93 is a football game that simulates the World Cup from the Pools to the elimination rounds that end with the finals. It has the option to play the 24 most known countries to have played in the World Cup, each with players having there own skill levels based on the real teams. There are 3 more modes to chose from that includes Versus where the player can play against a friend, Exhibition where one the player picks a opponent to play a single match, and Watch where the player picks two CPU players to battle it out alone.</p><p>When playing a game the player first picks the team they want to play (and there opponents team if in Exhibition mode) and the color of there jersey before the CPU picks a random jersey color for their team. Before the match starts the player can set up the formation of the team and can also set up who plays and their position, this menu can also be accessed when a goal is scored or the ball goes out. The players (that are all abbreviated to there initials) have stats for Power, Speed, and Technique. When the game starts the player is presented with a side on birds’ eye view of the field. The player, when in control of the ball can pass the ball to the closest team mate or attempt for a goal. When defending the player can change the controlling player or do a slide tackle (slide tackle is the only tackle the player can do). There is no penalties in the game other then kicking the ball out. The game is fast paced as it is played in sped up mode to get a full game in a reduced time. There are 3 levels of difficulty and the default game length can be changed in the configuration. Password save after each match is available.</p>"},{"name":"Teddy Boy","year":1985,"developer":"SEGA Enterprises Ltd.","url":"b#Teddy%20Boy%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":21086,"score":6.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Direct control > Licensed > Regional differences","desc":"<p>As Teddy Boy, you must use your gun to shoot at enemies that come out of the boxes that are scattered around the level. You have limited time to do this. The number of enemies that come out of these boxes depends on the number being shown on the face. When you shoot enemies, they turn into little balls which you quickly need to collect. If you do not, the balls will be transformed into little creatures that eat away time. Once you have destroyed all enemies, you advance to the next level. when you stand in the same spot for too long, the floor will disintegrate, causing you to fall down to the below platform. From time to time, you will play a bonus game, where you get the choice of either a third-person shooting gallery, or a treasure hunt where you play Yohko.</p>"},{"name":"Tennis Ace","year":1989,"developer":"SEGA Enterprises Ltd.","url":"c#Tennis%20Ace%20%28Europe%29.zip","filesize":1,"score":6.6,"genres":"Sports > Top-down > Tennis","desc":"<p>Using a top-down view, <em>Tennis Ace</em> lets you play single or double games with computer players. Two human players can either duel or work cooperatively in a doubles game. By working your way to one of the six grand slam finals, with practice games and exhibition matches, you gain experience, which improves your playing style.</p><p>All the basic strokes are available: serves (either flat or a lob - fast-low, slow-high and curved), smashes, drop shots, lobs, flat forehands and backhands. Upon serving, the screen switches to a side-view and you have to time the throw and the hit to perform a succesful serve.</p><p>The in-game progress can be saved with a password function.</p>"},{"name":"Tensai Bakabon","year":1988,"developer":"AM R&D Dept. #2"},{"name":"Terminator 2: Judgment Day","year":1993,"developer":"Software Creations Ltd.","url":"b#Terminator%202%20-%20Judgment%20Day%20%28Europe%29.zip","filesize":139065,"score":5.3,"genres":"Action > Racing / Driving > Side view > Arcade > Fighting > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Terminator 2: Judgment Day</em> is based on the movie of the same name. The player takes the role of the T-800 Terminator and has to protect John Connor from being terminated by the T-1000 Terminator. </p><p>The game is set over five levels with the following goals:</p><ul><li>Level 1: Acquire a weapon.</li><li>Level 2: An isometric racing course on a motorcycle in which the player needs to out-run a tanker truck that is chasing them. This stage was omitted from both the Game Gear and Master System versions.</li><li>Level 3: Locate and rescue Sarah Connor from the Pescadero asylum.</li><li>Level 4: Plant explosive charges to destroy the Cyberdyne building.</li><li>Level 5: Defeat the T-1000 within the steel mill.</li></ul>"},{"name":"Terminator, The","year":1992,"developer":"Probe Software Ltd.","url":"b#Terminator%2C%20The%20%28Europe%29.zip","filesize":128455,"score":6.4,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Direct control > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p><em>The Terminator</em> licensed game for the Sega consoles was a fairly standard side-scrolling platform game. However, the game's six levels mirror the story-line of The Terminator movie very closely as you take on the role of Kyle Reese and his quest to save Sarah Connor from termination.</p><p>Because the game follows the movie so closely, the first mission which involves blowing up the SkyNet computer and escaping through time is one of the hardest and something that most players remember with love/hate.</p>"},{"name":"Three Dragon Story, The","year":1989,"developer":"Zemina Co."},{"name":"Thunder Blade","year":1988,"developer":"SEGA Enterprises Ltd.","url":"b#Thunder%20Blade%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":119891,"score":6.7,"genres":"Action > Behind view > Top-down > Shooter > Direct control > Helicopter","desc":"<p>Aboard the lethal Gunship Gladiator helicopter, it is your job to ensure that a coup fails to install a dictator as leader. </p><p>The game features 12 levels split into three distinct styles. First of all you'll be flying over a city in your helicopter, shooting out tanks by ducking low enough to target them, but also climbing to avoid the skyscrapers in the area. The third section is viewed similarly, but sees you attempting to wipe out the planes mounted on an aircraft carrier.</p><p>The second section is viewed behind your helicopter in full 3D, and adds helicopters and planes to be shot, with dodging their bullets as you duck down to shoot the tanks being the main challenge.</p>"},{"name":"Time Soldiers","year":1989,"developer":"Alpha Denshi Kōgyō Co., Ltd.","url":"b#Time%20Soldiers%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":121185,"score":6.5,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>You are a Time Soldier, who is asked to rescue five warriors from different time periods: Sirius in the \"Primitive Age\", Laplace in the \"Age of Rome\", Dymos in \"The World Wars\", Alpha in the \"Age of Rome\", and Altair in \"Future World\". Each one of them is guarded by one of Gylend's henchmen, but to get to them, you must fight off other enemies that are specific to each time era. Some of these enemies will drop weapons that you can pick up and use. You can use several teleports scattered in each time era to travel to another.</p>"},{"name":"Tom and Jerry: The Movie","year":1992,"developer":"SIMS Co., Ltd.","url":"b#Tom%20and%20Jerry%20-%20The%20Movie%20%28Europe%2C%20Brazil%29.zip","filesize":114151,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>As in the popular cartoon series, Tom the cat is once again after that little mouse Jerry. The player plays as Tom, a curious cat who will do anything to get his paws on that trouble-maker mouse, Jerry. Tom tries to catch Jerry as he runs through six different levels. Starting in the Kitchen, Jerry will lead Tom through the Garden, Down Town, the Forest, Rock Mountain, and finally ending up in the Nursery.</p><p>Jerry will do anything he can to keep Tom from snagging him. Even if that means running through dangerous areas. Tom must try and dodge tail-scorching stoves, dropping flower pots, falling boulders, and even climb skyscrapers and swim underwater all while trying to nab that rascally rodent. Not only that, Jerry will also throw bombs and leave land mines in Tom's path.</p><p>Be careful, if Jerry gets too far ahead and out of site, the game is lost. But, if Tom is able to get close enough, he can pounce on Jerry resulting in advancing to the next level. The next level can also be reached to by chasing Jerry to the end of the round where he will be cornered. There are also damage points that are taken away from Tom as he is hit by the number of dangerous environments around him. Too many hits will also result in a game over. It is just another hard days work for Tom the cat!</p>"},{"name":"Toto World 3","year":1993,"developer":"Open Production"},{"name":"TransBot","year":1985,"developer":"SEGA Enterprises Ltd.","url":"b#TransBot%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":22634,"score":5.9,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>Back in the solar year 2000 there was a nuclear war, and people are finally now emerging from underground to build a new society. But something is still wrong. DALAUS, a leftover computer from the old world is creating its own empire, and it is up to you to stop it. To complete this mission you will pilot a CA-214 (the TransBot), a new experimental astro-plane. TransBot is a side scrolling shooter for one or two players. There are a wide variety of enemies you will need to get past to be victorious throughout the many locations. The CA-214 can have different types of weapons to help out. You start out with a basic, default gun, but after collection a ? symbol you can choose a new weapon to use. There are six choices which will scroll past at the top of the screen, and your TransBot will be powered with whatever selection you make. Powered up weapons will only last for a limited amount of time before the TransBot reverts back to the basic weapon.</p>"},{"name":"Trivial Pursuit - Genus Edition","year":1992,"developer":"Oxford Digital Enterprises Ltd.","url":"c#Trivial%20Pursuit%20-%20Genus%20Edition%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":1,"score":6.9,"genres":"Puzzle > Side view > Top-down > Fixed / flip-screen > Turn-based > Board game > Game show / trivia / quiz","desc":"<p>This is the earliest home computer incarnation of Horn Abbot International Ltd's classic board game, <em>Trivial Pursuit</em>. The game involves answering questions on one of six subject categories to gain moves, and answering questions on special squares to gain one of the six 'Wedges' you need to gain the right to take on the final winning question. Questions are aimed at British players - many entertainment questions are based on British TV, and sport questions relate to popular British sports.</p><p>Two game modes are available: Single Player (which involves answering questions against the clock) and Multiplayer (where you can take on up to five human-controlled players). The computer reveals the answer, and you select 'yes' or 'no' to tell it whether you got it right.</p><p>The question categories are exactly the same as the board game: Art &amp; Literature, Science &amp; Nature, Geography, History, Sports &amp; Leisure, and Entertainment. However two different question styles are added to take advantage of computer technology - some questions relate to a picture or diagram and some relate to a piece of music. </p><p>One additional feature not available in the board game is a statistical analysis of the number and type of questions answered correctly. This can be split into the performances of all the players, or the performance of an individual player within the six categories. It is especially useful at the end of the game, when choosing which category a player must answer to win the game.</p>"},{"name":"Turma da Mônica em: O Resgate","year":1993,"developer":"Westone Co., Ltd."}]