[{"name":"Vampire: Master of Darkness","year":1992,"developer":"SIMS Co., Ltd.","url":"b#Master%20of%20Darkness%20%28Europe%2C%20Brazil%29.zip","filesize":164669,"score":8,"genres":"Action > Side view > 2D scrolling > Platform > Horror","desc":"<p><em>Master of Darkness</em> is a platformer very similar to Castlevania.</p><p>You play as a psychologist trying to defeat Dracula. This requires you to fight your way through several spooky locations such as cemeteries, laboratories, castles or a house of wax dolls. To defeat your enemies, you can use several primary and secondary weapons. Primary weapons are close combat weapons ranging from knifes to rapiers and axes, that differ in range and efficiency. Secondary weapons are long-range weapons (pistols, bombs etc.) with limited ammunition. The game features 5 Rounds divided into 3 stages. At the end of each stage, a boss must be defeated.</p>"},{"name":"Vigilante","year":1989,"developer":"Irem Corp.","url":"b#Vigilante%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":125007,"score":6.2,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Direct control","desc":"<p><em>Vigilante</em> is a side-scrolling beat-em-up. It features an anonymous tough hero that roams the streets to beat up The Rogues gang that kidnapped his girlfriend Maria. The game offers five distinct locations, such as city streets and a junkyard, with many different thugs with different strengths. You fight with your fists, feet and a chain, with a regular stance, crouched and jumping attacks. Each level features an end boss which requires a specific tactic in order to progress. Enemies keep spawning continuously from the left and the right side of the screen until the boss is reached, so a steady pace forward is required to reach the end of the level before time runs out. When enemies come too close they will grab the character and quick presses left and right are need to set him free, as he is then vulnerable to incoming attacks.</p>"},{"name":"Virtua Fighter Animation","year":1997,"developer":"Aspect Co., Ltd.","url":"b#Virtua%20Fighter%20Animation%20%28Brazil%29.zip","filesize":432571,"score":6.2,"genres":"Action > Side view > Anime / Manga > Fighting > Licensed","desc":"<p><em>Virtua Fighter Animation</em> is an one-on-one 2D fighting game based on the Virtua Fighter anime series. It has two game modes: story and versus.</p><p>In the story mode, the player follows the anime's plot, with anime style cutscenes before and after each fight. The story is divided in acts, each one of them corresponding to one fight. The player starts controlling Akira Yuki, as he beats his opponents, each one of them joins his party, so they can be chosen in the next fights. Besides Akira, the other characters which become available are Pai Chan, Jacky Bryant, Wolf Hawkfield, Kage-Maru, Sarah Bryant and Lau Chan. In the final act, the player must fight against Dural.</p><p>The versus mode allows players to choose any of the seven available characters to fight against the CPU. In the two player versus game, Kage-Maru is removed from the character selection.</p><p>The Game Gear version has 3 different viewing modes: Normal, Large and Real-Time. The Normal viewing mode shows the fighters from a more distant position (smaller sprites) than the Large mode (larger sprites). The Real-Time mode simulates the zooming camera effects from the other Virtua Fighter games, alternating between the Normal and Large modes. It also has an extended intro sequence, with anime style cutscenes.</p><p>In regards to gameplay, the game doesn't differ much from any other 2D fighting game, as the player can perform punches (button 1), kicks (button 2) and jumps (up), as well as some special maneuvers. The Game Gear version has also a block function (START button), absent in the Master System version. The fights are regular best of 3 round matches, and players will loose a round if one of this three possibilities happen: their energy is depleted, they fall out of the ring or they have less energy than the opponent if the time runs out.</p>"}]