[{"name":"Walter Payton Football","year":1989,"developer":"SEGA Enterprises Ltd.","url":"c#Walter%20Payton%20Football%20%28USA%29.zip","filesize":1,"score":7,"genres":"Sports > Top-down > Football (American) > Licensed","desc":"<p><em>Walter Payton Football</em>, or <em>American Pro Football</em>, as it is called in Japan and Europe, is a simulation of American football. There are two modes in the game. One is called \"Monday Night Game\" and is the same as a friendly game or exhibition mode; the other is \"Road to Superbowl\", and is basically a play-off tournament in the NFL.</p><p>The player can choose his favorite NFL team to compete against the computer or another player. The game allows you to assign basic strategies to the teams, both in defensive and offensive plays. The game is viewed from a top-down perspective, with the exception of kick offs and field goals, which are viewed up close from a third person perspective, and allow the player to regulate the strength of the kick.</p>"},{"name":"Wanted","year":1989,"developer":"Sanritsu Denki Co., Ltd.","url":"b#Wanted%20%28USA%2C%20Europe%2C%20Brazil%29.zip","filesize":70506,"score":6.8,"genres":"Action > Side view > 2D scrolling > Shooter","desc":"<p>In this game, you play Michael Chen, and your job is to fight your way through seven stages.</p><p>Gameplay is split into two parts. The odd-numbered stages require you to shoot gunslingers that hang out at saloons, hotels, and towns. When a gunslinger threatens you with a gun, you have only seconds to shoot him before you lose some life.  If this happens, you can increase your life meter if you shoot barrels that are scattered across town, and then detonating the bomb that is revealed, wiping out gunslingers in sight. You must be careful not to shoot innocent civilians or gunslingers who surrender, or you also lose life. At the end of these rounds, the leader will come out of a building and will move side-to-side, occasionally shooting you if he has the chance.</p><p>In the even-numbered stages (except stage six), you are required to ride across a desert, shooting gunslingers that ride past you. You can increase life by shooting the only gunslinger not on a horse and then detonating the bomb that is revealed. At the end of these levels, you will be faced with a challenging stage, where the object is to shoot as many targets as you can before time runs out.</p>"},{"name":"Where in the World is Carmen Sandiego?","year":1988,"developer":"Brøderbund Software, Inc.","url":"b#Where%20in%20the%20World%20is%20Carmen%20Sandiego%20%28USA%29.zip","filesize":74005,"score":"","genres":"Educational > Puzzle > Side view > Menu structures > Geography > Detective / mystery","desc":"<p>The Master System version of Where in the World is Carmen Sandiego? keeps the gameplay mechanics of the computer original. The main difference is the interface: instead of navigating text menus, the player directly controls the detective through the side-scrolling cities. There are two landmarks to look out for: buildings (entering them allows to question people) and a phone booth to enter the suspect's characteristics (eye color is replaced with vehicle). If the player is on the correct track, the suspect may show up and take a shot - the player must jump over it in order to avoid losing time.</p>"},{"name":"Wimbledon Championship Tennis","year":1993,"developer":"SIMS Co., Ltd."},{"name":"Wimbledon II","year":1993,"developer":"SIMS Co., Ltd.","url":"c#Wimbledon%20II%20%28Europe%29.zip","filesize":1,"score":7.1,"genres":"Sports > Diagonal-down > Tennis > Licensed","desc":"<p><em>Wimbledon II</em> is a tennis game based on the championship with the same name. </p><p>The game features two modes: Free Match allows for singles or doubles games and supports one or two players. Tour Mode puts the player on the road, playing the best in the world for the championship cup. Players may create their own characters and save the progress via a password system. Three kinds of surfaces are available: hard, lawn, and clay; all of which affect the ball’s behaviour.</p>"},{"name":"Winter Olympics: Lillehammer '94","year":1994,"developer":"U.S. Gold Ltd.","url":"c#Winter%20Olympics%20-%20Lillehammer%20%2794%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CSv%2CNo%29.zip","filesize":1,"score":6.1,"genres":"Sports > Olympiad / mixed sports > Snowboarding / skiing > Licensed","desc":"<p>This is the official license of Winter Olympics tournament in 1994 at Lillehammer, Norway. You can practice in any event before the tournament. The game offers two modes - Full Olympics and Mini Olympics, which vary in the number of events.</p><p>It includes 5 different types of sports - biathlon, alpine skiing (downhill, slalom, giant slalom and Super-G), ski jumping (90 m, 120 m), bobsleigh (2/4 men bob, 1/2 men luge) and skating (elimination, pursuit, time trial).  The events use 3D views.</p>"},{"name":"Wolfchild","year":1993,"developer":"Core Design Ltd.","url":"b#Wolfchild%20%28Europe%2C%20Brazil%29.zip","filesize":147334,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p>Dr. Kal Morrow, expert in genetic research and creation of human-animal hybrids, has been kidnapped and his family brutally murdered by the terrorist organization CHIMERA. His surviving son Saul takes it upon himself to avenge his family. Using his father's research, he turns into a man-wolf and sets out to find CHIMERA's base and defeat their leader Karl Draxx.</p><p>As Saul, it is your job to traverse five different areas on your way to Draxx. When Saul collects enough power-ups, he turns into his wolf form and gains a special psychic shot attack, which can be improved by collecting further power-ups. However, if Saul loses health, he turns back into his human form and only has his fists to fight the numerous enemies.</p>"},{"name":"Wonder Boy","year":1987,"developer":"Escape","url":"b#Wonder%20Boy%20%28USA%2C%20Europe%2C%20Brazil%29%20%28Rev%201%29.zip","filesize":77913,"score":7.3,"genres":"Action > Side view > 2D scrolling > Arcade","desc":"<p>Just when things were going great with Tom-Tom and his girlfriend Tanya, some thug of a woodland king had to kidnap her and hide her away, and Tom-Tom doesn't have a clue where. That's why he has to explore deep dark forests, cross endless oceans, climb treacherous slopes, survive endless volcanoes, and even walk through clouds. But Tom-Tom will never be totally alone. You see, when he goes through the exotic locations, he has to come face to face with its inhabitants, like bees, spiders, snakes, coal-kids, frogs, bats, snails, coyotes, and octopuses, to name a few. The hatchet is Tom-Tom's only line of defense against these menaces.</p><p>There are ten areas, each containing four rounds each, but the tenth area can't be accessed unless Tom-Tom collects all the dolls during his rescue mission. During his journey, he can break open different eggs that will reveal hatchets, skateboards, mushrooms, milk, and even guardian angels. You can ride the skateboard through each round, as long as you don't collide with an inhabitant. When you complete each round while still riding the skateboard, you'll start the next round still riding it. As you progress through each round, your vitality will start to get low, but it can be increased by getting milk, mushrooms, potato chips,or fruit that appear everywhere you go. As well as the normal eggs, there are also speckled eggs that must be avoided, otherwise the God of Death will be released, and once he follows you, you'll lose vitality much quickly. At the end of every fourth round, there is a king waiting to destroy you with his fireballs or lightning bolts.</p><p>There are also warp-gates, but you don't find them, they find you. Warp-gates appear in rounds 1-4 of each area. If you happen to get one fruit, a special item will appear. These special items include handbags, wrist watches, a pair of shoes, a teddy bear, and a bottle of perfume. Another girl will appear and take you up to the clouds where the object is to collect as many hearts as you can without falling down or getting the item again. Once you have collected all the hearts, you can get the item to return to the surface, and more often than not, you'll get further in the round.</p>"},{"name":"Wonder Boy III: The Dragon's Trap","year":1989,"developer":"SEGA Enterprises Ltd.","url":"b#Wonder%20Boy%20III%20-%20The%20Dragon%27s%20Trap%20%28USA%2C%20Europe%29.zip","filesize":139309,"score":8.4,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > RPG elements > Fantasy","desc":"<p><em>Wonder Boy III: The Dragon's Trap</em> is a direct sequel to Wonder Boy in Monster Land. When Tom-Tom defeats the MEKA dragon, the wounded beast casts a spell on him, turning him into a Lizard-Man. To regain his original human form, he has to find the Salamander Cross, hidden by the Vampire Dragon in Monster Land.</p><p>Unlike its predecessor, this side-scrolling platform game is not divided into sequences of levels. The protagonist is allowed to go anywhere, as long as he has the right shape or equipment. During his quest, Tom-Tom has to defeat various dragon bosses. Each win will give him a new shape with new abilities such as flying, swimming, walking on ceilings, or clinging to walls. These abilities also allow the player access to new parts of the world. The possible shapes are Lizard-Man, Mouse-Man, Piranha-Man, Lion-Man, and Hawk-Man, and the main abilities are defined by attacking power, defense points, and charm points (needed for equipment by collecting charm stones). Also, certain blocks can only be destroyed by specific weapons or are only accessible to certain shapes.</p><p>The basic actions consist of attacking and jumping, and in the status screen, it is possible to equip swords, shields, and armor. Special attacks include fireballs, tornadoes, arrows, boomerangs, and thunder strikes. Along the way, the player collects keys (only one at all times) and gold left behind by defeated creatures, and places need to be re-visited sometimes to access new areas. Equipment and items can be bought in towns. A password is given at the beginning of each town to continue from there.</p><p>The Game Gear version has minor tweaks to level layouts to accommodate the smaller resolution better. Prices of shop items have also changed.</p>"},{"name":"Wonder Boy in Monster Land","year":1988,"developer":"Escape","url":"b#Wonder%20Boy%20in%20Monster%20Land%20%28USA%2C%20Europe%29.zip","filesize":131599,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > RPG elements > Licensed > Regional differences","desc":"<p>Eleven years have gone by since Tom-Tom rescued his girlfriend Tanya from the clutches of the evil King. Word of Tom-Tom's dangerous adventure soon spread throughout Wonder Land. The people were very proud of him and gave Tom-Tom the highest honor of all - the legendary name of Wonder Boy. With the evil King defeated, Wonder Land returned to its peaceful state, and for over one decade, the kingdom was a paradise, and everything and everyone lived happily together.</p><p>Eventually, the peace was broken when a ferocious fire-breathing dragon appeared out of nowhere and took over Wonder Land with an army of evil, monsterous henchmen, causing Wonder Land was immediately thrown into utter chaos. Defenseless that they were, the people were quickly taken over and the tranquil and serene kingdom was transformed into a land of demons and devils. Wonder Land was now a Monster Land. Tom-Tom was summoned to set out on a journey, destroy this dragon, and restore peace once again. Tom-Tom is Wonder Land's last hope.</p><p>There are twelve locations in which Tom-Tom must venture through, including (but not limited to): the city of Wonder Land, Valley of Peace, The Coastal Town of Baraboro, The Mam Desert, and Pororo Islands. During his journey, he must defeat monsters with the sword that he got at the beginning of his adventure. These monsters will leave either gold coins or bags of cash, which he can use to buy better weapons, shields, armors, and boots. At the end of each location, there is usually a boss that Tom-Tom must defeat in order to obtain a gold key that will unlock the exit gate, as well as plenty of gold coins or bags of cash. If he touches any enemies, or is shot at, he will lose health. During his travels, Tom-Tom must take note of the hourglass; if the hourglass display sands at the bottom, he must get another one that appears out of nowhere, or he'll also lose health. There are two ways in which he can restore it. He can either go into bars to have a drink that will restore it and get a hint about what lies ahead as well, or go into hospitals and heal himself to restore the lost health.</p>"},{"name":"Wonder Boy in Monster World","year":1993,"developer":"Westone Co., Ltd.","url":"b#Wonder%20Boy%20in%20Monster%20World%20%28Europe%29.zip","filesize":190751,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Metroidvania > Platform > RPG elements > Fantasy","desc":"<p>Monster World was once a peaceful region. Then, the peace was shattered by an invading army of monsters. A young man named Shion vowed to defeat them and make his land peaceful again.</p><p><em>Wonder Boy In Monster World</em> is the third game in the Monster World spin-off series, originally known as <em>Wonder Boy 5: Monster World 3</em>. It puts the player in control of Shion in his quest to save Monster World from the evil hands of BioMeka. It controls like a standard platform game - run, jump, and kill enemies. The game has light RPG elements such as talking to townsfolk, collecting money to buy items, upgrading your life, and equipping a variety of armor and weapons - staying very close to the Zelda format. You can save your game to continue your quest at a later time.</p>"},{"name":"Woody Pop","year":1987,"developer":"SEGA Enterprises Ltd."},{"name":"World Championship Soccer","year":1990,"developer":"Virgin Mastertronic Ltd."},{"name":"World Class Leader Board","year":1991,"developer":"Access Software, Inc.","url":"c#World%20Class%20Leader%20Board%20%28Europe%29.zip","filesize":1,"score":7.6,"genres":"Sports > Behind view > Golf","desc":"<p>Before the long-running Links series, Access Software produced the Leader Board lineage, which concludes here. Wind, snap, and power are the main considerations as players dodge the bunkers, water, and rough, which make for more complex courses than the 8-bit versions of the original.</p><p>A course editor is included. The courses provided include real locations: St. Andrews (Scotland), Cypress Creek, and Doral Country Club (USA) and a fictional one, The Gauntlet, which, as the name suggests, is designed to push the player's skills to the maximum.</p><p>The PC version utilizes the PC speaker to reproduce voice samples via the company's patented <em>RealSound</em> process. Quips like \"No doubt about it, he's deep in the sandtrap\", \"Straight onto the fairway\", and \"Looks like he hit the tree, Jim\" are used as running commentary during gameplay.</p>"},{"name":"World Cup USA 94","year":1994,"developer":"Tiertex Design Studios","url":"c#World%20Cup%20USA%2094%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%29.zip","filesize":1,"score":6.4,"genres":"Sports > Top-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > North America > Licensed","desc":"<p><em>World Cup USA 94</em> is a top-down football (soccer) game recreating the namesake tournament. Beside the 24 teams who qualified for the actual World Cup, other significant footballing nations like England, France and Denmark can be drafted in. Tackling is difficult and passing is easy, making for a flowing end-to-end style of play. The presentation of the menus is largely icon-based, with the official mascot featured prominently.</p>"},{"name":"World Games","year":1989,"developer":"K-Byte","url":"c#World%20Games%20%28Europe%29.zip","filesize":1,"score":6.4,"genres":"Action > Sports > Diagonal-down > Side view > Olympiad / mixed sports","desc":"<p><em>World Games</em> is an Olympics-style sports game with arcade-oriented gameplay. The events players can compete in include:</p><ul><li>Barrel jumping</li><li>Bull riding</li><li>Caber toss</li><li>Cliff diving</li><li>Log rolling</li><li>Skiing</li><li>Sumo wrestling</li><li>Weightlifting</li></ul><p>In the Sega Master System version, there is only four events: </p><ul><li>Barrel jumping</li><li>Bull riding</li><li>Caber toss</li><li>Pole vault</li></ul>"},{"name":"World Grand Prix","year":1987,"developer":"SEGA Enterprises Ltd.","url":"b#World%20Grand%20Prix%20%28Europe%29.zip","filesize":50575,"score":"","genres":"Racing > Sports","desc":"<p>World Grand Prix is a simple formula one racing game reminiscent of Namco's 1982 arcade game Pole Position, in which you race across 12 tracks attempting to win the most points. In order to keep going, the player has to finish sixth or better in each race.</p><p>While the game is not paired with any official racing licenses, all of the pre-made tracks resemble circuits seen in the 1976 Formula One season. Names or locations for the circuits are never, though often the backgrounds can give further clues (for example, the British circuit, Brands Hatch features Big Ben and the UK Houses of Parliament in the background).</p>"},{"name":"WWF Wrestlemania: Steel Cage Challenge","year":1993,"developer":"Teeny Weeny Games, Ltd.","url":"b#WWF%20Wrestlemania%20-%20Steel%20Cage%20Challenge%20%28Europe%2C%20Brazil%29.zip","filesize":144572,"score":5.5,"genres":"Sports > 3rd-person (Other) > Top-down > Wrestling > Licensed","desc":"<p>The Sega version of <em>WWF Wrestlemania: Steel Cage Challenge</em> is different from its NES counterpart.</p><p>There are ten wrestlers to choose from:</p><ul><li>Bret Hart</li><li>Hulk Hogan</li><li>Irwin R. Schyster</li><li>Papa Shango</li><li>Randy Savage</li><li>Ric Flair</li><li>Shawn Michaels</li><li>Tatanka</li><li>Ted Dibiase</li><li>The Undertaker</li></ul><p>Each wrestler has a standard set of moves consisting of punching, kicking, body slams and turnbuckle manoeuvres, as well as a finishing move for every wrestler. There are three different game modes to choose from: <em>Single</em> (either regular or steel-cage), <em>Tag Team</em> and <em>Championship</em>.</p>"}]