[{"name":"X-Men: Mojo World","year":1997,"developer":"SEGA of America, Inc.","url":"b#X-Men%20-%20Mojo%20World%20%28Brazil%29.zip","filesize":164581,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>In a dark future, Mojo has his own TV show where the participants fight to death. He has imprisoned some X-Men from the past to recreate their greatest battles. Wolverine and Rogue have to enter the game and rescue their friends, then defeating Mojo to return back home. </p><p>In this platform game, the player starts choosing either Wolverine or Rogue. At each new level beaten, a new X-Men will be available: first Gambit, then Cyclops, Havoc and finally Shard. If one of the X-Men dies, the player has to start the level again, choosing among the remaining X-Men the one to play. After all the X-Men have died, the game is over.</p><p>Each character can activate his/her power at will. Wolverine can use his claws, Rogue can fly, Gambit can throw explosive cards, Cyclops will fire optic blasts, Havoc fires plasma blasts and Shard fires energy blasts. The characters have an energy meter and a power meter, which will worn out as they are hit or use their powers, respectively. They can find items to restore their energy and power.</p><p>Gameplay consists basically in finding the way out of each of the six levels. Once finding it, the character will face a boss, usually known characters from the comics like Magneto, Fitzroy, a Sentinel, etc.</p>"},{"name":"Xenon 2: Megablast","year":1991,"developer":"The Assembly Line","url":"b#Xenon%202%20-%20Megablast%20%28Europe%29%20%28Rev%201%29.zip","filesize":125538,"score":7.4,"genres":"Action > Top-down > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p><em>Xenon 2: Megablast</em> is a vertically scrolling space shooter, in which you have to pass several levels, filled with waves of enemies, that all end with a level boss creature. Each group of enemies you destroy grants you a cash reward and every once in a while you enter Colin's Bargain Basement, where you can use this cash to purchase upgrades for your ship like better weapons, speed &amp; health upgrades, etc. Some upgrades can also be picked up during the levels.</p><p>The first part of the game has an organic feel to it, while the second part of the game features mechanical enemies. As there are some maze-like sections with dead-ends in the game, your spaceship scrolls backwards when you keep pressing the down key.</p>"},{"name":"Xevious","year":1990,"developer":"Namcot"}]