[{"name":"007: Everything or Nothing","year":2003,"developer":"Griptonite, Inc.","url":":007- Everything or Nothing (USA, Europe) (En,Fr,De)","filesize":5796951,"score":7,"genres":"Action > Racing / Driving > Diagonal-down > Isometric > Direct control > Spy / espionage > Licensed","desc":"<p>James Bond 007 returns in <em>Everything or Nothing</em> created by Griptonite Games and Electronic Arts for the GameBoy Advance.</p><p>Unlike the previous GameBoy title Nightfire, <em>Everything or Nothing</em> is a third person action game. Players control the action across a number of locations including Peru, Russia, and a space station. The game also includes three driving levels similar to the original Spy Hunter to split up the action. Pilot 007's Aston Martin to take down the baddies. Using an array of weapons like the Walther P99 and Mac 10 as well as the always ready Bond gadgets like Q-Rappel and Holo-Puck, 007 once again saves the world from destruction.</p><p>When the player has finished the single player campaign, he or she can link up with up to three of their friends and battle it out in the multiplayer mode. The GameBoy version can also be linked into the GameCube to access additional content.</p>"},{"name":"007: Nightfire","year":2003,"developer":"JV Games, Inc.","url":":007-Nightfire (USA, Europe) (En,Fr,De)","filesize":4372046,"score":7.1,"genres":"Action > 1st-person > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>The Game Boy Advance received its own version of Electronic Arts' original James Bond adventure <em>Nightfire</em> a few months after the game's release on consoles and PCs. Sharing the storyline (Bond must stop megalomaniacal industrialist Raphael Drake from achieving world domination) and general gameplay concept (first-person shooter), this version adapts a selection of levels from the other versions for the handheld's capabilities.</p><p>The player must navigate 007 through nine objective-based levels, mixing action and stealth in exotic locales like an Austrian castle, corporate towers in Tokyo and a South Pacific island. To defeat the enemy goons, a variety of guns including pistols, automatics, and a sniper rifle, are available. In some missions, heavier hardware like rocket and grenade launchers as well as explosive charges must be found to overcome special adversaries. Of course, no Bond game would be complete without a few of Q's gadgets like a wristwatch laser or a cellphone grapple, usually to be used when Bond's spy qualities are called upon.</p><p>The game is powered by a 3D engine that is fully polygonal (with the exception of sprite-based enemies) and features digitized speech.</p>"}]