[{"name":"Ace Combat Advance","year":2005,"developer":"Human Soft Inc.","url":"7#Ace%20Combat%20Advance%20%28USA%2C%20Europe%29%20%5BEng%5D.gba","filesize":4194304,"score":5.8,"genres":"Action > Top-down > Arcade > Shooter > Flight / aviation","desc":"<p>The Air Strike Force (A.S.F.) is the most advanced aircraft squadron on the planet. Not held by any nation, they are owned by General Resources Ltd. who begins to assign the A.S.F. to duties designed to destroy competition and put them at an economic advantage. Alarmed by this dominance, the nations of the world ally themselves to form the United Air Defense (U.A.D.) whose goal is to fight the war on the A.S.F. and destroy their weapons capability.</p><p><em>Ace Combat Advance</em> is a top-down shooter. The player begins by picking an aircraft and secondary weapon type to use on each mission. Upon entering the level, the player is able to rotate left, right and perform a dive maneuver, while at the same time thrust and breaking can be applied. For weapons the player is able to fire a cannon directly in front of the plane or fire the secondary weapon, the specifics of which vary. A briefing showing each of the 12 mission''s objectives and defined targets.</p>"},{"name":"Ace Lightning","year":2002,"developer":"Tiertex Design Studios","url":"7#Ace%20Lightning%20%28Europe%29%20%5BEng%5D.gba","filesize":4194304,"score":"","genres":"Action > Side view > Top-down > Platform > Shooter > Licensed","desc":"<p>This GBA version of Ace Lightning is based on the BBC TV show of the same name which is a mixture of CGI and live action. It first plays from an overhead view of an Amusement Park where you can enter open doors which lead to 12 different themed worlds. Each world is a 2D side-scrolling platformer, where you face different enemies and end-level bosses all in your quest to find the Gold Amulet.  Once you finish a certain number of the levels,  you'll be rewarded with one of two mini-games. One is a target range where you have to shoot a number of enemies within a certain time. The other is a strength test where Ace must swing to hit a bell at the top of a pole.</p>"},{"name":"Action Man: Robot Atak","year":2004,"developer":"Magic Pockets SAS","url":"7#Action%20Man%3B%20Robot%20Atak%20%28EU%29%20%5BEn%2CFr%2CIt%2CEs%2CDe%5D.gba","filesize":4194304,"score":"","genres":"Action > Behind view > Side view > Platform > Licensed","desc":"<p><em>Action Man: Robot Atak</em> is based on the direct-to-DVD animated film of the same name, in turn based on the line of toys. To stop the evil Dr. X and his army of robots that have been attacking cities across the globe, Action Force seek out his secret hideout, Island X. Dropped on different parts of the island, Action Man, Redwolf and Flint must first find each other, and then put an end to the evil doctor's plans.</p><p>Most of the game's 17 levels take the form of a side-scrolling platformer with a heavy action focus. To get to the level exit, the controlled character must jump pits and gaps, climb ledges and take out many enemies, different varieties of X' robots and various animals native to the island: spiders, bats, even dinosaurs. Each character has slightly different abilities (until the finale, which hero is controlled depends on the level): Native American Redwolf always carries his bow, while Action Man and Flint start most levels with only their fists. They can pick up weapons, though, including throwing discs (for Action Man only), several different guns (which can be further enhanced by timed power-ups) and a boomerang (for Australian Flint only). Only Flint can double jump. Picking up 50 Action Man icons gives an extra life. Regular extra lives and health power-ups are also available, and a reset checkpoint is available every few screens.</p><p>Variety from the platform levels comes in two levels where Flint uses his dirt rider and Redwolf surfs the waves. These are seen from behind the heroes as they must avoid or blast away obstacles and collect Action Man icons. Action Man lives up to his name in a level where he rides a motorcycle up a volcano (shooting missiles at enemies and jumping across gaps) and another one where he straps helicopter blades to his back to fly towards the level end.</p><p>Finally, there are several boss battles, including a fight against the spider queen, a fist fight(!) against a T. Rex and the final confrontation with Dr. X.</p>"},{"name":"Activision Anthology","year":2003,"developer":"","url":"harry-potter-and-the-goblet-of-fire-usa/Activision%20Anthology%20%28USA%29.gba","filesize":8388608,"score":7.7,"genres":"Compilation","desc":"<p>The GBA version of <em>Activision Anthology</em> is different from Activision Anthology: Remix Edition (Windows/Mac), Activision Anthology (PS2), and Activision Hits Remixed (PSP). It contains 56 games, more than the other versions and does not include the Imagic titles (Atlantis, Demon Attack, and Moonsweeper). A few of the extra games are homebrew.</p><p>The player may also view the original cartridges (2D, not 3D like the other versions) and the manuals. This version also includes less music than the others. There are different game modes to play and you can earn original gamer patches.</p><p>The following games are included:</p><ul><li><em>Activision Prototype #1</em> (puzzle game with coloured squares)</li><li><em>Activision Prototype #2</em> (Frogger-like with a flea and platforms)</li><li>Activision Decathlon</li><li>Barnstorming</li><li>Baseball (Pete Rose Baseball)</li><li>Beamrider</li><li>Bloody Human Freeway</li><li>Boxing</li><li>Bridge</li><li>Checkers</li><li>Chopper Command</li><li>Climber 5 (homebrew)</li><li>Cosmic Commuter</li><li>Crackpots</li><li>Dolphin</li><li>Dragster</li><li>Enduro</li><li>Fishing Derby</li><li>Freeway</li><li>Frostbite</li><li>Grand Prix</li><li>H.E.R.O.</li><li>Ice Hockey</li><li><em>Kabobber</em> (previously unreleased)</li><li>Kaboom!</li><li>Keystone Kapers</li><li>Laser Blast</li><li>Megamania</li><li>Oink!</li><li>Okie Dokie (homebrew)</li><li>Oystron (homebrew)</li><li>Pitfall!</li><li>Pitfall II: Lost Caverns</li><li>Plaque Attack</li><li>Pressure Cooker</li><li>Private Eye</li><li>River Raid</li><li>River Raid II</li><li>Robot Tank</li><li>Seaquest</li><li>Skate Boardin'</li><li>Skeleton+ (homebrew)</li><li>Skiing</li><li>Sky Jinks</li><li>Space Shuttle</li><li>Space Treat Deluxe (homebrew)</li><li>Spider Fighter</li><li>Stampede</li><li>Starmaster</li><li>Tennis</li><li>Thwocker (previously unreleased)</li><li>Title Match Pro Wrestling</li><li>Tomcat F14</li><li>Vault Assault</li><li>Venetian Blinds</li><li>Video Euchre (homebrew)</li></ul>"},{"name":"Advance Guardian Heroes","year":2004,"developer":"Treasure Co., Ltd.","url":"harry-potter-and-the-goblet-of-fire-usa/Advance%20Guardian%20Heroes%20%28USA%29.gba","filesize":8388608,"score":6.3,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler","desc":"<p><em>Advance Guardian Heroes</em> is the follow-up to Guardian Heroes for the SEGA Saturn. It is a side-scrolling, beat-em-up action game. You choose from 3 characters who will be joined by a legendary Soul Hero from another world. You must take control of the Legendary Soul Sword from the Soul Hero's grave and save the world.</p><p>There are 2 game modes. In story mode, you can play by yourself or cooperatively with another player by linking two GBAs together. In VS. mode, up to 4 players can battle with each other. In Story mode you receive crystals from your defeated enemies. At the end of each level you can upgrade traits like MP or HP, or you can donate to the Laboratory which will eventually unlock characters to use in VS. mode. There are 3 initial characters available, but up to 20 are unlockable.</p>"},{"name":"Advance Wars","year":2001,"developer":"Intelligent Systems Co., Ltd.","url":"harry-potter-and-the-goblet-of-fire-usa/Advance%20Wars%20%28USA%29%20%28Rev-A%29.gba","filesize":4194304,"score":8.5,"genres":"Strategy > Diagonal-down > Turn-based > Turn-based strategy","desc":"<p>This turn-based strategy game hails back to a classic Japanese strategy game titled Famicom Wars. <em>Advance Wars</em> pits players against very computer AI in a number of battles involving submarines, warships, infantry, tanks, helicopters, and other weapons. During the maps, players may capture buildings to increase financial resources and repair damaged units. During combat, two units go head to head with the results determined by how the two stack up against each other, terrain conditions, and other factors. Up to four players can play using the Game Link Cable or by swapping a single Game Boy Advance at the end of each player's turn.</p>"},{"name":"Advance Wars 2: Black Hole Rising","year":2003,"developer":"Intelligent Systems Co., Ltd.","url":"harry-potter-and-the-goblet-of-fire-usa/Advance%20Wars%202%20-%20Black%20Hole%20Rising%20%28USA%29.gba","filesize":8388608,"score":8.7,"genres":"Strategy > Top-down > Turn-based > Turn-based strategy","desc":"<p>The turn based strategy war continues. Choose your army and take to the streets to reclaim the world.</p><p>Troops, tanks, air and sea units are all available, at a cost. After each mission, you use your points earned to purchase new units and Commanding Officers, that add an additional level of power and experience for your army (whether it be greater strength, faster response times or stronger attack ability).</p><p>You can also create your own maps for Skirmish mode, and take on up to 4 players in a battle royal.</p>"},{"name":"Adventure Island","year":2004,"developer":"Hudson Soft Company, Ltd."},{"name":"Adventure of Tokyo DisneySEA","year":2001,"developer":"","url":"a#A.zip/A%2FAdventure%20of%20Tokyo%20Disney%20Sea%20%28J%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Action > Adventure > Side view > Cards / tiles > Fantasy > Licensed","desc":"<p><em>Adventure of TOKYO DisneySEA</em> is an action adventure game based on the Tokyo DisneySea theme park that was opened in 2001. It was one of the two Konami games based on the theme park, the other one having been released for the PlayStation 2.</p><p>In this game all the seven \"ports of call\" from the Tokyo DisneySea are represented: Mediterranean Harbor, American Waterfront, Lost River Delta, Port Discovery, Mermaid Lagoon, Arabian Coast, and Mysterious Island. The Aqua Sphere (symbol of the park) is also depicted. Disney's characters include Aladdin and Ariel, among many others.</p><p>The main objective is to collect cards (containing rock-paper-scissors). Some will be given while others can only be obtained if the player defeats his opponent. The versus battles occur through card usage. Some of these cards are the key to defeat the toughest opponents.</p><p>During the scrolling gameplay, the player can earn coins and use them to buy food (for health improvement), interact with different characters, and eliminate the random enemies that appears. Sometimes there are also mini-games.</p>"},{"name":"Adventures of Jimmy Neutron, The: Boy Genius - Attack of the Twonkies","year":2004,"developer":"Tantalus Interactive Pty. Ltd.","url":"a#A.zip/A%2FAdventures%20of%20Jimmy%20Neutron%20Boy%20Genius%2C%20The%20-%20Attack%20of%20the%20Twonkies%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Licensed","desc":"<p><em>The Adventures of Jimmy Neutron: Boy Genius - Attack of the Twonkies</em> is a Game Boy Advance game based on the Nickelodeon Jimmy Neutron Halloween TV special of the same name. In the game, Jimmy explores a comet that is passing over Retroville called Twonkus-3, where he encounters a terrifying monster.</p><p>Upon returning home, Jimmy and his friends discover that an alien has stowed away with Jimmy. What starts to be a cute little pet turns out to be a huge menace when Jimmy discovers that the aliens (dubbed 'Twonkies') will evolve into monstrous creatures whenever they hear different types of sounds! It's up to Jimmy to use his inventions to save the town before the Twonkies tear it apart!</p>"},{"name":"Adventures of Jimmy Neutron, The: Boy Genius - Jet Fusion","year":2003,"developer":"Helixe","url":"a#A.zip/A%2FAdventures%20of%20Jimmy%20Neutron%20Boy%20Genius%2C%20The%20-%20Jet%20Fusion%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>When Retroville ends up in a world of trouble, it is up to Jimmy, his robot dog Goddard and super spy (disguised as the ultimate action-movie hero) Jet Fusion to find the evil Professor Calamitous and stop his diabolical plan to take over the world!</p>"},{"name":"Adventures of Jimmy Neutron, The: Boy Genius Vs. Jimmy Negatron","year":2002,"developer":"Human Soft Inc.","url":"a#A.zip/A%2FAdventures%20of%20Jimmy%20Neutron%20Boy%20Genius%20vs.%20Jimmy%20Negatron%2C%20The%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > Licensed","desc":"<p>With the construction of Jimmy Neutron's latest invention, he accidentally teleports himself into an alternate dimension, switching places with the evil Jimmy Negatron, who is now causing mayhem in his home town, Retroville! Jimmy will need to travel between different dimensions to make his way home and confront Negatron himself. </p><p>In <em>The Adventures of Jimmy Neutron: Boy Genius Vs. Jimmy Negatron</em>, you control Jimmy Neutron as he battles his evil alter ego, Jimmy Negatron, to try and put Retroville back to normal. The game is presented in a 3rd Person perspective using Mode 7 (similar to Super Mario Kart) and pre-rendered graphics to give the illusion that the player is in a fully 3D world. As Jimmy travels through eleven different dimensions, he uses many different gadgets including the shrink ray, the robot disassembling ray, the dimension jump ray, the rocket ship and, of course, his robot dog, Goddard.</p><p>The game also features two different multiplayer games: War of Electrons and Collecting Coins, both which can be played with up to two players.</p>"},{"name":"Aero the Acro-Bat","year":2002,"developer":"Iguana Entertainment Incorporated","url":"harry-potter-and-the-goblet-of-fire-usa/Aero%20the%20Acro-Bat%20%28USA%29.gba","filesize":4194304,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>You play as bat Aero, who have to stop the mad scientist Edgar Ektor, who is trying to rid the world of amusement and fun. So you jump through the circus-style levels, using different kinds of machines such as catapults, cannons, bubble machines, platforms, etc., collecting various power-ups such as cheese, soda, keys, clocks, etc. and avoiding lethal obstacles.</p>"},{"name":"Agassi Tennis Generation","year":2003,"developer":"Aqua Pacific Ltd.","url":"a#A.zip/A%2FAgassi%20Tennis%20Generation%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Sports > 3rd-person (Other) > Fixed / flip-screen > Tennis > Licensed","desc":"<p>Agassi Tennis Generation offers you the best of tennis on GBA : 4 game modes, 6 tournaments, 4 surfaces, 10 different players and the chance to play on Link with 2 players! Not forgetting that the whole thing is orchestrated by the greatest ever World player, André Agassi! No point in waiting, grab your racket and play!</p>"},{"name":"Agent Hugo: RoboRumble","year":2006,"developer":"Program Ace","url":"a#A.zip/A%2FAgent%20Hugo%20-%20Roborumble%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.gba","filesize":1,"score":"","genres":"Action > Racing / Driving > Side view > 2D scrolling > Platform > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>Agent Hugo: RoboRumble</em> is an action game starring Hugo the troll, here part of the <em>Agent Hugo</em> science fiction reboot first introduced in 2005. Agent Hugo needs to take on Geekdorph who threatens the world. He is a scientist who inserted his own brain into a robot and he is now the lord of a robot army. Agent Hugo needs to infiltrate his robot factory using Tex 2000, a futuristic hoverboard.</p><p>In 2D-sidescrolling levels Hugo moves at a fast speed and can move vertically between lanes to pick up items or avoid hazards. He is always on top of the hoverboard and he can shoot, jump and activate a shield device. Tricks can also be performed while in the air.</p><p>A mission is completed when the end of the track is reached. The game keeps tracks of the completion time, the score based on item pick-ups and the number of kills. Lanes often have gaps that need to be avoided. There also jump pads and arrows that provide additional speed. The HUD shows the passed time, total score, current speed, track completion percentage and number of kills. A retry is provided for every death and a password is provided when a mission is completed.</p>"},{"name":"Aggressive Inline","year":2002,"developer":"Full Fat Productions Ltd.","url":"a#A.zip/A%2FAggressive%20Inline%20%28E%29.gba","filesize":1,"score":7.3,"genres":"Sports > Diagonal-down > Isometric > Tricks / stunts > Licensed","desc":"<p>In <em>Aggressive Inline</em> the player takes the role of one of nine real-life skaters with one specific goal: receiving as much points as possible by performing spectacular stunts. Every of the 13 courses also has various special challenges, e.g. collecting or smashing certain items, which need to be performed to beat it. In contrast to the open areas of the console versions this one features more linear levels and tight time limits. </p><p>It also replaces the \"juice meter\" with the so-called \"grind meter\" which is filled up by performing stunts. Every grind decreases this meter and if it is empty no grinds can be performed at all. Of course grinds are an elemental move to beat the challenges. There is also a freestyle playing mode where the player can unlock new skaters.The soundtrack is licensed.</p>"},{"name":"Air Hockey-e","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"AirForce Delta Storm","year":2002,"developer":"Mobile21 Co., Ltd.","url":"7#AirForce%20Delta%20Storm%20%28USA%29%20%5BJa%2CEn%2CDe%2CFr%5D.gba","filesize":4194304,"score":"","genres":"Action > Top-down > 2D scrolling > Shooter > Flight / aviation","desc":"<p>Fly nine different attack aircraft through a range of objective based missions ranging from bombing runs to dogfights and more.</p><p>Viewed from the top-down, you have a full range of controls allowing you to increase speed or simply hovering in mid-air, and using missiles and target lock missiles or machine guns. You must also watch your altitude and fuel levels, using your radar to find the enemy targets and cloud cover to dodge target lock-ons.</p>"},{"name":"Alex Rider: Stormbreaker","year":2006,"developer":"Razorback Developments Ltd","url":"a#A.zip/A%2FAlex%20Rider%20-%20Stormbreaker%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.gba","filesize":1,"score":5.5,"genres":"Action > Diagonal-down > Stealth > Direct control > Spy / espionage > Licensed","desc":"<p>Ian Rider is a spy for the British government, investigating Herod Sayle. Herod Sayle has offered to give every schoolchild in the country a free \"Stormbreaker\" computer, but the government doesn't trust him. They trust him even less after Ian is gunned down. That's when Ian's fourteen-year-old nephew Alex comes in. Trained by Ian for years, Alex is recruited by MI6 to investigate Sayle. Alex is tasked with infiltrating Sayle's mansion and finding out just what is going on. Based on the book and movie of the same name.</p><p>Gameplay is equal parts stealth and action. Some enemies are better off avoided, while others you'll want to take out. Collect keycards, use spy gadgets, and be careful. After each level, you'll gain new combat techniques or spy gadgets.</p>"},{"name":"Alien Hominid","year":2006,"developer":"The Behemoth","url":"7#Alien%20Hominid%20%28Europe%29%20%5BEn%2CFr%2CIt%2CDe%2CEs%5D.gba","filesize":8388608,"score":7.3,"genres":"Action > Side view > 2D scrolling > Shooter > Fantasy > Sci-fi / futuristic > Regional differences","desc":"<p>You're a little yellow alien. The FBI has shot down your ship while flying over planet Earth. And it, quite literally, lands right on their doorstep. After a series of FBI Agents swipe your ship, what option do you have other than to blow up everything in your path to get it back?</p><p><em>Alien Hominid</em> is a 2D side-scrolling shooter with heavy references to the Metal Slug series of games - from the hand-drawn graphics, huge explosions, right down to the ability to eviscerate FBI Agents when you get up close to them. The graphics are by featured artist Dan Paladin. Your goal, is quite simply, to get to the end of the stage, and die as little as possible. Which is made difficult due to the fact that any bullet is an instant kill.</p><p>To help you out, you can grab a range of power-ups, such as lasers, spread shots, shotguns, and more, as well as hijacking vehicles and using them for protection. Grenades can be lobbed, and you can jump on enemy shoulders and choose to bite their heads off if you like, or pick them up and throw them at other enemies. You can also dive underground for a short period of time to avoid enemies - while underground, you can drag agents into the ground to kill them.</p><p>The GBA version of the game is identical in gameplay, however, with a few bosses removed (such as the robot bee and the FBI big-fisted tank robot). The PlayStation 2, Xbox and Xbox 360 versions of the game include a special \"PDA Game\" with very simple-looking graphics. Your goal in this game is to kill all the agents by hopping on their heads and then reaching the exit. Included with this game is a level editor, allowing you to make your own levels and then send them to friends if you have the Xbox or Xbox 360 version.</p>"},{"name":"Alienators: Evolution Continues","year":2001,"developer":"Tuna Technologies Ltd.","url":"7#Alienators%3B%20Evolution%20Continues%20%28USA%2C%20Europe%29%20%5BEng%5D.gba","filesize":4194304,"score":6.7,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Alienators: Evolution Continues</em> is a side-scrolling action game based on the animated TV show of the same name. The player takes the role of the captain of the Alienator team, Ira, and has to free a research lab from mutated creatures.</p><p>The twelve levels are not linear but mazes which have to be explored to reach the objectives; there is also a fair share of keycard hunting. The player defends his skin by shooting the aliens with his standard weapon (which has unlimited ammo), or with more powerful special weapons. Those have their unique ammo types, which have to be found during the course of the game - this means it is wise to save some ammo in case one of the eight bosses shows up. Of course additional characters from the TV series also make an appearance, either as friend or foe.</p>"},{"name":"All Grown Up!: Express Yourself","year":2004,"developer":"Altron Corporation"},{"name":"All-Star Baseball 2003","year":2002,"developer":"Software Creations Ltd.","url":"a#A.zip/A%2FAll-Star%20Baseball%202003%20%28U%29.gba","filesize":1,"score":7,"genres":"Sports > 3rd-person (Other) > Diagonal-down > Baseball > Licensed","desc":"<p>Acclaim's baseball series makes its debut on the Game Boy Advance with <em>All-Star Baseball 2003</em>. It has less modes and features than the console version and is presented in 2D graphics adapted to the platform.</p><p>Game modes include Quick Game (random match-up), Exhibition, All-Star Game, Batting Practice, Home Run Derby, Season (8 different length and mode combinations) and World Series. There is also a two-player mode via link cable.</p><p>Gameplay follows the traditional model. Players control pitching, batting and fielding. For pitching and batting, the view is from behind the batter. Batting involves moving a triangular cursor to aim the bat and pushing a button for swinging or bunting. The triangular cursor can be turned off for an attempt at a power swing, which is harder to hit but almost guarantees a home run. The pitcher selects the type of pitch from a menu. During fielding, the game switches to an overhead view of the field, realized through a Mode-7-style sprite/background layer engine. The ball's landing place and running lines are indicated through a red marker and yellow lines, respectively. The camera moves and zooms automatically to focus on the action.</p><p>Like the console version, the GBA title has a trading card feature. Cards are gained by winning games in many of the modes and can be traded with another player via link cable.</p>"},{"name":"All-Star Baseball 2004","year":2003,"developer":"Acclaim Studios Manchester","url":"a#A.zip/A%2FAll-Star%20Baseball%202004%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > 3rd-person (Other) > Behind view > Diagonal-down > 2D scrolling > Fixed / flip-screen > Direct control > Baseball > Licensed","desc":"<p>This GBA release is different from the main console version All-Star Baseball 2004 for some game elements. This portable version offers both single-player and multiplayer modes with a full license for all 30 MLB teams, stadiums and more than 800 players. Game modes include Exhibition, Season, All-star game, Home run derby, Playoffs and World series. There is no Franchise mode. Multiplayer against a second player is supported through a link cable. Through the battery back-up, progress in the season, a collection of 250 trading cards that can be earned, player trades and roster changes are stored.</p><p>During the batting phase the swing is aimed using a large triangle indicator. The direction of the hit is then determined by rotating and tilting the triangle. A similar mechanic is used for pitching during defense. During field a base is chosen using the directional pad and optionally the CPU can take over to do this automatically. The AI behavior of computer-controlled players is quite different compared to the main console version. At any moment it is possible to make substitions or adjust the position of the field players.</p><p>A new feature compared to the 2003 version is the ability for CPU pitchers to throw outside the strike zone. The increase in the base runners' speed now also allows them to do doubles or triples. There are more animations for the players, for instance the pitcher follow-throughs and the batter walk-ups. There is more visual details as well, such as a scoreboard celebrations and typical stadium details such as waving flags. Audio-wise, play-by-play commentary is a new feature for this year's version.</p>"},{"name":"Altered Beast: Guardian of the Realms","year":2002,"developer":"3d6 Games, Inc.","url":"7#Altered%20Beast%3B%20Guardian%20of%20the%20Realms%20%28USA%29.gba","filesize":8388608,"score":6,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Fantasy","desc":"<p><em>Altered Beast: Guardian of the Realms</em> is a side-scrolling action game in which you play as a dead guy who's been resurrected by Zeus for the purpose of rescuing the realms from an evil monster named Arcanon.</p><p>There are 15 different realms to visit, and your job is to make your way past the dozens of monsters in each one in order to battle and defeat the boss creature waiting at the end of the level. Your attacks include a variety of kicks and punches, and you can jump or duck to avoid nearby enemies.</p><p>One addition to this successor is the inclusion of attack items that you can gather throughout each level that offer all sorts of useful abilities, such as regeneration, increased speed, and shields.</p><p>Using a link cable, you can battle your friends with the creatures you collect in the story mode.</p>"},{"name":"Amazing Virtual Sea-Monkeys, The","year":2002,"developer":"Elo Interactive Media GmbH","url":"a#A.zip/A%2FAmazing%20Virtual%20Sea-Monkeys%2C%20The%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > Puzzle elements > Licensed","desc":"<p>The player controls Nautila, a \"babelfish\" which is used to indirectly influence the environment within a huge water tank. Nautila has to suck up dangerous fish, clear rocks, supply food etc. for brine shrimps resembling the Sea Monkeys brand. The Sea Monkeys try to reach a Venus Shell as soon as they are hatched. If Nautila is not fast enough to clear the puzzles preventing the Sea Monkeys from reaching their shell, they will perish... </p><p>The game features 70 levels in total, with increasingly difficult objectives.</p>"},{"name":"American Bass Challenge","year":2001,"developer":"Starfish Inc.","url":"harry-potter-and-the-goblet-of-fire-usa/American%20Bass%20Challenge%20%28USA%29.gba","filesize":4194304,"score":7.1,"genres":"Sports > Top-down > Fishing","desc":"<p><em>American Bass Challenge</em> is a fishing game where the player can choose from five different lakes with a total of 20 different locations to fish for catfish, crappies and the game's namesake, the Big Mouth Bass. The player chooses from eight different lures, spinner, swisher, minnow, rubber jig, worm, frog, crankbait, and spinnerbait, while using a fish finder to locate the best spot for fishing.</p><p>The player must also contend with constant weather changes that will either help or hinder their fishing with three different game modes to choose from. <em>Quick Fish</em> instantly takes the player to a spot with a lure already available to them. <em>Practice</em> lets the players learn the basics of the game with the main mode being <em>Tournament</em> where the player must progress through the lakes, unlocking them as they do, by catching up to five fish that will be kept in the livewell. In the tournament mode, the player must adhere to rules and regulations and complete their fishing within a certain time limit, failure to do so will result in a disqualification.</p><p>There is even a multiplayer mode that allows up to four players to go against each other using the GameBoy Link Cable.</p>"},{"name":"American Idol","year":2003,"developer":"Möbius Entertainment Ltd."},{"name":"American Tail, An: Fievel's Gold Rush","year":2001,"developer":"Hokus Pokus","url":"a#A.zip/A%2FAn%20American%20Tail%20-%20Fievel%27s%20Gold%20Rush%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.4,"genres":"Action > Side view > Licensed","desc":"<p><em>An American Tail: Fievel's Gold Rush</em> is a side scrolling Jump'n Run featuring Fievel, the little mouse from the movie <em>An American Tail</em>. It features six graphically different worlds with four levels each. Each world is completed by defeating a boss monster.</p><p>While the background story asks for finding six pieces of the lost map to a goldmine (hence the six worlds), the basic task is to collect gold for points and extra lives. The gold also works as an indicator to see how much of a level has actually been explored. Fievel can jump on enemies and throw his hat in a boomerang fashion.</p>"},{"name":"Angel Collection 2: Pichimo ni Naro","year":2004,"developer":"MTO Co., Ltd.","url":"a#A.zip/A%2FAngel%20Collection%202%20-%20Pichimo%20ni%20Narou%20%28J%29.gba","filesize":1,"score":"","genres":"Simulation > Top-down > Anime / Manga > Life / social simulation > Direct control > Asia > Contemporary","desc":"<p>A fashion simulation game in which your goal is to become a model for the Pichi Lemon magazine. Pichi Lemon was a real girls' magazine that was published from 1986 until 2015. This game includes clothes and accessories that were featured in the magazine itself, as well as tie-in items from real brands such as PENTY'S.</p><p>You collect clothes, accessories, hairstyles, makeup and different patterns for your clothes by working part-time at clothing stores and gaining fashion sense. The more your sense goes up, the more stores you can shop at, and the number of items you can purchase increases. Purchasing items requires \"points\", which you also earn from working part-time.</p><p>There are over 300 items to collect in the game.</p>"},{"name":"Angel Collection: Mezase! Gakuen no Fashion Leader","year":2003,"developer":"MTO Co., Ltd.","url":"a#A.zip/A%2FAngel%20Collection%20-%20Mezase%21%20Gakuen%20no%20Fashion%20Leader%20%28J%29.gba","filesize":1,"score":"","genres":"Simulation > Top-down > Anime / Manga > Life / social simulation > Direct control > Asia > Contemporary","desc":"<p>A fashion simulation game in which your goal is to collect over 300 items of clothing and accessories, hairstyles, makeup, etc in order to become the most fashionable student at your school.</p>"},{"name":"Angelique","year":2002,"developer":"KOEI Co., Ltd.","url":"a#A.zip/A%2FAngelique%20%28J%29.gba","filesize":1,"score":"","genres":"Adventure > Strategy > Top-down > Anime / Manga > Fantasy","desc":"<p>In every sector of the Cosmos, there is a queen who rules over it, keeping the powers of the elements in balance with the help of the Nine Guardians. But with time, the queen's power fades, and a new queen must replace her. Several candidates compete until one of them proves that she has the knowledge of the nine elements and has convinced the Guardians to lend their power to her. The heroine of the game is a seventeen-year-old Angelique Limoges, and her main adversary is a rather unpleasant girl named Rosalia. Will Angelique be able to befriend the Guardians and become the next queen?</p><p><em>Angelique</em> borrows elements from different genres: Japanese-style adventure (without puzzles), \"dating sim\", and (not overly complex) strategy. The goal is to make sure that Angelique has good relationship with the Guardians, maintaining the balance. For that, Angelique has to visit them daily, talk to them, and see what effects their powers have over the land. The situation is further complicated by the fact that Angelique - depending on the Zodiac sign the player chooses for her - has a certain affinity with one of the elements, and therefore, with one of the Guardians. This can lead to a love relationship, which will forfeit Angelique's chances to become a queen, but deliver an ending which can still be considered satisfying.</p><p>The SNES original was later ported to other platforms and that version of the game features slightly improved graphics, CD-quality music, voice acting, and anime-style cutscenes.</p>"},{"name":"Animal Snap: Rescue Them 2 by 2","year":2002,"developer":"Ignition Entertainment Ltd.","url":"a#A.zip/A%2FAnimal%20Snap%20-%20Rescue%20Them%202%20by%202%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Puzzle > Fixed / flip-screen > Cards / tiles > Tile matching puzzle > Direct control","desc":"<p><em>Animal Snap: Rescue Them 2 by 2</em> is a tile based puzzle game borrowing some elements from MahJong. Players need to clear groups of stacked titles by selecting two identical tiles, thus removing them. As matches make tiles disappear, new ones below are uncovered. This process is repeated until all tiles and removed. Tiles are selected by moving the cursor around and then a button to confirm or remove a selection. The game can be played in an Arcade Mode and as a Time Challenge. The gameplay is identical for both modes, but in Arcade the goal is to complete levels in the fastest time possible, while in Time Challenge a timer counts down. The tiles contain objects, animals and letters that spell the word BONUS.</p>"},{"name":"Animaniacs: Lights, Camera, Action!","year":2005,"developer":"Warthog Sweden","url":"a#A.zip/A%2FAnimaniacs%20-%20Lights%2C%20Camera%2C%20Action%21%20%28E%29%20%28M5%29.gba","filesize":1,"score":5.8,"genres":"Action > Diagonal-down > Isometric > Music / rhythm > Platform > Puzzle elements > Licensed","desc":"<p>Warner Bros. Studios is in massive financial debt - one zillion dollars worth of debt, to be precise!  And it's all because of Yakko, Wakko, and Dot!  Their madcap destruction has caused this dire financial situation, and the CEO, Thaddeus Plotz, has issued an ultimatum: either deliver three feature films on time and as cheaply as possible...or be locked in the Water Tower forever!</p><p>In Lights, Camera, Action!, the player controls all three Animaniacs, as well as Pinky and The Brain.  Each Animaniac has their own abilities and drawbacks - for example, The Brain can activate complex switches, but cannot jump due to his large head, while Dot can glide through the air with her skirt, but refuses to push anything as it will damage her nails.  It's up to the player to switch between each Animaniac as they make their way through each scene, performing the required tasks given by the director.</p><p>The Animaniacs are also never in any real danger - they're only filming.  However, they must always pick up film reels to keep the cameras rolling.  If the player runs out of film, it's game over.  Otherwise, if you fall into water or get hurt, you'll just have to restart the last scene that the director asked you to perform.</p>"},{"name":"Ant Bully, The","year":2006,"developer":"Artificial Mind & Movement","url":"a#A.zip/A%2FAnt%20Bully%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Puzzle elements > Direct control > Licensed","desc":"<p>Based on the exciting journey of the digitally animated family adventure The Ant Bully, experience the perils of an ant's world as you evolve from recluse to hero in a quest to save the colony from extermination.</p>"},{"name":"Antz Extreme Racing","year":2002,"developer":"Magic Pockets SAS","url":"a#A.zip/A%2FAntz%20-%20Extreme%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Antz Extreme Racing</em> is a Mario Kart-style kart racing game based on the 1998 animated film. Compared to the console version, the GBA title has its own tracks and modes and displays the tracks through \"Mode 7\"-style 2D scaling and rotation. </p><p>The game contains six different racers (all characters from the film), each with different ratings in speed, brakes and weight, and twelve tracks, only the first eight of which are unlocked from the start. The game's main mode is the 4 Seasons championship, taking players through the twelve tracks consecutively, with finishing in first place a must to advance. Progress is saved via passwords awarded after a win. Further modes are Quick Race (a standard race on unlocked tracks), Head to Head (a one-on-one race against a random opponent on a random track) and the Game Link mode for two-player match-ups via link cable.</p><p>As many kart racers, the game features a variety of power-ups for collecting on the tracks and using during a race. These include turbo boosts, fireflies (self-seekers launching to the front), stun nuts (thrown to the back), bubble gum traps, protective helmets and more. There are also health power-ups since ramming into obstacles decreases health as indicated by a leaf that grows shorter with each hit. Also on the tracks are green items that act as currency. Between races, these can be spent to buy additional power-ups in a store.</p>"},{"name":"Archer Maclean's 3D Pool","year":2004,"developer":"Ignition Entertainment Ltd.","url":"a#A.zip/A%2FArcher%20Maclean%27s%203D%20Pool%20%28U%29.gba","filesize":1,"score":8.1,"genres":"Sports > 1st-person > Pool / snooker","desc":"<p>Using the game engine from Jimmy White's Whirlwind Snooker, this game recreates pool in minute detail. A bold 3D graphics engine with realistic physics and millions of shot permutations (in terms of direction, speed and spin) is at the heart of it. Three versions of pool are offered - UK and US 8-ball as well as the fast-paced all-action 9-ball game.</p><p>There are 20 computer opponents, with the hardest of them being almost unbeatable, as well as two-player and trick-shot modes. Unlike the original release of <em>Whirlwind Snooker</em>, you can save more than one game on the disk at a time.</p>"},{"name":"Arctic Tale","year":2007,"developer":"Atomic Planet Entertainment Limited","url":"a#A.zip/A%2FArctic%20Tale%20%28U%29.gba","filesize":1,"score":5.2,"genres":"Action > Top-down > Licensed","desc":"<p><em>Arctic Tale</em> is based on the National Geography documentary of the same name. Players control a polar bear (both cub and adult) trying to survive in a harsh climate of snowy landscapes. There are eleven stages where the little bear explores the environment, searches for foods and collects paw prints that unlock pictures in a photo gallery and additional chapters. Later, two other animals can be controlled as well: a walrus that is also able to explore underwater environment, the fast Arctic fox able to hunt down rabbits and an orca whale.</p><p>The levels consist of free-roaming environments, on land or underwater, where the animals need to gather food to avoid having the heart icon fade away. While playing 16 different mini-games can be accessed where the player can earn bronze, silver and golds awards to unlock additional chapters. These games include Ice Slide (obstacle course), Shuffle (slide to the center of a ring), Food Fight, Ice Flow Rodeo (control a broken piece of ice through rough currents), Survive the Cold (cross an icy area using shelters to hide from the cold), Catch-a-Seal, Ice Sheet, Clam Scavenge (find eight hidden clams), Herd Flow (guide an ice block without hitting anything), Walrus Hunt, Orca Race and more.</p>"},{"name":"Army Men: Advance","year":2001,"developer":"DC Studios, Inc.","url":"7#Army%20Men%20Advance%20%28USA%2C%20EU%29%20%5BEn%2CFr%2CDe%2CEs%2CIt%5D.gba","filesize":4194304,"score":6.2,"genres":"Strategy > Diagonal-down > Isometric > Real-time > Shooter","desc":"<p>In <em>Army Men: Advance</em>, the despicable Tan General Plastro whips up another fiendishly clever plan for world domination, so it's up to Sarge to rally his men for another valiant attack. Players will guide Sarge through 17 clever environments, occasionally using tanks or gunboats to terrorize the Tans.</p>"},{"name":"Army Men: Operation Green","year":2001,"developer":"Pocket Studios","url":"a#A.zip/A%2FArmy%20Men%20-%20Operation%20Green%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.2,"genres":"Action > Diagonal-down > Isometric > Shooter","desc":"<p>Following a similar design to the original Army Men PC title, Operation Green has you controlling a long green soldier who must fight his way behind enemy lines and defeat the Tan army at their own game. </p><p>Each of the 15 missions has you fighting a range of enemy characters, using your weapons (grenades, machine guns, rocket launchers and more) to take down as much as you can. You can also use certain vehicles during the action, giving you the opportunity to use even more firepower.</p>"},{"name":"Army Men: Turf Wars","year":2002,"developer":"Möbius Entertainment Ltd.","url":"7#Army%20Men%20Advance%202%3B%20Turf%20Wars.GBA","filesize":8388608,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Isometric > Direct control","desc":"<p>Colonel Grimm has ordered the defeat of the Tan Army and chosen a two-man Special Forces team for the mission. This Special Forces team will consist of the Blue Spy and you, Sgt. Hawk. Battle through several different backyard environments with the ultimate goal of destroying the Tan Army. Good luck, soldier!</p>"},{"name":"Around the World in 80 Days","year":2004,"developer":"Saffire, Inc","url":"a#A.zip/A%2FAround%20the%20World%20in%2080%20Days%20%28E%29%20%28M6%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Industrial Age > Comedy > Licensed","desc":"<p>Play the role of Passepartout (Jackie Chan) and travel with Phileas Fogg around the world in 80 days. ### Face a variety of astonishing adventures and escapades! * Use a variety of kicks and punches to dispatch your enemies with signature Jackie Chan flair!* Visit exotic locations across the world such as China, India, Turkey and many others! * Travel in a variety of unique methods such as train, elephant, ship, airplane, and balloon. * A storyline with various twists, suspense, and comedy.</p>"},{"name":"Arthur and the Minimoys: The Game","year":2007,"developer":"Mistic Software Inc.","url":"a#A.zip/A%2FArthur%20and%20the%20Minimoys%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":5.7,"genres":"Action > Side view > 2D scrolling > Puzzle elements > Licensed","desc":"<p><em>Arthur and the Invisibles</em> is an officially licensed game for the French film of the same name (Arthur et les Minimoys in French). Players assume the role of 10 year old Arthur. His grandmother is about to lose her house and Arthur wants to stop this. Instead of the conventional channels Arthur travels to the land of the Minimoys; minuscule creatures just a tenth of an inch tall. Here he searches for his grandfather's treasure together with princess Selenia. This treasure should save the house. But to find it they'll have to travel to the forbidden city ruled by the evil M. the Malicious.</p><p>The Minimoy world consists of the house and its garden, but in an up-scaled size, since the characters are very small. Unlike the PC and console version, which is in 3D, the Game Boy Advance version uses a sidescrolling perspective. The player gets to play as both Arthur, Selenia and her little brother Betamesh. Each character has its own abilities. Arthur is more acrobatic, Selenia has a knife with which she can cut through foliage and Betamesh is smaller and can use this advantage to creep through smaller areas. The story in the game closely follows the script of the film.</p>"},{"name":"Artifact","year":2003,"developer":"Engine Software B.V."},{"name":"Asterix & Obelix XXL","year":2004,"developer":"Velez & Dubail Dev. Team","url":"a#A.zip/A%2FAsterix%20%26%20Obelix%20XXL%20%28E%29%20%28M6%29.gba","filesize":1,"score":"","genres":"Action > Behind view > Fighting > Platform > Classical antiquity > Fantasy > Licensed","desc":"<p><em>Astérix &amp; Obélix XXL</em> on the Game Boy Advance features the same story as its console/PC counterpart, but presents the 3D platformer gameplay in new and different levels rendered in an engine tailored to the handheld platform.</p><p>To free the citizens of their village from Roman capture and prevent the formula of the magic potion from falling into Roman hands, Asterix and Obelix must make their way through six Roman provinces, each consisting of five or more levels. The goal in each level is simply to reach the exit. The player controls only one of the two friends at a time, but can switch between them at will. Each of the two has different abilities: Asterix can double jump and carry torches, while Obelix has a more powerful punch and can move giant stone cubes. Hindering the duo on their way are legions of Roman soldiers as well as other enemies like barbarians, who come in different shapes and sizes, most of which can be punched out rather easily. They leave behind their helmets, which should be collected as they function as a sort of currency. The helmets can also be found lying about in the levels, along with other power-ups like hams (which restore health) or magic potions (which make the heroes temporarily invincible and stronger). Some light puzzle elements come into play when switches have to be pressed to active certain mechanisms like rising platforms or open doors that will allow the player to advance.</p><p>The collected helmets come into play when the peddler appears in a level. At his store, helmets can be spent for health power-ups as well as unlocking bonus combo moves.</p><p>Some of the levels deviate from the norm: in the so-called \"Ob-Sleigh\" stages, Obelix will slide down a river or mountainside, with Asterix riding on his back. In these, any bonus items are to be found in the middle of the track. Slowing down helps in trying to collect all of them, but high speed is required for some jumps that have to be made.</p><p>Picking up golden laurels and Roman helmets in the levels will unlock an Ob-Sleigh bonus mini-game, featuring both the stages from the main mode as well as some new ones.</p>"},{"name":"Asterix & Obelix: Bash Them All!","year":2002,"developer":"Bit Managers S.L.","url":"a#A.zip/A%2FAsterix%20%26%20Obelix%20-%20Bash%20Them%20All%21%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":6.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Asterix &amp; Obelix: Bash Them All!</em> is a 2D side-scrolling platform game based on the French comic series Astérix. It is a collection of two games. One old, namely a port of the SNES game Asterix and Obelix. The other game is called <em>Asterix &amp; Cleopatra</em>, based on the comic and animated movie of the same name. </p><p>In <em>Asterix and Cleopatra</em>, Asterix has to help a Egyptian architect Artifis to build his pyramid for Cleopatra. You play typical platform levels where you jump around obstacles and walk towards the right of the screen. Many enemies such as fake building contractors and Roman soldiers (sent by a jealous Caesar), and pirates have to be bashed into the sky. Each level is concluded with a mini-game. The game closely follows the events of the comic.</p>"},{"name":"Asteroids / Pong / Yars' Revenge","year":2005,"developer":"EC-Interactive, Ltd"},{"name":"Astro Boy: Omega Factor","year":2003,"developer":"Hitmaker","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Astro%20Boy%20-%20Omega%20Factor%20%28USA%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1,"score":8.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>Astro Boy: Omega Factor is a side-scrolling action game based off a 2003 remake of Osamu Tezuka's classic Astro Boy anime and manga series from the 1960s. You play as the young, boylike robot Astro Boy, a true mechanical pacifist who's biggest dream is that one day humans and robots can coexist in peace. Armed with a strong punch, rocket powered feet and the ability to shoot laserbeams from your fingers, arms and behind, you set off on a quest against all sorts of evildoers from the Astro Boy series.</p><p>The game has two distinctive types of levels: the more prevalent beat-em-up levels and the shooter-esque levels. During the beat-em-up levels you can walk around freely and your flying ability is limited to short bursts. The shooter levels differ from each other: sometimes you can float around the screen and shoot in both directions, other times you are flying in a set direction in a more on-the-rails fashion.</p><p>The Omega Factor mentioned in the title is actually a simple upgrading system for your weapons. Every time Astro meets someone new (be they good or bad) he or she will be added to the Omega factor screen and Astro can upgrade one of his six weapons or abilities.</p>"},{"name":"Atari: Anniversary Advance","year":2002,"developer":"Digital Eclipse Software, Inc.","url":"harry-potter-and-the-goblet-of-fire-usa/Atari%20Anniversary%20Advance%20%28USA%29.gba","filesize":4194304,"score":6.5,"genres":"Action > Compilation > Side view > Top-down > Puzzle elements > Shooter > Sci-fi / futuristic","desc":"<p>In the tradition of the Namco Museum series, Infogrames packs together 6 of Atari's greatest arcade achievements onto one Game Boy Advance cart. The conversions include:</p><ul><li>Asteroids: pilot an upgradeable ship and blast the on-coming asteroids to pieces.</li><li>Battlezone: pilot a tank and shoot your way through vector-graphic bad guys.</li><li>Centipede: shoot down and protect yourself from centipedes (much like Space Invaders).</li><li>Missile Command: command missile launchers and protect the Earth from asteroids, enemies and more dangers.</li><li>Super Breakout: classic puzzle fare, and the only non-shooter title in the set.</li><li>Tempest: vector-graphics space shooter.</li></ul><p>All are down to the exact detail as in the arcade originals. Single and multiplayer options are also included, as is an extra game to play called the \"Atari Trivia Challenge\" which is a collection of questions dating all through the history of Atari and its list of titles throughout the 80's.</p>"},{"name":"Atomic Betty","year":2005,"developer":"Breakthrough New Media","url":"a#A.zip/A%2FAtomic%20Betty%20%28U%29.gba","filesize":1,"score":6.4,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p>It's tough being an intergalactic superhero when you've got to finish your homework and make it in time to the basketball finals - but that's just what Atomic Betty, defender of the cosmos, has to do! Take care of the spoiled Penelope with the help of your friends while you're on earth, then blast off into space and combat the villainous genius, Maximus I.Q. (Evil Master Mind).</p><p>Atomic Betty is a mix of the platform and puzzle genres, and plays very similarly to The Lost Vikings, in that you control three different characters simultaneously, each with varying abilities. However, because Atomic Betty is aimed at a younger audience, there are two notable differences: first, it is a lot more difficult to die, and second, the player only needs to get one character to the exit to successfully finish the level.</p><p>When on Earth, the player controls one character that can finish the homework, one that can push or pull objects, and the last that can slide under narrow gaps. In Space, one character can repeatedly attack and use special gadgets, one can use a jetpack for a very high jump, and the last can grab items and enemies. In addition to the main levels, the game also features levels where the player must control the spaceship as it zooms through asteroid belts and high-speed space warps.</p>"},{"name":"ATV: Quad Power Racing","year":2002,"developer":"Tantalus Interactive Pty. Ltd.","url":"a#A.zip/A%2FATV%20-%20Quad%20Power%20Racing%20%28U%29.gba","filesize":1,"score":5.8,"genres":"Racing / Driving > Behind view > Direct control > Off-roading","desc":"<p>Race around closed circuit tracks on a collection of four wheel motorbikes, each with positive and negative features (handling, speed, etc.). Finish each race above the needed result and you'll move onto the next level. Once you complete a circuit, you'll move up the rankings to harder tracks, better bikes and more difficult enemy AI riders.</p>"},{"name":"ATV: Thunder Ridge Riders","year":2006,"developer":"Skyworks Technologies, Inc.","url":"a#A.zip/A%2FATV%20-%20Thunder%20Ridge%20Riders%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Sports > 1st-person > Off-roading","desc":"<p>Players race using ATVs (All-Terrain Vehicles) in different game modes such as Quick Game, Career Mode or Timed Checkpoint. Racing is very straightforward: steering, acceleration, boost, brakes and reverse. In the Career mode players need a good result to advance. They can also pick up money icons to upgrade the vehicle in the Mod Shop with new tires, engines, shocks or turbo boosts.</p>"},{"name":"Avatar: The Last Airbender","year":2006,"developer":"Halfbrick Studios Pty Ltd","url":"a#A.zip/A%2FAvatar%20-%20The%20Legend%20of%20Aang%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Anime / Manga > Puzzle elements > Direct control > Fantasy > Licensed","desc":"<p>The GBA version of <em>Avatar: The Last Airbender</em> is different from the releases for other platformers. In this adaptation of the animated TV series Aang and his friends investigate the disappearance of the Waterbender Hiryu and discover it has been happening regularly.</p><p>Controlling only Aang at the start, a group of three characters is soon formed with Katara and Sokka joining. The group moves together and the player can switch between them at any moment to take control of a specific one. It is mainly played as an action game, exploring the environment, dodging hazards and fighting enemies using a bird's-eye view, but there is also a strong element of environment based puzzle-solving.</p><p>Characters can push boxes to manipulate the environment and they each have different abilities. Aang can use a high jump to reach high ledges, Sokka can activate switches using a boomerang and Katara can construct bridges. Characters have a health meter as well as a stamina meter that is drained when performing actions and then quickly refills again.</p>"},{"name":"Avatar: The Last Airbender - The Burning Earth","year":2007,"developer":"Halfbrick Studios Pty Ltd","url":"a#A.zip/A%2FAvatar%20-%20The%20Last%20Airbender%20-%20The%20Burning%20Earth%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Top-down > Anime / Manga > Licensed","desc":"<p>Based on the Avatar show, <em>The Burning Earth</em> follows Aang and his friends as they travel to the last remaining Earth Kingdom stronghold in search of Bumi, Aang's teacher and friend.</p><p>Gameplay consists of brawling and puzzles. Each character has different moves, with each mission giving you different characters to control. While you directly control your main character, your secondary character can still assist in fights, and you can switch the primary and secondary characters at any time. The puzzles are based around your character's unique moves, and generally revolve around activating crystals.</p><p>For the PlayStation 2, Wii and Xbox 360, a different 3D game was released. The Nintendo DS also received a different 2D game.</p>"}]