[{"name":"Babar To The Rescue","year":2006,"developer":"Sirius Games A/S","url":"a#B.zip/B%2FBabar%20to%20the%20Rescue%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":"","genres":"Action > Racing / Driving > Side view > Top-down > 2D scrolling > Platform > Direct control > Automobile > Flight / aviation > Motorcycle > Naval / watercraft > Fantasy > Licensed","desc":"<p><em>Babar To The Rescue</em> is a game based around Babar the Elephant, a character from Jean de Brunhoff's children's books. It consists of a series of nine levels played in a fixed order. There are three types of gameplay and these are repeated with some variations. The included levels are:* Balloon Ride: control Babar in a hot air balloon in a 2D side-scrolling environment. Collect crowns and avoid obstacles and enemies to make it to the children.</p><ul><li><p>Across the Rivers: a side-scrolling platform game where Babar needs to make it past water sections, using platforms, swinging with vines and collecting crowns.</p></li><li><p>Jungle Rally: a top-down, vertically scrolling racing game where Babar needs to collect crows and avoid obstacles. There are also ramps that can be used. The car is steered and can be sped up or down.</p></li><li><p>The Savannah: similar to Across the Rivers but now in a savannah that is on fire.</p></li><li><p>Down the River: similar to Jungle Rally but now on a river controlling a speedboat.</p></li><li><p>In the Snow: similar to Across the Rivers and The Savannah, but now in a frozen environment.</p></li><li><p>Motorcycle Rally: similar to the previous two racing sections, but now on a motorcycle.</p></li><li><p>Off to the Island: the platforming mini-game, but with a new setting and with the ability to swim and explore underwater. Babar needs to go back to the surface regularly to fill his oxygen meters or his points are drained.</p></li><li><p>Going Home: a variation of the first Balloon Ride level as Babar needs to get back home.</p></li></ul><p>There are short story sequences between levels shown as static images and overall progresses through the levels is shown on a map. The game emphasizes the score a lot and keeps track of the highscore.</p>"},{"name":"Back to Stone","year":2006,"developer":"Hidden Floor","url":"a#B.zip/B%2FBack%20to%20Stone%20%28E%29%20%28M2%29.gba","filesize":1,"score":5.6,"genres":"Action > Isometric > Puzzle elements > Fantasy > Post-apocalyptic > Sci-fi / futuristic","desc":"<p><em>Back To Stone</em> is an isometric action game set in a world where humans have attained wisdom to overcome war and famine. However, someone traces down a black book and recites the words that unleash a horde of demons, vanquishing the humans. Some are kept alive as guinea pigs in dark experiments. One of their subjects, the nameless protagonist, managed to escape. He has been infused with a demonic essence that robs him from his human form, but grants him super strength and the ability to turn flesh into stone.</p><p>The game provides at least a 10 to 15 hour-playing time, peppered with cinematics and dialogues. There are various objects throughout the quest in order to solve many enigmas and obtain magical powers. When things get harder, a small friendly helper will show up and guide the player through the dangerous world.</p><p>This GBA game comes on a 32 Mb cartridge and offer about 20 different environments (desert, villages, ice lands, mazes, forest, swamp, lost cities…). Each environment has its own specificities of experiences and interactions (wind, water, sliding, moving pavement…). This world is inhabited by some 30 monsters and many Boss Master demons.</p>"},{"name":"Back Track","year":2001,"developer":"JV Games, Inc.","url":"a#B.zip/B%2FBacktrack%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":5.6,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>Domingoanix and his army of mutants have taken over the secret base on moon. They have assimilated thousands of humans into an army of droids that can be used to overwhelm earth. It is your job to infiltrate the base and stop them by triggering the self-destruct sequence to terminate the moon base and the aliens. <em>BackTrack</em> is a first-person shooter with graphics and gameplay comparable to Wolfenstein 3D. In contrast to the all-time classic it comes with several multiplayer modes like Deathmatch and Matrix Assault. Bots are also supported in multiplayer sessions.</p>"},{"name":"Backyard Baseball","year":2002,"developer":"GameBrains","url":"a#B.zip/B%2FBackyard%20Baseball%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Isometric > Real-time > Direct control > Baseball > Licensed","desc":"<p>Create the baseball team of your dreams! It's great baseball action with the Backyard Kids and real pro players as kids.</p>"},{"name":"Backyard Baseball 2006","year":2005,"developer":"Humongous Entertainment, Inc.","url":"a#B.zip/B%2FBackyard%20Baseball%202006%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Fixed / flip-screen > Direct control > Baseball","desc":"<p><em>Backyard Baseball 2006</em> is an entry in the <em>Backyard Sports</em> series and the second <em>Baseball</em> title in the series to be released for the GBA, following Backyard Baseball in 2002. The game uses cartoon-like visuals and carries an MLB license presenting famous players from 30 professional teams as kid versions, with 55 neighborhood kid characters in addition. Matches take place in famous stadiums, but also in backyards. The main game modes are Pick-up Game, Season Play, Mini Games and Link Play.</p><p>In Season Play a team can be taken through a season of 16 or 32 games. Typical baseball rules are followed, but there are new elements such as the ability to earn power-ups by fulfilling certain requirements, by hitting a homerun or throwing a crazy pitch. A fireball then offers an automatic strike for instance and a metal bat turns a hit into a homerun all the time. Several fields, abilities and players are unlocked gradually through the game modes and through specific actions, such as tagging out a runner, or making a double or triple play. The Mini-games mode offers challenges based around fielding and homeruns.</p><p>Compared to the first version there are improved visuals with tweaks to the gameplay. Fields are more colourful and a red target now shows where the ball will land during the fielding. There is a large amount of customization for the games, player uniforms, abilities and options such as toggling pitch locators or player stamina. There are three difficulty levels: Rookie, Pro and Allstar.</p>"},{"name":"Backyard Basketball","year":2004,"developer":"Mistic Software Inc.","url":"a#B.zip/B%2FBackyard%20Basketball%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Basketball > Licensed","desc":"<p>Create your basketball team with Backyard Kids (30 backyard kids) and kid versions of NBA stars (10 kid versions of NBA stars). Backyard Basketball have very cool power ups, two mini games and a season play mode. It is possible to go head-to-head with another GBA player with a game link cable. Games can be saved on the cartridge.</p>"},{"name":"Backyard Basketball 2007","year":2006,"developer":"Mistic Software Inc.","url":"a#B.zip/B%2FBackyard%20Sports%20Basketball%202007%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Side view > Basketball > Licensed","desc":"<p>Create your basketball team with Backyard Kids and kid versions of NBA stars. Play a single game where you can choose your team, players and a court. Play basketball season and lead your team through a rigorous BBA season and compete for the BBA championship. Four mini games are included (Practice mode, Hot Shot, Block Shot, Ball Balance). You can also play head-to-head with another player with a game link cable.</p>"},{"name":"Backyard Football","year":2002,"developer":"Torus Games Pty. Ltd.","url":"a#B.zip/B%2FBackyard%20Football%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p>Coach your own all-star winning team! It's hard-hitting football action with the Backyard Kids and real pro players as kids.</p>"},{"name":"Backyard Football 2006","year":2005,"developer":"Torus Games Pty. Ltd.","url":"a#B.zip/B%2FBackyard%20Football%202006%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Menu structures > Football (American)","desc":"<p><em>Backyard Football 2006</em> is an NFL-licensed American football game geared towards kids with a cartoon style. It is the second <em>Backyard Football</em> game for the GBA. Game modes include pickup games, exhibition matches, season play, practice games and multiplayer. There are three difficulty levels and options to toggle power-ups, fatigue and turnovers. Teams are divided over a Frontyard and a Backyard conference with multiple teams for each one, further divided into four groups: East, North, South and West. In total there are 32 NFL teams and 19 exclusive backyard teams.</p><p>There are multiple environments to choose from along with the weather options sun and rain. Each player has different statistics based on running, passing, catching, kicking and block/tackle. Custom characters can be created. In Exhibition matches the player and the computer take turns selecting a player to build a team. Matches have optional pre- and post-game commentary through an animated sequence. Multiplay plays and strategies are supported.</p><p>Gameplay is shown through a side-scrolling bird's-eye view from the sideline. Some actions have a power meter that builds and depletes automatically; the player then has to time carefully to hit at the right moment and determine the power of the action. The game is in full 3D. After each important action strategies can be switched. The game also always offers a recommended play.</p>"},{"name":"Backyard Hockey","year":2003,"developer":"Humongous Entertainment, Inc.","url":"a#B.zip/B%2FBackyard%20Hockey%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Top-down > Hockey","desc":"<p>Skate, shoot and score with the Backyard Kids and kid versions of the hottest NHL® pros!</p><p>Features: All 30 NHL teams, Ten different professionals, Ice hockey and air hockey, Cartridge save, Link cable support</p><p>The game has a lot of options available. You can toggle on or off the music or the text commentary,you can set the difficulty level, the length of periods, toggle penalties on or off, factor in fatigue, and activate a Rock, Paper, Scissors game.</p>"},{"name":"Backyard Skateboarding","year":2005,"developer":"Full Fat Productions Ltd.","url":"a#B.zip/B%2FBackyard%20Skateboarding%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Skateboarding","desc":"<p><em>Backyard Skateboarding</em> is a game in the <em>Backyard Sports</em> series and the fifth game in the series released for the GBA. A number of skaters gathers to raise funds to turn their backyard into a real skatepark. They participate in the Backyard Skate Tour where they help out people in the neighbourhood to earn stamps in their tour book. They start at Mom 'N' Pop's Skateshop and by earning enough stamps they can move on to another shop. Every location also has a kid acting as a boss, offering a challenge. When defeated, the kid the joins the group as a new playable character. As each kid also brings a sponsor, at the end of the game their will be enough funds to build the ultimate park Skate Station Alpha.</p><p>The game is different from the earlier PC version and uses a bird's-eye view. There are different skaters available that can be customized. Each skater has different statistics based on air, balance, flip, speed and spin. The skater is controlled directly in a scrolling environment that can be explored freely in any direction. Every location has characters with tasks or challenges to complete to earn the stamps. Tasks for instance include delivering newspapers against a time limit. The main score is shown in the top left corner as \"juice\". Skaters can move, jump and perform tricks. Often parts of the environments can be used for grinds and jumps using ramps.</p><p>The game includes a multiplayer mode.</p>"},{"name":"Baldur's Gate: Dark Alliance","year":2004,"developer":"Magic Pockets SAS","url":"a#B.zip/B%2FBaldur%27s%20Gate%20-%20Dark%20Alliance%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.1,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Real-time > Action RPG > Hack and slash > Fantasy > Licensed","desc":"<p>This version of <em>Baldur's Gate: Dark Alliance</em> follows the same story and has many gameplay similarities to the console release, but also differs from it significantly in presentation and gameplay features.</p><p>Due to the limitations of the handheld platform, the game uses an isometric perspective with two-dimensional graphics. It retains the action RPG gameplay system of the console version; however, in this release, the player character is unable to jump.</p><p>The player is only allowed to control a human character in this version (as opposed to the pre-made human, elf, and dwarf characters of the console release). The player can still choose to assign the human hero to one of the three available classes: warrior, archer, and wizard.</p><p>Other differences include the addition of a few side quests, and an enhanced level of interactivity in the city of Baldur's Gate (the characters are able to enter more houses, talk to town inhabitants, break barrels with equipped weapons, etc.).</p>"},{"name":"Ballistic: Ecks vs. Sever","year":2002,"developer":"Crawfish Interactive Ltd.","url":"7#Ballistic%3B%20Ecks%20vs.%20Sever%20%28USA%29.gba","filesize":8388608,"score":7.5,"genres":"Action > 1st-person > Shooter > Stealth > Spy / espionage > Licensed","desc":"<p>Much the same as the first title, Ballistic is a 1st person shooter at heart, where you play as ex-FBI agent Ecks and former NSA operative Sever. You must progress through the game as either of the two main characters, gunning down the bad guys along your intended path while also using the latest spy gear to your advantage in gaining access to certain areas and avoiding hazards. 24 missions await you, based in locations around the world.</p><p>The story takes place after the events of the first title, where Ecks originally tried to hunt down Sever. Here, they work together to discover the secrets behind a worldwide weapon cartel, and only they can shut it down before things get out of hand.</p><p>Two player co-operative campaigns add to the package, where you'll play as both characters through a number of missions. Up to four can compete in Deathmatch, capture the flag and many other multiplayer modes.</p>"},{"name":"Balloon Fight","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Banjo Pilot","year":2005,"developer":"Rare Limited","url":"a#B.zip/B%2FBanjo%20Pilot%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.1,"genres":"Racing / Driving > Behind view","desc":"<p>Banjo Pilot is the 4th installment of Banjo-Kazooie series. Formally known as Diddy Kong Pilot this is the basic kart racer having you race the B-K characters around tracks based on the classic platformers worlds such as Hailfire Peaks and Treasure Trove Cove. As with all kart racers there are numerous items across the track you can use to attack your enemies. It also features four person multiplayer using a Game Boy Advance link cable.</p>"},{"name":"Banjo-Kazooie: Grunty's Revenge","year":2003,"developer":"Rare Limited","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Banjo-Kazooie%20-%20Grunty%27s%20Revenge%20%28USA%2C%20Europe%29.zip","filesize":1,"score":7.1,"genres":"Action > Isometric > Platform > Puzzle elements","desc":"<p>Gruntilda has returned to create more havoc for Banjo and Kazooie. In their first handheld adventure, the two must again team up to take on the evil witch and end her terror once and for all.</p><p>Six worlds await as you control Banjo through each environment, fighting with various enemies and solving puzzles to reach the final showdown. Kazooie tags along and can be used in certain situations to aid your task.</p>"},{"name":"Barbie and the Magic of Pegasus","year":2005,"developer":"WayForward Technologies, Inc.","url":"a#B.zip/B%2FBarbie%20and%20the%20Magic%20of%20Pegasus%20%28E%29%20%28M6%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Mini-games > Platform > Puzzle elements > Licensed","desc":"<p>Take off on a magical quest with Annika™ and her sister, Brieta™ - a flying horse! The evil Wenlock has turned everyone in the kingdom to stone and it's up to Annika™ and Brieta™ to reverse the spell! Play exciting mini-games and solve puzzles to defeat the wizard to restore the kingdom!</p>"},{"name":"Barbie as the Island Princess","year":2007,"developer":"Human Soft Inc.","url":"a#B.zip/B%2FBarbie%20as%20The%20Island%20Princess%20%28U%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Fixed / flip-screen > Mini-games > Direct control > Fantasy > Licensed","desc":"<p><em>Barbie as the Island Princess</em> is a mini-game collection based on the 2007 animated movie of the same name. It is different from the PC and console versions (those versions feature 28 minigames instead of the count of 12 in this version). The game is set on a tropical island where Barbie, as the shipwrecked princess Rosella, is raised by her new family of animal friends and eventually rescued off the island by Prince Antonio. By progressing through the mini-games the princess moves from her island home to the prince's coastal castle. Next to the mini-games, different outfits can be tried in the dressing room section of the game.</p><p>The mini-games include catching coconuts launched by an elephant, fishing with a net, rotating objects to match a shape, grabbing and stacking fruit before it falls down, bouncing a bubble in the air, a \"Simon Says\" variant, a timed input game involving dancing, collecting flowers, connecting stars as a memory game, collecting birds, playing a song by selecting the right notes, getting rid of bugs in the garden and so on. Many games have a time limit and the game keeps track of the score. By doing well points can be scored to unlock accessories for the dressing room.</p><p>The Nintendo DS version changes the rotating objects to match a shape minigame to a minigame which utilizes the stylus and is about tracing an outline. Also, the bubble bouncing game has been expanded to multiple bubbles instead of only one found in the GBA version. Another difference from the GBA version is that the DS version also has animated movie clips which unlock through gameplay and can be watched again in the Extras section found on the DS main menu.</p>"},{"name":"Barbie as The Princess and the Pauper","year":2004,"developer":"WayForward Technologies, Inc.","url":"a#B.zip/B%2FBarbie%20-%20The%20Princess%20and%20the%20Pauper%20%28E%29%20%28M6%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Mini-games > Platform > Puzzle elements > Fantasy > Licensed","desc":"<p>Get ready for an action-filled royal adventure with Barbie™! Jump into action with Erika™ and Princess Anneliese™! The evil Preminger™ is causing mayhem throughout the kingdom and it's up to Erika™, Anneliese™ and the royal cats to stop him! Play exciting mini-games, solve puzzles and collect clues to find the villain and banish him from the kingdom forever!</p>"},{"name":"Barbie Diaries, The: High School Mystery","year":2006,"developer":"NeoPong Software, Inc.","url":"a#B.zip/B%2FBarbie%20Diaries%2C%20The%20-%20High%20School%20Mystery%20%28E%29.gba","filesize":1,"score":"","genres":"Adventure > 3rd-person (Other) > 2D scrolling > Graphic adventure > Mini-games > Puzzle elements > Direct control > Contemporary > Detective / mystery > Licensed","desc":"<p><em>The Barbie Diaries: High School Mystery</em> is a game based on the 2006 movie <em>The Barbie Diaries</em>. The game is set in Barbie's high school where valuable items for the high school charity auction have gone missing. By locating these Barbie cannot only help the school, but it will also help her land the TV anchor position currently held by Raquelle, a girl she does not like.</p><p>The game is largely played as an adventure game where Barbie explores the environment, talks to characters and uses a large variety of tech tools to locate and inspect clues. All available tools are accessible through the BDA (Barbie Diary Assistant). Examples are an Infrared Viewer, an MP3 Decoder or a Picture Descrambler. There are nineteen locations in total to explore with a map that provides an overview. The clues are stored in a separate screen and there is also an overview of the current objectives. The sequences where the tech tools are used are also available as mini-games at the main menu.</p>"},{"name":"Barbie Horse Adventures: Blue Ribbon Race","year":2003,"developer":"Blitz Games Ltd","url":"a#B.zip/B%2FBarbie%20Horse%20Adventures%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":"","genres":"Action > Isometric > Puzzle elements > Licensed","desc":"<p>Join Barbie as she adventures through eight horse riding events in the Primrose Hill Cup. Players run, jump and navigate past obstacles in a 3D (isometric) environment.</p><p>Collect flowers, coins and balloons, unlocking four mini games and 64 extra horses along the way. Players can also customize Barbie's riding attire and horse look.</p>"},{"name":"Barbie in The 12 Dancing Princesses","year":2006,"developer":"WayForward Technologies, Inc.","url":"a#B.zip/B%2FBarbie%20in%20the%2012%20Dancing%20Princesses%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > Platform > Fantasy > Licensed","desc":"<p><em>Barbie in the 12 Dancing Princesses</em> is a 2D side-scrolling platformer based on the 2006 direct-to-video animated movie of the same name, with the story loosely based on the fairy tale <em>The Twelve Dancing Princesses</em>. The game is different from the PC/PS2 3D version Barbie in the 12 Dancing Princesses. Barbie is cast as Genevieve, one of the twelve princesses who live with their windowed father King Randolph in a castle. They live a frivolous life, so Randolph brings over his cousin Duchess Rowena to raise them as proper princesses. She makes their lives miserable however and one day Genevieve wakes up and discovers her father has been poisoned and the other eleven princesses have been locked up.</p><p>Genevieve needs to explore different locations to free her fellow princesses. With the game being a platformer, she needs to jump to navigate areas and avoid enemies. Initially the gameplay is very basic, but by freeing the princesses, six abilities are provided gradually, such as a butterfly net to attack enemies, magic stilts to cross large gaps, ribbons to create staircases, a mallet to hit croquet balls and operate switches, putting down a book as an additional platform, and running faster. In the DS version the abilities are stored in the lower screen and can be activated by tapping them, changing the colour of Genevieve's dress. With new abilities more difficult environment based puzzles are introduced, for instance when Genevieve has to be guided through two parallel planes. She has three hearts that represent health and the game has some boss fights.</p><p>There are several mini-games, for instance one with Genevieve's cat Twyla in a fixed-scrolling platform challenge, butterfly catching, ribbon racing, a time trial run etc. There are two difficulty levels and the unlocked mini-games can be accessed right away from the main menu. The game has a password function to continue playing. In the DS version the player sometimes needs to blow into the microphone to extinguish fires.</p>"},{"name":"Barbie: Groovy Games","year":2002,"developer":"Digital Illusions Canada, Inc.","url":"a#B.zip/B%2FBarbie%20Groovy%20Games%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Puzzle > Strategy > 1st-person > Side view > Top-down > Fixed / flip-screen > Turn-based > Board game > Cards / tiles > Falling block puzzle > Mini-games > Music / rhythm > Tile matching puzzle > Direct control > Point and select > Licensed","desc":"<p>Barbie and her friends head out to the city to visit a couple hotspots. These hotspots turn out actually contain some mini-games that Barbie and her friends can partake in. One or two players can choose to play as Ken, Barbie, Christie, Teresa, or (in the GBA version only) Lea, Kayla, and Becky.</p><p>Each of the following mini-games has three difficulty levels (easy, medium, and hard). * There's an ice cream parlor with mini-game Four Scoops. Players try to create ice cream sodas by playing a Connect Four variant.</p><ul><li><p>The music store contains the mini-game D.J. Booth, where players match compact discs back into their cases in this Concentration variant. The GBA features a 3x3, the PlayStation a 4x4 grid.</p></li><li><p>The jewelry store has the mini-game Gems and Jewels, where players are tasked with being the first to line up four gems that have either the same shape, color, size, or whether they're solid or hollow on a 4x4 grid. Players take turns, with one player choosing a gem for the other player to use and vice versa when it's the other players turn.</p></li><li><p>At the arcade, the mini-game Daisy Derby lets the player race a horse versus another horse. The mini game is basically a Hangman game where players have to guess the letters in a word. Correct guesses move the player's horse forward while incorrect guesses move the player's opponent's horse forward.</p></li><li><p>The beauty salon contains the mini-game Bubble Machine, which is Bust-A-Move variant where players shoot colored bubbles at other colored bubbles hoping to match three of the same color to make them disappear.</p></li><li><p>The dance studio contains the mini-game Conga Line, where players try to form the longest conga line in this Snake game.</p></li><li><p>The disco has the mini-game Groove &amp; Move where players make Skipper dance by pressing the directions the computer highlights. Players must be quick to press the correct directions to do the correct dance moves.</p></li><li><p>The park (GBA only) contains Tic-Tac-Toe played on a picnic blanket, which is the classic game of creating a line of three symbols on a 3x3 grid.</p></li><li><p>The beach (GBA only) contains Checkers, the classic board game, played in the American variant on an 8x8 board.</p></li><li><p>The farmers market (PlayStation only) contains Fruit Fallout, where fruit falls into baskets forming columns. Players have to connect 3 like fruits to make them disappear before the baskets overflow.</p></li></ul><p>The Info Booth (PlayStation only) contains the high scores and instructions on how to play all of the mini-games. On the GBA, the instructions can be looked at before each of the mini-games and high scores are not saved. The PlayStation version also includes voice acting for all characters.</p>"},{"name":"Barnyard","year":2006,"developer":"Halfbrick Studios Pty Ltd","url":"a#B.zip/B%2FBarnyard%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.4,"genres":"Action > Diagonal-down > Fantasy > Licensed","desc":"<p><em>Barnyard</em> is based on the animated movie of the same name. It is set on a farm where all animals can talk and walk, but only when no humans are around. The player takes the role of a new arrival, either a male or female cow, who has to finds its place inside the community. While the basic gameplay mechanics are almost identical to the console version, many aspects are simplified, e.g. the overall size, the mini game complexity and the graphical presentation (top-down instead of behind-the-shoulder).</p><p>The basic gist is that the player walks around freely in the unlocked portions of the farm, talks to other animals with exclamation points on their head and solves fetch quests for them. While some of those quests are mandatory to progress the plot, others are side content and only serve to earn money in order to buy decorations for the night festivities (there is a day/night circle and the character automatically goes to sleep at 2 a.m.). When entering more dangerous areas of the farm, there are enemies which take away life energy when touched. They can either be avoided or fought by shooting milk at them (which involves rotating the character so the udder aims in the enemy's direction).</p><p>The main character has three stats which can be improved during the course of the game: life energy, milk capacity and running speed. The latter is important because the cow can only run a short amount of time before running out of breath, but later there is a bicycle which helps moving around. Additionally there are a few optional mini games.</p>"},{"name":"Baseball","year":2002,"developer":"Nintendo R&D1"},{"name":"Baseball Advance","year":2002,"developer":"Smilebit","url":"a#B.zip/B%2FBaseball%20Advance%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":7.8,"genres":"Sports > 3rd-person (Other) > Top-down > Baseball > Licensed","desc":"<p>Sega and THQ combine to bring Baseball to the GBA. Featuring Season, All-Star, Playoff and Exhibition modes, you can choose from every team and player from the current lineup of the Major Baseball League. You also have four fields to choose from (Fenway Park, Safeco Field, Wingley Field and Pacific Bell Park).</p><p>The batting and pitching elements of the game are shown through a third-person view, the camera placed behind the batter. The fielding, however, plays from a top-down perspective allowing you to see it clearly.</p>"},{"name":"Batman Begins","year":2005,"developer":"Vicarious Visions, Inc.","url":"a#B.zip/B%2FBatman%20Begins%20%28UE%29%20%28M6%29.gba","filesize":1,"score":6.7,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Platform > Licensed","desc":"<p>Follow the story of the movie through a multitude of highly interactive levels spanning various locations. Control Bruce Wayne as he trains in the Himalayas, caught off-guard as he narrowly escapes an attack on his mansion, and as Batman using a variety of acrobatic moves and combo-driven attacks. Fight off challenging AI and use gadgets from the Bat Belt against bosses including Ra's Al Ghul and The Scarecrow. The game presents a rich graphical environment full of interactive and environmental objects utilizing real-time lighting and alpha effects.</p>"},{"name":"Batman: Rise of Sin Tzu","year":2003,"developer":"Ubi Soft Entertainment Inc.","url":"a#B.zip/B%2FBatman%20-%20Rise%20of%20Sin%20Tzu%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":"","genres":"Action > Side view > Platform > Licensed","desc":"<p>Unlike Batman: Rise of Sin Tzu on console platforms, the GBA version is a 2D platformer/beat'em up. The player controls Batman, one of the main heroes from DC Comics universe.Batman runs through various Gotham districts, jumps on roofs, and fights against criminals; our hero can use his fists, gadgets, or heavy objects that he may chance upon to incapacitate his foes. While running there will be many platformer obstacles like needing to to interact with levers to move to following areas. The main villain in story is Sin Tzu, but Batman meets other villains from the universe, such as the Scarecrow.</p><p>Using a Gamecube to Game Boy Advance link cable unlockables can be obtained in both the console and handheld versions of this game.</p>"},{"name":"Batman: Vengeance","year":2001,"developer":"Ubi Soft Entertainment Inc.","url":"a#B.zip/B%2FBatman%20-%20Vengeance%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":6.6,"genres":"Action > Racing / Driving > Side view > Top-down > Platform > Puzzle elements > Shooter > Licensed","desc":"<p>Trouble is brewing in Gotham City: The Joker has another nefarious plan for bringing down Batman. It begins with a break-in at the Gotham Museum and ends with the Joker falling from the Gotham Bridge, apparently to his death (as depicted in the first levels of gameplay). Now, Gotham's other supervillains, including Mr. Freeze and Poison Ivy don't rest and want to fill the void left by the Joker. Thankfully, Batman is not alone in his efforts to stop them, as his trusted companions Robin and Batgirl are there to help.</p><p>Batman: Vengeance for the GBA has the same basic story as its counterpart on consoles (and uses stills from that version's rendered sequences for story cutscenes), but differs in gameplay. Both games are inspired by the 1990s Batman animated TV series rather than the comics.</p><p>The game has four different kinds of levels:</p><p>In the side-scrolling levels, Batman runs and jumps from left to right, beating up various henchmen with kicks and punches. He can also use various gadgets: batarangs and smoke bombs to take out enemies and a grappling hook to reach otherwise inaccessible areas.</p><p>In the Batmobile stages, viewed from the top, the Batmobile has to reach a goal within a certain time limit. Naturally, the road is filled with both traffic and other obstacles that take time from the clock or slow Batman down. Thankfully, the Batmobile is equipped with a gun that can take some obstacles out of the way.</p><p>It's Robin and Batgirl's turn in the Batplane stages, which are similar to traditional side-scrolling shoot'em'ups. The Batplane has to be steered through an automatically scrolling landscape, filled with flying hazards and various guns. The plane can be made invulnerable for a short time by employing an energy shield, and it is also equipped with a gun to fight back.</p><p>Finally, Robin goes at it solo in the so-called Puzzle stages. Viewed from the top, Robin must navigate a labyrinth of rooms and find the exit. Crates block the way that have to be moved in the correct order to free the path. Passwords and key cards must be found to open barriers. To gain access to areas behind holes that are too small to pass through, a remote-controlled robot called the Batcrawler can be used. These stages also have enemies to be defeated.</p><p>Once the game has been finished in Story Mode, a password is given out for Advance Mode. Advance Mode features slightly different versions of the original levels with different goals: in the side-scrolling, Puzzle and Batmobile levels, three data disks must be collected and the end of the level reached before a timer runs out. In the Batplane levels, the Joker has placed three \"Pyro toys\", which have to be destroyed, again before a timer runs out.</p>"},{"name":"Battle B-Daman","year":2006,"developer":"Zero One Corporation","url":"a#B.zip/B%2FBattle%20B-Daman%20%28U%29.gba","filesize":1,"score":"","genres":"Action > 1st-person > Anime / Manga > Shooter > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>Battle B-Daman</em> is a game based on the B-Daman marble shooting toy produced in Japan by Takara, and more specifically the <em>Battle B-Daman</em> manga adaptation by Eiji Inuki. The game follows Yamato Delgado who dreams of playing B-Daman, the traditional sports game of the B-Daworld. The goal is to battle various B-DaPlayers to compete in the Winner's Tournament. To get there he needs to find all parts of a Cobalt Blade.</p><p>The game is mainly about one-to-one battles between two robots interspersed with some story elements. By winning matches new parts become available offering customization options. The battles are played from a first-person perspective where the robot can only be moved left or right, firing coloured plastic balls to damage the opponent and avoiding the incoming attacks. There are two ways to battle: Direct Hit Battle or B-Daman Invasion. A button is used to shoot while a B-DaSpirit gauge fills up gradually. When the D-Pad shape starts blinking along with red triangles and different directions, the B button can be pressed along with the direction of the red triangle to launch a Special Attack. These Special Attacks vary throughout the game based on the B-Daman customization and equipment.</p>"},{"name":"Battle B-Daman: Fire Spirits!","year":2006,"developer":"Will Co., Ltd.","url":"a#B.zip/B%2FBattle%20B-Daman%20-%20Fire%20Spirits%21%20%28U%29.gba","filesize":1,"score":"","genres":"Action > 1st-person > Anime / Manga > Shooter > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>Battle B-Daman: Fire Spirits!</em> is an action game based on the anime TV series of the same name, which is in turn based on the B-Daman line of toys. It is a follow-up to the Battle B-Daman game released in the same year. The game is mainly about one-to-one battles between two robots interspersed with some story elements. By winning matches new parts become available offering customization options. The battles are played from a first-person perspective where the robot can only be moved left or right, firing coloured plastic balls to damage the opponent and avoiding the incoming attacks.</p><p>The story revolves around the character Yamato Delgado who, after becoming a B-Dachampion, now enters the Winners Tournament. Most of the game he is in search of Strike Shots that will help him ensure victories. It initially follows the story of the early anime episodes, but then changes introducing a new antagonist called Death Poker Alliance. They are after the Petrified Parts Yamato is looking for.</p><p>The game contains a main Adventure mode focusing on the store as well as a Battle mode. There are also six mini-games: Battle Shoot, Gate Check, Puzzle Wall, Snipe Shoot, Target Bug and Target Hit.</p><p>There are many strategic elements during the battles based on different special and charged attacks. The Zero System concept of the original game is replaced with the Blaster Core System. It allows for the customization of special moves by equipping a specific core.</p>"},{"name":"BattleBots: Beyond the Battlebox","year":2003,"developer":"Cave Barn Studios","url":"7#BattleBots%3B%20Beyond%20the%20BattleBox%20%28USA%29.gba","filesize":8388608,"score":"","genres":"Action > Racing / Driving > Isometric","desc":"<p><em>BattleBots: Beyond the Battlebox</em> lets you create the robot warrior of your dreams and challenge 16 actual bots from the TV show. Equip them with weapons and armor of your choice and challenge your friends to system link play with up to four players. Play solo against three bots simultaneously in Tournament or Brawl mode. Combat takes place in five different hazard filled arenas including the famed BattleBox. BattleBots: Design &amp; Destroy captures the action and excitement of the TV show that started the robot combat craze.</p>"},{"name":"Bee Game, The","year":2006,"developer":"Independent Arts Software GmbH"},{"name":"Berenstain Bears and the Spooky Old Tree, The","year":2005,"developer":"Program Ace","url":"a#B.zip/B%2FBerenstain%20Bears%20and%20the%20Spooky%20Old%20Tree%2C%20The%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Licensed","desc":"<p>When Brother Bear, Sister Bear, and their cousin Fred head out to explore an scary house, a thunderstorm forces them to take shelter in a spooky old tree. Now rather lost, they must puzzle their way through seven large levels to escape.</p><p><em>The Berenstain Bears and the Spooky Old Tree</em> is a puzzle platform game based on the book with same name. Each of the three bears have different abilities and attacks, and all three will need to work together to reach the exit in each level. Brother Bear can push boxes, and has a slingshot that shoots straight ahead. Sister Bear can jump extra far, and has a stick. Cousin Fred can use a rope to reach high areas, and can throw pinecones in an arc. When they're attacked by enemies, they lose courage. After three attacks, they need to retry the level. Candy and honey pots are scattered around the level, and will give the Bears another chance at the level.</p><p>The game was packaged with a Berenstain Bears story, called <em>Trick or Treat</em>.</p>"},{"name":"Berry Tree","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Beyblade VForce: Ultimate Blader Jam","year":2003,"developer":"Full Fat Productions Ltd.","url":"a#B.zip/B%2FBeyblade%20V-Force%20-%20Ultimate%20Blader%20Jam%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.9,"genres":"Action > Isometric > Anime / Manga > Direct control > Licensed","desc":"<p>In a twist for the series, <em>Beyblade VForce: Ultimate Blader Jam</em> is not based on spinning top battles. Instead, the game bears a closer resemblance to Marble Madness. In each level, you'll need to get your top to the exit, negotiating narrow paths, and watching out for enemies. There are collectibles in each level, called Bit Beasts, and each level has a par time to beat. Of course, you're controlling a top, not a marble, and so you have a spin gauge. The lower this gauge gets, the harder your top will be to control, and the closer you are to losing. The story features a group of mysterious strangers who are systematically beating the world Beyblade champions.</p><p>This game also has a multiplayer mode. Battle against a friend in the battle mode, and try to knock your opponent's Beyblade off the level, or just stay spinning longer. There is also a race mode, which challenges you to reach the exit before your opponent.</p>"},{"name":"Beyblade: GRevolution","year":2004,"developer":"Full Fat Productions Ltd.","url":"a#B.zip/B%2FBeyblade%20G-Revolution%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Real-time > Fantasy > Licensed","desc":"<p>BECOME A BEYBLADE™ CHAMPION! Explore the entire Beyblade™ world, where you'll challenge the greatest Beybladers™ and collect valuable parts! Sharpen your battle skills on your quest to become World Champion!</p>"},{"name":"Bible Game, The","year":2005,"developer":"Alpine Studios, Inc.","url":"a#B.zip/B%2FBible%20Game%2C%20The%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Educational > Diagonal-down > Isometric > Game show / trivia / quiz > Puzzle elements > Direct control > Menu structures > Religion","desc":"<p>In stark contrast to its Xbox and PlayStation 2 counter-parts, <em>The Bible Game</em> on Game Boy Advance is an isometric, action-adventure game that is trivia-centric. The Master Deceiver is on the hunt and the only way to stop him is to find and wear the Armor of God. The six pieces of the armor have been scattered amongst the lands within six different churches. It is the player's job to collect each piece and assemble the Armor of God. There are three difficulty levels within the game: Easy, Medium, and Hard.</p>"},{"name":"Big Mutha Truckers","year":2005,"developer":"Raylight Studios s.r.l.","url":"a#B.zip/B%2FBig%20Mutha%20Truckers%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Transport > Truck > Vehicle simulator","desc":"<p>Screw your family, truck other road users, and swindle your way to a fortune! Ma Jackson, owner of Big Mutha Truckers Inc., has announced to her four kids that she's planning on retiring. Choosing the new owner of the company will not be easy, as Ma's kids are a difficult bunch. The solution? A Trial by Truckin' - whoever makes the most money trucking through Hick State County in 60 days takes control of the company.</p>"},{"name":"Bionicle","year":2003,"developer":"Möbius Entertainment Ltd."},{"name":"Bionicle Heroes","year":2006,"developer":"Amaze Entertainment, Inc.","url":"a#B.zip/B%2FBionicle%20Heroes%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CDa%29.gba","filesize":1,"score":7,"genres":"Action > Top-down > Sci-fi / futuristic > Licensed","desc":"<p>In the GBA version of Bionicle Heroes, based on the LEGO Bionicle franchise, players take on the guise of the TOA Anika team. Set on the island of Voya Nui, they need to retrieve the Mask of Life, stolen by the Piraka race who also enslaved the Matoran, the native inhabitants, in the process. Unlike the console and the DS versions, a top-down perspective is used.</p><p>The game takes place on six zones of the island, followed by a final showdown. The player starts as a TOA of Fire, but by completing zones and killing the level boss, additional masks can be collected: Air, Stone, Ice, Earth and Water. Each TOA has a primary and secondary weapon based on the mask's elemental nature, with specific features. During the levels, there are also weapon upgrades to be found. The second weapon is limited by an energy meter which needs some time to recharge. Each zone requires a specific TOA guise, but in the Free Play mode completed levels can be revisited and players can then switch between the forms at any time to use different abilities. TOAs can strafe while fighting - there is an option to face enemies automatically or to control this manually.</p><p>TOAs are assisted by proto-spawn orbs, sidekicks that circle around the hero and fire at enemies. The orbs are chased off when they take too much damage, but they can also be upgraded based on the 6 elements and the weapons can be customized. Players can define to have the orbs fire in spread patterns or rapid bursts, lock on targets with fire, cause explosions, fire through shields or do double damage. Additional attacks are provided through elemental runes, which provide a one-time limited effect, such as freezing enemies, activating a lightning shield, smashing enemies with spikes from the ground, temporary invulnerability, full health and regeneration, and a fire blast.</p><p>By destroying objects and buildings in the environment, blue, gray or gold LEGO pieces are revealed, providing health and bonus points. The TOAs also need to use pieces to build bridges, platforms, elevators, turrets, barricades or moving platforms. At the end of each zone, the rank and score is shown. Based on the performance or specific actions, there are 12 medals to collect, of which a few can only be found in the Free Play mode.</p><p>Each zone contains secret cheat words. Upon discovering them, they are added to a cheat menu. They allow to play as a golden TOA or to obtain a new mask with a sombrero, open up a music jukebox, provide a hidden Cluck gun or grant invincibility or one-shot kills.</p>"},{"name":"Bionicle: Matoran Adventures","year":2002,"developer":"Argonaut Games PLC","url":"a#B.zip/B%2FBionicle%20-%20Matoran%20Adventures%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CDa%29.gba","filesize":1,"score":"","genres":"Action > Side view > Platform > Puzzle elements > Licensed","desc":"<p>The island of Mata Nui holds a dangerous path of evil. In order to defeat it, you must control two heroes in order to solve the puzzles and defeat the enemy characters along the way.</p><p>Based on the Lego toy series, Bionicle, your task is to defeat the Bahrag. The two characters you control both have their advantages, and you must swap between the two during play in order to get through each of the 6 worlds.</p>"},{"name":"Bionicle: Maze of Shadows","year":2005,"developer":"Razorback Developments Ltd","url":"a#B.zip/B%2FBionicle%20-%20Maze%20of%20Shadows%20%28E%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Top-down > 2D scrolling > Real-time > Turn-based > Japanese-style RPG (JRPG) > Puzzle elements > Direct control > Menu structures > Sci-fi / futuristic > Licensed","desc":"<p><em>Bionicle: Maze of Shadows</em> is a top-down action game set in the LEGO Bionicle universe and based on the book of the same name. The game features six playable characters, six stages and multiplayer features.</p><p>The Toe Metru, six great heroes, are looking for a means to awaken their sleeping people, the Matoran. They need to venture into the underground labyrinth Maze of Shadows, where the vicious Rahi lurk and filled with traps and puzzles.</p><p>The player controls all of the six Toa Metru, and he has to use their individual special skills to overcome the challenges thrown at him. During the course of the game, each Toa Metru can enhance gis special skills, each representing a different element (ice, air, earth, fire, stone, and water). While the standard gameplay takes place from a top-down view, combat is played out in turn-based fashion similar to Golden Sun.</p>"},{"name":"Black Belt Challenge","year":2002,"developer":"Lost Boys Games","url":"a#B.zip/B%2FBlack%20Belt%20Challenge%20%28E%29.gba","filesize":1,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting","desc":"<p>Black Belt Challenge is a 2D fighting game for the Nintendo Game Boy Advance. There are 11 different characters available and each has its own level.The game features game modes like Arcade, Challenge, Survival, Training and a VS mode where you can battle an opponent via the Link cable.Coins collected in the Challenge mode can be spend in the Art Gallery to unlock extra features.The cartridge supports a save game option to store progress.</p>"},{"name":"Black/Matrix Zero","year":2002,"developer":"Flight-Plan Inc.","url":"a#B.zip/B%2FBlack%20Matrix%20Zero%20%28J%29%20%5BT%2BEng_Chris%20Judah%5D.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p>This installment of the Black/Matrix series is set in the same universe, a world which is populated by angels with white bird-like wings, demons with black bat-like wings, and wingless humans. For many years, the war between angels and demons has been going on. You control an ordinary boy named Cain. You live on a secluded island as a servant of a woman named Matia, far away and seemingly safe from the battle areas. But as both demons and angels seem to be interested in Matia and she gets kidnapped eventually, Cain realizes he must do everything to save her, and becomes involved in the great struggle.</p><p>This is a strategy RPG with turn-based combat, in which you navigate your party members on the isometric battle screen and attack or use magic spells when the enemy is in range. Story sequences occur between battles which take up most of the gameplay.</p>"},{"name":"Blackthorne","year":2003,"developer":"Blizzard Entertainment Inc.","url":"a#B.zip/B%2FBlackThorne%20%28E%29.gba","filesize":1,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Direct control > Fantasy","desc":"<p>The planet Tuul was a peaceful place, until the evil warrior Sarlac used the power of the Darkstone to take control. Kyle Blackthorne's father, the good King Vlaros, sent him to Earth just as his kingdom crumbled around him. Now, twenty years later, Kyle is grown and must return to Tuul to free it from the clutches of Sarlac.</p><p><em>Blackthorne</em> is a platform action game played from a side-view with non-scrolling backgrounds. It has certain similarities to Prince of Persia, being set in maze-like environments and focusing on exploration and occasional puzzle-solving. Kyle Blackthorne fights enemies by shooting at them. His default weapon, a pump action shotgun, can be upgraded throughout the course of the game. Various types of bombs can be used to damage enemies, blow open doors, or destroy generators. Keys must be found to gain access to new areas.</p>"},{"name":"Blades of Thunder","year":2005,"developer":"InterActive Vision A/S","url":"a#B.zip/B%2FBlades%20of%20Thunder%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Behind view > Shooter > Direct control > Flight / aviation > Helicopter","desc":"<p><em>Blades of Thunder</em> is a 3D action game about controlling a helicopter during military missions. The story revolves around defeating a terrorist organization called The Solar Martyrs targetting oil refineries in the Middle East. During gameplay the helicopter is shown using a behind view. It has a pseudo 3D environment and it is one of the first games to employ voxel technology on the GBA. The helicopter can be steered freely combining strafing with changing the altitude for evasive manoeuvrers. There are separate controls to move the crosshairs. The main action usually revolves around taking out units in the air, on the ground or at sea, but there are also escorting tasks or protecting allied vehicles and buildings.</p><p>Three types of environments are used with snowy areas, deserts and a generic European setting. In the bottom right a radar shows enemy units. Enemies also use radars as vehicles and these can be taken out to draw less attention. Other parts of the hud display remaining lives, the amount of health, the remaining ammo for the unguided Hydra rockets and lock-on Homing Missiles (the regular machine gun has infinite ammo) and the total score. Later levels introduce power-ups to provide additional damage or the ability to fire multiple rockets in one shot. Health and ammo are replenished by flying over pick-up stations.</p><p>There are ten levels with primary and secondary objectives and each one starts with a short briefing. There are also bosses to defeat. There are three difficulty levels and a password system is used. At the end of a mission a total mission score is calculated based on the amount of units destroyed, the amount of secondary objectives completed and bonuses.</p>"},{"name":"Blender Bros.","year":2002,"developer":"Hudson Soft Company, Ltd.","url":"a#B.zip/B%2FBlender%20Bros.%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":7,"genres":"Action > Racing / Driving > Side view > Platform > Puzzle elements","desc":"<p>Humans and Animalmen co-exist in the world, living and working together. However, as Animalmen now outnumber humans, an anti-human group calling themselves the Zooligans are out to destroy the humans and take the galaxy for themselves.</p><p>It's up to Blender, the leader of the Cosmo Keepers, to save the world using his own powers and the abilities of the Mini Bros. (robotic creatures that, when evolved, help you greatly in your quest). Blender can use his large ears to float around levels, whack enemies out of the way and climb up ropes or pogo-hop.</p><p>Levels vary between platform jumping, boss battles, and every world has you driving around the level (a la Mario Kart), collecting keys to prevent the world from blowing up.</p><p>Multiplayer modes include 4-player racing, the opportunity to trade Mini Bros. plus 2 other mini-games to play.</p>"},{"name":"Board Game Classics","year":2005,"developer":"Black Lantern Studios, Inc.","url":"a#B.zip/B%2FBoard%20Game%20Classics%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Strategy > Top-down > Turn-based > Board game > Chess","desc":"<p><em>Board Game Classics</em> includes the games Chess, Checkers, and Backgammon. In each of these games, you can either face the computer, on one of three difficulty levels, play against your friends, watch the computer play itself, or set up a tournament against the computer. You can choose an avatar, piece set, and board as well.</p><p>Optional variant rules include forcing jumps in checkers, castling and en passant in chess, and backgammon scoring and automatic doubling in backgammon.</p>"},{"name":"Bobble Tris","year":2002,"developer":""},{"name":"Boktai 2: Solar Boy Django","year":2004,"developer":"Konami JPN","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Boktai%202%20-%20Solar%20Boy%20Django%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Isometric > Platform > Puzzle elements > Shooter","desc":"<p>Django has been stripped of his valuable weapon of choice and now must rid the world of evil with more traditional weaponry, including whips and swords. But the light of the sun is still available to him as you are thrust back into the dark world of vampires and undead creatures. With the sun as your guide, you must solve the puzzles and increase Django's abilities, in turn improving your chances of survival.</p><p>The sequel to Boktai: The Sun is in Your Hand combines, like its predecessor, action gameplay with role-playing and stealth elements. The RPG elements have been expanded in the sequel, allowing more customization of the character. Of course, the sun sensor returns in-built into the cartridge, and you must use the light of the sun to build up the power output of your weapons and defeat the end of level bosses for good. Collect items and trade them with friends or play four player battles.</p>"},{"name":"Boktai: The Sun is in Your Hand","year":2003,"developer":"Konami JPN","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Boktai%20-%20The%20Sun%20Is%20in%20Your%20Hand%20%28USA%29.zip","filesize":1,"score":7.6,"genres":"Action > Isometric > Platform > Shooter > Sci-fi / futuristic","desc":"<p>Following in his father's footsteps, you play Django the vampire hunter, who uses the power of the sun to defeat the many evil beings that infest the world. Search out the various levels for the evil inside, and destroy the immortal that rules the area to complete the level.</p><p>This isometric platformer does not have you fighting evil with the usual assortment of weapons and devices, but it will have you playing outdoors. The inbuilt sunlight sensor on the cartridge detects levels of sunlight, which determines not only the time of day you play, but also acts as ammo for your weapon. Run out of sunlight, or play in the dark, and evil will have the upperhand.</p><p>Many elements to the sunlight can have an effect on how the game plays out. For example, you can only replenish ammo during play by standing outside or, if indoors, under light from a window. Sunlight batteries can be collected during play to store sunlight, so you can play at night.</p>"},{"name":"Boku wa Koku Kanseikan","year":2001,"developer":"Graphic Research Co., Ltd.","url":"a#B.zip/B%2FBoku%20wa%20Koukuu%20Kanseikan%20%28J%29%20%28V1.1%29.gba","filesize":1,"score":"","genres":"Simulation > Isometric > Managerial / business simulation","desc":"<p><em>Boku wa Kōkū Kanseikan</em> is an air traffic controller simulation. Four different airports in Japan: Nagoya, New Chitose, Kansai, and Tokyo International are in need of a skilled logistics. The player views a menu interface showing the airport and selects various options to command aircraft to land, take off, move into the hangar and move to the runway. Other tasks such as plowing the runway or performing maintenance on planes must also be completed. The ultimate goal of the game is to ensure all flight take off and land at the airport at the times designated, avoiding all possible delays.</p>"},{"name":"Bōkyaku no Senritsu","year":2004,"developer":"Alpha-Unit"},{"name":"Bomberman","year":2004,"developer":"Hudson Soft Company, Ltd."},{"name":"Bomberman Jetters: Densetsu no Bomberman","year":2002,"developer":"Hudson Soft Company, Ltd.","url":"a#B.zip/B%2FBomberman%20Jetters%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Role-playing (RPG) > Diagonal-down > Anime / Manga > Arcade > Mini-games > Sci-fi / futuristic","desc":"<p><em>Bomberman Jetters: Densetsu no Bomberman</em> is an action role-playing game from the Bomberman series. It is directly based on the Bomberman Jetters anime and its storyline.</p><p>The player can take a role of Bomberman or Max to save the Planet Bomber from the Hige Hige Bandits who want to ruin it with an artificial planet called Dark Star. To accomplish their mission Bomberman and Max have to destroy four engines of Dark Star.</p><p>There is also available a battle mode and an up to four players head-to-head multi-player mode.</p>"},{"name":"Bomberman Jetters: Game Collection","year":2003,"developer":"Hudson Soft Company, Ltd.","url":"a#B.zip/B%2FBomberman%20Jetters%20-%20Game%20Collection%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Compilation > Puzzle > Side view > Top-down > Anime / Manga > Arcade > Mini-games > Pinball > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p><em>Bomberman Jetters: Game Collection</em> is a collection of minigames and a part of the Bomberman series. It is based on the Bomberman Jetters anime.</p><p>4 main sections can be found in the menu: Pinball Game, Battle Mode, Minigame Collection, Gallery.</p><ul><li>Pinball Game - a typical Bomberman-themed arcade game with an addition of the boss fights.</li><li>Battle Mode - a traditional up to four players head-to-head single-player or multi-player mode.</li><li>Minigame Collection - a variety of different minigames similar or directly based on the ones from the Bomberman Land titles.</li><li>Gallery - a collection of 60 locked pictures that can be unlocked after getting certain achievements in Pinball Game and Minigame Collection.</li></ul>"},{"name":"Bomberman Max 2: Blue Advance","year":2002,"developer":"Hudson Soft Company, Ltd.","url":"a#B.zip/B%2FBomberman%20Max%202%20-%20Blue%20%28E%29%20%28M3%29.gba","filesize":1,"score":6.8,"genres":"Action > Top-down > 2D scrolling > Puzzle elements > Trading / collectible card > Direct control > Sci-fi / futuristic","desc":"<p>Bomberman again teams up with Max to take on the evil Mujoe. But before they get the chance, Mujoe turns the tables, shrinking the heroes into tiny critters. Now the two must use their bombing powers and traverse the levels, blowing up obstacles and enemies to get to the exit, to eventually destroy the device and return themselves to normal size.</p><p>As with all previous <em>Bomberman</em> titles, the aim of the game is to plant bombs, destroying anything that comes within the range of the blast. Charabomb characters can be collected during play to increase your powers, or you battle and trade them with a friend in link mode.</p><p><em>Blue Advance</em> has you playing as Bomberman, and only when linking it with <em>Red Advance</em> you can access extra missions and collect all Charabombs. A classic 4-player Bomberman mode is also included.</p>"},{"name":"Bomberman Max 2: Red Advance","year":2002,"developer":"Hudson Soft Company, Ltd.","url":"a#B.zip/B%2FBomberman%20Max%202%20-%20Red%20%28E%29%20%28M3%29.gba","filesize":1,"score":6.8,"genres":"Action > Top-down > 2D scrolling > Puzzle elements > Trading / collectible card > Direct control > Sci-fi / futuristic","desc":"<p>Bomberman again teams up with Max to take on the evil Mujoe. But before they get the chance, Mujoe turns the tables, shrinking the heroes into tiny critters. Now the two must use their bombing powers and traverse the levels, blowing up obstacles and enemies to get to the exit, to eventually destroy the device and return themselves to normal size.</p><p>As with all previous Bomberman title, the aim of the game is to plant bombs, destroying anything that come within the boundaries of the blast. Charabomb characters can be collected during play to increase your powers, or you battle and trade them with a friend in link mode.</p><p>Red Advance has you playing as Max, the robotic hero and good friend of Bomberman. Only when linked with Blue Advance can you open extra missions and collect all Charabombs. A classic 4 player Bomberman mode is also included.</p>"},{"name":"Bomberman Tournament","year":2001,"developer":"Hudson Soft Company, Ltd.","url":"a#B.zip/B%2FBomberman%20Tournament%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":7.8,"genres":"Action > Top-down > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>This latest release of Bomberman, written to exploit the GBA in term of graphics and sound, features a multitude of options and multiplayer capabilities. Upto 4 people can play a deathmatch.</p>"},{"name":"Bookworm Deluxe","year":2004,"developer":"PopCap Games, Inc.","url":"a#B.zip/B%2FBookworm%20%28U%29.gba","filesize":1,"score":7.8,"genres":"Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Word construction > Point and select","desc":"<p><em>Bookworm</em> is a combination of Scrabble and Bejeweled, in which you create words by selecting letters from adjacent tiles. Completed words are converted to points and removed from the board. New tiles fall in from the top to fill in the empty tile positions. Watch out for fiery letter tiles that will burn through your other tiles one at a time. Creating longer words will stave off burning tiles and generate bonus tiles as well. Words containing bonus tiles are worth more points.</p><p>The dictionary in this deluxe version is robust, containing over 150,000 words from three to twelve letters long. The Deluxe version adds an Action Game, new bonus gem tiles, automatic saved games, many word definitions, and a high score Hall of Fame maintained locally and, optionally, on the Internet.</p>"},{"name":"Boulder Dash EX","year":2002,"developer":"Vision Works","url":"a#B.zip/B%2FBoulder%20Dash%20EX%20%28E%29%20%28M3%29.gba","filesize":1,"score":7.1,"genres":"Action > Side view > Puzzle elements > Direct control","desc":"<p>Based on the original Boulder Dash, you must find your way through each puzzle to collect the gems in order to open the exit door, while moving boulders out of the way and dodging enemies.</p><p><em>Boulder Dash EX</em> includes a brand new, updated version of the classic title, with a new main character and 6 worlds full of puzzle action. Also on the cart is the original <em>Boulder Dash</em> emulated from its PC form.</p><p>The 4 player mode has you and 3 other gamers going head-to-head to gain the most gems, while dropping boulders and bombs at each other.</p>"},{"name":"Boundish","year":2006,"developer":"Skip, Ltd."},{"name":"Boxing Fever","year":2001,"developer":"Digital Fiction Inc.","url":"a#B.zip/B%2FBoxing%20Fever%20%28U%29.gba","filesize":1,"score":7.2,"genres":"Sports > 1st-person > Boxing","desc":"<p>An arcade style boxing game from Majesco. Boxing Fever features eight playable characters in a variety of modes including championship, training, linked game and more. Included are five different circuits to fight in and some hidden characters to unlock. The game is played in the \"in your face viewpoint\" and features detailed 3d graphics and motion effects. The gameplay includes a variety of boxing moves and tons of combos.</p>"},{"name":"Bratz","year":2003,"developer":"DC Studios, Inc.","url":"a#B.zip/B%2FBratz%20%28E%29%20%28M5%29.gba","filesize":1,"score":5,"genres":"Action > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p>This is a dance game where you can be one of the 5 Bratz girls.  You can practice or make your way through the Bratz tournament.</p><p>There's a competitive dance mode and a copycat mode where you can have fun with your friends.</p>"},{"name":"Bratz Babyz","year":2006,"developer":"Barking Lizards Technologies L.L.C.","url":"a#B.zip/B%2FBratz%20-%20Babyz%20%28Europe%29%20%28En%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Fixed / flip-screen > Mini-games > Direct control > Skateboarding > Fantasy > Licensed","desc":"<p><em>Bratz Babyz</em> is based on the toy line of dolls of the same name. The game is set in a mall where the Bratz Babyz need to escape their daycare and rescue Snappy from the clutches of the evil Duane. This is done by playing numerous mini-games where 'Blingz' are earned as a currency. The mini-games can be selected right away from a central area.</p><p>The names of the included mini-games are Balloonatics, Castle Mazenstein, ExScream Makeover, Fashion Skate, Fountain of Youths, Hop and Seek, Karaoke Time, Ring for Blingz, Snack Attack, Snappy's Wild Ride, Sweet Necklace Treat, Top Trumps, and Wash a Pooch.</p>"},{"name":"Bratz Forever Diamondz","year":2006,"developer":"Barking Lizards Technologies L.L.C.","url":"a#B.zip/B%2FBratz%20-%20Forever%20Diamondz%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Mini-games > Direct control > Contemporary > Licensed","desc":"<p>The GBA version of <em>Bratz Forever Diamondz</em> is different from the versions for other platforms. The premise is identical: based on the 2006 direct-to-DVD film of the same name, players help the Bratz quartet (Cloe, Jade, Sasha and Yasmin) travel across the United States in a truck in search of the hottest fashion designer for the 'America Rocks Fashion' TV show competition. The winner of the competition will then receive the grand prize: A pair of go-go boots studded with several diamonds.</p><p>The girls use the truck to travel between locations and it can be customized with different designs and colors. The driving is a short mini-game shown from a behind view where heart-shaped items called 'blingz' are collected while a timer counts down. In the location the girls arrive at there are short story sequences and different types of activities need to be completed such as finding an assistant, assisting the people with tasks or buying and items using the 'blingz' currency. In these sections the girls are controlled directly in turns with a scrolling bird's-eye view.</p><p>More currency is earned through short mini-games such as a game of volleyball, collecting blingz while rollerskating against a time limit, designing a flyer or participating in a dance competition. There is an overview of all objectives that need to be completed. It is possible to talk to most of the characters. Once everything is done, the girls drive to a new location where a new set of objectives needs to be completed.</p>"},{"name":"Breath of Fire","year":2001,"developer":"Capcom Co., Ltd.","url":"a#B.zip/B%2FBreath%20of%20Fire.gba","filesize":1,"score":7.2,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>Long ago in the days of darkness and magic, a young wanderer comes face to face with his destiny.  You control the fate of Ryu, a young warrior and descendant of the Light Dragon Clan.  Together, with your mystical friend, Nina, you must search for magic spells and mysterious secrets.  Along the way, gain experience and skill as you battle against strange monsters.  Uncover valuable secrets that will help you on your adventure and unlock the secrets of the Dragon Clan.</p>"},{"name":"Breath of Fire II","year":2001,"developer":"Capcom Co., Ltd.","url":"a#B.zip/B%2FBreath%20of%20Fire%20II%20%28E%29.gba","filesize":1,"score":7.8,"genres":"Role-playing (RPG) > Isometric > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>Ryu was a young boy who has memories of a strange village far away and a magical doorway which sucked him through. However those are only distant memories. Ryu and his best friend Bow are apprentices in the Ranger's Guild. As adventurers they take on posted jobs needed by the townspeople. However it isn't long before one job goes awry and Bow is accused of stealing a valuable item. In order to clear his friend's name and find the meaning of his dreams, Ryu will explore the world, eventually discovering the meaning of his dreams and hidden abilities inside himself.</p><p><em>Breath of Fire II</em> is a role playing game. The majority of game is played from a top-down map, however battles are seen from an isometric view. Ryu will form parties from among 8 other characters, each with their own set of skills and powers that will help him discover the truth behind the mystery. </p><p>In the GBA version, you can use a link-cable to link to friends and exchange weapons and items to defeat the higher evils. And with the inclusion of the community system, you can build and maintain your own city while you are fed up of exploring.</p>"},{"name":"Britney's Dance Beat","year":2002,"developer":"ART Co.,Ltd.","url":"a#B.zip/B%2FBritney%27s%20Dance%20Beat%20%28E%29.gba","filesize":1,"score":5.3,"genres":"Action > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p>Britney's Dance Beat, the rhythm game licensed from pop star Britney Spears, received its own version for the Game Boy Advance, with similar gameplay, but a unique selection of modes, and graphics and sound tailored to the handheld platform.</p><p>The game's main mode is called Dance Mode. It features two main stages: Practice Mode and Concert Mode. Practice Mode has to be completed first before Concert Mode opens up. Each consists of the same five songs, but Concert Mode increases the difficulty. Actual gameplay consists of a radar-like object spinning clockwise on the left of the screen, highlighting the buttons to be pressed in rhythm with the music, while a rendition of Britney Spears dances along on the right of the screen. Depending on if and how well the notes are hit, a score of either \"great\", \"good\" or \"miss\" is given. The simpler songs in Practice involve only a single button, but later songs include both the A and B buttons, and, in Concert Mode only, also require the D-Pad to be pressed at the same time. To complete a song and move on to the next, a scoring threshold must be met. Finishing a song also unlocks pictures of the star to be looked at in the Tour Book. Finishing every song in Concert Mode unlocks a video clip of a concert performance.</p><p>There is also a two-player mode via link cable, which is similar to the main game mode in the console version: both players have their own rhythm indicator. Good performance allows attacks on the other player, shuffling their controls for additional difficulty. An additional single-player game mode is the Puzzle Mode: a simple sliding puzzle, with four different pictures available (three of which must be unlocked in Dance Mode).</p><p>While the included Britney Spears songs are the same as in the console version, they are not simply played back digitally. Due to hardware limitations, they are only approximated with percussion samples and the occasional voice sample, but the main vocal track is played through a GBA synthesizer.</p>"},{"name":"Broken Sword: The Shadow of the Templars","year":2002,"developer":"Revolution Software Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Broken%20Sword%20-%20The%20Shadow%20of%20the%20Templars%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1,"score":8.1,"genres":"Adventure > Side view > Graphic adventure > Puzzle elements > Point and select > Detective / mystery > Romance","desc":"<p>George Stobbart is an American tourist spending his autumn vacation in Paris. He barely escapes a bombing of a café and decides to investigate the clues left behind by the killer. This eventually leads him to a mystery dating back to the legend of the Knights Templar.</p><p><em>Circle of Blood</em> is the first part in the Broken Sword series. It is a third-person puzzle-solving point-and-click adventure game with 2D cartoon-like graphics. The player moves the character around using the mouse, examines the environment, talks to other people and collects items stored in an inventory. These items need to be used or combined with other items to solve puzzles. George gets help from Nicole Collard, a French journalist. The story is divided into eleven chapters and takes place in locations such as Paris, Ireland, Syria, and others.</p>"},{"name":"Bruce Lee: Return of the Legend","year":2003,"developer":"Vicarious Visions, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Bruce%20Lee%20-%20Return%20of%20the%20Legend%20%28USA%29.zip","filesize":1,"score":"","genres":"Action > Side view > Beat 'em up / brawler > Platform > Martial arts > Licensed","desc":"<p>Bruce Lee plays the role of Hai Feng, a martial arts student out for revenge after the death of his master at the hands of the Yakan organisation. Playing out like a Bruce Lee movie, you can pull off all the famous moves that made Bruce Lee a star of the action genre between cut scenes that tell the compelling story, and fights set in original, yet familiar, landmarks.</p><p>The side-scroller will have you fighting various enemies from left, right, above and below. Explore each level for various weapons, while completing tasks to complete the level (such as finding a certain amount of keys or rescuing hostages to defeating every enemy that is thrown at you). Use Bruce Lee's abilities to flipkick up ledges to higher ground or flip characters over your shoulder to knock out those behind you.</p>"},{"name":"Bubble Bobble Old & New","year":2002,"developer":"Taito Corporation","url":"a#B.zip/B%2FBubble%20Bobble%20-%20Old%20%26%20New%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.5,"genres":"Action > Compilation > Side view > Fixed / flip-screen > Arcade > Platform > Direct control > Fantasy","desc":"<p>The two bubble blowing dinosaurs return in this arcade update for Game Boy Advance.  Rescue Bub and Bob's girlfriends by making your way through 100 dangerous levels.  Either tough it out on your own, or get a friend's help by playing either single-cart or multi-cart multiplayer!  To defeat enemies, simply trap them in bubbles that you blow, then pop the bubbles with your dinosaur's spines!</p><p>Bubble Bobble: Old &amp; New includes both the classic arcade version, and an all-new version, with updated graphics and sound.  Also included is battery back-up to save your progress, as well as an item library, which keeps track of all the goodies you've collected in the game.</p>"},{"name":"Buffy the Vampire Slayer: Wrath of the Darkhul King","year":2003,"developer":"Natsume Co., Ltd.","url":"a#B.zip/B%2FBuffy%20-%20The%20Vampire%20Slayer%20%28U%29%20%5Bh2IR%5D.gba","filesize":1,"score":5.3,"genres":"Action > Side view > Fighting > Platform > Puzzle elements > Horror > Licensed","desc":"<p>Years ago, the Darkhul King was banished to a hidden dimension. But somehow he has found his way back to Earth, and now he's ready to unleash his powers on the unsuspecting public of Sunnydale. Of course, Sunnydale is also the home of the one and only Buffy. Using her experience against the many monsters, and her amazing strength and fighting techniques, your job is to guide her along through each level and defeat the many vampires and other evil beings before taking on the prime evil, the Darkhul King itself.</p>"},{"name":"Butt-Ugly Martians: B.K.M. Battles","year":2002,"developer":"Runecraft Ltd.","url":"7#Butt-Ugly%20Martians%3B%20B.K.M.%20Battles%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>Butt-Ugly Martians: B.K.M. Battles</em> is a side-scrolling shoot'em up game based on the cartoon of the same name. The Martian Emperor Bog has grown tired of his inefficient Earth-invaders-turned-Earth-protectors envoys and had dispatched an army of evil aliens to finally take over the Earth. The three Butt-Ugly Martians must stop him.</p><p>The player can pick their favorite Martian out of B-Bop A-Luna, 2T Fru-T, or Do-Wah Diddy, each with a different mix of attack, defense, and speed abilities. All of them are in \"butt-kicking mode\" (B.K.M.), meaning they don their powerful assault suit. </p><p>On each level, the player is tasked with destroying aliens and unlocking doors by finding the correct keys to reach the end of the space cavern where a boss enemy will be waiting for them. Various power-ups can be picked up to increase the abilities of the playable characters: extra fire power, extra armor, temporary invincibility, turbo, etc. </p><p>Occasionally, the player will be confronted by Stoat Muldoon, an alien hunter and long-time antagonist of the Butt-Ugly Martians, who can be defeated by simply collecting a memory erasing crystal and using it against him. The game contains a total of 28 levels spread over 7 worlds. There are three difficulty levels and progress is saved using a password system. </p><p>Butt-Ugly Martians: B.K.M. Battles also features Gamecube connectivity with the game Butt Ugly Martians: Zoom or Doom in which special content can be unlocked by collecting five colored gems in the Game Boy Advance game.</p>"}]