[{"name":"Cabbage Patch Kids: The Patch Puppy Rescue","year":2006,"developer":"1st Playable Productions, LLC","url":"a#C.zip/C%2FCabbage%20Patch%20Kids%20-%20The%20Patch%20Puppy%20Rescue%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p><em>Cabbage Patch Kids: The Patch Puppy Rescue</em> is a platform game for the Game Boy Advance. You begin the game by selecting one of several Kids to control, each with their own name and appearance. The goal is to reach the end of several sets of platforming levels &amp; talk to the friend or puppy at the end. The gameplay is simple and there is no way to die or take damage, though there are occasional enemies who will knock you back if you touch them. There are also three minigames to play through in-between stages. After beating all the stages, you can revisit each level to collect all the gems and try for a 100% file.</p>"},{"name":"Cabela's Big Game Hunter","year":2002,"developer":"ImageBuilder Software, Inc.","url":"a#C.zip/C%2FCabela%27s%20Big%20Game%20Hunter%20%28U%29.gba","filesize":1,"score":"","genres":"Action > 1st-person > Top-down > Hunting > Direct control > Licensed","desc":"<p>Master your hunting skills with addictive Big Game Hunter action from Alaska to Montana. Big Game Hunter features the most popular \"Trophy\" animals in the world and authentic Cabela's gear for non-stop, fast-paced hunting action!</p><p>Hunt 5 different \"Trophy\" animals in a variety of conditions!</p><p>Stalk your prey in 4 unique regions!</p><p>Choose from 5 firearms, 5 scents and 5 lures for life-like action!</p>"},{"name":"Cabela's Big Game Hunter: 2005 Adventures","year":2004,"developer":"Torus Games Pty. Ltd.","url":"a#C.zip/C%2FCabela%27s%20Big%20Game%20Hunter%20-%202005%20Adventures%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Sports > 1st-person > Top-down > Hunting > Licensed","desc":"<p>In this portable installment of Activision's long standing hunting simulation series players start a game by customizing a character, selecting age, hair, and snazzy hunting couture, as well as hunting skills, such as aiming, accuracy, strength, and stealth. Then they set out on an hunting adventure, with a view to pot a grizzly bear or wildest moose. Two modes are available a \"Quick Hunt\" and a \"Career Hunt\". Fear not, the later is hardly social commentary, rather it is a goal oriented story mode, while the former will allow the player to select one of the various breath taking North American hunting and persecute the local fauna to their heart's content. The story mode revolves around allowing the player's grizzled uncle \"Pete\" live vicariously through the them by accomplishing Pete's dream of entering the Hunter's Hall of Fame. Hunters wishing to achieve such fame must slay one animal in each of the 65 hunting regions in the country. Poor Pete was three kills shy of bloodsport immortalization, then he broke his leg... The player must accomplish the entire task, for Pete's sake.</p><p>Gameplay consists of selecting a region to go hunting in and then wandering about looking for the correct animal in your bestiary to knock off. In Alaska for instance the player may be tasked with gunning down a moose. During the aimless wandering and Promethean loneliness sections of the game the player will have time to select the proper guns and ammo for their quarry as well as apply various lures and fatally seductive moose (etc.) mating cries. When the animal sought is kind enough to appear, at the end of a long trail of tracks, the player may whip out their rifle going into a first person, crosshair-grafted-directly-to-the-eye style, mode. When the player is content with a corpse it will be weighed and the level will end, until they choose to return to try and bag a heftier score. </p><p>Being sentimental the game provides the player with trophies of their kills in the form of taxidermied animal heads for which a rustic and picturesque log cabin has graciously been provided.</p>"},{"name":"Caesars Palace Advance: Millennium Gold Edition","year":2001,"developer":"Pipedream Interactive, Inc.","url":"a#C.zip/C%2FCaesar%27s%20Palace%20Advance%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Gambling","desc":"<p>A collection of casino 'money making' games for GBA.</p><p>Play Video Poker, Blackjack, Craps, Roulette,Video Horse Racing, and Keno, while making virtual money to become a champion of Caesar's Palace casino. Making enough money will allow the player to open the VIP room for even more gambling action.</p>"},{"name":"Camp Lazlo: Leaky Lake Games","year":2006,"developer":"Collision Studios","url":"a#C.zip/C%2FCamp%20Lazlo%20-%20Leaky%20Lake%20Games%20%28U%29.gba","filesize":1,"score":"","genres":"Adventure > Top-down > Puzzle elements > Licensed","desc":"<p><em>Camp Lazlo: Leaky Lake Games</em> is based on the animated series of the same name from Cartoon Network that chronicles the odd but happy camping life of a Bean Scout named Lazlo and his bunkmates at Camp Kidney.</p><p>In the game, players take alternating control of Lazlo, an optimistic, high-energy Brazilian monkey, Raj, a wise but compulsive Indian elephant, and Clam, an eccentric and highly intelligent pygmy Rhino, to compete in a variety of camp challenges, earning the right to represent their camp in a final tournament against the Squirrel Scouts, a rival all-girl camp to the all-boy Camp Kidney.</p>"},{"name":"Candy Land / Chutes & Ladders / Original Memory Game","year":2005,"developer":"Black Lantern Studios, Inc."},{"name":"Capcom Classics: Mini Mix","year":2006,"developer":"Sensory Sweep Studios","url":"a#C.zip/C%2FCapcom%20Classics%20-%20Mini%20Mix%20%28U%29.gba","filesize":1,"score":7.2,"genres":"Action > Side view > Isometric > Fighting > Sci-fi / futuristic > Martial arts","desc":"<p>This game consists of three NES games from Capcom's golden era available on one cartridge, each featuring a new take on their arcade counterparts:</p><ul><li>Strider: Take command of Strider Hiryu as he attempts to unravel a mystery that will take him from one end of the world to the other. Gain levels, collect items, and converse with various characters.</li><li>Mighty Final Fight: Cody, Guy, and Haggar fight the Mad Gear Gang in this new take on the classic beat-em up. Level up your characters to improve their fighting skills.</li><li>Bionic Commando: Use your rifle and extendable bionic arm to battle your way through enemy lines, rescue Super Joe, and put an end to the enemy's top secret Albatross project. Swing across pits and obstacles with your bionic arm, tap enemy radio transmissions, and upgrade your weaponry as you make your way to the final challenge.</li></ul>"},{"name":"Car Battler Joe","year":2001,"developer":"Ancient Co. Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Car%20Battler%20Joe%20%28USA%29.zip","filesize":1,"score":7.3,"genres":"Action > Racing / Driving > Role-playing (RPG) > Diagonal-down > Anime / Manga > Post-apocalyptic > Sci-fi / futuristic","desc":"<p><em>Car Battler Joe</em> is a car battling game. The game involves using cars to fight opponents in action-styled battles, with role-playing game game mechanics. Player starts with one car, but as he gathers different parts, he can build others and store them at his garage. There are four types of vehicles: light buggy, medium car, heavy truck and hovercraft, each with its pros and cons. Each car can mount from two to four different weapons, including cannons, machine guns, and close-ranged weapons. All weapons are divided in three groups, according to damage type: missile, flame and beam. Player can earn money by taking randomly generated missions. These missions generally involve delivering goods, destroying enemy, gathering lost items and duels. All missions have strict time limits and player is getting extra money for completing them faster than expected. Story missions have no time limit, but they are longer and harder.</p><p>The player takes the role of 16 year-old Joe, who on his birthday receives a powerful and rare car and a robot, which helps to control that vehicle. Joe then embarks on the journey to find his lost father, a car-battler of great renown, and to become a car-battler himself.</p>"},{"name":"Care Bears: Care Quest","year":2005,"developer":"Sirius Games A/S","url":"a#C.zip/C%2FCare%20Bears%20-%20The%20Care%20Quests%20%28E%29%20%28M8%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Fixed / flip-screen > Mini-games > Puzzle elements > Direct control > Licensed","desc":"<p>Welcome to the colorful land of \"Care-a-lot,\" home to the fun and fuzzy Care Bears! The Care Bears are a group of adorable, furry friends who each have a special caring mission to help one another learn how to care. Choose your favorite Care Bear, and then set out on 12 different and exciting Care Quests through the beautiful landscapes of \"Care-a-lot.\"</p>"},{"name":"Cartoon Combo: The Powerpuff Girls: Mojo Jojo A-Go-Go / Dexter's Laboratory: Deesaster Strikes!","year":2003,"developer":""},{"name":"Cartoon Network Block Party","year":2004,"developer":"Monkeystone Games","url":"a#C.zip/C%2FCartoon%20Network%20-%20Block%20Party%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > Arcade > Board game > Licensed","desc":"<p><em>Cartoon Network Block Party</em> is a party game that keeps the game play fast and fun on the Game Boy Advance. Play as any of 6 characters from your favorite Cartoon Network cartoon properties: Johnny Bravo, Courage the Cowardly Dog, Cow and Chicken and Ed, Edd n Eddy. </p><p>Challenge up to 3 friends on 4 colorful themed boards, each styled after Cartoon Network shows: Planet Johnnywood, Katz's Creepy Castle, The Tater Farm and Extreme Cul-De-Sac. Master 14 unique mini-games that challenge all of your skills: Riding Mower Grand Prix, Waterbomb Catch, Fish Frenzy, Backyard Boogie, Strike a Pose, Greased Porkbutt Catch, Fence Sitters, Weremole Waltz and many more. Cash mini-games reward players with money so they can pay for a competitive advantage or access passes to other areas of the board.</p>"},{"name":"Cartoon Network Speedway","year":2003,"developer":"DC Studios, Inc.","url":"a#C.zip/C%2FCartoon%20Network%20-%20Speedway%20%28U%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Licensed","desc":"<p>It's time for the Cartoon Network Racing Championship! Players can pick their character, and race for the finish line. <em>Cartoon Network Speedway</em> is a racing game with plentiful power-ups, shortcuts, and unlockables. It includes a quick race (just a simple race of 1-5 laps), challenge (beat the star rating), championship (beat all the races), and two-player mode. The twist to this game is that it's not enough to come in first, but the player also has to be stylish. The star rating is used to unlock characters, tracks, and power-ups, and is increased by passing opponents, attacking opponents, collecting stars, setting records, and so on.</p><p>Twelve tracks and characters are included, most locked at the beginning. 20 different power-ups can be found, for attacks, road hazards, speed, and odder effects.</p>"},{"name":"Castlevania","year":2004,"developer":"Konami Industry Co. Ltd.","url":"a#C.zip/C%2FCastlevania%20%28E%29%20%5B%21%5D.gba","filesize":1,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Horror > Regional differences","desc":"<p>Every hundred years, the dark vampire known as Dracula resurrects and terrorizes the land. A vampire hunter named Simon Belmont bravely ventures into the Count's mansion in order to defeat him. Along the way he'll have to defeat skeletons, bats, fishmen, medusa heads and other evil creatures.</p><p><em>Castlevania</em> is a side-scrolling platform action game. The player takes the role of Simon Belmont, who is able to jump and crack his whip directly in front of him. Power-ups can be obtained by defeating enemies or by whipping candles that appear in the castle. One such power-up increases the power and length of Simon's whip. Different weapons can be gathered which consume hearts when used, these hearts can also be collected from monsters and candles. Additionally, some walls will hide secrets such as the health-restorative turkey or the Double and Triple shot abilities for the weapons Simon has collected. At the end of each section of the castle is a boss, which must be defeated. Progression through the castle eventually leads to a confrontation with Count Dracula himself.</p>"},{"name":"Castlevania: Aria of Sorrow","year":2003,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"7#Castlevania%3B%20Aria%20of%20Sorrow%20%28Europe%29%20%5BEn%2CFr%2CDe%5D.gba","filesize":8388608,"score":8.6,"genres":"Action > Role-playing (RPG) > Side view > 2D scrolling > Metroidvania > Platform > Puzzle elements > Europe > Fantasy > Horror","desc":"<p>Normally a solar eclipse isn't a dangerous event, but for Soma Cruz, being sucked through a portal and into Dracula's castle during one will turn his day into a total nightmare. As Soma, you must venture through the castle and find a way out. As you do so, you will discover the true meaning behind the event, and why Dracula has risen yet again.</p><p>Although set in the future, all of the weapons and hazards are the same or similar to those seen in past <em>Castlevania</em> titles. Soma can find or buy weapons of all types such as swords, spears, and axes. Through his mysterious power of Dominance Soma can take the souls of his enemies and use their powers as his own, providing passive stat boosts, powerful magic, or even summoning them forth to fight on his behalf. Dracula's castle is a single continuous building, and as Soma's power of Dominance grows and he acquires more monster souls to power abilities he can bypass obstacles that were previously insurmountable. Players can link up with a friend's copy of <em>Castlevania: Aria of Sorrow</em> to trade souls between them.</p>"},{"name":"Castlevania: Circle of the Moon","year":2001,"developer":"Konami Computer Entertainment Kobe, Inc.","url":"7#Castlevania%3B%20Circle%20of%20the%20Moon%20%28USA%29.gba","filesize":8388608,"score":7.9,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > RPG elements > Europe > Fantasy > Horror","desc":"<p>Count Dracula has been resurrected and evil will reign supreme unless he is stopped. As Nathan Graves, you'll hunt down the Count and use your whip and a variety of special items to destroy his minions. Battle your way through Dracula's castle and rid the world of his evil once again.</p><p><em>Castlevania: Circle of the Moon</em> is the first of the series to be based on the action/RPG structure of Castlevania:Symphony of the Night rather than the level-based action style of all previous <em>Castlevania</em> games. Dracula's castle is a single continuous building, and as Nathan discovers artifacts within it he gains new abilities that allow him to explore more of it. While Nathan can only use his Killer Whip as a weapon, he can find and equip different kinds of armor and accessories that change his stats. Unique to this entry in the series is the Dual Set-up System, where a combination of two cards will give Nathan unique magical abilities. For example, equipping a fire type card with a whip card will give the Killer Whip a fire attribute, while equipping it with a summon card will let Nathan summon a fire demon to attack onscreen enemies.</p>"},{"name":"Castlevania: Harmony of Dissonance","year":2002,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"7#Castlevania%3B%20Harmony%20of%20Dissonance%20%28USA%29.gba","filesize":8388608,"score":7.8,"genres":"Action > Side view > 2D scrolling > Arcade > Metroidvania > Platform > Europe > Fantasy > Horror","desc":"<p><em>Castlevania: Harmony of Dissonance</em> is the second <em>Castlevania</em> game to appear on the Game Boy Advance. Juste Belmont and friend Maxim are drawn to the newly resurrected Dracula's Castle in order to save their mutual friend Lydie, although it remains to be seen who will be saving whom.</p><p>The game is another <em>Castlevania</em> in the action/RPG style of the previous Castlevania: Symphony of the Night and Castlevania: Circle of the Moon. Juste is able to dash at will similar to Alucard, and use subweapons like the axe and holy water. By combining subweapons with magic tomes located throughout the castle he can increase both their power and their properties, such as turning the holy water into a rain that damages every monster onscreen, or turning a Bible into a holy shield that circles him. Juste can equip many kinds of armor and accessories, and he can modify his Vampire Killer whip with different tips that change its elemental property or increase its power. As an optional side quest, Juste can also find furniture and furnishings left around the castle and decorate a room with them, although there is no reward for doing so beyond a nice looking room.</p>"},{"name":"Catwoman","year":2004,"developer":"Magic Pockets SAS","url":"a#C.zip/C%2FCatwoman%20%28UE%29%20%28M7%29.gba","filesize":1,"score":6,"genres":"Action > Isometric > Platform > Licensed","desc":"<p>The Game Boy Advance version of the Catwoman movie license is a straightforward isometric action/ platform game. The player has at his disposal all the key abilities of the cat-lady as seen in the movie, and must traverse levels full of platforms and \"bad guys\", and climbing walls, occasionally.</p><p>The game opens with a tutorial mission and then switches to a series of images resembling comic-strips that explain how Patience Phillips became Catwoman. The player then goes through the 24 levels of the game mostly jumping, climbing and sometimes fighting.</p><p>The look of the graphics aims toward a comic-book feel instead of the more realistic looking 3D of the console and PC versions.</p>"},{"name":"Centipede / Breakout / Warlords","year":2005,"developer":"Gravity-i Ltd","url":"7#Breakout%20%2B%20Centipede%20%2B%20Warlords%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Action > Compilation > Arcade","desc":"<p>A compilation of the classic arcade games Breakout, Centipede, and Warlords brought onto the Game Boy Advance.</p>"},{"name":"Charlie and the Chocolate Factory","year":2005,"developer":"Digital Eclipse Software, Inc.","url":"a#C.zip/C%2FCharlie%20and%20the%20Chocolate%20Factory%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Mini-games > Platform > Puzzle elements > Direct control > Fantasy > Licensed","desc":"<p>Released with the GameCube/PlayStation 2/Xbox version along with its PC counterpart, this video game is based on the film of the same name and was released with that movie on the same day. Unlike the other versions this is a side-scrolling 2D platformer with condensed gameplay to meet the technical standards of the Game Boy Advance.</p><p>Charlie Bucket is a young, humble, chocolate-loving child who lives with a family in poverty. One day, Willy Wonka, the mysterious man who runs his own chocolate factory in Charlie's municipality created a contest; five golden tickets, one in each Wonka chocolate bar, were dispersed randomly around the world. Recipients of each ticket win a one-day tour around Wonka's factory, and one of the five winners will win a prize beyond one's dreams. Will Charlie find one of the tickets? If so, will he be the one lucky winner?</p><p>There are three save slots available. Upon choosing a save slot to use, the player gets taken to the game type menu. He/she may choose <em>Adventure</em>, <em>Mini-Games</em>, or <em>Oompa-Loompa Album</em>. In <em>Adventure</em>, the player gets to complete the games 14 main levels that follows loosely the main movie story line. The player can complete the first level, <em>In Town</em>, and collect 25 square candies that look round throughout each of eight levels to unlock one illustration each in the <em>Oompa-Loompa Album</em>; It has nine illustrations in total. The player can also find all five letters that make up <em>WONKA</em> in each of five levels to unlock one mini-game each; five mini-games are available to unlock. For both the mini-games and photo album, the player initially starts with none to play or look at.</p><p>The player starts with five lives, and has a life bar of five segments, which resemble connected pieces of chocolate. When the player's life bar is low, a full Wonka bar can restore it to full energy. Whenever the player loses all lives in the main game, he/she gets a still <em>Game Over</em> screen before being taken back to the first game menu. If the player wants to proceed through the story after losing all lives, he/she must restart on the same level where the player lost. Each level that gets completed is replayable, and they can help the player fulfill the <em>Mini-Games</em> and the <em>Oompa-Loompa Album</em>.</p>"},{"name":"Charlotte's Web","year":2006,"developer":"Backbone Entertainment, Inc.","url":"a#C.zip/C%2FCharlotte%27s%20Web%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.7,"genres":"Action > Platform > Puzzle elements > Licensed","desc":"<p>Charlotte's Web is based on the new 2006 holiday hit movie released by Nickelodeon Movies, Walden Media, and Paramount Pictures. </p><p>Play as Wilbur, the pig, or Templeton, the rat throughout four settings: Zuckerman Farm, the countryside, a junkyard, and the Country Fair. Throughout the journey, you'll unlock arcade-style mini-games and take on a variety of amusing and complex missions. Collect letters of the alphabet to help Charlotte spell out messages in her web, stash firewood so Mr. Zuckerman can't cook in his smokehouse, release rats imprisoned by the nasty crows, and collect tickets so Fern and Avery can play at the carnival</p><p>Charlotte's Web features a wide range of gameplay elements that include exploration, stealth, and puzzles. Be rewarded with high-quality movie stills and sharp gameplay visuals. </p><p>The Nintendo DS version of the platformer has even more exclusive features including taking on the role of Fern and use the stylus to feed, bathe, or pet Wilbur, as well as a variety of unlockable mini-games, including Wi-Fi and touch screen mini-games.</p>"},{"name":"Cheetah Girls, The","year":2006,"developer":"Gorilla Systems Corporation","url":"a#C.zip/C%2FCheetah%20Girls%2C%20The%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Mini-games > Music / rhythm > Licensed","desc":"<p>Be a STAR like the CHEETAH GIRLS! * Dance and perform as each of the Cheetah Girls * Create you own music tracks * Get an agent and make a press kit.</p>"},{"name":"Chessmaster","year":2002,"developer":"","url":"a#C.zip/C%2FChessmaster%20%28E%29.gba","filesize":1,"score":"","genres":"Strategy > Top-down > Turn-based > Chess","desc":"<p>The Best-Selling Computer Chess Game now available on your favorite console! * Choose from 18 opponents with a range of levels and strategies. * Improve your game with a full tutorial mode. * Learn new strategies from over 150 famous recorded games. * 10 chess sets for both classic and just for fun. * Scalable gameplay for chess players of all levels. * 2-player mode via the Game Boy® Advance Game Link® Cable.</p>"},{"name":"Chicken Shoot","year":2005,"developer":"Vivid Design s.c.","url":"7#Chicken%20Shoot%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Action > 1st-person > Arcade > Shooter","desc":"<p><em>Chicken Shoot</em> is a gallery shooting game based on free 2003 flash game of the same name. The player, controlling Chicken Bill, shoots all the chickens that appear on the 2D hand-drawn screens, shown from a first-person perspective. There are 3 game modes:<em> </em>Arcade*: shoot a specific number of chickens to move on to the next level. There is no time limit and the enemies attack by throwing eggs towards the screen. There is no time limit and when Chicken Bill's 100 points are depleted, the game is over.</p><ul><li><p><em>Classic</em>: the same gameplay as Arcade, requiring a certain number of chickens to be shot, but now with a time limit added. Certain chickens carry time packages, providing time bonuses.</p></li><li><p><em>Multiplayer</em>: score more points than your opponent in a set amount of time.</p></li></ul><p>There are three difficulty levels and support for high scores (not saved after powering off). At the end of each level, statistics are shown based on the shots fired, hits, accuracy, general score, and energy or time remaining. There are different types of weapons (pistol, shotgun, uzi, machine gun, laster, flame thrower and bombs) and a limited amount of ammo. During gameplay, accuracy is shown through a thermometer on the screen. When it rises to the top, all hits are awarded with double points.</p>"},{"name":"Chicken Shoot 2","year":2005,"developer":"Toontraxx","url":"7#Chicken%20Shoot%202%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Action > 1st-person > Arcade > Shooter","desc":"<p>The sequel to the GBA game Chicken Shoot is almost completely identical to the first game. It has the same three game modes, the same weapons and a completely identical concept. The only difference is that this game comes with a set of new levels.</p>"},{"name":"Chop N' Drop","year":2003,"developer":"System 3 Software Ltd."},{"name":"Chronicles of Narnia, The: The Lion, the Witch and the Wardrobe","year":2005,"developer":"Amaze Entertainment, Inc.","url":"a#C.zip/C%2FChronicles%20of%20Narnia%2C%20The%20-%20The%20Lion%2C%20The%20Witch%20and%20the%20Wardrobe%20%28UE%29%20%28M8%29.gba","filesize":1,"score":6.7,"genres":"Action > Isometric > Licensed","desc":"<p>Step through the wardrobe and explore the vast world of Narnia. Play as all four Pevensie children as they set out to find Aslan and avoid the evil White Witch and her powerful minions. Along the way, meet fantastic creatures and help them in order to gain new abilities that will help you in the eventual fight for the future of the ancient lands of Narnia.</p><p>The Game Boy Advance version of The Lion, the Witch, and the Wardrobe is an isometric action/adventure game with a largely linear storyline and the option to play cooperatively with a friend through the game if desired.Players will have the opportunity to play as all of the Pevensie children over the course of the story, and along the way they will unlock new abilities that will prepare them for their ultimate battle against the White Witch for the fate of Narnia.</p>"},{"name":"ChuChu Rocket!","year":2001,"developer":"Sonic Team","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/ChuChu%20Rocket%21%20%28USA%29%20%28En%2CJa%2CFr%2CDe%2CEs%29.zip","filesize":1,"score":8,"genres":"Action > Puzzle > Top-down > Fixed / flip-screen","desc":"<p><em>ChuChu Rocket</em> is an action puzzler, designed predominantly as a multi-player game. You have indirect control over mice, and must guide them to the safety of a rocket, and away from a cat. You do this by placing arrows on the ground, which they will follow. The multi-player game is a frantic all-against-all duel, in which each player's mice will only follow instructions of their own colour. You can play this mode on your own against CPU opponents, or take on a series of predefined puzzles</p>"},{"name":"CIMA: The Enemy","year":2003,"developer":"Neverland Co., Ltd.","url":"a#C.zip/C%2FCIMA%20-%20The%20Enemy%20%28U%29.gba","filesize":1,"score":6.7,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Isometric > Sci-fi / futuristic","desc":"<p>The CIMA aliens feed on humankind's hopes and dreams. They build elaborate mazes and trap people inside them as a way of producing their food. A force called \"Gate Guardians\" was created to protect the population from this menace. Three Guardians were on a train delivering settlers to a distant station, when suddenly a portal for another dimension appeared and transported everyone to a strange moon-like place. The Guardians must find the way home and bring back safely every passenger.</p><p><em>CIMA: The Enemy</em> combines role-playing and strategy elements. Although labeled a RPG, the game lacks several traditional features of the genre: there is no levelling up, nor any form of currency or shops to buy equipment. Instead, the game is focused on the management of a huge party of characters (16 by the end of the game). The main objective is to guide these civilians on mazes, using their unique abilities to overcome obstacles and defeat enemies. Each character has a special trait that can be used to the player's advantage (a medic that concocts health potions, a blacksmith that upgrades armor and weapons, etc).</p><p>Pressing a button brings up a cross with the party portraits at each point and a multicolor cross on the middle. The characters can be individually guided by selecting their portraits or moved in groups by selecting the multicolor cross. Three way-points can be set for easier manoeuvring (almost a necessity, the characters have a tendency to get stuck on corners and walls). </p><p>One crucial gameplay aspect is the amount of trust the party members have on their Guardians. Each character has a gauge that shows the amount of trust they have. This number increases and decreases according to actions within the game. If a character is hurt his/her trust decreases, and a red heart with an arrow pointing downwards appears over his/her head. Likewise, if a character sees a guardian slaying a monster the opposite effect happens, and a green heart with an upwards arrow appears over his/her head. Trust is important because the characters only cooperate with the Guardians when they have the right amount of it.</p><p>When a party character is about to expire, a jewel is displayed besides the main character's health bar, and an alarm sound is played. Death of any party member ends the game instantaneously.</p>"},{"name":"Circle of Blood","year":2002,"developer":"Revolution Software Ltd."},{"name":"Clu Clu Land","year":2003,"developer":"Nintendo R&D1"},{"name":"Codename: Kids Next Door - Operation: S.O.D.A.","year":2004,"developer":"Vicarious Visions, Inc.","url":"a#C.zip/C%2FCodename%20Kids%20Next%20Door%20-%20Operation%20S.O.D.A.%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>With the unanimous passing of the Soda Control Act the drinking age of soda has been raised to 13 years and older. The Kids Next Door have refused to recognize this dastardly attempt to keep their favorite beverage from children everywhere and have taken it upon themselves to run a bootlegging operation providing soda to any kid, worldwide, who wants it with NO QUESTIONS ASKED.</p>"},{"name":"Coin Flipper 1","year":2001,"developer":"Nintendo Co., Ltd."},{"name":"Coin Flipper 2","year":2001,"developer":"Nintendo Co., Ltd."},{"name":"Colin McRae Rally 2.0","year":2002,"developer":"Spellbound Interactive Ltd.","url":"a#C.zip/C%2FColin%20McRae%20Rally%202.0%20%28E%29%20%5BhIR00%5D.gba","filesize":1,"score":7.9,"genres":"Racing / Driving > Simulation > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Colin McRae Rally 2.0</em> on the Game Boy Advance adapts the gameplay of the PC/console title to the handheld's capabilities.</p><p>The game features five licensed cars (Ford Focus, Mitsubishi Lancer, Toyota Corolla, Subaru Impreza, Ford Puma) and tracks in six different countries (Finland, France, Sweden, Australia, Kenya, United Kingdom).</p><p>The game's main rally mode takes the player through a championship, with each of the six countries' rally tracks consisting of six stages each. The game takes the simulation approach, with the player being able to adjust suspension, gearbox, steering, tyres and more to fit driving style and road conditions. Damage acquired during a race must be repaired between stages at the expense of time. Besides driving the full championship, it is also possible to practice single rallies and even single stages - a time trial mode for single stages is also available. Tracks not available to be selected from the beginning must be unlocked by winning the championship first.</p><p>Besides rally mode, the game also offers arcade mode, which features six tracks for conventional circuit racing. The circuits can be driven as time trials, single races or a championship. This mode also supports multiplayer via the link cable, only requiring a single cartridge.</p><p>During racing, the track is displayed via a Mode-7-style scaling/rotating bitmap engine, with the cars rendered as texture-mapped polygons. During rally races, the game features a co-driver calling out road features ahead via digitized speech, which is provided by Colin McRae's actual co-driver Nicky Grist.</p>"},{"name":"Coloris","year":2006,"developer":"Skip, Ltd."},{"name":"Columns Crown","year":2001,"developer":"Wow Entertainment, Inc.","url":"a#C.zip/C%2FColumns%20Crown%20%28E%29.gba","filesize":1,"score":6.9,"genres":"Puzzle > Real-time > Falling block puzzle","desc":"<p>Princess Dazzle, on the verge of becoming the Queen of the land, has entrusted you to find the missing gems from the Columns Crown, the symbol of her sovereignty.</p><p>There are 24 gems to collect in the game. To find them, you must complete certain elements of each of the games modes. These include the basic Survival Mode, where you must remove as many gems from the playing field as possible; Versus Mode has you battling a range of thieves in one-on-one Columns games; and Flash Columns has you attempting to remove the flashing gem from an already packed field of gems in a limited amount of time.</p><p>The aim of the game is simple. In the style of Tetris, the playing field fills up with magic gems, each of varying colour. Match 3 or more of the gems and they will disappear. The more you remove in Survival mode, the higher your end ranking becomes.</p><p>The magic gems themselves can be found by defeating the thieves in VS mode, getting as far as possible in Survival mode (and collecting as high a ranking as possible) or completing Flash Columns mode.</p>"},{"name":"Comix Zone","year":2002,"developer":"Sega Technical Institute","url":"a#C.zip/C%2FComix%20Zone%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler","desc":"<p>Sketch Turner was a starving comic book artist, living with his pet rat Roadkill... that is until a lightning storm mysteriously brought his cartoon villain, Mortus, to life and imprisoned Sketch within the pages of his own comic book. Now trapped in the world that he himself created, but someone else is now drawing, Sketch must battle through the pages of his own comic book, and past his own creations, to a final battle with Mortus. Perhaps one of his own creations, General Alissa Cyan might be able to help...</p><p><em>Comix Zone</em> is a side-scrolling fighting game with a difference, you're inside of a comic book and you yourself know it. Smash enemies into the sides of frames, rip through the paper to unleash a super move and otherwise wreck havoc throughout the limitations of the graphic novel. Sketch himself can jump, attack and use various items that he finds along the comic book, including his rat friend, Roadkill. Button combinations can be used to unleash powerful techniques.</p><p>The game progresses linearly through each page of the comic book, however secret paths and alternate routes through the story can be discovered. At the end of each level, Sketch receives a super hero rating for how well he's progressing.</p>"},{"name":"Construction: Action","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Construction: Melody Box","year":2001,"developer":"Nintendo Co., Ltd."},{"name":"Contra Advance: The Alien Wars EX","year":2002,"developer":"CING, Inc.","url":"7#Contra%20Advance%3B%20The%20Alien%20Wars%20EX%20%28USA%29.gba","filesize":4194304,"score":6.9,"genres":"Action > Side view > Platform > Shooter > Sci-fi / futuristic","desc":"<p>Based on the SNES classic, Contra III: The Alien Wars, your job is to clean out 6 levels filled with aliens and humans who all wish to see you dead, and stopping the Red Falcon from taking over the world.</p><p>Two players can play side by side in each level, upgraded from the original designs in the SNES title, as well as new levels based on those from Contra: Hard Corps (originally released on the Genesis).</p>"},{"name":"Corvette","year":2003,"developer":"Visual Impact","url":"a#C.zip/C%2FCorvette%20%28U%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Real-time > Direct control > Automobile > North America > Licensed","desc":"<p>SEE WHAT HAPPENS WHEN YOU MIX GASOLINE WITH ADRENALINE.<br>* Race in Circuit or Rally Mode<br>* Incredible scenery as you race in 8 different regions of the USA<br>* 14 different Corvette models from '53 to '03 including show cars and prototypes<br>* Win a challenge, get a fancier 'Vette - start with a 1953 and master 'em all<br>* Bonus levels offer a variety of challenges: Max Speed, 0 to 100 to 0 acceleration/braking runs, and a fun \"hit the cones\" obstacle course</p>"},{"name":"Crash & Spyro Superpack","year":2005,"developer":""},{"name":"Crash Bandicoot 2: N-Tranced","year":2003,"developer":"Vicarious Visions, Inc.","url":"a#C.zip/C%2FCrash%20Bandicoot%202%20-%20N-Tranced%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":7.6,"genres":"Action > 3rd-person (Other) > Side view > Isometric > Platform","desc":"<p>After returning the world to normal size in Crash Bandicoot: The Big Adventure, Crash must return to action to save his comrads, abducted by the evil mask Uka Uka and Dr. Nefarious Tropy. In turn, they accidently kidnap the evil Crash Clone, thinking it is Crash himself. So the crazy bandicoot must tackle all three evil beings in order to return his friends to safety.</p><p>Along with the same 2D platforming and 3D style chase sequences from the original GBA release, Crash has a new game to play: Atlasphere. A combination of Marble Madness and Tony Hawk 4 GBA, Atlasphere has you guiding Crash in a ball around flatlands and half pipes, pulling tricks and collecting items from the crates.</p>"},{"name":"Crash Bandicoot Purple: Ripto's Rampage","year":2004,"developer":"Vicarious Visions, Inc."},{"name":"Crash Bandicoot: The Huge Adventure","year":2002,"developer":"Vicarious Visions, Inc."},{"name":"Crash Nitro Kart","year":2003,"developer":"Vicarious Visions, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Crash%20Nitro%20Kart%20%28USA%29.zip","filesize":1,"score":6.5,"genres":"Racing / Driving > Behind view > Direct control > Automobile > Track racing > Fantasy","desc":"<p><em>Crash Nitro Kart</em> is based on the console game of the same name. It features the same characters/teams and story as the console game, and has the same adventure mode as the console game. Tracks have the same names as their console counterparts but have been drastically redesigned to work on the portable screens. The game utilises 2D sprites as opposed to the console game's 3D models, and also lacks the FMVs featured in the console game.</p>"},{"name":"Crash of the Titans","year":2007,"developer":"Amaze Entertainment, Inc.","url":"a#C.zip/C%2FCrash%20of%20the%20Titans%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Arcade","desc":"<p>Neo Cortex is back and has corrupted the Tiki powers of Wumpa Island to create hundreds of strange, titanic monsters! Fortunately, Crash is ready for him and has learned new combat and acrobatic abilities to hijack these large outrageous mutants and use their powers against each other and eventually defeat Neo Cortex's new Doominator Robot.</p><p><em>Crash of the Titans</em> for GBA is an action-sidescroller game. Crash jumps, punches, and smashes his way through six island locations in search of Wumpa Fruit, Tiki Masks, and other collectibles. Along the way, he'll encounter Cortex's titular henchmen, which he'll have to climb on top and hijack to take their combat powers. By jacking the right combination of foes, he'll eventually gain the powers he needs to take on Neo Cortex himself and save Wumpa Island yet again.</p>"},{"name":"Crash SuperPack","year":2005,"developer":""},{"name":"Crazy Frog Racer","year":2005,"developer":"Denaris Entertainment Software","url":"a#C.zip/C%2FCrazy%20Frog%20Racer%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Licensed","desc":"<p>This racing game is based on the Crazy Frog license, a character used in the marketing of a ring tone, originally designed by Erik Wernquist. The GBA version was licensed separately, and only the characters remind of the Crazy Frog world. The typical music and soundbites are not present.</p><p>Only singleplayer is available, and no story at all. The main game modes are Grand Prix, two modes based on checkpoints (alone or against opponents), and Last Man Standing where the last one drops after each lap. Grand Prix consists of three classes based on different speed, with three cups each, and and extra cup. Controls allow for speeding up, braking, using items to hinder your opponents (mines, nails, boxing gloves...), and there is a button to drift through the corners. Record times can be saved on the Battery Backed RAM.</p>"},{"name":"Crazy Taxi: Catch a Ride","year":2003,"developer":"Graphic State Limited","url":"a#C.zip/C%2FCrazy%20Taxi%20-%20Catch%20a%20Ride%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":5.8,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Vehicle simulator","desc":"<p>Crazy Taxi jumps into the handheld world head on, with a semi-3D representation of the original Dreamcast/Arcade version.</p><p>As usual, there are 4 taxi drivers to choose from. The aim is to pick up and drop off passengers before the time runs out, while making as much money as you can during that time. More money can be made by drifting close to oncoming traffic and performing crazy jumps.</p><p>Along with two cities to drive through, there are also 9 crazy box challenges, ranging from the simply pick up and drop off through puzzle environments to the over the top jumping or drifting challenges.</p>"},{"name":"Creatures","year":2002,"developer":"Cyberlife Technology, Ltd.","url":"a#C.zip/C%2FCreatures%20%28E%29%20%28M3%29%20%28Eng-Ita-Spa%29.gba","filesize":1,"score":6.9,"genres":"Simulation > Side view > 2D scrolling > Puzzle elements > Point and select","desc":"<p><em>Creatures</em> is a biological simulation. You start with six eggs of Norns, cute little creatures who live in an imaginary world. Your task is to give them knowledge about the world they live in, teach them how to speak, how to use toys or an elevator, how to eat, and so on. They will eventually grow older, reproduce and die. The game uses its own genetics system, as well as biochemical and neurological calculations to determine the evolution of Norns and the way their DNA would develop in their descendants.</p>"},{"name":"Crouching Tiger Hidden Dragon","year":2003,"developer":"Shanghai UBIsoft Computer Software Co., Ltd.","url":"7#Crouching%20Tiger%2C%20Hidden%20Dragon%20%28USA%29%20%5BEn%2CFr%2CEs%5D.gba","filesize":8388608,"score":5.9,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Martial arts > Licensed","desc":"<p>The GBA version of the game, based on the film of the same name, has been turned into a 2D side-scrolling beat-em-up. You assume the role of the young thief Jen. Contrary to the console counterparts, there is only one character to play with, and you will need to take on familiar faces such as Li Mu Bai, Yu Shu Lien and Dark Cloud Lo.</p><p>The 25 levels are based on locations in the film. Jen carries the sword Green Destiny and she can performs basic attacks on the ground, as well as in the air, or perform more impressive moves such as mid-air double-jumps or flying kicks. She can also climb by pushing off walls. By defeating enemies, a chi meter is filled, which allows to perform special moves. Chi can also be used to cure status ailments such as poison or daze.</p>"},{"name":"Cruis'n Velocity","year":2001,"developer":"Graphic State Limited","url":"a#C.zip/C%2FCruis%27n%20Velocity%20%28U%29.gba","filesize":1,"score":5.4,"genres":"Racing / Driving > Behind view > Arcade > Automobile","desc":"<p>Take control of one of ten high powered vehicles and race through 14 tracks based on different places in the world including Las Vegas, Paris and even Mars! Race to win the Cruis'n Cup or a range of different championships, or race against 3 friends in 4 player mode.</p>"},{"name":"Crushed Baseball","year":2004,"developer":"Griptonite, Inc.","url":"a#C.zip/C%2FCrushed%20Baseball%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Baseball","desc":"<p>Crushed Baseball 2004 will offer completely original fully-interactive ballparks, where a key interactive feature will reward the player with additional “Mojo” abilities if they perform a certain task.  For example, in a stadium with a stained glass window in the centerfield wall, if a player hits a ball that smashes through the window, they will be rewarded with additional “Mojo” abilities.  In the Karate Dojo stadium, decorated in the traditional Japanese style, players can hit the gong to gain more “Mojo” abilities.      The game offers players the ability to set the time of day, weather effects and type of turf they play on.  Players can choose to play a night game in the rain on a dirt surface, a day game in the wind on AstroTurf or real grass and more.  In addition, Crushed Baseball 2004 will be the first baseball game to offer five fully playable female players and 10 original team mascots including a ram, an eagle and a bear. </p>"},{"name":"CT Special Forces","year":2002,"developer":"Light & Shadow Production","url":"7#CT%20Special%20Forces%20%28USA%29%20%5BEn%2CFr%2CDe%2CEs%2CIt%2CNl%5D.gba","filesize":4194304,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Direct control > Contemporary","desc":"<p><strong>CT Special Forces</strong> is a side scrolling platform shooter that has a superficial similarity to the games of the Metal Slug series. The player controls an operative of a counter-terrorist force on a mission around the globe to stop terrorist activity and arrest its leaders. The digital pad moves the character, while the <strong>B</strong> button shoots the weapon and the <strong>A</strong> button makes the character jump. The character can't shoot downwards. The <strong>L</strong> trigger cycles through the inventory (displayed on the top-left corner of the screen) and the <strong>R</strong> trigger throws grenades (when they are available). By selecting an ammunition type, the character uses the corresponding weapon (<strong>gas canisters</strong> for the flamethrower, <strong>machine gun pents</strong> for that weapon, etc). The default rifle has an infinite number of bullets. Other items include a <strong>grappling rope</strong> and a <strong>pair of handcuffs</strong> to arrest surrended enemies. Ammunition and health packs are scattered throughout the levels, as are proximity mines and assorted enemies.</p><p>The regular gameplay is occasionally broke by mini-games and entirely different sections: when the character collides with a reticule placard, the game switches to a first-person shooting gallery where the player has to shoot down a certain number of terrorists and rescue the hostages. When colliding with a <strong>parachute</strong>, two gauges with a red line on the middle appear on the screen. The one on the left measures the position of the falling character and the one on the right measures height. The character must be guided to the right spot, and the shooting button must be pressed when both gauges reach the red bar. Some mission stages change the game to a vertical shooter that recalls Tiger-Heli and similar games, where the player controls a helicopter viewed from the top.</p><p>The game has 4 missions, each with its own theme: snow mountain, desert, jungle and a city. A password system is provided (the password is displayed after the completion of every mission).</p>"},{"name":"CT Special Forces 3: Bioterror","year":2004,"developer":"Light & Shadow Production","url":"7#CT%20Special%20Forces%3B%20Bioterror%20%28EU%29%20%5BEn%2CFr%2CDe%2CEs%2CIt%2CNl%5D.gba","filesize":8388608,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Shooter","desc":"<p><em>CT Special Forces 3: Bioterror</em> is a run and gun game similar to Metal Slug. The player controls an elite commando and must run, jump and shoot his way through 5 stages to eliminate a terrorist threat know as A.L.K.</p><p>This evil terrorist organization has created a new molecule capable of modifying human DNA, reinforcing aggression and strength genes. Using this they have created a new breed of super soldiers.</p>"},{"name":"CT Special Forces: Back in the Trenches","year":2003,"developer":"Light & Shadow Production","url":"7#CT%20Special%20Forces%202%3B%20Back%20in%20the%20Trenches%20%28USA%29%20%5BEn%2CFr%2CDe%2CEs%2CIt%2CNl%5D.gba","filesize":8388608,"score":7,"genres":"Action > 1st-person > Side view > Top-down > Platform > Shooter > Helicopter","desc":"<p><em>CT Special Forces: Back to Hell</em> is the sequel to CT Special Forces and the story picks up right where the last game ended. Having destroyed the terrorist group Network the CT Special Forces are going back to do training missions, but more and more reports about new terror threats keep popping up. Could this be a new terrorist organization, or maybe Network is back for a second round? It's up to the CT Special Forces to stop the treat of terrorism once again!</p><p>The game plays in 5 different game modes. The majority is made up of side scrolling platform action, somewhat similar to the Metal Slug games, where you pick up various weapons, grenades and even a tank to squash the terrorist threat. Every now and then you'll come across a wooden sign with a cross-hair on it. Doing so will change the game into first person view, where you have to shoot terrorists and save hostages. Sometimes you'll find a parachute pack, and you'll have to play a mini game where you have to make two meters align to make a drop successfully with your parachute.</p><p>There are also two kinds of helicopter stages. One is a top down shoot'em up, where you have to bomb land targets and gun down enemy helicopters. The other one is a side scrolling chopper rescue game, where you have to save hostages and bring them to your base, while gunning down enemies across the stage.</p>"},{"name":"Cubix: Robots for Everyone - Clash 'N Bash","year":2002,"developer":"Blitz Games Ltd.","url":"7#Cubix%20Robots%20for%20Everyone%3B%20Clash%20%27N%20Bash%20%28USA%29.gba","filesize":8388608,"score":"","genres":"Action > Beat-'Em-Up > 2D","desc":"<p>Something strange is happening in Bubble Town. Robots are going berserk because of Solex, the stuff that gives all robots their power. You must find each of the broken robots before the evil Dr. K and hits bad 'bots do, especially the scary and powerful Kolossal!</p>"},{"name":"Curious George","year":2006,"developer":"Torus Games Pty. Ltd.","url":"a#C.zip/C%2FCurious%20George%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%2CDa%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > Platform > Licensed","desc":"<p>When a curious monkey with a habit of accidentally causing mischief encounters a man dressed in yellow exploring the jungle, he follows him and stows away on his ship. Now, the monkey, George, is stuck in the city and needs to find his way back home! Help George find Ted, the Man in the Yellow Hat.</p><p><em>Curious George</em> is a platform game based on the movie of the same name. In it, you play as the monkey, George, as he jumps, climbs and swings his way through the jungle, a ship, a city and more. Throughout each level are fireflies, scattered to lead you in the right direction. For every 50 George collects, he earns an extra life. Due to his inquisitive nature, George likes to touch objects. By pressing \"R\", George will interact with any nearby object with an exclamation mark next to it - and usually cause it to break.</p>"},{"name":"Custodian","year":2019,"developer":"Realms"}]