[{"name":"Danny Phantom: The Ultimate Enemy","year":2006,"developer":"Altron Corporation","url":"a#D.zip/D%2FDanny%20Phantom%20-%20The%20Ultimate%20Enemy%20%28E%29%20%28M3%29%20%28Eng-Ger-Spa%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p><em>Danny Phantom: The Ultimate Enemy</em> is a 2D action game based on the <em>Danny Phantom</em> Nickelodeon cartoon series. In the game Danny must face his evil future self to save Amity Park.</p><p>In the game, the player takes control of Danny Phantom and has to fight of ghosts. The player has to switch between regular Danny and his ghost mode. In ghost mode Danny has special abilities like passing through walls and firing projectiles. These abilities take energy witch depletes. This energy can be recharged in regular mode.</p>"},{"name":"Danny Phantom: Urban Jungle","year":2006,"developer":"Altron Corporation","url":"a#D.zip/D%2FDanny%20Phantom%20-%20Urban%20Jungle%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Shooter > Licensed","desc":"<p><em>Danny Phantom: Urban Jungle</em> is a 2D side-scrolling shoot 'em up game based on the <em>Danny Phantom</em> Nickelodeon cartoon series episode \"Urban Jungle\". The game starts with Danny, Sam, and Tucker having a movie night. But after a sudden earthquake the evil Undergrowth appears.</p><p>In the game, the player takes control of Danny Phantom and has to fight of ghosts and bosses. The player has the ability to shoot various types of projectiles at enemies. Shooting cost energy witch depletes. This energy can be recharged by absorbing enemy bullets of the same colors as the players aura.</p>"},{"name":"Daredevil","year":2003,"developer":"Griptonite, Inc.","url":"a#D.zip/D%2FDaredevil%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.gba","filesize":1,"score":5.7,"genres":"Action > Side view > Licensed","desc":"<p>Be the \"Man Without Fear!\", Daredevil along with his trusty bullyclub as he scales New York in his never ending duty to protect and serve. Be Daredevil as he takes on New York's villains and crimelords such as Kingpin, Elektra, Bullseye and Sewer King. An on-screen radar will activate your other 4 super-keen senses as you battle criminals. This game is only for the Game Boy Advance.</p>"},{"name":"Darius R","year":2002,"developer":"Rideon Incorporated","url":"a#D.zip/D%2FDarius%20R%20%28J%29%20%5BhIR%5D.gba","filesize":1,"score":"","genres":"Action > Side view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Darius R</em> is a Japan-only remake of the original Darius for the GBA. It places you in the cockpit of the Silverhawk once again in order to defeat the forces of intergalactic fish threatening the galaxy in standard side-scrolling space shooter fare. </p><p>Standout features include the use of the classic Darius level selection scheme that allows the game to branch in different stages and thus offer a series of different endings depending on what road you take. Unique for this GBA remake is the ability to play each stage individually (once you unlock it in the main campaign) in a level-select mode.</p>"},{"name":"Dark Arena","year":2002,"developer":"Graphic State Limited","url":"a#D.zip/D%2FDark%20Arena%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":6.8,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>You are the leader of the special operations, and it is up to you to find your way out of a very sticky situation - a genetics lab overrun by monsters of every shape and size. Using your advance suit and weapons, you must shoot your way through the lab, destroying the evil creations and saving the lab, and the rest of the world, from total destruction.</p><p>This 1st person shooter combines the many well known elements of previous games in the genre with an all out blast fest. A 4 player multiplayer deathmatch option is also on offer.</p>"},{"name":"Dave Mirra Freestyle BMX 2","year":2001,"developer":"Full Fat Productions Ltd.","url":"a#D.zip/D%2FDave%20Mirra%20Freestyle%20BMX%202%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.6,"genres":"Sports > Diagonal-down > Isometric > Tricks / stunts > Bike / Bicycling > Licensed","desc":"<p><em>Dave Mirra Freestyle BMX 2</em>, the first game in the series on the Game Boy Advance, is an extreme sports game following the Tony Hawk template.</p><p>The game features 12 professional BMX riders to choose from, each with their own statistics in speed, spin, balance, bunnyhop, air, and hangtime. Five different selectable bikes augment these stats further.</p><p>The game's main mode is called \"Proquest\". In each level, a variety of goals and challenges must be met within a time limit, netting experience points. These points can be used to increase the rider's stats and they unlock further levels. Challenges include reaching certain high scores, collecting letters and spray cans, and performing specific tricks. Completing the first levels switches the game to Pro, and later, Hardcore mode, increasing the difficulty of the goals in each stage. </p><p>All of the six levels (shown in isometric perspective) are filled with half and quarter pipes, ramps, bowls, rails and special objects (a truck, a fountain, a row of boxes) to perform tricks on. Tricks are activated through button combinations. Completing several tricks in a row without bailing increases the rush meter - when filled, it allows the performance of signature moves for each rider.</p><p>Two further modes are \"Session\" and \"Freeride\" - they allow practicing unlocked levels either with or without the time limit.</p><p>Two two-player modes utilizing a single GBA (the players take turns) are also available: In \"Full Run\", the two players compete for a high score, in \"Star Collector\" they compete for a best time in finding 10 stars scattered over the levels.</p>"},{"name":"Dave Mirra Freestyle BMX 3","year":2002,"developer":"Full Fat Productions Ltd.","url":"a#D.zip/D%2FDave%20Mirra%20Freestyle%20BMX%203%20%28U%29.gba","filesize":1,"score":7.3,"genres":"Sports > Top-down > Isometric > Tricks / stunts > Bike / Bicycling > Licensed","desc":"<p>The BMX pros come out to play on the GBA in this exclusive version of the two-wheeler series. Choose from the best riders from around the world, or create your own BMX rider, and take them around a collection of tracks in an attempt to become to greatest rider of them all.Challenges range from simply gaining a certain amount of points by making tricks, collecting items hidden around the level or knocking over certain items to trigger events to collecting prize money, which can be spent on improving your players stats as well as buying better bikes and new gear.</p>"},{"name":"David Beckham Soccer","year":2001,"developer":"Yoyo Entertainment Ltd.","url":"a#D.zip/D%2FDavid%20Beckham%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":4.9,"genres":"Sports > Top-down > Football (European) / Soccer > Licensed","desc":"<p>Compete in knockout and European Champions League competitions, or as any of the 200 teams with fully licensed players in a league season. You can also control up to 32 teams in knockout mode, and train with Beckham himself to learn the basics of the game.</p><p>Played from an overhead perspective, all of the options you would expect from a football game are available, from player formations to substitutions and more.</p>"},{"name":"Dead to Rights","year":2004,"developer":"Torus Games Pty. Ltd.","url":"7#Dead%20to%20Rights%20%28USA%29.gba","filesize":8388608,"score":5.7,"genres":"Action > Diagonal-down > Shooter","desc":"<p><em>Dead to Rights</em> is a top-down shooter loosely based on the Dead to Rights console game. Players takes control of Jack Slate, a police officer of Grant City. The plot starts when Jack investigate a reported gun fire incident in a construction site in China town, and finds his father there, murdered. He must then uncover the secret behind his death, all the while evading attempts on his life.</p><p>Jack can use melee attack, as well as various weapon picked up during the game, including the Pistol, Shotgun and Assault Rifle. He can also call Shadow, his K-9 unit to attack enemy. Also, Jack can perform a \"slow motion dive\" that allows him to target and shoot at several targets during a single dive.</p>"},{"name":"Defender","year":2002,"developer":"OutLook Entertainment, Inc.","url":"a#D.zip/D%2FDefender%20%28E%29%20%28M5%29.gba","filesize":1,"score":4.6,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Released in conjunction with a 3D update of the classic arcade game on consoles, the Game Boy Advance version is also an update of the original, but retains its side-scrolling gameplay.</p><p>The cartridge includes several variants of the game. The main mode is called \"XGP\". Its basics are the same as in the original: The player's spaceship flies left or right over a scrolling landscape that wraps around after a few screens. The goal is to destroy all invading aliens before they can capture the humans sitting on the ground. Besides updated graphics with various backgrounds and sprites for the enemies and humans, there are other differences as well: players can select from different ships, all with slightly different weapons and ratings for shields and speed. The XGP mode offers six different levels to complete. It can also be played by two players over the System Link.</p><p>The cartridge also includes \"Classic\" mode, which is a port of the original arcade game. Finally, \"XG\" mode is the same gameplay-wise as Classic, but has been updated with graphics similar to the XGP mode.</p>"},{"name":"Defender of the Crown","year":2002,"developer":"Backyard Fort Interactive","url":"a#D.zip/D%2FDefender%20of%20The%20Crown%20%28E%29.gba","filesize":1,"score":7.3,"genres":"Action > Strategy > 1st-person > Side view > Europe > Historical events > Medieval","desc":"<p><em>Defender of the Crown</em> puts the player in the role of one of four Saxon knights in medieval England, in a time where the land is in turmoil as the King is dead and his crown was stolen. The Saxons and the Normans blame each other and fight for control of England.</p><p>After a short introduction by Robin of Locksley himself, the game starts with a single castle and 10 soldiers at your command. From there, you have to build your army, take control of additional territories and fight and defeat the three Norman lords - and sometimes your Saxon friends as well.</p><p>In addition to the basic 'build your army and conquer your opponents' the game offers several events and options that can be used to fine tune your play style: You may engage in a jousting contest where you have to knock your opponent off his horse, gaining either fame or land, or you can go raid a castle for loot or the hand of a princess, joining your houses and territories.</p>"},{"name":"DemiKids: Dark Version","year":2003,"developer":"Multimedia Intelligence Transfer Co., Ltd.","url":"a#D.zip/D%2FDemiKids%20-%20Dark%20Version%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":6.8,"genres":"Role-playing (RPG) > Isometric > Anime / Manga > Turn-based > Puzzle elements","desc":"<p>Jin and Akira are given the task to seal a rip in time that's tearing the demon world, Valhalla, apart. In order to do this, the two must use their own demons to fight and defeat the creatures that have been let loose, and repair the rift before time itself is destroyed.</p><p><em>DemiKids: Dark Version</em> puts the player in the role of Akira as he travels the land in search of demons to fight and collect. There are 350 creatures in all to recruit, and the only way to collect all of them is by trading with DemiKids Light Version.</p>"},{"name":"DemiKids: Light Version","year":2003,"developer":"Multimedia Intelligence Transfer Co., Ltd.","url":"a#D.zip/D%2FDemiKids%20-%20Light%20Version%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":6.9,"genres":"Role-playing (RPG) > Isometric > Anime / Manga > Turn-based > Puzzle elements","desc":"<p>Jin and Akira are given the task to seal a rip in time that's tearing the demon world, Valhalla, apart. In order to do this, the two must use their own demons to fight and defeat the creatures that have been let loose, and repair the rift before time itself is destroyed.</p><p><em>DemiKids: Light Version</em> has the player take the role of Jin as he travels the land in search of demons to fight and collect. There are 350 creatures in all to recruit, and the only way to collect all of them is by trading with DemiKids Dark Version.</p>"},{"name":"Demon Driver: Time to Burn Rubber!","year":2002,"developer":"Ignition Entertainment Ltd.","url":"a#D.zip/D%2FDemon%20Driver%20-%20Time%20to%20Burn%20Rubber%21%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Racing / Driving > Top-down","desc":"<p>A top-down racing game where you race on tracks in various countries.  As you race, be sure to pick up any power-ups such as money and repairs.  You should also avoid running into things very much as your car will explode if you have too much damage.  If you are smart, you can slow your opponents down a lot by running into them in certain ways, however.</p><p>Play the game in quick race, or tournament mode, or choose to play a friend in link mode.  Race each track and try to set records as you strive for first place in each track and your name in the high scores list.</p><p>If you play in the tournament mode, you can buy upgrades for your car between each race.  This is not an option for the quick race mode.</p>"},{"name":"Denki Blocks!","year":2001,"developer":"Denki Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Denki%20Blocks%21%20%28USA%29%20%28En%2CEs%29.zip","filesize":1,"score":7.6,"genres":"Puzzle > Top-down","desc":"<p><em>Denki Blocks!</em> uses a single, simple digital toy set to provide a collection of 'puzzle games'.</p><p>The game is played by sliding blocks around a board. When blocks of the same colour touch, they stick together to form clumps. Sometimes the player has to join all blocks of the same colour in any way possible. Sometimes specific shapes have to be made.</p>"},{"name":"Densetsu no Stafy","year":2002,"developer":"Tose Co., Ltd.","url":"a#D.zip/D%2FDensetsu%20no%20Sutafi%20%28J%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p><em>Densetsu no Stafy</em> is a tale of a yellow star that fell into the ocean from the home castle in the clouds. With a company of Kyorosuke the clam, he must now make his way all the way back. During his journey he will help out the local seabed community with small and big problems, and finally he will confront with the main villain: Ogura, the dark eel.</p><p>Gameplay is similar to other platformers made by Nintendo, especially to Kirby and Mario series.</p>"},{"name":"Densetsu no Stafy 2","year":2003,"developer":"Tose Co., Ltd.","url":"a#D.zip/D%2FDensetsu%20no%20Sutafi%202%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>Ogura, the villain from Densetsu no Stafy, is furious at his defeat at the hands of Stafi, the starfish prince. After escaping from his prison, he kidnaps the queen, and whisks her away to a far off land. Stafy must travel across the kingdom to rescue his mother and defeat Ogura once again.</p><p><em>Densetsu no Stafy 2</em> is the sequel to the original Game Boy Advance game. As Stafy, you can swim around freely in the water, as well as run, jump and later glide in the air while out of water. You'll receive help from Kyorosuke the Clam, your mentor, as you play. Stafy's goal in each level is to find the treasure chest and grab it. However, access to each chest is usually blocked off until you complete a specific task for a character in the level, such as destroying a particular amount of enemies or finding certain items.</p><p>Once you make your way through all the levels in a world, you'll have to face a boss. It's you versus them - the first to lose five hit points will lose. Each boss can only be hit during a particular time or in a particular area. Once you beat the boss, it's onto the next world for more levels to beat and another boss to conquer.</p>"},{"name":"Densetsu no Stafy 3","year":2004,"developer":"Tose Co., Ltd.","url":"a#D.zip/D%2FDensetsu%20no%20Sutafi%203%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>After defeating Ogura in Densetsu no Stafy 2, Stafy has earned a break. However, Ogura manages to escape once more, causing havoc across the kingdom as he flees. Stafy must track him down, and this time his little sister Stapi is along for the ride as well.</p><p><em>Densetsu no Stafy 3</em> is the third game in the Densetsu no Stafy series, and the first to introduce a new playable character. Players control both Stafy, and his younger pink sister Stapi. While Stafy retains his original moves, Stapi has some tricks of her own, such as a wall jump and crawling through narrow gaps, which allow her to access places that Stafy can't.</p><p>The goal of each level is to reach the bonus roulette at the end of each stage. This is done by performing tasks for characters, as the path to the roulette is initially blocked off. Tasks usually consist of finding an item, destroying enemies, or defeating a boss. Along the way, Stafy and Stapi will learn additional moves which will allow them to access areas that were previously unreachable.</p><p>Players can collect orbs within the level - these both serve as the game's currency and health. Bonus orbs can also be earned by scoring consecutive enemy hits within a time period. Orbs can be used to purchase outfits for Stafy to wear.</p>"},{"name":"Desert Strike Advance","year":2002,"developer":"Electronic Arts, Inc.","url":"7#Desert%20Strike%20Advance%20%28USA%29.gba","filesize":4194304,"score":7.8,"genres":"Action > Diagonal-down > Isometric > Shooter > Helicopter > Contemporary > Middle East > War","desc":"<p>The first game in the Strike series. A year after the Gulf War, a self-styled general named Kilbaba (Muababa in the GBA version) takes over an Arab Emirate and threatens to start World War III against his western enemy, the United States. The whole world holds its breath as the President has chosen you to destroy Kilbaba and his terrorist army before he launches a nuclear attack on the world!</p><p>You must fly a specially designed AH-64A Apache on a series of missions to rescue missing-in-action characters, destroy power plants, blow apart SCUD missiles, etc. to take out the enemy defense while trying to find out Kilbaba's plans.</p><p>The player controls the helicopter from an overhead, isometric perspective. The Apache is equipped with three weapon types: a machine gun and two types of missiles of different strength. During the missions, the player must beware anti-aircraft guns, missile launchers and tanks, outmaneuvering enemy fire or destroying the enemy weaponry. The Apache is destroyed if its fuel runs out, or if the armor (functioning as health) is completely depleted. However, armor can be replenished by bringing back MIA soldiers and prisoners of war back to the landing zone. There are also fuel, ammo and armor pickups available on the field.</p>"},{"name":"Dexter's Laboratory: Chess Challenge","year":2002,"developer":"Virtucraft Studios, Ltd.","url":"a#D.zip/D%2FDexter%27s%20Laboratory%20-%20Chess%20Challenge%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Strategy > Top-down > Turn-based > Board game > Chess","desc":"<p><em>Dexter's Laboratory: Chess Challenge</em> is a game based on the popular cartoon TV show of the same name. This chess game is a game mainly aimed at children who aren't normally interested in chess or board games and would be more easily convinced into learning how to play by playing a video game starring characters from the hit show. </p><p>Players can choose from 4 selectable characters from the cartoon series and there are also 4 different gameplay types to choose from.</p><p><strong>Tournament Mode</strong>  </p><p>In Tournament Mode, the player begins as a character and has to fight the other three characters in a chess match. It's pretty simple to figure out, since it's just normal chess.</p><p><strong>Versus Mode</strong>  </p><p>Versus Mode is a two-player mode which can be played with one GBA, where both players alternate control of the console or it can be played with two GBAs using the Link Cable. Players can choose their character and play chess.</p><p><strong>Quick Play</strong>  </p><p>This plays just like tournament mode except players only face one person. Players choose their own character and play a single game of chess against the computer.</p><p><strong>Puzzle mode</strong>  </p><p>The most complex game mode. The player has to clear the chess board by using his or her wits and different combinations of moves. This is the main part of the game. There are many different levels where the player has to find the correct solution.</p>"},{"name":"Dexter's Laboratory: Deesaster Strikes!","year":2001,"developer":"Virtucraft, Ltd.","url":"a#D.zip/D%2FDexter%27s%20Laboratory%20-%20Deesaster%20Strikes%21%20%28E%29%20%28M5%29.gba","filesize":1,"score":7,"genres":"Action > Diagonal-down > Isometric > Direct control > Licensed","desc":"<p>The Clone-a-Matic is the answer to all of Dexter's problems. With it, he can duplicate himself as many times as he wants, finally giving him enough time to do everything that needs doing. It is also covered in flashing lights, and unlocked. One press of a button later, and more than a hundred miniature Dee-Dees swarm over Dexter's laboratory.</p><p><em>Deesaster Strikes</em> is an isometric platformer. Explore your laboratory, return the miniature clones to the Clone-a-Matic for recombination, and repair the damage caused by your sister. Be careful, though. Your formerly helpful robots are now bent on your destruction, and there are more environmental hazards than you remember.</p>"},{"name":"Dice de Chocobo","year":2002,"developer":"Square Co., Ltd."},{"name":"Dig Dug","year":2004,"developer":"Namco Limited"},{"name":"Digidrive","year":2006,"developer":"Q-Games Ltd."},{"name":"Digimon Racing","year":2004,"developer":"Griptonite, Inc.","url":"a#D.zip/D%2FDigimon%20Racing%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.5,"genres":"Racing / Driving > Behind view > Anime / Manga > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>The Digimon prove themselves to be versatile creatures as they hop in cars and compete against each other in this kart-style racing game.</p><p>The third Digimon game for the Game Boy Advance, Digimon Racing has all the features you'd expect out of a racing game. There's a good variety of colorful and light-hearted tracks (15 in all, including a wide variety of themes such as jungles, deserts, busy city streets, ice tracks, and gravel-covered hills), nearly a dozen Digimon to pick from and unlock, and several gameplay modes ranging from cup races to time trials. A handful of boss races round out the action, and provide a challenge for players.</p><p>The twist to this game comes as the racers collect energy on the track to digivolve into upgraded versions of themselves. Once you've digivolved, you can use additional offensive powers to further hamper your opponents and keep your own Digimon ahead of the others.</p><p>While the single-player game will keep you busy for a while with its many modes and characters, Digimon Racing really shines in the multiplayer arena. Since it includes support for up to four players using the link cable or wireless adapter, the multiplayer experience is the real highlight of the game. </p>"},{"name":"Digimon: Battle Spirit","year":2003,"developer":"Dimps Corporation","url":"7#Digimon%20Battle%20Spirit%20%28USA%29.gba","filesize":4194304,"score":6.2,"genres":"Action > Anime / Manga > Arcade > Fighting > Platform > Sci-fi / futuristic","desc":"<p>In 2001, an unknown digimon (digital monster) appeared. He was immensely powerful and could delete any other digimon by touching him. Very soon he gained control over the entire Digiworld. But some digimons organized a resistance group consisting of seven most venerable members. Now those digital monsters must test their powers in order to finally be able to defeat the unknown evil digimon.</p><p>This is a platform fighting game based on the <em>Digimon</em> manga/animé series. You can fight against computer AI or in two-player mode. There are seven digimons to choose as playable characters; all are popular digimon characters from the original series, each associated with a human tamer. The battles take place on a system of platform. You can freely move around, jump, and perform a variety of melee and long-ranged attacks. Oppoenents can also inflict status ailments on each other. In each location there are random events happening, which influence the performance of the combatants.</p>"},{"name":"Digimon: Battle Spirit 2","year":2003,"developer":"Dimps Corporation","url":"7#Digimon%20Battle%20Spirit%202%20%28USA%29%20%5BEn%2CFr%2CIt%2CDe%2CEs%5D.gba","filesize":4194304,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Persistent > Arcade > Fighting > Platform > Direct control > Sci-fi / futuristic","desc":"<p><em>Digimon: Battle Spirit 2</em> is a fighting game in the Digimon franchise. It is a sequel to Digimon: Battle Spirit.You can battle with the characters from the Digimon Frontier anime series. Developed by Dimps.There are 33 characters in the game, 22 which are playable (in total when counting evolutions) and 11 that are NPCs.You can also collect Tamer Tags upon victories.</p>"},{"name":"Dinotopia: The Timestone Pirates","year":2002,"developer":"RFX Interactive","url":"a#D.zip/D%2FDinotopia%20-%20The%20Timestone%20Pirates%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":"","genres":"Action > Side view > Platform > Fantasy > Licensed","desc":"<p><em>Dinotopia - The Timestone Pirates</em> is 2D platform game in \"Dinotopia\" (portmanteau of \"dinosaur\" and \"utopia\") universe (humans and sentient dinosaurs coexist peacefully). Main hero is Clayton, who must rescue dinosaur's eggs and find Time Stone. He uses Sunstone Prod, (a device similar to a staff with special powers, like lasers or earthquake). Game has 5 levels: Waterfall City, Treetown, Canyon City, Underwater and Diamond Caverns. Clayton fights against pirates and bosses, jumps on platforms, and (later) uses dinosaur Kreekor to ride.</p>"},{"name":"Disney Pixar Cars","year":2006,"developer":"Helixe","url":"a#C.zip/C%2FCars%20%28Europe%29%20%28Es%2CPt%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Diagonal-down > Licensed","desc":"<p><em>Disney•Pixar Cars</em> is a racing game based on the animated movie of the same name. The player takes the role of Lightning McQueen in his quest to win the Piston Cup. </p><p>There are two types of events: eleven regular races and four Piston Cup races. The regular races (involving racing either against the clock or against competition) take place on courses with curves, obstacles (e.g. road blocks and slow cars in the way) and pads which either increase or decrease Lightning's speed when driving over them. The Piston Cup courses are oval, without obstacles, and Lightning can build up a nitro boost by closely driving behind opposing cars. Winning a race unlocks the next event, still images from the movie and additional cars. However, each event has to be won with Lightning before another car can be used.</p><p>The camera moves with the course (for example the perspective is close to top-down when driving north and isometric when driving north-west) and is relatively close to the car. In order to know where to steer, the game shows a direction arrow before turns; optionally the player can also activate a reduced map with the course direction of the next few meters. Two buttons are used to speed up or brake.</p>"},{"name":"Disney Pixar Finding Nemo","year":2003,"developer":"Vicarious Visions, Inc.","url":"a#D.zip/D%2FDisney%27s%20Finding%20Nemo%20%28E%29%20%28M2%29%20%28It-Sp%29.gba","filesize":1,"score":6.7,"genres":"Action > Behind view > Side view > 2D scrolling > Licensed","desc":"<p>The Game Boy Advance version of <em>Finding Nemo</em> adapts the Pixar film as a side-scrolling action game with light puzzle and exploration elements.</p><p>The game's 12 levels follow the plot of the film. Depending on the level, the player either controls clownfish Marlin or his son Nemo. Goals in the levels might include simply finding the exit, finding certain characters or items, reaching a certain point within a time limit, or simple survival, like when Marlin and his friend Dory are chased by Bruce the shark.</p><p>The levels are full of unfriendly sea creatures that shouldn't be touched and environmental hazards like strong currents. Simple puzzle solutions are used to get around some obstacles, like dropping a pearl into on oyster for it to close, pushing a piece of rock on a hole to block a current or flipping switches to open barriers.</p><p>Two levels deviate from the norm and are not side-scrollers. The camera is placed behind Marlin instead, who has to chase the character before him, taking care not to deviate from the path laid out by bubble rings.</p><p>Between levels, players can play a simple game of Concentration/Memory to unlock pictures in the game's gallery. Swimming through bubble rings during the levels gives additional chances in the mini-game.</p>"},{"name":"Disney Pixar Finding Nemo: The Continuing Adventures","year":2004,"developer":"Altron Corporation","url":"a#D.zip/D%2FDisney%27s%20Finding%20Nemo%20-%20The%20Continuing%20Adventures%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > 1st-person > 3rd-person (Other) > Diagonal-down > 2D scrolling > Mini-games > Licensed","desc":"<p>The Tank Gang have managed to escape from the dentist's office! Help Nemo, Dory, Marlin, Bruce, Crush, and Squirt get them to their new homes in the ocean. Revisit all your friends from the Walt Disney Pictures presentation of a Pixar Animation Studios film, Finding Nemo*.</p>"},{"name":"Disney Pixar Monsters, Inc.","year":2001,"developer":"Natsume Co., Ltd.","url":"a#M.zip/M%2FMonsters%20Inc.%20%28E%29%20%28M3%29%20%28En-Du-Sp%29.gba","filesize":1,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>Boo has returned to Monstropolis and it is your job as Sulley to get her back home.  However, to make things difficult, Randal has destroyed her door.</p><p>Avoid Randall and the CDA (Child Detection Agency) as well as other dangers as you try getting Boo home.  This platform scroller will have you trying to find out where you have been as you make your way through multiple doorways, up and down ladders, and more.  Pick up items along the way as you jump and dodge enemies, use your roar attack, push items, sneak, and more.</p><p>The game includes a random map generator so every game is different as you play in three difficulty levels.</p>"},{"name":"Disney Pixar Ratatouille","year":2007,"developer":"Helixe","url":"a#R.zip/R%2FRatatouille%20%28E%29%20%28M2%29%20%28Spa-Ita%29.gba","filesize":1,"score":"","genres":"Action > Side view > Top-down > 2D scrolling > Mini-games > Platform > Puzzle elements > Fantasy > Licensed","desc":"<p>OVER 40 CHALLENGING LEVELS!<br>TEST YOUR SKILLS IN TIMED COOKING CHALLENGES<br>8 EXCITING WORLDS TO EXPLORE!</p>"},{"name":"Disney Sports Basketball","year":2002,"developer":"","url":"a#D.zip/D%2FDisney%20Sports%20-%20Basketball%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Basketball > Licensed","desc":"<p>Get ready for some serious game with high-flying slam-dunks and fast-footed dribbling as your favorite Disney characters take to the court. * 6 exciting game modes * 2-on-2 heated courtside action * Over 25 magic items that add special abilities * Multiplayer mode for up to 4 players * Connect your Disney Sports Basketball GBA game to your Disney Sports Soccer GCN game via the Nintendo GameCube™ - Game Boy® Advance Cable</p>"},{"name":"Disney Sports Football","year":2002,"developer":"","url":"a#D.zip/D%2FDisney%20Sports%20-%20Football%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>Get ready for some serious game with explosive tackles and spectacular touchdowns as Mickey, Goofy and other Disney favorites take to the gridiron. * 3 game modes - Challenge Cup, Exhibition and Practice * Pick-up-and-play controls for players of all ages * Football action combined with Disney fun * Over 14 types of magic, including Speed Stars and Fire Passes</p>"},{"name":"Disney Sports Motocross","year":2003,"developer":"Jupiter Corp.","url":"a#D.zip/D%2FDisney%20Sports%20-%20Motocross%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Sports > Side view > 2D scrolling > Real-time > Motorcycle > Licensed","desc":"<p>Join Mickey and his pals for the most action you will find on two wheels as you rack up points, gather gems and collect cool motorcycle parts. * 6 massive courses * 6 modes to challenge players of all ages * A wide range of outrageous tricks and stunts * Multiplayer mode to race against your friends or exchange items.</p>"},{"name":"Disney Sports Skateboarding","year":2002,"developer":"","url":"a#D.zip/D%2FDisney%20Sports%20-%20Skateboarding%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Isometric > Real-time > Tricks / stunts > Direct control > Skateboarding > Licensed","desc":"<p>Mickey, Goofy, Donald and other Disney favorites turn the heat up on the world of skateboarding. Get ready for some serious action - grind and ollie as you take to the streets, performing radical tricks and wild stunts. * 8 massive levels * Collect skateboards * Outrageous tricks * 4 game modes.</p>"},{"name":"Disney Sports Snowboarding","year":2003,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"a#D.zip/D%2FDisney%20Sports%20-%20Snowboarding%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.3,"genres":"Sports > Video backdrop > Tricks / stunts > Snowboarding / skiing > Licensed","desc":"<p>In <em>Disney Sports Snowboarding</em>, players must take one of six Disney characters down one of five slopes. Characters include Mickey, Minnie, Donald, Goofy, Pete and Chip &amp; Dale, who share a single board.</p><p>The tracks are full-motion video loops of the track going past. The character is super-imposed on top of it and can interact with the track via rails to grind and ramps to launch from and do tricks. There are several different objectives, ranging from races to high-score contests. Characters are steered with the shoulder button and the face buttons and D-pad perform tricks.</p>"},{"name":"Disney Sports Soccer","year":2002,"developer":""},{"name":"Disney's Aladdin","year":2003,"developer":"Capcom Co., Ltd.","url":"a#D.zip/D%2FDisney%27s%20Aladdin%20%28E%29%20%28M4%29.gba","filesize":1,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Disney's Aladdin</em> is based on the 1992 Disney animated film. For the GBA and the SNES editions development was handled by Capcom. Like other versions, the game is a side-scrolling platformer where the player controls Aladdin through locations from the movie like the city of Agrabah, the Cave of Wonders, and Jafar's palace. Some locations not appearing in the film include a trippy, candy-colored world inside the Genie's lamp and an ancient pyramid. Enemies standing in Aladdin's way include the Sultan's guards, animals and various magical creatures. They can be dispatched by jumping on top of them or by throwing apples at them. Besides jumping and throwing, another one of Aladdin's abilities consists of him pulling out a blanket and using it to slow his fall.</p><p>Besides the platform levels, the game also includes magic carpet rides as well as a bonus game played between levels: if Aladdin collects a golden scarab in a level, he can play a wheel of fortune for extra health, lives or continues.</p>"},{"name":"Disney's American Dragon: Jake Long - Rise of the Huntsclan!","year":2006,"developer":"WayForward Technologies, Inc.","url":"a#D.zip/D%2FDisney%27s%20American%20Dragon%20Jake%20Long%20-%20Rise%20of%20the%20Huntsclan%21%20%28UE%29%20%28M5%29%20%5B%21%5D.gba","filesize":1,"score":6.5,"genres":"Action > 3rd-person (Other) > Side view > Arcade > Beat 'em up / brawler > Platform > Fantasy > Martial arts > Licensed","desc":"<p>Jake Long is an average Asian boy from New York, with a secret: he is the American Dragon, and can transform at will into a powerful dragon to protect the magical creatures of America. Leprechauns, Unicorns, Mermaids: all of these creatures (and more) are real, but living in hiding, away from public view. It's up to the American Dragon to protect them from the Huntsclan, a band of evildoers who have hunted dragonkind and magical creatures for generations.</p><p><em>Rise of the Huntsclan!</em> is a side-scrolling beat-em-up starring Jake Long, from the Disney cartoon series. As Jake, players can beat up evil doers such as trolls, imps harpies and other mischievous creatures out to give Jake a hard time. He can also use his skateboard by holding the R Button to travel more quickly. Jake can also build up his \"focus meter\" by collecting blue orbs - when full, he can briefly transform into the American Dragon, and destroy his foes with powerful fire attacks and flaming breath.</p><p>Jake's friends, Fu Dog, Trixie and Spud, and Grampa can also be summoned in for their own special abilities. As well as this, Jake can select an ability to upgrade at the end of each level, such as how long his transformation lasts, how powerful his various attacks are, or his speed.</p>"},{"name":"Disney's Atlantis: The Lost Empire","year":2001,"developer":"3d6 Games, Inc."},{"name":"Disney's Brother Bear","year":2003,"developer":"Vicarious Visions, Inc.","url":"a#D.zip/D%2FDisney%27s%20Brother%20Bear%20%28E%29%20%28M7%29.gba","filesize":1,"score":7,"genres":"Action > Side view > Platform > Puzzle elements","desc":"<p>Follow the story of the popular Disney movie as you control Kenai and Koda, both separately and together, in this action-packed adventure. Discover hidden mini-game activities and bonus items in this graphically rich and varied world based on the locations seen in the movie.</p>"},{"name":"Disney's Cinderella: Magical Dreams","year":2005,"developer":"DC Studios, Inc.","url":"a#D.zip/D%2FDisney%27s%20Cinderella%20-%20Magical%20Dreams%20%28E%29.gba","filesize":1,"score":6,"genres":"Action > Side view > 2D scrolling > Music / rhythm > Platform > Puzzle elements > Licensed","desc":"<p>Relive the magic of Disney's Cinderella in this video game adaption of the movie.  Put yourself in Cinderella's glass slippers as you help her with her chores, dance at the Royal Ball with the Prince and help the Fairy Godmother grant wishes.  You'll even get to battle Lucifer the Cat as Cinderella's two helpful mice, Gus and Jaq!</p><p>Cinderella: Magical Dreams is a non-violent platformer that features different styles of gameplay to keep the game interesting.  Aside from the traditional jumping and item collecting, there is also a dancing game where you must dip, twirl and lift while you keep in the spotlight.  You also play as the Fairy Godmother where you must pop specific spell bubbles to grant Cinderella's wishes.</p><p>As players progress through the game, they are rewarded with assorted clips from the movie that progress the story.  It's also possible to unlock additional stills from the movie by finding hidden items in-game.</p>"},{"name":"Disney's Donald Duck Advance","year":2001,"developer":"Shanghai UBIsoft Computer Software Co., Ltd.","url":"a#D.zip/D%2FDonald%20Duck%20Advance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Donald Duck Advance</em> is the GBA version of <em>Goin' Quackers</em>, released on multiple other systems as a 3D platformer. Like the GBC version, the GBA release is a traditional 2D side-scroller.</p><p>The storyline is the same as in the other versions: Merlock has kidnapped Daisy Duck and Donald tries to rescue her with the help of Gyro Gearloose's teleporter. Donald must move through four environments, each consisting of shorter levels: Duckie Mountain, Duckburg, Magica De Spell's manor and Merlock's temple. The goal in most levels is to collect three energy spheres, which will make the level exit open up. To get to them, Donald must take out or evade many enemies, jump over dangerous gaps and brave other hazards. To do so, he can attack, jump on top of enemies and even double jump. He can also start running, a skill used to jump farther or to survive in one of the chase levels. One level in each of the four worlds differs from the norm in that Donald either has to flee from an enemy or try to catch something. Each level features several setback points for restarting upon loss of a life. The levels include a lot of stars that Donald can collect. Collecting 100 awards a life and collecting all stars in all levels unlocks a secret bonus. Progress in the game is stored via passwords.</p>"},{"name":"Disney's Extreme Skate Adventure","year":2003,"developer":"Vicarious Visions, Inc.","url":"a#D.zip/D%2FDisney%27s%20Extreme%20Skate%20Adventure%20%28E%29%20%28M2%29.gba","filesize":1,"score":7.2,"genres":"Action > Sports > Isometric > Skateboarding > Licensed","desc":"<p>The portable version of the game Disney's Extreme Skate Adventure. The Game Boy Advance version moves to an isometric viewpoint, using the engine of the portable Tony Hawk's Pro Skater 4.</p><p>Three worlds are included: Toy Story, Tarzan, and The Lion King, each with two levels and a boss fight. In the story mode, each level has 3 runs, each one unlocking more of the level. Characters are scattered around the level, and will give missions, for example making a difficult jump, or collecting items within a time limit. There are also time challenge (most points inside a time limit), trick challenge (match tricks), and turbo challenge (match kinds of tricks fast) modes for each level, along with a tutorial and versus mode. In versus mode, two players take turns (hot-seat) getting the best trick possible.</p>"},{"name":"Disney's Herbie: Fully Loaded","year":2005,"developer":"Climax Group Limited","url":"a#D.zip/D%2FDisney%27s%20Herbie%20-%20Fully%20Loaded%20%28E%29%20%28M3%29.gba","filesize":1,"score":5.6,"genres":"Racing / Driving > 3rd-person (Other) > Licensed","desc":"<p>In this racing game, based on the movie of the same name, the player controls Herbie, the thinking Volkswagen Bug, through several races. Included is a story mode, featuring scenes from the film before each race, a free race mode, where unlocked tracks can be replayed on different difficulty levels, and an unlockable championship mode, which goes through all races in order.</p><p>In a race, Herbie will compete against several opponents. There are powerups scattered around the track, which can make Herbie go faster, jump, and shoot a tire. Herbie likes to win, so if he's doing well, he'll go faster, but if he just got hit or is last place, he'll be sad and drive slower. His current mood is noted on the screen.</p>"},{"name":"Disney's Home on the Range","year":2004,"developer":"Artificial Mind & Movement","url":"a#D.zip/D%2FDisney%27s%20Home%20on%20the%20Range%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>Following the story in the movie, <em>Home on the Range</em> takes you on the barnyard adventures from Disney. Take on the roles of various animals from the movie as you work to stop the bad guys.</p><p>Jump and attack as you collect items and follow the story through this game. Use jumping beans to jump higher, hit checkpoints to save your progress, break barrels to see what is inside... do whatever you need to in order to get through each level.</p><p>Between the levels, the story unfolds as you see conversations between the animals.</p>"},{"name":"Disney's Kim Possible: Revenge of Monkey Fist","year":2002,"developer":"Digital Eclipse Software, Inc.","url":"a#D.zip/D%2FDisney%27s%20Kim%20Possible%20-%20Revenge%20of%20Monkey%20Fist%20%28E%29%20%28M4%29%20%5BhIR%5D.gba","filesize":1,"score":6.4,"genres":"Action > Side view > Arcade > Platform > Spy / espionage > Licensed","desc":"<p>Kim Possible's buddy Ron Stoppable has been kidnapped by the evil ninja master, Monkey Fist!  Help Kim battle her way through familiar foes such as Dr. Drakken, Shego, and of course, Monkey Fist, as you travel across the globe and search far and wide for Ron.</p><p>Revenge of Monkey Fist is a sidescrolling platformer where players take control of Kim Possible.  Kim has an assortment of punches, kicks and acrobatic moves that she can use to dispatch enemies.  She's not short of high-tech gadgets, either: she can use laser lipstick, compact case bombs, invincibility watches, to name a few.  Kim's buddy Wade can also contact her from time to time to provide Kim with useful tips and hints.</p><p>As you progress through the game, you can unlock pictures by collecting gems which are scattered throughout the levels.  You can also unlock short clips from the show as you make your way through the game's eight stages.</p>"},{"name":"Disney's Lilo & Stitch","year":2002,"developer":"Digital Eclipse Software, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Lilo%20%26%20Stitch%20%28USA%29.zip","filesize":1,"score":6.7,"genres":"Action > Side view > Platform > Puzzle elements > Shooter > Stealth > Sci-fi / futuristic > Licensed","desc":"<p>Set after the events of the 2002 movie, Disney's Lilo &amp; Stitch lets players take control of the two lead characters in a variety of action adventure, shooter, and puzzle style levels.</p><p>Hawaiian life is going well for the newly Earth-adjusted Stitch until a group of aliens, led by Dr. Pestus, kidnap Lilo and take her to their home planet.  Stitch resolves to save her, and gameplay shifts between the events of both Lilo and Stitch throughout eight levels.</p><p>Stitch's levels are all shooter intensive, similar to games like Metal Slug for the side-scrolling levels, and Gyruss for the shooter levels.  In the side scrolling levels, Stitch blasts everything in his path with his laser pistols and pineapple bombs, until he is eventually able to  find a spaceship and continuing his rescue mission to the Junkyard Planet.  </p><p>Lilo's levels are set in an Out of the World or Flashback style, where Lilo must use stealth, solve puzzles, and use Scrump, her doll, to evade and confuse her alien captors.</p><p>Once Lilo and Stitch find each other, they must escape via an alien tank to stop Dr. Pestus and escape back to Earth.</p><p>Along the way, players can collect stills and small video clips featuring scenes from the movie.  The game uses a password save to continue where players left off.</p>"},{"name":"Disney's Lilo & Stitch 2: Hamsterviel Havoc","year":2004,"developer":"Firemint Pty Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Lilo%20%26%20Stitch%202%20-%20Haemsterviel%20Havoc%20%28USA%29.zip","filesize":1,"score":6.7,"genres":"Action > Puzzle > Racing / Driving > Platform > Shooter > Direct control > Contemporary > Sci-fi / futuristic > Licensed","desc":"<p><em>Disney’s Lilo &amp; Stitch 2: Hämsterviel Havoc</em> is a platform shooter and strategy game with some kart-racing levels that is based on <em>Lilo &amp; Stitch: The Series</em>, a TV show that follows the 2002 Disney film <em>Lilo &amp; Stitch</em>. <em>Hämsterviel Havoc</em> is a sequel to the original film's 2002 Game Boy Advance tie-in game. The game allows the player to play as Hawaiian girl Lilo Pelekai and alien experiment Stitch as well as other characters from the show. The plot revolves around the title characters rescuing Jumba Jookiba's experiments (also known as Stitch's \"cousins\") from Dr. Jacques von Hämsterviel, and eventually defeat Hämsterviel himself.</p><p>You play action parts of the game as Stitch. These parts resemble a <em>Metal Slug</em>-style shooter, with double jumps and 8-directional shooting. The strategy/puzzle parts of the game are played by Lilo. These involve using other experiments to help you make your way through the level. The experiments are other characters from the show that have special abilities such as moving through electrical wires. The experiments can also be utilized by Stitch in later levels to fight enemies.</p>"},{"name":"Disney's Little Einsteins","year":2006,"developer":"InLight Entertainment Inc.","url":"a#D.zip/D%2FDisney%27s%20Little%20Einstein%20%28U%29.gba","filesize":1,"score":"","genres":"Educational > 1st-person > 3rd-person (Other) > Graphics / art > Music > Licensed","desc":"<p>Inspired by the Playhouse Disney (later Disney Junior) cartoon of the same name, \"Disney's Little Einsteins\" puts you (or your child, which the game clearly was designed for) in control of the titular characters and their transportation, Rocket.</p><p>The game has 7 missions of 3 sections each, and each mission, like the missions in the actual show, is set to a piece of classical music and features a famous work of art. At the start of each mission, you'll have to give Rocket enough power to blast off by tapping the action button to the beat of the music. After that, there are six ways to play - one section has you in control of Rocket as you steer him through an obstacle course, and another asks you to listen to the music for what you need to find. There are also two difficulties - Easy and Hard - which affect not only the buttons you need to press in certain situations, but also require you to do a little extra work to fulfill your objective.</p>"},{"name":"Disney's Magical Quest 3 starring Mickey & Donald","year":2003,"developer":"Capcom Co., Ltd.","url":"a#D.zip/D%2FDisney%27s%20Magical%20Quest%203%20Starring%20Mickey%20%26%20Donald%20%28E%29%20%28M3%29.gba","filesize":1,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Huey, Dewy and Louie went to hide in the attic to hide from their uncle Donald's temper when they came across a mysterious book.  Upon opening it, hand appears and kidnaps the boys into Storybook Land.  Now Donald Duck and his pal Mickey Mouse must go save the boys by defeating the evil King Pete!</p><p>This game is for one to two players. You can choose to play as either Mickey Mouse or Donald Duck.  Options also include difficulty settings.</p><p>The gameplay starts off much the way previous Magical Quest games have in that you jump on your enemies, spin them around, collect coins, etc.  Later both Mickey and Donald will be given costumes that will give them special abilities.  You will first receive a set of armor.  While Mickey receive a full knight's armor which includes a lance with a giant boxing glove at the end and a shield. Donald, however, gets a barrel and a hammer because his butt's too big for the armor. Both costumes has its pros and cons - for example, Donald's weapon can only be aimed forward while Mickey's can be aimed up/down/forward.  But, in water Mickey's armor will drag him down and sink while Donald's can float.  If playing with two players, these attributes can be used together so, for example, Mickey can take a ride on Donald's back across the water. </p><p>In each stage, there are various hidden doors which will give you access to Bonus Games, shops and areas with coins and treasures. In a Bonus Game,  you will pick one of our three cards and unless you get the card with King Pete's picture, you will receive some sort of prize.  In the shops, you can purchase upgrades for your costumes, lives and hearts for your health meter.</p>"},{"name":"Disney's Magical Quest Starring Mickey & Minnie","year":2002,"developer":"Capcom Production Studio 3","url":"a#D.zip/D%2FDisney%27s%20Magical%20Quest%202%20Starring%20Mickey%20and%20Minnie%20%28U%29.gba","filesize":1,"score":6.6,"genres":"Action > Side view > Platform > Puzzle elements > Licensed","desc":"<p>Pluto has been dognapped by the evil Emperor Pete, and its up to Mickey to save him. Mickey must find his way through six levels, split into sub-levels and boss battles, to get Pluto back. </p><p>Along the way, he can throw blocks and items at enemies or jump on their heads, and later on he can also make use of costumes. The wizard robe allows Mickey to shoot magic bolts; the fireman costume allows Mickey to use the fire hose to push blocks into enemies and out of the way; and the commando uniform allows Mickey to climb around levels using a hook.</p>"},{"name":"Disney's Party","year":2003,"developer":"Jupiter Corp.","url":"a#D.zip/D%2FDisney%27s%20Party%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Side view > Isometric > Board game > Platform > Licensed","desc":"<p>A new theme park is about to be opened by Uncle Scrooge, until Dr. Nickel arrives on the scene, taking over the power systems and scattering magic power all over the park. In order for the park to be opened, it's up to Mickey, Minnie, Donald and Daisy to find the magical power and return the park back to the way it was.</p><p>In order to do this, the gang must move along the game board and complete various challenges. Game length can be set between one and four days (i.e. boards to complete). Players take turns to roll the dice and move their character. Landing on blue spaces adds magical power, while red spaces remove it. Green spaces are special and might contain one-time use items (like double dice or six- or twelve-space move cards), allow one to warp to another space, roll again, force skipping a turn, turn blue into red spaces, et cetera. One particular park attraction is always the current goal. The player who reaches it first is awarded magical power, a crystal and must then complete a side-scrolling platform challenge, beating or avoiding enemies and collecting stars, all while looking for the exit before time runs out. Completing an attraction awards the player with more magical power (depending on the number of stars collected) and possibly a pet. Pets can also be bought in store spaces by trading in crystals. Pets increase magical power, and each pet has a unique power that can be used by its owner, like increasing movement rate. </p><p>A board is completed after 12 turns. The player that collected the most power is declared the day's winner. When all boards in the game are done, a boss battle follows. If more than one players play, the one with the most collected power overall fights the boss.</p><p>There are four different boards, each with their own theme. Up to four players can play the main game using one GBA, or play with four linked handhelds to challenge each other in a set of unlockable mini-games. The side-scrolling attraction levels can also be unlocked for play from the main menu.</p>"},{"name":"Disney's Peter Pan: Return to Never Land","year":2002,"developer":"Crawfish Interactive Ltd.","url":"a#D.zip/D%2FDisney%27s%20Peter%20Pan%20-%20Return%20to%20Neverland%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The 2002 animation film sequel of the original Disney movie of 1953 and this game just have the title in common. Unlike the movie, playing as Peter Pan it is not your task to entertain Wendy's daughter Jane but to rescue Tinkerbell, who has been captured by - what a surprise - the evil Captain Hook. Without her Peter has no ability to fly unless he grabs pixie dust.</p><p><em>Disney's Peter Pan: Return to Never Land</em> exclusively for Game Boy Advance is a side-scrolling platformer, consists of 17 levels, features password saves, and is geared towards younger consumers.</p>"},{"name":"Disney's Tarzan: Return to the Jungle","year":2002,"developer":"Digital Eclipse Software, Inc.","url":"a#D.zip/D%2FDisney%27s%20Tarzan%20-%20Return%20to%20the%20Jungle%20%28UE%29%20%5B%21%5D.gba","filesize":1,"score":7.2,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Disney's Tarzan: Return to the Jungle finds Tarzan on quests that vary from locating the Fountain of Youth to discovering The Lost Valley of the Dinosaurs. Besides being able to swing from vines, swim through treacherous waters and engage in tree-surfing action, Tarzan will now be able to wield his trusty boomerang, mighty spear and famous animal call to protect his friends and jungle home. Along the way, Tarzan's friends, Jane, Terk and Professor Porter will join him on his jungle adventures. Disney's Tarzan: Return to the Jungle is being developed by Digital Eclipse, the developer responsible for the Game Boy Color original.</p>"},{"name":"Disney's The Lion King","year":2003,"developer":"Vicarious Visions, Inc.","url":"a#D.zip/D%2FDisney%27s%20The%20Lion%20King%20%28E%29%20%28M8%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Licensed","desc":"<p>Timon and Pumbaa are back for an all new adventure that takes place during the original The Lion King movie, although from the point of view of the two animal goons.</p><p>Choose either character, or play a team game with another player, to complete the various levels based on events from the original movie, with various challenges to complete.</p><p>The game also features film clips from the Disney movie of the same name, which ties in the adventures of Timon and Pumbaa with the original story of Simba and his quest to regain the kingdom of Pride Rock from Scar.</p>"},{"name":"Disney's Treasure Planet","year":2002,"developer":"Bizarre Creations, Ltd.","url":"a#D.zip/D%2FDisney%27s%20Treasure%20Planet%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > Puzzle elements > Steampunk > Licensed","desc":"<p><em>Disney's Treasure Planet</em> is a 2D action-adventure game for the Game Boy Advance played from a bird-eye perspective that is based on the 2002 movie of the same name. The game follows Jim Hawkins and his search for the legendary treasure of pirate captain Flint.</p><p>In the game, the player takes control of Jim and has to navigate him through the different levels. The player has the ability to jump and fight of hostile robots and monsters. Sometimes crates or other objects have to be moved to reaches certain places or items. Items include keys to unlock doors and dynamite to blow up rocks. In some sections of the game the player has to navigate Jim on his solar surf plank and avoid obstacles. The player can also collect coins, 100 coins earns an extra live.</p><p>For the PlayStation and PlayStation 2, a different and fully 3D game was released.</p>"},{"name":"Ditto Leapfrog","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Diving Corsola","year":2001,"developer":"Nintendo Co., Ltd."},{"name":"DK: King of Swing","year":2005,"developer":"Paon Corporation, Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/DK%20-%20King%20of%20Swing%20%28USA%29.zip","filesize":1,"score":7,"genres":"Action > Strategy > Side view > 2D scrolling > Platform","desc":"<p>Cranky is hosting the Jungle Jam contest. Before the contest can begin, King K. Rool steals the medallions. It's up to Donkey Kong to retrieve the medals. Players use the L and R Buttons to move left and right and to rotate counter-clockwise and clockwise on pegs. Most of the action takes place on these pegs. DK attacks by either charging up by holding on to two pegs at once or throwing things such as rocks or bombs.</p>"},{"name":"Dogz","year":2006,"developer":"MTO Co., Ltd.","url":"a#D.zip/D%2FDogz%20%28E%29%20%28M4%29.gba","filesize":1,"score":5.8,"genres":"Simulation > 1st-person","desc":"<p><em>Dogz</em> along with Catz, is the first installment of the Petz series in the DS. The player starts off by choosing a dog from a large selection of 18 different breeds that come in many colors. The dog can be taken out for walks, entered in competitions, and can even be thrown parties with all the other dogs in the neighborhood that you meet on your daily stroll. Taking good care of the dog does come with its rewards. The player will receive gifts and presents to decorate his or her room, as well as toys and things to buy at the pet store for the new puppy.</p><p>In the DS version the controls are slightly different. With the voice recognition feature, the player can call the dog to come to the avatar, as well as teaching it new tricks and commands. With the touch screen feature, the player can write in a diary about his or her day with the puppy. Lastly, with the networking feature, the player can share puppy mini-games with friends. All this and more.</p>"},{"name":"Dogz 2","year":2007,"developer":"MTO Co., Ltd.","url":"a#D.zip/D%2FDogz%202%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Simulation > Diagonal-down > Side view > Anime / Manga > Life / social simulation > Mini-games","desc":"<p><em>Dogz 2</em> is an expanded version of the original Game Boy Advance Dogz game. Although it features the same story and artwork, the gameplay has been updated with more options. There are six new dog breeds compared to the original game, two new tricks to teach your dog, and three new minigames.</p>"},{"name":"Dokapon: Monster Hunter","year":2001,"developer":"Tycoon Corporation","url":"a#D.zip/D%2FDokapon%20Monster%20Hunter%20%28E%29.gba","filesize":1,"score":7.1,"genres":"Role-playing (RPG) > Diagonal-down > Side view > 2D scrolling > Turn-based > Direct control > Menu structures > Fantasy","desc":"<p>Get money by completing jobs as an adventurer. By completing jobs, you get money to buy weaponry, items and traps. Use the traps to capture monsters, which can then be your partners in battle. </p><p>Eight levels with maps that randomize and over 150 monsters keep gameplay fresh.</p>"},{"name":"Domokun no Fushigi Terebi","year":2002,"developer":"SUZAK Inc.","url":"a#D.zip/D%2FDomo-kun%20no%20Fushigi%20Terebi%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Side view > Licensed","desc":"<p>A meteorite destroys Usaji's television satellite, causing Domo-kun to become frustrated at their now non-functional TV.  After hitting it several times, Domo-kun is sucked into the television and finds himself in a variety of programming.</p><p>Domo-kun is the mascot for NHK (one of Japan's major broadcasting companies). In his first Game Boy Advance title, Domo must pass various mini-games in order to return to the world outside of the television. Games include (among others) hatching birds in a nature show, successfully hitting home runs in the baseball broadcast and getting the beat right in a rhythm action game.</p>"},{"name":"Donkey Kong","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Donkey Kong 3","year":2003,"developer":"Nintendo Co., Ltd."},{"name":"Donkey Kong Country","year":2003,"developer":"Rare Limited","url":"a#D.zip/D%2FDonkey%20Kong%20Country%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":8.1,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>King K. Rool has stolen Donkey Kong's banana stash, and Donkey Kong needs your help to get them back. In search of K. Rool, the Kremling horde impedes your progress. Kremlings, crocodile-like creatures, include Kritters (they succumb to a simple jump on the head), Krushas (they are virtually indestructible), and others. There are also other enemies that block your path, such as beavers, snakes, vultures. Leading them are dastardly bosses, including Very Gnawty, Necky, Queen B., and Dumb Drum, and they all bar the way with their own special blend of villainy.</p><p>Donkey Kong is joined by Diddy Kong: these two primates differ significantly. For example, Donkey Kong is generally stronger; he can destroy most enemies with a single jump and can lift barrels straight over his head to throw them farther. On the other hand, Diddy is faster and not as strong as Donkey; he can run really fast and do cartwheels. Diddy carries barrels in front of him, creating a shield against frontal attacks.</p><p>The game is split into different worlds, which are split into different levels. Each level contains bonus areas, where one can collect bananas, medallions, and lives. At the end of each world is a boss, which is usually a larger version of a minor enemy.</p><p>The original Super Nintendo game was later released for Nintendo's handheld systems. The Game Boy Color version has an exclusive level (Necky Nutmare) and additional bonus games, Funky's Fishing and five Crosshair Cranky minigames. There was also the addition of collectible DK sticker packs scattered throughout the levels. These sticker packs could be printed out using the Game Boy Printer. The game also has two more difficulty options that become available after beating the game.Beating the game once lets the player turn off DK barrels and beating the game a second time will let the player turn off checkpoint barrels.</p><p>The Game Boy Advance version also had additional bonus games. It to has a version of Funky's Fishing but instead of the crosshair themed games, there is now Candy's Dance Studio, which hosts six dance games. There is also the additions of a time attack mode called DK Attack, a harder difficulty mode called Hero Mode (can only play as Diddy Kong and the game no longer offers Donkey Kong barrels and checkpoints throughout the levels), and the sticker book idea from the Gameboy Color version was replaced with collecting scrapbook pictures instead.</p>"},{"name":"Donkey Kong Country 2: Diddy's Kong Quest","year":2004,"developer":"Rare Limited","url":"a#D.zip/D%2FDonkey%20Kong%20Country%202%20%28E%29%20%28M5%29.gba","filesize":1,"score":8.2,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>Donkey Kong has been \"kongnapped\" by the nasty K. Rool and the Kremlings, and it is up to Diddy Kong and his girlfriend Dixie Kong to save him.</p><p>All the familiar enemies and helpful friends return, along with some new characters, including the wise Wrinkly Kong who will teach you some important lessons in gameplay. Again the emphasis is on banana collecting, whereas every one hundred bananas make one extra life. Apart from beating K. Rool and rescuing Donkey Kong, there are extra missions that can be completed. Collect enough K. Rool Kremkoins to open up the routes to the Lost World, while every level has a hidden Hero Coin to collect.</p><p>The Game Boy Advance version also includes a bonus game mode with three minigames (Expresso's Racing, Funky's Flights, and Bag a Bug) plus a time attack mode called Diddy's Dash (complete levels as fast as possible as Diddy Kong). This version of the game also includes an additional boss (Kerozene) and two more collectibles (Golden Feathers that increase Expresso's stats in the Expresso's Racing bonus game and photographs that fill out a scrapbook). Due to the addition of the bonus games and the scrapbook 28 more  Hero Coins were also added.</p>"},{"name":"Donkey Kong Country 3: Dixie Kong's Double Trouble!","year":2005,"developer":"Rare Limited","url":"a#D.zip/D%2FDonkey%20Kong%20Country%203%20%28E%29%20%28M5%29.gba","filesize":1,"score":8,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>This time both Donkey Kong and Diddy Kong have been kong-napped by a mysterious new leader of the Kremlings, and it's up to Dixie and new team mate Kiddy Kong to save the day.</p><p>New elements to the series includes the Brother Bears, thirteen Bears who, if you pay them with Bear Coins found in each level, will aid you in your quest by building certain items. Also, new bonus mission have you playing a 1st/3rd person shooter style party game. Plus a host of new enemies, the usual huge end of world bosses and a collection of the Kong family who will help you out as best they can.</p><p>The Game Boy Advance version adds a new world Pacifica, which is made up of six stages and a boss level. Also, a new boss called Kroctopuss and a new Brothers Bear named Bachelor has also been added. Swanky's sideshow.got turned into a virtual reality mini-game and Funky Kong also offers his own mini-games to play. Also, five more Banana Birds have been added to the game, increasing the total to 20.</p>"},{"name":"Donkey Kong Junior","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Doom","year":2001,"developer":"id Software, Inc.","url":"7#Doom%20%28Europe%29%20%5BEng%5D.gba","filesize":8388608,"score":7.5,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Horror","desc":"<p>The Union Aerospace Corporation has been experimenting with teleportation technology on Mars' moons Phobos and Deimos. After early successes, something goes wrong. It seems the scientists have opened a gateway straight to Hell. Phobos base is overrun with demonic creatures, and the whole of Deimos simply vanishes. A squad of marines is sent to Phobos, but all except one are quickly slaughtered. It falls to the surviving marine to grab some guns and strike back at the demons.</p><p>id Software's follow-up to their genre-defining Wolfenstein 3D, <em>Doom</em> is another first-person 3D shooter: full-on action as seen from the space marine's perspective. Like Wolfenstein, the game consists of distinct episodes, playable in any order. The first episode, <em>Knee-Deep in the Dead</em>, takes place in the Phobos base and is freely available as shareware. The full game continues on Deimos in <em>The Shores of Hell</em> and culminates in <em>Inferno</em>, the final episode which takes place in Hell itself (the Sega 32x version lacks this episode).</p><p>The basic objective in each level is simply to reach the exit. Since dozens of enemies stand in the way, the only way to get there is by killing them. Switches and buttons must be pressed to advance at certain points and often color-coded locked doors will block the way - matching keycards or skull keys must be found to pass.</p><p>The game's engine technology is more advanced than Wolfenstein's, and thus the levels are more varied and complex. The engine simulates different heights (stairs and lifts appear frequently) and different lighting conditions (some rooms are pitch black, others only barely illuminated). There are outdoor areas, pools of radioactive waste that hurt the player, ceilings that come down and crush him, and unlike Wolfenstein's orthogonally aligned corridors, the walls in <em>Doom</em> can be in any angle to each other. An automap helps in navigating the levels.</p><p>Stylistically, the levels begin with a futuristic theme in the military base on Phobos and gradually change to a hellish environment, complete with satanic symbols (pentagrams, upside-down-crosses, and portraits of horned demons), hung-up mutilated corpses, and the distorted faces of the damned.</p><p><em>Doom</em> features a large weapon arsenal, with most weapons having both advantages and drawbacks. The starting weapons are the fists and a simple pistol. Also available are a shotgun (high damage, slow reload, not good at distances), a chaingun (high firing rate, but slightly inaccurate in longer bursts), and a plasma rifle (combining a high firing rate and large damage). The rocket launcher also deals out lots of damage, but the explosion causes blast damage and must be used with care in confined areas or it might prove deadly to the player as well as the enemies. Two further weapons in the game are the chainsaw for close-quarter carnage, and the BFG9000 energy gun, which while taking some practice to fire correctly, can destroy most enemies in a single burst. The different weapons use four different ammunition types (bullets, shells, rockets, and energy cells), so collecting the right type for a certain gun is important.</p><p>The game drops some of Wolfenstein's arcade-inspired aspects, so there are no extra lives or treasures to be collected for points, but many other power-ups are still available. Medpacks heal damage while armor protects from receiving it in the first place. Backpacks allow more ammunition to be carried, a computer map reveals the whole layout of the level on the automap (including any secret areas), light amplification visors illuminate dark areas and radiation suits allow travel over waste without taking damage. Also available are berserk packs (which radically increase the damage inflicted by the fists) as well as short-time invisibility and invulnerability power-ups.</p><p>The enemies to be destroyed include former humans corrupted during the invasion, plus demons in all shapes and sizes: fireball-throwing imps, floating skulls, pink-skinned demons with powerful bite attacks, and large one-eyed flying monstrosities called Cacodemons. Each episode ends with a boss battle against one or two, particularly powerful creatures.</p><p><em>Doom</em> popularized multiplayer in the genre with two different modes: Cooperative allows players to move through the single-player game together, while Deathmatch is a competitive game type where players blast at each other to collect 'frag' points for a kill and re-spawn in a random location after being killed.</p><p>The 3DO and Sega32x ports lack any multiplayer modes, though the other ports retain the DOS versions multiplayer to varying degrees. The various console ports all feature simplified levels and omit some levels, enemies, and features from the original DOS release. The SNES and Gameboy Advance versions of the game actually use different engines and hence feature numerous small gameplay differences.</p>"},{"name":"Doom II","year":2002,"developer":"id Software, Inc.","url":"7#Doom%20II%20%28Europe%29%20%5BEng%5D.gba","filesize":16777216,"score":8,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Horror > Regional differences","desc":"<p>In this sequel to the original Doom, the protagonist is still the same hero - the last remaining space marine. After having single-handedly saved Mars from demonic threat, he returns to Earth, only to find out that the demons have already invaded it, killed most of its inhabitants or possessed them. It's his task to bring down the force field around the last operational star port to allow the remnants of mankind to escape to the stars.</p><p><em>Doom II</em> looks and plays very similarly to its predecessor, utilizing the same 3D graphical engine with 2D sprites for enemies. The gameplay once again consists entirely of navigating the hero from first-person view through 3D environments and shooting at the demons while attempting to find the way out by flipping switches and looking for keys. Unlike in <em>Doom</em>, which is divided into three episodes, the 30 levels of this game (plus the 2 secret levels) form one long episode. </p><p>The game adds one new weapon to the player's arsenal; the super shotgun, several new demon types with more advanced attacks than those of the predecessor, such as the chaingun-toting Heavy Weapon Dudes, the skeletal Revenants who launch homing missiles and the sinister Arch-Viles who have a highly damaging fire attack.</p>"},{"name":"Dora the Explorer: Dora's World Adventure","year":2006,"developer":"Black Lantern Studios, Inc.","url":"a#D.zip/D%2FDora%27s%20World%20Adventure%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Mini-games > Licensed","desc":"<p>Based on the TV show and special of the same name, this game has the player complete a total of 20 different levels. <i>Story Mode</i> and <i>Play Any Game</i> are the two choices the player has when in the main menu.</p><p><i>Story Mode</i> has the player select any level he/she wants to play from the 20, and go from there to the end. There are four levels each for France, Tanzania, Russia, and China; there are two for Dora's home once back from China. The first level of each involves going from country to country in varying modes of transportation. The second level of all five regions usually involves navigating through mazes and collecting three items. Only the second level in Russia has to do with skiing. The third in each of the four countries outside the Americas may vary between each other. The final one in each of the four have to do with finding each respective country's version of Swiper. The difficulty rises throughout the game in certain aspects. Also, the player may pause the game, but may not exit the level until it is finished. </p><p>The level select menu is set up so the player first looks at two pages, each displaying about half of Earth. Then, once a location is selected, the player can choose from any section of the game in that region. Though Dora's home is a choice in both globe pages, the first takes the player to the beginning of the story, while the second takes the player towards the end. There are no levels in the first Americas choice, but the plot starts there. <i>Play Any Game</i> lets the player choose from any of the 20 levels to play. Once finished with it, the player goes back to the region's game select menu.</p><p>The plot goes as follows:Today is Friendship Day, a worldwide celebration when friendship bracelets are worn by everyone. When worn, the bracelets will make the sky brighter by glowing. However, Swiper swiped friendship bracelets with his Swiper-copter, leaving the people of France, Tanzania, Russia, and China (mainly Paris, Mt. Kilimanjaro, the Winter Palace, and the Great Wall of China respectively) without them. Once realizing that the items swiped were friendship bracelets, Swiper felt repentance. After the Swiper-copter failed to work again, Dora and Swiper must return them back to those four countries a different way. Will they save Friendship Day?</p>"},{"name":"Dora the Explorer: Super Spies","year":2003,"developer":"CinéGroupe Interactive","url":"a#D.zip/D%2FDora%20the%20Explorer%20-%20Super%20Spies%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Spy / espionage > Licensed","desc":"<p>Señor Tucán, master Super Spy, has a special mission for Super Spy Dora and Super Spy Boots - race to Tico's workshop to warn him of Swiper's plan to swipe his new Rocket-Car!   Super Spies Dora and Boots will need help from their friends Backpack, Map, and of course, you! Help them find Spy Briefcases containing special Spy Gadgets to assist them along the way - from Spy Glasses to help them see \"hidden\" things to Rocket Sneakers that give them the ability to \"fly\" to high places!</p>"},{"name":"Dora the Explorer: Super Star Adventures","year":2004,"developer":"ImaginEngine","url":"a#D.zip/D%2FDora%20the%20Explorer%20-%20Super%20Star%20Adventures%21%20%28E%29%20%28M3%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Arcade > Puzzle elements > Licensed","desc":"<p><em>Dora the Explorer: Super Star Adventures</em> is small arcade game, based on the animated television series for young children. The main character is seven year old girl Dora, who together with the monkey Boots must capture one of the six explorer stars. The game consists of a series of mini-games: hide-and-seek with stars, maze, racing, a Frogger-style game and a simple platform game. The game is non-linear; the player can choose the adventures in any order.</p>"},{"name":"Dora the Explorer: The Search for Pirate Pig's Treasure","year":2002,"developer":"CinéGroupe Interactive","url":"a#D.zip/D%2FDora%20the%20Explorer%20-%20The%20Search%20for%20Pirate%20Pig%27s%20Treasure%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Licensed","desc":"<p>Dora, while playing catch with boots, overthrew the ball. While looking for it, Dora and Boots met Pirate Pig, who offered them to help him search for his treasure chest.</p><p>Based on the Nick Jr. television series, this platformer carries the player through eight locations on the map. In each location, three levels require the player to play as Dora and/or Boots to collect three stars. 30 coins also scatter each level, yet they are optional. Varying items, which help the player progress, are placed in each level. However, watch out for Swiper, who sneaks around, trying to steal your collected items.</p>"},{"name":"Dotstream","year":2006,"developer":"Skip, Ltd."},{"name":"Double Dragon Advance","year":2003,"developer":"Technos Japan Corp.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Double%20Dragon%20Advance%20%28USA%29.zip","filesize":1,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Direct control","desc":"<p>Set in a post-apocalyptic New York, <em>Double Dragon</em> is the story of Billy and Jimmy Lee, twin brothers trained in the fighting style of Sou-Setsu-Ken. Together, they manage a small martial arts training school, teaching their students in self-defense. One day, Billy's girlfriend, Marian, is kidnapped off the street by the \"Black Warriors\", a savage street gang led by a man named Willy. The Black Warriors demand the Lee brothers disclose their martial arts secrets in exchange for Marian's freedom. The Lee brothers set out on a rescue mission to crush the Black Warriors and save Marian.</p><p>Using whatever techniques they have at their disposal, from the basic punches and kicks to the invulnerable elbow strike, as well any weapon that comes into their hands, the Lee brothers must pursue the gang through the city slum, industrial area and the forest before reaching their hideout to confront the big boss, Willy.</p><p>The NES version of this game also has an additional VS. fighting mode for one or two players. Players choose from a field of six different characters (Billy and 5 of the enemy characters) and enter into a one-on-one fighting match. Players have to punch, kick, jumpkick, and even use a weapon against their opponents until someone's health bar is fully drained. The winner is the last one standing.</p>"},{"name":"Dr. Mario","year":2004,"developer":"Nintendo R&D1"},{"name":"Dr. Mario & Puzzle League","year":2005,"developer":"Nintendo Co., Ltd."},{"name":"Dr. Muto","year":2002,"developer":"Digital Eclipse Software, Inc.","url":"a#D.zip/D%2FDr.%20Muto%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%5Bb%5D.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>You are Dr. Muto, a maniacal and genius mad scientist whose latest experiment has accidentally destroyed his own home planet (except for his laboratory)! </p><p>Dr. Muto will use his latest invention, the Splizz Gun, to mutate and morph with any living organism in order to accomplish tasks no human could achieve alone. </p><p>By simply sampling some DNA, the doctor will be able to morph into a spider, mouse, gorilla or whatever creature he sees fit to become. Now he must use his fiendish gadgets and morphing ability to steal organic matter from the neighboring planets in order to rebuild his world.</p>"},{"name":"Dr. Seuss: Green Eggs and Ham","year":2003,"developer":"Handheld Games LLC","url":"a#D.zip/D%2FDr.%20Seuss%27%20Green%20Eggs%20and%20Ham%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Strategy > Side view > 2D scrolling > Turn-based > Board game > Mini-games > Party game > Platform > Puzzle elements > Direct control > Licensed","desc":"<p>This is the question asked by Sam I am as you enter his zany Seussian worlds in search of this somewhat odd delicacy. \"Would you? Could you? In a car? On a boat? On a train? In a tree?\" Use the stylized 3-dimensional game board to lead you from adventure to adventure, collecting green eggs and ham as you go. \" I do so like green eggs and ham. Thank you. Thank you. Sam I am.</p>"},{"name":"Dr. Sudoku","year":2006,"developer":"Success Corp.","url":"a#D.zip/D%2FDr.%20Sudoku%20%28E%29.gba","filesize":1,"score":7.1,"genres":"Puzzle > Top-down > Fixed / flip-screen","desc":"<p>That weird number-based game you keep seeing people play on their newspapers has come to GameBoy Advance. Sudoku is a logic-puzzle game in which a 27x27 square is partially filled in with numbers and the object of the game is to fill in the blank squares so that every column, row and 3x3 square will have a number of 1-9 entered...without repeating.</p><p><em>Dr. Sudoku</em> features 1,000 puzzles crafted by the leading developer of Sudoku, Skynet Corporation of Japan. If you are new to the game, have no fear - in addition to readily available hints, <em>Dr. Sudoku</em> has a tutorial mode that will guide you through the game. You can also ask the doctor to verify if a puzzle is actually solvable.</p><p>Another feature is \"Original Mode\" that allows you to create your own puzzles (this allows you to transfer puzzles you see in the newspaper onto your GBA).</p>"},{"name":"Dragon Ball GT: Transformation","year":2005,"developer":"Webfoot Technologies, Inc.","url":"a#D.zip/D%2FDragon%20Ball%20GT%20-%20Transformation%20%28U%29.gba","filesize":1,"score":6.4,"genres":"Action > Side view > Anime / Manga > Beat 'em up / brawler > Licensed","desc":"<p>This release of the Dragon Ball saga is a side-scrolling combat game that allows you to play missions or arcade games with 9 characters of the TV series, though in story mode you have to unlock some characters to be able to use them. There are single and multiplayer modes. In the single player mode you can use multiple characters in your adventures and switch between them, using their special skills when in difficult situations. You can also play in multiplayer mode with the Link system.Each character has his/her special moves and abilities, and the various environments in the planets are also quite accomplished. The game modes are: Story, Standard, Endurance, Boss Endurance, Robot Swarm and Piccolo.</p><p>In the Story mode, Goku is accidentally turned into a child, and in order to become an adult again, he has to recover all the Dragon Balls which are scattered in different planets. While you battle your way through each planet, you will control 3 characters which represent the lives you have. Though they can expand their stamina, and recover their energy while not used. At the end of each planet you will have to defeat the corresponding boss, and the story finishes with a battle with an evil enemy well known to all Dragon Ball fans...</p>"},{"name":"Dragon Ball Z Collectible Card Game","year":2002,"developer":"ImaginEngine Corp.","url":"a#D.zip/D%2FDragon%20Ball%20Z%20-%20The%20Collectible%20Card%20Game%20%28U%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Cards / tiles > Trading / collectible card","desc":"<p>You start as one of four main characters: Goku, Gohan, Garlic Jr., or Frieza and they come with their own starter deck. Then, you have to battle through 4 rounds of opponents from the Dragonball Z series until meet the ultimate enemy, Cell! Once you defeat him you unlock one of the characters you defeated. The main task of the game is to unlock all of the characters in the game. Then, you have conquered the game. This game is only for the Game Boy Advance.</p>"},{"name":"Dragon Ball Z: Buu's Fury","year":2004,"developer":"Webfoot Technologies, Inc.","url":"a#D.zip/D%2FDragon%20Ball%20Z%20-%20Buu%27s%20Fury%20%28U%29.gba","filesize":1,"score":7.1,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Action RPG > Martial arts > Licensed","desc":"<p>Buu's Fury is the third installment of the Legacy of Goku series.  Prepare for Buu. A new enemy is threatening the world, and only the Z-Warriors can defeat him. In Dragon Ball Z: Buu's Fury, players will face the ultimate test in Buu, an insatiable villain bent on nothing less than Earth's destruction. Level up your characters, explore vast levels, and collect vital items on your way.</p>"},{"name":"Dragon Ball Z: Supersonic Warriors","year":2004,"developer":"Arc System Works Co., Ltd.","url":"a#D.zip/D%2FDragon%20Ball%20Z%20-%20Supersonic%20Warriors%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.3,"genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Fighting > Martial arts > Licensed","desc":"<p>Take your battle to the skies! For the first time on GBA, Dragon Ball Z fighting action can unfold in the air as players can fly at will! <em>Dragon Ball Z: Supersonic Warriors</em> features the most skilled heroes and villains, including Goku, Vegeta, Cell, Frieza and Buu. Engage in massive tag team battles, and experience the Dragon Ball Z story in an all-new way, complete with alternate endings.</p>"},{"name":"Dragon Ball Z: Taiketsu","year":2003,"developer":"Webfoot Technologies, Inc.","url":"a#D.zip/D%2FDragon%20Ball%20Z%20-%20Taiketsu%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":4.2,"genres":"Action > Side view > Anime / Manga > Fighting > Licensed","desc":"<p><em>Taiketsu</em> is another game adaptation that is based on the famous <em>Dragon Ball</em> manga series that were written and illustrated by Akira Toriyama. The current <em>Dragon Ball</em> game features the following options: * <strong>One Player</strong>: Option that allows you to compete as one of the 15 <em>Dragon Ball</em> fighters in the modes available.+ Tournament: You start with 7 fighters but can unlock more to reach a total of 15. All fighters have the same combos and moves (like block, throws, ki blasts, etc.) and a set of 3 unique attacks that do more damage to the opponents. There’s also a combo of buttons that if pressed allows the battle to take place on the air. When on air you can’t use any of your current fighter’s moves but instead you must press rapidly the buttons that appear at the bottom of the screen in order to inflict damage to the opponent. When completing this mode you either get money as a prize or a new character is unlocked.+ Endurance: Mode in which you have to fight a set number of opponents with only one life bar.+ Time Challenge: Just like <em>Tournament</em> mode you fight a number of opponents with the exception that here you must do the least possible time. Again just like the <em>Tournament</em> mode if you complete the <em>Time Challenge</em> you either get money as a prize or unlock a new character.+ Sparring: Here you can select any of the fighters and practice their moves.+ Endurance 2x: Same as <em>Endurance</em> mode apart from the number of opponents which is doubled this time. The current mode is unlocked via the <em>Z-Store</em>.</p><ul><li><p><strong>Multiplayer</strong>: By teaming up with another player via the link cable you can fight two opponents controlled by the CPU.</p></li><li><p><strong>Z-Store</strong>: The place where you can spend the money you have earned to buy images, character bios, bonus settings (make both fighters invisible, one hit instant death and others), etc.</p></li></ul>"},{"name":"Dragon Ball Z: The Legacy of Goku","year":2002,"developer":"Webfoot Technologies, Inc.","url":"a#D.zip/D%2FDragon%20Ball%20Z%20-%20The%20Legacy%20of%20Goku%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":5.6,"genres":"Action > Role-playing (RPG) > Top-down > Isometric > Fighting > Martial arts > Licensed","desc":"<p>The animated cartoon comes to life. Gohan, a powerful young boy, has been kidnapped and it's up to you as his father Goku, to find him and destroy those who wish to harm his son.</p><p>The game follows an RPG style, with battle elements designed similarly to the style of the cartoon, with fireballs, quick moves and more. As the story progresses, you will learn more about the history of the cartoon, meeting a collection of crazy characters and fighting one-on-one battles over long distances as well as close combat. The ten hour quest will take you to Master Roshi's Island, throughout Earth and beyond. Plus an in-game clock keeps tabs on your time limit to complete the game.</p>"},{"name":"Dragon Ball Z: The Legacy of Goku II","year":2003,"developer":"Webfoot Technologies, Inc.","url":"a#D.zip/D%2FDragon%20Ball%20Z%20-%20The%20Legacy%20of%20Goku%20II%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.5,"genres":"Action > Role-playing (RPG) > Top-down > Isometric > Anime / Manga > Fighting > Martial arts > Licensed","desc":"<p>Following on where Legacy of Goku left off, and expanding the story built by the cartoon series, here you play as five different characters through 3 sagas that will test your skills.</p><p>Fight your way through the Trunks, Androids and Cell sagas as Trunks, Vegeta, Piccolo, Gohan and Goku through either hand-to-hand or distant combat. Build up your character(s) experience and power as you build your way up to the ultimate battle with Cell.</p>"},{"name":"Dragon Ball: Advanced Adventure","year":2004,"developer":"Dimps Corporation","url":"a#D.zip/D%2FDragon%20Ball%20-%20Advanced%20Adventure%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.8,"genres":"Action > Anime / Manga > Beat 'em up / brawler > Platform > Licensed","desc":"<p><em>Dragon Ball: Advanced Adventure</em> follows the exploits of young Goku as he sets out for the first time to seek the legendary Dragon Balls. Based on the earliest manga chapters (before the series turned into Dragon Ball Z series), players fight their way through platform levels, bashing countless goons and bosses inspired by pivotal events and characters from the series.</p><p>While the game's levels are straightforward brawls, special duels and tournament sequences play like classic fighting games, albeit with simplified controls. Goku can punch, kick and use his magic staff. After a certain point in the game, getting the Flying Nimbus, he receives the ability to engage into air combat. After completing the story mode, duel characters become available for customizable one-on-one bouts. Additional characters and mini-games can be unlocked by satisfying special requirements, e.g. completing the story mode unlocks Goku's fiend Krillin as a playable character.</p>"},{"name":"Dragon Quest Characters: Torneko no Daiboken 3 Advance - Fushigi no Dungeon","year":2004,"developer":"Chunsoft Co., Ltd.","url":"a#D.zip/D%2FDragon%20Quest%20Characters%20-%20Torneko%20no%20Daibouken%203%20Advance%20-%20Fushigi%20no%20Dungeon%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Top-down > Turn-based > Fantasy","desc":"<p>Following the events of the previous game, Torneko despite his success has again grown restless and looking for adventure. He uses his money to build a ship and head out over the great sea to explore lands unknown. However, the same day he is celebrating his birthday, a great tidal wave rises up and destroys his boat. Torneko, along with his wife and son, are recovered by the villagers of a small island. In gratitude, Torneko agrees to help them with the monster problem they've been having from a Mysterious Dungeon nearby cave. And as usual, he will try to discover rare and valuable items in the cave which he can use to reestablish his fortune.</p>"},{"name":"Dragon Quest Monsters: Caravan Heart","year":2003,"developer":"Tose Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Dragon%20Quest%20Monsters%20-%20Caravan%20Heart%20%28Japan%29%20%5BT-En%20by%20The%20Translation%20Team%20v1.0%5D.zip","filesize":1,"score":"","genres":"Role-playing (RPG) > 1st-person > Isometric > Anime / Manga > Turn-based > Managerial / business simulation > Fantasy","desc":"<p>Following in the footsteps of the media phenomenon Pokémon, <em>Dragon Quest Monsters</em> lets players travel a fantasy world on a quest to capture monsters and train them in battles against other creatures. An aspect integral to the Monsters series from the start is the breeding or merging of monsters to create stronger offspring inheriting the parents' skill sets.</p><p>Only released in Japan, <em>Dragon Quest Monsters: Caravan Heart</em> puts players once again in the role of prince Kiefer from Dragon Quest / Dragon Warrior VII. Like previous <em>Dragon Quest Monsters</em> games for the GameBoy Color whose plot took place before Dragon Quest VI, <em>Caravan Heart</em> is set before the events of the main series' part from which it was spun off.</p><p>Hiding from the consequences of one of his infamous pranks again, young Kiefer is whisked away by the goddess Rubiss, known from Dragon Quest II and III, to the land of Alefgard. There he meets the boy Lewin whose parents have fallen ill. To cure them with the 'Ball of Roto' artefact and secure his passage home, Kiefer takes the lead of a monster caravan travelling through the country.</p><p>The monster caravan, made up of the Dragon Quest series' iconic covered wagons, acts as players' mobile base from which they plan their monster hunts. Travelling with it consumes food rations, one of the game's resources.Unlike in the first Dragon Quest games, Kiefer can recruit monsters as well as human protagonists into his party which can take on various jobs. The monster breeding from previous titles was replaced by merging monsters, requiring the game's other resource, monster hearts.</p>"},{"name":"Dragon Tales: Dragon Adventures","year":2004,"developer":"Handheld Games LLC","url":"a#D.zip/D%2FDragon%20Tales%20-%20Dragon%20Adventures%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Licensed","desc":"<p><em>Dragon Tales: Dragon Adventures</em> is a game based on the animated series Dragon Tales. The game follows two young children, Emmy and Max, who travel into a book full of dragons and fairies. There are five \"Dragon Tales\" to choose from. The game is a simple platformer, with each story varying slightly. In the first story, \"Dragon-Berry Days,\" you must find all of the Dragon Berries that have dispersed. In the second story, \"Bye-Bye Flutterby,\" Max's flutterby collection has scattered. In the third story, \"Help, I'm Lost,\" you must help baby animals find their friends. In the fourth story, \"Puzzle Wood,\" you must help collect puzzle pieces. In the fifth and final story, \"Scaliwag,\" you must help Captain Scaliwag find his maps and his treasure. All five stories are similar, but the level designs are changed, along with the desired item. Signs let you change characters, as some have different abilities, Max and Emmy can crawl in small places. The dragons can hover for a short time and fly when needed. Along with the desired item, you can also collect cupcakes, jewels, and music notes for points.</p><p>The Game Boy Advance version also has a training level to show you things like slides, drums to bounce on, poles, and other gimmicks found throughout the game. Also, Zak and Wheezie are added as playable characters rather than the main characters of a mission. All stories are present, but the visuals and presentation are raised to fit the next-generation system.</p>"},{"name":"Drake & Josh","year":2007,"developer":"Behaviour Interactive, Inc.","url":"a#D.zip/D%2FDrake%20and%20Josh%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Mini-games > Direct control > North America > Comedy > Licensed","desc":"<p><em>Drake &amp; Josh</em> is a game based on the Nickelodeon TV series. Drake and Josh are misfit brothers who are already dealing with school, girlfriends, and their cunning, mischievous younger sister who is always pulling pranks on them. Trouble will take on a whole new meaning with Drake's new employment, Josh's new promotion, and some unexpected visitors. Puzzles, stealth, strategy, action, and more are all game elements.</p><p>Interact with Drake, Josh, and Megan after playing as both Drake and Josh. Assist Drake in charming all of the ladies with his guitar while avoiding being splattered in the craziest food battle ever.</p>"},{"name":"Dream Eater","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"DreamWorks & Aardman Flushed Away","year":2006,"developer":"Altron Corporation"},{"name":"DreamWorks Shark Tale","year":2004,"developer":"Vicarious Visions, Inc."},{"name":"Drill Dozer","year":2005,"developer":"Game Freak, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Drill%20Dozer%20%28USA%29.zip","filesize":1,"score":7.9,"genres":"Action > Side view > Platform","desc":"<p>The Skulker gang has stolen your beloved Red Diamond that once belonged to your departed mother. Using your Drill Dozer, you must lead your fellow band of thieves, the Red Dozers, on a quest to retrieve the Red Diamond. </p><p>Gameplay consists of navigating through several areas using your Drill Dozer robot to bore through enemies, walls, and pretty much anything else that's in your way. The Drill Dozer itself is a multifaceted machine able to work underwater and to take flight. It also has the ability to shift the drill into higher gears to tear through the toughest of obstacles. Along the way, you'll upgrade your Drill Dozer robot with gears and add-ons that will help aide you in your quest.</p>"},{"name":"Driv3r","year":2005,"developer":"Velez & Dubail Dev. Team"},{"name":"Driven","year":2001,"developer":"Crawfish Interactive Ltd.","url":"a#D.zip/D%2FDriven%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.9,"genres":"Racing / Driving > Diagonal-down > Isometric > Automobile > Track racing > Licensed","desc":"<p>Inspired by Sylvester Stallone's hit-movie 'Driven', race on 6 extraordinary tracks including California's Angel's Bay and France's high speed circuit. Choose from 12 characters, each with distinct personalities and driving styles. Challenge your racing skills in multiple racing styles - Arcade, Story, Championship and Multi Game Pak modes (for up to 4 players). Unlock secret bonus tracks by pushing yourself 'into the ZONE and increase your performance until man and machine become one.</p>"},{"name":"Driver 2 Advance","year":2002,"developer":"Sennari Interactive, LLC","url":"a#D.zip/D%2FDriver%202%20Advance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.9,"genres":"Action > Racing / Driving > Behind view","desc":"<p>Driver 2 received a belated adaptation for the Game Boy Advance in <em>Driver 2 Advance</em>. The handheld version adapts the storyline of the original but cuts it down heavily, while presenting the gameplay in a graphics engine tailored to the portable platform.</p><p>As in the original, the player controls undercover cop Tanner, who investigates the murder of a Brazilian criminal, leading him facing both a Brazilian gang as well as the Chicago mob. The story is mainly told through cutscenes that employ stills from the rendered scenes of the original, with dialogue adapted in accordance with the cut-down story. While the original moved through four cities, only two remain in the GBA version: Chicago and Rio de Janeiro.</p><p>Gameplay still takes the form of individual missions that have to be taken on in order. Goals vary between quickly moving to a certain location on the map, following another car, ramming a car to stop it, tailing a car without being seen (neither moving too far away nor too close) and pick-up and delivery jobs. The cities are rendered in texture-mapped 3D, with cars and pedestrians displayed as sprites. Some of the game's missions are direct adaptations from the original, while others are completely new. The Chicago and Rio map layouts are much simplified compared to the original.</p><p>Besides the main Undercover mode, the two cities can be freely explored in Take A Ride mode. The game also includes the same five mini-games as in the PlayStation version, involving ramming a car, losing a police tail, following a path set out by traffic cones, a checkpoint race and a demolition survival. The game also includes four-player-multiplayer via link cable, with four exclusive modes: checkpoint and cross-town racing as well as free-for-all (solo) and cops-n-robbers (team-based) survival.</p>"},{"name":"Drome Racers","year":2003,"developer":"Möbius Entertainment Ltd."},{"name":"Dual Blades","year":2002,"developer":"Vivid Image","url":"a#D.zip/D%2FDual%20Blades%20%28U%29.gba","filesize":1,"score":6.3,"genres":"Action > Side view > Arcade > Fighting > Martial arts","desc":"<p>Dual Blades is a side-scrolling fighting game which takes place in 150 B.C amid the Hun Empire. The worlds greatest warrior, Alperen has gained incredible energy by merging his soul with Dual Blades, a mysterious sword. The sword gives him powers beyond belief and immortality. All combatants from the past and future are summoned to fight him for its immortality or to face death.</p><p>The game features head to head fighting action with a cast of 9 unique characters. The character graphics are big and take place in  colorful multi-scrolling arenas. There are unique features in the engine including combos, blood and gruesome death moves. Gameplay consists of Arcade, Versus, Battle and Training modes. Two players can go head to head via the Game Link cable.</p>"},{"name":"Duel Masters Kaijudo Showdown","year":2004,"developer":"Mistic Software Inc.","url":"a#D.zip/D%2FDuel%20Masters%20-%20Kaijudo%20Showdown%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.7,"genres":"Role-playing (RPG) > Strategy > Top-down > Cards / tiles > Trading / collectible card > Licensed","desc":"<p>You will start the quest with your brother's deck of cards. Win some shop tournaments and it will be the beginning of your path to become a Kaijudo Master.</p><p>Here are some new features: Creative User Interface, Innovative mini games, Multi player compatibility, Helpful tutorial, More characters and TV show characters, 300 cards and authenticity of card graphics, Multiple tournament seasons, Improved deck management, New interface for talking to an NPC, trading, dueling, New Pocket Gizmo and cool stuff that comes with it, emails, newspaper articles, strategy guides, etc.</p>"},{"name":"Duel Masters Sempai Legends","year":2003,"developer":"Mistic Software Inc.","url":"a#D.zip/D%2FDuel%20Masters%20-%20Sempai%20Legends%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.6,"genres":"Role-playing (RPG) > Strategy > Top-down > Cards / tiles > Trading / collectible card","desc":"<p>Kids register as duel masters player, build their deck and manage their cards throughout a huge single-player adventure, or challenge their friends and trade with them using the link cable. </p><p>Here are some more features that make this game so unique:- RPG with exclusive adventure and special exclusive cards.- Simple, intuitive and addictive game play.- 180 cards - Possibility to complete the entire DM cards collection and from it, create a personalized ultimate deck.- Travel around the Duel Masters world and challenge many randomly generated DM players.- Amazing battle animation and special effects.- Challenge powerful duellists in some crucial tournaments.</p>"},{"name":"Duel Masters: Shadow of the Code","year":2005,"developer":"Mistic Software Inc.","url":"a#D.zip/D%2FDuel%20Masters%20-%20Shadow%20Of%20The%20Code%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Strategy > Top-down > Cards / tiles > Trading / collectible card > Licensed","desc":"<p>Recent tournament titles have put you at the top of the competitive circuit. Fans want your autograph, your smiling face adorns many a zine cover, and shop owners argue over who gets to be your sponsor. But all is not well when your pal Shobu goes missing and kids start reporting real-life sightings of famous Duel Masters creatures in town. Winning tournament isn't enough if you want to solve the mystery of missing Shobu.</p>"},{"name":"Duke Nukem Advance","year":2002,"developer":"Torus Games Pty. Ltd.","url":"7#Duke%20Nukem%20Advance%20%28USA%29.gba","filesize":8388608,"score":7.8,"genres":"Action > 1st-person > Shooter","desc":"<p>Alien scientists are working at taking over earth, and have already occupied the secret military base, Area 51. But little do they know that Duke Nukem is back and on their case, and he'll be travelling around the world, from Egypt to Australia, to make sure he's shot, frozen and/or stamped on every one of these creeps; and pick up a few girls while he's at it.</p><p>There are 19 stages to be completed, each hosting their own secrets and colored keycards, not to be mention the alien nasties themselves. Some of the classic weaponry is in, the shrink ray and freezer for instance. And in, also, are some old villains too, like the all time fav Pig Cop.</p><p>Upto 4 GBA's can be linked together for the multiplayer deathmatch mode, but each player has to have his own gamepak.</p>"},{"name":"Dungeons & Dragons: Eye of the Beholder","year":2002,"developer":"Pronto Games, Inc.","url":"a#D.zip/D%2FDungeons%20%26%20Dragons%20-%20Eye%20of%20the%20Beholder%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.5,"genres":"Role-playing (RPG) > 1st-person > Isometric > Fantasy > Licensed","desc":"<p><em>Dungeons &amp; Dragons: Eye of the Beholder</em> is a classic dungeon crawler that challenges the player to lead a party of adventurers on a quest for fame and fortune in a world based on <em>Forgotten Realms</em>, a <em>Dungeons &amp; Dragons</em> universe. </p><p>The party will scour the dark underbelly of Waterdeep for an evil source of power that threatens the streets above. Nary an hero would dare step into these dungeons alone, so the player must create a party of up to six adventurers from four base classes (Wizard, Rogue, Cleric and Fighter) and seven races (Human, Half-Elf, Half-Orc, Moon Elf, Lightfoot Halfling, Rock Gnome and Shield Dwarf). All are based on character types from the <em>Dungeons &amp; Dragons 3rd Edition</em> license. </p><p>The first-person view draws the player into the role of adventurer. A handy auto-map feature helps to navigate the complex mazes of slime-covered walls and hidden passages. For the turn-based battles, the view switches to an isometric overhead perspective. Each character can be assigned commands for moving, attacking and spell-casting. Characters can also learn over 100 unique skills, feats, and spells that are straight out of the <em>Dungeons and Dragons 3rd Edition</em> rules. </p><p>As with all RPGs, success depends on constantly upgrading equipment, assigning new spells and reordering the group. Over 100 items, both magical and ordinary will keep the player adventuring for hours.</p>"},{"name":"Dynasty Warriors Advance","year":2005,"developer":"KOEI Co., Ltd.","url":"7#Dynasty%20Warriors%20Advance%20%28USA%2C%20Australia%29%20%5BEng%5D.gba","filesize":16777216,"score":5.4,"genres":"Action > Strategy > Top-down > Turn-based > Arcade > China (Ancient / Imperial) > Historical events","desc":"<p><em>Dynasty Warriors Advance</em> is a Game Boy Advance adaptation of the Dynasty Warriors franchise. Based on the \"Three Kingdoms period\" of ancient China, it takes place at the end of the Han Dynasty during 190 A.D. As the previous government collapses, warlords rise up and fight among one another, eventually establishing three powerful kingdoms: Wei, Wu and Shu. Generals from each of these nations spend the next 100 years fighting among one another, each trying to become the dominant power.</p><p><em>Dynasty Warriors Advance</em> is a top-down turn-based strategy board game, but with a focus on action combat. Since it is based on the earlier Dynasty Warriors titles, many of the same concepts carry over. Players begin by choosing one of three available characters from the lands of either Wu, Shu or Wei. Each character has their own unique storyline and missions. A briefing is given for each mission detailing specific objectives before allowing the player to equip themselves with weapons and skills at the camp. Once begun, the player moves the designed number of spaces (determined by movement) around the \"board\". If an enemy player is encountered, the game shifts to a top-down action fighting mode. Here the player uses one button to attack, another button to charge and another to unleash a misou special attack once it is powered up. Misou energy is charged by successful attacking enemy units. The player's success against the enemy unit will determine the unit's \"heath\" and will be destroyed completely if all of it's units are destroyed. Some enemy units contain not just soldiers but enemy generals who have their own special moves and greater health. Many missions feature specific objectives rather than just defeating all enemies.</p>"}]