[{"name":"E.T. The Extra-Terrestrial","year":2001,"developer":"Fluid Studios Ltd","url":"a#E.zip/E%2FE.T.%20-%20The%20Extra-Terrestrial%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":5.4,"genres":"Action > Top-down > 2D scrolling > Arcade > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p>Re-live the best moments of the classic movie, E.T. The Extra-Terrestrial in this GBA title. Search for the parts to the transmitter and put it together so that E.T. can contact his homeworld (aka \"Phone Home\") then evade the police, FBI and scientists to get to the spaceships landing spot. Play as both E.T. and Elliott in fully interactive environments, playing levels based on key scenes in the movie (such as the home contact, bike chase and more).</p>"},{"name":"Earthworm Jim","year":2001,"developer":"Shiny Entertainment, Inc.","url":"a#E.zip/E%2FEarthworm%20Jim%20%28U%29.gba","filesize":1,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Comedy","desc":"<p>A crow is chasing a worm named Jim, while in outer space Psy-Crow is chasing a renegade ship. The ship's captain has stolen an ultra-high-tech-indestructible-super-space-cyber-suit and Queen Slug-for-a-Butt has ordered Psy-Crow to get it, since it can make her more beautiful than Princess-What's-Her-Name. Psy-Crow blasts the captain and the suit falls to Planet Earth.</p><p>Back on Earth, Jim wonders if he is finally safe when an ultra-high-tech-indestructible-super-space-cyber-suit lands on him. Luckily Jim rests in the neck ring of the suit. The space particles then begin interacting with Jim, causing a light-speed evolution. Jim soon realizes he is in control of the suit.</p><p>Jim overhears the Queen's plans for the suit and decides to meet this Princess...</p><p><em>Earthworm Jim</em> is a 2D side-scrolling platformer with action elements where the player takes control of Jim, a worm wearing a spacesuit. Jim can shoot enemies with his gun or use his body (the spacesuit's \"head\") in a variety of ways to overcome obstacles, such as whipping it at enemies, grappling hooks to swing from them, or making it spin very fast like a rotor to hover for a short time.</p><p>While most of the game is made of standard platforming levels with a boss waiting at the end, some of the levels introduce different conditions than just reaching the end to complete them, like escorting a computer-controlled character and making sure they don't get hurt. Platforming levels are interspersed with some variations in gameplay as well, such as several space racing sequences or a bungie-jumping competition.</p>"},{"name":"Earthworm Jim 2","year":2002,"developer":"Shiny Entertainment, Inc.","url":"a#E.zip/E%2FEarthworm%20Jim%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Comedy","desc":"<p>An ordinary average earthworm named Jim goes about his normal daily life, cruising around avoiding crows and doing other general worm-like things. Until one day, Jim is suddenly struck by a very large Ultra-high-tech-indestructible-super-space-cyber-suit. Through sheer luck, Jim rests safely in the neck ring of the suit. Suddenly, the ultra-high-tech space particles of the suit begin interacting with Jim's soft wormy flesh. A radical light-speed evolution takes place. Jim soon realizes that he is now in control of the suit.</p><p><em>Earthworm Jim 2</em>'s gameplay is similar to the first game, with Jim running and jumping through the levels. There are five weapons more than in the original game to collect. Characters like Princess What's-Her-Name and Psy-Crow also appear.</p>"},{"name":"Ecks vs. Sever","year":2001,"developer":"Crawfish Interactive Ltd.","url":"a#E.zip/E%2FEcks%20vs.%20Sever%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.4,"genres":"Action > 1st-person > Shooter > Licensed","desc":"<p>Ecks vs. Sever is the amongst the first FPSes to be featured on the Game Boy Advance. The game tells the story of Ecks, an ex-FBI Agent whose orders are to hunt down the beautiful assassin named Sever. As the cat-and-mouse-hunt progresses, both agents will find out that they are mere pawns in a larger government conspiracy...</p><p>In the Single Player mode, the player can choose wether he wants to play as Ecks or Sever. The choice makes a radical difference in the single-player campaign. As Ecks, your orders are to chase Sever, whilst as Sever, you have to evade him. The levels for both characters tend to be the same, but with different objectives, and different locations for both characters. </p><p>As an example, the orders of Sever are to hunt down and kill a government agent whilst as Ecks, your orders are to prevent the assassination. During this level, both characters will encounter each other. As Ecks, you'll have to try and snipe Sever whilst evading her grenades. When you play this level as Sever, you'll have to throw grenades at Ecks, whilst avoiding his sniper fire.</p><p>The game also has a multi-player mode for up to 4 players with three different modes, which are Deathmatch (Every man for himself), Assassination (one player is the assassin who has to hunt down the VIP who's being protected by bodyguards) and Bomb kit (Try to gather all parts of a bomb before the other players do).</p>"},{"name":"Ed, Edd n Eddy: Jawbreakers!","year":2003,"developer":"Climax Group Limited","url":"a#E.zip/E%2FEd%2C%20Edd%20n%20Eddy%20-%20Jawbreakers%21%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > Platform > Puzzle elements > Licensed","desc":"<p>Ed, Edd and Eddy love jawbreakers, and when the local candy store announces a chance to win a jawbreaker that lasts forever, the three completly different friends set out to find the tickets to ensure they win the prize.</p><p>Control the three kids through each level, using each others strengths to complete the puzzles and find the tickets. Ed is the strongest and is best used for bash things around; Edd is the smartest of the three and can pull switches and use his slingshot while Eddy is the fastest of them all and can use a jetpack to get around.</p>"},{"name":"Ed, Edd n Eddy: The Mis-Edventures","year":2005,"developer":"Artificial Mind & Movement","url":"a#E.zip/E%2FEd%2C%20Edd%20n%20Eddy%20-%20The%20Mis-Edventures%20%28E%29%20%28M2%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > Comedy > Licensed","desc":"<p><em>Ed, Edd n Eddy: The Mis-Edventures</em> is a 2-D side scrolling platformer. The game follows the Ed's quest to obtain as many jawbreakers as possible, which can either be found in the game world or purchased from candy machines for $1 accumulated from collecting pennies. The game features six distinct areas to explore and retains much of the art style and humor found in the TV show. Enemies encountered include dogs, squirrels, birds, and even water sprinklers and garden rakes. Characters from the show such as Kevin, Rolf, and the Kanker Sisters also make an appearance.</p>"},{"name":"Egg Mania","year":2002,"developer":"HotGen Studios Ltd.","url":"a#E.zip/E%2FEggo%20Mania%20%28E%29%20%28M6%29.gba","filesize":1,"score":7.4,"genres":"Action > 3rd-person (Other) > Fixed / flip-screen > Arcade > Platform > Puzzle elements","desc":"<p><em>Egg Mania</em> is a puzzle game in which the player controls an egg-shaped character against either a computer opponent or another player via the link cable. The object of the main modes is to build a tower tall enough to reach a balloon at the top of the playfield before the opponent does. If the player tries to take a short cut and not build complete floors, the structure will start crumbling and the water will come up faster. There are plenty of obstacles, both from the game and from competing opponents. Falling meteors can knock the player down into the water, while bombs thrown by the opponent will destroy parts of the player's structure. The main modes include Over Easy and Hard Boiled, the difference being that in the latter a different difficulty can be chosen.</p><p>There are four extra modes: Survival, Solo, Time Trial, and Bomb. In Survival the player must survive as many rounds as possible, while the goal in Solo is to increase the overall score by completing rows and performing combos; Time Trial challenges the player to continually beat his or her own best time; finally, in Bomb, whoever destroys the opponent's tower first wins.</p><p>Compared to the GBA version, the console versions have improved graphics and sound, cutscenes at the beginning of each level, a play area that is wider by one block, two additional modes (8-player Tournament and Custom, where the rules can be customized by activating different options), but lacks the Time Trial mode. Otherwise, they are completely identical, both in gameplay and level design.</p>"},{"name":"Elevator Action Old & New","year":2002,"developer":"Taito Corporation","url":"a#E.zip/E%2FElevator%20Action%20-%20Old%20%26%20New%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Arcade > Platform > Spy / espionage","desc":"<p>A re-release of the original Elevator Action (the \"old\") with an additional arranged version created specifically for the GBA (the \"new\").</p><p>Elevator Action casts you as a super-spy with the mission to collect secret documents from an enemy building and escape unharmed. Played from a non-scrolling side view, you have to direct your agent to each office in order to collect the documents while avoiding enemy guards and their weapons. You can navigate from floor to floor by controlling the many elevators that fill the building, as well as shoot your enemies or light fixtures in each floor to give you an edge while your enemies stumble in the dark.</p><p>The new arranged version features remade cute-fied graphics, multiple selectable characters (each with different abilities and attacks), a health bar, and expanded levels with more challenges and new enemies such as robots and zombies. But otherwise plays just like the original.</p>"},{"name":"Elf Bowling 1&2","year":2005,"developer":"NStorm, Inc.","url":"a#E.zip/E%2FElf%20Bowling%201%20%26%202%20%28U%29.gba","filesize":1,"score":4.5,"genres":"Action > Compilation > Sports > Behind view > Fixed / flip-screen > Bowling > Comedy","desc":"<p>This game is a compilation of two NStorm-developed mini-games: Elf Bowling and Elves in Paradise: Elf Bowling 2. Both games come with unchanged graphics straight from their flash-based originals.</p><p><em>Elf Bowling</em> is a standard bowling game, where the player as Santa hurls a bowling ball down an alley at belligerents elves. This is done by pressing a button at the right moment as a red cone moves left and right along the bottom of the lower screen.</p><p><em>Elf Bowling 2</em> is a game of shuffleboard. The goal of the game is to hurl Elves down the deck into a score zone at the end of the ship. This is done by aiming the elf left and right with the D-pad, and hitting A-button at the right moment as a light slides across the grid in front of the player's character.</p>"},{"name":"Elf: The Movie","year":2004,"developer":"Jolliford Management Limited","url":"a#E.zip/E%2FElf%20-%20The%20Movie%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > Side view > Arcade > Licensed","desc":"<p>This platformer is based on the hit 2003 movie starring Will Ferrell who played a boy who was raised by elves in the North Pole and became a large elf comparatively. At 30 years of age, Buddy goes on a journey to New York to find his real father and a place where he can fit in.  The game's release was timed to come out the following 2004 holiday season with the dvd release and contains the choice of 5 languages.  </p><p>The main game is a side-scroller where you guide Buddy as he makes his way across icebergs while avoiding chasms and polar bears, dodges Manhattan traffic, and more. There are 10 missions based on the movie's events as he journeys to also help Santa and save Christmas.  You must collect missing sleigh parts, letters (to spell \"New York\" in one level) or parcels.  You will be penalized falling into the icy water or getting hit by a car which drains your health. To restore it, you   jump for lollipops and candies, Buddy's favorite foods. There are also 3 mini-games available from the start menu: Snowman Building is like Sokoban, Santa Says is a memorization game, and Cobbler's Workshop has you matching elves' shoes to put them in boxes. Plus, more minigames are available within the game.</p>"},{"name":"Enchanted: Once Upon Andalasia","year":2007,"developer":"Artificial Mind & Movement"},{"name":"Eragon","year":2006,"developer":"Amaze Entertainment, Inc.","url":"a#E.zip/E%2FEragon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.8,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Fantasy > Licensed","desc":"<p>Eragon for the Game Boy Advance is a traditional turn based RPG with a combat system that emphasizes motion and action.  Players use combinations of spells, melee attacks, and ranged attacks to battle Urgals, thieves, soldiers, and other various enemies.  This is an RPG where combat strategy plays a key role in success.</p><p>Players can make use of the RPG mechanics to create offensive and defensive potions, craft better armor and weapons, learn offensive and defensive spells, or become trackers who are able to find hidden encounters.  This design encourages experimentation, opens up a lot of strategic possibilities, and allows a lot of replayability.</p><p>The player assumes the role of Eragon, a young boy with a mysterious origin and an important future, on his perilous journey to avenge his father, rescue the woman of his dreams and join forces with the Varden in their war against King Galbatorix. On this adventure Eragon encounters many allies; Brom the old wizened story teller, Ayra the elf guard of the dragon egg, Murtagh the orphan with a troubled past, Angela an herbalist witch, and a powerful dragon that will help unveil Eragon's true destiny.</p>"},{"name":"Erementar Gerad: Tozasareshi Uta","year":2005,"developer":"Jupiter Corp.","url":"a#E.zip/E%2FErementar%20Gerad%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Anime / Manga > Turn-based > Fantasy > Licensed","desc":"<p><em>Erementar Gerad: Tozasareshi Uta</em> is a RPG based on the manga/anime Elemental Gelade (sometimes spelled Erementar Gerad). The story takes place in the world of Guardia where beings called Edel Raids coexist with humans, and can fuse with them by becoming a powerful weapon. </p><p>The player controls five characters from the anime: Coud Van Giruet, Reverie ‘Ren’ Metherlence (the most powerful Edel Raid, fuses with Coud), Cisqua, Rowen and Kuea (another Edel Raid, fuses with Rowen).</p><p>The team journeys from town to town and fights enemies and meets new original characters throughout an original story. In the turn-based battles, the player gives commands such as fight, fuse and help to the party members.</p>"},{"name":"ESPN Final Round Golf 2002","year":2001,"developer":"Konami Software Shanghai, Inc.","url":"a#E.zip/E%2FESPN%20Final%20Round%20Golf%202002%20%28E%29%20%5B%21%5D.gba","filesize":1,"score":6.4,"genres":"Simulation > Sports > Behind view > Top-down > Golf > Licensed","desc":"<p>While this version incorporates the many gameplay options of it's Japanese counterpart, JGTO Kounin Golf Master: Japan Golf Tour Game such as the overhead view, controls and 14 golfers to choose from and five different courses, there are some differences with this American version.</p><p>One difference is the branding of ESPN on the label along with their involvement in the game, giving the game the look of an ESPN television broadcast. Also, whereas the Japanese version featured characters that were geared towards anime and had larger heads, this version's characters are more realistically designed to look like actual people instead. It also features the ability to allow four friends to play against each other using the Game Boy Link Cable.</p>"},{"name":"ESPN Great Outdoor Games: Bass 2002","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"a#E.zip/E%2FESPN%20Great%20Outdoor%20Games%20-%20Bass%20Tournament%20%28E%29.gba","filesize":1,"score":"","genres":"Sports > 1st-person > Side view > 2D scrolling > Fishing > Licensed","desc":"<p>Fishermen rejoice: 3 vast lakes with 30 beautiful locations and lots of bass! Familiarise yourself with the different types of lure and fishing techniques to compete against computer opponents or a friend for the biggest bass you've ever landed on your Game Boy Advance™!</p>"},{"name":"ESPN International Winter Sports 2002","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"a#E.zip/E%2FESPN%20International%20Winter%20Sports%20%28E%29.gba","filesize":1,"score":7.1,"genres":"Action > Racing / Driving > Simulation > Sports > 3rd-person (Other) > Behind view > Side view > Top-down > Isometric > Tricks / stunts > Olympiad / mixed sports > Snowboarding / skiing > Licensed","desc":"<p>Take on the world in 10 different events.  Compete in two forms of Ski Jumping (K=90 and K=120), Alpine Skiing Downhill, Freestlye Skiing Moguls, Short Track 500 (skating), Figure Skating, Snowboard G Slalom, Snowboarding Halfpipe, Biathlon, and the Luge.</p><p>You can compete in trials of each event, the competition of all 10 events, or in excite mode.  Try for medals from each event.  See if you can come in first in all events, and then try to beat your own records.</p><p>Events require pressing buttons quickly for speed, pressing buttons in the right order at the right time to do tricks, and turning.  The Figure Skating event is very much like the Dance Dance series of games.</p>"},{"name":"ESPN X Games Skateboarding","year":2001,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"a#E.zip/E%2FESPN%20X-Games%20Skateboarding%20%28E%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > Side view > Tricks / stunts > Skateboarding > Licensed","desc":"<p>Aside from the practice, multiplayer, and free skate modes, players can participate in an X Games competition in either street or vert. In X Games, players attempt to earn the highest score within a one-minute time limit. One of the playable levels is inspired by the halfpipe used in X Games Six. The game also has an arcade mode, where players roam levels and complete various goals, and collecting spinning X Games logos, which unlocks other playable levels.</p>"},{"name":"European Super League","year":2002,"developer":"Aqua Pacific Ltd.","url":"a#E.zip/E%2FEuropean%20Super%20League%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > Isometric > Football (European) / Soccer > Licensed","desc":"<p>A handheld version of European Super League. However the action is viewed from an isometric perspective and the game only has 12 teams instead of 16.</p>"},{"name":"Excitebike","year":2002,"developer":"Nintendo R&D1"},{"name":"Extreme Ghostbusters","year":2002,"developer":"Magic Pockets SAS","url":"a#E.zip/E%2FExtreme%20Ghostbusters%20-%20Code%20Ecto-1%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.gba","filesize":1,"score":6.8,"genres":"Action > Racing / Driving > Side view > Top-down > Platform > Sci-fi / futuristic > Horror > Licensed","desc":"<p>When Extreme Ghostbusters Roland and Garrett have been kidnapped by the half-demon, half human Count Mercharior, it's up to the rest of the team to stage a rescue! Based on the animated series of the same name, players take control of  the Ecto-1 as they drive to four distinct locations throughout New York City to find clues of their missing friends' whereabouts.  Once there, Extreme Ghostbusters Kylie or Eduardo have to search throughout 3 different levels in each area until they find both their needed clue, and defeat the Boss Ghost in the area.  Once back at headquarters, Dr. Egon Spengler will give Kylie and Eduardo direction as to what their next assignment will be.  Once the Extreme Ghostbusters piece together all of the clues, it's time for a final showdown with Count Mercharior  to reunite the team once and for all.</p>"},{"name":"Eyeshield 21: Devilbats Devildays","year":2006,"developer":"Eighting Co., Ltd.","url":"a#E.zip/E%2FEyeshield%2021%20-%20Devilbats%20Devildays%20%28J%29.gba","filesize":1,"score":"","genres":"Adventure > 3rd-person (Other) > Fixed / flip-screen > Anime / Manga > Mini-games > Visual novel > Direct control > Menu structures > Japan (Modern/Futuristic) > Comedy > Licensed","desc":"<p>Sena Kobayakawa has just started attending Deimon Private Senior High School, and he's already getting picked on by bullies. His saving grace is his incredible speed, which he can use to escape sticky situations. Sena's talent is noticed by Yoichi Hiruma, the captain of the school's American football club, and so he forcibly recruits Sena as the team's running back under an alias: Eyeshield 21.</p><p>Although the manga this game is based on, <em>Eyeshield 2</em>1, revolves around American Football, <em>Devilbats Devildays</em> follows the misadventures of Sena and co. while they're off the field. The main game has the player going through text-adventure style paths which lead to different endings as well as playing a variety of mini-games.</p>"}]