[{"name":"F-14 Tomcat","year":2001,"developer":"Virtucraft, Ltd.","url":"a#F.zip/F%2FF-14%20Tomcat%20%28U%29.gba","filesize":1,"score":7,"genres":"Action > Simulation > 1st-person > Shooter > Flight / aviation > Licensed","desc":"<p>One of the Game Boy Advance's launch titles from Majesco (alongside Boxing Fever and Iridion 3D), <em>F-14 Tomcat</em> is essentially a port of Absolute Entertainment's 1994 SNES game Turn and Burn: No-Fly Zone. The game content is exactly the same, but it features a multiplayer mode between other systems (if they have a copy of the game and the GBA Link Cable, of course) and a brand new storyline: the player controls a F-14 pilot chosen by the US government to be assigned in the theater of operations of a war between the republics of China and Taiwan to protect America's \"interests\" in the region.</p><p>The game includes, apart from the previously mentioned multiplayer mode, a landing practice mode, like <em>Turn and Burn</em>. It was later implemented in Majesco's two following GBA flight sims, 2004's Super Hornet F/A-18F and 2007's F24 Stealth Fighter, which re-used this game's engine, with the option of selecting between a landing carrier or a landing strip.</p>"},{"name":"F-Zero: Climax","year":2004,"developer":"SUZAK Inc.","url":"a#F.zip/F%2FF-Zero%20-%20Climax%20%28J%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Anime / Manga > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p><em>F-Zero Climax</em> is a racing game from the <em>F-Zero</em> series. It is similar to its predecessor F-Zero: GP Legend. There are several different game modes and there are 53 tracks in the game. In Grand Prix mode, the player races against 23 other racers in one of four cups (Bronze, Silver, Gold, and Platinum). Each track has three laps, and each cup has different difficulty modes available. In Time Attack, a track is chosen to complete in the shortest amount of time possible. In Survival, the player is given mission-based objectives that must be completed on a track. Multiplayer mode allows two players to race simultaneously. Finally, edit mode allows players to create their own tracks from various track pieces.</p>"},{"name":"F-Zero: GP Legend","year":2003,"developer":"Nintendo R&D1","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/F-Zero%20-%20GP%20Legend%20%28USA%29.zip","filesize":1,"score":7.6,"genres":"Racing / Driving > Behind view > Anime / Manga > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p>The F-Zero series expands another level. The high speed racer has a new set of tracks to master, through  Grand Prix, Time Trial and Challenge modes. You can take to the track as the famed Captain Falcon or many other heroes of the series, including a new character naming himself Rick Wheeler. Four players can also compete against each other using one game pak.</p>"},{"name":"F-Zero: Maximum Velocity","year":2001,"developer":"Nintendo R&D1","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/F-Zero%20-%20Maximum%20Velocity%20%28USA%2C%20Europe%29.zip","filesize":1,"score":7.6,"genres":"Racing / Driving > Behind view > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p>The third title in the F-Zero series is more like the SNES original then the N64 sequel in terms of presentation. Fly around 20 detailed futuristic tracks with many vehicles to choose from. 4 players can play a simple track with the same vehicle using one cart and 4 Game Boy Advances, or play a more detailed 4 player mode with 4 cartridges and GBA's.</p>"},{"name":"F1 2002","year":2003,"developer":"Magic Pockets SAS","url":"a#F.zip/F%2FF1%202002%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>F1 2002</em> is the only entry in Electronic Arts' Formula 1 racing series to appear on the Game Boy Advance. It simulates the 2002 Formula 1 season and features the year's 17 tracks and 11 teams with their 22 drivers.</p><p>The Quick Race game modes offers a single race on any of the game's tracks. Championship mode allows for a customized championship on selected courses. Season 2002 is the main game mode, simulating the entire season. Two-player multiplay via the link cable is also available. </p><p>Before a race, several settings are customizable: automatic or manual gearbox, wet or dry tires, downforce, gearing, brakes, fuel load, pit stop strategy and more. Also, a detailed map of each course suggest recommended speeds and gear settings for each curve and chicane. Actual gameplay during a race is seen from behind the player's car, with cars displayed as sprites on the textured road.</p>"},{"name":"F24 Stealth Fighter","year":2006,"developer":"Skyworks Technologies, Inc.","url":"7#F24%3B%20Stealth%20Fighter%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Simulation > 1st-person > Flight / aviation > Vehicular combat","desc":"<p>SQUADRON HEADQUARTERS ADVISORY:Intelligence reports indicate that Iran is looking to conduct offensive air operations within the No Fly Zone. As an F24 fighter pilot you must eliminate the enemy, rescue international leaders and secure diplomacy in the Middle East.</p>"},{"name":"Fairly OddParents!, The: Breakin' da Rules","year":2003,"developer":"Helixe","url":"a#F.zip/F%2FFairly%20Odd%20Parents%21%2C%20The%20-%20Breakin%27%20da%20Rules%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Licensed","desc":"<p>Single player, action side-scroller shooter where you must retrieve the lost pages of the Da Rules book and prevent Vicky from ruling the world.</p><p>You control Timmy from the TV show and can wish for Cosmo or Wanda to aid in destruction, including a massive interstellar orbital strike screen clear.  As you wade through legions of enemies, \"poof\"ing them away, you'll fight deadly frogs, Yugopotamians, piranhas, and other foul beasts across more than 30 unique AIs.</p>"},{"name":"Fairly OddParents!, The: Enter the Cleft","year":2002,"developer":"Altron Corporation","url":"a#F.zip/F%2FFairly%20Odd%20Parents%21%2C%20The%20-%20Enter%20the%20Cleft%20%28U%29%20%5BhIRff%5D.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Comedy > Licensed","desc":"<p><em>The Fairly OddParents!: Enter the Cleft</em> is a 2D platformer. It is the very first game based off of <em>The Fairly Oddparents!</em> cartoon series.</p><p>The plot of the game involves Timmy Turner, the show's hero, wishing to meet his favourite comic book character, the Crimson Chin. Cosmo &amp; Wanda, the titular fairy godparents wish him inside of an issue and the game begins. </p><p>The game is a simple 2D platformer, in which Timmy is the only playable character. Timmy, as his alter-ego Cleft the Boy-Chin Wonder, must travel through the various stages to rescue the Chin. There are five worlds, each with four levels, for a total of twenty locations to play through.</p>"},{"name":"Famicom Mukashi Banashi: Shin Onigashima","year":2004,"developer":"Pax Softnica","url":"a#F.zip/F%2FFamicom%20Mini%20-%20Vol.%2026%20-%20Famicom%20Mukashi%20Banashi%20-%20Shin%20Onigashima%20Zenkouhen%20%28J%29.gba","filesize":1,"score":"","genres":"Adventure > Side view > Fixed / flip-screen > Menu structures > Fantasy","desc":"<p><em>Famicom Mukashibanashi: Shin Onigashima</em> is a Famicom Disk System text adventure game. The plot revolves around an elderly couple with no children who adopt an infant boy and girl. When the children turn six, a dragon appears in the country, and starts turning people into Oni who steal the souls of others. The Oni arrive at their home and steal the elderly couple's souls. The children decide to save their adoptive parents.</p><p>The game is controlled by selecting commands such as the \"Change Character\" command, which allows you to switch between controlling Donbe (the boy) and Hikari (the girl). The game progress is shown by changes in the in-game graphics. The Famicom Disk System version comes on two disks released on different dates. Disk 2 cannot be played without completing Disk 1, and is switched while the system is still powered on. All later releases are switch-free.</p>"},{"name":"Famicom Tantei Club Part II: Ushiro ni Tatsu Shojo","year":2004,"developer":"Nintendo R&D1","url":"a#F.zip/F%2FFamicom%20Mini%20-%20Vol.%2028%20-%20Famicom%20Tantei%20Club%20Part%20II%20-%20Ushiro%20ni%20Tatsu%20Shoujo%20Zenkouhen%20%28J%29.gba","filesize":1,"score":"","genres":"Adventure > 1st-person > Puzzle elements > Detective / mystery","desc":"<p>As a young detective (whom you name yourself), you work as an assistant for the famous investigator Utsugi. Your first important assignment is to investigate a murder case. A girl named Yoko was found murdered near a central bridge. During the investigation, you discover a strange rumor about a mysterious ghost-like \"girl who stands at the back\", spread around the school Yoko studied at. Soon the young detective realizes that the case grows more and more complex and that he will need all his wit and talents to find the criminal!</p><p>This adventure game is dedicated entirely to investigation. You have a menu with various choices (Talk, Investigate, Think), as well as multiple topics to ask the suspects about. You should find clues by questioning people and gathering information, but also by examining areas - in certain places you should move a hand-like cursor over the screen and click on a precise spot to examine it.</p>"},{"name":"Famicom Tantei Club: Kieta Kokeisha","year":2004,"developer":"Nintendo Co., Ltd.","url":"a#F.zip/F%2FFamicom%20Mini%20-%20Vol.%2027%20-%20Famicom%20Tantei%20Club%20-%20Kieta%20Koukeisha%20Zenkouhen%20%28J%29.gba","filesize":1,"score":"","genres":"Adventure > Anime / Manga > Detective / mystery","desc":"<p><em>Famicom Tantei Club: Kieta Kōkeisha</em> is a text adventure game. The protagonist is found on the ground near a cliff by a man named Amachi. The protagonist can't remember anything, and finds that he has amnesia. After some rest, he returns to the cliff and meets a young girl, who informs him that he is an assistant detective investigating the death of someone named Kiku Ayashiro. He heads over to the Ayashiro estate, learning that in the village there is a saying that the dead will come back to anyone who attempts to steal the Ayashiro family's fortune. As he keeps investigating, he learns that there may be a connection between this legend and the serial killings in the village.</p><p>The game has a horror movie-like atmosphere. Actions are controlled by selecting text commands like interrogate, examine, or move. The Famicom Disk System version comes on two disks released on different dates. All later releases have both parts in one release.</p>"},{"name":"Family Tennis Advance (J)","year":2002,"developer":"Natsume Co., Ltd.","url":"a#F.zip/F%2FFamily%20Tennis%20Advance%20%28J%29.gba","filesize":1,"score":"","genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p><em>Family Tennis Advance</em> for Game Boy Advance supports one up to four players via cable connection (supporting Game Boy Advance, Game Boy Advance SP, Game Boy Micro or GameCube with Game Boy Player).</p><p>Game features several modes which can be selected from the main menu:</p><ul><li>Exhibition Match - single match mode (with connection cable, four players can play with only one game cartridge)</li><li>Tournament - participation in various tournaments which become gradually available (Namco Open being the default one)</li><li>Challenge - plays four random events after which you get graded and evaluated</li><li>Training - practice mode where you can test serving balls, shooting balls, etc.</li></ul>"},{"name":"Fantastic 4","year":2005,"developer":"Torus Games Pty. Ltd.","url":"a#F.zip/F%2FFantastic%204%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Isometric > Beat 'em up / brawler > Puzzle elements > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>Fantastic 4</em> is based on the 2005 film of the same name starring Marvel's classic superheroes. It adapts the film in the form of a beat'em up/brawler seen from an isometric perspective. The player controls the Fantastic Four (usually only two, but sometimes all four at the same time) and can switch between them at will, with each of the heroes having different attacks they use to fight minions and boss enemies. The Four also have distinct special abilities that are utilized for slight puzzle elements, with a color-coded prompt usually indicating which hero's power is necessary to overcome an obstacle. Besides Dr. Doom (the main villain of the film), the game includes additional storylines featuring other villains from the comics.</p>"},{"name":"Fantastic 4: Flame On","year":2005,"developer":"Torus Games Pty. Ltd.","url":"a#F.zip/F%2FFantastic%204%20-%20Flame%20On%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p>Four space pilots - Reed Richards, Sue and Johnny Storm and Ben Grimm - voyage into space on what should have been a routine trip. But their ship is hit by cosmic rays, and when they return to planet Earth, they are placed in quarantine. Johnny discovers that he now has the ability to engulf himself in flames and become the Human Torch!</p><p><em>Fantastic 4: Flame On</em> is a side-scrolling platformer for the Game Boy Advance where players exclusively control Johnny Storm - aka The Human Torch. As The Human Torch, he has an assortment of moves, ranging from flaming dashes, fiery punches, throwing fireballs, and even special moves such as the Supernova and the Inferno. Special moves can only be activated when the special gauge is full enough - it fills as you destroy enemies.</p><p>Players must fight through levels filled with the Fantastic 4's trademark enemies - the Skrulls. As you travel through levels, there are crystals to collect for extra points, as well as imprisoned people which the Skrulls have captured.</p>"},{"name":"Fear Factor: Unleashed","year":2004,"developer":"DC Studios, Inc.","url":"a#F.zip/F%2FFear%20Factor%20Unleashed%20%28U%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > 2D scrolling > Fixed / flip-screen > Mini-games > Direct control > Contemporary > Licensed","desc":"<p><em>Fear Factor: Unleashed</em> is a game based on the US stunt/dare TV game show <em>Fear Factor</em> that initially ran on NBC from 2001 to 2006. The shows pits contestants against each other in a variety of stunts for a grand prize. In this adaptation a character is created at the start with minor customizability options (hair colour, skin tone and costume colour) and twenty skill points to distribute over four statistics that influence the performance: nerve, stamina, steadiness and stomach. A random type of fear is also assigned to the characters, such as acrophobia, claustrophobia, herpetophobia, tachophobia etc. The character then gets to compete in twelve mini-games based around stunts.</p><p>The main game modes are Custom, Fear Factor, Multiplayer and Practice. Each game starts with a brief explanation of the stunt and the controls that are used. One example is The Pit and the Pendulum. In a fixed screen environment shown from a side view a character is tied up near the bottom of the screen while a swinging axe descends slowly. The player needs to balance a fear meter to keep it steady while opening a lock by moving a shaft and locking barrels. In single-player the character competes against five other contestants who each get their turn with a time to beat. In another challenge, Gross Out Buffet, the character needs to gobble down Madagascar cockroaches. Examples of other challenges are Creepy Conveyor Belt (move maggots between conveyor belts using your mouth), Helicopter Havoc (use ropes to jump between helicopters in flight) and Runaway Train (obstacle course on top of a moving train). The fear meter is a returning element in each mini-game.</p>"},{"name":"FIFA Soccer 06","year":2005,"developer":"Exient Entertainment","url":"a#F.zip/F%2FFIFA%20Soccer%2006%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > Real-time > Direct control > Football (European) / Soccer > Licensed","desc":"<p>FEATURES * New team strategies and improved gameplay tactics deliver a deeper FIFA 06 experience. * Lead your club to glory or sink into obscurity in Season or Career Modes. * Battle rivals in 19 different tournaments as you compete for prestige and honor. * Compete in FIFA 06 Challenges mini-games to unlock new rewards and bonuses.</p>"},{"name":"FIFA Soccer 2003","year":2002,"developer":"Electronic Arts Canada","url":"a#F.zip/F%2FFIFA%20Soccer%202003%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.9,"genres":"Sports > Diagonal-down > 2D scrolling > Isometric > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>Electronic Arts' long-running FIFA soccer series makes its debut on the Game Boy Advance with <em>FIFA Soccer 2003</em>. It offers a selection of teams and modes from the concurrent console version, with simpler controls and traditional two-dimensional graphics.</p><p>The game includes 14 leagues (the same as in the console version minus the Brazilian league), including English Premier League, German Bundesliga, Spanish Primera División, Italian Serie A and North American Major League Soccer. In addition, there are 16 teams from the rest of the world (down from 40 in the console version) and 40 international teams. There is a license for real player names, with leagues and rosters based on the 2002-2003 season.</p><p>The teams can be used in friendly matches, two-player games via link cable and a number of competitions. These include league play for all of the included leagues, Club Championship (a league of the top 18 European clubs), EFA Trophy (akin to the real-world UEFA Cup, but without license) and European Champions Cup (akin to real-world UEFA Champions League, but without license). Competition progress is stored to battery-backed RAM, with two slots available.</p><p>Gameplay is seen from an angled overhead view parallel to the sidelines. Controls allow for lobs, kicks and passes on the offensive, and conservative and hard tackles on defense, with a sprint toggle also available. Selectable options include various skill levels (separately for team and goalkeeper), extra time (with Golden Goal option), as well as weather and wind conditions.</p>"},{"name":"FIFA Soccer 2004","year":2003,"developer":"Exient Entertainment","url":"a#F.zip/F%2FFIFA%20Soccer%202004%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.3,"genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p><em>FIFA Soccer 2004</em> marks the second appearance of the soccer series on the Game Boy Advance. It is very similar to its immediate predecessor, with many of the same teams, modes and options, but also some new additions.</p><p>The number of included leagues has been increased to 16, with the Dutch and Portuguese leagues added. The number of teams from the rest of the world has increased to 24, while the number of international teams has decreased to 37.</p><p>Game modes still include friendlies, two-player link cable play, and several competitions. There is league play for all included leagues, the returning EFA Trophy and European Champions Cup (UEFA Cup and UEFA Champions League without license, respectively) and three new additions: Americas Club Championship (pitting North, Central and South American clubs against each other), and International Cup (akin to the real-life World Cup) and a Ladder Tournament. The three new competitions must be unlocked however by connecting to the the GameCube version of the game.</p><p>Actual gameplay has changed ony little: the same overhead, two-way scrolling perspective is used as are the same controls.</p>"},{"name":"FIFA Soccer 2005","year":2004,"developer":"Exient Entertainment","url":"a#F.zip/F%2FFIFA%20Soccer%202005%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":7.6,"genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p><em>FIFA Soccer 2005</em> is the third appearance of the soccer franchise on the Game Boy Advance. It comes with many changes compared to its predecessor, with new modes, more teams, new control options and a new graphics engine.</p><p>All included leagues from the predecessor return, with several additions: Brazil and Mexico, plus lower-tier leagues from England, Germany, France, Italy and Spain. There are 12 \"rest of the world\" teams as well as 39 international teams.</p><p>Returning game modes are friendlies, link cable multiplayer, league play, and several tournaments: Americas Club Championship, International Cup and Ladder Tournament. Newly added competitions are the national cups of 16 of the included leagues. Making its first appearance on the GBA (after having been part of the console versions since FIFA 2004) is the career mode: in this mode, players take control of a single club for up to five seasons, taking the club to national and international heights. Each season has its own goals that must be met. Meeting certain conditions in games played awards manager prestige points, which result in a star rating which will improve the squad's performance.</p><p>An exclusive feature not seen in the console versions are the challenges. There are comeback challenges and rout challenges, each presenting a certain situation from a real game, asking the player to recreate or improve upon the real results. Playing through all pre-set challenges unlocks the custom challenge editor, which allows the player to create any situation.</p><p>The game employs a new 3D graphics engine that allows for variable camera perspectives. During normal gameplay, an overhead view similar to those of the previous games is maintained, but there is a choice of three different zoom levels. Penalties, corner kicks and instant replays place the camera in appropriate spots.</p><p>Controls have become more complex with the addition of the left shoulder button as a modifier, which allows for through ball and 1-2 pass plays on offense and last man back and goalkeeper charges on defense.</p>"},{"name":"FIFA World Cup: Germany 2006","year":2006,"developer":"Exient Entertainment","url":"a#F.zip/F%2FFIFA%20World%20Cup%202006%20%28U%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p>YOUR DREAM. YOUR FIFA WORLD CUP.<br>* The officially licensed video game of the 2006 FIFA World Cup Germany.<br>* Carry teams through all six qualifying zones all the way to the FIFA World Cup Final.<br>* Featuring realistic ball movements and behavior for the first time on the Game Boy Advance.<br>* Unlock special posters by completing more than 126 tasks in Global Challenge mode.</p>"},{"name":"FightBox","year":2004,"developer":"Gamezlab","url":"a#F.zip/F%2FFightBox%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Direct control > Licensed","desc":"<p>Build a hero. Create a legend.<br>Are you ready to fight for immortality?<br>For you who now enter FightBox, we salute your dedication, skill and valour.<br>This is your chance to re-live the FightBox TV experience...<br>Build and nurture a warrior to take on your opponents, including the mighty Sentients, in a battle of skill, strength and agility!<br>Features: * 12 tournaments across 4 difficulty levels * 6 eliminator games, and TV's Showdown fight * FightShop - build your own warrior * 2 player turn-based tournaments</p>"},{"name":"Fila Decathlon","year":2002,"developer":"Athletic Design AB","url":"a#F.zip/F%2FFILA%20Decathlon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.gba","filesize":1,"score":6.8,"genres":"Sports > Side view > 2D scrolling > Athletics > Licensed","desc":"<p><em>Fila Decathlon</em> is a sports game similar to Track &amp; Field where the player gets to compete in all ten events of decathlon (100 metres, long jump, shot put, 400 metres, 110 metres hurdles, discus throw, pole vault, javelin throw and 1500 metres). Like previous games in the genre, the gameplay involves large amounts of button mashing, but with added complexity.</p><p>In all events running is done by alternatively pressing the a and b buttons. In the running events, rising at the start and dipping at the end is done with the d-pad. In 1500 meters the d-pad is used to chance lane and to a fast rush. In the jumping events the d-pad is used to do the jump. To make a good jump the player first has to press down and then quickly up. The shorter the time this is done in, the higher or longer the jump will be. In these events the player also has to pick an optimal starting position. In discus throw and shot put the player has to press b quickly to gain horizontal speed and then a to gain vertical speed. Pressing a too long will lead to an over step. In javelin throw the player has to press left to draw the javelin back, then press down to minimize speed loss, and finally press right twice to make the throw. </p><p>There are three game modes: championship, practice and multiplayer. In the championship the player plays all the events in the right order, while in practice the player is taught how to play them.</p>"},{"name":"Final Fantasy I & II: Dawn of Souls","year":2004,"developer":"Square Enix Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Final%20Fantasy%20I%20%26%20II%20-%20Dawn%20of%20Souls%20%28USA%29.zip","filesize":1,"score":7.3,"genres":"Compilation > Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Final Fantasy I &amp; II: Dawn of Souls</em> is a re-release of the two remakes of the original Famicom (NES) games with additional extras. This release also reduces the difficulty level of both games and has a few other gameplay modifications (for example, stats can no longer decrease in <em>Final Fantasy II</em>).</p><p><em>Final Fantasy I</em> features four \"Soul of Chaos\" dungeons, unlocked during the course of the plot. These elemental dungeons are for high-level players, and contain a collection of bosses taken from later <em>Final Fantasy</em> games. <em>Final Fantasy II</em> includes an extra storyline known as the \"Soul of Rebirth.\" This mode is unlocked after completing the game and acts as an epilogue, featuring characters killed off in the main story. Both games gain a bestiary that tracks all the monsters the player has fought and their stats and weaknesses.</p>"},{"name":"Final Fantasy II","year":2005,"developer":"Square Co., Ltd."},{"name":"Final Fantasy III","year":2006,"developer":"Square Co., Ltd."},{"name":"Final Fantasy IV Advance","year":2005,"developer":"Square Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Final%20Fantasy%20IV%20Advance%20%28USA%29.zip","filesize":1,"score":8.2,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Real-time > Turn-based > Fantasy","desc":"<p><em>Final Fantasy IV</em> is a remake of the classic Japanese RPG that was first released for SNES, known as  Final Fantasy II in the West. </p><p>Unlike the many subsequent ports (to Playstation, GameBoy Advance, etc.), this release is a full remake, programmed from scratch with real-time 3D graphics. The characters have a \"super-deformed\" touch. There is also voice acting during cut-scenes. A new option has been added to the menu, which allows the player to read a conversation between party members and receive advice from them.</p><p>It also features many gameplay additions. The difficulty level has been increased, not only beyond the difficulty of the Western SNES release (which was reduced compared to Japanese original and subsequent ports), but even beyond the original difficulty. The party members are still bound by class, but they can now hunt for so-called \"augments\", which can be found or stolen from enemies and which grant the characters additional bonus abilities, resistances, spells that their class would normally not allow, etc. </p><p>Beside those major changes, there are also plenty of minor additions. It is possible to obtain bonus items after exploring every corner and filling 100% of an area map; Rydia, the summoner girl, has a new monster summon who can be customized in various ways; there is a new quest involving the \"naming\" moogle of the original game, etc.</p>"},{"name":"Final Fantasy Tactics Advance","year":2003,"developer":"Square Enix Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Final%20Fantasy%20Tactics%20Advance%20%28USA%29.zip","filesize":1,"score":8,"genres":"Action > Role-playing (RPG) > Strategy > Isometric > Turn-based > Tactical RPG > Fantasy","desc":"<p>Marche and a few friends are out on a usual venture through their local town, St. Ivalice, only to discover a book filled with fantasy and magic. Setting their mind to the thoughts of a magical land, they get transported to the world of Ivalice, which happens to be based on one of the friends' favourite games, Final Fantasy.</p><p>Finding himself alone, Marche must join a clan of warriors and travel through this new land of mystery to find his lost friends, and return to the real world, while learning all about this new place and the magic it holds.</p><p>Not a direct sequel to Final Fantasy Tactics, FFTA combines the many elements of the tactical original with a slightly modern feel, and an original storyline for the GBA. As a clan leader, you must manage your team (from their combat skills and inventory to each and every battle you face).</p><p>Both your basic handheld weapons and magic are available to you, with the ability to summon monsters for support. Two players can link GBA's for battles, trading items and clan members as well.</p>"},{"name":"Final Fantasy V Advance","year":2006,"developer":"Square Enix Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Final%20Fantasy%20V%20Advance%20%28USA%29.zip","filesize":1,"score":8.1,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Anime / Manga > Real-time > Turn-based > Japanese-style RPG (JRPG) > Direct control > Menu structures > Fantasy","desc":"<p>This version of Final Fantasy V for Game Boy Advance, also ported to iOS, has, much like Final Fantasy I and II, updated graphics and features some additional content. Not only does it have four new jobs (Gladiator, Cannoneer, Necromancer, and Oracle), but it also has a new 30-floor dungeon called the Sealed Temple and an optional boss designed by Tetsuya Nomura, Enuo. The game also has a bestiary and a music player. Quick-save is now available and some new equipment can be found.</p>"},{"name":"Final Fantasy VI Advance","year":2006,"developer":"Square Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Final%20Fantasy%20VI%20Advance%20%28USA%29.zip","filesize":1,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>The original FINAL FANTASY VI comes to life with completely new graphics and audio as a 2D pixel remaster!<br>A remodeled 2D take on the sixth game in the world-renowned FINAL FANTASY series! Enjoy the timeless story told through charming retro graphics. All the magic of the original, with improved ease of play.<br>The War of the Magi caused magic to disappear from the world. A thousand years later, humanity relies on machines - until they find a young woman with mysterious powers. The magicite system allows players to customize which abilities, magic spells, and summons the party members learn. All the playable characters have their own stories, goals, and destinies. Journey through their interwoven fates in this sweeping melodrama.<br>Revisit the critically acclaimed FFVI!</p>"},{"name":"Final Fight One","year":2001,"developer":"Capcom Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Final%20Fight%20One%20%28USA%29.zip","filesize":1,"score":7.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Regional differences","desc":"<p><em>Final Fight One</em> is an enhanced port of the SNES version of Final Fight, or more specifically the <em>Final Fight Guy</em> version.This particular port of the game seemed to be aimed at fixing most of the SNES versions shortcomings while also making its own additions.</p><ul><li>All three characters are now playable</li><li>Contains a two player co-op mode via link cable</li><li>Restores the Industrial Area stage which was cut out of the SNES version</li><li>Added dialogue scenes prior to boss battles</li><li>Street Fighter Alpha 3 renditions of Cody and Guy are featured as hidden playable characters</li><li>Alternate palettes for each player character</li><li>The ability for two players to use the same character</li><li>The ability to save inbetween levels</li><li>While the enemy placement is similar to how it was setup in <em>Final Fight Guy</em>, the number of simultaneous enemies on screen was increased</li><li>The power-ups introduced in <em>Final Fight Guy</em> also make an appearance here, with this version of the game also introducing a new Cody 1-Up doll item</li><li>Adds a rapid punch ability</li></ul>"},{"name":"Fire Emblem","year":2003,"developer":"Intelligent Systems Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Fire%20Emblem%20%28USA%2C%20Australia%29.zip","filesize":1,"score":8.2,"genres":"Role-playing (RPG) > Strategy > Top-down > Turn-based > Fantasy","desc":"<p>The rightful heir to the throne of Rikea is finally returning home after many years lost to her people. But before the celebrations can begin, you must first guard her through the evil lands that await before you, by taking charge of an elite group of soldiers possessing skills unlike any other.</p><p>The first Fire Emblem title to be released outside of Japan includes an all new quest featuring a selection of warriors, wizards and dragons (both good and bad). Battle through turn-based environments and choose your moves wisely, as those you lose during a fight will be lost for good.</p>"},{"name":"Fire Emblem: The Binding Blade","year":2002,"developer":"Intelligent Systems Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Fire%20Emblem%20-%20The%20Binding%20Blade%20%28Japan%29%20%5BT-En%20by%20Dark%20Twilkitri%20Net%20Translation%20Division%20v2.1%5D%20%5BAdd%20by%20Gringe%20v1.1.3%5D%20%5Bn%5D.zip","filesize":1,"score":"","genres":"Role-playing (RPG) > Strategy > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Fire Emblem: Fūin no Tsurugi</em> is the sixth entry in the Fire Emblem series, and its first handheld installment. The events of the game take place twenty years after those of Fire Emblem: Rekka no Ken. The player takes control of Roy, the son of Eilwood, one of the main protagonists from <em>Rekka no Ken</em>. He is the prince of Pherae, and while going outside with a few of his knights, his castle is being attacked by bandits. </p><p>The gameplay is similar to the previous games in the series, allowing the player to control a growing army of characters of various classes and fight enemies in large-scale tactical battles taking place on tile-based maps.</p>"},{"name":"Fire Emblem: The Sacred Stones","year":2004,"developer":"Intelligent Systems Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Fire%20Emblem%20-%20The%20Sacred%20Stones%20%28USA%2C%20Australia%29.zip","filesize":1,"score":8.1,"genres":"Role-playing (RPG) > Strategy > Top-down > Turn-based > Fantasy","desc":"<p>Eight hundred years ago, the sacred stones were used to defeat the Demon King. Sealing his soul inside the stones, peace was brought to the continent of Magvel and five nations were built around the power of the sacred stones.</p><p>However, after 800 years of peace, the Grado Empire suddenly attacks his longtime ally Renais and a larger war threatens to break out. The player takes on the role of Prince Ephraim and his sister Princess Erika, two of the few survivors of Grado's attack, following their different paths through the story. </p><p>Gameplay in Fire Emblem: The Sacred Stones is similar to its predecessors or the Advance Wars games. The player controls several different units in tactical turn-based battles. </p><p>There are many different classes ranging from knights, thieves and archers to paladins, wyvern riders, great knights and more. As in RPGs, units receive experience points for their actions and may choose to upgrade to a different class once they reach a high enough level.</p><p>A key element in Fire Emblem's gameplay are the three different types of weapons and magic. One type of weapon or magic is always strong against one, and weak against another type.</p><p>During battles, it is also possible to visit stores to buy equipment, or houses to gain hints.</p><p>Sometimes neutral units will also participate in battle. They can be convinced to join the player's army if the right person talks to them.</p><p>Unlike most similar games, when a unit dies in battle it is impossible to revive it.</p>"},{"name":"Fire Hoops","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Fire Pro Wrestling","year":2001,"developer":"Human Entertainment, Inc.","url":"a#F.zip/F%2FFire%20Pro%20Wrestling%20A%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":6.6,"genres":"Sports > Isometric > Fighting > Wrestling","desc":"<p>The first North American release of the Fire Pro Wrestling series comes to the Game Boy Advance.</p><p><em>Fire Pro Wrestling</em> has a stacked roster, comprised of many not-quite-copyright-infringing wrestlers like \"The Bionic Man\" Steve Majors (\"Stone Cold\" Steve Austin) and Axe Duggan (Hulk Hogan), making WCW vs. WWF vs. ECW matches possible. The controls are much more than the typical \"mash buttons until something happens\" that were so popular in earlier wrestling games, instead relying on timing to properly execute a move or hold.</p>"},{"name":"Fire Pro Wrestling 2","year":2002,"developer":"Spike Co., Ltd.","url":"a#F.zip/F%2FFire%20Pro%20Wrestling%202%20%28U%29.gba","filesize":1,"score":7.6,"genres":"Sports > Isometric > Fighting > Wrestling > Martial arts","desc":"<p>In this second version of the Fire Pro series in the GBA over 200 wrestlers are available, with the usual CAW mode allowing to increase that number by 77. Along the Practice Dojo and the Exhibition match, the main mode is the Ironman road, where the initial roster of 10 wrestlers (11 once you finish training mode) is expanded as you beat your opponents one by one. Both Exhibition and Ironman Road feature match kinds such as Gruesome and Deathmatch (inside a electrified cage) with all assorted rule changes included. There's also the ability to play in a four-man Battle Royal.</p><p>The CAW mode, one of the selling points of the original SNES titles, is as good as ever, allowing to create Wrestlers from scratch, personalizing them from how they look to how they fight, as well as trading them between federations.</p>"},{"name":"Flappy Bird","year":2014,"developer":""},{"name":"Flintstones; The: Big Trouble in Bedrock","year":2001,"developer":"H2O Entertainment Ltd.","url":"a#F.zip/F%2FFlintstones%2C%20The%20-%20Big%20Trouble%20in%20Bedrock%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6,"genres":"Action > Side view > 2D scrolling > Platform > Prehistoric > Licensed","desc":"<p>This game features Bedrock's beloved Fred Flintstone himself in an adventure of traditional platform challenges, brought to life through the sharp and colorful graphics of the Game Boy Advance. Fred must save his best pal Barney Rubble from the clutches of the evil Dr. Sinister. To get to Barney before its too late, Fred must make use of special stone-age items like a club and his bowling ball. He'll also need the help of friends like Wilma, Dino, and several other characters from the classic cartoon series.</p>"},{"name":"Flower Power","year":2001,"developer":"Nintendo Co., Ltd."},{"name":"Follow Hoothoot","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Ford Racing 3","year":2005,"developer":"Visual Impact","url":"a#F.zip/F%2FFord%20Racing%203%20%28E%29%20%28M5%29.gba","filesize":1,"score":5.8,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>The handheld versions of Ford Racing 3 allow players to race in a number of Ford-licensed cars, from classics (Model T) to new models (2005 Mustang GT), cars from movies, off-road trucks and even concepts vehicles such as the Mustang GT-R Concept.</p><p>From the main driver profile where all statistics are recorded, players can do a quick race of one of the three competitions: Ford Competition, Ford Challenge and Ford Collection. Most of the game's features need to be unlocked first. Next to the regular racing controls there is also a button used for boost. The different competitions offer ten racing types:<em> </em>Standard*: race for the first place.</p><ul><li><p><em>Elimination</em>: race five opponents over three laps. After the first and the second lap, the last two cars are knocked out and a duel ensues in the final lap.</p></li><li><p><em>Duel</em>: a 3-lap race against six challengers in succession. After each won lap, a new one starts.</p></li><li><p><em>Drafting</em>: stay in the opponent's slipstream to raise a power bar.</p></li><li><p><em>Driving Skills</em>: race against the time and keep the timer going by passing through gates that award time bonuses.</p></li><li><p><em>Seconds Out</em>: race against the time while collecting bonuses.</p></li><li><p><em>Time Attack</em>: a straightforward timed race.</p></li><li><p><em>Boost</em>: race with two boosts per lap.</p></li><li><p><em>Relay</em>: transfer a baton three times around the track.</p></li><li><p><em>Overtake</em>: overtake a number of vehicles before time runs out.</p></li></ul>"},{"name":"Fortress","year":2001,"developer":"Pipedream Interactive, Inc.","url":"a#F.zip/F%2FFortress%20%28E%29.gba","filesize":1,"score":6.6,"genres":"Puzzle > Side view > Falling block puzzle","desc":"<p><em>Fortress</em> is a Tetris-variant puzzle game. As in that classic game, geometric pieces fall from the top of the screen and must be arranged in lines. Only instead of eliminating lines, the objective this time is to add them to the screen. The game starts with a timer (that counts a moment where neither player attack) and a castle gate falling between two flags (the opponent's flags can be seen to the left of the screen). Once placed, the remaining pieces are used to build a castle around it, as every 2x3 grid of pieces transforms into its walls. A grid of 8x3 pieces transforms into a wizard's tower that can summon a creature to attack the enemy castle. </p><p>Certain special blocks add features to the building: a cannon block places a shooting cannon that starts to attack automatically the opponent's fortress. A block with a window adds one to the building. Repairing peons come out of it to help fix the damage to the castle's walls. A block with a bomb adds a cannon that fires a peon towards the opponent's castle (an aiming reticule is shown over the enemy castle to help choose the right spot). Building walls around these special blocks prevent their destruction from the enemy attack. A monster appears randomly at the bottom of the screen to attack both players.</p><p>The player's goal at each level is to reach a number of score points before the opponent. The pieces can be maneuvered with the digital pad, and pressing <strong>UP</strong> on it makes them fall fast downwards. They can be rotated clockwise and anti-clockwise with the <strong>A</strong> and <strong>B</strong> buttons, respectively. Holding the <strong>R</strong> trigger allows the player to move the screen with the digital pad (for a full view of battle scene). When pressed, the <strong>L</strong> trigger destroys the top 3 rows of your castle and decreases the score.</p><p>The game has three game modes: tournament, battle and blitz. They vary in the amount of seconds on the timer and the goal score. There are four themes: pre-historic, medieval, pirate and space.</p>"},{"name":"Foster's Home for Imaginary Friends","year":2006,"developer":"Collision Studios","url":"a#F.zip/F%2FFoster%27s%20Home%20for%20Imaginary%20Friends%20%28U%29.gba","filesize":1,"score":"","genres":"Adventure > Side view > Platform > Puzzle elements > Licensed","desc":"<p><em>Foster's Home for Imaginary Friends</em> is based on the animated series of the same name on Cartoon Network, created by Craig McCracken (who is also the creator of The Powerpuff Girls).</p><p>The game features the somewhat shy Mac and his imaginary friend, Bloo (Blooregard Q. Kazoo). The game is inspired by memorable episodes from the Cartoon Network hit series and allows fans to control Mac and Bloo as they solve quirky challenges and complete mission objectives. The action takes place in and around Foster's Home for Imaginary Friends and features many of the signature characters from the show including Wilt, Eduardo, Coco and many more.</p>"},{"name":"Franklin's Great Adventures","year":2006,"developer":"Otaboo","url":"a#F.zip/F%2FFranklin%27s%20Great%20Adventures%20%28U%29%20%28M3%29.gba","filesize":1,"score":"","genres":"Educational > Diagonal-down > Side view > 2D scrolling > Puzzle elements > Licensed","desc":"<p>This is an educational game for children under 8 years old starring Franklin the Turtle from the Canadian animated TV series Franklin.  Kids can play as three playable characters: Franklin, Bird, or Bear.  Over the span of three episodes the three friends help the townspeople in various ways. The game features 8 levels mixing exploration and puzzles with quick-reflex action, and you can change your character at any time strategically to better solve the puzzles presented.  Additionally, there are 16 unlockable mini-games.</p>"},{"name":"Frogger Advance: The Great Quest","year":2002,"developer":"Team Angry Robot","url":"a#F.zip/F%2FFrogger%20Advance%20-%20The%20Great%20Quest%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.2,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>This side-scrolling game brings Frogger to the GBA in a quest to be united with the princess in hopes of becoming a prince (the old princess kissing the frog story). This game follows the same story as the PS2/Windows version, but is a platform instead of first person. Your main goal through each level is to avoid all the monsters you will find as well as avoid the many dangerous obstacles.</p><p>The game includes both land and underwater levels for a total of 16 levels in 4 worlds, with over 20 different enemies to face. There are also bonus levels that can be found.</p><p>As your work your way through the levels, Frogger will gain various special abilities such as being able to float or jump to really high areas. These abilities allow Frogger to get through the more difficult levels.</p>"},{"name":"Frogger's Adventures 2: The Lost Wand","year":2002,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"a#F.zip/F%2FFrogger%27s%20Adventures%202%20-%20The%20Lost%20Wand%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Puzzle elements","desc":"<p>The Eternity Wand has been broken and Hocus has come to ask Frogger to find the 5 Magic Shards to repair the wand.  Frogger, always enjoying adventure, heads off to different islands to find the shards.</p><p>On your journey, you can pick up extra lives and can open bonus levels.  There are classic Frogger areas (such as jumping across logs on a river) and new types of areas for Frogger to travel.</p><p>Work your way through the islands to find the five shards without falling or getting squashed.  Unless you can find the five shards to restore the wand, magic will become wild.  You see an example of what is in store for the world in the introduction as your TV remote suddenly pops flowers out of it when you try to use it.</p>"},{"name":"Frogger's Adventures: Temple of the Frog","year":2001,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"a#F.zip/F%2FFrogger%27s%20Adventures%20-%20Temple%20of%20the%20Frog%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.9,"genres":"Action > Top-down > Platform","desc":"<p>Frogger's home, Firefly Swamp, is in great danger.  The nefarious Mr. D has stolen the 4 elements, water, fire, wind, and air.  Without these, Firefly Swamp will die.  </p><p>Frogger must travel through 15 levels within 5 worlds to retrieve the elements. Once he has the elements, Frogger can enter the Temple of the Frog and put the kibosh on Mr. D.</p>"},{"name":"Frogger's Journey: The Forgotten Relic","year":2003,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"a#F.zip/F%2FFrogger%27s%20Journey%20-%20The%20Forgotten%20Relic%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":6.5,"genres":"Action > 3rd-person (Other) > Isometric > Puzzle elements","desc":"<p>Your grandpa is an archaeologist who has found something important, but was unable to find the final piece.  Knowing that you love being at the dig sites, he has send Griffin to fly you to him to help find the missing piece.</p><p>Arriving at the town near the site, you find that your grandpa is missing and are asked to look for him.  Your journey has begun.  What will you find on your journey?  What relics will you come across?</p><p>Learn new skills as you go through the game and use them to help you complete your journey.</p>"},{"name":"Fruits Daisakusen!","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Fushigi no Kuni no Angelique (J)","year":2002,"developer":"KOEI Co., Ltd.","url":"a#F.zip/F%2FFushigi%20no%20Kuni%20no%20Angelique%20%28J%29.gba","filesize":1,"score":"","genres":"Strategy > Top-down > Anime / Manga > Board game > Fantasy","desc":"<p>This game is a variation on the  Angelique story: an ordinary school girl named Angelique becomes involved in a struggle to become the Queen of Cosmos, for which it is necessary to befriend the handsome and powerful Guardians of the Elements. The game features the same world and graphics as  Angelique Special, with a slightly different story: Angelique falls asleep outside near a tree, and dreams that she fell through a rabbit hole (in an <em>Alice in Wonderland</em> fashion) into the magical land where she encounters her eternal rival Rosalia.</p><p>Unlike other Angelique games, <em>Fushigi no Kuni no Angelique</em> plays like a board game, with the kingdom divided into fields on which Angelique moves. There are no visible dice, but the amount of fields Angelique can walk on is determined randomly by clicking on the \"move\" button. Fields can either be empty, placed inside a location (like Angelique's own room), trigger events, conversations, etc. In some places it is possible to find items, which can then be used on another field to help Angelique advance more quickly, increasing her chances to become the queen.</p>"}]