[{"name":"Gadget Racers","year":2001,"developer":"Electronics Application Co., Ltd.","url":"a#G.zip/G%2FGadget%20Racers%20%28E%29%20%28M3%29.gba","filesize":1,"score":6.9,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p>Race, slide, spin and compete your way to some of the most outlandish accessories this side of Daytona. Gadet Racers offers a variety of tracks including street, off road and even in the water - in a pontoon equipped underwater car right out of a Bond flick! Push your driving skills to the limit, put the pedal to the medal and go, go Gadget Racers!</p>"},{"name":"Galidor: Defenders of the Outer Dimension","year":2002,"developer":"Tiertex Design Studios","url":"a#G.zip/G%2FGalidor%20-%20Defenders%20of%20the%20Outer%20Dimension%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CDa%29.gba","filesize":1,"score":"","genres":"Action > Racing / Driving > Behind view > Side view > Platform > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p>Nick Bluetooth has the ability to transform, allowing him to do some crazy tricks. It's these tricks that Nick needs to use if he's ever going to get his friends back from Gorm, who has taken them into the unknown.</p><p>As Nick, you must travel through the outer dimension and use his ability to transform to jump and fight your way through each level. Hidden items help to increase Nick's power, while 3D racing sequences will keep you on your toes in between the side-scrolling portions of the game.</p><p>You can also add some extra fun with the GBA game by communicating with your Kek Powerizer toy figures, giving you clues and unlocking bonus material in game.</p>"},{"name":"Game & Watch Gallery","year":2002,"developer":"Tose Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Game%20%26%20Watch%20Gallery%204%20%28USA%29.zip","filesize":1,"score":6.9,"genres":"Action > Compilation > Side view > Fixed / flip-screen > Platform > Puzzle elements > Boxing","desc":"<p>A collection of classic Nintendo Game &amp; Watch titles, as well as GBA exclusive updates.</p><p>Games include:</p><ul><li>Donkey Kong 3</li><li>Boxing</li><li>Fire Attack</li><li>Mario Cement Factory</li><li>Rainshower</li><li>Chef</li><li>Mario Bros.</li><li>Donkey Kong</li><li>Octopus</li><li>Fire</li></ul><p>These additional games in classic mode that can only be opened if you beat the high score for each game:</p><ul><li>Manhole</li><li>Tropical Fish</li><li>Mario's Bombs Away</li><li>Parachute</li><li>Bomb Sweeper</li><li>Climber</li><li>Safebuster</li><li>Life Boat</li><li>Zelda</li></ul><p>Each game has two modes, one which emulates the original Game &amp; Watch LCD format and an updated version which features improved graphics, slight gameplay changes and a host of Mario characters.</p>"},{"name":"Game Boy Wars Advance 1+2","year":2004,"developer":"Intelligent Systems Co., Ltd.","url":"a#G.zip/G%2FGameboy%20Wars%20Advance%201%20%2B%202%20%28J%29.gba","filesize":1,"score":"","genres":"Compilation > Strategy > Top-down > Turn-based","desc":"<p>This Japanese-only game combines two games in one cartridge. The games included are <em>Game Boy Wars Advance</em> (known in the west as Advance Wars) and <em>Game Boy Wars Advance 2</em> (known in the west as Advance Wars 2: Black Hole Rising).</p>"},{"name":"Game of Life / Yahtzee / Payday, The","year":2005,"developer":"Black Lantern Studios, Inc."},{"name":"Games Explosion!","year":2006,"developer":"FRONTLINE Studios, Inc.","url":"a#G.zip/G%2FGames%20Explosion%20%28U%29.gba","filesize":1,"score":"","genres":"Compilation","desc":"<p><em>Games Explosion!</em> is a compilation of 16 small games divided into 5 categories.</p><ul><li><strong>Neon</strong></li><li><em>Neon Square</em> - a Pong variant</li><li><em>Sudoku</em> - an adoption of the famous number puzzle</li><li><p><em>Tic Tac Toe</em> - an adoption of the classic pen and paper game</p></li><li><p><strong>Board</strong></p></li><li><em>Checkers</em> - a variant of the classic board game</li><li><p><em>Eliminate</em> - a mastermind variant</p></li><li><p><strong>Cyber</strong></p></li><li><em>Ice Jumper</em> - isometric game where the player has to jump between platforms made of ice without falling off. The screen is constantly scrolling vertically</li><li><em>MC Rudolf</em> - a simple platform game that scrolls vertically. The player has to jump between platforms to gain height</li><li><em>Pizza Man</em> - a Tapper variant where the player serves pizza to robots</li><li><p><em>Warehouse Man</em> - a sokoban variant featuring robots</p></li><li><p><strong>Zap</strong></p></li><li><em>Avoider</em> - a Pang variant</li><li><em>Music Pop</em> - a music game where the player has to press the correct button when the notes reach an orange line</li><li><em>Pipemaster</em> - a Pipe Mania variant</li><li><p><em>Space Shooter</em> - a Space Invaders variant</p></li><li><p><strong>Club</strong></p></li><li><em>Blackjack</em> - the classic card game</li><li><em>Crazy Bowling</em> - a simple bowling game that users different meters for aim, spin and power</li><li><em>Darts</em> - a simple dart game where a pointer is moving constantly and the player has to stop it at the right time</li></ul>"},{"name":"Ganbare Goemon! Karakuri Dōchū","year":2004,"developer":"Konami Industry Co. Ltd."},{"name":"Garfield and his Nine Lives","year":2006,"developer":"Lucky Jump Games LLC","url":"a#G.zip/G%2FGarfield%20and%20His%20Nine%20Lives%20%28E%29%20%28M6%29.gba","filesize":1,"score":5.8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>After having eaten very heavily just before going to bed, Garfield finds himself trapped in a nightmare from which he must escape and where he lives through all of his nine \"lives\".</p><p>The game is a conservative sidescrolling platformer, which is divided into 9 levels. Each level represents one of Garfield's lives (though this implies Garfield has lived an entire life in the sewer and another in a tree...). To get out of level, Garfield must fulfil a goal which is given at the beginning, like finding 10 eggs or getting the key to a door. After three levels, there is always a boss fight. Apart from jumping, Garfield can kick to get rid of his foes, and he can perform a ramming attack and an elbow blow.</p>"},{"name":"Garfield: The Search for Pooky","year":2004,"developer":"InterActive Vision A/S","url":"a#G.zip/G%2FGarfield%20-%20The%20Search%20for%20Pooky%20%28U%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Garfield has lost his Pooky bear and its your job to help find Pooky by controlling Garfield in his search. The search for Pooky will take Garfield through his most known locales, he will meet the other characters (like Jon, Odie, Arlene, etc.), and of course encounter typical Garfield elements like spiders, food, mice, dogs, etc.</p><p>During his search Garfield will inevitably eat food and lots of it of course. In the game food will also represent energy. The more food Garfield eats, the more energy he has to do extraordinary moves. A level plays like a sideway scrolling platform game, though some levels will also scroll up and down to span a larger vertical area. Garfield moves from one side of the screen towards the other and must pick up food and other goodies on the way. At the same time all sorts of obstacles will have to be avoided, such as web spinning spiders, happy Odie rushing towards Garfield, bad food, annoying kids, angry pit-bulls, and more.</p>"},{"name":"Gauntlet / Rampart","year":2005,"developer":"EC-Interactive, Ltd","url":"a#G.zip/G%2FGauntlet%2C%20Rampart%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > Compilation > Top-down > Fantasy","desc":"<p>A compilation of the classic arcade games Gauntlet and Rampart brought onto the Game Boy Advance.</p>"},{"name":"Gauntlet: Dark Legacy","year":2002,"developer":"Pocket Studios","url":"a#G.zip/G%2FGauntlet%20-%20Dark%20Legacy%20%28U%29.gba","filesize":1,"score":5.2,"genres":"Action > Diagonal-down > Isometric > Arcade > Fantasy","desc":"<p><em>Gauntlet: Dark Legacy</em> adapts the arcade/console game of the same name to the Game Boy Advance. It offers simpler gameplay, harkening back to early arcade entries in the Gauntlet series, with unique levels based on a selection of the other versions' themes.</p><p>Players can select from four characters in their quest to defeat the evil sorcerer Garm: archer, wizard, warrior and valkyrie, all with a unique weapon and different ratings in strength, speed, armor and magic. Starting from a hub world, players must fight their way through five different realms: Mountain Kingdom, Castle Stronghold, Desert Lands, Ice Domain and Dream World. Each consists of five levels, with a boss waiting in the final one. Only after all realms have been conquered will the path to the final battle against Garm and the demon Skorne open up.</p><p>The levels are displayed in isometric perspective and are huge and labyrinthine. Gameplay follows the classic Gauntlet template: many monsters have to be destroyed alongside the generators that spawn them while the player looks for the exit. Keys must be found to open doors and gates, food replenishes health and potions give an extra powerful magic attack. Piles of coins lie around and can be picked up, but there is no way to spend the gold as in other versions. Some timed powerups can also be found, including triple and five-way shots, rapid fire, speed boost and a reflective shield. Killing monsters gives experience, with attributes and health increasing automatically on level-up. The game can be saved to cartridge memory in the hub world.</p>"},{"name":"Gekido Advance: Kintaro's Revenge","year":2002,"developer":"Na.p.s. Team s.n.c.","url":"a#G.zip/G%2FGekido%20Advance%20-%20Kintaro%27s%20Revenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Side view > Beat 'em up / brawler > Fantasy","desc":"<p><em>Gekido Advance: Kintaro's Revenge</em> is a 2D beat 'em up game, a continuation of Gekido. The main hero is Tetsuo from the previous game - he returned to his sensei's house and now must liberate the village from demons.Game isn't a standard beat'em up - has nonlinear levels, not just \"go-right\". Often Tetsuo must first find key to doors, or talk to the right people. Rest is simple - he fights against various demons, he can kick, punch and use special magic. Sometimes Tetsuo jumps on narrow platforms. Game has 2D graphic and anime-style cut scenes.</p>"},{"name":"Gem Smashers","year":2003,"developer":"Frame Studios S.r.l.","url":"a#G.zip/G%2FGem%20Smashers%20%28U%29.gba","filesize":1,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Arcade","desc":"<p><em>Gem Smashers</em> is an action puzzle game where the player has to rescue prehistoric creatures captured by a fearsome scientist from outer space. Three creatures, Bau, Bam and Bom have already escaped and the player takes control of these. The game consists of single screen levels that are full of gems in different colours. It's the player's task to destroy these with the use of the little creature that bounces around the screen. The problem is that the creature can only destroy gems of the same colour as itself and therefore it's necessary to hit specific colour changing blocks that may be hidden in a rock that first has to be broken. To make it all a bit trickier there are also death blocks marked by skulls that the player has to avoid hitting. Once all gems have been destroyed an exit opens and the player can move on to the next level. </p><p>The game has a story mode with more than 100 levels, an arcade mode with more than 60 levels and a battle mode for two players via link cable. There are also three special modes that the player can unlock. The story mode consists of a world map where for each section the player can complete the levels in any order. Each section ends with a boss fight. Depending on which of the creatures the player chooses to play as he will start at different sections. The arcade mode has a more linear level structure.</p>"},{"name":"Genso Suikoden: Card Stories","year":2001,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"a#G.zip/G%2FGensou%20Suikoden%20Card%20Stories%20%28J%29.gba","filesize":1,"score":"","genres":"Strategy > 1st-person > Top-down > Anime / Manga > Turn-based > Cards / tiles > Trading / collectible card > Fantasy","desc":"<p>Set in the <em>Suikoden</em> universe, the game closely follows the story of Suikoden II. The hero is a young member of the Unicorn Brigade of the Highland Army. One night, your camp is attacked. You and your best friend Jowy escape, and the fate takes you into different directions, when you get involved in a war between several nations.</p><p>Unlike the main Suikoden games, <em>Gensō Suikoden Card Stories</em> is a card-based RPG. Most of the game is spent playing a special card game with your opponents. The complex card game is not unlike a strategy battle: you have three types of cards, some of which take you to a specific \"mission\" (you open the game with such cards), while others represent various characters with different strengths and weaknesses. You can acquire cards in shops, get them from your opponents, and also look for them in randomly generated dungeons.</p>"},{"name":"Ghost Rider","year":2007,"developer":"Magic Pockets SAS","url":"a#G.zip/G%2FGhost%20Rider%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":6.6,"genres":"Action > Racing / Driving > Behind view > Side view > Arcade > Platform > Shooter > Licensed","desc":"<p>In this sequel to the movie, Mephisto requests Johnny Blaze (The Ghost Rider) to stop the plan to revive Blackheart (son of Mephisto) on Earth which can cause The Apocalypse. This may cause Hell to be taken away from Mephisto because it breaks the no demons on Earth rule given by the Angels. Ghost Rider, although going against Mephisto's will, agrees to stop this plan only to save the woman he loves, Roxanne Simpson. </p><p>The player as The Ghost Rider must stop this plan by battling many demons on Earth while on foot with upgradeable attacks done with fists and the Hell chain. The player must also race across miles of land on the Hell Cycle killing the demons on their various transportation ways with the hell chain and fireballs.</p>"},{"name":"Ghost Trap (J)","year":2002,"developer":"Artoon Co., Ltd.","url":"a#G.zip/G%2FGhost%20Trap%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Isometric > Puzzle elements > Survival horror","desc":"<p><em>Ghost Trap</em> is a survival horror, similar in style, camera's views and controls to early Resident Evil games. The player controls a scientist, being with friends in a haunted house. He comes between different rooms, collects items and avoids ghosts. He has no gun, the only weapons are traps that are left on the ground. When ghost enters the trap, the player can destroy it.</p>"},{"name":"Ghosts 'N Goblins","year":2004,"developer":"Capcom Co., Ltd."},{"name":"GO, Poliwrath","year":2001,"developer":"Nintendo Co., Ltd."},{"name":"Go! Go! Beckham! Adventure On Soccer Island","year":2002,"developer":"Denki Ltd.","url":"a#G.zip/G%2FGo%21%20Go%21%20Beckham%21%20-%20Adventure%20on%20Soccer%20Island%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.8,"genres":"Action > Sports > Side view > Platform > Football (European) / Soccer > Licensed","desc":"<p>It's football with a unique twist. David Beckham is called on to save Soccer Island from the evil Mister Woe, who has taken over the island by turning all of the animals into monsters. Not only that, he's stealing all of the imporant items for himself.</p><p>Using David Beckham's football skills, you must guide your hero through each level, kicking enemies and doors down with your football to the end of each level. Knock down the locks during the game to unlock the exit door and kick your ball through to complete it. Boss characters then require special attacks with your football to defeat them.</p>"},{"name":"Godzilla: Domination!","year":2002,"developer":"WayForward Technologies, Inc.","url":"7#Godzilla%3B%20Domination%21%20%28USA%29.gba","filesize":4194304,"score":6,"genres":"Action > Isometric > Fighting > Sci-fi / futuristic > Licensed","desc":"<p>6 of the biggest, baddest, meanest monsters on the planet are ready for battle in this isometric pocket fighter based on the Godzilla franchise and Godzilla: Destroy All Monsters Melee.</p><p>Godzilla, Rodan, King Ghidoran, Megalon, Mothra, and Mechagodzilla are the six available monsters that you can trash and destroy during story mode, where your aim is to defeat each one while keeping a look out for buildings and cars that may get in your way.</p><p>4 players can also compete in versus mode, where the simple aim is to last the longest against each other.</p>"},{"name":"Goemon: New Age Shutsudo!","year":2002,"developer":"Workman Corp., Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Goemon%20-%20New%20Age%20Shutsudou%21%20%28Japan%29.zip","filesize":1,"score":"","genres":"Action > 1st-person > Side view > Anime / Manga > Arcade","desc":"<p>A sequel of sorts of Ganbare Goemon: Shin Sedai Shūmei, <em>New Age Shutsudō</em> takes you back to the world of the \"updated\" Goemon in which you control a younger and less humorous version of Goemon who fights crime in modern Japan instead of the classic wacky ninja that tries to save feudal Japan and originated the Ganbare Goemon series.</p><p>Borrowing the template from the previous portable title in the series, the game thrusts you in the shoes of either Goemon or his pal Ebisu as they traverse side-scrolling stages attempting to defeat all enemies within and ultimately save the city.</p><p>Between levels you take control of the rest of Goemon's friends in bonus rounds as they take on specific challenges, and the game also brings back the Impact sequences, in which you take control of giant mechas in first-person sequences and attempt to defeat certain bosses.</p>"},{"name":"Golden Nugget Casino","year":2004,"developer":"","url":"a#G.zip/G%2FGolden%20Nugget%20Casino%20%28U%29.gba","filesize":1,"score":"","genres":"Gambling > Cards / tiles > Licensed","desc":"<p>Players enter the casino with $2000 and try to turn it into a fortune by gambling. The casino lets the player gamble at craps, roulette, blackjack, video poker, and two slot machines The slot machines are the multiple line Halloween Spooky and the single line Wild West. The four video poker machines are Jacks or Better, Deuces Wild,  Jokers Wild,  and 10's or Better.</p>"},{"name":"Golden Sun","year":2001,"developer":"Camelot Software Planning","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Golden%20Sun%20%28USA%2C%20Europe%29.zip","filesize":1,"score":8.1,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Isometric > Puzzle elements > Fantasy","desc":"<p>Isaac is from the town of Vale, on the island of Angara. He is an Adept, meaning he is skilled in Psynergy, the technique of moving objects without touching them. Mages from the rival island of Gondowan plan to destroy Angara by using four Elemental Stones, so Isaac has assembled a team to snatch the stones.</p><p>In the universe of this role-playing game, four different types of elements (fire, water, wind and earth) are combined to create spells. Combat often involves facing multiple monsters at each time. </p><p>Djinni creatures can be captured and used to give one of your characters extra strengths. Energy is needed to cast spells, but this constantly replenishes while you are not using one. A two-player link-up game exists.</p>"},{"name":"Golden Sun: The Lost Age","year":2002,"developer":"Camelot Software Planning","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Golden%20Sun%20-%20The%20Lost%20Age%20%28USA%2C%20Europe%29.zip","filesize":1,"score":8.2,"genres":"Role-playing (RPG) > Puzzle elements > Fantasy","desc":"<p>Following on from where Golden Sun left off, you play the role of Felix, another powerful magic user who has been given the task to complete the same mission that Isaac began: saving the world from total destruction at the hands of deadly mages.</p><p>Along with 40 hours of brand new gameplay and the ability to battle a friend in a 2 player battle mode, you can also transfer information from the original Golden Sun to The Lost Age, giving you an upperhand when former character return to the action.</p>"},{"name":"Golf","year":2003,"developer":"Nintendo Co., Ltd."},{"name":"Gradius Galaxies","year":2001,"developer":"Mobile21 Co., Ltd.","url":"7#Gradius%20Galaxies%20%28USA%29.gba","filesize":4194304,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Gradius Galaxies'</em> side-scrolling action hearkens back to the early days of arcade shoot-'em-ups — wave after wave of enemies hound you through 8 all new stages, and colossal end bosses fill the screen with a constellation of heavy fire. Strap yourself in tight behind the controls of the Vic Viper, a fast and deadly attack ship. Choose the configuration of weapons, including twin cannons, photon missiles, and beam lasers, and enhance those weapons during gameplay by grabbing power-ups.</p>"},{"name":"Granbo (J)","year":2001,"developer":"Capcom Co., Ltd.","url":"a#G.zip/G%2FGrandbo%20%28J%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Anime / Manga > Sci-fi / futuristic","desc":"<p><em>Granbo</em> is a <em>Pokémon</em>-like role-playing game for the Game Boy Advance. The player is a boy who goes on a journey to save a girl named Shizuku from an evil organization called Skyshock. The player collects and battles with Granbo, a species of mechanical eggs who can transform into robotic animals through the use of Data Balls.</p>"},{"name":"Grand Theft Auto Advance","year":2004,"developer":"Digital Eclipse Software, Inc.","url":"a#G.zip/G%2FGrand%20Theft%20Auto%20Advance%20%28E%29%20%28M5%29.gba","filesize":1,"score":7,"genres":"Action > Racing / Driving > Top-down > 2D scrolling > Direct control > Contemporary > Crime","desc":"<p>Today is your last job, your last day working for the mob. After this, you could escape the seedy undergrowth of Liberty City and have a good life, with all the money you could ever want. But something went wrong on this last day. Now, with your best friend Vinney murdered in a car explosion and you pinned for the crime, you must return to the underground and find the truth. To save your skin and find Vinney's killer, you'll have to work a few more days.</p><p>Liberty City makes an appearance in Grand Theft Auto Advance, the handheld exclusive based on the award winning console franchise. A combination of the gameplay and challenges that made that 3D rendition so successful, and the 2D style of the original GTA series comes together here, where you must drive to survive and use all the weapons available to you to complete each of the missions, in order to find Vinney's true murderer and save yourself in the process.</p>"},{"name":"Great Circus Mystery starring Mickey & Minnie, The","year":2003,"developer":"Capcom Co., Ltd."},{"name":"Gremlins: Stripe Vs. Gizmo","year":2002,"developer":"Magic Pockets SAS","url":"a#G.zip/G%2FGremlins%20-%20Stripe%20vs%20Gizmo%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.gba","filesize":1,"score":"","genres":"Action > Side view > Platform > Puzzle elements > Horror > Licensed","desc":"<p><em>Gremlins: Stripe vs Gizmo</em> is a 2D side-scrolling platformer based on the popular film series. Christmas has come to Kingston Falls, and depending on which character is chosen, can either save or destroy the holiday. Players can choose to play between Gizmo, the furry, friendly Mogwai, or Stripe, the mischievous, and foul-tempered Gremlin. </p><p>Playing through five levels, Gizmo's intent is to save all of the Christmas presents and return them to their rightful children. While doing this, Gizmo must also escape from the evil Gremlins that are trying to capture him and force him to eat after midnight - turning him into a Gremlin. Gizmo uses his double-jump and flashlight to ward off attacks, or can roll into a ball and knock over enemies.</p><p>Playing as Stripe, it is the player's goal to destroy as many presents as possible. Players can capture Mogwais and turn them into Gremlins by hitting them with a cream pie. Stripe can also attack by using his claws.</p><p><em>Gremlins: Stripe Vs. Gizmo</em> offers three distinct game modes: Adventure Mode, an \"Against-the-Clock\" Mode and a Multiplayer Mode (two players can compete in real time with link mode).</p>"},{"name":"Grim Adventures of Billy & Mandy, The","year":2006,"developer":"Full Fat Productions Ltd.","url":"a#G.zip/G%2FGrim%20Adventures%20of%20Billy%20and%20Mandy%2C%20The%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Direct control > Fantasy > Licensed","desc":"<p><em>The Grim Adventures of Billy and Mandy</em> is a game based after the Cartoon Network series of the same name. Grim's chest was tampered with and Mojo Balls were released into the universe. These Mojo Balls infect everyone they touch with supernatural rage. So Grim, Billy and Mandy have to go out and retrieve them all to prevent the universe to fall into eternal chaos.</p><p>The game's Story mode is a side-scrolling platformer/brawler, which alternates between small platforming sections and stopping to have the player battle a certain amount of enemies, all of which have to be defeated before the level can move on. To accomplish this the player has kick and punch attacks as well as an air attack and a special attack which can be launched once the power bar is full. It is filled by defeating enemies. There is also a double jump and a butt bounce action, which help to get through the platforming sections.</p><p>At the end of each character's story is a boss, whose defeat awards the player with one Mojo Ball. The Mojo Balls are needed to unlock the extra characters. Initially only Billy is available, then Mandy, and last Grim. To unlock Mandy Billy's Story must be completed and a certain amount of Mojo Balls collected. Most of the Mojo Balls come from Mission mode, which plays essentially the same, but in very short levels, many of which have time limits and play like mini-games.</p>"},{"name":"GT Advance 2: Rally Racing","year":2002,"developer":"MTO Co., Ltd.","url":"a#G.zip/G%2FGT%20Advance%202%20-%20Rally%20Racing%20%28E%29.gba","filesize":1,"score":7.5,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Off-roading > Vehicle simulator > Oceania","desc":"<p>More arcade then simulation. GT Advance 2 offers 15 rally cars, which you can tune, upgrade and modify between races, to be raced on 42 different tracks with varying weather conditions and road surfaces (tarmac, dirt, etc.) plus long corners, perfect for power sliding.</p><p>By winning each race you unlock new cars to select, and upgrades to previous cars. Along with the championship mode, you can also race against the clock or a friend, and the ability to race for licenses by completing certain areas of tracks.</p>"},{"name":"GT Advance 3: Pro Concept Racing","year":2003,"developer":"MTO Co., Ltd.","url":"a#G.zip/G%2FGT%20Advance%203%20-%20Pro%20Concept%20Racing%20%28E%29.gba","filesize":1,"score":7.4,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Return to the road and take on the world to become the racing champion. 90 cars are on offer (most only available in Japan) to race across 46 different race tracks around the globe. The aim is to place first in each, in order to unlock the faster cars available.</p><p>Along with both single and 2 player multiplayer modes, you can also take part in a drifting challenge, where the aim is to drift around as many corners as possible, all in the one drift. The higher the combo, the better the result.</p>"},{"name":"GT Advance Championship Racing","year":2001,"developer":"MTO Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/GT%20Advance%20-%20Championship%20Racing%20%28USA%2C%20Europe%29.zip","filesize":1,"score":7.4,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>This game is a racing simulation using \"real world\" vehicles (mostly Japanese models), similar to the Gran Turismo series. Players begin with a single vehicle selected from a range of fairly standard models, and are entered into a series of races with cash prizes. Earned money can be used to purchase additional vehicles from a total of forty-five available, or upgrade an existing one by nine kinds of parts such as engines suspensions and others. There are 32 courses.</p>"},{"name":"Guilty Gear X","year":2002,"developer":"PicPac Airreal Co., Ltd.","url":"a#G.zip/G%2FGuilty%20Gear%20X%20-%20Advance%20Edition.gba","filesize":1,"score":7.7,"genres":"Action > Side view > Anime / Manga > Fighting > Martial arts","desc":"<p>When the humans created artificial beings named \"gears\" in 22th century, they didn't expect that their creation will eventually turn against them. Because gears had no will of their own and could only obey humans. Only one gear, named Justice, was able to transfer his will onto other gears and to rebel against the humans. In year 2180, Justice was killed as a result of a bloody tournament organized by the Sacred Order of Holy Knights. Yet recently, a new gear was discovered. He showed no signs of hostility, yet he had no master and was roaming about free. It was impossible to capture or to kill him because he was immensely strong. Fearing a new Justice will grow out of this gear, the Order organized yet another tournament, this time with a solid prize: five hundred thousand world dollars for the winner.</p><p><em>Guilty Gear X</em> is a follow up to  Guilty Gear, and is also a 2D fighting game. There are now 16 characters available for you to choose. The battle system became more complicated, thanks to the variety of moves you can perform. Beside special attacks which you can execute if you build up your Tension Gauge by attacking or advancing towards your opponent, there is also a variety of defensing moves to perform. The instant kill moves are back from the previous game.</p>"},{"name":"Gumby vs. the Astrobots","year":2005,"developer":"Torus Games Pty. Ltd.","url":"a#G.zip/G%2FGumby%20vs.%20the%20Astrobots%20%28U%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > Platform > Puzzle elements > Licensed","desc":"<p>Professor Kapp has accidentally invented a machine that can control Gumby's friends, the Astrobots. Minutes after its creation, it naturally gets stolen by the mischievous Blockheads! Who knows what sort of trouble they'll get up to with it!</p><p><em>Gumby vs. the Astrobots</em> is a side-scrolling platform game where you play as Gumby. Explore different books to rescue your friends, such as Pokey, Prickle and Goo, who have all been kidnapped by the Astrobots. Gumby can use his abilities to transform into a clay ball, a minecart, a helicopter and more as he explores various different books to rescue his friends. Throughout each world are ice-creams, Gumby's favourite treat, to collect.</p>"},{"name":"Gunstar Future Heroes","year":2005,"developer":"Treasure Co., Ltd.","url":"7#Gunstar%20Future%20Heroes%20%28EU%29%20%5BEn%2CFr%2CIt%2CDe%2CEs%2CJa%5D.gba","filesize":8388608,"score":7.9,"genres":"Action > Side view > Anime / Manga > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Red and Blue, the heroes of Gunstar-9, are back for an all new side-scrolling adventure set across the same action packed blastfest that the original Gunstar Heroes provided all those years before.</p><p><em>Gunstar Super Heroes</em> continues on from the first story arc, where you must guide Red and Blue through a number of unique environments and a host of critters and evil doers to vanquish. Both follow their own unique paths through the land, with three weapons styles on offer - Rapid Fire, Automatic, and Explosive.</p>"},{"name":"Guru Logi Champ","year":2001,"developer":"Champ Team"},{"name":"Gyakuten Saiban (J)","year":2001,"developer":"Capcom Co., Ltd.","url":"a#G.zip/G%2FGyakuten%20Saiban%20%28J%29.gba","filesize":1,"score":"","genres":"Adventure > 1st-person > Puzzle elements > Detective / mystery","desc":"<p><em>Gyakuten Saiban</em> is an adventure game where the player takes on the role of Ryuuichi Naruhodou, a rookie lawyer fresh out of law school. The game features five cases where the player must help Ryuuichi, as the defense attorney, clear the name of falsely accused defendants and prove the guilt of the real culprit. During the trials, the player must carefully listen to the witnesses' testimonies. He can then analyze the testimony, sentence by sentence, and \"press\" the witness for more information, or present to the court a piece of evidence that proves the witness's claim to be false. As lies and inaccuracies are exposed, the witness typically keeps changing their testimony until finally the truth comes to light. However, presenting wrong evidence or otherwise making errors will cause the judge to penalize you, and if you've accumulated too many penalties, he will lose his patience and declare a guilty verdict immediately. </p><p>Before and in between the trials, the player usually needs to take part in an adventure game-styled section where they conduct an investigation, travelling between various locations, interrogating people and searching rooms in hopes of finding evidence or learning some clues for the upcoming court session. There are four cases in total.</p>"}]