[{"name":"Hachiemon","year":2003,"developer":"Natsume Co., Ltd.","url":"a#H.zip/H%2FHachiemon%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Direct control > Japan (Modern/Futuristic) > Comedy > Licensed","desc":"<p>Hachiemon and his friends are having a lovely day on Hachi Isle, when a strange incident occurs. The friends that came to play with him have suddenly lost their lips! Without lips, eating and talking are difficult for them. Time for Hachiemon to be a hero and get everyone their lips back!</p><p><em>Hachiemon</em> is a 2D platformer starring the titular egg-shaped character with big red angled lips. He can use his lips in various ways, throwing them like a boomerang or grabbing onto walls and platforms, even slingshotting himself. Some enemies can be stunned temporarily by giving them a quick smooch with his lips. He can also roll to attack, but rolling for too long makes him dizzy. Many enemies, obstacles, and occasional boss fights stand in the way of his quest for the lost lips.</p><p>The Hachiemon character was originally created as an advertising mascot for the TV station KTV (Kansai Television or Kantele for short). In game, Hachiemon sometimes exclaims \"Kantele\" (カンテーレ), like on the title screen or when pushing the left shoulder button.</p><p>Hachiemon comments on some events, like pausing, smooching or getting hurt, with voice clips in which he has a comically deep and expressionless voice.</p>"},{"name":"Hamepane Tokyo Mew Mew","year":2002,"developer":"Winky Soft Co., Ltd.","url":"a#H.zip/H%2FHamepane%20Tokyo%20Myumyu%20%28J%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Puzzle > Fixed / flip-screen > Anime / Manga > Turn-based > Menu structures > Contemporary > Fantasy","desc":"<p>This simple puzzle adventure game based on the manga and anime series <em>Tokyo Mew Mew</em> follows main character Ichigo on one especially complicated day out. She planned to spend it on a nice date with Aoyama, but when Quiche manages to steal a memory chip containing the secret identities of all the Mew Mews, Ichigo has to scramble to get it back. The story is told through linear visual novel scenes with the occasional sliding tile puzzles in the place of battles.</p>"},{"name":"Hamtaro: Ham-Ham Games","year":2004,"developer":"AlphaDream Corporation, Ltd.","url":"a#H.zip/H%2FHamtaro%20-%20Ham-Ham%20Games%20%28E%29%20%28M5%29.gba","filesize":1,"score":7,"genres":"Sports > Olympiad / mixed sports > Licensed","desc":"<p>Hamtaro and his friends have been called to Rainbow Land to participate in an olympic event called the Ham-Ham Games. The Ham-Ham Games tournament takes place over a seven day period and consists of several different sporting events. Events include the 100m Dash, Tennis, Hammer Throw, Diving, Beach Volleyball, Hurdles, Bird-Back Riding, Pole Vault, Carrot Pull, Swimming, Archery, Sailing, Triple Jump, Synchronized Swimming, and a Marathon race. The goal is to have the team with the most gold medals by the time of the closing ceremonies. Finishing the tournament mode opens up the free play mode where the events can be played at any time.</p><p>In between events, the player is free to explore Rainbow Land where they can have chats with the other hamster denizens, search for sunflower seeds in order to buy costumes, and collect Hamigo Cards among other things.</p>"},{"name":"Hamtaro: Ham-Ham Heartbreak","year":2002,"developer":"Pax Softnica","url":"a#H.zip/H%2FHamtaro%20-%20Ham-Ham%20Heartbreak%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.5,"genres":"Action > Top-down > Anime / Manga > Puzzle elements > Licensed","desc":"<p>Hamtaro and his friends are back for another installment of the ever-so-popular Hamtaro craze. This time, Spat threatens to cause trouble for our protagonists, and it's up to Hamtaro to stop him before it's too late! Is a potential heartbreak for Hamtaro and Bijou imminent?!?</p><p>This version plays much like the first installment, a psuedo action/adventure/graphic-and-text adventure. Again, with 86 Ham-chat words to collect, some old faves such as the greeting \"Hamha!\" and some new ones like \"GoGo\" (Go). </p><p>Hamtaro: Ham Ham Heartbreak is based on the anime Tottoko Hamtaro, original concept by Ritsuko Kawai.</p>"},{"name":"Hamtaro: Rainbow Rescue","year":2003,"developer":"AlphaDream Corporation, Ltd.","url":"a#H.zip/H%2FHamtaro%20-%20Rainbow%20Rescue%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.4,"genres":"Action > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p>Lots of mini-games in a cute world filled with talking hamsters, each with their own specialities.</p><p>Prince Bo fell off his rainbow and he needs help to return to Rainbow Land. Cue Hamtaro and his friends, who have to gather the seven colors of the rainbow to rebuild it. By winning the mini-games you earn stickers and pictures which can be used to fill a virtual stickerbook but can also be traded with friends with a GameBoy Link Cable.</p>"},{"name":"Happy Feet","year":2006,"developer":"Artificial Mind & Movement","url":"a#H.zip/H%2FHappy%20Feet%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > 2D scrolling > Music / rhythm > Direct control > Licensed","desc":"<p>TAP INTO THE ADVENTURE AND FUN!<br>Step into Mumble's happy feet as you belly-sled, dance and swim through Antarctica on an amazing adventure!</p>"},{"name":"Hardcore Pinball","year":2002,"developer":"Paragon Five, Inc.","url":"a#H.zip/H%2FHardcore%20Pinball%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Top-down > Arcade > Pinball","desc":"<p>Hardcore Pinball contains four different tables that span over multiple screens with vertical scrolling and have their own themes: Soccer, RoboMech, Retro, and Station.</p><p>Starting a game with four balls and using the shoulder buttons to control the flippers, you must uncover the secrets of each table to reach the highest possible score. Each table comes with its own set of specific music and sound effects and has its own high score list.</p>"},{"name":"Hardcore Pool","year":2004,"developer":"FRONTLINE Studios, Inc.","url":"a#H.zip/H%2FHardcore%20Pool%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Sports > Top-down > Fixed / flip-screen > Pool / snooker","desc":"<p>\"Steady your nerves... Chalk up your cue... Its time to hit the tables and play the ultimate in 8-ball and 9-ball pool... - 5 game modes: arcade, tournament, 8 ball, 9 ball, & time challenge\".</p>"},{"name":"Harlem Globetrotters: World Tour","year":2006,"developer":"Full Fat Productions Ltd.","url":"a#H.zip/H%2FHarlem%20Globetrotters%20-%20World%20Tour%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":4.9,"genres":"Action > Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>Harlem Globetrotters: World Tour</em> is a licensed basketball game featuring 2-on-2 matches. There are two main modes: Quick Match (only the fourth quarter of a game) and World Tour. The latter has the player go through a series of matches, beating the other teams to become world champion with gameplay similar to the NBA Jam games. Each character has a range of statistics such as speed, offense, defense and stamina. All the regular moves are present: player switches, a tip off, passing, 1-2 passing, shooting, targetting, steals and dunks with hoop hanging.</p><p>While playing, a stamina bar is shown. A temporary boost can be activated, but the amount will slowly decrease during the match and eventually substitutions may be needed. Another feature is the special bar, fed by impressive dunks and passes. When maxed out, players are able to perform special dunks.</p><p>Progressing through the World Tour unlocks new teams. The DS version adds multiplayer support for two players.</p>"},{"name":"Harry Potter and the Chamber of Secrets","year":2002,"developer":"Eurocom Developments Ltd","url":"a#H.zip/H%2FHarry%20Potter%20and%20The%20Chamber%20of%20Secrets%20%28UE%29%20%28M12%29%20%5B%21%5D.gba","filesize":1,"score":6.9,"genres":"Action > Diagonal-down > Isometric > Fantasy > Licensed","desc":"<p>The game for Game Boy Advance based on the second Harry Potter book and movie is, like its predecessor, an action adventure, this time with an isometric perspective.</p><p>In Harry's second year at Hogwarts, bad things are happening. The ancient Chamber of Secrets has been opened, and what lurks within is attacking students. To get through this ordeal alive (and advance the plot) Harry must again complete various challenges. These mostly consist of navigating large mazes - fighting monsters, solving puzzles, flipping switches and pressing buttons for doors to open. Six spells are available to help. As Harry is often in places he shouldn't be, stealth sequences are also a large part of the game. To avoid teachers and prefects, he can sneak around slowly and hide behind curtains. If he is caught, he is thrown out (to try again) and house points can be deducted.</p><p>As in other Potter games, there are a lot of collectibles, found both in plain view and in hidden areas. Sets of Famous Wizard cards unlock bonuses, Every Flavour Beans get Harry passwords that let him move through shortcuts in the school and Chocolate Frogs increase his maximum stamina.</p><p>Finally, Quidditch is also back in this game, this time in three-dimensional space, viewed from the back.</p>"},{"name":"Harry Potter and the Goblet of Fire","year":2005,"developer":"Magic Pockets SAS","url":"a#H.zip/H%2FHarry%20Potter%20and%20The%20Goblet%20of%20Fire%20%28UE%29%20%28M8%29.gba","filesize":1,"score":6.5,"genres":"Action > Diagonal-down > Music / rhythm > Puzzle elements > Fantasy > Licensed","desc":"<p>Take on the role of Harry, Ron and Hermione as they begin their fourth year at Hogwarts School of Witchcraft and Wizardry. This year, the Triwizard Tournament takes place, and Harry is mysteriously entered into the tournament himself.</p><p><em>Harry Potter and the Goblet of Fire</em> for the Nintendo DS and Game Boy Advance is a top-down action/adventure game where you play as the three friends and progress through the story based on the book and film.</p><p>Make your way through various scenarios by attacking enemies and solving puzzles using spells. One button fires a ranged spell, such as Confoundus, while another is used for stream spells, like Wingardium Leviosa, which can be moved around with the Control Pad. You can also call your friends for added power to your magical spells.</p><p>The DS version includes a small bonus game where you take care of a magical creature called a 'Niffler'. It is a simulation game, like a very simple Tamagotchi. You can feed the Niffler, clean it, and give it toys - depending on what you do, it will become more or less pleased with you. Perform well enough, and it will become really happy, and let you pat it to make it even happier.</p>"},{"name":"Harry Potter and the Order of the Phoenix","year":2007,"developer":"Electronic Arts UK Ltd.","url":"a#H.zip/H%2FHarry%20Potter%20and%20The%20Order%20of%20The%20Phoenix%20%28UE%29%20%28M7%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Cinematic camera > Board game > Fantasy > Licensed","desc":"<p>Based off the fifth book and movie of the series, players take control of Harry Potter in this adventure as he faces the dangers of his fifth year of Hogwarts, builds Dumbledore's Army, and faces off with Voldemort himself as the prophecy continues to unfold.</p><p>Players will navigate through the castle of Hogwarts and beyond, learning fifth year spells, solving multiple puzzles, and even get a chance to play as Sirius Black and Dumbledore himself.</p><p>The player can walk around Hogwarts in \"almost 3D\" pre-rendered backgrounds, like in the first Resident Evil games. The gameplay consists of various minigames, which are played by pressing buttons with the right timing.</p>"},{"name":"Harry Potter and the Prisoner of Azkaban","year":2004,"developer":"Griptonite, Inc.","url":"a#H.zip/H%2FHarry%20Potter%20and%20The%20Prisoner%20of%20Azkaban%20%28UE%29%20%28M8%29.gba","filesize":1,"score":6.8,"genres":"Role-playing (RPG) > Diagonal-down > Turn-based > Puzzle elements > Fantasy > Licensed","desc":"<p>Sirius Black has escaped from the prison of Azkaban and it is up to Harry, Ron and Hermione to find out why he is after Harry and what his connection to the death of Harry's parents is.</p><p>The GBA version of Harry Potter and the Prisoner of Azkaban comes in form of a traditional RPG. In turn-based battles, Harry and his friends must use the right spells and items to defeat their enemies. Each character also has a few unique special attacks. Harry can perform magical attacks using the cards that can be collected throughout the game, Ron throws stink pellets and firecrackers at the enemy and Hermione can make the party's attacks more powerful.Outside of battles, you will take on quests and explore various dungeons. Inside dungeons, enemies are visible, so that it is possible to avoid combat. You will also need to use different spells to solve puzzles and clear obstacles.</p>"},{"name":"Harry Potter and the Sorcerer's Stone","year":2001,"developer":"Griptonite, Inc.","url":"a#H.zip/H%2FHarry%20Potter%20and%20The%20Sorcerer%27s%20Stone%20%28UE%29%20%28M12%29%20%5B%21%5D.gba","filesize":1,"score":6.8,"genres":"Action > Top-down > 2D scrolling > Fantasy > Licensed","desc":"<p>The first Harry Potter game for the Game Boy Advance is an action adventure that lets you play as Harry in his first year at Hogwarts School of Witchcraft and Wizardry, following the story of the book and the movie.</p><p>You control Harry from an overhead view and must complete several tasks. These range from mundane class assignments like collecting ingredients for a potion to facing off against a giant troll. To master these challenges, Harry can learn five spells that allow him to push back opponents, flip switches, open doors, levitate objects and more. If Harry is hurt, he can find and eat Bertie Bott's Every Flavor Beans to regain health. By performing admirably in learning spells and completing missions, Harry can gain extra House Points so that Gryffindor might win the House Cup. If he misbehaves by attacking other students, or being caught wandering the halls at night, points will be deducted, however.As seeker for the Gryffindor team, Harry must also compete in Quidditch matches. The game has a special mode for Quidditch and other events where Harry might have to mount his broom.</p>"},{"name":"Harry Potter: Quidditch World Cup","year":2003,"developer":"Magic Pockets SAS","url":"a#H.zip/H%2FHarry%20Potter%20-%20Quidditch%20World%20Cup%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CDa%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Fantasy > Licensed","desc":"<p>Take any of the Hogwarts Houses to triumph in the Hogwarts Quidditch Cup and then use your new skills to take your country to victory in the Quidditch World Cup.<br>Choose between nine international Quidditch teams each with it's own distinctive playing style - USA, England, France, Germany, the Nordic Team, Spain, Australia and Bulgaria featuring Viktor Krum.<br>Experience the first ever Harry Potter multi-player game - go head to head with your friends in magical, fast and exciting 2 player action.</p>"},{"name":"Harvest Moon: Friends of Mineral Town","year":2003,"developer":"Tose Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Harvest%20Moon%20-%20Friends%20of%20Mineral%20Town%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Simulation > Isometric > Anime / Manga > Managerial / business simulation","desc":"<p>As with previous entries in the series, Harvest Moon tells the story of a young farmer who must build and develop a farm, including the crops and animals. Along with this, you must make sure that the farm makes a profit in order to purchase new items and farm equipment to keep the farm afloat for as long as possible.</p><p>Other tasks await you, such as teaching your faithful dog tricks, visiting the local village and making friends. As your farm builds, you also get the opportunity to recruit helpers to get more done around the farm, and fall in love.</p>"},{"name":"Harvest Moon: More Friends of Mineral Town","year":2003,"developer":"Marvelous Entertainment Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Harvest%20Moon%20-%20More%20Friends%20of%20Mineral%20Town%20%28USA%29.zip","filesize":1,"score":7.5,"genres":"Simulation > Isometric > Anime / Manga > Managerial / business simulation","desc":"<p>Following in the footsteps of Harvest Moon: Friends of Mineral Town, on this occasion you play the part of a young girl striving for a new life in the country. To do so, you have to build and maintain a farm while making friends with the locals, keeping a track of your funds and taking a closer look at your love life ... there's some bachelors out there waiting.</p><p>The main aim of the game is to maintain your farm. To do so, you must plant and take care of various kinds of crops, keep your own home in order and feed the livestock. You'll have the opportunity to both buy and sell goods, since without money the farm will soon fall under. </p><p>Making friends and attending various events in the town will also help to gain your character some extra items, more business and perhaps that life partner who can help you out, in more ways then one.</p><p>More Friends of Mineral Town also connects to Harvest Moon: Another Wonderful Life, providing extra content for both titles through the game link cable.</p>"},{"name":"Harvest Time","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Heidi: The Game","year":2005,"developer":"Independent Arts Software GmbH","url":"a#H.zip/H%2FHeidi%20-%20The%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Heidi: The Game</em> is a side scrolling platform game based on the 2005 movie Heidi.</p><p>In the game, the player controls the girl Heidi and has to run and jump platforms to reach the end of the level. The player start with three lives which diminish by taking damage from forest creatures like a fox, hedgehog or bird. The player can also collect flowers, 100 flowers earns an extra live.</p>"},{"name":"Hello Kitty: Happy Party Pals","year":2005,"developer":"Webfoot Technologies, Inc.","url":"a#H.zip/H%2FHello%20Kitty%20-%20Happy%20Party%20Pals%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Simulation > 3rd-person (Other) > Licensed","desc":"<p>In <em>Hello Kitty: Happy Party Pals</em> Hello Kitty needs help to organize parties. The game consists of different levels (parties) that need to be planned. This includes inviting guests, gathering supplies and keeping everyone happy. The guests' happiness is shown through a percentage by talking to them, but it is also visible through a meter above their heads. If a certain rating is achieved Hello Kitty can move on to the next level. The game contains many Sanrio characters and it is the first <em>Hello Kitty</em> game for the GBA.</p><p>The first party is a small one in Kitty's playroom and she needs to invite two family members. Kitty can freely move around in the house to collect supplies such as a table cloth, a music disc, balloons etc. The gathered supplies are stored in a journal. The journal also shows who to invite. Kitty needs to do this by walking up to them and initiating a conversation. The guests are not always the same and items are not always in the same location. When talking to a potential guest their happiness rating is shown. By talking to them or giving items that rating can be improved, but only up to a certain level. The final part of the planning is decorating the room, with, for instance, the cloth and the balloons. Once the party starts Kitty can talk to the characters or play music to improve their happiness rating. The music needs to be matched with the guests. Old tunes will only make the elder people happy, but young people can for instance be given cake instead or you can play a game with them.</p><p>Many parts of the planning involve mini-games. Kitty can for instance make cakes. She needs to pour dough on a cooker with six burners, quickly flip them to prevent them from burning and then transfer them to a plate with a time limit of one minute. The second party takes place in the garden and Kitty can play the Bouncing Balloons mini-game in the sandbox, a Bust-A-Move clone. Based on the player's score various types of food are provided for the party. With each new party new environments are introduced, such as a garden, a park, an arcade etc. with more guests and items.</p><p>The third party is a park picnic. It has a mini-game that is a Concentration variant, matching identical cards. Guests can also be made happy by playing the Cutie Catch game. It is based on throwing a ball by determining the angle and the power of the throw so the other character can catch it and vice versa. The fourth party takes place at a Sushi restaurant and the fifth one at the Arcade. Other mini-games are a Dance Dance Revolution-like rhythm game, a sliding puzzle game, and designing custom invitations in a simplified art program, using images and colours that match the recipient's taste. Many items and activities return for the different parties. After each completed level a password is provided and it possible to access the thirteen mini-games right away from the main menu.</p>"},{"name":"Hey Arnold! The Movie","year":2002,"developer":"Altron Corporation","url":"a#H.zip/H%2FHey%20Arnold%21%20The%20Movie%20%28E%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>This is a jump 'n run game based on the movie of Nickelodeon's popular TV show <em>Hey Arnold</em>. The player can play several characters from the TV series (Arnold, Gerald, Grandpa and Grandma and Helga as hidden character). It follows the story of the movie where the player has to save the neighborhood from the show. The game features five different areas (City Area, Indoor, Building, Underground and another City Area). Saving is done via passwords that save every detail of progress such as remaining lives or collected coins.</p>"},{"name":"Hi Hi Puffy AmiYumi: Kaznapped!","year":2005,"developer":"Altron Corporation","url":"a#H.zip/H%2FHi%20Hi%20Puffy%20AmiYumi%20-%20Kaznapped%21%20%28E%29%20%28M2%29%20%28Eng-Ger%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > Platform > Puzzle elements > Licensed","desc":"<p>It's been a long world tour for Puffy AmiYumi, one of Japan's best rock groups. All they want to do is take a breather, but Harmony, the girls' number one fan, won't let them. When Ami and Yumi refuse to cater to Harmony's whim, the crazed blonde takes matters into her own hands - by stealing their diminutive manager Kaz and their instruments! Now Ami and Yumi must use their wits - and what's left of their music - to recover their instruments, find Harmony and rescue Kaz. Without any of them, Puffy AmiYumi may be doomed!</p><p><em>Hi Hi Puffy AmiYumi: Kaznapped</em> is a single-player platformer based on the Cartoon Network series \"Hi Hi Puffy AmiYumi\". Controlling and using Ami and Yumi's unique abilities (Ami can sing and swing, while Yumi plays guitar and lifts heavy objects), the player battles through six worlds of three areas each (with another world revealed when the game is complete). Along their way Ami and Yumi will encounter a series of puzzles which only a certain skill can solve, Kaz-bots created by Harmony, and other Puffy fans who just want a piece of the girls. Kaz-bots can be attacked, but fans can only be temporarily distracted (if they get attacked, the girls will lose points). Thankfully, Ami and Yumi can gain an advantage by petting their cats Jang Keng (to regain lost health) or Tekirai (for an extra life).</p><p>As Ami and Yumi progress in their adventure, they can also unlock mini-games, costumes, and other goodies for the player to enjoy.</p>"},{"name":"High Heat Major League Baseball 2002","year":2001,"developer":"Möbius Entertainment Ltd.","url":"a#H.zip/H%2FHigh%20Heat%20Major%20League%20Baseball%202002%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":7.1,"genres":"Sports > 3rd-person (Other) > Diagonal-down > Isometric > Baseball > Licensed","desc":"<p><em>High Heat Major League Baseball 2002</em> marks the first appearance of 3DO's baseball series on a handheld platform. It is also the first MLB-licensed baseball game released for the Game Boy Advance.</p><p>Available game modes include Exhibition, Season (16, 81 or 162 games), Playoffs, Home Run Derby and Practice. Season progress is saved to battery-backed RAM. Automatic fielding can be toggled and game length can be set from 1 to 9 innings.</p><p>Batting and pitching are done from a view behind the batter. Pitchers can either throw a fastball or select from a variety of special throws on a pitching cursor. Which pitches are available depends on the athlete's skill set. Batting works without aiming and simply requires correct timing when swinging or bunting. Fielding is done on an isometric view of the field. Advanced playing techniques like picking off players, stealing bases, hit-and-runs or beaning are not possible.</p>"},{"name":"High Heat Major League Baseball 2003","year":2002,"developer":"Möbius Entertainment Ltd.","url":"a#H.zip/H%2FHigh%20Heat%20Major%20League%20Baseball%202003%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":6.1,"genres":"Sports > 3rd-person (Other) > Diagonal-down > Isometric > Baseball > Licensed","desc":"<p><em>High Heat Major League Baseball 2003</em> is based closely on the previous year's version, with all the same game modes and options, some changes in graphics and some other additions.</p><p>All previous game modes return: Exhibition, Season (16, 81 or 162 games), Playoffs, Home Run Derby and Practice. Season progress is again saved to battery-backed RAM. Multiplayer has been added with two-player matchups via link cable. Teams, players and stats have been updated for the new MLB season.</p><p>Gameplay is also largely unchanged. Batting and pitching are again done from a view behind the batter, but with the batter now rendered in real-time via polygons. The pitching interface via the pitching cursor is unchanged, as are the isometric field graphics. Some advanced playing techniques have been added: it is now possible to steal bases and throw bean balls.</p>"},{"name":"High School Musical: Livin' the Dream","year":2007,"developer":"Artificial Mind & Movement"},{"name":"Hobbit, The","year":2003,"developer":"Saffire, Inc","url":"a#H.zip/H%2FHobbit%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.8,"genres":"Action > Diagonal-down > 2D scrolling > Puzzle elements > Direct control > Fantasy > Licensed","desc":"<p>Take on the role of Bilbo Baggins from J.R.R. Tolkien's \"The Hobbit\" in this GBA title.  The game follows the story told by Tolkien starting from when Bilbo meets Gandalf the wizard and gets talked into going on an adventure when a bunch of dwarves come to visit him for supper.</p><p>Begin your journey to defeat Smaug, the dragon that has taken over the dwarves' home.  Find the One Ring as you meet Gollum.  Solve puzzles as you fight your way through many areas and meet many characters including elves.</p><p>Battles are fought in real-time as you attack your enemies while trying to keep from being hit yourself.  Attacking can be done quickly, or you can attack more slowly to build up a more powerful attack.  Each way is useful depending on the situation.  Find many items to help you on your journey, including fireworks.</p>"},{"name":"Hold Down Hoppip","year":2001,"developer":"Nintendo Co., Ltd."},{"name":"Horsez","year":2006,"developer":"Independent Arts Software GmbH"},{"name":"Hot Potato!","year":2001,"developer":"Pukka Games","url":"a#H.zip/H%2FHot%20Potato%21%20%28E%29%20%28M3%29.gba","filesize":1,"score":6.8,"genres":"Action > Top-down > Arcade > Puzzle elements","desc":"<p>Reminiscent of the original arcade style games, players steer a bus with a group of multicolored spuds on it. As the bus rolls down the streets, players will release waves of spuds down the street ahead of them, and if a potato runs into a potato of the same color, they will save that potato. There's constant screen action as each spud is animated, and waves its arms to attract your attention. The little spuds are cute, displaying a wide range of comical anims and they're literally everywhere. It's up to players to capture the spuds and save the Earth for good!</p>"},{"name":"Hot Wheels: All Out","year":2006,"developer":"Twofivesix Ltd.","url":"a#H.zip/H%2FHot%20Wheels%20-%20All%20Out%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Diagonal-down > Isometric > Direct control > Automobile > Licensed","desc":"<p><em>Hot Wheels: All Out</em> is a handheld racing game based on the car toys with the same name. The game is played from an isometric perspective and lets the player race around with 19 different classic Hot Wheels cars including Phantasm, Bullygoat and Firestorm. The action takes place on four tracks each with its own theme. These are city, ice, volcano and jungle. Each track has its own obstacles that the player has to watch out for. In the city there is manholes and old ladies, while on the ice track the player has to avoid snowmen and polar bears. In addition to just racing around, the player can also use Nitro and slow motion features. </p><p>Four game modes are available: The quick play mode brings the player straight into the action. The player chooses location car and mode and then then the track is randomly selected. Second, challenges come in five different variants: In VS the player competes against AI controlled cars and has to come first. In Collector the player has to collect items before time runs out. In Pursuit the player has to catch up with a criminal car before time runs out. In Eliminator the last placed player gets eliminated. In Beat the Clock the player races against the clock. </p><p>The third game mode is the ultimate challenge where the player can win the All Out trophy. Here the player will have to complete multiple challenges in turn to unlock the next one.</p>"},{"name":"Hot Wheels: Burnin' Rubber","year":2001,"developer":"Altron Corporation","url":"a#H.zip/H%2FHot%20Wheels%20-%20Burnin%27%20Rubber%20%28E%29%20%28M2%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Licensed","desc":"<p><em>Hot Wheels: Burnin' Rubber</em> is a racing game licensed from the line of toy cars. It features 25 cars that can be taken for races on 16 different tracks.</p><p>The game's main Grand Prix mode is organized into four increasingly difficult cups that have to be taken on in order, each consisting of two sets of four races. Finishing in first or second place in a race is necessary to advance - finishing further behind costs a life.Races are displayed in a Mode-7-style sprite scaling and rotation engine, with cars displayed as rendered bitmaps. Many of the courses take the miniature car concept literally and take place in large everyday locations like a bathroom, a piano or a billiard table. Winning races earns money that can be spent to tune cars by purchasing new engines, mufflers, computers and other components, increasing top speed, acceleration or traction. Only five cars are available for selection from the start, the others have to be unlocked through winning in Grand Prix mode or beating time records. Progress in Grand Prix mode is stored to battery-backed RAM.</p><p>Further game modes include single races and time trials on courses unlocked in Grand Prix mode. There is also a two-player mode via link cable, requiring both players to have their own cartridge.</p>"},{"name":"Hot Wheels: Stunt Track Challenge","year":2004,"developer":"Razorback Developments Ltd","url":"a#H.zip/H%2FHot%20Wheels%20-%20Stunt%20Track%20Challenge%20%28U%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Real-time > Direct control > Automobile > Licensed","desc":"<p>INCREDIBLE STUNTS! FIERCE POWER! AMAZING SPEED!<br>Hot Wheels™ Stunt Track Challenge™ is the hottest and most extreme game show. In each show, drivers compete in death-defying stunts and impress the audience by beating their opponent and performing wild stunts to win!</p>"},{"name":"Hot Wheels: Velocity X","year":2002,"developer":"Saffire, Inc","url":"a#H.zip/H%2FHot%20Wheels%20-%20Velocity%20X%20%28E%29.gba","filesize":1,"score":5.8,"genres":"Action > Racing / Driving > Diagonal-down > Isometric > Licensed","desc":"<p>Released in conjunction with a version on console and PC, <em>Hot Wheels: Velocity X</em> on Game Boy Advance is not an adaptation, but an entirely unique game. It shares the general concept and some characters, but has its own story, modes and gameplay style.</p><p>The evil MetaCog attacks Hot Wheels HQ, putting the engineers to sleep with his hypnotic headlight, stealing five cars along with five parts of a new prototype. The Professor finds that his robot Gear Head isn't affected by the hypnosis, so he modifies him to become a top racer, able to beat MetaCog and his gang bosses and recapture the stolen parts and cars.</p><p>In the game's main Story Mode, the player controls Gear Head through five different worlds of seven missions each. The missions include races (in which the only goal is to cross the finish line first), stunt challenges (performing moves during jumps for points) as well as other objective-based missions: these include finding objects in a level within a time limit, playing a game of tag with a bomb (putting it on an enemy car before it explodes), protecting another car that is on a special mission, and many more. The final level in each world is a confrontation against one of the gang bosses, involving a race followed by a combat duel against the boss.</p><p>Races and missions are seen from an isometric perspective. Controls can be adjusted between track-relative and car-relative. The tracks feature a lot of jumps, loops and corkscrews, through which cars automatically move - there is no falling off or failing a jump. Scattered around the tracks are power-ups, including various weapons (necessary for the combat missions, but also useful in all others), a shield, a repair kit and more.</p><p>Completing missions in Story Mode unlocks new cars (there is a total of 30 cars in the game, each with different ratings in speed, acceleration, traction and armor) and makes the completed levels available for the game's other modes. These include Race Mode which allows standard races with number of opponents and laps adjustable, with three tracks per world available. Challenge mode has two varieties per world: Battles require the player to destroy all other cars in the level within a time limit, Tag requires the player to tag all other cars without getting tagged back, also within a time limit.</p><p>There is an in-game database of cars, characters, power-ups and stunt moves whose entries are unlocked by moving through Story Mode. Game progress is saved via passwords. The game also features connectivity to the GameCube version, which is the only way to unlock certain cars.</p>"},{"name":"Hot Wheels: World Race","year":2003,"developer":"Climax Handheld Games","url":"a#H.zip/H%2FHot%20Wheels%20-%20World%20Race%20%28E%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Real-time > Direct control > Automobile > Licensed","desc":"<p>DRIVE THE IMPOSSIBLE<br>Compete to be the world's greatest driver in the most intense race ever created-the Highway 35™ circuit. Do you have what it takes to master treacherous jumps, death defying loops, and win the Hot Wheels™ World Race™ event?</p>"},{"name":"Hudson Best Collection Vol. 1: Bomberman Collection","year":2005,"developer":"Hudson Soft Company, Ltd.","url":"a#H.zip/H%2FHudson%20Best%20Collection%20Vol.%201%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Compilation > Top-down > Fixed / flip-screen > Arcade > Direct control > Sci-fi / futuristic","desc":"<p>The first volume of Hudson Best Collection brings first two Bomberman games from Famicom to your GameBoy Advance:</p><ul><li>Bomberman</li><li>Bomberman II</li></ul>"},{"name":"Hudson Best Collection Vol. 2: Lode Runner Collection","year":2005,"developer":"Hudson Soft Company, Ltd.","url":"a#H.zip/H%2FHudson%20Best%20Collection%20Vol.%202%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Compilation > Puzzle > Side view > Platform > Direct control > Licensed","desc":"<p>This volume of Hudson Best Collection brings the first two Lode Runner games from the Famicom to the GameBoy Advance:</p><ul><li>Lode Runner</li><li>Championship Lode Runner</li></ul>"},{"name":"Hudson Best Collection Vol. 3: Action Collection","year":2005,"developer":"Hudson Soft Company, Ltd.","url":"a#H.zip/H%2FHudson%20Best%20Collection%20Vol.%203%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Compilation > Diagonal-down > Side view > 2D scrolling > Platform","desc":"<p>This volume of Hudson Best Collection brings two classic Famicom action games to your GameBoy Advance:* Challenger</p><ul><li>Milon's Secret Castle</li></ul>"},{"name":"Hudson Best Collection Vol. 4: Nazotoki Collection","year":2005,"developer":"Hudson Soft Company, Ltd.","url":"a#H.zip/H%2FHudson%20Best%20Collection%20Vol.%204%20-%20Nazotoki%20Collection%20%28J%29.gba","filesize":1,"score":"","genres":"Compilation","desc":"<p>This volume of Hudson Best Collection brings three classic Famicom puzzle games to your GameBoy Advance:* Nuts &amp; Milk</p><ul><li>Binary Land</li><li>Princess Tomato in the Salad Kingdom</li></ul>"},{"name":"Hudson Best Collection Vol. 5: Shooting Collection","year":2006,"developer":"Hudson Soft Company, Ltd.","url":"a#H.zip/H%2FHudson%20Best%20Collection%20Vol.%205%20-%20Shooting%20Collection%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Compilation > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>This volume of Hudson Best Collection brings three classic Famicom shooting games to your GameBoy Advance:* Star Force</p><ul><li>Star Soldier</li><li>Starship Hector</li></ul>"},{"name":"Hudson Best Collection Vol. 6: Bokenjima Collection","year":2006,"developer":"Hudson Soft Company, Ltd.","url":"a#H.zip/H%2FHudson%20Best%20Collection%20Vol.%206%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Compilation > Side view > 2D scrolling > Platform > Puzzle elements > Licensed","desc":"<p>The first volume of Hudson Best Collection brings the first four Adventure Island games from Famicom to the GameBoy Advance:* Adventure Island</p><ul><li>Adventure Island II</li><li>Adventure Island III</li><li>Adventure Island IV</li></ul><p>While the first <em>Adventure Island</em> received a separate GBA release, this is the only release of the other three games for the GBA.</p>"},{"name":"Hugo: The Evil Mirror","year":2005,"developer":"ITE Media ApS (Interactive Television Entertainment)","url":"a#H.zip/H%2FHugo%20-%20The%20Evil%20Mirror%20Advance%20%28E%29%20%28M12%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > Licensed","desc":"<p>This is a 2D version of a 3D PS1 &amp; PC game of the same name - Hugo: The Evil Mirror.</p><p>The backstory and gameplay ideas are the same as the 3D versions, but because of hardware limitations on the handheld consoles it was implemented as a 2D platform game.</p><p>Scylla as always, is envious of Hugolina's beauty, and want to capture her, but knows that Hugo will interfere, so she is looking for a way to eliminate Hugo first. To this end she uses a magic mirror to first capture him, and then the mirror is broken into three pieces and dispersed around the game world. The three troll kids now have to go out on their own to find the three pieces of the broken mirror and by combining them release Hugo, who will then be able to confront Scylla and save Hugolina from her.(The intro story does not seem to include how Hugolina gets captured, but it is part of the box text.)</p><p>The troll kids each have a world location with a piece of the mirror, and meet various enemies like beavers and soldiers in some 30+ levels with platform jumping on a 2D scrolling screen. Using magic freeze-rays, enemies are frozen into iceblocks, then dropped from a height to shatter, giving health items or coins. At the end of each location (10-12 levels) a boss appears carrying a mirror piece.</p><p>The GBA and GBC versions use different graphics, and while the GBA has some videos very similar to the PC/PS1 versions, the GBC has to make do with slideshows of still images for the story.</p>"}]