[{"name":"Ice Age","year":2002,"developer":"Artificial Mind & Movement","url":"a#I.zip/I%2FIce%20Age%20%28E%29.gba","filesize":1,"score":5.5,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Prehistoric > Licensed","desc":"<p>The game relates to the story of the movie \"Ice Age\" with the player taking control of Manny to take him across ten levels carrying the lost human baby Roshan to return him to his kind. In each level, the player finds acorns which act as health. Enemies are countered by jumping on them, stomping the ground, walloping them with Manny's trunk or by launching a giant acorn. Some of the levels will have the player take control of Sid to run through a hazardous plain with various pitfalls and enemies until he reaches the end. When a certain number of acorns remains in the player's inventory by the end of a level, the player can acquire extra content.</p>"},{"name":"Ice Age 2: The Meltdown","year":2006,"developer":"Amaze Entertainment, Inc.","url":"a#I.zip/I%2FIce%20Age%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":6.7,"genres":"Action > Diagonal-down > Side view > Isometric > Puzzle elements > Licensed","desc":"<p>This puzzle-adventure game follows the story of the film, where three companions must navigate a dangerous, thawing world.</p><p>Players play as all three animal friends, and can switch between them at will to use their distinct abilities to solve each level's terrain hazards. Manny the mammoth can use his great strength to push large boulders, or swim through deep lakes; Diego the sabertooth tiger can swipe his way through thorny bushes and leap chasms; Sid the sloth can melt ice blocks, climb walls, and cross cracking iceflows.</p><p>Breaking up the puzzle-solving action are several Scrat levels, where players control the hyper rodent through insanely-fast sidescroller levels where he leaps, tunnels, and flies through the scenery to collect his precious acorns.</p><p>There are over 30 adventure levels, boss levels, and a half-dozen Scrat levels.</p>"},{"name":"Ice Climber","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Ice Nine","year":2005,"developer":"Torus Games Pty. Ltd.","url":"a#I.zip/I%2FIce%20Nine%20%28UE%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > 1st-person > Shooter > Direct control > Contemporary > North America > Spy / espionage","desc":"<p><em>Ice Nine</em> is a first person shooter where player assumes a role of newly-enlisted CIA operative. The game starts at Langley with a series of training missions: target practice and live exercise with marker pellets instead of real bullets, where you need to mark your fellow operatives in a real urban area. However that training ends on a sour note as you learn that one of your colleagues could possibly be a mole that tries to leak and sell a deadly computer virus called Ice Nine. Since there's no hard proof it becomes your new mission to infiltrate CIA and find it - not without help from your chief.</p><p>The game is using 3D-engine similar to <em>Doom</em> or Dark Forces - it can display some simple texture mapped 3D architecture, has variable level height, ladders, elevators, but the characters are sprite-based and there's no free look. Many objects on levels could be destroyed or at least damaged. The game is majorly run'n'gun exercise where doors are opened automatically to not slow down the action and most of the goals include finding keys or objects and eliminating all of the opposition, however in several missions the CIA agent must avoid security cameras and use night vision to move in the dark.</p><p>There are 18 missions, but some of the locations are reused throughout the game. <em>Ice Nine</em> arsenal offers a standard FPS set that has everything from a handgun to rocket launcher, also there's a sniper rifle that can be used with a zoom feature.</p>"},{"name":"Imakuni? no Ball","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Incredible Hulk, The","year":2003,"developer":"Pocket Studios","url":"a#I.zip/I%2FIncredible%20Hulk%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.5,"genres":"Action > Diagonal-down > Isometric > Licensed","desc":"<p>You play Dr. Bruce Banner, who's life is turned upside down after a freak accident in the lab transform his rage into The Incredible Hulk, a massive green muscle machine that is unstoppable once started.</p><p>Based on the long running comic book series (and not the 2003 film, The Hulk) you must control the green giant through 33 levels of intense action in which multiple enemies will attack you at once, walls can be bashed through to get to other areas, and anything that gets in your way can either be destroyed or used as a weapon.</p><p>Also included is a 4 player mode in which each player takes control of a different coloured Hulk in an all-on-all brawl.</p>"},{"name":"Incredibles, The","year":2004,"developer":"Helixe","url":"a#I.zip/I%2FIncredibles%2C%20The%20%28E%29%20%28M2%29.gba","filesize":1,"score":6.3,"genres":"Action > 3rd-person (Other) > Side view > Licensed","desc":"<p>In the game based on the movie of the same name, you take control of Mr. Incredible when he is summoned to the island of Nomanisan for a secret assignment. The GBA version is a side-scrolling 2D beat-em-up. Initially, you can only play as Mr. Incredible but the other members of the family, along with Frozone, are playable in the later levels. The main buttons are used for basic attacks, combos and jumps, and the R button triggers special abilities known as \"incredi-moves\". Each member has a different special move: Mr. Incredible gets super strength, Dash runs faster, Violet has a force field and becomes invisible, and Helen can extend her arms. Using these depletes an additional meter on the screen. It is recharged by collecting icons and defeating enemies.</p><p>Next to the icons used for incredi-moves, you can also collect band-aid to restore your health, extra lives, and frozone bottles. There are more than 30 levels, with a few chase sequences (playing as Dash), and familiar characters such as Syndrome, E and Bomb Voyage make an appearance. Both the enemies, carrying a variety of weapons, and the levels have a distinct hand-drawn, comic-book look, rather than mimicking the 3D visuals from the film. After completing a level, you receive a password to continue the next time.</p>"},{"name":"Incredibles, The: Rise of the Underminer","year":2005,"developer":"Helixe","url":"a#I.zip/I%2FIncredibles%2C%20The%20-%20Rise%20of%20the%20Underminer%20%28E%29%20%28M7%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>TWICE THE ACTION!<br>TWICE THE DANGER! TWICE THE HEROICS!<br>Join Mr. Incredible and Frozone as they battle the evil Underminer.</p>"},{"name":"Inspector Gadget Racing","year":2002,"developer":"Bit Managers S.L.","url":"a#I.zip/I%2FInspector%20Gadget%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Licensed","desc":"<p>Based on the animated cartoon by DIC (Super Mario Bros. Super Show, all three Sonic cartoons, The Real Ghostbusters) of the same name, <em>Inspector Gadget Racing</em> is a racing game developed by Bit Managers that is similar to games like the Mario Kart series, Vivid Image's Street Racer and other kart racing games for the SNES and Game Boy Advance. Selectable characters include Inspector Gadget (with both the Gadget Van and Gadget Mobile), Penny/Sophie (in a 4X4 truck), Brain (in an ice cream truck), Chief Quimby (in a police car), Dr. Claw, Agent Abdul (in a truck) and Agent Bruce.</p><p>The characters have their own power ups, for example Penny/Sophie has a shield, Gadget has his Gadget Mallet and Agent Bruce has an oil slick Spy Hunter-style. They can still pick up other power-ups, like missiles, bubblegum (to slow down an opponent), a shield and others. The game also has land-based courses, air-based courses and underwater-based courses</p><p>The game has multiple languages, like LSP's other Inspector Gadget game for the Game Boy Advance, Inspector Gadget: Advance Mission (English, Spanish, German, French, Italian and Dutch)</p>"},{"name":"Inspector Gadget: Advance Mission","year":2001,"developer":"Magic Pockets SAS","url":"a#I.zip/I%2FInspector%20Gadget%20-%20Advance%20Mission%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":6.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>Based on the DIC animated show of the same name, <em>Inspector Gadget: Advance Mission</em> is a standard platform game, similar to those that were seen in the 90's or Hudson Soft's Inspector Gadget game on the SNES. The game lets you control the titular character (Inspector Gadget), his niece (Penny/Sophie) and his dog (Brain), all which have different abilities, such as high jump, planting dynamites or using the Gadget 'Brella as a parachute (Gadget), swimming underwater and controlling or self-destructing robots (Penny/Sophie) and faster speed, double jump and a disguise to fool enemies (Brain). All this is required to stop Dr. Claw from his evil schemes.</p><p>The European version features multiple languages (English, Spanish, German, French, Italian and Dutch)</p>"},{"name":"International Karate Advanced","year":2001,"developer":"Studio 3 Interactive Entertainment Ltd.","url":"a#I.zip/I%2FInternational%20Karate%20Advanced%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Sports > Side view > Arcade > Fighting > Martial arts","desc":"<p><em>International Karate Advanced</em> is a remake of International Karate 2000, with the three-way free-for-all from Internation Karate + rather than the standard one-on-one from the other games in the series. The game features the same twelve playable characters, but now their skills are displayed on a scale of one to five stars. The same classic bonus games from the previous games have returned, as well as a practice dojo, which was previously included in <em>International Karate 2000</em>.</p>"},{"name":"International Superstar Soccer","year":2001,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"a#I.zip/I%2FInternational%20Superstar%20Soccer%20%28E%29%20%5B%21%5D.gba","filesize":1,"score":7.3,"genres":"Action > Sports > Diagonal-down > Isometric > Football (European) / Soccer > Licensed","desc":"<p><em>International Superstar Soccer</em> brings the soccer series to battery-powered life, with gameplay resembling the original SNES game. The action is viewed from above, with players drawn large, and the area of the screen in view is pre-defined. </p><p>In this edition you can play a knockout cup competition as well as friendlies and penalty practice. 40 teams are featured, with the real players all present with 9 different ability categories. There are 5 difficulty levels.</p><p>A running commentary by Jon Champion is provided. There are 8 different formations and 8 strategies on offer, and man-marking can be specified.</p>"},{"name":"International Superstar Soccer Advance","year":2003,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"a#I.zip/I%2FInternational%20Superstar%20Soccer%20Advance%20%28E%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > Football (European) / Soccer","desc":"<p><em>International Superstar Soccer Advance</em> is the second Konami football game to appear on the GBA, with several updates compared to its predecessor.</p><p>The game contains 58 national teams, up from 40 in the previous game. There no longer is a license for real players' names, though, so all players are fictional. Returning game modes are friendlies, the international cup and penalty shootouts. The new Super Star Mode is a series of do-or-die three-minute matches against superstar teams.</p><p>The view on the pitch has been adjusted from the isometric perspective of the predecessor to a view from the sidelines. As before, the game allows to set a variety of formations and strategies. It also includes a choice of weather, different stadiums and referees, and again, running commentary by Jon Champion and a two-player mode via link cable.</p>"},{"name":"Invader","year":2002,"developer":"Lost Boys Games","url":"a#I.zip/I%2FInvader%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p><em>Invader</em> is a vertical scrolling shoot-em-up for the Nintendo Game Boy Advance. There are 8 levels to shoot through each ending with a end-boss. The player can select from 2 different ships each with specific features. Enemies leave coins that can be spent in the Shop, where upgrades such as weapons, extra lives, and credits are available for purchase.</p><p>Game modes include Arcade, Survival, Boss Attack and 2 player Cooperative via the Link cable.</p>"},{"name":"Invincible Iron Man, The","year":2002,"developer":"Torus Games Pty. Ltd.","url":"a#I.zip/I%2FInvincible%20Iron%20Man%2C%20The%20%28U%29.gba","filesize":1,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Trouble at Stark Enterprises: Tony Stark aka Iron Man finds that one of his Iron Man suits has been stolen. Given enough time, the thief might be able to reverse engineer the technology and use it to find weaknesses to exploit or, even worse, duplicate it and use it for sinister purposes. Thankfully, each suit is outfitted with a locator beacon. Tony slips into one of his remaining suits and sets out to get the stolen suit back and find out who is behind the theft.</p><p>Iron Man's quest will take him through a number of large levels in a side-scrolling platformer. His primary weapon against the many enemies awaiting him is the repulsor blast fired from the gauntlets of the suit. Another attack is a quick shoulder tackle. The boot jets of the suit allow Iron Man to get to places not reachable with a normal jump.</p><p>Firing the repulsor blast depletes the energy supply of the suit. The supply slowly recharges on its own, but a quicker way to regain spent energy is finding energy powerups. Other powerups include health boosts and some special weapons.</p><p>At the end of some levels, boss battles await. Between the levels, comic-style cutscenes continue the storyline.</p>"},{"name":"Iridion 3D","year":2001,"developer":"Shin'en Multimedia GmbH","url":"a#I.zip/I%2FIridion%203D%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":6.3,"genres":"Action > Behind view > Video backdrop > Arcade > Rail shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>In this Afterburner-inspired Gameboy Advance launch title, a player pilots the SHN fighter through seven pseudo-3D levels. Returning to Earth from a space mission, the protagonist notices that the Iridion empire has taken over. The SHN fighter can be upgraded with five different types of weapons for varying methods of destruction. This is German developer Shin'en's first English game, however, they have prior experience, having developed sound drivers for both the GBA and GBC.</p>"},{"name":"Iridion II","year":2003,"developer":"Shin'en Multimedia GmbH","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Iridion%20II%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Action > Simulation > Behind view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>This sequel to Iridion 3D is different in gameplay, but twice as much action. Piloting in Kiloblaster Style mechanics from a 3D perspective, you fight through 15 levels of pulse-pounding action that will keep you up all night. Six different weapons with upgrade ability will give you awesome firepower to stop your foes.  The storyline goes that a hundred years have passed since the Earth was attacked by the vicious IRIDION forces. Wanting revenge over their lost systems, they attack once more. Earth is too far away to send help, and you're the only one that could stop them.</p>"},{"name":"Island Xtreme Stunts","year":2002,"developer":"Silicon Dreams Studio Ltd.","url":"a#I.zip/I%2FIsland%20Xtreme%20Stunts%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Racing / Driving > Side view > Top-down > 2D scrolling > Real-time > Direct control > Licensed","desc":"<p>BE PEPPER THE STUNTMAN HERO<br>* Drive, jet ski, motorbike and fly Pepper to stuntman victory over the dastardly Brickster<br>* Rack up points to progress toward gold stars and Stuntman Superstar status<br>* Practice spins, grabs and grinds in the skateboard park<br>* Multiplayer competition on select stunt action games<br>* Earn Stuntman Superstar status across all games to unlock hidden levels</p>"},{"name":"It's Mr Pants","year":2004,"developer":"Rare Limited","url":"a#I.zip/I%2FIt%27s%20Mr.%20Pants%20%28U%29.gba","filesize":1,"score":7.5,"genres":"Puzzle > Top-down","desc":"<p>Rare's website mascot, Mr. Pants, stars in his very own video game for the Game Boy Advance.  He's prepared hundreds of fiendish puzzles to scramble your brain!</p><p>Pieces fall onto the game board with only a limited time to place them.  To clear the pieces, players will need to make shapes that are at least a 2x3 rectangle, or bigger rectangles and squares.  Three different modes of play are available - Puzzle, Wipeout, and Marathon - and progressing through the puzzles will earn players assorted bizarre underwear-clad artwork.</p>"},{"name":"Itsudemo Puzzle, The: Massugu Soroete Straws","year":2003,"developer":"BeeWorks Co., Ltd."}]