[{"name":"Jackie Chan Adventures: Legend of the Dark Hand","year":2001,"developer":"Torus Games Pty. Ltd.","url":"a#J.zip/J%2FJackie%20Chan%20Adventures%20-%20Legend%20of%20The%20Dark%20Hand%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":7.2,"genres":"Action > Side view > Beat 'em up / brawler > Platform > Licensed","desc":"<p><em>Jackie Chan Adventures: Legend of the Dark Hand</em> is a side-scrolling brawler reminiscent of Double Dragon or Final Fight. Players take control of Jackie Chan and kick and punch their way through ten levels utilizing a wide range of attacks. Levels contain pickups which may be wielded as weapons including umbrellas, baseball bats and more.</p>"},{"name":"James Pond 2: Codename: RoboCod","year":2004,"developer":"Vectordean Ltd.","url":"a#J.zip/J%2FJames%20Bond%20007%20-%20Nightfire%20%28U%29%20%28M3%29.gba","filesize":1,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>In his second adventure, James Pond must retrieve the toys Dr. Maybe has stolen. Pond has been armed with an Inspector Gadget-style stretch device, which he can use to view higher areas or claw onto ceilings so as to slide across them.</p><p>The gameplay takes place across worlds themed around particular types of toys, such as sporting goods, candy, and aircraft. The levels scroll sideways, although a small amount of vertical movement is included. On each level Pond must collect 2 penguins and reach the exit, although there are usually multiple exits and lots of secret areas to explore. After completing each pair of two worlds (each of which has three sub-levels), a boss must be faced.</p>"},{"name":"Jazz Jackrabbit","year":2002,"developer":"Game Titan","url":"a#J.zip/J%2FJazz%20Jackrabbit%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic","desc":"<p>A cross between Bugs Bunny and Han Solo, Jazz is up to his usual world saving tricks, although this time there's an even bigger incentive: money.</p><p>In an original GBA exclusive title, Jazz must explore 24 levels for as much money as he possibly can. That money can then go towards new weapons with which to destroy the enemy, such as the usual assortment of blasters, rocket launchers and flamethrowers.</p><p>Along with the single player adventure, multiplayer modes are also included for up to 4 people, with game modes ranging from the usual deathmatch style to capture the flag.</p>"},{"name":"Jet Grind Radio","year":2003,"developer":"Vicarious Visions, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Jet%20Grind%20Radio%20%28USA%29.zip","filesize":1,"score":7,"genres":"Action > Sports > Diagonal-down > Isometric > Tricks / stunts > Skateboarding > Sci-fi / futuristic","desc":"<p>Dreamcast cult classic Jet Grind Radio's adaptation to the Game Boy Advance takes the concept of the original game and distills it for the capabilities of the handheld, with somewhat simplified gameplay and the levels adapted from cel-shaded 3D to isometric 2D.</p><p>The story is the same as in the original game: in the near-future metropolis of Tokyo-to, the player controls members of the teen gang the GG's, who are in a turf war with rival gangs and must also avoid the law in the form of Captain Onishima and his forces. Players must skate through fifteen distinct levels, collecting spray cans and spraying graffiti at certain spots within a time limit while avoiding the cops.</p><p>Most of the original game's levels have been transposed to the isometric viewpoint (two have been combined into one), even though some of the interactivity is lost (like traffic or sprayers from rival gangs). The graphics engine used is similar to that in developer Vicarious Visions's earlier entries in the Tony Hawk series.</p><p>Progressing through the game unlocks several unique mini-games that can be played by up to four players via link cable: Throw Down and Tricky can be played in teams. Tricky is a run for a high score by performing tricks and stunts, Throw Down asks players to knock each other over and spray the other's backs for points. Turf Wars asks players to tag designated areas, while Killer Crush is a two-player race for a tagging spot.</p><p>Like the original, the GBA version features a Create-A-Graffiti mode. A unique feature is Jet Set Radio DJ Professor K as an unlockable playable character. The game features cut-down loops of six of the original game's signature music tracks.</p>"},{"name":"JGTO KÅnin Golf Master: Japan Golf Tour Game","year":2001,"developer":"KCE Nagoya"},{"name":"Jonny Moseley Mad Trix","year":2002,"developer":"RTG Studios","url":"a#J.zip/J%2FJonny%20Moseley%20Mad%20Trix%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Sports > Isometric > Tricks / stunts > Snowboarding / skiing","desc":"<p>Jonny Moseley Mad Trix is an extreme skiing game, in the vein of Tony Hawk's Pro Skater and Dave Mirra Freestyle BMX.</p><p>As Jonny Moseley, Tanner Hall, or a number of other skiers, you must perform various stunts while racing down several different courses, including both mountains and cities, to unlock more courses and secret characters.</p><p>The GBA version has an isometric viewpoint, instead of the 3D of the console versions, and has simplified controls.</p>"},{"name":"Juka and the Monophonic Menace","year":2005,"developer":"Orbital Media, Inc.","url":"a#J.zip/J%2FJuka%20and%20the%20Monophonic%20Menace%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":6.4,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Puzzle elements > Fantasy","desc":"<p>A long time ago, the mysterious \"Ancients\" created machines across the land that were able to harness the power of sound. The Ancients disappeared, leaving only their devices for future civilizations to discover. Years later, the \"Settlers\" arrived and built their cities in the lands where the machinery was left, and all was prosperous.</p><p>However, nothing remains perfect forever. Powerful alchemists tried to harness the power of the Ancients' machines in their lust for power, and war broke out. Those that tried to use the Ancients' machines, or The Dark Alchemists, as they became known, were killed or exiled, and peace eventually returned. Rumour has it though, that the last of the Dark Alchemists, the Monophonic Menace, has returned to conquer the world.</p><p><em>Juka and the Monophonic Menace</em> is an action-adventure game. The title character, Juka, is an alchemist who can collect ingredients from trees, water, bushes, and other places to mix and create potions. Potions can be used as a form of defense against enemies, can alter the landscape, or even activate machines. Juka also has a \"Sound Staff\", which can be used to absorb and fire back different types of sounds at certain enemies.</p>"},{"name":"Jumping Doduo","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Jurassic Park III: Island Attack","year":2001,"developer":"Mobile21 Co., Ltd.","url":"a#J.zip/J%2FJurassic%20Park%20III%20-%20Dino%20Attack%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.3,"genres":"Action > Diagonal-down > Side view > Isometric > Platform > Licensed","desc":"<p>More closely based on the events of the movie, Jurassic Park III, you play Paleontologist Alan Grant who is part of an observation of Isla Sorna. Little did he and the rest of the team know that Isla Sorna is home to 'site B', the test island for the Jurassic Park Island destroyed some years before hand. And soon enough thier place crash lands on the island.</p><p>You must now find your way through 8 levels of dinosaurs, varying in strength and speed, to a resuce boat on the other side of the island. You can either run from the many dinos in your way or pick up and use items to attack the dinos.</p>"},{"name":"Jurassic Park III: Park Builder","year":2001,"developer":"Konami Corporation","url":"a#J.zip/J%2FJurassic%20Park%20III%20-%20Park%20Builder%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.1,"genres":"Simulation > Isometric > Managerial / business simulation > Licensed","desc":"<p>If you've ever wanted to create your own Dinosaur theme park like in the original movie, Jurassic Park, then this is for you. Search for dino DNA around the world and return it to your park to create dinosaurs for people around the world to see. From here you can build rides, shops, food outlets, dino facilities and more. Then once the park is built and ready to go, you can open it to the public and manage it, making sure nothing goes wrong with the dino's or the general public, and money keeps rolling in to pay for expenses.</p>"},{"name":"Jurassic Park III: The DNA Factor","year":2001,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"a#J.zip/J%2FJurassic%20Park%20III%20-%20The%20DNA%20Factor%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":5.4,"genres":"Action > Side view > Platform > Puzzle elements > Licensed","desc":"<p>A unique combination of side-scrolling platform and puzzle solving genres, where you must solve the puzzles behind the DNA of many of the dinosaurs featured in the movie Jurassic Park 3, and many others featured in the rest of the Jurassic Park movie series.</p><p>You start by choosing one of two characters, a professional photographer or pilot, and find your way through more than 12 levels of side-scrolling action, dodging dino's and other dangerous hazards. Along the paths are pieces of DNA. The task for each level is to collect enough DNA to open the exit at the end, opening the second part of the game, Dinosaur Creation. </p><p>With the DNA you have collected, you must match them together correctly to create 10 different species of dinosaur. As you reach further into the game, the harder it becomes to correctly match the DNA samples.</p>"},{"name":"Jurassic Park Institute Tour: Dinosaur Rescue","year":2003,"developer":"KAZe Co., Ltd.","url":"a#J.zip/J%2FJurassic%20Park%20-%20Institute%20Tour%20-%20Dinosaur%20Rescue%20%28J%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Action > Mini-games > Direct control > Contemporary > Licensed","desc":"<p>Based on the Japan-exclusive traveling exhibition <em>Jurassic Park Institute Tour</em>, this minigame collection has players taking part in five different dinosaur-themed minigames.</p><ul><li>Cross Dinosaur: A simple Frogger-style game. A helicopter lands on the far side of a field, and players have to dodge rampaging dinosaurs to reach it. Each person who reaches the helicopter gives the player 10 points, and the game continues until the player is hit by dinosaurs three times.</li><li>Danger Zone: A sidescrolling game similar to Cross Dinosaur. Players control a dinosaur moving from the grass on the left side of the screen to a cave on the right while dodging falling rocks propelled from an active volcano.</li><li>Egg Guard: Players control a mother dinosaur guarding her nest from humans who are coming from all eight directions. Players can scare away egg thieves by facing them straight on, but will lose a life if they let the thief reach the eggs.</li><li>Rexercise: A \"Simon Says\"-style game. Players control a dinosaur who must remember sequences of button presses. Every time the player completes a round, players another button is added to the end. The game ends after the player makes three mistakes.</li><li>Take Meat: Players control a mother dinosaur caring for her child. The nest is on one side of the screen, while some meat is on the other side. From a sidescrolling perspective, players have to make their way to the right side and fetch food, then bring it back safely to the nest while dodging falling rocks.</li></ul>"},{"name":"Justice League Heroes: The Flash","year":2006,"developer":"WayForward Technologies, Inc.","url":"7#Justice%20League%20Heroes%3B%20The%20Flash%20%28USA%29.gba","filesize":8388608,"score":6.6,"genres":"Action > 3rd-person (Other) > Side view > Sci-fi / futuristic > Licensed","desc":"<p><em>Justice League Heroes: The Flash</em> is a handheld spin-off of Justice League Heroes. You play as The Flash in a game that plays something like Final Fight on speed.</p><p>An army of robots has invaded Earth, starting with Flash's hometown of Keystone City. Flash must defeat them there as well as other DC Comics' locales such as Metropolis, Gotham City and the Amazon.</p><p>As usual for this genre, you walk from left to right and punch and kick enemies using combo attacks until their life-bar is depleted with an occasional boss-battle. However, this has the added twist of Flash's super speed powers. There is a button to instantly dash to the next enemy and another slows down time, though Flash himself still moves normally, allowing him to run around defeating multiple enemies before they can react.</p><p>While Flash is the only playable character, other Justice League members do have cameo appearances, Black Canary, Superman, Wonder Woman, Martian Manhunter and Green Arrow can all be summoned to proved brief assistance in clearing enemies.</p><p>In addition to the main story mode, there is a boss rush mode, a minigame where you race Superman and a making-of.</p>"},{"name":"Justice League: Chronicles","year":2003,"developer":"Full Fat Productions Ltd.","url":"a#J.zip/J%2FJustice%20League%20Chronicles%20%28U%29.gba","filesize":1,"score":5.8,"genres":"Action > Side view > Isometric > Sci-fi / futuristic > Licensed","desc":"<p><em>Justice League: Chronicles</em> is the sequel to Injustice for All and like its predecessor, is based on the Cartoon network Justice League animated series.</p><p>When Martian Manhunter spots a powerful psychic presence in the arctic, it's up to the other six members of the Justice League to investigate. each level, you'll control a pair of super-heroes. In single-player, you'll switch between them with the select button and the inactive character will be handled by the AI. There is also a cooperative mode, where a second player links up and you each control a character.</p><p>There are three sets of levels: Green Lantern and Flash, Superman and Wonder Woman and finally Batman and Hawkgirl. The levels are presented in a pseudo-3D fashion with characters able to move along the x and z axes. Levels could have you moving up, left right or down to reach your objective, or stuck in one place with the enemies coming to you.</p><p>The fighting system involves the standard jump and attack button, but also has special attacks that are unique to each character. This attack is controlled by a special meter below the health meter. use of you character's special completely depletes this meter and it cannot be used again until the meter fills back up, which takes several seconds.</p><p>In addition to the main story mode, there is a Watchtower training mode which allows you to use any pair of characters in any level. However, you cannot use two of the same character.</p>"},{"name":"Justice League: Injustice for All","year":2002,"developer":"Saffire, Inc","url":"a#J.zip/J%2FJustice%20League%20-%20Injustice%20for%20All%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.2,"genres":"Action > Side view > Platform > Licensed","desc":"<p>The Justice league, Superman, Batman, Wonder Woman, The Flash, Green Lantern, Hawkgirl and Martian Manhunter, must combine their strengths to defeat the injustice league (The Joker, Lex Luthor, Mongul, Cheetah, Solomon Grundy, The Shade, Star Sapphire, Copperhead, Gorilla Grodd, Felix Faust and The Manhunter Robots) who are out to create chaos in the world once more.</p><p>Each level has you playing as two of the justice league, and you must switch between the two during gameplay to defeat enemies, find the hidden key cards and defeat the injustice league member waiting for you at the end. Each hero has unique abilities (such as flight, strength, speed, etc.) that must be used in order to complete the level properly.</p>"}]