[{"name":"Kamaitachi no Yoru","year":2002,"developer":"Chunsoft Co., Ltd.","url":"a#K.zip/K%2FKamaitachi%20no%20Yoru%20Advance%20%28J%29.gba","filesize":1,"score":"","genres":"Adventure > Visual novel > Detective / mystery > Horror","desc":"<p>Tōru and his girlfriend Mari are on vacation at a skiing lodge when they find themselves suddenly drawn into a horrible murder mystery. The player must solve the crime. If they are too slow in collecting clues, additional murders will be committed, and will eventually result in a horror movie-like ending. The goal is to complete the story and get a certain number of endings. When this happens, two more stories are unlocked. Getting every possible ending of all three stories will unlock two more stories, these being self-parodies. Completing these unlocks one final feature, a parody of Torneko no Daibōken: Fushigi no Dungeon. None of the stories are related to each other in any way, but they all feature the same characters.</p><p>The gameplay mostly consists of still pictures with text covering the whole screen, which must be read. The player must make choices, including the choice of pointing out who the murderer is. Clues are often misleading, and the true clues are often well-hidden in nonsensical places, like ridiculous dialogue.</p>"},{"name":"Kao the Kangaroo","year":2001,"developer":"Titus Interactive, S.A.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Kao%20the%20Kangaroo%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1,"score":6.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>Crikey! Kao's been stolen from down under! It's up to you to get him home to the Outback.</p><p>Unlike the Windows and Dreamcast versions of this game, the GBA version is a 2D side scrolling platform game. You control Kao the Kangaroo through twenty-seven levels. You basic modes of travel are running or jumping but in later levels, you will have snowboarding, flying and jet skiing. As you travel along, enemies try to stop you. You must kill or avoid these enemies. Your main weapon is a pair of boxing gloves with which you can pound enemies but, if you push down and attack, you can also do a tail spin to attack lower-height enemies. In each level, there are flags you can pick up and, by pressing select, you can drop them to create your own continue point.</p>"},{"name":"Karnaaj Rally","year":2002,"developer":"Infinite Dreams Inc.","url":"a#K.zip/K%2FKarnaaj%20Rally%20%28U%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Top-down > 2D scrolling > Arcade","desc":"<p><em>Karnaaj Rally</em> is a handheld racing game which is played from a top down perspective and mixes 2D and 3D graphics. It's an arcade racer similar to Micro Machines where the player competes against three other racers on a number of different tracks. To his help, the player has a temporary turbo which he can refill by driving over special items that he finds on the race tracks. Weapons exist too; rockets and mines can be used by the player to stop the competition from winning. </p><p>The game's career mode allows the player to compete and progress in four different race series. Each of these has unique vehicles and courses. While racing the player can earn money which can be used to upgrade the car's tires and engine as well as buy more armor, rockets and mines. There's also a gambling option. The player can bet by guessing on different outcomes from the races, such as the right finishing order. </p><p>The game also has a multiplayer mode for up to four players.</p>"},{"name":"Kawa no Nushi Tsuri 3 & 4","year":2006,"developer":"Victor Interactive Software, Inc.","url":"a#K.zip/K%2FKawa%20no%20Nushi%20Tsuri%203%20and%204%20%28J%29.gba","filesize":1,"score":"","genres":"Sports > Top-down > Anime / Manga > Fishing","desc":"<p><em>Kawa no Nushi Tsuri 3 &amp; 4</em> is a compilation of remakes of Legend of the River King GB and Legend of the River King 2. The games have enhanced graphics.</p>"},{"name":"Kawa no Nushi Tsuri 5: Fushigi no Mori Kawa","year":2002,"developer":"Tose Co., Ltd.","url":"a#K.zip/K%2FKawa%20no%20Nushi%20Tsuri%205%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Simulation > Sports > Diagonal-down > Isometric > Fishing","desc":"<p>In this game, the player's father takes them on a fishing trip out in the country. After being pulled into the water, they end up in a strange realm where the people have been cursed and turned into fish. The player must save the people and undo the transformation by catching them. This time around, battles are fought with the fish themselves rather than random encounters.</p>"},{"name":"Keitai Denjuu Telefang 2: Power (Limited)","year":2002,"developer":"Natsume Co., Ltd.","url":"a#K.zip/K%2FKeitai%20Denjuu%20Telefang%202%20-%20Power%20Version%20%28J%29%20%5BT%2BEng0.05_PmHacks%5D.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Sci-fi / futuristic","desc":"<p>In this second paired game in the <em>Keitai Denjū Telefang</em> series, a new T-Fanger named Kyou becomes involved in a struggle against the evil Denjū named Diablos, who wants to permanently cut off humanity's access to the Denjū world. Now that Diablos has killed all but one of the antenna trees, it's up to Kyou to stop him before the two worlds are completely separated, which would leave Kyou stuck in the Denjū world forever.</p><p>Gameplay is similar to the original pair of <em>Telefang</em> games, but with some added enhancements. Several new Denjū are available, and many old ones now have different evolution methods. Attacks now receive their own typing independent of the Denjū, meaning a monster with the right move can cover its own weaknesses in battle. New types of items are also introduced, including healing items and ones that increase the chance of a defeated Denjū sharing its phone number with Kyou. Lastly, befriended Denjū have their own friends, which may randomly appear to assist in battle even if Kyou has never met them before.</p><p>As with the earlier games in the series, <em>Power Version</em> was released as part of a pair, with Speed Version being its counterpart. Certain Denjū are exclusive to one version or the other, and players can connect their games via Game Link Cable in order to trade and battle their collected Denjū.</p>"},{"name":"Keitai Denjuu Telefang 2: Speed (Limited)","year":2002,"developer":"Natsume Co., Ltd."},{"name":"Kelly Slater's Pro Surfer","year":2002,"developer":"HotGen Ltd.","url":"a#K.zip/K%2FKelly%20Slater%27s%20Pro%20Surfer%20%28U%29.gba","filesize":1,"score":7.1,"genres":"Action > Sports > 3rd-person (Other) > Tricks / stunts > Surfing > Licensed","desc":"<p><em>Kelly Slater's Pro Surfer</em> takes the player around the world to surf some of the more famous beaches. With a control scheme similar to all the other Activision O2 brand games, it's easy to jump into the game and surf.</p><p><strong>Surf Modes:</strong>  </p><p><strong>Championship</strong> - Compete against eight other surfers. The player progresses by surfing in twelve stages, three heats per stage. The score is tallied from each heat and the top three surfers of the stage get to move on.</p><p><strong>Challenge</strong> - Pick a surfer and do challenges around the world.</p><p><strong>Drop In</strong> - Instant action surfing - go and just surf.</p><p><strong>Multiplayer</strong> - With a Link Cable and another copy of the game two players can link up to compete against each other.</p><p>The professionals in the game are: Kelly Slater, Lisa Andersen, Tom Carroll, Tom Curren, Nathan Fletcher, Donavon Frankenreiter, Bruce Irons, Rob Machado, Kalani Robb, and some other secret characters.</p><p>The beaches in the game: Sebastian, Trestles, Mavericks, Waimea Bay, Jaws, Pipeline, Teahupoo, Bells, Curren's Point, Kirra, G-Land, J-Bay, Mundaka, Cortez Bank, and perhaps some other tucked-away hide-aways.</p>"},{"name":"Kessakusen! Ganbare Goemon 1+2: Yuki-hime to Magginesu","year":2005,"developer":"","url":"a#K.zip/K%2FKessakusen%20Ganbare%21%20Goemon%201%20and%202%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Compilation > Side view > Anime / Manga > Arcade","desc":"<p>A port of the SNES adventure/platformers Legend of the Mystical Ninja and its sequel, Ganbare Goemon 2: Kiteretsu Shogun Magginesu for the GBA. In both games you play as the wily Goemon, a wacky adventurer from feudal japan, as he attempts to fight evil across the land.</p><p>Both games are action platformers, with the unique addition of several mini-games and different gameplay sequences to mix things up a little. Goemon (and his pal Ebisumaru in the sequel) can use a wide variety of weapons and items, which can be collected in-game or bought at special stores.</p><p>For the GBA version both games have been updated with a save-game feature, as well as with minor fixes and additions (such as the ability to switch characters on the fly). There's also a new playable character for the second game, new graphic effects and new mini-games which once unlocked can be played directly from the main menu.</p>"},{"name":"Kid Icarus","year":2004,"developer":"Nintendo R&D1"},{"name":"Kid Klown in Crazy Chase","year":2002,"developer":""},{"name":"Kid Paddle","year":2005,"developer":"Mistic Software Inc."},{"name":"Kidō Gekidan Haro Ichiza: Haro no Puyo Puyo","year":2005,"developer":""},{"name":"Kill.Switch","year":2004,"developer":"Visual Impact","url":"a#K.zip/K%2FKill%20Switch%20%28E%29%20%28M5%29%20%5BhIR%5D.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Shooter","desc":"<p><em>Kill.switch</em> is the handheld version of the third-person shooter game kill.switch. It has several differences, like the number of levels (only six in this version).</p><p>The player controls a soldier who must complete missions and kill enemies and bosses, moving from area to area to engage new enemy groups. The game has a cover system that allows the player to \"attach\" to objects and fire at the enemies from a safe position.</p><p><em>Kill.switch</em> has full 3D graphics, a rarity for a Game Boy Advance game.</p>"},{"name":"Killer 3D Pool","year":2005,"developer":"Gravity-i Ltd","url":"a#K.zip/K%2FKiller%203D%20Pool%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Sports > 1st-person > Top-down > Pool / snooker","desc":"<p><em>Killer 3D Pool</em> is a pool game that features four games for players: English 8-ball, U.S. 9-ball, U.S. 8-ball, and Killer.</p>"},{"name":"Kim Possible 2: Drakken's Demise","year":2004,"developer":"Artificial Mind & Movement","url":"a#K.zip/K%2FKim%20Possible%202%20-%20Drakken%27s%20Demise%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.gba","filesize":1,"score":7.5,"genres":"Action > Side view > Platform > Detective / mystery > Spy / espionage > Licensed","desc":"<p>The cheerleader and undercover secret agent, Kim Possible, returns in her second platform game for the Game Boy Advance.  Based on four episodes of the TV show, Drakken's Demise lets players take control of Kim as they battle villains such as Falsetto Jones, Duff Killigan, and of course, Dr. Drakken, foiling their attempts at world domination.</p><p>Luckily, Kim has her gadgets - her hair dryer grappling hook, lipstick glue launcher, hot sauce, stealth suit, and compact mirror - to navigate through treacherous enemy terrain and battle dangerous henchmen.  And when things get really tough, her friend Ron's pet mole rat, Rufus, will be able to help out too.</p>"},{"name":"Kim Possible 3: Team Possible","year":2005,"developer":"Artificial Mind & Movement"},{"name":"King of Fighters EX, The: Neo Blood","year":2002,"developer":"Artoon Co., Ltd.","url":"a#K.zip/K%2FKing%20of%20Fighters%20EX%2C%20The%20-%20NeoBlood%20%28E%29.gba","filesize":1,"score":7.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>Two years have now passed since the last edition of \"King of Fighters\" Tournament, accomplished in 1997: after Orochi was sealed by the joint forces of Kyo Kusanagi, Chizuru Kagura and Iori Yagami, all the fighters returned to their normal lives. But suddenly, a mysterious host decided to reopen the tournament and have been sent serial invitations to the most powerful fighters. But there are many secrets surrounding this happy-hour fighting clash, as the apparent disappearance of Iori Yagami and a remote distrust behind this unknown sponsor: that he would be using the championship to accomplish secret operations involving (maybe) the Orochi power...</p><p>This title marks the first installment of King of Fighters Series on Nintendo's 32-bit handheld. It brings a lot of gameplay characteristics based in both KOF Evolution (most of the graphic stuff and principally both \"Striker\" System and backgrounds, now represented by a static 2D frame instead of the original 3D ones) and KOF 2000 (the musical repertoire).</p><p>Besides the traditional game modes (Team Play, Team Battle, Single Play, Single Battle, Endless Survival and Survival Time Attack), this game marks too the debut of a new-exclusive female character named Moe Habana.</p><p>With the permanence of 3 on 3 combats (plus Striker Attacks) and the introduction of a new female fighter, the main cast is composed by:</p><ul><li><em>Hero Team:</em> Kyo Kusanagi, Benimaru Nikaido, Moe Habana and Shingo Yabuki</li><li><em>Fatal Fury Team:</em> Terry Bogard, Andy Bogard, Mai Shiranui and Joe Higashi</li><li><em>Art of Fighting Team:</em> Ryo Sakazaki, Robert Garcia, King and Yuri Sakazaki</li><li><em>Ikari Team:</em> Leona Heidern, Ralf Jones, Clark Steel and Whip</li><li><em>Psycho Soldier Team:</em> Athena Asamiya, Sie Kensou, Bao and Chin Gentsai</li><li><em>Korea Team:</em> Kim Kaphwan, Chang Koehan, Choi Bounge and Jhun Hoon</li></ul>"},{"name":"King of Fighters EX2, The: Howling Blood","year":2003,"developer":"SunTech Company Limited","url":"a#K.zip/K%2FKing%20of%20Fighters%20EX2%2C%20The%20-%20Howling%20Blood%20%28J%29%20%28V1.1%29%20%5BhIRff%5D.gba","filesize":1,"score":7.8,"genres":"Action > Side view > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>A millionaire named Gustav Munchausen is organizing and sponsoring another edition of the world-famous \"King of Fighters\" Tournament. With the championship invitations in hand, the fighters (some of them) decided to participate not just to compare their strength, but also to investigate rumors that Gustav is involved with serial kidnappings involving children and also his involvement with a secret operation related to the Orochi Power.</p><p>Being the second installment of the KOF Series on Nintendo's 32-bit handheld, this title brings a lot of gameplay characteristics and elements taken from its arcade/console counter-part The King of Fighters 2000 like the backgrounds and a good part of its musical repertoire.</p><p>However, a set of additional stuff was included, like the appearance of 3 all-new exclusive characters (the male Reiji Okami and the females Miu Kurosaki and Jun Kagami), 2 new backgrounds, a modified Striker System (where the 2nd and 3rd players of a team will assume progressively this function) and a \"Ranking Mode\", where you'll be rated according to your fighting performance (beginning from Newcomer until Master Orochi).</p><p>With the return of 3 on 3 matches and the introduction of new fighters, the main cast is formed by:</p><ul><li><em>Hero Team:</em> Kyo Kusanagi, Moe Habana and Reiji Okami</li><li><em>Fatal Fury Team:</em> Terry Bogard, Andy Bogard and Mai Shiranui</li><li><em>Ikari Team:</em> Leona Heidern, Ralf Jones and Clark Steel</li><li><em>Korea Team:</em> Kim Kaphwan, Choi Bounge and Chang Koehan</li><li><em>Psycho Soldier Team:</em> Athena Asamiya, Sie Kensou and Bao</li><li><em>Art of Fighting Team:</em> The Sakazaki family (Ryo, Yuri and Takuma)</li><li><em>Yagami Team:</em> Iori Yagami, Jun Kagami and Miu Kurosaki</li></ul>"},{"name":"Kingdom Hearts: Chain of Memories","year":2004,"developer":"Square Enix Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Kingdom%20Hearts%20-%20Chain%20of%20Memories%20%28USA%29.zip","filesize":1,"score":7.5,"genres":"Action > Role-playing (RPG) > Isometric > Platform > Fantasy > Licensed","desc":"<p>Chain of Memories kicks off where the PS2 original left off, with our hero Sora and his companions Donald and Goofy stripped of their powers in a sudden introduction of a new mystery. Sora must go it alone within a dangerous castle to discover the secret behind the sudden loss of power, with Donald and Goofy lending a hand when needed through the use of attack cards.</p><p>During a battle, Sora can choose his attacks and character aids through a card system, combos and special attacks can be performed as well with the right timing in card choice. As an enemy is defeated, further items and cards can be found to increase abilities.</p><p>This unique collaboration between SquareEnix and Disney returns the characters of the animated world into an epic RPG and continues the story exclusively on the GBA.</p>"},{"name":"Kingler's Day","year":2001,"developer":"Nintendo Co., Ltd."},{"name":"Kirby & The Amazing Mirror","year":2004,"developer":"Flagship Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Kirby%20%26%20The%20Amazing%20Mirror%20%28USA%29.zip","filesize":1,"score":7.2,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Puzzle elements","desc":"<p>Kirby stars in his first four-player simultaneous adventure! There's trouble in neighboring Mirror World, but when Kirby goes off to help, he's attacked by a shadowy Meta Knight and split into four colored versions of himself! The four Kirbies set off for Mirror World on an exciting new adventure!</p><p>Kirby &amp; The Amazing Mirror is set out in a Metroid-style manner. The game features one sprawling overworld that players gradually uncover as they progress through the game. It's also possible to discover hidden treasure chests that show the player the overworld layouts, life bar extensions, different colors for Kirby, and unlockable music and sound effects.</p><p>Amazing Mirror uses the familiar 'suck-in and copy' mechanic of other Kirby games, but the addition of having four players able to co-operate simultaneously can make the game easier or more difficult - depending on the situation. There are also three mini-games to play via the Game Boy Advance Single-Cart Multiplayer feature.</p>"},{"name":"Kirby Puzzle","year":2003,"developer":"Nintendo Co., Ltd."},{"name":"Kirby: Nightmare in Dreamland","year":2002,"developer":"HAL Laboratory, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Kirby%20-%20Nightmare%20in%20Dream%20Land%20%28USA%29.zip","filesize":1,"score":7.1,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p><em>Kirby: Nightmare in Dreamland</em> is a remake of Kirby's Adventure. The core gameplay has been changed little, with Kirby absorbing enemies in order to take their powers. In addition to a graphical update, some level designs have been altered, the mini-bosses have been increased in size, one of whom (the rolling turtle) has been replaced with an elephant-like creature, and two new mini-games replace the claw and egg eating mini-games from the original, both of which feature a multiplayer option. Air Grind involves Kirby grinding racing against clones of himself by grinding a warp star against a rail, while Bomb Rally involves the four Kirbys tossing a bomb between each other using frying pans.</p>"},{"name":"Klonoa 2: Dream Champ Tournament","year":2002,"developer":"Namco Limited","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Klonoa%202%20-%20Dream%20Champ%20Tournament%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>Klonoa returns in another puzzle-platform game for the Game Boy Advance.  In this sequel, Klonoa is whisked away to a heroes tournament, where he must compete against friends and foes alike for the title of \"Greatest Hero\".</p><p>New enemies and puzzles await for players, with Klonoa now able to plant enemies in flower pots, creating a makeshift ladder.  He can also grab hold of electric foes that will rocket him through breakable blocks and enemies.  The side goal of collecting all a stage's Dream Stones returns, and in addition to this, there is also a special 'Sun Stone' hidden in each stage.  Diligent players will be rewarded with bonus tougher levels to complete.</p><p>In addition to the standard puzzle-like platform stages, there are also fast-paced hoverboard races.  These stages auto-scroll upwards, and have Klonoa facing the top of the screen.  Players need quick reflexes to make it through these tricky stages.  In addition to this, deadly bosses await, in tough left to right auto-scrolling boss stages - you'll have to be quick on your feet to make it to the end...or get crushed by the boss relentlessly chasing you!</p>"},{"name":"Klonoa Heroes: Densetsu no Star Medal (J)","year":2002,"developer":"Namco Limited","url":"a#K.zip/K%2FKlonoa%20Heroes%20-%20Densetsu%20no%20Star%20Medal%20%28J%29%20%5BhIR%5D.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Action RPG > Puzzle elements","desc":"<p><em>Klonoa Heroes: Densetsu no Star Medal</em> is an action-rpg hybrid featuring the cast and universe from the Klonoa game series.</p><p>The story revolves around Klonoa's wish to go out and become a hero. In order to do so he joins the adventurous Guntz who is out on a quest to find a mystery character. Along the way they will find new friends with their own quests, which serve as a way to prove Klonoa's heroism. </p><p>The game is played from a top-down perspective and he is able to transform his magic ring in several weapons. When in combat Klonoa has to use the right color attack against an enemy to inflict damage on it. The normal attacks are red and blue, but Klonoa also has a special yellow attack that needs to be charged up first before it is able to be unleashed. Defeated enemies usually drop dream fragments and gold. Collecting dream fragments increases Klonoa's experience and upon level-up the player can select which stats to increase. Gold can be spent at item and armory shops or at inns.</p><p>Occasionally Klonoa will visit locations that are more puzzle focused. In these sections Klonoa will have to eliminate enemies by punching them from the side or back without being seen by any of the enemies in that location. If Klonoa is caught, he will have to start the puzzle over again.</p>"},{"name":"Klonoa: Empire of Dreams","year":2001,"developer":"Now Production Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Klonoa%20-%20Empire%20of%20Dreams%20%28USA%29.zip","filesize":1,"score":8,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>Klonoa stars in his first adventure for the Game Boy Advance.  An emperor who cannot sleep who has banned dreaming, and Klonoa has been imprisoned for breaking the law.  Klonoa must go on another adventure to save the empire and allow the residents to dream once again.</p><p>Klonoa: Empire of Dreams is a lot more puzzle-focused than the PlayStation versions of the game.  Most of the game is very slow paced, so that players can take their time and carefully think about their next move.  You still use the same mechanic of inflating your enemies and using them to either double jump or throw them at other enemies, but the action now takes place on a fixed 2D area.</p><p>Players can also aim to collect all the Dream Stones within the levels, which will unlock secret bonuses.  Auto-scrolling surfing levels break up the puzzle-level action, and are much more hectic.</p>"},{"name":"Koala Brothers, The: Outback Adventures","year":2004,"developer":"Sirius Games A/S","url":"a#K.zip/K%2FKoala%20Brothers%20-%20Outback%20Adventures%20%28E%29%20%28M8%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Welcome to the outback! Frank & Buster, the Koala Brothers, have a special mission in life: to help those in need! And before long, in the outback, someone will need a little help even if that someone doesn't know it yet! Go with Frank and Buster, the Koala Brothers, to the sunny Australian Outback, and join them on a host of exciting adventures with all their friends.</p>"},{"name":"Konami Collector's Series: Arcade Advanced","year":2002,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"a#K.zip/K%2FKonami%20Collectors%20Series%20-%20Arcade%20Advanced%20%28E%29.gba","filesize":1,"score":7.7,"genres":"Compilation","desc":"<p>This collection of classic Konami arcade games from the 1980's includes a complete re-creation of six titles dating back to 1981. The set includes the following games:</p><ul><li>Frogger</li><li>Gyruss</li><li>Rush'n Attack</li><li>Scramble</li><li>Time Pilot</li><li>Yie Ar Kung-Fu</li></ul><p>Each game also includes exclusive multiplayer options for two people to experience classic arcade games, plus bonus extras hidden away on the cart that can only be opened after reaching certain goals in each game.</p>"},{"name":"Konami Krazy Racers","year":2001,"developer":"Konami Computer Entertainment Kobe, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Konami%20Krazy%20Racers%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Konami Krazy Racers</em> is a kart racing game with super deformed racers. It features famous Konami characters like Goemon (from Ganbare Goemon), Dracula (from Castlevania), and Vic Viper (from Gradius). There are 16 courses to race through, and you can collect coins to buy items. Gameplay is similar to that of Mario Kart.</p>"},{"name":"Kong: King of Atlantis","year":2005,"developer":"Skyworks Technologies, Inc.","url":"a#K.zip/K%2FKong%20-%20King%20of%20Atlantis%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>In this adaptation of the animated film Kong: King of Atlantis, you play as Jason, Lua, and King Kong himself in a side-scrolling adventure platformer on a quest to stop the evil Queen Reptilla from Atlantis as she tries to use Kong for her own gain. </p><p>Players must fight with their fists and special moves to take down the tar monsters and snake men found on the island of Atlantis, all three characters playing in similar levels and similar ways even though two are human and one is a giant ape. With 15 short platforming levels to explore it isn't too long of an experience, with each level having a password in case the player wishes to continue play another time.</p>"},{"name":"Kong: The 8th Wonder of the World","year":2005,"developer":"Ubisoft Entertainment Inc.","url":"a#K.zip/K%2FKong%20-%20The%208th%20Wonder%20of%20the%20World%20%28U%29%20%28M3%29.gba","filesize":1,"score":6.8,"genres":"Action > Side view > Top-down > Interwar > Licensed","desc":"<p>Based off Peter Jackson's King Kong movie that was released in 2005, you are now able to play the movie.</p><p>The plot consist of film maker, Carl Denham wanting to make one of best movies.  He finds theater actress Ann Darrow and wants her to play the part of one of his characters.  Carl gets writer Jack Driscoll to finish Carl's script while they are traveling on a ship to an island that Carl believes to be real, but no one else does.  He plans to shoot his movie there.  Once they arrive at the island known as Skull Island, Ann is captured and now Carl, Jack, &amp; the cast of Carl's movie goes out to find her.</p><p>This is a top-view game with cartoon-like visuals and some Legend Of Zelda type gameplay.  You start out with Jack, Carl, &amp; Ann and at that point, you learn how to play the game in a short tutorial.  Jack has a machete and a tommy gun so that makes him the attacker against the creatures that lurk on Skull Island.  Carl has grenades.  You could attack enemies with it, but your suppose to use them for getting rocks out of the way that block the entrance of caves.  Ann (in the beginning) can heal Jack &amp; Carl.  After Ann is captured, you have to play as Jack &amp; Carl.</p><p>You can also play as King Kong a few times in the game.  They are short levels that consist of you playing as Kong in levels that are timed and that are like beat-em-up games we've seen in the past, and you slowly beat up the creatures that come after you.  You also get an energy boost when you defeat most of the enemies.</p>"},{"name":"Kotoba no Puzzle: Mojipittan Advance","year":2003,"developer":"Namco Limited","url":"a#K.zip/K%2FKotoba%20no%20Puzzle%20Mojipittan%20Advance%20%28J%29.gba","filesize":1,"score":"","genres":"Puzzle > Strategy > Top-down > Fixed / flip-screen > Turn-based > Word construction","desc":"<p><em>Kotoba no Puzzle: Mojipittan Advance</em> is a Japanese word puzzle game. It is similar to the board game <em>Scrabble</em>, in which players play against the computer, placing tiles featuring language characters onto a grid to form words. Unilke <em>Scrabble</em>, however, a player can only place one tile per turn. Also unlike <em>Scrabble</em>, the tile can be placed anywhere on the board, next to tiles from multiple words, even if it is placed next to a tile that, when combined with it, would make a nonexistant word. As long as the placing of the tile forms at least one word, it is allowed.</p><p>The game uses hiragana as opposed to <em>Scrabble's</em> English alphabet.</p>"},{"name":"Kunio-kun Nekketsu Collection 1 (J)","year":2005,"developer":"","url":"a#K.zip/K%2FKunio%20Kun%20Nekketsu%20Collection%201%20%28J%29.gba","filesize":1,"score":"","genres":"Compilation > Sports","desc":"<p><em>Kunio-kun Nekketsu Collection 1</em> is the first compilation in a set of three 2-in-1 collections for the Game Boy Advance.</p><p>It features the Famicom versions of:</p><ul><li>Nekketsu Kōkō Dodgeball Bu</li><li>Nekketsu Street Basket</li></ul><p>Both remained identical to their original editions.</p>"},{"name":"Kunio-kun Nekketsu Collection 2 (J)","year":2005,"developer":"","url":"a#K.zip/K%2FKunio%20Kun%20Nekketsu%20Collection%202%20%28J%29.gba","filesize":1,"score":"","genres":"Compilation > Sports","desc":"<p><em>Kunio-kun Nekketsu Collection 2</em> is the second compilation in a set of three 2-in-1 collections for the Game Boy Advance. It features the Famicom versions of:</p><ul><li>Nekketsu Kōkō Dodgeball Bu: Soccer Hen</li><li>Downtown Nekketsu Kōshinkyoku</li></ul><p>Both remain identical to their original editions.</p>"},{"name":"Kunio-kun Nekketsu Collection 3 (J)","year":2006,"developer":"","url":"a#K.zip/K%2FKunio%20Kun%20Nekketsu%20Collection%203%20%28J%29.gba","filesize":1,"score":"","genres":"Compilation > Sports","desc":"<p><em>Kunio-kun Nekketsu Collection 3</em> is the third and final compilation in a set of three 2-in-1 collections for the Game Boy Advance. </p><p>It features the Famicom versions of:</p><ul><li>Downtown Special: Kunio-kun no Jidaigeki da yo - Zenin Shūgō!</li><li>Ike Ike! Nekketsu Hockey-bu: Subete Koronde Dairantō</li></ul><p>Both remained identical to their original editions.</p>"},{"name":"Kurohige no Golf Shiyouyo (J)","year":2002,"developer":"SOFTMAX","url":"a#K.zip/K%2FKurohige%20no%20Golf%20Shiyouyo%20%28J%29.gba","filesize":1,"score":"","genres":"Sports > 3rd-person (Other) > Behind view > Anime / Manga > Turn-based > Direct control > Golf","desc":"<p>A golf game part of the Golf Shiyou yo series with licences for the Tomy property Kurohige Kiki Ippatsu (Pop-up Pirate).</p>"},{"name":"Kuru Kuru Kururin","year":2001,"developer":"Eighting Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Kurukuru%20Kururin%20%28Europe%29.zip","filesize":1,"score":7.8,"genres":"Action > Top-down > 2D scrolling > Arcade > Helicopter","desc":"<p>Kuru Kuru Kururin is an innovative puzzle game in which the main character is inside a helicopter, and he must navigate himself through a maze in the least amount of time possible. Movements must be timed and precise, because if the helicopter's propeller hits a wall, 3 seconds is added to the timer. The protagonist's mission is to retrieve his brothers, who will join him after he finds them. He also finds many power-ups that will allow him to customize his helicopter's appearance.</p>"},{"name":"Kururin Paradise","year":2002,"developer":"Eighting Co., Ltd.","url":"a#K.zip/K%2FKururin%20Paradise%20%28J%29%20%5BT%2BEng0.10%5D.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Top-down > Arcade > Helicopter","desc":"<p><em>Kururin Paradise</em> is the sequel to the GBA launch title, Kuru Kuru Kururin. In this game, Kururin and his family see an advertisement for the circus, which takes place at 6:00. Kururin's family arrive there on time, but Kururin is late, and when he gets there, everybody is missing! It's up to Kururin to search across the land for his missing family using his faithful helicopter, the Heririn. As in the first game, Kururin must navigate his way through fairly narrow mazes, trying not to hit the walls. Three consecutive hits, and the Heririn is destroyed, and you must start the stage again.</p><p>Paradise is vastly improved from the original game. It is now possible to find hidden keys in the levels, which open up locked doors, allowing for branched paths in the world map. Certain paths also lead to boss encounters, which take the form of an addictive mini-game including, but not limited to, lawn mowing, gathering stars, flying Kururin himself through clouds, and hopping across a path dodging helicopter blades. If you beat the boss, these mini-games are then added to your mini-game library, where you can play them against up to three friends using only one cart.</p><p>The game also features twelve toys built in that can be accessed by selecting one from a menu, then turning your GBA off, then on again. Most of them are fairly useless or incomprehensible in Japanese, but there are a couple of interesting ones, like the love tester, the musical note player, and the memory match game.</p>"}]