[{"name":"Lady Sia","year":2001,"developer":"RFX Interactive","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Lady%20Sia%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1,"score":7.3,"genres":"Action > Side view > Platform","desc":"<p>Lady Sia is a young female warrior princess who's attempting to save her homeland from the cruel beastmen, the T'soas. </p><p>At the opening Sia is being thrown in prison. A veiled figure eventually helps her escape, and that's where you begin the game. Run, jump, crawl, climb, sneak and slash your way past monsters, demons, and assorted perils in order to save your empire from the evil race of the animal creatures.</p>"},{"name":"Land Before Time Collection, The","year":2002,"developer":"Full Fat Productions Ltd.","url":"a#L.zip/L%2FLand%20Before%20Time%2C%20The%20%28E%29%20%28M5%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Land Before Time</em> for Game Boy Advance is a side-scrolling platform game based on the cartoon franchise. The dinosaur friends have been lost after running away from a sharptooth. It's now up to Littlefoot to rescue his friends and together they must find a way back home to the Great Valley.</p><p>The game consists of five different levels, each made up of four smaller stages. Environments include a desert, a swamp, mountains, a cave and a volcano. In the first level, players can only control Littlefoot, but subsequent stages add the rest of the gang as controllable characters, adding Cera, Spike and Ducky. The difference between the characters is mostly visual, since they have almost the same abilities.</p><p>The goal in the first stages of each level is simply to find the exit. The dinosaur heroes can walk, run, jump and double-jump to make their way across platforms, traps, quicksand, water and other obstacles. Enemy dinos can be defeated by jumping on top of them or striking them with a normal attack. Glowing orbs are setback points that allow resuming upon loss of a life. Arrows point the direction to the goal in the first level only. The final stage in every world is a boss battle against a large enemy, including the likes of a huge scorpion, a T. Rex and a spider.</p><p>Scattered over the levels are tree stars. Collecting 100 of them in one stage unlocks an arcade mini-game. After every main level, a password is given for resuming at a later date.</p>"},{"name":"Land Before Time, The: Into the Mysterious Beyond","year":2006,"developer":"Sirius Games A/S","url":"a#L.zip/L%2FLand%20Before%20Time%2C%20The%20-%20Into%20the%20Mysterious%20Beyond%20%28E%29%20%28M8%29.gba","filesize":1,"score":"","genres":"Action > Side view > Top-down > 2D scrolling > Platform > Prehistoric > Licensed","desc":"<p><em>The Land Before Time: Into the Mysterious Beyond</em> is an action platforming game where the player takes control of a group of dinosaur friends as they search for their missing friend Chomper, a young Tyrannosaurus Rex who got lost in the Mysterious Beyond. The game features platforming levels where the player will play as the Apatosaurus Littlefoot, the Pteranodon Petrie, or the Saurolophus Ducky, as well as levels with a top down perspective where they take control of the Triceratops Cera or the Stegosaurus Spike. Each character has a different level type, with Littlefoot's focused on normal platforming, Petrie's on flight, Ducky's on swimming, Cera's on breaking boulders in her path, and Spike on navigating mazes. There are some special levels where all the dinosaurs may ride together on a leaf sled or a raft, and the final level has a greater combat focus as the player controls Littlefoot's grandfather.</p>"},{"name":"Lara Croft: Tomb Raider - Legend","year":2006,"developer":"Human Soft Inc.","url":"7#Lara%20Croft%20Tomb%20Raider%3B%20Legend%20%28USA%29%20%5BEn%2CDe%2CFr%2CEs%2CIt%5D.gba","filesize":8388608,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>The GBA version of Lara Croft Tomb Raider: Legend is a side-scrolling platform game more similar to the DS version instead of the 3D console versions by a different development studio. Unlike the previous GBA game in the series, a side view is used instead of more titled, overhead camera perspective.</p><p>The plot is the same as the console versions. In a search for the relic Lara Croft travels through Japan, Bolivia, England, Kazakhstan, Ghana and the Himalayas. She get some new tools in this game to help her during the search for the relic. The PDA for instance, provides real-time statistics and updates on objectives. The grapple hook can be used to swing over pits and also captures enemies. A headset is used to keep contact with Zip who follows Lara through the cam and informs her about new objectives when they become available.</p><p>Lara can also jump, attack with her guns, and she needs to swing to new platforms, avoid obstacles and take out enemies and animals in her way. Timing and precision is essential to reach platforms, much like the early Prince of Persia games. New guns are collected when enemies drop them, but this does not change the sprite of the weapon Lara is holding. There are also a number of vehicle sequences where Lara is driving a bike.</p><p>The cut-scenes that progress the story are shown as pages from a comic book, with bubble dialogue. After collecting treasure, it can be exchanged in the main menu to unlock a number of mini-games, cinematics, character profiles, cheat codes and a time trial mode to complete levels as fast as possible.</p>"},{"name":"Lara Croft: Tomb Raider - The Prophecy","year":2002,"developer":"Ubi Soft Studios SRL","url":"7#Lara%20Croft%20Tomb%20Raider%3B%20The%20Prophecy%20%28USA%29%20%5BEn%2CFr%2CDe%2CEs%2CIt%5D.gba","filesize":8388608,"score":6.8,"genres":"Action > Diagonal-down","desc":"<p>Lara Croft discovers a manuscript which speaks of a mysterious occult magic which will bring desolation on earth in the near future. This prophecy also talks of three legendary stones which are linked with the mentioned devastation. Fascinated, Lara travels around the globe in search of these fabled stones. Along the way she'll meet enemies both human and otherwise and will also have to deal with dark magic of sorts.</p><p>Lara is now in a \"quasi-3D\" overhead environment, as opposed to the 2D-platformer view of the previous handheld (GBC) versions. This view proves helpful while Lara runs, jumps, shimmys, and shoots around. Although there is lack of a save feature, there is a password system which lets you restore back to 'almost' where you left.</p>"},{"name":"Leek Game","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Legend of Dynamic: Goshoden - Hokai no Rondo","year":2003,"developer":"Will Co., Ltd.","url":"a#L.zip/L%2FLegend%20of%20Dynamic%20-%20Goushouden%20-%20Houkai%20no%20Rondo%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Sci-fi / futuristic > Licensed","desc":"<p>In this game, the player takes control of a modern-day male teenager and his female best friend (the player gives them names in the beginning of the game). They have received a strange letter from an anonymous sender, and are about to discuss it during their meeting in a park, when they suddenly become unconscious... When the two wake up, they find themselves in a strange world, populated by characters from various works by  Go Nagai. At first, they meet Akira from <em>Devilman</em> and Cutey Honey from the  eponymous manga. At that point, the player can choose to follow either of them as the main protagonist; the best friend will then leave with the other character. The two stories have the same main events, and eventually lead to a grand confrontation that will decide the fate of that world.</p><p><em>Legend of Dynamic: Gōshōden - Hōkai no Rondo</em> is a Japanese-style RPG, with wandering on the world map, party management, turn-based battles, simple leveling-up, and other typical features of the genre. The characters the player meets in the game are heroes featured in Go Nagai's stories, including  Mazinger Z and  Susa no Oh. The game features a so-called \"Assort System\", which allows the player to team up characters and create combinations within the party. Active party members which participate in combat directly are called \"Battlers\"; their abilities can be enhanced in various ways by assigning \"partners\" to them, which play a more passive, supportive role, and can not take part in battles.</p>"},{"name":"Legend of Spyro, The: A New Beginning","year":2006,"developer":"Big Ant Studios Pty Ltd","url":"a#L.zip/L%2FLegend%20of%20Spyro%2C%20The%20-%20A%20New%20Beginning%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":"","genres":"Action > Side view > Top-down > 2D scrolling > Arcade > Platform > Fantasy","desc":"<p>When the Dark Master attacked the sacred temple, the Fire Guardian, Ignitus, could only manage to save one of the dragon eggs from being destroyed. This egg found its way to a family of dragonflies, who raised the newly hatched dragon as one of their own, along with their son Sparx. The dragon, Spyro, soon discovered his heritage, and with Sparx, began on a quest to discover himself and eventually, save the world from the Dark Master's forces.</p><p><em>The Legend of Spyro: A New Beginning</em> is a side-scrolling platformer based on the console game of the same name. As Spyro, players can attack with melee attacks and charge tackles. In addition to this, breath attacks are unlocked as players progress through the game, allowing Spyro to control the elements of fire, ice, earth and lightning. The R Button will let Spyro fire a stream of breath, while the L Button will hurl a ranged attack at foes. Finally, players can press L and R together when their purple Fury Meter is full to unleash a more powerful attack.</p><p><em>A New Beginning</em> also features mini-games such as a whack-a-mole style game, flying levels which play somewhat like a shooter in the vein of games like 1942. You'll even come across boss battles as you attempt to free the other Guardians from the evil dragon Cynder's forces.</p>"},{"name":"Legend of Spyro, The: The Eternal Night","year":2007,"developer":"Amaze Entertainment, Inc.","url":"a#L.zip/L%2FLegend%20of%20Spyro%2C%20The%20-%20The%20Eternal%20Night%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":7.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Fantasy > Licensed","desc":"<p>In this second version since the series restart, you are attempting to take out Gaul, the Ape King.  The GBA version of the game is a side-scrolling, platforming, hack and slash/ beat 'em up game with an intuitive yet deep combo attack system.  You will be fighting your way across multiple locations and defeat the various bosses along the way.  Use four breath elements, fury mode, and many basic melee and air attacks together to form a variety of ways to defeat your enemies.</p>"},{"name":"Legend of Zelda, The","year":2004,"developer":"Nintendo Co., Ltd."},{"name":"Legend of Zelda, The: A Link to the Past and Four Swords","year":2002,"developer":"Capcom Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Legend%20of%20Zelda%2C%20The%20-%20A%20Link%20to%20the%20Past%20%26%20Four%20Swords%20%28USA%29.zip","filesize":1,"score":8,"genres":"Action > Diagonal-down > 2D scrolling > Anime / Manga > Metroidvania > Puzzle elements > Direct control > Fantasy","desc":"<p><em>The Legend of Zelda: A Link to the Past/Four Swords</em> features two games, a port of the SNES game The Legend of Zelda: A Link to the Past and a new multiplayer adventure called <em>Four Swords</em>. </p><p>A long time ago in Hyrule, there was a hero who used a legendary sword (which is called \"Four Sword\") to defeat a sorcerer called Vaati and trapped him into the sword. After the battle, people built a shrine to protect the Four Sword.</p><p>Several years later, princess Zelda noticed that Vaati might have escaped from the blade of the Four Sword. She asked Link to come to the Four Sword shrine to check with her. As soon as they came there, Vaati captured Zelda and carried her away.</p><p>Some little fairies later told Link that princess Zelda was at Vaati's palace up on the sky. In an attempt to recuse Zelda, Link dragged the Four Sword and it created three more Links! The Links then began their adventure to save Zelda...</p><p><em>Four Swords</em> requires from two to four players. There are five levels (a training level, three main levels and Vaati palace-an unlockable level). During the game, players must collect as many Ruppees as possible while solving puzzles and defeating enemies. When enough Ruppees are collected, the Great Fairy will give the players a key to open the unlockable level. At the end of each level, the one who collects the most Ruppees will be the winner.</p><p>When any of the players dies, the number of Ruppees collected will decrease. The more times a Link dies, the more Ruppees are lost. The game is over when there are not enough Ruppees to revive any Link.</p>"},{"name":"Legend of Zelda, The: The Minish Cap","year":2004,"developer":"Capcom Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Legend%20of%20Zelda%2C%20The%20-%20The%20Minish%20Cap%20%28USA%29.zip","filesize":1,"score":8.6,"genres":"Action > Diagonal-down > 2D scrolling > Metroidvania > Puzzle elements > Direct control > Fantasy","desc":"<p>While at a festival with Princess Zelda, Link encounters a mysterious mage, called Vaati, who turns the princess to stone. Helpless to stop them, Link is asked by the king to meet with a race of tiny people known as the Minish, who may be able to help with their predicament. On his travels, Link teams up with a talking cap called Ezlo, who is able to shrink Link to the size of a Minish so that he can meet with them. With his newfound abilities, Link must save the kingdom from Vaati's menace.</p><p><em>The Legend of Zelda: The Minish Cap</em> is a top-down action adventure game that tells the origins of the evil Vaati from Four Swords. Players take on the role of Link as they conquer various dungeons to retrieve essential tools to fight enemies and progress through various obstacles. Items such as the Mole Mitts allow Link to dig through dirt, while the Gust Jar can be used to suck in enemies, items, and propel Link. Link can also shrink down to the size of a Minish with the aid of Ezlo, the talking cap.</p><p><em>The Minish Cap</em> uses the gameplay mechanic of shrinking to make familiar territory new and different. Puddles become huge rivers, baby chicks are huge monsters, and regular enemies become deadly bosses at Minish size. Link can also trade items called \"Kinstones\" with people in the game - when two pieces of the same Kinstone are joined together, new areas open up, treasure chests appear, and sometimes, even useful rewards are given to Link.</p>"},{"name":"Legends of Wrestling II","year":2002,"developer":"Powerhead Games","url":"a#L.zip/L%2FLegends%20of%20Wrestling%202%20%28E%29.gba","filesize":1,"score":3.9,"genres":"Sports > Side view > 2D scrolling > Wrestling","desc":"<p>The handheld version of Legends of Wrestling II features a roster of 40 classic wrestlers, including Hulk Hogan, Andre the Giant, \"Rowdy\" Roddy Piper and Bret \"Hitman\" Hart.</p><p>Four different types of matches are available: one-on-one, three-way bout, four-way bout and tag team. Game modes include Exhibition, Tournament and Career. Tournaments are either one-on-one or tag team, with randomly selected brackets. In Career mode, the player can choose a region of the United States to fight in and is then assigned a random match. The goal is to increase audience popularity to 100% by winning matches, which will lead to the chance of a championship fight.</p><p>In the ring, the action is viewed from the side. Punches, grapples, reversals, taunts and special moves are available through button combinations. Successful moves build up an energy meter, which, when full, can be used to perform a unique signature move for each wrestler.</p><p>Not all 40 wrestlers are available from the start - some have to be unlocked by winning the Career mode first.</p>"},{"name":"LEGO Bionicle","year":2001,"developer":"Saffire, Inc","url":"a#L.zip/L%2FLEGO%20Bionicle%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CDa%29.gba","filesize":1,"score":5.9,"genres":"Action > Top-down > Licensed","desc":"<p>LEGO Bionicle: Tales of the Tohunga is an action adventure game where players become the brave young Tohunga , completing several goal-oriented quests in six elementally-themed areas to discover the six Stones and summon the Toa. More than 20 levels . Six additional multi-player Tohunga athletic games – themed to each of the six locations. In typical LEGO fashion, players can customize their Tohunga characters, choosing from a variety of masks, biomechanical limbs and torsos. The game is linked to the Bionicle play materials line. Players may enter special codes found on the play materials packaging to the game to gain access to secret game-enhancing features.</p>"},{"name":"LEGO Island 2: The Brickster's Revenge","year":2001,"developer":"Silicon Dreams Studio Ltd.","url":"a#L.zip/L%2FLEGO%20Island%202%20-%20The%20Brickster%27s%20Revenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CDa%29.gba","filesize":1,"score":6.5,"genres":"Action > Diagonal-down > Mini-games > Licensed","desc":"<p>The escaped convict Brickster has taken the opportunity of his new found freedom to do the nefarious deed of ripping out 15 pages of the Constructopedia, LEGO Island's building blueprint book, and scattered the pages throughout the island. Now it's up to Pepper Roni, a skateboarding pizza delivery boy to find the pages and send Brickster back to jail.</p><p>Players control Pepper Roni and go around the island trying to locate the Constructopedia pages. Pepper can give the pages he found to certain characters who in turn will build a structure that will help improve the island. Pepper will also have to partake in various mini-games throughout the game. Also, finding hidden Lego character cards is the games reward for observant exploration of the island.</p><p>Although Pepper can't be killed, he will have to deal with the Brickster-Bot enemies by either bumping into them or stunning them with a pizza throw.</p>"},{"name":"LEGO Knights' Kingdom","year":2004,"developer":"Razorback Developments Ltd"},{"name":"LEGO Racers 2","year":2001,"developer":"Pocket Studios","url":"a#L.zip/L%2FLEGO%20Racers%202%20%28E%29%20%28M8%29.gba","filesize":1,"score":6.9,"genres":"Racing / Driving > Behind view > Direct control > Automobile > Off-roading > Track racing > Truck > Sci-fi / futuristic > Licensed","desc":"<p>Following the first game, Rocket Racer issues a new challenge to find the best racer in the galaxy, summoning the greatest racers of all time to Planet Xalax for the Galactic Racing Championship. Players must prove their driving skills in four different worlds to qualify for the ultimate race on planet Xalax. </p><p>The Story Game mode is where all the real action of Lego Racers 2 takes place.  In this mode, you become a new racer, determined to become Galactic Racing Champion.  Along the way, other racers challenge you as your quest to become number 1 continues.  The more races you win, the more Golden Blocks you receive and also the more parts for your car you win.  Golden Blocks help you move throughout the different levels of the game. You start out with zero Golden Blocks and move up as you win more races.</p><p>There are also a number of multiplayer modes - with or without CPU cars. The game supports 4-way link-up.</p>"},{"name":"LEGO Star Wars II: The Original Trilogy","year":2006,"developer":"Amaze Entertainment, Inc.","url":"7#LEGO%20Star%20Wars%20II%3B%20The%20Original%20Trilogy%20%28EU%29%20%5BDe%2CEn%2CEs%2CFr%2CIt%2CDa%5D.gba","filesize":16777216,"score":6.7,"genres":"Action > Isometric > Sci-fi / futuristic > Licensed","desc":"<p>Focused on the original trilogy of the Star Wars universe (<em>A New Hope</em>, <em>The Empire Strikes Back</em> and <em>The Return of Jedi</em>), the sequel to LEGO Star Wars brings some innovations over the first title, making it more similar to its PC and console counterpart than the previous game.</p><p>During the story mode, the player is joined on-screen by two other characters, and can change between them to use their specific skills to proceed. Characters share a life bar of four hearts, with the rate of depletion changing according to each character (a stormtrooper will lose three hearts when hit by a blaster, Vader will take two or three hits before losing one). If a support character is \"dismantled\" by attacks, there's no problem, but letting that happen to the controlled character means a loss of stud points (the game currency), as well as a drop on the \"Super Kit\" gauge, which replaces the Jedi rank evaluation of the previous titles. </p><p>Gameplay has been changed to accommodate the lack of lightsaber battles in the later episodes, and so blasters are a lot more effective and fire faster, but have lost their \"charge\" mode. New flight missions are also included. These are similar to previous Star Wars games, like Return of the Jedi, and allow the player to attack both Death Stars, skim the surface of the forest moon of Endor in a Speeder, escape from an asteroid field with the <em>Millennium Falcon</em>, or draw wires around the legs of Imperial walkers in Hoth.</p><p>There are three major character classes: droids (unable to fight, but the only ones capable of opening most regular doors during story mode), Jedi (melee fighters capable of interacting with larger objects to uncover hidden studs and with different Jedi powers) and Blaster users, which can fire at an enemy from a distance, as well as assemble smaller objects (like short bridges or door switches).</p><p>Gameplay remains a light jump-and-slash isometric game, with the goal being usually to go from point A to B, while pulling levers somewhere in the level. Like in the first game, the game can not be entirely completed without playing in Free Mode (a near perfect run in Story mode will only complete around 50% of the game), as many doors can only be opened, or even reached, by using the unique special abilities of one of the 36 unlockable characters. </p><p>To acquire characters for Free Play, the player now needs to accomplish three things: earn enough credits (the value of each stud was increased 10 fold), complete a level (to unlock playable characters such as the level variation of Luke or Leia), and get all \"mini kits\" (which replace the \"Death Star Plans\" of the prequel). Characters that can be unlocked include enemies, such as the Tusken Raider or Stormtroopers, or heroic characters, like Yoda. There are also additional items to be bought, including music, palette swaps, new game modes, lightsaber colours and hints.</p>"},{"name":"LEGO Star Wars: The Video Game","year":2005,"developer":"Griptonite, Inc.","url":"7#LEGO%20Star%20Wars%3B%20The%20Video%20Game%20%5BEn%2CFr%2CDe%2CIt%2CEs%2CNl%2CDa%5D.gba","filesize":16777216,"score":7.1,"genres":"Action > Diagonal-down > Isometric > Sci-fi / futuristic > Licensed","desc":"<p>This version of <em>LEGO Star Wars: The Video Game</em> differs in several aspects from its PC and console counterpart. The game uses an isometric perspective, and its levels differ in structure and design from those of the other release. One of the most notable differences is the exclusion of a second playable character. There are also fewer playable characters in this version, and fewer stages. Cutscenes are presented as still pictures. Blaster-using characters can charge the shot to pierce through several enemies; however, characters also have a reduced ability to deflect blaster shots.</p>"},{"name":"Lemony Snicket's A Series of Unfortunate Events","year":2004,"developer":"Griptonite, Inc.","url":"7#Lemony%20Snicket%27s%20A%20Series%20of%20Unfortunate%20Events%20%5BEng%5D.gba","filesize":16777216,"score":7.3,"genres":"Action > Side view > Puzzle elements > Steampunk > Licensed","desc":"<p>Based on the movie (and first three books of the series), <em>Lemony Snicket's a Series of Unfortunate Events</em> for Game Boy Advance puts players in the unfortunate shoes of the incredibly unlucky Baudelaire orphans: Violet, Klaus, and Sunny.</p><p>Each orphan has an unusual talent that will let them progress through three chapters (each with over a dozen levels). Though the game looks like a traditional side-scroller, combat takes a backseat to clever puzzle-solving and adventure game elements. The three orphans must use their talents, along with items found in the world, and various interactions to escape each level and avoid the evil Count Olaf and his elaborate plans to inherit the children's fortune.</p><p>Inventions also take a big role in this game, and players will have to assemble them from common household objects. For example, in one level, Violet will be hunting for ice cream scoopers, soup cans, and a crank to invent an \"apple chucker\" which can help defeat Count Olaf's friends.</p><p>The game offers quite a bit of replayability, too, with quest points and exotic books earned for discovering all the game's quirky secrets.</p>"},{"name":"Let's Ride!: Dreamer","year":2005,"developer":"Kritzelkratz 3000 GmbH"},{"name":"Let's Ride!: Friends Forever","year":2007,"developer":"Independent Arts Software GmbH"},{"name":"Little League Baseball 2002","year":2002,"developer":"Handheld Games LLC","url":"a#L.zip/L%2FLittle%20League%20Baseball%202002%20%28USA%29%20%28En%2CEs%29.gba","filesize":1,"score":"","genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Fixed / flip-screen > Direct control > Baseball > Licensed","desc":"<p><em>Little League Baseball 2002</em> is a baseball game carrying the Little League Baseball license of the organization that organizes local youth baseball and softball leagues throughout the United States and the rest of the world.</p><p>Different teams are available each with different statistics based on batting, fielding and pitching. Game options include a difficulty level selection, adjusting the amount of innings and a selection of different fields. Before the start of the game the batting order can be determined.</p><p>During the batting phase a behind view is used when swinging with an orange circle that can be moved around green cross-hairs to strike at the right time. When pitching the same perspective is used with a red dot moved around the green cross-hairs, a separate bar for pitching power and four options for the pitch type. During field play the perspective shifts to a bird's-eye view.</p>"},{"name":"Lizzie McGuire 2: Lizzie Diaries","year":2004,"developer":"Artificial Mind & Movement","url":"a#L.zip/L%2FLizzie%20McGuire%202%20-%20Lizzie%20Diaries%20%28U%29%20%28M2%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > Side view > 2D scrolling > Mini-games > Direct control > Contemporary > North America > Licensed","desc":"<p><em>Lizzie McGuire 2: Lizzie Diaries</em> is largely a 2D side-scrolling platformer based on the Disney American comedy television series that ran between 2001 and 2004. Lizzie needs to complete levels avoiding obstacles and enemies. The latter can also be taken out by jumping on top of them. Lizzie has a limited amount of health, but when dead a level does not need to be restarted completely and the number of lives is infinite. The main goal is to reach the end of the level but optionally a certain number of diary collectibles can be picked up. In one level she needs to stay ahead of cheerleaders that chase her through the entire level.</p><p>Next to the regular platforming other levels contain several activities and mini-games such as playing games of beach volleyball, badminton, surviving a food fight, completing a waterski course, mimicking a dancing routine, dressing up Lizzie with a correct outfit, a time management game as a waitress and so on.</p>"},{"name":"Lizzie McGuire 3: Homecoming Havoc","year":2005,"developer":"Climax LA","url":"a#L.zip/L%2FLizzie%20McGuire%203%20-%20Homecoming%20Havoc%20%28U%29.gba","filesize":1,"score":6.6,"genres":"Action > Side view > Arcade > Music / rhythm > Licensed","desc":"<p>Lizzie McGuire's cheerleading rival, Kate, has boasted that there will be no way Lizzie will be Homecoming Queen with the unbeatable competition of Kate. Previously uninterested in Homecoming, Lizzie suddenly develops a fierce determination to show up Kate and swipe the crown from her clutches.</p><p>Homecoming Havoc plays somewhat like Nintendo's Wario Ware, in that players must make their way through a series of short mini-games rapidly thrown at you one after the other. While each of Wario Ware's stages has a theme, each of Homecoming Havoc's minigames in the ten stages are randomly selected from the game's minigame library.</p><p>As players progress through the minigames, they earn points and tokens. Tokens can be used to purchase cards that will allow you to skip a particular type of minigame if you fail it. At the end of each set of ten minigames, there is a Dance Competition. In this game, players must input the correct arrow sequence using the Control Pad as the arrows pass along the screen.</p>"},{"name":"Looney Tunes Double Pack: Dizzy Driving / Acme Antics","year":2006,"developer":"WayForward Technologies, Inc.","url":"a#L.zip/L%2FLooney%20Tunes%20-%20Back%20in%20Action%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Compilation > Racing / Driving > Side view > Top-down > 2D scrolling > Direct control > Automobile > Track racing > Fantasy > Licensed","desc":"<p><em>Looney Tunes Double Pack</em> is a compilation of two Looney Tunes games not available separately.</p><ul><li>In Dizzy Driving, Bugs, Daffy, Tweety, and other from the gang race on tracks in vehicles using a top-down perspective. There are eight racers available.</li><li>In Acme Antics, Wile E. Coyote needs to catch Road Runner in side-scrolling levels shown from a side view. Road Runner needs to avoid obstacles and fight boss coyotes.</li></ul>"},{"name":"Looney Tunes: Back in Action","year":2003,"developer":"Warthog Games Ltd.","url":"a#L.zip/L%2FLooney%20Tunes%20-%20Back%20in%20Action%20%28U%29%20%28M5%29.gba","filesize":1,"score":5.8,"genres":"Action > Racing / Driving > Diagonal-down > 2D scrolling > Isometric > Platform > Licensed","desc":"<p><em>Looney Tunes: Back in Action</em> on the Game Boy Advance is, like its counterpart on consoles, loosely based on the 2003 film. Bugs Bunny and Daffy Duck find the office of Mr. Warner at Warner Bros. taken over by bad guys, including Yosemite Sam, Marvin the Martian, Elmer Fudd and the Tazmanian Devil, all working for the evil Acme Corporation. Thankfully, other Looney Tunes characters have formed a resistance against Acme and can guide Bugs and Duffy to defeat Acme's nefarious scheme.</p><p>The game takes place over four large levels: the Wooden Nickel casino in Las Vegas, Area 52 in the Nevada desert, the Louvre in Paris and a temple in the jungle. Levels are displayed in an isometric view and players can switch between Bugs and Daffy at any time. The characters have slightly different abilities: Bugs can jump longer distances by flapping his ears and can get across the level by burrowing through rabbit holes. Daffy is the only one who can swim in water.</p><p>The goal in each level is to capture 12 \"munkeys\". Other characters like Foghorn Leghorn or Egghead Jr. are always nearby to give hints on what to do next. To get to the munkeys, several smaller challenges must be met: solving a maze, racing or dueling other characters or leading enemies into a trap. Enemies like guards, cowboys (in the casino) or robots (at Area 52) always patrol the levels. Mailboxes dispense useful powerups to deal with them: throwing ammunition in the form of eggs, a special one-time-use dropping weapon (an anvil for Daffy, a piano for Bugs), an invincibility shield, and more.</p><p>Also lying about the levels are \"munnies\" (i.e. banknotes). Collecting enough of them opens up mini-games in which bombs drop from the sky and must be pushed off a platform before they explode. Fulfilling the quota of bombs without being blown up by one gains an extra life.</p><p>A boss fight against one of the four main bad guys concludes each level. The transition to the next level comes in the form of a racing game, seen from behind the player's car. The same bad guy just beaten in a fight must be beaten again, this time to the finish line. Winning on speed alone is impossible, powerups lying on the road must be used to slow down the opponent: these include bombs, shields, anvils, magnets, and more.</p>"},{"name":"Lord of the Rings, The: The Fellowship of the Ring","year":2002,"developer":"Pocket Studios","url":"a#L.zip/L%2FLord%20of%20the%20Rings%2C%20The%20-%20The%20Fellowship%20of%20the%20Ring%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":5.4,"genres":"Role-playing (RPG) > Diagonal-down > Isometric > Turn-based > Puzzle elements > Fantasy > Licensed","desc":"<p>Based on the legendary novels by the late JRR Tolkien, you take control of the Fellowship as they follow a path of evil to the steps of Mount Doom, in order to cast the One ring of Sauron back into the depths of the volcano, in turn destroying the evil that lies within it. This first in a trilogy follows Frodo and the fellowship as they begin their journey to Mount Doom, only to find that what lies ahead may be too much to handle.</p><p>For the Game Boy Advance RPG, you must battle your way past the Ringwraiths in turn based style (similar to Final Fantasy and the like) action, including the ability to cast spells (thanks to Gandalf) as well as solve puzzles and deliver messages to many of Middle Earth's characters.</p><p>Unlike the movie trilogy, this adaption of the tale includes characters not seen on the big screen, including Tom Bombadil and others, as well as including many of the songs written by Tolkien as puzzles.</p>"},{"name":"Lord of the Rings, The: The Return of the King","year":2003,"developer":"Griptonite, Inc.","url":"a#L.zip/L%2FLord%20of%20the%20Rings%2C%20The%20-%20The%20Return%20of%20the%20King%20%28U%29%20%28M5%29.gba","filesize":1,"score":7.2,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Action RPG > Fantasy > Licensed","desc":"<p>Return to Middle-earth in this video game based on the epic final chapter of the highly-acclaimed The Lord of the Rings movie trilogy.</p><p>The GBA version of The Return of the King is an isometric action-RPG. Play as six heroes: Aragorn, Legolas, Gimli, Frodo, Eowyn and Gandalf the White. With over a million random items, 150 levels (including the Paths of the Dead, Minas Tirith, and the Pelennor Fields), unique skill trees associated with each hero, and cooperative play via the GBA Link Cable, The Return of the King provides dozens of hours of gameplay.</p><p>The GBA version also links to the Nintendo GameCube to unlock new items and secret characters.</p>"},{"name":"Lord of the Rings, The: The Third Age","year":2004,"developer":"Griptonite, Inc.","url":"a#L.zip/L%2FLord%20of%20the%20Rings%2C%20The%20-%20The%20Third%20Age%20%28UE%29%20%28M5%29.gba","filesize":1,"score":7.2,"genres":"Role-playing (RPG) > Strategy > Top-down > Turn-based > Fantasy > Licensed","desc":"<p>The Lord of the Rings: The Third Age for the Game Boy Advance encompasses the entire Lord of the Rings trilogy, but does so in a unique turn-based strategy formula.</p><p>Unlike the console versions, the Game Boy Advance version gives players the option of playing the heroes from the trilogy, selecting their commander from the likes of Aragorn and Gandalf, or even using the evil forces of Mordor and choosing the Witch-king or Saruman.</p><p>From there, the player experiences over 30 battle scenarios, ranging from the well-known battles of the film (Helm's Deep and the Pelennor Fields), small skirmishes (Amon Hen and Osgiliath), and even some more battles just hinted at in the movies (Isildur's ambush, Theodred's death at the fords of the River Isen).</p><p>In each battle, players choose their companions (again, classic characters from the films such as Legolas and Gimli are available, along with bad guys like Wormtongue and Gorbag), and face off against the foe with dozens of troops, including orcs, trolls, Gondorians, Riders of Rohan, Easterlings, Mumakil, and dozens more.</p><p>Unlike other turn-based games, you can't move all of your units each turn. Rather, the board is divided into three \"flanks,\" and your hero in each flank generates the command points you use to move units in that flank. Thus, good leaders like Aragorn may have a lot of command points to give his flank (3-4 is typical), while Gimli may have less, but be a better warrior to make up for it.</p><p>After a battle, you can upgrade your heroes with equipment and special skills, and move onward to conquer the next area of Middle-earth.</p>"},{"name":"Lord of the Rings, The: The Two Towers","year":2002,"developer":"Griptonite, Inc.","url":"a#L.zip/L%2FLord%20of%20the%20Rings%2C%20The%20-%20The%20Two%20Towers%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":7.1,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Real-time > Action RPG > Hack and slash > Direct control > Fantasy > Licensed","desc":"<p>This portable game is based on the movie version of the second installment of Tolkien's classic trilogy. While the console versions of The Two Towers were Action games with 3D graphics, this version is an isometric Dungeon Crawling Action RPG, similar to games like Diablo and Gauntlet.</p><p>The game allows players to take control of five characters: Aragorn, Legolas, Frodo, Eowyn and Gandalf the Wizard. Every character is challenged over 30 levels, bringing the grand total to over 150 levels in the entire game. Linked play will accommodate two-player co-op via the GBA Link Cable.</p>"},{"name":"Lost Vikings, The","year":2003,"developer":"Blizzard Entertainment Inc.","url":"a#L.zip/L%2FLost%20Vikings%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.gba","filesize":1,"score":7.9,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Fantasy > Sci-fi / futuristic > Comedy","desc":"<p>Three Vikings, Eric the Swift, Olaf the Stout, and Baleog the Fierce, were kidnapped by the alien Tomator, the evil Croutonian ruler, who is collecting unique life forms to display in his gallery. The three Vikings will have to combine their unique skills to defeat Tomator, as well as a vast array of aliens, robots, giant snails, big lizards, and more.</p><p><em>The Lost Vikings</em> is a side-scrolling platform puzzle game with a twist. Instead of one character who can jump, run, shoot, collect items, flip switches, and so on, there are three different characters, each with his own skills. Eric the Swift can jump, run and bash through walls with his tough helmet. Olaf the Stout has a shield which can block attacks, function as an air glider or as a step to stand on. Baleog the Fierce can shoot things with his arrows (including switches) or kill things with his sword. The player has to use the three Vikings as a team if he wants to get past the increasingly difficult levels and puzzles.</p><p>The player controls one Viking at a time but can switch between them at any point. The Vikings have limited space in their inventory which they can use to keep various items. Each Viking has three health points, and if he loses them all from confrontations with dangers, he dies (some threats kill instantly), and the level must be restarted.</p>"},{"name":"Lucky Luke: Wanted!","year":2001,"developer":"Infogrames Europe SA","url":"7#Lucky%20Luke%3B%20Wanted%21%20%28EU%29%20%5BFr%2CDe%2CEs%2CNl%2CIt%2CEn%5D.gba","filesize":4194304,"score":"","genres":"Action > Side view > Puzzle elements > Shooter > Western > Licensed","desc":"<p>Based on the famous comics series about good cowboy Lucky Luke.</p><p>Now the Daltons are let out from jail and robbed the bank, and you have to chase them shooting at the bad guys, collecting extra lives, ammunition and dynamites, and collecting the four aces to access the bonus level. Meeting with the dog Rintincan is a checkpoint. Characters of the game points you where to go next.</p><p>The game is 9 (plus 4 bonus) levels in action with puzzle elements, but it has four mini-games also. The Arm-wrestling match, the Cannonball duel, the Single-shot duel, and the Cabaret Duel allow you to play with computer or with a friend, using a cable-link between consoles.</p>"},{"name":"Lufia: The Ruins of Lore","year":2002,"developer":"Neverland Co., Ltd.","url":"a#L.zip/L%2FLufia%20-%20The%20Ruins%20of%20Lore%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":6.9,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>The events of this game take place twenty-five years before those depicted in Fortress of Doom. You control a young man named Eldin. His father was a great treasure hunter who once ventured into ancient ruins and never came back. Eldin became a hunter himself, and is looking for an adventure together with his friends Torma and Rami. Before soon the youngsters come into conflict with the evil kingdom of Gratze, and realize they have to do anything to stop their plans of resurrecting an ancient beast. </p><p>This is a traditional Japanese RPG with turn-based combat viewed from top-down perspective. Enemy encounters are not random, and the enemies are visible on screen. You can gain advantage in battles if you initiate combat by approaching the enemy. The characters can master a variety of \"jobs\", learning abilities and switching classes, or combining them the way the player likes. You can also use special items in battle to capture monsters and to make them fight on you side. You can also upgrade those monsters and even merge with them to become more powerful.</p>"},{"name":"Lunar: Legend","year":2002,"developer":"Japan Art Media Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Lunar%20Legend%20%28USA%29.zip","filesize":1,"score":7.2,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p><em>Lunar Legend</em> is a version of Lunar: The Silver Star, which contains some of the changes introduced in its remake, Lunar: Silver Star Story.</p><p>Graphical style and story-related changes are closer to the remade version than to the original. However, this version does not contain the anime movie cutscenes from the remake, replacing them with still shots. Also, random battles from the original version return, as opposed to visible enemies of the remake.</p><p>Changes unique to this version include the introduction of power special moves, which can be unleashed during battles once a special bar is replenished, and elimination of an explorable world map in favor of linear \"dot-to-dot\" movement between locations. This version also has a different English translation.</p>"}]