[{"name":"M&M's Blast!","year":2001,"developer":"Pipedream Interactive, Inc.","url":"a#M.zip/M%2FM%26M%27s%20-%20Blast%21%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Action > Strategy > Diagonal-down > Side view > Board game > Mini-games > Licensed","desc":"<p><em>M&amp;M's Blast!</em> is a Mario Party-style party game licensed from the candy brand. Players move their M&amp;M candy characters (red, yellow, blue, or green) across a game board by rolling dice and deciding which way to go at a crossroads. The goal is to collect the highest number of M&amp;M's minis. Green spaces add minis, red spaces remove them. Yellow spaces allow players to swap places with another player. Gold spaces do nothing, while blue spaces launch one of sixteen mini-games in which players compete for M&amp;M's. These include catching falling candies, playing mini-golf, basketball or dodgeball, or a top-down race through a labyrinth to get to the sweets. Other game board spaces include teleporters and random events (wheel-of-fortune style).</p><p>Up to four players can play the game. On a single GBA, CPU players can join in, while multiplayer requires several GBAs connected via link cable. Four different game boards are available that can be played either in single games or in a tournament. A game in progress is stored to battery-backed RAM to be resumed later. The mini-games can also be played directly from the menu.</p>"},{"name":"M&M's Break' Em","year":2007,"developer":"Frame Studios S.r.l.","url":"a#M.zip/M%2FM%26M%27s%20-%20Break%27%20Em%20%28V1.1%29%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Strategy > Side view > Fixed / flip-screen > Arcade > Licensed","desc":"<p>Mr. Runch is a rotten and dangerous peanut that has escaped the reject bin. Burning with revenge and sworn to become a real M&amp;M peanut, he is now on the loose and plans to kidnap all M&amp;M's to lock them up in a crystal. Five M&amp;M heroes - Red, Yellow, Blue, Green and Orange - need to stop him.</p><p><em>M&amp;M's Break' Em</em> is mainly a reworking of Gem Smashers, an earlier game by Frame Studios Interactive. The main story mode takes place on different locations, gradually unlocked, along with boss battles. Keys can also unlock hidden levels, marked by a pink spot on the map.</p><p>The player controls one of the M&amp;M's and bounces it throughout the screen. They have different characteristics such based on speed, power and boost. It needs to hit crystals of the same colour (pinballing vertically off objects) and special pots are used to change the colour. When all crystals are gone, the level is completed. Gameplay is time limited, crossing it makes a bouncing skull appear on the screen taking away lives. Special blocks contain bonuses such as detonators, extra points, invulnerability, score multipliers and a harder M&amp;M that cuts through all crystals. The M&amp;M can be moved left or right horizontally, and sped up or slowed down.</p><p>Skills slightly influence gameplay. High power requires less hits to break hard rocks, while boost allows the character to speed up. Only Yellow and Green can break special blocks to access bonuses.</p><p>The DS version can be controlled with the stylus and contains a multiplayer mode.</p>"},{"name":"Machop at Work","year":2001,"developer":"Nintendo Co., Ltd."},{"name":"Madagascar","year":2005,"developer":"Vicarious Visions, Inc.","url":"a#M.zip/M%2FMadagascar%20%28E%29%20%28M3%29.gba","filesize":1,"score":6.9,"genres":"Action > 3rd-person (Other) > Side view > Platform > Puzzle elements > Licensed","desc":"<p>In <em>Madagascar</em> for Nintendo DS, based on the movie of the same name, you play as Marty (zebra), Alex (lion), Gloria (hippo), and Melman (giraffe). Levels require you to switch between the available characters to make use of their special abilities.</p><p>The DS's touch-screen is used to switch characters, fight, and make some movements. Players must explore levels to find hidden collectibles, some of which are only available after unlocking abilities. The story follows the movie plot, with players exploring New York City's Central Park Zoo as well as Madagascar.</p>"},{"name":"Madagascar: Operation Penguin","year":2005,"developer":"Vicarious Visions, Inc.","url":"7#Madagascar%3B%20Operation%20Penguin%20%28Europe%29%20%5BEng%5D.gba","filesize":8388608,"score":6.8,"genres":"Action > 3rd-person (Other) > Side view > Platform > Licensed","desc":"<p><em>Madagascar: Operation Penguin</em> is a sequel to the game Madagascar and features the movie's penguins as the main characters. Your goal is to help the animals escape from the Central Park Zoo in New York City via underground tunnels. As Private Penguin you use silly weapons to attack and travel throughout the world. Once you complete a level, you open up a portion of a tunnel for the penguins to travel through.</p><p>The game is a side-scrolling platformer mainly geared towards children. Besides learning new abilities through items, your goal is also to collect items in each level.</p>"},{"name":"Madden NFL 06","year":2005,"developer":"Exient Entertainment","url":"a#M.zip/M%2FMadden%20NFL%2006%20%28U%29.gba","filesize":1,"score":6.9,"genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p><em>Madden NFL 06</em> is the second contribution by developer Exient to the series on the Game Boy Advance. It is based closely on the previous year's version, with the same graphics engine, similar menus and all previous game modes included. It adds updated rosters for the new season and one new game mode.</p><p>Exhibition games and full seasons, practice mode, situation mode, Two Minute Drill and the Madden Challenges for collecting Madden Cards are all the same as in last year's game. The new mode is called Mini Camp and consists of a number of mini games that can be played for high scores. They include goal kicking, passing, running and tackling.</p><p>Most modes can be played by two players over the link cable.</p>"},{"name":"Madden NFL 07","year":2006,"developer":"Exient Entertainment","url":"a#M.zip/M%2FMadden%20NFL%2007%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p><em>Madden NFL 07</em> is the final installment in the series to appear on the Game Boy Advance. It is based closely on the previous year's version, featuring the same graphics engine and all the same game modes. Teams and rosters have been updated for the new season, and a few new mini games have been added.</p><p>Gameplay modes include exhibition games, full seasons, practice, situation set-up, Two Minute Drill, and Madden Cards collecting. The Mini Camp mode also returns, with five new mini games added: punting inside 20 yards, wide receiver catch, defensive back cover, 40 yard dash and rushing the quarterback. Most modes can again be played by two players via link cable.</p>"},{"name":"Madden NFL 2002","year":2001,"developer":"Budcat Creations, LLC","url":"a#M.zip/M%2FMadden%20NFL%202002%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>The 2002 iteration of <em>Madden NFL</em> is the first to be released on the Game Boy Advance. Its style of graphics and gameplay mimics that of the 16-bit entries in the series on the Genesis and SNES: the field is seen from an angled overhead perspective with players as sprites; camera movement is achieved through the GBA's scaling abilities.</p><p>A \"play now\" mode offers quick exhibition games, while \"season play\" offers full seasons or playoffs, with progress stored to battery-backed RAM. Configurable options include quarter length, penalty levels, weather (in exhibition games), two skill levels, and manual or automatic player control on offense or catching passes. Season and playoff modes simulate the complete games schedule - every single one can be either played or the results simulated.</p><p>The game includes the 31 teams of the 2001 NFL season, as well as the 2002 expansion team, the Houston Texans, and the traditional All-Madden team. Commentary is provided by the sampled voices of John Madden and Pat Summerall.</p>"},{"name":"Madden NFL 2003","year":2002,"developer":"Budcat Creations, LLC","url":"a#M.zip/M%2FMadden%20NFL%202003%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p><em>Madden NFL 2003</em> on the Game Boy Advance is based directly on the previous year's iteration, using the same graphics engine and even the same menus.</p><p>All gameplay options from the 2002 game are included, including the exhibition, season and playoff modes. Besides slightly changed controls and an updated playbook, new additions are player trades, four player support via link cable, and a create-a-player mode. In this mode, several mini games determine the stats of the new athlete, depending on his position: a quarterback will get a throwing game, a receiver a catching game, a running back a sprinting game.</p><p>The teams and stats are updated for the 2002 NFL season, with all 32 teams reorganized into the new divisions. Commentary is provided by John Madden and Al Michaels.</p>"},{"name":"Madden NFL 2004","year":2003,"developer":"Budcat Creations, LLC","url":"a#M.zip/M%2FMadden%20NFL%202004%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p><em>Madden NFL 2004</em> is Budcat Creations' third and last contribution to the series on the Game Boy Advance and differs very little from its immediate predecessors.</p><p>All the features from the 2003 edition are included: exhibition, season and playoff modes, 4-player multiplay via the link cable, player trades, and the create-a-player mode featuring training mini games.</p><p>The graphics engine used is also the same, but the viewing angle has been adjusted for a better overview of the field. Team and player stats are updated for the 2003 NFL season, and the game again features commentary by John Madden and Al Michaels. An entirely new feature is connectivity to the GameCube version of the game, which can be used to unlock bonuses in the console title.</p>"},{"name":"Madden NFL 2005","year":2004,"developer":"Exient Entertainment","url":"a#M.zip/M%2FMadden%20NFL%202005%20%28U%29.gba","filesize":1,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>With <em>Madden NFL 2005</em>, developer Exient takes over from Budcat in bringing the Madden football series to the Game Boy Advance, introducing a new graphics engine, redesigned menus and several game modes previously only seen in console versions of the franchise.</p><p>Standard play modes include exhibition games and a full season. New modes coming over from the consoles are Two Minute Drill, Practice, Situation, and the Madden Cards card collecting sub-game. Gone however is player creation with its associated mini-games.</p><p>The graphics engine is still sprite-based and takes after the early installments of the series on Genesis and SNES. The game includes the 32 teams of the 2004 NFL season, with updated rosters and stats. Season progress and team stats are saved to battery-backed RAM, there is commentary by John Madden and Al Michaels, and the game also offers a two-player option via link cable.</p>"},{"name":"Magi Nation","year":2002,"developer":"Interactive Imagination","url":"a#M.zip/M%2FMagi%20Nation%20%28J%29.gba","filesize":1,"score":7.6,"genres":"Role-playing (RPG) > Top-down > Turn-based > Cards / tiles > Licensed","desc":"<p>In <em>Magi-Nation</em>, the player takes control of a boy named Tony Jones who is dared by his friends to enter a spooky cave. After finding his way in he gets lost and finds a magical world inside called the Moonlands filled with many magical creatures. Now he must fight his way back to the mouth of the cave and escape back to reality.</p><p>The gameplay is a mixed blend of many types. The main gameplay is in the style of an RPG such as Final Fantasy, where the player explores the world, encountering enemies to fight, locating treasures and relics that can be used in battles, and talking to other magical creatures to help find clues to escape.</p><p>The battle sequences are a blend of Pokémon and Yu-Gi-Oh!. The player battles enemies using a turn-based card system with captured monsters from previous fights, and can use certain relics scattered throughout the world to combine with their monster/card to help them defeat enemies and advance. However, there is only a certain amount of relics so the player must use careful strategy when using them in battle.</p>"},{"name":"Magical Vacation","year":2001,"developer":"Brownie Brown Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Magical%20Vacation%20%28Japan%29%20%5BT-En%20by%20Magicalpatcher%20v1.0%5D.zip","filesize":1,"score":"","genres":"Adventure > Role-playing (RPG) > 3rd-person (Other) > Isometric > Anime / Manga","desc":"<p><em>Magical Vacation</em> is an adventure RPG for the Game Boy Advance. In the magical kingdom of Kovomaka, war erupted for three days, but it was kept a secret from ordinary citizens. A man traveled all over the country in preparation of the next battle. Several years later, the player starts attending Will-O-Wisp, a magic school, at the principal's invitation. The player has the ability to interact with spirits. The class is sent away to summer school by the Valencia seaside, where schools are said to have gone missing. A monster called an Enigma shows up on the beach and abducts several students, whom the player must find and rescue.</p><p>The map is divided into four plains, each having several of their own terrains and inhabitants. The player battles enemies in turn-based battles, with strengths and weaknesses depending on element. There are also three multiplayer options: Let's Amigo, Let's Onsen, and Let's Taisen. Amigo lets players exchange spells. Onsen lets players access each others' hot springs, which can be used to power up. Taisen is a multiplayer battle mode.</p>"},{"name":"Majesco Kid's Cards","year":2006,"developer":"Skyworks Technologies, Inc."},{"name":"Majesco's Rec Room Challenge: 3 Games in One - Darts / Roll-a-Ball / Shuffle Bowl","year":2005,"developer":"Skyworks Technologies, Inc."},{"name":"Major League Baseball 2K7","year":2007,"developer":"Skyworks Technologies, Inc.","url":"a#M.zip/M%2FMajor%20League%20Baseball%202007%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Baseball > Licensed","desc":"<p>Major League Action on the go!<br>* Touch screen Batting and Pitching - Intuitively control swings, pitches, and fielders like never before with the touch screen power of the Nintendo DS system.<br>* Multiple Game Modes - Choose from several exciting game modes including Home Run Derby, the All Star Game and Post Season.<br>* Wireless Connectivity - Take your game wireless and enjoy endless hours of player-to-player matches.<br>* Choose from 1 to 4 2K Legends teams, consisting of Johnny Bench, Brooks Robinson, Bruce Sutter and over 75 more all-time greats.</p>"},{"name":"Manhole-e","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Manic Miner","year":2002,"developer":"Jester Interactive Publishing","url":"a#M.zip/M%2FManic%20Miner%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.6,"genres":"Action > Side view > Fixed / flip-screen > Platform > Direct control > Fantasy","desc":"<p>You play the role of Miner Willy, a bold explorer and adventurer. He discovers a network of underground caverns used by an advanced but now extinct civilization, and realizes that the mines contain lucrative metal ores. Through 20 caverns, Willy must collect all treasures before the time (air) runs out, watching out for the nasty guardians, the obstacles, long falls, quicksands and all elements to be found in a classic platform game. </p><p>The game is linear, and each room's exit only becomes available once all the items have been collected. Close contact with an enemy or stationary hazard, or falling a great distance, causes the player to lose a life and restart the level.</p>"},{"name":"Mappy","year":2004,"developer":"Namco Limited"},{"name":"Marble Madness / Klax","year":2005,"developer":"Frame Studios S.r.l.","url":"a#M.zip/M%2FMarble%20Madness%2C%20Klax%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Compilation","desc":"<p>A compilation of the classic arcade games Klax and Marble Madness brought to the Game Boy Advance.</p>"},{"name":"March of the Penguins","year":2006,"developer":"Skyworks Technologies, Inc.","url":"a#M.zip/M%2FMarch%20of%20the%20Penguins%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":5.1,"genres":"Action > Educational > Puzzle > Side view > Top-down > 2D scrolling > Ecology / nature > Licensed","desc":"<p>Based on the documentary <em>March of the Penguins</em>, this game follows the story of the emperor penguins as they embark on a long journey to breed their young. The game has been divided into twelve chapters, with different gameplay. The penguins need to be navigated through the environment, find a suitable mate, find food, take care of the egg, guard the young ones and finally make it all the way back.</p><p>A large part of the game is based on the concept of Lemmings. As the penguins march on, players need to help them land softly, melt obstacles, attract them in a certain direction using fish and place trampolines, ramps, slides, bridges and steps to make them access new areas. The levels can be explored using binoculars and the penguins need to collect a certain amount of snowflakes to pass. The penguins cannot die. When they fall off a cliff, they simply restart at the beginning of the level, but the players needs to bring them to the end as a group to succeed.</p><p>Other levels have the penguins slide down hills with faster gameplay, feature mazes, or take place underwater where predators need to be avoided while collecting food. In the later parts of the game, guarding the eggs adds a new layer of difficulty. As soon as a penguin hits an obstacle it is dropped. There is little time to pick it up again or it freezes. It also need to be taken to a warm spot before the thermometer time runs out.</p><p>Some educational content has also been included. Next to the habits, more information about the penguin migration in provided in between levels.</p>"},{"name":"Mario & Luigi: Superstar Saga","year":2003,"developer":"AlphaDream Corporation, Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mario%20%26%20Luigi%20-%20Superstar%20Saga%20%28USA%29.zip","filesize":1,"score":8.6,"genres":"Action > Role-playing (RPG) > Isometric > Turn-based > Japanese-style RPG (JRPG) > Puzzle elements","desc":"<p>Princess Peach's voice has been stolen by Cackletta and replaced with explosives! Mario and Luigi with the help of Bowser follow her trail to the neighboring Beanbean Kingdom, where they interact with a new cast of characters in their quest to stop her.</p><p>Battle gameplay further continues the Super Mario RPG and Paper Mario traditions. Rather than merely making selections from a menu as in many RPGs, timing your button presses correctly can inflict or defend from extra damage.</p>"},{"name":"Mario Bros.","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Mario Golf: Advance Tour","year":2004,"developer":"Camelot Software Planning","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mario%20Golf%20-%20Advance%20Tour%20%28USA%29.zip","filesize":1,"score":8.2,"genres":"Sports > Behind view > Top-down > RPG elements > Golf","desc":"<p>Similarly to Mario Golf for Game Boy Color, <em>Mario Golf: Advance Tour</em> allows players to create two of their own custom characters and experience golf by progressing through an RPG-like story. The ultimate goal of the story is to make your player climb through the ranks of the various clubs, ultimately reaching the goal of the elite Mushroom Kingdom golfers, such as Princess Peach, Donkey Kong and of course Mario.</p><p>It's possible to earn experience for either character either by playing through rounds of golf, or by successfully completing various types of mini-games and contests that help you hone your putting, swing, and other golf skills. Distributing experience is more difficult now, as you have to make sure that both characters are sufficiently levelled up so that you can succeed in double matches as well as solo games.</p><p><em>Advance Tour</em> also links up to Mario Golf: Toadstool Tour for the Nintendo GameCube. By doing this, you can earn even more experience points by transferring your characters over and playing the various modes in Toadstool Tour. Of course, it's also possible to link up to another copy of Advance Tour for GBA multiplayer.</p>"},{"name":"Mario Kart: Super Circuit","year":2001,"developer":"Intelligent Systems Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mario%20Kart%20-%20Super%20Circuit%20%28USA%29.zip","filesize":1,"score":8.3,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Track racing > Fantasy","desc":"<p>This GBA conversion brings together elements of both Super Mario Kart (the original SNES classic) and the N64 sequel, Mario Kart 64.* Much like the SNES title, you can collect coins lying on the tracks to boost the speed of your kart.</p><ul><li><p>All of the characters from MK64 are included (Mario, Luigi, Toad, Donkey Kong, Bowser, Wario, Peach, and Yoshi)</p></li><li><p>No Kart game is complete without a multiplayer mode. In this case, four can play classic and battle modes using either one cartridge and four GBA's or four cartridges and four GBA's for the full list of characters to choose from.</p></li><li><p>Weapons include the classic green and red shells and the purple spiked shell.</p></li><li><p>20 new tracks, using elements from both past titles.</p></li></ul>"},{"name":"Mario Party Advance","year":2005,"developer":"Hudson Soft Company, Ltd.","url":"a#M.zip/M%2FMario%20Party%20Advance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.2,"genres":"Action > Strategy > Side view > Top-down > 2D scrolling > Isometric > Board game > Mini-games > Party game > Direct control > Fantasy","desc":"<p>The first portable incarnation of the Mario Party series, Mario Party Advance shakes things up quite a bit on the GBA.  With the focus on the single-player, there are all kinds of single-player mini-games, one giant single-player board to traverse instead of multiple ones (Shroom City), and all kinds of different Gaddgets and gameplay modes to indulge in.</p><p>The main single-player experience involves traveling across \"Shroom City,\" which is a major departure from the standard set-up in past Mario Party titles.  You have the choice to be Mario, Luigi, Peach, or Yoshi, and depending on who you choose, you'll start at a different spot on the board, which is quite large.</p><p>You're given die rolls to navigate the board and, when you reach special sections of the map, complete special quests, which often involve helping residents of Shroom City and/or participating in special challenges.  Most quests involve collecting some sort of object elsewhere or a mini-game.  By completing these quests, you'll collect stars, which eventually allow for special boss bouts with Bowser, and you'll unlock mini-games and Gaddgets, which are simple, toy-like contraptions that you can play with.</p><p>The game ends when you complete your allotted number of turns, although additional turns and die rolls can be earned during the game by completing the \"Mushroom Challenges\" that occur rather often.  After completing your session, your rewards are saved, and you can play with your mini-games and Gaddgets in Play Mode.</p><p>There are also two additional modes available, \"Party Land,\" where you can play special duel mini-games with a friend, and \"Challenge Land,\" where you play through special modes that test your mini-game skills to earn coins, which can be used to purchase additional unlockables in a shop.</p><p>Finally, there is also a feature called the \"Bonus Board.\"  You can play with a board that is included with the game using the GBA.  The GBA takes care of die rolls, mini-games, and end-of-the-game events.</p>"},{"name":"Mario Party-e","year":2003,"developer":"indieszero Co., Ltd."},{"name":"Mario Pinball Land","year":2004,"developer":"Fuse Games Limited","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mario%20Pinball%20Land%20%28USA%2C%20Australia%29.zip","filesize":1,"score":6.4,"genres":"Action > Simulation > Diagonal-down > Pinball > Licensed","desc":"<p>This is the standard \"Bowser has kidnapped the Princess, and Mario must rescue her\" story. In this case, the Princess is transformed into a ball and launched from a Super Mario 64-style cannon, which a pair of goombas aim directly at Bowser's Castle. Mario is also transformed into a ball and chases after her.</p><p>There are 5 levels, each consisting of a set of pinball tables. Each table has some exits (including the one below the flippers) that Mario can use to move to other tables. Also, each one holds a star, normally obtained by defeating all enemies on the table. Some exits require that Mario has a certain number of stars. To gain access to Bowser's castle, Mario must defeat the bosses of the first 4 levels, which gives him star keys. The game also features a \"Time Attack\" mode, which allows players to fight already defeated bosses again.</p>"},{"name":"Mario Tennis: Power Tour","year":2005,"developer":"Camelot Software Planning","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mario%20Tennis%20-%20Power%20Tour%20%28USA%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1,"score":8.2,"genres":"Sports > Diagonal-down > 2D scrolling > RPG elements > Direct control > Tennis","desc":"<p><em>Mario Tennis: Power Tour</em> is the portable sibling of Mario Power Tennis on the GameCube. </p><p>Aside from the standard spins, drop shots, lobs, and smashes available in a standard game of tennis, <em>Power Tour</em> adds power shots into the mix. Offensive power shots can be used to end a long-rally in your favor, while defensive power shots can help you make an impossible save.</p><p>Following in the footsteps of other portable Mario Sports titles, <em>Power Tour</em> adds a bit of RPG-like features into the mix of standard tennis action. Story mode has you guide either one of the rookie players, Max or Tina, through the ranks of competitors in the academy on their way to the Island Open Championships. Winning matches against opponents in the academy rewards you with points you can use to raise your stats. Matches can either be in one-on-one Singles matches, or you can team up with an AI-controlled partner in Doubles. </p><p>In between matches, you are also given the opportunity to explore the academy and participate in training courts and several mini-games, such as weight-lifting, to further build up your stats. Exhibition modes are also available for quick pick-up-and-play gameplay. Multiplayer modes include Singles and Doubles matches where you can choose from the stock cast of characters or you can also opt to use your powered up characters from the Story mode against each other.</p>"},{"name":"Mario vs. Donkey Kong","year":2004,"developer":"Nintendo Software Technology Corporation","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mario%20vs.%20Donkey%20Kong%20%28USA%2C%20Australia%29.zip","filesize":1,"score":7.5,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform > Puzzle elements","desc":"<p>In the beginning video, Donkey Kong is at home channel-surfing. While flipping through channels, DK notices an ad about the new Mini Mario Toy. Right away, he decides to get his hands on as many as he can, so he steals them from Mario's Toy Factory. Now, Mario has to get them back.</p><p>Mario must find the key then rescue a Mini Mario in six levels of each world. In the seventh level, Mario must guide all the Mini Marios he collected through the letters T, O, and Y and into the toy box. The eighth and last level pits Mario against Donkey Kong. There are many enemies and obstacles to avoid, including Bob-ombs, Shy Guys, Boos, trash cans, fireballs, and Thwomps.</p>"},{"name":"Marvel Ultimate Alliance","year":2006,"developer":"Barking Lizards Technologies L.L.C.","url":"a#M.zip/M%2FMarvel%20Ultimate%20Alliance%20%28E%29%20%28M2%29%20%28Eng-Ita%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Fighting > RPG elements > Sci-fi / futuristic > Licensed","desc":"<p>The handheld version of <em>Marvel Ultimate Alliance</em>, like its console counterparts, has the player taking control over one of a selection of Marvel super-heroes and battling through locations and enemies from the Marvel universe. Selectable playable characters are: Spider-Man, Blade, Elektra, Thor, Wolverine, Captain America, Deadpool and Iceman. Ms. Marvel and Thing as also available as unlockable characters.</p><p>The game plays out something like Final Fight, where the player walks from left to right with the ability to move on the z-axis and punch and kick wave after wave of enemies including the occasional boss.</p><p>It has some unique elements added to the genre basics, however. A meter controls the use of super powers, which can be upgraded as experience is gained. Players also have the ability to summon various Marvel heroes for quick support roles. There are many items to find, both quest items, such as keys to unlock doors and weapons and equipment, like weapons and armor, to buff up the characters' abilties.</p>"},{"name":"Mary-Kate and Ashley: Girls Night Out","year":2002,"developer":"Powerhead Games","url":"a#M.zip/M%2FMary-Kate%20and%20Ashley%20-%20Girls%20Night%20Out%20%28U%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Arcade > Licensed","desc":"<p>Do you have good rhythm? Mary-Kate and Ashley have organized a girls night out filled with hip fashion and some hip-hop dance moves. First, you've got to have the right look to get into the club: select from the twins' wardrobe of clothes, shoes, and accessories. Then it's time to dance the night away. Like other popular music games, Girls Night Out will challenge you to repeat a series of key-press patterns to the game's music. Dance well and you'll unlock new dance moves, new songs, and even clothes. You can also rock the house by playing DJ for the club. The game lets you create and save your own music mixes from techno, house, and disco clips.</p>"},{"name":"Masters of the Universe: He-Man - Power of Grayskull","year":2002,"developer":"Taniko, LLC","url":"a#M.zip/M%2FMasters%20of%20the%20Universe%20-%20He-man%20Power%20of%20Grayskull%20%28U%29.gba","filesize":1,"score":6.6,"genres":"Action > Diagonal-down > Isometric > Fantasy > Licensed","desc":"<p>Based off the updated cartoon of the popular '80's toy, Masters of the Universe - He-Man: Power of Greyskull puts players in the role of He-Man as he hacks and slashes through a 13-level quest to confront the evil Skeletor.</p><p>Taking a nod to such classic beat-em ups like Golden Axe or Gauntlet, He-Man makes his way through the various areas of Eternia fighting hordes of Skeletor's underlings while searching for keys to open doors, power-ups to enhance strength and defense, and He-Man's captured friends, such as Man-At-Arms or Cringer.  He-Man can stop the enemies from advancing upon him by destroying the warp portals that are scattered throughout the area.</p><p>Along the way, He-Man can even ride on Battle Cat through \"shooter\" style levels to get to new areas and face Skeletor's main minions, such as Beast Man and Clawful.</p><p>Masters of the Universe - He-Man: Power of Greyskull uses a password save to mark player's progress throughout the game.</p>"},{"name":"Mat Hoffman's Pro BMX","year":2001,"developer":"HotGen Ltd.","url":"a#M.zip/M%2FMat%20Hoffman%27s%20Pro%20BMX%20%28E%29%20%28M2%29.gba","filesize":1,"score":6.5,"genres":"Sports > 3rd-person (Other) > Side view > Tricks / stunts > Bike / bicycling > Licensed","desc":"<p>Developer HotGen's adaptation of Activision's Tony-Hawk-style BMX game for the Game Boy Advance is based on the design of their earlier GBC version, offering mostly the same game modes but in different and larger levels, and adding two-player modes for the first time.</p><p>Players can select from the same eight professional BMX riders as in the console and GBC versions, each with different stats and signature moves. The training section is as comprehensive as on GBC: in 19 levels, basic riding and all manners of tricks, grinds, and combos are taught. The main Career mode consists of six levels. To unlock later levels, magazine covers must be collected, which is done by achieving specific goals in each level, all within a time limit: this includes reaching several different high scores (\"high\", \"pro\", and \"sick\"), collecting the letters T-R-I-C-K, finding secret covers hidden in the levels, and performing specific tricks, combos, or consecutive tricks without any bails in-between. The final level is a competition level where there are no goals to be completed or magazine covers to be won: medals are awarded instead for the best scores.</p><p>The same levels as in Career mode are used in Tournament mode, where players must impress judges to land in the top three for each level. Unlocked levels can be practised without a time limit in Free Ride mode. Time Trial mode features four special dirt track stages and consists of trying to reach the finish line within a very tight time limit: performing tricks extends the limit and is necessary to have any chance of winning.</p><p>Four different two-player modes are included via link cable connection: VS. allows the two players to perform in the same level, trying to outscore each other. Bomb is a game of tag where players try to give each other a bomb before it explodes. In Star Hunt the goal is to collect more stars than the other player, and Tug-O-War features a power indicator that needs to be shifted to the other player's side by performing high-scoring moves.</p><p>Like on the GBC, the game shows the player's biker from a side-scrolling perspective. While still based on horizontal lanes, movement isn't as limited as on GBC - changing the lane through vertical movement is possible at any time when on the ground. Tricks are performed through button combinations when in the air or at certain objects. The GBA's L and R buttons enhance the possible moves from the GBC: Pressing R allows any trick to be turned into a Fakie for more variety. Pressing L locks the biker in the current lane so no accidental vertical movement is made. Performing moves without bailing raises a power bar, that when full, allows the biker's signature moves to be performed for extra score.</p>"},{"name":"Mat Hoffman's Pro BMX 2","year":2002,"developer":"HotGen Ltd.","url":"a#M.zip/M%2FMat%20Hoffman%27s%20Pro%20BMX%202%20%28U%29.gba","filesize":1,"score":7.7,"genres":"Action > Sports > Side view > Tricks / stunts > Bike / bicycling > Licensed","desc":"<p>Mat \"The Condor\" Hoffman and nine other world-class Pro BMX riders feature in this entry to the BMX racing series. Many gameplay features remain as before.</p><p><strong>Single Player Modes:</strong><strong>Road Trip</strong> - Go on tour with other riders to visit the different levels. Complete the objectives to unlock the levels.</p><p><strong>Single Session</strong> - Practice your skills in this timed run and to add new high scores.</p><p><strong>Free Ride</strong> - Practice without a time limit. You won't be able to save your scores though.</p><p><strong>Multiplayer Modes:</strong><strong>LINK Play:</strong> Using a Link Cable to play against a friend. You can play the following game types.</p><p><strong>VS</strong> - Compete against a friend to get the highest score.</p><p><strong>Bomb Game</strong> - Ride around to tag each other, just don't be left with the bomb when time runs out.</p><p><strong>Joust</strong> - The player with the biggest combo knocks their opponent to the ground.</p><p><strong>Trick Attack</strong> - Control and get the balance to tip in your favor.</p><p><strong>Fast Play</strong> - See who is the best in all game modes.</p><p><strong>HotSeat Play:</strong> Compete against a friend on the same Game Boy Advance.</p><p><strong>HORSE</strong> - Compete for the single best trick.</p><p><strong>Fast Play</strong> - Same as the Link Play mode.</p><p>The Pros in the game include Mat Hoffman, Joe Kowalski, Rick Thorne, Mike Escamilla, Simon Tabron, Kevin Robinson, Cory Nastazio, Ruben Alcantara, Seth Kimbrough, Day Smith and Nate Wessel.</p><p>The locations you get to go to are Oklahoma City, Chicago, Las Vegas, New Orleans, Boston, Los Angeles, Portland, and Hawaii.</p>"},{"name":"Max Payne","year":2003,"developer":"Möbius Entertainment Ltd.","url":"7#Max%20Payne%20%28USA%29.gba","filesize":16777216,"score":7.7,"genres":"Action > Isometric > Shooter > Contemporary > North America","desc":"<p>Max Payne's family died. Now he's out for revenge. In the tradition of the original PC hit, Max Payne on Game Boy Advance follows the story of Max has he attempts to bring down the crime lords who attempted to destroy his life.</p><p>Unlike the original, the GBA version uses an isometric perspective to present the action, however everything else is included, right down to bullet time. Various weapons are on offer to dispatch the guys (or gals) standing in your way, and by using bullet time, you can slow down time and increase your chances of both avoiding incoming fire and hitting the target.</p>"},{"name":"Maya the Bee: The Great Adventure","year":2002,"developer":"Shin'en Multimedia GmbH","url":"a#M.zip/M%2FMaya%20the%20Bee%20-%20The%20Great%20Adventure%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > Licensed","desc":"<p>In <em>Maya the Bee: The Great Adventure</em> Maya the Bee goes off to find her missing friend Willie, before the day is up. The player navigates Maya through a sixteen platforming stages collecting flowers, dodging foes and uncovering secret rooms along the way. Each new level features new traps, foes and gameplay mechanics that make the game progressively harder.</p>"},{"name":"Mazes of Fate","year":2006,"developer":"Sabarasa Inc","url":"a#M.zip/M%2FMazes%20of%20Fate%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.5,"genres":"Role-playing (RPG) > 1st-person > Top-down > Real-time > Fantasy","desc":"<p>The ancient gods have passed judgment, and as a result all of mankind has been sentenced to be replaced with a new, less sinful race. The only chance for redemption lies withing a magical item that will allow mankind to atone for its sins. But the item in question has been stolen by the enemies of humanity, and the verdict of the gods will soon come to pass.</p><p>Mazes of Fate is a fantasy medieval first person \"dungeon-crawler\" RPG in which you create a character based on gender, class and attributes (or take your pick from one of the three pre-made characters) and set out in a quest to save the human race from oblivion. The game alternates between world and town map sequences in which you control your party from an overhead perspective and visit shops and get quests from NPCs and the many dungeons that compose the bulk of the game itself. While dungeon crawling the game switches to a first-person perspective from which you control your party as it fights all the monsters that cross your path and loot the treasures uncovered. Combat is real-time although the game pauses while you navigate action menus.</p><p>Features loads of items, weapons and quests, as well as tons of monsters and up to 5 recruit-able party members.</p><p>The Nintendo DS version changes a few things from the Game Boy Advance version. The DS version uses a 3D engine that replaces the pseudo 3D and also adds new secret dungeon areas along with entire new dungeon maps.</p>"},{"name":"Mech Platoon","year":2001,"developer":"Will Co., Ltd.","url":"a#M.zip/M%2FMech%20Platoon%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.4,"genres":"Strategy > Isometric > Real-time > Mecha / giant robot","desc":"<p>A real-time strategy (RTS) game for the GBA.  Players build an army of robot mechs to capture 5 planets in a series of missions against two other nations.  A player's mechs are built and improved by building laboratories, bases and by salvaging battlefields for enemy parts.  All the key elements of a classic RTS in your GBA.</p>"},{"name":"Medabots AX: Metabee Ver.","year":2003,"developer":"Natsume Co., Ltd.","url":"a#M.zip/M%2FMedabots%20-%20Metabee%20Version%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Anime / Manga > Fighting > Platform","desc":"<p><em>Medabots AX: Metabee Ver.</em> is a 2D fighting game, featuring platformer-like arenas. Players control a single Medabot and engage in 2x2 team battles wagering robot parts, which can be collected and assembled on player's Medabots. The first main objective of Medabots AX is to win a championship and, later, defeat the Rubberobo Gang.</p><p>The game features a variety of arenas and opponents which will require the player to shuffle strategies from time to time, be it changing robot parts or battle style. Medaforce is available to every Medabot, but each one has an effect based from its medal. Medals can be trained to increase damage done with close attacks and ranged attacks, or to increase efficiency from support and defense.</p><p>Medabots AX was only released in North America and is based on another game released only in Japan, Medarot G. Characters and robots were changed to fit the market. Two versions exist: Metabee and Rokusho. Even though the story is pretty similar between the games, some robot parts and medals are exclusive to a game. Battling and Trading using a Link Cable is possible and is the only way to collect every robot part and medal.</p>"},{"name":"Medabots AX: Rokusho Ver.","year":2003,"developer":"Natsume Co., Ltd.","url":"a#M.zip/M%2FMedabots%20AX%20-%20Rokusho%20Version%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Anime / Manga > Fighting > Platform","desc":"<p><em>Medabots AX: Rokusho Ver.</em> is a 2D fighting game, featuring platformer-like arenas. Players control a single Medabot and engage in 2x2 team battles wagering robot parts, which can be collected and assembled on player's Medabots. The first main objective of Medabots AX is to win a championship and, later, defeat the Rubberobo Gang.</p><p>The game features a variety of arenas and opponents which will require the player to shuffle strategies from time to time, be it changing robot parts or battle style. Medaforce is available to every Medabot, but each one has an effect based from its medal. Medals can be trained to increase damage done with close attacks and ranged attacks, or to increase efficiency from support and defense.</p><p>Medabots AX was only released in North America and is based on another game released only in Japan, Medarot G. Characters and robots were changed to fit the market. Two versions exist: Metabee and Rokusho. Even though the story is pretty similar between the games, some robot parts and medals are exclusive to a game. Battling and Trading using a Link Cable is possible and is the only way to collect every robot part and medal.</p>"},{"name":"MedaBots: Metabee","year":2003,"developer":"Natsume Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Medabots%20-%20Metabee%20%28USA%29.zip","filesize":1,"score":"","genres":"Action > Role-playing (RPG) > Strategy > Side view > Top-down > Fixed / flip-screen > Anime / Manga > Turn-based > Tactical RPG > Menu structures > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Welcome to the world of MedaBots.  MetaBots are robots that can have various parts upgraded and swapped to change and improve them.  These parts can be purchased, or can be received as the spoils of battle if you win.</p><p>Enter your character... a boy who loves MedaBots.  Sent to the store to get Spice-A-Roni, he ends up with a MedaBot instead.  From this point on, his life is thrown into Robattles with other MedaBots.</p><p>MedaBots are made up of a basic body (male or female), four main parts (head, legs, right arm, and left arm), and a medal.  The medal is what powers the MedaBot.  All these parts can be changed.  And because each part has multiple properties, you don't really \"upgrade\" your MedaBot... you just change it.  Sometimes you will want a powerful weapon attack, sometimes you may want a less powerful weapon attack that can do Chain Damage or Status Damage.</p><p>When you battle, you take turns based on the speed your MedaBot can reach the center of the field.  After it attacks, you hurry back to the outside and then return to the center.  This is really just a timer thing to show how the speed of your MedaBot is affecting the attack speeds.</p><p>Your attack can damage the various parts of the other MedaBot(s) as long as it hits.  Destroying a part will prevent the MedaBot from attacking with that part.  Destroying the head will give you a victory even if you destroy nothing else.  However, you cannot aim at each part.  The defense rating of each part helps determine what is hit first.</p><p>Follow the story as you gain experience and level up your MedaBot's medal to gain more powerful attacks, better aim, etc.  Get more bodies and medals for MedaBots so you can battle with up to 3-on-3 battles.</p>"},{"name":"Medabots: Rokusho","year":2003,"developer":"Natsume Co., Ltd.","url":"a#M.zip/M%2FMedabots%20-%20Rokusho%20Version%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Role-playing (RPG) > Strategy > Side view > Top-down > Anime / Manga > Fighting > Mecha / giant robot","desc":"<p><em>Medabots: Rokusho</em> is the companion title to MedaBots: Metabee. The player assumes the role of Ikki Tenryou, a boy who loves Medabots. When he is talked into buying a Medabot instead of dinner, Ikki discovers it is missing a vital medal. When a mysterious man named Phantom Renegade gives his father a medal, Ikki can finally compete against other Medafighters in Robattles. However, an organization known as the Medamaniacs are stealing medals and Medaparts from kids. Ikki must track down the source of the trouble.</p><p>Medabots can be built and customized using Medaparts. If a player wins a battle they get a Medapart, but if they lose, they must give up one of their Medaparts. In battle, turns are taken based on a Medabot's speed and how long it takes to get to the center of the battlefield, and after each turn they run back to the edge. Each Medapart has a defense rating, with damage depending on this. When a Medapart is destroyed, the Medabot can no longer use this Medapart to attack. When a Medabot's head is destroyed, the other Medabot wins.</p><p>Storyline and gameplay are identical between <em>Metabee</em> and <em>Rokusho</em>, but there are version-exclusive Medabots and Medaparts.</p>"},{"name":"Medal of Honor: Infiltrator","year":2003,"developer":"Netherock Ltd.","url":"7#Medal%20of%20Honor%3B%20Infiltrator%20%28USA%2C%20Europe%29%20%5BEn%2CFr%2CDe%5D.gba","filesize":16777216,"score":7.5,"genres":"Action > Top-down > Shooter > Historical events > World War II > War","desc":"<p>Medal of Honor Infiltrator is a shooter from a top-down viewpoint. The top-down graphics and gameplay are reminiscent of classic games like Commando and Frontline.</p><p>In its 15 total levels, Infiltrator brings together a variety of different play styles that should be familiar to anyone who's played their fair share of 8- and 16-bit games. </p><p>You can hide behind houses and other buildings to stop enemy bullets.If you come across a stationary gun or a tank sitting in a level, you can put these weapons to use against the enemy.</p><p>Each level has a number of mission objectives assigned to it, such as locating documents or destroying ammunition depots. To complete a level, you need to accomplish these goals. </p><p>The difficulty level is, like its forerunners, high and urges the players all the time.</p>"},{"name":"Medal of Honor: Underground","year":2002,"developer":"Rebellion Developments Ltd.","url":"7#Medal%20of%20Honor%3B%20Underground%20%28Europe%29%20%5BEn%2CFr%2CIt%2CEs%5D%2001.gba","filesize":8388608,"score":7.2,"genres":"Action > 1st-person > Shooter > Direct control > Europe > Historical events > World War II > Spy / espionage > War > Regional differences","desc":"<p>The game is a prequel to Medal of Honor and it is set in the early stages of WWII. You play as Manon Batiste, who briefed the missions for you in the original Medal of Honor. She is a new member of a small band of French rebels who fight against the tyranny of the Germans.</p><p>There are 7 missions in total, featuring 12 different historical weapons. There are NPCs helping you out by cracking safes and driving. Not all enemies are on foot; expect to face tanks and bikes amongst other things. Enemy AI is responsive and sometimes surprising.</p>"},{"name":"Medarot Navi: Kabuto","year":2001,"developer":"Natsume Co., Ltd.","url":"a#M.zip/M%2FMedarot%20Navi%20-%20Kabuto%20Version%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p>In <em>Medarot Navi: Kabuto</em>, a boy named Kasumi Asano discovers an alien Medabot named Mistral under the auditorium of an abandoned school. When his class takes a field trip to the modular space station Cluster, it separates and goes adrift, forcing Kasumi to reunite the students and save the space station.</p><p>As Kasumi, the player must liberate each Module of the Cluster from the Space Robos. Once a Module is liberated, a classmate must be stationed there to prevent it from being retaken. In battle, up to five Medabots can be used. Winning the battle rewards Kasumi with a random part from the enemy team. Some Modules have Parts Research centers, and allies posted at these Modules will be able to develop new Medabot parts.</p>"},{"name":"Medarot Navi: Kuwagata","year":2001,"developer":"Natsume Co., Ltd.","url":"a#M.zip/M%2FMedarot%20Navi%20-%20Kuwagata%20Version%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p>In <em>Medarot Navi: Kuwagata</em>, a boy named Kasumi Asano discovers an alien Medabot named Mistral under the auditorium of an abandoned school. When his class takes a field trip to the space station Cluster, it separates ad goes adrift, forcing Kasumi to reunite the students and save the space station.</p><p>As Kasumi, the player must liberate each Module of the Cluster from the Space Robos. Once a Module is liberated, a classmate must be stationed there as security to prevent it from being retaken. In battle, up to five Medabots can be used. Winning the battle rewards Kasumi with a random part from the enemy team. Some Modules have Parts Research centers, and allies posted at the Modules will be able to develop new Medabot parts.</p>"},{"name":"Meet the Robinsons","year":2007,"developer":"Climax Handheld Games","url":"a#M.zip/M%2FMeet%20the%20Robinsons%20%28E%29%20%28M6%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > Side view > 2D scrolling > Platform > Direct control > Sci-fi / futuristic > Licensed","desc":"<p>To The FUTURE...AND BACK!<br>* Play as Wilbur or Lewis on 20 new missions - beyond the movie!<br>* Activate cool gadgets to battle Little Doris and other villains<br>* Travel to the future in the time machine</p>"},{"name":"Mega Man & Bass","year":2002,"developer":"Lay-Up KK","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20%26%20Bass%20%28USA%29.zip","filesize":1,"score":7.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>The mighty robot King has taken over Dr. Wily's base, invaded the Robot Museum, and stolen 100 CDs containing secret robot plans, hoping to create the ultimate unstoppable army of robots! And to make matters worse, he's sent 8 robot masters to prove his new-found power!</p><p>Mega Man is the only one who can stop him...or so he thought! Bass, Dr. Wily's greatest creation and Mega Man's sworn rival, is actually fighting ALONGSIDE Mega Man for once! Of course, it's only to prove that he's the strongest robot ever made, and he'll do it by smashing King's army of mechanical maniacs!</p><p>Now, Mega Man and Bass are heading out to get back all of the CD's that King stole. Run, jump, slide, dash, and blast your way through to destroy this new menace!</p>"},{"name":"Mega Man Battle Network","year":2001,"developer":"Capcom Production Studio 2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Battle%20Network%20%28USA%29.zip","filesize":1,"score":7.6,"genres":"Role-playing (RPG) > Isometric > Anime / Manga > Real-time > Sci-fi / futuristic","desc":"<p>In the future, a young net-battler named Lan, boots his 'personal information terminal'(PET) and prepares to hack into the network to battle net crime. Lan's PET is no ordinary network navigator. It is Mega Man.EXE, the cyber-identity, which infiltrates the crime-ridden network to battle destructive computer viruses. Defeat viruses in real time and collect Battle Chips program data, containing valuable weapons data and critical system info. Collect over 175 Battle Chips to help Netto and Mega Man.EXE restore peace and order to the network.</p>"},{"name":"Mega Man Battle Network 2","year":2001,"developer":"Capcom Production Studio 2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Battle%20Network%202%20%28USA%29.zip","filesize":1,"score":7.3,"genres":"Role-playing (RPG) > Isometric > Anime / Manga > Real-time > Sci-fi / futuristic","desc":"<p>Netto Hikari (a.k.a. Lan Hikari) and his Navi MegaMan.EXE are back in a new adventure! After defeating the sinister World Three (WWW) and their leader, Dr. Wily, Netto and MegaMan have made the Internet safe once again. But a new Internet terrorist group, led by a mysterious new Navi named Gospel, have begun to spread chaos and fear throughout the Net! Netto and his friend Meiru, Dekao, and Yaito must get to the bottom of their plan and stop them before the Internet is deleted!</p>"},{"name":"Mega Man Battle Network 3: Blue Version","year":2003,"developer":"Capcom Production Studio 2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Battle%20Network%203%20-%20Blue%20Version%20%28USA%29.zip","filesize":1,"score":7.4,"genres":"Role-playing (RPG) > Isometric > Anime / Manga > Real-time > Sci-fi / futuristic","desc":"<p>LAN, the young hero, is invited to attend a local net-battle tournament with his Personal Electronic Trained character, Mega Man. However, during the tournament, Mega Man and LAN discover a plot by an evil corporation, who hope to once again take over the network.</p><p>Using an RPG style, you must guide Mega Man through various levels defeating enemies along the way and collecting the various chips to upgrade Mega Man's weapons and other items.</p><p>Exclusive to this, the Blue Version, are specialy developed chips (Giga Class chips) that only the Blue Version of Mega Man can use. You can also trade various chips between players using either Blue or White versions of BN3.</p>"},{"name":"Mega Man Battle Network 3: White Version","year":2002,"developer":"Capcom Production Studio 2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Battle%20Network%203%20-%20White%20Version%20%28USA%29.zip","filesize":1,"score":7.4,"genres":"Role-playing (RPG) > Isometric > Real-time > Sci-fi / futuristic","desc":"<p>LAN, the young hero, is invited to attend a local net-battle tournament with his Personal Electronic Trained character, Mega Man. However, during the tournament, Mega Man and LAN discover a plot by an evil corporation, who hope to once again take over the network.</p><p>Using an RPG style, you must guide Mega Man through various levels defeating enemies along the way and collecting the various chips to upgrade Mega Man's weapons and other items.</p><p>Exclusive to this, the White Version, are specialy developed chips (Giga Class chips) that only the White Version of Mega Man can use. You can also trade various chips between players using either Blue or White versions of BN3. Other differences include exclusive enemy bosses in areas and a unique battle style for each games version that Mega Man can use.</p>"},{"name":"Mega Man Battle Network 4: Blue Moon","year":2003,"developer":"Capcom Production Studio 2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Battle%20Network%204%20-%20Blue%20Moon%20%28USA%29.zip","filesize":1,"score":6.7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Isometric > Anime / Manga > Real-time > Sci-fi / futuristic","desc":"<p>It's been rather quiet after Lan and Mega Man defeated the WWW in Mega Man Battle Network 3. Little do they know that they're about to embark on yet another adventure. An asteroid has been spotted in outer space which is heading towards Earth, and scientists are planning to destroy it with a giant laser. In addition to this, a mysterious Navi called ShadeMan is terrorizing the Internet, sucking the life out of other Navis, much like a vampire. Can Lan and Mega Man stop this new threat?</p><p>Mega Man Battle Network 4 is an RPG-like game, and a continuation of the Battle Network series. You play as two characters - a young boy, Lan, in the real world, and a Net Navi called Mega Man on the Internet. Lan can talk to people and interact with the real world, however, when he 'jacks in' to the Internet, Mega Man takes over. In addition to interacting with Navis on the net, Mega Man also encounters random viruses and battles them in a mix of turn-based and real-time battle.</p><p>A new feature of Battle Network 4 is the \"Soul Unison\" feature - as players progress through the game, they can defeat certain Navis and earn the ability to merge with them to become more powerful. The catch with this is that the Soul Unison only lasts for three turns, and that a particular Battle Chip is required to perform it.</p><p>The Soul Unisons that you acquire through the game are specific to each version - to get them all, you must link up with a copy of Mega Man Battle Network 4: Red Sun. You can also trade different Battle Chips (some are exclusive to particular versions) and Net Battle with a friend.</p>"},{"name":"Mega Man Battle Network 4: Red Sun","year":2003,"developer":"Capcom Production Studio 2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Battle%20Network%204%20-%20Red%20Sun%20%28USA%29.zip","filesize":1,"score":7.1,"genres":"Role-playing (RPG) > 3rd-person (Other) > Isometric > Anime / Manga > Real-time > Sci-fi / futuristic","desc":"<p>It's been rather quiet after Lan and Mega Man defeated the WWW in Mega Man Battle Network 3. Little do they know that they're about to embark on yet another adventure. An asteroid has been spotted in outer space which is heading towards Earth, and scientists are planning to destroy it with a giant laser. In addition to this, a mysterious Navi called ShadeMan is terrorizing the Internet, sucking the life out of other Navis, much like a vampire. Can Lan and Mega Man stop this new threat?</p><p>Mega Man Battle Network 4 is an RPG-like game, and a continuation of the Battle Network series. You play as two characters - a young boy, Lan, in the real world, and a Net Navi called Mega Man on the Internet. Lan can talk to people and interact with the real world, however, when he 'jacks in' to the Internet, Mega Man takes over. In addition to interacting with Navis on the net, Mega Man also encounters random viruses and battles them in a mix of turn-based and real-time battle.</p><p>A new feature of Battle Network 4 is the \"Soul Unison\" feature - as players progress through the game, they can defeat certain Navis and earn the ability to merge with them to become more powerful. The catch with this is that the Soul Unison only lasts for three turns, and that a particular Battle Chip is required to perform it.</p><p>The Soul Unisons that you acquire through the game are specific to each version - to get them all, you must link up with a copy of Mega Man Battle Network 4: Blue Moon. You can also trade different Battle Chips (some are exclusive to particular versions) and Net Battle with a friend.</p>"},{"name":"Mega Man Battle Network 5: Team Colonel","year":2005,"developer":"Capcom Production Studio 2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Battle%20Network%205%20-%20Team%20Colonel%20%28USA%29.zip","filesize":1,"score":6.7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Isometric > Anime / Manga > Real-time > Sci-fi / futuristic","desc":"<p>Lan and Mega Man return in the fifth entry to the Battle Network series of games. In this sequel, a mysterious group is distributing Dark Navi chips in the hope of corrupting Navis worldwide. Lan and his friends must storm the Dark Chip Factory and put a stop to this problem before it becomes any worse.</p><p>The game uses an RPG style over-world in which Lan and Mega Man navigate and interact. In the real world, you control Lan, and can interact with objects and talk to people. When you need to enter cyberspace, you 'jack-in', and take control of Mega Man. Mega Man must also battle viruses in addition to navigating through the internet. This is done with a combination of action and turn-based battle, where you select powerful chips to give you an edge each turn, then use the chips and dodge shots in realtime.</p><p>The game also features Liberation Missions, which are a more traditional turn-based style of play. In this mode, you must 'liberate' dark tiles on your way to confront the boss. Liberation Missions play somewhat like a complicated game of chess, with the player actually fighting the battles between the pieces.</p><p>Unique to this version of the game is the ability to play as Colonel partway through the story. The game can also link up to Mega Man Battle Network 5: Team Protoman to trade and complete your battle chip collection - certain chips are only available in one version of the game.</p>"},{"name":"Mega Man Battle Network 5: Team Protoman","year":2004,"developer":"Capcom Production Studio 2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Battle%20Network%205%20-%20Team%20Protoman%20%28USA%29.zip","filesize":1,"score":7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Isometric > Anime / Manga > Real-time > Sci-fi / futuristic","desc":"<p>Lan and Mega Man return in the fifth entry to the Battle Network series of games. In this sequel, a mysterious group is distributing Dark Navi chips in the hope of corrupting Navis worldwide. Lan and his friends must storm the Dark Chip Factory and put a stop to this problem before it becomes any worse.</p><p>The game uses an RPG style over-world in which Lan and Mega Man navigate and interact. In the real world, you control Lan, and can interact with objects and talk to people. When you need to enter cyberspace, you 'jack-in', and take control of Mega Man. Mega Man must also battle viruses in addition to navigating through the internet. This is done with a combination of action and turn-based battle, where you select powerful chips to give you an edge each turn, then use the chips and dodge shots in realtime.</p><p>The game also features Liberation Missions, which are a more traditional turn-based style of play. In this mode, you must 'liberate' dark tiles on your way to confront the boss. Liberation Missions play somewhat like a complicated game of chess, with the player actually fighting the battles between the pieces.</p><p>Unique to this version of the game is the ability to play as Protoman partway through the story. The game can also link up to Mega Man Battle Network 5: Team Colonel to trade and complete your battle chip collection - certain chips are only available in one version of the game.</p>"},{"name":"Mega Man Battle Network 6: Cybeast Falzar","year":2005,"developer":"Capcom Production Studio 2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Battle%20Network%206%20-%20Cybeast%20Falzar%20%28USA%29.zip","filesize":1,"score":6.8,"genres":"Role-playing (RPG) > 3rd-person (Other) > Isometric > Anime / Manga > Real-time > Sci-fi / futuristic","desc":"<p>Lan and his family have moved house to Cyber City, which is famous for its new technology. Lan and Mega Man quickly make new friends, and find out about the legend of the Cybeasts, two ancient creatures with such power that they eventually destroyed each other. However, a shady organization is intent on reviving and controlling the Cybeasts for their own nefarious needs, and Mega Man gets caught in the middle! While they capture the wolf-like Gregar, Mega Man captures the phoenix-like Falzar. By harnessing this new power, Lan and Mega Man must save the internet once again!</p><p>Mega Man Battle Network 6 is an RPG-like game in which you navigate through both the real world, and the cyberworld of the internet. As Lan, you move through the real world, interacting with people and finding places to 'jack-in' to the cyberworld for Mega Man to take control. As Mega Man, you can fight viruses in a hybrid of turn-based and real-time battle: you select which battle chips you need to use each turn, and then use them while actively dodging enemy fire.</p><p>New to Battle Network 6 is the \"Cross Change\" system. After beating certain enemy Navis, Mega Man can copy their strengths (as well as their weaknesses!) and use them to his advantage, similar to the original Mega Man games. For example, you could take on the aqua power of Aqua Man, or the cutting power of Tomahawk Man.</p><p>At a certain point in the game, Mega Man also gains control of the powerful Cybeast, Falzar. Using this power, Mega Man can transform into a phoenix-like Navi, boosting his attack power for three turns, and enhance the power of certain battle chips. If players continue to push Mega Man, he will enter the \"Beast Over\" state, with even more power, but at the loss of control and a severely weakened Mega Man. It's also possible to combine the Cross Change with Falzar, creating even more powerful attacks.</p><p>This game also links up to Mega Man Battle Network 6: Cybeast Gregar. Players can trade battle chips that are specific to each version, or net battle against each other.</p>"},{"name":"Mega Man Battle Network 6: Cybeast Gregar","year":2005,"developer":"Capcom Production Studio 2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Battle%20Network%206%20-%20Cybeast%20Gregar%20%28USA%29.zip","filesize":1,"score":6.7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Isometric > Anime / Manga > Real-time > Sci-fi / futuristic","desc":"<p>Lan and his family have moved house to Cyber City, which is famous for its new technology. Lan and Mega Man quickly make new friends, and find out about the legend of the Cybeasts, two ancient creatures with such power that they eventually destroyed each other. However, a shady organization is intent on reviving and controlling the Cybeasts for their own nefarious needs, and Mega Man gets caught in the middle! While they capture the phoenix-like Falzar, Mega Man captures the wolf-like Gregar. By harnessing this new power, Lan and Mega Man must save the internet once again!</p><p>Mega Man Battle Network 6 is an RPG-like game in which you navigate through both the real world, and the cyberworld of the internet. As Lan, you move through the real world, interacting with people and finding places to 'jack-in' to the cyberworld for Mega Man to take control. As Mega Man, you can fight viruses in a hybrid of turn-based and real-time battle: you select which battle chips you need to use each turn, and then use them while actively dodging enemy fire.</p><p>New to Battle Network 6 is the \"Cross Change\" system. After beating certain enemy Navis, Mega Man can copy their strengths (as well as their weaknesses!) and use them to his advantage, similar to the original Mega Man games. For example, you could take on the firepower of Heat Man, or the cutting power of Slash Man.</p><p>At a certain point in the game, Mega Man also gains control of the powerful Cybeast, Gregar. Using this power, Mega Man can transform into a wolf-like Navi, boosting his attack power for three turns, and enhance the power of certain battle chips. If players continue to push Mega Man, he will enter the \"Beast Over\" state, with even more power, but at the loss of control and a severely weakened Mega Man. It's also possible to combine the Cross Change with Gregar, creating even more powerful attacks.</p><p>This game also links up to Mega Man Battle Network 6: Cybeast Falzar. Players can trade battle chips that are specific to each version, or net battle against each other.</p>"},{"name":"Mega Man Zero","year":2002,"developer":"Inti Creates Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Zero%20%28USA%2C%20Europe%29.zip","filesize":1,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Metroidvania > Platform > Shooter > Sci-fi / futuristic","desc":"<p>It is the year 22XX...</p><p>The legendary heroes of the Reploids, X and Zero, defeated the evil Sigma long ago, and a new army was created to prevent outbreaks of the Maverick Virus. But as time went on, the army became oppressive, and began to deal out a paranoid brand of justice. It is said that their leader, once a great warrior, has become cold and calculating, eliminating any Reploid that dares oppose him.</p><p>A hero is needed in these dark times, and that is exactly what Ciel and her rebel group have found in an old ruin...a hero from the past, reborn in the future.</p><p>Zero has come into a time he does not know, to save it from a figure of the past...the fate of freedom rests on his shoulders.</p>"},{"name":"Mega Man Zero 2","year":2003,"developer":"Inti Creates Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Zero%202%20%28USA%29.zip","filesize":1,"score":7.8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Metroidvania > Sci-fi / futuristic","desc":"<p>A year after the events in Mega Man Zero, the hero finds himself in another battle to save the world. Caught in-between the reploids and humans, Neo Arcadia's new commander has tricked Zero into helping her, although her reasons are uncertain.</p><p>To fix the problem, Zero must battle through level after level, using the new Chain Rod weapon to grapple onto ledges to gain an advantage in collecting out of reach items or attacking enemies from above. Cyber Elfs can again be collected to gain some helpful powerups.</p><p>New to the series is a two player challenge mode, where the first to complete the level wins.</p>"},{"name":"Mega Man Zero 3","year":2004,"developer":"Inti Creates Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Zero%203%20%28USA%29.zip","filesize":1,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Sci-fi / futuristic","desc":"<p>In the third installment of Capcom's Mega Man Zero series, you, unsurprisingly, play as Zero. Continuing where the Mega Man Zero 2 left off, you have to find and neutralize the recently escaped \"Dark Elf,\" before it's able to brainwash the Resistance for the purpose of conquering Neo Arcadia. </p><p>In addition to the old Cyber Elf system, this game also contains a new \"chip\" system, where Zero can gain new abilities by finding chips and installing chip in himself. But they didn't decide to abandon the Cyber Elves in this game by giving them nothing new. No, in order to extend the life of the Cyber Elves, they added the new concept of \"Cyber Space\" to levels, where you enter a door to Cyber Space and are allowed to use each Cyber Elf as much as you please without them dying. However, there aren't too many \"Secret Disks\" (items that can contain anything from profiles of characters to Cyber Elves to new chips) in Cyber Space, so it's better to spend more time in the normal level.</p>"},{"name":"Mega Man Zero 4","year":2005,"developer":"Inti Creates Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mega%20Man%20Zero%204%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Sci-fi / futuristic","desc":"<p>You play as Zero again in this fourth installment of the Megaman Zero series,  you will have to fight against hundreds of enemies in this platform game.</p><p>The evil Dr. Weil wants to take over Neo Arcadia and only Zero and his friends can stop him leading the union between humans and reploids.</p><p>As always, between missions you can configure your abilities (weapons, cyber-elfs, etc.) and talk to characters to learn different things.</p><p>One of the new implementations to the series is that you can control the weather to overcome different obstacles.</p>"},{"name":"Mega Man: Battle Chip Challenge","year":2003,"developer":"Inti Creates Co., Ltd.","url":"a#M.zip/M%2FMegaman%20Battle%20Chip%20Challenge%20%28E%29.gba","filesize":1,"score":5.8,"genres":"Strategy > Diagonal-down > Isometric > Cards / tiles > Sci-fi / futuristic","desc":"<p>Lan, Chaud, Dex and other characters from the Mega Man Battle Network Universe prepare to duke it out in the Battle Chip GP! Take control of your favorite character and face off against many opponents as you make your way to the head of the GP to reach the ultimate prize, an incredibly rare battle chip!</p><p>Gameplay is based around the Mega Man Battle Network series of games, in that players purchase and use various battle chips to combat their opponents. However, unlike the main games, players do not have direct control over their Net Navi. Instead, players pre-select their battle chips, and one of these chips are used in the battle against the opponent. Once selected, the game automatically plays out the battle.</p><p>There is also a process called 'slotting in', which can be performed by pressing L or R during battle when your slot in gauge is full. Slotting in allows you to use an additional battle chip during gameplay to assist you. If successful, the chip will be used, and aid you with healing, dealing extra damage, and so on.</p>"},{"name":"Meitantei Conan: Akatsuki no Monument","year":2005,"developer":"","url":"a#M.zip/M%2FMeitantei%20Conan%20-%20Akatsuki%20no%20Monument%20%28J%29.gba","filesize":1,"score":"","genres":"Adventure > 1st-person > 3rd-person (Other) > Anime / Manga > Detective / mystery > Licensed","desc":"<p><em>Akatsuki no Monument</em> is the second Detective Conan game for Game Boy Advance and features scenario mode as well as various mini-games. The main game story kicks off with Conan, Ran and Kogorou on their way to ceremony of a newly built resort by the sea. Kogorou Mouri, as a renowned detective (thanks to Conan), was invited to the opening ceremony, while Conan and Ran are just tagging along. As they arrive, the owner of the luxury resort asks them to look into the rumors about the land where the mansion was built on. The rumor is known as the so called \"village of suicides\". Later that evening, as they check the buffet and meet many other invited guests, pleasantries are exchanged and small talks reveal little to nothing of interest... until, a body falls down on a sports car that was on the display in the lobby area. Coincidence, or is there really some truth to these rumors... Conan is taking up to find out the truth and discover the mystery behind this death as well as the rumors that are plaguing the area.</p><p>Main scenario gameplay offers easy and normal difficulty mode (which affect your time limit in solving mysteries) and consists of three main elements:</p><ul><li>presentation - the story advances by presenting the newly obtained element in your investigation which is done during dialogues with characters and grants you bonus points for no mistakes as you present the right answer in as little time as possible (normal, critical and no hit are then displayed on the result screen)</li><li>investigation - with Conan on the screen you can move the character through the rooms and select areas of interest with the round cursor (the hit bar is also displayed here which will give you a penalty upon re-investigating already seen areas)</li><li>reasoning - putting in order events that have transpired so far, the player need to answer Conan's questions based on gathered evidence and investigation</li></ul><p>Aside from the scenario story, the main menu also offers:</p><ul><li>shop - here, one can buy mini-games and album items with earned points from the scenario game</li><li>mini-games - there re five different mini-games, each come with four levels, where player starts from level 1 and net levels become available upon completion of the one you are currently on</li><li>album - various items that can be purchased from the shop with earned points, some of which include background artwork, character info and in-game music and sound effects</li></ul>"},{"name":"Men in Black: The Series","year":2001,"developer":"David A. Palmer Productions","url":"a#M.zip/M%2FMen%20in%20Black%20-%20The%20Series%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Direct control > Sci-fi / futuristic > Licensed","desc":"<p>Evil aliens continue to slip through the system and arrive on Earth. As a Men in Black agent, it's your job to stop them. Armed with advanced weapons and cool gadgets, you will battle an array of aliens.</p><p>Features: * Ability to control J and K with their signature weapons. * An assortment of weapons to freeze, fry and blast the aliens * Tools of the trade including a cloaking device and alien visualization unit to find the aliens, wherever they're hiding * Six thrilling levels to test your skill and speed * Varied settings including a rocket silo, MIB headquarters and an alien laboratory.</p>"},{"name":"Metal Max 2","year":2003,"developer":"Crea-Tech Inc.","url":"a#M.zip/M%2FMetal%20Max%202%20Kai%20%28J%29%20%28V1.1%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Top-down > Turn-based > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>This is a sequel to Metal Max. The game is set in a futuristic world. An evil organization known as the Grapplers terrorizes the world, destroying entire cities if they notice a sign of resistance. The elders of Mado City invited four famous monster hunters to defend the city against the Grapplers. One of the hunters, Maria, brought a friend with her - this friend is you, the hero of the game. But even the hunters can't withstand the Grapplers' assault. Their leader, the giant machine-like Ted Broiler, kills Maria. You are left on your own, and you decide to fight the Grapplers and to become a hunter yourself.</p><p>The game is a Japanese-style RPG with random encounters and turn-based combat viewed from third-person perspective, like in Final Fantasy games. There are two kinds of combat in the game: standard character-to-character combat, and vehicle battles. vehicles can be purchased, equipped, and modified just like the characters themselves. Various vehicles have different special attacks, and there are plenty of items to collect that will upgrade and repair your vehicles. As a hunter, you can also hunt down various giant monsters that populate the world, and kill them for a reward.</p><p>The Game Boy Advance port has a few extra bounties and tanks added.</p>"},{"name":"Metal Slug Advance","year":2004,"developer":"Noise Factory Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Metal%20Slug%20Advance%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter","desc":"<p>You're a warrior of the war, but now you are alone. Enemies have captured your allied troops, and it's up to you to get them back. Armed to the teeth with firearms, grenades and specially made \"Slug\" vehicles, you must travel across the levels and blast anything in sight that isn't a friendly.</p><p>Two characters are offered to play as, and along with the usual Metal Slug flair visually, and epic battle sequences against strange and startling foes, you can now collect special E-cards during the game. Saved allies will hand you these cards that, when brought back to camp, can increase ammo, power and many more improvements to alter the gameplay experience.</p>"},{"name":"Metal Warrior 4: Agents of Metal","year":2006,"developer":"Covert Bitops"},{"name":"Metalgun Slinger","year":2002,"developer":"Open Sesame Inc.","url":"a#M.zip/M%2FMetalgun%20Slinger%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Side view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Metalgun Slinger</em> is a Japan-only 2D platform game for GBA set in an old-western Sci-fi world. The player controls a blue-haired boy who finds a special gun. The game is similar to Mega Man or Contra - run right, jump on platforms, avoid obstacles like holes and spikes and shoot enemies. The player can slide into enemies, run and shoot simultaneously, but cannot shoot at an angle and run simultaneously. Sometimes the player ride on bikes (but hero's friend drive, hero just kills enemies) or must fight against bosses - like gren-skinned mutant with Mohawk hairstyle. The hero's weapon, a special revolver, can be upgraded.</p>"},{"name":"Metroid","year":2004,"developer":"Nintendo Co., Ltd.","url":"7#Metroid%20%28USA%2C%20Europe%29.gba","filesize":4194304,"score":7.7,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Shooter > Sci-fi / futuristic","desc":"<p>In the future, the Galactic Federation and the pirates of planet Zebes are at war. Pirates have stolen an unknown life-form, recently discovered on the planet SR388. The life-form, designated \"Metroid\", is in a state of suspended animation and, according to analysis, was the cause of the complete destruction of SR388. If the Metroid ever got loose, the alien could destroy countless other systems. It is up to the space bounty hunter Samus Aran to land on Zebes and find her way through the perilous terrains of Brinstar and Norfair, destroy the Pirates, as well as their alien enforcers, Ridley and Kraid, and rid the planet of the alien life form before the pirates complete their plans of world destruction.</p><p>Using the cybernetic enhancements of her Power Suit, Samus can use a range of weapons and defenses to destroy the enemy. She can also absorb enemies powers into her Power Suit to increase her defense and chance of survival. Using her weapons and special abilities, she must find her way to the central chamber of Tourian and destroy the Mother Brain, the mysterious leader behind the Space Pirates.</p>"},{"name":"Metroid Fusion","year":2002,"developer":"Nintendo R&D1","url":"7#Metroid%20Fusion%20%28Europe%29%20%5BEn%2CDe%2CFr%2CIt%2CEs%5D.gba","filesize":8388608,"score":8.4,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Sci-fi / futuristic","desc":"<p><em>Metroid Fusion</em> is the direct sequel to 1994's Super Metroid. The game begins as Samus Aran is sent back to planet SR388 to assist a Biologic Space Labs investigation team. While on the planet's surface, Samus is infected by a previously unknown parasite, known as X. The X parasite nearly kills Samus, but fortunately she is saved by a vaccine made from the Metroid she saved on Zebes. Shortly thereafter, an explosion rocks the Biologic Space Labs. Now Samus must investigate the Space Labs, which are orbiting SR388.</p><p>This game is similar, in terms of gameplay and structure, to the classic side-scrolling Metroid games. The game consists of a large inter-connected environment. As Samus learns a variety of new moves and weapons, she is able to explore new areas of the Space Lab and unlock the secrets of the X parasite.</p>"},{"name":"Metroid: Zero Mission","year":2004,"developer":"Nintendo R&D1","url":"7#Metroid%3B%20Zero%20Mission%20%28USA%29.gba","filesize":8388608,"score":8.5,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Sci-fi / futuristic","desc":"<p>Pirates have stolen an unknown life-form, recently discovered on the planet SR388. The life-form, called Metroid, is in a state of suspended animation and, according to analysis, was the cause of the complete destruction of SR388. If it ever got loose, the alien could destroy countless other systems.</p><p>The pirates have taken the being to the planet Zebes and are fending off the Galactic Federation's attacks. It is up to the space bounty hunter Samus Aran to find her way into the planet's core, destroy the pirates, and take back the alien before the pirates complete their plans of world destruction.</p><p><em>Zero Mission</em> takes Samus back to her first battle with Mother Brain, expanding on the original story line and action from the original Nintendo classic, <em>Metroid</em>, with updated visuals, new puzzles to solve, and cut scenes filling in the personal story of Samus.</p><p>The player can perform moves taken from the original game, along with additions taken from the last GBA mission, <em>Metroid Fusion</em>, including the power grab. This game can also be linked to <em>Metroid Fusion</em> to unlock special extras.</p>"},{"name":"Micro Machines","year":2003,"developer":"Infinite Dreams Inc.","url":"a#M.zip/M%2FMicro%20Machines%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Racing / Driving > Top-down > Arcade > Direct control > Off-roading > Track racing > Vehicular combat > Licensed","desc":"<p><em>Micro Machines</em> is a top-down arcade racing game where the player controls miniature toy vehicles.</p><p>There are 2 main single-player modes to race in: Quick Race, Championship. Quick Race has 4 sub-modes: Race, Micro Machines, Time Trial, Bombtag. Championship consists of Bronze, Silver, Gold, Platinum cups and has 3 sub-modes: Race, Micro Machines, Time Trial. It is possible to select up to 3 computer opponents to compete with.</p><p>The world has 8 locations and 16 different tracks with a big variety of power-ups lying around. The player can choose from 8 characters with their own set of vehicles (there are 40 of them in total and they are divided into 5 classes: 4x4, Bike, Boat, Default, Sport).</p><p>An up to 4 players multi-player mode is also available in the game.</p>"},{"name":"Midnight Club: Street Racing","year":2001,"developer":"Rebellion Developments Ltd.","url":"a#M.zip/M%2FMidnight%20Club%20-%20Street%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":5.4,"genres":"Racing / Driving > Top-down > Automobile > Street racing","desc":"<p>The PS2 underground street racer Midnight Club received an adaptation for the Game Boy Advance that takes the general gameplay concept, simplifies it and moves it to an overhead 2D view.</p><p>The game's main Career Mode puts the player in a taxi onto the streets of New York City (and in the second part of the game, London), with the goal of entering the street racing scene and becoming the best of the best. This is done by challenging other racers - winning against them unlocks their car for playing. All in all, there are 42 cars in the game, differing in top speed, acceleration, handling, durability as well as the number of nitros available. Most are won in races, others can be unlocked in ways that are less obvious.</p><p>There are two types of race: waypoint races are entered by spotting a so called \"hook man\" on the streets and following them around until a symbol on their head turns from red to yellow to green. The waypoint race itself is against the hook man and several of his gang, and consists of a number of waypoints that must be hit in order to finish. A green arrow displays the nearest waypoint, which is not neccesarily the next in line, though. The second type of race is head-to-head. These are triggered by calling the opponent on their cell phone, challenging them to a one-on-one. Progress in career mode is saved via passwords awarded after a won race.</p><p>Arcade mode allows players to replay content unlocked in Career mode. The two cities can be freely explored in Joyride mode (with amount of traffic adjustable), and all Career waypoint and head-to-head races can be relived as well.</p>"},{"name":"Midway's Greatest Arcade Hits","year":2001,"developer":"Pocket Studios","url":"a#M.zip/M%2FMidway%27s%20Greatest%20Arcade%20Hits%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Action > Compilation > Side view > Puzzle elements > Shooter > Sci-fi / futuristic","desc":"<p><em>Midway's Greatest Arcade Hits</em> is a collection of classic arcade titles:</p><ul><li>Joust</li><li>Defender</li><li>Robotron 2084</li><li>Sinistar</li></ul>"},{"name":"Mighty Tyranitar","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Millipede / Super Breakout / Lunar Lander","year":2005,"developer":"Gravity-i Ltd","url":"a#M.zip/M%2FMillipede%2C%20Super%20Breakout%2C%20Lunar%20Lander%20%28E%29%20%28M5%29%20%5Bb%5D.gba","filesize":1,"score":"","genres":"Action > Compilation > Arcade","desc":"<p>A compilation of the classic arcade games Millipede, Super Breakout, and Lunar Lander brought to the Game Boy Advance.</p>"},{"name":"Minority Report: Everybody Runs","year":2002,"developer":"Torus Games Pty. Ltd.","url":"a#M.zip/M%2FMinority%20Report%20-%20Everybody%20Runs%20%28U%29.gba","filesize":1,"score":6,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Minority Report</em> on the Game Boy Advance is based on the 2002 Spielberg/Cruise film. In the near future, murders have become rare. The Precrime division of the police, employing future visions of mutated humans called Precogs, can predict when and where a homicide will take place, and arrest the perpetrator before the crime is committed. Precrime officer John Anderton is one of the best at his job, but finds himself on the run when the Precogs predict him murdering a man he doesn't even know. The game follows the film only in its most basic aspects, with almost no characters from the film except Anderton himself appearing, and the storyline moving along an entirely different path. Comic-style images illustrate the story between levels.</p><p>The player controls Anderton through ten side-scrolling levels displayed in a pseudo-3D view. The first few involve him trying to arrest criminals, later ones find him hunted by his own colleagues. In both cases, he must shoot down hordes of enemies (with non-lethal weapons) to progress toward a boss enemy. Shooting involves cycling through available targets via the shoulder buttons, taking care not to target any innocent civilians - hitting them costs one life. Anderton can take cover by dashing into obstacles, enabling him to pick off his targets from relative safety. Six different weapons become available during the game - from a simple pistol with unlimited ammo to more advanced automatic weapons and grenade launchers. There are also hand grenades and, if all else fails, melee attacks. Health and ammo refills as well as bonus lives are available as pickups.</p>"},{"name":"Mission Impossible: Operation Surma","year":2003,"developer":"M4 Ltd.","url":"7#Mission%3B%20Impossible%20-%20Operation%20Surma%20%28USA%29%20%5BEn%2CFr%2CEs%5D.gba","filesize":4194304,"score":5,"genres":"Action > Diagonal-down > Spy / espionage","desc":"<p>Take on the role of Ethan Hunt, as you accept your mission.  Surma Corporation is attempting world domination and it is up to you to stop them.</p><p>Your game revolves around moving through levels and acquiring various gadgets.  Use these gadgets and other IMF gear to get through each level.  Jam signals from security cameras, disguise yourself, shoot or disable the enemy guards... do whatever you need to in order to stop Surma.</p>"},{"name":"MLB SlugFest 20-04","year":2003,"developer":"Handheld Games LLC"},{"name":"Mobile Suit Gundam Seed: Battle Assault","year":2004,"developer":"Natsume Co., Ltd.","url":"7#Mobile%20Suit%20Gundam%20Seed%3B%20Battle%20Assault%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Action > Side view > Fighting > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p><em>Mobile Suit Gundam Seed: Battle Assault</em> pits eight (plus four unlockable) Alliance and ZAFT pilots against each other in armored combat in the Bloody Valentine War. Each Gundam's attacks are split between physical close range attacks and long range beam/gun attacks. Gundams can boost to quickly move on the ground or change directions in mid-air, as well as enter Berserk mode that trades reduced armor for increased attack power as well as unlocking their Ultimate Attack. Before the game starts the player can reduce their boosting ability to increase their Gundam's armor or HP.</p><p>Game modes include a simple story mode, training, time attack, survival, free battle, and 2-player versus.</p>"},{"name":"Mobile Suit Z Gundam: Hot Scramble","year":2004,"developer":"GAME STUDIO Inc."},{"name":"Moero!! Jaleco Collection","year":2004,"developer":"","url":"a#M.zip/M%2FMoero%20Jaleco%20Collection%20%28J%29.gba","filesize":1,"score":"","genres":"Compilation > Sports","desc":"<p>This compilation contains six Jaleco NES sports games:</p><ul><li>Bases Loaded</li><li>Bases Loaded II: Second Season</li><li>Goal!</li><li>Hoops</li><li>Moero!! Judo Warriors</li><li>Racket Attack</li></ul>"},{"name":"Monopoly","year":2004,"developer":"Full Fat Productions Ltd.","url":"a#M.zip/M%2FMonopoly%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Strategy > 3rd-person (Other) > Board game > Licensed","desc":"<p>Monopoly is a GBA conversion of the classic board game of the same name. The game can be played with a computer player or another player. The game has 4 different modes to choose from including timed mode, custom mode, timed limit mode (playing the game with a time limit), and standard mode.</p>"},{"name":"Monster Force","year":2002,"developer":"Digital Eclipse Software, Inc.","url":"a#M.zip/M%2FMonster%20Force%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.1,"genres":"Action > Isometric > Shooter > Licensed","desc":"<p>This baby's an isometric shooter, in the vein of Zombies Ate My Neighbors. In short - run around, hit switches, shoot bad guys and try to not die. Timed challenges, GBA multiplayer, and bosses liven things up. Created as a tie-in for Universal's update to their movie monsters - superdeformed Dracula, Frankenstein, Mummy, and Wolf Boy star.</p>"},{"name":"Monster Guardians","year":2001,"developer":"Konami JPN","url":"a#M.zip/M%2FMonster%20Guardians%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Strategy > Isometric > Real-time","desc":"<p><em>Monster Guardians</em> is a strategy role-playing game. The player controls a team of monsters, and fights against enemy teams. Collected monsters can be merged to create the strongest monster team of them all.The battles are in real time, but with pause the player's character (boy or girl) can stop the game and give orders to monster from outside the battlefield.</p>"},{"name":"Monster House","year":2006,"developer":"Artificial Mind & Movement","url":"a#M.zip/M%2FMonster%20House%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.gba","filesize":1,"score":6.9,"genres":"Action > Diagonal-down > Puzzle elements > Shooter > Horror > Licensed","desc":"<p>Old man Nebbercracker's house has come alive and threatens to eat anything that comes close to it, With Halloween fast approaching, the unaware neighborhood children are in danger of being made into a snack for the possessed house. However three of the neighborhood children, DJ, Jenny, and Chowder, are aware of the malevolent house and plan on putting a stop to it before it's to late.</p><p>In <em>Monster House</em>, players explore the innards of this haunted house, which is made up of several floors, including having a basement, attic, furnace, and a roof which will all be visited on the players march to defeat the house. Since the house doesn't want to risk flooding itself, it won't attack in the bathroom area and these are made into save points for the player. </p><p>The player takes on the role of the three children, with the children being able to be swapped in and out with one another. Each child has their own health meter and different skills with the water blaster their equipped with. They also have their own unique abilities, such as Jenny being able to crawl through small spaces, DJ being able to climb ladders, and Chowder being able to move heavy objects. Aside from finding keys to open locked doors, players can smash objects like vases to find restorative health items like candies and water droplets to refill their water blaster's tanks. The children can also use items like flashlights to see in dark rooms and camera flash cubes which will stun enemies when used. They can also use a Walkie-Talkie to contact their friend Skull, who helps give them directions on what to do next.</p><p>One of the house's rooms contains an arcade cabinet that contains the mini-game <em>Thou Art Dead</em>, in which the player controls an ax wielding man in a side-scrolling action game.</p>"},{"name":"Monster Jam: Maximum Destruction","year":2002,"developer":"Unique Development Studios AB","url":"a#M.zip/M%2FMonster%20Jam%20-%20Maximum%20Destruction%20%28E%29.gba","filesize":1,"score":5.8,"genres":"Racing / Driving > Isometric","desc":"<p>Drive some of the world's most famous monster trucks with a brutal arsenal of weapons. You can also go head-to-head in savage vehicular combat. </p><p>Several different playmodes available including destruction, trickstyle and freestyle.</p>"},{"name":"Monster Rancher Advance","year":2001,"developer":"Tecmo, Ltd.","url":"a#M.zip/M%2FMonster%20Rancher%20Advanced%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":7.4,"genres":"Simulation > 1st-person > Anime / Manga > Fighting > Managerial / business simulation","desc":"<p><em>Monster Rancher Advance</em> is a monster-raising simulation that allows players to raise and customize 440 monster types. These monsters can then be tested in in-game tournaments, or made battle against other players's ones in two-player mode (by the GBA link cable). </p><p>Monsters are created in the game's shrine through the entry of letters, numbers and punctuation symbols. Players begin with the ability to enter up to 4 characters to make monsters, and can unlock the ability to use up to 8 characters through gaining higher trainer ranks. Different words or combinations of characters can not only make different types of monsters, but also each monster can have varying attributes and characteristics, making each one unique.</p><p>Players then train the monsters by choosing which foods to feed them with, which drills to do to raise attributes, what training to send them to for learning new attacks, and what items to give them. The game starts with a modest amount of money with which food and items can be purchased; more money is earned in tournaments. Gameplay revolves around planning training sessions, adding new attacks and juggling the bank account, along with attempting to win tournaments. As monsters age, they can be added to a coaching staff to help raise new monsters to better attributes, or they can be combined with other monsters to make stronger babies. Monsters do not die in this game, however they do face an enforced retirement age.</p><p>There is a storyline, where some characters from older Monster Rancher games are back, and new characters are introduced. The gameplay itself, like most other <em>Monster Rancher</em> games, is open-ended.</p><p>The two-player mode, requiring the link cable and two copies of the game, allows players to test the monsters they have raised against each other. It also allows players to trade items and cash money, to wager items or cash on tournaments, and trade raised monsters bringing them into each others' game files.</p>"},{"name":"Monster Rancher Advance 2","year":2002,"developer":"Graphic Research Co., Ltd.","url":"a#M.zip/M%2FMonster%20Rancher%20Advanced%202%20%28U%29.gba","filesize":1,"score":"","genres":"Simulation > 1st-person > Anime / Manga > Fighting > Managerial / business simulation","desc":"<p>Monster Rancher Advance 2 is a monster raising sim where players can raise, battle, explore with any of 512 monsters. While it is the second Monster Rancher game on the Game Boy Advance system, it is not a true sequel, and does not require any knowledge of any other ranching games to play.</p><p>Players make monsters by entering letters, numbers, and punctuation characters into the in-game shrine. At the start, players have access to up to 4 spaces to enter words or characters. As they improve their rank as a trainer, they can access more spaces, up to a maximum of 8. Players may also bring monsters into the game from their Monster Rancher Advance game, or trade monsters with other Monster Rancher Advance 2 players through use of a second GBA and a link cable.</p><p>Players then raise their monster, deciding what foods to feed them, what drills to teach attributes at, what items to give them, what attacks to add in training, and which characteristics to add or remove at the Hospital. Monsters may become hurt or ill, and can be treated for a fee at the Hospital which also offers free checkups. Players start with a modest sum of money, and earn more by winning in-game tournaments, or by finding valuable items to sell on expeditions. </p><p>The storyline is one of the longest and most complex of any Monster Rancher game. Unlocking various types of monsters involves participating in a variety of events including storyline quests on expeditions, and battling in various tournaments. Players will see characters from older Monster Rancher games, and be introduced to new characters. Monsters now develop bonds with each other and can become friends with monsters within the game, and with monsters in other player's games via link cable use. Completing the storyline requires over 200 hours of gameplay.</p><p>Monsters do not die in this game, but they do face an enforced retirement age. When retired, they can coach other monsters to improve drills, and be used in combining to make stronger baby monsters with more attacks and better characteristics.</p><p>This game has several improvements over the previous Game Boy Advance game including: a counter system added to battles, RPG style expeditions, a monster buddy system, a more complex coaching for pay system, super coaches, the ability to add or remove characteristics, diseases, tag team battles, more hidden monsters, and a new breed of monster.</p><p>In 2 Player mode, monsters can battle against other player's monsters via the GBA link cable. Single monsters can face off against each other, or players can set up tag team battles.</p>"},{"name":"Monster Truck Madness","year":2003,"developer":"Tantalus Interactive Pty. Ltd.","url":"a#M.zip/M%2FMonster%20Truck%20Madness%20%28U%29.gba","filesize":1,"score":7.1,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Off-roading > Licensed","desc":"<p>Take to the mud in Monster Trucks such as Gravedigger and Carolina Crusher.   Three game modes, ten tracks and thirty events await.  Destructible objects means you can run down anything that gets in your way.  However, real time vehicle deformation means your Monster Truck may end up off second best!</p>"},{"name":"Monster! Bass Fishing","year":2002,"developer":"Ignition Entertainment Ltd.","url":"a#M.zip/M%2FMonster%20Bass%20Fishing%20%28E%29.gba","filesize":1,"score":"","genres":"Sports > Side view > Fishing","desc":"<p>Although the name implies you're going to catch monsters, <em>Monster! Bass Fishing</em> is a normal fishing game where you can catch a variety of fish including various bass, northern pike, catfish, and more. The \"monster\" part is that you get bonus points for catching monster-sized fish.</p><p>The game is played in one of two modes, Challenge or Free Fish. In Free Fish, you can fish in any location that is unlocked for as long as you like. In Challenge, you are competing in a tournament and will have a time limit and a specific location to fish at.</p><p>When you start at a location in either mode, you have the option to move your boat to any place on the map. However, this does take time and may not always be in your best interest in the Challenge mode. You can then either start casting, or you can change your lure first.</p><p>Catching fish is really just a matter of using a good lure and tempting movements. When a fish strikes, you need to keep enough pressure on the line to keep the hook set, or the fish will get away. If you let the line get too tight, the line will break and you'll lose the fish then as well. Now just reel it in and see what you caught.</p><p>The GUI shows a nice fish finder that is color-coded by the type of fish that is seen. Note that this finder is not always accurate.</p><p>Statistics for the game are very nice. You can see a nice picture of your fish that you catch along with the size of it. The top 6 can then be saved in the Aquarium for viewing at any time. Your tournament scores will be based on weight of fish and any monster bonuses (bonuses for catching one of the top 3 largest fish that round). Winning the tournaments will unlock new locations and let you progress to a new location for the next tournament. It will also get you a nice trophy.</p>"},{"name":"Moorhen 3 ...Chicken Chase","year":2002,"developer":"Phenomedia AG"},{"name":"Morning Adventure, The: Mananitos Bollycao","year":2003,"developer":"Bit Managers S.L."},{"name":"Mortal Kombat: Deadly Alliance","year":2002,"developer":"Midway Games, Inc.","url":"a#M.zip/M%2FMortal%20Kombat%20-%20Deadly%20Alliance%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.5,"genres":"Action > 3rd-person (Other) > Fighting","desc":"<p><em>Mortal Kombat: Deadly Alliance</em> on the Game Boy Advance adapts the console game of the same name to the portable platform, presenting a subset of characters, arenas and modes, with simplified controls and graphics in line with the handheld's capabilities.</p><p>The game includes 12 characters (down from 23 in the console version) and 13 arenas (down from 17). 7 Fighters and 9 arenas are selectable from the start, the rest have to be unlocked. The unlocking works through the acquisition of \"koins\" (of which there is only one type compared to the six of the console version) that are earned in the game's various modes. The koins can then be spent in the \"Krypt\", unlocking \"koffins\" that reveal characters, arenas, several alternate costumes for each character, and some other surprises. 120 different koffins are available.</p><p>The game's modes include Arcade (a series of consecutive fights against all other characters in the game), Survival (subsequent fights with only a small amount of health restored after each bout) and Link Mode (one-on-one fights via link cable, with players being able to wager their koins). The same two mini-games as in the console version are also included: Test Your Might (the classic button-smasher to break an object) and Test Your Sight (a variation of the shell game: picking out which shell a symbol is under after the shells are shuffled quickly).</p><p>Fights are displayed in a pseudo-3D view, simulated through a scaled and rotated textured floor with 2D backgrounds and the fighters animated in 2D. Fighting takes place on a 2D plane, but side-stepping with the camera then rotating to keep up is possible. Controls are less complex than in the console version: only two attack buttons remain out of the original five: one usually used for kicks, one for punches. The right shoulder button blocks, while the left shoulder button switches between two different fighting styles for each character, each with its unique moves and combos. The third weapon stance from the console version is gone, being replaced instead by special weapon moves for most characters. Fatalities, a Mortal Kombat series trademark, are of course also featured. Exclusive to the GBA version is the inclusion of the morphing ability of series mainstay baddie Shang Tsung, allowing him to take the form of other characters.</p>"},{"name":"Mortal Kombat: Tournament Edition","year":2003,"developer":"Midway Games, Inc.","url":"a#M.zip/M%2FMortal%20Kombat%20-%20Tournament%20Edition%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.5,"genres":"Action > Arcade > Fighting > Martial arts","desc":"<p>This semi-sequel to Mortal Kombat: Deadly Alliance brings together a handful of the previous characters with a host of new and well-known faces making their debut on the GBA, including Bo Rai Cho, Johnny Cage, Raiden, Sareena, Nitara, Cyrax, Mavado, Reptile, Hsu Hao and Drahmin.</p><p>Game modes include a collection of new multiplayer modes, such as the Race to Raiden, where two players compete against a set of characters, and the first to reach and defeat Raiden wins. Up to 4 players can compete in Tournament mode to see who is the best fighter. </p><p>Plus there's plenty of single player modes including Survival, while you can link <em>Tournament Edition</em> with <em>Deadly Alliance</em> to play some of the multiplayer modes.</p>"},{"name":"Mother 1+2","year":2003,"developer":"HAL Laboratory, Inc.","url":"a#M.zip/M%2FMother%201%2B2%20%28J%29%20%5BT%2BEng0.5_RPGone%5D.gba","filesize":1,"score":"","genres":"Compilation > Role-playing (RPG) > 1st-person > Diagonal-down > Isometric > Anime / Manga > Turn-based","desc":"<p><em>Mother 1+2</em> is a Japanese compilation of the role-playing games Mother and Mother 2 (the latter also known as <em>EarthBound</em> in the United States).</p>"},{"name":"Mother 3","year":2006,"developer":"HAL Laboratory, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mother%203%20%28Japan%29%20%5BT-En%20by%20Chewy%20%26%20Jeffman%20%26%20Tomato%20v1.3%5D.zip","filesize":1,"score":8.3,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Turn-based > Japanese-style RPG (JRPG) > Sci-fi / futuristic","desc":"<p>The Nowhere Islands are an idyllic place; the residents of Tazmily Village live peacefully and in harmony with nature and with each other. But this changes when the mysterious Pigmask Army arrives and proceeds to destroy and corrupt, with force and sly persuasion alike. The main character is Lucas, a young boy who must find out who wants to destroy the tranquility of Nowhere Islands and turn them into a high-tech nightmare. </p><p><em>Mother 3</em> is a top-down role-playing game. The player character (the characters controlled by the player change often) travels around the Nowhere Islands with his party, talking to people and furthering the plot. It is possible to \"dash\", which not only allows to travel faster, but also allows to knock weaker enemies out of the way (or to ram some objects/characters). </p><p>There are many enemies to battle in the game. The battles are turn-based; each turn, a character can attack with his weapon, use a special ability (some characters have powerful psychic abilities, others have different special skills), use an item or try to run away. The battles feature a musical combo system, where tapping a button in rhythm with the background music will cause additional damage to the enemy. The characters have \"rolling HP meters\"; when they are dealt damage, they don't lose all the HP right away, but their HP decreases slowly; this way, even if a character receives massive damage, he can survive with only minor injuries if you manage to end the combat quickly. Winning battles gives the characters experience (and thus makes them stronger) and, later in the game, money (known as \"DP\"), which can be used in shops to buy better equipment or useful objects. </p><p>There are many frogs encountered throughout the game, who serve as save points (and later as ATM machines). If all characters die during a battle, you can come back to life near the latest save point encountered and try again.</p>"},{"name":"Moto Racer Advance","year":2002,"developer":"Delphine Software International","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Motoracer%20Advance%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1,"score":"","genres":"Racing / Driving > Sports > Behind view > Motorcycle","desc":"<p><em>Moto Racer Advance</em> is the first adaptation of the motorcycle racing series for a handheld platform. The core concept is similar to the original games: players race on asphalt or all-terrain tracks. The game offers different game modes: single race, championship, league and progression. The latter is the game's main mode as it offers a path for the three main racing styles: Cross, GP and Traffic. By winning races additional locations, bikes and tricks are unlocked. Each of the three paths can be followed separately, they do not need to be completed in a specific order. A fourth style called Ultimate is unlocked later on in the game.</p><p>Bikes have different statistics based on maximum speed, acceleration, brakes and grip. Some of the available locations include California, England, Kenya, Moscow and San Francisco. GP tracks have a set number of laps and an amount of opponents needs to be passed before reaching the finish line. It puts the focus on using brakes effectively to go through corners in a fluent manner. The off-road terrain tracks in the Cross mode are similar in concept, but demands mastery of powersliding to pass corners. They also have bumps and rougher terrain. The traffic style is a mix with both types of terrain, but introduces AI-controlled traffic that needs to be dodged. Signs above the racer show upcoming corners with a different colour based on the sharpness and they also warn for obstacles. While racing a nitro is available to do a wheelie and gain more speed. It can be depleted, but regenerates over time. The top of the screen holds the time and shows a horizontal bar with the positions of all riders.</p><p>Multiplayer games for up to four racers simultaneously are available through a link cable.</p>"},{"name":"Motocross Challenge","year":2007,"developer":"DHG games"},{"name":"Motocross Maniacs Advance","year":2002,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Motocross%20Maniacs%20Advance%20%28USA%29%20%28En%2CEs%29.zip","filesize":1,"score":6.7,"genres":"Sports > 3rd-person (Other) > Side view > Motorcycle","desc":"<p><em>Motocross Maniacs Advance</em> is a side-scrolling racing game with dirt bikes as the main vehicle of choice. There are four modes of play, Race, Time Attack, Action (stunt tracks for points) and Link Battle (which requires four more cartridges and the link cable to use). There are six different riders to choose from, each with their own different attributes and abilities. Players can also pick up power-ups during races such as heat-seeking missiles and land-mines along with the nitro tanks among others.</p>"},{"name":"MotoGP","year":2002,"developer":"Visual Impact","url":"a#M.zip/M%2FMoto%20GP%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Sports > Behind view > Real-time > Direct control > Motorcycle > Track racing > Licensed","desc":"<p>Jump on, throttle up and roar off for sheer explosive racing power.<br>* MotoGP... now you're on the winning track!<br>* Forget 4 wheels - 2 are faster!<br>* Be part of the purest combination of man, machine, adrenaline and speed.</p>"},{"name":"Mouse Trap / Operation / Simon","year":2005,"developer":"Gravity-i Ltd"},{"name":"Mr. Driller 2","year":2001,"developer":"Namco Limited","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Mr.%20Driller%202%20%28USA%29.zip","filesize":1,"score":6.7,"genres":"Puzzle > Side view > 2D scrolling > Real-time > Falling block puzzle > Platform > Direct control","desc":"<p>You play the game as Susumu or Anna. Equipped with nothing but a pressurized suit and a drill, you need to contact the King of the Undergrounders. To do this, you will need to drill down several thousands of feet avoiding being crushed and remembering to pick up air tanks.This is a real-time puzzle game where you will be continually moving down or sideways in an effort to get to the bottom. As you dig, blocks will fall to fill in the spaces below. Like colored blocks will stick together (giving you time to rest), but will disappear if 4 or more blocks come together. This can cause chain reactions (very common in two-color levels) that become dangerous quickly.Three modes of play: Story, Time Attack, and Endless Driller. Story Mode uses the bare bones story from above. Time Attack gives you a set levels with a specific time limit. Endless Driller allows you to dig for as long as you can.</p>"},{"name":"Mr. Driller Ace: Fushigi na Pacteria","year":2002,"developer":"Namco Limited","url":"a#M.zip/M%2FMr.%20Driller%20A%20-%20Fushigi%20na%20Pacteria%20%28J%29%20%5BT%2BEng15%25_KSIE%5D.gba","filesize":1,"score":"","genres":"Puzzle > Side view > 2D scrolling > Arcade > Falling block puzzle > Direct control","desc":"<p><em>Mr. Driller Ace: Fushigi na Pacteria</em> is a Game Boy Advance game in the Mr. Driller series, only released in Japan. In classic mode, the player must dig down stages by destroying colored formations. when a formation is destroyed, any formations above it will fall down. This will crush the player, so they must move to avoid falling formations. If a formation falls onto another formation of the same color, the two will merge, making a bigger piece. Some blocks can't be broken, forcing the player to work around them. The player's air supply also runs out over time, so the level must be completed before it is completely depleted. Extra oxygen tanks can be collected.</p><p>In the new mode, some changes are made to gameplay. In this mode, the air supply is depleted by 1% when the player destroys a block formation. If the player is crushed, 20% is lost. Items called Dristones can also be found. The effects of Dristones vary. They can change the blocks' colors, destroy them, are refill the player's air supply. There are also new creatured called Pacteria, which are like virtual pets. Items found in the underground can be given to the Pacteria so they can change color and form.</p><p>There is also a race game, where the player chooses a driller and races the others to the bottom of the course.</p>"},{"name":"Mr. Nutz","year":2002,"developer":"","url":"a#M.zip/M%2FMr.%20Nutz%20%28E%29%20%28M5%29%20%5BhI%5D.gba","filesize":1,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>You are the cool squirrel of the title, and you must defeat the evil Yeti before he freezes the entire world. Your quest will make you explore many areas such as a forest, a witch's cottage, a volcano, the clouds, a circus...</p><p><em>Mr. Nutz</em> is a platform game, in which Nutz must jump on enemies to kill them. His tail can also be controlled. You move through levels using ledges, ladders, bridges and platforms. There are some simple puzzles involving object manipulation.</p>"},{"name":"Ms. Pac-Man Maze Madness","year":2004,"developer":"Namco Hometek Inc.","url":"a#M.zip/M%2FMs.%20Pac-Man%20-%20Maze%20Madness%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.3,"genres":"Action > Diagonal-down > Top-down > Puzzle elements","desc":"<p><em>Ms. Pac-Man Maze Madness</em> is a combination of classic Pac-Man (or in this case, Ms. Pac-Man) action, maze exploration and Sokoban-like puzzle elements. Players take on the role of Ms. Pac-Man and have to save Pac-Land once again. Although the game is in full 3D, players can only move along designated paths.</p><p>The four Wonders, mystical regions separated from the rest of Pac-Land by force fields, contains four Gems of Virtue: Generosity, Truth, Wisdom and Courage, each holding enough power to help keep Pac-Land safe from evil. However, an unknown enemy has transformed the Enchanted Castle into a haunted house, in turn starting a chain reaction of evil all around Pac-Land and the four Wonders. It is up to Ms. Pac-Man to enter the 3D designed worlds of the four Wonders and put the evil to rest for good.</p>"},{"name":"Mugenborg","year":2003,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"a#M.zip/M%2FMugenborg%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p><em>Mugenborg</em> is a turn-based RPG with robots fights. The game was released only in Japan. The player controls a young boy, who controls robots. He starts in school and fights against other people and their robots. Battles in the game are held in a special ring. The player commands the robot, like in the Pokémon series. He can also walk around and talk to people.</p>"},{"name":"Mummy, The","year":2002,"developer":"Ubi Soft Studios SRL","url":"a#M.zip/M%2FMummy%2C%20The%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Top-down > 2D scrolling > Puzzle elements > Contemporary > Egypt (Ancient) > Licensed","desc":"<p><em>The Mummy</em> is an 2D action-adventure game for the Game Boy Advance played from a bird-eye perspective that is based on the <em>The Mummy: The Animated Series</em>. The game starts with the O'Connell family traveling to Egypt to investigate strange phenomena happening at a dig near Cairo. There they meet up with Ardeth Bay who suspects Imhotep is behind it. </p><p>In the game, the player can freely switch between all members of the family (Alex, Rick and Evy). Each of the members have their own strengths and weaknesses. Rick is strong, while Evy can read hieroglyphs and Alex can pick locks. As the player explores the underground ruins hostile creatures like scorpions and undead have to be fought. The player also needs to find keys to unlock doors. Coins can be collected and used to revive knocked down members at a Ank circles on the floor.</p><p>For the PlayStation 2 and Windows, a different and fully 3D game was released.</p>"},{"name":"Muppet Pinball Mayhem","year":2002,"developer":"Digital Eclipse Software, Inc.","url":"a#M.zip/M%2FMuppet%20Pinball%20Mayhem%20%28E%29.gba","filesize":1,"score":7.6,"genres":"Action > Top-down > Pinball > Licensed","desc":"<p>Muppet Pinball Mayhem is a pinball game based on the ever-popular Muppet characters. This game features recognizable music and sound effects from the Muppet Show, along with backgrounds based on Muppet characters.</p><p>There are three tables, one for Kermit, one for Miss Piggie, and one for Gonzo. There is also a secret hidden table for an undisclosed character. The hidden table is unlocked in \"Adventure Mode\", where you must get a high score and hit a specific target to progress from one table to the next.</p><p>Each table has a variety of scoring opportunities, including ramps, spinners, and various table games. 4 players can compete in a competion mode, where each player takes a turn trying to get the high score.</p>"},{"name":"Muppets, The: On with the Show","year":2003,"developer":"Vicarious Visions, Inc.","url":"a#M.zip/M%2FMuppets%20-%20On%20With%20The%20Show%21%20%28U%29%20%28M6%29%20%5BhIR%5D.gba","filesize":1,"score":5.8,"genres":"Action > Side view > Puzzle elements > Licensed","desc":"<p>The Muppets, on with the show brings back Jim Hensons Muppets to the GBA. In this game, aimed at kids, the player has to help the Muppets to create a new Muppetshow, and to do so play a total of six activity games where the player controls one of the muppets and needs to perform. The game also has two hidden minigames that can be unlocked. </p><p>The general gameplay differs for each activity the game includes and involves racing, fighting, making music and evasion types of play. Each activity has an explanation screen that describes clearly what has to be done, and after the activity the player's score is expressed with a certain number out of five stars (max). The game can either be played in Story mode (easy/medium/hard) or activity mode where the player can play certain activities freely.</p>"},{"name":"MX 2002 featuring Ricky Carmichael","year":2001,"developer":"Tiertex Design Studios"},{"name":"My Little Pony: Crystal Princess - The Runaway Rainbow","year":2006,"developer":"Webfoot Technologies, Inc.","url":"a#M.zip/M%2FMy%20Little%20Pony%20Crystal%20Princess%20-%20The%20Runaway%20Rainbow%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Strategy > Side view > Licensed","desc":"<p><em>My Little Pony: Crystal Princess - The Runaway Rainbow</em> is a game in the <em>My Little Pony</em> franchise based on the 2006 direct-to-video animated film of the same name. In Rarity's Adventure, the main game mode, Cheerilee teaches the young unicorn pony Rarity in the magical city Unicornia how to make a rainbow. In celebration of the first rainbow of the season. Rarity will become the rainbow princess and she needs to learn how to use her magical wand to create it.</p><p>Rarity can freely move around the city and talk to other pones. She plays mini-games and gets to help them in various ways. She can play with a caterpillar, participate in a bubble fight to clean a carriage, do a game of 'Simon Says' with her wand, collect rainbow ribbons and flags and colour drawings. At the end of the first chapter she accidentally uses the wand in a wrong way and ends up in a new location called Breezie Blossom. Rarity has to perform similar tasks again for her there, such as locating characters, collecting pairs of pajamas, locate hidden breezies in a game of 'Whac-A-Mole' and catch rainbowberries.</p><p>In the third chapter Rarity and the breezies travel to Ponyville while the other ponies at Unicornia decide to look for her. Rarity gets to choose between two playable ponies to help her locate additional rainbowberries after she ate all of them. With different ingredients sundaes need to be recreated as shown through an example in the top left corner of the screen. In another mission various components to create kites need to be gathered and identical kites need to be matched in a game of Concentration. Rarity also gets to skate, avoiding and jumping over objects on a course. It also contains a full pinball table called Pinkie Pie Pinball.</p><p>In the fourth chapter she can create and colour custom drawings. Rarity drops down a river and needs to be picked up along with several other ponies using a vine. Players also have to help her create images in the sky by connecting stars and she gets to ride a flying carriage, avoiding clouds that slow her down, to reach a finish line before time runs out. In the fifth and final chapter the rainbow celebration finally takes place. There are five chapters and fourteen mini-games in total.</p><p>From the main menu the different mini-games can be played right away. During the main Rarity's Adventure mode jewels can be earned by performing well. These unlock items in the Princess Gallery, also available from the main menu.</p>"},{"name":"Mysterious Murasame Castle, The","year":2004,"developer":"Nintendo EAD"}]