[{"name":"Namco Museum","year":2001,"developer":"Mass Media, Inc.","url":"a#N.zip/N%2FNamco%20Museum%20%28E%29.gba","filesize":1,"score":6.8,"genres":"Compilation","desc":"<p>This collection of classic arcade titles includes:</p><ul><li>Dig Dug</li><li>Galaga</li><li>Galaxian</li><li>Ms. Pac-Man (both scrolling and full screen)</li><li>Pole Position</li></ul><p>For certain games the settings can be tweaked.</p>"},{"name":"Namco Museum: 50th Anniversary","year":2005,"developer":"Namco Limited","url":"a#N.zip/N%2FNamco%20Museum%20-%2050th%20Anniversary%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.3,"genres":"Compilation","desc":"<p>Namco is honoring its 50th anniversary by releasing this compilation of arcade classics. Using a retro interface, you check out a virtual arcade hall where you can select each classic in its original arcade cabinet.</p><p>The 5 games included are:</p><ul><li>Pac-Man</li><li>Ms. Pac-Man</li><li>Galaga</li><li>Dig Dug</li><li>Bosconian</li></ul>"},{"name":"Nancy Drew: Message in a Haunted Mansion","year":2001,"developer":"Her Interactive, Inc.","url":"a#N.zip/N%2FNancy%20Drew%20-%20Message%20in%20a%20Haunted%20Mansion%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":7.5,"genres":"Adventure > 1st-person > Puzzle elements > Detective / mystery > Licensed","desc":"<p>In this third game starring Nancy Drew, the famous teen detective has to solve a mystery in a Victorian mansion in San Francisco. The villa seems to be inhabited by ghosts... but this is not all. Somewhere in this strange house lies a treasure. That's why she's not the only one interested in this mansion. Could it be the antique dealer, the handy-man, the retired teacher, the owner of the estate or someone else? Everyone has something to hide and Nancy must find out who is behind the strange happenings going on.</p><p>The game is a standard point-and-click adventure game that includes two difficulty choices (Junior and Senior Detective) and a <em>Second Chance</em> is offered to players who make a fatal mistake. There are a large number of puzzles to be solved, some of which are slightly different depending upon the difficulty level chosen. Setting the time of day in Nancy's bedroom is necessary for certain events to occur or the availability of some in-game characters.</p><p>Compared to the previous <em>Nancy Drew</em> games, <em>Message In The Haunted Mansion</em> underwent big changes in design. It is 360 degree with full motion freedom.</p>"},{"name":"Napoleon","year":2001,"developer":"Genki Co., Ltd.","url":"a#N.zip/N%2FNapoleon%20-%20L%27Aigle%20de%20Guerrre%20%28F%29%20%5BT%2BEng0.50_Nebelwurfer%5D.gba","filesize":1,"score":"","genres":"Strategy > Top-down > Real-time > Fantasy > Historical events","desc":"<p><em>Napoleon</em> is a real-time strategy game set in the late 18th century that adds many fantasy elements to historical events. The famous French leader Napoleon Bonaparte is the main hero and commander. Napoleon manages a small army, composed of three types of units - infantry, artillery and cavalry. His task is to take over the opponent's stronghold. The commander is present on the battlefield; while he can't fight, he can heal units.</p>"},{"name":"Naruto Konoha Senki","year":2003,"developer":"","url":"a#N.zip/N%2FNaruto%20-%20Konoha%20Senki%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga","desc":"<p>This game is a strategy/RPG game based on the popular manga/anime Naruto. With the use of ninja tools such as shuriken and kunai, and ninjutsu such as Naruto's Kage Bunshin (Doppelganger) or Sasuke's flame techniques. Fighting random no-name ninjas as well as plot enemies taken directly from the manga, you fight your way through three scenarios filled with many different missions, spanning the initial training of Kakashi's Team 7 up until the end of the Chuunin test.</p>"},{"name":"Naruto: Ninja Council","year":2003,"developer":"Arc System Works Co., Ltd.","url":"a#N.zip/N%2FNaruto%20-%20Ninja%20Council%20%28U%29.gba","filesize":1,"score":6.3,"genres":"Action > Side view > Anime / Manga > Fighting > Licensed","desc":"<p><em>Naruto: Ninja Council</em> is another game that was taken from a famous Japanese anime series and is also the first installment of the Ninja Council series. </p><p>It's a side scrolling, action oriented game with two modes to choose - Story mode and Free mode - and two playable characters. The story of Ninja Council starts from the survival exam and ends with Orochimaru’s attack at the Hidden Konoha Village. Apart from that there are no actual events between that - that take place on the anime although there are fights with certain characters that do like the fight with Haku and Orochimaru.</p><p>The characters that are available are Naruto and Sasuke. When you start a new game at the beginning of each stage Kakashi sensei appears to give you hints about the controls and other useful staff like a boss’ weak point or attack patterns. There are also hidden characters you can find who can restore your health when you run out of life. Stages have a time limit of 5 minutes to complete. At the end of each stage there is a boss fight and the timer resets at 5 minutes in which you have to win the battle in order to advance the game and be able to save your progress.</p><p>The two available characters - Naruto and Sasuke - can both use the same combo hits and weapons that can be picked up in each stage like shuriken and kunai. Every second stage the player will also find scrolls that contain elemental power ups like the Lightning Style Scroll that can be used either for attacking opponents or for progressing in the game. Apart from that each one has a set of three unique special attacks that can be used but only if you have sufficient amount of chakra.</p>"},{"name":"Naruto: Ninja Council 2","year":2004,"developer":"Aspect Co., Ltd.","url":"a#N.zip/N%2FNaruto%20-%20Ninja%20Council%202%20%28U%29.gba","filesize":1,"score":6,"genres":"Action > Side view > Anime / Manga > Fighting > Licensed","desc":"<p>This is the second Naruto title for the <em>Ninja Council</em> series and follows the adventures of Naruto, Sasuke and Sakura as they try to pass the Chunin Exam in a total of seven stages.</p><p>Unlike the first title you can now control three characters by changing them anytime you want inside the game. Each one has unique sequences of punches and kicks and can use 3 special techniques with varying results from one character to another. The shuriken, kunai and fuma from the first game are still here although this time one hit is enough to dispatch an enemy. Along the stages you can also find summoning scrolls and use them in fights to call Kakashi, Choji and others to attack the enemies. Another addition to the gameplay is the Teleport move which as the name implies allows you to teleport near or behind an enemy to attack him or simply dodge his attacks. At parts of each stage you may be given certain objectives such as to defeat all the enemies or finish the stage within a time limit and parameters like the use of only one character. At the end of each stage you get a grade depending on how many enemies you killed, how fast you finished the stage, how many characters you are left and how many leaves you have collected. At the end of the game these grades will be accumulated to decide your final rank.</p><p>The game also features two additional modes – the Co-op Mode and the Vs. Mode but you need the link cable for that.</p>"},{"name":"NASCAR Heat 2002","year":2002,"developer":"Crawfish Interactive Ltd.","url":"a#N.zip/N%2FNASCAR%20Heat%202002%20%28U%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Diagonal-down > 2D scrolling > Real-time > Direct control > Automobile > Track racing > Licensed","desc":"<p>Race against today's top NASCAR® drivers on the hottest tracks for a thrill-a-minute racing experience. With 6 different modes of high-speed action, NASCAR® Heat™ 2002 delivers pedal-to-the-metal, door-to-door racing excitement! * 6 ways to race: Career, Single Race, Beat the Heat, Time Trial, Arcade or Multiplayer Multiplayer options for 2 to 4 players using 1 to 4 Game Paks * 16 Beat the Heat* challenges designed by top NASCAR® drivers * 12 racetracks, including Phoenix International Raceway® * 24-car field</p>"},{"name":"NBA Jam 2002","year":2002,"developer":"DC Studios, Inc.","url":"a#N.zip/N%2FNBA%20Jam%202002%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Sports > Side view > 2D scrolling > Real-time > Direct control > Basketball > Licensed","desc":"<p>STEP UP AND JAM!!!</p><p>Lace 'em up and get your game on with the hottest superstars the NBA has to offer.</p><p>* Unlock secret teams like the NBA Rookie Team and the All NBA Team!<br>* 2-on-2 arcade action with all-new modes of gameplay including HORSE.<br>* 6 modes of play: Season, Playoffs, Quick Game, Jam, Practice and Horse.</p>"},{"name":"Need for Speed: Carbon - Own the City","year":2006,"developer":"Pocketeers","url":"a#N.zip/N%2FNeed%20for%20Speed%20-%20Carbon%20-%20Own%20the%20City%20%28U%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Real-time > Direct control > Automobile > Licensed","desc":"<p>YOUR CREW, YOUR CITY<br>* BE THE PREDATOR, NOT THE PREY IN ALL-NEW HUNTER MODE<br>* RACE FOR CONTROL OF THE CITY - ONE NEIGHBORHOOD AT A TIME<br>* BURN UP 12 CIRCUIT TRACKS WITH 15 LICENSED CARS<br>* BRING ALONG AND CONTROL WINGMEN TO HELP WIN RACES</p>"},{"name":"Need for Speed: Most Wanted","year":2005,"developer":"Pocketeers","url":"a#N.zip/N%2FNeed%20for%20Speed%20-%20Most%20Wanted%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Real-time > Direct control > Automobile > Licensed","desc":"<p>* Master the art of cop evasion in Barricade Runner and other new race modes.<br>* Modify your ride to beat any tuner, muscle, or exotic.<br>* Customize the look of your car to elude police pursuit.<br>* Win races, climb the Blacklist, become the Most Wanted</p>"},{"name":"Need for Speed: Porsche Unleashed","year":2004,"developer":"Pocketeers","url":"a#N.zip/N%2FNeed%20for%20Speed%20-%20Porsche%20Unleashed%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.5,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Years after versions for PC and console, Electronic Arts' racing game licensed from German sports car manufacturer Porsche AG received an adaptation for the Game Boy Advance, with much simplified options and modes, and graphics and tracks adapted to the capabilities of the handheld platform.</p><p>The game's main mode is Evolution mode. As in the PC and console versions, this mode takes players through the history of Porsche cars from the 1950's 356 to the 1990's GT1, but without any of the economy or customization options. All in all, there are 25 different models available to drive. Evolution mode consists of 15 events, which have to be won in order. Earlier events are single races, later ones include multiple races in a tournament. All are races against 4 opponents, with winning necessary to go to the next event. Each new event unlocks new cars that can also be used in the game's other modes. These include a single player mode that offers quick races as well as knockout (last car after a race is removed) and quick knockout (last car after a lap is removed) races. A multiplayer mode offers races for up to four players via link cable.</p><p>The game includes five different tracks, each with forward and reverse directions and dry, rain and snow weather options. The graphics engine is the same as used in developer Pocketeers earlier NFS Underground, with cars and tracks modeled in texture-mapped 3D. 1st-person cockpit and 3rd-person behind-the-car views are available. Actual racing has a heavy arcade focus, with braking to get around corners rarely necessary since bumping into the road usually only deducts a few kph from the current speed.</p>"},{"name":"Need for Speed: Underground","year":2003,"developer":"Pocketeers","url":"a#N.zip/N%2FNeed%20for%20Speed%20-%20Underground%20%28UE%29%20%28M4%29.gba","filesize":1,"score":6.8,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p><em>Need for Speed Underground</em> for the Game Boy Advance takes the street racing concept of the console/PC title and adapts it for the capabilities of the handheld platform.</p><p>The game's main mode is Underground Mode, in which the player's goal is to make it to the top of the street racing scene from humble beginnings. Starting with 10.000 credits and a choice of 3 cars, races must be won to win money and unlock further cars and upgrade parts to make them available for purchase. In each night of racing, the player must challenge one of the other racers that is slightly above them in the rankings. The race track and parameters are then randomly chosen and winning the race advances the player's ranking. Once other racers are behind in ranking, they can also challenge the player. In that case, the player gets to choose track, number of laps and number of opponents. The game begins in the preliminary rankings, in which there are only standard circuit races. Once the number one position has been reached, the championship rankings open up and there is a different ladder for each of the four racing types: </p><ul><li>Circuit (six tracks): The goal is to complete a set number of laps before the opponents. There will be passing traffic at intersections which must be avoided.</li><li>Sprint (six tracks): Shorter than circuit races, the goal is to reach a set point on the track the fastest. </li><li>Drag (four tracks): The very short tracks are completely straight, but manual transmission is mandatory, requiring precise shifting to avoid engine burnout or losing speed.</li><li>Drift (eight tracks): Points are awarded for stylishly sliding around corners, with care taken not to crash into them. The goal is to beat a score set by the opponent.</li></ul><p>All modes but sprint also feature reverse variations of the tracks. All in all, more than sixty races must be won to complete Underground Mode.</p><p>Between races, cars can be traded and upgraded. 14 different cars are available, and there are a large variety of functional (engines, turbos, transmission, tires, brakes) and visual (bumpers, hoods, rims, paint jobs, vinyls) upgrades. Unlike in the console version, visual upgrades are only cosmetic since there is no reputation system.</p><p>Quick Race mode can be utilized for quick challenges using cars and tracks unlocked via Underground mode. The game also features a multiplayer mode via the link cable.</p><p>The game engine is fully polygonal and represents cars and tracks as texture-mapped polygons.</p>"},{"name":"Need for Speed: Underground 2","year":2004,"developer":"Pocketeers","url":"a#N.zip/N%2FNeed%20for%20Speed%20-%20Underground%202%20%28UE%29%20%28M4%29.gba","filesize":1,"score":6.7,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p>The popular Need For Speed Underground franchise was adapted for systems with different capabilities. You drive around a city split into 5 distinct areas. As with the other versions, the aim is to drive well enough to boost your reputation. In this version the route is prescribed, without the exploration of the other systems. Available cars include machines from Volkswagen, Mitsubishi and Toyota. There are less upgrades in this version, although the appearance and handling of your car can still be varied. The story in this version follows a predefined path.</p>"},{"name":"NFL Blitz 2002","year":2001,"developer":"OutLook Entertainment, Inc.","url":"a#N.zip/N%2FNFL%20Blitz%202002%20%28U%29.gba","filesize":1,"score":4.9,"genres":"Sports > 3rd-person (Other) > Arcade > Football (American) > Licensed","desc":"<p><em>NFL Blitz 20-02</em> is a game based on the American Football sport. As the whole series, it takes away most rules and tactics (leaving 36 offensive and 18 defensive plays) while focusing on an action oriented approach. Because of the limited control scheme of the system, the options on the field are less in comparison to the main console version: besides the usual movement, passing and player moving commands, the player also may tackle, leap or activate a turbo boost. The playing perspective is an angled pseudo-3D view with the goals at the top/low side of the screen.</p><p>Both in the exhibition and season mode (17 weeks), the game offers the choice between 32 teams with different statistics regarding passing, defensive and line. The mini games, which can be also selected from the main menu, are basically practice modes for field goal and goal-line situations as well as a NFL trivia quiz.</p>"},{"name":"NGT: Next Generation Tennis","year":2002,"developer":"Spark Creative SARL","url":"a#N.zip/N%2FNext%20Generation%20Tennis%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.gba","filesize":1,"score":"","genres":"Sports > 3rd-person (Other) > Top-down > Tennis > Licensed","desc":"<p><em>Roland Garros French Open 2002</em> is the 2002 version of the annual Roland Garros tennis game. It sports an official license for the Roland Garros and US Open tournaments. The game comes with 4 official and 6 fictional players. The Game Boy Advance version of the game is mostly the same as its bigger brother on the PC and PlayStation 2. Differences are mostly of a graphical nature (2D instead of 3D). It does lack one of the game modes however and controls tailored to the handheld console.</p><p>The game features the following game modes: arcade, training, exhibition, career, and multi-player. All modes can be played in both singles and doubles. The arcade mode allows you to unlock new courts, players and gear. In the career mode you can start out small and use the cash prizes to further train your character and buy better gear.</p><p>With a link cable you can play with and against up to four friends.</p>"},{"name":"NHL 2002","year":2002,"developer":"Budcat Creations, LLC","url":"a#N.zip/N%2FNHL%202002%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":7.3,"genres":"Sports > Top-down > Direct control > Hockey > Licensed","desc":"<p><em>NHL 2002</em> is the only entry in Electronic Arts' hockey series to be released on the Game Boy Advance. With the console versions having migrated to 3D graphics years earlier, the handheld game retains a 2D top-down view very similar to the earliest titles in the series on the Genesis and SNES. In particular, the GBA title is based on NHL 96 for SNES, with modes, graphics and even menus recreated almost exactly.</p><p>Besides a standard mode for exhibition games, the game has a practice mode where the number of players on the field can be freely chosen. Season mode is unusual in that, unlike in other games, the player doesn't select a team to lead through a season. Instead, the game includes the full game schedule of the 2001-2002 NHL season, and any team in any scheduled game can be played. If no games of interest are scheduled on a given day, it can be skipped and the results simulated. The season mode also includes the ability to trade players, sign free agents and even to create players.</p><p>The game also includes a multi player mode over the link cable, with up to four players able to join for cooperative or competitive play.</p>"},{"name":"NHL Hitz 2003","year":2002,"developer":"Exient Entertainment","url":"a#N.zip/N%2FNHL%20Hitz%202003%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>Midway's arcade hockey series makes its only appearance on the Game Boy Advance with <em>NHL Hitz 20-03</em>. Adhering to the arcade style, matches are three-on-three (plus goalies), there are hardly any penalties and fights happen regularly.</p><p>Game modes include exhibition games, a full season (of 29, 58 or 82 games) and playoffs (best of 1, 3, 5 or 7). Season progress is stored to battery-backed RAM. A multiplayer mode via link cable for up to four players is also available. Before a match, players select their lineup from the star players of the included NHL teams.</p><p>Gameplay is seen from an elevated horizontally scrolling view. Controls allow for stick and body checks and dekes. As is standard in Midway arcade sports games, each player has a turbo meter that allows the toggling of turbo, which enhances the other moves. Additionally, players can \"catch on fire\" after a hat trick or a sequence of successful checks, which increases their abilities for a short time.</p><p>The game features voice sample commentary from long-time Midway announcer Tim Kitzrow.</p>"},{"name":"Nicktoons Racing","year":2002,"developer":"Crawfish Interactive Ltd.","url":"a#N.zip/N%2FNicktoons%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Real-time > Direct control > Track racing > Licensed","desc":"<p>'Toon up your Engines!<br>It's wild, high-speed racing action with all your favorite Nicktoons™ characters. Twelve tracks, twelve racers, lots of power-ups, crazy hazards and more!<br>FEATURES: * Compete against the stars of your favorite Nicktoons™ shows: Rugrats™, The Wild Thornberrys™, CatDog™, SpongeBob Squarepants™, Hey Arnold!™, The Angry Beavers™, Aaahh!!! Real Monsters™, The Ren & Stimpy Show™ * 3 ways to race - Cups, Race for Fun and Time Trial * Challenge friends in multiplayer racing using the Game Link® Cable</p>"},{"name":"Nicktoons: Battle for Volcano Island","year":2008,"developer":"THQ Australia Studios Pty Ltd.","url":"7#Nicktoons%3B%20Battle%20for%20Volcano%20Island%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Comedy > Licensed","desc":"<p>The Fate of Vulcano Island is in your Hands!</p><p>Help SpongeBob, Patrick Star, Timmy Turner, and Danny Phantom stop the evil Mawgu and save Vulcano Island!</p>"},{"name":"Nicktoons: Freeze Frame Frenzy","year":2004,"developer":"Altron Corporation"},{"name":"Night Flight","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Ninja Five-O","year":2003,"developer":"Hudson Soft Company, Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Ninja%20Five-0%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Martial arts","desc":"<p>Ninja cop Joe Osugi is on the case of an evil force that has come under the influence of the Mad Masks, an ancient item previously hidden away. Joe must use all of his abilities (the trusty ninja sword, shuriken throwing stars and the unique Kaginawa grappling hook) to clear out the terrorist cells under control and save the hostages in the process.</p><p>As you progress through each level, you will unlock time-trial modes that will test your speed. Boss encounters are also frequent, as well as power-ups and secret items.</p>"},{"name":"No Rules: Get Phat","year":2001,"developer":"Flying Tiger Development","url":"a#N.zip/N%2FNo%20Rules%20-%20Get%20Phat%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Skateboarding","desc":"<p><em>No Rules: Get Phat</em> is an action game where the player controls the little boy One Eye Jack. While he is watching television the broadcast is interrupted by aliens who announce to invade the planet. Jack sets out to stop that. The game contains five worlds that consist of 2D side-scrolling platforming environments. Jack moves to the left or right on his skateboard and is able to duck, and jump to dodge enemies and obstacles and to get on top of platforms. A slingshot is used to attack, as well as a spinning move. He can aim to the right as well as upwards. Levels encourage exploration and often have a vertical design where he can use windows to reach higher parts of a level. Jack has a limited amount of health replenished by grabbing first aid kits. There is a set amount of lives and additional ones are collected by finding icons that represent his head. There are also sections where he can grind rails, ledges and horizontal surfaces and grab vinyl records. By collecting all of them in a single level, additional moves and tricks are unlocked.</p><p>Next to the platforming sections he needs to defeat aliens at the end of levels in sequences similar to the Dance Dance Revolution games where the directional buttons need to be pressed at the right moment to match the beat, appearing in a bar from the right side of the screen in a vinyl shop. This leaves the alien open to an attack and the A button is then used to scratch and attack. The game package includes a physical fingerboard.</p>"},{"name":"Nobunaga's Ambition: Lord of Darkness","year":2001,"developer":"Koei Tecmo Games Co., Ltd."},{"name":"Noddy: A Day in Toyland","year":2006,"developer":"Digital Eclipse Software, Inc.","url":"a#N.zip/N%2FNoddy%20-%20A%20Day%20in%20Toyland%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Welcome to Toyland, home to the small wooden boy Noddy!</p><p>Join Noddy on his adventure in the colourful and magical world of Toyland. As he drives around Toyland he meets some of his friends who are in need of help - and Noddy is always willing to lend a hand! Help Noddy avoid the mischievous magic of the goblins Sly and Gobbo and overcome other tricky obstacles on his way.</p>"},{"name":"Nonono Puzzle Chairian","year":2005,"developer":"Nintendo Co., Ltd."}]