[{"name":"Ochaken Kururin: Honwaka Puzzle no Hotto Shiyo?","year":2004,"developer":"MTO Co., Ltd."},{"name":"Ochaken no Boukenjima: Honwaka Yume no Island","year":2005,"developer":"MTO Co., Ltd."},{"name":"Ochaken no Heya","year":2003,"developer":"MTO Co., Ltd.","url":"a#O.zip/O%2FOchaken%20no%20Heya%20%28J%29.gba","filesize":1,"score":"","genres":"Simulation > Top-down > Isometric > Anime / Manga > Point and select > Contemporary","desc":"<p><em>Ochaken no Heya</em> is the first in a long series of virtual pet games based on the Sega Toys Ochaken line, featuring cute dogs and cats with tea leaves for ears. Players adopt tea dogs and cats to live in a room that players can decorate and organize to their heart's content. There are 10 different ochaken and ochaneko in total, along with over 200 different furnishings. Players can earn in-game currency to shop for furniture by playing various card and puzzle minigames; there are eight different card games, and three kinds of puzzles. Players can also play the card games with up to three other players using the GBA link cable.</p>"},{"name":"Ochaken no Yume Bouken","year":2005,"developer":"MTO Co., Ltd.","url":"a#O.zip/O%2FOchaken%20no%20Yumebouken%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p><em>Ochaken no Yume Bouken</em> is a simple, child-friendly 2D platformer based on the Sega Toys Ochaken line, which features cute dogs and cats with tea leaves for ears. Players control one of a number of different ochaken through sidescrolling levels, with the ability to jump and to hover short distance by flapping their tea leaf ears. The levels feature other ochaken and ochaneko hanging out who the players can speak with; players can also collect items and deliver them to friends in simple side quests.</p><p>Players can also create their own custom ochaken using various colours, body parts, and accessories. Players can play the main game using their custom character, and can import them into Ochaken no Heya DS 2.</p>"},{"name":"Oddworld: Munch's Oddysee","year":2003,"developer":"ART Co.,Ltd.","url":"a#O.zip/O%2FOddworld%20-%20Munch%27s%20Oddysee%20%28U%29.gba","filesize":1,"score":5.6,"genres":"Action > Top-down > Fixed / flip-screen > Platform > Puzzle elements","desc":"<p>After rescuing his people from the hands of death, Abe finds himself teaming up with another creature that needs his help, a little gabbit named Munch. With Abe helping him out, Munch must stop the evil Glukkons' plan of enslaving Abe's race once again, while protecting his own race from doom.</p><p>Both Abe and Munch are playable as you use their powers to get past the guards, or use them to your own advantage. Abe's people can also lend a helping hand in fighting off creatures or solving puzzles, while you guide them away from danger. Munch can also control Fuzzles, small critters that can be deadly in packs against enemies.</p>"},{"name":"Onimusha Tactics","year":2003,"developer":"Capcom Co., Ltd.","url":"a#O.zip/O%2FOnimusha%20Tactics%20%28E%29.gba","filesize":1,"score":6.5,"genres":"Strategy > Diagonal-down > Isometric > Turn-based > Fantasy","desc":"<p>Young warrior, Onimaru is given the Oni Gauntlet as he rushes to defend his village from the demon hordes of Nobunaga Oda. Onimaru soon discovers from the old man Sandayu, that although he has been living in the peaceful province of Iga, he is of the Oni clan and had been secreted away. Additionally, with the power of the Oni Gauntlet, he can absorb the souls of enemies and use the demon Genma stones to recreate lost weapons and armor. With this new knowledge of who his is and of his destiny, he assembles a hasty squad of fighters including his sister Ororo and sets off to avenge his province and stop Nobunaga's demonic war upon the land.</p><p><em>Onimusha Tactics</em> is a turn-based strategy game between the player's side and the enemy's side. In each level you can bring a squad of no more than 10 people. There are no items to buy or sell, however equipment is available and customizable. Upgrades of existing weapons and armor can be done using the defeated souls of enemies absorbed into the Oni Gauntlet. New weapons and armor can be found or created through fusion of Genma Stones. Recipes must be found for each separate item before it can be fused.</p><p>Most characters have a normal attack, the ability to use items and several special techniques for battle. Additionally there is an issen ability that randomly shows up and allows your character to counter-attack and instantly kill any enemy who foolishly attacks that character directly in the next round.</p>"},{"name":"Open Season","year":2006,"developer":"Ubisoft Entertainment Inc.","url":"a#O.zip/O%2FOpen%20Season%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Open Season</em> for GBA is based on the film, and is quite different from the console version. The story in this version mostly follows the movie. A grizzly bear named Boog is very happy with his domesticated home. One day, he gets in trouble with a one-antlered mule deer named Elliot, and the town's authority decides to put them back in the woods where they belong. Unfortunately for them, the hunting season has just begun, and Boog has no idea how to survive outside of his garage home with his beloved caretaker Beth, a park ranger who raised Boog since he was a little cub. </p><p>The game begins just before Boog and Elliot are dropped in the woods. The player controls Boog, who has various moves at his disposal. He can jump, roll, grab and throw forest animals, as well as roar. The goal of the game is to protect the forest animals from the hunters, who all work for Shaw, a hunting fanatic who wants to kill Boog and Elliot. The forest is full of hunters and boss hunters in each animal territory. It is the player's job to scare them off and clean up the forest.</p>"},{"name":"Operation Armored Liberty","year":2003,"developer":"Eastridge Technology","url":"7#Operation%20Armored%20Liberty%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Action > Simulation > 1st-person > Arcade > Shooter > Direct control > Tank > Vehicular combat > Contemporary > Middle East > War","desc":"<p>Operation Armored Liberty is a Game Boy Advance remake of Super Battletank. Taking place during the invasion of Iraq, the player controls a lone M1A1 Abrams Main Battle Tank from the first-person viewpoint. Each of the ten levels requires the player to defeat all enemies on the map to proceed. To accomplish this, players are given several different weapons and abilities, including their tank's main cannon and a smoke screen. Levels three and onward feature boss battles against a static objective at the end of each level. The player is also given the opportunity to visit friendly bases to repair damage and rearm their tank. </p><p>Despite the gameplay being similar to the original SNES release of Super Battletank, there are some changes made in Operation Armored Liberty. The game's time period has been updated to feature the more recent 2003 Invasion of Iraq in contrast to the original's setting in Operation Desert Storm. Operation Armored Liberty also features a password save system and allows for unlimited retries after failing a level. Gameplay has also been changed as the player now has an unlimited fire rate for their main cannon and are no longer able to traverse their turret left or right.</p>"},{"name":"Orbient","year":2006,"developer":"Skip, Ltd."},{"name":"Oriental Blue: Ao no Tengai","year":2003,"developer":"Red Entertainment Corporation","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Oriental%20Blue%20-%20Ao%20no%20Tengai%20%28Japan%29%20%5BT-En%20by%20The%20Romhacking%20Aerie%20v1.0%5D.zip","filesize":1,"score":"","genres":"Role-playing (RPG) > 1st-person > Top-down > Anime / Manga > Fantasy","desc":"<p>The game continues the tradition of <em>Tengai Makyou</em> series, also known as \"Far East of Eden\". You play as either Tenran or Aoi, a teenage boy and girl, respectively, on quest to defeat the ancient evil that threatens the prosperous land of Jipang, to prove themselves worthy of the legendary Fire Clan, warriors who have been protecting Jipang for many generations from evil demons and warlocks. The land Jipang is very similar to medieval Japan, and during your adventure you'll also visit Mongolia, China, and other Asian countries. </p><p>The most important new feature of the game is a non-linear storyline. You can tackle many missions in any order you want, and the storyline also changes depending on the outcome of major battles. If you lose against a boss enemy, the game is not over, but instead, a branching storyline path is revealed. Otherwise, the gameplay is similar to other Tengai Makyou games, featuring overworld map traveling and first person perspective, turn-based combat.</p>"},{"name":"Ottifanten-Pinball","year":2005,"developer":"Independent Arts Software GmbH"},{"name":"Over the Hedge","year":2006,"developer":"Vicarious Visions, Inc.","url":"a#O.zip/O%2FOver%20the%20Hedge%20%28E%29.gba","filesize":1,"score":5.5,"genres":"Action > 3rd-person (Other) > Top-down > Puzzle elements > Licensed","desc":"<p>In this game, based on the Dreamworks movie of the same name, players control RJ the raccoon and Verne the turtle. The levels consist of puzzles both inside the house and outside in the yard. Stella the skunk, Hammy the squirrel, and Ozzie the possum make appearances in the game. </p><p>The point of most levels is to collect candy which can be used to upgrade abilities or buy items to \"decorate\" the forest. Outside the player must avoid obstacles, such as pets, humans, and cars, and make it back to the hedge. The game is geared toward children.</p>"},{"name":"Over the Hedge: Hammy Goes Nuts!","year":2006,"developer":"Vicarious Visions, Inc.","url":"a#O.zip/O%2FOver%20the%20Hedge%20-%20Hammy%20Goes%20Nuts%21%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":6.6,"genres":"Sports > 3rd-person (Other) > Top-down > Puzzle elements > Golf > Licensed","desc":"<p>This sequel to the Over the Hedge games is different from the Nintendo DS and Sony PSP versions since this is a mini-golf game. Levels consist of either traditional sink-the-ball mini-golf holes or levels with objects that must be broken by the ball. Hammy the squirrel must run around levels to move objects so that the path to the hole is clear, while other movie characters actually hit the ball. Players must complete each hole at or under par in order to unlock Challenge Mode, which consists of harder levels.</p><p>The game also consists of a single cartridge multiplayer mode where players pass the GBA to up to 3 other players to compete against each other.</p>"}]