[{"name":"Pac-Man","year":2004,"developer":"Namco Networks America Inc."},{"name":"Pac-Man Collection","year":2001,"developer":"Mass Media, Inc.","url":"a#P.zip/P%2FPac-Man%20Collection%20%28E%29%20%5B%21%5D.gba","filesize":1,"score":7.5,"genres":"Action > Compilation > Top-down > Isometric > Arcade > Puzzle elements","desc":"<p>Four classic <em>Pac-Man</em> games are included in this collection from Namco:</p><ul><li>Pac-Man: The original arcade classic, complete and un-cut.</li><li>Pac-Mania: A conversion of the 1987 update to <em>Pac-Man</em>, which takes the elements of the original arcade game and puts it into an isometric view, as well as adding the ability to jump.</li><li>Pac-Man Arrangement: Never re-produced outside of the arcade, <em>Arrangement</em> again uses the elements of the original <em>Pac-Man</em> and adds a fifth ghost, who can change shape and size when combined with the other 4 ghosts, and make life harder for Pac-Man. New power-ups are also included, like the ability to dash quickly around the screen, warp points to get from one place to the other and new ways of catching ghosts.</li><li>Pac-Attack: Like Tetris before it, you must fit falling blocks together to complete a line to clear the screen. In this case, the falling tiles also have ghosts in them, and once the <em>Pac-Man</em> tile appears (a tile with the Pac-Man symbol), Pac-Man will eat all of the ghosts that are in his path until he gets to a dead end.</li></ul>"},{"name":"Pac-Man Pinball Advance","year":2005,"developer":"Human Soft Inc.","url":"a#P.zip/P%2FPac-Man%20Pinball%20Advance%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.3,"genres":"Action > Top-down > Pinball","desc":"<p>It's Pac-Man meets Pinball! <em>PMPA</em> merges classic Pac-Man action with pinball, reminiscent of Kirby's Pinball Land, letting the player choose from different table backgrounds, the goal of which is to advance through the tables, hitting certain parts to gain power-ups, even the ability to eat pellets and eat the ghost foes (Blinky, Inky, Pinky and Clyde) and rescue Pac-Mans friends, including Ms. Pac-Man as well. There are also mini-games to be played such as a vertical shooter and classic Pac-Man mazes.</p>"},{"name":"Pac-Man World","year":2004,"developer":"Full Fat Productions Ltd.","url":"a#P.zip/P%2FPac-Man%20World%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Arcade > Platform > Direct control > Fantasy","desc":"<p>A port of sorts of the Playstation game Pac-Man World 20th Anniversary. Due to the game now appearing on a handheld device some sacrifices were made. </p><ul><li>The 23 levels of the PlayStation version were reduced to only 12. This removed the factory levels where Pac-Man rescues Pac Jr. and this reduction in levels also causes the majority of the boss fights to be removed too.</li><li>The Maze Mode and Classic Mode of the PlayStation version are not present here.</li><li>The story told through FMV cutscenes of the PlayStation version are now just still images with text. Since the FMV's were removed the bonus outtake FMV's that were rewarded for players who collected all the P-A-C-M-A-N letters are not here with collecting the letters now simply counting to the completion percentage of the game.</li><li>No hub worlds at all unlike the PlayStation version which had them.</li></ul>"},{"name":"Pac-Man World 2","year":2005,"developer":"Full Fat Productions Ltd.","url":"a#P.zip/P%2FPac-Man%20World%202%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>The 5 Golden Fruits are stolen by a gang of ghosts and darkness falls over the land and the evil spirit Spooky is unleashed. It is up to Pac-Man to get the Golden Fruit back and restore order in Pac-Land. Run, bounce, roll, and swim your way through a variety of worlds to find the hidden fruits. There are also extra hidden Galaxian keys which unlock classic Pac-man mazes.</p><p><em>Pac-Man World 2</em> is a side-scrolling platform game which has some depth to the play-field to allow for more movement than just left and right. There are a bunch of moves Pac-Man can pull off, such as a butt-bounce, a rev roll, a flip-kick or a rev jump. Some of these are dual function and aid in both reaching higher platforms or getting up steeper hills, as well as attacking enemies.</p><p>The game also features a password system to get back to levels you have already played.</p>"},{"name":"PaperBoy / Rampage","year":2005,"developer":"Frame Studios S.r.l.","url":"a#P.zip/P%2FPaperboy%2C%20Rampage%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Compilation","desc":"<p>A compilation of the classic arcade games PaperBoy and Rampage brought to the Game Boy Advance.</p>"},{"name":"Paws & Claws: Best Friends - Dogs & Cats","year":2006,"developer":"Sproing Interactive Media GmbH"},{"name":"Paws & Claws: Pet Resort","year":2005,"developer":"Independent Arts Software GmbH"},{"name":"Paws & Claws: Pet Vet","year":2006,"developer":"Denaris Entertainment Software"},{"name":"Payback","year":2004,"developer":"Apex Designs","url":"a#P.zip/P%2FPayback%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.9,"genres":"Action > Racing / Driving > Top-down","desc":"<p>Influenced by Grand Theft Auto, Payback is set across 4 different cities totaling 100 square kilometers of landscape. You can perform all manner of illegal activities to try to achieve wealth, including carjackings, murders, shootings and run-overs. </p><p>Stealing vehicles is the real meat of the game, as these must be used for the various missions, which are obtained by walking over to phone boxes, as in GTA. There are dozens of these, all with different handling characteristics, and include trucks, buses and even boats.</p><p>The mission structures are non-linear, meaning that how you perform in one part can affect how later parts unfold, and the game includes Perspective Corrected 3D graphics with realistic shadows and rotational effect, as well as a full 3D soundtrack of aggressive rap and mid-tempo rock.</p>"},{"name":"Phalanx","year":2001,"developer":"Kotobuki System Co., Ltd.","url":"a#P.zip/P%2FPhalanx%20-%20The%20Enforce%20Fighter%20A-144%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":7.1,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>A futuristic shooter, Phalanx is the name of the prototype starfighter flown by Wink Baufield, a genetically enhanced pilot. It is sent to protect and reclaim Delia IV, a planet in the Andromeda galaxy, which has been colonized by humans for interstellar research purposes. However, an unknown and powerful alien force has overtaken the planet, the military defenses have been completely overwhelmed, and all hope rests on the Phalanx.</p><p>You fly through eight levels, first through various locations in Delia IV, and then you invade the aliens themselves. Like most shooters, you can upgrade your weapons by picking up bonus items dropped by enemy craft.</p>"},{"name":"Phantasy Star Collection","year":2002,"developer":"SEGA Corporation","url":"a#P.zip/P%2FPhantasy%20Star%20Collection%20%28E%29.gba","filesize":1,"score":7.6,"genres":"Compilation > Role-playing (RPG) > Top-down > Turn-based > Sci-fi / futuristic","desc":"<p>This compilation includes the following games:</p><ul><li>Phantasy Star</li><li>Phantasy Star II</li><li>Phantasy Star III: Generations of Doom</li></ul><p>The Saturn version contains Phantasy Star: The End of the Millennium as well.</p>"},{"name":"Phoenix Wright: Ace Attorney - Justice for All","year":2002,"developer":"Capcom Co., Ltd."},{"name":"Phoenix Wright: Ace Attorney - Trials and Tribulations","year":2004,"developer":"Capcom Co., Ltd."},{"name":"Piglet's Big Game","year":2003,"developer":"Doki Denki SA"},{"name":"Pika Pop","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Pikmin 2-e","year":2004,"developer":""},{"name":"Pinball","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Pinball Advance","year":2002,"developer":"Rebellion Developments Ltd.","url":"a#P.zip/P%2FPinball%20Advance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Top-down > Arcade > Pinball > Direct control","desc":"<p>Now you can play pinball wherever you go, with Pinball Advance there are three flipper-crazy, thumb-numbing tables to push your pinball skills to the limits. Tarantula, Jailbreak, Daredevil - Go on ...go for that high score just have one more go.</p>"},{"name":"Pinball of the Dead, The","year":2002,"developer":"Eighting Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Pinball%20of%20the%20Dead%2C%20The%20%28USA%29.zip","filesize":1,"score":7.6,"genres":"Action > 1st-person > Top-down > Pinball > Horror","desc":"<p>Based on \"The House of the Dead\" arcade/dreamcast series, this is a simple combination of pinball and the evil dead. Three pinball tables, Wondering, Movement, and Cemetary (all based on areas seen in The House of the Dead and The House of the Dead 2) are infested with zombies and using your silver ball, you must take out the zombies to save the table. The more you take out, the more points you get and the better the opportunity to take on one of the final bosses.</p>"},{"name":"Pinball Tycoon","year":2003,"developer":"Ignition Entertainment Ltd.","url":"a#P.zip/P%2FPinball%20Tycoon%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Pinball","desc":"<p>Four themed pinball tables with their own unique goals await players in Pinball Tycoon. Digging for gold in California Gold Rush, striking oil in Black Gold, making it big in Hollywood Mogul, and striking it rich in Golden Chance turn pinball into a chance to be a big time tycoon. The game offers a multiplayer mode where up to four players can compete for the highest score on a table.</p>"},{"name":"Pink Panther: Pinkadelic Pursuit","year":2002,"developer":"SuperEmpire Interactive Inc.","url":"a#P.zip/P%2FPink%20Panther%20-%20Pinkadelic%20Pursuit%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>In this side-scrolling action platformer, you control the Pink Panther in his quest to find hidden treasures. You'll be travelling through colorful 3D environments and themes including Medieval, Underwater and Outer Space.</p><p>Many zany objects and gadgets can be found along the way to help you reach your objectives. You'll be using lampshades, paint, fire extinguishers, magnets and even bowling balls. Disguise yourself, blend into the background, disarm traps and fight off enemies.</p>"},{"name":"Pinky and The Brain: The Master Plan","year":2002,"developer":"Warthog Plc","url":"a#P.zip/P%2FPinky%20and%20The%20Brain%20-%20The%20Master%20Plan%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Side view > Arcade > Licensed","desc":"<p>Control alternates between cartoon heroes Pinky &amp; The Brain in this side scrolling action game. Puzzles center around differing abilities between the two characters, e.g. The Brain being able to inflate his head, Pinky being able to jump higher etc. The game offers 16 levels, two controllable vehicles and five bonus games that can be played after they have been unlocked through progress in the game. The game also has a 4 player link mode via cable supporting the bonus games. Goal of the game is to take over the world - naturally.</p>"},{"name":"Pinobee: Wings of Adventure","year":2001,"developer":"Artoon Co., Ltd.","url":"a#P.zip/P%2FPinobee%20-%20Wings%20of%20Adventure%20%28UE%29%20%5B%21%5D.gba","filesize":1,"score":6.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>Grandpa Bee has kidnapped before finishing you, Pinobee - a robotic bee made to defend the world. The player must go through 9 worlds in order to find and rescue your creator. There are multiple storylines with multiple endings. Pinobee can take out most enemies by jumping on top of then, but the most important means of attack is a dash, which can be executed in any direction (also diagonal). The amount of consecutive dashes can be upgraded when meeting a certain character. Pinobee collects flower and question mark bubbles provide power-ups, enhancing the dashes, providing temporary shields or other bonuses. Players can use the Game Link to collect and trade items with friends for power-ups.</p>"},{"name":"Pirates of the Caribbean: Dead Man's Chest","year":2006,"developer":"Amaze Entertainment, Inc.","url":"7#Pirates%20of%20the%20Caribbean%3B%20Dead%20Man%27s%20Chest%20%5BEn%2CDe%2CEs%2CFr%2CIt%5D.gba","filesize":16777216,"score":6.8,"genres":"Action > Diagonal-down > Side view > Isometric > Naval / watercraft > Licensed","desc":"<p>Pirates of the Caribbean 2: Dead Man’s Chest is a swashbuckling sidescroller for the Game Boy Advance, based on the movie of the same name.</p><p>The game has two main modes of seafaring adventure. The first is an action sidescroller, where players take control of the infamous Captain Jack Sparrow as he tries to reclaim his soul back from Davy Jones. He'll run, jump, and battle cannibals, pirates, the royal navy, and Davy Jones' monstrous crew across 15 islands, each made up of several maps.</p><p>Between the islands, players gets to captain Sparrow's ship, the Black Pearl. They'll need to equip her with food (otherwise the crew might mutiny!), cannons, and supplies enough to fend off privateers and pirates on the open sea.</p><p>Radically different than versions of the same title on other platforms, the Game Boy Advance version gives players a lot of gameplay variety over the course of the game. The open-ended island exploration, ship-to-ship battles, and \"RPG-lite\" upgrade system means that players can play this game in many different ways.</p>"},{"name":"Pirates of the Caribbean: The Curse of the Black Pearl","year":2003,"developer":"Pocket Studios","url":"a#P.zip/P%2FPirates%20of%20the%20Caribbean%20-%20The%20Curse%20of%20the%20Black%20Pearl%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.2,"genres":"Action > Diagonal-down > Isometric > Beat 'em up / brawler > Naval / watercraft > Fantasy > Licensed","desc":"<p>Based on the 2003 Disney film of the same name, this game is designed with a blend of role-playing and action.</p><p><em>Pirates of the Caribbean: The Curse of the Black Pearl</em> takes place in a large group of Caribbean islands during the golden age of piracy and high seas adventure.</p><p>The player takes command of a ship and its crew, swordfights with other captains, accepts daring quests, and chases rumours of dangers and riches.</p><p>Action takes place using an isometric view, and is split into two gameplay styles - exploration and battle.</p>"},{"name":"Pitfall: The Lost Expedition","year":2004,"developer":"Torus Games Pty. Ltd.","url":"a#P.zip/P%2FPitfall%20-%20The%20Lost%20Expedition%20%28E%29.gba","filesize":1,"score":6.8,"genres":"Action > Side view > Top-down > Platform","desc":"<p><em>Pitfall: The Lost Expedition</em> on GBA is an original Pitfall game loosely associated with the PS2, Xbox and GameCube game of the same name.</p><p>The game switches between traditional side scrolling platform levels, top down overworld exploration levels and several different minigames.</p>"},{"name":"Pitfall: The Mayan Adventure","year":2001,"developer":"Activision, Inc.","url":"a#P.zip/P%2FPitfall%20-%20The%20Mayan%20Adventure%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Pitfall: The Mayan Adventure</em> is a side-scrolling action game in which you play adventurer Pitfall Harry Jr in search of his father Pitfall Harry. You battle your way through the Mayan jungles, waterfalls, deserted mines and can bungee jump and boomerang your way to safety. There are 13 levels and the action is fast and gripping. You will need to be attentive—and quick. Or prepare to die.</p>"},{"name":"Planet of the Apes","year":2001,"developer":"Torus Games Pty. Ltd.","url":"a#P.zip/P%2FPlanet%20of%20the%20Apes%20%28E%29%20%28M6%29%20%5B%21%5D.gba","filesize":1,"score":6.4,"genres":"Action > Side view > 2D scrolling > Sci-fi / futuristic > Licensed","desc":"<p>Based on the series of 1960's movies that starred legendary actors such as Charlton Heston and Roddy McDowell, the player takes control of a deep space astronaut by the name of Ulysses who crash lands on Earth after 200 years in space and awakens to discover that apes have become the dominant species and has nearly wiped out the human race. Joining with a group of survivors, the player must make their way to the heart of the Ape Empire and stop General Ursus, who is planning a final attack on mankind.</p><p>The gameplay is a side-scrolling action game, similar to Prince of Persia, having the player avoid various traps and pitfalls by jumping and climbing. They must also avoid various enemies including armed apes that will try to stop the player at all costs, but the player has weapons of there own. The player will start out with a knife and eventually will upgrade to a pistol and a shotgun.</p><p>There are 13 levels in all, with the story being told through still picture cut scenes that are modeled after the films. There is also a password feature for players to pick up and play at their leisure.</p>"},{"name":"Play-Yan","year":2005,"developer":"Nintendo SPD","url":"a#P.zip/P%2FPlay-Yan%20Micro%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Compilation","desc":"<p>The Play-Yan is a media player application originally released for the Game Boy Advance. It is also compatible with the Nintendo DS capable of backwards compatibility.  The cartridge has an SD flash memory input that allows the user to store and play MP3 audio files and H.264/MPEG-4 AVC video files. The user interface has a very sleek streamlined look with several sound effects and images reminiscent of the Nintendo universe. Additionally, the software is capable of playing 13 bonus mini-games designed by the WarioWare team. The quick pick up and play games can be downloaded directly from Nintendo of  Japan's homepage. </p><p>The 12 standard mini-games are Avoid, Bat, Fire, Fish, Insect, Jump, Keeper, Memory, Nekoroid, Nose, Triple, Wave. The thirteenth game is a secret game available to Club Nintendo members only. The games are all simple in design sharing many similarities with the Game &amp; Watch and WarioWare series.</p>"},{"name":"Pocket Music","year":2002,"developer":"Jester Interactive Publishing","url":"a#P.zip/P%2FPocket%20Music%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Simulation > Fixed / flip-screen > Music / rhythm > Licensed","desc":"<p>Pocket Music allows you to create your own music from a selection of samples, drum beats, basslines, melodies and other musical instruments. You can then choose to play them back, save them to your cartridge or swap them with a friend!</p>"},{"name":"Pocky & Rocky with Becky","year":2001,"developer":"Altron Corporation","url":"7#Pocky%20%26%20Rocky%20with%20Becky%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Action > Top-down > Anime / Manga > Arcade > Shooter","desc":"<p>This is a portable revival of the classic Pocky &amp; Rocky shooter games. You take control of Shinto priestess Pocky, her raccoon buddy Rocky or newcomer priestess Becky and go out in search of an evil demon that has escaped imprisonment and is wreacking havoc across the land.</p><p>Gameplay-wise the game is a top-down free-scrolling shooter, in which you must navigate your characters across the maze-like stages collecting items and power-ups in order to reach the level's boss and proceed to the next stage. Across the way you'll have to deal with hundreds of enemies that can be vanquished by shooting your magic cards and spells. Additionally, each character has a unique offensive ability that allows you to use pattern shots, homing shots, etc... depending on the power-ups you acquire.</p>"},{"name":"Pokemon Emerald Version","year":2004,"developer":"Game Freak, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Pokemon%20-%20Emerald%20Version%20%28USA%2C%20Europe%29.zip","filesize":1,"score":7.6,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p><em>Pokémon Emerald</em> is the fifth Pokémon game of the advanced generation, after its predecessors Ruby, Sapphire, FireRed, and LeafGreen. It takes place in the world of Hoenn but can also connect with Kanto-based games FireRed and LeafGreen as well. Like Pikachu and Suicune were for Yellow and Crystal respectively, Rayquaza plays a vital role in this game along with the other Legendaries, Groudon and Kyogre. Though similar to the original storyline that occurs in Hoenn, Emerald offers more changes than Yellow and Crystal.</p><p>In terms of gameplay, there have been several alterations to the game:</p><p><strong>Legendaries</strong></p><ul><li>Ability to catch Rayquaza before the Elite Four, as well as both Groudon and Kyogre after it.</li><li>Changes to catching the Regis.</li><li>Ability to catch either one of Latios or Latias.</li></ul><p><strong>Graphics</strong></p><ul><li>New outfits for the characters.</li><li>New Pokémon animations.</li></ul><p><strong>Features</strong></p><ul><li>Ability to enter the Safari Zone Extension, where you can catch Johto (the world of Pokémon Gold, Silver and Crystal) Pokémon like Houndour and Miltank.</li><li>The Battle Frontier, an island full of different battle stadiums.</li><li>Ability to get both of the Claw and Root fossils.</li></ul><p>These are of the changes you might notice at first while playing Pokémon Emerald. However, there are lots of other improvements apart from the new storyline that separates this game from its predecessors.</p>"},{"name":"Pokemon FireRed Version","year":2004,"developer":"Game Freak, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Pokemon%20-%20FireRed%20Version%20%28USA%2C%20Europe%29%20%28Rev%201%29.zip","filesize":1,"score":7.7,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p><em>Pokémon FireRed</em> takes the player into the world of Kanto on a mission to catch all of the 350 pokémon for Pokémon researcher Prof. Oak. Pokémon are animal-looking creatures that pretty much form this and all the other games in the Pokémon Universe. The challenge is to capture them all using pokéballs and an own set of these strange creatures, as well as training them for the ultimate battle, the Elite Four!</p><p>The game is a remake of the original Pokémon Red and offers the same diversity of gameplay as the original. However, this game has got everything the player might miss in the classic game: updated art and graphics, new pokémon, and perhaps the most interesting: the wireless adapter. This allows the player to trade wireless with friends within a limited radius. In addition to all of this, the player may explore a new set of islands outside of Kanto, the Sevii Islands! Enter the union room, make a dream team or explore the world of Kanto in this epic gameplay experience from the Universe of Pokémon.</p><p><em>Gotta catch 'em all!</em></p>"},{"name":"Pokemon LeafGreen Version","year":2004,"developer":"Creatures, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Pokemon%20-%20LeafGreen%20Version%20%28USA%2C%20Europe%29%20%28Rev%201%29.zip","filesize":1,"score":7.6,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p><em>Pokémon LeafGreen</em> takes the player into the world of Kanto on a mission to catch all more than 150 Pokémon for Pokémon researcher Prof. Oak. Pokémon are animal-like creatures with strange powers that inhabit every nook and cranny of the Pokémon world. Try to capture them all using PokéBalls, create your own personal team of Pokémon, and prepare them for for the ultimate battle with the Elite Four!</p><p>It is a remake of the original Pokémon Green (which was sold in other territories with some graphical and gameplay improvements as Pokémon Blue and offers the same diversity of gameplay as the original. However, this game's got everything you might miss in the classic game: updated art, splendid graphics, new Pokémon and perhaps the most interesting, the wireless adapter. This allows you to wirelessly trade with your friends within a limited radius. In addition, LeafGreen lets you explore a new set of islands outside of Kanto, the Sevii Islands! Enter the union room, make the team of your dreams or explore the world of Kanto in this epic gameplay experience from the Universe of Pokémon.</p>"},{"name":"Pokemon Mystery Dungeon: Red Rescue Team","year":2005,"developer":"Chunsoft Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Pokemon%20Mystery%20Dungeon%20-%20Red%20Rescue%20Team%20%28USA%2C%20Australia%29.zip","filesize":1,"score":7,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Roguelike","desc":"<p>Breaking the conventions of prior Pokémon games, you play as a human who has suddenly been transformed into a Pokémon, but before you could come to grips with this startling revelation, a Butterfree needs help! Its baby Caterpie has fallen into a dungeon and cannot get out!</p><p>You and other Pokémon you befriend along the way must brave randomly created dungeons to help out other Pokémon who find themselves in need of rescuing or  just need something delivered. </p><p>Unlike previous Pokémon games, the battles take place on the map (though they are still turn based), and although you may only directly control the Pokémon that represents you in the game, you can give your companions vague battle orders, such as use more special attacks or conserve items.</p>"},{"name":"Pokemon Pinball: Ruby & Sapphire","year":2003,"developer":"Jupiter Corp.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Pokemon%20Pinball%20-%20Ruby%20%26%20Sapphire%20%28USA%29.zip","filesize":1,"score":7.8,"genres":"Action > Top-down > Pinball > Fantasy","desc":"<p>The pocket monsters are back on the pinball table, this time with the latest batch of creatures from the Ruby &amp; Sapphire series on GBA joining the already established cast of characters.</p><p>Your job is to not only use the Poke-ball as a pinball and rack up the biggest score on the table, but to also capture the Pokemon through a selection of mini-games and challenges during the usual pinball game. Simply hit the required areas of the board with the ball and you'll capture the monster available. There's 200 to find in total.</p><p>Two different boards are on offer, each based on the two versions of Pokemon for GBA (i.e. Ruby and Sapphire). Each board represents a new challenge as well as which Pokemon you can catch during play.</p><p>Although there is no 2 player battle mode of sorts, you can trade Pokemon and high scores using the link cable.</p>"},{"name":"Pokemon Ruby Version","year":2002,"developer":"Game Freak, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Pokemon%20-%20Ruby%20Version%20%28USA%2C%20Europe%29%20%28Rev%202%29.zip","filesize":1,"score":7.9,"genres":"Role-playing (RPG) > Diagonal-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>Pokémon is back for another round catching and training! You're the new guy (or girl) in Littleroot Town, and the newest generation of Pokémon trainers. Professor Birch sends you on your way in your journey, with one of your choice of 3 starter Pokémon. There's Treecko (A grass-type chameleon-like little guy) Torchic (a Fire-type bird) and Mudkip (a Water-type amphibious creature).</p><p>Now, you've got a whole new world to explore in Hoenn, with eight new gyms and two-on-two battles, opening up a whole new myriad of tactics! New items, new Pokémon (over 350!!), and a new Pokédex to boot too! And of course we have our new villains, the nefarious Team Magma, who plan on submerging the world in water in order to call out the Legendary Groudon!</p><p>Only one person can stop them and become the ultimate Pokémon Master... You!</p>"},{"name":"Pokemon Sapphire Version","year":2002,"developer":"Game Freak, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Pokemon%20-%20Sapphire%20Version%20%28USA%2C%20Europe%29%20%28Rev%202%29.zip","filesize":1,"score":8,"genres":"Role-playing (RPG) > Diagonal-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>Pokémon is back for another round catching and training! You're the new guy (or girl) in Littleroot Town, and the newest generation of Pokémon trainers. Professor Birch sends you on your way in your journey, with one of your choice of 3 starter Pokémon. There's Treecko (A grass-type chameleon-like little guy) Torchic (a Fire-type bird) and Mudkip (a Water-type amphibious creature).</p><p>Now, you've got a whole new world to explore in Hoenn, with eight new gyms and two-on-two battles, opening up a whole new myriad of tactics! New items, new Pokémon (over 350!!), and a new Pokédex to boot too! And of course we have our new villains, the nefarious Team Aqua, who plan on submerging the world in water in order to call out the Legendary Kyogre!</p><p>Only one person can stop them and become the ultimate Pokémon Master... You!</p>"},{"name":"Polar Express, The","year":2004,"developer":"Tantalus Interactive Pty. Ltd.","url":"a#P.zip/P%2FPolar%20Express%2C%20The%20%28UE%29%20%28M5%29.gba","filesize":1,"score":5.5,"genres":"Action > Racing / Driving > Side view > Platform > Puzzle elements > Licensed","desc":"<p>All aboard the Polar Express!  Take a journey to the North Pole as you visit scenes from the movie based on the book by Chris Van Allsburg.  Play as the brave Hero Boy as he has a trip filled with adventure on the magical train.</p><p>Players make their way through The Polar Express' carriages, furnaces and even North Pole City as they make their way to meet Santa Claus himself.  Special toys will grant the Hero Boy powers, like the Pogo Stick, the Balloon, and the Magic Wand - although you might be unlucky and find a pair of socks!  You'll even get to drive the train itself!</p>"},{"name":"Polarium Advance","year":2005,"developer":"Mitchell Corporation","url":"a#P.zip/P%2FPolarium%20Advance%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.5,"genres":"Puzzle > Top-down > Real-time > Falling block puzzle","desc":"<p>Polarium Advance is basically the same as Polarium for the Nintendo DS, but a couple of new blocks have been added.</p><p>This is a puzzle game in which the player must create horizontal lines of all the same color (either black or white). To change the color (or \"polarity\") of a block, you must select the blocks in one line. In most puzzles, you can use the border to lengthen the line. The new blocks in the Advance version are: Hurdle Tiles, which you cannot pass, Multi-Tiles, which count as black or white, and Solid Tiles, which will not turn but are removed so that the tiles above them fall down. There are 365 puzzles in this mode (Daily Polarium) ranging from very easy to quite challenging.</p><p>The Time Attack Mode requires you to solve either ten easy puzzles or five hard puzzles within the time given. Leaving a block of the wrong color in a line results in a 30 seconds penalty. </p><p>It is possible to create your own puzzles and share them with friends. Puzzles created in the Nintendo DS version of the game are compatible with the GBA version.</p><p>The Japanese TV advertisements reveals the game was designed to be played one handed on GBA SP when riding public transport.</p>"},{"name":"Popeye: Rush for Spinach","year":2005,"developer":"Magic Pockets SAS","url":"a#P.zip/P%2FPopeye%20-%20Rush%20for%20Spinach%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":5.7,"genres":"Action > Racing / Driving > Side view > Platform > Licensed","desc":"<p>While going out for a walk one day, Popeye and Olive Oyl were harassed by Bluto once again. Sick of their bickering, Olive decides to have a race to decide who will accompany her for a walk. Wimpy, lured with the promise of food, joins in on the action.</p><p>Popeye: Rush for Spinach is a racing game in the guise of a side-scrolling platformer. Players choose from either Popeye, Olive, Bluto or Wimpy, and then navigate their way to the finish line of each world. Special power-ups help them gain speed, such as cars, pogo sticks, skateboards, rockets and even dinosaurs. Strewn across the levels are assorted hazards designed to slow you down and make progression more difficult. In addition to the standard Adventure Mode, which strings together the levels with a story, you can also choose from a versus mode, or a time trial mode.</p>"},{"name":"Postman Pat and the Greendale Rocket","year":2007,"developer":"Otaboo","url":"a#P.zip/P%2FPostman%20Pat%20and%20the%20Greendale%20Rocket%20%28E%29.gba","filesize":1,"score":"","genres":"Action > 1st-person > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p><em>Postman Pat and the Greendale Rocket</em> is based on the famous TV cartoon series about happy and friendly Postman Pat and his hometown Greendale. The old Greendale train station is in bad state and its steam train, the Greendale Rocket, does not seem to be working! The inhabitants of Greendale decide to repair the station and its train. And Pat is ready to help everyone!</p><p>The game features five different levels - each of which include a separate platform phase, a mini-game and a driving phase for a total of fifteen different stages. During platform stages Postman Pat should find certain inhabitant of Greendale such as Mrs. Goggins, Charlie Pringle, reverend Timms, Dorothy and Alf Thompson. Walking and jumping, he should collect stamps, letters, and parcels.</p><p>There are places that Pat can't reach by himself. In these situations, the player will take control of Pat's black-and-white cat, Jess, who can find buttons that allow Pat to continue. Upon finishing a level, Pat will be given an object that will help the villagers get the Greendale Rocket back on the tracks.</p><p>The 5 mini-games are arcade games presented by the inhabitants of Greendale. They include sorting the objects to find six parcels, making a kite fly and collecting a certain number of letters, catching the drops, catching the butterflies as Jess the cat, and stamping parcels and letters.</p><p>In the driving phases Pat with Jess the cat should drive in Pat's van through the streets of Greendale and the surroundings and should avoid various obstacles without losing too much time.</p>"},{"name":"Power Pro Kun Pocket 3","year":2001,"developer":"Diamond Head"},{"name":"Power Pro-kun Pocket 4","year":2002,"developer":"Diamond Head","url":"a#P.zip/P%2FPower%20Pro%20Kun%20Pocket%204%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Simulation > Sports > Text-based / Spreadsheet > Fixed / flip-screen > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Japanese-style adventure > Direct control > Menu structures > Baseball > Asia > Fantasy > Comedy > Horror","desc":"<p><em>Power Pro-kun Pocket 4</em> is a 2002 arcade Baseball simulator developed by Diamond Head and published by Konami for the Game Boy Advance. </p><p>The game's main feature is its Success story scenario, \"Sunrise Highschool Edition\", which follows a boy who is inflicted with a deadly curse after accidentally knocking over a memorial headstone. His friends start vanishing and his Baseball club is set ablaze. If he does not rebuild the club and win the Koshien tournament in three years, even he will be dragged into a vortex of oblivion.</p><p>The player must manage the protagonist's weekly routine to train, recruit new teammates, fix the Baseball club and date one out of a few love interests. Failing the story's objectives or losing any late-game matches results in a game over which erases the player's save file. It is possible to reset the game to prevent that, but there are restrictions and penalties for doing so.</p><p>Clearing the first scenario 3 times reveals the Inner Success, which is called \"RPG-Style Fantasy\". It follows a warrior in a fantasy world who must face various monstrous threats while looking for powerups and mystical spheres to build a Baseball Doll for a king. From this installment on, various characters from previous games are adapted into these alternate universes.</p><p>As suggested by the title, this mode features turn-based battles and random encounters. Allies can be found around the world and recruited, but will be lost if killed in combat or from other circumstances. The same inventory system from <em>Pawapoke 3</em> is used to manage powerups for the player character and his custom Baseball Doll. And although the player is under a limit of 200 actions to clear the story with, rushing through the mission can result in various events being lost, including the final boss.</p><p>Upon clearing either Success mode, the player can use the resulting character to build a custom team for playing Baseball on the Exhibition mode. Much of the game's replayability comes from attempting to earn the best possible ballplayers with strategy and luck. Matches between two people who own the game and a link cable are supported, and players can also share their characters via long passwords.</p>"},{"name":"Power Rangers: Ninja Storm","year":2003,"developer":"Natsume Co., Ltd.","url":"a#P.zip/P%2FPower%20Rangers%20-%20Ninja%20Storm%20%28E%29%20%28M3%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Licensed","desc":"<p>The handheld version of <em>Power Rangers: Ninja Storm</em> is a side-scrolling action game where players take control of one of the 6 available Power Rangers, with some of them being grouped.</p><p>The choice of available rangers is as follows:<em> </em>Group:* Red, Blue, Yellow Wind Rangers</p><ul><li><em>Group:</em> Crimson, Navy Thunder Rangers</li><li><em>Solo:</em> Green Samurai Ranger</li></ul><p>Players can switch into any of the rangers in the groups by pressing Select. Pressing Select while playing as the Green Samurai Ranger makes him do a special attack which harms all surrounding enemies.</p><p>Each ranger also has their own special attack which takes time to recharge and in each group the rangers have one out of two standard weapons they can attack with. In order to switch one weapon to the other, the rangers must destroy boxes and pick up the weapon. Usually, one of the weapons is a close-range sword, while the other is a longer-range weapon such as a blaster or a long fire blade for the Green Samurai Ranger. Collecting the same weapon will also level up the weapon making it do more damage.</p><p>After going through the stage and defeating the boss in combat, players switch to a megazord battle where they must press the A and B button, as well as a direction button in time to do an attack on the enemy. When the meter on the bottom is almost completely red and the enemy is almost defeated, players can do a stronger attack by pressing one of the buttons simultaneously with the R button and doing that successfully will prompt players to use an item to attack.</p>"},{"name":"Powerpuff Girls, The: Him and Seek","year":2002,"developer":"Vicarious Visions, Inc.","url":"a#P.zip/P%2FPowerpuff%20Girls%2C%20The%20-%20Him%20and%20Seek%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > Arcade > Music / rhythm > Pinball > Puzzle elements > Licensed","desc":"<p>Another day in the city of Townsville, and this time, the Powerpuff Girls are off on a scavenger hunt! Ms. Keene has given the girls a list of different items that can be found in the city. Along the way, Blossom, Bubbles and Buttercup will run into familiar villains such as Mojo Jojo, Fuzzy Lumpkins, The Gangreen Gang, the Boogie Man, and of course... HIM.</p><p><em>Him and Seek</em> is a side-scrolling adventure game starring the Powerpuff Girls. There's no platforming required in this game, as the girls can fly everywhere. Instead, it plays like a combination of a beat-em-up and a point and click adventure game. The girls will need to perform tasks for Townsville citizens to get items for their scavenger hunt list, ranging from destroying crazy monsters, to finding lost wallets, to beating up the Gangreen Gang to get a tooth!</p><p>Initially, you can only control one girl at a time, attacking with punches and kicks, shooting laser beams, and dashing. However, later the girls decide to team up, and you can switch girls on the fly by pressing the L Button. There are also some cool mini-games, such as an excellent pinball machine, a Dance Dance Revolution-like dance-off against the Boogie Man, and a Frogger parody where you control Mojo Jojo as you help him escape from jail and avoid capture by the Powerpuff Girls.</p>"},{"name":"Powerpuff Girls, The: Mojo Jojo A-Go-Go","year":2001,"developer":"Sennari Interactive, LLC","url":"a#P.zip/P%2FPowerpuff%20Girls%2C%20The%20-%20Mojo%20Jojo%20A-Go-Go%20%28E%29%20%28M6%29.gba","filesize":1,"score":6.3,"genres":"Action > Side view > Shooter > Licensed","desc":"<p>Side-scrolling shooter, reminiscent of Konami's Parodius. Players take control of all three powerpuff girls who operate as a single unit, collecting powerups and blasting enemies. At any given time only one girl is active, any others remaining slowly regenerate health and the game is over if all three are knocked out.</p>"},{"name":"Prehistorik Man","year":2001,"developer":"Titus Interactive, S.A.","url":"a#P.zip/P%2FPrehistorik%20Man%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>In <em>Prehistorik Man</em>, the player takes control of a neanderthal who is on a quest to travel through various levels, collecting food items to get his village ready for the fast approaching fall feast. Along the way, the player will encounter an assortment of enemies ranging from spiders, giant rats and even the mighty T-Rex.</p><p>There are five levels in all and the player can upgrade their weapons to axes and mallets throughout the game as well as acquire a hang glider, giving the player the advantage of flight and covering long distances. The main goal of the game is to vanquish enemies, collect food items, and face a boss at the end of each level.</p>"},{"name":"Premier Action Soccer","year":2006,"developer":"Independent Arts Software GmbH","url":"a#P.zip/P%2FPremier%20Action%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Sports > Side view > Football (European) / Soccer","desc":"<p>Premier Action Soccer is a budget priced title based on the FIFA World Cup 2006 held in Germany, released on its opening day. Including all 32 teams participating in the tournament rated in four areas (defense, midfield, attack and overall) with fictional player names (although fans will quickly recognize who T. Brinks and M. Pallack from Germany, Manillas from Spain and Romualdo of Brazil are), players can take part in friendlies, play the World Cup (the real 2006 groups are included, but it's possible to randomize them) or train for penalty shootouts. </p><p>Gameplay is simple and straightforward. A and B buttons control kicking the ball (low and high, respectively), being possible to shoot at goal using either one, all depending on distance to goal. After kicking the ball, the player can add aftertouch to the ball tapping the d-pad, making it go away from the goalkeeper of from a defender. The R button allows the player to accelerate, as long as he has enough stamina, shown by white circles under his name. Several tactical options such as formation, strategy and individual orders are included.</p>"},{"name":"Premier Manager 2003-04","year":2003,"developer":"ZOO Digital Publishing Ltd.","url":"a#P.zip/P%2FPremier%20Manager%202003-04%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Simulation > Sports > Strategy > 1st-person > Managerial / business simulation > Football (European) / Soccer","desc":"<p><em>Premier Manager 2003-04</em> is a soccer management sim, in which the player is responsible for the athletic and financial success of a soccer team. </p><p>The game features all 4 divisions and domestic cups of the English leagues, all 4divisions, FA and league cups of the Scottish one, and the top 2 divisions and domestic cups of the French, German, Italian and Spanish leagues.</p><p>The matches are shown using a 2D engine.</p>"},{"name":"Premier Manager 2004-2005","year":2004,"developer":"Tuna Technologies Ltd.","url":"a#P.zip/P%2FPremier%20Manager%202004-2005%20%28E%29%20%28M4%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Top-down > Managerial / business simulation > Football (European) / Soccer","desc":"<p><em>Premier Manager 2004-2005</em> is a soccer manager where the player is responsible for the athletic and financial success of his team. As usual there are a lot of details to take care of, e.g. searching for sponsors, stadium expansion, player transfers, lineup and tactics. But, as usual for English soccer managers, the emphasis is on the athletic aspect.</p><p>The matches itself use an abstract presentation: the soccer field is shown in a top-down, tactical perspective and the player movements are shown with blue and red balls. It also features a new meeting system where the player needs to convince the management of his views before important decisions.</p>"},{"name":"Premier Manager 2005-2006","year":2005,"developer":"Tuna Technologies Ltd.","url":"a#P.zip/P%2FPremier%20Manager%202005-2006%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Sports > Managerial / business simulation > Football (European) / Soccer","desc":"<p>In this version of Premier Manager, the player has the ability to control a team in the top two divisions in England, Italy, Spain, Germany or France, but many players are also available from non-playable leagues.</p><p>The manager is in charge of hiring and selling players and staff; improving club property, such as the stadium, club shop and medical facilities; and of course, finding the perfect tactic (among seven available) for the players. The player has the option to jump one day or straight to the next event, which can be player transfer offers (or new progress on one), injuries or other club-related news.</p>"},{"name":"Prince of Persia: The Sands of Time","year":2003,"developer":"Ubisoft Entertainment Inc.","url":"7#Prince%20of%20Persia%3B%20The%20Sands%20of%20Time%20%28USA%29%20%5BEn%2CFr%2CEs%5D.gba","filesize":8388608,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Middle East","desc":"<p>Based on the console series of the same name, the Prince of Persia has been tricked into unleashing the Sands of Time, a power that can control time and space. With the Kingdom turned upside down, the Prince must right this wrong and save all, using the Sands of Time itself to his advantage.</p><p>Unlike the console versions, this GBA title reverts back to the tried and true platform adventuring of the original Prince of Persia, with added elements of action and puzzle solving. Players can use the power of the Dagger of Time to reverse time if a mistake is made during play, and you will also control a second character during play to open switches for the Prince to proceed.</p>"},{"name":"Princess Natasha: Student Secret Agent Princess","year":2006,"developer":"Frame Studios S.r.l.","url":"a#P.zip/P%2FPrincess%20Natasha%20-%20Student%2C%20Secret%20Agent%2C%20Princess%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Based on the flash animation series for AOL kids which ran from 2004 to 2006, this game casts the player as Princess Natasha. She is a regular student, but also has to hide she is a princess and a secret agent. One day, her father King Carl tells her something strange has happened in the kingdom of Zoravia. All the citizens are walking around like zombies and Natasha is the only one who can help them, together with her friend Oleg.</p><p>The game starts on a city map where Oleg's super radar provides the coordinates on her booferberry of the robots turning the citizens into zombies. Next to the main missions, there are also bonus levels marked by a red spot. To complete a chapter, a set amount of citizens needs to be saved in the different levels. After choosing a location, Natasha needs to select a modification for her remote device. These gadgets will become more powerful during the game.</p><p>The game is played as a regular platformer. Natasha can be moved around, she can jump, crouch, climb ladders, kick and punch with different combos and use a gadget. The use of gadgets is limited through a charging bar. Citizens need to be saved before they turn into full zombies. Natasha uses a dezombifier to turn gray zombies back into citizens, but the green ones cannot be saved anymore.</p><p>The game contains an Extras menu with artwork and pictures. A third option, codes, allows the player to enter codes found on a website to change a few gameplay options.</p>"},{"name":"Proud Family, The","year":2005,"developer":"Gorilla Systems Corporation","url":"a#P.zip/P%2FProud%20Family%2C%20The%20%28U%29.gba","filesize":1,"score":"","genres":"Adventure > 3rd-person (Other) > Side view > Music / rhythm > Platform > Puzzle elements > Licensed","desc":"<p>The wedding anniversary for Penny Proud's parents is close, and that means its time to get them a present! Penny made something herself, but her friends said that she should get them a T.H.A.N.G.(or Total Home Automated Necessity Gizmo) instead. It's very expensive, but much cheaper if you buy it in pieces and self-assemble it. So Penny needs to spend time working jobs to get enough money to buy it.</p><p>The video game for <em>The Proud Family</em> can best be described as a side-scrolling adventure game. Players navigate through Penny's neighborhood, being informed of odd jobs that Penny can take to earn money. Anything from picking up litter to working at the local Pizza Parlor, to finding neighbors' lost dogs on the streets. Once Penny has earned enough money for a T.H.A.N.G. part, she can go to the store to buy it, and then the next chapter begins.</p><p>The game also has mini-games which are based around Penny's official 'jobs' that she receives. For example, she works for her dad at his factory, combining various snacks to please three different judges. Another mini-game has Penny competing in a dance-off. And at Chez Wizard, she has to take up a waitress job, where she greets and seats customers, takes their orders, delivers their food, takes the payment, and clears the dirty dishes. On top of this, it all has to be done quickly to satisfy the customers!</p><p>Certain areas in the game also present themselves as photo opportunities. If Penny stands close enough to a star marker and presses the R Button, she'll get a photo of one of the characters from the show that will be stored in her photo album. If she's not close enough, she'll just get a fuzzy photo of a UFO instead.</p>"},{"name":"Punch King","year":2002,"developer":"Full Fat Productions Ltd.","url":"a#P.zip/P%2FPunch%20King%20%28E%29%20%28M3%29.gba","filesize":1,"score":6.9,"genres":"Sports > Behind view > Fixed / flip-screen > Direct control > Boxing","desc":"<p><em>Punch King</em> is a 3rd-person, cartoonish boxing game very similar to Mike Tyson's Punch-Out!!.</p><p>Fights lasts three rounds, and there's a three knockdown rule in effect. Each opponent has their own tells and patterns which the player needs to memorize. They can be defeated by dodging, ducking and punching at the right times.</p>"},{"name":"Punching Bags","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Puppy Luv: Spa and Resort","year":2007,"developer":"Humagade Inc."},{"name":"Puyo Pop","year":2001,"developer":"SONICTEAM, Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Puyo%20Pop%20%28USA%29%20%28En%2CJa%29.zip","filesize":1,"score":7.2,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Falling block puzzle > Direct control","desc":"<p>Sega's first excursion into the Puyo Puyo series since the bankruptcy of the series's original developer Compile finds Satan (once again) up to no good. He has scattered five golden runes and handed each one to a different character in the Puyoverse. Our hero Arle isn't aware of this - until her pet Carbuncle runs for the runes! Now Arle must find the five runes and recover her friend - all at the same time.</p><p>As with many other titles in the Puyo Puyo series, <em>Puyo Pop</em> pits you as Arle Nadja against a series of crazy characters bent on stopping her from recovering the five runes. As before, gameplay is simple - match Puyos (which come in up to five colors), make chains, and drown your opponents in a flood of Nuisance Puyos. In certain stages, you might run into Point Puyos, which when popped will add a bonus to the current chain, and Hard Puyos, which require two hits to pop. In addition, once Arle is finished with her quest, she can search for items which can unlock new things for her to explore.</p><p>The traditional battle mode is still around, of course, as up to four players can compete for Puyo bragging rights.</p>"},{"name":"Puyo Pop Fever","year":2004,"developer":"Sonic Team"}]