[{"name":"R-Type III: The Third Lightning","year":2004,"developer":"Irem Corp.","url":"a#R.zip/R%2FR-Type%20III%20-%20The%20Third%20Lightning%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Space flight > Sci-fi / futuristic > Regional differences","desc":"<p>The evil Bydo Empire returns in this entry of the R-Type series. So climb into the latest R-Type vessel, the R-90,  and blast through six side-scrolling levels on your way to destroy the Bydo mothership.</p><p>Gameplay is still the classic R-Type way with huge levels and bosses. With your detachable laser unit, you can fire in front or behind your ship. R-Type III now features three different kinds of laser unit, selectable at the start of a game. Each offers different laser types depending on the power-ups collected.</p>"},{"name":"Racing Gears Advance","year":2005,"developer":"Orbital Media, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Racing%20Gears%20Advance%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Racing / Driving > Diagonal-down > Isometric > Arcade > Managerial / business simulation > Licensed","desc":"<p>This handheld racing game offers a range of 12 licensed cars (including models by Chevrolet, Dodge, GM, Lotus and Mitsubishi), several circuits, and a set of opponents. To these stock elements, it adds one more: weaponry. Now you can choose to nitro past the opponent ahead of you, or slow him down with a missile.</p><p>With each vehicle and driver pair you can race in Practice Mode to familiarize yourself with tracks or choose  Championship Mode to progress through a series of circuits. After each race you'll need to spend some of the money you've earned (either by achieving a good placement or picking up money icons during the race) to repair and, if possible, upgrade your car. Upgrades can improve your car as a racing machine (e.g. a larger engine or better brakes) or as a war machine (e.g. adding more weapons bays or buying a new type of weapon).</p><p>The track design uses isometric view, and almost never puts the car behind an obstacle. However, among the twisty roads are a few shortcuts that require you to think outside the lines of the road, and occasionally take a leap of faith.</p>"},{"name":"Rampage Puzzle Attack","year":2001,"developer":"Ninai Games, Inc."},{"name":"Rapala Pro Fishing","year":2004,"developer":"FUN Labs Romania S.R.L.","url":"a#R.zip/R%2FRapala%20Pro%20Fishing%20%28U%29.gba","filesize":1,"score":6.4,"genres":"Sports > 3rd-person (Other) > Fishing","desc":"<p>Rapala Pro Fishing takes you through 12 locations such as Mille Lacs Minnesota, Sam Rayburn Texas, Lake Okeechobee, and the Amazon.</p><p>You'll fish for 13 game fish species such as largemouth and smallmouth bass, catfish, muskie, walleye and king salmon. Choose from over 750 Rapala brand lures. A fishing guide will help you if you're not sure what the best lure, location or strategy is.</p>"},{"name":"Rayman 3","year":2003,"developer":"Gameloft Divertissements Inc.","url":"a#R.zip/R%2FRayman%203%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":7.9,"genres":"Action > Behind view > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>Globox, a friend of Rayman, has placed the world in peril. By eating the Lord of the Dark Lums, Globox has enraged the Hoodlums, who plan to take back their master no matter what the cost to the world around them. It's up to Rayman to save the day and find a cure to rid the Dark Lord from Globox.</p><p>Just like its Game Boy predecessors, <em>Rayman 3</em> is mostly a traditional side-scrolling platformer. The main goal is to reach the end of a level, but there are various items to collect which all count towards the 100% completion. Some of those items can only be collected by re-visiting the level with additional abilities which are learned during the course of the game. Additionally there are two 3D mini games involving jet skiing and kart racing.</p><p>New abilities, thanks to power ups littered around the levels, allow Rayman to use the likes of Heavy Metal Fist and the Shock Rocket to take down enemies around him, while the lock jaw allows Rayman to get to hard to reach places.</p><p>The GBA version can link to a GameCube via the link port, allowing players to play exclusive mini-games on both systems and download new levels to the GBA.</p>"},{"name":"Rayman Advance","year":2001,"developer":"Ubi Soft Paris Studios","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Rayman%20Advance%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>When a villain known only as Mr. Dark appears, trouble brews in Rayman's world. Mr. Dark captures the Toons - source of light and Rayman's friends. With no more light, evil creatures begin to roam, making the world unsafe for everyone. It’s up to you, as Rayman, to free your friends and put an end to Mr. Dark's dastardly schemes!</p><p><em>Rayman</em> is a side-scrolling platformer starring the titular Rayman, a big-nosed chap with no arms or legs. Rayman can jump and use his hair to hover for a short period of time. He can also attack by throwing his fists, or winding up his fists for a more powerful punch. He can occasionally find special power ups that grant him unlimited flying power, giving him the ability to navigate through tricky mazes.</p>"},{"name":"Rayman: 10th Anniversary","year":2005,"developer":"","url":"a#R.zip/R%2FRayman%2010th%20Anniversary%20-%20Rayman%20Advance%20%26%20Rayman%203%20%28E%29.gba","filesize":1,"score":"","genres":"Compilation","desc":"<p>Bundle of Rayman Advance and Rayman 3.</p><p>In Rayman Advance, the lead character consists of a body, a head, two hands and two feet - no arms or legs. Humorous action-adventure/platformer in which the player must jump and climb, and defeat enemies. </p><p>In Rayman 3 the lead character has learned some new abilities. His friend Globox has eaten the Lord of the Dark Lums, thereby enraging the Hoodlums.</p>"},{"name":"Rayman: Hoodlum's Revenge","year":2005,"developer":"Digital Eclipse Software, Inc.","url":"a#R.zip/R%2FRayman%20-%20Hoodlum%27s%20Revenge%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":6.5,"genres":"Action > Diagonal-down > Isometric > Platform > Puzzle elements > Fantasy","desc":"<p>A spin-off in the Rayman series, <em>Hoodlum's Revenge</em> takes place directly after the events from Rayman 3: Hoodlum Havoc and for the first in the series, aside from multi-player games, Rayman's friend Globox is featured as a playable character.</p><p>After Rayman defeated the Hoodlums' leader, Andre, the Hoodlums decide to get revenge (hence the title), so they kidnap Rayman's best friend Globox. Rayman rescues Globox part-way through the game, and as the two of them find out more about the Hoodlums trying to clone Reflux, they decide to stop them for good this time.</p><p>The game has slightly pixelated 3-D action gameplay under a fixed 2.5D isometric camera view (a first in the series). Several of the levels are puzzles in which the player must change control from Rayman to Globox in order to flip a switch or hold a button down to allow them to continue.</p>"},{"name":"Rayman: Raving Rabbids","year":2006,"developer":"Visual Impact","url":"a#R.zip/R%2FRayman%20-%20Raving%20Rabbids%20%28E%29%20%28M6%29.gba","filesize":1,"score":6.8,"genres":"Action > Racing / Driving > Side view > Platform","desc":"<p>While taking a nap one fine day, Rayman was ambushed by a horde of mischievous, mad Rabbids! Secretly plotting over the years, they have at last unleashed their armies, ready to take over the world! They've captured Rayman and all of his friends, stolen Rayman's fists, and scattered the precious Lums far and wide! Guess who has to save the day once again?</p><p>Unlike the console version of Rayman Raving Rabbids, the Game Boy Advance version of the game sticks to its classic side scrolling platformer roots, like the original Rayman. Rayman can jump, glide with his hair for short distances, hurl his fists or throw a charged punch, pick up and hurl explosive barrels and other items, and even grapple onto special purple Lums, using them to swing.</p><p>New to <em>Rayman Raving Rabbids</em> is Rayman's ability to gain special powers by changing into different costumes based on musical styles, such as hip-hop, punk, pop and rock. Each costume gives Rayman a specific ability which allows him to reach areas he previously couldn't and defeat enemies.</p>"},{"name":"Razor Freestyle Scooter","year":2001,"developer":"Crawfish Interactive Ltd."},{"name":"Ready 2 Rumble Boxing: Round 2","year":2001,"developer":"Crawfish Interactive Ltd.","url":"a#R.zip/R%2FReady%202%20Rumble%20Boxing%20-%20Round%202%20%28E%29%20%28M3%29.gba","filesize":1,"score":6.4,"genres":"Sports > 3rd-person (Other) > Boxing","desc":"<p><em>Ready 2 Rumble Boxing: Round 2</em> features eleven boxers. Eight boxers (Afro Thunder, Lulu Valentine, \"Raging\" Rivera, Jet \"Iron\" Chin, Mama Tua, Johnny Blood, Robox Rese 4, and Joey T.) are available from the start and three more are unlockable as additional boxers (two of them being real life celebrities).</p><p>Arcade mode lets the player jump in the ring straight away and lets them box their way through several matches. Survival mode is similar to the Arcade mode, except the player's health isn't restored from the previous match so it becomes a test of endurance.</p><p>The Championship mode is the most in depth mode for this game. It lets the player take their boxer from the start of their career to their final championship match. Between matches, the player has to train their boxer. Training involves exercise mini-games like weightlifting, using the speed bag, and heavy bag. Depending on how the player performs at these tasks will effect how much stats like their boxer's stamina, speed, and power will increase.</p><p>Before a fight, boxers are introduced in the boxing ring by announcer Michael Buffer. During a fight, each boxer has two meters they have to pay attention to. One meter measures their health and the other measures their stamina. A boxer losing all of their health will get knocked down. The stamina meter measures how strong a punch is thrown. It will drain each time a boxer throws a punch and will slowly refill while not throwing punches, so it's better to throw punches to land with as much power as possible then to throw punches wildly as they will lose their potency as the boxer starts tiring. Taunting an opponent will earn a boxer letters that will eventually spell out the word \"Rumble\". Once the word is filled out, the player can unleash a flurry of punches on their opponent which doesn't cost their boxer any of their stamina for a limited amount of time.</p><p>After a match, the fight stats are shown and list things like the number of punches thrown and punches landed, punch accuracy, and the total number of knockdowns given to the opponent.</p>"},{"name":"Reaxion","year":2007,"developer":"Cosine Systems"},{"name":"Rebelstar: Tactical Command","year":2005,"developer":"Codo Technologies Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Rebelstar%20-%20Tactical%20Command%20%28USA%29.zip","filesize":1,"score":7.5,"genres":"Role-playing (RPG) > Strategy > Isometric > Turn-based > Sci-fi / futuristic","desc":"<p><em>Rebelstar: Tactical Command</em> is a turn-based strategy game in the same vein as X-Com, and is based off the Rebelstar strategy game setting. The developer, Codo Technologies, is composed of staff who have worked on games such as Laser Squad Nemesis, X-Com, and the original Laser Squad and Rebelstar Raiders. R:TC offers a similar style of play, and it may appeal to fans those titles and turn-based strategy games.</p><p>In <em>Rebelstar: TC</em>, players take control of a squad of 6 soldiers in a series of battles against an alien oppressor. The main character is Jorel, a young recruit to the rebel cause against the antagonist Arelian species. As the game and story progresses, Jorel will rise up the ranks to lead and recruit additional characters, each with a particular specialization of skills. In addition to fighting the Arelians, players will also do battle with the brutish shock troops of the Zorn, the insect-like Fraylar, and a variety of lesser creatures and robots. </p><p>Gameplay revolves around the player completing a series of battles in order to progress the plot. Prior to the start of most missions, players must select the characters that will participate in the battle and equip them appropriately. <em>Rebelstar: TC</em> offers a wide range of weapons, including melee, assault rifles, SMGs, sniper rifles, and heavy weapons. Firearms may also offer different firing modes, such as single shot, limited burst fire, and full automatic. Other equipment include different types of body armor, grenades, power cells, and medical kits. Characters have a number of statistics that govern their movement, speed, weapon use, stealth, and other skills. As the game proceeds and characters perform various actions, they gain experience points and level up. Each level up provides an opportunity for the player to add skill points to a chosen skill. The greater the skill rating, the better the character can perform or utilize weapons and equipment.</p><p>The battles themselves are turn-based in nature, with the player moving and performing actions with his characters, then the enemy side doing the same once the player is done. Each character has a pool of \"Action Points\" to spend on actions during a turn. A character can thus perform a series of actions until he or she runs out of points. These action points refill at the beginning of the player's next turn. Players can also spend all of the character's points to place him on \"Overwatch.\" On this mode, a character will spend his stored action points on firing on any enemy that comes into his view, which is useful if you wish to have a character cover certain areas. Battles also take into account line of sight, terrain deformation (ie: walls blown up by explosives), and morale. All of these features give quite a number of tactical options and considerations to the game.</p>"},{"name":"Reign of Fire","year":2002,"developer":"Crawfish Interactive Ltd.","url":"a#R.zip/R%2FReign%20of%20Fire%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Isometric > Direct control > Fantasy > Post-apocalyptic > Licensed","desc":"<p>2024 AD: In a post-apocalyptic world, mankind struggles to survive under a reign of fire from the skies. You must lead a dangerous crusade to bring these flying beasts to their knees.</p>"},{"name":"Rescue Heroes: Billy Blazes","year":2003,"developer":"WayForward Technologies, Inc.","url":"a#R.zip/R%2FRescue%20Heroes%20-%20Billy%20Blazes%21%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Action > Side view > Licensed","desc":"<p>A lightning bolt has ignited out-of-control fires everywhere! Take control of Billy Blazes on an adventure fighting fires in the forest, village and city. Billy Blazes runs, jumps, swings and dodges hazards as he quenches fires and rescues stranded victims.</p><p>The game features multiple gadgets including Billy's Fire Hose, Axe, Ladder, Grappling Hook and Sliding Hook. Time Trial modes and vehicle levels add to the variety.</p>"},{"name":"Revenge of Shinobi, The","year":2002,"developer":"3d6 Games, Inc.","url":"7#The%20Revenge%20of%20Shinobi%20%28EU%29%20%5BEn%2CFr%2CEs%2CDe%2CIt%5D.gba","filesize":8388608,"score":5.2,"genres":"Action > Side view > Platform > Martial arts","desc":"<p>Set in the mythical world of ancient Japan, players take on the role of ninja warrior Shinobi. To free the world from the curse of Goaku, Shinobi must recover 5 elemental swords and defeat the Shoguns who wield them. It will take stealth, strength, and the mastery of the mystic arts for Shinobi to battle his way through the 5 lands.</p>"},{"name":"Rhythm Heaven Silver","year":2006,"developer":"Nintendo SPD","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Rhythm%20Heaven%20Silver%20%28Japan%29%20%5BT-En%20by%20W%20hat%20Beta%2013a%5D%20%5Bn%5D.zip","filesize":1,"score":7.8,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Rhythm Tengoku</em> is a music game based around good timing and rhythm. The game has music supplied by the record production company J.P. ROOM, and is developed by the team responsible for Wario Ware. This is visible in the quirky presentation of the game.</p><p>As with Wario Ware, the game is actually a series of shorter games bundled into one package. Before each game starts, you are presented with a short tutorial that gets you ready and practice before you begin the real thing. Control is normally very simple - usually, only the A Button is required, but some games make players press multiple buttons for different actions.</p><p>Players will punch in time with a karate expert as pots and rocks are thrown; pluck hairs off of an onion; march in time to an instructor; hit a baseball while the screen zooms in and out; shoot ghosts with arrows; chop demons as a samurai; and much more. At the end of each set of stages is a 'remix stage' - in this stage, sections of the previously played stages are combined and thrown at you at random, all while a single song plays.</p>"},{"name":"Ride the Tuft","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"River City Ransom EX","year":2004,"developer":"Technos Japan Corp.","url":"7#River%20City%20Ransom%20EX%20%28USA%29.gba","filesize":4194304,"score":7.9,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > RPG elements > Contemporary > Comedy > Martial arts > Regional differences","desc":"<p>The evil Slick has kidnapped Ryan's girlfriend and taken over the high school. The player is cast as either Ryan or Alex (second player) and has to fight his way through River City's merciless gangs before confronting Slick and freeing his girl. </p><p><em>River City Ransom</em> is a side-scrolling beat-em-up similar to Double Dragon. The player, or players, travel through the locations of River City, encountering various gangs along the way. Gang members can be defeated with punches and kicks, or beaten up with objects scattered around. Upon their defeat, gang members drop money which Alex and Ryan can spend in malls to buy items that restore health and improve their combat abilities. The main characters have RPG-like numerical stats that can be improved this way, and can also buy books to learn combat manoeuvres. To finish the game, the player(s) have to find and defeat all the bosses. </p><p>The Game Boy Advance port of the game adds a number of features, including the ability to recruit certain characters (including defeated bosses) to fight alongside you. It also has different gangs and several new weapons.</p>"},{"name":"Riviera: The Promised Land","year":2004,"developer":"Sting, Inc.","url":"a#R.zip/R%2FRiviera%20-%20The%20Promised%20Land%20%28U%29.gba","filesize":1,"score":7.6,"genres":"Role-playing (RPG) > Isometric > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Quick Time Events (QTEs) > Fantasy","desc":"<p>During the great Ragnarok war, the gods of Asgard were overrun by demons from Utgard. In order to save the rest of the world from demons, the gods sacrificed their lives to create Grim Angels, black-winged warriors armed with sacred weapons known as \"Diviners\". The Grim Angels defeated the demons, and turned Utgard into a beautiful land, Riviera. </p><p>Thousand years later, a rumor concerning the demons' return begins to spread. Hector, one of the seven Magi entrusted by the gods to watch over Riviera, sends the Grim Angels Ein and Ledah there, ordering them to activate the \"Retribution\", a power that would eliminate the demons but also destroy Riviera. Ein is defeated by Ursula, Riviera's guardian, and wakes up with amnesia, unaware of his past and the role he will have to play in the future of the land.</p><p><em>Riviera: The Promised Land</em> is a Japanese-style role-playing game. Unlike most RPGs, it does not allow the player to physically navigate a character to explore the game world. Instead, the player activates \"triggers\", i.e. events that lead to cutscenes, combat, items, etc., by spending special trigger points earned during battles. This is done by investigating areas, moving from screen to screen. </p><p>Once a turn-based battle is triggered, the player selects three active combatants out of the available five, selects a formation for the party (attack- or magic-oriented), and chooses which four items to bring into the battle. The items activate skills for various characters; if a character has been trained with that item, he or she can use powerful \"OverSkills\" by gradually filling the OverDrive gauge. Items can be used a limited amount of times before they break.</p><p>The game also contains dating gameplay elements. The player can make decisions for Ein concerning his female companions, raising or lowering their trust level and eventually reaching one of the multiple endings determined by the relationships between Ein and the young women in his party.</p>"},{"name":"Road Rash: Jailbreak","year":2003,"developer":"Magic Pockets SAS","url":"a#R.zip/R%2FRoad%20Rash%20-%20Jailbreak%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.2,"genres":"Action > Racing / Driving > Behind view > Motorcycle > Street racing","desc":"<p><em>Road Rash: Jailbreak</em> for the GBA features the classic Road Rash gameplay; motorcycle racing on busy streets, with dirty tricks both allowed and expected. Several game modes are included. Wild Race is a basic race, just you versus several computer bikers in a race to the finish line. Use your fists or items you find along the way to knock opponents off their bike and into the hands of law enforcement. Cop Patrol puts you into the shoes of Marshall Lee, to take down those no-good motorcycling thugs. Time Attack is pure racing; just you, the road, and a ticking clock. Survival mode doesn't allow you to restart a race if you lose, so you'll need to complete all races on the first try. Finally, a 2-player mode is included.</p><p>Three different characters are included, each with distinct strengths and a special weapon. Between races, you can upgrade your chosen character. Saving is possible through passwords, and both your current upgrades and unlocked tracks will be remembered.</p>"},{"name":"Road Trip: Shifting Gears","year":2002,"developer":"Electronics Application Co., Ltd."},{"name":"Robot Wars: Advanced Destruction","year":2002,"developer":"Crawfish Interactive Ltd.","url":"7#Robot%20Wars%3B%20Advanced%20Destruction%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Action > Diagonal-down > Game show / trivia / quiz > Licensed","desc":"<p><em>Robot Wars</em> is a game based on a BBC television series where you control robots and engage them in combat with other ones in the four modes of the game. </p><p>In the Quickstart mode the CPU allows you to quickly step into battle by randomly selecting two robots from the ones available for a versus fight.   </p><p>The Robot Workshop is where you can create and save up to four unique robot models and have them compete in any mode you choose.  </p><p>From the Games mode you can select one of the following three: Championship, Vengeance Battle and Robot Mayhem.</p><ul><li>Championship is the place where you’ll play against other robots to unlock more models.</li><li>In Vengeance Battle you can choose your robot along with the opponent’s one and also the arena that you want to play to.</li><li>Robot Mayhem gives you no time restrictions and one round where you must destroy as many enemy robots as possible.</li></ul><p>There’s also a Multiplayer mode where up to four players can compete via the link cable.</p>"},{"name":"Robot Wars: Extreme Destruction","year":2002,"developer":"Warthog Plc","url":"a#R.zip/R%2FRobot%20Wars%20-%20Extreme%20Destruction%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29%20%5Bb%5D.gba","filesize":1,"score":"","genres":"Action > Simulation > Sports > 3rd-person (Other) > Game show / trivia / quiz > Mecha / giant robot > Licensed","desc":"<p><em>Robot Wars 2: Extreme Destruction</em> brings together all the elements of the TV show. Players can design and build their own robots, drawing upon a database of body parts, armour, engines, wheels and weapons. Once complete, battle can commence. The game also features a quick-start pick-up-and-play function, so gamers can select from a range of pre-built robots and get straight to the realistic 3-D action in new and improved arenas including desert outpost, sub-zero station, iron foundry and acid factory. </p><p>There are 10 different game types, including robot football and sumo competitions. The RefBot oversees the destruction, while the most popular of the US robots and a range of new competitor robots join the fray. With the use of a link cable, GBA Roboteers can fight one another across the variety of 3-D landscapes; with secret component stores unlocked by successful play, Extreme Destruction includes the ability to trade rare weapons and useful robot body parts with other players, the ultimate goal being to find all the parts to the mythical Gold Robot.</p>"},{"name":"Robotech: The Macross Saga","year":2002,"developer":"Lucky Chicken Games, Inc.","url":"7#Robotech%3B%20The%20Macross%20Saga%20%5BEn%2CFr%2CDe%2CIt%2CEs%2CNl%5D.gba","filesize":8388608,"score":6.4,"genres":"Action > 3rd-person (Other) > Side view > Top-down > Anime / Manga > Shooter > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>A classic 2D shooter based on the Robotech license that mixes side-scrolling and forced perspective gameplay.  Select from 4 characters initially.  There are a total of 6 side scroll and 2 forced perspective levels.  The characters each have 5 abilities that the player can upgrade with experience points earned based on performance in each level.  There are both cooperative (2 player) and deathmatch (4 player) multi-play modes supported via the link cable.  </p>"},{"name":"Robots","year":2005,"developer":"Griptonite, Inc.","url":"a#R.zip/R%2FRobotech%20-%20The%20Macross%20Saga%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":5.7,"genres":"Action > Racing / Driving > Diagonal-down > Platform > Sci-fi / futuristic > Licensed","desc":"<p>Based on the Blue Sky film (distributed by Fox) of the same name,Robots takes players on an adventure to save Robot city. When Rodney Copperbottom travels to Robot City to meet Big Weld, the famous inventor, he finds that something is wrong. Big Weld is missing and the evil Ratchet has taken over Big Weld Industries. With the help of his friends the Rusties, Rodney puts an end to Ratchet's villainous ways and restores order to the city.</p><p>Robots uses a unique perspective that combines 2D side-scrolling with 3D views. The game takes the player to locations from the movie like Robot City, Big Weld's Mansion, the Outmode, and Madame Gasket's Chop Shop. Using the invention mode, players build and upgrade Rodney's weapons including the wrench, scrap gun, electro zapper, and magno grenade. With a combination of navigation, jumping, and combat skills, players can make their way though the world of Robots and bring an end to Ratchet's tyranny.</p><p>In addition to the main story line, players will find robots in need all over the city. The parts these poor robots are missing can be found hidden in the numerous maps and returning the correct part rewards the player with power-ups and weapon upgrades. All of the maps are interconnected, so players can easily find their way back to a previous area to uncover additional secrets.The maps are connected with a transit ball mini-game, just like the transit system in the movie.</p><p>The DS version of the game features a map that can be annotated by the player, a unique 3D version of the transit ball game that utilizes the stylus for control, and 3D menus. In addition to the new features, the DS also includes high resolution maps that include more detail than the GBA version.</p>"},{"name":"Rock 'Em Sock 'Em Robots","year":2006,"developer":"Full Fat Productions Ltd.","url":"7#Rock%20%27Em%20Sock%20%27Em%20Robots%20%28EU%29%20%5BEn%2CFr%2CDe%2CIt%2CEs%5D.gba","filesize":4194304,"score":4.5,"genres":"Action > 3rd-person (Other) > Fighting > Sci-fi / futuristic > Licensed","desc":"<p><em>Rock 'Em Sock 'Em Robots</em> is a handheld fighting game based on the toy line of the same name. It's a one-on-one fighting game where the player takes control of a robot inside a boxing ring and battles against other robots. Each robot has a special move that can be used after filling up a special bar. By combining different button presses the player can unleash a robotic rampage for extra damage against the enemy. It's also possible to do charged punches by holding down the attack button. Once one of the robots has lost all of its health, a concussion mini game is started. Here the player can perform a finishing move by alternately tapping the L and R buttons. </p><p>Three game modes exists. The classic mode where the player can choose to play as either the Red Rocker or the Blue Bomber is a one-off game. In the versus mode it's possible to choose from some additional robots as well as some different arenas. In the title fight mode, the player starts out with the Red Rocker and then has to unlock the other by winning the fights against them.</p>"},{"name":"Rock n' Roll Racing","year":2003,"developer":"Blizzard Entertainment Inc.","url":"a#R.zip/R%2FRock%20N%27%20Roll%20Racing%20%28E%29.gba","filesize":1,"score":8.3,"genres":"Action > Racing / Driving > Diagonal-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Rock 'n Roll Racing</em> is an arcade combat racing game. Combat plays a heavy role in the game, as each car has a frontal weapon, such as a laser or missile, and a drop weapon, such as spikes or mines. As you complete races, you get more money to upgrade your car. The soundtrack features famous rock tracks such as \"Born to Be Wild, \"Bad to the Bone,\" \"The Peter Gunn Theme,\" \"Highway Star\" and \"Paranoid.\"</p><p>The game is very similar to RPM Racing. The later released PC version is an official release, but based on the SNES version incorporating the ZSNES emulator and limited to three tracks.</p>"},{"name":"Rockman EXE 4.5 Real Operation","year":2004,"developer":"Capcom Production Studio 2"},{"name":"Rockman EXE 4.5 Real Operation Battle Chip Gate Pack","year":2004,"developer":"Capcom Production Studio 2"},{"name":"Rocky","year":2002,"developer":"Rage Games Ltd.","url":"a#R.zip/R%2FRocky%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.8,"genres":"Sports > Side view > Boxing > Licensed","desc":"<p><em>Rocky</em> is a boxing game that was inspired by the first five Rocky movies.</p><p>The main mode is called Movie mode which follows Rocky's career from small-time boxer to champ. There are 20 opponents from the movie for Rocky to fight. Beating certain boxers will unlock cutscenes inspired by the movies and is basically the games narrative moments.</p><p>In this mode Rocky has to train before each match so his skills can improve. Training increases Rocky's strength, speed, stamina, and defense statistics. Training includes sparring with a padded trainer, hitting the heavy bag, or punching the speed bag. These activities can be done manually or automatically as the player so chooses. When in the ring Rocky can throw left and right punches, do combos, and can dodge punches.</p><p>Other modes include Exhibition mode, Knockout mode, and a 2 player Versus Mode. In exhibition mode players can fight any boxer they unlocked from the Movie mode and they also have the option to select the venue, the round length, the number of rounds, and the computer's difficulty level. Knockout mode is unlocked only after Movie mode is completed. It is basically a survival mode in which the player selects a series of fighters against whom to compete for belts in a tournament.</p>"},{"name":"Rolling Voltorb","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Romance of the Three Kingdoms IV: Wall of Fire","year":2001,"developer":"KOEI Co., Ltd."},{"name":"Rotohex","year":2006,"developer":"Skip, Ltd."},{"name":"Rotris","year":2002,"developer":"Yarin Productions AB"},{"name":"Rugrats: Go Wild","year":2003,"developer":"ImaginEngine Corp.","url":"a#R.zip/R%2FRugrats%20-%20Go%20Wild%20%28U%29%20%5BhIR00%5D.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > Top-down > Platform > Licensed","desc":"<p><em>Rugrats Go Wild</em> is based on the 2003 animated film of the same name, which crosses over the Nickelodeon TV series <em>Rugrats</em> and <em>The Wild Thornberrys</em>. It is broadly similar to the movie's adaptation for PC, but has its own interpretation of the movie's story and unique level design and gameplay.</p><p>Both the Rugrats and the Thornberrys are stranded on an uninhabited island after a storm wrecked their ship. Players will control Timmy, Eliza and Lil &amp; Phil on their quest to find missing family members. The maze-like island is seen from an overhead view. When another character is found, they usually offer a fetch mission - finding items like fish, magazines, boots, keys, etc. When the item is found and returned, either the path to the next level or a mini-game will open up. Most of the mini-games fall into two categories: a side-scrolling platformer and a top-down racing game. </p><p>In the platformer, the goal is to defeat a number of animals by throwing gooshy balls at them. The balls can be collected both on the main island map as well as in the side-scrolling levels. Once all animals are defeated, a fight against a tougher boss follows. The racing game has varying objectives, like chasing an animal or collecting a number of objects on the track. Once that goal is reached, there is also a boss confrontation: the boss is trying to catch the player and the goal is to keep away from him until a time limit runs out. Completing a mini-game will usually award an item that another character needs.</p><p>Should the player get hurt during a mini-game, glowing balls can be collected to refill the health bar (represented by a milk bottle for the Rugrats and a water bottle for Eliza Thornberry). An overview map of the whole island can be used to quickly move to places already explored. Progress in the game is saved via passwords.</p>"},{"name":"Rugrats: Castle Capers","year":2001,"developer":"Software Creations Ltd.","url":"a#R.zip/R%2FRugrats%20-%20Castle%20Capers%20%28U%29.gba","filesize":1,"score":7.1,"genres":"Action > Side view > Platform > Licensed","desc":"<p><em>Rugrats: Castle Capers</em> is based on the Daytime Emmy-award winning animated television series Rugrats.</p><p>Angelica has claimed herself queen of the castle that Stu Pickles built. She has hid all the Rugrats' toys inside. In six side scrolling levels you have to reclaim what is lost. At the end of each level the players will find one of the items that Angelica has taken.</p><p>During the levels the player can collect food which can be used to divert enemies like squirrels and cuckoo birds. You can choose which Rugrat you want to play, but you will encounter the others along your way as NPCs. You have to finish the game with the Rugrat you chose. You can also collect diapers, coins and cookies to increase your life.</p><p>The Rugrats can walk, climb, jump and sometimes fly through the levels which each have a unique theme.</p>"},{"name":"Rugrats: I Gotta Go Party","year":2002,"developer":"Eurocom Developments Ltd","url":"a#R.zip/R%2FRugrats%20-%20I%20Gotta%20Go%20Party%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > Top-down > Board game > Licensed","desc":"<p>Help Tommy search for the rest of the Rugrats in a game of hide n'seek: for each Rugrat found, a game is unlocked. Mostly designed for multiplayer competition (1-4 player support), this party game is based on the Rugrats universe and contains 24 different mini-games, including among others a racing game, a jigsaw puzzle, a Columns-inspired game and a Pac-Man clone.</p>"}]