[{"name":"Saban's Power Rangers: Time Force","year":2001,"developer":"Engine Software B.V.","url":"7#Power%20Rangers%20Time%20Force%20%28USA%2C%20Europe%29.gba","filesize":4194304,"score":6.4,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Martial arts > Licensed","desc":"<p>The color costumed team of teen heroes travels through both space and time to thwart occurrences of evil throughout history in this Game Boy Advance release from THQ. The Power Rangers move back and forth through time to stop evil and keep the future safe in over 15 levels of play. Each character has unique combat abilities and the game features a Megazord battle mode as well. The story is advanced through comic book styled cut scenes and a password feature allows gamers to save their progress between sessions.</p>"},{"name":"Sabre Wulf","year":2004,"developer":"Rare Limited","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Sabre%20Wulf%20%28USA%29.zip","filesize":1,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>The amulet that had been in place to imprison Sabrewulf has been shattered by the evil Dr. Dolittle-Goode. Now, it is up to Sabreman to traverse the land in pursuit of these villains; and to retrieve the eight pieces of the amulet.</p><p>The game is separated into two modes of play: the 3D exploration mode and the 2D platforming sections. The 3D exploration mode is how Sabreman gets around the eight different themed worlds of Sabre Wulf. While there are no enemies in this mode, there are plenty of people to talk to, who might help you in your quest. Also strewn about are more than fifty 2D platforming levels, which you can access through the wulf's head tunnels.</p><p>The point of the 2D levels is to get the Wulf's treasure through a mixture of platforming and puzzle solving. Sabreman can jump, but he can't attack on his own. That is why he'll need to use the abilities of the fifteen different creatures found in the game. The creatures' abilities range from offensive power to getting Sabreman to a higher ledge. Learning when to use these abilities is essential to navigating the Wulf's Lair, and claiming the treasure as your own. </p>"},{"name":"Sabrina, the Teenage Witch: Potion Commotion","year":2002,"developer":"Ubi Soft Entertainment Inc.","url":"a#S.zip/S%2FSabrina%20-%20The%20Teenage%20Witch%20-%20Potion%20Commotion%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":6.5,"genres":"Action > 3rd-person (Other) > Side view > Licensed","desc":"<p>Sabrina The Teenage Witch: Potion Commotion is a 2D side-scrolling action/adventure based on the popular TV series. The player, with the help of Salem the cat, explore four worlds including the Spellman's house, a giant tree, the Pizzeria, and the school in search of items to help create a potion that will correct Aunt Hilda's errant spell and return the world to normal. 4 Minigames appear throughout the game.</p>"},{"name":"Salt Lake 2002","year":2002,"developer":"Ubi Studios UK","url":"a#S.zip/S%2FSalt%20Lake%202002%20%28E%29%20%28M6%29.gba","filesize":1,"score":6.3,"genres":"Sports > 3rd-person (Other) > Behind view > Diagonal-down > Side view > Direct control > Olympiad / mixed sports > Snowboarding / skiing > Licensed","desc":"<p><em>Salt Lake 2002</em> is the officially licensed game of the 2002 Winter Olympic Games. The Game Boy Advance version has its own selection of disciplines compared to the console version, with graphics and controls customized for the handheld.</p><p>Six different disciplines are available: Ski Jumping, Curling, Downhill Skiing, Bobsleigh, Snowboarding and Downhill Slalom.Different competitions are available: in Tournament Mode, players select one event and compete through four rounds, trying to best the feats of an (unseen) opponent. Olympic Mode is a competition for medals, through one or more events. Getting gold requires exceeding a certain score. Classic Mode consists of all six events in order. All target scores must be met/won in order to unlock higher difficulty levels for the other modes, with three lives available. There is also a time trial/ghost mode, in which players can try to beat their previous records. There is also a multiplayer mode for up to four players, taking turns on the same GBA.</p><p>Each discipline has its own perspective and controls: jumping requires keeping balance by keeping a red dot in a targeting reticle and then pushing a button for a good landing. Downhill, slalom and snowboard are all similar, seen from an overhead perspective and allowing the athlete to crouch for acceleration, break, and make hard turns. Acceleration for the bobsleigh is done from a side view, with the actual run then seen from an elevated view behind the bob, with a dot indicating the optimum position on the track. Curling is seen from a side view, with players controlling both the throw as well as the sweepers.</p>"},{"name":"Samurai Deeper Kyo","year":2002,"developer":"Marvelous Entertainment Inc.","url":"a#S.zip/S%2FSamurai%20Deeper%20Kyo%20%28J%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > Top-down > 2D scrolling > Isometric > Anime / Manga > Beat 'em up / brawler > Fantasy > Detective / mystery > Martial arts","desc":"<p><em>Samurai Deeper Kyo</em> is an overhead beat 'em up based on the popular anime of the same name. The player can play as Miibu Kyoshiro, Shiina Yuya, Benitora, or Yukimura Sanada, characters from the show, who are looking for the murderer of Shiina's brother, while trying to stop the evil Demon Eyes Kyo from entering Miibu's body. </p><p>The player has a CPU controlled partner character following during the game. All characters have their own weapons, and by preforming button combinations, they can perform an array of special attacks against the hordes of evil monsters the player has to defeat to progress through the linear levels.</p>"},{"name":"Samurai Jack: The Amulet of Time","year":2003,"developer":"Virtucraft Studios, Ltd.","url":"7#Samurai%20Jack%3B%20The%20Amulet%20of%20Time%20%5BEng%5D.gba","filesize":8388608,"score":6.3,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Puzzle elements > Japan (Ancient/Classical/Medieval) > Martial arts > Licensed","desc":"<p>Based on the Cartoon Network animated series, Samurai Jack has been sent to another place in time by his nemesis Aku. Attempting to find a portal home in order to restore time from the twisted reality he currently fights through, Jack discovers an amulet will aid him in returning home. However, pieces of the amulet have been placed all around the world, so it is up to Jack to find them.</p><p>You must explore every corner of each level to find pieces of the amulet, while fighting a range of powerful enemies using your sword and other weapons, while each piece of the amulet will give Jack new magical abilities that will aid his progess. When you recieve a new ability (such as doube jump), you can then enter areas that you previously could not reach.</p>"},{"name":"Sangokushi Eiketsuden","year":2005,"developer":"KOEI Co., Ltd."},{"name":"Sangokushi Koumeiden","year":2005,"developer":"KOEI Co., Ltd."},{"name":"Santa Claus Jr. Advance","year":2002,"developer":"NEON Software GmbH","url":"a#S.zip/S%2FSanta%20Claus%20Jr.%20Advance%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Side view","desc":"<p>Again it is Christmas but Christmas is in danger. A disgruntled witch has accursed all toys and now all the children hide from the vicious toys. Santa Claus will not be able to find all the children just in time. He needs help. Young Nick is the one who will help Santa Claus. His job is to find the hidden boys and girls and to deliver their presents. While doing this he has to avoid all the belligerent toys.</p><p><em>Santa Claus Jr. Advance</em> is a classical platformer. Nick has to avoid snowballs thrown by Yetis, bouncing basketballs, wild mountain goats, hit mechanical shovel excavators, climb on chains, jump away from avalanches, and so on.</p>"},{"name":"Santa Claus Saves the Earth","year":2002,"developer":"Ivolgamus UAB","url":"a#S.zip/S%2FSanta%20Claus%20Saves%20the%20Earth%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control","desc":"<p>It's the night before Christmas, and Santa <em>should</em> be getting ready to deliver presents to children. Unfortunately, the evil fairy Nilam has found out how much people love Santa and she can't stand it - so she kidnaps him and traps him in her evil magical realm. Santa doesn't have long to escape and make it home in time to keep the children of the world happy!</p><p>This sidescrolling platformer has players controlling Sants through fifteen different levels on his way back to the North Pole. Santa can fight his way out using his bag of presents, which he can smack enemies with, and several different kinds of guns with different forms of ammunition. Each mazelike level has a key hidden within it, and Santa has to find it in order to unlock the exit.</p>"},{"name":"Santa Clause 3, The: The Escape Clause","year":2006,"developer":"1st Playable Productions, LLC","url":"a#S.zip/S%2FSanta%20Clause%203%2C%20The%20-%20The%20Escape%20Clause%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Based on the film of the same name, The Santa Clause 3: The Escape Clause sees players controlling Scott Calvin in a platforming game that follows the movies events. Beginning as him firmly in his role as Santa Claus, early levels are devoted to exploring icy levels at the North Pole, collecting cookies and milk while avoiding hazards like spiky ice and enemies. Players only need to reach the end of the levels to complete them, the game capping off most of its chapters with minigames like elves navigating a haywire workshop to build a scooter or playing as Santa flying his sleigh to deliver coal and presents to the appropriate households.</p><p>Villain Jack Frost aims to sabotage Santa's Christmas activities so he can steal the mantle of the legendary holiday figure for himself, leading to Scott Calvin having to navigate a few levels without his Christmas powers. Normally Santa can glide with his coat and attack with a jack-in-the-box, but Scott relies only on thrown snowballs to repel baddies and the double jump both he and Santa share for level navigation. Some levels will change away from the lax pace of free level exploration to add automatically scrolling screens to pressure players into fast movement.</p>"},{"name":"Santa's Chimney Challenge!","year":2005,"developer":"Paradise Games"},{"name":"Scooby Doo","year":2002,"developer":"Helixe","url":"a#S.zip/S%2FScooby-Doo%21%20%28E%29.gba","filesize":1,"score":6.9,"genres":"Action > Diagonal-down > Isometric > Licensed","desc":"<p>The Scooby Gang must solve the mysteries of Spooky Island. Based on the live action motion picture, players must reunite the bickering gang, solve mysteries and fight the island demons. Every member of Mystery, Inc. is available as a playable character with different abilities; Velma solves puzzles (mini-games) and can go unnoticed, Fred can fight, Daphne knows karate, Shaggy and Scooby can run, and run even faster, leaving enemies spinning in place. The player switches between each available character, as few as two, up to then entire Scooby Gang of Five, to progress through the world. Talk to people, collect clues and Scooby Snacks and solve the mysteries (quests) they present you, and fight off the monsters that have taken over Spooky Island.</p><p>In addition to the main gameplay, 4 mini-games are included, each of which aid the player in advancing through the game, by opening chests, turning on lights, fixing pipes and such.</p>"},{"name":"Scooby-Doo 2: Monsters Unleashed","year":2004,"developer":"Altron Corporation","url":"a#S.zip/S%2FScooby-Doo%21%202%20-%20Monsters%20Unleashed%20%28E%29%20%28M5%29.gba","filesize":1,"score":5.6,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Scooby-Doo 2 starts your story of Scooby and the gang at a museum where they are donating masks and costumes of every crook they have caught.  In each level, you must complete the objectives given to you as you move through this side scroller platform game.</p><p>You have the ability to jump, attack, climb, and more as you move through each level from start to finish.  Don't let your courage meter drop too low, or you will have to start over.  It acts like a life meter in other games.</p><p>Collect Scooby Snacks along the way and if you get them all, you get an extra life.  Once you complete your objectives and make it to the end of the level, a box of Scooby Snacks will appear allowing you to leave the level and move on to the next.</p>"},{"name":"Scooby-Doo and the Cyber Chase","year":2001,"developer":"Software Creations Ltd.","url":"a#S.zip/S%2FScooby-Doo%21%20and%20The%20Cyber%20Chase%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Side view > Platform > Licensed","desc":"<p>The Mystery Inc. gang meet with their friend, Eric Staufer, a computer science major at the university, who created a laser that has the ability to send people into cyberspace. A video game featuring Scooby and the gang was designed to test the laser, but during the test, a Phantom Virus has escaped from cyberspace, and begins wreaking havoc in the university. Can Mystery Inc. stop the Phantom Virus, and find out who is responsible for releasing it?</p><p>In <em>Scooby-Doo and the Cyber Chase</em> for Gameboy Advance, you must discover the identity of the suspect responsible for unleashing the Phantom Virus. This is done by navigating seven levels; the main lab level, which contains CDs, grant access to six additional levels, which may only be reached via the computer in cyberspace, and the laser in the robotics lab section of the main level sends a character there. Each member of the Mystery Inc. gang is available, but only one character may play at a time. Only two CDs are available at the start. Two additional CDs are gained upon completion of a computer level, which appear in the main lab level in the Computer Lab room, and when picked up unlocks more computer levels in the game to complete. You cannot enter the computer levels unless you pick up the CDs from the main lab level.</p><p>Each level consists of various pick-ups: disguises, which helps you sneak past the various monsters on each level, smiley faces, which increases your character's health, Scooby Snacks, including a counter telling you how many are needed to finish the level, and a Scooby Snacks Box, which appears after picking up enough Scooby Snacks, allowing you to successfully complete the level. Level bosses either contain classic Scooby villains, or the Phantom Virus; the villains must be defeated to complete the level, the Phantom Virus cannot be defeated until the final level, and must be avoided until you pick up the Scooby Snacks Box. Contact with monsters, villains and the Phantom Virus' electric bolts will reduce your character's health; if a character's health is gone, that character is captured in cyberspace, and another character will have to try the level.</p><p>Points are earned for collecting Scooby Snacks, and evading the monsters. Clues are also collected during the game; the game saves via a password system, which records your collected clues, turns (remaining characters), and your score after each level. After finishing the final level, the game will ask you which of the four suspects in the game was responsible for unleashing the Phantom Virus. You win the game if you correctly identify the suspect who released the Phantom Virus based on the clues you've collected during the game.</p>"},{"name":"Scorpion King, The: Sword of Osiris","year":2002,"developer":"WayForward Technologies, Inc.","url":"a#S.zip/S%2FScorpion%20King%2C%20The%20-%20Sword%20of%20Osiris%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7,"genres":"Action > Side view > Platform > Classical antiquity > Licensed","desc":"<p>A platform adventure based on the world and characters of the movie The Scorpion King. Mathayus (The Scorpion King) must rescue his wife, Cassandra, from the hands of the evil warlord Menthu, who whishes to use Cassandra's magical abilites for his own evil purpose. </p><p>Using a Gauntlet, Mathayus can increase his attacking speed and power by feeding it magic gems, collected by defeating boss characters in 6 different worlds, with traps and enemy characters littering each level.</p>"},{"name":"Scrabble Blast!","year":2005,"developer":"Visual Impact"},{"name":"Scurge: Hive","year":2006,"developer":"Orbital Media, Inc.","url":"a#S.zip/S%2FScurge%20-%20Hive%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":7.1,"genres":"Action > Top-down > 2D scrolling > Isometric > Metroidvania > Shooter > Sci-fi / futuristic","desc":"<p>When bounty hunter Jenosa Arma takes on a mission to investigate Planet Inos, a research center investigating an alien lifeform called Scurge, she gets more than she bargained for. While in orbit around the planet, she is attacked and quickly infected with the Scurge herself. Jenosa has no alternative but to land onto Inos, to investigate the Scurge and find a cure.</p><p><em>Scurge: Hive</em> is an action game with some similarities in storyline to Nintendo's Metroid series. However, the game itself is significantly different from Metroid. As Jenosa, players must blast their way through Planet Inos while trying to constantly contain their own infection. While progressing through the game, Jenosa's 'infection meter' slowly increases (faster if she is standing on red patches of Scurge) - the meter can only be reduced back to 1% by using a Decontamination Platform, which also acts as a save point. Failing to temporarily cure Jenosa of the Scurge results in rapid depletion of life as the virus takes over, so players must complete mission objectives quickly!</p><p>Jenosa can earn experience as she blasts infected life forms; this experience will upgrade her firepower and health. Better weaponry can be found, as well as gadgets which help Jenosa access new areas. Some weapons are twice as effective on particular opponents; inversely, they are ineffective against other enemy types. It's up to you to figure out the best weapon for the right situation.</p>"},{"name":"SD Gundam Force","year":2004,"developer":"Tom Create Co., Ltd.","url":"7#SD%20Gundam%20Force%20%28USA%29.gba","filesize":8388608,"score":"","genres":"Action > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>Hurry and save Neotopia before it's conquered by an evil ancient empire!</p><p>Battle across 3 worlds to defeat the Dimensional Pirates!</p><p>Featuring characters from the hit TV show play as Captain Gundam, Zero the Winged Knight or Bakunetsumaru to save Neotopia!</p><p>Play as a Zako Soldier!</p>"},{"name":"SD Gundam G Generation: Advance","year":2003,"developer":"Vanguard Works","url":"a#S.zip/S%2FSD%20Gundam%20-%20G%20Generation%20Advance%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Strategy > Top-down > Isometric > Turn-based > Sci-fi / futuristic > Licensed","desc":"<p><em>SD Gundam G Generation Advance</em> is a turn-based strategy game with some RPG elements. It is part of the <em>G Generation</em> sub-series of the Gundam franchise. In this series, Gundams, giant combat machines, have been reduced to super-deformed versions of their former selves.</p><p>The player commands small groups of units in battle. The game has 2 modes: in the first mode, units moves on maps, choose which enemy to attack, and merge into larger groups; in the second mode, \"battles\", the player chooses the type of attack for each unit and observes the results of duels. The story and characters are introduced by the many dialogues between missions.</p>"},{"name":"SD Gundam World: Gachapon Senshi - Scramble Wars","year":2004,"developer":"Sonata"},{"name":"Sea Trader: Rise of Taipan","year":2002,"developer":"Jaleco Entertainment, Inc.","url":"a#S.zip/S%2FSea%20Trader%20-%20Rise%20of%20Taipan%20%28U%29%20%5BhIR%5D.gba","filesize":1,"score":"","genres":"Simulation > Strategy > 3rd-person (Other) > Managerial / business simulation > Naval / watercraft","desc":"<p>\"Sea Trader: Rise of Taipan\" is a unique commodities trading game for the GameBoy Advance. Set against the backdrop of the 1840's Opium Wars between Britain and China, the player must command a trading ship and sail dangerous seaways across the world in order to find, purchase and sell exotic goods for the best price. The prize: a trading empire dominating the globe. The addictive gameplay of \"Sea Trader\" hearkens back to classic trading games such as \"Taipan\" and \"Dope Wars\", but has much improved graphics and is more action-oriented and engaging.</p>"},{"name":"Secret Agent Barbie: Royal Jewels Mission","year":2002,"developer":"Digital Illusions Canada, Inc.","url":"a#S.zip/S%2FSecret%20Agent%20Barbie%20-%20Royal%20Jewels%20Mission%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Stealth > Spy / espionage > Licensed","desc":"<p>Team up with Secret Agent™ Barbie™ on another super-spy adventure! Royal emeralds, rubies and diamonds are disappearing all over the world - England, China, Italy and Mexico, and the clues point to one crafty crook. But why would anyone be taking all these jewels? It's up to you and Secret Agent™ Barbie™ to find out. Join Barbie™ as she traces clues around the globe, keeping her cover and cleverly outwitting the villain once and for all! Only you can help Barbie™ unravel the mysterious plot and save the day!</p>"},{"name":"SEGA Arcade Gallery","year":2003,"developer":"SEGA Corporation","url":"a#S.zip/S%2FSega%20Arcade%20Gallery%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.8,"genres":"Compilation","desc":"<p>This compilation includes the following games on a single cartridge:</p><ul><li>Outrun</li><li>Space Harrier</li><li>Super Hang On</li><li>After Burner</li></ul>"},{"name":"SEGA Rally Championship","year":2003,"developer":"Dice Co., Ltd.","url":"a#S.zip/S%2FSega%20Rally%20Championship%20%28E%29.gba","filesize":1,"score":6.5,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p>Sega Rally makes its debut on the handheld format with this GBA rendition. Choose from a number of fully licensed rally cars (Subaru, Ford, Toyota, Mitsubishi, etc.) and hit the rally tracks.</p><p>You'll find a number of different terrains, from dirt to snow, country roads to jungle hills. The aim is to cross the finish line with the best time possible, beating out the opposition to the main prize. You'll have the chance to upgrade and repair your car as you go, which is important if you want to find the reach the line first. The more you win, the more you'll unlock. From new cars and tracks to mini-games and galleries.</p><p>A four player mode is also included, where you can challenge your friends in a competitive rally.</p>"},{"name":"SEGA Smashpack","year":2002,"developer":"","url":"a#S.zip/S%2FSega%20Smash%20Pack%20%28E%29.gba","filesize":1,"score":6.5,"genres":"Action > Compilation > Side view > Fighting > Pinball > Platform > Fantasy","desc":"<p>A compilation of three Sega Genesis games, all of which make their debut on the Game Boy Advance.</p><ul><li>Golden Axe (with multi-player support via link cable)</li><li>Sonic the Hedgehog: Spinball</li><li>Ecco the Dolphin</li></ul>"},{"name":"Sennen Kazoku","year":2005,"developer":"indieszero Co., Ltd.","url":"a#S.zip/S%2FSennen%20Kazoku%20%28J%29.gba","filesize":1,"score":"","genres":"Simulation > Anime / Manga","desc":"<p>In <em>Sennen Kazoku</em>, the player assumes the role of Cupid, who has been assigned by God to watch over a family. Cupid's job is to protect them through the generations. Much of the game is spent watching the family members' daily lives. However, Cupid can also change the course of their lives. By using his arrows, he can change their attitudes and emotions by making them work harder, calming them down, and fall in love. The internal clock makes the game run even when it is powered off, so the family's life will never stop.</p>"},{"name":"Serious Sam","year":2004,"developer":"Climax Handheld Games","url":"a#S.zip/S%2FSerious%20Sam%20Advance%20%28E%29%20%28M3%29.gba","filesize":1,"score":5.8,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>The handheld version of <em>Serious Sam</em> differs from both its PC and console counterparts significantly. It uses a ray-tracing engine because of technical limitations, but like its console and PC brethren, focuses on fast-paced action, large groups of enemies and open spaces.</p><p>Scientists figure out how to use the timelock to send someone to any point in time, Sam travels back to ancient Rome as people haven't been returning from that period and ends up fighting Mental's minions once again. </p><p>The game has ten weapons and ten enemies, most of which are taken from the other <em>Serious Sam</em> games. It spans twelve levels.</p>"},{"name":"Shaman King: Legacy of the Spirits - Soaring Hawk","year":2005,"developer":"Konami Computer Entertainment Japan, Inc."},{"name":"Shaman King: Legacy of the Spirits - Sprinting Wolf","year":2005,"developer":"Konami Computer Entertainment Japan, Inc."},{"name":"Shaman King: Master of Spirits","year":2004,"developer":"Konami Computer Entertainment Japan, Inc.","url":"a#S.zip/S%2FShaman%20King%20-%20Master%20of%20Spirits.gba","filesize":1,"score":6.9,"genres":"Action > Role-playing (RPG) > Side view > 2D scrolling > Anime / Manga > Metroidvania > Platform > Licensed","desc":"<p>In this game you play Yoh Asakura from the Shaman King Japanese Manga and TV Anime series.  </p><p>Yoh is a shaman, one of the chosen few who can communicate with ghosts and spirits. When Yoh teams up with the ghost, Amidamaru, he begins his incredible quest to be crowned Shaman King in the Grand Tournament held only once every 500 years!  </p><p>Use Yoh's inherent ability to control ghosts and spirits in order to defeat his enemies. You will control various spirits such as \"Bason\" and \"Corey\" that appear in the original manga, avoid endless traps, conjure spirits and master your \"Shaman\" skills as you battle to defeat your enemies and stop a diabolical shaman from resurrecting the evil Guardian of Demons.</p>"},{"name":"Shaman King: Master of Spirits 2","year":2005,"developer":"Konami Corporation","url":"a#S.zip/S%2FShaman%20King%20-%20Master%20of%20Spirits%202.gba","filesize":1,"score":7.2,"genres":"Action > Role-playing (RPG) > Side view > 2D scrolling > Anime / Manga > Metroidvania > Platform > Licensed","desc":"<p>Sequel to the original Shaman King: Master of Spirits, you once again take the role of Yoh Asakura as you attempt to save all your friends and fellow shamans from Zeke's Fire Spirit, who is devouring the soul of everyone in Dobie Village, where the Shaman Tournament is to take place.</p><p>It's up to you to figure out a way to save your friends and foes, and defeat Zeke before he steals the title of Shaman King from your hands!</p>"},{"name":"Shamu's Deep Sea Adventures","year":2005,"developer":"Humagade Inc.","url":"a#S.zip/S%2FShamu%27s%20Deep%20Sea%20Adventures%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Puzzle elements > Licensed","desc":"<p>'Shamu's Deep Sea Adventures' is an action game where players must control Shamu the killer whale on a quest to save the SeaWorld theme park from the Greek god Poseidon (who plans to replace it with the lost city of Atlantis, as well as taking over the world).</p><p>The handheld games play much differently to the home console versions as players simply guide Shamu across a variety of levels using the control pad (or stylus for the Nintendo DS version) to swim, dash to defeat enemies and break objects, and even jump out of the water. Instead of a health bar, Shamu needs to collect plenty of crystals to protect him from a variety of enemies including puffer fish, sea anemones and even the evil Kraken. Voice acting is also absent in these versions and includes dialogue boxes instead for each character.</p><p>Each level is filled with crystals (to keep Shamu healthy), Atlantis tablets (important collectibles) and even treasure chests (in which finding every four unlocks a photo in the Art Gallery in the main menu). Most levels also include temporary objective items that Shamu can keep in the inventory to use later. The krill balls and oxygen bubbles are also omitted in the handheld games.</p>"},{"name":"Shaun Palmer's Pro Snowboarder","year":2001,"developer":"Natsume Co., Ltd.","url":"a#S.zip/S%2FShaun%20Palmer%27s%20Pro%20Snowboarder%20%28U%29.gba","filesize":1,"score":6.8,"genres":"Sports > Diagonal-down > 2D scrolling > Isometric > Arcade > Snowboarding / skiing > Licensed","desc":"<p>This handheld version is different from it's Shaun Palmer's Pro Snowboarder, but still features the same set up. The player chooses from a group of snowboarders that include Shaun White, Ingemar Backman, Tara Dakides and the game's namesake, Shaun Palmer with 16 different tracks in four different locations and authentic snowboards with more being unlocked through gameplay. There are a variety of game modes that include <em>Tutorial</em>, <em>Free Ride</em> and <em>VS</em> that allows two players to compete head-to-head and a <em>Career</em> mode.</p><p>There are a variety of styles, each with their own set of rules and gameplay such as <em>Freestyle</em> that judges the player on complicated tricks performed during races on either how complicated or simple the trick is as well as if they landed perfectly or fell on their behind. <em>Palmer X</em> has the player compete against computer opponents on a downhill slope while <em>Superpipe</em> has the player complete a course within a certain time-limit in order to advance.</p>"},{"name":"Sheep","year":2002,"developer":"Capcom Co., Ltd.","url":"a#S.zip/S%2FSheep%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7,"genres":"Puzzle > Top-down > Isometric > Real-time","desc":"<p><em>Sheep</em> for the Game Boy Advance is based on the game of the same name for console and computers, but only takes the general concept, adapting it with its own graphical style, completely new levels and different playing modes.</p><p><em>Sheep</em> is a real-time puzzle game. In more than 24 levels displayed in isometric view, the player controls a sheep dog and must herd sheep, moving them into a truck within a time limit. This is mainly done by approaching the sheep, which makes them move into the opposite direction. This way they must be guided around obstacles and away from dangers. The dog can also grab a sheep to carry it, bark to encourage movement further and leave treats behind for the sheep to follow him.</p><p>Players can select from two different dogs at the start of the game who differ in attributes like speed and strength. Further dogs can be unlocked by playing through the game's various modes. The main mode is called Normal Mode and presents the levels grouped into four different stages. Within a stage, the levels can be tackled in any order, but only once all levels are done the next stage opens up. Before a level, the type of sheep to be herded can be selected. Some types are more difficult to control, resulting in a higher score multiplier.</p><p>The game's second mode is called Arrange Mode. It features the same stages and levels, but introduces a new element: the leveling up of sheep and dog. The dog levels up by reaching a certain score, which increases his abilities. The sheep also level up, mainly by performing certain feats within a level. This can become problematic if a sheep reaches a higher level than the dog, making it prone to disobedience.</p><p>Once one of the regular modes is finished, a Training Mode opens up that allows one to select any level directly.</p>"},{"name":"Shin Bokura no Taiyou - Gyakushuu no Sabata","year":2005,"developer":"Konami Computer Entertainment Japan, Inc.","url":"a#S.zip/S%2FShin%20Bokura%20no%20Taiyou%20-%20Gyakushuu%20no%20Sabata%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Isometric > Puzzle elements > Shooter > Stealth","desc":"<p><em>Shin Bokura no Taiyō Gyakushū no Sabata</em> is the third episode in the Boktai series and the only one not released outside Japan. The story takes place directly after the events of Boktai 2. Sealed up by the Lunar family long ago the ancient being Vanargand has been awakened and is now attempting to use Django's old acquaintance Sabata for his evil schemes. It is once again up to Django to clean up this mess, in order to achieve one of four possible endings.</p><p>As in its two predecessors the striking feature is once again the solar sensor that is implemented in the cartridge. Its main purpose is to use sunlight as ammo for the solar gun \"Gun del Sol\", making its comeback from the first game. Gameplay changes depending on if the game is played in the sun and how intense the sunlight is. For example, water disappears, light shines through the ceiling of dungeons or hidden passages become visible once the solar sensor detects sunlight.</p><p>Aside for the aforementioned sunlight elements, the gameplay consists mainly of classic Zelda-like puzzle solving and a few stealth-action elements. For the first time in the series the game includes arcade-like driving sequences on a motorbike, which can be upgraded with various parts, improving its performance. By frequently hitting enemies the Trance gauge can be filled, allowing the player to transform into either Sol Django or Black Django, giving him special attacks. The motorbike mini-game can be played competitively with two players.</p>"},{"name":"Shin Megami Tensei","year":2003,"developer":"Atlus Co., Ltd.","url":"a#S.zip/S%2FShin%20Megami%20Tensei%20%28J%29.gba","filesize":1,"score":7.1,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Cyberpunk / dark sci-fi > Post-apocalyptic","desc":"<p><em>Shin Megami Tensei</em> is a remake of an earlier game with the same name. The changes mostly involve the visual aspect. The graphics have been updated to match the 2D standard of 32-bit consoles. Interior locations are much more detailed, with visible furniture and other items in rooms that were empty in the original version.</p><p>The most notable change are the 3D dungeons, which can now be navigated with smooth scrolling, unlike the \"jumping\" navigation of the earlier versions. The remake also has an additional difficulty level, dubbed \"normal\"; the original difficulty level is called \"hard\". The easier difficulty level also reduces the amount of random battles. Story, dialogues, layout of locations, and general gameplay remain unchanged in this version.</p>"},{"name":"Shin Megami Tensei II","year":2003,"developer":"Atlus Co., Ltd."},{"name":"Shin Megami Tensei: Devil Children - Puzzle de Call","year":2003,"developer":"SUZAK Inc.","url":"a#S.zip/S%2FShin%20Megami%20Tensei%20-%20Puzzle%20de%20Call%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Top-down > Anime / Manga > Real-time > Puzzle elements","desc":"<p>A puzzle game spin-off of the Devil Children series. Devil children Rand and Gale (half-human, half-demon creatures able to switch forms) go across a weird-looking portal in search of their missing friends and in order to get to them they must sort out several puzzle stages.</p><p>The game is a top-down block-pushing puzzle game in which the player must use their demonic form to make their way across each stage collecting demon eggs that enhance their powers (allowing them to break certain blocks, etc.). \"Boss\" stages also feature a giant demon who continually attacks the player, whose objective is to collect all eggs while avoiding attacks.</p>"},{"name":"Shin Megami Tensei: Devil Children: Messiah Riser","year":2004,"developer":"Will Co., Ltd.","url":"a#S.zip/S%2FShin%20Megami%20Tensei%20Devil%20Children%20-%20Messiah%20Riser%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>Long time ago, a powerful demon was captured and sealed within a contraption that was called \"Messiah Riser\". At present time, an evil empire is trying to find a key that would unlock Messiah Riser and unleash the power of the fiend. Two children Jin and Akira, the heroes of  DemiKids, called \"The Devil Children\" thanks to their unique ability to communicate with demons, decide to confront the empire and to stop their evil plan.</p><p>\"Messiah Riser\" is a part of Devil Children games, which are a branch of <em>Megaten</em> game franchise, directed towards younger players. Like in all Megaten games, the trademark of \"Messiah Riser\" is the ability to communicate with demons you fight and to make them help you in battles. You can play the game as either Jin or Akira (the choice will influence the storyline). The battles are now a mixture between turn-based and real time style: enemies will perform a move even if you wait and do nothing, so quick thinking is necessary for combat. After an enemy is defeated, you can talk to it and try to persuade it to join your party. Demons will then fight for you, controlled as playable characters. Like in \"mature\" Megami Tensei games, you can fuse two demons to create a more powerful one.</p>"},{"name":"Shining Force: Resurrection of the Dark Dragon","year":2004,"developer":"Climax Entertainment"},{"name":"Shining Soul","year":2002,"developer":"NexTech Corporation","url":"a#S.zip/S%2FShining%20Soul%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.4,"genres":"Role-playing (RPG) > Diagonal-down > Isometric > Action RPG > Fantasy","desc":"<p>Long ago the Dark Dragon reduced the civilisation to dust. After hundreds of years of rebuilding, that same civilisation is again under attack from the dragon, and only the Shining Fleet know of a way to destroy it and save the people. A combination of adventure and RPG, Shining Soul will have you building a team of warriors from different character classes and travel the world in search of the dragon, defeating the evil that awaits you on your path. Characters gain experience between battles, improving their health and power, while new weapons and armor can be collected.</p>"},{"name":"Shining Soul II","year":2003,"developer":"Grasshopper Manufacture Inc.","url":"a#S.zip/S%2FShining%20Soul%20II%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.4,"genres":"Role-playing (RPG) > Diagonal-down > Isometric > Action RPG > Fantasy","desc":"<p>The Dark Dragon was defeated by our hero in the first Shining Soul, and the people rejoiced as the Darkness faded away.  People are quick to forget, however.  As time passed, people's lives improved and they forgot about the Darkness.  But as the Light grew more and more powerful, it upset the balance between Light and Dark and soon Darkness was on the rise once again.</p><p>A prophet comes and warns the people of the impending dangers, but no one listens to him.  Although his crystal shows the upcoming dangers, the people pass by without any interest.  An agent of the Darkness, Gillespie, lures this prophet outside the city and kills him and shatters his crystal so the people remain ignorant of what is coming.</p><p>This same agent gives the \"Forbidden Fruit\" to Deatharte, the trusted adviser to King Marcel in Klantol Castle.  The adviser didn't trust Gillespie, but curiosity is a powerful force.</p><p>It is now up to another hero to take on the journey to once again stop this growing Darkness.  After choosing your character from 8 possible, you start out on his or her way to a tournament being held at Klantol castle.  On your way, you meet an adventurer who will explain how to battle.  Your journey then takes you to the castle to start the tournament.</p><p>This tournament is interrupted when the king finds out his daughter is missing.  The king's adviser heads out to find her, and the king asks that you go as well.  It is here that your story really begins.</p><p>The gameplay is similar to most RPGs of this type where the monsters are fought in real-time.  An interesting part of this game is that your resistances will increase when used.  Outside the castle, you can stand on a fire that will not damage your HP, but as your resistance reacts to the fire, it will increase slowly.  Traps will also increase your resistance if you are hit by them, though you will also be hurt.  Only the one fire is safe.</p><p>Take on many monsters, cast spells, get new equipment.  But most of all, save the world from Darkness.</p>"},{"name":"Shonen Jump's One Piece","year":2005,"developer":"Dimps Corporation","url":"a#S.zip/S%2FShonen%20Jump%27s%20-%20One%20Piece%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Beat 'em up / brawler > Platform > Licensed","desc":"<p>Based on the 4Kids Entertainment adaptation of the One Piece anime and released exclusively in the United States, this sidescrolling action game features the adventures of Monkey D. Luffy in the East Blue. Recruiting his pirate crew, facing off against enemies with unusual powers, and facing of with the Navy as he travels between islands, players fight their way through seven Stories that consist of three stages each, the first two being platforming stages with the final level of a Story being a boss battle.</p><p>Combat involves utilizing Luffy's rubber body to pull off moves like stretching his arm to attack from afar or inflating to deflect bullets, although most of the generic pirate enemies are defeated with a simple punch combo or aerial kick. The stretchy limbs also factor into level navigation like grabbing onto poles to launch Luffy to higher places or grabbing items that would otherwise be out of reach. Landing attacks will build up a power meter that can be used for either a special attack or to have Luffy's crew members to leap in and assist with their own attacks or by providing useful items.</p><p>Between Stories a timed Ship Battle Royale takes place where the player needs to defeat all the enemies within a time limit. An infinite variation of this mode is unlocked through completing the main story, and by collecting pirate coins in the platforming levels the player can also unlock a boss rush mode.</p>"},{"name":"Shrek 2","year":2004,"developer":"Vicarious Visions, Inc.","url":"a#S.zip/S%2FShrek%202%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>THE ADVENTURE CONTINUES!<br>...With all new characters and far-out locations never seen before!</p><p>Take on challenges as a team of 3 to accomplish a variety of twisted fairy tale adventures. * Test your skills with bonus games created for each character. * Switch between Shrek and 4 of his pals - each with their own unique skills.</p>"},{"name":"Shrek 2: Beg for Mercy!","year":2004,"developer":"Vicarious Visions, Inc.","url":"a#S.zip/S%2FShrek%202%20-%20Beg%20for%20Mercy%20%28E%29%20%28M4%29.gba","filesize":1,"score":6.4,"genres":"Action > Side view > Platform > Fantasy > Licensed","desc":"<p>Control Puss in Boots and his friends, Shrek and Donkey, as you experience the Shrek 2 movie from an all new perspective. Fight off all new enemies using an extensive set of acrobatic maneuvers and combo attacks, collect gold coins to unlock hidden bonus features, and play as the hit new character from the Shrek series in more than twenty challenging levels.</p>"},{"name":"Shrek SuperSlam","year":2005,"developer":"Amaze Entertainment, Inc."},{"name":"Shrek the Third","year":2007,"developer":"Vicarious Visions, Inc.","url":"a#S.zip/S%2FShrek%20the%20Third%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":6.8,"genres":"Action > Side view > Arcade > Platform > Puzzle elements > Licensed","desc":"<p>In the Game Boy Advance version of Shrek the Third, you must complete levels playing as a combination of Shrek, Prince Artie, Puss in Boots, and Donkey. The levels are mostly puzzles, where you can only access certain areas with a certain character, so all playable characters must work together to all reach the end. Each character has special abilities, such as Shrek's ground pound to break through pits in the ground.</p><p>You will encounter many different AI types throughout gameplay, including evil witches, arrow-shooting guys, gnomes, etc. There are collectible faeries in each level that you must collect enough of to progress to the next world. </p><p>This is a simple platformer-puzzle game that is mostly geared towards children, seeing as there are no lives, and relatively simple combat, but it should also appeal to adults who enjoy the Shrek franchise.</p>"},{"name":"Shrek: Hassle at the Castle","year":2002,"developer":"Tose Co., Ltd.","url":"a#S.zip/S%2FShrek%20-%20Hassle%20at%20the%20Castle%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":6.8,"genres":"Action > Side view > Platform > Licensed","desc":"<p>'Shrek: Hassle at the Castle' is a game based on the Oscar award winning movie Shrek. In the game you travel through various stages on tasks which follow the plot of the movie. As you move along the game you will be able to gain control of not only Shrek, but also Donkey and Princess Fiona. Each character has the strengths and weaknesses and you will have to maneuver between the three to be successful. There is also a multiplayer fighting mode which can be played with a single game pack.</p>"},{"name":"Shrek: Reekin' Havoc","year":2003,"developer":"Tose Co., Ltd.","url":"a#S.zip/S%2FShrek%20-%20Reekin%27%20Havoc%20%28E%29%20%28M6%29.gba","filesize":1,"score":"","genres":"Action > Side view > Beat 'em up / brawler > Platform > Fantasy > Licensed","desc":"<p><em>Shrek: Reekin' Havoc</em> is a 2D beat'em up game set in the Shrek universe. The action takes place after the first movie. Lord Farquaad is dead... but his GHOST continues to makes chaos. Fiona and Shrek must stop him.The player controls Fiona and then continues as Shrek, through levels like villages or woods, while fighting against enemies. The gameplay is 2D (like in Bad Dudes or Vigilante ). Sometimes the player must jump over obstacles or holes. Bosses (such as Pinocchio and The Wolf) await the player at the end of each level.</p>"},{"name":"Shrek: Swamp Kart Speedway","year":2002,"developer":"Prolific Publishing, Inc.","url":"a#S.zip/S%2FShrek%20-%20Swamp%20Kart%20Speedway%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":5.3,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Shrek has put together his own ogre kart and is now challenging to win the Dragon’s treasure, along with 7 other characters based on the hit 3D animated movie, Shrek.</p><p><em>Swamp Kart Speedway</em> is similar in design to Mario Kart Super Circuit, using the Game Boy Advance's scaling system to create the illusion of 3D worlds. </p><p>There is a total of 16 tracks to race through, each based on a well known fairy tale as well as places from the movie, along with 4 magic enhancement spells to improve your kart, 2 evil magic spells to create damage, and 4 boss characters to defeat (and unlock to play as in single and multiplayer modes).</p>"},{"name":"Sigma Star Saga","year":2005,"developer":"WayForward Technologies, Inc.","url":"a#S.zip/S%2FSigma%20Star%20Saga%20%28U%29.gba","filesize":1,"score":6.9,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Side view > Isometric > Arcade > Puzzle elements > Shooter > Sci-fi / futuristic","desc":"<p>Ian Recker, a spy for Earth, is sent undercover as a prisoner so that he can become enlisted in the Krill army.  He is suited up with a parasitic suit of armor that gives him enhanced strength and the ability to merge with Krill ships, which are living organisms.  However, he soon discovers that all is not as it seems in this war, and Recker must decide which side he is fighting for.</p><p>Sigma Star Saga is a hybrid of the side-scrolling shooter and RPG genres.  Players interact with characters and explore the overworld, and are frequently 'summoned' by random ships for battles.  To successfully complete a battle, the player must defeat a preset amount of enemies, and they gain experience with each enemy defeated.  As players explore the overworld, they can also discover Gun Data, which can be used to customize the player's shot with over 15,000 different weapon combinations using abilities such as rapid fire, vertical shot, and experience gain.</p>"},{"name":"Silent Hill: Play Novel","year":2001,"developer":"Will Co., Ltd.","url":"a#S.zip/S%2FSilent%20Hill%20Play%20Novel%20%28J%29.gba","filesize":1,"score":"","genres":"Adventure > Visual novel > Horror","desc":"<p>Play Novel: Silent Hill is a side story to the original Silent Hill. It was only released in Japan. This is an adventure game along the lines of those \"Choose Your Own Adventure\" books. You are given some illustrated text, then choose from two or three options what you want to do next.</p><p>Players control officer Cybill Bennett in an adventure that takes place at the same time as Harry's game in the original. Don't think that because you played Silent Hill, you know how this ends, though.</p><p>This game was only released in Japan and outside the menus is entirely in Japanese.</p>"},{"name":"Silent Scope","year":2002,"developer":"Konami Co., Ltd.","url":"7#Silent%20Scope%20%28USA%29%20%5BEn%2CEs%2CFr%2CIt%2CDe%5D.gba","filesize":8388608,"score":6.8,"genres":"Action > 1st-person > Rail shooter","desc":"<p>The aim of the game is to save the captured family of the President of the USA, by sniping all on-coming enemies as you go along. </p><p>As an enemy appears, an area of the screen zooms in, allowing you to easily pick off the guy in the head. Once done, press a button to zoom out, so as to choose your next target.</p>"},{"name":"SimCity 2000","year":2003,"developer":"Maxis Software Inc.","url":"a#S.zip/S%2FSim%20City%202000%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.7,"genres":"Simulation > Strategy > Diagonal-down > Free-roaming camera > Isometric > Real-time > City building / construction simulation > Managerial / business simulation > Point and select > Contemporary","desc":"<p><em>SimCity 2000</em> is the successor to the city simulation game Sim City. You are once again the mayor, but this time you can fully customize the terrain before building your city. The graphics are isometric, whereas the original had graphics displayed in a top-down fashion.</p><p>This title adds numerous features over the original such as the ability of building \"light\" zones, subways, hospitals, colleges, zoos, and arcos which are actually cities in cities. You can now give names to places, and your city is surrounded by neighboring towns with which you can trade goods. Finally, instead of the poll in the first game, you now have the option of reading several newspapers to get an idea of your progress.</p>"},{"name":"Simpsons, The: Road Rage","year":2003,"developer":"Altron Corporation","url":"a#S.zip/S%2FSimpsons%2C%20The%20-%20Road%20Rage%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.6,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Licensed","desc":"<p>Almost two years after its release on consoles, The Simpsons: Road Rage was adapted for the Game Boy Advance. While it retains the general gameplay concept inspired by Crazy Taxi, it has a reduced selection of drivers and cars, unique playing modes and missions, and adapts the 3D graphics of the original to a Mode-7-style sprite scaling and rotation engine.</p><p>The game's main mode is called Road Rage. Just like in <em>Crazy Taxi</em>, the goal is to pick up passengers and deliver them to their destination within a time limit, earning money in the process. Bonuses are awarded for arrival speed and hitting the target exactly. Special objectives might appear during a fare for additional bonus: either hitting a certain number of cars or avoiding hitting any traffic at all.</p><p>The second main game mode is entirely new: in Performance Mode, players select one passenger to take on and must offer them an exciting ride: the different characters' preferences for jumps, hitting cars and hitting roadside objects differ. They must be taken into account in order to take the passenger's excitement meter to its heights, resulting in cash being awarded.</p><p>The Mission Mode is similar to that in the console version: in each of the ten missions, one specific character is controlled in order to reach a certain goal, like driving over a number of objects, or racing a course, all within a time limit. Some of the missions are based on those of the console version, others are entirely new.</p><p>A Head-to-Head multiplayer mode via link cable is also available: in these, two players compete to pick up a single passenger and deliver him to his destination. By bumping into the other player, the passenger can be forced to switch cars.</p><p>The game includes 16 different vehicles (driven by 15 Simpsons characters) and six different locations. Only five drivers and one location are available from the start. More vehicles are unlocked in Road Rage mode, more locations in Performance Mode, and further extras (like a car color editor) in Mission Mode. The locations are based on those from the console game, but with some differences in track layout. None of the signature locations from the TV series are featured however - drop off points are generic. Unlocked environments can be freely explored in Sunday Drive mode.</p>"},{"name":"Sims 2, The","year":2005,"developer":"Amaze Entertainment, Inc.","url":"a#S.zip/S%2FSims%202%2C%20The%20%28UE%29%20%28M6%29.gba","filesize":1,"score":6.5,"genres":"Role-playing (RPG) > Simulation > Isometric > Game show / trivia / quiz > Managerial / business simulation","desc":"<p>Welcome to Strangetown! <em>The Sims 2</em> for Game Boy Advance is inspired by the weird town in the original PC game, but this time you're in a \"reverse\" reality show. Daddy Bigbucks (the villain from the game's predecessor, <i>The Urbz</i>) is secretly filming a reality TV show in Strangetown, and pushes your own Sim to mix things up for the cameras.</p><p>You'll make friends and enemies, have romances, play minigames (some of which are thinly disguised as fictional commercial breaks), and participate in 11 standalone episodes, each with their own plots and situations. In one episode, you might be dealing with Don Fusilli and his mob, in another episode you might be battling lady bugs after being shrunk down to the size of a bug by a homebrewed cola.</p><p>Overall, the game is less of a simulation and more of a quirky adventure game through a colorful desert town.</p>"},{"name":"Sims 2, The: Pets","year":2006,"developer":"Artificial Mind & Movement","url":"a#S.zip/S%2FSims%202%2C%20The%20-%20Pets%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":"","genres":"Simulation > Isometric > Real-time","desc":"<p><em>The Sims 2: Pets</em> proposes you to take control of a Sim and his pet in the little town of Baskerville. The gameplay is the usual one when it comes to the Sims. You have to satisfy the daily needs of your character and his animal. The primary concerns are: sleeping, eating, keeping clean, using the toilet, relaxing, watching TV, interacting with people and spending time at home. The pet can be taught tricks and enter competition. In this version, for gaining money, your Sim can work in domains related to pets: pet walker, pet trainer, veterinarian, etc..</p>"},{"name":"Sims, The: Bustin' Out","year":2003,"developer":"Maxis Software Inc.","url":"a#S.zip/S%2FSims%2C%20The%20-%20Bustin%27%20Out%20%28UE%29%20%28M6%29.gba","filesize":1,"score":7.6,"genres":"Simulation > Diagonal-down > Isometric > Life / social simulation","desc":"<p>Create and customize the appearance and personality of your Sim, then move into SimValley, the offbeat setting of the game, in this portable version of the simulation series. Make your way through the adventure, meeting odd people such as Uncle Hayseed, Olde Salty, and Mad Willy Hurtzya, but don't forget to take care of your motives, go to the bathroom, and grab something to eat.</p><p>Advance in five missions, starting at the Hayseed Farm and ending in the palatial SimValley mansion. New elements let players shop, keep an inventory, and have actual conversations with the residents of the town.</p><p>To make those much-need Simoleons, the player will have to advance in 8 job mini-games including Jam Session, Cliff Diver X, and Pizza Pandemonium. </p><p><em>The Sims: Bustin' Out</em> for GBA lets players transfer their Sim from the GameCube version. Players can also connect with other GBAs to auction off rare goods and unlock Paradise Island -- the game's vacation resort.</p>"},{"name":"Sitting Ducks","year":2004,"developer":"Light & Shadow Production","url":"a#S.zip/S%2FSitting%20Ducks%20%28U%29%20%28M6%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Direct control > Licensed","desc":"<p><em>Sitting Ducks</em> is a 2D game based on the TV cartoon of the same name in witch the gang has to complete various levels to be able to go to the King of Bongo concert. </p><p>The game has a Story mode and a Race mode. In the story mode the player has to collect various items in a set amount of time. Chips for extra time can also be collected and chips for losing time have to be avoided. Later on the player also has to retrieve keys to open doors, use levers and avoid enemies. In the Race mode the player can compete in scooter races. The player will get to play as the duck Bill, alligator Aldo and Fred the penguin. A password save system is used in the game.</p>"},{"name":"Smashing Drive","year":2004,"developer":"Point of View Software","url":"a#S.zip/S%2FSmashing%20Drive%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":5.2,"genres":"Racing / Driving > Behind view > Real-time > Arcade > Direct control > Automobile > Street racing > North America","desc":"<p>Smashing Drive puts you in the driver's seat of an insane, outrageous taxi on the busy streets of New York City.  Your job is to simply race from point to point in the fastest time possible.  </p><p>The key to success in Smashing Drive lies in two features:  crazy power-ups and hidden shortcuts.  Almost all of the power-ups transform your taxi in some way that allows you to smash your way through traffic with ease.  And the shortcuts usually involve crashing through the insides of buildings, like movie theaters and sports arenas.</p>"},{"name":"Smuggler's Run","year":2002,"developer":"Rebellion Developments Ltd.","url":"a#S.zip/S%2FSmuggler%27s%20Run%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Racing / Driving > Behind view > Real-time > Direct control > Automobile > Off-roading > Crime","desc":"<p>DELIVER...AT ALL COSTS!<br>Drive, evade and explore anywhere across 3 vast levels - Rocky Mountain forest, desert and icy tundra.<br>As a member of a gang of international smugglers, it's your job to evade the U.S. Border Patrol, CIA and cutthroat rivals to deliver illegal cargo. It'll take complete mastery of your off-road vehicle to make it across unforgiving terrain and stay one step ahead...and make the drop.</p>"},{"name":"Smurfs, The","year":2002,"developer":"Infogrames Europe SA","url":"a#S.zip/S%2FSmurfs%2C%20The%20-%20The%20Revenge%20of%20the%20Smurfs%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Free the Smurfs before Gargamel smurfs then all!Platform game where you will be able to play with the jockey smurf, the brainy smurf, the greedy smurf and the hefty smurf to resolve the adventure.All of the classic SMURF characters are along for the adventure, guaranteeing you a Smurf-tastic time.</p>"},{"name":"Sneak and Snatch","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Snood","year":2001,"developer":"Rebellion Developments Ltd.","url":"a#S.zip/S%2FSnood%20%28E%29%20%28M5%29.gba","filesize":1,"score":6.8,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Turn-based > Tile matching puzzle","desc":"<p><em>Snood</em> for the Game Boy Advance is the first commercial edition of the popular shareware computer game. It retains most of the original game's modes, adapting them to the lower resolution of the handheld, while giving everything a graphical makeover and adding unique modes and levels of its own.</p><p>The game is a variant of Puzzle Bobble. The player is presented with a play field made up of Snoods. The goal is to clear the field by shooting additional Snoods into the field from a cannon at the bottom. Snoods get removed when three or more of the same color touch each other. Snoods that become free after a removal fall down and are also removed. Each shot from the cannon that doesn't cause Snoods to fall moves a meter up one notch. Once it reaches the top, the playing field moves down a row. The round is lost when the field reaches the bottom before all Snoods have been removed.</p><p>Classic Mode is the original mode from the computer version. It is available in five different difficulty levels and presents a field of 2 to 6 rows of Snoods that has to be cleared. Journey mode (a series of one level per Classic difficulty) also reappears from the computer version. The Puzzle mode is also based on the computer version, but offers a unique set of 24 levels. In each, a pre-set pattern of Snoods is presented that requires a unique strategy to clear. The Time Attack! mode is all-new. Similar to the Puzzle mode, it offers a set of levels with pre-set patterns. The major difference is that the meter that moves toward the field falling one row is not based on the number of shots but moves automatically every few moments instead. The only way to stop it momentarily is to cause Snoods to fall down. The second all-new mode is a multiplayer mode via link cable, based on Classic mode. Each player is presented with a standard row of Snoods to clear. Each player also has a bar that is filled by removing Snoods. Filling the bar adds an extra row of Snoods to the opponent's field.</p>"},{"name":"Snood 2: On Vacation","year":2005,"developer":"Gravity-i Ltd","url":"a#S.zip/S%2FSnood%202%20-%20Snoods%20on%20Vacation%20%28E%29%20%28M5%29.gba","filesize":1,"score":5.8,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Tile matching puzzle","desc":"<p>The sequel to Snood keeps the gameplay from the original game but takes it to locations around the world. In this puzzle game players need to line up groups of three or more adjacent Snoods to remove them, similar to the Bust-a-move series. They are launched from the Snood-o-matic cannon at the bottom of the screen. For every Snood launched, the danger level increases and causes the Snoods at the top to move downwards. When the bottom is reached, the game is lost.</p><p>There are five game modes available: World Tour, Classic, Puzzle, Journey and Armageddon. Four additional bonus games can be unlocked: Snood Ball, Snood Sideways, Snood Grab and Snood Stack, all with small twists on the classic gameplay. Multiplayer is available as well.</p>"},{"name":"Soccer Kid","year":2002,"developer":"Krisalis Software Ltd.","url":"a#S.zip/S%2FSoccer%20Kid%20%28U%29.gba","filesize":1,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Direct control","desc":"<p>Aliens attempting to steal the World Cup have crashed as they tried to flee, and the Cup has been broken, its pieces scattered around the globe. As Soccer Kid, you must retrieve it. During your journey, you will visit Britain, Italy, Russia, Japan, and finally, the United States.</p><p><em>Soccer Kid</em> is a platform game with some unique elements. As the name implies, you have to kill your enemies with your ball. Football-style tricks of keeping the ball in the air and under control are especially useful - headers and overhead kicks can be played with practice. You gain access to the pieces by collecting 11 Player Cards across each world.</p><p>There is a saving feature that gives you the ability to save between each country (but not between individual levels).</p>"},{"name":"Soccer Mania","year":2002,"developer":"Tiertex Design Studios"},{"name":"Sonic Advance","year":2001,"developer":"Dimps Corporation","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Sonic%20Advance%20%28USA%29%20%28En%2CJa%29.zip","filesize":1,"score":7.8,"genres":"Action > Side view > 2D scrolling > Real-time > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>Sonic the Hedgehog has arrived for his first ever adventure on a Nintendo console. <em>Sonic Advance</em> combines elements from the original Sonic series on Sega's Genesis, as well as from the Dreamcast Sonic Adventure series.</p><p>Choose from Sonic, Knuckles, Tails, or Amy and take them through level after level of fast gameplay and ring collecting, dodging enemies in your path towards the final showdown with Dr Robotnik (aka Dr Eggman). Collect Chaos Emeralds along the way to transform into Super Sonic for added speed, and train your Chao to exchange them into Sonic Adventure 2 Battle on the Nintendo GameCube. You can also play four-player battle modes with your friends, using one game cart between 4 GBAs.</p>"},{"name":"Sonic Advance 2","year":2002,"developer":"Sonic Team","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Sonic%20Advance%202%20%28USA%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1,"score":7.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>Sonic returns for a second outing on the Game Boy Advance.</p><p>Once again, Sonic is called upon to save the world from the evil Dr. Eggman. On this occasion, Sonic is joined by friends Tails, Knuckles and Cream and rabbit, the latest addition to the Sonic team. Each comes with a set of unique moves, allowing you to reach certain areas through-out the levels. However, unlike Sonic Advance, you must compelte the game as Sonic to unlock the other characters.</p><p>Chaos Emeralds and Special Rings litter the stages. To collect the emeralds (transforming Sonic into Super Sonic for the final battle with Dr. Eggman), you must find the special rings hidden in each stage to unlock the bonus stage. Complete the bonus stage and the emerald is yours.</p><p>You'll also get the chance to collect and raise chaos, and trade them over to Sonic Adventure 2: Battle on Gamecube, through the use of the GBA/GC link cable.</p>"},{"name":"Sonic Advance 3","year":2004,"developer":"Dimps Corporation","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Sonic%20Advance%203%20%28USA%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Eggman has broken the world into seven parts, now the player must find the seven Chaos Emeralds to restore the world. </p><p><em>Sonic Advance 3</em> is a <em>Sonic</em> game with a twist: the player can play with a friend in co-op mode or one of many multi-player modes like ring race. The game contains features from Sonic Advance and Sonic Advance 2, but with more options like choosing from 2 characters in story mode (a leading and a following character).</p>"},{"name":"Sonic Battle","year":2003,"developer":"Sonic Team","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Sonic%20Battle%20%28USA%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1,"score":6.7,"genres":"Action > Isometric > Board game > Fighting","desc":"<p>Sonic Battle is a fast paced pseudo-fighting game, akin to Super Smash Brothers from Nintendo.  Rather than being 3D side-scrolling, this game employs a 3D isometric view- not a static, sprite-based field though, it is comprised of actual texture-mapped polygons.  The character sprites are 2D though, and while you think it wouldn't work- it does :P</p><p>You can have 9 characters to choose from, 5 modes of play; Story, Battle, Challenge, Training, and Mini Games; you can link up 4 GBA's to fight your friends, each character has a bunch of moves you can use to beat the you-know-what out of whoever you're fighting.  It has a system of selecting Aerial, Ground, and Guard based attacks, and depending on what type of attack you set for which area (aerial/ground/guard), you have a possibility of 9 total different special attacks to choose from (only 3 at a time in a match though) which you can change each time you lose 1 stock point.</p><p>Among the other many features, Sonic Team has also made the game more dynamic with the addition of a trainable character whose abilities and techniques you can raise and add to.  You get to pick and choose every aspect of the robot's style (running, attacking, jumping, dashing, etc etc etc etc etc).</p><p>The game takes a moderate amount of time to play through as all the characters, and adds a longer lifespan to itself if you wish to play through and beat it completely (all characters, get all moves for the trainable robot, etc).</p>"},{"name":"Sonic Pinball Party","year":2003,"developer":"Jupiter Corp.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Sonic%20Pinball%20Party%20%28USA%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1,"score":7.2,"genres":"Action > Top-down > Anime / Manga > Pinball","desc":"<p><em>Sonic Pinball Party</em> is the second Sonic Pinball game since Sonic Spinball in the early 90's. The game has an arcade mode, a tutorial mode, and a vs mode (party mode). In the game the game has pinball tables of famous Sonic Team characters such as Nights, Samba de Amigo, and of course SONIC! </p><p>The story mode of the game is the usual type of story, Robotnik steals animals visiting Casinopolis, and is going turn into his Robotic slaves. Of course, Sonic is going to try and stop him. Before he does, he has to win a pinball competition and during the game you unlock prizes. The competition is set out as a knockout format. The game also has a Casinopolis mode, which has Casino games like Roulette. There is also a chao garden, just like in the Sonic Advance games.</p>"},{"name":"Sonic the Hedgehog","year":2006,"developer":"Sonic Team"},{"name":"Sound of Thunder, A","year":2005,"developer":"Möbius Entertainment Ltd.","url":"a#S.zip/S%2FSound%20of%20Thunder%2C%20A%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > Diagonal-down > Isometric > Shooter > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Licensed","desc":"<p><em>A Sound of Thunder</em> is an overhead shoot-em-up based on the 2005 film, which in turn was loosely based on the classic short story by Ray Bradbury. It is Chicago, 2055, and you are Travis Ryer, scientist and employee at Time Safari Incorporated (TSI), a business dedicated to taking wealthy clients back in time 65 million years and giving them the chance to do the impossible: hunt a dinosaur.</p><p>Of course, there are dangers: the tiniest change can screw the future up in ways you can't possibly imagine. Somehow, one of the recent clients has managed to accidentally take a butterfly back through time with him. Soon, the present is rocked by time waves, waves which gradually change the future into how the butterfly-less past would have been. Dinosaurs have been popping up around the city, buildings are crumbling and decaying, and the last wave that hits may mean the end of the human race unless Ryer can return the butterfly to the past.</p><p>With a nice arsenal of weapons at your disposal, such as grenade launchers, machine guns, stun prods, and time freezing bombs that will freeze all enemies for a short amount of time, plus vehicles such as an ordinary car or a tricked-out ATV, you may just get the necessary edge. You can also battle it out in four-player deathmatch mode or a two-player cooperative mode. You may want to hurry, though: you're racing against time... and time is NOT on your side.</p>"},{"name":"Soundvoyager","year":2006,"developer":"Skip, Ltd."},{"name":"Space Channel 5","year":2003,"developer":"ART Co.,Ltd.","url":"a#S.zip/S%2FSpace%20Channel%205%20-%20Ulala%27s%20Cosmic%20Attack%20%28E%29.gba","filesize":1,"score":7.5,"genres":"Action > 3rd-person (Other) > Anime / Manga > Music / rhythm > Sci-fi / futuristic","desc":"<p>Hey there, Space Cats! Some pesky little aliens called Morolians are trying to take over Earth, and they're forcing the population to dance endlessly! Space Channel 5, the planet's news channel, has sent the grooviest reporter they have, Ulala, out to cover the latest happenings, but those little Morolians also have to be taught a lesson! So it's now up to Ulala to dance and groove with the aliens to beat them at their own game and free the population of Earth! Get dancin', Space Cats, 'cuz we're gonna give those aliens a little taste of their own groove!</p>"},{"name":"Space Invaders","year":2002,"developer":"Torus Games Pty. Ltd.","url":"a#S.zip/S%2FSpace%20Invaders%20%28U%29.gba","filesize":1,"score":6.3,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>In 1978, Earth successfully repulsed an invasion from outer space thanks to \"the Tank.\" The Tank was based on alien technology found when a scout ship had crashed years earlier. Now, over 20 years later, a new Tank has been created based on the technology recovered during the 1978 invasion. And none too soon, because the Invaders are back!</p><p>Space Invaders is yet another classic arcade game remake by Activision (see Battlezone  and Asteroids). But this time, Activision licensed a game from Taito instead of Atari. The game stays close to its roots while adding many power-ups and enemies.</p><p>You can play either one or two players against the Invaders, who march down the screen in orderly rows and columns, at one of three skill levels. You'll start at Pluto and work your way through the Solar System to Mars, then Venus, and finally Earth. There are four common aliens (red, green, blue, and yellow), plus seven more less common ones. You receive special one shot power-ups by shooting four of the same type of Invaders in a row. As in the original game, there are also Mother Ships that fly above the action, but in this version if you hit them you can pick up other useful power-ups like shields or double shots. Plus, after fighting off several waves on each planet, you'll face a unique boss. If you manage to finish the game, you'll be able to play a reproduction of the original coin-op.</p>"},{"name":"Speedball 2: Brutal Deluxe","year":2001,"developer":"The Bitmap Brothers","url":"a#S.zip/S%2FSpeedball%202%20-%20Brutal%20Deluxe%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.2,"genres":"Action > Sports > Top-down > Sci-fi / futuristic","desc":"<p>Brutal Deluxe doesn't live up to their name - in fact they're the worst team Speedball has ever seen. As their manager, it is your job to transform their fortunes. As well as the league system, which consists of 2 8-team divisions and challenges you to advance to the top, there are also 2 cup tournaments, one of which is played out over 2 'legs' with the aggregate score deciding who progresses.</p><p>You can play the matches as well, which is the real meat of the game. They consist of 2 90-second periods, and the gameplay is futuristic, fast, and frantic, with heavy tackling encouraged to retrieve the ball. Power-ups and tokens appear on the pitch, including ones to make your players extra-tough or freeze the opponents.</p><p>The sides of the pitch each include a score multiplier, which you can run the ball through to increase the value of your scoring - the opposition can sometimes immediately grab the ball and nullify this. There are also 5 stars which are worth 2 points each if you hit them (more if you have the multiplier activated), but these can also be canceled out by the opposition hitting the same star, and their points values only become set after the half. Next to the stars, there are portals, which throw the ball out the opposite side of the pitch, in the direction it was going.</p><p>You get money for the results, and by collecting the silver tokens which appear on the pitch at random intervals. Between each match, you can spend these either on improving your existing players as far as they can go or on buying better ones and fitting them into the team. Your original players can only be improved to a certain extent, so remembering where your signed players are and making use of them is important.</p><p>A variety of tokens also appear during the match, some of which boost your team's power for a short period of time, and one freezes the opposition.</p>"},{"name":"Spider-Man","year":2002,"developer":"Digital Eclipse Software, Inc."},{"name":"Spider-Man 2","year":2004,"developer":"Digital Eclipse Software, Inc.","url":"a#S.zip/S%2FSpider-Man%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > North America > Licensed","desc":"<p><em>Spider-Man 2</em> is a 2D side-scrolling platform game based on the <em>Spider-Man 2</em> film. It expands on the plot of the film, adding characters like Black Cat, Mysterio and the Rhino, while maintaining the core gameplay of the previous 2002 game Spider-Man by the same developer. The game brings back the mechanic of taking pictures in-game by pressing the Select button in certain areas.</p>"},{"name":"Spider-Man 3","year":2007,"developer":"Vicarious Visions, Inc.","url":"a#S.zip/S%2FSpider-Man%203%20%28E%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Based on scenes and plot from the movie of the same name, Spider-Man finds himself swinging, webbing and crawling across New York city, battling a multitude of organized criminals and superhuman mutants, while saving hapless citizens throughout. At some point he gets enhanced by the Venom symbiote which might prove to be his undoing.</p>"},{"name":"Spider-Man: Battle for New York","year":2006,"developer":"Torus Games Pty. Ltd.","url":"a#S.zip/S%2FSpider-Man%20-%20Battle%20for%20New%20York%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > North America > Licensed","desc":"<p>The battle for the city is on.<br>Save it or smash it.<br>* Save the city as Spider-Man, web-slinging and pulling off cool acrobatic stunts. * Smash through the streets as Green Goblin, crushing cars and throwing fireballs. * Customize Spider-Man's and Green Goblin's combat skills and special moves.</p>"},{"name":"Spider-Man: Mysterio's Menace","year":2001,"developer":"Vicarious Visions, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Spider-Man%20-%20Mysterio%27s%20Menace%20%28USA%2C%20Europe%29.zip","filesize":1,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Platform > Licensed","desc":"<p>Set in New York, Spider-Man: Mysterio's Menace enables players to assume the role of Spider-Man as they take on super-villain Mysterio and his illusory tricks for control of Manhattan. Spider-Man must fight a slew of Mysterio's sinister conspirators and gadgetry to get to the bottom of their plot and free New York from Mysterio's mind-warping grip.</p>"},{"name":"Spirit: Stallion of the Cimarron","year":2002,"developer":"Hyperspace Cowgirls","url":"a#S.zip/S%2FSpirit%20-%20Stallion%20of%20The%20Cimarron%20%28E%29.gba","filesize":1,"score":5.7,"genres":"Action > Simulation > Diagonal-down > Side view > 2D scrolling > Life / social simulation > Puzzle elements > North America > Licensed","desc":"<p>Control Little Creek and Little Brook as you rescue the horses and return them to Homeland. Play across five environments, interacting with multiple horses and animals companions, use items from your inventory to calm the frightened horses, and save Spirit from his captors.</p>"},{"name":"Spirits & Spells","year":2003,"developer":"Magic Pockets SAS"},{"name":"SpongeBob SquarePants and Friends: Battle for Volcano Island","year":2006,"developer":"Halfbrick Studios Pty Ltd","url":"7#SpongeBob%20SquarePants%20and%20Friends%3B%20Battle%20for%20Volcano%20Island%20%5BEn%2CFr%2CDe%2CIt%2CEs%2CNl%5D.gba","filesize":4194304,"score":6.6,"genres":"Action > 3rd-person (Other) > Platform > Fantasy > Licensed","desc":"<p><em>Nicktoons: Battle for Volcano Island</em> is a 3D action platformer game and sequel to Nicktoons Unite! The game combines and links the TV series SpongeBob SquarePants, Danny Phantom and The Fairly OddParents. Jimmy Neutron is not playable this time but does make a cut-scene appearance.</p><p>The heroes are summoned to Volcano Island by its crab inhabitants after Mawgu, an ancient evil has broken free of its imprisonment. Mawgu has interrupted the summoning ritual scattering the heroes across the island. It's up to you to stop the Mawgu evil and find the scattered heroes.</p><p>In the game you take control of the heroes: Danny Phantom, SpongeBob SquarePants, Timmy Turner, Patrick Star, Sandy Cheeks and Sam Manson. Gameplay includes platforming and defeating enemies. The game can be played solo or in co-op. Players can freely switch between characters with the remaining being controlled by the AI. Costumes for the characters and bonus levels can be unlocked during play.</p>"},{"name":"SpongeBob SquarePants: Battle for Bikini Bottom","year":2003,"developer":"Vicarious Visions, Inc.","url":"a#S.zip/S%2FSpongeBob%20SquarePants%20-%20Battle%20for%20Bikini%20Bottom%20%28E%29%20%28M3%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>HE IS OUR ONLY HOPE...<br>The evil Plankton has set in motion his most diabolical plot ever and the fate of Bikini Bottom has been put in the unsuspecting hands of SpongeBob. Explore a huge world filled with unexpected surprises, challenges and familiar friends. Join SpongeBob in his fearless crusade to end Plankton's evil scheme...<br>* Battle powerful and mindless bosses! * Use your bubble attack to stun enemies! * Have some robot for lunch! * Encounter familiar friends!</p>"},{"name":"SpongeBob SquarePants: Creature from the Krusty Krab","year":2006,"developer":"WayForward Technologies, Inc.","url":"a#S.zip/S%2FSpongeBob%20SquarePants%20-%20Creature%20from%20the%20Krusty%20Krab%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CDa%29.gba","filesize":1,"score":7.1,"genres":"Action > Racing / Driving > Behind view > Side view > Top-down > Platform > Licensed","desc":"<p>It's night time at Bikini Bottom, where SpongeBob and his friends are asleep, dreaming. SpongeBob dreams about getting his driver's license and first car, Patrick dreams of becoming Starfish-Man, defending Bikini Bottom from evil villains, while Plankton dreams of nothing but total world domination! Help the trio make it through their night's dreams!</p><p><em>Creature From the Krusty Krab</em> is a game which features an assortment of different gameplay styles throughout each character's dream. As SpongeBob, you'll race against other characters, dodge bikers in a tunnel, and freefall from the sky while dodging jellyfish. Patrick becomes the superhero \"Starfish-Man\", where he protects Bikini Bottom from numerous foes that look identical to Patrick himself. And Plankton accidentally concocts a monster Krabby Patty that's out to get him.</p><p>There are many different styles of gameplay. The traditional side-scrolling platformer is included, as well as the old-fashioned beat-em-up. There are also racing games – both side-scrolling and Road Rash style.</p>"},{"name":"SpongeBob SquarePants: Lights, Camera, Pants!","year":2005,"developer":"WayForward Technologies, Inc.","url":"a#S.zip/S%2FSpongeBob%20SquarePants%20-%20Lights%2C%20Camera%2C%20Pants%21%20%28E%29%20%28M7%29%20%5BhIR%5D.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > Music / rhythm > Platform > Licensed","desc":"<p><em>SpongeBob SquarePants: Lights, Camera, Pants!</em> is different from its counterpart for Windows or the consoles. Like in the other versions the the popular TV series \"The New Adventures of Mermaidman and Barnacle Boy\" is in danger because the cast has failed to show up. It is up to the player, as SpongeBob to find a replacement cast in the inhabitants of Bikini Bottom.</p><p>The Game Boy Advance version plays like a classic side-scrolling platform game. The levels end with level bosses that have to be defeated in a style mimicking Dance Dance Revolution. Additionally the player can play a variety of mini games in between games.</p>"},{"name":"SpongeBob SquarePants: Revenge of the Flying Dutchman","year":2002,"developer":"Vicarious Visions, Inc.","url":"a#S.zip/S%2FSpongeBob%20SquarePants%20-%20Revenge%20of%20The%20Flying%20Dutchman%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>CURSES!<br>SpongeBob accidentally releases The Flying Dutchman from a magic bottle. Now the ghostly pirate has put a wicked curse upon SpongeBob. The only way to lift the curse is to join a ridiculous underwater adventure that has SpongeBob searching for 10 lost treasures!<br>* Navigate through dangerous caverns! * Who dares awake the Flying Dutchman! * Steer clear of Sponge-spitting clams!</p>"},{"name":"SpongeBob SquarePants: SuperSponge","year":2001,"developer":"Climax Group Limited","url":"a#S.zip/S%2FSpongeBob%20SquarePants%20-%20SuperSponge%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>SpongeBob SquarePants: SuperSponge</em> features the same story and general gameplay concept as its counterpart on the PlayStation, but with different level designs and gameplay mechanics.</p><p>SpongeBob wants to get a present for his friend Patrick's birthday, and decides to get him an autograph from his favorite superheroes, Mermaid Man and Barnacle Boy. The two will however only help SpongeBob if he runs several errands for them first, like getting them a meal or a facial treatment.</p><p>The game is a traditional side-scrolling platformer consisting of five worlds of four levels each. In every level, the goal is to collect one particular ingredient for fulfilling the latest errand. Swimming or lying in SpongeBob's way are various hostile sea creatures he can dispatch with a slap from his giant red glove. In addition, he can pick up several items that allow more options, like several different weapons, including a fishing net, a coral blower and a jelly gun - all can be used to collect ammunition in the form of jellyfish or coral which can then be fired. A balloon allows SpongeBob to glide. A beating heart shows SpongeBob's health - should it get too low, he can refill it by picking up fast food items like milkshakes, fries and burgers. He can also collect spatulas - picking up 50 of them awards an extra life. Extra lives can also be found in the form of an extra pair of underpants.</p><p>Every world ends with a boss battle. One level takes place in Sandy Cheeks' home tree. There, SpongeBob must periodically refresh himself at a water puddle or dry out and lose a life.</p>"},{"name":"SpongeBob SquarePants: The Movie","year":2004,"developer":"WayForward Technologies, Inc.","url":"a#S.zip/S%2FSpongeBob%20SquarePants%20-%20The%20Movie%20%28E%29%20%28M6%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Comedy > Licensed","desc":"<p>BIGGER! BETTER! MORE ABSORBENT!<br>JOIN SPONGEBOB AND PATRICK ON THEIR MOST PERILOUS JOURNEY EVER TO A MYSTERIOUS PLACE NO SEA CREATURE HAS EVER RETURNED FROM. ONLY YOU CAN HELP THEM SAVE MR. KRABS AND ALL OF BIKINI BOTTOM FROM PLANKTON'S DREADED \"PLAN Z\"<br>Prepare for super speed!<br>Drive the Patty Wagon!<br>Confront powerful bosses!<br>Patrick saves the day!</p>"},{"name":"Sports Illustrated for Kids: Football","year":2001,"developer":"Sennari Interactive, LLC","url":"a#S.zip/S%2FSports%20Illustrated%20For%20Kids%20Football%20%28U%29.gba","filesize":1,"score":"","genres":"Simulation > Sports > Top-down > Isometric > Football (American) > Licensed","desc":"<p>A football game aimed at younger kids. Features player development, trading, team management, all mixed into arcade style play. The first multiplayer football game on the Game Boy Advance. Each athlete has three key statistics that define their abilities within the game: Strength, Speed and Agility. The stats can be improved through play, improving team overall. Choose a type of team, a team name, team color and uniform style. You'll see special effects. A player who gets faster will have smoke and flames under his feet when he runs. Dynamic cameras follow the action through entire game play, enhancing the 3D look and feel of the game. Unlock secret bonus stadiums and modifiers.</p>"},{"name":"Sportsman's Pack: Cabela's Big Game Hunter 2005 & Rapala Pro Fishing","year":2004,"developer":"Torus Games Pty. Ltd."},{"name":"Spy Hunter","year":2002,"developer":"Midway Games, Inc.","url":"a#S.zip/S%2FSpy%20Hunter%20%28E%29.gba","filesize":1,"score":6.8,"genres":"Action > Racing / Driving > Behind view > Arcade > Shooter","desc":"<p>The modern update of the classic arcade game <em>Spy Hunter</em> was also adapted for the Game Boy Advance. It adapts roughly half of the console version's missions, albeit with completely changed level designs that fit with the Mode 7-style sprite scaling and rotation engine, and adds several unique gameplay modes of its own.</p><p>The player controls the advanced G-6155 Interceptor car to combat the evil Nostra Corporation. The game's main Normal Agent mode consists of seven different missions. Each mission has one primary and several secondary objectives, to be finished within a time limit. The primary goal must be met to unlock the next mission, the secondary goals are only necessary to unlock further game modes. Objectives include destroying certain targets, moving through slalom obstacles, avoiding civilian casualties, activating Satcoms by driving over them, making long jumps, and more. Various enemies will be on the road that can be attacked with the Interceptor's weapons, including machine guns, missiles and rail guns. There are also defensive weapons like smoke screens and oil slicks. The weapons can be either found as pick-ups on the road or by finding and driving into the classic weapons van.</p><p>The seven mission levels can also be played in Special Agent mode. This involves the levels being filled with chickens, with the goal being to drive over or shoot as many chickens as possible. An extra unlockable mode is Secret Agent mode. It is similar to the regular mission mode and features the same levels and objectives, but different placement of objects and enemies. Also unlockable is Arcade mode, a free run through a level with the goal to cause as much destruction as possible for a high score. The game also features a two-player mode via link cable. The players compete to either activate more Satcoms or kill more chickens.</p>"},{"name":"Spy Hunter / Super Sprint","year":2005,"developer":"Black Lantern Studios, Inc.","url":"a#S.zip/S%2FSpy%20Hunter%2C%20Super%20Sprint%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Compilation","desc":"<p>A compilation of the classic arcade games Spy Hunter and Super Sprint brought to the Game Boy Advance.</p>"},{"name":"Spy Muppets: License to Croak","year":2003,"developer":"Vicarious Visions, Inc.","url":"a#S.zip/S%2FSpy%20Muppets%20-%20License%20to%20Croak%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > 2D scrolling > Spy / espionage > Licensed","desc":"<p>Kermit the Frog agent of M.U.P.P.E.T. must find three villains and spoil their evil plans in this children's game.</p><p>In \"story\" mode, stopping each villain requires completing a series of mini arcade levels such as spy car chases or snowball battles (at a choice of three difficulty levels).  These mini-games can also be played individually in \"activity\" mode.</p><p>Muppet fans will enjoy the spy themed twists on familiar characters such as Gonzo the Great as \"Dr. Nose\" or Fozzie Bear as \"Agent Triple-F\" although there is no voice acting for their dialogue and the cut scenes are slideshows not animations (a limitation of GBA design).</p>"},{"name":"Spyro 2: Season of Flame","year":2002,"developer":"Digital Eclipse Software, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Spyro%202%20-%20Season%20of%20Flame%20%28USA%29.zip","filesize":1,"score":7.2,"genres":"Action > Isometric > Platform > Puzzle elements","desc":"<p>The Gameboy Advance sequel to Spyro: Season of Ice sees Spyro the dragon once again journeying through multiple worlds, this time in search of fireflies (which give dragons their fiery breath) which have been stolen by the Rhinocs.</p><p>All the old characters from previous games are there, with Hunter and Bianca, and the player can also control Sheila the Kangaroo and Agent 9 (who is a mildly psychotic monkey).</p><p>Spyro has a few unusual abilities in this GBA game, including a fire/ice breath toggle - some items can only be affected by one or the other.</p><p>Unlike the PSX games, Spyro is presented primarily in an isometric view.</p>"},{"name":"Spyro Orange: The Cortex Conspiracy","year":2004,"developer":"Vicarious Visions, Inc."},{"name":"Spyro: Attack of the Rhynocs","year":2003,"developer":"Digital Eclipse Software, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Spyro%20-%20Attack%20of%20the%20Rhynocs%20%28USA%29.zip","filesize":1,"score":7.1,"genres":"Action > Diagonal-down > Isometric > Metroidvania > Platform > Puzzle elements > Fantasy","desc":"<p>One of the Professor's inventions has inadvertently torn a large hole in the fabric of space/time, creating a portal between the Rhynoc Lands and the Dragon Realms. Ripto, naturally, is taking full advantage of this, as he starts sending his armies of rhynocs through the portal to wreak havoc. Spyro must find somehow find a way to close the portal before Ripto succeeds in taking over the Dragon Realms.</p><p>This is Spyro's third outing on the Game Boy Advance. Features include new RPG-like elements, new upgradable breath abilities, and three playable characters (Spyro, Agent 9 the Space Monkey, and Sgt. Byrd). Bonus multiplayer Sgt.Byrd levels can also be unlocked.</p>"},{"name":"Spyro: Season of Ice","year":2001,"developer":"Digital Eclipse Software, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Spyro%20-%20Season%20of%20Ice%20%28USA%29.zip","filesize":1,"score":6.8,"genres":"Action > Top-down > Isometric > Platform","desc":"<p>Spyro the dragon returns for his first adventure on the Game Boy Advance. This time, Grendor has turned all of the fairies of the Dragon Realms into ice blocks, sending out his band of Rhynoc warriors to collect them, and use them to stop his headache. Only the fire power of Spyro, with Hunter and Sparx on hand to help, can save the fairies from a certain Panadol future. </p><p>Unlike the Playstation series, <em>Seasons of Ice</em> has the player controlling Spyro through an isometric overhead camera. However, all of Spyro's skills are still available to use, including his flame breath and glide. And the flying bonus levels (similar to that of the original Sonic series of bonus levels) make use of the Mode 7 technology in order to create the 3D like perspective (as used in <em>Mario Kart: Super Circuit</em> and <em>F-Zero: Maximum Velocity</em>).</p>"},{"name":"SRS: Street Racing Syndicate","year":2005,"developer":"Raylight Studios s.r.l."},{"name":"SSX 3","year":2003,"developer":"Visual Impact","url":"a#S.zip/S%2FSSX%203%20%28U%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Sports > Behind view > Real-time > Tricks / stunts > Direct control > Snowboarding / skiing","desc":"<p>IT'S YOU AGAINST THE MOUNTAIN<br>* BACKCOUNTRY - EXPLORE 12 DIFFERENT ENVIRONMENTS<br>* SLOPESTYLE - DOMINATE SLOPESTYLE, BIG AIR, AND SUPER PIPE EVENTS<br>* RACE - HIGH SPEED RACES, INTENSE RIVALRIES<br>* SUPER PIPE - CONQUER 60 BIG CHALLENGES</p>"},{"name":"SSX Tricky","year":2002,"developer":"Visual Impact","url":"a#S.zip/S%2FSSX%20Tricky%20%28U%29.gba","filesize":1,"score":6.4,"genres":"Sports > Behind view > Tricks / stunts > Direct control > Snowboarding / skiing","desc":"<p><em>SSX Tricky</em>, the second game in EA Sports' snowboarding series, received an adaptation for the Game Boy Advance one year after the game's release on consoles. It adapts the console game's main playing modes, but removes a lot of the details and remodels all tracks into its own 3D engine in line with the handheld's capabilities.</p><p>The game's main playing mode is World Circuit mode, taking players through either Race or Showoff competitions through eight courses. Gaining medals in World Circuit unlocks more characters to select, and courses to play in Single Event mode, which offers a Time Challenge mode in addition to Races and Showoffs. Races are competitions against four other boarders, while Showoffs require performing tricks to score points. Time Challenge is a time-limited run down a course in which performing tricks and combos is necessary to enhance the time limit. Neither board and boarder customization nor boarder rivalries from the console version made the transition to the GBA.</p><p>The tracks are based on those in the console version, but are completely redesigned. They now resemble more realistic winter sports courses and feature none of the extravagant drops, shortcuts and tunnels of the original game. The graphics engine employs texture-mapped polygons for the courses and 2D animated sprites for the boarders, with the camera always behind the player.</p>"},{"name":"Stadium Games","year":2003,"developer":"Ignition Entertainment Ltd.","url":"a#S.zip/S%2FStadium%20Games%20%28E%29.gba","filesize":1,"score":"","genres":"Sports > Behind view > Side view > Football (American) > Olympiad / mixed sports","desc":"<p>Stadium Games is a olympiad style sports game where you can compete in these six events:</p><ul><li>Shooting</li><li>Archery</li><li>Javelin</li><li>Football</li><li>Pole Vault</li><li>Hammer Throw</li></ul><p>In the Shooting game, you have to shoot down pairs of clay pigeons that are shot in from the side. You view the event from a third person perspective, and have full control of the cross hair. The rest of the events are different. They all use timing meters, one for strength and one for accuracy, where the player has to hit the button at the right spot on the meter. </p><p>Two game modes are available. Practice is the first, where one player can play any of the events at any time, without going through the rest. The second is the tournament where one or two players sharing the same machine can go through all the events. For each event the player will earn points, and there is a high score table for overall scores.</p>"},{"name":"Star Soldier","year":2004,"developer":"Hudson Soft Company, Ltd."},{"name":"Star Wars Trilogy: Apprentice of the Force","year":2004,"developer":"Ubisoft Entertainment Inc.","url":"7#Star%20Wars%20Trilogy%3B%20Apprentice%20of%20the%20Force%20%28USA%29%20%5BEn%2CFr%2CEs%5D.gba","filesize":8388608,"score":6.3,"genres":"Action > Side view > Top-down > 2D scrolling > Puzzle elements > Shooter > Flight / aviation > Sci-fi / futuristic > Licensed","desc":"<p>Based on the events of Episode IV-VI, players take control of Luke's journey to become a Jedi as he rescues Princess Leia, trains with Yoda on Dagobah, and faces Darth Vader for the final showdown.</p><p>The game is presented in a side-scrolling format, visiting all of the planets from the series, as well as engaging in a run against the Death Star and a speeder bike chase through the forest of Endor.  As Luke progresses, he goes from a simple farmboy to a full-fledged Jedi Knight, learning new Force techniques until he is ready to face Darth Vader and Emperor Palpatine aboard the second Death Star.</p><p>Also included in the game is a multi-player mode where friends can link up against each other to engage in dogfights and mini-games with ships from the Trilogy.</p>"},{"name":"Star Wars: Episode II - Attack of the Clones","year":2002,"developer":"David A. Palmer Productions","url":"7#Star%20Wars%3B%20Episode%20II%20-%20Attack%20of%20the%20Clones%20%28USA%29.gba","filesize":8388608,"score":5.5,"genres":"Action > 1st-person > Side view > Platform > Shooter > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>Ten years have passed since the Battle for Naboo, but nothing has changed. Turmoil continues to surround the Galactic Republic, with a renegade Jedi named Count Dooku leading more then a thousand solar systems against the Republic. To make matters worse, former Queen and now Senator of Naboo, Padme Amidala, is under constant threat from bounty hunters everywhere she goes.</p><p>To help protect Padme, the Jedi Council order Obi-Wan Kenobi and Anakin Skywalker to her side. As you enter the story of <em>Episode II: Attack of the Clones</em>, you will control Anakin and Obi-Wan in their quest to find the bounty hunter(s) who wish to see the Senator dead.</p><p>The game follows the script of the movie very closely, allowing you to visit the likes of Kamino, where Jango Fett hides along with the waiting Clone Army, as well as Geonosis, where the final battle takes place.</p><p>You will also have an opportunity to control Mace Windu, fly a speeder in a 1st person perspective race mode, and use the force powers of the three Jedi to defeat the many enemies. Most of the game takes place in a side-scrolling, platform view, as well as some 1st person levels using the GBA's advanced semi-3D technology (as seen in Doom).</p>"},{"name":"Star Wars: Episode III - Revenge of the Sith","year":2005,"developer":"Ubisoft Entertainment Inc.","url":"7#Star%20Wars%3B%20Episode%20III%20-%20Revenge%20of%20the%20Sith%20%28USA%29%20%5BEn%2CFr%2CEs%5D.gba","filesize":8388608,"score":7.1,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Flight / aviation > Sci-fi / futuristic > Licensed","desc":"<p>Decide which Jedi between Anakin Skywalker and Obi Wan Kenobi you would like to be; choose between 2 levels of difficulty and live the movie's storyline in single player mode.</p><p>The singleplayer mode is a side-scroller with a depth of field, which give a new dimension to explore while not in 3D. As you progress in the levels, the player can pick Mission Points that will help him to customize his character. It is actually the GBA version of the game but you can make the specials moves of the characters by pressing them on the touch screen. There is also 3 3D levels in each path that has been added to enhance the singleplayer experience.</p><p>In multiplayer, the player can pilot one of the 17 spacefighters in one of the 8 maps (2 in Coruscant, 4 in space, Hoth, Tatooine). The game is multi-card play and let you play against 3 other bots and/or players. In order to unlock all ships, the player will have to win in deathmatch against one of the movie's characters (Grievous, Luke Skywalker, Darth Vader, Anakin Skywalker, Boba Fett, Han Solo).</p>"},{"name":"Star Wars: Flight of the Falcon","year":2003,"developer":"Pocket Studios","url":"7#Star%20Wars%3B%20Flight%20of%20the%20Falcon%20%28Europe%29%20%5BEn%2CFr%2CDe%5D.gba","filesize":8388608,"score":4.6,"genres":"Action > Behind view > Shooter > Flight / aviation > Space flight > Sci-fi / futuristic > Licensed","desc":"<p><em>Star Wars: Flight of the Falcon</em> is a flight-based combat game featuring the legendary Millennium Falcon. Taking place around the time of the original Star Wars trilogy, the game offers 14 missions set near Yavin, Endor, and other planetary systems familiar to fans of the epic sci-fi series.</p><p>Players will engage TIE Fighters and fend off bounty hunters, while speeding across the galaxy to support the Rebel Alliance in its ongoing battle with the Galactic Empire.</p>"},{"name":"Star Wars: Jedi Power Battles","year":2001,"developer":"HotGen Ltd.","url":"7#Star%20Wars%3B%20Jedi%20Power%20Battles%20%28Europe%29%20%5BEn%2CFr%2CDe%2CEs%5D.gba","filesize":8388608,"score":5.9,"genres":"Action > Diagonal-down > Side view > Isometric > Sci-fi / futuristic > Licensed","desc":"<p><em>Star Wars: Jedi Power Battles</em> is a port of Star Wars: Episode I - Jedi Power Battles. Because of the technical limitations of the platform, the levels were converted into an isometric perspective. The basic layout and setting remain the same from the original version, but there are significant differences in level design as well.</p><p>The player takes control of either Qui-Gon Jinn, Obi-Wan Kenobi or Mace Windu (and an additional character who is unlocked after beating the game once) and fights through ten levels which are loosely based on the movie <em>Star Wars: Episode I - The Phantom Menace</em>. The gameplay focuses on melee combat and therefore the Jedi have various related moves at their disposal, e.g. kicks, slashes or reflecting laser fire with the lightsaber. There are also various jumping puzzles.</p>"},{"name":"Star Wars: The New Droid Army","year":2002,"developer":"Helixe","url":"7#Star%20Wars%3B%20The%20New%20Droid%20Army%20%28Europe%29%20%5BEn%2CFr%2CDe%2CEs%5D.gba","filesize":8388608,"score":6.1,"genres":"Action > Diagonal-down > Isometric > Platform > Sci-fi / futuristic > Licensed","desc":"<p>Join Anakin Skywalker as he sets out after Count Dooku, who is close to creating the strongest Droid Army ever developed. Not only is the young jedi out for revenge from their last meeting, but he must also foil plans to unleash the Droid Army on the Republic.</p><p>Graphically similar to Jedi Power Battles (also on GBA), you travel through the many levels from a top down/isometric perspective, allowing you to see all around Anakin.</p><p>Anakin himself uses his lightsabre as his prime weapon, with a range of force moves available to help him through the strongest of droid challenges. Along the way you will meet with familiar characters from the Star Wars universe, including Jedi Master Yoda &amp; Jabba the Hutt, plus some new faces.</p>"},{"name":"Star X","year":2002,"developer":"Graphic State Limited","url":"a#S.zip/S%2FStar%20X%20%28U%29%20%28M6%29.gba","filesize":1,"score":6.5,"genres":"Action > Behind view > Shooter > Sci-fi / futuristic","desc":"<p>You have been sent on a peace envoy to a newly-discovered alien race, only to find out that what they want is not peace, but the human race as slaves. You must fight your way back to Earth in order to warn the human race of the threat that these aliens pose.</p><p>Gameplay consists of 3rd-person shooting, viewed from behind your ship, with different weapons, weapon upgrades, and shield power-ups,  being picked up during each stage.  Some stages end in a boss fight, while others simply require you to perform a task, such as shooting all the space mines within a given stage, before moving on.</p>"},{"name":"Starsky & Hutch","year":2003,"developer":"Spellbound Interactive Ltd.","url":"a#S.zip/S%2FStarsky%20%26%20Hutch%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Shooter > Direct control > Automobile > Contemporary > Crime > Licensed","desc":"<p>The Game Boy Advance version of <em>Starsky &amp; Hutch</em> is different from the console versions, but still a racing game in full 3D. The 3D polygonal graphics are very different and the violence has been toned down due to Nintendo's policies. Some of the voice-overs are intact, and others are absent, due to the GBA's limitations. The episodes are presented as levels, and split into groups.</p>"},{"name":"Steel Empire","year":2004,"developer":"Hot-B Co., Ltd.","url":"a#S.zip/S%2FSteel%20Empire%20%28E%29.gba","filesize":1,"score":7.1,"genres":"Action > Side view > Shooter > Steampunk","desc":"<p>The skies are populated by zeppelins, large battleships and flying fortresses. In this age of steel, the Motorhead Empire has conquered and enslaved almost the entire planet. The last free nation, the Republic of Silverhead, tries to bring the Motorhead Empire down using its newly developed weapon, the lightning bomb.</p><p>Apart from its unusual Steampunk setting, Steel Empire is a fairly traditional side-scrolling shooter. At the beginning of every level, the player gets to choose between a striker plane and a zeppelin. While the plane is faster, the zeppelin has a longer life bar and can therefore sustain more damage. Both ships use the same standard weapon, which can be fired forwards or backwards, as well as bombs that are released automatically while firing. Also available is a limited number of lightning bombs that damage or destroy all enemies on screen. </p><p>Defeated enemies often drop power-ups, including hearts that replenish health, lightning bombs, bonus points, 1-UPs, options and experience points.</p><p>Options are small \"drones\" that fly alongside the player's ship and mimic its behaviour.</p><p>Experience points can be collected to level up the ships' weapons (up to level 20) and thereby increase their fire power.</p>"},{"name":"Strawberry Shortcake: Summertime Adventure","year":2004,"developer":"Gorilla Systems Corporation","url":"a#S.zip/S%2FStrawberry%20Shortcake%20-%20Summertime%20Adventure%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Simulation > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>Join Strawberry Shortcake and friends as they prepare for the Strawberryland Bakeoff! Adventure through Strawberryland and tend your garden to grow the biggest, sweetest berry of all and take home first prize!<br>Features all of your favorite characters including Apple Dumplin', Orange Blossom, Custard, Pupcake and others<br>Play in Berry Garden Mode and Strawberryland Adventure Mode that features six large worlds and various challenges<br>Use power-ups like Apple Dash and Blueberry Bombs to give Strawberry Shortcake special skills<br>Visit your \"berry\" best friends at strawberry-shortcake.com</p>"},{"name":"Street Fighter Alpha 3","year":2002,"developer":"Capcom Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Street%20Fighter%20Alpha%203%20%28USA%29.zip","filesize":1,"score":8.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting","desc":"<p><em>Street Fighter Alpha 3</em>, the third game in the Alpha series, has a total of 31 fighters, the most in the series so far. New characters include old favorites E. Honda, Blanka, Vega, Cammy, T. Hawk, Dee Jay, Juni, and Juli. Some of the newest fighters on the block include a former Final Fight character (Cody, who has been in jail since the last Final Fight game, or so his clothing suggests), Karin Kanzuki, and Rainbow Mika.</p><p>The major difference between this Alpha and the last two are the new play modes World Tour, Arcade, VS, Training and Entry. </p><p><strong>World Tour</strong> - Simply choose your fighter and travel around the world, fighting the hometown heroes that you run into. The more fights you win, the stronger your fighter becomes. You can also learn new moves, and there are three levels of Super moves to choose from before you start each round (called Isms).</p><p><strong>Arcade</strong> - A simple conversion of the arcade version. Beat each fighter with your chosen warrior, in three rounds per match (much the same as past versions of Street Fighter)</p><p><strong>Versus</strong> - Two human players battle it out. </p><p><strong>Training</strong> - A good way to learn all the super moves that are available, against a dummy.</p><p><strong>Entry</strong> - If you save your character during the World Tour mode, you can upload him here to use in the other modes in the game (especially handy for Training).</p><p>Finally, if you complete certain areas of the game three new fighters become available, including another old favorite in Guile, Evil Ryu, and Shin Akuma.</p>"},{"name":"Strike Force Hydra","year":2004,"developer":"Digi-Guys Ltd.","url":"7#Strike%20Force%20Hydra%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Action > Top-down > 2D scrolling > Shooter","desc":"<p>Strike Force Hydra is a vertically scrolling shooter, with 8 levels, each divided into 3 stages.</p><p>Each level follows the same setup, standard scrolling level with enemies and a mini-boss, then an obstacle course fly through a tunnel, then another shooting level with enemies and an end boss.</p>"},{"name":"Stuntman","year":2003,"developer":"Velez & Dubail Dev. Team","url":"a#S.zip/S%2FStuntman%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.2,"genres":"Racing / Driving > Behind view > Arcade > Tricks / stunts > Automobile > Track racing","desc":"<p>You play a stuntman who has the task of completing some difficult and challenging stunts for a film director. Get it right and he'll ask you on for another project, and pay you big time. Get it wrong, and it's time for a career change.</p><p>Apart from the Movie Making mode, Precision Tests will have you completing courses of varying difficulty, where you'll have to drive forward and reverse, launch off of jumps, dodge through posts and then park inside a zone before time runs out. In Jump Tests, you'll be out to grab letters while jumping off of platforms to catch them while airborne. </p><p>You can also play against a friend in the various multiplayer modes to see who has the best control over their car.</p>"},{"name":"Sudoku Fever","year":2006,"developer":"puzzle.tv","url":"a#S.zip/S%2FSudoku%20Fever%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Puzzle > Top-down","desc":"<p>A sudoku game for the Game Boy Advance. <em>Sudoku Fever</em> features unlimited puzzles, four puzzle sizes (from 4x4 to the standard 9x9), four difficulty levels, and a solver to let you put in your own puzzles. Inside a puzzle, there are undo/redo options, save/restore, sound and music, multiple backgrounds and symbol sets, error highlighting and pencil marks, and automatic solving options.</p>"},{"name":"Sum of All Fears, The","year":2002,"developer":"Red Storm Entertainment, Inc.","url":"7#The%20Sum%20of%20All%20Fears%20%28USA%29%20%5BEn%2CFr%2CDe%2CEs%2CIt%5D.gba","filesize":8388608,"score":7,"genres":"Action > 3rd-person (Other) > Shooter > Licensed","desc":"<p><em>The Sum of all Fears</em> is a shooter reminiscent of Rogue Spear. The look and feel is alike, although it's simplified in its gameplay mechanics. It is also not a huge departure in comparison to the original version, but obviously converted to a top-down perspective.</p><p>The game's story is built around the Tom Clancy book with the same title. You take control of a team of elite fighters trained for hostage rescue and anti-terror operations. Each and every team member is the best of the best. The first mission is to recapture a TV station seized by terrorists who broadcast their demands into the world. They have hostages, too, so you need to ensure that no-one gets hurt. But that's only the beginning of a global campaign against terrorism taking in 15 missions, each with a secondary and primary objective.</p><p>In this version, there are various team members to choose from which vary in their statistics (e.g. stealth, aim or reflex), and equipment. You can't make your own mission plans or switch between the team members (the others follow automatically and can't be given commands), so it comes down to controlling a team member, shooting every terrorist you see and performing various tasks (disarming security systems etc.). After finishing the campaign, the game unlocks the \"Lone Wolf\" mode which allows to replay the game with only one team member.</p>"},{"name":"Summon Night Craft Sword Monogatari: Hajimari no Ishi","year":2005,"developer":"Flight-Plan Inc.","url":"a#S.zip/S%2FSummon%20Night%20-%20Craft%20Sword%20Monogatari%20-%20Hajimari%20no%20Ishi%20%28J%29.gba","filesize":1,"score":"","genres":"Action > Role-playing (RPG) > Side view > Top-down > Anime / Manga > Real-time > Fantasy","desc":"<p>Third game in the Summon Night \"Swordcraft\" action-RPG spin-offs. You take the role of a young craftsknight (a combination of knight and weaponsmith) whose master has been recently murdered. His guardian creature appears to you and admits to being responsible for his death, and joins you to try to atone for its sins as you attempt to unravel the conspiracy that caused his death and also finish your training.</p><p>As the other games in the series the game is a top-down action RPG in which you explore the game world talking to NPCs for items and clues and dungeon-crawl to gather the materials needed to create your weapons. When in combat, the game switches to a side-scrolling view in which you attack and attempt to avoid your enemies attacks in real-time. Additionally you can now summon creatures and control them in all battles to take advantage of their enhanced abilities.</p>"},{"name":"Summon Night: Swordcraft Story","year":2003,"developer":"Flight-Plan Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Summon%20Night%20-%20Swordcraft%20Story%20%28USA%29.zip","filesize":1,"score":7.5,"genres":"Role-playing (RPG) > Strategy > Side view > Top-down > Real-time > Action RPG > Licensed","desc":"<p>Three years after your father was lost, you are an apprentice Craftknight. A tournament is held to find the next Craftlord and you're in it. But first, you need a weapon. Unlike many RPGs, you cannot find or buy weapons to use in this game. Instead, you must learn to make your own weapons. To make a weapon, you'll need to know the technique of making a specific weapon as well as the raw materials to make it with.</p><p>You aren't alone in the game. As a partner, you will get a Guardian Beast who will offer magic to help you in your battles as well as helping you make your weapons. You can get four different Guardian Beasts depending on your choices, each with different abilities.</p><p>Besides the tournament, you need to gather raw materials to make better weapons by travelling through a large dungeon and battling the creatures you find there in a side-scrolling battlefield similar to Tales of Phantasia. You will also have the opportunity to spend time with your summon creature and certain other characters each night. Who you choose to spend time with will affect the story somewhat.</p>"},{"name":"Summon Night: Swordcraft Story 2","year":2004,"developer":"Flight-Plan Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Summon%20Night%20-%20Swordcraft%20Story%202%20%28USA%29.zip","filesize":1,"score":7.8,"genres":"Role-playing (RPG) > Strategy > Side view > Top-down > Action RPG > Licensed","desc":"<p>You are a male or female apprentice Craftknight and the Edge Fencer. It is your job to protect the seal trapping Goura, a stray summon creature who is too powerful for anyone to control. Similar to Summon Night: Swordcraft Story, your father died 3 years ago. He died trying to trap Goura after a summoner tried to free Goura and take control of him. Now it is your job to protect that seal, while you are working at becoming a Craftknight.</p><p>A Craftknight is a person who creates weapons and uses them, similar to an armorer. However, these weapons are made with the combined power of your hammer and your Guardian Beast. You will have the ability to choose between 4 Guardian Beasts shortly after starting the game. Each one has different abilities and will have different conversations throughout the game. Unlike in the previous game, you do not learn techniques for making weapons, but instead you use shapestones to create a weapon type. There are 6 weapon types that can be made and you will need at least a basic weapon from each type in order to reach all areas of the game. The actual weapon you create will be determined by the material you use to create it. If you make it with Iron Ore, it will be one kind of weapon, while if you make it with Aqua Ore, it will be another kind of weapon. Later, you will have the ability to upgrade the weapons up to three times each.</p><p>Battles are the same as in the previous game. You fight in a side scrolling area with up to 4 enemies. You can use your weapon to attack, or use your Guardian Beast's magic to attack, heal or protect you, or enchant your weapon in some way. Some weapons will also have special attacks that can do even more damage. In this game, you'll have battles above and below ground, rather than just in the dungeon and arena. You also have the ability to Mono Shift, where you will change into a more powerful being. You can only do this once before recharging the item that allows you to Mono Shift.</p>"},{"name":"Super Army War","year":2005,"developer":"","url":"7#Super%20Army%20War%20%28USA%29.gba","filesize":4194304,"score":"","genres":"Action > Side view > 2D scrolling > Shooter > Flight / aviation > Helicopter","desc":"<p><em>Super Army War</em> is a 2D side-scrolling shooter with a military scenery. The player can control two different air crafts depending on the mission: a Huey or a WWII-era propeller fighter. Each vehicle has its own mechanics such as the ability to pick-up troopers from the ground for the Huey, and a higher speed for the fighter. As he flies through each of the sixteen missions, the player must destroy enemy tanks, soldiers and helicopters, and protect his own army. The goal is to take over enemy bunkers to gain credits and destroy the enemy base. As the game progresses, other weapons can be acquired.</p>"},{"name":"Super Bubble Pop","year":2002,"developer":"Runecraft Ltd.","url":"a#S.zip/S%2FSuper%20Bubble%20Pop%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%29.gba","filesize":1,"score":6.1,"genres":"Puzzle > Diagonal-down > Real-time > Tile matching puzzle","desc":"<p>A combination of Tetris and Bust-A-Move, Super Bubble Pop has you controlling a character along the bottom of the playfield, who you use to throw bubbles of different colours towards the other side of the playfield. As you throw them down the line, they will stack up in piles of six. Linking three bubbles together will pop them (remove them from the field), and if there is a stack of six, the bubbles on the way will form a new stack in front of it.</p><p>The aim of the game is to remove all bubbles from the field, but there is another way of completing a game. Tokens will appear during play, and by collecting enough, you can move on to the next round regardless of what you have on the playfield.</p>"},{"name":"Super Bust-A-Move","year":2001,"developer":"Taito Corporation","url":"a#S.zip/S%2FSuper%20Bust-A-Move%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":7.3,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Tile matching puzzle","desc":"<p><em>Super Bust-A-Move</em> is a real-time puzzle game similar to its predecessors in the <em>Bust-A-Move</em> series. It adds a new multiplayer mode and features graphical enhancements.</p><p>The aim of the game, as with the previous titles in the series, is to remove a collected number of coloured bubbles from the game screen. To do so, at the bottom of the screen, you aim and fire the coloured bubbles from a launcher, sending the bubbles upwards into the container. Match three or more together of the same colour to clear them from the screen. If you're too slow, the collection of bubbles moves down the screen towards you, and the game will end if it reaches the bottom.</p><p>Classic mode features a number of bubble puzzles previously seen in the Bust-A-Move series, while Normal mode has some new variations on the bubble removing theme. Two players can also compete against each other.</p>"},{"name":"Super Collapse! II","year":2004,"developer":"GameHouse, Inc.","url":"a#S.zip/S%2FSuper%20Collapse%20II%20%28U%29.gba","filesize":1,"score":7.2,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Tile matching puzzle","desc":"<p>The game concept is that you have to eliminate clusters of at least 3 blocks with your mouse, but the more you remove at once, the more you score. Once that happens, all blocks above the ones, which have vanished, will fall down and close the gap.</p><p>Beneath the lowest row, there you see the new row building up. Once all blocks are present, this row will be now the lowest row, while all others are moving up. Once one block reaches the top of the playfield, you loose.</p><p>Each individual level has a preset value of rows, which will build up. To win a level, all you have to do, is to prevent that a full vertical row (from bottom to top) gets stacked up.</p><p>The game offers 4 game modes: <strong>Traditional</strong>, <strong>Puzzle</strong>, <strong>Relapse</strong>, and <strong>Strategy</strong>. Two of them need a brain, while the other two just need a fast hand.</p><p><strong>Traditional</strong> works like explained above. New rows show automatically, with increasing speed not only from level to level, but also in a level. Means: the level starts slow, but in the end, new rows will complete every second. Power-Ups are available in this game mode.</p><p><strong>Relapse</strong> works exactly like <strong>Traditional</strong>, but with one major difference. The action isn't just limited to the bottom of the playfield, in fact, both bottom and top now filling with blocks. Power-Ups used on one side affecting both. How to win is the same, but you loose, when blocks from one side touching the other.</p><p><strong>Strategy</strong> is one of the two game modes where you must think. Clicking fast will only help to see the Game Over screen. New rows won't appear automatically, instead for each cluster you remove, a full new line will appear. So you have to plan carefully before neutralizing a cluster.</p><p><strong>Puzzle</strong> is the game mode, where no new lines appear. Also there are no Power-Ups here. But this is the most complex game mode. Your task is to completely remove <strong>all</strong> blocks, if at least one block is still available, you loose. There is also no time limit, so you can think as long as you want.</p><p>The first three game modes offering bonus levels, which works like the <strong>Puzzle</strong> mode. So, if one block remains, you only scoring the normal points for removed clusters. Only when all blocks are removed, you score the bonus points. There are only two differences: it isn't so complex, and you only have 15 seconds time.</p><p>There are 5 different Power-Ups in the game (2 good, 2 bad, 1 depending of the situation): <em>Platform Block</em> (won't move, just blocking the vertical row where it is), <em>Indestructible Block</em> (does move like a regular block, but can't removed with normal actions), <em>Color Bomb</em> (one of each of the 5 colors, will detonate all same colored blocks in it's big radius), <em>Super Bomb</em> (shorter range than the Color Bomb, but blow up all blocks, regardless the color; only way to remove Platform/Indestructible Blocks), and finally, the <em>Gravity Block</em> (only available in Relapse Mode, will shift all blocks from the side where it was activated to the other side).</p>"},{"name":"Super Dodge Ball Advance","year":2001,"developer":"Million Co., Ltd.","url":"a#S.zip/S%2FSuper%20Dodgeball%20Advance%20%28E%29.gba","filesize":1,"score":7.1,"genres":"Sports > Diagonal-down > 2D scrolling > Anime / Manga > Dodgeball","desc":"<p><em>Super Dodge Ball Advance</em>, based on the NES classic, takes place in the not-so-distant future when the sport of preteens has become the sport of kings and national pride hangs on the home team's ability to triumph in the number-one worldwide sport. Gamers choose a national team and compete against eight other countries in tournament-style bouts. You can knock the competition woozy with all sorts of different moves, customize your team by defining the attributes of your players, and play head-to-head against a friend's Game Boy Advance with the separately sold communication cable.</p>"},{"name":"Super Dropzone: Intergalactic Rescue Mission","year":2002,"developer":"Eurocom Developments Ltd","url":"7#Super%20Dropzone%3B%20Intergalactic%20Rescue%20Mission%20%28USA%29.gba","filesize":4194304,"score":7.1,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Super Dropzone: Intergalactic Rescue Mission</em> is a sequel to Archer MacLean's Dropzone. The game takes place ten years after the happenings of the original game. Back then a selection of the finest humans in the world went to an expedition to Jupiter's moon Io in search for valuable minerals. They were attacked by an alien race that the player had to defend them from. Now they have managed to establish bases on three more of Jupiter's moons, Callisto, Ganymede and Europa. The alien threat is still real however and they still need to be protected by the player.</p><p>The gameplay is mostly the same as the original <em>Dropzone</em> although it features some new weapons and end of level boss fights. The player controls a spaceman with a jetpack and can fly in all directions above the moon surface while killing wave after wave of aliens. At the same time the player has to protect the ten people that are assigned to the moon by taking them to the dropzone landing pad. </p><p>The action takes place on the moons mentioned above as well as on Jupiter itself. At the last level on each moon the player has to defeat a planet guardian. To do this the player has to hit them in their glowing green nerve centre that is exposed at times as they move around. Each wave starts with all remaining humans being beamed up by a leader enemy and to release the men it has to be defeated.</p>"},{"name":"Super Duper Sumos","year":2003,"developer":"Handheld Games LLC","url":"a#S.zip/S%2FSuper%20Duper%20Sumos%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > Beat 'em up / brawler > Licensed","desc":"<p><em>Super Duper Sumos</em> is an action game based off the Nickelodeon's hit series of the same name. Three 18-year-old Sumo wrestlers are available: * Boomer, Defender of Peace</p><ul><li>Kimo, Defender of Honor, or</li><li>Mamoo, Defender of Truth</li></ul><p>The three ancient heroes travel to the modern world to defend all that is good and to defeat the evil Ms. Mister and her minions at Build and Destroy Incorporated. All three can increase their size, and use their special powers to defeat their enemies. Boomer performs the Gluteus Maximus, used to squash enemies with his butt; Kimo performs The Honorable Thunderball, where he runs at full speed before rolling over his enemies; Mamoo uses his Sumo Squeeze to squeeze the life out of his enemies. Together they must use their ancient powers to save the world.</p>"},{"name":"Super Ghouls 'N Ghosts","year":2002,"developer":"Capcom Co., Ltd.","url":"a#S.zip/S%2FSuper%20Ghouls%20%27N%20Ghosts%20%28U%29.gba","filesize":1,"score":8,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control > Fantasy > Horror","desc":"<p>4 years after Arthur saved Princess PrinPrin from the evil demon Loki, a wonderful celebration is about to take place! Arthur and the Princess are engaged, and the wedding is to take place at last! Thousands from around the kingdom have come to witness this joyous event!</p><p>But somewhere in the darkness of the forest lurks a horrible evil...</p><p>Arthur and PrinPrin are spending a quiet moment locked in embrace, when she is suddenly snatched away by a huge demon! As her screams echo through the night, Arthur rushes from the castle, and pursues the demon to the graveyard, where he is greeted by hundreds of horrible ghouls and monsters!</p><p>Now, this time, they've gone too far...Arthur is ready for them...</p>"},{"name":"Super Hornet F/A 18F","year":2004,"developer":"UK Magic","url":"a#S.zip/S%2FSuper%20Hornet%20FA%2018F%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Simulation > 1st-person > Shooter > Flight / aviation > Licensed","desc":"<p>Defend the coalition and defeat the Iraqi forces with an array of high-powered weaponry in F/A-18F Super Hornet. Secure diplomacy in the Middle East by eliminating the enemy, rescuing international diplomats and tracking down major enemy leaders. Can you live up to the challenge?<br>* Fly more than 19 different land and sea missions in real Iraqi cities<br>* Experience heart-pounding combat against authentic weapons of war<br>* Maneuver towards bogeys and targets using the AWACS operational radar grid<br>* Master first-person carrier-based take offs and landings of blue water operations</p>"},{"name":"Super Mario Advance","year":2001,"developer":"Nintendo R&D2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Super%20Mario%20Advance%20%28USA%2C%20Europe%29.zip","filesize":1,"score":8,"genres":"Action > Side view > Arcade","desc":"<p>This game consists of Super Mario Bros. 2 and Mario Bros. together in one Pak. There's all the running, jumping, and veggie-flinging from the original Super Mario Bros. 2, plus new enemies and bigger items. Other changes include a scoring system, voice clips, and a new boss enemy, a robotic Birdo dubbed Robirdo, The game now includes a 100 red ace coins to collect throughout the game. There are 5 red coins per stage and when all 5 are collected the player will earn an extra life. After completing the game, players can try the Yoshi Challenge mode, where two Yoshi eggs are now hidden per stage throughout the game for a total of 40 hidden eggs. The challenges comes from the aspect that both eggs have to be collected per stage without losing a life.</p><p>In the updated arcade classic Mario Bros., you can work together or have a brawl bumping off baddies and collecting coins.</p>"},{"name":"Super Mario Advance 2: Super Mario World","year":2001,"developer":"Nintendo Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Super%20Mario%20Advance%202%20-%20Super%20Mario%20World%20%28USA%2C%20Australia%29.zip","filesize":1,"score":8.7,"genres":"Action > Side view > Platform > Puzzle elements","desc":"<p>Mario and his brother Luigi are back for this second Super Mario Advance title: the first being a remake of Super Mario Bros. 2. The brothers, along with Princess Peach, are vacationing in Dinosaur Island. Then when they least expect it, Bowser once again kidnaps Peach and takes her to his castle. On the way to rescue her, the plumbers find Yoshi, who tells them that Bowser has also turned his friends into eggs. So the Mario brothers, with the help of Yoshi, must rescue the princess and Yoshi's pals.</p><p>Mario and Luigi can run and jump through each level. They can also collect power-ups to gain new skills. The Super Mushroom makes them grow and gain more defense. The Fire Flower lets the brothers throw fireballs to defeat enemies. The Starman makes them invincible. The plumbers can gain the ability of flight with the Cape Feather.</p><p>Yoshi can help Mario and Luigi if they find an egg. The green dinosaur can use his tongue to eat enemies or grab power-ups. He can walk across certain enemies with his shoes. Yoshi can eat differently coloredKoopa shells to briefly gain more abilities. For instance, the blue shell gives him wings, red shells let him spit fireballs, and the yellow shell allows him to stomp the ground.</p><p>This update over the original Super Nintendo version adds characters' speech (as heard in <em>Super Mario</em> games since Super Mario 64). Up to four players can compete in a modernised version of the classic Mario Bros. game, included as an extra to the main game.</p>"},{"name":"Super Mario Advance 3: Yoshi's Island","year":2002,"developer":"Nintendo R&D2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Super%20Mario%20Advance%203%20-%20Yoshi%27s%20Island%20%28USA%29.zip","filesize":1,"score":8.7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p><em>Yoshi's Island: Super Mario Advance 3</em> is a conversion of Super Mario World 2: Yoshi's Island, which stars the dinosaur Yoshi as the main character. It includes six secret levels not found in its SNES counterpart. Following the same style in general as other Mario games, this is a platform game which involves you trying to get to the end of the levels while keeping Baby Mario safe from enemies.</p><p>This game contains Mario Bros., which is also available on Super Mario Advance and Super Mario World: Super Mario Advance 2.</p>"},{"name":"Super Mario Advance 4: Super Mario Bros. 3","year":2003,"developer":"Nintendo R&D2","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Super%20Mario%20Advance%204%20-%20Super%20Mario%20Bros.%203%20%28USA%2C%20Australia%29%20%28Rev%201%29.zip","filesize":1,"score":8,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Super Mario Advance 4: Super Mario Bros. 3</em> is an enhanced re-release of Super Mario Bros. 3.The two most obvious changes are the updated graphics (based on the version in Super Mario All-Stars) and the replacement of Mario Bros. with the remake version included in all <em>Mario Advance</em> titles.</p><p>Additionally there are a big number of smaller changes, e.g. an additional starting cutscene, various gameplay changes, some redesigned levels to fit the smaller screen or added voice acting.</p>"},{"name":"Super Mario Bros.","year":2004,"developer":"Nintendo Co., Ltd."},{"name":"Super Mario Bros. 2","year":2004,"developer":"Nintendo Co., Ltd."},{"name":"Super Monkey Ball Jr.","year":2002,"developer":"Realism","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Super%20Monkey%20Ball%20Jr.%20%28USA%29.zip","filesize":1,"score":6.9,"genres":"Action > Puzzle > Behind view > Diagonal-down > Direct control","desc":"<p>Based on the GameCube series of the same name, <em>Super Monkey Ball Jr.</em> has you in control of 3D style arenas, each with a varying degree of difficulty and objectives. Your little monkey, inside a ball, relies on your movement of the arena to get to the required objectives (collecting items, getting to the finish line in under a certain time limit, etc.).</p><p>Apart from the single player puzzle experience (which includes more then 60 arenas), up to four people can play a collection of mini-games (which you must unlock in the single player game). Play monkey bowling (aka ten pin bowling), monkey fight (knock the other three players' monkey ball out of the circle arena) or an 18 hole mini golf challenge.</p>"},{"name":"Super Puzzle Fighter II","year":2003,"developer":"Capcom Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Super%20Puzzle%20Fighter%20II%20%28USA%29%20%28Rev%201%29.zip","filesize":1,"score":7.8,"genres":"Puzzle > Real-time > Falling block puzzle","desc":"<p>A Tetris-like puzzle game featuring popular characters from many Capcom games.</p><p>Colored gems fall from the top of the screen in pairs, but this time lining up those of the same color is not enough. To break the gems and punish your opponent with counter gems you have to place a crash gem of the same color next to the gems. If you make a block of gems of the same color they'll fuse, forming a power gem. Breaking a power gem sends more counter gems to your opponent than breaking the same amount of gems in some other configuration. But the ultimate attack is breaking power gems in chain.</p>"},{"name":"Super Real Mahjong Dousoukai","year":2004,"developer":"Aruze Corp.","url":"a#S.zip/S%2FSuper%20Real%20Mahjong%20Dousoukai%20%28J%29.gba","filesize":1,"score":"","genres":"Strategy > 1st-person > Anime / Manga > Cards / tiles","desc":"<p><em>Super Real Mahjong Dōsōkai</em> is the second handheld game in the <em>Super Real Mahjong</em> series. Due to being on a Nintendo system, the nudity has been eliminated. However, the nudity has been sacrificed in order to bring all the girls from the entire series to the game. The player picks a group of girls from a previous arcade entry (with the exception of PII and PIII, which are grouped together like the home port, and PI, which isn't included because it only included a generic opponent and never received any ports). After the player makes a selection, the computer randomly selects an order for the girls, and the player must face them in this order. After defeating an opponent in mahjong, the player will get a picture as a reward, sometimes risque, but not nude.</p>"},{"name":"Super Robot Taisen A","year":2001,"developer":"A.I Co., Ltd.","url":"a#S.zip/S%2FSuper%20Robot%20Taisen%20A%20%28J%29.gba","filesize":1,"score":"","genres":"Strategy > Top-down > Anime / Manga > Turn-based > Tactical RPG > Turn-based strategy > Mecha / giant robot > Sci-fi / futuristic > War > Licensed","desc":"<p>After numerous conflicts around Earth, peace has finally come, if only temporarily. A race of extraterrestrials, Barm (バーム, from the animated series <em>Tōshō Daimos</em>), escaping their dying home planet, come to the Earth Orbit as refugees. While initially the Earth Federation was willing to accept them into the Space Colonies, the assassination of the diplomatic mission results in the war with the extraterrestrials. Meanwhile, an empire on the Moon declares independence and assaults the Federation, and the Mars Colony goes missing after an attack by an unknown enemy. On Earth, monsters of Dr. Hell (<em>Mazinger Z</em>) start rampaging through again. The only saving grace for the Federation is the 13th Independent Battalion, Londo Bell (from <em>Char's Counterattack</em>). However, none of the members of the team really know who sowed the seeds of war. The battalion bands together to find out.</p><p>This is the first game in the <em>Super Robot Wars/Taisen</em> franchise released for the Game Boy Advance. Graphics-wise, the game shares many similarities with the games in the Classic timeline, especially <em>F</em> and <em>F Final</em>. Units in combat do not have battle animations and they are drawn in the \"super-deformed\" style. In terms of gameplay, the game is a classic tactical RPG with many Japanese robot franchises. Unlike the previous entries in the series, the game introduces a loyalty system, where units that assist other units by way of support attack or defense can increase their damage or defense rate every time they do it. Also, defensive items such as shields now have their own separate HP bar.</p><p>Like other SRW games starting from F, F Final and Alpha, players are given the option of choosing their main character and their robot type. Depending on the choice of the type of robot or choices made by the player character mid-game, the story can branch out in different directions. During intermissions, players can customize pilot skills and upgrade their current robot roster.</p>"},{"name":"Super Robot Taisen: Original Generation","year":2002,"developer":"Banpresoft Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Super%20Robot%20Taisen%20-%20Original%20Generation%20%28USA%29.zip","filesize":1,"score":7.4,"genres":"Strategy > Top-down > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p>In the near future, a team of scientists discover alien technology embedded inside meteors, which leads them to conclude that Earth will be invaded by aliens! You must command your very own giant robot (dubbed \"Personal Troopers\") with rockets, swords, guns or lasers throughout multiple missions and two different storylines!</p><p>The game follows in the tradition of the previous Super Robot Taisen games: You must control an army of huge robots to defend and attack against an enemy invasion. You can do this by air, sea and land. Every mission contains several requirements you must fulfill in order to proceed to the next stage - you must order your mechs to move, attack or defend depending on the situation at hand, all while experiencing the battle through cutscenes which show the fight just as it happens.</p>"},{"name":"Super Robot Taisen: Original Generation 2","year":2005,"developer":"Banpresoft Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Super%20Robot%20Taisen%20-%20Original%20Generation%202%20%28USA%29.zip","filesize":1,"score":8.1,"genres":"Role-playing (RPG) > Strategy > Top-down > Anime / Manga > Turn-based > Mecha / giant robot","desc":"<p>Super Robot Taisen: Original Generation 2 is a strategy RPG in which players lead a small force of mechs in a fight to save humanity from an alien invasion. The designs of the mechs, pilots, and attacks are heavily influenced by anime. </p><p>The combat system of this game is similar to its predecessor. The player controls multiple mechs and issues commands in a turn-based fashion. Each mech pilot has \"spirit commands\" that can be used to strengthen a mechs abilities such as its hit or dodge rate. After moving a unit, the player is usually given the option to attack an enemy with an attack from a list. After all of the player's mechs have been moved, the AI gets a turn to move its mechs. If a player mech is attacked, the player has the option of counter-attacking, attempting to evade, or defending.</p><p>Super Robot Taisen: Original Generation 2 does include a few minor changes to the battle system. For one thing, a new attack type (known as a chain attack) allows a unit to strike multiple enemies in a single blow. Also, the AI has been vastly improved.</p><p>The graphics of Super Robot Taisen: Original Generation 2 have been enhanced from the graphics of the original. Attacks from mechs now have a more fluid motion and are generally more interesting to look at.</p><p>The game's story picks up six months after the original Super Robot Taisen: Original Generation left off. Most people on Earth are still trying to recover from the battle with the Aerogaters, but a small remaining faction of the Divine Crusaders is still trying to further their goals. Once again, it's up to the SRX and ATX teams of the EFA to put a stop to their activities and restore order. However, they are soon interupted by two new groups of mysterious enemies: the Einsts and the Inspectors.</p>"},{"name":"Super Street Fighter II: Turbo Revival","year":2001,"developer":"Capcom Co., Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Super%20Puzzle%20Fighter%20II%20%28USA%29%20%28Rev%201%29.zip","filesize":1,"score":7.8,"genres":"Action > Side view > Fighting","desc":"<p>In this GBA conversion, everything is here the way it used to be, including the entire list of fighters, moves and bonus stages. 2 players can fight it out against each other as well. Also included is a team battle mode (select more then one character, much like X-Men vs Street Fighter) and a character edit (similar to Street Fighter Alpha 3), and a new zoom feature where the camera zooms in and out of the action.</p>"},{"name":"Superman Returns: Fortress of Solitude","year":2006,"developer":"Santa Cruz Games","url":"a#S.zip/S%2FSuperman%20Returns%20-%20Fortress%20of%20Solitude%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Puzzle > Side view > Top-down > 2D scrolling > Fixed / flip-screen > Real-time > Licensed","desc":"<p><em>Superman Returns: Fortress of Solitude</em> is a tie-in to the 2006 film <em>Superman Returns</em>. Unlike most Superman games, which have a heavy action focus, <em>Fortress of Solitude</em> is instead primarily a puzzle game, with only minor action elements.</p><p>The game consists of twenty chapters, each consisting of a set of crystals in the Fortress of Solitude. Behind each crystal is one puzzle challenge. There are two kinds of puzzles: Kryptonex is a Sudoku variant with crystals instead of numbers. The board of cells must be filled with crystals, with only one kind of crystal per row, column and group allowed. The board is pre-filled with some crystals so players can deduce where to begin.</p><p>The second type of puzzle is called Crystallization. In this game, rows and columns must be filled with crystals. Completing a row or column energizes it and removes the crystals. The goal is to energize the entire board. Crystals (taken from a group of three, with random additions after removal) can only be placed next to other crystals that have either the same shape or color. Only wild card crystals can be placed anywhere.</p><p>Superman's powers can be used to help in puzzle completion. Each use of a power depletes a power meter which slowly recharges. In Kryptonex, Superman can show the correct crystal placement of the entire board for a short time or put the correct crystal into the current cell. In Crystallization, he can energize fields without having to complete a row or column. In both games, he can also stop the clock for a short while.</p><p>The puzzles come in three different difficulties, with higher ones being played on larger boards. Some of the crystal challenges require playing several boards in a row. All puzzles within a chapter must be completed within a time limit. It is possible to replay puzzles to improve the completion time, leaving more time for the remaining tasks. Completing a chapter unlocks a digitized picture from the movie.</p><p>Besides the puzzling, there is also a small action game. During each chapter, one of Superman's arch-enemies (including the likes of Metallo, Brainiac, or Mr. Mxyzptlk) will attack and send his minions. In a side-scrolling shooter level, it is then Superman's task to shoot down the minions, who come in red and blue varieties. Red ones must be taken out with super breath; blue ones with heat vision. Shooting down a group leaves a red or blue crystal. Collecting enough crystals before the level ends is necessary to defeat the bad guy.</p>"},{"name":"Superman: Countdown to Apokolips","year":2003,"developer":"Crawfish Interactive Ltd.","url":"a#S.zip/S%2FSuperman%20-%20Countdown%20to%20Apokolips%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Isometric > Fighting > Licensed","desc":"<p>Superman is once again in the thick of things as agents from the planet Apokolips arrive on Earth to bring him down. Meanwhile, Lois Lane has been kidnapped by Kalibak and Livewire has fought her way out of prison. It's going to be a long day.</p><p>Played from an isometric prespective, Superman can fly his way around each level, with plenty of opportuties to use his range of powers such as heat vision and iceblast, or simply punch and kick enemies to the ground.</p>"},{"name":"Surf's Up","year":2007,"developer":"Ubisoft Quebec City Studio","url":"a#S.zip/S%2FSurf%27s%20Up%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":"","genres":"Sports > 3rd-person (Other) > Snowboarding / skiing > Surfing > Licensed","desc":"<p><em>Surf’s Up</em> is a surfing game based on the computer-animated film of the same name. The Game Boy Advance port of the game has 5 players in total (2 are available from the start), 5 areas with 1-3 stages each and the modes Championship and Minigames. * Championship has three available options: Race, Freestyle and Challenge (unlockable).+ Race: You race with 3 more CPU players and must finish in one of the first 3 positions. By winning races you will unlock more stages and areas, minigames and new characters.</p><ul><li><p>Freestyle: In this mode you have to score a certain number of points by the time you reach the finish line. New boards will be unlocked if you keep scoring high enough in races.</p></li><li><p>Challenge: This mode is unlocked if you manage to win the race in a certain area of the Race mode. Challenges could be beating another surfer, do a number of tricks, gather a certain number of stars, etc.</p></li><li><p>Minigames can be played once you unlock them apart from the 1st one that is available from the start.</p></li><li><p>Minigame 1: It’s a tetris-like game where you must do horizontal and vertical rows of 3 or more of the same item.</p></li><li><p>Minigame 2: There is a 4x4 board with “coins” that depict a character in each side. These must be turned over in order to make matching rows of 3 or 4. There is also a timer that counts down and if you don’t manage to make a row before it does its game over.</p></li><li><p>Minigame 3: You are under the sea and you try to collect the items that appear on the upper right corner of the screen while avoiding the jelly fish and before the timer ends.</p></li></ul>"},{"name":"Sword of Mana","year":2003,"developer":"Brownie Brown Co. Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Sword%20of%20Mana%20%28USA%2C%20Australia%29.zip","filesize":1,"score":7.1,"genres":"Role-playing (RPG) > Top-down > Isometric > Action RPG > Fantasy","desc":"<p><em>Sword of Mana</em> tells the tale of two unlikely companions, a former prisoner out for revenge and the last known girl from the Mana tribe. The two come together, despite their differences, for one very important reason: they are the only ones that can save the Mana tree.</p><p>Like in other games in the series, the player can take control of both characters (or join with another player in co-op) and participate in action-oriented battles using spells, weapons and different kinds of items.</p>"}]