[{"name":"Tactics Ogre: The Knight of Lodis","year":2001,"developer":"Quest Corporation","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Tactics%20Ogre%20-%20The%20Knight%20of%20Lodis%20%28USA%29.zip","filesize":1,"score":8.3,"genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p>The fourth US release in the Ogre Battle series, <em>The Knight of Lodis</em> follows Alphonse, a young knight from the Holy Lodis Empire. Sent to the island of Ovis to investigate a series of unusual events, Alphonse begins to question his loyalty and purpose as a knight of Lodis, involving himself in a battle of epic proportions.</p><p><em>Tactics Ogre</em>'s gameplay is squad-based and turn-based, just like Final Fantasy Tactics, and, despite many RPG elements, the game almost entirely consists of combat. Aside from the main campaign, <em>Tactics Ogre</em> also offers a vs mode and Quest mode, in which the player must complete objectives they set themselves within a certain number of turns to earn rare items that can be used in the campaign mode. Finally, there is also an option to exchange characters and items between players with a link cable.</p>"},{"name":"Tak 2: The Staff of Dreams","year":2004,"developer":"Helixe","url":"a#T.zip/T%2FTak%202%20-%20The%20Staff%20of%20Dreams%20%28E%29%20%28M5%29.gba","filesize":1,"score":6,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>Apprentice shaman Tak has been having strange dreams after his first adventure. In his sleep he fights the Dream Guardian who possesses a mysterious staff. A creature calling itself the Dream Juju grabs the staff and disappears. With the help of your mentor Jibolba and his brother JB, you find out it was a vision about the theft of the Staff of Dreams, an item can open a portal for nightmare creatures.</p><p>You guide Tak in this side-scrolling 2D platformer as he sets off to retrieve the magical scepter. He can jump, use items and has an inventory, but you can also collect magical powers to build up the Juju meter. With a maxed out meter, you get access to special abilities such as double jumps, rolls, floating and ground stomps. These powers are also used to solve puzzles. Each region has a Yorbel Store where you can buy power-ups with yorbels, collected during the levels or earned by playing a mini-game.</p><p>By filling up magical bottles with energy, you get access to the parallel Dream World where hidden platforms in the regular levels are revealed. There are nine worlds to explore and you can save one game on the cartridge.</p>"},{"name":"Tak and the Power of Juju","year":2003,"developer":"Helixe","url":"a#T.zip/T%2FTak%20and%20the%20Power%20of%20Juju%20%28Europe%29%20%28Es%2CIt%29.gba","filesize":1,"score":6.9,"genres":"Action > 3rd-person (Other) > Side view > Platform","desc":"<p>Like the console version of this game, Tak and the Power of Juju features the evil shaman Tlaloc, who was prophesied to steal the Moon Stones, and through that attempt to cause the fall of the Moon Juju. Lok the apprentice had been trained to battle the evil shaman when he appeared, but now Lok and the rest of the villagers have been turned into sheep, leaving just Tak behind.</p><p>The Gameboy Advance version of Tak and the Power of Juju is a side-scrolling action game. Play through eight worlds, each with multiple levels. Tak starts with a blowgun, and will pick up a club as well during his adventure. To add a bit of variety, there are swimming and flying levels.</p>"},{"name":"Tak: The Great Juju Challenge","year":2005,"developer":"WayForward Technologies, Inc.","url":"a#T.zip/T%2FTak%20-%20The%20Great%20Juju%20Challenge%20%28E%29%20%28M4%29.gba","filesize":1,"score":"","genres":"Action > Racing / Driving > Top-down > Platform","desc":"<p>Like the console versions, <em>Tak: The Great Juju Challenge</em> features Tak and Lok as contestants in the great Juju Challenge, an obstacle course designed to test your brains and brawn.</p><p>The story just provides a framework to rest the levels upon. Each world features a few platforming levels, then a boss battle, then a racing level. You can switch between Tak and Lok at any time; they have different moves, with Tak focused on magic, and Lok on combat.</p>"},{"name":"Tales of Phantasia","year":2003,"developer":"Production I.G, Inc.","url":"a#T.zip/T%2FTales%20of%20Phantasia%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.3,"genres":"Action > Role-playing (RPG) > Side view > Top-down > Anime / Manga > Fantasy","desc":"<p>In <em>Tales of Phantasia</em> the player controls a young boy named Cless, who lives together with his parents in a quiet village. It was a day like all the others when Cless decided to go hunting with his best friend Chester. Chasing a wild boar, Cless discovered a strange talking tree in the forest who was pleading him for help. But as soon as it stopped speaking, the two friends heard the sound of an alarm. They returned to the village and found it burnt down, and all its inhabitants murdered. Before Cless' mother died in his arms, she told him this terrible massacre had something to do with the pendant she and her husband gave Cless for his birthday... what connection could there be? Cless decides to visit his uncle who lives in another town, but he doesn't realize his journey will take him to much more remote places than that.</p><p><em>Tales of Phantasia</em> is a Japanese-style role-playing game with an unusual combat system: the battles are action-based and are fought on separate side-scrolling screens. The player directly controls one character, while other party members are controlled by AI. It is possible to pause the game at any time and use magic, items, or choose an overall strategy for the allies.</p>"},{"name":"Tang Tang","year":2001,"developer":"GameVision Corporation","url":"a#T.zip/T%2FTang%20Tang%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CFi%29.gba","filesize":1,"score":"","genres":"Action > Anime / Manga > Arcade > Platform > Puzzle elements > Sci-fi / futuristic","desc":"<p>The Associated Nexus of Galaxies (TANG) has been invaded by monsters that are going after the energy crystals. The only hope of the TANG to get the situation back to normal is to call upon four superheroes known as the Tangibles.</p><p>Tang Tang is a puzzle/action game quite similar to Solomon's Key. You control one of the four superheroes who have the ability to create and destroy blocks as well as shoot laser beams. The goal of each level is to collect all the energy crystals scattered around while avoiding the enemies. Once all the energy crystals have been collected, a door to the next level opens. Every five levels, you will have to fight against a boss.</p><p>The game boasts 120 levels although it really is 30 levels, each with four different enemy positions.</p>"},{"name":"Taxi 3","year":2003,"developer":"Visual Impact","url":"a#T.zip/T%2FTaxi%203.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Automobile > Vehicle simulator > Licensed","desc":"<p><em>Taxi 3</em> is based on the movie with the same title written by Luc Besson, directed by Gerard Krawczyk.The player takes on the role of the main character of the movie: Daniel, a taxi driver who has an overpowered customized car.Gameplay is simple: in a pursuit view Daniel has a limited time to go to assigned checkpoints to get objects and clients, and go to another checkpoint to drop them... Daniel needs to stop at gas stations to refuel his tank, and can use nitro to get an acceleration bonus. Furthermore Daniel needs to avoid other vehicles in the traffic, such as motorbikes, cars and trucks.</p>"},{"name":"Teen Titans","year":2005,"developer":"Artificial Mind & Movement","url":"a#T.zip/T%2FTeen%20Titans%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > Licensed","desc":"<p><em>Teen Titans</em> is based on the cartoon of the same name. Players control the five team members: Robin, Cyborg, Raven, Starfire and Beast Boy and can switch between them at any time. Robin and Cyborg can double jump, while Raven, Starfire and Beast Boy can fly. All the Titans have unique abilities that allow them to surpass certain obstacles. The Titans must use these abilities to navigate various levels to defeat Brother Blood and his H.I.V.E. academy cohorts.</p>"},{"name":"Teenage Mutant Ninja Turtles","year":2003,"developer":"Hudson Soft Company, Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Teenage%20Mutant%20Ninja%20Turtles%20%28USA%29.zip","filesize":1,"score":6.9,"genres":"Action > Racing / Driving > Side view > Beat 'em up / brawler > Platform > Licensed","desc":"<p>The heroes in a half shell are back in an all new adventure. The four turtles have been split up in order to combat the many bad guys that surround the city.</p><p>Each turtle (Leonardo, Michelangelo, Raphael &amp; Donatello) has their own set of levels to complete, with their own distinct moves and combat options to use during battle. Along with a set of side-scrolling levels, complete with end of level boss battles, the four turtles will also get the chance to race through the sewers in the unique 3rd person race modes, shooting down the enemy or collecting items, while Donatello takes to the sky in the Shell Glider and Raphael challenges Casey Jones to a one-on-one cycle race.</p>"},{"name":"Teenage Mutant Ninja Turtles 2: Battle Nexus","year":2004,"developer":"Hudson Soft Company, Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Teenage%20Mutant%20Ninja%20Turtles%202%20-%20Battle%20Nexus%20%28USA%29.zip","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Teenage Mutant Ninja Turtles 2: Battle Nexus</em> is based on the 2003 television series in the Turtles franchise. Like the console game of the same name, it is based on the events of season two of the series. It however adapts fewer storylines and presents them in unique side-scrolling gameplay.</p><p>The story is based primarily on the first two story arcs of the TV season: <em>Turtles in Space</em> and <em>Secret Origins</em>. The turtles are surrounded by a strange light and find themselves on a strange alien planet. After they rescue a robot who is hunted by soldiers and Triceratons, he tells them that he can help them get back home via the teleporter he built. Required for the vast distances however is the power of special crystals, so the four reptile dudes set out to collect them.</p><p>The game consists of five worlds of six levels each. Each world contains 100 crystals. Finishing a world and unlocking the next requires beating all levels and, depending on difficulty, collecting all (hard), 85 (medium) or no (easy) crystals. Before each level, players can select which of the four turtles to play, and any level can be played again with another character to try and find more crystals. The levels themselves are of one of four different gameplay types. The majority take the form of a platformer with beat'em up elements. Due to interference by the Shredder and Baxter Stockman, the turtles' weapons materialize some distance away from them, so the first order in the platform levels is to collect the current character's signature weapon. Enemies stand in the way and can be taken out or avoided by hiding in doorways. To get around, the turtles can climb poles and ledges and pull themselves up shafts. Taking out enemies may reveal keycards, which are needed to open certain doors. The crystals can be in plain sight or hidden in blocks that must be destroyed first. The four characters have different abilities, and some crystals can only be reached by a specific turtle. For example, only Donatello can enter dark rooms because he wears sensor goggles and only Raphael can scale walls with his sais. Several of the platform levels end with boss fights.</p><p>Next to the platform levels, there are three different kind of shooting levels. The hoverboard levels put one of the turtles on a hoverboard. The level scrolls automatically and enemies arrive from front and behind and can be shot at in both directions. The board can only stay airborne for a short time and will slowly glide downwards. It is slightly different with the hovercraft levels, which are similar to traditional arcade shoot'em ups. They also scroll automatically, and the craft can employ forward-firing lasers or a falling bomb to take out enemies. Both side-scrolling shooter level types occasionally end with boss battles. The final type of level takes place in space, with the action seen from a cockpit perspective. Lasers must be fired at enemy spacecraft, asteroids (to prevent collisions) and crystals (to pick them up).</p><p>Besides the main story mode, the game also includes two smaller modes which can be played solo or in multiplayer via link cable. Race mode has the four turtles racing each other on hoverboards. Crouching above certain areas gives a speed boost or lets one knock the other turtles off their board for a time. In battle mode, the goal is to collect a number of crystals in a small level within a time limit, with enemies also standing in the way. Beating a level ups the crystal threshold for another player. Both extra modes feature a number of levels that are unlocked in succession.</p>"},{"name":"Tekken Advance","year":2001,"developer":"Eighting Co., Ltd.","url":"beyblade-dragon-ball-tekken-snes-vba-gba-roms/Tekken Advance (USA).gba","filesize":8388608,"score":7.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Fantasy","desc":"<p><em>Tekken Advance</em> is a port of the original arcade game. This pocket version features nine playable characters, multiple gameplay modes and link cable support for two players. Included fighters are Jin Kazama, Paul Phoenix, Forest Law, Gun Jack, Hwoarang, King, Ling Xiaoyu, Nina Williams, and Yoshimitsu.</p><p>Compared to the arcade and other console versions, the game features less moves, different timings, and no unlockable cutscenes.</p>"},{"name":"Tennis","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Tennis Masters Series 2003","year":2002,"developer":"Kaolink SAS","url":"a#T.zip/T%2FTennis%20Masters%20Series%202003%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > Fixed / flip-screen > Direct control > Tennis","desc":"<p>Take part in the planet's most prestigious tournaments and win the Masters Cup at Shanghai!</p><p>INDIAN WELLS    MIAMI    MONTE-CARLO    ROMA    HAMBURG    TORONTO    CINCINNATI    MADRID    PARIS    SHANGHAI 2002</p>"},{"name":"Terminator 3: Rise of the Machines","year":2003,"developer":"Taniko, LLC","url":"7#Terminator%203%3B%20Rise%20of%20the%20Machines%20%28USA%29.gba","filesize":8388608,"score":5.7,"genres":"Action > Isometric > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>Once again, an advanced Terminator is sent to the past to threaten John Connor's life. The player control's Arnold's iconic cyborg as he battles robots and police through the future and the present to save him. Levels loosely follow the plot of the third <em>Terminator</em> film.</p><p>The Game Boy Advance title is an isometric shooter with 10 single-player levels. Levels are made up of rooms with specific objectives (defend, survive, etc.) for each. The Terminator can fire a variety of projectile weapons, throw explosives, and can punch effectively when all else fails. A few levels also include vehicles to control. The Terminator can also activate the films' red-tinted Terminator vision for a limited time, to spot hidden items or areas and cause additional damage to enemies.</p><p>Two players can fight through unique co-op challenges over a link cable, where they will fight spawning enemies and bosses in progressive rooms. Up to four players can also control their own Terminator in a capture-the-flag arena mode.</p>"},{"name":"Tetanus on Drugs","year":2002,"developer":"Pin Eight"},{"name":"Tetris CA","year":2005,"developer":""},{"name":"Tetris Worlds","year":2001,"developer":"Radical Entertainment Inc.","url":"a#T.zip/T%2FTetris%20Worlds%20%28E%29%20%28M3%29.gba","filesize":1,"score":6.2,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p>It's Tetris as we all remember it. Drop different shaped blocks into the container, and fit them together to form a horizontal line, and the line disappears. Your job is to keep going as long as possible by clearing the container of blocks.</p><p>This will be the first time on a Game Boy System that 4 players can play multiplayer <em>Tetris</em>, which is much the same as the original <em>Tetris</em>, only that when you clear a line of blocks, the line(s) appear in another players screen.</p>"},{"name":"Texas Hold 'Em Poker","year":2004,"developer":"Skyworks Technologies, Inc.","url":"a#T.zip/T%2FTexas%20Hold%27em%20Poker%20%28U%29.gba","filesize":1,"score":"","genres":"Strategy > Cards / tiles","desc":"<p><em>Texas Hold 'Em Poker</em> lets players play the card game in both a quick play and a career mode. Quick play lets the player choose to play a quick sit down table game or a single table tournament game. The stakes range from small $5/$10 games up to $80/$160 games. Players can choose to either go heads up or play against up to nine other opponents. The Career Mode lets the player compete in either a sit down game or a single table tournament. Winning a tournament will qualify the player to compete in more tournaments for higher stakes including pot limit and no limit. The goal is to reach the tournament at Vegas and ultimately win the Texas Hold 'Em Poker Championship.</p>"},{"name":"That's So Raven","year":2004,"developer":"Vicarious Visions, Inc."},{"name":"That's So Raven 2: Supernatural Style","year":2005,"developer":"Artificial Mind & Movement"},{"name":"Three Stooges, The","year":2002,"developer":"Incredible Technologies, Inc.","url":"a#T.zip/T%2FThree%20Stooges%2C%20The%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Stars of television and cinema, and now stars of their own video game. Join Moe, Larry &amp; Curly (in no particular order) who must collect $5000 to try and save an orphanage and the young children who live there from the evil banker, all while keeping pie out of their face. Featuring platform level designs based on classic Stooge scenes from their many TV episodes and movies and level objectives re-living many of their antics plus original Stooge voices and Stooge trivia.</p>"},{"name":"Thunder Alley","year":2004,"developer":"Pronto Games, Inc.","url":"a#T.zip/T%2FThunder%20Alley%20%28U%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view","desc":"<p><em>Thunder Alley</em> is a racing game for the Game Boy Advance where the player takes control of stock-cars.</p><p>The game is played from a third person perspective and uses Sennari Interactive's ray tracing engine from Driver 2. The cast of the game are all characters from the <em>Tin Pin Alley</em> series of bowling games.</p><p>There are two game modes: Practice Race, where the player may practice laps; and Tournament Race, where the player competes against AI-controlled drivers. Throughout the game's tracks, the player will come across power ups that boosts the speed of the player car and obstacles that hinder it like for example oil which causes the car to spin around. There are four different tracks in the game, each with its own layout and appearance, although the difference between them is very small.</p>"},{"name":"Thunderbirds","year":2004,"developer":"Saffire, Inc","url":"7#Thunderbirds%20%28USA%2C%20Europe%29%20%5BEng%5D.gba","filesize":4194304,"score":5.8,"genres":"Action > 3rd-person (Other) > Isometric > Puzzle elements > Licensed","desc":"<p>Based on the live action film released in 2004 (which in turn was based on the 1960s series starring marionettes), Thunderbirds stars Alan, Tin-Tin, and Fermat, three children whose guardians are part of the International Rescue team. The player takes control of all three children as they go through training and are then forced to travel around the world to save members of International Rescue from an evil villain known as The Hood.</p><p>The game takes place in locales such as the International Rescue island, Africa, and even outer space. Each of the three characters has his or her own unique abilities that the player must use to solve puzzles and advance through a level. Alan has strength and jumping ability, Tin-Tin has telekinetic powers that are used to move objects, and Fermat can hack computers and roll through holes. While the majority of the gameplay is primarily composed of solving puzzles from an overhead view, there are also flight action sequences where the player can fly one of the many vehicles known as the Thunderbirds.</p>"},{"name":"Thunderbirds: International Rescue","year":2001,"developer":"Pukka Games","url":"7#Thunderbirds%3B%20International%20Rescue%20%28EU%29%20%5BEng%5D.gba","filesize":8388608,"score":"","genres":"Action > Side view > Top-down > 2D scrolling > Arcade > Shooter > Licensed","desc":"<p><em>Thunderbirds: International Rescue</em> is a game based on a British television series from the mid-1960s. </p><p>Jeff Tracy, assisted by his five sons, directs the activities of International Rescue an organization who uses technically advanced vehicles called Thunderbirds in death-defying escapades around the world in order to save those in need. You take control of one of the 8 possible vehicles to complete the missions you are assigned. Missions include destroying enemy radars, rescuing civilians etc.</p>"},{"name":"Tiger Woods PGA Tour 2004","year":2003,"developer":"Digital Eclipse Software, Inc.","url":"a#T.zip/T%2FTiger%20Woods%20PGA%20Tour%202004%20%28U%29.gba","filesize":1,"score":7.4,"genres":"Sports > Behind view > Direct control > Golf > Licensed","desc":"<p><em>Tiger Woods PGA Tour 2004</em> is the handheld version of Tiger Woods PGA Tour 2004. It features a practice mode, career mode, and a versus mode. While the Gameboy Advance version features a tutorial mode, the N-Gage version features an Arena mode which allowed for online competition. Instead of using the analog sticks of the console version, golfing is done using the directional pad.</p>"},{"name":"Tiger Woods PGA Tour Golf","year":2002,"developer":"Rebellion Developments Ltd.","url":"a#T.zip/T%2FTiger%20Woods%20PGA%20Tour%20Golf%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.8,"genres":"Sports > Golf > Licensed","desc":"<p>This compact version of the great and noble game of golf, has the player take control of Tiger himself or other less famous golfers. The player must look out for swing timing and not hook the ball into one of the many bunkers, nor must they underpower the shot or fall short of the fairway. The game of golf is simulated to an accurate level and is both compelling and frustrating, just like the real thing.</p>"},{"name":"Tim Burton's The Nightmare Before Christmas: The Pumpkin King","year":2005,"developer":"Tose Co., Ltd.","url":"a#T.zip/T%2FTim%20Burton%27s%20The%20Nightmare%20Before%20Christmas%20-%20The%20Pumpkin%20King%20%28E%29%20%28M5%29.gba","filesize":1,"score":7.3,"genres":"Action > Side view > 2D scrolling > Metroidvania > Puzzle elements > Horror > Licensed","desc":"<p>Halloween Town is preparing for this year's Halloween, and Jack Skellington is sure that this one will be the best ever! However, Oogie Boogie has other plans - furious that he has no holiday of his own, he commands Lock, Shock and Barrel to kidnap Jack so that he can take his place as the King of Halloween and claim the holiday for himself. Unfortunately, the trio kidnap Sally by mistake. Angered by their bumbling, Oogie Boogie releases thousands of bugs into Halloween Town, sending the citizens into hiding. It's up to Jack to save Halloween Town...and his holiday!</p><p>Tim Burton's The Nightmare Before Christmas: The Pumpkin King is an action-adventure game similar to Castlevania: Circle of the Moon. The game is set before the movie <em>The Nightmare Before Christmas</em>, before Jack's encounter with Santa Claus and Oogie Boogie. The game takes place in one gigantic overworld which Jack can explore. As he earns new weapons, such as the Frog Gun and Bat Boomerang, he can unlock new areas and access more of the overworld. Early in the game, he'll also find his ghost dog, Zero, who can help by finding secret areas and navigating through small spaces.</p><p>The game also features three mini-games that can be played either against the computer, or versus up to three friends. There's 'Bone Breaker', where you must be the first to smash the skeleton, 'Whack Hammer', where you must smash as many rats and bats as possible, and 'Skulldigger', you must find the correct box with the Shrunken Head.</p>"},{"name":"Tiny Toon Adventures: Scary Dreams","year":2002,"developer":"Treasure Co., Ltd."},{"name":"Tiny Toon Adventures: Wacky Stackers","year":2001,"developer":"Warthog Plc","url":"a#T.zip/T%2FTiny%20Toon%20Adventures%20-%20Wacky%20Stackers%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Puzzle > Real-time > Falling block puzzle > Licensed","desc":"<p>A Tiny Toon themed drop-down puzzle game comparable to Tetris and Columns. The player has to create clusters of equally colored eggs which cause explosive chain reactions, trying to clear the screen. Playable against computer or against up to four human competitors via Link Cable. Particularly effective moves cause additional elements to be send to the other players screens. The player can also invoke special moves to be executed by Tiny Toon characters by collecting coins.</p>"},{"name":"Tir et but: Édition champion du monde","year":2002,"developer":"Titus Interactive, S.A."},{"name":"Titeuf: Méga compet'","year":2004,"developer":"DreamOn Studio"},{"name":"Titeuf: Ze Gag Machine","year":2002,"developer":"3DLIGHT-Studio"},{"name":"TMNT","year":2007,"developer":"Ubisoft Entertainment Inc.","url":"a#T.zip/T%2FTMNT%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":7.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Fighting > Martial arts > Licensed","desc":"<p>Cowabunga! Take control of your favourite turtle ninjas as you play through the events of the 2007 CGI movie. The turtles have grown apart, and Raphael has taken to crime fighting solo under the guise of the Nightwatcher. The Foot Clan are turning up in the streets again, and a mysterious man known as Winters seems to be involved with them. Only the Ninja Turtles can clean up the streets!</p><p>The Game Boy Advance version of <em>TMNT</em> can be best described as similar to the NES game River City Ransom. Players take control of either a specific turtle or the turtle of their choice (depending on the mission), and fight through waves of enemies in a sidescrolling beat-em-up style. Enemies will drop the usual health pickups, but also drop money and weaponry. Money can be used to purchase weapons or upgrades between missions, while weapons can be used as a more powerful tool to defeat your foes (however, these weapons have a limited use). After the completion of a mission, experience is earned, and after a certain amount of experience is gained, you can level up the turtles to improve their fighting statistics.</p><p>Each turtle has their own specific weapon: Leonardo with his dual Katana, Michelangelo with his Nunchucks, Donatello with his Bo Staff and Raphael with his two Sai. These weapons are used in their standard attacks. A basic attack is performed with the B Button, but you can perform different attacks with B and other buttons such as the directions of the Control Pad and the A Button. Uppercuts, Sweep Kicks, Jump Kicks and more can be performed, and you can even juggle enemies in the air to get more hits in and increase your score.</p>"},{"name":"TOCA: World Touring Cars","year":2003,"developer":"Spellbound Interactive Ltd.","url":"a#T.zip/T%2FTOCA%20World%20Touring%20Cars%20%28E%29%20%5B%21%5D.gba","filesize":1,"score":"","genres":"Racing / Driving > Simulation > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>This handheld version of <em>TOCA: World Touring Cars</em> is based on the PlayStation game. It features eleven tracks to drive on: Brands Hatch, Nürburgring, Silverstone, Oulton Park, Buenos Aires, Brasilia, Vancouver, Sugo, Monza, Dijon and Mexico City, and eighteen cars to choose from. The player can setup his or her car before every race. This racing simulation game requires the player to focus on the track and master the corners, our the car will spin out of control. Featured modes are quick race, free race, time trail and championship mode.</p>"},{"name":"Tokotoko Truck","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Tokyo Xtreme Racer Advance","year":2005,"developer":"David A. Palmer Productions","url":"a#T.zip/T%2FTokyo%20Xtreme%20Racer%20Advance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Direct control > Street racing > Asia > Contemporary > Europe > North America","desc":"<p><em>Tokyo Xtreme Racer Advance</em> is the first handheld adaptation in the <em>Tokyo Xtreme Racer \\ Shutokō Battle</em> series of street racing games. Races are set in Los Angeles, London and Tokyo with more than 16 cars to choose from. Car can be upgraded with performance and style modifications. Over 60 rivals can be faced.</p>"},{"name":"Tom and Jerry in Infurnal Escape","year":2003,"developer":"CinéGroupe Interactive","url":"a#T.zip/T%2FTom%20and%20Jerry%20-%20Infurnal%20Escape%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p><em>Tom and Jerry in Infurnal Escape</em> is a cartoon game with a rather complicated plot: In an attempt to catch Jerry, Tom pulls the carpet which Jerry is standing on. But instead of Jerry, a piano comes down and crushes Tom. Tom is sent to hell, where a big red dog puts him in a cauldron to cook him. Fortunately, a fairy-cat appears and offers to help Tom escape provided that he has to go back to the living world and collect as many golden bones as possible. That's where the game begins, with hidden golden bones, funny looking but tough enemies, and the annoying little devil Jerry who tries to make Tom's life miserable or aids the enemies.</p><p>Players control Tom, in order to collect golden bones and get to the goal while fighting against enemies on the way. Tom can also collect helpful items such as bat (boots hitting power), cheese (distracts Jerry), and Tom's head (Adds one life). There are a total of 15 levels. Players must go through all of them to reach the final boss: the devil dog. When Tom has no more lives, he is sent back to hell, where he has to get his 3 lives back (with 2 minutes limited) to return to the living world and start the level over again.</p><p>The graphics are 2D. The game has no saving function. Players have to remember the passwords to choose their level.</p>"},{"name":"Tom and Jerry Tales","year":2006,"developer":"Sensory Sweep Studios","url":"a#T.zip/T%2FTom%20and%20Jerry%20Tales%20%28USA%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Licensed","desc":"<p>The famous cat and mouse are back in <em>Tom and Jerry Tales</em>. The story is simple: Tom's masters are out and he quickly makes a plan to catch Jerry. Jerry strikes back and the chase begins! The gameplay is also simple: the player moves Jerry and follows the chunks of cheese Tom has placed. When Jerry meets Tom or enters any hole, do whatever appears on the screen.</p><p>The adventures and chases of Tom and Jerry are shown through 2D graphics. Jerry can unlock new costumes and change his outfit. A password system allows the to continue from the last level reached. </p><p>There is a Nintendo DS version for this game. Although they have the same name and are made by the same company, the gameplay differs between both versions.</p>"},{"name":"Tom and Jerry: The Magic Ring","year":2001,"developer":"Cave Barn Studios","url":"a#T.zip/T%2FTom%20and%20Jerry%20-%20The%20Magic%20Ring%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.3,"genres":"Action > Side view > 2D scrolling > Arcade > Licensed","desc":"<p>This game offers sidescrolling beat em up action with cat and mouse due, Tom and Jerry.  Based on the direct to video film of the same name, Jerry gets a prized magical ring stuck on his head which Tom was charged with guarding. 10 levels of enemies must be fought off to release it.</p><p>Re-create the classic slapstick of the cartoons using a multitude of household items such as bats and plates, all capable of causing damage they were not designed for.  Fight wacky boss characters, including Droopy the Dog, playing a mystic seer in his first ever videogame appearance.</p>"},{"name":"Tom Clancy's Rainbow Six: Rogue Spear","year":2002,"developer":"Ubi Soft Studios SRL","url":"7#Tom%20Clancy%27s%20Rainbow%20Six%3B%20Rogue%20Spear%20%28USA%29%20%5BEn%2CFr%2CDe%2CEs%2CIt%5D.gba","filesize":8388608,"score":7.1,"genres":"Action > Simulation > 3rd-person (Other) > Top-down > Shooter > Licensed","desc":"<p>More of the same from the Rainbow Six series. Your team is back saving the world again. This time from a group known as \"Rogue Spear\". Their forces are powerful and you must strike quick and hard if you wish to win.</p>"},{"name":"Tom Clancy's Splinter Cell","year":2003,"developer":"Ubi Soft Entertainment Inc.","url":"7#Tom%20Clancy%27s%20Splinter%20Cell%20%28EU%29%20%5BEn%2CEs%2CFr%2CDe%2CIt%2CNl%5D.gba","filesize":8388608,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Spy / espionage","desc":"<p>You're casted in a role of Sam Fisher, an secret operative that gets his hands dirty when others will not. Entering like a ghost, you'll have to rely to the stealth and make a good use of your surrounding to avoid direct conflict and end up outnumbered. The missions will follow pretty much the same storyline as the original game for PC/GC/PS2/XBOX with the emphasis on being a complete platformer with here and there some first-person sniping job to do.</p>"},{"name":"Tom Clancy's Splinter Cell: Pandora Tomorrow","year":2004,"developer":"Ubisoft Entertainment Inc.","url":"7#Tom%20Clancy%27s%20Splinter%20Cell%3B%20Pandora%20Tomorrow%20%28EU%29%20%5BEn%2CEs%2CFr%2CDe%2CIt%2CNl%5D.gba","filesize":8388608,"score":7.2,"genres":"Action > Side view > 2D scrolling > Stealth > Spy / espionage","desc":"<p>The hand-held version features the same story as its console cousins, but tells it in a completely different way using a side-scrolling view with 22 different objectives and new locations to play in. The same stealth maneuvers can be used in this one as well: using shadows to hide, sneaking around, using human shields, forcing suspects to talk and even hide behind objects.</p><p>Night and Thermal vision can be used at any time and features three different scope views: Camera Shoot, Sniper and Laser Mic. Things like rappelling from rooftops and lock picking are still a part of the game, but is done in the form of mini-games.</p>"},{"name":"Tomato Adventure","year":2002,"developer":"AlphaDream Corporation, Ltd.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Tomato%20Adventure%20%28Japan%29%20%5BT-En%20by%20Unknown%20W.%20Brackets%20v1.1.0%5D.zip","filesize":1,"score":"","genres":"Role-playing (RPG) > Side view > Anime / Manga","desc":"<p>In the Ketchup Kingdom, a hare-like boy named DeMille is an outcast because he doesn't like tomatoes. Disliking tomatoes in the Ketchup Kingdom is illegal, and the punishment for such people (referred to as \"Droppers\") is being locked up until they do like tomatoes. DeMille's girlfriend, Patharan, also hates tomatoes, and she is kidnapped by King Abīra, leader of the Ketchup Kingdom. DeMille must go on a journey to save Patharan.</p><p><em>Tomato Adventure</em> is an action-command RPG. The player battles enemies when they bump into him on the screen. Battles are fought using Gimmicks, toy-like weapons. Using Gimmicks, the player must play a mini-game correctly in order to hit an enemy. Types of Gimmicks include Time, which require timing, Speed, which requires the player to finish a task before time runs out, Excite, which covers miscellaneous games, and Input, which requires the player to press buttons or enter information in a certain order. If the player fails a mini-game, they have to start all over.</p>"},{"name":"Tonka On the Job","year":2006,"developer":"Webfoot Technologies, Inc.","url":"a#T.zip/T%2FTonka%20-%20On%20the%20Job%20%28U%29.gba","filesize":1,"score":"","genres":"Simulation > Diagonal-down > 2D scrolling > City building / construction simulation > Direct control > Vehicle simulator > Licensed","desc":"<p><em>Tonka On the Job</em> is a light simulation game that allows players to construct and operate vehicles based on the American Tonka franchise of toy trucks. Typical trucks such as Mighty Dump, Mighty Front Loader, Toughest Mighty, Mighty Cement Mixer, Mighty Crane and others are used in different scenarios to build foundations, dig canals, clear trees and more. Every job starts at the Tonka Garage by deploying a vehicle. The gameplay is shown from a bird's-eye view in small 2D-scrolling environments with dirt yards, cities, gravel pits and forests. Every vehicle has a specific use. For instance, Mighty Dump can carry up to four loads of dirt and can dump the load anywhere. Jobs gradually become more complex as more vehicles are available and the player has to switch between them to complete the task. For instance the Mighty Front Loader is used to pick up certain types of dirt to load it onto the Mighty Dump which can transport it more efficiently. Once deployed it is possible to switch between vehicles on the fly.</p><p>Sometimes additional tasks appear during a job with a time limit, such as unexpected fires that can be put out with the Rescue Fire Truck. Completing these is usually not required, but rewarded with bonus fuel. The performance per job is rated with up to three stars. Next to completing a job the game for instance also takes into account fuel efficiency, which is at its best if no redundant driving is done and the vehicle stays on the roads as much as possible. Later levels introduce dodging traffic. Special actions tied to specific vehicles also require more fuel. Most tasks have specific steps such as clearing, grading and constructing, but these do not always need to be completed in a fixed order. Often there are multiple approaches or solutions to get the job done.</p><p>The game can be played as a series of jobs or with freeplay for unlimited construction and destruction through deformable moments. The GBA version contains 11 trucks and the PC version 13. While the PC version has a much higher resolution with sharper graphics drawn in a different style, the content itself including the gameplay and scenarios is largely identical.</p>"},{"name":"Tony Hawk's American Sk8land","year":2005,"developer":"Vicarious Visions, Inc.","url":"a#T.zip/T%2FTony%20Hawk%27s%20American%20Sk8land%20%28E%29%20%28M4%29.gba","filesize":1,"score":7,"genres":"Sports > Isometric > Skateboarding > Licensed","desc":"<p><em>Tony Hawk's American Sk8land</em> is the portable equivalent to Tony Hawk's American Wasteland. As always, the player skates around several parks (loosely based on <em>American Wasteland</em>'s levels) and performs a variety of stunts. Those are executed by combining the environment with certain button combinations.</p><p>During the main story mode, the player creates a new skater who gets caught up with a skater group which wants to revive a legendary skate park named SK8Land. In practice, the player walks around the park, talks to people and receives challenges to complete; usually in the form of chained stunts. Classic mode allows to take control over real skaters and freely roam the parks. In this mode, the goal is to accumulate as many points as possible by performing spectacular stunts within a time limit. Additionally there are various multiplayer modes, unchanged from the predecessors, for link-cable and hot seat.</p>"},{"name":"Tony Hawk's Downhill Jam","year":2006,"developer":"Visual Impact","url":"a#T.zip/T%2FTony%20Hawk%27s%20Downhill%20Jam%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Sports > Behind view > Real-time > Skateboarding > Licensed","desc":"<p>100% ADRENALINE FROM TOP TO BOTTOM<br>* Thrash In 10 Epic Worldwide Locations * Create-A-Skater And Race Against Tony * Dominate The Competition<br>Enter this high-speed competition down the steepest terrains in the world! From the ruins of Machu Picchu, down the hilly streets of San Francisco, through the lights of Hong Kong and more, this is the biggest thrill ride with Tony yet!</p>"},{"name":"Tony Hawk's Pro Skater 2","year":2001,"developer":"Vicarious Visions, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Tony%20Hawk%27s%20Pro%20Skater%202%20%28USA%2C%20Europe%29.zip","filesize":1,"score":8.2,"genres":"Action > Sports > Diagonal-down > Isometric > Tricks / stunts > Skateboarding > Licensed","desc":"<p>The Tony Hawk skateboarding series makes its debut on the Game Boy Advance with this adaptation of the second Pro Skater game.</p><p>Gameplay is similar to the original console game. The levels have been adapted from the console version for the two dimensional isometric perspective; one is even taken from the original Tony Hawk's Pro Skater.</p><p>In Career Mode, choose from one of 13 professional skaters and, in each level, complete various goals like collecting items, performing special tricks and of course breaking high scores by performing tricks and combos. Completing the goals earns money which unlocks new levels and can be spent on new boards, tricks and upgrading your skater's stats. In competition levels, you don't skate for money but compete for a medal.</p><p>In the Free Skate and Single Session modes, unlocked levels can be practiced and new high scores be established.</p>"},{"name":"Tony Hawk's Pro Skater 3","year":2002,"developer":"Vicarious Visions, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Tony%20Hawk%27s%20Pro%20Skater%203%20%28USA%2C%20Europe%29.zip","filesize":1,"score":8.1,"genres":"Sports > Isometric > Tricks / stunts > Skateboarding > Licensed","desc":"<p>Tony Hawk returns with an all new line-up of skaters, an all new line-up of parks to crash through, and a whole new level of graphics.</p><p>The line-up of street and vert riders include Elissa Steamer, Jamie Thomas, Steve Caballero, Rune Glifberg, Geoff Rowley, Andrew Reynolds, Rodney Mullen, Eric Koston, Chad Muska, Bucky Lasek and Bam Margera from MTV's Jackass (and Tony Hawk, of course).</p><p>The create a skater mode returns, allowing for even further levels of options for your character, like adding glasses and tatoos to changing the colour of the knee and elbow pads or even the hair.</p><p>And the levels themselves that you must skate through are now more interactive, with cars and humans blocking paths and making noise as you race around to make as many points as possible. Use items around the streets or the park to jump from or over to increase your score, and pull of as many wild and wacky tricks as you can.</p>"},{"name":"Tony Hawk's Pro Skater 4","year":2002,"developer":"Vicarious Visions, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Tony%20Hawk%27s%20Pro%20Skater%204%20%28USA%2C%20Europe%29.zip","filesize":1,"score":7.5,"genres":"Sports > Isometric > Skateboarding > Licensed","desc":"<p>THPS4 is the fourth game in Activision's ever popular franchise.</p><p>The main feature of this game is it's redesigned career mode.  When beginning a level, you have all the time in the world to skate around, perform tricks, get a feel for the level, without the hassel of any goals or time limits.  When you're ready to attempt a goal, simply find a pro skater, talk to him, then receive the goal, similar to Dave Mirra Freestyle BMX.  Goals are similar to the previous games, such as collect SKATE, get a certain amount of points, transfer over this and grind that.  There are new goals, however, such as collecting the word COMBO while doing one big combo.  Miss a trick, and goal fails.  Once all regular goals are accomplished, you can attempt the Pro Goal, which is specific to each skater, and is extremely hard.</p><p>All the major skaters are here, including Tony Hawk, Bob Burnquist, Steve Caballero, Kareem Campbell, Rune Gilfberg, Eric Koston, Bucky Lasek, Bam Margera, Rodney Mullen, Chad Muska, Andrew Reynolds, Geoff Rowley, Elissa Steamer and Jamie Thomas.</p><p>The levels are been expanded and are huge.  Some of the levels include a college campus, a shipyard, and the infamous prison complex Alcatraz.</p><p>For multiplayer, all the favorite modes are back, from Graffiti and Trick Attack to Horse and King Of The Hill.  New modes include Capture The Flag and Combo Mambo.  THPS4 also supports System Link play, but not XBox Live.</p><p>The PlayStation 2 version offers everything from the XBox version, but also has online play, utilizing either your own network adaptor or the official one.  The PS2 version also features a one level demo of Shaun Murray's Pro Wakeboarder, which is not featured on any other version of the game.</p>"},{"name":"Tony Hawk's Underground","year":2003,"developer":"Vicarious Visions, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Tony%20Hawk%27s%20Underground%20%28USA%2C%20Europe%29.zip","filesize":1,"score":8,"genres":"Sports > Diagonal-down > Isometric > Tricks / stunts > Skateboarding > Licensed","desc":"<p>Like earlier entries in the Tony Hawk skateboarding series on the Game Boy Advance, <em>Tony Hawk's Underground</em> adapts the console title to the handheld platform using isometric graphics and polygonal characters.</p><p>The main game mode is story mode. Players create their own skater who in the beginning only knows a few basic tricks. By performing moves successfully, the skater's stats and number of known tricks will increase. The campaign consists of 10 large levels. Friendly characters standing around the neighborhood can be talked to and give tasks that usually have to be completed within a time limit: these include performing specific tricks or combos, finding certain items or reaching high scores. Completing goals adds cash to the character's wallet, makes more areas of the level available to skate in, and unlocks levels and pro skaters. Crashing deducts from the characters health' bar. When it reaches zero, the skater is moved to the beginning of the level. Wearing protective gear (helmets and knee pads) reduces the impact of crashes, and eating food items replenishes the health meter. Both are available in the skate shop in exchange for cash.</p><p>Further modes include arcade mode, which hearkens back to the classic Tony Hawk games: after picking a pro skater, a two-minute-run of a level begins, in which a number of goals must be completed. While arcade and story modes use the same levels, the goals are completely different. The free skate mode allows practicing unlocked levels without a time limit. Multiplayer modes include two hot-seat games: a HORSE contest and a high score competition. Available only via the link cable is the cart racing mode, where players race each other in shopping carts à la <em>Jackass</em>.</p><p>Gameplay and controls remain the same from previous entries in the series. An entirely new option allows the skater to step off the board and run around on foot: thus a quick 'run-out' is a new trick to increase the combo multiplier.</p>"},{"name":"Tony Hawk's Underground 2","year":2004,"developer":"Vicarious Visions, Inc.","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Tony%20Hawk%27s%20Underground%202%20%28USA%2C%20Europe%29.zip","filesize":1,"score":7.3,"genres":"Sports > 3rd-person (Other) > Isometric > Skateboarding > Licensed","desc":"<p><em>Tony Hawk's Underground 2</em> is based on the console game of the same name. Like the previous GBA releases of the series, it's an isometric representation of the console levels combined with polygonal characters. It contains both a story mode, in which you create a rookie skater and take him or her on a world tour with pros to improve their skills and win prizes; and a classic mode, in which you must accomplish various goals such as tricking off objects or getting a high score within two minutes. Changes in this iteration include removing the timer from most goals in story mode, allowing you to have several active at once and new moves like the nata spin, tantrum, which allows you to recover from a bail without losing everything, focus, where you can slow time in order to land the best trick and sticker-slapping.</p>"},{"name":"Top Gear GT Championship","year":2001,"developer":"Vision Works"},{"name":"Top Gear: Rally","year":2003,"developer":"Tantalus Interactive Pty. Ltd.","url":"a#T.zip/T%2FTop%20Gear%20Rally%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7.7,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Off-roading","desc":"<p>Race through 10 circuits, each one tougher then the last and featuring different terrain, in an attempt to beat the other 7 rally racers on the track.Choose your rally car and make any changes required in order to compete with the other drivers. You can save copy of your ghost to race against, or compete against a friend using the link cable.</p><p>You can also upload your best times for each track on the internet, using the Worldwide Ranking system. By entering the password given to you after each race, you can enter it on the site and compare with other drivers around the globe.</p>"},{"name":"Top Gun: Combat Zones","year":2004,"developer":"Titus Software Corporation","url":"7#Top%20Gun%3B%20Combat%20Zones%20%28USA%29%20%5BEn%2CFr%2CDe%2CEs%2CIt%5D.gba","filesize":4194304,"score":"","genres":"Action > Diagonal-down > Arcade > Shooter > Direct control > Flight / aviation > Contemporary > War","desc":"<p>Jump into the cockpits of the Navy's top planes with Top Gun: Combat Zones. With the F-14, F-18, and F-22 under your control, you must embark on dangerous low-level missions throughout hazardous canyons and across vast cityscapes. Eliminate ground or air targets in Southeast Asia, Gulf States, Arctic Circle, and Miramar Base. The game offers 36 intense missions and a replay mode that lets you review each one through different camera angles.</p>"},{"name":"Top Gun: Firestorm Advance","year":2002,"developer":"Fluid Studios Ltd","url":"7#Top%20Gun%3B%20Firestorm%20Advance%20%5BEn%2CFr%2CIt%2CEs%2CDe%5D.gba","filesize":4194304,"score":6.7,"genres":"Action > Diagonal-down > Isometric > Arcade > Shooter > Flight / aviation > Licensed","desc":"<p><em>Top Gun: Firestorm</em> takes the player to the skies again in twelve missions where numerous aerial and ground based enemies need to be fought to arhieve victory. </p><p>The story is very loosely based on the movie of the same name. The player guides the well known pilot Maverick through a series of realistic training missions to receive graduation from the Top Gun school. The story is advanced in several stills throughout the game.</p><p>The player will fly a F-14 Tomcat on an isometric map. He has to complete several objectives in each mission. To achieve those he has four different weapons at his disposal (machine gun, bombs, rockets and missiles). The gameplay is somewhat similar to the Strike series.</p>"},{"name":"Top Spin 2","year":2006,"developer":"Magic Pockets SAS","url":"a#T.zip/T%2FTop%20Spin%202%20%28E%29%20%28M5%29.gba","filesize":1,"score":"","genres":"Sports > Diagonal-down > Direct control > Tennis","desc":"<p>SWING INTO THE PROFESSIONAL TENNIS TOUR!<br>Hone your skills and master your shots as you take on the top players around the world and on every surface. Rise up through the ranks as you serve and volley your way to the Top Spin 2 Championship!<br>16 of the world's best players, including Maria Sharapova, Venus Williams, Andy Roddick and Roger Federer.<br>Refine your game and master every stroke: forehand, backhand, service, smash, volley, lob and passing shot.<br>Play as your favorite pro, or create \"yourself\" by customizing gender, name, skin color, hairstyle, outfit and country.<br>Hold court in the world's biggest tourneys - Wimbledon, U.S. Open and the Australian Open!<br>Multiplayer games require one Game Pak per player and a Game Boy Advance Game Link® cable (sold separately).</p>"},{"name":"Totally Spies!","year":2005,"developer":"Mistic Software Inc.","url":"a#T.zip/T%2FTotally%20Spies%21%20%28E%29%20%28M6%29.gba","filesize":1,"score":"","genres":"Action > 3rd-person (Other) > Side view > Platform > Spy / espionage > Licensed","desc":"<p>Sam, Alex, and Clover are bests friends and Totally normal high school girls. They got to school, they giggle at boys, and more than anything else, they love to shop. But then, one day, they get recruited by WOOHP the \"World Organization Of Human Protection\" to be secret agents and become Totally Spies!. Play the 16 levels on five different story. Use the super cool gadgets to defeat the bad guys.</p>"},{"name":"Tower SP, The","year":2005,"developer":"VIVARIUM Inc.","url":"a#T.zip/T%2FTower%20SP%2C%20The%20%28U%29.gba","filesize":1,"score":"","genres":"Simulation > Strategy > Side view > Real-time > Managerial / business simulation","desc":"<p>An enhanced port of The Tower, better known as <em>SimTower</em>, for the Game Boy Advance. Build your tower, set up offices and stores, and don't forget about the elevators.</p><p>The Gameboy Advance version is mostly identical to the PC/Mac version, but has a few enhancements, such as letting you manually clean bathrooms, and an extensive tutorial.</p>"},{"name":"Trick Star","year":2006,"developer":"Tantalus Interactive Pty. Ltd.","url":"a#T.zip/T%2FTrick%20Star%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Racing / Driving > Behind view > Arcade > Sci-fi / futuristic","desc":"<p>Take a one-wheeled bike for a spin in the futuristic world of Trick Star! Choose from four up and coming riders, and compete in the Ibex, Glyder and Kotsu Leagues to become the ultimate champion!</p><p><em>Trick Star</em> is a futuristic racing game where the racers ride slick one-wheeled bikes. Players race along the track, with the goal of not only coming first, but also performing stunts to impress the crowds. Stunts cannot be performed until a certain speed is reached, and the \"Trick Star\" appears on the HUD. When it appears, players can perform a stunt by holding L or R, as well as any direction on the Control Pad. Performing stunts also fills your boost meter - when it is full, you can press L and R simultaneously to get an extra boost.</p><p>In League Mode, players must complete three tracks, as well as scoring enough points to qualify for the Challenge Mode. Once the player has enough points, they can enter Challenge Mode, where they are asked to perform a particular set of stunts in between markers. When they succeed, they are rewarded with additional stunts and progress to the next set of tracks.</p><p><em>Trick Star</em> also includes one player at a time multiplayer, for up to four players. Players can compete in Time Trial (aim for the fastest time), Stunts (get the highest stunt point score), Long Jump (jump the longest distance along the track) and Challenges (complete the required challenges). After each player has had a go, the results are shown.</p>"},{"name":"Tringo","year":2006,"developer":"David A. Palmer Productions","url":"a#T.zip/T%2FTringo%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Puzzle > Fixed / flip-screen > Tile matching puzzle","desc":"<p>Combines elements of puzzle games and bingo for an amazing addictive game.<br>Quick and easy to play, yet difficult to master...and put down!<br>Play with a friend using a Game Boy Advance™ Game Link™ cable.<br>Multiple modes including Classic, Time Trial and Infinite.</p>"},{"name":"Tristam Island","year":2020,"developer":""},{"name":"Trollz: Hair Affair!","year":2005,"developer":"Powerhead Games","url":"a#T.zip/T%2FTrollz%20-%20Hair%20Affair%21%20%28Europe%29%20%28En%2CFr%2CEs%29.gba","filesize":1,"score":"","genres":"Adventure > Compilation > Puzzle > Side view > 2D scrolling > Fixed / flip-screen > Cards / tiles > Mini-games > Music / rhythm > Platform > Direct control > Multiple units/characters control > Fantasy > Licensed","desc":"<p><em>Trollz: Hair Affair!</em> is a minigame compilation based on the animated television series produced by DIC Entertainment Corporation. It features five teenage \"trollz\", Amethyst, Ruby, Sapphire, Topaz, and Onyx, who manage their day-to-day high school lives with the help of their magic. Each character is tied to a different minigame: Topaz has \"Watch the Hair\", in which she shrinks down and climbs through her friends' hair to untangle knots while dodging frizzies and Snarf; Sapphire has Smarty Trollz, a memory-matching game; Ruby has Trollz Dance, a rhythm game; Amethyst has Flying Spell, an aerial sidescroller that also involves shooting enemies while managing the skoot's energy; and Onyx has Spell Beadz, a Puzzle Bobble clone. Each minigame also features collectible power-ups, with each one doing something different depending on the game. The gameplay is affected by the difficulty setting chosen at the beginning of the game (easy, medium, or hard).In the story mode, these minigames are played in between short cutscenes.</p>"},{"name":"TRON 2.0: Killer App","year":2004,"developer":"Digital Eclipse Software, Inc.","url":"a#T.zip/T%2FTron%202.0%20-%20Killer%20App%20%28E%29.gba","filesize":1,"score":6.5,"genres":"Action > Racing / Driving > Behind view > Diagonal-down > Isometric > Arcade > Mini-games > Puzzle elements > Flight / aviation > Tank > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Detective / mystery > Licensed","desc":"<p>With the ENCOM Corporation under attack by a mysterious hacker, the legendary program TRON is reactivated to seek out the source of a deadly self-evolving virus introduced to the system, and shut it down. TRON is also accompanied by Mercury, a female Light Cycle program who also battles for the system.</p><p>TRON 2.0 is an isometric adventure that leads TRON and Mercury through the computer world battling corrupted programs while collecting special chips to enhance their abilities. Along the way, players will also take control of Tanks, Recognizers and Light Cycles in their quest to help the Users.</p><p>As an added bonus, the original Midway TRON and Discs of TRON arcade games are included as extra mini-games.</p>"},{"name":"Turbo Turtle Adventure","year":2002,"developer":"Iridon Interactive AB","url":"a#T.zip/T%2FTurbo%20Turtle%20Adventure%20%28U%29.gba","filesize":1,"score":6.8,"genres":"Action > Top-down > Puzzle elements","desc":"<p><em>Turbo Turtle Adventure</em> is a puzzle adventure game similar to Marble Madness where the player guides a rolling turtle through different platform like mazes. Played from a top down perspective, the player has to control his turtle throughout the levels without falling over the edge. There's seven different levels in total and includes a jungle, volcano and a space station. </p><p>There's a number of power ups or items available that are necessary to complete a challenge. First of all the player ha to fins keys to unlock doors. These come in different colors that have to match. Some tiles have arrows on them which force the player in the direction they face. To overcome this the player can use his turbo speed. Some of the ground is weak and can collapse when rolling over it. Often the player will come across gaps. For this there's a build item and a jump item. There's also gravity and wind which drag or push the the player. The turtle's shell can be upgraded in three ways. There's a glide shell which allows the player to go faster over slow ground, the panzer shell which allows the player to pass through force fields and the spike shell which allows the player to get a better grip on slippery ground such as ice.</p>"},{"name":"Turok: Evolution","year":2002,"developer":"RFX Interactive","url":"7#Turok%20Evolution%20%28USA%29.gba","filesize":8388608,"score":6.6,"genres":"Action > 3rd-person (Other) > Side view > Shooter > Sci-fi / futuristic","desc":"<p>In this prequel to the previous Turok games, you are Tal'Set, the saviour of natives of the River Village in the Lost Lands, who must confront the evil Lord Tyrannus, leader of the reptilian hordes. Tyrannus is bent on a \"Holy Mission\" to purify the Lost Land through slaughter and misery.</p><p>During the fight with your nemesis Captain Tobias Bruckner in 1886 Texas, you were injured and sucked in to the Lost Lands. After recovering in the village, you discover that Tyrannus appoints a new general to his armies –Bruckner. So you begin the war in a land of lush jungles, suspended cities, mysterious temples, reptile armies, and towering dinosaurs.</p><p>In the Game Boy Advance version of the game, you can choose to play solo or with a friend as you battle your way through hordes of hideous monsters. The game plays like a side-scrolling action game, similar to Contra.</p>"},{"name":"Tweety and the Magic Gems","year":2001,"developer":"Kotobuki System Co., Ltd.","url":"a#T.zip/T%2FTweety%20and%20the%20Magic%20Gems%20%28E%29.gba","filesize":1,"score":5.8,"genres":"Puzzle > Strategy > Top-down > 2D scrolling > Board game > Party game > Point and select > Contemporary > Fantasy","desc":"<p>Thanks to a run-in with a cursed treasure chest, Tweety Bird has contracted a petrification curse. To cure him, Granny needs to form an antidote from five different magical gems, each of which is located in a different area of the world. Oddly enough, instead of pooling their resources, Bugs, Daffy, Sylvester, and the rest of the Looney Tunes gang decide to compete against one another to collect the gems. On a massive game board, the player and up to three opponents (CPU or human) can assume the roles of these beloved characters and battle it out for the right to save Tweety.</p>"},{"name":"TwinBee","year":2004,"developer":"Konami Industry Co. Ltd."}]