[{"name":"Ultimate Arcade Games","year":2005,"developer":"Nocturnal Entertainment Australia Pty Ltd","url":"a#U.zip/U%2FUltimate%20Arcade%20Games%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > Top-down > Isometric > Arcade > Platform","desc":"<p><em>Ultimate Arcade Games</em> is a collection of 12 arcade-style games, inspired by a variety of popular classics. Each game utilizes core gameplay ideas from classic arcade games, while expanding and improving each game for a new generation of gamers.</p><p>The games include:* Asteroid Mine</p><ul><li>BeeKeeper</li><li>ChipBot</li><li>FlipSide</li><li>Galaxy Hero</li><li>Gridlock</li><li>Highway 51</li><li>Merchant Galactic</li><li>Milk Run</li><li>Omega Force</li><li>Rubes Cubes</li><li>Treasure Hunter</li></ul><p>Playing each game earns the player coins, which are used at the shop to purchase additional games and challenges. There are 120 challenges available to test the player's skills, and more than 340 medals to be earned. There is a high score board for each game, and players are able to view detailed statistics about time played, games played, medals won, and overall completion percentage.</p>"},{"name":"Ultimate Beach Soccer","year":2003,"developer":"Magic Pockets SAS"},{"name":"Ultimate Brain Games","year":2003,"developer":"cosmigo GmbH","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Ultimate%20Brain%20Games%20%28USA%2C%20Europe%29.zip","filesize":1,"score":"","genres":"Compilation > Puzzle > Strategy > Diagonal-down > Fixed / flip-screen > Turn-based > Board game > Cards / tiles > Chess > Tile matching puzzle > Point and select","desc":"<p>Ultimate Brain Games is a collection of 8 games you can play against the computer or a friend.  The games include Sink Ships (aka Battleship), Mahjong, Backgammon, Chess, Checkers, Reversi, Dominoes, and Four in a Row (aka Connect Four).</p><p>You start out by designing how your character looks.  You can modify 9 areas of your character, from eyes to clothes.  After doing so, decide to play single or multiplayer.</p><p>Each game follows the rules and gameplay seen in the original games.</p>"},{"name":"Ultimate Card Games","year":2004,"developer":"cosmigo GmbH","url":"a#U.zip/U%2FUltimate%20Card%20Games%20%28U%29.gba","filesize":1,"score":"","genres":"Gambling > Puzzle > Strategy > Top-down > Fixed / flip-screen > Cards / tiles > Point and select","desc":"<p>A comprehensive collection of card games for the GBA.  Includes options for both single player and multi-player games.  On screen rules and demo modes are provided for the games.  Simple controls (ala windows-style) allow easy navigation.  Options to change background image, music, and card deck backs are included.  Also includes an option to create a custom face for your player using the built in face generator. The following games are included (by category)</p><p>Casino:Poker, Black Jack, Video Poker</p><p>Classic:Hearts, Spades, Euchre, Canasta, Bridge, Cribbage, Go Fish, Gin Rummy, Crazy Eights</p><p>Solitaire:Klondike, FreeCell, Canfield, Pyramid, Gold, Spiderette, Baker's Dozen, Bristol, Castle, Aces Up, Baroness, Eagle Wing, Eight Off, Calculation, Betsy Ross</p>"},{"name":"Ultimate Mortal Kombat 3","year":2001,"developer":"Midway Manufacturing Company"},{"name":"Ultimate Muscle: The Kinnikuman Legacy - The Path of the Superhero","year":2002,"developer":"ShunDa"},{"name":"Ultimate Spider-Man","year":2005,"developer":"Vicarious Visions, Inc.","url":"a#U.zip/U%2FUltimate%20Spider-Man%20%28Europe%29%20%28Fr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Licensed","desc":"<p>Next to versions on consoles and Nintendo DS, <em>Ultimate Spider-Man</em> was also adapted for the Game Boy Advance. It follows the same basic story as the other versions (reducing it to its bare necessities and changing many details) and presents it as traditional 2D side-scroller.</p><p>The game is a follow-up to the Venom storyline from the <em>Ultimate Spider-Man</em> comic series. Three months after his apparent death, Venom is back and causing trouble. Spider-Man finds his home neighborhood of Queens besieged by a gang of thugs while a group of mercenaries have set their sights on capturing Venom. The game's storyline is illustrated by comic-style cutscenes, with many of the images re-used from the DS version.</p><p>The game consists of seven parts called \"issues\" of three chapters each. As in the other versions of the game, players will control both Spider-Man and Venom, both of which have different abilities. To take out the many enemies, both have various attack moves at their disposal, which can be strung along into combos. Both can also stick to walls and ceilings and pull themselves up (Spidey using his web, Venom using his tendrils). Spider-Man can additionally use his webbing in various other ways, like immobilizing enemies by throwing a web ball and swinging across obstacles. His web fluid however is limited and must be filled up by collecting appropriate power-ups. Power-ups are also needed to refill his health. Venom on the other hand cannot find power-ups even though his health constantly drains. He instead has to feed on defeated enemies to restore his health. Some levels feature permanent power-ups: increasing Spidey's maximum amount of web fluid or unlocking new combat moves.</p><p>The main goal in each level is simply to find the exit, but there are other objectives that have to be met, sometimes with a time limit. Spider-Man in particular often has to rescue civilians or disarm bombs. A directional indicator displays where the next objective is to be found. Several of the levels consist purely of boss battles.</p>"},{"name":"Uno / Skip-Bo","year":2006,"developer":"Black Lantern Studios, Inc."},{"name":"Uno 52","year":2006,"developer":"Black Lantern Studios, Inc.","url":"a#U.zip/U%2FUno%2052%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Strategy > Top-down > Board game > Cards / tiles > Licensed","desc":"<p>The classic game of Uno comes to the DS with different game modes. Players can customize the entire game setup based on the number of players, individual customization, game type, number of cards, alternate cards and house rules. The predefined game types include:* Endless: no win conditions and endless rounds. Between each round chips, pot wins, first-out wins and poker hand wins are shown.</p><ul><li>Chips: earn 50 to 500 to win. Players start with 25 chips and can go into debt.</li><li>Uno Wins: win 1 to 10 rounds by going out first.</li><li>Poker Wins: win 1 to 10 rounds with a poker hand.</li><li>Pot Wins: win the pot in 1 to 10 rounds.</li><li>Survival: extra ante based on the number of players still at the table. Players who lose all their chips are eliminated.</li></ul><p>There are also four special modes available:* Challenge Mode: play five unique or randomly-generated levels with different win conditions.</p><ul><li>Endurance Mode: maximize the score without running out of chips.</li><li>Timed Mode: earn as much as possible before time runs out.</li><li>Solitaire Mode: play all cards in a twist on the classic Solitaire card game.</li></ul><p>All the classic cards are available as well as the alternate poker rules for cards. Wireless multiplayer is supported for up to four players for the DS version, which is generally a port of the GBA release with stretched screens and ported sound. The number 52 in the title refers to the included game variation.</p>"},{"name":"Uno Free Fall","year":2007,"developer":"Black Lantern Studios, Inc.","url":"a#U.zip/U%2FUno%20Free%20Fall%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Puzzle > Falling block puzzle > Licensed","desc":"<p>America's favorite card game returns in an all-new format for your Game Boy Advance system! \"UNO Freefall\" is a new twist on an old classic! Six animated themed backgrounds provide the backdrop for more exciting and fast-paced UNO fun! Challenge yourself in four different game modes, or take on the computer in Classic, Flippy, Perfect Match or Timed modes!</p>"},{"name":"Upah no Otedama","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Urban Champion","year":2002,"developer":"Nintendo R&D1"},{"name":"Urban Yeti!","year":2002,"developer":"Cave Barn Studios","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Urban%20Yeti%21%20%28USA%2C%20Europe%29.zip","filesize":1,"score":"","genres":"Action > Top-down > Isometric","desc":"<p>Get Ready to Yeti in this 2.5D overhead arcade adventure game.  You are the Urban Yeti who is on a quest to find a mate so that you can propagate the species.  Hunted and feared by the human population, you make your way through four city stages and four arcade minigames based on classic titles from the 80's.  Urban Yeti! is notable for its bizarre humor and relative obscurity.</p>"},{"name":"Urbz, The: Sims in the City","year":2004,"developer":"Griptonite, Inc.","url":"a#U.zip/U%2FUrbz%2C%20The%20-%20Sims%20in%20the%20City%20%28UE%29%20%28M6%29.gba","filesize":1,"score":6.6,"genres":"Simulation > Isometric > Managerial / business simulation > Direct control > Comedy","desc":"<p>In this quasi-sequel to The Sims: Bustin' Out, the player finds themselves in the big city of Miniopolis. Starting out as a humble window washer, the player is quickly embroiled in a devious plot by the greedy tycoon Daddy Bigbucks to take over the city.</p><p>The story is much stronger this time around, with the player exploring three colorful city environments, including the New Orleans-influenced SimQuarter, the shiny Glasstown district, the gritty Urbania, and even a haunted bayou inhabited by two creepy Cajun brothers.</p><p>In addition to the traditional Sims gameplay of satisfying motives, making friends, and decorating an apartment, the player can experience eight job minigames, a \"xizzle\" system that lets players learn special abilities, and several new vehicles, including a motorcycle, hoverboard, and fanboat. Combine all that with a wacky sense of humor, and you get The Urbz: Sims in the City.</p>"}]