[{"name":"V-Master Cross","year":2002,"developer":"Birthday","url":"a#V.zip/V%2FV-Master%20Cross%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > Strategy > Isometric > Turn-based > Cards / tiles > Fantasy","desc":"<p><em>V-Master Cross</em> is an isometric turn-based RPG released only in Japan. The main hero is a young boy who was transported into a weird magic world. The gameplay is based on a special card fight - the battlefield is divided into squares (5 fields for each player), on which the player can summon monsters from a specific deck of cards, with some that can only be placed on a specific field. Each summoned monster has its own look and stats.</p>"},{"name":"V-Rally 3","year":2002,"developer":"Velez & Dubail Dev. Team","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/V-Rally%203%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":1,"score":7.8,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p><em>V-Rally 3</em> for the Game Boy Advance adapts the console game of the same name to the handheld platform, offering its own selection of cars, tracks, modes and a platform-appropriate graphics engine.</p><p>The main game mode is V-Rally Mode. It takes players through a rally championship over seven different countries, with each country's course consisting of distinct stages. Stages are taken on in groups of two, allowing for changing of car setup and repairs after every pair. Car setup options include a choice of tires (appropriate to road and weather conditions) as well as suspension, steering, brakes and gearbox. Bumping into the roadside during a race damages the car, with body, suspension, brakes, steering and turbos getting individual damage ratings. The repairs must be possible to be carried out within a time window or there is no choice but to drive on with the damage.</p><p>The game contains 10 licensed cars from 9 manufacturers, of which only two are available from the start. Winning a rally championship unlocks further cars. Driving the more powerful unlocked cars increases the game's difficulty, requiring much better times to keep ahead of the competition.</p><p>The game's second major mode is called V-Rally Cross and offers traditional circuit racing on five different tracks. Only one is available from the start, the others have to be unlocked by winning on the earlier tracks. Races are against three opponents and consist of two rounds of three laps each, one in forward, one in reverse direction. Performing well in the first round fills a boost meter that can be utilized in the second.</p><p>Time Trial mode allows single runs utilizing cars and tracks unlocked in the other modes. Multiplayer is available via the link cable and offers two-player versions of V-Rally Cross and Time Trial.</p><p>The game's graphics engine renders the tracks in texture-mapped 3D, with backgrounds, scenery (like trees and spectators) and the cars themselves displayed as 2D bitmaps. Graphical effects include rain, snow, fog and nighttime conditions. By default, the camera is behind the car, but there is also a first-person cockpit perspective (not available in V-Rally Cross) that shows the driver's hands steering and shifting and also displays damage to the car as cracks in the windshield.</p>"},{"name":"Van Helsing","year":2004,"developer":"Saffire, Inc","url":"a#V.zip/V%2FVan%20Helsing%20%28E%29%20%28M5%29.gba","filesize":1,"score":4.7,"genres":"Action > Diagonal-down > Isometric > Shooter > Fantasy > Licensed","desc":"<p>Van Helsing is an isometric action game, based on the movie of the same title. This game is different from Van Helsing from consoles. The player controls Van Helsing - monster hunter, who must kill Dracula...and his brides, Mr Hyde, and other enemies.Van Helsing operates in various locations (Transylvania and Paris inthe  tutorial), kills enemies, collects special items (to increase his health bar). He uses blades, guns and a special automatic crossbow.</p>"},{"name":"VeggieTales: LarryBoy and the Bad Apple","year":2006,"developer":"DC Studios, Inc.","url":"a#V.zip/V%2FVeggieTales%20-%20LarryBoy%20and%20the%20Bad%20Apple%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Platform > Puzzle elements > Direct control > Licensed","desc":"<p>Like the movie of the same name and the console version, <em>LarryBoy and the Bad Apple</em> features Bumblyburg, which is threatened by the super-villain the Bad Apple. She is tempting the town's citizens into sin, and only LarryBoy can stop her.</p><p>Gameplay consists of platform-based puzzles. Reach the green ticket in each level, within the time limit. Avoid enemies, run, jump, roll and swing your way around the levels.</p>"},{"name":"V.I.P.","year":2002,"developer":"Planet Interactive Development","url":"a#V.zip/V%2FV.I.P.%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.gba","filesize":1,"score":"","genres":"Action > Side view > Spy / espionage > Licensed","desc":"<p>VIP is based on the TV Series of the same name.  You play as the 5 members of the VIP Team, including Pamela Anderson as Vallery Irons.</p><p>The game is a side-scroller with 8 levels. In this game, you are loaded with firepower, and you’ll cruise the seedy Los Angeles underworld on crime-bustin’ missions. And when L.A.’s most notorious mobster kidnaps an elite plastic surgeon, it’s up to you to spearhead the rescue!</p>"},{"name":"Virtua Tennis","year":2002,"developer":"Altron Corporation","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Virtua%20Tennis%20%28USA%29.zip","filesize":1,"score":7.6,"genres":"Sports > Behind view > Diagonal-down > Direct control > Tennis","desc":"<p>Virtua Tennis arrives on the GBA, without the 'Virtual' 3D element, but with the same gameplay you expect from a tennis game.</p><p>Choose from a male or female player (or create your own) and take to the world tour, competing in various tournaments on clay, hardcourt, grass or indoors. Play against some of the best players in the world, both in singles and doubles, or compete against your friends in 4 player doubles.</p><p>Mini-games test your skills and improves the timing of your shots. Games range from Burger Chef (aim at the grid to decide what comes next on the burger), Disc Shooter (similar to Othello) and Bull's Eye, where you aim for the center of the target. Your created character will also improve depending on your success in each mini-game, with his or her stats increasing over time.</p>"},{"name":"Virtual Kasparov","year":2002,"developer":"Titus Interactive, S.A.","url":"a#V.zip/V%2FVirtual%20Kasparov%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":7,"genres":"Simulation > Strategy > Top-down > Isometric > Chess > Licensed","desc":"<p><em>Virtual Kasparov</em> is a chess game with thirty-one opponents of varying difficulty to face in a story mode. Victory over this multi-cultural group of chess players will lead to Garry Kasparov himself.</p><p>Various styles of boards are included along with several 3D boards. Multiplayer is supported via link-cable or on a single system.</p>"}]