[{"name":"Wade Hixton's Counter Punch","year":2004,"developer":"Inferno Games, Inc.","url":"a#W.zip/W%2FWade%20Hixton%27s%20Counter%20Punch%20%28U%29.gba","filesize":1,"score":7.4,"genres":"Action > Sports > 1st-person > Boxing","desc":"<p>During a little trip, young Wade Hixton finds himself stranded as his car breaks down. Luckily, or unluckily for him, a small town is nearby. Calling in for help, he find the people of Big Piney more then happy to help ... at a price. Wade must now strap on the boxing gloves and fight his way around the town against a range of strange characters ready to punch his lights out. To make enough money to fix the car, and make it out of the town alive, he'll be put to the test in and out of the ring.</p><p>The non-linear style of the game leaves you with all the options. You will choose who to fight, who to trust to make the right business decisions, and who your hard earned money should be spent on to purchase their help at a time of crisis in the ring. Wade's life and his car rest in your gloved hands.</p>"},{"name":"Wakeboarding Unleashed featuring Shaun Murray","year":2003,"developer":"Small Rockets","url":"a#W.zip/W%2FWakeboarding%20Unleashed%20featuring%20Shaun%20Murray%20%28U%29.gba","filesize":1,"score":7,"genres":"Sports > Behind view > Tricks / stunts > Wakeboarding > Licensed","desc":"<p>Wakeboarding is the new addition to the Activision line of extreme sports titles.</p><p>A rider (using a board that's like a combination of a surf board, body board and skateboard) is pulled along the water by rope at high speeds by the boat up front, and must pull of tricks either by jumping of jumps or using the wake left by the boat itself (hence the sports name).</p><p>Unleashed takes this sport and turns it upside down, allowing you to fly down water ways through well known locations around the world, pulling stunts off buildings or cliff faces. Other objectives are included that have you completing tasks and busting tricks in a unique way.</p><p>Multiplayer modes include one-on-one trick attack and horse, where both players compete against each other to pull off the best tricks.</p>"},{"name":"Wanko de Kururin! Wankuru","year":2004,"developer":"MTO Co., Ltd.","url":"a#W.zip/W%2FWanko%20Dekururi%21%20Wankuru%20%28J%29.gba","filesize":1,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Anime / Manga > Falling block puzzle","desc":"<p><em>Wankuru</em> is a falling-block puzzle game that plays similarly to Sega's Baku Baku Animal. Players drop pairs of puzzle blocks, which can be dogs, doghouses, or a mix of the two. The goal is to place long chains of dogs of the same colour, then place a doghouse of the same colour next to them so the whole chain can go home. Like other puzzle games, creating long chain reactions produces a major point reward. Like in the Puyo Puyo series, chain reactions rain garbage blocks down on the opponent's playfield; in this game, the garbage blocks are bones, and any dog eating a bone will refuse to enter a doghouse until they finish.</p><p>Similar to the earlier Windows version, there are both single-player and multiplayer modes. The main single-player game is a story mode which features some short visual novel-style scenes in between matches against the CPU. In this version the player is able to customize both their protagonist and their dog. The player can pick and name a female or male protagonist, and can also choose from one of a large number of dog breeds to name and customize. There is also a score attack mode, in which the player tries to get as far as possible through a set of 100 levels while racking up points. There is also a two-player mode which uses the Game Boy Advance's link cable.</p>"},{"name":"Wario Land 4","year":2001,"developer":"Nintendo R&D1","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Wario%20Land%204%20%28USA%2C%20Europe%29.zip","filesize":1,"score":8.2,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>In this fourth episode of the adventures of Mario's nemesis, the greedy Wario reads in a newspaper about a secret treasure lost in a pyramid. That's enough for Wario: he jumps in his car, enters the pyramid, and then you take control of him. Wario is a classic platform game with a twist: some enemies don't actually hurt you but change you into various forms, like Floating Wario, Zombie Wario, or Bat Wario.</p>"},{"name":"WarioWare, Inc.: Mega Microgame","year":2003,"developer":"Nintendo R&D1","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/WarioWare%2C%20Inc.%20-%20Mega%20Microgame%24%21%20%28USA%29.zip","filesize":1,"score":8.4,"genres":"Action > Sports > Side view > Top-down > Arcade > Fighting > Mini-games > Platform > Shooter > Comedy","desc":"<p>Tired of chasing after rival Mario and counting his millions again, Wario has put his spare time to good use to create his own video game, <em>WarioWare, Inc.: Mega Microgame$!</em>.</p><p>Simply put, <em>WarioWare</em> has you testing your skills in a huge collection of games from almost every genre you can think of. Each game lasts only a matter of seconds, but within that time you have to complete the task. This ranges from hitting a home run, stomping a handful of bad guys, winning a boxing match, solving a puzzle and winning the points.</p><p>You'll witness a wide selection of game graphics as well. Games originate from the original Nintendo Game &amp; Watch series, to the green tinted Game Boy titles and the modern day Game Boy Advance style. You'll also notice some well known names, including Metroid, Duck Hunt, the Mario Bros. series and much more hidden away between each mini game.</p>"},{"name":"WarioWare: Twisted!","year":2004,"developer":"Nintendo R&D1","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/WarioWare%20-%20Twisted%21%20%28USA%29.zip","filesize":1,"score":8.3,"genres":"Action > 3rd-person (Other) > Side view > Top-down > Isometric > Arcade > Fighting > Music / rhythm > Paddle / Pong > Platform > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>Wario's thrown a temper tantrum while playing his Game Boy Advance, and gone and broken it! He heads off to the manic Dr. Crygor's lab to get him to fix it. But what happens instead is that hundreds of Game Boy-like systems are created, with no buttons and an addictive tilt control! Wario's gonna be even richer than ever before when he sells this!</p><p><em>WarioWare Twisted!</em> is the sequel to the sleeper hit WarioWare Inc.: Mega: Microgame$!. It includes a built-in rumble pack and gyro sensor which the games have been designed around. Over two hundred five second games are hurled at the player as they make their way through the stage, trying to figure out what to do with a short description like \"Play!\", \"Avoid!\" or \"Digest!\". Each stage has a random game thrown at you, with a short time to complete it. Fail it, and you lose one of your four lives. Lose all four and it's game over. Pass enough games, and you'll get told \"FASTER!\" and the games start coming at you at a quicker speed. Finally, you'll encounter a Boss Stage, which has no time limit and is tougher to beat.</p><p>Each character's stage is based around a different 'theme'. Mona's games require you to make only a small spin to pass them, Jimmy T.'s games need a consistent rhythm to play, Kat and Ana's games simply need the use of the A Button, Dr. Crygor's games involve changing gravity itself, while the Nintendo nerd pair 9-Volt and 18-Volt have a set of Nintendo games which use all of the different styles of play from the other game sets.</p><p><em>Twisted!</em> also has a huge amount of novelty unlockables to collect. Once you've played through Story Mode, you can replay the games again for a higher score and bonus toys. Whenever you beat a Boss Game after completing Story Mode once, you'll be prompted to spin to get a bonus prize. This prize could be as simple as a light wand that you shake to see a picture, or a small arcade-style game involving sewing or rolling a cat around the floor while shooting bugs.</p>"},{"name":"Watch Out!","year":2002,"developer":"Nintendo Co., Ltd."},{"name":"Whac-A-Mole","year":2005,"developer":"DC Studios, Inc.","url":"a#W.zip/W%2FWhac-a-Mole%20%28U%29.gba","filesize":1,"score":"","genres":"Action > 1st-person > Arcade > Puzzle elements > Licensed","desc":"<p>This is an adaption of the arcade game Whac-A-Mole, for Nintendo's handheld devices. At the screen you have a 5x4 grid of holes (3x3 in the GBA version). As the game begins, moles will randomly pop up their heads in the holes. Now you have to hit them before they disappear again. DS users will use the stylus and tap the moles, while GBA users will have to use the directional pad to move a marker around the screen.</p><p>The game comes with three different game modes. The first is the arcade mode, were you for each level has to reach a certain amount of points before the time goes out. Different types of mole will show up. In addition to the standard mole, there's the golden mole which gives four times as much points as the standard one, and the plush one which gives minus points. Later in the game, you will also meet moles that attack your score, for example ninja and bazooka moles. Various power ups are also available. We have the multipliers, which  once active will give you double points for each mole, clocks that slows the time and bombs that do the opposite. Seven worlds are available, each with it's own graphical theme.</p><p>The second mode is the puzzle mode, which isn't the same on both platforms. In the DS version you have to recreate a shape that is shown on the upper screen. This is done by tapping moles of different colors. The GBA version has two puzzle games. One is a Tic Tac Toe where you have to hit three moles in a row before your opponent does so. The other is the Peg Puzzle where you have to empty the field from all moles. For each mole you remove, more moles will appear on the screen. The moles will have arrows around them, indicating where the new moles will pop up. However, there won't come any new moles if there already is a mole in that location.</p><p>The third mode is a simple quick play mode where you just specify how many levels you want to play and with what difficulty and then try to be successful. The DS version also supports a multiplayer mode.</p>"},{"name":"Wi-El: World Soccer Winning Eleven","year":2002,"developer":"Konami Computer Entertainment Tokyo, Inc."},{"name":"Wild Thornberrys, The: Chimp Chase","year":2002,"developer":"Helixe","url":"a#W.zip/W%2FWild%20Thornberrys%2C%20The%20-%20Chimp%20Chase%20%28U%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>Travel the globe to save Darwin!<br>Darwin has been kidnapped by poachers, Kip and Biederman. Help Eliza and her family track down the slippery duo and rescue Darwin.<br>Traverse the jungles of South America<br>Out run a rampaging rhino<br>Avoid an avalanche in the Arctic Circle<br>Ride with a kangaroo in the Australian Outback</p>"},{"name":"Wild, The","year":2006,"developer":"Climax Group Limited","url":"a#W.zip/W%2FWild%2C%20The%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%29.gba","filesize":1,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The game <em>The Wild</em> is based on the animated Disney movie of the same title. Exclusively released on Game Boy Advance it is your goal to rescue Ryan, the lion, who first escaped the zoo heading for true wilderness in order to learn lion's typical roaring, and then was captured by Kazar, the king of the wildebeests, who intends to sacrifice Ryan so as to change the food chain.</p><p>You can either play Samson, Ryan's father, or Benny the squirrel, each with different characteristics. In order to play the 19 episodes of the story mode the player first needs to perform certain tasks within solo missions. The game is a side-scrolling platformer aimed to be entertaining children and contains a battery based memory for three files.</p>"},{"name":"Wing Commander: Prophecy","year":2003,"developer":"ORIGIN Systems, Inc.","url":"7#Wing%20Commander%3B%20Prophecy%20%28Europe%29%20%5BEn%2CIt%2CFr%2CEs%2CDe%5D.gba","filesize":4194304,"score":7.9,"genres":"Action > Simulation > 1st-person > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>Following the Border Worlds conflict of Wing Commander IV, the galaxy is once more at peace. Colonel Christopher Blair, hero of the Confederation has transferred into the Naval Forces. Blair helps design the TCS Midway, a state-of-the-art multi-role carrier that will help keep order during the Confederation's new peacetime. The luxury of peace allows Confed to retire many older pilots and assign younger pilots to piloting roles. Lance Casey and his friend Max \"Maestro\" Garrett are two such pilots, fresh from the academy, transferred aboard the TCS Midway along with several others for its maiden voyage along the borders of Confed Space. But soon into the mission, the Midway intercepts a distress call from the Kilrathi, the remains of a race of cat-like warriors who lost the war with the Confederation...</p><p><em>Wing Commander: Prophecy</em> is a space combat simulator. Players take the role of Lance Casey on his new assignment aboard the ship. The player can click various hotspots aboard the ship to engage in non-interactive FMV conversations with shipboard personnel. By entering the briefing room, players can receive full instructions on their next mission.</p><p>Space Combat begins by launching from the TCS Midway carrier, and are displayed as first-person perspective inside the cockpit, similar to the rest of the Wing Commander series. Mission objectives vary between escort duties, patrol missions, search and destroy or defense of the TCS Midway herself. Depending on the ship being flown for the particular mission, the player will be able to switch between guns, missiles, torpedoes and mines with which to combat the enemy. The player, as wing commander, can give orders to nearby wingmen and communicate with any other ship. After each mission, the player must return to dock with the TCS Midway and will receive a mission performance rating.</p>"},{"name":"Wings","year":2003,"developer":"Cinemaware Corporation","url":"8#Nintendo%20-%20Game%20Boy%20Advance.zip/Wings%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Action > Simulation > Behind view > Diagonal-down > Top-down > Isometric > Flight / aviation > Vehicular combat > World War I","desc":"<p>You are an allied fighter pilot in WW1, duking it out with the \"Huns\" up in the sky in over 200 missions.</p><p>The missions usually come in three flavors: Top-down view bombing missions where you have to take out strategically important targets, isometric strafing runs where you get to blast anything that you fancy blasting with an unlimited supply of ammo, and of course the main part: Dogfights in the sky. Rendered in 3D, seems from behind your head.</p><p>The game is set in the years 1916 through 1918, and to loosen things up a little, we get to read a page of our character's new entry for the diary-like journal in his company between every mission.</p>"},{"name":"Winx Club","year":2005,"developer":"DC Studios, Inc.","url":"a#W.zip/W%2FWinX%20Club%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Adventure > Diagonal-down > Licensed","desc":"<p><em>Winx Club</em> is an action adventure game based on the Italian cartoon series of the same name. The story is similar to that of Harry Potter, only this time the main character is a fairy. She gets to go to a fairy school in fairytale world called Magix where she has to find her true self. This game is similar to the Windows and Playstation 2 versions, except that instead of a 3D third person perspective it features a 2D top-down perspective of the game world.</p><p>This game loosely retells the story of the first season of the television series.</p><p>There are \"action\" and \"adventure\"levels. In the adventure levels gameplay consists of finding items for specific NPCs and playing various mini-games. In the action levels the player has to jump, climb and fight enemies. The main character, Bloom, has a magic shield and two attacks that improve during the game. She can also cast a number of spells that can aid her in finding the items she needs. During boss battles Bloom changes to her Winx form in which she is more powerful and can fly. During the levels there are various items to be picked up which improve Blooms health or attacks or unlock new outfits that can be worn.</p>"},{"name":"Winx Club: Quest for the Codex","year":2006,"developer":"Powerhead Games","url":"a#W.zip/W%2FWinX%20Club%20-%20Quest%20for%20the%20Codex%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":"","genres":"Action > Puzzle > 3rd-person (Other) > Side view > Top-down > Mini-games > Music / rhythm > Shooter > Direct control > Point and select > Licensed","desc":"<p><em>Winx Club: Quest for the Codex</em> is a scrolling shooter game based on the Italian television cartoon series Winx Club. </p><p>In the game the player controls of the Winx fairies in order to save the pixie friends of their new-found friend Layla. The story is told through cutscenes and game play consists mainly of shooting enemies in typical side scrolling fashion. The game is broken up by six different mini-games. These include variants of Dance Dance Revolution and Pipe Dream and destroying bugs that are invading a garden.</p>"},{"name":"Wizardry: Summoner","year":2001,"developer":"","url":"a#W.zip/W%2FWizardry%20Summoner%20%28J%29.gba","filesize":1,"score":"","genres":"Role-playing (RPG) > 1st-person > Turn-based > Fantasy","desc":"<p>This spin-off entry in the <em>Wizardry</em> series has the player's party searching for a forbidden book of ancient power for the king through various randomly-generated dungeons. New to the series is the inclusion of the Summoner class, capable of capturing and summoning the various creatures the party comes across. Otherwise, the gameplay follows the traditional template of the series, including creation of a party of adventurers in the sole town, exploration of maze-like dungeons, and turn-based combat.</p>"},{"name":"Wolfenstein 3D","year":2002,"developer":"id Software, Inc.","url":"7#Wolfenstein%203D%20%28USA%2C%20Europe%29.gba","filesize":8388608,"score":7.9,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > World War II","desc":"<p><em>Wolfenstein 3D</em> is an episodic first-person shooter and a follow-up to the top-down infiltration game Castle Wolfenstein. The game puts the player in the boots of B.J. Blazkowicz, an allied spy. There are six episodes: the first distributed completely as shareware; the second and the third available after registration; and the three final missions (which happen before the events of the first episode) available in the Nocturnal Missions pack. </p><p>In the first episode (Escape from Wolfenstein), B.J. is captured, but overpowers a guard with the help of a concealed knife and manages to get out of his cell. Throughout the next nine levels, the player guides B.J. searching for an escape from Wolfenstein, guarded by Hans Grosse. After returning to Allied territory, B.J. is given the instructions to Operation: Eisenfaust, where he has to stop Dr. Schabbs and his army of mutant prototypes before they are released into the battlefields. The final mission (Die, Führer, Die!) has a simple goal: infiltrate the bunker under the Reichstag, and terminate Hitler (in a robotic suit) himself.</p><p>The Nocturnal Missions are focused on the Nazi plans for chemical warfare, and start with Dark Secret, where B.J. hunts for lead researcher Dr. Otto Giftmacher. It's followed by Trail of the Madman, where the goal is capturing the war plans guarded by Gretel Grosse, and the final episode Confrontation, where B.J. meets General Fettgesicht, the planner for the chemical assault.</p><p>Each episode has nine levels (eight regular and a final boss level), plus a secret level activated by a hidden switch somewhere in the eight first levels. Regular levels often feature a maze-like appearance or large areas with many enemies (the number of them on each area depends on the difficulty level), where the player must reach the exit elevator. To do so, he must kill the enemies (while it's possible to move behind the guards' backs and even there's a slight bonus in attacking them from behind, most enemies have to be dealt with by firepower), and depending on the level, activate \"push walls\" and/or get silver and golden keys to open certain doors.</p><p>Many objects can be found in a level, from medikits, chicken meals, and even dog food (to restore health), ammo, and treasures, which solely exist for points. There are four weapons (knife, pistol, machine gun, and Gatling), all of them using the same bullets except the knife. The knife and the pistol are given at the start of the level, while the machine gun is either found (usually in secret areas) or picked up from SS troopers, and the Gatling is always dropped somewhere in the level. There are five kinds of enemies (excluding bosses) - Dogs (fast, but more a nuisance than life-threatening), Army Soldiers (dressed in a regular brown outfit, not very powerful but usually found in large groups), Officers (dressed in white, armed with a very accurate pistol and tough to kill), SS Troopers (blue attire, armed with a machine gun and tough to kill), and Mutants (the rarest and toughest of regular enemies, pale-skinned troopers with green clothes and a machine gun stuck in their chest).</p><p>The player character has a number of lives; once he loses the last life, the game ends. To win extra lives, the player has to either find the 1-up item in the level or get 20,000 points (by killing enemies and capturing treasures or completing a level below the 'par' time while killing all enemies, finding all secrets by pushing walls, and collecting all treasure points).</p>"},{"name":"Woody Woodpecker in Crazy Castle 5","year":2002,"developer":"Tantalus Interactive Pty. Ltd.","url":"a#W.zip/W%2FWoody%20Woodpecker%20in%20Crazy%20Castle%205%20%28E%29%20%28M3%29.gba","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > Licensed","desc":"<p>Mother Nature needs Woody Woodpecker's help! Monsters have taken over the Fairy World and the Crazy Castle. With the promise of riches, Woody makes his way through many puzzling levels. Special powers given by Mother Nature, such as bow and arrows and a jet pack help Woody on his quest. Each level requires players to find eight keys, then reach the exit. New to the Crazy Castle series is the addition of Bosses at the end of each world.</p><p><em>Woody Woodpecker in Crazy Castle 5</em> also features a single-cart multiplayer mode where one player is 'it', and the other three players need to avoid being tagged. Players can also earn extra points if they catch Mother Nature, who pops up randomly in the levels.</p>"},{"name":"World of Dragon Warrior: Torneko - The Last Hope","year":2001,"developer":"Chunsoft Co., Ltd."},{"name":"World Poker Tour","year":2006,"developer":"Backbone Entertainment, Inc.","url":"a#W.zip/W%2FWorld%20Poker%20Tour%20%28E%29%20%28M3%29.gba","filesize":1,"score":"","genres":"Gambling > Strategy > Top-down > Fixed / flip-screen > Cards / tiles > Licensed","desc":"<p>Real Players - Compete against the virtual equivalents of six World Poker Tour™ professionals.<br>Real Casinos - Go \"All-In\" at any of the six Tour-exclusive casinos.<br>Real Poker - Featuring WPT™ style overlays and ProTuned™ A.I.<br>Multi-Player - Compete with up to 6 of your friends in Hot-Seat Tournaments.<br>Career - Play through the entire WPT™ Season and become Player of the Year.</p>"},{"name":"Worms Blast","year":2002,"developer":"Team17 Software Limited","url":"a#W.zip/W%2FWorms%20Blast%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.gba","filesize":1,"score":6.7,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Tile matching puzzle","desc":"<p><em>Worms Blast</em> is a puzzle game similar in concept to Puzzle Bobble, with several important distinctions and gameplay features taken from <em>Worms</em> games. Instead of releasing and matching bubbles, the player has to color blocks on a hexagonal grid. Unlike most Bust-A-Move variants, the player character can move right and left, sailing in a boat. Various weapons, such as bazooka, grenades, dynamite, and others, can be used to fire at the blocks, coloring them on impact. Like in the main, artillery-based <em>Worms</em> games, holding down the fire button increases the power of the weapon, affecting the distance it travels. </p><p>If the player hits a block that is either the same color as the missile fired, that block and any other same-colored blocks adjacent to it will be destroyed. Differently-colored blocks will not be affected by shooting at them; however, if they are held solely by a group of blocks of the same color, they will fall into the water when that group disappears. Blocks with rainbows on them can count as any color. Unlike <em>Puzzle Bobble</em>, there are no walls in single-player mode. If the player aims the weapon outside of the screen, a heavy object might fall on the player-controlled boat, damaging it.</p><p>The game's main mode is called \"Puzzle mode\": the player completes various stages, the goal being different in each (e.g. shooting down certain forms of blocks, avoiding hostile blocks that move around the screen, etc.). Beside this mode, the game features a single-player tournament mode with high scores, as well as a variety of multiplayer modes. The action component is particularly noticeable in this mode, since the walls between the areas will periodically open, allowing players to use this opportunity to shoot at each other's boats.</p>"},{"name":"Worms World Party","year":2002,"developer":"Team17 Software Limited","url":"7#Worms%20World%20Party%20%28EU%29%20%5BEn%2CFr%2CDe%2CIt%2CEs%5D.gba","filesize":4194304,"score":7.6,"genres":"Strategy > Side view > 2D scrolling > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p><em>Worms World Party</em> is a game which shares the bulk of its gameplay with Worms: Armageddon. It introduces the following:</p><ul><li>the Wormpot, a mechanic which allows the use of up to 3 modifiers to change the gameplay for the next match (e.g. automatically rising water levels, blood effects, slippery terrain...)</li><li>new campaign missions</li><li>co-operative campaigns</li><li>forts game mode</li><li>new predefined maps</li><li>all schemes available from the start</li></ul><p>The Game Boy Advance version of the game includes two weapons which were removed from <em>Worms: Armageddon</em> but were present in Worms 2 - the Homing Cluster Bomb and the Homing Airstrike, as well as a weapon absent from all other <em>Worms</em> games - the Chainsaw.</p>"},{"name":"Wrecking Crew","year":2004,"developer":"Nintendo Co., Ltd."},{"name":"WWE Road to WrestleMania X8","year":2002,"developer":"Natsume Co., Ltd.","url":"a#W.zip/W%2FWWE%20-%20Road%20to%20Wrestlemania%20X8%20%28U%29%20%5BhIRff%5D.gba","filesize":1,"score":6.7,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>The best wrestlers of the WWE take each other on for the championship belt, under your control. Choose from tag team, one-on-one, cage matches, handicap, triple threat and fatal four way battles in 7 different venues.</p><p>Pay-Per-View mode has you competing for ratings. Choose the right venue to fight in and suceed in the fight to gain high ratings and unlock new venues. After every victory you also pick up special WWE items including CD's, toys and DVD's, collect them all to prove you are the true champ.</p>"},{"name":"WWE Survivor Series","year":2004,"developer":"Natsume Co., Ltd.","url":"a#W.zip/W%2FWWE%20-%20Survivor%20Series%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>Based on WWE’s annual pay-per-view event, <em>WWE Survivor Series</em> is the sequel to WWE Road to Wrestlemania X8. Players choose from one of 16 WWE superstars in a variety of matches including Single, Tag, Cage, and Lumberjack as well as the 3 Stages of Hell, Tournament and Royal Rumble.</p><p>The game has a story mode where your aim is to win every title and become a WWE legend. You can choose whether to be on the Raw or Smackdown! brand and then choose which superstar from that brand you want to be. In the story mode you go through a series of matches while listening to advice from your General Manager; successfully following his orders increases your popularity level which improves your chances for a title match.</p>"},{"name":"WWF Road to WrestleMania","year":2001,"developer":"Natsume Co., Ltd.","url":"a#W.zip/W%2FWWF%20-%20Road%20to%20Wrestlemania%20%28U%29.gba","filesize":1,"score":"","genres":"Sports > Side view > Fixed / flip-screen > Fighting > Direct control > Wrestling > Licensed","desc":"<p><em>WWF Road to WrestleMania</em> is the first WWF game released for the Game Boy Advance. It is played from a side view view point in which the player selects a wrestler to compete. It features superstars such as Stone Cold, The Rock, The Undertaker, Triple H, X-Pac, Billy Gunn, Bob Holly, Raven, and 16 more. They all have unique entrances and move sets. There are multiple match types such as single, tag team, cage, iron man, hardcore, among others. The singleplayer mode consists of regular exhibition matches or a full season with the end goal of reaching the premier event of WrestleMania. Up to four human players can compete with the Gamelink peripheral.</p>"}]