[{"name":"X-Men: Reign of Apocalypse","year":2001,"developer":"Digital Eclipse Software, Inc.","url":"a#X.zip/X%2FX-Men%20-%20Reign%20of%20Apocalypse%20%28U%29%20%5B%21%5D.gba","filesize":1,"score":6.7,"genres":"Action > Side view > Beat 'em up / brawler > Licensed","desc":"<p>Pulled into an alternate dimension, the X-Men soon discover that their larger-than-life rival, Apocalypse, rules the planet. The only way to get home is to fight their way through the many enemies under his rule to the Warp Gate.</p><p><em>X-Men: Reign of Apocalypse</em> plays mostly as a traditional side-scrolling beat-'em-up, the characters executing punches, throws, and special attacks. The player has four X-Men to work with - Wolverine, Cyclops, Storm and Rogue. More characters gradually become available to use as they are unlocked during play. The player earns special points that can be used to enhance the characters' strength, vitality, and mutant power capabilities. A constantly growing power meter allows the heroes to unleash devastating mutant attacks than can kill several enemies at once.</p><p>The game includes two-player simultaneous gameplay mode; the player can also take on three friends in the Versus modes, including Capture the Flag and Deathmatch options.</p>"},{"name":"X-Men: The Official Game","year":2006,"developer":"WayForward Technologies, Inc.","url":"a#X.zip/X%2FX-Men%20-%20The%20Official%20Game%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.gba","filesize":1,"score":6.2,"genres":"Action > Side view > Beat 'em up / brawler > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>X-Men: The Official Game</em> is based on the third <em>X-Men</em> film. The game lets you control either Wolverine, Colossus, Iceman or Nightcrawler through twenty-five stages of a traditional side-scrolling beat-'em up. You move through the levels usually to find the exit. The stages can scroll from left to right, top to bottom or are designed more like a labyrinth. Enemies are getting rid off using a variety of punches. The characters differ hereby in range and the damage they deal. Every character also has his own special attack and some abilities on his own. For example, Colossus can smash certain materials while Wolverine regenerates his health over the time.</p><p>While you start off the game as Wolverine, you are later joined by the other characters and may switch between them any time. Every X-Man also has his own power bar, which is filled up by collecting blue symbols, which can be used up to increase the amount of damage you deal for a period of time.</p>"},{"name":"X2: Wolverine's Revenge","year":2003,"developer":"Vicarious Visions, Inc.","url":"a#X.zip/X%2FX2%20-%20Wolverine%27s%20Revenge.gba","filesize":1,"score":7.2,"genres":"Action > Side view > Platform > Sci-fi / futuristic > Licensed","desc":"<p>During the 1960's, a Canadian named Logan was used in a government-conducted experiment known as Weapon X. Unbreakable adamantium was ingested into his bones, in an attempt to turn him into a \"super-soldier\". For the rest of his life, Logan (who adopted the nickname Wolverine) will have to fight against the beast inside him. Only after meeting Professor Xavier and his X-Men team, Wolverine is able to find a purpose in his life. However, as his memories return, he realizes that the Weapon X experiment has infected him with a deadly virus, and he has only two days to find the cure.</p><p>Unlike the console and computer game of the same name, this version of <em>X2: Wolverine's Revenge</em> is a side-scrolling platformer. Wolverine mostly uses his most powerful weapon, the adamantium claws, to strike enemies with. With the claws unsheathed, he can enter an even more devastating \"Rage Mode\", achieved after the player repeatedly taps a button. Other abilities include dashing, clinging on walls and ceilings, and sliding to avoid taking falling damage. By pressing down a button, the player can also have the super-hero regenerate his health if he stands still.</p><p>Beside straightforward combat against regular enemies and bosses, the game also features stealth segments, during which Wolverine will have to traverse a stage unnoticed. He has a special stealth attack at his disposal, which will silently and instantly kill an unsuspecting enemy. Some levels also require the player to find specific items (such as keys) to proceed.</p>"},{"name":"Xevious","year":2004,"developer":"Namcot"},{"name":"xXx","year":2002,"developer":"Digital Eclipse Software, Inc.","url":"a#X.zip/X%2FxXx%20%28U%29%20%5BhIR00%5D.gba","filesize":1,"score":5.6,"genres":"Action > Racing / Driving > Behind view > Side view > Arcade > Platform > Shooter > Spy / espionage > Licensed","desc":"<p>Xander Cage (also known as \"xXx’\"), an underground dweller and an extreme sports fanatic, has been recruited by the US National Security Administration as their next super-agent. After completing two tests set up by Agent Gibbons, Xander is set on a real mission. His target is Anarchy 99, the deadliest crime syndicate since the mafia took over New York. They've got biological weapons and a terrorist agenda; the new agent has got firepower and attitude to sabotage their stockpile of terrorist missiles, bombs and biochemical weaponry. </p><p>Based on the feature film of the same name, <em>xXx</em> is a side-scrolling shooter with extensive platform elements and driving levels. During the side-scrolling stages, Xander will deal with his enemies using a variety of firearms, such as AK-47, shotgun, and others; he can also use grenades for a more devastating effect. However, there are also many traps laid on his way, such as mines, trip wires, etc. Running and jumping on platforms is also a common activity in the game. Power-ups and health kits can be found to help the secret agent survive.</p><p>The driving levels play similarly to Road Rash; Xander rides a bike, trying to avoid obstacles, and deals with his enemies by kicking them off their bikes, pushing them towards other cars and crashing them, etc.</p>"}]