[{"name":"16t","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"3 Ninjas Kick Back","year":1994,"developer":"Malibu Interactive","url":"d#3%20Ninjas%20Kick%20Back%20%28USA%29.zip","filesize":918534,"score":5.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>You must help an old samurai to retrieve a dagger he once got as an award for his achievements in martial arts. The dagger was stolen by somebody who envied the old warrior - now he cannot give this prize to the warriors of the next generation. Choose one of the three young ninjas to help the old man!</p><p>This is a traditional platform game based on the movie <em>3 Ninjas Kick Back</em>. Each one of the three ninjas has unique weapons and abilities. All three of them can run, duck, crawl, climb, jump, and hang on trees, ropes, etc. You'll encounter many obstacles and enemies, both regular and boss-like, which you'll have to overcome and defeat.</p>"},{"name":"6-PAK","year":1995,"developer":"SEGA Enterprises Ltd.","url":"d#6-Pak%20%28USA%29.zip","filesize":1841894,"score":7.6,"genres":"Compilation","desc":"<p><em>6-PAK</em> is a compilation of six of SEGA's most popular \"franchise\" games released in the early days of the Genesis. Included are the following:</p><ul><li>Columns</li><li>Golden Axe</li><li>Revenge of Shinobi</li><li>Sonic the Hedgehog</li><li>Streets of Rage</li><li>Super Hang-On</li></ul>"},{"name":"688 Attack Sub","year":1991,"developer":"Electronic Arts, Inc.","url":"d#688%20Attack%20Sub%20%28USA%2C%20Europe%29.zip","filesize":623708,"score":6.7,"genres":"Simulation > 1st-person > Naval / watercraft","desc":"<p>An early submarine game with ten missions which can be played with both American and Soviet attack submarines. The game focuses on realism with several stations the player can use (sonar, weapons, navigation, helm, radio, and periscope) but most duties can be delegated to crew members. The graphics are mostly close-up views of the control panels but on some occasions, they feature digitized images of surface ships and crew.</p>"}]