[{"name":"A Ressha de Ikō MD","year":1992,"developer":"Artdink Corporation"},{"name":"Aa Harimanada","year":1993,"developer":"Megasoft"},{"name":"Action 52","year":1993,"developer":"Active Enterprises Ltd.","url":"d#Action%2052%20%28USA%29%20%28Unl%29.zip","filesize":562146,"score":4,"genres":"Action > Compilation > Side view > Top-down > Arcade > Platform","desc":"<p><em>Action 52</em> features 52 different games in a single cartridge. Some of them are the same as those included with the identically entitled NES compilation, though most are unique to this release. The games are selected from a colored menu and are mostly side scrolling, platform or shooter action games. Each game is written in one color, yellow meaning \"expert\", purple \"intermediate\", green \"beginner\", blue \"two players\" and white \"special\". The games included are:</p><ol><li>Go Bonkers</li><li>Darksyne</li><li>Dyno Tennis</li><li>Ooze</li><li>Star Ball</li><li>Sidewinder</li><li>Daytona</li><li>15 Puzzle</li><li>Sketch</li><li>Star Duel</li><li>Haunted Hills</li><li>Alfredo</li><li>The Cheetahmen</li><li>Skirmish</li><li>Depth Charge</li><li>Minds Eye</li><li>Alien Attack</li><li>Billy Bob</li><li>Sharks</li><li>Knockout</li><li>Intruder</li><li>Echo</li><li>Freeway</li><li>Mousetrap</li><li>Ninja</li><li>Slalom</li><li>Dauntless</li><li>Force One</li><li>Spidey</li><li>Appleseed</li><li>Skater</li><li>Sunday Drive</li><li>Star Evil</li><li>Air Command</li><li>Shootout</li><li>Bombs Away</li><li>Speedboat</li><li>Dedant</li><li>G Fighter</li><li>Man At Arms</li><li>Norman</li><li>Armor Battle</li><li>Magic Bean</li><li>Apache</li><li>Paratrooper</li><li>Sky Avenger</li><li>Sharpshooter</li><li>Meteor</li><li>Black Hole</li><li>The Boss</li><li>First Video Game (Pong)</li><li>Challenge (the most difficult levels of each previous game)</li></ol><p>The game also offers a music demo screen and a randomizer, which picks a game at random.</p>"},{"name":"Addams Family Values","year":1995,"developer":"Ocean Software Ltd."},{"name":"Addams Family, The","year":1993,"developer":"Ocean Software Ltd.","url":"d#Addams%20Family%2C%20The%20%28USA%2C%20Europe%29.zip","filesize":615598,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Addams Family is a platform game based on the characters and settings from the movie (which, in turn, is based on the famous 1960's television series, which in turn is based on Charles Addams cartoon of the same name, which was featured in the magazine, The New Yorker, in the 1930s).</p><p>The game takes place towards the end of the movie: the Addams Family has been evicted from their home by a court order issued by a backstabbing attorney (there's one for the books), Tully Alford. Even worse, the other Addamses: Morticia, Pugsley, Wednesday, Granny, and Lurch have gone missing.</p><p>As Gomez, you must tour the Addams mansion in search of your lost family, battling out mysterious monsters and evading traps, and eventually face your nemesis, Tully.</p>"},{"name":"Advanced Busterhawk Gleylancer","year":1992,"developer":"NCS Corporation","url":"8#Sega%20-%20Genesis.zip/Advanced%20Busterhawk%20Gleylancer%20%28Japan%29%20%5BT-En%20by%20M.I.J.E.T.%20v061023%5D.zip","filesize":1,"score":7.2,"genres":"Action > Side view > Anime / Manga > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>A side-scrolling sci-fi shooter, Gleylancer casts you as Lucia, a young pilot in the Space Fleet of starfighters that hijacks the experimental Gleylancer fighter to go explore the outer borders of known space in search of her missing father. Along the way Lucia will have to shoot down dozens of enemies in standard shooter fashion, while avoiding destruction and collecting power-ups that extend her ship's energy, upgrade weapons and gather screen-clearing bombs.</p><p>The Gleylancer comes equipped with two hovering satellites that can receive weapon upgrades of their own, and can lock their positions at specific angles to increase your firepower and protect the player from enemy attacks. Features only a single-player campaign with two different endings depending on how the final stages are completed (e.g. if Lucia's father is rescued or not).</p>"},{"name":"Advanced Daisenryaku: Doitsu Dengeki Sakusen","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Adventures of Batman & Robin, The","year":1995,"developer":"Clockwork Tortoise Inc.","url":"d#Adventures%20of%20Batman%20%26%20Robin%2C%20The%20%28USA%29.zip","filesize":1191628,"score":7.2,"genres":"Action > Side view > Top-down > 2D scrolling > Beat 'em up / brawler > Platform > Shooter > Cyberpunk / dark sci-fi > Crime > Licensed","desc":"<p>Based on the award-winning TV series, <em>The Adventures of Batman and Robin</em> pits the player against the diabolical Mr. Freeze who wants to freeze Gotham with a huge ice cannon and his hired help of other Gotham super villains: The Joker, Mad Hatter, and Two-Face. The player can take the role of either Batman or Robin but this choice doesn't make a difference regarding gameplay. </p><p>This is a side-scrolling action game. The player basically walks from left to right while fighting numerous foes in hand-to-hand combat. Weapons which are found during the levels are used to shoot enemies from a greater distance. These weapons can also be upgraded by picking up the corresponding symbols. </p><p>There are overall four areas (one for each villain) with three levels each, including a film studio or the Gotham University. While most stages are typical fighting levels with occasional 3D effects there are also a few flying ones where the player uses the Batwing or a jet pack.</p>"},{"name":"Adventures of Mighty Max, The","year":1994,"developer":"WJS Design","url":"d#Adventures%20of%20Mighty%20Max%2C%20The%20%28USA%29.zip","filesize":555308,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>The Adventures of Mighty Max</em> is based on the TV cartoon <em>Mighty Max</em> which in turn is based on a series of toys.Max is a kid who possesses a magic cap that allows you to travel across different world and to save people who get in trouble in other dimensions. But his archenemy, the demonic Skull Master, has recently locked all the portals Max was using for inter-dimensional travel. However, the Skull Master has kept some of the portals for himself, keeping there some of his destructive weapons. It's time to destroy those weapons and to stop Skull Master!</p><p>This is a platform game in which you control Max himself or one of his two side-kicks (that doesn't influence the gameplay). You travel through several different worlds. Your goal is to find Skull Master's weapons, which are scattered around the level, and to destroy them. The levels are timed, and there are also plenty of enemies who will disturb you on your way to the goal.</p>"},{"name":"Adventures of Rocky and Bullwinkle and Friends, The","year":1993,"developer":"Absolute Entertainment, Inc.","url":"d#Adventures%20of%20Rocky%20and%20Bullwinkle%20and%20Friends%2C%20The%20%28USA%29.zip","filesize":560125,"score":5.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Adventures of Rocky and Bullwinkle</em> is the video game adaptation of the 60's cartoon series staring Bullwinkle, a moose, and Rocky, a flying squirrel. The game plays out much like an episode of the show. The story begins at the dedication of the Frostbite Falls Rocky and Bullwinkle museum. Unfortunately, the not-so-nice Boris and Natasha have disguised themselves as security guards for the museum and managed to steal some of the priceless artifacts.</p><p>Bullwinkle and Rocky must track down the stolen artifacts and return order to Frostbite Falls. Most of the action is of the side-scrolling platformer variety, but along the way, you will get to play lots of mini-games involving characters from the show. During the platforming sections you can switch instantly between the two protagonists. Both play differently: Bullwinkle can throw bombs at enemies and Rocky can fly for short instances.</p>"},{"name":"Adventures of Yogi Bear","year":1994,"developer":"Blue Turtle"},{"name":"Aero the Acro-Bat","year":1993,"developer":"Iguana Entertainment Incorporated","url":"d#Aero%20the%20Acro-Bat%20%28USA%29.zip","filesize":519553,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>You play as bat Aero, who have to stop the mad scientist Edgar Ektor, who is trying to rid the world of amusement and fun. So you jump through the circus-style levels, using different kinds of machines such as catapults, cannons, bubble machines, platforms, etc., collecting various power-ups such as cheese, soda, keys, clocks, etc. and avoiding lethal obstacles.</p>"},{"name":"Aero the Acro-Bat 2","year":1994,"developer":"Iguana Entertainment Incorporated","url":"d#Aero%20the%20Acro-Bat%202%20%28USA%29.zip","filesize":1129598,"score":7.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>In the sequel to Aero the Acro-Bat you have to defeat evil industrialist Edgar Ektor once again. He is back and again with bad ideas, so you - in the role of Aero - have to find and destroy him before he carries out his diabolical \"Plan B\". Like in the last installment, you have to jump, escape lethal obstacles and progress in time. This game features more moves for Aero, more mechanisms to use and more items to collect.</p>"},{"name":"Aerobiz","year":1992,"developer":"KOEI Co., Ltd.","url":"d#Aerobiz%20%28USA%29.zip","filesize":422095,"score":7,"genres":"Strategy > Top-down > Managerial / business simulation > Flight / aviation","desc":"<p>You are the CEO of an airline company. Your goal is to become the most successful airline in the world by connecting all 22 cities with air routes, maintain a profit, and meet the required quota of passengers. If you cannot turn a profit for a year or meet the victory conditions in 32 years you lose. Some strategic decisions you must make include negotiating for open air routes, purchasing or selling aircraft, invest in branch offices and hotels, advertise your airline and set budgets. You must also pay attention to statistics like quarterly and annual sales reports, as well as city data. World events also affect your airline, from natural disasters to war and even the Olympic games, all of which will affect how many passengers you get. All the planes in the game are based on real-life aircraft, such as the Boeing 747 and the Concorde.</p>"},{"name":"Aerobiz Supersonic","year":1994,"developer":"KOEI Co., Ltd.","url":"d#Aerobiz%20Supersonic%20%28USA%29.zip","filesize":475620,"score":6.5,"genres":"Simulation > Strategy > Managerial / business simulation","desc":"<p>You have just been elected as the CEO of a brand new airline company that must compete against 3 other airlines for global dominance. Set up new routes, buy businesses, and manage all your resources including planes, cashflow, and company representatives.</p><p>The basic premise of the game is the same as that of the original Aerobiz, but this time you have more planes to choose from, more city airports spanned over 7 different global regions, and 4 different time period scenarios complete with historically accurate political relationships and events.</p><p>Do you have what it takes to make your company fly high? Or will it crash and burn?</p>"},{"name":"After Burner II","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#After%20Burner%20II%20%28USA%2C%20Europe%29.zip","filesize":245742,"score":6.8,"genres":"Action > Behind view > Arcade > Shooter > Flight / aviation","desc":"<p><em>After Burner II</em> is an updated re-release of After Burner. Besides extra levels, a few new enemies, a few touches at the soundtrack and more disposable missiles, the biggest addition is the ability to slow down or speed up manually. The rest of the gameplay remains identical.</p><p>Despite being called <i>After Burner</i>, most ports to home computers and consoles are based on this version. The NES, Amiga and Commodore 64 received two different ports with significant technical differences. This entry documents the original ports and the second ones can be found under the following entries: NES and Amiga / C64.</p>"},{"name":"Air Buster","year":1991,"developer":"Kaneko Co., Ltd.","url":"d#Air%20Buster%20%28USA%29.zip","filesize":320000,"score":7.1,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p><em>Air Buster</em> is a fast side-scrolling shooter. The player controls a small craft through different levels with many enemies. Every level ends with a boss and some sections speed up the gameplay, offering fast obstacle courses both horizontally and vertically scrolling. Flying orange pods release many power-ups at once, enhancing the ships with new or more powerful lasers, wing men and shields. The player can also hold the fire key to charge a blast that removes all enemy bullets from the screen and deals damage to all enemies. With an unforgiving difficulty, every hit is fatal, but the game can be continued from any point as long as there are lives and credits left. The game can be played with two players cooperatively.</p>"},{"name":"Air Diver","year":1990,"developer":"Copya System Ltd.","url":"d#Air%20Diver%20%28USA%29.zip","filesize":277502,"score":5.2,"genres":"Action > 1st-person > Shooter > Flight / aviation","desc":"<p>A terrorist organization led by a fanatic operating out of the Middle East has brought together a military force capable of holding the entire world hostage, backed by a lot of evil governments. The player needs to board a F-119 stealth fighter and stay undetected while taking out all opposition.</p><p>Although technically boarding a stealth fighter, no stealth elements are involved. After choosing one from the different locations on the map, the player is shown flying from a first-person cockpit perspective and enemies do not seem to have trouble locating the player's aircraft. In different solo missions the player needs to take out all opposition using regular bullets and lock-on missiles. All statistics, including the remaining time before running out of fuel and the enemies on the radar, are shown in the cockpit HUD. The craft is able to move left and right, and use a boost to do sideways rolls or complete loops to get behind enemies. Some shots can be taken, leading to body damage, but incoming missiles are usually fatal and those need to be shot or avoided. Next to regular enemies, there are also a few boss planes. Missions take place all over the world during different times of day.</p>"},{"name":"Akira","year":1994,"developer":"International Computer Entertainment Ltd.","url":"d#Akira%20%28USA%29%20%28Proto%29.zip","filesize":1325737,"score":4.3,"genres":"Action > Racing / Driving > Side view > Anime / Manga > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Akira</em> is a side-scrolling action game based on the anime film of the same title.</p><p>In the first few levels, you have to guide the main character Kaneda through an obstruction-filled road on his motorcycle. Obstacles come in the form of roadblocks, holes in the road, which must be jumped with the use of a ramp, and a variety of characters on the road who throw bombs at you. The roadblocks can only be cleared by grenades which you pick up by knocking over traffic cones. You must also make it to the end of the level without running out of fuel.</p><p>After the motorcycle levels, there are five platform levels. The object of these levels is basically to kill everyone you come in contact with, each kill adding to a meter which you have to fill to complete the level.</p>"},{"name":"Al Michaels Announces HardBall III","year":1993,"developer":"MindSpan","url":"d#Al%20Michaels%20Announces%20HardBall%20III%20%28USA%2C%20Europe%29.zip","filesize":1068123,"score":7.2,"genres":"Sports > Behind view > Diagonal-down > Baseball","desc":"<p>The third game in the Hardball baseball series.  This revision features 256 colour VGA graphics, and announcer Al Michaels provides running commentary while you play.</p>"},{"name":"Alex Kidd in the Enchanted Castle","year":1989,"developer":"SEGA Enterprises Ltd.","url":"d#Alex%20Kidd%20in%20the%20Enchanted%20Castle%20%28USA%29.zip","filesize":153403,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform > Regional differences","desc":"<p>Alex Kidd, resident of planet Aries, is the king's brother. One day he comes across a rumor that his long lost father, King Thor, is alive and somewhere on the planet Paperock. Of course he immediately travels to said planet to find his father.</p><p><em>Alex Kidd in the Enchanted Castle</em> offers standard platforming action in which Alex explores side-scrolling levels and has to avoid touching enemies. He has two standard attacks to his disposal: punching enemies on the ground and kicking them in the air. He also uses items to make his life easier, e.g. a pedicopter with a gun, a pogo-stick for reaching higher ground or an invulnerability cloak. After usage Alex puts those items into his inventory but he loses the active item when dying. Coins are acquired from defeated enemies or treasure chests.</p><p>Just like in Alex Kidd in Miracle World, the mini game Janken, also known as rock-paper-scissors, plays an important role: bosses are not defeated by shooting but by beating them in this game of chance. New in comparison to the predecessor is that Janken also needs to be played to purchase items in shops: After paying for the item it is only given to Alex if he wins the mini game. The result of failure is death.</p>"},{"name":"Alien Soldier","year":1995,"developer":"Treasure Co., Ltd.","url":"d#Alien%20Soldier%20%28USA%29%20%28Virtual%20Console%29.zip","filesize":1106909,"score":8.4,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Alien Soldier</em> is a side-scrolling action game in which the player takes the role of Epsilon-Eagle, the former leader of the Scarlet mutant group. The mutants are now lead by the evil Xi-Tiger who had turned them to terrorism, and one of their goals is to kill Epsilon-Eagle...</p><p>At the start of the game the player chooses four out of six weapons - each with special advantages or disadvantages against certain enemies. As mutant Epsilon-Eagle also has other special powers, e.g. teleporting across the screen or (with full health) morphing into a powerful phoenix destroying everything in his way. </p><p>The 25 levels consist of short side-scrolling sequences and a few boss fights. In fact the bosses take on the majority of the game and the side-scrolling sequences are mostly used to give the player opportunity to collect ammo boxes. Bosses have their own patterns and weaknesses.</p>"},{"name":"Alien Storm","year":1991,"developer":"Team Shinobi","url":"d#Alien%20Storm%20%28World%29.zip","filesize":370999,"score":6.5,"genres":"Action > 1st-person > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Shooter > Sci-fi / futuristic","desc":"<p>The aliens are invading Earth, and it's up to the \"Alien Busters\" to wipe them out and destroy their creator. The Busters consist of Karla, Gordon, and Scooter. Each one of them has their own weapons and special attacks.</p><p>When you start the game, you can select any one of these characters to play as. There are six missions to complete (eight in the Genesis version) with several stages, and each mission has you blasting aliens all the way to the end, from the streets to the mother ship where you'll meet the mother of all aliens. Unfortunately, blasting these aliens will not be an easy task, as they get tougher in every mission, and are capable of hiding into objects such as plants, postboxes, trashcans, drums, and several others. Each mission has an objective such as rescuing people destroying a UFO.</p><p>When you deal with a few aliens, flying heads will appear, which you can shoot to collect life or energy (by the way, life is important to you, since if yours get empty, you're dead). However, rather than using your ordinary weapons, you can use the special attacks that are enough to kill the aliens you currently see. These types of attacks vary depending on the character you choose at the start of the game. For instance, Gordon summons a U.S. Air Force Jet that drops bombs across the street, while Scooter is able to teleport out of his present location, and leave a series of bombs that will blow up aliens on sight, he will then re-appear. However, using your character's special attack uses up a lot of energy, and if you have little or no energy, you can't use it.</p><p>At the end of some missions is an alien boss, which you must destroy in order to complete the mission. Also, at the end of everyone, you have to enter buildings where you participate in a shooting gallery. The object is to kill aliens popping up from several locations with the building. </p><p>You can play <em>Alien Storm</em> by yourself, or with another person.</p>"},{"name":"Alien³","year":1992,"developer":"Eden Entertainment Software Ltd.","url":"d#Alien%203%20%28USA%2C%20Europe%29.zip","filesize":317537,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Sci-fi / futuristic > Horror > Licensed","desc":"<p><em>Alien³</em> is a video game based on the movie of the same name. The plot of the movie picks up directly after the end of <em>Aliens</em>. Ellen Ripley, the main character of the <em>Alien</em> series, is in cryo-sleep aboard the spaceship Sulaco. Unfortunately, an alien or two has stowed away on the Sulaco and wreaked havoc within the ship. Thus, it crashes on the prison colony planet Fiorina 161. Ripley and the unarmed prisoners have to figure out a way to survive the aliens terrorizing the colony until help arrives.</p><p>The gameplay of the various <em>Alien³</em> conversions varies from platform to platform. This version is a side-scrolling action game with large maze-like levels. At each level, you have to rescue all the trapped prisoners and then make your way to the exit, all while surviving multiple alien attacks.</p>"},{"name":"Alisia Dragoon","year":1992,"developer":"Game Arts Co., Ltd.","url":"d#Alisia%20Dragoon%20%28USA%29.zip","filesize":608970,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p><em>Alisia Dragoon</em> is the female protagonist of this fast-paced platform game. Alisia must destroy an evil demon and avenge her fathers death through eight stages. She has only one weapon to dispose of enemies: thunder magic. This magic is auto-aiming and can track multiple targets. However, her quest is no easy task as the levels are loaded with fantasy-inspired monsters. Using thunder magic reduces a magic gauge, meaning you often have to wait for it to recharge. Once fully charged Alisia can unleash a massive rolling blast of lightning across the screen.</p><p>During the game, you can improve your magic by picking up potions. There are also four monsters which accompany Alisia: Dragon Frye, Ball O'Fire, Thunder Raven and Boomerang Lizard. Each has different abilities, deciding which, if any, to use in a given situation is part of the challenge. These monsters, like Alisia herself, are fully upgradeable with power-ups. They can also die if weakened too much, forcing you to hunt for a reviving power-up. You can pause the game and select your companion at any time.</p>"},{"name":"Allan Border's Cricket","year":1994,"developer":"Audiogenic Software Ltd."},{"name":"Altered Beast","year":1988,"developer":"Team Shinobi","url":"d#Altered%20Beast%20%28USA%2C%20Europe%29.zip","filesize":325157,"score":6.2,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform","desc":"<p>You are a hero raised from the dead by the god Zeus to rescue his daughter Athena. With scenery inspired by Ancient Greece, you have to fight hordes of undead and demons, with a boss at the end of each level until you meet the god Neff, who holds the girl captive.</p><p>The <em>Altered Beast</em> title refers to your shapeshifting abilities. In this platformer, you can collect spirit balls by defeating two-headed wolves, allowing you to mutate into different beasts such as a werewolf, a dragon, a tiger, a bear and others depending on the version. Each form, tied to a level, comes with special abilities such as flight and powerful attacks, easily superseding the basic set of punches and kicks in your human form.</p><p>The game can be played in single player mode, or in same-screen multiplayer co-op mode.</p>"},{"name":"American Gladiators","year":1992,"developer":"Imagitec Design Inc.","url":"d#American%20Gladiators%20%28USA%29.zip","filesize":422432,"score":4.3,"genres":"Action > Simulation > Side view > Top-down > Fighting > Game show / trivia / quiz > Platform > Licensed","desc":"<p><em>American Gladiators</em> is licensed from the popular TV show of the same name. It features a series of events testing players' strength, speed and skill against a trained team of ten 'Gladiators', five male and five female. The female characters are Ice, Gold, Lace, Blaze and Zap, most of whom are known for their bodybuilding achievements. Main male characters are Turbo, Nitro (who was featured in several television commercials for American television), Gemini, Thunder and Laser (Mr. Montana of 1986).</p><p>In total there are seven events, all viewed from third-person views. The final one is the Eliminator assault course, in which you compete directly against an opponent.</p>"},{"name":"Andre Agassi Tennis","year":1992,"developer":"TecMagik Entertainment Ltd.","url":"d#Andre%20Agassi%20Tennis%20%28USA%29.zip","filesize":336752,"score":4.9,"genres":"Sports > Diagonal-down > Tennis > Licensed","desc":"<p>A game endorsed by the American player who stunned the tennis world in the early 90s with his \"Image is everything\" looks, sporting long hair, earrings and colorful shirts, <em>Andre Agassi Tennis</em> includes eight players (male and female and as expected, only Agassi is a real player) rated according to movement speed and both accuracy and strength on serve, backhand and forehand.</p><p>Gameplay features all the usual moves: smashes, passing shots, volleys and all kinds of backhand and forehand plays, but unlike other games, precise positioning and timing are crucial to avoid hitting the ball outside the court, swinging the racket into thin air or more embarrassing, let the ball hit you on the head.Three courts are available: Grass, Clay and Indoor (Sega versions add a fourth, Hard), but the differences between them are minimal. Game modes change according to the version, with the 16-bit versions including a \"Skins\" game, where each point is worth a sum of money based on the number of times the ball was hit.</p>"},{"name":"Angry Birds in Russia","year":2013,"developer":"BMB"},{"name":"Animaniacs","year":1994,"developer":"Konami Co., Ltd.","url":"d#Animaniacs%20%28USA%29.zip","filesize":632742,"score":7.3,"genres":"Action > Side view > 2D scrolling > Puzzle elements > Licensed","desc":"<p><em>Animaniacs</em> is a side-scrolling action/puzzle game based on the animated TV series of the same name. The Warner kids, Yakko, Wakko, and Dot have escaped the water tower again and are on a quest to retrieve movie memorabilia from the Warner Bros. studio lot. </p><p>There are 4 stages, and in each stage the Warners must work together to get past obstacles and enemies. Yakko can push or pull boxes, Wakko can use his hammer to smash things, and Dot can blow kisses to charm simple minded foes.</p>"},{"name":"Arcade Classics","year":1996,"developer":"Atari, Inc.","url":"d#Arcade%20Classics%20%28USA%2C%20Europe%29.zip","filesize":103495,"score":5.9,"genres":"Compilation","desc":"<p><em>Arcade Classics</em> offers three classic Atari titles. It includes the following games:</p><ul><li>Missile Command</li><li>Centipede</li><li>Pong (<em>Ultrapong</em>: both <em>Pong</em> and <em>Hockey</em>)</li></ul><p>All games have selectable difficulty options. They contain a classic mode as well as a Genesis mode (SEGA mode in the Game Gear version), which enhances the graphics and adds new sound effects.</p>"},{"name":"Arcade Legends Volume 1","year":1991,"developer":"Sonic Team","url":"d#Arcade%20Legends%20Sega%20Mega%20Drive%20~%20Arcade%20Legends%20Sega%20Genesis%20~%20Mega%20Drive%20Play%20TV%20%28World%29.zip","filesize":2464564,"score":"","genres":"Arcade","desc":"<p>Sonic the Hedgehog</p><p>Altered Beast</p><p>Dr. Robotnik's Mean Bean Machine</p><p>Flicky</p><p>Golden Axe</p><p>Kid Chameleon</p>"},{"name":"Arcade Legends: Street Fighter II (Special Champion Edition)","year":1993,"developer":"Capcom Co., Ltd.","url":"d#Arcade%20Legends%20Street%20Fighter%20II%27%20-%20Special%20Champion%20Edition%20~%20Mega%20Drive%20Play%20TV%203%20%28World%29.zip","filesize":2150217,"score":"","genres":"Arcade","desc":"<p>The system contains Street Fighter II: Special Champion Edition and the Mega Drive version of Ghouls'n Ghosts built-in.</p>"},{"name":"Arch Rivals","year":1992,"developer":"Midway Manufacturing Company","url":"d#Arch%20Rivals%20-%20The%20Arcade%20Game%20%28USA%2C%20Europe%29.zip","filesize":201382,"score":6.1,"genres":"Sports > Side view > 2D scrolling > Basketball","desc":"<p><em>Arch Rivals</em> is a 2-on-2 basketball game that stands out from the crowd for its \"no rules\" approach. Fouling out other players is more than accepted, it's encouraged. Choose from twelve different teams and eight players, each with their own traits and personalities.</p>"},{"name":"Arcus Odyssey","year":1991,"developer":"Wolf Team","url":"d#Arcus%20Odyssey%20%28USA%29.zip","filesize":803420,"score":7.2,"genres":"Action > Diagonal-down > Isometric > Fantasy","desc":"<p>Long time ago, an evil sorceress Castomira decided to conquer the world. But a good princess revolted against her, and in a great fight defeated the sorceress. But in order to completely seal the sorceress' powers, the princess had to forge a magic sword. For a long time this sword guarded the peace of the citizens of Arcus. But now the followers of Castomira stole it, and the world is facing a great peril...</p><p>This is a  Gauntlet-like game: lots of action and magic, with items to collects, and many dungeons to free from monsters. The game is also viewed from an isometric perspective, typical for the genre. Choose one of four characters to battle your way through dungeons and castles, or play with a friend in a 2-player mode.</p>"},{"name":"Arnold Palmer Tournament Golf","year":1989,"developer":"SEGA Enterprises Ltd.","url":"d#Arnold%20Palmer%20Tournament%20Golf%20%28USA%2C%20Europe%29.zip","filesize":297275,"score":6.9,"genres":"Sports > Golf > Licensed","desc":"<p>Select your level of play, and then head for the pro shop to choose between Black Carbon, Glass Fiber, and Ceramic Clubs.</p><p>Tee off by yourself or play 18 holes with a friend. Besides the One and Two Player modes there's also a practice mode, match play (head to head), and a full-blown international tournament, where you'll stroke it out against 15 competitors.</p><p>Tournament play lasts 12 rounds, 18 holes of golf each. Most rounds are standard \"stroke\" play but the seventh and eighth rounds are \"match\" games. Things really get serious when match game ends in a tie, and players move into a sudden death play-off.</p><p>During the tournament players earn higher skill levels, more knowledgeable caddies, and more power. You'll earn a password at the end of each round of the tournament.</p><p>The game let's you play on three different courses; Japan, the United States, and Great Britain.</p>"},{"name":"Arrow Flash","year":1990,"developer":"ITL Co., Ltd.","url":"d#Arrow%20Flash%20%28USA%29.zip","filesize":257862,"score":6.2,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p><em>Arrow Flash</em> is a side-scrolling space shooter. The player controls a female spaceship pilot who is sent on a mission into deep space to save the Earth from an assault by an evil dragon from another galaxy. Moving vertically or horizontally, players must avoid or kill the enemies and make it to the end of the level alive where a boss battle awaits. During gameplay, the player can switch at any time between two modes: normal spaceship and flying robot. The two forms use different weapons and also have different special abilities, called Arrow Flash. While the spaceship can fire destructive lasers for major damage, the robot can raise a shield that will protect from enemy attacks for some time and instantly kill anything that touches it. The Arrow Flash attacks can be charged by holding a button for several seconds, or collect icons during your flight to release it quickly afterwards.</p>"},{"name":"Art Alive","year":1991,"developer":"Western Technologies Inc.","url":"d#Art%20Alive%20%28World%29.zip","filesize":58829,"score":"","genres":"Educational > Graphics / art","desc":"<p><em>Art Alive</em> allows the player to create drawings. Art Alive comes with over 50 graphics and animations ready to be used in the player's drawings. Use drawing tools such as the pencil, eraser, paint bucket, paint can, line tool, rectangle tool, and circle tool to create original artwork. The game also includes pre-drawn backdrops that can be colored in with the paint bucket.</p>"},{"name":"Art of Fighting","year":1994,"developer":"SNK Corporation","url":"d#Art%20of%20Fighting%20%28USA%29.zip","filesize":953398,"score":6.7,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Martial arts","desc":"<p>Yuri Sakazaki has been kidnapped! Her big brother Ryo Sakazaki and Robert Garcia, his best friend, go search for her on the streets of South Town. As they go deeper and deeper they will find clues as to who ordered the kidnapping, the Sakazaki family's relation to the mob, and a person from their past.</p><p>The gameplay differs from most fighting games. In this game, you have a Spirit meter. A Spirit meter is in the game and will decrease as you perform special moves. It can be recharged, but doing so leaves you open to attack. When your health is almost gone, you can perform a secret combination that will unleash a deadly attack on your opponent - provided you have a full Spirit meter.</p><p>The arcade version doesn't allow you to play as Mr. Big and the elusive Mr. Karate.</p>"},{"name":"Astérix and the Great Rescue","year":1993,"developer":"Core Design Ltd.","url":"d#Asterix%20and%20the%20Great%20Rescue%20%28USA%29.zip","filesize":993291,"score":6.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The game is based on the popular French comics series <em>Astérix</em>. It is 50 B.C., and the entire Gaul (today's France) is conquered by the Romans. Only one village still remains independent, thanks to the incredible powers of its two great warriors, Asterix and Obelix. In the game, they must first of all liberate the village Orvio and rescue their friend Dogmatix.</p><p>The player can play as either Asterix or Obelix. They make their way through platform levels, fighting enemies by punching them, and jumping to access higher ares or to avoid falling down. There are also some items that the player can collect, such as bombs, with which the player can overcome obstacles and advance in the game.</p>"},{"name":"Astérix and the Power of the Gods","year":1995,"developer":"Core Design Ltd.","url":"d#Asterix%20and%20the%20Power%20of%20the%20Gods%20%28U%29.zip","filesize":1114857,"score":6.5,"genres":"Action > Side view > 2D scrolling > Platform > Classical antiquity > Licensed","desc":"<p>Based on the French comics series <em>Asterix</em>. Asterix and Obelix are great warriors of Gaul (today's France), that was conquered by the Roman Empire 50 B.C. Vercingetorix, the great leader of the Gauls, was defeated by Julius Caesar, and lost his shield to him. Now it's up to Asterix to recover this shield from the Romans!</p><p>In this platform game, you guide Asterix through various levels. You can move on an isometric overview map to access different locations. You can jump, run, and defeat your enemies by spinning and hitting them. There is a variety of items to collect and obstacles to overcome.</p>"},{"name":"Atomic Robo-Kid","year":1990,"developer":"UPL Co., Ltd","url":"d#Atomic%20Robo-Kid%20%28USA%29.zip","filesize":198553,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>As the half-human half-cyborg flying machine of the title, you are faced with 28 levels to clear of enemies. The gameplay is horizontally scrolling. Your unit is able to fly and then hold at a certain level in space. Defeated enemies often release gems, which can be collected towards power-ups. These include more powerful or multi-directional firing.</p>"},{"name":"ATP Tour Championship Tennis","year":1994,"developer":"SIMS Co., Ltd.","url":"d#ATP%20Tour%20Championship%20Tennis%20%28USA%29.zip","filesize":1038115,"score":7.1,"genres":"Sports > Diagonal-down > Tennis > Licensed","desc":"<p>In this quasi-sequel of <em>Wimbledon</em>, Sega secured the ATP license, bringing 32 players (including Pete Sampras, John McEnroe and Stefan Edberg) plus a few others from the Senior Tour (among six others, legends such as Ilie Nastase and Stan Smith), as well as the option to create four players that can be developed in the ATP Tour mode. Each player has seven attributes that define their control and power in both serve, forehand and backhand, as well as their footwork. Four court types are available which affect the speed and bounce of the ball in different ways, and 11 real ATP tournaments are available to play.</p><p>There are three game modes: Exhibition match, Exhibition Tournament (where the player competes in a 32-player tournament), ATP Senior Tour Event (where the player chooses one of the retired players and competes in a 8-player tournament) and the ATP Tour, where it's possible to create a player and develop his skills by winning (or simply doing well) on tournaments, with one extra point on each round won.</p><p>Gameplay uses a simple 3-button layout, where the A button lobs the ball, B performs a controlled passing shot and C allows the fastest top spin shots, with the directional pad affecting the direction and depth of the shot.</p>"},{"name":"Attack of the Petscii Robots","year":2022,"developer":"8-Bit Productions, LLC."},{"name":"Australian Rugby League","year":1994,"developer":"Electronic Arts UK Ltd.","url":"d#Australian%20Rugby%20League%20%28U%29.zip","filesize":678452,"score":"","genres":"Sports > Isometric > Rugby > Oceania > Licensed","desc":"<p>Australian Rugby League is the \"sequel\" of some sorts of Rugby World Cup 95, but focusing on Rugby League rather than Union. In addition to the 20-team league that names the game and the State of Origin, a competition between two selections of players from New South Wales and Queensland, an European League (composed by twelve teams) and international playoffs (eight) are also available. It is possible to play friendlies, or jump straight to the club competition playoffs.</p><p>Gameplay is simple, and focus on quick passing and running rather than kicking to gain distance. The A button controls kicks the ball (tackles in defense), B passes (or changes players) and C rushes and breaks tackles. There are a few additional tricks, such as pressing A+B to perform a short, lobbed kick or A+C to clear the ball from the defense. Kicking from a dead ball situation uses a three-click method. The first sets the bar in motion, the second the strength, and the third the accuracy. The stronger the shot, the less accurate it will be, and the initial position of the kicker also affects the direction of the ball. Each button represents a different ball height, from A (which is the lowest) to C (highest). Weather also affects how the game is played, as high temperatures with hard grounds make longer games tougher on the players (slowing them down) and cold, wet weather makes passing the ball more difficult.</p>"},{"name":"Awesome Possum Kicks Dr. Machino's Butt","year":1993,"developer":"Tengen Inc.","url":"d#Awesome%20Possum...%20...Kicks%20Dr.%20Machino%27s%20Butt%20%28USA%29.zip","filesize":1265078,"score":5.2,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p>In just a few years, mankind has succeeded in destroying the environment and endangering all living species. Under the guidance of the evil Dr. Machino, robotic machines were built to turn the Earth into a soulless place without live nature. There is only one hero who can save the living beings of the planet - you, a little possum. Fight Dr. Machino's robots and liberate the Earth!</p><p>This is an action platformer very similar in gameplay style to  Sonic games. The possum can jump and run very quickly, as well as spin to hurt the enemies and breeze through the levels. Various robotic creatures will will try to kill you during your journey to Dr. Machino's lair. You can either avoid or try to defeat them on your way.</p>"},{"name":"Awogue","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"AWS Pro Moves Soccer","year":1993,"developer":"ZAT Productions","url":"d#Pro%20Moves%20Soccer%20%28USA%29.zip","filesize":322558,"score":"","genres":"Sports > Top-down > 2D scrolling > Real-time > Direct control > Football (European) / Soccer","desc":"<p>If anyone is wondering what the AWS in this title means, it is an acronym for Asciiware World Sports. Now with that out of the way, this is a soccer game with training, exhibition, and tournament modes.</p><p>Training lets the players team practice without an opposing team on the field. Exhibition is the basic one team versus another for one game. The tournament mode is divided into two different modes; 8 Nations and World Cup. 8 Nations is just a shorter version of the World Cup tournament mode because it involves only 8 teams instead of all 32 of them like it does in the World Cup mode.</p><p>The player can choose to play as one of these 32 International teams or can choose to create their own team that has its own shirt, stripe, and shorts colors.</p><p>The game has options that allow the player to choose to have light or heavy wind, a dry, soggy, or snowy field, and to have fouls turned on or off.</p>"},{"name":"Ayrton Senna's Super Monaco GP II","year":1992,"developer":"SEGA Enterprises Ltd.","url":"d#Ayrton%20Senna%27s%20Super%20Monaco%20GP%20II%20%28USA%29%20%28En%2CJa%29.zip","filesize":761811,"score":6.7,"genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Track racing > Licensed","desc":"<p>Ayrton Senna won the Monaco Grand Prix six times, as well as 3 Formula One world championships, so he was the perfect man to license a home sequel to the classic arcade racing game. As before, the action is viewed from within the cockpit, but depicted using sprites rather than polygons. </p><p>There are three main modes:</p><ul><li><b>Senna GP</b>: Features three non-championship circuits with a preliminary race followed by three laps. </li><br><li><b>World Championship</b>: The full 16-race championship. There are two modes in the championship mode that affect how the game is played. <i>Beginner</i> is a regular season, with the same difficulty level as the remaining modes, and cars have roughly the same power. Each race has three laps. In <i>Master</i> things get a twist. There are five groups of cars, and the player starts on the lowly competitive SERGA team. To climb the ranks and get a chance of claim the title the player must challenge a driver from other team and beat him to the top spot. The winner of this particular race gets (or holds) the fastest car. Races are also longer in this mode, and pit-stops are activated, required if the player knocks on too many objects or other cars frequently. </li><br><li><b>Free Practice</b>: This allows the player to drive on any race without caring for championship positions. There are two options in Free Practice: <i>Free Run</i> is just the player against the clock and <i>Image Training</i> is a race, but instead of having to qualify and then run the three laps, the player can set the number of laps (between one and six), starting position and the condition of the track (dry or wet, only on some circuits).</li></ul><p>While each mode presents it's own variations, the core of each race is the same: Along controller setup options, the player can choose between an Automatic or Manual with 4 or 7 speeds gearbox, and races against 16 drivers. The car can be instantly wrecked if it goes on top speed against a roadside object.</p>"}]