[{"name":"B.O.B.","year":1993,"developer":"Gray Matter Inc.","url":"d#B.O.B.%20%28USA%2C%20Europe%29%20%28Rev%20A%29.zip","filesize":641982,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic","desc":"<p>You are a teenage ant-like robot, who is going out for a date...However, you take your dad's car and he warns you; if you make a scratch on the car, you will never drive it again...</p><p>Of course, you make a scratch and crash on a unknown planet!What to do now?</p><p>Guide B.O.B through a colorful game with the strangest enemies you ever seen, to find a new car to get home with...</p>"},{"name":"Baby's Day Out","year":1994,"developer":"","url":"d#Baby%27s%20Day%20Out%20%28USA%29%20%28Proto%201%29.zip","filesize":436231,"score":"","genres":"Strategy","desc":"<p>Baby's Day Out is an unreleased Sega Mega Drive strategy escort game developed by Designer Software and scheduled to be published by Hi-Tech Expressions sometime in late 1994 or early 1995. Based on the titular 1994 American film Baby's Day Out, it languished in development for about a year before being permanently shelved.</p>"},{"name":"Back to the Future Part III","year":1991,"developer":"Probe Software Ltd.","url":"d#Back%20to%20the%20Future%20Part%20III%20%28USA%29.zip","filesize":201578,"score":5.6,"genres":"Action > Side view > Top-down > 2D scrolling > Isometric > Arcade > Western > Licensed","desc":"<p><em>Back to the Future III</em> is a collection of four arcade games. Marty McFly and Doc Brown have traveled back through time to the year 1885 - and they're soon deep in trouble when they face \"Mad Dog\" Tannen's gang and have to find a way to return to the present. This game takes four scenes from the Hollywood movie <em>Back to the Future III</em> and turns them into arcade sequences:<em> </em><em>Buckboard Chase</em>*: Doc Brown goes horseback in an attempt to save Hill Valley's lovely school teacher Clara. This game of quick ducking, jumping and shooting alternates between a side-scrolling and a top-down perspective.</p><ul><li><p><strong>Shooting Gallery</strong>: The name says it all. A classic game of aim-and-shoot, spiced up by hidden extras and bonus targets.</p></li><li><p><strong>Pie Throwing</strong>: Meet the Mad Dog gang. They have guns, and you have... cream pies. It's an isometric version of the shooting gallery, only with ammo. And the targets shoot back.</p></li><li><p><strong>The Train</strong>: Basically a side-scrolling beat-em-up on train wagons with some ducking and jumping. Get rid of the mechanics and collect speed logs to push the engine to a magic 88 mph.</p></li></ul>"},{"name":"Bahamut Senki","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Ball Jacks","year":1993,"developer":"Namco Limited","url":"d#Ball%20Jacks%20%28W%29.zip","filesize":155543,"score":"","genres":"Action > Top-down > Arcade > Sci-fi / futuristic","desc":"<p><em>Ball Jacks</em> is a competitive action game taking place in the distant future. Two robot crabs, piloted by men seeking fame and fortune, face opposite each other in an arena. Behind them is a conveyor belt with large metal balls rotating around. The goal is to capture the opponent's balls and hold them until their timer runs out. Each crab has two claws which operate independently; they can be used to grab balls from the opposite side of the screen, as well as to knock them out of the opponent's grip. The player must also be careful, as taking a hit from behind will damage the crab, and if it takes too much damage then the crab must return to the pit area to be repaired.</p><p>There are several game modes included. The main focus is the World Championship mode, in which one player takes on a succession of increasingly skilled computer opponents. Also available is a two-player versus mode with a number of handicap options. There is also a training mode where the player can freely practice to get a feel for the controls, as well as a time trial mode where the goal is to grab as many balls as possible within the time limit.</p>"},{"name":"Ballz 3D: Fighting at its Ballziest","year":1994,"developer":"PF Magic","url":"d#Ballz%203D%20-%20Fighting%20at%20Its%20Ballziest%20~%20Ballz%203D%20-%20The%20Battle%20of%20the%20Ballz%20%28USA%2C%20Europe%29.zip","filesize":1085390,"score":6.3,"genres":"Action > Side view > Fixed / flip-screen > Fighting","desc":"<p>Ballz is a fighting game, but what makes it unique is the fact that your player is made out of balls. The game has a detailed 3D engine with a fixed camera. The game plays like your normal beat 'em up game. This game supports 2 players, 3 difficulties, and up to 21 matches.</p>"},{"name":"Barbie Super Model","year":1993,"developer":"Bonsai Entertainment, Inc.","url":"d#Barbie%20Super%20Model%20%28USA%29.zip","filesize":380559,"score":3.7,"genres":"Action > Side view > 2D scrolling > Arcade > Managerial / business simulation > Licensed","desc":"<p>Help Barbie become a great fashion model!  This is an arcade game with many different activities to participate in.</p><p>In each level, Barbie starts by going left to right with forced scrolling.  She has a default speed and can speed up as well.  She must avoid moving obstacles by moving up and down and controlling her speed.  If she hits one, she loses a chance and it's game over if she runs out of chances.  She must pick up items which grant point bonuses and extra chances.</p><p>There is also a camera item to pick up which brings you to a magazine cover shoot.  You are shown a cover with barbie wearing an outfit which is themed to the level.  You must then go to her dressing room and dress her in a matching outfit.  You are also given separate control of the colors of three different components and must match these.  You are awarded points for each correct match.</p><p>When you reach the right side of the level, you are given a runway practice.  This consists of four positions on the runway floor labeled to tell you which button you must press at each one.</p><p>Barbie then goes back through the level right-to-left.  On the return trip, there is a handbag to pick up.  This brings you to another magazine cover.  You then go to a makeup mirror where you must match Barbie's hairstyle, earrings, eyeshadow and lip and nail color to the cover.  Again, you are awarded points for each item which you get correct.</p><p>When you reach the left side of the level, you must then do Barbie's runway walk that you were given earlier.  You are awarded points for each station at which you perform the correct move.</p><p>Barbie then continues to the next level.  There are a total of four: Barbie driving down the street, skating on the beach, walking through a ski resort and walking through the park.</p>"},{"name":"Barbie Vacation Adventure","year":1994,"developer":"Software Creations Ltd.","url":"d#Barbie%20Vacation%20Adventure%20%28USA%29%20%28Proto%29.zip","filesize":521250,"score":"","genres":"Sports > Side view > Horse / derby > Volleyball > Licensed","desc":"<p>In <em>Barbie Vacation Adventure</em>, Barbie, along with her friend Midge in two-player mode, travels around the country to four different vacation spots, each with its own set of mini games.</p><p>In Iowa, at a county fair, Barbie must catch an escaped pig by walking up to it and pressing the action button, after that she can play carnival games. The options are a strength test, knocking down cans and a hit-the clown game. In the latter two, players can aim balls with the d-pad, then throw with the action button. Leading targets is required. The strength test has a mater that goes up and down and Barbie must land her hit when the indicator is on the bell to ring it.</p><p>In Wyoming, Barbie goes camping. First, she must assemble her tent. This is essentially a jigsaw puzzle. Next, she must jump from rock to rock to get to the other side of the park where she can go on a nature hike. In the next segment, players aim a camera cursor at animals as Barbie walks along the path and hit the action button to take photos. This requires good reaction time.</p><p>There's a ranch in Texas where Barbie can ride horses. The horse runs on its own. The player pushes the action button to make it jump. There are numerous gates on the course and the player must time jumps correctly to clear them. If they hit too many, they must start over. There is also the option to play horseshoes. The cursor moves about erratically and you must press the action button when it passes over the stake.</p><p>In Florida, Barbie can play volleyball against Midge. This game allows both players to play simultaneously in two-player mode. Barbie and Midge can move forward or backward on the court and hit action to set the ball. First one to ten points wins. There is also a diving segment where barbies must navigate an underwater maze to collect sunken treasure. It might remind some people of Barbie's Ocean Discovery.</p><p>Finally, there is Barbie's home in California. Ken has hidden presents around the house and Barbie must find them and identify them by shape.</p>"},{"name":"Barkley: Shut Up and Jam 2","year":1995,"developer":"Accolade, Inc.","url":"d#Barkley%20Shut%20Up%20and%20Jam%202%20%28USA%29.zip","filesize":1183332,"score":6.3,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Basketball > Licensed","desc":"<p>This game is a sequel to Barkley: Shut Up and Jam!. It is a street basketball game which means no referees to enforce fouls and no shot clock to force a player to take a shot. The game features an exhibition and a tournament mode. </p><p>In exhibition mode the player chooses 2 players out of a possible 10 to play in a 2 on 2 game. The game can either be played for 3 minutes, 5 minutes, or til the first team gets to either 21 or 50 points depending on what option is chosen.</p><p>The tournament mode is also a 2 on 2 game against various teams that represent cities across the United States.</p>"},{"name":"Barkley: Shut Up and Jam!","year":1994,"developer":"Accolade, Inc.","url":"d#Barkley%20Shut%20Up%20and%20Jam%21%20%28USA%2C%20Europe%29.zip","filesize":564351,"score":6,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p>In the game you play street basketball two-on-two with your friends on with computer. So there are no referees, no fouls, and no shot clock, but the teams called by the names of cities such as Phoenix or Chicago. You can choose your player from 16 available players, including Barkley himself.</p>"},{"name":"Barney's Hide & Seek Game","year":1993,"developer":"Realtime Associates, Inc.","url":"d#Barney%27s%20Hide%20%26%20Seek%20Game%20%28USA%29.zip","filesize":584090,"score":4.7,"genres":"Adventure > Side view > 2D scrolling > Platform > Fantasy > Licensed","desc":"<p>Barney is a friendly dinosaur who likes playing with children. One day Barney and his little friends decide to play hide-and-seek game. Barney's task is to find the children and the presents they have hidden.</p><p>Barney travels across four different levels. On each one there are five children and five presents to find. You can only jump in the game when there are higher platforms to access. Despite being a platformer, this is not an action game, since Barney can't die and there is no quick reaction required to complete the game. The game is designed for little children and has a very low difficulty level.</p>"},{"name":"Bass Masters Classic","year":1995,"developer":"Black Pearl Software","url":"d#Bass%20Masters%20Classic%20%28USA%29.zip","filesize":725146,"score":"","genres":"Simulation > Sports > Top-down > 2D scrolling > Direct control > Fishing > Licensed","desc":"<p>This game consists of five 3-day tournaments at four lakes. The mission is to catch as much large bass as possible. Once the day of the fishing tournament is over, the five largest bass that were caught get weighed and are compared to the other fisherman's catches. The one with the heaviest catch is the winner.</p><p>The player starts off choosing an angler. Then the player can either go to the bait shop, practice pond, or start in the tournament. In the bait shop, choices of baits, lines, rods, reels, fish finders, and boat engines are available for purchase. The practice pond mode is just where the player can cut his teeth on the game mechanics without consequence.</p><p>The tournament mode is the main part of the game. Players start out in a fishing boat. Some of the factors that can affect your fishing are temperature, wind speed, water clarity and time of day. After casting the line, the game goes from an above the lake view to a side view of the lake water depths. Then it's just up to the player to attract the fish with the bait, and after the fish is caught on the hook, reel it in.</p>"},{"name":"Bass Masters Classic: Pro Edition","year":1996,"developer":"Black Pearl Software","url":"d#Bass%20Masters%20Classic%20-%20Pro%20Edition%20%28USA%29.zip","filesize":1173973,"score":"","genres":"Simulation > Sports > Top-down > 2D scrolling > Direct control > Fishing > Licensed","desc":"<p>This game is basically an update to Bass Masters Classic. Updates involve adding 6 pro fishermen, five different lakes instead of four, an expanded lineup of different fishing equipment, 2 difficulty level settings, a zoom function, larger lakes, and new music tracks.</p>"},{"name":"Batman Forever","year":1995,"developer":"Probe Entertainment Ltd.","url":"d#Batman%20Forever%20%28World%29.zip","filesize":2147279,"score":5.9,"genres":"Action > Side view > Beat 'em up / brawler > Platform > Martial arts > Licensed","desc":"<p>Batman Forever is the officially licensed game based on the 1995 movie. The bad guys this time around are The Riddler and Two-Face.</p><p>This game is an usual hybrid of side-scrolling platformer and one-on-one fighter. You make your way through levels that include some platform jumping elements, but you typically take on opponents one at a time like in a fighting game. You arsenal includes a lot of nifty bat-gadgets, and a collection of fighting moves that are unleashed with special button combinations.</p><p>The graphics were rendered completely with digitized actors and objects, but none of the actors from the movie make an appearance in the game.</p>"},{"name":"Batman Returns","year":1992,"developer":"Malibu Interactive","url":"d#Batman%20Returns%20%28World%29.zip","filesize":640432,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Genesis title based on <em>Batman Returns</em> is a platform game in which the Dark Knight must traverse five action-filled levels on his way to confront the Penguin.</p><p>Areas include the rooftops of Gotham City, Max Shreck's department store, the Red Triangle Circus and the sewers. Besides run-and-jump action, there's also a lot of combat in the game, as many of the Penguin's henchmen stand in Batman's way. He can knock them out with punches and kicks and a number of extra weapons stored in his utility belt. These include batarangs, which come in standard and self-seeking varieties, and smoke bombs that stun enemies for a while. In addition, Batman can shoot from his grappling gun and unleash a deadly swarm of bats towards enemies. All of these weapons have limited ammo, however, that must be collected.</p><p>Other special tools Batman can use include the grappling hook to reach high places or swing across chasms, and his cape, which can be used to slow falls.</p><p>Each of the five levels features several boss battles against Catwoman, the Penguin and others.</p>"},{"name":"Batman: Revenge of the Joker","year":1992,"developer":"Sun Electronics Corp.","url":"d#Batman%20-%20Revenge%20of%20the%20Joker%20%28USA%29.zip","filesize":616790,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Joker lives again in SunSoft's sequel to their NES original. The Joker has somehow managed to escape from Arkham Asylum once again, and Batman must fight him across seven stages to restore peace to Gotham City.</p><p>Batman carries a gauntlet shooting basic bullets by default. This can be upgraded with weapon powerups located in boxes throughout the level, giving access to homing and energy weapons. Every upgrade weapon can be charged up for a secondary attack, different for each weapon. Batman also has a slide useful against most enemies and some bosses. </p><p>Boss fights introduce a system where life is measured by points instead of tick marks or bars. In these sections, Batman has significantly more health, and can take many more hits when rumbling with these stronger foes.</p><p>Levels include a snowy landscape, moving train, military base, and sewers. Two levels require you to run and dodge explosions while vehicles keep pace in the background. Some levels also have Batman activate a jetpack and play through a short side-scrolling shooter. </p><p>This game is one of the few Batman games that was not based directly on a movie or television series.</p>"},{"name":"Batman: The Video Game","year":1990,"developer":"Sun Electronics Corp.","url":"d#Batman%20-%20The%20Video%20Game%20%28USA%29.zip","filesize":303866,"score":7.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > North America > Licensed","desc":"<p>The Genesis version of <em>Batman: The Video Game</em> follows closely the plot from the 1989 movie.</p><p>The game consists in six stages, four of side-scrolling platform action and two side-scrolling shooter ones, in the following order: Gotham City Street, Axis Chemical Factory, Flugelheim Museum, Gotham City Street (with the Batmobile and after that on foot), In the Sky over Gotham City (with the Batwing) and the Cathedral, where Batman finally faces the Joker.</p><p>Batman can beat his enemies by punching them, slide kicking (by pressing down and the B button) or throwing his Batarang. By holding down the B button, Batman will block projectile-based attacks. He can also use his double jump (pressing the C button a second time while ascending) to leap greater distances or attack his enemies. To reach higher platforms, Batman can use his Grappling Hook (by pressing up and C to shoot, C again to climb). While piloting the Batmobile or the Batwing, Batman can shoot the Twin Vulcan Cannons (B button) or Twin Homing Missiles (A button).</p><p>Through the levels, Batman will collect Batman emblems (which will give him Batarangs or Twin Homing Missiles, depending on the stage played), Hearts (which give him health) and Batman heads (which give him an extra life).</p>"},{"name":"Battle Frenzy","year":1994,"developer":"Domark Software, Inc.","url":"d#Battle%20Frenzy%20%28U%29.zip","filesize":515318,"score":6.2,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>The year is 2049. An alien armada assaults the Solar System. You are a nameless hero whose mission is to board the enemy's main battle cruiser and to disable all sixteen of its main plasma nodes.  A special Battle Frenzy chip (code name Bloodshot) is implanted into your neural net, making you the one ultimate soldier on whom the entire humanity depends now.</p><p>This is a 3D first-person shooter. You move through maze-like corridors of the alien ship, getting weapons and items, and blasting everything you encounter on your way. There is also a two players mode with split screens.</p>"},{"name":"Battle Golfer Yui","year":1991,"developer":"Santos"},{"name":"Battle Mania Daiginjo","year":1993,"developer":"Vic Tokai Corporation","url":"8#Sega%20-%20Genesis.zip/Battle%20Mania%20Daiginjou%20%28Japan%2C%20Korea%29%20%5BT-En%20by%20M.I.J.E.T.%20v061029%5D.zip","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter","desc":"<p>The Trouble Shooters, Mania Ōtorii and Maria Haneda, are a pair of bounty hunters who will take any job that involves lots of trouble and plenty of shooting. Their last job saw them saving the Crown Prince Denka from the evil military mastermind Don Morguestein, presumably ending his evil plans. However, three days later, Morguestein has returned once more to take revenge upon the Trouble Shooters. Mania and Maria, never wanting to miss out on the action, head off to take care of him once and for all.</p><p><em>Battle Mania Daiginjō</em> is a comical anime-themed scrolling shooter, and the sequel to Trouble Shooter. The player controls the <em>Dirty Pair</em>-esque Mania and Maria simultaneously, with Maria following closely behind Mania, and also able to turn around and fire to the rear. Unlike most shooters, Mania has a health meter which can be replenished via pickups. There are a variety of weapons to choose from at the start of each stage, and during the game, weapons can be powered up. There is also a screen-clearing bomb attack, but it must be allowed to charge back up each time it is used.</p><p>The game includes a standard single-player mode with three difficulty settings. There is also a score attack mode which challenges the player to earn the most points possible in two minutes on a set stage.</p>"},{"name":"Battle Master","year":1991,"developer":"Personal Software Services","url":"d#Battlemaster%20%28USA%29.zip","filesize":384833,"score":5.9,"genres":"Action > Strategy > Top-down > 2D scrolling > Fantasy","desc":"<p>An early squad based combat strategy game set in a medieval style fantasy world.</p><p>The player decides which race they want to play (Human, Orc, Dwarf or Elf) each with their own strengths and weaknesses. It is then a matter of clearing out areas of opponents and finding items to enhance your character's and companions abilities. </p><p>There are many traps to avoid and death is a constant in what most people would find a very tough game. </p><p>The nearest game to compare it to would be Rage Of Mages, though that has more of an RPG/RTT (real-time tactics) focus as opposed to \"squad action\", but it does bear aesthetic similarities and a squad based fantasy fighting theme.</p><p>Gameplay for leader is action-oriented, with a menu that allows to Parley/Travel/Rally Troops, change formations or use items.The leader attacks with Melee and Projectile buttons. Some classes are more reliant on teammates than others. \"Parley\" allows you to buy (but not sell) items, or buy a Safe Pass (skip the area)</p>"},{"name":"Battle Squadron","year":1990,"developer":"Cope-com","url":"d#Battle%20Squadron%20%28USA%2C%20Europe%29%20%281991-01-18%29%20%28Sega%20Channel%29.zip","filesize":260926,"score":7.7,"genres":"Action > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Battle Squadron is a classic arcade style shooter for 1 or 2 players, and a spiritual successor to Hybris. You take a space ship and fly it over a high tech hostile surface, and then into an organic setting. .</p><p>You can control the number of 'credits' you have from 1 to 3. You choose how many lives you get. You also get to choose the max number of enemy bullets and their speed.</p><p>You get powerups along the way that modify your weapons, and also the \"Nova Smart Bomb\".</p>"},{"name":"BattleTech: A Game of Armored Combat","year":1994,"developer":"Malibu Interactive","url":"d#BattleTech%20-%20A%20Game%20of%20Armored%20Combat%20%28USA%29.zip","filesize":824313,"score":7.4,"genres":"Action > Diagonal-down > Isometric > Arcade > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Take control of a Mad Cat 'Mech as you fight your way through several level of mechanized mayhem. Use machine guns, rocket launchers, homing missiles, flame throwers, mines and atomic bombs to defeat the encroaching enemy threat. The different levels have different terrains, such as snow, ice and swamps, which affect the progress of your 'Mech. You can also destroy the smaller enemy 'Mechs by stomping on them.</p>"},{"name":"Battletoads","year":1993,"developer":"Rare Limited","url":"d#Battletoads%20%28World%29.zip","filesize":359418,"score":7.1,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Surfing > Sci-fi / futuristic","desc":"<p>The Dark Queen has attacked and kidnapped (toadnapped?) your best buddy. To make matters worse, she nabbed the best looking girl around! So, what will you do? Cry? Whimper? Hide? Call the Starcops? NO! Cause you're a Battletoad! Battletoads don't cry, hide or call for help! And they certainly don't whimper! They get MAD then they get EVEN! So grab your blaster, hop on the Toadster and go get 'em!</p><p>You will control a battletoad through 13 levels (five of which are missing from the Game Boy port). Some are side-scrolling beat-em-ups, other are vertical drops down a shaft, fighting as you go, others have you riding a rocket or surfboard, shooting or avoiding enemies. At the end of each area, there is a boss. In some areas, about half-way through, you may have a mini-boss.</p>"},{"name":"Battletoads & Double Dragon","year":1994,"developer":"Rare Limited","url":"d#Battletoads-Double%20Dragon%20%28USA%29.zip","filesize":470997,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Platform > Sci-fi / futuristic > Licensed","desc":"<p>Earth is under fire by Colossus, a battleship the size of a city. Using powerful laser cannons, it has destroyed most of Earth's defence forces, while its many troops clean up the rest of the planet. All expect for 5 warriors.</p><p>The Battletoads, who are well aware of evil forces in the galaxy, join forces with Billy and Jimmy Lee from Double Dragon to defend Earth from the deadly ship and its troops. Using a range of special moves you must fight your way through the streets into the heart of the ship and destroy it.</p>"},{"name":"Beast Wrestler","year":1991,"developer":"Riot","url":"d#Beast%20Wrestler%20%28USA%29.zip","filesize":685673,"score":4.9,"genres":"Action > Isometric > Fighting","desc":"<p>A one on one fighting game seen from an isometric perspective. All beasts or dragons have two basic attacks: a punch and a tail attack, as well as a special attack that can only be performed while a certain icon is displayed. During close combat, pressing the A or C button rapidly will result in a throwing or choking attack. There is no visible health bar, but three icons are displayed at the bottom of the screen. Once a dragon is knocked down for a longer moment, one icon turns red. Once all icons are red, the fight is lost. The battle arena is surrounded by an electric fence, that opponents can be thrown into and which can also be used to initiate jump attacks.</p><p>There are two modes of play: Match and Tournament. Match is a single match for one or two players, where several different dragons are available. Tournament sees the player starting out with a week dragon who has to fight increasingly difficult battles and increase his stats (Power, Speed and Stamina).  After every other battle, a shop can be visited that offers different items including food that increases Power, Speed or Stamina, Data Disks that contain information on other Dragons and more. After visiting the shop, Dragons can be trained. The training consists of simply selecting an attribute to be increased. At a few points in the game, it is possible to splice the player's Dragon's genes which that of a defeated Opponent to gain different abilities.</p>"},{"name":"Beggar Prince","year":1996,"developer":"Computer & Entertainment Inc.","url":"d#Beggar%20Prince%20%28World%29%20%28Unl%29.zip","filesize":2071534,"score":"","genres":"Role-playing (RPG) > Top-down > Isometric > Turn-based > Fantasy","desc":"<p><em>Beggar Prince</em> (Xin Qigai Wangzi) is a Chinese-made RPG loosely based on the famous novel by Mark Twain, <em>Prince and the Pauper</em>. A young prince is bored with the life in the palace, and one day manages to go outside the gate, distracting the guards. In the town he meets a young boy who looks very similar to him. The prince offers him to switch their clothes, because he wants to spend the day as an ordinary boy. But when he comes back to the palace, the guards don't recognize him in his beggar's clothes and refuse to let him in. A new life, full of danger and adventures, begins for the young prince...</p><p>The game is conceived in the tradition of Japanese RPGs. You navigate the prince on the world map and around towns, fighting random enemies and descending into dungeons. The battles are turn-based and are viewed from an isometric perspective. You can attack physically or use a variety of magic spells, classified in types. In the beginning of you turn you have a full SP bar; each action reduces it, and when it is depleted, your turn ends. You can for example heal, cast magic, and physically attack different enemies during the same turn. Your enemies utilize the same system and can unleash multiple attacks on you.</p>"},{"name":"Berenstain Bears' Camping Adventure, The","year":1993,"developer":"Realtime Associates Seattle Division","url":"d#Berenstain%20Bears%27%20Camping%20Adventure%2C%20The%20%28USA%29.zip","filesize":584983,"score":5.8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>A bear family - Father Bear, Mother Bear, Sister Bear, and Brother Bear - decide to go camping to the nearby forest. While they sit by the fire, the two cubs decide to explore the area. Visit dangerous places, avoid or destroy the enemies, and collect things that bears like most - such as honey or fresh fish!</p><p>You can play as either Sister or Brother Bear. From the beginning, you can access four different levels. Once you complete them, you'll unlock the final stage. The bears can jump, throw rocks at enemies, or swing a net to hit them. In each area there are a lot of things to gather - mostly food. After a level is completed, you'll be shown how much valuable stuff you have managed to get.</p>"},{"name":"Best of the Best Championship Karate","year":1993,"developer":"Loriciels","url":"d#Best%20of%20the%20Best%20-%20Championship%20Karate%20%28USA%29.zip","filesize":498414,"score":6.8,"genres":"Sports > Side view > Fixed / flip-screen > Fighting > Boxing > Martial arts","desc":"<p><em>Best of the Best Championship Karate</em> is a realistic fighting game.After you choose your fighter for his parameters (strength, stamina and resistance), you can choose from 55 different moves.You can now train your fighter at a gym before the real fights.To master the game, one must alternate training and fights, as training improves stamina, strength and resistance.Be careful, losing a fight reduces those parameters, so you have to be ready before getting in the ring!</p>"},{"name":"Beyond Oasis","year":1994,"developer":"Ancient Co. Ltd.","url":"d#Beyond%20Oasis%20%28USA%29.zip","filesize":1802718,"score":7.7,"genres":"Action > Role-playing (RPG) > Top-down > Anime / Manga > Arcade > Puzzle elements > Fantasy","desc":"<p>Prince Ali has found the magical Golden Armlet, which was used many years ago to defeat an evil wizard who wielded its counterpart, the Silver Armlet. The Prince has now to stop the evil sorcerer and save the island of Oasis. To do so, he will need his wits, skills ,and the powers of the four Wild Spirits.</p><p><em>Beyond Oasis</em> (also known as <em>The Story of Thor</em>) is a fast-paced action game with RPG elements. The Prince's default weapon is the knife, which has unlimited uses. During the course of the game, the hero will also find other weapons, such as bows, swords, and bombs. All these weapons have limited uses and will eventually break.</p><p>The Wild Spirits are elementals the player can call to help to destroy enemies, heal the hero, or solve puzzles. These are the fire spirit, the water spirit, the plant spirit, and the shadow spirit.</p><p>The game has a large assortment of monsters, including massive creatures such as the Red Dragon boss or zombies that split in two, with their torsos continuing to crawl and attack the hero.</p>"},{"name":"Beyond Zero Tolerance","year":1995,"developer":"Technopop, Inc.","url":"d#Beyond%20Zero%20Tolerance%20%28USA%29%20%28Proto%29.zip","filesize":649243,"score":"","genres":"Shoot-'em-Up","desc":"<p>Beyond Zero Tolerance is an unreleased Sega Mega Drive sequel to Zero Tolerance. As with its prequel, it is a first person shooter, one of the few available for the system.</p>"},{"name":"Bible Adventures","year":1995,"developer":"Wisdom Tree, Inc.","url":"d#Bible%20Adventures%20%28USA%29%20%28Unl%29.zip","filesize":112251,"score":4.3,"genres":"Action > Educational > Side view > Arcade > Platform > Religion","desc":"<p><em>Bible Adventures</em> contains three different side scrolling platform games, each with a different bible theme. </p><p>The first game is Noah's Ark. Here the player needs to search forests, caverns, and mountains to find a male and female of each species and bring them back to the ark before the flood begins. The next game is Save Baby Moses, where the player needs to get past numerous soldiers and other obstacles to bring the baby Moses to safety. The last game is David and Goliath. As the shepherd David, the player needs to round up and protect the family's flock of sheep. After all of the sheep are safe, the player will then need to face Goliath.</p><p>The game features scripture taken from the Holy Bible, New International Version to provide clues or information.</p>"},{"name":"Bill Walsh College Football","year":1993,"developer":"High Score Productions","url":"d#Bill%20Walsh%20College%20Football%20%28USA%2C%20Europe%29.zip","filesize":561529,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>The game features 24 college football teams from the 1993 season and 24 of the all-time college teams since 1978. Play modes include exhibition, playoffs and all-time playoffs and the SNES version also has an eleven week season mode with the National Championship as the ultimate goal. </p><p>The playbook consists of 56 offensive plays and 52 defensive plays.On offense, running backs can dive, spin and hurdle. Also, passing is dealt with by having the receivers in their own windowed boxes. When on defense, defenders can dive at the ball carrier, and raise hands to block kicks or intercept passes.</p><p>The game also features four weather conditions (fair, windy, rain and snow), and three different quarter lengths (20, 40 and 60 minutes).</p>"},{"name":"Bill Walsh College Football 95","year":1994,"developer":"High Score Productions","url":"d#Bill%20Walsh%20College%20Football%2095%20%28USA%29.zip","filesize":917703,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>Bill Walsh College Football 95</em> was one of the many football games released by Electronic Arts back in the day. This one was a bit different as it includes a full season team and player stats, weekly rankings and a windowless passing mode. It has 38 powerhouse teams, such as Florida, Florida State, Texas and Notre Dame to name a few. There are many offensive and defensive plays, over eleven different offensive formations with close to eight options a piece, and six different defensive formations.</p><p>The game is endorsed by the late great Bill Walsh, former college and pro coach who had won three Super Bowls.</p>"},{"name":"Bill's Tomato Game","year":1992,"developer":"Psygnosis Limited","url":"d#Bill%27s%20Tomato%20Game%20%28USA%29%20%28Proto%29.zip","filesize":447596,"score":7.8,"genres":"Puzzle > 3rd-person (Other) > Platform","desc":"<p><em>Bill's Tomato Game</em> is a puzzle game similar to the ones in the Incredible Machine series. Completely mouse-controlled, the game is divided in a series of non-scrolling screens, each one being a puzzle. The main objective is to move an anthropomorphic tomato from the left side of the screen to a conveyor belt on the right side. Several objects hinder progress by squishing, perforating, exploding and destroying the tomatoes. In order to solve the levels, you pick various gadgets at the bottom of the screen and place them according to your strategy. These gadgets are:</p><p>● An <strong>electric fan</strong> that can boost and alter your tomato's trajectory;</p><p>● A <strong>trampoline</strong> where the tomato can bounce and reach new heights;</p><p>● A <strong>Jack-In-The-Box</strong> to eject the tomato upwards;</p><p>● A <strong>blocking box</strong> to stop the tomato's movement.</p><p>The player has an infinite number of gadgets, but a time constraint is in place: a timer runs in the bottom left of the screen. The tomato movement can be started and stopped by clicking a semaphore on the bottom of the screen (the screen objects move independently, with their own timing).</p>"},{"name":"Bimini Run","year":1990,"developer":"Microsmiths, Inc.","url":"d#Bimini%20Run%20%28USA%29.zip","filesize":310858,"score":5.8,"genres":"Action > Racing / Driving > Behind view > Naval / watercraft","desc":"<p>You are Kenji Ohara, a motor boat expert. The evil Dr. Orca has kidnapped your sister Kim. Together with your best friend Luka you must find his hideout on a deserted island, and rescue your sister from his clutches. But that won't be easy, as Dr. Orca has sent his henchmen to stop you!</p><p>This is a sailing action game. You navigate your motor boat from a third person perspective view, increasing and decreasing your speed, avoiding yachts and other obstacles, and shooting down the enemies who are trying to stop you.</p>"},{"name":"Bio Hazard Battle","year":1992,"developer":"SEGA Enterprises Ltd.","url":"d#Bio%20Hazard%20Battle%20%28USA%2C%20Europe%29.zip","filesize":582498,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The civilization on the planet Avaron is by far more advanced than that of the Earth. People developed special biogenetical creatures - giant flies, crabs, and other animals. Unfortunately, those monsters rebelled against the Avaronians and threatened to conquer the planet. It is up to you to save the planet Avaron from the invasion!</p><p>\"Bio-Hazard Battle\" is a horizontally scrolling space shooter. You can choose one of the four ships, each one having its own attacks. During the game, you can upgrade your ships' weapons by collecting colored balls floating around. You can store up to three different weapons at the same time, executing attacks in different directions. There are 8 levels of increasing difficulty to complete.</p>"},{"name":"Bio-Ship Paladin","year":1991,"developer":"NMK Co. Ltd."},{"name":"Blades of Vengeance","year":1993,"developer":"Beam Software Pty., Ltd.","url":"d#Blades%20of%20Vengeance%20%28USA%2C%20Europe%29.zip","filesize":580749,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform > RPG elements > Fantasy","desc":"<p><em>Blades of Vengeance</em> is a platform game incorporating light RPG elements and character styling, reminiscent of Gods by The Bitmap Brothers. The Dark Lady has unleashed hordes of monsters whom the protagonist must slay.</p><p>The player can choose from three main characters - the Huntress, Warrior and Sorcerer, all of which have different abilities. Throughout the game the player has the option to improve their powers by collecting armour and weapons (such as a mace and a crossbow) or by using spells. Each of the eight stages ends with a boss.</p>"},{"name":"Blaster Master 2","year":1993,"developer":"Software Creations Ltd.","url":"d#Blaster%20Master%202%20%28USA%29.zip","filesize":410735,"score":6.5,"genres":"Action > 2D scrolling > Arcade > Platform > Tank > Sci-fi / futuristic","desc":"<p>Some time has passe since the boy Jason and his tank Sophia defeated the evil Plutonium Boss and his radioactive underground mutant henchmen. However, not all is well. It appears that one of Plutonium Boss' underlings has survived. He has destroyed Sophia and is now using its parts in order to rise to the surface of the Earth and to conquer it. Jason builds a new Sophia tank and is prepared to defend his planet!</p><p>This is an action platform game. You control Sophia that can roll, jump, and fire two different kinds of attacks at enemies. being a tank, Sophia cannot perform some actions (such as climbing ladders), so often Jason will have to leave the tank and to fight his way through the level alone.</p>"},{"name":"Blockout","year":1991,"developer":"P.Z.Karen Co. Development Group","url":"d#Blockout%20%28World%29.zip","filesize":69981,"score":6.9,"genres":"Action > Puzzle > Top-down > Falling block puzzle > Direct control","desc":"<p><em>Blockout</em> is a Tetris variant with an added twist: it's in 3D. The player can rotate the blocks in 3D in order to fit them into the pit they are being guided into. Advanced users can play this game with odd three-dimensional pieces, or change the size of the pit, for depth of between 6 and 18 piles, and width and length of between 3 and 7.</p>"},{"name":"Blow'em Out!","year":2016,"developer":"Retroscribe"},{"name":"Body Count","year":1994,"developer":"Probe Software Ltd.","url":"d#Body%20Count%20%28U%29.zip","filesize":396890,"score":6.6,"genres":"Action > 1st-person > 2D scrolling > Arcade > Rail shooter > Direct control > Sci-fi / futuristic","desc":"<p><em>Body Count</em> has a simple story: aliens have invaded the Earth, and a lone soldier who is particularly skilled at shooting and sniping is called to save the planet. </p><p>The game is an arcade-style shooter. The player shoots from a first person perspective at enemies that keep appearing on the screen. Once a sufficient amount of enemies has been eliminated, the player is automatically transferred to the next fixed screen. On the way the player can pick special items that allow the use of a powerful all-screen attack a limited number of times.</p>"},{"name":"Bomb on Basic City","year":2016,"developer":"Studio Vetea"},{"name":"Bomb on Basic City: Special Edition","year":2019,"developer":""},{"name":"Bomb on Basic City: Special Edition","year":2018,"developer":"Studio Vetea"},{"name":"Bonanza Bros.","year":1991,"developer":"SEGA Enterprises Ltd.","url":"d#Bonanza%20Bros.%20%28USA%2C%20Europe%2C%20Korea%29%20%28Rev%20B%29.zip","filesize":204249,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>Mobo and Robo Bonanza are enjoying their favorite television show when the picture crackles and a shadowy figure of a mysterious stranger appears on screen. This figure asks them to collect certain items that he has placed inside various buildings to test his security force. If they return the items successfully, Mobo and Robo will be rewarded. The two of them state that they will get the job done in just three minutes. However, little do they know that each building is packed with security guards who will raise the alarm if they are caught red-handed. Fortunately both Mobo and Robo are equipped with bullets that can knock the guards unconscious for a few seconds. An $100 reward will be given out if Mobo and Robo are apprehended.</p><p>As either Mobo or Robo, you must collect all the treasures before leaving the ten buildings and shoot any security guards that get in your way. Remember that you are under a time limit. An in-game map will help you locate the treasures. There is a bonus stage after three buildings, where the object is to collect the gold bars in a limited amount of time without  one of the three spotlights shining on you. If it is possible, hide behind open doors. If you manage to get all the gold bars, 10,000 points is added to your score. There are three of these bonus stages, but each of them varies.</p>"},{"name":"Boogerman: A Pick and Flick Adventure","year":1994,"developer":"Interplay Productions, Inc.","url":"d#Boogerman%20-%20A%20Pick%20and%20Flick%20Adventure%20%28USA%29.zip","filesize":1574163,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Comedy","desc":"<p><em>Boogerman</em> is a jump-and-run game where the protagonist flicks boogers and farts at enemies in order to stand a chance against the evil Boogermeister. The game features about 20 levels of dirt, slime and bad taste in worlds like \"Mucous Mountains\", \"The Pits\" and \"Flatulent Swamps\".</p>"},{"name":"Boxing Legends of the Ring","year":1993,"developer":"Sculptured Software, Inc.","url":"d#Boxing%20Legends%20of%20the%20Ring%20%28USA%29.zip","filesize":574661,"score":6.9,"genres":"Sports > Behind view > Boxing > Licensed","desc":"<p><em>Boxing Legends of the Ring</em> lets you take control of eight middleweight legends of boxing, Roberto Duran, Tommy \"Hitman\" Duran, Jake \"Raging Bull\" La Motta, Rocky Graziano, \"Sugar\" Ray Robinson, \"Sugar\" Ray Leonard, \"Marveleous\" Marvin Hagler and James Toney. You can either compete in an exhibition mode or play in career mode and become the greatest of all time.</p><p>The set of punches in the game is pretty much standard, jab, hook, uppercut, even the ever popular but illegal low blow. Also, for each round and every knockdown you score on an opponent, you get a super punch, a straight shot to the face and is almost unstoppable and connected right could knock out your opponent, but if you miss, you lose your punch for the round.</p><p>There are two main displays during a fight, a damage inflict meter in the form of two boxing gloves, one on each side and as a player connects a punch, the glove will show a black area of where the glove connected and a damage meter that show's the two fighters faces. As the round progresses, the fighter shows more bruises and cuts and starts to flash red when the fighter is getting tired and is the best time to land your super punch.</p><p>Another feature is from round to round, your view will alternate, from looking over your shoulder to the next round and looking at yourself over your opponents shoulder.</p>"},{"name":"Bram Stoker's Dracula","year":1993,"developer":"Traveller's Tales (UK) Ltd.","url":"d#Bram%20Stoker%27s%20Dracula%20%28USA%29.zip","filesize":611345,"score":5.9,"genres":"Action > Side view > 2D scrolling > Horror > Licensed","desc":"<p><em>Bram Stoker's Dracula</em> is the title given to a number of games based on the 1992 film of the same name. Gameplay for each game varies greatly from platform to platform, but they all retain a similar plot based on the movie. The 16-bit console versions are side-scrolling hack-and-slash games.</p><p>The player controls a young lawyer named Jonathan Harker. Harker must free himself from Dracula's capture, follow him to London, and end his reign of terror.</p>"},{"name":"Brave Battle Saga","year":1996,"developer":"Chuanpu Technologies"},{"name":"Breach","year":1987,"developer":"Omnitrend Software, Inc.","url":"d#Breach%20%28USA%29%20%28Proto%29.zip","filesize":188910,"score":6.6,"genres":"Strategy > Top-down > Sci-fi / futuristic","desc":"<p><em>Breach</em> is a turn-based tactical squad combat game. It introduces team-oriented missions, RPG-style squad leader development and a scenario builder.</p><p>In the ten missions supplied with the retail version (and potentially infinitely more created with the included scenario builder), a squad of usually five space marines under the command of a squad leader embarks on sci-fi missions that involve hostage rescue, data retrieval or simply elimination of opponents. Squad members advance and act in turn on basis of a movement point system. </p><p>The multi-level maps consist of outside terrain and structures with several stories, connected by lifts, filled with enemies and objects. Squad members can find and use weapons such as grenades, rockets or detonation packs and tools such as Medikits, scanners or shields.</p><p>In an unique twist, the squad leader advances from mission to mission (while the rest of the team is always new), improving his basic stats with each successfully completed assignment, based on his performance. Only experienced leaders may attempt STAR-rated scenarios. If the squad leader gets killed, he is lost forever: the game deletes the corresponding leader file.</p>"},{"name":"Brett Hull Hockey 95","year":1994,"developer":"Radical Entertainment Inc.","url":"d#Brett%20Hull%20Hockey%2095%20%28USA%29.zip","filesize":1174052,"score":6.2,"genres":"Sports > Diagonal-down > Isometric > Hockey > Licensed","desc":"<p>Motion-captured graphics made their first appearance in a hockey game with this Brett Hull license. Al Michaels provides a full running commentary, while a mode allowing the player to improve their game with Brett's help is also included. The game is viewed isometrically, with all the realistic fouls and gameplay situations included. Full pre-match analysis and forecasting is provided, as are post match statistics.</p>"},{"name":"Brian Lara Cricket","year":1994,"developer":"Audiogenic Software","url":"d#Brian%20Lara%20Cricket%20%28U%29.zip","filesize":461268,"score":6.9,"genres":"Action > Sports > 1st-person > Behind view > Diagonal-down > Cricket > Licensed","desc":"<p>The classic game of cricket, updated for 1998 and endorsed by Brian Lara.  A more detailed description can be found in the advertising blurbs.</p>"},{"name":"Brian Lara Cricket '96","year":1996,"developer":"Audiogenic Software Ltd.","url":"d#Brian%20Lara%20Cricket%2096%20%28U%29.zip","filesize":544638,"score":7.4,"genres":"Sports > Diagonal-down > Cricket > Licensed","desc":"<p><em>Brian Lara Cricket '96</em> is an updated version of Brian Lara Cricket on the SEGA Genesis. It is basically the same game, with updated sprites and roster.</p><p>The game features international matches, English county matches (with 18 teams) and 6 classic historical matches (from 1960 to 1994). Also available are the World Cup competition (with 12 national teams) and a Test Series. The game also features a team editor, battery back-up save and one to four multiplayer mode.</p>"},{"name":"Brutal: Paws of Fury","year":1994,"developer":"GameTek, Inc.","url":"d#Brutal%20-%20Paws%20of%20Fury%20%28USA%29.zip","filesize":1113499,"score":6.6,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p>The Dalai Llama has organised a martial arts contest for animals of all species to prove their skills, and you are competing in it. There are a wide variety of furry creatures to take on, and finally the Dalai Llama himself. </p><p><em>Brutal: Paws of Fury</em> is a one-on-one fighting game across a variety of levels, with mostly outdoor terrain. You can choose of the many characters. Throughout the game, your character travels across Dalai Llama's island, fighting a series of duels before getting to the final showdown. </p><p>During a duel, you can punch and kick your opponent, try to use special attacks on him/her, or use a \"taunt\" that restores a bit of your health. Each battle lasts a number of rounds (how many - that is determined in the options menu); once one combatant has won that number of times during the battle, he wins. If the computer-controlled player won, it's game over (but you can still use a continue to start the fight anew); if you won, you move on to the next opponent. Once you have defeated them, you can watch an ending animation, different depending on the character you have chosen. </p><p>Instead of beginning a whole new game, you can fight a single duel, choosing the opponent and terrain. You can choose to fight either a computer-controlled opponent or another human player. </p><p>The visuals lean towards cutesiness, which makes a change from the gore of Mortal Kombat and the metal of Rise of the Robots.</p><p>In the console versions, you start the game without special moves, but get a new one after each successful best-of-three bout. The computer versions drop this feature, though.</p>"},{"name":"Bubba 'N' Stix","year":1994,"developer":"Core Design Ltd.","url":"d#Bubba%20%27N%27%20Stix%20%28USA%29.zip","filesize":547749,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>Bubba is a happy-go-lucky animal delivery guy for the local Zoo here on Earth. One day, while going about his daily routine, Bubba is abducted by an alien that plans on delivering him along with several other aliens into his zoo. On the way back to his home planet, the alien spacecraft loses control and crashes and it gives the opportunity for Bubba, the other aliens, and Stix (a sentient twig-like alien) to escape. Bubba and Stix become friends and start on their journey home, They're now on an alien planet where things are a little bit different than they are on Earth. Take control of Bubba and Stix, who has various puzzle-solving tools (including a weapon), as they try to find a way back home. You'll have to solve mind-boggling puzzles and fight all kinds of wacky aliens. If you're planning to return to Earth, you'll have to have fast reflexes and be able to think fast and sometimes sideways.</p><p>The game consists of five levels that vary in terms of graphics, music, and type of puzzles that need to be solved. On his way, Bubba will find little blobs and other aliens that after each level are summed up and according to how many of them have been collected, the player is awarded additional seconds in the bonus level.</p>"},{"name":"Bubble and Squeak","year":1994,"developer":"Fox Williams","url":"d#Bubble%20and%20Squeak%20%28USA%29.zip","filesize":303509,"score":7.5,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Shooter","desc":"<p><em>Bubble and Squeak</em> starts off similarly to many other platform games. Controlling a bald child, you move through a scrolling array of ledges, avoiding contact with nasties who release coins when shot. There are hidden areas to find as well.</p><p>Halfway through the first of the 30 levels, you meet Squeak and the full nature of the game starts. Squeak is a blue alien, who must also be guided through the levels. As he can't jump as high as you, he must sometimes be instructed to wait while you flick a switch or otherwise solve the puzzle of how to guide him through. If you stand on top of Squeak you can be launched into an extra-high jump.</p><p>Bubble Mode is the equivalent of Super Mario mode - it allows you to jump higher, run faster and shoot more lethal weaponry (bubbles in this case). It is activated by placing a coin into a Bubblegum machine and then jumping on Squeak's back.</p><p>In between the main platform levels, there are side-view shoot 'em up sections taking place underwater – completing these earns bonuses.</p>"},{"name":"Bubsy II","year":1994,"developer":"Accolade, Inc.","url":"d#Bubsy%20II%20%28USA%2C%20Europe%29.zip","filesize":1069362,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p>Bubsy is back! After defeating the evil Woolies in the first game, Bubsy, the brave bob-cat, has to participate in an even more dangerous adventure: to explore a mysterious hyperdimensional mansion, inside of which there are portals that lead to different area in different locations and times. </p><p>Similarly to  Sonic games, Bubsy moves very fast and can also jump very high. Bubsy kills the enemies by jumping on their heads. The levels are large and can be accessed right from the beginning of the game (except the ultimate level), starting in either west or east wing. There are five types of regular levels: Egyptian pyramid, sci-fi space-like environment, a world filled with musical instruments and notes, a \"green\" level with trees and hills, and a side-scrolling group of levels where Bubsy has to navigate an airplane.</p>"},{"name":"Bubsy in: Claws Encounters of the Furred Kind","year":1993,"developer":"Accolade, Inc.","url":"d#Bubsy%20in%20-%20Claws%20Encounters%20of%20the%20Furred%20Kind%20%28USA%2C%20Europe%29.zip","filesize":951735,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p>In this 15-level action game the player is Bubsy the bobcat, who has to defeat the Woolies the aliens, which steal balls of yarn. There are five different locations such as jungle, wild west, etc., where the player has to jump and land on their enemies to kill them. Each time to finish the level the player has to defeat the boss, who sits in an alien ship.</p>"},{"name":"Buck Rogers: Countdown to Doomsday","year":1991,"developer":"Strategic Simulations, Inc.","url":"d#Buck%20Rogers%20-%20Countdown%20to%20Doomsday%20%28USA%2C%20Europe%29.zip","filesize":883495,"score":7.4,"genres":"Role-playing (RPG) > Diagonal-down > Isometric > Turn-based > Sci-fi / futuristic > Licensed","desc":"<p>This version of <em>Buck Rogers: Countdown to Doomsday</em> retains most of the story and the core gameplay of the computer version of the same name, but differs in several gameplay- and interface-related aspects.</p><p>The main differences involve reduction of some of the skills and equipment types present in the computer version. Limitations have been imposed on character creation as well: there are only four character classes (Warrior, Rocketjock, Medic, and Rogue) and three races (Human, Desert Runner, and Tinker) to choose from, as opposed to five character classes and six races in the computer release.</p><p>You play as a party of new recruits to the organisation NEO which is fighting the RAM faction, a group of tyrants who previously ruled the solar system. The game begins with you preventing an invasion of earth headquarters by alien mutants. After this you transit to an orbital command base where you take on several different missions.</p><p>In the computer version, first-person view and pseudo-3D graphics were used for navigation, while combat was viewed from isometric perspective. In this release, isometric view is used both for navigation and combat, the player-controlled party visible from third-person perspective.</p>"},{"name":"Budokan: The Martial Spirit","year":1990,"developer":"Electronic Arts, Inc.","url":"d#Budokan%20-%20The%20Martial%20Spirit%20%28USA%29%20%28Unl%29.zip","filesize":359637,"score":6.6,"genres":"Simulation > Sports > Side view > Martial arts","desc":"<p><em>Budokan</em> is a martial arts game covering Karate (unarmed combat), Kendo (using a wooden sword), Nunchaku (using piercing chain weapons) and Bo (using a staff). The player has a realistic range of moves and must use them wisely, as Ki (life-force) is drained for every move made, whether successful or not, and both this and your stamina level must be kept high.</p><p>You can practice your skills alone, or spar against the instructors or your friends. Finally, when you feel you are ready, you can travel to the martial arts world championship tournament at Budokan.</p>"},{"name":"Bugs Bunny in Double Trouble","year":1996,"developer":"Probe Entertainment Ltd.","url":"d#Bugs%20Bunny%20in%20Double%20Trouble%20%28USA%29.zip","filesize":1161100,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The game is based on the <em>Looney Tunes</em> cartoon movies. Bugs Bunny falls asleep, and in his dream sees Yosemite Sam developing a robot called Gossamer. The robot disobeys the commands of his master and goes out of control. Now Bugs Bunny has to enter the TV world and to correct things, bringing order back to the lives of Looney Tunes inhabitants.</p><p>The game consists of several platform-based stages, each one having a different goal (guiding another character to a safe place, defeating a big monster, etc.). Bugs Bunny can jump and run quickly, as well as collect items and throw them at enemies.</p>"},{"name":"Bulls vs. Blazers and the NBA Playoffs","year":1993,"developer":"Electronic Arts, Inc.","url":"d#Bulls%20versus%20Blazers%20and%20the%20NBA%20Playoffs%20%28USA%2C%20Europe%29.zip","filesize":480948,"score":6.5,"genres":"Sports > Side view > Basketball > Licensed","desc":"<p>Another update in Electronic Arts' basketball series, this time featuring the teams and players from the 1992 NBA playoffs plus the East and West All-Stars.</p><p>Features unchanged from the previous games include detailed stats, instant replay, substitutions, free throw T-meter and signature moves, some of which are new.</p><p>Exclusive to the Genesis version is the ability to create your own All-Star teams and to call defensive plays.</p>"},{"name":"Bulls vs. Lakers and the NBA Playoffs","year":1992,"developer":"Electronic Arts, Inc.","url":"d#Bulls%20vs%20Lakers%20and%20the%20NBA%20Playoffs%20%28USA%2C%20Europe%29.zip","filesize":464101,"score":6.6,"genres":"Sports > Side view > Basketball > Licensed","desc":"<p>The sequel to EA Sports' basketball title Lakers versus Celtics and the NBA Playoffs. The core gameplay of the original is supplemented with a variety of new features, including:<em> All 16 1992 NBA Playoff teams (up from 8 in Lakers vs. Celtics) plus the East and West All-Star Teams, plus courts with official team logos/colors. The rosters are based on the 1990/1991 season.</em> Player game stats updated while the game is in progress.<em> An Instant Replay mode.</em> New \"signature moves\" for star players.* Improved defense and passing controls and a foul shooting meter.</p><p>Multiplayer options include cooperative and head-to-head modes.</p>"},{"name":"Burning Force","year":1990,"developer":"Namco Limited","url":"d#Burning%20Force%20%28USA%29.zip","filesize":260932,"score":6.6,"genres":"Action > Behind view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>In this game, you play the role of Hiromo, a blue-haired girl who roams the skies on her trusty red airbike. One day, during a routine patrol, she discovered aliens have attacked the Earth. Of course, it is up to our heroine to go on a solo mission, flying in her airbike around the Earth, fighting regular enemies and bosses, and ultimately saving the planet.</p><p>This is a pseudo-3D scrolling shooter similar to  Space Harrier. The game is viewed from behind-the-character perspective. You can use regular fire attacks or limited super-powerful shots that do big damage.</p>"}]