[{"name":"Cadash","year":1992,"developer":"Taito Corporation","url":"d#Cadash%20%28USA%2C%20Korea%29.zip","filesize":338080,"score":7.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > RPG elements > Fantasy","desc":"<p>Trouble is in the kingdom of Dilsarl: the young, beautiful princess Salasa was abducted by the evil arch-mage Balrog. The king seeks help from the four best warriors of the country. The task is clear, but not so simple: find Balrog, destroy his evil minions and other monsters roaming the land, and rescue the princess.</p><p><em>Cadash</em> is a platform action role-playing game. The player chooses one of the four character classes in the beginning of the game: fighter, priestess, mage, or ninja (the Genesis version has only two characters: fighter and mage). The protagonist fights his or her way through dungeons, attacking physically or casting spells (as priestess or mage). Like in regular platform games, there are places where the player character is required to jump, duck, or climb. The protagonist gains experience for defeating monsters, and their level rises in a true RPG fashion.</p>"},{"name":"Caesars Palace","year":1992,"developer":"Realtime Associates, Inc.","url":"d#Caesars%20Palace%20%28USA%29.zip","filesize":286888,"score":5.7,"genres":"Gambling > 1st-person > Cards / tiles > Licensed","desc":"<p>This game allows you to play in the <em>Caesars Palace</em> casino. You wander around the casino and play video poker, roulette, blackjack, the Big Six money wheel, or 3 types of slot machines. You bet and win chips and then exchange them for money whenever you like. The interaction is done via a cursor, everything is viewed from first-person perspective. You come to the casino in a taxi - will you be able to leave it in your own limousine?</p>"},{"name":"Cal Ripken Jr. Baseball","year":1992,"developer":"Beam Software Pty., Ltd.","url":"d#Cal%20Ripken%20Jr.%20Baseball%20%28USA%29.zip","filesize":433407,"score":5.8,"genres":"Sports > Top-down > Baseball > Licensed","desc":"<p>This baseball game is your basic SNES baseball game, play as one of 16 teams, along with two special teams, the All-Stars and the MVP's. Cal Ripken, the featured player is the only real player to appear in this game.</p>"},{"name":"Caliber.50","year":1991,"developer":"SETA Corporation","url":"d#Caliber.50%20%28USA%29.zip","filesize":271762,"score":6,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > War","desc":"<p>You play as Captain Addis, a former officer in the US army during the Vietnam war. Now, twenty years after the war, you are sent on a mission to follow the Ho Chi Minh trail and to rescue American airmen that were left behind.</p><p>In this action game, you navigate your character in top-down view and continuously fire at enemies, turning him in different directions, since he doesn't always face the direction he is moving in. You can for example walk backwards, firing at the enemies who pursue you. Enemies include not only various types of gunmen, armed with rifles, flamethrowers, or grenade launchers, but also tanks and helicopters. You can blast open crates to find ammo and supplies. Defeated enemies also leave you items.</p>"},{"name":"California Games","year":1991,"developer":"Epyx, Inc.","url":"d#California%20Games%20%28USA%2C%20Europe%29.zip","filesize":334160,"score":7.3,"genres":"Sports > Side view > 2D scrolling > Fixed / flip-screen > Tricks / stunts > Olympiad / mixed sports > Skateboarding > Surfing > Bike / Bicycling","desc":"<p><em>California Games</em> was the original \"Extreme Games\" – what today's generation might call \"X-Games in the sun\". Players can select sponsors (absent in some versions) and compete in events such as skateboarding, footbag, surfing, roller skating, flying disc (frisbee) and BMX. The surfing event is ranked by judges, which give a score to help the players improve their routine.</p><p>The Atari versions (2600 and Lynx) of the game omit the flying disc and roller skating events, while the Genesis version omits only the flying disc event.</p>"},{"name":"Cannon Fodder","year":1994,"developer":"Sensible Software","url":"8#Sega%20-%20Genesis.zip/Cannon%20Fodder%20%28Europe%29.zip","filesize":1,"score":7.8,"genres":"Action > Strategy > Diagonal-down > 2D scrolling > Isometric > Real-time > Real-time strategy > Multiple units/characters control > Point and select","desc":"<p>Guide a team of up to six soldiers through 72 levels of combat in this top-down action/strategy hybrid, best thought of as Lemmings crossed with Commando crossed with Dune 2. The characters are controlled indirectly using the mouse or joypad, as you activate each soldier or group of them by highlighting them, clicking one button to move them to a particular spot and the another for them to fire guns at an enemy. You can also pick up grenades or rockets, fired by pressing both buttons at once, which can be used to destroy groups of enemies, buildings, or some vehicles.</p><p>Each mission has a specific objective, and some feature vehicles such as tanks that are used to make things easier. Your troops can cross water but can't shoot within it, so finding and controlling bridges is often crucial. You can use the arrangement of trees to find hiding places to shoot from and should watch out for CPU soldiers doing the same.</p>"},{"name":"Canon: Legends of the New Gods","year":1996,"developer":"Chuanpu Technologies"},{"name":"Captain America and the Avengers","year":1992,"developer":"Data East Corporation","url":"d#Captain%20America%20and%20the%20Avengers%20%28USA%29.zip","filesize":650267,"score":5.8,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Shooter > Licensed","desc":"<p><em>Captain America and the Avengers</em> is a one- to four-player (simultaneous) side-scrolling beat 'em up in which four Marvel Comics licensed heroes (Captain America, Iron Man, Hawkeye and Vision) take on the evil Red Skull, who, by assembling a team of super-villains, seeks to conquer the world.</p><p>The game consists of five stages, primarily focusing on side-scrolling brawler gameplay, but some of the levels also feature side-scrolling shooting stages, where the heroes battle menaces in the air (Stage 2), under the sea (Stage 3), and in space (Stage 5). Boss villains in the game consist of Living Laser and Klaw, Whirlwind, Grim Reaper, Wizard, Mandarin, Juggernaut, Ultron, Controller, Crossbones, and the Red Skull. In addition to the four playable Avengers, Quicksilver makes brief appearances to drop energy replenishments, and the Wasp can add protection and firepower in the shooting areas.</p>"},{"name":"Captain Planet and the Planeteers","year":1992,"developer":"NovaLogic, Inc."},{"name":"Cascade","year":2015,"developer":"Epyx, Inc.","url":"d#Cascade%20%28World%29%20%28Unl%29.zip","filesize":256825,"score":"","genres":"Puzzle > Real-time","desc":"<p>The popular dice-puzzle game Cascade originated on the planet Cascadia, and it is on this planet where the most intense tournaments take place. Creatures from all over the galaxy travel to Cascadia in hopes of joining the ranks of the greats. Thankfully, Cascade is a friendly game in which most players support one another, and share tips. So, while not all challengers receive a trophy, they often make new friends in pursuit of one.</p><p>Cascade is a puzzle game. Players maneuver dice around a grid, trying to form numerical combinations that may then be \"blasted\" to progress against the current opponent. Clearing combinations that include starred dice, and / or clearing multiple sets of combinations, speeds up the progression. Opponents are defeated when the player's energy plug rises to the top of the screen. A competitive two-player mode is also offered.</p>"},{"name":"Castle of Illusion starring Mickey Mouse","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Castle%20of%20Illusion%20Starring%20Mickey%20Mouse%20%28USA%2C%20Europe%29.zip","filesize":398396,"score":8.3,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > Licensed","desc":"<p>This is the first Mickey Mouse game for Sega consoles. In this game the famous Disney character must face the dangers of weird fantasy lands such as an enchanted forest and a toy world. Mickey must rescue his girlfriend Minnie who's been kidnapped by the evil witch Mizrabel.</p><p>The game play follows the traditional 2D hop 'n' bop platform style.</p>"},{"name":"Castlevania: Bloodlines","year":1994,"developer":"Konami Co., Ltd.","url":"d#Castlevania%20-%20Bloodlines%20%28USA%29.zip","filesize":707078,"score":8.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Europe > Fantasy > Horror > Regional differences","desc":"<p>In the year 1917, evil had threatened to rise up again in Transylvania. A young lady named Elizabeth Bartley, who was tried as a witch and killed centuries before, was planning to resurrect the Prince of Darkness, Count Dracula, once again.</p><p>The latest of the Belmont lineage, John Morris, and his friend Eric Lecarde, must now travel across Europe to the Palace of Versailles in France, where Bartley is planning the resurrection. And in their way stands Dracula's strongest followers yet...</p>"},{"name":"Centurion: Defender of Rome","year":1991,"developer":"Bits of Magic","url":"d#Centurion%20-%20Defender%20of%20Rome%20%28USA%2C%20Europe%29.zip","filesize":500421,"score":7.2,"genres":"Strategy > Diagonal-down > Side view > Top-down > Isometric > Real-time > Turn-based > Direct control > Multiple units/characters control > Point and select > Africa > Classical antiquity > Egypt (Ancient) > Europe > Historical events > Middle East > War","desc":"<p>Starting as a young Roman legionnaire in 275BC, your job is to conquer the known world through force or diplomacy, fighting on land and sea. </p><p><em>Centurion: Defender of Rome</em> is a turn-based strategy game. You start with one province, Rome, and one legion. To complete the game, you have to conquer all the provinces on the map. </p><p>One part of the game is micro-managing your provinces. You set up tax rates and make people happy by organizing games. In Rome, you can organize a chariot race, a gladiatorial combat or even a simulated naval battle; this starts an action mini-game where you control the chariot rider, gladiator or ship. </p><p>Another part of the game is military conquest. You can raise legions or strengthen them in any province you control (let's just hope there are enough men in the province, or your legion will be incomplete and weaker). There are three types of legions, each of them has a different strength. You can also move a legion to a neighbouring province. </p><p>When you enter a province you don't yet control, you can speak with the ruler there. With luck, you can convince him to give you the province for free; but this isn't very likely, and you'll often have to fight. </p><p>When your legion attacks a province, or defends one of your provinces from an invader, the game switches to an isometric view of the battlefield. You can give orders to your legion (assuming they are within the range of their commander's voice) and watch as they duke it out with the enemy forces. Eventually, one of the sides will be completely wiped out or panic and retreat. </p><p>Finally, you can buy warships and have naval battles with the enemy fleet. This is represented as an action mini-game, depicting a duel of the flagships; however, the outcome of the battle actually depends on the strength of your fleet.</p>"},{"name":"Chakan","year":1992,"developer":"Extended Play","url":"d#Chakan%20%28USA%2C%20Europe%29.zip","filesize":671414,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Chakan</em> is a somewhat unorthodox platform game with its mix of relentless difficulty, spell crafting and dark themes. In the game you're controlling Chakan whose been cursed to not die. In order for him to rest in peace, he'll have to go through many levels of hack and slash platforming. The ultimate goal is defeat all the primary realms and achieve inner-peace. </p><p>Through your travels you have to defeat bosses in each of the four realms of air, water, fire and earth to proceed and acquire weapons that'll help you on progress in other realms. Chakan can acquire the mallet, scythe, grappling hook and axe along with his standard swords and depending on what weapons is equipped, different abilities are unlocked. Some weapons allows for double jumping for instance, while others can tear down walls.</p><p>Furthermore, the player is able to collect potions that can be used in alchemy. By pressing \"Start\" at any time, one can create various spells that enhance the character like higher jumping, putting fire on your blades or even invisibility. Some levels actually requires you to use specific spells to progress, forcing you to think outside the borders of a normal platform game. On top of all this, there's an imposed time limit on each level.</p>"},{"name":"Champions World Class Soccer","year":1993,"developer":"Park Place Productions","url":"d#Champions%20World%20Class%20Soccer%20%28World%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":512669,"score":6.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p>This soccer game offers 32 national teams to play, with none of the players' names shown. Shown from a slightly tilted 3rd-person side perspective, players can do an exhibition match, full tournament or go against a human player in the 2-player exhibition mode. The different teams are ranked by speed, offense and defence, and different team formations can be selected.</p><p>The gameplay is very basic: players can pass, shoot, tackle with a third button used to switch between players. In the options menu, fouls and offside can be disabled, the amount of time per half can be determined and there is a radar and mini-map to track the other players. The European edition is endorsed by Ryan Giggs and the game uses a password system to continue tournaments.</p>"},{"name":"Championship Bowling","year":1993,"developer":"Soft Machine","url":"d#Championship%20Bowling%20%28USA%29.zip","filesize":181012,"score":"","genres":"Sports > 1st-person > Bowling","desc":"<p><em>Championship Bowling</em> is a standard bowling game for one or two players, and the only one available for the Genesis. The player picks one of four different bowlers and the ball they want to use, then heads out to the lanes. The player controls the throw, spin, and power by stopping bars at the right time.</p><p>The game includes three different play modes: standard bowling; spare mode, where a handful of pins are placed with the goal being to pick up a spare; and bonus mode, where specific pins are worth different amounts of points. Each mode can be played against either the computer or a friend, and there are three different lane types available. There is also a practice mode for each of the game types.</p><p>The Japanese version, <em>Boogie Woogie Bowling</em>, is largely the same but features different, more anime-style characters to play as (including a robot for no explained reason), as well as minor tweaks to the timing for throws.</p>"},{"name":"Championship Pool","year":1993,"developer":"Bitmasters, Inc.","url":"d#Championship%20Pool%20%28USA%29.zip","filesize":219653,"score":6.3,"genres":"Sports > Top-down > Pool / snooker","desc":"<p><em>Championship Pool</em> is a pool game where players can 8-ball or 9-ball pool tournament that starts off with the BCA Regional Championship where the player must defeat 32 opponents in a first to four games match. If the player loses against any of the 32 opponents, they are then eliminated from the tournament. The winner of that then goes onto the World Championship.</p><p>All of the gameplay is done from a top down view of the table. The player moves an icon to indicate location they want to hit the ball too. To aid in the aiming, a ghost of the cue ball and the first ball that is hit is repetitively played out to show the path of the hit ball. With the all the shots there is a very small margin of error, but this is only notable when a long shot is played or a shot from a sharp angle and the ghost balls will randomly play out all the possible occurrences. The player can also change the power and spin of the played shot with the ghost balls will updating to show the outcome of those changes. </p><p>There are 4 different game modes that can be chosen, each with a different set of pool games. The different game modes and there games are:</p><p><strong>1. Tournament:</strong> The player must defeat 32 different players in a first to four knockout tournament in 8-ball or 9-ball pool before going on to the World Championship. During the tournament the opponent is never actually is seen playing there shots. Instead, when it is the opponents turn, it cuts to an image of the player with a caption and then returns the control to the player with some balls removed and moved. This way the opponent can finish the game within 4 turns regardless of if they where snookered or not.</p><p><strong>2. Challenge</strong>: It has many different pool games that are played, all with one player without an opponent. The games are:<em> </em><em>14.1 Challenge</em>* – After the break the ball is placed anywhere at the top of the table behind the line. At that point, the player can hit any ball but once the fails to hit a ball in a hole the game is over. If there is only one ball left on the table the rest of the balls are re-racked and play continues. At the end score is given based on the number of balls that where hit in the holes. The score are tallied up over 5 games to get the total score.</p><ul><li><p><strong>Eight Ball</strong> - After the break the ball is placed anywhere at the top of the table behind the line. The player must hit all the chosen set of balls (stripes or solids) and the 8-ball in one turn. The score is based on how many balls where hit in.</p></li><li><p><strong>Nine Ball</strong> - After the break the ball is placed anywhere at the top of the table behind the line. The player must hit the 9 ball in one turn. The score is based on how many balls where hit in.</p></li><li><p><strong>Equal Offence</strong> – Same as 14.1 Challenge but there is only one game played.</p></li><li><p><strong>Three Pool</strong> – Only have 3 balls on the table. Score is based on how many shots it takes to get all three balls in with lower been better.</p></li><li><p><strong>Speed Pool</strong> – Objective is to hit all the balls in as quickly as possible as a timer is timing how long the game takes. Any ball can be hit at any time and the player can miss the shot and not be penalised (other than taking longer).</p></li></ul><p><strong>3. Party:</strong>  It has many different multiplayer pool games that are played with ether just 2 or 2 to 8 human players. The games are:<em> </em><em>Eight Ball (2 Players)</em>*  – A standard eight ball game with the players taking turns to play.</p><ul><li><p><strong>Nine Ball (2-8 Players)</strong>  – A standard nine ball game with up to 8 players taking turns. First player to get the 9-ball in wins.</p></li><li><p><strong>14.1 Continuous (2 Players)</strong>  – Players can hit any ball in for a point. If a shot is missed then other player plays. If there is only one ball on the table the pocketed balls are re-racked. Play continues until one of the players reaches the score chosen at the start of the game.</p></li><li><p><strong>Ten Ball (2-8 Players)</strong>  – Same as Nine Ball except with 10 balls.</p></li><li><p><strong>Rotation (2-8 Players)</strong>  – Only the lowest ball can be hit and the score for getting a ball in is the value of the ball (e.g. 8-ball is 8 points). Player with the highest score at the end of the game wins.</p></li><li><p><strong>Straight Pool (2 Players)</strong>  – Same as 14.1 Continuous but the player with the highest score after one game wins.</p></li><li><p><strong>Equal Offence (2-8 Players)</strong>  – Same as Equal Offence in challenge mode but players can take turns to beat each others score.</p></li><li><p><strong>Fifteen Ball (2-8 Players)</strong>  – Same as Rotation except that any ball can be hit not just the lowest.</p></li><li><p><strong>One Pocket (2 Players)</strong>  – The two players are given one of the two pockets at the end of the table. The player must hit all the balls in there nominated pocket with the one with the most balls wins.</p></li><li><p><strong>Three Ball (2-8 Players)</strong>  – Same as Three Ball in challenge mode but players can take turns to beat each other’s score.</p></li><li><p><strong>Speed Ball (2-8 Players)</strong>  – Same as Speed Ball in challenge mode but players can take turns to beat each other’s score.</p></li></ul><p><strong>4. Freestyle:</strong> Lets the player practice with no opponent, no penalties, the ability to move any ball to the desired location (or remove by throwing the ball in the pocket), and the ability to place potted balls back on the table.</p>"},{"name":"Championship Pro-Am","year":1992,"developer":"Rare Limited","url":"d#Championship%20Pro-Am%20%28USA%29.zip","filesize":101920,"score":7.4,"genres":"Action > Racing / Driving > Diagonal-down > 2D scrolling > Isometric > Arcade > Automobile > Track racing > Vehicular combat","desc":"<p>Guide your radio controlled car to victory in this racing game. You have to beat your 3 opponents on 32 tracks while avoiding obstacles like water and oil puddles and collecting bonus items like better engines and tires.You can also collect a variety of weapons to blast your opponents out of the way.</p><p>The Genesis version is basically the same game as the NES version with a few minor changes such as having 5 opponents instead of 3, spelling out CHAMPION instead of NINTENDO, and having enhanced graphics.</p>"},{"name":"Championship Soccer '94","year":1993,"developer":"Sensible Software"},{"name":"Championship Soccer '94","year":1994,"developer":"Sensible Software"},{"name":"Chase H.Q. II","year":1992,"developer":"ITL Co., Ltd.","url":"d#Chase%20H.Q.%20II%20%28USA%29.zip","filesize":228794,"score":6.7,"genres":"Action > Racing / Driving > Behind view > Automobile > Truck > Crime","desc":"<p>Similar to Chase H.Q. in some ways: same gameplay, same number of stages, and same objective. If you haven't heard of this game before, you basically drive on a freeway trying to catch up with five criminals who have committed felonies, but time is against you. If you catch up with the criminal's vehicle, you can ram into it to do some damage. If you do enough damage, the car malfunctions and you arrest the suspect. You can also use up to three turbo boosters that comes equipped with the car if you are far behind the suspect.</p><p>However, what makes this game different is the fact that you can choose one of three vehicles to drive: a sports car, 4-wheel drive, and a semi truck, with each one of them having their advantages and disadvantages. For example, the truck may be slow in speed, but can do a massive amount of damage. The sports car, on the other hand, can perform at higher speeds, but has a poor attack efficiency. As well as passing cars, your task is made difficult by obstacles, such as barricades, on the freeway. Finally, some vehicles in the game will have someone shooting at you. And watch out for the helicopter that attempts to drop bombs on you.</p>"},{"name":"Chavez II (Mexico)","year":1993,"developer":"Sculptured Software, Inc.","url":"h#ROMs%2FChavez%20II%20%28Mexico%29.zip","filesize":1,"score":"","genres":"Sports > Behind view > Boxing > Licensed","desc":"<p><em>Chavez II</em> is the sequel to Chavez, where once again the player can choose from nine fictional boxers including the game's namesake, Julio Cesar Chavez. They can choose either to partake in an <em>Exhibition</em> where they can choose any fighter or in <em>Career</em> and fight their way to the top of the rankings to take on Chavez to become World Champion.</p><p>The gameplay is a behind-the-back perspective with the player utilizing a variety of punches ranging from regular jabs to \"Super Punches\" that require will drain the fighter's stamina, but will be more devastating to opponents. Players can create their own boxer as well and the game's language is Spanish-only including in-game commentary.</p>"},{"name":"Cheese Cat-Astrophe starring Speedy Gonzales","year":1995,"developer":"Cryo Interactive Entertainment"},{"name":"Chelnov: Atomic Runner","year":1992,"developer":"Data East Corporation","url":"d#Atomic%20Runner%20%28USA%29.zip","filesize":525766,"score":7.6,"genres":"Action > Side view > Arcade > Platform > Sci-fi / futuristic","desc":"<p>One windy day, there was an explosion at a nuclear power station, causing heavy doses of radiation to be poured over many people. One of these people was a coal miner named Chelnov. When he survived the deadly accident, he was possessed with abnormal powers. Having realized this, he decided to act in the cause of justice. He is determined to escape the Eastern Bloc country he called home and run and jump across the world to finish in the US.</p><p>What distinguishes <em>Chelnov: Atomic Runner</em> from other platform games is its use of forced scrolling. This occurs when the screen moves continuously from left to right, forcing players to negotiate the game's many obstacles and enemies without controlling Chelnov's speed of progress. Enemies attack from left, right, above, and below, and Chelnov can switch the direction he's facing to attack enemies that are behind him. Some enemies in the game carry different types of weapons and power-ups, and when they are shot at, the power-ups drop to the ground and can be picked up.</p><p>While the level design and enemy placement is identical in the later released Genesis (and subsequently Wii) version, the graphics have been significantly changed: now each level is based on a ancient human civilization and the enemies (including bosses) are replaced. Also all references to atomic explosions have been removed from the background story. Now Chernov is the son of a scientist. The evil Deathtarians, who claim to be the original population of the Earth and want to control this planet, murdered his father and abducted his sister. Chelnov takes a special suit made by his father, which give him super-human powers and make him an \"Atomic Runner\". The Deathtarians caught and imprisoned him, but he broke out of the prison and is now on the run...</p>"},{"name":"Chess","year":1998,"developer":"BS Comp. Ltd."},{"name":"Chessmaster, The","year":1997,"developer":"The Software Toolworks, Inc."},{"name":"Chester Cheetah: Too Cool to Fool","year":1992,"developer":"System Vision","url":"d#Chester%20Cheetah%20-%20Too%20Cool%20to%20Fool%20%28USA%29.zip","filesize":626958,"score":6.3,"genres":"Action > Arcade > Platform > Licensed","desc":"<p>The game's hero is the Frito-Lay mascot, Chester the Cheetah. Chester leaves peacefully in a zoo with other animals, until the big brute Mean Eugene steals his beloved motor scooter. What's worse, without knowing how to handle the scooter, Mean Eugene broke it to pieces and threw them away. Now it's up to Cheetah to travel across the zoo and to retrieve parts of his scooter.</p><p>The game is composed of platform levels. On each level there is a hidden scooter part, which Chester has to recover before being able to exit the level. On the way there are various creatures that will try to eliminate Chester and obstacles to watch for. Chester can dash and stun enemies by jumping on their heads.</p>"},{"name":"Chester Cheetah: Wild Wild Quest","year":1993,"developer":"Kaneko USA, Ltd.","url":"d#Chester%20Cheetah%20-%20Wild%20Wild%20Quest%20%28USA%29.zip","filesize":429020,"score":"","genres":"Action > Arcade > Platform > Licensed","desc":"<p><em>Chester Cheetah: Wild Wild Quest</em> is the sequel to Chester Cheetah: Too Cool to Fool in the series based on the Frito-Lay mascot: Chester Cheetah.</p><p>Chester the cheetah lives in the Four Corners Zoo together with other animals. One day he decides to leave the zoo and to search for the legendary Hip City. Riding his trusty motor scooter, with a map in the paws, Chester encountered the nasty brute Mean Eugene. True to his habit of stealing and destroying things, Mean Eugene took the map from Chester, tore it to pieces, and scattered them all across United States of America. Chester must now visit various locations in the country to retrieve the map pieces and to find a way to Hip City.</p><p>The player may explore the game world in a non-linear fashion. At any time, there are three levels available and the player may tackle them in any order. Each solved level leads to additional two. On each level, the player must find the missing map piece, proceed to the exit, and defeat the level boss. Chester can dash and kill enemies by jumping on their heads. He dies from one hit, unless he has a pack of the cheetahs snack at his disposal. In this case, he'll recover full health.</p>"},{"name":"Chi Chi's Pro Challenge Golf","year":1993,"developer":"Coconuts Japan Entertainment Co., Ltd.","url":"d#Chi%20Chi%27s%20Pro%20Challenge%20Golf%20%28USA%29.zip","filesize":238041,"score":"","genres":"Sports > Behind view > Turn-based > Direct control > Golf > Japan (Modern/Futuristic) > North America > Licensed","desc":"<p><em>Chi Chi's Pro Challenge Golf</em> is a golf game featuring Juan \"Chi Chi\" Rodriguez. It has options that allow for match, stroke, and tournament play. The player can also choose to play against different levels of opponents, whose skills are measured on that opponent's putting, approach, and control abilities. </p><p>The game lets the player choose whether to play on a US or Japanese golf course. Once out on the course, the player must choose which golf club to use, where to make contact with the ball, and where to aim in the direction they want the ball to go. Once that's decided the player fills a swing meter and hits the ball trying to get the ball into the hole.</p>"},{"name":"Chibi Maruko-chan: Waku Waku Shopping","year":1992,"developer":"Namco Limited"},{"name":"Chiki Chiki Boys","year":1992,"developer":"Capcom Co., Ltd.","url":"d#Chiki%20Chiki%20Boys%20%28USA%2C%20Europe%29.zip","filesize":505073,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > RPG elements > Fantasy > Regional differences","desc":"<p>This platform-based action game is set in the land of Alurea. The idyllic life of the Alurean people was shattered when the King is killed by a dragon, and a range of nasties inhabit the lands. Fortunately his twin sons have come to the rescue, and you must take control of one or the other to put the world right.</p><p>The boys have differing skills - one is more skilled in sword-fighting (which you are always armed with), the other in magic (available in limited amounts on each level). You collect coins as the game goes on, and spend these in the shop on extra magic, extra lives and enhanced swords.</p><p>There are 3 levels on offer - Earth, The Heavens and The Sea, and these can be tackled in any order. The first is straight platform action, the second involves jumping across clouds, and the third sees your characters swim. After those are completed, you must venture into the Monster Castle and finally slay the demon clown Riepotmahn.</p>"},{"name":"Chip's Challenge","year":2021,"developer":"Epyx, Inc."},{"name":"Chōkyūkai Miracle Nine","year":1995,"developer":"SEGA Enterprises Ltd."},{"name":"Chuck Rock","year":1991,"developer":"Core Design Ltd.","url":"d#Chuck%20Rock%20%28USA%29.zip","filesize":362017,"score":7.5,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Chuck Rock is your typical average caveman. He likes to spend his Sunday afternoons watching football and drinking beer. Unfortunately, his peaceful existence is interrupted one day when his wife, Ophelia Rock, is kidnapped by the village weirdo, Gary Gritter. So, Chuck is rather upset about this whole situation and you have to help him make things right.</p><p>The game is a side-scrolling platformer. Chuck fights a variety of dinosaurs using his belly-buster attack and a jump kick. Occasionally he has to pick up and throw rocks to defeat enemies and allow him to jump to greater heights.</p>"},{"name":"Chuck Rock II: Son of Chuck","year":1993,"developer":"Core Design Ltd.","url":"d#Chuck%20Rock%20II%20-%20Son%20of%20Chuck%20%28USA%29.zip","filesize":556435,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>The story in this Chuck Rock game takes up a little while after the end of the first game.  As you may remember, Chuck Rock had to rescue his girl, Ophelia from the bad dude Gary Gritter.  Well, he was successful in his efforts, and now Chuck and Ophelia are married.  Eventually, they have a son, named Junior. Chuck works in a factory, where he develops great skill at carving automobiles out of stone. A rival manufacturer becomes jealous of Chuck's abilities and kidnaps him.  Now it is up to Junior to rescue his dad!</p><p>The gameplay in this sequel is similar to the first game, but with some minor differences since you are playing as Junior, rather than Chuck. This is a side-scrolling platform game with occasional rock-moving puzzles thrown in. Unlike Chuck, Junior carries a club that gives his attacks further reach.</p>"},{"name":"Classic Collection","year":1996,"developer":""},{"name":"Clay Fighter","year":1994,"developer":"Visual Concepts Entertainment, Inc.","url":"d#ClayFighter%20%28USA%29.zip","filesize":1300198,"score":6.6,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p><em>Clay Fighter</em> is a 2D fighting game released in which the characters, as the name suggests, are made completely out of clay. This allows for interesting moves and stylized graphics. The zany roster includes: Bad Mr. Frosty, a snowman; Taffy, a piece of stretchable candy; Blob, a character who can morph into different shapes; Blue Suede Goo, an Elvis knock-off; Ickybod Clay, a pumpkin-headed ghost; Helga, an opera singer; and Bonker, the crazed clown. Each character also has their own level and individual taunts.</p>"},{"name":"Cliffhanger","year":1993,"developer":"Malibu Interactive","url":"d#Cliffhanger%20%28USA%29.zip","filesize":549147,"score":5.3,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Licensed","desc":"<p>Standard side-scrolling beat'em up based off of the Stallone film of the same name. Sly must fight thugs and the elements as he tracks down suitcases of stolen cash dropped around the peaks of the Rockies. Combat follows the Final Fight standard, broken up by some mountain climbing and running (or 3-D snowboarding on the Sega CD) from avalanches. </p><p>Enemies are the standard brawler crooks, occasionally carrying guns and knives the player can pick up. The game tends to follow a pattern of having you deal with a natural hazard (scaling a cliff, leaping over gaps), then locking the screen down for a fighting segment, nature again, fighting again, etc. The available fighting moves is limited, compared to other games of this type, and the ability to hit an enemy character is noticeably less accurate.</p><p>The plot is identical to the film, with levels based off of, or inspired by, scenes in the movie. Animated cutscenes move the story along on the cartridge systems, while brief clips from the film play between levels on the Sega CD.</p>"},{"name":"Clue","year":1992,"developer":"Sculptured Software, Inc.","url":"d#Clue%20%28USA%29.zip","filesize":335649,"score":6.4,"genres":"Puzzle > Strategy > Top-down > Board game > Detective / mystery > Licensed","desc":"<p>Based on the board game Clue. A murder has taken place in a mansion. You play as one of the 6 suspects in this case. You have to find out who committed the crime, and with what weapon and where in the mansion it took place in. There are 5 levels of difficulty which basically give you less information the harder up the level.</p>"},{"name":"Coach K College Basketball","year":1995,"developer":"Electronic Arts Canada","url":"d#Coach%20K%20College%20Basketball%20%28USA%29.zip","filesize":1116433,"score":7.7,"genres":"Sports > Isometric > Basketball > Licensed","desc":"<p>Mike Krzyzewski, the lifetime coach of the Duke University basketball team, endorses this NCAA-licensed spin-off from the NBA Live engine. The game includes 32 NCAA teams (including K's own Duke Blue Devils and the 1994 NCAA Champions Arkansas Razorbacks), as well as eight classic teams, but the license does not include player names.</p><p>There are three game modes: Season, Tournament (with three save slots for both) and Exhibition, and options follow the standard set from the NBA Live series. Gameplay also remains unchanged, with the typical three basic actions (fast running/steal, pass and shoot/block for A, B and C buttons) and the ability to call moves on the fly by pressing one of the buttons along Start (three or six moves can be set, depending on the joypad used).</p>"},{"name":"Codemasters 2 in 1: Fantastic Dizzy + Cosmic Spacehead","year":1994,"developer":"The Codemasters Software Company Limited"},{"name":"Coffee Crisis","year":2017,"developer":"Mega Cat Studios"},{"name":"College Football USA 96","year":1995,"developer":"High Score Productions","url":"d#College%20Football%20USA%2096%20%28USA%29.zip","filesize":1085940,"score":7.1,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>College Football USA 96</em> features gridiron action of the college ranks with 108 Division 1-A teams complete with 45 man rosters for each team. It features the standard game modes including <em>Exhibition</em> and <em>Season</em> along with the ability to play in the four major bowl games (Rose, Orange, Fiesta &amp; Sugar) in an effort to win the National Championship.</p><p>The gameplay is virtually identical to many of its competitors by passing, running, special teams, etc. It also featured a 5 receiver window at the top of the screen when the player switches to passing mode to view all available receivers at one time. Player and team stats were up to date at the time and featured classic football plays such as the Hail Mary and the Wishbone.</p>"},{"name":"College Football USA 97","year":1996,"developer":"Ceris Software","url":"d#College%20Football%20USA%2097%20%28USA%29.zip","filesize":1246492,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>College Football USA 97</em> is a college football game featuring 111 Division 1-A teams. The game has exhibition, season, tournament, and tiebreaker modes. It also contains a create a player feature. Basically it is an updated version of College Football USA 96 with similar gameplay.</p>"},{"name":"College Football's National Championship","year":1994,"developer":"BlueSky Software, Inc.","url":"d#College%20Football%27s%20National%20Championship%20%28USA%29.zip","filesize":1097756,"score":7.3,"genres":"Sports > Top-down > Football (American)","desc":"<p>Released about the same time as Bill Walsh College Football 95, this American football game was unlicensed and did not feature any big names to it. It was considered a clone of NFL Football '94 Starring Joe Montana, just an updated version but now with college teams. It features 32 college powerhouses from four major divisions, letting you play exhibition games or letting you compete in a tournament to achieve an #1 ranking, as opposed to competing in a season to obtain it. It also has the option to play it on Team Player letting you control four players at once.</p>"},{"name":"College Football's National Championship II","year":1995,"developer":"BlueSky Software, Inc.","url":"d#College%20Football%27s%20National%20Championship%20II%20%28USA%29.zip","filesize":778976,"score":7,"genres":"Sports > Top-down > Football (American) > Licensed","desc":"<p>This is the follow-up to College Football's National Championship with the exact same game engine as before which is essentially a clone of NFL Football starring Joe Montana.</p><p>It still has the standard set of modes such as <em>Exhibition</em>, <em>Tournament</em> and <em>Season</em> and updated rosters for the top schools of the time, reflecting the 1994 season. There are 32 teams with five added ones to this version (Wisconsin, North Carolina, Colorado State, Oregon and Washington State), however to add these schools five others were taken out that were in the previous game (San Diego State, Pitt, LSU, Arkansas and Houston). It also keeps track of 19 different stats along with authentic offensive and defensive plays attributed to each team.</p><p>It also features a battery backup to keep track of stats and save games along with the ability to let four different players compete utilizing multi-tap. There are also new sound effects added to this version with the announcer from the previous version removed from this one.</p>"},{"name":"College Slam","year":1996,"developer":"Torus Games Pty. Ltd.","url":"d#College%20Slam%20%28USA%29.zip","filesize":2240483,"score":6.7,"genres":"Sports > Diagonal-down > 2D scrolling > Arcade > Basketball > Licensed","desc":"<p>Part of the NBA Jam series of basketball games, College Slam allows you to choose from over 40 real college teams and take part in head-to-head games, tournament games, and season-long play. The gameplay is arcade-style two-on-two fast action featuring backboard shattering wild dunks, power-ups and other crazy moves. The game also features fight songs from all the available teams.</p>"},{"name":"Columns","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Columns%20%28USA%2C%20Europe%29.zip","filesize":83523,"score":7.2,"genres":"Action > Puzzle > Fixed / flip-screen > Falling block puzzle > Direct control > Fantasy","desc":"<p><em>Columns</em> is loosely derived from Tetris, as it involves arranging falling blocks in such a way as to clear them. However, in columns they are groups of 3 same-size but varying color blocks, which must be arranged into sequences of 3 or more, either horizontally, vertically or diagonally. Sequences of 4 or 5 count for double or triple points, and diagonal sequences score the most. The real trick is to set up 'combos' - where one line causes other blocks to drop so as to create other lines.</p><p>As well as the normal game mode, there is also a 'flash' mode, in which the aim is simply to remove a particular block from the base of the pre-formed pile of bricks. The difficulty of this can be determined by increasing the number of complete rows which are already in place.</p>"},{"name":"Columns III: Revenge of Columns","year":1993,"developer":"SEGA Enterprises Ltd.","url":"d#Columns%20III%20%28USA%29.zip","filesize":245678,"score":7,"genres":"Puzzle > Real-time > Falling block puzzle","desc":"<p>Third game in the Columns series. In this fast-paced puzzle mayhem, your goal is to arrange three or more jewels of the same colour horizontally, vertically or diagonally to remove them from the playing screen. While the jewels are falling, you can change the order of their colours. In the Arcade, Versus, and Time Trial modes, you can test your skills against an opponent, a clock, or a specific task such as removing a particular jewel. New features include a rising bar that can be used to annoy opponents and magical items that have strategic value to alter the outcome mid-game.</p>"},{"name":"Combat Aces","year":1992,"developer":"Baton Technologies","url":"d#Combat%20Aces%20%28USA%29%20%28Proto%29%20%28Unl%29.zip","filesize":62845,"score":"","genres":"Shoot-'em-Up","desc":"<p>Combat Aces is an unreleased Sega Mega Drive isometric shoot-'em-up game compatible with the equally-unreleased Teleplay System.</p>"},{"name":"Combat Cars","year":1994,"developer":"Accolade, Inc.","url":"d#Combat%20Cars%20%28USA%2C%20Europe%29.zip","filesize":516686,"score":6.6,"genres":"Action > Racing / Driving > Top-down","desc":"<p><em>Combat Cars</em> is a racing game in which the player not only competes with other cars, trying to outrun them, but also uses all kinds of weapons and gadgets to damage their opponents. In the beginning of the game, the player can choose one of the eight available characters. Each character has his/her own strengths and weaknesses (speed, car handling, etc.), as well as unique weapons. The weapons include a simple gun, glue spots they can leave to trap other cars, homing missile, and others. There are 24 different tracks available in the game. The player must complete them in a linear fashion, and once they run out of time, the game is over.</p>"},{"name":"Comix Zone","year":1995,"developer":"Sega Technical Institute","url":"d#Comix%20Zone%20%28USA%29.zip","filesize":1618744,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler","desc":"<p>Sketch Turner was a starving comic book artist, living with his pet rat Roadkill... that is until a lightning storm mysteriously brought his cartoon villain, Mortus, to life and imprisoned Sketch within the pages of his own comic book. Now trapped in the world that he himself created, but someone else is now drawing, Sketch must battle through the pages of his own comic book, and past his own creations, to a final battle with Mortus. Perhaps one of his own creations, General Alissa Cyan might be able to help...</p><p><em>Comix Zone</em> is a side-scrolling fighting game with a difference, you're inside of a comic book and you yourself know it. Smash enemies into the sides of frames, rip through the paper to unleash a super move and otherwise wreck havoc throughout the limitations of the graphic novel. Sketch himself can jump, attack and use various items that he finds along the comic book, including his rat friend, Roadkill. Button combinations can be used to unleash powerful techniques.</p><p>The game progresses linearly through each page of the comic book, however secret paths and alternate routes through the story can be discovered. At the end of each level, Sketch receives a super hero rating for how well he's progressing.</p>"},{"name":"Congo: The Game","year":1995,"developer":"Visual Concepts Entertainment, Inc.","url":"d#Congo%20-%20The%20Game%20%28USA%29%20%28Proto%29.zip","filesize":516842,"score":2.35,"genres":"Action","desc":"<p>Congo: The Game is a less complete version of Congo: Secret of Zinj, an equally unreleased game for the SNES based on the movie.</p>"},{"name":"Contra Hard Corps","year":1994,"developer":"Konami Co., Ltd.","url":"d#Contra%20-%20Hard%20Corps%20%28USA%2C%20Korea%29.zip","filesize":1361673,"score":8.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Sci-fi / futuristic > Regional differences","desc":"<p>When there's a hideous alien race, mad terrorist army, or just some general madman scumball to be eliminated, there's only one team to do the job: the Hard Corps.</p><p>Now some madman military commander has stolen an alien cell; a remainder of the Alien Wars. He plans on using the cell to resurrect and clone Red Falcon, the most dangerous alien ever to exist! If he wins, the world as we know it is history!</p><p>The Hard Corps must stop his plans from being set into motion and destroy that alien cell before the Earth is destroyed!</p>"},{"name":"Cool Spot","year":1993,"developer":"The Global Team","url":"d#Cool%20Spot%20%28USA%29.zip","filesize":633039,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p><em>Cool Spot</em> is a colorful 2D platform game featuring the 7-Up mascot as the main protagonist. The game objective is fairly simple and straightforward. The player character has to collect enough number of cool points throughout each level in order to find and rescue his captured uncool Spot buddies and complete the game.</p>"},{"name":"Corporation","year":1992,"developer":"Dementia","url":"h#ROMs%2FCorporation%20%28Europe%29.zip","filesize":1,"score":5.9,"genres":"Action > 1st-person > Puzzle elements > Shooter > Cyberpunk / dark sci-fi","desc":"<p>A first person shooter that requires you to think things through rather than just attack anything that moves. This game preceded Wolfenstein 3D by a number of years, and while the walls were not ray cast, but solid fill polygons, it was still one of the earliest simulations to tackle a human viewpoint with complete, 360 degree freedom of movement.</p>"},{"name":"Cosmic Spacehead","year":1993,"developer":"Codemasters","url":"d#Cosmic%20Spacehead%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":669844,"score":6.5,"genres":"Action > Adventure > Side view > 2D scrolling > Arcade > Platform > Puzzle elements","desc":"<p>Linus had crash landed on a distant planet called Earth, and made his way back home again. Trouble is, no one believes his tale of the planet he discovered! Your job is to help Linus make his way back to planet Earth so he can take some pictures to convince his friends. Gameplay consists of two parts, an adventure and arcade action. In adventure mode you can explore lands, find objects, and talk to people. Sentences can be constructed by using the pointer to select actions or objects on the screen (This is similar to the interface LucasArts used in games such as Maniac Mansion). To reach many new locations involves the action mode, where you will need to cross treacherous landscapes and evade dangerous creatures. This portion resembles a side scrolling platform game. Once you've cleared an action sequence, you will not need to do so again if you decide to revisit a location. Whenever you wish you can receive a password allowing you to continue the game later from the same point.</p>"},{"name":"Crack Down","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Crack%20Down%20%28USA%29.zip","filesize":226230,"score":6.8,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter","desc":"<p>At the beginning of the 21st century, a mad scientist by the name of Mr. K has created an army of artificial soldiers. He conquered the industrial city of Atlantis, and is now preparing to take over the world. The United Nations decided to retaliate by sending two of their top class Special Forces officers, Ben and Andy, infiltrate the city and destroy the enemy base using a newly developed time bomb--Sigma.</p><p><em>Crack Down</em> is a time-limited action game. The two heroes, Ben and Andy, have to get through the levels as quickly as possible placing bombs on X marks scattered around the levels. Although the levels are heavily defended, the player has an array of weaponry including a cannon, machine gun, and superbombs. </p><p>The game may be played as either a one or two-player game.</p>"},{"name":"Crayon Shin-chan: Arashi o Yobu Enji","year":1994,"developer":""},{"name":"CrazyBus","year":2004,"developer":"Tom Scripts Ltda."},{"name":"CrossFire","year":1991,"developer":"A.I Co., Ltd.","url":"d#CrossFire%20%28USA%29.zip","filesize":222240,"score":6.4,"genres":"Action > Top-down > 2D scrolling > Shooter > Helicopter > War > Licensed","desc":"<p>Fly a helicopter into hostile territory to rescue hostages and make some money on the side. The places the player can choose to fly into are Guatemara (Engrish for Guatemala), Cuba, and Panama. Missions are broken down into three different parts. The first part involves flying a helicopter taking out various enemies. The second part has the player flying a super helicopter into the enemies base. The third part has the player taking control of a soldier on the ground taking out enemies in the base. While on the ground, the player can call in help from the copter only for a limited number of times. Also while on the ground the player can rescue hostages.</p>"},{"name":"Crue Ball","year":1992,"developer":"NuFX, Inc.","url":"d#Crue%20Ball%20-%20Heavy%20Metal%20Pinball%20%28USA%2C%20Europe%29.zip","filesize":216263,"score":6.7,"genres":"Action > Pinball > Licensed","desc":"<p>Crüe Ball is a pinball game based on the glam-rock supergroup Motley Crüe.  The game features Genesis-style renditions of the songs \"Live Wire\", \"Dr. Feelgood\", and \"Home Sweet Home.\" </p><p>The main pinball table is three screens high. The goal of the game is to knock out certain targets in the two lower screens in order to gain access to the top screen.  Once you get the ball into the top screen, you can hit a ramp shot to advance to the next level.  All told, there are nine levels, each with varying goals to complete. </p><p>Four players can play in a round, with each player taking turns. There's also a bonus game where you play pong versus freaky exploding skeleton things.</p>"},{"name":"Crusader of Centy","year":1994,"developer":"NexTech Corporation","url":"d#Crusader%20of%20Centy%20%28USA%29.zip","filesize":1312604,"score":8.1,"genres":"Action > Top-down > Fantasy","desc":"<p>Before the time of plants and animals, Earth was completely dark and inhabited by beings we now call 'monsters'. When some voice said 'Let There Be Light' , many monsters died because they could not live in this new light world. Not all died however; some of them hid in caves, and grew stronger. Now, they want to return to the world.</p><p>Corona is a boy from Soleil Town who just turned fourteen and has to undergo a series of trials to become a true swordsman. However, soon he finds himself in a strange predicament: unable to speak to humans any more, he learns to communicate with animals, and realizes that not everything in the world is as simple as it looks.</p><p><em>Crusader of Centy</em> is an overhead action game with light role-playing and puzzle-solving elements, similar to Zelda games. The game's stand-out feature are animal companions. various animals are met by Corona during the course of the game, and can be \"equipped\" to grant him new abilities: for example, a penguin will add an ice attack property to his sword, etc.</p>"},{"name":"Crystal's Pony Tale","year":1994,"developer":"Artech Digital Entertainment, Ltd.","url":"d#Crystal%27s%20Pony%20Tale%20%28USA%29.zip","filesize":473854,"score":"","genres":"Action > Adventure > Platform > Fantasy","desc":"<p>In this game, you play the role of the Crystal Pony. One day, her pony friends decide to make a party in a nearby castle. But an evil witch has captured and imprisoned all the ponies. The only pony who is still free is Crystal Pony. She must now carefully explore the surroundings, find gems that are scattered in various places, and use them in places where the ponies are captured to release them.</p><p>You navigate your pony through various locations, collecting horseshoes on your way and \"paying\" them at level gates to pass to another location. You can explore the locations in any order you wish, traveling directly between them or using teleportation pictures. The game has more adventure than action elements. Crystal Pony cannot die in the game; if an enemy hits her, she merely loses one of her horseshoes. The only battles are against the witch, occurring every time you use a gem at the correct place. The pony would automatically jump over obstacles, but you can also make her jump with a corresponding button. You can get extra items by interacting with various objects and characters, pressing the action button.</p>"},{"name":"Curse","year":1989,"developer":"Micronet Co. Ltd.","url":"d#Curse%20%28USA%29%20%28Proto%29%20%281990-06-26%29%20%28Sega%20Channel%29.zip","filesize":188310,"score":5.5,"genres":"Action > Side view > Shooter > Sci-fi / futuristic","desc":"<p><em>Curse</em> is a basic horizontal-scrolling shooter, one of the first released for the Megadrive, where one pilots a space fighter through deadly environments such as a mutated jungle, a ruined city, and an underground volcano. The game features five stages, and at several points in each stage, a larger boss enemy appears which must be destroyed to continue.</p><p>There a variety of weapon power-ups to collect, each with three power levels. There is a spread shot that can cover nearly the entire screen, a bomb that explodes into shrapnel when it connects, and a twisting wide shot that can pass through environmental obstacles. There are also homing missiles, smart bombs, speed-ups, and an option that can be placed on any side of the ship. The ship also has a shield which can absorb damage from smaller bullets, meaning it can take a few hits before exploding unless it's hit by an enemy ship, part of the landscape or some special enemy weapons that just ignore the shield.</p>"},{"name":"Cursed Knight, The","year":2022,"developer":"GGS Studio Creation"},{"name":"Cutie Suzuki no Ringside Angel","year":1990,"developer":"Copya System Ltd."},{"name":"Cutthroat Island","year":1996,"developer":"Software Creations Ltd.","url":"d#CutThroat%20Island%20%28USA%2C%20Europe%29.zip","filesize":885314,"score":5.1,"genres":"Action > Side view > 2D scrolling > Fighting > Licensed","desc":"<p>In this game you play the role of a pirate lady called Morgan who was given a piece of a map by her father before he died. In the game you set out to find more pieces of the map so that you can find the hidden treasure buried on Cutthroat Island. The gameplay involves you scrolling along the screen and sword fighting pirates and other scoundrels one on one with various different attacks. As you progress you unlock more combos. This game is based on the film by the same name.</p>"},{"name":"Cyber-Cop","year":1992,"developer":"Core Design Ltd.","url":"d#Cyber-Cop%20%28USA%29.zip","filesize":294491,"score":3.21,"genres":"Shoot-'em-Up","desc":"<p>The Universal Cybernetics Corporation's got a huge PR problem. Seems some morbid folks are calling the new domestic robot they've designed \"The Ripper\" due to a nasty little technical defect - this robot likes to kill. Or is it an accident that the UCC happened to create a genetically engineered killing machine who also happens to have an insatiable appetite for human beings? Translated from the number one European hit CORPORATION, you're the Cyber Cop who's been chosen by the government to crack the complex security system of the UCC. Your mission: Confiscate the mutant robot they've designed as the ultimate weapon. Just remember Cyber Cop - you're completely on your own. Of course, you'll arm yourself with a whole arsenal of firepower - everything from hologram projectors to infra-red image intensifiers. If all goes well, you'll be a national hero. But if the droid guards, sleeping gas and autolock doors get the best of you - even your own mom will deny that she ever knew you!</p>"},{"name":"Cyberball","year":1990,"developer":"Atari Games Corporation","url":"d#Cyberball%20%28World%29.zip","filesize":296468,"score":6,"genres":"Sports > Football (American) > Sci-fi / futuristic","desc":"<p>After American Football players started cheating by using bionic parts, the game was forced to change its rules. By 2022, the game was played not by humans, but two teams of seven robots. To spice things up, the usual pig skin ball was replaced with a 350 pound bomb.</p><p><em>Cyberball</em> brings this fast and furious action to life. Gameplay is essentially the same as the real sport, although the 'downs' are replaced by the bomb's heat gradually increasing towards 'critical'. After this it will explode and possession will be swapped. This is prevented when you cross the 50-yard line, lose possession or score a touchdown, in which cases it resets to 'cool'. Field goals and punts are not featured - the only kick is the initial kick-off you receive.</p><p>Control passes from the quarterback (thrower) to the intended catcher as soon as a pass is released. The two-player game is co-operative - on offense one player passes and the other receives.</p>"},{"name":"Cyborg Justice","year":1993,"developer":"Novotrade Software Kft.","url":"d#Cyborg%20Justice%20%28USA%2C%20Europe%29.zip","filesize":249325,"score":6.2,"genres":"Action > Side view > Beat 'em up / brawler > Fighting > Sci-fi / futuristic","desc":"<p>You are a member of the Galatic Unity Agency on routine patrol in deep space when your patrol ship is damaged after accidently passing through a meteor storm and starts to lose control, smashing into a nearby planet and blacking out.  The next thing you remember you are rummaging through scrap metal and welding together steel to make parts for weapons. You have become a cyborg slave in a munitions factory for the Cydrek Federation, a twisted machine with a human brain, unable to comprehend your situation, clouded by cybernetic programming until one day your human side finally starts to break through.  You remember everything and realize that the Cydrek Federation is building an army to take on the G.U.A. and you must stop it. You must take on the entire Federation using your new cybernetic body and stop them from taking over the universe.</p><p>You can build up to 216 different combinations of cyborg body parts to rip, tear and burn your opponents in submission, even using the destroyed parts of your downed foes and putting them onto your body. You can also play in Arcade mode in which you take on wave after wave after wave of opponents until your cyborg is finally destroyed or even play co-op with a buddy.  The game features up to five levels from the plants surface, the Cydrek Command Center even a futuristic jungle.</p>"}]