[{"name":"Daffy Duck in Hollywood","year":1995,"developer":"Psionic Systems","url":"d#Daffy%20Duck%20in%20Hollywood%20%28U%29.zip","filesize":961374,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Yosemite Sam calls on Detective Daffy Duck to attempt to retrieve his precious golden movie awards. Mad Professor Duckbrain has stolen the awards and wants a million bucks to give them back.  Daffy Duck grabs his trusty bubble gun and must explore film sets and retrieve the awards. The themed movie worlds range from horror to western and jungle to sci-fi. Along the way Daffy can power up his bubble gun to fire different types of bubbles. Enemies are defeated by capturing them in bubbles and allowing them to float away. You can also attain the help of a fairy duckmother, who will fly around with you and protect you. The scenes are rigged with dynamite that must be deactivated before it goes BOOM!</p>"},{"name":"Dahna: Goddess' Birth (J)","year":1991,"developer":"Information Global Service","url":"8#Sega%20-%20Genesis.zip/Dahna%20-%20Goddess%27%20Birth%20%28Japan%29%20%5BT-En%20by%20Cccmar%20v1.0%5D%20%5Bn%5D.zip","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > RPG elements > Fantasy","desc":"<p><em>Dahna: Megami Tanjō</em> (Dahna: Birth of a Goddess) is a beat'em up with some RPG elements. The player controls Dahna as she scrolls horizontally or vertically through the levels. Dahna fights her enemies using a sword, and she can jump in two heights, duck and crawl. Dahna has also a magic meter, which has several colored levels. Different levels of her magic will produce different magical effects (as in Golden Axe). Her magic can be replenished by gathering magical orbs, dropped by enemy mages when killed. They will also drop health orbs as well.</p><p>She starts the game \"riding\" a giant, and in other portions of the game, she'll also ride other creatures, such as a horse and a griffin. When riding a creature, Dahna can't use her magic powers.</p><p>As she kills enemies and gather orbs, Dahna gains experience points, which grant her level upgrades. Leveling up affects only her health, as she gains more health points.</p>"},{"name":"Daimakaimura: Ghouls'n Ghosts","year":1989,"developer":"Capcom Co., Ltd.","url":"d#Daimakaimura%20~%20Ghouls%27n%20Ghosts%20%28World%29.zip","filesize":442407,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Direct control > Fantasy > Medieval > Horror","desc":"<p>Three years have passed since Arthur defeated the Demon King Astaroth and rescued his beloved Princess Prin-Prin (see Ghosts 'N Goblins). A new villain, the Great Demon King Lucifer (Loki in some versions) has become the new leader of Ghoul Realm. While returning from a journey, Arthur sees the Princess' castle and her village under attack by Lucifer's forces. While rushing towards her beloved knight, the Princess is struck by one of Lucifer's laser beams.</p><p>Now, Arthur must venture back to the Lucifer's palace and destroy the demon in order to rescue the Princess' soul and bring her back to life! And it won't matter whether he fights in his shining armor or in his underwear alone...the bravest Knight in the land isn't going to be stopped by some monsters! Although the game starts with graveyard and marsh territory familiar from the first game, later levels are set in a tower, a mass of skeletons, and a castle.</p><p>Players progress from left to right (from bottom to top in level 3), and have to hack down the aforementioned monsters with a sword. The journey includes ledges, ladders, lava pits and slippery slopes. Different weapons can be collected, by finding suits of armor inside chests. Each of the five stages has its own setting and a final boss.</p><p>In comparison to the first installment, gameplay was tweaked and some additions were made. Arthur can now fire vertically and is able to collect weaponry from fallen enemies. The landscape is littered with a number of treasure chests that erupt out of scenery, some of which are hidden and has to be found by way of a well-timed jump in a certain place. The treasure chest can be opened with projectiles resulting in one of three occurrences: the reward of a new weapon, some shiny new golden armour or a hostile wizard who turns the player into the old man or a duck. The golden armour gives Arthur a chargeable \"super\" attack which varied depending on the currently possessed weapon. These attacks range from a huge lightning bolt that cut a swathe both vertically and horizontally across the screen, to a spell that creates a mirror-like clone of Arthur, effectively doubling his attack power.</p>"},{"name":"Dangerous Seed (J)","year":1990,"developer":"Namco Limited","url":"h#ROMs%2FDangerous%20Seed%20%28Japan%29.zip","filesize":1,"score":7,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>It is the 25th century, and the solar system has come under attack by an mysterious alien enemy known as Dangerous Seed. Human forces have been decimated, and the aliens' next target is Earth! The enemy draws closer to the frontline base on the moon by the hour, and the final line of defense for Earth, the fighter ship Moon Diver, has launched.</p><p><em>Dangerous Seed</em> is a vertical scrolling shooter converted from the 1989 Namco coin-op. The player controls the three-part fighter ship Moon Diver through 12 stages to confront the alien menace and secure peace in the solar system. Each of the three parts of the ship, Alpha, Beta, and Gamma, have their own properties which can be combined in various ways. Each type and combination has multiple shot types which can be powered up, and there are also options and bombs available which contribute to Moon Diver's extensive arsenal.</p>"},{"name":"Danny Sullivan's Indy Heat","year":1991,"developer":"Leland Corporation","url":"d#Danny%20Sullivan%27s%20Indy%20Heat%20%28USA%29%20%28Proto%29.zip","filesize":290368,"score":7.5,"genres":"Action > Racing / Driving > Top-down > Fixed / flip-screen > Licensed","desc":"<p>Danny Sullivan, 1988 IndyCar champion and winner of the classic 'Spin &amp; Win' Indianapolis 500 in 1985, put his name to this Super Sprint style racing game. There are 4 cars in each race, 1 or 2 player options, and 9 tracks to race on, with the Tradewest Speed Bowl the ultimate target, and is much longer but with double points (it's essentially a substitute for the licensed-elsewhere Indianapolis 500, which did pay double the usual level of IndyCar championship points for many years).</p><p>The player has limited fuel, and will run slowly if supplies run out, and the car can be damaged, although both are repairable in the pits. They get a turbo to use sparingly, which can also be recharged in the pits if they have bought more. After each race the player will get money (slightly more for a higher finish), which can be spent on upgrades such as improved power, brakes or more turbos.</p>"},{"name":"Darius","year":2021,"developer":"Taito Corporation","url":"d#Darius%20%28World%29%20%28Genesis%20Mini%2C%20Mega%20Drive%20Mini%29.zip","filesize":1460183,"score":7.2,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p><em>Darius</em> was Taito's effort to compete in the arcades against the likes of R-Type and Gradius. Technically impressive, it featured three screens depicting the largest playfield seen in a game so far (the same system was employed for Ninja Warriors), with the player sitting atop a big set of loudspeakers. Visually and audibly, it was a league above Irem's and Konami's offerings.</p><p>When Taito (and others) ported the game to home machines, they were forced to shrink the playfield to fit in one single screen, and re-dubbed it <em>Darius Plus</em>.</p><p>The plot of <em>Darius</em> involves the two heroes Proco Jr. and Tiat Young fighting the menaces posed by galactic fish and other sea animals again their homeworld.</p><p>What sets <em>Darius</em> apart from other shoot'em-ups of the time is its way of letting the player choose his path with a certain amount of freedom. At the end of each area (level), you are able to choose between one of two worlds which the area branches into. This renders a higher replay value, since there are many paths to reach the end of the game by.Apart from this, the gameplay is on the simplistic side, both due to unimaginative attack waves and little interaction with the surroundings, but mainly due to the very basic powerup system, which is nowhere near the complexity of the aforementioned <em>R-Type's</em> and <em>Gradius'</em>.</p>"},{"name":"Dark Castle","year":1991,"developer":"Silicon Beach Software, Inc.","url":"d#Dark%20Castle%20%28USA%2C%20Europe%29.zip","filesize":392280,"score":5.3,"genres":"Action > Platform > Fantasy","desc":"<p>The Black Knight has brought misery to the land, and the end way to end this is to enter his haunted house to slay him. You are the brave adventurer taking on this quest through 14 increasingly-tough zones.</p><p>The bulk of the game is side-viewed, involving single screens to pass through, which incorporate ropes, cages and trapdoor. There are enemies walking, flying and hovering through this, and many of them respawn. Unusually your weapon to take them on (rocks) can be thrown through 360 degrees, which aims to make the gameplay more realistic and methodical. The screens were linked by hub screens, which the player passes through simply by clicking on a door.</p>"},{"name":"Dashin' Desperadoes","year":1993,"developer":"Data East Corporation","url":"d#Dashin%27%20Desperadoes%20%28USA%29.zip","filesize":642482,"score":6.5,"genres":"Action > Racing / Driving > Side view > 2D scrolling > Platform > Western","desc":"<p>Two cowboys try to win a girl's heart by racing each other in side-scrolling run-and-jump obstacle courses. The first to arrive will get her love. The duel takes you through six worlds with three levels each.  In order to move on to the next world, you have to destroy the vehicle of your opponent, who has kidnapped the girl in each final level. Both singleplayer and multiplayer modes have horizontal split screens, which can be used strategically to slow down your rival.</p><p>The cowboys can jump, pick up weapons and dash at regular intervals to gain some extra speed. In order to win the level, you need to make use of the many obstacles. Some are meant to slow you down, but others, such as running shoes, skateboards or jump pads, can be used to improve your speed. There are multiple paths for each level as well.</p>"},{"name":"David Crane's Amazing Tennis","year":1992,"developer":"Imagineering Inc.","url":"d#David%20Crane%27s%20Amazing%20Tennis%20%28USA%29.zip","filesize":392293,"score":6.9,"genres":"Sports > Behind view > 2D scrolling > Tennis > Licensed","desc":"<p>A tennis game featuring both an exhibition and a tournament mode. In the head to head exhibition mode, the player can choose their opponent (with the higher ranked opponents being better than the lower ranked ones). The tournament mode allows for 16 different players to compete to become the champion. Both of these modes can be played on either grass, hard, or a clay court. The player can also choose whether to be either a left or right handed tennis player.</p><p>During the game, whoever is serving the ball will be closer to the screen. Players will be able to use topspin, execute drop shots, perform volleys, lobs, slices and overhead smashes, and decide on either a hard or soft serve to keep the opponent off balance.</p><p>Although the game features fictional players, it is endorsed by Footlocker.</p>"},{"name":"David Robinson's Supreme Court","year":1992,"developer":"Acme Interactive, Inc.","url":"d#David%20Robinson%27s%20Supreme%20Court%20%28USA%2C%20Europe%29.zip","filesize":260414,"score":6.5,"genres":"Sports > Diagonal-down > Isometric > Basketball > Licensed","desc":"<p><em>David Robinson's Supreme Court</em> is a basketball game with both exhibition and tournament modes. Choose one out of four fictional teams and then draft various skilled fictional players onto the team. Exhibition mode lets the player choose to either player 3 on 3 or 5 on 5 while tournament mode only allows for 5 on 5 play. The game also features a roleplaying mode where the player takes the role of and controls only one player on the court.</p><p>Tournament mode lets the players team play the three other teams with the prize being a chance to go up against David Robinson's All-Stars. Speaking of which, David Robinson offers commentary at the halftime of games.</p><p>The game features three levels of difficulty (beginner, normal, and superstar), and also adjustable minutes per quarter (from three to twelve).</p>"},{"name":"Davis Cup Tennis: Davis Cup World Tour","year":1993,"developer":"Loriciels","url":"d#Davis%20Cup%20Tennis%20~%20Davis%20Cup%20World%20Tour%20%28USA%2C%20Europe%29%20%28Beta%29%20%28June%2C%201993%29.zip","filesize":549740,"score":7.6,"genres":"Sports > Behind view > 2D scrolling > Tennis > Licensed","desc":"<p>The Davis Cup is an annual international team event in men's tennis. The participating countries, consisting of different players, compete in both singles and doubles matches. The entire championship has been made available in this game, and the matches are played using a third-person perspective.</p><p>There are different types of courts and difficulty levels. Aside from the championship, you can also practice, enter tournaments or play exhibition matches. Work along with a friend as a team or compete in singles matches. Aside from the familiar strokes, timing is important to determine the amount of spin.</p>"},{"name":"Daze Before Christmas","year":1994,"developer":"Funcom Oslo A/S","url":"d#Daze%20Before%20Christmas%20%28U%29.zip","filesize":1225401,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Shooter","desc":"<p>Christmas is a time where people get together and give others presents and spend all day eating food. But there's only one problem this year. You see, while Santa was sleeping in his bed, the cold and evil snowman spooked all the elves away, and the Timekeeper has stolen Santa's plans from his house. There won't be any Christmas if Santa doesn't stop them.</p><p>In <em>Daze Before Christmas</em>, you're Santa. According to the game's Christmas calender, you have 24 areas to explore such as factories, workshops, caves, and more. Each area is filled with nasty enemies like penguins, jack-in-the-boxes, helicopters, snowmen, and many others. Furthermore, after every five areas, Santa has to come face-to-face with not only The Evil Snowman, The Timekeeper, and Louse the Mouse, but also Mr. Weather.</p><p>Santa's health is represented by five Santa hats. When Santa is hit by any one of his enemies, one hat is lost. If Santa loses all of his hats, then he will lose a life. He will then have to restart at the beginning of the area, unless he passes a gold bell somewhere in the area. When you explore each area, Santa can collect presents that contain a mini-Santa (aka: Extra Life), a red hat, or he may release an elf. Santa should be careful when opening these presents as some of them may contain bombs or other enemies. If Santa manages to find a spinning star, he must get it as this will take him to the next area.</p><p>Santa kills his enemies by throwing magic at them. In almost each area, Santa can get a cup of hot cocoa. Doing this will transform him into Anti-Santa, a type of Santa who wears nothing but white, grows Satan's horns on top of his head, is invincible, and comes equipped with a hammer in which he can use to bonk enemies with. The Anti-Santa business only lasts for 20 seconds, but this can be changed via the Options menu.</p><p><em>Daze</em> acts like one of those platform games where you run through the level, shoot at enemies, and proceed to the exit. However, there are some areas where the gameplay changes, and these areas involve Santa flying through the sky in England, Russia, Japan, and the USA, and dropping presents in chimneys to score points. The game also uses a password-saving system, where entering a password given will allow gamers to restart at the beginning of a specific area, in case they happen to run out of lives.</p>"},{"name":"Deadly Moves","year":1992,"developer":"System Vision","url":"d#Deadly%20Moves%20%28USA%29.zip","filesize":567787,"score":6.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Martial arts","desc":"<p>You are Joe, a young American who has been secretly training to become a powerful fighter. One day, he meets an old martial artist who tells him he should travel all over the world to meet other teachers and to learn from them. During his travels, Joe encounters many other fighters, and has to become more and more skillful in order to prove that he is the greatest fighter in the world.</p><p>Unlike most other fighting games, you can control only one character (Joe) in single-player mode. In two-player mode, you can choose to fight as any of the seven available fighters, and also choose a scenery. The game plays like a standard 2D fighter: you can punch, kick, and jump on you opponents, but the fights are not entirely 2D, since you can also take a few steps vertically.</p>"},{"name":"Death and Return of Superman, The","year":1994,"developer":"Blizzard Entertainment Inc.","url":"d#Death%20and%20Return%20of%20Superman%2C%20The%20%28USA%29.zip","filesize":1111963,"score":6.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p>\"Doomsday\" is here and only Superman can stop him. Unfortunately in doing so he gets killed himself. Now four other characters emerge, each claiming to be the real hero. The story starts you off with Superman, then Steel, the Eradicator, the Cyborg, and Superboy. Each character has slightly varied moves so different strategies apply when playing as them.</p><p>The gameplay is basically that of a standard beat-em-up, with the punches, throws and specials moves.</p>"},{"name":"Death Duel","year":1992,"developer":"Punk Development","url":"d#Death%20Duel%20%28USA%29.zip","filesize":516207,"score":6.5,"genres":"Action > 1st-person > Side view > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In the future all intergalactic disputes must be settled by a duel to the death. Nine galactic superpowers take control of the flight paths, leaving the Federation unable to operate. To regain the paths, the Federation sends in Barrett Jade inside a giant cyborg. He has to battle to death and defeat the other nine superpowers' contestants to regain control.</p><p><em>Death Duel</em> is a tactical side-scrolling first-person shooter. The game consists of different time-limited rounds against a single enemy. Before each game, the player can spend Pheelae (money) on repairs and determine what weapons to take into battle. Each opponent has specific weaknesses and they can hide behind walls on the battlefield. To take them out, Jade needs to choose the most effective weapons and target specific parts before he runs out of time and ammo. Weapons include missiles, rockets, grenades that slow the opponent down, a machine gun and more. Only three weapons can be acquired at all times. Between missions there are short gallery shooting mini-games where additional money can be acquired.</p>"},{"name":"DEcapAttack","year":1991,"developer":"Vic Tokai Corporation","url":"d#DEcapAttack%20%28USA%2C%20Europe%2C%20Korea%29.zip","filesize":251591,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform > Horror","desc":"<p>In this game you play as Chuck D. Head, the product of a mad, but benevolent, scientist.  Chuck looks a lot like a mummy, except he is missing an important part: a head.  Fortunately, he is equipped with a set of eyes and a weird punching appendage in the middle of his chest. </p><p>Chuck's weird features come in handy when, one day, this evil guy named Max D. Cap emerges from the underworld.  Max quickly takes over our world, and only Chuck can stop him.</p><p>The gameplay in Decapattack is of the side-scrolling platformer variety.  You play through several colorful worlds, collect useful power up potions, and deliver a beat down to the ugly bosses.</p>"},{"name":"Demolition Man","year":1995,"developer":"Alexandria, Inc.","url":"d#Demolition%20Man%20%28USA%2C%20Europe%29.zip","filesize":828700,"score":7.4,"genres":"Action > Diagonal-down > Side view > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Demolition Man</em> is a game based on the 1993 movie by the same name. As with the movie, the game takes place in a dystopian Los Angeles, in 1996. John Spartan is the country´s most fearsome cop and hunts his nemesis, Simon Phoenix. However in doing so, he kills several innocent civilians and both characters are sentenced to cryostasis rehabilitation where they will be brainwashed for 30 years. However the brainwashing does not go as planned and upon waking up, Phoenix goes on a new crime spree. However in 30 years the world has also changed and Los Angeles has become San Angeles, a utopian and violence-free society. As a remnant of a more violent past, police officer John Spartan is once again sent to capture Phoenix.</p><p><em>Demolition Man</em> is a fast-paced platform game, with some levels taking place in an overhead perspective (similar to Smash TV). As John Spartan, the player will spend most of his time shooting endless waves of \"cryocons\" released upon the antiseptic world of the future. The standard weapon can be upgraded with a shotgun and magnum, both with limited ammo. Additionally, various types of grenades can be collected, which are thrown independently of the firearm. Simon Phoenix appears as a boss character at the end of every level that is directly tied in with the movie.</p><p>The Sega CD version of the game retains identical levels and gameplay, but adds digitized clips from the film to introduce levels and advance the plot.</p>"},{"name":"Demons of Asteborg","year":2021,"developer":"Neofid Studios"},{"name":"Desert Demolition Starring Road Runner and Wile E. Coyote","year":1995,"developer":"BlueSky Software, Inc.","url":"d#Desert%20Demolition%20Starring%20Road%20Runner%20and%20Wile%20E.%20Coyote%20%28USA%2C%20Europe%29.zip","filesize":607724,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Play either the Road Runner OR Wile E. Coyote in this unique side-scroller that is just like an interactive Saturday morning cartoon.</p><p>Your goal: run through six different desert environments before time expires, collecting ACME stamps.</p><p>As the Road Runner, speed is your ally as you do incredible jumps, burn though loop-de-loops, and avoid all of the Coyote's contraptions and ambushes. The Road Runner can also scare an unsuspecting Coyote with his Beep-Beep attack.</p><p>As the Coyote, you use Acme's crazy gadgets to catch the Road Runner, constantly attempting to master their power without getting yourself flattened. The Coyote has a special leap attack which allows him to make a last ditch attempt to grab the bird!</p><p>Bonus rounds include cameos from other classic Warner Bros. characters such as Elmer Fudd, Bugs Bunny, Marvin the Martian.</p>"},{"name":"Desert Strike: Return to the Gulf","year":1992,"developer":"Granite Bay Software","url":"d#Desert%20Strike%20-%20Return%20to%20the%20Gulf%20%28USA%2C%20Europe%29.zip","filesize":581766,"score":7.8,"genres":"Action > Diagonal-down > Isometric > Shooter > Helicopter > Contemporary > Middle East > War","desc":"<p>The first game in the Strike series. A year after the Gulf War, a self-styled general named Kilbaba (Muababa in the GBA version) takes over an Arab Emirate and threatens to start World War III against his western enemy, the United States. The whole world holds its breath as the President has chosen you to destroy Kilbaba and his terrorist army before he launches a nuclear attack on the world!</p><p>You must fly a specially designed AH-64A Apache on a series of missions to rescue missing-in-action characters, destroy power plants, blow apart SCUD missiles, etc. to take out the enemy defense while trying to find out Kilbaba's plans.</p><p>The player controls the helicopter from an overhead, isometric perspective. The Apache is equipped with three weapon types: a machine gun and two types of missiles of different strength. During the missions, the player must beware anti-aircraft guns, missile launchers and tanks, outmaneuvering enemy fire or destroying the enemy weaponry. The Apache is destroyed if its fuel runs out, or if the armor (functioning as health) is completely depleted. However, armor can be replenished by bringing back MIA soldiers and prisoners of war back to the landing zone. There are also fuel, ammo and armor pickups available on the field.</p>"},{"name":"Devilish: The Next Possession","year":1992,"developer":"Genki Co., Ltd.","url":"d#Devilish%20-%20The%20Next%20Possession%20%28USA%29.zip","filesize":326487,"score":5.8,"genres":"Action > Top-down > Arcade > Paddle / Pong > Fantasy","desc":"<p>Genki's first game is a paddle/pong game with a background story. Once upon a time there were a prince and a princess who loved each other. But the evil jealous demon named \"Y\" turn them both into stone paddles. Suddenly, a blue sphere fell from the sky, becoming the ball which the paddles can now push forwards, overcoming obstacles and defeating demons.</p><p><em>Devilish</em> is different from other paddle games by letting you play with two paddles. The lower one behaves just like a usual paddle - you use it to prevent the ball from dropping down. The upper one can move and turn, allowing you to hit the ball from different angles and from different parts of the screen. You advance through levels by destroying bricks and enemies, going up until the level boss enemy appears.</p>"},{"name":"Devwill Too","year":2019,"developer":"Mangangá Team"},{"name":"Dial Q o Mawase!","year":1992,"developer":"Studio Fazzy"},{"name":"Dick Tracy","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Dick%20Tracy%20%28World%29.zip","filesize":357738,"score":6.8,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Shooter > Licensed","desc":"<p>This is one of the games based on the Dick Tracy movie. You are Dick Tracy, a police detective who enjoys a peaceful life with his wife. But his wife's father is murdered by a local gangster named Big Boy Caprice, and Dick Tracy is now out for revenge. The game doesn't follow the exact plot of the movie, but simply lets Dick Tracy fight his way through several levels until he faces his archenemy.</p><p>This is a platform shooter/\"beat-'em-up\" game. Plenty of gunmen will attack our hero from all the sides. Dick can only move to the right or to the left. He can use his pistol gun to take out enemies who are in front or behind him. Since he can't approach enemies who attack from the depth of the screen, he can dispose of them using his machine gun. When the enemy is too close, Dick will punch him instead of shooting.</p>"},{"name":"Dick Vitale's \"Awesome, Baby!\" College Hoops","year":1994,"developer":"Tengen Inc.","url":"d#Dick%20Vitale%27s%20%27Awesome%2C%20Baby%21%27%20College%20Hoops%20%28USA%29.zip","filesize":1074172,"score":5.6,"genres":"Sports > Behind view > Basketball > Licensed","desc":"<p>Dick Vitale, the famous college basketball coach and commentator, lent his unique voice to this game for the Sega Genesis. There are four levels of depth to the commentary. Another aspect of the license is that the variety of offensive and defensive strategies and formations for player and AI use are pulled from the pages of Coach Vitale's own playbook.</p><p>The game features a 3/4 pseudo-3D perspective similar to that available on the SNES console in Mode 7. There are 32 college teams to choose from in four conferences, and games are played by official NCAA rules. Available gameplay modes include Single Game, 2-on-2, Slamfest (a simple slam-dunk contest), and Tournament. The AI can take control of defense, and the game can be played without foul rules.</p>"},{"name":"Dino Dini's Soccer","year":1994,"developer":"Dini & Dini Productions","url":"d#Dino%20Dini%27s%20Soccer%20%28U%29.zip","filesize":418235,"score":7.1,"genres":"Sports > Top-down > Football (European) / Soccer","desc":"<p>Although this soccer game is based on Goal, it features a very different control method, with the ball on sticking to your foot to make running with the ball easier. The game is viewed from above and played up and down the pitch, without the left-to-right option of Goal. Matches can be between 2 or 20 minutes, and the scanner which shows player positions on the rest of the pitch can be moved, resized or disabled. The method of triggering aftertouch onto a pass can be chosen as well.</p><p>The game features a variety of tournaments, including the full World Cup and its qualifying rounds, and the European Championships, or individual matches, as well as being able to configure a league or cup tournament ot your own specification. Only international teams are included, although their names can be customised. Unlike most soccer games of the time, player ethnicities are accurately depicted.</p>"},{"name":"Dino Land","year":1991,"developer":"Wolf Team","url":"d#Dino%20Land%20%28USA%29.zip","filesize":263601,"score":"","genres":"Simulation > Top-down > Pinball","desc":"<p><em>Dino Land</em> is a dinosaur themed pinball machine. You basically have to shoot your pinball at dinosaur targets. As you go along, you get more points after you have hit all the dinosaur targets in the board. There are 4 pinball boards, one on ground with ground creatures, an air one that represents flying creatures, a sea level which has sea creatures, and a boss level where you are trying to save your girlfriend from the boss.</p>"},{"name":"Dinosaur's Tale, A","year":1994,"developer":"Funcom Productions A/S","url":"d#Dinosaur%27s%20Tale%2C%20A%20%28USA%29.zip","filesize":499399,"score":"","genres":"Action > Behind view > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Play as characters from the Spielberg animated movie <em>We're Back</em>, based entirely on the preview trailer. Run and jump through a variety of levels and defeat Dr. Screweyes. Every second level is a side-scrolling platformer where you take the role of the human kids Cecilia or Louie and move through obstacles to get to the end of the level. These levels are set at various New York locations including a TV studio and a circus that wants to keep the dinosaurs as an exhibit. Every other level is a 3D level where you play one of the dinosaur characters, e.g. skateboarding on the back of a pickup truck as Rex or flying as Elsa over central park while collecting balloons. This is one of the earliest Genesis games with 3D gameplay.</p>"},{"name":"Disney Collection, The: Castle of Illusion Starring Mickey Mouse & QuackShot Starring Donald Duck","year":"","developer":"","url":"d#The%20Disney%20Collection%20-%20Castle%20of%20Illusion%20Starring%20Mickey%20Mouse%20%26%20QuackShot%20Starring%20Donald%20Duck%20%28U%29.zip","filesize":803957,"score":"","genres":"","desc":"<p>Two games: Castle of Illusion Starring Mickey Mouse & QuackShot Starring Donald Duck</p>"},{"name":"Disney Collection, The: Quackshot Starring Donald Duck & Castle of Illusion Starring Mickey Mouse","year":1996,"developer":""},{"name":"Disney's Aladdin","year":1993,"developer":"Virgin Games, Inc.","url":"d#Aladdin%20%28USA%29.zip","filesize":1174781,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Middle East > Licensed","desc":"<p>The game from Virgin based on the 1992 animated Disney film is a side-scrolling platformer.</p><p>The player controls Aladdin, who must make his way through several levels based on locations from the movie: from the streets and rooftops of Agrabah, the Cave of Wonders and the Sultan's dungeon to the final confrontation in Grand Vizier Jafar's palace. The Sultan's guards and also animals of the desert want to hinder Aladdin in his way. He can defend himself with his sword or by throwing apples. Next to apples, Aladdin can also collect gems which can be traded for lives and continues with a traveling trader. Finding Genie or Abu icons enables bonus rounds. The Genie bonus round is a game of luck played for apples, gems or extra lives. In Abu's bonus round, the player controls the little monkey who has to catch bonus items that fall from the sky, but without touching any of the unwanted objects like rocks and pots.</p><p>The game's humorous animations were created by Walt Disney Feature Animation.</p>"},{"name":"Disney's Ariel the Little Mermaid","year":1992,"developer":"BlueSky Software, Inc.","url":"d#Ariel%20the%20Little%20Mermaid%20%28USA%2C%20Europe%29.zip","filesize":308244,"score":5.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Help either Ariel, the gleeful little mermaid, or Triton, her father, foil the evil Ursula, who has transformed everyone into small, green worm-like creatures, including the character you don't initially choose.</p><p>Rescuing requires you to simply swim into the unfortunate little victims as they hang about at fixed places in the watery world; while fending off and dodging enemies like eels, clams, sharks, and several other sea meanies. Friends like Flounder and Sebastian can also be summoned for a little helping hand.</p>"},{"name":"Disney's Beauty and the Beast: Belle's Quest","year":1993,"developer":"Software Creations Ltd.","url":"d#Beauty%20and%20the%20Beast%20-%20Belle%27s%20Quest%20%28USA%29.zip","filesize":627230,"score":5.3,"genres":"Action > Side view > Platform > Puzzle elements > Licensed","desc":"<p>Play as Belle from Disney's \"Beauty and the Beast\" and (loosely) follow the animated film's story. Jump and duck to ward off hindrances, which can come in forms of birds, rats, bats, etc. </p><p>Also have the 'beauty' interact with her supporting characters as you lead her from her start as a village girl, to the final dance with her prince in the ball room.</p>"},{"name":"Disney's Beauty and the Beast: Roar of the Beast","year":1993,"developer":"Software Creations Ltd.","url":"d#Beauty%20and%20the%20Beast%20-%20Roar%20of%20the%20Beast%20%28USA%29.zip","filesize":594631,"score":5.6,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Licensed","desc":"<p><em>Roar of the Beast</em> is the second Genesis game based on the <em>Beauty and the Beast</em> animated film, only this time the player does not control Belle but Beast throughout the entire game. It is not a sequel to the first game, as both games were released in the same year. This title largely retells the story from Beast's perspective. It starts with Beast living in a castle in the dark woods with his servants (Lumiere, Cogsworth and Mrs. Potts). A powerful storm hits the castle and enchants all animals around it. Initially the beast needs to protect the magic rose against the creatures. Soon, Belle and her father Maurice become involved, and eventually the villagers who invade the castle.</p><p>The game takes place in Beast's castle and the surrounding woods. Through side-scrolling platform gameplay Beast can attack from three different stances (crouch, stand up, jump) and unleash a limited amount of roars that stun enemies for a short time. After regular levels, a sequence with a boss follows. There are also a few mini-games where Beast needs to finish a puzzle and catch rosebuds. Certain events are time limited. The game keeps track of the player's score, based on defeated enemies and collected treasures. There is an unlimited amount of continues and the story is told through static, drawn cut-scenes between missions.</p>"},{"name":"Disney's Bonkers","year":1994,"developer":"SEGA Interactive Development Division","url":"d#Bonkers%20%28USA%2C%20Europe%29.zip","filesize":587751,"score":6.4,"genres":"Action > Racing / Driving > Behind view > Diagonal-down > Side view > Top-down > 2D scrolling > Platform > Licensed","desc":"<p>The game is based on the Disney TV series of the same name. Bonkers is a bob-cat police officer. One day, he reads in a newspaper that a contest for the best policeman is announced. Since his partner is away, Bonkers decides that would be the best opportunity to grab the first prize. In order to win the contest, Bonkers has to catch four famous criminals.</p><p>Catching each one of the criminals is a separate mini-game. The first one involves you running horizontally in a museum room and throwing doughnuts at thieves who are trying to steal valuable things. In the second one, you try to lock a criminal in a yard by quickly building a brick wall around him. In the third one, you must find clothes hidden in crates before a bomb explodes. Finally, the fourth and last game involves you driving a car from top-down view, chasing a criminal. Each mini-game also features a unique bonus game, which you get when you successfully complete three games with gradually advancing difficulty in a row.</p>"},{"name":"Disney's Pocahontas","year":1996,"developer":"Tiertex Ltd.","url":"d#Pocahontas%20%28USA%29.zip","filesize":1700574,"score":6.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Incarnation of the Disney cartoon; Pocahontas, along with a tag team partner in her raccoon friend, Meeko, goes about her homeland, helping her animal friends. As so is done, she will acquire animal spirits which will help her become stronger and bless her with new abilities.</p><p>But soon enough she meets John Smith, and as an inevitable consequence has to prevent a war between his and John's people. And she has to do it in a hurry, before John's neck gets a non-\"disney\" treatment..</p>"},{"name":"Disney's TaleSpin","year":1992,"developer":"SEGA Interactive Development Division","url":"d#TaleSpin%20%28USA%2C%20Europe%29.zip","filesize":359143,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Flight / aviation > Licensed","desc":"<p>Baloo the Bear is the chief and only pilot at the always struggling air-freight company of Higher for Hire. With his cargo plane, the Sea Duck and the young orphan, Kit Cloudkicker... Baloo is ready to take to the sky and face down air pirates, bad weather and the ruthless Shere Khan.</p>"},{"name":"Disney's The Jungle Book","year":1994,"developer":"Virgin Interactive Entertainment, Inc.","url":"d#Jungle%20Book%2C%20The%20%28USA%29.zip","filesize":1356267,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Asia > Fantasy > Licensed","desc":"<p>Based on the famous animated movie, <em>Walt Disney's The Jungle Book</em> is a platform game where you control Mowgli, the boy who was raised by wild animals deep in the jungles. Your goal is to find the human village so you may you join your kin once again. </p><p>Mowgli is an athletic individual, and can jump, run, swing on vines or climb them without any problems. Most of the animals he comes upon, however, are inexplicably hostile, so he must defend himself with a variety of thrown weapons, such as bananas and boomerangs. </p><p>To complete each level, Mowgli must collect a number of crystals (how many - it depends on the difficulty levels) within a time limit. A compass in the corner of the screen helps him by showing the direction where the nearest crystal is.</p>"},{"name":"Disney's Toy Story","year":1995,"developer":"Tiertex Design Studios","url":"d#Toy%20Story%20%28USA%29.zip","filesize":2679598,"score":7.1,"genres":"Action > 1st-person > Behind view > Side view > 2D scrolling > Platform > Licensed","desc":"<p>This game is based on the movie \"Toy Story\". It sets you as the character of Woody as you jump, swing, and drive to the end of each level. Each level contains familar scenes from the movie. The gameplay consists of the platform\\sidescrolling kind. You use Woody's pullstring to defeat enemies like sharks, Mr. Potatohead, and Ham. After each level, you are treated to still images from the movie.</p>"},{"name":"Divine Sealing","year":1991,"developer":"Studio Fazzy"},{"name":"DJ Boy","year":1990,"developer":"Kaneko Co., Ltd.","url":"d#DJ%20Boy%20%28USA%29.zip","filesize":224639,"score":6.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler","desc":"<p>Skating DJ Boy's girl has been kidnapped by the town's local goons and DJ Boy is the only one who can save the day. This coin-op conversion offers different rounds of side-scrolling beat-em-up gameplay, each with an end boss. DJ Boy is able to punch, kick, combine them in a flying attack and punch to both sides at the same time by pressing the main attack buttons. Although the visuals are less rough and friendlier than its contemporary counterparts, the difficulty is very unforgiving. DJ Boy has only four life bars and when they are gone, the game is over without continues. Defeated enemies leave behind coins. At the end of each stage the coins can be exchanged for a skateboard, a stronger punch or other items.</p>"},{"name":"Dominus","year":1994,"developer":"Visual Concepts Entertainment, Inc.","url":"d#Dominus%20%28USA%29%20%28Proto%29.zip","filesize":567719,"score":6.8,"genres":"Strategy > Diagonal-down > Isometric > Real-time > Fantasy","desc":"<p>You are an Overlord in the employ of an aged King who has long since tired of battling.  Protection and control of the kingdom, its resources, treasures and its force of monster are your obligations.</p><p>Neighboring clans are invading the dominion.  They are a scourge of ravenous looters, soldiers, and mages.  Each group desires some resource that is abundant in the kingdom.  The longer they steal from you, the stronger they become.</p><p>The clans will attack from every direction.  If you do not defeat them at the outskirts of the kingdom they will move toward your castle destroying and pillaging along the way.  As they ravage the land and close on the castle they gain strength from the resources they have captured.  Each clan is after specific resources.  Some are invaders or scouts.  Others are powerful mages.</p><p>Fight back the invaders with all your resources.  Order your generals and monsters into combat.  Lay traps.  Use Magick to destroy the clans and enhance your own forces.  Gain information through interrogation and spies or fight with your own hands.</p>"},{"name":"Donald in Maui Mallard","year":1995,"developer":"Disney Interactive, Inc.","url":"d#Donald%20in%20Maui%20Mallard%20%28U%29.zip","filesize":1537490,"score":7.5,"genres":"Action > Side view > 2D scrolling > Platform > Martial arts > Licensed","desc":"<p>Disney's Donald Duck takes the starring role in this sidescrolling platform game.  As the detective Maui Mallard, he's on the trail of a long lost Idol, which has recently vanished.  Early on, Maui can also switch between his normal self and Ninja Maui, and with all the creepy voodoo enemies he'll encounter throughout his adventure, he's going to need all the help he can get.</p><p>As previously mentioned, there are two personalities to Maui, and as a result, two different sets of controls.  Normal Maui carries a bug gun, which can fire a variety of different insect ammo, from basic bugs, to the more powerful lightning and fire bugs.  It's also possible for Maui to combine bugs to pack a more powerful blast at his enemies.</p><p>Once Maui starts to find Yin-Yang coins, he'll be able to transform into Ninja Maui.  Ninja Maui has lightning-quick reflexes, and wields a bo staff.  In addition to being handy for whacking enemies, Ninja Maui can also climb between walls by jumping and propping the staff between the walls at the height of his jump.  He can also hook onto duck heads and swing from them to reach areas he normally couldn't.  You'll need to constantly find Yin-Yang coins to fuel your Ninja persona, otherwise you'll run out and transform back to Maui Mallard.</p><p>The level layout in the Game Boy version is slightly different with less secrets to be found.</p>"},{"name":"Doom Troopers: Mutant Chronicles","year":1995,"developer":"Adrenalin Entertainment","url":"d#Doom%20Troopers%20%28USA%29.zip","filesize":1302160,"score":6.1,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Based on the popular role-playing and card game, <em>Doom Troopers: Mutant Chronicles</em> casts you as a fearless commando who has been commissioned to save the world from an invading force of mutants. </p><p>Play as either Mitch Hunter or Max Steiner as you embark on the most important mission of your life--the complete annihilation of the Dark Legion. Work your way through eight detailed levels filled with all kinds of evil and dangerous mutants, as you unload with a barrage of high-powered weapons that are readily available. If the pressure is a little too much for you to handle alone, recruit a friend and try to eliminate the Dark Legion together. The world is in grave danger and only the Doom Troopers can make things right.</p>"},{"name":"Doraemon: Yume Dorobō to 7-nin no Gozans","year":1993,"developer":"G-Sat"},{"name":"Double Clutch","year":1993,"developer":"BGS Development","url":"d#Double%20Clutch%20%28U%29.zip","filesize":173365,"score":6.7,"genres":"Racing / Driving > Top-down > Arcade","desc":"<p><em>Double Clutch</em> is an overhead racing game similar to Super Off Road. One or two players choose from four different drivers, each with their own special ability, then head out for a race on one of four different tracks. Of course, the goal is to be the first to finish three laps of the course, but watch out for your opponents; bump into them or the terrain and your vehicle will take damage. Take too much damage and it's game over! After each race, winnings can be used to upgrade or repair the vehicle. There are three difficulty levels, which affect how quickly the vehicle takes damage. There is also a practice mode where the player can freely choose any track.</p>"},{"name":"Double Dragon","year":1993,"developer":"Technos Japan Corp.","url":"d#Double%20Dragon%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":244100,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Direct control","desc":"<p>Set in a post-apocalyptic New York, <em>Double Dragon</em> is the story of Billy and Jimmy Lee, twin brothers trained in the fighting style of Sou-Setsu-Ken. Together, they manage a small martial arts training school, teaching their students in self-defense. One day, Billy's girlfriend, Marian, is kidnapped off the street by the \"Black Warriors\", a savage street gang led by a man named Willy. The Black Warriors demand the Lee brothers disclose their martial arts secrets in exchange for Marian's freedom. The Lee brothers set out on a rescue mission to crush the Black Warriors and save Marian.</p><p>Using whatever techniques they have at their disposal, from the basic punches and kicks to the invulnerable elbow strike, as well any weapon that comes into their hands, the Lee brothers must pursue the gang through the city slum, industrial area and the forest before reaching their hideout to confront the big boss, Willy.</p><p>The NES version of this game also has an additional VS. fighting mode for one or two players. Players choose from a field of six different characters (Billy and 5 of the enemy characters) and enter into a one-on-one fighting match. Players have to punch, kick, jumpkick, and even use a weapon against their opponents until someone's health bar is fully drained. The winner is the last one standing.</p>"},{"name":"Double Dragon 3: The Rosetta Stone","year":1992,"developer":"East Technology Corp.","url":"d#Double%20Dragon%203%20-%20The%20Arcade%20Game%20%28USA%2C%20Europe%29.zip","filesize":469645,"score":5.8,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler","desc":"<p>The final game in the trilogy.</p><p>Billy and Jimmy Lee are returning from martial arts training when their paths cross a fortune teller. She tells them of a great evil in Egypt, their strongest adversary yet, and how the Rosetta Stones can aid them.</p><p>This game features weapon shops where Billy and Jimmy can buy power-ups, tricks, energy and extra lives to aid them in their quest.</p><p>Power-ups make Billy and Jimmy twice their size, increasing their damage done and range of attack.</p><p>The character graphics have changed, moving away from cartoon style graphics to more realistic looking characters.</p>"},{"name":"Double Dragon II: The Revenge (J)","year":1991,"developer":"Technos Japan Corp.","url":"h#ROMs%2FDouble%20Dragon%20II%20-%20The%20Revenge%20%28Japan%29%20%28En%29.zip","filesize":1,"score":5.9,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Direct control","desc":"<p>The lovely Marian was rescued from the clutches of the Black Warriors gang by Billy &amp; Jimmy Lee in the first Double Dragon game, but now the gang has killed her in retaliation of their early defeat. The Dragons must now embark on a mission to avenge her death and defeat the Black Warriors for the second and final time.</p><p>The original arcade version of \"Double Dragon II\" was essentially an improved version of the first game. In addition to offering renewed audio and visuals, as well as new traps, moves and enemy characters, \"Double Dragon II\" discarded the conventional punch and kick buttons in favor of a direction-oriented attacking system similar to the original Technos beat-em-up Renegade.</p><p>The NES version offered new stages, new moves and illustrated cut-scenes, as well as a new final boss and a new ending. Unlike the first NES game, it offered 2-Player Co-Op gameplay with the option to turn off the friendly fire.</p>"},{"name":"Double Dragon V: The Shadow Falls","year":1994,"developer":"Leland Interactive Media","url":"d#Double%20Dragon%20V%20-%20The%20Shadow%20Falls%20%28USA%29.zip","filesize":1634156,"score":4.4,"genres":"Action > Side view > 2D scrolling > Fighting > Martial arts > Licensed","desc":"<p><em>Double Dragon</em> returns, this time as a VS. fighter, in the same mold as Street Fighter. It does not continue the series' storyline, but is based on the <em>Double Dragon</em> animated series, which is loosely based on the original arcade game, Jimmy and Billy and a host of other characters fight it out in a tournament fighter. </p><p>The Shadow Master, who has created a deadly virus which he plans to destroy the world with, is waiting for you at the end of the path to victory. You'll have to fight your way through many evil characters before you face the Shadow Master. Beat him, and the world is saved for another day.</p>"},{"name":"Double Dribble: The Playoff Edition","year":1994,"developer":"Konami Co., Ltd.","url":"d#Double%20Dribble%20-%20The%20Playoff%20Edition%20%28USA%29.zip","filesize":1122851,"score":5.9,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Arcade > Basketball","desc":"<p>An updated version of the original Double Dribble basketball game. <em>Double Dribble: The Playoff Edition. The Playoff Edition</em> expands dramatically on the original in a number of ways:* 16 teams of 12 (fictitious) players each</p><ul><li>All players individually rated for various skills (Shooting %, Stamina, etc.)</li><li>Three play modes: Exhibition, Playoff (with password feature), and Multiplayer</li><li>8-way multiplayer support with the Sega \"Team Player\" adapter</li></ul>"},{"name":"Double Pack: Joe Montana Football 3 and Double Clutch MD","year":1996,"developer":""},{"name":"Dr. Robotnik's Mean Bean Machine","year":1993,"developer":"Compile","url":"d#Dr.%20Robotnik%27s%20Mean%20Bean%20Machine%20%28USA%29.zip","filesize":569899,"score":7.8,"genres":"Puzzle > Anime / Manga > Real-time > Falling block puzzle","desc":"<p><em>Dr. Robotnik's Mean Bean Machine</em> is a version of Puyo Puyo with a storyline involving characters from the Sonic the Hedgehog games. The evil Dr. Robotnik decides to turn the citizens of Beanville into robots. It's up to the player to save them from their doom. The player drops pairs of beans into the dungeons, trying to create groups of four in matching colors. He or she must challenge Dr. Robotnik's robots to a battle and defeat them, and eventually face the Eggman himself.</p>"},{"name":"Dragon Ball Final Bout","year":1998,"developer":"Tose Co., Ltd.","url":"d#Dragon%20Ball%20Final%20Bout%20%28Pirate%29.zip","filesize":1465376,"score":5.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Licensed","desc":"<p>Based on the popular anime series <em>Dragonball GT</em>, take control of Goku, Piccolo, Frieza, Cell, Buu and many other characters in full 3D battles. Game modes include Taisen mode (Battle mode), Tenkaichi Budoukai mode and Build Up mode (where you can increase your character's skills).</p>"},{"name":"Dragon Ball Z: L'Appel Du Destin","year":1994,"developer":"Tose Co., Ltd."},{"name":"Dragon Slayer: The Legend of Heroes","year":1994,"developer":"Nihon Falcom Corp."},{"name":"Dragon Slayer: The Legend of Heroes II","year":1995,"developer":"Nihon Falcom Corp."},{"name":"Dragon: The Bruce Lee Story","year":1994,"developer":"Virgin Interactive Entertainment (Europe) Ltd.","url":"d#Dragon%20-%20The%20Bruce%20Lee%20Story%20%28USA%29.zip","filesize":1448192,"score":6.5,"genres":"Action > Side view > Fighting > Martial arts > Licensed","desc":"<p><em>Dragon: The Bruce Lee Story</em>  is a action/fighting game in which you play Bruce Lee, the infamous martial arts master.</p><p>As you go through the different levels, the game follows the format of the 1993 Universal movie of the same name, but is not identical to it.</p><p>As Bruce Lee, you can perform a wide variety of high-flying martial arts moves, roundhouse kicks, flying kicks, flying chops and throws. Defeat a multitude of new opponents and build up your <em>Chi</em> in order to gain special abilities and weapons.</p>"},{"name":"Dragon's Eye Plus Shanghai III","year":1991,"developer":"Home Data Corp."},{"name":"Dragon's Fury","year":1991,"developer":"Naxat Soft","url":"d#Dragon%27s%20Fury%20%28USA%2C%20Europe%29.zip","filesize":372295,"score":8.2,"genres":"Action > Top-down > Pinball > Fantasy","desc":"<p>Imagine an adventure game in the format of pinball, and you get Dragon's Fury. Your hero is a small silver ball, and your battlefield is a three-tiered pinball machine. Using your ball, you can defeat monsters, rack up points, and enter bonus stages. If you play with enough skill, you can trigger all sorts of point-accumulating bonuses. If you get one billion points, you get to fight the final boss and view the ending to the game.</p>"},{"name":"Dragon's Lair","year":1993,"developer":"Advanced Microcomputer Systems","url":"d#Dragon%27s%20Lair%20%28USA%29%20%28Proto%29%20%28June%2C%201994%29.zip","filesize":323775,"score":6.3,"genres":"Action > 3rd-person (Other) > Full Motion Video (FMV) > Quick Time Events (QTEs) > Timed input > Fantasy","desc":"<p>Originally released in the arcades as a LaserDisc game, <em>Dragon's Lair</em> is an interactive cartoon movie. Players control Dirk the Daring as he struggles his way through a dungeon to fight Singe, the Dragon, and rescue the beautiful Princess Daphne. The game consists of animated scenes, during which the player has to press direction buttons or the sword button at the right moment to trigger the next segment of the movie.</p>"},{"name":"Dragon's Revenge","year":1993,"developer":"Tengen Inc.","url":"d#Dragon%27s%20Revenge%20%28USA%2C%20Europe%29.zip","filesize":726165,"score":7.1,"genres":"Action > Top-down > Pinball > Fantasy","desc":"<p><em>Dragon's Revenge</em> is a sequel to Dragon's Fury (Devil's Crush).</p><p>The table for this fantasy pinball game is three screens tall with medieval and dragon graphics. Each of the three screens has a pair of flippers at the bottom and the table elements are all animated and numerous monsters roam the screen.</p><p>The object is to hit wandering monsters and certain groups of creatures to open up the gateway to a sub-level. The single screen sub levels offer multi-ball play and are the key to scoring high.</p><p>Each of the three screens has a unique sub-level portal.</p>"},{"name":"Duke Nukem 3D","year":1998,"developer":"3D Realms Entertainment, Inc."},{"name":"Dune: The Battle for Arrakis","year":1994,"developer":"Westwood Studios, Inc.","url":"d#Dune%20-%20The%20Battle%20for%20Arrakis%20%28USA%29.zip","filesize":600770,"score":8.1,"genres":"Strategy > Top-down > 2D scrolling > Real-time > Real-time strategy > Point and select > Sci-fi / futuristic > War > Licensed","desc":"<p>Westwood Studios' real-time strategy classic Dune II received a major overhaul when ported to the Sega Genesis. While the basic concept remains the same, the game features all-new graphics, streamlined controls, changes to the tech tree as well as completely new levels.</p><p>As in the original game, the player controls the troops of one of three noble Houses, called by the Emperor to mine the Spice Melange on the planet Arrakis, also known as Dune. A series of consecutive battles must be won by mining spice, constructing a base and building units to attack the enemy.</p><p>The rather complex menu-based controls of the original game have been replaced by a context-sensitive cursor system, where a unit reacts according to what is below the cursor - either moving to a destination or attacking an enemy unit, for example.</p><p>The tech tree has been simplified: Among other changes, concrete slabs are only available in the 2x2 size, there is only one type of vehicle factory and the advanced units do not require an IX research center anymore.</p><p>Finally, the progression of levels in the console version is strictly linear, as there is no choice of the next map to be played as in the original version.</p>"},{"name":"Dungeons & Dragons: Warriors of the Eternal Sun","year":1992,"developer":"Westwood Associates","url":"d#Dungeons%20%26%20Dragons%20-%20Warriors%20of%20the%20Eternal%20Sun%20%28USA%2C%20Europe%29.zip","filesize":523668,"score":7.3,"genres":"Role-playing (RPG) > Diagonal-down > Turn-based > Fantasy > Licensed","desc":"<p><em>Dungeon &amp; Dragons: Warriors of the Eternal Sun</em> is set in the world of Mystara, a setting of the <em>Dungeons &amp; Dragons</em> game. The characters find themselves in a strange, red-hued world in which the horizon slopes upward in all directions, eventually vanishing into a crimson haze at the limits of sight. Their mission is to find and make allies in this new world or else the kingdom and its culture will perish.</p><p>The player leads a party of four characters (either the default party or one that the player has created). Characters and races can be chosen from the normal D&amp;D options. The game world is viewed from a bird's eye view perspective and the characters can roam around in real time. Battles are turn based. Like most role-playing games, the gaming experience focuses on exploration, inventory management and character development.</p>"},{"name":"Dyna Brothers","year":1992,"developer":"CSK Research Institute Corp."},{"name":"Dyna Brothers 2","year":1993,"developer":"CSK Research Institute Corp."},{"name":"Dyna Brothers 2: Sega Channel Special","year":1995,"developer":"CSK Research Institute Corp."},{"name":"Dynamite Duke","year":1990,"developer":"Seibu Kaihatsu Inc.","url":"d#Dynamite%20Duke%20%28World%29.zip","filesize":355186,"score":5.9,"genres":"Action > Behind view > 2D scrolling > Arcade > Shooter","desc":"<p>Duke, armed with a machine gun and cybernetic arm, walks sideways through enemy bases, shooting snipers and engaging in hand-to-hand combat with bosses and the occasional knife-wielding soldier. An over-the-shoulder perspective is used throughout.</p>"},{"name":"Dynamite Headdy","year":1994,"developer":"Treasure Co., Ltd.","url":"d#Dynamite%20Headdy%20%28USA%2C%20Europe%29.zip","filesize":1397058,"score":8,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Regional differences","desc":"<p><em>Dynamite Headdy</em> is a platformer... with a difference. You control a little character whose main attack comes from his disembodied head. Yes, years before Rayman appeared, we already had a hero who used detachable appendages to attack his enemies.</p><p>Rather than the traditional power-ups, <em>Dynamite Headdy</em> enables you to swap your head for different kinds – such as heads that heal you or heads that stick on to walls. You use your head in order to climb up on platforms as well, as you can grab hold of things with it, and on certain stages of the Mega Drive/Genesis version it is used to turn the game into a side-scrolling shooter, as you gain a propeller, jet, or bird head. Basically, <em>Dynamite Headdy</em> is just a traditional platformer at heart.</p>"},{"name":"DynoBlaze","year":1995,"developer":"Bonsai Entertainment, Inc.","url":"d#DynoBlaze%20%28USA%29%20%28Proto%29.zip","filesize":673196,"score":4.62,"genres":"Beat 'em up","desc":"<p>DynoBlaze is an unreleased beat-'em-up game for the Sega Mega Drive by Bonsai Entertainment and Virgin Interactive Entertainment. It is notable for using Virgin's \"Digicel\" technology, originally built for Disney's Aladdin. The game was also referred to by some publications as Dinoblades. DynoBlaze was cancelled for unknown reasons, but an extremely early prototype (dated January 1994) has since been dumped. Very little exists within this prototype, and the music is borrowed from RoboCop Versus The Terminator. A Sega Mega-CD version was also announced, but even less is known about that version. The game re-emerged as DinoBlaze: What's the Rumpus at CES 1995, this as a planned 3DO release, but it too was cancelled.</p>"}]