[{"name":"EA Sports Double Header: EA Hockey & John Madden Football","year":1993,"developer":"Park Place Productions","url":"d#EA%20Sports%20Double%20Header%20-%20EA%20Hockey%20%26%20John%20Madden%20Football%20%28U%29.zip","filesize":526640,"score":"","genres":"Compilation > Sports > Licensed","desc":"<p>Two games on one cartridge here - NHL Hockey and John Madden Football.</p>"},{"name":"Earnest Evans","year":1992,"developer":"Wolf Team","url":"d#Earnest%20Evans%20%28USA%29.zip","filesize":547941,"score":6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Fantasy > Sci-fi / futuristic","desc":"<p>The story of the game is connected to that of  El Viento. Earnest Evans is a brave treasure hunter. His grandfather was a famous archaeologist who searched for three legendary idols in the 1930s. It was said that those idols could bring disaster upon the Earth if fallen into the wrong hands. But despite his efforts, he could never find even one of the idols. Now it's up to the grandson to continue his work, fifty years later. But the evil syndicate leader Brady Tressider has his own plans, and will do anything to stop Earnest...</p><p>This is an action platform game in which you control Earnest Evans, armed with his trusty whip. The hero can jump, climb ropes, crouch, and crawl. There are plenty of obstacles on the levels (bottomless pits, spikes, crushing bridges, lava, etc.), as well as gangsters and monsters to dispose of.</p>"},{"name":"Earth Defense","year":1995,"developer":"AV artisan","url":"d#Earth%20Defense%20~%20Earth%20Defend%2C%20The%20%28USA%2C%20Asia%29%20%28Unl%29.zip","filesize":208646,"score":"","genres":"Action > Top-down > 2D scrolling > Shooter > Flight / aviation","desc":"<p>In <em>Earth Defense</em>, aliens have invaded Earth. In response, the United Nations create a flying craft named the \"Phoenix Spitfire\" to fight back and defend the planet, with the player in control.</p><p>The player will fly through five vertically-scrolling levels while shooting down enemy craft, confronting a boss at the end of each level. The Phoenix Spitfire is equipped with a standard cannon that can be upgraded by finding power-ups throughout the levels, left behind by defeated enemies. Upgrades to the cannon include the Tri-Shot, Napalm Bomb, Rear Shots, and support drones.</p>"},{"name":"Earthworm Jim","year":1994,"developer":"Shiny Entertainment, Inc.","url":"d#Earthworm%20Jim%20%28USA%29.zip","filesize":1903289,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Comedy","desc":"<p>A crow is chasing a worm named Jim, while in outer space Psy-Crow is chasing a renegade ship. The ship's captain has stolen an ultra-high-tech-indestructible-super-space-cyber-suit and Queen Slug-for-a-Butt has ordered Psy-Crow to get it, since it can make her more beautiful than Princess-What's-Her-Name. Psy-Crow blasts the captain and the suit falls to Planet Earth.</p><p>Back on Earth, Jim wonders if he is finally safe when an ultra-high-tech-indestructible-super-space-cyber-suit lands on him. Luckily Jim rests in the neck ring of the suit. The space particles then begin interacting with Jim, causing a light-speed evolution. Jim soon realizes he is in control of the suit.</p><p>Jim overhears the Queen's plans for the suit and decides to meet this Princess...</p><p><em>Earthworm Jim</em> is a 2D side-scrolling platformer with action elements where the player takes control of Jim, a worm wearing a spacesuit. Jim can shoot enemies with his gun or use his body (the spacesuit's \"head\") in a variety of ways to overcome obstacles, such as whipping it at enemies, grappling hooks to swing from them, or making it spin very fast like a rotor to hover for a short time.</p><p>While most of the game is made of standard platforming levels with a boss waiting at the end, some of the levels introduce different conditions than just reaching the end to complete them, like escorting a computer-controlled character and making sure they don't get hurt. Platforming levels are interspersed with some variations in gameplay as well, such as several space racing sequences or a bungie-jumping competition.</p>"},{"name":"Earthworm Jim 2","year":1995,"developer":"Shiny Entertainment, Inc.","url":"d#Earthworm%20Jim%202%20%28USA%29.zip","filesize":1795130,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Comedy","desc":"<p>An ordinary average earthworm named Jim goes about his normal daily life, cruising around avoiding crows and doing other general worm-like things. Until one day, Jim is suddenly struck by a very large Ultra-high-tech-indestructible-super-space-cyber-suit. Through sheer luck, Jim rests safely in the neck ring of the suit. Suddenly, the ultra-high-tech space particles of the suit begin interacting with Jim's soft wormy flesh. A radical light-speed evolution takes place. Jim soon realizes that he is now in control of the suit.</p><p><em>Earthworm Jim 2</em>'s gameplay is similar to the first game, with Jim running and jumping through the levels. There are five weapons more than in the original game to collect. Characters like Princess What's-Her-Name and Psy-Crow also appear.</p>"},{"name":"Ecco Jr.","year":1995,"developer":"Novotrade Software Kft.","url":"d#Ecco%20Jr.%20%28USA%2C%20Australia%29.zip","filesize":509530,"score":5.8,"genres":"Action > Side view > 2D scrolling > Puzzle elements","desc":"<p><em>Ecco Jr.</em> is a prequel to Ecco the Dolphin, set during his childhood. Together with his friends Tara the Whale and Kitney the Dolphin, Ecco goes looking for the legendary blue whale. Released after the two main Ecco games, this title is geared towards younger children with simplified gameplay, lacking the difficulty of the other Ecco games. The game also contains a number of educational facts about dolphins.</p><p>Set in the same underwater world, players choose one of the three characters to solve a series of challenges. These all involve harmless exploration and solving small puzzles with no foes or violent gameplay. The characters need to use their abilities to locate animals, herd seahorses, retrieve a sea lion's lost ball, swim through rings and locate glyphs. After completing the main tasks, a large glyph needs to be located to end the level. The characters can be switched at any time during gameplay, but they all have the same abilities. One button is used to send out a sonar pulse to locate items while another boosts the animal. Most levels take less than a minute to complete and there are eighteen levels in total.</p>"},{"name":"Ecco the Dolphin","year":1992,"developer":"Novotrade International, Inc.","url":"d#Ecco%20the%20Dolphin%20%28USA%2C%20Europe%2C%20Korea%29.zip","filesize":516341,"score":7.2,"genres":"Action > Side view > 2D scrolling > Puzzle elements","desc":"<p>Travel through time along with Ecco the dolphin, in the only game that could call itself a \"dolphin simulator\". Indeed, you can do pretty much everything a typical dolphin does, including eating fish, surfacing in order to breathe, using your biological sonar and of course, jumping out of the water to amaze your friends.</p><p>The storyline is actually deeper that one may think by looking at the box illustration. As Ecco, you are the only dolphin who managed to escape from a giant whirlpool which sucked down your entire pod. The five shining stars on your forehead show that you are the chosen one to save them. But that task will be not be an easy one, as you will have to travel through time and space with the Atlantean time machine, and meet the mystical Asterite in order to defeat the Vortex Queen.</p><p>The main part of the gameplay in <em>Ecco the Dolphin</em> relies on exploring various aquatic levels. They are usually nonlinear, with submerged caverns and tunnels branching out from the main bodies of water. The navigation is impeded by islands that must be hopped over, volcanoes that spit hot lava, powerful currents, deadly spikes, and dangerous predators such as octopi and giant eels. The sonar ability has multiple functions: you can communicate with friendly animals, map out the nearby area (echolocation), activate glyphs, and eventually defeat enemies. Activating glyphs is necessary because they can unlock unexplored parts of the current level, including the exit that leads to the next area; some of them can even bestow the gift of invincibility on Ecco for a limited time.</p><p>You must keep an eye on the life and breath meters. Dolphins can't stay underwater for a long period of time and must return to the surface for air. However, the cavern systems may hide the occasional pocket of air as well. Every time you are hit by spikes, lava, or an enemy, Ecco loses health, and once it reaches zero you will have to replay the level from the beginning. The life meter can be replenished by eating fish or by finding healing clams, called the Shelled Ones, and communicating with them. It's possible to avoid most enemies, but Ecco can kill troublesome creatures using the death sonar or by charging them head-on.</p>"},{"name":"Ecco: The Tides of Time","year":1994,"developer":"Novotrade International, Inc.","url":"d#Ecco%20-%20The%20Tides%20of%20Time%20%28USA%29.zip","filesize":1229224,"score":7.7,"genres":"Action > Side view > 2D scrolling > Puzzle elements","desc":"<p>The followup to Ecco the Dolphin, in which Ecco successfully destroyed the Vortex. Unfortunately, it turns out that the Vortex Queen followed it to the Earth and eventually destroyed the Asterite. All the world's oceans are threatened, and actually already doomed.</p><p>In order to restore the Asterite and finally defeat the Vortex Queen, Ecco will have to confront once again the tides of time, which have split into two possible futures, the regular one and the dark one dominated by the Vortex Queen.</p><p><em>Ecco: The Tides of Time</em> features even better graphics than its predecessor, and introduces a new gameplay mode in which the camera follows the dolphin from behind instead of from the side.</p>"},{"name":"El Viento","year":1991,"developer":"Wolf Team","url":"d#El.Viento%20%28USA%29.zip","filesize":683973,"score":7.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform","desc":"<p>In 1930s New York, a dark cult plans the resurrection of their master, the Dark Prince Hastur, in order to control all of New York and the world. The mob is on their side in this, funding their dark projects and rituals needed to bring their dark master out into their world.</p><p>The only one that can stop them is a young girl named Annet... born of the cursed bloodline of Hastur, yet against his plans. Her only weapon: a mystic boomerang known as El Viento...</p><p>As Annet, you will do battle with the mob, navigating through Sewers, Caves and buildings, collecting bonus items along the way.</p>"},{"name":"Elemental Master","year":1990,"developer":"Technosoft Co., Ltd.","url":"d#Elemental%20Master%20%28USA%29.zip","filesize":406838,"score":7.4,"genres":"Action > Top-down > Anime / Manga > Shooter","desc":"<p><em>Elemental Master</em>'s gameplay is similar to a top-down space shooter (i.e Raptor &amp; Raiden), but what makes it unique is the fact you play as a human instead of space-ship.</p><p>There are different kinds of weapons which you can use. Like other games in the genre you also have tons of strange enemies to destroy.</p>"},{"name":"Eliminate Down (J)","year":1993,"developer":"Aprinet","url":"sega-mega-drive-genesis-20210106-213105/Sega%20-%20Mega%20Drive%20-%20Genesis%20%2820210106-213105%29.rar/ROMs%2FEliminate%20Down%20%28Japan%29.zip","filesize":1,"score":7.8,"genres":"Action > Side view > Shooter > Space flight > Sci-fi / futuristic","desc":"<p><em>Eliminate Down</em> is a horizontally-scrolling shooter similar in style to Thunder Force. The player has several weapons that can be freely switched (forward shot, back shot, and missile), and can also change the speed of the ship. Enemies come from all directions, and certain waves will drop powerups, including shields and weapon upgrades. The player needs to collect five upgrades in order to improve their weaponry, but the upgrade affects all three weapons.</p><p>The game includes eight stages, most of which include both a midboss and a boss at the end, and three difficulty settings. There is also a minigame similar to <em>Whack-a-Mole</em> where there is a grid of ship icons, and the player must hit the rotating ships.</p>"},{"name":"Elitserien 95","year":1994,"developer":"High Score Productions"},{"name":"Elitserien 96","year":1995,"developer":"High Score Productions"},{"name":"Escape 2042: The Truth Defenders","year":2017,"developer":"OrionSoft"},{"name":"ESPN Baseball Tonight","year":1994,"developer":"Stormfront Studios","url":"d#ESPN%20Baseball%20Tonight%20%28USA%29.zip","filesize":988535,"score":6.2,"genres":"Sports > Behind view > Baseball > Licensed","desc":"<p><em>ESPN Baseball Tonight</em> is a baseball game with both exhibition and playoff modes. Other modes included are both practice (both pitching and batting) and Home Run Derby modes. The game contains 28 real MLB teams but no actual players. Gameplay options include being able to turn errors on or off and to have assisted fielding on or off.</p><p>Gameplay has the behind the batter viewpoint, whether pitching or batting. One thing to note when fielding, the player must manually throw the ball back to the pitcher for the game to continue.</p><p>The Sega CD version is an update which includes the option for an 162 game season and has over 10 minutes of video highlights.</p>"},{"name":"ESPN National Hockey Night","year":1994,"developer":"Park Place Productions","url":"d#ESPN%20National%20Hockey%20Night%20%28USA%29%20%28Beta%29.zip","filesize":878820,"score":6.2,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p><em>ESPN National Hockey Night</em> was one of the many hockey games released back in the day. This one featured all the NHL teams for its time, but lacked an official players license.</p><p>It had four game modes to choose from: <em>Exhibition</em>, <em>Challenge</em>, <em>Playoff</em>, and <em>Season</em>. The game also features both a horizontal and vertical perspective of the ice, battery backup to save progress and also featured the voice of Bill Clement for play-by-play commentary.</p>"},{"name":"ESPN Speed World","year":1994,"developer":"Park Place Productions","url":"d#ESPN%20Speed%20World%20%28USA%29.zip","filesize":965907,"score":5.6,"genres":"Racing / Driving > Simulation > Behind view > Automobile > Licensed","desc":"<p><em>ESPN Speed World</em> is a generic racing game that is made to resemble NASCAR. The player is given a stock car and can tune the car from the angle of the spoiler, to the setting of the shocks, and up to the pressure of the tires.</p><p>There are three different types of speedways to race on: <em>Super Speedway</em>, <em>Short Track</em> and <em>Road Courses</em> with 5 different tracks for each to choose from. Players can choose to race against the computer that has all 23 other stock cars on the track at once or play head-to-head on a split screen against a friend.</p><p>It also featured realistic driving physics. While it didn't have a NASCAR license, it did have ESPN which broadcasted the races and had NASCAR analyst, Dr. Jerry Punch, who lent his voice to the game for the color commentary.</p>"},{"name":"ESPN Sunday Night NFL","year":1994,"developer":"Ringler Studios","url":"d#ESPN%20Sunday%20Night%20NFL%20%28USA%29.zip","filesize":930526,"score":5.9,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>ESPN Sunday Night NFL</em> was one of the many football games released back in the day. It features all 28 official NFL teams and their respective logos, but doesn't feature a license from the NFLPA, so there are no actual players names in the game.</p><p>There are four different game modes to choose from: <em>Playoffs</em>, <em>Single Game</em>, <em>Season</em> and another season mode that lets the player act out the 1994 NFL season schedule. It also had variable weather conditions that the players on the field would react to and a battery back-up to save games. It also featured Chris Berman, who not only graced the front cover but also gives commentary as well.</p>"},{"name":"ESWAT: City under Siege","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#ESWAT%20-%20City%20under%20Siege%20%28USA%2C%20Europe%29%20%28Rev%20A%29.zip","filesize":374956,"score":7.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Sci-fi / futuristic","desc":"<p>The city is besieged by wanted criminals, and as a police officer it is your duty to stop them. The first criminals in the wanted list can be stopped with your service weapon and some fast reactions, but once you're facing the toughest criminals in town you'll need to use the cyber suit, which provides additional protection and higher firepower.  You start off as a normal cop but after completing 2 levels you get to join the ESWAT (Enhanced Special Weapons and Tactics) division and gain access to their specialised armour.</p><p>Unlike other versions of this game, this Genesis cartridge doesn't follow the layout of the arcade game. The levels, rather than being linear, feature some platform elements, and the enemies in the first levels are no longer bank robbers or hit-men, but soldiers and robots instead. And the setting is no longer your typical American city, but a futuristic megalopolis.</p>"},{"name":"Eternal Champions","year":1993,"developer":"SEGA Interactive Development Division","url":"d#Eternal%20Champions%20%28USA%29.zip","filesize":1604406,"score":7.7,"genres":"Action > Side view > Fighting > Martial arts","desc":"<p>From various time periods of past, present and future, nine fighters killed in an unjust manner find themselves given a second chance for life.  An alien being, known only as the Eternal Champion, brings back the fighters into a competition for one reason: to find one among them worthy of being resurrected, giving them a chance to avert their death and tip the balance between good and evil.</p><p>The fighters range from different eras of Earth's History: Larcen, the cat burglar. Jetta, the circus acrobat. Blade, the futuristic bounty hunter. Midknight, the vampiric bio-chemist. Rax, the cyborg. Shadow, the corporate assassin. Slash, the neanderthal. Trident, a Atlantean warrior. And Xavier, a warlock and alchemist.</p><p>The game is a 2D one on one fighting title. Each character supports a large number of special moves and individual fighting styles. At the end of a match players have the option to unleash an \"Overkill\" on a defeated opponent, brutally killing the loser in a graphic manner, or the option to use the background itself for a stage kill.</p>"},{"name":"Evander Holyfield's \"Real Deal\" Boxing","year":1992,"developer":"Acme Interactive, Inc.","url":"d#Evander%20Holyfield%27s%20%27Real%20Deal%27%20Boxing%20%28World%29.zip","filesize":350894,"score":6.9,"genres":"Sports > Side view > Boxing > Licensed","desc":"<p><em>Evander Holyfield's \"Real Deal\" Boxing</em> is a boxing simulation. Holyfield is the only licensed boxer, the rest are fictitious. Rather than a fanciful approach like Mike Tyson's Punch-Out!!, the developers went for a more strategic simulation. The game is played from a pseudo-3D side view with moving around the ring handled by scrolling the backdrop and moving the ropes. A top down camera is shown at the top of the screen.</p><p>Players can either play a quick exhibition match or fight their way through the career mode, using a created boxer to work their way up the 30-boxer ranking list until they fight Holyfield himself. During character creation, players can choose the fighter's color of skin, trunks and hair, haircut, dominant hand and stats emphasis. Between matches, career mode offers various exercises to assign the boxer to improve his stats.</p><p>During the fights, besides an energy bar, the fighters have a head and a torso damage meter. This meters are images of their head and torso, which become gradually grey, from top to bottom, as they are hit. If one of these meters becomes totally grey, it will start blinking, warning that it the fighter takes some more punches on that area, he will loose the fight by TKO. Being knocked down tree times in a round also leads to a TKO. During the rounds' breaks, fighters regain strength as the girl with the round sign passes along their sides.</p><p>Fighters can perform three types of punches: jabs, hooks and uppers, which can be aimed at the opponent's head or torso. Fighters can also taunt their opponents. If by some reason the fighters avoid to fight, the spectators will start to hiss at them. To keep the spectators pleased, the fighters must keep punching each other on a regular basis.</p>"},{"name":"Ex-Mutants","year":1992,"developer":"Malibu Interactive","url":"d#Ex-Mutants%20%28USA%2C%20Europe%29.zip","filesize":557703,"score":6.6,"genres":"Action > Side view > Arcade > Fighting > Platform > Post-apocalyptic","desc":"<p>In the game you have to stop mutant Lord Sluggo. You and five of your comrades are not mutants as the everybody on the Earth has become and you know how to recreate the human race after the nuclear war. You have to acquire six genetically pure samples. All you need is to save your comrades from Sluggo, slashing with your battle axe through 11 levels of a wasteland that calls itself Sluggtown.</p>"},{"name":"Exile","year":1991,"developer":"Renovation Game","url":"d#Exile%20%28USA%29.zip","filesize":802531,"score":6.9,"genres":"Action > Role-playing (RPG) > Side view > Top-down > 2D scrolling > Anime / Manga > Platform > Fantasy","desc":"<p>After Sadler defeated the Caliph, he returned to his home village, greeted by his fellow assassins. A spy of the Crusaders has been spotted outside of the village; following his trail, Sadler encounters the powerful leader of the Knights Templar. Travelling together to different countries of the world, they try to find a mysterious holy artifact that can supposedly put an end to the religious wars.</p><p><em>Exile</em> is a sequel to XZR. Like its predecessor, it is an action role-playing game with platforming elements, set in a fictionalized version of the Middle East and other world regions in 13th century. Travel and exploration occur in the traditional overhead view of RPGs, while the battles and dungeons are side-scrolling mazes, similar to Wanderers from Ys. Experience points are awarded for defeating enemies. Leveling-up automatically raises Sadler's attributes. Sadler fights with swords and can also cast offensive and restorative spells. Weapons, armor and items can be bought and sold in towns.</p>"},{"name":"Exo Squad","year":1995,"developer":"Novotrade Software Kft.","url":"d#Exo%20Squad%20%28USA%29.zip","filesize":761212,"score":5.9,"genres":"Action > Behind view > Side view > 2D scrolling > Fighting > Platform > Shooter > Flight / aviation > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>Based on the American animated television series of the same name that ran between 1993 and 1994, this game puts the player in the mecha-like Exo-Frames of three pilots: Lt. J.T. Marsh, Sgt. Rita Torres, and Wolf Bronksy. Each pilot's levels have a distinct mechanic, ranging from After Burner-esque behind the shoulder fight action, to platforming, and side-scrolling beat-em-up gameplay.</p>"},{"name":"Exodus: Journey to the Promised Land","year":1993,"developer":"Wisdom Tree, Inc.","url":"d#Exodus%20-%20Journey%20to%20the%20Promised%20Land%20%28USA%29%20%28Unl%29.zip","filesize":400551,"score":6.1,"genres":"Action > Educational > Puzzle > Side view > 2D scrolling > Game show / trivia / quiz > Direct control > Religion","desc":"<p>In <em>Exodus</em> you need to guide Moses through 100 different levels in order to reach the promised land. The gameplay features an action/strategy part similar to Boulder Dash, and a question part. In the action part, you need to collect five question marks and enough Manna to open the exit of the maze-like screens. There are a variety of boulders, walls, dirt, and other obstacles in the way. Some obstacles can be destroyed when moses uses his staff to say the word of god, other obstacles can be pushed out of the way, and some you must find a way around. You need to be careful when navigating around the screens, if you cause any boulders to fall and they land on you a life is lost. Also wandering about are a variety of enemies which can be destroyed or avoided, but will cost you one life if you get caught. When you find all the question marks and manna you need, the exit appears and you can move on to the question phase. Here you will be asked five multiple choice questions about the book of Exodus. Answering the questions correctly will reward you with bonuses, such as extra lives.</p>"}]