[{"name":"F-117 Night Storm","year":1993,"developer":"Electronic Arts, Inc.","url":"d#F-117%20Night%20Storm%20%28USA%2C%20Europe%29.zip","filesize":1124258,"score":6.5,"genres":"Simulation > 1st-person > Flight / aviation > Vehicular combat","desc":"<p>This game allows the player to take control of an F-117A Stealth Fighter. The game is broken down into either an arcade or campaign mode.</p><p>In the arcade mode, the player can decide the number of enemy air and ground units, the environment, length of mission, and the difficulty level. This mode allows the player to hone their skills in order to prepare for the campaign mode. </p><p>The campaign mode is the main part of the game and contains 30 missions. The game includes nine theaters of combat such as training missions in the Nevada Desert, to the conflict in Panama, and also to the Gulf War. Each mission has a primary object that must be destroyed in order to advance to the next mission.</p>"},{"name":"F-15 Strike Eagle II","year":1993,"developer":"MPS Labs","url":"d#F-15%20Strike%20Eagle%20II%20%28USA%29.zip","filesize":429781,"score":7.5,"genres":"Simulation > 1st-person > Flight / aviation > Vehicular combat > Contemporary","desc":"<p>The second in the series features campaigns in Libya, the Persian Gulf, the Middle East and Vietnam, making for a total of 250,000 miles of potential action and danger. Primary and secondary aerial and ground-based targets must be destroyed on each of these. You are armed with a cannon, AMRAAM long-range air-to-air missile, Sidewinder short-range air-to-air missile, and the Maverick air-to-ground missile.</p><p>11 camera angles including internal and external views of the plane exist. To help new players there is a training mode, with options to disable crashes and automate take-off and landing. Enemy AI is responsive, but a targeting computer helps you take them out before they can do it to you. The game incorporates two \"Director's Modes\" which cut away from your cockpit to highlight special events occurring elsewhere in the game world, like enemy base launching fighters, SAM sites launching SAMs, and your missiles hitting the target.</p>"},{"name":"F-22 Interceptor","year":1991,"developer":"Lerner Research","url":"d#F-22%20Interceptor%20-%20Advanced%20Tactical%20Fighter%20%28USA%2C%20Europe%29%20%28F-202%29.zip","filesize":384315,"score":6.8,"genres":"Simulation > 1st-person > Flight / aviation > Vehicular combat","desc":"<p>This simulation puts you in the cockpit of the F-22. You can choose from 3 difficulty settings and fly strike missions in 4 theaters of war (United States, Iraq, Korea and Russia) with increasing difficulty. You can also challenge aces from each theater and design custom missions.To complete a mission, you usually have to destroy both ground and air targets, including several MiG types, helicopters and tanks in addition to ground structures. Use realistic weapons like Sidewinder and Maverick missiles.</p>"},{"name":"F1 Circus MD","year":1991,"developer":"Nihon Bussan Co., Ltd.","url":"d#F1%20Circus%20MD%20%28USA%29%20%28Proto%29%20%281991-12-28%29%20%28Sega%20Channel%29.zip","filesize":330984,"score":7.5,"genres":"Racing / Driving > Top-down > 2D scrolling > Arcade > Automobile > Track racing","desc":"<p><em>F1 Circus '91</em> is a Formula 1 simulation racing game. The series did not yet feature an official license, and so just like the first game it only features generic team and driver names. The game itself plays much the same, with the overhead race view and focus on car tuning and damage. The World Championship mode has of course returned, though the managerial Constructors mode is no longer present. There is also a Free Attack mode, where any course can be freely practiced; a Training mode, where special training courses can be raced on to learn the ins and outs of the game; and a Watch mode, where the player can choose a course and watch a demonstration race.</p>"},{"name":"F1 Triple Battle","year":1991,"developer":"Human Entertainment, Inc."},{"name":"F1: World Championship Edition","year":1995,"developer":"Peakstar Software","url":"d#F1%20-%20World%20Championship%20Edition%20%28USA%29%20%28Proto%201%29.zip","filesize":609360,"score":6.8,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Oceania","desc":"<p><em>F1 World Championship Edition</em> is a Formula 1 racing game with real teams and drivers from the 1994 season including Benetton, Ferrari, Williams, Jordan, Lotus, Minardi, Tyrrell &amp; McLaren. There are 16 circuits including the Monaco Grand Prix</p><p>The game includes a championship knockout and training mode. The SNES version offers a few more teams. These are: Sauber, Arrows grand prix, Larrousse and Ligier.It is the sequel to the game Formula One (1993).</p>"},{"name":"Faery Tale Adventure, The","year":1991,"developer":"MicroIllusions","url":"d#Faery%20Tale%20Adventure%2C%20The%20%28USA%2C%20Europe%29.zip","filesize":281916,"score":7.4,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Real-time > Action RPG > Fantasy","desc":"<p>Once upon a time, the people of Holm lived happily and peacefully, protected by a powerful talisman. But one day, their land was attacked, and the talisman stolen. A brave warrior went out to investigate the talisman's disappearance, but returned mortally wounded. Before he died, he told his three sons that the talisman was stolen by the evil Necromancer, and must be retrieved at all costs...</p><p><em>The Faery Tale Adventure</em> is a role-playing game in which the player can assume control of any of the three brothers - Julian, Philip, or Kevin. Each of the three has his own strengths: Julian is the archetypal melee fighter, Philip has high luck and intelligence, while Kevin is known for his kindness. Should the player fail while controlling one of the brothers, the next one will replace him. Each brother will be revived a few times when vanquished by an enemy, until his luck runs out, at which point he will die permanently.</p><p>Much of the gameplay is dedicated to exploring the large world, interacting with non-playable characters and building up the brothers' combat abilities by participating in battles. The fastest-growing parameter is bravery, which is comparable to experience points and strength combined. Each defeated enemy yields bravery points; as it grows, so does the hero's vitality (maximum hit points), albeit at a slower rate. Combat system is rather simple and is done in action style, with the player pressing a key or a mouse button while navigating the protagonist towards or away from the enemy. Predating  Ultima V, the game has a day and night cycle, and the main character has to eat and rest.</p><p><em>The Faery Tale Adventure</em> is notable for having a very vast world, usually considered the largest ever created for a video game at the time of its release. Players can explore approximately 17,000 screens of terrain. The world is also interconnected, i.e. there are no transitions between different types of areas. Items can be dropped by enemies as well as found anywhere in the game's world. There is also NPC interaction and quests the protagonist can undertake.</p>"},{"name":"Family Feud","year":1993,"developer":"Imagineering Inc.","url":"d#Family%20Feud%20%28USA%29.zip","filesize":315636,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Turn-based > Game show / trivia / quiz > Licensed","desc":"<p>This version differs from others, with over 4,000 survey questions. The rules conforms to the shows, divided into rounds until a family reaches 300 points and the \"Three Strikes\" rule.  It also featured the new \"Bulls Eye Round\" that was introduced to the show at the time.</p><p>To answer questions, the player uses the D-pad to move a cursor and pressing the required button in order to select that letter and spell out their answer.  Players can also battle each other as well as customize their family to their liking, from their appearance, hobbies, intelligence and occupations and customize the rules to suit the player.</p>"},{"name":"Fantasia","year":1991,"developer":"Infogrames Europe SA","url":"d#Fantasia%20%28World%29.zip","filesize":282072,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Fantasia</em> takes place in the dream world of Mickey Mouse as the Sorcerer's Apprentice.</p><p>Mickey must find the missing musical notes scattered about in four imaginary worlds. The Water World, Earth World, Air World and Fire World are filled with magical creatures such as marching brooms, skipping mushrooms, jumping cactus, flying horses, dancing hippos and many more.</p><p>The music in the worlds is straight from the movie, including pieces by Bach, Mussorgsky, Beethoven, Tchaikovsky, Stravinsky, Dukas and Ponchielli.</p><p>Mickey must collect special items to keep up his strength and earn bonus points. Spell books, stars, crystal balls, potions and dinosaur eggs help him along the way. Enemies are dispatched by bouncing on them or casting small or large spells. If Mickey finds a wooden door he is led to a bonus area where he can collect many magical items.</p><p>At the end of each level, Mickey takes the notes he's found back to the orchestra's conductor who will send him back into the world to keep searching if he hasn't found enough of them or gained enough points.</p>"},{"name":"Fantastic Dizzy","year":1993,"developer":"The Codemasters Software Company Limited","url":"d#Fantastic%20Dizzy%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":406444,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>The evil wizard Zaks has cast a spell on the peaceful Yolkfolk, and while many fell under his spell, others have other problems to deal with, including Dizzy, who saw his girlfriend Daisy kidnapped and taken hostage by Zaks, and it's up to him to restore the Yolkfolk to normal and rescue Daisy from the top of the Cloud Castle's tower.</p><p>The most technically-advanced of Dizzy's adventure games in many ways, it was the only one to feature actual scrolling rather than a flick-screen system, the only one not to be released for the 8 bit computers the character originated on, the only one to originate on a console, as well as featuring many mini-games, such as <em>Bubble Dizzy</em> and an <em>Operation Wolf</em> clone. </p><p>Gameplay involves walking Dizzy through the levels, picking up objects and using them to solve simple puzzles. There are plenty of tests of arcade skill along the way as well, as gaps must be jumped and baddies avoided - starting with a limited number of lives, the player can earn more by completing Theodore's puzzle. Before rescuing Daisy the player must capture all stars that unlock the gates of the tower.</p><p>This game was later re-released on the NES with an updated Aladdin cart version. Updates include the number of collectible stars have increased from 100 stars to 250 stars, Dizzy now walks at a brisker pace, there are small terrain differences, some item placements have been rearranged, and the inventory system has become more simplified.</p>"},{"name":"Fatal Fury","year":1993,"developer":"SNK Corporation","url":"d#Fatal%20Fury%20%28USA%29.zip","filesize":842468,"score":6.9,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p>Southtown City plays host to the King of Fighters Tournament. Andy &amp; Terry Bogard take part in the tournament cause winning the tournament is the only way they can defeat Geese Howard. Geese Howard controls Southtown City and killed their father several years ago. Also taking part is Joe Higashi, a Japanese kickboxer. Select either Joe, Andy or Terry, visit several locations in Southtown City and win that tournament!  </p><p><em>Fatal Fury</em> is a 2D fighter and is the first game in a series of one-on-one fighting games by SNK. It's a conversion of the original <em>Fatal Fury</em> arcade game. This first game does not yet feature the series' trademark pseudo 3D mode (which allows you to move between the foreground &amp; background while fighting). Includes a two-player vs. mode.</p>"},{"name":"Fatal Fury 2","year":1994,"developer":"SNK Corporation","url":"d#Fatal%20Fury%202%20%28USA%2C%20Korea%29.zip","filesize":1789188,"score":7.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Martial arts","desc":"<p>Again, the Lone Wolves return! </p><p>Geese Howard may have been defeated, but that doesn't mean all is peaceful. A new opponent, Wolfgang Krauser, has come forth to begin a new Fatal Fury tournament. The Lone Wolves return, with new faces amongst them. Only one can be declared the winner though. </p><p>The player can choose one from eight playable characters: Terry Bogard, Andy Bogard, Joe Higashi, Big Bear, Jubei Yamada, Cheng Sinzan, Kim Kaphwan, and Mai Shiranui. The game has four bosses. The combat system is more complex than in the first game, supporting four keys to attack. The two-plane (foreground and background) battle system has been retained, but now, the player can move freely to the adjacent plane - just by pressing the Light Punch and Light Kick buttons simultaneously. The main principle remains the same - beat your opponent in a duel with fists and kicks.</p>"},{"name":"Fatal Labyrinth","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Fatal%20Labyrinth%20%28USA%2C%20Europe%29.zip","filesize":103620,"score":5.7,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Turn-based > Action RPG > Roguelike > Fantasy","desc":"<p>Dragonia, the castle of doom, has come upon the world and its minions have stolen the Holy Goblet. Without it, the world will be in darkness forever. You play as Trykaar, who must enter the castle and traverse its thirty levels to retrieve the Holy Goblet. There is no other storyline; its dungeons are generated randomly each time you play, like in Rogue-type games. Much like Nethack or other Rogue games, the game is turn-based.</p>"},{"name":"Fatal Rewind","year":1991,"developer":"Raising Hell Software","url":"d#Fatal%20Rewind%20%28USA%2C%20Europe%29.zip","filesize":233714,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Sci-fi / futuristic","desc":"<p>This is a vertical platformer with horizontal wrap-around. For the entertainment of the futuristic masses, you play a criminal that has been inserted into a mechanical body with the promise that if you succeed in surviving through all the levels (there are many and they are hard), you will be set free.   You start each level at the bottom, near pooling liquid which will soon rise, at your immediate peril. Navigate the level from bottom to the exit at the top before the liquid rises and kills you. There are many other foes that fly around, causing you damage and basically annoying you to spit.   Most levels must be navigated through a series of keyed gates, doors, or portals. These shaped keys are scattered around the map and must by picked up and used only on the gates they match individually.   Twist: You can only carry one special weapon (triple shot, laser beam, or vertical shot) and one tool (key, liquid-freeze, or a red herring) at a time.   This game requires a lot of memorization of enemy movement patterns and optimum routes.   A unique feature is that when you die, you can watch a replay and take over at any point to continue your game.   You can also hit the HELP button at the start of each level to view a map, helping you plan your route.</p>"},{"name":"Fatal Smarties","year":2016,"developer":""},{"name":"Férias Frustradas do Pica-Pau","year":1996,"developer":"Tec Toy Indústria de Brinquedos S.A."},{"name":"Ferrari Grand Prix Challenge","year":1992,"developer":"Aisystem Tokyo","url":"d#Ferrari%20Grand%20Prix%20Challenge%20%28USA%29.zip","filesize":411627,"score":6.5,"genres":"Racing / Driving > Simulation > 1st-person > Automobile > Track racing > Vehicle simulator > Oceania > Licensed","desc":"<p>Following F1 Grand Prix Nakajima Satoru, Varie produced another racing simulation using the license. This time the racing is from a first person view aping Super Monaco Grand Prix. The car setup can be modified before you take to the track</p><p>There is a Time Attack mode, allowing you to go for as fast a laptime as possible on any of the game's 20 circuits (which include the 16 tracks of the 1992 Formula 1 season), as well as a full season mode, with qualifying and the race itself. Weather can be customised in the Time Attack mode but is randomly chosen in Grand Prix mode, while you can only choose one of the D-tier teams (the 4 weakest of the 16) in grand Prix mode, but can drive for McLaren, Williams et al in Time Attack.</p>"},{"name":"Fido Dido","year":1993,"developer":"Teeny Weeny Games","url":"d#Fido%20Dido%20%28USA%29%20%28Proto%29.zip","filesize":471948,"score":"","genres":"","desc":""},{"name":"FIFA International Soccer","year":1993,"developer":"Electronic Arts Canada","url":"d#FIFA%20International%20Soccer%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":986535,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Isometric > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>The game that started the best-selling series licensed by football's world governing body, this first installment in the long running series used a dimetric (colloquially known as \"isometric\") viewpoint, previously unusual in football games but quickly imitated by several titles. The televisual presentation, one of the unique points of the early EA Sports titles, with hosts introducing the matches, was another thing making the game stand out from a market dominated by <em>Sensible Soccer</em> and <em>Kick Off</em> games.</p><p>Based on international teams (with fictional player names), their abilities in each skill area rated out of 10 to give the player an overall impression of how good they are. The options available follow the standard set: fouls and offsides can be toggled on and off, the match length can be set, and if the timer operates continuously, or only while the ball is in play. Gameplay privileges quick runs, short passes and blistering shots outside the penalty box, and set pieces are controlled by moving a box into the target area for the ball, and then passed, lobbed or kicked directly. On the tactical side, formations can be selected, with 5 different strategies also available (although not all of these combinations make sense) as can the team Coverage - the areas which defenders, midfielders and strikers cover.</p>"},{"name":"FIFA Soccer 95","year":1994,"developer":"Extended Play Productions","url":"d#FIFA%20Soccer%2095%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":1163465,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Isometric > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>After the first game proved to be a worldwide success, EA developed this sequel exclusively for Sega's 16-bit console. The biggest change from <em>FIFA International Soccer</em> are obviously the dozens of club teams from England, France, Germany, Italy, The Netherlands, United States, Spain and Brazil, taking the team number tally to over 200. This also increased the number of competitions, with each country having it's own League, Tournament and Playoff. Also new, a battery backup allowed to save up to four competitions in the cartridge, replacing passwords. For those who want to settle things the fast way, a Penalty Shootout training mode was added.</p><p>While graphically the game only received minor changes to the isometric sprite engine, gameplay feature new moves such as volley kicks and more detailed headers (now more effective), as well as general controls being more responsive facilitating passing play, and goalkeepers now are smarter when chasing balls. Set pieces also received a new format, and instead of just kicking the ball the player can choose to play a predefined set piece.</p>"},{"name":"FIFA Soccer 96","year":1995,"developer":"Electronic Arts Canada","url":"d#FIFA%20Soccer%2096%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.zip","filesize":1132681,"score":7.6,"genres":"Simulation > Sports > Diagonal-down > 2D scrolling > Isometric > Managerial / business simulation > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p><em>FIFA Soccer 96</em> is a football (soccer) simulation. The game includes eleven leagues from all around the world, ranging from the unknown players of the Malaysian league to the celebrated stars of the English and Italian leagues. 59 International teams are also featured, and it's possible to match the teams you want to against each other through friendlies, or you can also choose to play domestic tournaments or International ones such as the World Cup. If you're not satisfied with the composition of the various teams, you can create your own dream team through the custom team creator.</p><p>British commentator John Motson comments all the incidents and happenings on the pitch in real-time. The ambient commentary is varied, and systems with more than the minimum memory level get extra commentary phrases. The Virtual Stadium technology has numerous pre-defined camera angles.</p>"},{"name":"FIFA Soccer 97","year":1996,"developer":"Electronic Arts Canada","url":"d#FIFA%20Soccer%2097%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.zip","filesize":1101519,"score":7.3,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>This iteration of the <em>FIFA</em> lineage includes commentary from John Motson with summaries from Andy Gray, with the between-match sections covered by Des Lynam. All player moves are from David Ginola using the MotionBlending technology. Full interactive replays are included.</p><p>You can play a league or cup tournament, and practice your skills before playing. The game can be tailored to action or simulation style, with fouls, injuries and offsides available to toggle on or off. This version also includes a 6 vs 6 indoor play mode, and various multiplayer options</p>"},{"name":"FIFA: Road to World Cup 98","year":1997,"developer":"XYZ Productions","url":"d#FIFA%2098%20-%20Road%20to%20World%20Cup%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%2CSv%29.zip","filesize":1089548,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>The late-1997 edition of <em>FIFA</em> was heavily tied in with the qualifying procedure for the 1998 World Cup. In the <em>Road to the World Cup</em> mode, you take a team from first qualification through to the main tournament, using the varying systems in different parts of the world. The game features 16 distinct outdoor stadia. The League play features 189 clubs and 11 leagues. Each team has specific crowd chants incorporated into the ambient sound.</p><p>The action is faster than in previous versions, and AI has been expanded. Players have distinct facial feature and hair styles. Each match is introduced by Des Lynam and commentated on by John Motson and former Scotland international Andy Gray.</p>"},{"name":"Fighting Masters","year":1991,"developer":"Aicom Corporation","url":"d#Fighting%20Masters%20%28USA%29.zip","filesize":228493,"score":5.4,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p>A giant red sun is about to go supernova in a few hours and the blast will affect many star systems in the galaxy. An omnipotent race known as Primaries offers to save the inhabitants of one of the twelve star systems. Each star system sends a warrior to compete in a tournament to preserve their star system.</p><p><em>Fighting Masters</em> is an early one-on-one fighter with limited controls. Three buttons are available in the game: block, attack and jump. The D-pad cannot be used to jump directly. Instead, the player has to walk in a certain direction and then press the jump key to perform it. Although there are no combos available, the attack key offers different moves and a few special moves are available as well. Most of the fighting leads to holds from which massive damage can be inflicted by dropping the opponent or throwing him against the wall. Twelve different fighters have available. Aside from the moves, some are also faster or come with more powerful attacks. The game modes include matches for one or two players and a watch mode to view a computer-computer fight.</p>"},{"name":"Final Blow","year":1990,"developer":"Taito Corporation"},{"name":"Final Zone","year":1990,"developer":"Wolf Team","url":"d#FZ%20Senki%20Axis%20~%20Final%20Zone%20%28Japan%2C%20USA%29.zip","filesize":281186,"score":6,"genres":"Action > Isometric > Mecha / giant robot > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>It is 100 years into the future. Nuclear weapons, missiles and other weapons of mass destruction are banned, but a new piece of military hardware is about to shape the future. The N.A.P. (New Age Power-Suit), is the newest weapon, a mechanical tank, able to destroy anything in its path. You play as a soldier of the El Shiria Military's \"Undead\" unit named Howie Bowie (no joke) as you are about to go on a urgent mission to destroy your enemies, The Bloody Axis, before they can strike at your nation.</p><p>Using the newest N.A.P., the K-19 Phantom, you are dispatched to destroy them before it is too late. You can equip your N.A.P. with up to 14 different weapons including flamethrowers and landmines and has seven stages, fighting your way on the streets, through deserts and up to the Axis HQ and finally a mech-to-mech battle with the enemy.</p>"},{"name":"Fire Shark","year":1990,"developer":"Toaplan Co., Ltd.","url":"d#Fire%20Shark%20%28USA%29.zip","filesize":197595,"score":7.4,"genres":"Action > Top-down > Shooter > Oceania","desc":"<p><em>Fire Shark</em> takes place around a small island in the South Pacific. It is a continuously-scrolling aerial shooter with a top-down view. Your World War II era biplane has been modified to shoot lasers and drop powerful bombs. </p><p>There are ten levels in the game in which you will face aerial, aquatic, and ground enemies. They all fire scores of missiles at you in an attempt to knock you from the sky. </p><p>In between levels, your plane will land on a runway for refueling and maintenance. You will receive bonus points for the number of bombs left in your hold and the number of lightning bolt icons you picked up in the prior level.</p><p>There are also many power-ups available in each level. Slow-moving blimps contain a power-up icon which is revealed after the zeppelin explodes. Other icons appear when various other enemies or buildings are destroyed. These power-ups will float around the screen for several seconds. Grabbing them with your plane earns you a weapon upgrade or bonus points.</p><p>The standard weapons are the bomb and the Wide Shot. As power-ups are obtained the number of shots per blast can increase up to 16. The Wide Shot is a comparatively weak weapon that usually requires multiple hits to take an enemy down.</p><p>The Shark Beam is a green laser that fires in a spiral pattern and the strongest weapon of all is the Super Fire. It will fire continuously while the fire button is held. Power-ups increase its beam count to 4.</p>"},{"name":"Fix-It Felix Jr.","year":2013,"developer":"Airwalk Studios","url":"d#Fix%20It%20Felix%20Jr..zip","filesize":17912,"score":"","genres":"Action > Side view > Arcade > Platform > Direct control > Fantasy > Fangame","desc":"<p><em>Fix-It Felix Jr.</em> is a homebrew game that presents itself as a port of the fictional 1984 game of the same title by the fictional TobiKomi Corporation from the 2012 animated Disney movie <em>Wreck-it Ralph</em>. The gameplay draws inspiration from titles like Donkey Kong and Wrecking Crew.</p><p>At the start of the game a mad Ralph is awoken when his stump is moved for the construction of a large apartment building called Niceland. Ralph goes to the building and smashes its windows. It is now up to Felix it to fix that. The building consists of several levels that are presented as fixed, single screen. At the start of the level Felix has 45 seconds to fix all windows on three floors. He can move freely and jumps up or moves down. Meanwhile Ralph moves around on the top level and drops bricks that hurt Felix, who starts with three lives. Every hit removes one.</p><p>Points are scored by fixing the windows with bonus points for the remaining time. When done the game moves to a new screen at a higher level. Gradually new elements are introduced such as birds that fly in a horizontal line and appear from the side of the screen. The game keeps track of the high score and the game can also be played in a Marathon mode. The game is completed when five levels all cleared. Felix then receives a medal at the top of the building and the game is restarted with a higher speed, with the score kept.</p><p>The game was released on a cartridge in two small print runs. In the second run some bugs were fixed. It is not identical to the game of the same name released in the same year by Future Driver.</p>"},{"name":"Fix-It Felix Jr.","year":2013,"developer":"Future Driver","url":"d#Fix%20It%20Felix%20Jr..zip","filesize":17912,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control > Fantasy > Fangame","desc":"<p><em>Fix-It Felix Jr.</em> is a homebrew game that presents itself as a port of the fictional 1984 game of the same title by the fictional TobiKomi Corporation from the 2012 animated Disney movie <em>Wreck-it Ralph</em>. The gameplay draws inspiration from titles like Donkey Kong and Wrecking Crew.</p><p>Ralph is on the Niceland apartment building where he has smashed its windows. It is now up to Felix it to fix that. The building consists of several floors with vertical, 2D scrolling as Felix moves up. Felix needs to fix all the windows without time pressure. He can move freely and jumps up or moves down. Meanwhile Ralph moves around on the top level and drops bricks that hurt Felix, who starts with three lives. Every hit removes one. When Felix gets too close, Ralph moves higher until the top of the building is reached.</p><p>200 points are scored for each fixed window and the game keeps track of the high scores. There are also birds that fly in a horizontal line and appear from the side of the screen. Felix receives a medal at the top of the building and then the residents throw off Ralph, which ends the game.</p><p>It is not identical to the game of the same name released in the same year by Airwalk Studios.</p>"},{"name":"Flashback: The Quest for Identity","year":1993,"developer":"Delphine Software International","url":"d#Flashback%20-%20The%20Quest%20for%20Identity%20%28USA%29%20%28En%2CFr%29.zip","filesize":983555,"score":8.1,"genres":"Action > Side view > Fixed / flip-screen > Platform > Puzzle elements > Shooter > Cyberpunk / dark sci-fi","desc":"<p>The year is 2142. The player takes control of Conrad B. Hart, a man who has lost his memory. After barely escaping from hostile aliens, Conrad's bike crashes on an unknown planet. Conrad finds himself in the jungle, and from that moment on his quest for survival and his lost identity begins.</p><p><em>Flashback: The Quest for Identity</em> incorporates elements of platforming, shooting, and problem-solving. The game can be described as a \"cinematic platformer\" (commonly referred to as  Prince of Persia-style), following a design philosophy that was also manifested in Delphine Software's previous work,  Another World. Compared to that game, <em>Flashback</em> focuses more on platforming and exploration of large levels.</p><p>While a large bulk of the gameplay is dedicated to running, jumping, and shooting enemies, there is also a considerable exploration element in the game, as well as some puzzle-solving. The player navigates Conrad through platform structures, performing various moves. It is possible to simply jump or do a longer run-and-jump, run, climb, hang off ledges, and pick up objects lying on the ground. </p><p>To defend himself, Conrad can shoot enemies with his gun and also use various objects (such as stones) to harm or distract them. Crouching and rolling are possible (and often essential) moves that can be executed during combat. The gun has unlimited ammunition; however, shields that Conrad uses to protect himself from attacks are depleted when he is hit and can be recharged at special stations. Though most environments in the game are hostile, there are a few locations that are devoid of enemies. The player is usually required to talk to characters, gather information, and complete tasks in an adventure-like fashion in these areas. </p><p>Most of the versions utilize cutscenes with polygonal vector graphics. The CD versions replace those with pre-rendered 3D animations. The Sega CD version also features voice-overs.</p>"},{"name":"Flicky","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Flicky%20%28USA%2C%20Europe%29.zip","filesize":43408,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>A female blue jay, named Flicky, must collect her chicks and lead them safely  back to their nest, while they are chased by two cats. The cats make her chicks wandering off and try to eat her!Each level offers about a dozen objects like watering cans, hammers, and cups, to throw at and knock out the cats.The next level starts when all chicks are returned home safely.</p>"},{"name":"Flink","year":1994,"developer":"Psygnosis Limited","url":"d#Flink%20%28U%29.zip","filesize":790045,"score":7.7,"genres":"Action > Side view > Platform > Puzzle elements > Fantasy","desc":"<p><em>Flink</em> is a jump-'n-run game set in the fantasy world of Imagica. The evil wizard Wicked Wainwright has captured the four elders and it is up to Flink, a wizard's apprentice, to set them free and defeat Wicked Wainwright.</p><p>Apart from the usual platformer elements, the game has a unique feature: Flink's ability to create spells. Whenever the game is paused, Flink can combine three ingredients to create a spell. Ingredients can be collected throughout the game. They are usually carried around by a certain type of enemy or hidden in treasure chests. There are ten different spells, the \"recipes\" which are contained in scrolls that are given to Flink by rescued elders or found within certain levels. The spells include different attack spells (for example a demon that accompanies Flink and attacks his enemies), a shield spell, a shrink spell, a quick grow spell that lets certain plants grow so that Flink can reach new areas of a level, magic keys that open locked treasure chests and more. Casting spells uses up magic energy that can be replenished by collecting magic bottles or defeating enemies. Similar to the Sonic games, when Flink is hit, he looses all of his magic energy and has only limited time to pick it up again. If he is hit while having no magic energy, he loses a life.</p>"},{"name":"Flintstones, The","year":1993,"developer":"Taito Corporation","url":"d#Flintstones%2C%20The%20%28USA%29%20%28Taito%29.zip","filesize":326748,"score":7.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Prehistoric > Licensed","desc":"<p>This is a platform game based on the famous Flintstones series. The game features many original Flintstones characters, such as Fred, Wilma, Barney, and others. Instead of the usual \"save the princess\" or \"liberate the world\" kinds of a plot, \"The Flintstones\" is mainly based on small quests: Fred has to retrieve a lost item, etc. The large levels are divided into smaller stages. In the end of each level there is a boss battle. The gameplay involves mostly jumping and hitting the enemies on the heads with a club. The health is measured by hearts. During the game Fred will find many useful items, including some that will increase his health level.</p>"},{"name":"Foreman for Real","year":1995,"developer":"Software Creations Ltd.","url":"d#Foreman%20for%20Real%20%28World%29.zip","filesize":819347,"score":5.7,"genres":"Sports > Behind view > Boxing > Licensed","desc":"<p>Before marketing fat-reducing grills, boxing legend George Foreman endorsed this boxing game with a 3rd-person view similar to Punch Out. A full range of punches and jabs are available, with full round-by-round scoring from the judges. You can choose from 3-12 rounds, and there are 2 camera views as well as an automatic switch option.</p><p>You can play simple exhibition matches or tournaments, or launch into a career mode. In this you start at the bottom of the world rankings, and must reach the top by beating the game's players, who other than George are all fictitious boxers with varying strengths and weaknesses. The coach gives advice before each fight to help highlight weaknesses in your play. There are passwords for each round.</p>"},{"name":"Forgotten Worlds","year":1989,"developer":"SEGA Corporation","url":"d#Forgotten%20Worlds%20%28World%29%20%28Rev%20A%29.zip","filesize":385941,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Forgotten Worlds</em> features two characters known as The Nameless Ones, who both look like Arnold Schwarzenegger, one even has a mohawk. It's their job to rid the planet of the attacking aliens. </p><p>Guiding your character around the screen as they fly with jet-packs, guns on full auto, you control a satellite which you rotate around your character for the direction in which your gun is firing. At the end of each level is a boss which needs to be killed to progress.</p><p>Enemies that have been killed drop money. At the end of every level is a shop where you can buy weapons, armour, items and first-aid packs.</p>"},{"name":"Formula One","year":1993,"developer":"Lankhor","url":"d#Formula%20One%20%28USA%29.zip","filesize":450342,"score":7.5,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Oceania > Licensed","desc":"<p><em>F1</em> is an Official Formula One Racing Game. There are two modes of play available: \"Arcade\", \"Grand Prix\". In both of these modes you complete a certain number of laps (4, 8, or 12) and select which circuit that you want to race on. The circuits include San Marino, France, Britain, Germany, Italy, Portugal, Japan, and Australia. Some circuits are easy, while some are difficult. </p><p>There are slight differences between the two modes. For instance, \"Arcade\" allows you to select the circuit in any order that you like, whereas \"Grand Prix\" only allows you to fine-tune your car before starting a race. You also need to race a circuit in the order that they appear on the circuit selection screen, but you can skip a track if you want. </p><p><em>F1</em> is a 1-2 player game, meaning that if you have another player handy, you can compete against each other.</p>"},{"name":"Frank Thomas Big Hurt Baseball","year":1995,"developer":"Iguana UK","url":"d#Frank%20Thomas%20Big%20Hurt%20Baseball%20%28USA%2C%20Europe%29.zip","filesize":1848493,"score":6.5,"genres":"Simulation > Sports > Behind view > Diagonal-down > 2D scrolling > Baseball > Licensed","desc":"<p>Baseball player Frank Thomas licensed one of the first baseball games to use motion-captured 3D graphics and multiple camera angles. 28 stadia have been rendered in 3D, and each has its own visible and significant differences. </p><p>There are 6 distinct game modes, allowing for single exhibition matches as well as full seasons on the playoffs. There is also a Home Run Derby mode, allowing the player to pelt the ball out of the ground for points. </p><p>You can choose pitchers and batters, based on their statistics and form. Bowling options are set to define the delivery, with fastballs and curveballs as well as more precise setting of pace and height. Fielding is optional - it's best to leave this to the computer at first You can always alter the infield and outfield depth and shift.</p>"},{"name":"Frog Feast","year":2006,"developer":"Rastersoft"},{"name":"Frogger","year":1998,"developer":"Konami Industry Co. Ltd.","url":"d#Frogger%20%28USA%29.zip","filesize":28410,"score":7.5,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Direct control","desc":"<p>Your task in this arcade game is to guide a frog across a treacherous road and river, and to safety at the top of the screen. Both these sections are fraught with a variety of hazards, each of which will kill the frog and cost you a life if contact is made.</p><p>The road is full of cars and trucks, at variable speeds. The river water itself is fatal, as are the snakes which hover within on later levels. Frogger must use the arrangement of logs, turtles (which are only there for a short time) and alligators (but stay away from their faces), and then jump into one of the open home-cells, ideally one containing a fly for extra points. Once all holes have been filled, you move onto the next, harder, level.</p>"},{"name":"Fun 'N Games","year":1993,"developer":"Leland Interactive Media","url":"d#Fun%20%27n%27%20Games%20%28USA%29.zip","filesize":562372,"score":5.6,"genres":"Action > 1st-person > Top-down > Shooter > Sci-fi / futuristic","desc":"<p><em>Fun 'N Games</em> presents a mixture of games and applications. The main menu is divided into four sections:* <strong>Paint</strong>  </p><p>A paint program that offers different tools and brushes, a few pre-made backgrounds and objects as well as the option to import figures that were created in the sub-games Stylin' Stuff and mix 'n match.</p><ul><li><p><strong>Games</strong>  </p><ul><li>Mouse Maze: A Pac-Man-clone in which the player guides a mouse through a top-down labyrinth. To complete a level, all cheese symbol have to be collected while cats have to be avoided. Collecting a bone temporarily transforms the mouse into a dog that can kill the cats.</li><li>Space Lazer: A shooter seen from the cockpit of a space-ship. The player controls a crosshair and has to shoot increasingly difficult enemies.</li><li>Whack a Clown: This game is exclusive to the Genesis Version and plays like 'Whac-a-Mole' only with clowns instead of moles.  </li><li><strong>Music</strong>  </li></ul></li></ul><p>Songs can be composed by choosing from several instruments and putting notes onto a stave. It is also possible to add sound effects (animal noises and others) or edit provided songs.</p><ul><li><strong>Style</strong>  </li></ul><p>This section contains two mini-games:    + Stylin' Stuff: Here, the player can edit the sprite of a woman by selecting different clothes, hats or haircuts.    + Mix 'n match: Sprites can be created by putting together different heads, torso, and legs.</p>"},{"name":"Fun Car Rally","year":1992,"developer":"Leland Interactive Media","url":"d#Fun%20Car%20Rally%20%28USA%29%20%28Proto%29.zip","filesize":237594,"score":"","genres":"","desc":""},{"name":"Funny World & Balloon Boy","year":1993,"developer":"AV artisan","url":"d#Funny%20World%20%26%20Balloon%20Boy%20%28USA%29%20%28Unl%29.zip","filesize":186526,"score":"","genres":"Action > Compilation > 1st-person > Side view > Fixed / flip-screen > Arcade > Shooter","desc":"<p><em>Funny World &amp; Balloon Boy</em> is an unlicensed two-in-one cartridge containing two simple games:</p><p><em>Funny World</em> is an action game where the player must shoot strange animals as they move across the screen. On each stage a set number of \"funnys\" will cross the screen, and the player must shoot a certain number of them before they can safely reach the other side. To make things harder, some will walk, some will run, and some will move erratically; from time to time a female funny will cross the screen, which if shot will cause the player to lose a life. They player also has a certain number of boulders they can drop, which will hit any funny on the screen that may be out of the player's range. If enough funnys are hit, the player moves on to the next stage.</p><p><em>Balloon Boy</em> is an action game where the player controls a boy at the bottom of the screen who must shoot at balloons floating across the top. When shot, the balloons will release either a trap or an item, and the boy must collect the items while avoiding the traps. If all the balloons are destroyed before the time runs out, the player moves on to the next stage.</p>"},{"name":"Fushigi no Umi no Nadia","year":1991,"developer":"Namco Limited"},{"name":"FX·Unit Yuki","year":2019,"developer":"SaruPro"}]