[{"name":"G-Loc: Air Battle","year":1991,"developer":"SEGA-AM2 Co., LTD.","url":"d#G-LOC%20-%20Air%20Battle%20%28World%29.zip","filesize":501819,"score":6.1,"genres":"Action > 1st-person > Behind view > Arcade > Flight / aviation > Vehicular combat","desc":"<p>The Citizens Defence Force does not trust the United Nations to keep a troubled 21st century world at peace. It confiscates a horde of planes and warships, and as a UN loyalist, it is your job to shoot them down. Solving starvation and disease can wait, apparently.</p><p>The game is split into 8 stages, which are split into sub-stages over land and sea, each of which has a strict time limit, and a target number of planes to shoot down. They take place from behind your plane, which can be controlled with ‘up’ referring to ‘climb’ or ‘dive’, depending on player preference. You are armed with 10 missiles as well as standard weapons. The plane can survive a few hits, so watch the damage report as it goes from red to black. </p><p>Fail to complete a section in the time limit and you use up a continue, but the amount of planes previously shot down is not reset, making the second attempt easier Chase HQ style. As you destroy enemies you gain access to better planes, and the rank reported at the end of the game improves – this is also dependent on the skill level you play at.</p>"},{"name":"Gadget Twins","year":1992,"developer":"Imagitec Design Inc.","url":"d#Gadget%20Twins%20%28USA%29.zip","filesize":404174,"score":"","genres":"Action > Side view > 2D scrolling > Shooter > Flight / aviation","desc":"<p>Late one night, the malevolent Thump enters the Gadget Kingdom's castle and steals the Gadget King's gem. The king wakes up the next morning to find that his gem was stolen. The king then summons Bop and Bump to reclaim his stolen possession from Thump.</p><p>Gameplay consists of flying through six air and water levels: Gadget Bay, Zeppelin Attack, The Lost City, Sub Attack, The Crystal Lake and Thump's World. Although the game continually scrolls throughout its stages, the player can fly in all directions on the screen. Bop and Bump come equipped with a spring glove mechanism that lets the player punch either up, down, right or left, which is used to defeat enemies.</p><p>Defeated enemies drop coins. There are also chests littered throughout the stages which contain coins also. These coins can be spent at a shop where the player can purchase upgrades.</p><p>The game also contains bonus stages where the objective is to open all the chests in a limited amount of time.</p>"},{"name":"Gaiares","year":1990,"developer":"Renovation Game","url":"d#Gaiares%20%28Japan%2C%20USA%29.zip","filesize":607521,"score":7.9,"genres":"Action > Side view > 2D scrolling > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>It's the year 300x.  The Earth has been ravaged by careless humans, leaving an uninhabitable, polluted wasteland.  The space terrorists, Gulfer, plan to harvest the pollution to make some sort of garbage weapon. The good guys, the Leezaluth, aren't happy about that, so they decide they have to blow up the Earth before Gulfer gets at it.  They give Earth an ultimatum: destroy Gulfer or Leezaluth destroys Earth. To help them out, Leezaluth gives Earth's last hero, Dan, a special weapon: the TOZ system.</p><p>Why don't the Leezaluth just stop Gulfer themselves?  It's not exactly clear.</p><p>So, we have the premise for a side scrolling shooter. The star attraction here is the TOZ system. The TOZ is an orb that follows your ship around, and can be shot at enemy ships to absorb their weapons. Using the TOZ, Dan will fight through 8 stages filled with lots of enemies and really large bosses.</p>"},{"name":"Gain Ground","year":1991,"developer":"SEGA Enterprises Ltd.","url":"d#Gain%20Ground%20%28USA%29%20%28Beta%29%20%281990-07-27%29.zip","filesize":336749,"score":6.8,"genres":"Action > Strategy > Top-down > Fixed / flip-screen > Real-time > Arcade > Fantasy > Sci-fi / futuristic","desc":"<p><em>Gain Ground</em> is an arcade style action game with a bit of strategy thrown in. The goal is get all of the soldiers to the opposite side of the screen or to kill all of the enemies. Each soldier in the army has a unique specialization, from among 20 types. Each soldier can attack in two different ways, using either a normal weapon or a special weapon. The strategy comes from deciding which soldier would do best in which situation. Some weapons are better at dealing with certain enemies and obstacles than other weapons.</p><p>Players start with only three soldiers but can encounter other soldiers that can be rescued, by touching them. If the new soldier survives long enough to reach the exit, they can be added to the soldier inventory. The number of possible soldier in a player's army is over 30 soldiers. There are 50 stages total, divided into rounds of 10. At the end of each round, players encounter an enemy boss.</p>"},{"name":"Galaxy Force II","year":1991,"developer":"Sega R&D1","url":"d#Galaxy%20Force%20II%20%28World%29%20%28Rev%20B%29.zip","filesize":433277,"score":5.5,"genres":"Action > Behind view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Galaxy Force II</em> is an expanded version of Galaxy Force. It adds two additional levels, the old levels are revised (expanded and re-balanced) and the four missiles can be fired with a single button press.</p><p>You are strapped into a spaceship to take on six dangerous settings, ranging from a pleasant garden to hostile fire and tough ice. You will have to fly freely before cutting through tunnels and canyons, and finally destroying an alien base. Your energy read out starts at 1200 and decreases as shots hit you, or you make contact with a wall or blockage. You have infinite cannons and guided missiles to help you along. You can get regular energy recharges and power upgrades, by shooting and then collecting their carrier pods.</p>"},{"name":"Gambler Jiko Chūshinha: Katayama Masayuki no Mahjong Dōjō","year":1990,"developer":"Yellow Horn Co., Ltd."},{"name":"Game no Kanzume: Otokuyō","year":1995,"developer":"SEGA Enterprises Ltd."},{"name":"Garfield: Caught in the Act","year":1995,"developer":"SEGA Interactive Development Division","url":"d#Garfield%20-%20Caught%20in%20the%20Act%20%28USA%2C%20Europe%29.zip","filesize":1185884,"score":7.1,"genres":"Action > Side view > Platform > Licensed","desc":"<p>As lazy cartoon cat Garfield, you're somehow trapped in your TV, that's what happens with too much TV watching. Go and find all remote-control pieces to get out of that box, and check the fridge for a change. The player advances through levels and bonus rounds in his attempt to escape.</p><p>Unlike most other platform games of its time, Garfield boasted completely unique art on each of its six levels, both for tile art and character costumes. The levels are inspired by classic movies, but given a Garfield twist, like \"Catsablanca\" and \"The Curse of Cleofatra\".</p>"},{"name":"Garfield: The Lost Levels","year":1996,"developer":"SEGA Interactive Development Division"},{"name":"Gargoyles","year":1995,"developer":"Walt Disney Computer Software, Inc.","url":"d#Gargoyles%20%28USA%29.zip","filesize":1537062,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Licensed","desc":"<p>Gargoyles is based on the Disney Afternoon TV series of the same name that ran from 1994-1997. </p><p>In this 18 level, side-scrolling platform game, players take control of the gargoyle's leader, Goliath, as he sets out to take on a looming threat that could mean the end of the world: an ancient and mysterious relic known as the Eye of Odin. </p><p>When the sun sets, Goliath awakens to travel the world through 1,000 years of time to destroy this evil artifact, facing enemies ranging from vikings, to robotic foes such as Raptorbots, Spiderbots, and Waspbots.</p><p>Throughout the adventure, Goliath can climb huge, gothic buildings to avoid enemy fire and projectiles, attack and claw foes in mid-air and on the ground, or somersault to break crumbling walls.</p>"},{"name":"Garry Kitchen's Super Battletank: War in the Gulf","year":1992,"developer":"Imagineering Inc.","url":"d#Garry%20Kitchen%27s%20Super%20Battletank%20-%20War%20in%20the%20Gulf%20%28USA%29.zip","filesize":293663,"score":6.3,"genres":"Action > Simulation > 1st-person > Tank > War","desc":"<p>In February 1991, The United States of America sent troops into Kuwait and fought in armed combat against the forces of Iraq. Operation Desert Storm featured many different types of units including mobile armor. The M1 Abrams tank division is deployed in a variety of missions to destroy marked Iraqi targets.</p><p><em>Super Battletank: War in the Gulf</em> is a 1st person tank simulation. Players sit in the cockpit of a M1 Abrams tank. Controls allow the player to accelerate forward, decelerate, rotate the tank's trajectory left and right, move the tank's cannon left and right, fire the weapon and check the map. The goal of the player is to travel to the location of enemy targets, line them up with the Abrams cannon and fire upon them until destroyed. Each mission covers a large area of land and the player will need to consult the real-time map to travel appropriately to target locations. The M1 Abrams tank also features 2 special weapons: The laser which is more powerful than regular cannon, and the smoke screen which allows the player to escape.</p>"},{"name":"Gauntlet IV","year":1993,"developer":"Atari Games Corporation","url":"d#Gauntlet%20IV%20%28USA%2C%20Europe%29.zip","filesize":541425,"score":7.9,"genres":"Action > Top-down > Arcade > Fantasy","desc":"<p>This is a port of the arcade original with some extra modes available. Up to 4 players (using Sega's four-player adapter) can choose again from Thor the Warrior, Thyra the Valkyrie, Merlin the Wizard and Questor the Elf, each with their own advantages and disadvantages.</p><p>Alongside the standard Arcade mode, there are the Quest, Battle and Record modes.  </p><p><strong>Quest mode:</strong> The goal is to defeat the four towers and solve the mystery of the ancient castle. There is a main hub area where it's possible to choose which tower to take on next, buy weapons from merchants with collected gold, and increase stats by spending experience points.  </p><p><strong>Battle mode:</strong> Players can fight each other to the death. Maps can include teleporters, monsters, items, and other things, as well as exits that exclude anyone who take them from the current round.  </p><p><strong>Record mode:</strong> This is very much like the Arcade mode, with some variations such as a password continue, and a scoring system where players can't die but lose points for every 500 health lost instead.  </p>"},{"name":"Gemfire","year":1992,"developer":"KOEI Co., Ltd.","url":"d#Gemfire%20%28USA%29.zip","filesize":417818,"score":6.6,"genres":"Strategy > Diagonal-down > Turn-based > Fantasy","desc":"<p>Koei made an incursion into the fantasy worlds of magic with this game.</p><p>Six magicians, each trapped inside a magical gem, are liberated from the crown Gemfire by Princess Robyn, daughter of the tyrannical ruler of Ishmeria, King Eselred. Fleeing across the length and breadth of the island nation, they each choose a leader from the greatest noble houses as their champion to topple Eselred and bring peace to Ishmeria. </p><p>Players select one of these noblemen and seek to unite all the provinces under their banner through a combination of warfare and diplomacy.</p>"},{"name":"General Chaos","year":1993,"developer":"Game Refuge Inc.","url":"d#General%20Chaos%20%28USA%2C%20Europe%29.zip","filesize":510957,"score":7.1,"genres":"Action > Strategy > Diagonal-down > Isometric > Real-time > Arcade","desc":"<p>General Chaos is an arcade-style squad RTS where the player controls a team of five soldiers in a limited battleground, in a classic Red (General Havoc, headquarters in Viceria) vs Blue (General Chaos, in Moronica) all out war. The goal of the game is to push the frontline to the enemy headquarters, by winning individual battles and then beat them in their own capital.</p><p>There are five kinds of soldiers, each with their weapon of choice and range of attack: the Gunner (machine gun, medium range and wide arc), Launcher (rocket launcher, long range), Chucker (grenades that can be thrown over barricades), Scorcher (flame-thrower, close combat) and Blaster (dynamite sticks, close range). Before each battle, players can choose the composition of their team from one out of four choices: Assault team, Brute Force, Commandos (a team of just two soldiers which have different controls) and Demolition.</p><p>Gameplay is simple to learn, with the A button being used to fire at the nearest enemy, B to move to a the pointer location and C to cycle through soldiers. Using the commando team changes the controls, with the directional pad controlling a soldier directly, with B being used to call the other soldier nearby. While basic commands are simple, the player must deal with things such as distance from target and angle of attack to succeed.If two opposing soldiers face-off during battle, they engage in a brawl (indicated by a cloud of dust). When that happens, the battle stops and the players are in direct control of the soldiers: A punches, B kicks and C blocks. Every downed soldier can can be rescued if there are enough medics available, earned at the end of each battle depending on how well the player did. </p><p>Up to four players can play, cooperatively or against each other.</p>"},{"name":"Generals of the Yang Family","year":1990,"developer":"Taiwan Information Corporation","url":"d#Generals%20of%20the%20Yang%20Family%20%28World%29%20%28Unl%29.zip","filesize":669559,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Fantasy","desc":"<p>The fate of your country rests on your shoulders!</p><p>As members of the Yang family, it is your job to push back the Lao Dynasty and Wester Xia, who have come to invade your country. Choose your hero and face their terrible army, alone or with the help of a friend. With bare hands or stabbing, every move is allowed to defeat your opponents.</p>\r"},{"name":"Generations Lost","year":1994,"developer":"Pacific Softscape","url":"d#Generations%20Lost%20%28USA%2C%20Europe%29.zip","filesize":636354,"score":6.5,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Sci-fi / futuristic","desc":"<p><em>Generations Lost</em> is a platform action game in which the player takes the role of Monobe, an adventurer on the search for the past of his people. Thanks to his magic armour Monobe is able to execute many different moves. Besides running and jumping, Monobe can roll on the ground, deliver blows with hands and feet, and shoot energy balls. With the help of an energy rope Monobe can swing from platform to platform.</p><p>Most of the time, Monobe has to solve several puzzles, find secret switches and survive deadly traps. The game is split into six areas which can be accessed via the \"Magic Box\" teleporter.</p>"},{"name":"Genghis Khan II: Clan of the Gray Wolf","year":1993,"developer":"KOEI Co., Ltd.","url":"d#Genghis%20Khan%20II%20-%20Clan%20of%20the%20Gray%20Wolf%20%28USA%29.zip","filesize":522033,"score":6.6,"genres":"Strategy > Diagonal-down > Turn-based > Turn-based strategy > Asia > Historical events","desc":"<p><em>Genghis Khan II: Clan of the Gray Wolf</em> is a 2D turn-based grand strategy game, based on the life of the historical Mongol leader Temujin, better known as Genghis Khan. The gameplay is similar to other grand strategy games from Koei, like Romance of the Three Kingdoms or Nobunaga's Ambition. The game has various scenarios from the Conquest of Mongolia (the unification of Mongol tribes) to World Conquest (with up to six playable factions). On the world/country map (divided into smaller provinces) the player develops his own provinces, gives orders to his subordinates, establishes alliances and recruits armies. The battles are presented in a separate mode, where the player directs troops using commands.</p>"},{"name":"George Foreman's KO Boxing","year":1992,"developer":"Beam Software Pty., Ltd.","url":"d#George%20Foreman%27s%20KO%20Boxing%20%28USA%29.zip","filesize":643642,"score":5.6,"genres":"Sports > Behind view > Boxing > Licensed","desc":"<p>Featuring heavyweight champion George Foreman, this is a boxing simulation where players, taking the role of Foreman, go through a series of twelve rounds against different boxers to win the championship title belt.</p><p>Played from an third-person perspective using a view from right over the shoulders over the boxer, players can move left and right to dodge incoming punches, block and throw left and right punches. The standard punch is a cross, but by holding the Up-key pressed, jabs can also be thrown.</p><p>By avoiding punches and hitting them, a superpunch often becomes available, inflicting much more damage. A fight consists of a maximum of three rounds of three minutes each. When a boxer is knocked down four times, the match is over (technical knock-out). The same happens when a boxer goes down three times in a single round (regular knock-out). When down, players need to press both punch buttons in rapid succession to get back to their feet. The screen shows an energy meter drained when punches are received. After being knocked down and during intermissions, some energy is restored.</p><p>All versions, except for the Game Boy, can be played with two players. A password system is used to save the progress.</p>"},{"name":"Ghostbusters","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Ghostbusters%20%28USA%2C%20Europe%29.zip","filesize":358843,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Horror > Licensed","desc":"<p>Set after the events of the first movie, Sega's \"Ghostbusters\" follows the further adventures of Peter, Ray and Egon, as the make their way through six cases in an attempt to piece together a mysterious stone tablet.</p><p>Completely different than the Activision title of the same name, the Genesis \"Ghostbusters\" is a side-scrolling platformer that has the boys in gray running through houses, apartments, a burning house and a high-rise for starters as they battle a myriad of ghosts with their proton blasters.  When the Ghostbusters face off against a boss ghost, they have the ability to trap them the traditional way.</p><p>Peter, Ray and Egon, each have different abilities, and can purchase weapon and life upgrades from shops throughout the levels.  Other familiar faces make an appearance, as Slimer offers power-ups, and the Stay-Puft Marshmallow Man returns to settle the score from the movie.  </p><p>Solve the mystery of the tablet, and the Ghostbusters have to face off against Jenna, the Goddess of Death and Destruction.  Can the boys save New York one more time?</p>"},{"name":"Gluf","year":2020,"developer":"RetroSouls"},{"name":"Go Net","year":1992,"developer":"AI-system Corporation"},{"name":"Gods","year":1992,"developer":"The Bitmap Brothers","url":"d#Gods%20%28USA%29.zip","filesize":444663,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Classical antiquity > Fantasy","desc":"<p>Hercules is aiming to achieve immortality by completing the task the Gods have set him. His task is presented as a  platform adventure set in ancient Greece, featuring a variety of enemies as you play it through.</p><p>Of more significance, however, is the game's Artificial Intelligence system, in which creatures monitor how you play, and try to find safer positions. Also, the game offers more bonuses and power-ups if you're struggling to progress. Even without those, there are lots of bonus sections to find and unlock.</p>"},{"name":"Golden Axe","year":1989,"developer":"Team Shinobi","url":"d#Golden%20Axe%20%28World%29.zip","filesize":347075,"score":7.3,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Fantasy > Regional differences","desc":"<p><em>Golden Axe</em> is an arcade beat-'em-up game that puts players in the shoes of one of three heroes, each with his own reason for trying to overthrow the evil rule of Death-Adder, who - along with his forces of darkness - kidnapped and imprisoned the King and his daughter and stole the legendary Golden Axe.</p><p>This is a horizontal fighting game, where you basically take one of the three characters (the barbarian Ax Battler, a dwarf named Gilius Thunderhead or the amazon Tyris Flare) and bash everything which stands between you and Death Adder himself. Each character has a special magical ability that can be charged by kicking small blue creatures that drop a potion. There is also a green variety off this creature that drops food that replenishes your health. Some enemies ride dragons and a scorpion like creature. The enemies can be knocked off and you can mount the creature yourself and attack the enemies with it.</p><p>The game allows to play up to two players on a same screen, however in the C64 version this option has not been implemented. C64 version was also stripped off in the other areas, such as: only one enemy can engage the player at a time or there are only two types of dragons instead of three.</p>"},{"name":"Golden Axe II","year":1991,"developer":"SEGA Enterprises Ltd.","url":"d#Golden%20Axe%20II%20%28World%29.zip","filesize":334548,"score":7.3,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Fantasy","desc":"<p>Not long after the malign reign of the Death Adder has ended, another evil rises. The peace of the land has again been threatened, this time by 'Dark Guld', who was supposed to be imprisoned but apparently isn't. He has instead now got his hands on the Golden Axe, and is using it for his own nasty purposes, and with his minions is causing much chaos.</p><p>So once more, Ax-Battler, the fierce barbarian; Tyris-Flare, the fearless Amazon; Gilius Thunderhead, the ferocious dwarf; get up to deal with the oppression, with their might and magic, and recover the Golden Axe.</p><p>The hack and slash gameplay, in a medieval fantasy setting, is essentially the same to that of the previous game. Beat up opponents with melee attacks and collect scrolls to launch magical attacks. Moreover,  players can also ride dragons and other beasts and use their attack capabilities to their advantage.</p>"},{"name":"Golden Axe III","year":1993,"developer":"SEGA Enterprises Ltd.","url":"d#Golden%20Axe%20III.zip","filesize":696337,"score":6.9,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Fantasy","desc":"<p><em>Golden Axe III</em> is like its predecessors a beat 'em-up game that puts players in the shoes of a hero out to save the land from evil. This time Damud Hellbringer, the 'Prince of Darkness', has taken away the Golden Axe and put an evil curse over all the warriors of the land. However, one of the heroes has their curse relieved and is sent to set things straight and lift the curse off other warriors, defeat the villains and return with the Golden Axe.</p><p>The barbarian and amazon of the first two parts remain although receiving new names (Kain Grinder and Sahra Burn). The two new characters introduced are the panther warrior Chronos Raid and Proud Cragger the giant. Gilius Thunderhead the dwarf gives you instructions, but is not playable. The gameplay has been expanded slightly, but is essentially the same hack 'n' slash as in the previous games. New features to the series include junction points where you can choose which path to take. Like in the first <em>Golden Axe</em>, you get magic potions and health power-ups by kicking gnomes during the occasional intermission. Every character has unique magic spells, but they function in the same way: the power and the damage of the spell increase with the number of potions available (and you can't choose a weaker one if you want to spare more potions for later). New moves include blocks, grapples, sweeps and team attacks.</p>"},{"name":"Goofy's Hysterical History Tour","year":1993,"developer":"Absolute Entertainment, Inc.","url":"d#Goofy%27s%20Hysterical%20History%20Tour%20%28USA%29.zip","filesize":506815,"score":5.7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>In <em>Goofy's Hysterical History Tour</em>, the player takes command of Goofy himself who gets his dream job as janitor at The Ludwig von Drake History Museum. However, his rival Pete is determined to get him fired and sabotages the exhibits and scatters pieces throughout various time periods. Armed with a new gadget, the Extend-O-Hand, Goofy must travel to the past and recover the pieces before the morning.</p><p>The game is a platformer, where Goofy must travel through various stages ranging from Prehistoric times, Medieval times, Colonial America and the Wild West among many others, collecting items and power-ups and defeating Pete's henchmen using the Extend-O-Hand. After collecting all the pieces, Goofy then must face Pete himself.</p>"},{"name":"Granada","year":1990,"developer":"Wolf Team","url":"d#Granada%20%28Japan%2C%20USA%29.zip","filesize":304981,"score":7.5,"genres":"Action > Top-down > 2D scrolling > Anime / Manga > Shooter > Tank > Sci-fi / futuristic","desc":"<p>In the year 2016, war has broken out in Africa over mining rights to rare metal. Machines of destruction called \"maneuver cepters\" have been developed as the primary force, but recently a mysterious maneuver cepter has appeared in the northern territories. It is known by the name of \"Granada\", and has been destroying the weapons of the factions on both sides. You are this machine's pilot, a man by the name of Leon Todo.</p><p><em>Granada</em> is a free-roaming scrolling shooter. You control the titular maneuver cepter Granada as you make your way through each stage, destroying the enemy's weapons. You have a map that tells you where your targets are on the stage, and once all the targets have been destroyed a large boss enemy appears which must also be destroyed. You are equipped with a standard cannon, as well as a more powerful blaster that will actually push your machine backwards with the recoil. There are also assist pickups which will follow you and reflect any shots you fire at it toward the nearest enemies.</p><p>Of special note is the fixed cannon feature. Using this feature, you can hold the direction of fire while still moving freely. The game has nine stages and three difficulty levels.</p>"},{"name":"Great Circus Mystery starring Mickey & Minnie, The","year":1994,"developer":"Capcom Co., Ltd.","url":"d#Great%20Circus%20Mystery%20Starring%20Mickey%20%26%20Minnie%2C%20The%20%28USA%29.zip","filesize":817579,"score":6.9,"genres":"Action > Side view > 2D scrolling > Puzzle elements > Licensed","desc":"<p>Starring Mickey and Minnie Mouse, the two plan to spend the day at the Circus only to find that it's deserted. Believing that someone is responsible, you must dress up in different outfits such as Safari and Western, as you try to find clues to solve the mystery behind the disappereance of the performers, including your pals Donald Duck and Pluto.</p>"},{"name":"Great Waldo Search, The","year":1992,"developer":"Radiance Software","url":"d#Great%20Waldo%20Search%2C%20The%20%28USA%29.zip","filesize":315146,"score":4.3,"genres":"Action > Puzzle > Side view > Top-down > Hidden object > Licensed","desc":"<p>Based on the popular <em>Where's Waldo</em> series of books, the player's goal is to find Waldo, who is hidden in various pictures, before the time on the clock runs out. The player controls a magnifying glass and must click on various items for different effects. Finding a clock adds more time to the search, clicking on a 150 icon adds 150 points to the score, etc.</p><p>Each picture consists of 6 adjacent screens containing a continuous theme. The themes are The Carpet Flyers, The Underground Hunters, The Battling Monks, The Unfriendly Giants and The Land of Waldos. Players are given the option of playing on Normal difficulty, Expert difficulty, or playing the Land of Waldos stage. The only difference between the difficulties is that on expert there are no clock items to provide players with extra time.</p><p>In all of the stages the player must find both Waldo and a scroll to complete the stage. Waldo must be found before the scroll in order to complete the stage. Waldo's dog Woof is also in each of these stages (except for the Land of Waldos) and by finding him players get to play a small bonus stage where they collect points as they control the dog on a flying carpet.</p>"},{"name":"Greatest Heavyweights","year":1993,"developer":"Acme Interactive, Inc.","url":"d#Greatest%20Heavyweights%20%28USA%29.zip","filesize":1300934,"score":7.3,"genres":"Sports > Side view > Boxing > Licensed","desc":"<p><em>Greatest Heavyweights</em> is a boxing game featuring the ex heavyweight champions Evander Holyfield, Larry Holmes, Joe Frazier, Muhammad Ali, Floyd Patterson, Rocky Marciano, Joe Louis and Jack Dempsey. Their likeness and real fighting style are simulated by the game.</p><p>The game is an enhanced version of Evander Holyfield's \"Real Deal\" Boxing, being also played in a pseudo-3D side view with moving around the ring handled by scrolling the backdrop and moving the ropes. This time, a 2.5D camera is shown at the top of the screen.</p><p>There are three game modes:</p><ul><li><p>Exhibition: one or two players can fight a single match.</p></li><li><p>Tournament: one player chooses among the eight heavyweight champs available in a eight-man tournament against the remaining seven.</p></li><li><p>Career: one player creates a character who starts as the #30 of the ranking, fighting his way up against fictional characters. During character creation, players can choose the fighter's color of skin (which now includes some unnatural colors such as green and blue), trunks and hair, haircut, size of body and stats emphasis (power, speed and stamina). Between matches, career mode offers various exercises to assign the boxer to improve his stats. After reaching the #1 in the ranking, the player will be challenged by each one of the eight greatest heavyweight champions.</p></li></ul><p>During the fights, besides an energy bar, the fighters have a head and a torso damage meter. This meters are images of their head and torso, which become gradually grey, from top to bottom, as they are hit. If one of these meters becomes totally grey, it will start blinking, warning that it the fighter takes some more punches on that area, he will loose the fight by TKO. Being knocked down tree times in a round also leads to a TKO. During the rounds' breaks, fighters regain strength as the girl with the round sign passes along their sides.</p><p>Fighters can perform three types of punches: jabs, hooks and uppers, which can be aimed at the opponent's head or torso. Fighters can also taunt their opponents. Each one of the heavyweight champions has his own set of personal taunts. If by some reason the fighters avoid to fight, the spectators will start to hiss at them. To keep the spectators pleased, the fighters must keep punching each other on a regular basis.</p><p>The game plays sensibly faster than <em>Evander Holyfield's</em>, and the character animation is more detailed. There's a replay feature included, and the fights are announced by Michael Buffer's voice.</p>"},{"name":"Greendog: The Beached Surfer Dude!","year":1992,"developer":"Interactive Designs","url":"d#Greendog%20-%20The%20Beached%20Surfer%20Dude%21%20%28USA%2C%20Europe%29.zip","filesize":395030,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>In this game you play the role of a surfer called Greendog who discovers a gold pendant while out surfing. Unwittingly he puts the pendant on and discovers it won't come off. A bikini clad girl tells him that the pendant was made by the Aztecs long ago, and that they cursed it so that whoever wears it will be attacked by any animal that comes near them. Worst of all the person wearing it is unable to surf. The only way Greendog can lift the curse and remove the pendant is to find the six pieces of Aztec treasure and put them all together and the only knowledge of the whereabouts of the treasure is stamped on the back of the pendant.</p><p>The gameplay involves you getting from the left end of the level to the right while fighting off wild animals with your trusty Frisbee and using your athletic skills to jump over platforms.</p>"},{"name":"Grind Stormer","year":1994,"developer":"Toaplan Co., Ltd.","url":"d#Grind%20Stormer%20%28USA%29.zip","filesize":498485,"score":6.8,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter","desc":"<p>This cartridge combines two different localized flavours of the original arcade game. There are two modes, <em>Grind Stormer</em> and <em>V Five</em>. Both offers the same levels and enemies, but have a different approach to how the player can use power-ups.</p><p>In this hectic, top-down, vertically-scrolling shooter where the screen is constantly filled with enemies and bullets, players have a constant, unlimited firing rate, enhanced by power-ups that include missiles, target-seeking bullets, shields, additional speed, extra power and bonus points. In <em>Grind Stormer</em> the ship always moves at a fast speed and the player can collect bombs that damage the entire screen and fend off bullets. The other variant <em>V Five</em> takes a Gradius-approach to power-ups, having the player advance through a selection of power-ups shown on the right by collecting tokens. In the first mode power-ups are immediately applied. In the second mode the ship is much slower and the player needs to decide to spend tokens on speed power-ups right away or save them to advance to seeking bullets or additional power.</p><p>The game difficulty, amount of lives and continues can be set in the options. After using a continue, the player immediately receives a \"Special\" power-up granting four wingmen.</p>"},{"name":"Growl","year":1991,"developer":"Taito Corporation","url":"d#Growl%20%28USA%29.zip","filesize":268663,"score":6.2,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform","desc":"<p>In the early part of the 20th century, a group of evil poachers recklessly hunted animals to the point of extinction, including lions, deers, elephants, eagles, and several others.</p><p><em>Growl</em> is a one-player game, in which you control one of four characters (Gen, Burn, Khan, and Jack) and you must defeat these evil poachers by dealing with them with your fists. However, there are weapons that can be found, including grenades, rocket launchers, whips, swords, guns, and shotguns, which you get once an enemy drops them on the ground, so you can use these weapons against them. If you manage to get one of the guns, you can shoot enemies with a limited supply of ammo. Once the ammo runs out, your only option is to pistol-whip them.</p><p>Also, you can pick up crates and barrels and haul it at enemies to knock them down. Along the way, you'll encounter several cases of animal cruelty, such as two men whipping a lion. Stop the animal cruelty, and the animals will help you in your quest to defeat these evil poachers.</p>"},{"name":"Gunship","year":1993,"developer":"Probe Software Ltd.","url":"d#Gunship%20%28U%29.zip","filesize":603393,"score":"","genres":"Action > Simulation > 1st-person > Side view > 2D scrolling > Shooter > Helicopter > Vehicle simulator","desc":"<p><em>Gunship</em> is the Mega Drive version of the MicroProse helicopter series. Just like the original game the player gets to command a helicopter through a first-person perspective. Missions are preceded by a briefing and a planning stage. A map of the environment is shown from a top-down perspective with the starting position, enemy locations, fuel dumps, and the target. The player sets out custom waypoints to reach the target. Often a fuel refill is required to make it that far and it needs to be calculated in.</p><p>During missions the helicopter can be steered in any direction, but it is not necessary to keep track of waypoint directions, as they are automatically followed. The HUD contains the remaining distance, health, fuel, score, and a radar with enemies as red dots. There is a certain amount of freedom of movement and a voice warns about incoming missiles. Helicopters can be shot with a cannon. At a fuel dump the helicopter becomes vulnerable and the player can choose to disengage before the refueling is complete.</p><p>When the target is reached, an approach sequence is initiated. The game turns into a 2D 3rd-person side-scroller, unique to the series. There is freedom to move up and down and engage targets with the regular cannon or homing missiles in the air and on the ground. The helicopter can also turn 180 degrees to travel in the opposite direction. A yellow arrow marks the direction of the final target. In this sequence the player receives multiple lives (credits) to continue playing. In the first-person sequence death is final. These 2D sequences can be practiced as six scenario's in a simulator from the main menu.</p>"},{"name":"Gunstar Heroes","year":1993,"developer":"Treasure Co., Ltd.","url":"d#Gunstar%20Heroes%20%28USA%29.zip","filesize":661813,"score":8.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Once upon a time, Dr. Brown managed to defeat a mad android known as Golden Silver, who tried to suck out the energy of the planet G-9. Dr. Brown extracted four Mystical Gems, the android's power source, and sealed them on one of the planet's moons, where it was guarded by the four Gunstar siblings. However, years later, a dictator named Smash Daisaku kidnapped Gunstar Green and brainwashed him into telling him where the Mystical Gems were. The dictator is now close to reactivating Golden Silver. The Gunstar twins Red and Blue, guided by their sister Yellow, must find a way to stop Smash Daisaku - but they know that their older brother is on that way...</p><p><em>Gunstar Heroes</em> is a fast-paced side-scrolling shooter. Controlling either Red or Blue Gunstar, the player has access to four basic weapons: Force, rapid shot; Lightning, a straight shot that penetrates enemies; Chaser, a homing weapon; and Flame, a powerful close-ranged. The player can combine two weapons to produce a new one, for a total of fourteen weapons. It is also possible to use melee attacks and moves such as grabbing and tossing enemies, jumping, and sliding.</p>"}]