[{"name":"Handy Harvy","year":2018,"developer":"Second Dimension R&T, LLC"},{"name":"Hangman SG","year":2011,"developer":"Airwalk Studios"},{"name":"Hard Drivin'","year":1990,"developer":"Atari Games Corporation","url":"d#Hard%20Drivin%27%20%28World%29.zip","filesize":92988,"score":6.2,"genres":"Racing / Driving > 1st-person > Arcade > Tricks / stunts > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Hard Drivin'</em> is a 3D arcade hit from Atari Games. You are in control of a high-performance sports car. Your objective is to race around the course as fast as possible and hit as many checkpoints as possible. If you hit a checkpoint you gain extra time to go farther. You will see traffic on the road both in your direction and coming down the opposite direction, so be careful when you pass... </p><p>The course has two sections: speed track, and stunt track. Speed track is longer, but you can usually achieve higher speeds. Stunt track requires you to perform several stunts such as jumping bridges, driving through a loop, and so on. </p><p>Crashing the car has no serious consequences and indeed shows a replay of your crash from a cinematic angle. Admire your crash head-on into the cement truck, or clipping the minivan, or flying off the bridge in the wrong angle... You lose several seconds as your car is \"reset\" and you get up to speed again. </p><p>The home conversions retain most of the then-advanced 3D graphics but lack the force-feedback that was in the arcade version.</p>"},{"name":"HardBall '94","year":1994,"developer":"MindSpan","url":"d#HardBall%20%2794%20%28USA%2C%20Europe%29.zip","filesize":909360,"score":7.2,"genres":"Sports > Behind view > Diagonal-down > Baseball","desc":"<p>New features in this edition of the baseball simulation include the Home Run Derby and Pitching Practice. Multiple viewpoints and instant replays are included. 28 pitches are included, each with distinct effects. You can use real or fictitious teams, and even create your own right down to the logo and kit. Statistics such as batting average and RBIs are stored and can be printed out. Also, as in the previous game, announcer Al Michaels says things during the game.</p>"},{"name":"HardBall '95","year":1995,"developer":"MindSpan","url":"d#HardBall%20%2795%20%28USA%29.zip","filesize":1633075,"score":7.3,"genres":"Simulation > Sports > Behind view > Diagonal-down > 2D scrolling > Licensed","desc":"<p><em>HardBall 5</em> is mainly an update to HardBall 4, with the additions coming in the form of adjustable difficulty settings, sharper graphics, more comments by Al Michaels and improved league play, which comes with a full set of 1994 major leaguers, plus a bonus legends league. The game includes multiplayer support for up to two players.</p>"},{"name":"HardBall!","year":1991,"developer":"Accolade, Inc.","url":"d#HardBall%21%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":452856,"score":7.2,"genres":"Sports > Behind view > Diagonal-down > Baseball","desc":"<p><em>Hardball</em> is a baseball action game for one or two players. You can throw a variety of pitches from fast balls to curve balls, steal bases, select team members, and substitute players as the game is played.</p>"},{"name":"Harukanaru Augusta","year":1993,"developer":"T&E Soft, Inc."},{"name":"Haunting Starring Polterguy","year":1993,"developer":"Electronic Arts, Inc.","url":"d#Haunting%20Starring%20Polterguy%20%28USA%2C%20Europe%29.zip","filesize":1602669,"score":7.1,"genres":"Simulation > Diagonal-down > Isometric > Real-time > Direct control > Horror","desc":"<p>The ghost of a teenager seeks revenge against a snobbish family.  Your job is to scare them out of their house(s).  They can't see you, so your only means of scaring them is by possessing various objects throughout the household.  For example, possessing a piece of furniture would cause something to fly out from it, and possessing an object would make it come alive in some way or another.  You need to act quickly because you have something called \"ecto\" which acts as the fuel that allows you to roam the real world.  You're awarded more ecto each time a family member exits the room.  The more scares you did, the more ecto you gain.  Losing all ecto sends you to the underworld where you have to regain your ecto to full capacity in order to go back into the real world.</p>"},{"name":"Head-On Soccer","year":1995,"developer":"U.S. Gold Ltd.","url":"d#Head-On%20Soccer%20%28USA%29.zip","filesize":719177,"score":7.3,"genres":"Sports > Diagonal-down > Isometric > Football (European) / Soccer","desc":"<p>In this isometric football game, 51 national teams are represented to play in two game modes: Exhibition and Tournament (a series of seven games on four continents, with a final against the World All-Stars), with the ability to set time, difficulty level, see cutscenes after goals and if players are free to kick each other around without (many) fouls.</p><p>While the game seems short-featured for 1995 standards, the tournament mode includes a twist: depending on how well the player defeats his opponents, he can trade his \"standard players\", who won't do anything spectacular (but at least fill up the ranks) for star players, who not only look different, are able to cross and backheel the ball but also have a unique ability at the disposal of the player:<em> </em><em>The Marker:</em>* can latch on an opposing player, stopping him from running away with the ball;</p><ul><li><p><strong>Goalkeeper 1:</strong> more capable of stopping shots than the regular goalkeeper;</p></li><li><p><strong>Barger:</strong> this large, muscular player is able to shove everyone in his path;</p></li><li><p><strong>Tricky:</strong> capable of jumping (or bunny-hopping, to be more precise) with the ball tucked between his feet, avoiding tackles;</p></li><li><p><strong>The Cheat:</strong> while it's hard to talk about fair play in a game where kicking a defenders' leg to gain a corner is (mostly) a legitimate play, this player takes the whole thing into the next level, being able to dig fouls out of nowhere, at the expense of the ball (if he's carrying it or the referee waves play on) or just some stains in his shirt (if he's trying to pull an offensive foul), with the odds of 50/50 (25% for penalties);</p></li><li><p><strong>Passer:</strong> capable of feeding forwards with laser-precision passes;</p></li><li><p><strong>Striker 1:</strong> capable of unleashing impossibly-sliced shots, scoring from virtually any position in the offensive area;</p></li><li><p><strong>Striker 2:</strong> best used from positions directly in front of goal, this striker features a shot that is so powerful the ball ignites as it approaches the goal;</p></li><li><p><strong>Goalkeeper 2:</strong> features a better chance of stopping special shots from both Strikers;</p></li></ul><p>In Exhibition games teams start with their own setup of start players, from none to a full team. The playing surface also affects gameplay - playing in wet grass removes all ball bounce, the opposite occurring with sand, and the most dramatic change, a rocky field where the ball can change direction after hitting the ground, turning throw-ins into corners, poor attempts on goals and vice-versa.</p>"},{"name":"Heavy Nova","year":1992,"developer":"Holocronet","url":"d#Heavy%20Nova%20%28USA%29.zip","filesize":558660,"score":4.9,"genres":"Action > Side view > Fighting > Sci-fi / futuristic","desc":"<p>In an era of frequent alien attacks, the Earth has a unified Government, which relies on a line of cyborgs known as the Heavy Dolls for defense. The greatest of these are known as the Heavy Nova, a title earned by passing a rigorous training regime.</p><p>You are taking on the simulated proving grounds, which are split into two styles of alternating action. In the first you must progress (initially purely horizontally, though later with vertical flick-scrolling as well) through a hostile environment of enemies, bombs and traps, gaining points for doing it quickly and with lots of energy left. Initially you can fly and kick as needed.</p><p>Once this section is complete, you move on to one-on-one combat of the Street Fighter 2 style. The early foes have far less energy than you begin with. As you progress through the game, you are awarded extra attacking moves, in a manner similar to Brutal: Paws of Fury.</p>"},{"name":"Heavy Unit","year":1990,"developer":"Kaneko Co., Ltd."},{"name":"Hellfire","year":1990,"developer":"Toaplan Co., Ltd.","url":"d#Hellfire%20%28USA%29.zip","filesize":204104,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>In the year 2998, humanity has finally reached the stars, and was able to build a prosperous, peaceful society. However, a space matter known as the Black Nebula began to spread, threatening to engulf the galaxies controlled by humans. It turned out that a robotic dictator named Super Mech was behind this occurrence. The Earth sends Captain Lancer, a skillful pilot navigating the powerful CNCS1 aircraft, equipped with the most powerful weapon: the Hellfire...</p><p>This is a horizontal space shooter, with the traditional premise of a lone pilot traversing hostile areas and out-manoeuvring and/or destroying quick and numerous enemies. What sets this shooter apart from many other horizontal space shooters is that you choose the direction of your shots at any time between forward, backward, upward+downward and 4-way diagonal. The 4-way diagonal shot is usually the most effective and makes for some interesting gameplay setups, such as stationary guns you can only reach by passing them (while avoiding their shots) and then placing yourself diagonally above them. There is also a bomb to take out multiple enemies. The game has a standard set of pickups: P icons for powering the weapons, S icons for increasing ship speed, B icons for bombs, and score icons.</p>"},{"name":"Herzog Zwei","year":1989,"developer":"Technosoft Co., Ltd.","url":"d#Herzog%20Zwei%20%28USA%2C%20Europe%29.zip","filesize":314758,"score":7.6,"genres":"Strategy > Top-down > Real-time > Arcade > Real-time strategy > Helicopter > Mecha / giant robot","desc":"<p>The premise is that two opposing forces are in combat with one another. Each player controls a jet airplane which zooms across the screen and may turn into a ground based soldier. These ground soldiers can hurt enemy units, but can not affect bases. To take over bases scattered across the map (and ultimately, the enemy base), players must purchase new units and transport them to certain positions. In this way, the player acts more like a transport and management for different types of units rather than a combat character themselves. If the plane is ever destroyed, it restarts at the player's base location. As previously mentioned, a level is complete when either side's base is lost to the opposing forces.</p>"},{"name":"High Seas Havoc","year":1993,"developer":"Data East Corporation","url":"d#High%20Seas%20Havoc%20%28USA%29.zip","filesize":661109,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Sea pirates / Caribbean","desc":"<p>Havoc is a young traveler and treasure hunter, who roams the seas with his shipmate Tide. One day, he finds an unconscious girl on the seashore. She tells Havoc that her name is Bridget, and she has a treasure map that leads to the location of Emeralda, the legendary treasure with unique power. But the evil pirate Bernardo has kidnapped Bridget and Tide, and stolen the treasure map. Havoc has to rescue his friends and to get the map back.</p><p><em>High Seas Havoc</em> is an action platformer. Havoc can roll, jump, and attack enemies while jumping - or hit them by simply jumping on their heads. He can also collect various items and open treasure chests on the way.</p>"},{"name":"Hit the Ice: The Video Hockey League","year":1992,"developer":"Taito Corporation","url":"d#Hit%20the%20Ice%20-%20VHL%20-%20The%20Official%20Video%20Hockey%20League%20%28USA%29.zip","filesize":246678,"score":6.2,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Arcade > Hockey","desc":"<p><em>Hit the Ice</em> is a fast-paced, high-impact hockey game. Having more in common with Midway's Arch Rivals than any sane hockey simulation, this arena is no place for penalties, and no place for wimps. While the idea is still to somehow put the puck into the opposing team's goal, each team only has three players, there is a heavy focus on checking, and it is possible to do a \"super shot\" which is strong enough to send the goalie into the net along with the puck.</p><p>Available are exhibition and tournament modes for one or two players. Two players can even team up to take on the computer. The TurboGrafx-16 release also adds a four-player mode, while the Gameboy version adds a \"shot race\" mode where the player must get a certain number of goals as quickly as possible.</p>"},{"name":"Home Alone","year":1992,"developer":"Brian A. Rice, Inc.","url":"d#Home%20Alone%20%28USA%2C%20Europe%29.zip","filesize":330628,"score":5.4,"genres":"Action > Side view > Top-down > 2D scrolling > Platform > Puzzle elements > Licensed","desc":"<p>Macaulay Culkin briefly became a child star following the film Home Alone, in which he played Kevin McCallister, who is accidentally left behind by his family when they go off on holiday. During this time, burglars attempt to break in, and Kevin must foil them.</p><p>Playing as Kevin, you start off on his trusty sled, but the main job is to get to the house and make it burglar-proof. This involves setting traps throughout the house. Useful objects such as a Crossbow, Wire and Pepper can be combined to make fiendish weaponry. You must also lock up any valuables you find, to avoid the family losing them.</p>"},{"name":"Home Alone 2: Lost in New York","year":1993,"developer":"SEGA Interactive Development Division","url":"d#Home%20Alone%202%20-%20Lost%20in%20New%20York%20%28USA%29.zip","filesize":379108,"score":"","genres":"Action > Side view > Platform > Licensed","desc":"<p>The McCallister family is off to Miami for a Christmas vacation in the sun. The son, Kevin, ends up on the wrong plane and winds up in New York City all by himself. The two-man bandit team he helped catch in the first film also just so happen to be there, and are out for revenge.</p><p><em>Home Alone 2</em> is an action platform game based loosely on the 1992 film of the same title. Starting in the airport, the player controls Kevin as he runs around New York, visiting locations similar to those in the film, and outwitting the bandits Harry and Marv, who turn up to harass him at almost every turn. Kevin has a variety of kid-friendly weaponry handy to take on his enemies, including baseballs, footballs, and slingshots.</p>"},{"name":"Honō no Tōkyūji: Dodge Danpei","year":1992,"developer":"SEGA Enterprises Ltd."},{"name":"Hook","year":1992,"developer":"Ukiyotei Company, Ltd.","url":"d#Hook%20%28USA%29.zip","filesize":419387,"score":6.5,"genres":"Action > Side view > 2D scrolling > Fighting > Platform > Licensed","desc":"<p>In this video game adaption of the Steven Spielberg film <em>Hook</em>, the player takes the role of a grown-up Peter Pan, whose kids have been kidnapped by Captain Hook. Tinker Bell takes Peter back to Neverland where he must again become Pan and reclaim his children.</p><p>This particular interpretation is a side-scrolling action game, in which players must hack their way past Hook's denizens through 11 levels. These include forests, icy regions, and towns which Peter will have to jump, climb, and swim through. Magic items such as apples and pixie dust can be collected for special powers. When enemies are attacked, they simply put their hands up in surrender rather than dying, so as to make the game more child-friendly.</p>"},{"name":"Humans, The","year":1992,"developer":"Imagitec Design Inc.","url":"d#Humans%2C%20The%20%28USA%29.zip","filesize":719343,"score":7.2,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Prehistoric","desc":"<p>The gameplay of <em>The Humans</em> has similarities to Lode Runner and Lemmings. Your job in this action puzzler is to help prehistoric man to evolve by helping them discover tools, the wheel, weapons, or even fire. Each level in the game will have a given task to help in this, and you are allotted a number of characters who must accomplish the task. The player can switch from person to person while moving the characters around each scrolling puzzle, and teamwork is essential to success. </p><p>Tasks can include finding objects (like a spear) on the screen, or trying to reach a specific destination which may require the use of objects you have discovered so far. Each level has a time limit, when time runs out the level can be restarted.</p>"},{"name":"Hurricanes","year":1994,"developer":"Arc Developments","url":"d#Hurricanes%20%28U%29.zip","filesize":868647,"score":6.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Featuring in a children's TV cartoon, <em>The Hurricanes</em> are the most revered team in the World Soccer League. The Gorgons are desperate to beat them in a key match - so desperate that they have made it hard for the team to even get to the stadium. Taking control of one of their star players, you must trek through the jungle, mines and a temple to get them to the stadium on time.</p><p>Soccer Kid seems like a logical game to 'influence' a license of a show about brilliant football players. Arc Developments agreed. The gameplay thus has a football used as a weapon against encroaching foes. There are ropes to move across, precise jumps to time, and traps to avoid.</p><p>In <em>The Hurricanes</em> the ball sticks closely to the player's foot, even while he is jumping. It is only released when purposefully kicked, and replaced if it hits something or is lost. It can be flicked up while you are off the ground.</p><p>The levels move from left to right but on several different vertical levels, and there is often more than 1 possible path, in a manner similar to Global Gladiators. Power-up tokens can be collected and traded in. Losing one of your 5 lives takes you back to the last restart point - losing one of your continues takes you to the start of the world.</p>"},{"name":"Hybrid Front, The","year":1994,"developer":"SEGA Enterprises Ltd."},{"name":"Hyokkori Hyōtanjima: Daitōryō o Mezase!","year":1992,"developer":"JSH Co., Ltd."},{"name":"Hyper Marbles","year":1991,"developer":"SEGA Enterprises Ltd."}]