[{"name":"Ikasuze! Koi no Doki Doki Penguin Land MD","year":1992,"developer":"SEGA Enterprises Ltd."},{"name":"IMG International Tour Tennis","year":1994,"developer":"High Score Productions","url":"d#IMG%20International%20Tour%20Tennis%20%28USA%2C%20Europe%29.zip","filesize":718898,"score":6.6,"genres":"Sports > Diagonal-down > 2D scrolling > Tennis > Licensed","desc":"<p>Licensed by the International Management Group (IMG), this rare Electronic Arts venture into Tennis features 32 professional players (all male and licensed by the IMG) including Bjorn Borg, Marcelo Rios, Patrick Rafter and Yevgeni Kafelnikov in 15 tournaments with different surfaces. Game modes include exhibition, tour and tournament for both singles and doubles.</p><p>Along the usual offering of lobs, volleys, passing shots, top spins and slashes, the player can leave player movement to the console, and just focus on hitting the ball with the right shot with the correct timing (the player can also set the playing style, from all-court, baseline, or rush net). For those needing a boost of confidence before entering competitive play, Vic Braden, one of the most well known tennis coaches, has a court with special lines, a ball machine and some hints to help them improve their play.</p>"},{"name":"Immortal, The","year":1991,"developer":"Sandcastle","url":"d#Immortal%2C%20The%20%28USA%2C%20Europe%29.zip","filesize":758817,"score":7.9,"genres":"Action > Diagonal-down > Isometric > Puzzle elements > Fantasy","desc":"<p>Your old mentor Mordamir has disappeared - probably kidnapped. You're not too sure where he might be, but a dungeon is always a good place to look, so you seek out the nearest one and plunge into its depths. Beware: eight levels of traps and deadly enemies await.</p><p><em>The Immortal</em> is an isometric game with puzzle-solving and action combat. Progress is made by encountering a hazard, dying, solving the problem, encountering the next hazard. To solve a level, you have to know its traps and their patterns by heart. The puzzles range from simple avoidance of traps to the correct use of items; you collect objects in an inventory. Every now and then, the game offers a special challenge. For example, you've got to ride a magic carpet through a hallway full of fire traps, or ride a barrel on an underground river. </p><p>The dungeon isn't empty: some friendly characters may have valuable information or trade items, the nasty sort of guys will attack. Combat is fought man-to-man - on the main game map in the original versions; on a special screen in the console and PC ports. Your adversary indicates his next attack a few seconds before he executes it, so you've got time to react appropriately. You can dodge to the left or the right, as well as attack from these two directions. There is no save option in the game, but you may restart each level as often as you like. Levels can be skipped by entering passwords.</p>"},{"name":"Incredible Crash Dummies, The","year":1993,"developer":"Gray Matter Inc.","url":"d#Incredible%20Crash%20Dummies%2C%20The%20%28USA%2C%20Europe%29.zip","filesize":540690,"score":5.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>At a time when computer games were being blamed for violence, bad language, epilepsy and everything else the ‘moral majority’ needed a scapegoat for, Virgin gave us: The Road Safety Game. Or not, as this is a standard platform game with a twist of questionable taste and purpose. </p><p>You play a crash test dummy, trying to progress through levels filled with hazards such as cars and fireballs, within the time limits. Contact with each of these loses you a limb, and once you have none left, contact means game over. Since the character isn’t handicapped by missing limbs in any way, in practical terms you can think of these as hit points  especially as there are screwdrivers to pick up which restore one limb.</p>"},{"name":"Incredible Hulk, The","year":1994,"developer":"Probe Software Ltd.","url":"d#Incredible%20Hulk%2C%20The%20%28USA%2C%20Europe%29.zip","filesize":998453,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p>In this side-scrolling action game you fight against your arch-enemy The Leader and his forces (Rhino, Absorbing Man, Abomination and Tyrannus).</p><p>Take control of the Hulk/Dr. Banner through five levels of action. City and Construction Site, Tyrannus' Labyrinth, Leader's Fortress, Leader's Interior, and the Final Confrontation.</p>"},{"name":"Indiana Jones and the Last Crusade","year":1992,"developer":"Tiertex Ltd.","url":"d#Indiana%20Jones%20and%20the%20Last%20Crusade%20%28USA%29.zip","filesize":490014,"score":5.6,"genres":"Action > Side view > 2D scrolling > Platform > Interwar > Licensed","desc":"<p>As in the movie (and the more famous graphic adventure), your task is to find the Holy Grail. Before this can be done you must find the Cross of Coronado, a shield and a diary. </p><p>This makes for a four-level arcade adventure combining climbs, exploration (with several routes through each level, and some traps) and puzzles. Indy is armed with his trusty whip to fight off foes, but can also get involved in hand-to-hand combat. The first level takes place in caves underneath Colorado, before you reach a moving circus train strewn with traps, a Zeppelin which is full of guards and ladders, and then Castle Grunwald in Austria.</p>"},{"name":"Insector X","year":1990,"developer":"Hot-B Co., Ltd.","url":"d#Insector%20X%20%28USA%29.zip","filesize":220187,"score":6.5,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Fantasy","desc":"<p>Mecha Insect forces collide in this side-scrolling shooter, set in a garden, passing buildings and other scenery. Fight wasps, bees and flies to decide the fate of the back yard.</p><p>There are three skill levels, with more enemies on the higher ones, and each level ends with a boss. As well as your main weapon, who can collect power-up tokens for special weapons, which are made available randomly.</p>"},{"name":"Instruments of Chaos Starring Young Indiana Jones","year":1994,"developer":"Waterman Design, Inc.","url":"d#Instruments%20of%20Chaos%20Starring%20Young%20Indiana%20Jones%20%28USA%29.zip","filesize":621640,"score":4.2,"genres":"Action > Side view > 2D scrolling > Puzzle elements > Licensed","desc":"<p><em>Germany</em> is growing its war machine to overtake the world. To reach this goal quickly, their evil leaders sent spies around the world with instructions to buy the finest military weapon technologies. The player is young Indiana Jones and he is informed by agent Rolf that friendly French agents know about such tasks and the countries the spies will visit. The spies need to be stopped in each country before the technology sale takes place.</p><p>The mission takes young Indy to India, Tibet, Egypt, and England before come finally arriving in Germany. In 2d side-scrolling levels Indy uses his whip, revolver, grenades, and ability to walk/jumpto progress through the levels with small puzzle elements. Enemies can be attacked or avoided and actions can be performed in eight directions. There are different mini-goals such as whipping key stones to open the door to the temple from Indian marketplace, or bombing a bridge gearbox.</p><p>There are three difficulty levels. The number of lives can be adjusted.</p>"},{"name":"International Rugby","year":1993,"developer":"Tiertex Ltd.","url":"d#International%20Rugby%20%28U%29.zip","filesize":251640,"score":"","genres":"Sports > Top-down > Rugby","desc":"<p><em>International Rugby</em> is a rugby game played from a top-down perspective. The game consists of tournament matches played as part of the world cup with countries such as England, USA, Argentina, France, Wales, Scotland, Fiji etc. In the options the type of tournament can be determined, along with the amount of wind and match length. Multiplayer is supported for two players.</p><p>At the kick off, during a scrimmage and whenever the ball goes over a side line, a meter appears to determine the power and curve. It is filled up automatically and the player has to press a button twice to time both aspects. While running with the ball, it can be passed along or kicked. In a defensive position it is possible to tackle and switch between players. Each player has individual statistics based on position, height, weight, speed, passing, rucking, tackling, tactics, kicking and injury. Fixtures for the world cup can be looked up on a separate screen.</p>"},{"name":"International Superstar Soccer Deluxe","year":1996,"developer":"Major A","url":"d#International%20Superstar%20Soccer%20Deluxe%20%28U%29.zip","filesize":1217929,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p>This is the sequel to International Superstar Soccer, Konami's saga of soccer games. This Deluxe version was published first to the SNES, then the Mega Drive and Playstation.</p><p>ISS Deluxe has realistic animations and player sprites. You can compete with 36 national teams with recognizable celebrity players (like Valderrama, Baggio, Ravanelli, Petkov...), but their names are fictitious. You can choose too from 16 formations and 8 strategies to win.</p><p>The competitions available are: International Cup, World Series (League), Scenario Mode and customizable mini-cups/leagues.</p>"},{"name":"Ishido: The Way of Stones","year":1990,"developer":"Software Resources International","url":"d#Ishido%20-%20The%20Way%20of%20Stones%20%28USA%29%20%28Unl%29.zip","filesize":61163,"score":6.7,"genres":"Strategy > Top-down","desc":"<p><em>Ishido</em> is a solitaire board game played with tiles, similar to Shanghai. The objective is to place all of the tiles onto the board and obtain the highest possible score by following specific rules of play. There are ways to play that can dramatically increase the score, which makes the game very strategic in nature. Additionally, when desired, the player can get an oracle reading by asking a question, which is answered when the player makes a very elegant play (four-way match). </p><p>There is also a \"construction set\" where players can create their own tiles and backgrounds. The game comes with numerous tile sets and backgrounds.</p>"},{"name":"It Came from the Desert","year":1990,"developer":"Cinemaware Corporation","url":"d#It%20Came%20from%20the%20Desert%20%28USA%29%20%28Proto%29.zip","filesize":295511,"score":8.1,"genres":"Action > Adventure > 1st-person > Top-down > 2D scrolling > Fixed / flip-screen > Sci-fi / futuristic > Detective / mystery","desc":"<p><em>It Came From the Desert</em> is an action-adventure game that derives its inspiration from the many cult-horror B-Movies of the 50's and 60's, the 1954 film <em>Them</em> in particular. The player plays the part of Dr. Greg Bradley, a geologist and the newest resident in town. Eager to satisfy his scientific mind, Bradley sets out to examine the crash-site of a mysterious meteor, but what he finds is not at all what he had been looking for.</p><p>The game takes place all over Lizard Breath, and there are several different types of action / interaction. The adventure part of the game is very linear, guiding the player in a fairly set sequence of action sections. These include first-person bug shooting, scrolling overhead shooting, and a chase sequence.</p>"},{"name":"Itchy & Scratchy Game, The","year":1994,"developer":"Bits Corporation","url":"d#Itchy%20%26%20Scratchy%20Game%2C%20The%20%28USA%29%20%28Proto%29.zip","filesize":517828,"score":5.6,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Platform > Licensed","desc":"<p>They fight! and fight! and fight, and fight, and fight!... Itchy &amp; Scratchy, from The Simpsons, are a cat and mouse cartoon duo. Itchy the mouse and Scratchy the cat exist only to find new and creative ways to attack and kill one another. As the latest cartoon adventures appear on the television, the violence spreads to brand new places.</p><p>Itchy &amp; Scratchy is a single player platform side-scroller. The player controls Itchy, the mouse, and must defeat Scratchy, the cat, with a variety of weapons. Itchy caries a default mallet, but can pick up additional weapons on particular levels. Each of the seven levels takes place in a different fictional location and is designed as a maze of doors and platforms. After defeating Scratchy, he usually will return with a special contraption to attack Itchy, and must therefore be defeated again.</p>"},{"name":"Izzy's Quest for the Olympic Rings","year":1995,"developer":"Alexandria, Inc.","url":"d#Izzy%27s%20Quest%20for%20the%20Olympic%20Rings%20%28USA%2C%20Europe%29.zip","filesize":963562,"score":6.5,"genres":"Action > Side view > 2D scrolling > Licensed","desc":"<p>Izzy's Quest for the Olympic Rings is the official game of the mascot of the 1996 Olympic Games in Atlanta. As the name suggests, Izzy must find the five Olympic rings, hidden by the guardians so that Izzy does not take them to his world.</p><p>The game plays a lot like Mario games; to eliminate an opponent Izzy must jump over his head. There are two jumps available, the ball jump suitable for height and the hurdle jump, suitable for distance. Both allow Izzy to clear an enemy, but the second harms  him.If Izzy is hit, then he must find three medals, or at the next hit he loses a life. There are some extra objects, like Olympic torches, and eggs that hatch either objects for bonus points, trampolines or  morph points to reach otherwise inaccessible areas or traps. Izzy can also morph into a glider, a baseball player, an archer or a rocket, among others, to overcome some sections of the levels.</p><p>Graphics and sound remain faithful to the cartoony origins of the mascot.</p>"}]