[{"name":"Ka-Ge-Ki: Fists of Steel","year":1991,"developer":"Kaneko Co., Ltd.","url":"d#Ka-Ge-Ki%20-%20Fists%20of%20Steel%20%28USA%29.zip","filesize":425256,"score":5.7,"genres":"Action > Diagonal-down > 2D scrolling > Anime / Manga > Arcade > Fighting","desc":"<p><em>Ka•Ge•Ki</em> is a slightly-angled 3rd person beat-'em-up set around underground fighting matches a la Pit-Fighter in which you must take down every member of a notorious biker gang. Each match begins with a showdown with several weaker henchmen and then moves on to next of the 9 gang members, who must be KO'd 3 times before moving on to the next round.</p><p>The game allows you to move your character in any direction, provided he doesn't leave the confines of the arena, and allows you to attack via mostly a combination of button presses that also trigger dodges and parries depending on the button pressed.</p><p>Graphics are 2D with a unique super-deformed design (stocky bodies with gigantic heads).</p>"},{"name":"Kawasaki Superbike Challenge","year":1995,"developer":"Lankhor","url":"d#Kawasaki%20Superbike%20Challenge%20%28USA%2C%20Europe%29.zip","filesize":474052,"score":6.5,"genres":"Racing / Driving > 1st-person > Motorcycle > Licensed","desc":"<p><em>Kawasaki Superbike Challenge</em> is a motorcycle racing game that uses the same engine as F1. It includes 14 standard-length race tracks, plus the Suzuka 8 Hours endurance race, available in both training and Championship modes. The game is unlicensed (except by Kawasaki), so all riders and teams are fictional.</p><p>The game now has more polygonal roadside objects than <em>F1</em>, and there is still a Turbo mode, allowing for faster racing at the expense of some of the detail. You have the ability to turn on or off weather (during rainy days the graphics are darker and the bike has less traction). The number of laps on each course can be 5, 10 or 15, and there are 4 skill levels. Some changes have been made to how the vehicle handles, to emphasize the switch from cars to bikes.</p>"},{"name":"Kick Off 3: European Challenge","year":1994,"developer":"Anco Software Ltd.","url":"d#Kick%20Off%203%20-%20European%20Challenge%20%28U%29.zip","filesize":375864,"score":6.8,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p><em>Kick Off 3: European Challenge</em> is an updated version of Kick Off 3. Whereas the original game only featured national teams, this version allows the player to take control of all club teams from the top divisions of five European countries: England, Germany, France, Italy and Spain. For each country a league or a cup can be played and there is also a European cup with teams from all countries as well as individual friendlies. The European cup and friendlies also allow the player to select teams from other countries. For copyright reasons, all player names are misspelled (for example Barcelona features Rommario, Haggi and Coeman). The names can however be edited.</p><p>There are also some changes to the gameplay. This includes changes to the control systems to make it playable with a one button joystick (on Amiga) and new sound effects (for example when goals are scored) and improved graphics with more animations. Another addition is special key players that bring special playing styles to their sides.</p>"},{"name":"Kid Chameleon","year":1992,"developer":"Sega Technical Institute","url":"d#Kid%20Chameleon%20%28USA%2C%20Europe%29.zip","filesize":747045,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Direct control","desc":"<p><em>Kid Chameleon</em> is a side-scrolling platform game in which the main character has entered a virtual reality game called \"Wild Side\" to free the other kids inside that have been captured. He can change his shape into various other forms, justifying his nickname. This gives him special abilities which must be used to pass each of the game's 100+ stages. All these stages must be played in sequence without any save or password feature.</p>"},{"name":"Kidō Keisatsu Patlabor: 98-Shiki Kidō seyo!","year":1992,"developer":"Advance Communication Company"},{"name":"King of the Monsters","year":1993,"developer":"SNK Corporation","url":"d#King%20of%20the%20Monsters%20%28USA%29.zip","filesize":598789,"score":6.1,"genres":"Action > Diagonal-down > Arcade > Fighting > Sci-fi / futuristic","desc":"<p><em>King of the Monsters</em> is a two player (or one player vs. computer) fighting game, in which the players take control of two gargantuan monsters (like Godzillas) and battle it out in different city locations.</p><p>The city gets gradually destroyed as the two creatures fight it out. The players can also interact with the scenery by picking up boats and such, to use as weapons against the other player.</p>"},{"name":"King of the Monsters 2","year":1994,"developer":"Betop","url":"d#King%20of%20the%20Monsters%202%20%28USA%29.zip","filesize":1145237,"score":6.8,"genres":"Action > Diagonal-down > 2D scrolling > Fighting > Horror","desc":"<p><em>King of the Monsters 2</em> on the Sega Genesis is a slightly different game than the original Neo Geo version. While the original let you play one of three different monsters to go through side-scrolling beat'em-up stages and fight (non-playable) monster as boss enemies, the Genesis version was re-worked into a one-on-one fighter similar to the first King of the Monsters game. </p><p>Apart from Farmardy, all characters from the Neo Geo version are playable. To win, the player must defeat all other monsters and a clone of the played monster in a fight. The matches take place in areas built from the original levels, and feature destroyable landscapes and secondary enemies, both of which can be smashed to gain points and power-ups.</p>"},{"name":"King Salmon: The Big Catch","year":1992,"developer":"Hot-B Co., Ltd.","url":"d#Kid%20Chameleon%20%28USA%2C%20Europe%29.zip","filesize":747045,"score":6.8,"genres":"Simulation > Sports > Top-down > Fishing","desc":"<p><em>King Salmon: The Big Catch</em> is a fishing competition simulator: a player has to spend a day fishing for king salmon. Activities simulated include driving a boat to choose the best place to fish, choice of lures, line lengths, fishing depths, driving a boat to troll for salmon and, finally, pulling the caught fish out. The objective is to overcome some fictional fishermen, played by computer, in terms of the fish caught.</p><p>Game also includes simple role-playing elements, as player's skill improve with time and experience and it's possible to catch bigger and better fish successfully.</p>"},{"name":"King's Bounty: The Conqueror's Quest","year":1991,"developer":"New World Computing, Inc.","url":"d#King%27s%20Bounty%20-%20The%20Conqueror%27s%20Quest%20%28USA%2C%20Europe%29.zip","filesize":250424,"score":7.3,"genres":"Strategy > Top-down > Turn-based > Fantasy","desc":"<p>As a knight, paladin, barbarian or sorceress, amass an army of creatures to take on the local baddies and search for the Sceptre of Order.  A turn-based game with a time limit that decreases depending on the skill level you play at.</p><p>Depending on your allegiance, you will initially start with a different set of creatures, though the king will not mind whether you're his knight or a barbarian. Game consists of four maps, each with more mean creatures to control and meaner opponents to fight, but conquering one of the more difficult maps early will let you find and buy stronger creatures that will help you conquer prior maps easily.</p><p>You can see all the enemies on the map and can literally clear them all out, though random monsters can appear in your castles if you leave them unprotected after you conquered them. With each conquered castle (assuming the castle is occupied by the enemy you are currently after), you will get a level up. After two level ups, you will get promoted by the king, which allows you to recruit cavalry units from the castle, then knights once you get four other extra levels. All the other creatures are found outside the king's castle and can be recruited no matter the level, although it determines the quantity of creatures you can find for recruitment. You also have to manage your money carefully, as your army needs to be paid on a regular basis to not desert or turn against you.</p><p>There are also two artifacts per map that will reveal the map where the King's Sceptre is lying. The moment you find the sceptre and bring it back to the king, the game will end regardless of how far you progressed.</p><p>As for tougher enemies, like the final one having hundreds of dragons and demons, they can also be defeated, but not by the army you can muster in one go. When you're defeated, you respawn back at the king's castle and start with almost nothing but your money, but the enemy in the other castle won't get back their creatures lost in battle either (only the new ones that join their ranks every week).</p>"},{"name":"Kishi Densetsu","year":1993,"developer":"Warlock"},{"name":"Kiss Shot","year":1992,"developer":"SEGA Enterprises Ltd."},{"name":"Klax","year":1990,"developer":"Tengen Inc.","url":"d#Klax%20%28USA%2C%20Europe%29%20%28Tengen%29.zip","filesize":110276,"score":7.8,"genres":"Action > Puzzle > Diagonal-down > Fixed / flip-screen > Arcade > Falling block puzzle","desc":"<p>An action/puzzle game, the object is to catch assorted color falling tiles and create rows, columns, or diagonals of a single color. Each level requires a different pattern to be made, and the tiles fall faster, more at a time, and in an increasing number of colors as the game progresses.</p>"},{"name":"Krusty's Super Fun House","year":1992,"developer":"Audiogenic Software Ltd.","url":"d#Krusty%27s%20Super%20Fun%20House%20%28USA%2C%20Europe%29.zip","filesize":271115,"score":6.6,"genres":"Action > Side view > 2D scrolling > Puzzle elements > Licensed","desc":"<p>Krusty the Clown's Fun House has been overrun by rats.  You must help him to herd the rats into trap machines to clear them out.  In order to do so, Krusty must manipulate his environment to set up pathways so that the rats are headed in the right direction.  Objects that Krusty move around include blocks, fans, and pipe pieces.</p><p>The trap machines are operated by other recognizable Simpsons characters:  Bart, Homer, Sideshow Mel, and Corporal Punishment.</p>"},{"name":"Kyūkai Dōchūki","year":1991,"developer":"Namco Limited"}]