[{"name":"l'Abbaye des Morts","year":2017,"developer":"Locomalito"},{"name":"La Citadelle du Chaos","year":2020,"developer":"Studio Vetea"},{"name":"La Russa Baseball 95","year":1994,"developer":"High Score Productions","url":"d#La%20Russa%20Baseball%2095%20%28USA%2C%20Australia%29.zip","filesize":904025,"score":7,"genres":"Sports > Diagonal-down > Fixed / flip-screen > Isometric > Baseball > Licensed","desc":"<p>With LA RUSSA BASEBALL '95, you not only get more than 700 Major League Baseball stars, you also get to the wisdom and experience of manager Tony La Russa. Considered to have one of the best baseball minds the game has ever seen, La Russa will offer his strategy and tips throughout the game, so you'll know exactly what he would do in a similar situation. There are three difficulty levels to choose from, and two different gameplay styles: Slugfest, which offers arcade-style action; and Sim, which puts every decision and every play in your hands. You can choose from 28 Major League teams, track your players' stats in all the major categories, and you can even choose whether you want to play or just manage your team. Step up to the plate and see if you can manage the game like La Russa does.</p>"},{"name":"Lakers versus Celtics and the NBA Playoffs","year":1990,"developer":"Electronic Arts, Inc.","url":"d#Lakers%20versus%20Celtics%20and%20the%20NBA%20Playoffs%20%28USA%2C%20Europe%29.zip","filesize":263921,"score":6.3,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p><em>Lakers vs. Celtics</em> on Genesis is an update of the game of the same name for PCs. It features the same perspective, same action-oriented gameplay with an emphasis on offense, and the same game modes: exhibition games and the playoff tournament mode. </p><p>It features ten NBA teams from the '89-'90 season. Compared to the PC version, it also adds more signature moves, different home- and away-jerseys, animated coaches, TV-style scenes from other games in the halftime show, player portraits for the starting five, voice samples for the referee and counts the number of personal fouls a players has committed, making it possible for them to foul out.</p>"},{"name":"Landstalker","year":1992,"developer":"Climax Entertainment","url":"d#Landstalker%20%28USA%29.zip","filesize":1402384,"score":8.3,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Anime / Manga > Platform > Puzzle elements > RPG elements > Regional differences","desc":"<p>An experienced treasure hunter named Nigel is on a quest to obtain the valuable Statue of Jypta. After successfully recovering and selling the statue, Nigel meets wood nymph named Friday, who is being chased by a trio of thieves. The thieves assume that Friday knows the location of the mysterious treasure of King Nole. However, she does not appear to have the exact location in mind, and instead relies on her senses to track it. She offers Nigel to accompany him on a long journey and eventually lead him to the coveted treasure.</p><p><em>Landstalker</em> is an isometric action game with platforming, puzzle-solving, and light role-playing elements. Much of the game is spent in dungeon-like hostile areas, where Nigel must often fight enemies, jump, climb ladders and ropes, and throw objects to overcome obstacles and solve puzzles. Nigel can acquire better weapons and armor, as well as items that permanently increase his hit points and strength. In towns it is possible to talk to non-player characters and buy items in shops. There are optional quests in the game, which may reward the player with attribute-increasing items.</p>"},{"name":"Langrisser II","year":1994,"developer":"NCS Corporation","url":"8#Sega%20-%20Genesis.zip/Langrisser%20II%20%28Japan%29%20%28Rev%20B%29%20%5BT-En%20by%20M.I.J.E.T.%20v110701%5D.zip","filesize":1,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > Top-down > 2D scrolling > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Langrisser II</em> is a sequel to Warsong (whose original title is <em>Langrisser</em>). The events of the game take place several years after those described in <em>Warsong</em>. Gone is the benevolent kingdom of Baltia, and a new power has risen - the Rayguard Empire, which has made a pact with the malevolent Lord Böser, whose intention is to find the most powerful evil sword in the land, the Alhazard. The main hero of the game, the knight Elwin, must help the Descendants of Light to retrieve the legendary holy sword Langrisser, the only artifact that is more powerful than Alhazard. </p><p>Like its predecessor, this is a turn-based strategy game with RPG elements. The army is divided into soldier units and generals, who fight alone and who are usually stronger than a whole unit. Before the scenario begins, you must hire soldiers, buy weapons and items, etc. During the battle, if you come into contact with an enemy unit, an automatic battle sequence occurs. You can also cast healing spells on your units or offensive spells to hurt the enemy.</p>"},{"name":"Last Action Hero","year":1993,"developer":"Bits Studios Ltd.","url":"d#Last%20Action%20Hero%20%28USA%2C%20Europe%29.zip","filesize":337126,"score":4.7,"genres":"Action > Racing / Driving > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p>The 16-bit console version of the movie license <em>Last Action Hero</em> combines side-scrolling beat'em up levels with driving sequences.</p><p>Players control action hero Jack Slater through four beat'em up levels. The first two are inspired by the beginning sequence of the movie (the finale of \"Jack Slater III\"), the third by the hotel funeral inside the movie world, and the last by the premiere of \"Jack Slater IV\" in the real world. Slater must move to the level exit before the timer or his energy runs out. Various goons stand in his way and must be defeated through kicks or punches. There are four varieties of enemies in the game, wielding either knives, baseball bats, Molotov cocktails or guns. Spent life energy can be refilled by collecting movie tickets that sometimes fall from the sky. The Genesis version adds an additional twist in the first level: a crosshair will follow Slater around and randomly shoot bullets at him. All except the first stage end with a boss fight. Bosses include The Ripper, a helicopter and main villain Benedict.</p><p>The driving sequences are also seen from the side. Slater's car must avoid hitting cars and trucks parked on the road while trying to destroy enemy cars by jumping over a ramp and then landing on top of them.</p><p>Cutscenes tell the story of the film between levels, following the original plot only loosely.</p>"},{"name":"Last Battle","year":1989,"developer":"SEGA Enterprises Ltd.","url":"d#Last%20Battle%20%28USA%2C%20Europe%2C%20Korea%29.zip","filesize":303058,"score":5.1,"genres":"Action > Side view > Arcade > Beat 'em up / brawler > Post-apocalyptic > Martial arts","desc":"<p><em>Last Battle</em> is a side-scrolling beat-em-up game in which the player takes control of a martial artist named Aarzak who must single-handedly (and -footedly) defeat the lackeys of an evil fighter called Duke, and eventually stand against three generals who have kidnapped his girlfriend. The hero fights using punches and kicks, combining these moves with jumping and crouching. He also has a special power meter that refills over the time. When the power meter is full, Aarzak gains a boost that allows him to perform rapid attacks for the rest of the stage. </p><p>Most of the levels are simple scrolling areas that the player needs to complete within a time limit. Some levels, however, are more maze-like, requiring the player to explore them in order to find the exit. Bosses await Aarzak at the end of most stages. He will also encounter allies who will increase his offensive or defensive strength, or replenish his health. </p><p>The original Japanese version is based on the <em>Fist of the North Star</em> manga and anime; the protagonist is Kenshiro, the main hero of the series. All character names have been changed in the translated version, which also has reduced gore. However, the rest of the visuals, gameplay, and locations remain identical.</p>"},{"name":"Lawnmower Man, The","year":1994,"developer":"The Sales Curve Ltd.","url":"d#Lawnmower%20Man%2C%20The%20%28USA%2C%20Europe%29.zip","filesize":400002,"score":6.2,"genres":"Action > 1st-person > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p><em>The Lawnmower Man</em> is the game based on the 1992 movie of the same name (itself loosely based on a Stephen King short story) starring pre-Bond fame Pierce Brosnan as Dr. Lawrence Angelo, a scientist working for Virtual Space Industries in \"Project 5\", a secret research that attempts to increase the intelligence of primates using psychotropic drugs and VR training. </p><p>With his reluctance to aim the research to military purpose, after one of the chimps escapes and shoots a guard in the process he is given a forced vacation, and while taking notes on the need for experiment with a human subject, he notices Jobe Smith (Jeff Fahey), a simpleton who makes his living on odd jobs such as mowing the grass (hence, the title role). The first experiments quickly increase Jobe's intelligence, and while after an accident Angelo stopped the experiments, The Shop, a secret agency overviewing Project 5, reinserted the drugs responsible for violent behaviour into the program and sped up the treatment. As Jobe starts to develop telekinetic powers, he starts to take revenge on those who abused him before he started the treatments, and plots to take over all computers in the world.</p><p>While the CD version of the game (PC, Mega CD) is an interactive movie, both cartridge versions are platformers, the player taking control of Dr. Angelo or Carla Parkette (mother of Jobe's best friend) in typical side-scrolling shooting action. The player can collect better weapons or data discs, which after collecting a number of them allow to morph into the Virtual Suit, which gives protection against a first hit. The player visits several locations seen in the movie, such as the gas pump and the VSI headquarters. </p><p>The twists of the game are true-3D level connectors, based on the CG sequences of the movie, usually all involving avoiding obstacles (and the occasional shooting) at high speed in the VR world. There are four different (Virtual World, Cyber War, Cyber Run and Cyber Tube), each taking a slightly different approach (Virtual World is seen in first person, the objective being dodging obstacles such as trees and archs and reach the exit, Cyber War similar to Virtual World but with some shooting stops, Cyber Run is seen in third person and requires occasional shooting of obstacles, while Cyber Tube is a fast travel with plenty of enemies in a VR tunnel).</p>"},{"name":"Legend of Galahad, The","year":1992,"developer":"Traveller's Tales (UK) Ltd.","url":"d#Legend%20of%20Galahad%2C%20The%20~%20Galahad%20%28USA%2C%20Europe%29.zip","filesize":703300,"score":7.9,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Fantasy","desc":"<p>The titular hero travels through this platform action game, slashing up mutant creatures with a sword and battling the evil Thanatos in hopes to save the life of Princess Lucanna.</p><p>The controls are fairly simple and include jumping, walking or attacking. Collect icons that will help in the enhancement of your armor, gain an extra life and coins to spend in the shop for new weapons. Be sure not to collect any skull icons or else it will call Thanatos' Ethereal Presence where you will have to use Rune Bombs to destroy it. After you complete one of the three worlds, you will be given a password so you can resume later after running out of lives.</p>"},{"name":"Legend of Wukong","year":1996,"developer":"Gamtec Corp.","url":"d#Legend%20of%20Wukong%20%28World%29%20%28Unl%29.zip","filesize":619514,"score":"","genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Turn-based > Fantasy","desc":"<p>After putting the finishing touches on his new time machine, the prestigious Dr. Tang steps back to admire his life's work only to see it vanish before his very eyes. Waking up hundreds of years in the past, the doctor's young and careless neighbor soon realizes the shocking mistake he made while playing around in the laboratory. Pursued by hordes of fierce demons, will he survive long enough to retrieve the time machine and return home?</p><p>During the course of the adventure, players take control of a young, monkey-faced boy named Wukong who goes in search of his time machine in order to return to the year 1996. Along the way he is joined by Pigsy, a man-pig hybrid, and Wujing, a kind and beautiful young girl. </p><p><em>Legend of Wukong</em> is a Chinese-made role-playing game in Japanese style. The game's story and characters are loosely based on the classic Chinese novel <em>Journey to the West</em>. The gameplay follows the Japanese template, with a party of heroes roaming a top-down world map, visiting towns and hostile areas, and fighting enemies in turn-based combat using either regular attacks or magic.</p>"},{"name":"Lemmings","year":1992,"developer":"DMA Design Limited","url":"d#Lemmings%20%28Japan%2C%20USA%29.zip","filesize":492807,"score":7.8,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Point and select > Fantasy","desc":"<p>Your task is to rescue the Lemmings across 120 levels of fast-paced puzzling. These creatures simply walk blindly through the world in the hope of reaching safety at the end of the level - unfortunately, these levels include steep drops, gaps in the ground, barriers, and rivers amongst other hazards.</p><p>You are in control not of any individual Lemming, but of a cross-hair, which can be moved over any of the Lemmings. Along the bottom is a selection of functions that can be assigned to a Lemming, including climbing, floating, and bashing. You must click to select the appropriate function, then click on the Lemming to activate it. Each level has a different range of skills on offer, a different amount of Lemmings, and a different percentage target in order to progress.</p>"},{"name":"Lemmings 2: The Tribes","year":1994,"developer":"DMA Design Limited","url":"d#Lemmings%202%20-%20The%20Tribes%20%28USA%29.zip","filesize":754729,"score":7.9,"genres":"Puzzle > Side view > 2D scrolling > Real-time > Platform > Multiple units/characters control > Point and select","desc":"<p>The sequel to Lemmings has a plot describing how the Lemmings have split into 12 distinct tribes. Each tribe has its own landscape and cultural identity - they include Egyptian, Circus, and Highland. However, Lemming Island is now in danger, and you must complete 10 levels for each tribe in order for them to reunite and reassemble the Talisman from the 12 pieces.</p><p>Across the 120 levels, there are over 60 skills, although no more than 10 are in use on each screen. The Classic tribe has the ones from the original and is perhaps the best option for first-time players. </p><p>The others range from digging methods such as a scooper (diagonally downwards) and club basher (horizontal), building skills such as a planter (takes time to produce the desired raise to the landscape) and a sand pourer, and various methods of movement including a Pole-Vaulter and a Skater (the only Lemmings who can cross ice). Some of these are only subtly different from others, and their exact uses are unclear, but there are 4 Trainer levels where you can select any combination of skills and experiment.</p><p>Unlike the first game, the player is rewarded for saving as many Lemmings as possible, rather than simply passing or failing. The ultimate aim is to save all 60 Lemmings through all levels, thereby earning a Gold Medal for that tribe - Silver and Bronze are also on offer. The player can also go back over levels in the hope of saving more Lems. </p><p>Because there are 12 tribes, and the player can switch between them at any point, you have to be stuck 12 times to be unable to progress. The game saves progress rather than using passwords as in the first game.</p>"},{"name":"Lethal Enforcers","year":1993,"developer":"Konami Co., Ltd.","url":"d#Lethal%20Enforcers%20%28USA%29.zip","filesize":1679859,"score":7.3,"genres":"Action > 1st-person > Arcade > Rail shooter","desc":"<p>Pick up your pistol and be the cop you need to be in order to rid the streets of the criminals out to make your day hell. Aim wisely and quickly, otherwise your lives will be lost quickly in this 1st person arcade shooter, cleaning up the streets. The higher the difficulty level, the more crimes there will be to eliminate, but watch out for the other weapons that can help you along the way. Go straight into the mayhem, practice in the targeting range or have a friend back you up in two player mode. </p><p>The Arcade version has two game modes that can be selected by the operator: Arcade mode (the stages are played in strict order) and Street mode (a desired stage can be selected by players).</p><p>Home console version can be played with either a standard gamepad or light gun accessory.</p>"},{"name":"Lethal Enforcers II: Gun Fighters","year":1994,"developer":"Konami Co., Ltd.","url":"d#Lethal%20Enforcers%20II%20-%20Gun%20Fighters%20%28USA%29.zip","filesize":1667008,"score":7.1,"genres":"Action > 1st-person > Arcade > Rail shooter > Western","desc":"<p>In this sequel to Lethal Enforcers you are the sheriff of a town set in the old Wild West. Using the control pad or Konami's own Justifier lightgun, you'll be taking out outlaws who are robbing banks and kidnapping innocents. You have the opportunity to upgrade and keep you gun, as long as you don't shoot the people you are trying to save.</p><p>The action is usually shown on a single screen with enemies \"popping out\" from various sections. If you do not shoot them in time they will either shoot or throw various weapons at you. You will lose energy if they hit you or you hit an innocent civilian.</p>"},{"name":"LHX: Attack Chopper","year":1992,"developer":"Electronic Arts, Inc.","url":"d#LHX%20Attack%20Chopper%20%28USA%2C%20Europe%29.zip","filesize":526242,"score":7.5,"genres":"Action > Simulation > 1st-person > 3rd-person (Other) > Helicopter > Vehicular combat","desc":"<p>LHX: Attack Chopper is a helicopter simulation with a strong arcade focus. You can freely choose which missions to fly first, and which helicopter to fly in a given mission. There are a total of four helicopters: Apache, Blackhawk, Osprey and LHX. With this fine selection of death machines you will engage countless enemy targets in Libya, East Germany and Vietnam throughout the game.</p>"},{"name":"Liberty or Death","year":1994,"developer":"KOEI Corporation","url":"d#Liberty%20or%20Death%20%28USA%29.zip","filesize":647516,"score":6.6,"genres":"Strategy > Top-down > Turn-based > Historical events > North America > War","desc":"<p><strong>STORY</strong>  </p><p>The European Wars against Spain and France have been costly to the British Empire. In order to gain additional funds for the war effort, the Crown raise taxes from the New World colonies without representation. This act compels the New World colonies to protest and boycott against British rule. By 1775, the Crown alarmed by the protests, boycotts and politically instability in the New World sends troops to subdue any rebellious efforts by the New World colonists. This threatening approach provokes the Thirteen Colonies to revolt. Thus starts the War for Independence in the New World (American Revolutionary War).</p><p><strong>GAMEPLAY</strong>  </p><p><strong>Choosing Sides</strong>  </p><p>In Liberty or Death, you partake in the American Revolutionary War, either as the \"rebels\" - the American Continental Army or as the \"Crown\" - the British Royal Army.</p><p>Choosing either one of the nations will prompt you to choose the leading Commander-in-Chief:</p><ul><li>The Continental Army: Charles Lee, Artemas Ward or George Washington.</li><li>The British Royal Army: Henry Clinton, Thomas Gage or William Howe.</li></ul><p><strong>Revolutionary Politics</strong>  </p><p>Each turn you will have to balance your treasury for the war effort. Money is provided by each state. The more states that support your cause, the more money will flow in your coffers. Money is spent in paying wages, strengthening the fleet and recruiting new regiments.</p><p>Here, if you have a sufficient fleet, you can also command your Navy officer to \"control the seas\" which is conducting a blockade and privateering against enemy ships. This may result in seized goods that will be added to your treasury. </p><p>The American Revolutionary War in Liberty or Death included everyone except the American Indians: [1] Revolutionary Militia: American supporters but not yet fully supportive of Continental Army (not under your full control) [2] Loyalist Militia: Militia supportive to the Crown [3] French Army: The French will support the American cause after a formal alliance is held. [4] Spanish Army: The Spaniards will support the American cause after a formal alliance is held.</p><p><strong>Revolutionary Combat</strong>  </p><p>The top-down turn-based combat introduces units available in the Revolutionary War: Infantry, Guerrilla, Cavalry and Artillery (Engineers). Combat near shores may also be joined by Naval units: Fleet and Fires Ships.</p>"},{"name":"Light Crusader","year":1995,"developer":"Treasure Co., Ltd.","url":"d#Light%20Crusader%20%28USA%29.zip","filesize":1201812,"score":7.5,"genres":"Action > Diagonal-down > Isometric > Puzzle elements > Fantasy","desc":"<p>In <em>Light Crusader</em>, you play the role of Sir David, a knight in the service of King Frederick. You are sent to the town Green Row to help your king's brother, King Weeden, to discover what has caused the mysterious disappearance of his town people. You must enter and explore huge dungeons in order to find out about an ancient story that has happened many years ago, and to face evil forces who threaten the land.</p><p><em>Light Crusader</em> is an isometric action/puzzle adventure with RPG elements, along the lines of Landstalker. You can talk to townspeople, buy weapons and items, etc. You spend most of the game in dungeons, which are populated by enemies (whom you fight in real-time combat), and which are full of various types of traps and puzzles. You'll often have to jump to access higher levels or platforms, push switches and other objects to help you advance, and solve various physical puzzles.</p>"},{"name":"Lightening Force: Quest for the Darkstar","year":1992,"developer":"Technosoft Co., Ltd.","url":"d#Lightening%20Force%20-%20Quest%20for%20the%20Darkstar%20%28USA%29.zip","filesize":729601,"score":8.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Shooter > Sci-fi / futuristic","desc":"<p>The Galaxy Federation has defeated the forces of the Orn Empire. But the former allies of Orn have united into a single powerful army known as Vios. The Galaxy Federation attacks their headquarters on the planet Aceria, but loses the battle. They then develop a new fighter spacecraft, the FIRE LEO-04 Rynex, and send a trained pilot to neutralize the Vios.</p><p><em>Quest for the Darkstar</em> (<em>Thunder Force IV</em> in Japan and Europe) is, like its predecessor, a side-scrolling shoot-em-up. The gameplay system is similar to that of the previous game, upgradeable default weapons as well as additional ones that can be collected throughout the stages. Unlike the previous games, the player can choose between four different initial stages. It is possible to control the game's speed by tapping or pressing a correspondent button. Another new addition is a powerful Thunder Sword weapon, which the player acquires halfway through the game.</p>"},{"name":"Lion King, The","year":1994,"developer":"Westwood Studios, Inc.","url":"d#Lion%20King%2C%20The%20%28World%29.zip","filesize":1587738,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Africa > Fantasy > Licensed","desc":"<p>Young Simba just can't wait to be king. His father is the current King of the Savannah and the young prince is able to frolic the lands at will; jumping on and around other subjects of this animal kingdom. When Simba's father, King Mufasa, is killed and his evil brother Scar takes over the kingdom, Simba is banished from the lands of his birthright and has to grow up fast, honing his skills, for the day of his return.</p><p><em>The Lion King</em>, based on the famous Disney movie, is a platform game where you control Simba - initially as a young cub, and later as an adult lion. The plot of the game follows the plot of the movie. Each of the levels represents a part of the movie. </p><p>As young Simba, you can fight various beasts, such as lizards, by jumping on them. You can also roar to scare some creatures into submission, though every time you roar, you have to wait for your \"roar meter\" to charge. </p><p>As an adult lion, you can still roar and jump, but now you fight enemies by slashing at them with your claws (if you're skillful enough, you can also grab them and toss them off the screen). </p><p>The game features no in-game save function, and it needs to be replayed from the beginning every time.</p>"},{"name":"Little Medusa","year":2018,"developer":"Mega Cat Studios"},{"name":"Lobo","year":1996,"developer":"Ocean Software Ltd.","url":"d#Lobo%20%28USA%29%20%28Proto%29.zip","filesize":1458923,"score":"","genres":"Fighting","desc":"<p>LOBO is a cancelled fighting game that was meant to be released for the Super Nintendo and the Sega Mega Drive / genesis,  settled up in the DC Comics’ LOBO universe. Ocean was planning to release this in 1996, but it was cancelled for both platforms at the last minute. A prototype of the game was found by the SegaSaturno community and they released it with the help of Hidden Palace!</p>"},{"name":"Lord Monarch","year":1994,"developer":"Nihon Falcom Corp."},{"name":"Lost Vikings, The","year":1993,"developer":"Silicon & Synapse, Inc.","url":"d#Lost%20Vikings%2C%20The%20%28USA%29%20%28October%2C%201995%29.zip","filesize":704520,"score":7.9,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Fantasy > Sci-fi / futuristic > Comedy","desc":"<p>Three Vikings, Eric the Swift, Olaf the Stout, and Baleog the Fierce, were kidnapped by the alien Tomator, the evil Croutonian ruler, who is collecting unique life forms to display in his gallery. The three Vikings will have to combine their unique skills to defeat Tomator, as well as a vast array of aliens, robots, giant snails, big lizards, and more.</p><p><em>The Lost Vikings</em> is a side-scrolling platform puzzle game with a twist. Instead of one character who can jump, run, shoot, collect items, flip switches, and so on, there are three different characters, each with his own skills. Eric the Swift can jump, run and bash through walls with his tough helmet. Olaf the Stout has a shield which can block attacks, function as an air glider or as a step to stand on. Baleog the Fierce can shoot things with his arrows (including switches) or kill things with his sword. The player has to use the three Vikings as a team if he wants to get past the increasingly difficult levels and puzzles.</p><p>The player controls one Viking at a time but can switch between them at any point. The Vikings have limited space in their inventory which they can use to keep various items. Each Viking has three health points, and if he loses them all from confrontations with dangers, he dies (some threats kill instantly), and the level must be restarted.</p>"},{"name":"Lost World, The: Jurassic Park","year":1997,"developer":"Appaloosa Interactive Corporation","url":"d#Lost%20World%2C%20The%20-%20Jurassic%20Park%20%28USA%2C%20Europe%29.zip","filesize":2033014,"score":7,"genres":"Action > Top-down > 2D scrolling > Shooter > Licensed","desc":"<p>The game situates itself on the \"Isla Sorna\" sites of Jurassic Park, a concept originally based on the Steven Spielberg series of movies. You play the role of a bounty hunter trying to catch some prized dinosaurs. This game is not a side scrolling platform game like the other two Jurassic Park games on the Genesis. This is a top-down view game like the SNES version of Jurassic Park, with gameplay similar to The Chaos Engine.</p><p>Each of the four Isla Sorna sites contains three missions. Once you have completed the three missions you unlock the boss mission. For a change in the game, the boss missions are 3D look-alike levels. Once the four sites are cleared you get two more final missions to complete the game.</p>"},{"name":"Lotus II","year":1993,"developer":"Magnetic Fields (Software Design) Ltd.","url":"d#Lotus%20II%20%28USA%2C%20Europe%29.zip","filesize":483400,"score":7.6,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Street racing > Licensed","desc":"<p>Licensed by the classic British car company, this game featured 2 modes of play - one has you racing against 19 computer rivals (with witty names such as Alain Phosphate and Crash-Hard Banger), and the other pits you against the clock. </p><p>There are 13 different types of races, ranging from Motorways to night-time to sections punctuated by roadworks, and some are lap-based with others being simple A-B. 2 players could play on a split screen mode.</p><p>The game's crowning glory, however, was the RECS editor, which allowed you to create courses of your own, with theoretically millions possible.</p>"},{"name":"Lotus Turbo Challenge","year":1992,"developer":"Magnetic Fields (Software Design) Ltd.","url":"d#Lotus%20Turbo%20Challenge%20%28USA%2C%20Europe%29.zip","filesize":444581,"score":8,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing > Licensed","desc":"<p>This sequel to Lotus Esprit Turbo Challenge is again a behind-the-car viewed racing game. The racing takes place in eight distinct circuits, with new surface and weather effects such as desert and snow. Later in the game, you must race through two-way motorways with oncoming traffic (incorporating civilian cars and trucks), and face tougher levels aided by speed and time boost pick-ups.</p><p>You are no longer racing directly against other cars or over laps; instead, racing is time-based as you have limited time to reach each checkpoint. Reaching each of these extends your time, and any remaining time is turned into bonus points if you successfully complete the track.</p><p>You have two cars at your disposal, which the game chooses automatically for each level. The Lotus Esprit from the original is joined by a Lotus Elan convertible, which is slower but has better grip, hence the loss of the word 'Esprit' from the title.</p><p>You can play through the set of tracks either in full-screen or (with another player) split-screen mode. On Amiga and ST the game allows you to link two machines, each of which can have two human players. If one player successfully completes one of the 8 courses, all players can continue onto the next one.</p>"},{"name":"Lufia & the Fortress of Doom","year":1993,"developer":"Neverland Co., Ltd.","url":"d#Lufia%20%26%20the%20Fortress%20of%20Doom%20%28USA%29%20%28Proto%29.zip","filesize":38708,"score":7.3,"genres":"Role-playing (RPG) > Top-down > Turn-based > Japanese-style RPG (JRPG) > Puzzle elements > Fantasy","desc":"<p>The hero Maxim and his group defeat the Sinistrals on Mt. Doom (as portrayed in Lufia II), and all is peaceful.  With such a great peace, the defense forces of the world become lax.  One hundred years later attacks begin taking place, supposedly by the Sinistrals.  It's up to the descendant of the hero, and his childhood friend Lufia, to form a new band of champions to save the world.     Gameplay is fairly standard for RPGs, with turn-based battling by way of a menu of icons, and random battles.  There's also a higher-than-normal emphasis on puzzles within dungeons.</p>"}]