[{"name":"M-1 Abrams Battle Tank","year":1991,"developer":"Dynamix, Inc.","url":"d#M-1%20Abrams%20Battle%20Tank%20%28USA%2C%20Europe%29.zip","filesize":314572,"score":6.5,"genres":"Simulation > 1st-person > Direct control > Tank > Vehicular combat > War","desc":"<p>Take the most powerful NATO tank, the M-1 Abrams, in 8 difficult missions against the Warsaw Pact forces. The four tank stations and the other aspects of the tank are quite nicely simulated, with different types of cannon rounds, coax machine guns, and all that. There's also the independent turret and track rotation commands. </p>"},{"name":"M.U.S.H.A.: Metallic Uniframe Super Hybrid Armor","year":1990,"developer":"Compile","url":"d#MUSHA%20-%20Metallic%20Uniframe%20Super%20Hybrid%20Armor%20%28USA%29.zip","filesize":385883,"score":8.3,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Fantasy > Sci-fi / futuristic","desc":"<p>A spin-off from the Aleste series by Compile, <em>Musha Aleste</em> takes the same top-down shooter mechanics of its predecessors but stages the action in a bizarre universe that merges traditional Japanese lore with sci-fi mecha action.</p><p>Instead of commanding a ship, you will actually step into the cockpit of a ninja-styled mecha as you fight through the many levels in the game, with several option satellites that can be configured to use different formations.</p>"},{"name":"M6","year":1995,"developer":""},{"name":"Mad Stalker: Full Metal Force","year":2020,"developer":"Fill in Café Co., Ltd."},{"name":"Madden NFL 94","year":1993,"developer":"High Score Productions","url":"d#Madden%20NFL%20%2794%20%28USA%2C%20Europe%29.zip","filesize":927842,"score":7.5,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>Madden NFL '94 is the third in the Madden series of football games for the SNES. It features 80 teams -- 28 teams from the 1993 season, 38 Super Bowl teams from 1966-1991, 12 All Star franchise teams since 1950, and two \"All-Madden\" teams: one for the 1993 season and one from a 20-year time span. You can play these teams in a regular exhibition game or sudden death overtime game, or take the 1993 teams through an entire season. You can also enter the playoffs with the 1993 teams, the Super Bowl champions, or the All Star franchise teams. Unlike many other sports games, saving a season is done by password rather than by storing the data into a saved game.</p>"},{"name":"Madden NFL 95","year":1994,"developer":"High Score Productions","url":"d#Madden%20NFL%2095%20%28USA%2C%20Europe%29.zip","filesize":943508,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>John Madden's back in the 1995 version of Madden NFL.</p><p>Play exhibition, Super Bowl, playoffs or full season with any of the 1994 teams or all Madden teams.</p><p>This time around, you can select whether or not to include weather conditions, new player animations (high steppin', QB slides), a bigger field and over 100 injuries.</p><p>Also includes windowless passing, all new Madden-designed strategies and team match-up that shows how your players stack up to the other team in their position.</p>"},{"name":"Madden NFL 96","year":1995,"developer":"Tiburon Entertainment","url":"d#Madden%20NFL%2096%20%28USA%2C%20Europe%29.zip","filesize":1211838,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>John Madden returns for the '96 season of Madden NFL.</p><p>Play exhibition, Super Bowl, playoffs or full season with any of the 1995 teams or all Madden teams.</p><p>While you can still select weather and there are over 100 injuries, this version adds voice-overs and the ability to draft and create players and see if they get drafted.</p><p>Still includes windowless passing, all new Madden-designed strategies and team match-up that shows how your players stack up to the other team in their position.</p>"},{"name":"Madden NFL 97","year":1996,"developer":"Electronic Arts, Inc.","url":"d#Madden%20NFL%2097%20%28USA%2C%20Europe%29.zip","filesize":1093795,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>With the versions for PC and 32-bit consoles having moved into the realm of real 3D graphics, <em>Madden NFL 97</em> on Genesis retains the classic view of the series, updating it with different features and options compared to the SNES release.</p><p>The game features the 30 regular NFL teams of the 1996 season, the 1996 All-Madden team and 68 classic NFL teams, from the '52 Lions to the '95 Cowboys.</p><p>Standard playing modes include exhibition, a full season and playoffs including the Super Bowl. In seasons and playoffs, any game can be either played or simulated (with the exception of the Super Bowl, which must be played). Special modes are Custom League and Custom Tournament. A custom league can be set up between 4 to 10 players with freely selectable teams. Every team plays every other team once at home and once away. For 8 players and up, teams are divided into two divisions. The division champions face up in a final playoff. The custom tournament can be set up for 4, 8 and 16 players competing for the Madden Bowl in single elimination mode.</p><p>Quarter length can be set from 5 to 15 minutes. Weather conditions can be set between fair, rain and snow. Further options are two skill levels (Pro and Madden), John Madden commentary, freely definable audibles, eight different penalties that can be set to different levels, player fatigue, injuries and substitutions. Play calling mode can be set to a bluff mode, offense and pass catching can be set to manual or automatic, and all-player mode allows one to control any player on offense, even those with no direct part in the play. Player records and season/playoff progress are saved via battery. Records are saved for each individual player, with eight slots available.</p><p>The game also features custom rosters via player creation (stats are set via a number pool), trading and signing of free agents.</p><p>Besides the custom leagues and tournaments, there is multiplayer support via the 4-Way-Play, allowing for any combination of team or versus play. One player always calls the plays and controls the quarterback, while others can select which player to control.</p>"},{"name":"Madden NFL 98","year":1997,"developer":"Tiertex Ltd.","url":"d#Madden%20NFL%2098%20%28USA%29.zip","filesize":1076442,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>The Madden football series appears for the last time on the Genesis with <em>Madden NFL 98</em>. With PC and next-gen console versions having moved to 3D graphics, the Genesis version retains the classic view of the series. Most of the playing modes are the same as on the SNES, but the Genesis version has its own selection of teams and gameplay options.</p><p>Players can select from the 30 teams of the 1997 NFL season, the 1997 All-Madden team, an EA Sports and a THQ team, plus 68 classic NFL teams, from the 1950s to the 1990s. Playing modes include exhibition games (now optionally as a best-of-three or best-of-five series), seasons and playoffs. There is also an option to replay all Super Bowls since 1988. The game tracks records in 13 categories. A new feature are hot and cold streaks for teams, in which their recent playing history influences their current stats. Player creation and trading returns from the predecessors. As in Madden 97 (but unlike in the SNES version), player stats are set from a point pool. There are options for salary caps and trading deadlines in seasons and playoffs, and it is always possible to play with the regular instead of the modified rosters. During a game, it is again possible to control any player on the field by toggling Any Player Mode (a feature not available on the SNES).</p>"},{"name":"Madō Monogatari I","year":1996,"developer":"Compile"},{"name":"Magic Girl featuring Ling Ling the Little Witch","year":1993,"developer":"Gamtec Corp.","url":"d#Magic%20Girl%20featuring%20Ling%20Ling%20the%20Little%20Witch%20%28World%29%20%28Unl%29.zip","filesize":358498,"score":"","genres":"Action > Top-down > Shooter","desc":"<p>When the peace of a communal planet is broken from an attack by alien invaders, it's up to one very special girl named Ling Ling, blessed with the art of powerful magic, to fight for her people. Having lost her family and friends in the assault, this once sweet and loving young woman has been pushed to the brink and will not give up until vengeance is hers.</p><p>Magic Girl is a vertical shooter set in outer space which consists of 5 different stages, each with its own unique locations, enemies and boss monsters. The player can collect bonuses such as weapon powerups and energy restoration.</p>"},{"name":"Magic Pockets","year":2018,"developer":"The Bitmap Brothers"},{"name":"Magical Hat no Buttobi Turbo! Daibōken","year":1990,"developer":"Vic Tokai Corporation"},{"name":"Magical Tarurūto-kun","year":1992,"developer":"Game Freak, Inc."},{"name":"Mahjong Cop Ryū","year":1989,"developer":"Whiteboard"},{"name":"Mallet Legend's Whac-A-Critter","year":1993,"developer":"AV artisan","url":"d#Mallet%20Legend%27s%20Whac-a-Critter%20~%20Mallet%20Legend%20%28USA%2C%20Asia%29%20%28Unl%29.zip","filesize":150801,"score":"","genres":"Action > Top-down > Arcade","desc":"<p>The princess has been kidnapped by a strange creature! What to do? Grab a mallet and bash heads in until you can get her back, that's what! <em>Mallet Legend's Whac-A-Critter</em> is based on the classic coin-operated redemption game <em>Whac-A-Mole</em>. Each stage has nine holes, out of which various creatures appear. The player must hit as many of the \"bad\" creatures as possible, while leaving the princess and the dog untouched. Some creatures wear helmets and must be hit several times to be defeated. Between each stage, there are minigames where bonus points can be earned, and there are six stages total. Also supported is a special nine-button \"Smash Controller\" specific to this game.</p>"},{"name":"Mamono Hunter Yōko: Dai 7 no Keisho","year":1991,"developer":"Klon"},{"name":"Man Overboard!","year":1994,"developer":"Odysseus Software","url":"d#Man%20Overboard%21%20%28U%29.zip","filesize":385728,"score":6.7,"genres":"Puzzle > Side view > 2D scrolling > Real-time","desc":"<p>Your name is Kevin Codner – rescue mariner extraordinaire, answering the distress call of a sinking cruise liner, the SS Lucifer. You set off in your little submarine and board the ship where a horde of passengers desperately need your keen oversight and \"shipsmarts\".</p><p>In 60 levels you have to rescue as many passengers (dubbed the Dim Passengers) as possible. At the beginning the passengers fall through a tube in the level. Similar to Lemmings you have to find a way for the passengers to the exit of the level. In order to do so, you must blast hindrances such as cargo boxes and bulkheads with bombs or, when no bombs are left, reposition the boxes with a crane. There are also conveyor belts in the levels. If the belt moves in the wrong way, the passengers either can't use it or may even be transported to their dooms, being dropped off into water, fire or steam jets. You can usually choose the direction of the belts by pulling a lever.</p><p>There are several types of scenarios that Kevin Codner (you) are faced with throughout the game. Of course the puzzles get progressively more difficult, involving things like patching up cracked pipes to stop a lethal jet of steam from cooking the distressed passengers. You can blast away obstacles and stack crates in creative manners. For instance, you can have them fall onto each other to form a bridge across a gap or to provide shielding from fire. This is usually done by hoisting them onto conveyor belts using a crane.</p><p>Each level has a certain \"save limit\", meaning you have to save at least a certain amount of passengers. This again is akin a bit towards Lemmings, and lots of levels have a built-in time limit, represented by water pouring into the compartment, rising ominously. When the water rises high enough, the passengers will get carried along with it, and they can only swim for a short period of time before getting exhausted and drowning, so you'd better be on time with some assistance.</p><p>At the end of each level you receive a password (again, Lemmings-style) so that you may pick up your game from the current level without having to progress through them all from the get-go.</p><p>Genesis and SNES versions feature 100 levels. Also, the Genesis version shows a password only once in 5 levels starting from level 5. Although the passwords for each level actually exist, they are never given by the game.</p>"},{"name":"Marble Madness","year":1991,"developer":"Atari, Inc.","url":"d#Marble%20Madness%20%28USA%2C%20Europe%29.zip","filesize":220964,"score":7.2,"genres":"Action > Puzzle > Diagonal-down > Isometric > Arcade > Direct control","desc":"<p>The idea of this arcade game is deceptively simple: Guide a marble down a path without hitting any obstacles or straying off the course. The game is viewed from an isometric perspective, which makes it harder to stay focused on the direction the ball is to follow. There are tight corridors to follow and enemies to avoid. There is a 2-player mode in which players must race to the finish; otherwise you're racing against the clock.</p>"},{"name":"Mario Andretti Racing","year":1994,"developer":"Stormfront Studios","url":"d#Mario%20Andretti%20Racing%20%28USA%2C%20Europe%29.zip","filesize":977840,"score":6.6,"genres":"Action > Racing / Driving > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Italian-born Mario Andretti is one of the most successful racing drivers in the US scene, and five of his relatives have also raced professionally. This game allows you to sample Indy cars, stock cars and sprint cars, all of which have been graced by Andrettis. The physics are customized to each of these, so expect sprint cars to slide around on the dirt tracks, and the slipstream effect is detectable.</p><p>There are 27 computer-controlled cars with individual profiles, and 8 cars to choose from in each race, with varying engine, grip, brakes and pit crew standards. You can view the action either from behind the car, or from the nose. In longer races you must monitor the pit strategy, with the options of a splash 'n' dash stop if your tires are still fine.</p>"},{"name":"Mario Lemieux Hockey","year":1991,"developer":"Alpine Software","url":"d#Mario%20Lemieux%20Hockey%20%28USA%2C%20Europe%29.zip","filesize":266557,"score":6.8,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p>This hockey game contains an exhibition, tournament, shootout, and a fight mode. It also has 16 teams that represent the cities of real NHL teams but the game does not contain either real NHL teams or players.</p><p>Exhibition mode is just a one on one matchup between 2 teams.</p><p>In the tournament mode, a team must win to advance to the next round. If a team loses they are eliminated. </p><p>The shootout mode consists of two teams  who take turns taking shots at the goalie and whoever scores the most goalswins. </p><p>Fight mode consists of two hockey players fighting each other until either of their energy bars runs out. This mode is good to get some practice because when the fight happens in a hockey game the loser of the fight gets sent to the penalty box.</p><p>There are three skill levels and four period-lengths to choose from. The game also has an option to make the referee either blind, fair, or tough which affects the frequency of penalties.</p>"},{"name":"Marko","year":1994,"developer":"The Cartoon Mavericks","url":"d#Marko%20%28USA%29.zip","filesize":820929,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Colonel Brown, the evil owner of a toy factory, has created a substance that can turn people and animals into mutant sludge monsters. When Marko's football comes in touch with the substance it gets magical powers, giving Marko the power to stop Colonel Brown.</p><p>Now Marko has to find his way through numerous platform levels filled with enemies and obstacles. Using his magic football, he can perform various moves and attacks. He can kill his enemies with different kicks, header shots or even bicycle kicks and also use his ball as a trampoline. </p><p>The SNES version features two additional moves for Marko (the ability to balance on the ball and a different method of returning it to him), but they do not have a great impact on gameplay. The gameplay is remarkably similar to Soccer Kid.</p>"},{"name":"Marsupilami","year":1995,"developer":"Apache Software Limited","url":"d#Marsupilami%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1037089,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Licensed","desc":"<p>Based on the character developed by Belgian cartoon artist Franquin, this platform features the player controlling Marsupilami, a strange animal with a large tail, who was poached along with Bonelli the Elephant from the Palombian jungle by Bring M. Backalive and sold to a Circus. Seizing the opportunity when the animal trainer fell asleep, Marsupilami got the key using his long tail and released all animals, and with the help of their Palombian friends Noé, Bip and Sarah tries to return to Palombia.</p><p>While it might seem a typical platform game at first sight, it includes a twist: Instead of dozens of enemies, Marsupilami has to guide Bonelli through gaps and other obstacles (not much different than the Earthworm Jim levels where Jim has to steer Peter Puppy to safety), by shaping his tail intro stairs, bridges or an umbrella, but to do so, he must first collect an icon with the abilities required to complete the level, up to four on each. Always available is the ability to shape into a giant fist not only to swat guards and other enemies away, but also to change Bonelli's direction. The player also collects fruits along the way, which not only provide extra points at the end of the level, but can be dropped out to slow down Bonelli. Each level is timed, so the player can't make many mistakes, even if some time bonus items are occasionally available.</p>"},{"name":"Marvel Land","year":1991,"developer":"Namco Limited","url":"d#Marvel%20Land%20%28USA%29.zip","filesize":487162,"score":7.4,"genres":"Action > Side view > Platform","desc":"<p>In the land of Coni, its inhabitants lived in harmony. At its center lies a mountain called \"Peace\", in which an amusement park known as \"Marvel Land\" resides. This park is well-protected by the Fairies. Later, King Mole became rule of the under dwellers and sent his minions to take over Marvel Land, imprisoning the Fairies inside crystal balls.</p><p>A young lad named Talmit is called upon to rescue Wondra the princess, and free the Fairies from King Mole. <em>Marvel Land</em> consists of five worlds with seven stages each, and the game plays in platform style, in which you need to run through the level, killing enemies, and find the exit door. More often than not, you have to go through a bullseye to reach it. If you hit the bullseye at its center, you are awarded more points than you do by hitting it above or below.</p><p>You kill enemies by either jumping on their heads or attacking them with clones, which trail your movement unless you use them to attack enemies or collect food. The clones have a limited life and disappear one by one as you use them. </p><p>During the game, you can open any treasure chests that you may find along the way, and release power-ups which include boots that make you increase your speed, dragon wings that enable you to jump higher and giving you the ability to glide to a soft landing, and giving you the use of the \"clone\" attack. Hidden throughout the sections are warp doors that can either take your backwards or forwards, anywhere within the park. Each section of a world has you riding a roller coaster, in which you must stay on the cars while avoiding signs and enemies.</p><p>The last section of each world has Talmit going through the castle to reach the end-of-world boss. Unlike other platform games where you must defeat bosses with weapons, you are challenged to various mini-games starting from \"rock, paper, scissors\" through to the Musical Chairs variant. If you win one of the mini-games, you are able to free one of the Fairies, and obtain a crystal ball that you need to defeat King Mole. You then proceed to the Bonus Stage where you must collect shooting stars for points. If you lose a mini-game, you are transported back to the start of the last section.</p>"},{"name":"Mary Shelley's Frankenstein","year":1994,"developer":"Bits Corporation","url":"d#Mary%20Shelley%27s%20Frankenstein%20%28USA%29.zip","filesize":926517,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Licensed","desc":"<p>Based of the 1994 movie remake of <em>Frankenstein</em>, the player is the artificial man created by Victor Frankenstein. After Victor rejects his creation due to its hideous appearance, the creation flees from Victor and swears revenge on him.</p><p>The player goes through a number of levels, battling anything that attacks with a wooden stick. It's possible to set the tip of the stick on fire, by swinging it at the fire torches located on the walls. The player can also use a special attack: a blue ball coming out of the hands of the creation, which takes some of the player's life away. There are also some simple puzzles to be solved in order to get through the levels.</p>"},{"name":"Master of Monsters","year":1991,"developer":"SystemSoft","url":"d#Master%20of%20Monsters%20%28USA%29.zip","filesize":307917,"score":7.6,"genres":"Strategy > Top-down > Anime / Manga > Fantasy","desc":"<p><em>Master of Monsters</em> is a turn-based strategy game in which you choose one of five different wizards and fight the other wizards for domination of the land that stands without a ruler after the master wizard's death. You can play in two campaigns against the computer which requires you to defeat the enemy wizards on all maps and allows you to take all units that have survived a battle into the next one. You can also play all maps individually with up two four human players. In battles, you can summon different monsters and cast spells. Which monsters you can summon and which spells you can use depends on which wizard you have chosen. </p><p>Your aim in every battle is to defeat all other wizards and thus conquering the land (In the campaigns you only have a limited number of turns to do so). Your wizard and monsters gain experience from fighting and your monsters' abilities differ largely from one-another. For example some monsters can execute long-range attacks, some have strong magic attacks but are physically weak. Furthermore, their movement is affected by different terrain types. While flying monsters can move freely, most of the other monster have a preferred terrain type (lizards move best in water etc.). You can summon up two 30 monsters per battle, but how many monsters you can summon each turn is not only determined by the amount of MP, but also by the number of towers that you control, which makes conquering and defending towers a key-element in battles.</p>"},{"name":"Master of Weapon","year":1991,"developer":"Taito Corporation"},{"name":"Maten no Sōmetsu","year":1993,"developer":"Warlock"},{"name":"Math Blaster: Episode One","year":1994,"developer":"Western Technologies Inc.","url":"d#Math%20Blaster%20-%20Episode%201%20%28USA%29.zip","filesize":493578,"score":"","genres":"Educational > 1st-person > Side view > Mini-games > Platform > Math / logic > Sci-fi / futuristic","desc":"<p>A follow-up to the original Math Blaster! games, <em>Math Blaster: In Search of Spot</em> is an educational title with arcade elements designed to help students learn maths while having fun.</p><p>The game allows students to practice basic addition, subtraction, multiplication, and division skills in addition to fractions, decimals, percents, estimation, and number patterns. The subjects can be practiced separately or together in review. Six levels of difficulty are provided. Like the previous titles, the game also includes an editor to create new problem sets (present in the PC version only).</p><p>Math Blaster's friend and assistant, Spot, is kidnapped by the evil Trash Alien at the beginning of the game. The Galactic Commander gives Math Blaster the mission to follow the Trash Alien to his home planet and rescue Spot.</p><p>The game starts with a complete mission (story mode). The mission consists of a series of four (three in the console versions) math activities (mini-games) strung together with cut-scenes. The activities can also be played separately, for practice or for score.</p><p>The activities are as follows:* Trash Zapper - Solve equations to gain tractor beam power, then use the tractor beam to collect space trash.</p><ul><li><p>Number Recycler (PC version only) - Create equations by pushing around columns of numbers and operators. Correct equations allow you to turn the trash you collected into fuel.</p></li><li><p>Cave Runner - Use Math Blaster's jet pack to fly through a cave. He has a number on his chest, and it must be arithmetically between the numbers on each side of an opening in order for him to pass through. Droplets of water falling from above can change this number by performing an operation on it. There are also gems which can be collected for bonus points, and in higher levels, monsters appear that can knock Math Blaster down.</p></li><li><p>Math Blaster - The Trash Alien's spaceship displays an equation, and the four portholes serve as multiple-choice answers. Use the jet pack to fly into the correct portholes while avoiding floating trash and energy blasts from the ship. Bonus gems also appear at random, and after five problems a bonus round occurs where players get a chance to collect as many gems as they can within a time limit.</p></li></ul><p>Upon finishing the complete mission, the player is presented with a certificate that can be printed out (PC version only). Their final score is also added to a high score board for their account.</p>"},{"name":"Mazin Saga: Mutant Fighter","year":1993,"developer":"Almanic Corp.","url":"d#Mazin%20Saga%20-%20Mutant%20Fighter%20%28USA%29.zip","filesize":687039,"score":7.4,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Mecha / giant robot > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>The story takes place in 1999 where a Bio-Beast by the name of Godkaiser Hell has reigned supreme over Earth, after a nuclear and biological holocaust has disfigured most of the population and formed an army called the Steelmask Force.  The survivors have fled underground and are constantly attacked by the Bio-Beast horde until one day a scientist by the name of Dr. Kabuto creates a mech, the Mazinger-Z, that can be used against the monsters.  This is where the player takes control of the games protagonist and pilots the suit in an attempt to reclaim the Earth.</p><p>The gameplay is a hack-n-slash game, where the player controls the suit by using the D-pad and using the face buttons to slash at enemy monsters.  There is also a Super Attack that the player can use, but it will decrease their health after each use.  The enemies consist of mutant animals such as dogs and beetles as well as the Bio-Beast soldiers that can range from regular soldiers, female fighters and even ninjas.</p><p>There are five levels in all (Tokyo, Asia, Europe, New York and Egypt) divided into three stages with a mini-boss and a main boss the player must defeat to advance to the next level.  There are also items scattered throughout the levels that will give the player extra points, health refills, an extra life and even a brief stint of invincibility.</p>"},{"name":"McDonald's Treasure Land Adventure","year":1993,"developer":"Treasure Co., Ltd.","url":"d#McDonald%27s%20Treasure%20Land%20Adventure%20%28USA%29.zip","filesize":749698,"score":7.2,"genres":"Action > Side view > 2D scrolling > Falling block puzzle > Platform > Licensed > Regional differences","desc":"<p>McDonald's Treasure Land Adventure is a side-scrolling adventure starring Ronald McDonald.</p><p>After finding a piece of a treasure map, the yellow clown travels through four different levels (Forest, Town, Sea and Moon). He's off to find and defeat the baddies who have the other pieces of the map.</p><p>Ronald can jump, shoot and use his scarf to grab onto hooks to jump to higher levels.</p><p>Jewels and flowers collected in each level can be used to purchase extra lives and power-ups in shops between levels.</p><p>You can also pay to play a Columns style falling block game between levels to earn extra items.</p>"},{"name":"Medal City","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Mega Bomberman","year":1994,"developer":"Hudson Soft Company, Ltd.","url":"d#Mega%20Bomberman%20%28USA%29.zip","filesize":537816,"score":8.2,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Direct control > Sci-fi / futuristic","desc":"<p><em>Mega Bomberman</em> is a top-down action game. Control your Bomberman through various levels defeating multiple enemies and plenty of bosses. Each level consist of blocks for exploding and some blocks that don't explode. At times you will need the non-exploding blocks as shelter. The blocks that do explode reveal power-ups and eggs. </p><p>The eggs are the unique twist to this version of Bomberman. When you get a egg, it hatches into a kangaroo. There are multiple kangaroo types, each with their own unique ability. You hop on the back of the kangaroo and utilize it's ability. If you happen to walk into an explosion the kangaroo takes the damage and dies and you continue to live. </p><p>Another unique feature in multiplayer is you can choose your character. Pick one of 9 such as Miner, Tiny, Fat, Cop, Punk (On cover), Lady, Old man, Robot and the original Bomberman.</p><p>After selecting your character get ready for battle as you are placed in 1 of the 4 corners of the arena. Now just blow your way through the blocks and attack some opponents. Watch out for their bombs and remember to dodge your own. There are also many arena's to choose from. Each arena has it's own twist such as trap doors, an igloo to hide in, conveyor belts and more.</p>"},{"name":"Mega Cheril Perils","year":2017,"developer":"The Mojon Twins"},{"name":"Mega Games 10","year":2002,"developer":""},{"name":"Mega Games 2","year":1993,"developer":"","url":"d#Mega%20Games%202%20%28U%29.zip","filesize":1116091,"score":"","genres":"Compilation","desc":"<p><em>Mega Games 2</em> is a games bundle that comprises the following games:</p><ul><li>Golden Axe</li><li>Streets of Rage</li><li>The Revenge of Shinobi</li></ul><p>The bundle came with the MegaDrive II (and additionally Sonic the Hedgehog 2) and was not for sale separately.</p>"},{"name":"Mega Games 3","year":1993,"developer":"","url":"d#Mega%20Games%203%20%28U%29.zip","filesize":1050178,"score":"","genres":"Compilation","desc":"<p>This pack of three was included with some Megadrive consoles and comprises the following games:</p><ul><li>Alien Storm</li><li>Super Thunder Blade</li><li>Super Monaco GP</li></ul>"},{"name":"Mega Games 6 Vol. 1","year":1995,"developer":"","url":"d#Mega%20Games%206%20Vol.%201%20%28U%29.zip","filesize":1618256,"score":"","genres":"Compilation","desc":"<p>This pack of six games was included with some Megadrive consoles and comprises the following titles:* Columns</p><ul><li>Golden Axe</li><li>Super Hang-On</li><li>Streets of Rage</li><li>The Revenge of Shinobi</li><li>World Cup Italia '90</li></ul><p>It is actually the combination of Mega Games 1 and Mega Games 2.</p>"},{"name":"Mega Games 6 Vol. 2","year":1995,"developer":"","url":"d#Mega%20Games%206%20Vol.%202%20%28U%29.zip","filesize":1116105,"score":"","genres":"Compilation","desc":"<p>This pack of six games was included with some Megadrive consoles and comprises the following titles:* Alien Storm</p><ul><li>Columns</li><li>Super Hang-On</li><li>Super Monaco GP</li><li>Super Thunder Blade</li><li>World Cup Italia '90</li></ul>"},{"name":"Mega Games 6 Vol. 3","year":1995,"developer":"","url":"d#Mega%20Games%206%20Vol.%203%20%28U%29.zip","filesize":1050192,"score":"","genres":"Compilation","desc":"<p>This pack of six games was included with some Megadrive consoles and comprises the following titles:* Columns</p><ul><li>Revenge of Shinobi</li><li>Sega Soccer</li><li>Sonic The Hedgehog</li><li>Streets of Rage</li><li>Super Monaco GP</li></ul>"},{"name":"Mega Games Almanac","year":2008,"developer":""},{"name":"Mega Man: The Wily Wars","year":1994,"developer":"Capcom Co., Ltd.","url":"d#Mega%20Man%20-%20The%20Wily%20Wars%20%28USA%29%20%28Genesis%20Mini%29.zip","filesize":970302,"score":7.6,"genres":"Action > Compilation > Side view > 2D scrolling > Platform > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>Mega Man: Wily Wars is a collection of the first three NES Mega Man titles. It features enhanced graphics and sound as well as the game \"Wily Tower\", a short game that mixes enemies from all three games.</p>"},{"name":"Mega Marble World","year":2018,"developer":"GcUP team"},{"name":"Mega Mindtris","year":2017,"developer":""},{"name":"Mega Q*bert","year":2016,"developer":"Jaklub","url":"d#Mega%20Qbert.zip","filesize":132364,"score":"","genres":"Reflexion","desc":"<p>Mega Q*bert is a fan adaptation of the popular arcade title for the Sega Mega Drive/Genesis. The title has 2 modes - Mega mode with 80 new different levels to beat and an Arcade mode, which is based on NES Q*bert (which in turn is based on the original game). Both modes allow simultaneous cooperative play.</p>"},{"name":"Mega SWIV","year":1994,"developer":"The Sales Curve Ltd.","url":"d#Mega%20SWIV%20%28U%29.zip","filesize":499175,"score":7.5,"genres":"Action > Top-down > 2D scrolling > Shooter > Helicopter","desc":"<p>A secret \"underground race\" on an island in the mid-Atlantic ocean has stolen top military vehicles and equipment from around the world and have rebuilt powerful war machines from them. They are even piloted by robots with one mission: to destroy. Military and intelligence officials of major countries have detected them, but they are afraid that they will be unable to prepare against an assault by this underground race. Their plan is to send you in to infiltrate their base and destroy them before they have a chance to unleash the war upon the rest of the world. You can choose to control either the Helicoptor or the Jeep, which have different advantages -- for instance, the Helicoptor is not obstructed by obstacles but the Jeep can fire in any direction. There are nine weapons (five permanent, four short-lasting specials) you can pick up along the way to help you destroy the enemy.</p>"},{"name":"Mega Turrican","year":1994,"developer":"Factor 5 GmbH","url":"d#Mega%20Turrican%20%28USA%29.zip","filesize":589666,"score":8,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic","desc":"<p>After many generations of peace, the Dark Forces have assembled again, and as a member of the USS Freedom Forces, it is your job to defeat them once again. This means you will have to complete numerous large levels always searching for secrets to pick up and enemies to shoot. To do this, you can pick up three different, upgradeable shots: a multiple, a laser and a rebound. You can also go into wheel-mode (as long as you have enough special energy) or use a rope. In wheel-mode, you are invincible and can lay mines or explore previously unreachable areas.</p>"},{"name":"MegaMind","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Megapanel","year":1990,"developer":"Namco Limited","url":"sega-mega-drive-genesis-20210106-213105/Sega%20-%20Mega%20Drive%20-%20Genesis%20%2820210106-213105%29.rar/ROMs%2FMegaPanel%20%28Japan%29.zip","filesize":1,"score":7.3,"genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Falling block puzzle > Tile matching puzzle","desc":"<p><em>Megapanel</em> is a tile-based puzzle game that plays like a mixture of Tetris Attack and a traditional sliding tile puzzle. Blocks rise from the bottom of a well, and the player must slide them around in order to create a row or column of three same-color blocks. This causes the group to clear, and potentially create chains from the blocks above falling. As the game continues, the number of blocks that must be cleared to continue as well as the speed at which the stack rises will both increase.</p><p>The game includes three modes. First is training mode which explains the basics of the game. In this mode, a certain number of blocks must be cleared to complete the stage. Second is a \"pin-up\" mode for one player, where clearing blocks reveals parts of an image of a cute anime girl, the goal being to uncover the entire picture. Last is a two-player versus mode, where players compete to clear their blocks the fastest, and can send garbage blocks to their opponent and fill up their field. The game includes two difficulty settings, two versus modes, a sound test, and a unique mode that displays the entire game in sepia tone.</p>"},{"name":"Menacer 6-Game Cartridge","year":1992,"developer":"Johnson-Voorsanger Productions","url":"d#Menacer%20-%206-Game%20Cartridge%20%28USA%2C%20Europe%29.zip","filesize":455972,"score":5.2,"genres":"Action > Compilation > 1st-person > Paddle / Pong > Shooter > Sci-fi / futuristic","desc":"<p><em>Menacer 6-Game Cartridge</em> was released as a pack-in cartridge for the Menacer light gun. It is a compilation of six games:<em> </em>Pest Control*: in this game the player has to defend a pizza from the attack of assorted bugs. The player smokes the bugs while controlling a spotlight, but it is also possible to see the whole table while pressing a second button (in this case, it won't be possible to use the insecticide). The game is over when the pizza is all eaten. Different bugs will appear throughout the levels, such as some big ones which explode in smaller ones when shot.</p><ul><li><p><em>Space Station Defender</em>: the player has to shoot aliens inside pods which appear on the screen in a given sequence and in specific positions. As the player follows the pattern, he has to reload the weapon by aiming the lower end of the screen where \"power\" can be read. There's also a random mode, where all pods appear at the same time and the player has to guess the order in which they'll open. The aliens shoot back if the player takes much time to shoot them. Once in a while a little flying saucer will cross the screen; shooting it will give the player a shield point. The game is over when player's life is depleted.</p></li><li><p><em>Ready, Aim, Tomatoes!</em>: this game is set in Toejam &amp; Earl's universe. As the screen scrolls right, Toejam has to shoot tomatoes at enemies such as the Cupid, the Dentist, the Boogie Man, the little Devil and so on. There are also special items to shoot, like bombs which will kill all enemies at the screen or tomato baskets which will give ammunition. For each level there's a target score to achieve. In advanced levels the enemies will shoot back. The game is over when Toejam's life is depleted.</p></li><li><p><em>Whack Ball</em>: this is some sort of a Breakout game. The player controls a paddle and has to bounce a ball against a frame of blocks. Once a block is touched by the ball, its color is changed, and the objective is to change all blocks colors. Some glowing blocks have special effects when hit like sticking the ball to the paddle, giving an extra ball or shrinking the paddle. A time limit is given to each leval, and if the player doesn't succeed, another chance is given. The game is over when all balls are lost though the holes in the frame.</p></li><li><p><em>Front Line</em>: in this game the player has to shoot tanks, trucks, planes and helicopters before they shoot back. There are two weapons available: a cannon with unlimited ammo and 10 missiles per stage.</p></li><li><p><em>Rockman's Zone</em>: in this game the player has to shoot cardboard pictures of bandits while avoiding shooting pictures of women, children and policemen. Bonus points are given for acurracy.</p></li></ul><p>In the shooting games the player can choose to have the Accu-Sight on or off. If it is on, a crosshair will be displayed. If it's off, the player can also choose to use the Menacer's Binocular Module.</p>"},{"name":"Menghuan Shuiguo Pan: 777 Casino","year":1993,"developer":""},{"name":"Mercs","year":1991,"developer":"Capcom Co., Ltd.","url":"d#Senjou%20no%20Ookami%20II%20~%20Mercs%20%28World%29.zip","filesize":651438,"score":7.1,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > War","desc":"<p>Mercs is a shoot 'em up influenced by Ikari Warriors. You are an anti-terrorism soldier, and must rescue a former President from a Central African revolutionary gang. </p><p>You run through each of the 8 levels, which primarily scroll horizontally, shooting everyone before they can shoot you. At times you will have to shoot trees and other scenery to progress. </p><p>Finding strategic placings is important, especially as you can't shoot while on water. Most of the time you are on foot, but at times you can hijack vehicles of shot foes. There are improved weapons, smart bombs and energy recharges to collect. Each of the 8 levels ends with a large vehicle requiring multiple shots to destroy.</p>"},{"name":"Metal Dragon","year":2021,"developer":"Kai Magazine Software"},{"name":"Metal Fangs","year":1993,"developer":"SEGA Enterprises Ltd."},{"name":"Michael Jackson's Moonwalker","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Michael%20Jackson%27s%20Moonwalker%20%28World%29%20%28Rev%20A%29.zip","filesize":336367,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Michael Jackson's Moonwalker</em> is based on the Michael Jackson movie. Mr. Big has kidnapped children and has nasty things in store for them, like drugging them and making them slaves. So it's up to Michael to use his magical powers and dancing talent to try to catch Mr. Big and rescue his little friends.</p><p>Michael Jackson can jump, throw magical stars, and dance to counter his opponents as he looks for the hidden children. Stages come in various shapes and sizes from some of Jackson's hit videos which take place in streets and graveyards.</p>"},{"name":"Mick & Mack as the Global Gladiators","year":1993,"developer":"Virgin Games, Inc.","url":"d#Mick%20%26%20Mack%20as%20the%20Global%20Gladiators%20%28USA%29.zip","filesize":675770,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Licensed","desc":"<p><em>Global Gladiators</em> is a platform game licensed from fast food chain McDonalds. While playing through the game's 12 levels you'll notice McDonalds logos, burgers and all sorts of family restaurant type stuff as you take Mick and Mack (the game's protagonists) on a journey to clean up \"Monsters of Slime World\", \"Toxi-Town\" and more.</p>"},{"name":"Mickey Mania: The Timeless Adventures of Mickey Mouse","year":1994,"developer":"Traveller's Tales (UK) Ltd.","url":"d#Mickey%20Mania%20-%20The%20Timeless%20Adventures%20of%20Mickey%20Mouse%20%28USA%29.zip","filesize":1282128,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Mickey Mouse gets a chance to go down memory lane and walk through the timeless adventures he has lived. <em>Mickey Mania</em> is a platformer where all the levels are based on Mickey's most famous cartoons. The levels range about 75 years, starting off with \"Steamboat Willie\" and going all the way to \"The Prince and the Pauper\".</p><p>The gameplay consists mostly of jumping and marble throwing at enemies, with an occasional puzzle element.</p>"},{"name":"Mickey's Ultimate Challenge","year":1994,"developer":"Designer Software","url":"d#Mickey%27s%20Ultimate%20Challenge%20%28USA%29.zip","filesize":440454,"score":5.8,"genres":"Puzzle > Side view > 2D scrolling > Direct control > Fantasy > Licensed","desc":"<p>One night, as Mickey (or Minnie) lay in bed reading a book of fairy tales, he started to wonder how it would be to live in a far off land, in a magic castle. As he fell asleep, he woke up in the Kingdom of Beanwick, which is constantly tormented by earthquakes. Then, he offers his help to solve the mystery behind those earthquakes.</p><p><em>Mickey's Ultimate Challenge</em> is a puzzle game in which the player chooses either Mickey or Minnie to play with. They'll find five characters from the Disney's universe in the kingdom, and will be prompted to help them in several tasks.</p><p>Each task is a different puzzle, given by a specific character. Daisy, for instance, will ask help to clean the castle's paintings hanging on a wall. The task is in fact a memory game, where Mickey or Minnie must clean the pictures matching pairs. After completing one task, they'll receive a gift.</p><p>After completing all tasks, Mickey or Minnie must trade the gifts they won with the right characters. For instance, after finishing Goofy's task, they will receive his hammer. The player must then guess who among the other characters would like to receive that hammer.</p><p>Giving the right items to the right characters will allow Mickey or Minnie access to the last puzzle and character.</p>"},{"name":"Micro Machines","year":1993,"developer":"The Codemasters Software Company Limited","url":"d#Micro%20Machines%20%28USA%29.zip","filesize":318660,"score":7.5,"genres":"Racing / Driving > Top-down > Licensed","desc":"<p>If you're bored of racing Formula 1 cars, rally cars or MotoGP bikes in their natural habitats, the Micro Machines series could be for you. It involves racing miniatures representing particular vehicle types across a particular terrain found around the house. The Sports Cars race on the desktop, 4x4s in the sandpit, Formula 1 cars on a snooker table, and so on.</p><p>These levels were packed with variation. The Snooker tables has the track painted on, although this is open to deviation (as are most levels), and had you racing through the pockets and across the rim of the table. Tanks raced as well, with the chance of shooting out your opponent if they got directly in front of you. The desktop levels include binders to jump across, pencil-sharpeners to avoid, and lots of visual jokes in the open homework.</p><p>Viewed from overhead with small graphics, the races include up to 4 cars. In one player challenge mode you race through the 21 tracks in a set order, selecting your 3 opponents as you go along (adding a fair amount of strategy - ideally you should aim to eliminate the better CPU cars early on), eliminating one after every third race (assuming that you can finish in the top 2 of a race within your 3 lives). If you win 3 races in a row without using a continue you get a time-trial race which can earn you an extra life.</p><p>The real innovation of the game was in the multiplayer modes. You started with 4 points each, and when one car gets far enough ahead to force the other car off-screen, the slider moves in their favour. Once it reached the end (which involved beating them 4 times more than they beat you) you win the level, although if 3 laps were completed, the person leading at that point is declared the winner - with a sudden death play off if scores are level. 9 of the tracks are available in this mode, although you can also play this Head to Head system as a 1-player game across all the tracks.</p>"},{"name":"Micro Machines 2: Turbo Tournament","year":1994,"developer":"The Codemasters Software Company Limited","url":"d#Micro%20Machines%202%20-%20Turbo%20Tournament%20%28U%29.zip","filesize":866793,"score":7.4,"genres":"Action > Racing / Driving > Top-down > Arcade > Licensed","desc":"<p><em>Micro Machines 2: Turbo Tournament</em> is the second game in the Micro Machines series. Like its predecessor, it puts the player behind the steering wheel of an extremely small car. The races take place in locations such as a table, a treehouse, and many more.</p><p>The CD-ROM version adds CD-audio music while the Mega Drive (Genesis) version features a special cartridge that allows players to connect two additional controllers to the console for four-player games.</p><p>The number of tracks vary depending on the version of the game. The floppy version has three tracks included, the CD version five, Game Gear 19, Game Boy 37, and the special edition, SNES, and Genesis version have 50.</p>"},{"name":"Micro Machines: Military","year":1996,"developer":"Supersonic Software Ltd.","url":"d#Micro%20Machines%20Military%20-%20It%27s%20a%20Blast%21%20%28U%29.zip","filesize":730373,"score":7.2,"genres":"Action > Racing / Driving > Top-down > 2D scrolling > Licensed","desc":"<p>This entry in the Micro Machines series flirts with a military theme. Using a top-down view, you race on different scaled-down tracks such as a pond, a kitchen table, a workbench, in the garden, .... The theme is reflected in the vehicles (helicopters, speedboats, tanks, supply trucks...), as well as in the music.</p><p>Up to 16 players can participate through the hot-seat party mode, but 8 racers can race simultaneously using the J-Cart and by sharing a part of the joypad. There are different game types, such as regular races (challenges), time trials, and battle arenas, in which you have to survive for a set amount of time while enemy vehicles charge. Other players can be shot to slow them down.</p>"},{"name":"Micro Machines: Turbo Tournament 96","year":1995,"developer":"Supersonic Software Ltd."},{"name":"Midnight Resistance","year":1991,"developer":"Data East Corporation","url":"d#Midnight%20Resistance%20%28USA%29.zip","filesize":345516,"score":7.5,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Cyberpunk / dark sci-fi","desc":"<p>The <em>Midnight Resistance</em> fighters are up against the awesome powers of mad scientist King Crimson and his Crimson Corps. Crimson has kidnapped your scientist grandfather and five more of your relatives, and aims to put his advanced plans to evil use.</p><p>Take control of a Resistance fighter in this scrolling shoot 'em up consisting of nine platform-based levels, each ending with a Boss to defeat. Your enemies appear on foot and in vehicles, and Crimson has also planted machine gun bays en route. </p><p>Dead enemies release keys, which can be traded in at shop points for weapons. These weapons include machine guns and flamethrowers, for which ammunition must be bought - weapons are discarded when you have no suitable ammo. The control system is unusual - you can shoot in different directions and crawl along low ledges.</p>"},{"name":"MiG-29: Fighter Pilot","year":1993,"developer":"PanelComp, Ltd.","url":"d#Mig-29%20Fighter%20Pilot%20%28USA%29.zip","filesize":811574,"score":6.9,"genres":"Simulation > 1st-person > Behind view > Flight / aviation > Vehicular combat","desc":"<p><em>MiG-29: Fighter Pilot</em> is a successor to MiG-29 Fulcrum by Simis; this time the theater of operations is the Middle East. The joined forces of NATO and the Commonwealth of Soviet States are to stop General Hasouz who is seeking to gain control over the world's oil resources. You are the pilot of the Russian-built MiG-29 and you need to accomplish several strategic missions to ensure the success of the operation. </p><p>As this is a simulation game, the MiG-29's control panel is recreated (displaying altimeter, compass, thrust indicator, radar and more), and many actions are done manually by the player (such as controlling brakes and landing gear, performing take off and landing, etc.). There are a number of weapons and an automatic targeting system to help successfully accomplish the missions. The MiG-29 is also equipped with flares and chaff used to avoid enemy fire. </p><p>The game is divided into 5 missions plus a tutorial mission. Mission objectives include destroying the enemy's command control and communications systems, escorting a submarine to safety, and destroying enemy Scud missiles. Mission score is based on the number of enemy structures and craft destroyed.</p><p>The game features real-time 3D polygon graphics and there are even several short video clips, something very uncommon for Genesis hardware.</p>"},{"name":"Might and Magic III: Isles of Terra","year":1992,"developer":"New World Computing, Inc.","url":"d#Might%20and%20Magic%20III%20-%20Isles%20of%20Terra%20%28USA%29%20%28Proto%29.zip","filesize":1235057,"score":8,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Direct control > Multiple units/characters control > Fantasy","desc":"<p>A party of brave heroes managed to defeat the corrupted guardian Sheltem as he attempted to destroy the world of CRON. However, the great battle between the guardians Corak and Sheltem continued in another place - the world of Terra, where Sheltem was originally appointed as a guardian. Revolting against the powerful race of the Ancients, Sheltem takes possession of their space-traveling nacelles, hurling them at the suns of other planets. It is now up to a group of local adventurers to help Corak and vanquish Sheltem once and for all.</p><p><em>Isles of Terra</em> is the third installment in the Might and Magic series, and a sequel to Gates to Another World. Like its predecessors, it is a role-playing game focusing on first-person exploration of vast pseudo-3D environments, character building, and turn-based combat. The five selectable races remain the same as in the previous games, as well as the eight character classes with the addition of two new ones: Druid and Ranger. Like in the second game, characters may learn unique skills such as thievery, swimming, merchant, and others.</p><p>This installment does away with random or pre-set enemy encounters, featuring instead enemies dynamically roaming the game world, allowing to initiate combat from a distance (for example with ranged attacks or spells). There is no option to bribe or surrender to enemies, and escaping combat can be accomplished simply by moving away, unless the enemies have already locked on the party. An automap feature is available at all times, and the player is also allowed to save the game at any time.</p>"},{"name":"Might and Magic: Gates to Another World","year":1991,"developer":"New World Computing, Inc.","url":"d#Might%20and%20Magic%20-%20Gates%20to%20Another%20World%20%28USA%2C%20Europe%29.zip","filesize":546034,"score":7.3,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Direct control > Multiple units/characters control > Fantasy","desc":"<p>The space traveler and rogue guardian Sheltem has left the world VARN, where he was pursued by the relentless Corak the Mysterious and a party of local adventurers helping him. The Gates to Another World eventually takes all of them to another world, known as CRON. There, a great turmoil is caused by Sheltem's actions, and the heroes must stop his madness, preventing him from casting the planet into its own sun. </p><p><em>Gates to Another World</em> is the second installment in the Might and Magic series, and a sequel to Secret of the Inner Sanctum. Core gameplay is similar to predecessor, with the player creating a party of six characters and exploring vast first-person 3D environments, while fighting enemies in turn-based combat and leveling up. Unlike the first game, enemy encounters occur at set points rather than spawning randomly, though enemy type selection is still random.</p><p>Like in the previous game, character classes rely each on a particular attribute to be effective. Knight, Paladin, Archer, Cleric, Sorcerer and Robber return, with the addition of two new classes, Ninja and Barbarian. Race selection features humans, elves, dwarves, gnomes, and half-orcs. There are several locations and items that are restricted to certain genders, alignments, or races. A new feature is the possibility to hire two non-player characters to travel with the party and participate in battles. A new skill system is introduced as well, allowing characters to learn such abilities as mountaineering (necessary to traverse mountains), linguist (for reading certain messages), cartographer (for creating an auto-map), and others.</p><p>Compared to the first game, the sequel is more quest-oriented, with various characters in towns giving quests to the party, as opposed to purely exploration-based traveling in the predecessor. Time also plays a large role in this game, with some instances requiring the party to travel to different time periods. Characters also age as the game goes on; If the player waits too long, the characters' statistics will change to reflect their aging, and they will eventually die.</p>"},{"name":"Mighty Morphin Power Rangers","year":1994,"developer":"Nova Co., Ltd.","url":"d#Mighty%20Morphin%20Power%20Rangers%20%28USA%29.zip","filesize":1049783,"score":5.9,"genres":"Action > Side view > 2D scrolling > Fighting > Sci-fi / futuristic > Licensed","desc":"<p>The Genesis version of <em>Mighty Morphin Power Rangers</em> is a one-on-one fighting game based on the TV series, featuring two playing modes: one-player scenario mode and two-player battle mode.</p><p>In scenario mode, the evil Rita Repulsa sends a number of her monsters (and the evil Green Ranger) after the Power Rangers, who must defeat each in one-to-one combat. Before every bout, players can select a different ranger to play. Each of the five matches consists of two rounds: after the first round, the monster usually changes form into a larger version of itself (the Green Ranger summons his Dragonzord instead), which the Power Rangers must then fight again using their Megazord mecha. After the Green Ranger is defeated, he also becomes available as a playable character for the remaining fights.</p><p>In battle mode, players can select from the six rangers, four monsters and two Zords to fight each other in best-of-three matches in almost all combinations (the Zords and the Cyclopsis monster cannot be matched against any of the rangers, and both players cannot play the same character).</p><p>Two of the controller's buttons are used for normal and fierce attacks, while blocking is done by either pulling back from the enemy for standard blocks or pushing both buttons simultaneously for a powerful block that reflects even enemy projectiles. Button combinations unleash different special moves for each character.</p>"},{"name":"Mighty Morphin Power Rangers: The Movie","year":1995,"developer":"SIMS Co., Ltd.","url":"d#Mighty%20Morphin%20Power%20Rangers%20-%20The%20Movie%20%28USA%29.zip","filesize":997970,"score":6.1,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Mecha / giant robot > Licensed","desc":"<p>This version of <em>Mighty Morphin' Power Rangers: The Movie</em> is a 2D beat-'em-up game. The game loosely follows the plot of the movie, with Ivan Ooze being the main villain. The player can choose between six Rangers, the main difference being in their color, strength, movement speed and special attacks. At some points Rangers use colossal assault vehicles known as “Zords” to fight bosses. The game features two-player simultaneous play. The game's soundtrack consists entirely of digitized versions of original music created for the TV show.</p>"},{"name":"Mike Ditka Power Football","year":1991,"developer":"Accolade, Inc.","url":"d#Mike%20Ditka%20Power%20Football%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":549241,"score":6.9,"genres":"Sports > Football (American) > Licensed","desc":"<p>The head coach of the Chicago Bears offers up his own football simulation.  Modify existing plays or design your own for 28 pro teams.  Use 4 different passing methods and use the instant replay feature to watch plays unfold from 4 different angles.  The game can be played in real-time or stop-action mode.  Will you take your team to the Superbowl?</p>"},{"name":"Miniplanets","year":2016,"developer":""},{"name":"Miniplanets (Deluxe Edition)","year":2017,"developer":""},{"name":"Minnesota Fats: Pool Legend","year":1995,"developer":"Data East Corporation","url":"d#Minnesota%20Fats%20-%20Pool%20Legend%20%28USA%29.zip","filesize":502567,"score":6.7,"genres":"Simulation > Sports > Top-down > Pool / snooker > Licensed","desc":"<p><em>Minnesota Fats: Pool Legend</em> is a pool game where the player can participate in a story mode and play against a set of pros in six different pool halls in an attempt to face off against Minnesota Fats himself. There are seven different variations of pool to play: Eight-Ball, Nine-Ball, Rotation, 14-1 rack, Three ball, Cut Throat &amp; One Pocket. There is also a <em>Versus Mode</em> to let players take on any opponent of their choice including a two-player option to take on a friend and a <em>Tournament Mode</em>. Players can also try out the <em>Trick Mode</em> that has the player try to compete 16 different trick shots.</p>"},{"name":"Miracle Piano Teaching System, The","year":1992,"developer":"The Software Toolworks, Inc.","url":"d#Miracle%20Piano%20Teaching%20System%2C%20The%20%28USA%29.zip","filesize":239404,"score":"","genres":"Educational > Side view > Music / rhythm > Music","desc":"<p><em>The Miracle Piano Teaching System</em> teaches piano to beginning / intermediate players using a combination of scripted lessons, dynamically created lessons, and piano-themed video games. The original version came bundled with a custom piano keyboard. Later versions work with any MIDI keyboard.</p>"},{"name":"Misplaced","year":2019,"developer":"RetroSouls"},{"name":"MLBPA Baseball","year":1994,"developer":"High Score Productions","url":"d#MLBPA%20Baseball%20%28USA%29.zip","filesize":997246,"score":7,"genres":"Sports > Baseball > Licensed","desc":"<p>The strategy of baseball is merged with a fast-paced arcade game in MLBPA Baseball from Electronic Arts. Details designed to appeal to the die-hard fan include: real players with statistics based on the 1993 season; a full 162 game season mode; stadium music; animated scoreboards; defensive alignments; cut-off plays; run-downs; and even the double switch. Features meant to appeal to the casual fan include: large colorful arcade graphics; one stadium with animated crowds; a simplified pitching interface allowing players to steer the ball; and a batting interface that relies on timing instead of aiming cursors. Secret power-up play modes await so step up to the plate and take some hacks! Season play can be continued using passwords provided at the end of each game.</p>"},{"name":"Monopoly","year":1992,"developer":"Sculptured Software, Inc.","url":"d#Monopoly%20%28USA%29.zip","filesize":244896,"score":7.3,"genres":"Strategy > Top-down > Board game > Licensed","desc":"<p>From Sculptured Software comes an adaptation of the classic board game <em>Monopoly</em> for the dominating console systems of the early 90s (later also ported to Game Boy Color).</p><p>The game can be played by up to eight players (only four in the Game Boy versions). Any number of positions can be taken over by computer opponents. The game comes with eight different opponents, which are selected from a portrait gallery (8- and 16-bit versions feature different names and portraits).</p><p>It is possible to set up a time limit for a game, and also to customize the game. Amount of starting money, owned properties, houses and hotels can be set for any player before starting. The game also comes with a number of preset scenarios with varied starting parameters. The 8-bit versions have eight scenarios, the 16-bit versions add another four. The Game Boy versions also feature the scenarios, but don't have the customization option.</p><p>During gameplay, the board is seen from the top. Moving tokens are displayed in a special animation in the center of the board, as is a hand throwing the dice. Auctions and trades take place on special screens, with the 16-bit versions being more elaborately animated and illustrated.</p>"},{"name":"Monster World IV","year":1994,"developer":"Westone Co., Ltd.","url":"d#Monster%20World%20IV%20%28USA%2C%20Europe%29%20%28En%2CJa%29%20%28Virtual%20Console%29.zip","filesize":1005339,"score":8.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Metroidvania > Platform > RPG elements > Fantasy","desc":"<p><em>Monster World IV</em> is a sequel to Wonder Boy 5: Monster World 3. The player controls Asha, the green-haired girlfriend of Shion, the hero of the previous game. One day, Asha was standing on a cliff near her home village, and suddenly heard a mysterious voice calling for help. She decided to leave the village and to embark on an adventure to discover the identity of this mysterious person.</p><p>The game is a side-scrolling action platformer with light RPG elements (treasure, equipment, etc.). Asha can jump, run, attack or defend (by pressing the \"down\" button). She can also use items and equip weapons and armor, talk to people, and open treasure chests. Later in the game, she will also be able to use magic, and a little blue pet animal will assist and help her on her journey. The combat system is quite similar to that of early Zelda games. Health and mana points are measured in little hearts; as the story advances, their amount increases.</p>"},{"name":"Mortal Kombat","year":1993,"developer":"Midway Manufacturing Company","url":"d#Mortal%20Kombat%20%28World%29.zip","filesize":1015486,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy > Martial arts","desc":"<p>Five hundred years ago, an ancient and well respected Shaolin fighting tournament, held every 50 years, was corrupted by an evil and elderly sorcerer by the name of Shang Tsung. Shang was accompanied by Prince Goro, a warrior of the Shokan race (a four-armed half-human / half-dragon). Knowing that if ten tournaments in a row were won by the Outworld champion, the Earth Realm would be conquered by evil and fall into darkness, Shang entered Goro in the tournament and had him defeat the great Kung Lao. Goro has been reigning supreme as the undefeated fighting champion for five hundred years now. As the last tournament required draws near, Raiden, Thunder God and protector of the Earth Realm, enacts a plan to tip the scales in the humans' favor, Seven fighters step into the arena on Shang Tsung's mysterious island: Shaolin warrior Liu Kang, Special Forces operative Sonya Blade, the mercenary thug Kano, fame-seeking actor Johnny Cage, the ice-wielding Lin Kuei warrior Sub-Zero and his undead adversary Scorpion, and Raiden himself.</p><p><em>Mortal Kombat</em> is a side-scrolling fighting game. Fighting is set as one-on-one combat, allowing each player to perform a variety of punches, kicks, and special moves in order to defeat their opponent. When the opponent faces their second round loss, the winner can perform a finishing move called a \"Fatality\" on the loser. The Fatality is a move unique to each fighter that graphically kills the loser in a blood-soaked finale.</p><p>Mortal Kombat began its life as a 2-player arcade title. It is notable for its use of digitized actors to represent the game's fighters, as well as its use of copious amounts of blood during gameplay.</p>"},{"name":"Mortal Kombat 3","year":1995,"developer":"Midway Manufacturing Company","url":"d#Mortal%20Kombat%203%20%28USA%29.zip","filesize":3357809,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts","desc":"<p>Shao Kahn has won. The Earthrealm is no more. In order to revive his Queen Sindel, the emperor Shao Kahn used the Outworld Tournament from Mortal Kombat 2 as a diversion while his Shadow Priests revive his fallen Queen on Earth. Once enacted, the dimensional bridge between the two realms connects, allowing Kahn's extermination squads to invade and destroy Earth, and enslave the population's souls.</p><p>A small team of Raiden's \"Chosen Warriors\" survives the attack: Mortal Kombat champion Liu Kang and his ally Kung Lao, Special Forces agents Sonya Blade and Jax, the shaman Nightwolf, the riot cop Stryker, the nomadic Kabal, and former Lin Kuei warrior Sub-Zero, who has gone rogue from his clan. Facing the warriors are the mercenary Kano, cyber-ninjas Smoke, Sektor and Cyrax, Sheeva, a female Shokan, the sorcerer Shang Tsung, and Queen Sindel herself.</p><p><em>Mortal Kombat 3</em> brings new elements to the 2D fighting series: multi-level playfields, \"Dial-A-Combo\" attacks, a \"Run\" button to speed up the battles, and \"Vs.\" codes, which unlock new powers and abilities once both players enter a code sequence in pre-match-up screens. Also included are more stage fatalities and finishing moves as each warrior attempts to go one-on-one with the Centaurian enforcer Motaro, and Shao Kahn himself.</p><p>Mortal Kombat 3 is the last traditional one-on-one fighting game game in the series to feature motion-captured digitized graphics for its kombatants, and introduces online network play to the PC version.</p>"},{"name":"Mortal Kombat II","year":1994,"developer":"Midway Manufacturing Company","url":"d#Mortal%20Kombat%20II%20%28World%29.zip","filesize":2357014,"score":7.9,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts > Regional differences","desc":"<p>The Mortal Kombat fighters, plus several new ones, return for a tournament held by the evil Shang Tsung of the Outworld. The action is one-on-one as before, and famed for its high level of violence and blood (other than the sanitised Nintendo version). There are 5 difficulty levels and optional credits, as well as the usual two player mode including same character duels.</p><p>To win the main tournament, the player must beat each of the other human players, before taking on Shang Tsung, Kintaro and finally Shao Kahn. Players have a range of punches and kicks available, as well as flying kicks, uppercuts, roundhouses, and the special moves, which vary for each player. These include throws, uppercuts, long-distance bullets, bicycle kicks and a teleport feature.</p>"},{"name":"Mr. Nutz","year":1994,"developer":"","url":"d#Mr.%20Nutz%20%28U%29.zip","filesize":745924,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>You are the cool squirrel of the title, and you must defeat the evil Yeti before he freezes the entire world. Your quest will make you explore many areas such as a forest, a witch's cottage, a volcano, the clouds, a circus...</p><p><em>Mr. Nutz</em> is a platform game, in which Nutz must jump on enemies to kill them. His tail can also be controlled. You move through levels using ledges, ladders, bridges and platforms. There are some simple puzzles involving object manipulation.</p>"},{"name":"Ms. Pac-Man","year":1991,"developer":"General Computer Corporation","url":"d#Ms.%20Pac-Man%20%28USA%2C%20Europe%29.zip","filesize":72018,"score":7,"genres":"Action > Top-down > Fixed / flip-screen > Arcade","desc":"<p>In 1981, a sequel to Pac-Man was introduced in the form of his girlfriend, <em>Ms. Pac-Man</em>. This sequel continued on the \"eat the dots/avoid the ghosts\" gameplay of the original game, but added new features to keep the title fresh.</p><p>Like her boyfriend, Ms. Pac-Man attempts to clear four various and challenging mazes filled with dots and ever-moving bouncing fruit while avoiding Inky, Blinky, Pinky, and Sue, each with their own personalities and tactics. One touch from any of these ghosts means a loss of life for Ms. Pac-Man.</p><p>Ms. Pac-Man can turn the tables on her pursuers by eating one of the four Energizers located within the maze. During this time, the ghosts turn blue, and Ms. Pac-Man can eat them for bonus points (ranging from 200, 400, 800, and 1600, progressively). The Energizer power only lasts for a limited amount of time, as the ghost's eyes float back to their center box, and regenerate to chase after Ms. Pac-Man again.</p><p>Survive a few rounds of gameplay, and the player will be treated to humorous intermissions showing the growing romantic relationship between Pac-Man and Ms. Pac-Man, leading all the way up to the arrival of \"Junior\".</p>"},{"name":"MTV's Beavis and Butt-Head","year":1994,"developer":"Radical Entertainment Inc.","url":"d#Beavis%20and%20Butt-Head%20%28USA%29.zip","filesize":1120304,"score":6.1,"genres":"Action > Side view > 2D scrolling > Puzzle elements > Comedy > Licensed","desc":"<p>This adaptation of the cartoon show <em>Beavis and Butt-Head</em> is a side-view action game with puzzle-solving elements. The goal is to find parts of a torn ticket to the GWAR concert, scattered across the game world. The protagonist duo visits locations such as Turbo Mall 2000, the street, Burger World, hospital, and others. Enemies can be defeated by farting and burping at them.</p>"},{"name":"Muhammad Ali Heavyweight Boxing","year":1992,"developer":"Park Place Productions","url":"d#Muhammad%20Ali%20Heavyweight%20Boxing%20%28USA%29.zip","filesize":595471,"score":7.5,"genres":"Sports > Diagonal-down > Boxing > Licensed","desc":"<p><em>Muhammad Ali Heavyweight Boxing</em>, as the name implies, is a boxing game featuring the three-time World Heavyweight Champion. The game display 2D sprite-drawn boxers in a 3D ring (the so-called \"FreeCam\" 3D system), with the boxers moving around the ring in 360°.</p><p>One or two players can choose the number of rounds (up to 15), the round length (up to 5 minutes), the number of times a fighter must be taken down to be T.K.O. and the number of referee counts (up to 10). There are two game modes: exhibition (which can be played against the computer or one-on-one by two players) and the tournament mode (single player). Players can choose among nine fictional fighters plus Muhammad Ali himself.</p><p>There are two control types: arcade and simulation. In the arcade mode, the d-pad moves the boxer around, while the A button is used for jabs, the B button for defense and the C button for hard punches. In this mode, the game decides which of the boxer's arms will be used for each punch. In the simulation mode, the d-pad moves the player around. By holding the A button (for the left arm) or C button (for the right arm), the player can perform head jabs (by pressing up in the D pad), body jabs (by pressing down), body hooks (by pressing left) and body hooks (by pressing right). Holding the B button, the player can cover up (by pressing up), duck (by pressing down), sway left (by pressing left) and sway right (by pressing right). By pressing A and B together, the boxer performs an uppercut.</p><p>Each fighter has a power and a speed bar. As they get tired by fighting or get hurt, the bars decrease. The lower the bars, the slower or weaker the punches get, until the boxer is knocked down. By defending himself a boxer can regain power or speed. There's also a counter of punches landed at each side of the screen. If the fight ends with no winner, the judges decision is made by those numbers alone, regardless of how many times the fighters were taken down during the fight.</p><p>The game features digitized speech, including samples of Ali's voice.</p>"},{"name":"Mutant League Football","year":1993,"developer":"Mutant Productions","url":"d#Mutant%20League%20Football%20%28USA%2C%20Europe%29.zip","filesize":588702,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Sci-fi / futuristic","desc":"<p>Futuristic, intergalactic war disguised as American Football, Mutant League Football was one of the most unique football games ever to hit the gaming market. It's a unique blend of sports and sci-fi, and the actual football is the good ol' smash-mouth kind, literally.</p><p>Dynamite throwing running backs, blitzing trolls, robots that bleed oil, it's all here. Opposing quarterback connecting on too many passes? Blitz him 'til he's dead. Suspect the ref's been bribed by the other side? Call a Kill Ref audible; it's a 5 yard penalty though. </p><p>Take your pick from nineteen teams, including three All-Star teams. There are five difficulty levels and a slow/fast game speed toggle. A tournament mode awaits those who want something more than a quick game versus the computer or a friend.</p><p>There are nineteen different fields to play on, all with there own special quirks. The Hellfield is littered with mines and fire pits to put an end to a careless runner, while The Pen is a slippery sheet of ice.</p>"},{"name":"Mutant League Hockey","year":1994,"developer":"Abalone","url":"d#Mutant%20League%20Hockey%20%28USA%2C%20Europe%29.zip","filesize":867417,"score":7.3,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Fighting > Hockey > Sci-fi / futuristic","desc":"<p>Mutant League Hockey is a violent hockey game in the same series as Mutant League Football.  There are 23 bizarre hockey teams to choose from, with players consisting of zombies, skeletons, trolls, and robots.  The arenas are equally strange, with hidden bottomless pits, mines placed under the ice, spikes, and a \"Demon Net\" that functions as a goalie by chomping up and down and devouring the puck.The game plays similar to normal hockey, except in this game your players can pick up chainsaws, maces, axes, etc. to use against the competition.  It's a bloody game, with opponents exploding into piles of goo (or circuits if they are a robot) when they become too injured.  The player can call special plays, like an exploding puck or jail break and attack the goalie.  The game also has fighting sequences if two players decide to get into a brawl.<br>The game comes with multiplayer and a playoff series, full stats for your players and instant replays.</p>"},{"name":"Mystic Defender","year":1989,"developer":"SEGA Enterprises Ltd.","url":"d#Mystic%20Defender%20%28USA%2C%20Europe%29.zip","filesize":279717,"score":7,"genres":"Action > Side view > Anime / Manga > Fantasy > Licensed > Regional differences","desc":"<p><em>Mystic Defender</em> is a side-scrolling platform game. It is the sequel to SpellCaster for the Sega Master System. However, in this sequel the RPG elements have been omitted in favour of side-scrolling platform gameplay.</p><p>In this game you play Joe Yamata (Kujaku) on a quest to rescue Alexandra from the villainous Zao, who is using her soul to resurrect his master Zareth in Azuchi castle. You have four types of magic to attack with and you can charge your blasts as well as change the magic type mid-game.</p>"},{"name":"Mystical Fighter","year":1991,"developer":"KID Corp.","url":"d#Mystical%20Fighter%20%28USA%29.zip","filesize":205400,"score":6.2,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Japan (Ancient/Classical/Medieval)","desc":"<p>A kabuki warrior steps into a time portal to go back to the Shogun dynasty to defeat the evil lord Kabuki. The game is basically a side-scrolling beat-em up game, with the player controlling the kabuki warrior. The player can deliver kicks and punches to hordes of enemy minions throughout each stage. Other moves at the the players disposal are jump kicks, the ability to lift enemies and throw them, and the ability to grab enemies and spin them like a tornado.The player can also use a special magic power that gets charged by picking up scrolls throughout the level. The player can also find life bar refills throughout a stage also.</p><p>Each section of a stage must be defeated within a certain time limit. At the end of a stage the player must defeat a boss enemy to advance to the next stage.</p>"}]