[{"name":"Nakajima Satoru Kanshū F-1 Grand Prix","year":1991,"developer":"Varie Corporation"},{"name":"Nakajima Satoru Kanshū F1 Super License","year":1992,"developer":"Aprinet"},{"name":"NBA Action '94","year":1994,"developer":"Malibu Interactive","url":"d#NBA%20Action%20%2794%20%28USA%29.zip","filesize":1003867,"score":7.3,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p><em>NBA Action '94</em> is one of the many basketball games released for the Genesis. It includes the 1993-1994 rosters with all 27 teams and has many of the NBA stars at the time including Chris Webber when he began for the Golden State Warriors.</p><p>You can play with up to five players all on the same team using the multi-tap adapter. You can play either 20, 40 or the complete 82 games and play your way into the postseason.</p><p>The game keeps track of all the win/loss records and stats, even lets you play the role as coach as well as play in the game, however it only has three offensive plays.</p>"},{"name":"NBA Action '95 starring David Robinson","year":1995,"developer":"Double Diamond Sports","url":"d#NBA%20Action%20%2795%20Starring%20David%20Robinson%20%28USA%2C%20Europe%29.zip","filesize":1041574,"score":6.9,"genres":"Sports > Top-down > 2D scrolling > Basketball > Licensed","desc":"<p>This is the sequel to NBA Action '94 with the standard modes (Exhibition, Season, etc.) and features 300 top players of the 1994 NBA season and all 27 NBA teams and their respective logos. Players can also edit their own team's roster and create up to 40 different custom players that can be saved to the game's battery back-up. The game not only has former San Antonio Spurs player, David Robinson, endorsing and appearing in the game, but also play-by-play commentator Marv Albert also lends his voice talent to the game.</p>"},{"name":"NBA All-Star Challenge","year":1992,"developer":"Beam Software Pty., Ltd.","url":"d#NBA%20All-Star%20Challenge%20%28USA%2C%20Europe%29.zip","filesize":487683,"score":5.4,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p>NBA All-Star Challenge offers one-on-one basketball featuring NBA players from the 1991-1992 season. Five different playing modes are available: a single one-on-one match, a free throw competition, a 3 point shootout, a H.O.R.S.E. competition and a one-on-one tournament.You can choose from 27 players (one from every NBA team), including Michael Jordan, Larry Bird, Patrick Ewing, Karl Malone and David Robinson.Each mode can also be played by two players.</p>"},{"name":"NBA Hang Time","year":1997,"developer":"Tiger Electronics, Inc.","url":"d#NBA%20Hang%20Time%20%28USA%29.zip","filesize":1682792,"score":"","genres":"Sports > Side view > Fixed / flip-screen > Direct control > Basketball > Licensed","desc":"<p>It's time to hang with the NBA! Play as the team of your choice and play through an entire schedule to become world champion! There's even a special \"save\" feature to save your place as you play through the schedule - even when you lose a game! Like the NBA, you run full court, shoot 2 and 3 pointers, block, rebound, pass, steal, and can even crank into a higher mode with \"turbo\" power! All the excitement of the NBA is right here in the palm of your hands.</p>"},{"name":"NBA Hangtime","year":1996,"developer":"Midway Manufacturing Company"},{"name":"NBA Jam","year":1994,"developer":"Midway Manufacturing Company","url":"d#NBA%20Jam%20%28USA%2C%20Europe%29.zip","filesize":1181711,"score":7.8,"genres":"Action > Sports > Side view > 2D scrolling > Arcade > Direct control > Basketball > Licensed","desc":"<p><em>NBA Jam</em> is a two-on-two basketball game You can play any NBA team, and you can play as players like Barkley, Starks, Pippen, and Grant. Each human player controls a single player, so choose your squad wisely to take team-mate skill into account. The game is action-oriented, and players can perform unrealistic slam-dunks. Full performance statistics are automatically recorded. The play clock and 3-point line apply, but other rules are largely overlooked.</p>"},{"name":"NBA Jam Tournament Edition","year":1995,"developer":"Midway Manufacturing Company","url":"d#NBA%20Jam%20-%20Tournament%20Edition%20%28World%29.zip","filesize":1834302,"score":7.6,"genres":"Action > Sports > Side view > 2D scrolling > Arcade > Direct control > Basketball > Licensed","desc":"<p>This game lets you play two-on-two arcade basketball with players from all the NBA teams. Gameplay is fast and action-packed, with few rules, no fouls, and deliberately unrealistic jamming. Players are rated on eight ability categories, from steals and blocks, to dunks and 3-pointers.</p><p>Up to four human players can take part, each always controlling a single player for their team, and AI for missing players. This allows for four players to face each other in teams of two, or for two players to team up against a third player with a CPU team-mate.</p><p>The <em>Tournament Edition</em> ups each team's roster to three players, and allows for substitutions between quarters. Shoving players now results in injuries, which lower a player's stats; encouraging you to sub them out and let them recover. Aside from the usual secret characters and cheat modes, the T.E. also includes four new additions you can individually enable from the special options menu:* \"Hot Spots\" are randomized zones on the court that reward extra points (up to a 9-point shot!) for making a basket while standing within them.</p><ul><li><p>Powerup icons appear randomly, and convey temporary arcade-like benefits when picked up. Some examples are instant \"on-fire,\" enhanced 3-point accuracy, monster dunks from anywhere on the court, or a bomb that knocks all other players to the ground.</p></li><li><p>\"Juice Mode\" increases the speed of the game up to 4x.</p></li><li><p>\"Tournament Mode\" disables all other modes, special characters, and cheats, and challenges you to defeat all the NBA teams to unlock extra players (2 extra players for almost every team). Winning Tournament Mode also unlocks a higher CPU difficulty level.</p></li></ul>"},{"name":"NBA Live 95","year":1994,"developer":"Hitmen Productions","url":"d#NBA%20Live%2095%20%28USA%2C%20Europe%29.zip","filesize":1157079,"score":8.2,"genres":"Sports > Diagonal-down > Isometric > Direct control > Basketball > Licensed","desc":"<p>The first of the NBA Live titles on the PC, <em>NBA Live 95</em> includes all of the basketball players from the '94 - '95 season as well as the All-Star teams from the East and West.</p><p>Manage over 300 players using the General Manager feature, new in this edition. Statistics for each player and team are saved. View players and teams side-by-side to compare stats and other information. You can trade any player in the league.</p><p>Multiple in-game settings let you choose the mode of play, the style, and even the length of a quarter or session. Full motion videos bring your plays to life onscreen. Listen to the crowd roar, the noises of the court and hoop, and voices of the players. There is also a soundtrack of modern music.</p><p>The DOS version includes support for 2 graphics resolutions: Normal mode (low res) 320x200 or Wide Angle (high res) 640x480. Gameplay can be controlled using the keyboard, mouse or joystick.</p>"},{"name":"NBA Live 96","year":1995,"developer":"Electronic Arts, Inc.","url":"d#NBA%20Live%2096%20%28USA%2C%20Europe%29.zip","filesize":1149077,"score":8,"genres":"Sports > Diagonal-down > Isometric > Direct control > Basketball > Licensed","desc":"<p>As with all games in the NBA Live series you can draft, trade and edit players.  Play a full season, exhibition or just the playoffs.  96 includes 29 teams including the expansion Toronto and Vancouver teams.</p>"},{"name":"NBA Live 97","year":1996,"developer":"NuFX, Inc.","url":"d#NBA%20Live%2097%20%28USA%2C%20Europe%29.zip","filesize":1084074,"score":7.1,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p><em>NBA Live 97</em> is a basketball game with an emphasis on realism. You can choose from all of the NBA teams, create a team with players you create yourself, or choose a team formed by the All-Star players of the east or West coasts. When you create a player yourself you can customize the player to a high degree. There are over 60 offensive and 10 defensive set-ups. Match options include an exhibition match, a whole season or the playoffs.</p>"},{"name":"NBA Live 98","year":1997,"developer":"Electronic Arts Canada","url":"d#NBA%20Live%2098%20%28USA%29.zip","filesize":1021134,"score":7.7,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p><em>NBA Live 98</em> offers the player all teams, players and stadiums of the 1998 NBA season. More than 350 faces got scanned to improve realism. Also some new moves like crossover or fade-aways are implemented. You can play single games, whole seasons, the playoffs or new things like manager career or 3-point-shootout in the style of an all-star-game.</p>"},{"name":"NBA Showdown '94","year":1994,"developer":"Electronic Arts Canada","url":"d#NBA%20Showdown%20%2794%20%28USA%2C%20Europe%29.zip","filesize":900340,"score":7,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>The final entry in Electronic Arts' basketball series based on the old NBA playoffs engine before the NBA Live series took over.</p><p>For the first time, the game features all 27 NBA teams from the 1993-1994 season. You can now play a full season with 82 games in addition to playoffs and exhibition games.</p><p>Back from the old versions are instant replays, signature moves (some of them new) and free throw T-meter. Game speed has been sped up.</p>"},{"name":"NCAA Final Four Basketball","year":1994,"developer":"Bitmasters, Inc.","url":"d#NCAA%20Final%20Four%20Basketball%20%28USA%29.zip","filesize":486847,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p><em>NCAA Final Four Basketball</em> is a standard basketball-sim with a full NCAA license with 64 of the top Division 1-A teams including North Carolina, Florida State, Boston College, and Maryland to name a few.</p><p>There are three modes of play to choose from: two <em>Practice</em> modes, one which shows the player the basic in's and outs of the game and another for free throw shooting, <em>Exhibition</em> and <em>Tournament</em>. Along with these modes are the ability to change around options to play a game to the player's liking including changing the length of the game. A battery-backup lets the player save their games, stats and rosters.</p>"},{"name":"NCAA Football","year":1994,"developer":"The Software Toolworks, Inc.","url":"d#NCAA%20Football%20%28USA%29.zip","filesize":490380,"score":"","genres":"Sports > Top-down > 2D scrolling > Football (American) > Licensed","desc":"<p>NCAA Football lets you play as one of sixteen college football teams in either an exhibition game or in tournament play. The tournament pits you against all the other teams which you must win in order to proceed; the game will automatically save after each game won so you can pick up the tournament where you left off. Team rosters are unique in that you can choose players from different decades from the 60's up to the 90's, and you can mix players from different decades if you want.</p>"},{"name":"New Horizons","year":1994,"developer":"KOEI Co., Ltd.","url":"d#New%20Horizons%20%28USA%29.zip","filesize":1013768,"score":7.3,"genres":"Simulation > Strategy > Diagonal-down > Naval / watercraft","desc":"<p>In the first Uncharted Waters game, it was the 15th century and the New World was discovered. Now in <em>New Horizons</em>, it is the early 16th century and the age of exploration and sea trade is underway. Players choose from any one of six adventurers (scenarios), each with their own distinctive but intertwining plot, to embark on a quest of sailing, seamanship and exploration. The six characters are:<em> </em><em>João Franco</em>* is the son of Duke Leon Franco, the hero of the first Uncharted Waters game and an influential man in Portugal. His father wants to make him into a strong man and so decides to send him out to sea. Young Joao is tasked with learning the skills of the sailor (he is the only character who starts at level one) and embarking on a quest of discovery; reaching the far east and eventually looking for the secret of Atlantis.</p><ul><li><p><strong>Catalina Erantzo</strong> is a Spanish naval officer who believes her beloved and her brother were both murdered by the Portuguese armada. Vowing revenge she turns to a life of piracy and soon becomes a red haired scourge of the seas.</p></li><li><p><strong>Pietro Conti</strong> is a indebted man, having inherited the financial woes of the Conti family. When the Duchess Franco hires him to spy on her son, he accepts the job and obtains a ship. Pietro hopes to use these resources to seek out valuable treasure and clear up his family's debt.</p></li><li><p><strong>Ernst Von Bohr</strong> is a geographer who is teaching classes in Holland. He yearns to leave the classroom and sail the high seas, living a life of adventure that he has only read about in books. When his friend, Mercator offers to finance his initial voyage in exchange for cartography information about the world, Ernst is given the opportunity to live out his dream.</p></li><li><p><strong>Ali Vezas</strong> is a poor orphaned child living in Istanbul and serving others. He dreams of becoming his own master and making his own fortune across foreign lands. A twist of fate aides in providing him with small loans, with which he is able to afford his first ship and sail out with a cargo hold full of goods...</p></li><li><p><strong>Otto Baynes</strong> styles himself a Royal Knight of the British Empire, in the service of his majesty the king. Promoted to Admiral of the British fleet, the kingdom is worried about the increased naval power of Spanish fleets. Otto is given a letter of marque by the king and ordered to terrorize the Spanish Fleet. Equipping himself simply at first, Otto strives to become a great privateer in the name of king and country.</p></li></ul><p>Regardless of the character chosen, <em>Uncharted Waters: New Horizons</em> is a top-down sailing simulation. At sea, players control the direction of their ship, where speed is affected by the number/health of the crew, the wind and the currents. Players can navigate anywhere there is water (though some ships are not ocean worthy) and discover interesting landmarks and new ports. Upon landing at a port, the view is also top-down and the player can enter different buildings, each with unique services and goods. These include: the Inn, the Item Shop, the Shipyard, the Tavern, the Castle, the Guild Hall, the Church, the Merchant and the Harbor. It's up to the player to earn enough gold to keep the crew fed and financed and keep the fleet repaired. Primary methods of earning money are through sea trade, accepting jobs from the guild, gambling and battle with other ships.</p><p>During naval combat, the game becomes a turn-based top-down strategy game, with the player moving ships in order to obtain trajectories needed to fire cannons at enemy ships, or run alongside enemy vessels in order to board them. If the player's flagship attacks the flagship of the enemy fleet, they can challenge the opponent to a duel. If accepted, the game changes to a side-view of the two captains engaged in a fight. During this sequence, the player can only choose which fighting maneuver (strike, thrust, parry, lash) they wish to engage in.</p>"},{"name":"New Zealand Story, The","year":1990,"developer":"Taito Corporation"},{"name":"Newman/Haas IndyCar featuring Nigel Mansell","year":1994,"developer":"Gremlin Graphics Software Limited","url":"d#Newman%20Haas%20IndyCar%20featuring%20Nigel%20Mansell%20%28World%29.zip","filesize":723654,"score":6.5,"genres":"Racing / Driving > Simulation > 1st-person > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Newman Haas Indy Car is, as the name shows, a racing game endorsed by the CART racing team of the same name and their top driver at the time, Englishman Nigel Mansell. </p><p>The player has the option to drive a single race (where the option to practice is hidden) or go for the crown against 12 other drivers in 15 tracks (with some variety, not only ovals) across North America, with the season opener in Queensland, Australia. It is possible play solo, with a friend in split screen or with split screen against the computer, and if music or engine sounds are played in the race.A key choice in the game is selecting between Arcade and Simulation mode - in the later, the car can take a lot less damage before giving up, fine-tuning must be done by the driver and rules are enforced, under the risk of a disqualification.</p><p>Graphically, the game is less sterile than most driving games of the platform (and in 16-bit consoles, generally), thanks to the inclusion of several polygonal buildings scattered around the circuits.</p>"},{"name":"NFL '95","year":1994,"developer":"Double Diamond Sports","url":"d#NFL%20%2795%20%28USA%29.zip","filesize":908260,"score":7.1,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>NFL '95</em> was Sega Sports answer to EA Sports Madden line of football games. It has many of the same features as well as all 28 professional teams along with 1,500 of the top NFL players of the 1993 season to play as.</p><p>The game contains a standard Exhibition mode as well as a Season mode where players can manipulate trades, sign free agents and store records for up to seven different users thanks to the games battery backup system, which was also used to track league leaders in thirteen different categories.</p>"},{"name":"NFL 98","year":1997,"developer":"Spectacular Games, Inc.","url":"d#NFL%2098%20%28USA%29.zip","filesize":1014990,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>NFL 98</em> is an NFL-licensed football game updated from Prime Time NFL Football, and one of the last NFL titles to be released on the Genesis. It features all 30 NFL teams and complete rosters for the 1997 season. Just like the previous title, there are season and exhibition modes, as well as team management options and a comprehensive in-game manual detailing the various aspects of the game.</p>"},{"name":"NFL Football '94 starring Joe Montana","year":1993,"developer":"BlueSky Software, Inc.","url":"d#NFL%20Football%20%2794%20Starring%20Joe%20Montana%20%28USA%29.zip","filesize":1072726,"score":"","genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p>After SEGA picked up the license and changed names with last year's edition, they ultimately decided to drop 'Sports Talk' for the simpler title \"NFL Football\". With over 800 players based on the 1992 season, all of the series trademarks including play-by-play commentary, authentic playbooks and instant replays are intact. Battery backup support is available for season play. This release features significant camera adjustments including a lower perspective and some enhanced zooming features which bring mixed reactions.</p>"},{"name":"NFL Quarterback Club","year":1994,"developer":"Iguana Entertainment Incorporated","url":"d#NFL%20Quarterback%20Club%20%28World%29.zip","filesize":1667915,"score":7.7,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>One of the earliest in the series which features all 28 NFL teams including their respective nicknames and logos and many of the top players of the day including John Elway, Joe Montana, Brett Farve and Troy Aikman, just to name a few.</p><p>There are a variety of game modes to choose from including <em>NFL Play</em> which includes preseason, season and playoff modes along with the <em>Simulation</em> mode that allows players to relive past moments of NFL history and lets the player recreate these moments or change history all together.</p><p>Also included is the <em>Quarterback Challenge</em> which would become a staple in the series. In the QB Challenge, the player chooses from one of nineteen different NFL quarterbacks to compete in a series of challenges that will test their accuracy, speed, power and knowledge. Players can also create their own custom quarterback and throw them into the competition.</p><p>Players can also customize their options including quarter lengths, weather conditions, rules, etc. The game also contains a battery backup to save games and created characters.</p>"},{"name":"NFL Quarterback Club 96","year":1995,"developer":"Iguana Entertainment Incorporated","url":"d#NFL%20Quarterback%20Club%2096%20%28USA%2C%20Europe%29.zip","filesize":2009179,"score":7.5,"genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p>Another game in <em>NFL Quarterback series</em>.Every team from the 1996 NFL season is shown here, with real player numbers and stats. 32 offensive plays and 16 defensive plays are available as you play. Options include setting quarter lengths, from one to 15 minutes, and selecting your mode of play: Preseason, Playoffs, or a full Season, in which you play 18 games towards the goal of the Super Bowl.</p>"},{"name":"NFL Sports Talk Football '93 Starring Joe Montana","year":1992,"developer":"BlueSky Software, Inc.","url":"d#NFL%20Sports%20Talk%20Football%20%2793%20Starring%20Joe%20Montana%20%28USA%2C%20Europe%29.zip","filesize":872316,"score":7.1,"genres":"Sports > Top-down > 2D scrolling > Football (American) > Licensed","desc":"<p>An entry in Sega's early football series, Sports Talk '93 weighs in at an impressive (for the time) 12 megs. Play any of the 28 teams in Exhibition, League Play, Play-offs, or the Super Bowl.  Multiple field views and Sports Talk 2.0 (\"over two times more commentary\") are the main features that set it apart from other football games.  Two players can compete or cooperate against the computer.  Also, a coaching mode is including, which allows the players to pick the plays for the computer to run.</p>"},{"name":"NHL '94","year":1993,"developer":"Electronic Arts Canada","url":"d#NHL%20%2794%20%28USA%2C%20Europe%29.zip","filesize":578228,"score":8.1,"genres":"Sports > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>After establishing themselves in the virtual rinks, EA combined both NHL and NHLPA licenses in <em>NHL '94</em>, allowing them to feature all 26 real teams (including both expansion teams) and players of the new NHL season for the first time in the series.</p><p>Aside from the licenses, the gameplay for this edition sees for the first time the inclusion of the devastating one-timer shot, but to keep forwards (literally) in check, defenders also feature harder body checks, with new animations. For an additional challenge, players can also choose to control the goalkeeper manually. A popular feature in previous editions, fighting is completely removed from the game. Game modes include exhibition games (or \"regular season\" in-game), playoffs (best of one or best of seven) and an all new shoot-out mode. The main options remain basically the same couple since the establishment of the series - period length (5, 10 or 20 minutes), line changes (off, manual or the new automatic mode) and penalties (off, on, on but no offsides). </p><p>While there are some minor differences between platforms (Genesis features record keeping for users and the MegaCD version has more stat screens, CD quality audio backdrops and the usual highlight clips here and there), only the PC version released at the same time features complete season action.</p>"},{"name":"NHL '95","year":1994,"developer":"Pioneer Productions","url":"d#NHL%2095%20%28USA%2C%20Europe%29.zip","filesize":940171,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p><em>NHL 95</em> was EA Sports' third licensed ice hockey game, promising the fastest action in the series to date. The action is viewed top-down, and can be played with or without realistic penalties. There is a full season mode, allowing you to guide a team through all 84 matches, with the option of injuries potentially putting players out of a sequence of matches. You have full control over trading and creating players for your squad. New in-game moves include dummy shots and lie-down blocks.</p>"},{"name":"NHL '96","year":1995,"developer":"High Score Productions","url":"d#NHL%2096%20%28USA%2C%20Europe%29.zip","filesize":942243,"score":8.1,"genres":"Sports > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>While the PC version migrated to 3D graphics, <em>NHL 96</em> on Genesis retains the classic 2D top-down view of the series, while offering different playing modes than the SNES version.</p><p>The game features players and teams from the 1994-95 NHL season. Game modes include Regular Games, Shootouts, Playoffs (in either single elimination or best-of-seven mode), and a full season. Creating and trading players is also supported.</p><p>While the real NHL season was shortened due to a lockout, the game includes the originally planned 82-game schedule. In NHL 95, any scheduled game could be played. This has been changed in favor of the player picking their team and taking it through the entire season. A scheduled game can either be played or simulated, and the season can be ended at any time, skipping to the playoffs based on current league standings.</p><p>Compared to previous entries, many more moves for players have been added, including give-and-gos, one-timers, the spin-o-rama, fake shots and drop passes. For the first time, the game has selectable difficulty levels, while fights between players make a return, having last been featured in NHLPA 93.</p>"},{"name":"NHL '97","year":1996,"developer":"Electronic Arts Canada","url":"d#NHL%2097%20%28USA%2C%20Europe%29.zip","filesize":1001425,"score":7.8,"genres":"Sports > Diagonal-down > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>1997 edition of EA's NHL sport simulation series. Improvements in this edition come mostly in the graphical arena, with a refined version of the \"virtual stadium\" system that adds new camera angles (including the classical top-down one strangely missing from NHL 96), and polygonal players instead of the bitmap-based ones with motion-captured animations.</p><p>Other extras include multiplayer support for up to 8 players through network or Gravis's GrIP system, the option to create new players and trade them around, and the usual amount of EA sports licensed multimedia flair, including an interesting \"Goalie Mask Viewer\" which lets you observe the elaboratedly decorated helmets of 30 goalies.</p>"},{"name":"NHL '98","year":1997,"developer":"Electronic Arts Canada","url":"d#NHL%2098%20%28USA%29.zip","filesize":1000898,"score":8,"genres":"Sports > Diagonal-down > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>NHL 98 features much faster and refined gameplay (now using four action keys instead of two, removing the need to double-tap to perform some actions), along other new features such as \"in-the-fly\" tactics developed by Marc Crawford, then manager of the Colorado Avalanche and new commentary lines from Jim Hughson and Darryl Reaugh and a re-worked interface.Graphics are improved from the previous version with the players being less angular, and thanks to 3Dfx support, with less pixels showing in the textures. The in-game presentation follows a TV-style script, zooming in players while displaying stats during clock stoppages.</p><p>As far as game modes go, in the year of the first Olympic Tournament with professional players, NHL 98 introduced the first real international competition, with 18 International teams to choose from. Other game modes include Season (option to pick between 25 or 82 games) and Playoff (best of 1, 3, 5 or 7 matches) and a Penalty Shootout mode.</p>"},{"name":"NHL All-Star Hockey '95","year":1995,"developer":"Sega Midwest Development Division","url":"d#NHL%20All-Star%20Hockey%2095%20%28USA%29.zip","filesize":967470,"score":6.7,"genres":"Simulation > Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p><em>NHL All-Star Hockey '95</em> is the standard hockey game complete with an NHL and NHLPA license complete with all 26 NHL teams and over 650 players from the 1993-94 NHL season including Mark Messier, Mario Lemieux, Jeremy Roenick and the Great One himself, Wayne Gretzky. The standard modes apply including <em>Exhibition</em>, <em>Season</em> and <em>Playoffs</em> which include the updated best-of-seven format. There is a battery back-up that allows players not only to save games but keep track of 15-types of stats and also features the voice talent of broadcasting legend, Marv Albert for in-game commentary.</p>"},{"name":"NHL Hockey","year":1991,"developer":"Park Place Productions","url":"d#NHL%20Hockey%20%28USA%29.zip","filesize":279903,"score":8,"genres":"Sports > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>The game includes all of the 24 NHL teams and over 500 players, rated in over 15 skill categories. You can play the complete league season or create your own brand new league with up to 24 human participants. All the rough and tumble action of the sport is recreated from a top-down viewpoint. A full replay system is included. Digitized speech and organ music aim to bring authentic NHL arenas to life.</p>"},{"name":"NHLPA Hockey '93","year":1992,"developer":"Electronic Arts, Inc.","url":"d#NHLPA%20Hockey%2093%20%28USA%2C%20Europe%29.zip","filesize":315106,"score":7.8,"genres":"Sports > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>The second part in Electronic Arts' hockey series. It features the NHLPA license (so it has real player names), but not the NHL license (so it doesn't have NHL team names).</p><p>Gameplay is altered only slightly over the predecessor. Regular season and Playoff modes are available. Goalies have improved AI, there are more foul play options and the game now features detailed statistics.</p>"},{"name":"Nickelodeon: Aaahh!!! Real Monsters","year":1995,"developer":"Realtime Associates, Inc.","url":"d#Aaahh%21%21%21%20Real%20Monsters%20%28USA%29.zip","filesize":952926,"score":6.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>In this game, based on the popular Nickelodeon animated series, you control three monsters: Ickis, Oblina, and Krumm. The Gromble, a headmaster in monster school, needs you to perform the final test - monster Midterm Exam - in order to prove yourselves to be <em>real</em> monsters. You should collect trash, throw it on people, and scare them!</p><p>This is a platform game, where you control three characters. Each one of them has a special move that is often used to solve puzzles and overcome obstacles: Ickis can fly for a short time, Oblina can reach high ledges, and Krumm can scan off-screen areas. They can also collect monster books, that will teach them to scare people. Help the three monsters to graduate!</p>"},{"name":"Nigel Mansell's World Championship Racing","year":1993,"developer":"Gremlin Graphics Software Limited","url":"d#Nigel%20Mansell%27s%20World%20Championship%20Racing%20%28USA%29.zip","filesize":496395,"score":6.9,"genres":"Racing / Driving > Simulation > 1st-person > Automobile > Track racing > Vehicle simulator > Oceania > Licensed","desc":"<p>Timing smiled on Gremlin with this licensed Formula 1 simulation, as Nigel's long quest for a championship had finally come good. The game was pitched somewhere in between a full-blown simulation like F1 GP and action games like Continental Circus. Only 12 cars were in each race, which could last from between 3 and 20 laps.</p><p>Before each race you can customize wing downforce, gear ratio, tyre selection and fuel load choices – pitstops are a standard feature of the longer races. The 16-bit versions include a unique 'Improve With Mansell' mode, in which a digitized version of Nigel's head appears in the top corner of the screen, offering instructions and praise.</p>"},{"name":"Nightmare Circus","year":1996,"developer":"Funcom Oslo A/S"},{"name":"Ninja Burai Densetsu","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Nintendo World Cup","year":1992,"developer":"Technos Japan Corp."},{"name":"No Escape","year":1994,"developer":"Bits Corporation","url":"d#No%20Escape%20%28USA%29.zip","filesize":980970,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p>Based on the 1994 movie of the same name starring Ray Liotta, the player takes control of Liotta's character, Capt. J.T. Robbins, whose only objective of the game is to escape an island. After shooting his commanding officer, Robbins is imprisoned and eventually sent to the island Absolom as a war criminal, from where there is no escape possible. To do this still, the player must explore the island with side-scrolling platform gameplay for clues, finding items and combining them to make weapons and traps.  </p><p>Robbins can talk to some prisoners to help him in his quest, but he must also avoid violent prisoners, either by attacking them with punches or kicks or using traps and stealth to bypass them. The graphics are based off of rotoscopes of the actual actors from the movie.</p>"},{"name":"Nobunaga no Yabō: Haōden","year":1994,"developer":"KOEI Co., Ltd."},{"name":"Nobunaga's Ambition","year":1993,"developer":"Tecmo Koei Games Co., Ltd.","url":"d#Nobunaga%27s%20Ambition%20%28USA%29.zip","filesize":250885,"score":7,"genres":"Strategy > Top-down > Turn-based > Turn-based strategy > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p>In the 16th century, Japan's Sengoku (\"Warring States\") period divided the nation into numerous feudal states, each ruled by a daimyo. These daimyos would often go to war with each other. Many dreamt of conquering the land, becoming the Shogun and ruling the entire country. One of those daimyos was the ambitious Nobunaga Oda, a merciless ruler and a renowned strategist. Players take on the role of Nobunaga Oda or one of many other daimyos to try to conquer Japan. </p><p><em>Nobunaga's Ambition</em> is a turn-based strategy game which can be played in different modes. Gameplay is similar to Koei's better known Romance of the Three Kingdoms game. Players begin by selecting either a 17 regions scenario or a larger 50 scenario. Then, the player must select a daimyo, each of which is rated attributes in several categories; Age, Health, Ambition, Luck, Charm and IQ. As the game progresses, these values change depending on events in the game. The age value represents a time limit of sorts, as an elderly daimyo becomes increasingly likely to die of old age or sickness.</p><p>During each of turn (one per season), players can issue one of several commands from a menu. They include: Recruiting new soldiers, Training the army, Buying Weapons, Increasing Peasant morale, Forming alliances or Hiring Ninjas to bribe &amp; assassinate. When one player attacks another, there is a war fought over the defender's region. Battles are fought in an overhead-view hex battle map. Each player takes turn moving units and issuing orders, which include attack, move, bribe and surrender. The goal is to defeat all of the enemy units (or force them into surrender). Army units each have a certain weakness against other types of enemies, and are also affected by the terrain.</p>"},{"name":"Nobunaga's Ambition: Lord of Darkness","year":1991,"developer":"Koei Tecmo Games Co., Ltd."},{"name":"Normy's Beach Babe-O-Rama","year":1994,"developer":"Realtime Associates, Inc.","url":"d#Normy%27s%20Beach%20Babe-O-Rama%20%28USA%2C%20Europe%29.zip","filesize":554816,"score":5.7,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p>Normy is one popular surfer, especially with the ladies on the beach, however one day a UFO appears and kidnaps all the ladies on the beach and it is up to Normy to travel to 29 different alien worlds to bring them back to Earth.  The gameplay is a side-scrolling action game, controlling Normy and fighting off various bad guys scattered throughout the stage using weapons such as glove extending hammers or beaver mallets.  There are also puzzles that need to be solved at times to advance on, various pitfalls and traps to avoid, and six different bosses to fight.</p>"}]