[{"name":"Oh Mummy Genesis","year":2012,"developer":"1985 Alternativo","url":"d#Oh%20Mummy%20Genesis%20%28World%29%20%28Unl%29.zip","filesize":302650,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Arcade > Direct control > Fantasy","desc":"<p><em>Oh Mummy Genesis</em> is an unofficial enhanced remake of Oh Mummy. The player controls one of two adventurers sent to Egypt by the British Museum to collect a set of five royal mummies and all the treasure they can carry. Gameplay takes the form of a single-screen maze game, similar to Pac-Man. Each floor of the dungeon has a grid of sarcophagi; the player must walk a full circle around a sarcophagus to open it, and must collect at least one key and one treasure before moving on to the next level. Unlike the original game, <em>Oh Mummy Genesis</em> features a slightly more involved story and each tomb is capped off with a boss battle.</p><p>In addition to the remake, a faithful port of the original Amstrad CPC version of <em>Oh Mummy</em> is also included.</p><p>After the initial print run sold out, the game's ROM was made available for free download from its official website.</p>"},{"name":"Old Tower","year":2019,"developer":"RetroSouls"},{"name":"Olympic Gold: Barcelona '92","year":1992,"developer":"Tiertex Ltd.","url":"d#Olympic%20Gold%20%28Japan%2C%20USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%29.zip","filesize":255383,"score":7.1,"genres":"Sports > Side view > 2D scrolling > Fixed / flip-screen > Olympiad / mixed sports > Licensed","desc":"<p>The official game of the Games of the XXV Olympiad, held in Barcelona in 1992, featuring seven different events: 100M Sprint, Hammer Throw, Archery, 110M Hurdles, Pole Vault, Springboard diving and 200M Freestyle Swimming.</p><p>Gameplay features the typical button mashing formula used by Epyx during the 80s. 100M Sprint, 110M Hurdles and 200M Freestyle Swimming feature a button mashing sequence with just some changes: in the hurdles the player must hit the action key to jump over a hurdle (the timing sets the loss of speed) and in swimming, the sequence takes over one and an half minutes and the action button touches the edge for the return swim. In these events, the player initially faces a semi-final round and only qualifies for the final if ends in the top half. It's possible to watch the other semi-final.Hammer Throw combines a strong mashing sequence, along an accurate press of the action button to release the hammer, while Pole Vault combines an initial mashing sequence, a first tap on down to set the bar, then pressing up and the action button to release the pole and jump over the bar. Archery is a technical event where the player has three rounds with six arrows each, the winner being the one with the highest score on all three rounds.</p><p>The player can choose to compete for eight nations: Great Britain, France, Germany, Italy, hosts Spain, United Stats, Japan and the CIS (formerly the Soviet Union). Each nation has it's own sample of the anthem and a set of athletes to compete against the player. Each athlete is unique, and will perform differently according to the event: in some they are capable of breaking World Records, in others, lucky enough to get to a final or a top-6 spot. The competition is split in two tables: sorted by medals and by total score (the gold medalist gets 24 points, the 12th only 13).</p>"},{"name":"Olympic Summer Games","year":1996,"developer":"Tiertex Ltd.","url":"d#Olympic%20Summer%20Games%20%28USA%2C%20Europe%29.zip","filesize":718425,"score":5.9,"genres":"Sports > 1st-person > Diagonal-down > Side view > Isometric > Olympiad / mixed sports > Licensed","desc":"<p>Olympic Summer Games is the 16-bit official videogame of the 1996 Olympic Games held in Atlanta, the third and the last IOC official title to be released on the console. A typical button masher, includes 10 events (100m sprint, 110m hurdles, pole vault, long jump, triple jump, javelin, high jump, discus, skeet and archery) and 32 countries around the world compete in custom or full Olympics, or just practice. Two players can compete head to head in the sprinting events, and a total of eight can play in the same game. Three difficulty levels allow competitive events for both rookies to veterans in the genre.</p><p>Sprinting events are a short and straight button mashing frenzy. 4 athletes compete simultaneously, the first winner advancing to the next round (two qualifiers and then the medal run). Only fast fingers and quick shotgun reaction can earn world record times. </p><p>Jumping events are a mix of shorter button mashing bursts combined with timely pressed jumps. From the straight forward high and long jump events (run and then set the jump angle) to the more elaborate triple jump (as the name suggests, three jumps must be carefully measured for world class results) and the complex pole vault, where a strong run must be followed by a sharp pole fixation and good a release upwards. Both long jump and triple jump have a first round composed by three jumps, the better eight progress into the second round, where they are given three more jumps. In the high jump and pole vault the competition continues until all athletes miss three consecutive jumps.</p><p>The throwing events (discus and javelin) work in the same fashion as the jumping events, although trickier to pull, as the setting of the angle must be followed by a timely release. Each player is entitled to three throws, the top eight allowed three more attempts.</p><p>Finally, the shooting events. Archery is a three-round competition where the goal is to amass as many points as possible by shooting at the inner rings of the target. With six arrows per round, each shot must be calculated according to the wind, choosing between steady aim and lower tension (must be aimed upwards and compensating the wind) or higher tension but a jumpy aim (can be aimed directly at the \"gold\" points). Skeet is a five round competition where the goal is to hit five clay pigeons before they disappear off-screen with two slugs for each.</p>"},{"name":"Onslaught","year":1991,"developer":"Realms","url":"d#Onslaught%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":236155,"score":6.7,"genres":"Action > Side view > Platform > Fantasy","desc":"<p>As a highly respected warrior, you are attempting to conquer as many regions as possible. This is a three-stage task, as first you must fight through hordes of fighters simply to reach the castle, and then you have to climb the various sections of the castle, before battling with its existing inhabitant.</p><p>The bulk of the game is side-scrolling platform hack 'n' slash action, with mines to avoid on the route. You can collect a number of spells, and select them using the function keys. Your physical and mental energy are measured separately throughout the game, and must both be kept high.</p>"},{"name":"Ooze, The","year":1995,"developer":"Sega Technical Institute","url":"d#Ooze%2C%20The%20%28Japan%2C%20USA%29.zip","filesize":531765,"score":6.3,"genres":"Action > Top-down > Puzzle elements","desc":"<p>The Ooze is quite a little known (and bizzarre) game that was released towards the end of the Genesis's lifecycle. The story goes that you are a scientist with an experiment that went wrong resulting in you turning into a puddle of green ooze. You are washed down the sink and must make your way back to the lab (by completing a series of puzzles, etc.) to stop your boss taking over the world.</p><p>The game is played from top-down perspective and you move around the level fighting enemies and solving puzzles. You can pick up more ooze and other items as you go which can help you get through each level.</p>"},{"name":"Operation Europe: Path to Victory 1939-45","year":1993,"developer":"KOEI Co., Ltd.","url":"d#Operation%20Europe%20-%20Path%20to%20Victory%201939-45%20%28USA%29.zip","filesize":610972,"score":6.6,"genres":"Simulation > Strategy > Top-down > Isometric > Africa > Europe > Historical events > World War II","desc":"<p>The game is an historical simulation of the European and North African theaters of World War II. The game allows up to two players to role-play as Army commanders for either the Axis or Allied forces. This game emphasizes the military aspects of the war and leaves diplomacy to the politicians.</p>"},{"name":"Osomatsu-kun: Hachamecha GekijÅ","year":1988,"developer":"SEGA Enterprises Ltd."},{"name":"Ottifants, The","year":1993,"developer":"Graftgold Ltd.","url":"d#The%20Ottifants%20%28U%29.zip","filesize":455757,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Bruno is a baby Ottifant. It's an ordinary evening, and Bruno's dad is working late at office. Reason enough for Bruno's vivid imagination to run riot, thinking that his dad has been kidnapped by aliens! Jelly babies, that fell from his father's pocket on the way to work, blaze a trail to the office. Now it's up to Bruno to fight his way through hordes of terrorizing toys, Ottifant-eating plants, tear through gloomy caverns of doom and cut across a perilous jungle - workaday objects and boringly normal settings as seen through kids' eyes - and rescue his dad!</p><p><em>The Ottifants</em> for the SEGA Game Gear is a 2D side-scrolling platformer where the player controls Bruno through five worlds: starting with the house and the basement, through to the building site, the office and finally the jungle, whereas each world is in turn divided into three stages. Bruno's primary weapon is his trunk, which gives him the ability to blast enemies by firing sweets at them, or suck in objects like out-of-reach platforms or boxes by holding down the Fire-button. Furthermore, yellow, green and red lollies are spread throughout the stages. Gathering three of them activate one of Bruno's special skills and can - depending on the colour combination - transform the baby Ottifant into Superfant with the ability to fly, boost his speed with Speedy Shoes, give an extra Continue and more. </p><p>Picking up jelly babies, blasting enemies and collecting papers gives points and raises Bruno's score up to a fixed value of 9,999 pts. There are several entrances to secret rooms hidden in the five worlds. But, unlike the Genesis-version, the rooms are quite small and basic and there is no 1,000 point reward by completing them. On the whole there are two different tunes backing your journey through the game: one for the stages and one for the boss enemies. The varied background music and sound effects of the Genesis-game are completely missing, as is one entire world: The Garden.</p>"},{"name":"Out of This World","year":1992,"developer":"Delphine Software International","url":"d#Out%20of%20This%20World%20%28USA%29.zip","filesize":516412,"score":7.6,"genres":"Action > Side view > Fixed / flip-screen > Platform > Puzzle elements > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>A young physics professor named Lester conducts a particle experiment. Suddenly, something goes wrong, lightning strikes, and in a moment Lester finds himself in a strange alien world. Now he must fight for his life, first with his bare hands, then with a gun he finds. But what gives him courage is that he is not alone. One of the aliens who escapes from the prison together with him helps him on his dangerous quest. Friendship can overcome all obstacles.</p><p><em>Out of This World</em> combines shooting, platforming, and puzzle-solving elements. The game is divided into stages; some of them are straightforward and can only be accessed one time, while others are connected to each other, constituting a larger environment. Exploration and problem-solving are emphasized. Many levels include challenges not seen in the previous ones. Tasks may involve environmental puzzles, timed sequences, precise jumping, and combat.</p><p>Typically, enemies are defeated by using an energy gun found in an early stage. The gun's regular function is shooting energy projectiles. By pressing down and holding the fire button the player can activate an energy shield that protects Lester from regular attacks, allowing him to fire from relative safety until it evaporates. Finally, by holding the fire button even longer the gun creates powerful blasts which can disrupt shields. Most enemies are equipped with similar guns and are able to perform the same actions as Lester. Fighting enemies, therefore, requires tactical usage of regular attacks, shields, and bombs, as well as learning enemy patterns.</p><p>Each level can be accessed by typing a code the player learns after having completed the level. If Lester dies, the level must be restarted. There is no on-screen interface and no in-game dialogue in the game. Vector graphics are used for creating the game's environments and animated cutscenes.</p>"},{"name":"Outback Joey","year":1993,"developer":"Western Technologies Inc."},{"name":"Outlander","year":1992,"developer":"Mindscape International Ltd.","url":"d#Outlander%20%28USA%29.zip","filesize":421652,"score":6.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Side view > 2D scrolling > Automobile > Post-apocalyptic","desc":"<p>The game's setting and style closely resemble the movie <em>The Road Warrior</em> (\"Mad Max 2\"). Your objective is to drive your car through the wasteland, trying to survive motorcycle gang members' attacks and to avoid running out of gas.</p><p>The gameplay is a split of two genres: racing and side-scrolling. In the racing parts you have to destroy enemies like motorcycle gang members, gyro-copter captains, red trucks, etc. Your car has a machine-gun installed in its front, and if some guy drives along side of you, a little window pops up, allowing you to shoot them with your shotgun.</p><p>Along the road there are several towns, and every time you pass through one of them, an alarm will warn you. As your gas run low, you have to stop on these towns and refuel your reserves of gas and ammo. When doing so, the game turns to a side-scrolling perspective, as you get out of your car, dealing with your enemies in hand-to-hand combats. In the cities you'll also find new equipment to your car, such as missile launchers, nitro, etc.</p>"},{"name":"OutRun","year":1991,"developer":"SEGA-AM2 Co., LTD.","url":"d#OutRun%20%28USA%2C%20Europe%29.zip","filesize":513081,"score":7.4,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing","desc":"<p><em>OutRun</em> is a racing game that allows the player to race across varied terrain in a readily available Ferrari, complete with a female passenger, over a series of short tracks.</p><p>Gameplay is viewed from just above and behind the car. The roads are full of sharp bends and hazards, contact with which can cause the car to roll and lose the player's time. On each section of track there is a fork in the road, allowing the player to choose which direction he or she wishes to go in. The player has to to complete five track sections in total, out of the fifteen in the game.</p>"},{"name":"OutRun 2019","year":1993,"developer":"Hertz Co. Ltd"},{"name":"OutRunners","year":1994,"developer":"SEGA Enterprises Ltd.","url":"d#OutRunners%20%28USA%29.zip","filesize":1055480,"score":5.9,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing","desc":"<p><em>OutRunners</em> is a sequel to the classic arcade racer OutRun. It puts you behind the wheel of 8 different race cars with the aim being coming up first on a world-wide cross-country racing tournament.</p><p>As mentioned you get to select from 8 differently tuned cars, each with different handling and speed specs. and then ride out in hopes of getting the trophy. At the end of each stage you get to select between different branching routes that determine what your next stage will be, and thus the different routes you take to the end game determine what ending you get (if you manage to beat the other players).</p><p>OutRunners places a big emphasis on competitive gameplay as you are always racing against another car, be it an AI or human-controlled one in a perpetual split-screen multiplayer mode.</p>"}]