[{"name":"P.T.O.: Pacific Theater of Operations","year":1992,"developer":"KOEI Co., Ltd.","url":"d#P.T.O.%20-%20Pacific%20Theater%20of%20Operations%20%28USA%29.zip","filesize":506211,"score":7.5,"genres":"Educational > Strategy > Managerial / business simulation > Geography > History > Naval / watercraft > Historical events > World War II","desc":"<p><em>P.T.O.</em> is another military sim from KOEI. In this game you can choose to be either Japan or the Allies. By managing your fleets and ordering new warships you can control many different sides of the conflict (Ship development, Base defense, Fleet arrangement, Direct battle control, Economic decisions). There are many different options of play in PTO, you can choose to play from one of many different famous battles or you can play the campaign. You can control one side or both. There are also limited controls on victory conditions.</p>"},{"name":"Pac-Attack","year":1993,"developer":"Namco Limited","url":"d#Pac-Attack%20%28USA%29.zip","filesize":156343,"score":7.1,"genres":"Puzzle > Side view > Fixed / flip-screen > Falling block puzzle","desc":"<p>Based on Namco's Japanese-only arcade puzzler Cosmo Gang the Puzzle, <em>Pac-Attack</em> is similar to many block-dropping puzzle games from the time, such as Puyo Puyo.</p><p>The objective of the game is to place ghosts and then, after three pieces (which can include one or two blocks as well), make Pac-Man eat as many ghosts as possible to try and clear up the game area. Pac-Man's directions are chosen at random between left or right, but as he goes moving on the game area (after you place him, of course), if he bumps against a block or a \"wall\" on the game area, he will change his direction. As with many block-dropping puzzlers, if a line of blocks and/or ghosts reaches the top, the game ends. However, by filling up a meter on the left of the game area, a fairy may appear that can clear approximately 6 or 7 lines with ghosts, but it only clears the ghosts, although the blocks that were on top of them will drop.</p><p>Also, like many puzzlers, it contains a versus mode against another human player. It's similar to the many versus modes of puzzle games: eat plenty of ghosts and your opponent will recieve many ghosts on his area.</p><p>The game also includes a Puzzle mode. It features 100 levels, in which you have to eat all ghosts with no more than 4 Pac-Men at least (the number reduces in certain levels), and, unlike the other modes, you can change Pac-Man's direction with the press of a button.</p><p>All of the handheld versions (including the one on Pac-Man Collection) lack the versus mode.</p>"},{"name":"Pac-Man 2: The New Adventures","year":1994,"developer":"Namco Limited","url":"d#Pac-Man%202%20-%20The%20New%20Adventures%20%28USA%29.zip","filesize":1049709,"score":6.3,"genres":"Action > Adventure > Side view > 2D scrolling > Puzzle elements > Point and select > Fantasy","desc":"<p>Join Pac-Man in a side scrolling adventure where you must guide him through Pac-Land, solving puzzles and finding objects in order to defeat the evil Ghost Witch of Nentor. You don't control Pac-Man himself, as you must show him where to go and what to look for, while using the slingshot to knock over and find items or open doors and defeat bad guys before Pac-Man bumps into them. You can collect items you find along the paths from Pac-Man's house in the inventory and use them for a later day.</p>"},{"name":"Pac-Mania","year":1991,"developer":"Namco Limited","url":"d#Pac-Mania%20%28USA%2C%20Europe%29.zip","filesize":74762,"score":7.4,"genres":"Action > Diagonal-down > Isometric > Arcade","desc":"<p><em>Pac-Mania</em> is a variation on the game Pac-Man. You need to guide Pac-Man around a maze and eat all of the dots on the board to proceed on to the next round. Numerous, multi-colored ghosts also roam the maze trying to stop you. If you eat one of the power pellets in the maze, the ghosts will temporarily turn blue and run from you. Pac-Man can earn bonus points by eating the ghosts when they are in this state. The maze is now shown in isometric perspective and is larger than the screen which will scroll to follow the action. To help get out of tight spots, Pac-Man can now jump. But be careful, because some of the ghosts have learned this trick as well and you could end up in a mid-air collision!</p>"},{"name":"Pachinko Kuunyan","year":1992,"developer":"I.S.C. Co., Ltd."},{"name":"Paddle Fighter","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Pagemaster, The","year":1994,"developer":"Probe Entertainment Ltd.","url":"d#Pagemaster%2C%20The%20%28USA%29.zip","filesize":1203353,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Pagemaster</em> was released in conjunction with the Macaulay Culkin part action/part cartoon feature film released in 1994. Guide your character through a selection of levels based around themed books, ranging from Horror to Adventure and Fantasy worlds. You can use magic and stomp enemies to death by jumping on their head. Enemies include bats, flying books, giant hands, ghosts, pirates and many more.</p>"},{"name":"Panorama Cotton","year":1994,"developer":"Success Corp.","url":"d#Panorama%20Cotton%20%28USA%29.zip","filesize":1328190,"score":7.2,"genres":"Action > Behind view > Anime / Manga > Arcade > Shooter > Fantasy","desc":"<p>The fairy kingdom has long been threatened by the dark witch Wool, the leader of the Dark Undulation. The queen Velvet sent the cute little fairy Silk to seek aid by the red-haired witch Cotton, the only one who could defeat Wool. Cotton agrees under one condition: she will receive some willows as a reward, since willows are her favorite food. Finally, after defeating Wool, Cotton realized that someone poisoned the promised willows, and swears revenge. Accompanied by Silk, she begins to chase the mysterious enemy.</p><p><em>Panorama Cotton</em> is a pseudo-3D scrolling shooter reminiscent of  Space Harrier, set in an anime-style fantasy world. Various levels scroll \"into the screen\", vertically, horizontally, or diagonally. The player can move Cotton over the screen, shooting at oncoming enemies and avoiding obstacles on her way. Cotton can upgrade her weapon to higher levels as the player advances in the game, and can also cast magical spells by collecting special items.</p>"},{"name":"Paperboy","year":1991,"developer":"Atari, Inc.","url":"d#Paperboy%20%28USA%2C%20Europe%29.zip","filesize":247552,"score":6.8,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Arcade > Bike / Bicycling","desc":"<p>The object of <em>Paperboy</em> is to deliver papers to your customers while inflicting as much damage as possible to the houses of your non-customers. To make things more difficult, numerous obstacles get in your way including construction workers, rogue tires, skateboarders, dogs and cats, cars, and even the occasional tornado.</p>"},{"name":"Paperboy 2","year":1992,"developer":"Tengen Inc.","url":"d#Paperboy%202%20%28USA%2C%20Europe%29.zip","filesize":451819,"score":6.1,"genres":"Action > Diagonal-down > Isometric > Bike / Bicycling","desc":"<p>You're a paper boy. Get on your bicycle. Avoid obstacles on the road, such as dogs, cars, and basically everything you can imagine. Hell, some people shoot cannon balls at you! And you'd better be very sure to only throw papers at the right houses! (and at people, that's fun :)</p>"},{"name":"Party Quiz: Mega Q","year":1993,"developer":"Minato Giken"},{"name":"Pat Riley Basketball","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Pat%20Riley%20Basketball%20%28USA%29.zip","filesize":193864,"score":6.8,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>This basketball game uses a scrolling court-side view to recreate the game, with 8 teams representing major US cities.These can play in Exhibition and Tournament matches, with a 2-player mode and 3 skill levels. Before each match you can choose between zonal and man-to-man marking, and this can be changed after each quarter, or during a time out. Physical contact  fouls is impossible although 'traveling' is called. Tip-offs and Slam-Dunk attempts switch to a 3D close-up view, and are controlled by hammering the B button as hard as possible - on occasion you can get defense players in to block an attempted dunk.</p>"},{"name":"Pebble Beach Golf Links","year":1993,"developer":"T&E Soft, Inc.","url":"d#Pebble%20Beach%20Golf%20Links%20%28USA%29.zip","filesize":656144,"score":7.6,"genres":"Sports > Behind view > Golf","desc":"<p>Players take on the challenge of one of the most beautiful and notorious golf courses in the world: Pebble Beach. These eighteen-holes demand accuracy, finesse, and even at times brute strength. The famous beach-side course is littered with sand-bunkers as well as sweeping fairways and cliff-side greens. </p><p>Game play takes a classic approach - players control a selected golfer from a third-person perspective. Swing-control is displayed as a power and accuracy meter with which players must start and stop accordingly. Again, the classic-style putting system, complete with a topographic grid, lets the player know of the slope and elevation of the three-dimensional putting surface.</p><p>As there are no other courses to play, this game is a tribute and testament to the challenging course-design of Pebble Beach Golf Links.</p>"},{"name":"Pelé II: World Tournament Soccer","year":1994,"developer":"Radical Entertainment Inc.","url":"d#Pele%20II%20-%20World%20Tournament%20Soccer%20%28USA%2C%20Europe%29.zip","filesize":731577,"score":"","genres":"Action > Sports > Diagonal-down > Isometric > Football (European) / Soccer > Licensed","desc":"<p>Edson Arantes do Nascimento, commonly known to us as football legend Pelé, licensed a second football game, featuring the 24 qualifiers for the 1994 World Cup, each with summaries and tactical advice from Pelé. These can play in either friendly matches or the full tournament. A five-a-side mode is included, taking place on a full-sized field.</p><p>The view is isometric, although playing bottom-right to top-left, the opposite of FIFA International Soccer. Weather effects are optional, matches can be between 5 and 45 minutes (in 5-minute increments), and penalty shoot-outs are optional. A full range of formations are available, as well as squads of 22 fictitious players.</p>"},{"name":"Pelé!","year":1993,"developer":"Radical Entertainment Inc.","url":"d#Pele%21%20%28USA%2C%20Europe%29.zip","filesize":568011,"score":5.7,"genres":"Simulation > Sports > Isometric > Football (European) / Soccer > Licensed","desc":"<p><em>Pelé!</em> is a soccer game that lets the player take control of soccer legend Edson Arantes do Nascimento (better known as Pelé, the games namesake). There are forty different international teams to choose from and the game has a two separate single player modes. In <em>Practice</em> the player chooses the teams and learns the basic fundamentals of the game. In <em>Season</em>, the player competes in an 18 game season in order to compete for the championship.</p><p>There is also a two-player mode, but with a different set-up than other soccer games. Instead of letting two-players face each other, they must instead play a tournament in a series of one-player matches in order for their teams to face off. The game features realistic rules and regulations and genuine animations including bicycle kicks, headers, traps and dives and features a competitive artificial intelligence unique to each team.</p>"},{"name":"Pepenga Pengo","year":1995,"developer":"JSH Co., Ltd.","url":"8#Sega%20-%20Genesis.zip/Pepenga%20Pengo%20%28Japan%29.zip","filesize":1,"score":"","genres":"Action > Top-down > Arcade > Puzzle elements > Direct control","desc":"<p>The Sno-Bees are back! One day in Antarctica, an asteroid crashes into the crystal that protects the penguins, shattering it into many pieces and freeing the Sno-Bees who had been frozen in ice. In order to rescue his people, the blue penguin (along with a pink penguin in two-player mode) goes after the Sno-Bees and to recover the missing pieces of the crystal. The game takes the basic template of the 1982 original and expands on it, offering a greater variety of enemies, various environmental hazards, and power-ups, along with of course updated 16-bit graphics and sound. The goal is still to push blocks and crush enemies. Enemies now appear from generators, which must be destroyed to stop new enemies from appearing, and all enemies must then be eliminated to complete each stage.</p><p>In addition to the main story mode, the game also features a competitive battle mode for up to four players, as well as a conversion of the original arcade game.</p>"},{"name":"Pete Sampras Tennis","year":1994,"developer":"The Codemasters Software Company Limited","url":"d#Pete%20Sampras%20Tennis%20%28USA%2C%20Europe%29%20%28Rev%202%29%20%28MDSTEE13%29.zip","filesize":654385,"score":7.6,"genres":"Sports > Behind view > Tennis > Licensed","desc":"<p>Play singles and doubles exhibition games, knockout tournaments or go on a world tour, it's all here in this tennis sim. You can choose to play as the (then) world seed 1, Pete Sampras himself or choose from 29 other players. </p><p>The action is viewed from the traditional third-person viewpoint. A tutorial mode is provided to help you get used to the forehand, lob and drop shots on offer. Several venues from all over the world can be played on, on Hard, Grass and Clay courts.</p><p>This was the first and one of the very few Genesis games to be released with a J-Cart, which meant that four-way gameplay was possible without the need of special adapters – the cartridge had two built-in joypad connectors. The Game Gear version was equally inventive, allowing two players to share one Game Gear, or four players to play doubles by linking two machines.</p>"},{"name":"PGA European Tour","year":1994,"developer":"Halestorm, Inc.","url":"d#PGA%20European%20Tour%20%28USA%2C%20Europe%29.zip","filesize":635444,"score":7.4,"genres":"Simulation > Sports > 3rd-person (Other) > Golf > Licensed","desc":"<p>European Tour is best thought of as a remake of the original game, rather than a sequel as such. It features 5 courses from across Europe, and 60 top European pros, rather than the US-leaned lineup of the original. The graphics are much more detailed and colorful, as you'd expect considering the intervening years of advances in programming skills.</p><p>The control system is the standard three-click method used in most golf games, but you can now define intended draw/fade levels in advance of playing the shot, so that a perfect aim leads to a measured effect, and an imperfect one exaggerating the effect.</p><p>As well as the Stroke Play games of the original (where you count the total score across the whole round of 18 holes and compare this to your opponent), there are also Match Play (where the aim is to win as many individual holes as possible) and Skins (the same, but with money) modes as well.</p>"},{"name":"PGA Tour 96","year":1995,"developer":"Hitmen Productions","url":"d#PGA%20Tour%2096%20%28USA%2C%20Europe%29.zip","filesize":1160445,"score":7.9,"genres":"Sports > Behind view > Direct control > Golf > Licensed","desc":"<p><em>PGA Tour 96</em> was the last of the series released for Sega's 16-bit console, and technologically the most advanced one. Instead of offering several generic courses, the three available (Spyglass Hill, Sawgrass and River Highlands) are in 3D, with height differences visible (as well as the limited 3D abilities of the console allow).</p><p>The player can either chose to play as one of the 10 PGA Pros (whose swings were digitized), or go Pro - the game keeps track of statistics (longest drive, driving accuracy, best round, etc), a game (Tournament, Strokeplay, Skins, Match and Shootout), as well as a replay.</p><p>Gameplaywise, PGA 96 uses the tried-and-proved triple click system - one to start the swing, other to set strength and a final one for accuracy. It's possible to fade or draw the ball (to bend the trajectory), add backspin and pitch or chip the ball (for some medium range attempts at the hole or go above a bush).The difficulty level affects mostly the leniency of the triple click hit areas - while at novice it is possible to let the accuracy a bit off-center, in pro levels the ball goes where your swing took it - no excuses taken. However, only in Pro it is possible to make the longest drives, as the amateur and novice levels take a few yards from the total capacity of the club.</p>"},{"name":"PGA Tour Golf","year":1991,"developer":"Sterling Silver Software","url":"d#PGA%20Tour%20Golf%20%28USA%2C%20Europe%29%20%28PGA07%29.zip","filesize":347799,"score":7.9,"genres":"Sports > Behind view > Golf > Licensed","desc":"<p><em>PGA Tour Golf</em> introduced many of the conventions commonly seen in the genre since. The three-click control method (the first to start the swing, the second setting power and over-swing, the third setting draw or fade) allowed for a multitude of different shots, and required a sense of timing. </p><p>Four courses are included, one of them a fantasy 'links' course designed by the programmers. Some of the holes are fiendish, with bunkers, water hazards and trees, and the need to plan strategies to get the best approach to the green.</p><p>When playing a tournament there are 60 opponents, each representing top US golfers - ten of these appear in the game, with one providing tactical advice for each hole.</p>"},{"name":"PGA Tour Golf II","year":1992,"developer":"Polygames","url":"d#PGA%20Tour%20Golf%20II%20%28USA%2C%20Europe%29.zip","filesize":667715,"score":7.6,"genres":"Sports > Behind view > Golf > Licensed","desc":"<p>The sequel to PGA Tour, this game was released solely for the Sega Genesis / Mega Drive along with an alternative version for the Game Gear, as was getting more common for EA sports titles at the time, helping to drive the sales of the 2nd choice console.</p><p>This update sees the series add ten professional players to the roster (60 in total) and have the ability to play against them on seven courses and across five tournaments. There is also a new graphics engine in place and new sounds to boot. Statistics became more detailed and the ball physics were improved through a Draw and Fade meter. Game data can be backed up through the built-in battery. Other features include different ball lies, dynamic wind conditions, digitized sounds, an improved automatic caddy and special shots such as chips, punches and fringe putts.</p>"},{"name":"PGA Tour Golf III","year":1994,"developer":"High Score Entertainment","url":"d#PGA%20Tour%20Golf%20III%20%28USA%2C%20Europe%29.zip","filesize":1566705,"score":8.2,"genres":"Simulation > Sports > Behind view > Golf > Licensed","desc":"<p>The team at Polygames make some small improvements to the series in <em>PGA Tour Golf III</em>. It has a US setting in terms of the courses and players, unlike PGA European Tour, with 8 licensed courses in total: Avenel, Las Colinas, River Highlands, Sawgrass, Scottsdale, Southwind, Summerlin and The Woodlands. Gameplay modes include three different practice options (driving range, putting green, and a full round) as well as a tournament, skins challenge, match play, and shoot-out.</p><p>Gameplay follows the standard model with swings made from of a view behind the golfer, with the customary three-click method (start, power, accuracy). Before taking a shot, the club choice, direction and intended draw/fade (spin on the ball) are selected. The game features instant replays and user-created players, stats and tournaments saved to battery-backed RAM. Only the Genesis version has course flybys with tips from PGA pros and switches to a different camera view for the ball's landing.</p>"},{"name":"Phantasy Star","year":1994,"developer":"SEGA Enterprises Ltd."},{"name":"Phantasy Star II","year":1989,"developer":"SEGA Enterprises Ltd.","url":"d#Phantasy%20Star%20II%20%28USA%2C%20Europe%29.zip","filesize":473038,"score":7.7,"genres":"Role-playing (RPG) > Behind view > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Direct control > Menu structures > Sci-fi / futuristic","desc":"<p>A millennium has passed since Alis defeated the ultimate evil in the  first Phantasy Star. The planet Motavia of the Algol solar system is no longer the antlion-plagued desert: humans have constructed a sentient computer called \"Mother Brain\", which could regulate the climate of the planet, turning it into a thriving utopia. One night, a young Motavian government agent named Rolf awakens in his bed after having a nightmare. He sees a young girl fighting a demon, but he is unable to help her. Shortly afterwards, he learns that dangerous bio-monsters have broken free from the laboratories, and is sent there to retrieve a recorder that might contain valuable information about the terrible incident...</p><p>Like its predecessor, the game is a party-based Japanese RPG with randomly appearing enemies and turn-based combat. Eight characters can join the quest and can be swapped at will to participate in a combat party of four. Characters can equip a wide variety of weapons, including firearms; dual wielding is also possible. Various techniques which require \"TP\" (technique points, equivalent to magic points in comparable games) are learned by different characters at specific levels. Unlike the first game, <em>Phantasy Star II</em> utilizes the same top-down view for both navigation and dungeon exploration; the now-2D dungeons are notable for their complexity.</p>"},{"name":"Phantasy Star II Text Adventure: Amia no Bōken","year":1990,"developer":"SEGA Enterprises Ltd."},{"name":"Phantasy Star II Text Adventure: Anne no Bōken","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Phantasy Star II Text Adventure: Eusis no Bōken","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Phantasy Star II Text Adventure: Huey no Bōken","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Phantasy Star II Text Adventure: Kinds no Bōken","year":1990,"developer":"SEGA Enterprises Ltd."},{"name":"Phantasy Star II Text Adventure: Nei no Bōken","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Phantasy Star II Text Adventure: Rudger no Bōken","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Phantasy Star II Text Adventure: Shilka no Bōken","year":1990,"developer":"SEGA Enterprises Ltd."},{"name":"Phantasy Star III: Generations of Doom","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Phantasy%20Star%20III%20-%20Generations%20of%20Doom%20%28USA%2C%20Europe%2C%20Korea%29.zip","filesize":451357,"score":7.2,"genres":"Role-playing (RPG) > 1st-person > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Direct control > Menu structures > Fantasy","desc":"<p>Long time ago, a great war between Orakio and Laya devastated the planet. A thousand years later, a young Orakian prince named Rhys decides to marry the beautiful Maya, his heart's chosen one. But during the marriage ceremony, a strange creature appears and kidnaps the bride. Were those the legendary Layans who kidnapped the princess? Whatever the answer might be, Rhys has to find it out on his own - he must rescue his beloved one.</p><p>The gameplay system of <em>Phantasy Star III: Generations of Doom</em> is similar to that of its predecessor in the series: the player navigates a party of characters on a top-down overworld, visiting towns, exploring 2D dungeons, and fighting randomly appearing enemies in turn-based combat. The most noticeable change in this installment is applied to the setting. Unlike all other <em>Phantasy Star</em> games, it is initially set in a medieval fantasy environment devoid of the series' characteristic sci-fi elements. Gameplay-wise, this influences the usage of techniques, which are restricted to characters with a sci-fi civilization background who later join the party.</p><p>An unusual feature of the game is its generation system. The game's story spans three generations of characters, beginning with Rhys and ending with his grandchildren. Specific instances of the plot prompt the player to choose between two young women for Rhys to marry. Depending on this choice, the player will control different main characters during the second generation. Later, a similar choice is offered to both possible children of Rhys, splitting the subsequent story into four branches.</p>"},{"name":"Phantasy Star IV","year":1993,"developer":"Sega AM7 R&D Division","url":"d#Phantasy%20Star%20IV%20%28USA%29.zip","filesize":2389131,"score":7.9,"genres":"Role-playing (RPG) > Behind view > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Direct control > Menu structures > Sci-fi / futuristic","desc":"<p>The Algol star system is in troubled times. Many thousands of years ago, it was a peaceful world. Three planets surrounded the Algol star and were in perfect harmony: Palma, a lush green planet, where its citizens devoted their lives to arts and the sciences; Motavia, a desert planet, inhabited by humans and native Motavians; and the enigmatic Dezolis, a harsh ice planet, where the citizens were just as unknown as the planet itself. Unfortunately, the harmony and balance was not to last. Palma had exploded, and with it, ninety per cent of Algol's population died. Motavia had fallen into horrible conditions from the explosion, turning almost into a total wasteland. The Darkness spread its hand over the land.</p><p>A thousand years have passed. Motavia has healed somewhat, and life is beginning to return to the way it once was many years ago. The Hunter's Guild on Motavia helps to keep things steady. But a dark evil once thought to be long dead is beginning to stir once again, and the young hunter, Chaz, is about to begin his ultimate adventure - which starts with one simple routine assignment...</p><p><em>Phantasy Star IV</em> is a Japanese-style role-playing game with top-down world map exploration, random enemy encounters, and turn-based combat. The gameplay of the fourth entry in the series is similar to that of the  second installment, sharing notable features such as the ability to equip two weapons at once, most of the \"techniques\" (equivalent to magic spells in comparable games), etc. The dungeons are noticeably less maze-like than in <em>Phantasy Star II</em>. Player-controlled party may include up to five active combatants. </p><p>As before, leveling up and technique-learning is automatic, save for android characters, whose abilities are found in treasure chests in the dungeons. Androids also cannot be healed by conventional means and use their own item sets. Beside regular attacks and techs, characters also possess unique attacks that have limited uses and can be replenished after the character rests. Characters can also execute combination attacks, merging two or more techs or special attacks. The player may opt to assign macro command sets for the party instead of inputting commands manually.</p><p>There are a few segments in the game with vehicle combat, which mostly follows the same turn-based formula as the regular battles. Side quests are present in form of hunter assignments for Chaz and his friends. A \"party talk\" feature is available, displaying conversations between player-controlled characters. The game uses manga-style comic book panels as cutscenes.</p>"},{"name":"Phantom 2040","year":1995,"developer":"Viacom New Media","url":"d#Phantom%202040%20%28USA%29.zip","filesize":1145484,"score":7.3,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Sci-fi / futuristic > Licensed","desc":"<p>The cartoon mini-series: <em>Phantom 2040</em>, right here. It is the aforementioned year, 2040, and the city of Metropia is in total chaos. </p><p>Crime, smuggling and terrorism are escalating. The debase company, Maximum Inc., has invented biotechnology that is threatening to mess about with nature - causing animal extinction and ecosystem adulteration. Evil company owner, Rebicca Madison, would like to rule Metropia and the world.</p><p>In comes Kit Walker, the 24th Phantom, following the proud but secret footsteps of his ancestors. This 18 year old has to fight his way to get things right, or end trying.</p><p>The game has many twist and turns in its plot, and a multitude of endings.</p>"},{"name":"Phelios","year":1990,"developer":"Namco Limited","url":"d#Phelios%20%28USA%29.zip","filesize":259692,"score":7.4,"genres":"Action > Top-down > 2D scrolling > Anime / Manga > Shooter > Classical antiquity > Fantasy","desc":"<p>Set in the world of Greek mythology, <em>Phelios</em> tells the story of a young prince called Apollo, who sets out to rescue his beloved Artemis who was seized by the demon Typhon while exploring the skies with the winged horse, Pegasus. In Typhon's temple, Artemis gets locked in a dungeon where Medusa turns her into stone.</p><p><em>Phelios</em> consists of seven chapters, and in each, you must defeat Typhon's minions using your sword which can emit fireballs at them. However, holding the fire button down for a few seconds will charge the sword; and upon releasing it, it shoots a larger fireball that does a fair amount of damage. During the game, you collect items that increases your speed and give you more firepower.</p><p>At the end of each chapter, you have to destroy a boss in order to proceed to the next one. Between each chapter, you can watch an intermission that details what is happening at the temple.</p>"},{"name":"Pier Solar and the Great Architects","year":2010,"developer":"WaterMelon Co.","url":"d#Pier%20Solar%20and%20the%20Great%20Architects%20%28World%29%20%28En%2CFr%2CEs%29%20%28Unl%29.zip","filesize":4200417,"score":7.5,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>The story of Pier Solar tells about Hoston, a young botanist who is on a quest to save his father from a mysterious illness. He hears of rumours that a cure to his father's disease can probably be found in the nearest forest, and Hoston, disregarding his mother's warnings, sets out to find the cure.</p><p>The game is a classical console-RPG with round-based battles, similar to the  Phantasy Star series on the same system.</p><p>In addition to a cartridge, the game also makes use of the Sega Mega CD, if available, by playing music and effects from an included soundtrack CD.</p>"},{"name":"Pink Goes to Hollywood","year":1993,"developer":"HeadGames, Inc.","url":"d#Pink%20Goes%20to%20Hollywood%20%28USA%2C%20Europe%29.zip","filesize":630871,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Pink Panther is on his way to Hollywood to audition for an important role. Chased by his nemesis Inspector Clouseau, he flees into the MGM Studios. From the main entrance, you can enter different movie sets with distinct areas such as graveyards, manors or the jungle. Using a side-scrolling view, Pink Panther can jump, duck, run, climb and use a boxing glove to knock out enemies. Additionally, there are special tricks and props such as magic carpets, umbrellas and stairs to reach higher regions. Items such as stoplights, jackhammers, bowling balls, shields and supergloves give an advantage in the battles.</p>"},{"name":"Pinocchio","year":1995,"developer":"NMS Software Ltd.","url":"d#Pinocchio%20%28USA%29.zip","filesize":1451672,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Journey through as Geppetto, the carpenter's live wooden puppet, Pinocchio, as he did in his Disney animated film - which itself was based on a children's novel.</p><p>Have Pinocchio run, jump and twist-kick through all the familiar places, including the inside of a whale, and do good deeds enough to become the real human boy he's always wanted to be.</p><p>A standard Disney platformer.</p>"},{"name":"Pirates of Dark Water, The","year":1994,"developer":"Iguana Entertainment Incorporated","url":"d#Pirates%20of%20Dark%20Water%2C%20The%20%28USA%29.zip","filesize":1191898,"score":7,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Dark Water is slowly taking over the world of Mer. With his last words, King Primus tells his son, Prince Ren, that he has to find the lost Treasures of Rule to stop the Dark Water. Ren travels to the town of Janda where he meets the monkeybird Niddler, the female warrior Tula and the ex-pirate Ioz, who help him on his quest.</p><p>Based on the cartoon by the same name, <em>The Pirates of Dark Water</em> is a side scrolling hack'n slash platformer with a few adventure elements.</p><p>You take control of either Ren, Ioz or Tula who can jump, climb, attack and throw enemies. In most levels you are required to find keys to unlock doors and talk to NPCs who will give you hints. You will also find numerous useful items including throwing weapons, food to replenish your health, potions that have different effects such as temporary invincibility, money that is needed to pay certain NPCs and melons that can be fed to Niddler who will take you back to the map screen in turn.</p>"},{"name":"Pirates! Gold","year":1993,"developer":"MPS Labs","url":"d#Pirates%21%20Gold%20%28USA%29.zip","filesize":727224,"score":7.7,"genres":"Action > Strategy > Top-down > Real-time > Naval / watercraft > Vehicular combat > Sea pirates / Caribbean","desc":"<p>As with the original, this is a blend of strategy, action and adventure. <em>Pirates! Gold</em> lets you play the role of a beginning buccaneer in the 17th century Spanish Main, in search of fame and fortune. Each town in this untamed raw region has different surprises and dangers. </p><p>How you acquire stature is up to you; you can make your living through honest trade and the search for hidden treasure, or you can be a little more daring and attack and plunder ships. As you can choose a specific skill to stand out in, the game can vary each time. Sword fighting is played out in side-view action sequences.</p>"},{"name":"Pit-Fighter","year":1991,"developer":"Atari Games Corporation","url":"d#Pit-Fighter%20%28World%29%20%28En%2CJa%29.zip","filesize":644977,"score":5.3,"genres":"Action > Side view > Arcade > Fighting","desc":"<p><em>Pit-Fighter</em> is a 3rd-person fight game that features digitized graphics of real fighters and zooming effects. Players select one of three fighters (Buzz, Ty or Kato) to take on anyone who dares. At the conclusion of a match, players are individually awarded a Knockout Bonus, Brutality Bonus, and a Fight Purse. Every third match is a Grudge Match where players test the skills of each other. The last man standing is the winner of this three-knockdown match. Players fight their way to the Elimination Match to decide who wins the opportunity to dethrone the champion, the Masked Warrior.</p>"},{"name":"Pitfall: The Mayan Adventure","year":1994,"developer":"Activision, Inc.","url":"d#Pitfall%20-%20The%20Mayan%20Adventure%20%28USA%29.zip","filesize":1346875,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Pitfall: The Mayan Adventure</em> is a side-scrolling action game in which you play adventurer Pitfall Harry Jr in search of his father Pitfall Harry. You battle your way through the Mayan jungles, waterfalls, deserted mines and can bungee jump and boomerang your way to safety. There are 13 levels and the action is fast and gripping. You will need to be attentive—and quick. Or prepare to die.</p>"},{"name":"Populous","year":1990,"developer":"Bullfrog Productions, Ltd.","url":"d#Populous%20%28USA%29%20%28Unl%29.zip","filesize":184244,"score":7.7,"genres":"Strategy > Diagonal-down > Isometric > Real-time > Managerial / business simulation > Real-time strategy","desc":"<p>You play a god, gaming against other gods in a celestial game of conquest. To win, you must help your chosen people take over the world and wipe out the vermin who worship that other god.</p><p>Each god starts out with a single human, dumped into the middle of the wilderness. Sometimes there is inhabitable land in sight, sometimes not. To get a chance to win, you must change the landscape, creating flat land for your followers to build on. The more followers you have, the more powerful you will be, so take care of them. Build as fast as you can, because the other god is doing the same.</p><p>When you have enough followers, you can make the leader of your people into a hero. He will then go around the land you have built, literally taking strength from the people into himself, and working his way toward the enemy. When he gets there, he will engage in holy warfare upon your enemy's people. He will burn; he will kill.  And he won't stop until they're all dead... or he is.</p><p>But you don't have to let your people have all the fun; the gods have other tools as well. You can drown your enemies one at a time with your land-lowering powers, submerge their towns in swamps, or raise a volcano in the middle of their best farmland. Even better, you can flood the land and drain all the people who didn't build on high ground. </p><p>And when you win, you'll have 500 more worlds to conquer. A god's play is just never done.</p>"},{"name":"Power Drive","year":1994,"developer":"Rage Software Ltd.","url":"d#Power%20Drive%20%28U%29.zip","filesize":678711,"score":6.6,"genres":"Racing / Driving > Diagonal-down > 2D scrolling > Off-roading > Track racing","desc":"<p><em>Power Drive</em> is an arcade racing game based around rally driving. Handbrake turns and lurid powerslides are both possible, and the steering is suitably loose.</p><p>There are 3 types of stages - individual time-trials, head-to-head races against the computer, and some skill tests. There are 8 rounds of gameplay, set across countries ranging from Sweden to Kenya. The player gets prize money for winning races, and it costs money to repair damage.</p>"},{"name":"Power Instinct","year":1994,"developer":"Atlus Co., Ltd."},{"name":"Powerball","year":1991,"developer":"Namco Limited","url":"d#Powerball%20%28USA%29.zip","filesize":308677,"score":6.6,"genres":"Sports > Top-down > Football (American) > Football (European) / Soccer > Rugby > Sci-fi / futuristic","desc":"<p>In this game you take on the role of 1 out of 8 teams who represent various nations trying to become the Powerball champions. Powerball is a game consisting of a hybrid of sports such as American football, soccer and rugby. You play on an 100 yard field trying to score on the opposing team. Scoring consists of either running into your opponent's end zone holding the powerball for a touchdown or kicking the ball into your opponent's net to score a goal.  Goals are worth 1 point, and touchdowns are worth 3 points. The game modes are 1 or 2 player exhibition play, and 1 or 2 player league play. League play allows you to use bonus points, and distribute them to your teammates to improve their statistics.</p>"},{"name":"PowerMonger","year":1992,"developer":"Bullfrog Productions, Ltd.","url":"d#Power%20Monger%20%28USA%2C%20Europe%29.zip","filesize":325379,"score":7.7,"genres":"Strategy > Diagonal-down > Real-time > Real-time strategy > Fantasy","desc":"<p><em>PowerMonger</em> takes the basic design and concepts of Bullfrog's previous game Populous, and places it in a war context. The game cast the player as a dispossessed warlord plundering his way through 195 territories on the way to world conquest. Several other leaders have the same goal.</p><p>The gameworld is now made up of polygons, so the view can be rotated and moved with greater freedom than Populous. Trade, diplomacy, inventions, and scorched earth invasions all play a key role in how the player progresses through the game. Two-player games via modem links are available on computer versions.</p>"},{"name":"Predator 2","year":1992,"developer":"Perfect 10 Productions","url":"d#Predator%202%20%28USA%2C%20Europe%29.zip","filesize":492326,"score":6.7,"genres":"Action > Diagonal-down > Isometric > Arcade > Sci-fi / futuristic > Licensed","desc":"<p>Players guide Lt. Mike Harrigan as he tracks the Predator through seven levels based on the film. Mike's primary concerns are the hostages held around the levels, and the legions of gang members out for blood. He also has to contend with the Predator, both as a boss at the end of each level, and as a time limit - if the player takes too long to rescue a hostage, the Predator will blast the hostage with his tri-laser.</p><p>The game is played in a third-person isometric view, with great swarms of easily-killed bad guys, who appear through one-way doors scattered throughout the level. Weapons not only include faster machine guns and shotguns, but also a few highly-advanced Predator weapons the player can pick up and use. Each defeated gang member drops drugs that can be picked up and automatically sent off to the \"drug squad\" for points. No sounds or music from the film get used, but stills scenes from the film do introduce the levels.</p>"},{"name":"Premier Manager","year":1995,"developer":"Realms of Fantasy","url":"d#Premier%20Manager%20%28U%29.zip","filesize":396333,"score":7.5,"genres":"Sports > Managerial / business simulation > Football (European) / Soccer","desc":"<p>The first game in Gremlin's series of football management games. You start off managing a team in the Conference (the fifth tier of English football) and aim to progress up the leagues, either by improving your existing team or earning jobs at better clubs elsewhere.</p><p>The features at your disposal include selecting training regimes, planning tactics for each match based on your opposition's strengths and weaknesses, scouting for new players including youth prospects, and arranging sponsorship and stadium improvements (to attract more fans).</p><p>The transfer system is a crucial part of the game, as you aim to sign players (who are broadly rated in each of the main skill areas) up against other teams who want them and sell off players you don't need. You have an overdraft available, but make sure not to exceed it.</p><p>The game supports up to 4 players, whose matches all take place at the same time. You can make tactical changes and substitutions mid-match.</p>"},{"name":"Premier Manager 97","year":1996,"developer":"Gremlin Graphics Software Limited","url":"d#Premier%20Manager%2097%20%28U%29.zip","filesize":394829,"score":"","genres":"Sports > Managerial / business simulation > Football (European) / Soccer","desc":"<p>Premier Manager 97 is the second Mega Drive game in the hit football managing game series of the early nineties. Similar to the first run of games in the series (released between 1992 and 1994), the manager starts (in the Full Game mode) as a lowly division 3 (not Conference) manager, where the goal is to get the club to the top divisions, or get signed to better placed teams. In the Demo mode, the player can choose any Premier League team, but only for a season.</p><p>In either of the modes, the player is responsible for carefully assembling the team (and unlike other managers, selecting the appropriate tactics is crucial to win the game), get the best from the transfer market by selling the fading stars and outselling the biggest clubs in England in the quest for the stars of the future, improve stadium capacity and quality (including seating, roof, security and others), sign good deals for ground advertising and balance the budget to make the team finish the season out of the red.</p><p>Matches are always simulated, with a ruler showing where the ball is, and with text messages showing actions (like \"player passes\", \"player tackles\" and so on). The chances of goals are shown in LED-style animated clips.</p>"},{"name":"Primal Rage","year":1995,"developer":"Atari Games Corporation","url":"d#Primal%20Rage%20%28USA%2C%20Europe%29.zip","filesize":2423623,"score":6.7,"genres":"Action > Side view > Arcade > Fighting > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>A meteor struck the Earth and caused great chaos. Seven gods from ancient times awoke, and are now attempting to take control of the post-apocalyptic world.</p><p><em>Primal Rage</em> is a one-on-one fighting game featuring dinosaurs and giant apes as the fighters. The graphics are done with digitized stop-motion animation. Gameplay is similar to Mortal Kombat in that it is viewed from a side perspective, and features deadly finishing moves at the end of the match.</p>"},{"name":"Prime Time NFL Football starring Deion Sanders","year":1996,"developer":"Spectacular Games, Inc.","url":"d#Prime%20Time%20NFL%20Starring%20Deion%20Sanders%20%28USA%29.zip","filesize":1062129,"score":7.1,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>Prime Time NFL Football</em> is one of the many football titles released back in the day. It features all 30 NFL teams at the time and the updated 1994 roster along with the standard modes such as <em>Exhibition</em>, <em>Season</em> and <em>Playoffs</em>.</p><p>Along with signing free agents and trading players, players could also customize their playbook, change weather conditions, relocate their team, play multiple schedules as well as save 15 different user records. The main draw of the game was the personal endorsement by Deion Sanders.</p>"},{"name":"Prince of Persia","year":1993,"developer":"Brøderbund Software, Inc.","url":"d#Prince%20of%20Persia%20%28USA%29.zip","filesize":393097,"score":8.2,"genres":"Action > Side view > Fixed / flip-screen > Platform > Puzzle elements > Direct control > Middle East > Regional differences","desc":"<p>While the Sultan of Persia is fighting a war in a foreign country, his Grand Vizier Jaffar orchestrates a coup d'état. His way to the throne lies through the Sultan's lovely daughter. Jaffar kidnaps her and threatens to kill her if she refuses to marry him. Meanwhile, the man the Princess loves is thrown into the dungeon. He has only one hour to escape from his prison, defeat the guards on his way, and stop Jaffar before the terrible marriage takes place.</p><p><em>Prince of Persia</em> is a 2D platformer that is commonly regarded as a progenitor of the cinematic platformer genre. Rather than following the more common jump-and-run mechanics, it focuses on careful advancement through fairly complex levels, emphasizing the protagonist's vulnerability and survival aspect. Rotoscoping technique is used to give more realism to the animation of the characters' movements.</p><p>The protagonist must avoid deadly traps, solve some simple jumping and environmental puzzles (such as stepping on pressure plates to raise portcullis), and engage in sword fights with the guards. The player character has an infinite amount of lives, but has to restart at the beginning of a level each time he dies, and must complete the game within an hour. The hero starts with three units of health, which can be replenished with small health potions or permanently increased with large jars.</p><p>The Game Boy Color and SNES versions of the game feature additional levels and new enemies. The Genesis version has a new intro, an altered set of graphics and four new levels.</p>"},{"name":"Pringles","year":2009,"developer":"Future Driver","url":"d#Pringles.zip","filesize":67182,"score":"","genres":"","desc":""},{"name":"Pro Quarterback","year":1992,"developer":"Leland Interactive Media","url":"d#Pro%20Quarterback%20%28USA%29.zip","filesize":509535,"score":6.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American)","desc":"<p><em>Pro Quarterback</em> is a football game featuring 27 different teams. Since this game doesn't have an NFL or NFLPA license, there aren't any real NFL teams or players here, although the teams included in the game represent the cities of their real life NFL counterparts and also mimic the colors of their team's uniforms.</p><p>The games options allow the player to choose to play on 6 different field surfaces (grass, mud, dirt, snow, rain and artificial turf) and to choose how long the game will last (2, 5, 10 or 15 minute quarters). There are also no penalties in this game whatsoever. </p><p>Gameplay consists of playing on both offense and defense. There are 26 different offensive plays and 18 different defensive plays to choose from. The game has a down the field view when on offense, so the game doesn't have receivers in windows.</p>"},{"name":"Pro Striker","year":1993,"developer":"SEGA Enterprises Ltd."},{"name":"Pro Striker 2","year":1994,"developer":"SEGA Enterprises Ltd."},{"name":"Pro Striker Perfect","year":1993,"developer":"SEGA Enterprises Ltd."},{"name":"Pro Striker: Final Stage","year":1995,"developer":"NexTech Corporation"},{"name":"Pro Yakyū Super League '91","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Psy-O-Blade","year":1990,"developer":"T&E Soft, Inc.","url":"d#Psy-O-Blade%20%28JU%29.zip","filesize":564720,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Real-time > Japanese-style adventure > Point and select > Sci-fi / futuristic","desc":"<p>In 21th century, there are three main powers on the Earth. The free world and the communist block carried over from the 20th century; the third power is the New Communist Federation. Since a program of denuclearizing was supported by all those powers, the New Communist Federation developed a devastating non-nuclear weapon: the satellite \"Raiden\". The two other powers competed with the New Communist Federation, developing their own killer satellites, and the danger of total annihilation became once again an issue. Seeing no future for the Earth, humans started to colonize other planets. In 22th century, they sent an experimental ship \"Septemius 1\" to a star six light years far away from the Solar System. The ship's main computer, \"Racoon\", sent a strange message before stopping any communication. Keith McDonnell, a seventeen-year-old crew member of the ship \"Septemius 2\", was sent to investigate the strange disappearance. </p><p><em>Psy-O-Blade</em> is a Japanese adventure in anime style. The player interacts with the game world by moving a cursor and clicking on objects to examine or use them, and people to talk to them, or by choosing options (\"Move\" and \"Scroll\") from a menu. There are no puzzles to solve; the player advances in the game by talking to characters, visiting different locations, as well as examining and using objects.</p>"},{"name":"Psycho Pinball","year":1995,"developer":"The Codemasters Software Company Limited","url":"d#Psycho%20Pinball%20%28U%29.zip","filesize":766470,"score":7.6,"genres":"Action > 1st-person > Top-down > Pinball > Direct control","desc":"<p><em>Psycho Pinball</em> is another pinball game in the style first introduced in Pinball Dreams and later popularized in Pinball Fantasies. Standard features of these types of pinball simulations include an animated backglass display, multiple bonuses including a multi-ball, extra ball, etc., and background music that changes based on active specials.</p><p>There are three main tables:* The Abyss (Aquatic theme)</p><ul><li>Trick or Treat (Horror theme)</li><li>Wild West (Western theme)</li></ul><p>An additional gimmick is a fourth Psycho Pinball table (circus theme) that has bonuses that can launch you to the other three tables, leading to massively high scores (and very long gameplay times).</p>"},{"name":"Puggsy","year":1993,"developer":"Traveller's Tales (UK) Ltd.","url":"d#Puggsy%20%28USA%29.zip","filesize":779096,"score":7.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Puzzle elements","desc":"<p><em>Puggsy</em> is a platform game with a combination of action and puzzle-solving elements. You control the creature Puggsy, who has crash landed on an alien planet and had his spaceship stolen. Your goal is to find the spaceship so you can get off the planet and return home. To do this, you will need to make your way from the start to the exit of numerous levels which take place in a variety of environments. Throughout each level are a variety of objects which you can pick up; on many of the levels you will need to figure out how to use the objects available to you in order to reach the exit. Some objects can be used (like a gun or keys), and objects may be thrown, moved around and stacked. Of course, each level will also have a variety of bad guys wandering about which will cost Puggsy one of his lives if he's caught. On your quest there will also be six evil guardians which will need to be defeated before you get your spaceship back!</p>"},{"name":"Pulseman","year":1994,"developer":"Game Freak, Inc.","url":"8#Sega%20-%20Genesis.zip/Pulseman%20%28Japan%29%20%5BT-En%20by%20M.I.J.E.T.%20v070226%5D.zip","filesize":1,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Sci-fi / futuristic","desc":"<p><em>Pulseman</em> is an electric hero who was created to fight cyber crime. Combat the galaxy gang throughout 7 stages with around 50 levels. Pulseman is best described as a fusion between the gameplay of Sonic the Hedgehog and Mega Man in ways of gameplay.</p>"},{"name":"Punisher, The","year":1994,"developer":"Capcom Co., Ltd.","url":"d#Punisher%2C%20The%20%28USA%29.zip","filesize":1035895,"score":7,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p>Join Frank Castle's crusade for justice and revenge in this arcade beat 'em up. Based on the Marvel comic of the same name, you play as the cold blooded vigilante or his pal Nick Fury (from S.H.I.E.L.D.) with your mission being to tear through the many rackets and underground criminal hotspots to cripple the Kingpin's criminal empire, and finally take down the man himself and bring peace to New York.</p><p>The game plays as a standard side-scrolling beat 'em up with your objective being to clear all stages of enemies by attacking them with your arsenal of attacks or whatever weapons you can find. Features single and 2-player cooperative gameplay.</p>"},{"name":"Putter Golf","year":1990,"developer":"SEGA Enterprises Ltd."},{"name":"Puyo Puyo","year":1992,"developer":"Compile"},{"name":"Puyo Puyo 2","year":1994,"developer":"Compile"},{"name":"Puzzle & Action: Ichidant-R","year":1995,"developer":"Sega AM1 R&D Division"},{"name":"Puzzle & Action: Tant-R","year":1994,"developer":"Sega AM1 R&D Division"},{"name":"Pyramid Magic","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Pyramid Magic II","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Pyramid Magic III","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Pyramid Magic Special","year":1991,"developer":"SEGA Enterprises Ltd."}]