[{"name":"R.B.I. Baseball '93","year":1993,"developer":"Tengen Inc.","url":"d#R.B.I.%20Baseball%20%2793%20%28USA%29.zip","filesize":538205,"score":6.7,"genres":"Simulation > Sports > Isometric > Real-time > Baseball > Licensed","desc":"<p>Continuing the R.B.I. series, the 1993 entry updates the rosters, adding two new teams (Colorado and Florida), bringing the total to 28 teams, and nearly 700 players. Instead of a generic stadium, all 28 teams have their own ballparks modeled after the real deal. On top of the regular team vs team mode (in either a single game, best of 7, you vs the division, or you vs the entire league), you can spend time in a home run derby or fielding practice. Also includes rosters of every division champ from 1984 onwards for Game Breaker mode.</p><p>Play is either player vs computer, as either the home or visiting team, two players, or computer vs computer. Password saves allowing resuming the multi-game modes. Included is the ability to edit the teams; you can transfer players between teams to keep the rosters current, or just have some fun. Finally, the Game Breaker mode allows setting up a game in progress using any team, any inning, any score.</p>"},{"name":"R.B.I. Baseball '94","year":1994,"developer":"Tengen Inc.","url":"d#R.B.I.%20Baseball%20%2794%20%28USA%2C%20Europe%29.zip","filesize":1184999,"score":7,"genres":"Sports > Diagonal-down > Baseball > Licensed","desc":"<p><em>R.B.I. '94</em> is an updated version of the series that features 800 of the top MLBPA players at the time with their 1993 stats applied and features authentic modeled ball parks. The game doesn't feature the MLB license, however, but does represent them by city name and omitting their nicknames and logos. The standard modes apply including exhibition that both has a single player and two-player option, a full 162-game season or skip straight to the playoffs or the World Series. The Home Run Derby is also present along with award-winning sports announcer, Jack Buck, lending his voice talent for play-by-play commentary. A password feature is present for players to continue their season at their leisure.</p>"},{"name":"R.B.I. Baseball 3","year":1991,"developer":"Tengen Inc.","url":"d#R.B.I.%20Baseball%203%20%28USA%29.zip","filesize":211663,"score":6.1,"genres":"Sports > Diagonal-down > Baseball > Licensed","desc":"<p><em>R.B.I. Baseball 3</em> took the popular baseball series a step further statistically, adding each Major League Baseball division winning team from 1983-1990, in addition to the 1989 All Star teams and all 26 1990 teams (with full 1989 statistics). Want to see how the 1986 Mets might have done against the 1987 Twins? Here's your chance.</p><p>The game was licensed by the Major League Baseball Players' Association; thus, real Major League players and statistics are included, but the teams themselves are represented only by their home cities. Team names are not used. Also, retired players who were no longer under contract with the MLBPA in 1991 are not present. Rather, they are represented by their initials and their fielding positions.</p><p>Game mechanics remain unchanged from R.B.I. Baseball 2, focusing more on arcade fun than realistic gameplay.</p>"},{"name":"R.B.I. Baseball 4","year":1992,"developer":"Tengen Inc.","url":"d#R.B.I.%20Baseball%204%20%28USA%29.zip","filesize":522357,"score":"","genres":"Sports > Baseball","desc":"<p><em>R.B.I. Baseball 4</em> is yet another update to Tengen's baseball franchise, updating the stats and legacy teams for the 1991 season. Just like the previous version, division champions back to 1983 are available, and now includes not only player names, but also all team names and each team's stadium. The game also features a management mode where custom teams can be created, as well as new Home Run Derby and Game Breakers modes.</p>"},{"name":"Race Drivin'","year":1993,"developer":"Atari Games Corporation","url":"d#Race%20Drivin%27%20%28USA%29.zip","filesize":158723,"score":6.5,"genres":"Racing / Driving > 1st-person > Arcade > Tricks / stunts > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Race Drivin'</em> is a sequel to the driving simulator Hard Drivin'. Game play is similar to the first game. The player must complete laps around the race track before a timer expires. There are several checkpoints around the track which increase player's time as he passes. </p><p><em>Race Drivin'</em> has three courses, one of which is the track from <em>Hard Drivin'</em>. There is a new super-stunt track, and an autocross course. The player also may choose from three types of cars.</p>"},{"name":"Racer","year":2013,"developer":"TOF Studio"},{"name":"Radical Rex","year":1994,"developer":"Beam Software Pty., Ltd.","url":"d#Radical%20Rex%20%28USA%29.zip","filesize":648104,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Skateboarding > Prehistoric","desc":"<p>Radical Rex is a fire-breathing Tyrannosaurus on a skateboard who has to save the dinosaur race under the spell of an evil creature. The game consists of 10 levels set in the prehistoric age. Radical Rex can use a skateboard or glide down hills, jump, kick and breath fire. Tougher enemies need multiple hits and when burnt Rex needs to kick them once more to destroy them or use his scream (hits everything on the screen). While playing Rex collects eggs, health, power-ups for his fire breath and scream refills. Checkpoints are shown as torches that need to be charged with fire. After each level, there is a Bomberman-like sequence to earn an extra continue. Enemies include flies, turtles, toads and all kinds of dinosaurs.</p>"},{"name":"Raiden Densetsu: Raiden Trad","year":1991,"developer":"Seibu Kaihatsu Inc.","url":"d#Raiden%20Densetsu%20~%20Raiden%20Trad%20%28Japan%2C%20USA%29.zip","filesize":489661,"score":6.9,"genres":"Action > Top-down > Arcade > Shooter","desc":"<p>In the year 2090, Earth is invaded by extra-terrestrials. The World Alliance of Nations has developed a supersonic attack fighter, Raiden, to defend the Earth. A pilot must take control of the experimental fighter to destroy the alien warships that just happen to look like odd variations of typical military tanks and planes with gadgets attached to them. </p><p><em>Raiden</em> (called Raiden Trad on the Genesis and SNES) is an over-head vertical-scrolling shooter, based on an arcade game of the same title. It features two forms of weapon upgrades and two types of missiles (normal or homing). You start the game with several bombs which you can use to destroy most enemies on the screen to get yourself out of a jam. Each level ends with a large boss or bosses.</p>"},{"name":"Rainbow Islands Extra","year":1990,"developer":"Taito Corporation","url":"d#Rainbow%20Islands%20-%20The%20Story%20of%20Bubble%20Bobble%202%20%28JU%29%20%5Bb1%5D.zip","filesize":222258,"score":7.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control","desc":"<p><em>Rainbow Islands Extra</em> is a version of the classic Taito coin-op Rainbow Islands. Home console versions Include both the the original game and the reworked \"Extra Version\", in which the stages and bosses have been rearranged to be more challenging. As with the other versions, the game is set in the titular Rainbow Islands, where the two boys Bub and Bob (no longer small dragons as in Bubble Bobble) must free the islands from the evil monsters who have overrun them, by using the magical power of rainbows! In addition to both the Original and Extra modes, the game also includes three difficulty levels.</p>"},{"name":"Rambo III","year":1989,"developer":"SEGA Enterprises Ltd.","url":"d#Rambo%20III%20%28World%29%20%28Rev%20A%29.zip","filesize":190304,"score":7.1,"genres":"Action > Behind view > Diagonal-down > 2D scrolling > Shooter > Licensed","desc":"<p>Based on the film of the same name, this game puts you in John Rambo's shoes as he travels to Afghanistan to free Colonel Trautman from the Soviets.</p><p>In six missions, Rambo must complete various objectives. Besides finding the exit of the level, prisoners must be freed and enemy ammunition supplies destroyed. Rambo is controlled from an overhead perspective and has several weapons at his disposal. Besides a machine gun that never runs out of ammo, he can use a knife for close range kills, set off timed bombs and use his famous crossbow with explosive arrows. Ammunition for the bow and the bombs is limited and can be collected from dead enemies.</p><p>After some of the missions, the perspective switches to a view behind Rambo and additional boss fights take place. Soviet tanks or helicopters must be destroyed using the crossbow. While aiming the bow, Rambo cannot move, but otherwise he can hide behind rocks or other obstacles from enemy fire.</p>"},{"name":"Rampart","year":1991,"developer":"Atari Games Corporation","url":"d#Rampart%20%28USA%29.zip","filesize":281752,"score":7.3,"genres":"Action > Strategy > Diagonal-down > Real-time > Arcade > Shooter > Licensed","desc":"<p>Tetris meets shoot-'em-up, <em>Rampart</em> is a game combining strategy and artillery action. Build your castle from Tetris-style pieces, place your cannons, bombard the enemy, try to repair, do it all over again. The original arcade release has a single-player and a two-player mode; later revisions incorporate three-player gameplay.</p>"},{"name":"Ranger X","year":1993,"developer":"NEX Entertainment Co., Ltd.","url":"d#Ranger%20X%20%28USA%29.zip","filesize":586188,"score":7.9,"genres":"Action > Side view > 2D scrolling > Shooter > Direct control > Flight / aviation > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Ranger X was released fairly late in the lifetime of the MegaDrive. Coming from an unknown developer, it was released with little fanfare and advertising but has become one of the best demonstrations of what the Genesis/MegaDrive is capable of.</p><p>The game is a side scrolling shooter of sorts. You control a large mech (robot) which has a smaller vehicle-like sidekick mech. The two can join together, providing an alternate shooting mode. Whilst controlling just the main mech however, the player can shoot both forward and back by using different buttons. The mech can also use its rocket pack to boost off of the ground and hover for a short while. Levels are not necessarily moving from left to right (although for the most part they are) and the game is an interesting blend of platform game and shoot 'em up.</p><p>The game features innovative graphics given the hardware limitations - there is a 3D introduction to most levels (remembering that the console had no 3D capability and a tile-based renderer) and some levels use a line-based scrolling effect to give the impression of 3D backgrounds.</p>"},{"name":"Rastan Saga II","year":1990,"developer":"Taito Corporation","url":"d#Rastan%20Saga%20II%20%28USA%29.zip","filesize":168311,"score":5.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Fantasy","desc":"<p>The \"Rastania\" was a sacred place, in which the sacred temple, \"Skyscraper\", soared into the sky. It is said that whoever conquer the \"Skyscraper\" would rule the \"Rastania\". A wicked group has invaded the \"Skyscraper\" and has tried to make it their own. If the situation is left as it is, the place would eventually be controlled by the wicked group.</p><p><em>Rastan Saga II</em> is the sequel to Rastan, containing the same hack-em'/slash-'em gameplay as the original. You are a warrior who must get through a number of levels, and trying to collect gems which can only be obtained by defeating the end-of-level bosses. Collecting power-ups along the way awards you with extra life or better weapons.</p>"},{"name":"Red Zone","year":1994,"developer":"Zyrinx","url":"d#Red%20Zone%20%28USA%2C%20Europe%29.zip","filesize":1152722,"score":7.4,"genres":"Action > Top-down > Shooter > Helicopter","desc":"<p><em>Red Zone</em> is a helicopter action shooter in which you pilot an AH-64B Apache into the heart of enemy territory to thwart the plans of a nuclear armed dictator. Under threat of global nuclear war the dictator has begun to annex his neighbor countries, with plans to continue his territorial expansion, so three special operatives are covertly sent in with a lone gunship to remove his ability to wage war.</p><p>The majority of the game consists of air-to-ground attack while flying in the Apache, using its hefty loadout of rockets, guided missiles, built-in 30 mm cannon and defensive infrared air-to-air missiles in order to eliminate the hostiles from the air, land and sea. Fuel drums, repair kits and ammunition depletion are both factors to keep in mind, and careful planning of where the pickups are located so that the chopper is able to stay in the air and is able to keep fighting, elements that are very similar in implementation to the Strike series. Differences between the games include the fact that as your systems get damaged, your helicopter becomes harder to control and the weapon and radar systems become affected.</p><p>Interspersed with the plentiful in-chopper combat, there are numerous mission-oriented sequences in which the occupants of the helicopter disembark and perform missions on-foot inside of buildings. Each of the three characters have a unique set of weapons, and the player can choose from either of the three to use, so long as none of them have been killed during previous on-foot missions.</p><p><em>Red Zone</em> bears many gameplay similarities to the early entries of the Strike series of games, though while the first three games of that series had a fixed isometric point-of-view, <em>Red Zone</em> has a straight-down POV that rotates along with the helicopter. <em>Red Zone</em> is also highly reminiscent of Zyrinx's earlier and similarly technologically advanced Genesis game Sub-Terrania, with the most notable similarities being in the relative difficulty of the games, and in the manipulation of the Genesis' hardware into providing visual effects not seen in other games, such as simulated video.</p>"},{"name":"Ren & Stimpy Show, The: Stimpy's Invention","year":1993,"developer":"BlueSky Software, Inc.","url":"d#Ren%20%26%20Stimpy%20Show%20Presents%2C%20The%20-%20Stimpy%27s%20Invention%20%28USA%29.zip","filesize":687981,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Stimpy has invented a wondrous, diabolic machine... The Mutate-O-Matic! Unfortunately it explodes, and having pieces of a Mutate-O-Matic lying about is not a good thing. So Ren and Stimpy embark on an adventure that spans Mr. Horse's refrigerator, to the pound, and even... The Great Outdoors! References from the cartoon are frequent, coupled with lots of side-scrolling action.</p><p>Players can switch controls between Ren and Stimpy. Their respective abilities vary greatly, even though they tend to use each other for their moves (i.e. Stimpy uses Ren as a boomerang and Ren uses Stimpy as a bowling ball).</p><p>Another player can also jump in at anytime and play as either Ren or Stimpy.</p>"},{"name":"Rent A Hero","year":1991,"developer":"SEGA Enterprises Ltd.","url":"sega-mega-drive-genesis-20210106-213105/Sega%20-%20Mega%20Drive%20-%20Genesis%20%2820210106-213105%29.rar/ROMs%2FRent%20a%20Hero%20%28Japan%29.zip","filesize":1,"score":"","genres":"Action > Role-playing (RPG) > Diagonal-down > Side view > 2D scrolling > Anime / Manga > Sci-fi / futuristic","desc":"<p>Tarō Yamada is an average young man who lives in the suburbs with his parents, until one day a strange package containing a superhero costume is delivered to his house by mistake. He puts the costume on to entertain some guests, but soon discovers that it really does give him superpowers when he accidentally sends his father flying through a wall.</p><p>The suit turns out to be the Rent A Hero Combat Armor, which is designed to allow anyone to become a hero! He's allowed to keep it, but there's just one catch: He has to pay the rental fees. Of course SECA, the company that makes the armor, also provides jobs to their renters, and they pay well if you're good enough.</p><p><em>Rent A Hero</em> is an action RPG where the player must make a living as a part-time hero by taking odd jobs. While these jobs start simple, such as delivering items and running errands, they eventually involve taking on gangs, corrupt businesses, and a city-wide conspiracy.</p><p>The player explores Aero City like a traditional top-down RPG, filled with shops, houses, and people to talk to. However, battles take place as side-view action sequences. When the player has the Combat Armor equipped, its power drains until eventually it is disabled, but it can be recharged by purchasing fresh batteries from a convenience store.</p>"},{"name":"Revenge of Shinobi, The","year":1989,"developer":"SEGA Enterprises Ltd.","url":"d#Revenge%20of%20Shinobi%2C%20The%20%28World%29%20%28Rev%20B%29%20%28Virtual%20Console%29.zip","filesize":368051,"score":8.1,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>In this game, a follow-up to the original Shinobi, once again you are Joe Musashi, but this time you're not out to free hostages, but to gain your revenge on the 'Neo Zeed' bandits.</p><p>The story told is that the old enemies 'Zeed' from the first Shinobi game has reorganised, and they have now struck back at your clan, first by killing your old master, and then kidnapping your bride.</p><p>What you have to do is go around killing enemies with \"kunai\", or throwing knives, and find the exits on each level.You can also find power pack upgrades by breaking boxes - though some are booby-trapped with bombs. Once you touch an upgrade, your knives turn into fire and you have a ninja sword. Extra knives and health are also sometimes in these boxes.</p><p>There are eight zones to pass through on the map, each having three levels, with a boss at the last level of each zone.Standard enemies vary from ordinary WW2 type soldiers, shooting rifles, machineguns and throwing stick grenades - to ninjas with shurikens throwing stars, katana swords and chigiriki-type flail weapons. Some types of enemies only appear in specific environments.</p><p>The environments are kept in similar style within a zone, starting out in a traditional rural town and forest area with ninjas and attack dogs, next into a modern city with an airport and factories, defended mainly by soldiers, moving onto a highway with almost frogger-style jumping to avoid cars, soldiers and jumping enemies disguised in nun-outfits (nun-jas?), next into an entertainment districts on rooftops and backstreets with ballet-dancing enemies, escaping on a train (riding on top of course, a shinobi won't buy tickets) to a harbour with more soldiers and cannon towers, and ultimately to the island where the final boss of the Neo Zeed bandit resides.</p><p>The zone bosses varied with each release, as there were licensing issues preventing their free use - initially several well known cinematic characters were used: Godzilla, Batman, Terminator and Spiderman, but they were gradually replaced with other characters, sometimes varied only by simple palette changes.</p>"},{"name":"Revolution X","year":1995,"developer":"Midway Manufacturing Company","url":"d#Revolution%20X%20%28USA%2C%20Europe%29.zip","filesize":1805749,"score":5.1,"genres":"Action > 1st-person > Rail shooter > Sci-fi / futuristic > Regional differences","desc":"<p>Revolution X is about the ol' Rock &amp; Roll.</p><p>There is an evil nation putting the youth down and banning our beloved rock music. Who you gonna call? Aerosmith!With the help of Aerosmith, the player must shoot his/her way through enemy infested levels, (light) guns blazing, collecting power-ups and releasing hostages.</p><p>Almost all of the graphics are digitized and Aerosmith themselves are too! There are also lots of fmv videos. </p>"},{"name":"Richard Scarry's BusyTown","year":1994,"developer":"Novotrade Software Kft.","url":"d#Richard%20Scarry%27s%20Busytown%20%28USA%29.zip","filesize":1447390,"score":"","genres":"Adventure > Educational > 1st-person > Puzzle elements > Math / logic > Licensed","desc":"<p>This early version is different from its PC counterpart with this version featuring six different stages to choose from and each with their own type of gameplay:<em> </em>Bruno's Deli:* The player takes control of Huckle the Cat as they help Bruno serve his customers by selecting the items they have requested on a conveyor belt.</p><ul><li><p><em>Captain Salty:</em> The player uses Huckle again and uses a crane to piece together Salty's ship by dropping them in the required spot which is marked.</p></li><li><p><em>Building House:</em> This is essentially the same as Captain Salty's stage, except this time around the player is building a house instead of a ship.</p></li><li><p><em>Delivery Truck:</em> The player uses Huckle and Lowly Worm to deliver various objects to their required shops while avoiding various obstacles such as trashcans, crossing chickens and chairs to name a few.</p></li><li><p><em>Fire Station:</em> This time the player takes control of a pig fire fighter and transverse BusyTown in a fire truck, collecting various firefighter-related objects while avoiding obstacles. After each object is collected, the player is then taken to a house fire where they must put out the fire and rescue the trapped animals inside.</p></li><li><p><em>The Wind</em>: The player can become the wind and shown a top-down map of BusyTown and using a whirlwind can interact with various objects on the screen to view animations.</p></li></ul><p>Additionally, the player can choose these different locations at the main screen that has the player become Lowly the Worm and fly around the map using his Apple Helicopter. It also features many the characters from Scarry's educational books.</p>"},{"name":"Riddle Wired: Quiz Dokusen Kigyō no Hōkai","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Rings of Power","year":1991,"developer":"Naughty Dog, Inc.","url":"d#Rings%20of%20Power%20%28USA%2C%20Europe%29.zip","filesize":621520,"score":6.8,"genres":"Role-playing (RPG) > Isometric > Fantasy","desc":"<p>For a long time, our world was in darkness. The sun shone as always, but our souls were dark and lacked the true enlightenment. Then the holy Nexus arrived, and changed everything. With his Rod of Creation, he blessed the people with the gift of the six Arts. The Red Priests - the people he chose among the others - established an order of the six Guilds. The world entered the era of prosperity. But the evil demon Void stole the Rod of Creation and drove the world to chaos again. In a cosmic battle, Nexus faced Void. None was victorious, and the Rod of Power was broken during the battle. It was divided into eleven rings, known as the Rings of Power. The young sorcerer Buc is now sent on a quest to retrieve those rings, and unite the Rod of Power that will eventually banish Void forever!</p><p><em>Rings of Power</em> is quite different from traditional console RPGs gameplay-wise, and is more similar to Western-style games such as  Ultima series. You can freely wander through the huge isometric world, and are not obliged to follow any storyline except the main quest for the eleven rings. You can talk to NPCs about many topics, choose whom to fight, bribe people, etc. There is a day/night cycle which affects the behavior of characters. Unlike most RPGs, there are no weapons and armor in this game. The turn-based combat is entirely dependent on magic spells. On your journey you will encounter characters from several guilds, each proficient in his own type of magic, and make them join your party.</p>"},{"name":"Rise of the Robots","year":1994,"developer":"Instinct Design","url":"d#Rise%20of%20the%20Robots%20%28U%29.zip","filesize":1782725,"score":4.4,"genres":"Action > Side view > 2D scrolling > Fighting > Cyberpunk / dark sci-fi","desc":"<p>Electrocorp, the world's leading manufacturer and developer of advanced robotics ran the Leader Project to develop a multi-task, ultra-intelligent, self-aware robot to manage every aspect of the factory plant. The end result was the Supervisor Droid, a machine capable of assuming any form and accessing any database. But when an EGO virus infected the Supervisor's self-awareness it started to consider its need above of those of the company, infecting the other robots in the plant and declaring itself their leader. Electrocorp then sent its top-secret ECO32-5 Cyborg to infiltrate the plant and destroy the supervisor.</p><p><em>Rise of the Robots</em> is a versus fighting game. The player controls the ECO32-5 Cyborg and must fight all the other robots in the plant until finally meeting the Supervisor Droid. The controls consist of 3 buttons for punches and 3 buttons for kicks (one for each in the Game Gear version), and jumping, moving, crouching and blocking are performed with the directional pad. The Cyborg has two super moves, the Turbo Head Butt and the Shoulder Barge. The player can choose the difficulty, number of rounds and time limit for the fights, as well as turn turn the super moves off.</p><p>The game has three modes: mission, where the player fights each robot in a fixed order; training, where the player can fight any robot in any desired order; and two players versus mode (absent in the Game Gear version), where the second player chooses any of the enemy robots to fight with. It features an AI system that reacts to the player style, 3D rendered cutscenes and the title song was composed by Queen's guitarist Brian May.</p>"},{"name":"Risk: Parker Brothers' World Conquest Game","year":1994,"developer":"Sculptured Software, Inc.","url":"d#Risk%20%28USA%29.zip","filesize":325354,"score":"","genres":"Strategy > Board game > Licensed","desc":"<p><em>RISK</em> is a conversion of the popular strategy board game created by Parker Brothers. Players control armies placed in different regions of the world, attacking opposing players' armies to gain territory, and ultimately try to wipe out the other factions and take over the world. In addition to the regular classic mode, which works just like the original board game, there is also an arcade mode, where skirmishes between factions give the player direct control of cannons to attack the opposing player. Any combination of up to six human and computer players can compete for world domination.</p>"},{"name":"Risky Woods","year":1992,"developer":"Zeus Software","url":"d#Risky%20Woods%20%28USA%2C%20Europe%29.zip","filesize":455380,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control > Fantasy","desc":"<p>Unusually for Electronic Arts in the early 90s, this was a platform -shooter game with little or no adventuring or strategy elements. The game scrolls sideways, and has sections where precision jumps are required, either to clear rivers or collect bonuses. You carry a dagger to deal with the enemies, and must avoid contact with them. When killed, they leave coins to be collected - these are spent in the shop sections. Death loses you most of your coins, but they can usually be retrieved if they land on solid ground - making it better to be killed in combat than by drowning.</p>"},{"name":"Ristar","year":1995,"developer":"SEGA Enterprises Ltd.","url":"d#Ristar%20%28USA%2C%20Europe%29%20%28Beta%29%20%28Later%29.zip","filesize":1411870,"score":8.2,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p>The evil tyrant Greedy has arisen to control a solar system full of sentient beings. He has corrupted the leaders of each world and thereby enslaved the entire populace. He has also sent his minions in the disguise of planet natives into the worlds to enforce his rule.</p><p>A lush forest planet, the last planet in the tyrant's agenda manages to send a call of help to the solar system's little ancient hero before being overrun. However, Greedy has even managed to remove the great hero. Yet, he did not count on the interference of the hero's sun, Ristar.</p><p>The player takes control of Ristar in his attempt to liberate the solar system. Ristar can stretch out his arms to grab enemies and summarily headbutt them. His long limbs can also be used to climb up on various surfaces. Being a star adds more features to the gameplay.</p>"},{"name":"Road Rash","year":1991,"developer":"Electronic Arts, Inc.","url":"d#Road%20Rash%20%28USA%2C%20Europe%29.zip","filesize":400940,"score":7.6,"genres":"Action > Racing / Driving > Behind view > Motorcycle > Street racing","desc":"<p><em>Road Rash</em> is an aggressive motorcycle racing game where the player assumes the role of a biker who takes part in a series of illegal races across the U.S.A. Starting at the back of the pack the objective is always to finish first on a linear course, overtaking the other bikers. This is achieved by driving very well or by playing it dirty, knocking opponents of their bikes using clubs, crowbars or your bare hands. The other racers fight back in a similar fashion and there are also hazards. All the races take place on the regular road with normal traffic (in both directions) and the cops, as well as occasional oil slicks and stray cows.</p><p>By winning races you can get promoted to a stronger division and earn cash with which you can buy a better bike. Whenever you're knocked off your bike or hit something you will have to run back to your bike and lose valuable time, plus your bike will suffer some damage. When the player crashes with cops nearby, it is possible to get busted and then you have to forfeit the race.</p><p>Like the whole <em>Road Rash</em> lineage, the game has arcade-like gameplay with no intention to be a motorcycle simulation. While the game has a two-player mode, this is not simultaneous.</p>"},{"name":"Road Rash 3","year":1995,"developer":"Monkey Do Productions","url":"d#Road%20Rash%203%20%28USA%2C%20Europe%29.zip","filesize":1197557,"score":7.6,"genres":"Action > Racing / Driving > Behind view > Arcade > Motorcycle > Street racing","desc":"<p>Following the previous two Road Rash games, the player has conquered the US illegal motorcycle championship. But why settle for that when one can take over the World; racing in the peaceful streets of the UK, dodging the animals in Kenya, blaze through the night in Japan or jump in the hilly circuits in Italy?</p><p>Keeping the same spirit of the previous two games, <em>Road Rash 3</em> adds all new digitized sprites (based on Sega-CD remake released an year earlier), bike upgrades, more weapons and meaner police. Most other aspects of the game remain unchanged: the player starts on the lowest division with a small amount of cash and a slow, hard to handle bike. To get more money (and get a faster bike) the player must beat as many of the other 15 racers to the finish line, using all means possible, even kicking and punching them into knockout. By clearing (finishing on the top three spots) all five races on a level, the player advances to the next, where opponents are faster and tougher, the police is more active and a longer race.</p><p>As for new gameplay elements in the final title in the series released for Sega's 16-bit console, bikes can also be improved by choosing cheaper upgrades (instead of simply buying new ones) such as tires (less skidding), engine (improves acceleration and top speed), suspension (allows better control while landing after jumps) and body (bike takes more hits before turning into smoking metal). Instead on relying on simple motorbike patrols, the police now has helicopters at their disposal (which try to land on the player) and patrol cars, which attempt to block the path of the bike, forcing it to stop or collide to get a bust. To make things easier (or harder), new weapons were added, some of which allow the carrier to stun an opponent for a few seconds, making him the perfect victim for an incoming vehicle. Also new, if the player finishes the race with a weapon, carries it to the next race.</p><p>Each track has its own features: in the UK, cars drive left on a rainy day, in Australia and Kenya animals wander into the road, in Brazil bikers can get themselves a close-encounter with a car on a crossing, in Italy the hills allow a lot of air-time for light and speedy bikes, Germany, where the icy roads and sharp turns make a deadly combination and finally in Japan the race goes during the night under the neon lights.</p>"},{"name":"Road Rash II","year":1992,"developer":"Electronic Arts, Inc.","url":"d#Road%20Rash%20II%20%28USA%2C%20Europe%29%20%28RR206%29.zip","filesize":558515,"score":7.5,"genres":"Racing / Driving > Simulation > Behind view > Arcade > Motorcycle > Street racing","desc":"<p>A motorcycle racing game with an attitude. You race in varying environments for ever increasing sums of money. With that money you can buy faster and better bikes. There are many objects on the road to watch out for, from cars to rocks to signs, if you hit one you'll go flying and loose valuable time. If you crash too often your bike can get wrecked. You can also attack other racers. The default attack is a punch, but some racers have weapons, which you can steal and use against them. The police patrol the various courses, so if you're not careful you can get busted. Road Rash II is not just a racing game but also a fighting game.</p>"},{"name":"RoadBlasters","year":1991,"developer":"Atari Games Corporation","url":"d#RoadBlasters%20%28USA%29.zip","filesize":244481,"score":6.4,"genres":"Racing / Driving > Behind view > Arcade > Automobile","desc":"<p><em>RoadBlasters</em> is a futuristic racing action game. The goal is to reach the finish line in one piece throughout each of 50 levels. Numerous enemies are out on the road to try and stop you, including armored cars, motorcycles, cannons on the side of the road, landmines, and more. </p><p>Your vehicle is equipped with a machine gun to help you out, and occasionally a weapons plane will fly in and drop additional power ups that can be collected. Some of these are the U.Z. canon, cruise missiles, and speed boost. Your car has a very limited amount of fuel, however more can be picked up along the way by crossing the halfway point of a level, or by collecting the red and green fuel spheres that appear in the road or after destroying certain enemies. On many levels collecting fuel is critical otherwise you won't be able to reach the finish line.</p>"},{"name":"RoboCop 3","year":1993,"developer":"Ocean Software Ltd.","url":"d#RoboCop%203%20%28USA%2C%20Europe%29.zip","filesize":323602,"score":5.7,"genres":"Action > Side view > Top-down > 2D scrolling > Arcade > Platform > Shooter > Sci-fi / futuristic > Crime > Licensed","desc":"<p><em>RoboCop 3</em> is a side-scrolling platform shooter. You get missions (such as rescuing your colleagues who are being kept hostages), which are divided into several smaller levels. The levels usually consist of several platforms, and are heavily populated by enemies who shoot at you. You can gather special repair kits, which will be used to restore your health after you've completed a level. \"RoboCop 3\" is more of a shooter than its predecessors, having more and tougher enemies.</p>"},{"name":"RoboCop versus The Terminator","year":1993,"developer":"Virgin Games, Inc.","url":"d#RoboCop%20versus%20The%20Terminator%20%28USA%29.zip","filesize":1079491,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>The Dark Horse comic book crossover of the two famous 80s cyborgs spawned various different game adaptations. <em>RoboCop versus The Terminator</em> on Sega systems is only loosely based on the comic.</p><p>The player controls RoboCop who during his duty of policing the streets of Detroit is lured into a trap by Terminators sent from the future. By uploading himself into the computer network, he becomes the seed from which the malevolent Skynet grows. Years later, in the post-apocalyptic future, RoboCop is reactivated and must help the human resistance by attacking and defeating Skynet once and for all.</p><p>The game is a platformer with heavy shooting elements and consists of 10 levels. Many enemies stand in RoboCop's way and must be destroyed via 8 different weapons. RoboCop begins the game with only a basic pistol, but other weapons can be found, including flame and grenade throwers, laser guns, self-seeking missiles and others. While all guns have unlimited ammo, only two can be carried at the same time and being killed means the currently equipped gun is lost.</p><p>The game is evenly split between present and future levels. Enemies in present Detroit include mostly street punks and other criminal elements while the future is of course populated by deadly machines: Terminators, robotic dogs and spiders and many automated guns. Each level ends with a boss battle, featuring Terminators, heavy tanks and RoboCop's famous adversaries ED-209 and Cain (aka RoboCop 2).</p><p>Some levels feature optional goals besides getting to the exit, like freeing hostages or destroying security cameras.</p>"},{"name":"Robot Battler","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Rock n' Roll Racing","year":1994,"developer":"Silicon & Synapse, Inc.","url":"d#Rock%20n%27%20Roll%20Racing%20%28USA%29.zip","filesize":669051,"score":8.3,"genres":"Action > Racing / Driving > Diagonal-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Rock 'n Roll Racing</em> is an arcade combat racing game. Combat plays a heavy role in the game, as each car has a frontal weapon, such as a laser or missile, and a drop weapon, such as spikes or mines. As you complete races, you get more money to upgrade your car. The soundtrack features famous rock tracks such as \"Born to Be Wild, \"Bad to the Bone,\" \"The Peter Gunn Theme,\" \"Highway Star\" and \"Paranoid.\"</p><p>The game is very similar to RPM Racing. The later released PC version is an official release, but based on the SNES version incorporating the ZSNES emulator and limited to three tracks.</p>"},{"name":"Rocket Knight Adventures","year":1993,"developer":"Konami Co., Ltd.","url":"d#Rocket%20Knight%20Adventures%20%28USA%29.zip","filesize":672108,"score":8.1,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p><em>Rocket Knight Adventures</em> is the first side-scrolling action game starring Sparkster. He lives in the kingdom of Zebulos, and is the bravest of all the Rocket Knights. One day, an army of pigs comes down to invade the kingdom and capture the princess. It is up to Sparkster to set things right again.</p><p>Most of the gameplay in <em>Rocket Knight Adventures</em> involves using Sparkster's rocket pack and sword. Sparkster has to fight off many bosses and survive many precarious situations. The levels are interspersed with a variety of elements, like shooting stages, and giant robot combat.</p>"},{"name":"Roger Clemens' MVP Baseball","year":1992,"developer":"Sculptured Software, Inc.","url":"d#Roger%20Clemens%27%20MVP%20Baseball%20%28USA%29.zip","filesize":464466,"score":5.7,"genres":"Sports > Diagonal-down > Baseball","desc":"<p>Roger Clemens is known by some as the greatest pitcher in baseball history. In  <em>Roger Clemens' MPV Baseball</em> players play a standard a 9 innings baseball game in Exhibition mode and a full regular season can be played including the World Championship Playoffs in the Regular Season mode. While playing in Regular Season mode the player can see their chosen team’s progress by using the in game calendar showing all the games.</p><p>Players select a fictional team from the following groups:<em> </em><em>National Division West:</em>* San Francisco Quakes, Los Angeles Apaches, Cincinnati Big Cats, San Diego Suns, Houston Mustangs, and Atlanta Condors.</p><ul><li><p><strong>National Division East:</strong> Chicago Swords, Montreal Lumberjacks, New York Buffalos, St. Louis Commandos, Pittsburgh Panthers, and Philadelphia Generals.</p></li><li><p><strong>American Division West:</strong> Oakland Bashers, Seattle Pioneers, Minnesota Hounds, California Waves, Texas Cowboys, Chicago Red Birds, and Kansas City Kings.</p></li><li><p><strong>American Division East:</strong> Toronto Bears, Boston Hornets, New York Rebels, Detroit Wheels, Milwaukee Marshals, Baltimore Eagles, and Cleveland Tomahawks.</p></li></ul><p>Each team has a set of players the make up the team each with their own skill level and statistics which, like the teams, is fictional other then Clemens himself who is on the Boston Hornets team. </p><p>When controlling the pitcher the player can control the speed and spin of the pitch as well as the pitchers position on the plate. The pitcher can also stop the opponent stealing a base which can be seen via windows showing the positions of all the baserunners. When controlling the batter the player has to time the hit to successfully hit the ball so it will not be a missed hit or a foul, or has the option to not hit in case of a ‘ball’. The player can also steal a base while batting. After the ball is hit the game goes into fielding mode where the camera shifts to a view that is lower than the normal 45 degree angle (the fielder gets smaller as he moves away from the camera). The player then controls the closest fielder to get or catch the ball and then throw it to the selected base. There are many different cameras angles that the game selects depending on the location of the ball. The camera can be on the left, center, or right side of the field in ether infield or outfield position and all cameras can pan to follow the ball. </p><p>The player can use a password to save their progress in Regular Season mode. An exhibition match can be played in two player mode with the use of two controllers.</p>"},{"name":"Rolling Thunder 2","year":1991,"developer":"Namco Limited","url":"d#Rolling%20Thunder%202%20%28USA%29.zip","filesize":662218,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Shooter","desc":"<p>A follow-up to the original Rolling Thunder, this is a \"shoot-the-bad-guys-and-save-the-world\" game. A terrorist group has taken out the world information flow and, as either a guy named Albert Ross or a woman named Leila, you must stop them. You can also get weapons that pack more of a punch than your ordinary hand gun. The original Arcade version of <em>Rolling Thunder 2</em> supports two-player cooperative play. </p><p>The Genesis conversion introduces several new stages with new enemies and bosses. The original stages have been tweaked to provide more cover points and bonus items; also two new weapons were added - a laser and a flamethrower. The storyline cutscenes between the stages were expanded. This version introduces a password system that allows the players to continue from any previously visited stage.</p>"},{"name":"Rolling Thunder 3","year":1993,"developer":"Now Production Co., Ltd.","url":"d#Rolling%20Thunder%203%20%28USA%29.zip","filesize":728259,"score":7.5,"genres":"Action > Side view > 2D scrolling > Shooter > Spy / espionage","desc":"<p>The events in the third game in the series are synchronous with RT2. At the end of the twentieth century, satellites around the globe are being shot down, disrupting communications. Secret agency Rolling Thunder discovers the organization behind the terror: Geldra. While agents Leila and Albatross are fighting the leader Gimdo (RT2), agent Jay is instructed to bring down Dread, the second-in-command.</p><p>There are many improvements to the gameplay: Jay can shoot while jumping and shoot diagonally upwards with certain weapons. At the beginning of each mission, you can pick a special weapon such as a laser rifle, bazooka, flamethrower or grenades. You have to choose carefully as they cannot be reused in later missions. You can still hide in doorways and recharge your weapons behind special doors. The mission timer from the previous game has been replaced by a sniper that targets you with a crosshair when you don't move fast enough. The brutal difficulty from the previous games has been toned down: there are more life marks at the start and you now resurrect where you died, rather than returning to the last checkpoint. Unlike the previous game, you can only choose one character to play with.</p><p>After completing a mission, a password is provided to continue playing. There are ten levels in total, with a few hidden areas.</p>"},{"name":"Rolo to the Rescue","year":1992,"developer":"Vectordean Ltd.","url":"d#Rolo%20to%20the%20Rescue%20%28USA%2C%20Europe%29.zip","filesize":303089,"score":7.3,"genres":"Action > Side view > Arcade > Platform","desc":"<p><em>Rolo to the Rescue</em> is a side-scrolling platform action game. The player controls Rolo, an elephant who escaped from the circus. Rolo's main task is to find and rescue four other animals - a squirrel, a rabbit, a beaver, and a mole. Once rescued, each of those friends become player-controlled characters with special abilities that can help the player along the way -- the squirrel can climb, the rabbit jumps, the beaver swims, and the mole digs.</p>"},{"name":"Romance of the Three Kingdoms II","year":1991,"developer":"KOEI Co., Ltd.","url":"d#Romance%20of%20the%20Three%20Kingdoms%20II%20%28USA%29.zip","filesize":448149,"score":7.8,"genres":"Strategy > Top-down > Turn-based > Turn-based strategy > China (Ancient / Imperial) > Historical events","desc":"<p>The sequel to Romance of the Three Kingdoms. The game concept is still the same, though they did improve a lot of features that one may consider 'disturbing' from <em>RTK I</em> (e.g. Generals dying easily due to disease, etc.). <em>RTK</em> can be said to be much more 'stable' where players no longer have to worry that much about time length in the game, as the game take a slower time rate to allow the players to build up their forces without much interference. The <em>RTK II</em> gameplay and interface is closely similar to Nobunaga's Ambition II.</p>"},{"name":"Romance of the Three Kingdoms III: Dragon of Destiny","year":1992,"developer":"KOEI Co., Ltd.","url":"d#Romance%20of%20the%20Three%20Kingdoms%20III%20-%20Dragon%20of%20Destiny%20%28USA%29.zip","filesize":714113,"score":7.7,"genres":"Strategy > Top-down > Turn-based > China (Ancient / Imperial) > Historical events","desc":"<p><em>Romance of the Three Kingdoms III: Dragon of Destiny</em> is another strategy game by Koei. The concept is the same here as in Koei's other wargames: conquer all you can!</p><p>In this case the historical setting is ancient China. The country is under the control of one Emperor, but all of the faction leaders want to be the emperor themselves. You begin with one territory and you must conquer more to win the game.</p>"},{"name":"Romeow and Julicat","year":2020,"developer":"Mega Cat Studios"},{"name":"Rugby World Cup 95","year":1994,"developer":"The Creative Assembly Ltd.","url":"d#Rugby%20World%20Cup%2095%20%28USA%2C%20Europe%29%20%28En%2CFr%2CIt%29.zip","filesize":679580,"score":7.1,"genres":"Sports > Diagonal-down > Isometric > Direct control > Rugby > Licensed","desc":"<p>The official game of the 1995 IRB Rugby Union World Cup in South Africa. Featuring all 20 international teams that took part in the World Cup including the All Blacks of New Zealand and the Springboks of South Africa, as well as an EA All Stars team and a few other minor rugby nations.</p><p>The game shares a lot with EA Sports' early FIFA titles. It uses an isometric perspective, with buttons to pass and kick the ball, and a timed gauge for place kicks.</p><p>The menus are structured in the same way as <em>FIFA</em>, with options including arcade and simulation modes, changing the firmness of the ground, and the weather.</p>"},{"name":"Runes","year":2020,"developer":"Cannibal Cat Software"}]