[{"name":"Saban's VR Troopers","year":1995,"developer":"Syrox Developments, Ltd.","url":"d#VR%20Troopers%20%28USA%2C%20Europe%29.zip","filesize":1127747,"score":6,"genres":"Action > Side view > 2D scrolling > Fighting > Sci-fi / futuristic > Licensed","desc":"<p><em>Saban's VR Troopers</em> is based on the TV show of the same name and is made by the same company that produced the <em>Mighty Morphin' Power Rangers</em>. The story has the evil Grimlord transport the VR Troopers into (ironically) a video game and it is up to the player (literally) to save them and bring them back to the real world.</p><p>The gameplay is the standard fighting game, using one of the three different Troopers to kick, punch and use special abilities to defeat a fighter to advance to the next one. Each Trooper has their own strengths, weaknesses and special moves and each has their own separate stages, depending on which the player chooses. It also has multi player capabilities that lets two friends battle head-to-head in a Duel Mode.</p>"},{"name":"Sacred Line: Genesis","year":2013,"developer":""},{"name":"Sagaia","year":1990,"developer":"Taito Corporation","url":"d#Sagaia%20%28USA%29.zip","filesize":430316,"score":7.3,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>Long time ago, the planet of Darius went into ruin but Proco and Tiat of Darius gave birth to a new planet and named it Orga. After the passing of many centuries, Proco Jr. and Tiat Young receive a strange radio broadcast from the galaxy. They discover the radio broadcast is a mayday signal from another descendant of Darius. They board the Silverhawk, preparing to defeat an evil force and journey to the galaxy.</p><p><em>Darius II</em>, or <em>Sagaia</em> as it is known in the West, is the second installment in Taito's shoot 'em up series. Its main distinguishing features are the non-linear level system and the enemies, which are different kinds of seafood.</p>"},{"name":"Sailor Moon","year":1994,"developer":"","url":"d#Sailor%20Moon%20%28JU%29.zip","filesize":1161778,"score":6.2,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Platform > Fantasy > Sci-fi / futuristic > Licensed","desc":"<p>The game is based on the popular manga/animé series of the same name. The heroine of the series is a 14-year-old schoolgirl named Serena (Usagi in the Japanese version). One day she encounters a magical talking cat named Luna, who tells her she has been chosen to be a Sailor Moon fighter, to find the lost Princess of the Moon Kingdom and to fight the forces of darkness lead by the evil Queen Beryl. </p><p>This adaptation of the story is a beat-'em-up game. You can control either Serena herself or one of her Sailor Moon companions. Each girl has different strengths and special attacks. You advance in the game by moving on a platform and defeating the enemies you encounter. You can't move on if you haven't defeated all the enemies that keep coming at you.</p>"},{"name":"Saint Sword","year":1991,"developer":"Cyclone System","url":"d#Saint%20Sword%20%28USA%29.zip","filesize":348785,"score":6.2,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p>You are Macress, a mythical warrior, and you have been called upon to destroy the evil demon, Gorgon before the world succumbs to his power. This is a platform style, hack 'n slash action game where you gain powerups by destroying wee mythical beasties. These powerups provide you with special physical attributes like angel wings and the body of a horse.</p>"},{"name":"Sampras Tennis 96","year":1995,"developer":"Codemasters","url":"d#Sampras%20Tennis%2096%20%28U%29.zip","filesize":1259582,"score":7.3,"genres":"Sports > Diagonal-down > Tennis > Licensed","desc":"<p>The Europe-only sequel to <em>Pete Sampras Tennis</em>, <em>Pete Sampras Tennis '96</em> includes new features, such as a reworked graphics engine with parallax scrolling, new shots and aftertouch controls, with an Indoor court joins the previously available Grass, Clay and Hard courts. </p><p>Changes to the game go well beyond the graphics - now the ball reacts differently in each court and it's harder to control the direction of the ball, meaning the powerful forehands that could win a game in minutes of the first game are much harder to pull. Services now must be perfectly weighted in both power, direction and timing, facing the risk of hitting the net or going off bounds, with a speedometer showing how fast the best serves went. All these are controlled using the three buttons of the gamepad and the d-pad, with the A button for lobbing the ball, B to make passing shots and C to dive for a direction. By combining the B and A or C buttons it's possible to add top/back or full spin to the ball, with the Y axis changing the power and the X axis the direction. </p><p>The large roster of <em>Pete Sampras Tennis</em> was replaced by only eight players: Pete Sampras himself, Sam Nimitz (German, powerful player best suited for hard courts), Marie Guyennot (French, accurate and fast around the court), Minori Hurosawa (Japanese, fast and agile all around), Dino Turnetti (Italian, with an aggressive style of play), Wanda Tucker (American, all around), Esperanza Delgado (Spanish, powerful serve and volleying abilities) and Richard Potter (English, rookie all-arounder). There are three game modes to square things up - Challenge (single match, pairs or doubles on any court), Tournament (\"Party mode\" for up to eight players) and World Tour (single player mode, where the player squares against seven computer players, with the option to play singles or doubles. There's a Pro mode which extend the match to three sets and increase the difficulty setting by enhancing computer player AI and allowing them to perform spin shots).</p>"},{"name":"Samurai Shodown","year":1994,"developer":"SNK Playmore Corporation","url":"d#Samurai%20Shodown%20%28USA%29.zip","filesize":1743227,"score":8.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Japan (Ancient/Classical/Medieval) > Martial arts","desc":"<p>In early feudal Japan, a man named Shiro Tokisada Amakusa preaches a heretic religion. Little does anyone know that Amakusa is really a servant of the evil Ambrosia, who had possessed and taken over Amakusa's body, as Ambrosia wishes to shroud the world into eternal darkness. Now, the player must select from out of 12 fierce warriors and plus 3 bonus characters in order to fight for the honor of defeating Amakusa once and for all, while fulfilling a specific mission for each and every warrior in the game.</p><p>The Genesis version of the game does not however include the Earthquake which has been removed due to its 16-bit memory capacity and technical size limitations.</p>"},{"name":"Sangokushi Retsuden: Ransei no Eiyūtachi","year":1991,"developer":"Tose Co., Ltd."},{"name":"Sangokushi V","year":1997,"developer":""},{"name":"Sansan","year":1994,"developer":"Sansan Co., Ltd."},{"name":"Saturday Night Slam Masters","year":1994,"developer":"Capcom Co., Ltd."},{"name":"Saturday Night Slammasters","year":1993,"developer":"Capcom Co., Ltd.","url":"d#Saturday%20Night%20Slammasters%20%28USA%29.zip","filesize":2481247,"score":"","genres":"","desc":""},{"name":"Scholastic's The Magic School Bus: Space Exploration Game","year":1995,"developer":"Novotrade Software Kft.","url":"d#Magic%20School%20Bus%2C%20The%20-%20Space%20Exploration%20Game%20%28USA%29.zip","filesize":576135,"score":"","genres":"Educational > Puzzle > 1st-person > Platform > Science > Flight / aviation > Sci-fi / futuristic > Licensed","desc":"<p>Based on the PBS kids program, <em>The Magic School Bus</em> along with Ms. Frizzle and her companion Liz takes the player throughout the solar system one planet at a time to learn about them while exploring each one. Along the way, players will be transported on the bus on their way to the next planet where they can take photos of the planets, their moons, stars, among many other things they can see. Along the way they will encounter puzzles they have to solve in order to advance using the facts they have learned through their planetary visit and can also build their own solar system in any way they choose.</p>"},{"name":"Scooby-Doo Mystery","year":1995,"developer":"The Illusions Gaming Company","url":"d#Scooby-Doo%20Mystery%20%28USA%29.zip","filesize":1260847,"score":7.1,"genres":"Adventure > 3rd-person (Other) > Graphic adventure > Puzzle elements > Point and select > Detective / mystery > Licensed","desc":"<p>Scooby-Doo Mystery is a point-and-click (or point-and-press button rather) adventure featuring two playable episodes of a typical scooby-doo cartoon.</p><p><strong>Blake's Hotel -</strong> Daphne's Uncle Blake has invited the gang over to his hotel for a ski weekend. Upon reaching the hotel they learn that the ghost of the Ancient Chieftan is scaring all the customers away, as he isnt happy about a hotel being built on his burial grounds. Soon Uncle Blake is kidnapped, and its up to Scooby and Shaggy to find clues and hunt this ghost down.</p><p><strong>Ha Ha Carnival -</strong> The gang arrives at an almost-deserted carvinal, looking for some fun. Soon enough Fred, Daphne and Velma get trapped in a pond when they go out in one of the rides. Not only that, someone has broken the rollercoaster tracks. Then an evil looking phantom clown has Scooby and Shaggy being chased all around the carnival. Another mystery for the pair to solve.</p><p>Both mysteries have Scooby and Shaggy on their own, collecting clues and putting them together. You control Shaggy mostly while Scooby just keeps him company. The game interface involves walking around and/or choosing actions from a menu and using them with objects. A password feature is provided so you can continue where you left off.</p>"},{"name":"SeaQuest DSV","year":1994,"developer":"Sculptured Software, Inc."},{"name":"Second Samurai","year":1994,"developer":"Vivid Image","url":"d#Second%20Samurai%20%28U%29.zip","filesize":664862,"score":6.3,"genres":"Action > Side view > 2D scrolling > Fantasy > Japan (Ancient/Classical/Medieval) > Prehistoric > Sci-fi / futuristic","desc":"<p>At the end of First Samurai, the Demon King was able to flee back in time to ancient Japan, so our hero follows him through time in order to confront him.</p><p>The game consists of 15 levels crossing various time periods such as the prehistoric age, a futuristic age, and medieval Japan. Throughout these levels are vases that hold souls. A certain number of these vases have to be broken in order to free the captive souls before the game will let the player continue further. The samurai initially starts only with the ability to punch, kick, and jump but can find items like a sword, throwing knives, food items that replenish energy, and a thunder spell can be found that will aid the samurai in his quest against the legions of the Demon King's henchmen.</p><p>Options let the player select the number of lives (3, 5, or 7) they start with and the difficulty level (Easy, Brave, Heroic, and Samurai).</p>"},{"name":"SEGA Sports 1","year":1995,"developer":""},{"name":"Sega Top Five","year":1997,"developer":""},{"name":"Sensible Soccer: European Champions","year":1992,"developer":"Sensible Software","url":"d#Sensible%20Soccer%20-%20European%20Champions%20%28U%29.zip","filesize":227270,"score":8.1,"genres":"Sports > Top-down > Managerial / business simulation > Football (European) / Soccer","desc":"<p><em>Sensible Soccer: European Champions</em> is a soccer (football) game similar to the Kick Off series. The graphical view is from a distance overhead, making the players small on screen, but allowing player to view around half the pitch.</p><p>The basic control system involves loose control, making running with the ball (‘dribbling’ in football parlance) a skill to master, and putting the emphasis on one-touch passing, which can be easily performed by tapping the fire button.</p><p>The game features customisable league and cup competitions as well as pre-set ones including the 1992 European Championships. There are 168 teams in total, 40 European nations, the 64 top club sides, and 64 custom teams with names ranging from self-indulgent to comical, and their details are fully editable. At club and country level, each team has three star players who are more gifted that the others.</p>"},{"name":"Sensible Soccer: International Edition","year":1994,"developer":"Sensible Software","url":"d#Sensible%20Soccer%20-%20International%20Edition%20%28U%29.zip","filesize":1128243,"score":7.6,"genres":"Action > Sports > Top-down > Football (European) / Soccer","desc":"<p>Released alongside the 1994 World Cup, this was the first version of Sensible Soccer to feature teams from outside Europe. The World Cup tournament is featured in full, and you can adjust which 24 teams this features, a particularly crucial feature for English and French fans, as their nations failed to qualify. For the first time in the series an on-screen referee is featured. The club team data has been updated to take into account transfers and kit changes since the previous version. Gameplay is much the same as previous editions, being viewed from above with small sprites and loose ball control.</p>"},{"name":"Sesame Street: Counting Cafe","year":1994,"developer":"Electronic Arts, Inc.","url":"d#Sesame%20Street%20Counting%20Cafe%20%28USA%29.zip","filesize":513698,"score":"","genres":"Action > Educational > Side view > 2D scrolling > Platform > Math / logic > Licensed","desc":"<p><em>Counting Cafe</em> is an educational game based on the popular children's show <em>Sesame Street</em>. The player controls Grover, working as a waiter at a restaurant, where Mr. Johnson appears and orders various items. The player must take Grover into the kitchen, collect the items ordered, and return to Mr. Johnson's table, where he will reward the player with a star if the order is correct. If the player picks up the wrong items, they can be taken to Cookie Monster at the back of the restaurant, who will eat them and clear Grover's tray.</p><p>There are five sections to each \"day\" -- Breakfast, Brunch, Lunch, Dinner, and Dessert. Once the player has completed Dessert, a monkey will run by and snatch the last star. Grover then must chase after the monkey to retrieve his last star, after which the game will move on to the next day.</p><p>After the first day, Sesame Street denizens will start appearing in the kitchen playing around with food items. Sometimes their activities with a food item will end up landing on Grover's tray, which may result in Grover carrying an unwanted food item, forcing him to give the food to Cookie Monster and having to collect the correct food items all over again.</p>"},{"name":"Shadow Blasters","year":1990,"developer":"Cyclone System","url":"d#Shadow%20Blasters%20%28USA%29.zip","filesize":282205,"score":5.8,"genres":"Action > Side view > 2D scrolling > Platform > Shooter","desc":"<p>Humans on Earth have lost their righteous ways. After seeing that this has happened, the Gods have decided to abandon the Earthlings and no longer protect them. Ashura, the King of an alien race hailing from the Evil World, decides that this is the perfect time to strike the vulnerable unprotected Earth.  It just so happens that one of the good gods, Hyperion, takes pity on the humans and decides to bestow his power to four of the strongest Earth warriors so they can go and defeat Ashura and his minions.</p><p>The player takes control of these four warriors who are Leo, a fencer, Marco, a monk, and Horatio and Tiffany, whom are both ninjas (one male, one female). Each character fires their own type of weapon and each character can charge up their weapon to make it a more powerful shot. All the characters also have a special weapon that can clear all the enemies on the screen but with the caveat that it can only be used once per stage. Each character also has a jump and speed attribute which when powered up allows them to jump higher and walk faster. Players can switch between all of the characters during a stage.</p><p>The game has 9 different stages. The player can play the first six (mountain,harbor,street,future,glen, and forest) in any order. Each round ends with a boss which must be defeated to clear that round.</p>"},{"name":"Shadow Dancer: The Secret of Shinobi","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Shadow%20Dancer%20-%20The%20Secret%20of%20Shinobi%20%28World%29.zip","filesize":347447,"score":8,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>A.D. 1997, New York City</p><p>Having vanquished the evil crime empire, Neo Zeed, the ninja master Shinobi and his combat ninja skills were not heard from for some time. But a new threat arose, in a reptilian form that lived on vicious instinct alone. The colossal monster moved slowly and quietly, and its attack was relentless. The souls unfortunate enough to survive became hostages, and mass panic swept the streets.</p><p>It remained only for Shinobi to take action. His weapons were stealth and quickness of attack, his only allies facing overwhelming forces. Relying on Ninja weapons and magic, Shinobi fought on, assisted by his faithful dog.</p><p><em>Shadow Dancer: The Secret of Shinobi</em> is similar to <em>Shadow Dancer</em> for home computers, and consists of five missions containing three stages each. However, there are a few differences between the two. For example, in this Sega Genesis/Mega Drive exclusive, the stages are different, and you rescue hostages rather than disarm bombs. Each mission ends up with you fighting a boss, and when you defeat each (except the final one), you also participate in a bonus stage where you must shoot all ninja flying towards you.</p><p>Some of the enemies are also quite different. Some of the lizards, which appear in later missions, leave a \"lizard coin\", which you can collect for bonus lives.</p>"},{"name":"Shadow of the Beast","year":1991,"developer":"Reflections Interactive Limited","url":"d#Shadow%20of%20the%20Beast%20%28USA%2C%20Europe%29.zip","filesize":365044,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>While very young, Aarbron was kidnapped and enslaved by the Priests of the Beast Lord. He grew up on drugs made to destroy his own will and turn him into the Beast Messenger, a powerful creature serving Maletoth, The Beast Lord himself. He did his job, until one day he noticed a man about to be sacrificed in a ritual, his face triggering ancient memories. As the sacrificial knife descended into the man's body, Aarbron recognizes his father's face. As his father dies in the altar, memories of his childhood and tormented past at the hands of the Beast Lord emerged, and as feelings of hate over his captors took over him, he swore revenge and fled the temple, knowing the road to avenge his father and redemption would be hard.</p><p><em>Shadow of the Beast</em> is a side-scrolling platformer with a side-shooter elements (by the end). The player has to navigate through several areas filled with enemies and traps, collecting keys and activating triggers that open new areas or give Aarbron the means to overcome a sub-boss. The number of moves the player has at disposal is limited: duck, jump and only two attacks: punch and a flying kick. While most enemies die with just one hit, the player must time each attack accurately. However, there are also traps of objects that cannot be destroyed and these require the player to jump, duck or move according the sequence. The player has only one life with 12 hit points that can be replenished by collecting some objects hidden in the level (like an off-route location or a under a megalith), which also contributes to the difficulty level.</p>"},{"name":"Shadow of the Beast II","year":1992,"developer":"Reflections Interactive Limited","url":"d#Shadow%20of%20the%20Beast%20II%20%28USA%2C%20Europe%29.zip","filesize":391442,"score":6.9,"genres":"Action > Side view > 2D scrolling > Fighting > Puzzle elements","desc":"<p>Essentially a side-on scrolling beat 'em up in the vein of The Way of the Exploding Fist, but with an epic storyline and puzzles a-plenty.</p><p>The introduction, now an Amiga classic, shows the Beast-mage stealing your infant sister and the purpose of the game is to rescue her back. On the way a variety of puzzles, sub-quests and really nasty monsters dog your every step.</p>"},{"name":"Shadowrun","year":1994,"developer":"BlueSky Software, Inc.","url":"d#Shadowrun%20%28USA%29.zip","filesize":1020188,"score":7.7,"genres":"Action > Role-playing (RPG) > Top-down > 2D scrolling > Cyberpunk / dark sci-fi > Fantasy > Detective / mystery > Licensed","desc":"<p>The year is 2058. Following an event known as the Awakening, magic has returned into the world. Native American shamans and elves reclaimed a vast area known as Salish-Shidhe, located around the free city of Seattle. A small team of shadowrunners - mercenaries working for powerful corporations - is brutally attacked in the wilderness. The massacre is captured in video and broadcast in the news. One of the slain shadowrunners, Michael, had a brother named Joshua. Arriving in Seattle, Joshua begins to investigate his brother's death. He must find out who killed Michael, and what was the nature of the shadowrun job he was carrying out.</p><p><em>Shadowrun</em> is an action-oriented role-playing game based on the pen-and-paper RPG by FASA. It is entirely different from the SNES adaptation of the same license. In the beginning of the game, the player selects a character class for Joshua, choosing between a samurai, a decker, or a gator shaman, who specialize in combat, cyberworld, and magic, respectively. The game is fairly open-ended; the player navigates Joshua through predominantly urban overhead areas, talking to characters and gathering information. </p><p>The player can hire characters to join the party; however, only one character can be directly controlled by the player. Combat is action-based; characters can use melee weapons, firearms (with expendable ammunition), or cast magic. \"Karma\", an equivalent of experience points, is awarded for killing enemies and completing quests. Karma points can be allocated by the player manually to increase the character's parameters.</p><p>Certain characters can also enter the Matrix, a virtual network accessed through cyberterminals. Matrix navigation is done from over-the-shoulder third-person view. The player can upgrade and customize Joshua's cyberdeck, allowing him to hack through encrypted systems more easily and store data obtained from the Matrix. Nodes and ICs will try to protect the data, attacking the virtual representation of the character and trying to force him to log out of the system.</p>"},{"name":"Shane Warne Cricket","year":1996,"developer":"Audiogenic Software Ltd.","url":"d#Shane%20Warne%20Cricket%20%28U%29.zip","filesize":546752,"score":"","genres":"Sports > Diagonal-down > Cricket > Licensed","desc":"<p><em>Shane Warne Cricket</em> is the Australian version of Brian Lara Cricket '96. Besides being endorsed by a different player, this game has the rosters and statistics updated for the 97 season, and instead of featuring English county sides, it features Australian state sides.</p>"},{"name":"Shanghai II: Dragon's Eye","year":1994,"developer":"Activision, Inc.","url":"d#Shanghai%20II%20-%20Dragon%27s%20Eye%20%28USA%29.zip","filesize":552167,"score":7.9,"genres":"Puzzle > Top-down > Fixed / flip-screen > Cards / tiles > Tile matching puzzle","desc":"<p><em>Dragon's Eye</em> is an installment in the tile-matching game series initiated by Activision. Players try to remove mahjong tiles in pairs from a set pattern. Different versions of the game have up to eight different tile sets, twelve patterns based on the animals of the Chinese zodiac, and a layout editor for creating patterns.</p><p>In addition to the standard mode, the game also features \"Dragon's Eye\", a two-player Shanghai variant. Players take turns adding and removing tiles from a small field with one player attempting to remove all the tiles and the other trying to position tiles to make this impossible.</p>"},{"name":"Shaq Fu","year":1994,"developer":"Unexpected Development","url":"d#Shaq-Fu%20%28USA%2C%20Europe%29.zip","filesize":2146079,"score":5.5,"genres":"Action > Side view > Fighting > Sci-fi / futuristic > Licensed","desc":"<p>While en route to a charity game in Tokyo, basketball star Shaquille O'Neal (called \"Shaq\" for short) is drawn into an alternate dimension by a local man who believes only Shaq can save his grandson. Once there, he must fight a succession of 11 opponents, one at a time, with gameplay resembling Street Fighter 2 or Mortal Kombat.</p><p>The game's graphics used similar rotoscoping techniques (similar to those used in Flashback or Prince of Persia) making Shaq's 7'2\" frame is represented. As well as the story mode, the player can play individual fights, either with 1 or 2 players, although one human player must always be Shaq. Shaq can jump a huge distance, although he struggles to block.</p>"},{"name":"Shi-Kin-Joh","year":1991,"developer":"Scap Trust"},{"name":"Shining Force","year":1992,"developer":"Sonic Co.","url":"d#Shining%20Force%20%28USA%29.zip","filesize":1174669,"score":7.9,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Turn-based > Fantasy","desc":"<p>In a wondrous land perhaps not so far from our world, a strange and terrible series of events took place. The powers of darkness, led by Dark Dragon, fought for control of the world of Rune. Legendary warriors of light fought them with the ancient and modern weapons of the time, and drove Dark Dragon into another dimension. But Dark Dragon vowed that in a thousand years he would be able to break through the inter-dimensional barrier, back into this world. </p><p>A thousand years of peace and tranquility passed. The people of the world were happy to live their lives in contentment, able to spend time rediscovering the magical and technological wonders destroyed by Dark Dragon and using them to benefit all people. But the kingdom of Runefaust has begun a massive attack of the kingdoms of Rune - intending to help Dark Dragon return to this world. A small band of warriors has been sent out on a dangerous journey to fight against the dark forces of Runefaust.</p><p><em>Shining Force</em> is a tactical role-playing game. As the player character makes his way through the lands of Rune, he is joined by other warriors who wish to stop the forces of Runefaust. Each warrior has their own strengths and weaknesses. As the player progresses through the game the characters gain new weapons and spells.</p>"},{"name":"Shining Force II","year":1993,"developer":"Sonic Co.","url":"d#Shining%20Force%20II%20%28USA%29.zip","filesize":1503921,"score":8.1,"genres":"Role-playing (RPG) > Strategy > Top-down > Turn-based > Fantasy","desc":"<p><em>Shining Force II</em> is a strategy/RPG hybrid with cartoon-like graphics. The game is comprised of two modes: exploration, in which the hero and his companions engage in the role-playing game standard of talking to townspeople, exploring new lands, and furthering the plot; and battle mode, in which the combat is resolved from a tactical point of view, with individual combats being resolved from a close-up view with animated characters.</p><p>The plot consists of such quests as saving a princess from the clutches of demons, rebuilding the hero's hometown, and uniting the various forces of good together against the hero's nemesis. Along the way, the hero will be joined by many characters who seek to aid him in his journey. Several of these characters can only be obtained by completing side quests. In addition, random battles can occur between the programmed scenarios, giving the hero's party a chance to obtain experience and gain levels outside of the set scenarios.</p><p>There are several difficulty levels in the game, selectable when starting a new game. In addition, there is a configuration code that allows cheats to be activated, including the ability to control the enemy units.</p>"},{"name":"Shining in the Darkness","year":1991,"developer":"Climax Entertainment","url":"d#Shining%20in%20the%20Darkness%20%28USA%2C%20Europe%29.zip","filesize":628409,"score":7.5,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Fantasy","desc":"<p>This is a story-driven console-style RPG, and is the first in the three game Shining series for the Genesis (followed by Shining Force and Shining Force II). The Kingdom of Thornwood has been invaded by Dark Sol's men, and it is your job to vanquish them. You will need the Arms of Light to do this.</p><p>The game is a first person RPG, with turn-based combat and cartoony graphics. The dialogue is displayed via dialog bubbles appearing above the characters speaking, although the protagonist never speaks. There are no sub-quests - the secrets in the game involve the location and use of special metal for forging esoteric items. There are about 25 to 30 hours of gameplay to be found here, before the final battle and ending sequence.</p>"},{"name":"Shinobi III: Return of the Ninja Master","year":1993,"developer":"Megasoft","url":"d#Shinobi%20III%20-%20Return%20of%20the%20Ninja%20Master%20%28USA%29.zip","filesize":636685,"score":8.5,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>This is the sequel to The Revenge of Shinobi and the last installment of the series on the Genesis/Mega Drive. After defeating the Neo Zeed organization, the ninja Joe Musashi returns to Japan to recover from the battle. But while he's training, he senses that the Neo Zeed leaders are secretly rebuilding the organization, so he make his way back to defeat them once again</p><p>The gameplay is very similar to the previous game, a side scrolling game with platform elements. Musashi uses kunai (throwing knives) and a sword as weapons and can upgrade their power by picking up power-ups inside crates. Inside those crates he will also find extra lives, health, kunai (5 or 20), ninjitsu, and time bombs that will explode in 5 seconds or immediately if touched. As in the previous game, he can jump or double jump, and while double jumping he can throw a burst of kunai in several directions. However, this game adds new movements to Musashi's repertoire: he can block enemy projectiles after shooting a kunai, he can drop-kick enemies while jumping (after which he will bounce, allowing for connecting more drop kicks), he can dash and slash enemies with his sword, and he can perform wall jumps (or kabekeri). Besides the physical attacks, four ninjitsu are available: Ikazuchi (temporary invincibility), Kariu (whole screen fire attack), Fushin (higher jumps) and Mijin (self-destruction that costs one life but deals high damage to all enemies on screen).</p><p>The game is divided seven rounds, each subdivided in 2 parts with a boss at the end of each part (except for the last round, with only one final boss). Most levels feature horizontal scrolling from left to right, but some levels will also feature vertical scrolling. There are three forced scrolling levels: two horizontal (one in which Musashi rides a horse, one where he rides a surfboard) and one vertical (where he must keep climbing falling rocks). While most levels are straightforward (go from left to right and find the exit), many will feature hidden items in less obvious paths, and one entire part of a round is a maze divided in several smaller sections separated by doors; entering the wrong door leads you back to a previous section.</p><p>The game features four difficulty levels. In normal difficulty, the player has 3 lives and 3 continues. The game rewards the player for different playing styles. Beating a level without using kunai or ninjitsu, for instance, grants extra points. An extra life is gained for each 50.000 points scored.</p>"},{"name":"Ship","year":1990,"developer":"Technopop, Inc.","url":"d#Ship%20%28World%29%20%28Proto%29.zip","filesize":29173,"score":"","genres":"","desc":""},{"name":"Shōgi no Hoshi","year":1991,"developer":"Home Data Corp."},{"name":"Shove It! The Warehouse Game","year":1990,"developer":"NCS Corporation","url":"d#Shove%20It%21%20...The%20Warehouse%20Game%20%28USA%29.zip","filesize":48750,"score":6.9,"genres":"Puzzle > Top-down > Direct control","desc":"<p><em>Shove It! The Warehouse Game</em> is a top-down puzzle game based on the original gameplay of Soko-Ban Hiroyuki Imabayashi wrote for Thinking Rabbit. The player controls Stevedore, a warehouse keeper, from a top-down view. As shown on the title screen, shoving boxes will earn him money to make his dreams come true, a lovely girlfriend and a fiery red sports car.</p><p>The game consists of 16 stages with 10 rounds each. At a certain stage, any of the 10 rounds can be selected while playing but a new stage will only be opened up when all rounds have been successfully completed. To complete a round, Stevedore needs to push all boxes on the designated spots. This will turn them into a different colour. This is no easy task as the level design will obstruct many moves and cornered boxes can no longer be moved. While playing it is possible to restart the round, undo the last step and the game keeps track of the number of steps taken.</p><p>The game supports passwords and includes an edit mode where new levels can be designed and played.</p>"},{"name":"Show do Milhão","year":2001,"developer":"Tec Toy S.A."},{"name":"Show do Milhão Volume 2","year":2001,"developer":"Tec Toy S.A."},{"name":"Shuihuzhuan","year":1996,"developer":"Chuanpu Technologies"},{"name":"Shura no Mon","year":1992,"developer":"SIMS Co., Ltd."},{"name":"Side Pocket","year":1992,"developer":"Data East Corporation","url":"d#Side%20Pocket%20%28USA%29.zip","filesize":472392,"score":7.1,"genres":"Simulation > Sports > Top-down > Fixed / flip-screen > Turn-based > Direct control > Pool / snooker > North America","desc":"<p>The main objective is to sink balls in each level and reach the predetermined scores to go ahead. But remember: you'll have only several \"lives\" and every error can be lethal. After each stage completed (and some luck), a bonus stage will appear, as well as the chance to earn extra balls. You will only need a good target in the parquet block!</p><p>Basic version differences:</p><ul><li>The original Arcade version is a pool game where the player competes against the timer trying to get all balls in pockets and earn points.</li><li>The later NES release introduces modes for 2 players with two variants: 2P Pocket Game (the traditional mode) and 2P 9-Ball Game, where the premise is to sink 9 balls before the other player makes them first, training mode and single-player Pocket game. In 1P Pocket game the player needs to clear four levels with alternating ball layouts (i.e. reaching a predetermined number of points by sinking consecutive shots and sinking balls in numerical order), starting from City class and all the way to the World Class. Starting from State class, the player needs to perform a special trick after beating a level, and if they fail, the level restarts with a different ball layout.</li><li>Game Boy version is a completely redrawn game featuring 1 or 2 players actions with two game modes: 9-ball and Pocket. The Pocket mode is generally similar to NES version.</li><li>Genesis and SNES versions feature improved graphics and sound. Pocket game mode is reworked to include more stages and trick shot layouts. Also in this mode the player travels to different cities in the U.S.A. and claims championship there. New modes are Trick game and Jukebox. Game Gear version of *Side Pocket* is basically a toned-down Genesis version.</li><li>“Side Pocket” for Wonder Swan features one and two-player play on a single device. In the single-player mode the player chooses an avatar from a menu and needs to beat the remaining opponents. The player and CPU then take turns in hitting the ball.</li></ul>"},{"name":"Simpsons, The: Bart vs. the Space Mutants","year":1992,"developer":"Imagineering Inc.","url":"d#Simpsons%2C%20The%20-%20Bart%20vs.%20the%20Space%20Mutants%20%28USA%2C%20Europe%29.zip","filesize":204639,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy > Licensed","desc":"<p><em>Bart vs. The Space Mutants</em> is a platform game where the player goes into the role of Bart Simpson (from the TV show The Simpsons) and must stop the Space Mutants from invading Springfield.</p><p>On each of the five levels, Bart must collect (or get rid of) the ingredients that the Space Mutants are planning to use to build their machine, such as purple objects or balloons. He also has to collect enough \"proof\" of the aliens existence (brown coins left behind when they are jumped on), so his family members will help him when he meets a boss (characters such as Nelson and Sideshow Bob). This won't be easy since the Space Mutants are \"using\" human bodies as disguise. In order to discover who are the real Space Mutants, Bart must use his X-ray Specs.</p><p>The ways Bart can get rid of those objects sought by the Space Mutants are numerous. For instance, in the first stage, Bart must get rid of purple objects. He can dye them red, cover them, wash them, etc. Some even involve a little puzzle solving, like playing a trick on Moe to make him get out of the bar.</p><p>Bart also has some coins that can be used in many ways throughout the game, like buying things, getting devices operating, etc. Those coins are essential to solve some puzzles in the game.</p>"},{"name":"Simpsons, The: Bart's Nightmare","year":1993,"developer":"Sculptured Software, Inc.","url":"d#Simpsons%2C%20The%20-%20Bart%27s%20Nightmare%20%28USA%2C%20Europe%29.zip","filesize":644135,"score":6.3,"genres":"Action > Side view > Top-down > Arcade > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>Bart Simpson has to stay up late and write a paper for class tomorrow. For once, he is determined to get a good mark. However, very quickly, he falls asleep. Nightmare after nightmare haunt his subconsciousness, and it is up to you to get over each one, so that Bart will eventually wake up. </p><p><em>Bart's Nightmare</em> is an action game based on the TV cartoon show <em>The Simpsons</em>. The player navigates Bart through the side-scrolling overworld, collecting pages of his homework while avoiding various enemies modeled after characters from the show. For example, his sister Lisa would occasionally turn him into a frog, Principal Skinner may force him to wear a Sunday school uniform (slowing his movement), etc. Bart can repel enemies by blowing a bubble gum at them. </p><p>Once a homework page has been found, the player can step through colored doors and engage in various mini-games. These involve Bart transforming into a \"Bartzilla\", a giant monster out to destroy Springfield; swimming through Bart's own bloodstream, using air pumps to kill germs; being attacked by Itchy and Scratchy, the duo from the meta-fictional violent cartoon; flying over the city as the superhero Bartman, fighting boss enemies; and exploring the treacherous columns in the Temple of Maggie as Indiana Bart.</p>"},{"name":"Skeleton Krew","year":1995,"developer":"Core Design Ltd.","url":"d#Skeleton%20Krew%20%28USA%29.zip","filesize":789285,"score":7,"genres":"Action > Diagonal-down > Isometric > Shooter > Sci-fi / futuristic","desc":"<p>The game takes place in the year 2062. A baddy named Moribund Kadaver has assumed control of a cryogenics plant near Monstro City. Kadaver is apparently a former mortician who has dabbled in cryogenics ever since he purchased Deadly Enforcement Aggressive Destruction Incorporated, aka DEAD Inc. Now he has the power to unleash mutants called Psykogenix on the population of Monstro City! The Military Ascertainment Department (MAD) has decided to call upon the world's most vicious mercenaries: the Skeleton Krew.</p><p><em>Skeleton Krew</em> has you choosing between three members of the deadly organization: Spine, Joint, and Rib. The object of the game is to make it through four planets on your way to stop Kadaver's nefarious plans.</p><p>The areas include Earth, Mars, Venus and finally the Psykogenesis Planet, where you will infiltrate DEAD HQ. A second player can join in for simultaneous play, and you can continue your game via passwords. Skeleton Krew features three difficulty levels.</p>"},{"name":"Skitchin'","year":1994,"developer":"Electronic Arts Canada","url":"d#Skitchin%27%20%28USA%2C%20Europe%29.zip","filesize":1012838,"score":7.4,"genres":"Racing / Driving > Sports > Behind view > Tricks / stunts","desc":"<p>You rollerblade (inline skate) down the road, grabbing tows from passing cars. Grab weapons to beat back your opponents. Race from city to city to earn money. Buy better skates, weapons, and protection with your winnings. This game is clearly derived both in technology and in design from the hit Road Rash series, and was released during the great rollerblading boom of the early-to-mid nineties.</p>"},{"name":"Slam Dunk: Kyōgō Makkō Taiketsu!","year":1995,"developer":"SIMS Co., Ltd."},{"name":"Slam: Shaq vs. the Legends","year":2008,"developer":"Electronic Arts, Inc.","url":"d#Slam%20-%20Shaq%20vs.%20the%20Legends%20%28USA%29%20%28Proto%29.zip","filesize":973139,"score":"","genres":"","desc":""},{"name":"Slap Fight MD","year":1993,"developer":"M.N.M Software"},{"name":"Slaughter Sport","year":1990,"developer":"Brian A. Rice, Inc.","url":"d#Slaughter%20Sport%20%28USA%29.zip","filesize":352544,"score":6.3,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p><em>Tongue of the Fatman</em> is an eclectic fighting game. Choose from different alien races (including Human) with different abilities and fighting styles, purchase weapons and devices, and fight your way through multiple opponents to face the Fatman. Some of the features include being able to place wagers on the outcome of the fight, and the phenomenon of a special move being less powerful the more you use it to balance gameplay. Two-player, head-to-head combat is supported.</p>"},{"name":"Smart Mouse","year":1994,"developer":"","url":"d#Smart%20Mouse%20%28World%29%20%28Unl%29.zip","filesize":142574,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Puzzle elements","desc":"<p><em>Smart Mouse</em> is a single-screen maze action game with puzzle elements. The player controls a mouse who must navigate a maze filled with enemies. The mouse can push the blocks which make up the maze walls; a moving block will keep moving until it hits another block, and crush every enemy in its path. After squashing the last enemy in a level, the player moves on to the next. There are a total of 100 levels, and the player is able to save their progress using passwords.</p>"},{"name":"Smurfs Travel the World, The","year":1996,"developer":"Virtual Studio","url":"d#The%20Smurfs%20Travel%20the%20World%20%28U%29.zip","filesize":808701,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Night falls at the Smurf Village. Inquisitive Smurf brings Smurfette along to Papa Smurfs' laboratory to see the Magic Crystal that allows them to travel to anywhere in the world, but suddenly Smurfette breaks it, and they are gone! Now they must face the challenges in all continents in order to retrieve all shards of the Crystal and return home.</p><p>A classic platformer, this title allows the player to choose between Inquisitive Smurf and Smurfette (there are no differences between characters) and collect all 10 shards scattered on the playfield.  There is a larger emphasis on exploring the levels rather than killing enemies (no score is given for them), so they can be avoided in most occasions, but if the needs arise, be dealt with a kick or in Mario fashion by jumping over them. Some shards can only be obtained by jumping on an enemy, using the sprint jump or using the scenario (ropes, or vines). While large falls don't harm the Smurfs, improper contact with enemies does. Each 1-up has four hearts, and at the fifth contact a life is lost and the player must restart the level. Once all lives are lost, the game is over - there are no continues. To fill the meter there are hearts and small Smurf icons scattered or hidden somewhere in the level, and on all stages there's a key that unlocks a bonus level if all three are collected at the end of the continent. In these bonus levels the player collects as much objects as possible which translate into hearts when the time closes. If the player fills the meter, a 1-up is awarded.</p>"},{"name":"Smurfs, The","year":1994,"developer":"Infogrames Europe SA","url":"d#The%20Smurfs%20%28U%29.zip","filesize":692923,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Free the Smurfs before Gargamel smurfs then all!Platform game where you will be able to play with the jockey smurf, the brainy smurf, the greedy smurf and the hefty smurf to resolve the adventure.All of the classic SMURF characters are along for the adventure, guaranteeing you a Smurf-tastic time.</p>"},{"name":"Snake Rattle N Roll","year":1993,"developer":"Rare Limited"},{"name":"Snow Bros. Nick & Tom","year":1993,"developer":"Toaplan Co., Ltd.","url":"d#Snow%20Bros.%20-%20Nick%20%26%20Tom.zip","filesize":380920,"score":7.2,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform > Direct control > Fantasy","desc":"<p>Nick and Tom are two Princes living the dream with two beautiful princesses. When suddenly the evil King Scorch freezes Prince Nick and Tom and kidnaps the Princesses. Now Nick and Tom find themselves with abilities dealing with snow and ice. These two Snow Brothers will need to hunt down the evil King Scorch and rescue the princesses.</p><p><em>Snow Bros.</em> is a fixed-screen platform game where players must defeat all enemies on each level (screen), 50 altogether. The Snow Bros use snow as their weapon, throwing it at the enemies to stun them. When lots of snow is thrown at an enemy, it becomes covered in a flurry and unable to move. These can be rolled into giant snowballs and pushed or kicked into other enemies. If left alone, enemies will eventually defrost and become angry at the player. The enemy filled snowballs are a much stronger weapon then the regular handful of snow and are the only effective weapon Nick and Tom have against the bosses.</p>"},{"name":"Socket","year":1993,"developer":"Vic Tokai Corporation","url":"d#Socket%20%28USA%29.zip","filesize":425648,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p><em>Socket</em> is a fast-paced platform game in the vein of Sonic the Hedgehog. The evil overlord Time Dominator has constructed a time machine and is using it to steal treasures from the past, creating a warp in the flow of time. The Time Warp Patrol, created to prevent this sort of thing from happening, sends the special time-traveling duck Socket (or Minutes in the Japanese version) to fix the flow of time and stop Time Dominator.</p><p>Socket has reasonably basic abilities: he can jump, kick to the side or straight upward, and run quite fast. As Socket is a robot, his energy level continually drains from simply being in operation; thankfully, there are a liberal amount of electric bolts strewn about each stage, which will refill his health when picked up. Getting hit by enemies will take a chunk out of his life bar.</p><p>There are seven different themed zones, each with four separate parts. First up is the High Speed Zone, which is a gateway level leading to the next zone, and as the name suggests it encourages high speed play. Next is the Athletic Zone, which generally entails lots of jumping, and the Labyrinth Zone, which is focused on exploration and simply finding a path to the exit. At the end of each Labyrinth Zone, Socket faces off against Time Dominator in a boss round, then moves on to the next High Speed Zone.</p><p>The game also features a sound test mode and a time trial mode, where the High Speed Zone stages can be played without any enemies present with times being recorded.</p>"},{"name":"Sol-Deace","year":1992,"developer":"Wolf Team","url":"d#Sol-Deace%20%28USA%29.zip","filesize":371239,"score":7,"genres":"Action > Side view > 2D scrolling > Shooter > Space flight > Sci-fi / futuristic","desc":"<p><em>Sol-Feace</em> (<em>Sol-Deace</em> in the Genesis) is a typical 2D shooter with weapon powerups. The game features six levels: Sirius, Enemy Arsenal, ArtifiStar, Pluto Base, Almathea, and Final Battle. </p><p>Along the way various weapons can be picked up including plasma bullets, double plasma bullets, lasers, and missiles.</p><p>The most unique feature of the game is that you can realign your upgraded guns to fire front-back, up-down, tight spread, wide spread or whatever the current situation required.</p>"},{"name":"Soldiers of Fortune","year":1993,"developer":"The Bitmap Brothers","url":"d#Soldiers%20of%20Fortune%20%28USA%29.zip","filesize":808114,"score":7.6,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Direct control > Steampunk","desc":"<p>A time traveler from the future was stranded in Victorian England, and his knowledge of yet unknown technological inventions was passed to the Royal Society, headed by Baron Fortesque. With the help of this knowledge, Fortesque managed to construct an immensely complex artificial intelligence known as the Chaos Engine. However, creation rebelled against its creator, assimilated its mind, and turned Britain into a war zone populated by mad machines. Mercenaries are willing to enter this dangerous place and put an end to the chaos, hoping for an appropriate reward.</p><p><em>Chaos Engine</em> (<em>Soldiers of Fortune</em> in the US) is a run-and-gun overhead shooter. Sixteen levels (in four groups of four) await the players in the game. The basic gameplay is similar to Gauntlet, but in an open-air setting, with bridges across rivers and other features in the maps. The visuals are in the 'metallic and blue' style Bitmap Brothers appeared to favor.</p><p>There are six characters available in the game, each with different strengths and weaknesses, and different starting prices. In two-player mode, each player chooses a character and plays co-operatively, but in one-player games, the player also chooses a character for the computer to control, with its artificial intelligence allowing it to open doors, pick up power-ups and take on enemies away from the ones occupying the player-controlled character.</p>"},{"name":"Sonic & Knuckles","year":1994,"developer":"SEGA Enterprises Ltd."},{"name":"Sonic 3 Complete","year":2013,"developer":"Sonic Team","url":"d#Sonic%203%20Complete.zip","filesize":2251927,"score":"","genres":"","desc":""},{"name":"Sonic 3D Blast: Director's Cut","year":2017,"developer":"Jon Burton","url":"d#Sonic%203D%20Blast%20-%20Director%27s%20Cut%20%28World%29%20%28Unl%29.zip","filesize":2527769,"score":"","genres":"Platform","desc":"<p>Sonic 3D: Director's Cut is a hack of Sonic 3D: Flickies' Island made by Jon Burton, founder of Traveller's Tales and the game's original programmer, with the goal of expanding the game with new content to increase replayability and to fix long-standing issues that the game has been criticized for. The project was first announced on Jon Burton's YouTube channel, GameHut, on October 12, 2017, and update videos were uploaded on a basis.</p><p>A public beta test was released as an expo entry during the 2017 Sonic Hacking Contest for players to try out the game and report bugs or suggest times for the new Time Challenge mode. The finished version was eventually released on December 23, 2017 as an xdelta patch and as a download on the Steam Workshop for owners of Sonic 3D on Steam.</p>\r"},{"name":"Sonic 3D Blast: Flickies' Island","year":1996,"developer":"Traveller's Tales (UK) Ltd.","url":"d#Sonic%203D%20Blast%20~%20Sonic%203D%20Flickies%27%20Island%20%28USA%2C%20Europe%2C%20Korea%29.zip","filesize":2614027,"score":6.9,"genres":"Action > Diagonal-down > Isometric > Arcade","desc":"<p>While visiting Flicky Island, Sonic notices that the Flickies, his small, feathered friends that can travel between parallel worlds, were captured and turned into badniks (the robot enemies of Sonic) by Dr. Robotnik in his never-ending quest for the Chaos Emeralds. Seven levels separate Sonic from the final showdown with Robotnik.</p><p><em>Sonic 3D</em> was the last Sonic title released for the Mega Drive, the only platforming presence of the blue blur in the Sega Saturn, and one of his rare appearances in Personal Computers. The title, considering the era it was released, is somewhat misleading, as instead of full blown 3D graphics it uses an isometric view where Sonic can move not only forwards and backwards, but also left and right. </p><p>Gameplay is much slower when compared to other games in the series, and the number of badniks is reduced to five in each section. As usual, when Sonic destroys one badnik, an animal leaps free from its insides, but this time Sonic has to pick him up and lead them to an interdimensional ring. While they can be taken one by one, exploring the level with all five allow the player to reach for otherwise inaccessible continue tokens. Unlike all other previous games, time isn't a requirement: if the player completes a level in more than 10 minutes, it would only mean there would be no time bonus at the end. Finally, to collect all seven Chaos Emeralds, Sonic first must find Tails or Knuckles and offer them at least 50 rings.</p>"},{"name":"Sonic 3D Blast: Part One","year":1996,"developer":"Traveller's Tales (UK) Ltd."},{"name":"Sonic 3D Blast: Part Two","year":1996,"developer":"Traveller's Tales (UK) Ltd."},{"name":"Sonic Classic Heroes","year":2013,"developer":"","url":"d#Sonic%20Classic%20Heroes.zip","filesize":1333750,"score":"","genres":"Action > Platform","desc":"<p>The hack is built on Sonic 2’s engine, which has been enhanced by both flamewing and ColinC10 to have new features.</p>"},{"name":"Sonic Classics","year":1995,"developer":""},{"name":"Sonic Compilation: Sonic Classics","year":1991,"developer":"","url":"d#Sonic%20Compilation%20~%20Sonic%20Classics%20%28USA%2C%20Europe%2C%20Korea%29%20%28Rev%20A%29.zip","filesize":1723113,"score":"","genres":"","desc":"<p>Three games: Sonic the Hedgehog, Sonic the Hedgehog 2 and Dr. Robotnik's Mean Bean Machine.</p>"},{"name":"Sonic Eraser","year":1991,"developer":"SEGA Enterprises Ltd."},{"name":"Sonic the Hedgehog","year":1991,"developer":"Sonic Team","url":"d#Sonic%20The%20Hedgehog%20%28USA%2C%20Europe%29.zip","filesize":386937,"score":8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform","desc":"<p><em>Sonic the Hedgehog</em> is the first of many games starring Sega's premier hedgehog, Sonic. It's a side-scrolling platform game with a difference: speed. Sonic rushes through levels with incredible speed, allowing him to traverse loops and jumps with ease. </p><p>The plot of the game is simple. The evil Dr. Robotnik has captured many of Sonic's animal friends and trapped them inside robots. Fortunately, Sonic can free his friends by destroying the robots with his spin attack. Meanwhile, Dr. Robotnik is trying to control the all-powerful chaos emeralds. Sonic must grab them before he does in the 3D rotating bonus levels. </p><p>Sonic's weapon is his spin attack; while jumping, Sonic destroys hostile robots by touch. Throughout the platforming levels, Sonic collects numerous rings. If Sonic is hit by an enemy, all the rings he's carrying fall out and scatter around; Sonic can quickly grab the rings back before they disappear. If Sonic is hit while not carrying any rings, he dies. Collecting 100 rings gives Sonic an extra life. There is also an invincibility bonus which temporarily protects Sonic from all attacks. </p><p>The game is divided into several \"zones\", each of them containing three levels. At the end of each zone, Sonic confronts Dr. Robotnik in a boss fight.</p>"},{"name":"Sonic the Hedgehog 2","year":1992,"developer":"Sonic Team","url":"d#Sonic%20The%20Hedgehog%202%20%28World%29.zip","filesize":749652,"score":8.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform","desc":"<p><em>Sonic the Hedgehog 2</em> is a side-scrolling platformer based around speed, and the sequel to Sonic the Hedgehog. Like the original, players run through different worlds called \"zones\", which each have their own specific theme. There are two Acts in nearly all of the 10 Zones, and at the end of each Zone's last Act is a machine that Robotnik controls, which you must defeat to progress. The evil Dr. Robotnik wants to conquer the world. In order to do that, he imprisons and transforms all animals into robots called \"Badniks\". This way they can build his powerful weapon, the Death Egg. Only Sonic the Hedgehog, and his new tagalong partner, Miles 'Tails' Prower, can stop Robotnik and his army of Badniks from taking over the world. </p><p>Sonic and Tails can collect rings which are scattered throughout all of the levels. As with most platformers, when the player collects 100 rings, they earn an extra life. However, the rings also act as protection; if Sonic is hurt when he is carrying rings, they scatter everywhere and he is briefly invincible. If he is hit again when he has no rings, he'll lose a life. If the player reaches a continue point lamppost with 50 or more rings, they'll be able to access the Special Stage. In this stage, you must gather a set amount of rings in a halfpipe-like stage before you reach a checkpoint. Complete all the checkpoints and you'll earn one of the seven Chaos Emeralds.</p><p>New to <em>Sonic the Hedgehog 2</em> is the ability to play the game co-op with a friend - at any time, a player can plug in a second controller and take over the AI-controlled Tails. Tails has infinite lives and the camera remains focused on Sonic, meaning that Tails will not hinder play. Sonic (and Tails) can now also get speed from a standing start by holding down and repeatedly pressing the jump button for a \"spin dash\". This is useful when stuck near steep slopes or other areas where you need some momentum. The game also features a 2-player versus mode. This mode is a horizontally split-screen race through levels based on three of the zones in the single-player game.</p><p>The mobile version (iOS/Android) contains ten new levels in a new environment called Hidden Palace Zone, a boss attack mode, upgraded graphics, faster frame rate, a re-mastered soundtrack, and Knuckles as a third playable character.</p>"},{"name":"Sonic the Hedgehog 3","year":1994,"developer":"Sonic Team","url":"d#Sonic%20The%20Hedgehog%203%20%28USA%29.zip","filesize":1254595,"score":8.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform","desc":"<p>Dr. Robotnik's Death Egg has crash-landed on Floating Island, so called because it harnesses the power of the Chaos Emeralds to float in the air. Robotnik needs them to repair the Death Egg, so he tells the guardian of Floating Island, Knuckles the Echidna, that Sonic and Tails are there to steal them. With Knuckles tricked and trying to stop the heroes at every turn, will they be able to stop Robotnik in time?</p><p><em>Sonic the Hedgehog 3</em> is the third in the Sonic series of games. As with the previous games, it is a side-scrolling platformer based around speed. The basic game remains the same - players collect rings to earn extra lives, which are also used for protection, and scatter everywhere when Sonic is hurt. Sonic can jump on enemies to defeat them, and Spin Dash by holding down and the jump button, then letting go of down.</p><p>New to <em>Sonic 3</em> are three different types of shields - the Fire Shield (which protects you from fire but disappears if you enter water), the Water Shield (which lets you breathe underwater infinitely) and the Electric Shield (which pulls nearby rings towards you). Sonic can use extra abilities when he has these shields by pressing jump while in the air - either a horizontal fireball dash, a vertical bubble bounce, or an electric double jump. If Sonic has no shield active, he can activate a brief energy shield, also by pressing jump in the air. Tails cannot use the shields' special abilities, but he can instead either fly or dog paddle (in water) for a limited time. He can also carry Sonic with him while doing so.</p><p>There are now two types of bonus stages - one is available by collecting 50 or more rings, running past a checkpoint lamppost and then jumping into the stars (as you could in Sonic the Hedgehog 2. This stage give you the chance to earn bonus rings, lives and power-ups. In this stage, there is a giant gumball machine. By hitting the crank, you'll spit out a bonus item that can either be rings, lives or bonus shields. The stage is over when you fall down the bottom of the screen.</p><p>The other, more important, Special Stage can be accessed by jumping into giant rings that are hidden away in secret areas in each level. In these stages, you must collect all the blue spheres while avoiding the red ones (which end the stage early). Collecting all of the outer blue spheres around square or rectangle sphere formations will turn them all into rings - if you collect 50 or more in this stage, you can earn a continue. Once you collect all the blue spheres in the stage, it clears and you earn one of the seven Chaos Emeralds.</p><p><em>Sonic 3</em> features six different Zones, which are made up of two Acts. At the end of each Act is a boss that must be defeated to complete the stage and rescue Sonic's animal friends that Robotnik has captured to turn into Badnik robots. The zones in <em>Sonic 3</em> are approximately three times bigger than those in <em>Sonic 2</em>, and feature multiple, branching paths.</p><p>As with <em>Sonic 2</em>, there is a two-player Vs. Mode, which plays in a split-screen horizontal style. There are special monitor pick-ups in this mode which do things like swap player positions, lose rings, or cause a Badnik to appear. You can also race against the clock in a time trial mode.</p>"},{"name":"Sonic the Hedgehog 3 & Knuckles","year":2011,"developer":"Sonic Team","url":"d#Sonic%20%26%20Knuckles%20%2B%20Sonic%20The%20Hedgehog%203%20%28USA%29.zip","filesize":2540247,"score":"","genres":"Action > 3rd-person (Other) > Side view > Platform","desc":"<p><em>Sonic 3 and Knucles</em> is the Genesis version of the game Sonic &amp; Knuckles where it could be combined with the cartridge of Sonic the Hedgehog 3 through lock-on technology to get a different game. This is a digital release of the combined version as originally intended. The player first goes through <em>Sonic 3</em> and then through <em>Sonic &amp; Knuckles</em> as any of the three characters: Sonic, Knuckles or Tails. It also has small changes to the level design to fit all three characters. The combined version allows the characters to collect all super emeralds to have them transform in Hyper Sonic, Hyper Knuckles and Super Tails respectively, each with their own special ability, which is not possible in the two games separately.</p><p>Even though other platforms have previously offered this version of the game as part of a compilation, or combining two digital releases, this is the first time this version of the game has been released independently.</p>"},{"name":"Sonic the Hedgehog: Spinball","year":1993,"developer":"Sega Technical Institute","url":"d#Sonic%20Spinball%20%28USA%29.zip","filesize":526856,"score":7.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Pinball > Platform","desc":"<p>The evil doctor Robotnik has a new plan to take over the world. He has built a new weapon, the Veg-O-Fortress on Mount Mobius and with it, he is transforming all creatures into robots. Sonic sneaks into the fortress and tries to stop Robotnik.</p><p>Use Sonic as a pinball in 4 dangerous levels. Score points, get rings, collect Chaos Emeralds and destroy the boss at the end of each level.</p>"},{"name":"Sorcerer's Kingdom","year":1992,"developer":"Technical Wave","url":"d#Sorcerer%27s%20Kingdom%20%28USA%29.zip","filesize":425193,"score":"","genres":"Role-playing (RPG) > Strategy > Top-down > Turn-based > Fantasy","desc":"<p><em>Sorcerer's Kingdom</em> is a mix of RPG and strategy game. You play a young adventurer, who is sent out by the king to find out the reason for the increasing number of monsters that threaten the land and restore peace to the kingdom. Starting out as an Adventurer you are eventually given higher titles by the king, as a reward for completing quests. </p><p>The game plays like a typical RPG but the battles are a little unusual. Whenever you are attacked or attack a monster that is within your current range, a turn-based battle starts immediately without taking you to a separate fighting area, and you have to fight all enemies that were visible the moment the battle started.</p>"},{"name":"Sorcerian","year":1990,"developer":"Nihon Falcom Corp."},{"name":"Space Foxes","year":2016,"developer":"Bit Pop"},{"name":"Space Harrier II","year":1988,"developer":"SEGA Corporation","url":"d#Space%20Harrier%20II%20%28World%29.zip","filesize":298947,"score":6.3,"genres":"Action > Behind view > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>Space Harrier II follows (very closely) in the footsteps of its predecessor and involves you (a Space Harrier) going off to save \"Fantasy Land\". This combined with the many flashing gaudy colors the game throws at you leads me to believe that it was born out of a bad acid trip.</p><p>There are 13 stages to complete by jetting around and blasting bad guys and bosses as they approach. The game is played from behind the main character and the landscape rushes up in 3D similar to the effect used in many car games such as Outrun.</p><p>The game uses many of the enemies and bosses from the first Space Harrier, but adds an array of new ones as well.</p>"},{"name":"Space Invaders '91","year":1990,"developer":"Taito Corporation","url":"d#Space%20Invaders%20%2791%20%28USA%29.zip","filesize":107017,"score":6.4,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Space Invaders '91</em> is just like Super Space Invaders for other platforms, but still different from those. This version differs from <em>Super Space Invaders</em> in that there are no cutscenes, there is only one mode of play as opposed to SSI's two, and there is no stage select.</p>"},{"name":"Sparkster","year":1994,"developer":"Konami Co., Ltd.","url":"d#Sparkster%20%28USA%29.zip","filesize":630703,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Sparkster</em> is the sequel to Rocket Knight Adventures and is completely different from the contemporary SNES title Sparkster. It takes place immediately after the events of the first game. The interactive introduction scene shows Sparkster picking up a new sword after the final fight when his nemesis Axel Gear appears, the rocket knight gone evil. After a fight in giant robots, Sparkster manages to save Princess Cherry and returns her to the queen. Then suddenly Axel appears again and he kidnaps her. It turns out Axel is working once more for the Empire of Gedol. Sparkster has to return the peace in Kingdom of Zebulos, save the princess and bring an end to the evil empire.</p><p>The game consists of six levels with 2D side-scrolling platformer gameplay. The opossum Sparkster can move around, jump and attack with his sword. Using his rocket pack, he can also perform stronger attacks and burst through the air in different directions. The rocket power consists of a double meter that refills gradually, making it possible to perform successive attacks in the air, ricocheting off walls. The first meter allows for the strongest attacks, but fills more slowly. Sparkster collects diamonds, apples to restore health and different types of power-ups for his sword. Most levels have typical platform gameplay, but there is also a level where Sparkster walks around in a giant robot, knocking enemies out of the air.</p><p>For an additional challenge players can locate the seven swords hidden throughout the levels. When all of them have been found, the hero turns into Golden Sparkster. The game includes a password system.</p>"},{"name":"Speedball 2: Brutal Deluxe","year":1991,"developer":"The Bitmap Brothers","url":"d#Speedball%202%20-%20Brutal%20Deluxe%20%28USA%29.zip","filesize":257084,"score":7.2,"genres":"Action > Sports > Top-down > Sci-fi / futuristic","desc":"<p>Brutal Deluxe doesn't live up to their name - in fact they're the worst team Speedball has ever seen. As their manager, it is your job to transform their fortunes. As well as the league system, which consists of 2 8-team divisions and challenges you to advance to the top, there are also 2 cup tournaments, one of which is played out over 2 'legs' with the aggregate score deciding who progresses.</p><p>You can play the matches as well, which is the real meat of the game. They consist of 2 90-second periods, and the gameplay is futuristic, fast, and frantic, with heavy tackling encouraged to retrieve the ball. Power-ups and tokens appear on the pitch, including ones to make your players extra-tough or freeze the opponents.</p><p>The sides of the pitch each include a score multiplier, which you can run the ball through to increase the value of your scoring - the opposition can sometimes immediately grab the ball and nullify this. There are also 5 stars which are worth 2 points each if you hit them (more if you have the multiplier activated), but these can also be canceled out by the opposition hitting the same star, and their points values only become set after the half. Next to the stars, there are portals, which throw the ball out the opposite side of the pitch, in the direction it was going.</p><p>You get money for the results, and by collecting the silver tokens which appear on the pitch at random intervals. Between each match, you can spend these either on improving your existing players as far as they can go or on buying better ones and fitting them into the team. Your original players can only be improved to a certain extent, so remembering where your signed players are and making use of them is important.</p><p>A variety of tokens also appear during the match, some of which boost your team's power for a short period of time, and one freezes the opposition.</p>"},{"name":"Spider-Man","year":1995,"developer":"Western Technologies Inc.","url":"d#Spider-Man%20%28World%29%20%28Sega%29.zip","filesize":387982,"score":6,"genres":"Action > Side view > 2D scrolling > Direct control > Fantasy > Licensed","desc":"<p>While this version of <em>Spider-Man</em> features the same story and similar gameplay to the SNES version, the game has completely different levels.</p>"},{"name":"Spider-Man","year":1991,"developer":"Technopop, Inc.","url":"d#Spider-Man%20%28World%29%20%28Sega%29.zip","filesize":387982,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>One of the biggest criminal masterminds of the city, Wilson Fisk, a.k.a. The Kingpin, has pulled off the ultimate plot. He announces to New York that a bomb has been planted somewhere around the city, and that it will detonate in 24 hours. To make matters worse, he lays the blame on Spider-Man, and now the webslinger is on his own, and on the run from the police. Spidey smells a rat, and he knows what he must do.</p><p>Spider-Man has 24 hours to find and disarm the bomb. He must also clear his name, so he takes his camera to take convincing photos for his Spider-Man hating boss, J. Jonah Jameson, and the police, to prove his innocence. Along the way, he may also run into a few of his old foes, including Dr. Octopus, Electro, The Lizard, The Sandman, The Hobgoblin, Venom and ultimately The Kingpin himself.</p>"},{"name":"Spider-Man / Venom: Maximum Carnage","year":1994,"developer":"Software Creations Ltd.","url":"d#Spider-Man%20.%20Venom%20-%20Maximum%20Carnage%20%28World%29.zip","filesize":964336,"score":6.7,"genres":"Action > Beat 'em up / brawler > Fighting > Platform > Licensed","desc":"<p>Loosely based on the comic book series, the story opens as Carnage breaks out of the insane asylum and wreaks mayhem. Spiderman immediately acknowledges the new job at hand and sets out to stop him.</p><p>You start off with Spidey but in certain parts you get to choose between him and Venom, which takes you through an alternate routes. The gameplay is your standard beat-em-up, the regular punching and jump-kicking, with the addition of the all important webbing - ie web swinging, web shield etc.</p>"},{"name":"Spider-Man / X-Men: Arcade's Revenge","year":1993,"developer":"Software Creations Ltd.","url":"d#Spider-Man%20X-Men%20-%20Arcade%27s%20Revenge%20%28USA%2C%20Europe%29.zip","filesize":455200,"score":6.3,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Spider-Man and members of the X-Men have teamed up in this side-scrolling action game to fight against Arcade, who has built a giant amusement park for the sole purpose of trapping and destroying the super-heroes. You first play as Spider-Man, who sees the X-Men get kidnapped by Arcade and follows them. Once you make it inside Arcade's park you can choose to play as Spider-Man, Cyclops, Storm, Gambit, or Wolverine, each of whom are trapped in a different part of Arcade's maze of deadly traps. You must navigate all five of them safely out, using their different skills and abilities while defeating baddies and bosses along the way.</p>"},{"name":"Spiritual Warfare","year":1994,"developer":"Wisdom Tree, Inc.","url":"d#Spiritual%20Warfare%20%28USA%29%20%28Unl%29.zip","filesize":150514,"score":4.8,"genres":"Action > Educational > Top-down > Religion","desc":"<p><em>Spiritual Warfare</em> is a Zelda-like overhead action game where you play as a soldier of God, fighting the forces of darkness in various parts of a modern city to find the armor of God, each one guarded by increasingly difficult demon bosses. When you are dire need, an angel may come down and help you, if you answer Bible questions correctly. The game will take through increasingly difficult levels of play, where in the end you will face off with Satan himself.</p>"},{"name":"Spirou","year":1995,"developer":"Infogrames Europe SA","url":"d#Spirou%20%28U%29.zip","filesize":708973,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Spirou</em> is a platform side-scroller based on popular Franco-Belgian comic strip <em>Spirou et Fantasio</em>. The story begins in New York where famous inventor Count of Champignac is about to present his latest inventions. Journalists Spirou and Fantasio, the Count’s most faithful friends are also there. Suddenly an evil robot woman Cyanida (originally called Cyanure), known to be obsessed with plans to enslave humanity, appears and abducts the scientist! There’s no time to lose, so Spirou and his pet squirrel Spip rush to the rescue, while Fantasio stays back to dig for more information. </p><p>The player controls Spirou. He is able to jump, duck, climb ladders and cliffs and run fast if the player holds down the action button. In the fourth level Spirou gets a gun to stand a chance against the increasing numbers of Cyanida’s minions. Spirou’s quest will see him travel through city streets and rooftops, a toy store, subway, Palombian swamp and jungle and other locations in over 12 levels. </p><p>The player only gets 3 lives and no continues to beat the game. A single password is granted after beating the first half of the game.</p>"},{"name":"Splatterhouse 2","year":1992,"developer":"Now Production Co., Ltd.","url":"d#Splatterhouse%202%20%28USA%29.zip","filesize":464644,"score":6.7,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Horror","desc":"<p>It has been three months since your escape from the Splatterhouse in the first game. Having been unable to save Jennifer, you keep having the recurring dream where she is begging you to come and rescue her. The mask from the Splatterhouse appears and promises that there is still a chance to save her. There is a downside to it, though. Wearing the mask of terror will fill you with feral rage and an insatiable hunger for blood.</p><p>Heavily influenced by films such as Evil Dead 2, the game takes you through eight, side-scrolling stages. Rick has a basic set of punches, kicks and flying kicks, but he can pick up additional weapons such as a lead pipes, bones, bombs, a shotgun and a chainsaw for the ultimate bloodfest, while fighting skulls, razor fish and giant demons. A boss, requiring a specific pattern of moves, awaits you at the end of each stage.</p>"},{"name":"Splatterhouse 3","year":1993,"developer":"Now Production Co., Ltd.","url":"d#Splatterhouse%203%20%28USA%29.zip","filesize":1089540,"score":7.3,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Horror","desc":"<p>It has been a while since the escape in Splatterhouse 2 and Rick is slowly regaining his sanity. At night, he is still haunted by nightmares from the place. Rick has married Jennifer and they have a son, David. In the final chapter of this horror trilogy, Rick finds out that an entity called The Evil One has kidnapped his beloved family members. He has no choice but to wear the demon mask with the supernatural powers to save Jennifer and David from the demon-infested Splatterhouse.</p><p>The third title in the series builds upon the gameplay of its predecessors. The game consists of six consecutive levels in a huge mansion. In a race against time, you have to wipe the demons from each room and find the quickest path to the boss area. After clearing a room, you can use an in-game map to decide upon the quickest route. Improvements over the second title include moving between rooms in multiple directions, multiple endings based on your performance, special moves for Rick and crisper graphics.</p><p>It still has a horror theme and maintains the same level of gore and violence. You can collect weapons such as a skull-smashing baseball bat, an ax and cement blocks. If you get knocked down, a ghost will try to snatch your weapon and drop it in another room of the house. Other collectible items include extra lives, health meat or orbs. These orbs build up a power meter. Upon completion, you have the ability to transform into a berserk mutant for a short time. The cutscenes feature real actors who act out the characters.</p>"},{"name":"Sport Games","year":1998,"developer":""},{"name":"Sports Talk Baseball","year":1992,"developer":"SEGA Enterprises Ltd.","url":"d#Sports%20Talk%20Baseball%20%28USA%29.zip","filesize":599777,"score":7.3,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>Sports Talk Baseball gives you all the teams and players from the 1991 roster.  Choose to play as sluggers like Ruben Sierra or Cecil Fielder, or play as Ken Griffey Jr., and hit those fast balls.  You can play as Cal Ripkin Jr, and make him dive.</p><p>Seasons stretch up to 162 games, including a Pennant race.  You have many batting styles and pitching styles to choose from.</p><p>Sports Talk Baseball incorporates Sega's patented \"Sports Talk\",  delivering accurate play-by-play.</p>"},{"name":"Spot Goes to Hollywood","year":1995,"developer":"Eurocom Developments Ltd","url":"d#Spot%20Goes%20to%20Hollywood%20%28USA%29.zip","filesize":1904772,"score":7.4,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Fantasy > Licensed","desc":"<p>After getting trapped inside a movie projector, Spot has to find his way out while also rescuing other spots who are in the same predicament.</p><p>Spot goes through different levels that are represented by different movie set genres. These movie set locations include things like a ship, a haunted house, and a temple. In these levels Spot has to rescue a certain percentage of spots while shooting at enemies that get in his way.</p>"},{"name":"SRD: Super Real Darwin","year":1990,"developer":"Data East Corporation"},{"name":"Star Control","year":1991,"developer":"Toys for Bob Inc.","url":"d#Star%20Control%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":679106,"score":6.8,"genres":"Action > Strategy > Shooter > Space flight > Sci-fi / futuristic","desc":"<p><em>Star Control</em> is a science-fiction wargame which pits the forces of the Alliance of Free Stars against those of the predatory Ur-Quan Hierarchy. The games are designed so that you can ease into play, familiarizing yourself with menus, options and player controls. The Alliance and Hierarchy each possess different types of warships. Each vessel has its own maneuvering and firing characteristics, plus a unique special power that you can employ when circumstances dictate.</p><p>The game has two modules: the Melee, in which you can simply blast the computer or another player to smithereens using one of 16 different ships, in either Hierarchy or Alliance fleets; or, should you wish for a more challenging game, lets you play one of 9 preset scenarios.</p>"},{"name":"Star Cruiser","year":1990,"developer":"Arsys Software, Inc."},{"name":"Star Odyssey","year":1991,"developer":"Hot-B Co., Ltd.","url":"d#Star%20Odyssey%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":607351,"score":"","genres":"Role-playing (RPG) > Top-down > Turn-based > Sci-fi / futuristic","desc":"<p>In the distant future, mankind has long left the Earth and spread all over the Milky Way. Humans settled down on different planets, sometimes coming into contact with other races, and established a connection between them. The player is a nameless young man who was a mere child when he survived a spaceship crash and had to seek shelter on a new planet. Now he is sixteen, and his parents send him as a foreign student to the planet Terra. That is where his adventure begins!</p><p><em>Star Odyssey</em> (originally released as <em>Blue Almanac</em>) is a sci-fi Japanese-style role-playing game. The player's party encounters random enemies and fights them in turn-based combat. The combat is viewed from a side-scrolling perspective and both the player's and enemies' attacks are animated.</p>"},{"name":"Star Trek: Deep Space Nine - Crossroads of Time","year":1995,"developer":"Novotrade Software Kft.","url":"d#Star%20Trek%20-%20Deep%20Space%20Nine%20-%20Crossroads%20of%20Time%20%28USA%29.zip","filesize":610656,"score":6.4,"genres":"Action > Side view > 2D scrolling > Sci-fi / futuristic > Licensed","desc":"<p><em>\"Star Trek: Deep Space Nine - Crossroads of Time\"</em> is a 2D action game based on the famous TV series. You play Benjamin Sisko, commander of Federation space station Deep Space Nine. When the station is attacked by Bajoran terrorists, your mission to uncover their plot leads you from DS9 to Bajor, beyond the wormhole and even through time itself.</p><p>Moving through the side-scrolling environments of DS9 and other places, Sisko must complete several missions like disarming bombs or rescuing hostages. If necessary, Sisko can use a phaser to stun enemies. To solve puzzles, he can use a tricorder and other items. The plot is often carried forward by interacting with other characters from the TV series.</p>"},{"name":"Star Trek: The Next Generation - Future's Past","year":1994,"developer":"Spectrum Holobyte, Inc.","url":"d#Star%20Trek%20-%20The%20Next%20Generation%20-%20Echoes%20from%20the%20Past%20%28USA%29.zip","filesize":1101930,"score":7.1,"genres":"Action > 1st-person > Behind view > 2D scrolling > Shooter > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>The Romulans request permission to enter the Neutral Zone in order to search for a team of their researchers that they claim has gone missing. The USS Enterprise is sent to monitor their activities and find out their real motives.</p><p>Gameplay is divided into three parts: commanding the Enterprise from the bridge, controlling an away team on a planetary mission and combat with other ships.</p><p>From the bridge you can control all of the ship's main functions. <em>Conn</em>: Set course to a different planet or sector. <em>Communication</em>: Communicate with other ships. <em>Sensors</em>: Receive information on your surroundings or planets you are orbiting. <em>Computer</em>: Access a database that contains lots of information on planets, races, technology, your crew, etc. <em>Engineering</em>: If the Enterprise got damaged during combat, you can use this command to allocate resources to the different parts of the ship that need to be repaired. <em>Briefing Room</em>: Receive orders and information on your current mission. <em>Tactical</em> Station: Engage in combat. <em>Transporter</em>: Assemble an away team and beam it down to a planet (which is only possible if your current mission requires it).</p><p>Before starting an away mission, you have to assemble a team of four crew members that differ in strength and in tactical and technical ability. Some crew members also have special abilities: Dr. Crusher can heal other crew members, Geordi and Data can see in the dark and Data can survive without air. Away missions are shown from a top-down perspective and you can control each team member individually or order different members to follow your currently selected character around. Most away missions are a mixture of simple (real time) combat and puzzle solving that usually consists getting hints from tricorder readings and finding objects that have to be used in the correct way.</p><p>Ship battles are also seen from a top-down perspective and let you attack enemy ships with phasers and photon torpedoes, while keeping an eye on your shields and trying to dodge your enemy's torpedoes. If your ship is too heavily damaged, you can surrender and hope that your enemy spares you.</p><p>While the SNES and Genesis versions are essentially the same game, there are some noticeable differences. The Genesis version plays considerably faster during ship battles and on away missions as well as on the bridge (meaning it takes much less time to repair the ship). There are many graphical differences and the map layout for away missions is slightly different from the SNES version as well.</p>"},{"name":"Star Wars","year":1993,"developer":"SEGA Interactive Development Division","url":"d#Star%20Wars%20%28USA%29%20%28Proto%29%20%281993-01-25%29.zip","filesize":557039,"score":"","genres":"","desc":"<p>Based on Super Star Wars, which was released for the SNES.</p><p>The game was being developed by Sega Interactive but canceled for unknown reasons. Development began in late 1992 and ended sometime in 1993. Aside from a few mentions in gaming magazines from this time period, the game hasn't been shown until now.</p><p>None of the cutscenes seem to be implemented.</p><p>Some of the stages are just placeholder screens with text.</p><p>ROM header is based on Greendog, which was another title developed by Sega Interactive around the same time.</p>"},{"name":"Starflight","year":1991,"developer":"Binary Systems","url":"d#Starflight%20%28USA%2C%20Europe%29.zip","filesize":433194,"score":8,"genres":"Role-playing (RPG) > Simulation > Top-down > Real-time > Space flight > Sci-fi / futuristic","desc":"<p>A long time ago, a great empire comprised of Humans, Velox, Thrynn and Elowan ruled the stars. The Empire's currency was an energy source called Endurium. But something happened and this empire is no more. Furthermore, the small colony world named Arth has forgotten this heritage and technology. A thousand years have since passed and the people of Arth have rediscovered archaeological evidence of their empire. Using these discoveries, they create spaceships and form the Interstel corporation to govern the fleet. It's time to take the first steps back into space... but could it be the same enemy that destroyed the Empire still exists?</p><p><em>Starflight</em> is a space exploration game with role-playing elements. The game is completely non-linear, allowing the player to venture to any star system and explore any of the vast amount of available planets. The main plot is advanced by following cryptic clues either received as transmissions at the initial spaceport, or obtained as a result of successful communication with various alien races populating the universe. </p><p>The player must first form a crew, assign their positions and customize the spaceship before blasting off from spacedock. Besides the captain of the ship, a science officer, a navigator, an engineer, a communicator, and a doctor have to be assigned to the ship. The player can choose between Humans, Velox, Thrynn, Elowan, and Android races when creating the characters. Each profession usually has a racial counterpart with the highest proficiency in it. Except Androids, members of every race can be trained in their skills by spending the game's currency. In the starting location the player can also acquire better weapons, armor, and shields for the ship, as well as outfit it with cargo pods. Terrain vehicle can be customized as well.</p><p>Once out into space, the standard interface allows access to different crew members and navigation. The entire galaxy is unknown and it's up to the player to travel to distant planets to explore and land on them. Planets may be inhospitable, with harsh weather conditions and various terrain types. Using a top-down interface, a planetary lander will venture out with the task of finding minerals and biological data to transport back to Starport. These resources can be sold for MU, the game's currency. </p><p>Different alien races control the galaxy and it will be up to the player to approach them diplomatically or face them in combat. Depending on the communicator's skill, the player may conduct successful conversations by assuming different postures, requesting information, or answering questions posed by the aliens. Each race has a different attitude and requires different approaches to peacefully end the negotiations. If all else fails, or if the player so wishes, the player-controlled ship may engage the aliens in combat, which is presented as overhead arcade action sequences. Successful exploration of the galaxy and alien cultures will yield clues and new leads as to the fate of the Empire.</p><p>The Amiga version adds an auto-mining command. The Genesis version has updated graphics and sound, and is different in several aspects: locations of minerals and artifacts are different; there are new weapons for the ship and upgrades for the terrain vehicle; landing on planets is no longer automatic and must be controlled manually to avoid crashing; terrain vehicle exploration is more realistic, with visible weather conditions and various terrain types slowing down the vehicle.</p>"},{"name":"Stargate","year":1995,"developer":"Probe Entertainment Ltd.","url":"d#Stargate%20%28USA%2C%20Europe%29.zip","filesize":1144675,"score":6.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Licensed","desc":"<p>Based on the movie of the same name, a mystical circular portal called a \"Stargate\" has been uncovered. In attempting to unlock its secrets, its power is unlocked creating a passageway to a different world named Abydos. A special forces team is sent to the new world to investigate but is soon ambushed and its supplies taken including a powerful nuclear bomb.</p><p>As Colonel O'Neil, a variety of objectives must be met starting with the recovery of supplies and the finding of other teammates, including civilian archaeologist Daniel Jackson. Once regrouped, O'Neil must lead the attack on the god, Ra and escape back to Earth before the power of the nuclear bomb can be unleashed on this new world.</p><p>The game is a side-scroller platform adventure. The player controls O'Neil on a variety of objectives and is armed with a rifle weapon and grenades. Embarking through desert, caverns and nomad towns... eventually to the palace of Ra.</p>"},{"name":"Steel Empire","year":1992,"developer":"Hot-B Co., Ltd.","url":"d#Steel%20Empire%20%28USA%29.zip","filesize":473100,"score":7.1,"genres":"Action > Side view > Shooter > Steampunk","desc":"<p>The skies are populated by zeppelins, large battleships and flying fortresses. In this age of steel, the Motorhead Empire has conquered and enslaved almost the entire planet. The last free nation, the Republic of Silverhead, tries to bring the Motorhead Empire down using its newly developed weapon, the lightning bomb.</p><p>Apart from its unusual Steampunk setting, Steel Empire is a fairly traditional side-scrolling shooter. At the beginning of every level, the player gets to choose between a striker plane and a zeppelin. While the plane is faster, the zeppelin has a longer life bar and can therefore sustain more damage. Both ships use the same standard weapon, which can be fired forwards or backwards, as well as bombs that are released automatically while firing. Also available is a limited number of lightning bombs that damage or destroy all enemies on screen. </p><p>Defeated enemies often drop power-ups, including hearts that replenish health, lightning bombs, bonus points, 1-UPs, options and experience points.</p><p>Options are small \"drones\" that fly alongside the player's ship and mimic its behaviour.</p><p>Experience points can be collected to level up the ships' weapons (up to level 20) and thereby increase their fire power.</p>"},{"name":"Steel Talons","year":1992,"developer":"Atari Games Corporation","url":"d#Steel%20Talons%20%28USA%2C%20Europe%29.zip","filesize":249592,"score":6.2,"genres":"Action > Simulation > Behind view > Arcade > Helicopter > Vehicle simulator","desc":"<p><em>Steel Talons</em> brought realism-oriented helicopter combat to the arcades, and later to home systems. The action is viewed from behind your helicopter, with the 3D polygon world rotating around you, taking in mountains, rivers and deserts. </p><p>There are 12 missions in total, each of which requires you to destroy targets in a set time limit. There are also training and head-to-head (against a CPU-controlled drone) modes. </p><p>You have a limited number of automatically-targeting missiles as well as a cannon. A tracking map tells you where you are on the level, and where the enemies are. Contact with the ground, mountains or other vehicles will damage or destroy your helicopter.</p>"},{"name":"Stone Protectors","year":1994,"developer":"Eurocom Developments Ltd","url":"d#Stone%20Protectors%20%28USA%29%20%28Proto%29.zip","filesize":1154230,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform","desc":"<p><em>Stone Protectors</em> is a an action game where each character has different weapons, all from melée to long-range weapons such as bazookas and guns. A kingdom built by crystals is under attack by the Saurians. Their leader, called Zok, wants the kingdom's powerful crystals which are protected by the Queen. Breaking into the castle, all seems lost, but as Zok reaches to take the crystal, it explodes into pieces and they fly away to Earth. All but one of the crystals reaches New York and falls into the hands of a rock band, who are transformed into goblins by the power of the crystals. Now their goal is to bring back the pieces to the kingdom and fight Zok and take his piece.</p>"},{"name":"Stormlord","year":1990,"developer":"Hewson Consultants Ltd.","url":"d#Stormlord%20%28USA%29.zip","filesize":264379,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p>Badh the queen has imposed a terrible vengeance on the land by kidnapping the fairies. To restore things their rightful way, you must rescue them.</p><p>As you progress through the levels of platform-adventure action, you will come across fairies which are rescued by touching them. Enemies include Venus Fly Traps, localized acid rain showers and dragons, which can be avoided or shot in the bonus shoot 'em up sections. You will need help to reach some levels; this comes from Mael Dvin the Eagle. After each level there's a bonus game in which tears must be collected for points.</p>"},{"name":"Street Fighter II Turbo","year":1993,"developer":"Capcom Co., Ltd.","url":"d#ST%20II%27%20Turbo%20%28USA%29%20%28Proto%29%20%28Unl%29%20%28Pirate%29.zip","filesize":1275596,"score":8.5,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Direct control","desc":"<p>Choose from twelve street fighters from around the world, skilled in a variety of martial arts -- for instance, a character named E.Honda is a sumo wrestler from Japan, while Ken is a master of Tae Kwon Do from the United States. Journey to different countries to defeat other fighters, eventually leading up to a battle with evil man M.Bison. Besides the standard punches and kicks, each character can also execute special moves, such as energy projectiles or lightning-fast kicks, for more damage or to create a chain of hit combos. </p><p>This installment in the Street Fighter series is essentially an upgrade to the Champion Edition game with some improvements and changes, such as new or upgraded moves, costume colors, and increased game speed.</p>"},{"name":"Street Fighter II: Special Champion Edition","year":1993,"developer":"Capcom Co., Ltd.","url":"d#Street%20Fighter%20II%27%20-%20Special%20Champion%20Edition%20%28USA%29.zip","filesize":1595015,"score":8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Martial arts","desc":"<p>This version of Street Fighter II is similar in most aspects to the original, save that all 12 characters are selectable from the get-go (the boss characters were originally locked), and the game engine has been revamped.</p>"},{"name":"Street Racer","year":1995,"developer":"Vivid Image"},{"name":"Street Smart","year":1991,"developer":"SNK Corporation","url":"d#Street%20Smart%20%28Japan%2C%20USA%29.zip","filesize":207536,"score":5.3,"genres":"Action > Side view > Arcade > Fighting","desc":"<p>An arcade fighting game, <em>Street Smart</em> puts the player in the shoes of the ass-kicking \"Karate Man\" who travels across the country to participate in the Tag Championship.</p><p>The game is played from a side-scrolling third person perspective in which players can move in any direction in a closed arena (limited by the cheering crowds and other street elements). Eight unique fighters must be faced in succession by using punches, kicks, and jumping against the progressively more difficult adversaries.</p><p>The arcade version features a cooperative two-player mode, but this was excluded in the PS Mini release. As an unique feature of the Genesis version players can bet money on the outcome of the fights, and if they win they can use that money to upgrade the character stats to suit their playing style. Also added to the Genesis version are a Vs mode and a new special move that depletes part of your lifebar.</p>"},{"name":"Streets of Rage","year":1991,"developer":"SEGA Enterprises Ltd.","url":"d#Bare%20Knuckle%20-%20Ikari%20no%20Tekken%20~%20Streets%20of%20Rage%20%28World%29.zip","filesize":370716,"score":7.9,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Beat 'em up / brawler","desc":"<p><em>Streets of Rage</em>, Sega's answer to Final Fight, follows the story of three young police officers (Adam Hunter, Axel Stone and Blaze Fielding) in a city controlled by a criminal syndicate led by a \"Mr. X\" where crime is rampant, which leads the three heroes to make a pact to leave the force and topple the syndicate by themselves.</p><p>Gameplay is straightforward and simple. Three buttons are used, one to jump, other to attack and another to perform a range attack from a support police car. Each character has a limited set of moves that include punching and kicking or performing a back attack (if in the open), two grapple moves (depending if holding the opponent in front or by the back), a flying attack, and if playing with another player two additional tag attacks, and different abilities: Adam is slow, but a good jumper and a hard hitter, Axel fast and also a hard hitter, but a lousy jumper and Blaze fast and a good jumper, but weak hitter.Levels are in typical arcade side-scroller fashion: move from left to right (with two exceptions), clearing screens from enemies one after another as fast as possible while avoid taking damage with a boss in the end. Some levels feature \"death drops\" where the player must avoid falling, while throwing enemies there at the same time, including a typical elevator level. Several items are scattered on the ground, from melee weapons and bonus points (and lives or additional police cars) to apples and turkeys (to restore health).</p>"},{"name":"Streets of Rage 2","year":1993,"developer":"Ancient Co. Ltd.","url":"d#Streets%20of%20Rage%202%20%28USA%29.zip","filesize":1030987,"score":8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Beat 'em up / brawler > Direct control","desc":"<p>After Axel Stone, Blaze Fielding and Adam Hunter destroyed the evil Syndicate leader, Mr. X, the city became a peaceful place to live, and each one of them followed their own paths. One year later, after their reunion, Adam's brother Sammy returned from school to find their apartment in a mess, and Adam nowhere to be seen, and after calling his two friends, one of them notices a photo of Adam chained to a wall, next to someone they knew very well - Mr. X, who returned to turn the peaceful city once again into a war zone. Now, Axel, Blaze, Sammy, and Axel's good friend Max, a pro wrestler, must head out to stop Mr. X once again...hopefully for good...</p><p><em>Streets of Rage 2</em> differs from the previous title in several ways. There are changes in both graphics (characters now are bigger, more detailed and with more animation frames, and scenarios are less grainy) and gameplay (the rocket move was replaced by a special move that doubles in offense and defense along several new moves), along other new features such as life bars (and names) for all enemies and the radically different new characters.</p>"},{"name":"Streets of Rage 3","year":1994,"developer":"Sega AM7 R&D Division","url":"d#Streets%20of%20Rage%203%20%28USA%29.zip","filesize":1681448,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Beat 'em up / brawler > Regional differences","desc":"<p>In part three of the Streets of Rage series, Mr. X is back and this time his plan involves replacing public officials with his own robots. Only Axel, Blaze, Skate, and new-comer Dr. Zan can stop him. Streets of Rage 3 features all of the beat 'em up action you would expect from a Streets of Rage game. One new feature is the special move power bar, where it only costs energy to do a special move if the bar isn't full. Also new is the ability to do special maneuvers with different weapons, depending on the character. For example, Skate has no special move with the pipe, but does have one with the knife. The opposite is true for Axel. Any weapon Dr. Zan picks up is turned into energy balls which he can throw at the enemies. Secret characters and multiple endings add replay value.</p>"},{"name":"Strider","year":1990,"developer":"Capcom Co., Ltd.","url":"d#Strider%20%28USA%2C%20Europe%29.zip","filesize":674323,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Sci-fi / futuristic","desc":"<p>The year is 2048 AD. In Russia, the evil Grand Master Meio has begun his insane plot to take over the universe. A lone figure drops from a stealth glider into Meio's base. He is Hiryu, Super A-Class Strider. His mission is to defeat the Grand Master and put an end to his plotting once and for all.</p><p><em>Strider</em> lets the protagonist run, jump, perform acrobatics and climb walls and overhangs. He wields a plasma sword, called a Cypher, through five levels fighting robots and guards, with mid- and end-level bosses.</p>"},{"name":"Striker","year":1995,"developer":"Rage Software Ltd.","url":"d#Striker%20%28U%29.zip","filesize":996804,"score":7.3,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p><em>Striker</em> is a football (soccer) game with a forced-perspective 3D view. The players are drawn large and there is a large scanner to assist with long passing. The standard mode has the ball sticking closely to the feet, which makes mazy runs upfield a common strategy. There are 64 international teams on offer, with a European-style knock-out cup competition included. Many different formations and strategies are offered.</p>"},{"name":"Sub-Terrania","year":1994,"developer":"Zyrinx","url":"d#Sub-Terrania%20%28USA%29.zip","filesize":959190,"score":7.7,"genres":"Action > Side view > 2D scrolling > Shooter > Direct control > Flight / aviation > Sci-fi / futuristic","desc":"<p>Aliens have invaded a vital subterranean mining colony. Use light-speed reflexes and total concentration to fly your prototype fighter through impossible caverns rescuing miners and blast those aliens into the darkest pits of space!</p><p>The game consists of 10 missions. Each mission takes place in a vast cavern, with interesting weather conditions. You must explore it and complete the mission objectives -- usually collecting sub parts, rescuing trapped miners, or destroying giant, epic bosses. You can also explore the levels, but keep an eye on your fuel gauge and beware the many hazards!</p>"},{"name":"Summer Challenge","year":1993,"developer":"MindSpan","url":"d#Summer%20Challenge%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":622940,"score":7.2,"genres":"Action > Sports > Behind view > Olympiad / mixed sports","desc":"<p>The sequel to Winter Challenge, this Summer edition includes 8 events from athletics to cycling. The events are:</p><ul><li><strong>Kayak:</strong> The player goes on a downhill stream, and must navigate through gates without missing or touching them (unlike the real event, there are no reverse gates), as well as avoiding to hit the margins of the stream. Pushing forward paddles, pressing a direction along a button allows a sharper turn. The winner is the one with the fastest time after penalty time is added</li><li><strong>Archery:</strong> Each competitor has four targets, each with three arrows. By moving the directional buttons the player moves the erratic crosshair, while pressing a button fires the arrow.</li><li><strong>400m Hurdles:</strong> The player does a full lap on the track by pressing the first button to set the pace and the second to jump. Mistiming the jump either makes the athlete knock the hurdle and lose a few tenths of second, or goes completely off-balance and falls, ending the event</li><li><strong>High Jump and Pole Vault:</strong> Two similar events where the player starts by setting the bar height, and then mashing the power button to build enough speed. Then, just before the jump point the action button must be pressed and held until the athlete is in position to pass over the bar. The contest ends once there are three misses at an height, or the maximum height is cleared.</li><li><strong>Equestrian:</strong> The most technical event, the player must steer the horse to the best trajectory while jumping over hurdles and walls. While a knockdown means a time penalty in the end, if the horse refuses to do a jump (if the button is pressed too soon or too late) the competition ends immediately.</li><li><strong>Javelin:</strong> A simple event where each player has three attempts to launch the javelin as far as possible. To do so, first some speed must be built, and a few steps before the mark start pressing the action button to start the launch sequence, which initiates the angle measure. Once the player releases the button (ideally at an angle between 40 and 45 degrees next to the mark), the javelin is released as well</li><li><strong>Cycling:</strong> In this sprint event the player must complete a number of laps in the velodrome, while keeping as fast and as close as possible to the inner edge without falling.</li></ul><p>Like with Winter Challenge, graphically, the game features the same polygonal environments with bitmap athletes and game modes include the ability to train or compete in a tournament (up to ten human players, with three computer levels and 16 nations to choose from). It's also possible to replay and even store your best (or worst) moments.</p>"},{"name":"Sumo Slam!","year":2013,"developer":"Segaman Production"},{"name":"Sunset Riders","year":1993,"developer":"Konami Co., Ltd.","url":"d#Sunset%20Riders%20%28USA%29.zip","filesize":365783,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Western > Regional differences","desc":"<p>The Wild West...full of the criminal element. Sir Richard Rose, the most despicable face in the criminal lot, has enough power to control the mining facilities, cattle ranches, and trading communities and turn everything to his favor. With that much power, he could literally buy himself the Wild West and control everything!</p><p>The people need help, desperately. And just as things were looking grim, who should ride into town but 4 men who have made a pact: to put down Sir Richard Rose and make the Wild West a free and peaceful place to live.</p><p>Steve, Bob, Billy, and Cormano are the Sunset Riders, and they're about to live out the wildest shootout the Wild West has ever seen...</p>"},{"name":"Super Aquatic Games, The","year":1993,"developer":"Millennium Interactive Ltd.","url":"d#Aquatic%20Games%20Starring%20James%20Pond%20and%20the%20Aquabats%2C%20The%20%28USA%2C%20Europe%29.zip","filesize":205294,"score":6.6,"genres":"Sports > Side view > 2D scrolling > Arcade > Olympiad / mixed sports","desc":"<p><em>The Super Aquatic Games</em> was conceived partly as an Olympics tie-in, and partly as a stop-gap for James Pond fans (the third platform title in the series (Operation Starfish) was in the process of being heavily delayed, eventually being released in 1994). This game saw Pond and friends competing in the underwater Olympics.</p><p>The events take the form of various mini-games, usually in the same vein as Hyper Sports, but with an aquatic theme and the humour seen in the <em>James Pond series</em> (e.g. The 100 Metre Splash). More unusual mini-games include Kipper Watching, which involves 'heading' incoming beach balls away from a troop of sleeping seals, and Gymnastics. Events can be played with up to 4 players.</p>"},{"name":"Super Baseball 2020","year":1993,"developer":"SNK Corporation","url":"d#Super%20Baseball%202020%20%28USA%2C%20Europe%29.zip","filesize":1082073,"score":7.6,"genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Baseball > Sci-fi / futuristic","desc":"<p>In the year 2020, baseball finally evolved. There is no longer conventional professional baseball in 2020. Baseball designed by the Super Baseball Association has been very popular and is the best sport.</p><p>However, the truth is that the association has used a colossal sum of money to promote Super Baseball as show business. They have manipulated each player's ability using the control computer to secretly decide victory or defeat in every game. The players who knew this removed the connecting parts of the computer to play their own game of baseball. Finally, a fair game is going to be played at Cyber Egg Stadium.</p><p>In <em>2020 Super Baseball</em> is a fast-paced game with new rules, where you can select 1 of 12 individual men, women, or robot players. During play, you can make your team stronger with prizes earned from amazing catches.</p>"},{"name":"Super Battleship: The Classic Naval Combat Game","year":1993,"developer":"Synergistic Software, Inc.","url":"d#Super%20Battleship%20-%20The%20Classic%20Naval%20Combat%20Game%20%28USA%29.zip","filesize":228271,"score":5.3,"genres":"Action > Strategy > 1st-person > Side view > Top-down > Turn-based > Board game > Direct control > Naval / watercraft > Licensed","desc":"<p>This game features two different modes of play: Classic Battleship and Super Battleship.</p><p>Classic Battleship is the typical Battleship game where the players set up their ships on a grid, then take turns choosing 3 places at a time to target and hope they hit the opposing players ship. The game ends when all the opposing players ships are sunk. This mode contains four difficulty levels: Ensign, Lieutenant, Commander, and Admiral.</p><p>Super Battleship involves eight levels consisting of sixteen missions total. Missions include sinking enemy ships in a certain number of rounds, escorting ships to their destinations, defending cities from attack, and destroying enemy airfields. Gameplay consists of a turn-based moving of ships utilizing an overhead view. The player can then target any enemy units within the ship's range and attack. Attacking brings up an action sequence where both ships trade volleys of gunfire until one of them either sinks or retreats.</p>"},{"name":"Super Caesars Palace","year":1993,"developer":"The Illusions Gaming Company"},{"name":"Super Daisenryaku","year":1989,"developer":"SystemSoft"},{"name":"Super Fantasy Zone","year":1992,"developer":"Sun Corporation","url":"d#Super%20Fantasy%20Zone%20%28USA%29%20%28En%29%20%28Genesis%20Mini%29.zip","filesize":439454,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The next-gen sequel to Fantasy Zone, Super Fantasy Zone starts as a strange gravitational force appears in the Menon planet, home of the evil Menon empire and thus a new threat looms over the Fantasy Zone. </p><p>In a sudden strike by the Menon forces O-Papa, Opa-Opa's father, is fatally wounded. Thus Opa-Opa once again sets forth to destroy the Menon empire and avenge his father.</p><p>Gameplay is identical to the previous games, you control Opa-Opa on a freely scrolling 2D game world and you must seek and destroy all the enemy generators in each level in classic arcade shooter fashion and then face a boss fight. Upon successful completion of a level, you get to spend the coins you collected on it at an upgrade shop, fitting your ship with better weapons and upgrades, and then you head out for the next level.</p><p>Small changes in gameplay include the removal of the automatic orientation control as in the Game Gear Fantasy Zone, expanded control mapping that takes advantage of the Mega Drive's extra buttons, and more weapons and items to upgrade your ship with.</p>"},{"name":"Super Hang-On","year":1989,"developer":"SEGA-AM2 Co., LTD.","url":"d#Super%20Hang-On%20%28World%29%20%28Sega%20Smash%20Pack%29.zip","filesize":258524,"score":7.3,"genres":"Racing / Driving > Behind view > Arcade > Motorcycle","desc":"<p>In <em>Super Hang-On</em> you race a motorcycle around the world, completing each section of track within a time limit. There are other bikes on the road, but beating this is not important, so they can be thought of as moving obstacles. Each continent is a different difficulty level: Africa is beginner, Asia is junior, the Americas are senior, and Europe is expert. </p><p>This is a very simple and straightforward game, viewed from behind the bike in 2D (so the screen does not tilt with the bike). The right/left controls are steering, and up/down are gear changes. Your cycle is always moving, and your speed strictly depends on the gear you are in, although contact or running off the road slows the bike down.</p><p>The Sega Genesis version features \"Original mode\" in which the player participates in racing tournaments, hires mechanics, upgrades his bike. This mode uses passwords allowing players to continue a previously played game.</p>"},{"name":"Super High Impact","year":1992,"developer":"Midway Manufacturing Company","url":"d#Super%20High%20Impact%20%28USA%29.zip","filesize":689837,"score":6.4,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Arcade > Football (American)","desc":"<p>Super High Impact was one of the most hard hitting football games before the NFL Blitz series was created, with 18 teams and over 30 plays per team. The console versions are based on the Midway arcade series of the same name. The game has a Hit-O-Meter which often leads to massive brawls. Based on the arcade smash hit back in the days, featuring the three famous words: EAT THIS!!!, FIGHT!!!</p>"},{"name":"Super Hydlide","year":1989,"developer":"T&E Soft, Inc.","url":"d#Super%20Hydlide%20%28USA%29.zip","filesize":255286,"score":6.4,"genres":"Action > Role-playing (RPG) > Top-down > Fantasy","desc":"<p>A long time ago, evil descended upon the peaceful people of Hydlide. Old legends tell of a lone brave hero who saved Hydlide from the imminent threat of doom - the evil demon Varalys. Since then, the people of Hydlide have lived through centuries of peace. But one dark evening, a huge column of fire exploded out of the depths of Hydlide. The next morning, strange doors began to appear from nowhere. Many who were curious entered these doors, but were never seen again. From that day on, unusual events and disasters began to take place. Huge cracks opened in the ground, scarring the beautiful lands, floods wiped out entire villages. And then the monsters came. The Hydlide council feared that the same evil in the legends was back again. A wise old oracle predicted the second coming of evil. He also spoke of a young man who could save Hydlide from the grave danger. This young man is you...</p><p><em>Super Hydlide</em> (originally entitled <em>Hydlide 3: The Space Memories</em>) is the third entry in the Hydlide series, continuing its action RPG legacy. Character creation allows the player to choose one of the four character classes: Warrior, Thief, Priest, and Monk. In combat, the protagonist uses melee or long-ranged weapons or casts magic spells. Unlike the previous games in the series, the player is required to press the attack button during melee combat, instead of simply \"bumping\" into the enemies. There is an internal clock in the game, which makes it necessary for the protagonist to sleep periodically and regain his strength. The main character also has to eat from time to time, otherwise his hit points will gradually decrease. The morality system from the previous game returns: killing friendly creatures will reduce the player's morality level, which will eventually have an effect on one of the game's most decisive battles.</p>"},{"name":"Super Kick Off","year":1992,"developer":"Enigma Variations Ltd.","url":"d#Super%20Kick%20Off%20%28U%29.zip","filesize":317417,"score":6.9,"genres":"Sports > Top-down > Football (European) / Soccer","desc":"<p><em>Super Kick Off</em> is an enhanced developed version of the popular football game developed by Dino Dini for consoles. It includes 40 teams (16 national and 24 club), along the ability to edit club team names and shirts and player names and looks. Game modes include friendlies, Domestic League and Cup (composed by eight English teams), European League (16 European teams) and International cup (eight team tournament). Training allows to practice free kicks, penalties or to pass, shoot and dribble without opposition. Players can compete head to head, or play cooperatively against the computer in the same team. Other game options include player speed, wind and grass cut, along the typical half length, offside rules, extra time and difficulty setting. All changes, from team edits to options, are stored in the cartridge internal memory.</p><p>About the game itself, it was one of the most popular of the time, featuring a top-down view with the ball not sticking to the players' feet being the most prominent gameplay feature.</p>"},{"name":"Super Mario Bros.","year":2004,"developer":"Nintendo Co., Ltd.","url":"d#SMB4MD.zip","filesize":39616,"score":8.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control","desc":"<p>The Princess has been kidnapped by the evil Bowser, and it is up to Mario and brother Luigi to save the day.</p><p>The first-ever platform adventure for the Mario Brothers has the player exploring level after level, with Bowser to contend with as the end of level boss. Power-ups include the Super Mushroom, which increases Mario's size and power, the fire flower, allowing him to shoot fireballs at enemies, and the ever-important starman for a short burst of invincibility.</p><p>Each level includes a bonus section filled with coins plus a shortcut through the level, plenty of bad buys and obstacles to get past, and an end-of-level flag, in which the higher the player grabs it, the more points are awarded to them. Certain levels also include warp points, which take the player to higher levels.</p>"},{"name":"Super Monaco GP","year":1990,"developer":"SEGA Enterprises Ltd.","url":"d#Super%20Monaco%20GP%20%28USA%29%20%28En%2CJa%29.zip","filesize":395123,"score":7.5,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Super Monaco GP</em> is a first-person perspective racing game which allows you to race other cars around the famous Monaco Grand Prix course. You first must qualify for a position on the grid by driving round a shortened version of the course on your own. The faster you drive the higher placing on the grid. The actual race has you competing against 19 other drivers and as well as trying to beat them all you must get to checkpoints within a time limit or it is race over. You also have to stay ahead of a certain position which starts at 20th and gets lower the longer the race goes on.</p><p>The Genesis version of Super Monaco adds a complete career mode, however. In the career mode, your goal is to win a season of races. Unfortunately, you start with a relatively slow car. By challenging other drivers, you can move to a better team and car, and ultimately win the F1 World Title. As well as the famous Monaco course, others from around the world have been added, to give the game a longer shelf life.</p>"},{"name":"Super Noah's Ark 3-D","year":2018,"developer":"Wisdom Tree, Inc."},{"name":"Super Off Road","year":1994,"developer":"Leland Corporation","url":"d#Super%20Off%20Road%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":163196,"score":6.9,"genres":"Racing / Driving > Diagonal-down > Fixed / flip-screen > Automobile > Off-roading > Track racing > Licensed","desc":"<p>Enter the world of off-road racing as 4 vehicles will face each other, on a series of tracks which are based around flipped and reversed versions of a core selection. Fame, glory and bikini clad women await your victories and the taste of dirt awaits if you fail. Let a computer car beat you and you lose one of your 3 credits.</p><p>Successful races bring more money, which can be used to soup up their machine. Boosts to top speed, grip and acceleration can be purchased, and your nitro boost must be kept topped up. If you are desperate for upgrades, you can buy into your spare credits.</p><p>Only your off-road driving abilities will be enough to pull you to first place in these races. Play alone or with up to 3 other players (depending on the version)  in this classic arcade game.</p>"},{"name":"Super Skidmarks","year":1995,"developer":"Acid Software","url":"d#Super%20Skidmarks%20%28U%29.zip","filesize":1194963,"score":7.9,"genres":"Racing / Driving > Diagonal-down > 2D scrolling > Direct control > Automobile > Off-roading > Track racing","desc":"<p>A vague descendant of Super Sprint with a mass of features, and one of the last multi-format games to have roots on the Amiga.</p><p>A multitude of cars are available, ranging from F1 cars and Sportscars to Minis and VWs were on offer, with the option to have up to 8 of these on more powerful machines - with up to 3 different models of car. You could link 2 Amiga 1200s (or faster) and use them to display the track across 2 separate screens. There were two novelty options of sorts as well - motorized cows, and the chance to have the cars pulling caravans as you race - using the caravan to push an opponent off-line was a skill worth mastering. </p><p>24 circuits are provided, all of them with walls around them to ensure crash-bang-wallop racing, and most of them have parts that cross with other parts, making collisions possible if you're much ahead of (or behind) other cars (fortunately there's no car damage). They can be raced forwards or backward - perhaps the first game with this feature available. You could either run single races, or one of the in-built championships - one for each car, across a specially selected set of tracks.</p><p>The customizable nature of the game goes even further - the number of laps can be set, as can the colour and power of the cars. As you repeatedly race a track, the markings on the course are eroded by the cars running over them.</p>"},{"name":"Super Smash T.V.","year":1991,"developer":"Williams Electronics Games, Inc.","url":"d#Super%20Smash%20T.V.%20%28USA%2C%20Europe%29.zip","filesize":330535,"score":7.3,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The year is 1999. The world's most popular television show is Smash T.V., an ultra-violent contest between two armed-to-the-teeth combatants, set loose in a series of deadly arenas that are filled to bursting with hordes of mindless beasts and killer robots. The aim of the game is to blast everything in sight and try to grab more cash and prizes than the other guy. Toaster ovens, VCRs, fancy cars and luxury holidays are there for the taking... for anyone who can survive long enough to enjoy them.</p><p><em>Smash T.V.</em> is an insane shoot-em-up from the brain of Eugene Jarvis, creator of Robotron: 2084. It retains that game's frantic style of play and two-joystick control method, but adds plenty of gore, violence, a hint of satire and that all-important two player mode.</p>"},{"name":"Super Street Fighter II","year":1994,"developer":"Capcom Co., Ltd.","url":"d#Super%20Street%20Fighter%20II%20%28USA%29.zip","filesize":2827744,"score":7.9,"genres":"Action > Side view > 2D scrolling > Fighting > Martial arts","desc":"<p><em>Super Street Fighter II</em> is a sequel to Street Fighter II Turbo and Street Fighter II Champion Edition. The game features four new characters and stages, making a total of sixteen playable. It also features many multiplayer modes in addition to the single-player mode. Among those is the returning elimination group battle, where players compete for the title of the champion, and Point Battle, where the person with the most points wins. Newer modes include an eight-man double-elimination tournament and a Challenge mode, where players attempt to get the most points on a CPU opponent or beat them as fast as possible, trying to surpass records.</p>"},{"name":"Super Thunder Blade","year":1988,"developer":"SEGA Enterprises Ltd.","url":"d#Super%20Thunder%20Blade%20%28World%29.zip","filesize":257473,"score":5.8,"genres":"Action > Behind view > Top-down > Arcade > Shooter > Helicopter","desc":"<p>This follow-up to <em>Thunder Blade</em> is very similar to the original arcade game. Get into a helicopter and blast away at the numerous enemies with its cannon and missiles. The game's four stages all follow a similar pattern: the first part is from a perspective behind the helicopter where players not only have to dodge enemy fire but also obstacles like buildings or caves. In between, players face off against one or two smaller boss enemies. When the first part of a level is finished, the view switches to an overhead perspective for the confrontation with the level's end boss.</p>"},{"name":"Super Volley ball","year":1990,"developer":"Video System Co., Ltd.","url":"d#Super%20Volleyball%20%28USA%29.zip","filesize":92190,"score":6.3,"genres":"Sports > Side view > 2D scrolling > Volleyball","desc":"<p><em>SUPER Volley ball</em> is an indoor volleyball game for one or two players. The single player mode offers two game options: normal game and World League. Choosing normal game pits the player against the computer in a single game. Choosing World League pits the player against all other teams available. A password save is available in this mode.</p><p>The game features eight national teams (USA, USSR, Brazil, Holland, France, Italy, Japan and China), with fictitiously named players. Players can be changed during gameplay by pressing C. There is also an option to create new teams, choosing the team's name, color, player's position and names.</p><p>Gameplay is viewed from a side scrolling perspective, with the camera fixed on the ball. A small radar on the top of the screen shows the players' positions of both teams. Players can bump, set, spike, dump, block and dig. A collection of serves is also available: underhand, overhand and jump serve. There are also options for three ball speeds, beginning points (from 0 to 10, out of 15) and handicap.</p>"},{"name":"Superman","year":1992,"developer":"Sun Electronics Corp.","url":"d#Superman%20%28USA%29.zip","filesize":402170,"score":6.2,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>Superman</em> is a single player, action based platformer for the Sega Genesis. As the Man of Steel, you jump, punch and kick your way through several levels, battling the likes of Prankster, Metallo, and Mr. Mxyzptlk to keep Metropolis safe. After the initial levels, the evil Brainiac kidnaps Lois Lane and takes her to his space station. Some levels take place in flight, and allow you to not only fly but shoot lasers from Superman's eyes. On the ground, you can collect icons that allow you to use a super power once, often a super punch or spin attack to remove an obstacle in the game.</p>"},{"name":"SupraKillminds","year":2014,"developer":"Jack Nolddor Games"},{"name":"Surging Aura","year":1995,"developer":"Japan Media Programming Inc."},{"name":"Swamp Thing","year":1992,"developer":"Imagineering Inc.","url":"d#Swamp%20Thing%20%28USA%29%20%28Proto%29.zip","filesize":214336,"score":5.3,"genres":"Action > Side view > 2D scrolling > Platform > Horror > Licensed","desc":"<p><em>Swamp Thing</em> is based on the DC comic of the same name. Deep in the swamps of Louisiana, a Dr. Holland, is hard at work on a growth formula for plants. His sponsor however has different ideas for the technology and burns down the lab. The poor doctor is burned and covered with formula and inside of the organically rich Bayou swamps... he becomes Swamp Thing.</p><p>The game is a side-scrolling platform game. Swamp Thing can punch (but not duck and punch) and jump a short distance. Health power-ups will be needed to keep him alive and additionally ball power-ups can be found to give him a projectile weapon.</p>"},{"name":"Switchblade","year":2019,"developer":"Gremlin Graphics Software Limited"},{"name":"Sword of Sodan","year":1990,"developer":"Innerprise Software, Inc.","url":"d#Sword%20of%20Sodan%20%28USA%2C%20Europe%29.zip","filesize":392335,"score":5.5,"genres":"Action > Side view > 2D scrolling > Fantasy","desc":"<p>Like Søren Grønbech's other game Datastorm, <em>Sword of Sodan</em> was most noted on the technical side, as the sprites were large and distinctive-looking. Your task (as either a hero or heroine) is to dethrone the tyrannous Zoras the Necromancer, and avenge his killing of your father.</p><p>There are 11 levels to take on, with indoor and outdoor settings. Your character has a range of sword-slashing and jumping moves, which must be used to their full effect if you are to make progress. The game features digitised sound and speech, as well as an action-replay feature, an unusual concept outside sports games at the time.</p>"},{"name":"Sword of Vermilion","year":1989,"developer":"SEGA-AM2 Co., LTD.","url":"d#Sword%20of%20Vermilion%20%28USA%2C%20Europe%29.zip","filesize":381982,"score":6.9,"genres":"Role-playing (RPG) > 1st-person > Diagonal-down > Side view > 2D scrolling > Fixed / flip-screen > Action RPG > Fantasy","desc":"<p>The \"cousin\" of <em>Sega's</em> RPG Phantasy Star II, <em>Sword of Vermilion</em> is a role-playing game with action combat in a medieval-fantasy setting.</p><p>A third-person, top-down perspective is used to move around towns. A first-person view is used for overland travel outside of towns. A third-person side view perspective (a la Double Dragon or Final Fight) is used for the combat sequences.</p><p>The player is cast in the role of an ordinary young man who discovers that he is really a prince, and the son of the deceased good King Erik. He is charged with traveling around the land of Excalabria to collect the eight magic Rings of Good, defeating a number of boss enemies on the way to confronting the evil King Tsarkon.</p>"},{"name":"Syd of Valis","year":1992,"developer":"I.S.C. Co., Ltd.","url":"d#Syd%20of%20Valis%20%28USA%29.zip","filesize":287755,"score":5.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fantasy","desc":"<p><em>SYD of Valis</em> is a reworked version of the action-platformer Valis II with simplified gameplay and a \"Super Deformed\" and kid-friendlier graphic design.</p><p>In the game you play as Yuko (Syd in the localized version), a teenage schoolgirl that can wield the magical sword of Valis and must travel to the dreamworld of Vekanti to defeat the evil lurking within it.</p><p>The game plays as a side-scrolling action platformer, in which you avoid obstacles by running and jumping around, and must defeat enemies by striking them with your blade. You can collect power-ups that include different weapons and armor types, all of which you can equip at any time during the game.</p>"},{"name":"Sylvester and Tweety in Cagey Capers","year":1994,"developer":"TecMagik Entertainment Ltd.","url":"d#Sylvester%20%26%20Tweety%20in%20Cagey%20Capers%20%28USA%2C%20Europe%29%20%28Beta%29.zip","filesize":734575,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Licensed","desc":"<p>Another Warner Bros licensed title. You are Sylvester (the cat) and you are out to catch your favorite meal Tweety (the bird).</p><p>This game is a 2D side-scrolling action, platform and reflex game. In order to catch Tweety, you will have to overcome many obstacles, which become more and more difficult as you progress through the game.</p>"},{"name":"Syndicate","year":1994,"developer":"Bullfrog Productions, Ltd.","url":"d#Syndicate%20%28USA%2C%20Europe%29.zip","filesize":1129237,"score":7.1,"genres":"Action > Strategy > Diagonal-down > Isometric > Real-time > Cyberpunk / dark sci-fi","desc":"<p><em>Syndicate</em> for Nintendo and Sega systems adapts the computer original for the capabilities of the consoles. While it follows the same gameplay template, it is redesigned in a much more cartoony style, has multiple differences in gameplay and controls and features completely new levels.</p><p>Taking the role of an executive of a criminal syndicate in a dark cyberpunk future, the player controls teams of cyborg agents on missions: assassinating politicians, opinion leaders or executives from rival syndicates, retrieving important objects, kidnapping scientists or taking out enemy agents. The world map consists of 50 regions, each containing one level (two training levels are also available). The stages are presented in isometric view, and one to four agents are controlled. Unlike the indirect cursor control in the computer versions, on the consoles the agents are controlled directly, with potential targets being selected automatically. Unlike the multi-layered versions of the computer game, all levels consist of one layer only.</p><p>Between missions, taxes from conquered territories can be spent on researching new weapons and cybernetic upgrades for the agents. These are all the same as on the computer versions, with the exception of the flame thrower, which has been replaced with the less gruesome 'chiller'. Indirect control of the agents with drugs influencing adrenaline, perception and intelligence also remains the same. The policemen and guards from the original are gone, their place being taken by robotic drones.</p>"}]