[{"name":"T2 - The Arcade Game","year":1993,"developer":"Midway Manufacturing Company","url":"d#T2%20-%20The%20Arcade%20Game%20%28USA%2C%20Europe%29.zip","filesize":485102,"score":6.7,"genres":"Action > 1st-person > Arcade > Rail shooter > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>This is an arcade rail-shooter based on the film <em>Terminator 2: Judgment Day</em>. Up to two players shoot through future and present levels as robotic killers reprogrammed to serve the human resistance. </p><p>Both players wield a machine gun with infinite ammo that lowers its firing rate (overheats) as it is continuously fired. A secondary weapon (missile launchers in the future, shotguns in the present) has limited ammo but deals heavy damage. Powerups inside the game world include secondary weapon ammo and coolant for the machine guns, and are shot to be collected.</p><p><em>Terminator 2: Judgment Day</em>, renamed <em>T2: The Arcade Game</em> for home conversions, features seven levels based on specific scenes or general concepts in the film. The first four levels act as a prelude, as the player guns down waves of metal Terminators across a post-apocalyptic Battlefield, a besieged Human Hideout, and through the security checkpoints of the enemy supercomputer SkyNet. After destroying the computer, players travel back in time to protect John and Sarah Connor, while also destroying every scrap of SkyNet research at the headquarters of its manufacturer. From there, players must fend off the indestructible T-1000 until the final showdown in the Steel Mill.</p><p>Assets from the movie are used when possible, such as voice clips from Arnold Schwarzenegger, and close-up digital stills of Robert Patrick for the final battle against the T-1000. The Genesis and SNES versions also support lightguns (the Menacer and Super Scope, respectively).</p>"},{"name":"T2: Terminator 2 - Judgment Day","year":1993,"developer":"B.I.T.S., Ltd.","url":"d#T2%20-%20Terminator%202%20-%20Judgment%20Day%20%28USA%2C%20Europe%29.zip","filesize":633836,"score":5.9,"genres":"Action > Side view > Top-down > Fighting > Sci-fi / futuristic > Licensed","desc":"<p>One of the several games based on the eponymous movie. The player controls the T-800 terminator, a cyborg from the future, who travels to the year 1995 to protect John Connor, the future leader of the human resistance against machines, from being killed by another terminator, the highly advanced model T-1000. </p><p>This adaptation of the movie is essentially a side-scrolling action game, with both melee combat and shooting; there are also driving sequences between the side-scrolling levels, which mainly consists of avoiding pursuers and safely arriving to the next destination. T-800's default weapon is a pistol, but he can later acquire other weapons such as a shotgun, a mini-gun, etc. The \"good terminator\" can also use kicks and punches to dispose of the enemies. As in the movie, T-1000 appears frequently and must be fought and incapacitated, but can not be permanently killed until the ending part.</p><p>Another objective the player must complete is collecting various robotic parts that could lead to a construction of a new terminator. These parts must be sought out and destroyed, to make this new technique impossible.</p>"},{"name":"Taiheiki","year":1991,"developer":"Tose Co., Ltd."},{"name":"Taikō Risshiden","year":1993,"developer":"KOEI Co., Ltd."},{"name":"Tanglewood","year":2018,"developer":"Big Evil Corporation Ltd.","url":"d#Tanglewood.zip","filesize":592978,"score":8.1,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>TANGLEWOOD® is a brand new and original puzzle-platforming game originally released for the SEGA Mega Drive and Genesis, coming soon to Windows, Mac, Linux, Everdrive, and your favourite Mega Drive emulators. A true 16-bit, challenging platforming experience that will make fans of the golden gaming era feel warm and fuzzy.</p><p>Set in a fictional world, the game follows a young creature, Nymn, who is separated from home after the twin suns set. Unable to get back to safety, Nymn must find a way to survive the night terrors and make it to morning. TANGLEWOOD’s world is a dangerous one after dark, and Nymn must use skills of evasion, special abilities, traps and trickery to defeat predators.</p><p>TANGLEWOOD® is programmed in pure 68000 assembly language, using original development tools and processes from the 1990s.</p>"},{"name":"Tänzer","year":2019,"developer":""},{"name":"Target Earth","year":1990,"developer":"NCS Corporation","url":"d#Target%20Earth%20%28USA%29.zip","filesize":271100,"score":6.4,"genres":"Action > Side view > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Target Earth</em> is a space shooting game set in the future with Earth under attack by robots. The protagonist of the game is a pilot of a mech robot which can either walk on planet surfaces or fly in space. There are two types of levels in the game. Surface levels take place on planets or moons and allow the mech to run and jump to the end of the level while fighting enemies, as in a side scrolling game. Space levels have no gravity and allow the mech to move in any direction. The mech can be equipped with a large assortment of machine guns, lasers, and grenades.</p>"},{"name":"Task Force Harrier EX","year":1991,"developer":"NMK Co. Ltd.","url":"d#Task%20Force%20Harrier%20EX%20%28USA%29.zip","filesize":590403,"score":"","genres":"Action > Top-down > Arcade > Shooter","desc":"<p>An underground communist group vying for world domination has resurfaced after years in hiding. They have developed the experimental warfighter TU-190, which has enough firepower to threaten the entire free world, and it's headed for the United States. The UN sends in a lone fighter, Falcon, who must break through the enemy lines, destroy TU-190, and save the free world from destruction. Commence operation!</p><p><em>Task Force Harrier EX</em> is a vertically-scrolling shooter based on the 1989 arcade title Task Force Harrier; from UPL. The player controls the titular Harrier V fighter plane, which fires both air and ground volleys -- necessary to hit the targets that approach from both the air and the ground, like in Xevious. The player can collect various power-ups to increase their firepower, including smart bombs, weapon upgrades, and most notably a pair of invulnerable satellites which can change formation at command. There are three difficulty settings and a total of twelve stages to blast through.</p>"},{"name":"Taz in Escape from Mars","year":1994,"developer":"HeadGames, Inc.","url":"d#Taz%20in%20Escape%20from%20Mars%20%28USA%29.zip","filesize":1079498,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>You play as Taz, the famous cartoon-character. Taz is captured by Marvin the Martian and transfered to his intergalactic Zoo! Now it is your job to aid Taz in his great escape from the Zoo-prison and also find a way back home to Earth. To make the escape a little easier, there are items placed here and there, such as cakes which make regain your health. You also find gas tanks, which you can eat and then breath fire.</p><p>You will travel through the Zoo, and a big wasteland and many other hostile zones with lots of weird enemies and bizarre bosses.</p>"},{"name":"Taz-Mania","year":1992,"developer":"Recreational Brainware","url":"d#Taz-Mania%20%28World%29.zip","filesize":340609,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Oceania > Licensed","desc":"<p>The relatively minor <em>Looney Tunes</em> character The Tasmanian Devil experienced a revival in the 1990s with the TV series <em>Taz-Mania</em>, starring Taz and his family. One of several games based on the license, the Genesis version features the same story as the other Sega versions, but has a unique design and set of levels.</p><p>Inspired by a tale his father told, Taz goes on a quest for the egg of a giant prehistoric seabird, which will lead him across the whole of Taz-Mania through 16 levels of platforming action. He must survive a desert, a jungle, a car factory, a mine and ancient ruins. Taz is able to run, jump, and spin fast to turn into his trademark whirlwind. While spinning, he can knock out most enemies he comes across. He can also pick up many different items and try to eat them or use them in another way. Most foods replenish his health, while eating hot peppers gives him a fire breath attack. Stars grant temporal invulnerability, while bombs should be thrown at enemies (and definitely not be eaten!).</p><p>Several levels feature boss fights. A break from standard platforming comes in the shape of a mine cart ride, where the cart must be raised or lowered to avoid collisions, and a wild river, which can only be crossed by jumping across fast-sinking tree logs, reminiscent of Frogger.</p>"},{"name":"Team USA Basketball","year":1992,"developer":"Electronic Arts, Inc.","url":"d#Team%20USA%20Basketball%20%28USA%2C%20Europe%29.zip","filesize":578724,"score":7.5,"genres":"Sports > Side view > Basketball","desc":"<p>The 1992 edition of Electronic Arts' basketball series centers on the 1992 Olympics in Barcelona and features the original US \"Dream Team\" with such legendary players as Michael Jordan, Magic Johnson, Larry Bird, David Robinson, John Stockton, Charles Barkley, Patrick Ewing and Karl Malone.</p><p>In addition to the US team there are 13 other national teams with real team rosters. There is also an \"All-World\" team with the best of the non-US players.</p><p>The game engine and gameplay mechanics are reused from the previous games in the NBA Playoffs series. There are new signature moves and the game features the international rules.</p>"},{"name":"Techno Cop","year":1990,"developer":"Imagexcel","url":"d#Technocop%20%28USA%29.zip","filesize":255986,"score":5.9,"genres":"Action > Racing / Driving > Behind view > Side view > 2D scrolling > Arcade > Cyberpunk / dark sci-fi > Licensed","desc":"<p>Techno Cop is set in the near future. You are a cop who seeks to clear his town of all the criminal scum. The game consists of two parts; one driving-action and one sidescrolling-action. In the first part you drive around in your red Ferrari and destroy hostile cars; in the second part, you turn somersaults over gaps, use elevators and shoot lots of enemies until you reach the boss. After having killed / caught the villain, it's back to the road again for the next mission.</p>"},{"name":"TechnoClash","year":1993,"developer":"Zono, Inc.","url":"d#TechnoClash%20%28USA%2C%20Europe%29.zip","filesize":530408,"score":6.7,"genres":"Action > Top-down > 2D scrolling > Cyberpunk / dark sci-fi","desc":"<p>Ronaan, the Wizard Prince, is given the task of chasing the Engine Man (a half man, half machine entity that infiltrated the magickal Inner Realm) into a world that has been overrun by technology. Joined by his bodyguards, Chazz and Farrg, and his spirit guide, Indar, Ronaan joins the battle between magick and technology whose outcome will determine the fate of two dimensions.</p><p><em>TechnoClash</em> is a top-down scrolling action game. The player controls Ronaan, whose goal is to track down and defeat the Engine Man. Ronaan is accompanied by two computer-controlled bodyguards who help him in combat situations; he can scout out the tactical situation using Indar, a falcon who can fly anywhere; and he can cast spells to accomplish many tasks, including attacking his foes, teleporting out of danger, and healing himself.</p>"},{"name":"Tecmo Super Baseball","year":1994,"developer":"Sculptured Software, Inc.","url":"d#Tecmo%20Super%20Baseball%20%28USA%29.zip","filesize":649770,"score":7.1,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>This is Tecmo's attempt at baseball after their Tecmo Bowl series. It has 700 authentic MLBPA players including Ken Griffey Jr., Tony Gwynn and Barry Bonds to name a few. However, it does not feature an MLB license, so the cities nicknames and logos have been omitted, but all 28 teams with 1993 stats are still included.</p><p>The standard modes apply including <em>Exhibition</em>, <em>All-Star</em> and <em>Season</em> in which the player can choose either to play a full or reduced season. The player can also choose to simulate games and watch them unfold or they also have the option to manage their team and watch the outcome of their decisions. It also features a battery backup to allow saving of stats and games as well as two-player capabilities to allow friends to compete head-to-head.</p>"},{"name":"Tecmo Super Bowl","year":1993,"developer":"Tecmo, Ltd.","url":"d#Tecmo%20Super%20Bowl%20%28USA%29.zip","filesize":449228,"score":7.3,"genres":"Sports > Side view > Football (American) > Licensed","desc":"<p>Tecmo returns to the gridiron with this new version of Tecmo Super Bowl for 16-bit console systems. Play with real National Football League players and teams in this 2D, side-scrolling arcade game.  All of the features from the 8-bit game remain intact, with brand new ones added for even more electronic football fun!  </p><p>Additions include updated player rosters, options for weather effects (rain, snow), multiple season play (three regular season schedules available in all), adjustable game time length, and an offensive playbook that can be edited even during a game.</p>"},{"name":"Tecmo Super Bowl II: Special Edition","year":1994,"developer":"Tecmo, Ltd.","url":"d#Tecmo%20Super%20Bowl%20II%20-%20Special%20Edition%20%28USA%29.zip","filesize":992036,"score":7.2,"genres":"Sports > Side view > Football (American) > Licensed","desc":"<p>The follow up to the first 16-bit version of Tecmo Super Bowl. Includes the real NFL teams and players and the same basic gameplay as previous installments in the series.  There are also variety of new features and minor enhancements, such as slightly angled play perspective, larger player graphics, new movement animations, expanded playbooks, fake kicks/punts, audibles, and auto-scheduling based on your won-loss record from the previous year.</p>"},{"name":"Tecmo Super Bowl III: Final Edition","year":1994,"developer":"Tecmo, Ltd.","url":"d#Tecmo%20Super%20Bowl%20III%20-%20Final%20Edition%20%28USA%29.zip","filesize":892756,"score":7.2,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American)","desc":"<p>A late entry in what was once the premiere football simulation, TSB III has updated rosters and teams for the 1994-1995 season and is licensed by both the NFL and the Players group.  Features real NFLP players and photos, the real NFL schedule, and weekly standings.  You can change defensive and offensive formations, create your own Pro Bowl, fake punts and field goals, go for the two point conversion, and call audibles.  Updates to the game itself include new cinema screens, superstar mode, free agency system, improved graphics, larger field simulation, passing modes, and improved speech and music.  Horizontal scrolling.  Also features battery back-up.</p>"},{"name":"Tecmo Super Hockey","year":1994,"developer":"Malibu Interactive","url":"d#Tecmo%20Super%20Hockey%20%28USA%29.zip","filesize":600080,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p>Tecmo's take on ice hockey, <em>Tecmo Super Hockey</em> features the license from the NHLPA, having the top players of the game at the time. It offers exhibition and regular games as well as playing a season with updated stats and the ability to play in the All-Star game as well. Gameplay is similar to other games, with buttons to pass, shoot, making slap-shots and fake shots, as well as fighting, which is not a common feature. It can be played by two players simultaneously.</p>"},{"name":"Tecmo Super NBA Basketball","year":1993,"developer":"Sculptured Software, Inc.","url":"d#Tecmo%20Super%20NBA%20Basketball%20%28USA%29.zip","filesize":647878,"score":7.5,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>Tecmo Super NBA features real teams (all 27 contemporary teams) and a roster of real players (over 320).  One or two players can compete in regular, reduced, or short seasons, or play an exhibition game.   Though primarily horizontal scrolling, digitized speech and cinemas, along with a free throw point of view, add drama to the proceedings.  Besides the expected elements of basketball (substitutions, penalties, steals and blocks, time-outs, overtime), Super NBA gives you the chance to call offensive plays and to program win/loss records.  Has a battery to back-up season play.</p>"},{"name":"Tecmo World Cup","year":1992,"developer":"Tecmo, Ltd.","url":"d#Tecmo%20World%20Cup%20%28USA%29.zip","filesize":162536,"score":5.9,"genres":"Sports > Side view > Arcade > Football (European) / Soccer","desc":"<p><em>Tecmo World Cup</em> is a football game which features solely national teams. Like the title indicates, you can play the World Cup tournament, which will also include a qualification round. You can choose your team from a pool of 24 nations, though the assortment is not identical to the roster of the latest World Cup by the time of the games release. Also, the qualification, in contrast to the real World Cup, only has four teams as no other than the available 24 teams take part. Apart from the World Cup, the only other single-player mode is a friendly match against a randomly chosen team.</p><p>The gameplay is shown from the side and above. Before a game begins, you choose one of four different tactics (which can't be changed during half time), further team management does no exist.The game uses two buttons, one for passing and tackling, the other one for shooting or changing to another player when the opposing team has the ball.</p>"},{"name":"Teddy Boy Blues","year":1992,"developer":"SEGA Enterprises Ltd."},{"name":"Teenage Mutant Ninja Turtles: The Hyperstone Heist","year":1992,"developer":"Konami Co., Ltd.","url":"d#Teenage%20Mutant%20Ninja%20Turtles%20-%20The%20Hyperstone%20Heist%20%28USA%29.zip","filesize":665914,"score":7.6,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p>The Turtles' nemesis Shredder has acquired the Hyperstone from Dimension X, and is using its powers to shrink down the city buildings. He threatens to take over the world and challenges the Turtles to deny him, and so the turtles head out to beat the guy once more.</p><p>A standard Ninja Turtles beat-em-up action game.</p>"},{"name":"Teenage Mutant Ninja Turtles: Tournament Fighters","year":1993,"developer":"Konami Co., Ltd.","url":"d#Teenage%20Mutant%20Ninja%20Turtles%20-%20Tournament%20Fighters%20%28USA%29.zip","filesize":1119310,"score":7.2,"genres":"Action > Side view > Arcade > Fighting > Martial arts","desc":"<p><em>Teenage Mutant Ninja Turtles: Tournament Fighters</em> is a fighting game in the tradition of the Mortal Kombat or Street Fighter series, pitting the player against one opponent at a time. The game features eight fighters: the four turtles, Casey Jones, April O'Neil, Ray Fillet (from the comics) and the original character Sisphyus.</p><p>The gameplay is similar to other games in this genre: each character has standard attacks (normal and strong) as well as special attacks which require button combinations to perform. The goal is to deplete the other fighter's life energy completely. However, a losing opponent has one last straw: a very powerful attack which is only unlocked shortly before death. The amount of rounds can be set between one and seven.</p><p>The game's modes include a story mode, in which the selected hero has to battle against Krang's evil clones of the player characters in order to save the kidnapped Splinter, a two-player mode, a practice mode and a tournament mode which requires the player to fight against multiple opponents one after another with only one life bar.</p>"},{"name":"Tel-Tel Mahjong","year":1990,"developer":"Sun Electronics Corp."},{"name":"Tel-Tel Stadium","year":1990,"developer":"Sun Electronics Corp."},{"name":"Tenka Tōitsu","year":1991,"developer":"SystemSoft"},{"name":"Terminator, The","year":1992,"developer":"Probe Software Ltd.","url":"d#Terminator%2C%20The%20%28USA%29.zip","filesize":408407,"score":6.4,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Direct control > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p><em>The Terminator</em> licensed game for the Sega consoles was a fairly standard side-scrolling platform game. However, the game's six levels mirror the story-line of The Terminator movie very closely as you take on the role of Kyle Reese and his quest to save Sarah Connor from termination.</p><p>Because the game follows the movie so closely, the first mission which involves blowing up the SkyNet computer and escaping through time is one of the hardest and something that most players remember with love/hate.</p>"},{"name":"Test Drive II: The Duel","year":1992,"developer":"Distinctive Software, Inc.","url":"d#Test%20Drive%20II%20-%20The%20Duel%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":388878,"score":5.8,"genres":"Racing / Driving > Simulation > 1st-person > Automobile > Street racing > Vehicle simulator","desc":"<p>Unlike the computer version which consists of one long race with intermittent stops at gas stations, this version features three different races. The game also adds another car, the Lamborghini Diablo, which was not in the computer version.</p>"},{"name":"Tetris","year":1989,"developer":"SEGA Enterprises Ltd.","url":"d#Tetris%20%28World%29%20%28Genesis%20Mini%2C%20Mega%20Drive%20Mini%29.zip","filesize":126443,"score":6.6,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p><em>Tetris</em> is one of many conversions of the famous block-stacking game. The goal is to place pieces made up of four tiles in a ten-by-twenty well, organizing them into complete rows, which then disappear. As rows are cleared, the pace of the game increases and the background changes, and the game ends if the stack reaches the top of the well.</p><p>In addition to a standard endless mode for one or two players, the game also includes a \"time trial\" mode for one or two players, where the goal is to get as many points as possible in three minutes. There is also a \"doubles\" mode, where two players work together to fill lines in an extra-wide well, each controlling their own pieces simultaneously.</p><p>The game offers a number of standard options: setting the starting level, how much \"garbage\" is at the bottom of the well when the game starts, and whether the next piece is visible. There are also optional \"item blocks,\" which are special flashing pieces that give an extra bonus if they are used to clear a line.</p>"},{"name":"Theme Park","year":1995,"developer":"Bullfrog Productions, Ltd.","url":"d#Theme%20Park%20%28USA%2C%20Europe%29.zip","filesize":744741,"score":7.8,"genres":"Strategy > Diagonal-down > Free-roaming camera > Real-time > City building / construction simulation > Managerial / business simulation > Point and select","desc":"<p>Dominating the exciting world of Theme Park ownership is your goal in this strategy game from Bullfrog. The first task is to set up your rides within the available land, structuring convenient paths and queues and ideally leaving some space for bigger rides once they become available, and include some lakes and trees to increase the park's allure. Rides range from Teacups and Haunted Houses to the biggest most elaborate roller-coaster you can design, and water rides that loop around other rides.</p><p>Shops must also be included so that the visitors can buy food, drinks, and souvenirs - the cunning player will combine salt, sugar, and caffeine settings to maximize consumer interest. Staff must be hired to keep everything running smoothly, and they will only work for what they consider a fair rate of pay.</p><p>You are competing against other Theme Parks, so don't let them get an advantage over you - monitor your success in attracting customers and financial viability closely using the supplied statistics pages. More important, ensure that research is adequately funded to produce new rides.</p><p>It can be played in three modes - Sandbox level lets you concentrate on the park design elements, while Sim and Full add more strategic features.</p>"},{"name":"Thomas the Tank Engine & Friends","year":1993,"developer":"Malibu Interactive","url":"d#Thomas%20the%20Tank%20Engine%20%26%20Friends%20%28USA%29.zip","filesize":654350,"score":"","genres":"Action > Racing / Driving > Diagonal-down > Top-down > Direct control > Train > Licensed","desc":"<p><em>Thomas the Tank Engine &amp; Friends</em> is a game primarily meant for children.</p><p>Before going into the game proper, players are first given five different coloring book pages to fill in with each page based on the television show's characters.</p><p>The main portion of the game is split into three modes. The modes are Game, Race, and Explore. Game mode has Sir Topham Hatt giving the player objectives such as finding a mine car, a log car, and a passenger car, and bringing them to a specific train station. The more speedier the player completes their task the higher their score will be. Race mode has the player racing against an opposing train. Explore mode allows the player to freely drive around on the train tracks with no particular objectives. The game offers an easy, medium, and hard difficulty level.</p>"},{"name":"Thunder Force II","year":1989,"developer":"Technosoft Co., Ltd.","url":"d#Thunder%20Force%20II%20%28USA%2C%20Europe%29.zip","filesize":381145,"score":7.1,"genres":"Action > Side view > Top-down > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p><em>Thunder Force II</em> is both a side scrolling and top down shooter. In the game you control a ship. In some stages the action is side scrolling and in others it is top down (overhead). The weapons systems is fairly basic. You can switch from shooting a more powerful weapon straight ahead or two less powerful guns shooting forward and backward simultaneously. There are various power-ups that improve your fire power. </p><p>In the top down levels you can only travel in cardinal directions and cannot maneuver around obstacles easily or slow down. The control in the side scrolling levels is reminiscent of R-Type or Gradius, but with more basic weapons systems. In future incarnations of the series the top down aspect would be abandoned.</p>"},{"name":"Thunder Force III","year":1990,"developer":"Technosoft Co., Ltd.","url":"d#Thunder%20Force%20III%20%28Japan%2C%20USA%29.zip","filesize":345868,"score":8.3,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>The famous shoot'em up series Thunder Force reaches its third installment. Eight new levels of non-stop action, as always packed with gargantuan bosses. </p><p>What made Thunder Force stand apart from the other shooters, the ability to switch weapons on the fly, hasn't changed a bit.However, the original mix of side-scrolling and top-view levels that was present in Thunder Force II has been dropped; only the side-scrolling levels remain.</p>"},{"name":"Thunder Fox","year":1991,"developer":"Taito Corporation","url":"d#Thunder%20Fox%20%28USA%29.zip","filesize":577300,"score":6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > War","desc":"<p>In 19xx, the world is overtaken by a storm of terrorism, and the evil power of invasion extends over the land, sky, and sea. However, there are brave men fighting against it for putting down a storm. The anti-terrorism team of Thunder and Fox is called in to complete a series of missions, ranging from breaking through the enemy's barrier and destroying their choppers, to destroying the enemy's headquarters.</p><p>Walk through the levels and destroy enemies using your knife and defeat the end-of-level bosses. Various weapons are at your disposal, including flamethrowers, bazookas, machine guns, and grenades. You can also pistol-whip enemies as well. Smash open crates for 500 points, 1000 points, and extra life + 5000 points.</p>"},{"name":"Thunder Pro Wrestling Retsuden","year":1992,"developer":"Human Entertainment, Inc."},{"name":"Thunderbolt 2","year":1995,"developer":"Gamtec Corp."},{"name":"Tick, The","year":1994,"developer":"Software Creations Ltd.","url":"d#Tick%2C%20The%20%28USA%29.zip","filesize":953267,"score":5,"genres":"Action > Side view > Isometric > Arcade > Beat 'em up / brawler > Fighting > Platform > Licensed","desc":"<p>Get ready to put your blue skin-tight tights on. Ninjas need beating-up, bosses need clobbering! This game is not so much a platform game as it is a fighting game (think Streets of Rage). You run around the levels avoiding sharp flying objects and fighting any enemies that get in your way, including the numerous bosses. If your in a tight spot you cancall Arthur to help defeat any enemies that are on-screen. The game is presented in a normal 2D platformer view when you're just jumping from building to building, but changes to a semi-isometric view when you start fighting. You'll probably like it if you like Streets of Rage.</p>"},{"name":"Time Killers","year":1996,"developer":"Incredible Technologies, Inc.","url":"d#Time%20Killers%20%28USA%29.zip","filesize":1311655,"score":"","genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p><em>Time Killers</em> is a one-on-one versus beat-em-up with gameplay in a similar vein as Mortal Kombat and Street Fighter 2. </p><p>What is primarily different is that you can attack with all body parts - the head, both arms and both legs. A damage system allows arms to be hacked off, but fighters can keep going with only legs and the head. A special feature allows the characters to perform a decapitation manoeuver called a 'death move' (similar to Barbarian), at any time during a round, instantly killing an opponent, and subsequently ending the round. The game features cartoon-like over-the-top blood and gore violence.</p><p>There are eight selectable characters, and each one has unique weapons and attributes pertaining to the period in time they are from, e.g. Thugg is a caveman with a stone axe from 20,000 BC, Musashi is a samurai from Feudal Japan 1496, Orion is an intergalactic bounty hunter with an electro-sword from 2885 etc.</p><p>In the single player game, if you manage to defeat all standard opponents, you can face off against Death himself.</p>"},{"name":"Time Trax","year":1994,"developer":"Malibu Interactive","url":"d#Time%20Trax%20%28USA%29%20%28Proto%29.zip","filesize":581392,"score":6.8,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Time Trax</em> is based off of the 1993-94 sci-fi action series starring Dale Midkiff; you take the role of Darien Lambert, captain of the Fugitive Retrieval Section of Washington D.C. It is the year 2193 and your once high arrest record has started to decline sharply as routine trackdowns end in mysterious disappearances. It is discovered that noted MIT scientist Dr. Mordecai 'Mo' Sahmbi has been sending criminals back in time to 1993 using his invention the TRAX time machine, and has gone back himself. TRAX is captured by the police, and three guesses as to who is tasked with capturing the criminals and sending them back to 2193.</p><p>As Lambert, your primary targets in this game are neo-Nazi racist Sepp Dietrich and Sahmbi himself. You do have some equipment to help you: your supercomputer S.E.L.M.A. (Specified Encapsulated Limitless Memory Archive), disguised as an AT&amp;T Mastercard and whose holographic persona resembles a British nanny, and the PPT (Pellet Projection Tube), a weapon capable of stunning a human from periods of a couple of minutes to a few hours and can fire pellets that render humans transportable to the future, disguised a keyless car alarm remote. Also, you have the ability to \"time stall\" (this slows the speed of images reaching your brain, allowing you to react quickly) and your Mosh-Ti (an Occidental improvement of martial arts) skills to rely on if the situation gets dire.</p><p>You'll run through the alleys of the future, through the Smithsonian (circa 1993), ride a motorcycle and jet-ski, battle criminals atop a construction site, and do so much more until you've finally captured the two fugitives.</p>"},{"name":"TinHead","year":1993,"developer":"MicroProse Ltd.","url":"d#Tinhead%20%28USA%29%20%28Ballistic%29%20%28April%2C%201994%29.zip","filesize":488866,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>On the edge of the universe, the evil intergalactic goblin Grim Squidge has captured and imprisoned all the stars. He has now scattered them across to faraway planets. While this is happening, a nearby space station picks up a distress signal. Tinhead, guardian of the edge of the universe, hears the cries for help and hurries to the rescue.</p><p><em>TinHead</em> is a platform game. Some exploration is required to find the exit or gather extra health or points. Attacking enemies is done by shooting them with small metal orbs that come out of TinHead's head. He can shoot them in three different directions: diagonal upward, straight, or just let them jump out and bounce over the ground. The direction is chosen by using a specific button.</p>"},{"name":"Tintin in Tibet","year":1995,"developer":"Infogrames Europe SA","url":"d#Tintin%20in%20Tibet%20%28U%29%20%28M6%29.zip","filesize":876473,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>A platform game starring Tintin. <em>Tintin in Tibet</em> follows on the heel of Infogrames Asterix &amp; Obelix, with the same gameplay. Although the game will prove easy for the expert gamer, there are many levels to pass, each of which features new locations, enemies, and obstacles that serve to advance the storyline.</p>"},{"name":"Tiny Toon Adventures: Acme All-Stars","year":1994,"developer":"Konami Co., Ltd.","url":"d#Tiny%20Toon%20Adventures%20-%20ACME%20All-Stars%20%28USA%2C%20Korea%29.zip","filesize":578550,"score":7.3,"genres":"Sports > Top-down > Isometric > Basketball > Bowling > Football (European) / Soccer","desc":"<p><em>Tiny Toon Adventures: Acme All-Stars</em> features all the usual characters from the Tiny Toon Adventures animated series. </p><p>There are several different game options. The main two games are Soccer and Basketball. Both of these options allow you to pick your own team of 4 characters and to choose their playing positions. You can then pick from 5 different sporting arenas. Play against the CPU or against a friend. The Story Mode sees a predetermined team competing at several different events at the Acme Looniversity Tournament. </p><p>Finally there are three smaller games to play: Obstacle Course, 10 Pin Bowling, and Montana Hitting (like the \"hit the pop up monsters with a hammer\" machines that you see in amusement arcades).</p>"},{"name":"Tiny Toon Adventures: Buster's Hidden Treasure","year":1993,"developer":"Konami Co., Ltd.","url":"d#Tiny%20Toon%20Adventures%20-%20Buster%27s%20Hidden%20Treasure%20%28USA%29.zip","filesize":366892,"score":8.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Puzzle elements > Licensed","desc":"<p>While cleaning up Acme Looniversity, Buster discovers a map leading to a secret treasure! But Montana Max swipes the map, and goes after the treasure himself. He also gets Dr. Gene Splicer to brainwash most of Buster's friends, and kidnaps the rest of them! Buster has to reclaim his map, his treasure, and save everyone while he's at it!</p><p>Buster's Hidden Treasure is a platform game starring Buster and many other Tiny Toons characters. As Buster, players run through each level, jumping on enemies to defeat them. Buster can also pick up carrots - for every fifty he collects, he gets a helper friend which can be used to destroy all enemies on the screen. Although Buster only starts the game with three hearts, his health meter can be increased by collecting bells.</p><p>The goal of each level is to find Gogo Dodo, who will let Buster exit the level. Similar to Super Mario World, Buster's Hidden Treasure has a world map that you can select your level from. Also similar to Mario World, some levels contain hidden exits, creating shortcuts, or granting players access to tougher levels.</p>"},{"name":"TNN Bass Tournament of Champions","year":1993,"developer":"Imagitec Design Inc.","url":"d#TNN%20Bass%20Tournament%20of%20Champions%20%28USA%29.zip","filesize":740777,"score":"","genres":"Sports > 1st-person > Top-down > Fishing > Licensed","desc":"<p>Despite sharing the name and the publisher of the contemporary SNES title, the Genesis version has similar gameplay, but looks different and was done by another development team. In this fishing simulator players get to participate in a fishing tournament. Starting at 7.30 in the morning, the player has until 4PM to take a boat on the lake and fish for bass to beat competitors. The boat can be steered freely using a top-down view until an appropriate spot has been found by checking the lowrance monitor. The game then switches to a first-person view, also showing the fisher from a side-view on a separate part of the screen, and it is possible to look around in the environment.</p><p>Casting is done using a power meter to determine the distance. As the bait sinks, a monitor can be checked for nearby fish. There are also visual clues through splashing water. The player can check the depth and reel in when needed. When a fish has been caught, it becomes a sensitive play with the line tension to make sure it does not snap shown through the side-view of the fisher. At the end of the day the boat can go back to the weighing area to determine the results. Money earned in the tournaments can be used to acquire new spin reels, bait reels, boats, lines and lures.</p><p>Next to the tournament there is a music player and a free fishing mode. In the free fishing mode every option can be customized, such as six types of lakes, the starting time, the direction and the strength of the wind, overall weather and the temperature.</p>"},{"name":"TNN Outdoors Bass Tournament '96","year":1996,"developer":"Imagitec Design Inc.","url":"d#TNN%20Outdoors%20Bass%20Tournament%20%2796%20%28USA%29.zip","filesize":560419,"score":"","genres":"Sports > Behind view > Top-down > Fishing > Licensed","desc":"<p><em>TNN Outdoors Bass Tournament '96</em> is the sequel to TNN Bass Tournament of Champions. It shares many elements with the PC game of the same name, but that version has an isometric-style map and a full 3D view for the fishing sequences. Just like the original game it is a fishing simulator that allows the player to access a free fishing mode or to participate in a fishing tournament. First, equipment needs to be bought. It consists of lures, rods, reels, lines and boats. Better items can only be acquired by winning money in tournaments.</p><p>After selecting the equipment the game takes the player to a top-down map where one of the six available lakes can be explored. The included lakes exist in real life. They are Lake Okeechobee, Truman Reservoir, Lake Erie West, Dale Hollow, Lake Eufaula, and Bull Shoals. Through a monitor an appropriate spot for fishing can be found. Once set, the game then switches to a 3rd-person over the shoulder view, similar to the earlier SNES version instead of the previous Genesis game. Casting is done through a power meter and it is possible to do bad casts that need to be retried. Once in the water the camera switches to a top-down view inside the water. Players can watch the bottom surface and fish swimming by. When reeling in one of five available speeds can be chosen and the bait can still be moved. The game starts at 7.30 in the morning and the boat needs to return in time to weigh the fish.</p><p>In the free fishing mode various parameters can be defined such as the season, weather, starting time and wind strength. In a tournament these change dynamically. The game includes a music player for the soundtrack.</p>"},{"name":"Todd's Adventures in Slime World","year":1992,"developer":"Epyx, Inc.","url":"d#Todd%27s%20Adventures%20in%20Slime%20World%20%28USA%29.zip","filesize":218947,"score":6.9,"genres":"Action > 2D scrolling > Platform > Puzzle elements > Sci-fi / futuristic","desc":"<p>While flying your spaceship, you crash land on a planet covered entirely in slime.  You and a friend explore the labyrinthine planet of slime, armed with a water pistol and all manner of gadgets you find along the way in an effort to find your way back out.  The game world is a giant maze with quirky hidden areas and plenty of original layout ideas.  Depending on the game mode, you are either cooperating or competing with your \"friend\" to find and get to an exit first.  Due to the massive sizes of the slime worlds (about 6 entries to choose from), games often take several hours to complete.</p><p>The basis of the game is exploration, with varying game modes further focusing on competition, puzzle solving, speed, exploration, or cooperation.</p>"},{"name":"ToeJam & Earl","year":1991,"developer":"Johnson-Voorsanger Productions","url":"d#ToeJam%20%26%20Earl%20%28USA%2C%20Europe%2C%20Korea%29.zip","filesize":618226,"score":7.6,"genres":"Action > Diagonal-down > 2D scrolling > Sci-fi / futuristic","desc":"<p>Toejam and Earl are two hip aliens from the planet Funkotron. One day, they are cruisin' their galaxy in the sweet spaceship ride. Unfortunately, Earl wasn't paying enough attention to where he was driving, and ran the ship into an asteroid.  The ship crash landed onto the most bizarre planet in the galaxy: Earth.</p><p>Toejam and Earl must travel from level to level on Earth and collect the 10 scattered pieces of the ship. But the various Earthlings, such as Nerd Herds, Giant Hamsters, Phantom Ice Cream Trucks and the Bogeyman will make that difficult.</p><p>The power up items that TJ and E can pick up come in the form of wrapped presents. You never really know what a power up is until you open it. What's more, randomized levels and item locations make it a different game every time.</p><p>The game features a dynamic screen splitting - screen joining 2-player mode.Players start the game close to each other. If one gets away from the other, the screen vertically splits to allow each player to move freely. When players are close again, the screens join together to become one single screen.</p>"},{"name":"ToeJam & Earl in Panic on Funkotron","year":1993,"developer":"ToeJam & Earl Productions, Inc.","url":"d#ToeJam%20%26%20Earl%20in%20Panic%20on%20Funkotron%20%28USA%29.zip","filesize":1346633,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>The sequel to ToeJam &amp; Earl starts off where the first game ends. The two funky aliens have finally gathered all their rocket parts and left Earth for their home planet Funkotron. Accidentally, some earthlings manage to cling on to their spaceship and come along to Funkotron with them. Being responsible for the huge disturbance the humans are causing on their funky planet, the duo set off to clean up the mess.</p><p>The earthlings come in all sorts of surprising forms, kids running around, construction workers, tourists, and the regular wierdos. You can choose either character, or have two players play out together, as you hit the earthlings with special jars that suck them in, so they could be transported back to Earth. You meet other Funkotron inhabitants and interact with them, things like helping them find stuff or ringing their doorbell and running away. All these people will help you in getting the job done and preventing Funkotron from losing its funky-ness.</p>"},{"name":"Tōgi Ō: King Colossus","year":1992,"developer":"SEGA Enterprises Ltd."},{"name":"Toki: Going Ape Spit","year":1991,"developer":"Tad Corporation","url":"d#Toki%20-%20Going%20Ape%20Spit%20%28USA%2C%20Europe%29.zip","filesize":280795,"score":6.8,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>The hero of the game is a young jungle-man named Toki. One day the evil wizard Dr. Stark kidnaps his girlfriend Wanda. When Toki tries to save her, he is turned into a monkey! Now Toki has to find Dr. Stark in his palace, rescue Wanda, and become a human being again!</p><p><em>Toki</em> is a platform game with many various levels: jungle, underwater, volcanic caves, on the ice, etc. Toki's only weapons are spitting on the enemies or jumping on them and crashing them. There are many possibilities to upgrade his spitting \"weapon\"; for example, if he finds an upgrade, he can spit fireballs.</p>"},{"name":"Tom and Jerry: Frantic Antics!","year":1994,"developer":"Beam Software Pty., Ltd.","url":"d#Tom%20and%20Jerry%20-%20Frantic%20Antics%21%20%28USA%29.zip","filesize":509507,"score":6.2,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Tom and Jerry, the famous cartoon cat-and-mouse duo, have stopped fighting each other for a change. Their friend, the young girl Robyn, has been kidnapped, and it's up to them to rescue her. Starting out in the suburbs, the cat and mouse team must make their way through eight stages of platform action, moving through the city and into the mountains, all the while collecting fish and cheese, and finding occasional footballs to take out their enemies. The game can be played single-player, solo as Tom, or two-player simultaneous with Tom and Jerry teaming up.</p>"},{"name":"Tom Mason's Dinosaurs for Hire","year":1993,"developer":"SEGA Interactive Development Division","url":"d#Tom%20Mason%27s%20Dinosaurs%20for%20Hire%20%28USA%29.zip","filesize":629363,"score":6.9,"genres":"Action > Side view > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>\"Dinosaurs For Hire\" does not really have a plot. Unknown monsters and weird robotic creatures attack the Earth. For some reason, the only ones who can stop the invasion are the three Dinosaurs for Hire: Archie, a tyrannosaurus rex and their leader; the triceratops Lorenzo, lover of fine food, fine wine, and fine clothes, and the one-eyed, unpredictable stegosaurus Reese. Each dino has its own strengths and weaknesses. You guide the dinosaur of your choice through the platform levels of the game. You are equipped with a gun: tons of enemies will attack you from all the sides, so your best bet will be walking with the fire button pressed down. You can shoot to all the directions and also engage in melee combat when the enemy is too close. Each level has a boss enemy waiting for you in the end. There is also a cooperative two-player mode.</p>"},{"name":"Tommy Lasorda Baseball","year":1989,"developer":"SEGA Enterprises Ltd.","url":"d#Tommy%20Lasorda%20Baseball%20%28USA%29.zip","filesize":283503,"score":7,"genres":"Sports > Behind view > Top-down > Baseball > Licensed","desc":"<p>This was the first 16-bit baseball game on the market. Play alone or with a friend. Choose from any of the 26 major league teams. The game uses all of the real-life city names, but the stats and player names are fictional.</p><p>Once on the field, game play follows standard baseball rules. The password feature enables you to take your team all the way through a season to the World Series. The game also tracks all of the other teams in the league simultaneously.</p><p>Batters in the game are rated according to batting average, home runs, running speed, and fielding and throwing ability. Pitchers are rated by ERA, curve-throwing ability, stamina, top throwing speed, and the distance a hit pitch will travel. All the ratings make this game a challenge to your managerial ability as well as your gaming skill because you're calling the shots from the dugout.</p><p>The option screen enables you to decide how tough your computer opponent will be. You can play a pitcher's duel, a batter's slug fest, or a normal game. Decide whether there'll be fielding errors and determine how the wind will affect the hit balls. This game covers about every detail, right down to umps who shout \"safe\" or \"out.\"</p>"},{"name":"Tony La Russa Baseball","year":1993,"developer":"Beyond Software, Inc.","url":"d#Tony%20La%20Russa%20Baseball%20%28USA%2C%20Australia%29.zip","filesize":476913,"score":"","genres":"Sports > Diagonal-down > Fixed / flip-screen > Isometric > Managerial / business simulation > Baseball > Licensed","desc":"<p><em>Tony La Russa's Baseball</em> features over 500 real players, keeps statistics with 14 categories and gives players the option to watch, manage or play a game. The game has supported of STATS (Sports Team Analysis &amp; Tracking Systems) to compile statistics, along with a digitized pitcher and batter animations to make it seem more realistic.</p>"},{"name":"Top Gear 2","year":1994,"developer":"Gremlin Interactive Limited","url":"d#Top%20Gear%202%20%28USA%29.zip","filesize":444923,"score":7.7,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing > Oceania","desc":"<p>This third-person racing game resembles Gremlin's earlier Lotus series, in terms of its general look and feel, right down to the text font used in the game. Your task is to race through 16 countries, each of which features four races, with many real-world circuits recreated in incongruous locations (such as the Monza layout in Ayers Rock, and the old Hockenheim in Vancouver). </p><p>These four-race blocks each represent their own mini-championship, in which you race against 19 cars, needing to finish in the top 10 to continue, and with the top 6 scoring points 10-6-4-3-2-1, and the respective amount of money in thousands. This can be spent on various upgrades, ranging from engine to tires (wet and dry) and from shocks (front, side and rear) to gearboxes. The ideal approach is to buy the more expensive versions ASAP, as you get no saving when upgrading. If you win the four-race championship, you get the next password. </p><p>You get a set amount of nitro boost to use during each race, although bonus nitros, money and instant speed-up token appear on many tracks. Hazards such as puddles, barriers and ramps are also frequent.</p>"},{"name":"Top Pro Golf","year":1992,"developer":"Soft Machine"},{"name":"Total Football","year":1995,"developer":"","url":"d#Total%20Football%20%28U%29.zip","filesize":770476,"score":7,"genres":"Sports > Isometric > Football (European) / Soccer","desc":"<p>Named after the tactic invented by Rinus Michels and their \"Clockwork Oranges\" Dutch team of the 70's, <em>Total Football</em> is an International competition game including 52 teams (including an all-star team) and compete in a 16 team league, 32 team knockout and a 32 team tournament similar to the World Cup.</p><p>Featuring a low-angle isometric view (not compensated by the d-pad, meaning pressing right will move the player along the half-way line (his right), not in the direction of the right corner flag (the screens' right) like in most games featuring axonometric views, while buttons allow to pass the ball in different strengths or kick at goal. Managing is limited to the choice of eight different formations at the start of the game and half-time.</p><p>Options include the usual in the genre: half length (3,5,10,20 and 45 minutes), weather conditions (sunny, rainy, overcast, indoors), referee strictness (full, no cards, no fouls), time stoppages, tie decision (shootout or overtime) and sound (music and sfx, only one of them or none).</p>"},{"name":"Toughman Contest","year":1995,"developer":"High Score Productions","url":"d#Toughman%20Contest%20%28USA%2C%20Europe%29.zip","filesize":2844671,"score":6.5,"genres":"Sports > Behind view > Boxing > Licensed","desc":"<p><em>Toughman Contest</em> is a game based on the world famous boxing competition of the same name. You pick one of 24 fighters, compete in one of 5 locations from around the world, and re-create the Toughman tournament as seen on TV. </p><p>The boxing action is viewed from behind the back of the fighter you control. Your fighter is rendered as an outline, so you can see what your opponent is up to and react accordingly. Toughman matches consist of three one minute rounds. Your goal is to KO your opponent by causing their stamina meter to decrease to the point where they fall down, or beating on them enough that you are scored the winner at end of the third round.</p>"},{"name":"Toxic Crusaders","year":1992,"developer":"Infogrames Europe SA","url":"d#Toxic%20Crusaders%20%28USA%29.zip","filesize":356538,"score":6,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Sci-fi / futuristic > Licensed","desc":"<p>The alien race of Smogulans, led by Czar Zoster, is invading the Earth, namely the town of Tromaville. The only force that can stop the invasion are the Toxic Crusaders.</p><p><em>Toxic Crusaders</em> for Genesis, based on the animated TV series, is a side-scrolling beat-'em-up. The player can choose to play as either Toxie, NoZone or Junkyard, with no actual difference for the gameplay, which consists of running around beating aliens with melee or distance attacks and sometimes jumping over or evading deadly gaps or pools of water.</p><p>As the action moves from the streets of Tromaville through the Toxic Park, Smogulan space ship and other locations, leading up to the palace of Czar Zoster on Smogula planet, the traps get progressively harder to avoid. In certain levels the protagonist can use a motorized skateboard, helicopter or a motor boat. There are a number of power-ups to be found, including limited invincibility and speed-up.</p>"},{"name":"Toys","year":1993,"developer":"Absolute Entertainment, Inc.","url":"d#Toys%20-%20Let%20the%20Toy%20Wars%20begin%21%20%28USA%29.zip","filesize":420224,"score":5.7,"genres":"Action > Top-down > Licensed","desc":"<p>Welcome to Zevo Toys, where whimsy and childlike innocence are the order of the day. Workers sing and dance as they make wondrous toys in their mission to bring joy to children everywhere. Unfortunately, Kenneth Zevo, the head of the company, is dying. While he’d like to leave the company in the hands of his son Leslie, he feels that Leslie has yet to learn to take life seriously and isn’t ready to run the company.</p><p>In a desperate gamble, he leaves his brother, the strait-laced and humorless Lt. General Leland Zevo, in charge of the company. He knows that his brother is ill suited to run the company, but also knows that his military methods and lack of any sense of humor and whimsy will spur Leslie to grow up if he wants to keep Zevo Toys the way it always was.</p><p>Alas, Kenneth’s plan is working TOO well: Leland is producing deadly weapons designed as toys. Tanks, helicopters, dolls, and balloons, among other things, have been designed with sinister and deadly intent. It’s a disgrace to everything that Zevo Toys stands for, and if Leslie wants to save the factory and the good name of his family, he’ll have to face his uncle head on and fight toy with toy.</p><p><em>Toys</em> is an isometric action game based on the 1992 surreal comedy/fantasy movie of the same name starring Robin Williams, Joan Cusack and LL Cool J. As Leslie, you’ll explore three areas of Zevo Toys (the West Bay factory area, the cafeteria, and the warehouse) in order to take down General Zevo’s elephant-head security cameras. To do so, you’ll have to take out the active defenders of each camera such as jeeps, Hurly-Burly Helicopters, Tommy Tanks, deadly pogo stick bears, bomb-toting balloons, and much more. When the defenders in one area are cleared, you’ll have to disable the camera. This is accomplished by blinding the camera’s eyes with water from your trusty water gun, then spraying the lens until the camera is destroyed. Careful, the movement of the camera will make things difficult, along with the laser mounted in the camera if you take too long...</p><p>The non-camera areas aren’t safe either, with wind-up walking bombs, amorphous slime globs, spiders and toy paratroopers backing up the defenders. Fortunately, your cousin Patrick will supply you with your own toys to combat the General’s army. These range from your trusty peanut gun to bowling balls and tops to custard pies and water balloons and so much more.</p><p>Once you’ve destroyed all the cameras, you’ll traverse a model of Manhattan via a giant toy plane. Avoid the the Hurly-Burly Helicopters and keep the plane charged using the giant charging coils, and you’ll reach the General’s office and shut down his plans.</p><p>It’s time to fight fire with marshmallows and let joy and innocence prevail!</p>"},{"name":"Trampoline Terror!","year":1990,"developer":"Masaya","url":"d#Trampoline%20Terror%21%20%28USA%29.zip","filesize":161818,"score":5.6,"genres":"Action > Puzzle > Top-down > 2D scrolling > Direct control","desc":"<p>As the titular gymnast \"Trampoline Terror\", it's up to the player to put a halt to the alien menace who has kidnapped the queen of the planet Ahas. To accomplish this task the player must diffuse bombs by walking over self-destruct switches while avoiding getting hit by enemies. The player can jump on tiles and trampolines in order to distance himself from any incoming enemies, although trampolines can only be jumped on a few times before they rip and become a hole that the player can fall down and die in. The player can also pick up a limited number of P-Balls in each stage and use them to eliminate enemies.</p>"},{"name":"Traysia","year":1992,"developer":"Telenet Japan Co., Ltd.","url":"d#Traysia%20%28USA%29.zip","filesize":593290,"score":5.2,"genres":"Role-playing (RPG) > Top-down > 2D scrolling > Real-time > Fantasy","desc":"<p>In <em>Traysia</em> the player controls a young man named Roy, who lives in the town Johanna. All his life Roy has been dreaming about leaving the town and going to explore faraway lands. Now, finally, his chance has come. His uncle, a travelling merchant, is going on a journey, and Roy decides to leave with him. His girlfriend Traysia gives him a pendant, to remind him of her... will Roy be able to escape from all the dangers that await him on his long journey and to see Traysia again?</p><p>The game is a party-based RPG with randomly encountered enemies. The combat is somewhat similar to early  Ultima games. When an enemy appears, the player is presented with a battle screen on which the party is positioned in the lower part, the enemies in the upper part. Characters can attack if they are close enough to the enemy, otherwise they have to move towards them. Magic spells should be cast in an appropriate direction to hurt the enemy.</p>"},{"name":"Triple Play 96","year":1995,"developer":"Extended Play Productions","url":"d#Triple%20Play%2096%20%28USA%29.zip","filesize":1972593,"score":7.5,"genres":"Simulation > Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p><em>Triple Play 96</em> is one of the earliest entries in EA's Triple Play series that featured a full MLB and MLBPA license with many of the top players of the 1995 season along with authentic stadiums from all 28 MLB teams along with 2,500 frames of animation to give the game a more realistic feel. Many of the standard options are present such as exhibition, season, playoffs, etc. along with a battery back-up that can keep extensive track on 25 different stat categories and has 12 unique pitches that can be chosen during the game. Players can also create their own baseball player and use them in the game or go against four friends.</p>"},{"name":"Triple Play: Gold Edition","year":1996,"developer":"Extended Play Productions","url":"d#Triple%20Play%20-%20Gold%20Edition%20%28USA%29.zip","filesize":1969252,"score":"","genres":"Sports > Isometric > Baseball > Licensed","desc":"<p><em>Triple Play: Gold Edition</em> is an update of the previous year's title. It looks and plays very much like the previous title, including the close-up batting view and extensive stat tracking. The game features an MLBPA license, with a full 1996 season roster and stats based on the 1995 season. Additionally, this update adds a new \"pro\" difficulty level for experienced players, and just like the previous title also allows for up to four players to play.</p>"},{"name":"Triple Score: 3 Games In One","year":1992,"developer":""},{"name":"Tro-Now","year":2015,"developer":""},{"name":"Trouble Shooter","year":1991,"developer":"Vic Tokai Corporation","url":"d#Trouble%20Shooter%20%28USA%29.zip","filesize":304598,"score":7.4,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>King Frederick's son and heir to the throne, Prince Eldon, has been kidnapped by Blackball, an evil military weapons genius.  Just as international disaster seems imminent, Colonel Patch calls in the \"Trouble Shooter\" to take care of Blackball and his evil robot minions.  Play as Madison and her faithful sidekick Crystal in this action side-scrolling adventure which takes you through 5 levels of Blackball's domain to the very mastermind himself.  Will Madison be able to defeat Blackball and rescue Prince Eldon in time?</p>"},{"name":"Troy Aikman NFL Football","year":1994,"developer":"Tradewest, Inc.","url":"d#Troy%20Aikman%20NFL%20Football%20%28USA%29.zip","filesize":898168,"score":6.3,"genres":"Sports > Managerial / business simulation > Football (American) > Licensed","desc":"<p>You and a friend can become star NFL players or choose to coach a team in this realistic rendition of the game of American football, endorsed by former Dallas Cowboys quarterback and Super Bowl champ, Troy Aikman. Choose to play alone against the system, or play against each other.</p><p>Pick from 3 play modes: Pre-season, Season, or Custom Generated (editable) season. There are also three skill levels: Rookie, Pro and Veteran.  You can design your own plays, customize your team, and save your team's stats. True-to-life playing surfaces have an effect on how your team performs and include grass, mud, dirt, snow, rain and turf. Listen to the roar of the crowd and other authentic stadium sounds as your plays are followed through.</p>"},{"name":"True Golf Classics: Waialae Country Club","year":1994,"developer":"T&E Soft, Inc."},{"name":"True Golf Classics: Wicked 18","year":1994,"developer":"T&E Soft, Inc."},{"name":"True Lies","year":1994,"developer":"Beam Software Pty., Ltd.","url":"d#True%20Lies%20%28World%29.zip","filesize":1246805,"score":7.2,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Licensed","desc":"<p>Take charge of gun toting Arnie in this top down omni-scrolling action shooter. Arnie takes on the terrorists using a variety of weapons in all the locations from the movie of the same name.In each location you have a mission such as retrieve data or capture a terrorist.This usually involves searching around for your goal while dispatching enemies and trying to minimise civilian casualties. The emphasis is on action and weapons, in particular Arnold's favourites: flame thrower and the uzi. He also has a diving roll to help him dodge the enemies bullets and come back guns blazing..</p>"},{"name":"Truxton","year":1989,"developer":"Toaplan Co., Ltd.","url":"d#Tatsujin%20~%20Truxton%20%28World%29.zip","filesize":230395,"score":7.5,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Space flight","desc":"<p>The evil Dogurava, commander of an alien army known as the Gidans, is attacking the planet Borogo. The army uses five giant asteroids as fortresses for the invasion. After surviving an attack on an orbiting cargo barge, a lone pilot takes the only remaining fighter craft and embarks on a suicide mission: draw the Gidans' fire to himself, while attempting to bypass their fighters on the way to the fortresses.</p><p>Originating in the arcades, <em>Truxton</em> is a vertically scrolling shooter. The player controls a fighter craft that has to eliminate the enemies with primary weapons or bombs. The basic weapon comes in three varieties: Power Shot (small spreading projectiles), Sun Laser (a powerful, fast-moving straight laser beam, and Truxton Beam (an electric beam that spreads in all directions if the player is holding down the fire button). </p><p>Each one of these weapons can be upgraded to a more powerful variant by collecting power-ups (up to four power levels). Beside increased attack power, the weapons also may gain additional properties when powering up (e.g. the Power Shot creates a shield around the player-controlled aircraft). Other power-up effects include increasing the ship's maneuvering speed up to four times, increasing the number of bombs, and gaining additional lives.</p>"},{"name":"Turbo Out Run","year":1992,"developer":"SEGA-AM2 Co., LTD.","url":"d#Turbo%20OutRun%20%28W%29.zip","filesize":294271,"score":7.5,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Street racing","desc":"<p>The sequel to OutRun features similar basic gameplay to the original, with the action viewed from behind the car, and the challenge being to complete each stage within the time limit. Contact can cause the car to spin, slow down or even flip; in each case you will lose time. There are branching routes and a raft of new features: changed weather conditions, night racing, obstacles on the tracks, optional automatic gears, annoying police cars.</p><p>There are 16 stages set across the US, gradually moving from east to west, all depicted differently visually. After every 4 levels, you go into a shop screen, with a choice of upgrades. As the title implies, you now have a turbo booster installed, which speeds up the car, although over-use can cause the engine to overheat, and it is not recharged until each shop section. You have 5 continues, and failure to complete the course within the time limit costs you one.</p>"},{"name":"Turma da Mônica na Terra dos Monstros","year":1994,"developer":"Westone Co., Ltd."},{"name":"Turrican","year":1991,"developer":"Rainbow Arts Software GmbH","url":"d#Turrican%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":299759,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic","desc":"<p>Three-headed demon Morgul has been influencing people's dreams to create nightmares, but more recently these nightmares have become real. Only <em>Turrican</em> can save them in this fast paced side scrolling shoot-em up. It features 5 worlds and 13 levels of challenging gameplay.</p><p>Gameplay is conceptually simple: just jump, shoot and explore. However, this game puts a lot of emphasis on finding and using the 10 different weapons Turrican can collect.</p>"},{"name":"Twin Cobra","year":1991,"developer":"Toaplan Co., Ltd.","url":"d#Twin%20Cobra%20-%20Desert%20Attack%20Helicopter%20%28USA%29.zip","filesize":353042,"score":7.4,"genres":"Action > Top-down > 2D scrolling > Shooter > Helicopter","desc":"<p><em>Twin Cobra</em> is a vertically scrolling shoot-em-up. You pilot the TC-17 Twin Cobra assault helicopter to fight the forces of Commander Anziga, the myopic leader of the nation of Kaban. Your job is to fly into Kaban and take out the entire military base of Commander Anziga.</p><p>You will fight small helicopters, tanks and stationary guns, defeat the large helicopters to get power-ups. By picking up colored icons (blue, yellow, red or green) you can change to different weapon types. Blue is a forward spread shot, yellow is a four-way shot, red is a wide forward laser shot and green is a continuous forward laser shot.</p><p>At the end of each section, you land on a carrier ship and count up your bonuses.</p>"},{"name":"Twin Hawk","year":1990,"developer":"Toaplan Co., Ltd.","url":"d#Twin%20Hawk%20%28U%29%20%5B%21%5D.zip","filesize":196051,"score":6.4,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter","desc":"<p><em>Twin Hawk</em> is a typical vertical scrolling shooter with a top-down view. Your goal is easy, shoot all the enemies along the way. You only get a standard gun on your plane, and no bombs. Instead of bombs you can call helper planes. These planes make a formation around you and help to shoot all enemies.</p><p>Along the way you get the chance to collect power-ups by shooting transport trucks. When these are destroyed they release a power-up. There are three types. First is the weapon upgrade, with this you get a wider and more powerful shot. Second, you get more calls for helper planes. And third are extra lives.</p>"},{"name":"Twinkle Tale","year":1992,"developer":"Wonder Amusement Studio","url":"d#Twinkle%20Tale%20%28JU%29.zip","filesize":547654,"score":7.7,"genres":"Action > Top-down > Anime / Manga > Arcade > Shooter > Fantasy","desc":"<p>An overhead scrolling fantasy shoot 'em up, <em>Twinkle Tale</em> casts the player in the role of the young witch Saria, in a quest to rid her magical floating island of the evil creatures that have invaded it.</p><p>The game is played from an overhead perspective, with Saria having complete freedom of movement in all directions and with the objective being to clear out all enemies in all 9 stages, looting whatever treasure you can find and defeating each stage's boss.</p><p>Saria's offensive weapons come pre-defined as three different spells, which you can freely switch to at any time and level-up by collecting power stars, as well as screen-clearing bombs.</p>"},{"name":"Two Crude Dudes","year":1992,"developer":"Data East Corporation","url":"d#Two%20Crude%20Dudes%20%28USA%29.zip","filesize":545193,"score":6.7,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Cyberpunk / dark sci-fi > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>After a nuclear explosion, New York needs rebuilding. This has barely started when the 'Big Valley' gang enters and takes full control themselves. The Government sends a pair of heavies known as the Crude Dudes in to clear them out.</p><p>As one of these Crude Dudes, you must travel through tough streets and take out Big Valley's people, destroying their vehicles and avoiding the force of their weaponry. Foes include werewolves, skeletons and hunchbacks. Gameplay is essentially Bad Dudes-style beat 'em up driven, with bosses on each level.</p>"},{"name":"Two Tribes: Populous II","year":1992,"developer":"Bullfrog Productions, Ltd.","url":"d#Two%20Tribes%20-%20Populous%20II%20%28U%29.zip","filesize":473137,"score":8.2,"genres":"Strategy > Diagonal-down > Isometric > Real-time > Real-time strategy > Point and select > Classical antiquity > Fantasy","desc":"<p><em>Populous II</em> continues the \"god game\" genre pioneered by Bullfrog's classic <em>Populous</em>. In PII, you're an unproven immortal who must fight your way through an entire pantheon of Greek gods, each with his or her own strategy and attacks, and ultimately enter into a showdown with Zeus himself.</p><p>The gameplay mechanics are similar to <em>Populous</em>, but PII features a wider array of spells, digitized sound, and high-resolution graphics to give the spell effects extra punch. Multiplayer is supported via serial link and dial-up.</p>"},{"name":"Tyrants: Fight through Time","year":1992,"developer":"Sensible Software","url":"d#Tyrants%20-%20Fight%20through%20Time%20%28USA%29.zip","filesize":553004,"score":7.9,"genres":"Strategy > Top-down > Real-time","desc":"<p>First you choose one out of four different characters to represent you, Scarlet (red army), Oberon (yellow army), Caesar (green army), or Madcap (blue army). The game is split into 10 levels - the first 9 are groups of 3 territories which can be completed in any order, while the final 'Mother of All Battles' has its own surprises. </p><p>Land is mostly of sand, grass or ice. You start with 100 men and you can use whatever quantity you find necessary on each island. The rest men left will go to another level with another new 100. In the second half of the game you can freeze men to save them for the Mother of All Battles.</p><p>Once you select your island and place for your HQ, you must do some research for better weapons and defences. On the roof of your buildings you can put protectors like archers, gunmen, boiling oil men, and later on even laser turrets. If you send a team of unarmed men into an unoccupied square, they will build an additional base there, with larger armies completing this more quickly.</p><p>Later on higher levels, you'll also build mines and factories, as you'll need to dig a certain material for higher level weapons, depending on whether the area you're on is rich with a certain material or not. With each next level, you'll start from a higher technology level and be able to progress to one higher level up than at the previous level.</p><p>If there is more than just one enemy, you can make an alliance until you crush the other one - three of you can form an alliance against fourth enemy. For what its worth, a certain numeric level of defence is always stronger from the same level of attacker, and men that are not armed (conscripts) can only kill enemy soldiers, not destroy or attack enemy fort.</p><p>The main thing as always in strategy games is to be the sole survivor and lead your men to victory, experimenting on vicious technologies, equipping your men, making perfect soldiers out of them, produce shields, weapons, planes... to dominate the world and crush your opponents. </p><p>You can do the battling only in a certain quadrant, but don't be long as your men will automatically start building the fort, and it will be at the bottom of age level and you'll need to invent everything for that one again.</p>"}]