[{"name":"Valis","year":1991,"developer":"Riot","url":"d#Valis%20%28USA%29.zip","filesize":750932,"score":6.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Fantasy","desc":"<p>Yuko Ahso is an ordinary Japanese teenager with an ordinary life - until one day she is attacked by a monster on the street. Out of nowhere, a sword appears in her hands. She fights the monsters who have suddenly invaded the city, and is summoned to the parallel world known as Vecanti, which is ruled by a cruel tyrant named Rogles, whose actions disrupt the balance of the the worlds. Wielding the legendary Valis sword, Yuko must defeat Rogles and restore the balance.</p><p><em>Valis</em> has the same story and basic genre (platform action) as the  original first game in the  series; however, it is a different game with different locations, regular enemies and bosses, new cutscenes, etc. Defeating the numerous enemies populating the game world requires precise usage of jumping and ducking abilities, and attack timing. Yuko can jump very high and attack while jumping. Various power-ups are scattered through the game, many of which enhance the performance of Yuko's sword. Acting as a melee weapon in the beginning, it can be customized with power-ups and turn into a medium-range weapon, firing shots at the enemies - with proper power-ups, also in different directions. Boss enemies typically have different attack patterns and require different strategies to defeat them.</p>"},{"name":"Valis III","year":1991,"developer":"Shin-Nihon Laser Soft Co., Ltd.","url":"d#Valis%20III%20%28USA%29.zip","filesize":780933,"score":7.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform","desc":"<p>After Yuko has defeated the evil Rogles, peace descended upon Earth and the magical world of Vecanti. But a new threat has arisen: an enigmatic man named Glames from the Dark World, possessor of a sword named Leethus, is planning to conquer both Earth and Vecanti, convinced that there is no other way to save his world from imminent destruction. A young girl from the Dark World named Cham escapes from Glames, and asks Yuko to help her stop him with the aid of her Valis sword.</p><p>Like its predecessors in the series, <em>Valis III</em> is a side-scrolling platform action game. Unlike the previous installments, the player can control three characters in the game: Yuko, Cham (who uses a whip and fights similarly to Castlevania protagonists), and princess Valna from Vecanti, who is weaker physically, but can cast more powerful magic. Each of the characters can equip different weapons and has access to her own magic spells.</p>"},{"name":"Vapor Trail","year":1991,"developer":"Data East Corporation","url":"d#Vapor%20Trail%20%28USA%29.zip","filesize":443318,"score":6.5,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter","desc":"<p>It's 1999, the terrorist organization \"DAGGER\" has taken down the communication system that provides communication for the world's military bases. The terrorists are now in control of the satellite communication network, and they threaten to destroy the world's greatest cities with nuclear bombs. The group is only prepared to cancel their threats when the world's leaders are ready to give their power to DAGGER.</p><p>As a counter-offense, a special forces air unit is called in by the president of the USA. The air unit's code name: \"Vapor Trail\". The world's last hope lies in your hands now...</p><p>The game is a vertically scrolling shoot 'em up. You can choose between 3 planes; the fast but weak plane: Seylen. The mediocre all around: Silph; and the slow but very strong: Valkyrie.During the game you can pick up various items. These items include: Speed-up, power-up and extra lives. An extra useful feature is the spin-dash which makes you invulnerable for a few seconds. For this feature you have to wait until your power is restored to full by waiting some time. You also get more than one boss per level.</p>"},{"name":"VectorMan","year":1995,"developer":"BlueSky Software, Inc.","url":"d#Vectorman%20%28USA%2C%20Europe%29.zip","filesize":1049847,"score":7.9,"genres":"Action > Side view > Shooter > Sci-fi / futuristic","desc":"<p>The future of the human race looks hopeless when maintenance drones accidentally replace the orbot leader's head with a salvaged atomic bomb. All the orbots on Earth are immediately ordered, via television receivers, to stop cleaning up the planet and to start manufacturing weapons for an impending ambush of the returning humans. Only one orbot, a sludge barge pilot who was out of communications range, is unaffected by the evil take-over. You are that pilot: VectorMan! The only hope of the entire human race is for you to destroy the villainous WarHead: you must seek him out by following a trail of television receivers around the Earth, and then confront him in a battle that will decide the fate of humanity, and of the planet Earth itself!</p><p><em>VectorMan</em> is a side-scrolling shooter with multidirectional aiming. Before the time runs out, the player must traverse a level from left to right and find the exit, possibly guarded by a boss, but not necessarily. While the levels are generally linear, they may have several platforms awaiting exploration, including hard-to-reach areas hiding power-ups. Three specific levels are unconventional because the perspective changes to a top-down view, and the player must defeat the boss while transformed into a train, a cricket or a dancing fool. By killing enemies or destroying television receivers, VectorMan can find power-ups, including:</p><ul><li>Multipliers - all health power-ups, scores, and 1-Ups are multiplied by two, three, five or ten, depending on the multiplier.</li><li>Health - depending on the power-up, it restores one health point, all of it, or increases the maximum number of health points the player has.</li><li>1-Up - an extra life.</li><li>Milestone - next time the player dies, the level will restart from here.</li><li>Extra time - adds two minutes to the timer.</li><li>Nucleus shield - generates a shield that protects the player from harm.</li></ul><p>Additionally, destroyed TVs may reveal morph icons or powerful weapons that replace VectorMan's standard ball gun for a limited time, such as the rapid fire or the bolo gun (shoots a big energy ball that goes through multiple orbots). The morph icons transform the player character into a new shape, for example a drill (breaks through floors), a jet (flies), a fish (swims faster), and so on.</p><p>The game has three levels of difficulty, and it keeps track of the score the player has accumulated by gathering photons and destroying orbots. Depending on the difficulty, every time a set number of points is reached an extra life is awarded.</p>"},{"name":"Vectorman 2","year":1996,"developer":"BlueSky Software, Inc.","url":"d#Vectorman%202%20%28USA%29.zip","filesize":1374218,"score":7.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Sci-fi / futuristic","desc":"<p>This is a sequel to  Vectorman. This time, the super-powerful little robot was attacked while coming back to earth in his spaceship. He falls down on the earth only to discover dark locations full of hostile creatures and to participate in a platformer full of fast and furious action. Fight your enemies, collect photons, jump over obstacles, find weapons, morph into other creatures, and climb walls as the green \"orbot\" Vectorman.</p>"},{"name":"Venom - Spider-Man: Separation Anxiety","year":1995,"developer":"Software Creations Ltd.","url":"d#Venom%20.%20Spider-Man%20-%20Separation%20Anxiety%20%28USA%2C%20Europe%29.zip","filesize":1114037,"score":5.6,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p><em>Separation Anxiety</em> is a 2D side-scrolling platform-action beat 'em up game featuring several prominent characters from the Marvel Universe and gripping storylines taken from the popular Spider-Man comics. The game is based loosely on a mini-series of comics about the Venom saga. In this game, 1-2 players can select and take control of Spider-Man and/or his on-and-off again arch-nemesis Venom. As Spider-Man and/or Venom, you must set off and stop the life foundation that has spawned out 5 symbiote offsprings from Venom and plans to bond them together with its soldiers in order to assemble and form a vast deadly army. As Venom recovers from his wounds, he thus realizes and decides that he must set out and fight them off either alone or with the aid of his old arch-nemesis Spider-Man.</p><p>The game allows you to punch, kick and swing your way as well as execute combos throughout the streets, the woods and even through the underground complexes towards accomplishing your main goal. Along the way, the player(s) can also find and pick up some helpful superhero ally icons that allow you to summon a few of Spidey's greatest allies to your aid including Captain America, Hawk-Eye, Ghost Rider and Dare Devil.</p>"},{"name":"Verytex","year":1991,"developer":"Opera House Inc.","url":"h#ROMs%2FVerytex%20%28Japan%29.zip","filesize":1,"score":6.7,"genres":"Action > Top-down > 2D scrolling > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>Humanity has long since advanced into space, and colonies have been established on many planets, but humanity has yet to contact any alien life. However, an emergency signal has come from the planet Shirakusa. During a colonization survey, contact was lost with the battleship Aphrodite. As a member of the elite Verytex squad, you are sent to investigate.</p><p>Verytex is a vertically scrolling space shooter with vague organic themes. There are six stages and three different weapon types: Normal Shot, a standard multidirectional cannon; Beam Laser, a powerful forward-shooting weapon; and Boomerang Laser, a wide-range forward shot. Each weapon type can be upgraded to three increasing levels of power. Also available are homing missiles, which are also upgradeable, as well as smart bombs and shield pickups.</p>"},{"name":"Viewpoint","year":1994,"developer":"Sammy Corporation","url":"d#Viewpoint%20%28USA%29.zip","filesize":611887,"score":7.4,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Arcade > Shooter","desc":"<p><em>Viewpoint</em> is a top-down orthographic perspective game in the tradition of Zaxxon. The PlayStation and Saturn versions feature 3D rendered graphics with texture maps, unlike the other versions which primarily feature shaded polygons.</p><p>One or two players (in hot-seat or cooperative mode) control a spaceship equipped with a laser cannon which can be charged (by holding the shooting button down) for a stronger blast. Besides the main weapon, three special weapons are available: a wall of fire which wipes the screen up in a wave, a nova-like blast and a circle of spherical-green homing missiles.</p>"},{"name":"Virtua Fighter 2","year":1996,"developer":"Gaibrain","url":"d#Virtua%20Fighter%202%20%28USA%2C%20Europe%29.zip","filesize":2002245,"score":6,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts","desc":"<p>One year after the first edition of the World Fighting Tournament, won by Lau Chan, invitations are sent once again, this time to the second edition of the Tournament. Will Akira's new techniques be enough to beat Wolf? Can Lau defend his title against his daughter Pai? Will Jacky rescue his sister Sarah, who has been brainwashed to kill him? Will Jeffry make enough money to track down the Satan Shark? And Kage, will he uncover if the mysterious Judgement 6 cartel is behind the tournament? All is yet to be seen...</p><p>Sharing the name with the second title in Sega's seminal 3D fighter series, this 16-bit version brings the game to the world of 2D fighters.</p><p>While the fully polygonal environment of the arcade/saturn version were scratched in favor of regular sprites and side-scrolling camera due to obvious technological constraints (plus manufacturing costs ruling out the SVP chip used in <em>Virtua Racing</em>) and featuring only the 8 original characters in the series, the rest was directly taken or inspired by it's bigger brother. The arenas are all drawn according to the to the 32-bit titles (and even feature a small parallax scrolling trick to provide a slight 3D illusion), so are the characters, and the also features a lot of the same sound effects and music. Gameplay is also inspired by the original version, with many button combinations remaining unchanged.</p>"},{"name":"Virtua Racing","year":1994,"developer":"SEGA-AM2 Co., LTD.","url":"d#Virtua%20Racing%20%28USA%29.zip","filesize":703848,"score":8.4,"genres":"Racing / Driving > 1st-person > Behind view > Real-time > Arcade","desc":"<p><em>Virtua Racing</em> is Sega's first ever 3D, polygon-based racing game. The game consists of racing Formula-1-looking cars around a beginner, intermediate, or expert track, competing against a second player or computer drivers. Despite having Formula-1 cars, the game controls are very \"arcadey\" and players can see the leap they made from here to Daytona.</p><p>The Megadrive/Genesis version of <em>Virtua Racing</em> is of note as it is the only game for the system which features the SVP chip (Sega Virtua Processor). The chip is a 3D processor built into each cartridge (the console itself had limited 3D capability) and is very similar to the SNES's SuperFX chips, used in games such as <em>Starfox</em> and Stunt Race FX.</p>"},{"name":"Virtual Bart","year":1994,"developer":"Sculptured Software, Inc.","url":"d#Virtual%20Bart%20%28World%29.zip","filesize":1392815,"score":6.3,"genres":"Action > Behind view > Side view > Platform > Fantasy > Licensed","desc":"<p>Bart's reality goes virtual when he is strapped into Martin Prince's Virtual Reality experiment at the elementary school science fair. Each virtual reality program represents a stage in the game that Bart must play through in order to escape the machine before the programs crash.</p><p>The game consists of three side-scrolling platform stages and three stages that take place from a rear view. Bart assumes the roles of a pig, dinosaur, and baby for the platform stages. He tosses tomatoes and eggs, slides down a water slide, and drives a motorcycle in a post-apocalyptic Springfield for the three remaining stages. They are all accessed by chance via a wheel-of-misfortune.</p>"},{"name":"Virtual Pinball","year":1993,"developer":"BudgeCo., Inc.","url":"d#Virtual%20Pinball%20%28USA%2C%20Europe%29.zip","filesize":293090,"score":6.7,"genres":"Simulation > Top-down > Pinball","desc":"<p><em>Virtual Pinball</em> is the spiritual successor to Bill Budge's classic Pinball Construction Set. Programmed by Bill Budge, this Sega Genesis game allows the player to try different pre-built pinball tables and additionally create, save and play custom tables.</p>"},{"name":"Vixen 357","year":1992,"developer":"NCS Corporation"}]