[{"name":"Wacky Races: Crash & Dash","year":2008,"developer":"Eidos Studios, Sweden AB","url":"d#Wacky%20Races%20%28USA%29%20%28Proto%29.zip","filesize":974336,"score":"","genres":"Action > Racing / Driving","desc":"<p>Outsmart Dick Dastardly's crazy traps! Use Wacky Powers to damage your rivals!</p>"},{"name":"Wacky Worlds Creativity Studio","year":1994,"developer":"HeadGames, Inc.","url":"d#Wacky%20Worlds%20Creativity%20Studio%20%28USA%29.zip","filesize":410965,"score":"","genres":"Educational > Simulation > Side view > Graphics / art > Music","desc":"<p>In the educational title <em>Wacky Worlds Creativity Studio</em>, players use any combination of 40 stickers to place animating objects into any of 6 wacky world environments. Stickers include Sonic the Hedgehog, Tails, Ecco the Dolphin, and many other SEGA characters. Then the players paint objects in any color they like. Once the Wacky World has been populated, music can be composed using up to 40 music stickers in the robot musician music factory. The game comes bundled with the Mega Mouse and mouse pad.</p>"},{"name":"Wani Wani World","year":1992,"developer":"Kaneko Co., Ltd."},{"name":"Wardner","year":1991,"developer":"Toaplan Co., Ltd.","url":"d#Wardner%20%28USA%29.zip","filesize":228490,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>One day the town of Niknik is invaded by Wardner's henchmen. Wardner's henchmen have the power to turn all humans into crystals. A honeymooning couple, Dover and Mia, get lost in the towns nearby forest. One of Wardner's wards, Terragon, spots them and decides to kidnap Mia. Now it's up to Dover to rescue Mia from Wardner and his minions.</p><p>The game contains 6 stages: The forest entrance, house of tricks, forest of the dead, Wardner's Castle, a tower, and the hidden underground room. Each stage is controlled by a ward of Wardner. Some of these bosses are the Emerald Dragon, Kaja, and Grocko.</p><p>Dover uses a magic fireball as his main weapon. Defeating enemies turns them into money. This money can be used at the end of each stage where there are shops that sell items that will help Dover on his journey. Some of the items in the game are the magical cape, thread and needle,  magical clock, magical flute, and the highjump shoes.</p>"},{"name":"Warlock","year":1994,"developer":"Realtime Associates, Inc.","url":"d#Warlock%20%28USA%2C%20Europe%29.zip","filesize":985298,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Horror > Licensed","desc":"<p><em>Warlock</em> is based on the 1989 movie of the same name.When the sun aligns with the moon once every millennium, druid guardians summon their magic of their runestones to prevent the rebirth of the Warlock. The runestones are scattered through time and across the continents and you must find them before the Warlock does.</p><p>The gameplay is simple. You go through different stages fighting off creatures and then finding the runestones. You fight off enemies by simply blasting them with this energy, using this orb you have with you, or you can use a spell to kill them. There are some puzzles in the game too. Some of the battles with the tougher enemies require some strategy to defeat them.</p>"},{"name":"WarpSpeed","year":1993,"developer":"Accolade, Inc.","url":"d#WarpSpeed%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":768984,"score":5.3,"genres":"Action > 1st-person > Shooter > Direct control > Space flight > Sci-fi / futuristic","desc":"<p>The player takes control of a starpilot with a mission to defend star bases from a fleet of invading alien warships. The game takes place from a cockpit perspective from one of four starfighters; the Stinger, Striker, Stalker,or Slasher. The game has 7 battle scenarios and a 4 scenario campaign mode. </p><p>The starfighter ships come equipped with a computer, engine, shield, weapons, and missiles which can be damaged from enemy combatants or space debris like asteroids. The ship also comes with a Long Range Scanner, which shows the locations of enemies on the map. The map itself is made up of 64 square sections. Finally, the ship also has a Hyperwave Reciever, that lets the player communicate with both the aliens and the player's base.</p>"},{"name":"Warrior of Rome","year":1991,"developer":"Micronet Co. Ltd.","url":"d#Warrior%20of%20Rome%20%28USA%29.zip","filesize":342686,"score":5.9,"genres":"Strategy > Top-down > Real-time > Classical antiquity","desc":"<p><em>Warrior of Rome</em> is a strategy game set during the Ancient Roman era. It is shown from a top-down perspective and all units are represented by icons on the square fields of the playing map. The basic gameplay is simple: on each of the four levels there are goals to fulfill, e.g. destroying pirate ships. To do so, the player chooses a unit and gives it the order to move somewhere. When hostile units meet, they fight automatically; the fights are shown in separate windows.</p><p>Besides movement, there are also other orders to give to each individual unit, e.g. building a palisade, making a trap, the movement speed and, most importantly, the retreat options. Then a unit automatically flees when a fight does not work out and, after a rest, it regenerates to full strength.</p>"},{"name":"Warrior of Rome II","year":1992,"developer":"Micronet Co. Ltd.","url":"d#Warrior%20of%20Rome%20II%20%28USA%29.zip","filesize":365190,"score":"","genres":"Strategy > Diagonal-down > Isometric > Real-time > Real-time strategy > Point and select > Africa > Asia > Classical antiquity > Europe","desc":"<p><em>Warrior of Rome II</em> is a real-time strategy game similar to Populous, in which the player controls the Roman Army. The player controls a number of individual units in each map, which can be directed in various ways, such as to approach and attack a particular target, construct or demolish structures, or form or disband units.</p><p>The single-player scenario begins with Caesar receiving orders from Rome to suppress a revolt in Asia. There is also a free battle mode for one or two players that features several dozen maps to choose from. A unique feature of the game is the highly configurable menu system. The player can move, resize, rearrange, and close any of the different information windows as they see fit.</p>"},{"name":"Warsong","year":1991,"developer":"NCS Corporation","url":"d#Warsong%20%28USA%29.zip","filesize":289684,"score":7.9,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Anime / Manga > Turn-based > Fantasy > Regional differences","desc":"<p>Warsong is the only title of a series of strategy games, known as Langrisser in Japan, to ever see an official release outside of Japan. It is set in a typical medieval fantasy setting and features traditional turn-based combat. The player controls several generals who can command up to eight different units ranging from ordinary soldiers and archers to more exotic creatures like mermen or lizards .The generals fight alongside their units, but are much more powerful and are able to use more diverse commands than just moving and attacking, like recovering a small amount of HP or casting spells. Each unit has certain strengths and weaknesses; for example, soldiers are good against archers but weak against cavalry. Combat is also influenced heavily by terrain types. When two units engage in combat, a small animation, similar to those seen in Advance Wars or Fire Emblem, is shown.</p>"},{"name":"Water Margin: A Tale of Clouds and Wind","year":1999,"developer":"Never Ending Soft Team","url":"d#Water%20Margin%20-%20The%20Tales%20of%20Clouds%20and%20Winds%20%28USA%29%20%28Unl%29.zip","filesize":924984,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Fantasy","desc":"<p>Fight the army of evil at the risk of your life!</p><p>Play as one of the three heroes with specific moves and features, and face formidable warriors who will show no mercy. On your own or with a friend, slice through the woods and fight your way through hordes of enemies. Use different magics to put a large number of opponents at the same time.</p><p>The end of the game will be different depending on the level of difficulty you choose.</p>"},{"name":"Wayne Gretzky and the NHLPA All-Stars","year":1995,"developer":"Semi Logic Entertainments, Inc.","url":"d#Wayne%20Gretzky%20and%20the%20NHLPA%20All-Stars%20%28USA%2C%20Europe%29.zip","filesize":1222617,"score":6.4,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p>One of the many hockey games released, this version not only let the player control Gretzky, but other major players of the time as well such as Mario Lemieux, Eric Lindros, Mark Messier among many others, 600 total. It also features the 26 NHL teams at the time as well as 6 International teams to choose from.</p><p>The gameplay is similar to many other hockey games with the standard modes such as <em>Exhibition</em>, <em>Season</em>, <em>Playoffs</em> or even a \"Just Play\" option that instantly took the player to a random game. There is also a \"Simulation Mode\" that gives the game an authentic feel complete with penalties or an \"Arcade Mode\" that was more action oriented and with less rules. A battery back-up keeps extensive track of stats and has a two-player option as well.</p>"},{"name":"Wayne's World","year":1993,"developer":"Gray Matter Inc.","url":"d#Wayne%27s%20World%20%28USA%29.zip","filesize":673299,"score":4.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>\"Wayne's World, Wayne's World! Party time! Excellent! Woo, woo, woo!\"</p><p>It's Friday, it's 10:30 and like usual, Wayne and Garth are presenting their TV show. First they start off by reading a top-10 list of the worst games they recently played at the arcade. Then Wayne accounts on how he and Garth were suddenly sucked into a video game, and Garth was kidnapped by the mysterious Zantar. \"Weeuuu, weeuuu, weeuuu!\" FLASHBACK, and now you're suddenly in control of Wayne as he must embark upon a quest to save his good pal Garth.</p><p>Not to be confused with the DOS license, this Wayne's World is a platform- style game. You must jump, fight and rock your way through 4 different levels which include Kramer's Music Store, Stan Mikita's Donut Store, Gas Works and Surburbia. Using Wayne's guitar as your sonic weapon, it's most excellent noise will bring death to various enemies. Will you save Garth from the evil purple clutches of Zantar? SCHWING!</p>"},{"name":"WeaponLord","year":1995,"developer":"Visual Concepts Entertainment, Inc.","url":"d#WeaponLord%20%28USA%29.zip","filesize":2040502,"score":7.4,"genres":"Action > Side view > Arcade > Fighting > Fantasy","desc":"<p>A barbarian battleground. Seven different warriors, eached armed with a unique weapon set forth on a fighting game quest where they will clash and conflict with one another in this fighting game from Namco. Their ultimate foe is the mysterious Demonlord. An early relative of the popular Soul Calibur series, the main claim to fame of this game is the weapon play. Blocking and combos are present along with special \"frenzies\" of increased attack and death combos. The backgrounds are all hand drawn and meticulously detailed. Each character carries their own storyline with them between arenas, jungles and firey mountains on a quest to oppose the Demonlord.</p>"},{"name":"Wheel of Fortune","year":1992,"developer":"Imagitec Design Inc.","url":"d#Wheel%20of%20Fortune%20%28USA%29.zip","filesize":278197,"score":5.7,"genres":"Puzzle > Side view > Fixed / flip-screen > Game show / trivia / quiz > Word construction > Licensed","desc":"<p><em>Wheel of Fortune</em> is based on the television game show of the same name. The game features 4,500 different word puzzles for the player to solve with Vanna White turning the tiles on the board.</p><p>The game is played between 3 contestants (either controlled by human or computer players). The game contains six contestant pictures to select from to represent the contestants who will be playing. As in the show, players can spin the wheel, buy a vowel, or solve the puzzle. The game consists of three rounds of word puzzles with the goal being to make the most money by the end of all of these rounds in order to be chosen to play for one of the grand prizes in the bonus round.</p><p>Both platforms feature minor graphical differences from each other. Other differences include the Genesis version of the game also has an options screen where players can select the difficulty level of the computer opponents, how fast the timer is, listen to sounds from a sound test, and select which control pad player 2 and 3 will use. The Super Nintendo version lets the player select a different puzzle category if they don't like the current one.</p><p>This is the 16-bit version of Wheel of Fortune: Featuring Vanna White that now features more puzzles, digitized photography that came from the actual set of the gameshow, and contains digitized speech clips of Vanna White.</p>"},{"name":"Where in the World is Carmen Sandiego?","year":1992,"developer":"Brøderbund Software, Inc.","url":"d#Where%20in%20the%20World%20Is%20Carmen%20Sandiego%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":730326,"score":7,"genres":"Educational > Puzzle > Menu structures > Geography > Detective / mystery","desc":"<p>You start out as a rookie detective whose job is to track down a crop of thieves stealing the world's most precious treasures. After each assignment briefing, you'll be given a deadline to capture the thief that stole the artifact using clues dealing with your knowledge of geography. </p><p>The game is an updated version of the original Where in the World is Carmen Sandiego?, featuring enhanced graphics, sound effects, and additional control schemes, such as joystick support for computer platforms.</p>"},{"name":"Where in Time Is Carmen Sandiego?","year":1992,"developer":"Brøderbund Software, Inc.","url":"d#Where%20in%20Time%20Is%20Carmen%20Sandiego%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":721066,"score":6.5,"genres":"Educational > Puzzle > Menu structures > Geography > History > Detective / mystery","desc":"<p>Carmen Sandiego and her gang are loose once again, and it is the players job to capture her! This time round the player not only has to find where she is, but also when she is. Traveling to various locations, they need to assemble clues by questioning witnesses and searching locations to close in and capture Carmen Sandiego. Included with the game is The New America Desk Encyclopedia to help make clues more meaningful (and act as a form of copy protection!).</p>"},{"name":"Whip Rush","year":1990,"developer":"Vic Tokai Corporation","url":"d#Whip%20Rush%20%28USA%29.zip","filesize":216959,"score":6.6,"genres":"Action > Side view > 2D scrolling > Shooter > Space flight > Sci-fi / futuristic","desc":"<p><em>Whip Rush</em> is a side-scrolling (with certain vertically scrolling descents and ascents) shooter similar to Gaiares and R-Type.</p><p>The player starts with 3, 4, or 6 ships depending on the difficulty level selected. In addition to moving and shooting, the ship has Power Claws that can be rotated and extended for offensive and defensive purposes. Power Claws can be equipped up to two units and can shoot bullets. The Laser is forward firing only but is rapid and strong, missiles can shoot back and forth and when shot from the Power Claw they will home in on enemies. Fireballs shoot in the opposite direction of your ships travel. The upgradeable weapons are Laser, Missile, Fireball, and Power Claw.</p><p>Unlike most other games, the ship has variable speed, which comes in handy when maneuvering different kinds of obstacles and enemies.</p>"},{"name":"WildSnake","year":1994,"developer":"Realtime Associates, Inc.","url":"d#Wild%20Snake%20%28USA%29%20%28Proto%29.zip","filesize":179201,"score":7.3,"genres":"Puzzle > 3rd-person (Other) > Side view > Real-time > Falling block puzzle","desc":"<p><em>WildSnake</em> is a puzzle game in which the player must manage falling snakes in a confined space and keep the snakes from reaching the top of the space. Snakes fall and slither until they reach a resting spot on the floor of the space. A snake will destroy any other snakes of the same color and pattern that it touches with its head on the way down, which often has the chain effect of loosening the pile of snakes so that all the snakes slither into new positions, possibly eliminating even more snakes.</p><p>The game is played against a selection of backgrounds including desert, forest, water, or grass. Further, there are 7 game grids including the standard grid (a tall rectangle), X, plus, flask, Diabolo (an hourglass pattern), T-square, and obstacle (with a number of intermediate blocks).</p><p>The player starts out as a nestling and earns higher and higher distinctions taken from the snake realm (garter snake, water snake, boa, mambo, python, king cobra, etc.) as more snakes are cleared. Also, as the level increases. more types of snake patterns must be handled. Sometimes, there is a flashing red snake that eliminates the first snake it touches. Further, there is occasionally an unstoppable snake that barrels down to the bottom of the space, eliminating all snakes in its path.</p><p>The game can be played with 1 or 2 players in either easy, normal or hard mode. In the single player mode, the player can choose whether the preview showing the next snake will be shown. In 2-player mode, there is always a preview window. In fact, there is a queue of 3 snakes between the 2 player spaces from which the next snake is drawn. As a bonus during competition, multiple snake eliminations by one player result in obstacles appearing in the space of the opposing player.</p>"},{"name":"Will Harvey's Zany Golf","year":1990,"developer":"Sandcastle","url":"d#Zany%20Golf%20%28USA%2C%20Europe%29.zip","filesize":314673,"score":6.5,"genres":"Sports > Diagonal-down > Isometric > Arcade > Golf","desc":"<p>Using the mouse to determine the direction and strength of your putts, you must navigate 9 tricky holes of crazy / mini golf. Try to putt into holes protected by bouncing hamburgers, windmills, etc.  Courses have several twists; one is a mad scientists's lab, another is a pinball table.  The final hole is especially bizarre, themed around energy.</p><p>You start with 3 strokes, but get the par for each hole added on, if you reach it in time -  run out of strokes, and your game is over. You can earn bonus strokes by finding hidden bonuses and by completing courses quickly.  Up to 4 players at a time can take part in this game, with anyone badly over par being eliminated as the game progresses.</p>"},{"name":"Williams Arcade's Greatest Hits","year":1996,"developer":"Digital Eclipse Software, Inc.","url":"d#Williams%20Arcade%27s%20Greatest%20Hits%20%28USA%29.zip","filesize":272461,"score":6.9,"genres":"Action > Compilation > Side view > Top-down > Arcade > Shooter","desc":"<p><em>Williams Arcade Classics</em> is a compilation that includes the following games:</p><ul><li>Defender</li><li>Defender II</li><li>Joust</li><li>Robotron: 2084</li><li>Sinistar</li></ul><p>The PC, PlayStation, and Dreamcast versions also contain Bubbles. The PC and Playstation versions contain FMV supplements, including interviews with the original programmers.</p>"},{"name":"Wimbledon Championship Tennis","year":1993,"developer":"SIMS Co., Ltd.","url":"d#Wimbledon%20Championship%20Tennis%20%28USA%29.zip","filesize":525016,"score":6.9,"genres":"Action > Sports > Diagonal-down > Tennis > Licensed","desc":"<p>The oldest of the four Grand Slam tournaments, held in London on grass every July, is the basis for this tennis game. The ball comes off the grass surface fast and low, reflecting the surface's reputation for providing the most exciting tennis. It's viewed in the typical third person perspective, although with quite a distinct 3D effect and with shadows. You can play standard 1 or 2 player matches, or play the full tournament from the quarter-final stages onwards. You can play standard shots as well as lobs and drop shots, and full service rules are featured. You can select your character and build up their skills as the game progresses.</p>"},{"name":"Wings of Wor","year":1991,"developer":"NCS Corporation","url":"d#Wings%20of%20Wor%20%28USA%29.zip","filesize":288174,"score":7.9,"genres":"Action > Side view > Shooter > Fantasy > Horror","desc":"<p>Gynoug is a horror-themed shoot'em up similar to Thunder Force and other horizontal shooters. But other than most of them where you play a spaceship of some sort, here you play as Wor, a member of the so-called 'Flying men' who look quite similar to angels.The home planet of these people, Iccus, has been taken over by a virus that has mutated into a collection of quite horrible creatures, and every previous attempt to battle them has failed. So now it is Wor's turn to save his home planet and destroy these mutants once and for all!</p><p>Gynoug consists of 6 levels with no check points, instead you continue right where you died if you have any lives left. Each level (except the last) has a mid-boss and a large end-boss. There are three types of shots, one that fires in a triangular fashion, one that fires more concentrated in a corridor and a bit to the back and above/below you, and one that fires to the front and back simultaneously. You can power them up in two ways, by shooting more bullets and by strengthening them. Also, feathers can increase your speed like in Gradius.</p>"},{"name":"Winter Challenge","year":1991,"developer":"MindSpan","url":"d#Winter%20Challenge%20%28USA%2C%20Europe%29%20%28Unl%29.zip","filesize":463254,"score":7.2,"genres":"Action > Sports > Behind view > Olympiad / mixed sports","desc":"<p>An Olympiad game simulating common winter game competitions - the Downhill, Giant Slalom, Luge, 2-men Bobsled, Ski Jump, Cross Country, Biathlon and Speed Skating.</p><p>The game features a basic 3D engine which allows to simulate slopes with ease, which enhances the gameplay of some events such as the Downhill. Gameplay, as expected from a Winter sports game, relies on finding the faster trajectories in most events (Downhill, Giant Slalom, Luge and Bobsled), pacing the run correctly (Cross Country and Biathlon), skill and timing (Ski Jump), with button mashing reserved for just one (speed skating). The player (up to ten) can select his (or her) competitor face and nationality from one of 16 possible choices, and by selecting different difficulty settings, different computer controlled athletes take part in the competition along the player.</p>"},{"name":"Winter Olympic Games: Lillehammer '94","year":1994,"developer":"Unexpected Development","url":"d#Winter%20Olympic%20Games%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CSv%2CNo%29.zip","filesize":790316,"score":5.6,"genres":"Sports > 3rd-person (Other) > Side view > Isometric > Olympiad / mixed sports > Snowboarding / skiing > Licensed","desc":"<p><em>Winter Olympic Games</em> is the officially licensed game for the Winter Olympics tournament of 1994 in Lillehammer, Norway. The European version (<em>Winter Gold</em>) does not feature the license, but is otherwise the same game.</p><p>The player can compete for one of 20 different nations in 7 different events: downhill skiing, biathlon, ski jumping, bobsleigh, slalom skiing, short track ice skating and freestyle moguls. Each discipline can be practiced on its own before the actual competition. Competition can either be the full set, only the first or last half, only the downhill disciplines, or without the downhill disciplines.</p><p>Controls and perspectives differ by event: the downhill ski events are shown in isometric perspective. The athlete's course is controlled relative to the screen. He can crouch to accelerate and also put the skis together to brake. Jumps in freestyle and ski jumping are triggered through the buttons. Biathlon is seen from a side-scrolling perspective. The buttons are used to accelerate, taking into account the athlete's constitution indicated by a heart meter. The shooting is done by moving a crosshair over the targets and pushing a button. Short track is seen from a top-down perspective, with the athlete's movements controlled through alternating pushes of left and right on the d-pad. Bobsleigh is seen from a third-person 3D perspective behind the sleigh.</p>"},{"name":"Winter Olympics: Lillehammer '94","year":1994,"developer":"U.S. Gold Ltd."},{"name":"Wiz 'n' Liz","year":1993,"developer":"Raising Hell Software","url":"d#Wiz%20%27N%27%20Liz%20%28USA%29.zip","filesize":687921,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Wiz and Liz are magicians. They live on the planet Pum and brew potions and cast spells. They also tend to rabbit-like creatures called \"wabbits\". One day, a concoction goes awry and sends all the wabbits to distant parts of Pum. Wiz and Liz set off to look for them.</p><p>The game is an action platformer divided into several stages. In each one of them, either Wiz or Liz must collect wabbits before time runs out. The player must pick up floating letters that appear when a wabbit is collected, and use them to spell out a magic word shown at the top of the screen. Once the word has been spelled, the newly found wabbits leave fruit, stars, and clocks that increase the time limit. The time limit can also be extended by picking up a glowing orange orb which appears during the last ten seconds of the counter, adding thirty seconds to it.</p><p>Unlike most comparable games, <em>Wiz 'n' Liz</em> does not contain regular enemies. The only battles in the game are against some of the end-level bosses. At the end of each stage, the fruit that was dropped by the wabbits can be mixed in a cauldron. The results range from additional points to mini-games, graphical effects, and humorous scenes.</p>"},{"name":"Wolfchild","year":1993,"developer":"Core Design Ltd.","url":"d#Wolfchild%20%28USA%29.zip","filesize":361111,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p>Dr. Kal Morrow, expert in genetic research and creation of human-animal hybrids, has been kidnapped and his family brutally murdered by the terrorist organization CHIMERA. His surviving son Saul takes it upon himself to avenge his family. Using his father's research, he turns into a man-wolf and sets out to find CHIMERA's base and defeat their leader Karl Draxx.</p><p>As Saul, it is your job to traverse five different areas on your way to Draxx. When Saul collects enough power-ups, he turns into his wolf form and gains a special psychic shot attack, which can be improved by collecting further power-ups. However, if Saul loses health, he turns back into his human form and only has his fists to fight the numerous enemies.</p>"},{"name":"Wolverine: Adamantium Rage","year":1994,"developer":"Teeny Weeny Games, Ltd.","url":"d#Wolverine%20-%20Adamantium%20Rage%20%28USA%2C%20Europe%29.zip","filesize":1258605,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>Wolverine: Adamantium Rage</em> sends fan favorite Marvel mutant Wolverine out to explore his past in a beat'em up/platformer, similar to, but different from the version released on the SNES.</p><p>The game begins in the Weapon X lab, and continues through the icy landscape of Dead Man's Land, the Canadian forests and a hallucinatory lunar scenery. In New York, Wolverine must make his way through the Inner Circle of the Hellfire Club, an underground dungeon, and the NYC sewers for a final showdown. Lots of enemies stand in his way: flying robot drones, armed guards, The Hand ninjas and Inner Circle bodyguards, among others. He can take them out with basic jumps, kicks and slashes, as well as link the basic moves into more powerful combos. When Wolverine takes damage, his mutant healing factor kicks in, (slowly) regenerating his health. Health packs should be sought out, however, because just sitting around waiting for the health to recharge is not an option: a timer slowly ticks down to the appearance of the android girl Elsie Dee, designed to destroy Wolverine. Her embrace means instant death.</p><p>Besides the basic enemies, many levels also includes a number of boss fights, some against faceless hardware like a giant robot or a helicopter, others against Wolverine's signature foes. These include classics like Sabretooth and Lady Deathstrike as well as many culled from early 1990s X-Men comics like Albert (an android replica of Wolverine), Cyber, Trevor Fitzroy and Shinobi Shaw. Information about all of the characters can be accessed from an in-game menu.</p>"},{"name":"Wonder Boy III: Monster Lair","year":1990,"developer":"Westone Co., Ltd.","url":"d#Wonder%20Boy%20III%20-%20Monster%20Lair%20%28U%29%20%5Bc%5D%5B%21%5D.zip","filesize":220808,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Direct control > Fantasy","desc":"<p><em>Wonder Boy III: Monster Lair</em> is a quite different game to most of the games in the <em>Wonder Boy</em> series. You play a green-haired dude who must attack the invaders that attempt to collect weapons and use them to destroy the land. The game starts out like a simple platform game, but it's just when Wonder Boy enters the skull further on that the game is transformed into a shoot 'em up, so basically the gameplay consists of action and shooter scenes.</p><p>In the action scenes, your vitality decreases as you make your way towards the skull, but this can be restored by collecting fruit. A wide variety of weapons can be picked up, and not only does these allow you to use the weapons for a limited amount of time, but they also increase your vitality. </p><p>In the shooter scenes, you ride your pink friend as you make your way through the scene. Here, your vitality remains static unless you are hit by an enemy passing by. As usual, there is a boss waiting for you at the end which you must defeat. Every boss changes color to show how much damage has been done to it. You have to defeat some bosses in two stages.</p><p>If your vitality gets low in each scene, you'll lose a life. You can also choose to have Wonder Girl join you, as two players can play the game.</p>"},{"name":"Wonder Boy in Monster World","year":1991,"developer":"Westone Co., Ltd.","url":"d#Wonder%20Boy%20in%20Monster%20World%20%28USA%2C%20Europe%29.zip","filesize":529205,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Metroidvania > Platform > RPG elements > Fantasy","desc":"<p>Monster World was once a peaceful region. Then, the peace was shattered by an invading army of monsters. A young man named Shion vowed to defeat them and make his land peaceful again.</p><p><em>Wonder Boy In Monster World</em> is the third game in the Monster World spin-off series, originally known as <em>Wonder Boy 5: Monster World 3</em>. It puts the player in control of Shion in his quest to save Monster World from the evil hands of BioMeka. It controls like a standard platform game - run, jump, and kill enemies. The game has light RPG elements such as talking to townsfolk, collecting money to buy items, upgrading your life, and equipping a variety of armor and weapons - staying very close to the Zelda format. You can save your game to continue your quest at a later time.</p>"},{"name":"World Championship Soccer","year":1989,"developer":"Ing. C. Olivetti & Co., SpA.","url":"d#World%20Cup%20Soccer%20~%20World%20Championship%20Soccer%20%28Japan%2C%20USA%29.zip","filesize":159917,"score":6.3,"genres":"Sports > Top-down > Direct control > Multiple units/characters control > Football (European) / Soccer","desc":"<p>This soccer game lets you choose a team representing one of twenty-four countries around the world to participate in the World Championship tournament, which is identical to the real 1990 World Cup.</p><p>Once you pick your team you can also select which players you want on the field, so that you can round out the team's strengths and weaknesses. Also provided are modes for single exhibition matches, either against the computer or against a friend.</p><p>The action is viewed from above with large player sprites. Violent play is encouraged as there are no free kicks. The gameplay is rather simple: you can only control the player closest to the ball, and many soccer rules (such as penalty flags and offsides) are missing.</p>"},{"name":"World Championship Soccer II","year":1994,"developer":"Sensible Software","url":"d#World%20Championship%20Soccer%20II%20%28USA%29.zip","filesize":498331,"score":6.5,"genres":"Sports > Top-down > Football (European) / Soccer","desc":"<p><em>World Championship Soccer II</em> is an update of the first game with improved graphics. It contains the teams from the previous game, but adds the 1994 World Cup teams to use in exhibition and tournament play. It also features eight teams from the 1986 and 1990 World Cups, more formations and strategy options, and a four-way play option so four people can play together.</p><p>It does not feature the FIFA logo or license and is more of a violent soccer game without yellow cards and penalties.</p>"},{"name":"World Class Leader Board Golf","year":1992,"developer":"Access Software, Inc.","url":"d#World%20Class%20Leaderboard%20Golf%20%28USA%29.zip","filesize":271388,"score":7.6,"genres":"Sports > Behind view > Golf","desc":"<p>Before the long-running Links series, Access Software produced the Leader Board lineage, which concludes here. Wind, snap, and power are the main considerations as players dodge the bunkers, water, and rough, which make for more complex courses than the 8-bit versions of the original.</p><p>A course editor is included. The courses provided include real locations: St. Andrews (Scotland), Cypress Creek, and Doral Country Club (USA) and a fictional one, The Gauntlet, which, as the name suggests, is designed to push the player's skills to the maximum.</p><p>The PC version utilizes the PC speaker to reproduce voice samples via the company's patented <em>RealSound</em> process. Quips like \"No doubt about it, he's deep in the sandtrap\", \"Straight onto the fairway\", and \"Looks like he hit the tree, Jim\" are used as running commentary during gameplay.</p>"},{"name":"World Cup USA 94","year":1994,"developer":"Tiertex Ltd.","url":"d#World%20Cup%20USA%2094%20%28USA%2C%20Europe%2C%20Korea%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%29.zip","filesize":430319,"score":6.4,"genres":"Sports > Top-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > North America > Licensed","desc":"<p><em>World Cup USA 94</em> is a top-down football (soccer) game recreating the namesake tournament. Beside the 24 teams who qualified for the actual World Cup, other significant footballing nations like England, France and Denmark can be drafted in. Tackling is difficult and passing is easy, making for a flowing end-to-end style of play. The presentation of the menus is largely icon-based, with the official mascot featured prominently.</p>"},{"name":"World Heroes","year":1994,"developer":"Alpha Denshi Kōgyō Co., Ltd.","url":"d#World%20Heroes%20%28USA%29.zip","filesize":1417666,"score":6.8,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control","desc":"<p>An alien entity known as Geegus threatens the Earth in the year 3091. As all of Earth's forces have been defeated, a scientist uses his recently-built time machine to find the greatest fighters of different eras to compete against Geegus.</p><p><em>World Heroes</em> is a versus fighting game. It features a cast of characters from different countries and time periods, ranging from ninjas to a cybernetic super-soldier. The characters are based on real historical figures, but are endowed with supernatural powers. The player selects a character who then fights his way through standard one-on-one matches or takes on an opponent in a Deathmatch, where spiked walls and landmines add to the danger.</p>"},{"name":"World of Illusion Starring Mickey Mouse and Donald Duck","year":1992,"developer":"SEGA Enterprises Ltd.","url":"d#World%20of%20Illusion%20Starring%20Mickey%20Mouse%20and%20Donald%20Duck%20%28USA%2C%20Korea%29.zip","filesize":773047,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>World of Illusion</em> is a follow-up to Castle of Illusion. Mickey Mouse and Donald Duck are taken to a magic world and have to get back home. In order to do that, they can play magical tricks and interact with each other in a two-player cooperative mode.</p><p>Like many other Disney games of the time period, the game has cartoon-like graphics and is played as a side-scrolling platformer. Both Mickey and Donald can run, jump, or attack with their capes. Magic spells are learned after boss battles, and are later used as transportation means, e.g. flying on a magic carpet, building a bridge out of cards, etc.</p><p>While Mickey can squeeze through certain gaps, Donald must find alternate routes in the single-player mode. If two players are controlling them, Mickey can pull Donald through a gap. The two can also stand on each other's shoulders and lower ropes to access certain areas.</p>"},{"name":"World Series Baseball","year":1994,"developer":"BlueSky Software, Inc.","url":"d#World%20Series%20Baseball%20%28USA%29.zip","filesize":1202344,"score":7.5,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p><em>World Series Baseball</em> is the first Genesis title in the long-running series. With all 28 teams included, it features the 6 division alignment (introduced shortly before its release), and has all 700 players of the league. </p><p>The game includes a play-by-play feature and the Home Run Derby. Players are able to play a 162-game season and keep full statistics for every player, thanks to a battery backup. The game also allows players to use the first-person perspective view from the batter's box.</p>"},{"name":"World Series Baseball '95","year":1995,"developer":"BlueSky Software, Inc.","url":"d#World%20Series%20Baseball%20%2795%20%28USA%29.zip","filesize":1546179,"score":8,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p><em>World Series Baseball '95</em> is a follow-up to World Series Baseball. The 1995 edition features updated rosters with 700 players. All 28 teams are present, and the stadiums they play in show digitized players and animations. The game supports battery back-up and the ability to play as baseball legends such as Dizzy Dean, Lou Gehrig and Ty Cobb.</p>"},{"name":"World Series Baseball '96","year":1996,"developer":"BlueSky Software, Inc.","url":"d#World%20Series%20Baseball%20%2796%20%28USA%29.zip","filesize":1544586,"score":"","genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p><em>World Series Baseball '96</em> is a follow-up to the previous two Genesis games in the series with the rosters and stats of the 1995 MLB season as well as the schedule for the 1996 season. It has all 700 players and 28 teams and stadiums. The game types include Exhibition, League, Playoffs, Batting Practice, Homerun Derby, and Classic Homerun Derby. There is also a possibility to play an All-Star game. Trading can be enabled or disabled and the season length options are 13, 26, 52, 104 and 162.</p><p>Gameplay and visuals are similar to the previous game in the series. Batting is shown from a behind view with three options: contact, normal or power. The player has to time the swing to make contact. While pitching the three options are splitter, slider and fastball. In pitching mode a rectangle is shown to determine the position of the ball. It can also moved out of the rectangle to trick the batter into a wide one and the accuracy is determined through the batter's statistics. During gameplay fielding can be done manually or by the computer. Runners have the ability to go back, advance or slide. The three sliding options are hook, pop-up and head-first. Various line-up and strategy options can also be altered during gameplay. The cartridge has a battery to save and resume a league.</p>"},{"name":"World Series Baseball 98","year":1997,"developer":"BlueSky Software, Inc.","url":"d#World%20Series%20Baseball%2098%20%28USA%29.zip","filesize":1570064,"score":"","genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p><em>World Series Baseball 98</em> is the fourth Genesis game in the baseball series. This entry has the rosters and stats of the 1997 MLB season (including interleague play) as well as updated statistics for the 1996 season featured in the previous game. Once again all 28 teams are featured. The game types are identical to before: Exhibition, League, Playoffs, Batting Practice, Homerun Derby, and Classic Homerun Derby, along with All-Star games. Trading can be enabled or disabled. The gameplay and visuals are identical to the previous game. A new feature is that statistics are tracked through 27 categories and next to the overall progress in a league for instance, league leaders, team leaders, team statistics and team standings are saved to the cartridge battery.</p><p>Batting is shown from a behind view with three options: contact, normal or power. The player has to time the swing to make contact. While pitching the three options are fastball, splitter and changeup (in the previous game slide was offered instead of changeup). In pitching mode a rectangle is shown to determine the position of the ball. It can also moved out of the rectangle to trick the batter into a wide one and the accuracy is determined through the batter's statistics. During gameplay fielding can be done manually or by the computer. Runners have the ability to go back, advance or slide. Various line-up and strategy options can also be altered during gameplay.</p>"},{"name":"World Trophy Soccer","year":1992,"developer":"Krisalis Software Ltd.","url":"d#World%20Trophy%20Soccer%20%28USA%29.zip","filesize":233693,"score":7.1,"genres":"Simulation > Sports > Arcade > Football (European) / Soccer > Licensed > Regional differences","desc":"<p><em>World Trophy Soccer</em> (also known as <em>European Club Soccer</em>) is a reworking of Manchester United Europe, using the same side-view gameplay and a wider view than Krisalis' other football game of the time, John Barnes' European Football.</p><p>All the teams who were in contention for one of the 3 main European tournaments as they were at the time of the game's release are included, although with fictitious player names and a few inaccurate kits. Cutscenes detail the match's progress, while a referee is active on the screen. The game can be played in arcade or simulation modes, with 6 different formations available.</p>"},{"name":"Worms","year":1996,"developer":"Team17 Software Limited","url":"d#Worms%20%28U%29.zip","filesize":846563,"score":7.6,"genres":"Strategy > Side view > 2D scrolling > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p><em>Worms</em> is a turn-based strategy game. It features up to 4 teams of 4 worms, aiming to destroy the others on a generated terrain. Each worm has 100 hitpoints and dies when his hit points fall to 0. Upon death, a worm explodes, causing damage to everyone around.</p><p>Gameplay is turn-based. Each turn, the player can control one specific worm from his team. The worm can crawl left and right or jump. However, there is a time limit to make a move; also, if the worm falls from a great height, it loses health and the turn ends immediately; and if a worm falls into water or offscreen, it dies. Each turn, a worm can also make a single attack: the player can aim up and down, choose a weapon and then fire it. After attacking, the turn ends. </p><p>There are a lot of weapons available - the standard ones as bazookas (which are affected by the (random) wind settings and gravity) and grenades. The others include a Fire Punch, dynamite, airstrikes, and utilities such as ropes and girders.</p><p>There are 10 styles of terrain, ranging from forests and deserts to Candy land and the moon (complete with affected gravity). Shots leave craters in the ground, and complex tunnels can be formed.</p>"},{"name":"Wrestle War","year":1991,"developer":"SEGA Enterprises Ltd.","url":"d#Wrestle%20War%20%28W%29.zip","filesize":408119,"score":5.9,"genres":"Sports > Diagonal-down > Wrestling","desc":"<p><em>Wrestle War</em> puts the player in the role of a rookie pro-wrestler, Bruce Blade, who has to go through a series of bouts to win the championship. The \"Sega Wrestling Alliance\" wrestling promotion in which the wrestlers compete is fictional. There are no real-life wrestlers or any licensed tournament used in the game; however, many of the characters bear a strong resemblance to popular wrestlers or movie characters.</p><p>The ring is done in pseudo 3D. The graphics are sprites, but the wrestlers can move along the Z and X axes and the ring will instantly rotate 90 degrees to give a better view of the action if the player's view gets blocked. The available moves are punch, kick, and grab. The objective is to wear down the opponents' life bar, then pin them.</p>"},{"name":"WWF Raw","year":1995,"developer":"Realtime Associates Seattle Division","url":"d#WWF%20Raw%20%28World%29.zip","filesize":2184764,"score":6.8,"genres":"Sports > Diagonal-down > Wrestling > Licensed","desc":"<p><em>WWF Raw</em> is a professional wrestling game featuring up to twelve superstars (ten in the GameGear, eight in the GameBoy version) from the World Wrestling Federation: Bret \"Hit Man\" Hart, Bam Bam Bigelow, 1-2-3 Kid, Diesel, Doink, Lex Luger, Luna Vachon, Owen Hart, Razor Ramon, Shawn Michaels, Undertaker, and Yokozuna.</p><p>In this game, player-controlled wrestlers attempt to pin the opponents to the mat by reducing their power meter until they can fight no more. There is a large number of moves to perform, including turnbuckle maneuvers and \"illegal\" acts such as hitting the opponent with a metal folding chair.</p><p>This game supports up to four simultaneous players, and has the following modes: One-on-One, Tag Team, Bedlam, Survivor Series, Royal Rumble, Raw Endurance Match, and Rematch.</p>"},{"name":"WWF Royal Rumble","year":1993,"developer":"Sculptured Software, Inc.","url":"d#WWF%20Royal%20Rumble%20%28World%29.zip","filesize":1405895,"score":7.2,"genres":"Sports > Diagonal-down > Wrestling","desc":"<p>Control one of twelve World Wrestling Federation stars in a \"no holds barred brawl\" -- in other words, do whatever moves you want, from choke holds, piledrivers, and even chair slams, until your opponent is knocked out. You can even go outside the ring if you like. Several modes of play are available, including one-on-one, tag team (two-on-two), and three-on-three tag team. You can play as the following WWF wresters: Bret Hart, Razor Ramon, Randy Savage, Shawn Michaels, The Undertaker, Tatanka, Mr. Perfect, Crush, Ric Flair, Yokozuna, Ted Dibiase, and Lex Luger.</p>"},{"name":"WWF Super WrestleMania","year":1992,"developer":"Sculptured Software, Inc.","url":"d#WWF%20Super%20WrestleMania%20%28USA%2C%20Europe%29.zip","filesize":629607,"score":7,"genres":"Sports > Diagonal-down > Wrestling > Licensed","desc":"<p><em>WWF Super WrestleMania</em> is a wrestling game that uses rules and wrestlers from the World Wrestling Federation (WWF). The game introduces a characteristic \"tug of war\" gameplay style, which involves two wrestlers grappling each other until one of them has the upper hand. The player has to repeatedly tap a button to execute this move. All the wrestlers share the same set of typical WWF moves such as scoop slams, suplexes, hip tosses, dropkicks, clotheslines, and elbow drops. The Genesis (MegaDrive) version adds signature moves unique to each characters.</p><p>The game's modes are one-on-one, tag team, and Survivor Series matches (four-on-four). The Genesis version also has a WWF Championship mode, which allows the player to select one wrestler and slowly move his way up by defeating other wrestlers in a tournament consisting of one-on-one matches.</p>"},{"name":"WWF WrestleMania: The Arcade Game","year":1995,"developer":"Midway Manufacturing Company","url":"d#WWF%20WrestleMania%20-%20The%20Arcade%20Game%20%28USA%2C%20Europe%29.zip","filesize":3291911,"score":7.4,"genres":"Action > Sports > Side view > 2D scrolling > Arcade > Wrestling > Licensed","desc":"<p><em>WWF WrestleMania: The Arcade Game</em> merges the personalities and action of the WWF TV show characters with a Mortal Kombat-style fighting game. This title features digitized graphics of 8 WWF superstars: Doink, Razor Ramon, Bret \"Hit Man\" Hart, Shawn Michaels, The Undertaker, Yokozuna, Bam Bam Bigelow, and Lex Luger.</p><p>Although presented as a wrestling title, this game is structured like a one-on-one fighter, features over-the-top special moves characteristic of WWF. Each match is divided into a series of rounds, much like a fighting game. Instead of each round ending in a KO, it simply ends when the player forces the other wrestler(s) to fall by reducing their energy meter. Game modes include single player arcade mode, tournament mode, and versus mode for one-on-one multiplayer.</p>"}]