[{"name":"X-Men","year":1993,"developer":"Western Technologies Inc.","url":"d#X-Men%20%28USA%29.zip","filesize":744532,"score":7,"genres":"Action > Side view > 2D scrolling > Sci-fi / futuristic > Licensed","desc":"<p>Professor X's Danger Room is a training facility that can fully re-create environments in which the X-Men can practice their powers, similarly to the holodeck in <em>Star Trek</em>. One day, the danger room starts to go crazy, and randomly loading up dangerous simulations. It turns out that Magneto, the leader of the mutant Brotherhood and the main adversary of the X-men, has loaded a virus into the Danger Room's computer, and now the X-Men have to stop it.</p><p><em>X-Men</em> is a side-scrolling action game based on the comic book series of the same name. The player can control one of four playable characters: Gambit, Nightcrawler, Wolverine, or Cyclops. In addition, it is possible to call upon four other X-Men in when necessary.</p>"},{"name":"X-Men 2: Clone Wars","year":1995,"developer":"HeadGames, Inc.","url":"d#X-Men%202%20-%20Clone%20Wars%20%28USA%2C%20Europe%29.zip","filesize":1169506,"score":7.7,"genres":"Action > Side view > 2D scrolling > Sci-fi / futuristic > Licensed","desc":"<p>This is the second X-Men game from Sega for the Genesis.  This time around, an alien force known as the Phalanx is out to control the earth. The X-Men are our only hope to stop this menace.</p><p>The gameplay of this adventure is similar to side-scrolling action of the previous title.  You have more playable characters this time: Beast, Gambit, Nightcrawler, Psylocke, Wolverine, Cyclops and even Magneto.</p>"},{"name":"X-Perts","year":1996,"developer":"Abalone","url":"d#X-Perts%20%28USA%29.zip","filesize":2557167,"score":5.9,"genres":"Action > Side view > Beat 'em up / brawler > Fighting > Sci-fi / futuristic > Spy / espionage","desc":"<p><em>X-Perts</em> is a spin-off of the <em>Eternal Champions</em> series. The game's plot is based on an alternate timeline, in which the assassin Shadow Yamoto, wasn't killed by the Black Orchid in 1993. She formed an anti-corruption group, the X-Perts, in revenge for an attempt on her life. Meanwhile, a group of terrorists took over an underwater research lab called AQUA, threatening to detonate a device that will destroy the entire Earth...</p><p>In this side-scrolling fighting action game, the player controls Shadow and two companions, switching between them. Each character can execute unique fighting moves, and possesses specific skills. The game is set entirely in the lab; the player uses a special RECOM screen to monitor the placement of characters across the separate areas of the lab, as well as all mission objectives, enemies, facility robots, and other hazards.</p><p>Beside fighting enemies, the player is also able to activate tasks for mission objectives. The time it takes to complete a task is based on the strength of the characters' engineering or computer science skills. Some secondary missions allow character upgrades to their personal weapons.</p><p>Characters can also use the so-called \"torture moves\", unique for each character, to get information from the enemies instead of killing them. This would sometimes be needed for mission objectives. However, if not executed properly, it would instantly kill the enemy instead. </p><p>When the player leaves a character to activate another, he would still continue to perform his task until it was attacked by enemies, and would automatically defend itself, but to a lesser extent than if directly controlled by the player.</p><p>The game is broken down into chapters (save points). and each chapter remembers the status of the entire lab environment (enemies, flooded areas, broken power grids, hacked computers, and active force fields.)</p>"},{"name":"XDR: X-Dazedly-Ray","year":1990,"developer":"Affect Co.,Ltd"},{"name":"Xeno Crisis","year":2019,"developer":"Bitmap Bureau Ltd.","url":"d#Xeno%20Crisis%20%28World%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29%20%28Unl%29.zip","filesize":1969273,"score":7.5,"genres":"Action > Diagonal-down > Top-down > 2D scrolling > Fixed / flip-screen > Arcade > Shooter > Direct control > Fantasy > Sci-fi / futuristic > Horror","desc":"<p>Xeno Crisis is an arena shooter that can be played solo or in local co-op mode. Take control of battle-hardened marines embarking on a deadly mission to confront an alien menace and get home alive! Run and gun your way through thousands of adversaries as you explore the devastated research outpost, searching for survivors, and ultimately facing the origin of the outpost's demise.</p>"},{"name":"Xenon 2: Megablast","year":1990,"developer":"The Assembly Line","url":"d#Xenon%202%20-%20Megablast%20%28U%29.zip","filesize":261448,"score":7.4,"genres":"Action > Top-down > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p><em>Xenon 2: Megablast</em> is a vertically scrolling space shooter, in which you have to pass several levels, filled with waves of enemies, that all end with a level boss creature. Each group of enemies you destroy grants you a cash reward and every once in a while you enter Colin's Bargain Basement, where you can use this cash to purchase upgrades for your ship like better weapons, speed &amp; health upgrades, etc. Some upgrades can also be picked up during the levels.</p><p>The first part of the game has an organic feel to it, while the second part of the game features mechanical enemies. As there are some maze-like sections with dead-ends in the game, your spaceship scrolls backwards when you keep pressing the down key.</p>"}]