[{"name":"Yase Zhuanshuo","year":1995,"developer":"Chuanpu Technologies"},{"name":"Yazzie","year":2020,"developer":"RetroSouls"},{"name":"Young Indiana Jones Chronicles, The","year":1992,"developer":"Jaleco Ltd.","url":"d#Young%20Indiana%20Jones%20Chronicles%2C%20The%20%28USA%29%20%28Beta%29.zip","filesize":180964,"score":"","genres":"Action > Side view > 2D scrolling > Platform > World War I > Licensed","desc":"<p><em>The Young Indiana Jones Chronicles</em> is based on the television series of the same name, which is in turn based on the Lucas/Spielberg movie franchise starring Harrison Ford. In this game, a young Indiana Jones embarks on globetrotting adventures in which he gathers treasure and fights for what is good and right.</p><p>The game features side-scrolling action where young Indy trots along the ground, jumps, crawls flat, and can collect and wield a variety of weapons against copious enemies in the game. Indy starts with a whip and can find such weapons as throwing knives, grenades, pistols, rifles, and others. He can also collect hat powerups which allow him to sustain more damage.</p>"},{"name":"Ys III: Wanderers from Ys","year":1991,"developer":"Nihon Falcom Corp.","url":"d#Ys%20III%20%28USA%29.zip","filesize":726158,"score":7.7,"genres":"Role-playing (RPG) > Side view > 2D scrolling > Action RPG > Metroidvania > Platform > Fantasy","desc":"<p>Adol Christin's long-time friend, Dogi, wishes to return to his home town of Redmont after hearing about strange disturbances that are happening there. Always looking for an adventure, Adol joins him and soon finds out the cause of this new evil.</p><p><em>Ys III: Wanderers from Ys</em> breaks away from the \"bumping into enemies\" battle system of the first two games, allowing Adol to control his sword in a variety of directions. Beside changing the battle system, the game's perspective switches to a side-scrolling view, as opposed to the top-down one of the previous games. Adol also has the ability to jump now. New to the series is the use of magical rings, which give Adol different powering-up abilities such as healing and shielding. The game also uses various key items found along the way to solve minor puzzles and progress the story.</p>"},{"name":"Yū Yū Hakusho Gaiden","year":1994,"developer":"GAU Entertainment"},{"name":"Yū Yū Hakusho: Sunset Fighters","year":1994,"developer":"Treasure Co., Ltd.","url":"d#Yuu%20Yuu%20Hakusho%20-%20Sunset%20Fighters%20%28JU%29.zip","filesize":1259436,"score":8.1,"genres":"Action > Side view > Anime / Manga > Fighting > Licensed","desc":"<p><em>Yū Yū Hakusho: Makyō Tōitsusen</em> is a versus fighting game (in the vein of Street Fighter II) based on the Yū Yū Hakusho anime. Eleven characters are available: Sensui, Jin, Itsuki, Genkai, Kuwabara, Yusuke, Kurama, Hiei, Chu and the Toguro Brothers.</p><p>Up to four players can choose among three game modes: Elimination, Training and Competition. The elimination mode is a traditional arcade style game, in which a single player fights against the computer opponents one by one, in one round matches.</p><p>Training mode allows the players to train in three modes: Royal Battle (one round free for all match, with up to 4 fighters, controlled by the players or the computer), Tag Match (doubles match, controlled either by the players or the computer) and a free Training mode, with no time limit. Players can also select the scenario to train.</p><p>The Competition mode can be played either in individual or doubles mode. Eight fighters compete in an elimination tournament. The players have the option to watch the matches between fighters controlled by the computer.</p><p>In regards to gameplay, each character has one punch and kick. They can also jump, duck, run forward, backwards and move up or down in the ring (as in Fatal Fury). They also have special maneuvers, released by certain combinations of movements and buttons.</p>"}]