[{"name":"Zan: Yasha Enbukyoku","year":1991,"developer":"Wolf Team"},{"name":"Zero the Kamikaze Squirrel","year":1994,"developer":"Iguana Entertainment Incorporated","url":"d#Zero%20the%20Kamikaze%20Squirrel%20%28USA%29.zip","filesize":1158117,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>One day, Zero, the side-kick of the evil Edgar Ektor, receives a letter from his girlfriend Amy, which informs him of a lumberjack named Jacques Le Sheets chopping down trees and destroying his homeland for financial purposes. Despite Ektor's protestations, Zero decides that the desire to protect his land is more important that whatever villainous plans his boss might have had in mind. It's time to show that lumberjack that squirrels of dubious reputation are no strangers to the battle for environmental protection!</p><p><em>Zero the Kamikaze Squirrel</em> is a spin-off of the Aero the Acrobat games, its main protagonist being one of Aero's antagonists. The gameplay is similar to that of <em>Aero the Acrobat</em> games, involving fast-paced side-scrolling and platforming action. Zero can eliminate his enemies by executing his trademark Kamikaze Slam: spinning in the air and crushing the unlucky adversary. He can also collect shurikens (shooting stars) scattered across the levels, and use them for projectile attacks. The squirrel is able to perform double jumps to reach high platforms and jump over larger chasms.</p>"},{"name":"Zero Tolerance","year":1994,"developer":"Technopop, Inc.","url":"d#Zero%20Tolerance%20%28USA%2C%20Europe%29%20%28Rev%20A%29.zip","filesize":738630,"score":7.4,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>The space station Europe-1 has been overrun by aliens. During one of the fights the nuclear cooling system has been damaged, resulting in a meltdown within hours. Your mission, as a team of five of the toughest persons in the Corps, is to infiltrate and gain control of Europe-1. You must sweep the entire station clean of aliens.</p><p><em>Zero Tolerance</em> is a first-person shooter. It is required that you kill every single alien on each of the levels (hence the name). The five members of your team, who have different skills, start out with different weapons, and are your five chances of seeing this through.</p>"},{"name":"Zero Wing","year":1991,"developer":"Toaplan Co., Ltd.","url":"d#Zero%20Wing%20%28U%29.zip","filesize":367479,"score":6.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Zero Wing</em> is an horizontal shooter game where the player is in control of a ZIG, an escape pod released after its main ship was attacked and destroyed by the evil cyborg CATS, bent on taking over the world.</p><p>Like most games in the genre, there are three color-coded weapons: red (scatter), green (homing) and blue (lasers). Each weapon has three levels of power, and to obtain those, similar upgrades must be collected sequentially. However, what makes the game unique is the ability to use a traction beam to trap an enemy and then throw him against his peers, destroying them.</p><p>The game (more precisely, the European PAL version of it) is known for being the origin of the grammatically incorrect phrase in the English translation, <em>All your base are belong to us</em>, which has since become an internet phenomenon.</p>"},{"name":"Zombie High","year":1994,"developer":"Electronic Arts, Inc.","url":"d#Zombie%20High%20%28USA%29%20%28Proto%29%20%281992-08-11%29.zip","filesize":400911,"score":"","genres":"Action","desc":"<p>A prototype similar in concept to Ghoul School; a hip 90's kid must save the day from a school full of zombies and the undead.</p>"},{"name":"Zombies Ate My Neighbors","year":1993,"developer":"LucasArts Entertainment Company LLC","url":"d#Zombies%20Ate%20My%20Neighbors%20%28USA%29.zip","filesize":536775,"score":7.9,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Direct control > Horror > Regional differences","desc":"<p>In <em>Zombies Ate My Neighbors</em>, the player takes the role of a male or female protagonist (Zeke or Julia), fighting vampires, mummies, zombies, and other horrifying creatures. The goal is to destroy these monsters, survive the 50+ levels (not including secret ones), and rescue the neighbors that have survived the onslaught.</p><p>There is a defined number of neighbors who can be saved on every level. When they are all rescued, an \"Exit\" door opens, and the player advances to the next level. The levels range from mall and grocery store to beaches and football fields. Using different weapons such as bazooka or water gun, Zeke and Julia have to kill regular enemies and bosses (huge babies, dragons, ants, and others) at the end of the levels. Despite the horror theme, the game's setting contains humorous elements as well. A two-player cooperative mode is available.</p>"},{"name":"Zool","year":1993,"developer":"Gremlin Interactive Limited","url":"d#Zool%20-%20Ninja%20of%20the%20%27Nth%27%20Dimension%20%28USA%29.zip","filesize":534895,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter","desc":"<p>His name is Zool, and he is a gremlin-like creature from another dimension. He is forced to land on the Earth, but his sole goal is to attain the prestigious ranking of a Ninja. To do that, Zool will have to travel through six worlds, each divided into three stages, defeat his enemies, and prove himself worthy of that title.</p><p><em>Zool</em> is a fast-paced side-scrolling platformer. The protagonist can run, jump, climb walls, and shoot enemies. Power-ups for Zool are scattered across the levels. These include life-spending hearts, smart bombs, shields, a more powerful jump-skill, and a twin Zool. This \"twin\" makes imitates the original's motions a few seconds after he performs them.</p><p>In the options menu, the player can change the difficulty and the game speed (two times), the number of continues, and the background music (rock or funk).</p>"},{"name":"Zoom!","year":1989,"developer":"","url":"d#Zoom%21%20%28World%29.zip","filesize":157754,"score":6.6,"genres":"Action > Puzzle > Diagonal-down > Fixed / flip-screen > Arcade > Direct control","desc":"<p><em>Zoom!</em> is an arcade style puzzle game. Your character Zoomer (a Pacman lookalike with arms &amp; legs) must trace the outline of the squares on the game board to light them up. Points are awarded when full squares are formed, although the game also displays how many lines must still be completed. You proceed to the next level when all the squares have been lit up. There are various monsters that will try to hunt you down - contact with these costs you energy and eventually a life. There are also a number of power-ups that will aid your quest - quick filling of tiles surrounding the bonus piece, a level skip and bonus points, for example.</p>"},{"name":"Zoop","year":1995,"developer":"Hookstone Ltd.","url":"d#Zoop%20%28USA%29.zip","filesize":104492,"score":6.9,"genres":"Action > Puzzle > Top-down > Fixed / flip-screen > Tile matching puzzle > Direct control > Licensed","desc":"<p><em>Zoop</em> is a fast-paced puzzle game in which the player eliminates colored shapes that are approaching his alter ego, another colored shape, before they reach the top, somewhat similarly to Tetris.</p><p>In order to eliminate the other shapes, you must point your piece at it and 'fire'. If the shape is the same color as your piece, the shape is eliminated, as well as all of the shapes of the same color behind it, until your piece hits a piece of a different color. If the shape is of a different color, or it is hit when collecting a line of similar shapes, your piece exchanges colors with the shape.</p>"}]