[{"name":"007: Licence to Kill","year":1989,"developer":"Quixel"},{"name":"10th Frame","year":1986,"developer":"U.S. Gold","url":":10th Frame","filesize":13940,"score":6.7,"genres":"Sports > Behind view > Fixed / flip-screen > Bowling","desc":"<p>Leader Board authors Bruce and Roger Carver tried their hand at tenpin bowling, in one of the game's earliest recreations. The process of bowling the ball involves timing a succession of clicks to set the right angle, speed and curve, similarly to Leaderboard's system. Three skill levels are provided - Kids level sets the speed and hook automatically, while Amateur has more margin for error with hook/slice than professional. The game is played from a plan view, with four other (empty) lanes visible. Single matches or a league structure can be played.</p>"},{"name":"19 Part 1: Boot Camp","year":1988,"developer":"Cascade Games","url":":19 Part 1 Boot Camp","filesize":39406,"score":6.8,"genres":"Action > Racing / Driving > 1st-person > Behind view > Side view > 2D scrolling > Fighting > Shooter > Licensed","desc":"<p>As one of up to four newly recruited soldiers at the time of the Vietnam War (these people had an average age of 19, as the title refers to), you must first face the tough Boot Camp. Conceptually it’s similar to Boot Camp, a fact which can’t be disguised even by the Konami game being known as ‘Combat School’ in Europe. Show enough stamina, skill and determination in these four events and you have proved yourself worthy to fight for the US.</p><p>First you must complete a horizontally-scrolling assault course, with jumps to make my holding down fire to get a yellow bar at the bottom of the screen (hold the button for too long or not long enough and you get a red bar and have to abort the jump, thus wasting time), and monkey bars to waggle your way through. Next up is a shooting range, in which you look through a sightscreen to target the enemies (and avoid the innocent civilians) as they appear on the large screen in front of you. Driving through an assault course is your third task, with damage-inducing hazards to drive around and stars to collect for bonus points. Finally you must do some hand-to-hand combat, before getting your final scores.</p>"},{"name":1942,"year":1986,"developer":"Elite Systems","url":":1942","filesize":21603,"score":6.4,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > World War II","desc":"<p><em>1942</em> is a vertically scrolling shooter for one or two players. The year is 1942, and you are a daring fighter pilot \"Super Ace\". You begin and end each of the numerous levels on an aircraft carrier and then fly your plane into battle against the enemy over both sea and land. After destroying certain plane formations you can collect several different power ups to increase your fire power and chances of survival. You can also make your plane roll to avoid enemy attacks 3 times per life. There are 24 levels, the first being Midway and the last The Final Area.</p>"},{"name":"1942 Mission","year":1984,"developer":"Tartan","url":":1942 Mission","filesize":21524,"score":"","genres":"Adventure > Text-based / Spreadsheet > Interactive fiction / text adventure > Europe > World War II > Spy / espionage","desc":"<p>1942 Mission is an award-winning text adventure game by Tom Frost. You play as a secret agent during World War II who must parachute into a German military base to steal plans for a new recipe for rocket fuel. You control the secret agent using a simple text parser.</p>"},{"name":"1943: The Battle of Midway","year":1988,"developer":"Go!","url":":1943 The Battle of Midway","filesize":27540,"score":6.3,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > World War II","desc":"<p>The sequel to 1942, which is still a vertically scrolling shooter, has the player once again fighting over the clouds during the second world war, this time in an intense battle just off the coast of Midway islands.</p><p>Updates to the gameplay include an energy bar, which can be run down by either being hit by incoming fire or using a special weapon. The energy bar can be replenished by picking up power-ups, while special weapons (lightning, cyclones, and waves) can knock down all fighters on the screen at the time.</p>"},{"name":"1984: A Game of Government Management","year":1984,"developer":"Incentive","url":":1984 A Game of Government Management","filesize":14904,"score":"","genres":"Strategy > Managerial / business simulation","desc":"<p><em>1984: A Game of Government Management</em>  is a financial management game which gives you the chance to be the Chancellor of the Exchequer for the United Kingdom in the 1980s. Starting in 1984 with the real economy figures from 1982/83, you must try to survive in office for as long as possible trying to keep the books balanced and making more money for the country without upsetting too many people.</p><p>Your first screen shows you the Government Balance Sheet with the figures balanced and over the next year you will attempt to keep it balanced. As you play over your first year you will be presented with various screens and these either show the stats for various sectors or ask you various questions about adjusting figures like the Minimum Lending Rate or the percentage in wage increases for various sectors. Other sectors or departments you will have to juggle the figures for include investments, Industrial Levy, funding, foreign aid and Industrial Grants. You will also have a cabinet meeting that asks you a question on various incidents that are happening at the time.</p><p>Once you have completed your first year, you will be shown various graphs and given a performance rating. Then it's on to 1985 and hopefully many years after that.</p>"},{"name":"1985: The Day After","year":1985,"developer":"Mastertronic","url":":1985 The Day After","filesize":12801,"score":5.7,"genres":"Action > Side view > Sci-fi / futuristic","desc":"<p>The control of Big Brother (referring to George Orwell's novel 1984, hence the game's title) has been overthrown, and mankind is self-reliant again. The first task in achieving this is to find the required quantity of energy pods. Big Brother stored them on caverns under the surface of four planets, and it's your job to go and find them. You will have to negotiate through tight sections, using rotational controls where left and right changes the ship's direction and up and down change its speed. When you find a pod you must engage the ship's tractor beam to claim it.</p>"},{"name":"1994 (Ten Years After)","year":1983,"developer":"Visions Software Factory","url":":1994 (Ten Years After)","filesize":13014,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p>You are Smiffy, a person locked in the world of George Orwell's \"1984.\" The book's totalitarian-spying concept is updated for the early-eighties, when the game was produced. Instead of humans monitoring other humans through the television screen, everything is controlled by a Central Computer. Smiffy decides to turn the computer off, and your adventure begins.</p><p>The game is a platform game. In Orwell's book, gigantic buildings dominated the landscape, and whole worlds could be hidden inside them. One of these buildings holds the Central Computer, and the game platforms are the corridors inside the building. You jump over monsters, duck flying objects, and work your way ever upward. Moving through the levels, you work toward the computer.</p><p>This game came out in 1983-84, when people were looking at Orwell's book, and seeing that his predictions were not perfect. Some felt that he had got his date wrong. This game plays on that idea, by moving the date back another ten years.</p>"},{"name":"1st Division Manager","year":1991,"developer":"Codemasters","url":":1st Division Manager","filesize":30562,"score":5.9,"genres":"Sports > Top-down > Managerial / business simulation > Football (European) / Soccer","desc":"<p><em>1st Division Manager</em> is a football management game where the player takes on a team of their choice in any of the top four English leagues. </p><p>On the main menu, there are four icons as well as some major information such as the player's name, the name of the player's club, current league position, a rating, and the account balance.</p><p>The first icon from the left is the picture of a computer and by clicking on it you will get to the main database menu where you can handle the players’ training, study the coming fixtures, and edit the teams or players. The second icon is a telephone and by clicking on it and you will be able to make a phone call to either the transfer market (for buying and selling players) or the bank (to get a loan). The third icon is a notebook and by clicking on it you will see tables from all four divisions. The last icon is the picture of a football pitch and by pressing it you will get to your next match. After choosing your squad you will see the highlights of the match from a top-down perspective.</p><p>After the match you will get reports about players being injured, results in the other matches, and the finances for that week.</p>"},{"name":"2 Hot 2 Handle","year":1991,"developer":""},{"name":"2 Player Soccer Squad","year":1991,"developer":"Cult Games"},{"name":"20 Chart Busters","year":1988,"developer":""},{"name":"20-Veld Rekenen","year":1984,"developer":"Primosoft"},{"name":"2112AD","year":1985,"developer":"Design Design","url":":2112AD","filesize":20655,"score":"","genres":"Action > Side view > Fixed / flip-screen > Puzzle elements > Direct control > Point and select > Sci-fi / futuristic","desc":"<p>The old city of London in the year 2112 is now one giant complex containing a computer which now runs Britain, controlling law, production, finances and other tasks required to run a country. Problem is, Hackers have messed with the programming and now the computer has become a Dictator and the people of Britain have become oppressed by the machine servants the computer has given power to. The hope is for someone to enter the complex and find nine pieces of a Switching Code and placed inside the computer in the right order to hopefully make the computer think more sensibly. You have been chosen to under go this mission in this side view flick screen arcade adventure.</p><p>You start in the centre of the complex where the pieces of the Switching Code must be inserted and along with your Robo-Hound called Poddy, you must explore the complex for the pieces of the Switching Code. In the bottom right of the screen are various icons and these allow you to interact with your surroundings as well as give orders to Poddy. You move your hero or Poddy around each screen and you are  able to pick, use or drop items, pass items to each other and use keys. Keys are needed to open doors and machinery moving around the complex need to be avoided. There are various statuses that be shown for each character and you can save your game and load it for later play.</p>"},{"name":"2x1: Freddy Hardest / Phantis","year":1987,"developer":""},{"name":"3 Deep Space","year":1983,"developer":""},{"name":"3D Bat Attack","year":1984,"developer":"CheetahSoft","url":":3D Bat Attack","filesize":11934,"score":"","genres":"Action > 1st-person > Horror","desc":"<p><em>3D Bat Attack</em> takes place in Transylvania where the player has ended up inside the tower of Count Dracula's castle. There is gold to be collected all over the place but what's worse, there are also numerous vampire bats that roam through the corridors of the tower. </p><p>The game is a Pac-Man variant played from a first person perspective. The game consists of a number of mazes connected with a lift that the player can use to travel between them. Throughout the corridors the player will find gold that he has to collect to earn points. He has to watch out for the bats though. If he comes into contact with a bat he will lose one of his lives. There's only one way of protection against the bats, to eat garlic which he has to find in the mazes. When he eats it he becomes immune to the bats for 20 seconds. If he comes into contact with a bat during this time it will be stunned by the smell. Using the lift is also a way to escape the bats. However for each time the lift is used the bats get more vicious. Difficulty level (0-10) and number of bats (1-4) can be configured before starting a game.</p>"},{"name":"3D Combat Zone","year":1983,"developer":"Artic Computing","url":":3D Combat Zone","filesize":7570,"score":"","genres":"Action > 1st-person > Arcade > Shooter > Tank > Sci-fi / futuristic","desc":"<p><em>3D Combat Zone</em> is a 1st-person tank hunting game which takes place on a vast plain scattered with pyramids. It transports the player into the valleys of Lacentra, now a battlefield occupied with the spoils of acentenary war battled between two opposite factions. The player is in charge of commanding a special tank and the only left from a vanquished fleet.</p><p>The solitary vehicle is equipped with a radar system and provided with a mighty cannon loaded with heavy piercing shells. The cannon is reloaded every time one of the shells hits something or goes through the maximum possible distance. It faces the remnant of the enemy fleet which still commands three types of vehicles: normal tanks, hovering saucers and super tanks.</p><p>This game belongs to the pioneering group of games designed for Spectrum which started to use the 3D wire frame technology effectively, maximizing the use of limited resources on an 8 bit machine and structurally inspired by Battlezone.</p>"},{"name":"3D Defence","year":1987,"developer":"Empire Software","url":":3D Defence","filesize":5503,"score":"","genres":"Action > Shooter > Sci-fi / futuristic","desc":"<p>3D Defence (or Defence, 3D) is a simple shooter from Empire Software. Rules are very simple - player controls defense turret, and must destroy enemy space ships before hostile aliens land on the planet. Player must be accurate - turret has energy to shoot the invader about 10 times.</p>"},{"name":"3D Desert Patrol","year":1983,"developer":"CRL Group","url":":3D Desert Patrol","filesize":4557,"score":"","genres":"Action > Racing / Driving > Simulation > 1st-person > Real-time > Shooter > Tank","desc":"<p>The object of <em>3D Desert Patrol</em> is to reach the safety of a road some distance ahead (depending on difficulty level).</p><p>The player is behind the controls of a tank and can drive forward, steer left and right and fire. Mine fields must be successfully navigated with the aid of a sensor and enemy tanks can be avoided or destroyed. There are five levels of difficulty.</p>"},{"name":"3D Interceptor","year":1984,"developer":""},{"name":"3D Lunattack","year":1984,"developer":"Hewson Consultants","url":":3D Lunattack","filesize":11192,"score":5.9,"genres":"Action > 1st-person > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>The war on the Seiddab rages on, and you now take part in an attack on their moon base. You fly a hovercraft a bit above the moon's surface, and must shoot down the enemy's DAB tanks. After that ring of defense is penetrated, you must dodge your way through a space minefield above a mountain range, and then a missile firing range before reach the Seiddab's command base. </p><p>Unlike its predecessor, 3D Seiddab Attack, you are now flying, and can make more adventurous maneuvers.</p>"},{"name":"3D Maze","year":1982,"developer":"Impact","url":":3D Maze","filesize":6632,"score":"","genres":"Puzzle > 1st-person > Direct control","desc":"<p><em>3-D Maze</em> is a simple maze game played from a first person perspective. Similar to other maze game of its time the player uses keyboard controls to moves around the maze one step at a time. The objective of the game is to find three pieces of treasure which are automatically collected when stepped over. Once that has been accomplished the player has to head back to the entrance to finish the game. A timer on the screen shows how long the game has been played.</p>"},{"name":"3D Monster Chase","year":1983,"developer":"Romik","url":":3D Monster Chase","filesize":12598,"score":"","genres":"Action > 1st-person","desc":"<p><em>3-D Monster Chase</em> is 1st person perspective maze game where the aim is to collect seven keys as well as defuse bombs while avoiding monsters. The maze is made up of three floors which can be moved between by lifts and each key must be found in order. Once you find key one you then have to take it back to your starting position which then places a bomb in the maze. The bomb needs to be defused in a period of time before it explodes or you lose one of three lives. Once the bomb has been defused then you must find key one again before you can find key two and this is the sequence the keys must be collected for all seven keys. As you search the maze, monsters start to appear and a monster keeps appearing after a period of time. If you are caught by a monster then a life is lost but you are armed with a limited amount of grenades to throw. There are five skill levels (1-5) with one being the easiest.</p>"},{"name":"3D Pacman","year":1983,"developer":"Freddy Kristiansen","url":":3D Pacman","filesize":7724,"score":"","genres":"Arcade","desc":"<p>3D Pac-Man is a self-published action game that was released on the Sinclair ZX Spectrum in 1983, only in Denmark; as the name implies, it stars Namco's signature character, Pac-Man, but the player must use the 5, 6, 7 and 8 keys or a Kempston joystick to control him from a first-person perspective (despite the maze, which is the one from the original Pac-Man and Pac-Man Plus but containing 162 pellets as opposed to 244, being shown in an isometric perspective on its title screen).</p>"},{"name":"3D Painter","year":1983,"developer":"CDS Microsystems","url":":3D Painter","filesize":6213,"score":"","genres":"Action > Top-down > Fixed / flip-screen > Arcade","desc":"<p><em>3D Painter</em> is a maze game similar to the arcades respectively either aesthetically or gameplay-wise to Make Trax (Alpha Denshi, 1981) and Pac-Man (Namco, 1981). </p><p>The player has to course the entire maze just like Pac-Man has to \"eat\" every dot present on the screen. The same principle is also applied in <em>Make Trax</em> where the player has to \"paint\" the entire path of the maze, except in <em>3D Painter</em> the player is not represented as a paintbrush but as the painter himself. Only then he can advance to the next stage. There are 4 different possible mazes and each time their whole set is completed the speed of the game will increasingly rise up.</p><p>Besides the player, a dangerous berserker is also present on every maze. A single contact with him and the game is over.</p>"},{"name":"3D Pinball","year":1989,"developer":"Mastertronic Plus","url":":3D Pinball","filesize":20565,"score":6.1,"genres":"Action > Diagonal-down > Fixed / flip-screen > Pinball","desc":"<p>A standard pinball table is featured in this simulation, but with the original addition of a tilted view of the table, giving an illusion of 3D. As with any table, the aim is to get a high score, and this is done by hitting particular targets repeatedly. There are bonus ramps, bumpers, lights to be hit to increase your bonus count (which can be toggled using the left and right flipper keys). There is no 'pin' between the flippers, and no apparent tilt feature, meaning that luck plays a bigger part than in most pinball games. The ball is always launched at a standard speed on each of your five lives.</p>"},{"name":"3D Quadracube","year":1983,"developer":"Artic Computing","url":":3D Quadracube","filesize":4431,"score":"","genres":"Strategy > Side view > Fixed / flip-screen > Isometric > Turn-based > Board game > Text parser","desc":"<p><em>3D-Quadracube</em> is a three dimensional Tic-tac-toe game that can be played by two players or one player against the computer. The game is played on a 4x4x4 cube that has been cut up into four slices that are drawn isometrically. The aim is to get a line of four and it can be vertical, diagonal or horizontal through the cube or on any of the slices. The game is played with the keyboard and for each move the player enters the number of the slice, the row and the column. After a completed game the winner can get a high score based on the number of moves needed.</p>"},{"name":"3D Seiddab Attack","year":1984,"developer":"Hewson Consultants","url":":3D Seiddab Attack","filesize":7451,"score":7.1,"genres":"Action > Simulation > 1st-person > Shooter > Tank","desc":"<p>The Seiddab (look at it twice and you'll get the joke) are on the rampage on the planet, and you have been sent out to stop them in your trusty tank. With a full 3D view, you must first take them on in the cities, shooting 10 down to face the leading man. A scanner is provided to give you a view of which streets the Seiddab lurk on, allowing you to steer left and right to reach them, as well as adjusting your sights to take them down.</p><p>Once cleared, you move onto an open-plan countryside area, with more units coming towards you, and they now drop bombs towards you, putting your 3 lives at a greater premium.</p>"},{"name":"3D Space Wars","year":1983,"developer":"Hewson Consultants","url":":3D Space Wars","filesize":5434,"score":"","genres":"Action > 1st-person > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>The first game to star the evil Seiddab, <em>3D Space Wars</em> gives exactly what the title promises. As soon as you warp into outer space, your cockpit screen is filled with alien spaceships which must be shot down, for you are mankind's last hope, armed with the Earth's only remaining battle spaceship.</p><p>Gameplay is arcade-oriented, with few cockpit gauges and displays to keep in mind. The three cockpit instruments are your radar, speed readout and fuel meter. You run out of fuel when you fire your phasors and when you are hit by enemy fire. You can replenish your fuel by docking with the fuel station which comes into view from time to time. Once all Seiddab spacecraft in the area are destroyed, you warp into the next zone.</p><p>This was the first commercial game by Steve Turner (Spectrum) and Andrew Braybrook (Dragon).</p>"},{"name":"3D Starfighter","year":1987,"developer":"Code Masters","url":":3D Starfighter","filesize":28607,"score":"","genres":"Action > 1st-person > Fixed / flip-screen > Shooter > Space flight > Sci-fi / futuristic","desc":"<p><em>3D Starfighter</em> is a 3D shoot-'em-up where you must using a set of cross hairs shoot the rapidly approaching enemy craft, before they career into you and drain your shields. Use your lasers sparingly, for they also drain your energy.</p><p>The player is in the role a special agent whose mission is to deliver the Complete Hostile Alien Obliteration System (CHAOS) weapon to the population of a distant planet overrun by hostile aliens. Clear each space zone of hostiles before you encounter the ultimate goal to destroy the enemy Battlestar.</p>"},{"name":"3D Starstrike","year":1984,"developer":"Realtime Games Software Ltd.","url":":3D Starstrike","filesize":28166,"score":7.5,"genres":"Action > 1st-person > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>The Outsiders have attacked the Earth Federation, laying waste to its defense fleets. In desperation, Federation Command sends the new Starstrike space fighters to attack the Outsiders's main bases (which are converted moons), hoping to exploit a fatal flaw in the design: a direct hit to the reactor at the center of the base might lead to its destruction.</p><p>Both regarding graphics and gameplay, 3D Starstrike is essentially a clone of Atari's Star Wars. Using wireframe graphics with a first-person perspective, the player controls the Starstrike fighter in several distinct phases: the first phase is the approach to the enemy base, where Outsider space fighters must be destroyed. The second phase takes place close to the surface of the base, where enemy bunkers and laser towers await. The third phase is a trench run, where gun turrets await at the side of the trench, and catwalks blocking the way must be dodged. The run culminates in the reactor room, where two reactor pods must be hit to destroy the base.</p><p>After a base is destroyed, the game continues with a new base in the next level, with later levels having a higher difficulty.</p>"},{"name":"3D Stock Car Championship","year":1988,"developer":"Firebird","url":":3D Stock Car Championship","filesize":28690,"score":"","genres":"Action > Racing / Driving > Isometric","desc":"<p>This Super Sprint-inspired racing game uses a forced perspective viewpoint, with 4 small stock cars duking it out for anything between 1 and 99 laps. If you have an Interface II joystick adaptor, all 4 of these can be human controlled. </p><p>The control method is unusual, in that the accelerator and the throttle are controlled in combination - releasing the throttle while at the current gear's highest speed will move you up to the next one of the 8 gears. The brake turns into reverse when you reach zero velocity.</p><p>The game has 24 circuits, and points are awarded 7-4-2-1 for each of these, with the championship going to the driver with the most points by the end. Before each race there is a 3-minute qualifying session, in which you lap continuously with the aim of getting the fastest lap.</p>"},{"name":"3D Stock Cars II","year":1991,"developer":"Challenge","url":":3D Stock Cars II","filesize":24365,"score":"","genres":"Racing / Driving > Top-down > Fixed / flip-screen > Arcade > Automobile > Track racing","desc":"<p><em>3D Stock Cars II</em> is a game based on the arcade game Super Sprint where you must race other drivers around various tracks to become champion. You can select to race against up to three other drivers (a championship with just you driving is possible) who can be either human or computer controlled. The computer drivers can also have their skill level adjusted from 1 to 15. The Championship is raced over 18 tracks but you can also select how many tracks and which tracks to compete on.</p><p>Before a race each driver must qualify. You drive round one lap to get the fastest time which decides which position you start in the race. After qualification you now race over four laps but can be changed from 1 to 99. Hitting the side of the track, driving through puddles or hitting other cars slows you down but no damage is inflicted. After the number of laps are completed, each driver is awarded points for their position before moving on to the next race. The champion is the driver who collects the most points.</p><p>The game is viewed from above with the whole track seen on the screen. Also seen on screen is each drivers position and laps left to drive. The keyboard or joystick are used to control the cars.</p>"},{"name":"3D Tank Duel","year":1984,"developer":"Realtime Games Software Ltd.","url":":3D Tank Duel","filesize":19095,"score":"","genres":"Action > 1st-person > Arcade > Shooter","desc":"<p><em>3D Tank Duel</em> is an early first-person shooter similar to Battlezone. The player controls a tank on a battlefield and the goal is to blow up all the enemy tanks. Radar is on the top screen, and is useful for searching enemies, showing where the enemy tanks appear. The player has unlimited ammo, but accuracy is important. The game has a pseudo-3D view and coloured landscape. Controls are simple, allowing the player to move and fire.</p>"},{"name":"3D Tanx","year":1982,"developer":"dk'tronics"},{"name":"3D Tunnel","year":1983,"developer":"New Generation Software Ltd.","url":":3D Tunnel","filesize":12179,"score":"","genres":"Action > 1st-person > Shooter","desc":"<p><em>3D Tunnel</em> is a first-person shooter where you must move down a constantly moving tunnel, which moves in multiple directions, over various phases to escape. As you move through the tunnel you must shoot a certain amount of various creatures including bats, frogs and rats, that come towards you, to move to the next phase. If you hit the walls then you lose one of the ten initial lives, and when they are gone then it is game over. The last phase has no shooting, you just have to avoid various underground trains that hurtle towards you. You are able to practise any phase and there are three speeds to select from (Slow, Medium and Fast).</p>"},{"name":"3DC","year":1987,"developer":"Encore","url":":3DC","filesize":26311,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Isometric > Puzzle elements","desc":"<p><em>3DC</em> is an isometric action adventure where the player is stranded on the bottom of the ocean with the objective of finding parts of a submarine, then constructing it in order to escape.  </p><p>Oxygen is of limited supply and various objects are strewn about to be used to solve the various puzzles. Eric the eel can be called to your aid and controlled to be able to fit into crevices too small for the diver's bulk, but watch out for the octopuses who will steal your oxygen tanks.</p>"},{"name":"4 Aces","year":1988,"developer":""},{"name":"4 Logiciels pour ZX Spectrum","year":1987,"developer":"Loriciels"},{"name":"4 Soccer Simulators","year":1988,"developer":"Code Masters"},{"name":"4k Race","year":2004,"developer":""},{"name":"4k Race Refueled","year":2005,"developer":""},{"name":"4x4 Off-Road Racing","year":1988,"developer":"U.S. Gold","url":":4x4 Off-Road Racing","filesize":24939,"score":5.6,"genres":"Racing / Driving > Behind view > Automobile > Off-roading > Vehicle simulator","desc":"<p>As well as recreating off-road racing, this game has considerable capability to upgrade your vehicle. There are four choices of vehicle on offer, each of which has its own weight/top-speed/build strength and so on, and thus is suited to different circuits. You can also buy upgrades and repairs, including carrying some spares.</p><p>There are four different areas in which you can race, each taking place on a different surface - Mud, Ice, Desert, and Mountains. Each of these is littered with hazards, which can either be painstakingly avoided or driven through (with the resultant risk of damage).</p>"},{"name":"720 Degrees","year":1987,"developer":"U.S. Gold","url":":720 Degrees","filesize":22043,"score":5.7,"genres":"Sports > Diagonal-down > Arcade > Tricks / stunts > Skateboarding","desc":"<p>You're a skateboarder in Skate City, one of the largest skateparks ever built. Ollie off of ramps, grind on rails, and swerve past pedestrians as you bust out tricks. Visit skate shops scattered around the park to upgrade your gear and improve your skills. Participate in competitions to earn medals and cash to use in the shops. But, if you don't get to a competition in time, the infamous \"Skate Or Die\" message appears, and then you have to hurry!</p>"},{"name":"747 Flight Simulator","year":1984,"developer":"D.A.C.C.","url":":747 Flight Simulator","filesize":11535,"score":"","genres":"Simulation > 1st-person > Real-time > Flight / aviation > Vehicle simulator","desc":"<p><em>747 Flight Simulator</em> allows the player to sit at the controls of a Boeing 747 Jumbo Jet airliner.</p><p>The upper part of the screen consists of a simple external view (horizon, runway), while the lower displays the instrument panel (airspeed, vertical speed indicator, altimeter, artificial horizon, compass, turn and bank indicator, ILS, flaps &amp; landing gear indicators, various dials for engines). After declaring the amount of fuel and the number of passengers, the player may attempt either a take-off, straight landing approach or random landing approach. The included map features Great Britain and contains 7 airports (Heathrow, Gatwick, Manchester, Birmingham, Newcastle, Edinburgh and Prestwick).</p>"},{"name":"750cc Grand Prix","year":1991,"developer":"Code Masters","url":":750cc Grand Prix","filesize":20712,"score":"","genres":"Action > Racing / Driving > Behind view > Motorcycle > Track racing > Vehicle simulator","desc":"<p>The action in this motorcycle racing game takes place in a small box of the screen, but there’s a good reason for this – unlike virtually every other 8-bit motorcycle racing game, the screen tilts as you lean the bike into the corner, giving it a much more realistic feel. Six British racetracks are featured, with 3-lap races. You must finish in the top 3 of the 8-bike field to qualify for the next one. You will often need to pit for fuel and tires during the race. The other bikes get quite a head start on you by being able to accelerate more quickly, but the first few are usually quite easy to pass on the first lap.</p>"},{"name":"911 TS","year":1985,"developer":"Elite Systems","url":":911 TS","filesize":22393,"score":"","genres":"Racing / Driving > Top-down > 2D scrolling > Arcade > Licensed","desc":"<p>Like the similarly-named C64 game, this driving game puts you in control of a Dunlop-shod Porsche 911. The player must battle through 8 top-view stages packed with obstacles, within a time limit - any remaining time is converted into points. Contact with obstacles (including trees, bicycles and a chasing car) causes damage to accumulate; once this reaches maximum the game is over. </p><p>Before the game starts you can upgrade your car; with £2000 to spend you must choose one (or none) of each of the four categories - tyres, fuel, boost, and handling upgrades such as power-steering and improved brakes. Through trial-and-error you will learn which combinations suit your driving style and the ensuing hazards the most. Further upgrades can be collected on the odd-numbered stages, by driving over them.</p>"}]