[{"name":"A-Team, The","year":1989,"developer":"Zafiro"},{"name":"A.L.C.O.N.","year":1987,"developer":"Toaplan Co. Ltd."},{"name":"AAARGH!","year":1989,"developer":"Binary Design Ltd.","url":":Aaargh!","filesize":27857,"score":5.5,"genres":"Action > Side view > Arcade","desc":"<p>What's that coming over the hill, is it a monster? Yes, as this Rampage-influenced arcade game sees you play either an ogre or a dragon. Both are searching an island for an egg that will give them superpowers. </p><p>This is located inside a building, and to find the right one you must continuously smash them up, using either the ogre's horn or the dragon's tail. Humans must also be attacked as you see them, as their catapults weaken you. Food can be found to restore energy,</p><p>Once you have located the egg, a one-on-one beat 'em up battle with your rival ensues - win five of these to finally win the game.</p>"},{"name":"ABC","year":1983,"developer":""},{"name":"Abracadabra - Part 1","year":1988,"developer":"Odisea Software","url":":Abracadabra (Es) - Part 1","filesize":30473,"score":"","genres":"Adventure > 1st-person > Interactive fiction / text adventure > Fantasy","desc":"<p>A knight called Clus d'Eledorf falls in love with princess Violeta. The jealous witch Saligia, herself in love with Clus, puts a curse on the lovers: the knight has to remain haunting the castle Burgenfels as a ghost, while the princess is forever lost in the woods.</p><p><em>Abracadabra</em> is a Spanish text-adventure made with P.A.W. (Professional Adventure Writer), a popular Spectrum program. The parser is similar to the Infocom one: it supports most of the standard features of it at the time (chain commands, pronouns, adverbs, prepositions and adjectives, for example). The game is divided in two sections, with the second one loaded after the first is completed:1. In the first one, Clus has to break the curse and escape his prison. While in spectral form, the knight is destroyed if he leaves the castle. He can, however, roam freely through its halls to collect its objects and speak with its inhabitants. Burgenfels is a labyrinth with secret doors.</p><ul><li>In the second load, a reincarnated Clus has to find princess Violeta, his lost love, in the Greenwald forest.</li></ul>"},{"name":"Abracadabra - Part 2","year":1988,"developer":"Odisea Software","url":":Abracadabra (Es) - Part 2","filesize":30011,"score":"","genres":"Adventure > 1st-person > Interactive fiction / text adventure > Fantasy","desc":"<p>A knight called Clus d'Eledorf falls in love with princess Violeta. The jealous witch Saligia, herself in love with Clus, puts a curse on the lovers: the knight has to remain haunting the castle Burgenfels as a ghost, while the princess is forever lost in the woods.</p><p><em>Abracadabra</em> is a Spanish text-adventure made with P.A.W. (Professional Adventure Writer), a popular Spectrum program. The parser is similar to the Infocom one: it supports most of the standard features of it at the time (chain commands, pronouns, adverbs, prepositions and adjectives, for example). The game is divided in two sections, with the second one loaded after the first is completed:1. In the first one, Clus has to break the curse and escape his prison. While in spectral form, the knight is destroyed if he leaves the castle. He can, however, roam freely through its halls to collect its objects and speak with its inhabitants. Burgenfels is a labyrinth with secret doors.</p><ul><li>In the second load, a reincarnated Clus has to find princess Violeta, his lost love, in the Greenwald forest.</li></ul>"},{"name":"Abu Simbel Profanation","year":1985,"developer":"Dinamic Software","url":":Abu Simbel Profanation (Es)","filesize":24606,"score":6.8,"genres":"Action > Side view > Fixed / flip-screen > Platform","desc":"<p>The protagonist, Johny Jones, have been mutated by the curse of Abu Simbel, becoming a strange creature that only conserves his enormous nose of his old appearance. </p><p>In order to get rid of the curse he is forced to travel to Egypt to the pyramid where is the tomb of Abu Simbel, and where it must arrive after discovered the keys that will lead him to this place. If he obtains it, he will recover his normal appearance. </p><p>As logical, the pyramid is filled of traps and strange creatures who will suppose a serious obstacle for our pretensions, and the only weapon is our skill to be jump from a side to another one without falling in the claws of our enemies, or the traps that are in all places. He can do long or short jumps, according to the situation in which one is.</p>"},{"name":"Abyss","year":1984,"developer":""},{"name":"Accelerator","year":1984,"developer":"Curtis Jacobs Software Design Ltd.","url":":Accelerator","filesize":14415,"score":"","genres":"Action > Side view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The human race is in a state of decline after a 200 year war in the 25th Century against Alien Confederates, which has seen our race scattered all over the Universe on hostile worlds and sent us back to caveman times. Only one planet has escaped going backwards and advanced as a race and that is Sol and to save the humans, it has sent out scouting ships to rescue the remaining settlements. You are the captain of the ship, The United States of Sol Scout Ship and on one such mission you have encountered various waves of aliens and the only way to survive is to attack all 20 waves.</p><p><em>Accelerator</em> is a side view single screen shooter where you control your ship by moving it around the screen blasting any aliens that appear from either the left or right of the screen. Also on the screen are mines left from the war and if you are hit by a mine, alien ship or it's weapons then you lose one of five lives. You also have to keep an eye on your fuel levels as firing your lasers decreases it but shooting any alien ship increases it. Once a wave is defeated you then move to the next one with an extra life.</p>"},{"name":"ACE 2","year":1987,"developer":"Cascade Games Limited","url":":ACE 2","filesize":18821,"score":6.5,"genres":"Simulation > 1st-person > Flight / aviation > Vehicle simulator","desc":"<p>A follow-up to ACE. Similar to its predecessor, <em>ACE 2</em> is an oldie head-to-head air combat flight sim set in modern days of aviation. The game has a very strong arcade feel, as all the missions you fly are nondescript or generic. Your plane is also a generic, hypothetical modern fighter, and the goal is to fly different sorties to kill enemy aircraft. Very similar to ACE, except that you can now play a 2-player hotseat game, or solo competition against the computer, in split-screen mode.</p>"},{"name":"ACE 2088","year":1989,"developer":"Cascade Games Limited","url":":ACE 2088","filesize":27833,"score":"","genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>After defeating the enemy in ACE and ACE 2, it's now to time to travel into the future and into space. Mission HQ on earth is getting fed up with enemy forces conquering planets under Federation Jurisdiction and so have decided to send yourself to go and take the planets back and destroy the enemy. You have taken a ride on the mother ship Deliverance near the 118 planets that need taking back, and here you can use a computer terminal to start your mission. </p><p>On the terminal you are able to choose a planet, get the information about it as well as check the status of your three fighters you will use to attack each planet. After arming your fighters, you select one then launch from the mother ship. The game is viewed from a 1st person perspective with an instrument panel below your cockpit window as you see the selected planet in the distance. There are enemy ships in the area and these can be destroyed by your laser or missiles while you try to avoid being destroyed yourself. You also have the choice to set a course to the planet or return back to the mother ship.</p><p>On the planet surface you now have to find the enemy bases and destroy them while avoiding or shooting more enemy ships. You can set a course to the nearest one and you use fusion bombs to remove them. Once the bases have been destroyed then you return back to the mother ship and plan your next assault.</p>"},{"name":"Ace Low","year":1983,"developer":""},{"name":"Ace of Aces","year":1987,"developer":"Artech","url":":Ace of Aces","filesize":35026,"score":5.9,"genres":"Action > Simulation > 1st-person > Flight / aviation > Vehicular combat > World War II","desc":"<p><em>Ace of Aces</em> is a 1st person, 2D flight simulation. You're onboard a British RAF Mosquito, maverick fighter bomber.Your mission ... stop enemy trains, intercept the terrible german V-1 buzz bombs, sink the german U-boats and down the Nazi bombers. Are you ready for this challenge?</p>"},{"name":"ACE: Air Combat Emulator","year":1986,"developer":"Cascade Games Limited","url":":ACE - Air Combat Emulator","filesize":22629,"score":6.1,"genres":"Simulation > 1st-person > Flight / aviation > Vehicular combat > Sci-fi / futuristic","desc":"<p>A huge enemy fleet has invaded the southern shore of the U.S. Dozens of tanks and helicopter gun-ships are rolling over Tampa, Florida and through Atlanta, Georgia. Squadrons of enemy fighters are swarming through the air over South Carolina and are heading for Washington, D.C. For the first time in more than 100 years, a foreign power is invading our proud land!</p><p>You are the only remaining fighter pilot, and you have the last three ACE Mark 2.1 Multi-Role All-Weather-All-Terain (AWAT) combat aircraft. Each is housed in one of our three remaining air bases.</p><p>You must fly sorties from our bases, and attack and destroy the numerically superior enemy air and ground forces. Only then can you attempt to destroy their nearly invincible navy. Good Luck! The future of the free world hangs in the balance...</p>"},{"name":"Acheton","year":1988,"developer":""},{"name":"Acro Jet","year":1987,"developer":"MicroProse Software Inc.","url":":Acro Jet","filesize":24923,"score":6.8,"genres":"Simulation > 1st-person > Flight / aviation > Vehicle simulator","desc":"<p><em>Acrojet</em> contains ten acrobatic events which can be played by up to four players and at four different levels of difficulty.In all ten events you fly a BD5J Acrojet over a series of obstacles:</p><ul><li>In the Pylon Race you have to fly around pylons and land safely.</li><li>In the Slalom Race you have to fly a 'figure 8'.</li><li>In the next event, the Ribbon Cut you have to break two ribbons.</li><li>In the Inverted Ribbon Cut you perform the same stunt but flying the plane upside down.</li><li>In the Ribbon Roll there are two ribbons in a row and you have to fly under one</li></ul><p>and complete a full roll followed by flying under the second ribbon.* In the Under Ribbon Race you perform a slalom by flying in sequence under three ribbons.</p><ul><li>In the Under Ribbon Loop you fly under a ribbon followed by a loop and passing over the same ribbon upside down.</li><li>In the Spot Landing event you have to fly up to 2,000 feet and land on the runway as close as possible to a marked spot.</li><li><p>In the Flame-Out Landing event you perform the same stunt but then without the engines running.</p></li><li><p>The tenth and last event, the Cuban Eight, you have to make a half-loop over a ribbon, followed by a half-role, a half loop and flying under the first ribbon again.</p></li></ul><p>Some game parameters can be set. You can decide how the weather conditions are going to be.An instrument panel at the bottom of the screen contains several read-outs, like a altitude meter, a compass, an artificial horizon and a vertical velocity meter.</p>"},{"name":"Action Biker Featuring Clumsy Colin","year":1985,"developer":"Mastertronic","url":":Action Biker Featuring Clumsy Colin","filesize":18751,"score":"","genres":"Action > Racing / Driving > Top-down > Licensed","desc":"<p><em>Action Biker</em> was commercially tied-in with the KP Skips potato snack range, and features its Clumsy Colin mascot prominently. The task is to rescue Marti, who is trapped in one of the 150 houses which make up the forced-perspective 3D world of roads and buildings in the game. </p><p>Colin is on his trusty bike, which must avoid oil slicks, other traffic and contact with walls, but can pick up Skips for an energy boost. Many of the buildings you can enter have nothing of interest, but many have upgrades for the bike. The most important of these are the headlamps you need so as to see into the darkest area of the game world.</p>"},{"name":"Action Double","year":1991,"developer":""},{"name":"Action Fighter","year":1989,"developer":"Firebird","url":":Action Fighter","filesize":25199,"score":5.9,"genres":"Action > Racing / Driving > Top-down > Arcade > Shooter > Automobile > Flight / aviation > Motorcycle","desc":"<p>This is a top-down vertically scrolling shooter, in which you start off as a motorbike. You are quite vulnerable to attack at first, but power-ups come in the form of a Sega van which you have to dock with. The first time you dock you get double fire, the second time gives you a rocket, the third gives a rear force field, and the fourth invulnerability.</p><p>By destroying cars and bikes that appear on your way, you can collect A-F letters. Collecting A through to D allows you to change into a sports car which is less vulnerable to attack, but not as nimble. Collect all the letters in order to be able to transform into a high-tech plane. This is the final stage of one of the five missions. Only the high-tech plane can guide you to your destination in which your main target is hiding.</p><p>There is also a time limit in which you have to complete the mission. It is advisable to transform into the high-tech plane as fast as it is possible.</p><p>Picking up flags gives you bonus points with 10,000 points gaining you an extra life.</p>"},{"name":"Action Force","year":1987,"developer":"Virgin Games","url":":Action Force","filesize":18003,"score":5.9,"genres":"Action > Side view > Arcade > Shooter > Helicopter > Licensed","desc":"<p>COBRA have attacked the small island of Botsneda. While in the pursuing chaos the inhabitants left behind some top secret documents that if found by COBRA will cause a breach of security. Instead of an all out attack from the island protectors, they send in the only suitable vehicle for the terrain; an All Weather and Environment (AWE) buggy. Problem is this has nothing to defend itself with.</p><p>Enter stage left, Wild Bill in a Dragonfly Helicopter. His mission is to protect the AWE against enemy aircraft from destroying it. Also he must lift bridge parts and lower them down over gaps to stop the AWE from killing itself. </p><p>The game is viewed from the side letting you become Wild Bill to control the Dragonfly while you watch the buggy trundle on to certain death. The AWE has 100 hit points while you have 200. The terrain and certain bombs can kill you and the AWE instantly. At the end of a level you receive a message before moving on to another landscape. Good luck William. You'll need it.</p>"},{"name":"Action Force II: International Heroes","year":1988,"developer":"Virgin Games","url":":Action Force II International Heroes","filesize":24330,"score":"","genres":"Action > Side view > Fixed / flip-screen > Platform > Shooter","desc":"<p>The task in <em>Action Force II: International Heroes</em> is to rescue each of the citizens who have been taken hostage by COBRA. It's a two-man operation, with Quick Kick scaling the building, and Airtight destroying hazards along the way from the safety of his helicopter.</p><p>The fact that you play Airtight gives the game its unusual nature. You control a cursor, which must hit each of the potential threats before Quick Kick gets to them. These include enemies throwing barrels, shooting enemies on foot, and fighters hidden in bins. As Quick Kick completes each screen the display moves on to the next one. Shooting the US flags which occasionally appear will restore Quick Kick's energy.</p>"},{"name":"Action Reflex","year":1986,"developer":"Mirrorsoft","url":":Action Reflex","filesize":17140,"score":"","genres":"Action > Side view","desc":"<p><em>Action Reflex</em> involves steering a bouncy ball through 75 screens of hazards. These include lakes, drains, daggers, and a network of pipes which can send you back several screens. You play against a time limit, and contact with one of these hazards deducts time from your limited amount (there are no 'lives' to worry about), and puts you back at the start of the screen. </p><p>Movement is controlled by moving left and right at increasing speed, and using the fire button to jump vertically. Once the all is aerial, it can be vaulted over hazards through careful steering - the faster the ball is going, the higher it can go, and the longer it takes to bring it back under control - the ball can bounce quite far before being stoppable.</p><p>As you play through the game, points bonuses can be collected, which ultimately place useful objects into your possession - keys, hammers and rings, which can be used via an icon system.</p>"},{"name":"Ad Astra","year":1984,"developer":"Gargoyle Games Ltd","url":":Ad Astra","filesize":24795,"score":7,"genres":"Action > Simulation > Behind view > Shooter > Sci-fi / futuristic","desc":"<p><em>Ad Astra</em> is an early into-the-screen 3D space shoot 'em up. Your craft is viewed in front of you, with the first task being to dart in between the planets which hurtle towards you. Once this is passed, the serious business of shooting down the enemy craft begins. These shoot at you from a distance, and your angle of attack varies depending on the angle at which you are flying into the screen, in a sort of trick-3D.</p><p>Landmines (shoot these before they disintegrate towards you) and flying saucers (which don't shoot at you, but must be shot several times), before the task of noting down a code to enable you to progress to the next moon, from which the whole task begins again with increased difficulty. The game keeps track of how long you have been playing each game, as well as a high score.</p>"},{"name":"Addams Family, The","year":1992,"developer":"Ocean Software Ltd.","url":":Addams Family, The","filesize":77998,"score":6.1,"genres":"Action > Side view > Fixed / flip-screen > Platform > Licensed","desc":"<p><em>The Addams Family</em> is a platformer based on the movie of the same name. The player takes the role of Gomez who searches for his missing family members. To find them he has to explore different parts of the mansion, e.g. the woods, while jumping a lot and avoiding enemies. In comparison to the other versions of the game this one is more puzzle-oriented, meaning the player has to find keys to access certain parts of the game world. Another big difference is that this version is not side-scrolling, the player is always sees the whole room and the game switches to another one if the player leaves the screen or enters a door.</p>"},{"name":"Adder Attack","year":1983,"developer":"Mogul Communications","url":":Adder Attack","filesize":22064,"score":"","genres":"Action > Top-down > Arcade > Direct control","desc":"<p>Adder Attack is a simple arcade game. The player must collect golden nuggets and avoid deadly snakes. The dangerous lethal blue snake is also trying to collect nuggets; if given the chance, he will eliminate you... but he has valuable opals. Occasionally he drops one and the player can pick it up for an extra 100 points.</p><p>Adder Attack has simple controls, only 4 keys to move. Graphics are 2D, a characteristic of early ZX Spectrum games.</p>"},{"name":"Addicted to Fun: Ninja Collection","year":1991,"developer":""},{"name":"Addicted to Fun: Rainbow Collection","year":1991,"developer":""},{"name":"Adidas Championship Football","year":1990,"developer":"Ocean","url":":Adidas Championship Football","filesize":50675,"score":5.4,"genres":"Sports > Top-down > 2D scrolling > Football (European) / Soccer > Licensed","desc":"<p><em>Adidas Championship Football</em> is a soccer game with 24 national teams. The only playing mode is a championship which mimics the World Cup with randomly drawn groups. A second player can control a second team.</p><p>The playing perspective is top-down with a scrolling field. The control method is an expanded dribbling method known from the Kick Off series. To make a shot, the player needs to hold down the button for a certain amount of time (this determines the power of the shot) and only then play the ball. The angle can be changed by tapping the button.</p>"},{"name":"Admiral Graf Spee","year":1983,"developer":"Temptation","url":":Admiral Graf Spee","filesize":9606,"score":"","genres":"Simulation > Strategy > Top-down > Naval / watercraft > World War II","desc":"<p>In this early naval simulation the player assumes the role of the captain of the Admiral Graf Spee, one of the fastest ships in the German side during World War II. Your mission is to patrol the South Atlantic and disrupt allied transport routes as much as possible. Enemy vessels appear as blinking dots in the map, and once the Graf Spee is in the area you have to match the course and speed of the enemy as closely as possible. After a while, the enemy, which can range from easy prey such as cargo ships to hard as nails battleships, will become within range and you will be able to engage. After several successful engagements the Altmark supply ship will appear to replenish your fuel and ammo and carry out small repairs on your ship.</p><p>Depending on the player's skill, several endings are available. The high brass are willing to let you retire with full honors if you sank enough enemy ships for them, but the allied side will do anything they can to sink your ship. And if things take a turn for the worse you can always emulate the historical fate of the ship.</p>"},{"name":"Advanced Pinball Simulator","year":1988,"developer":"Code Masters","url":":Advanced Pinball Simulator","filesize":28621,"score":6.2,"genres":"Action > Simulation > Top-down > Fixed / flip-screen > Pinball","desc":"<p>Part of Codemasters' original budget-price range,  this pinball game aimed to put fast &amp; furious action first.</p><p>The table design features extra flippers on both sides, which are at the bases of sections of features. The best scores can be achieved by repeatedly bashing away at sections of blocks.</p><p>The essential theme of the table is of magic and wizardry, with the targets to be lit including the word 'MAGIC' as well as a weather potion and a magic cottage. Trapdoors must be shot open to get their bonuses, then shot shut again to prevent the ball being lost in them. Extra balls are offered every 10,000 points.</p>"},{"name":"Advanced Soccer Simulator","year":1989,"developer":"Mastertronic Plus","url":":Advanced Soccer Simulator","filesize":21276,"score":"","genres":"Sports > Strategy > Side view > Managerial / business simulation > Football (European) / Soccer","desc":"<p><em>Advanced Soccer Simulator</em> is a football/soccer management game for up to eight players. You choose from one of 80 teams from England and Scotland which are split into four divisions consisting of 20 teams each. Each team has a squad of up to 16 players. You begin in Division 4 and your aim is to finish in the top 3 and earn promotion.</p><p>A season consists of 38 league matches plus matches in the League Cup and F.A. Cup. You can make adjustments to your playing squad and even buy or sell players in the transfer market. Each match is presented with highlights which shows all the scoring chances of the game.</p>"},{"name":"Adventure","year":1985,"developer":"Paul McGuire","url":":Adventure","filesize":17223,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Text parser > Fantasy","desc":"<p><em>Adventure</em> is an adaptation of the original Colossal Cave classic text adventure by Crowther and Woods. The objective is to explore the titular cave and gather as much treasure as possible in order to get the highest score possible.</p><p>This is an enhanced version with added locations, existing location text added upon and the major puzzles reworked.</p>"},{"name":"Adventure 1","year":1982,"developer":"Abersoft","url":":Adventure 1 (1982)(Abersoft)","filesize":21343,"score":"","genres":"Adventure > Text-based / Spreadsheet > Interactive fiction / text adventure > Puzzle elements > Text parser > Fantasy","desc":"<p><em>Classic Adventure</em> is a reworking of the 1978 Will Crowther and Don Woods text adventure game Colossal Cave Adventure which has spawned so many copies and variants over the years.  </p><p>The game was originally released as <em>Adventure 1</em> by Abersoft in 1982 on the ZX Spectrum. It was later re-named <em>Classic Adventure</em> and published by Melbourne House on multiple platforms.</p><p>This game is very true to the original, it starts with the classic opening:  </p><p>'You are standing at the end of a road before a small brick building. Around you is a forest. A small stream flows out of the building and down a gully'  </p><p>From this point the player can enter the building and commence exploring the cave system, reputedly modelled on Kentucky's Mammoth Caves complex. In the caves are some unsavoury characters, magic items and treasures to be collected and transported back to the well house. True to the original game, this version supports magic words such as 'Xyzy' and 'Plugh' which will teleport the player between certain rooms.</p><p>The game keeps a score which increases as the treasures are brought back to the well house, the maximum score that can be achieved is 210, and can be saved to a blank cassette tape.</p>"},{"name":"Adventure A - Planet of Death","year":1982,"developer":"Artic Computing Ltd","url":":Adventure A - Planet of Death","filesize":7816,"score":"","genres":"Adventure > Text-based / Spreadsheet > Interactive fiction / text adventure > Sci-fi / futuristic","desc":"<p>This game is the first in Artic's Adventure series. You play the role of a spaceship pilot in the future who has been marooned on a hostile alien planet and must find his spaceship and fix it to escape. To hinder your progress are fiendish puzzles and a handful of alien NPCs.</p><p>The interface is purely text driven and there are no illustrations of the rooms that you are in. The text parser uses simple Verb/Noun for commands.</p>"},{"name":"Adventure B - Inca Curse","year":1982,"developer":"Artic Computing Ltd","url":":Adventure B - Inca Curse","filesize":9166,"score":"","genres":"Adventure > Text-based / Spreadsheet > Interactive fiction / text adventure","desc":"<p>Starting off in a South American Jungle, near an as yet undisturbed Inca temple, your aim is to enter the structure and go treasure hunting. Inside the temple is lots of such treasure (each worth a certain point value), but also traps to catch the greedy. You will encounter a Sacrificial Chamber, a Fire Room and a Pool. Gather as much treasure as possible and return to the jungle clearing to finish the adventure. The game features a simple 'Verb Noun' command interface, and no graphics of any description. Instructions such as 'break door with rock' have to be split into two commands.</p>"},{"name":"Adventure C - Ship of Doom","year":1982,"developer":"Artic Computing Ltd","url":":Adventure C - Ship of Doom","filesize":9168,"score":"","genres":"Adventure > Interactive fiction / text adventure > Sci-fi / futuristic","desc":"<p>While on a reconnaissance flight, your ship has been drawn by a Graviton Beam onto an Alien Cruiser. Fred, your pet android, informs you that the cruiser is on a Humanoid slave mission, its aim to seek out Humanoid planets from which samples are taken and their brains replaced by microchips. Your aim is to free your ship by pressing the control button in the main computer room. Of course, expect various hazards and puzzles to be in your way. The game features a simple 'Verb Noun' command interface, and no graphics of any description. Instructions such as 'insert key into hole' have to be split into two commands.</p>"},{"name":"Adventure Quest","year":1983,"developer":"Level 9 Computing Ltd.","url":":Adventure Quest","filesize":18967,"score":"","genres":"Adventure > Interactive fiction / text adventure > Puzzle elements > Fantasy","desc":"<p>The sequel to Colossal Adventure is an interactive fiction game with a VERB NOUN interface. </p><p>The fantasy setting takes a clear influence from Lord of the Rings. After centuries of harmony, Middle Earth has hit problems due to a cataclysmic sequence of events - a crop failure leading to animals turning violent, and then an attack from a mysterious enemy to the north. The evil Demon Lord Alagiarept is discovered to be responsible, and as such the Wizards are given a week to beat him, before Middle Earth must surrender.</p><p>You play a rookie magician with Meditation, Mysticism andMoneymaking skills. While the main war goes on, you attempt a much bolder mission - locate the four Stones-of-the-Elements and the Medallion of Life to enter Alagiarept's Dark Tower and kill him.</p><p>Your quest will take you through Beaches, Moors and Rocky Outcrops, as well as more specific locations such as the Pillar in the Desert, the Cave of the Sun-Dial and the Mills of God. Wolves, skeletal hands, sharks and octopuses must be dealt with.</p>"},{"name":"Adventures of Barsak the Dwarf, The: The Early Days","year":1984,"developer":"Gilsoft International","url":":Adventures of Barsak the Dwarf, The - The Early Days","filesize":14580,"score":"","genres":"Adventure > Interactive fiction / text adventure > Fantasy","desc":"<p>Legend claims that in the ancient days of the mythological underworld, the Dwarves held the Nine Treasures, and so you, Barsak the Dwarf have decided to go on a quest to find them. You must find food and water to eat and drink regularly on your quest or you will die. <em>Adventures of Barsak the Dwarf</em> is a text adventure where each location is described by text and you use the keyboard to type in commands to interact with each location.</p>"},{"name":"Adventures of Buckaroo Banzai, The: Across the Eighth Dimension","year":1986,"developer":"Adventure International"},{"name":"Adventures of St. Bernard, The","year":1983,"developer":"Carnell","url":":Adventures of St. Bernard, The","filesize":13469,"score":"","genres":"Action > Side view > 2D scrolling > Arcade","desc":"<p><em>The Adventures Of St. Bernard</em> is a single player arcade style game.</p><p>The player takes the role of a St Bernard rescue dog called Brandy and starts with a distress call being received. The player must guide Brandy across five levels during which he/she is attacked by wolves, walruses, skating penguins and snowmen. On some levels there is the added hazard of pools of freezing water.</p><p>The game can be played entirely with the keyboard, there are only three controls Left, Right, and Jump. It also supports Protek &amp; AGF interfaces.</p>"},{"name":"Aegean Voyage","year":1984,"developer":"Joyce Hakansson Associates Inc."},{"name":"Africa Gardens","year":1984,"developer":"Gilsoft International","url":":Africa Gardens","filesize":16586,"score":"","genres":"Adventure > Interactive fiction / text adventure > Puzzle elements","desc":"<p><em>Africa Gardens</em> is a text adventure game with graphics that was written using 'The Quill' Adventure Generator.</p><p>The game is set in an old Victorian hotel. The game starts with a message from the hotel management welcoming the player to the Africa Gardens and wishing them an enjoyable stay. Ominously it concludes \"Indeed Mr Robinson hopes you may be among his many guests who never feel they can leave\". This takes the player straight into the heart of the story, the mystery of Africa Gardens and its missing guests.</p><p>As the player explores the hotel they will come across objects that can be picked up. However as only a couple of objects can be carried at any one time an important part of the game is to remember where objects are and ensure that the player has the correct object in their possession before attempting anything risky.</p><p>The game does have keep score as the player progresses, certain actions will increase the score by, say 5% while others will decrease it. The game also has a save feature and can save to tape or disc.</p>"},{"name":"African Trail Simulator","year":1990,"developer":"Positive","url":":African Trail Simulator (Es)","filesize":24879,"score":5.8,"genres":"Action > Racing / Driving > Side view > Arcade > Motorcycle","desc":"<p>Take to the desert on your off-road bike as you negotiate all the stages of the African trail.</p><p>Before you start each stage, you must select three items of equipment to take with you. But make that decision carefully as it may well be crucial.You meet other riders who will try knock you off your bike.Further, you have to gauge your speed correctly and try to perform wheelies while riding over hills.</p><p>Don't fall off your bike!</p>"},{"name":"After Burner","year":1988,"developer":"SEGA Enterprises Ltd.","url":":After Burner","filesize":29595,"score":6.8,"genres":"Action > Behind view > Arcade > Shooter > Flight / aviation","desc":"<p><em>After Burner II</em> is an updated re-release of After Burner. Besides extra levels, a few new enemies, a few touches at the soundtrack and more disposable missiles, the biggest addition is the ability to slow down or speed up manually. The rest of the gameplay remains identical.</p><p>Despite being called <i>After Burner</i>, most ports to home computers and consoles are based on this version. The NES, Amiga and Commodore 64 received two different ports with significant technical differences. This entry documents the original ports and the second ones can be found under the following entries: NES and Amiga / C64.</p>"},{"name":"After Shock","year":1986,"developer":"Interceptor","url":":After Shock","filesize":31138,"score":"","genres":"Adventure > Interactive fiction / text adventure","desc":"<p>An earthquake has caused devastation in the city, destroying buildings and killing many of its civilians. Although the earthquake was expected, it was thought that it would only be a minor one with minimum damage and not for decades to come, how wrong the experts were. Once the dust has settled it is realised that the nuclear power plant on the outskirts of the city is in a critical condition with the cooling-system needing repair. As the designer of the system, it is your job to get from your office in the heart of the city, make your way through the damaged streets and get inside the plant to repair the cooling-system.</p><p><em>After Shock</em> is a graphic text adventure where the screen has pictures showing what you see and also text describing your location. You type in commands with the keyboard to interact with your surroundings.</p>"},{"name":"After the War - Part 1","year":1989,"developer":"Dinamic Software","url":":After the War - Part 1","filesize":30218,"score":6.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>The year is 2019, Manhattan. After a nuclear war.</p><p>Out of the ashes comes a hero, Jonathan Rogers, better known as \"Jungle Rogers\", the owner of the asphalt jungle. The only chance of survival is to reach the airdrop platform XV-238, located in the control base of the schizophrenic assassin professor McJerin, and to escape to outer colonies.</p><p>There is no easy way to do this. The game is a side-scrolling shoot 'em up, with thugs coming at you constantly, and a few moves to use on them. You must cross the dangerous streets of Manhattan, which have become overrun by feral thieves. Later you await the guardians of the scientific complex of McJerin.</p>"},{"name":"After the War - Part 2","year":1989,"developer":"Dinamic Software","url":":After the War - Part 2","filesize":30742,"score":6.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>The year is 2019, Manhattan. After a nuclear war.</p><p>Out of the ashes comes a hero, Jonathan Rogers, better known as \"Jungle Rogers\", the owner of the asphalt jungle. The only chance of survival is to reach the airdrop platform XV-238, located in the control base of the schizophrenic assassin professor McJerin, and to escape to outer colonies.</p><p>There is no easy way to do this. The game is a side-scrolling shoot 'em up, with thugs coming at you constantly, and a few moves to use on them. You must cross the dangerous streets of Manhattan, which have become overrun by feral thieves. Later you await the guardians of the scientific complex of McJerin.</p>"},{"name":"Aftermath","year":1988,"developer":"Alternative","url":":Aftermath","filesize":9332,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter","desc":"<p><em>Aftermath</em> is a clone of the arcade game Missile Command. The gameplay is very similar in which you must protect the six bases on the bottom of the screen by firing at the missiles heading towards them from your hub. You have a limited supply of ammunition to fire and if your hub is destroyed by a missile you can no longer fire until the level is complete should your bases survive. If all six bases are destroyed the game is over.</p>"},{"name":"Afteroids","year":1988,"developer":"Zigurat","url":":Afteroids (Es)","filesize":20660,"score":6,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter","desc":"<p>You control a spaceship that floats around. You have to blast all the meteors and other objects that bounce in the area.However, shooting the meteors will cause them to fragment into several smaller meteors.</p>"},{"name":"Agatha's Folly - Part 1","year":1989,"developer":"Zenobi","url":":Agatha's Folly - Part 1","filesize":30007,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Text parser","desc":"<p><em>Agatha's Folly</em> is a two part text adventure.</p><p>The player takes the role of someone who has just become the proud owner of a country cottage. It's not been live in for ages, because the previous owner disappeared - vanished without a trace, so it's in a bit of a state. Your own furniture isn't due to arrive for a while so you take a camp bed and set off to Bluebell Cottage to take stock and make a start on the cleaning. Luckily you also bought some furniture with the house so the place isn't that empty.  </p><p>The cottage isn't the only thing you bought, along with the house comes some grounds containing a small lake and a derelict mill which is the 'folly referred to in the title.</p><p>Part One is called 'The Folly and starts with the player exploring their new house. Part Two is called 'Marooned' and cannot be played until part one has been completed as it starts with a question about what happened at end of part one.</p><p>This game was developed using <em>Professional Adventure Writer</em>. It supports the standard commands such as GET and DROP together with shortcuts such as N/S/E/W for North/South/East/West. It is also capable of accepting more complex commands, the manual has the following example 'GET THE PEN THEN WRITE ON THE PAPER AND PUT IT IN THE ENVELOPE\"</p>"},{"name":"Agatha's Folly - Part 2","year":1989,"developer":"Zenobi","url":":Agatha's Folly - Part 2","filesize":27111,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Text parser","desc":"<p><em>Agatha's Folly</em> is a two part text adventure.</p><p>The player takes the role of someone who has just become the proud owner of a country cottage. It's not been live in for ages, because the previous owner disappeared - vanished without a trace, so it's in a bit of a state. Your own furniture isn't due to arrive for a while so you take a camp bed and set off to Bluebell Cottage to take stock and make a start on the cleaning. Luckily you also bought some furniture with the house so the place isn't that empty.  </p><p>The cottage isn't the only thing you bought, along with the house comes some grounds containing a small lake and a derelict mill which is the 'folly referred to in the title.</p><p>Part One is called 'The Folly and starts with the player exploring their new house. Part Two is called 'Marooned' and cannot be played until part one has been completed as it starts with a question about what happened at end of part one.</p><p>This game was developed using <em>Professional Adventure Writer</em>. It supports the standard commands such as GET and DROP together with shortcuts such as N/S/E/W for North/South/East/West. It is also capable of accepting more complex commands, the manual has the following example 'GET THE PEN THEN WRITE ON THE PAPER AND PUT IT IN THE ENVELOPE\"</p>"},{"name":"Agent Orange","year":1987,"developer":"A'n'F","url":":Agent Orange","filesize":20914,"score":"","genres":"Action > Side view > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Eight planets have been infected by a strange weed planted by an alien life form. The weed is sucking the life out of the planet and needs to be destroyed. You control a ship with Agent Orange on board which when planted will kill the weed. When you land on a planet you can see the killer weed growing. Alien fighters try and stop you sowing Agent Orange. Any fighter destroyed leave behind a seed. Collect the seeds but be careful as carrying too many seeds cause your ship to crash.</p><p><em>Agent Orange</em> is a horizontally scrolling top down view shoot-em-up. You can move the screen left and right. The joystick steers the ship while the fire button shoots your weapons. Holding down the fire button releases the Agent Orange.</p>"},{"name":"Agent X II: The Mad Prof's Back!","year":1987,"developer":"Software Creations Ltd.","url":":Agent X II - The Mad Prof's Back!","filesize":25201,"score":"","genres":"Action > Side view > Paddle / Pong > Platform > Shooter","desc":"<p>With Agent X having been a success in both critical and commercial terms, a sequel was inevitable. The Mad Professor's cunning plan this time is to infect everybody with acne, thus causing the economy to crumble (and not just the economy for Valentine's cards). As with the original, the game is split into distinct sections - as with the original these are each loaded one at a time.</p><p>The first section is a horizontally-scrolling shoot 'em up, where Agent X flies freely and must collect powerful weapons to be able to get through. This is followed by some platform action, which involves climbing a tower collecting code pieces along the way. The final section is a Breakout clone, pre-dating Arkanoid as the first game to give a plot behind basic brick-bashing, with the twist that a moving bat at the top of the screen fires the ball back towards you unpredictably.</p>"},{"name":"Agent X in the Brain Drain Caper - Level 1","year":1986,"developer":"Mastertronic","url":":Agent X in the Brain Drain Caper - Level 1","filesize":18385,"score":"","genres":"Action > Racing / Driving > Diagonal-down > Side view > Isometric > Fighting > Shooter > Spy / espionage","desc":"<p>A mad professor has kidnapped the President, and the ransom note says he plans to turn him into a war-mongering maniac (shouldn't be too difficult as I write this....). As Agent X, you must rescue him before he can be brainwashed.</p><p>The game is multi-section, and loads in a number of parts (as they are too big to all fit in the memory together), unusually for a budget-price release . The first section involves driving along a diagonally-scrolling road, attempting to ram various cars and trucks into holes, while avoiding them yourself. Later on you must negotiate shooting galleries and Green Beret-esque beat 'em up sections. Throughout all of this the character's depleting energy is depicted by a graphic of the sprite walking towards a gravestone.</p>"},{"name":"Agent X in the Brain Drain Caper - Level 2","year":1986,"developer":"Mastertronic","url":":Agent X in the Brain Drain Caper - Level 2","filesize":17105,"score":"","genres":"Action > Racing / Driving > Diagonal-down > Side view > Isometric > Fighting > Shooter > Spy / espionage","desc":"<p>A mad professor has kidnapped the President, and the ransom note says he plans to turn him into a war-mongering maniac (shouldn't be too difficult as I write this....). As Agent X, you must rescue him before he can be brainwashed.</p><p>The game is multi-section, and loads in a number of parts (as they are too big to all fit in the memory together), unusually for a budget-price release . The first section involves driving along a diagonally-scrolling road, attempting to ram various cars and trucks into holes, while avoiding them yourself. Later on you must negotiate shooting galleries and Green Beret-esque beat 'em up sections. Throughout all of this the character's depleting energy is depicted by a graphic of the sprite walking towards a gravestone.</p>"},{"name":"Agent X in the Brain Drain Caper - Level 3","year":1986,"developer":"Mastertronic","url":":Agent X in the Brain Drain Caper - Level 3","filesize":18231,"score":"","genres":"Action > Racing / Driving > Diagonal-down > Side view > Isometric > Fighting > Shooter > Spy / espionage","desc":"<p>A mad professor has kidnapped the President, and the ransom note says he plans to turn him into a war-mongering maniac (shouldn't be too difficult as I write this....). As Agent X, you must rescue him before he can be brainwashed.</p><p>The game is multi-section, and loads in a number of parts (as they are too big to all fit in the memory together), unusually for a budget-price release . The first section involves driving along a diagonally-scrolling road, attempting to ram various cars and trucks into holes, while avoiding them yourself. Later on you must negotiate shooting galleries and Green Beret-esque beat 'em up sections. Throughout all of this the character's depleting energy is depicted by a graphic of the sprite walking towards a gravestone.</p>"},{"name":"Agent X in the Brain Drain Caper - Level 4","year":1986,"developer":"Mastertronic","url":":Agent X in the Brain Drain Caper - Level 4","filesize":19497,"score":"","genres":"Action > Racing / Driving > Diagonal-down > Side view > Isometric > Fighting > Shooter > Spy / espionage","desc":"<p>A mad professor has kidnapped the President, and the ransom note says he plans to turn him into a war-mongering maniac (shouldn't be too difficult as I write this....). As Agent X, you must rescue him before he can be brainwashed.</p><p>The game is multi-section, and loads in a number of parts (as they are too big to all fit in the memory together), unusually for a budget-price release . The first section involves driving along a diagonally-scrolling road, attempting to ram various cars and trucks into holes, while avoiding them yourself. Later on you must negotiate shooting galleries and Green Beret-esque beat 'em up sections. Throughout all of this the character's depleting energy is depicted by a graphic of the sprite walking towards a gravestone.</p>"},{"name":"Ah Diddums","year":1983,"developer":"Imagine Software Ltd.","url":":Ah Diddums","filesize":15976,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Arcade","desc":"<p><em>Ah Diddums</em> is a single player game with 99 levels in which the player builds ladders to progress to the next level</p><p>Teddy isn't in a normal toy-box, he's in the central toy-box of a nested set of 99 boxes, and to get out he must build a set of steps by piling building bricks in a specific order. In his box Teddy hears baby crying and its his job to take toys to the baby to stop her crying. However, if baby stops crying then the mother will turn out the light. The other toys in the toy-box with Ted can only play when the light is on so they try to stop Teddy comforting the baby. Contact with any of these toys will shred Ted and cost a life.</p><p>There are weapons available and these will kill the other toys, however killing all the other toys on a level / in a box brings in the invincible lump of plasticine to hamper TedTed's only friend in all this is a jack-in-a-box, Jack jumps out of his box when when Ted touches it and this frightens all the other toys into being still for a short period.The game screen is a top down view of the toy-box. Scattered around are bricks and other items some of which, like the pea-shooter, are weapons. Other toys patrol the game area and contact with any of these is lethal.</p><p>The game is keyboard controlled with an odd arrangement of keys.* To move Ted left or right the keys on the CAPS SHIFT to SPACE row are used in alternating order, i.e. CAPS SHIFT, X, V, N move Ted left, Z, C, B, M moves right.</p><ul><li>To move TED up the screen, or to pick up objects, alternating keys on the Q to P row are used, so keys Q, E, T, U, O will move Ted, while keys W,R, Y, I, &amp; P will make Ted pick up an object.</li><li>To move Ted down the screen or to fire a weapon the keys on the A to ENTER row are used, A, D, G, J &amp; L moving Ted while the remainder fire the weapon.</li><li>the keys 1 to 0 can be used to pause the game at any time</li></ul>"},{"name":"Ahhh!!! Laser Malfunction!","year":1984,"developer":"CRL Group","url":":Ahhh!!! Laser Malfunction!","filesize":13199,"score":"","genres":"Action > Side view > Fixed / flip-screen > Shooter > Direct control > Space flight > Sci-fi / futuristic","desc":"<p>Ahhh!!! is a fast arcade action game for the ZX Spectrum 48K with 18 levels of play using high resolution colour graphics. As the spaceship pilot you must stop the alien attack. Currah -Speech compatible.</p>"},{"name":"Air / Sea Supremacy","year":1991,"developer":""},{"name":"Air Traffic Control Rome","year":2014,"developer":""},{"name":"Airbase Invader","year":1984,"developer":"CP Software","url":":Airbase Invader","filesize":12571,"score":"","genres":"Action > Top-down > Shooter","desc":"<p>Airbase Invader is a 2D top-down shooter game. The player controls Annie, a girl with a peace sign flag, who must stop President Raygun before he hits red nuclear button. Annie must find Raygun in maze - she fights against various soldiers. She uses small hearts as weapons - but she can shoot horizontally only. Game has little jokes - one of enemies is Iron Lady (a.k.a. Margaret Thatcher), etc.</p>"},{"name":"Airborne Ranger","year":1988,"developer":"MicroProse Software Inc."},{"name":"Airbrush","year":1983,"developer":"Soft Hits","url":":Airbrush","filesize":5828,"score":"","genres":"Action > Top-down > Fixed / flip-screen > Sci-fi / futuristic","desc":"<p><em>Airbrush</em> is a single screen action game where the player is in control of a paintbrush which is moved around the screen in an attempt to colour as much of it as possible. About a third of the screen has to be painted to advance to the next level. Paint is limited however and therefore the player has to pick up the paint pots that are scattered around the screen. It is also necessary to avoid the obstacles that stand in the way. There are two different obstacles, guards and radioactive bins, but they differ only in appearance. The player starts with three lives and loses one when running out of paint or when running into one of the obstacles or the surrounding walls. The ZX Spectrum version also features a thief that appear on level 2. It will attempt to steal paint pots and wipe out paint but the player can stop it by firing at it.</p>"},{"name":"Airline","year":1982,"developer":"Cases Computer Simulations Ltd.","url":":Airline","filesize":10334,"score":"","genres":"Strategy > Turn-based > Managerial / business simulation","desc":"<p><em>Airline</em> is an economic strategy game, with the player taking the role of a Chairman for L-AIR, an air company whose business starts off with 3 million. He has 7 years to increase his net assets to 30 million. The player can charter, buy or sell aircraft, as well as managing staffing, maintenance and insurance. Situations in game (like hijacks, air crashes and sabotage) and costs (of fuel and aircrafts, tax demands etc.) are realistic.The graphics are simplified, made up almost entirely of tables and texts.</p>"},{"name":"Airliner","year":1982,"developer":""},{"name":"Airwolf","year":1984,"developer":"Elite Systems Ltd.","url":":Airwolf","filesize":23659,"score":5.9,"genres":"Action > Side view > Shooter > Helicopter > Licensed","desc":"<p>The game of the TV show is viewed from the side and puts you in command of an attack helicopter. Your task is to rescue 5 scientists from an underground lair by destroying its layer of protection and then getting to the core.  Moving onto a screen at a time you must shoot out anything and everything in your path, including lots of regenerating static targets. Realistic gravity takes effect, so you can't simply hover in a set position.</p>"},{"name":"Airwolf II","year":1989,"developer":"Elite Systems Ltd.","url":":Airwolf II","filesize":25196,"score":"","genres":"Action > Side view > Arcade > Shooter > Helicopter > Sci-fi / futuristic > Licensed","desc":"<p><em>Airwolf II</em> is a direct sequel to Airwolf, however this side-scrolling shooter's story has even less in common with the popular TV series, as now Stringfellow Hawke has to pilot his ultra-modern helicopter to combat alien invasion, finding new weapons (lasers, missiles) on the way.</p><p>First released in 1987 as a part of compilations, for Amstrad CPC, Commodore 16 &amp; Commodore Plus/4, Commodore 64 and ZX Spectrum.</p>"},{"name":"Ajax","year":1988,"developer":"Konami Industry Co. Ltd."},{"name":"Aladdin's Cave","year":1985,"developer":"Artic Computing","url":":Aladdin's Cave","filesize":21888,"score":"","genres":"Action > Side view > Fixed / flip-screen > Platform > Direct control > Middle East","desc":"<p><em>Aladdin's Cave</em> is a platform game with similarities to Jet Set Willy. You play as Aladdin, who has been trapped in a cave by an evil wizard. Each room in the cave contains sets of magical items that are guarded by dangerous animals and deadly traps. Collecting complete sets of objects gives Aladdin the power to transmogrify himself into different animals, such as a monkey, bird, dolphin or genie, while other objects provide him with weapons. Using these tools, Aladdin's aim is to escape from the cave and cross the desert to the fortress hide-away of the wizard, and there defeat him.</p><p>On each of the screens, there are usually two to four items to collect. While you can leave the screen at any time, unless you have collected them all, the items will reset and you will have to collect them again. The items will also reset if you lose a life, either by touching one of the on-screen hazards or by falling a sufficient distance. The game ends when you have either killed the wizard and returned to the magic cave, or you have run out of your initial five lives.</p>"},{"name":"Alcatraz Harry","year":1984,"developer":"Mastertronic","url":":Alcatraz Harry","filesize":12610,"score":4.9,"genres":"Action > Side view > Fixed / flip-screen > Puzzle elements > Stealth","desc":"<p><em>Alcatraz Harry</em> is a maze game. The player takes on the role of a prisoner named Harry, who must escape from the prison camp. In order to do so he must steal escape equipment and secret files. The prison maze is a grid containing a scattered selection of revolvers, ladders, wire cutters and similar objects. There are also guards to complicate the route. The player must search for items and avoid the patrolling guards. The game has 144 different locations</p>"},{"name":"Alchemist","year":1983,"developer":"Imagine","url":":Alchemist","filesize":22134,"score":7.6,"genres":"Action > Side view > Fixed / flip-screen > Fantasy","desc":"<p>You play an Alchemist (no surprise there) who is aiming to kill a wizard. To do this, he must collect all four parts of a spell, and all the objects required to enact it.</p><p>Plenty of beings are out there to stop him, and spells can be cast to vanquish these - your spell energy constantly restores, so finding quiet spaces to wait for it to recharge can be beneficial. By pushing down into the ground, you can turn into an eagle so as to fly across gaps, although activating this mode takes a bit of energy, and you can't use spells while eaglified. Pushing into the ground returns you to human form.</p>"},{"name":"Algebraf","year":1988,"developer":"Stanislaw Karpiesiuk","url":":Algebraf (Pl)","filesize":6742,"score":"","genres":"Educational > Puzzle > Top-down > Math / logic","desc":"<p><em>Algebraf</em> is a math puzzle board game, a modified variant of well known Sudoku. The goal requires resolving of mathematical tasks presented in the form of a crossword puzzle. Combined vertical and horizontal equations have to fit together. After three trials computer will issue a final note.</p>"},{"name":"Alien","year":1984,"developer":"Argus Press Software","url":":Alien","filesize":16474,"score":5.9,"genres":"Strategy > Top-down > Real-time > Real-time strategy > Sci-fi / futuristic > Licensed","desc":"<p>\"In space no-one can hear you scream.\"That tagline from the movie is apt for this strategy adaptation that follows the plotline of the first movie in the franchise. The action starts after the chestburster scene which unleashes an alien organism into their enclosed spaceship.  The remaining crew members must attempt to destroy it while the traitorous android tries to protect the alien.  </p><p>There are 3 decks to search with 35 different rooms which are connected by ducts which the alien can use to sneak up on people.  You can herd the alien into an airlock to blast it out into space, or set the auto-destruct on the ship and flee in the shuttle with all remaining live crew members plus Jones the cat who must be found and put in a box.</p><p>The screen shows you a plan of the deck you are on, and the ducts in the immediate area.  There are trackers and sensors which can be used to pinpoint movement in other areas.  In ordering each crew member, you are given possible movements or other actions such as picking up weapons, entering the ducts or catching the cat. In certain situations, special options will appear such as starting the self-destruct system when in the command centre. The responses to orders are also affected by the personality of the crew member, and how much they have had to suffer. </p><p>The screen also displays reports on the condition of the crew member youve selected, whether there is any damage to the room youre in and whether the duct grills are open (meaning the Alien has been through there). You also get the occasional message from the ship's computer Mother like when a crew member dies.  Sound effects create suspense. At times you hear the alien move around or doors and grills being opened as well as the blip from the tracker.</p>"},{"name":"Alien 8","year":1985,"developer":"Ultimate Play The Game","url":":Alien 8","filesize":23145,"score":7.8,"genres":"Action > Diagonal-down > Fixed / flip-screen > Isometric > Platform > Puzzle elements > Sci-fi / futuristic","desc":"<p>This is a puzzle solving game. You are on board a space ship that is heading towards a remote planet. The Cryonaughts, the name of the planets inhabitants have been frozen during the journey.</p><p>You have to find 24 valves and the cryogenic chambers that they are to be plugged into before the ship reaches its destination.</p><p>The ship contains many rooms filled with obstacles that you have to negotiate.There are several types of enemies such as Dalek-like mice and clockwork mice. Both should be avoided!</p><p>You might need a valve to climb over some walls.</p>"},{"name":"Alien Destroyer","year":1984,"developer":"Kuma Computers Ltd.","url":":Alien Destroyer","filesize":10826,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>ALIEN DESTROYERS</p><p>As the last human left on the fortress planet of Roolfhtenin it is your mission to delay the evil forces of Crabok for as long as possible. You have three laser bases at your disposal with which to shoot the hoards, but the longer you survive the faster the aliens will attack with waves of dive-bombing ships. They have unlimited forces; all you can do is buy time.</p><p>Once the game is loaded, press 3 to start playing. The instructions for moving the laser base will appear on screen.</p>"},{"name":"Alien Evolution","year":1987,"developer":"Gremlin Graphics","url":":Alien Evolution","filesize":19219,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Isometric > Direct control > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Following a nuclear holocaust the earth has been populated by a race of hostile aliens. The human survivors driven underground have finally developed a CYBORG android capable of destroying the aliens, but even if CYBORG G4 succeeds in exterminating the first few aliens he will then have to contend with a multitude of the next breed which evolve from their remains and so their life continues....</p><p>Will CYBORG G4 ever halt the ALIEN EVOLUTION?</p>"},{"name":"Alien Highway: Encounter 2","year":1986,"developer":"Vortex Software","url":":Alien Highway - Encounter 2","filesize":21688,"score":"","genres":"Action > Diagonal-down > Puzzle elements > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>The sequel to Highway Encounter, which has a similar game system and appearance despite being written by a different programmer than the original. Your Vorton robot must penetrate the Alien Industrial Complex by crossing 30 screens of pseudo-random isometric landscape.</p><p>The main unique aspect of these games is that not only must you avoid the various monsters and walls, you must also guide a Terratron droid through them by pushing it with your Vorton. Contact drains your energy, but recharge pods are located along the journey</p><p>Control of the Vorton uses left and right to rotate it, and forward to move. It takes a long time to slow down, so precise control and advance planning are required, especially as some screens are much harder if you start them in an awkward position (by exiting the previous one in the wrong way).</p>"},{"name":"Alien Kill","year":1984,"developer":"Mastertronic","url":":Alien Kill","filesize":8404,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Shooter > Direct control > Sci-fi / futuristic","desc":"<p><em>Alien Kill</em> is an arcade action game that borrows in an unusual way from titles like Breakout. In a single, fixed screen environment the player controls a character at the bottom and needs to kill an alien at the top, hidden behind a large wall with multiple layers.</p><p>The character can be moved horizontally and shoots vertically in a straight line using a magnum laser. Instead of breaking the wall down with a paddle the character needs to break the wall's bricks one by one using the gun to reach the alien and hit it multiple times to kill it before time runs out.</p><p>The alien has more defences such as an indestructible \"tungstidium\" barrier that often moves in front of the character and absorbs shots, like a reverse take on a paddle. In addition there is a barrier of white monsters in front of the alien and those require two shots to take them out. Points are scored for hitting the alien, destroying bricks and killing the white monsters. When the alien is killed before time runs out 1,000 points are provided. There are three difficulty levels. The time left is shown through a meter at the bottom that slowly decreases.</p>"},{"name":"Alien Maze","year":1983,"developer":"CRL Group","url":":Alien Maze","filesize":11046,"score":"","genres":"Action > 1st-person > Fixed / flip-screen > Arcade > Direct control > Sci-fi / futuristic","desc":"<p>The aliens have fled Earth, but in revenge for so many of their brethren being destroyed, they have left behind a terrifying challenge. A double maze structure was constructed. The first maze occupied normal space-time and contained numerous clues to a numerical code. It also contained and an entrance to the second maze, located in a parallel dimension and containing a planet shattering \"plazma bomb\". Can you enter the mazes, decipher the clues and then defuse the bomb using the code before the planet is destroyed?</p><p><em>Alien Maze</em> has 5 levels of play. On the practice level, the 'S' key shows a map and the game is won when the first maze is complete. In the more difficult levels, a timer starts counting down to detonation of the bomb. Arrows are also shown on some of the walls of the passages leading to the exit. The 3 digit code will be the total number of left arrows, right arrows, and flashing arrows on the correct path leading to the exit. Completing the first maze takes you to a second one. Here, you have access to a gamma radiation meter, whose reading increases as you get closer to the bomb. Once you reach the bomb, you are asked to enter the code to defuse it, and save the world.</p>"},{"name":"Alien Research Centre","year":1990,"developer":"Zenobi","url":":Alien Research Centre","filesize":29463,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Text parser","desc":"<p><em>Alien Research Centre</em> is a graphical text adventure. The player is a spacer, specifically he's a hard-up spacer, who gets a call from Brogan. Brogan's not hard up, he's rich, he owns a space ship, the Alien Research Centre or A.R.C., and Brogan has a problem. </p><p>One of the A.R.C.'s crew got high on drugs and not only did they sabotage the ship they released a number of deadly creatures. The crew are probably all dead but the ship is still intact and worth a lot of money. Your job is to board her, repair her, reach the bridge and activate the E.H.D. (Emergency Homing Device)  </p><p>Armed only with a decimator cannon, and anything else they come across, the player must explore the ship, repair it, and return to Earth to collect their bonus.</p><p>This game supports the standard commands such as GET and DROP together with shortcuts such as N/S/E/W for North/South/East/West. Other commands such as SHOOT, KILL, STAB, KICK are also needed</p>"},{"name":"Alien Storm","year":1991,"developer":"Team Shinobi"},{"name":"Alien Swarm","year":1982,"developer":"Titan Programs","url":":Alien Swarm","filesize":6493,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Alien Swarm</em> is a simple space shooter similar to Galaxian. The player controls a space ship and shoots aliens. The player's ship has unlimited ammunition, and is at the bottom of the screen, while the enemies come down from the top.</p>"},{"name":"Alien Syndrome","year":1988,"developer":"SEGA Enterprises Ltd.","url":":Alien Syndrome","filesize":40897,"score":6.9,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p><em>Alien Syndrome</em> is a scrolling shooter. </p><p>Your job is to run around and rescue all the captives and make it to the escape hatch before the time bomb explodes. Then face the mother alien at the end of the level.</p>"},{"name":"Aliens","year":1987,"developer":"Electric Dreams","url":":Aliens","filesize":25409,"score":7.5,"genres":"Action > 1st-person > Sci-fi / futuristic > Licensed","desc":"<p>Electric Dreams' game based on the 1986 film <em>Aliens</em> is a first-person strategy game somewhat similar to Space Hulk. The player controls six characters from a remote terminal, guiding them through a 255-room complex in search of the Alien Queen. Each character has a helmet camera and a smart gun, each controlled by the player acting in the role of overall operational commander.</p><p>The player can switch to any character at any time, and must consider coordinating their movements and finding a safe location before switching to the next character. Characters occupy one room at a time, and can pan their view a full 360-degrees inside each room. Doors can be locked to halt Alien progress, or blasted open to get through (at the cost of permanently destroying the door). Alien bio-mass must also be destroyed before it spawns facehuggers, and the Aliens themselves leave lethal puddles of acid when killed (and so shouldn't be killed in front of doors!).</p><p>Aliens prowl the complex and are attracted to gunfire. They will home in on nearby characters and attack, requiring the player to aim that character's gun to defend against the rushing Alien (a headshot kills instantly, while three to the body do the same). If an Alien attacks a character the player is not controlling, they will \"capture\" that character (indicated by a yellow status light). The player must guide another character to the position of the hostage and kill the guarding Alien to rescue them. If not, the captured character will be lost.</p><p>Ammunition for all characters is limited, and refilled only by making a trip to the complex's armory. Similarly, a medical bay can replenish any damage. Characters also have limited stamina, used up with every move made. When stamina is low, the player must find a safe spot for that character to rest up. The complex also houses a generator controlling the lights, which the Aliens can destroy, or the Marines can then repair.</p>"},{"name":"All American Basketball","year":1992,"developer":"Zeppelin Games","url":":All-American Basketball","filesize":16312,"score":"","genres":"Sports > Diagonal-down > Side view > Basketball","desc":"<p><em>All American Basketball</em> as the name suggests is a computer version of the sport of basketball. Here 1 or 2 players can compete in an eight American team tournament or just play an exhibition game. Before you play a game you have a number of options which include how many players, strip color, skill (amateur or professional), and length of game.</p><p>Onto the game, it is viewed from the side showing a part of the court. The joystick moves the player flashing and fire button throws the ball.</p>"},{"name":"All in a Day's Work","year":1996,"developer":""},{"name":"Alphabet Zoo","year":1984,"developer":"Spinnaker Software Corporation"},{"name":"Alpine Games","year":1987,"developer":"Atlantis","url":":Alpine Games","filesize":14521,"score":"","genres":"Sports > Side view > Top-down > Olympiad / mixed sports > Snowboarding / skiing","desc":"<p><em>Alpine Games</em> has you participate in up to five Winter Sports events  Speed Skating, Ski Jump, Skiing, Bobsled and Biathlon. You must reach the qualification criteria of the current event to advance to the next event. Should you complete all five events you restart again with a harder criteria to pass. You are given three lives and if you fail to meet the event's criteria you lose a life. The game ends when you have lost all of your lives.</p>"},{"name":"Alter Ego","year":2011,"developer":"RetroSouls","url":":Alter Ego","filesize":15365,"score":6.6,"genres":"Action > Side view > Platform > Puzzle elements","desc":"<p><em>Alter Ego</em> is an action puzzle platformer. In this game, you control a hero and his phantom 'alter ego' that mirrors all your moves (either horizontally or vertically) from across the screen. You can switch between the hero and his alter ego a limited number of times in each level, in order to avoid enemies and reach inaccessible places. The aim of the game is to collect all purple and green boxes which can be picked up by a hero or his phantom respectively.</p>"},{"name":"Alter Ego: DreamWalker","year":2014,"developer":"RetroSouls","url":":Alter Ego DreamWalker","filesize":48829,"score":"","genres":"Action > Side view > Platform > Puzzle elements","desc":"<p><em>Alter Ego: DreamWalker</em> is the sequel to the 2011 action puzzle platform title Alter Ego. In this game, you have a phantom 'alter ego' that mirrors all your moves (either horizontally or vertically) from across the screen. You can switch between the hero and his alter ego a limited number of times in each level, in order to avoid enemies and reach otherwise inaccessible positions. The ZX-Spectrum version uses multicolor, a software technique to combine more colours than normally possible without colour clash.</p>"},{"name":"Altered Beast","year":1989,"developer":"Activision","url":":Altered Beast","filesize":31012,"score":6.2,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform","desc":"<p>You are a hero raised from the dead by the god Zeus to rescue his daughter Athena. With scenery inspired by Ancient Greece, you have to fight hordes of undead and demons, with a boss at the end of each level until you meet the god Neff, who holds the girl captive.</p><p>The <em>Altered Beast</em> title refers to your shapeshifting abilities. In this platformer, you can collect spirit balls by defeating two-headed wolves, allowing you to mutate into different beasts such as a werewolf, a dragon, a tiger, a bear and others depending on the version. Each form, tied to a level, comes with special abilities such as flight and powerful attacks, easily superseding the basic set of punches and kicks in your human form.</p><p>The game can be played in single player mode, or in same-screen multiplayer co-op mode.</p>"},{"name":"Amaurote","year":1987,"developer":"Mastertronic Added Dimension","url":":Amaurote","filesize":42557,"score":6.6,"genres":"Action > Isometric","desc":"<p>Your task in this isometrically viewed game is to clear the city of Amaurote of the many bugs and insects which have invaded it. You are supplied with an Arachnus 4 ship and 5 million units of cash. </p><p>There are 3 different types of ants - drones, queens and scouts, each representing their real function in the natural world, so queen bees are the most lethal opponents as they generate new ants. Money must be spend on buying improved weaponry (including that needed to destroy the Queen Bees) and repairing the ship throughout the 2500 screens Amaurote is depicted in. As your main weapons are bombs, you need to consider their bounce and distance before firing, to avoid being caught up in stray explosions yourself.</p>"},{"name":"Amazing Spider-Man and Captain America in Dr. Doom's Revenge!, The","year":1989,"developer":"Paragon Software Corporation"},{"name":"Amaznia","year":1985,"developer":""},{"name":"American 3D Pool","year":1992,"developer":"Zeppelin Games Limited","url":":American 3D Pool","filesize":17339,"score":"","genres":"Sports > Diagonal-down > Top-down > Fixed / flip-screen > Pool / snooker","desc":"<p><em>American 3D Pool</em> is a one or two player game featuring both pool and billiards.</p><p>The Pool simulation features one player, two player and tournament modes. In the two player mode the game offers a choice between player vs player, player vs computer, or computer vs computer. When playing against the computer the game allows the player to choose their opponents skill level from 'very bad, bad, medium, good and very good.</p><p>In the tournament mode the game allows eight players, at least one of which must be human, to take part in a knockout competition. Both two player and tournament matches can be either the best of 1, 3, 5, 7 or 13 frames. The Billiards simulation has the same features as the Pool simulation, the difference being in the scoring of the two player and tournament matches which can be the first to either 15, 25, 50, 100, or 200 points.</p><p>The game also features a Trick Shot feature. Nine trick shots are provided and the editor allows further shots to be constructed.</p>"},{"name":"American Football","year":1984,"developer":"Mind Games","url":":American Football","filesize":17113,"score":"","genres":"Sports > Top-down > Football (American)","desc":"<p>Here's your chance to play the sport of American football against the computer or a friend. After choosing team names and picking heads or tails, it's onto the game. The game is a top down view of the whole pitch. After the kick off and the receiver has been tackled or scored a touchdown you can select your play by typing in the first two letters. For defence you have a choice of four including pass, run or blitz. For offense you have a choice of ten plays including bomb, shotgun, Punt or kick. Then you watch the action until the play is over.</p>"},{"name":"American Tag-Team Wrestling","year":1992,"developer":"Zeppelin Games Limited","url":":American Tag-Team Wrestling","filesize":24242,"score":5.5,"genres":"Sports > Diagonal-down > Side view > Fixed / flip-screen > Fighting > Wrestling","desc":"<p>Released at a budget price around the peak of the WWF's original popularity, the twist in this wrestling game is the tag-team nature of competition. Each player selects two wrestlers from those on offer, and when the one in the ring is weakened he can go to the edge of the ring and tag his team-mate, who then enters the ring and allows the other to recover.</p><p>You can either play individual matches (for one or two players) or a full tournament, with three rounds of variable length. There is no joystick-waggling in the control system, with a variety of kicks, throws and punches on offer using simple joystick motions. Once the players are close together they grapple - this gives you a chance to lift and then piledrive your opponent.</p>"},{"name":"Amulet, The","year":1985,"developer":"K-Soft"},{"name":"An Everyday Tale of a Seeker of Gold","year":1986,"developer":"Zenobi Software"},{"name":"Anarchy","year":1987,"developer":"Rack-It","url":":Anarchy","filesize":17552,"score":6.7,"genres":"Action > Top-down > Puzzle elements > Shooter","desc":"<p>Inside an Ace Mk2 Interceptor tank, you have been assigned a hazardous 16-stage mission. You must travel to the overrun planet of Sentinel 4, and destroy the weapons caches the rebels have build up. They can't be blasted when you are right next to them, ensuring that a degree of planning and strategy is required.</p><p>Viewed from above in levels with simple sideways scrolling, the objective on each level is to shoot each of the weapons crates, before going through the newly-opened exit.  Guard droids must be avoided, but shooting them can leave them inactive for a short period of time, and they can now be shot or hit to push them in that direction, which can be used strategically to make more paths available. There is a 2-minute time limit on each level. Every 5th level has a nuclear weapon guarded by a seeking enemy droid, which continually follows you.</p>"},{"name":"Android One: The Reactor Run","year":1983,"developer":"Vortex Software","url":":Android One - The Reactor Run","filesize":6054,"score":"","genres":"Action > Side view > Shooter > Sci-fi / futuristic","desc":"<p><em>Android One: The Reactor Run</em> is a horizontally scrolling action shooter with tile-based graphics. The player must reach and destroy the reactor before the time runs out. Along the way various aliens are encountered, some of which can be shot with the android's laser beam, while others are impervious to fire and must be avoided. The player will also have to shoot his way through several brick walls.</p><p>The action is divided into individual screens. Once the player reaches the right edge of the screen, the level scrolls onwards by one screen. A slider in the bottom of the screen indicates the player's progress.</p><p>Once the player has destroyed the reactor, he must make his way back to the start point for extra points, this time without a time limit.</p><p>The android control scheme differs between the keyboard and the joystick. With the keyboard, you use left and right keys to rotate the android in 90 degree steps and forward to move. With the joystick, the android runs in the direction the joystick is moved.</p>"},{"name":"Android One: The Reactor Run - Intro","year":1983,"developer":"Vortex Software","url":":Android One - The Reactor Run - Intro","filesize":4144,"score":"","genres":"Action > Side view > Shooter > Sci-fi / futuristic","desc":"<p><em>Android One: The Reactor Run</em> is a horizontally scrolling action shooter with tile-based graphics. The player must reach and destroy the reactor before the time runs out. Along the way various aliens are encountered, some of which can be shot with the android's laser beam, while others are impervious to fire and must be avoided. The player will also have to shoot his way through several brick walls.</p><p>The action is divided into individual screens. Once the player reaches the right edge of the screen, the level scrolls onwards by one screen. A slider in the bottom of the screen indicates the player's progress.</p><p>Once the player has destroyed the reactor, he must make his way back to the start point for extra points, this time without a time limit.</p><p>The android control scheme differs between the keyboard and the joystick. With the keyboard, you use left and right keys to rotate the android in 90 degree steps and forward to move. With the joystick, the android runs in the direction the joystick is moved.</p>"},{"name":"Android Two","year":1983,"developer":"Vortex Software","url":":Android Two","filesize":12404,"score":"","genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p><em>Android Two</em> places the player in a maze featuring 5 Militoids to destroy within a time limit. Although they don't shoot back at the player, there are plenty of other hazards in the maze. Aliens are present, which can shoot at the player, as well as land-mines and 20 indestructible robots to block the player's path. There are 3 mazes to clear, each of which has a wrap-around design similar to the original Pac-man game and fills more than one screen. The player has five lives in which to progress as far as possible and try to beat the high score.</p>"},{"name":"Androids","year":1983,"developer":"Sunshine Books","url":":Androids","filesize":6028,"score":"","genres":"Action > Diagonal-down > Arcade > Shooter","desc":"<p><em>Androids</em> is a maze / shoot 'em up type of game for one player.</p><p>The game consists of a maze. The objective is to travel through the maze to find the exit. En-route are androids who will try to kill you. You have a laser that only holds seven shots and a shield that can stand five hits. Both of these can be recharged by walking over special squares, blue patterned ones recharge the laser and red patterned ones recharge the shield.Also in the maze are doors, represented by cyan coloured squares. The player can pass through these but the androids cannot.</p><p>Points are scored for completing the maze before the time bonus runs out and for killing each android. </p><p>The mazes are large and are made to seem even larger because they wrap around making it possible to travel in circles</p>"},{"name":"Andy Capp","year":1988,"developer":"Mirrorsoft","url":":Andy Capp","filesize":26756,"score":6.7,"genres":"Simulation > Side view > Fixed / flip-screen > Real-time > Life / social simulation > Direct control > Menu structures > Contemporary > Europe","desc":"<p>In this game you play the role of Andy Capp, the hard drinking northern layabout from the comic strip in the British newspaper <em>The Mirror</em>. If he doesn't give his new unemployment benefit to his wife, she will leave him - unfortunately he already spent it. So the goal of the game is to gather enough money.</p><p>There are various ways to achieve this, e.g. pumping other people for money or betting. He also needs to keep his alcometer as full as possible while avoid being arrested for fighting various characters including your own wife. Andy can stop people in the street by blowing a kiss at them. When he stands next to a person he can interact by either giving them an item, talking to them or beating them up.</p>"},{"name":"Anfractuos","year":1987,"developer":"Players","url":":Anfractuos","filesize":24795,"score":"","genres":"Action > Side view > Puzzle elements > Shooter > Sci-fi / futuristic","desc":"<p>The planet Anfractuos is about to reach the end of its life, due to its sun evolving into a Supernova. All that remains is a mining droid under your control, which is stocked with resources and ideally needs to escape. Viewed from the side with flick-screen scrolling, the game features many one-way paths and dead-ends, so mapping is recommended (the game tells you not to blame the main programmer for this, as he didn't design the levels)</p><p>The area's wildlife is hostile to you, but it's protected, so shoot the bare minimum in your attempts to avoid it. 8 fuel crystals (located randomly in each game) must be collected before you can activate the 4 switches which activate the escape shuttle's automated departure sequence (and then return to the shuttle in time).</p>"},{"name":"Angel Nieto Pole 500","year":1990,"developer":"Opera Soft S.A."},{"name":"Angels","year":2021,"developer":"Zosya Entertainment"},{"name":"Angle Ball","year":1987,"developer":"Mastertronic Added Dimension","url":":Angle Ball","filesize":12941,"score":6.1,"genres":"Action > Sports > Pool / snooker","desc":"<p>Angleball is a variation on Pool, using a hexagonal table with 6 pockets and 6 sides. The ball can rebound off these at unusual angles, making the outcomes of shots harder to predict. The basic objective is to pot all the balls, while failing to pot a ball in 3 shots will lose you the frame unless your opponent also fails to do this.</p><p>The game can be played by one or two players, with the one-player game consisting of a sequence of 20 different table layouts, each requiring its own style to win. Two-player games can take place on any of these layouts or one of your own design using the inbult table editor. Shot direction, speed and spin can be set on a general level.</p>"},{"name":"Angler","year":1983,"developer":"Virgin Games","url":":Angler","filesize":5684,"score":"","genres":"Sports > Side view > Fixed / flip-screen > Fishing","desc":"<p><em>Angler</em> is a fishing game where a river is viewed from the side. The player controls a boat left and right along the surface and has to catch the fish that swim back and forth in rows. With the press of a button the line will be cast and it will drop until the button is released, it hits a fish or reaches the river bed. To catch a fish the hook has to land exactly in front of it. In each game the player has 100 casts and has to catch as much fish as possible before they run out. In addition to fishes there are crabs which should be avoided since they eat fish that has been caught. To get rid of a crab it is necessary to catch one of the larger fish which in turn can eat the crab.</p>"},{"name":"Animated Strip Poker","year":1985,"developer":"Knightsoft","url":":Animated Strip Poker","filesize":15982,"score":"","genres":"Strategy > Cards / tiles","desc":"<p><em>Animated Strip Poker</em> is a version of the game Strip Poker where you play Five-Card Stud against a woman to try to get her naked by winning hands to make her remove clothing. On the screen you can see your current hand of cards, the woman and a small character in the shape of a card who tells you the next part of the game. Both you and the woman start with 145 and 10 in the pot and you must raise, call or bet money on how you feel your hand of five cards will do against hers. Once the betting has been completed, you remove any cards you don't need and receive the same amount of cards. Betting once again takes place until a player calls and you both show your cards. The player with the better hand like pairs, two pairs, full house etc., wins the money and the other player removes a piece of clothing.</p>"},{"name":"Annals of Rome","year":1987,"developer":"Datasoft Inc.","url":":Annals of Rome","filesize":21182,"score":6.7,"genres":"Strategy > Top-down > Turn-based","desc":"<p><em>Annals of Rome</em> begins in 273BC and sets you as a Roman senator, with the ultimate aim of colonizing as much of the known world as possible, and retaining that power against Carthaginians, Vandals, Parthians, Persians and all the other world forces. You have a strong army at your disposal, and can direct your generals as to which countries they attempt to invade.</p><p>The game is turn-based, and these turns operate in phases, beginning with the economic circumstances of population and tax income being decided - it's recommended to keep taxation taxing low unless things become desperate. The game then updates you on the statuses of your generals, and give you the chance to redistribute them to other parts of your kingdom. </p><p>Officers may rebel and cause a civil war - fortunately this can usually be pre-empted. More serious are attempts to take land from other civilizations, which take place in order and include conflicts between other groups. These, like every element of the game, are accurately historically modeled and variable in time-span as a result.</p>"},{"name":"Ano Gaia","year":1992,"developer":"Your Sinclair","url":":Ano Gaia","filesize":26162,"score":"","genres":"Shoot-'em-Up","desc":"<p>One of my all-time favourite Speccy shoot-em-ups is Ano Gaia, which only ever appeared on a late-in-the-day Your Sinclair cover tape. Brilliant little game, very playable and super-colourful!</p>"},{"name":"Answer Back Junior Quiz","year":1985,"developer":"Kosmos Software Ltd"},{"name":"Ant Attack","year":1983,"developer":"Quicksilva","url":":Ant Attack","filesize":13716,"score":7.2,"genres":"Action > Diagonal-down > 2D scrolling > Isometric","desc":"<p><em>Ant Attack</em> is an action game which innovated the usage of three freedom grades for an isometric perspective game. The freely explorable city, identified in the inlay blurb as Antescher, a combination of Ant and Escher, the famous visual paradox artist, is teeming with deadly giant ants. The player controls a boy or a girl and races around the city trying to find his/her lost half while jumping on structures to avoid the ants, or fighting the insects by either jumping on them or throwing grenades. When the hostage is found, the protagonist needs to guide him/her into safeness. Then the next round, with higher difficulty and the hostage being placed at another point, begins. The perspective can be switched to four 90 turned views.</p>"},{"name":"Antagonists, The","year":1985,"developer":"Addison-Wesley Productions","url":":Antagonists, The (Nl)","filesize":19911,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Text parser > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>It is the 24th century and Earth is now dominated by insects and ruled by the ants, who have grown to a larger size. In a world where the most species are extinct you follow the trail of Albert Renshaw, the last surviving member of planet Earth to find a way to escape by finding a particular \"object\" that is guarded by the ants.</p><p><em>The Antagonists</em> is a text adventure where you type in verb-noun commands with the keyboard to interact with your surroundings, such as \"OPEN DOOR\". To navigate your way through the locations in the game you uses the commands 'EAST', 'WEST', 'NORTH', 'SOUTH', 'UP' and 'DOWN'. In the case of a two-word command, the first word may be one of the following verbs: 'GO', 'WALK', or 'RUN'. The second word must be a direction. 'CLIMB' is only useful for climbing an object or a creature and is a two-word command. </p><p>Type 'LOOK' and you get a description of your surroundings. When encountering a creature you can run away or use 'ATTACK' or 'KILL' to weaken them. If you have a tool for this purpose you must also enter the name of this tool. If not the parser will assume that you want to kill the creature with your bare hands which will make your attack less effective. Use 'OPEN' if you want to open the door and 'CLOSE' to close them. If the door is locked, and you have the right key, you can unlock it with 'UNLOCK'. If the door is unlocked, and you have the right key, you can lock it with 'LOCK'. You also have to indicate the tool to be used. With 'TAKE' or 'GET' you get an object in your possession and 'DROP' to remove something from your possession. </p><p>When an appropriate object is collected you can type 'EAT' to get one lost energy point in return. If you are carrying an appropriate tool and it is dark you can give the command LIGHT ON for making light and LIGHT OFF to extinguish it. Use 'WAIT' or 'SLEEP' to wait for awhile. 'INVENTORY' (or 'I') tells you what you have in your possession, the amount of weight you can still carry and the number of wounds which you can still survive.</p><p>There is an option to save or load the game. 'RESTART' restarts the game from the beginning. </p><p>Originally the program was typed in from a book. The first part of the book is entries taken from the diary of Albert Renshaw, the last survivor of Mother Earth. It relates to the discovery of the beta 2 growth hormone, which was expected to solve the world's malnutrition problems and the growth of plants and animals. Unfortunately, also insects, like the ants, grew. They regarded humanity as an enemy and are using their organizational talents as a weapon against the intelligence and so-called creative faculties of the human race. Not only the insects grew but also the movements against the killing of insects. The increased pity for insects was directly proportional to their increased size. It also tells about how Albert Renshaw prepared for his journey to find the means to escape. The second chapter is The Book of Flowers by Prof. Dr. K.J.Th.M. Lanuski. It gives a detailed explanation on what you need to identify plants, an in-depth classification of different environmental divisions and illustrated with a number of examples. </p><p>The third chapter is the James Arwell Societys publication, which among other things describes the Tenins and the Lepries. With all the other mammals extinct, except for certain specialised breeds in zoological gardens, the Tenins, who are similar to Elves, but their moods can change rapidly to become dark and deceitful, and the friendly Lepries, who are characterised by a total lack of physical beauty. They always have looked after the insect farms, and it is probably as a result of this that they are now tolerated by the insect population. Includes drawings by James Arwell and Donald Beamon. The fourth chapter is the guide to INSECTOLAND. It gives information and clues concerning the various giant ants, bees, flies, beetles and butterflies which inhabit the park.</p><p>The last chapter is about programming the game. The entire program has been divided into seven steps, one for each day; Monday, Tuesday, Wednesday, etc. A basic listing program, named Decoder, that has an error checking routine built in, is included as well.</p><p>For those who did not want to type the whole program, it was also available separately on tape.</p>"},{"name":"Antics","year":1984,"developer":"Bug-Byte","url":":Antics","filesize":44145,"score":"","genres":"Action > Side view","desc":"<p>Boris the Bee (star of the first game) has been kidnapped by a gang of <em>ant</em>isocial Chavs, and his f<em>ant</em>astically-named cousin Barnabee must rescue him.</p><p>You control Barnabee as he travels through the underground ant complex, which has two different entry points from the four above-ground screens which are initially in view. In the main bulk of the game, the side view screens contain ants which must be <em>ant</em>icipated and avoided, as they reduce your strength. The action is rather fr<em>ant</em>ic at times. At the risk of being ped<em>ant</em>ic, you need to touch flowers to restore your energy through pollen.</p><p>The game arrangement is a maze, with many flowers which remove barriers elsewhere in the maze. Many individual screens are self-contained mazes, with barriers which are removed when you move or fly into them. In keeping with the maziness, many screens have more than 2 exits. Once you find Boris, you must guide him back to the surface at his speed (which, without being flipp<em>ant</em>, is slower than yours).</p>"},{"name":"Antiquity Jones","year":2012,"developer":""},{"name":"APB","year":1989,"developer":"Atari Games Corporation","url":":APB","filesize":53103,"score":6.7,"genres":"Action > Racing / Driving > Top-down > 2D scrolling > Arcade > Automobile > Contemporary > North America > Comedy > Crime","desc":"<p>You are police officer Bob, whose aim is to apprehend a certain quota of criminals (litterbugs, speeders and the like) each day. This is done by chasing them and sounding your siren at them - in some cases they will need ramming off the road.  There are also hardened criminals to catch - if you can get one of these to confess, your day's work is considered done.  Bonuses are awarded for achieving a 'perfect day' and for each arrest additional to the quota.  Each day has a time limit but this can be extended by collecting donuts.</p><p>The game's action is presented with an overhead view of your squad car. Car upgrades are available, to be brought from your reward money. You earn Demerits by crashing, wrongly arresting innocents, or failing to meet your quota. Too many demerits and it is game over.</p>"},{"name":"Apocalypse - Britain","year":1983,"developer":"Red Shift","url":":Apocalypse - Britain","filesize":15813,"score":"","genres":"Action > Top-down > Turn-based > Board game > Historical events > Licensed","desc":"<p><em>Apocalypse</em> is a turn-based strategy game, based on the board game from Games Workshop. Players have several territories on a map and must conquer land. The game has several phases: in the deployment phase players may build army divisions, navy warships and long-rage nuclear missiles on locations that they already occupy. In the movement phase, players can manoeuvre forces and engage in conventional combat. The nuke phase is the only opportunity to launch nukes. The game doesn't have CPU opponents and is multiplayer only. Up to 4 players are supported.</p>"},{"name":"Apocalypse - Carribean","year":1983,"developer":"Red Shift","url":":Apocalypse - Carribean","filesize":15777,"score":"","genres":"Action > Top-down > Turn-based > Board game > Historical events > Licensed","desc":"<p><em>Apocalypse</em> is a turn-based strategy game, based on the board game from Games Workshop. Players have several territories on a map and must conquer land. The game has several phases: in the deployment phase players may build army divisions, navy warships and long-rage nuclear missiles on locations that they already occupy. In the movement phase, players can manoeuvre forces and engage in conventional combat. The nuke phase is the only opportunity to launch nukes. The game doesn't have CPU opponents and is multiplayer only. Up to 4 players are supported.</p>"},{"name":"Apocalypse - Europe","year":1983,"developer":"Red Shift","url":":Apocalypse - Europe","filesize":16153,"score":"","genres":"Action > Top-down > Turn-based > Board game > Historical events > Licensed","desc":"<p><em>Apocalypse</em> is a turn-based strategy game, based on the board game from Games Workshop. Players have several territories on a map and must conquer land. The game has several phases: in the deployment phase players may build army divisions, navy warships and long-rage nuclear missiles on locations that they already occupy. In the movement phase, players can manoeuvre forces and engage in conventional combat. The nuke phase is the only opportunity to launch nukes. The game doesn't have CPU opponents and is multiplayer only. Up to 4 players are supported.</p>"},{"name":"Apocalypse - London","year":1983,"developer":"Red Shift","url":":Apocalypse - London","filesize":15444,"score":"","genres":"Action > Top-down > Turn-based > Board game > Historical events > Licensed","desc":"<p><em>Apocalypse</em> is a turn-based strategy game, based on the board game from Games Workshop. Players have several territories on a map and must conquer land. The game has several phases: in the deployment phase players may build army divisions, navy warships and long-rage nuclear missiles on locations that they already occupy. In the movement phase, players can manoeuvre forces and engage in conventional combat. The nuke phase is the only opportunity to launch nukes. The game doesn't have CPU opponents and is multiplayer only. Up to 4 players are supported.</p>"},{"name":"Apollo 11","year":1983,"developer":"Darkstar","url":":Apollo 11","filesize":15189,"score":"","genres":"Action > Side view > 2D scrolling > Space flight","desc":"<p><em>Apollo 11</em> is a variant of Lunar Lander where the player's task is to land the Lunar Exploration Module (LEM) on the moon. The game is side scrolling and when beginning the LEM is moving to the right over a mountainous terrain. To be able to land the player has to rotate it and use thrust to stop it from crashing into the ground. There are four instruments on the screen which indicate if landing is safe: vertical speed, horizontal speed, rotational speed and attitude. Next to each instrument is a light that can be either green or red. To land the module all the lights have to be green. It's also necessary to keep track of fuel as the module will crash if it runs out. When landing a score is given based on how much fuel is left and how small the landing site is.</p>"},{"name":"April 7th","year":1991,"developer":"Zenobi","url":":April 7th","filesize":30683,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Sci-fi / futuristic > Survival","desc":"<p><em>April 7th</em> is a text adventure game.</p><p>Well, it finally happened. The world as we know it has gone. Luckily the player of this game was a skilled programmer with the Northern District Civil Police and that got you a room in the Municipal Shelter. The Twelve Hour War came and went. Years passed and time weighed heavily on the survivors below ground so, on April 5th, you lock the door to your room and take a bottle of tranquilisers.</p><p>On April 7th you wake up and it's very, very quiet. Something's not right</p><p>This game supports the standard commands such as GET and DROP together with shortcuts such as N/S/E/W for North/South/East/West. It also supports Save/Load functions. The game was developed using <em>The Quill</em> authoring system.</p>"},{"name":"Aquaplane","year":1983,"developer":"Quicksilva Ltd.","url":":Aquaplane","filesize":7285,"score":"","genres":"Action > Sports > Side view > Sailing / boating","desc":"<p><em>Aquaplane</em> is a side-scrolling action game loosely based around water skiing. You control a motor boat, which must be steered around the hazards and accelerated as necessary. However, the real challenge is that the man behind it moves with it, but often in subtly different directions, meaning that smaller gaps can be quite treacherous to move through. On the first stage, the hazards are mere rocks, but you'll soon have to account for motorboats, yachts and sharks moving across your path.</p>"},{"name":"Aquarius","year":1983,"developer":"Bug-Byte","url":":Aquarius","filesize":6084,"score":"","genres":"Action > Side view > Shooter","desc":"<p>Your enemy has built destructive machines in underwater caverns. As you are skilled in underwater combat, it is your job to reach and destroy them, in this side-view scrolling shooter. You must battle past creatures such as jellyfish, sharks and squirts, by shooting them (sharks can only be shot in the head). Also watch out for the tangling seaweed, and mines the enemy has placed, and pick up oxygen tanks regularly. </p><p>The second level has a jagged Scramble-style cave to negotiate, but with otherwise identical gameplay. Unusually, you are given a colour code at the start of a level - you must give this at the end of a mission to be credited with completing it. This earns you an extra life.</p>"},{"name":"Arc of Yesod, The","year":1985,"developer":"Thor Computer","url":":Arc of Yesod, The","filesize":43633,"score":7.1,"genres":"Action > Side view > Platform > Sci-fi / futuristic","desc":"<p>In Nodes of Yesod, a monolith was discovered on the moon that transferred data vital to earth's security to an alien planet. After an attempt to destroy the monolith failed, it was transported to its creators the Ariatans. Now it is up to Charlie to travel to the planet Ariat and prevent the Ariatans from accessing the data.</p><p>Gameplay in Arc of Yesod is very similar to its predecessor. Seen from a side-scrolling perspective, Charlie has to explore many large caverns, filled with enemies and transporters, and find eight crystals that he hopes will help him destroy the monolith for good. To get rid of his enemies, he can once again control a device similar to the mole in Nodes of Yesod. Pressing up on the joystick releases a small sphere that can be moved across the screen (while Charlie stands still) and shoot at enemies. Once again, there are enemies that are immune to the sphere, including a spaceman who, when touched, takes away one of Charlie's crystals.</p>"},{"name":"Arcade Flight Simulator","year":1989,"developer":"Code Masters","url":":Arcade Flight Simulator","filesize":25694,"score":5.8,"genres":"Action > Top-down > Arcade > Shooter > Flight / aviation","desc":"<p>This arcade game allows you to know what it was like to fly different aircraft from different points in time. You can fly a bi-plane from WW1 over Germany, a WW2 plane over Pearl Harbour and a Fighter Plane in WW3. After dispatching all the enemy planes you must go back to your base to collect a bomb. Then you must go back into enemy territory to drop the bomb on enemy HQ. While fighting keep an eye on your fuel. To re-fuel you must fly low over a fuel dump.</p><p>The game is a birds eye view of the battle area. You can control your direction and altitude. You play the group captain who has to kill the enemy and destroy the bases. You have three lives to do this.</p>"},{"name":"Arcade Force Four","year":1988,"developer":""},{"name":"Arcade Fruit Machine","year":1990,"developer":"Zeppelin Games Limited"},{"name":"Arcade Muscle","year":1989,"developer":""},{"name":"Arcade Trivia Quiz Simulator - Part 1","year":1989,"developer":"Zeppelin Games","url":":Arcade Trivia Quiz Simulator - Part 1","filesize":28512,"score":6,"genres":"Puzzle > Fixed / flip-screen > Board game > Game show / trivia / quiz > Geography > Graphics / art > History > Music > Science","desc":"<p><em>Arcade Trivia Quiz</em> is a quiz game for 1, 2 or 3 players.</p><p>There are four blocks of questions. Each block contains questions in six categories;* Art &amp; Literature</p><ul><li>Science</li><li>Music</li><li>Film and Television</li><li>Sport</li><li>History &amp; Geography</li></ul><p>Icons representing these categories are displayed in a pyramid arrangement. The icons of available questions flash in sequence and the players must press FIRE at the correct time to select the icon of their choice. All questions are multiple choice with four answers, one correct &amp; three incorrect, being available.<br>Both question selection and answering are timed and must be completed in eight seconds.</p><p>Scoring is cash based. All players start with 1.00 and each player stakes 20p per attempt. If, by answering questions successfully, a player makes it to the top of the pyramid then they trigger a 'Cash Run' feature which can earn extra money - up to 5.00. </p><p>The game also has a random Jackpot feature in which a player can choose to either to bank the cash they have earned so far or double the money but risk losing it on an incorrect answer.</p>"},{"name":"Arcade Trivia Quiz Simulator - Part 2","year":1989,"developer":"Zeppelin Games","url":":Arcade Trivia Quiz Simulator - Part 2","filesize":28559,"score":6,"genres":"Puzzle > Fixed / flip-screen > Board game > Game show / trivia / quiz > Geography > Graphics / art > History > Music > Science","desc":"<p><em>Arcade Trivia Quiz</em> is a quiz game for 1, 2 or 3 players.</p><p>There are four blocks of questions. Each block contains questions in six categories;* Art &amp; Literature</p><ul><li>Science</li><li>Music</li><li>Film and Television</li><li>Sport</li><li>History &amp; Geography</li></ul><p>Icons representing these categories are displayed in a pyramid arrangement. The icons of available questions flash in sequence and the players must press FIRE at the correct time to select the icon of their choice. All questions are multiple choice with four answers, one correct &amp; three incorrect, being available.<br>Both question selection and answering are timed and must be completed in eight seconds.</p><p>Scoring is cash based. All players start with 1.00 and each player stakes 20p per attempt. If, by answering questions successfully, a player makes it to the top of the pyramid then they trigger a 'Cash Run' feature which can earn extra money - up to 5.00. </p><p>The game also has a random Jackpot feature in which a player can choose to either to bank the cash they have earned so far or double the money but risk losing it on an incorrect answer.</p>"},{"name":"Arcade Trivia Quiz Simulator - Part 3","year":1989,"developer":"Zeppelin Games","url":":Arcade Trivia Quiz Simulator - Part 3","filesize":28517,"score":6,"genres":"Puzzle > Fixed / flip-screen > Board game > Game show / trivia / quiz > Geography > Graphics / art > History > Music > Science","desc":"<p><em>Arcade Trivia Quiz</em> is a quiz game for 1, 2 or 3 players.</p><p>There are four blocks of questions. Each block contains questions in six categories;* Art &amp; Literature</p><ul><li>Science</li><li>Music</li><li>Film and Television</li><li>Sport</li><li>History &amp; Geography</li></ul><p>Icons representing these categories are displayed in a pyramid arrangement. The icons of available questions flash in sequence and the players must press FIRE at the correct time to select the icon of their choice. All questions are multiple choice with four answers, one correct &amp; three incorrect, being available.<br>Both question selection and answering are timed and must be completed in eight seconds.</p><p>Scoring is cash based. All players start with 1.00 and each player stakes 20p per attempt. If, by answering questions successfully, a player makes it to the top of the pyramid then they trigger a 'Cash Run' feature which can earn extra money - up to 5.00. </p><p>The game also has a random Jackpot feature in which a player can choose to either to bank the cash they have earned so far or double the money but risk losing it on an incorrect answer.</p>"},{"name":"Arcade Trivia Quiz Simulator - Part 4","year":1989,"developer":"Zeppelin Games","url":":Arcade Trivia Quiz Simulator - Part 4","filesize":28709,"score":6,"genres":"Puzzle > Fixed / flip-screen > Board game > Game show / trivia / quiz > Geography > Graphics / art > History > Music > Science","desc":"<p><em>Arcade Trivia Quiz</em> is a quiz game for 1, 2 or 3 players.</p><p>There are four blocks of questions. Each block contains questions in six categories;* Art &amp; Literature</p><ul><li>Science</li><li>Music</li><li>Film and Television</li><li>Sport</li><li>History &amp; Geography</li></ul><p>Icons representing these categories are displayed in a pyramid arrangement. The icons of available questions flash in sequence and the players must press FIRE at the correct time to select the icon of their choice. All questions are multiple choice with four answers, one correct &amp; three incorrect, being available.<br>Both question selection and answering are timed and must be completed in eight seconds.</p><p>Scoring is cash based. All players start with 1.00 and each player stakes 20p per attempt. If, by answering questions successfully, a player makes it to the top of the pyramid then they trigger a 'Cash Run' feature which can earn extra money - up to 5.00. </p><p>The game also has a random Jackpot feature in which a player can choose to either to bank the cash they have earned so far or double the money but risk losing it on an incorrect answer.</p>"},{"name":"Arcadia","year":1982,"developer":"Imagine Software Ltd.","url":":Arcadia","filesize":8692,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Arcadia</em> is a space shoot 'em up along the lines of Galaxians and Space Invaders. You have a ship at the bottom of the screen. Enemy ships come at you in waves scrolling across the screen from right to left.There are twelve levels. When the last level has been completed the game cycles to level one again and continues with no increase in difficulty.You get an extra life if you clear 4 waves. They keep on coming and the object is to get a high score.</p><p>Interesting key mapping on this game: the bottom row of keys moves left &amp; right, but they are mapped alternately so Z, C, B, M and SPACE move you right while CAP SHIFT, X, V, N, and SYMBOL SHIFT move you left. The middle row of keys (A, S, D, etc) power the thrusters while the top row (Q, W, E, etc) fire the dual lasers.</p>"},{"name":"Archeomania","year":2014,"developer":""},{"name":"Archers, The - Part 1","year":1987,"developer":"Level 9 Computing Ltd.","url":":Archers, The - Part 1","filesize":36735,"score":6.9,"genres":"Adventure > 1st-person > Interactive fiction / text adventure > Text parser > Licensed","desc":"<p>Events in the rural village of Ambridge have enthralled BBC Radio 4 listeners since 1950. The computer game re-creation casts you as one of the scriptwriters. The game is split into four parts, in which you control Jack Woolley, Elizabeth Archer, Eddie Grundy and Nelson Gabriel in turn. Guide each character through their decisions (from 3 multiple-choices), with the aim of choosing the most listener-friendly choices. Your choices affect the show's rating directly, as well as changing the forthcoming plot much more than in The Secret Diary of Adrian Mole Aged 13. </p><p>Characters can be removed from the show depending on how you develop certain storylines, but make sure not to axe the popular ones. Avoid offending special-interest groups, as the BBC comes down hard on writers who generate complaints.</p><p>In some versions you can play the four parts individually; in others, progressing onto controlling a character is conditional on increasing the ratings while controlling the previous one.</p>"},{"name":"Archers, The - Part 2","year":1987,"developer":"Level 9 Computing Ltd.","url":":Archers, The - Part 2","filesize":36341,"score":6.9,"genres":"Adventure > 1st-person > Interactive fiction / text adventure > Text parser > Licensed","desc":"<p>Events in the rural village of Ambridge have enthralled BBC Radio 4 listeners since 1950. The computer game re-creation casts you as one of the scriptwriters. The game is split into four parts, in which you control Jack Woolley, Elizabeth Archer, Eddie Grundy and Nelson Gabriel in turn. Guide each character through their decisions (from 3 multiple-choices), with the aim of choosing the most listener-friendly choices. Your choices affect the show's rating directly, as well as changing the forthcoming plot much more than in The Secret Diary of Adrian Mole Aged 13. </p><p>Characters can be removed from the show depending on how you develop certain storylines, but make sure not to axe the popular ones. Avoid offending special-interest groups, as the BBC comes down hard on writers who generate complaints.</p><p>In some versions you can play the four parts individually; in others, progressing onto controlling a character is conditional on increasing the ratings while controlling the previous one.</p>"},{"name":"Archers, The - Part 3","year":1987,"developer":"Level 9 Computing Ltd.","url":":Archers, The - Part 3","filesize":36946,"score":6.9,"genres":"Adventure > 1st-person > Interactive fiction / text adventure > Text parser > Licensed","desc":"<p>Events in the rural village of Ambridge have enthralled BBC Radio 4 listeners since 1950. The computer game re-creation casts you as one of the scriptwriters. The game is split into four parts, in which you control Jack Woolley, Elizabeth Archer, Eddie Grundy and Nelson Gabriel in turn. Guide each character through their decisions (from 3 multiple-choices), with the aim of choosing the most listener-friendly choices. Your choices affect the show's rating directly, as well as changing the forthcoming plot much more than in The Secret Diary of Adrian Mole Aged 13. </p><p>Characters can be removed from the show depending on how you develop certain storylines, but make sure not to axe the popular ones. Avoid offending special-interest groups, as the BBC comes down hard on writers who generate complaints.</p><p>In some versions you can play the four parts individually; in others, progressing onto controlling a character is conditional on increasing the ratings while controlling the previous one.</p>"},{"name":"Archon","year":1989,"developer":"Electronic Arts","url":":Archon","filesize":24593,"score":"","genres":"Compilation","desc":"<p><em>The Archon Collection</em> contains the following games: </p><ul><li>Archon: The Light and the Dark</li><li>Archon II: Adept</li></ul>"},{"name":"Archon II: Adept","year":1989,"developer":"Electronic Arts","url":":Archon II - Adept","filesize":23633,"score":7.9,"genres":"Action > Strategy > Top-down > Board game > Fighting > Fantasy","desc":"<p>The sequel to Archon, <em>Archon II: Adept</em> features a more complex board and enhanced gameplay.</p><p>Each side plays as an Adept - a powerful wizard with the ability to cast spells against other Adepts and his summonings - and must defeat the other side, either Chaos or Order, by attacking him/her with summoned Elementals or Demons. Each side can summon 4 unique elementals at a time or choose from 4 demons, common to both.</p><p>Gameplay is similar to the original, reminiscent of a chess-like board game, requiring strategy, but with arcade elements, especially when two adepts confront each other face-to-face. The board also shifts from time to time, making the strategy less predictable.</p>"},{"name":"Archon: The Light and the Dark","year":1985,"developer":"Free Fall Associates"},{"name":"Arctic Fox","year":1988,"developer":"Dynamix Inc.","url":":Arctic Fox","filesize":34604,"score":6.7,"genres":"Action > Simulation > 1st-person > Tank > Sci-fi / futuristic","desc":"<p>In 2005, aliens have taken over Antarctica. You are sent in to combat them with the new super tank, the Slye-Hicks MX-100, Codename: Arcticfox. </p><p><em>Arcticfox</em> is a futuristic-based 3D tank simulation game where your overall goal is to destroy the invading aliens' main fortress before Arcticfox is destroyed.</p><p>Enemy targets come in all sorts of shapes and sizes: planes, tanks, recon sleds and other important targets such as communication towers, atmosphere converters, etc. Your state-of-the-art killing machine is equipped with a cannon, guided missiles and mines at your disposal in addition to radar and forward/aft view-screens to detect your enemy advances.</p>"},{"name":"Ardok the Barbarian","year":1986,"developer":"Beam Software Pty. Ltd."},{"name":"Arena","year":1985,"developer":"MC Lothlorien","url":":Arena","filesize":22927,"score":"","genres":"Strategy > Top-down > Free-roaming camera > Real-time > Real-time strategy > Menu structures > Tank > Sci-fi / futuristic > War","desc":"<p>In the near future, conflicts are resolved in medieval combat using four distinct types of tanks, and you're aiming to take over England via it. The player must use Challenge mode to recognise your tanks from the opposition's, and then take on full Arena mode. A winning commander must  strategically using their speed, damage endurance, and river-crossing and stealth abilities. An icon based system lets you place mines, check the radar, set routes and make individual moves, Each side has a command tank, the loss of which decided the game, while running out of the 1000-second time limit also causes you to lose.</p>"},{"name":"Arena 3000","year":1984,"developer":"Microdeal","url":":Arena 3000","filesize":8040,"score":"","genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>Fight for your life (and highscore) against endless waves of killer robots cornering you in the futuristic Galactic Arena of the year 3000. When you clear the level, the next wave gets faster and tougher, luckily you get 3 lives and an extra one every 20 000 points. This top-down shooter offers optional dual joystick control (movement/shooting).</p>"},{"name":"Arkanoid","year":1987,"developer":"Taito Corporation","url":":Arkanoid","filesize":22339,"score":7.7,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Paddle / Pong > Sci-fi / futuristic","desc":"<p>The original Breakout concept involves controlling a bat at the bottom of the screen and using it to catch and direct a ball so as to hit all the bricks which are arranged at the top of the screen. It was unpopular for over a decade, before Taito revived it with some new ideas in this arcade game.</p><p>The game's plot redefines the bat as a Vaus spaceship, the ball as an energy bolt, and the bricks form a mysterious wall stopping the ship from progressing to safety.</p><p>By the mid-80s, power-ups were popular in most types of arcade games, and <em>Arkanoid</em> features them. They are caught by positioning the bat below them as they fall (meaning that you risk missing the ball if you go for them at the wrong time). The power-ups include lasers (which are mounted to each side of the ship and allow you to shoot out the blocks), a catching device (so as to be able to fire the ball off at a different angle every time you hit it) and one that slows the bolt down.</p>"},{"name":"Arkanoid: Revenge of DOH","year":1988,"developer":"Taito Corporation","url":":Arkanoid - Revenge of Doh","filesize":25672,"score":7.6,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Paddle / Pong","desc":"<p>Revenge of Doh is a direct sequel to the original arcade smash Arkanoid. Along with improved graphic engine, better sound and music, better hardware support and more levels, Revenge of Doh also features a built-in editor and allows you to create your own level sets!</p><p>Revenge of Doh continues Arkanoid's plot as follows, directly taken (including typoes) from the game:</p><blockquote><p>A long time period passed and the dimension controlling force Doh has again come back to life. Occupying the huge starship Xorg, it has entered our universe from a different dimension. Mixtec, Arkanoid type spaceship, has lauched the craft Vaus II to make a preemptive attack on Xorg.</p></blockquote>"},{"name":"Armageddon","year":1983,"developer":"Ocean","url":":Armageddon","filesize":4667,"score":"","genres":"Action > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Armageddon</em> is based on the arcade game Missile Command where you are the commander of a Missile Battery and you have to protect six cities in this single screen shooter. Nuclear tracers fall from the top of the screen leaving behind a trail and as you move a cross-hair around the screen, you must fire a limited supply of missiles and allow them to explode in front of each trail to destroy them. If a nuclear tracer hits a city then it is destroyed and if all cities are destroyed then it is game over. A plane occasionally flies over the screen from left to right and you get bonus points for destroying it. Once a wave is over then bonus points are awarded for any cities and missiles left before being re-armed and you then protect the remaining cities from another attack. On the C64, you can choose the wind speed (0-9) before the game starts, with zero being no wind.</p>"},{"name":"Army Moves - Part 1","year":1986,"developer":"Dinamic Software","url":":Army Moves - Part 1","filesize":20888,"score":6.5,"genres":"Action > Side view > 2D scrolling > Fixed / flip-screen > Arcade > Shooter > Helicopter","desc":"<p><i>Army Moves</i> is a one-player arcade game divided into two parts. In part one, the player controls a jeep and must cross a bridge, avoiding enemy jeeps and helicopters. A second section involves an helicopter and the goal is to cross enemy airspace without being shot at by airplanes or any other ground fire. The player must then land on the pad near the end.</p><p>In part two, our hero starts out in the jungle and must reach the enemy base without being blown to bits. Then he needs to locate the general's offices and steal the secret documents detailing a new neutron bomb. </p><p>In all versions of the game part two is loaded separately and a password obtained after completing part one is needed to access it.<br><br>The access code for part 2 is 27351.</p>"},{"name":"Army Moves - Part 2","year":1986,"developer":"Dinamic Software","url":":Army Moves - Part 2","filesize":36072,"score":6.5,"genres":"Action > Side view > 2D scrolling > Fixed / flip-screen > Arcade > Shooter > Helicopter","desc":"<p><i>Army Moves</i> is a one-player arcade game divided into two parts. In part one, the player controls a jeep and must cross a bridge, avoiding enemy jeeps and helicopters. A second section involves an helicopter and the goal is to cross enemy airspace without being shot at by airplanes or any other ground fire. The player must then land on the pad near the end.</p><p>In part two, our hero starts out in the jungle and must reach the enemy base without being blown to bits. Then he needs to locate the general's offices and steal the secret documents detailing a new neutron bomb. </p><p>In all versions of the game part two is loaded separately and a password obtained after completing part one is needed to access it.<br><br>The access code for part 2 is 27351.</p>"},{"name":"Arnhem: The 'Market Garden' Operation","year":1985,"developer":"CCS","url":":Arnhem - The 'Market Garden' Operation","filesize":22285,"score":6.2,"genres":"Strategy > Top-down > Turn-based > Historical events > World War II","desc":"<p><em>Arnhem</em> is a first entry in R. T. Smith's World War II trilogy, including Desert Rats and Vulcan. It simulates the assault operation initiated by Allied forces in September 1944 to take over the bridge of Arnhem, the Netherlands. There are British, Irish, Welsh, Polish, and American units of Allied forces against German forces and 5 scenarios, including advance to Eindhoven, operation 'Garden', operation 'Market', the bridge too far, and entire campaign from start to finish.</p><p>The gameplay is shown on scrolling map in turns. The player of Allied forces places airborne units all over the map on clear places and waits while they are landing. After that the player selects the units and gives them orders to travel, dig in, or change size. Units move on the grid of rectangular cells. The bombard attack is possible for certain units. Axis forces defend from the attacks. Historically, Axis won this battle, and it is player's opportunity to alter the history.</p><p>The game comes with detailed instruction booklet and includes historical notes on the campaign, maps and photographs. Two players representing Allied and Axis may be computer or human.</p>"},{"name":"Arnold the Adventurer","year":1990,"developer":"Delbert The Hamster Software","url":":Arnold the Adventurer","filesize":23732,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Text parser > Fantasy","desc":"<p>Arnold is a well known Super Hero and all round good guy, and he has vowed to help his friend Winthorpe the Wizard after reading a message from him. The fabled Crystal of Conrad belonging to Winthorpe has been stolen by the evil Schwartze, and is going to be used to dispose of the Wizard. While Winthorpe stays in hiding, Arnold must go to Schwartze Mansion and find the Crystal. <em>Arnold the Adventurer</em> is a text adventure with text on the screen describing your location and you type in commands with the keyboard to interact with your surroundings.</p>"},{"name":"Arnold the Adventurer II - The Prat With the Cape Is Back!","year":1991,"developer":"Delbert The Hamster Software","url":":Arnold the Adventurer II - The Prat With the Cape Is Back!","filesize":27137,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Fantasy","desc":"<p><em>Arnold the Adventurer II</em> is the second in a series of three fantasy text adventures.</p><p>In his first appearance Arnold recovered The Crystal Of Conrad which had been stolen from his friend, the wizard Winthorpe, by the evil wizard Schwartze.<br>Many months have passed since that adventure, the excitement and general gratitude has died down and Arnold has changed from hero back into plain old Arnold Tanglewood.<br>However good times don't last forever. The skies over Hamsterdam darkened, and the land fell prey to an ever present sense of evil. What was happening? Winthorpe thought he knew but he suddenly disappeared. It was time for Arnold to leap into action.</p>"},{"name":"Arnold the Adventurer III - This Time It's Personal","year":1992,"developer":"Delbert The Hamster Software","url":":Arnold the Adventurer III - This Time It's Personal","filesize":27369,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Fantasy","desc":"<p><em>Arnold The Adventurer III</em> is a humorous fantasy text adventure.</p><p>In his first appearance Arnold recovered The Crystal Of Conrad which had been stolen from his friend, the wizard Winthorpe, by the evil wizard Schwatrze.<br>In his second appearance Arnold once again faced the evil wizard Schwartze. It will therefore come as no surprise that the villain is using this game to make a comeback.</p><p>The game starts with Arnold visiting his friend the wizard Winthorpe. What he finds is deeply disturbing, Winthorpe is ill. In fact he is very, very ill and is covered with big red blotches. In a whisper Winthorpe tells Arnold that the only thing that can save him is 'the Goblet Of Goodness' which can be found in the land of The Flower People'.</p><p>This game was developed using <em>Professional Adventure Writer</em>. It supports the standard shortcuts such as N/S/E/W for North/South/East/West. The commands INFO and VOCAB do not work in this game but the HELP command can be used to provide in-game assistance with the game's vocabulary</p>"},{"name":"Arrow of Death Part II","year":1983,"developer":"Digital Fantasia Ltd."},{"name":"Arrow of Death: Part I","year":1983,"developer":""},{"name":"Artura","year":1989,"developer":"Gremlin Graphics","url":":Artura","filesize":24665,"score":5.1,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p><em>Artura</em> is a side-scrolling platform game. The game semi-utilizes the mythology of King Arthur in that you play as Artura, son of the Pendragon. Your goal is rescue Nimue, apprentice to Merdyn, from your evil half-sister Morgause. </p><p>You will battle numerous horrible creatures such as spiders and bats with your axe and avoid deadly traps while attempting to gain access to Morgause's castle. You will also search for 6 runes, which contain spells, that you must find in order to free Nimue. Artura contains 4 maze-like levels that are so complicated that poster sized map of the levels is included with the game.</p>"},{"name":"Arytmetyka","year":1987,"developer":""},{"name":"Ashes, The","year":1984,"developer":"CCS","url":":Ashes, The","filesize":15332,"score":"","genres":"Sports > Strategy > Top-down > Fixed / flip-screen > Cricket","desc":"<p><em>Ashes</em> is a two-player recreation of cricket matches between England and Australia - the introductory test explains the origin of the name. Player names are real for the time, but can be edited. There are ten different venues, five in each country, each of which have different pitches affecting the bowling - weather delays during the match can affect the pitch's behaviour. The bowling team has twenty different fielding positions to select from for their nine movable players (excluding the bowler and wicket-keeper). There are twenty types of bowling delivery to choose from, based on the desired line and length - the batting team must react to these by choosing from nine stroke types, and timing their press accurately.</p>"},{"name":"Ashkeron!","year":1985,"developer":"Textgate Computers Ltd.","url":":Ashkeron!","filesize":29583,"score":"","genres":"Adventure > Interactive fiction / text adventure","desc":"<p><em>Ashkeron!</em> is a graphic adventure where your goal is to recover the five treasures that were stolen by an evil wizard before the local princess is crowned. The quest has to be completed within a time limit. </p><p>The presentation is mixed in nature, offering text passages accompanied by graphical representations on the top half of the screen. The scenes represent encounter locations as they happen, with no interaction. The parser is simple, and you can input commands to explore and investigate your surroundings while encounters with NPCs are basically dialog sequences, providing hints on your quest.</p><p>All in all, a straight forward graphic adventure with a very specific goal and linear progress.</p>"},{"name":"Assault Course: Combat Academy","year":1990,"developer":"Players Premier","url":":Assault Course - Combat Academy","filesize":23416,"score":"","genres":"Action > Side view > 2D scrolling > Arcade","desc":"<p><em>Assault Course: Combat Academy</em> allows you to try to complete various assault courses within a time of 2 minutes for each course. The game is viewed from the side and the screen scrolls from the left to the right when you move your man. To move your man you must waggle the joystick and let go and press the fire button at the right time for each obstacle, if you fail an obstacle then you must attempt it again wasting valuable seconds. There are six obstacles to be attempted and they vary in number on each course with the obstacles being a high wall to climb over, water jump, rope bridge which you hang from over water, barb wire which you have to crawl underneath, a rope swing over water, and a log which has to be crossed slowly. Once you complete a course within the time then you move to the next one but fail the course and you lose one of three lives.</p>"},{"name":"Asteroides","year":1983,"developer":"Eyrolles","url":":Asteroides (Fr)","filesize":5158,"score":"","genres":"Action > Top-down > Fixed / flip-screen > Space flight > Sci-fi / futuristic","desc":"<p><em>Astrodes</em> is a single screen action game where the player has to move a space craft (which looks very much like a TIE Fighter) from the left edge of the screen to an exit on the right. Asteroids are bouncing around the screen and these have to be avoided since any contact with them will lead to a lost life. A life is also lost when moving into any of the walls. At first there is only one asteroid but more appear as progress is made through the game. There are five difficulty levels. The second one adds a moving exit and the third one adds obstacles that have to be avoided just like the walls. On the fourth level the obstacles are moving up and down.</p>"},{"name":"Astonishing Adventures of Mr. Weems and the She Vampires, The","year":1987,"developer":"The RamJam Corporation","url":":Astonishing Adventures of Mr. Weems and the She Vampires, The","filesize":20513,"score":"","genres":"Action > Top-down > Shooter > Horror","desc":"<p>In this top-view shooter with similarities to Gauntlet, <em>Mr. Weems</em> has set out to kill the <em>She Vampires</em> in their mansion, which is split into six levels. These include many locked doors for which keys must be found, plus teleporters and secret paths.</p><p>Weems' main foes are bats and monsters, strategically placed inside coffins, and regenerating when you re-enter a room. Contact with these drains his blood, although fortunately there are replacement vials of this to be found. He is armed with a garlic-firing gun, plus limited numbers of garlic pills, which make enemies avoid him. </p><p>The first five levels feature the objects required to kill the She Vampires  a crucifix, large garlic piece, stake, mirror and mallet. Once they are killed, he must make his escape, facing all those bats and monsters again.</p>"},{"name":"Astro Blaster","year":1983,"developer":"Quicksilva","url":":Astro Blaster","filesize":4759,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Astro Blaster</em> is an unofficial adaptation of the arcade Astro Blaster, a traditional spacial shoot-em-up game which combines some elements of arcade classics such as <em>Galaxians</em> and <em>Asteroids</em>, also including the concept of a final \"boss\" as the passage for the next level. The player manoeuvres an armoured spaceship on a left/right axis while floating on deep space. The arsenal of the spaceship is capable of completely destroying an enemy with a single shot. Each stage is constituted by 2 sets of 5 different enemy armadas, a meteor storm and the final boss: a heavy armoured giant Asteroidal spaceship. Also in the traditional arcade line, after you succeed completing the 5 armadas, the process repeats itself turning the game-play increasingly more difficult after each stage is complete.</p>"},{"name":"Astro Marine Corps - Part 1","year":1989,"developer":"Creepsoft","url":":Astro Marine Corps - Part 1","filesize":36714,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic","desc":"<p><em>A.M.C.: Astro Marine Corps</em> is a sideways scrolling shooter in which you control a member of the Astro Marine Corps who has to blast his way through the various alien infested levels.</p><p>You have three lives and each life has an energy bar which is depleted by contact with aliens and can be replenished by picking up the 'E' powerup. Other powerups include three way fire and an overhead shield. There are various instant death hazards you must avoid such as a plant which smothers you and a dragon which devours you and spits out your bones.</p>"},{"name":"Astro Marine Corps - Part 2","year":1989,"developer":"Creepsoft","url":":Astro Marine Corps - Part 2","filesize":37073,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic","desc":"<p><em>A.M.C.: Astro Marine Corps</em> is a sideways scrolling shooter in which you control a member of the Astro Marine Corps who has to blast his way through the various alien infested levels.</p><p>You have three lives and each life has an energy bar which is depleted by contact with aliens and can be replenished by picking up the 'E' powerup. Other powerups include three way fire and an overhead shield. There are various instant death hazards you must avoid such as a plant which smothers you and a dragon which devours you and spits out your bones.</p>"},{"name":"Astroclone","year":1985,"developer":"Graftgold Ltd.","url":":Astroclone","filesize":27962,"score":"","genres":"Action > Strategy > Side view > Shooter > Sci-fi / futuristic","desc":"<p>To finally get rid of the vicious Seiddab, a crack pilot has been cloned 15 times, to produce an army of warriors each with their own spacecraft. In this multi-section game you must plan, co-ordinate and fulfil this attack.</p><p>You start off aboard a ship, in the home sector of Sol, and must go to the navigation computer to choose a sector to enter - the number of Seiddab it contains is indicated. Once there, the action is a side-scrolling shoot 'em up on a looping Defender-style playfield, with rocks to avoid as well as the Seiddab. Leaving via the portal you used to enter takes you back to the navigational screen.</p><p>However, many sectors also contain Seiddab bases (which look like pylons). Enter one of these and another game section begins, this time an arcade adventure set within the base. Each star-base has its own way to be destroyed using the objects you'll find and manipulate, and you'll have to work this out as well as shooting any Seiddab you do find.</p>"},{"name":"ATF: Advanced Tactical Fighter","year":1988,"developer":"Digital Integration","url":":ATF - Advanced Tactical Fighter","filesize":29394,"score":6.8,"genres":"Action > Behind view > Arcade > Flight / aviation","desc":"<p><em>ATF: Advanced Tactical Fighter</em> is an action-oriented flight game. The game is set during a war of two unnamed war parties over an unnamed island. The player mans an Lockheed ATF fighter bomber to win the battle.</p><p>The goal of every round is to destroy a number of strategic targets. The positions are shown on the jet's on board computer and the player can tackle them in any order. The game is action-oriented in nature, but the player still needs to take care of a few parameters, like a constant speed to avoid crashing or limited fuel and ammo. When resources or health are low (and the jet is near a friendly base), the player can start an automatic landing sequence to refill and repair. On the way to the targets it is either possible to take on enemy jets in direct combat or to fly low to avoid detection. The camera is fixed behind the jet's back.</p>"},{"name":"Athena","year":1987,"developer":"SNK Corporation","url":":Athena","filesize":59728,"score":4.6,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p>In this game, players take the role of Athena, the Goddess of Wisdom, who has grown tired of her life within the castle and ventures into the Fantasy World beyond the castle walls. Strange and fearsome creatures will attack at every turn, but weapons can be found along the way: a ball and chain, a bow and arrow, and a mighty sword.  Put on wings and take to the sky, or become a mermaid to explore the ocean depths.</p>"},{"name":"Atic Atac","year":1983,"developer":"Ultimate Play The Game","url":":Atic Atac","filesize":24186,"score":7.7,"genres":"Action > Diagonal-down > Fixed / flip-screen > Puzzle elements > Direct control > Fantasy","desc":"<p>As the game begins, the player character falls through a trapdoor and ends up inside an evil castle with only one way to get out of it - find all the pieces of the great ACG key that unlocks the main door.</p><p><em>Atic Atac</em> is an action game with adventure elements, mixing arcade gameplay with exploration of a large castle and light puzzle-solving. The player can choose to control either a Wizard, a Knight, or a Serf. Each character has access to a different secret passage, which means that the player will be navigating different rooms depending on the choice of character. Characters also possess unique skills: for example, the Serf can gain momentum when running, allowing him to traverse greater distances in less time. </p><p>Enemies appear in each room and would randomly attack the protagonist. The player can choose to collide with them, which destroys the enemies but also drains health from the main character. Some enemies cannot be killed by conventional means and must be either avoided or dealt with by using special items. Poisonous mushrooms will also damage the hero, and bosses will drain his health as long as he maintains close contact. </p><p>The player character's life meter gets gradually depleted. Health can be restored by consuming food scattered around the castle, but the countdown cannot be stopped. In addition, doors would sometimes close, trapping the hero in a room. Keys must be collected to open many of the castle's doors.</p>"},{"name":"Atlantis","year":1985,"developer":""},{"name":"Atom Ant","year":1990,"developer":"Twilight","url":":Atom Ant","filesize":19863,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>This is based on the Hanna-Barbera cartoon and was one of a number of Hanna-Barbera licensed games released by Hi-Tec Software.</p><p>Players take control of Atom Ant who must save the city from destruction.  The mayor of the city has received a ransom from Mad Dog Jackson and he has threatened to blow up the city if the ransom isnt paid.  He has set up numerous bombs over some the citys buildings and you must fly around the building to collect the bombs and de-fuse them with the atomiser, which is located at the top of the building.  You can only collect one bomb at a time, so once you have de-fused a bomb you can collect another.  </p><p>Each building has eight bombs planted and you have four minutes to clear each building.  The buildings also have a set of enemies, such as wasps and helicopters, that need avoided.  Contact with these enemies costs you one life and loss of all your lives ends your game.  Failure to de-fuse all the bombs in the level within the time limit ends the game regardless of how many lives you have left.  Certain bonuses to increase time and earn an extra life can also be collected.</p>"},{"name":"Attack of the Empire","year":1985,"developer":"Chibur","url":":Attack of the Empire","filesize":14196,"score":"","genres":"Action > Side view > Shooter > Sci-fi / futuristic","desc":"<p>Attack of the Empire is 2D side-scrolling shoot'em up game, clone of Star Wars: The Empire Strikes Back from Atari 2600, (with control similar to Defender) but without a Star Wars licence. Story is loosely based on <em>Empire Strikes Back</em> - The rebels planet is under attack from evil empire.The player is pilot of space fighter (\"the rebel's last hope\"), he must destroy several 4-legged walking machines (\"At-At\" counterparts), avoid their shots and missiles, and rescue rebel soldiers - for this, he lifts them and carries to base for points.</p>"},{"name":"Attack of the Killer Tomatoes","year":1986,"developer":"Global Software","url":":Attack of the Killer Tomatoes","filesize":18631,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Isometric > Arcade > Platform > Puzzle elements > Licensed","desc":"<p>You are a factory worker and start your shift at the PuraTom processing plant and you find that all tomatoes have mutated. You have to stop the mutated killer tomatoes by put them into holes. The smaller bouncing tomatoes must be crushed. This must all be done before your shift is over! This means wandering to various rooms to locate the tomatoes and to find various objects you can use to kill them.There are some punch cards around, those cards will buy you some extra time. The cards must be inserted in the cube objects in the factory plant.</p>"},{"name":"Attack of the Mutant Camels","year":1984,"developer":"Llamasoft Ltd."},{"name":"ATV Simulator","year":1987,"developer":"Code Masters","url":":ATV Simulator","filesize":25546,"score":6,"genres":"Racing / Driving > Side view > 2D scrolling > Arcade > Off-roading","desc":"<p>Viewed side on, and with a split screen 2-player option, this game simulated the then-new All Terrain Vehicles in an action-based way. The game features a succession of courses, which must be navigated in 30 seconds. You must run to the vehicle initially, and will also have to manually remount if you fall off - all costing you more precious time. Careful use of the wheelies and jumps is crucial to completion. Each hazard must be taken at the right speed, which you'll learn through experience.</p>"},{"name":"Auf Wiedersehen Monty","year":1987,"developer":"Gremlin Graphics Software Limited","url":":Auf Wiedersehen Monty","filesize":48469,"score":6.7,"genres":"Action > Side view > Fixed / flip-screen > Platform > Puzzle elements","desc":"<p>In Monty On the Run the intrepid coal thief Monty Mole fled to the rocky island of Gibraltar. However, the Intermole agency is on to him, and his only hope of escape is to trek across Europe, collecting enough cash to buy the Greek island of Montos and live there in luxury.</p><p>This is Monty's third game (fourth if you count Monty is Innocent), and the structure is similar to the previous three. It's platform and ladders based, with 80 screens each representing some area of Europe - the Eiffel Tower and the Leaning Tower of Pisa are among the identifiable landmarks. </p><p>There are different ways of travelling through the levels - some bouncy platforms coupled with a new super-leap move allow for big progress to be made, while Monty can also suspend from the ceilings and dodge his way across. Monty can now fall without being hurt, although landing on water can cause multiple lives to be lost in quick succession. Collecting wine bottles makes Monty drunk and he will stumble around randomly until he recovers by becoming sober again.</p><p>There are many items to collect - the most important are Eurocheques for money and airplane tickets. Once on a plane you must fight off the encroaching Intermole planes for extra points.</p>"},{"name":"Auf Wiedersehen Pet","year":1984,"developer":"Tynesoft","url":":Auf Wiedersehen Pet","filesize":12739,"score":"","genres":"Action > Licensed","desc":"<p><em>Auf Wiedersehen Pet</em> was a British TV series that ran from 1983 to 2004 over five series which showed the exploits of a group of English builders over various locations around the world. The game is based on the first series which first introduced us to the gang on a building site in Dsseldorf, West Germany and concentrates on one of the main characters, Leonard \"Oz\" Osborne. Oz was a bricklayer who didn't like foreigners, liked a drink and was always getting into a fight and we follow him through one day over three single screen games. The idea is to play each game to get a high score and if you complete or even fail each game, you then move to the next one.</p><p><strong>The Building Site:</strong> You have been told by your boss, Herr Fuhrer to build a wall as high and wide as you can. You watch Oz move along laying bricks and you can build upwards or you can move in the opposite direction but you can't lay bricks if there are no bricks underneath. Scattered around the screen are 'Erics' and these must be avoided as well as falling trowels. If you fall off the edge of the screen, touch an Eric or trowel, or lay a brick without one underneath then the game ends.</p><p><strong>The Bier Keller:</strong> After a hard days bricklaying, Oz likes to go to the local bar and drink himself stupid and you must control Oz who moves constantly and collect all the beer glasses on the screen. As you move around the screen, barmaids appear and you must avoid them, tables or the walls, or the game is ended.</p><p><strong>The Way Home:</strong> The bar has been shut at 11:30pm and you must now make your way home to your hut and your bed. Problem is that there are plenty of police cars in the area as well as security guards and these have to be avoided. After seeing your route home, there are more problems as most of the lamp posts have switched off leaving most of the walk home in complete darkness. You must memorise the route and move up the screen but if you touch an object then the game is ended.</p>"},{"name":"Aunt Velma Is Coming to Tea","year":1991,"developer":"Zenobi","url":":Aunt Velma Is Coming to Tea","filesize":17380,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Text parser","desc":"<p><em>Aunt Velma Is Coming to Tea</em> is a humorous text adventure.</p><p>Aunt Velma is your favourite auntie and it's her birthday. She's coming round to tea and, naturally enough, she's expecting to be given her birthday present. The good news is that you've bought it, the bad news is that you put it in the wardrobe in the spare bedroom and can't remember where the key is. Aunt Velma is expected in one and a half hours, time to start panicking. </p><p>To make things even worse the fuse has blown and the house is in darkness.The object of the game is to find the present and get the house ready for auntie's visit, not necessarily in that order.</p><p>This game was developed using <em>Professional Adventure Writer</em>. It supports the standard shortcuts such as N/S/E/W for North/South/East/West as well as X for EXAMINE. When completed successfully the player will score 55/55.</p>"},{"name":"Aura Scope","year":1991,"developer":"Square Peg","url":":Aura Scope","filesize":66854,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Fantasy","desc":"<p><em>Aura Scope</em> is a fantasy text adventure. </p><p>Old Nub maintains 'The Great Cosmic Wheel' which keeps the forces that control the universe in balance. Then one day things go awry and the Great Wheel spun from its axis. The twelve constellations of the zodiac were shattered with fragments being scattered through space and time. Nub can fix things but to do so he needs a hero to recover the twelve symbols, one for each constellation. </p><p>This game was developed using <em>Professional Adventure Writer</em>. It supports the standard shortcuts such as N/S/E/W for North/South/East/West as well as X for EXAMINE and I for INVENTORY.</p>"},{"name":"Aural Quest","year":1984,"developer":"Gilsoft","url":":Aural Quest","filesize":13212,"score":"","genres":"Adventure > Text-based / Spreadsheet > Text parser","desc":"<p><em>Aural Quest</em> is a ZX Spectrum text-based role-playing adventure game written by Mike Turner from Gilsoft in The Quill Adventure Writing System. The game was put as a bonus on the second side of the cassette edition of The Stranglers' music album \"Aural Sculpture\" and was preceded by a short introduction from band's keyboardist Dave Greenfield. In the game the player was placed in the shoes of The Stranglers' tour manager and was about to collect four parts of a giant ear (which was part of the cover art of the music album). Transporting the bits back to Britain allows you to eventually reconstruct the album's signature sculpture. Many of the clues are provided by bursts of The Stranglers music and lyrics.</p>"},{"name":"Aussie Games","year":1990,"developer":"Beam Software Pty. Ltd."},{"name":"Austerlitz","year":1986,"developer":"MC Lothlorien","url":":Austerlitz","filesize":17863,"score":6.7,"genres":"Strategy > Top-down > Historical events","desc":"<p>This was the second in Lothlorien's Warmaster series of Strategy wargames and covers the battle in 1805 when Napoleon defeated a combined Russian and Austrian Army at Austerlitz.</p><p>In the game, you command Napoleon's forces - either directly or through a number of computer-controlled Corps commanders. Infantry and cavalry units are available for both sides (no artillery), each with varying degrees of strength and morale, with terrain effects playing an important role in their effectiveness. The game also features 'fog of war', where only those enemy units spotted by your advanced units or those encountered before combat, are revealed.</p>"},{"name":"Australian Rules Football","year":1989,"developer":"Clockwize Software Developments","url":":Australian Rules Football","filesize":18041,"score":"","genres":"Sports > Top-down","desc":"<p>This game is based on the sport Australian rules football, or Aussie rules.  It has two teams playing against each other in four, three minutes quarters and the aim is to score the most points at the end of the game to win.  </p><p>A goal, also known as a sausage roll, is scored if the ball goes through the middle posts and is worth six points while a behind is scored if the ball goes between the side posts, this is worth one point.  You can earn possession by tackling the opposition to win the ball.  There is also a chance that while in possession you can drop the ball which may cause you to lose possession.  Throughout the game, a commentator runs down the action and gives updates on the scores as they happen.</p><p>The game comes with two leagues.  The Outback Amateur League has you in control of the Koalas and you must win matches to move up the OAL ladder.  You take on teams such as the Rangers, the Butchers and the Wallabies and you must reach the top of the ladder to become champions.  The Victorian Football League is the professional league and provides a much tougher test.  Here you are the Hawks and teams like the Bombers, the Kangaroos and the Blues are your opposition and the aim is the same as the previous league, win matches to move up the VFL ladder and eventually reach to top to win the championship.</p>"},{"name":"Autocrash","year":1991,"developer":"Zigurat Software S.L.","url":":Autocrash (Es)","filesize":23850,"score":6.6,"genres":"Action > Racing / Driving > Top-down > 2D scrolling > Arcade > Sci-fi / futuristic","desc":"<p>In <em>Autocrash</em> the player competes in a death tournament between \"bumper cars\". The goal is to dismount the opponent (or opponents) from his car, and hit him before he leaves the game zone.</p><p>Along the stages, the enemy's A.I. difficulty level and his number will increase. Additionally, in some stages the enemies must be eliminated in a certain order.</p>"},{"name":"Automania","year":1984,"developer":"Mikro-Gen Ltd","url":":Automania","filesize":15578,"score":"","genres":"Action > Side view > Arcade > Platform","desc":"<p><em>Automania</em> is a platform game in which the player must help Wally, who works on a car assembly line, build a series of ten cars. Each car consists of six parts that are distributed all around the stock room and must be collected to be placed in their correct positions on the car at the assembly area. The factory is populated with stuff that will kill Wally on contact, like robots, bouncing tires, and air cooling blades.</p>"},{"name":"Automonopoli","year":1983,"developer":"Automata UK","url":":Automonopoli","filesize":16104,"score":"","genres":"Strategy > Top-down","desc":"<p>This unofficial interpretation of Monopoly can be played by up to five players, with the computer able to play as one, as well as doing all the banking. Only three squares of the board are displayed at a time, as a continuous sequence with no corners. Chance and Community Chest cards reflect those in the real game.</p><p>Pressing X during your turn brings up the options page. This lets you view who owns each property, and how much money they have. It is through here that you can buy houses/hotels and trade with opponents.</p>"},{"name":"Avalanche: The Struggle for Italy","year":1991,"developer":"CCS","url":":Avalanche - The Struggle for Italy","filesize":24279,"score":"","genres":"Strategy > Top-down > Turn-based > Historical events > World War II","desc":"<p>This wargame takes it's name from Allied actions during the second World War. Operation Avalanche was the landing of Allied forces on the west coast of mainland Italy in 1943.  Accordingly, this is the scenario the game uses. The computer can be set to control either the Allied, German, or no side, and various additional settings with respect to historical circumstances (for example the loyalty of Italian forces to each side) can be made.</p><p>The main game takes place on a single, scrolling map. Units are represented by icons with no single scale (for instance, a tank icon can represent a division as well as a brigade). The gameplay structure itself consists of various phases, such as air (reconnaissance  and attacks), order (for e.g. movement actions) and combat. The latter is used to calculate the results of engagements.</p>"},{"name":"Avalon","year":1984,"developer":"ST Software"},{"name":"Avalon / Dragontorc","year":1986,"developer":""},{"name":"Avenger","year":1982,"developer":"Abacus Programs","url":":Avenger","filesize":6037,"score":"","genres":"Action > Side view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Your mission is fly above the surface of a mountainous planet and destroy buildings on the surface by dropping bombs. Viewed from the side with the screen scrolling left to right constantly, you will also encounter alien ships firing at you as well as missiles but these can be shot with your laser. Overuse of your laser though will make it overheat and you will be unable to use it for a short time. If you are hit by any bullets, missiles or hit the surface then you lose either one or two shields from five and if your shields run out then you lose one of five lives. Scattered on the surface are Atomic Power Stations and these must not be destroyed or you will blow up the planet and lose a life. There are five skill levels (1-5) with one being the easiest.</p>"},{"name":"Avenger - Way of the Tiger II","year":1986,"developer":"Gremlin Graphics Software Limited","url":":Avenger - Way of the Tiger II","filesize":30271,"score":7.1,"genres":"Action > Top-down > Shooter > Fantasy > Martial arts > Licensed","desc":"<p>In the sequel to The Way of the Tiger, Yaemon the Grand Master of Flame is the villain of the piece. He has killed your foster-father Naijish and stolen the Scrolls of Kettsuin.</p><p>Your quest to recover the scrolls and avenge your father's death is viewed from above and superficially resembles Gauntlet. You start outside the Quench Heart Keep, and must initially find enough keys in the grounds and connected buildings to penetrate it, and then kill each of the 3 guards. You can also collect treasure for bonus points as you explore.</p><p>There are other prey including spiders to fend off - these know how to home in on you. You are armed with a limited number of shuriken to shoot from a distance; after these are gone you are reliant on your bare hands, although more can be collected. Pressing the 1 key summons an energy recharge from the God Kwon, but this can only be used 3 times.</p>"},{"name":"Avon + Monsters of Murdac","year":1989,"developer":""},{"name":"Axe of Rage","year":1988,"developer":"Palace Software Ltd."},{"name":"Aztec Assault","year":1992,"developer":"Zenobi","url":":Aztec Assault","filesize":28300,"score":"","genres":"Adventure > Text-based / Spreadsheet > Interactive fiction / text adventure > Fantasy > Pre-Columbian Americas","desc":"<p><em>Aztec Assault</em> is the third text adventure based on the continuing war between the \"Time Crusaders of Chronos\" and forces of the Primal Darkness led by \"The Abomination\".</p><p>The previous two games saw first a village in Ireland then a Caribbean island threatened. The game is set in the year 1512 AD and the attack is centred on the ancient city of Tenochtitlan. The demonic attack is fast and the city is very quickly overrun giving \"The Abomination\" control of the entire Aztec Empire. </p><p>The king, Motecuhzoma, flees. Monsters and demons roam free, killing at will. More importantly, from the Aztec point of view, regular sacrifice to the gods is unable to continue and without sacrifice they cannot prevent the coming of \"The Fifth Sun\", otherwise known as the end of the world.</p>"}]