[{"name":"B.C. Bill","year":1984,"developer":"Imagine","url":":B.C. Bill","filesize":24573,"score":"","genres":"Action > Diagonal-down > Arcade","desc":"<p><em>B.C. Bill</em> is a collect-em-up about the daily struggles of our ancestors. As the caveman Bill, you must compete with other contemporary species, such as the dinosaurs, to collect food. Whack the food with your club and drag the food back to your cave before a dinosaur eats it – or you. But food alone is not enough for survival, you must also hunt cave-wives to secure your offspring. The procedure is the same here: hit the women with your club before they're eaten by a dinosaur, and drag them by their hair back to the cave. Your score is calculated according to how many seasons you've survived, how many wives and how much offspring you have.</p>"},{"name":"Babaliba","year":1984,"developer":"Dinamic Software","url":":Babaliba (Es)","filesize":21957,"score":"","genres":"Action > Top-down > Fixed / flip-screen > Puzzle elements","desc":"<p>Johny Jones is in Hosmimumarack's palace. There he must seize the hidden treasure in one of the rooms, kidnap the princess and rescue the companion who is prisoner in the dungeon. Once done, it's necessary to return to the main room of the palace in which you must formulate a spell joining the letters of \"Babaliba\", which are hidden in some place of this room. When doing it, it's necessary to consider that they should be taken in the same order they are written.</p><p>The enemies are many and arise from everywhere: armed Moors, monstrous crabs, killer spiders and dangerous crocodiles will try to make us fail in our mission. There are four different plants, each one accessible from the stairs that communicate the different parts of the palace. In the ground floor there is the dungeon, where you will find the prisoner. In the main plant, the labyrinthic gardens and the treasure, and in the above ones, the residences.</p>"},{"name":"Back to Skool","year":1985,"developer":"Microsphere Computer Services Ltd.","url":":Back to Skool","filesize":34269,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>In this sequel to popular Skool Daze once again you must try and save your own neck!</p><p>Having managed to steal your report during the last few skooldaze of term, you've spent the whole holiday forging teachers' signatures and handwriting to make yourself look like the brightest, sweetest natured, most helpful little soul ever to carry a satchel.... Now all you've got to do is get it back into the Headmasters's safe!</p><p>Back to Skool follows the same gameplay style as its predecessor, but this time the school is bigger (there's a girl's section to explore) and there's a larger cast of characters. There's also more to do this time around, with more objectives to complete before you can finish the game.</p>"},{"name":"Back to the Future","year":1986,"developer":"Electric Dreams","url":":Back to the Future","filesize":20358,"score":5.5,"genres":"Action > Side view > Fixed / flip-screen > Puzzle elements > Licensed","desc":"<p>Based on the 1985 time travel flick, Electric Dreams' <em>Back to the Future</em> computer game differs significantly from LJN's version on the NES.</p><p>The player takes control of teenager Marty McFly; zapped into the past by an experiment gone wrong. To preserve Marty's future existence, the player must lure Marty's mother-to-be into spending more time with his father, while avoiding the school bully. These computer-controlled characters will wander the game areas and interact with each other according to basic rules - Marty's mother will follow him around, his father will avoid the bully, the bully will knock Marty out if their paths should cross, etc. If left to their own devices, Marty's parents will not meet and his time will run out (indicated by a fading family photo). </p><p>The game world consists of five distinct areas, each the size of one screen. A separate \"hub\" area scrolls past the entrances to these five zones. Each of the five areas holds a collectible item, with a different effect (attract, repel, or no effect) on each character. A skateboard can also be collected to travel across the hub faster.</p><p>The player must use their collected items to keep Marty's mother and father in close proximity, while also keeping the bully away.</p>"},{"name":"Back to the Future Part II","year":1990,"developer":"Images Software Ltd."},{"name":"Back to the Future Part III","year":1991,"developer":"Image Works","url":":Back to the Future Part III","filesize":26568,"score":5.6,"genres":"Action > Side view > Top-down > 2D scrolling > Isometric > Arcade > Western > Licensed","desc":"<p><em>Back to the Future III</em> is a collection of four arcade games. Marty McFly and Doc Brown have traveled back through time to the year 1885 - and they're soon deep in trouble when they face \"Mad Dog\" Tannen's gang and have to find a way to return to the present. This game takes four scenes from the Hollywood movie <em>Back to the Future III</em> and turns them into arcade sequences:<em> </em><em>Buckboard Chase</em>*: Doc Brown goes horseback in an attempt to save Hill Valley's lovely school teacher Clara. This game of quick ducking, jumping and shooting alternates between a side-scrolling and a top-down perspective.</p><ul><li><p><strong>Shooting Gallery</strong>: The name says it all. A classic game of aim-and-shoot, spiced up by hidden extras and bonus targets.</p></li><li><p><strong>Pie Throwing</strong>: Meet the Mad Dog gang. They have guns, and you have... cream pies. It's an isometric version of the shooting gallery, only with ammo. And the targets shoot back.</p></li><li><p><strong>The Train</strong>: Basically a side-scrolling beat-em-up on train wagons with some ducking and jumping. Get rid of the mechanics and collect speed logs to push the engine to a magic 88 mph.</p></li></ul>"},{"name":"Backgammon","year":1983,"developer":"Hewson Consultants Ltd.","url":":Backgammon","filesize":6192,"score":"","genres":"Strategy > Top-down > Turn-based > Board game","desc":"<p>BACKGAMMON * 8 levels of play * Full colour display * Tumbling dice * Single game, points series or gambling series * Full instructions * Doublets * Hitting to the bar * Bearing off</p>"},{"name":"Backpackers Guide to the Universe Part 1","year":1984,"developer":"Fantasy Software","url":":Backpackers Guide to the Universe Part 1","filesize":35984,"score":"","genres":"Action > Side view > Fixed / flip-screen > Life / social simulation > Platform > Puzzle elements > Time management > Flight / aviation > Sci-fi / futuristic","desc":"<p>Backpackers Guide to the Universe Part 1 is a sci-fi platform game which combines puzzle-solving elements and the management of life systems and resources. </p><p>The main goal is to capture the biggest amount of these creatures and keep them alive. To be successful the player has to study the encyclopaedia and become aware about the features of each species, their habitats and what they eat.</p>"},{"name":"Bad Dudes vs. Dragon Ninja","year":1988,"developer":"Imagine","url":":Bad Dudes vs. Dragon Ninja","filesize":47317,"score":6.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Regional differences","desc":"<p><em>Bad Dudes</em> is a six-level action game originating in the arcades. The gameplay involving beating a succession of guys to complete the level, then an end-of-level bad guy. The action takes place on two different levels of the screen, which can be jumped across or navigated using ladders. Moves such as punches and kicks are on offer. The control method makes jumping sideways quite tricky.</p>"},{"name":"Bad Street Brawler","year":1987,"developer":"Beam Software Pty. Ltd."},{"name":"Badlands","year":1990,"developer":"Domark","url":":Badlands","filesize":24239,"score":6.2,"genres":"Racing / Driving > Top-down > Post-apocalyptic","desc":"<p>Badlands continued the Super Sprint lineage, but moved the game into a futuristic post-apocalyptic setting. The races consist of 3 souped-up cars toughing it out over 4 laps on one of the 8 tracks, which are viewed from above. Two human players can take part, but only the winner continues without using up credits, so you will only see the early races in two-player mode. </p><p>You are armed with guns, which can be used to slow opposing cars. During the races spanners can be collected, which are then cashed in for upgraded turbos, improved weaponry and engine upgrades. Hazards on the later tracks include ramps, bridges, buildings collapsing onto the track and barriers which open and close in a random sequence.</p>"},{"name":"Ball Breaker","year":1987,"developer":"CRL Group","url":":Ball Breaker","filesize":21638,"score":6.3,"genres":"Action > Diagonal-down > Isometric > Paddle / Pong","desc":"<p><em>Ball Breaker</em> is Breakout variant. The player controls a paddle which is fixed on the right side of the screen and is only able to move vertically. With this paddle, a ball is both bounced into the playfield and prevented from falling out of the screen. The goal is to vaporize all blocks on the playfield by hitting them with the ball. A limited amount of missiles can be used to destroy blocks or aliens directly. The latter appear on higher levels and should not be touched with the paddle.</p><p>The speciality of this variant is the use of an isometric perspective. While the ball and paddle itself do not leave the lower plane, the blocks are stacked up. The higher blocks fall down when the blocks below them are gone.</p>"},{"name":"Ball Crazy","year":1987,"developer":"Mastertronic Added Dimension","url":":Ball Crazy","filesize":15437,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade","desc":"<p>Erik the ball must bounce around the screen in this action game. The  screens have several ledges, each of which changes colour when Erik touches it. The goal is to change them all to a specified colour, while avoiding the Chasers which try to stop him (despite the name, their movement paths are random). This must be done 4 times on each of the 8 levels, as a new layer of bricks are added above the old ones once they're finished. Several bonus items are around to make the task easier. - invincibility, extra lives, automatic layer completion, and bonus points.</p>"},{"name":"Ballblazer","year":1986,"developer":"Activision","url":":Ballblazer","filesize":21376,"score":7,"genres":"Action > Sports > 1st-person > Sci-fi / futuristic","desc":"<p>In the year 3037, the most competitive sport in the known universe is Ballblazer. For the first time ever, humans from the planet Earth have won the right to compete in the final round of the Ballblazer Championship, to fight for Earth's honor and the title Masterblazer!</p><p><em>Ballblazer</em> is a 3D futuristic soccer-like game, where the player (inside a Rotofoil) is set on a one-on-one 1,155 square playing field (the Grid). The objective of the player is to kick a floating ball (Plasmorb) inside the opponent's goal (Goalbeams). A player may compete against a human or computer opponent.</p><p>The Rotofoil is equipped with a multi-purpose forcefield. This forcefield when in short distance of the Plasmorb will act as a pull field, automatically pulling the Plasmorb towards the player. When a player in possession of the Plasmorb shoots, the forcefield will act as a push field and launch the ball. When the match starts, the player must move down the field, attempt to gain possession of the Plasmorb using the joystick and blast the Plasmorb to an intended direction. </p><p>The player should also be aware that the Goldbeams move slightly every second and the distance between them will shrink. The highest scoring goals are goals made when Goldbeams have disappeared across the horizon (Over The Horizon/OTH shots). A player may also attempt to steal possession of a Plasmorb by rushing beside the opponent and blast the Plasmorb away. The game ends when time runs out or a player wins 10 consecutive goals. If the game ends in a draw, overtime will apply and the first player to score will win the game.</p><p><strong>Scoring</strong>* Close-in goals - 1 point</p><ul><li>Goals near Goldbeams - 2 points</li><li>OTH shots - 3 points</li><li>Players may steal points from each other by making goals. </li><li>The total combined score of both players cannot exceed 10 points.</li><li>A player winning 10 consecutive points automatically wins the game.</li></ul>"},{"name":"Ballbreaker II","year":1988,"developer":"CRL Group","url":":Ballbreaker II","filesize":22831,"score":"","genres":"Action > Diagonal-down > Isometric > Paddle / Pong","desc":"<p><em>Ball Breaker II</em> is a Breakout variant. This means the player controls a paddle, fixed on the right side of the screen and only able to move vertically, which is used to bounce a ball into the playfield or keeping it from falling out of the screen, respectively. On said playfield there are a number of blocks which vaporize when hit by the ball. The goal is to clear out all blocks.</p><p>The speciality of this variant is the use of an isometric perspective. While the ball and paddle itself do not leave the lower plane, the blocks are stacked up. The higher blocks fall down when the blocks below then are gone. The only significant difference to the predecessor are 30 new levels.</p>"},{"name":"Balloon Hopper","year":1983,"developer":"SQ","url":":Balloon Hopper","filesize":3840,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade","desc":"<p>Ballon Hopper is a transporting genre game originally designed with the main purpose of loading a spacecraft with cargo boxes represented by amounts of points that alternate between 50 and 100 points. The player commands a transporting cargo flying vehicle on a windy day with a sky filled with Balloon traffic. He has to avoid colliding with them during the transportation otherwise a cargo vehicle is lost. The screen is divided by the upper screen which represents the dock of the Spacecraft, and the lower screen which represents the Space-port where the cargo is located at the first place. The spacecraft has to be loaded with 10 pieces of cargo and each time a piece is loaded the process of transportation has to be repeated. </p><p>As long as each Spacecraft is fully loaded and the level is complete, the number of Balloons increases.</p>"},{"name":"Ballooning","year":1983,"developer":"Five Ways Software Ltd."},{"name":"Balrog and the Cat, The","year":1988,"developer":"Zenobi Software","url":":Balrog and the Cat, The","filesize":28191,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Text parser > Fantasy > Comedy","desc":"<p><em>The Balrog And The Cat</em> is a humorous text adventure featuring a Balrog. Balrogs are a sort of goblin and this one appears in many of Zenobi Software's games, and also seems to have run their website.</p><p>This game sees the player take the role of Balrog, who's at home enjoying a green cheese sandwich, brown bread of course, when there's a scratching at his door. The source of the annoyance turns out to be a smoking cat, it's the pet of a magician 'The White Wassock' who happens to be short sighted - that's how the cat was accidentally teleported to Balrog's door with it's tail on fire. The object of the game is to help the cat. <br>Along the way the player will encounter at least one troll, characters from other Zenobi games, and frequent pubs. When the game is successfully completed the player will have scored 135/135 points</p>"},{"name":"Balrog's Big Four","year":1990,"developer":""},{"name":"Balrog's Box Of Delights","year":1996,"developer":""},{"name":"Balrog's Day Out","year":1994,"developer":""},{"name":"Balrogian Trilogy, The","year":1990,"developer":""},{"name":"Bangers & Mash","year":1992,"developer":"Bizarre Developments"},{"name":"Barbarian","year":1988,"developer":"Psygnosis Limited","url":":Barbarian","filesize":23060,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>In this game you play the role of a barbarian who must navigate his way through dangerous dungeons. The game is played from a third person side scrolling perspective and also has platform jumping parts to it. The barbarian is controlled by using left and right on the joystick to move and up and down is used to scroll through the various commands at the bottom of the screen.When a command is highlighted pressing fire will perform that action thus saving on extra buttons being needed to play. There are two weapons at your disposal. A sword which you start the game with and later a bow which is handy for long range attacks. There are many traps to avoid and various monsters who have different attack patterns.</p>"},{"name":"Barchou","year":1986,"developer":"Central Solutions","url":":Barchou","filesize":7343,"score":"","genres":"Action > Side view > Fixed / flip-screen > Shooter > Sci-fi / futuristic","desc":"<p>Aliens attack earth and drop on the cities! Of course the player can't let this stand, takes the astronaut gear and sits on a flying chair (at least according to the box art) to blast the attackers.</p><p>The action takes place on a single screen and four cities are placed at the bottom. The player character, about the same size as a city, can freely move around the screen and use a laser to shoot also moving aliens. Those drop bombs which, if not destroyed in time, reach and destroy the cities. The player character dies when touching aliens or their projectiles. When all aliens are dead, the next level with higher difficulty begins. The game is lost when either all lives are gone or all cities are destroyed.</p>"},{"name":"Barmy Burgers","year":1983,"developer":"Blaby Computer Games","url":":Barmy Burgers","filesize":10576,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p>Burger Time clearly influenced this manic arcade action game, in which your task is to make burgers, by collecting the 4 core components in sequence. Chasing you as you do this are two sausages and eggs, contact with which costing you a life. You are armed with a pepper spray, which paralyzes them for a few seconds, but this is limited to five uses per level. When you touch the burger pieces, they drop, and can be used as weapons to stop the pursuing foods. The arrangement of platforms features many ladders, which you must use to chase and dodge the respective ingredients.</p>"},{"name":"Baron","year":1983,"developer":"Temptation","url":":Baron","filesize":2232,"score":"","genres":"Strategy > Turn-based","desc":"<p><em>Baron</em> is a strategy game for one to four players who must farm and survive a Barony for five to fifty five turns. Each player starts with 1500 Dubloon / Bush, 70 acres and 100 workers. To play the game each player takes it in turns to buy or sell land, feed the workers, plant bushels, and hire Mercenaries who in turn need feeding and arming with swords to protect your land. As you make your decisions you must be aware of your finances and if your workers or mercenaries aren't being fed then they may turn on you and execute you. Players can also attack each other and are able to either get slaves, steal land or Dubloons if successful.</p>"},{"name":"Barreldrop!","year":1983,"developer":"Games Machine","url":":Barreldrop!","filesize":7085,"score":"","genres":"Action > Side view > Fixed / flip-screen > Puzzle elements","desc":"<p>In <em>Barreldrop</em>, you must help Gordon unblock his drainpipes by dropping barrels onto them. The game automatically drops a barrel for you and you have to press the Space bar to drop the barrel into any of the five drainpipes marked 5 to 1. It must drop between the pipe and doing so will score you the points of that pipe. Failing to do so will cause the barrel to be lost, unless you guide his dog Flash to help you. When Flash becomes available you have to press the D key and he will return a missed barrel before it is lost.</p><p>You need to clear all five pipes to complete the level, if all five pipes are not cleared after losing all your barrels your game is over. Before progressing to the next level however, you must complete a mini-game task which varies from answering a riddle to shooting aliens. Completing the task will advance you to the next level while failing the task ends your game.</p>"},{"name":"Base Invaders","year":1983,"developer":""},{"name":"Basic Test","year":1986,"developer":""},{"name":"Basil the Great Mouse Detective","year":1987,"developer":"Gremlin Graphics","url":":Basil the Great Mouse Detective","filesize":22528,"score":5.8,"genres":"Action > Side view > Platform > Puzzle elements > Licensed","desc":"<p>Based on the 1986 Walt Disney animated movie, the story revolves around a mouse named Basil who lives in the basement of the famous Sherlock Holmes residence 221B Baker Street.  Basil's friend Dr. Dawson has been kidnapped by the villainous Professor Ratigan and he must search through London for clues that will lead him to the fiend's lair.</p><p>The game is a colorful platform adventure through 3 locales:  London's shops and docks, the sewers and finally the den of Ratigan.  In each area, 5 clues must be found by exploring objects such bags and sacks, cans, jars and chests found in each screen with Basil's magnifying glass.  He must pick up clues to fill 5 pockets in his coat and then he will be able to determine if some are fake (as Ratigan has scattered 8 fake clues among each locale).  Fake ones must be dropped until all 5 real clues are found then you get a clue to the level exit to go to the next locale.  If you can't find the exit, each clue can give a hint as to what direction you should go in.  </p><p>Your energy runs down as you go through the multi-level platform screens and encounter Rattigan's goons but some objects will contain cheese which restores energy or mousetraps which when laid in path of the goons will make them harmless (though they take up a pocket until used).</p>"},{"name":"baSnake","year":2017,"developer":"Marco's Retrobits"},{"name":"Batman","year":1986,"developer":"Ocean Software Ltd.","url":":Batman","filesize":34295,"score":7.9,"genres":"Action > Diagonal-down > Fixed / flip-screen > Isometric > Puzzle elements > Direct control > Licensed","desc":"<p>Robin was repairing the Batmobile when he was kidnapped. Before Batman can contemplate rescuing him, he must reassemble the car from its seven parts. There are all over the Batcave, in this isometric arcade adventure taking in over 150 screens. </p><p>Initially Batman lacks his super powers, which must be collected. The Batbag allows you to pick up and drop objects, Jet Batboots allow you to jump, the Thruster allows Road-Runnering (movement while you fall), and the Low Gravity Batbelt keeps you in the air for longer.</p><p>Short-term bonuses of invincibility, extra energy, and extra life and an enhanced jump can be collected, but there is also one which neutralises all power-ups. You have eight lives, but each cluster of Batstones acts as a restart point - when it is game over you can return to that spot, with lives and equipment as they were.</p>"},{"name":"Batman: The Caped Crusader","year":1988,"developer":"Ocean Software Ltd.","url":":Batman The Caped Crusader","filesize":26745,"score":7.3,"genres":"Action > Adventure > Side view > Arcade > Platform > Puzzle elements > Licensed","desc":"<p><em>Batman: The Caped Crusader</em> is a combination of an arcade and adventure game. The game is played with a side scrolling view, with each new location opening in a new panel similar to the appearance of a comic book. </p><p>The game has two parts to it, and these can be played in any order. In A Bird In the Hand, The Penguin is back, and planning on taking over the world with an army of robotic penguins. In A Fete Worse Than Death, The Joker has kidnapped Robin, and it's up to Batman to save him.</p>"},{"name":"Batman: The Movie","year":1989,"developer":"Ocean Software Ltd.","url":":Batman The Movie","filesize":66957,"score":7.7,"genres":"Action > Racing / Driving > Side view > 2D scrolling > Arcade > Platform > Puzzle elements > Shooter > Licensed","desc":"<p>Based on the 1989-Batman movie. The game consists of five different parts, each resembling well known game types. Part one, the chemical plant: Hunt down Jack Napier who has raided the plant (typical platform action, climb ladders or use \"Bat\"-rope and shoot at some enemies...). Part two, \"Batmobile\" (...the car): Joker is chasing you and have to escape to \"Bat\"-cave. Avoid obstacles like police blocking the road and others. Part three, \"Bat\"-cave: A puzzle game where you have to find a certain item (belonging to Joker) amongst other items. Part four, \"Batjet\": Cut the ropes of the balloons which are filled with poisonous gas. Part five, the cathedral: Hunt down Joker. This part plays like the first one. Finally you will confront Joker in a fight that decides the fate of Gotham city.</p>"},{"name":"Battle 1917","year":1983,"developer":"CCS","url":":Battle 1917","filesize":6646,"score":"","genres":"Strategy > Top-down > Turn-based > Wargame > Historical events > World War I > War","desc":"<p><em>Battle 1917</em> is a turn-based strategy game for one or two players.The game background is World War I with its new technology and the first use of tanks. Players command 29 units of five types: infantry, cavalry, tanks, artillery and a king. The object of the game, like in chess, is to kill the enemy king who is the weakest and slowest piece on the board. Each unit has different stats.</p><p>The map is 21x32 squares large and is randomly generated for every new game. Objects on the map include wires, forests, rivers and units.</p>"},{"name":"Battle Chopper","year":1989,"developer":"Irem Corp."},{"name":"Battle Command","year":1991,"developer":"Realtime Games Software Ltd."},{"name":"Battle Droidz","year":1987,"developer":"Starlight Software"},{"name":"Battle Fields","year":1988,"developer":"Atlantis","url":":Battle Fields","filesize":12286,"score":"","genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p><em>Battle-Field</em> is a top view single screen shooter for two players, where each player tries to destroy the other players futuristic tank by hitting it various times (four on the C64, five on the ZX Spectrum) to win the game. There are various screens that can be selected (four on the C64, eight on the ZX Spectrum) and each screen has various walls and barriers that need navigating round as the players try to find the perfect shot to hit the other players tank. Once a player has lost his lives then the game is over and another screen can be selected.</p>"},{"name":"Battle for Midway","year":1985,"developer":"Personal Software Services","url":":Battle for Midway","filesize":16292,"score":"","genres":"Strategy > Diagonal-down > Real-time > Arcade > Shooter > Naval / watercraft > Historical events > World War II","desc":"<p>Intelligence reports that we have cracked a Japanese coded message. They plan to attack Midway Island and trap and destroy our naval fleet. We have dispatched Task Force 16, with carriers <em>Enterprise</em> and <em>Hornet</em>, and Task Force 17, with carrier <em>Yorktown</em>, to counter these plans. Good luck, gentlemen.</p><p>You are in command of the two task forces of the Pacific fleet and must destroy or drive off the Japanese carrier divisions. Do not let them take the island of Midway. You have to personally man the guns when the island or task force are attacked. As planes swoop in, shoot them down until they are gone or your gun is destroyed. We're all counting on you, sailor!</p>"},{"name":"Battle for the Isle II","year":"Undated","developer":""},{"name":"Battle of Britain (1983)","year":1982,"developer":"Microgame Simulations","url":":Battle of Britain (1983)","filesize":9887,"score":"","genres":"Simulation > Strategy > Top-down > Managerial / business simulation > Historical events > World War II","desc":"<p>Written entirely in BASIC, with only block graphics and simple beeps, this game allows you to direct the RAF defence against the Axis air blitz on London in 1940. The game takes place on a 31x20 map, using letters coordinates to represent each of the 620 squares of the map. </p><p>You have under your command nine squadrons based at various points in Southeast England. Radar and observers will inform you of the location of nine incoming German bomber forces heading for one of three defence points. The locations of the defence points are randomized for each game, as are the target locations of each squadron. You can't see these, but must deploy your units so as to intercept them, thus setting an air battle into motion.</p><p>You will need to scramble fighters to selected points on the map, by inputting their coordinates. You will need to take into account factors such as anticipated flight paths of the incoming bombers, fuel ranges of your squadrons as well as refuelling and re-arming times needed when they return to base.</p><p>The objective of the game is to ensure no more than 100 German bombers reach their targets by the end of the day. This number can be changed at the start of the game if you want a different difficulty level.</p><p>The game was one of the first strategy games at the time to feature near real-time play (rather than play-by-turn).</p>"},{"name":"Battle of Britain (1986)","year":1986,"developer":"Personal Software Services","url":":Battle of Britain (1986)","filesize":22661,"score":"","genres":"Action > Strategy > 1st-person > Top-down > Real-time > Shooter > Historical events > World War II","desc":"<p>In <em>Battle of Britain</em> the player controls the RAF Fighter Command during the turning point air battle of the World War 2. You may familiarize yourself with the game by choosing to fight one day with either light or heavy enemy activity, or play the full campaign (starting 20 August 1940, limited to 30 days). The map shows the southern half of Great Britain and a small corner of France, with airfields, radar stations and cities. Fighter squadrons (18 available) need to be scrambled to intercept detected incoming Luftwaffe raids. At the end of the day a tally of losses will be displayed, followed by a reinforcements allocation screen.</p><p>Optional action sequences allow the player to fly a Spitfire in a dogfight or man an anti-aircraft gun (not available on ZX Spectrum).</p>"},{"name":"Battle of the Planets","year":1986,"developer":"Mikro-Gen","url":":Battle of the Planets","filesize":20913,"score":"","genres":"Action > Strategy > 1st-person > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Battle of the Planets</em> is based on a science-fiction children's cartoon series of the same name. Zoltar and his forces are attacking your solar system and its five planets - Xenath, Elias, Horaf, Olixal and Pete. As a G-Force space fighter armed with a Phoenix ship, you must repel each of these attacks, by destroying enough of Zoltar's craft to prevent the attacks from succeeding.</p><p>The action unfolds through the window of your craft, with various types of enemy craft approaching and needing to be shot with your lasers or torpedoes. Once you have targeted an enemy, you must keep the enemy craft in your sights until it has been destroyed. There are five status screens to keep track of - shield strength, power stability, rocket status, laser status (it can overheat with constant use) and the current situation on the planet you are defending.</p><p>To land on a planet you must fly towards its target on screen, and enter the docking bay. You will have to take out landers, using your rocket system. This is also your chance to repair and re-fuel your craft.</p>"},{"name":"Battle Valley","year":1988,"developer":"Hewson Consultants Ltd.","url":":Battle Valley","filesize":22544,"score":6.3,"genres":"Action > Side view > Shooter > Helicopter > Tank","desc":"<p>This side-view shoot 'em up involves trying to retrieve two nuclear weapons which have been stolen by terrorists. These are located at opposite ends of the playing area, so you can pursue them in either order. Needless to say, the terrorists have plenty of forces out to prevent you getting too far.</p><p>Unusually, the game features both a helicopter and a tank - you choose either from the base, and can fly/drive back there to change. The best strategy is to use the helicopter to shoot out air-based enemies and repair the various bridges, then return for the tank. You get 4000 seconds in which to complete all this, and losing a life costs you 500 of these.</p>"},{"name":"Battlecars","year":1984,"developer":"Games Workshop","url":":Battlecars","filesize":21369,"score":"","genres":"Racing / Driving > Top-down > Sci-fi / futuristic","desc":"<p><em>Battlecars</em> is 2D top-down combat racing game in futuristic, post-apocalyptic universe, loosely based on the board game from Games Workshop. The player rides along the route, while fights with the enemy - he has at his disposal various weapons. Battlecars have six steering functions, four 'fire' functions, throttle and brakes. The game has 3 locations (Circuit, Autodrome and Town) and two modes (time trial and race). 2 locations have pit-stops where player can get his car repaired and refuelled.</p>"},{"name":"Battleship","year":1987,"developer":"Elite Systems Ltd."},{"name":"Battlezone","year":1984,"developer":"Quicksilva","url":":Battlezone","filesize":16732,"score":6.9,"genres":"Action > Simulation > 1st-person > Arcade > Direct control > Tank > Vehicular combat > Sci-fi / futuristic","desc":"<p>Commonly considered the earliest progenitor of first-person shooters (FPS), <em>Battlezone</em> is a 3D tank game initially released in the arcades, and later converted officially to many systems. Earth has been invaded, and you and your tank lead the defensive effort. You drive around the battlefield from a first-person view, targeting and firing at tanks, planes and UFOs. You have a radar to help you see where the enemies are in direction and distance. Objects can be used as strategic cover. Controls simulate the tracks of a tank realistically, so the direction and speed settings are varied - combining forward right and backward left movements (as you can on keyboard versions) sees you change direction more quickly.</p>"},{"name":"Batty","year":1987,"developer":"Elite Systems Ltd.","url":":Batty","filesize":17000,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Paddle / Pong > Sci-fi / futuristic","desc":"<p><em>Batty</em> is influenced by Arkanoid's method of reviving the Breakout phenomenon. You control a paddle at the bottom of the screen, with the top half of the screen containing an arrangement of bricks, most of which can be destroyed. You must move the paddle left and right so as to make contact with a ball, and thus deflect it (using the walls at the sides strategically) into the bricks, some of which require multiple hits to destroy. Wipe the destructible bricks out, and you move on to the next level; fail to keep the ball in play and you lose one of your 5 lives.</p><p>Some destroyed bricks release power-up tokens, which must be 'caught' with the bat as they fall. Functions include multi-ball, a larger paddle, and the ability to 'catch' and relaunch the ball each time, which makes it a lot easier to gain access to precise bricks or areas.</p><p><em>Batty</em> also has enemies flying around and dropping bombs towards you - the bombs cause your bat to stick for a second, perhaps costing a life. Many levels contain magnets at the top of the screen, which make the ball's path harder to predict. The two player mode gives each player access to half the playfield, so co-operation is required.</p>"},{"name":"Batyskaf","year":1989,"developer":""},{"name":"Bazooka Bill","year":1987,"developer":"Melbourne House","url":":Bazooka Bill","filesize":27320,"score":"","genres":"Action > Platform > World War II","desc":"<p>Bazooka Bill is on a mission to rescue General MacArthur who has been kidnapped by a nasty revolutionary faction, and to get to him, he must get through five levels of shooting soldiers and choppers that drop bombs on him. He deals with them by mainly using his fists, although he can pick up a variety of weapons such as knives, machine guns, flamethrowers, and, of course, bazookas. All of these weapons have a limited supply of ammunition, so it is up to the player to use them wisely. Each level is completed when Bill finding the right position.</p>"},{"name":"BBC Mastermind","year":1984,"developer":"Ivan Berg Software Ltd."},{"name":"BC's Quest for Tires","year":1984,"developer":"Software Projects","url":":BC's Quest for Tires","filesize":17741,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Direct control > Prehistoric > Licensed","desc":"<p>Cute Chick is in trouble! She is being held captive by the dinosaur, and it is up to Thor to ride his trusty wheel to the rescue. There are many obstacles in the way which Thor will need to jump and duck, including rocks, trees, rivers, lava pits, cliffs, and of course Fat Broad. When you duck, the character bounces up and down, so don't duck too soon. <em>BC's Quest For Tires</em> is a side scrolling action game resembling Moon Patrol in some ways, featuring characters from the comic strip BC.</p>"},{"name":"Beach Buggy Simulator","year":1988,"developer":"Silverbird","url":":Beach Buggy Simulator","filesize":22106,"score":"","genres":"Racing / Driving > Side view > 2D scrolling > Arcade > Shooter > Automobile > Off-roading","desc":"<p>In this game you control a beach buggy that’s competing in the Dune Trials.  It consists of eight rounds and you must complete each round within the time limit to advance.  During the rounds you must jump over rocks and fire as well as shoot helicopters as they will make you crash and lose time.  </p><p>You have a set amount of fuel and you must collect fuel canisters to replenish it and maintain your speed.  Should your fuel count reach zero you will go slow until you collect a canister which would also cost you time.  You also cannot fire with your fuel empty.  If you complete all eight rounds the game loops over and you begin at round one again.  If you fail to complete any round within the time limit, your game is over.</p>"},{"name":"Beach Volley","year":1989,"developer":"Ocean","url":":Beach Volley","filesize":33745,"score":7.1,"genres":"Sports > Side view > 2D scrolling > Volleyball","desc":"<p>While two boys playing Beach Volley a stranger passes by and give them two the possibility to play around the world for the Beach Volley Cup. They take change and start their first competition in London. The rules are easy, one of the teams has to reach seven points first. When you win you fly to other continents like America, Africa or China to meet your next opponent.</p><p>You can play against the computer (cup mode) or a second player.</p>"},{"name":"Beach-Head","year":1984,"developer":"U.S. Gold","url":":Beach-Head","filesize":26818,"score":6.9,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Naval / watercraft > Tank > World War II > War","desc":"<p>A dictator has taken control of a fortress on the island of Kuhn-Lin.</p><p>The player's mission is to storm the island and recapture it. This takes place over the course of six different sequences. The first sequence is Aerial Reconnaissance, where the fleet must be moved directly past the enemy or into a hidden passage to trigger another, optional stage. In this Hidden Passage sequence, the player will have to maneuver around mines and torpedoes. Successfully completing it gives a surprise advantage in the following General Quarters sequence, where the player controls anti-aircraft guns shooting down enemy aircraft.</p><p>The next sequence is named Battle Stations and the player must aim and fire heavy guns to hit enemy ships before they inflict too much damage and eventually sink the player's own vessels.  Following this battle, the fleet must be maneuvered to the beach. </p><p>Upon reaching the Beach-Head level, tanks roll out and the player must keep these safe from enemy fire and obstacles while driving. In the Final Battle sequence, the Dictator is holed up in the fortress of Kuhn-Lin and 10 different targets on the fortress must be fired upon to destroy it.</p><p>The port for C16 and Plus/4 computers only contains the General Quarters, Battle Stations and Final Battle sequences.</p>"},{"name":"Beach-Head II: The Dictator Strikes Back","year":1985,"developer":"U.S. Gold","url":":Beach-Head II The Dictator Strikes Back!","filesize":27794,"score":6.8,"genres":"Action > Fighting > Shooter > Helicopter > Tank","desc":"<p>The Dictator from the first Beach Head game is back, but World War 2 is over. Giving himself a new name, \"The Dragon\", he seeks revenge against the victorious allied forces. To further these ends, he kidnaps hostages and brings them to his island fortress...</p><p>Controlling either the forces of the Allied Commander (J.P. Stryler) or the Dictator (The Dragon), you will have to perform objectives across four different sequences, each with different perspectives and controls.</p><p>In Sequence 1 \"Attack\", the allies invade the dictator's base with soldiers dropped from a helicopter. The allied forces must land their soldiers and then march them forwards taking cover at different walls. The dictator only has to shoot them down with a machine gun.</p><p>In Sequence 2 \"Rescue\", the hostages are being rescued. The player who controls the allies will use the machine gun to defend hostages as they cross the open courtyard. The dictator can deploy between four different weapons: Man on top of wall, Tank, Truck and Trap Door, only one of which is on the screen at any time.</p><p>In Sequence 3 \"Escape\", hostages are loaded onto the helicopters. The allied player will select how to place hostages on helicopters and then man the controls, avoiding attack. The dictator chooses the level of the automated defense and then aims his tanks at the helicopter. </p><p>In the final sequence, \"Battle\", the allied commander and the dragon finally encounter one another deep underground. They will toss poontas (throwing knives) at each other until only one is left standing.</p>"},{"name":"Beaky and the Egg Snatchers","year":1984,"developer":"Fantasy","url":":Beaky and the Egg Snatchers","filesize":24689,"score":"","genres":"Action > Platform > Shooter","desc":"<p>The Andromedan Armed Condors are a rare goggled breed of bird due to the fact that they breed and lay their eggs on the hostile planet Crackit. The local population called Eggsnatchers don't like the birds on their planet and so attempt to disrupt the breeding program by destroying the eggs that are laid. You are one such condor called Beaky who must try to protect the eggs so that they hatch and then make sure the chicks are protected from the various creatures. Beaky is full of magic shown by a bar on the bottom left of the screen and if Beaky touches a creature then this decreases but it does destroy the creature and if the bar empties then it is game over. Beaky also has the ability to spit to shoot and destroy the creatures. <em>Beaky and the Egg Snatchers</em> is a single screen game viewed from the side spread over various levels with each level split into three phases and the phases are, Egg Collecting, Egg Brooding and Chick Rearing:</p><p><strong>Phase One:</strong> On various platforms are ten eggs and they need to be put into your nest but the problem is that they cannot be picked up, so the only solution is to let Eggsnatchers appear and pick them up. You shoot the Eggsnatchers when they have an egg but they will drop the egg and you must collect the egg before it hits the ground or platform. Once an egg is caught, you turn yellow and you can place it in your nest. Any eggs that are taken by an Eggsnatcher or hit the ground/platform reappear again on it's original place on a platform. Once one egg is in the nest you can decide whether to move on to the next phase or keep collecting eggs as your magic bar doesn't increase on a new phase.</p><p><strong>Phase Two:</strong> You now have a nest with an egg or eggs in but you must keep the eggs warm while a timer counts down. A snowflake falls from the top of the screen over the nest and when shot turns into a droplet, when the droplet turns blue it can be shot because if the droplet or snowflake hits the nest then a temperature bar decreases and when it empties an egg is removed from the nest. A Froogle appears sleeping and must not be touched as it will disappear emitting a burst of dark magic which decreases your magic. When the Froogle wakes it bounces around dropping nitrogen bombs which decreases the temperature bar and if touched also decreases your magic. To remove the Froogle you can shoot a spinning disc when it moves above the Froogle which drops a nucleus which removes the Froogle. Once the timer bar has emptied then you move to the next phase.</p><p><strong>Phase Three:</strong> Your egg/eggs have hatched into a chick/chicks but the danger isn't over yet as the chick now needs feeding and protecting while a timer decreases. Each chick has a feed bar which decreases as the chicks get hungry and you must collect flying worms where you turn green and you can now feed the chick to keep the feed bar full. Also on screen is another Eggsnatcher which drops bombs on the nest decreasing the feed bar but these can be shot to remove them and if you touch one then your magic bar decreases. Once the time has emptied then the phase is complete and you move to the next level to start the process all over again but this time harder.</p>"},{"name":"Beamrider","year":1984,"developer":"Activision","url":":Beamrider","filesize":12452,"score":6.9,"genres":"Action > Behind view > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p><em>Beamrider</em> is a 3D arcade action game. You control a beam riding spaceship on a mission to clear 99 sectors of space from hostile aliens. The spaceship is located at the bottom of the screen and it can only stop on one of five beams. You are armed with both lasers and torpedoes; torpedoes are more powerful and can destroy more enemies compared to lasers, however you only get three per level. To complete a sector, you need to destroy fifteen white flying saucers. After all saucers are destroyed, the sector sentinel passes by which can be destroyed for extra points. Each even number sector up until sector 16 will add a new type of enemy to deal with. These additional enemies will just try to slow your mission, though, only the saucers need to be destroyed to advance. Occasionally a rejeuvinator will appear; if this is collected, you can earn an extra life. But be careful, because if you accidentally shoot the rejeuvinator it will turn into an enemy!</p>"},{"name":"Bear Bovver","year":1983,"developer":"Artic Computing","url":":Bear Bovver","filesize":17927,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p><em>Bear Bovver</em> stars Ted the Bear, proud owner of a new Sinclair electric truck, but not of a set of batteries for it. Parked outside a building site, he must climb to the top so as to retrieve a set of batteries. The area is patrolled, but you have some bombs to drop in the hope of snaring them. There is a Baby Bear Mode, which allows you to practice negotiating the platforms without coming under threat.</p>"},{"name":"Beatle Quest","year":1985,"developer":"Number 9 Software","url":":Beatle Quest","filesize":26673,"score":"","genres":"Adventure > Interactive fiction / text adventure > Puzzle elements","desc":"<p>Made with a program called The Quill, a text-adventure creation program, this game's story is based on a number of Beatles song lyrics.  Set in the year 2953, you are a Keeper of the Archives who takes care of Ancient Earth knowledge while space pioneers look for a New Earth to colonize. In your research, you come upon 'The Four Kings of EMI' and being fascinated you enter a computer simulation of a Beatles influenced world in 1960's Liverpool.</p><p>Through 150 locations you will adventure encountering   people and places from Beatles songs such as Maxwell who has a silver hammer, and Penny Lane.  Make sure to grab any food and drink as you go along as you must keep your health up.</p>"},{"name":"Beau Jolly 16K Value Pack","year":1984,"developer":""},{"name":"Beau Jolly 48K Value Pack","year":1984,"developer":""},{"name":"Bedlam (1983)","year":1983,"developer":"AWA Software","url":":Bedlam (1983)","filesize":7288,"score":"","genres":"Action > Shooter","desc":"<p>Bedlam is a top down maze shoot 'em up. It is set on the planet Bovryll, where you are trapped in an asylum and must escape by shooting the alien guards down. Enemies follow pre-planned paths so can be picked off in a strategic manner, especially as the early waves don't fire at you. The controls involve pressing the directional key once to face a certain direction, and a second time to make the move.</p>"},{"name":"Bedlam (1988)","year":1988,"developer":"Beam Software Pty. Ltd.","url":":Bedlam (1988)","filesize":51710,"score":5.5,"genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p><em>Bedlam</em> is a vertically scrolling space shoot’em-up.</p><p>Space fighter shoots patterns of swirling aliens and stationary cannons, collects extras and fights boss ships – <em>Bedlam</em> is ordinary shoot’em-up material, stretched out over 16 short levels and spiced up with your standard two-player option.</p><p>While ZX Spectrum and C64 see a genuine space shooter with full-screen backgrounds and level variations, CPC and DOS get bare-bone versions stripped down to Galaga level.</p>"},{"name":"Beginning of the End, The - Part 1","year":1992,"developer":"Zenobi Software","url":":Beginning of the End, The - Part 1","filesize":29983,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Text parser > Fantasy > Pre-Columbian Americas > Sci-fi / futuristic > Comedy","desc":"<p><em>The Beginning Of The End</em> is the third humorous text adventure of the Zikov Trilogy.</p><p>The player takes the role of Fred, the hero of the previous two episodes. The villain of the story is one Basil Hodgkins. Basil has made his way to the earth's core where The Machine Of Total Universal Control resides which, as we all know, is a device built by the Incas centuries ago. Basil has imprisoned the machine's keeper and is currently dismantling the device. <br> Meanwhile Fred is at school in a French class when he experiences an incredible a mind expanding moment. It seems the device reached out, looking for anyone who could help, and found Fred.</p><p>The object of the game is to;* Locate all parts of the machine, which are scattered through space and time</p><ul><li>return the parts to the centre of the earth</li><li>Free the machine's guardian</li><li>Rebuild the machine</li></ul><p>The game is in two parts. The player needs information from the end of part one to answer a question that allows them to start part two.</p>"},{"name":"Beginning of the End, The - Part 2","year":1992,"developer":"Zenobi Software","url":":Beginning of the End, The - Part 2","filesize":27902,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Text parser > Fantasy > Pre-Columbian Americas > Sci-fi / futuristic > Comedy","desc":"<p><em>The Beginning Of The End</em> is the third humorous text adventure of the Zikov Trilogy.</p><p>The player takes the role of Fred, the hero of the previous two episodes. The villain of the story is one Basil Hodgkins. Basil has made his way to the earth's core where The Machine Of Total Universal Control resides which, as we all know, is a device built by the Incas centuries ago. Basil has imprisoned the machine's keeper and is currently dismantling the device. <br> Meanwhile Fred is at school in a French class when he experiences an incredible a mind expanding moment. It seems the device reached out, looking for anyone who could help, and found Fred.</p><p>The object of the game is to;* Locate all parts of the machine, which are scattered through space and time</p><ul><li>return the parts to the centre of the earth</li><li>Free the machine's guardian</li><li>Rebuild the machine</li></ul><p>The game is in two parts. The player needs information from the end of part one to answer a question that allows them to start part two.</p>"},{"name":"Behind Closed Doors","year":1988,"developer":"Zenobi Software","url":":Behind Closed Doors","filesize":16942,"score":"","genres":"Adventure > Interactive fiction / text adventure > Fantasy","desc":"<p>In this notably quirky cult classic you take the role of The Balrog, a large gentleman just trying to enjoy his morning, who has been locked in an outhouse by some mischief makers. With only a pencil stub, your copy of the <em>Goblins' Gazzette</em>. Will Balrog make it out, perhaps to wreck havoc upon those that would dare pull a prank on you while in the safety of 'the smallest room'? Or will Balrog be trapped, with naught but the commode for company and solace in his old age?</p>"},{"name":"Behind Closed Doors .. The Saga","year":1989,"developer":"Zenobi Software"},{"name":"Behind Closed Doors 2: The Sequel","year":1988,"developer":"Zenobi Software","url":":Behind Closed Doors 2 The Sequel","filesize":21486,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Text parser > Adult > Comedy","desc":"<p><em>Behind Closed Doors 2: The Sequel</em> is the second in a series of short text adventures featuring Balrog and his gurgling innards.</p><p>In the first game Balrog was on the toilet, which is in a hut at the bottom of the garden, when someone locked him in. The object of that game was to escape.<br>In this game Balrog has recently over indulged at a meal, nay a veritable feast. laid on by the publisher of his games. He has urgent need of the toilet in the hut at the bottom of the garden, however when he gets there he finds some evil swine has locked it and has hidden the key. The object of this game therefore is to find a way inside.</p>"},{"name":"Behind Closed Doors 3: Revenge of the Ants","year":1989,"developer":"Zenobi Software","url":":Behind Closed Doors 3 Revenge of the Ants","filesize":26298,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Text parser > Fantasy > Adult > Comedy","desc":"<p><em>Behind Closed Doors 3: Revenge of the Ants</em> is the third in a series of short text adventures featuring Balrog and toilet related adventures</p><p>Bolrog's toilet is a hut at the bottom of his garden. In the first game Balrog was on the toilet when someone locked him in, the objective there was to find a way out. In the second game Balrog was locked out of the toilet and to find a way inside. Continuing the theme in this game Balrog has somehow offended the ants. When he settles down for a quiet session on the toilet with his crossword the ants superglue his backside to the toilet seat. The object of this game is to free Balrog and escape.</p>"},{"name":"Behold Atlantis","year":1991,"developer":"Zenobi Software","url":":Behold Atlantis","filesize":24020,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Text parser > Europe","desc":"<p><em>Behold Atlantis</em> is a text adventure set in Greece. The player takes the role of a tourist enthralled by the legend of Atlantis. This is you first time in Greece and you are determined to explore. By pure coincidence your dreams come true and you discover the entrance to the long lost kingdom. There you solve puzzles, rescue the king and generally save the day.</p>"},{"name":"Belegost","year":1989,"developer":"Cybexlab Software","url":":Belegost (Cz)","filesize":32360,"score":"","genres":"Adventure > Interactive fiction / text adventure > Fantasy","desc":"<p>An unlicensed Tolkien text adventure, this game sees players adventuring in the ancient Dwarvish realm of Belegost in search of the fabulous jewel Alqualamir. Gameplay is streamlined with use of icons to represent common verbs.</p><p>The original Spectrum version was available only in the Czech language; the new iPhone version allows a choice between Czech and English gameplay. Additionally, versions were released by OCSoftware for the Psion Series 3/3a and then NeXTStep in October of 1995, both in English.</p>"},{"name":"Beneath Folly","year":1987,"developer":""},{"name":"Benny Hill's Madcap Chase!","year":1986,"developer":"DK'Tronics","url":":Benny Hill's Madcap Chase!","filesize":20123,"score":"","genres":"Action > Side view > Fixed / flip-screen > Puzzle elements > Licensed","desc":"<p>The late comic's risque TV show usually saw him dashing around frantically chasing after scantily-clad ladies half his age and half his weight. Colour-clashing bras would lack beauty, however, so the licensed game instead sees Benny attempting to carry out 3 levels of work for the community (he was a nice guy at heart). Unfortunately, his generosity is misconstrued as theft, so you'll have to flee as quickly as possible.</p><p>On level 1 he is taking laundry from the clothesline to the laundry basket, item by item, avoiding the local busybody, on level 2 he gathers apples whilst being chased by a tractor, and on level 3 he collects bric-a-brac, much to the police's panic.</p><p>The graphics are large and blocky, using a similar style to Don Priestley's Popeye license for DK'Tronics. The gameplay takes place on 3 depths of each side-view flick-screen, with obstacles such as lamp-posts often blocking one of those levels, requiring a quick move into the screen. Contact with these obstacles costs time, which is vital when you're being chased to your target.</p>"},{"name":"Best of Beyond, The","year":1986,"developer":""},{"name":"Best of Clive and Les, The","year":1991,"developer":""},{"name":"Best of Elite: Vol. 1","year":1987,"developer":""},{"name":"Best of Elite: Vol. 2","year":1987,"developer":""},{"name":"Best of the Indies","year":1991,"developer":""},{"name":"Best of the Indies: Vol II","year":1991,"developer":""},{"name":"Bestial Warrior","year":1989,"developer":"Dinamic","url":":Bestial Warrior (Es)","filesize":28108,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform > Shooter","desc":"<p>Sagar, the biggest fortress ever known to man, had become a challenge for most of the mercenaries. Many had already died in the attempt to access Sagar.</p><p>Only one person, might be able to overcome the rocky system Kerman and enter the fortress. Krugger is his name, although most of his enemies know him as Bestial Warrior.</p><p>Armed to the teeth, he will enter into the system and will need of your guidance and help to reach their goal: finding the three parts of the C70-Magnum, a devastating weapon.</p><p>During the tour you can find objects that give greater power to your weapon, extra lives, temporary immunity and load cells, which are of great importance, as those allow you to pass from one level to another after finding the screen scroll.</p><p>The enemies are of different types, all fairly heavy and aggressive, specially these known as Bartoks, which guard the exists of the different sectors and require a lot of shots to be definitely killed.</p>"},{"name":"BeTiled!","year":2007,"developer":"The Mojon Twins"},{"name":"Beverly Hills Cop","year":1990,"developer":"Tynesoft Computer Software"},{"name":"Beyond Eldorado","year":1995,"developer":""},{"name":"Beyond the Ice Palace","year":1988,"developer":"Elite Systems Ltd.","url":":Beyond the Ice Palace","filesize":29010,"score":6.1,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>This platform romp has similarities to Ghosts 'N Goblins, sending you on a journey to defeat the forces of evil. You start the game with nine lives, and you'll need them although there are only 3 (large) levels, each finishing with a boss. All manner of monsters block your path and must be attacked with your horizontally-travelling daggers. Additional weapons can be collected, as can bonus orbs, and the chance to summon a spirit to attack for you on the toughest sections.</p>"},{"name":"Bierki","year":1987,"developer":""},{"name":"Biff","year":1992,"developer":"Beyond Belief","url":":Biff","filesize":25516,"score":"","genres":"Action > Adventure > Platform","desc":"<p><em>Biff</em> isn't a nice chimp as he keeps being rude to his Mother, but his Mother has had enough and kicked him out of the family home. Realising he has nowhere to sleep and is starting to feel cold, <em>Biff</em> has decided to be nice to his Mother by doing various tasks around the jungle and hopefully be allowed to come back home. In this flick-screen arcade adventure platform game, you must find and use various objects and place them in their correct locations to complete tasks which are told to you on the screen. The tasks need to also be done in the correct order so objects that are required next flash to let you know. As you explore the jungle there are various creatures and when touched will decrease your energy and when this is empty it is game over. Also on the screen is a percentage of the game completed.</p>"},{"name":"Big Ben Strikes Again","year":1985,"developer":"Artic Computing","url":":Big Ben Strikes Again","filesize":21255,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform > Puzzle elements > Contemporary > Europe","desc":"<p>Big Ben Strikes Again is a traditional arcade platform game with puzzle solving elements. The main goal is to collect certain objects and give them to specific people in exchange for information.</p><p>The game takes place in the Houses of Parliament, where a journalist from the Chronicle desperately tries to piece together a big story. The player plays as Ben, the journalist, and to gather material for the big story he will have to bribe the right people with proper gifts in exchange for leaked information. </p><p>The game also includes a level editor which allows you to make changes to the game's 20 screens. Any new screens created this way could be saved and then reloaded at a later date.</p>"},{"name":"Big Nose's American Adventure","year":1992,"developer":"Code Masters","url":":Big Nose's American Adventure","filesize":19839,"score":"","genres":"Action > Platform","desc":"<p>You are Big Nose the Caveman and for reasons unknown you have been transported through time and landed in modern day New York City. You have set up camp beside a zoo but you are appalled that the animals are kept in cages so you have vowed to set them free. In this platform game which scrolls in multiple directions when you move, you must traverse over three levels across the USA in Manhattan, The Wild West and the Golden Gate Bridge to save your animal friends. You must shoot or avoid other people and creatures that roam the level because when touched you lose one of three lives. A joystick or keyboard can be used to control your hero.</p>"},{"name":"Big Sleaze, The - Part 1","year":1987,"developer":"Piranha","url":":Big Sleaze, The - Part 1","filesize":29406,"score":6.7,"genres":"Adventure > 1st-person > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Interwar > Comedy > Detective / mystery","desc":"<p><em>The Big Sleaze</em> is a humorous text adventure which parodies the detective genre. It is set in the late 1930s and the player controls Sam Spillade, a stereotypical and not too bright private detective. The adventure begins when he gets a new assignment: finding the missing father of his pretty, female client. </p><p>The situations Spillade has to solve shift between standard problems, e.g. getting money, and absurd situations like an auto bomb placed by the neighbour's children. And why did a dog bring a check and a photograph into his office? Commands have to be typed in with the keyboard, but the parser only understand simple verb + noun combinations. In compensation, Spillard can make conversation to other people.</p><p>The game consists of three independent programmes which have to solved in linear order - the save game of the previous part has to be imported into the next. Also included is the satirical electronic magazine <em>Sceptical 3</em>.</p>"},{"name":"Big Sleaze, The - Part 2","year":1987,"developer":"Piranha","url":":Big Sleaze, The - Part 2","filesize":27649,"score":6.7,"genres":"Adventure > 1st-person > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Interwar > Comedy > Detective / mystery","desc":"<p><em>The Big Sleaze</em> is a humorous text adventure which parodies the detective genre. It is set in the late 1930s and the player controls Sam Spillade, a stereotypical and not too bright private detective. The adventure begins when he gets a new assignment: finding the missing father of his pretty, female client. </p><p>The situations Spillade has to solve shift between standard problems, e.g. getting money, and absurd situations like an auto bomb placed by the neighbour's children. And why did a dog bring a check and a photograph into his office? Commands have to be typed in with the keyboard, but the parser only understand simple verb + noun combinations. In compensation, Spillard can make conversation to other people.</p><p>The game consists of three independent programmes which have to solved in linear order - the save game of the previous part has to be imported into the next. Also included is the satirical electronic magazine <em>Sceptical 3</em>.</p>"},{"name":"Big Sleaze, The - Part 3","year":1987,"developer":"Piranha","url":":Big Sleaze, The - Part 3","filesize":30894,"score":6.7,"genres":"Adventure > 1st-person > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Interwar > Comedy > Detective / mystery","desc":"<p><em>The Big Sleaze</em> is a humorous text adventure which parodies the detective genre. It is set in the late 1930s and the player controls Sam Spillade, a stereotypical and not too bright private detective. The adventure begins when he gets a new assignment: finding the missing father of his pretty, female client. </p><p>The situations Spillade has to solve shift between standard problems, e.g. getting money, and absurd situations like an auto bomb placed by the neighbour's children. And why did a dog bring a check and a photograph into his office? Commands have to be typed in with the keyboard, but the parser only understand simple verb + noun combinations. In compensation, Spillard can make conversation to other people.</p><p>The game consists of three independent programmes which have to solved in linear order - the save game of the previous part has to be imported into the next. Also included is the satirical electronic magazine <em>Sceptical 3</em>.</p>"},{"name":"Big Trouble in Little China","year":1987,"developer":"Software Studios"},{"name":"Bigfoot","year":1988,"developer":"Code Masters","url":":Bigfoot","filesize":26636,"score":"","genres":"Action > Side view > Platform","desc":"<p>Footsy the Bigfoot has vowed to rescue his girlfriend, who has been locked inside a cage by a sadistic madman. To set her free, Footsy must blow the lock open using TNT, but the only problem with this is that there are two breaks in the cable that need to be repaired. So Footsy has to walk through a series of environments in an attempt to repair the cable. In the meantime, he has to jump over lava pools, throw rocks at swarms of bees, and eat spinach and fairy cakes to replenish energy he may lose along the way.</p>"},{"name":"Biggles - Timewarp","year":1986,"developer":"Dalali Software Ltd."},{"name":"Bimbo","year":1983,"developer":"Joe the Lion","url":":Bimbo","filesize":6343,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade","desc":"<p><em>Bimbo</em> is an arcade race/pursuit game where the player controls a rabbit (named Bimbo) in a multi-level maze race, hunting for carrots, while being pursued by black 'killer rabbits'.</p><p>(The game plays similar to a racing game, with rabbits instead of cars, and carrots instead of fuel.)</p><p>To slow the competitors down the player can drop green apples in their path, which they stop to eat. There is an energy bar you need to watch, as energy is used by moving, and if it runs out, you lose a life. To keep Bimbo's energy up, you need to find and eat carrots. Extra points are also given for eating clovers.</p><p>Each level has ten carrots hidden in a maze larger than the screen, and you use a carrot-radar to show their location. In addition to the killer rabbits, you have to watch out so Bimbo does not fall into pitholes in the maze. </p><p>Once all ten carrots are eaten, you get to the next level, and the number of enemy rabbits increase by one, up to a maximum of ten pursuers. </p><p>Every fourth level is without enemies, and you just race against the clock while finding the carrots.</p><p>Getting caught by a black rabbit, falling in a pit or running out of time also loses a life; you have five extra lives per game.</p><p>Scoring depends on how fast you found the carrots, and how many extra clovers you ate.</p><p>There is no hall of fame list, only a single high score to compare your current score with.</p>"},{"name":"Bingo","year":1984,"developer":"Tynesoft","url":":Bingo","filesize":13618,"score":"","genres":"Simulation > Board game","desc":"<p><em>Bingo</em> is a gambling game where four to 100 players can play each other with four Bingo cards on the screen and the idea is to fill a card to win money. Each card on the screen is made up of a 5 x 5 grid filled with random numbers between 1 to 99 except the middle square which has the next number called. The computer calls a random number and if a player has that number on their card then they press any key on the keyboard to blank the number out but if the keyboard isn't pressed then that number stays on the card. Once a card has a full line either up/down, left/right, diagonal or the four corners filled then the player presses B to call Bingo and they win the money. If Bingo is called incorrectly then the game keeps going. Before each game the players can choose how much they want to bet for each game with each player starting with £100. The speed of the computer calling the numbers can be adjusted (1 to 5 on the C64, 1 to 4 on the ZX Spectrum).</p><p>Each game has four lucky numbers and if they match the last four numbers called then an entry form is loaded and filled in with the cassette being sent off to the publishers. This is entered into a monthly draw to win £100 and a new copy of the game sent back to the owner.</p>"},{"name":"Biniax 2.0","year":2009,"developer":"Ubhres Productions","url":":Biniax 2.0 (Es)","filesize":10802,"score":"","genres":"Action > Puzzle > Fixed / flip-screen > Real-time > Turn-based > Direct control > Adult","desc":"<p><em>Biniax 2.0</em> is a remake of the Biniax 2 game, brought over to the developer's adult <em>Nanako</em> series. Nanako's hometown is surrounded by four powerful countries (Land of Canutoz, Realms of Tuberya, Desert of Kekhalo and Hills of Pasokhulo) whose queens continuously fight over the control over her village. Fed up with it she visits the Oracle just like in the previous game. He tells her such disputes can be resolved by playing the game Biniax. It has been used by their ancestors and the gods to settle disputes over land possession without bloodshed. Nanako takes on the challenge to defeat the four queens.</p><p>The game can be played in a regular mode, challenging another character, or in an endless mode. The game is played on a fixed-screen board with room for 35 blocks in a 5x7 layout. Blocks, made up out of two differently coloured pieces each, gradually drop down over the entire width of the field. The player controls Nanako holding a single piece with one colour and can freely move her around the board as long as there is room. To create a match the player moves the active piece directly into a block where one of the two pieces has that colour. Both pieces disappear and the player takes control of the remaining piece, with a different colour. This mechanic is used to clear a field and to prevent it from reaching the bottom which will lead to the end of the game.</p><p>After a certain number of moves an entire row drops in the field and the amount of moves left before the next drop is shown. When stuck and no further move is possible Nanako loses up to three pieces of clothing until she eventually has to surrender the game. The left side of the screen shows the queen Nanako is playing against. A round is won after a set amount of blocks, also displayed on the screen, is removed. The game then moves on to a new stage. Up to three to five boards need to be cleared to win an entire stage and the opponent on the left side of the screen loses a piece of clothing with each round won.</p>"},{"name":"Bionic Commando","year":1988,"developer":"Capcom Co. Ltd.","url":":Bionic Commandos","filesize":45765,"score":6.5,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Sci-fi / futuristic","desc":"<p>In <em>Bionic Commando</em> the player takes control of a soldier with a bionic arm that extends and contracts. The bionic arm allows the soldier to grab onto fixed objects and swing around and climb up levels — no jumping allowed! The arm also grabs opponents and pulls them towards the protagonist.</p><p>The player's mission is to storm the enemy's fortress and destroy the launch computer to prevent the enemy from using their doomsday weapon.</p>"},{"name":"Bionic Ninja","year":1989,"developer":"Zeppelin Games","url":":Bionic Ninja","filesize":20829,"score":"","genres":"Action > Side view > 2D scrolling > Fighting > Sci-fi / futuristic","desc":"<p>Aliens are attacking Icarus Earth Defence Base and within a hour and a half will occupy it, bringing bad news for the occupants of our planet. The solution is to send a android installed with the Oriental Disciplines of the East and destroy all the aliens over five levels to save Earth. You play the role of <em>Bionic Ninja</em> and you must use various martial arts as well as shruiken's and swords, to destroy or avoid the various occupants of the base. You are able to switch between any of the three attacking options by pressing the space bar at any time. If you are touched or shot by any of the enemy then you lose part of a power bar and if it empties then you lose one of five lives but extra power can be collected on the way. Each level is split into two sections and they must be completed within a time limit or it is game over.</p>"},{"name":"Birds and the Bees, The","year":1983,"developer":"Bug-Byte","url":":Birds and the Bees, The","filesize":11185,"score":"","genres":"Action > Side view","desc":"<p>A huge field of flowers is a hugely attractive prospect to Boris the Bee. He is willing to cope with the risks posed by birds and wasps in order to get some of that sweet sweet honey.</p><p>The fields are viewed from the side, and most contain flowers - contact with which will utilise them and add to your score. As you collect nectar, you must return to your honey pot to deposit it, He is limited in how much he can carry, and (unusually for a game of this vintage) is slowed down by carrying too much. Also, you must block off any bears to chase after your honey pot.</p>"},{"name":"Birds, The","year":1983,"developer":""},{"name":"Bismarck","year":1987,"developer":"Personal Software Services","url":":Bismarck","filesize":26858,"score":6.4,"genres":"Simulation > Strategy > 1st-person > Top-down > Real-time > Flight / aviation > Naval / watercraft > Historical events > World War II","desc":"<p>May 1941, operation Rheinübung. German battleship <em>Bismarck</em> is attempting to elude the Allied fleet in order to escape from the North Atlantic and be able to conduct shipping raids against Allied supply convoys. The player can take command of either the British or German side. You can conduct air searches on the map, read weather forecast, move your ships, fire their deck guns and torpedoes, control repairs during battle. You can also fly Fairey Swordfish and make a torpedo run. Germans win if Bismarck safely escapes south or returns to France after sinking enemy ships.</p>"},{"name":"Bismark","year":1983,"developer":"Argus Press","url":":Bismark","filesize":9523,"score":"","genres":"Strategy > Text-based / Spreadsheet > Fixed / flip-screen > Turn-based > Direct control > World War II > War","desc":"<p><i>Bismark</i> is a 1-player strategy game for multiple systems.</p><p>The player controls the British North Atlantic squadrons in the hunt for the Bismark.  The player has 13 turns, each encompassing 6 hours, to find and destroy the battleship before British forces have to return home to refuel.  </p><p>Each turn, the player moves their 12 naval groups, and all forces can move 2 areas per turn except Vian's destroyers which can move up to 3 per turn.  When all ships have moved, the player is informed if any vessels can see the Bismark.  During poor weather the Bismark is spotted if a ship is in the same position, and in fair or good weather the Bismark can be spotted from 1 space away.  The player further has 2 aircraft carriers, the Ark Royal and the Victorious, which can carry out airstrikes if within 4 spaces of the carrier and spotted.  </p><p>British ships will attack the Bismark if within range.  The Bismark always attacks first, and is the strongest vessel on the field, so multiple British ships must be brought to bear against the German vessel to sink it.  During battle, ships will fire continuously, and the player can break off combat if needed.  Combat occurs until one ship is sunk or one breaks away.</p>"},{"name":"Bitwa","year":1986,"developer":""},{"name":"Biz, The","year":1989,"developer":"Virgin Games","url":":Biz, The","filesize":20662,"score":"","genres":"Compilation","desc":"<p><em>The Biz</em> is a compilation containing three arcade conversions alongside a comic book license.- Batman: The Caped Crusader</p><ul><li><p>Double Dragon</p></li><li><p>Operation Wolf</p></li><li><p>R-Type</p></li></ul>"},{"name":"Black Beard","year":1988,"developer":"Topo Soft","url":":Black Beard","filesize":27183,"score":"","genres":"Action > Side view > Top-down > Arcade > Fantasy","desc":"<p>Red Beard, an old pal of Black Beard has stolen Black Beard's treasure map.You as Black Beard are furious about this and you enter Red Beard his ship. On board you have to roam around looking for the map.To open chests you must fire a bullet.You can collect several special potions that will give you new ammo, extra life etc.To prevent Red Beard's pirates to enter the ship you must use the torch to light the cannon and then you will find the map in the last chest.</p>"},{"name":"Black Hawk","year":1984,"developer":"Creative Sparks","url":":Black Hawk","filesize":19867,"score":"","genres":"Action > Top-down > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>You are piloting the Black Hawk plane through a series of island bases, each of which has hardware such as tanks, missile launchers and planes. Destroy these to maximise the enemy's Strategic Loss Factor.</p><p>The game is split into two sections, both of which scroll up the screen. In the first, you are in control of your missile camera, and must guide it over things to destroy by holding down fire to guide a shot and releasing to direct it. The second section is a Xevious-influenced scrolling shoot 'em up. You can't lose any of your 3 lives in the first section, but anything you do not successfully destroy during this will be out to get you in the second section.</p>"},{"name":"Black Hole, The","year":1983,"developer":"Quest Microsoftware","url":":Black Hole, The","filesize":6906,"score":"","genres":"Action > Top-down > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>A single-screen shooter, this game puts the player in control of a small spaceship at the left hand side of the screen. A black hole pulses in the centre of the screen whilst alien spaceships stream relentlessly up and down, appearing and disappearing at the top and bottom of the screen. With two long range guns (the bullets from which are bent towards or away from the black hole) and a short range gun (whose bullets are unaffected by the black hole), the player has 6 lives to rack up as high a score as possible against the continuous alien hoard, lives being lost any time the player's ship isn't able to avoid the impact of an incoming alien spaceship.</p>"},{"name":"Black Lamp","year":1988,"developer":"Firebird","url":":Black Lamp","filesize":30507,"score":7,"genres":"Action > Arcade > Platform","desc":"<p><em>Black Lamp</em> is a platform game in which you have to find and collect several colored lamps and bring them back, one by one, to a case located in the first room. There are also several types of bonuses to collect along the way, and many enemies and creatures (some flying) to fight off. The ultimate goal is to bring all the colored lamps back to the case, including the elusive Black Lamp.</p><p>The <em>Black Lamp</em> world is presented as a collection of rooms, all connected with ladders and/or doors, as well as outside areas where you must defend yourself by shooting or avoiding the attacking creatures.</p><p>The graphics are very sharp and colorful, and all fireplaces, candles and torches are animated.</p>"},{"name":"Black Magic","year":1987,"developer":"U.S. Gold","url":":Black Magic","filesize":21514,"score":"","genres":"Action > Role-playing (RPG) > Metroidvania > Fantasy","desc":"<p>For centuries, the people of MariGold have suffered under the rule of the Red Warlock, Zahgrim, making a once prosperous and happy place to live into an evil and depressive land. Zangrim had defeated the wizard Anakar the Wise by turning him to a stone statue before overthrowing King Tauraus. A hero is needed to defeat the evil warlock and return the peace and happiness back to MariGold - and you are that hero. You were an apprentice to a wizard called Goff but your training was cut short when he was killed by demons and with all the magic books destroyed your magic powers became limited. You have, however, discovered a parchment explaining that Anakar's six magical eyes have been scattered over the land and if returned to his statue, the secret on how to defeat Zahgrim will be revealed. You have to set out across the land looking for the eyes before making the journey to the warlock's castle and defeating him.</p><p><em>Black Magic</em> is an action game with role-playing elements. The main playing area is viewed from the side, with the screen scrolling in multiple directions when you move. You start your quest on the surface of the land as the class Apprentice, and you are armed with limited amounts of arrows and two types of spells, though more can be found as the game progresses. You must search the land on the surface and venture deep underground into areas connected by ladders on your quest. As you explore you will encounter many creatures, and if you are touched or shot by them you lose part of the health gauge; when it empties you die and it is game over. Food can be found scattered around and can be used to top up your health or stored on your person for later usage. </p><p>As you progress and complete tasks your experience points increase. Collect a certain amount of them and your class is promoted to Wizard and then to Sorcerer, before you become Necromancer, which is needed to defeat Zahgrim. The types of spells you have and use also increase when you move up a class. You will also encounter trapped prisoners who require freeing just by walking through them.</p>"},{"name":"Black Tiger","year":1990,"developer":"Capcom Co. Ltd.","url":":Black Tiger","filesize":24917,"score":6.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>You are a barbarian who must slay three dragons that descended from the skies and plunged the kingdom into darkness. You must go through several areas, destroying monsters that get in your way. Along the way, you will come across old men, which when rescued, will give you a range of items that include extra time, more vitality, or more coins, or they might sell you items, including armor upgrades, weapons, keys for treasure chests, anti-poisoning potions. But, as always, you need to collect coins, which can be obtained by destroying certain monsters or breaking a series of pots.</p>"},{"name":"Black Tower, The","year":1984,"developer":"Dollarsoft","url":":Black Tower, The","filesize":11566,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Puzzle elements > Text parser > Fantasy","desc":"<p><em>The Black Tower</em> is an illustrated or graphical fantasy text adventure.</p><p>There are many legends in this land but one stands above all, the legend of The Morjan Crystal. It is said by some that the crystal is the source of all evil and that when it is gone the land will be great once more. Others say the crystal protects the land and that without it all would wither and die. It is your task to travel to the Black Tower, solve puzzles, battle strange creatures and destroy the crystal.</p><p>This game is in two parts, &amp; to complete part two the player will need a code word that is provided at the end of part one.</p>"},{"name":"Blade Alley","year":1983,"developer":"Personal Software Services","url":":Blade Alley","filesize":16980,"score":"","genres":"Action > Behind view > Fixed / flip-screen > Real-time > Arcade > Shooter > Direct control > Space flight > Sci-fi / futuristic","desc":"<p>This game feels very much inspired by the game Buck Rogers, with some sprinkles of Star Wars on top. It's a semi 3D shooter, where you fly down down a trench, over a landscape, through a tunnel or through space and blast four different enemy types. It's all pretty simple and has only got six different stages. The game is also know under the name 3D-Ravijn.</p>"},{"name":"Blade Runner","year":1985,"developer":"CRL Group PLC","url":":Blade Runner","filesize":27001,"score":5.7,"genres":"Action > Side view > Top-down > Licensed","desc":"<p>Based on the movie of the same name. You have been assigned by the police force to track down and eliminate any replidroids that have landed on Earth. There are six types of replidroids, labeled Replidroid 1 through 6. The higher the number, the more intelligent it is.</p><p>The majority of the game is viewed from inside your skimmer, and inside of your skimmer are three displays that you need to pay attention to. The main display displays a radar view of your area, allowing you to navigate the streets in search of replidroids (which are represented by octagons with crosses inside them). To the right of this is a smaller display which shows the whole city and your position in relation to the replidroid's. Below this is a text readout giving information on the number and type of replidroids within the vicinity.</p><p>In the main display, your position is represented by a yellow cursor which you can use to navigate the streets with. If you find a replidroid, you can hover over it and press the fire button. Doing so will put you in pursue mode where you automatically land. </p><p>After you get out, you must hunt down said replidroid in a busy street. There is a scanner in which you can use to keep track of where it is. The replidroid is represented as a green square. The further you progress, the closer you are to them. If the replidroid gets out of range, your skimmer automatically picks you up, and you have to hunt down replidroids elsewhere. Once you catch up with it, you must match your position with theirs and shoot at them in order to get the bounty displayed in the status bar. Your scanner also shows oncoming traffic that must be avoided. What it does not show, however, is people which you must dodge. If you crash into people, the game ends.</p>"},{"name":"Blade Warrior","year":1988,"developer":"Code Masters","url":":Blade Warrior","filesize":25087,"score":"","genres":"Action > Side view > Fixed / flip-screen > Platform > Direct control > Fantasy","desc":"<p>In <em>Blade Warrior</em>, a flick-screen platform game, the titular hero must lay an undead demon to rest by finding the demon's skull and bringing it to an altar. Despite his name, the warrior cannot use his blade and can instead only evade the various enemies or lose a life upon touching them. His quest must be completed within 10 minutes. Before he can deliver the skull, a number of other items must be found and picked up in a certain order. What item to collect next is shown on the screen. The game features sampled speech upon dying or successfully collecting an item.</p>"},{"name":"Blasteroids","year":1989,"developer":"Image Works","url":":Blasteroids","filesize":27091,"score":7,"genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>As the name suggests, this arcade conversion updates the basic Asteroids gameplay. That means to say that the main gameplay consists of flying through single-screen wrap-around levels shooting at rocks, which split into smaller rocks when hit, eventually becoming small enough to disappear. </p><p>In this case the Asteroids are protecting Mukor, an evil being who is poisoning planets under the Colonising Corp’s control.Each level is split into either 9 or 16 sub-levels, which are chosen through a square in which any remaining level which is adjacent to the last level completed can be selected. There are 3 different ships (Speeder, Fighter and Warrior), which can be switched between at any time. Power-ups (including improved weapons, shield recharges and a faster thrust) can be collected by flying into them.</p>"},{"name":"Blazing Thunder","year":1990,"developer":"PAL Developments","url":":Blazing Thunder","filesize":29123,"score":6.5,"genres":"Action > Top-down > Shooter","desc":"<p>The main character in this old fashioned no frills shoot 'em up is a Rambo doppelganger, which the developers may have been lucky not to be sued over. The main player is surrounded by a large tank which moves around as if you are walking it Flintstones style.</p><p>Gameplay follows the usual pattern for Ikari Warriors-style games - kill off the bazooka-toting baddies, which emerge from hiding places or enter the screen in waves. You can do this by either shooting them or running them over with your tank. Parts of the scenery often block your path and need destroying. Once you clear the level you are confronted by a boss, which in the first level is an enormous tank which you have to disable the guns of.</p>"},{"name":"Blind Alley","year":1983,"developer":"Sunshine Books","url":":Blind Alley","filesize":5409,"score":"","genres":"Action > Top-down","desc":"<p>Blind Alley depicts a sport set nearly a millennium from now, in which you are in control of a spacecraft and must defeat opposing craft. Gameplay resembles the Tron Light Cycles game, being played out on a grid, with more and more ships as the game progresses. Each craft has its own motion trail, which remains on the screen throughout the game, and a round is lost by a ship which hits one of these trails or the screen border. Control is directional rather than rotational, so attempting to reverse is fatal. This version has no 2-player mode, but supports Kempston joysticks and runs within 16K of memory.</p>"},{"name":"Blind Panic","year":1988,"developer":"Martech Games Ltd.","url":":Blind Panic","filesize":19207,"score":"","genres":"Action > Platform > Puzzle elements > Shooter","desc":"<p>A planet has been condemned, and you are an engineer dismantling its mining facilities. It turns out that this decision is correct, as without warning its evacuation is ordered. Unfortunately, this leaves you with a limited amount of time to reach the top of the layers of platforms and ladders.</p><p>There are ladders to climb a level, gaps between ledges which need jumping, and doors which are either opened by local switches, or by colour-coded keys. Enemies fly around, but can be shot, even while you are on ladders.</p>"},{"name":"Blinky's Scary School","year":1990,"developer":"Zeppelin Games Limited","url":":Blinky's Scary School","filesize":26896,"score":6.8,"genres":"Action > Side view > Fixed / flip-screen > Platform","desc":"<p>The first of Blinky the ghost's two outings, the ghost with the most has to progress through a series of levels and remove the hazards left by ghost-busters (who aren't called Peter, Egon, Winston or Ray for licensing reasons). He does this by collecting the right objects to cast the all important spells.</p><p>The levels themselves are flick-screen and are layered with platforms. Making the task difficult are spiders, mice and the like - watch out in particular for the jumping frogs. Once the appropriate spells have been cast (involving lots of back-tracking to collect objects and bring them to the cauldron) the objects to make an underwater diving suit must be obtained.</p>"},{"name":"Blizzard Pass","year":1986,"developer":"Adventuresoft UK Ltd.","url":":Blizzard Pass","filesize":39123,"score":"","genres":"Adventure > 1st-person > Interactive fiction / text adventure > Fantasy","desc":"<p>In this game you play the role of a man who has to try and defeat an evil wizard. The game starts with you outside a castle in the middle of a blizzard and you need to get inside quick as every move you take lowers your body temperature until you freeze to death. The game is played by typing in a direction or action you want the character to perform. There is also graphics to show you the location.</p>"},{"name":"Blizzard Pass + H.A.R.D.","year":1986,"developer":""},{"name":"Blockade Runner","year":1983,"developer":""},{"name":"Blockbuster","year":1988,"developer":"Audiogenic Software Ltd."},{"name":"Blockbusters","year":1984,"developer":"Macsen Software","url":":Blockbusters","filesize":20525,"score":6.8,"genres":"Strategy > 3rd-person (Other) > Board game > Game show / trivia / quiz > Licensed","desc":"<p>Bob Holness hosted this fondly-remembered quiz show, in which students competed to answer enough questions correctly to complete a run of answers across the board. This was the latest and most sophisticated computer version of the concept.</p><p>The exact mechanics of the game have been customized slightly. You start by choosing a question, which are all represented by the first letter of the answer. You must 'buzz in' by pressing your letter to input the answer (don't worry about exact spelling). If you get the question wrong, the computer chooses a square (seemingly with no strategy). In two player games each player has their own buzzer, and a correct answer sees you choose the next question. A digitized version of Bob's face reads out the questions - just be careful if you get any where the answer is 'organism'...</p>"},{"name":"Blockbusters: Gold Run","year":1986,"developer":"Macsen Software","url":":Blockbusters Gold Run","filesize":24678,"score":"","genres":"Strategy > Game show / trivia / quiz > Licensed","desc":"<p>After winning a best-of-three match against an opponent, competitors in the TV quiz Blockbusters faced a Gold Run for prizes. Like the main game, this took place on a 5x4 grid of interlocked hexagons, each representing a question. Correct answers turn the hexagon to your colour, and incorrect answers turn it to the opposition colour (in this case, black, blocking your path). The big difference is that the questions are multi-word, with GEM perhaps representing Green Eyed Monster. In the early days players could go on to face 5 Gold Runs; in the later years it became 3 (probably because players who'd won so many standard games were more likely to win the big prizes). This home version is built around the same structure, and has 9 skill levels, dictating how much time you have.</p>"},{"name":"BlockZ","year":2020,"developer":""},{"name":"Blood Brothers - Part 1","year":1988,"developer":"Gremlin Lincoln","url":":Blood Brothers - Part 1","filesize":24850,"score":"","genres":"Racing / Driving > Arcade > Platform > Sci-fi / futuristic","desc":"<p>After their parents were killed and their village burnt to the ground on the planet Sylonia, Hark and Kren have sworn revenge on the people responsible, space convicts The Scorpions. Over time the friends have designed and made Skywalk Jet Bikes and various weapons, and are now ready to travel to The Scorpion's planet Scorpia and destroy the convicts. After becoming <em>Blood Brothers</em> they must explore the surface of the planet with their Jet-Bikes to find mine shafts which must be negotiated to find the convicts and kill them. One brother explores the mines, while the other finds the entrances.</p><p><em>Blood Brothers</em> is a combination of two games, a platform and flying game. The platform section is flick screen where you must avoid obstacles and shoot the baddies. The flying section sees you behind the Jet Bike flying into the screen. You must fly into the gaps in the walls looking for mine sections. You can't control the speed of the bike. You and a friend can control one of the brothers or you can control both by switching between the two. One brother is controlled by a joystick and the other by the keyboard.</p>"},{"name":"Blood Brothers - Part 2","year":1988,"developer":"Gremlin Lincoln","url":":Blood Brothers - Part 2","filesize":24833,"score":"","genres":"Racing / Driving > Arcade > Platform > Sci-fi / futuristic","desc":"<p>After their parents were killed and their village burnt to the ground on the planet Sylonia, Hark and Kren have sworn revenge on the people responsible, space convicts The Scorpions. Over time the friends have designed and made Skywalk Jet Bikes and various weapons, and are now ready to travel to The Scorpion's planet Scorpia and destroy the convicts. After becoming <em>Blood Brothers</em> they must explore the surface of the planet with their Jet-Bikes to find mine shafts which must be negotiated to find the convicts and kill them. One brother explores the mines, while the other finds the entrances.</p><p><em>Blood Brothers</em> is a combination of two games, a platform and flying game. The platform section is flick screen where you must avoid obstacles and shoot the baddies. The flying section sees you behind the Jet Bike flying into the screen. You must fly into the gaps in the walls looking for mine sections. You can't control the speed of the bike. You and a friend can control one of the brothers or you can control both by switching between the two. One brother is controlled by a joystick and the other by the keyboard.</p>"},{"name":"Blood Brothers - Part 3","year":1988,"developer":"Gremlin Lincoln","url":":Blood Brothers - Part 3","filesize":24660,"score":"","genres":"Racing / Driving > Arcade > Platform > Sci-fi / futuristic","desc":"<p>After their parents were killed and their village burnt to the ground on the planet Sylonia, Hark and Kren have sworn revenge on the people responsible, space convicts The Scorpions. Over time the friends have designed and made Skywalk Jet Bikes and various weapons, and are now ready to travel to The Scorpion's planet Scorpia and destroy the convicts. After becoming <em>Blood Brothers</em> they must explore the surface of the planet with their Jet-Bikes to find mine shafts which must be negotiated to find the convicts and kill them. One brother explores the mines, while the other finds the entrances.</p><p><em>Blood Brothers</em> is a combination of two games, a platform and flying game. The platform section is flick screen where you must avoid obstacles and shoot the baddies. The flying section sees you behind the Jet Bike flying into the screen. You must fly into the gaps in the walls looking for mine sections. You can't control the speed of the bike. You and a friend can control one of the brothers or you can control both by switching between the two. One brother is controlled by a joystick and the other by the keyboard.</p>"},{"name":"Bloodwych","year":1990,"developer":"Image Works","url":":Bloodwych","filesize":44656,"score":6.9,"genres":"Role-playing (RPG) > 1st-person > Fantasy","desc":"<p>The land of Trazere was once ruled by the powerful and benevolent organization of mages known as <em>Bloodwych</em>. Governed by the Grand Dragon, the Bloodwych supervised over the balance in the land, protecting it from evil and driving it to prosperity. However, the second-in-command of Bloodwych, named Zendick, turned against his group, banished his opponents to the astral plane, and began working on a mad plan - summon the ultimate evil, the Lord of Entropy. The player controls the champion of Trazere, whose ultimate goal is to stop Zendick and restore peace in the country.</p><p><em>Bloodwych</em> is an RPG in the style of Dungeon Master and Eye of the Beholder, being a 3D first-person maze-like game. This game's distinguishing feature is the two-player split screen support, allowing simultaneous playing on one computer.</p><p>Each player controls a party of four characters. The four basic classes are warrior, mage, adventurer, and thief; however, each class also has sub-classes, which are represented by four different colors. These colors come into play also when the characters learn and combine spells.</p>"},{"name":"Bloody Sands","year":2011,"developer":""},{"name":"Blue Max","year":1984,"developer":"U.S. Gold","url":":Blue Max","filesize":15934,"score":7.1,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Shooter > Flight / aviation > World War I","desc":"<p>The storyline is based on a fictional pilot, Max Chatsworth, being (in-game) one of Britain's Flying Aces.  Chatsworth's fame began in battle, when he was out on a reconnaissance mission, and his squadron was decimated by enemy planes.  The pilot survived, and in the process shot down seven enemy fighters.  He shot down thirteen more the next month.  For these actions, Germany offered their Blue Max medal to anyone who could shoot Chatsworth down—and Chatsworth got a new nickname—Blue Max.</p><p>As Blue Max, you go out on sorties—flying missions—attacking assigned targets.  Targets include bridges, buildings, enemy planes, tanks, bridges, anti-aircraft batteries, vehicles and ships.  You progress to new missions as you take out your targets.  Various settings can be adjusted before beginning play including control type (normal or pilot), skill level and whether gravity will affect the plane.</p><p>You must drop bombs to take out the ground targets, and this action also represents a key danger for you.  Unlike the modern bombers that drop bombs on targets far below, early aircraft engaged in semi-suicidal bombing runs.  The pilots started at high altitude, then tipped the planes nose downward towards their ground-based target, and pulled up before they hit the ground.  In the middle of the dive and pull up process, they released the bomb.  There were problems of coordination, found in the game as well—if you time it wrong, or start too low, you will crash.  You only have one life in this game.</p><p>If your plane is destroyed or you complete a mission a ranking is given which ranges from Kamikaze Trainee to Squadron Leader.</p><p>This game has aroused some controversy too, which supposedly caused it to be banned in Germany.  In the course of your missions, you end up bombing houses.</p><p>(The actual Blue Max/Blauer Max, is a nickname for the Prussian medal 'Pour le Mérite', first given to the pilots Max Immelmann and Oswald Boelcke. It required downing 8-20 enemy planes, with requirements increasing as the war progressed.)</p>"},{"name":"Blue Thunder","year":1984,"developer":"Richard Wilcox Software","url":":Blue Thunder","filesize":15837,"score":6.7,"genres":"Action > Side view > Arcade > Shooter > Helicopter > Sci-fi / futuristic > Licensed","desc":"<p><em>Blue Thunder</em> is a side-scrolling shooter and tie-in with the short-lived TV series of the same name which has you piloting a new 'jetcopter' as the only survivor of an alien assault.As it turns out, you're not alone after all, so you depart from your ship and fly across a sea full of heavily defended islands to reach the enemy stronghold, disable its defenses and rescue your comrades.</p><p>Should you succeed, you get to try it again at a higher difficulty level, where you'll face enemies with higher firing rates, planes, barrage balloons and missile-armed submarines. All the while you'll have to keep an eye on your dwindling fuel supply. Your jetcopter can fire at any angle it's flying, even straight down.</p><p>The C64 version scrolls in the opposed direction and has a few smaller differences in the environmental graphics. The Atari 8-Bit version was later re-released with a new TV show license (<em>Airwolf</em>) and a new helicopter model.</p>"},{"name":"BMX Freestyle","year":1989,"developer":"Code Masters","url":":BMX Freestyle","filesize":29465,"score":"","genres":"Sports > Side view > Top-down > Bike / bicycling","desc":"<p><em>BMX Freestyle</em> is a multi-event game where you and another player attempt six freestyle events on a BMX bike. Each event has a qualifying standard and must be completed before moving onto the next event. If all events have been completed then you repeat them with a higher qualifying standard. The joystick or keyboard is used to control your BMX. The events are:</p><p>Wheelies Trial: You must pull a wheelie and keep the wheel up for over 45 metres by holding right to lift the wheel and let it go to lower it. If two players are playing then the screen is split into two with both players attempting the event at the same time.</p><p>Ramp Jumps: Waggling left to right as fast as you can, you must approach a ramp and when on the ramp press fire to kick. You need to clear your friends lying on the ground and reach a distance of 16 meters or more. The screen is split into two for two players.</p><p>Half Pipe: You must ride up each side of the ramp and complete 13 turns within one minute, you hold left when moving left and right to move right. Each player takes it in turns to play.</p><p>Slow Race: You have to move towards a finish line but in the slowest time possible and have to finish over 45 seconds to qualify. You move left and right as gentle as possible without falling off the bike. Two players attempt the event at the same time.</p><p>1/4 Pipe High Jump: You hold right to approach half of a half pipe ramp and you must jump over 6 meters. When you are close to the highest height you can reach, you press fire to turn so you can land back down safely. Each player takes it in turn to play this event.</p><p>Tricks Track: You have one minute to pull off as many tricks as you can and the qualifying score is 2500 points. Every time you pull off a trick you see some judges giving you a score. Both players attempt this event at the same time.</p>"},{"name":"BMX Kidz","year":1988,"developer":"Firebird","url":":BMX Kidz","filesize":18327,"score":5.6,"genres":"Action > Sports > Side view > 2D scrolling > Bike / bicycling","desc":"<p>In this game, the player must compete against five BMX riders in a race against the clock. There are six tracks in the game, complete with stunts and wheelies that the player must accomplish in order to proceed onto the next track. Riding the bike causes energy to be lost, but soda cans can be collected to replenish it. Also, doing stunts causes the player to crash down hard, losing spokes (wheels). Replacement spokes, like the soda cans, can be collected along the way. The game ends when the player does not qualify, runs out of time, or has no spokes left.</p>"},{"name":"BMX Ninja","year":1988,"developer":"Alternative Software Ltd.","url":":BMX Ninja","filesize":18328,"score":"","genres":"Action > Racing / Driving > Sports > Side view > Fighting > Bike / bicycling","desc":"<p>As a top BMX gang member, members of a rival gang have attacked you. In order to protect your street cred, and thus keep your girlfriend interested in you (can't he get someone less superficial next time?), you must defeat them all.</p><p>The game scrolls sideways, and puts you on your bike with a spin attack to deal with enemy bikes, skateboarders and scooters. 8 bikes must be beaten to move onto the next level, however this total is reset if you lose a life. There are six different settings across the US, and you can choose to play in front of any of these from the main menu.</p>"},{"name":"BMX Racers","year":1984,"developer":"Mastertronic"},{"name":"BMX Simulator","year":1987,"developer":"Code Masters","url":":BMX Simulator","filesize":29354,"score":7.1,"genres":"Racing / Driving > Top-down > Arcade > Bike / bicycling > Track racing","desc":"<p>This is an overhead-viewed racing game similar in style to Super Sprint. There are 7 courses of increasing difficulty, incorporating ramps and bumps which significantly affect the bike's handling. Each course has a time limit you must complete 3 laps of the course within, or it's game over. The further inside the time limit you are, the more points you score.</p><p>There's a computer opponent, but the scoring isn't affected by whether you beat him just so long as you qualify. There is a two-player mode. A unique feature at the time is the action replay, which can be viewed in slow motion.</p>"},{"name":"BMX Simulator 2","year":1989,"developer":"Code Masters","url":":BMX Simulator 2","filesize":24978,"score":"","genres":"Racing / Driving > Top-down > Fixed / flip-screen > Arcade > Bike / bicycling > Track racing","desc":"<p><em>BMX Simulator 2</em> is a sequel to the game BMX Simulator. It still looks and plays like the first game but instead of two riders racing there are now four. Also instead of just one terrain there is now two, Dirt and Quarry. Dirt racing is still the same as the first game but Quarry racing is classed as expert and you can choose the thickness of your tyres and the chain wheel size. </p><p>The game is still viewed from above and the joystick steers your rider while the fire button speeds up and slows down the rider.</p>"},{"name":"Bob Morane: Science Fiction 1","year":1988,"developer":"Infogrames Entertainment SA"},{"name":"Bob the Space Janitor","year":2014,"developer":""},{"name":"Bob's Full House","year":1988,"developer":"TV Games","url":":Bob's Full House","filesize":18042,"score":"","genres":"Simulation > 1st-person > Game show / trivia / quiz > Licensed","desc":"<p>A game based on the UK's popular game show hosted by Bob Monkhouse called \"Bob's Full House\". Up to 4 players can compete in a mental test of general knowledge and trivia. Based on Bingo, players had to complete lines to win prizes and completely clear their board to win the game.</p>"},{"name":"Bobby Bearing","year":1986,"developer":"The Edge","url":":Bobby Bearing","filesize":23501,"score":7.4,"genres":"Action > Diagonal-down > Fixed / flip-screen > Isometric > Puzzle elements","desc":"<p><em>Bobby Bearing</em> is a young steel ball who lives in the land Technofear, carefully avoiding the dangerous Metaplanes. One day his evil cousin comes along and lures him and his four brothers directly into said Metaplanes and leaves them for good. So Bobby's quest of the day is to find his way home and rescue his brothers.</p><p>The Metaplanes are a big maze of isometric screens without scrolling. The main challenge is to find orientation in this maze with various dead ends and junctions; there are also lifts, magnets, air ducts and hidden switches to complicate matters. There are also enemies and traps to avoid, e.g. evil marbles, crushing blocks of stone or hard to navigate places with opportunities to fall off the screen. </p><p>When Bobby finds one of his brothers, Bobby has to roll him to the exit. There are no lives or energy bars to be found in this game: it simply has to be completed before time runs out. Dying or getting stunned by an enemy results in a time penalty. Similarly the player can easily restart a screen with a time penalty if he has manoeuvred himself into an unwinnable situation.</p>"},{"name":"Bobsleigh","year":1987,"developer":"Digital Integration","url":":Bobsleigh","filesize":26711,"score":6.8,"genres":"Action > Sports > Behind view > Arcade > Managerial / business simulation","desc":"<p>Ever wanted to go to the Winter Olympics? If you've always wanted to operate a bobsleigh team and even participate in the races, then this is the game for you. </p><p>The game starts off with the management side of things including training the team, buying equipment, and keeping those finances from the red. If you go bankrupt then it's game over. Going bankrupt can happen from spending too much money, crashing, or poor finishes. </p><p>When you start the race or season then it's time to start racing. The game is viewed from inside the bob behind the driver and brakeman. You steer the bob left and right (gravity controls the speed) as you watch the track hurtling towards you. You can see your speed and times as well. </p><p>Do well and you receive more money. This can go towards more training and better equipment.</p><p>Good luck for the season and hopefully you can get to the Olympics. Your gonna need all the luck in the world.</p>"},{"name":"Bog of Brit","year":1990,"developer":"Stormbringer Software","url":":Bog of Brit","filesize":28172,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Europe > Fantasy > Medieval","desc":"<p><em>Bog Of Brit</em> is a humorous text adventure.</p><p>Bog is a barbarian, one of a race of fierce warriors for whom pillaging a village or two is something to while away the time between wars, it is safe to say that barbarians were hated and despised throughout the civilised world. Bog was a different kind of barbarian. Bog was kind, gentle and good which meant that he had a terrible life - barbarian children would often set the warhounds on him for fun just to see how fast he could run. One day he'd had enough so he left the village and set off, warhounds at his heels, on a quest with four goals- to avoid being ripped to shreds- to a acquire a vast fortune- to find your lost family heirloom, the bloodthirsty Blade of the Bogs and- to slaughter hundreds of misunderstood animals and/or sorcerers</p><p>This game was developed using <em>Professional Adventure Writer</em>. It supports the standard shortcuts such as N/S/E/W for North/South/East/West as well as some more unusual commands such as MOUNT/DISMOUNT which allow Bog to ride a horse</p>"},{"name":"Boggit, The: Bored Too - Part 1","year":1986,"developer":"Delta 4 Software","url":":Boggit, The - Bored Too - Part 1","filesize":25303,"score":7.5,"genres":"Adventure > Text-based / Spreadsheet > Interactive fiction / text adventure > Text parser > Fantasy > Comedy","desc":"<p>After Bored of the Rings parodied JRR Tolkien's classic Lord of the Rings series, Delta 4 did the same thing with its predecessor The Hobbit, preceding New Line Cinema's identical sequence by 20 years. There is a logical 3-part structure to the adventure, but there are also jokes such as the Old Ford location on the map being near a New Ford - a new Ford Sierra car.</p><p>This interactive fiction with graphics game thus features reluctant adventurer Bimbo Faggins and devious magician Grandalf attempting to gain treasure, ultimately by appearing on a TV game show. VERB NOUN inputs are used for most instructions, although you have to TALK someone before SAYing anything to them. EXAMINEing objects is crucial to progress, and to finding the best jokes.</p>"},{"name":"Boggit, The: Bored Too - Part 2","year":1986,"developer":"Delta 4 Software","url":":Boggit, The - Bored Too - Part 2","filesize":24503,"score":7.5,"genres":"Adventure > Text-based / Spreadsheet > Interactive fiction / text adventure > Text parser > Fantasy > Comedy","desc":"<p>After Bored of the Rings parodied JRR Tolkien's classic Lord of the Rings series, Delta 4 did the same thing with its predecessor The Hobbit, preceding New Line Cinema's identical sequence by 20 years. There is a logical 3-part structure to the adventure, but there are also jokes such as the Old Ford location on the map being near a New Ford - a new Ford Sierra car.</p><p>This interactive fiction with graphics game thus features reluctant adventurer Bimbo Faggins and devious magician Grandalf attempting to gain treasure, ultimately by appearing on a TV game show. VERB NOUN inputs are used for most instructions, although you have to TALK someone before SAYing anything to them. EXAMINEing objects is crucial to progress, and to finding the best jokes.</p>"},{"name":"Boggit, The: Bored Too - Part 3","year":1986,"developer":"Delta 4 Software","url":":Boggit, The - Bored Too - Part 3","filesize":25599,"score":7.5,"genres":"Adventure > Text-based / Spreadsheet > Interactive fiction / text adventure > Text parser > Fantasy > Comedy","desc":"<p>After Bored of the Rings parodied JRR Tolkien's classic Lord of the Rings series, Delta 4 did the same thing with its predecessor The Hobbit, preceding New Line Cinema's identical sequence by 20 years. There is a logical 3-part structure to the adventure, but there are also jokes such as the Old Ford location on the map being near a New Ford - a new Ford Sierra car.</p><p>This interactive fiction with graphics game thus features reluctant adventurer Bimbo Faggins and devious magician Grandalf attempting to gain treasure, ultimately by appearing on a TV game show. VERB NOUN inputs are used for most instructions, although you have to TALK someone before SAYing anything to them. EXAMINEing objects is crucial to progress, and to finding the best jokes.</p>"},{"name":"Bogie's Super Pick: Value Pack 1","year":1988,"developer":""},{"name":"Boks","year":1987,"developer":"MiC Software"},{"name":"Bomb Fusion","year":1989,"developer":"PAL Developments"},{"name":"Bomb Jack","year":1986,"developer":"Tehkan Ltd.","url":":Bomb Jack","filesize":26202,"score":7.1,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p>In <em>Bomb Jack</em>, the player controls Jack, who must collect all the bombs in order to complete the current round and go onto the next one. This sounds easy, right? Wrong! Making Jack's task difficult are numerous enemies such as birds, mummies, turtles, and orbs.</p><p>In each round, collecting a number of bombs results in a bonus coin appearing, and collecting this coin will make the player's score increase 2 to 4 times. More often than not, the \"power ball\" appears, and when you collect this, you can defeat enemies and have more time to collect all the bombs. There is also the \"E\" coin, which gives Jack one additional life, but rarely does this coin appear.</p><p>The more you progress through the game, the more difficult it becomes, as enemies travel more quickly to get you.</p>"},{"name":"Bomb Jack II","year":1987,"developer":"Elite Systems Ltd.","url":":Bomb Jack II","filesize":30018,"score":6.2,"genres":"Action > Side view > Fixed / flip-screen > Arcade","desc":"<p>Having saved the world in the first game, Bomb Jack is out to collect as much gold as possible, which is lying on a number of ledges. These vary between open and shut - the open ones offer more points, and an extra life is on offer for collecting 10 in a row, so if possible the route should take in the open ones in order.</p><p>Gameplay differs from the original, in that Bombjack's movement is no longer free and self-propelled. Instead, he moves flick-style between ledges, so long as one is directly within one of the 4 compass directions. Baddies can be pushed off ledges, but this uses up some of Jack's limited energy.</p>"},{"name":"Bomb Scare","year":1986,"developer":"Firebird","url":":Bomb Scare","filesize":18393,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Isometric > Puzzle elements > Shooter > Sci-fi / futuristic","desc":"<p><strong><em>Bomb Scare</em></strong> is a single player maze based puzzle game.</p><p><strong>The Plot</strong>  </p><p>The game is set on Neptune where an enemy alien has planted a time bomb in the space station.The station has been evacuated and the player must neutralise the threat using a bomb defusing robot, ARNOLD. In order to accomplish this task, ARNOLD must first collect the necessary tools from those lying around the base. Then, when suitably equipped, the player must guide ARNOLD to the bomb in order to defuse it.Naturally the aliens will attempt to thwart this attempt whenever they can.  </p><p><strong>The Game</strong>  </p><p>The mission to defuse the bomb is time limited, a mission timer in the lower half of the screen counts down from 999. If ARNOLD runs out of time, energy, or lives the game is over and the bomb explodes destroying the entire planet</p><p>ARNOLD has six action keys. There are three movement keys, one key to move forwards and two others to rotate left or right, and three activity keys, pick up, select an object, and activate object.</p><p>The base consists of a series of rooms which map to a 16 x 9 grid, though not all the elements in the grid contain a room. There is no in-game map but the rooms are coloured to assist the player in keeping track of their location. The game also displays large arrows on the floor when there is an exit off-screen, and smaller arrows on the walls when there is an obvious doorway. Some doors only allow ARNOLD to pass through one-way.</p><p>There are eight tele-ports which allow ARNOLD to quickly move from one area of the base to another, but at the start of the game neither the player, nor ARNOLD, will have any operating instructions for them. </p><p>ARNOLD's inventory can hold five items. When an object is encountered the player positions ARNOLD over it and uses the 'Pick Up' key, the object then appears in the inventory list at the bottom of the screen. The player then has to work out what to do with each object and where, within the game, it is used.</p><p>As ARNOLD moves around the station he will encounter many small scurrying aliens. Some can be destroyed by running over them though this will sap ARNOLD's energy, others explode on contact and destroy ARNOLD. Points are scored for killing them, however ARNOLD only has a limited number of shots at his disposal.</p>"},{"name":"Bomber","year":1982,"developer":"Spectrum Computing","url":":Bomber","filesize":3913,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade","desc":"<p>City Bomber is a one-key arcade game, similar to Air Attack.</p><p>You pilot a small airplane, and your mission is to bomb the city so you can land safely. It is a one-key game, so you don't control the plane, you can only drop bombs by pressing the spacebar. The plane moves from left to right across the screen, and slowly descends every time it wraps back to the left side.</p><p>At the start of the game you can choose a skill level from 1 (easiest) through 5 (hardest), and an entry wave, also 1 through 5. A higher skill level means the buildings are higher, thus more bombs are needed before you can land. There are small empty spots to the left and right side of the city, so don't waste bombs on those spots.</p>"},{"name":"Bomber Bob in Pentagon Capers","year":1985,"developer":"Bug-Byte","url":":Bomber Bob in Pentagon Capers","filesize":20432,"score":"","genres":"Action > Arcade > Platform","desc":"<p>Arcade game, \"inspired\" by the arcade game of a similar name, popular at the time. Jump your caped superhero Bomber Bob around a series of 50 rooms in the Pentagon, avoiding meanies and collecting bombs planted by evil Kaptain Kleptor. Each room is titled with an appalling pun. Rooms have a time limit as well. Like many Speccy games of the time, it starts out very easy but quickly becomes insanely difficult.</p>"},{"name":"Bonanza Bros.","year":1992,"developer":"SEGA Enterprises Ltd."},{"name":"Bongo","year":1984,"developer":"Anirog","url":":Bongo","filesize":7728,"score":6.9,"genres":"Action > Platform","desc":"<p><em>Bongo</em> is a single screen platform game much in a similar vein as Popeye. You control Bongo the rat as he moves about the screen attempting to collect gems while avoiding the bad guy after him. You can teleport Bongo to various parts of the screen by positioning yourself on top of the letters in his name (B O N G O) and pressing the fire button. The screens contain ladders that can be traversed up and down, slides that will slide Bongo to the bottom and conveyor belts that can impede his movement or make him move faster. Only one gem is visible at a time. After five gems have been collected, Bongo rescues his girlfriend and moves on to the next screen. Bonus letters spelling out Bongo can also be collected.</p>"},{"name":"Book of the Dead - Part 1","year":1987,"developer":"CRL Group","url":":Book of the Dead - Part 1","filesize":31246,"score":"","genres":"Adventure > 1st-person > Interactive fiction / text adventure > Fantasy","desc":"<p>Life in the Other World was blissful for you, Kteth, a falcon headed Egyptian Godling, and your brothers and other Gods until your Father, Set decided to murder the great God Osiris to take his place. Osiris' son Horus though rose up and defeated your Father and threw him out of the Other World, while his relatives including you are banished to become mortal and live amongst men. As you are innocent in all this some Gods have decided to help you and so tell you about a nearly forgotten manuscript called the <em>Book of the Dead</em>. It describes how a mortal soul can travel after dieing, to the Other World, and is written in tomes, appears on tomb walls and is in the minds of some priests and beings. Horus has heard about the book and so has put a curse on yourself which gives you a crippling disease which will kill you long before you find all the text and undergo the rites of purification to get your soul back to being a Godling. As well as the book you have to find Gods who will help you by giving you a cure.</p><p><em>Book of the Dead</em> is a graphic text adventure where the screen has text describing your location while a picture shows you what you can see. You type in commands with the keyboard to interact with your surroundings and other people or Gods.</p>"},{"name":"Book of the Dead - Part 2","year":1987,"developer":"CRL Group","url":":Book of the Dead - Part 2","filesize":29876,"score":"","genres":"Adventure > 1st-person > Interactive fiction / text adventure > Fantasy","desc":"<p>Life in the Other World was blissful for you, Kteth, a falcon headed Egyptian Godling, and your brothers and other Gods until your Father, Set decided to murder the great God Osiris to take his place. Osiris' son Horus though rose up and defeated your Father and threw him out of the Other World, while his relatives including you are banished to become mortal and live amongst men. As you are innocent in all this some Gods have decided to help you and so tell you about a nearly forgotten manuscript called the <em>Book of the Dead</em>. It describes how a mortal soul can travel after dieing, to the Other World, and is written in tomes, appears on tomb walls and is in the minds of some priests and beings. Horus has heard about the book and so has put a curse on yourself which gives you a crippling disease which will kill you long before you find all the text and undergo the rites of purification to get your soul back to being a Godling. As well as the book you have to find Gods who will help you by giving you a cure.</p><p><em>Book of the Dead</em> is a graphic text adventure where the screen has text describing your location while a picture shows you what you can see. You type in commands with the keyboard to interact with your surroundings and other people or Gods.</p>"},{"name":"Boot Camp","year":1987,"developer":"Konami Industry Co. Ltd."},{"name":"Boots: 6 Game Action Pack","year":1987,"developer":""},{"name":"Booty","year":1984,"developer":"Firebird","url":":Booty","filesize":19098,"score":7.1,"genres":"Action > Side view > Fixed / flip-screen > Platform","desc":"<p>Like any good pirate ship, the old vessel upon which <em>Booty</em> is set is overloading with treasure and so the player takes the role of Jim the Cabin Boy as he tries to collect as much of it as he can. The ship is viewed side-on in a platform-type perspective, and contains 20 holds, each of which is split across 8 screens of treasure. Once the player has cleared each one they have 45 seconds to escape the hold and prepare for the next one.</p><p>The levels all feature lots of doors, each of which has its own key to open it - these are numbered. As only one key can be held at a time (pick another up and the first one returns to its original location), and many of the enemies are located behind doors, a great deal of strategy as to which order the keys are collected is required.</p>"},{"name":"Bop'N Wrestle","year":1986,"developer":"Beam Software Pty. Ltd."},{"name":"Bored of the Rings - Part 1","year":1985,"developer":"Delta 4 Software","url":":Bored of the Rings - Part 1","filesize":22162,"score":7.3,"genres":"Adventure > 1st-person > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Fantasy > Comedy","desc":"<p>No prizes for guessing the inspiration for this one. The Great Ring needs to be returned to Mount Doom, a treacherous task to be undertaken by Fordo the Boggit. Spam, Pimply and Murky are his country-bumpkin friends, and he will later meet with Bumbadil and Hashberry, two old hippies. The main quest involves meeting up with Legoland the Elf, Giblet the Dwarf and Aragont. </p><p>In keeping with the humour, familiar locations become \"the featureless plain below the pink mountain\", \"Lake Anadin\" and the \"Land of the Personal-Stereo-Wearing Goblins\".</p><p><em>Bored of the Rings</em> is an interactive fiction game with graphics made using Quill. The interface allows the player to take and use items using VERB NOUN commands, and talk to characters.</p><p>The game is split into three parts, accessed via passcodes. The tape also includes issue 1 of <em>Sceptical</em>, Delta 4's short-lived magazine on tape.</p>"},{"name":"Bored of the Rings - Part 2","year":1985,"developer":"Delta 4 Software","url":":Bored of the Rings - Part 2","filesize":21383,"score":7.3,"genres":"Adventure > 1st-person > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Fantasy > Comedy","desc":"<p>No prizes for guessing the inspiration for this one. The Great Ring needs to be returned to Mount Doom, a treacherous task to be undertaken by Fordo the Boggit. Spam, Pimply and Murky are his country-bumpkin friends, and he will later meet with Bumbadil and Hashberry, two old hippies. The main quest involves meeting up with Legoland the Elf, Giblet the Dwarf and Aragont. </p><p>In keeping with the humour, familiar locations become \"the featureless plain below the pink mountain\", \"Lake Anadin\" and the \"Land of the Personal-Stereo-Wearing Goblins\".</p><p><em>Bored of the Rings</em> is an interactive fiction game with graphics made using Quill. The interface allows the player to take and use items using VERB NOUN commands, and talk to characters.</p><p>The game is split into three parts, accessed via passcodes. The tape also includes issue 1 of <em>Sceptical</em>, Delta 4's short-lived magazine on tape.</p>"},{"name":"Bored of the Rings - Part 3","year":1985,"developer":"Delta 4 Software","url":":Bored of the Rings - Part 3","filesize":27893,"score":7.3,"genres":"Adventure > 1st-person > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Fantasy > Comedy","desc":"<p>No prizes for guessing the inspiration for this one. The Great Ring needs to be returned to Mount Doom, a treacherous task to be undertaken by Fordo the Boggit. Spam, Pimply and Murky are his country-bumpkin friends, and he will later meet with Bumbadil and Hashberry, two old hippies. The main quest involves meeting up with Legoland the Elf, Giblet the Dwarf and Aragont. </p><p>In keeping with the humour, familiar locations become \"the featureless plain below the pink mountain\", \"Lake Anadin\" and the \"Land of the Personal-Stereo-Wearing Goblins\".</p><p><em>Bored of the Rings</em> is an interactive fiction game with graphics made using Quill. The interface allows the player to take and use items using VERB NOUN commands, and talk to characters.</p><p>The game is split into three parts, accessed via passcodes. The tape also includes issue 1 of <em>Sceptical</em>, Delta 4's short-lived magazine on tape.</p>"},{"name":"Borzak","year":1984,"developer":"Channel 8","url":":Borzak (Es)","filesize":17216,"score":"","genres":"Action > Side view > Sci-fi / futuristic","desc":"<p><em>Borzak</em> has crashed his spcecraft on a strange marshy planet and to make matters worse, during the crash he managed to separate himself from his craft and must now attempt to get back to it over five levels. The game is viewed from the side as the screen scrolls constantly from left to right, and you must control Borzak by jumping over the many gaps and avoid the various creatures and obstacles. Borzak is equipped with Antigrav which allows him to jump great distances but he has no control over when he lands again but he is able to jump shorter distances. The speed of Borzak can be controlled and this will dictate the distance that Borzak travels. If Borzak falls into a gap or touches a creature or obstacle then you lose one of three lives and the starting level can be selected at the start of the game.</p>"},{"name":"Bosconian '87","year":1987,"developer":"Mastertronic","url":":Bosconian '87","filesize":20048,"score":"","genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>This older arcade game got a budget-priced home conversion. Fighting it out above the earth for a newly-reunited people, you must shoot out the alien craft to depend your people.</p><p>The game is a top-down shoot 'em up, with aliens to kill and rocks to destroy. Each wave has several Space Stations, and destroying these is the ultimate goal. A scanner helps you find these. </p><p>The ship can be brought to a stop, or flown in any of the four main directions. You must watch the fuel gauge, but extra fuel and improved weapons can be collected. There is a mothership which can be docked with for shielding.</p>"},{"name":"Boulder Dash","year":1984,"developer":"First Star Software Inc.","url":":Boulder Dash","filesize":12190,"score":7.6,"genres":"Action > Side view > 2D scrolling > Arcade > Puzzle elements > Direct control","desc":"<p>You are Rockford, and you have to dig through monster infested caves in search of diamonds. In each level you must collect a certain number of these diamonds, in order to open a portal to the next stage. Enemies can be squashed by falling boulders, which are released when the ground below them is removed or they are pushed onto empty ground, but be careful because these can also squash you. In later levels, difficulty is increased by many puzzle elements and shorter time limits.</p><p>There are 16 levels to be completed and five different skill levels available, which affect the number of jewels which must be collected and the time limit.</p>"},{"name":"Boulder Dash II: Rockford's Revenge","year":1987,"developer":"Prism Leisure Corporation","url":":Boulder Dash II - Rockford's Revenge","filesize":14932,"score":7.9,"genres":"Action > Top-down > Arcade > Puzzle elements","desc":"<p>In part two of the Boulder Dash series the overall game design hasn't changed compared to the original, but sixteen new levels have been created. The basis of the game is the same, you still have to mine diamonds while avoiding falling rocks and cave monsters of all sorts. As in part one, later levels become more difficult because many puzzle elements are added.</p>"},{"name":"Boulder Dash III","year":1986,"developer":"Prism Leisure Corporation","url":":Boulder Dash III","filesize":12411,"score":"","genres":"Action > Side view > Puzzle elements > Direct control","desc":"<p>The third part of the popular series, Boulder Dash III adds a sci-fi spin to the graphics (called MetalGrafik), with Rockford now wearing a spacesuit and running through a more futuristic setting.</p><p>Other than that, the 16 new scenarios are similar in gameplay to the levels of Boulder Dash I and II: Rockford still digs through a series of caves to retrieve diamonds. Once he has enough diamonds, a portal opens that takes him to the next stage. Obstacles in the caves include boulders, monsters which will kill Rockford upon touching them (but which can be eradicated by crushing them with falling boulders - some of the monsters then release a number of diamonds), and green slime that spreads through the entire cave and blocks pathways. Additionally, every level has a time limit. Several puzzle elements add variety to the game, such as walls which will turn falling boulders into diamonds.</p>"},{"name":"Boulder Dash: Construction Kit","year":1988,"developer":"First Star Software Inc.","url":":Boulder Dash Construction Kit","filesize":21773,"score":8,"genres":"Action > Side view > Arcade > Puzzle elements > Direct control","desc":"<p>Rockford returns in another <em>Boulder Dash</em> adventure which contains 15 new levels, in addition to the easy-to-use game editor. Players can build, save, and play their own levels. The software includes a feature to sequence your levels on a separate game disk.</p><p>All of the elements and hazards from the previous <em>Boulder Dash</em> outings are back: The fireflies, butterflies, growing amoebas, enchanted walls, and of course, the boulders. New features include titanium (indestructible) walls, growing walls, and slime that allows boulders and diamonds to drop through it at a varying rate.</p>"},{"name":"Bounces","year":1986,"developer":"Denton Designs","url":":Bounces","filesize":21497,"score":7.1,"genres":"Action > Sports > Side view > Fixed / flip-screen > Sci-fi / futuristic","desc":"<p><em>Bounces</em> is a futuristic sports game. Two players (one of which can be computer-controlled), compete against each other in order to earn points. Each game consists of two halves of 90 seconds each, one from each side of the screen. The winner is simply the player with the most points at the end.</p><p>There are two ways of earning points. The first is to catch the bouncing ball that bounces around the arena and throw it through the goal slots on the opponent's side of the screen. The further into the opponent's half of the screen the slot is, the more points it is worth, but the more difficult it is to get the ball into; particularly as each player is attached to their side of the screen by a wire. The second way to earn points is to knock the other player down, either with characters' fists or with the ball. Being knocked down reduces stamina, as does straying too far into the other player's side of the screen or colliding with the wall each player is attached to. If either player runs out of stamina they are unresponsive until they recover.</p>"},{"name":"Bounder","year":1986,"developer":"Gremlin Graphics Software Limited","url":":Bounder","filesize":24510,"score":7.4,"genres":"Action > Strategy > Top-down > Arcade","desc":"<p>In <em>Bounder</em>, the player controls a tennis ball that constantly bounces on the screen. </p><p>The player has to move the ball around between two bounces so it lands on friendly areas like grass or the main hexagonal-patterned floor. If it lands on hazardous areas like spikes and sand, or hits the enemies which move around, one of the seven lives the player starts with is lost. There are beneficial squares though - arrows which keep the ball in the air longer or teleports which clear part of the game. </p><p>The 174 screens are divided into 10 levels - at the end of each of these there's a bonus screen.</p>"},{"name":"Bounty Bob Strikes Back!","year":1985,"developer":"U.S. Gold","url":":Bounty Bob Strikes Back!","filesize":30234,"score":7.1,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform > Puzzle elements","desc":"<p><em>Bounty Bob Strikes Back!</em> is the sequel to Miner 2049er and features similar gameplay. As Bounty Bob, your goal is to claim every inch of 25 challenging mines. To do this, you must walk over each segment of the framework in the mines. To reach each segment of framework, you will need to figure out a way to jump, climb, or use one of the many devices occasionally available to get there. To your help you get around (or sometimes hinder progress) are ladders, slides, suction tubes, cannons, transporters, and other devices. Wandering about the mines are many dangerous mutants. If you come in contact with one of these, you will lose a life. Scattered throughout each mine are special food items; collect one of these, and you will temporarily be able to eliminate the mutants by walking into them. You will need to figure out a unique strategy for each level in order to complete it, plus there is a time limit so claim all the territory quickly!</p>"},{"name":"Bounty Hunter, The","year":1989,"developer":"Code Masters","url":":Bounty Hunter, The","filesize":23208,"score":"","genres":"Adventure > Interactive fiction / text adventure > Sci-fi / futuristic","desc":"<p>You are a Bounty Hunter and you have beamed down to the planet Karakata with your starting point being Bodholm Downs armed with a pulsar. Your mission is to explore the planet and kill a certain amount of Viroid's before you can be beamed back home and get your payment. <em>The Bounty Hunter</em> is a text adventure where the screen has text describing your location and you type in commands with the keyboard to interact with your surroundings.</p>"},{"name":"Boyd File, The","year":1991,"developer":"Zenobi Software","url":":Boyd File, The","filesize":29551,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Detective / mystery","desc":"<p><em>The Boyd File</em> is a text adventure with the occasional picture.</p><p>This is a detective story set in Hollywood or someplace similar. The player takes the role of Luthor Bailey, a typical down-at-heel private eye who's hired by a John Ford to find his missing sister Betty Boyd. The tone of the game follows the American gumshoe novel throughout, for example the missing woman is described as \"...a dame of about twenty-five. She had thick, blond, curly hair and a face that could have been nice with a smile on it.\", and when the game performs an action such as TAKE GUN it often responds with \"OK MAC\".</p><p>It was written with the Graphic Adventure Creator and supports the standard shortcuts such as N/S/E/W/U/D for North/South/East/West/up and Down. Some areas of the game have to be completed within a set number of moves, if the player takes too many turns then they will find they come to a dead end.</p><p>When completed correctly the player will score 180 points.</p>"},{"name":"Bozxle","year":2011,"developer":"Polomint  UK","url":":Bozxle","filesize":20218,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Direct control","desc":"<p>Bozxle is an unofficial conversion of Boxxle (a variant of Soko-Ban) for the ZX-Spectrum. The player must push around crates to put them into designated spots, requiring careful planning to prevent any of them from getting stuck.</p>"},{"name":"Brain Damage","year":1983,"developer":"Paxman Promotions","url":":Brain Damage","filesize":7148,"score":"","genres":"Action > Top-down > Fixed / flip-screen > Tank > Sci-fi / futuristic","desc":"<p><em>Brain Damage</em> is a tank game that is similar to the Battle Tanks game in the Tron arcade game. Like in Tron the game takes place inside a computer and the player's proton panzer has to be navigated through different mazes where it will come across three different kinds of enemies: electron panzers, marauders, centurians and rogue programs, each progressively smarter. Each maze is one screen in size and to finish it the player has to kill one or several enemy tanks. The tank's turret is controlled individually from the movement and projectiles can ricochet off walls and thereby hit an enemy around a corner. At the easiest difficulty one hit is enough to destroy the tanks but the same is true for the player's. On harder difficulties more hits are required to take out an enemy.</p>"},{"name":"Brainache","year":1987,"developer":"Code Masters","url":":Brainache","filesize":27163,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Sci-fi / futuristic","desc":"<p>The crew of interplanetary mining vessel ROTAR 1 have finished their mission in the STELLA mines on planet NESBIT, when their hapless crewman Harry 'Brainache' Jones realises he has left his equipment behind. Jones senses an opportunity to prove everyone wrong about him and lose his nickname, by returning to NESBIT and not only retrieving his equipment but also locating the fabled ANATESE diamond. As Jones, the player of this action game must pass challenging screens with hostile plants and mutated creatures - these must be avoided as Jones has no gun. Controls allow the player to take and drop objects, and climb ladders where appropriate Each item must be carried back individually, but other required equipment such as ladders can be carried alongside it. Jones has limited oxygen, and must escape before this expires.</p>"},{"name":"Brainstorm","year":1987,"developer":"Firebird","url":":Brainstorm","filesize":14356,"score":"","genres":"Action","desc":"<p><em>Brainstorm</em> is a game where the aim is to get a high enough score on a screen that beats the score you received on the last screen you played when a timer reaches zero. The screen consists of a large square shown on the whole screen full of different coloured shapes with a ball bouncing around. You have to draw lines to bounce the ball into any red shapes while avoiding magenta ones which increases or decreases your score when the ball is inside the shape. Green shapes make the ball appear elsewhere on the screen and blue and black ones don't have any effect.</p><p>Beside the main playing area there is a box with your score, last score, the timer and three coloured lines. The line colours are cyan, yellow and white and you select one to start drawing your lines. Press the fire button on the playing area and a line will appear from a small line matching the colour and draw itself to where you pressed the fire button. The ball will bounce off the line you have just drawn hopefully hitting red shapes. You can also make a line change direction but the line can only be a certain length before the start of the line disappears. </p><p>Once the timer reaches zero and you beat the last screens score you move to the next screen but it is game over if the score is less. There are three skill levels to choose from which allows you to draw more than one line on screen and even have two balls to contend with. You are also able to choose to start from every 6th screen out of 26 screens. The joystick or keyboard can be selected.</p>"},{"name":"Brat Attack","year":1988,"developer":"Sinclair User","url":":Brat Attack","filesize":18926,"score":"","genres":"Action > Side view > Arcade","desc":"<p>This is a game made exclusively for Sinclair User magazine by the developers of Joe Blade and Deviants.</p><p>The plot of this game is something - there are ten babies waiting to be rescued in all, but before you get them you have to pick up the dummies lying on the floor by just running across them. To increase your bonuses there are power punches dotted about the maze.</p>"},{"name":"BraveStarr","year":1987,"developer":"Probe Software Ltd.","url":":BraveStarr","filesize":25062,"score":5.9,"genres":"Action > Side view > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>The planet of New Texas is similar to the Wild West-era Texas - mystic Indians, bar-room brawlers and sharp-shooting mercenaries. The only man tough enough to keep order in such a place is Marshall Bravestarr. Stampede is the villain of the piece; he aims to bring the dead back to life as zombies for his own use.</p><p><em>BraveStarr</em> is a side-scrolling action title based on the popular 80's space western cartoon series. Starting with a limited amount of time, you must find and rescue Shamen who was captured by the evil Tex Hex, to aid Stampede's plans. You get nine minutes to complete your task.</p><p>The game begins in Fort Kerium in front of the bar. You can enter buildings to talk to people and examine rooms. Outside, you must jump around, shoot enemies and collect various power-ups they drop. Marshall BraveStarr has only one life - when he takes damage, he loses time instead of life energy.</p>"},{"name":"Braxx Bluff","year":1984,"developer":"Micromega","url":":Braxx Bluff","filesize":19634,"score":"","genres":"Action > Simulation > 1st-person > Flight / aviation > Sci-fi / futuristic","desc":"<p>As a Life Corps volunteer, you have been sent to the planet Prolon, following a distress call from the team of explorers currently charting the region. First of all, you must safely land your ship on the landing strip, by paying attention to the angle the craft descends at, and keeping it in line with the smooth terrain.</p><p>Once this has been accomplished, you must walk around the planet searching for their life pod, and take it back to the ship. This must be done within a time limit, as the pod's life support system is failing. In both these sections you will score more points if your direction is correct (with 8 points the requirement for a clean landing in section one) - this acts as both a reward and a guide.</p>"},{"name":"Break Away","year":1983,"developer":"PROCOM","url":":Break-Away","filesize":6574,"score":"","genres":"Simulation > 3rd-person (Other) > Puzzle elements","desc":"<p><em>Break-Away</em> is a puzzle game In which the object is to score points by freeing the damsel in distress.</p><p>She's held captive by 15 bonds each of which has a letter or a number at each end. To free her the player must enter the correct pair of letters and numbers before the game time expires.It sounds simple but the bonds overlap and many letters and numbers, such as V, W and U, do look alike. In addition the damsel does shout for help at random intervals and this is represented by a large red block with the letters 'HELP!' which effectively hides the bonds making it impossible to trace which bond goes to where.</p><p>As soon as one level is completed there's a brief 'Thank you' message and the player is presented with another screen. With each new screen the player has progressively less time to solve the puzzle.</p><p>The game keeps track of the current score and the best score this session.</p>"},{"name":"Break Dance","year":1987,"developer":""},{"name":"BreakThru","year":1986,"developer":"U.S. Gold","url":":Breakthru","filesize":32305,"score":4.6,"genres":"Action > Racing / Driving > Diagonal-down > Arcade > Shooter > Automobile","desc":"<p><em>BreakThru</em> is a 2D side-scrolling vehicle shooter. Your mission: race, jump, and blast your way through five levels (mountains, bridge, plains, city, and airfield) of enemy defenses to recapture the stolen jet fighter. A host of enemy soldiers, mines, vehicles, and aircraft will try to stop you, though. Oh yeah... and don't forget to watch out for those rocket attacks and falling rocks!</p>"},{"name":"Brian and the Dishonest Politician - Part 1","year":1992,"developer":"Zenobi Software","url":":Brian and the Dishonest Politician - Part 1","filesize":26599,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Comedy","desc":"<p><em>Brian And The Dishonest Politician</em> is a humorous text adventure. Brian Ramsbottom is pretty sure that Garth Pitchfork, this year's candidate for the seat of Lower Ruddleston, is dodgy. Some would say he's as bent as a big bent thing. So in the run up to the elections he decides to stand against Gareth Pitchfork. The thing is Garth is promising big things for Lower Ruddleston, to whit a massive donation to 'Haemorrhoid Research'.</p><p>This is a two part game. At the start of part two, the player is asked a question about something that happens at the end of part one. In part one the player must help enough of the local residents to get the ten votes needed to win the election and in part two you must gather the evidence needed to convict Garth Pitchfork.</p><p>This game was developed using <em>Professional Adventure Writer</em>. It supports the standard shortcuts such as N/S/E/W for North/South/East/West as well X for EXAMINE.</p>"},{"name":"Brian and the Dishonest Politician - Part 2","year":1992,"developer":"Zenobi Software","url":":Brian and the Dishonest Politician - Part 2","filesize":25095,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Comedy","desc":"<p><em>Brian And The Dishonest Politician</em> is a humorous text adventure. Brian Ramsbottom is pretty sure that Garth Pitchfork, this year's candidate for the seat of Lower Ruddleston, is dodgy. Some would say he's as bent as a big bent thing. So in the run up to the elections he decides to stand against Gareth Pitchfork. The thing is Garth is promising big things for Lower Ruddleston, to whit a massive donation to 'Haemorrhoid Research'.</p><p>This is a two part game. At the start of part two, the player is asked a question about something that happens at the end of part one. In part one the player must help enough of the local residents to get the ten votes needed to win the election and in part two you must gather the evidence needed to convict Garth Pitchfork.</p><p>This game was developed using <em>Professional Adventure Writer</em>. It supports the standard shortcuts such as N/S/E/W for North/South/East/West as well X for EXAMINE.</p>"},{"name":"Brian Bloodaxe","year":1985,"developer":"The Edge","url":":Brian Bloodaxe","filesize":27481,"score":6.2,"genres":"Action > Side view > Platform","desc":"<p>Brian Bloodaxe is a viking who has been stuck in an ice block for hundreds of years. After the ice has thawed out, Brian vows to conquer Britian, but little does he know he woke up in 1983. Brian must wander through 100 locations looking for the Crown Jewels and sit on the throne. Objects are scattered throughout each location, and Brian needs to figure out their purpose. Monsters – such as ducks, Daleks, Mad Scotsmen, and Turkish soldiers – roam each location making Brian's task of getting these objects difficult. Up to three objects can be carried at any one time, and they can be used to block the path of monsters or to make extra platforms. The objects do not fall when dropped, making it easier for Brian to leap across blank areas. Getting the correct objects in the correct places is a daunting task.</p>"},{"name":"Brian Clough's Football Fortunes","year":1987,"developer":"CDS Microsystems","url":":Brian Clough's Football Fortunes","filesize":12602,"score":7.4,"genres":"Sports > Board game > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p><em>Brian Clough's Football Fortunes</em> is a football management computer board game suitable for two to five players. </p><p>Each player takes on the role of a club manager. The object of the game is for each manager to successfully steer his team through the season using his skill to make his team stronger as the game proceeds. Each manager competes with human and computer controlled teams in a ten strong league and the F.A. Cup. From the second season onwards, each team will also enter a European competition (League Champions to the European Cup, F.A. Cup Winners to the Cup-Winners’ Cup, and the remaining clubs will go to the UEFA Cup). </p><p>The winner of <em>Brian Clough's Football Fortunes</em> is the manager who survives to the end of the game and has the highest number of game points. Game points are points awarded by the computer program, based on each managers performance in League and Cup competitions and on the amount of cash the player has left at the end of the game.</p>"},{"name":"Brian Jacks Superstar Challenge - Part 1","year":1985,"developer":"Martech Games","url":":Brian Jacks Superstar Challenge - Part 1","filesize":16457,"score":"","genres":"Action > Sports > Side view > Top-down > Football (European) / Soccer > Bike / bicycling > Licensed","desc":"<p>This is a multi-event sports game licensed by British judoka and 1972 Olympic bronze medallist Brian Jacks and loosely based on the BBC sports programme Superstars. In this game you compete against Brian in eight different events and you score points in these events based on your performance. The events are Running, Archery, Cycling, Football, Swimming, Squat Thrusts, Canoeing and Arm Dips. There is no qualification time/score to beat and you compete in all events regardless of performance. The game plays in a number of levels and should you score more points than Brian you win the level and move onto the next one where the process is repeated. Afterwards the scores from each level are combined for a total score, should Brian score more points than you at the end of any level then you will lose the challenge.</p><p>The Amstrad and ZX Spectrum versions are split into two sides of four events each. The Running, Archery, Cycling and Football events are in side A and after you've competed in those events you are given a choice of starting again or loading side B, which contains Swimming, Squat Thrusts, Canoeing and Arm Dips. The Commodore 64 version allows a two-player option to play against a friend.</p>"},{"name":"Brian Jacks Superstar Challenge - Part 2","year":1985,"developer":"Martech Games","url":":Brian Jacks Superstar Challenge - Part 2","filesize":14183,"score":"","genres":"Action > Sports > Side view > Top-down > Football (European) / Soccer > Bike / bicycling > Licensed","desc":"<p>This is a multi-event sports game licensed by British judoka and 1972 Olympic bronze medallist Brian Jacks and loosely based on the BBC sports programme Superstars. In this game you compete against Brian in eight different events and you score points in these events based on your performance. The events are Running, Archery, Cycling, Football, Swimming, Squat Thrusts, Canoeing and Arm Dips. There is no qualification time/score to beat and you compete in all events regardless of performance. The game plays in a number of levels and should you score more points than Brian you win the level and move onto the next one where the process is repeated. Afterwards the scores from each level are combined for a total score, should Brian score more points than you at the end of any level then you will lose the challenge.</p><p>The Amstrad and ZX Spectrum versions are split into two sides of four events each. The Running, Archery, Cycling and Football events are in side A and after you've competed in those events you are given a choice of starting again or loading side B, which contains Swimming, Squat Thrusts, Canoeing and Arm Dips. The Commodore 64 version allows a two-player option to play against a friend.</p>"},{"name":"Brian the Novice Barbarian","year":1994,"developer":""},{"name":"Brick, The","year":1989,"developer":"Delta Software S.L.","url":":Brick, The (Es)","filesize":16348,"score":"","genres":"Action > Strategy > Arcade > Paddle / Pong","desc":"<p><em>The Brick</em> is an Arkanoid clone embodied in the interior of a mechanic system. As such, you will have to help the racket (in this case, a nut), to impulse the ball in order to break as much bricks as possible, although there would be others that will be indestructible by your hit. To make your work more complex, there will be some flying enemies that will modify the trajectory of your ball and in the worst of the cases even shot at you, thus reducing your energy bar. In order to avoid being defeated by these creatures, you have one laser which just one projectile that recharges itself occasionally, so you will have to use it wisely too.</p>"},{"name":"Bride of Frankenstein","year":1987,"developer":"39 Steps","url":":Bride of Frankenstein","filesize":26299,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Puzzle elements > Horror > Licensed","desc":"<p>You are alone in Castle Frankenstein...well, you're the only person here, anyway. Scattered about the castle and its grounds are lungs, hearts, kidneys, and brains your beau Franky needs. You must use the joystick to move around the castle and find the parts that are needed. You must also locate keys to unlock doors. But beware, for while you may be the only person here, there are other dwellers within, such ghosts and skeletons. If they touch you too much, you will have a heart attack and die.</p>"},{"name":"British Super League","year":1989,"developer":"Cult Games"},{"name":"Bronx Street Cop","year":1989,"developer":"Supersonic Software Ltd."},{"name":"Broodslayer","year":1984,"developer":"CCS","url":":Broodslayer","filesize":11444,"score":"","genres":"Action > Top-down > Fantasy","desc":"<p><em>Broodslayer</em> is an arcade adventure viewed from above with the screen showing a small part of the surrounding area with the screen scrolling when you move. You play the role of a warrior in a territory called the Outland, whose quest is to find the nest belonging to a Broodsmother and destroy her thus stopping her Broodlings from overrunning the land. The land is made up of plains, rivers, forests and swamps, with a Labyrinth of Chaos to explore as well as dark tunnels, temples and towers which contain items to collect and use. </p><p>As you explore you will encounter Broodlings who fire venom at you, and you have to press a number on your keyboard to use your shield to match the direction of the venom. If you use the shield then the venom bounces off and kills the Broodling, if you don't use the shield in time then you lose part of your power and the Broodling disappears. If your power reaches zero or you walk into a wall then it is game over but your progress can be saved. You are armed with a sword and this is needed to defeat the Broodsmother when her nest is located.</p>"},{"name":"Bruce Lee","year":1985,"developer":"U.S. Gold","url":":Bruce Lee","filesize":22299,"score":7.7,"genres":"Action > Side view > Fixed / flip-screen > Platform > Martial arts > Licensed","desc":"<p>The late martial arts hero features in this platform game, with the aim of reaching a wizard in an underground lair, defeat of whom can offer him untold wealth. </p><p>In each area you must collect the many strategically-placed lanterns before exiting through the newly-revealed passageway. Some rooms also have escalator-type sections to run along, and the standard (although slightly illogical in this context) ladders.  There are 20 areas to be completed.</p><p>On the way, you'll fight two enemies - a ninja and a green sumo warrior named Yamo. You can defeat them by punching, kicking, dropping on their heads or luring them into hazardous terrain, or even by making them accidentally hit each other. Even after they are killed, however, they keep coming back for more after a few seconds. The game also allows a second player to take control of Yamo.</p><p>There are lots of hazards to avoid by either walking round or jumping - walls of electrical charge and exploding bushes for example.</p>"},{"name":"Brum Brum","year":1984,"developer":"Astor","url":":Brum-Brum (Pt)","filesize":10528,"score":"","genres":"Strategy > Top-down > Managerial / business simulation","desc":"<p><em>Brum Brum</em> is one of the earliest Formula 1 management games. Six teams compete; anything from one to six players can take part in guiding them to glory. Before each race you can buy upgrades and repairs to components such as the engine, chassis and suspension. Races are viewed from a top-down perspective of the start-finish line. After each race, extra points and funds are awarded based on the result.</p>"},{"name":"Bubble Bobble","year":1987,"developer":"Firebird","url":":Bubble Bobble","filesize":30914,"score":7.9,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p><em>Bubble Bobble</em> is the story of two humans, Bub and Bob who wander into the mysterious cave of monsters and magically turn into dinosaurs. The only way to transform back is to reach the end of the cave...</p><p><em>Bubble Bobble</em> is a platform game, with each level being a single screen. The enemies must be cleared from a level to go to the next one. With one player controlling Bub and the other controlling Bob, the player can jump and collect items for points (such as fruit). The real power Bub and Bob have however is the ability to blow bubbles. These bubbles can be as platforms to leap on, or to trap enemies. Enemies trapped in a bubble must be popped by jumping into them, wherein they'll turn to fruit. Additionally, power-ups sometimes float by in bubbles. They include lightning, which flies out horizontally at enemies, and water, which drags the player and enemies straight down flowing over platforms. Taking too long to complete any level will summon Baron Von Blubba, who will float around the screen trying to destroy the player.</p><p>The NES version has a few extra stages bringing the total number of stages to 112. The Sharp X68000 version contains a hidden minigame called Sybubblun. It contains a set of 20 original difficult levels with the game being reskinned with a Syvalion theme.</p>"},{"name":"Bubble Dizzy","year":1991,"developer":"Code Masters","url":":Bubble Dizzy","filesize":35177,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Bubble Dizzy</em> eschews the usual arcade adventure format of Dizzy games, instead being a simple action game.</p><p>You must guide Dizzy through the underwater worlds, collecting pearls as you go. Dizzy starts at the bottom of the sea, and you have to get him to the top. You do this by jumping across bubbles, which only have a limited time before bursting. Enemies to avoid include sharks, octopuses and swordfish. Dizzy has limited oxygen, but more can be collected from O2 canisters. </p><p>After completing a level, you get a bonus for the amount of pearls you collected and the amount of oxygen you have left.</p>"},{"name":"Bubble Trouble","year":1982,"developer":"Arcade","url":":Bubble Trouble","filesize":14057,"score":"","genres":"Action > Top-down > Fixed / flip-screen > Arcade","desc":"<p>Bubble Trouble is an arcade maze style game in which the main goal is to collect all of the objects present in the scenario during a specific period of time. Each scenario corresponds to a different level. While collecting the objects, the player has to avoid contact with some moving big bubbles which will chase him when his presence is detected. If a collision occurs one of the player's lives is wasted. The number of bubbles and the period of time a scenario has, both vary depending on the level of difficulty chosen before the game was started. By order of difficulty: Novice (one bubble / 60s); Intermediate (two bubbles / 90s); Expert (three bubbles / 120s).</p><p>To complete a level it's imperative to acquire at least all of the objects present in the scenario during the mentioned periods of time. Only then, the player can start accumulating points which will randomly appear in the maze in the form of collectable objects. These \"objects\" start to appear in a succession of pairs of 200, 500, 700 and 1000 points. After all the points in the double succession are picked up, a question mark shows up on a random point of the maze. If successively picked it will allow the player to immediately finish the level without having to wait for the rest of the necessary time to pass the level.</p>"},{"name":"Bubbler","year":1987,"developer":"Ultimate Play The Game","url":":Bubbler","filesize":27541,"score":7.4,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Puzzle elements > Fantasy","desc":"<p>The wizard tyrant Vadra has enslaved the inhabitants of the ancient city of Irkon and made them into immobile blobs.To further strengthen his grip of the city, he has created giant bottles that spew magical bubbles that create mutant enemies that enforce his control. His former assistant Kintor has given you the ability to move and created magical corks that can be used to close the bottles to lessen Vadra's grip. Your task is to cork the bottles and overthrow the evil wizard.</p><p>The player controls a blob or bubble that can roll, jump, use chutes and elevators to move around a 3D system of platforms, towers and slopes. Enemies can be shot with mini bubbles, crabs spawn from generators and bubbles come from the bottles, five of which have to be corked on each level allowing the player to exit it. Since the player bubble has no features, a directional gauge is used to determine the facing of the bubble to show movement direction.</p>"},{"name":"Buccaneer","year":1985,"developer":"Insight Software"},{"name":"Buck Rogers: Planet of Zoom","year":1985,"developer":"U.S. Gold","url":":Buck Rogers Planet of Zoom","filesize":18608,"score":6,"genres":"Action > Behind view > Arcade > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Buck Rogers: Planet of Zoom</em> is a single player science fiction themed obstacle race, where the player controls Buck Rogers' space ship and must guide it through multiple pairs of pylons throughout the game. Controlling the ship involves side scrolling to the left or right, stop, moving forward (and faster), and moving backwards/break (and slower). Additionally, the spaceship can also fire its weapon to unleash a pair of energy bolts.</p><p>The player starts in sector 1.0 and will finish this level after the player successfully goes between an allocated number of pylons, indicated at the top left side of the screen; the first requirement is 9 pylons and will gradually increase with each new sector. In sector 1.1., with the addition of having to complete the pylon requirement, a group of flying saucers, ranging from 1 to 4 (per group), fly in a pattern. The player must avoid these flying saucers by maneuvering out of their way or by shooting them down. In sector 1.3., a new type of robot spaceship (at least one) will fly erratically and attempt to crash into the player's space ship (due to the marvel of technology of that era, enemy ships that disappear from one side of the screen, will emerge on the other side of the screen). Later sectors will gradually introduce more difficult challenges.</p><p>The game ends when the player loses all three lives by crashing into (or being crashed by, it seems sometimes) pylons or enemy space ships. Although there is no penalty in avoiding pylons altogether, the game will also end if the allocated amount of time (indicated by a long bar at the top center screen) runs out. The player may increase speed to move faster, which will present maneuverability challenges in itself. The overall score increases by distance traveled, pylons traveled through, and enemy spaceships shot down. The latest score and the high score are saved and shown in the main menu.</p>"},{"name":"Budokan: The Martial Spirit","year":1991,"developer":"Electronic Arts Inc."},{"name":"Buffalo Bill's Wild West Show","year":1989,"developer":"Tynesoft Computer Software"},{"name":"Bug Eyes","year":1985,"developer":"Icon","url":":Bug Eyes","filesize":15272,"score":"","genres":"Action > Side view > Fixed / flip-screen > Platform","desc":"<p>You play Agent Starman, your job is to avoid the destruction of civilization and taking over the galaxy by the bug-eyed Xabanneus alien hordes. Then penetrate the ten levels of the Mother ship and destroy the power generator. He carries on its back an oxygen supply (represented by the energy bar on top) and an alien repulsion mechanism that will sometimes activate in times of danger.Another game following the success of Manic Miner. The game is quite simple, move thru each level until reaching level 10, avoiding all the bug eyed aliens, negotiating bridges and moving platforms. You only use 2 keys - left and right - to control the main character, so most of the gameplay revolves around timing and practice.</p>"},{"name":"Bugaboo the Flea","year":1983,"developer":"Quicksilva","url":":Bugaboo the Flea","filesize":11698,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>A Flea arrives on board of a space probe to the Cebolla-7 planet, which is an intricate labyrinth of caverns. The objective is to find the exit of each maze-like level. It isn't so easy, as the player must ascend very carefully, avoiding protruding rocks and branches, taking care to not fall (which forces the player to start again from the ground level). The only enemy here is a Pterodactilous that will do everything it can to devour the flea. It is not always present, but when it attacks, the flea must avoid it.</p>"},{"name":"Buggy Blast","year":1984,"developer":"Firebird","url":":Buggy Blast","filesize":32302,"score":"","genres":"Action > 1st-person > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The planet Endra has been overtaken by the Lurgons and been under their control for over three centuries. The Lurgons are a race of sentient robotic lifeforms dedicated to the obliteration of all organic life.  </p><p><em>Buggy Blast</em> is a first person 3D shoot 'em up where you as the pilot are tasked to make it to Central Lurgon Corridor and cause a power reversal that will consume the entire Lurgon complex.  </p><p>You control the 'buggy', a space/ground attack vehicle, fitted with weapons and a force shield. Once launched from the mother ship you enter one of the corridors, blasting away the robotic scum and jumping over obstacles. When energy levels are low, you can launch back into space to dock with the mother ship to replenish the energy. Once docked the ship's computer will determine your status and if you have scored enough points it will send you to the next corridor.</p>"},{"name":"Buggy Ranger","year":1990,"developer":"Dinamic","url":":Buggy Ranger (Es)","filesize":28084,"score":6.2,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Year 2019, in a post-apocalyptic world, we must fight versus the evil machines that destroy our planet... This is the plot of <em>Buggy Ranger</em>, a side-scrolling shoot'em up, very similar to the \"jeep stage\" of one of the most famous titles of Dinamic, Army Moves.</p><p>The main difference, is that in this case, the turret of our vehicle, can fly and shoot in the air at the enemies.</p>"},{"name":"Bugsy - Part 1","year":1986,"developer":"CRL Group","url":":Bugsy - Part 1","filesize":28285,"score":6.8,"genres":"Adventure > 1st-person > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Interwar > Crime","desc":"<p>You are <em>Bugsy</em>, a giant rabbit whose ambition it is to be Public Enemy No.1 in the city of Chicago in place of Al Capone. Starting with nothing, you have to work your way up the pecking order by any means necessary including theft, extortion, murder, bribery and other illegal means. </p><p>The game is a graphic text adventure where you read text describing your location while a picture shows what you are looking at. You type in commands with the keyboard to interact with each location. If you interact with someone you have various options like insult, bribe and protect.</p>"},{"name":"Bugsy - Part 2","year":1986,"developer":"CRL Group","url":":Bugsy - Part 2","filesize":28113,"score":6.8,"genres":"Adventure > 1st-person > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Interwar > Crime","desc":"<p>You are <em>Bugsy</em>, a giant rabbit whose ambition it is to be Public Enemy No.1 in the city of Chicago in place of Al Capone. Starting with nothing, you have to work your way up the pecking order by any means necessary including theft, extortion, murder, bribery and other illegal means. </p><p>The game is a graphic text adventure where you read text describing your location while a picture shows what you are looking at. You type in commands with the keyboard to interact with each location. If you interact with someone you have various options like insult, bribe and protect.</p>"},{"name":"Bulbo and the Lizard King","year":1987,"developer":"Zenobi Software","url":":Bulbo and the Lizard King","filesize":30385,"score":"","genres":"Adventure > Text-based / Spreadsheet > Fixed / flip-screen > Interactive fiction / text adventure > Text parser > Fantasy","desc":"<p><em>Bulbo And The Lizard King</em> is a fantasy text adventure from Zenobi Software, it features Bulbo Biggun who also appears in Zenobi's Hobbit parody An Everyday Tale of a Seeker of Gold.</p><p>There's not a great deal of backstory to this game. The player takes the role of the hero Bulbo Biggun who's visited at home by The Grand Alf. Alf gives Bulbo a crystal dagger and says 'Use this to defeat the old tyrant Stratos' and that's it. What makes this game unusual is that Bulbo then pops down to the marketplace to recruit one or more companions, a giant, an elf, an archer, a wizard, a dwarf, a thief and a swordsman are waiting.</p><p>On the B side of the cassette is something called 'Heroes and Villains' which is an illustrated guide to some of the characters in the game. It's also available on the +3 disc version as a menu option.</p><p>This game was developed using <em>Professional Adventure Writer</em>. It supports the standard shortcuts such as N/S/E/W for North/South/East/West as well as X for EXAMINE, I for Inventory and so on. P for PARTY tells the player who is accompanying them at any point in the game. The game will also accept more complex commands, the examples given are 'TAKE HOLD OF THE DONKEY' and 'LOWER THE DONKEY DOWN THE WELL'.</p>"},{"name":"Bulge, The: Battle for Antwerp","year":1985,"developer":"Choice Software"},{"name":"Bullseye","year":1984,"developer":"Mastertronic","url":":Bullseye","filesize":15162,"score":4.8,"genres":"Simulation > 3rd-person (Other) > Board game > Game show / trivia / quiz > Licensed","desc":"<p>A computer game version of a famed TV quiz show based around the game of darts. The computer version features 2 players, both human-controlled - on TV there were 3 teams of 2 (one amateur darts player and one to answer questions).</p><p>The first round uses a custom board which is split both inwards (4 separate grades representing 30, 50, 100 and 200 points respectively) and around (10 sections lettered A-K, representing a different subject each). The first player must choose a category to aim at, and shoot a dart at it. If they hit one of the sections for that letter, they get that score and are asked the question. If they hit another category they get no bonus but are asked that question - if it's still there. Each players gets 3 goes at this, with increasingly tough questions worth 30, 50, 100 points.</p><p>Round 2 involves each player throwing 3 darts at a standard board, with the player who scores the most getting asked a question, with the value of the darts on offer. If they get it wrong, the other player gets a chance, for the points THEY scored. This is repeated 3 times.</p><p>After these 2 rounds, the player who is in front gets to aim at a board with 8 black segments, 8 red ones and the bullseye. The bully scores 50 points, the others reds score a randomly-selected value between 15 and 45, the blacks score zero, and hitting a red for the second time loses you that prize - hence the presenter's catchphrase \"keep out of the black and into the red, nothing in this game for 2 in a bed\".</p><p>Once the player has finished the round, they choose whether to gamble their score against the final Prize Board. 101 points must be scored in 4 darts (in the TV show it was 6 - 3 for each player).</p>"},{"name":"Bully's Sporting Darts","year":1992,"developer":"Alternative Software Ltd.","url":":Bully's Sporting Darts","filesize":21440,"score":6,"genres":"Simulation > Sports > 1st-person","desc":"<p>Do you like to play darts? Would you like to have the opportunity to play darts on your computer? Here is your chance.</p><p>This game offers seven scoring styles such as Golf, Cricket, and the normal 501 scoring style. Choose how you want to score the game and hop right in and play. Aim your dart with your joystick or keyboard, then let it fly and hope you hit something good!</p><p>The game automatically scores for you so if you do not know how to score a dart game, you can still play. Knowing what you should aim for is helpful for getting high scores, however.</p><p>The darts games included in this package are:* <strong>501</strong>  </p><p>This is the classic darts game where both players start with 501 points. Scores are reduced by the amount each player scores when it's their turn to throw. A leg ends when one player reduces their score to zero by hitting a double. A game is the best of three legs.</p><ul><li><strong>Round the Clock</strong>  </li></ul><p>The player must hit each number in turn, starting at one and ending with the bullseye. A game is the best of three legs.</p><ul><li><strong>Football</strong>  </li></ul><p>In this timed game, the number of each segment plays no part on this game.Each player has a designated 'goal' area. Players take it in turns to hit a sequence of beds progressing towards the opponents goal. The winner is the player who has scored the most goals when time is up.</p><ul><li><strong>Tennis</strong>  </li></ul><p>The player serving must hit doubles, the player receiving must hit trebles.A bed is highlighted on the board, this is the 'tennis ball'. The server has two chances to hit their designated bed to 'serve' the ball. If they are in successful the point goes to the receiver. If they are successful the receiver must hit their designated treble bed. This is repeated until a player fails to hit the ball. Scoring is as in tennis. A match consists of the best of three sets.</p><ul><li><strong>Golf</strong>  </li></ul><p>Only the numbers one top eighteen are used in this game, representing the eighteen holes on the golf course.The object is to hit each number three times, hitting a double or a triple counts as two or three respectively, starting at one and working through to eighteen. The winner is the player to complete the game with the fewest darts</p><ul><li><strong>Cricket</strong>  </li></ul><p>In this game the players represent the batting and the bowling sides at cricket.The 'bowler' attempts bowl the batsmen out by hitting the inner or the bullseye, the inner takes out one batsman, the bull takes out two.Meanwhile the batting player attempts to score as highly as possible, but only points scored over forty count.The team with the most runs after two innings are the winners.</p><ul><li><strong>Snooker</strong>  </li></ul><p>All numbers count in this game, numbers one to fifteen represent the fifteen red balls on the snooker table, while the remaining numbers represent the colors, sixteen being yellow and so on through to twenty being black.To score, or pot a ball, that ball has to be hit by the player in sequence. The red balls must be hit once and the colored balls four times (doubles and trebles count as two and three hits respectively.) Play follows snooker in that after a red ball is potted a color must be attempted, hitting a ball out of sequence ends a turn and forfeits points etc. The player with the highest score wins.</p>"},{"name":"Bump, Set, Spike! Doubles Volleyball","year":1986,"developer":"Superior Quality Software"},{"name":"Bumpy","year":1989,"developer":"Loriciels","url":":Bumpy","filesize":19577,"score":6.2,"genres":"Action > Platform","desc":"<p>The first game in the Bumpy series is, just like its sequels, about a head that can bump a lot. You control whether the head shall bump left or right, and how far up it will bounce, in a similar fashion to Mappy. You have to move across a series of bouncy platforms and pick up all items on the screen. Once all items are collected, the exit will appear so that you can go on to the next screen.</p><p>While most platforms are perfectly harmless, some have additional qualities, such as being destructible, thereby granting access to other parts of the screen. Some platforms are on fire, which will turn out lethal unless you have picked up a water droplet in advance. </p><p><em>Bumpy</em> was remade for 16-bit platforms as <em>Pop-Up</em>, and then ported back once more to the Amstrad CPC.</p>"},{"name":"Bunny","year":1983,"developer":"Automata UK","url":":Bunny","filesize":4416,"score":"","genres":"Action > Compilation > Puzzle > Text-based / Spreadsheet > Top-down > Fixed / flip-screen > Arcade > Text parser > Sci-fi / futuristic","desc":"<p><em>Bunny plus E.T.A.</em> is a set of two games originally released as part of this compilation. It's composed of <em>Bunny</em> and E.T.A..</p><h3>Bunny</h3><p><em>Bunny</em> is an Easter-themed top down maze game. The player has to guide their bunny round the maze, collecting Easter eggs, and avoiding the hazards. To move to the next level the player must enter the exit game that appears randomly for a short time.</p><p>Every few levels there is a bonus stage where the player must deliver the eggs collected to houses under a time limit, and then complete another maze to get to the Easter basket.</p><p>The game has two difficulty levels, which changes the design of the maze.</p><h3>E.T.A.</h3><p><em>E.T.A.</em> Is inspired by the 1982 film <em>E.T. the Extra Terrestrial</em>. The main goal is to lead the Eta to his spaceship without letting his life support batteries running out. The game is composed by two parts with different genres. </p><p>The 1st is a text puzzle where the player has to guess the correct letters of Eta's name and how many legs and arms he has. For each attempt a portion of Eta's life support is lost.</p><p>The 2nd is a maze action genre where the player first has to reunite with Eta and then lead him to the spaceship. Neither the player or the Eta alone can catch the spaceship at the initial phase, they have to move together. The spaceship is constantly changing its position and at the last phase the police will try to capture them.</p>"},{"name":"Buriabeast","year":1984,"developer":"Kerian UK","url":":Buriabeast","filesize":15073,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p>The back story to this game is that as the last remaining member of the human race it's your task to defend the earth from the invading marauding mutant KENS. To accomplish this task you have a single tool, a shovel.Thus begins a thirteen level game of ladders and platforms through which you must dig holes for the KENS to fall through, luring them into the traps if you must.</p><p>The aliens start off green. Once they fall though the first hole they become red. Get them to fall through a second hole and they become white. Get them to fall through a third and that finishes them off.There are controls for left / right / up / down, along with dig, fill and pause.</p>"},{"name":"Buster Bros.","year":1990,"developer":"Mitchell Corporation"},{"name":"Butch: Hard Guy","year":1987,"developer":"Advance Software Promotions","url":":Butch Hard Guy","filesize":22538,"score":"","genres":"Action > Side view > Fixed / flip-screen > Direct control","desc":"<p>The evil Dr. Tie Fu has captured several ex-soldiers in his castle, which he has protected by superior combat droids. As war veteran <em>Butch: Hard Guy</em> it's your job to rescue them in this side-view beat 'em up. The game takes in 20 screens, each with multiple cells containing a prisoner - kick the lock in to free them, and make sure they can safely flee off to the bottom-right of the screen. The robots can be temporarily immobilised with a hit to the midriff. Another hit while they are prone will destroy them, in an explosion you must quickly get away from.</p>"},{"name":"Butcher Hill","year":1989,"developer":"Imagitec Design Ltd."},{"name":"Buzz Off!","year":1984,"developer":"Electric Software Limited"},{"name":"Buzzsaw+ (Foxton Locks Mix)","year":2011,"developer":""},{"name":"By Fair Means or Foul","year":1988,"developer":"Superior","url":":By Fair Means or Foul","filesize":30362,"score":4.9,"genres":"Action > Sports > Side view > Fixed / flip-screen > Boxing","desc":"<p>On ST and Amiga features a full range of jabs, uppercuts and weaves. All fights take place to realistic WBA rules, as you aim to rise the rankings and fight for the title. The crowd frequently shout encouragement and insults, which are displayed using speech bubbles.</p><p>The 8-bit game is a little different, featuring illegal moves such as kicks and groin punches. There is a referee, so you'll have to wait for him to look away before using those moves. Fights last 15 rounds, and a knockout ends that round, not the entire fight.</p>"},{"name":"Byte, The","year":1983,"developer":"CCS","url":":Byte, The","filesize":15060,"score":"","genres":"Adventure > Text-based / Spreadsheet > Turn-based > Interactive fiction / text adventure > Text parser > Sci-fi / futuristic","desc":"<p><em>Byte</em> is a computer themed text adventure game. The player enters a maze and has to retrieve the ten computer circuits needed to construct a computer system and then find a way home. The circuits that needs to be found include four language cards, two interfaces, a printer, a disk driver, a monitor and a teletext module. The circuits are randomly located in boxes, caches and other places. Some of the hiding places have evil circuits that weaken the player's traits. To help in finding only the good ones, a map and an estimate circuit can be used, but only after they have been located. Interaction is done by entering abbreviations, for example 'o' to open box and 'p' to pick up an item.</p><p>At the same time the player has to avoid getting killed by the monsters that are sent by the mighty computer Byte. Monsters can be dealt with in three ways: bribing, fighting mentally and fighting physically. Bribing involve giving away one collected item. Fighting mentally involve giving the right answer to a multiplication problem where five numbers briefly flash onto the screen. In the physical fight the player and the AI take turns playing a simple action mini game. The enemy appears to the right and an arrow moves up and down to the left. The player simply has to press the fire button at the right time to hit the enemy and some hit points will then be deducted.</p><p>When starting out the player gets to choose which of ten computers to play as. Each computer has different advantages and disadvantages with the cheaper ones being weaker. There are five traits (speed, ram level, rom level, linguistic level and expansion level) that can be improved by buying extra components such as chips and cards.</p>"},{"name":"Byte Bitten","year":1984,"developer":"Firebird","url":":Byte Bitten","filesize":16613,"score":"","genres":"Action > Side view > Top-down > Puzzle elements > Shooter > Helicopter","desc":"<p>Sea King is the latest computer games sensation, in which you pilot a helicopter in the hope of defending your fleet from a marauding enemy. Viewed from the side, the action involves shooting down enemies, maintaining a valid airspeed, and refueling when necessary.</p><p>As you've just got hold of the game, you'd love to spend time on it. However, in this game you must first go around your large house and find each member of your family something to keep them occupied. This section of the game involves going into different rooms, avoiding monsters in the process, and bringing the correct item back to the computer room. An arrow guides you towards the correct item.</p><p>If all this sounds like too much hard work, you can simply practice Sea King, from the main menu.</p>"},{"name":"Bzzzz","year":1986,"developer":""}]