[{"name":"X-Out","year":1990,"developer":"Rainbow Arts Software GmbH"},{"name":"X=Y=Z","year":2014,"developer":"Bob's Stuff"},{"name":"Xadom","year":1983,"developer":""},{"name":"Xanagrams","year":1983,"developer":"Dean Software"},{"name":"Xanthius","year":1987,"developer":""},{"name":"Xarax","year":1988,"developer":""},{"name":"XARQ: The Zimmerman Trenches","year":1986,"developer":""},{"name":"Xcel","year":1985,"developer":"Program Techniques Ltd.","url":"zx_Xcel_1985_Mastertronic_a/Xcel_1985_Mastertronic_a.z80","filesize":49182,"score":6.5,"genres":"Action > Simulation > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>In a period of advanced technology, humanity created 30 Sentinel planets - advanced technological devices that were designed to protect us forever. Inevitably these rebel, and destroy everything in their path. Some years later, with society having declined, they must be destroyed, and this is where you come in.</p><p>Gameplay has several elements, with the first task being to locate a Sentinel and guide your ship to it. Two inbuilt computers can be used to help you with this. Next you must land on the planet's surface, avoiding contact with anything as you head for the ground.</p><p>The main bulk of the game sees you walk around the planet's surface, destroying all the alien craft you can find. These include dark creatures such as Tri-Syncs and Mirobs.</p>"},{"name":"Xecutor","year":1987,"developer":"Cybadyne","url":"zx_Xecutor_1987_ACE_Software/Xecutor_1987_ACE_Software.z80","filesize":38619,"score":"","genres":"Action > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The Zedar region of the Horsehead Nebula has been classified as \"forbidden\". Pilots of the Mark-7 Quantillion craft on route to the Stella Wars in Questron Minor decided to put this definition to test. Even if they regretted their decision later, there was nothing they could do about it: trapped in space, surrounded by Zedar ships from all sides, the pilots realize they will have to demonstrate their best skills in order to survive.</p><p><em>Xecutor</em> is a vertically scrolling shoot-em-up similar to Master Blaster. The player can either venture to defeat the Zedar alone, or play with a friend who controls another ship on the same screen. The concept of the gameplay is simple, but the game can be hard to master or even complete, necessitating a memorization of the patterns in which the enemies or end-level bosses attack. It can be controlled with either the keyboard, a joystick or any combination between the two. Power-ups that can be collected upon the enemies' defeat include stronger weapons, additional fire power (up to three times the regular strength), double and triple lasers, penetration missiles, explosive pods, and shields.</p>"},{"name":"Xen","year":1987,"developer":"Sparklers","url":"zx_Xen_1987_Sparklers/Xen_1987_Sparklers.z80","filesize":11662,"score":"","genres":"Arcade > Shoot-em-up","desc":"<p>Fly the V-class fighter through the defences, destroying as many as possible. 10 points are awarded for each Argon craft eliminated.</p>"},{"name":"Xeno","year":1986,"developer":"Binary Design Ltd.","url":"zx_Xeno_1986_A_F_Software/Xeno_1986_A__F_Software.z80","filesize":37264,"score":6.9,"genres":"Action > Strategy > Side view > 2D scrolling > Turn-based > Sci-fi / futuristic","desc":"<p><em>Xeno</em> is a futuristic sport resembling Air Hockey. Each of the two players (the second being either human or computer controlled) controls a ground skimmer, which is aiming to hit a puck so as to knock it into their opponent's goal. This is done in a turn-based manner, in which each player controls a movement line which sets up their intended move before it is enacted. </p><p>The arena is surrounded by walls, so rebounds (of both the puck and the skimmers) have to be factored into your shot selection. You are not required to hit the puck with a shot, so some shots can be defensive-minded. You can toggle between 1 and 9 seconds for the shot time, and between 1 and 9 minutes for the length of each of the four quarters.</p>"},{"name":"Xeno II","year":1983,"developer":""},{"name":"Xenon","year":1988,"developer":"The Bitmap Brothers"},{"name":"Xenophobe","year":1989,"developer":"Bally Midway Mfg Co."},{"name":"Xevious","year":1987,"developer":"Namco Limited"},{"name":"Xor","year":1987,"developer":"Astral Software"},{"name":"Xybots","year":1989,"developer":"Atari Games Corporation"}]