[{"name":1942,"year":1985,"developer":"Capcom Co., Ltd.","url":"1#1942%20%28Japan%2C%20USA%29.nes","filesize":40976,"score":6.4,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > World War II","desc":"<p><em>1942</em> is a vertically scrolling shooter for one or two players. The year is 1942, and you are a daring fighter pilot \"Super Ace\". You begin and end each of the numerous levels on an aircraft carrier and then fly your plane into battle against the enemy over both sea and land. After destroying certain plane formations you can collect several different power ups to increase your fire power and chances of survival. You can also make your plane roll to avoid enemy attacks 3 times per life. There are 24 levels, the first being Midway and the last The Final Area.</p>"},{"name":"10-Yard Fight","year":1985,"developer":"Irem Corp.","url":"2#10-Yard%20Fight%20%28USA%2C%20Europe%29.zip","filesize":1,"score":4.4,"genres":"Sports > Top-down > Football (American) > Regional differences","desc":"<p><em>10-Yard Fight</em> is a simple arcade game based on American football. One player can play against the computer or a second player head-to-head matchup and can choose between five levels of difficulty (high school, college, pro, playoffs, and Super Bowl). If you win a game at a lower difficulty level, the following game is automatically played at the next highest difficulty level.</p><p>Gameplay is top-down and vertical-scrolling. There are no plays or formations to select from before the action begins; the player can take the snap as quarterback or choose one of two players on defense. On offense, the player can either keep the ball on the run, toss it to one of the two running backs, or throw long to the receiver; an interception turns the ball over to the other team. If a touchdown can't be scored, then the directional kicking system can be used to punt the ball or try for a field goal. One game consists (accelerated real-time) 30-minute halves of play to decide who wins this 10-Yard Fight.</p><p>While the US version plays like a traditional American Foorball game, the gameplay was altered for the Japanese version. The main idea of the Japanese version of this game is that players take control of a football team and have the task of trying to score a touchdown before the clock runs out.</p><p>Players start out as a high school team. Games consists of two halves. One touchdown must be scored before time runs out in each half or the game is lost. After a touchdown is scored, the half ends and the 2nd half of the game starts. If the player scores in both halves, they win the game, and then move on to the next level of difficulty. Difficulty levels after high school go from college, pro, then to super. The higher the difficulty, the less amount of time is given for a player to score a touchdown.</p><p>Since the game is concerned with scoring touchdowns, in the 1 player game the player is always on offense. Players can score points for completing passes and for gaining yards by either rushing or passing. Scoring a touchdown also adds to the players score, as does any remaining time on the clock after the touchdown is scored. Also after a touchdown, the player can add on to their score by kicking an extra point. </p><p>Other rules on the field include getting a 1st down to add time to the clock. If the player throws an interception or go four downs without getting a 1st down, they are penalized yards.</p><p>In a 2 player game, the second player plays defense until it's their turn to play offense.</p>"},{"name":"19: Neunzehn","year":1988,"developer":"Soft Pro International"},{"name":"1943: The Battle of Midway","year":1988,"developer":"Capcom Co., Ltd.","url":"1#1943%20-%20The%20Battle%20of%20Midway%20%28USA%29.nes","filesize":131088,"score":6.3,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > World War II","desc":"<p>The sequel to 1942, which is still a vertically scrolling shooter, has the player once again fighting over the clouds during the second world war, this time in an intense battle just off the coast of Midway islands.</p><p>Updates to the gameplay include an energy bar, which can be run down by either being hit by incoming fire or using a special weapon. The energy bar can be replenished by picking up power-ups, while special weapons (lightning, cyclones, and waves) can knock down all fighters on the screen at the time.</p>"},{"name":"1944: The Loop Master","year":2000,"developer":"Capcom Co., Ltd.","url":"3#1944/1944.nes","filesize":131088,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > World War II > War","desc":"<p>This is the 5th original part in Capcom's 194X series of top-down shoot'em ups. This time you have the choice to board the P-38 Lightning or Mitsubishi A6M Zero WWII planes and test your shooting skills in 15 stages. </p><p>Like its predecessor, 19XX: The War Against Destiny, it features a charge up system. When holding down the fire button, the charge bar will fill, and when full, the plane will fly up and become temporarily invincible.</p><p>Players start out with only one life. The plane has a health bar which decreases after every hit but can be increased again by picking up (rare) health items.</p>"},{"name":"1991 Du Ma Racing","year":1991,"developer":"Idea-Tek, Inc."},{"name":"1999: Hore, Mita koto ka! Seikimatsu","year":1992,"developer":"Coconuts Japan Entertainment Co., Ltd."},{"name":"3-D WorldRunner","year":1987,"developer":"Square Co., Ltd.","url":"1#3-D%20WorldRunner%20%28USA%29.nes","filesize":131088,"score":6.1,"genres":"Action > Behind view > Arcade > Sci-fi / futuristic","desc":"<p>Somewhere in a place known as Solar System #517, the evil Grax and his horde of Serpentbeasts are terrorizing the people of the eight worlds. A hero is needed who can run and jump. Jump between worlds, in fact. That hero is the WorldRunner.</p><p><em>3-D WorldRunner</em> is a 3rd person game, behind the player, moving \"forwards\" towards the screen and away from you. Your only skill is the ability to jump. Jump over holes, enemies and on top of columns. Bonus items are found in the air, on top of columns and laying on the ground. Additionally the game is viewable in 3-D with a pair of 3-D glasses (included in the original box).</p>"},{"name":"4 Nin Uchi Mahjong","year":1984,"developer":"Hudson Soft Company, Ltd."},{"name":"720ยบ","year":1989,"developer":"Atari Games Corporation","url":"2#720%20Degrees%20%28USA%29.zip","filesize":1,"score":5.7,"genres":"Sports > Diagonal-down > Arcade > Tricks / stunts > Skateboarding","desc":"<p>You're a skateboarder in Skate City, one of the largest skateparks ever built. Ollie off of ramps, grind on rails, and swerve past pedestrians as you bust out tricks. Visit skate shops scattered around the park to upgrade your gear and improve your skills. Participate in competitions to earn medals and cash to use in the shops. But, if you don't get to a competition in time, the infamous \"Skate Or Die\" message appears, and then you have to hurry!</p>"},{"name":"8 Eyes","year":1988,"developer":"Thinking Rabbit","url":"1#8%20Eyes%20%28USA%29.nes","filesize":262160,"score":5.3,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>8 Eyes</em> chronicles the adventures of Orin, the falconer, who must visit 8 different houses in 8 different lands and defeat 8 different guardians in order to collect 8 different jewels called eyes. It is a side-scrolling action/adventure game where the lead character can attack with a sword of somewhat limited reach. However, that is not the most powerful tool at his disposal - Orin also has his trusty falcon that he can send around the room to attack enemies or trigger remote switches. In single-player mode, the player controls both the falconer and the falcon. However, the game also offers a cooperative mode where the first player controls Orin and the second player controls his falcon in a mode which offers greater flight capability.</p>"}]