[{"name":"Aa Yakyū Jinsei Icchokusen","year":1992,"developer":"Sammy Corporation"},{"name":"Abadox: The Deadly Inner War","year":1989,"developer":"Natsume Co., Ltd.","url":":Abadox - The Deadly Inner War (USA)","filesize":136026,"score":6.5,"genres":"Action > Side view > Top-down > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>Somewhere in the galaxy, a huge alien space creature known as Parasitis travels between realms digesting its prey. The latest victim consumed by the alien entity is the planet Abadox. While trying to devour other planets by assuming the form of this planet, the World Alive Force (WAF) launches an all out assault on the alien life form. The player is a single soldier in this military operation.</p><p><em>Abadox: The Deadly Inner War</em> is a side-scrolling shooter. Players must fire upon various enemies which travel across the screen and destroy their bosses as well. One button is used for shooting and another to control the shield ability.</p>"},{"name":"Action 52","year":1991,"developer":"Active Enterprises Ltd."},{"name":"Addams Family, The","year":1992,"developer":"Ocean Software Ltd.","url":":Addams Family, The (USA)","filesize":119861,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Addams Family</em> is a side-scrolling platformer based on the movie of the same name. The player takes the role of Gomez who searches for his missing family members. To find them he has to explore six different parts of the mansion, e.g. the woods, which are basic platform levels: the player moves from left to right while jumping a lot and avoiding enemies. Some of them can be dispatched of by a jump on their heads. </p><p>The main difference to the other versions of this game is a unique level design. There is also a life meter which allows to get hit more often before dying.</p>"},{"name":"Addams Family, The: Pugsley's Scavenger Hunt","year":1992,"developer":"Enigma Variations Ltd.","url":":Addams Family, The - Pugsley's Scavenger Hunt (USA)","filesize":136079,"score":6.4,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Addams Family: Pugsley's Scavenger Hunt</em> is a side-scrolling platformer based on the second animated TV series <em>The Addams Family</em> (1992). The entire Addams family is being held captive by various monsters throughout the mansion, and Pugsley needs to rescue them. They are hidden in various parts of the mansion, e.g. the forest, which can be accessed in any order. The gameplay follows the usual platforming standards: Pugsley moves from left to right while jumping a lot and avoiding enemies.</p><p>This version of the game is heavily based on the SNES version of The Addams Family - it features the same storyline with another main character and almost identical level design. Another difference to the SNES version of this game is that Pugsley can only take two hits before dying - but there is an additional power-up that makes him faster and gives him an extra hit.</p>"},{"name":"Adian no Tsue","year":1986,"developer":"ASK Kodansha Co., Ltd."},{"name":"Advanced Dungeons & Dragons: Dragons of Flame","year":1992,"developer":"U.S. Gold Ltd.","url":":Advanced Dungeons & Dragons - Dragons of Flame (Japan)","filesize":97712,"score":6.8,"genres":"Action > Role-playing (RPG) > Diagonal-down > Side view > 2D scrolling > Fantasy > Licensed","desc":"<p>Set in between the SSI's AD&amp;D Dragonlance action games Heroes of the Lance and Shadow Sorcerer. This game follows the tradition of Heroes of the Lance with a side-scrolling, action-oriented view, a breakaway from the standard GoldBox RPGs. Plot-wise, it also takes place between those two games, following closely the novel/game modules written by Weiss/Hickman.</p><p>You take control of one character at a time, with each hero having different abilities.</p>"},{"name":"Advanced Dungeons & Dragons: DragonStrike","year":1992,"developer":"Westwood Associates","url":":Advanced Dungeons & Dragons - DragonStrike (USA)","filesize":175263,"score":6.1,"genres":"Action > Top-down > 2D scrolling > Shooter > Direct control > Vehicular combat > Fantasy > Licensed","desc":"<p>Unlike its namesake on computers, this version of <em>DragonStrike</em> is a straight action game with a top-down perspective. Set during the War of the Lance in the <em>Dragonlance</em> world of Krynn, the player controls dragons in missions against the forces of evil.</p><p>At the start of the game, one of three dragons can be selected (Bronze, Silver and Gold), each with different attributes in speed and armor and two different breath attacks. In each of the more than 12 missions, several objectives must be completed: enemy dragons must be hunted down, ships sunk and fortresses destroyed. The dragon can change between low and high altitudes to avoid obstacles and enemy fire and to attack certain types of enemies: ground troops can only be destroyed from the lower altitude, dragons only from the higher one. Killed enemy dragons leave power-ups that grant temporary protection, speed, or let the dragon regain health. Some of the missions include boss battles against large enemies like a giant kraken or a powerful dark wizard.</p><p>In two-player mode, the second player (who can select a different dragon) can continue in the mission where the previous player failed.</p>"},{"name":"Advanced Dungeons & Dragons: Heroes of the Lance","year":1991,"developer":"Strategic Simulations, Inc.","url":":Advanced Dungeons & Dragons - Heroes of the Lance (USA)","filesize":104635,"score":6,"genres":"Action > Side view > 2D scrolling > Direct control > Fantasy > Licensed","desc":"<p>Based on the later parts of the <em>Dragonlance</em> book <em>Dragons of Autumn Twilight</em>, the heroes descend into a ruined city in search of the disks of Mishakal.</p><p>The gameplay consists of horizontal fighting with a maze like map using doors to change the view. The party consists of the 8 Heroes of the Lance, using one at a time and the player can switch between them at any time. Each character has different types of attacks and spells making them more suited to fighting different enemies as well as acting as lives.</p><p>One of the <em>AD&amp;D</em> games that takes a break from the usual RPG style.</p>"},{"name":"Advanced Dungeons & Dragons: Hillsfar","year":1991,"developer":"Westwood Associates","url":":Advanced Dungeons & Dragons - Hillsfar (USA)","filesize":142342,"score":6.3,"genres":"Action > 1st-person > Top-down > 2D scrolling > Arcade > RPG elements > Fantasy > Licensed","desc":"<p>Play a would-be hero in the city of Hillsfar, where action and adventure await the daring adventurer. Join the local guild and complete missions from the guild master in a quest for glory and gold!</p><p><em>Hillsfar</em> is a single-hero role-playing game (as opposed to other <em>Advanced Dungeons &amp; Dragons</em> role-playing games, where the player usually controls a group of characters). A combination of first person perspective (when traveling in the city of Hillsfar) and third person perspective (usually in some action-style mini-quests) viewpoints.https://www.mobygames.com/images/continue-arrow.gifAs a would-be-hero, four classes are available in a randomly generated mission-based plot: fighter, thief, cleric, or magic-user. Each class to a certain extent, have different assigned quests given by each respective guild.</p><p>In <em>Hillsfar</em>, gameplay usually consists of various mini-games that are needed to complete the quests or missions provided at the local guild by the guild master. These mini-games (and their viewpoints) include:</p><ul><li>Fighting in the arena (third person).</li><li>Competing at the archery range (first person).</li><li>Exploring buildings or mazes (top-down).</li><li>Riding a horse outside Hillsfar while avoiding obstacles (third person/side-scrolling).</li><li>Locking picking doors and chests (first person).</li></ul><p>Unlike most role-playing games, there aren't any randomly generated monsters to battle. In <em>Hillsfar</em>, combat only occurs in the arena.</p>"},{"name":"Advanced Dungeons & Dragons: Pool of Radiance","year":1991,"developer":"Strategic Simulations, Inc.","url":":Advanced Dungeons & Dragons - Pool of Radiance (USA)","filesize":283733,"score":7.3,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Fantasy > Licensed","desc":"<p>Located on the northern shore of the Moonsea in Forgotten Realms, Phlan was once a flourishing trade city. However, lately monsters began settling in it, gradually turning whole districts into ruins. Only New Phlan remained under human control, but its inhabitants are afraid to venture into the monster-infested areas. In order to clean the nearby Barren River and rebuild Phlan, local authorities spread rumors about alleged riches hidden somewhere in the city. A party of adventurers, attracted by these news, sails towards Phlan and accepts the quest.</p><p><em>Pool of Radiance</em> is the first adaptation of the Advanced Dungeons &amp; Dragons role-playing system in a computer game format. In the beginning of the game the player can use a pre-made party of six characters or create each of them from scratch. Six races (human, elf, dwarf, gnome, halfling, and half-elf) and four classes (fighter, cleric, wizard, and thief) are available. The player can tweak the attributes of the characters and assign a moral alignment to each one.</p><p>Exploration of the town and hostile areas (dungeons) is viewed from a first-person perspective in a pseudo-3D world. Enemy encounters are random and take place on separate isometric combat screens, where player-controlled party and enemies take turns fighting each other. Experience points are awarded for defeating enemies, and characters level up after having accumulated set amounts. Fighters gain more attacks, thieves become proficient in backstabbing, while clerics and wizards can memorize more spells to cast before they need to rest. Non-human characters can also \"multi-class\" (learn the abilities of another class) when leveling up.</p><p>The NES version was substantially different from other versions. It removed references to the Adventure's Journal and some of the more complex features of the computer versions, like different currency units. Battles were significantly reduced in size, the graphics were overhauled and redesigned so that the game could be controlled with a control pad, and music was written for it. A randomly generated dungeon feature was also removed.</p>"},{"name":"Adventure Island","year":1986,"developer":"Hudson Soft Company, Ltd.","url":":Adventure Island (USA)","filesize":39609,"score":6.5,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Oceania","desc":"<p>In the South Pacific, Master Higgins lives peacefully wearing only a grass skirt and a cap. That is until the Evil Witch Doctor decides to capture Tina and hold her as his own. It's up to Master Higgins to gather throwing axes, fireballs and skateboards in order to aid his noble quest.</p><p>The game is a side scroller, Master Higgins moves across the screen from left to right and finds his power-ups in giant eggs. This includes a skateboard which results in a great speed enhancement - until Master Higgins gets hit and loses his power. If he is not on a skateboard a hit means instant death. Another game mechanic is starvation which gets indicated through a meter which steadily decreases. If it hits zero the hero dies and the only way to fill it up is by collecting food on the way. Bosses await him at the end of levels, all the way to the Evil Witch Doctor himself.</p>"},{"name":"Adventure Island 2","year":1991,"developer":"Now Production Co., Ltd.","url":":Adventure Island 2 (USA)","filesize":129960,"score":7.1,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>In <em>Adventure Island II</em> the player takes the role of Master Higgins who has to save his cavegirl from aliens which also want to dominate the Earth. The basic gameplay elements are the same as in its predecessor Adventure Island: Master Higgins walks through the levels while fighting against various enemies. One hit results in his untimely death unless he carries one of the various power ups, e.g. weapons or a skateboard which improves his speed. He also needs to collect food to fill up his steadily decreasing starvation bar - death awaits if it hits zero.</p><p>A big addition are dinosaurs which serve as mount and offer different abilities, e.g. flying or shooting fireballs. Like all power ups these don't have to be used instantly but can be saved for later: before every level the player can choose the power ups he wants to bring with him. There are overall eight worlds with different themes which are represented by a overhead map. Sometimes there are different paths with other level and at the end of a world Master Higgins has to fight a boss.</p>"},{"name":"Adventure Island 3","year":1992,"developer":"Hudson Soft Company, Ltd.","url":":Adventure Island 3 (USA)","filesize":142964,"score":7.2,"genres":"Action > Side view > Arcade > Platform","desc":"<p>Your girlfriend is once again kidnapped by aliens, and you have to rescue her, forcing your way through various levels.</p><p>The gameplay and the design haven't much changed since Adventure Island II: there is a world map, you can choose items before starting a level, the levels themselves are quite short (unlike Adventure Island, where each large level contained several stages). You perform standard \"adventure island\" activities: ride various types of dinosaurs, throw boomerangs at snails, birds, snakes, and skulls, collect grapes and apples, jump over stones, and of course, ride your old trusty skateboard.</p>"},{"name":"Adventures in the Magic Kingdom","year":1990,"developer":"Capcom Co., Ltd.","url":":Adventures in the Magic Kingdom (USA)","filesize":136374,"score":6,"genres":"Action > Side view > Top-down > Platform > Licensed","desc":"<p>It's time for the Mickey Mouse parade down Main Street of Disneyland, but before things can start, the six silver keys to the Castle have to be found. Scattered all across different Disneyland attractions, it's up to the player to enter these worlds and obtain the keys. They are located in the following mini-games:</p><ul><li><strong>Haunted Mansion</strong> - A side-scrolling platform game where you must avoid ghosts and monsters. Your only defense is a candle weapon which you can throw to extinguish any of the enemy creatures.</li><li><strong>Big Thunder Mountain Railroad</strong> - Travelling from the top of the screen downwards, you must navigate a minecart onto various tracks looking for the path that will lead to the third station and the key. Obstacles and dead ends can bring this ride to an end.</li><li><strong>Pirates of the Caribbean</strong> - A side-scrolling platform game. Your objective is to sneak past a horde of pirates and rescue six captives, after that, light a signal fire to obtain the key. The only thing that will stop the pirates directly is the ability to roll barrels into them and knock them over.</li><li><strong>Autopia</strong> - On the racetrack, Panhandle Pete will send all of his auto goons at you. Avoiding these cars as well as other obstacles and jumping over pits will bring you to the finish line to collect the key.</li><li><strong>Space Mountain</strong> - Inside the Space Mountain Rollercoaster, follow the track from the cockpit and listen to Mickey's navigational aids regarding which directions it will turn. Try not to hit the walls and eventually you're reach section F and the key</li><li><strong>Disney Trivia</strong> - The last key is hidden amongst Mickey Mouse's \"friends\" who will ask you to prove your comradery by answering several different trivia questions regarding the Walt Disney company and the company's productions.</li></ul>"},{"name":"Adventures of Bayou Billy, The","year":1988,"developer":"Konami Industry Co. Ltd.","url":":Adventures of Bayou Billy, The (Europe)","filesize":145225,"score":5.5,"genres":"Action > Racing / Driving > Behind view > Side view > 2D scrolling > Beat 'em up / brawler > Regional differences","desc":"<p>Your best girl Annabelle has been kidnapped by the evil Gordon, the \"gangster king of Bourbon Street\", and as Bayou Billy it is your job to get her back! Bayou Billy is an arcade action game with three different types of gameplay: fighting, shooting, and driving. The fighting sections take place in both swamps and cities, where you can punch, kick, and jump kick the numerous enemies (and swamp creatures!) you will encounter. The shooting section can be played with either the NES Zapper or the controller. You have a limited amount of ammo to get through the level, and if you run out of it you lose a life. In the driving section your jeep is armed with machine guns and grenades to help get past the many enemy vehicles on the way to your destination. There is a total of nine levels, or you can play in the practice mode which lets you choose to play a fighting, shooting, or driving round individually.</p>"},{"name":"Adventures of Captain Comic, The","year":1989,"developer":""},{"name":"Adventures of Dino-Riki","year":1987,"developer":"Hudson Soft Company, Ltd.","url":":Adventures of Dino Riki (USA)","filesize":39520,"score":5.9,"genres":"Action > Top-down > 2D scrolling > Shooter > Direct control > Prehistoric","desc":"<p>Somewhere in the land of dinosaurs, a hero known as Dino-Riki sets out to battle against the beasts of the ancient times and prove man's right to survival amongst evolution. You control Dino-Riki from a top-down perspective as the screen scrolls towards the top. Dino Riki must shoot the enemies in his way as well as leap over pits and avoid obstacles. His chances improve when he obtains weapon power-ups such as fireballs or boomerangs. Angel Wings also help and let Dino Riki fly above the ground. At the end of each level, Dino-Riki faces off against a boss creature.</p>"},{"name":"Adventures of Gilligan's Island, The","year":1990,"developer":"Human Entertainment, Inc."},{"name":"Adventures of Lolo","year":1989,"developer":"HAL Laboratory, Inc.","url":":Adventures of Lolo (USA)","filesize":36890,"score":7.5,"genres":"Action > Puzzle > Diagonal-down > Fixed / flip-screen > Direct control","desc":"<p>The lovely princess Lala was kidnapped by the Evil Demons of the Empire. You are Lolo, a round ball-like creature (just like the princess herself), and your mission is to sneak into the empire castle and to liberate the princess.</p><p><em>Adventures of Lolo</em> is a puzzle game, and each level is a castle room. The goal in each room is to collect all the hearts, then collect the chest to make the exit appear. Lolo can move blocks and turn enemies into eggs to move of freeze them. There are a few different types of enemies:* Enemies that are stationary and can block your way (or the path of an enemy)</p><ul><li>Enemies that are stationary until you collect all the hearts, then run they run after you until you collect the treasure</li><li>Enemies that will shoot you instantly if you are above/below/left/right of them, unless there is something between you</li><li>Enemies that will shoot you and run back and forth</li><li>Enemies that run after you and sleep wherever they touch you, and you can't move them</li><li>Enemies that run after you when they see you and try to block you in.</li></ul><p>As Lolo collects hearts, he can gain power ups, such as the ability to shoot an enemy and move it, and the ability to break a block. Utilizing a power-up effectively is the key to completing many puzzles.</p><p>Levels are single screens, and as they become more complex, you are encouraged to experiment as many levels can be solved in more than one way. There are 50 rooms in total.</p>"},{"name":"Adventures of Lolo 2","year":1990,"developer":"HAL Laboratory, Inc.","url":":Adventures of Lolo 2 (USA)","filesize":42791,"score":7.5,"genres":"Action > Puzzle > Diagonal-down > Fixed / flip-screen > Direct control","desc":"<p><em>Adventures of Lolo 2</em> is a sequel to Adventures of Lolo (NES). Once again, the brave blue ball-like Lolo has to save the princess from the evil demons, who kidnapped her and imprisoned her in a high tower. Solve puzzles to proceed from room to room. Push tiles, eat hearts, turn green dragons into white eggs, and protect yourself from enemies firing at you and chasing you all over the room.</p>"},{"name":"Adventures of Lolo 3","year":1990,"developer":"HAL Laboratory, Inc.","url":":Adventures of Lolo 3 (USA)","filesize":131394,"score":7.8,"genres":"Action > Puzzle > Diagonal-down > Fixed / flip-screen > Direct control","desc":"<p>This time, Lolo has a red friend who will do for him some of the work. Unlike the two previous Lolo games, here you can wander around a world map and enter different locations in a non-linear fashion. However, some of the locations remain blocked until you find a key after completing another level. </p><p>The gameplay is very similar to the one of the two previous games. You have to collect all the hearts in each room. Enemies will prevent you from doing that, and others will appear once you have eaten all the hearts and are hurrying towards the exit. The puzzles involve mostly pushing things to prevent enemies from stopping you.</p>"},{"name":"Adventures of Rad Gravity, The","year":1990,"developer":"Interplay Productions, Inc.","url":":Adventures of Rad Gravity, The (Europe)","filesize":146005,"score":6.5,"genres":"Action > Platform > Sci-fi / futuristic","desc":"<p>In this game you are Rad Gravity, a futuristic heroic spaceman.  A mad scientist disrupts the peaceful universe and it is your job to visit various planets to re-establish contact between all the worlds. Sights vary between verdant planets, lava pits and hazardous jumps, with gravity variations and craters.</p><p>The game is a platformer and on each world you must fight your way past many enemies. You can collect different weapons and additional health bars which will help you when you face the evil boss. With the main computer you can choose your next destination - but many puzzles rely on the usage of items found on a different world; e.g. an alien-translator.</p>"},{"name":"Adventures of Rocky and Bullwinkle and Friends, The","year":1992,"developer":"Radical Entertainment Inc.","url":":Adventures of Rocky and Bullwinkle and Friends, The (USA)","filesize":96130,"score":3.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>It turns out that Bullwinkle is the lost Earl of Moosechester and an inheritance is awaiting him in England. Now, Bullwinkle and his flying squirrel pal Rocket J. Squirrel have to travel from their home of Frostbite Falls, Minnesota all the way to England to claim this inheritance. To complicate matters, Rocky and Bullwinkle's antagonists Boris Badenov and Natasha Fatale intend to impede their progress so they can claim the fortune for themselves.</p><p>The game consists of five episodes (stages) of side-scrolling platform action. Players can switch control on the fly to either Bullwinkle or Rocky and will have to do this as each character has their own unique abilities. While both characters can jump and throw bombs, only Rocky possesses the ability to fly while Bullwinkle can charge enemies with his antlers.</p>"},{"name":"Adventures of Tom Sawyer, The","year":1989,"developer":"Winky Soft Co., Ltd.","url":":Adventures of Tom Sawyer (USA)","filesize":115462,"score":5,"genres":"Action > Side view > Top-down > Arcade > Platform","desc":"<p>Tom Sawyer's famous literary exploits come to life in this adventure where you play Tom Sawyer (or Huck Finn in a 2 player game).  The adventure begins in Tom's dream while he sleeps in school.</p><p>Control in this typical platform game consists of jumping and throwing rocks.  Avoid many obstacles such as rolling barrels; defeat persistent enemies such as pirates, mice, and even a giant octopus.  Help Tom navigate down the Mississippi River, through forests, haunted houses, and the sky above.</p>"},{"name":"Aeroboto","year":1985,"developer":"Jaleco Ltd."},{"name":"After Burner","year":1989,"developer":"SEGA-AM2 Co., LTD.","url":":After Burner (USA) (Unl)","filesize":127877,"score":6.8,"genres":"Action > Behind view > Arcade > Shooter > Flight / aviation","desc":"<p><em>After Burner II</em> is an updated re-release of After Burner. Besides extra levels, a few new enemies, a few touches at the soundtrack and more disposable missiles, the biggest addition is the ability to slow down or speed up manually. The rest of the gameplay remains identical.</p><p>Despite being called <i>After Burner</i>, most ports to home computers and consoles are based on this version. The NES, Amiga and Commodore 64 received two different ports with significant technical differences. This entry documents the original ports and the second ones can be found under the following entries: NES and Amiga / C64.</p>"},{"name":"After Burner II","year":1989,"developer":"SEGA Enterprises Ltd."},{"name":"Ai Sensei no Oshiete: Watashi no Hoshi","year":1993,"developer":"Irem Corp."},{"name":"Ai Senshi Nicol","year":1987,"developer":"Konami Corporation"},{"name":"Aigina's Prophecy","year":1986,"developer":"Vic Tokai Corporation"},{"name":"Air Fortress","year":1987,"developer":"HAL Laboratory, Inc.","url":":Air Fortress (USA)","filesize":86503,"score":6.6,"genres":"Action > Side view > Arcade > Platform > Shooter > Sci-fi / futuristic","desc":"<p>The Federation of Intergalactic Powers is under threat by gigantic fortress spaceships which have suddenly appeared and destroyed nearby civilization. When conventional defense tactics fail, the Federation looks to find a specially selected person, Hal Bailman and equip him with a special \"Lightship\". His mission will to be to fly through the defenses of the eight known Air Fortresses and dock at the airlock. Then he must travel through the fortress in only a spacesuit to find and destroy the central core. Once the central core is destroyed, Hal must then quickly find the emergency lightship and escape before the fortress explodes.</p><p>The game is made up of two parts. The first part is a side-scrolling shooter on the surface of the air fortress where you must avoid various flying enemies and try to destroy as many waves as possible. This lasts until you dock with the airlock. Once docked, you walk the inside of the Air Fortress at your own pace. Hal is equipped with a jetpack rather than a jump as well as a blaster weapon and a more powerful bomb weapon. Any movement or firing you do consumes energy which is regenerated by standing still. Your goal is to blow up the core and find the escape ship before explosion.</p><p>Power-ups to increase Energy or Bombs can be found in each part of the game. Additionally, Super-bombs (clear screen of enemies) and Invulnerability can be found while flying the lightship.</p>"},{"name":"Airwolf","year":1989,"developer":"Beam Software Pty., Ltd.","url":":Airwolf (USA)","filesize":61672,"score":4.7,"genres":"Action > Simulation > 1st-person > Side view > Arcade > Flight / aviation > Helicopter > Licensed","desc":"<p>In this game based on the TV show, you command a military helicopter on a mission to rescue hostages.  The main action is first person but when a POW camp is reached a third person viewpoint is used.  A variety of enemy aircraft and weapons must be destroyed to successfully rescue the prisoners.</p>"},{"name":"Akagawa Jirō no Yūrei Ressha","year":1991,"developer":"Mighty Craft Co."},{"name":"Akira","year":1988,"developer":"Taito Corporation","url":":Akira [trans]","filesize":234614,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Interactive fiction / text adventure > Japanese-style adventure > Text parser > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>The game is based on the animé movie of the same name. The year is 2019, 31 years after World War III. The events of the game (and of the movie) take place in a futuristic city called New Tokyo, which is controlled by corrupted military and rival gangs. You control Kaneda, the leader of one of such guys, and the main character in the movie. Kaneda's childhood friend, Tetsuo, is injured during the highway chase, and taken by the military. While trying to free your friend, you find out a strange power is growing inside him...</p><p>The game is a traditional Japanese adventure. Instead of a menu with set commands, you have different options on each screen. After watching a cutscene or scrolling through a dialogue, you have several options to choose from. In many situations, some options will lead to Kaneda's death or imprisonment, which is Game Over. There are no real puzzles or anything of the sort, but if you choose the \"examine\" option which is available on most screens, you can move the cursor around the screen and choose what exactly you want to examine.</p>"},{"name":"Akuma-kun: Makai no Wana","year":1990,"developer":"Tose Co., Ltd."},{"name":"Akumajō Special: Boku Dracula-kun","year":1990,"developer":"Konami Corporation"},{"name":"Akuu Senki Raijin","year":1988,"developer":"Micro Cabin Corp."},{"name":"Al Unser Jr. Turbo Racing","year":1989,"developer":"Data East Corporation","url":":Al Unser Jr. Turbo Racing (USA)","filesize":99622,"score":6.1,"genres":"Action > Racing / Driving > Behind view > Automobile > Track racing > Licensed > Regional differences","desc":"<p>Unlike its namesake, the IndyCar racer  Al Unser Jr., this game depicts Formula 1 races. A season consists of sixteen races, each one consisting of unlimited practice, one qualifying lap and the real race (the starting position depends on the qualifying result). Of course the goal is to win the championship by having successful race results. Those results also change the amount of \"set-up points\", which represent the quality of the car, players can use before the next race. Besides the championship there is also a time trial mode available (with or without AI opponents).</p><p>While the game features manual gear switching, it tends more to an action oriented gameplay than a simulation: pit stops (needed when the car gets nearly destroyed after accidents) stop the time for every driver and players can use a limited amount of turbo boosts. Players can start their own racing team or play as Al Unser Jr., which results in always having the best car possible.</p>"},{"name":"Alfonzo's Arctic Adventure","year":2019,"developer":"Spoony Bard Productions"},{"name":"Alfred Chicken","year":1993,"developer":"Twilight","url":":Alfred Chicken (Europe)","filesize":75402,"score":7.2,"genres":"Action > Side view > Platform","desc":"<p>Alfred the chicken must rescue his friends and his bird (pardon the pun) Floella from the Meka Chickens. The result is a platform game across differently-themed levels, which are finished by either climbing to the top of the level or killing a boss. Bonus games and secret rooms have been included, and progression sometimes requires solving positional puzzles.</p><p>Alfred cannot fly, but he can use ramps to jump up and hit enemies with his bionic beak - this kills them, but any other contact will hurt Alfred. Watch out for spiked snails though. Other enemies include whales armed with guns and stray bombs.</p>"},{"name":"Alien Syndrome","year":1988,"developer":"SEGA Enterprises Ltd.","url":":Alien Syndrome (USA) (Unl)","filesize":108371,"score":6.9,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p><em>Alien Syndrome</em> is a scrolling shooter. </p><p>Your job is to run around and rescue all the captives and make it to the escape hatch before the time bomb explodes. Then face the mother alien at the end of the level.</p>"},{"name":"Alien³","year":1993,"developer":"Probe Software Ltd.","url":":Alien 3 (USA)","filesize":81497,"score":6,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>Alien³</em> on the NES is similar to Probe Software's adaptations of the film on other systems. While using the same overall game concept as the Sega and Commodore versions, the NES title has unique levels.</p><p>The player controls Ripley through a number of platform levels. She must not only defend herself against hordes of aliens and find the exit, but also save a number of prisoners, all within a tight time limit of only minutes per level.</p><p>Weapons to use against the aliens include a pulse rifle, flame thrower, grenade launcher as well as hand grenades. Ammo for each is limited and must be collected in the levels. The rifle is prone to overheating, so should only be fired in short bursts.</p><p>Next to health packs, Ripley can also find a radar. The radar indicates both moving aliens as well as the locations of prisoners.</p><p>After every two levels, a guardian level follows, in which an especially tough alien must be defeated to continue.</p>"},{"name":"All Night Nippon Super Mario Bros.","year":1986,"developer":"Nintendo Co., Ltd."},{"name":"All-Pro Basketball","year":1989,"developer":"Aicom Corporation","url":":All-Pro Basketball (USA)","filesize":116636,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Basketball","desc":"<p>Video round ball seems to come in a variety of court sizes and player numbers. <em>All-Pro Basketball</em> combines five-on-five full-court action with a half-court screen view.</p><p>All-Pro style B-ball features several different play options. Go head-to-head with a friend in a one-game contest. Or, watch two computer teams battle it out on court. If you choose league competition your task is to lead your team to the league championship. In Two Player league play you and a buddy team up to battle the computer teams. Choose your squad from eight professional rosters - ranging from the New York Slicks to the San Francisco Bayriders. Each team has their own strengths and weaknesses.</p><p>When the scene is set, the game begins with a jump ball and then it's non-stop no-holds-barred B-ball. On offense you're the team - running, jumping, jump passing, shooting, and even going for three pointers or slam dunks. On defense make a steal or grab a rebound. And remember this is real video basketball. You get called for fouls and your teammates get tired. When their health and stamina get low it's up to you to put them on the bench for a rest.</p>"},{"name":"Alpha Mission","year":1986,"developer":"SNK Corporation","url":":Alpha Mission (USA)","filesize":31823,"score":5.2,"genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>Out beyond, in the galaxy of Tetrenova, a war has been fought that has exhausted resources and even worlds. The survivors band together and look for a new place to rebuild. They choose a seemingly undeveloped planet, Earth.</p><p>Using your defense ship 'Syd,' you must destroy the invading forces and ground targets with bombs. Obtain power-ups to gain energy for ship upgrades that allow you to transform to a more powerful machine. The game itself is a vertical shooter, moving continuously up towards the top of the screen.</p>"},{"name":"Alter Ego","year":2011,"developer":"RetroSouls"},{"name":"Altered Beast","year":1990,"developer":"Team Shinobi"},{"name":"Amagon","year":1988,"developer":"Aicom Corporation","url":":Amagon (USA)","filesize":73736,"score":5.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter","desc":"<p>In <em>Amagon</em>, your mission is to investigate a dangerous, monster-infested island. As Amagon, you begin the game with only a machine gun and a limited amount of ammo to protect yourself from the inhabitants of the island. Gameplay is an arcade style platform game with six levels, each with a variety of creatures and a large boss at the end. When you destroy an enemy, a power up will sometimes be left behind. Collecting these can give you extra points, an extra life, more ammo, or a mega key. If you have enough points and collect a mega key, you then have the ability to transform into Megagon. In this form, you are larger in size, can jump further, and have increased strength. You start the transformation with an amount of mega points; each time a creature injures you, points are lost. When all of the mega points are gone you will transform back into your normal size.</p>"},{"name":"America Daitōryō Senkyo","year":1988,"developer":"Hect Co. Ltd."},{"name":"America! Ōdan Ultra Quiz: Shijō Saidai no Tatakai","year":1991,"developer":"Pixel"},{"name":"American Dream","year":1989,"developer":"Coconuts Japan Entertainment Co., Ltd."},{"name":"American Gladiators","year":1991,"developer":"Incredible Technologies, Inc.","url":":American Gladiators (USA)","filesize":133891,"score":4.3,"genres":"Action > Simulation > Side view > Top-down > Fighting > Game show / trivia / quiz > Platform > Licensed","desc":"<p><em>American Gladiators</em> is licensed from the popular TV show of the same name. It features a series of events testing players' strength, speed and skill against a trained team of ten 'Gladiators', five male and five female. The female characters are Ice, Gold, Lace, Blaze and Zap, most of whom are known for their bodybuilding achievements. Main male characters are Turbo, Nitro (who was featured in several television commercials for American television), Gemini, Thunder and Laser (Mr. Montana of 1986).</p><p>In total there are seven events, all viewed from third-person views. The final one is the Eliminator assault course, in which you compete directly against an opponent.</p>"},{"name":"Ankoku Shinwa: Yamato Takeru Densetsu","year":1989,"developer":"Another Ltd."},{"name":"Antarctic Adventure","year":1985,"developer":"Konami Corporation"},{"name":"Anticipation","year":1988,"developer":"Rare Limited","url":":Anticipation (Europe)","filesize":46494,"score":6.1,"genres":"Strategy > Board game > Party game","desc":"<p><em>Anticipation</em> is a video board game for one to four players (both computer and human). The object of the game is to be the first to collect a card for each of the four colors on the game board. During each turn the computer will display seemingly random dots, then a pencil starts connecting the dots to form a picture. The first player to correctly identify the picture will earn a card for the color of the picture being drawn. As the picture draws, a dice on the screen will count down from 6 to 1. Whatever value is showing when a player successfully identifies the picture is the number of spaces that players game piece will move on the game board for the next turn. The color of the space the game piece lands on will dictate the category for the next picture to be drawn. </p><p>Each game will choose four categories from the various options, which include: tools, man made, clothing, food, math, office, travel, music, things, natural, leisure, and many others. After you've mastered the easier skill levels, the difficulty can be increased which will present more complicated pictures, remove some of the dots from the picture, or eliminate the dots entirely. </p><p>The game supports one to four players, however the NES satellite is not supported. If three or four players are competing, then two players will need to share a single controller. The control pad or A/B buttons would ring in a player who knew the answer for the picture being drawn, then the controller would have to be handed to that player in order to enter in the answer.</p>"},{"name":"AO","year":2016,"developer":"Second Dimension R&T, LLC"},{"name":"Apple Town Monogatari: Little Computer People","year":1987,"developer":"Square Co., Ltd."},{"name":"Arabian","year":1985,"developer":"Sun Electronics Corp."},{"name":"Arch Rivals","year":1990,"developer":"Midway Manufacturing Company","url":":Arch Rivals - A Basketbrawl! (Europe)","filesize":71442,"score":6.1,"genres":"Sports > Side view > 2D scrolling > Basketball","desc":"<p><em>Arch Rivals</em> is a 2-on-2 basketball game that stands out from the crowd for its \"no rules\" approach. Fouling out other players is more than accepted, it's encouraged. Choose from twelve different teams and eight players, each with their own traits and personalities.</p>"},{"name":"Archon","year":1989,"developer":"Free Fall Associates","url":":Archon (USA)","filesize":59580,"score":7.5,"genres":"Action > Strategy > Top-down > Real-time > Turn-based","desc":"<p><em>Archon: The Light and the Dark</em> is a strategic board game with some similarities to chess. Two sides, a light one and a dark one, consisting of 18 pieces each compete on a board divided into (9 by 9) squares. You win the game by having one of your units on each of the five powerpoint squares, by removing all opposing pieces from the board or by imprisoning the last remaining creature of the opposing side.</p><p>However, you can't just remove a piece from the board by landing on it. When two pieces clash, the outcome is decided in the battle arena during one-on-one real-time combat. If the real-time combat takes place on a dark square, the dark monster gets a health bonus (longer life bar). On a light square the light side gains an advantage. There are also some squares whose color changes over time (from afternoon, to dusk, to night, to dawn etc.), which adds an extra layer of strategy to the game.</p><p>Unlike chess the two sides are not identical. Both sides consist of mythological creatures. For example the light side has among others unicorns, valkyries and a djinni while the dark side features basilisks, banshees and manticores. The differences are not just cosmetic. Two special pieces are the light wizard &amp; the dark sorceress, they can both cast magical spells like: imprison a unit on the board, shift the flow of time (change day/night cycle to your advantage), bring one unit back from the dead etc.</p><p>The different pieces have their own movement restrictions regarding the number of squares they're allowed to travel on the board and whether or not they can jump over other units (like the knight in chess). Units also behave different in combat; some units are faster than others, some use melee attacks while others fire projectiles.</p><p><em>Archon</em> can be played with either one or two players.The NES version, which was released a few years after the other versions, has improved graphics for the real-time combat part. Each type of square has it's own colored background and the unit sprites are larger.</p>"},{"name":"Arctic","year":1990,"developer":"Artdink Corporation"},{"name":"Argus","year":1986,"developer":"Nihon Micom Kaihatsu"},{"name":"Arkanoid","year":1986,"developer":"Taito Corporation","url":":Arkanoid (USA)","filesize":21302,"score":7.7,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Paddle / Pong > Sci-fi / futuristic","desc":"<p>The original Breakout concept involves controlling a bat at the bottom of the screen and using it to catch and direct a ball so as to hit all the bricks which are arranged at the top of the screen. It was unpopular for over a decade, before Taito revived it with some new ideas in this arcade game.</p><p>The game's plot redefines the bat as a Vaus spaceship, the ball as an energy bolt, and the bricks form a mysterious wall stopping the ship from progressing to safety.</p><p>By the mid-80s, power-ups were popular in most types of arcade games, and <em>Arkanoid</em> features them. They are caught by positioning the bat below them as they fall (meaning that you risk missing the ball if you go for them at the wrong time). The power-ups include lasers (which are mounted to each side of the ship and allow you to shoot out the blocks), a catching device (so as to be able to fire the ball off at a different angle every time you hit it) and one that slows the bolt down.</p>"},{"name":"Arkanoid: Revenge of DOH","year":1988,"developer":"Taito Corporation"},{"name":"Arkista's Ring","year":1990,"developer":"NMK Co. Ltd.","url":":Arkista's Ring (USA)","filesize":38231,"score":6.5,"genres":"Action > Top-down > Anime / Manga > Puzzle elements > Fantasy","desc":"<p>An evil character named Shogun has stolen the Elven ring of Arkista, and in so doing has plunged the whole Elf kingdom into darkness. All the elves hope lies in one elf warrior named Christine. Equipped in the beginning with only a bow, she proceeds to find the ring and restore her home back to normal.</p><p>This is a game that may be compared to The Legend of Zelda, though more linear in it's game play. The game is broken down into many stages, the goal of each being to simply find a way into the next stage. Playing out in puzzle fashion, you will shoot all the enemies on screen, earn the hidden key, and find the correct exit. Defeated enemies will randomly drop bonuses that can be collected; these items include health restore, increased armor, and weapon improvements.</p><p>Beating the entire game requires successful progression through 125 stages.</p>"},{"name":"Armadillo","year":1991,"developer":"AIM"},{"name":"Artelius","year":1987,"developer":"Nihon Bussan Co., Ltd."},{"name":"Arumana no Kiseki","year":1987,"developer":"Konami Industry Co. Ltd."},{"name":"Asmik-kun Land","year":1991,"developer":"Graphic Research Co., Ltd."},{"name":"Aspic","year":1988,"developer":"Xtalsoft Co., Ltd."},{"name":"Asterix","year":1993,"developer":"Infogrames Europe SA","url":":Asterix (Europe) (En,Fr,De,Es,It)","filesize":85199,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The year is 50 BC. Gaul is entirely occupied by the Romans. Well, almost entirely... One small Gaulish village continues to defy the occupying forces, the villagers protected by a magic potion which makes them invincible. But now Obelix has vanished! The Romans have confirmed his capture and taken him to an unknown destination. </p><p>Astérix is a platform game based on the eponymous comic books, where the short and mustached Gaul has to progress through levels located all across Europe, fighting Romans and various aggressive animals along the way, to rescue his friend Obelix before Caesar throws him to the lions....  </p>"},{"name":"Astro Fang: Super Machine","year":1990,"developer":"A Wave, Inc."},{"name":"Astyanax","year":1989,"developer":"Jaleco Ltd.","url":":Astyanax (Europe)","filesize":139449,"score":6.9,"genres":"Action > Side view > Anime / Manga > Platform > Fantasy","desc":"<p>You are Astyanax, a sixteen year old boy that has the same dream night after night: A princess, calling for help. One afternoon, you are summoned to the world of Remnia by Cutie, a pixie, to save the realm's princess. You are the chosen one mentioned by their prophecies!</p><p><em>Astyanax</em> is a side-scrolling platform action game set in a fantasy world. You must save the realm from Blackhorn's evil horde. Along the way you'll find powerups that will make you stronger, and upgrade your weapon; and you can also unleash magical attacks that hit all enemies on the screen. Three magic spells are available: blast (fireball in all directions), bolt (powerful lightning strike), and blind (freeze all enemies on screen). The weapon upgrades that the player can find also determine the power of the spells and how many magic points they will use. </p><p>A follow-up to the Arcade game The Astyanax, this version features completely redesigned stages, enemies, and a new story.</p>"},{"name":"Athena","year":1987,"developer":"SNK Corporation","url":":Athena (USA)","filesize":73000,"score":4.6,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p>In this game, players take the role of Athena, the Goddess of Wisdom, who has grown tired of her life within the castle and ventures into the Fantasy World beyond the castle walls. Strange and fearsome creatures will attack at every turn, but weapons can be found along the way: a ball and chain, a bow and arrow, and a mighty sword.  Put on wings and take to the sky, or become a mermaid to explore the ocean depths.</p>"},{"name":"Athletic World","year":1986,"developer":"TRY Co., Ltd.","url":":Athletic World (USA)","filesize":33293,"score":6.6,"genres":"Sports > Side view > Real-time > Olympiad / mixed sports","desc":"<p>This \"Family Fun Fitness\" game consists of a series of competitive sporting events that requires the use of the Nintendo Power Pad.</p><p>One of a few games that attempt to combine physical exercising into a video gaming experience; you will be able to try many events such jumping hurdles, running up hills, log hopping, river rafting (standing on a raft and dodging/jumping branches) and more.</p><p><em>Athletic World</em> offers three modes of play, training, beginner, and expert. This is also one of the few Nintendo games that asks you to enter in your name, age, gender, and current date before playing.</p>"},{"name":"Atlantis no Nazo","year":1986,"developer":"Sun Corporation"},{"name":"Attack Animal Gakuen","year":1987,"developer":"Newtopia Planning"},{"name":"Attack of the Killer Tomatoes","year":1991,"developer":"Imagineering Inc.","url":":Attack of the Killer Tomatoes (USA)","filesize":117455,"score":5,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Based off the cartoon show of the same name, <em>Attack of the Killer Tomatoes</em> places young Chad Finletter on a quest to make his way past evil mutant tomatoes and stop the crazy Dr. Putrid T. Gangreen from unleashing his Doomsday Tomato. With all the citizens of San Zucchini terrified of the fanged vegetables coming from the sewers, Chad will be on his own to take on the tomato scourge. The doctor doesn't take him lightly, however, and has sent his special tomato squad, Zoltan, Beefstake, Mummato, Fang, Ketchuck and Tomacho, to stop him.</p><p>The game is a side-scrolling platform jumping game where the main method of stopping the killer tomatoes is to jump on them. From that they'll either splatter, run away or transform into smaller tomato bits. Energy Power-ups exist to refill Chad's health.</p>"},{"name":"Aussie Rules Footy","year":1991,"developer":"Beam Software Pty., Ltd."},{"name":"Auto-Upturn","year":1991,"developer":"Sachen"}]