[{"name":"B-Wings: Battle Wings","year":1986,"developer":"Data East Corporation"},{"name":"Babel no Tō","year":1986,"developer":"Namco Limited"},{"name":"Baby Boomer","year":1989,"developer":"Color Dreams, Inc."},{"name":"Back to the Future","year":1989,"developer":"Beam Software Pty., Ltd.","url":":Back to the Future (USA)","filesize":37017,"score":3.9,"genres":"Action > Top-down > Licensed","desc":"<p>In <em>Back to the Future</em>, 80s teen Marty McFly is mistakenly send 30 years into the past where he disrupts his own parents from meeting. Faced with extinction at the hands of a temporal paradox, Marty must find a way to reunite his future parents and make it back to his own time.</p><p>LJN's game differs completely from the computer versions, and plays as a literal race against time broken up by brief arcade minigames. In the main game, the player controls Marty in an overhead view as he runs down the streets of 1950s Hill Valley. A collection of period-appropriate bad guys block his path, including bullies, hula hoop girls, bumblebees, and park benches. The camera scrolls forward at a fixed speed, so the player must keep Marty on the move and away from obstacles. Hitting one causes Marty to fall and lose a life. The player must also collect clocks scattered on the street to stop Marty's photograph from fading away. If it fades completely, Marty is erased from existence.</p><p>Street running sections lead to three minigames. In these, Marty must sling milkshakes at oncoming bullies, deflect kisses (shown as hearts) from his mother, and collect notes to rock out on stage at the high school dance. The final stage resembles the street sections, as the player must control the DeLorean time machine and collect enough energy to travel through time (shown as lightning bolts instead of clocks).</p>"},{"name":"Back to the Future Part II & III","year":1990,"developer":"Beam Software Pty., Ltd.","url":":Back to the Future Part II & III (USA)","filesize":131162,"score":5.2,"genres":"Action > Side view > Platform > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p><em>Back to the Future Part II &amp; III</em> is a platform game based on the movies of the same name. The object of the game is to collect misplaced objects from various time periods like 1955, 1985 and 2015, and bring them back to their proper time period and location. The game often requires the player to solve a small puzzle to figure out what item fits the location he has found.</p>"},{"name":"Backgammon","year":1990,"developer":"Intelligent Systems Co., Ltd."},{"name":"Bad Dudes","year":1989,"developer":"Data East Corporation","url":":Bad Dudes (USA)","filesize":123884,"score":6.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Regional differences","desc":"<p><em>Bad Dudes</em> is a six-level action game originating in the arcades. The gameplay involving beating a succession of guys to complete the level, then an end-of-level bad guy. The action takes place on two different levels of the screen, which can be jumped across or navigated using ladders. Moves such as punches and kicks are on offer. The control method makes jumping sideways quite tricky.</p>"},{"name":"Bad News Baseball","year":1989,"developer":"Tecmo, Ltd.","url":":Bad News Baseball","filesize":134901,"score":7.3,"genres":"Sports > Baseball","desc":"<p>Welcome to the world of Bad News Baseball, a place where rabbits serve as umpires, home runs escape the earth's atmosphere, and batters are knocked unconscious when they make an out.</p><p>Bad News Baseball is a Japanese import for a younger audience. The game has two leagues - the Ultra and Super leagues - with 12 teams that represent major league cities which use fictional team and player names. There are several modes to choose from at the start of the game. You can play a One Player tournament versus the computer: pick a team and play against every other team once. Or, you can play a three-game series against a friend. There's also an all-star mode, which enables you to build a 23-player team from the rosters of one of the leagues. And if you want to watch a game, there's a spectator mode.</p>"},{"name":"Bad Street Brawler","year":1989,"developer":"Beam Software Pty., Ltd.","url":":Bad Street Brawler (USA)","filesize":79267,"score":5.9,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler","desc":"<p>In <em>Bad Street Brawler</em>, players take the role of the former punk rocker and current martial artist Duke Dunnegan, or alternatively the wrestler Gorgeous George (Bop N' Wrestle) or as a high school teacher pushed to far (Street Hassle) who finds he is the only one in the position to clean the mean streets from various thugs and loonies.</p><p>Gameplay involves walking through the streets and taking out any enemies that get in the way. Kicks and punches are your basic moves at first, but as the game progresses, new moves and attacks become available, and new enemy types to beat up as well.</p>"},{"name":"Bakushō! Star Monomane Shitennō","year":1990,"developer":"Pack-In-Video Co., Ltd"},{"name":"Bakushō!! Ai no Gekijō","year":1990,"developer":"Coconuts Japan Entertainment Co., Ltd."},{"name":"Bakushō!! Jinsei Gekijō","year":1989,"developer":"Taito Corporation"},{"name":"Bakushō!! Jinsei Gekijō 2","year":1991,"developer":"Taito Corporation"},{"name":"Bakushō!! Jinsei Gekijō 3","year":1991,"developer":"Taito Corporation"},{"name":"Bakutōshi Patton-Kun","year":1988,"developer":"Soft Pro International"},{"name":"Ballblazer","year":1988,"developer":"Lucasfilm Ltd. LLC"},{"name":"Balloon Fight","year":1985,"developer":"Nintendo Co., Ltd.","url":":Balloon Fight (Europe)","filesize":16317,"score":6.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>In <em>Balloon Fight</em> you need to fly around with the aid of two balloons and try to pop your opponent's balloons before they pop yours. Landing on top of your opponents will cause their balloons to pop and they will use a parachute to fall to safety. You then have to destroy the fallen opponents by running into them before they can blow a new balloon and rejoin the battle. Should both of your balloons get popped, you will fall into the water below and lose a life. There is also a second game variation called \"balloon trip\" where you need to collect as many balloons as possible while avoiding the ocean floor and lightnings that form maze-like walls.</p>"},{"name":"Balloon Kid","year":1992,"developer":"Pax Softnica"},{"name":"Baltron","year":1986,"developer":"Shouei System"},{"name":"Banana","year":1986,"developer":"Victor Musical Industries, Inc."},{"name":"Banana Prince","year":1991,"developer":"KID Corp."},{"name":"Bandai Golf: Challenge Pebble Beach","year":1989,"developer":"Tose Co., Ltd.","url":":Bandai Golf - Challenge Pebble Beach (USA)","filesize":36440,"score":5.9,"genres":"Sports > Side view > Top-down > Golf","desc":"<p>One or Two players can play a round on this video course modeled after the real Pebble Beach. Each player can select their own handicap. Every one of the 18 holes has familiar golf hazards - bunkers, slopes, and water hazards. You'll also have to contend with some of Mother Nature's hazards like changing wind conditions and Pebble Beach's most difficult obstacle - the ocean.</p><p>Once you tee off you'll have all kinds of decisions to make. Check your score card to see how you're doing. The card tells you the distance in yards and par for each hole. The computer gives you a bird's-eye view and cross-sectional view of each hole, as well as close-ups of the green. You select the right club for each shot. Control your shot to get the power, distance, and hook or slice you want on the ball. After you've made your shot the computer tells you what kind of lie you have as well as the remaining distance to the hole.</p>"},{"name":"Bandit Kings of Ancient China","year":1990,"developer":"KOEI Co., Ltd."},{"name":"Barbie","year":1991,"developer":"Imagineering Inc.","url":":Barbie (USA)","filesize":111359,"score":5.4,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Barbie has a big day tomorrow, so she needs to get a good nights rest.  She has strange dreams about all her planned activities.  She must traverse five levels made up of a total of thirteen stages to make it through the night.</p><p>Barbie travels through various location in the mall, at the beach and in the soda shop trying to make it from the left side of each level to the right.  Each level is populated with animals and with living objects of the sort you would find in that location.  She can jump with the A button and throw crystals with the B button.  The longer you hold the button down, the farther each crystal is thrown.  She has three kinds of crystals, each of which has a different effect.  One makes creatures help her, one defeats them and one has varying effects.</p>"},{"name":"Bard's Tale II, The: The Destiny Knight","year":1992,"developer":"Interplay Productions, Inc."},{"name":"Barker Bill's Trick Shooting","year":1990,"developer":"Nintendo Co., Ltd.","url":":Barker Bill's Trick Shooting (USA)","filesize":76844,"score":6.6,"genres":"Action > 1st-person > Arcade > Shooter","desc":"<p>Pull out the Zapper Light Gun, and blast a variety of objects in <em>Barker Bill's Trick Shooting</em>. The game starts out simple enough; shoot rising balloons while avoiding the happy-go-lucky dog. As you get through each stage, the challenges become more difficult. Each level offers a new challenge, including Balloon Saloon, Flying Saucers, Window Pains (pun or translation error?) and Fun Follies.</p>"},{"name":"Base Wars: Cyber Stadium Series","year":1991,"developer":"Konami Industry Co. Ltd.","url":":Base Wars","filesize":153512,"score":7.1,"genres":"Action > Sports > Fighting > Baseball > Sci-fi / futuristic","desc":"<p>In the 24th century, the game of Baseball is very different. Tired of paying huge players salaries, the team owners got together one weekend and came up with a bold new idea, Robots. Indeed they renamed their league the Cyber League and stocked it with four robot types; Cyborg, Tank, Floater or Motorcycle, to play.  On an orbital stadium in space, these robots all play a slightly different variation of the baseball rules. Hitting the ball and catching pop-flys and making home runs are all the same, but when the call of a play is in dispute, there are no base referees; the robots engage in a one-on-one battle using any weaponry they're carrying.  Of course to make things interesting, weaponry (and other robot parts and equipment) can only be purchased with team funds during a tournament game, and team funds can only be obtained by wins. Thus the series closer is always sure to be a sold out game.</p>"},{"name":"Baseball","year":1983,"developer":"Nintendo R&D1","url":":Baseball","filesize":17551,"score":4.9,"genres":"Sports > Diagonal-down > Baseball","desc":"<p><em>Baseball</em> is a game where the player can pitch, hit, field, and run just like in a real baseball game. The player can choose between USA and Japan modes, two different teams, and among a line-up of unique players. In the 1-player game, the player is against the computer, and the in the 2-player game, their friend is their opponent.</p>"},{"name":"Baseball Simulator 1.000","year":1989,"developer":"Culture Brain Inc.","url":":Baseball Simulator 1.000 (USA)","filesize":127067,"score":6.9,"genres":"Sports > Diagonal-down > Arcade > Baseball","desc":"<p>In <em>Baseball Simulator 1.000</em> you can choose from four different leagues; three with six preset teams each and one where you can build the teams yourself from scratch. Face the computer or challenge a friend to compete in a 5, 30, 60, or 165 game season. Games take place in six stadiums.</p><p>As the manager you build up your team by allocating a set bunch of points for batting average, home runs, running speed, and fielding ability among your players. Then, you customize your pitching staff by divvying up points for ERA, speed, right and left curve balls, sinking pitches, and stamina. Your managerial responsibilities also include deciding who's right-handed and who's a lefty, and whether your pitchers throw overhand or sidearm.</p><p>You can also play in the Ultra League. Ultra League play enables you to give your hitters and pitchers special skills, such as the ability to pitch balls that zig zag, or hit balls that explode on contact.</p>"},{"name":"Baseball Stars","year":1989,"developer":"SNK Corporation","url":":Baseball Stars","filesize":129549,"score":7.8,"genres":"Sports > Diagonal-down > Arcade > Baseball","desc":"<p>This NES version of Baseball Stars is the very first game in SNK's popular series.  It is also the most comprehensive game in the series.  You can create, name, upgrade, and manage your own team, as well as customize the team's logo and colors.  You can also change the stats of each individual player by paying him or her more money (earned from winning games).</p><p>There are eight already-created gimmick teams that you can also play with, including the American Dreams, Lovely Ladies, and the Ghastly Monsters.  You can set up a custom league which will keep complete stats on all players in the league.  All games are played in the famous SNK Stadium.</p>"},{"name":"Baseball Stars 2","year":1992,"developer":"WolfAlmighty","url":":Baseball Stars 2","filesize":158632,"score":7.8,"genres":"Sports > Diagonal-down > Baseball","desc":"<p>The second in the Baseball Stars series, Baseball Stars 2 was done by Romstar. Contains a more polished baseball game at the expense of a few of the customizing features that the first Baseball Stars had. The returning features include a create-a-team mode, upgrading and hiring/firing players, and league mode. Missing features removed for this game include renaming players, renaming teams, and females are no longer present.This sequel contains 12 pre-made teams and 6 slots for user created teams. There are four selectable stadiums to play in this time around.</p>"},{"name":"Bases Loaded","year":1987,"developer":"Tose Co., Ltd.","url":":Bases Loaded","filesize":174612,"score":6.4,"genres":"Sports > Behind view > Diagonal-down > Baseball","desc":"<p><em>Bases Loaded</em> is a baseball action game for one or two players featuring a large variety of options and realistic graphics and sound. You can select from twelve different teams and choose a lineup for each team. Each team has 30 players with different characteristics to learn. During gameplay you can control all of the positions in the field and pitch everything from a fast ball to curve ball. When at bat you can try to hit a homerun, bunt, or steal bases. Play can be a single game or a complete pennant.</p>"},{"name":"Bases Loaded II: Second Season","year":1988,"developer":"Tose Co., Ltd.","url":":Bases Loaded 2","filesize":147545,"score":5.9,"genres":"Sports > Behind view > Diagonal-down > Baseball","desc":"<p>In this version of Bases Loaded you coach your team through a 130-game season in either an Eastern or western division of a professional baseball league. Win the pennant and you're off to the World Series! You can also play head-to-head with a friend.</p><p>Choose from six teams in each division. Once you take your place in the dugout you're the manager, juggling your own lineup and battling order. You'll also have to somewhat of a psychologists as you learn to interpret the Player Performance Ratings. This unique feature of Bases Loaded II rates each player in three categories: physical, sensitivity, and intellectual. Each rating is like a biorhythm, going up and down, just like in real life. The Player Performance Ratings simulate what players really go through - streaks and slumps.Bases Loaded II also features similar realistic on-field action that was present in the first game of the series.</p>"},{"name":"Bases Loaded 3","year":1990,"developer":"Tose Co., Ltd.","url":":Bases Loaded 3 (USA)","filesize":156821,"score":5.9,"genres":"Sports > Behind view > Diagonal-down > Baseball","desc":"<p>Bases Loaded 3 was Jaleco's latest entry into the popular baseball series in 1991. Changes over the previous title included slightly more detailed fielders, a new field perspective (home plate at the top of the screen, center field at the bottom), an editable team, and a new goal: to play the perfect game of baseball against the computer. Simply winning the game was no longer enough; the gamer now had to avoid common baseball missteps such as making an error and striking out, in order to earn a perfect rating. Against the very clever computer pitching, this could prove quite difficult.</p>"},{"name":"Bases Loaded 4","year":1991,"developer":"Tose Co., Ltd.","url":":Bases Loaded 4 (USA)","filesize":164688,"score":"","genres":"Sports > Behind view > Diagonal-down > Baseball","desc":"<p>Bases Loaded 4 was Jaleco's last 8-bit entry in the long-running baseball series. The game featured slightly more elaborate animations than its predecessor, and much larger fielders. Removed was the goal to play a flawless game; instead the game featured more traditional modes, including exhibition games and full season play.</p><p>Geared more toward fast-paced arcade gameplay than simulation, Bases Loaded 4 was not licensed by Major League Baseball or the Major League Baseball Players' Association, and did not feature real American or Japanese teams or players.</p>"},{"name":"Batman Returns","year":1993,"developer":"Konami Co., Ltd.","url":":Batman Returns (Europe)","filesize":222335,"score":6.5,"genres":"Action > Racing / Driving > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p>Like Konami's other adaptation of <em>Batman Returns</em>, the NES version is a side-scrolling beat 'em up. Next to brawling action, it also features two sections where the player controls the Batmobile and the Batskiboat seen in the movie.</p><p>In the beat 'em up sections, Batman has to defeat a large number of enemies (members of the Penguin's circus gang) to advance. Possible attacks include punches, sliding attacks, drop kicks and a powerful 360° cape slash attack which will drain Batman's health bar. Gadgets to be used include a limited number of batarangs and a grappling hook. The hook is useful for many things: it can take down flying enemies, pull Batman up to higher levels, lets him climb into open windows and more. Hidden in background items somewhere in the levels are power-ups, including hearts that refill the health bar and extra batarangs.</p><p>Each of the six levels in the game concludes with a boss fight against one or more especially powerful enemies.</p><p>The Batmobile is armed with machine guns and bat discs, used to dispatch the enemy bikes and cars in the driving level. The Batskiboat section is similar, except that there are no enemies and the only goal is to collect coins for extra points.</p>"},{"name":"Batman: Return of the Joker","year":1991,"developer":"Sun Electronics Corp.","url":":Batman - Return of the Joker (Europe)","filesize":208119,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Joker lives again in SunSoft's sequel to their NES original. The Joker has somehow managed to escape from Arkham Asylum once again, and Batman must fight him across seven stages to restore peace to Gotham City.</p><p>Batman carries a gauntlet shooting basic bullets by default. This can be upgraded with weapon powerups located in boxes throughout the level, giving access to homing and energy weapons. Every upgrade weapon can be charged up for a secondary attack, different for each weapon. Batman also has a slide useful against most enemies and some bosses. </p><p>Boss fights introduce a system where life is measured by points instead of tick marks or bars. In these sections, Batman has significantly more health, and can take many more hits when rumbling with these stronger foes.</p><p>Levels include a snowy landscape, moving train, military base, and sewers. Two levels require you to run and dodge explosions while vehicles keep pace in the background. Some levels also have Batman activate a jetpack and play through a short side-scrolling shooter. </p><p>This game is one of the few Batman games that was not based directly on a movie or television series.</p>"},{"name":"Batman: The Video Game","year":1989,"developer":"Sun Electronics Corp.","url":":Batman - The Video Game (USA)","filesize":157135,"score":8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The NES version of <em>Batman: The Video Game</em> is loosely based on the 1989 movie. It is a side-scrolling game, with a blue dressed Batman fighting enemies such as robots, jet-packed soldiers, ninjas and mutants.</p><p>The game consists in five levels somewhat related to the movie: Gotham City streets (with Killer Moth as the final boss), AXIS Chemical Factory (with Machine Intelligence System as boss), Underground Conduit (with Electrocutioner as boss), the Laboratory Ruins (the Dual-Container Alarm as boss) and Gotham's Cathedral (with Firebug as boss) where Batman finally faces the Joker. Before each level, a cutscene with scenes from the movie is displayed.</p><p>Besides his ever trusting punches, Batman has plenty of weapons in his utility belt: the Batarang, the Spear Gun and the Dirk (a three direction weapon). Batman has an ammunition counter shared for the three weapons. The Batarang takes one pellet per shot, the Spear Gun two pellets and the Dirk, three. Batman also has an eight hit life bar, which can be replenished by collecting hearts dropped by killed enemies. The enemies will also drop pellet items (10 pellets per item) and bonus items (which will only sum up points).</p><p>Batman can also perform a \"wall jump\": he'll grab a wall when jumping toward it, allowing him to escalate some narrow passages. Batman has three lives and unlimited continues.</p>"},{"name":"Bats & Terry","year":1987,"developer":"Use Corporation"},{"name":"Battle Chess","year":1990,"developer":"Interplay Productions, Inc.","url":":Battle Chess","filesize":137897,"score":7,"genres":"Strategy > Top-down > Turn-based > Board game > Chess > Fantasy","desc":"<p><em>Battle Chess</em> is a quite typical chess game, but it comes with a twist: all pieces are represented by small, realistic figures that walk around on the chessboard, and when one piece takes another, they both take part in an animated battle. There is a different animation for each permutation, depending on which pieces are capturing or being captured. You can also play in 2D without animation. </p><p>The game's opening library includes 30,000 different moves, ensuring a variety of games will unfold across the 10 skill levels. </p><p>Multi-player support can be extended to modem and/or serial port play.</p>"},{"name":"Battle City","year":1985,"developer":"Namco Limited"},{"name":"Battle of Olympus, The","year":1988,"developer":"Infinity Co., Ltd.","url":":Battle of Olympus, The (Europe)","filesize":100231,"score":7.1,"genres":"Action > Side view > 2D scrolling > Fixed / flip-screen > Metroidvania > Classical antiquity","desc":"<p><em>The Battle of Olympus</em> is an action game with light role-playing elements. It is set in ancient Greece and casts the player in the role of Orpheus, whose girlfriend, Helene, has been kidnapped by the demonic ruler of the netherworld called Hades. Orpheus must consult the powerful gods and have their help in order to defeat Hades and free Helene.</p><p>This game is similar to Zelda II: The Adventure of Link in presentation and side-scrolling combat style. However, it is not a full-fledged RPG like <em>Zelda II</em>, since it lacks player-dependent character-building. The game world consists of interconnected, maze-like side-scrolling sections that include both towns and hostile areas where Orpheus fights his way through the minions of Hades. There are various items one must get to continue to the next location, including swords, shields and crystals. There are three fragments of love hidden around; Orpheus has to find them before he can enter Tartarus and fight Hades to save his beloved Helene.</p><p>The game sometimes references specific Greek myths, but often interprets them liberally (i.e. Orpheus is a warrior rather than a musician, his beloved one is Helene and not Eurydice, etc.). The monsters of the game are also based on the Greek mythology and include cyclopes, minotaurs, pegasuses, and others.</p>"},{"name":"Battle Storm","year":1991,"developer":"Bullet-Proof Software, Inc."},{"name":"Battleship","year":1993,"developer":"Mindscape, Inc.","url":":Battleship (USA)","filesize":26164,"score":4.7,"genres":"Strategy > Top-down > Turn-based > Naval / watercraft > Licensed","desc":"<p><em>Battleship</em> for NES and Game Gear is an adaptation of the pen and paper battleship game that puts its own spin on the concept. The ship lineup is unique in designations and sizes, the grid is 12 by 8 instead of the standard 10 by 10, and only one shot can be made per turn regardless of if it hits or not. Major changes from the classic game are a level structure and special weapons. The game contains eight larger levels, consisting of five sub-stages each, with passwords awarded after a successful battle. Each main level adds a new gameplay element: either a new ship (submarine and carrier are not available from the start) or a new weapon for an existing ship. The special weapons fire many missiles many points across a set grid, for instance in an X pattern. The bigger the ship, the larger the grid area. Each ship can only shoot its special missile once per game and if the ship carrying the weapon is destroyed then the weapon becomes unusable. Later stages add reconnaissance weapons: a sonar that can only detect the submarine and an aerial recon that can spot any ship.</p>"},{"name":"Battletoads","year":1991,"developer":"Rare Limited","url":":Battletoads (USA)","filesize":190893,"score":7.1,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Surfing > Sci-fi / futuristic","desc":"<p>The Dark Queen has attacked and kidnapped (toadnapped?) your best buddy. To make matters worse, she nabbed the best looking girl around! So, what will you do? Cry? Whimper? Hide? Call the Starcops? NO! Cause you're a Battletoad! Battletoads don't cry, hide or call for help! And they certainly don't whimper! They get MAD then they get EVEN! So grab your blaster, hop on the Toadster and go get 'em!</p><p>You will control a battletoad through 13 levels (five of which are missing from the Game Boy port). Some are side-scrolling beat-em-ups, other are vertical drops down a shaft, fighting as you go, others have you riding a rocket or surfboard, shooting or avoiding enemies. At the end of each area, there is a boss. In some areas, about half-way through, you may have a mini-boss.</p>"},{"name":"Battletoads / Double Dragon","year":1993,"developer":"Rare Limited","url":":Battletoads-Double Dragon (Europe)","filesize":189792,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Platform > Sci-fi / futuristic > Licensed","desc":"<p>Earth is under fire by Colossus, a battleship the size of a city. Using powerful laser cannons, it has destroyed most of Earth's defence forces, while its many troops clean up the rest of the planet. All expect for 5 warriors.</p><p>The Battletoads, who are well aware of evil forces in the galaxy, join forces with Billy and Jimmy Lee from Double Dragon to defend Earth from the deadly ship and its troops. Using a range of special moves you must fight your way through the streets into the heart of the ship and destroy it.</p>"},{"name":"Bee 52","year":1992,"developer":"The Codemasters Software Company Limited","url":":Bee 52 (USA) (Unl)","filesize":54596,"score":6.4,"genres":"Action > Side view > 2D scrolling > Shooter","desc":"<p>You are bee number 52, and you need to collect enough honey every day to fill your quota. But the backyard can be a dangerous place for a bee! Spiders, grasshoppers, assorted bugs, and even lawn sprinklers are all over the place and try to stop bee 52 from reaching the many flowers where honey can be collected. Even after collecting honey, you may need to defend your nest against ants who will try to sneek in and steal honey from you. Bee 52 is armed, however, and can sting or shoot many of the enemies that get in the way. Some levels even have bugs that, when shot, will provide bee 52 with more powerful firepower temporarily. Bee 52 is a side scrolling shooter which can be played by one or two players.</p>"},{"name":"Beerslinger","year":2015,"developer":"Greeting Carts"},{"name":"Beetlejuice","year":1991,"developer":"Rare Limited","url":":Beetlejuice (USA)","filesize":98161,"score":5.1,"genres":"Action > Side view > Licensed","desc":"<p>Based on the 1988 Michael Keaton movie, Beetlejuice follows the rough storyline of the movie. A ghoul named Beetlejuice is hired by a recently deceased couple to scare away the new occupants of their old home. The game is a side scrolling action game where the lead character can run, jump, and stomp his way through the house while collecting \"scare points\" to help in his ultimate goal. The house is equipped with all manner of traps including incinerating lasers, and even the torches hurt.</p>"},{"name":"Best of the Best Championship Karate","year":1992,"developer":"Loriciels","url":":Best of the Best - Championship Karate (Europe)","filesize":118709,"score":6.8,"genres":"Sports > Side view > Fixed / flip-screen > Fighting > Boxing > Martial arts","desc":"<p><em>Best of the Best Championship Karate</em> is a realistic fighting game.After you choose your fighter for his parameters (strength, stamina and resistance), you can choose from 55 different moves.You can now train your fighter at a gym before the real fights.To master the game, one must alternate training and fights, as training improves stamina, strength and resistance.Be careful, losing a fight reduces those parameters, so you have to be ready before getting in the ring!</p>"},{"name":"Bible Adventures","year":1991,"developer":"Wisdom Tree, Inc.","url":":Bible Adventures (USA) (v1.4) (Unl)","filesize":75110,"score":4.3,"genres":"Action > Educational > Side view > Arcade > Platform > Religion","desc":"<p><em>Bible Adventures</em> contains three different side scrolling platform games, each with a different bible theme. </p><p>The first game is Noah's Ark. Here the player needs to search forests, caverns, and mountains to find a male and female of each species and bring them back to the ark before the flood begins. The next game is Save Baby Moses, where the player needs to get past numerous soldiers and other obstacles to bring the baby Moses to safety. The last game is David and Goliath. As the shepherd David, the player needs to round up and protect the family's flock of sheep. After all of the sheep are safe, the player will then need to face Goliath.</p><p>The game features scripture taken from the Holy Bible, New International Version to provide clues or information.</p>"},{"name":"Bible Buffet","year":1993,"developer":"Wisdom Tree, Inc."},{"name":"Big Bird's Hide and Speak","year":1990,"developer":"Riedel Software Productions, Inc."},{"name":"Big Nose Freaks Out","year":1992,"developer":"Optimus Software Ltd","url":":Big Nose Freaks Out (USA) (Unl)","filesize":152029,"score":"","genres":"Action > Side view > Arcade > Platform","desc":"<p>On a Tuesday afternoon sometime in 17 million BC, Big Nose the caveman was on his way to the Savings and Bones to deposit a large amount of savings. But before he got there, Leroy the Lizardman knocked out Big Nose and stole his savings. When Big Nose woke up and realized his savings were gone, he freaked out! Now he created a wheel with a platform on it and is out to get Leroy. Big Nose Freaks Out is a side scrolling platform action game. There are five sections of gameplay each with four levels to clear. At the end of each section Leroy will be waiting with a large monster. To fight back Big Nose has his trusty club with him. Also, rocks can be found along the way and the club used to bat them at enemies. There are many hidden treasures, hidden levels, and even some level warps to search for.</p><p>The game also features two different two player modes. The <em>Two Player Relay</em> mode has two players taking turns on the normal single player game, Once one player dies in a level, the other player continues where the first player left off. In the <em>Two Player Challenge</em> mode players take turns and each player is given sixty seconds to collect as many bones as they can in five different rounds. The player who collects the most bones wins.</p>"},{"name":"Big Nose the Caveman","year":1991,"developer":"Optimus Software Ltd","url":":Big Nose the Caveman (USA) (Unl)","filesize":128622,"score":6.4,"genres":"Action > Side view > Platform","desc":"<p>Long, long time ago (but not necessarily in a galaxy far, far away), there was a caveman named Big Nose. One day he went out of his cave and saw a pterodactyl flying around. \"That will be my dinner\", - thought Big Nose, took out his trusty club and ran after the winged reptile. Naturally, his quest for nutrition became much longer and more dangerous than he had ever imagined...</p><p>In this platform action game, you guide Big Nose through prehistoric levels, fighting prehistoric animals of various kinds. Big Nose starts out with his club, but will gain other, more powerful weapons. During your quest you can collect bones, which are the currency of the game. There are shops in which you can buy weapons and various spells that you'll be able to cast.</p>"},{"name":"Bigfoot","year":1990,"developer":"Beam Software Pty., Ltd.","url":":Bigfoot (USA)","filesize":105261,"score":5.5,"genres":"Racing / Driving > Side view > Top-down","desc":"<p>Monster truck game where you go from LA to NYC through different kinds of races.</p><p>At every stop, you first drive a qualification round against your opponent, which is in top-down perspective. Here, you can collect money and several power-ups to use to win against your opponent. After this qualification, you go into a side perspective head to head race, where you have to push left and right continuously. In this view there are all sorts of events, including Car Crush, Mud Race and Drag Race. Before these races, you can (read: must) also buy upgrades for your cars, with the money you collected in the qualify race.</p><p>The game is supported to play 2 players.</p>"},{"name":"Bikkuriman World: Gekitō Sei Senshi","year":1990,"developer":"Atlus Co., Ltd."},{"name":"Bill & Ted's Excellent Video Game Adventure","year":1991,"developer":"Rocket Science Productions, Inc.","url":":Bill & Ted's Excellent Video Game Adventure (USA)","filesize":128218,"score":4.5,"genres":"Action > Isometric > Licensed","desc":"<p>Bill and Ted are two surfer-speaking 1980s high school dudes from San Dimas, California. After the events of the film <em>Bill and Ted's Excellent Adventure</em>, they seem free to build the band that will one day unite Earth's people and bring about world peace. Except... Rufus returns from the future with a warning that someone has warped the time continuum by kidnapping historical figures and stranding them in the wrong time period (...sooo, basically what Bill and Ted did in the first film?) It's up to the boys to sort out the mess.</p><p>The player controls either Bill or Ted, who have split up to tackle the quest (allowing each to leave items to assist the other). Each \"mission\" begins by consulting a phone book of historical figures, and spotting the page whose number has changed (a second number, flashing in red). The player dials that number, and guides the phone booth through the circuits of time. Rufus could only lend a payphone, so players will need to plot out the shortest path to their destination, while avoiding any hazards. Each change in direction costs one coin.</p><p>Once in the target time period, the player controls Bill or Ted through an isometric view as they search for the displaced historical figure. The player must stick to a defined path to avoid falling, and must be cautious of the locals. Some will offer clues or helpful items, while others demand a coin if bumped into. Other locals will actively chase Bill and Ted and throw them in jail, where they must use a skeleton key (if they have one) to escape. Players can find and collect coins for the phone booth, keys for the jail, and distractions (like pudding or tape players) to throw off any pursuers.</p><p>The player must also locate an item of \"historical bait,\" appropriate to the target, to get them to follow. Once the historical dude has been baited and bagged, the player switches to the other member of the titular duo to rescue a new historical celebrity. The process repeats until time is corrected.</p>"},{"name":"Bill Elliott's NASCAR Challenge","year":1991,"developer":"Distinctive Software, Inc.","url":":Bill Elliott's NASCAR Challenge (USA)","filesize":163839,"score":6.2,"genres":"Racing / Driving > 1st-person > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>The signature of former champion Bill Elliott adorns one of the first few NASCAR racing games. There are six tracks, including favorites such as Watkins Glen and Talladega. The game is played through an in car view. Aerodynamic modifications and the drafting effect are incorporated. It features a practice mode as well as full races. Many brand name cars from Pontiac and Ford, fully customizable. Track details are flat shaded polygons. Instant replays are controlled by a VCR-style system.</p>"},{"name":"Binary Land","year":1985,"developer":"Hudson Soft Company, Ltd."},{"name":"Bio Miracle Bokutte Upa","year":1988,"developer":"Konami Co., Ltd."},{"name":"Bio-Senshi Dan: Increaser to no Tatakai","year":1987,"developer":""},{"name":"Bionic Commando","year":1988,"developer":"Capcom Co., Ltd.","url":":Bionic Commando (USA)","filesize":150189,"score":7.8,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Shooter > Direct control > Sci-fi / futuristic > Regional differences","desc":"<p>At some point during the 1980's the world has become a stage of battle between the Federation and the Empire. The latter sees itself as the successor state to the malevolent Badds, also known as the Nazz. One day, the Federation discovers that the Imperial leader Generalissimo Killt decides to complete an unfinished project codenamed \"Albatros\" and started by the Badds. The Federation sends their hero Super Joe to stop the Empire's plans, but he is captured. Ladd Spencer, a member of the special FF Battalion, is dispatched to rescue Super Joe and uncover the enemy's secrets.</p><p>This version of <em>Bionic Commando</em> is loosely based on the original arcade game and its computer ports, having different levels and plot. The protagonist is a soldier with a bionic arm that extends and contracts. His arm allows him to grab on to fixed objects to swing around and climb up platforms, which is the only way to do so due to the lack of a jumping ability. The arm also grabs opponents and pulls them towards the player character.</p><p>After most levels the Bionic Commando will receive items. Often these items are required to successfully complete other levels. Additionally, each level will require a different colored communicator in order to make sense of message traffic.</p>"},{"name":"Bird Week","year":1986,"developer":"Lenar Co., Ltd."},{"name":"Bishōjo Control","year":1990,"developer":"HARD"},{"name":"Bishōjo Shashinkan: Moving School","year":1987,"developer":"HARD"},{"name":"Black Bass II, The","year":1988,"developer":"Another Ltd."},{"name":"Black Bass, The","year":1987,"developer":"Another Ltd.","url":":Black Bass","filesize":63380,"score":"","genres":"Sports > Fishing","desc":"<p><em>The Black Bass</em> is a simple fishing game. Players first choose from a few different lures. Then players have to cast the lures into the water using a meter to gauge the distance their fishing line is cast. Finally, players are presented a side view of the bottom of a lake. Players can move the lure back and forth to attract a bass to take a bite. If the bass falls for the bait and gets caught on the fishing hook, the player has to slowly and carefully reel in the fish. If the player is to careless reeling in a fish, the line can snap and cost the player a lure and the fish.</p>"},{"name":"Black Onyx, The","year":1988,"developer":"Bullet-Proof Software, Inc."},{"name":"Blackjack","year":1992,"developer":"Odyssey Software, Inc.","url":":Blackjack (USA) (Unl)","filesize":19363,"score":"","genres":"Gambling > Strategy > Top-down > Cards / tiles","desc":"<p>The unlicensed <em>Blackjack</em> plays just like the ‘American Blackjack’ rules found in the casino compete with all the things you expect to find like split, double down (named as double, used with restrictions), surrender (named as ‘give up’, not used in most real casinos) and insurance (named as insure) as well as the push and charlie rules. Before starting the game, the player can select things like starting money, table limit, and the number of decks used as well as changing the color and design of the cards. Two-player mode is also available with both players taking turns with ether one or two controllers.</p>"},{"name":"Blade Buster","year":2010,"developer":"High Level Challenge"},{"name":"Blades of Steel","year":1988,"developer":"Konami Co., Ltd.","url":":Blades of Steel","filesize":83229,"score":7.2,"genres":"Sports > Diagonal-down > Direct control > Hockey","desc":"<p>Based on the arcade game, <em>Blades Of Steel</em> is a hockey arcade action game (gameplay doesn't require the need to worry about statistics or provide the ability to customize teams.) Two players can play against each other, or one player against the computer. In one player mode there are single game and tournament mode options. From time to time a fight may break out, which will provide a close up view of the two players. The player has control during the miniature fight game sequence, with the loser having to spend time in the penalty box. The referee will break up fights that go on too long, and calls a few penalties such as icing. Several short clips of digitized voices are also featured.</p>"},{"name":"Blaster Master","year":1988,"developer":"Sun Corporation","url":":Blaster Master (USA)","filesize":159243,"score":7.9,"genres":"Action > Side view > Top-down > 2D scrolling > Metroidvania > Platform > Shooter > Tank > Sci-fi / futuristic > Regional differences","desc":"<p>The game begins with a classic story of a boy and his frog who runs away, becomes radioactive and jumps into a hole. More importantly however, it is a story about a boy named Jason who finds a fully functional battletank, SOFIA the 3rd, and goes adventuring around the underground. His mission is to find new weapons and add-on parts to the battletank, which will in turn allow him to explore more areas until eventually he finds that freedom-loving mutant frog. And while he's down there he might as well defeat the Evil Plutonium Boss who wishes to threaten the Earth.</p><p><em>Blaster Master</em> is an action game that mixes platform and overhead segments. Most of the platforming levels are spent in the tank, which can fire its main cannon as well as secondary weapons with limited ammunition: homing missiles, lightning ball, and warhead missile. The tank cannot access every area in the platform levels; in order to advance, Jason often has to step out and explore on foot.</p><p>At that point the view switches to top-down. Jason can use his gun and toss grenades to dispatch of regular enemies and bosses encountered on his way. The gun can be upgraded by collecting power-ups. The goal of the top-down stages usually involves obtaining special abilities for the tank, such as swimming, driving on walls, and hovering in the air, which must be used at specific locations in the platform stages.</p><p>The game uses a \"continue\" system and ends when Jason has lost all his lives. There is no password feature and no possibility to save game progress.</p>"},{"name":"Bloody Warriors: Shan Go no Gyakushū","year":1990,"developer":"Toei Animation Co., Ltd."},{"name":"Blow'em Out!","year":2014,"developer":"Retroscribe"},{"name":"Blue Marlin, The","year":1991,"developer":"Hot-B Co., Ltd."},{"name":"Blues Brothers, The","year":1992,"developer":"Titus France SA","url":":Blues Brothers, The (USA)","filesize":61799,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Blues Brothers are on the run from the law. Take control of either bulky Jake or nippy Elwood in this five-level platform game. You must cross a prison, a river and the big city to reach freedom. You also must find your missing records and collect these. Everything and everyone is against you, but you can pick up and throw warehouse crates to defeat your opponents.</p>"},{"name":"Bo Jackson Baseball","year":1991,"developer":"Beam Software Pty., Ltd.","url":":Bo Jackson Baseball (USA)","filesize":143868,"score":5.9,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>Bo Jackson was the first all-star athlete in two major sports, Baseball and American Football. <em>Bo Jackson Baseball</em> is a game about Bo Jackson baseball career. This game plays lake a standard baseball nine (or 5 – 8 if you wish) innings baseball game. There are three difficulty levels giving access to players at all still levels. When pitching you are given 5 different pitch types that pitcher chooses by pressing the correct directional button before the pitch, therefore keeping it hidden from your opponent. Batting is done the same way but the type of hit is chosen as the batter hits the ball.</p><p>At any moment, base sneaking can be made (by the batter) or stopped (by the pitcher). Fielding is only done using the CPU, but once the fielder gets the ball then you must choose what base to throw to using the directional buttons. All of the teams are just city names and players, all with different stats, are fictional except for Bo Jackson himself who is hidden in the game.</p>"},{"name":"Böbl","year":2020,"developer":"Morphcat Games UG"},{"name":"BodyConQuest I: Abakareshi Musume Tachi","year":1987,"developer":"Hacker International"},{"name":"Bokosuka Wars","year":1985,"developer":""},{"name":"Bomberman","year":1985,"developer":"Hudson Soft Company, Ltd.","url":":Bomberman (USA)","filesize":16609,"score":6.4,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Direct control > Sci-fi / futuristic","desc":"<p>Bomberman was a robot in a bomb making factory who longed for his freedom. Rumors circulated that escaping to the surface would allow the robot to become human. Getting out would be the trick. Each room is inhabited by monsters that must be neutralized and the exit itself hidden underneath bricks.</p><p>The first of the <em>Bomberman</em> series, <em>Bomberman</em> is a single-player game with a top down view and simplistic controls. In fact, in addition to movement, the player only has a single ability: placing bombs. Each bomb explodes into a cross-shaped blast (four directions) which can destroy either enemies or blocks. Power-ups may be found to increase the size of the blast, place additional bombs, increase the speed of the Bomberman or to walk through walls. The goal on each level is to destroy all enemies and escape through the exit before the time limit is up. Hitting the exit with a bomb blast releases more enemies which must also be destroyed.</p>"},{"name":"Bomberman II","year":1991,"developer":"Hudson Soft Company, Ltd.","url":":Bomberman II (USA)","filesize":67698,"score":7.4,"genres":"Action > Top-down > Fixed / flip-screen > Anime / Manga > Arcade > Direct control > Sci-fi / futuristic","desc":"<p>Our hero the white Bomberman (Bomberman Shiro) was walking down the street one day when he witnessed a robbery. It was black Bomberman (Bomberman Kuro) who was the robber. But Black Bomberman knocked White Bomberman to the ground, and than left the money so that he would be framed. Now Bomberman has been taken to jail and must fight his way out of this place using the only method he knows: explosive bombs.</p><p>Bomberman is the second Bomberman game in the series and plays similar to the first, only all gameplay has been reduced to a single screen. Your goal however remains the same on a smaller playing area. You are to destroy all enemies on a level and then find the exit to the next one. Bombing the exit is always a bad idea. The occasional power-up will increase your bomb blast, number of bombs on the screen at one time, player speed or give you the ability to walk through walls.</p><p>In addition to the single Player game, Bomberman II introduces a Versus Mode for 2 players and a Battle Mode for 3. Your goal in these is to destroy the other players while staying alive yourself.</p>"},{"name":"Bonk's Adventure","year":1993,"developer":"Atlus","url":":Bonk's Adventure (USA)","filesize":147655,"score":7.7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Prehistoric","desc":"<p><em>Bonk's Adventure</em> is a prehistoric platform game where you are in control of a large bald headed caveman, guiding him through the levels taking out all manner of strange prehistoric creatures that get in your way including King Drools henchmen - all in effort to free the captured/controlled residents of Moonland (bosses) - including the Princess Za from King Drool attempted take over.</p><p>The game is not unlike other platform games of the era. Though it's unique in that you can climb walls and swing on rope with your teeth and your only method of attack is head butting enemies - straight forward or dive bomb style. The game starts off with simplistic point A to point B style, but focuses more on exploration in the later stages, which include finding hidden bonus areas. </p><p>The game is also known for its trademark gameplay mechanism of 'spin attack', where Bonk floats through the air if you have the turbo button on. This can be used to float around the level and reach areas for extra/hidden items, but also as a method of attack as well. The game starts you off with 3 hearts, but allows you to increase this number when you find special heart container items, allowing Bonk to take a number of hits before dying.</p><p>A variety of bonus stages can be found throughout the game, which provide bonus points upon completion and thus resulting in accumulating extra lives. Enemies themselves can be 'milked' for points in that you can keep 'bonking' their dead bodies and not letting them hit the ground. Spin attack is another method for doing this.</p>"},{"name":"Booby Kids","year":1987,"developer":"Nihon Bussan Co., Ltd."},{"name":"Bootèe","year":2018,"developer":"The Mojon Twins"},{"name":"Boulder Dash","year":1990,"developer":"First Star Software, Inc.","url":":Boulder Dash (USA)","filesize":36822,"score":7.6,"genres":"Action > Side view > 2D scrolling > Arcade > Puzzle elements > Direct control","desc":"<p>You are Rockford, and you have to dig through monster infested caves in search of diamonds. In each level you must collect a certain number of these diamonds, in order to open a portal to the next stage. Enemies can be squashed by falling boulders, which are released when the ground below them is removed or they are pushed onto empty ground, but be careful because these can also squash you. In later levels, difficulty is increased by many puzzle elements and shorter time limits.</p><p>There are 16 levels to be completed and five different skill levels available, which affect the number of jewels which must be collected and the time limit.</p>"},{"name":"Bram Stoker's Dracula","year":1993,"developer":"Probe Software Ltd.","url":":Bram Stoker's Dracula (Europe)","filesize":116283,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Horror > Licensed","desc":"<p><em>Bram Stroker's Dracula</em> is a side-scroller platform game loosely based on the 1992 film of the same name. Players take the role of Jonathan Harker whose mission is to destroy Count Dracula by first heading to Transylvania and then London.</p><p>Jonathan Harker can move left and right, jump and attack with a weapon, the most basic of which is a knife. The status display on the screen shows Harker's health bar, countdown timer to complete the level and currently held weapon. Throughout the levels question mark boxes (similar to the Mario games) can be found, attacking these will reveal power ups which include health restoration, timer increase and new weapons. Among these new weapons are axes, daggers and a shotgun. Question mark boxes can also be used as platforms to reach other areas and enemies. Each stage is divided into two sections: the \"Daytime\" and the \"Nighttime\". These are entirely different levels comparable to stage 1-a and 1-b. Harker must jump to various platforms and obstacles and defeat minor enemies throughout the levels. The end of a Nighttime level is usually guarded by a boss creature who must be defeated to progress.</p>"},{"name":"Break Time: The National Pool Tour","year":1993,"developer":"Opera House Inc.","url":":Break Time - The National Pool Tour (USA)","filesize":75112,"score":"","genres":"Sports > Top-down > Pool / snooker","desc":"<p>Time to \"rack 'em up\" in this late release from FCI. Choose one of four different games - Rotation, 8-ball, 9-ball, and 14-1 Rack Game - each based on professional pool rules. As if that wasn't enough, also included are Practice and Watch Modes and the \"National Pool Tour,\" where you must test your skills against five different pros in five different cities on your way to becoming the champion. Features digitized commentary and password save.</p>"},{"name":"BreakThru","year":1987,"developer":"Data East Corporation","url":":BreakThru (USA)","filesize":59089,"score":4.6,"genres":"Action > Racing / Driving > Diagonal-down > Arcade > Shooter > Automobile","desc":"<p><em>BreakThru</em> is a 2D side-scrolling vehicle shooter. Your mission: race, jump, and blast your way through five levels (mountains, bridge, plains, city, and airfield) of enemy defenses to recapture the stolen jet fighter. A host of enemy soldiers, mines, vehicles, and aircraft will try to stop you, though. Oh yeah... and don't forget to watch out for those rocket attacks and falling rocks!</p>"},{"name":"Breeder","year":1986,"developer":"Soft Pro International"},{"name":"Bubble Bath Babes","year":1991,"developer":"Hacker International"},{"name":"Bubble Bobble","year":1987,"developer":"Taito Corporation","url":":Bubble Bobble (USA)","filesize":50598,"score":7.9,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p><em>Bubble Bobble</em> is the story of two humans, Bub and Bob who wander into the mysterious cave of monsters and magically turn into dinosaurs. The only way to transform back is to reach the end of the cave...</p><p><em>Bubble Bobble</em> is a platform game, with each level being a single screen. The enemies must be cleared from a level to go to the next one. With one player controlling Bub and the other controlling Bob, the player can jump and collect items for points (such as fruit). The real power Bub and Bob have however is the ability to blow bubbles. These bubbles can be as platforms to leap on, or to trap enemies. Enemies trapped in a bubble must be popped by jumping into them, wherein they'll turn to fruit. Additionally, power-ups sometimes float by in bubbles. They include lightning, which flies out horizontally at enemies, and water, which drags the player and enemies straight down flowing over platforms. Taking too long to complete any level will summon Baron Von Blubba, who will float around the screen trying to destroy the player.</p><p>The NES version has a few extra stages bringing the total number of stages to 112. The Sharp X68000 version contains a hidden minigame called Sybubblun. It contains a set of 20 original difficult levels with the game being reskinned with a Syvalion theme.</p>"},{"name":"Bubble Bobble Part 2","year":1993,"developer":"ITL Co., Ltd.","url":":Bubble Bobble Part 2 (USA)","filesize":122537,"score":7.1,"genres":"Action > Side view > Fixed / flip-screen > Platform","desc":"<p>Cubby and Rubby, descendants of Bub and Bob from the original Bubble Bobble, must rescue their friend Judy, who has been kidnapped by the evil Skull Brothers!</p><p>The game plays much like the original game: You use a dinosaur that spits bubbles at their enemies, trapping them until you touch the bubbles to make them pop and defeat the trapped enemies. But Cubby and Rubby have two skills their ancestors did not: by holding down the attack button, they can float upwards - and by releasing it, they'll fire several bubbles at once. They can also pick up special items that increase their points, speed and attack power. This game features 80 levels, all-new enemies, and bonus mini-games.</p>"},{"name":"Bucky O'Hare","year":1992,"developer":"Konami Co., Ltd.","url":":Bucky O'Hare (Europe)","filesize":162553,"score":8.1,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>Captain Bucky O'Hare and his loyal crew - Blinky, Deadeye, Jenny, and Willy - fight to save the Aniverse from the scourge of the Toad Armada. That is until Bucky's ship is attacked and his crew taken prisoner. Now a lone bunny on a mission, Bucky must fight to rescue his comrades from four hostile planets and then confront the Air Marshall on his flagship.</p><p><em>Bucky O'Hare</em> is a side-scrolling action game based on the cartoon of the same name. Bucky's main abilities are a jump and a blaster weapon, which he can charge up to make an even more powerful jump. Life and Weapon bars are displayed at the bottom of the screen. Bucky can obtain new weapons throughout the game from his crew members.</p>"},{"name":"Bugs Bunny Birthday Blowout, The","year":1990,"developer":"Kotobuki System Co., Ltd.","url":":Bugs Bunny Birthday Blowout, The (USA)","filesize":123240,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Bugs Bunny Birthday Blowout takes place as Bugs is invited to his 50th birthday. Because some of the other Warner Bros. toons weren't invited (including Wile E. Coyote), they decided to stop Bugs from going to this party.</p><p>A Warner Bros licensed game, The Bugs Bunny Birthday Blowout is a 2d side-scrolling platform game. Bugs can jump over and on some enemies and try to collect as many carrots as possible. Bugs can use his hammer in order to smash enemies as well as to find some secrets.</p>"},{"name":"Bugs Bunny Crazy Castle, The","year":1989,"developer":"Kotobuki System Co., Ltd.","url":":Bugs Bunny Crazy Castle, The (USA)","filesize":37178,"score":5.8,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > Licensed > Regional differences","desc":"<p>Honey Bunny has been taken captive and Bugs Bunny is off to rescue her. Bugs has to contend with those rascals Daffy Duck, Sylvester, Wiley Coyote, and Yosemite Sam who intend to stop him from completing this task.</p><p>The game consists of sixty levels. Bugs must collect all the carrots on a level to beat it. This is not as straight forward as it seems as levels are typically maze like with many stairs and pipes that have to be navigated for Bugs to find all the carrots. Also, while Bugs is trying to find his way he'll have enemies constantly chasing him. He can deal with these enemies by pushing heavy objects on top of them or find boxing gloves that let him punch his adversaries. Bugs can also find an item called Magic Carrot Juice which gives him temporary invincibility.</p><p>This version should not be confused with the same titled Game Boy version which has its own unique level layouts.</p>"},{"name":"Bump 'N' Jump","year":1986,"developer":"Data East Corporation","url":":Bump'n'Jump (USA)","filesize":33404,"score":7.3,"genres":"Racing / Driving > Top-down > 2D scrolling > Arcade > Automobile > Track racing","desc":"<p><em>Bump 'N' Jump</em> is an action racing game played from a top down point of view. As you race through the treacherous and ever changing roadways, the numerous enemy cars will be trying to bump you off the road. You need to make sure you bump the cars out of the way before you get bumped and crash into the sides yourself! Your car also has the ability to jump quite high if you have enough speed. This is useful to jump over enemy cars if there are too many in the way, and must also be used to jump gaps in the roadway and other highway obstacles. As the levels progress, the road becomes narrower with more obstacles in the way, and the other cars increase in number and in aggressiveness.</p>"},{"name":"Burai Fighter","year":1990,"developer":"KID Corp.","url":":Burai Fighter (USA)","filesize":44917,"score":7.4,"genres":"Action > Side view > Top-down > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>The Burai, a race of evil super-brain aliens, have launched their plan to conquer the universe with their army of half-organic, half-robot creatures -- the robo-mutants.  It's up to you to stop them!  Strap on your jet pack, and get ready to become the ultimate Burai Fighter.</p><p>Burai Fighter is an arcade shooter with two modes of play.  Most levels are side- and vertical-scrolling with pre-designed layouts.  A few levels are different, though: top-down perspective, with a randomized layout.  Either way, you'll be armed with a variety of weapons, including different guns (laser, missile, ring) and the powerful cobalt bomb which kills everything onscreen.</p><p>Burai Fighter uses a slightly different gameplay mechanic when compared to other shooters. You can shoot in 8 directions, and when you hold down the fire button you keep shooting in that direction.</p>"},{"name":"BurgerTime","year":1985,"developer":"Data East Corporation","url":":BurgerTime (USA)","filesize":15038,"score":7.1,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p>You play as Chef Pepper and your goal is to make giant hamburgers while evil eggs, sausages and pickles chase you around the game area. </p><p>To properly make a hamburger you must assemble all of the ingredients together, dropping them from higher up onto the burger area below. To actually do this you have to let Chef Pepper step over every burger ingredient. As soon as an ingredient (a piece of lettuce for instance) has been stepped on, it will fall to the level below. Falling food will squish any enemy following you and will also \"bump\" any other ingredient below it farther down. Also, as an emergency defense against the enemy food, you can collect pepper shakers which will allow you to puff out a small pepper cloud that will momentarily stun enemies, allowing you to walk past them.</p><p>Higher levels result in new level design, faster enemies and more ingredients to assemble.</p>"}]