[{"name":"Cabal","year":1990,"developer":"Tad Corporation","url":":Cabal (USA)","filesize":96060,"score":6.9,"genres":"Action > Behind view > Fixed / flip-screen > Arcade > Shooter","desc":"<p>Originating in the arcades, <em>Cabal</em> is a shooter where the protagonist runs back and forth along the bottom of the screen, ducking and dodging bullets and grenades from the enemy. The roll maneuver from the arcade was not implemented in the PC version. The player returns fire by moving a target around the screen which also moves the player character and may expose him to enemy fire. </p><p>The enemies throughout the five levels come thick and fast and there are many of them. They include normal foot soldiers, tanks, helicopters and end of level bosses such as submarines and war machines. Just about everything on the screen can be blown up or shot. There are bonus points to be picked up for destroying buildings and weapons to be picked up from the enemy, such as machine guns and shotguns. Two-player mode is available.</p>"},{"name":"Cadillac","year":1990,"developer":""},{"name":"Caesars Palace","year":1992,"developer":"Realtime Associates, Inc.","url":":Caesars Palace (USA)","filesize":72928,"score":5.7,"genres":"Gambling > 1st-person > Cards / tiles > Licensed","desc":"<p>This game allows you to play in the <em>Caesars Palace</em> casino. You wander around the casino and play video poker, roulette, blackjack, the Big Six money wheel, or 3 types of slot machines. You bet and win chips and then exchange them for money whenever you like. The interaction is done via a cursor, everything is viewed from first-person perspective. You come to the casino in a taxi - will you be able to leave it in your own limousine?</p>"},{"name":"California Games","year":1989,"developer":"Epyx, Inc.","url":":California Games","filesize":92364,"score":7.3,"genres":"Sports > Side view > 2D scrolling > Fixed / flip-screen > Tricks / stunts > Olympiad / mixed sports > Skateboarding > Surfing > Bike / Bicycling","desc":"<p><em>California Games</em> was the original \"Extreme Games\" – what today's generation might call \"X-Games in the sun\". Players can select sponsors (absent in some versions) and compete in events such as skateboarding, footbag, surfing, roller skating, flying disc (frisbee) and BMX. The surfing event is ranked by judges, which give a score to help the players improve their routine.</p><p>The Atari versions (2600 and Lynx) of the game omit the flying disc and roller skating events, while the Genesis version omits only the flying disc event.</p>"},{"name":"Captain America and the Avengers","year":1991,"developer":"Data East Corporation","url":":Captain America and the Avengers (USA)","filesize":149623,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Licensed","desc":"<p>The Mandarin has knocked out Iron Man and the Vision. This time it is personal.</p><p>You play as Captain America or Hawkeye. In the one player mode, you must fight your way through various thugs to rescue Iron Man and the Vision. This game is a side scroller, somewhat reminiscent of Bionic Commando in which you fight through a level then move to an overhead map to decide where to go next. In between levels, Wasp gives you hints.</p><p>Captain America's attacks are: when he is standing, shield throw; when he is crouching, punch and when he is jumping, kick. Also, if you push twice in a direction, Cap can do a powerful forward charge with his shield for a short distance.</p><p>Hawkeye's attacks are all arrow shots. He can shoot left, right, up, upper-left or upper-right.</p><p>If you complete an area with one character then complete it with the other character right away, you can press start to switch between Cap or Hawkeye. This has the advantage that Cap's forward charge is powerful and by grabbing poles, he can then jump to areas Hawkeye cannot.</p><p>Hawkeye can shoot enemies or targets too high for Cap to jump up and kick.</p><p>In the battle mode, this is a two player, one-on-one battle. Player one chooses from Captain America or Hawkeye (the good guys) and player two chooses from Wizard, Ultron or Crossbones (the bad guys).</p><p>You fight each other until one player has won three rounds.</p>"},{"name":"Captain ED","year":1989,"developer":"Graphic Research Co., Ltd."},{"name":"Captain Planet and the Planeteers","year":1991,"developer":"Chris Gray Enterprises Inc."},{"name":"Captain Silver","year":1988,"developer":"Data East Corporation"},{"name":"Captain Skyhawk","year":1990,"developer":"Rare Limited","url":":Captain Skyhawk (USA)","filesize":79100,"score":7.1,"genres":"Action > Behind view > Diagonal-down > 2D scrolling > Arcade > Flight / aviation","desc":"<p>Aliens are draining the energy from the Earth and plan to totally destroy it when they're through. Only Captain Skyhawk and his F-14VTS fighter jet can get rid of these alien invaders.</p><p>The game features eight missions which are broken up into different phases. One phase is a vertically scrolling shoot-'em-up which has the action viewed from a top down perspective with a 3D landscape. Players get to destroy enemy installations and bases during this phase. Another phase has gameplay similar to After Burner where the player has to take out enemy aircraft. Another phase has the player carefully docking their aircraft into a space station. The planes weaponry can be upgraded or refilled at these space stations by spending the credits the player has earned by defeating enemy aircraft. After successfully completing all the missions the player has to destroy the final alien space station.</p>"},{"name":"Casino Kid","year":1989,"developer":"SOFEL Co., Ltd.","url":":Casino Kid","filesize":63070,"score":"","genres":"Gambling > Strategy > 1st-person > Top-down > Anime / Manga > Cards / tiles > Regional differences","desc":"<p>You are Casino Kid, a nameless youth who has 500$ in his pocket and is ready to face the best poker and blackjack players in the casino to increase this amount significantly. You move around a large casino room and talk to people. Some people will just chat with you, while others will challenge you to a game: either blackjack or poker. In the beginning, most people won't agree to play with you. You'll have to defeat the opponents in a particular order in order to be able to win all blackjack and poker games and to face the Final Opponent.</p>"},{"name":"Casino Kid 2","year":1993,"developer":"SOFEL Co., Ltd."},{"name":"Castle of Deceit","year":1990,"developer":"Bunch Games"},{"name":"Castle of Dragon","year":1990,"developer":"Athena Co., Ltd.","url":":Castle of Dragon","filesize":77484,"score":"","genres":"Action > Side view > 2D scrolling > Fantasy","desc":"<p>Darklarza, the Dragon Master, has been terrorizing the kingdom for many years. The king has retreated into exile with his bravest knight, Geraden, to hold his fort. Darklarza stages an attack on the king's exile fortress and manages to abduct the princess. It is up to Geraden to journey through the kingdom, rescue the princess, and put an end to Darklarza's reign once and for all.</p><p><em>Castle of Dragon</em> is a side-scrolling action adventure in which Geraden must hack and slash his way through the kingdom and destroy legions on Darklarza's forces. Initially equipped with a sword and a shield, plus the armor on his back, Geraden can upgrade to more powerful offensive and defensive options, as well as obtain various powerful magic spells.</p>"},{"name":"Castle Quest","year":1990,"developer":"Hudson Soft Company, Ltd."},{"name":"Castlequest","year":1986,"developer":"ASCII Corporation","url":":Castlequest (USA)","filesize":38238,"score":6.2,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Puzzle elements > Fantasy > Regional differences","desc":"<p>The puzzle and platform game <em>Castle Excellent</em> is a sequel to The Castle. In <em>Castle Excellent</em> you control a prince that has to save the princess again. </p><p>To find your princess you have to explore the castle, which has 100 different rooms. Each room is a puzzle on its own as you have to avoid enemy knights, fat Tiroler men, hazardous objects and have to use objects to get to the next door.In each room you have to collect keys and items like rings and gold bars. The keys may have different colors and only opens doors with the corresponding key color.</p><p>The main difference with the original <em>The Castle</em> game is that the castle rooms are completely redesigned and contain many new challenges. The game play has not changed.</p>"},{"name":"Castlevania","year":1986,"developer":"Konami Industry Co. Ltd.","url":":Castlevania (USA)","filesize":66568,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Horror > Regional differences","desc":"<p>Every hundred years, the dark vampire known as Dracula resurrects and terrorizes the land. A vampire hunter named Simon Belmont bravely ventures into the Count's mansion in order to defeat him. Along the way he'll have to defeat skeletons, bats, fishmen, medusa heads and other evil creatures.</p><p><em>Castlevania</em> is a side-scrolling platform action game. The player takes the role of Simon Belmont, who is able to jump and crack his whip directly in front of him. Power-ups can be obtained by defeating enemies or by whipping candles that appear in the castle. One such power-up increases the power and length of Simon's whip. Different weapons can be gathered which consume hearts when used, these hearts can also be collected from monsters and candles. Additionally, some walls will hide secrets such as the health-restorative turkey or the Double and Triple shot abilities for the weapons Simon has collected. At the end of each section of the castle is a boss, which must be defeated. Progression through the castle eventually leads to a confrontation with Count Dracula himself.</p>"},{"name":"Castlevania II: Simon's Quest","year":1987,"developer":"Konami Industry Co. Ltd.","url":":Castlevania II - Simon's Quest (USA)","filesize":77954,"score":6.9,"genres":"Action > Role-playing (RPG) > Side view > 2D scrolling > Metroidvania > Platform > Europe > Fantasy > Horror > Regional differences","desc":"<p><em>Castlevania II: Simon's Quest</em> is the second game in the Castlevania series. After the vampire killer Simon Belmont destroyed Count Dracula in the previous game, an evil curse possessed him. The only way Simon can break the count's curse is to find five of Dracula's body parts (which are mysteriously strewn throughout Transylvania) and burn them. </p><p>Gameplay-wise, <em>Simon's Quest</em> is quite different from its predecessor, combining side-scrolling action and platforming with strong role-playing elements. The game does not feature the traditional stages but allows the player to freely roam the land of Transylvania in the style of Nintendo's Metroid. The game world is divided into outdoor areas, dungeon-like mansions containing crucial quest items, and towns, where Simon can talk to non-player characters, rest, and buy items in shops. Some areas can only be accessed by equipping and using specific items that must be bought or found. </p><p>The RPG elements are present in character growth, monetary system, and weapon upgrades. Simon's initial whip can be replaced by more powerful variants that can be purchased in various towns. Hearts are used as currency in the game and are obtained from defeated enemies in different quantities. The same hearts also function as experience points: after Simon has accumulated a set amount, he levels up and his attributes are increased.</p><p>The game features a day and night cycle that occurs at accelerated pace in real time. At night, enemies inflict more damage, but also drop more hearts upon defeat. Shops are closed during nighttime, and townspeople are replaced by wandering zombies.</p>"},{"name":"Castlevania III: Dracula's Curse","year":1989,"developer":"Konami Industry Co. Ltd.","url":":Castlevania III - Dracula's Curse (USA)","filesize":246816,"score":8.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Fantasy > Horror > Regional differences","desc":"<p>Taking place 100 years before the events of Castlevania 1 and Castlevania 2, Dracula the Vampire has risen up to threaten the small village of Warakiya. Citizens who had banished the Belmont family now beg for Trevor Belmont's help in slaying Dracula. In his strange castle, Dracula has been assembling a massive army of undead creatures to sweep the Earth clean of life and bring everlasting darkness. Trevor agrees to help and equips his family's hereditary whip, the \"Vampire Slayer\", in order to destroy Dracula.</p><p><em>Castlevania III: Dracula's Curse</em> is a side-scrolling platform game. The gameplay is nearly identical to the first Castlevania game. The player takes the role of Trevor Belmont who is able to move left and right, jump, attack with his whip straight ahead and use a special weapon. These special weapons consume hearts, which can be found by defeating monsters or destroying candles. Power-ups include: a throwing dagger, a throwing axe, A time-stopping stopwatch, a cross-shaped boomerang and a vial of holy water. Additionally there is a double shot (II) and triple shot (III) power-up which increases the number of special weapons that can be used at one time. Trevor is defeated if his life meter runs out, and can find a roast turkey power-up to replenish it. Trevor progresses through each level defeating monsters and eventually encountering a boss creature. At different points in the game the player will be able to chose between different paths, which will determine which levels are played. </p><p>At the end of certain levels, the player may encounter a companion which can be recruited. Only one companion can accompany Trevor at any time; accepting a new companion means rejecting the existing one. Once recruited, Trevor can change between his own form and that of the companion. Each companion has an independent life meter and has unique abilities such as powerful magic, the ability to climb walls or flight. These abilities may also affect the types of power-ups that appear in candles and the exact function of special weapons.</p>"},{"name":"Caveman Ugh-Lympics","year":1990,"developer":"Dynamix, Inc."},{"name":"Chack'n Pop","year":1985,"developer":"Taito Corporation"},{"name":"Challenge of the Dragon","year":1990,"developer":"Color Dreams, Inc.","url":":Challenge of the Dragon (USA) (Unl)","filesize":64759,"score":"","genres":"Action > Side view > Fighting > Platform","desc":"<p>In the land of Lorin, Lady Ninita has been kidnapped by the evil necromancer Demiwind. Sir Burkelot has to fight his way through ten levels to be reunited with his lover. Having mastered the ancient art of Dragon Style Kung Fu, he has many types of attack at his disposal: a sword attack, knee to the chest for close range, a side kick for far range, a flying dragon kick and a shoulder butt. He can also pick up potions to launch magic.</p>"},{"name":"Challenger","year":1985,"developer":"Hudson Soft Company, Ltd.","url":":Challenger (Japan)","filesize":26658,"score":"","genres":"Action > Diagonal-down > Side view > 2D scrolling","desc":"<p>One of Hudson Soft's earliest NES titles, <em>Challenger</em> is an arcade-style game that combines side scrolling, run 'n jump action with overhead, exploratory gameplay. The game consists of two parts.</p><p>The first level (or \"scene\") has you racing the clock to get to the front of a train, where a purple-faced villain is holding your significant other (or, perhaps just some anonymous princess). You have at your disposal a trusty throwing knife to take care of enemies. You will also have to dodge obstacles and jump gaps in the train. This section is taken from the earlier Hudson game, Stop the Express.</p><p>Scene 2 places you in an overhead, maze-like environment, where you once again have to fight the clock. This time though, you have to navigate your way through the area, in search of all the different \"keywords\", which are placed in different caves. Once you have cleared all the caves, the path will be open to the boss' final lair.</p>"},{"name":"Championship Bowling","year":1989,"developer":"Another Ltd.","url":":Championship Bowling (USA)","filesize":33042,"score":"","genres":"Sports > Diagonal-down > Fixed / flip-screen > Bowling","desc":"<p>Championship Bowling plays like a standard 10 frame ten-pin bowling game with the objective to knock down as many pins with the bowling ball as possible.</p><p>After picking a lane (5 different designs), a character (4 different characters), and the weight of the bowling ball they will be using, the player is placed on the lane. To bowl the player first picks the location that the bower will bowl from and then, using the ‘Control’ panel, the player must time it correctly to stop the ball at the desired angle and finally, time it correctly to stop the ‘Power’ bar at the desired power. The power, and the weight of the ball determine how much effect the control has. Up to four players can play using the NES Four Score accessory with all players taking turns to bowl.</p>"},{"name":"Championship Lode Runner","year":1985,"developer":"Brøderbund Software, Inc.","url":":Championship Lode Runner (Japan)","filesize":17681,"score":7.1,"genres":"Action > Puzzle > Side view > 2D scrolling > Arcade > Platform > Direct control","desc":"<p>A follow-up to the original Lode Runner, with identical gameplay. This package contained 50 of the most challenging levels ever designed, and was intended for expert players only. It did not include the level editor, you had to play through the levels in order, but a save-game option was provided (although you lost one life every time you restored).</p>"},{"name":"Championship Pool","year":1993,"developer":"Bitmasters, Inc.","url":":Championship Pool (USA)","filesize":71296,"score":6.3,"genres":"Sports > Top-down > Pool / snooker","desc":"<p><em>Championship Pool</em> is a pool game where players can 8-ball or 9-ball pool tournament that starts off with the BCA Regional Championship where the player must defeat 32 opponents in a first to four games match. If the player loses against any of the 32 opponents, they are then eliminated from the tournament. The winner of that then goes onto the World Championship.</p><p>All of the gameplay is done from a top down view of the table. The player moves an icon to indicate location they want to hit the ball too. To aid in the aiming, a ghost of the cue ball and the first ball that is hit is repetitively played out to show the path of the hit ball. With the all the shots there is a very small margin of error, but this is only notable when a long shot is played or a shot from a sharp angle and the ghost balls will randomly play out all the possible occurrences. The player can also change the power and spin of the played shot with the ghost balls will updating to show the outcome of those changes. </p><p>There are 4 different game modes that can be chosen, each with a different set of pool games. The different game modes and there games are:</p><p><strong>1. Tournament:</strong> The player must defeat 32 different players in a first to four knockout tournament in 8-ball or 9-ball pool before going on to the World Championship. During the tournament the opponent is never actually is seen playing there shots. Instead, when it is the opponents turn, it cuts to an image of the player with a caption and then returns the control to the player with some balls removed and moved. This way the opponent can finish the game within 4 turns regardless of if they where snookered or not.</p><p><strong>2. Challenge</strong>: It has many different pool games that are played, all with one player without an opponent. The games are:<em> </em><em>14.1 Challenge</em>* – After the break the ball is placed anywhere at the top of the table behind the line. At that point, the player can hit any ball but once the fails to hit a ball in a hole the game is over. If there is only one ball left on the table the rest of the balls are re-racked and play continues. At the end score is given based on the number of balls that where hit in the holes. The score are tallied up over 5 games to get the total score.</p><ul><li><p><strong>Eight Ball</strong> - After the break the ball is placed anywhere at the top of the table behind the line. The player must hit all the chosen set of balls (stripes or solids) and the 8-ball in one turn. The score is based on how many balls where hit in.</p></li><li><p><strong>Nine Ball</strong> - After the break the ball is placed anywhere at the top of the table behind the line. The player must hit the 9 ball in one turn. The score is based on how many balls where hit in.</p></li><li><p><strong>Equal Offence</strong> – Same as 14.1 Challenge but there is only one game played.</p></li><li><p><strong>Three Pool</strong> – Only have 3 balls on the table. Score is based on how many shots it takes to get all three balls in with lower been better.</p></li><li><p><strong>Speed Pool</strong> – Objective is to hit all the balls in as quickly as possible as a timer is timing how long the game takes. Any ball can be hit at any time and the player can miss the shot and not be penalised (other than taking longer).</p></li></ul><p><strong>3. Party:</strong>  It has many different multiplayer pool games that are played with ether just 2 or 2 to 8 human players. The games are:<em> </em><em>Eight Ball (2 Players)</em>*  – A standard eight ball game with the players taking turns to play.</p><ul><li><p><strong>Nine Ball (2-8 Players)</strong>  – A standard nine ball game with up to 8 players taking turns. First player to get the 9-ball in wins.</p></li><li><p><strong>14.1 Continuous (2 Players)</strong>  – Players can hit any ball in for a point. If a shot is missed then other player plays. If there is only one ball on the table the pocketed balls are re-racked. Play continues until one of the players reaches the score chosen at the start of the game.</p></li><li><p><strong>Ten Ball (2-8 Players)</strong>  – Same as Nine Ball except with 10 balls.</p></li><li><p><strong>Rotation (2-8 Players)</strong>  – Only the lowest ball can be hit and the score for getting a ball in is the value of the ball (e.g. 8-ball is 8 points). Player with the highest score at the end of the game wins.</p></li><li><p><strong>Straight Pool (2 Players)</strong>  – Same as 14.1 Continuous but the player with the highest score after one game wins.</p></li><li><p><strong>Equal Offence (2-8 Players)</strong>  – Same as Equal Offence in challenge mode but players can take turns to beat each others score.</p></li><li><p><strong>Fifteen Ball (2-8 Players)</strong>  – Same as Rotation except that any ball can be hit not just the lowest.</p></li><li><p><strong>One Pocket (2 Players)</strong>  – The two players are given one of the two pockets at the end of the table. The player must hit all the balls in there nominated pocket with the one with the most balls wins.</p></li><li><p><strong>Three Ball (2-8 Players)</strong>  – Same as Three Ball in challenge mode but players can take turns to beat each other’s score.</p></li><li><p><strong>Speed Ball (2-8 Players)</strong>  – Same as Speed Ball in challenge mode but players can take turns to beat each other’s score.</p></li></ul><p><strong>4. Freestyle:</strong> Lets the player practice with no opponent, no penalties, the ability to move any ball to the desired location (or remove by throwing the ball in the pocket), and the ability to place potted balls back on the table.</p>"},{"name":"Championship Rally","year":1991,"developer":"Human Entertainment, Inc.","url":":Championship Rally (Europe)","filesize":138426,"score":"","genres":"Racing / Driving > Simulation > Top-down > 2D scrolling > Real-time > Arcade > Direct control > Automobile > Off-roading","desc":"<p>This unlicensed rally simulation was initially developed by Hal Laboratory and released in Australia in 1991, then ported to the Famicom by Kaken in 1992 under the title <em>Exciting Rally: World Rally Championship</em>.</p><p>The game is played from a top-down perspective, and the controls themselves are rather simple: button A allows you to drive at low speed, button B at a higher speed, and the down arrow doubles as brakes and reverse gear. Arrows will indicate some, but not all, turns, and you will have to keep an eye out for jumps and obstacles. Your car will accrue damage each time you bump into something, until it finally explodes and you have to retire from the stage.</p><p>Two game modes are available. You can drive through an entire championship with up to seven other human players. Three classes serving as a difficulty setting, and the competition will take you to ten different countries, where you will have to compete against the times set by AI (and possibly human) opponents across several stages.Or you can play against two to eight other players in the Battle mode, setting a time one after another on your selected stage.</p><p>There is some level of tuning, with the possibility of choosing your tyres according to the surface (tarmac, gravel or snow), whether you want a turbo, and between two and four-wheel drive for each stage. Once a lap, you can also change your tyres when the letters \"SP\" appear on the screen ; simply come to a stop and press Select.</p>"},{"name":"Chaos World","year":1991,"developer":"Natsume Co., Ltd."},{"name":"Chase H.Q.","year":1989,"developer":"Taito Corporation"},{"name":"CheetahMen II","year":1992,"developer":"Active Enterprises Ltd."},{"name":"CheetahMen II: The Lost Levels","year":2012,"developer":"Active Enterprises Ltd."},{"name":"Cheman","year":2019,"developer":"The Mojon Twins"},{"name":"Cheril in Cadàveriön","year":2020,"developer":"The Mojon Twins"},{"name":"Cheril in the Cave","year":2020,"developer":"The Mojon Twins"},{"name":"Cheril Perils","year":2020,"developer":"The Mojon Twins"},{"name":"Cheril the Goddess","year":2017,"developer":"The Mojon Twins"},{"name":"Cheril the Writer","year":2018,"developer":"The Mojon Twins"},{"name":"Chessmaster, The","year":1989,"developer":"The Software Toolworks, Inc.","url":":Chessmaster, The (USA)","filesize":49390,"score":7.7,"genres":"Strategy > Diagonal-down > Top-down > Chess","desc":"<p><em>The Chessmaster</em> is a game where the player has the chance to play against the CPU controlled Chessmaster at a standard game of chess. </p><p>To play the game, the player must pick up the chess pieces with their hand cursor and place it in the desired location, within the rules of a standard chess game. There are 16 different difficulty levels, including 2 beginner levels, 13 standard levels (ranging from an average of 5 seconds to 4.5 minutes per shot depending on level), and an infinite level that will keep thinking of a shot until a perfect shot can be made or it is forced to make a move. There is also a teaching mode that shows the player all the possible moves with the selected piece. Two players can play against each other with two controllers and there is also an option for letting the Chessmaster play against itself.</p>"},{"name":"Chester Field: Ankoku Shin e no Chōsen","year":1987,"developer":"Vic Tokai Corporation"},{"name":"Chiller","year":1990,"developer":"Exidy, Incorporated","url":":Chiller (USA) (Unl)","filesize":29452,"score":3.8,"genres":"Action > 1st-person > Arcade > Shooter > Horror","desc":"<p><em>Chiller</em> is a first person shooter for one or two players. Back in the middle ages a castle on the outskirts of town has been invaded by an evil force which is causing the dead to come back to life! You need to stop this force before it can create a large army and take over the town. As you make your way to and eventually inside the castle, numerous dead creatures will be trying to stop you. Each level has a monster counter, and you need to shoot this many monsters before the timer runs out to continue on. Each level also has 8 talismans hidden in it; you need to find and destroy these to stop the monsters from appearing. If you complete a level without destroying all of the talisman, you will need to return to the level later on. There are 32 talisman in all that need to be destroyed in order to rid the town of the monsters!</p>"},{"name":"Chinese Hero","year":1986,"developer":"Micro Academy"},{"name":"Chitei Tairiku Orudoora","year":1987,"developer":""},{"name":"Chō Jikū Yōsai Macross","year":1985,"developer":"Namco Limited"},{"name":"Chōjin Sentai Jetman","year":1991,"developer":"Natsume Co., Ltd."},{"name":"Choplifter!","year":1986,"developer":"Coleco Industries, Inc."},{"name":"Chubby Cherub","year":1985,"developer":"Tose Co., Ltd.","url":":Chubby Cherub (USA)","filesize":24106,"score":"","genres":"Action > Side view > 2D scrolling > Direct control > Licensed > Regional differences","desc":"<p>You play as a cherub on a mission to rescue his friends. Your point of view is from the side as you scroll the screen horizontally. You fly through the levels eating several different food items to keep your flight meter powered. You also have to dodge various enemies such as dogs, birds, and balloons. You can also shoot the dog type enemies with hearts from the cherub's Gau-Gau cannon.</p>"},{"name":"Circus Caper","year":1990,"developer":"Advance Communication Company","url":":Circus Caper (USA)","filesize":108264,"score":"","genres":"Action > Side view > Platform","desc":"<p>A boy named Tim and his little sister Judy go to a circus. They want to buy tickets to enter the circus, but they only have money for one ticket, so only Judy goes in. After the show, the boy is at the exit to meet Judy when she comes out, but when she doesn’t the boy sneaks into the circus to rescue his sister from the ringmaster Mr. Magic who has taken her hostage.</p><p>The game is a platformer, you must get past many clowns, tight rope artists, and make it over water by jumping on top of alligators. You can also go into small tents to play mini-games.</p>"},{"name":"Circus Charlie","year":1986,"developer":"Konami Industry Co. Ltd."},{"name":"City Adventure Touch: Mystery of Triangle","year":1987,"developer":"Compile"},{"name":"City Connection","year":"1988","developer":"Jaleco Ltd.","url":":City Connection (Europe)","filesize":27272,"score":"","genres":"Racing / Driving > Side view > 2D scrolling > Arcade > Platform > Fangame","desc":"<p>This game is an unofficial conversion of the 1985 Arcade game City Connection.</p><p>In this platform game the player controls a car that never stops moving. It can only turn left or right or jump. The objective of the game is to drive through a series of cities, avoiding obstacles and painting every platform, as the game runs over them. There are several cities/scenarios that act as levels.</p>"},{"name":"Clash at Demonhead","year":1989,"developer":"Vic Tokai Corporation","url":":Clash at Demonhead (USA)","filesize":151741,"score":7.3,"genres":"Action > Side view > 2D scrolling > Metroidvania","desc":"<p>Professor Plum and his designs for the \"doomsday device\", DEAD END have been taken by the diabolical LAWBREAKERS - a sinister group dedicated to the destruction of mankind. It's only a matter of time before the device is assembled and the final countdown begins. As Sergeant Billy \"Big Bang\" Blitz of the special Assault Brigade for Real Emergencies(S.A.B.R.E) your mission is to foil the LAWBREAKERS plan. To do this, you must find the shortest route to the summit of Demonhead mountain, where the professor is being held. Rescue the professor and save the world from total destruction. This is a \"typical\" sidescroller with Role playing elements. the various enemies you meet with leave behind cash which can then be used to buy equipment. You'll need a diving suit to swim underwater, a jetpack to get to those hard to reach areas and don't forget the shop card that can be used to call the shop no matter where you are.</p>"},{"name":"Classic Concentration","year":1990,"developer":"Softie, Inc.","url":":Classic Concentration (USA)","filesize":72734,"score":5.7,"genres":"Puzzle > Top-down > Fixed / flip-screen > Turn-based > Board game > Cards / tiles > Game show / trivia / quiz > Mental training > Tile matching puzzle > Licensed","desc":"<p>Concentration was a popular game show in the mid-to-late 1980s, and this game was adapted from that television program.</p><p>Two players can play against each other, or one person can play against a computer generated opponent. The answer to the puzzle is hidden by tiles. The tiles have words denoting game prizes (\"Mexico\", \"Camera\", \"Telescope\", for example), and your object is to find the two matching worded tiles. Exposing two at a time, your memory is taxed as more prize tiles are revealed and then covered over again.  As more tiles are matched, the hidden puzzle is revealed. Solve the puzzle and you win the game.</p>"},{"name":"Cleopatra no Mahō","year":1987,"developer":"Square Co., Ltd."},{"name":"Cliffhanger","year":1993,"developer":"Spidersoft Limited","url":":Cliffhanger (USA)","filesize":92590,"score":4.2,"genres":"Action > Side view > 2D scrolling > Licensed","desc":"<p><em>Cliffhanger</em> is based on the 1993 Sylvester Stallone movie. The lead character, Gabe Walker, is an expert in high mountain search and rescue and receives a distress signal from a plane that has crashed nearby. However, the plane is actually loaded with terrorists who hijacked a large shipment of cash. The game consists of side-scrolling action. The hero can walk, run, jump, punch, and kick while jumping. Further, he can perform special feats as the situation requires, such as crossing a rope suspended from two cliffs. One of the biggest threats in this game is nature as Gabe must defend against wolves and birds, snow falling off cliffs and structures, and falling rocks.</p>"},{"name":"Cloud Master","year":1989,"developer":"Taito Corporation"},{"name":"Clu Clu Land","year":1984,"developer":"Nintendo R&D1","url":":Clu Clu Land","filesize":17137,"score":6.1,"genres":"Action > Puzzle > Top-down > Fixed / flip-screen > Shooter","desc":"<p>A unique puzzle game in which you play a fish like creature who must explore the many play fields collecting gold bars that form a picture. Enemies litter the field, which you can blast away with a wave of energy, removing them for a short amount of time from the game. You also need to grab onto the posts and walls to turn into the gaps on the field, adding an element of timing to the game.</p>"},{"name":"Cobra Command","year":1988,"developer":"Data East Corporation","url":":Cobra Command (USA)","filesize":111500,"score":"","genres":"Action > Side view > Arcade > Shooter > Helicopter","desc":"<p>An arcade game from Data East, Cobra Command is a 2D, side-scrolling helicopter shooter in the tradition of Choplifter. Your mission: blast your way through six stages (Sumatra, Java, Borneo, South China Sea, Siam, and Enemy HQ) and rescue the hostages.  </p><p>Along the way, you can acquire upgrades for your guns, missiles, armor, engines, and rescue equipment (ropes, ladders).  You'll need them, as swarms of enemy soldiers, artillery, tanks, choppers, jet fighters, and warships stand in your way.</p>"},{"name":"Cobra Triangle","year":1989,"developer":"Rare Limited","url":":Cobra Triangle (USA)","filesize":86818,"score":6.9,"genres":"Action > Racing / Driving > 2D scrolling > Isometric > Naval / watercraft","desc":"<p>Cobra Triangle is a single-player boat-racing game that lets you do more than race. It borrows the power-up system from the shoot 'em up genre but keeps the emphasis more on maneuvering than shooting. Since you have a health meter with a dozen bars in it, it's not that important to dodge bullets unless your health is really low, but you should try not to run into too many walls. In order to get very far you need to make use of your power-ups which are TURBO for better acceleration; FIRE for increased firepower; SPEED for increased top-speed; MISSILE for firing missiles as well as bullets; and FORCE which makes you fire tons of missiles and also makes you invincible for a limited time. You get roughly one minute to complete each level. Speaking of which, there are 7 types of levels each with a different objective:</p><p>(1) Race to the Finish - Shoot other boats along the way to the finish line and avoid enemies like turrets and sharks. Some boats tow power-up pods behind them that you can collect after you shoot them. It doesn't matter when you finish, and you aren't told if you get 1st or 2nd or 3rd place... it seems that the other boats are only there to get in your way. Watch for the fork in the river; choosing alternate paths takes you to the same levels of the game but in a different order.</p><p>(2) Collect the Pods - Simply race in a straight path while running over ramps to collect pods and 1UP's in the air. You go on to the next level when time runs out.</p><p>(3) Dispose of Mines - There is a small square in the water with mines in it. You actually have to collect the mines and tow them to another square to make them explode. Of course, there is an invincible enemy boat that tries to steal them back from you and some guys that shoot at you. It takes awhile since you can only tow them one at a time.</p><p>(4) Fry the Monster - The 'boss' levels. You fight a sea-serpent, a crab, a shark, etc. He has his own health display right above yours, but it tends to deplete slower.(BONUS) Shoot the Targets - after every boss level you go to an auto-scrolling level where you are rewarded with a 1UP prize if you manage to shoot all the targets along the shore without missing any.</p><p>(5) Guard the People - There's a large square filled with 8 helpless swimmers, and for some reason they're all about to be kidnapped. Other boats race into the square and tow them away unless you destroy their ships before they get away. You can tow the people back into the square-if you have time-while avoiding the spaceships that fire stunning missiles at you. If you have at least one swimmer left when the timer runs out then you pass.</p><p>(6) Reach the Finish - Race in a straight course with plenty of obstacles but no other boats. You drive upstream while the current drags a horde of logs and whirlpools in your direction to stop you. Occasionally some planes fly by and shoot at you. If you happen to die in this or any other level, you simply reappear on the spot as long as you have an extra life. A continue puts you back at the beginning of the level you were on.</p><p>(7) Jump the Waterfall - A level that consists of a series of moving ramps you must use to jump over huge pits. Moving currents, whirlpools, and the violation of several laws of physics makes this more difficult than it sounds.</p><p>The entire game consists of repeating these types of levels for a grand total of 25 stages. The later stages are much more difficult than the first. They're filled with additional obstacles like icebergs, more mines, more enemies, and longer courses. There are even speed-ramps that let you take small short-cuts in later racing levels.</p>"},{"name":"Cocona World","year":1987,"developer":"SOFEL Co., Ltd."},{"name":"Cocoron","year":1991,"developer":"Takeru Co., Ltd."},{"name":"Code Name: Viper","year":1990,"developer":"Arc Co., Ltd.","url":":Code Name Viper","filesize":140621,"score":7.1,"genres":"Action > Side view > Platform > Spy / espionage","desc":"<p>Set against the backdrop of the war on drugs from the late 1980s/early 1990s, Code Name: Viper directly confronts the drug cartel at their bases in South America. You play an American secret agent who must infiltrate the cartel drug bases and mansions, free hostages and informants, and piece together clues about who the kingpin is-- and inevitably bring him down. Equip yourself with a progressively more powerful arsenal as the game progresses in standard NES side-scroller fashion.</p>"},{"name":"Color a Dinosaur","year":1993,"developer":"FarSight Technologies Inc.","url":":Color a Dinosaur (USA)","filesize":36429,"score":"","genres":"Educational > 1st-person > Graphics / art","desc":"<p><em>Color a Dinosaur</em> is an electronic coloring book designed for kids ages 3 to 6. The game provides 16 different dinosaurs which can be colored in with a variety of colors and patterns. There are two coloring modes available: free form mode where you control a pencil and select the region to be colored, or automatic mode where the computer selects a region and you only have to select a color.</p>"},{"name":"Commando","year":1986,"developer":"Capcom Co., Ltd.","url":":Commando (USA)","filesize":59947,"score":6.9,"genres":"Action > Diagonal-down > 2D scrolling > Arcade > Shooter > Direct control > War > Regional differences","desc":"<p>Several levels await your super-tough Commando in this vertical scrolling game. Armed with only a standard rifle and a few grenades you must take on hordes of Nazis. Some are wandering around in the open, while others have picked out hiding places, which you must approach from certain angles. Trees, rivers and bridges create a varied combat-like terrain and must be incorporated into your thinking. Extra grenades can be collected, and will definitely be required, as they allow you to kill from distance and thus avoid some enemy shots.</p>"},{"name":"Conflict","year":1989,"developer":"Vic Tokai Corporation","url":":Conflict (USA)","filesize":119131,"score":"","genres":"Strategy > Top-down > Turn-based","desc":"<p>Conflict is a turn-based, hex-grid wargame for the NES that can be played by one or two players.  It is not a strictly historical wargame in which battles of the past are recreated using real-world geography.  Instead, the two opposing sides (Blue vs. Red) fight it out across 16 imaginary scenarios with armies modeled on NATO and Warsaw Pact forces of the late 1980s. </p><p>The game alternates between two modes of play: a strategic/operational scale, in which players move their units around the hex map; and a tactical combat module for resolving unit-to-unit combats.  In the tactical mode, human players have the choice of either issuing orders themselves or using the \"auto\" mode which delegates command to the AI.Splash graphics and text messages convey battle results.</p><p>By capturing towns and winning battles, the player gains \"fame\" points that can be used to purchase more and better military hardware.  Every scenario ends only when the same, single victory condition is achieved by one of the two sides: destroy the opposing side's main battle tank unit in combat.</p><p>Winning any one of the first 15 scenarios yields a letter of the alphabet; together, the letters spell out the password that must be entered in order to play the final scenario.</p>"},{"name":"Conquest of the Crystal Palace","year":1990,"developer":"Quest Corporation","url":":Conquest of the Crystal Palace (USA)","filesize":136268,"score":6.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>Long ago the Crystal Palace was a thriving kingdom, however the evil war spirit Zaras appeared one day and brought destruction to the lands! The people of the Crystal Palace left as Zaras and his henchman took over, changing the kingdom into a maze of many dangers. You control Farron, the hero of the story who needs to enter the Crystal Palace and destroy the bad guys in order to restore peace. The game is an action platform game that scrolls both horizontally and vertically. On each of five stages you'll need to fight various enemies throughout the varied terrain, and finally defeat the boss at the end. You'll start with just a simple sword, but additional weapons can be found or bought in order to help you out. If you get into trouble, you can also call your dog Zap onto the screen; he'll jump around causing damage to the enemies giving you a chance to escape. You may also come across Kim's shops along your journey. Here you can buy various items, including additional  lives, replenish your health, more powerful weapons, and other useful items. To purchase items, you'll need money which can be collected after defeating enemies in battle.</p>"},{"name":"Contra","year":1988,"developer":"Konami Co., Ltd.","url":":Contra (USA)","filesize":90108,"score":8.4,"genres":"Action > Behind view > Side view > 2D scrolling > Platform > Shooter > Direct control > Sci-fi / futuristic > South America > Regional differences","desc":"<p>The Famicom/NES versions of Contra are an expanded port of the arcade version, developed in-house. The biggest difference is that the levels are restructured and significantly longer, with stages 5 through 8 being derived from and expanded from areas in the arcade version's final stage. The plot is altered as well, being set in the year 1987 in the Amazon, rather than 2633 in the Galuga archipelago. Weapons are slightly different in function and frequency, and the Konami Code makes a famous appearance. The Famicom version has additional graphical effects and between-mission cut-scenes not seen in the NES version.</p>"},{"name":"Contra Force","year":1992,"developer":"Konami Co., Ltd.","url":":Contra Force (USA)","filesize":167251,"score":6.4,"genres":"Action > Diagonal-down > Side view > 2D scrolling > Platform > Shooter","desc":"<p><em>Contra Force</em>, a special forces team including Commando Burn, Smith, Beans, and Iron, protects Neo City from the terrorist group, D.N.M.E.</p><p>This is the third Contra game for the NES (and was released just after Contra III: The Alien Wars for SNES). There are five missions, involving both side-scrolling and overhead shooting levels. Switch between the four commandos and find secret passages, not to mention a large arsenal of weapons: rocket launchers, flame throwers, bazookas, land mines, rifles, time bombs. For one or two players.</p>"},{"name":"Cool World","year":1993,"developer":"Ocean Software Ltd.","url":":Cool World (USA)","filesize":98333,"score":4.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Cool World exists as an alternate dimension to this world where cartoon doodles are alive. An object called the Golden Spike of Power keeps both dimensions balanced in harmony. It was placed on top of the Ocean Hotel in Las Vegas for safekeeping. However a doodle named Holli Would want the power of the Golden Spike so she can become a real human, but in doing so may cause both worlds to come to ruin. She also ripped up a map into five pieces which shown how the tunnels connected between this world and Cool World. So now it's up to Detective Frank Harris to track down the map pieces and put a stop to Holli's plans.</p><p>Detective Frank Harris can jump, crouch, and use weapons to dispatch Holli's henchmen. Weapons include a pen, eraser, and bombs. Other items include bottles (used in conjunction with the pen), hearts which give Frank an extra life, food items which give Frank energy, and special area specific weapons. The game is broken into four different areas (Main Street - Cool World, The Highway, Main Street - Sweet Place, and Countryside near Sweet Place), with each area containing a piece of the map plus a fifth area which takes place at the hotel where Frank has to defend the Golden Spike from being stolen.</p>"},{"name":"Cosmic Epsilon","year":1989,"developer":"Home Data Corp."},{"name":"Cosmic Spacehead","year":1992,"developer":"The Codemasters Software Company Limited","url":":Cosmic Spacehead (Europe) (En,Fr,De,Es) (Unl)","filesize":199206,"score":6.5,"genres":"Action > Adventure > Side view > 2D scrolling > Arcade > Platform > Puzzle elements","desc":"<p>Linus had crash landed on a distant planet called Earth, and made his way back home again. Trouble is, no one believes his tale of the planet he discovered! Your job is to help Linus make his way back to planet Earth so he can take some pictures to convince his friends. Gameplay consists of two parts, an adventure and arcade action. In adventure mode you can explore lands, find objects, and talk to people. Sentences can be constructed by using the pointer to select actions or objects on the screen (This is similar to the interface LucasArts used in games such as Maniac Mansion). To reach many new locations involves the action mode, where you will need to cross treacherous landscapes and evade dangerous creatures. This portion resembles a side scrolling platform game. Once you've cleared an action sequence, you will not need to do so again if you decide to revisit a location. Whenever you wish you can receive a password allowing you to continue the game later from the same point.</p>"},{"name":"Cosmic Wars","year":1989,"developer":"Konami Industry Co. Ltd."},{"name":"Cosmo Police: Galivan","year":1988,"developer":"Nichibutsu"},{"name":"Cowboy Kid","year":1991,"developer":"Visco Corporation","url":":Cowboy Kid (USA)","filesize":260988,"score":"","genres":"Action > Diagonal-down > Side view > 2D scrolling > Western > Crime","desc":"<p>Villatown has been under siege by a local gang known as the Scorpions. A rumor began to spread that the gang was going to commit a train robbery so the town's sheriff went out to investigate and was never heard from again. Seeking vengeance, the sheriff's son named Sam went out to fight the Scorpions, but was ambushed by some of the gang and was almost killed. Sam was luckily saved by an Indian Warrior named Little Chief. After Little Chief seen Sam's courage, he vowed to help Sam bring the Scorpions to justice. Sam became the new Sheriff in town and chose Little Chief as his deputy.</p><p>In this game you play the role of Sheriff Sam, a young gunslinger who travels the land fighting baddies and playing mini games. The main game play involves you moving around the towns horizontally collecting gold by hitting chest whilst at the same time killing the bad guys before they kill you. There is also an RPG element to it where you have to visit people in the towns in order to proceed like at the very beginning where you need to first acquire a knife and you are then able to smash the chest and get money in order to buy a key which in turn allows you to enter the Sheriffs building. Once you are made sheriff you can go to various towns hunting down an outlaw for the bounty money. There are also mini-games such as the shooting range where you have to shoot the bad guy targets whilst avoiding shooting the innocent bystander targets.</p>"},{"name":"Cowlitz Gamers' 2nd Adventure, The","year":2017,"developer":""},{"name":"Crackout","year":1986,"developer":"Konami Industry Co. Ltd.","url":":Crackout (Europe)","filesize":69923,"score":6,"genres":"Action > Fixed / flip-screen > Arcade > Paddle / Pong","desc":"<p>In the year 30XX, the mankind has exhausted all the metal resources on the Earth, so they had to travel into space in order to find more. They find a planet high in minerals, and they name it Selim.</p><p>But soon they discover that there is someone watching, spying on them; it's some kind of alien race. These aliens find a hole in the humans' main computer and get inside it. The computer, programmed to self-destruct in case of a failure, starts its countdown.</p><p>There is only one way to avoid self-destruction, which is entering a 14 digit code into the machine; but these digits are hidden in the walls of the corridors in the complex. Your mission is to find these letters and avoid self-destruction, aboard the \"Red Warrior\", and using your only weapon, an energy ball.</p><p>Crackout is an Arkanoid clone for the NES, but it's probably one of the most singular clones. You'll have to destroy all blocks but also the walls surrounding them, as the 14 letters are spread inside them, apart from killing the alien bosses here and there. In your way, you will find a bizarre mixture of enemies, from alien forms to parts of the body (eyes, lips, skulls...), who will make your game tougher by changing the direction of your ball; but also happier by dropping a sweet variety of power-ups such as the cherries (extra life), the clock (the enemies freeze), a rocket (to throw into the blocks), a fire device (the ball fires missiles), a parachute (slows the ball) an extra ball, or the weirdest of them all, the so-called Konami Man, who will take you to a secret parallel complex with different (and harder) levels.</p>"},{"name":"Crash 'n' the Boys: Street Challenge","year":1992,"developer":"Technos Japan Corp.","url":":Crash 'n' the Boys Street Challenge","filesize":146764,"score":7.1,"genres":"Action > Sports > Side view > Anime / Manga > Arcade > Beat 'em up / brawler > Fighting > Tricks / stunts","desc":"<p>Another tournament composed of several different challenges rocks the streets near Nekketsu High and since the series hero Kunio isn't going to turn down a challenge anytime soon, every gang in the city sends its team hoping to come up on top.</p><p><em>Crash 'n' the Boys: Street Challenge</em> features the same basic gameplay engine and mechanics found in the rest of the <em>Kunio/Nekketsu High</em> games. The player controls a character in side-scrolling levels and try to defeat opponents using an arsenal of attacks and special moves. Unique to this game is that in order to clear the five stages, the player must also accomplish a series of sport-themed objectives. There is a throwing event, a golfing event, swimming, jumping, and all-out fighting events, all with unique twists inspired by the street/gangs theme of the game (e.g. the jumping event involves jumping across the rooftops in the city).</p><p>Depending on the player's performance in each event they may earn medals that can be exchanged for power-ups and stat increases. The game supports two players co-op or vs. gameplay.</p>"},{"name":"Crazy Climber","year":1986,"developer":"Nihon Bussan Co., Ltd."},{"name":"Creepy Brawlers","year":2017,"developer":"Mega Cat Studios"},{"name":"Crime Busters","year":1989,"developer":"Bit Corp"},{"name":"Crisis Force","year":1991,"developer":"Konami Co., Ltd.","url":":Crisis Force (Japan)","filesize":164383,"score":"","genres":"Action > Top-down > Anime / Manga > Arcade > Shooter","desc":"<p>The year is 199x and a robot army has invaded Tokyo City. A boy and a girl (who remain unnamed) board their ships to fight off the threat.</p><p>This is a vertical scrolling shoot-em-up game viewed from overhead, where the player pilots a fighter ship through seven levels of intense shooting action. Each level hurls enemies and bullets at the player's ship, ending with a boss fight, except for one which instead is a boss rush level. The game allows for two players to play at the same time.</p><p>The player has a choice of two weapons; bullets or lasers. Weapons can be changed by picking up gems of different colors. Picking up the same color as you already have allows you to upgrade your current weapon a few times. The player's ship can change form and with it the way that the weapons work. This allows the player to pick the best weapon strategy for each situation. The player also has a limited amount of bombs that are useful to get out of tricky situations.</p><p>When a weapon is upgraded it also acts as a shield so the ship can take an enemy bullet without dying. This will however degrade the weapon down to the first level again. There are also pickups that alter the ship's speed and a special gem that, if five of them are collected, temporarily transforms the ship into an invincible super ship.</p><p>Crisis Force was only released in Japan.</p>"},{"name":"CrossFire","year":1990,"developer":"Sanritsu Denki Co., Ltd."},{"name":"Cruisin'","year":1985,"developer":"Nihon Micom Kaihatsu"},{"name":"Crystal Mines","year":1989,"developer":"Color Dreams, Inc."},{"name":"Crystalis","year":1990,"developer":"Nintendo Software Technology Corporation","url":":Crystalis (USA)","filesize":222523,"score":7.9,"genres":"Action > Role-playing (RPG) > Top-down > Fantasy > Sci-fi / futuristic","desc":"<p>October 1st, 1997 is known as END DAY. A great war encircles the globe and brings about an end to civilization. The surviving humans concluded that they could never repeat their mistakes and build a great tower in the sky to watch over the world and act accordingly to combat \"evil\". One hundred years have passed since then and a hidden cryogenic chamber in the mountains springs to life...</p><p><em>Crystalis</em> is a top-down action role-playing game. Starting from the cryogenic chamber, the player takes the role of a mysterious hero who must uncover the mystery of the tower. The character may equip weapons, armor, shields and globes or bracelets on his body and a single item from his inventory for use in the field. To aid the hero on his quest, four wise people will gradually teach him offensive and healing magic, which requires MP to use. </p><p>The protagonist will also obtain four elemental swords which will help him progress. Each sword can be charged for a powerful ranged attack; if special items are found, this attack can be enhanced for two additional levels. The hero gains experience and gold from defeating monsters. The experience is used to gain levels and improve statistics, however a minimum level is required before one can do damage to specific bosses. Gold is used to purchase items in shops.</p>"},{"name":"Cyberball","year":1991,"developer":"Atari Games Corporation"},{"name":"Cybernoid: The Fighting Machine","year":1989,"developer":"A.P. Cooper Associates","url":":Cybernoid","filesize":34524,"score":7.2,"genres":"Action > Side view > Fixed / flip-screen > Shooter > Sci-fi / futuristic","desc":"<p>There are three asteroids, hidden among thousands, where various minerals and precious gems were stored. It was believed the riches would be safe there, until the Zoggians discovered them! Now you have to fly an experimental spacefighter, the Cybernoid, into battle to recover the asteroids. The Cybernoid is equipped with standard laser blasters, missiles, and the ability to pick up other weapons along the way. </p><p>Cybernoid is an arcade style action game for one player. You can choose from three different skill levels; easy, hard and lethal. On some versions two different sound modes are also available, a basic music and sound effects mode, and a super sound effects mode with no music. Each room you explore is equipped with a time bomb. The bomb will explode taking you with it should you take too long to get past all the obstacles on the screen. You start the game with nine ships, and more can be earned by collecting enough points during the game.</p>"}]