[{"name":"Dai Meiro: Meikyū no Tatsujin","year":1990,"developer":"Epoch Co., Ltd."},{"name":"Dai-2-ji Super Robot Taisen","year":1991,"developer":"Winky Soft Co., Ltd."},{"name":"Daisenryaku","year":1988,"developer":"SystemSoft"},{"name":"DAIVA Story 6: Nirsartia no Gyokuza","year":1986,"developer":"T&E Soft, Inc."},{"name":"Dance Aerobics","year":1987,"developer":"TRY Co., Ltd.","url":":Dance Aerobics (USA)","filesize":42018,"score":"","genres":"Action > Side view > Fixed / flip-screen > Music / rhythm","desc":"<p><em>Dance Aerobics</em> is a chance to get fit by following the movements of an aerobics instructor.</p><p>Players use side B of the Power Pad accessory (a floor mat with 12 pads in a 4 by 3 grid) to follow the movements of an aerobics instructor. To succeed the player must press the pads with there feet and hands at the same time as the on screen aerobics instructor. Any missed movements are recorded on a mistake counter and 10 missed movements will fail the level. The routines (a set of repeated movements) start slow and simple with a bit of no-penalty practise time however as the player gets better the routines get more complex with less practices time. Each level has a set number of routines that increase with each level from 4 at the start to a total of 32 on the final level (level 7). At the successful completion of each level the player will get a pass stamp which they can enter later to skip that level.</p><p>The second mode is mini-games called Pad Antics that includes Tune Up, Mat Melodies, and Ditto. Tune Up is where the 10 of the 12 pads (the centre 2 been where the player stands) makes a musical note (do, re, me etc.). Mat Melodies is like Tune Up but the player is given a song to play and the player must memorise to play the notes as they come as every missed note loses points, get over 80 points (from starting at 100) and progress to a harder song. Ditto is like a one-player twister like game where the objective is to place you hands and feet where indicated on the mat on the screen with 1 or 2 points scored with every successful position.</p><p>The third mode is Aerobics Studios. Aerobics Studios is the same as the main game but with only 4 levels (Studio 5, Studio 10, Studio 15, and Studio 20) all unlocked at the start, a score that counts down from 100 with mistakes (or up if the player is doing well), no progression in levels, and the player can continue playing even if there score is at 0.</p>"},{"name":"Dancing Block","year":1990,"developer":"Thin Chen Enterprise"},{"name":"Danny Sullivan's Indy Heat","year":1991,"developer":"Leland Corporation","url":":Danny Sullivan's Indy Heat (USA)","filesize":81855,"score":7.5,"genres":"Action > Racing / Driving > Top-down > Fixed / flip-screen > Licensed","desc":"<p>Danny Sullivan, 1988 IndyCar champion and winner of the classic 'Spin &amp; Win' Indianapolis 500 in 1985, put his name to this Super Sprint style racing game. There are 4 cars in each race, 1 or 2 player options, and 9 tracks to race on, with the Tradewest Speed Bowl the ultimate target, and is much longer but with double points (it's essentially a substitute for the licensed-elsewhere Indianapolis 500, which did pay double the usual level of IndyCar championship points for many years).</p><p>The player has limited fuel, and will run slowly if supplies run out, and the car can be damaged, although both are repairable in the pits. They get a turbo to use sparingly, which can also be recharged in the pits if they have bought more. After each race the player will get money (slightly more for a higher finish), which can be spent on upgrades such as improved power, brakes or more turbos.</p>"},{"name":"Darkman","year":1991,"developer":"Painting by Numbers, Ltd.","url":":Darkman (USA)","filesize":123674,"score":5.1,"genres":"Action > 1st-person > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Darkman</em> is an adventure game developed and published by Ocean Software. The title released in 1991 and 1992 for Gameboy, was also available for NES, Commodore 64, Amstrad CPC, Amiga, ZX Spectrum, and Atari ST and was the first entry in a saga with two other titles.</p><p>Similar to the movie of the same name, Darkman used to be a scientist exploring applications of a new synthetic skin useful for fire victims. The investigation was interrupted when a gang of mobsters entered his lab looking for a document, killing his assistant in the middle and leaving him seriously injured. At the same time, the scientist used a new surgical treatment that granted him immunity to pain, superhuman strength, but in exchange for intense impulses of anger and adrenaline. Thus, swearing vengeance against the gang of mobsters with a bandage covering his burned face in the criminal attack, Darkman was born.</p><p>The game is a side-scrolling platformer at times, in which the main character must advance through the levels using masks of their victims, attacking enemies, and jumping obstacles. The masks are obtained in the photography mode, where the game changes to a first-person perspective and the user must photograph the criminal to copy his face. These mini-games of photographs are vital for the resolution of the platform levels since the duration of the mask in the next level will depend on the quality of the photos that the player takes.</p>"},{"name":"Dash Galaxy in the Alien Asylum","year":1990,"developer":"Beam Software Pty., Ltd.","url":":Dash Galaxy in the Alien Asylum (USA)","filesize":38755,"score":4.8,"genres":"Action > Side view > Top-down > Arcade > Platform > Sci-fi / futuristic","desc":"<p>You are Dash Galaxy, a fearless space explorer. You have just landed on a strange, alien planet thousands of light years from Earth. Your mission is to make your way though the maze of rooms and return safely to your ship. To do this you will need to enter every room and collect all of the objects that can be found in it. Your oxygen supply is limited, though, so be sure to hurry! Throughout this world there are many aliens which will deplete your oxygen even faster if you come into contact with them. Occasionally you will find bombs or keys which can be used to reach previously inaccessable rooms on a floor. The game is played from two points of view; top down when in an elevator shaft, or side scrolling when in one of the many rooms. Some levels contain hidden rooms with many bonuses, or even an express elevator to get you to your destination faster (or it might take you back down a few levels.)</p>"},{"name":"Data East All Star Collection","year":2017,"developer":""},{"name":"David Crane's A Boy and His Blob: Trouble on Blobolonia","year":1990,"developer":"Imagineering Inc.","url":":David Crane's A Boy and His Blob - Trouble on Blobolonia (Europe)","filesize":104885,"score":6.5,"genres":"Action > Side view > Fixed / flip-screen > Platform > Puzzle elements","desc":"<p>In this unique Platform/Puzzle game you take control of a boy who has to help a blob getting to his home planet. It isn't a conventional Platformer, as the boy cannot jump or attack enemies.  Instead, the Blob can be fed with different kinds of jellybeans, which will transform him into various objects. He can be used as a ladder, a bridge or a trampoline, turned into an umbrella to slow down the boy's fall or shield him from falling objects, into a bubble to let the boy swim and breathe underwater, a blow torch to burn certain obstacles or even a bird which enables him to follow the boy everywhere. There's  total of 12 different shapes the blob can take on, all of which can be used to freely explore the game world.</p>"},{"name":"Day Dreamin' Davey","year":1992,"developer":"Sculptured Software, Inc.","url":":Day Dreamin' Davey (USA)","filesize":195688,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Fantasy","desc":"<p>Davey is a child with an overactive imagination. During a day at school, he runs into events that will cause him to escape into his fantasy world, which in game terms equates to the levels you will be playing through. The fantasy lands include treks through the middle ages, the wild west, ancient Rome, and Mount Olympus (some of these levels will be revisited throughout the game). Your weapons are level specific such as a sword and lance in the medieval level and a gun and whip in the wild west level.</p>"},{"name":"Days of Thunder","year":1990,"developer":"Tiertex Ltd.","url":":Days of Thunder (USA)","filesize":176742,"score":5.8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Top-down > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Tom Cruise's film brought NASCAR racing to the masses, and Mindscape did the same for games players with this license. If you mentally change the driver names, it can be thought of as a recreation of real NASCAR racing rather than a direct recreation of the film. </p><p>You play Cruise's Cole Trickle character (his name, like many of the others, is slightly different to that of a real NASCAR racer of the day) against your rivals on 8 tracks, based on real-life counterparts. The races are all on ovals, although the exact lengths, corner types and gradients are varied.  This means that the ideal racing line on one track can put you into the wall on another. Qualifying is incorporated alongside the races themselves.</p><p>From times to times you'll have to pull into the pit stop area. When doing so, you control the five members of the pit crew. Loosing time on pit will make you lose positions at the race. The other racers, however, never pit.</p><p>The NES version has 3rd-Person perspective only.</p>"},{"name":"Days of Thunder: Unreleased Version","year":2020,"developer":"Mindscape SA"},{"name":"De-Block","year":1991,"developer":"Athena Co., Ltd."},{"name":"Dead Tomb","year":2021,"developer":""},{"name":"Dead Zone","year":1986,"developer":"Sun Electronics Corp."},{"name":"Deadly Towers","year":1986,"developer":"Lenar Co., Ltd.","url":":Deadly Towers (USA)","filesize":69316,"score":4.3,"genres":"Action > Top-down > RPG elements > Fantasy","desc":"<p>You are prince Myer, and you are about to become the ruler of your country. Strolling outside just before the ceremony, you meet a strange person by the lake. You are told about an evil wizard planning to destroy the land. In order to stop him and to fulfill an ancient prophecy, you have to travel to the Northern Mountain and to destroy the Seven Bell Towers.</p><p><em>Deadly Towers</em> is an action game with very light RPG elements. On every screen there are hordes of enemies for you to dispatch, by throwing your sword at them. The gameplay style is similar to Zelda series.</p>"},{"name":"Death Race","year":1990,"developer":"American Game Cartridges, Inc."},{"name":"Deathbots","year":1990,"developer":"Odyssey Software, Inc.","url":":Deathbots (USA) (Rev 1) (Unl)","filesize":49352,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The Mutech Corporation has created their Gamma Base on what used to be Alcatraz Island. Their attempts at creating computer intelligence has backfired, as the AI they've created has taken over the computer systems and is threatening the world! Deep in the fortress is a gamma bomb, and your goal is to penetrate the fortress to destroy the bomb before it can be used. But be careful, for many Deathbots are guarding the maze-like passageways leading to the bomb! </p><p>Gameplay is from an overhead point of view;  you'll need to find your way through the various passageways to reach the gamma bomb (located on the 8th level) and diffuse it. In addition to doorways and walls, transporters can also be found in the maze. These will instantly teleport you to a new location, and on many levels you will need to figure how to use them correctly to get past otherwise dead ends. Different types of Deathbots guard the passages; and you'll need to use the various weapons you find lying about to get past them, before they destroy you. You have a limited amount of energy. Each time you are hit by enemy fire or by a Deathbot, your energy depletes. Lose all of of your energy and a life is lost. And of course, each level ends with a large boss Deathbot. Good luck on your mission!</p>"},{"name":"Decathlon","year":1992,"developer":"Computer & Entertainment Inc."},{"name":"Deep Dungeon III: Yūshi e no Tabi","year":1988,"developer":"Humming Bird Soft"},{"name":"Deep Dungeon IV: Kuro no Yōjutsushi","year":1990,"developer":"Humming Bird Soft"},{"name":"Deep Dungeon: Madō Senki","year":1986,"developer":"Humming Bird Soft"},{"name":"Defender of the Crown","year":1989,"developer":"Backyard Fort Interactive","url":":Defender of the Crown","filesize":126595,"score":7.3,"genres":"Action > Strategy > 1st-person > Side view > Europe > Historical events > Medieval","desc":"<p><em>Defender of the Crown</em> puts the player in the role of one of four Saxon knights in medieval England, in a time where the land is in turmoil as the King is dead and his crown was stolen. The Saxons and the Normans blame each other and fight for control of England.</p><p>After a short introduction by Robin of Locksley himself, the game starts with a single castle and 10 soldiers at your command. From there, you have to build your army, take control of additional territories and fight and defeat the three Norman lords - and sometimes your Saxon friends as well.</p><p>In addition to the basic 'build your army and conquer your opponents' the game offers several events and options that can be used to fine tune your play style: You may engage in a jousting contest where you have to knock your opponent off his horse, gaining either fame or land, or you can go raid a castle for loot or the hand of a princess, joining your houses and territories.</p>"},{"name":"Defenders of Dynatron City","year":1992,"developer":"Lucasfilm Games LLC","url":":Defenders of Dynatron City (USA)","filesize":159005,"score":5.8,"genres":"Action > Side view > Shooter > Sci-fi / futuristic","desc":"<p>You are a group of repairman, who are superheroes now because of coca-cola produced by evil Doctor Mayhem. Doctor wants to mutate all people proposing to them his cola, but you want to prevent this plan killing his robots and finally stopping the Doctor. When the game starts you choose your character and some others join you in your case. If your character will be captured you can choose another one, while nobody is left.</p>"},{"name":"Deja Vu: A Nightmare Comes True!!","year":1988,"developer":"ICOM Simulations, Inc.","url":":Deja Vu","filesize":146428,"score":7.5,"genres":"Adventure > 1st-person > Fixed / flip-screen > Turn-based > Graphic adventure > Point and select > North America > Detective / mystery","desc":"<p><em>Déjà Vu: A Nightmare Comes True!!</em> is the first game made by ICOM, known for its adventure games such as Shadowgate and Uninvited. It featured mouse support, a multi-window interface, and bitmapped graphics at a time when text-based interactive fiction was the norm. </p><p>In <em>Deja Vu</em>, action takes place in Chicago in December 1941. Your character's name is Theodore \"Ace\" Harding - a retired boxer working as a private eye. He wakes up in a toilet stall of a sleazy pub with no memory of who he is or what he is doing there. To make matters worse, you as him soon stumble upon a very dead corpse upstairs with three bullets buried in him. Sure enough, you find there's a gun in your pocket with three bullets missing. From there you have to figure out what happened and who you are before whatever is happening to your brain turns you into a mindless vegetable. To make matters worse the cops would very much like to have a word with you about that stiff.</p>"},{"name":"Demon Sword","year":1988,"developer":"Tose Co., Ltd.","url":":Demon Sword","filesize":106568,"score":5.6,"genres":"Action > Side view > Arcade > Platform","desc":"<p>In Demon Sword you play the part of the noble fighter Victar. Victar carries with him a sword which was used long ago to defeat the evil Dark Fiend who took over the land. Now he is back, and Victar must use the sword to defeat him once again.  The game is an arcade style platform game. You begin with just part of the demon sword, and after defeating a large monster at the end of each level an additional section of the sword is restored. After all six missing parts of the sword are found, you can attempt the final level to defeat the Dark Fiend. In addition to the sword pieces, there are other items which can be found during the levels to help out; these include keys to open mystic doors, spheres to restore life, and different types of weapons.</p>"},{"name":"Desert Commander","year":1988,"developer":"Kotobuki System Co., Ltd.","url":":Desert Commander (USA)","filesize":81796,"score":"","genres":"Strategy > Top-down > Turn-based > Turn-based strategy > Historical events > World War II > Regional differences","desc":"<p>Somewhere in a nameless desert, two opposing nameless armies take to the battlefield to destroy the other. Through the strategy of their commanders and the diversity of their units, each side seeks to gain the advantage over the other. There are 5 campaigns total and can be played either VS the computer or a second player.</p><p>The game is is a top-view turn-based strategy games with animated battle sequences between units. Each unit can move a certain value across the battlefield on different types of terrain and must keep track of it's ammunition and fuel consumption. Towns are scattered around the map for resupply and other special icons (Position, Oasis, Airfield) confer other special advantages. Players may choose any combination of choices of 2 types of air units and 2 styles of cannon, 4 types of land vehicles and an infantry unit to customize their specific strategy. The side that loses their Headquarters unit first loses.</p>"},{"name":"Destination Earthstar","year":1990,"developer":"Imagineering Inc.","url":":Destination Earthstar (USA)","filesize":36454,"score":"","genres":"Action > Simulation > 1st-person > Side view > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>Two centuries ago, an alien species known as the Kojans kidnapped the people of Earth and made them their slaves. But the Earthlings never gave hope of returning to their homeland. So they sent you, a brave space ship pilot, to travel through the galaxy in search of the Earth. But beware, as the Kojans won't let you pass without a fight!</p><p>The gameplay is divided into two parts. You begin in the simulation mode, controlling your ship from first-person perspective. You can change your altitude, speed, and weapons, at the same time paying attention to the fuel you have left. Once you have defeated enough enemies and landed on a planet, the game turns into a side-scrolling shooter in which you must navigate your ship through arcade sequences.</p>"},{"name":"Destiny of an Emperor","year":1989,"developer":"Capcom Co., Ltd.","url":":Destiny of an Emperor","filesize":159333,"score":7,"genres":"Role-playing (RPG) > Strategy > Top-down > Anime / Manga > China (Ancient / Imperial) > Historical events > Licensed","desc":"<p><em>Destiny of an Emperor</em> is a strategy role-playing game set in the Three Kingdoms era. A party is formed by selecting up to five officers from a huge pool, many of whom would only join you after be bribed or defeated in combat. Officers in turn each have a certain amount of soldiers, which essentially acted as hit points (i.e. Sima Ye leads 40000 men, and when he is hit by Zhang Bao, he loses 5000 men, so his manpower is now at 35000).</p>"},{"name":"Devil World","year":1984,"developer":"Nintendo R&D1","url":":Devil World (Europe)","filesize":16926,"score":6.7,"genres":"Action > Top-down > Arcade","desc":"<p><em>Devil World</em> is a scrolling maze game, strikingly similar to the classic Pac-Man, only with an undeniable religious bent. Collect dots in an automatically-scrolling maze directed by the devil himself, use crosses to power up and destroy his minions, and be careful not to get crushed by the walls. After collecting all the dots, you must collect bibles to seal up the source of the enemies and make the devil temporarily retreat. After this, there is a timed bonus stage where the player can control the scrolling, then the next round starts the cycle over from the beginning.</p>"},{"name":"Dezaemon","year":1991,"developer":"KID Corp."},{"name":"Dick Tracy","year":1990,"developer":"Realtime Associates, Inc.","url":":Dick Tracy (USA)","filesize":83723,"score":5.4,"genres":"Action > Side view > Top-down > Platform > Puzzle elements > Detective / mystery > Licensed","desc":"<p>You play as square-jawed detective Dick Tracy as he tries to solve five different crimes that vary in difficulty. This game is mostly a platform game with some overhead driving to get to the different buildings in search of clues.</p><p>There are five different weapons in the game: hand gun, tommy gun, super punch, tear gas and Tracy's plain fists. There are also medical kits that can be found. Enemies can be armed or unarmed. If Tracy shoots an unarmed thug, he loses health.</p><p>The main goal of the game is to collect five clues; enough to be able to arrest the culprit. Clues are scattered all over town in various buildings, usually full of Tracy-hating thugs. You start by viewing the mug shots of known criminals, going to there last whereabouts and interrogating them.</p>"},{"name":"Die Hard","year":1991,"developer":"Pack-In-Video Co., Ltd","url":":Die Hard (USA)","filesize":127264,"score":6,"genres":"Action > Top-down > 2D scrolling > Licensed","desc":"<p>John McClain decides to visit his wife Holly in Nakatomi Plaza, only to discover that she is taken hostage on the 30th floor, along with a bunch of other hostages. The main terrorist, Hans, is after the money locked away in a safe on the 30th floor. His hacker, Theo, is slowly breaking the locks into the vault. It's up to McClain to stop them. <em>Die Hard</em> for the Nintendo Entertainment System is very different from its other counterparts. The game is played from a top-down perspective, rather than the 1st-/3rd-person perspective.</p><p>There are 40 terrorists scattered throughout the building, and the task is to clear each floor of terrorists. The stairwell, air duct or the express elevator is used to travel only to Floors 31-35. These are freely accessible at any time, doing away with linearity, and more floors are unlocked in \"Advanced\" mode. At the start of the game, John can only use his fists to deal with foes, but after bringing down some terrorists, several weapons become available, including the pistol, machine gun, C-4 explosives, rocket launcher, and flashbangs, using their weapons against them. When hit by these terrorists, John loses some life, but it can be restored by collecting soda cans and medkits. The game ends when all life is lost. </p><p>One interesting aspect of the game allows the player to listen to Hans shouting orders to his guards through a two-way radio. Also notable is the \"foot meter\". It starts out full, but will eventually decrease if John steps on shattered glass or runs around at a faster speed. If the meter is empty, he will walk much slower than with a full meter. This may have been added in tune with the film, where the main character John McClain's feet end up in pretty bad shape near the end. Parts of the environments are destructible, most notably vending machines (receive free soda), glass walls and windows. Not all parts of the environment are shown on the screen all the time - a fog of war appears to shroud nearby areas in darkness.</p><p>The missions are time limited. There about four minutes before one of the six locks are opened (shown in the status screen), but more time can be gained by destroying the main computer on the fourth level. Once all the locks have been opened, there are only a few minutes to escape. Once this time expires, the game ends.</p><p>Like its counterparts, the game features cinematic sequences, which change the story depending on which actions are taken.</p>"},{"name":"Dig Dug","year":1985,"developer":"Namco Limited","url":":Dig Dug (Japan)","filesize":15399,"score":7.3,"genres":"Action > Side view > Fixed / flip-screen > Arcade","desc":"<p><em>Dig Dug</em> is a 1-2 player arcade game in which you have to use your shovel to dig your way through the earth. Stopping you from doing this are two monsters, called Pooka and Fygar, who will continually chase you around. The only weapon that you carry is an air pump, which you can use to inflate the monsters to the point where they explode. (if you start to inflate them but stop doing so, the monsters will get turned back to their normal selves). Furthermore, rocks are scattered throughout the earth, and you can use these rocks to squash them. If the monsters do not find you for several seconds, they will eventually get turned into ghosts, which can walk through the earth. They are invincible and cannot be killed. From time to time, vegetables will appear in the center, and you can get these for points.</p>"},{"name":"Dig Dug II: Trouble in Paradise","year":1986,"developer":"Namco Limited","url":":Dig Dug II - Trouble in Paradise (USA)","filesize":25914,"score":6.3,"genres":"Action > Diagonal-down > Fixed / flip-screen > Arcade > Direct control","desc":"<p>It is Dig Dug's job to protect 72 different tropical islands from his arch rivals, Pooka and the fire breathing Fygar. Played from an overhead point of view, Dig Dug now has two weapons at his disposal; the first is an air pump and the second is a drill. The pump can be used to inflate and destroy the enemies the same as in the original Dig Dug. At various locations on the islands are stakes, and when the drill is used near a stake a crack will form. If enough cracks become connected that section of the island will fall into the ocean, hopefully taking an enemy (and not Dig Dug!) with it. When all of the Pookas and Fygars have been destroyed, the game moves on to the next, more difficult level.</p>"},{"name":"Digger T. Rock: Legend of the Lost City","year":1990,"developer":"Rare Limited","url":":Digger T. Rock - The Legend of the Lost City (Europe)","filesize":76866,"score":6.6,"genres":"Action > Side view > Puzzle elements > Fantasy","desc":"<p>Digger T. Rock, a brave little miner who dares to dig where no shovel has gone before! He just loves to uncover underground wonders. And he dreams of discovering a buried city bursting with golden treasures and ancient relics. On this very morning, deep within a craggy, slippery cave, Digger stumbles upon a half-hidden sign pointing way, way down...to a Lost City!</p>"},{"name":"Digital Devil Story: Megami Tensei","year":1987,"developer":"Atlus Co., Ltd."},{"name":"Digital Devil Story: Megami Tensei II","year":1990,"developer":"Atlus Co., Ltd."},{"name":"Dirty Harry","year":1990,"developer":"Gray Matter Inc.","url":":Dirty Harry (USA)","filesize":207545,"score":5.4,"genres":"Action > Side view > 2D scrolling > North America > Licensed","desc":"<p><em>Dirty Harry</em> is based on the popular Clint Eastwood movie character of \"Dirty\" Harry Callahan (rather than the specific movie \"Dirty Harry\"), a cop famous for his use of a .44 magnum for doing away with evildoers, and for his catchphrase, \"Go ahead, make my day.\" In fact, the game begins with a digitized sample of that quote. The game play consists primarily of side-scrolling action. Dirty Harry can punch and kick the copious thugs that assault him using their own fists, guns, baseball bats, nets, and dynamite. The hero can also pull is .44 and aim it in 5 directions in order to pick off enemies, but the ammo is limited. Further, Dirty Harry has a number of other tools at his disposal, provided he collects them.</p><p>This is not a one-way side-scroller, however. There are some adventure elements as well, such as being able to walk through alleys to other streets and going through doors to enter building. Entering buildings provides even greater challenges, like snakes and laser flooring. Dirty Harry even takes the fight down to the sewer.</p>"},{"name":"Dirty Pair: Project Eden","year":1987,"developer":""},{"name":"Disney's Aladdin","year":1994,"developer":"Virgin Games, Inc.","url":":Disney's Aladdin (Europe)","filesize":166535,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Middle East > Licensed","desc":"<p>The game from Virgin based on the 1992 animated Disney film is a side-scrolling platformer.</p><p>The player controls Aladdin, who must make his way through several levels based on locations from the movie: from the streets and rooftops of Agrabah, the Cave of Wonders and the Sultan's dungeon to the final confrontation in Grand Vizier Jafar's palace. The Sultan's guards and also animals of the desert want to hinder Aladdin in his way. He can defend himself with his sword or by throwing apples. Next to apples, Aladdin can also collect gems which can be traded for lives and continues with a traveling trader. Finding Genie or Abu icons enables bonus rounds. The Genie bonus round is a game of luck played for apples, gems or extra lives. In Abu's bonus round, the player controls the little monkey who has to catch bonus items that fall from the sky, but without touching any of the unwanted objects like rocks and pots.</p><p>The game's humorous animations were created by Walt Disney Feature Animation.</p>"},{"name":"Disney's Beauty and the Beast","year":1994,"developer":"Probe Software Ltd."},{"name":"Disney's Chip 'N Dale: Rescue Rangers","year":1990,"developer":"Capcom Co., Ltd.","url":":Disney's Chip 'n Dale - Rescue Rangers (USA)","filesize":144700,"score":7.8,"genres":"Action > Side view > Arcade > Platform > Licensed","desc":"<p>The rescue rangers are tiny heroes. Consisting of two chipmunks, two mice and a fly... these heroes may be small but there's no case too big for them to take on. This game starts out simply enough, with a mission to rescue a small kitten, but soon escalates into a wider plot that pits the rescue rangers against their arch-nemesis, the feline kingpin, Fat Cat.</p>"},{"name":"Disney's Chip 'N Dale: Rescue Rangers 2","year":1993,"developer":"Capcom Co., Ltd.","url":":Disney's Chip 'n Dale - Rescue Rangers 2 (USA)","filesize":138532,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>Following the first Rescue Rangers game, the Rangers overcame the plot of their arch-nemesis Fatcat and locked him up in the prison/pound. However, Fatcat's henchmen have sprung him from prison by blimp. Suddenly a television news anchor is reporting that there is a bomb threat in a local restaurant. The Rescue Rangers take it upon themselves to save the day only to learn that the whole bomb scare was a diversion in order to allow Fatcat to steal an artifact known as the Urn of the Pharaoh. The team must track Fatcat and learn what he has in store for the stolen goods.</p><p>Like the previous game, <em>Chip &amp; Dale's Rescue Rangers 2</em> is a side-scrolling action game where 2 players can play simultaneously as Chip &amp; Dale, or 1 player can control either chipmunk. Our heroes must conquer a series of oversized (from their perspective) stages in order to thwart Fatcat's nefarious schemes. For example, the first stage has the chipmunks hopping across the tables, chairs, and counters of a restaurant, and on through the kitchen. Many enemies try to slow the player's progress. The chipmunks' offensive ability is to pick up any of the copious blocks that litter the landscape and toss it in any of 5 directions (sideways, up, and diagonal-up). Along the way, there are scattered RR blocks for the heroes to collect. The other members of the Rescue Rangers -- Monty, Gadget, and Zipper -- are on hand to lend help out at key junctures.</p>"},{"name":"Disney's Darkwing Duck","year":1992,"developer":"Capcom Co., Ltd.","url":":Darkwing Duck (USA)","filesize":127776,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The city of St. Canard is plagued by an unseen crime wave. The intelligence agency S.H.U.S.H. suspects that the shady organization F.O.W.L. and their valued operative Steelbeak are its causes. The caped superhero Darkwing has made quite some enemies in the criminal circles thanks to his past heroic deeds, and now the entire city has to pay for that. Naturally, the valiant duck is determined to travel through the dangerous streets of St. Canard, defeat his foes, and foil Steelbeak's plans.</p><p><em>Darkwing Duck</em> is a side-scrolling platform game featuring the titular character from the Disney television series. The gameplay is similar to Duck Tales, also resembling Mega Man games in many ways. Darkwing's default weapon is a gas gun; special adapters that modify its functions can be collected during exploration. By using his cape, Darkwing is able to deflect some of the enemy projectiles. Weapons can be changed via a sub-screen.</p>"},{"name":"Disney's DuckTales","year":1989,"developer":"Capcom Co., Ltd.","url":":DuckTales (USA)","filesize":84070,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform > Licensed > Regional differences","desc":"<p>Duck Tales for NES is a traditional platform game in which the player takes the role of greedy Scrooge McDuck in search of treasures around the globe. He counts on his three nephews and on other Duck Tales characters to help him in his quest through inhospitable places such as the Amazon rainforest, the African mines, the Himalayas, Transylvania (where he meets Dracula Duck) and even the Moon.</p><p>Each one of them reserves the old duck lots of adventure, different enemies and hidden rooms.</p><p>The game features a 2D side-scrolling platform gameplay very similar to Mega Man. Graphics are colorful and cartoonish, music is reminiscent of the TV series, and controls are very simple.</p>"},{"name":"Disney's DuckTales 2","year":1993,"developer":"Capcom Co., Ltd.","url":":DuckTales 2 (USA)","filesize":91906,"score":8.1,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>While in the basement of Uncle Scrooge's mansion, Huey, Dewey and Louie discover an old piece of paper. When they show it to Uncle Scrooge, he recognizes it as part of his great, great Uncle Fergus McDuck's legendary treasure map! With the remaining parts of the map hidden around the world, it's up to Uncle Scrooge to find them and discover Fergus McDuck's secret treasure!</p><p><em>Duck Tales 2</em> is the sequel to the NES and Game Boy game, Duck Tales. Based on the Disney cartoon of the same name, players control Uncle Scrooge as he searches the globe for massive amounts of wealth while trying to discover hidden pieces of the map.</p><p>Scrooge's main method of attack is his cane - by jumping in the air and holding the B Button, the cane turns into a pogo stick, allowing players to jump onto most enemies' heads and cross dangerous terrain like spikes with ease. By pushing up against a wall or an object, Scrooge will whack his cane like a golf club, either sending the object flying or occasionally revealing secret items. New to Duck Tales 2 is the ability to push and pull certain objects with the cane after hitting them.</p><p>Familiar faces such as Huey, Dewey and Louie, Webby, Mrs. Beakley, and Launchpad McQuack all turn up to lend a hand. Scrooge will even bump into the crazy inventor, Gyro Gearloose, who will improve Scrooge's cane so that he can access even more secret areas.</p>"},{"name":"Disney's TaleSpin","year":1991,"developer":"Capcom Co., Ltd."},{"name":"Disney's The Jungle Book","year":1994,"developer":"Eurocom Developments Ltd","url":":Disney's Jungle Book, The (USA)","filesize":141795,"score":7.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>One of several games released in 1994 based on the Disney film <em>The Jungle Book</em>, the version for Nintendo's 8-bit machines is similar in design to the Genesis version, but has a unique set of levels.</p><p>In each of the 10 platforming stages, jungle boy Mowgli has to collect a certain number of jewels to advance. Most of them are scattered over the level, but some are dropped by killed enemies. The foes consist of a variety of jungle animals like snakes, monkeys, rhinoceroses and hedgehogs. Mowgli can jump on their heads or use a number of weapons to dispatch them. These include bananas, double bananas, boomerangs and nuts. Ammunition for the last three must be collected from fallen foes. In addition to ammo, Mowgli can also pick up fruit that restore health, a mask that grants invincibility (to be triggered when needed) and a shovel which grants access to bonus levels. </p><p>In every second level, the jewel hunt is followed by a boss fight. These not only feature the film's villains like Kaa the snake, King Louie the ape and Shere Khan the tiger, but for some reason Mowgli must also knock out his friend Baloo the bear.</p>"},{"name":"Disney's The Lion King","year":1995,"developer":"Dark Technologies"},{"name":"Disney's The Little Mermaid","year":1991,"developer":"Capcom Co., Ltd.","url":":Disney's Little Mermaid, The (USA)","filesize":84959,"score":7,"genres":"Action > Side view > 2D scrolling > Licensed","desc":"<p>In this version of <em>Disney's The Little Mermaid</em> you play as Ariel the mermaid.</p><p>Ariel has already met Eric, and they plan to wed, but the sea-witch Ursala has taken control of the ocean! So Ariel (After explaining what's going on to Eric) becomes a mermaid once more and sets off to rescue the sea.</p><p>The game takes place from a side view and Ariel (Swimming most of the time, but hopping around on the land occasionally) can shoot bubbles to trap her foes and can then throw them at each other. She can also dig through sand to find treasure and pick up sea shells to help her break chests open.</p><p>The treasure she finds in the sand is usually just bonus points, but the treasure you find in chests will increase your bubble's power and range.</p>"},{"name":"Dizzy: Prince of the Yolkfolk","year":1993,"developer":"The Big Red Software Company Ltd."},{"name":"Don Doko Don","year":1990,"developer":"Taito Corporation"},{"name":"Don Doko Don 2","year":1992,"developer":"Taito Corporation"},{"name":"Donald Land","year":1988,"developer":"Data East Corporation"},{"name":"Donkey Kong","year":1983,"developer":"Nintendo Co., Ltd.","url":":Donkey Kong (World) (Rev A)","filesize":16707,"score":6.8,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform > Direct control","desc":"<p>Released in the arcades in 1981, <em>Donkey Kong</em> was not only Nintendo's first real smash hit for the company but marked the introduction of two of their most popular mascots: Mario (originally \"Jumpman\") and Donkey Kong.</p><p><em>Donkey Kong</em> is a platform-action game that has Mario scale four different industrial-themed levels (construction zone, cement factory, an elevator-themed level, and removing rivets from girders) in an attempt to save the damsel in distress, Pauline, from the big ape before the timer runs out. Once the rivets are removed from the final level, Donkey Kong falls, and the two lovers are reunited. From there, the levels start over at a higher difficulty.</p><p>Along the way, Mario must dodge a constant stream of barrels, \"living\" fireballs, and spring-weights. Although not as powerful as in other future games, Mario can find a hammer which allows him to destroy the barrels and fireballs for a limited amount of time. Additionally, Mario can also find Pauline's hat, purse, and umbrella for additional bonus points.</p><p><em>Donkey Kong</em> is also notable for being one of the first complete narratives in video game form, told through simplistic cut scenes that advance the story. It should also be noted that in many conversions of the original coin-op game for early 1980's consoles and computer systems, <em>Donkey Kong</em> only used two or three of the original levels, with the cement factory most often omitted.</p>"},{"name":"Donkey Kong 3","year":1984,"developer":"Nintendo Co., Ltd.","url":":Donkey Kong 3 (World)","filesize":16992,"score":5.9,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p>Released in the arcades in 1983, Donkey Kong 3 is the third of the \"Donkey Kong\" arcade game series, changing the format to more of an action-shooter than a platform game. </p><p>As Stanley the Bugman, players are positioned under Donkey Kong, who has taken over a multi-level greenhouse.  Stanley's goal is to remove Donkey Kong from the greenhouse, but the big ape isn't willing to leave without a fight.</p><p>Donkey Kong will agitate two beehives that are close to him to send down a swarm of angry Buzzbees, Beespies and destructive Queen Bees toward Stanley.  These insects, as well as caterpillars which creep down nearby vines are intent on destroying the flowers below Stanley.  Donkey Kong will also send down projectiles himself in an attempt to stop Stanley's attacks.  Stanley must jump between the levels and use his bugspray to repel the insects, and send Donkey Kong into the next area of the greenhouse.</p><p>Once Stanley pushes Donkey Kong high enough, a can of super bugspray will become available, allowing a larger shooting radius, and is able to send Donkey Kong up the vines faster.</p><p>Once Donkey Kong is sent through the three levels of the greenhouse, Donkey Kong will end up with a beehive on his head, and the levels start all over again.</p>"},{"name":"Donkey Kong Classics","year":1988,"developer":"Nintendo Co., Ltd.","url":":Donkey Kong Classics (USA, Europe)","filesize":31733,"score":7.4,"genres":"Action > Arcade > Platform","desc":"<p><em>Donkey Kong Classics</em> features both the original Donkey Kong and Donkey Kong Junior in a single cartridge.</p>"},{"name":"Donkey Kong Jr. / Jr. Sansuu Lesson","year":1983,"developer":""},{"name":"Donkey Kong Jr. Math","year":1983,"developer":"Nintendo Co., Ltd.","url":":Donkey Kong Jr. Math (USA, Europe)","filesize":17528,"score":4.8,"genres":"Educational > Puzzle > Side view > Fixed / flip-screen > Math / logic","desc":"<p>One of the first edutainment games for NES.</p><p>Donkey Kong gives Junior some math problems ranging from simple to more challenging. Move up and down the vines to find the correct answers as fast as possible.</p>"},{"name":"Donkey Kong Junior","year":1983,"developer":"Nintendo Co., Ltd.","url":":Donkey Kong Jr. (World) (Rev A)","filesize":17355,"score":6.7,"genres":"Action > Side view > Fixed / flip-screen > Platform","desc":"<p>Mario has kidnapped Junior's Papa!</p><p><em>Donkey Kong Jr.</em> was originally released in the arcades in 1982 as a sequel to Donkey Kong. In this game, Mario plays the antagonist, finally having captured Donkey Kong, and has put the ape in a locked cage. As Donkey Kong Jr., players will have to make their way through four different levels (Vines, Springboard, Chains and Mario's Hideout) in an attempt to find keys to free the little monkey's father.</p><p>Along the way, Mario will send out Snapjaws, swooping purple birds, and electric sparks in an attempt to stop Junior. Junior can defend himself by dropping fruit found around the levels on the heads of his foes. The more foes a piece of fruit hits in a falling sequence, the higher bonus points can be scored.</p><p>Junior can also avoid enemies more easily by grabbing hold of two chains or vines at a time to climb away faster, or by jumping over his foes. However, any long fall or falling into the water on certain levels will mean the loss of a life for Junior.</p><p>In the final cut scene, Junior will free Donkey Kong and both will escape after giving Mario the boot. Once all four levels are cleared, the game levels will start over at a higher difficulty.</p><p>Like the original Donkey Kong, the earlier 1980's console versions do not have all of the levels and animations from the arcade.</p>"},{"name":"Doodle World","year":2021,"developer":""},{"name":"Door Door","year":1985,"developer":"Chunsoft Co., Ltd."},{"name":"Doraemon","year":1986,"developer":"Hudson Soft Company, Ltd.","url":":Doraemon (Japan) (Rev A)","filesize":84617,"score":"","genres":"Action > Diagonal-down > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Licensed","desc":"<p><em>Doraemon</em> is an action game based on the popular children's cartoon of the same name. As the eponymous blue robot cat, the player must rescue each of his friends who have been kidnapped. Much like Hudson's earlier title Challenger, each stage plays differently from the others.</p><p>In the first stage, Doraemon must explore a large top-view overworld. There are open manholes and \"dokodemo Doors\" that lead to various places and to side-scrolling areas. The goal is to find the proper path through the stage and to rescue Nobita. The second stage is a side-scrolling shooting stage, where Doraemon must make his way through three areas in order to rescue Suneo and Gian. The third and final stage is an underwater maze where Doraemon must collect various items and get help from his other friends in order to rescue Shizuka.</p><p>There are numerous items to be found throughout the game that will increase Doraemon's abilities, including increasing his maximum health (which can be refilled be collecting his favorite food Dorapan) and enhancing his offensive capabilities.</p>"},{"name":"Doraemon: Giga Zombie no Gyakushu","year":1990,"developer":"Himax","url":":Doraemon - Giga Zombie no Gyakushuu (Japan)","filesize":152722,"score":"","genres":"Role-playing (RPG) > 1st-person > Top-down > Turn-based > Licensed","desc":"<p>This game is based on the animé series about the mechanical blue cat Doraemon, who can turn dream into reality and create magical worlds where he helps people and fights the evil. </p><p>Some time ago, Giga Zombie revived dead kings in order to conquer the world. Doraemon and his friends fought the evil being, but were trapped in a magical portal, and ended up in different time periods. In this game, the nameless hero (you can choose to be either male or female) must help Doraemon to find his friends and to save the world once again.</p><p>The game is a traditional top-down RPG with turn-based party combat viewed from first person perspective. The unusual part is the time traveling. You and your party can travel to different time periods, change the present and discover many secrets.</p>"},{"name":"Double Dare","year":1990,"developer":"Rare Limited","url":":Double Dare (USA)","filesize":164383,"score":5.8,"genres":"Puzzle > Side view > Fixed / flip-screen > Game show / trivia / quiz > Licensed","desc":"<p><em>Double Dare</em> is the computer version of the game show originally hosted by Marc Summers. Like the TV show, the game is basically a trivia game with the added enhancement of being able to answer the question, or take a dare. Dares consist of the Toss-up Challenge, the Physical Challenge, and in the last round, the Obstacle Course. Questions are varied, and in large enough number to avoid excessive repetition even over several games worth of play.</p>"},{"name":"Double Dragon","year":1988,"developer":"Technos Japan Corp.","url":":Double Dragon (Europe)","filesize":140972,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Direct control","desc":"<p>Set in a post-apocalyptic New York, <em>Double Dragon</em> is the story of Billy and Jimmy Lee, twin brothers trained in the fighting style of Sou-Setsu-Ken. Together, they manage a small martial arts training school, teaching their students in self-defense. One day, Billy's girlfriend, Marian, is kidnapped off the street by the \"Black Warriors\", a savage street gang led by a man named Willy. The Black Warriors demand the Lee brothers disclose their martial arts secrets in exchange for Marian's freedom. The Lee brothers set out on a rescue mission to crush the Black Warriors and save Marian.</p><p>Using whatever techniques they have at their disposal, from the basic punches and kicks to the invulnerable elbow strike, as well any weapon that comes into their hands, the Lee brothers must pursue the gang through the city slum, industrial area and the forest before reaching their hideout to confront the big boss, Willy.</p><p>The NES version of this game also has an additional VS. fighting mode for one or two players. Players choose from a field of six different characters (Billy and 5 of the enemy characters) and enter into a one-on-one fighting match. Players have to punch, kick, jumpkick, and even use a weapon against their opponents until someone's health bar is fully drained. The winner is the last one standing.</p>"},{"name":"Double Dragon II: The Revenge","year":1989,"developer":"Technos Japan Corp.","url":":Double Dragon II - The Revenge (Europe)","filesize":148458,"score":7.9,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler","desc":"<p>Billy and Jimmy Lee, the Double Dragons, are back to avenge the loss of Marion. In their quest to defeat the evil Shadow Warriors, Billy and Jimmy must complete nine missions, facing deadly street gangs, ninjas and huge mutant fighters. The duo must traverse through construction sites, alleyways and underwater hideouts complete with secret elevator shafts, spiked ceilings and razor-sharp mechanical claws. Can Billy and Jimmy contend with the enemies placed before them and ultimately save the world?</p>"},{"name":"Double Dragon III: The Sacred Stones","year":1991,"developer":"Technos Japan Corp.","url":":Double Dragon III - The Sacred Stones (Europe)","filesize":151029,"score":6.5,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler","desc":"<p>A year after the events of Double Dragon II: The Revenge, the Supreme Black Shadow Sensei and his Black Shadow Warriors lay defeated. Life has returned to normality for Billy Lee who is now running a dojo training students in the field of martial arts. However, one day when Billy is away, the dojo is attacked and Marion is kidnapped. A soothsayer named Hiruko has information on Marion's disappearance: She claims the kidnappers will release Marion in exchange for the three sacred stones of power. Hiruko knows the locations of the stones, but they are located all over the earth.</p><p>Billy Lee (and his brother Jimmy in the two player game) will have to travel the globe in five missions stretching from the U.S.A., China, Japan, Italy, and finally to Egypt fighting bad guys in this side-scrolling beat-'em-up. Along the way they'll pick up two more allies named Chin and Ranzou. Players can switch between these four characters as each character has their own life bar and primary weapon (Billy, Jimmy, and Chin use their bare hands while Ranzou uses a sword) and a limited supply secondary weapon (Billy and Jimmy use nunchaku, Chin uses iron claws, and Ranzou uses shurikens). Each character also has basic maneuvers. Billy and Jimmy can use punches, side kicks, cyclone spin kicks, mid-air somersaults, and flying jump kicks to dispatch foes, with Chin and Ranzou having equivalent maneuvers to finish off enemies also. Characters can also pick up weapons like army knives, broken bottles, and sais off the ground and use them to fight with.</p><p>While featuring some similarities, Double Dragon 3: The Rosetta Stone features a different story, gameplay, enemies, and level design layouts then this version of the game.</p>"},{"name":"Double Dribble","year":1987,"developer":"Konami Industry Co. Ltd.","url":":Double Dribble","filesize":85449,"score":6.7,"genres":"Action > Sports > Basketball","desc":"<p><em>Double Dribble</em> is a basketball action game for one or two players. You can select different time limits for games, select teams, and begin playing! Gameplay is entirely action, so no time needs to be spent customizing the teams or with statistics. You control each player on the team one at a time (the player with or about to receive the ball will be human controlled, with the computer taking over the other players temporarily.) Some versions feature a small amount of digitized sound effects, and close ups of slam dunks.</p>"},{"name":"Double Moon Densetsu","year":1992,"developer":"Dennou Kenkyusho"},{"name":"Double Strike","year":1990,"developer":"Sachen","url":":Double Strike - Aerial Attack Force (USA) (v1.1) (Unl)","filesize":31889,"score":"","genres":"Action > Side view > Arcade > Shooter","desc":"<p>The South Pacific contains some of the most beautiful islands in the world, and they have all been invaded by a terrorist organization called DAMED (Destructive Armed Militant Enemy Devotee). You must fly an experimental fighter jet called the Thrasher Hawk-7 to battle the enemy and rid them from nine different islands. To help out, six different power ups can be collected after destroying certain enemies which provide better weapons, bombs, or extra lives.</p>"},{"name":"Dough Boy","year":1985,"developer":"Synapse Software Corporation"},{"name":"Downtown Nekketsu Kōshinkyoku: Soreyuke Daiundōkai","year":1990,"developer":"Technos Japan Corp."},{"name":"Downtown Special: Kunio-kun no Jidaigeki da yo - Zenin Shūgō!","year":1991,"developer":"Technos Japan Corp."},{"name":"Dr. Chaos","year":1987,"developer":"Marionette Co., Ltd.","url":":Dr. Chaos (USA)","filesize":52308,"score":5.1,"genres":"Action > 1st-person > Platform > Sci-fi / futuristic > Horror","desc":"<p>Dr. Chaos was your typical mad scientist. He owned an extensive mansion and spent his time experimenting within it on things that mankind was never meant to know. His latest invention is an Interdimensional Warpgate which allows access to worlds beyond our own. As the doctor's younger brother, Michael, you arrive at Dr.Chaos' mansion one day to find the place crawling with strange mutant creatures. To make matters worse, the mansion itself isn't looking too good. Strange \"holes\" into other dimensions have opened up and made a mess of the architecture. Furthermore, Dr.Chaos himself is missing.</p><p>The game takes place as a platform game where you must use various weapons (knife, pistol, machine pistol or grenade) to fight your way past mutants and into various rooms of the mansion. Once in these rooms, the view changes to a first person maze...  and you'll need to open various cabinets, doors and hit walls in special places to find access into a dimensional hole. Once you enter the dimensional hole, the game once again becomes a platform game, where you will need to fight your way to the end of the level and defeat a boss monster of some sort to obtain a piece of the Warpgate. Then you'll have to proceed BACK through the level and return to the mansion, where you'll explore to find the next dimensional hole.</p>"},{"name":"Dr. Jekyll and Mr. Hyde","year":1988,"developer":"Advance Communication Company","url":":Dr. Jekyll and Mr. Hyde (USA)","filesize":75063,"score":3.5,"genres":"Action > Side view > 2D scrolling > Licensed > Regional differences","desc":"<p><em>Dr. Jekyll and Mr. Hyde</em> is based on the Robert Louis Stevenson novella \"Strange Case of Dr. Jekyll and Mr. Hyde\", which follows a respected doctor who develops a serum that transforms him into the embodiment of his darkest thought and desires. He becomes a slave to his alter ego and is ultimately destroyed by it. </p><p>In the game, Jekyll must make his way from his home to the church where he is to marry his sweetheart Miss Millicent. He's got to keep his life bar and \"Jekyll to Hyde\" meter in check, or he'll find himself changed into the nefarious Mr. Hyde. If this happens, Hyde must then defeat enough baddies to raise the meter back up and allow the good doctor to continue his quest.</p>"},{"name":"Dr. Mario","year":1990,"developer":"Nintendo R&D1","url":":Dr. Mario (Europe)","filesize":29907,"score":7.5,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Falling block puzzle > Tile matching puzzle > Direct control > Healthcare","desc":"<p>In this Tetris-style game, you play as Dr. Mario, who must drop differently coloured pills onto viruses to remove them from the bottle. Each pill is split into two, with each side being of one of three different colours, red, blue or yellow. Align three pills of the same colour to a virus of the corresponding colour (or any combination of pills and viruses totaling four or more) and it will be removed from the bottle, along with the aligned pills. The level is cleared when there are no viruses left, and the game is over when the pills reach the top and Dr. Mario can't drop any more pills.</p><p>Included in the game is the normal mode, a time trial, and a two player battle mode to see who can remove the most viruses.</p>"},{"name":"Dragon Ball 3: Gokūden","year":1989,"developer":"Tose Co., Ltd."},{"name":"Dragon Ball Z Gaiden: Saiyajin Zetsumetsu Keikaku","year":1993,"developer":"Tose Co., Ltd."},{"name":"Dragon Ball Z II: Gekigami Freezer","year":1991,"developer":"Tose Co., Ltd."},{"name":"Dragon Ball Z III: Ressen Jinzō Ningen","year":1992,"developer":"Tose Co., Ltd."},{"name":"Dragon Ball Z: Kyōshū! Saiyajin","year":1990,"developer":"Tose Co., Ltd."},{"name":"Dragon Ball: Daimaō Fukkatsu","year":1988,"developer":"Tose Co., Ltd."},{"name":"Dragon Buster","year":1987,"developer":"Namco Limited"},{"name":"Dragon Buster II: Yami no Fuin","year":1989,"developer":"Tose Co., Ltd.","url":":Dragon Buster II - Yami no Fuuin (Japan)","filesize":104167,"score":"","genres":"Action > Top-down > Fantasy","desc":"<p>The sequel to Dragon Buster has the following background story: the young archer Carl has to retrieve an ancient artifact in order to liberate the world from the domination of demons and dragons. </p><p>Unlike the first game, the player character is not restricted to a platform here, but can move freely in any direction. Carl moves through maze-like dungeons, finds keys, and then gets to the exit. After that, the dungeon disappears and makes it possible for the player to advance to the next one. Carl fights enemies with a bow; there is a limited supply of arrows, but it is possible to find quivers among other items in the dungeons.</p>"},{"name":"Dragon Fighter","year":1990,"developer":"Natsume Co., Ltd.","url":":Dragon Fighter (USA)","filesize":103430,"score":7.1,"genres":"Action > Side view > Platform > Shooter > Fantasy","desc":"<p>In <em>Dragon Fighter</em> the protagonist is a fighter who can turn into a dragon. In this side-scrolling action game the hero can walk, jump, and slash with his sword. He can also charge his sword to fire a magical projectile. The real power-up, however, is that he can transform into a flying dragon. When this happens, the game turns into a shmup-style game in which the scrolling moves at a constant rate and the dragon can shoot fireballs in a spread formation. Transforming into a dragon is restricted by a power meter.</p><p>The game features six levels of action-- a snow level, a cave level, a water level, an industrial level, and a haunted castle level. The sixth and final level is fought entirely as a dragon with unlimited flight capability.</p>"},{"name":"Dragon Power","year":1986,"developer":"Tose Co., Ltd.","url":":Dragon Power (USA)","filesize":99320,"score":6.1,"genres":"Action > Diagonal-down > Side view > 2D scrolling > Platform > Licensed > Regional differences","desc":"<p>Goku and Nora (Bulma) are on a quest to find seven crystal balls. By finding all of these crystal balls, the Dragon Emperor will grant them one wish. It won't be easy though, there are rumors of a mysterious army that is also looking for them.</p><p>Dragon Power is a game based on the Dragon Ball anime in japan (though a lot of it is lost in translation). Goku can jump, attack or release a powerful wind wave to stop his enemies. Much of the game is an overhead view, though occasionally Goku will have to fight in a side view. Different power ups will increase his powers and techniques, letting stronger abilities flourish.</p>"},{"name":"Dragon Spirit: The New Legend","year":1989,"developer":"Namco Limited","url":":Dragon Spirit - The New Legend","filesize":144589,"score":7.2,"genres":"Action > Top-down > 2D scrolling > Shooter > Fantasy","desc":"<p>Princess Alicia of the kingdom of Mitgult is kidnapped by the monster Zawell. It's now up to the heroic warrior Amul to transform himself into a blue dragon and go and rescue the princess.</p><p><em>Dragon Spirit</em> is a vertically scrolling shoot-em-up which consists of nine stages. Players fly around and destroy everything in their path. Much like in Xevious, action takes place on two planes, both in the sky (where the dragon is flying) and on the ground. The dragon has two different kind of attacks: fire that shoots up the screen, and fire that drops to hit a place on the ground in front of the dragon. Enemies exist both in the air and on the ground, and some can fly up from the ground to the sky.</p><p>Players can pick up power-ups, or upgrades, that will help them in their fight. Upgrades can include extra heads on the dragon, health, faster shots, and more. At the end of each stage is a boss that needs to be defeated. Having good upgrades that are not lost from being hit before reaching the bosses will help.</p><p>The NES version is unique in that it presents a somewhat altered story and an additional gameplay mode. Technically, it is a sort of sequel, with \"A New Legend\" being its subtitle. In this version, Zawell is already defeated and King Amul and his now wife Queen Alicia, have two children named Iris (a princess) and Lace (a prince). A new evil named Galda has decided to attack the Earth. Galda also has taken Iris captive and now Lace must go rescue her. </p><p>The NES version also adds a new initial stage. If the player survives it, the game continues in a \"Blue Dragon\" game much like the original arcade game. If the player fails to clear this initial stage in one life, an easy mode called \"Gold Dragon\" begins, skipping about half the game's stages, giving the player extra hit points, and features a different ending.</p><p>Also of note, the TurboGrafx-16 version's seventh and eighth stage are different than the other versions. The underwater and dark themed stages were changed to castle interior themed stages.</p>"},{"name":"Dragon Warrior","year":1986,"developer":"Chunsoft Co., Ltd.","url":":Dragon Warrior (USA)","filesize":51641,"score":6.4,"genres":"Role-playing (RPG) > 1st-person > Top-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>Once upon a time, the Balls of Light illuminated the kingdom of Alefgard, keeping its winters short and sustaining its peace. However, a man who could tame dragons and hence known as a Dragonlord, became corrupted by his magical studies. He attacked the Tantegel Castle and stole the Balls of Light, causing monsters to roam the land. A valiant hero named Erdrick, who had obtained the Balls of Light for the kingdom in the first place, attempted to defeat the Dragonlord and disappeared without trace. Many years later, during the reign of King Lorik XVI, the Dragonlord abducted Princess Gwaelin, carrying her to Castle Charlock. One day, a knight appears in front of the king, claiming to the be the descendant of Erdrick. He is entrusted with the mission to vanquish the Dragonlord, as the prophet Mahetta has predicted. </p><p>Though not the first role-playing game developed by a Japanese company, <em>Dragon Warrior</em> is considered one of the progenitors of the Japanese RPG genre, and the first to appear on a home console. The player navigates a lone pre-made protagonist on a top-down overworld, accessing locations represented by icons, similarly to early Ultima games. As opposed to most other RPGs of the time, dungeons are viewed from an overhead perspective as well. In cities and palaces it is possible to talk to people, rest in inns and buy weapons, armor and items in shops.</p><p>When wandering around in the wilderness or through dungeons, the player character encounters randomly appearing enemies. Combat is turn-based, with the player selecting menu options while fighting. It is possible to attack with the equipped weapon, cast one of the few available spells (using up some of the magic energy), use an item, or try to run. All the battles in the game are exclusively one-on-one. Killing monsters yields experience, and the player character's attributes improve automatically when he levels up.</p><p>With the exception of the final location, the entire game world is theoretically open for exploration from the beginning. However, the enemies become increasingly tough as the player character attempts to move away from the starting town, effectively limiting him to confined areas determined by his level. The hero has limited hit points, loses them when attacked by enemies, and dies when he runs out of them, at which point he is automatically restored in a nearby town. It is possible to save the game only by talking to the king in the initial castle.</p>"},{"name":"Dragon Warrior II","year":1987,"developer":"Chunsoft Co., Ltd.","url":":Dragon Warrior II (USA)","filesize":127794,"score":6.4,"genres":"Role-playing (RPG) > Top-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Regional differences","desc":"<p><em>Dragon Warrior II</em> is an early top-down RPG that expands and improves on its predecessor, Dragon Warrior. Taking the role of a descendant of Erdrick, the player once again ventures forth in an effort to save the world.</p><p>Unlike the first game, <em>Dragon Warrior II</em> allows the player to join forces with two other characters, a magic-using princess and a wizard-warrior prince. Also including expanded monster battles involving up to 6 creatures and a much larger world, <em>Dragon Warrior II</em> is an important step in the evolution of the Dragon Warrior series.</p>"},{"name":"Dragon Warrior III","year":1988,"developer":"Chunsoft Co., Ltd.","url":":Dragon Warrior III (USA)","filesize":252690,"score":7.2,"genres":"Role-playing (RPG) > Top-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Regional differences","desc":"<p><em>Dragon Warrior III</em> is the concluding game of the first Dragon Quest/Dragon Warrior trilogy, and its story takes us back to the time period of the legendary Erdrick (also known as Loto), the ancestor of the first game's hero. You are the son of a powerful warrior Ortega, skillful in physical combat and spellcasting. Your father went out to fight the evil Baramos, who is responsible for the appearance of monsters in your region, and never returned. You are sent by the king on a quest to continue your father's brave deeds and to defeat Baramos.</p><p><em>Dragon Warrior III</em> is a top-down role-playing game where you travel around the overworld, caves, castles, cities and other locations while battling random encounters, buying equipment, and talking to people. You and your party members receive experience when they beat up monsters and level up with enough experience, increasing their stats. The game features a day/night cycle - as you travel, day slowly changes to night and vice versa; shops are typically closed at night. </p><p>You begin with control of just the main character but can quickly recruit three more members to your party. During the game you can choose to drop your current characters and recruit others at any time. The recruitable characters are divided into six classes: soldier, fighter, merchant, goof-off, pilgrim and wizard.</p><p>The game has a unique job system, giving you the ability to switch your hired characters' classes after they have achieved at least level 20 in their base class. Characters can switch to the other beginning classes, as well as the sage class, which is not available at the beginning. When a character switches classes, they lose all earned experience points, and half of their stats, but retain all of the abilities of the previous class. In this way, you can create powerful combination characters that are able to cast spells and fight effectively.</p>"},{"name":"Dragon Warrior IV","year":1990,"developer":"Chunsoft Co., Ltd.","url":":Dragon Warrior IV (USA)","filesize":405085,"score":7.6,"genres":"Role-playing (RPG) > Top-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Regional differences","desc":"<p><em>Dragon Warrior IV</em> is the fourth game in the <em>Dragon Quest</em> series. The game utilizes a chapter system, where each chapter is dedicated to the personal stories of one or several main characters. The first four chapters tell the stories of the soldier Ragnar (Ryan in the original Japanese version), who sets off to investigate the disappearance of children in a nearby village; Alena, the princess of Santeem Kingdom, who dreams to become a martial artist; Cristo and Brei (Klift and Burai), a priest from the Santeem Castle and a magician who watched over the princess when she was younger; the weapon dealer Taloon (Torneko), who wants to become the best in business; and the two sisters Mara and Nara (Minea and Manya), who search for the person who murdered their father. In the fifth (and by far the longest) chapter, the Hero (or the Heroine) of the game finally appears on the stage to tie all the loose ends together and lead the party to the ultimate battle against their adversary.</p><p>The rest of the game is played fairly similarly to the previous installments of the series. The party roams the top-down world in a relatively non-linear fashion, though certain events must be triggered in order to advance the story and access some of the important areas. A ship and a balloon are among the transportation methods that the heroes acquire over the course of the game. Randomly appearing enemies must be dispatched in turn-based combat, using familiar attacks and spells common to the entire series. Characters deal more or less damage depending on their position in the party lineup. They can also be swapped during battles. With the exception of the current main protagonist, the characters in the party are controlled by the AI; the player is only able to assign general tactics to them.</p>"},{"name":"Dragon Wars","year":1991,"developer":"Interplay Productions, Inc."},{"name":"Dragon's Lair","year":1990,"developer":"Motivetime Ltd.","url":":Dragon's Lair","filesize":74186,"score":4.5,"genres":"Action > Side view > 2D scrolling > Fantasy > Licensed","desc":"<p>The NES version for <em>Dragon's Lair</em> brings Dirk the Daring in a side-scrolling game, different from the interactive movie gameplay common to the other games under the same license.</p><p>Once again, Dirk is up to rescue Princess Daphne from the evil dragon Singe. To do so, Dirk will throw weapons such as knives, axes, or fire balls at various enemies, including dragons, bats, snakes, the Lizard King (who will steal gold from him), etc. He will also do a lot of jumping and ducking to avoid threats along his way, such as falling bridges, presses, spikes and holes on the floor. To complete a stage, all he has to do is to get to the end of it alive.</p><p>At the end of some stages, Dirk will take an elevator that will lead him to other stages. The elevator makes short stops at some platforms, and you have to decide if Dirk will jump onto that platform or another. If he takes the wrong platform, he may go back to a previous stage and go through it all over again. From the elevator, Dirk can also get to a bonus level, the Lizard King's throne room, where he can try to recover the gold the King has stolen from him.</p><p>Although Dirk has a life bar, he will instantly die when taking damage from most of the threats. He also has a \"candle bar\", which is used (by pressing the start button) to light up dark places and to discover hidden items at specific locations.</p><p>The game can be played by two players taking turns. The PAL version has faster gameplay, additional enemies (including level bosses), death animations and splash screens in between the levels.</p>"},{"name":"Dream Master","year":1992,"developer":"Birthday"},{"name":"Dreamworld Pogie","year":2016,"developer":"Team Yolkfolk"},{"name":"Dropzone","year":1992,"developer":"Arena Graphics"},{"name":"Druid","year":1988,"developer":""},{"name":"Duck Hunt","year":1984,"developer":"Nintendo R&D1","url":":Duck Hunt (World)","filesize":16550,"score":6.5,"genres":"Action > Sports > 1st-person > Arcade > Hunting > Shooter","desc":"<p><em>Duck Hunt</em> is a shooting simulation where the player goes out with his faithful dogs to hunt ducks. It requires the use of the Zapper light gun. In game modes A and B, players view a swampland from a first-person perspective. The dog scares the ducks out of the swamp, one at a time in mode A or two at a time in mode B. The ducks go flying around in the air and the player has three shots and a limited amount of time to shoot the ducks before they fly away. Each round only allows a limited number of misses in order to move on successfully. As the rounds progress, the ducks begin flying faster and faster, and fewer misses are allowed. In game mode A, a second player can control the movement of the duck using a controller plugged into port 2.</p><p>Mode C features target practice on clay pigeons rather than ducks. The perspective and rules here are the same, with only three shots to destroy two clay pigeons before they disappear off the horizon. Destroy enough clay pigeons to move on to the next, tougher round.</p>"},{"name":"Dudes with Attitude","year":1990,"developer":"","url":":Dudes with Attitude (USA) (Unl)","filesize":32666,"score":"","genres":"Action > Puzzle > Top-down > Fixed / flip-screen","desc":"<p>The dudes with attitudes are on a mission to uncover buried jewels on Caribbean islands. These dudes being referred to are emoticon looking characters who go by the names of Dude, Happy, Patch, Bozo, Babe and Foxy. In this puzzle game, you control one of the dudes as they bounce back and forth across the screen trying to acquire the jewels on the playfield. The one caveat is that your dude has to match the color of the jewel he or she is trying to collect. To become the correct color to snatch up the jewels, you have to bounce across a paint can (an attitude converter) that will change your dude to that of the same color as the paint can. The object in each puzzle is to retrieve all the treasures in a room without their character falling prey to the various enemies in rooms or running out of time. This is an unlicensed game.</p>"},{"name":"Dungeon Kid","year":1990,"developer":"Pixel"},{"name":"Dungeon Magic: Sword of the Elements","year":1989,"developer":"Natsume Co., Ltd.","url":":Dungeon & Magic - Swords of Element (Japan)","filesize":126489,"score":"","genres":"Action > Role-playing (RPG) > 1st-person > Fantasy","desc":"<p>The evil sorcerer Darces took over our world once again. The only way to defeat him is to find five elemental swords and to combine them into the ultimate weapon which is the only possibility to destroy the villain. Naturally, you, the nameless hero, are the one who is chosen to go on this dangerous journey. </p><p><em>Dungeon Magic</em> is a first-person role-playing game similar to <em>Dungeon Master</em> and <em>Might &amp; Magic</em>. As in the former, instead of the usual turn-based combat you fight your enemies in real time, parrying to avoid their blows and attacking physically or casting offensive magic to hurt them. As in the latter, you explore large outdoor areas, towns, and dungeons. </p><p>You will specialize in five kinds of magic, but casting spells reduces your health points. Hence, exploration and defensive spells are more important than direct attack magic.</p>"},{"name":"Dusty Diamond's All-Star Softball","year":1989,"developer":"Tose Co., Ltd.","url":":Dusty Diamond's All-Star Softball (USA)","filesize":121687,"score":7.2,"genres":"Sports > Baseball > Regional differences","desc":"<p>All weekend ballplayers know softball's no joke, but that doesn't mean you can't have a little fun with it. And when you step up to the plate in this cart you'll find the wackiest bunch of players to ever hit a softball diamond!</p><p>Play seven inning fast or slow-pitch games. In One Player mode, you face the computer in a five-game elimination tournament. Win them all, and you earn the right to challenge the awesome Amazons - All-Star Softball's all-time championship team. Of course, you and a friend can play each other in a head-to-head contest.</p><p>There are no preset ball clubs so you recruit 10-member squad from a roster of 60 weird players. Look for players who have strong basic baseball skills such as arm strength and speed. But to win on some of the tricky fields you'll also need players with more unusual skills - such as climbing fences, diving into water, and flying at night</p><p>In fast pitch, you hurl that baby in three speeds. But stay alert, base runners steal and batters bunt. In slow pitch, you can lob the ball short or long. You can also make your pitches curve right or left.Fielding the ball takes practice, but your guys can also dive for hard grounders and leap up to snare line shots. For quick double plays, infielders can tag a base then throw the ball.</p><p>With six softball fields to choose from, including the Sandlot, the Cliff, and a Professional field, there's some great action. Get ready to take yourself out to the softball park.</p>"},{"name":"Dynamite Bowl","year":1987,"developer":"Softvision Co., Ltd.","url":":Dynamite Bowl (Japan) (Rev A)","filesize":26970,"score":"","genres":"Sports > 1st-person > Behind view > Fixed / flip-screen > Arcade > Bowling","desc":"<p><em>Dynamite Bowl</em> is a bowling game simulation based on the real bowling sport and can be played up to five players at one of the thirty lanes.The game has two difficulty levels.Game variables that can be controlled are: your position at the lane, set the strength of the throw and control the loft and curve of the bowling ball.</p>"},{"name":"Dynowarz: Destruction of Spondylus","year":1990,"developer":"Advance Communication Company","url":":Dynowarz - Destruction of Spondylus (USA)","filesize":79458,"score":5.5,"genres":"Action > Side view > Platform > Sci-fi / futuristic","desc":"<p>This is a game of combat between giant mechanized dinosaurs named robosaurs in a faraway solar system named Spondylus. Mad robosaurs have overrun the planets of this man-made solar system and it is up to Professor Proteus to take the controls of the #1 robosaur, the Cyborasaurus. The goal is to get to the center of all 7 planets in this solar system and disable the artificially intelligent life support systems, which are guarded by progressively tougher defense.</p><p>Gameplay consists of getting into your robosaur, tromping across the surface of desolate planets in the solar system, fighting meaner robosaurs, and equipping better weapons along the way (you can launch your dino's fist!). Once you make it to the middle of each planet, you eject from the Cyborasaurus and head to the life support computer. Destroy the computer and get out fast.</p>"}]