[{"name":"EarthBound Beginnings","year":1989,"developer":"Ape"},{"name":"Eggerland 2","year":1987,"developer":"HAL Laboratory, Inc."},{"name":"Eggerland: Meikyū no Fukkatsu","year":1988,"developer":"HAL Laboratory, Inc."},{"name":"Eggerland: Sōzō e no Tabidachi","year":1988,"developer":"HAL Laboratory, Inc."},{"name":"Egypt","year":1991,"developer":"Human Creative Products"},{"name":"Electrician","year":1986,"developer":"Synapse Software Corporation"},{"name":"Elevator Action","year":1985,"developer":"Taito Corporation","url":":Elevator Action (USA)","filesize":22279,"score":6,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Stealth > Direct control > Spy / espionage","desc":"<p>You are Agent 17 (codename: \"Otto\"). Your mission is to secure all top secret documents from a security building and escape in the getaway car, located in the basement of the building.</p><p>Enemies spies are scattered throughout the 30-floor building and they have only one mission: execute Agent 17 at all costs. There are several ways in which Agent 17 can kill them:* Shooting them with his gun.</p><ul><li>Kicking them by jumping onto them.</li><li>Shooting a light on the ceiling while in an elevator, dropping the light onto one of them.</li><li>Crushing them with an elevator.</li></ul><p>Whenever a light has been dropped, the hallways will be dark for a short period of time, making the enemy spies harder to see. The same holds true for hallways that are already dark.</p><p>While Otto is in an elevator, he will have complete control of it by moving up or down. Agent 17 can still get killed if he's already in an elevator if a bullet's trajectory is aimed at it.. When Otto is not in an elevator, it will move from floor to floor automatically, even when enemy spies are in it. Otto is able to leap over the elevator gaps, but he must be as close to the edge as possible without falling off in order to make the jump safely. If there is an elevator cable in the way, however, it will block him, causing him to fall. </p><p>Just because the game is called <em>Elevator Action</em> doesn't mean that elevators are the only means of travel. There are also escalators which you can ride up or down, useful if you want to avoid gunfire and don't have time to jump.</p><p>Otto must go into the rooms with red doors to collect the top secret documents. If he tries to get to his car without getting all the documents, he cannot escape and must go back and collect the remaining documents. Once he has all the documents and drives away, he then proceeds to the next building.</p><p>If Otto takes too much time to collect the documents, the alarm will go off, and he will have trouble controlling the elevators, which will take time to react. Bad guys will be especially aggressive. The alarm doesn't go off when Otto loses a life, it only resets after finishing a building. Besides ducking, bad guys may also drop themselves and lay flat on the floor. It's virtually impossible for Otto to shoot bad guys when they do this. Also, Otto cannot duck when in an elevator.</p>"},{"name":"Eliminator Boat Duel","year":1991,"developer":"Radioactive Software","url":":Eliminator Boat Duel (USA)","filesize":126481,"score":7.2,"genres":"Action > Racing / Driving > Behind view > Diagonal-down > Side view > 2D scrolling > Naval / watercraft","desc":"<p>Eliminator Boat Duel is a ruthless one on one boat racing game that can either be played against the computer or a human opponent. The races take place in such settings as open water, the bayou, and even industrial water districts. Each boat race consists of several sections. First, there is the starting line -- where you can expect a $2000 fine for a false start -- which begins with a brief side-scrolling race with split-screen background scrolling, a common characteristic of later NES titles. The primary sections of the races are a mixture of top-down racing and 3rd-person racing from a perspective behind the boats. The top-down sections are the most involved with numerous threats to avoid such as alligators, sharks, and whirlpools that will turn you the wrong way. There are also ramps to jump off of, people in need of rescue, nitro speed boost powerups, and raw cash bonuses to collect. The 3rd person segments have less detail and distraction but move much quicker as the 2 players vie to stay within the flags, collect speed boosts, and hit the occasional ramp. Speed boosts are collected along the way and can be used at the player's discretion to gain a much-needed edge at any point during the race.</p><p>A race finishes back in the side-scrolling view. If the boats come through too close together, the bikini models on the sidelines act confused and request a slo-mo replay, which the game subsequently provides. Prize money is then awarded with which the players may use to repair and upgrade their boats with faster engines, tougher hulls, and better steering.</p>"},{"name":"Elite","year":1991,"developer":""},{"name":"Empire City: 1931","year":1987,"developer":"Seibu Kaihatsu Inc."},{"name":"Erika to Satoru no Yume Bōken","year":1988,"developer":"Atlus Co., Ltd."},{"name":"Erunaaku No Zaihou","year":1987,"developer":"Towa Chiki"},{"name":"Eskimo Bob: Starring Alfonzo","year":2017,"developer":"Spoony Bard Productions"},{"name":"Esper Dream","year":1987,"developer":"Konami Industry Co. Ltd."},{"name":"Esper Dream 2: Arata naru Tatakai","year":1992,"developer":"Konami Co., Ltd."},{"name":"Espitene","year":2018,"developer":"The Mojon Twins"},{"name":"Espitenen und Herr Pimponen","year":2019,"developer":"The Mojon Twins"},{"name":"Excitebike","year":1984,"developer":"Nintendo R&D1","url":":Excitebike (Japan, USA)","filesize":17985,"score":7,"genres":"Racing / Driving > Sports > Side view > 2D scrolling > Tricks / stunts > Motorcycle","desc":"<p>Race by yourself against the clock or compete with other motocross riders on 5 tracks full of long straights, large jumps and obstacles to win the Excitebike championship.</p><p>Create your own tracks by placing jumps and obstacles of all different sizes and shapes on the track and choosing how many laps each race will have, then race against the clock or other riders to see how your track fares in competition.</p>"},{"name":"Exciting Billiards","year":1987,"developer":"Konami Industry Co. Ltd."},{"name":"Exciting Soccer: Konami Cup","year":1988,"developer":"Konami Industry Co. Ltd."},{"name":"Exed Exes","year":1985,"developer":"Capcom Co., Ltd."},{"name":"Exerion","year":1985,"developer":"Kawa Denshi Giken K.K."},{"name":"Exodus: Journey to the Promised Land","year":1991,"developer":"Wisdom Tree, Inc.","url":":Exodus","filesize":109051,"score":6.1,"genres":"Action > Educational > Puzzle > Side view > 2D scrolling > Game show / trivia / quiz > Direct control > Religion","desc":"<p>In <em>Exodus</em> you need to guide Moses through 100 different levels in order to reach the promised land. The gameplay features an action/strategy part similar to Boulder Dash, and a question part. In the action part, you need to collect five question marks and enough Manna to open the exit of the maze-like screens. There are a variety of boulders, walls, dirt, and other obstacles in the way. Some obstacles can be destroyed when moses uses his staff to say the word of god, other obstacles can be pushed out of the way, and some you must find a way around. You need to be careful when navigating around the screens, if you cause any boulders to fall and they land on you a life is lost. Also wandering about are a variety of enemies which can be destroyed or avoided, but will cost you one life if you get caught. When you find all the question marks and manna you need, the exit appears and you can move on to the question phase. Here you will be asked five multiple choice questions about the book of Exodus. Answering the questions correctly will reward you with bonuses, such as extra lives.</p>"},{"name":"Exodus: Ultima III","year":1987,"developer":"ORIGIN Systems, Inc.","url":":Exodus - Ultima III (USA)","filesize":109166,"score":7.5,"genres":"Role-playing (RPG) > 1st-person > Top-down > 2D scrolling > Turn-based > Puzzle elements > Fantasy","desc":"<p>After the defeat of the evil wizard Mondain and his mistress Minax in the previous two Ultimas, peace has returned to the land of Sorsaria. Times passes and eventually geological disruptions and a resurgence of the monster populace occur, and it is soon learned that Mondain and Minax had conceived a child named Exodus before their death. Now that child has become an adult with the power to avenge the death of his parents. Obviously, it falls upon the hero from Earth to find and stop him.</p><p>The third title in the Ultima series was the first to feature a party of adventurers instead of a single player character. The party is created at the beginning of the game by assigning various class combinations and determining the characters' attributes. The game has larger and more detailed towns, populated by NPCs the protagonist can converse with to obtain clues. Like in earlier Ultima games, exploration is divided between top-down overworld locations and first-person 3D dungeons. This installment introduces  separate combat screens where player-controlled party fights multiple monsters in a turn-based tile-based system.</p>"}]