[{"name":"F-117A Stealth Fighter","year":1992,"developer":"MicroProse Software, Inc.","url":":F-117A - Stealth Fighter (USA)","filesize":266003,"score":"","genres":"Action > Simulation > 1st-person > Flight / aviation > Vehicular combat > Contemporary > Middle East","desc":"<p><em>F-117A Stealth Fighter</em> is a flight simulator where the player is in the cockpit of the game's eponymous jet fighter. The game revolves around flying solo punitive strike missions against various rogue nations. For example, the first mission has the player launching from a base in Sicily to strike targets in Libya. Watch out for enemy jets, of course. The 8-bit NES's input capabilities are a bit limited so this flight simulator depends on many button combinations in order to carry out various complicated actions.</p>"},{"name":"F-15 City War","year":1990,"developer":"American Video Entertainment Inc.","url":":F15 City War (USA) (v1.1) (Unl)","filesize":36582,"score":"","genres":"Action > Behind view > Top-down > Arcade > Shooter > Flight / aviation","desc":"<p><em>F-15 City War</em> is arcade style action game. You fly an F-15 with unlimited ammunition into battle against tanks, helicopters, gun boats, missile silos, jets, robots, and a large boss at the end of each of five levels. Gameplay alternates between two perspectives, a 3-D view from behind your plane and a top down scrolling view.</p>"},{"name":"F-15 Strike Eagle","year":1992,"developer":"MicroProse Software, Inc.","url":":F-15 Strike Eagle (USA)","filesize":245572,"score":6.6,"genres":"Simulation > 1st-person > Flight / aviation > Vehicular combat > Contemporary","desc":"<p>\"Life for a fighter pilot is that gut-wrenching adrenaline rush you get when going supersonic with heat-seeking missiles hot on your tail, pulling into a hard turn while warning displays light up the cockpit - and as an Air Force Academy grad with over 4,000 hours of military flight, I ought to know! Real pilots know that feeling, and real pilots also know that F-15 Strike Eagle is the only NES game to deliver the authentic dogfighting experience, because F-15 is designed by real pilots, and real military simulation experts. Find out for yourself. Play F-15 Strike Eagle and see what real dogfighting is all about.</p>"},{"name":"F1 Circus","year":1992,"developer":"Nihon Bussan Co., Ltd."},{"name":"F1 Race","year":1984,"developer":"HAL Laboratory, Inc."},{"name":"Fairy Pinball: Yousei-tachi no Pinball","year":1987,"developer":"Hacker International"},{"name":"Falsion","year":1987,"developer":"Konami Industry Co. Ltd."},{"name":"Famicom Grand Prix II: 3D Hot Rally","year":1988,"developer":"Nintendo Co., Ltd."},{"name":"Famicom Grand Prix: F1 Race","year":1987,"developer":"Nintendo Co., Ltd."},{"name":"Famicom Jump II: Saikyō no Shichinin","year":1991,"developer":"Chunsoft Co., Ltd."},{"name":"Famicom Jump: Hero Retsuden","year":1989,"developer":"Tose Co., Ltd."},{"name":"Famicom Mukashibanashi: Shin Onigashima","year":1987,"developer":"Pax Softnica"},{"name":"Famicom Tantei Club Part II: Ushiro ni Tatsu Shōjo","year":1989,"developer":"Nintendo R&D1"},{"name":"Famicom Tantei Club: Kieta Kōkeisha","year":1988,"developer":"Nintendo Co., Ltd."},{"name":"Famicom Wars","year":1988,"developer":"Intelligent Systems Co., Ltd.","url":":Famicom Wars (Japan) (Rev 0B)","filesize":110862,"score":"","genres":"Strategy > Top-down > Turn-based > Turn-based strategy","desc":"<p>The Red Star nation and the Blue Moon nation are at war. Each has deployed troops and works to obtain enough funds so as to buy the necessary military hardware to overcome the other side.</p><p><em>Famicom Wars</em> is a turn-based strategy game. The player takes the role of commander of military forces for either the Red Star or Blue Moon armies. The goal of each battle map is to overcome the other side's forces, destroying all enemy units and capturing all enemy-held landmarks. Each side of the battle takes their turn, moving units across the map. The capture of cities will give that side extra funds which can be used to build new units at factories and shipyards.</p><p><em>Famicom Wars</em> features 17 maps total to battle across.</p>"},{"name":"Family BASIC","year":1984,"developer":"Sharp Corporation"},{"name":"Family Circuit","year":1988,"developer":"GAME STUDIO Inc."},{"name":"Family Circuit '91","year":1991,"developer":"GAME STUDIO Inc."},{"name":"Family Feud","year":1991,"developer":"Beam Software Pty., Ltd.","url":":Family Feud","filesize":100566,"score":5.5,"genres":"Strategy > Game show / trivia / quiz > Licensed","desc":"<p>Based on the television game show, Family Feud. The player chooses a family of five to play against another family. Players are asked to find the most common answers to various questions asked by the host, so the family can earn points. The family with the most points at the end of the game wins the prize money.</p>"},{"name":"Family Jockey","year":1987,"developer":"Namco Limited"},{"name":"Family Picross","year":2019,"developer":"FG Software"},{"name":"Family Tennis","year":1987,"developer":"Namco Limited"},{"name":"Family Trainer: Jogging Race","year":1987,"developer":"Sonata"},{"name":"Fantastic Adventures of Dizzy, The","year":1991,"developer":"The Codemasters Software Company Limited","url":":Fantastic Adventures of Dizzy, The (USA) (Unl)","filesize":173972,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p>The evil wizard Zaks has cast a spell on the peaceful Yolkfolk, and while many fell under his spell, others have other problems to deal with, including Dizzy, who saw his girlfriend Daisy kidnapped and taken hostage by Zaks, and it's up to him to restore the Yolkfolk to normal and rescue Daisy from the top of the Cloud Castle's tower.</p><p>The most technically-advanced of Dizzy's adventure games in many ways, it was the only one to feature actual scrolling rather than a flick-screen system, the only one not to be released for the 8 bit computers the character originated on, the only one to originate on a console, as well as featuring many mini-games, such as <em>Bubble Dizzy</em> and an <em>Operation Wolf</em> clone. </p><p>Gameplay involves walking Dizzy through the levels, picking up objects and using them to solve simple puzzles. There are plenty of tests of arcade skill along the way as well, as gaps must be jumped and baddies avoided - starting with a limited number of lives, the player can earn more by completing Theodore's puzzle. Before rescuing Daisy the player must capture all stars that unlock the gates of the tower.</p><p>This game was later re-released on the NES with an updated Aladdin cart version. Updates include the number of collectible stars have increased from 100 stars to 250 stars, Dizzy now walks at a brisker pace, there are small terrain differences, some item placements have been rearranged, and the inventory system has become more simplified.</p>"},{"name":"Fantasy Zone","year":1987,"developer":"SEGA Enterprises Ltd."},{"name":"Fantasy Zone II","year":1988,"developer":"SEGA Corporation"},{"name":"Faria: A World of Mystery & Danger!","year":1989,"developer":"Game Arts Co., Ltd.","url":":Faria - A World of Mystery & Danger! (USA)","filesize":142382,"score":"","genres":"Action > Role-playing (RPG) > Top-down","desc":"<p>It was a stormy night. Cold wind raged, and rain poured over the country. The wise men understood at once: the prophecy has become reality. The spell of the Legendary Sword was lifted...</p><p>Fast-forward to three months later. You are a nameless young adventurer, looking for some action. Your first task is... you guessed it, to rescue a princess. After the king gives you this assignment, you are free to roam about the world, visiting dangerous caves and towers, and fulfilling ancient prophecies..</p><p><em>Faria</em> is a combination of Japanese-style RPG exploration and character development (like in Final Fantasy or Dragon Quest) with action-based combat. On the world map, you are randomly attacked by enemies, and have to eliminate them running around the battle field and attacking them physically or casting spells. In the complex, maze-like towers the enemies appear everywhere. There is also a good deal of puzzles to solve in the dungeons.</p>"},{"name":"Faxanadu","year":1987,"developer":"Hudson Soft Company, Ltd.","url":":Faxanadu (Europe)","filesize":139976,"score":7.6,"genres":"Action > Role-playing (RPG) > Side view > 2D scrolling > Metroidvania > Platform > Fantasy > Licensed > Regional differences","desc":"<p><em>Faxanadu</em> is a 2D platformer with elements of role-playing in addition to side-scrolling action.</p><p>The story is a classic one of good versus evil. Disaster strikes the once peaceful Elven town of Eolis. The sky rains meteorites upon the World Tree. Wild animals and evil monsters terrorize the citizens. The water supply from the wells is dwindling, plants are withering, and people are dying. A lone warrior returns to Eolis and is asked by the king to find out the source of the disasters, and put an end to an unexpected outbreak of hostility from the Dwarves.</p><p>There are many places the hero must visit during his quest including medieval-style towns and country villages, fortresses, caves, and gloomy bogs - each with its own ambiance and musical score. The protagonist will be talking with the villagers, collecting gold to buy weapons, armor and other objects, jumping over obstacles and using items. The hero can attack zombies, dwarves, giant snakes, wyverns, evil gnomes, or one-eyed one-footed monsters with various swords and daggers or zap them with a magic spell.</p><p>As areas are completed by defeating enemies, the player character gathers experience and achieves a new rank, which is tied directly to the restore password (called a \"mantra\" in the game). The higher this rank is, the more gold the player character starts with when respawning after being killed or restoring a saved game. Saving a game can only be done in a shrine or temple with a guru. This is also where the protagonist is transported when the game is restored or when he dies.</p>"},{"name":"FC-Portable Super (included games)","year":2012,"developer":""},{"name":"Felix the Cat","year":1992,"developer":"Hudson Soft Company, Ltd."},{"name":"Fengshenbang","year":1995,"developer":"Computer & Entertainment Inc."},{"name":"Ferrari Grand Prix Challenge","year":1992,"developer":"System 3 Software Limited","url":":Ferrari Grand Prix Challenge (USA)","filesize":127062,"score":6,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>The player takes the role of a Ferrari team driver who's objective is to become an F1 Champion during the standard 16 round season. The player competes against 25 computer opponents representing different F1 teams. Every round consists of a qualification race (1 lap) and a main race (5 laps). The qualification race determines where the players vehicle will be placed at the beginning of the main race. The player is rewarded points which determine their standings at the end of a main race with more points being given for the higher position finished in the race. Also during a race, the player can make a pit stop to change their worn down tires and to refuel, which involves playing a minigame. There is also a practice mode, where the player can choose the number of practice laps they wish to practice.</p>"},{"name":"Fester's Quest","year":1989,"developer":"Sun Electronics Corp.","url":":Fester's Quest (USA)","filesize":106468,"score":6.1,"genres":"Action > Top-down > Shooter > Licensed","desc":"<p>Uncle Fester was out one night, moonbathing in the yard of the Addams Family property one day when suddenly, out of the sky, a UFO descended and started beaming alien creatures to the planet. Grabbing his gun, Fester sets off to stop the aliens and slay their boss creatures, encountering other Addams Family members along the way who will aid him.</p><p><em>Fester's Quest</em> is an overhead-view game in which Uncle Fester uses his gun, or later, a whip to attack enemies near him. Enemies drop money and power-ups. The money can be used at Hot Dog stands to replenish health. A variety of items can be collected, each with a different effect. Fester and the rest of the Addams family are based on their characters from the popular 1960s TV show (this game was made before the remakes in both series and movie form).</p>"},{"name":"Field Combat","year":1985,"developer":"Jaleco Ltd."},{"name":"Fighting Road","year":1988,"developer":"Toei Animation Co., Ltd."},{"name":"Final Fantasy","year":1987,"developer":"Square Co., Ltd.","url":":Final Fantasy","filesize":147404,"score":7.4,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Regional differences","desc":"<p>The world is veiled in darkness. Winds don't blow, the seas are stormy, and the earth rots. All people can hope for is that the ancient prophecy will be finally fulfilled. \"When the world is veiled in darkness, four warriors will come...\" And indeed, they come - the four characters you have previously chosen. Their first quest is to free a princess from the evil knight Garland, and then the real journey begins.</p><p><em>Final Fantasy</em> is played with an adventuring party rather than with a single character. Before the game starts, the player chooses four characters from six different classes: Fighter, Thief, Black Belt, White Mage, Red Mage, and Black Mage. He also gives the characters names. </p><p>In the game, the party walks around in a top-down world, visits cities, caves, palaces and other places to buy equipment, rest and get hints and new quests, and fights baddies when they are encountered. <em>Final Fantasy</em> uses a turn-based combat system. In battle, the player gives each character in order a command (attack a particular enemy, cast a spell, use an item, or try to run). Then the characters and the enemies act in a random order. Attacked enemies and party members lose hit points, dying when they reach zero HP. When all the enemies are defeated, living party members receive experience, eventually gaining a level and improving their stats when enough experience is accumulated. Slain party members can be revived in towns for a price. </p><p>Spells are bought in cities in special shops. The spells are divided into two categories - white magic and black magic. White Mages can only use white magic, Black Mages can only use black magic, and Red Mages can use both. Casting spells in battle uses up Dungeons &amp; Dragons-style spell slots, which, like hit points, can be restored by resting in inns.</p>"},{"name":"Final Fantasy II","year":1988,"developer":"Square Co., Ltd.","url":":Final Fantasy II (USA) (Proto)","filesize":170447,"score":6.5,"genres":"Role-playing (RPG) > Top-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>The Paramekian Empire decided to take over the world. Its soldiers and Dark Knights persecute innocent people, burn whole villages, hunt down brave warriors. Now Phin, the homeland of the four heroes, has been destroyed by the evil empire. Only four young warriors could escape, three men and one girl. On their way to a neighbor town Altea, they were attacked by the Dark Knights. Three of them were brought safely to Altea by the order of the rebel army. But one has not yet been found...</p><p><em>Final Fantasy II</em> (not to be confused with Final Fantasy IV, released in the West as \"Final Fantasy II\"), like its predecessor, is a top-down role-playing game where the player-controlled party travels through the overworld, fighting enemies, buying weapons, armor and magic spells in shops, and resting in town inns. Combat is round-based: the player selects commands for the whole party, and then watches the combat round unfold. </p><p>The game has an unusual character-building system. The three main controllable characters and a few others who may join the party can be fully customized by the player, without restrictions of classes or abilities. There are no character levels in the game: characters grow stronger by performing the same action repeatedly, which might increase one parameter but decrease another. For example, sustaining damage gradually increases the character's hit points; casting spells raises intelligence but lowers physical power, etc.</p><p>Weapons and spells, on the other hand, can be leveled up. The more a certain type of weapon is used in combat, the more proficient the character who uses this weapon becomes in this particular type. The power of a magic spell also gradually increases when used repeatedly in battles.</p>"},{"name":"Final Fantasy III","year":1990,"developer":"Square Co., Ltd.","url":":Final Fantasy III (Japan)","filesize":333825,"score":7.5,"genres":"Role-playing (RPG) > Top-down > Turn-based > Fantasy","desc":"<p>In a remote village of Ur, four orphan boys were raised by the priest Topapa. Once, the Crystal of Wind, guarded by the people of Ur, sank deep into the earth. The four boys decided to retrieve it from there and went down into an underground cave. But when they found the crystal, it spoke to them and from its words they understood they were chosen for a much more important and world-embracing mission...</p><p><em>Final Fantasy III</em> is the third Final Fantasy game for the NES platform. It was the last Final Fantasy game that does not use the ATB (active time battle) system (until it was removed again in Final Fantasy X). The turn-based battle engine has been improved: if the enemy is defeated, the next character will automatically switch to another enemy, and not hit the air, like in the previous two games. </p><p>Before the game begins, you give names to the four boys, which look the same (only in different colors) and belong all to the same class - the scrawny Onion Kid. Very quickly, however, you're able to give your heroes \"jobs\" - proper character classes, such as Fighter, Black Mage, Viking, Shaman and others. Each job has different capabilities and can use different equipment. More powerful jobs become available later in the game. The characters can change jobs throughout the game, though it costs them \"Capacity Points\" (which are earned in battle). </p><p>The game itself is, like the previous games, a top-down RPG where your characters travel in the overworld, sometimes entering cities and dungeons to buy equipment, rest and fight random encounters and bosses with turn-based combat. </p><p>Some minor issues were slightly changed to resemble more the classical Final Fantasy look (such as the menu layout etc.).</p>"},{"name":"Final Fantasy VII","year":2005,"developer":"Shenzhen Nanjing Technology"},{"name":"Final Lap","year":1988,"developer":"Namcot"},{"name":"Fire 'n Ice","year":1992,"developer":"Tecmo, Ltd.","url":":Fire 'n Ice (USA)","filesize":134639,"score":7.8,"genres":"Action > Puzzle > Side view > Platform > Direct control","desc":"<p>The peaceful island Coolmint is attacked by flame monsters sent by the evil wizard Druidle. The queen of the winter fairies chooses the novice wizard Dana to drive back the monsters.</p><p>Fire 'n Ice is a puzzle game seen from a side-view perspective. The goal in each level is to extinguish all flames by pushing or dropping blocks onto them. The player takes control of Dana who can create or destroy ice blocks, climb blocks and push loose blocks. Ice is created diagonally below Dana in the direction that he is facing, if there is already an ice block there, it will be destroyed. However, ice blocks cannot be created on a spot that is already occupied by a flame, so that the player will often have to find a way to create ice blocks next to or above a flame so that they can be pushed or dropped onto it. If an ice block is created next to another object or wall it will stick to it, meaning it can't be moved and won't fall down. It is therefor also possible to create ice bridges to get over chasms. When a loose ice block is pushed, it slides above the ground until it hits another object. Rocks can also be used to extinguish flames, but they are indestructible and only move one space when pushed (unless they are on an icy surface).</p><p>Some levels contain pipes through which Dana can go, burning jars that melt ice or moving monsters instead of flames. There are ten worlds plus five secret worlds that contain ten levels. The first nine worlds can be played in any order. The tenth level of a world usually features a special challenge like moving flames or monsters and lava that is slowly rising from the bottom.</p><p>The game also features an edit mode in which players can create their own levels.</p>"},{"name":"Fire Bam","year":1988,"developer":"HAL Laboratory, Inc."},{"name":"Fire Emblem Gaiden","year":1992,"developer":"Intelligent Systems Co., Ltd.","url":":Fire Emblem Gaiden (J) [T-Eng97b_J2e]","filesize":246408,"score":"","genres":"Role-playing (RPG) > Strategy > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>In a coup d'etat, a general deposes the king and it's up to a young hero, Alm, to join up with a rebel army and fight against this unjust rule.</p><p>Game takes place on battle maps in which the player moves all characters in his turn (or lets them assault/group via menu). If the characters enter close combat the display changes to a side view and the characters attacks the enemy once or multiple times (usually provoking a counter attack) for which the character receive experience points.</p>"},{"name":"Fire Emblem: Shadow Dragon & the Blade of Light","year":1990,"developer":"Nintendo R&D1"},{"name":"Fire Rock","year":1988,"developer":"System Sacom"},{"name":"Firehawk","year":1991,"developer":"Dizzy Enterprises Ltd.","url":":Fire Hawk (USA) (Unl)","filesize":88584,"score":5.9,"genres":"Action > Top-down > 2D scrolling > Shooter > Helicopter","desc":"<p>The President of the United States has put you in charge of stopping  the trafficking of drugs into the United States. To accomplish this, you pilot a Firehawk helicopter gunship through seven missions that involve rescuing agents and destroying drug producing facilities. When flying you survey the whole landscape from a top down view. However, this view changes to a 3rd person perspective when you are extracting an agent with your helicopter winch.</p>"},{"name":"Fisher-Price Firehouse Rescue","year":1992,"developer":"GameTek, Inc."},{"name":"Fisher-Price I Can Remember","year":1990,"developer":"IJE, Inc.","url":":Fisher-Price - I Can Remember (USA)","filesize":25322,"score":"","genres":"Educational > Puzzle > Top-down > Fixed / flip-screen > Board game > Cards / tiles > Mental training > Tile matching puzzle > Math / logic > Licensed","desc":"<p><em>Fisher-Price: I Can Remember</em> is a card-based game of memory transposed onto the NES. The object is to flip over pairs of cards and find pairs that match. If an unmatched pair is flipped then they get flipped back and the player must remember that data for their next turn. The game has 3 levels, with each having progressively more cards (12, 16, or 20). The cards contain pictures of Fisher-Price toys. Finding matches removes the cards from the screen which then reveals parts of a larger Fisher-Price item.</p><p>The game allows a player to play alone, or it allows 2-player competitive play. Further, it also allows human vs. computer competition, where the computer player is named \"Electro\".</p>"},{"name":"Fisher-Price Perfect Fit","year":1990,"developer":"Beam Software Pty., Ltd.","url":":Fisher-Price - Perfect Fit (USA)","filesize":24530,"score":"","genres":"Educational > Side view > Math / logic > Licensed","desc":"<p><em>Fisher-Price: Perfect Fit</em> is an activity that drops shapes onto the screen (usually in the form of Fisher-Price toys) which the player must then manipulate and match onto one of a series of silhouettes. In earlier levels, this is just a matter of moving the shape around the screen. In later levels, the player must also flip the shape vertically, horizontally, or both, before it forms the perfect fit for one of the silhouettes. The games can be played against the clock. There is also 2-player alternating play, where 2 human players can compete, or a human player can square off against the computer player (named \"Electro\").</p>"},{"name":"Fist of the North Star","year":1987,"developer":"Shouei System","url":":Fist of the North Star (USA)","filesize":56383,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Platform > Licensed > Regional differences","desc":"<p>This is a platform \"beat-'em-up\" game based on the animé series <em>Hokuto no Ken</em>. According to the story mentioned in the manual, Kenshirou, the main character, has to save the people from the evil Emperor Heaven. The game itself, however, features no story whatsoever, but a lot of platform action instead. You have to run quickly through the levels (there is a time limit), punching and kicking your enemies, causing them to fly away or to explode, occasionally meeting a boss, visiting secret areas behind doors and collecting various power-ups. </p><p>There is also a VS. mode which lets the player fight against the first four stage bosses consecutively.</p><p>This is in fact the second game in the series; the first one was never released outside of Japan.</p>"},{"name":"Flappy","year":1985,"developer":"dB-SOFT"},{"name":"Flea!","year":2020,"developer":"Lowtek Games"},{"name":"Flight of the Intruder","year":1991,"developer":"Imagineering Inc.","url":":Flight of the Intruder (USA)","filesize":61661,"score":"","genres":"Simulation > 1st-person > Flight / aviation > Vehicular combat > Licensed","desc":"<p>It's 1972. The Gulf of Tonkin, Vietnam. You're Navy airman Jake \"Cool Hand\" Cribbon - ready to take on the best the Hanoi war machine has to offer. And this time, it looks like you're in for it.</p><p>Experience top-flight realism with Flight of the Intruder! In this incredible air combat simulator, you'll fight for your life, flying either an A-6 Intruder bomber or an F-4 Phantom fighter in twelve different missions and over 50 combat rounds. Select from an arsenal of high-tech weaponry, including machine guns and heat-seeking missiles, and send them screaming toward your enemy with the help of a Heads-Up display and full cockpit instrumentation. Feel the heat as your weapons detonate in brilliant explosions! Then return to your carrier for some well-deserved R & R.</p>"},{"name":"Flintstones, The: The Rescue of Dino & Hoppy","year":1991,"developer":"Sol","url":":Flintstones, The - The Rescue of Dino & Hoppy (Europe)","filesize":184223,"score":7.5,"genres":"Action > Sports > Side view > 2D scrolling > Platform > Puzzle elements > Basketball > Prehistoric > Licensed","desc":"<p>The Flintstones and the Rubbles were enjoying a fine day when suddenly, someone from the future called Dr. Butler arrived and stole their pets, Dino and Hoppy! Butler plans to feature the pets in his intergalactic zoo, and what's worse, he's destroyed the Great Gazoo's time machine so that no-one could stop him! It's up to everyone's favourite caveman, Fred Flintstone, to find the pieces to the time machine and repair it, so that they can travel to the future and confront Dr. Butler once and for all!</p><p><em>The Flintstones: The Rescue of Dino &amp; Hoppy</em> is a side-scrolling platformer for the NES. In it, you control Fred Flintstone through various locations such as Bedrock, Reef Rock, the Jungle and more as he searches for the missing pieces of Gazoo's time machine. Fred has his trusty club which he can use to attack with, or charge up it's power by holding B for a more deadly attack. Fred can collect coins after defeating enemies, which are used to pay for secondary weapons like slingshots and tomahawks, as well as special abilities such as flying and diving.</p><p>After completing the first level, the player is presented with an overworld map that allows you to choose which level you'd like to go to. There are also basketball courts on the map - if you beat your opponent in a game of basketball, you can earn one of the special abilities which are required for use later.</p>"},{"name":"Flintstones, The: The Surprise at Dinosaur Peak!","year":1994,"developer":"Taito Corporation","url":":Flintstones, The - The Surprise at Dinosaur Peak (Europe)","filesize":176045,"score":7.5,"genres":"Action > Side view > 2D scrolling > Platform > Prehistoric > Licensed","desc":"<p>Fred and Barney are searching for their children, Pebbles and Bam-Bam who got lost. When they finally find them, a volcanic eruption blocks their way and so they start going all the way around the mountain to find out why this happened and of course to save their children. </p><p><em>The Surprise at Dinosaur Peak</em> is the second Flintstones-licensed game for the NES. There are two characters you can play with. By pressing the Select button you can change from Fred to Barney and vice versa. Each character has unique abilities that are needed to complete certain parts of each stage. For example Fred can grab the edges of a roof or a hill and climb while Barney can hang from ropes and vines. In terms of weapons Fred has a bat which is stronger and can also be charged for extra power but it takes more time to use. Barney on the other hand has a slingshot and can shoot small rocks for ranged attacks but rather weak. There are also weapons like throwing axes and bowling balls that both can use.</p>"},{"name":"Flying Dragon: The Secret Scroll","year":1987,"developer":"Culture Brain Inc.","url":":Flying Dragon - The Secret Scroll (USA)","filesize":75918,"score":"","genres":"Action > Side view > 2D scrolling > Fighting > Martial arts","desc":"<p>The grand master Juan was robbed of the secret scrolls of Hiryu-no-Ken, which is the ultimate kung-fu stance that gives the impression of a flying dragon when in effect. Luckily Juan has entrusted the remaining scroll to his worthy student, Ryohi. Juan's last request was for Ryohi to visit Shorinji. Gengai, the bishop of Shorinji, took the young Ryohi under his wing.  Six years later, a letter of challenge is sent from the Tusk Soldiers, who are the enemies of Shorinji, The letter mentions the upcoming \"World Tournament of Contact Sports\". Ryuhi decides to take part in the tournament as a representative of Shorinji. Ryuhi also hears from  Gengai that it was the Tusk Soldiers who robbed Ryuhi's master of his scrolls and now Ryuhi plans on getting them back.</p><p>The player controls Ryuhi. During the side-scrolling portion of the game the player can use kung fu to dispose of enemies. There are also miniboss type enemies (the screen turns black when they appear)  that must be defeated because they drop items that must be collected in order to continue on. The items they drop go in a sequence of power-ups which will eventually allow you to get a key to exit the level. There are some one on one duels during fighting tournaments that involve hitting a target on an opponents body while defending the target on Ryuhi's body.</p>"},{"name":"Flying Hero","year":1989,"developer":"Aicom Corporation"},{"name":"Flying Warriors","year":1991,"developer":"Culture Brain Inc.","url":":Flying Warriors (USA)","filesize":168881,"score":"","genres":"Action > Role-playing (RPG) > Side view > 2D scrolling > Fighting > Martial arts","desc":"<p><em>Flying Warriors</em> is a combination between the Japanese exclusive games Hiryū no Ken II: Dragon no Tsubasa and Hiryū no Ken III: Go-nin no Dragon.</p><p>The game is about a team of superheroes called the Flying Warriors who have to fight a demon before he can take over the world with his armies of Tusk Soldiers. You start off with kung fu master Rick Stalker, but eventually get the help of Hayato Go, Mary Lynn, Greg Cummings and Jimmy Cutler. During the side scrolling portion of the game you can use your kung fu and mystic spells to dispose of enemies. Each enemy you defeat gives you experience points which will eventually increase your life points. There are some one on one duels during fighting tournaments that involve hitting a target on your opponents body while defending the target on your own body. There is also RPG-style command battles against bosses.</p><p>There is also a tournament mode, where up to 8 players can compete to win the championship. You can choose your characters fighting style from six different choices; kung fu, boxing, karate, wrestling, kick boxing, and martial arts.</p>"},{"name":"Formula 1 Sensation","year":1993,"developer":"Konami Co., Ltd."},{"name":"Formula One: Built to Win","year":1990,"developer":"Winky Soft Co., Ltd.","url":":Formula One - Built to Win (USA)","filesize":117658,"score":"","genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing","desc":"<p>Formula One: Born To Win is a career racing game. The player begins with a Mini Cooper and claws up the ranks of the racing circuit starting with the lowest ranked races in the eastern part of the United States. By winning races, the player can upgrade parts on the Mini and have a better shot at more races. Win enough races and eventually earn the opportunity to race using faster cars. The other cars available in the game are the Vector W2, Ferrari F40, and of course, the Formula 1. The first races take place in New York City, Detroit, and Miami. The other locales to visit are Yellowstone, Denver, Dallas, Las Vegas, Los Angeles, San Francisco, and finally Hawaii.</p><p>The primary game is the \"Normal Mode\" of the game. The game's main menu also offers a \"Free Mode\" which allows the player to freely choose any of the 4 cars in the game to race on a selection of courses, without any obstruction from other cars,</p>"},{"name":"Fox's Peter Pan & The Pirates: The Revenge of Captain Hook","year":1991,"developer":"Equilibrium, Inc."},{"name":"Frankenstein: The Monster Returns","year":1990,"developer":"Tose Co., Ltd.","url":":Frankenstein","filesize":151819,"score":5.7,"genres":"Action > Side view > 2D scrolling > Arcade > Horror > Licensed","desc":"<p>The villagers thought they were safe. But now it is time they learned the terrible truth... Frankenstein has risen, laid waste to the lands surrounding the village, has amassed an evil army of unholy creatures and even gone so far as to capture a young girl.</p><p><em>Frankenstein</em> is a side scroller adventure against all sorts of nightmarish creatures. Some might even call it a clone of the more widely known Castlevania games of the NES. You begin the game with nothing but your fists... but may acquire a magical club from enemies. Finding additional powerups with give the club the ability to toss fireballs. There are treasure chests in various rooms as well as characters that can help you in your quest through dialog hints.</p>"},{"name":"Freedom Force","year":1988,"developer":"Sun Electronics Corp.","url":":Freedom Force (USA)","filesize":83418,"score":6.6,"genres":"Action > 1st-person > Side view > Arcade > Shooter","desc":"<p>In <em>Freedom Force</em>, Rad Rex and his partner Manic Jackson are part of an elite counter terrorism unit. Their mission is to save the hostages in a hijacked plane by killing all the Bagmen. After they successfully take back control of the plane they must work there way back though the airport and streets to take out the guerrillas hideout to get to their leader, Eugene Extreme.</p><p><em>Freedom Force</em> is a light gun game that is played with the Nintendo Zapper. The object of the game is to kill all of the bad guys with out losing all of Rad’s health or killing too many hostages or civilians. The friends and foes appears though doors and windows, and from behind objects forcing a quick decision whether to shoot them or not. There are 5 levels in total (Aeroplane, Gangway, Airport Terminal, Street, and Hideout) and the 4 different types of weapons that enemies have are guns (one shot), machine guns (one burst loses about quarter health), grenades (instant kill but can be shot in air), and missiles (faster then grenades).</p><p>To help the player an icon can appear quickly in the lower left corner of the screen representing health, ammo, gun, a grenade launcher (weapon to kill everyone at once, not good with hostages and civilians around), and a harder difficulty (more enemies), that the player must shoot to activate. A two-player mode is available with the two players taking turns, with the second player playing Manic Jackson. There is also a hangman mini-game that is played between every two levels where the player must shoot the correct letter when it is lit up.</p>"},{"name":"Friday the 13th","year":1989,"developer":"Atlus Co., Ltd.","url":":Friday the 13th (USA)","filesize":42118,"score":5.2,"genres":"Action > Side view > Metroidvania > Horror > Licensed","desc":"<p>Based on the popular movie franchise, <em>Friday the 13th</em> casts you as one of six camp counselors (three girls or three boys) at the infamous Camp Crystal Lake, and you are tasked with destroying Jason Voorhees once and for all.</p><p>To get to Jason, you must run around a camp, killing zombie ghouls and collecting weapons, until you hear an alarm sound. When that alarm goes off, it means Jason has entered a cabin and you must find him.</p><p>To save time, you can switch between all six counselors, depending on where you are. Once you enter the house that Jason is in, the game switches to a 3D-esque maze in which you have to hurt Jason with the items you collected. Once he's been damaged enough, he'll run away, only to sound another alarm later and enter another house.</p>"},{"name":"From Below","year":2020,"developer":""},{"name":"Front Line","year":1985,"developer":"Taito Corporation"},{"name":"Fun House","year":1991,"developer":"Ironwind Software"},{"name":"Funblaster Pak","year":1990,"developer":""},{"name":"Fushigi no Umi no Nadia","year":1991,"developer":"Advance Communication Company"},{"name":"Futebol","year":1991,"developer":"Computer & Entertainment Inc."},{"name":"Fūun Shaolin Ken","year":1987,"developer":"Jaleco Ltd."},{"name":"Fūun Shaolin Ken: Ankoku no Maō","year":1988,"developer":"Jaleco Ltd."},{"name":"Fuzzical Fighter","year":1991,"developer":"Make Software, Inc."}]