[{"name":"G.I. Joe: A Real American Hero","year":1991,"developer":"KID Corp.","url":"1#G.I.%20Joe%20-%20A%20Real%20American%20Hero%20%28USA%29.nes","filesize":393232,"score":8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>G.I Joe is a side-scrolling action game where you can select 3 out of a possible 5 characters to complete a mission. </p><p>Each level is in three main parts:  The fight into the mission zone, the mission zone, and the escape from the mission zone.  The stages where you fight into and escape from the mission zone are straightforward action – just fight your way to the end of the stage, and defeat the stage boss.</p><p>The actual mission zone is a maze, where the object is to place bombs at pre-determined locations, then find and use the exit.  The mazes start out easy with the first one being only two screens high and 4 long.  Level 6 is 7 by 8 for a total of 56 screens.</p><p>Characters:</p><p>Duke (Tiger Force first sergeant/squad leader), Rock &amp; Roll (gatling gunner), Capt. Grid-Iron (hand-to-hand combat specialist), Blizzard (arctic attack soldier), Snake Eyes (commando)</p>"},{"name":"G.I. Joe: The Atlantis Factor","year":1992,"developer":"KID Corp.","url":"1#G.I.%20Joe%20-%20The%20Atlantis%20Factor%20%28USA%29.nes","filesize":393232,"score":6.4,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Licensed","desc":"<p>Cobra, the evil villain, previous encounter with G.I. Joe ended with Cobra’s base been destroyed (as played in G.I. Joe: A Real American Hero). But this time Cobra has unlocked the secret of Atlantis. Using an ancient power source Cobra has managed to raise Atlantis out of the bottom of the ocean and now is rebuilding his forces set to destroy the world. It is up to General Hawk and his friends, all part of the Joe Team, to save the day again. </p><p><em>G.I. Joe: The Atlantis Factor</em> is a side-scrolling platform game where the objective is to get General Hawk and/or his friends to make there way though the missions to end up at Cobra’s headquarters. There are 3 paths to take though the 22 levels (plus some shortcuts) that split and merge at decision points and it also allows the player to backtrack and take a new path. The levels vary from a simple “get to the end” to mazes to “find these items” type levels, also with the odd boss fight.</p><p>The game starts of as playing General Hawk, the main character, however as the player completes levels they unlock new characters. These new characters, all with the there own strengths and weaknesses (like how high they can jump and hit points) and special abilities. These characters can be picked at the start each new level. The characters are General Hawk (main character), Wet Suit (can dive under water), Storm Shadow (close combat), Road Block (cruel though narrow passages), Duke (fire gun in any direction), and Snake Eyes (close combat). There are also non playable characters that can help the chosen character that are also unlocked after completing certain levels like Stalker (informant), Big Bear (heals during battle), Spirit (heals out side of battle), and Gung-Ho (gives ammo when running low).</p><p>The player gets two weapons to start with and there are three more to collect after completing certain missions. The weapons are Punches (sword for Storm Shadow and Snake Eyes), Machine Gun (starting weapon), Pulse Rifle, Laser Rifle, and Rocket Launcher. When a weapon is collected any character can use it. Each weapon has 4 different power levels that can be obtained by collecting a few “Pow” pickups from fallen enemies or completing certain levels. Each character must level up there weapons individually.</p><p>Password save is available using a letters/numbers in a grid system.</p>"},{"name":"Galactic Crusader","year":1990,"developer":"Joy Van"},{"name":"Galaga","year":1985,"developer":"BANDAI NAMCO Studios Inc.","url":"1#Galaga%20%28Europe%29.nes","filesize":40976,"score":7.2,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Galaga</em> is a vertical arcade shooter from Namco. You control a space fighter at the bottom of the screen, scrolling left and right in order to avoid oncoming bombs and kamikaze attacks from alien invaders--and to fire your own missiles to fight back!</p><p>There are an infinite number of stages to progress through. Every third level is a \"challenge stage\" in which you have a free chance to shoot as many aliens as possible and rack up bonus points.</p><p>Certain aliens have tractor beams they can use to capture one of your ships. If that wasn't your last \"life,\" you can try to shoot that alien down and recapture your ship, giving you two ships at once and doubling your firepower.</p><p>A summary screen appears when the game is over, giving you both your final score and you final \"hit ratio\"--the number of missiles fired, enemies destroyed, and the percentage of targets hit.</p>"},{"name":"Galaxian (Japan)","year":1984,"developer":"Namco Limited","url":"1#Galaxian%20%28Japan%29%20%28Rev%20A%29.nes","filesize":16400,"score":7.2,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p><em>Galaxian</em> is a shoot 'em up in which the player is at the bottom of the screen, with an arrangement of aliens at the top. The player moves left and right to aim at an alien, then shoots a bullet up the screen, and the alien it hits is killed. The aliens are classed as Drones, Emissaries, Hornets and Commanders, with those higher up the screen scoring more points when destroyed. At set intervals an enemy will move down the screen towards you, escorting a bomber, which is a moment of high danger. Clear a wave and another is generated.</p>"},{"name":"Galaxy 5000","year":1991,"developer":"Activision, Inc.","url":"1#Galaxy%205000%20%28USA%29.nes","filesize":262160,"score":7.4,"genres":"Action > Racing / Driving > Isometric > Shooter > Sci-fi / futuristic","desc":"<p>Galaxy 5000 is an isometric-perspective space racing game where 4 spaceships compete head to head in outer space races. 1 or 2 human players can compete in the races; the rest of the ships are controlled by the computer. The ships complete several laps around each course and have limited firing capacity to throw their opponents off balance. The ships can also jump. In fact, the ships can jump right off the edge of the course and drop down (in space). If the player does not complete a course in good time, the entire race track will disintegrate and leave the ship to fall down (and apparently splash into some water below).</p><p>A notable item about this game is its use of squeaky, comical, digitized voices for exclamations when colliding with another player (\"Hey!\", \"Excuse me!\", \"Watch it!\"). There are also 2 completely different control schemes that a player can adopt for cruising around the course. The first scheme rotates and drives the ship in the direction that the control pad is being pressed. The second scheme uses left and right to rotate the ship and up to thrust in the direction the nose is pointing.</p>"},{"name":"Galf","year":2018,"developer":"Spoony Bard Productions"},{"name":"Gall Force: Eternal Story","year":1986,"developer":"HAL Laboratory, Inc."},{"name":"Gambler Jiko Chūshinha","year":1988,"developer":"Game Arts Co., Ltd."},{"name":"Gambler Jiko Chūshinha 2","year":1990,"developer":""},{"name":"Ganbare Goemon 2","year":1989,"developer":"Konami Industry Co. Ltd."},{"name":"Ganbare Goemon Gaiden 2: Tenka no Zaihō","year":1992,"developer":"Konami Co., Ltd."},{"name":"Ganbare Goemon Gaiden: Kieta Ogon Kiseru (Japan)","year":1990,"developer":"Konami Industry Co. Ltd.","url":"1#Ganbare%20Goemon%20Gaiden%20-%20Kieta%20Ougon%20Kiseru%20%28Japan%29.nes","filesize":524304,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based","desc":"<p>This is a semi-humorous Japanese-style RPG set in medieval Japan. It tells us about the adventures of Goemon, the noble thief and skillful martial artist. One day Goemon returns home and finds out his favorite smoking pipe is gone. Who could have done such a horrible crime? Goemon's friend Ebisumaru offers to help him to find out the criminal, and both embark on a journey full of adventures and danger.</p><p>Like most Japanese-style RPGs of the time, <em>Goemon Gaiden</em> utilizes a simple turn-based battle system. You talk to town people to gather information, buy weapons, armor and items, fight random enemies, descend into dungeons and find treasures.</p>"},{"name":"Ganbare Goemon! Karakuri Dōchū","year":1986,"developer":"Konami Industry Co. Ltd."},{"name":"Ganso Saiyūki: Super Monkey Daibōken","year":1986,"developer":""},{"name":"Garfield no Isshūkan: A Week of Garfield","year":1989,"developer":"MARS Corporation"},{"name":"Gargoyle's Quest II","year":1992,"developer":"Capcom Co., Ltd.","url":"1#Gargoyle%27s%20Quest%20II%20%28Europe%29.nes","filesize":262160,"score":7.8,"genres":"Action > Side view > Top-down > 2D scrolling > Metroidvania > Platform > Direct control > Fantasy > Horror","desc":"<p>The Ghoul realm is under attack by a mysterious force and aspiring warrior Firebrand sets out to save it.</p><p>As in its predecessor, gameplay in <em>Gargoyle's Quest II</em> is divided into an adventure-like and an action part. During the adventure parts, Firebrand explores a world map and several villages from a top-down perspective, talking to his fellow ghouls and zombies to advance the story or receive important items. Action parts are seen from a side-scrolling perspective. In these parts of the game, Firebrand has the ability to jump, cling to walls, fly for a limited amount of time and shoot fireballs at his enemies. As the game progresses, Firebrand becomes more and more powerful, receiving items that improve his agility, armor or attack power.</p>"},{"name":"Garry Kitchen's Battletank","year":1990,"developer":"Imagineering Inc."},{"name":"Gauntlet","year":1988,"developer":"Atari Games Corporation","url":"1#Gauntlet%20%28USA%29.nes","filesize":196624,"score":6.9,"genres":"Action > Top-down > 2D scrolling > Arcade > Fantasy","desc":"<p>It's time again for the four warriors to gear up and head out on a new quest. Their mission this time is to retrieve the Sacred Orb of Rendar that was stolen by the nefarious Morak. He has hidden the Orb along with many other treasures in his Five Worlds maze. He of course has his many minions guarding his ill gotten riches.</p><p>One or two players get to play as either the warrior Thor, the valkyrie Thyra, the  wizard Merlin, or as the elf Questor. Each character has their own unique weapon and abilities.  They can also use a limited amount of screen clearing bombs that  can be collected in the maze. Also collectible in the maze are food items which restore some of their depleted health and treasure chests, wherein collecting enough treasure chests will give the player a permanent boost to their total amount of hit points.</p><p>Gameplay involves exploring 100 different floors looking for each floor's exit. Finding the exit is made difficult because of the various monsters continually spawning from the enemy generators, that only can be stopped by being destroyed. Other obstacles include locked doors which can only be opened with keys, paralyzing traps that grind movement to a halt, and teleporters that can warp the player from one side of the room to the other. </p><p>After every couple of floors, the player will be treated to a limited time in a treasure room. The player has to collect as much treasure as they can before time runs out. If they make it to the exit of the treasure room before time runs out, they will get an extra bonus of all their hit points getting refilled to the maximum.</p><p>Also of note, the player has to be on the lookout for secret exits on some of the floors. These will take the player to one of the eight clue rooms. Once inside this room, the player must find a question mark tile and exit before time runs out. This will result in the player getting a part of a vault combination. Getting all parts of this combination is necessary as it will have to be entered in order to gain admittance to the 100th floor.</p>"},{"name":"Gauntlet II","year":1989,"developer":"Atari Games Corporation","url":"1#Gauntlet%20II%20%28USA%29.nes","filesize":262160,"score":7.3,"genres":"Action > Top-down > 2D scrolling > Arcade > RPG elements > Fantasy","desc":"<p><em>Gauntlet II</em> is very similar to its predecessor. Up to four players (a wizard, a warrior, an elf, and a valkyrie) make their way through various mazes, collect treasures and magic potions, and fend off assorted creatures and ghosts.</p>"},{"name":"Geimos","year":1985,"developer":"Micronics"},{"name":"Gekitotsu Yonku Battle","year":1989,"developer":"Tamtex"},{"name":"Gemfire","year":1991,"developer":"KOEI Co., Ltd.","url":"2#Gemfire%20%28USA%29.zip","filesize":1,"score":6.6,"genres":"Strategy > Diagonal-down > Turn-based > Fantasy","desc":"<p>Koei made an incursion into the fantasy worlds of magic with this game.</p><p>Six magicians, each trapped inside a magical gem, are liberated from the crown Gemfire by Princess Robyn, daughter of the tyrannical ruler of Ishmeria, King Eselred. Fleeing across the length and breadth of the island nation, they each choose a leader from the greatest noble houses as their champion to topple Eselred and bring peace to Ishmeria. </p><p>Players select one of these noblemen and seek to unite all the provinces under their banner through a combination of warfare and diplomacy.</p>"},{"name":"Genghis Khan","year":1989,"developer":"KOEI Co., Ltd.","url":"2#Genghis%20Khan%20%28USA%29.zip","filesize":1,"score":7.4,"genres":"Strategy > Top-down > Turn-based > Turn-based strategy > Historical events","desc":"<p><em>Genghis Khan</em> is a top-down 2D turn-based grand strategy game, based on the real mongol leader Genghis Khan's life.</p><p>The game's main objective is to become the supreme ruler. The player can select from two campaigns: Mongol conquest or World conquest. In the Mongol conquest, players take on the role as Temujin (later known as Genghis Khan), with the goal being to unite all the tribes of Mongolia. In the World conquest, Players can be one of four characters. Similar to the Mongol conquest, players must unite all the countries together. Players can use military force (players must gather an army and lead them into war) or use diplomacy (including things such as strategic marriages). </p><p>The main focus of the game involves management of territory, as the player manages various activities that improve their provinces. Battlefields are hex tiled based, with players giving commands to units groups with the objective of trying to defeat the forces of the enemy combatants.</p>"},{"name":"Genghis Khan II: Clan of the Gray Wolf","year":1993,"developer":"KOEI Co., Ltd."},{"name":"George Foreman's KO Boxing","year":1992,"developer":"Beam Software Pty., Ltd.","url":"3#George_Foremans_KO_Boxing/George_foreman's_KO_boxing.nes","filesize":393232,"score":5.6,"genres":"Sports > Behind view > Boxing > Licensed","desc":"<p>Featuring heavyweight champion George Foreman, this is a boxing simulation where players, taking the role of Foreman, go through a series of twelve rounds against different boxers to win the championship title belt.</p><p>Played from an third-person perspective using a view from right over the shoulders over the boxer, players can move left and right to dodge incoming punches, block and throw left and right punches. The standard punch is a cross, but by holding the Up-key pressed, jabs can also be thrown.</p><p>By avoiding punches and hitting them, a superpunch often becomes available, inflicting much more damage. A fight consists of a maximum of three rounds of three minutes each. When a boxer is knocked down four times, the match is over (technical knock-out). The same happens when a boxer goes down three times in a single round (regular knock-out). When down, players need to press both punch buttons in rapid succession to get back to their feet. The screen shows an energy meter drained when punches are received. After being knocked down and during intermissions, some energy is restored.</p><p>All versions, except for the Game Boy, can be played with two players. A password system is used to save the progress.</p>"},{"name":"Get'em Gary","year":2017,"developer":"Sly Dog Studios"},{"name":"Get'em Gary (Limited Edition)","year":2017,"developer":""},{"name":"Getsufūma Den","year":1987,"developer":"Konami Industry Co. Ltd."},{"name":"Ghost Lion","year":1989,"developer":"Kotobuki System Co., Ltd.","url":"1#Ghost%20Lion%20%28USA%29.nes","filesize":262160,"score":6.4,"genres":"Role-playing (RPG) > 1st-person > Top-down > Turn-based > Japanese-style RPG (JRPG)","desc":"<p>A mysterious white lion once attacked a small village and killed many of its inhabitants. But a brave soldier defeated the beast with his spear. The white lion ran away and found a shelter in a dark cave near the town. Some years later, Maria's parents organize an expedition to the cave in order to find out what the white lion really is. But they never come back...</p><p>Now Maria has to go to the cave and to search for her parents. Equipped with the famous spear the brave soldier Moja used to defeat the lion, she receives the village elder's permission to descend into the cave. But while wandering through the dark corridors, she falls into a river, and a strong current brings her to the Dream World. She no longer can return back, and the fairies who inhabit the Dream World tell her that the only way to defeat the lion is to travel to yet another world - the Dark World...</p><p>In this game, you control Maria as she travels on the world maps, visits towns, and descends into dungeons. The battles are turn-based and are viewed from first-person perspective in Dragon Warrior style. Instead of party members you have ghosts you can summon to help you in battles, such as the soldier Moja and others. Hit points and magic points are called Courage and Dream, respectively. You gain levels only by finding special items, not from fighting random monsters.</p>"},{"name":"Ghostbusters","year":1986,"developer":"Activision, Inc.","url":"1#Ghostbusters%20%28USA%29.nes","filesize":65552,"score":6.5,"genres":"Action > Side view > Top-down > 2D scrolling > Licensed","desc":"<p>Based on the 1984 film of the same name, the Ghostbusters are the ones to call to \"bust\" any ghost hauntings. They do this through the use of nuclear-accelerated \"proton packs\" and \"ghost traps\", whereby the ghosts can be captured and transferred to a secure storage facility at their Headquarters. However New York City has suddenly become a very haunted place, and the number of ghosts has suddenly and dramatically increased. The Ghostbusters must reduce the paranormal psychokinetic energy, the \"PK level\" in the city, which represents ghost power, before the Temple of Zuul awakens and resurrects an evil goddess called Gozer.</p><p><em>Ghostbusters</em> is an action game that features an overhead-view and a side-view. From Ghostbusters HQ, the player must monitor a map of midtown Manhattan for \"ghost alarms\", as well as for casual, roaming spirits, and plot a route to the alarmed area. Once the route is plotted, the player then controls the purchased Ghostmobile as it drives through traffic. Here, the player is able to capture casual ghosts on the way if they are en route. When the haunted location is reached, the game switches to a side-view. Two of the Ghostbusters will take position, activate their proton beams, and toss a trap to the ground. The player must then use the two Ghostbusters to attempt to lead the ghost(s) over the placed trap. Once activated, the trap springs to capture any ghosts directly above it. A successful capture will earn the player money, which can then be used to purchase new Ghostbusters vehicles and new modifications for it. An unsuccessful capture will see the ghost fly away (after nastily sliming one of the Ghostbusters).</p><p>As the game progresses, the PK energy in the city increases. The Ghostbusters must keep it under critical levels by being constantly successful at busting ghosts. Eventually the Temple of Zuul will activate, and if the PK levels are still manageable, the Ghostbusters can venture there for a final showdown with Gozer.</p>"},{"name":"Ghostbusters II","year":1990,"developer":"Imagineering Inc.","url":"1#Ghostbusters%20II%20%28USA%29.nes","filesize":262160,"score":5.3,"genres":"Action > Racing / Driving > Side view > Shooter > Sci-fi / futuristic > Horror > Licensed","desc":"<p>Based on the movie of the same name, something strange is going on in New York City and the Ghostbusters are back and armed with \"benevolent slime\" to find out what it is. The ghostbusters quest, like in the movie, takes them to an underground river of slime, ghostly hauntings in the courthouse, an abandoned subway line. These action sequences are interspersed with driving sequences with the Ghostbusters car, Ecto-1A  Finally, the Ghostbusters must bring the Statue of Liberty to life through the New York Harbor and then navigate it through the city streets. This leads to a final confrontation with a painting come-to-life, Virgo the Carpathian in which all 4 ghostbuster members must fight their way into the museum.</p><p>In the action sequences you control a single ghostbuster who can fire his slime weapon and jump. In driving sequences you move the Ecto-1A around the screen and your controls are also a slime gun and jumping. Additionally you must find speed arrows on the ground to jump over huge chasms. Finally, while controlling the Statue of Liberty you may fire her torch straight up into the air (find a power-up torch to shoot diagonally) or let loose the tablet that she carries to destroy all enemies on the screen.</p><p>Find 20 \"Ghostbusters 2\" symbols in any of these levels to obtain an extra life.</p>"},{"name":"Ghosts 'N Goblins","year":1986,"developer":"Capcom Co., Ltd.","url":"1#Ghosts%27n%20Goblins%20%28USA%29.nes","filesize":131088,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Direct control > Fantasy","desc":"<p><em>Ghosts 'N Goblins</em> is a sideways scrolling action platformer spread over six levels, each of which must be completed within three minutes (or a life is lost), taking in forest, village, mountain and cavern settings with increasing difficulty.</p><p>Arthur the brave knight must rescue his beloved Princess from the Demon King Astaroth and his forces - amongst them are the various undead (ghosts, zombies), bats, ogres and goblins. Other challenges include moving platforms, ladders and water/fire hazards. </p><p>The player can walk left and right, jump, and is also equipped with a lance to use as a weapon. Getting hit by enemies causes Arthur to lose his armor and run around in his underpants, getting hit again will cause the player to lose a life. As in most games in this genre, the player can pick up power-ups such as daggers and bombs during the course of the game, giving the player greater firepower.</p>"},{"name":"Ghoul School","year":1992,"developer":"Imagineering Inc.","url":"2#Ghoul%20School%20%28USA%29.zip","filesize":1,"score":5.5,"genres":"Action > Side view > 2D scrolling > Metroidvania > North America > Horror","desc":"<p>In <em>Ghoul School</em> the player is cast as Spike O'Hara, a senior at Cool School High in a small American town. Spike is a rebel and an outcast, but is a good kid. While taking a shortcut through the graveyard home one day, he comes across a glowing skull. Intrigued, he takes it to Dr. Femur, his anatomy teacher, the next day, which happens to be the day before Halloween. Dr. Femur wants to keep it for an overnight study, and Spike reluctantly agrees, noticing that the skull appeared bigger than the day before.</p><p>During the night, the skull begins transmitting a message to the realm of the dead. On Halloween, the dead begin their assault. The teachers and students inside are turned into zombies and demons under the control of whatever intelligence has taken over the school. Samantha Pom-Pom, the head cheerleader, is captured by the dead and held somewhere inside the school. Paranormal eliminators and members of the football team have ventured inside to find her, but have not returned. When Spike learns of the mess from the TV news, he rushes to the school and decides to rescue her himself.</p><p>Spike ventures inside. The doors shut and lock behind him. There's no turning back now.</p><p>Spike begins his quest with only his trusty baseball bat and battered sneakers, but can collect better weapons and shoes along the way. Among them are the straightforward sickle, embalming fluid, towel and almighty gamma gun, the strange Deweytron and taserlike Spinal Zap, and a sandwich (if it can be used as a weapon, they should have fired the cafeteria workers a LONG time ago), among other weapons. Useful items include the spring shoes, needed to reach high places, the suction shoes, which allow you to walk on the ceiling, and the Golden Apple, needed to bypass the Medusa head guarding the way to the second half of the school.</p><p>Get going! You have 129 rooms to explore and Samantha is counting on you. Good luck.</p>"},{"name":"Ginga Denshō: Galaxy Odyssey","year":1986,"developer":"Atlus Co., Ltd."},{"name":"Ginga no Sannin","year":1987,"developer":"Pax Softnica"},{"name":"Goal!","year":1988,"developer":"Tose Co., Ltd.","url":"3#Goal/goal.nes","filesize":393232,"score":5.7,"genres":"Sports > Top-down > Isometric > Football (European) / Soccer","desc":"<p><em>Goal!</em> is a soccer game for one player against the computer, two players against each other, or two players against the computer. Gameplay is from an angled overhead point of view, with the screen scrolling to follow the action. Several game options are available, including tournament mode, world cup mode, and a goal shooting competition.</p>"},{"name":"Goal! Two","year":1992,"developer":"Tose Co., Ltd.","url":"2#Goal%21%20Two%20%28USA%29.zip","filesize":1,"score":6.3,"genres":"Sports > Diagonal-down > Isometric > Football (European) / Soccer","desc":"<p><em>Goal! Two</em> is the sequel to Goal!. It is a football/soccer game for one or two players and changed the top-down perspective from the first game to an angled overhead point of view with a scrolling screen. Play modes include a single-player \"Super Cup\" tournament and several single-game options, including two players against the CPU. </p><p>Eight additional teams have been added, increasing the roster to 24, but some club teams have been taken out. The game modes include Exhibition Match and Super Cup (tournament). The 2-on-2 Shootout mode from the previous game has been removed. A new ability allows the player to choose 11 players from a squad of 15, with different characteristics.</p>"},{"name":"Godzilla 2: War of the Monsters","year":1991,"developer":"Toho Co., Ltd.","url":"1#Godzilla%202%20-%20War%20of%20the%20Monsters%20%28USA%29.nes","filesize":262160,"score":6,"genres":"Strategy > Top-down > Turn-based > Sci-fi / futuristic > Licensed","desc":"<p>In a completely different style from the first Nintendo Godzilla game from Toho, you play as japanese military forces fighting against Godzilla. Because Godzilla is such a ferocious monster, this is no easy task... in fact, your attacks to Godzilla don't actually do any damage to him at all. Strategy instead becomes the main point of play as you must position forces in strategic points to route Godzilla away from important buildings and into other areas where his movement will be less destructive to the city. Actual success of these routing attacks is imperfect, if one is not careful, the whole offensive will fall apart over a single missed attack.Beware Godzilla!</p>"},{"name":"Godzilla: Monster of Monsters","year":1988,"developer":"Compile","url":"1#Godzilla%20-%20Monster%20of%20Monsters%21%20%28USA%29.nes","filesize":262160,"score":5.5,"genres":"Action > Side view > Isometric > Anime / Manga > Arcade > Fighting > Sci-fi / futuristic > Licensed","desc":"<p>In the year 2XXX A.D., Earth is under attack from the aliens of Planet X. Armed with monsters of terrible destructive force, the invaders establish bases on every planet of the solar system. These monsters include the foes Gezora, Moguera, Baragon, Varan, Hedorah, Gigan, Mecha-Godzilla and King Ghidora. To combat the menace, Earth sends two of it's own monsters, Godzilla and Mothra, in order to drive back the invaders of Planet X.</p><p><em>Godzilla</em> is a game of alternating turns between the player and the AI. On each turn, the player may select either Godzilla or Mothra and move them across a hex field map taking place on one of the planets of the solar system. Any tiles of the hex field that are crossed must be battled through by the selected monster during an action sequence with side-scrolling gameplay: dodging obstacles or destroying them, battling smaller enemies and evading projectiles. Enemies and obstacles encountered depend on the terrain type, which include mountainous, jungle, volcano, alien city, underwater and special. Encounters against enemy monsters on the map may also take place. These boss battles last 90 seconds, with either one side's monster being defeated or the turn ending.</p><p>Mothra can move four tiles each turn and has additional mobility through her flying. She fires red laser bolts from her eyes and can unleash special pollen bombs that she drops at an angle downwards. Godzilla can only move two tiles each turn but is the stronger creature. He can punch, kick, swipe with his tail, jump and unleash radioactive breath on everything in front of him.</p>"},{"name":"Gold Medal Challenge '92","year":1992,"developer":"Capcom Co., Ltd.","url":"2#Capcom%27s%20Gold%20Medal%20Challenge%20%2792%20%28USA%29.zip","filesize":1,"score":7.5,"genres":"Sports > Side view > Olympiad / mixed sports","desc":"<p>In 1992 the Olympic Games were held in Barcelona. <em>Gold Medal Challenge ’92</em> gets the player into the Olympic spirit with a selection of sports that played during the Olympic Games.</p><p>After selecting the number of players (1-8) the player needs to select there country out of U.S.A., China, Great Britain, Germany, Bulgaria, Span, C.I.S., Canada, France, Romania, Hungry, and Japan and then CPU makes up the rest of the competition. The sports are divided up into programs that have 2 or 3 different sports each as well as a Special Event, the Marathon. Most of the sports involve pressing A and B buttons quickly or rhythmically, and getting the correct timing to do the needed action.</p><p>The Programs and there included sports are as follows:  </p><p><strong>Program 1:</strong>   </p><p><strong>100-Meter Dash</strong> - Run to the finish as fast as possible.   </p><p><strong>Long Jump</strong> - Run and jump as close to the line as possible and get the right angle. Jump too late and the long jumper will get a foul.   </p><p><strong>100-Meter Backstroke</strong> - Get into the correct rhythm. Unlike the other swim styles, there is no need to take breaths.   </p><p><strong>Special Program:</strong>   </p><p><strong>Marathon</strong> – This event is split up into five parts. In each of the parts the player is given a map with opponent locations and upcoming hills, the distance from the finish line, and the runners condition. From that information, the player must pick the right speed for there runner to run at. If the runner is too quick he will run out of energy and walk the rest of the leg at 4km/h. After each program the player gets the opportunity to adjust the speed of there runner</p><p><strong>Program 2:</strong>  </p><p><strong>200-Meter Dash</strong> - Run to the finish as fast as possible keeping an eye on the runners energy. If runner runs out of energy the runner will stop until he gets it back.   </p><p><strong>Shot Put</strong> - Build up power and throw the shot put as close to the line as possible at the right angle.   </p><p><strong>100-Meter Butterfly</strong>. Get into the correct rhythm and take breaths. When out of air she will sink to the bottom.   </p><p><strong>Special Program:</strong>   </p><p><strong>Marathon</strong> – Part 2</p><p><strong>Program 3:</strong>   </p><p><strong>400-Meter Dash</strong> - Run to the finish as fast as possible keeping an eye on the runners energy. If runner runs out of energy the runner will stop until he gets it back. Harder then the 200 - Meter as the runner needs to conserve more energy.   </p><p><strong>Triple Jump</strong> - Run and jump as close to the line as possible. Time and get the right angle for all three jumps.   </p><p><strong>100-Meter Freestyle</strong> - Get into the correct rhythm and take breaths. When out of air she will sink to the bottom.   </p><p><strong>Special Program:</strong>   </p><p><strong>Marathon</strong> - Part 3</p><p>Program 4:   </p><p><strong>110-Meter Hurdles</strong> - Run as fast as possible and time it right to jump all the hurdles.   </p><p><strong>Javelin Throw</strong> - Run and throw the javelin before line at the right angle. Throw too late and the throw will be a foul.   </p><p><strong>100-Meter Breast</strong> - Get into the correct rhythm and take breaths. When out of air she will sink to the bottom.   </p><p><strong>Special Program:</strong>   </p><p><strong>Marathon</strong> - Part 4   </p><p><strong>Program 5:</strong>   </p><p><strong>Weightlifting</strong> - Select the weight and then try to keep the power over the selected point on the power bar.   </p><p>High Jump - Select the height of the cross bar. Run and time the jump to clear the bar. The higher the bar the faster the high jumper needs to run.   </p><p><strong>Vaulting Horse</strong> - There are a few different vaults the vaulter can do, some requiring a certain run up speed to do well. After the vault the vaulter is given a score based on the speed of approach and the vault performed.   </p><p><strong>Special Program:</strong>   </p><p><strong>Marathon</strong> – Part 5</p><p><strong>Program 6:</strong>   </p><p><strong>4X100-Meter Relay</strong> – All four different swims put together. The swim are done the same as if there were individual   </p><p><strong>200-Meter Medley</strong> – Run as fast a possible. The baton is passed between runners automatically.</p><p>After all the events are completed any world-records that the player as beaten is saved on the battery backed RAM so they can be viewed and challenged in the future. All the sports except the Marathon can be played individually in Training mode.</p>"},{"name":"Golf","year":1984,"developer":"Nintendo Co., Ltd.","url":"2#Golf%20%28USA%29.zip","filesize":1,"score":6.2,"genres":"Sports > Behind view > Top-down > Golf","desc":"<p><em>Golf</em> features two challenging 18 hole courses where players are able to play a round of golf, and allows players to choose a club, adjust stance and control the swing. The game features three alternating views; an overhead long-range view of the entire hole, an overhead medium-range view from the ball's current location, and an overhead close-range view of the green. Gameplay modes include 1 or 2 players.</p>"},{"name":"Golf Grand Slam","year":1991,"developer":"Tose Co., Ltd.","url":"2#Golf%20Grand%20Slam%20%28USA%29.zip","filesize":1,"score":"","genres":"Sports > Top-down > Golf","desc":"<p>This game was made with the intentions of helping the player improve their golf game. You can practice setting up putts, dealing with wind resistance, choosing a strike point on the golf ball, and other technical aspects of golfing in the two training modes the game offers. Once you feel you have enough experience you can enter the Golf Grand Slam, a tournament against 29 other fictitious pro players.</p><p>The game features 4 sets of 14 different golf clubs that you can bring to the course. The golfing is done by lining up a cursor to where you want the ball to land and then choosing the proper golf club, stance, and grip. The last step before taking the swing is finding the correct contact point on the golf ball. The contact point is represented as a dot that scatters around on top of a golf ball icon and you have to try to stop it on the part of the ball where you want your club to make contact with the ball.</p>"},{"name":"Golf-kko Open","year":1989,"developer":"Tose Co., Ltd."},{"name":"Golf: Japan Course","year":1987,"developer":"HAL Laboratory, Inc."},{"name":"Golf: US Course","year":1987,"developer":"HAL Laboratory, Inc."},{"name":"Golgo 13: Top Secret Episode","year":1988,"developer":"Vic Tokai Corporation","url":"1#Golgo%2013%20-%20Top%20Secret%20Episode%20%28USA%29.nes","filesize":262160,"score":6.3,"genres":"Action > 1st-person > Side view > 2D scrolling > Anime / Manga > Shooter > Helicopter > Spy / espionage > Licensed","desc":"<p><em>Golgo 13</em> is a traditional side-scrolling game that uses a third-person view in cutscenes. You play as Golgo 13, the greatest assassin for hire in the world. A vial of the deadliest biological weapon known to man, codenamed \"Cassandra G.\", has been stolen and you need to recover it before someone uses it on the unsuspecting world.</p>"},{"name":"Gomoku Narabe Renju","year":1983,"developer":""},{"name":"Goonies II, The","year":1987,"developer":"Konami Industry Co. Ltd.","url":"1#Goonies%20II%2C%20The%20%28Europe%29.nes","filesize":131088,"score":6.4,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Shooter > North America > Licensed","desc":"<p>In a movie released in the 1980s, a group of youngsters formed a special gang and called themselves The Goonies. Nintendo banked upon the movie’s popularity by releasing several games using the characters and music from it, including the theme song by Cyndi Lauper. This is their second game on NES, The Goonies being released only for the Famicom system outside the United States.</p><p>You play Mikie, one of the gang members, whose friends have been kidnapped by the gang’s arch enemy – the Fratelli family. Your buddies and Annie the Mermaid must be rescued, but it won’t be easy sneaking into the dark and creepy underground hideout where they are being held. You must find a way to destroy their master computer and keep your friends from becoming road kill. If Ma Fratelli or crazy Cousin Pipsqueak doesn’t stop you, one of her two crazy sons will!</p><p>Upon starting the game, Mikie is armed only with a yo-yo and the ability to jump. As the game progresses, he will find boomerangs, a gun, bombs, molotave cocktails and even scuba gear to help him. Fight snakes, spiders, skeletons, man-eating fish while exploring the huge world full of cellars, secret caverns and elaborate mazes.</p><p>There is more than typical side-scrolling action, although there’s certainly a multitude of that. Seventeen magic implements and many secret messages await you. When Mikie enters a room he can talk to NPCs and try to find hidden items and doors by hitting the walls. A password lets you keep your possessions for the next game.</p>"},{"name":"Goonies, The","year":1986,"developer":"Konami Industry Co. Ltd."},{"name":"Gorby no Pipeline Daisakusen","year":1991,"developer":"Compile"},{"name":"Gotcha! The Sport!","year":1987,"developer":"Sanritsu Denki Co., Ltd.","url":"3#Gotcha/Gotcha.nes","filesize":65552,"score":6.2,"genres":"Action > Sports > 1st-person > Side view > Paintball > Licensed","desc":"<p>Gotcha! is an NES Zapper title based on the \"sport\" of paintball, and loosely tied into the paintball-themed movie caper of the same name. You are required to traverse three different battle zones, grab the opposing teams' flag from the opposite end of the field, and make it back to your flag without getting shot.</p><p>One hand controls the Zapper while the other must hold the controller, since the D-Pad controls your movement up and down the field. Limited ammo is also a concern, as is the ability for the computer team to snag your flag and return it to their base to win. You can chase down and tag the flag carrier yourself to prevent this.</p><p>The game contains three difficulty levels and three different zones (woods, city, snowfield) which cycle until you lose all of your lives. Numbers of enemies and their reaction time increase with each cycle. Aside from additional ammo, there are no powerups, no teammates, just you against the computer for a beat-your-highest-score challenge.</p>"},{"name":"Gradius","year":1986,"developer":"Konami Industry Co. Ltd.","url":"1#Gradius%20%28USA%29.nes","filesize":65552,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>The people of Gradius are in trouble. The ameoboid Bacterions have launched an all out attack against the planet, and it's up to you to fly into battle and save them. Along the way you'll be able to power up your ship with hyper speed, force fields, lasers, missiles, double beam cannons and more to help you battle. </p><p><em>Gradius</em> is a side-scrolling shooter. Shooting certain enemies will leave a power up pod behind which can be collected to add more power to your ship. Each level features a wide variety of enemies trying to stop you, with a large boss at the end. Gameplay is for one player or two players alternating.</p>"},{"name":"Great Deal","year":1991,"developer":""},{"name":"Great Waldo Search, The","year":1992,"developer":"Radiance Software"},{"name":"Greg Norman's Golf Power","year":1992,"developer":"Gremlin Graphics Software Limited","url":"2#Greg%20Norman%27s%20Golf%20Power%20%28USA%29.zip","filesize":1,"score":"","genres":"Sports > Behind view > Top-down > Golf > Licensed","desc":"<p>This golf game comes with pre-designed golf courses in locales such as the U.S.A., Japan, England, Scotland, Germany, Spain, France, Australia, and Hawaii. There is also an opportunity for the player to design their own golf course. The game features variable weather conditions like showers, downpours, wind, and sunshine. The game allows for both strokeplay and matchplay. It also allows for three difficulty levels: novice, amateur, and professional. Practice mode lets the player train on the putting green or on a practice hole.</p><p>Gameplay consists of aiming the golf ball and then swinging the chosen golf club. Swinging is done by a meter which measures the power of the shot and determines whether the ball gets hit straight, hooks, or slices. Putting is done with an overhead view on the green with the meter being used to measure the amount of power that is put on a putt.</p>"},{"name":"Gremlins 2: The New Batch","year":1990,"developer":"Sun Electronics Corp.","url":"1#Gremlins%202%20-%20The%20New%20Batch%20%28USA%29.nes","filesize":393232,"score":7.5,"genres":"Action > Isometric > Puzzle elements > Shooter > Licensed","desc":"<p>As Gizmo, you must reach the Gremlin Control Centre to wipe them out. This is an isometric action game differing from the Elite title. You can gain items such as a bow and arrow and matches after each level to help. Mr Wing's Shop also contains many goodies, so watch out for its door magically appearing. Hazards include spiders, electrified wires, ground-mounted hazards, and a boss at the end of each level.</p>"},{"name":"Guardian Legend, The","year":1988,"developer":"Compile","url":"1#Guardian%20Legend%2C%20The%20%28Europe%29.nes","filesize":131088,"score":7.8,"genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>In the far future, Earth is a peaceful place with very few worries.  To ensure it stays that way, a top secret project was authorized: the creation of the guardian suit.  It's a suit of flight armor that allows the guardian to survive any environment.  It's a good thing too, because a giant space station is spotted on a collision course with Earth.</p><p>You take the role of the guardian.  Your mission is to activate the station's self-destruct and destroy it before it collides with Earth.  As you travel through the station NAJU, you'll find increased armor and better weapons to help you defeat waves of enemies.  You'll battle through the station in a human form and also as a jet in certain areas.</p><p>There's also a hidden mode that allows you to play the game in Arcade fashion - only autoscrolling overhead shooting levels, without the on-foot part. New weapons and upgrades are automatically awarded after each level depending on the player's total score. Dying resets the score to zero.</p>"},{"name":"Guerrilla War","year":1988,"developer":"SNK Corporation","url":"1#Guerrilla%20War%20%28USA%29.nes","filesize":262160,"score":6.5,"genres":"Action > Diagonal-down > 2D scrolling > Arcade > Shooter > Direct control > Tank > North America > War","desc":"<p>A tropical island (specified as Cuba in the Japanese original) is being oppressed by a dictator, but fortunately one or two brave US soldiers (Ernesto \"Che\" Guevara in the Japanese version) are on hand to restore justice. March through the rivers, swamps and forests to overthrow the dictator (specified as Batista in Japan) in this evolution of the Commando style.</p><p>The game scrolls vertically, as you move up the screen shooting enemies, finding good strategic firing points and collecting powerups. As the enemy soldiers come towards you in groups, some care is required when picking them off, either using your gun or the grenades. There are also hostages carried by some soldiers, with points bonuses for not shooting these but shooting their captors. Each level ends with a boss.</p>"},{"name":"Gumshoe","year":1986,"developer":"Nintendo Co., Ltd.","url":"2#Gumshoe%20%28USA%2C%20Europe%29.zip","filesize":1,"score":6.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Rail shooter > Crime","desc":"<p>Your daughter, Jennifer, has been kidnapped! You have to help Mr. Stevenson who is on a mission to rescue her. Throughout the levels there are five diamonds you must collect which are needed to complete the final level and rescue Jennifer, with plenty of obstacles and enemies to get in the way. During the game Mr. Stevenson continuously walks to the right and you have to use the light gun to save him from any obstacles blocking his path. Some obstacles can be destroyed with the light gun, others Mr. Stevenson will need to jump over (shooting him with the light gun will cause him to jump.) You have a limited amount of ammo, but more can be obtained by popping the balloons which are scattered throughout the levels.</p>"},{"name":"Gun-Nac","year":1990,"developer":"Compile","url":"1#Gun%20Nac%20%28USA%29.nes","filesize":262160,"score":8.1,"genres":"Action > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>A Galactic Federation starfighter is sent off to destroy an alien armada (led by giant robotic rabbits this time around -- an unusually whimsical theme in keeping with the contemporary Parodius) threatening to collapse your system's sun into a supernova.</p><p><em>Gun-Nac</em> is a top down shooter in which the player controls the Federation starfighter. Power ups and genre mechanics are as could be expected from a \"shmup\". now with collectible money that allows you to shop for different weapons and bombs to complement your standard main gun in the inter-level weapons market. Directional weapons, attachments and up to four bomb types can also be bought to increase your survival chances, further aided by player control over the speed at which your ship moves through the levels. Single player only.</p>"},{"name":"Gun.Smoke","year":1988,"developer":"Capcom Co., Ltd.","url":"3#GunSmoke/Gunsmoke.nes","filesize":131088,"score":6.7,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Direct control > Western","desc":"<p><em>Gun.Smoke</em> is a vertical scrolling shooter that casts the gamer as a lone gunman, out to save the gold rush town of Hicksville from a fearsome group of bandits known as the Wingates. Each level has a particular target enemy, although his henchmen must also be taken out.</p><p>Although it largely takes place on foot, the gameplay resembles Commando, with its diagonal-down action. The screen scrolls at a constant rate, and enemies come at you from the edges, to be shot or avoided. Various power-ups can be grabbed along the way. Finding a horse will allows the player to get hit twice before death rather than just once. There are scenes in which the cowboy rafts up a river and use the tracks of a railway line.</p><p>On the NES the controls work differently with the A button to fire up and right, the B button to fire up and left, or A and B simultaneously to fire straight ahead. One-button control systems mimic all this.</p>"},{"name":"Gyrodine","year":1986,"developer":"Crux"},{"name":"Gyromite","year":1985,"developer":"Nintendo Co., Ltd.","url":"3#Gyromite/Gyromite.nes","filesize":40976,"score":6.2,"genres":"Action > Puzzle > Side view > 2D scrolling > Arcade > Platform","desc":"<p>In Gyromite, you need to help a mad scientist deactivate all of the dynamite in his laboratory before time runs out! ROB the robot will assist you in this game by moving the red and blue pillars blocking the way. Just in case finding your way through the laboratory wasn't enough, be sure to watch out for the deadly Smicks who wander about trying to prevent success of your mission. If you find a radish, pick it up and feed it to the Smicks so you can safely get past them. There is also a second game variation where you need to clear the way for a sleepwalking mad scientist so he can get home safely.</p>"},{"name":"Gyruss","year":1988,"developer":"Konami Industry Co. Ltd.","url":"1#Gyruss%20%28USA%29.nes","filesize":65552,"score":6.6,"genres":"Action > Behind view > Top-down > Fixed / flip-screen > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>The entire solar system is being attacked by the vicious Gyrusians, and it's up to you to save the day! You will need to fly your spaceship to each of the nine planets and then clear three stages of enemies to rid that planet of the Gyrusians. You start the game with a single cannon, but can gain a double cannon after shooting a power up satellite. After clearing each planet, there is another bonus stage where additional weapons and bonus points can be collected. <em>Gyruss</em> is an arcade action shooter, however instead of piloting your spaceship horizontally or vertically, you move in a circle around the perimeter of the screen. The NES version of <em>Gyruss</em> adds to the original arcade version additional music, additional weapons, new enemies, and a large boss at the end of each level.</p>"}]