[{"name":"Halley Wars","year":1989,"developer":"Taito Corporation"},{"name":"Hammerin' Harry","year":1991,"developer":"Irem Corp."},{"name":"Hana no Star Kaidō","year":1987,"developer":"Victor Musical Industries, Inc."},{"name":"Hanjuku Hero","year":1988,"developer":"Bits Laboratory","url":":Hanjuku Hero (Japan)","filesize":87795,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > Free-roaming camera > Real-time > Fantasy","desc":"<p><em>Hanjuku Hero</em> is a real-time strategy RPG game. A king used the power of a mysterious egg to unify a continent. However, he suddenly died a day after the unification, and the countries subjected to his rule revolted. The king's heir, the young prince must work with those few still loyal to the king and learn to use the power of the egg to bring order back to the continent.</p><p>You have to journey throughout the continent with your allies to try and capture enemy castles. Upon reaching a castle, a battle will begin. Battles can also occur in the field. You have no control over these battles, as the stronger team usually prevails. Traditional RPG elements such as HP and money are present. The game has a humorous edge to it, featuring Japanese puns.</p>"},{"name":"Hao Kun no Fushigina Tabi","year":1987,"developer":"Carry Lab"},{"name":"Harlem Globetrotters","year":1991,"developer":"Softie, Inc."},{"name":"Hatris","year":1990,"developer":"Bullet-Proof Software, Inc.","url":":Hatris (USA)","filesize":56686,"score":6,"genres":"Puzzle > Fixed / flip-screen > Real-time > Falling block puzzle > Regional differences","desc":"<p>In <em>Hatris</em>, the falling blocks of Tetris are replaced by falling hats which are top hats, cowboy hats, baseball caps, derbys, party hats and crowns. The setting is a hat factory, where hats are dropped down from a conveyor belt two at a time and must be stacked on one of six mannequin heads. Once five hats of the same kind have been stacked on top of each other, they fall down onto another conveyor belt below and are shipped out of the factory, rewarding the player with a cash bonus (the game keeps track of score as money, not simply points). Once enough hats are shipped out of the shop, the game goes up a level to the next shop. The higher shop number the player gets to, the more types of hats start appearing to make it more difficult for the player to accomplish their task. The game ends when one of the stacks of hats reaches the top of the screen.</p><p>The NES version of the game also features an aid system. Players can receive aid from the avatars of either Alexey Pajhitnov or Vladimir Pokhilko. The aid is earned by completing 5 sets of a hat type (each avatar has 3 hat types dedicated to them) and multiple aid can be stored up til the player chooses to use it. Vladimir can switch hat columns while Alexey can remove hats from the bottoms of the hat columns. At the end of a level, any stored aid can be kept or sold for money.</p><p>The Famicom version of the game contains some differences from the NES version of the game. It doesn't have a point bonus for clearing a set of hats at the same time and there is no aid system. At the end of a level. there is a sale screen, which lets the player choose which hat type they want to sell, which will remove it from the playfield. While the sale screen is seen in other versions of the game, there is no extra points received in the Famicom version.</p>"},{"name":"Haunted: Halloween '85","year":2015,"developer":"Retrotainment Games LLC"},{"name":"Haunted: Halloween '86 - The Curse of Possum Hollow","year":2016,"developer":"Retrotainment Games LLC"},{"name":"Heavy Barrel","year":1990,"developer":"Data East Corporation","url":":Heavy Barrel (USA)","filesize":116646,"score":6.7,"genres":"Action > Diagonal-down > 2D scrolling > Arcade > Shooter > Direct control","desc":"<p><em>Heavy Barrel</em> is a shooter with a top-down view similar to Commando and Ikari Warriors. Terrorists have seized the underground control complex of a nuclear missile site. It is up to the player to infiltrate the installation and eliminate the leader of the terrorist army before they can launch the missiles. To stop the terrorists you will need the powerful weapon Heavy Barrel. The problem is that the weapon still is in the installation. Before the fortress fell the weapon was taken apart and locked in six different storage lockers. To defeat the terrorists you must collect all keys and reassemble the weapon. The game supports co-op for two players.</p>"},{"name":"Heavy Shreddin'","year":1990,"developer":"Imagineering Inc.","url":":Heavy Shreddin'","filesize":64699,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Snowboarding / skiing","desc":"<p>In this snowboarding game, the player goes on various runs completing events on downhill mountains. There are five events in all: Downhill, Slalom, Half-pipe, Moguls and Backwoods.  In Downhill the object is to get down the slope as fast as possible. In Slalom you have to guide the board between the gates. In halfpipe, you have to perform stunts on a half pipe. In Moguls, you have to jump over both small and large moguls. In Backwoods, you'll be given different obstacles to contend with and you'll have to find away to get around them.</p><p>You also earn points by executing various stunts along the way. Stunts you can pull off are a toe grab, hand-plant, mid-air 360, and a mule-kick.</p><p>There are three different peaks, each featuring a couple different runs. The mountain ranges consist of Poseur Peak, Scary Summit, and Mt. Mortified.</p>"},{"name":"Herakles no Eikō II: Titan no Metsubō","year":1989,"developer":"Data East Corporation"},{"name":"Herakles no Eikō: Tōjin Makyō Den","year":1987,"developer":"Data East Corporation"},{"name":"Hi no Tori: Hōō-hen - Gaō no Bōken","year":1987,"developer":"Konami Industry Co. Ltd."},{"name":"Higemaru Makaijima: Nanatsu no Shima Daibōken","year":1987,"developer":"Capcom Co., Ltd."},{"name":"High Speed","year":1991,"developer":"Rare Limited","url":":High Speed (USA)","filesize":113018,"score":6.4,"genres":"Simulation > Top-down > Pinball","desc":"<p><em>High Speed</em> is a conversion of the Williams Electronics pinball game of the same name. The game recreates the pinball table and gameplay from the arcade version and also adds some video game features, such as lightning bombs, attacking enemies, magnetic helicopters, and rust balls which dissolve your flipper. The bottom part of the screen remains on the bottom set of flippers, while the top half scrolls over the whole pinball table to follow the action. Gameplay is for one to four players alternating.</p>"},{"name":"Hirake! Ponkikki","year":1992,"developer":"Minato Giken"},{"name":"Hiryu no Ken III: Go-nin no Dragon","year":1990,"developer":"Culture Brain Inc.","url":":Hiryuu no Ken III - 5 Nin no Dragon (Japan)","filesize":171095,"score":"","genres":"Action > Side view > 2D scrolling > Fighting > Martial arts","desc":"<p><em>Hiryu no Ken III</em> is the third game in the martial arts action RPG series. Ryuuhi, Hayato, Wyler, Shouryuu, and Minmin are known as five dragon warriors, continuing the fight against the evil shadowy organization. In this side-scrolling action game your deadliest weapon is your fighting skill as you will have to bash and punch through hordes of enemy combatants and bosses alike. Game also offers selection among three difficulty settings.</p>"},{"name":"Hissatsu Dōjō Yaburi","year":1989,"developer":"Sigma Enterprises, Inc."},{"name":"Hogan's Alley","year":1984,"developer":"Nintendo R&D1","url":":Hogan's Alley (World)","filesize":15878,"score":6.2,"genres":"Action > 1st-person > Shooter > Crime","desc":"<p>This game involves the use of the Nintendo Light Zapper, and has, truly, no plot. You are in the police station doing target practice, either with three targets at a time with at least one innocent person, or in an alley with both good and bad targets in windows and walking on the sidewalk. Then there's Trick Shot, where you shoot the cans, trying to make them land in a slot for points, or at least not let them fall to the ground.</p>"},{"name":"Hokkaidō Rensa Satsujin: Okhotsk ni Kiyu","year":1987,"developer":"Armor Project"},{"name":"Hokuto no Ken","year":1986,"developer":"Shouei System"},{"name":"Hokuto no Ken 3: Shinseiki Sōzō Seiken Retsuden","year":1989,"developer":"Shouei System"},{"name":"Hokuto no Ken 4: Shichisei Haken Den: Hokuto Shinken no Kanata e","year":1991,"developer":"Shouei System"},{"name":"Hole in One Professional","year":1988,"developer":"HAL Laboratory, Inc."},{"name":"Hollywood Squares","year":1989,"developer":"GameTek, Inc.","url":":Hollywood Squares (USA)","filesize":63685,"score":5.3,"genres":"Strategy > Game show / trivia / quiz > Licensed","desc":"<p>This is a GameTek conversion of the '80s version of the game show <em>Hollywood Squares</em>. Two contestants play a version of tic-tac-toe, with \"celebrities\" filling in for the squares. The selected celeb is asked a question, answers it, and the contestant must agree or disagree with their answer. A correct guess captures that square. After three games, the winning contestant picks a key and a car out of two separate pools, hoping to match the two up and win the car.</p>"},{"name":"Holy Diver","year":1989,"developer":"Irem Corp."},{"name":"Holy Diver (Collector's Edition)","year":2018,"developer":""},{"name":"Home Alone","year":1991,"developer":"Bethesda Softworks LLC","url":":Home Alone (USA) (Rev A)","filesize":80044,"score":4.7,"genres":"Action > Side view > Arcade > Licensed","desc":"<p>Based on the film of the same name, Kevin McAllister has been left home alone for Christmas while his family is on vacation. This would not be so bad except for two burglars, Harry and Marv, aka the Wet Bandits, have decided to burglarize his house. However, Kevin is too smart to play victim and will use the items he has available to make traps for the burglars.</p><p><em>Home Alone</em> is a side scroller. Controlling Kevin, the player must wander around Kevin's house picking up icons representing different kinds of traps. He then drops these icons onto the ground, in the path of one of the burglars, stunning them and earning a score. Once stunned, Kevin can walk past them and continue collecting trap icons.</p>"},{"name":"Home Alone 2: Lost in New York","year":1992,"developer":"Imagineering Inc.","url":":Home Alone 2 - Lost in New York (USA)","filesize":103621,"score":5,"genres":"Action > Side view > Arcade > Licensed","desc":"<p>Loosely based on the film of the same name, Kevin McAllister has arrived in New York City without his parents. However he checks himself into a hotel and begins to have fun. It isn't long before the hotel  discovers he's using stolen credit cards and begin to chase him around! On top of that, Harry and Marv the burglars he once defeated, are in town and looking for revenge.</p><p>Home Alone 2 is a side scroller. Controlling Kevin McAllister, the player will need to jump over enemies and obstacles while collecting items. These items include health bonuses and a variety of weapons. Losing all of Kevin's health or being \"caught\" will cost a life. The player starts with three lives for play.</p>"},{"name":"Hon Shōgi: Naitō 9 Dan Shōgi Hiden","year":1985,"developer":"Random House Co., Ltd."},{"name":"Honey Peach","year":1990,"developer":"Sachen"},{"name":"Hook","year":1992,"developer":"Painting by Numbers, Ltd.","url":":Hook (USA)","filesize":114337,"score":5.8,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Licensed","desc":"<p>In <em>Hook</em>, based on the 1991 film by Steven Spielberg, the player controls Peter Pan who is trying to rescue his children from Captain James Hook. This version differs from the version of the game by Ukiyotei. While also a platformer, the title by Painting by Numbers also includes flying levels as well as one-on-one fight scenes.</p><p>From a map of Neverland, the next level to be played can be chosen via a compass-like pointer. Depending on which ones are tackled first, different paths through the game open up, but all levels must be completed before Hook can be confronted on his pirate ship. The locations include caves, forests, lagoons, towns and icy landscapes.</p><p>Before each level, the fairy Tinker Bell will offer some advice on the goals and challenges to follow.The main goal in every stage is to collect a number of items, like cakes, cherries, coins or peaches, and sometimes a special item like a clock, a tooth and a musical horn. Only when all items have been picked up the level exit will open. Between Peter and the exit there will be various enemies, depending on the type of level: pirates, ghosts, dragons, monkeys, snowmen and many more. To defend himself, Peter can use a sword. Once he has picked up some thimbles, Tinker Bell will start following him, and by using up a thimble he can also send out the fairy to attack. Collecting marbles is also important, as these allow Peter to float along pixie dust, which allows him to reach areas otherwise out of bounds. Lost health is replenished by picking up food.</p><p>Besides the standard platforming levels, there are also underwater areas. In these, Tinker Bell isn't available to help, and having to swim makes it more difficult to get around. Anvils conveniently placed around the area can be held on to to get deeper fast. The only way to refill the health bar is to swim to the surface for air.</p><p>Different areas of Neverland are connected through flying levels. In these, Peter Pan is seen from behind. The Lost Boys send up marbles on balloons which he must pick up to stay afloat, but Hook's men will also send up balloons with dynamite which must be avoided, as must the occasional storm cloud.</p><p>The first fight scene is against Rufio, who must be beaten to collect a magic sword. The final confrontation against Hook is another fight, but unlike Rufio, Hook doesn't play fair and sends out Smee to temporarily immobilize Peter using a ball and chain.</p>"},{"name":"Hoops","year":1988,"developer":"Aicom Corporation","url":":Hoops","filesize":129338,"score":"","genres":"Action > Sports > Diagonal-down > 2D scrolling > Arcade > Basketball","desc":"<p>Hoops is an action basketball game for one or two players.  The game is half court and can be one-on-one or two-on two. You can block shots, pass, steal, or go for a slam dunk. There are two different courts to choose from, and a variety of different players to select.</p>"},{"name":"Hoshi o Miru Hito","year":1987,"developer":"Hot-B Co., Ltd."},{"name":"Hostage: Rescue Mission","year":1989,"developer":"Infogrames Europe SA"},{"name":"Hot Slots","year":1991,"developer":"Hacker International","url":":Hot Slots (Asia) (Unl)","filesize":52517,"score":"","genres":"Gambling > Adult","desc":"<p>This is a simple slot machine simulation. What makes it different are the erotic pictures of naked or half-naked girls, which you get if you successfully complete a casino round and win a lot of money. There are three casinos you can play in, each one leading to different girls and different short scenes and comments from them.</p>"},{"name":"Hottāman no Chitei Tanken","year":1986,"developer":"Use Corporation"},{"name":"Hudson Hawk","year":1991,"developer":"Ocean Software Ltd.","url":":Hudson Hawk (USA)","filesize":123008,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>In this platformer based on the 1991 comedy/action film of the same name, the player takes on the role of Eddie Hawkins, known as \"Hudson Hawk,\" the world's greatest cat burglar. After ten years in prison for a robbery of a government installation gone wrong, Eddie is released, intending to go straight and retire. Unfortunately, fate has other plans.</p><p>Years ago, Leonardo Da Vinci created a machine with the intention of converting common lead into bronze for use on his commissioned sculpture of a horse. Da Vinci got the shock of his life when he found out the machine didn't convert lead to bronze... it converted it to gold. Knowing the ramifications of what the machine could do, Da Vinci broke the crystal that powered it into three pieces and hid them in three of his works: a miniature sculpture of a horse called the Sforza, his sketchbook and notebook called the Codex, and a miniature model of his helicopter design, hoping that they would never again see the light of day.</p><p>Unfortunately, ultra-rich psychotic yuppies Darwin and Minerva Mayflower have found out about the machine and own one piece of the crystal. Planning to flood the market with gold and crush the global economy, they need the remaining crystal pieces and require Eddie's services. To force him to comply, they kidnap his best friend and partner Tommy \"Five-Tone\" Messina and threaten to have him killed unless Eddie fetches them. With no choice, Eddie will have to do the jobs, save his friend, and put an end to the Mayflowers' plot.</p><p>From Rutherford's Auction House in New York, to the Vatican, and finally Castle Da Vinci in Italy, Eddie will have to dodge an odd assortment of enemies, from security guards and guard dogs, to janitors, crazed nuns, balloon-riding henchmen, paparazzi, and kids on bikes. Hawk's sole tool of the trade, aside from a wicked punch, is a baseball, of which he has an infinite supply. He'll use this to subdue enemies, distract guard dogs, and trigger switches. Eddie can also crawl to avoid shots and the occasional security beam. There's also ropes and pipes to shimmy across to avoid traps, and boxes to push and stack to reach those out of reach areas.</p>"},{"name":"Hunt for Red October, The","year":1990,"developer":"Beam Software Pty., Ltd.","url":":Hunt for Red October, The (USA) (Rev A)","filesize":119481,"score":6.1,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Naval / watercraft > Cold War > Licensed","desc":"<p>Based on the movie of the same name, the Soviet Union have been building in secret a Typhoon-class submarine with nuclear strike capabilities. This war machine has been named the Red October. While on its trial run, the captain, Marko Ramius has hijacked the submarine along with it's crew. They plan to defect to the United States. Naturally, such a weapon must not be allowed to fall into American plans, and so orders are issued among the Soviet forces to destroy the Red October. </p><p>You control the Red October during its run for freedom. The game plays as an underwater sidescroller. The Red October submarine can move in any of four directions. The A button fires torpedoes horizontally towards the right and the B button fires missiles vertically, upwards. Additionally, the Caterpillar drive (invisibility) may be activated for short periods of time. The player may also activate a ECM blast that will destroy all nearby offensive weapons. On the screen at all times are displays for Armor (health) and Power (fuel); should either run low, the Red October in danger of being destroyed. Power-Ups to increase or decrease the power of missiles and torpedoes may be found by destroying enemies.</p>"},{"name":"Hydlide","year":1986,"developer":"T&E Soft, Inc.","url":":Hydlide (USA)","filesize":22952,"score":4.8,"genres":"Action > Top-down > Fixed / flip-screen > Action RPG > Fantasy","desc":"<p>An evil demon named Varalys casts a curse upon the princess Ann, turning her into three fairies. You control Sir Jim and set out to find the fairies, and then slay Varalys. Only by vanquishing Varalys can the curse be lifted. Once the princess is restored the kingdom will be saved.</p><p><em>Hydlide</em> is an action game with strong role-playing elements. The player has to explore vast wilderness areas, descending into dungeons and eliminating enemies on the way. Combat system is similar to the one implemented in Ys series: attacking enemies requires the player to \"bump\" into them, at the same time preventing them from attacking the playable character from the sides and the back. The player can change between defensive and offensive stances by pressing a single button. Magic spells can also be used to dispose of the enemies. The player character grows stronger and gains better parameters as he advances in the game.</p>"},{"name":"Hyper Sports","year":1985,"developer":"Konami Corporation"}]