[{"name":"I Am a Teacher: Super Mario no Sweater","year":1986,"developer":"Nintendo Co., Ltd."},{"name":"Ice Climber","year":1985,"developer":"Nintendo Co., Ltd.","url":":Ice Climber (USA, Europe)","filesize":18573,"score":6.3,"genres":"Action > Side view > Arcade > Platform > Regional differences","desc":"<p>In <em>Ice Climber</em> one or two players need to climb their way to the top of 32 different mountains. Each mountain is broken up into eight levels of platforms along with a bonus stage at the top. Attempting to stop the player from making upward progress are different creatures ranging from polar bears to condors, as well as treacherous landscapes with falling icicles, moving platforms, and icy floors. To help out, the players have a weapon, a mallet, which can be used to knock out enemies as well as bust away bricks in the platforms to provide some room to jump up to the next level. When the player finally reaches the top, it's time to move on to the next, more difficult level.</p>"},{"name":"Ice Hockey","year":1988,"developer":"Nintendo R&D3","url":":Ice Hockey","filesize":28238,"score":7,"genres":"Action > Sports > Top-down > Hockey","desc":"<p>Ice Hockey is an action game for one or two players. Start of by selecting a team and customizing your players. Each team member can be one of three player types: small and skinny (very fast, but not good at checking or shooting), very large (slow, but with a strong body check and outstanding shooting strength) or average (medium speed, with average checking and shooting strength). After the teams are set up, it's time to play some ice hockey! Gameplay features a scrolling screen to follow the action, and lets you choose which of the players you wish to control when on defense (on offense you always control the player with the puck). Fights can break out between players, and the loser may end up in the penalty box. There are five different speed settings for the game, and periods can be either 7, 10, or 15 minutes long.</p>"},{"name":"Idol Hakkenden","year":1989,"developer":"Natsume Co., Ltd."},{"name":"Ikari III: The Rescue","year":1990,"developer":"SNK Corporation","url":":Ikari III - The Rescue (USA)","filesize":122926,"score":6.8,"genres":"Action > Diagonal-down > 2D scrolling > Arcade > Direct control","desc":"<p>The presidential candidate's daughter has been kidnapped! It is your job to get past enemy lines and rescue her. This is the third game in the Ikari Warriors series, and features similar arcade/action gameplay. The screen is a top down view which scrolls vertically, with numerous bad guys to defeat. You start the game with just your fists, and as the levels progress you can find weapons and other objects to help you out.</p>"},{"name":"Ikari Warriors","year":1986,"developer":"SNK Corporation","url":":Ikari Warriors (USA) (Rev A)","filesize":64794,"score":6.5,"genres":"Action > Diagonal-down > 2D scrolling > Arcade > Shooter > Tank > War","desc":"<p><em>Ikari Warriors</em> is a vertically scrolling action game where one or two players fight their way through a variety of terrain, such as jungles, rivers, and ruins. Along the way different weapons can be found, including machine guns, grenades, and rocket launchers.</p>"},{"name":"Ikari Warriors II: Victory Road","year":1988,"developer":"SNK Corporation"},{"name":"Ike Ike! Nekketsu Hockey-bu: Subete Koronde Dairantō","year":1992,"developer":"Technos Japan Corp."},{"name":"Ikinari Musician","year":1987,"developer":"Musical Plan Ltd."},{"name":"Ikki","year":1985,"developer":"Tose Co., Ltd."},{"name":"Image Fight","year":1990,"developer":"Irem Corp.","url":":Image Fight (USA)","filesize":125579,"score":7.1,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Direct control > Flight / aviation > Sci-fi / futuristic","desc":"<p>A mysterious alien life form is spreading across the galaxy, trying to conquer the world. It took control of the moon base and is threatening to descend on the Earth. The humans have sent the most advanced fighter jet to oppose the aliens: the OF-1. The OF-1 has the ability to change speed at any time and equip different weapons and pods. OF-1 is humanity's last hope!</p><p><em>ImageFight</em> is a top-down vertically scrolling space shooter. On every level there will be enemy ships, turrets, robots, and other machines shooting projectiles or trying to ram you. But there are also power-ups scattered around in small green containers. You must destroy these containers before you can obtain the power-up. Those power-ups include pods that add extra attack power or speed, new kinds of weapons, the ability to fire in different directions, etc.</p>"},{"name":"Immortal, The","year":1990,"developer":"Sandcastle","url":":Immortal, The","filesize":198179,"score":7.9,"genres":"Action > Diagonal-down > Isometric > Puzzle elements > Fantasy","desc":"<p>Your old mentor Mordamir has disappeared - probably kidnapped. You're not too sure where he might be, but a dungeon is always a good place to look, so you seek out the nearest one and plunge into its depths. Beware: eight levels of traps and deadly enemies await.</p><p><em>The Immortal</em> is an isometric game with puzzle-solving and action combat. Progress is made by encountering a hazard, dying, solving the problem, encountering the next hazard. To solve a level, you have to know its traps and their patterns by heart. The puzzles range from simple avoidance of traps to the correct use of items; you collect objects in an inventory. Every now and then, the game offers a special challenge. For example, you've got to ride a magic carpet through a hallway full of fire traps, or ride a barrel on an underground river. </p><p>The dungeon isn't empty: some friendly characters may have valuable information or trade items, the nasty sort of guys will attack. Combat is fought man-to-man - on the main game map in the original versions; on a special screen in the console and PC ports. Your adversary indicates his next attack a few seconds before he executes it, so you've got time to react appropriately. You can dodge to the left or the right, as well as attack from these two directions. There is no save option in the game, but you may restart each level as often as you like. Levels can be skipped by entering passwords.</p>"},{"name":"Impossible Mission II","year":1989,"developer":"Novotrade Software Kft.","url":":Impossible Mission II (USA) (Unl)","filesize":68255,"score":7.3,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Puzzle elements","desc":"<p>You have 8 hours to prevent Elvin, a psychotic genius, from destroying the world in this sequel to Impossible Mission. Enter Elvin's tower fortress, avoid his robots, assemble security combinations for each tower, recover musical sequences and tie them together into a full melody to reach Elvin's central control room.</p>"},{"name":"Incredible Crash Dummies, The","year":1994,"developer":"Software Creations Ltd.","url":":Incredible Crash Dummies, The (USA)","filesize":159401,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Junkman breaks into the crash test center and kidnaps two of the Incredible Crash Dummies, Daryl and Spare Tire with the intentions of using them for their parts to build his junkbots. Now it's up to Slick and Spin to go and rescue the kidnapped crash dummies.</p><p>In The Incredible Crash Dummies the player alternates between Slick and Spin as they go through five levels with each level containing 2 stages (except for the 4th level which only consists of one). One of the Dummies' legs has been replaced with a wheel while the other Dummy has his legs intact. So the main difference in gameplay is that in some stages the player either rolls throughout it or walks throughout it. The Dummies' arsenal includes an air gun which stuns enemies at close range and an oil gun which shoots and kills enemies at a far range. There are also a few powerups scattered throughout the stages such as the arrow, balloon, and arm powerup.</p>"},{"name":"Indiana Jones and the Last Crusade","year":1991,"developer":"Software Creations Ltd.","url":":Indiana Jones and the Last Crusade (USA) (Taito)","filesize":180696,"score":6.5,"genres":"Action > Racing / Driving > Side view > Top-down > 2D scrolling > Platform > Puzzle elements > Motorcycle > Interwar > Licensed","desc":"<p><em>Indiana Jones and the Last Crusade</em> differs from the two other games with the same name as it is a hybrid of various genres such as platform action, motorcycle racing, puzzle solving and even some adventure elements.</p><p>In <em>Indiana Jones and the Last Crusade</em> you play Indy's role in his search for the Holy Grail, but this time it is you who chooses which step he will take at each part of his quest. For example, in the very beginning you receive a diary about the Grail from Indy's father, who is in Venice. At the same time, you receive a telegram from Marcus saying that the Cross of Coronado is in Portugal on a ship called Coronado, and that he'll meet Indy there. So you have to choose what you'll do first: go to Venice and check about the Grail and your father, or go to Portugal to find Marcus and the Cross of Coronado.</p><p>In the entire game you'll be prompted with these choices, each one leading to different stages throughout the game. Each stage presents different game genres. For example, in Venice you find a scrambled picture of the Grail, and you have to try to put it back together, just like you'd do with the pieces of a puzzle. Besides, in the platform stages, Indy has plenty of movements, as he can punch, kick, walk, run, jump and use his whip.</p><p>The game presents bitmapped pictures of the real movie actors, such as Harrison Ford and Sean Connery.</p>"},{"name":"Indiana Jones and the Last Crusade: The Action Game","year":1993,"developer":"Tiertex Ltd."},{"name":"Indiana Jones and the Temple of Doom","year":1988,"developer":"Atari Games Corporation","url":":Indiana Jones and the Temple of Doom (USA) (Rev A)","filesize":102628,"score":5.4,"genres":"Action > Diagonal-down > Side view > 2D scrolling > Isometric > Arcade > Platform > Interwar > Licensed","desc":"<p>The computer versions of <em>Indiana Jones and the Temple of Doom</em> are conversions of the Atari arcade game based on the second movie in the series. As Indy, the player must complete several cycles of the following three types of levels:</p><ol><li>Mine level: Whip your way through a mine in order to free children that are held captive. Use your whip to swing across chasms, climb ladders, ride along conveyor belts and defend yourself against attacks from Thuggee guards, bats, snakes and the fireball-throwing Mola ram. Escape with the mine cart after you've freed all children.</li><li>Mine cart level: Pick the right route through a network of tracks while riding in a mine cart. Avoid potholes, broken tracks &amp; guards in carts and safely reach the end of the track.</li><li>Temple level: Make your way to the altar and grab the Sankara stone while Mola Ram, bats and Thuggee guards attack you. Watch out for that lava.</li></ol><p>With every cycle the mine &amp; mine cart levels become more complex, the layout of the temple levels is always the same. After several cycles there's a showdown with Mola Ram on the rope bridge.</p>"},{"name":"Infiltrator","year":1990,"developer":"Chris Gray Enterprises Inc.","url":":Infiltrator (USA)","filesize":55746,"score":6.3,"genres":"Action > Simulation > 1st-person > Diagonal-down > Stealth > Helicopter > Spy / espionage","desc":"<p>Jimbo McGibbets is back in the sequel to the original. You play a soldier on a mission to infiltrate the enemy's compound and spy on them.</p><p>The game is broken up in to two parts: Walking around in the enemy camp, or flying missions in your advanced attack helicopter. You can enter enemy huts in the compound and retrieve weapons and information. Use gas grenades on the guards to give yourself time to search rooms.</p><p>Flying your attack chopper presents you with a view out the cockpit and control panel. You will be attacked by numerous airplanes and can attack ground defense systems too.</p>"},{"name":"Insector X","year":1990,"developer":"Hot-B Co., Ltd."},{"name":"International Cricket","year":1992,"developer":"Beam Software Pty., Ltd."},{"name":"Iron Tank: The Invasion of Normandy","year":1988,"developer":"SNK Corporation","url":":Iron Tank - The Invasion of Normandy (USA)","filesize":119757,"score":7,"genres":"Action > Top-down > Arcade > Tank > Historical events > World War II","desc":"<p>In 1944 the United Forces are preparing their final assault on the Normandy coast. The mission is to break through the front lines and destroy enemy headquarters. To spearhead the invasion, they have chosen Paul from Command Unit 88, also known as Iron Snake. To succeed in his mission, Paul will need all the firepower of the mightiest fighting vehicle, the Iron Tank. Iron Tank is played from an overhead view with a scrolling screen. You need to control the Iron Tank and its varied weapons and power-ups to rescue hostages and defeat enemy forces.</p>"},{"name":"IronSword: Wizards & Warriors II","year":1989,"developer":"Zippo Games","url":":IronSword - Wizards & Warriors II (USA)","filesize":171338,"score":6.4,"genres":"Action > Side view > Platform > Fantasy","desc":"<p>The mighty warrior Kuros has defeated the evil wizard Malkil in the previous game. However, Malkil did not perish, and has now taken the shape of the four elements: water, wind, air and fire. Kuros is summoned to the land of Sindarin to destroy Malkil again. In order to accomplish that, he will have to collect the shattered pieces of the legendary Ironsword with the help of the four animal kings, and defeat the elementals who protect Malkil's essence.</p><p>Like its predecessor, <em>Ironsword: Wizards &amp; Warriors II</em> is a side-scrolling action game with platform elements. Kuros uses swords and spells to fight the enemies in his path. He can also jump and crouch, which is often necessary to move through a stage and avoid taking damage. The game world consists of four domains; in each of those, Kuros must find a golden artifact and bring it back to the animal king residing there. This opens the path to the elemental boss guarding the domain, which must be defeated with spells.</p><p>Magic spells can be bought in special locations or found during exploration. They have a variety of functions, e.g. turning enemies into money or food, slowing down enemies, granting Kuros temporary invincibility, or creating fountains that help him reach high areas. Some of these spells disappear after one use, while others consume magic points. Weapon and armor upgrades can also be bought in shops. Kuros can restore his health by eating; food is either scattered throughout the stages or offered at inns.</p>"},{"name":"Ishidō: The Way of Stones","year":1990,"developer":"Software Resources International"},{"name":"Ishin no Arashi","year":1990,"developer":"KOEI Co., Ltd."},{"name":"Isolated Warrior","year":1991,"developer":"KID Corp.","url":":Isolated Warrior (USA)","filesize":139666,"score":7.3,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Max Maverick is the last surviving member of his planet's special forces following a devastating alien invasion. Far from being discouraged, Max takes it upon himself to wipe out the alien menace single-handedly.</p><p><em>Isolated Warrior</em> is a constantly-moving shoot-em-up, or shmup, where the hero is always walking or flying forward from an isometric overhead perspective. The hero has a basic laser gun to start with but collects powerups that can allow the gun to fire in multiple directions. He can also collect bombs that can be launched in multiple directions while jumping, as well as shield powerups.</p>"},{"name":"Itadaki Street: Watashi no Omise ni Yotte tte","year":1991,"developer":"GAME STUDIO Inc."},{"name":"Ivan 'Ironman' Stewart's Super Off Road","year":1990,"developer":"Leland Corporation","url":":Ivan 'Ironman' Stewart's Super Off Road","filesize":82508,"score":6.9,"genres":"Racing / Driving > Diagonal-down > Fixed / flip-screen > Automobile > Off-roading > Track racing > Licensed","desc":"<p>Enter the world of off-road racing as 4 vehicles will face each other, on a series of tracks which are based around flipped and reversed versions of a core selection. Fame, glory and bikini clad women await your victories and the taste of dirt awaits if you fail. Let a computer car beat you and you lose one of your 3 credits.</p><p>Successful races bring more money, which can be used to soup up their machine. Boosts to top speed, grip and acceleration can be purchased, and your nitro boost must be kept topped up. If you are desperate for upgrades, you can buy into your spare credits.</p><p>Only your off-road driving abilities will be enough to pull you to first place in these races. Play alone or with up to 3 other players (depending on the version)  in this classic arcade game.</p>"}]