[{"name":"J.League Fighting Soccer: The King of Ace Strikers","year":1993,"developer":"Graphic Research Co., Ltd."},{"name":"Jack Nicklaus' Greatest 18 Holes of Major Championship Golf","year":1990,"developer":"Accolade, Inc.","url":">Jack%20Nicklaus%27%20Greatest%2018%20Holes%20of%20Major%20Championship%20Golf","filesize":71236,"score":7.1,"genres":"Sports > Behind view > Golf","desc":"<p><em>Jack Nicklaus' Greatest 18 Holes of Major Championship Golf</em> is a 3D golf simulation featuring an 18 Hole course created by Jack Nicklaus himself. Each of the 18 holes are from famous courses around the world and include number 8 at Pebble Beach, number 18 from Muirfield, number 12 from St. Andrews, number 12 from Augusta, number 10 at Riviera, and more. Gameplay is for one to four players and can be either stroke play or a skins game.</p>"},{"name":"Jackal","year":1988,"developer":"Konami Industry Co. Ltd.","url":">Jackal%20%28USA%29","filesize":81285,"score":6.9,"genres":"Action > Racing / Driving > Diagonal-down > 2D scrolling > Arcade > Shooter > Tank","desc":"<p>The enemy army has captured too many of your forces. Being held in P.O.W. camps, these soldiers are effectively out of the war... unless some kind of rescue operation can be mounted. Heavy Forces are too slow and visible to be of any use, but perhaps something smaller and lighter may make it in where larger forces would fail. A small jeep, maybe two, crewed by about 4 people.... minimal enough not to represent too much of a loss and yet suitable enough to aid in rescue. But of course, if these brave men want to succeed AND come back alive; they'll need to fight like animals... they'll need to fight like jackals...</p><p>Jackal is an overhead view jeep game for up to 2 players. The controller moves in four directions, button A fires your grenades (upgradeable to bazooka) and button B your machine gun which ALWAYS fires to the top of the screen. Your mission is to locate facilities where soldiers are being held prisoner, rescue as many as possible, and escort them to a safe landing zone where they will be air transported away. After that, you'll need to fight a boss battle against the enemy to progress.</p><p>The NES version is not a straight port of the original Arcade game, but rather a remake. The Arcade version is a continuous battlefield, but the NES version is divided into 6 stages with a boss fight at the end of each stage. Also, enemy and hazard placements are quite different between versions.</p>"},{"name":"Jackie Chan's Action Kung Fu","year":1990,"developer":"Now Production Co., Ltd.","url":">Jackie%20Chan%27s%20Action%20Kung%20Fu%20%28Europe%29","filesize":142820,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Martial arts > Licensed","desc":"<p>Jackie Chan and his twin sister Josephine were great kung fu fighters in China and trained under a great master. One day when Jackie and Josephine were out walking, the Master's great enemy, The Sorcerer, appeared. The Sorcerer had come to rule over China and knew the twins would stand in his way, so he cast a spell to make Josephine disappear. Now it's up to Jackie Chan to follow after the Sorcerer and battle his minions in order to rescue his sister and save China.</p><p><em>Jackie Chan's Action Kung Fu</em> is a side-scrolling fighting game. Jackie's controls are one button to jump and another one to attack or be used in combination with a direction for a special attack. On his quest, Jackie must punch and kick his way past frogs, ninjas, birds and other enemies. Jackie can acquire special-moves such as the Tornado attack, the 180 degree spin kick, the 360 degree spin kick and the Sky Attack. Other power-ups include energy refills and bonus points.</p>"},{"name":"Jajamaru Ninpō Chō","year":1989,"developer":"NMK Co. Ltd."},{"name":"Jajamaru no Daibōken","year":1986,"developer":"Tose Co., Ltd."},{"name":"James Bond Jr","year":1992,"developer":"Eurocom Developments Ltd","url":">James%20Bond%20Jr%20%28USA%29","filesize":171756,"score":5.5,"genres":"Action > Side view > Puzzle elements > Shooter > Spy / espionage > Licensed","desc":"<p>Based off a cartoon series of the same name, the game puts the player in control of James Bond's teenage nephew, James Bond Jr. Many scientists have disappeared, and it isJunior's task to find them and save the world. Agents have seen missile sites on an island and they believe that Scumlord is responsible. All in a day's work... </p><p>This version of <em>James Bond Jr.</em> is a side-scrolling shooter with puzzle-solving elements. Beside dealing with enemies, the protagonist will also have to complete certain tasks in most levels, such as locating blueprints, rescuing hostages, etc. Sometimes a logic puzzle must be solved in order to advance. Each stage has a time limit.</p>"},{"name":"Janggun-ui Adeul","year":1992,"developer":"Gartist Team"},{"name":"Janken Disk Jō","year":1992,"developer":"Tokuma Shoten Intermedia Inc."},{"name":"Jaws","year":1987,"developer":"Escape","url":">Jaws%20%28USA%29","filesize":37258,"score":4.8,"genres":"Action > Side view > Top-down > 2D scrolling > Shooter > Horror > Licensed","desc":"<p>Loosely based on the fourth movie \"Jaws: the Revenge\", players take control of a ship to sail the ocean in the search for the killer shark.  Along the way, the ship will stop to allow a diver to swim out and kill baby sharks, jellyfish and manta rays to find conch shells.  The conch shells are used to buy upgrades for the boat.  Extra conch shells can be earned in bonus rounds where a sea plane flies over the water to bomb jellyfish (think the bonus rounds of Galaga with reversed perspective).</p><p>The diver will battle Jaws several times in an attempt to wear down his life meter.  If the player is lucky, they can find a submarine to increase their firepower and defense.</p><p>If the diver manages to wear down Jaws' energy, they take back to the boat again, launching strobes into the water in an attempt to lure the shark out of the water.  If close enough, the player can use the boat to ram Jaws in an attempt to kill him and win the game.</p>"},{"name":"Jay and Silent Bob: Mall Brawl","year":2020,"developer":"Interabang Entertainment"},{"name":"Jay and Silent Bob: Mall Brawl (Premium Edition)","year":2020,"developer":""},{"name":"Jeffrey Wittenhagen's Black Box Challenge","year":2016,"developer":"Sly Dog Studios"},{"name":"Jeopardy!","year":1988,"developer":"Rare Limited","url":">Jeopardy%21%20%28USA%29%20%28Rev%20A%29","filesize":107425,"score":6.8,"genres":"Puzzle > Side view > Fixed / flip-screen > Game show / trivia / quiz > Licensed","desc":"<p>Gametek's faithful NES recreation of the long-running international quiz show. Up to three contestants can play at once, with gaps optionally filled in by computer AI. If three human players are engaged, then Player 1 and 2 share the first controller, with the second controller going to Player 3.</p><p>For the first two rounds, six categories with five questions each are randomly selected by the computer to populate the game board. The contestant who answered the last question correctly gets to pick the category and a dollar value, with harder questions being worth more money. Players have ten seconds from the time a question appears to \"ring in\" with the appropriate controller button and answer. </p><p>Answers are built by using the controller to navigate around a grid of letters and \"type\" out the correct answer. Spaces and punctuation are ignored, but spelling and grammar generally must match the expected answer exactly. The contestant has 30 seconds to provide the answer before \"time is up\" and the other players have the opportunity to ring in.</p><p>Final Jeopardy consists of one category, which players bet their current winnings on being able to answer. A single question from that category is asked after the hidden bets have been placed. Again, each player has 30 seconds to provide their answer while the other players are instructed to look away. At the end, scores are tallied and the winner declared.</p><p>Categories in this edition draw from general knowledge and do not follow a specific theme (like the sports or Star Wars editions). Each category will always consist of the same five questions, and the game draws on a limited number of categories. Repeats will appear after a handful of sessions played. Some questions \"current\" for 1987 will also be less obvious decades later, and more difficult than intended.</p>"},{"name":"Jeopardy! Junior Edition","year":1989,"developer":"Rare Limited","url":">Jeopardy%21%20Junior%20Edition%20%28USA%29","filesize":100079,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Game show / trivia / quiz > Licensed","desc":"<p>A conversion of the popular TV game show for younger players ages 7 and up.</p><p>Up to three players can take part in the three-round trivia contest where the answers are given and the contestants must supply the correct question.</p><p>In the first two rounds, six categories of five answers each are randomly chosen by the computer to fill the \"wall\" and the player begins by choosing any one of them.  After the chosen answer is given, the first player to hit his \"buzzer\" gives the response using the controller to move a cursor over an onscreen keyboard, spelling out the question within the time limit.  In the final round, a category is announced and the players each place a bet, up to the limit of their winnings so far, on the final question.  After all players are ready, the final answer is shown and all players give their questions.</p><p>There are three difficulty levels and the computer can supply opponents if desired.</p>"},{"name":"Jeopardy!: 25th Anniversary Edition","year":1990,"developer":"Rare Limited","url":">Jeopardy%21%2025th%20Anniversary%20Edition","filesize":109946,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Game show / trivia / quiz > Licensed","desc":"<p>Based on the television game show of the same name.  The 25th anniversary edition of this quiz show requires you to provide 'questions' in response to the 'answer' clues.  The harder the question the more money it is worth.</p><p>You can play with 1-3 players.  If less than 3 players are competing they may choose whether or not to play against the computer.</p><p>Three skill levels provide  40, 45 or 50 seconds allowed to key in your answer.</p><p>The first part of the \"question\" (WHO IS...or WHAT IS...or WHAT ARE, etc.) will appear with a number/letter grid (not QWERTY).  You response must be the EXACT spelling and tense that the system is looking for or it will not be accepted as a correct \"question\".</p>"},{"name":"Jesus: Kyōfu no Bio-Monster","year":1989,"developer":"Chunsoft Co., Ltd."},{"name":"Jet-Paco","year":2015,"developer":"The Mojon Twins"},{"name":"Jetsons: Cogswell's Caper, The","year":1992,"developer":"Natsume Co., Ltd.","url":">Jetsons%2C%20The%20-%20Cogswell%27s%20Caper%20%28Europe%29","filesize":197800,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Jetsons: Cogwell's Caper</em> is based on the well-known Jetsons property from Hanna-Barbera. In this spin-off adventure, George Jetson is tasked my his employer to put a stop to the profit-making schemes of the rival Cogswell's company. To do this, George must hop from location to location in his jet and conquer each level using the resources available to him, as well as with the assistance of the other Jetson franchise characters.</p><p>Cogswell's Caper is a side-scrolling action game where George Jetson can walk, crouch, and jump (actually, he's too lazy to jump and a jet pack handles the jumping duty for short bursts). Each level is littered with crates and other items that George can pick up and toss at enemies, while finding useful items (and occasionally even more enemies) underneath them. Since the game is set in the futuristic world of the Jetsons, there are also copious switches on walls which activate all kinds of features of the surroundings, such as a switch that reverses gravity for a brief time.</p>"},{"name":"Jimmy Connors Tennis","year":1993,"developer":"NMS Software Ltd."},{"name":"JJ - Tobidase Daisakusen Part 2","year":1987,"developer":"Square Co., Ltd."},{"name":"Joe & Mac: Caveman Ninja","year":1991,"developer":"Data East Corporation","url":">Joe%20%26%20Mac%20-%20Caveman%20Ninja%20%28Europe%29","filesize":118076,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Joe &amp; Mac: Caveman Ninja</em> features the characters Joe and Mac as cavemen ninjas in a multi-level platform area where the player has to jump and club incoming enemies. They can also throw at them from distance using such weapons as boomerangs, bones, fire, flints, electricity and stone wheels. The objective of the game is to rescue a group of girls who were kidnapped by a rival tribe.</p>"},{"name":"John Elway's Quarterback","year":1989,"developer":"Rare Limited","url":">John%20Elway%27s%20Quarterback%20%28USA%29","filesize":34804,"score":5.1,"genres":"Action > Sports > Top-down > Football (American) > Licensed","desc":"<p>In <em>John Elway's Quarterback</em>, it's one player vs. the computer or two human players going head-to-head in single-game American football action. Select your team's home city (there is no NFL or NFLPA license, so there are no real teams or players) and then battle the opposing team for four 15-minute (accelerated real-time) quarters. Graphics are simple: one team has blue uniforms, the other team red ones. The human player gets control of the quarterback on offense and the middle linebacker on defense. The play perspective is top-down and vertical-scrolling. Choose from 9 offensive--mostly passing--plays and 6 defensive plays. Teams have 9 players each.</p>"},{"name":"Jordan vs Bird: One on One","year":1989,"developer":"Imagineering Inc.","url":">Jordan%20vs%20Bird%20-%20One%20On%20One%20%28USA%29","filesize":72120,"score":6.2,"genres":"Sports > Top-down > Basketball","desc":"<p>Two of the greatest icons of the Golden Age of the NBA match up in this game. On one side, the spectacular dunks of Michael Jordan of the Chicago Bulls; on the other, Larry Bird's incredible accuracy from the outside. </p><p>While Bird feels right home at the three-point contest, where five racks with five balls each are placed around the three-point arc and the player must pick each ball and throw in the the best timing possible to get as many points as possible during the 60 second window, only Jordan has the air-time to perform on the slam dunk contest, where the player has a number of dunks at his disposal, each requiring different timing to get the best score from all three attempts from the judges, and win the competition.</p><p>While they are two completely different players, they can still go one-on-one on a half-court match, played to points or with a time duration. Can Bird's stealing and outside shooting ability be a match to Jordan's speed and jumping abilities?</p>"},{"name":"Joshua & the Battle of Jericho","year":1992,"developer":"Wisdom Tree, Inc."},{"name":"Journey to Silius","year":1990,"developer":"Tokai Engineering","url":">Journey%20to%20Silius%20%28USA%29","filesize":114976,"score":7.5,"genres":"Action > Side view > 2D scrolling > Fixed / flip-screen > Arcade > Platform > Shooter > Sci-fi / futuristic > Regional differences","desc":"<p>The year is 0373 in the new space age calendar. The earth's population is growing rapidly and people are now forced to start space colonies. Jay McCray is among those leaving earth and heading to the colony in the Silius solar system. Unfortunately, terrorists have destroyed a research colony there. Jay's father was killed in this attack and now Jay vows to destroy the terrorists responsible and to continue the research his father was working on.</p><p><em>Journey To Silius</em> is a side scrolling platform game. On each level there are a wide variety of robot enemies guarding the terrorist's fortress, along with several weapons to find, which makes the mission easier. There are a total of six stages, each ending with a very large boss.</p>"},{"name":"Journey to the Centre of the Alien","year":2020,"developer":"The Mojon Twins"},{"name":"Joust","year":1987,"developer":"Williams Electronics, Inc.","url":">Joust%20%28USA%29","filesize":19619,"score":6.9,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p>In <em>Joust</em>, players take control of a knight with a lance who rides their flying ostrich (or stork, for Player 2) to do battle against computer-controlled evil knights who ride atop vultures.</p><p>Players must flap their steed's wings to hit the enemy from a higher jousting point to destroy the vulture and its rider. Once the enemy has been hit, an egg falls to one of the platforms below. The heroic knights must destroy the eggs before they hatch and release new and increasingly more difficult knights. The three strengths of enemy knights are Bounder (red knight), Hunter (white knight), and Shadow Lord (blue knight). These enemy knights are not the only challenge to be found in the game. Players must also contend with crumbling platforms, lava trolls who attempt to pull knights into the fire, and the dreaded \"unbeatable\"(?) pterodactyl.</p><p>The game was novel for its time for being one of the few two-player simultaneous games in the arcade.</p>"},{"name":"Jovial Race","year":1991,"developer":"Joy Van"},{"name":"Joy Mecha Fight","year":1993,"developer":"Nintendo R&D1"},{"name":"Jumpin' Kid: Jack to Mame no Ki Monogatari","year":1990,"developer":"Now Production Co., Ltd."},{"name":"Jurassic Boy","year":1994,"developer":"Sachen"},{"name":"Jurassic Park","year":1993,"developer":"Ocean of America, Inc."},{"name":"Just Breed","year":1992,"developer":"Random House Co., Ltd."},{"name":"Juvei Quest","year":1991,"developer":"Birthday"}]