[{"name":"Kabuki: Quantum Fighter","year":1990,"developer":"Human Entertainment, Inc.","url":":Kabuki - Quantum Fighter (USA)","filesize":124953,"score":7.5,"genres":"Action > Platform > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In this futuristic platform game, a computer virus has affected the Earth's defense systems. A lone warrior is transferred into digital data and sent inside the mainframe, where he becomes a Kabuki warrior. Gameplay is similar to other ninja-platformers (such as Ninja Gaiden) but with some interesting modifications, such as using your long red hair as a whip to attack enemies!</p>"},{"name":"Kaettekita Mario Bros.","year":1988,"developer":"Nintendo EAD"},{"name":"Kaguya-hime Densetsu","year":1988,"developer":"Micronics"},{"name":"Kaiketsu Yanchamaru 2: Karakuri Land","year":1991,"developer":"Irem Corp."},{"name":"Kaiketsu Yanchamaru 3: Taiketsu! Zōringen","year":1993,"developer":"Khaos"},{"name":"Kalin no Tsurugi","year":1987,"developer":"Xtalsoft Co., Ltd."},{"name":"Kamen Rider Black: Taiketsu Shadow Moon","year":1988,"developer":"Human Entertainment, Inc."},{"name":"Kamen Rider Club: Gekitotsu Shocker Land","year":1988,"developer":"Tose Co., Ltd."},{"name":"Kamen Rider SD: GranShocker no Yabō","year":1993,"developer":"d&d Corp."},{"name":"Kanshakudama Nage Kantarō no Tōkaidō Gojūsan Tsugi","year":1986,"developer":"Sun Corporation"},{"name":"Karakuri Kengōden: Musashi Lord - Karakuribito Hashiru!","year":1991,"developer":""},{"name":"Karaoke Studio","year":1987,"developer":"Tose Co., Ltd."},{"name":"Karaoke Studio Senyou Cassette Top Hit 20 Vol. 1","year":1987,"developer":"Tose Co., Ltd."},{"name":"Karaoke Studio Senyou Cassette Top Hit 20 Vol. 2","year":1988,"developer":"Tose Co., Ltd."},{"name":"Karate Champ","year":1986,"developer":"Technos Japan Corp.","url":":Karate Champ","filesize":29552,"score":5.6,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Fighting > Martial arts","desc":"<p><em>Karate Champ</em> is an action fighting game for one or two players.</p><p>In one player version the player has to master some skills at a karate school to be able to compete in a karate tournament for the national title. At the end of each match is a bonus round where the winner can earn extra points by knocking down flying objects that are tossed his way, breaking roof tiles/ice blocks or knocking down a charging bull on the beach! </p><p>In Player vs Player (two player) version, players compete against each other at twelve different locations to see who has the best karate skills! To win a match, the player must win two of three rounds by knocking down his opponent with a wide variety of karate moves.A full point or half a point is awarded for knocking the opponent down and the first player to gain a two point lead wins the round. When the 30 seconds time limit for a round ends, the player who has the most points wins. At the end of each match is a bonus round where the winner can earn extra points by knocking down flying objects that are tossed his way, breaking boards or knocking down charging bulls!</p>"},{"name":"Karate Kid, The","year":1987,"developer":"Atlus Co., Ltd.","url":":Karate Kid, The (USA)","filesize":40633,"score":5,"genres":"Action > Side view > Fighting > Platform > Martial arts","desc":"<p>Based on the 1986 John G. Avildsen film, <em>The Karate Kid 2</em>. <em>The Karate Kid</em> is a beat'em up game where the player, as Daniel Larusso, must go through some stages (including bonus ones) from the karate competition to the final battle in Okinawa against Chozen.</p><p>There are different kinds of stages, from the fighting style game (similar to Street Fighter) to the platform type like Kung Fu for NES, it also has some bonus stages in which the player's ability is tested.</p><p>The game also features a One on One mode where two players can fight a single one on one battle to determine a winner.</p>"},{"name":"Karateka","year":1985,"developer":"The Connelley Group"},{"name":"Karnov","year":1987,"developer":"Data East Corporation","url":":Karnov (USA)","filesize":98554,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform > Regional differences","desc":"<p>Jinborov Karnovski (also known as the titular Karnov), is a Russian circus strongman who is collecting all of the pieces of a treasure map so he can become a wealthy man. This Lost Treasure of Babylon is being guarded by the evil dragon Ryu. While the gameplay is basically the same as the other versions, the story for the Famicom version is different. It involves Karnov, who comes from a small town called Cleamina, being called by God to be his envoy. Karnov is tasked with getting rid of the evil troublemaker known as Alakatai.</p><p><em>Karnov</em> features nine stages of side-scrolling action. Karnov's main attack is to breathe fireballs at his enemies. Karnov can collect power-up orbs which can increase the amount of fire he can breathe out. Karnov is also able to jump, with the height being increased by collecting boots. Other items Karnov can carry and use include bombs, ladders, boomerangs, clappers (which destroy minor enemies that are currently on the screen instantaneously), and shields. Occasionally, Karnov will be able to make use of certain items such as wings which let him fly in the air and a scuba gear helmet which lets him swim underwater. Also, scattered throughout the stages are K icons. Collecting 50 of these will reward Karnov an extra life.</p>"},{"name":"Kart Fighter","year":1994,"developer":"Somari Team"},{"name":"Kick and Run","year":1988,"developer":"Taito Corporation"},{"name":"Kick Challenger: Air Foot","year":1987,"developer":"Vap Inc."},{"name":"Kick Master","year":1992,"developer":"KID Corp.","url":":Kick Master (USA)","filesize":149652,"score":7.3,"genres":"Action > Side view > Beat 'em up / brawler > Fantasy > Martial arts","desc":"<p>The evil wizard Belzed and his forces have attacked the kingdom of Lowrel, killed its king and queen and kidnapped princess Silphee. Players take control of aspiring martial artist Thonolan who sets out to rescue Silphee and defeat Belzed.</p><p><em>Kick Master</em> is a side-scrolling platformer in which enemies are defeated by using various kicks and spells. Defeated enemies drop three items that refill Thoalon's health or magic, grant an extra life, damage him or increase his experience. When Thoalan gains a level, his maximum MP is increased and he learns new kicks, such as sliding, flying, roundhouse or butterfly kicks. Along the way, he can also pick up different spells that damage his enemies, protect him or refill his health.</p>"},{"name":"Kick Off","year":1991,"developer":"Anco Software Ltd."},{"name":"Kickle Cubicle","year":1990,"developer":"Irem Corp.","url":":Kickle Cubicle","filesize":131980,"score":7.7,"genres":"Action > Puzzle > Top-down","desc":"<p><em>Kickle Cubicle</em> is a sliding puzzle game in the vein of Adventures of Lolo where the Wicked Wizard King covered the kingdom with ice and hid the people and palaces deep within the ice.</p><p>Armed with his freezing breath, Kickle sets out to save his friends and attempts to rescue the kingdom from this puzzling predicament of perpetual winter.</p><p>Each level has a fixed time limit and enemies that will try and block your progress. The four lands (Garden, Fruit, Cake and Toy) have 17 or 18 puzzles in each. Beat all of those and there is a Special Stage with 30 more challenging puzzles.</p><p>Your main options are to move, make a block of ice and slide a block of ice.</p><p>Objects appearing in puzzles include: * Rock: You cannot go over these but you can use them to stop sliding ice cubes.</p><ul><li>Slippery Ice: Enemies can not go there.</li><li>Base Rock: These can not be destroyed and enemies generate from them.</li><li>Spring: Springs an ice cube across the screen.</li><li>Water Hole: You can't fill or walk across these holes in the ice.</li><li>Breaker: Shatters ice cubes that strike its corners.</li><li>Hammer: Changes ice cube direction and hits enemies.</li><li>Power Rock: Hit this and all enemies will freeze.</li></ul>"},{"name":"Kid Icarus","year":1986,"developer":"Nintendo R&D1","url":":Kid Icarus (USA, Europe)","filesize":64656,"score":7.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform","desc":"<p>Far away in peaceful Angel Land lived a young angel warrior named Pit, who has been given the task of defeating the monstrous Medusa, who wishes to destroy Angel Land and all of the people, and she has started by kidnapping Palutena, the Princess of Angel Land.</p><p>Young Pit must rescue the Princess and restore peace to Angel Land. He will travel from the deep caverns of the Underworld to Medusa's palace in the sky on his journey, and deadly monsters will attack him every step of the way. But he has the power of the Gods on his side! A powerful bow and arrows, Water of Life, and Angel Feathers will assist Pit on his quest to destroy Medusa and save the princess!</p><p><em>Kid Icarus</em> is a platform game where the player goes through several vertically outlaid levels, shooting enemies with his bow on the way and collecting hearts they leave behind. Pit's bow can shoot both forward and upwards. As Pit continues upwards, more and more of the level ends up beyond the bottom of the screen and if Pit falls down out of the screen, he dies. </p><p>The levels contain doors which lead to chambers of various types - some chambers are filled with enemies, some are treasuries which allow Pit to obtain a power-up, some are stores where Pit can buy stuff, some will replenish his health, in some Pit will be able to take a test in hopes of getting a powerful weapon, and finally some chambers give Pit a chance of receiving a strength upgrade, therefore increasing the amount of damage his attacks deal. </p><p>Pit earns experience as he defeats enemies, and he gains levels from this experience. The more levels Pit has, the more maximum health he has. </p><p>Hearts taken from enemies are used in shops to buy various items and power-ups. Items include a protective shield which harms enemies, a more powerful bow, a mallet which allows you to smash the poor Palutena's warriors turned to stone who will later help you to fight a boss, a torch to see yourself in dark areas and others.</p>"},{"name":"Kid Klown in Night Mayor World","year":1992,"developer":"Kotobuki System Co., Ltd.","url":":Kid Klown in Night Mayor World (USA)","filesize":151097,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed > Regional differences","desc":"<p>Kid Klown and his family are on their way to perform in a circus when they meet the magician Night Mayor. He asks Kid Klown to help him open a treasure vault, but Kid Klown, having been warned about the evil magician by his parents, refuses. Not willing to give up so easily, Night Mayor kidnaps Kid Klown's family and dares him to follow him into his world if he ever wants to see his family again.</p><p>Kid Klown in Night Mayor World is a side-scrolling platformer. Kid Klown has to complete several different stages inhabited by various enemies. His most helpful tools are his balloons that he can throw at his enemies, use as a trampoline or cling to in order to float through the air. </p><p>There are various items to be picked up as well, including bonus lifes, health power-ups, strawberries, lightnings that make Kid Klown temporarily invincible and question marks that can have the same effect as any of the other items, but might also reverse the controls.</p><p>After every completed stage, a bonus game can be played in which Kid Klown may win items by throwing balloons at them. The number of balloons available depends on the number of strawberries collected in the previous stage.</p>"},{"name":"Kid Kool and the Quest for the Seven Wonder Herbs","year":1988,"developer":"Vic Tokai Corporation"},{"name":"Kid Niki: Radical Ninja","year":1987,"developer":"Irem Corp.","url":":Kid Niki","filesize":121613,"score":6.9,"genres":"Action > Side view > 2D scrolling","desc":"<p>In this side scrolling action game, Kid Niki must rescue his beloved Princess Margo who has been kidnapped by the Stone Wizard. You are equipped with a Spinning Sword to clear any minions that stand in your way. You can also find a Golden Bell, whose chime slays from a distance, a Silver Bell, which creates an impenetrable shield of sound around you, a Mini-Niki, which grants you an extra life, and a Mini-Princess, which averts one death. There are seven realms you must traverse, each having a boss at the end. The seven bosses are Death Breath, Spike, the Stone Buddha, the Horned Witch, the Green Grub, the Mad Monk, the Samurai Guard, and the Stone Wizard. After you rescue the princess you must chase and defeat the Stone Wizard in the final eigth round.</p>"},{"name":"Kieta Princess","year":1986,"developer":"Imagineer Co., Ltd."},{"name":"Kiki Kaikai: Dotou-hen","year":1987,"developer":"Taito Corporation"},{"name":"Kineko: The Monitor Puzzle - Vol. II","year":1987,"developer":""},{"name":"Kinetic Connection","year":1986,"developer":""},{"name":"King Kong 2: Ikari no Megaton Punch","year":1986,"developer":"Konami Industry Co. Ltd."},{"name":"King Neptune's Adventure","year":1990,"developer":"Color Dreams, Inc."},{"name":"King of Kings","year":1988,"developer":"Atlus Co., Ltd.","url":":King of Kings (Japan)","filesize":126073,"score":"","genres":"Strategy > Diagonal-down > 2D scrolling > Turn-based > Turn-based strategy > Menu structures > Medieval","desc":"<p><em>King of Kings</em> is a turn-based strategy video game featuring war elements. The game has a campaign mode called \"Battle with Lucifer\" where you can play against a computer in four scenarios, and a multiplayer mode where you can freely choose a map and play against a computer or another player, up to four players at the same time.</p>"},{"name":"King of Kings: The Early Years","year":1991,"developer":"Wisdom Tree, Inc."},{"name":"King's Knight","year":1986,"developer":"Denyusya Square Co., Ltd.","url":":King's Knight (USA)","filesize":41625,"score":5.2,"genres":"Action > Top-down > 2D scrolling > Shooter > Fantasy","desc":"<p><em>King's Knight</em> is a fantasy-themed top-down shooter where four heroes have to unite to defeat a dragon and rescue a princess in despair. It was one of the first games published by Square Soft (now one-half of Square Enix). <em>King's Knight</em> is a variation on Konami's Knightmare which sold extremely well.</p><p>The first four stages involve you powering up your characters as far as they can go, picking up shields (to increase defense), boots (to increase speed), swords (to increase attack power), and spell icons (which will be required to be held by everyone for the final storm on the castle), defeating monsters along the way. The power-ups are hidden underneath mountains, rocks, and houses. Nearly everything can be shot at and destroyed. The heroes are, in order:</p><p>Ray Jack, the Knight, who possesses strong attacking power;Kaliva, the Wizard, who is good with magic and jumping;Barusa, the Monster, who has a strong defense; andToby, the Thief, who can move swiftly.</p><p>It is necessary to keep all four heroes alive for the fifth and final stage, because there are certain points that the group cannot get past if one of the party members has died.</p>"},{"name":"King's Quest V","year":1992,"developer":"Sierra On-Line, Inc.","url":":King's Quest V","filesize":329060,"score":7.6,"genres":"Adventure > Side view > Graphic adventure > Puzzle elements > Fantasy","desc":"<p>On a beautiful sunny day, King Graham of Daventry decides to take a stroll in the woods surrounding his castle. When he returns, he discovers with horror that his home, Daventry Castle, has completely disappeared! Graham is at a loss, and wonders how this could have happened, when a talking owl named Cedric appears. He tells him that he saw the whole thing, and that an evil wizard named Mordack whisked the entire castle away, along with Graham's family in it. Cedric offers to take him to his homeland, Serenia, where his master, the wizard Crispin resides. Surely Crispin will be able to help King Graham rescue his family from Mordack's clutches.</p><p><em>King's Quest V: Absence Makes the Heart Go Yonder</em> is an adventure game, and the first from Sierra to use a point-and-click mouse interface. Rather than typing commands on a keyboard to interact with the game world and use the arrow keys to walk around, <em>King's Quest V</em> instead simplifies all actions down to base commands. To access the different cursors, the player can move the mouse to the top of the screen, revealing a hidden menu with each of the different actions, as well as game options and the inventory bag. By clicking the \"Walk\" cursor on the screen, Graham will walk as close as he can to the appropriate area. Clicking the \"Eye\" cursor on items will provide a description, the same as typing \"Look at\". The \"Hand\" cursor is a multipurpose cursor that can be used to push, pull, interact with and pick up objects. The \"Head\" cursor is used to talk to people (and in the strange world of <em>King's Quest</em>, often objects and animals, too). Players can also right-click to cycle through the different available cursors. Inventory that Graham picks up now gets placed into a bag. By clicking on the bag, this opens up a sub-window that displays all the inventory that Graham currently has. In here, players can look at or interact with objects, combine them with other objects, or pick them up to use them in the game environment as another cursor.</p><p>As with most Sierra games, it is quite possible to die. Bumping into witches, poisonous scorpions, falling off edges of cliffs, dying of thirst in the desert, and many other objects, locations and characters will send Graham to an untimely demise. The player must be cautious as they explore Serenia - frequent game saving across multiple files is usually the best course of action to make sure that you don't get stuck or have to start right from the game's very beginning.</p><p>The NES port of King's Quest V retains the icon-based interface and most of the locations, puzzles, and dialogue from the earlier release. Graphics had to be re-drawn with fewer colors and less detail to fit within the restrictions of the hardware, and the artwork in many areas is different.</p><p>This version removes most alternate solutions to puzzles and does not allow many actions that would render the game unwinnable. It also shortens and eliminates several scenes; for example, it is impossible to revisit the wizard in the first house. A few locations (such as the desert) are smaller. Some death sequences have been removed or modified not to include words related to death. Finally, some text descriptions were altered.</p>"},{"name":"Kings of the Beach","year":1989,"developer":"","url":":Kings of the Beach - Professional Beach Volleyball (USA)","filesize":47660,"score":7.5,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Volleyball > North America > Oceania > South America","desc":"<p><em>Kings of the Beach</em> is a two on two beach volleyball game. You must quickly move your team about on the sand performing serves, thumps, and spikes to not only out-perform but also out-smart the opposing team.</p><p>There are 15 levels and 20 challengers to beat, on famous beaches like Rio, Hawaii and Sydney, in order to be crowned <em>King of the Beach</em>. Both cooperative and competitive multiplayer (non-networked) are also supported.</p>"},{"name":"Kinnikuman: Kinnikusei Ōi Sōdatsusen","year":1987,"developer":"Sonata"},{"name":"Kira Kira Star Night","year":2013,"developer":"Riki"},{"name":"Kira Kira Star Night DX","year":2016,"developer":"Riki"},{"name":"Kirby's Adventure","year":1993,"developer":"HAL Laboratory, Inc.","url":":Kirby's Adventure (USA)","filesize":483810,"score":8.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>One day Kirby is surprised to discover that he cannot have any dreams during his customary after-lunch nap. Soon he discovers that King Dedede has stolen the Star Rod, which supplies the energy to the Fountain of Dreams and broken it into several pieces, entrusting each of his allies with one. Kirby has no other choice but to find these pieces and bring dreams back to the Dream Land.</p><p><em>Kirby's Adventure</em> is an action side-scrolling platform game. As the pink puffball Kirby the player explores numerous colorful lands with a variety of enemies to defeat. To help out on his journey, Kirby has the ability to eat enemies and spit them out as projectiles. With certain enemies, Kirby can capture their abilities and e.g. gain a sword, shoot lasers, or even fly around the level. There are seven different stages, each broken up into multiple levels, and sometimes also containing a couple of bonus mini-games. The game cartridge features a battery backup allowing games to be saved without the need for passwords.</p>"},{"name":"Kiteretsu Daihyakka","year":1990,"developer":"Epoch Co., Ltd."},{"name":"Klax","year":1990,"developer":"Atari Games Corporation","url":":Klax","filesize":61247,"score":7.8,"genres":"Action > Puzzle > Diagonal-down > Fixed / flip-screen > Arcade > Falling block puzzle","desc":"<p>An action/puzzle game, the object is to catch assorted color falling tiles and create rows, columns, or diagonals of a single color. Each level requires a different pattern to be made, and the tiles fall faster, more at a time, and in an increasing number of colors as the game progresses.</p>"},{"name":"Knight Lore: Majou no Ookami Otoko","year":1986,"developer":"Tose Co., Ltd."},{"name":"Knight Rider","year":1988,"developer":"Pack-In-Video Co., Ltd","url":":Knight Rider (USA)","filesize":61281,"score":5.6,"genres":"Racing / Driving > 1st-person > Shooter > Licensed","desc":"<p>Based on the television show of the same name, Michael Knight and his special talking car K.I.T.T, aka the Knight Industries Two Thousand, are contacted by Devon with another mission. A U.S. military site has been raided and the P.I.V. bomb stolen by terrorists. By following their projected route, KITT and Michael must race across the roadways of the United States.</p><p>Riding in KITT down the highways, you'll be trying to beat the clock to reach your destinations mostly. KITT, however is the car of the future and doesn't go about unarmed. A Gun weapon, Missiles, Laser and a Jumping ability will all help you. KITT absorbs damage in it's internal shielding and once that's gone, you lose a life. However Devon has contacted other agents of FLAG who will be on the same roadways and will drop power-ups to restore ammo and shields to KITT.</p>"},{"name":"Koko Adventure","year":1993,"developer":"Open Production"},{"name":"Konami Hyper Soccer","year":1992,"developer":"Konami Co., Ltd."},{"name":"Konami Wai Wai World","year":1988,"developer":"Konami Industry Co. Ltd."},{"name":"Koneko Monogatari: The Adventures of Chatran","year":1986,"developer":"Marionette Co., Ltd."},{"name":"Kōryu Densetsu Villgust Gaiden","year":1993,"developer":"Plex"},{"name":"Kōshien","year":1989,"developer":"K. Amusement Leasing Co."},{"name":"Krazy Kreatures","year":1990,"developer":"Bitmasters, Inc."},{"name":"Krion Conquest, The","year":1990,"developer":"Vic Tokai Corporation","url":":Krion Conquest, The (USA)","filesize":114219,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Regional differences","desc":"<p>The Krion Empire chose the year 1999 in which to stage an invasion of earth. The planet's defenses were no match for the alien robot invaders. Fortunately, a witch named Francesca has taken it upon herself to single-handedly free mankind from this scourge.</p><p>The gameplay and artistic style are heavily influenced by the NES Mega Man games (some contend the elements are \"borrowed\" or \"stolen\", in fact). The game is a side scroller in which the heroine can wield a variety of different offensive capabilities (all available from the start of the game), selectable via a subscreen in her quest to wipe out wave after wave of robot invaders throughout the four levels. You also have a limited range broomstick at your disposal for riding across chasms and such.</p>"},{"name":"Krusty's Fun House","year":1992,"developer":"Audiogenic Software Ltd.","url":":Krusty's Fun House (USA)","filesize":116735,"score":6.6,"genres":"Action > Side view > 2D scrolling > Puzzle elements > Licensed","desc":"<p>Krusty the Clown's Fun House has been overrun by rats.  You must help him to herd the rats into trap machines to clear them out.  In order to do so, Krusty must manipulate his environment to set up pathways so that the rats are headed in the right direction.  Objects that Krusty move around include blocks, fans, and pipe pieces.</p><p>The trap machines are operated by other recognizable Simpsons characters:  Bart, Homer, Sideshow Mel, and Corporal Punishment.</p>"},{"name":"Kubo 3","year":2020,"developer":"SJ Games"},{"name":"Kujakuō","year":1988,"developer":"Graphic Research Co., Ltd."},{"name":"Kung-Fu Heroes","year":1988,"developer":"Culture Brain Inc.","url":":Kung-Fu Heroes","filesize":30717,"score":"","genres":"Beat 'em up","desc":"<p>Monsters have taken Princess Min-Min captive and have stolen the 10 treasures of the nameless land the game takes place in, leaving everything in sorrow. Kung-fu Masters Jacky and Lee return from training and must set out to rescue the princess and find the treasures.</p>"},{"name":"Kung-Fu Master","year":1985,"developer":"Irem Corp.","url":":Kung-Fu Master","filesize":29734,"score":6.3,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Martial arts","desc":"<p>Loosely based on a movie, <em>Kung-Fu Master</em> is a side scrolling action game for one or two players, who alternate turns.</p><p>Mr. X has captured the pickpocket Sylvia and it is up to Thomas, a kung-fu master who owns a restaurant, to get her back. She is located on the top floor of Mr. X's castle and Thomas will need to fight his way to the top. Of course, this won't be easy as each floor has many opponents to get past and a floor boss at the end of each level. </p><p>Thomas is able to move left and right, jump, duck, and punch and kick. Enemy projectiles such as knives can be kicked in the air to rebound them towards the enemy. On the top floor resides Mr. X himself.</p>"},{"name":"Kung-Fu: The Way of the Exploding Fist","year":2019,"developer":"Beam Software Pty., Ltd."},{"name":"Kunio-kun no Nekketsu Soccer League","year":1993,"developer":"Technos Japan Corp."},{"name":"Kyatto Ninden Teyandee","year":1991,"developer":"Tecmo, Ltd."},{"name":"Kyōryū Sentai Zyuranger","year":1992,"developer":"Arc System Works Co., Ltd."},{"name":"Kyūkyoku Harikiri Stadium","year":1988,"developer":""}]