[{"name":"L'Empereur","year":1991,"developer":"KOEI Co., Ltd.","url":"1#Empereur%2C%20L%27%20%28USA%29.nes","filesize":393232,"score":6.9,"genres":"Strategy > Top-down > Turn-based > Turn-based strategy > Europe > Historical events > War","desc":"<p><em>L'Empereur</em> is a military strategy game. The game takes place during the violent aftermath of the French Revolution and follows the rise and fall of Napoleon Bonaparte who became one of the most popular and charismatic leaders of France.</p><p><em>Gameplay</em>  </p><p>You start as an officer in charge of the military and local city affairs and later in your career you become the French First Consul and finally the Emperor and take up the responsibilities that come with it. You can only rise in rank if you have gained the support of the people. </p><p>You have to build and organize a loyal military army and lead them into war. Defeat the belligerent neighboring countries and collect taxes and pay stipends on time. But be aware of military uprising, strikes, rebellions and deal with weather conditions a harsh winters and other natural disasters that might occur. You fail if your captured by the enemy or die.</p><p><em>Scenarios</em>  </p><p>The game scenarios that can be selected are based on Napoleon's military life:  </p><ol><li><p>Napoleon's Beginning.  </p></li><li><p>The desire for Power.  </p></li><li><p>The End of the Revolution.  </p></li><li><p>The Glorious Empire.</p></li></ol>"},{"name":"Labyrinth","year":1987,"developer":"Atlus Co., Ltd."},{"name":"Lagrange Point","year":1991,"developer":"Konami Corporation","url":"2#Lagrange%20Point%20%28Japan%29.zip","filesize":1,"score":"","genres":"Role-playing (RPG) > 1st-person > Top-down > Anime / Manga > Sci-fi / futuristic","desc":"<p>In 22th century, mankind has left the Earth. A new space epoch began, called the Isis era. Human beings built an oasis in deep space, a space station called Lagrange Point. From there, they could send expeditions to remote planets and to explore the space. You control a young pilot named Jin. One day, when you descend into Lagrange from your space ship, you are attacked by mysterious robotic invaders. Your task is now to travel through space and to find out the cause of the assault. But you don't even suspect you'll soon be involved in a deep mystery that was destined long time ago...</p><p><em>Lagrange Point</em> is a Japanese-style RPG set in a science fiction environment with space flights. The combat system requires you to use special points (called BP) in order to perform simple attacks, cast spells, and use various techniques that will cost you your HP. You fight random monsters and bosses in turn-based combat viewed from first-person perspective, like in the Phantasy Star series.</p>"},{"name":"Lala the Magical","year":2016,"developer":"The Mojon Twins"},{"name":"Laser Invasion","year":1991,"developer":"Konami Industry Co. Ltd.","url":"1#Laser%20Invasion%20%28USA%29.nes","filesize":262160,"score":"","genres":"Action > 1st-person > Side view > Shooter > Helicopter > Spy / espionage","desc":"<p>In <em>Laser Invasion</em> you are trying to stop the enemy from deploying a new type of super weapon while saving a captured undercover agent.</p><p>The game is a compilation of familiar types of gameplay. The first stage is a helicopter aerial battle similar to Top Gun. The second stage is a first person side-scrolling shooter like Operation Wolf. The third stage is a maze hunt with influences from Golgo 13.</p><p>The game plays out in four levels.</p>"},{"name":"Last Action Hero","year":1993,"developer":"Teeny Weeny Games, Ltd.","url":"1#Last%20Action%20Hero%20%28USA%29.nes","filesize":262160,"score":"","genres":"Action > Side view > 2D scrolling > Licensed","desc":"<p><em>Last Action Hero</em> for the NES adapts the 1993 Schwarzenegger film as a side-scrolling action title.</p><p>Players control action hero Jack Slater through 8 stages. There are two main varieties of level, outdoors and indoors. All levels throw hordes of goons at Jack that respawn endlessly. He can defeat them by punching and kicking or simply evade them by jumping over them and continuing on his way. In outdoors levels, more enemies will usually be part of the background, like cops shooting their guns or homeless persons in trash cans throwing grenades. The indoors levels take place over several floors that Slater can move between by going through doorways. He also must sometimes punch in a door to continue. Most levels include several boss fights against major and minor enemies.</p><p>The levels are all based on the film and include Slater's confrontation with the Ripper, Slater's home, and the film premiere. There is even a stage based on the film's dream sequence starring Slater as Hamlet (\"Hey Claudius, you killed my father. Big mistake!\"), complete with archers and knights as enemies.</p><p>Small scenes between levels tell the story, some of which feature digitized images from the film.</p>"},{"name":"Last Armageddon","year":1990,"developer":"BrainGrey"},{"name":"Last Ninja","year":1988,"developer":"System 3 Software Ltd.","url":"2#Last%20Ninja%2C%20The%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Action > Diagonal-down > Fixed / flip-screen > Puzzle elements > Martial arts","desc":"<p>You are the last living member of your ninja clan after they were brutally slaughtered. Now, you seek to exact revenge on the evil shogun responsible.</p><p><em>The Last Ninja</em> is an action/adventure game set in medieval Japan. The game is shown in isometric view, and the eponymous ninja can walk in four directions, jump, fight the enemies and collect necessary items on his way. </p><p>While fighting, the ninja can use several different blows and block. There are a couple of weapons to find, including smoke bombs and shuriken.</p>"},{"name":"Last Ninja 2: Back with a Vengeance","year":1990,"developer":"System 3 Software Ltd."},{"name":"Last Starfighter, The","year":1990,"developer":"Graftgold Ltd.","url":"1#Last%20Starfighter%2C%20The%20%28USA%29.nes","filesize":65552,"score":"","genres":"Action > Top-down > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>The Last Starfighter</em> is based on the 1984 movie of the same name. The hero must single-handedly pilot an extraordinarily powerful starfighter to destroy an enemy armada. The action takes place in outer space from a side-scrolling perspective where the ship always remains lined up in the middle of the screen but is able to turn forwards and backwards while accelerating and decelerating. The ship can also collapse into a slimmer configuration. Enemies come at you from all directions and in all formations. Shoot them as quickly as possible while also disabling the enemy fleet's starcruisers as best you can.</p><p>The game also features a 2-player mode where each player takes turns fighting the armada.</p>"},{"name":"Law of the West","year":1987,"developer":"Accolade, Inc.","url":"2#Law%20of%20the%20West%20%28Japan%29.zip","filesize":1,"score":7.5,"genres":"Action > Adventure > Behind view > Menu structures","desc":"<p>The West is out of control and a new sheriff is in town.  As you wander through the dusty streets of this cowboy town keeping law and order, you are encountered by many characters ranging from gunslingers to the ladies.  </p><p>You must use your conversation skills to get through each character and if that's unsuccessful, you may have to use your quick draw skills and lay the law down.</p>"},{"name":"LayLa","year":1986,"developer":"dB-SOFT"},{"name":"Lee Trevino's Fighting Golf","year":1988,"developer":"SNK Corporation","url":"2#Lee%20Trevino%27s%20Fighting%20Golf%20%28USA%29.zip","filesize":1,"score":6.4,"genres":"Sports > Behind view > Top-down > Golf > Licensed","desc":"<p>When this golf simulation was released in 1988 the U.S. National Video Game Team said it was \"by far the best video golf simulation available\".</p><p>1 to 4 players can tee it up on either an 18 hole American course or an 18 hole Japanese course. Players 1 &amp; 3 share controller 1 and players 2 &amp; 4 share controller 2.</p><p>Game modes are:* Stroke Play - The winner has the lowest number of strokes through 18 holes.</p><ul><li>Nassau Game - The players compete against each other for points. Presses are allowed.</li><li>Practice - A single player can practice on their favorite hole.</li></ul><p>Swing mechanics are: Press A to start the backswing, press A at the top of the swing, press A at impact. High and low shots can be selected by pressing up or down on the control pad. Right after contact another quick press of the A button at the same time as left or right will apply backspin to the ball. Complete club selection is available with the B button. </p><p>Terrain includes tee, green, fairway, out-of-bounds, water, sand (light and hard), and rough (super, light, heavy and deep).</p><p>There are four available characters:* Pretty Amy - Slow swing speed with fantastic ball control and accurate aiming.</p><ul><li>Big Jumbo - Powerful stroke and a long hitter but good technique is needed to control his shots.</li><li>Super Mex - All-around player with average distance, accuracy and swing speed.</li><li>Miracle Chosuke - Less power than Super Mex but good at putting and unequalled accuracy. He can hit a \"Reverse Miracle Putt.\"</li></ul>"},{"name":"Legacy of the Wizard","year":1987,"developer":"Nihon Falcom Corp.","url":"3#Legacy_of_the_Wizard/Legacy_of_the_wizard.nes","filesize":196624,"score":6.8,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Fantasy","desc":"<p>Long ago, an evil dragon named Keela was imprisoned inside a magical dungeon. However time has passed and the magic that sealed the dragon away is weakening. The Drasle family decides that it's time to destroy the dragon once and for all. However only one weapon is capable of doing this, the Dragon Slayer, which is itself sealed away by four magical crowns. The Drasle family decides to take on this quest, and will use every member of the family in order to accomplish it.</p><p><em>Legacy of the Wizard</em> is a side-scrolling action platform game with light role-playing elements. The player chooses a character from among five different members of the Drasle family. The choices are: Xemm the father and woodcutter, Mayna the magic-using mother, Roas the brave warrior son, Lyll the athletic daughter and Pochi the domesticated monster-pet. Each character has unique abilities (including attack and jumping abilities) and can only use certain items from those collected. Players can travel back to the Drasle household at any point to change characters.</p><p>The object of the game is to enter the large dungeon, itself divided into 5 areas, collecting a variety of items (which as mentioned, can only be used by particular characters) and use them to progress through the dungeon, defeating monsters. Power-ups dropped by monsters include gold, keys, health-restoring bread, magic-restoring potions and health-damaging poison. Gold can be spent on items and other power-ups that are available at various shops hidden inside the dungeon. The player must eventually defeat the four bosses guarding the crowns that seal the Dragon Slayer and then use that weapon to defeat the Kress.</p>"},{"name":"Legend of Kage, The","year":1986,"developer":"Taito Corporation","url":"2#Legend%20of%20Kage%2C%20The%20%28USA%29.zip","filesize":1,"score":5.6,"genres":"Action > Side view > 2D scrolling > Platform > Martial arts","desc":"<p>You play Kage, a skillful ninja in search of rescuing Princess Kiri from the hands of the warlord Yoshi.  Armed only with a sword and 'star knives', you must fight your way through countless henchmen and the occasional boss to complete your task.  Levels include the forest, moat, inside and outside of the castle.  These levels repeat as the seasons change.  The gameplay is side scrolling.  Kage's moves include the ability jump extremely high in the air, grab and climb trees, block and attack with his sword, and throw shuriken.  The game can be challenging at times though because the player dies in one hit.  2-players are supported, but must take turns.</p>"},{"name":"Legend of Zelda, The","year":1986,"developer":"Nintendo Co., Ltd.","url":"1#Legend%20of%20Zelda%2C%20The%20%28USA%29.nes","filesize":131088,"score":8,"genres":"Action > Diagonal-down > 2D scrolling > Fixed / flip-screen > Anime / Manga > Metroidvania > Puzzle elements > Direct control > Fantasy","desc":"<p>In one of the darkest times in the Kingdom of Hyrule, a young, pointy-eared boy named Link takes on an epic quest to restore the fragmented Triforce of Wisdom and save the Princess Zelda from the clutches of the evil, power-hungry Ganon.</p><p><em>The Legend of Zelda</em> marks the first title of the Zelda series. Players must make their way through the various forests, graveyards, plains, and deserts of the Overworld to find the secret entrances of the eight dungeons in an attempt to piece together the broken Triforce. Once all pieces are joined, Link will be able to gain entry to Death Mountain, home of Ganon, and prison of Princess Zelda.</p><p>The game is drawn in a top-down perspective. Link begins his quest in the Overworld, which features forests, mountains and lakes and is divided into several screens. Link can explore the Overworld freely, though when he enters a screen, he will encounter several enemies. He can attack them with his sword. If Link is at full health, he can toss his sword to attack enemies from afar, but when he is hurt, even slightly, he can only fight in melee range. </p><p>Link's health is represented by hearts; initially he can have a maximum of three hearts, but as he progresses in the game, he will find heart containers that increase his maximum health. The enemies are varied - some attack from up close, some shoot projectiles. When killed, they often leave behind an item - a heart to restore energy, rupees that function as money (and can be used to buy stuff in various shops in the Overworld), or bombs which can be picked up and set down to attack enemies or destroy some walls. Some items function as weapons or armor, while others are used to solve puzzles. When enemies are killed, they stay dead and will not re-appear once the screen is entered again. </p><p>To find the Triforce pieces, Link must explore dungeons. Once he finds an entrance to the dungeon and goes in, he must explore the rooms, fight enemies and collect keys until he finds the boss monster he must defeat. He will then be able to pick up a Triforce piece and gain a permanent health increase. Once he does so, however, all the monsters in the Overworld come back to life. </p><p>If Link dies on his quest, he can continue it; he will go back to his start position in the Overworld (or the entrance to a dungeon), but with the items he managed to collect so far. When Link finishes his quest, the player can choose to play the \"second quest\", which is essentially a harder version of the game. </p><p><em>The Legend of Zelda</em> is known for several factors that were advanced at the time: a continuous world that could be freely explored, power-ups that would permanently enhance the main character's abilities, and a battery back-up save feature that allowed players to retain their progress instead of having to start over. The gameplay balanced out frequent action sequences with discovery, secrets, and exploration.</p>"},{"name":"Legendary Wings","year":1988,"developer":"Capcom Co., Ltd.","url":"1#Legendary%20Wings%20%28USA%29.nes","filesize":131088,"score":6.9,"genres":"Action > Side view > Top-down > Arcade > Shooter > Regional differences","desc":"<p>Legendary Wings is an arcade shooter influenced by Greek mythology.  A heroic figure from ancient times thrust into a strange futuristic world, you must fight your way through six levels to defeat \"The Devil\" and save the day.</p><p>The primary gameplay mode is a top-down, vertical-scrolling shooter similar to Xevious and Capcom's own 1943.  Your main weapon is used to attack flying enemies, and your secondary missile weapon is used to attack fixed placement, land-based enemies.  Numerous powerups are available along the way, and these both improve your weapons and your resistance to damage (every \"upgrade\" is worth a free hit from enemies without dying).</p><p>Several secondary gameplay modes (Danger, Lucky, and Palace) are also triggered at key points in the vertical-scrolling mode.  All of the secondary modes are side-scrolling shooters.  The Danger stage requires you to face a gauntlet of enemies, while the Lucky stage is full of powerups, game continues, and other bonuses.  The Palace stage is triggered when you defeat a mini-boss; you must get past the palace defenses before you can face the end-of-stage boss.  And, oh yeah...don't get crushed by those walls!</p>"},{"name":"Legends of Owlia, The","year":2016,"developer":"Gradual Games"},{"name":"Legends of the Diamond","year":1992,"developer":"Tose Co., Ltd.","url":"2#Legends%20of%20the%20Diamond%20-%20The%20Baseball%20Championship%20Game%20%28USA%29.zip","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Baseball","desc":"<p>This baseball game features 30 all-time great baseball players (only 6 are pitchers). There is an exhibition mode which is just a single game and a tournament mode where you pick your players and then the computer pits you against the others in random made teams; win and you advance on to the next game. </p><p>Pitching is done by a behind the batter view. The pitchers can throw the ball with three different speeds; slow, medium, and fast. Also, the fielders are controlled manually.</p><p>You can also choose between an old classic style stadium or a new modern style one. Besides the actual look of the place the only real difference between the two is that it's easier to hit a homerun in the old style stadium.</p>"},{"name":"Lemmings","year":1992,"developer":"DMA Design Limited","url":"2#Lemmings%20%28USA%29.zip","filesize":1,"score":7.8,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Point and select > Fantasy","desc":"<p>Your task is to rescue the Lemmings across 120 levels of fast-paced puzzling. These creatures simply walk blindly through the world in the hope of reaching safety at the end of the level - unfortunately, these levels include steep drops, gaps in the ground, barriers, and rivers amongst other hazards.</p><p>You are in control not of any individual Lemming, but of a cross-hair, which can be moved over any of the Lemmings. Along the bottom is a selection of functions that can be assigned to a Lemming, including climbing, floating, and bashing. You must click to select the appropriate function, then click on the Lemming to activate it. Each level has a different range of skills on offer, a different amount of Lemmings, and a different percentage target in order to progress.</p>"},{"name":"Lethal Weapon","year":1993,"developer":"Eurocom Developments Ltd","url":"1#Lethal%20Weapon%20%28USA%29.nes","filesize":262160,"score":4.8,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p>This version of <em>Lethal Weapon</em> has an emphasis on beating the bad guys with the fists, although Martin Riggs and Roger Murtaugh also have their pistols. There are several pick ups that can be used as weapons: knives, grenades and crates. The player controls Riggs from the start of the game; however, if the player takes Riggs out of the left side of the screen, he’ll swap him for Murtaugh. While out of the screen, the other character gains back some health, so alternating characters is essential to survive. Characters have different stats and abilities: Riggs jumps higher and can pick up knives and his attack is a high kick. Murtaugh is not as agile, but he can pick up crates and attacks with a punch. On later levels enemies drain the characters’ health bar very quickly and once both cops are dead you can use a continue only once. </p><p>The game is divided into 3 levels each 3 stages long. The GameBoy version, however, consists only of the two later levels.</p>"},{"name":"Life Force","year":1987,"developer":"Konami Industry Co. Ltd.","url":"1#Life%20Force%20%28USA%29.nes","filesize":131088,"score":7.7,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>In a distant part of the universe, an alien creature called Zelos was born. As he grew so did his appetite, and soon he began devouring galaxies, planets, and stars by the hundreds. Now your planet has appeared in Zelos' path, and it is up to you and a partner to fly into battle to save your world. </p><p><em>Life Force</em> is an action-packed shooter where there are six levels which alternate between side and vertical scrolling, each of them ending with a powerful guardian. Throughout the game, destroying certain enemies will release power ups which can be used to equip your ship with more powerful weapons, extra speed, and shields. Gameplay is for one player or two players simultaneously.</p>"},{"name":"Little Lancelot","year":1992,"developer":"Ocean Software Ltd."},{"name":"Little League Baseball Championship Series","year":1990,"developer":"SNK Corporation"},{"name":"Little Medusa","year":2018,"developer":"Mega Cat Studios"},{"name":"Little Nemo: The Dream Master","year":1990,"developer":"Capcom Co., Ltd.","url":"3#Little_Nemo_Dream_Master/little_nemo.nes","filesize":262160,"score":7.7,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Based on a comic strip from the 1900s, Nemo is a young boy from London summoned to the kingdom of Slumberland, a fantasy realm filled with strange creatures and dream-like locations.  You soon learn that the King of Slumberland has been kidnapped by the Prince of Nightmares, and you are requested to save him by Princess Camille.  Using your only weapon, a sack of candy, you stun enemies and lull friendly animals into helping you through levels like the Mushroom Forest and Train Land.  This platformer featured licensed characters and artwork from the comic, along with using the animals, such as apes and moles, to traverse through the different terrain.</p>"},{"name":"Little Ninja Brothers","year":1989,"developer":"Culture Brain Inc.","url":"3#Little_Ninja_Brothers/Little_ninja_brothers.nes","filesize":262160,"score":"","genres":"Action > Role-playing (RPG) > Side view > Top-down > 2D scrolling > Fixed / flip-screen > Fighting > Fantasy > Martial arts","desc":"<p>Blu Boltar, lord of the Yoma clan has invaded Chinaland and captured the Emperor. Sending out a TV broadcast across the realm, Blu Boltar declares himself the ruler. Jack and Ryu are the ninja masters of Chinaland, training under their mentor at Mt. Epin. Having heard the news of the Emperor's capture they set out to defeat Blu Boltar and his Yoma Clan.</p><p><em>Little Ninja Brothers</em> is the second game in the Super Chinese series and the first to be a role-playing game. Players, controlling either Jack or Ryu, explore the world map in an overhead view. Random encounters with monsters will give the option to flee or to fight. During combat, gameplay resembles the first Super Chinese game, where players move their character up, down, left and right... and can either punch or do a somersault jump to damage enemies. Additional power-ups, can also be found during the course of battles. Successfully defeating enemies awards experience points and Sen money. Jack and Ryu share experience points so they remain at the same level. A second player can join in at any time and share the experience level of the first player. Sen is the currency of the world and can be spent in the convenience store of each town to increase abilities and buy new weapons. Some of these include throwing stars, special martial arts techniques, swords, projectile attacks and other special powers. Towns also contain people who will give clues and information to Jack &amp; Ryu.</p><p>When bosses are encountered, the gameplay changes to a turn-based system. Each turn, commands are given to Jack &amp; Ryu, which include usage of special items and skills acquired during the game, who then perform actions based on those commands. The enemy's turn takes place the same way. The battle ends when one side of the conflict runs out of hitpoints.</p><p><em>Little Ninja Brothers</em> also features a field meeting mode where Jack and Ryu compete in a variety of sports themed events themed around a foot race. The different modes available for this competition include: a regular Dash, Popping Baloons, Athletic Obstacle Course, Finding a treasure hidden inside rocks, Eating food attached to balloons and finally, Shooting targets with projectiles.</p>"},{"name":"Little Red Hood","year":1989,"developer":"Sachen"},{"name":"Little Samson","year":1992,"developer":"Takeru Co., Ltd.","url":"2#Little%20Samson%20%28USA%29.zip","filesize":1,"score":8.1,"genres":"Action > Side view > Fantasy","desc":"<p>Ta-Keed, the Prince of Darkness, has managed to escape from his supernatural penitentiary where he has had centuries to plot exactly how he will take revenge on those that locked him away. Emperor Hans sends his troops to deal with this threat, but they are no match for the ultimate evil one. As an alternative, the emperor summons the bearers of 4 Magical Bells. These 4 adventurers must make their way to the castle and work as a team if they are to destroy Ta-Keed.</p><p>The first part of Little Samson has each of the 4 characters journeying from his or her home land to the emperor's palace. This gives the player an opportunity to explore that character's unique abilities which will be essential throughout the game.* Samson is a human who is reasonably fast and also possesses magnificent rock climbing prowess. He is able to scale walls and hang across ceilings, and also grab onto walls and ceilings while jumping. His offensive option is the ability to shoot bells straight ahead.</p><ul><li><p>Kikira is the Dragon Lord. Since she has claws, she does not slip on ice. When she jumps, she can also fly for short bursts. She breathes fire in 2 intensities, depending on how long the player holds down the fire button. Her fireballs spread in arc patterns.</p></li><li><p>Gamm is the Rock Lord. Since he is a living rock he is very strong. So strong in fact that spikes do not hurt him, which is very valuable in a number of situations. He is also very slow and has only a short leap. He has a powerful punch.</p></li><li><p>K.O. is the Mouse Lord. He is tiny which allows him to enter areas that other team members can not. He is also extremely fast and the highest jumper of the team. However, he is the weakest member so he can not sustain very much damage. He has the same wall and ceiling traversal abilities as Samson. Offensively, he can drop time-delay bombs.</p></li></ul><p>When all 4 characters reach the emperor's palace, they all jump into Samson's bell. Actually, Gamm and K.O. quietly jump into Samson's bell; Kikira initially refuses. After a brief fight (with the player controlling Samson), Kikira joins the effort. Throughout the rest of the game, the player can switch between any of the 4 characters by entering the sub-screen. Each character has their own power meter. However, all the characters share lives. If the presently selected character loses all of his or her power, then one life is lost. The player must swap between all 4 characters in order to complete the journey.</p>"},{"name":"Lizard","year":2018,"developer":""},{"name":"Lode Runner","year":1984,"developer":"Irem Corp.","url":"1#Lode%20Runner%20%28USA%29.nes","filesize":24592,"score":7.4,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Platform > Direct control","desc":"<p>The Bungeling Empire has stolen a huge cache of gold from its rightful owners, and your mission is to infiltrate its treasury and recapture it. This entails progressing through 150 screens of platforms, ladders and ropes.</p><p>The Empire has sent robotic guards down to protect the gold, and contact with any of these will cost you a life. Your method of escaping them is to press fire to dig a hole in their line of movement, thus causing them to fall in briefly, allowing you to move across the gap safely. Once all the gold has been collected, a ladder allowing you to move onto the next screen is added. Completing these screens often requires forward planning and precision.</p><p>This was one of the earliest games to include a level editor, allowing the creation of new level designs with no programming skill.</p>"},{"name":"Log Jammers","year":2018,"developer":"Mega Cat Studios"},{"name":"Log Jammers (Limited Edition)","year":2018,"developer":""},{"name":"Lone Ranger, The","year":1991,"developer":"Konami Industry Co. Ltd.","url":"3#Lone_Ranger/Lone_ranger.nes","filesize":393232,"score":7.2,"genres":"Action > 1st-person > Side view > Top-down > Western > Licensed","desc":"<p>In the early 1880's in Texas, a man has returned to bring  justice to the outlaw who murdered his brother and his former comrades, the Texas Rangers. His name is the Lone Ranger. The outlaw, whose name is Butch Cavendish, has now kidnapped the President. The time has come for the masked man to begin his journey of adventure for the purpose of safely rescuing the President and avenging the deaths of his brother and former comrades.</p><p>The game takes you through 8 western-themed regions, each with a different objective, all of which brings you closer to your nemesis, Butch Cavendish. The game features many points of view during gameplay. Most of the time, the game is played from a top-down perspective, as you travel through the country and walk through towns. At other times, the game switches to a side scrolling view when you are in a boss stage. On occasion, the view switches to a first person perspective and plays similar to a first person shooter.</p><p>Each bad guy you kill is worth money. You can use money to buy more bullets, dynamite, rifles or a patch up from a doctor. For example, you start with a short barreled gun which you can upgrade to either a medium or long barreled gun. Your gun shoots standard bullets but can also fire silver bullets which are stronger than the standard ones.</p>"},{"name":"Loopz","year":1990,"developer":"Audiogenic Software Ltd.","url":"1#Loopz%20%28USA%29.nes","filesize":131088,"score":7.2,"genres":"Puzzle","desc":"<p>A puzzle game where the main goal is to make loops! Random pieces are presented over a board, including simple lines and corners as well as S bends and other warped shapes, of varying sizes. It is up to the player to link them up in a loop form, then moving on to the next level. Pieces can be placed on any empty space on the grid, and rotated into one of the four main compass directions.</p><p>Any pieces which are not part of the finished loop when a level is completed are left on the screen, so there is value in playing towards 2 distinct loops, to ensure that you have options depending on which pieces are drawn - unlike Pipe Dream there are no clues as to which pieces are coming next.</p><p>Three play modes are available, two of which can be played with two players. Game A is freestyle - simply make loops, gaining extra points for size and style. </p><p>Game B is about unlocking bonus boards of the game by reaching a certain score and uses a bonus multiplier method depending on loop difficulty.</p><p>The third mode of play begins with an already made loop and then removes random pieces of it, so the player has to put them back in when they appear again. It is essentially a memory test and logic puzzle of fitting the pieces back as one remembers - although placing a piece where it seems to fit is also often effective.</p>"},{"name":"Lost Word of JeNnY: Ushinawareta Message","year":1987,"developer":""},{"name":"Lot Lot","year":1985,"developer":"Tokuma Shoten Publishing Co., Ltd."},{"name":"Low G Man: The Low Gravity Man","year":1990,"developer":"KID Corp.","url":"3#Low_G-Man/Low_g_man.nes","filesize":262160,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Sci-fi / futuristic","desc":"<p>The year is 2284, and the human race has perfected space travel and is colonizing the galaxy. To help out, robots of all types are used in exploring new planets. There are even entire planets dedicated to manufacturing new robots. But then an alien race captured one of the robot manufacturing planets and reprogrammed the robots to destroy humans! Now it's up to you to go in and take back the planet. Using a low gravity backpack, you have the ability to jump higher than normally possible. You also have a wide variety of weapons to help battle the robots guarding the planet, and additional weapons can be found by destroying certain robots.  Some robots will be riding in vehicles. If you destroy the driver, you can capture the vehicle to help you out on your mission.</p>"},{"name":"Lunar Pool","year":1985,"developer":"Compile","url":"3#Lunar_Pool/Lunar_pool.nes","filesize":41103,"score":6,"genres":"Simulation > Top-down > Board game > Pool / snooker","desc":"<p>Lunar Ball is a futuristic pool simulation with space age balls and tables. There are 32 different tables set ups to practice your skills on. Unlike normal pool, the tables are designed in several different shapes and sizes, in a miniature golf fashion. You can practice your skills alone or go head to head with another player.</p>"}]