[{"name":"M.C. Kids","year":1992,"developer":"Virgin Games, Inc.","url":"1#M.C.%20Kids%20%28USA%29.nes","filesize":262160,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Hamburglar has stolen Ronald's bag of magic tricks!  In this 2D platformer, it's up to you to play as Mick or Mac and get it back.  Go across various lands and meet McDonald's characters as you travel to places like Ronald's Clubhouse, Birdie's Treehouse, and the Hamburglar's Hideout as you collect Ronald's cards.  </p><p>To kill the many animal enemies you will find, you must collect bricks and throw them. In some sections you will travel along water in a dinghy; also watch for moving platforms and bonus sections, The game features seven different worlds with over 30 main levels and nine bonus levels.</p>"},{"name":"M.U.L.E.","year":1990,"developer":"Ozark Softscape","url":"1#M.U.L.E.%20%28USA%29.nes","filesize":131088,"score":7.3,"genres":"Action > Strategy > Top-down > Board game > Managerial / business simulation > Sci-fi / futuristic","desc":"<p><em>M.U.L.E.</em> is about four hopeful explorers trying to make a fortune on a virgin planet. This is done by producing various goods (Food, Energy, Smithore, Crystite). Each of these goods have their uses: if you don't have enough food, you will have less time during your turn. If you don't have enough energy, your output will be lower. If enough smithore isn't produced, there will be a shortage of M.U.L.E.s. Crystite is the big earner that can make or break your game.</p><p>You start the game by selecting your race. Some are easier to play, some harder. There are three levels of difficulty, in the easiest the game only lasts 6 turns, but the real game is 12 turns. Crystite is not available at the easiest level.</p><p>Each turn starts with land claim. Each player gets to choose a spot of land for themselves from the map. If two players choose the same spot, the player with less money wins. The map consists of different landscape. River is best for producing food, plains for energy, mountains for smithore. Crystite is hidden and must be first found by taking a land sample to the town.</p><p>After the land claim each player takes turns in cultivating their land and do other tasks. They can buy M.U.L.E.s to start production on their land, sabotage other players by buying M.U.L.E.s and letting them loose, try to catch the Wumpus for cash and try to find crystite veins. The time to do these things depends on if the player has enough food. Finally the player goes to the casino and wins a small amount of money, depending on how much time was left.</p><p>After the cultivation phase is the production phase where each land produces an amount of goods depending on a number of factors such as if the player has enough energy in storage, what type of land is used, and some random events such as sunspots that increase energy output. Also, if the same player has plots producing the same goods next to each other, they gain a bonus. Three plots of same production type anywhere on the map by the same player also gives a bonus.</p><p>Third phase is the auction. Here the players buy and sell their goods on open market. Players negotiate the price by moving up and down on the screen. The shop also has prices that depend on how abundant or scarce the goods is. So if there is a shortage of food, the price goes up and vice versa. This allows for various tactics, especially if one player manages to monopolize food, energy or smithore production. If there is no food, others don't have time to change their production types, if there is a shortage of energy, their land won't produce and if there are no M.U.L.E.s they can't change production type on their plot. Hoarding goods also has a drawback in the form of surplus where each turn a percentage of goods is wasted. </p><p>There are a number of random events in the game. Some affect one player, usually the one winning gets small penalties and the losing player(s) get small rewards. The big events that happen randomly are:   </p><ul><li><p>M.U.L.E. goes crazy - the M.U.L.E. on one of the plots runs away losing production for that round plus the money to replace it.   </p></li><li><p>Planetquake - production of smithore and crystite is much lower.  </p></li><li><p>Fire in store - all stock in the shops are destroyed (which means prices will skyrocket, but if you needed to buy something, you are at the mercy of other players).  </p></li><li><p>Pirate attack - pirates steal all crystite from stores and players (in the easiest level they steal smithore). Nasty if you happened to have a lot of them waiting for better prices.  </p></li><li><p>Acid rain storm - affects the plot under the storm and below it by boosting food production and decreasing energy production.  </p></li><li><p>Sunspot activity - increases energy production.  </p></li><li><p>Pest attack - eats all food on one plot.  </p></li><li><p>Meteor strike - destroys the M.U.L.E on the plot it strikes but creates a very rich crystite plot.</p></li></ul><p>The game always has four players, with 1-4 human players possible and the rest played by the AI. Because the players only need two buttons at most (up/down in auction) in auction, it's easy to play with four people around the computer.</p>"},{"name":"M.U.S.C.L.E.","year":1985,"developer":"Tose Co., Ltd.","url":"2#M.U.S.C.L.E.%20-%20Tag%20Team%20Match%20%28USA%29.zip","filesize":1,"score":5.4,"genres":"Sports > Diagonal-down > Wrestling > Licensed","desc":"<p><em>M.U.S.C.L.E.</em> (Millions of Unusual Small Creatures Lurking Everywhere) is an early NES wrestling game based on the line of toys popular in the 1980s. <em>M.U.S.C.L.E.</em> allows you to choose two wrestling stars from the M.U.S.C.L.E. universe (from a selection of eight) in a tag-team match tournament in one player mode, and versus a friend in two player mode. Each wrestler has one special move that can be used by collecting the power pellet that floats around the ring at random instances.</p>"},{"name":"Mach Rider","year":1985,"developer":"Nintendo R&D1","url":"1#Mach%20Rider%20%28Europe%29.nes","filesize":40976,"score":6.1,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control > Cyberpunk / dark sci-fi > Post-apocalyptic","desc":"<p><em>Mach Rider</em> is a motorcycle combat game set in a post-apocalyptic future. Players, represented by Mach Rider, must make their way across ten sectors to reach the city before it gets taken over by the enemy. Aggressive drivers try to force players off the road; obstacles, such as rocks, and the road's many turns also can cause players to veer off course. If destroyed, Mach Rider will reform himself so that he can continue.</p><p>There are three different play modes in <em>Mach Rider</em>.</p><p>On the Fighting Course, there are two paths to choose from. The goal must be reached while shooting down enemies or forcing them off the road; more points are rewarded by bumping off enemies. Unlimited lives are available for the first stage, but remaining courses must be finished in three lives or less.</p><p>On the Endurance and Solo Courses, there is a certain distance that must be gone before the time runs out. Enemies are on the Endurance Course, but the Solo course is devoid of enemies.</p><p>There is also a level editor (similar to the one in Excitebike) that allows creation of Endurance Course tracks, which are erased once the NES is turned off.</p>"},{"name":"Mad Max","year":1990,"developer":"Gray Matter Inc.","url":"1#Mad%20Max%20%28USA%29.nes","filesize":262160,"score":5,"genres":"Action > Racing / Driving > Diagonal-down > Arcade > Oceania > Post-apocalyptic > Licensed","desc":"<p>You are Mad Max. You drive your Interceptor through the post-apocalyptic wastelands and fight bandits.The game introduction is the speech from the beginning of the movie Mad Max 2 (a.k.a The Road Warrior), telling you how the world ended and how The Road Warrior, lost everything by \"the roar of an engine\" and how he in the wastelands \"learned to live again\".The game is played in a top-down view where you move your car to attack enemy cars and pick up fuel tanks (if you run out of fuel the game is over).</p>"},{"name":"Mafat Conspiracy, The","year":1990,"developer":"Aicom Corporation","url":"1#Mafat%20Conspiracy%2C%20The%20%28USA%29.nes","filesize":262160,"score":6.9,"genres":"Action > 1st-person > Side view > Anime / Manga > Shooter > Spy / espionage > Licensed","desc":"<p>You play as Golgo 13 aka Duke Togo, ace sharpshooter and assassin. Based off a character of various manga comics, Golgo is a down-to-business man at the end of a gun. Stuck in the world of espionage among such groups as the FBI and the CIA, Golgo is constantly in mortal danger, and a lethal weapon in his own right. </p><p><em>The Mafat Conspiracy</em> is the sequel to the NES game Top Secret Episode. In this chapter, Golgo must track down a missing satellite from the SDI laser defense system, as well as rescue a top scientist and stop those who would use the satellite for blackmail and terror on the world's nations. </p><p>While Golgo is outdoors, the game is a side-scrolling romp where the player can fire and jump. This changes when Golgo enters a building, at which point the game switches to a first person 3D maze. Navigating past soldiers and between floors, Golgo collects various clues to advance the storyline. There is also a driving sequence, and several sniper sequences in which precision aiming is required.</p>"},{"name":"Magic Candle, The","year":1992,"developer":"Japan Soft Technology"},{"name":"Magic Darts","year":1991,"developer":"Romstar, Inc.","url":"2#Magic%20Darts%20%28USA%29.zip","filesize":1,"score":"","genres":"Sports > 1st-person > Darts / target shooting","desc":"<p>Magic Darts contains six different games of darts; 301, 501, 701, Count Up, Round the Clock and Half It. In the 301, 501, and 701 games you can choose the open or double rules. You can choose to be one of 10 characters (a monkey,alien, and a robot are just some of the choices of characters available). Throwing a dart depends on four different factors: position, curve, angle and power. The game allows up to four players to compete against one another.</p><p>In the 301, 501, and 701 games the point is to get the score down to exactly zero.In Count up, the players compete to see who can achieve the highest score.In Round the Clock, players must try to hit the numbers one  through twelve in sequential order.In Half It, players begin with 40 points. Players have three chances to hit the assigned numbers to add to their own score. If the player is unable to hit all assigned numbers, their point total will be cut in half. The player with the highest score wins. The assigned numbers are 16, double ring, 17, 18,triple ring, 19, 20 and the bullseye.</p>"},{"name":"Magic Johnson's Fast Break","year":1990,"developer":"Arcadia Systems, Inc.","url":"3#Magic_Johnsons_Fast_Break/Fast_break.nes","filesize":262160,"score":6.2,"genres":"Sports > Side view > Basketball > Licensed","desc":"<p>Magic Johnson's Fast Break is fast-paced two-on-two action rather than the usual five-on-five contest. On screen you get a full-court, horizontally-scrolling gameplay. A referee monitors the action and calls the fouls if the gameplay gets too rough, and a crowd cheers you on.</p><p>Your team starts each game at a certain salary level. Your goal is to beat the opposition to earn a larger salary. Keep winning and you might etch your name onto the Big Earners Screen. Choose from five skill levels - Rookie to Professional. Each level provides quicker gameplay, tougher defense, and bigger bucks if you win.</p><p>Each game lasts four three-minute, real-life quarters. In between quarters, you can review stats such as field goal percentage, three-pointers made, rebounds, and steals. If the score is tied at the final buzzer, you play additional quarters until someone wins.</p><p>You control one player at a time. An arrow appears on-screen above the head of the player you're running. Just hit B to switch players. You can play against the computer or up to three friends.</p>"},{"name":"Magic of Scheherazade, The","year":1987,"developer":"Culture Brain Inc.","url":"1#Magic%20of%20Scheherazade%2C%20The%20%28USA%29.nes","filesize":262160,"score":7.1,"genres":"Action > Role-playing (RPG) > Top-down > Turn-based > Fantasy","desc":"<p>The evil wizard Sabaron summoned a horde of demons to invade Arabia. One brave magician tried to fight Sabaron, but was trapped in the holes of time. This magician is you. Traveling through different time periods, you'll have to stop Sabaron's evil plans and to rescue the beautiful princess Scheherazade he kidnapped.</p><p><em>Magic of Scheherazade</em> is a mixture of action- and turn-based combat RPG styles. Wandering through Arabia, you'll encounter enemies whom you'll fight in real time, using various weapons. You'll also be attacked by enemies with whom you'll engage in strategic, party-vs.-party combat. You can choose from three character classes: Fighter, Saint, and Magician. Each class has its own special abilities that you'll use in battles as well as during your exploration of the game world.</p>"},{"name":"Magician","year":1990,"developer":"Eurocom Developments Ltd","url":"1#Magician%20%28USA%29.nes","filesize":262160,"score":7.3,"genres":"Action > Role-playing (RPG) > Side view > Fantasy","desc":"<p>Merlwood was once a land of peace and prosperity. The people lived in harmony with one another and with their surroundings, thanks to the benevolent influence of the native wizards and their magical arts. All was calm until one ambitious wizard named Abadon began to lust for power. Abadon overwhelmed the other wizards, brought evil upon the land, and made himself its master. Only Paul, a young magician's apprentice, was left to oppose him. Can you guide Paul to victory, or will Abadon rule Merlwood forever?</p><p><em>Magician</em> is a 2D, side-scrolling action RPG. As Paul, you must travel through towns, have conversations with non-player characters, acquire and manage inventory (food, water, weapons, potions, etc.), learn magic spells, fight battles, and solve puzzles. Your ultimate goal: collect each of the four elemental vials -- earth, air, fire, and water -- and combine them to create the Ultimate Potion. Only then can you hope to vanquish the evil wizard Abadon!</p>"},{"name":"MagMax","year":1986,"developer":"Nihon Bussan Co., Ltd.","url":"1#Magmax%20%28USA%29.nes","filesize":40976,"score":5.6,"genres":"Action > Diagonal-down > Side view > 2D scrolling > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>An alien menace has attacked the worlds of civilization and laid waste to their planets. However, before being conquered, a group of scientists has managed to create one last weapon and hide it underground. The name of the weapon is Mag Max and only it might be able to defeat the alien invaders. Mag Max however is incomplete and for security reasons, his component parts are scattered across the land. Through their collection, Mag Max's strength increases.</p><p>Mag Max is a side-scrolling shooter game. At the beginning, Mag Max is only a tiny little fighter craft that can fire low-powered projectiles. As component pieces (such as a head, legs and a laser lance) are found, Mag Max's offensive power increases. The underworld can be accessed through small dark craters on the landscape. Once in the underworld, Mag Max's weapons vary slightly as do the enemies (there are no stationary objects underground). Enemy fire or contact on each of the components will destroy that component. Fire on the main fighter will destroy Mag Max. At the end of each level awaits a boss creature.</p>"},{"name":"Magnilo Case, The","year":2021,"developer":"Dalyen Retro Games"},{"name":"Mahjang Companion","year":1990,"developer":"Thin Chen Enterprise"},{"name":"Mahjong","year":1983,"developer":"Nintendo Co., Ltd."},{"name":"Mahjong Block Jongbou","year":1987,"developer":"SNK Corporation"},{"name":"Mahjong Taikai","year":1989,"developer":"KOEI Co., Ltd."},{"name":"Maison Ikkoku: Omoide no Photograph","year":1988,"developer":"Micro Cabin Corp."},{"name":"Majō Densetsu II: Daimashikyō Galious","year":1987,"developer":"Konami Industry Co. Ltd."},{"name":"Major League Baseball","year":1988,"developer":"Atlus Co., Ltd.","url":"2#Major%20League%20Baseball%20%28USA%29%20%28Rev%20A%29.zip","filesize":1,"score":"","genres":"Sports > Diagonal-down > Baseball > Licensed","desc":"<p>Baseball game featuring full major league rosters of all 26 teams of the 1987 baseball season.  The players, however, are never identified by name, only by jersey number.  Oddly enough, the statistics for the players are very close to, but not exactly, the same as their real-life counterparts.  Close enough that it is possible to identify who each player is supposed to be, though they are represented only by a position (infield/outfield/catcher/pitcher), a number, and a stat line.</p><p>There is no season mode, but you can play a regular season game, an All-Star Game (you pick your own All-Stars from the team rosters), or a World Series.</p><p>Before each game begins, you set your lineup and starting pitcher from your chosen team's roster.</p><p>Gameplay is the standard behind-the-catcher viewpoint for pitching and batting, switching to different views after the ball is hit.</p>"},{"name":"Maniac Mansion","year":1988,"developer":"Lucasfilm Games LLC","url":"1#Maniac%20Mansion%20%28USA%29.nes","filesize":262160,"score":7.7,"genres":"Adventure > Side view > 2D scrolling > Graphic adventure > Puzzle elements > Point and select > Comedy","desc":"<p>The Edison mansion has always been a creepy old house on the edge of town. There have been rumors of strange experiments going on and of odd creatures living amongst the Edison family. There is even a story that a meteorite once crashed near the home nearly 20 years ago. More immediately, a girl named Sandy has gone missing from the local highschool and her boyfriend Dave swears that he saw Dr. Fred abducting her. Dave knows that he cannot do it alone and will need help from two other students if he has any hope of infiltrating the mansion and rescuing Sandy.</p><p>Players start by choosing two students to accompany Dave to the Edison mansion, and can then switch between these three characters at will. Most actions are carried out by selecting verbs on the screen and applying them to an object (such as \"OPEN Door\"). Each character maintains a separate personality and may have a different way to solve a problem from his classmates. Thus many of the puzzles can be overcome in different ways depending on the character being used. If any one of the kids are captured by the Edisons, they are thrown into the dungeon and must be rescued themselves by any character who still has their freedom.</p>"},{"name":"Mappy","year":1984,"developer":"Namco Limited"},{"name":"Mappy Kids","year":1989,"developer":"Namcot"},{"name":"Mappy-Land","year":1986,"developer":"Tose Co., Ltd.","url":"1#Mappy-Land%20%28USA%29.nes","filesize":163856,"score":"","genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Mappy the mouse has a girlfriend named Mapica. In order to please his girlfriend, Mappy goes on a mission to collect gifts for his significant other. Unfortunately the boss cat Nyamco and his legion of pink cats want to track Mappy down so they can make a meal out of him.</p><p>The goal of the game is to collect six of one item in each stage without getting eaten by a cat. The items that the player collects (either pieces of cheese, wedding rings, Christmas trees, or baseballs) vary depending on what stage is being played. There are also stage specific items in the background that will help the player defeat their feline adversaries.</p>"},{"name":"Marble Madness","year":1989,"developer":"Atari, Inc.","url":"1#Marble%20Madness%20%28USA%29.nes","filesize":131088,"score":7.2,"genres":"Action > Puzzle > Diagonal-down > Isometric > Arcade > Direct control","desc":"<p>The idea of this arcade game is deceptively simple: Guide a marble down a path without hitting any obstacles or straying off the course. The game is viewed from an isometric perspective, which makes it harder to stay focused on the direction the ball is to follow. There are tight corridors to follow and enemies to avoid. There is a 2-player mode in which players must race to the finish; otherwise you're racing against the clock.</p>"},{"name":"Märchen Veil","year":1987,"developer":"System Sacom"},{"name":"Mario Bros.","year":1983,"developer":"Nintendo Co., Ltd.","url":"1#Mario%20Bros.%20%28Europe%29%20%28Rev%20A%29.nes","filesize":24592,"score":7,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p>Mario and Luigi, the best plumbers in the world, have a real job on their hands. A host of characters have taken over the sewers, and the brothers must clear them out of the pipes.</p><p>The platform puzzle which first introduced Luigi to the world has both single and multiplayer action with two differing game types, but with the same objective.Crabs, turtles and fighter flies must be cleared out by jumping underneath the platform they sit on, then kicking them away. Each level is cleared when a set number of coins is collected.</p><p>For the two player mode, the first to collect the set amount of coins wins.</p>"},{"name":"Mario is Missing!","year":1993,"developer":"Radical Entertainment Inc.","url":"1#Mario%20Is%20Missing%21%20%28USA%29.nes","filesize":262160,"score":5.7,"genres":"Educational > Side view > Geography","desc":"<p>Bowser, the token bad guy from the Mario Bros. series, is up to no good again in this educational game designed to teach children geography. This time he's set up his headquarters in Antarctica and created portals to 25 famous cities around the world, so that his Koopas can wreak havoc in our own world. He's also kidnapped Mario, hence the title of this game. You play as Luigi who must foil Bowser's plans by entering through each of the portals, tracking down the Koopas who have stolen famous artifacts, and looking for clues about your location. Once you've set everything right and determined where you are, you call Yoshi on your Globulator so he can track you down. You need Yoshi's help to eat the Pokey (a cactus-like creature) that's guarding the return portal, and when Luigi returns he can close the portal forever.</p><p>By exploring these 25 cities, children can familiarize themselves with the landmarks and artifacts that each city has. When Luigi returns the stolen artifacts to the proper places he can even take photographs of them. There is also an add-on disk you can purchase that adds ten additional cities to the game.</p>"},{"name":"Mario Open Golf","year":1991,"developer":"Nintendo R&D2"},{"name":"Mario's Time Machine","year":1994,"developer":"Radical Entertainment Inc.","url":"1#Mario%27s%20Time%20Machine%20%28USA%29.nes","filesize":262160,"score":"","genres":"Educational > Side view > History","desc":"<p>Bowser and his minions have traveled through time and have stolen historical artifacts to add to Bowser's museum. While Yoshi was checking out this museum, he was captured by Bowser. Now it's up to Mario to rescue Yoshi and return the stolen objects back to their rightful place. </p><p>The game consists of Mario defeating enemies in a Mario Bros style game. Once all the enemies are defeated, they drop a stolen item which Mario needs to pick up. Mario then enters into a Timulator (a time traveling machine) and warps to the player's selected time period. The selected time period is basically a small side-scrolling area where Mario has to find the correct location to drop the current item he is holding. If Mario drops the item in the wrong location or the wrong time period, it will be taken away and Mario will have to restart the item collection process all over again. This side-scrolling section also holds the educational aspect of the game as Mario can jump into message blocks and learn factoids about the time and location he is currently in.</p><p>The game will have Mario returning fourteen items (one for each time period) before he will be made to take a history exam about the knowledge he has gained from all this item gathering. Once that's finished Mario will finally be able to confront Bowser and rescue Yoshi.</p>"},{"name":"Marusa no Onna","year":1989,"developer":"Capcom Co., Ltd."},{"name":"Mashin Eiyūden Wataru Gaiden","year":1990,"developer":"Westone Co., Ltd."},{"name":"Master Chu And The Drunkard Hu","year":1989,"developer":"Joy Van"},{"name":"Matsumoto Tōru no Kabushiki Hisshōgaku","year":1988,"developer":""},{"name":"Mawthorne","year":2022,"developer":"CrazyGroupTrio Games"},{"name":"Maxi 15","year":1992,"developer":""},{"name":"Mechanized Attack","year":1990,"developer":"SNK Corporation","url":"1#Mechanized%20Attack%20%28USA%29.nes","filesize":196624,"score":6.8,"genres":"Action > 1st-person > Rail shooter > Sci-fi / futuristic","desc":"<p>Mechanized Attack is a game where the player uses a machine gun to stage an assault on a tropical island that's home to a cyborg army.  Battle through numerous stages beginning with an approach to the island. This first stage is held over the water and features at attack on a number of small gunboats, a helicopter, and an entire battleship. As the player progresses through the stages of the island, the human (and even canine) enemies are revealed to be robots when the flesh is destroyed. At various junctures of the game, the player is allowed to choose which game path to pursue.</p><p>In the NES version, the player can use either a gamepad or the NES Light Zapper to carry out the mission. While the arcade version of Mechanized Attack has a miniature machine gun replica for the player to use, the NES version attempts to reproduce the feel by allowing the player to hold down a game pad button or the Light Zapper trigger for automatic fire. Extra ammo is plentiful so be sure to fire at those power-up boxes to grab as much as you can. There are also more powerful grenades which are in much shorter supply than the bullets.</p>"},{"name":"Mega Man","year":1987,"developer":"Capcom Co., Ltd.","url":"1#Mega%20Man%20%28USA%29.nes","filesize":131088,"score":7.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Platform > Sci-fi / futuristic","desc":"<p>In the future city of Monsteropolis, the use of robot labour has helped civilization grow more than ever before. At the forefront of this technology is Dr. Light and his assistant Dr. Wily, who are commissioned to build six robots to handle a variety of specific tasks. They are named Bombman, Gutsman, Iceman, Cutman, Elecman, and Fireman in reference to their individual prime functions. Dr. Wily, however, has bigger plans and chooses to take control of the robots and let loose destruction in a bid for world control. Dr. Light fights back with the best tool he has, an experimental human-like robot, Rock aka Mega Man, who had been tested to perform cleaning duties. Now properly armed, it's up to Mega Man to take on the maverick robots, fight his way into Dr. Wily's castle, and end this madness.</p><p><em>Mega Man</em> is a side-scrolling platformer. Mega Man has the ability to jump and fire his weapon. He must travel to the levels of the six robot masters and defeat them in combat. By doing so, Mega Man is able to acquire their power for his own. These powers can then be used interchangeably with his main weapon and target the weaknesses of specific enemy bosses. Additionally, some hidden areas of the levels can only be accessed by using certain captured robot weapons. A special Magnet Beam ability can also be found which can be used to create steps. </p><p>Travelling throughout these levels, Mega Man is confronted by an army of lesser robot creations. Destroying these usually yields energy capsules (for refilling Mega Man's Energy), weapon capsules (for refilling Mega Man's special robot weapons), and extra lives shaped like Mega Man's head.</p>"},{"name":"Mega Man 2","year":1988,"developer":"Capcom Co., Ltd.","url":"1#Mega%20Man%202%20%28USA%29.nes","filesize":262160,"score":8.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>After defeating Dr. Light's six robots that were reprogrammed by the villainous Dr. Wily in Mega Man, it seemed like the world was safe. But it was not to be. Dr. Wily has escaped from prison and is madder than ever, this time creating eight new Robot Masters of his own to take over the world and crush Mega Man! Is the world doomed?</p><p><em>Mega Man 2</em> is the sequel to the NES game <em>Mega Man</em>. In this game, Metal Man, Air Man, Bubble Man, Quick Man, Crash Man, Flash Man, Heat Man and Wood Man are Dr. Wily's eight prize creations that have been sent to take over the world. As Mega Man defeats these bosses, he can steal their powers and use them for himself. Each Robot Master is weak against another's weapon, and through experimentation, Mega Man can gain the upper hand by using the weapon they're vulnerable against.</p><p>Other additions to the game include the 'E-Tank' - an item that can be used at any time to completely refill Mega Man's energy, and a Password System, which allows players to continue their game by recording which Robot Masters have been defeated and how many E-Tanks they have. <em>Mega Man 2</em> also removes the scoring system from the original game.</p>"},{"name":"Mega Man 3","year":1990,"developer":"Capcom Co., Ltd.","url":"1#Mega%20Man%203%20%28USA%29.nes","filesize":393232,"score":8.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p><em>Mega Man 3</em> is a traditional side-scrolling platformer: you jump from brick to brick while avoiding pits and shooting robots. It's quite similar, in all respects, to other Mega Man games; however, this is the first time that you get a sidekick. It's also the first time you're allowed to slide instead of merely walking. </p><p>Rush is your dog who helps out by offering other modes of transportation when you need it. He starts out with the 'Rush Coil' ability to launch you to the top of the screen like a springboard; later he acquires the 'Rush Jet' ability to turn into a guided, floating platform to carry you wherever you need to go; and he also gets the 'Rush Marine' ability which is a submarine that works just like the jet except underwater and with the added ability to hop around out of the water (you can actually jump while on the jet but the jet continues to hover beneath you whereas you stay inside the submarine). All of these abilities function just like boss weapons.</p><p>When you defeat the boss at the end of a level you gain his power - or at least a similar power. You may pause the game at any time and switch to any single power you have. It supplants your regular Arm Cannon with a limited - but superior - ability. The weapon ammo is displayed next to your energy meter. There are eight of these, corresponding to the eight main levels, even though there are twenty-one levels in the entire game. </p><p>Enemies will often supply you with both energy and ammo refills. You can also collect Energy Tanks which can only be used once but will entirely restore your health. You start the game with three lives. Other features include Surprise Boxes lying around for you to find. There are infinite continues and a password feature to resume play at the beginning of any level.</p>"},{"name":"Mega Man 4","year":1991,"developer":"Capcom Co., Ltd.","url":"1#Mega%20Man%204%20%28USA%29.nes","filesize":524304,"score":7.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>In <em>Mega Man 4</em>, Dr. Wily is declared as having been killed by the explosion of Gamma. A year passes and Rock, Roll, and Dr. Light are living in peace. But soon, the peace is broken by a new threat.</p><p>A supposed colleague of Dr. Light's, the mysterious Dr. Cossack, has sent out eight of his own Robot Masters to find Mega Man, whom Cossack blames for the kidnapping of his daughter. Mega Man, hoping to clear his name, sets out to find Dr. Cossack, this time armed with a powerful new weapon: the Mega Buster. Mega Man must now battle with Cossack's fiendish Robot Masters and find Cossack's daughter before it's too late.</p><p>Gameplay-wise, this installment is similar to the previous game in the series. Like before, Mega Man has to complete eight stages, defeating their robotic bosses and acquiring their weapons as a reward. He retains his abilities to jump, shoot, climb, and slide. His dog can be transformed to access different area types. A new addition is the Mega Buster weapon, which can be charged to produce powerful shots.</p>"},{"name":"Mega Man 5","year":1992,"developer":"Capcom Co., Ltd.","url":"1#Mega%20Man%205%20%28USA%29.nes","filesize":524304,"score":7.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>Dr. Cossack, humbled by his defeat and his allowing of Dr. Wily to influence his ways, decides to help Dr. Light by providing him and Rockman with tools and weapons to help foil Dr. Wily for good. All seems calm and peaceful, until...</p><p>A sudden rampage breaks out, and the cause is found to be a group of robots, led by a mysterious figure. As Dr. Light begins to investigate this rampage and attempts to find a way to stop it, he is kidnapped by the leader of the robots. Rockman hurries to save Dr. Light, but is too late...the only thing he can find at the scene is a yellow scarf...one that almost seems to belong to...Blues!?</p><p>Could Rockman's supposed brother, the strange but good-hearted Blues, be the one who kidnapped Dr. Light? Is Blues the one responsible for the rampages? With these questions racing through his mind, Rockman sets off to find Blues and get the answers he wants.</p><p>Like the other early Rockman / Mega Man games, the Playstation version was only released in Japan, as part of the Complete Works series.</p>"},{"name":"Mega Man 6","year":1993,"developer":"Capcom Co., Ltd.","url":"1#Mega%20Man%206%20%28USA%29.nes","filesize":524304,"score":7.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>In <em>Mega Man 6</em>, the whole world is alive and buzzing with word of the 1st Annual Robot Design Contest. Hundreds of robot designers from all corners of the globe enter their most powerful robots into the contest in hopes of taking home the ultimate prize. The sponsor of the contest, the mysterious Mr. X, suddenly declares that he has decided on winners...and takes 8 of the Robot Masters for his own purpose...taking over the world!! Mega Man confronts him and demands an explanation, and what Mr. X replies with shocks him. Mr. X declares to Mega Man that he had been using Dr. Wily as a puppet the entire time, and now he would take over the world, and nothing could stand in his way! Mega Man finally decides to stop Mr. X once and for all, and sets off to defeat his 8 new Robot Masters and then the madman himself!</p>"},{"name":"Meikyū Jiin Dababa","year":1987,"developer":"Konami Industry Co. Ltd."},{"name":"Meitantei Holmes: Kiri no London Satsujin Jiken","year":1988,"developer":"Another Ltd."},{"name":"Meitantei Holmes: M Kara no Chōsenjō","year":1989,"developer":""},{"name":"Menace Beach","year":1990,"developer":"Color Dreams, Inc."},{"name":"Mendel Palace","year":1989,"developer":"Game Freak, Inc.","url":"1#Mendel%20Palace%20%28USA%29.nes","filesize":262160,"score":7.4,"genres":"Action > Strategy > Top-down","desc":"<p>In <em>Mendel Palace</em>, you are Bun-Bun and you have to rescue your girlfriend Candy, who has fallen asleep and is now trapped in her dream. To progress, you have to go through various areas that feature dolls as enemies. Games are played on a board of 7x5 sliding tiles, using an overhead view. By sliding floor tiles, you'll be able to put them off balance and make them crash in the wall, leading to their destruction.</p>"},{"name":"Mermaids of Atlantis: The Riddle of the Magic Bubble","year":1991,"developer":"Computer & Entertainment Inc.","url":"2#Mermaids%20of%20Atlantis%20-%20The%20Riddle%20of%20the%20Magic%20Bubble%20%28USA%29%20%28Unl%29.zip","filesize":1,"score":"","genres":"Puzzle > Top-down > Real-time > Falling block puzzle","desc":"<p>\"Mermaids of Atlantis\" is basically a non-adult version of  Bubble Bath Babes. Only instead of a naked girl there is a mermaid who is wearing a bra. This mermaid lies on the bottom of the play field and sends colored bubbles into the air. What you must do is arrange the bubbles in such a way that they build a row of 4 or more of the same color. The game uses the same graphics (except the mermaid) and gameplay mechanics as the original, adding three difficulty settings, the possibility to begin from any stage, and a background story: the evil underwater emperor O-Dinten has sealed all the games (yes, that's right!) into bubbles, and you must complete the game to unlock them and to bring entertainment back to the sea people.</p>"},{"name":"Metal Fighter","year":1989,"developer":"Joy Van"},{"name":"Metal Gear","year":1987,"developer":"Konami Industry Co. Ltd.","url":"1#Metal%20Gear%20%28Europe%29.nes","filesize":131088,"score":6.9,"genres":"Action > Diagonal-down > Stealth > Direct control > Spy / espionage","desc":"<p>Near the end of the 20th century, a small fortified nation named Outer Heaven (founded by a mysterious war hero whose name and identity are shrouded in secrecy) is threatening the nations of the \"West\" with the development of a new prototype weapon named Metal Gear, a walking tank which is capable of launching nuclear warheads from anywhere on the globe. As FOX-HOUND's (an elite black ops unit) newest recruit, going by the codename of Solid Snake, your mission is to infiltrate Outer Heaven and rescue your missing comrade, Grey Fox (who was captured after a failed infiltration), while gathering intelligence on Metal Gear. </p><p>In order to fulfill this objective, the player must collect various weapons and equipments (including keycards for further access into the fortress), while avoiding visual contact with the enemy. The player must also confront bosses in the form of Outer Heaven's elite mercenary force and rescue hostages hidden within the fortress in order to increase player rank, which gives Snake an extended life bar and increased storage capacity for replenishable items and ammo. The player can use a wireless transceiver to come in touch with their commanding officer, Big Boss, to learn more about their current mission objectives or contact one of the local resistance members operating covertly within the fortress to gain useful tips and insights.</p>"},{"name":"Metal Max (Japan)","year":1991,"developer":"Crea-Tech Inc.","url":"2#Metal%20Max%20%28Japan%29.zip","filesize":1,"score":"","genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Turn-based > Sci-fi / futuristic","desc":"<p><em>Metal Max</em> is a RPG set in a futuristic world, where monsters and mechanical creatures roam the land and where many people live in huge underground caves. You play the role of a young boy who lives in a town with his father and his older sister. Your biggest dream is to become a \"hunter\" - to kill the monsters that are roaming outside, and to receive rewards for that. Your father doesn't approve of your dream, but you nevertheless decide to explore the underground caves surrounding your town, to learn more about the world you live in, and eventually become a true hunter and help to overthrow the evil that threatens the world.</p><p>The game is a Japanese-style RPG with random encounters and turn-based combat viewed from third-person perspective, like in <em>Final Fantasy</em>. You can also pilot various vehicles. You can participate in battles while riding those vehicles, performing various special techniques. You also upgrade the vehicles and get equipment for them.</p>"},{"name":"Metal Slader Glory","year":1991,"developer":"HAL Laboratory, Inc."},{"name":"Metal Storm","year":1991,"developer":"Tamtex","url":"3#Metal_Storm/Metal_storm.nes","filesize":393232,"score":7.6,"genres":"Action > Side view > Platform > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Metal Storm</em> is an action game in which the player takes control of the giant mecha M-308 Gunner in order to put a stop to a malfunctioning computer menace. </p><p>To save it from becoming another generic action game, innovation is shown through fast paced gameplay and the \"gravity flip\" ability, which enables the character to freely switch between moving along the floor or ceiling. While the game is only seven levels long, the difficulty ramps up quickly, so mastery of the gravity technique and memorization of the levels become absolute necessities for survival.</p>"},{"name":"MetalMech: Man & Machine","year":1990,"developer":"Sculptured Software, Inc.","url":"1#Metal%20Mech%20-%20Man%20%26%20Machine%20%28USA%29.nes","filesize":262160,"score":5.7,"genres":"Action > Side view > Platform > Shooter > Sci-fi / futuristic","desc":"<p>You control the pilot of a MetalMech vehicle (which looks similar to ED-209 of Robocop  licenses) who can move across the screen left or right, either with the mech or without, and fire any direction except straight down. The Mech is better armored, but also a bigger target and much too big to climb ladders, so you'll find yourself as much outside as inside. Your goal is to cross each level filled with randomly generating enemies and reach the next. Power-ups are hidden in various containers and in various places.</p>"},{"name":"Metro Cross","year":1986,"developer":"Namco Limited"},{"name":"Metroid","year":1986,"developer":"Nintendo Co., Ltd.","url":"1#Metroid%20%28USA%29.nes","filesize":131088,"score":7.7,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Shooter > Sci-fi / futuristic","desc":"<p>In the future, the Galactic Federation and the pirates of planet Zebes are at war. Pirates have stolen an unknown life-form, recently discovered on the planet SR388. The life-form, designated \"Metroid\", is in a state of suspended animation and, according to analysis, was the cause of the complete destruction of SR388. If the Metroid ever got loose, the alien could destroy countless other systems. It is up to the space bounty hunter Samus Aran to land on Zebes and find her way through the perilous terrains of Brinstar and Norfair, destroy the Pirates, as well as their alien enforcers, Ridley and Kraid, and rid the planet of the alien life form before the pirates complete their plans of world destruction.</p><p>Using the cybernetic enhancements of her Power Suit, Samus can use a range of weapons and defenses to destroy the enemy. She can also absorb enemies powers into her Power Suit to increase her defense and chance of survival. Using her weapons and special abilities, she must find her way to the central chamber of Tourian and destroy the Mother Brain, the mysterious leader behind the Space Pirates.</p>"},{"name":"Mezase! Top Pro: Green ni Kakeru Yume","year":1993,"developer":"Jaleco Ltd."},{"name":"Michael Andretti's World GP","year":1988,"developer":"Sonata"},{"name":"Mickey Mousecapade","year":1987,"developer":"Hudson Soft Company, Ltd.","url":"1#Mickey%20Mousecapade%20%28USA%29.nes","filesize":65552,"score":6.2,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed > Regional differences","desc":"<p>One of Mickey's friends is in trouble, and Mickey and Minnie Mouse are on a rescue mission! <em>Mickey Mousecapade</em> is an action platform game. In order to reach your goal (and find out which of Mickey's friends is in trouble), you'll need to jump and climb your way through various levels which take place in different locations (including a fun house, a treacherous sea side, a pirate ship, and a castle). Each screen has numerous obstacles and enemies which will drain your energy if you come in contact; lose all of your energy, and a life is lost and the game ends when you have no lives left. You control Mickey Mouse and Minnie follows along. You'll need to make sure Minnie stays safe as you make your way through the levels (for example, if you mistime a jump and Mickey lands safely but Minnie doesn't a life will be lost). In addition to avoiding obstacles, there is also some occasional puzzle solving (such as locating a key to open locked doors, or finding your way out of the woods).</p><p>There are some differences between the US and Japanese versions of this game. Most enemies are different in each version, specially the bosses. While the Japanese version has most of its bosses based on Alice in Wonderland (the Cheshire Cat in stage one, the Dodo in stage two, the Caterpillar in stage three and the Queen of Heats in stage five), the US version has enemies from several other Disney movies. Captain Hook from Peter Pan appears in the Japanese version as the boss for the fourth level, while in the US version he's replaced by Peg-Leg Pete. The other bosses in the US version are Witch Hazel (stage one), the Crocodile from Peter Pan (stage two), Kaa from The Jungle Book (stage three) and Maleficent from Sleeping Beauty (stage five). There is also a gameplay difference: in the Japanese version Mickey sometimes finds hidden keys which lead him and Minnie to a secret room. In that room, he must pick 4 fairies in the right order; doing so, he earns an 1-Up.</p>"},{"name":"Mickey's Adventures in Numberland","year":1994,"developer":"Beam Software Pty., Ltd."},{"name":"Mickey's Safari In Letterland","year":1993,"developer":"Beam Software Pty., Ltd.","url":"1#Mickey%27s%20Safari%20in%20Letterland%20%28USA%29.nes","filesize":262160,"score":"","genres":"Action > Educational > Side view > Pre-school / toddler > Reading / writing > Licensed","desc":"<p>Mickey's Safari In Letterland chronicles Mickey Mouse's globetrotting adventures (on a slightly modified globe) to capture letters for educational purposes. Goofy assists with chauffeur and data processing duties. Mickey can venture into any of the following 6 territories: Yukon, Swamp, Forest, Jungle, Pyramid, and Caribbean. In each area, his mission is to collect three diamonds that contain letters. Doing so will spell a word. Then, Mickey ventures to the end of the level and collects a large slab. If Mickey collects the three diamonds in the stage to spell a 3-letter word, Mickey spells the word with digitized audio samples and says the word, complete with an illustration. Then, the slab that Mickey collected at the end of the stage is fed by Goofy through a large machine that spits out a letter. It is up to the player to identify which letter this is.</p><p>This game is oriented towards very young children. As such, it is essentially impossible to fail. There are many enemies in the game but none actually inflict harm. Snakes, porcupines, hippos, alligators, and even baby seals-- Mickey just bounces off each. Mickey can also swim handily and sustain long falls.</p><p>Further, the game allows the player to point at letters on a board and have Mickey say them using the cartridge's library of digitized mouse voice samples.</p>"},{"name":"Micro Machines","year":1991,"developer":"The Big Red Software Company Ltd.","url":"1#Micro%20Machines%20%28Europe%29%20%28Unl%29.nes","filesize":262160,"score":7.5,"genres":"Racing / Driving > Top-down > Licensed","desc":"<p>If you're bored of racing Formula 1 cars, rally cars or MotoGP bikes in their natural habitats, the Micro Machines series could be for you. It involves racing miniatures representing particular vehicle types across a particular terrain found around the house. The Sports Cars race on the desktop, 4x4s in the sandpit, Formula 1 cars on a snooker table, and so on.</p><p>These levels were packed with variation. The Snooker tables has the track painted on, although this is open to deviation (as are most levels), and had you racing through the pockets and across the rim of the table. Tanks raced as well, with the chance of shooting out your opponent if they got directly in front of you. The desktop levels include binders to jump across, pencil-sharpeners to avoid, and lots of visual jokes in the open homework.</p><p>Viewed from overhead with small graphics, the races include up to 4 cars. In one player challenge mode you race through the 21 tracks in a set order, selecting your 3 opponents as you go along (adding a fair amount of strategy - ideally you should aim to eliminate the better CPU cars early on), eliminating one after every third race (assuming that you can finish in the top 2 of a race within your 3 lives). If you win 3 races in a row without using a continue you get a time-trial race which can earn you an extra life.</p><p>The real innovation of the game was in the multiplayer modes. You started with 4 points each, and when one car gets far enough ahead to force the other car off-screen, the slider moves in their favour. Once it reached the end (which involved beating them 4 times more than they beat you) you win the level, although if 3 laps were completed, the person leading at that point is declared the winner - with a sudden death play off if scores are level. 9 of the tracks are available in this mode, although you can also play this Head to Head system as a 1-player game across all the tracks.</p>"},{"name":"Micro Mages","year":2019,"developer":"Morphcat Games UG"},{"name":"Microgo1","year":1987,"developer":"Bullet-Proof Software, Inc."},{"name":"MiedoW","year":2018,"developer":"The Mojon Twins"},{"name":"Mig-29 Soviet Fighter","year":1992,"developer":"The Codemasters Software Company Limited","url":"1#MiG%2029%20-%20Soviet%20Fighter%20%28USA%29%20%28Unl%29.nes","filesize":131088,"score":6.2,"genres":"Action > Behind view > Shooter > Flight / aviation","desc":"<p>The closest comparison to this action game would be Afterburner, a game which was overdue decent home computer re-creations. You view the game slightly behind your plane, which must shoot out enemy planes, tanks and installations while avoiding their fire. You are armed with different kinds of weapons including downward bombs, air-to-air missiles and a nuclear bomb. More of each of these can be picked up by collecting the parachutes which are dropped into your path. There are mountain ranges, deserts and arctic scenes to clear along the way, with big boss planes to face.</p>"},{"name":"Might and Magic: Book One - Secret of the Inner Sanctum","year":1990,"developer":"New World Computing, Inc.","url":"1#Might%20%26%20Magic%20-%20Secret%20of%20the%20Inner%20Sanctum%20%28USA%29.nes","filesize":524304,"score":7,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Direct control > Multiple units/characters control > Fantasy","desc":"<p>A party of adventurers in what appears to be a medieval fantasy world called Varn is looking for an entrance to the highly coveted Inner Sanctum. Before long the heroes realize that one of the four kings that rule the countries of Varn is in fact an impostor, a creature from outer space. Their task is to find the real king and ultimately stop the mysterious space traveler, revealing the truth about the world's origin in the process.</p><p><em>The Secret of the Inner Sanctum</em> is a role-playing game and the first installment in the <em>Might and Magic</em> series. Core gameplay concept is similar to that of Wizardry games, though the game does not focus solely on dungeon crawling and features overworld areas and towns that can be physically navigated. In this way the game resembles The Bard's Tale, though it has a significantly larger playing environment with several towns. The entire game is viewed from first-person perspective, and the game environment consists of maze-like passages made with pseudo-3D graphics.</p><p>In the beginning of the game, the player creates a party of six adventurers. There are six classes to choose from: knight, robber, sorcerer, cleric, paladin, and archer. Each character has six main attributes: might, endurance, accuracy, personality, intelligence, and luck, with each class requires proficiency in a specific attribute for effective functioning. There are also five races to choose from: humans, elves, dwarves, gnomes, and half-orcs.</p><p>As in most RPGs, the gameplay revolves around exploring the game world and leveling up to be able to proceed to the story-advancing challenges. The party starts in a particularly weak state, equipped with only clubs and having no money. The player is free to explore most of the game's locations in any order, and there are few hints as to what needs to be done to advance the plot. Turn-based battles against randomly appearing enemies typically take place against a group of monsters more or less equal in size to the player-controlled party, but enemy reinforcements can appear once their comrades have been slain. It is also possible to try and bribe enemies or surrender to them before entering combat.</p><p>The game has no auto-mapping feature of any kind and it is only possible to save the player's progress at inns located in towns.</p><p>The TurboGrafx CD version of this game has significant differences.</p>"},{"name":"Mighty Bombjack","year":1986,"developer":"Tecmo, Ltd.","url":"1#Mighty%20Bomb%20Jack%20%28USA%29.nes","filesize":65552,"score":5.8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Platform","desc":"<p>The sequel to the original Bomb Jack, <em>Mighty Bombjack</em> brings side scrolling to the series, and brings it closer to a platform game rather than the arcade / puzzle likeness of the first one.</p><p>Once again you play as the bomb-hungry caped superhero. Collect the bombs for points and avoid being touched by the different monsters that spawn from crates and the like.</p><p>The game now features new scenarios like clouds and forests, as well as the usual sphinx and pyramids backgrounds of the original title.</p>"},{"name":"Mighty Final Fight","year":1993,"developer":"Capcom Co., Ltd.","url":"1#Mighty%20Final%20Fight%20%28USA%29.nes","filesize":262160,"score":7.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Beat 'em up / brawler","desc":"<p>Capcom's only 8-bit port of the Final Fight series, Mighty Final Fight follows the storyline and characters of the first Final Fight game. Mayor of Metro City Mike Haggar, his ninja friend Guy and his daughter's boyfriend, Cody learn that Haggar's daughter, Jessica, has been kidnapped by the Mad Gear Gang whose leader has fallen in love with her, and also wants the meddling Mike Haggar to leave town. Now it's personal! Choosing one of the three fighters, the player embarks on a beat-em-up quest through the streets of Metro City.</p><p>The game is a side-scrolling beat 'em up and a one-player only game (unlike other Final Fight ports). Also exclusive to this particular Final Fight game is the experience system which allows gaining levels to learn additional moves, similar to the first Double Dragon game. The characters have all been squished down to super-deformed 8-bit likenesses. Graphically this looks similar to River City Ransom. Each character has a button for attack and a button for jumping. Pressing the two together unleashes a character-specific super-move. Various grabbing moves and throws can also be done by moving the player near an enemy.</p>"},{"name":"Mike Tyson's Punch-Out!!","year":1987,"developer":"Nintendo R&D3","url":"nes-rom-collection/Mike%20Tyson%27s%20Punch-Out%21%21%20%28U%29%20%28PRG%201%29%20%5Bh1%5D.nes","filesize":262160,"score":8.1,"genres":"Sports > Diagonal-down > Fixed / flip-screen > Direct control > Boxing > Licensed","desc":"<p><em>Mike Tyson's Punch-Out</em> is one of the most popular and biggest selling video games of all time. Step into the ring as Little Mac, a 17-year-old fighter from the Bronx, ranked number three in the minor circuit. Your goal is to work your way up through the rankings so that you can challenge Mike Tyson, Kid Dynamite, in a dream fight. </p><p>But the road to the championship is long and hard. You'll have to work your way up through the minor, major, and world circuits by winning 14 bouts against some very tough opponents. </p><p>The rules of the World Video Boxing Association govern your bouts. Each match is three three-minute rounds long. Any boxer knocked down for a 10 count is Knocked Out (KO). If a boxer goes down three times, he'll find himself a Technical Knock Out (TKO). If both boxers make it to the end of the third round, the ref determines the winner. </p><p>Once you're in the ring you'll have to beat your opponent with smart fighting. Use left and right punches, as well as uppercuts to knock your opponent to the mat. Dodge your opponent's blows with some fancy footwork. Dazzle them with your brilliance and you'll be the World Video Boxing Association Champion. On the other hand, you might find yourself down for the count.</p>"},{"name":"Millionaire","year":1991,"developer":"Thin Chen Enterprise"},{"name":"Millipede","year":1987,"developer":"Atari, Inc.","url":"1#Millipede%20%28USA%29.nes","filesize":24592,"score":6.5,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter","desc":"<p>Millipedes, cousins of the Centipede, are all over the garden. This will ruin anything trying to grow there unless they are stopped. But there are other insects as well; spiders, bees, dragonflies, and earwigs. Nature is dangerous. Luckily, there's a bug zapper that can shoot arrows at these insects and destroy them.</p><p>Millipede is the sequel to Centipede, and features similar gameplay, but with a new swarm of insects! The goal is to destroy the multi-segmented millipede as it traverses its way through the mushroom forest towards the bottom of the screen. When all millipede segments have been destroyed, the player will progress to the next, more difficult level. Millipedes and other creatures are all worth a different amount of points. Occasionally dynamite will appear on the screen, which will explode if shot by the bug zapper. With a well-timed shot, numerous millipede segments (and other insects as well) can be taken out as they pass by.</p>"},{"name":"Milon's Secret Castle","year":1986,"developer":"Hudson Soft Company, Ltd.","url":"1#Milon%27s%20Secret%20Castle%20%28USA%29.nes","filesize":65552,"score":5.4,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Fantasy","desc":"<p>Milon, a child of the Kingdom of Hudson, must go on a quest to rescue Queen Eliza from an evil wizard who has taken over her castle as well as the musical instruments that the queen's subjects use to communicate with each other.  Milon must recover the stolen instruments and rescue the queen from the wizard.  Armed only with a magical bubble-shooting ability, Milon makes his way through the rooms of the castle finding items and money that can help him progress.  This is a platformer that blends Mario-esqe action with puzzle-solving and exploration.</p>"},{"name":"Mini-Putt","year":1991,"developer":"Artech Digital Entertainments, Inc."},{"name":"Miracle Piano Teaching System, The","year":1990,"developer":"The Software Toolworks, Inc.","url":"2#Miracle%20Piano%20Teaching%20System%2C%20The%20%28USA%29.zip","filesize":1,"score":"","genres":"Educational > Side view > Music / rhythm > Music","desc":"<p><em>The Miracle Piano Teaching System</em> teaches piano to beginning / intermediate players using a combination of scripted lessons, dynamically created lessons, and piano-themed video games. The original version came bundled with a custom piano keyboard. Later versions work with any MIDI keyboard.</p>"},{"name":"Miracle Ropit's Adventure in 2100","year":1987,"developer":"Micronics"},{"name":"Miracle Warriors: Seal of the Dark Lord","year":1987,"developer":"ASCII Corporation"},{"name":"Mirai Senshi: Lios","year":1989,"developer":"Pack-In-Video Co., Ltd"},{"name":"Miss. Peach World: L.A Cop","year":1991,"developer":"Color Dreams, Inc."},{"name":"Mission Cobra","year":1989,"developer":"Joy Van"},{"name":"Mission: Impossible","year":1990,"developer":"Konami Industry Co. Ltd.","url":"1#Mission%20Impossible%20%28Europe%29.nes","filesize":262160,"score":7.1,"genres":"Action > Side view > Top-down > 2D scrolling > Shooter > Spy / espionage > Licensed","desc":"<p>Your mission, if you choose to accept it, is to rescue Dr. O and Shannon from the grubby clutches of the Sinister Seven as quickly as possible.  As you fight your way through each area, you must obtain information and vital ID cards.  Your progress is blocked at every turn by acid flames, raw sewage, scorching steam, high voltage electricity and poison gas.</p><p>You can choose from three agents, Max, Grant and Nicholas, according to the situation at hand.  Each is equipped with two types of weapons which can be interchanged according to the surroundings. If an agent's life gauge runs out the next agent in line will take his place.  If you complete an area successfully then the knocked-out agents will rejoin the team at the beginning of the next area.</p><p>The game is made up of six areas with the first and last consisting of two stages.  Two of the areas auto-scroll with all three agents in play at once.</p>"},{"name":"Mitsume ga Tōru","year":1992,"developer":"Natsume Co., Ltd."},{"name":"Moai Kun","year":1990,"developer":"Konami Corporation"},{"name":"Mobile Suit Z Gundam: Hot Scramble","year":1986,"developer":"GAME STUDIO Inc."},{"name":"Mobile Suit Z Gundam: Hot Scramble (Final Version)","year":1986,"developer":"GAME STUDIO Inc."},{"name":"Moero!! Judo Warriors","year":1990,"developer":"Jaleco Ltd."},{"name":"Mojon Twins Gran Sabiduría: 31 in 1 Real Games","year":2017,"developer":"The Mojon Twins"},{"name":"Mojonian Tales","year":2019,"developer":"The Mojon Twins"},{"name":"Momotarō Densetsu","year":1987,"developer":"Hudson Soft Company, Ltd."},{"name":"Momotaro Densetsu Gaiden (Japan)","year":1993,"developer":"Hudson Soft Company, Ltd.","url":"2#Momotarou%20Densetsu%20Gaiden%20%28Japan%29.zip","filesize":1,"score":"","genres":"Role-playing (RPG) > 1st-person > Diagonal-down > Turn-based > Fantasy","desc":"<p>This game is based on famous Japanese folk tales. Momotarō is a boy who was found in a huge peach (hence his name, \"peach guy\"). When he grows up, he goes to the island of demons, fights them, takes their treasure, and restores peace in its village. In this game, you don't play directly the story of Momotarō, but control three other popular characters from Japanese folklore, playing three separate stories: as Yashahime, the daughter of the Hell King Emma; Binbōgami, or \"poverty god\", who is hated by people because he takes money from them; and Urashima, the legendary fisherman who once saved a turtle and became friends with the dragon clan. Although the original stories have nothing or little to do with each other or the story of Momotarō, the game ties the stories together by featuring Momotarō as a character in every one of them.</p><p>Despite being primarily a game for kids (the story is told in a fairy-tale fashion), this is a full-fledged Japanese-style RPG with levels, party management, world map traveling, dungeons, towns, weapons and armors, and turn-based combat against randomly appearing enemies, viewed from first person perspective.</p>"},{"name":"Momotarō Dentetsu","year":1988,"developer":"Hudson Soft Company, Ltd."},{"name":"Money Game, The","year":1988,"developer":"SOFEL Co., Ltd."},{"name":"Monopoly","year":1991,"developer":"Sculptured Software, Inc.","url":"2#Monopoly%20%28USA%29.zip","filesize":1,"score":7.3,"genres":"Strategy > Top-down > Board game > Licensed","desc":"<p>From Sculptured Software comes an adaptation of the classic board game <em>Monopoly</em> for the dominating console systems of the early 90s (later also ported to Game Boy Color).</p><p>The game can be played by up to eight players (only four in the Game Boy versions). Any number of positions can be taken over by computer opponents. The game comes with eight different opponents, which are selected from a portrait gallery (8- and 16-bit versions feature different names and portraits).</p><p>It is possible to set up a time limit for a game, and also to customize the game. Amount of starting money, owned properties, houses and hotels can be set for any player before starting. The game also comes with a number of preset scenarios with varied starting parameters. The 8-bit versions have eight scenarios, the 16-bit versions add another four. The Game Boy versions also feature the scenarios, but don't have the customization option.</p><p>During gameplay, the board is seen from the top. Moving tokens are displayed in a special animation in the center of the board, as is a hand throwing the dice. Auctions and trades take place on special screens, with the 16-bit versions being more elaborately animated and illustrated.</p>"},{"name":"Monster in My Pocket","year":1992,"developer":"Team Murata Keikaku","url":"1#Monster%20in%20My%20Pocket%20%28USA%29.nes","filesize":262160,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Licensed","desc":"<p>The evil Warlock wants to take over the world! He calls his fellow monsters to join him, but several refuse - and after casting a shrinking spell that backfires and shrinks down all the monsters around him, transporting them to different homes in Los Angeles.</p><p>Warlock didn't let his size impairment get in the way of world domination, however, so it's up to The Vampire and The Monster to stop him! Along the way, both characters will have to fight through Warlock's henchmonsters through the streets, sewers, a construction area and even a Japanese garden.</p><p>The game features classic platforming action. The player only has one all-purpose attack and they can also double jump to avoid enemies or reach high ledges. The player can also pick up small objects and use them to attack several enemies at once. If there's only one player, they can choose between The Vampire or The Monster. Or if they don't want to go alone, a friend can join in and help them beat Warlock in the two player co-op mode.</p><p>The game is based on the <em>Monster In My Pocket</em> toy franchise. The package also included a limited edition Monster in My Pocket toy, Blemmyea (#81), which was only available with this game.</p>"},{"name":"Monster Party","year":1989,"developer":"Sonata","url":"1#Monster%20Party%20%28USA%29.nes","filesize":262160,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Horror","desc":"<p>You are a young boy with a baseball bat named Mark. On your way home from a baseball game, you encounter a monster named Bert. Bert needs your help in saving his planet from the evil monsters. You learn how to fuse with Bert and become a monster fighting gargoyle. You'll spend most of the game attacking bad guys by swinging your bat at them or volleying their fire.</p><p>This is a side scrolling adventure, similar in play to Super Mario Bros., but with monsters and skulls. The game itself is infamous for its outlandish quotes.</p>"},{"name":"Monty no Doki Doki Dai Dassō: Monty on the Run","year":1987,"developer":"Jaleco Ltd."},{"name":"Moon Crystal","year":1992,"developer":"Hect Co. Ltd."},{"name":"Moon Ranger","year":1990,"developer":"Odyssey Software, Inc."},{"name":"Morita Shōgi","year":1987,"developer":"Random House Co., Ltd."},{"name":"Mōryō Senki Madara","year":1990,"developer":"Konami Industry Co. Ltd."},{"name":"Motocross Champion (Japan)","year":1989,"developer":"Sonata","url":"1#Motocross%20Champion%20%28Japan%29.nes","filesize":262160,"score":"","genres":"Racing / Driving > Sports > Diagonal-down > 2D scrolling > Motorcycle","desc":"<p>In this motocross game, a single player must do battle against the clock, as well as a series of crafty racers, to become the champion of the motocross. The eight tracks that make up the circuit are chock-full of twists, turns, and tricky jumps that all the racers must negotiate. And that's not all: the player must also stay in the running always! You must place in the top two, and then win a race to advance to the next track. Clear all eight tracks, and you might be the toast of the dirt! But one wrong turn, and it's back to training wheels for you.</p><p>A practice mode is also available, where the player can practice the tracks before playing them for real.</p>"},{"name":"Motor City Patrol","year":1992,"developer":"Source Research & Development Ltd.","url":"2#MotorCity%20Patrol%20%28USA%29.zip","filesize":1,"score":"","genres":"Action > Racing / Driving > Top-down > 2D scrolling > Arcade > Automobile > Street racing","desc":"<p>A simple, top-down driving game where you play a patrol officer in a city police force. You progressively take down bigger bad guys by chasing them down and shooting at them. The gameplay is a precursor to the first Grand Theft Auto games, developed later.</p><p>Gameplay consists of driving your squad car around the city, pulling over speeders, by flashing the siren, and stopping random robberies, by shooting the getaway car. Larger crimes will pop up, which lead to capturing whoever the current Public Enemy No. 1 is. The game ends when you fail in a mission, or when you total your police cruiser.</p>"},{"name":"MotoRace USA","year":1985,"developer":"Irem Corp."},{"name":"Mr. Gimmick","year":1992,"developer":"Sun Electronics Corp.","url":"2#Mr.%20Gimmick%20%28USA%29%20%28Proto%29.zip","filesize":1,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Mr. Gimmick is a little doll with a life of its own, that's given to a girl for her birthday. The girl's other toys quickly become jealous of the attention given to Mr. Gimmick, and they decide to carry her away to a mystical land. Mr. Gimmick goes after them to bring his owner back. </p><p>The game Mr. Gimmick is a platform game where you take control of Mr. Gimmick over the course of six levels. You defend yourself by throwing bouncing stars that take a second to form and are then thrown downward. You can also ride the stars thrown to gain access to higher platforms. The inventory you have allows you to store bombs, potions, and fireballs.</p><p>The game has two endings. The easier way is to just run through all of the levels. Each level has a treasure hidden that can be a bit difficult to get, and finding all of these gives access to an extra level. But if you lose all of your lives and have to continue, the game will take all of your treasures away, and not allow you to get to the final level.</p>"},{"name":"Ms. Pac-Man","year":1990,"developer":"General Computer Corporation","url":"3#Ms_Pacman/Ms_pacman.nes","filesize":65552,"score":7,"genres":"Action > Top-down > Fixed / flip-screen > Arcade","desc":"<p>In 1981, a sequel to Pac-Man was introduced in the form of his girlfriend, <em>Ms. Pac-Man</em>. This sequel continued on the \"eat the dots/avoid the ghosts\" gameplay of the original game, but added new features to keep the title fresh.</p><p>Like her boyfriend, Ms. Pac-Man attempts to clear four various and challenging mazes filled with dots and ever-moving bouncing fruit while avoiding Inky, Blinky, Pinky, and Sue, each with their own personalities and tactics. One touch from any of these ghosts means a loss of life for Ms. Pac-Man.</p><p>Ms. Pac-Man can turn the tables on her pursuers by eating one of the four Energizers located within the maze. During this time, the ghosts turn blue, and Ms. Pac-Man can eat them for bonus points (ranging from 200, 400, 800, and 1600, progressively). The Energizer power only lasts for a limited amount of time, as the ghost's eyes float back to their center box, and regenerate to chase after Ms. Pac-Man again.</p><p>Survive a few rounds of gameplay, and the player will be treated to humorous intermissions showing the growing romantic relationship between Pac-Man and Ms. Pac-Man, leading all the way up to the arrival of \"Junior\".</p>"},{"name":"MTV Remote Control","year":1990,"developer":"Softie, Inc.","url":"3#MTV_Remote_Control/Remote_control.nes","filesize":262287,"score":5,"genres":"Strategy > Game show / trivia / quiz > Licensed","desc":"<p><em>Remote Control</em> is based on the MTV quiz show of the same name. During the game three contestants (computer or human controlled) compete by answering questions about various TV shows, movies, characters, or actors/actresses. There are two rounds of gameplay followed by a third \"think real fast\" round. </p><p>In the first two rounds of gameplay the gameboard consists of a giant TV with nine channels; one of the players chooses a channel (representing a particular category) revealing a question; the first player to buzz in and provide the correct answer earns points. The are a variety of categories available (some of these are \"video high\", \"cop shows\", \"saturday night live\", \"soap operas\", and many more) which will vary from game to game. Sometimes a surprise channel may appear which doesn't have a question, but awards or removes points from a player. These rounds end when all of the supplied questions have been exhausted. Near the end of the second round, the lowest scoring player is eliminated from the game leaving two players for the final round.</p><p>The final \"think real fast\" round lasts for thirty seconds; during this time the players need to answer as many short answer questions as possible to earn points. At the end of this round the player with the most points wins the game.</p>"},{"name":"Muppet Adventure: Chaos at the Carnival","year":1990,"developer":"MicroMosaics Productions, Inc.","url":"2#Muppet%20Adventure%20-%20Chaos%20at%20the%20Carnival%20%28USA%29.zip","filesize":1,"score":4.6,"genres":"Action > Arcade > Licensed","desc":"<p><em>Chaos at the Carnival</em> is a collection of six arcade mini-games.</p><p>Miss Piggy has been \"pignapped\" by the sinister Dr. Grump; her Muppet friends come to the rescue. Kermit, Gonzo, Fozzie and three other characters from the children's TV show dash into Grump's mysterious fun fair in search for their pink companion. They must brave five rides in succession in order to take on the Grumpasaurus in the final carnival confrontation.* Tunnel of Love: Avoid objects in the waterway</p><ul><li>Duck Hunt: Hit passing ducks with tomatoes</li><li>Space Ride: Land a spaceship in the correct dock using rocket blasts</li><li>Bumper Cars: Race around the track and avoid crashing into obstacles</li><li>Funhouse: Find a way through a small maze filled with guard dogs</li><li>Battle of the Grumpasaurus: Tickle the Grumpasaurus so that he laughs himself silly</li></ul><p>The C-64, Apple II and DOS versions of <em>Chaos at the Carnival</em> support two players, taking turns.</p><p>The versions for the four platforms differ strongly; see the trivia section for details.</p>"},{"name":"Murder Club","year":1989,"developer":"Riverhill Soft Inc."},{"name":"Murder on the Mississippi","year":1986,"developer":"Activision, Inc."},{"name":"Musashi no Boken (Japan)","year":1990,"developer":"Quest Corporation","url":"2#Musashi%20no%20Bouken%20%28Japan%29.zip","filesize":1,"score":"","genres":"Role-playing (RPG) > 1st-person > Top-down > Turn-based > Fantasy","desc":"<p>The player controls a young boy called Musashi, who lives somewhere in medieval Japan in the village of Arima . He is the son of the famous swordsman Miyamoto Musashi and a skilled fighter himself. One day he hears of a rumor that the evil wizard Kojiro, his father's archenemy, has apparently reared up his ugly head once again! Kojiro's demons invade the land, and threaten death and destruction. \"I shall defeat Kojiro!\" - says Musashi, - \"and maybe even get laid\"...</p><p><em>Musashi no Bōken</em> can be described as Dragon Warrior set in feudal Japan, as apart from the distinct classical Japanese flavor demonstrated here, the games are very similar. Musashi travels over the world map, visits towns, buys weapons and armor, descends into dungeons, and fights enemies in turn-based combat viewed from a first-person perspective.</p>"},{"name":"Musashi no Ken: Tadaima Shugyō Chū","year":1986,"developer":"Taito Corporation"},{"name":"Mutant Virus, The","year":1992,"developer":"Rocket Science Productions, Inc.","url":"2#Mutant%20Virus%2C%20The%20-%20Crisis%20in%20a%20Computer%20World%20%28USA%29.zip","filesize":1,"score":"","genres":"Action > Top-down > Arcade > Sci-fi / futuristic","desc":"<p>In The Mutant Virus you play the part of Ron Trainer, the best of the best at the elite corps of Computer Master Debuggers. And just recently, something has gone terribly wrong. CPI, the Central Programming Institute, controls all the computers in the city which in turn control everything in the city itself. There are some bugs in this system and it's your job to get rid of them and find out how they got there. You will be miniaturized and sent into the computer with a vacine. Gameplay is from an overhead view where you will need to visit all the infected computer systems and use the vacine to contain the virus.</p>"},{"name":"Mysterious Murasame Castle, The","year":1986,"developer":"Nintendo EAD"},{"name":"Mystery Quest","year":1989,"developer":"Carry Lab","url":"3#Mystery_Quest/Mystery_quest.nes","filesize":65552,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Shooter > Fantasy","desc":"<p><em>Mystery Quest</em> is a modified version of Hao Kun no Fushigina Tabi. The player is Hao, an apprentice wizard who finally has a chance to prove himself. The Great Wizard has challenged Hao to seek out his four hidden talismans which he has placed in four different castles.</p><p>The player's character has only one type of magic attack that can be upgraded once in the game, and they have the ability to shoot left and right as well as jumping shots and angled upward shots. There are also a limited variety of items that help the player progress through their quest.</p><p>The game takes place in three types of areas, outside, inside the castles and underground.</p>"},{"name":"Myth: History in the Making","year":1991,"developer":"System 3 Software Ltd."}]