[{"name":"Nagagutsu o Haita Neko: Sekai Isshū 80 Nichi Daibōken","year":1986,"developer":"Shouei System"},{"name":"Nakajima Satoru: F-1 Hero 2","year":1991,"developer":"Human Entertainment, Inc."},{"name":"Nakayoshi to Issho","year":1993,"developer":""},{"name":"Namida no Sōkoban Special","year":1986,"developer":"Thinking Rabbit"},{"name":"Nantettatte!! Baseball","year":1990,"developer":"Sun Electronics Corp."},{"name":"NARC","year":1990,"developer":"Williams Electronics, Inc.","url":"2#NARC%20%28USA%29.zip","filesize":1,"score":6,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Contemporary > Crime","desc":"<p><em>Narc</em> is a 1-2 player game, where your mission is to infiltrate the Mr. Big Corporation, the scourge of the underworld. To do this, you must get through the game's eight stages, with over ten sectors like the junkyard, subway, drug lab, nursery, downtown, Sunset Strip, and even the corporation, where Mr. Big resides. In order to get through the stages, you are required to collect a number of safe cards, and insert them in the slot next to the stage exit. Each sector includes a map, and should be easy to read. For example, the blue or red dots represent you, and the white dots are the missile launchers, while the \"E\" indicates the exit.</p><p>Your mission is not going to be easy, as you will come face-to-face with enemies including the canine mutts, Das Lof Gang, Dr. Spike Rush, Joe Rockhead, Kinky Pinky, Sgt. Skyhigh, HQ Posse, and Mr. Big himself. You have two ways you can deal with them: either put a bullet in them or make arrests. Furthermore, they will try to blow you up the minute they see you. Fortunately, you're armed with a shotgun and missile launcher, but these both have a limited supply of ammunition. If your bullet counter reaches one, you can only fire one bullet at a time, so you need to find some more. Also, it is important not to waste all of your missiles: you might need them later when you deal with later enemies like Mr. Big. You are also backed up by a chopper and a mean shiny street machine.</p><p>More often than not, when you blow up enemies, you can pick up several items that they drop, including drugs, money, ammunition, missile launchers, and if you're lucky, safe cards. Even if you got the safe card and can pass the level, you can keep blowing up enemies to score more points.</p>"},{"name":"NavyBlue","year":1992,"developer":"Use Corporation"},{"name":"Nazo no Magazine Disk - Nazoler Land Dai-3 Gō","year":1988,"developer":"Sun Electronics Corp."},{"name":"Nazo no Magazine Disk - Nazoler Land Sōkan Gō","year":1987,"developer":"Sun Electronics Corp."},{"name":"Nazo no Magazine Disk - Nazoler Land Special!! Quiz Ō o Sagase","year":1987,"developer":"Sun Electronics Corp."},{"name":"Nazo no Magazine Disk: Nazoler Land Dai-2 Gō","year":1987,"developer":"Sun Electronics Corp."},{"name":"Nebs 'n Debs","year":2019,"developer":"Dullahan Software"},{"name":"Nekketsu Kakuto Densetsu","year":1992,"developer":"Technos Japan Corp.","url":"2#Nekketsu%20Kakutou%20Densetsu%20%28Japan%29.zip","filesize":1,"score":"","genres":"Action > Side view > Anime / Manga > Arcade > Beat 'em up / brawler","desc":"<p>Its another day at school in Nekketsu High and series star Kunio finds a note in his locker challenging him to a secret martial arts tournament. Sure enough Kunio and his friend Riki accept the challenge and head out with the hopes of becoming the grand champions of the city.</p><p>Kakuto Densetsu is another 2d side scrolling beat'em up in Nekketsu High series, featuring the same gameplay which involves beating up your enemies in side scrolling levels with a combination of punches, kicks and special moves. The differences in this title however, are that the entire game is laid out as 2-on-2 tournament fights in non-scrolling arenas in which your team must come up on the winning end and advance to the next round. You can play with good old Kunio or create your own character and advance his stats as he goes along in standard Nekketsu High fashion, and you can play alone with an AI-controlled partner or with a friend (you can also go for a 4-player battle royale in the Vs mode). </p><p>Backgrounds have a major role in the fights, with several hazard zones and unique features, and the game also encourages teamwork as many special moves can be unlocked only by combining both of your characters (depending on their compatibility)</p>"},{"name":"Nekketsu Street Basket: Ganbare Dunk Heroes","year":1993,"developer":"Technos Japan Corp."},{"name":"NES Open Tournament Golf","year":1991,"developer":"Nintendo R&D2","url":"2#NES%20Open%20Tournament%20Golf%20%28Europe%29.zip","filesize":1,"score":7.3,"genres":"Sports > Behind view > Top-down > Golf","desc":"<p>In <em>NES Open Tournament Golf</em>, you can play a round of golf on one of three different courses. One or two players can play in the U.S., Japan, or the U.K. and choose a stroke or match play game. Gameplay is from two point of views, starting with an overhead view allowing you to set up the shot and choose a club, then switching to a 3-D point of view. Hitting the ball uses the common power meter where tapping the button starts the meter, tap the button a second time to select the amount of power in the shot, then tap the button a third time to select the amount of slice or hook. If you are unable to finish a round in one play, <em>NES Open Tournament Golf</em> features a battery back-up allowing you to save the game and continue later.</p><p>The Famicom version is significantly different than the NES version. The Famicom version has 5 courses, losing the U.S. course found in the NES version but gaining France, Australia, and Hawaii. The Famicom version also lacks the tournament mode feature found in the NES version.</p>"},{"name":"NES Play Action Football","year":1990,"developer":"Nintendo R&D3","url":"2#NES%20Play%20Action%20Football%20%28USA%29.zip","filesize":1,"score":6,"genres":"Sports > Top-down > Isometric > Football (American) > Licensed","desc":"<p>Nintendo takes its game to the gridiron with NES Play Action Football.  While Nintendo did not get the NFL license for this one, it did secure the license of the NFL Player's Association, so the 8 teams to choose from (all named after the appropriate NFL cities) are all stocked up with real pro players from the 1989 season.  You can even substitute second-stringers for the \"skill\" positions (QB, RB, WR, TE, and FS/SS) when your starters get tired.</p><p>Play perspective is very unusual: top-down slightly modified with a three-quarters tilt behind the offense, and the scrolling is diagonal, from the bottom left to upper right of the screen.  Each team has 12 passing and 12 running plays on offense, and the option to reverse play designs effectively gives you a total of 48 potential plays to run.  The defense has 8 cover plays and 8 blitzes to select from.  The kicking and punting games are handled with a fairly typical directional arrow/power meter system.</p><p>Games are divided into four 15-minute (accelerated real-time) quarters.  There are no penalties, but referees do appear onscreen to signal touchdowns/field goals, take measurements on short yardage plays, and shout \"First Down!\" (in audio) whenever a team moves the chains.  Team stats are displayed on a summary screen after every quarter of play.  Highest scoring team wins, which in playoffs mode means moving on to the next round--and an eventual shot at winning it all in the Power Bowl!</p>"},{"name":"NES Virus Cleaner","year":2011,"developer":"Sly Dog Studios"},{"name":"NEScape!","year":2019,"developer":"Khan Games"},{"name":"New Ghostbusters II","year":1990,"developer":"HAL Laboratory, Inc."},{"name":"New Zealand Story, The","year":1991,"developer":"Taito Corporation","url":"2#New%20Zealand%20Story%2C%20The%20%28Europe%29.zip","filesize":1,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control > Fantasy > Oceania","desc":"<p>One day, a kiwi tribe was having fun and games outside the zoo, only to be kidnapped by the evil-minded Leopard Seal, who plans to sell them at the black market. Fortunately, during the kidnapping process, Tiki, leader of the tribe, managed to escape the sack, and her job is to rescue Phee-Phee and the other kiwis scattered around New Zealand, and are held in cages in various locations that include Auckland, Rotorua, Waitomo Caves, Strait Cook, and Mt. Cook. </p><p>If Tiki doesn't rescue a kiwi in a limited amount of time, the devil will appear and try to kill her. When Tiki reaches the outskirts of each city, except Strait Cook, there is a boss waiting to meet Tiki, and kill her by using their own choice of weapons. Also making the rescue mission difficult are several nasties that attempt to throw their own weapons, like bombs and arrows, at her. To defeat these enemies, Tiki shoots at them using her crossbow and arrows. More often than not, when Tiki shoots at enemies, they will leave behind pieces of fruit that she can pick up for points. However, it is likely that Tiki may get other weapons or the letters E, X, T, E, N, and D. Collecting all these letters will result in an extra life, and as for the weapons, they include laser shots, bombs, and fireballs. </p><p>In some levels, a few areas are located further up than just left or right, and the only way that Tiki can go up is by snatching something off the enemy that gives her the ability to fly up. Other areas are underwater, and when Tiki goes underwater, her oxygen  meter decreases, so she has to rise up to the surface again to restore her oxygen levels. Apart from her own weapons, Tiki is able to squirt water at enemies if she gets to the top of the water.</p>"},{"name":"NFL","year":1989,"developer":"Atlus Co., Ltd.","url":"3#NFL_Football/NFL.nes","filesize":131088,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>Based on professional football as played in the National Football League, NFL was the first 8-bit console game to carry the official NFL license. There is no NFLPA license, though, which means the 28 real teams are included, but no player names or faces.</p><p>The player is in control of the action from a side-scrolling perspective. The camera also zooms in for closeups on receiving plays. However, NFL is also a very strategic, coaching-oriented take on the sport, featuring large playbooks (team plays are included on a separate fold-out sheet bundled with the game manual, but not onscreen in the game itself), limited customization of team skills, and penalties.</p>"},{"name":"Nigel Mansell's World Championship Racing","year":1993,"developer":"Gremlin Graphics Software Limited","url":"1#Nigel%20Mansell%27s%20World%20Championship%20Challenge%20%28USA%29.nes","filesize":262160,"score":6.9,"genres":"Racing / Driving > Simulation > 1st-person > Automobile > Track racing > Vehicle simulator > Oceania > Licensed","desc":"<p>Timing smiled on Gremlin with this licensed Formula 1 simulation, as Nigel's long quest for a championship had finally come good. The game was pitched somewhere in between a full-blown simulation like F1 GP and action games like Continental Circus. Only 12 cars were in each race, which could last from between 3 and 20 laps.</p><p>Before each race you can customize wing downforce, gear ratio, tyre selection and fuel load choices – pitstops are a standard feature of the longer races. The 16-bit versions include a unique 'Improve With Mansell' mode, in which a digitized version of Nigel's head appears in the top corner of the screen, offering instructions and praise.</p>"},{"name":"Nightmare on Elm Street, A","year":1990,"developer":"Rare Limited","url":"1#Nightmare%20on%20Elm%20Street%2C%20A%20%28USA%29.nes","filesize":131088,"score":5.6,"genres":"Action > Side view > 2D scrolling > Horror > Licensed","desc":"<p>LJN's NES version of the classic horror series casts the player as a teen searching the houses on Elm Street for Freddy Krueger's bones. Once they are all collected, they must be thrown into the high school furnace to destroy Freddy once and for all (a plot similar to 1987's <em>A Nightmare on Elm Street 3: Dream Warriors</em>).</p><p><em>Nightmare</em> has two worlds. In the red-tinted \"real world,\" players fight snakes and spiders while navigating standard platform challenges. The players here have a \"sleep meter\" that depletes with every hit taken. If the player's sleep meter drops to empty, the game transitions into the blue-tinted \"dream world,\" where enemies take on the appearance of skeletons and ghosts. An invisible timer also starts, counting down until Freddy appears and forces the player into a brief boss battle. The sleep meter becomes a standard life gauge in the dream world, and deducts a life from the player if drained.</p><p>Players can find and collect three different icons in the dream world to become \"Dream Warriors\" with special powers and projectile attacks - both of which give a significant edge when fighting Freddy. Collecting all the bones in a level takes the player to a final level boss, usually taking the form of a monster with Freddy's face or trademark razor glove. Players move back and forth down Elm Street, and a new house opens up as the previous one is cleared.</p><p><em>Nightmare</em> is compatible with the NES Four Score accessory, allowing up to four players to play at once using the same screen.</p>"},{"name":"Nightshade","year":1992,"developer":"Beam Software Pty., Ltd.","url":"3#NightShade/Nightshade.nes","filesize":524304,"score":7.1,"genres":"Action > Adventure > Side view > 2D scrolling > Puzzle elements > Direct control > Menu structures > Comedy > Detective / mystery","desc":"<p>Sutekh has gotten rid of local superhero Vortex, and now Metro City is in the hands of crime. You are Nightshade - the superhero that nobody knows - and your goal is to stop the evil doers, including main villain Sutekh.</p><p><em>Nightshade</em> is a humorous adventure game, with a menu that allows the protagonist to perform various actions, such as look, take, talk, etc. Also included are some one-on-one fight scenes, which differ from the standard controls and in which Nightshade is able to jump, kick, punch and duck.</p>"},{"name":"Niji no Silkroad","year":1991,"developer":"Advance Communication Company"},{"name":"Ninja Crusaders","year":1990,"developer":"NMK Co. Ltd.","url":"2#Ninja%20Crusaders%20%28USA%29.zip","filesize":1,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Post-apocalyptic","desc":"<p>A force of alien invaders has descended upon the Earth and has wiped out humanity for the most part. Some ninjas survived the onslaught, however, and two ninjas in particular, named Blade and Talon, are assigned to rid the planet of this alien menace.</p><p><em>Ninja Crusaders</em> is a side-scrolling action game that can be played alone or with two players fighting side by side. A ninja player can jump quite high and begins the game with a ninja throwing star weapon that can travel the length of the screen, although it's not very powerful. Other weapons are available for the taking throughout the levels, each with considerably less range than the stars but with more power. These weapons include a chain whip, a sword, and a bo staff.</p>"},{"name":"Ninja Gaiden","year":1988,"developer":"Tecmo, Ltd.","url":"1#Ninja%20Gaiden%20%28USA%29.nes","filesize":262160,"score":7.8,"genres":"Action > Side view > 2D scrolling > Arcade","desc":"<p><em>Ninja Gaiden</em> begins with a cinematic animation in which two ninjas duel to the death and one goes down. It is then revealed that the doomed ninja is the father of Ryu Hayabusa. When Ryu learns of this, he embarks on a quest to find out who killed his father and why. This quest takes him to America to find an archaeologist with whom his father was working. From there, Ryu becomes embroiled in an evil, supernatural conspiracy involving a villain named Jaquio who has plans to use an ancient castle and some relics to unleash a terrifying evil upon the world.</p><p><em>Ninja Gaiden</em> is a side scrolling game where Ryu the ninja can run, jump and slash with his ninja sword. He can also attach to any vertical surface. Power-ups that allow Ryu to toss fireballs and ninja stars as well as perform other feats are scattered throughout the landscape.</p><p>Ryu will battle through urban city settings, forests, jungles, snow covered castles, underground railroads and ancient castles. A major feature in <em>Ninja Gaiden</em> are the cinematic scenes – sometimes fullscreen – through which the storyline unfolds.</p>"},{"name":"Ninja Gaiden II: The Dark Sword of Chaos","year":1990,"developer":"Tecmo, Ltd.","url":"1#Ninja%20Gaiden%20II%20-%20The%20Dark%20Sword%20of%20Chaos%20%28USA%29.nes","filesize":262160,"score":7.8,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>A year after the events of the original Ninja Gaiden, a new villain named Ashtar receives word of Jaquio's defeat. Ashtar uses this opportunity to hatch a new plan to plunge the world into darkness. The ninja, Ryu Hayabusa, hits the trail to destroy all manner of vile creatures entering the world while fighting his way to destroy Ashtar, his Dark Sword of Chaos, and whatever else is behind the evil.</p><p><em>Ninja Gaiden II: The Dark Sword of Chaos</em> is a fast paced, side scrolling action game in the tradition of the original Ninja Gaiden game. Ryu is a ninja who can run, jump, and slash with his ninja sword. He can also attach to vertical walls and climb up and down, which is an ability missing in the previous game. Powerups are hidden everywhere throughout the levels. These powerups include fireballs and ninja stars as before; a unique new powerup is the ninja shadow. Ryu can collect up to 2 ninja shadows that follow his every movement and use the same weapons at the same time that Ryu strikes.</p><p>Ninja Gaiden II tells its story through liberal use of cinematic scenes interspersed between the action levels. Different levels feature a variety of environmental interaction; e.g., one level has Ryu on a high mountain where snow is falling fast and the wind is blowing hard. The shifting direction of the snowfall indicates how the wind is blowing and Ryu has to fight against the breeze. In a night level, much of the environment is dark and is illuminated only sporadically by flashes of lightning.</p>"},{"name":"Ninja Gaiden III: The Ancient Ship of Doom","year":1991,"developer":"Tecmo, Ltd.","url":"1#Ninja%20Gaiden%20III%20-%20The%20Ancient%20Ship%20of%20Doom%20%28USA%29.nes","filesize":262160,"score":7.2,"genres":"Action > Side view > Top-down > Anime / Manga > Arcade > Platform > Shooter > Cyberpunk / dark sci-fi > Martial arts","desc":"<p>This is the third entry in the series of fast-paced ninja action games, and is the last game in the series to be released on the Nintendo Entertainment System.</p><p>Some time has passed since the defeat of Ashtar and the resurrected Jaquio, and Irene Lew has received a new mission to complete. She is to observe a strange factory that has been constructed recently for an unknown purpose, and investigate it. She proceeds to reconnoiter it, but is intercepted and apparently assassinated by her friend Ryu Hayabusa...except it isn't Ryu. It is an imposter. The real Ryu, angered over her death, and the subsequent false accusation that he murdered her, continues her mission and proceeds to investigate the factory.</p><p>As stated, this was the last game in the regular series produced for the NES. It had many features the previous games in the series did not, such as a power up to extend the length of your sword, a new vertical \"wave\" attack and vertically-scrolling levels. The US version of the game is reputed to be the hardest in the series, due to the extra damage incurred when hit, slightly shorter regular sword length, limited continues and more enemies.</p><p>The Lynx port is the second Ninja Gaiden game on the platform, the first being a port from the Arcade Version. This port is identical to the NES game, but the in-game picture is compressed for the smaller screen of the Lynx.</p>"},{"name":"Ninja Hattori-kun","year":1986,"developer":"Hudson Soft Company, Ltd."},{"name":"Ninja Jajamaru-kun","year":1985,"developer":"Jaleco Ltd.","url":"1#Ninja%20Jajamaru-kun%20%28Japan%29.nes","filesize":32784,"score":6.2,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p>In a realm of feudal Japanese folklore the eponymous Ninja Jajamaru-kun must rescue his beloved Princess Sakura from the clutches of a fiendish catfish-faced pirate. </p><p>Jajamaru-kun begins on the bottom of a three tiered horizontal field. On each level of this field there are two enemies on each tier. The tiers have weak brick ceilings that Jajamaru-kun can break by jumping into them. Once a passage is made Jajamaru-kun can move through them as can enemies. To clear a level all enemies must be defeated, most enemies can be killed by having a shuriken thrown at them, the only weapon available without a power-up, some need to be stunned either by falling through a hole in a tier or by being jumped on. Enemy projectiles can also be canceled out by the shuriken. Being touched by an enemy projectile, or in a few cases an enemies body, will instantly kill Jajamaru-kun. After an enemy has been killed its spirit will ascend, you can grab this for extra points.</p><p>In each stage at the 80 seconds remaining mark Princess Sakura will, fittingly, drop a cherry blossom onto the field. This will float through the platforms and eventually slip off the bottom of the screen, unless the ninja intercepts this message from his love. Once three blossoms have been collected a bonus stage will occur. In the bonus stage the foe is the Pirate Lord on the top throwing fire down onto Jajamaru-kun below. Here shuriken can be thrown upwards. One hit kills the pirate and frees the princess. As the game progresses these bonus stages become more difficult adding clones of the wicked lord and more fire.</p><p>As the levels progress the new enemies, based on Japanese folklore, emerge. A new enemy will always appear as a \"boss\". This new enemy will be the only one of its kind on the top tier and all the other spirits will be comprised of the previous boss. The boss will be more intelligent than the other minions. After a spirit has been the boss for several stages it will become the standard minion and loss some of its difficulty. A new more difficult boss will then appear for the next few levels, and so on.</p><p>Items can be found occasionally by breaking a brick ceiling, the items in any give stage are randomized. Items once uncovered will remain until another ceiling is broken or are picked up. Items that alter the status of ninja have a transient effect.</p><p>The items in this game are:<em> </em>Speed-up*: This red ball will increase the determined ninja's speed, now he can get behind even the most cunning kami.</p><ul><li><p><em>Ninja-cart</em>: This little carriage can crush anything in it's path and move at incredible speeds, find this and your victory will be assured!</p></li><li><p><em>Shuriken</em>: Finding this shuriken will increase the distance your deadly ninja stars can be thrown, snipe those oni.</p></li><li><p><em>Invisibility Potion</em>: A highly potent blend capable of turning this ninja, if not totally invisible, into an invincible outline.</p></li><li><p><em>Inscribed Coins</em>: These coins give additional points, different colors give different point valuations.</p></li><li><p><em>Extra Ninja</em>: These little ninjas are extra lives, very rare!</p></li><li><p><em>Bombs</em>: These two bombs can appear when a ceiling is cracked open. If the player is careless enough to jump into them after they are revealed he will surely meet his death. Enemies may pass through bombs with impunity.</p></li><li><p><em>Trusty Frog</em>: The trusty frog is Jajamaru-kun's trusty steed, by getting three different items, or by gaining four lives, the frog will appear.</p></li></ul>"},{"name":"Ninja Jajamaru: Ginga Daisakusen","year":1991,"developer":"Jaleco Ltd."},{"name":"Ninja Kid","year":1986,"developer":"Tose Co., Ltd.","url":"2#Ninja%20Kid%20%28USA%29.zip","filesize":1,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Licensed > Regional differences","desc":"<p>Based on a Japanese animated TV series, <em>Ninja Kid</em> is a side-scrolling action game in which the eponymous kid must jump and shoot his way through a series of different levels in order to complete his quest. The assorted levels include the Poison Field, Guerrila Warfare, and Blazing Inferno. While armed with ninja bullets by default, he occasionally has the opportunity to pick up other offensive items such as ninja stars, boomerangs, or fireballs. Enemies obstructing Ninja Kid's quest include rolling eyeballs, crows, flying demons, Frankenstein monsters, and of course, other ninjas.</p><p>The game begins in an overhead map that allows the player to wander into various side-scrolling levels. The levels go on an on until the player completes a particular task that makes a door appear. Going through the door sometimes leads outside to the overhead map and sometimes leads to a boss battle.</p>"},{"name":"Ninja-Kun: Majō no Bōken","year":1985,"developer":"UPL Co., Ltd"},{"name":"Nintendo Campus Challenge 1991","year":1991,"developer":""},{"name":"Nintendo World Championships 1990","year":1990,"developer":"","url":"1#Nintendo%20World%20Championships%201990%20%28USA%29.nes","filesize":262160,"score":"","genres":"Compilation > Falling block puzzle","desc":"<p>This is the cartridge that was used for the Nintendo World Championships held in 1990 in 30 cities across the U.S. and Canada. The player has a total of 6-7 minutes to play all three games but this can be changed by DIP switches on the cartridge.</p><p>The first game played is a version of Super Mario Bros. in which the player is given 99 lives and the goal of collecting 50 coins in the first level. Upon collecting the 50th coin, the \"finished the castle\" music will play and a score will be displayed.</p><p>The second game played is Course 1 of Rad Racer, using the 328 Twin Turbo vehicle. The player must finish the course as quickly as possible. No clock is shown in the game but the cartridge keeps track internally. After finishing Rad Racer, its score is displayed, multiplied by 10 and added to the previous Super Mario Bros. score.</p><p>Last up is Nintendo's Tetris in A-type mode. All remaining time for the Championship is played out here. The player's objective is simply to get the best score. The Tetris score is multiplied by 25 and added to the previous Super Mario Bros. and Rad Racer scores.</p><p>After all the time runs out, a screen will display \"Time!\" and display the final score, a sum of the previous scores and their multipliers.</p>"},{"name":"Nintendo World Cup","year":1990,"developer":"Technos Japan Corp.","url":"2#Nintendo%20World%20Cup%20%28Europe%29%20%28Rev%20B%29.zip","filesize":1,"score":6.3,"genres":"Sports > Diagonal-down > 2D scrolling > Arcade > Football (European) / Soccer > Regional differences","desc":"<p>This soccer game was made at the time when Nintendo introduced their four player adapter, and was probably made for the four playing purpose. This is shown clearly when you choose to play 2 or more players. Then you can choose between many different ground layers, like ice, grass and stone, which adds to the replayability.</p><p>When you play a one player game you play the world cup as one of the top soccer countries of that time, and you meet countries in a fixed order. Cameroon in the first match and the final is against West Germany. In an old-school fashion you lose when you play a draw, there's no extra time whatsoever.</p><p>In the game you always steer only one character, which you choose before the match starts. You can then give simple orders to you team-mates, like pass, tackle and shoot. Your moves are also limited to these moves. The game is totally lawless, so feel free to make elbow tackles without a wink from the referee. Probably it was made this way to be funnier to play against friends.</p>"},{"name":"Nishimura Kyōtarō Mystery: Blue Train Satsujin Jiken","year":1989,"developer":"Tose Co., Ltd."},{"name":"Noah's Ark","year":1992,"developer":"Source Research & Development Ltd."},{"name":"Nobunaga's Ambition","year":1988,"developer":"KOEI Co., Ltd.","url":"1#Nobunaga%27s%20Ambition%20%28USA%29.nes","filesize":262160,"score":7,"genres":"Strategy > Top-down > Turn-based > Turn-based strategy > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p>In the 16th century, Japan's Sengoku (\"Warring States\") period divided the nation into numerous feudal states, each ruled by a daimyo. These daimyos would often go to war with each other. Many dreamt of conquering the land, becoming the Shogun and ruling the entire country. One of those daimyos was the ambitious Nobunaga Oda, a merciless ruler and a renowned strategist. Players take on the role of Nobunaga Oda or one of many other daimyos to try to conquer Japan. </p><p><em>Nobunaga's Ambition</em> is a turn-based strategy game which can be played in different modes. Gameplay is similar to Koei's better known Romance of the Three Kingdoms game. Players begin by selecting either a 17 regions scenario or a larger 50 scenario. Then, the player must select a daimyo, each of which is rated attributes in several categories; Age, Health, Ambition, Luck, Charm and IQ. As the game progresses, these values change depending on events in the game. The age value represents a time limit of sorts, as an elderly daimyo becomes increasingly likely to die of old age or sickness.</p><p>During each of turn (one per season), players can issue one of several commands from a menu. They include: Recruiting new soldiers, Training the army, Buying Weapons, Increasing Peasant morale, Forming alliances or Hiring Ninjas to bribe &amp; assassinate. When one player attacks another, there is a war fought over the defender's region. Battles are fought in an overhead-view hex battle map. Each player takes turn moving units and issuing orders, which include attack, move, bribe and surrender. The goal is to defeat all of the enemy units (or force them into surrender). Army units each have a certain weakness against other types of enemies, and are also affected by the terrain.</p>"},{"name":"Nobunaga's Ambition II","year":1990,"developer":"KOEI Co., Ltd.","url":"1#Nobunaga%27s%20Ambition%20II%20%28USA%29.nes","filesize":393232,"score":"","genres":"Strategy > Top-down > Turn-based > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p><em>Nobunaga's Ambition II</em> is the sequel to Nobunaga's Ambition. The setting is 16th century feudal Japan, a period when ruthless <em>daimyo</em> (feudal lords) contended with each other for dominance. Ultimately, the winner in this struggle will become <em>Shogun</em> and hold actual power over the islands, while being nominally subject to the Emperor.</p><p>The game casts the player as one of the <em>daimyo</em>, allowing them freedom to decide the fate and future of feudal Japan, through diplomacy and ultimately war. The objective is to unify Japan under the player's rule. If the player fails through death on the battlefield, assassination at the hands of a ninja, or through natural causes, they can choose a successor and play on. Functionally, the first job is to let prosper the <em>fief</em> (province) under the player's control through agricultural development and town investment. </p><p>There are two scenarios available in the game: * <strong>Warlords: 1560 A.D.</strong>  </p><p>The first scenario begins as the <em>daimyo</em> prepare what will eventually become a full scale war in the whole of Japan. The <em>warring states period</em> begins here. There are 28 of them included in the scenario, among others: the Mori clan, the Takeda, the Hojo clan, the Uesugi clan, etc.</p><ul><li><strong>Nobunaga's Ambition: 1582 A.D.</strong>  </li></ul><p>The second scenario follows the rise of Oda Nobunaga in 1582 A.D. to power and allows the player to play either as Oda Nobunaga or as one of his chief allies or rivals.</p><p><strong>Samurai</strong>  </p><p>The game improves on its predecessor by including some 400 historical samurai in the game, providing the player with generals for troops and governors for a conquered <em>fief</em>. </p><p>Each samurai is characterized by statistics: Age, Rank, Body Points, War, Politics, Ambition, Charisma, and Loyalty. There are also additional attributes for specific military purposes: Skill, Arms Level, and Unit Type. Some of these attributes may be improved through training (i.e. war, politics, and skill), rewards (i.e. loyalty), or through merchants (i.e. arms level). </p><p><strong>Strategy</strong>  </p><p>The game is turn-based, with each turn representing one month. Certain events take place annually such as tax collecting (March) and rice harvest (September), while other events, such as invading neighbors, follows the player's time table.</p><p>The game uses an initiative system to determine what actions can be completed in a particular month. Each <em>daimyo</em> and samurai has a stock of \"Body Points\" that represent the attention he can afford to spend on an action. Each action has a cost in Body Points for the character executing it, and if he does not have the point’s necessary, he may not perform it. Body Points are refreshed a little each month. The level of Body Points refreshed per month is depends on the level of his Political skill. Intensive operations will deplete Body Points and then require turns of inaction to stock up again, so timing actions to coincide with Body Point availability is an extra wrinkle to the management of resources.</p><p><strong>Combat</strong>  </p><p>Each samurai can lead a 100-strong unit, which must be recruited, then trained, and equipped with weapons for battle. The attack of an army results in a tactical play out of the resulting battle or siege. A hex-based map of the area of the battlefield will form the playing board for the movement to combat and actual fighting. Fortifications (castles) have a dramatic benefit for the defender. The attacker must defeat the defender within 30 days or must force a withdrawal. Additionally, both sides must pay attention to their food provisions as each day subtracts food supplies in accordance to their army size.<strong>Unit Types</strong>The game introduces 3 basic military unit types: Infantry (Inf), Cavalry (Cav), and Rifles (Rif). Each unit type has certain special abilities and tactical advantages/disadvantages in combat:+ <strong>Infantry</strong> have the ability to ambush anywhere on the main <em>fief</em> map (explained later) and have 4 movement points; + <strong>Cavalry</strong> have the ability to charge at an enemy (inflicting considerable damage on both sides) with the chance of breaking through the defending unit and emerging on the other side. Samurai leaders may often be killed (instead of captured) if their unit reaches zero. Cavalry have 6 movement points; + <strong>Rifles</strong> may attack using muskets which have devastating offensive capabilities, which may also kill an enemy samurai unit if the opponent's unit reaches zero (thus, a standard non-rifle attack is also available for capturing an enemy samurai leader). Rifles have 3 movement points.</p><p>Additionally, both Infantry and Rifle units may move over walls or through water during the castle siege for a certain amount of movement points.</p><p><strong>Tactical Combat</strong>  </p><p>Tactical combat occurs in two different locations:</p><p>The first is the tactical map of the <em>fief</em>, where the attackers first arrive and the defenders surrounding the castle. In this setting, each days is divided into three time periods: morning, afternoon, and night, before the day ends. At night, armies may maneuver to surprise attack enemies in the dark, which does considerably more damage than an average attack. This may be done if the enemy is at least two squares away (not adjacent).</p><p>The second is the castle siege map, which occurs if the defender chooses to retreat to the castle from the previous map. Here, each turn represents one day, thus the time limit of the attack as well as the provisions of both sides, rapidly decrease with each turn. In this setting, the siege force must break down gates leading towards the castle for the final engagement. The defender is defeated, if the governor of the <em>fief</em> retreats, or if his unit is destroyed: resulting either in his capture or death.</p><p>The end outcome is either the fall of the <em>fief</em> to the attacking forces or victory for the defenders. Either way, captured samurai (if any) will require a prompt response for release, beheading, or recruitment to the winner's force.</p>"},{"name":"Nobunaga's Ambition: Lord of Darkness","year":1991,"developer":"Koei Tecmo Games Co., Ltd."},{"name":"Nomolos: Storming the CATsle","year":2012,"developer":"Gradual Games"},{"name":"North & South","year":1990,"developer":"Infogrames Europe SA","url":"2#North%20%26%20South%20%28Europe%29.zip","filesize":1,"score":7.1,"genres":"Action > Strategy > Side view > Top-down > Wargame > Historical events > North America > War > Licensed","desc":"<p>Based on the Belgian comic book, \"Les Tuniques Bleues\", this strategy game allows you to replay the American Civil War from both the North and the South sides.</p><p>In the strategy part of the game, you can move your troops on a map of the US. If two opposing armies enter the same state, the battle is played out in an action sequence. Additional action sequences must be accomplished when capturing an enemy fort or train.</p><p>The game also offers a two-player-mode.</p>"},{"name":"Nuts & Milk","year":1984,"developer":"Hudson Soft Company, Ltd."}]