[{"name":"Oeka Kids: Anpanman no Hiragana Daisuki","year":1991,"developer":"Tose Co., Ltd."},{"name":"Onyanko Town","year":1985,"developer":"Micronics"},{"name":"Operation Wolf","year":1989,"developer":"Taito Corporation","url":":Operation Wolf (USA) (Rev 0A)","filesize":91123,"score":7,"genres":"Action > 1st-person > 2D scrolling > Arcade > Rail shooter","desc":"<p>You have been recruited for Operation Wolf, a desperate attempt to rescue prisoners from the enemy. Through a series of missions, you'll engage a variety of enemies, from soldiers to ninjas, patrol boats to helicopters, and more. Can you carry the day?</p><p><em>Operation Wolf</em> is an arcade game by Taito. It is essentially a bitmapped \"rail-shooter\", where you basically hold the gun and shoot just about everything that moves, while conserving your ammo and grenades. Shoot ammo/grenades and healing items on the screen to \"pick them up\". Your primary machine gun can kill everything if you hit it enough times, but you can also use the grenade launcher for really deadly targets like helicopters or armored cars. You can collect a machine gun which will allow you to shoot faster for a few seconds. </p><p>You'll be pummelled by a LOT of enemies. Some will be shooting, others will be tossing grenades, knifes, and more. Some are armored and requires more than a few hits, others dodges. You can shoot grenades and knifes out of the air if you aim well enough. There are also civilians running around which can be shot, but it's not beneficial. </p><p>Bosses appear at the end of some levels, and each has a specific weakness you need to exploit.</p>"},{"name":"Operation: Secret Storm","year":1991,"developer":"Color Dreams, Inc."},{"name":"Orb-3D","year":1990,"developer":"The Software Toolworks, Inc.","url":":Orb-3d","filesize":67421,"score":"","genres":"Action > Puzzle > Top-down > Sci-fi / futuristic","desc":"<p>The evil space wizard Krohn has mastered the power to control a black hole, and plans on using this power to control the universe. You are an explorer on assignment in a remote corner of the universe. You have just been reassigned to fight Krohn since your ship, the Millennium Orb, is the only space craft cabable of withstanding Krohn's black hole. To defeat Krohn, you must get past 30 different chambers blocking the path. On the left and right side of each chamber are force fields which you must maneuver to keep the Millennium orb within the chamber. Each chamber contains a plane in the center with various targets, around which the Orb will travel. You can make the Orb dive out of it's orbital path into the plane and hit the targets. To complete each chamber you need to complete a goal with the targets (often you will need to figure out a way to clear them all.) The Millenium Orb has a limited amount of feul, however, which will be used up over time and in even greater quantities should you miss the Orb with the force fields. When fuel is low, you can head to Vern's Orb-O-Rama and use earned credits to refuel your Orb. </p><p>Included with the game is a pair of 3-D glasses which can give the game a more 3 dimensional appearance, though they aren't required for gameplay.</p><p>Due to gameplay similarities this game is often considered a follow-up of Beyond the Black Hole.</p>"},{"name":"Otaku no Seiza: An Adventure in the Otaku Galaxy","year":1991,"developer":"Advance Communication Company"},{"name":"Othello","year":1986,"developer":"Kawada Co., Ltd.","url":":Othello (USA)","filesize":18244,"score":6.2,"genres":"Strategy > Top-down > Fixed / flip-screen > Turn-based > Board game > Point and select > Licensed","desc":"<p>Othello is a conversion of the board game. Each player tries to fill the game board with as many discs of his color as possible. On each turn the player places a disc on the board by selecting a location where the  opponents discs will become trapped between two of his discs. The trapped discs are flipped over to the players color. The game ends when the board is filled or time runs out, and the player with the greatest number of his color discs on the board wins. Two players can play against each other, or one player against the computer.</p>"},{"name":"Otocky","year":1987,"developer":"Sedic"},{"name":"Outlanders","year":1987,"developer":"Micronics"},{"name":"Over Horizon","year":1991,"developer":"Pixel"},{"name":"Overlord","year":1992,"developer":"Probe Software Ltd."}]