[{"name":"P.O.W.: Prisoners of War","year":1989,"developer":"SNK Corporation","url":">POW","filesize":114207,"score":7,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Shooter > Direct control > Cold War","desc":"<p>The enemy is unstoppable. They maintain vigilant guard over their front lines! The only way to defeat them is to get behind their lines. But how? By allowing a soldier to get captured, perhaps he could escape and single-handedly defeat the enemy forces in his way. </p><p>In P.O.W., the player is a soldier who has been imprisoned in a Prisoner of War camp and must escape. In order to accomplish this, he must defeat a variety of enemies.  The foes will attack you hand-to-hand, with knives, guns, and from helicopters. Boss enemies will guard the end of each level.</p><p>To fight back, you can use hand-to-hand, and pick up weapon power-ups, found on the ground, in rooms, or dropped by enemies. These weapons include a knife, which can be used to stab or be thrown, guns and grenades.</p>"},{"name":"P'radikus Conflict","year":1990,"developer":"Color Dreams, Inc."},{"name":"Pac-Land","year":1985,"developer":"Namco Limited"},{"name":"Pac-Man","year":1984,"developer":"Namco Networks America Inc.","url":">Pac-Man%20%28Europe%29","filesize":11820,"score":7.1,"genres":"Action > Diagonal-down > Fixed / flip-screen > Arcade > Direct control > Fantasy","desc":"<p>One of the most popular and influential games of the 1980's, <em>Pac-Man</em> stars a little, yellow dot-muncher who works his way around to clear a maze of the various dots and fruit which inhabit the board.</p><p>Pac-Man's goal is continually challenged by four ghosts: The shy blue ghost Bashful (\"Inky\"), the trailing red ghost Shadow (\"Blinky\"), the fast pink ghost Speedy (\"Pinky\"), and the forgetful orange ghost Pokey (\"Clyde\"). One touch from any of these ghosts means loss of a life for Pac-Man.</p><p>Pac-Man can turn the tables on his pursuers by eating one of the four Power-Pills located around the maze. During this time, the ghosts turn blue, and Pac-Man can eat them for bonus points. This only lasts for a limited amount of time as the ghosts' eyes float back to their center box and regenerate to chase after Pac-Man again.</p><p>Survive a few rounds of gameplay, and be treated to humorous intermissions starring Pac-Man and the ghosts.</p>"},{"name":"Pac-Mania","year":1990,"developer":"Namco Limited","url":">Pac-Mania%20%28USA%29%20%28Unl%29","filesize":35701,"score":7.4,"genres":"Action > Diagonal-down > Isometric > Arcade","desc":"<p><em>Pac-Mania</em> is a variation on the game Pac-Man. You need to guide Pac-Man around a maze and eat all of the dots on the board to proceed on to the next round. Numerous, multi-colored ghosts also roam the maze trying to stop you. If you eat one of the power pellets in the maze, the ghosts will temporarily turn blue and run from you. Pac-Man can earn bonus points by eating the ghosts when they are in this state. The maze is now shown in isometric perspective and is larger than the screen which will scroll to follow the action. To help get out of tight spots, Pac-Man can now jump. But be careful, because some of the ghosts have learned this trick as well and you could end up in a mid-air collision!</p>"},{"name":"Pachicom","year":1985,"developer":"Bear's Corporation"},{"name":"Palamedes","year":1990,"developer":"Taito Corporation"},{"name":"Palamedes II: Star Twinkles","year":1991,"developer":"Hot-B Co., Ltd."},{"name":"Panic Restaurant","year":1992,"developer":"EIM Ltd.","url":">Panic%20Restaurant%20%28Europe%29","filesize":132777,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p><em>Panic Restaurant</em> is a side-scrolling platform game where you play as chef Cookie. The rival chef Ohdove has taken over his restaurant and it's up to Cookie to reclaim it.</p><p>It is a fairly basic platform game. You run and jump, and enemies are placed all around to try and stop you. The entire game, backgrounds, enemies and bosses, is food-themed. You encounter things such as sausages, microwave ovens, onions and hamburgers on your way through the restaurant. To your help you always have a frying pan to beat the enemies with, and you can also find other items, such as a spoon, and plates to throw at the enemies.</p><p>The game contains 6 stages, each in a separate location in the restaurant, such as the kitchen, freezer and basement. At the end of each level you are faced with a boss. In between each level is a bonus game where you play a slot machine to try and win some extra health and lives.</p>"},{"name":"Paperboy","year":1988,"developer":"Atari, Inc.","url":">Paperboy%20%28Europe%29","filesize":31387,"score":6.8,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Arcade > Bike / Bicycling","desc":"<p>The object of <em>Paperboy</em> is to deliver papers to your customers while inflicting as much damage as possible to the houses of your non-customers. To make things more difficult, numerous obstacles get in your way including construction workers, rogue tires, skateboarders, dogs and cats, cars, and even the occasional tornado.</p>"},{"name":"Paperboy 2","year":1991,"developer":"Tengen Ltd.","url":">Paperboy%202%20%28Europe%29","filesize":101518,"score":6.1,"genres":"Action > Diagonal-down > Isometric > Bike / Bicycling","desc":"<p>You're a paper boy. Get on your bicycle. Avoid obstacles on the road, such as dogs, cars, and basically everything you can imagine. Hell, some people shoot cannon balls at you! And you'd better be very sure to only throw papers at the right houses! (and at people, that's fun :)</p>"},{"name":"Parallel World","year":1990,"developer":"EIM Ltd."},{"name":"Parasol Stars: The Story of Bubble Bobble III","year":1992,"developer":"Taito Corporation"},{"name":"Parodius","year":1990,"developer":"Konami Co., Ltd.","url":">Parodius%20%28Europe%29","filesize":171804,"score":8.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter > Comedy > Regional differences","desc":"<p>This is mostly the parody of Gradius (Nemesis on some systems), with some flavor from other shoot-em-ups, like Twinbee. The series is available on numerous platforms.</p><p>The game is a right-to-left scrolling shoot-em-up. You can choose from 4 different flying creatures, with different weapons. You must finish 7 stages, each having a boss at the end. You may start at either one, but must complete every level to advance to the final stage.</p>"},{"name":"Peek-A-Boo Poker","year":1990,"developer":"Hacker International"},{"name":"Penguin Hideout","year":1990,"developer":"Sachen"},{"name":"Penguin-Kun Wars","year":1985,"developer":"ASCII Corporation"},{"name":"Perfect Bowling","year":1989,"developer":"Aisystem Tokyo"},{"name":"Perfect Pair","year":2016,"developer":"Retroscribe"},{"name":"Perkele!: Suomi 100 Vuotta","year":2017,"developer":"AasiPelit"},{"name":"Pesterminator: The Western Exterminator","year":1990,"developer":"Color Dreams, Inc.","url":">Pesterminator%20%28USA%29%20%28Unl%29","filesize":60872,"score":"","genres":"Action > Side view > Platform > Shooter > Helicopter > Sci-fi / futuristic","desc":"<p>When Ronnie the Super Rat radiates earth with a pest beam from his moon base, the world leaders' only hope is Kernel Kleanup, the mascot from the <em>Western Exterminator Company</em>. With his trusty hammer, Kernel needs to clear the levels by slamming all loose bugs. You will be haunted by spiders, ants, fireflies, worms, sharks, jellyfish and mutants.</p><p>The nine levels are pretty straightforward side-scrolling platform stages, with a nice twist in level 5, 7 and 8.1 (a helicopter, underwater and moon surface level respectively). While playing, you can view a status report with the remaining bugs to be found. Some defeated enemies leave behind hearts (extra lives) and the final level introduces an adventure element when you have to find a key card to open the door to Ronnie's lair.</p>"},{"name":"Phantom Fighter","year":1988,"developer":"Marionette Co., Ltd.","url":">Phantom%20Fighter%20%28USA%29","filesize":120011,"score":6.4,"genres":"Action > Side view > Fighting > Martial arts > Licensed","desc":"<p>Based on the 1985 Hong Kong movie, \"Mr. Vampire\", <em>Phantom Fighter</em> puts the player in the role of a Chinese warrior who walks with your pupil through several Chinese towns taken by phantoms. Enter each house and beat 'em up using a variety of kung-fu moves. After defeating a phantom, you'll receive a special gift that recovers your energy or enhances your fighting skills. During the game, you talk to different people who help you to understand what's going on.</p>"},{"name":"Pictionary: The Game of Video Quick Draw","year":1990,"developer":"Software Creations Ltd."},{"name":"Pin-Bot","year":1990,"developer":"Rare Limited","url":">Pin%20Bot%20%28USA%29","filesize":104444,"score":6.9,"genres":"Action > Simulation > Diagonal-down > Pinball","desc":"<p>Pin-Bot is a conversion of the arcade pinball game by Williams Electronics. The game is played with a split screen; the bottom half of the screen remains on your flippers, while the top half scrolls to follow the ball(s) on the table. In addition to recreating the pinball game's table, lights, and sounds several video game elements have been added, such as monsters that like to eat pinballs. Up to four players can compete against Pin-Bot!</p>"},{"name":"Pinball","year":1984,"developer":"Nintendo Co., Ltd.","url":">Pinball%20%28World%29","filesize":16270,"score":6.3,"genres":"Action > Pinball","desc":"<p>Try to keep the ball out of the little hole at the bottom of the board by using two flippers (in case somebody doesn't know what kind of game pinball is :).</p><p>The playing field is splitted into two parts, so if the ball falls down the first little hole you aren't dead yet: you get to play on the bottom floor.</p><p>If you are lucky you get to play the bonus game where Mario makes an cameo appearance: bounce the ball off a platform on top of your head to save Pauline.</p><p>Pinball was one of the very first NES games ever released.</p>"},{"name":"Pinball Quest","year":1989,"developer":"Tose Co., Ltd.","url":">Pinball%20Quest%20%28USA%29","filesize":111534,"score":6.9,"genres":"Role-playing (RPG) > Simulation > Top-down > Pinball > Fantasy","desc":"<p><em>Pinball Quest</em> is billed as a pinball role-playing game, though the term is used loosely, as you only earn gold to buy stoppers and more powerful flippers. Actually, there are four different modes of play. The RPG-mode has six, multi-screen pinball tables, where you use your flippers to knock the pinball into enemies, find keys, and eventually rescue Princess Bali. The other modes, POP!POP!, Viva Golf, and Circus, are each specialized multi-screen pinball tables involving sports, golf, and the circus. The latter has a slot machine and a bonus game in which you throw balls at animals to save the girl they are chasing.</p>"},{"name":"Ping Pong","year":1987,"developer":"Konami Industry Co. Ltd."},{"name":"Pipe Dream","year":1990,"developer":"The Assembly Line","url":">Pipe%20Dream%20%28USA%29","filesize":31469,"score":7.7,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Point and select","desc":"<p>Each level of this abstract puzzler challenges the player to set up a network of pipes to allow an unspecified substance known as 'flooz' to flow through as many of those as possible. The pieces are offered in random order, and there are seven different types - straight lines going horizontally or vertically, corners rotating in each of the four directions, and cross-over pieces which carry the flooz straight across horizontally and vertically. Each of these can be entered from either side. When the flooz hits a gap or a piece that the previous piece can't flow into, the pipe is finished.</p><p>Before the flooz starts flowing from its randomly-selected starting position, the player has several seconds to start placing pieces. They can be put down anywhere. However, a situation that can often occur is there will be a long and complex piping arrangement set up, yet a gap somewhere remains to be filled. Players are able to replace a piece with another in the same square (to make it easier to flow the flooz that way), but for a slight scoring penalty.</p><p>Bonuses are awarded for looping the flooz through both sides of at least 5 cross-over pieces or passing the flooz through every square on the screen. Later levels have some squares on the grid blocked off, a few gaps in the side-wall (allowing flooz to thread to the other side of the screen). After every four levels, there is a bonus game for points, in which the player can only place the pieces in the lowest open space in each column, similarly to the board game of \"Connect 4\".</p>"},{"name":"Pixel Poops: Number Two","year":2021,"developer":"Techmaster Games"},{"name":"Pizza Pop!","year":1992,"developer":"Arc Co., Ltd."},{"name":"Platoon","year":1988,"developer":"Ocean Software Ltd.","url":">Platoon%20%28USA%29","filesize":91817,"score":6.5,"genres":"Action > 1st-person > Side view > 2D scrolling > Fixed / flip-screen > Shooter > Licensed","desc":"<p>The film Platoon featured a squad of five soldiers on their mission for the US Army in Vietnam. In this action game based around the film, you take control of these five guys in turn, with the chance to switch between them as they each take one of the 3 hits that would kill them.</p><p>The game recreates each of the sections of the film, starting with a side-scrolling journey through the jungle, with paths to cross both horizontally and vertically, and the ability to jump or duck hazards. You will need to blow up a bridge and then locate a village, which contains a torch, a map and a trap-door. The enemy has booby-trapped the area and are launching airstrikes, so the danger is not all from enemy ground soldiers.</p><p>The next section is in first-person 3D, as you move through a network of tunnels in search of flares and a compass. There are 3 distinct control methods, changing from the standard motion when an enemy appears (this puts you in control of a cross-hair for more accurate targeting), and when you enter a room to search.</p><p>After escaping this you settle in a bunker overnight, and have a limited amount of flares with which to locate incoming enemy, and must then shoot them before they can shoot you. The jungle airstrike from the film is the next moment - you have two minutes to rush into a safe position to the north, using your compass for guidance.</p><p>Finally you face the treacherous Sergeant Barnes, and must hit him with grenades 5 times whilst trapped in a foxhole to prevent him wiping you out.</p>"},{"name":"Plotting","year":1989,"developer":"Taito Corporation"},{"name":"Pocket Zaurus: Jū Ōken no Nazo","year":1987,"developer":"Tose Co., Ltd."},{"name":"Pooyan","year":1985,"developer":"Konami Industry Co. Ltd."},{"name":"Popeye","year":1983,"developer":"Nintendo Co., Ltd.","url":">Popeye%20%28World%29%20%28Rev%20A%29","filesize":17090,"score":6.8,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform > Licensed","desc":"<p>As <em>Popeye</em>, you are trying to win Olive Oyl's love! She is at the top of the screen dropping tokens of her love, and you need to collect them before they hit the ground. After you have collected the required number of items, you can move on to the next, more difficult level. There are many obstacles trying to stop you from completing your task, though! Brutus wanders around the screen and is constantly trying to catch you. If you collect a can of spinach, you can temporarily knock him out, otherwise, Brutus will knock you out. Other objects such as bottles or birds are also flying around the screen and will cause you to lose one of your lives if you are hit. Each level features a different layout of platforms and ladders, and will have you collecting different items as they float towards the bottom of the screen!</p>"},{"name":"Popeye no Eigo Asobi","year":1983,"developer":""},{"name":"Portopia Renzoku Satsujin Jiken","year":1985,"developer":""},{"name":"Power Blade","year":1991,"developer":"Taito Corporation","url":">Power%20Blade%20%28Europe%29","filesize":126631,"score":7.5,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>It is the year 2191, and Earth's blissful existence was governed by a master computer. Then suddenly, its master control program malfunctioned, and people panicked ensuring total chaos. Secret Agent Nova is called in to locate agents located in six sectors. These agents hold an ID card which Nova must acquire to gain access to the security room within each sector. There, he must defeat the guards and obtain secret tape units, and if Nova obtains six of these, he will be able to gain entry to the control center and defeat the guard to destroy the computer and restore order to society.</p><p><em>Power Blade</em> is a platform game, in which you must run through the level, destroying various enemies, and exit through the door. However, you can't leave each sector without locating agents. By destroy enemies, you can get power-ups which restore your energy or upgrade your weapon. Occasionally, you can get a special power-up which transforms you into a Mech, which has a special attack mode and three units of energy.</p><p>You must get through each sector before time runs out. You can leave a sector without getting the ID card and go to another sector, and come back when you're ready.</p><p><em>Power Blade</em> is the significantly altered US Version of <em>Power Blazer</em>.</p>"},{"name":"Power Blade 2","year":1992,"developer":"Natsume Co., Ltd.","url":">Power%20Blade%202%20%28USA%29","filesize":151316,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Cyberpunk / dark sci-fi","desc":"<p>Christmas Eve, 2200.</p><p>The Delta Foundation has just finished the development of a cyborg unit which represents a new generation of fighting robots. They want to sell it to the government's department of defense as it would pose a threat to the security of the nation if it is sold to a foreign country. They have asked the president, who is actually an alien from outer space, to consider their offer and respond in one week. The government takes this matter very seriously, and assigns Nova to destroy the Delta Foundation. Unfortunately, the government cannot be involved in the event that something might happen to him.</p><p><em>Power Blade 2</em> has six stages which involve you running through the level, while killing off enemies and avoiding hazards. At the start, you can choose which stage to start at, but unlike <em>Power Blade</em>, once you have chosen a stage, you can't exit and choose another one until you have completed the current one first. Nearly each stage involves you using your wits, as you dodge spikes, jumping towards the top of the screen to avoid fire, and getting fans to lift you onto platforms. You can also slide your way through tight spots, as long as you slide in the right place.</p><p>At the end of each stage, you fight a different boss. However, in the end, you must fight all the bosses you fought before you get to fight the alien leader.</p>"},{"name":"Power Blazer","year":1990,"developer":"Taito Corporation"},{"name":"Power Punch II","year":1992,"developer":"American Softworks Corporation","url":">Power%20Punch%20II%20%28USA%29","filesize":195421,"score":"","genres":"Action > Sports > Behind view > Fixed / flip-screen > Arcade > Boxing","desc":"<p>Mark Tyler, the world's most famous boxer, boasts that he is absolutely invincible and that he can defeat any contender in the world. Nay, the universe! Well, as luck would have it, a race of alien fighters heard Mark's claims and have decided to abduct him and pit him against the fiercest boxers in the galaxy.</p><p><em>Power Punch 2</em> is a one-on-one boxing game à la Punch Out, in which you control Mark as he battles all of the alien contenders in hopes of winning the galactic boxing belt. The game is played from a third person perspective from which you see both fighters as they fight. You have rudimentary movement controls but the basic mechanics involve dodging and timing your attacks so that you can break the enemies' patterns. Between fights you get to train in a gym, which involve taking part in a series of mini-games with the rewards being upgraded strength, speed, or health for your upcoming bout.</p>"},{"name":"Predator","year":1988,"developer":"Klon","url":">Predator%20%28USA%29","filesize":90330,"score":4.9,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>Predator: Soon The Hunt Will Begin</em> is a 2D action game. There are 30 stages in the game, and each one is split up into two modes: Jungle Mode, and Big Mode. </p><p>In Jungle Mode, the object of the game is to survive the dangers of the jungle while you shoot down guerillas and wildlife using a variety of weapons including machine guns, laser rays, and grenades (all with unlimited ammo). You exit the stage by entering a cave to proceed to the next level. Sometimes there is more than one cave, and you will be warped to another stage other than the next one, depending on what cave you enter.</p><p>After three or so stages, you enter the game's Big Mode. The object here is to blast blue and purple spheres before they have a chance to hurt you. Some spheres have power-ups that will increase your firepower. When you have made some distance, you have to defeat the Predator before you can continue on to the next stage. Big Mode is the same throughout the game, but the only difference here is the Predator's attack pattern.</p>"},{"name":"Prince of Persia","year":1992,"developer":"Brøderbund Software, Inc.","url":">Prince%20of%20Persia%20%28USA%29","filesize":74977,"score":8.2,"genres":"Action > Side view > Fixed / flip-screen > Platform > Puzzle elements > Direct control > Middle East > Regional differences","desc":"<p>While the Sultan of Persia is fighting a war in a foreign country, his Grand Vizier Jaffar orchestrates a coup d'état. His way to the throne lies through the Sultan's lovely daughter. Jaffar kidnaps her and threatens to kill her if she refuses to marry him. Meanwhile, the man the Princess loves is thrown into the dungeon. He has only one hour to escape from his prison, defeat the guards on his way, and stop Jaffar before the terrible marriage takes place.</p><p><em>Prince of Persia</em> is a 2D platformer that is commonly regarded as a progenitor of the cinematic platformer genre. Rather than following the more common jump-and-run mechanics, it focuses on careful advancement through fairly complex levels, emphasizing the protagonist's vulnerability and survival aspect. Rotoscoping technique is used to give more realism to the animation of the characters' movements.</p><p>The protagonist must avoid deadly traps, solve some simple jumping and environmental puzzles (such as stepping on pressure plates to raise portcullis), and engage in sword fights with the guards. The player character has an infinite amount of lives, but has to restart at the beginning of a level each time he dies, and must complete the game within an hour. The hero starts with three units of health, which can be replenished with small health potions or permanently increased with large jars.</p><p>The Game Boy Color and SNES versions of the game feature additional levels and new enemies. The Genesis version has a new intro, an altered set of graphics and four new levels.</p>"},{"name":"Princess Tomato in the Salad Kingdom","year":1988,"developer":"Hudson Soft Company, Ltd.","url":">Princess%20Tomato%20in%20the%20Salad%20Kingdom%20%28USA%29","filesize":193094,"score":6.9,"genres":"Adventure > 1st-person > Puzzle elements","desc":"<p>Many growing seasons ago, the Salad Kingdom was a peaceful land. But one day, minister Pumpkin betrayed king Broccoli, kidnapped princess Tomato, stole the royal Turnip Emblem, and took them to his castle in Zucchini mountains. He sent his cruel Farmies to terrorize the Salad Kingdom. Shortly thereafter, the king died, unable to recover from the loss of his beautiful daughter. But he promised you, the brave Sir Cucumber, the princess' hand and the entire kingdom, if you save the beautiful Tomato from the clutches of the evil Pumpkin. </p><p><em>Princess Tomato</em> is an adventure game in which the player interacts with the environment by choosing commands from a menu, such as the traditional \"check\" or \"give\", and the less traditional \"praise\" or \"percy\". Percy is a little persimmon who will be the hero's trusty side-kick throughout the quest and will help him on many occasions. The puzzles are on the simple side, and are primarily based on talking to characters, finding items and giving them.</p><p>This version is a remake of the computer game Salad no Kuni no Tomato-hime; it features re-designed characters and locations, some changes in dialogue and story, menu-based interaction instead of a text parser, and the addition of a rock-paper-scissors-like mini-game <em>Finger Battle</em>.</p>"},{"name":"Pro Golfer Saru: Kage no Tournament","year":1987,"developer":"Tose Co., Ltd."},{"name":"Pro Sport Hockey","year":1993,"developer":"Tose Co., Ltd.","url":">Pro%20Sport%20Hockey%20%28USA%29","filesize":129105,"score":5.8,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p>This hockey game includes 24 NHL teams and 288 NHLPA players. The NES version contains an exhibition, training and a super cup mode. The SNES version has a practice and a season mode. The training mode in the NES version allows you to practice both offense and defense. The training mode in the SNES version lets you either practice in an exhibition game or compete in a shootout. The super cup is based on the round-robin format in the NES version. The teams chosen to compete in the super cup are decided by the teams rankings from the season mode in the SNES version.</p><p>The game is played with a top down view of the hockey rink, with the screen scrolling vertically as the puck carrier heads towards a net.</p>"},{"name":"Pro Wrestling","year":1986,"developer":"TRY Co., Ltd.","url":">Pro%20Wrestling","filesize":52391,"score":6.6,"genres":"Sports > Diagonal-down > 2D scrolling > Wrestling","desc":"<p>Pro Wrestling is an action wrestling game for one or two players. By using different controller combinations you can perform a wide variety of moves to try and beat your opponent in a 5 minute match. In the one player version, you need to fight your way to first place (but the game will be over if you fall below 6th place). There are seven different wrestlers to fight before you can be declared the Video Wrestling Association champion!</p>"},{"name":"Pro Yakyū Family Stadium '87","year":1987,"developer":"Namco Limited"},{"name":"Professional Mahjong Gokū","year":1986,"developer":"Chat Noir Co., Ltd."},{"name":"Project Blue","year":2020,"developer":""},{"name":"Pulsar no Hikari: Space Wars Simulation","year":1987,"developer":"Soft Pro International"},{"name":"Punch-Out!!","year":1987,"developer":"Nintendo","url":">Punch%20Out","filesize":133824,"score":"","genres":"Sports > Behind view > Direct control > Boxing","desc":"<p><em>Punch-Out!!</em> is a humorous boxing game that started Nintendo's acclaimed game series. You take the role of a boxer who participates in a boxing tournament. You can strike with left or right hand, deliver uppercuts and hooks, dodge in either direction and block the blows. Unlike the similarly titled NES game, in the Arcade version the protagonist is shown directly from behind as a wireframe. There are six opponents to beat and when the last opponent is defeated the game loops. The arcade cabinet is notable for having two monitors one above another: the upper monitor is used to display game statistics, while the lower one shows the actual boxing ring.</p>"},{"name":"Punisher, The","year":1990,"developer":"Beam Software Pty., Ltd.","url":">Punisher%2C%20The%20%28USA%29","filesize":122764,"score":6.7,"genres":"Action > Behind view > 2D scrolling > Rail shooter > Licensed","desc":"<p>The NES version of The Punisher is an on-rails shooter tracking behind Frank Castle as he trades fire with the gangs of some of his classic enemies. Aside from being one of the few NES rail shooters, the game features an uncommon amount of destructible items in its levels. You also have the ability to move Frank to the left or right of the screen to dodge incoming fire, or to hold down the fire button to lock him in place and move the aiming cursor.</p><p>The game features six \"missions\" with a number of varying environments and levels within them. Standard pickups of armor and increased firepower are present, as well as grenades which can be launched with the B button. Earning a 100% kill rating (as The Punisher would surely try to do) gives an unlimited \"Super Gun\" upgrade for the next stage.</p>"},{"name":"Puss N Boots: Pero's Great Adventure","year":1990,"developer":"Shouei System","url":">Puss%20n%20Boots%20-%20Pero%27s%20Great%20Adventure%20%28USA%29","filesize":65518,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Licensed","desc":"<p>Join Pero as he travels through time to defeat the evil Count Gruemon in this platform-hoping, side-scrolling shooter adventure! Visit strange new locales such as the Wild West, Arabia, London, New York and outer space! Meet the denizens of these great places and shoot 'em! Pilot airplanes, submarines and even a hot air balloon!</p><p><em>Puss N Boots: Pero's Great Adventure</em> is an action/adventure title that doesn't settle for just one style of gameplay. One level might have you jumping along the ledges of buildings, shooting at baddies only to continue the action in an airplane, flying as you shoot at anything in your path. There are a total of seven different levels to travel through, each one generally being broken up into at least two sections with different modes of transportation for each one.</p><p>Toei, the Japanese publisher, is best known as an anime studio. Puss N Boots is based on one of their earliest films and Pero is their mascot.</p>"},{"name":"Puyo Puyo","year":1991,"developer":"Compile"},{"name":"Puzzle","year":1990,"developer":"American Video Entertainment Inc.","url":">Puzzle%20%28USA%29%20%28Unl%29","filesize":36662,"score":"","genres":"Puzzle","desc":"<p>The object of Puzzle is to reassemble a picture which has been scrambled. The picture is broken into a number of pieces with one or more open spaces. Slide the pieces into the open spaces to rearrange them back into the proper order. If you're stuck, you have the option of challenging the computer to a game of chance like rock, paper, scissors or roll the dice. This will subtract 60 seconds from your time, but if won allows any two pieces on the board to be swapped. If you forget what the picture looks like, you can pause the game and see the completed version, but this can only be done five times per puzzle. There are eight different levels, plus two additional expert levels.</p>"},{"name":"Puzznic","year":1990,"developer":"Taito Corporation","url":">Puzznic%20%28USA%29","filesize":38614,"score":7.3,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Tile matching puzzle > Point and select","desc":"<p>The challenge in each level of <em>Puzznic</em> is to manoeuvre a selection of blocks into place so as to clear them all, by making them make contact with blocks of the same design. You control a cross-hair, which can move a block left or right, which can cause it to fall if there is no block under the space it would occupy.</p><p>There are many complications in terms of solving the levels. Moving platforms meaning that you need to move a block at a particular time, or in particular order, to prevent them being blockaded. In some situations there are an odd number of a certain type of block - solving these requires positioning two of the blocks one space apart, such that a move will result in a piece making contact with two others, and immediately removing all three. You will also encounter blocks positioned on platforms suspended in space and gaps in level arrangements meaning that a certain number of blocks must be in place to make a certain move possible (by forming a stack, for example).</p><p>The game structure is slightly unusual, as after you complete each batch of four levels you get a choice of two sets of levels - you are progressing through an expanding matrix of levels, which means there are two sets on level 2, three on level 3, four on level 4, and so on. This means that there are a total of 220 screens in the game. Each screen is played against a time limit, and losing a level (either by running out of time, or by making a poor move and leaving an impossible position) loses one of your three lives.</p>"},{"name":"Pyramid","year":1990,"developer":"Thin Chen Enterprise"},{"name":"Pyramids of Ra","year":2019,"developer":"Source Research & Development Ltd."},{"name":"Pyros","year":1988,"developer":"Toaplan Co., Ltd."}]