[{"name":"Q Boy","year":1994,"developer":"Thin Chen Enterprise"},{"name":"Q*bert","year":1989,"developer":"Western Technologies Inc.","url":">Q_bert","filesize":27756,"score":6.9,"genres":"Action > Puzzle > Diagonal-down > Fixed / flip-screen > Isometric > Platform > Direct control > Fantasy","desc":"<p><em>Q*bert</em> is a popular arcade game. The goal is to change all of the tiles on a pyramid to the target color. To do this you guide Q*bert around the pyramid, and every tile he hops on will change color. On early levels, a single hop will change the tile to the desired color, but on later levels, you may need to hop on a tile multiple times or even avoid hopping on a tile multiple times! Trying to stop Q*bert are many different creatures wandering around the board, including Coily the snake, Slick and Sam, and falling balls. On the edge of the board are floating discs; if Q*bert jumps on one of these discs when the snake is in pursuit, the snake will fall off the board while Q*bert is safely transported to the top.</p>"},{"name":"QIX","year":1991,"developer":"Threshold Research","url":">QIX%20%28USA%29","filesize":30780,"score":7.1,"genres":"Action > Puzzle > Top-down > Fixed / flip-screen > Arcade > Direct control","desc":"<p>In this game, you guide a marker which must draw rectangles and other weird objects in order to claim your territory, and you can either draw these rectangles fast or slow. Drawing the rectangles using the \"slow\" method awards you the most points. Once a rectangle has been made, it will be colored in to show that you have claimed your territory. While drawing the rectangles, you need to watch out for Qix (pronounced \"kicks\"), a series of colored lines that crawl the screen. In addition to Qix, you also need to avoid the Sparks who travel around the border, as well as any lines that you have made, as well as The Fuse, who travels along the line that you are drawing. Once you have claimed enough territory, you proceed to the next level.</p>"},{"name":"Quarth","year":1990,"developer":"Konami Industry Co. Ltd."},{"name":"Quattro Adventure","year":1993,"developer":"The Codemasters Software Company Limited","url":">Quattro%20Adventure%20%28USA%29%20%28Unl%29","filesize":181194,"score":6.2,"genres":"Action > Side view > Arcade > Platform > Puzzle elements","desc":"<p><em>Quattro Adventure</em> features four action games on one cartridge.</p><ul><li><p>Boomerang Kid: It's a little known fact that boomerangs don't actually return when you chuck them. It took the Boomerang Kid an entire day to find this out, and he has lost an entire boomerang collection. Now he has to set out to collect them all. They are scattered throughout the outback, with plenty of treacherous terrain and a variety of wildlife to get past before all the boomerangs can be found.</p></li><li><p>Super Robin Hood:Marion is being held captive in a castle by the Sheriff of Nottingham. It is up to Robin Hood to rescue her! The castle is heavily guarded, and there are many secret passages to find and locked doors to get past.</p></li><li><p>Treasure Island Dizzy:Dizzy has set out on his new boat, the HMS Eggwhite, for a short vacation. After a storm throws him off course, he ends up stranded on a strange island. Dizzy must now explore the island and find a way to repair his ship in order to get back home. </p></li><li><p>Linus Spacehead:Linus has crash landed on a distant planet called Earth. Unfortunately, the landing has broken his radio so he can't radio home for help. Linus needs to locate all the radio parts that have been scattered throughout this strange world. Many dangerous creatures and alien landscapes make this a challenging task.</p></li></ul>"},{"name":"Quattro Arcade","year":1992,"developer":"The Codemasters Software Company Limited"},{"name":"Quattro Sports","year":1993,"developer":"The Codemasters Software Company Limited"},{"name":"Quest of Ki, The","year":1988,"developer":"GAME STUDIO Inc."}]