[{"name":"R.B.I. Baseball","year":1986,"developer":"Namco Limited","url":"3#RBI_Baseball/Rbi_baseball.nes","filesize":262160,"score":6.2,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed > Regional differences","desc":"<p>Here's the baseball action that started it all - the one, the only, the original RBI. With permission from the Major League Players Association, this game uses the names and likenesses of real baseball players. This means the ten different teams in the Tengen league can have lineups that include baseball stars of the time; such as Reggie Jackson, Fernando Valenzuela, and Willie McGee. Stats and abilities have been structured to give each player strengths and weaknesses he had in the 1986 and 1987 seasons. You'll have to use your knowledge of real players and teams to manage your lineup effectively.</p><p>The teams you can choose from include Detroit, California, Houston, San Francisco, and even the American and National League All-Star teams. In One-Player mode you compete with the computer for the pennant in a nine game season. If you want to go head-to-head with a friend, you can each pick your favorite team and then compete in your own best-of-seven series.</p>"},{"name":"R.B.I. Baseball 2","year":1990,"developer":"Tengen Inc.","url":"3#RBI_Baseball_2/Rbi_baseball2.nes","filesize":262287,"score":7.2,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p><em>R.B.I. Baseball 2</em> features all 26 major league teams, each with a full roster of players. You can choose any National or American League team. You can even play one of the 1989 All-Star squads.</p><p>The game features One Player and Two Player options as well as a Password mode to enable you to play a full season (one game against every team in the division). In addition, a watch mode provides you with the best seat in the house for a computer-controlled match up.</p><p>This second version is similar to the original game in terms of gameplay. This time around the game uses the teams and statistics from the 1989 season. Just as in the original, you get to see what it's like to step up to the plate as Ricky Henderson, pitch the ball like Nolan Ryan, and catch a line drive like Ozzie Smith.</p>"},{"name":"R.B.I. Baseball 3","year":1991,"developer":"Tengen Inc.","url":"3#RBI_Baseball_3/Rbi_baseball3.nes","filesize":196624,"score":6.1,"genres":"Sports > Diagonal-down > Baseball > Licensed","desc":"<p><em>R.B.I. Baseball 3</em> took the popular baseball series a step further statistically, adding each Major League Baseball division winning team from 1983-1990, in addition to the 1989 All Star teams and all 26 1990 teams (with full 1989 statistics). Want to see how the 1986 Mets might have done against the 1987 Twins? Here's your chance.</p><p>The game was licensed by the Major League Baseball Players' Association; thus, real Major League players and statistics are included, but the teams themselves are represented only by their home cities. Team names are not used. Also, retired players who were no longer under contract with the MLBPA in 1991 are not present. Rather, they are represented by their initials and their fielding positions.</p><p>Game mechanics remain unchanged from R.B.I. Baseball 2, focusing more on arcade fun than realistic gameplay.</p>"},{"name":"R.C. Pro-Am","year":1988,"developer":"Rare Limited","url":"1#R.C.%20Pro-Am%20%28USA%29.nes","filesize":65552,"score":7.4,"genres":"Action > Racing / Driving > Diagonal-down > 2D scrolling > Isometric > Arcade > Automobile > Track racing > Vehicular combat","desc":"<p>Guide your radio controlled car to victory in this racing game. You have to beat your 3 opponents on 32 tracks while avoiding obstacles like water and oil puddles and collecting bonus items like better engines and tires.You can also collect a variety of weapons to blast your opponents out of the way.</p><p>The Genesis version is basically the same game as the NES version with a few minor changes such as having 5 opponents instead of 3, spelling out CHAMPION instead of NINTENDO, and having enhanced graphics.</p>"},{"name":"R.C. Pro-Am II","year":1992,"developer":"Rare Limited","url":"1#R.C.%20Pro-Am%20II%20%28USA%29.nes","filesize":262160,"score":7.8,"genres":"Racing / Driving > Diagonal-down > Isometric > Arcade > Automobile > Track racing","desc":"<p>This second Pro-Am racing game for NES introduces some innovations compared to its predecessor. Once again, you have to bring your red radio-controlled car to victory, score points, hit turbo speed lines, and leave no chance to your blue, green, and yellow adversaries. But you can also upgrade your engine and tires - if you can afford it, which means you'll have to think seriously about gathering those dollar signs scattered on the track. The tracks themselves have more variety, some have unusual enemies (little planes bombing you from above), and more kinds of obstacles. You also have several lives and don't die immediately if you arrived last.</p>"},{"name":"Race America","year":1992,"developer":"Imagineering Inc.","url":"1#Race%20America%20%28USA%29.nes","filesize":262160,"score":6.4,"genres":"Racing / Driving > Behind view > Side view > Top-down > 2D scrolling > Automobile","desc":"<p><em>Race America</em> is a 2-car cross-country racing game. Either 2 players can compete on the same screen, or the computer can control the second player. The game provides eight colorful opponents to race against, each of whom is supposed to have distinct advantages in a race. Each race begins from a side-scrolling perspective as the 2 competitors speed out of the gate. After a certain distance, the perspective shifts to third person and the driver in the lead occupies the top half of the screen while the driver in second is relegated to half of the lower screen. Occasionally, the game also employs an overhead view. To add to the challenge, the game's cars have 6-speed manual transmissions which players must shift using the control pad, but not while pressing the gas button.</p>"},{"name":"Racket Attack","year":1988,"developer":"Tose Co., Ltd.","url":"3#Racket_Attack/Racket_attack.nes","filesize":524304,"score":6.3,"genres":"Sports > Tennis","desc":"<p>In Racket Attack you choose between two different modes of play. One Player tennis drops you right into the middle of a national tennis tournament. Win seven increasingly difficult matches and you'll take home the championship trophy. Two Plater tennis puts you on opposite sides of the net, hitting it out in head-to-head singles action.</p><p>Once you've selected your mode of play decide between men's and women's tennis and choose from eight players in each category. each of the eight different men and women players has different strengths and weaknesses. </p><p>Once you've picked your player, it's time to select your court surface. The game features hard, clay, and grass courts. Then it's time to serve it up. Play follows the regular rules of tennis. Win your match by winning two out of three sets.</p>"},{"name":"Rackets & Rivals","year":1993,"developer":""},{"name":"Rad Action","year":1988,"developer":"UPL Co., Ltd"},{"name":"Rad Racer","year":1987,"developer":"Square Co., Ltd.","url":"1#Rad%20Racer%20%28USA%29.nes","filesize":131088,"score":7.4,"genres":"Action > Racing / Driving > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>Rad Racer is an arcade style 3-D racing game. The object of the game is to race to the goal within the given time limit. Along each course are several checkpoints which will increase the amount of time you have to reach the final destination. There are eight different stages with increasingly difficult roads, changing weather conditions, and a variety of opponents who tend to get in the way. Included with the game is an optional pair of red-blue 3-D glasses which can be used to give the game an even more 3-D appearance.</p>"},{"name":"Rad Racer II","year":1990,"developer":"Square Co., Ltd.","url":"1#Rad%20Racer%20II%20%28USA%29.nes","filesize":131088,"score":7,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Rad Racer II</em> is an arcade style racing game which is the sequel to Rad Racer and features similar gameplay. Played with a 3D perspective from behind your vehicle, the goal is to race through a series of different tracks before time runs out. Along each track are several checkpoints; crossing a checkpoint will increase the amount of time you have to reach the final destination. Eight new tracks are featured (with new graphics and music), each with a variety of hills, turns, obstacles, and other cars to get in your way. Crashing into other cars or any obstacles on the side of the road cause you to slow down or come to a stop and lose valuable time. Also new is a turbo boost which allows you to reach speeds of 255 mph. Unlike the original game, you now only have a choice of one car and the red-blue 3D glasses aren't supported.</p>"},{"name":"Rad Racket: Deluxe Tennis II","year":1991,"developer":"Idea-Tek, Inc."},{"name":"Radia Senki: Reimeihen","year":1991,"developer":"Tecmo, Ltd."},{"name":"Raid 2020","year":1989,"developer":"Color Dreams, Inc."},{"name":"Raid on Bungeling Bay","year":1985,"developer":"Brøderbund Software, Inc.","url":"1#Raid%20on%20Bungeling%20Bay%20%28USA%29.nes","filesize":24592,"score":6.7,"genres":"Action > Top-down > 2D scrolling > Shooter > Helicopter","desc":"<p><em>Raid on Bungeling Bay</em> has the player controlling a helicopter which is on a mission to destroy everything that moves. The only ally is the carrier, which is where the player begins at each level and may return to for repair and pick up bombs, as long as the player manages to protect it from being destroyed. The main goal in each level is to destroy a factory, which requires a steady increasing amount of bombs. Enemy forces include ships, planes, tanks, anti-air guns, and eventually, a large battleship.</p>"},{"name":"Rainbow Islands","year":1988,"developer":"Taito Corporation","url":"1#Rainbow%20Islands%20%28USA%29.nes","filesize":131088,"score":6.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>While on a search for treasure, Bubby and his brother Bobby travel to the Rainbow Islands. Instead of finding treasure, they find out that the people of the Rainbow Islands have been kidnapped. Now it's up to Bubby with his rainbow power to save them.</p><p>This version of <em>Rainbow Islands</em> has some differences from the original Rainbow Islands.</p><p>Some of the differences include:</p><ul><li>This version is 1 player only.</li><li>While the player visits the same islands as in the other version, the layout of the individual levels has been changed.</li><li>The different colored diamonds the player collects throughout the 4 stages of each island spell out the word RAINBOW. Completely spelling out the word then defeating the boss of that island will earn the player a big diamond.</li><li>Getting a big diamond gives the player a cutscene where they can choose to have dialogue with a character or open a treasure box for a chance to receive an item.</li><li>The biggest difference is, if the player manages to collect all 7 big diamonds, an extra island based on Bubble Bobble will be available to play on.</li></ul>"},{"name":"Rainbow Islands: The Story of Bubble Bobble II","year":1992,"developer":"Taito Corporation"},{"name":"Rally Bike","year":1990,"developer":"Toaplan Co., Ltd.","url":"1#Rally%20Bike%20%28USA%29.nes","filesize":131088,"score":6.9,"genres":"Racing / Driving > Top-down > 2D scrolling > Arcade > Motorcycle","desc":"<p>There's a cross-country motorcycle rally going from San Francisco to New York. In <em>Rally Bike</em>, the player has but one goal, to work their way up through the ranks of the racers and place high enough to qualify for the next race. The game contains six stages to race through.</p><p>The player controls a motorcycle and must cross the finish line before an established number of competitor bikes. The player must avoid crashing into obstacles, opposing racers, vehicles, and running out of gas. During a race there are certain areas where the player can refill their gas but stopping to refuel will cause competitor bikes to take advantage and race past the player. Competitors never run out of fuel but they are able to crash into obstacles thus taking them out of the race.</p><p>Occasionally during a race a helicopter will fly by dropping items that the player is able to pick up. The items are a 1000 Points Bonus, helper motorcycles that help you crash other racers, extra gasoline, Hi-grade gasoline which lasts longer than normal, a turbocharger that gives extra speed, and a helmet which provides invincibility.</p><p>If the player places in the top ten in a race, they are able to tune up their bike with better equipment. The player can upgrade their bike's engine (either 2 cycle type or 4 cycle type) and its tires (either rain, brock, or stick).</p>"},{"name":"Rambo","year":1987,"developer":"Pack-In-Video Co., Ltd","url":"1#Rambo%20%28USA%29%20%28Rev%20A%29.nes","filesize":131088,"score":5.2,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Asia > Contemporary > Licensed","desc":"<p>John Rambo is a Special Forces soldier that is currently spending time in military prison, until Colonel Trautman decides that Rambo is the ideal soldier to be sent on a special mission. Rambo's mission is simple, go to Vietnam and photograph the POW camp there. He is also ordered not to engage the enemy or rescue any POW’s. In Vietnam, Rambo meets his contact, Co, and she sets up the passage to the POW camp. During the mission, Rambo cannot bear just photographing the camp when he has an ample opportunity to rescue one of the prisoners. He decides to disobey orders and go for the rescue, which is when it all starts to go wrong.</p><p><em>Rambo</em> is a side scrolling platform game where the player controls Rambo in his mission to Vietnam. The game starts at the military base before getting sent to Vietnam. Once there, Rambo has to fight animals in the jungles, swamps, and caves like wasps, snakes, fish, tigers, bats, spiders, birds, apes and flamingos. Before making his way to the POW camp, he has to fight guards and mercenaries that can kick and shoot him, all wearing differently colored shirts depending on how powerful they are. The game also requires the player to navigate a complex map where the player has to find North and South points on the ground to go up and down levels as well as East and West by moving Rambo to the edge of the screen. There are 6 different weapons that Rambo can pick up: a knife, a throwing knife, a bow with arrows, a bow with exploding arrows, a gun, and a hand grenade. All the weapons but the knife has limited ammo which is collected from killed enemies. There are also health vials that restore health, as well as mission specific items that Rambo must find to complete some missions. The game uses password saves that can be retrieved when talking to other characters.</p>"},{"name":"Rampage","year":1988,"developer":"Bally Midway Mfg Co.","url":"1#Rampage%20%28USA%29.nes","filesize":196624,"score":6.5,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Fighting","desc":"<p>George, Lizzy and Ralph were just ordinary Americans, until an experiment went wrong, turning them into a Gorilla, Lizard and Werewolf respectively. Following this, the three of them plan to go round destroying buildings, and up to 3 human players can join in.</p><p>Smashing at the edges of the buildings for long enough will make them collapse. The police and military are after you, and will shoot at you, so try to destroy them (failing that, you can avoid the bullets). You will need to eat regularly, with things like plants on offer, to avoid shrinking back to being human.</p>"},{"name":"Rampart","year":1991,"developer":"Atari Games Corporation","url":"1#Rampart%20%28Europe%29.nes","filesize":262160,"score":"","genres":"Action > Strategy > Top-down > Real-time > Arcade > Shooter > Licensed","desc":"<p>In this Famicom version of the arcade hit, you are faced with 4 different scenarios (of increasing difficulty) and more depth than the original game. </p><p>But the basic elements of <em>Rampart</em> are still there: first you build a castle from Tetris-esque pieces. Next you place a series of cannons and use them to bomb the enemy. Then you repair any damage the enemy inflicted on your fort, and do it all over again. </p><p>When you reach a certain number of points, the scenario is cleared and you can pick another one.</p>"},{"name":"Reflect World","year":1987,"developer":"East Cube"},{"name":"Relics: Ankoku Yōsai","year":1987,"developer":"Bothtec, Inc."},{"name":"Ren & Stimpy Show: Buckeroo$!, The","year":1993,"developer":"Imagineering Inc.","url":"1#Ren%20%26%20Stimpy%20Show%2C%20The%20-%20Buckeroo%24%21%20%28USA%29.nes","filesize":262160,"score":"","genres":"Action > Side view > 2D scrolling > Shooter > Licensed","desc":"<p>Stimpy invents the Gametron 5000 Moneymaker which is the first video game machine in the world that rewards the player with money. Ren, who is always on the lookout to get rich, eagerly gets to playing with the video game system on the quest to earn big bucks. </p><p>In the game, you control Ren and Stimpy through various side scrolling levels which are based on different episodes of the cartoon show. Episodes the levels are based on are Space Madness, Out West, and Robin Höek. </p><p>In Space Madness, Space Cadet Stimpy must get a dazed Ren to the sick bay to feed him some chicken soup to cure him of his space madness. You will guide Ren through the Space Diner, the Laboratory, the Button Room and the Zero Gravity Bathroom to get to the sick bay. There are also parts of this level in which you will control the spacecraft that involves side scrolling shoot em up gameplay.</p><p>Out West pits Three-Fingered Höek and Stimpy the Kid, in the role of horse thieves. You must guide the buckeroos through the outskirts of town, past the corrals, through the rusty frontier town and to the stables, where you'll find the sheriff's horse to steal.</p><p>During Robin Höek, Ren is the finest archer in all of Logwood Forest. Armed with a trusty bow and a turkey baster, you must make your way through the village and rescue the fair Maid Moron from the clutches of the evil sheriff, who is holding the maiden captive in his castle.</p>"},{"name":"Renegade","year":1987,"developer":"Technos Japan Corp.","url":"1#Renegade%20%28USA%29.nes","filesize":131088,"score":6.4,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Regional differences","desc":"<p>This is the scrolling beat 'em up by Technos which started the Kunio / Nekketsu High series. The original takes takes place in a Japanese city, whereas its western version named <em>Renegade</em> is set on the mean streets of Brooklyn. This conversion later produced unofficial sequels Target: Renegade and Renegade III: The Final Chapter. You must venture through to meet your girlfriend, and then rescue her from her kidnappers. This is split into five levels, taking you through the subway and the docks as well as some inhospitable streets. A wide range of aggressive moves are on offer, including headbutts, kicks, punches and flying kicks. Much of the game's violence is depicted in a fairly tongue-in-cheek style, with an element of attempted humour along the way.</p>"},{"name":"Replicart","year":1988,"developer":"Dual Corporation"},{"name":"Rescue: The Embassy Mission","year":1990,"developer":"Kemco","url":"3#Rescue_The_Embassy_Mission/RescueTheEmbassyMission.nes","filesize":262160,"score":"","genres":"","desc":""},{"name":"Ressha de Ikō, A","year":1991,"developer":"Artdink Corporation"},{"name":"Ring King","year":1987,"developer":"Wood Place Inc.","url":"3#Ring_King/Ring_king.nes","filesize":262160,"score":6.1,"genres":"Sports > Diagonal-down > 2D scrolling > Arcade > Boxing","desc":"<p><em>Ring King</em> is a boxing game in which the action in the ring is viewed in a 3D top-down view and a full range of moves is provided, with the standard jabs complimented by body punches and the ability to dodge, duck or raise your guard.</p><p>Each punch weakens your opponent's strength which can slightly recover during a round break. A rain of well placed blows can produce a quick knockout, but normally you must hit your opponent many times before he goes down.</p><p>The game has three play modes. There is <em>training mode</em> to train your player before you enter a tournament. A <em>ranking mode</em> where you can select one of the three championships, Rookie, Japan and World. Each championship can be played at five difficulty levels.The third mode is the <em>tournament mode</em>.To reach the number one spot in the ranking or tournament mode you must train your boxer well.</p><p>Before you start you must create your character and set his initial abilities, strength, speed and stamina.Each won bout increases these abilities slightly.The abilities of your opponent and you are visible in the status bar at the top of the screen during the game. Strength is represented with a boxing glove, speed with a shoe and stamina with a dumb bell.</p><p>This game can be played by one player against the computer or by two players against each other.A password is given after each won bout and it enables you to continue with the next match in a tournament at a later time.</p>"},{"name":"Ripple Island","year":1988,"developer":"Tokai Engineering"},{"name":"Risa no Yōsei Densetsu","year":1988,"developer":"Konami Industry Co. Ltd."},{"name":"River City Ransom","year":1989,"developer":"Technos Japan Corp.","url":"1#River%20City%20Ransom%20%28USA%29.nes","filesize":262160,"score":7.9,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > RPG elements > Contemporary > Comedy > Martial arts > Regional differences","desc":"<p>The evil Slick has kidnapped Ryan's girlfriend and taken over the high school. The player is cast as either Ryan or Alex (second player) and has to fight his way through River City's merciless gangs before confronting Slick and freeing his girl. </p><p><em>River City Ransom</em> is a side-scrolling beat-em-up similar to Double Dragon. The player, or players, travel through the locations of River City, encountering various gangs along the way. Gang members can be defeated with punches and kicks, or beaten up with objects scattered around. Upon their defeat, gang members drop money which Alex and Ryan can spend in malls to buy items that restore health and improve their combat abilities. The main characters have RPG-like numerical stats that can be improved this way, and can also buy books to learn combat manoeuvres. To finish the game, the player(s) have to find and defeat all the bosses. </p><p>The Game Boy Advance port of the game adds a number of features, including the ability to recruit certain characters (including defeated bosses) to fight alongside you. It also has different gangs and several new weapons.</p>"},{"name":"Road Fighter","year":1985,"developer":"Konami Industry Co. Ltd.","url":"2#Road%20Fighter%20%28Europe%29.zip","filesize":1,"score":6.6,"genres":"Racing / Driving > Top-down > Arcade","desc":"<p>A top view racing game. You have to reach the finish line before time runs out. Don't crash into the wall, cars or trucks. Because if you do you will lose gasoline. You can get additional gasoline by picking up fuel items. Especially avoid the purple cars, they do change lanes! And remember... oil makes road slippery...</p>"},{"name":"Road Runner","year":1989,"developer":"Atari Games Corporation","url":"2#Road%20Runner%20%28USA%29%20%28Unl%29.zip","filesize":1,"score":7,"genres":"Action > Racing / Driving > Side view > 2D scrolling > Real-time > Arcade > Direct control > Fantasy > Licensed","desc":"<p>In <em>Road Runner</em>, the player takes control of the Road Runner. The Road Runner must run along the road, avoiding trucks, landmines, falling rocks, etc. and also not get caught by Wile E. Coyote. The Road Runner must also eat birdseed along the way or he will become faint and Wile E. will catch him.</p><p>The Road Runner can earn points for eating the birdseed and also by making Wile E. get hit by trucks, falling rocks, etc.</p><p>The Atari 2600 version has a difference from the other versions, in that the Road Runner isn't required to eat the birdseed but can do so for the points.</p>"},{"name":"RoadBlasters","year":1990,"developer":"Atari Games Corporation","url":"3#RoadBlasters/Road_blasters.nes","filesize":262160,"score":6.4,"genres":"Racing / Driving > Behind view > Arcade > Automobile","desc":"<p><em>RoadBlasters</em> is a futuristic racing action game. The goal is to reach the finish line in one piece throughout each of 50 levels. Numerous enemies are out on the road to try and stop you, including armored cars, motorcycles, cannons on the side of the road, landmines, and more. </p><p>Your vehicle is equipped with a machine gun to help you out, and occasionally a weapons plane will fly in and drop additional power ups that can be collected. Some of these are the U.Z. canon, cruise missiles, and speed boost. Your car has a very limited amount of fuel, however more can be picked up along the way by crossing the halfway point of a level, or by collecting the red and green fuel spheres that appear in the road or after destroying certain enemies. On many levels collecting fuel is critical otherwise you won't be able to reach the finish line.</p>"},{"name":"Robin Hood: Prince of Thieves","year":1991,"developer":"B.I.T.S., Ltd.","url":"1#Robin%20Hood%20-%20Prince%20of%20Thieves%20%28USA%29%20%28Rev%20A%29.nes","filesize":262160,"score":6.4,"genres":"Role-playing (RPG) > Side view > Top-down > 2D scrolling > Licensed","desc":"<p>England is in trouble.</p><p>Richard the Lion-Hearted, king of England, is off fighting in the Crusades, and while he's gone, the kingdom is ruled by the Sheriff and his evil black witch Mortianna.</p><p>You start in the city dungeons, being whipped by the Sheriff's prison guards.</p><p>Now its all up to you. Set yourself free, find friends in Sherwood forest, rescue the lovely Maid Marian, and set England free!</p>"},{"name":"RoboCop","year":1989,"developer":"Sakata SAS Co., Ltd.","url":"3#Robocop/Robo_cop.nes","filesize":262160,"score":6.1,"genres":"Action > Side view > 2D scrolling > Sci-fi / futuristic > Licensed","desc":"<p>The private corporation O.C.P. have taken control of the overwhelmed police force of Detroit. In order to deal with an immense crime wave hitting the city, a cyborg law enforcement agent has been created.</p><p><em>RoboCop</em> is a side-scrolling action game that consists of six stages. These six assignments include locations at the streets of Old Detroit, city hall, a warehouse, O.C.P. headquarters, the steelworks, and the board room. RoboCop dispatches his enemies with punches and a handgun (a special issue Auto-9) that has an infinite amount of ammo. RoboCop is not invincible though, as he can only take so many hits before his power runs out, plus his battery power gradually drains as he moves. However, lost power can be restored by finding power icons, and lost battery power can be restored by finding battery chargers found throughout the stages. Other items RoboCop can find and use are a machine gun that comes with fifty bullets and the powerful cobra gun.</p><p>RoboCop has four functions he can use. The infrared vision function lets RoboCop detect weak walls that can be punched in order to reveal shortcuts. The punch function lets the player know that the enemy they're facing can only be defeated by punching, no use of weapons is permitted. The foe detector function shows how close RoboCop is to the boss enemy of a stage. The faster it blinks, the closer he is. The energy/power alarm function will start sounding an alarm if either RoboCop's energy or power gets too low.</p><p>There is also a target practice bonus round between stages, where the player has to shoot as many targets as they can in a limited amount of time to earn bonus points to add to their score.</p>"},{"name":"RoboCop 2","year":1991,"developer":"Painting by Numbers, Ltd.","url":"1#RoboCop%202%20%28USA%29%20%28Rev%20A%29.nes","filesize":262160,"score":5.7,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Crime > Licensed","desc":"<p><em>RoboCop 2</em> is a mission-based platform game. Missions have various objectives, such as destroying Nuke drug canisters or killing all the enemies. If you didn't destroy/kill enough, you'll be transported to a training mission, which is a first-person perspective shoot 'em up. Should you also fail the training, you must go to the beginning of the previous mission. Successfully completed mission or enough points scored by training allow you to proceed to the next stage. Unlike in the first RoboCop, there's no time limit, and you are able to jump.</p>"},{"name":"RoboCop 3","year":1992,"developer":"Probe Software Ltd.","url":"1#RoboCop%203%20%28USA%29.nes","filesize":262160,"score":5.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Sci-fi / futuristic > Crime > Licensed","desc":"<p><em>RoboCop 3</em> for the NES is a platform shooter game starring the eponymous metal cyborg. This version is in many aspects similar to the version for 8-bit computers also developed by Probe Software: these games share level aesthetics and designs and musical score. However, the NES version is quite different: there's no first-person shooting level; instead, the first level is an exclusive side-scrolling stage. All levels feature slightly different designs, all bosses are redesigned as well, including the tank boss and final boss battle, in which Robocop has to do something entirely different than destroy the ninjas.</p>"},{"name":"Robodemons","year":1990,"developer":"Color Dreams, Inc.","url":"1#Robodemons%20%28USA%29%20%28Unl%29.nes","filesize":131088,"score":"","genres":"Action > Side view > Shooter","desc":"<p>Robodemons tells the tale of Kull, demon king of the Hades underworld. Kull conquered the earth by using a special machine to transplant demon souls into robots. You are a brave warrior who has accepted the challenge of rectifying this situation. Using only a boomerang for offense, the hero descends into the depths of the underworld. The game begins with a flying/shooting side scrolling level and then proceeds to walking/jumping side scrolling action. All kinds of undead creatures (mostly skeletons) are waiting to destroy you.</p><p>Audibly, the game makes liberal use of digitized voices, a rarity for 8-bit NES games.</p>"},{"name":"RoboWarrior","year":1987,"developer":"Hudson Soft Company, Ltd.","url":"3#Robowarrior/Robo_warrior.nes","filesize":131088,"score":6.3,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>In a desperate measure to combat the overpopulation of Earth, scientists work to create an artificial planet named Altile, named after the scientist who designed it. During the construction of Altile, humanity has become united and peaceful. During this new era of prosperity, Earth decommissions the RoboWarriors, a force of heavily armed half-man half-robot war vehicles. But from another dimension, aliens calling themselves the Xantho Empire and lead by the being Xur invade planet Altile and terraform it for their own uses. The survivors of Altile send out a distress call to Earth. Receiving this message, the people of Earth quickly activate the latest and most powerful of the RoboWarriors, a model known as ZED (Z-Type Earth Defense) and send it at top speed to Altile.</p><p>Controlling ZED from an overhead view, the player is able to move in any of 4 directions (up,down,left,right), drop bombs and shoot a projectile weapon. The terrain of Altile is made up of many obstacles and the bombs serve to destroy these and make passage for ZED. Destroying any enemy or obstacle may yield different power-ups which contain any of 10 different effects (including ammunition and energy refills) which may be stocked and used at any time from the menu. Or the power-ups may be instant-use refills for bombs and energy supplies.</p><p>Additionally some levels contain keys, which unlock doors and Chalices which prevent the level from running on endlessly. Secret areas such as a Well of Hope and a Room of Idols may also be found. Altogether, there are eight different \"worlds\" for ZED to conquer, containing numerous stages and guarded by a vicious boss monster.</p>"},{"name":"Rock 'n Ball","year":1989,"developer":"KID Corp.","url":"3#Rock_n_Ball/Rock_n_ball.nes","filesize":196624,"score":"","genres":"Action > Top-down > Pinball","desc":"<p>Rock 'N' Ball is a pinball game with several gameplay options. The first is regular pinball game for one to four players. The second option is called nineball and the object is to shoot the balls into the playfield and have them land in the holes to form a bingo pattern (i.e. a vertical line, a horizontal line, etc.) This game is also for one to four players. Next is battle flipper. There is a set of flippers at both the top and bottom of the table, and two players try to knock the pinball past their opponents flippers. Lastly is sports pinball. In this game the pinball table is set up to look like a soccer or hockey field. Similar to battle flipper, each player tries to knock the pinball past their opponents goalie. There is only one flipper in this game, however you have a goalie to block shots and the flipper can be moved from side to side.</p>"},{"name":"Rocket Ranger","year":1990,"developer":"Cinemaware Corporation","url":"2#Rocket%20Ranger%20%28USA%29.zip","filesize":1,"score":7.9,"genres":"Action > Strategy > Sci-fi / futuristic > World War II","desc":"<p>In the 1940s, the Nazis built a base on the moon and plan to use a mysterious substance called Lunarium to reduce people's intelligence. However, in the 21st Century time travel has been mastered, as have jet-propulsion backpacks, plus some cataclysmic weaponry and advanced code-breaking equipment. These items are sent back in time to you in order to change the result of the war by using this technology to find their five rocket factories and destroy the moon base.</p><p>The game fits the Cinemaware template closely, with a string of action sequences linked by cinematic animation sequences to set the scene. There's also a strategic element, as you move your spies around to gain information and avoid detection, and decide how much Lunarium to use at each stage of the game. Action sequences include hand-to-hand combat with a Nazi guard, and flying through the air shooting either hordes of enemy planes or the Zeppelin itself.</p><p>An \"Extended Collector's Edition\" of the game was released in 2018. It is a limited edition of 500 and contains the game in multiple languages and for multiple platforms, and contains as bonuses posters, stickers, postcards, and the soundtrack on vinyl.</p>"},{"name":"Rocketeer, The","year":1991,"developer":"Ironwind Software","url":"1#Rocketeer%2C%20The%20%28USA%29.nes","filesize":262160,"score":6.4,"genres":"Action > Side view > 2D scrolling > Platform > Flight / aviation > Interwar > Licensed","desc":"<p>The Rocketeer is based on the 1991 Disney movie of the same name. Nazis are trying to steal an experimental jet pack that will presumably give them a strategic edge in modern warfare for the purpose of world domination. It is up to the hero to don the jet pack and the helmet to stop the Nazis and keep the world safe.</p><p>The Rocketeer is a side-scrolling, run-and-jump (and sometimes fly) game. About halfway through the first stage, the Rocketeer is able to scavenge jet fuel power-ups, in addition to health and ammo power-ups. The fuel power-ups allow him to use his namesake power and fly for short distances. The Rocketeer has 6 offensive options available from the start of the game, limited only by the amount of ammunition points he has in reserve: A punch (requires no ammo points and is therefore unlimited), pistol (1 ammo point per fire), tommygun (2 ammo points), spread gun (3 ammo points), grenade (5 ammo points), and a bazooka (20 ammo points).</p>"},{"name":"Rockin' Kats","year":1991,"developer":"Atlus Co., Ltd.","url":"1#Rockin%27%20Kats%20%28Europe%29.nes","filesize":262160,"score":7.2,"genres":"Action > Side view > Platform","desc":"<p>Willy is a young jazz cat who goes by the name of \"The Rockin' Kat\". His girlfriend, Jill, was kidnapped by Mugsy, the local crime boss.</p><p>In this side scrolling game, you must help Rockin' Kat Willy to save his girlfriend through 7 stages. Each stage is a TV show broadcast through different channels of a TV set, and you must thus choose which channel you want to play. Through the channels Willy it will be sent to different themed shows such as western movies, gangster movies, etc, as well as some bonus channels.</p><p>Willy can walk and jump around, and carries as a weapon a spring-load Super Punch Gun, which he can put in diverse uses:</p><ul><li>Knock his enemies: by pressing A.</li><li>Perform higher jumps: by jumping (B) and pressing down + A.</li><li>Spin Attack: by grabbing a ledge (A) and rotating with the d-pad.</li><li>Spin Jump: by grabbing a ledge (A), rotating with the d-pad and jumping (B).</li><li>Catch and Trow: by holding A, grabbing an object and releasing A.</li></ul><p>He can also buy attachments that will make his gun more powerful, such as the Bomber, the Twin Balls, the Hammer Punch and the Jet Sneakers. </p><p>Rockin' Kats is so cartoonish that you might expect to see it on Saturday morning TV.</p>"},{"name":"Rod-land","year":1992,"developer":"Jaleco Ltd."},{"name":"Roger Clemens' MVP Baseball","year":1991,"developer":"Sculptured Software, Inc.","url":"3#Roger_Clemens_MVP_Baseball/Roger_clemens.nes","filesize":393232,"score":5.7,"genres":"Sports > Diagonal-down > Baseball","desc":"<p>Roger Clemens is known by some as the greatest pitcher in baseball history. In  <em>Roger Clemens' MPV Baseball</em> players play a standard a 9 innings baseball game in Exhibition mode and a full regular season can be played including the World Championship Playoffs in the Regular Season mode. While playing in Regular Season mode the player can see their chosen team’s progress by using the in game calendar showing all the games.</p><p>Players select a fictional team from the following groups:<em> </em><em>National Division West:</em>* San Francisco Quakes, Los Angeles Apaches, Cincinnati Big Cats, San Diego Suns, Houston Mustangs, and Atlanta Condors.</p><ul><li><p><strong>National Division East:</strong> Chicago Swords, Montreal Lumberjacks, New York Buffalos, St. Louis Commandos, Pittsburgh Panthers, and Philadelphia Generals.</p></li><li><p><strong>American Division West:</strong> Oakland Bashers, Seattle Pioneers, Minnesota Hounds, California Waves, Texas Cowboys, Chicago Red Birds, and Kansas City Kings.</p></li><li><p><strong>American Division East:</strong> Toronto Bears, Boston Hornets, New York Rebels, Detroit Wheels, Milwaukee Marshals, Baltimore Eagles, and Cleveland Tomahawks.</p></li></ul><p>Each team has a set of players the make up the team each with their own skill level and statistics which, like the teams, is fictional other then Clemens himself who is on the Boston Hornets team. </p><p>When controlling the pitcher the player can control the speed and spin of the pitch as well as the pitchers position on the plate. The pitcher can also stop the opponent stealing a base which can be seen via windows showing the positions of all the baserunners. When controlling the batter the player has to time the hit to successfully hit the ball so it will not be a missed hit or a foul, or has the option to not hit in case of a ‘ball’. The player can also steal a base while batting. After the ball is hit the game goes into fielding mode where the camera shifts to a view that is lower than the normal 45 degree angle (the fielder gets smaller as he moves away from the camera). The player then controls the closest fielder to get or catch the ball and then throw it to the selected base. There are many different cameras angles that the game selects depending on the location of the ball. The camera can be on the left, center, or right side of the field in ether infield or outfield position and all cameras can pan to follow the ball. </p><p>The player can use a password to save their progress in Regular Season mode. An exhibition match can be played in two player mode with the use of two controllers.</p>"},{"name":"Rokudenashi Blues","year":1993,"developer":"Tose Co., Ltd."},{"name":"Rollerball","year":1988,"developer":"HAL Laboratory, Inc.","url":"1#Rollerball%20%28USA%29.nes","filesize":163856,"score":7,"genres":"Action > Simulation > Top-down > Pinball","desc":"<p><em>Rollerball</em> is a pinball simulation for one to four players. </p><p>There are two different game variations included. The first is Skyscraper, which is a four screen tall pinball table where each player competes individually for the highest score. The second is called Matchplay. In this game two players compete against each other to see who can reduce his opponents score to zero first. Each player has a set of flippers and a ball in play, and points are awarded or taken away by hitting the various targets in the playfield.</p>"},{"name":"Rollerblade Racer","year":1993,"developer":"Tahoe Software Productions"},{"name":"Rollergames","year":1990,"developer":"Konami Industry Co. Ltd.","url":"2#Rollergames%20%28Europe%29.zip","filesize":1,"score":6.6,"genres":"Action > Side view > Sci-fi / futuristic > Licensed","desc":"<p>This is a platform game in the same fashion as Turtles II, that is that it's a sidescroller were you can move up and down on the screen, but you go on rollerskates. This makes the game go much faster than its counterpart, which adds difficulty and also a sense of speed.</p><p>It includes a silly story about three different roller skates gangs (somewhat like motor cycle gangs) in a close future, which is most an excuse for the game to exist.</p><p>You can choose between three different gangs, one is all-around, one is fast and weak (and consists of women) and one is slow and strong, you get the fashion. This adds some replayability, but in reality, they are kind of the same.</p><p>The game also suffers from trial and error; you must learn the courses if you want to master them. Luckily, the game has unlimited continues.</p>"},{"name":"Rolling Thunder","year":1988,"developer":"Namco Limited","url":"1#Rolling%20Thunder%20%28USA%29%20%28Unl%29.nes","filesize":262160,"score":7.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter","desc":"<p><em>Rolling Thunder</em> is the world's most powerful secret police force and you are its best agent. Your mission is to stop an underground conspiracy to conquer the world and to save agent Leila, who has been captured. Starting out armed only with a handgun, you have to make your way through heavily guarded hallways and secret passages to find Leila and stop the enemy.</p>"},{"name":"Romance of the Three Kingdoms","year":1988,"developer":"KOEI Co., Ltd.","url":"1#Romance%20of%20the%20Three%20Kingdoms%20%28USA%29.nes","filesize":262160,"score":7.5,"genres":"Strategy > Top-down > Turn-based > China (Ancient / Imperial) > Historical events","desc":"<p>Based on the events of the Three Kingdoms era in China (3rd century), and on Luo Guanzhong's famous novel <em>Sanguo Yanyi</em>, the game casts the player in the role of one of the many warlords rivaling for control after the Yellow Turban Rebellion.</p><p>This turn-based strategy game introduces hundreds of historical characters of the Three Kingdoms era. The game's main objective is to become the supreme ruler of the remnants of the falling Han Dynasty. To do this the player has to build a mighty empire by conquering provinces and recruiting generals worthy of command. Fight massive battles, triumph over natural disasters and capture enemy strongholds.</p>"},{"name":"Romance of the Three Kingdoms II","year":1990,"developer":"KOEI Co., Ltd.","url":"1#Romance%20of%20the%20Three%20Kingdoms%20II%20%28USA%29.nes","filesize":524304,"score":7.8,"genres":"Strategy > Top-down > Turn-based > Turn-based strategy > China (Ancient / Imperial) > Historical events","desc":"<p>The sequel to Romance of the Three Kingdoms. The game concept is still the same, though they did improve a lot of features that one may consider 'disturbing' from <em>RTK I</em> (e.g. Generals dying easily due to disease, etc.). <em>RTK</em> can be said to be much more 'stable' where players no longer have to worry that much about time length in the game, as the game take a slower time rate to allow the players to build up their forces without much interference. The <em>RTK II</em> gameplay and interface is closely similar to Nobunaga's Ambition II.</p>"},{"name":"Romancia: Dragon Slayer Jr.","year":1987,"developer":"Nihon Falcom Corp."},{"name":"Roundball: 2-On-2 Challenge","year":1992,"developer":"Park Place Productions"},{"name":"Route-16: Turbo","year":1985,"developer":"Sun Electronics Corp."},{"name":"Rush'n Attack","year":1987,"developer":"Konami Industry Co. Ltd.","url":"1#Rush%27n%20Attack%20%28USA%29.nes","filesize":131088,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > War","desc":"<p>Depending on which title you use, and how you interpret it, this game is about a guy who a) rushes in before attacking b) attacks Russians (or is being attacked by Russians... in the mid-80s, when this game was produced, the Cold War was still in full effect), or c) wears a rather goofy hat. One way or another, this arcade game arms you with a knife and sends you on a kamikaze mission against hordes of enemy fighters.</p><p>There are four distinct sections of gameplay, taking in a Missile Base, a Harbour, a Bridge, and an enemy Prison Camp. Extra weapons with limited ammunition can be collected along the way, which will make the task a lot easier. The level is divided into 3 horizontal levels, which can be moved between either by jumping or using ladders, and this gives a chance to avoid the more threatening mobs of enemy fighters.</p>"},{"name":"Rygar","year":1987,"developer":"Tecmo, Ltd.","url":"1#Rygar%20%28Europe%29.nes","filesize":131088,"score":7.2,"genres":"Action > Diagonal-down > Side view > 2D scrolling > Metroidvania > Platform > RPG elements > Fantasy > Regional differences","desc":"<p>This version of <em>Rygar</em> is quite different from the arcade original and its ports, though it shares the same basic story: a legendary warrior rises from the grave in order to defeat the forces of evil in the land of Argool. Rather than being a linear arcade-style game, this version emphasizes exploration and allows the player to re-visit locations with special items that may open previously inaccessible locations. </p><p>The game contains a light RPG element in form of permanent power-ups which increase the main character's performance in combat. It also offers multiple viewpoints: the action-oriented stages are viewed from a side-scrolling perspective, but when travelling between zones the game takes on an overhead view that can also lead to combat situations.</p>"}]