[{"name":"S.C.A.T.: Special Cybernetic Attack Team","year":1990,"developer":"Natsume Co., Ltd.","url":">S.C.A.T.%20-%20Special%20Cybernetic%20Attack%20Team%20%28USA%29","filesize":139516,"score":7.4,"genres":"Action > Side view > Shooter > Sci-fi / futuristic","desc":"<p>In a humorous take on the eighties' sci-fi judgment day films, you play as either one of two cyborgs, Arnold and Sigourney, or team up on a mission to save the world.</p><p>The year is 2029 and an alien invasion, led by Supreme Commander Vile Malmort, threatens the earth. He has destroyed the city of New York and built a device known as an \"Astrotube\", which connects the ruins of the city with his alien space station. If this invasion does not stop, humanity will surely be doomed! A duo of cyborg soldiers have been assigned to combat the invading forces, known as \"S.C.A.T.\" The fate of mankind rests on the success of their five-stage mission.</p><p>The heroes are equipped with a jet pack and two orbiting cannons. These can be set to fire in one direction or in a fixed pattern. You can fly in all directions and use power-ups to gain new types of weapons or to restore health. Only six lives (three in the Japanese version) per mission are provided, but there is an unlimited amount of continues.</p>"},{"name":"Saint Seiya: Ōgon Densetsu","year":1987,"developer":"Tose Co., Ltd."},{"name":"Saint Seiya: Ōgon Densetsu - Kanketsu Hen","year":1988,"developer":"Tose Co., Ltd."},{"name":"Saiyūki World","year":1988,"developer":"Nihon Micom Kaihatsu"},{"name":"Samurai Sword","year":1988,"developer":"Capcom Co., Ltd."},{"name":"Sanada Jūyūshi","year":1988,"developer":""},{"name":"Sangokushi II: Haō no Tairiku","year":1992,"developer":"Tose Co., Ltd."},{"name":"Sanma no Meitantei","year":1987,"developer":"Namco Limited"},{"name":"Sanrio Carnival","year":1990,"developer":"Scitron & Art Inc."},{"name":"Sanrio Carnival 2","year":1993,"developer":""},{"name":"Sansū 1-nen: Keisan Game","year":1986,"developer":"Tokyo Shoseki Co., Ltd."},{"name":"Sansū 2-nen: Keisan Game","year":1986,"developer":"Tokyo Shoseki Co., Ltd."},{"name":"Sansū 3-nen: Keisan Game","year":1986,"developer":"Tokyo Shoseki Co., Ltd."},{"name":"Sansū 4-nen: Keisan Game","year":1986,"developer":"HAL Laboratory, Inc."},{"name":"Sansū 5・6-nen: Keisan Game","year":1986,"developer":"Tokyo Shoseki Co., Ltd."},{"name":"Sasa","year":1985,"developer":"Mass Tael Co., Ltd."},{"name":"SD Gundam World: Gachapon Senshi - Scramble Wars","year":1987,"developer":"Sonata"},{"name":"SD Gundam World: Gachapon Senshi - Scramble Wars Map Collection","year":1989,"developer":"Sonata"},{"name":"SD Gundam World: Gachapon Senshi 2 - Capsule Senki","year":1989,"developer":"Opera House Inc."},{"name":"SD Gundam World: Gachapon Senshi 5 - Battle of Universal Century","year":1992,"developer":"Tose Co., Ltd."},{"name":"SD Hero Sōkessen: Taose Aku no Gundan","year":1990,"developer":"Interlink"},{"name":"Secret Scout in the Temple of Demise","year":1991,"developer":"Color Dreams, Inc."},{"name":"Section-Z","year":1987,"developer":"Capcom Co., Ltd.","url":">Section-Z%20%28USA%29","filesize":56411,"score":5.9,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Alien Invaders approach the solar system from their interstellar battle platform, named Fortress Balangool. Under the command of the Master Control, named L-Brain, the Invaders defeat Earth's space forces. Only one hero, Captain Commando remains to defeat the alien armada by entering Balangool and fighting through the various sections until reaching Section-Z.</p><p><em>Section-Z</em> is a side-scrolling shooter where the player must travel through the maze that is Balangool. Typically this consists of traveling through a scrolling corridor and reaching the end where a new direction must be chosen. Captain Commando's abilities are shooting directly left or directly right while moving around the screen. Power-ups can be collected by defeated enemies and include; improved lasers, a 3-way cannon and shield, these can be stored until needed. There are also SMS (Special Transmission Shell) power-ups, which require energy to use Energy units, are used to absorb enemy fire. Loss of all energy or running into an enemy or a wall causes death.</p><p>Certain sections of Balangool are blocked until a generator can be found and destroyed. There are four different boss creatures that must be defeated when encountered.</p>"},{"name":"Seicross","year":1986,"developer":"Nihon Bussan Co., Ltd.","url":">Seicross%20%28USA%29","filesize":23974,"score":"","genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>Two different tribes existed on planet Colura, the Petras and the Basrah. The Basrah were aggressors and eventually drove the Petra underground. However many Petra survivors were trapped on the surface of the planet. To that end, a rescue bike named the Gilgitt Petras was created. It must venture up to the surface and save as many Petras as possible.</p><p>Seicross is a side-scroller. Controlling the Gilgitt Petras, the player must race across the screen, collecting Petra survivors and fuel power-ups. The single weapon and ability available is the ability to fire straight ahead.</p>"},{"name":"Seiken Psycho Caliber: Majū no Mori Densetsu","year":1987,"developer":""},{"name":"Seikima II: Akuma no Gyakushū","year":1986,"developer":"ISCO, Inc."},{"name":"Seirei Gari","year":1989,"developer":"Hudson Soft Company, Ltd."},{"name":"Sesame Street 123","year":1989,"developer":"Zippo Games","url":">Sesame%20Street%20123%20%28USA%29","filesize":39387,"score":"","genres":"Educational > 1st-person > Math / logic > Pre-school / toddler","desc":"<p>This math-based learning title for Ages 3 to 6 featuring <em>Sesame Street</em> characters. <em>Sesame Street 1 2 3</em> includes a compilation of 2 previously released games:* Astro-Grover: Children play with Grover and the Zips from planet Zap by counting, adding, and subtracting Zips to help improve basic math skills.</p><ul><li>Ernie's Magic Shapes: Children work with Ernie to practice matching shapes and colors in the problems he presents to them.</li></ul>"},{"name":"Sesame Street ABC","year":1989,"developer":"Zippo Games","url":">Sesame%20Street%20ABC","filesize":148009,"score":"","genres":"Educational > 1st-person > Pre-school / toddler > Reading / writing > Licensed","desc":"<p>This game is divided into two parts:</p><p>Letter-Go-Round: By catching and matching letters on a spinning ferris wheel children practice letter recognition and matching, simple spelling and word formation.</p><p>Ernie's Big Splash: Children can help Ernie find his rubber duckie for his bath by building a pathway from duckie's soap dish to Ernie's bathtub. This helps children practice planning, predicting and problem-solving.</p><p>For Ages 3-6.</p>"},{"name":"Sesame Street Countdown","year":1992,"developer":"Riedel Software Productions, Inc."},{"name":"Sgt. Helmet: Training Day","year":2013,"developer":"The Mojon Twins"},{"name":"Shadow of the Ninja","year":1990,"developer":"Natsume Co., Ltd.","url":">Shadow%20of%20the%20Ninja%20%28USA%29","filesize":142723,"score":7.3,"genres":"Action > Side view > Sci-fi / futuristic > Martial arts","desc":"<p>In the 21st century, the evil Emperor Garuda has taken over the city of New York, killing many of its inhabitants. You play as either Hayate or Kaede, two ninjas who are attempting to free the city from Garuda's control.</p><p>Shadow of the Ninja is a typical side-scrolling action game, consisting of running, slashing and jumping through 5 levels, each with 4 sub-stages with numerous and varied foes, and a boss enemy at their end.</p><p>Kaede and Hayate can not only jump; as ninjas, they can hang from platforms and make swift saltomortals between floors. Sometimes, canisters containing powerups can be found. Typical powerups extend range of the default sword, or they may be additional weapons such as throwing stars and a ninja weapon that looks like a big grappling hook on a string.</p><p>As with a great many NES action games, but unlike the very similar (and tangentially related) Ninja Gaiden series, the game allows two players to play cooperatively.</p>"},{"name":"Shadowgate","year":1989,"developer":"ICOM Simulations, Inc.","url":">Shadowgate","filesize":142079,"score":7.3,"genres":"Adventure > 1st-person > Fixed / flip-screen > Turn-based > Graphic adventure > Point and select > Fantasy","desc":"<p>Using the same graphical interface as Deja Vu, <em>Shadowgate</em> is an adventure game set in a fantasy world. Players take the part of an adventurer sent to the ancient keep of Shadowgate on a quest to find a mystic artifact known as the Staff of Ages and stop the evil Warlock Lord from summoning a horrific demon known as the Behemoth. However, Shadowgate has become infested with the Warlock Lord's demonic minions, not to mention the castle's still functional booby-traps.</p><p>Unlike <em>Deja Vu</em>, death comes at the protagonist suddenly, unexpectedly and, most of all, often. Such simple acts as pulling the wrong switch or opening the wrong door can cause the hero to be skewered by a booby-trap or disemboweled by a monster. If the player character's torch burns out (this happens quite regularly) and the player forgets to light a new one, the protagonist will trip in the dark and break his neck.</p>"},{"name":"Shanghai","year":1987,"developer":"Activision, Inc."},{"name":"Shanghai II","year":1990,"developer":"Sun Electronics Corp."},{"name":"Shatterhand","year":1991,"developer":"Natsume Co., Ltd.","url":">Shatterhand%20%28Europe%29","filesize":144687,"score":7.9,"genres":"Action > Side view > Sci-fi / futuristic","desc":"<p>Shatterhand is an action game with eight-direction scrolling. You control Shatterhand in his quest to find and defeat General Grover, leader of the Metal Command. Through the game you’ll encounter all kinds of mechanical and biomechanical creatures. Shatterhand’s primary weapon is his cybernetic fists and therefore most enemies must be defeated by punching them.</p><p>Additional help can be given from any of the eight hovering satellite robots, each of which has it’s own weapon that fires automatically when Shatterhand throws a punch. These satellite robots can be obtained by collecting combinations of alpha-beta letters that appear when you punch some of the white boxes that are scattered throughout each stage.</p><p>The game has seven stages. The first and the last must be played first and last respectively, but the five middle stages can be played in any order. The path to the final showdown with General Grover leads through a factory, a refinery, an anti-gravity research facility, a submarine, a burning subway, a filtration plant and finally to General Grover’s missile launch complex.</p>"},{"name":"Sheng Huo Lie Zhuan","year":1991,"developer":"Computer & Entertainment Inc."},{"name":"Sherlock Holmes: Hakushaku Reijō Yūkai Jiken","year":1986,"developer":"Towa Chiki"},{"name":"Shi-Kin-Joh","year":1991,"developer":"Scap Trust"},{"name":"Shingen the Ruler","year":1989,"developer":"Hot-B Co., Ltd.","url":">Shingen%20the%20Ruler","filesize":133931,"score":"","genres":"Strategy > Top-down > Fantasy > Historical events","desc":"<p>Shingen Takeda was one of the most powerful warlords of medival Japan. You being with two small city states and attempt to conquer the country as Shingen did back in the 16th Century. Control all aspects of your territories from social, economic, and military in attempt to spread your influence. If you are good enough, you can do it faster than the real Shingen himself!</p>"},{"name":"Shinobi","year":1989,"developer":"Team Shinobi","url":">Shinobi%20%28USA%29%20%28Unl%29","filesize":82493,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control > Fantasy","desc":"<p>You control a shinobi, Joe Musashi, who must battle his way through each level in search of hostages which must be rescued. You have shurikens, kicks and punches to defend yourself with, as well as powerful ninja magic which can clear the screen of enemies in one go.</p><p>Each level is broken down into smaller scenes, and hostages are guarded by big blokes who throw swords. Watch out for gun-toting enemy henchmen and ninjas.</p><p>Reaching the end of each level will find you battling it out with a boss. These range from 8ft tall giants to helicopter gunships.</p>"},{"name":"Shockwave","year":1990,"developer":"American Game Cartridges, Inc.","url":">Shockwave%20%28USA%29%20%28Unl%29","filesize":30592,"score":"","genres":"Action > Puzzle > Side view > Direct control > Sci-fi / futuristic","desc":"<p>In Shockwave you need to retrieve powerful crystals left behind by the Tarian race. The Rastons are after the crystals also, which places a short time limit on the mission. You are armed only with a spacesuit and a shockwave pistol. To retrieve the crystals, you will need to find your way through numerous mazes. Blocks in the maze can be moved with the shockwave pistol. When you hit a block with the pistol, this will move blocks adjacent to the block hit rather than the block itself. If numerous blocks are lined up, the shockwave will continue to travel through the blocks until the path is clear and a block can be moved. Some blocks are indestructable and immovable, while others can be moved, and some completely destroyed. Teleportation doors, force fields and other special items can be found in some mazes. To complete most of the levels the blocks will need to be moved about in the proper order to avoid leaving a critical path permanently blocked. If you do get stuck, there is an option to restart a maze (this feature becomes more and more useful as the game progresses.) Wandering about many of the levels are FireStars which will weaken your spacesuit and eventually destroy it. Each level has a time limit in which to solve the maze and retrieve all of the crystals.</p>"},{"name":"Shooting Range","year":1989,"developer":"Tose Co., Ltd.","url":">Shooting%20Range%20%28USA%29","filesize":39622,"score":"","genres":"Sports > 1st-person > Shooter > Darts / target shooting","desc":"<p>The aim is to shoot the discs on the screen so that you can acquire enough points to pass the clearing point score of that particular stage without your time or energy running out. You can choose between different difficulty levels. They affect the time you have to complete the stages. For difficulty level 1 you get 300 game time, difficulty level 2 gives you 250, and difficulty level 3 only 200.</p><p>Items you can shoot during the game include an hourglass which extends time by 50, an E which gives you 100 points + 1 Energy bar, an E in a white square which gives you 100 points + 2 Energy bars, a Reverse E which gives you 1 Energy bar and C or W symbol which both give only 100 points each. Each disc you shoot above an enemy is worth between 100-500 points.</p><p>The game contains three stages that involve a western, ghost house, and a space theme. There is also a bonus stage where you try to shoot as many bottles as possible. In the party game mode, you compete to have the highest score.</p>"},{"name":"Short Order / Eggsplode","year":1989,"developer":"Tose Co., Ltd.","url":">Short%20Order%20%2B%20Egg-Splode%21%20%28USA%29","filesize":38337,"score":6.9,"genres":"Action > Compilation > Puzzle > Diagonal-down > Fixed / flip-screen > Arcade","desc":"<p>This cartridge used the power pad and contained two games: \"Short Order\", is a Simon-like game in which you are given an order and need to make the burger exactly as the order says. \"Eggsplode\" is a game in which you must destroy bombs that a fox is placing underneath chicken nests before they explode without destroying the chickens or their eggs.</p>"},{"name":"Shufflepuck Cafe","year":1990,"developer":"Infogrames Europe SA"},{"name":"Sid Meier's Pirates!","year":1991,"developer":"MPS Labs"},{"name":"Side Pocket","year":1987,"developer":"Data East Corporation","url":">Side%20Pocket","filesize":53481,"score":7.1,"genres":"Simulation > Sports > Top-down > Fixed / flip-screen > Turn-based > Direct control > Pool / snooker > North America","desc":"<p>The main objective is to sink balls in each level and reach the predetermined scores to go ahead. But remember: you'll have only several \"lives\" and every error can be lethal. After each stage completed (and some luck), a bonus stage will appear, as well as the chance to earn extra balls. You will only need a good target in the parquet block!</p><p>Basic version differences:</p><ul><li>The original Arcade version is a pool game where the player competes against the timer trying to get all balls in pockets and earn points.</li><li>The later NES release introduces modes for 2 players with two variants: 2P Pocket Game (the traditional mode) and 2P 9-Ball Game, where the premise is to sink 9 balls before the other player makes them first, training mode and single-player Pocket game. In 1P Pocket game the player needs to clear four levels with alternating ball layouts (i.e. reaching a predetermined number of points by sinking consecutive shots and sinking balls in numerical order), starting from City class and all the way to the World Class. Starting from State class, the player needs to perform a special trick after beating a level, and if they fail, the level restarts with a different ball layout.</li><li>Game Boy version is a completely redrawn game featuring 1 or 2 players actions with two game modes: 9-ball and Pocket. The Pocket mode is generally similar to NES version.</li><li>Genesis and SNES versions feature improved graphics and sound. Pocket game mode is reworked to include more stages and trick shot layouts. Also in this mode the player travels to different cities in the U.S.A. and claims championship there. New modes are Trick game and Jukebox. Game Gear version of *Side Pocket* is basically a toned-down Genesis version.</li><li>“Side Pocket” for Wonder Swan features one and two-player play on a single device. In the single-player mode the player chooses an avatar from a menu and needs to beat the remaining opponents. The player and CPU then take turns in hitting the ball.</li></ul>"},{"name":"Silent Assault","year":1990,"developer":"Joy Van"},{"name":"Silent Service","year":1989,"developer":"MicroProse Software, Inc.","url":">Silent%20Service%20%28USA%29","filesize":49305,"score":7.5,"genres":"Simulation > 1st-person > Real-time > Naval / watercraft > Vehicular combat > Historical events > Oceania > World War II > War","desc":"<p>You are now a member of the Silent Service, the US Navy Submarine command. For a long while after Pearl Harbor, you are the only forces capable of striking back at the Japanese in the Pacific. Take one of the \"fleet boats\" and go on extended patrols of up to 2 months from Hawaii, Australia, or New Zealand. Set your difficulty/realism level and time period (early means less tech for juicier targets, later means tougher escorts, more tech, lousier targets). Contend with factors like dud torpedoes, maximum depth, and more. </p><p>You can choose among practice run against some old hulks, recreate historical convoy attacks, go on a single patrol, or go on your own campaign, which lets you go multiple patrols until you die, get promoted, or survive the war. </p><p>How well will you do when matched against history?</p>"},{"name":"Silkworm","year":1990,"developer":"Tecmo, Ltd.","url":">Silk%20Worm","filesize":98131,"score":7.4,"genres":"Action > Side view > Arcade > Shooter > Helicopter > Sci-fi / futuristic","desc":"<p><em>Silkworm</em> is a classic horizontally-scrolling shoot-em-up. The main difference between this game and many other side-scrolling shoot-em-ups is that you will be on land as well as in the air.</p><p>The first player would play as a helicopter, but if a second player joins the game, they would play as a jeep. Both players would have to protect each other as well as themselves. After a certain number of kills, a \"goose\" helicopter would form on the screen. If the players managed to destroy it they would get a weapon's powerup. This would go on throughout the entire game, and a \"goose\" could appear even during the fight with the end-of-level baddie.</p>"},{"name":"Silver Eagle","year":1994,"developer":"Sachen"},{"name":"Silver Surfer","year":1990,"developer":"Software Creations Ltd.","url":">Silver%20Surfer%20%28USA%29","filesize":199976,"score":6,"genres":"Action > Side view > Top-down > Arcade > Shooter > Licensed","desc":"<p>The Silver Surfer roams throughout space as herald to Galactus, looking for new planets for him to feed on. However his mission is interrupted by a summon from Galactus. Silver Surfer learns that creatures from the Magick Dimension are trying to break through into the universe and their coming will end all life. Vowing to stop them, Silver Surfer must assemble the pieces of a mysterious Cosmic Device and use it to push them back. The pieces of the Device are currently in the hands of some malicious creatures: Reptyl, Mephisto, Skrull Emperor, Possessor and Firelord. Silver Surfer must travel to their domains and defeat them in order to obtain pieces of the device.</p><p>Silver Surfer is a shooter game, with some levels taking place vertically and some horizontally. The Surfer's only ability is to move around on the screen and to shoot directly in front of him. Power-ups that can be picked up include: the letter \"F\" (Firepower) which will increase the number and power of his projectiles, Smart bombs which destroy everything on the screen, the letter \"S\" (Speedup) which increases the surfer's movement and Orbs which will also fire the Surfer's weapon. Orbs are special in that two can be obtained (only 1 is shown on horizontal scrolling levels) and they can be positioned to fire forwards, backwards or sideways.</p>"},{"name":"Simpsons, The: Bart vs. the Space Mutants","year":1991,"developer":"Imagineering Inc.","url":">Simpsons%2C%20The%20-%20Bart%20vs.%20the%20Space%20Mutants%20%28USA%29","filesize":146667,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy > Licensed","desc":"<p><em>Bart vs. The Space Mutants</em> is a platform game where the player goes into the role of Bart Simpson (from the TV show The Simpsons) and must stop the Space Mutants from invading Springfield.</p><p>On each of the five levels, Bart must collect (or get rid of) the ingredients that the Space Mutants are planning to use to build their machine, such as purple objects or balloons. He also has to collect enough \"proof\" of the aliens existence (brown coins left behind when they are jumped on), so his family members will help him when he meets a boss (characters such as Nelson and Sideshow Bob). This won't be easy since the Space Mutants are \"using\" human bodies as disguise. In order to discover who are the real Space Mutants, Bart must use his X-ray Specs.</p><p>The ways Bart can get rid of those objects sought by the Space Mutants are numerous. For instance, in the first stage, Bart must get rid of purple objects. He can dye them red, cover them, wash them, etc. Some even involve a little puzzle solving, like playing a trick on Moe to make him get out of the bar.</p><p>Bart also has some coins that can be used in many ways throughout the game, like buying things, getting devices operating, etc. Those coins are essential to solve some puzzles in the game.</p>"},{"name":"Simpsons, The: Bart vs. the World","year":1991,"developer":"Arc Developments","url":">Simpsons%2C%20The%20-%20Bart%20vs.%20the%20World%20%28USA%29","filesize":202908,"score":6.3,"genres":"Action > Puzzle > Sports > 1st-person > Side view > Top-down > 2D scrolling > Fixed / flip-screen > Arcade > Cards / tiles > Game show / trivia / quiz > Platform > Skateboarding > Licensed","desc":"<p>This game is actually a compilation of smaller games belonging to different genres. Krusty the clown appears in the beginning of the game and presents a menu with five games to play (one of which is not available from the start): A jump-and-run game, where Bart must find an exit on a ship, while enemies fire at him and try to prevent him from reaching the exit; a card game, where you have five tries to find hidden cards on a board; a simple jigsaw puzzle; a series of trivia questions concerning the Simpsons; and finally, a platform-skateboard game (available only after you have completed the ship level). Needless to say all games are connected to the famous TV series \"The Simpsons\".</p>"},{"name":"Simpsons, The: Bartman Meets Radioactive Man","year":1992,"developer":"Imagineering Inc.","url":">Simpsons%2C%20The%20-%20Bartman%20Meets%20Radioactive%20Man%20%28USA%29","filesize":167390,"score":5.8,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>Bart Simpson is reading the latest comic about the Radioactive Man but his favourite superhero is not featured in it. When he is at the last page, his sidekick Fallout Boy appears. He tells Bart he is the only one who can save Radioactive Man who has been sent to the Limbo Zone, a mysterious prison that revolves around a black hole. Bart turns into Bartman and he has to fight three super villains to collect Radioactive Man's lost powers before facing the mastermind Brain-O the Magnificent.</p><p>Players control Bartman through 2D side-scrolling platform levels. He needs to defeat enemies, collect goodies, and be careful not to fall into one of the deadly traps on his way. Bartman can punch and kick, and collect lightning icons to shoot small bolts. Most of the level sequences require precise timing and pixel-perfect jumping precision. Bartman has five life points that are restored by collecting radioactive signs.</p>"},{"name":"Sir Ababol","year":2013,"developer":"The Mojon Twins"},{"name":"Sir Ababol: Remastered Edition","year":2017,"developer":"The Mojon Twins"},{"name":"Skate or Die","year":1989,"developer":"Electronic Arts, Inc.","url":">Skate%20or%20Die","filesize":87224,"score":6.9,"genres":"Sports > Diagonal-down > Olympiad / mixed sports > Skateboarding","desc":"<p><em>Skate or Die</em> incorporates five distinct styles of skating, which can be attempted individually or in turn. You skate around a menu room to choose which one to attempt. Before taking off you can visit Rodney's skate shop to buy equipment.</p><p>The first event is freestyle, in which your aim is to score as many points as possible in 10 attempts. Judges determine how much style and skill you have shown. The High Jump uses the same equipment, only this time your task is to jump as high as possible at the end of the ramp.</p><p>The downhill events are overhead-view races. In the Downhill Race you simply try to complete the course within 90 seconds. In the Downhill Jam you try to outperform a human or computer opponent whilst dodging or jumping hazards. You can use attacking moves to either remove hazards or knock your opponent over. </p><p>The pool joust is more of a one-on-one beat em up using a stick, set within a pit to skate around.</p>"},{"name":"Skate or Die 2: The Search for Double Trouble","year":1990,"developer":"Electronic Arts, Inc.","url":">Skate%20or%20Die%202","filesize":273056,"score":"","genres":"Action > Sports > Side view > 2D scrolling > Skateboarding","desc":"<p>In this sequel to Skate or Die, you have the option of just skateboarding on a ramp, or to go through an adventure. In the adventure, you are in a small community called Elmood. You play as the hero in this game. Basically you are trying to keep skateboarding and your life as it was after the Mayor of the town bans skateboards. After dealing with this, you set out to build your own halfpipe, and you deal with whatever comes your way. In this game, you go through many obstacles, and other skateboarders shooting paint and throwing eggs at you, you also can shoot at them, and of course upgrade your board from Lester when you run into him on his skateboard, as well as Lester who will give you tricks (giving them whatever they want, whether that's fries, drinks, CD's, etc;).</p>"},{"name":"Ski or Die","year":1990,"developer":"Electronic Arts, Inc.","url":">Ski%20or%20Die","filesize":133961,"score":7.3,"genres":"Sports > Tricks / stunts > Direct control > Olympiad / mixed sports > Snowboarding / skiing","desc":"<p>Ski or Die is a winter-themed extreme sports game in which the player can competes in 5 different events:<em> </em>Downhill Blitz*: Downhill skiing event in which the player can make large jumps over chasms and perform stunts in the moguls section</p><ul><li><p><em>Innertube Trash</em>: Two players descend a mountain in innertubes. Score points by picking up items, perforating your opponents tire with a knife or fork and finishing first.</p></li><li><p><em>Acro Aerials</em>: Ski down a ramp and score points by performing acrobatic jumps.</p></li><li><p><em>Snowball Blast</em>: First person snowball fight. Score points by taking out little that attack your snow fortress.</p></li><li><p><em>Snowboard Half-Pipe</em>: Put on your snowboard and score as much points as possible in a limited amount of time by performing tricks inside a half-pipe.</p></li></ul><p>Practice a single event or try the tournament. The tournament mode has hot-seat multiplayer support.</p>"},{"name":"Skull & Crossbones","year":1990,"developer":"Tengen Inc.","url":">Skull%20%26%20Crossbones%20%28USA%29%20%28Unl%29","filesize":108202,"score":6.5,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Sea pirates / Caribbean","desc":"<p>The player will fight as either Red Beard or One Eye through various pirate themed levels, like ships and forts, and even some non-pirate themed levels, battling ninjas, skeletons, and others in a quest to save a princess from an evil wizard. There's also a split screen mode for two players.</p><p>The pirates will use several weapons to fight, such as pistols, swords, knifes and their bare fists. At each level, players will have to kill at least 15 enemies to move on and fight the level's boss. Each one of the six levels can be selected freely right from the start, differing only in difficulty (time limit to beat).</p><p>Several skull &amp; crossbones flags are distributed through the levels, hiding booty, new weapons and traps (a skull symbol). There are some hidden flags which will appear as the pirate passes by them. At the end of each level, the players can trade their booty for new weapons, each one at different prices (the stronger costing more).</p>"},{"name":"Sky Destroyer","year":1985,"developer":"Taito Corporation"},{"name":"Sky Kid","year":1986,"developer":"Namcot","url":">Sky%20Kid%20%28USA%29","filesize":32395,"score":6.7,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Flight / aviation > World War I","desc":"<p>You are the legendary Red Baron, flying a plane through a horizontal side-scrolling scenery set during World War I. To complete a mission, you simply need to get to the landing spot on the other side without being shot down, but you can gain extra points by destroying enemy vehicles and planes. For huge points, pick up a bomb hidden in the level (you will be warned by a sound when approaching it) and drop it on a large structure. If you fail to land on the landing strip, you run out of fuel and crash.</p><p>You can only shoot horizontally and diagonally by tilting the plane's nose. When in trouble, perform an aerial loop with the secondary button, this often destroys other planes and avoids bullets. There is a co-op mode with the character Max as well.</p>"},{"name":"Sky Shark","year":1989,"developer":"Toaplan Co., Ltd.","url":">Sky%20Shark%20%28USA%29%20%28Rev%200A%29","filesize":66724,"score":6.8,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter","desc":"<p><em>Flying Shark</em> is a top-down shooter similar to Raiden. You start off with four lives and three bombs. With that (you can get more lives at certain point intervals, and more bombs can be found), you, the \"Flying Shark\" of your squadron, blast through five levels of enemy-infested battlefields with as many as six gun upgrades (Aside from the bombs and the gun upgrade, there are no other weapons to be found at all). Includes three difficulty levels and two-player support.</p>"},{"name":"Slalom","year":1987,"developer":"Rare Limited","url":">Slalom%20%28Europe%29","filesize":24696,"score":6.5,"genres":"Action > Sports > Behind view > Arcade > Snowboarding / skiing","desc":"<p>In Slalom you need to ski down different trails and beat the clock to move on to the next of the 24 trails. Other skiers, trees, snowmen, sledders, and moguls will get in your way and slow you down if you crash into them. Slalom flags are located throughout the trails, and skiing on the wrong side of these will cause your player to snowplow momentarily and lose speed, so to get the best times you need to make sure none of the flags are missed.</p>"},{"name":"Slow Mole","year":2021,"developer":""},{"name":"Smash T.V.","year":1991,"developer":"Williams Electronics Games, Inc.","url":">Smash%20TV","filesize":103062,"score":7.3,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The year is 1999. The world's most popular television show is Smash T.V., an ultra-violent contest between two armed-to-the-teeth combatants, set loose in a series of deadly arenas that are filled to bursting with hordes of mindless beasts and killer robots. The aim of the game is to blast everything in sight and try to grab more cash and prizes than the other guy. Toaster ovens, VCRs, fancy cars and luxury holidays are there for the taking... for anyone who can survive long enough to enjoy them.</p><p><em>Smash T.V.</em> is an insane shoot-em-up from the brain of Eugene Jarvis, creator of Robotron: 2084. It retains that game's frantic style of play and two-joystick control method, but adds plenty of gore, violence, a hint of satire and that all-important two player mode.</p>"},{"name":"Smurfs, The","year":1994,"developer":"Bit Managers S.L.","url":">Smurfs%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29","filesize":89408,"score":7,"genres":"Action > Side view > 2D scrolling > Licensed","desc":"<p>The evil Gargamel has captured three of the smurfs, so that he can have them for dinner (Once again). One of the smurfs must go out on a dangerous journey and rescue the captured smurfs. Beat the first two bosses to rescue the first two smurfs, then you can take on Gargamel. Make your way through forests, swamps, mountains, mines and more. Also ride storks, mine carts and logs to defeat Gargamel and his minions and to rescue the missing smurfs. </p><p>On each level you must collect five stars in order to get access to the bonus level (You don't have to collect the five stars in order to get through the main level). On the bonus level, try to collect as many bonuses as possible before the time runs out. There are three bonus levels: \"The Dam\", \"The Mushrooms\" and \"The Butterflies\".</p>"},{"name":"Snake Rattle N Roll","year":1990,"developer":"Rare Limited","url":">Snake%20Rattle%20%26%20Roll","filesize":162997,"score":7.7,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Arcade","desc":"<p>It's a race to the moon for the two snakes, Rattle and Roll!  Play alone or simultaneously with a friend as you out-score and out-eat your opponent - then weigh yourself on the scales and make for the exit!</p><p>Snake, Rattle 'n Roll is an isometric 3D platformer.  The object of each level is to eat as many Nibbley Pibblies (round creatures of various colours) as possible to make your snake heavy.  Once it's heavy enough, you must stand on the scales in the level, and if you're heavy enough, the door will open and you can make your way to the exit.</p><p>As with many platform games of its era, Snake, Rattle 'n Roll is incredibly difficult.  Foes include Jaws, a monster that's all teeth and will kill you if you stay in the water too long, and Bigfoots, which stomp all over the place and require multiple tongue lashings to defeat.  Then there's the many types of Nibblies, such as Pibblesplats, which hop around and splat into puddles, Pibbleboings, which are spring-loaded and jump incredibly high, and Pibblewings, which fly high out of reach.</p><p>Two-player mode provides both a co-op and competitive experience: while you are both trying to eat more Nibblies than your opponent, if you both stand on the level's scale at the same time, both of your weights will be counted and it will be possible for you to exit the level more quickly.</p>"},{"name":"Snake's Revenge","year":1990,"developer":"Konami Industry Co. Ltd.","url":">Snake%27s%20Revenge%20%28USA%29","filesize":144941,"score":6.7,"genres":"Action > Diagonal-down > Side view > Fixed / flip-screen > Direct control > Spy / espionage","desc":"<p><em>Snake's Revenge</em> is a licensed but non-canon sequel to the original Metal Gear for the NES. Three years has passed since the Outer Heaven incident. FOX-HOUND has gained intelligence that an unknown terrorist group has seized a remote facility containing mass-produced Metal Gear tanks, as well as a new Metal Gear prototype which was under development. The newly-promoted Lt. Solid Snake is called back into action to infiltrate the terrorists' base with the help of two FOX-HOUND rookies, former marine Nick Myer and navy intelligence agent John Turner.</p><p>The player once again assume the role of Snake. The objective is similar to the previous game, as the player must avoid any kind of visual contact (even moreso than the first game), while collecting weapons and equipment on-site. There is a greater variety of areas such as a jungle, a warehouse, a train, a couple of prisons and even a cargo ship containing the mass-produced Metal Gears. The player must also overcome new traps such as searchlights, soldiers in gyrocopters, door-sealing devices and even suicide bombers. The player must also interrogate captured enemy officers by injecting them with a truth serum to increase their rank, in addition to saving hostages like in the first game. Side-scrolling areas are also included in addition to the main overhead game, where the game takes a more action-oriented route (while still maintaining the stealth premise).</p>"},{"name":"Snoopy's Silly Sports Spectacular","year":1988,"developer":"Kotobuki System Co., Ltd.","url":">Snoopy%20Silly%20Sports","filesize":85944,"score":5.8,"genres":"Sports > Side view > Olympiad / mixed sports > Licensed > Regional differences","desc":"<p>The Silly Sports are being held in its traditional home of Italy and Snoopy, from the Peanuts comic strips, will want to attend. Snoopy packs his plane and brings along his relative, Spike as an opponent and the little yellow bird, Woodstock to judge. </p><p>Now Snoopy's ready to compete with 1 or 2 players in his own custom Olympiad of the following \"events\":1. <strong>The Sack Race</strong>: Snoopy and Spike race against one another in competing potato sacks.2. <strong>Boot Throwing</strong>: Just like the Hammer toss, but involving an old boot.3. <strong>Pogo</strong>: Hop on a Pogo Stick and hop over obstacles.4. <strong>Overboard</strong>: Snoopy and Spike play \"King of the Boat\" trying to knock each other into the water.5. <strong>Pile of Pizza</strong>: Balance the pizzas while trying to walk towards the finish line.6. <strong>River Jump</strong>: Pole Vault over the river (actually sticking the pole into the river) to the other side.</p><p>The Japanese version of this game, which was released first, uses a Donald Duck license rather than a Snoopy license (changing many of the character names above), but gameplay remains the same. The gameplay and events are based on Alternative World Games.</p>"},{"name":"Snow Brothers","year":1991,"developer":"Toaplan Co., Ltd.","url":">Snow%20Brothers%20%28Europe%29","filesize":92902,"score":7.2,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform > Direct control > Fantasy","desc":"<p>Nick and Tom are two Princes living the dream with two beautiful princesses. When suddenly the evil King Scorch freezes Prince Nick and Tom and kidnaps the Princesses. Now Nick and Tom find themselves with abilities dealing with snow and ice. These two Snow Brothers will need to hunt down the evil King Scorch and rescue the princesses.</p><p><em>Snow Bros.</em> is a fixed-screen platform game where players must defeat all enemies on each level (screen), 50 altogether. The Snow Bros use snow as their weapon, throwing it at the enemies to stun them. When lots of snow is thrown at an enemy, it becomes covered in a flurry and unable to move. These can be rolled into giant snowballs and pushed or kicked into other enemies. If left alone, enemies will eventually defrost and become angry at the player. The enemy filled snowballs are a much stronger weapon then the regular handful of snow and are the only effective weapon Nick and Tom have against the bosses.</p>"},{"name":"Soccer","year":1985,"developer":"Iwasaki Electronics Co. Ltd.","url":">Soccer%20%28Europe%29%20%28Rev%20A%29","filesize":24821,"score":5.6,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (European) / Soccer","desc":"<p>Soccer is an action game for two players or one player against the computer. You can play the game in one of five skill levels, choose from several different teams, and select the amount of time the match will take. Soccer features throw-ins, goal kicks, corner kicks, penalty kicks and an overhead view of the field which scrolls to follow the action.</p>"},{"name":"Solar Jetman: Hunt for the Golden Warpship","year":1990,"developer":"Zippo Games","url":">Solar%20Jetman%20-%20Hunt%20for%20the%20Golden%20Warpship%20%28USA%29","filesize":164763,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Space flight > Sci-fi / futuristic","desc":"<p>The golden warpship was once the most powerful ship in the galactic fleet. But the ship was captured by aliens, and its parts scattered throughout twelve different worlds. On each world deadly aliens, booby traps, black holes, and extreme gravitational forces guard the parts. It is now up to Solar Jetman to land on each of the worlds and retrieve all the parts so the golden warpship may be reassembled.</p><p>At the beginning of each world, Solar Jetman starts out at the mother ship and explores using a jetpod. When a part of the golden warpship or something else of use is located, the jetpod can be used to haul it back to the mother ship. The mother ship will move on to the next world when all the parts on the current world have been brought back. If the jetpod takes too much damage, Solar Jetman must return to the mother ship for repairs before continuing the quest.</p>"},{"name":"Solitaire","year":1992,"developer":"Odyssey Software, Inc."},{"name":"Solomon's Key","year":1986,"developer":"Tecmo, Ltd.","url":">Solomon%27s%20Key","filesize":34586,"score":7.3,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Arcade > Platform > Direct control","desc":"<p><em>Solomon's Key</em> is a platform game with both action and strategy elements. On each level your goal is to retrieve a key which can then be used to unlock the exit. To help out, you have a magic wand which can be used to create and destroy blocks (though some blocks can't be destroyed). In order to reach the key you will need carefully to arrange the blocks on the screen so you can jump your way around safely. Wandering around each level are a variety of enemies which will cause you to lose a life if you're caught. Some creatures can be killed by destroying the block they are standing on, others must be dodged. Hidden bonuses and magic can be found on many of the levels, sometimes even hidden in blocks. Some treasures give you bonus points, others can form magic spells to help deal with the enemies. To make the game more difficult, each level has a time limit in which it must be completed.</p>"},{"name":"Solstice: The Quest for the Staff of Demnos","year":1990,"developer":"Software Creations Ltd.","url":">Solstice","filesize":73385,"score":7.9,"genres":"Action > Isometric > Arcade > Puzzle elements > Fantasy","desc":"<p>The Princess Eleanor has been captured by the evil mage Morbius and is somewhere in the fortress of Kastlerock. You play the part of Shadax, who must now rescue the Princess by searching the fortress for the six pieces of the magical Staff of Demnos and use it to defeat Morbius. </p><p><em>Solstice</em> is a combination of puzzle-solving and action game played from an isometric 3D point of view. There are numerous rooms to explore in the fortress, many with dangerous, evil creatures wandering about and traps and obstacles to get past. Along the way there are magic potions, keys, and many other items to find which help you get past the creatures as well as reach new parts of the fortress.</p>"},{"name":"Somari the Adventurer","year":1994,"developer":"Somari Team"},{"name":"SonSon","year":1986,"developer":"Capcom Co., Ltd."},{"name":"Space Harrier","year":1989,"developer":"AM R&D Dept. #2"},{"name":"Space Hunter","year":1986,"developer":"Kotobuki System Co., Ltd."},{"name":"Space Invaders","year":1985,"developer":"Taito Corporation","url":">Space%20Invaders%20%28Japan%29","filesize":9302,"score":7.4,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>Earth is under attack from rows of bomb-dropping aliens, and you need to defend it! The rows of aliens begin at the top of the screen, and you control a laser cannon at the bottom of the screen. Your goal is to earn points by shooting the aliens before they can land. The aliens march back and forth, and each time the end of the screen is reached they will drop one row closer to the bottom. Shoot them all, and you move on to the next (tougher) level, but if even one of them lands the game is over. From time to time a flying saucer will pass by along the top of the screen; shoot this to earn extra points. Just above your laser cannon are four (or three, depending on the platform played on) shields; these can be used to hide from the alien's bombs, but will also block your own shots. You begin the game with a limited number of laser cannons, and if all of them are bombed the game ends.</p>"},{"name":"Space Shuttle Project","year":1991,"developer":"Imagineering Inc.","url":">Space%20Shuttle%20Project%20%28USA%29","filesize":124954,"score":"","genres":"Action > Side view > 2D scrolling > Space flight","desc":"<p>The Launch Director has assigned a Commander to take control of several NASA Space Launches to do some necessary jobs in space. It is the commander’s job to do all the pre-launch activities like fuelling the space ship and making sure all the crew are on safely and making sure all the post-launch activities are carried out like the rocket and fuel tank separation as well as the successful landing of the shuttle. The commander is also responsible for the extravehicular activities in space such as launching a satellite and building a space station.</p><p><em>Space Shuttle Project</em> simulates a Space Shuttle mission from pre-launch to landing. After writing in a name, the player is presented with a mini game that requires the player to memorise numbers and a space shuttle name to get pass security. After security the space shuttle project is split into four different stages each with there own challenges as follows:<em> </em><em>Stage 1 - Fuel and Board Shuttle:</em>* This stage requires the commander to use the lift to turn the oxygen and hydrogen switches on and open the shuttle doors. Then the commander must move down and up the lift picking up the crew needed for the mission (increases as the levels get harder) while avoiding sliders that cross in lift’s path. This task has to be done within the time limit.</p><ul><li><p><strong>Stage 2 - Space Shuttle Launch:</strong> This stage requires the commander to control the space shuttle into orbit while disconnecting the rocket boasters (SRB) and the external tank (ET). All this is controlled by playing two mini-games that require the player to ether stop the power bar at the correct point or by moving the bottom arrow left and right to match the movements of the top arrow. A third mini-game is added later that requires the player to memorize the correct combination</p></li><li><p><strong>Stage 3 - Extravehicular Activities:</strong> The activities that are competed in space vary depending on the mission. Mission 1 requires the commander to release a satellite into space navigating it to avoid all the other moving satellites that are littered though space. Missions 2, 4, and 6 requires the commander to build a part of a space station by grabbing a block from the shuttle and moving it into the correct part of the space station while avoiding satellites and making sure the oxygen levels don’t run out. Mission 3 requires to move and from a damaged satellite avoiding space rocks and repair it. Mission 5 is like mission 3 but to rescue a stranded Soviet cosmonaut.</p></li><li><p><strong>Stage 4 - Reenter Atmosphere and Land:</strong>This stage requires the commander to control the ship into reentry and land the space shuttle on a landing strip. The mini-games are the same as the space shuttle launch expect the D-pad is used for stopping the power bar.</p></li></ul><p>There are 6 different missions with each mission a being more difficult than the last and only five fails allowed before the whole mission fails. Password save is available by adding the supplied password numbers and space shuttle name instead of the memorized numbers at the security check.</p>"},{"name":"Spacegulls","year":2021,"developer":"Morphcat Games UG"},{"name":"Spartan X 2","year":1991,"developer":"Tamtex","url":">Spartan%20X%202%20%28Japan%29","filesize":124311,"score":"","genres":"Action > Side view > Arcade > Beat 'em up / brawler > Fighting","desc":"<p>Somewhat more faithful to the plot of the movie than the first Spartan X game, it attempts to tell the same story: In Barcelona, Mr. X has captured the pickpocket Silvia. In order to get her back, Thomas, a Kung-Fu master who runs a restaurant must travel the city, eventually reaching Mr. X's castle and attempt to rescue her.</p><p><em>Spartan X 2</em> is an expanded version of the original Spartan X game (aka Kung-Fu). Similar to that game, <em>Spartan X 2</em> is a side-scrolling fighting game. Controlling Thomas, the player is able to move left and right, jump, kick and punch. Thomas has an energy bar and is defeated if he loses all of the energy. Some enemies drop items such as potions which will help replenish this bar. At the end of each level, Thomas encounters a boss.</p><p>Story cutscenes are displayed between each level, where Thomas contacts other characters through use of a computer.</p>"},{"name":"Speedball","year":1991,"developer":"The Bitmap Brothers"},{"name":"Spelunker","year":1985,"developer":"Micro Graphic Image","url":">Spelunker%20%28USA%29","filesize":22149,"score":5.8,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>In this game, you are a spelunker who climbs deep down mountain caves in search for treasure. The levels consist of many platforms, connected to each other by a riding cart, ladders, ropes, etc. You'll have to time your jumping well, because a slight fall will lead to your death, and the abyss is near! You should jump over various obstacles, avoid ghost-like enemies, climb on ropes, and use inventory items such as dynamite to create obstacle-destroying explosions that will bring you nearer to the desired treasure.</p>"},{"name":"Spelunker II: Yūsha e no Chōsen","year":1987,"developer":"Now Production Co., Ltd."},{"name":"Spider-Man: Return of the Sinister Six","year":1992,"developer":"B.I.T.S., Ltd.","url":">Spider-Man%20-%20Return%20of%20the%20Sinister%20Six%20%28Europe%29","filesize":144601,"score":6.2,"genres":"Action > Side view > 2D scrolling > Licensed","desc":"<p>From the ingame intro:</p><p>\"Doctor Octopus is plotting the crowning caper of his criminal career... to rule the world.He has reunited the Sinister Six and with these super-villains together again, nothing stands in their way - except Spider-Man!\"</p><p><em>Spider-Man: Return of the Sinister Six</em> is a side-scrolling game which puts you in the role of Spidey throughout six levels against Electro, Sandman, Mysterio, Vulture, Hobgoblin and Doctor Octopus respectively. Some puzzle solving (like finding a key) is necessary to beat some levels. Spidey can duck jump, climb walls, punch, shoot webs to swing (by pressing punch and jump together) and perform a jump kick (by pressing the punch button twice). Collecting web cartridges allows Spidey to shoot limited web projectiles.</p><p>Although hard to die, Spidey has only one life, there are no items to recharge life (but killing some guys will do so) and only one continue.</p>"},{"name":"Spirit Impel","year":2021,"developer":"Passe Gaming"},{"name":"Spiritual Warfare","year":1992,"developer":"Wisdom Tree, Inc.","url":">Spirtual%20Warfare","filesize":131232,"score":4.8,"genres":"Action > Educational > Top-down > Religion","desc":"<p><em>Spiritual Warfare</em> is a Zelda-like overhead action game where you play as a soldier of God, fighting the forces of darkness in various parts of a modern city to find the armor of God, each one guarded by increasingly difficult demon bosses. When you are dire need, an angel may come down and help you, if you answer Bible questions correctly. The game will take through increasingly difficult levels of play, where in the end you will face off with Satan himself.</p>"},{"name":"Splatterhouse: Wanpaku Graffiti","year":1989,"developer":"Now Production Co., Ltd.","url":">Splatter%20House%20-%20Wanpaku%20Graffiti%20%28Japan%29","filesize":139049,"score":7.8,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Direct control > Comedy > Horror","desc":"<p>Wanpaku Graffiti is the first Splatterhouse game to appear on a home console. It is not clear how it fits in the series' timeline, but it starts with Jennifer mourning over Rick's grave (her boyfriend). Lightning strikes his grave and he is resurrected. Before she can rejoice, another bolt strikes the grave next to him and a jack-o-lantern appears. This pumpkin king kidnaps Jennifer and Rick barely has the time to wipe off the dust from his clothes before he sets off to rescue his girlfriend.</p><p>Although the game is not as gory as the other titles, there is still plenty of disturbing enemies such as headless chickens, severed hands and zombies. Through seven side-scrolling levels, including a graveyard, a mansion, a Japanese pagoda and an Egyptian pyramid, you chase the pumpkin king with your cleaver and a shotgun you can pick up along the road. Just like the other games in the series, there are lots of movie references. The game often needs good timing and pixel perfect jumps, as falling down from platforms will regenerate the enemies. You can pick up candy, hamburgers and cans of soda to restore your health.</p>"},{"name":"Spot","year":1990,"developer":"Virgin Mastertronic Ltd.","url":">Spot%20-%20The%20Video%20Game%20%28USA%29","filesize":105004,"score":7.3,"genres":"Puzzle > Strategy > Top-down > Fixed / flip-screen > Board game > Licensed","desc":"<p>A puzzle game loosely featuring licensing from the 7Up soft drink. The gameplay involves up to 4 players, which can be either human or computer, each taking on spots of a particular colour. Starting from opposite corners, they take it in turns to move, either by 'reproducing' one of their spots to form another one in an adjacent square, or by making a jump, losing the square you did have but taking one two spaces away.</p><p>When a piece lands next to one of another colour, that piece changes colour into that of their opponent. The winner of each round is either the last player with any pieces left, or the player who has the most pieces left when the level is full.</p>"},{"name":"Spy Hunter","year":1987,"developer":"Bally Midway Mfg Co.","url":">Spy%20Hunter%20%28USA%29","filesize":29450,"score":7.1,"genres":"Racing / Driving > Top-down > 2D scrolling > Arcade > Shooter > Direct control > Automobile > Naval / watercraft","desc":"<p>Originating in the arcades, <em>Spy Hunter</em> is a driving action game played from an overhead point of view. Your car is equipped with machine guns to help you get past the numerous enemies out on the road (be careful not to shoot any civilians, though!) Occasionally you will come across a weapons van, and if you drive into the back of the van your car becomes equipped with a second weapon (such as smoke screen, oil slick, or missiles). At several points the road splits and you can enter a boathouse which transforms your car into a boat temporarily. If you drive far enough the seasons change as well (watch out for icy conditions during winter!). The enemy cars will do anything to stop you, including running you off the road, firing guns from the back of a limo, or dropping bombs from a helicopter.</p>"},{"name":"Spy vs Spy","year":1986,"developer":"First Star Software, Inc.","url":">Spy%20vs%20Spy","filesize":25678,"score":7.2,"genres":"Action > Strategy > Side view > Fixed / flip-screen > Puzzle elements > Spy / espionage > Licensed","desc":"<p><em>MAD</em> magazine’s comic strip of the same name comes to life in this game which was designed for one or two players. The split-screen shows both spies at the same time. Play with a friend or against the machine.</p><p>The black spy and the white spy are out to outsmart each other before the time bell rings. Find the needed objects (money, passport, secret plans and airport door key) by searching rooms in the embassy, which include desks, file cabinets and other furniture. Foil your opponent by setting creative booby traps in the various rooms (a bomb in a dresser drawer, for instance). Traps can be disarmed with objects found in rooms (a water bucket from a firebox on the wall will disarm the bomb in the prior example). When all the items are together in the secret briefcase, head for the airport door.</p><p>Fights ensue when both spies enter the same room and are armed with clubs.</p>"},{"name":"Spy vs. Spy: The Island Caper","year":1987,"developer":"First Star Software, Inc."},{"name":"Sqoon","year":1986,"developer":"Home Data Corp."},{"name":"Square no Tom Sawyer","year":1989,"developer":"Square Co., Ltd."},{"name":"Stack-Up","year":1985,"developer":"Nintendo Co., Ltd.","url":">Stack-Up%20%28World%29","filesize":23674,"score":6.1,"genres":"Educational > Puzzle > Diagonal-down > Math / logic","desc":"<p>Set up R.O.B. with the colored discs included in the game and then control his movements in the game by using Professor Hector to jump onto various blocks. The blocks represent commands given to R.O.B. in sequence.</p><p>This game can be played in several different ways.  In the regular game, you have to stack up the colored discs as fast as possible and in a certain pattern and sequence. In memory mode you program an entire sequence of movements to move the discs and won't know if it actually works until you RUN the program. Finally there is a 1 or 2 player bingo mode in which you align different columns and rows to BINGO and activate rob commands. An opponent will also hop around activating commands. Your goal is to have R.O.B. move as many of the colored discs without dropping them.</p>"},{"name":"Stadium Events","year":1986,"developer":"TRY Co., Ltd.","url":">Stadium%20Events%20%28Europe%29","filesize":34190,"score":6,"genres":"Sports > Behind view > Olympiad / mixed sports","desc":"<p><em>Stadium Events</em>, later re-released as <em>World Class Track Meet</em>, is a track and field game for up to six players requiring the Power Pad. Only a maximum of two players can play together on the pad at the same time. There are several events: 100m dash, long jump, 110m hurdles and the triple jump. When you beat the computer in the single player mode, you move on to a faster opponent. The AI opponents are (slowest to fastest): Turtle, Bear, Horse, Rabbit, Bobcat and Cheetah. With each defeated opponent, you earn a medal or a trophy - the harder the opponent, the better the award.</p><p>Olympics is a 1-6 player event in which you will do all four events in a row. At the end, the computer will show you a total score. There is one player at a time in the jumping events and two at the same time (for two or more human players) in running events.</p>"},{"name":"Stadium Mud Buggies","year":1991,"developer":"Realtime Associates, Inc."},{"name":"Stanley: The Search for Dr. Livingston","year":1991,"developer":"Sculptured Software, Inc."},{"name":"Star Force","year":1985,"developer":"Tehkan Ltd.","url":">Star%20Force%20%28USA%29","filesize":26505,"score":6.7,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>You are a spaceship pilot shooting enemy spacecraft and ground targets. Pick up the special letter symbols for bonuses and additional power-ups. Levels or areas are named after the Greek letter alphabet and the end boss at the end of each area must be defeated before you can continue to the next area.</p>"},{"name":"Star Luster","year":1985,"developer":"Namco Limited"},{"name":"Star Soldier","year":1986,"developer":"Hudson Soft Company, Ltd.","url":">Star%20Soldier%20%28USA%29","filesize":37928,"score":6.7,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Starbrain, a giant super computer programmed for destruction, is threatening the Galactic Empire. As a skillful and experienced star soldier, you need to pilot the Caesar into the space station Starbrain has occupied. The space station is heavily guarded by enemy ships and strange robotic creatures. You will be able to find different weapons along the way to power up the Caesar and increase chances of a successful mission. Star Soldier is an arcade style vertically scrolling shooter for one player.</p>"},{"name":"Star Trek: 25th Anniversary","year":1991,"developer":"Interplay Productions, Inc.","url":">Star%20Trek%20-%2025th%20Anniversary%20%28USA%29","filesize":257983,"score":6.7,"genres":"Action > 1st-person > Top-down > Puzzle elements > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>The Ship Enterprise is on a 5 year mission: To explore strange new worlds, to seek out new life and new civilizations, to boldly go where no man has gone before. While the Enterprise is investigating strange gravitational disturbances, it is drawn into a dimensional hole and ends up in unknown space with broken warp engines. Now, Captain Kirk and his crew must try to repair the ship and find a way home.</p><p>Gameplay is divided into two parts, taking place on the ship's bridge and away missions. On the bridge, you can communicate with other ships, call up a map to navigate the ship (once the warp engines are fixed), enter battle mode to fight other ships (which does not happen very often), save the game or beam down to a planet's surface.  </p><p>These away missions make up the major part of the game and play very much like other action adventures. You can talk to aliens find and use objects, solve puzzles and fight against hostile lifeforms. Battles with other ships or on away missions are handled in simple Shoot'em Up-fashion.</p>"},{"name":"Star Trek: The Next Generation","year":1993,"developer":"Absolute Entertainment, Inc.","url":">Star%20Trek%20-%20The%20Next%20Generation%20%28USA%29","filesize":88710,"score":5.8,"genres":"Simulation > 1st-person > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>Cadets at Starfleet Academy must spend some of their classes in the starship simulator. This year is a simulation of the U.S.S. Enterprise. Substituting for Jean-Luc Picard, cadets will take the role of captain and then must access different crew members (functions of the ship) to complete a series of scripted missions.</p><p>Star Trek: The Next Generation is divided into a series of missions. Players will start on the main screen of the bridge and from there can access Navigation, Tactical, Operations, Engineering, Transporter Systems and Mission Control. Mini-games are sometimes used to complete certain ship functions (such as rerouting power to the shields).</p>"},{"name":"Star Versus","year":2015,"developer":"Studio Dustmop"},{"name":"Star Voyager","year":1986,"developer":"ASCII Corporation","url":">Star%20Voyager%20%28USA%29","filesize":34751,"score":"","genres":"Action > Strategy > 1st-person > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>CosmoStation Noah, located in Spiral Galaxy IX, is under siege by Molok Wardrivers. Now it's time for the pilot of the RH119 to fend off the Molok Wardrivers and save the CosmoStation.</p><p><em>Star Voyager</em>'s gameplay requires the player to venture through various sectors of the galaxy in search of different alien fleets so they can be defeated. Fuel stations are placed around sporadically and help if fuel is running low. There are several different planets that are either empty or have people that can upgrade the player's equipment to fight off the enemy fleets. These upgrades include the super laser, improved shields, and engines that enhance the ship's warping ability. Warping is a vital part of the gameplay. If players do not warp to different sectors wisely, they might end up lost, run into dangerous sectors such as the black hole or the asteroid field, or run out of fuel. The game ends if enemy ships destroy the CosmoStation Noah.</p>"},{"name":"Star Wars","year":1987,"developer":""},{"name":"Star Wars","year":1991,"developer":"NMS Software Ltd.","url":">Star%20Wars%20%28Europe%29","filesize":155511,"score":6.9,"genres":"Action > 1st-person > Side view > Top-down > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>This game is based closely on Star Wars Episode IV: A New Hope.  It combines a number of gameplay styles, but primarily it is a side scrolling run-and-jump platformer.</p><p>The game begins on Tatooine, where you, as Luke Skywalker, must travel around and meet up with R2D2, C3PO, Obi-Wan, and so on. Eventually, you travel through Mos Eisley and the Death Star as well.  While most of the game has you controlling Luke, Han or Leia directly, some of the various game styles include a first-person Millennium Falcon asteroid belt sequence, and an overhead view Death Star trench run.</p>"},{"name":"Star Wars: Premium Edition","year":2019,"developer":""},{"name":"Star Wars: The Empire Strikes Back","year":1992,"developer":"Lucasfilm Games LLC","url":">Star%20Wars%20-%20The%20Empire%20Strikes%20Back%20%28USA%29","filesize":310862,"score":6.6,"genres":"Action > Platform > Sci-fi / futuristic > Licensed","desc":"<p>Based on the movie, so the storyline is basically the same. You play as Luke Skywalker, and using your blaster, lightsaber and force power skills, you must journey through Hoth, Echo Base, Dagobah, Bespin and Cloud City. Enemies such as Darth Vader and Boba Fett will appear along the way, while R2, Yoda and Obi-Wan appear to give you tips on enemy weakness. Also keep an eye out for things you won't see in the movie, such as trying to beat Slave 1 (Boba Fett's ship) and fighting Cloud Cars.</p>"},{"name":"Stargate","year":1987,"developer":"Vid Kidz"},{"name":"Starship Hector","year":1987,"developer":"Hudson Soft Company, Ltd.","url":">Starship%20Hector%20%28USA%29","filesize":82792,"score":"","genres":"Action > Side view > Top-down > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>A top-down/side-scrolling sci-fi shooter in which you take control of a small starfighter as you make your way through an alien planet with your objective being to destroy all enemy forces.</p><p>Your ship is equipped with both a standard laser and an independently fired ground weapon, which you must coordinate to defeat ground and aerial enemies. A shield bar keeps track of your damage and you can replenish it by defeating certain enemies, but otherwise its just you, your ship and several stages of alien enemies that alternate between top-down and side-scrolling perspectives.</p>"},{"name":"StarTropics","year":1990,"developer":"Locomotive","url":">Startropics","filesize":258385,"score":7.5,"genres":"Action > Diagonal-down > Arcade > Puzzle elements","desc":"<p>In <em>StarTropics</em>, you play the part of Michael Jones. Mike's uncle (Dr. Jones, a famous archaeologist) is on C-Island looking for some lost ruins and has invited Mike to come visit him. However, shortly after arriving on the island Mike learns from Chief Coralcola that Dr. Jones has recently been abducted! Now it is up to Mike to locate Dr. Jones and find out why he was abducted. </p><p><em>StarTropics</em> is an action game with light role-playing elements, played from an overhead point of view. Starting out with just an island yo-yo, Mike will need to search the island for Dr. Jones. The villagers may be able to offer some clues, there are many dangerous enemies to defeat, and along the way there are a variety of new weapons and other items to be found which will help Mike on his quest. The cartridge uses a battery backup to allow games to be saved.</p>"},{"name":"Stealth ATF","year":1989,"developer":"Imagineering Inc.","url":">Stealth%20ATF%20%28USA%29","filesize":90000,"score":5.1,"genres":"Simulation > 1st-person > Side view > Flight / aviation","desc":"<p><em>Stealth ATF</em> is a flight simulator in which you pilot a F-117A, a.k.a. Nighthawk in several missions.</p><p>In every mission's beginning and ending the player has to take off and land the plane respectively, from a side view. Failing to land after completing the target objectives means failing to succeed in mission and thus having to replay it.</p><p>The view during the flight is from inside the cockpit, and the gameplay offers total freedom of movement on flight. The terrain is infinite, and the enemies will re-appear on the radar every time they fly out of range. The player flies in different locations, such as the Middle East, Alaska, the Pacific, etc. During flight, the player can also turn off the music and play with only the flight sounds.</p><p>The mission is to defeat a fixed number of enemies each mission. The targets will always be aerial ones. The weapons available are a cannon (which ammunition is unlimited) and missiles (8 per mission). If an enemy shoots a missile, the player can try to avoid it using the stealth mode (pressing the start button) once per mission. The stealth mode will automatically turn off once the player passes out of the danger. If players manage to accomplish the mission perfectly, a bonus round is offered, and they have to try to take down as many enemies as they can.</p><p>The game can be played by one or two player taking turns. A second player can also take control of the aircraft closest to the center of the radar, either in one or two player mode.</p>"},{"name":"STED: Iseki Wakusei no Yabō","year":1990,"developer":"Alpha Denshi Kōgyō Co., Ltd."},{"name":"Stick Hunter: Exciting Ice Hockey","year":1987,"developer":"Micronics"},{"name":"Stinger","year":1986,"developer":"Konami Co., Ltd.","url":">Stinger%20%28USA%29","filesize":57997,"score":6.6,"genres":"Action > Side view > Top-down > Anime / Manga > Shooter > Flight / aviation > Sci-fi / futuristic > Regional differences","desc":"<p>Save Professor Cinnamon!  When aliens from the planet Attackon kidnap the inventor during their invasion of Earth, two TwinBee Stinger jets (armed with boxing gloves) are unleashed to rescue Cinnamon before the aliens turn the Earth into a giant ball of cotton candy!  </p><p>In this vertical and horizontal scrolling shooter, blast away unusual creatures and even more bizarre bosses, while collecting power-ups and super weapons. By repeatedly shooting bells that come out of the clouds, these bells will change colors, each color giving a different ability. Getting shot down releases a ghost of Stinger, which can be recollected to gain the jet's powers back.</p><p>In the two-player mode, if TwinBee (cyan craft) and GwinBee (green craft) align their flights (one behind the other) they can turn their guns into a ripple laser. The Japanese version features a three players mode, with the addition of WinBee (the magenta craft, which was removed from the US version).</p>"},{"name":"Street Cop","year":1987,"developer":"Sonata","url":">Street%20Cop","filesize":94892,"score":"","genres":"Action > Side view > 2D scrolling > Crime","desc":"<p>One of the few NES games that uses the Power Pad. You play a cop who must chase down and catch the criminals. The game takes you through the streets of a city, where you must turn corners and keep running to catch the bad guys. You use the NES power pad to run through the streets, faster you run faster the cop will give chase. You use the controller to use your nightstick to apprehend the criminal.</p>"},{"name":"Street Fighter 2010: The Final Fight","year":1990,"developer":"Capcom Co., Ltd.","url":">Street%20Fighter%202010%20-%20The%20Final%20Fight%20%28USA%29","filesize":177713,"score":6.8,"genres":"Action > Side view > Platform > Sci-fi / futuristic","desc":"<p>The player is Ken, the hero of the <em>Street Fighter</em> series. It's been 25 years since he last participated in a fighting tournament. He has become a scientist and has developed a powerful medicine together with his friend Troy. But an unknown fiend breaks into his laboratory, kills Troy, and steals the invention. It's time to recall the good old days and to embark on a quest for revenge!</p><p>Despite the US title, the game has little to do with the <em>Street Fighter</em> or the Final Fight games. This is an action platformer in which the player navigates Ken around, trying to avoid or kill the enemies by shooting at them with ranged weapons, adjusting the direction of the shot, or kicking and punching them. Ken is very agile and can jump high and climb walls.</p>"},{"name":"Strider","year":1989,"developer":"Capcom Co., Ltd.","url":">Strider%20%28USA%29","filesize":145030,"score":7,"genres":"Action > Role-playing (RPG) > Side view > 2D scrolling > Metroidvania > Platform > Sci-fi / futuristic","desc":"<p>The Striders are a global organization of infiltration specialists who work to combat villainy and keep the world safe. From their orbital space station, the Blue Dragon, they are able to quickly reach anywhere in the world.</p><p>Hiryu is one of the top striders. He is given the task by Vice-Director Matic, of finding another captured strider, Kain. But rather than mount a rescue, Hiryu is told his assignment is to kill Kain. Hiryu questions these orders and travels to Kain's last known location to try to find him...</p><p><em>Strider</em> is a platform game where Hiryu must fight his way past enemies and uncover keys, characters and data disks (which can be analysed aboard the Blue Dragon) to find out what's going on. His primary weapon is his jumping ability and sword, the Cypher, which he uses to strike with great speed. At some point in the game, the Cypher may be modified to shoot plasma arrows. Hiryu also has a various set of \"skills\" which he learns as he gains levels. Examples of skills are a healing ability (Medical), a jumping ability (Jump), some additional attacks (Spark, Fire, Sp-Ball) and the ability to leave an area (Warp).</p>"},{"name":"Stunt Kids","year":1992,"developer":"Codemasters"},{"name":"Sugoro Quest: Dice no Senshi Tachi","year":1991,"developer":"Technos Japan Corp."},{"name":"Suishō no Dragon","year":1986,"developer":"Square Co., Ltd."},{"name":"Summer Carnival '92: Recca","year":1992,"developer":"KID Corp."},{"name":"Sunday Funday: The Ride","year":1995,"developer":"Wisdom Tree, Inc."},{"name":"Super Bat Puncher: Demo Version","year":2011,"developer":"Morphcat Games UG"},{"name":"Super Boy Allan","year":1987,"developer":""},{"name":"Super Cars","year":1991,"developer":"Magnetic Fields (Software Design) Ltd."},{"name":"Super Chinese 3","year":1991,"developer":"Culture Brain Inc."},{"name":"Super Contra","year":1990,"developer":"Konami Industry Co. Ltd.","url":">Super%20C%20%28USA%29","filesize":148987,"score":7.7,"genres":"Action > Side view > Top-down > Arcade > Platform > Shooter > Regional differences","desc":"<p>The alien Red Falcon is back, and planning on taking over the planet Earth. Now it's up to Scorpion and Mad Dog to battle through five levels and save the planet.</p><p><em>Super Contra</em> is the sequel to Contra. Gameplay is a combination of side scrolling/platform and top down view. There is a wide variety of enemies to defeat, starting with earthly locations, and progressing to more alien. To help out, weapon upgrades can be found as the game progresses. Two players can play simultaneously, or one player can attempt to take on Red Falcon himself.</p>"},{"name":"Super Dodge Ball","year":1988,"developer":"Technos Japan Corp.","url":">Super%20Dodge%20Ball","filesize":103891,"score":7.3,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Anime / Manga > Dodgeball","desc":"<p>This ain't elementary school and it sure as heck ain't gym class. This is <em>Super Dodge Ball</em>. Control your team of six players to pummel the opposing team into submission using only the ball and your team's unique skills. Each player has his own special attacks and each team has their own unique attributes.</p><p>Play the World Cup mode and take on teams from around the world to claim the championship. You play as the star USA team and must work your way through teams from countries such as England, Iceland, Japan, and more to finally take on the current ruling world champions, the Soviet Union.</p><p>Or you can challenge a friend in Versus mode and go head to head with whatever teams you choose.</p><p>Or, if you just feel like cutting loose, you can play Bean Ball mode which is just a free-for-all every-man-for-himself romp in the school yard. Be the last man standing. You can play this alone or with a friend, but the computer will control the remaining 4-5 players.</p>"},{"name":"Super Dyna'mix Badminton","year":1988,"developer":"Pax Softnica","url":">Super%20Dyna%27mix%20Badminton%20%28Japan%29","filesize":24561,"score":"","genres":"Sports > Diagonal-down > 2D scrolling","desc":"<p>Radically different from other racquet sports such as tennis, badminton uses a high-drag shuttle which gives it an irregular path. In this video game adaptation, the player controls the Japanese player in a competition against five opponents: Canada, USA, UK, South Korea and China. Each match is played on best-of-five sets, played to 15 (boys) or 11 (girls) points. Four different courts can be chosen.</p><p>Along the d-pad, two buttons are used to control the player - one to swing the racquet, and other to jump. By following the shadow of the shuttle the player can position himself correctly, and then hit it in perfect timing, giving it enough power and lift to reach the opponent's side, and then (hopefully) descend out of the opponent's reach. Jumping allows the player to hit the shuttle downwards but still over the net, reducing the reaction time for a proper return drastically.</p>"},{"name":"Super Glove Ball","year":1990,"developer":"Rare Limited","url":">Super%20Glove%20Ball","filesize":74954,"score":"","genres":"Action > 1st-person > Arcade > Paddle / Pong > Puzzle elements > Sci-fi / futuristic","desc":"<p>A 3D style game inspired by ball-and-paddle games, such as Breakout. Super Glove Ball was designed exclusively for Mattel's Power Glove accessory (although it can still be played with a normal controller).</p><p>Your shuttle commander has been trapped in a dimensional maze in space, and you must use your glove to throw an energy ball at the walls in order to advance.</p><p>The walls in each maze room you encounter are filled with blocks. Using your Power Glove, you have to entirely break down a wall before being allowed to advance to the next room. </p><p>While trying to progress through the maze, your character will be under attack by a range of creatures, and a wizard who wants to mess with your work. The object for the player is to find the way out of the maze and rescue the Commander.</p>"},{"name":"Super Hydlide","year":1989,"developer":"T&E Soft, Inc."},{"name":"Super Jeopardy!","year":1991,"developer":"GameTek, Inc.","url":">Super%20Jeopardy%21%20%28USA%29","filesize":166465,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Game show / trivia / quiz > Licensed","desc":"<p><em>Super Jeopardy!</em> is based on the popular Jeopardy! TV game show. In this digital incarnation, 4 players compete at answering reverse trivia questions in trademark Jeopardy! fashion-- i.e., the host provides the answer and a player has to provide the questions. As many of 4 human players can participate, with the remaining slots filled by the computer. Competition takes place in quarter-final, semi-final, and final round modes.</p><p>A player will select a question from one of 6 categories. The game gives the answer to the question and the players use their controllers to buzz in. At that point, a player has 80 seconds to spell out the question (and the computer has already provided the \"What is...\" question preamble). In the player gets the question wrong, that player loses money and the remaining players have an opportunity to buzz in.</p>"},{"name":"Super Lode Runner","year":1987,"developer":"Irem Corp."},{"name":"Super Mario Bros.","year":1985,"developer":"Nintendo Co., Ltd.","url":">Super%20Mario%20Bros.%20%28World%29","filesize":31930,"score":8.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control","desc":"<p>The Princess has been kidnapped by the evil Bowser, and it is up to Mario and brother Luigi to save the day.</p><p>The first-ever platform adventure for the Mario Brothers has the player exploring level after level, with Bowser to contend with as the end of level boss. Power-ups include the Super Mushroom, which increases Mario's size and power, the fire flower, allowing him to shoot fireballs at enemies, and the ever-important starman for a short burst of invincibility.</p><p>Each level includes a bonus section filled with coins plus a shortcut through the level, plenty of bad buys and obstacles to get past, and an end-of-level flag, in which the higher the player grabs it, the more points are awarded to them. Certain levels also include warp points, which take the player to higher levels.</p>"},{"name":"Super Mario Bros. / Duck Hunt","year":1988,"developer":"Nintendo Co., Ltd.","url":">Super%20Mario%20Bros.%20%2B%20Duck%20Hunt%20%28USA%29","filesize":49032,"score":8.4,"genres":"Compilation","desc":"<p><em>Super Mario Bros. / Duck Hunt</em> is the game cartridge that came with the Nintendo Entertainment System consumer package that included a control deck, two controllers, and a light zapper. The included games are:</p><ul><li>Super Mario Bros.</li><li>Duck Hunt</li></ul>"},{"name":"Super Mario Bros. / Duck Hunt / World Class Track Meet","year":1988,"developer":"Nintendo Co., Ltd.","url":">Super%20Mario%20Bros.%20%2B%20Duck%20Hunt%20%2B%20World%20Class%20Track%20Meet%20%28USA%29%20%28Rev%20A%29","filesize":83568,"score":7.9,"genres":"Compilation","desc":"<p>If you bought a Nintendo Entertainment System Power Set, which came with two controllers, a Zapper light gun and a Power Pad, then you got this three-games-in-one cartridge, including:</p><ul><li>Super Mario Bros.: the Princess has been kidnapped by the evil Bowser, and it is up to Mario and brother Luigi to save the day.</li><li>Duck Hunt: in Duck Hunt you need to use the Nintendo's light zapper to shoot ducks which your trusty dog scares out of the swamp.</li><li>World Class Track Meet: this is a track and field game for up to six players requiring the Power Pad.</li></ul>"},{"name":"Super Mario Bros. / Tetris / Nintendo World Cup","year":1990,"developer":"","url":">Super%20Mario%20Bros.%20%2B%20Tetris%20%2B%20Nintendo%20World%20Cup%20%28Europe%29%20%28Rev%20A%29","filesize":182410,"score":"","genres":"Compilation","desc":"<p>This cartridge contains three games:</p><ul><li>Nintendo World Cup</li><li>Super Mario Bros.</li><li>Tetris</li></ul>"},{"name":"Super Mario Bros. 2","year":1986,"developer":"Nintendo Co., Ltd.","url":">Super%20Mario%20Bros.%202%20%28USA%29%20%28Rev%20A%29","filesize":78177,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Direct control","desc":"<p>The Princess has been kidnapped by King Koopa (again) and it's up to Mario and Luigi to save her (again). Not to be confused with the western Super Mario Bros. 2, this sequel to Super Mario Bros. is very much an expansion to the original, with many reused graphics and concepts, though new ones are also present.</p><p>Instead of offering a two-player mode as in the original, this game allows you to choose between a Mario mode and a Luigi mode, with each character handling differently. Mario has tighter ground control, while Luigi has greater jumping capabilities.</p><p>Power-ups remain the same: Super Mushrooms grow a brother from small to Super size, Fire Flowers give them the ability to throw fireballs at enemies, Starman makes a character temporarily invincible, and a 1-Up Mushroom will give one more life. New to this game is a power-down, a Poison Mushroom which will harm you as if it were an enemy.</p><p>The goal is still to survive from the left side of the level to the right, avoiding perils and bopping enemies along the way, progressing through a series of 8 worlds with 4 levels each. That is, unless a warp zone is found allowing areas to be skipped. There are new tricks that work for and against the player, though. Some piranha plants will come out of their pipe even if you're standing right next to them, and bloobers now appear outside of the water. Wind can be present to alter how jumps will behave. Some warp zones will actually take the player to an earlier level instead of to a later one.</p>"},{"name":"Super Mario Bros. 2: Mario Madness","year":1988,"developer":"Nintendo Co., Ltd."},{"name":"Super Mario Bros. 3","year":1988,"developer":"Nintendo R&D2","url":">Super%20Mario%20Bros.%203%20%28USA%29%20%28Rev%20A%29","filesize":227421,"score":8.7,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Regional differences","desc":"<p>Bowser is back, and along with the Bowser kids, he's out to spoil Mario's day once again. </p><p>This time, along with nabbing the Princess, the Bowser crew have also taken the magic wands from the Kings of each land and turned them into creatures.It's up to Mario and Luigi to get back the magic wands, defeat Bowser, and save the Princess all before the day is done.</p><p>Old and new power-ups abound in each level for the Mario Brothers, including the return of the Super Mushroom and Fire Flower, plus the new power-ups including the frog suit, the warp flute, and the most important of all, the leaf, which allows the player to fly and attack enemies with your tail.</p>"},{"name":"Super Mario World","year":1995,"developer":"Hummer Team"},{"name":"Super Maruo","year":1986,"developer":""},{"name":"Super Pinball","year":1988,"developer":"Soft Machine"},{"name":"Super Pitfall","year":1986,"developer":"Pony, Inc."},{"name":"Super Spike V'Ball / Nintendo World Cup","year":1990,"developer":"","url":">Super%20Spike%20V-ball%20World%20Cup","filesize":107834,"score":"","genres":"Compilation","desc":"<p><em>Super Spike V'Ball / Nintendo World Cup</em> was a pack-in game included with the Nintendo Entertainment System Sports Set. The package included a standard NES console, four game controllers, and the Four Score Multiplayer Adapter. The cart included two games developed by Technos:* Super Spike V'Ball, a two-on-two beach volleyball game where you played on a tournament, ending with the world championship. The game supported up to four players on one match at a time.</p><ul><li>Nintendo World Cup, a soccer game where you (and a friend) chose to represent a team and played several matches until you won the World Cup. The game featured little to no rules, which means that you could hit your opponents as much as you want, without fear of the Ref getting in the way.</li></ul><p>Both games were compatible with the included Four Score NES multiplayer adapter.</p>"},{"name":"Super Sprint","year":1989,"developer":"Atari Games Corporation","url":">Super%20Sprint%20%28USA%29%20%28Unl%29","filesize":43705,"score":6.9,"genres":"Racing / Driving > Top-down > Fixed / flip-screen > Arcade > Automobile > Track racing","desc":"<p>Super Sprint is a racing game for one or two players, with the Arcade version allowing three players to race at the same time. Gameplay is from an overhead view of the racetrack. The racetracks start simple and gradually get more complicated, and may also feature obstacles ranging from traffic cones to tornadoes. Occasionally wrenches will appear in the roadway, and when collected they can be used after a race to power up your car with better tires, better acceleration or a higher top speed.</p>"},{"name":"Super Spy Hunter","year":1991,"developer":"Tokai Engineering","url":">Super%20Spy%20Hunter%20%28USA%29","filesize":142643,"score":7.6,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Automobile > Sci-fi / futuristic > Spy / espionage","desc":"<p>In the year 2525, things are a mess. politically. Terrorists led by someone named \"X\" want to attack the United Nations. The CIA is in charge of discouraging the attacks. To that end, and since all of their best agents have failed the task, they send out an unofficial agent -- you, the Super Spy Hunter.</p><p>The Super Spy Hunter has a super spy car. It's actually a well-armed car that can turn into a boat or a plane at opportune times. The action is fast vertical scrolling as the vehicle faces all manner of powerful vehicle threats from a well-funded terrorist enemy -- cars, trucks, helicopters, etc. Luckily, there are many powerups to collect along the way, both defensive and offensive.</p>"},{"name":"Super Star Force: Jikūreki no Himitsu","year":1986,"developer":"Tecmo, Ltd."},{"name":"Super Team Games","year":1987,"developer":"Sonata"},{"name":"Super Turrican","year":1993,"developer":"Rainbow Arts Software GmbH","url":">Super%20Turrican%20%28Europe%29","filesize":112903,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform > Shooter","desc":"<p>Like other entries in the series, Super Turrican for the NES is a side-scrolling platformer in which players explore large levels filled with enemies items and secret areas. Three different, upgradable weapons are available: multiple (spreadshot), laser and rebound. Holding down the fire button activates a rotatable laser that is useful for discovering hidden power-up capsules.</p><p>Despite carrying the same name as one of its big brothers, Super Turrican for the NES is based on Turrican and Turrican II. While some levels are very similar to those found in Turrican I and II (with only slight changes of layout and enemy types), others are entirely new. </p><p>Apart from different/new level design, there are other notable changes: Holding down the fire button let's Turrican run, there is no time limit to levels anymore, energy wheel usage is limitless and the shield isn't time based anymore, but can sustain a certain number of hits.</p>"},{"name":"Super Uwol","year":2016,"developer":"The Mojon Twins"},{"name":"Superman","year":1987,"developer":"Kotobuki System Co., Ltd."},{"name":"Swamp Thing","year":1992,"developer":"Imagineering Inc.","url":">Swamp%20Thing%20%28Europe%29","filesize":129768,"score":5.3,"genres":"Action > Side view > 2D scrolling > Platform > Horror > Licensed","desc":"<p><em>Swamp Thing</em> is based on the DC comic of the same name. Deep in the swamps of Louisiana, a Dr. Holland, is hard at work on a growth formula for plants. His sponsor however has different ideas for the technology and burns down the lab. The poor doctor is burned and covered with formula and inside of the organically rich Bayou swamps... he becomes Swamp Thing.</p><p>The game is a side-scrolling platform game. Swamp Thing can punch (but not duck and punch) and jump a short distance. Health power-ups will be needed to keep him alive and additionally ball power-ups can be found to give him a projectile weapon.</p>"},{"name":"SWAT: Special Weapons and Tactics","year":1987,"developer":"Shouei System"},{"name":"Sweet Home","year":1989,"developer":"Capcom Co., Ltd."},{"name":"Sword Master","year":1990,"developer":"Athena Co., Ltd.","url":">Sword%20Master%20%28Europe%29","filesize":132863,"score":6.5,"genres":"Action > Side view > Fantasy","desc":"<p><em>Sword Master</em> establishes the tale of an evil wizard in league with a monstrous demon who have dared to kidnap a damsel. The Sword Master is a knight who seeks to rescue the fair lady and destroy the evil people and creatures in the castle in which they dwell.</p><p>It is a parallax side-scrolling action game in which the player must use sword and shield to battle through 7 game levels, from the forest, to a cursed town, to multiple levels of the villain's castle lair. The player will encounter giant bats, wolves, skeleton warriors, evil knights, wizards, lizard men, gargoyles, and other fierce enemies on his quest. The Sword Master can swing his sword, defend with his shield, and gather power-ups which enable him to change his form; for example, the Sword Master can transform into a magic user himself and cast offensive magic spells.</p>"},{"name":"Swords and Serpents","year":1990,"developer":"Interplay Productions, Inc.","url":">Swords%20and%20Serpents%20%28Europe%29","filesize":81400,"score":6.6,"genres":"Role-playing (RPG) > 1st-person > Fantasy","desc":"<p>Deep in the dungeons lay the fabled ruby treasures. Many brave souls have tried to recover them; all have failed. Little did they know how futile their quests would be -- they met a horrible fate at the hands of a horrible serpent king. Can your party of champions defeat the dragon and claim the ruby treasures? Or will you, too, be vanquished?</p><p><em>Swords and Serpents</em> is a first-person, party-based CRPG in the tradition of Wizardry. Put together a team of 4 heroes (roll your own characters or simply use the pre-generated party) from three classes: warrior, thief, and magician. A 16-level dungeon awaits you, full of weapons, armor, magic spells, and other valuable items. Beware, though: an assortment of traditional fantasy beasts and villains awaits you! </p><p>Teleporters and \"zoom tubes\" speed up your travels. Temples provide safe havens for your party to restore health and mana. An auto-map feature helps the player keep track of what locations you have visited. A password system allows you to save your progress as you travel deeper into the darkness.</p>"}]