[{"name":"Taboo: The Sixth Sense","year":1989,"developer":"Rare Limited","url":"2#Taboo%20-%20The%20Sixth%20Sense%20%28USA%29%20%28Rev%20A%29.zip","filesize":1,"score":3.6,"genres":"Simulation > Cards / tiles > Party game","desc":"<p>Turn the Nintendo Entertainment System into a tarot card deck with Taboo: The Sixth Sense.  Write down a questions via the controller, and after a shuffling of cards, the game will attempt to predict your future.  Some fortunes may be positive, offering wealth, fame and power.  Other fortunes may warn the player to take care and use caution in future events.  After the final card is revealed, the player has an option to choose their lucky numbers.  Obviously, Taboo: The Sixth Sense is meant for entertainment purposes only, and should be taken as such.</p>"},{"name":"Tag Team Wrestling","year":1986,"developer":"Technos Japan Corp.","url":"3#Tag_Team_Wrestling/Tag_team_pro_wrestling.nes","filesize":40976,"score":5.5,"genres":"Sports > Diagonal-down > Side view > Fixed / flip-screen > Arcade > Wrestling","desc":"<p>A wrestling game that focused on teams.  You can either play as a face team (the good guys) or a heel team (the baddies)!</p>"},{"name":"Tagin' Dragon","year":1989,"developer":"Sachen"},{"name":"Taiwan Mahjong: 16","year":1989,"developer":"Thin Chen Enterprise"},{"name":"Taiyō no Yūsha: Fighbird","year":1992,"developer":"Tamtex"},{"name":"Takahashi Meijin no Bōkenjima IV","year":1994,"developer":"Hudson Soft Company, Ltd."},{"name":"Takahashi Meijin no Bug-tte Honey","year":1987,"developer":"Hudson Soft Company, Ltd."},{"name":"Takeshi no Chousenjou","year":1986,"developer":"Taito Corporation","url":"2#Takeshi%20no%20Chousenjou%20%28Japan%29.zip","filesize":1,"score":"","genres":"Action > Side view","desc":"<p><em>Takeshi no Chōsenjō</em> is a game based on the ideas and bearing of the name of Japanese comedian Takeshi Kitano.</p><p>The player takes control of a regular office worker who finds out that there is a treasure hidden somewhere on an island. The game world consists mostly of urban areas and is viewed from a side-scrolling perspective. The protagonist can jump and punch any character he encounters, even including the old man at the password screen (which results in a game over). The player character's health is measured in hearts. Hostile characters may attack him, but most of the people on the streets and indoor locations are harmless.</p><p>Besides exploring locations, the game includes other activities, such as obtaining a divorce from the protagonist's wife, completing a side-scrolling shooting sequence with a hang glider, and using a microphone built into the Famicom's second controller to perform a karaoke song.</p>"},{"name":"Tales of the Unknown: Volume I - The Bard's Tale","year":1990,"developer":"Interplay Productions, Inc."},{"name":"Tanigawa Kōji no Shōgi Shinan II: Meijin e no Michi","year":1987,"developer":""},{"name":"Tantei Jingūji Saburō: Kiken na Futari","year":1988,"developer":"Data East Corporation"},{"name":"Tantei Jingūji Saburō: Shinjuku Chūō Kōen Satsujin Jiken","year":1987,"developer":"Data East Corporation"},{"name":"Tantei Jingūji Saburō: Toki no Sugiyuku Mama ni","year":1990,"developer":"Data East Corporation"},{"name":"Tantei Jingūji Saburō: Yokohama-kō Renzoku Satsujin Jiken","year":1988,"developer":"Data East Corporation"},{"name":"Tapeworm Disco Puzzle","year":2021,"developer":"Lowtek Games"},{"name":"Target: Renegade","year":1990,"developer":"Ocean Software Ltd.","url":"2#Target%20Renegade%20%28USA%29.zip","filesize":1,"score":6.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler","desc":"<p>Mr. Big is back in town, and this time he's captured your brother! He's being held at Big's Pig Pen which is located on the upper side of town. The problem is, every gang in the city is out looking for you. It is now up to you to beat the odds and rescue your brother. You start the game armed only with your fists, and along the way there are some additional weapons to be found such as baseball bats or garbage cans. Gameplay is an arcade style side scrolling action game for one player.</p>"},{"name":"Tecmo Baseball","year":1989,"developer":"Tecmo, Ltd.","url":"3#Tecmo_Baseball/Tecmo_baseball.nes","filesize":262160,"score":"","genres":"Sports > Behind view > Diagonal-down > Baseball","desc":"<p>Tecmo Baseball is one of the many baseball games released for the Nintendo Entertainment Systems. There are five modes in Tecmo Baseball: One Player, Two Player, One Player Allstar, Two Player Allstar, and a watch mode. In One Player mode you pick from one of the fourteen teams and challenge each of the other teams. A password feature allows you to continue from where you left off. You also have the option of using the DH rule.</p><p>Gameplay is similar to the many other baseball released for the NES. The camera angle when batting or pitching is from behind the pitcher. The pitcher can pitch the ball high and low, as well as curve it. Tecmo Baseball includes digitized voices for the umpire.</p>"},{"name":"Tecmo Bowl","year":1989,"developer":"Tecmo, Ltd.","url":"3#Tecmo_Bowl/Tecmo_bowl.nes","filesize":262160,"score":7.1,"genres":"Action > Sports > Side view > Top-down > Football (American) > Licensed","desc":"<p>The most popular American football game to hit the NES console, Tecmo Bowl pits the player vs. the computer in 11 game single-elimination playoff action, or you can go head-to-head with a human opponent in action or coach mode.  There are 12 teams of real NFL players (circa 1988) to choose from, but don't look for official NFL team logos or mascots like Bears or Dolphins--Tecmo Bowl has the NFLPA but not the NFL license.</p><p>The play perspective is top-down and the screen scrolls horizontally.  Player graphics are large and colorful, which is made possible by limiting the number of players to nine per team.  Animated cut-scenes are shown following touchdowns and at half-time, and crowds are shown filling the endzone seats.</p><p>There are four plays to choose from on offense--usually two runs and two passes. The player takes control of the quarterback before the snap and then either hands off to the running back or works through his receiver progression from the top to the bottom of the screen.  Defense consists of trying to guess which offensive play the opponent will select and then taking control of one of the defensive players before the snap.  A very simple power meter system is used for kicking field goals, extra points, and punts.</p><p>There are no game or season stats and there is no way to save your season, but there is a password feature allowing you to resume tournament play where you left off.</p>"},{"name":"Tecmo Cup: Soccer Game","year":1988,"developer":"Tecmo, Ltd."},{"name":"Tecmo NBA Basketball","year":1992,"developer":"Sculptured Software, Inc.","url":"2#Tecmo%20NBA%20Basketball%20%28USA%29%20%28Rev%20A%29.zip","filesize":1,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Basketball > Licensed","desc":"<p>This basketball game is very similar to Tecmo Super NBA Basketball with the main difference being their rosters. The game has 27 NBA teams with a roster of 324 Players. Each player has a rating for his shooting ability, stamina, jumping power, running speed, stealing ability, and blocking ability. The game allows for pre-season and season modes. In the season modes the game tracks team &amp; player statistics throughout the season.</p><p>You can choose between four modes of play: Manual, which enables you to control an individual team; Coach, which turns the play calling (but not the actual playing) over to you; Computer, which gives all the controls to the computer; and Skip, where the results of a computer-played game are posted, without the game ever having taken place. The game also allows you to set the quarter's time from two minutes to 12 minutes.</p>"},{"name":"Tecmo Super Bowl","year":1991,"developer":"Tecmo, Ltd.","url":"3#Tecmo_Super_Bowl/Tecmo_super_bowl.nes","filesize":393232,"score":8.2,"genres":"Sports > Side view > Top-down > Football (American) > Licensed","desc":"<p>Tecmo Super Bowl is the follow-up to the NES football arcade/simulation Tecmo Bowl.  While the basic gameplay of the original is intact, a host of new features and improvements have been added.  </p><p>Features include: 28 real NFL teams/mascots with real NFL players (circa 1991), 11 players on the field per team, player substitutions, fumbles, improved control over kicks and punts, eight plays to choose from during games, customizable playbooks, arcade/coach/computer simulation options for one or two players, pre-season/regular season/Pro-Bowl games, regular season team standings and rankings, regular season player statistics and rankings, end-of-game boxscores, and a 12-team playoff following the NFL format.</p>"},{"name":"Tecmo World Cup Soccer","year":1990,"developer":"Tecmo, Ltd.","url":"3#World_Cup/World_cup_soccer.nes","filesize":262160,"score":"","genres":"Sports > Top-down > Football (European) / Soccer","desc":"<p><em>Tecmo World Cup Soccer</em> is a NES conversion of the arcade original Tehkan World Cup.<br> At it's base it is a simple soccer game with an overhead view. Only one mode (World Cup) is available, playable by either one player against the computer AI or two players against each other. Any of the sixteen available national teams can be selected by the player; the opponent cannot be chosen manually if controlled by the AI. The game itself allows only basic moves such as passing, shooting, and side-sliding during defense. There is no team management or strategy available, and no options for game rules and conditions.</p>"},{"name":"Tecmo World Wrestling","year":1989,"developer":"Tecmo, Ltd.","url":"2#Tecmo%20World%20Wrestling%20%28Europe%29.zip","filesize":1,"score":7.4,"genres":"Sports > Wrestling","desc":"<p>In Tecmo World Wrestling, you select from 10 fictional wrestlers and compete against the others for the coveted Tecmo World Wrestling Title. When your match begins you'll find you've got all the moves of the pros. You can run, climb to the top ropes, climb outside the ring, pick up your opponent, throw them over the ropes, pin them, and escape from a pin yourself. The wrestlers, such as \"The British Star\" Rex Beat and \"The Technician\" Dr. Guildo have a full assortment of professional wrestling moves and holds such as the Pile Driver, Shoulder Throw, Cobra Twist, as well as the ever-popular Slam the Guys Face Into the Metal Post maneuver. </p><p>Before selected matches you'll be able to beef up you're wrestler's strength with three different exercises. The bottom portion of the screen is where the energetic announcer describes what is going on in the ring, move by move.</p>"},{"name":"Teenage Mutant Ninja Turtles","year":1989,"developer":"Konami Industry Co. Ltd.","url":"1#Teenage%20Mutant%20Ninja%20Turtles%20%28USA%29.nes","filesize":262160,"score":6.6,"genres":"Action > Diagonal-down > Side view > 2D scrolling > Platform > Licensed","desc":"<p>With April O'Neil held hostage by The Shredder's thugs, Bebop and Rocksteady, once again, it's up to the Teenage Mutant Ninja Turtles to come to her rescue! Play as all four of the turtle heroes, rescue April, and then rescue your sensei Splinter from Mecha-Turtles clutches, and then go after The Shredder deep in the bowels of The Technodrome itself.</p><p><em>Teenage Mutant Ninja Turtles</em> is an action game based on the late eighties/early nineties cartoon series of the same name. Play as Leonardo, Michaelangelo, Donatello and Raphael (one turtle only, but the ability to swap between turtles at any time) as you save your friends and battle The Shredder and his cronies. There are no 'lives', as such - when you lose a turtle, he becomes 'captured', and you cannot use him again until you rescue him from a place hidden in the overworld.</p><p>Gameplay takes place in two perspectives: a top-down view, which lets you run around and explore buildings, sewers and other places. When entering places from the top-down view, the perspective shifts to a side-scrolling view, where most of the battling takes place. In addition to each turtle's main weapon, sub-weapons (such as shuriken) can be acquired, to use at foes - these have a limited use.</p>"},{"name":"Teenage Mutant Ninja Turtles III: The Manhattan Project","year":1991,"developer":"Konami Co., Ltd.","url":"1#Teenage%20Mutant%20Ninja%20Turtles%20III%20-%20The%20Manhattan%20Project%20%28USA%29.nes","filesize":524304,"score":8,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p><em>The Manhattan Project</em> is a sequel to Mutant Ninja Turtles II. The third game in the series is very similar to the second one, being a Double Dragon-style brawler. The player selects one of the turtle protagonists who must then fight his way through the stages, taking out as many Foot Soldiers as possible, confronting and defeating the bosses, and finally facing Shredder. As opposed to the previous game, the turtle protagonists have each their unique powers.</p>"},{"name":"Teenage Mutant Ninja Turtles: The Arcade Game","year":1990,"developer":"Konami Co., Ltd.","url":"1#Teenage%20Mutant%20Ninja%20Turtles%20II%20-%20The%20Arcade%20Game%20%28USA%29.nes","filesize":524304,"score":7.3,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Fighting > Martial arts > Licensed","desc":"<p>April O'Neil, the reporter friend of the Teenage Mutant Ninja Turtles, is kidnapped by the villainous Shredder and his two goons, Bebop and Rocksteady. The four ninja turtles: Raphael, Michelangelo, Donatello and Leonardo fight their way through hordes of Foot Soldiers in order to rescue April. They battle familiar foes such as the mad scientist Baxter Stockman, General Traag from Dimension X and the evil alien brain Krang, up to the final showdown with Shredder himself.</p><p><em>Teenage Mutant Ninja Turtles</em> is an arcade game made by Konami during the height of the cartoon series' popularity. Depending on the version of the game, up to two, three or four players can take part in the action. The game plays like a simplified Double Dragon. While most of the standard Foot Soldier enemies are easily dispatched, some attack with knives or ray guns and are thus more dangerous. At the end of each level, players encounter a boss (or in certain cases two bosses working in tandem, such as Bebop and Rocksteady).</p><p>The NES version of the game, renamed <em>Teenage Mutant Ninja Turtles II: The Arcade Game</em> in the West, features additional content not present in other versions of the game: two new levels (Snowy Central Park and The Dojo), new bosses (including Tora, Shogun and Baxter Stockman as a fly), additional music tracks as well as more variations of Foot Soldiers.</p>"},{"name":"Teenage Mutant Ninja Turtles: Tournament Fighters","year":1993,"developer":"Konami Co., Ltd.","url":"1#Teenage%20Mutant%20Ninja%20Turtles%20-%20Tournament%20Fighters%20%28USA%29.nes","filesize":262160,"score":6.8,"genres":"Action > Side view > Arcade > Fighting > Martial arts","desc":"<p><em>Teenage Mutant Ninja Turtles: Tournament Fighters</em> is very much in the tradition of the Street Fighter and Mortal Kombat series, pitting you against opponents one at a time. Also included (besides the turtles) are three other familiar fighters: Shredder, Casey Jones and Hothead.</p><p>The turtles did lose their trademark weapons and are restricted to unique melee attacks and kicks. Each character additionally has a set of special moves which can be performed with certain button combinations. Also each fighter can perform a fireball move, but has to collect a power up first which drops in the area from time to time.</p><p>The game includes a story mode, where you can only select one of the turtles in a quest to face-off with the Shredder, a vs. mode (two fighters, the second either controlled by AI or a second player) and a tournament mode with four fighters.</p>"},{"name":"Tenchi o kurau II: Shokatsu Kōmei-den","year":1991,"developer":"Capcom Co., Ltd."},{"name":"Tenka no Goikenban: Mito Kōmon","year":1987,"developer":"Tose Co., Ltd."},{"name":"Tenkaichi Bushi: Keru Naguuru","year":1989,"developer":"GAME STUDIO Inc.","url":"2#Tenkaichi%20Bushi%20-%20Keru%20Naguuru%20%28Japan%29.zip","filesize":1,"score":"","genres":"Action > Side view > Arcade > Fighting > Martial arts","desc":"<p><em>Tenkaichi Bushi: Keru Naguuru</em> is a one-on-one martial arts fighting game set in ancient China.</p><p>Using 2D side-scrolling graphics with a distinct cartoony design, the player takes control of a single fighter as he attempts to defeat his opponent in single-round fights. Combat is controlled with a single attack button which can unleash all sorts of moves when pressed in conjunction with the directional arrows. These moves vary among each fighter, as players can choose from 15 different fighters, each with their own stats and moves, and then compete against the others to see who gets the honor of becoming grandmaster.</p><p>Additionally the game includes a story mode in which players can take control of a single martial artist and roam the countryside looking for challengers (the later done from a top-down map view). Starting abilities and health are minimal, but successfully defeating opponents will increase the player's health and allow the fighter to learn new moves and turn into the ultimate combatant.</p>"},{"name":"Tennis","year":1984,"developer":"Nintendo Co., Ltd.","url":"3#Tennis/tennis.nes","filesize":24592,"score":6.7,"genres":"Sports > Diagonal-down > Fixed / flip-screen > Tennis","desc":"<p><em>Tennis</em> is, as the name implies, Nintendo's version of the sport. One player vs computer or two players will compete in tennis in a more or less standard suite of rules (scoring, sets etc.).</p><p>Players are controlled by the movement buttons, but while button A indicates a low hit, button B indicates a high one. You have the choice of four levels of computer AI, or two player via Game Boy link cable. The usual assortment of shots are available, including forehand and backhand, lobs and volleys when up close to the net.</p>"},{"name":"Terminator 2: Judgment Day","year":1992,"developer":"Software Creations Ltd.","url":"1#Terminator%202%20-%20Judgment%20Day%20%28USA%29.nes","filesize":262160,"score":5.3,"genres":"Action > Racing / Driving > Side view > Arcade > Fighting > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Terminator 2: Judgment Day</em> is based on the movie of the same name. The player takes the role of the T-800 Terminator and has to protect John Connor from being terminated by the T-1000 Terminator. </p><p>The game is set over five levels with the following goals:</p><ul><li>Level 1: Acquire a weapon.</li><li>Level 2: An isometric racing course on a motorcycle in which the player needs to out-run a tanker truck that is chasing them. This stage was omitted from both the Game Gear and Master System versions.</li><li>Level 3: Locate and rescue Sarah Connor from the Pescadero asylum.</li><li>Level 4: Plant explosive charges to destroy the Cyberdyne building.</li><li>Level 5: Defeat the T-1000 within the steel mill.</li></ul>"},{"name":"Terminator, The","year":1992,"developer":"Radical Entertainment Inc.","url":"1#Terminator%2C%20The%20%28USA%2C%20Europe%29.nes","filesize":262160,"score":5.4,"genres":"Action > Racing / Driving > Side view > 2D scrolling > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>The Terminator loosely follows the plot of the 1984 Arnold Schwarzenegger film. The game begins in the future, where the hero Kyle Reese must battle through a post-apocalyptic future in order to go back in time to 1984 Los Angeles. Once there, he must progress through various checkpoints as outlined by the main movie plot: Find Sarah Connor, shootout at the police station, and the climax in the factory. The main levels of the game consist of side-scrolling jumping and shooting action. In between levels are car chases where the Terminator attempts to run you down as you race to your next destination.</p>"},{"name":"Terra Cresta","year":1986,"developer":"Nihon Bussan Co., Ltd.","url":"1#Terra%20Cresta%20%28USA%29.nes","filesize":131088,"score":6.5,"genres":"Action > Top-down > Arcade > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>In the follow-up to Moon Cresta, a well-guarded planet is being invaded. You will have to make a succession of passes over the landscape, shooting out ground turrets and aliens. Numbered bases release power-ups when shot - these can either be used in combination or (by pressing the space bar) in Formation Mode, covering a wider range of shooting positions. Each pass over the planet ends with a boss; the third and final one with a boss who can only be killed if you are at maximum power. Death puts you back to the start of the world.</p>"},{"name":"Tetrastar: The Fighter","year":1991,"developer":"Home Data Corp."},{"name":"Tetris","year":1989,"developer":"Atari Games Corporation","url":"1#Tetris%20%28USA%29.nes","filesize":49168,"score":8.3,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p>One of many conversions of the famous block-stacking game available for Nintendo's home console, this one is based on the 1988 coin-op version produced by Atari Games. The goal is to place pieces made up of four tiles in a ten-by-twenty well, organizing them into complete rows, which then disappear. As rows are cleared, the pace of the game increases, and the game ends if the stack reaches the top of the well.</p><p>The game features a standard endless mode, as well as a two-player competitive mode where players race to complete each level. There is also a \"cooperative\" mode where both players play within the same well, working together to complete lines. Both the competitive mode and the cooperative mode can also be played with the computer.</p><p>The game offers standard starting-level and garbage options, several different background music themes, and cute little Russian dancers to congratulate you between levels.</p>"},{"name":"Tetris 2","year":1993,"developer":"Nintendo R&D1","url":"1#Tetris%202%20%28USA%29.nes","filesize":262160,"score":7.2,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p>Unlike the original <em>Tetris</em>, <em>Tetris 2</em> has you clearing the field of blocks in a different way. Each play field starts with different colored dots (in this case black, gray and white), with one of each color flashing. The blocks are made up of the same three colors, and by matching blocks of the same color over the top or to the side of the dot will clear the dot and those blocks from the screen. If you clear a flashing dot, all the corresponding dots of the same color will be cleared. To complete the round just clear the dots, not the blocks themselves.</p>"},{"name":"Tetris 2 + BomBliss","year":1991,"developer":"Chunsoft Co., Ltd."},{"name":"Tetsudō-ō","year":1987,"developer":"dB-SOFT"},{"name":"Tetsuwan Atom","year":1988,"developer":"Home Data Corp."},{"name":"Thexder","year":1985,"developer":"Game Arts Co., Ltd."},{"name":"Three Stooges, The","year":1989,"developer":"Incredible Technologies, Inc.","url":"3#The_Three_Stooges/three_stooges.nes","filesize":262160,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Stars of television and cinema, and now stars of their own video game. Join Moe, Larry &amp; Curly (in no particular order) who must collect $5000 to try and save an orphanage and the young children who live there from the evil banker, all while keeping pie out of their face. Featuring platform level designs based on classic Stooge scenes from their many TV episodes and movies and level objectives re-living many of their antics plus original Stooge voices and Stooge trivia.</p>"},{"name":"Thunder & Lightning","year":1990,"developer":"Visco Corporation","url":"2#Thunder%20%26%20Lightning%20%28USA%29.zip","filesize":1,"score":"","genres":"Action > Top-down > Paddle / Pong","desc":"<p>A <em>Breakout</em> type game with characters such as Mr. Chin and the Thunder Warrior. Mr. Chin holds a stick over his head that acts as the paddle. If your ball hits one of the power-up carriers (flying saucer, submarine, or airplane) you have to try and pick up the released power-up while continuing to keep the ball in play.</p><p>Power-ups are:* Glove: Catch the ball and then release with the A button.</p><ul><li>Long: Mr. Chin's stick will become longer.</li><li>1-Up: Get an extra life for Mr. Chin.</li><li>Missile: Gain fire power, press the A button to launch a missile, catch a second missile to fire two missiles simultaneously.</li><li>Big Ball: The ball enlarges and blows through any type of block in its path.</li><li>Slow: This will slow the speed of the ball.</li><li>3 Balls: The ball will split into three balls and as long as you keep one ball from falling you will always have three balls.</li><li>6 Balls: The ball will split into six balls.</li></ul><p>Hostile characters will occasionally appear and try to mess with Mr. Chin.* Sea Anemone: If he captures your ball it will split into two smaller balls.</p><ul><li>Octopus: He lives underwater inside an ancient vase, if the vase is hit by the ball the octopus will come out and try and latch onto Mr. Chin's stick. If he succeeds he will weigh you down causing you to move slower.</li><li>Turtle: They will walk over the wall and transform themselves into new blocks to hinder your progress.</li><li>Bird: If hit with your ball it will fly out of control smashing through the walls before flying away.</li><li>Thunder Warrior: If you hit the Thunder Warrior with your ball he will release a circle of lightning bolts that will fly around him. The lightning bolts will destroy the walls but they will momentarily paralyze Mr. Chin if he is hit.</li></ul>"},{"name":"Thunderbirds","year":1989,"developer":"Pack-In-Video Co., Ltd","url":"1#Thunderbirds%20%28USA%29.nes","filesize":262160,"score":"","genres":"Action > Top-down > 2D scrolling > Shooter > Direct control > Sci-fi / futuristic > Licensed","desc":"<p>An evil alien named Hood wants the Thunderbirds to turn over all their vehicles to him within a 60 day time period or Hood will bombard the Earth with meteors. The Thunderbirds figure he needs the 60 days to prepare to come through with his threat so they decide to go looking for places which may contain his energy sources for his power.</p><p>The game takes place over North America, the Indian Ocean, and Asia as you fly through doing different missions in each location.  As a Thunderbird, you'll  fly 5 different futuristic aircraft such as a Mach 20 Thunderbird 1 Rocket, the Neptune Hydro-Turbojet, and the Fire Flash Atomic plane. Each vehicle can only take 3 hits before being grounded. If your vehicle is grounded, it will take 3 days to be repaired. These 3 days will be subtracted from your overall 60 days you have to beat the entire game. </p><p>Your enemies consists of such exotic fare as poisonous space scorpions, mutant sea worms and even environmental adversaries such as fire spitting volcanoes. By defeating certain enemies, you aircraft can gain powerups such as replenishing delpleted heath, increased firepower, or adding orbital ships to fly by the side of your main ship to assist you in combat.</p>"},{"name":"Thunderbolt 2","year":1993,"developer":"Gamtec Corp."},{"name":"Thundercade","year":1989,"developer":"SETA Corporation","url":"1#Thundercade%20%28USA%29.nes","filesize":131088,"score":"","genres":"Action > Racing / Driving > Top-down > Arcade > Shooter > Direct control","desc":"<p>Terrorism has reached new heights. AATOM (Atomic Age Terrorist Organization of Miracali) has constructed their own nuclear power plant, and threaten the world with atomic terror. The world powers have decided to initiate operation THUNDERCADE to stop AATOM. Equipped with a high-performance combat motorcycle, sidecar cannons, and backed by a precision B-7 bomber, you set out on the dangerous mission.</p><p>The player controls a motorcycle traveling through four distinct areas; the city, the base, the woodlands and the fortress which contains the final objective which is the nuclear power plant. The motorcycle shoots bullets and can be upgraded by finding powerups which add sidecars to the motorbike, which in turn adds more firepower. Also, you can call in a limited amount of airstrikes  to help you clear the screen of enemy tanks and troops.</p>"},{"name":"Tiger-Heli","year":1986,"developer":"Toaplan Co., Ltd.","url":"1#Tiger-Heli%20%28USA%29.nes","filesize":65552,"score":5.9,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Helicopter","desc":"<p>Tiger Heli is the name of your helicopter, according to the box the result of a billion-dollar defense project and forged from ebony metal and glistening chrome. Your goal is to defeat the country of Cantun, which is run by terrorists and has become completely power hungry with an aim to take over the whole world.</p><p>You're shooting tanks, ships, aircraft carriers and trains while flying towards the impenetrable military base. You shoot crates to get pickups. If you shoot the crate when it is green you get a bomb pickup, if you shoot it when it is red you get a mini helicopter that attaches to one of your sides shooting sideways, and if you shoot it when it is white you get a mini helicopter shooting forward. If you shoot 10 crates with a yellow diamond shape you get an extra life.</p>"},{"name":"Tiles of Fate","year":1990,"developer":"Computer & Entertainment Inc."},{"name":"Time Lord","year":1990,"developer":"Rare Limited","url":"1#Time%20Lord%20%28Europe%29.nes","filesize":131088,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p>In this game you play the role of a time lord who has to travel through time in order to stop time travelling aliens from changing the earths history. The Game play involves you fighting off aliens who are dressed like the people from the various time period that you are in. The weapons at your disposal vary depending on what point in time you are in. In order to travel to another time zone you must find 5 orbs which are carefully hidden around each level and require some puzzle solving and platform jumping to get to. Time in this game runs by very fast and you inly have until the year 3000 to complete the game otherwise the world will be blown up.</p>"},{"name":"Time Zone","year":1991,"developer":"EIM Ltd."},{"name":"Times of Lore","year":1990,"developer":"ORIGIN Systems, Inc.","url":"1#Times%20of%20Lore%20%28USA%29.nes","filesize":131088,"score":7.3,"genres":"Action > Top-down > 2D scrolling > Puzzle elements > RPG elements > Fantasy","desc":"<p>The Kingdom of Albereth was under attack of barbarian forces. King Valwyn drove the barbarians away, but was wounded in battles. Searching for a place where he could rest and restore his strength, he left the city - but never returned. Now, a new hero must rise and defend his homeland.</p><p><em>Times of Lore</em> is an action game with light role-playing elements, which follows the adventures of a young warrior (strong barbarian, armored knight, or quick valkyrie) to assist a weakened kingdom from various threats, and to recover special Artifacts that once made the kingdom strong.</p><p>Gameplay consists of moving the protagonist in real-time (day and night) through various terrains, like forests, towns, and dungeons. The player character gathers basic items, like health and magic potions, and increasingly powerful weapons as he completes tasks and advances the plot. Conversations are handled through key phrases. Battles involve a few types of creatures (skeletons, orcs, rogues) of which there can be various flavors.</p>"},{"name":"Tiny Toon Adventures","year":1991,"developer":"Konami Co., Ltd.","url":"1#Tiny%20Toon%20Adventures%20%28USA%29.nes","filesize":262160,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Tiny Toon Adventures</em> is based on an animated series of the same name. The Tiny Toons are kid versions of the famous Warner Bros. cartoon characters.</p><p>After (once again) losing an animation festival at Acme Looniversity to Buster Bunny, Montana Max has taken his revenge by kidnapping Babs Bunny and locking her up in his mansion. Now, a single player controlling Buster or any one of his three friends Plucky Duck, Dizzy Devil, and Furball must embark on a rescue mission to save her. There are six side-scrolling platform levels, comprised of three stages each (except for Wackyland which has only one stage). Before each level begins, Shirley the Loon will ask the player which of Buster's three partners should join them on that level. Once the player makes a selection, it cannot be changed. Each of the four available characters have different abilities, so it's important to choose the right partner.</p><p>Buster begins the game with three lives, but more can be collected by visiting Hamton J. Pig and cashing out 30 carrots each. The game is over when all remaining lives are gone or when Montana Max has been defeated.</p>"},{"name":"Tiny Toon Adventures 2: Trouble in Wackyland","year":1992,"developer":"Konami Corporation","url":"1#Tiny%20Toon%20Adventures%202%20-%20Trouble%20in%20Wackyland%20%28USA%29.nes","filesize":262160,"score":7.2,"genres":"Action > Side view > Arcade > Platform","desc":"<p>Buster Bunny receives an invitation to a newly opened amusement park. He gladly accepts, unaware of the fact this invitation is a trap. Now he and his friends have to overcome all the obstacles and to survive in the Wackyland...</p><p>\"Trouble in Wackyland\" consists of several mini-games which you can complete in no particular order. You have to reach the engine of a train in a standard side-scrolling platformer, keep your balance on a wooden plank while diving down dangerous waterfalls, compete in toy car tournament, etc. Once you gain enough tickets, you can access the Castle, that is standing behind the Amusement Park.</p>"},{"name":"Tiny Toon Adventures: Cartoon Workshop","year":1992,"developer":"Novotrade Software Kft.","url":"1#Tiny%20Toon%20Adventures%20Cartoon%20Workshop%20%28USA%29.nes","filesize":262160,"score":6.2,"genres":"Simulation > Menu structures > Licensed","desc":"<p>In <em>Tiny Toon Adventures: Cartoon Workshop</em> player's take on the role of the director and can create their own Tiny Toon Adventure. The player can choose from Buster, Babs, Plucky, Furrball, Calamity, and Little Beeper to play in a scene, but can never place more than two characters in a single scene. There's various poses, animations and backgrounds the player can add to liven up the scenes. The player can add sound effects, music and captions to further detail the story. Final stories can only be saved by hooking the NES to a VCR.</p>"},{"name":"Titan","year":1990,"developer":"Titus France SA"},{"name":"To the Earth","year":1989,"developer":"Cirque Verte","url":"2#To%20the%20Earth%20%28Europe%29.zip","filesize":1,"score":5.7,"genres":"Action > 1st-person > Arcade > Rail shooter > Sci-fi / futuristic","desc":"<p>In the year 2050 the Earth has been attacked by the villainous Raggosians and it is your job to save the planet! You will need to pilot your ship, The Tempest, to the planets Uranus, Saturn, Jupiter, and Earth in order to retrieve certain minerals which can be used to fight the Raggosians. The Raggosians will be trying to stop you from reaching these destinations, though, so you need to use the Nintendo zapper to fight back. Numerous (and very fast!) enemy ships will fly by on the screen and attempt to destroy your ship. You need to shoot the ships and incoming missiles before your ship takes too much damage. From time to time a comet will fly by, and if you shoot this a temporary barrier will be formed that protects your ship from enemy fire. Occasionally you can also earn a smart bomb which appears in the bottom of the screen and destroys all enemies if shot. Each level ends with a large boss which will take multiple hits to destroy.</p>"},{"name":"Toki","year":1991,"developer":"Tad Corporation","url":"1#Toki%20%28USA%29.nes","filesize":393232,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>The hands of Bashtar have whisked Moho away from her beloved Toki. Toki hasn't fared much better as he has been transformed into an ape by the sorcerer Vookimedlo. Now Toki must rescue his love and find a way to transform himself back into a man.</p><p><em>Toki</em> consists of six stages which are The Labyrinth of Caves, the underwater stage Lake Neptune, Caverns of Fire, Ice Palace, Dark Jungle, and the Golden Palace. Toki's main attack against his enemies is by spitting at them although he can also hop on them to defeat them. Toki's normal spit can be changed to a fire breath by finding the correct item. Other items include items like a football helmet which temporarily shields Toki, high jump shoes, clocks that add time, coins which add to Toki's life count, and fruits which add to the total score.</p><p>Instead of dying in one hit, the NES version added a health meter. A version of the game also exists for the Genesis, however the game features different stage layouts plus additional levels and different enemies.</p>"},{"name":"Toki no Tabibito: Time Stranger","year":1986,"developer":"Kotobuki System Co., Ltd.","url":"2#Toki%20no%20Tabibito%20%28Japan%29.zip","filesize":1,"score":"","genres":"Adventure > Visual novel > Sci-fi / futuristic > Licensed","desc":"<p>Toshito Kutajima is a Time Patrol Officer. He uses his COI (ConstableOfficial Intercepter), a time traveling space vehicle, to travel to the past in order to track down fugitives.</p><p>The game involves traveling through time (between the sixteenth century to 1941) and talking to various Japanese historical figures. Players are asked various questions and can answer the questions either yes or no. The way the player answers these questions will lead the player to one of the multiple endings the game offers.</p>"},{"name":"Tokoro-san no Mamoru mo Semeru mo","year":1987,"developer":"ISCO, Inc."},{"name":"Tom & Jerry","year":1991,"developer":"Albino Frog Software, Inc.","url":"1#Tom%20%26%20Jerry%20%28Japan%29.nes","filesize":262160,"score":6.7,"genres":"Action > Side view > 2D scrolling > Arcade > Licensed","desc":"<p>This game plays very similar to Chip &amp; Dale's Rescue Rangers.</p><p>Tom has mouse-napped Jerry's nephew Tuffy and locked him in a trunk in the attic. You and your furry little buddy Jerry must dash, jump, and climb from the basement up through every level of the house to rescue him in time.</p><p>Jerry's main defense is his unlimited supply of marbles. Pick up other items such as bubble gum, meat cleaver, cups of water, moth balls, hammer, invisible ink and drill to overcome the enemies and obstacles in your way. Make sure you outwit Tom whenever he appears.</p><p>Look for cheese power-ups and mouse hole bonus stages along the way.</p>"},{"name":"Tombs & Treasure","year":1988,"developer":"Nihon Falcom Corp.","url":"3#Tombs_and_Treasure/Tombs_and_treasure.nes","filesize":262160,"score":6.2,"genres":"Adventure > Role-playing (RPG) > 1st-person > Puzzle elements > Detective / mystery","desc":"<p><em>Tombs &amp; Treasure</em> is an enhanced version of the earlier computer release of Taiyō no Shinden: Asteka II. </p><p>The story in this version is more detailed than in the original release. Professor Imes was a famous archaeologist particularly interested in the old Mayan civilization. Having heard of a powerful artifact known as the Sun Key, which is apparently able to unlock the secrets of the Maya, professor assembled a team and traveled to the ruins of Chichen Itza. However, he and his team have mysterious disappeared; only his guide Jose was able to escape, delivering the news to the professor's daughter. </p><p>Unlike in the original release, the player character travels to the Yucatan with the daughter of Professor Imes and the guide Jose. Both have special abilities which are sometimes needed to solve puzzles: the young woman is musically talented, and Jose is able to move heavy objects. Due to these changes, some of the locations and puzzles have been altered in this version.</p><p>Another significant gameplay change is the introduction of role-playing elements. Solving puzzles and defeating demons in turn-based combat grants the protagonist experience points. Even though combat is very sparse in the game, taking on stronger foes can be futile if the player hasn't gathered enough experience by completing other tasks beforehand.</p>"},{"name":"Toobin'","year":1989,"developer":"Atari Games Corporation","url":"2#Toobin%27%20%28USA%29%20%28Unl%29.zip","filesize":1,"score":7.4,"genres":"Action > Top-down > Arcade","desc":"<p>Toobin' involves Biff and Jet racing their way down the rapids of a river, riding on tires. You rotate your tyre left or right, and drift as the current sends you, making sure to avoid the banks of the river, and the dividing lines in the middle. Hazards include crocodiles, stray logs and branches, and fishermen - you are armed with a limited supply of tin cans to take care of these. There are gates to slide through on the way down - these give you a points bonus. Each level has a strict time limit to adhere to, although there's a kickin' party at the end if you succeed.</p>"},{"name":"Top Gun","year":1987,"developer":"Konami Industry Co. Ltd.","url":"1#Top%20Gun%20%28USA%29.nes","filesize":131088,"score":5.9,"genres":"Action > 1st-person > Arcade > Flight / aviation > Licensed","desc":"<p><em>Top Gun</em> is loosely based on the film of the same name. It is an action game in which the player controls an F-14 Tomcat fighter through four different missions.</p><p>The action is seen from a first-person cockpit view. Depending on the mission, different kinds of targets must be destroyed. There are always enemy aircraft, but some missions include sea and ground targets as well. Two weapons are available: machine guns (with unlimited ammunition) and missiles. The player can choose from three types of missiles before a mission: the more powerful ones can only be carried in lower quantities.</p><p>Enemy aircraft either overshoot the players's plane from behind and can be easily taken down, or they come from the front and fire guns and missiles. Sometimes, an enemy plane will position itself on the player's six. It should be lost quickly by steering left and right, or instant death follows.</p><p>Halfway through missions two through four comes a refueling sequence where the fuel plane's nozzle must be aligned with one's aircraft.</p><p>Every mission (except the first one) features a final mission target, which can take a lot more damage than regular targets.</p><p>Each mission concludes with a landing attempt on the aircraft carrier. To successfully land, the player's plane must have a certain altitude and speed. Successfully landing gives bonus points, but crashing the plane doesn't end the game - it simply costs a life.</p>"},{"name":"Top Gun: The Second Mission","year":1989,"developer":"Konami Industry Co. Ltd.","url":"1#Top%20Gun%20-%20The%20Second%20Mission%20%28USA%29.nes","filesize":262160,"score":5.8,"genres":"Action > Simulation > 1st-person > Flight / aviation > Licensed","desc":"<p>Just like in the first game, you fly an F-14 Tomcat in combat against the enemy equipped with Soviet equipment, although there is no direct reference to the Soviet Union anywhere. The only plot of this game is to destroy everything you see, excluding the aircraft carrier to which you must land at the end of each level.</p><p>In addition to the basic game mode with anti-ship, ground attack and space battle levels, similar to the first game, the second mission adds two extra modes. In the first extra mode you can fight against top enemy aces flying a MiG-25 Foxbat, one at a time. The second extra mode is two-player game with split screen, in which you can fight against your friend, both flying Tomcats.</p><p>You will have to fight against interesting level bosses such as a giant Tu-160 Blackjack bomber, a Mi-24 Hind attack chopper and an armed space shuttle.</p><p>Another interesting detail about the game is that between fighting the aircraft and surface opponents you have to dodge between giant trees (yes, you read correctly!!), lightnings and laser attacks.</p>"},{"name":"Top Management","year":1990,"developer":"KOEI Co., Ltd."},{"name":"Top Players' Tennis","year":1989,"developer":"Home Data Corp."},{"name":"Top-Rider","year":1988,"developer":"Sonata"},{"name":"Topple Zip","year":1987,"developer":"MiCROViSion Inc."},{"name":"Total Recall","year":1990,"developer":"Interplay Productions, Inc.","url":"2#Total%20Recall%20%28USA%29.zip","filesize":1,"score":4,"genres":"Action > Racing / Driving > Side view > Top-down > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p>Based on the 1990 Schwarzenegger film of the same name, <em>Total Recall</em> for the NES generally adheres to the movie's plot across its nine levels. Unlike the various PC iterations, this title was created by Interplay and published by Acclaim.</p><p>Players control Doug Quaid as he platform hops across Earth and Mars in search of his stolen memories and the responsible parties. A collection of police, soldiers, and creatures will try to stop him. Quaid's default attack is a strong punch, though guns can be knocked away from some guards and picked up for use. Cutscenes between certain levels tell the movie's plot, and feature likenesses of the actors from the film (including Arnold).</p><p>Sequences in the film are also replicated more tightly than in the PC versions. Quaid will be chased by henchman Richter in the first level, and must battle his wife inside their apartment. The security x-ray scanner takes up a level, as does the subway battle after. The player will also commandeer a Martian taxi for a driving level inside the colony, and windows can be shot out on Mars, sucking out any unfortunate baddies nearby.</p>"},{"name":"Totally Rad","year":1990,"developer":"Aicom Corporation","url":"2#Totally%20Rad%20%28Europe%29.zip","filesize":1,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic","desc":"<p><em>Totally Rad</em> is an action game in which you play Jake, a magician wannabe being trained by the Master Magician Zebediah. One day, during his training, Jake is attacked by surprise by unknown foes who kidnap Allison, his girlfriend. Then, Jake has to save her and discover what lies behind that attack.</p><p>This game is a side-scrolling one, with the basic controls common to many of those games that fall in the same category: moving, jumping and shooting. Your basic weapon is something like an energy ball that can be charged by holding the button for a few seconds until its maximum power. Although Jake is supposed to still be learning his magic from Zebediah, from the very beginning you can use all his magical powers. You can select which magic you want to use from a list, displayed when you press the start button. </p><p>The magical powers available include healing, time stopping, invincibility, the power of the elements (fire, watter, wind and earth) and 3 different metamorphosis. You can morph into a flying guy who throws something like a boomerang (that doesn't come back), a fish-like guy, who throws something like ninja stars and can swim, and a feline-like guy, who releases electrical shocks from his hands and becomes invincible while jumping. You do not evolve during the game, as your health and magic bar doesn't grow.</p><p><em>Totally Rad</em>, as the name points out, is a game full of slang, with the constant use of words like <em>totally, gnarly, dude, excellent, decent, righteous,</em> etc.</p>"},{"name":"Touchdown Fever","year":1988,"developer":"SNK Corporation","url":"2#Touch%20Down%20Fever%20%28USA%29.zip","filesize":1,"score":"","genres":"Sports > Top-down > Arcade > Football (American)","desc":"<p>Touchdown Fever is an arcade football game from SNK.  Go head-to-head against the computer or a human opponent, or team up with another human player vs. the computer.  Choose five, ten, or fifteen minute quarters for either league match (single game) or tournament play.</p><p>There are 12 teams from NFL cities to play with (six East, six West), although there is no NFL license and no real NFL players.  Offensive plays can be run from five basic formations: long pass, short pass, quarterback sneak, running backs, and field goal kick/punt.  There are no formations or plays on defense, but there are two possible players (A or B button) to take control of before the snap.  The player perspective is top-down and vertical-scrolling.  Standard football scoring rules: most points after four quarters wins!</p>"},{"name":"Tower of Druaga, The","year":1985,"developer":"Namco Limited"},{"name":"Tower Toppler","year":1991,"developer":""},{"name":"Town & Country Surf Designs II: Thrilla's Surfari","year":1992,"developer":"Sculptured Software, Inc.","url":"1#Town%20%26%20Country%20Surf%20Designs%20-%20Thrilla%27s%20Surfari%20%28USA%29.nes","filesize":262160,"score":6.8,"genres":"Action > Sports > Side view > 2D scrolling > Direct control > Skateboarding > Surfing > Licensed","desc":"<p>In order to restore his immortal powers, Wazula, an evil Kahuna, is ordered to travel to Hawaii to kidnap Barbi Bikini. Barbi Bikini happens to be Thrilla Gorilla's girlfriend so now he's off to Africa so he can rescue her.</p><p>The game features 7 worlds each containing 5 stages (except for the 1st and 3rd world where each contain only 4 stages). Most of the game involves controlling Thrilla on a skateboard, dodging or jumping over various obstacles and enemies while attempting to get to the end of the stage. There will also be times when Thrilla will get to be on a surfboard, but gameplay remains the same as it was on the skateboard. Thrilla also rides a shark underwater with the goal still being to get to the end of the stage while either dodging enemies or throwing spears at them. There are also boss battles where Thrilla throws either coconuts or spears trying to deplete all the health of his adversary. </p><p>There is also a shell game between stages which allows the player to obtain extra lives. The game also contains powerups throughout its levels such as a banana which restores health.</p>"},{"name":"Town & Country Surf Designs: Wood & Water Rage","year":1988,"developer":"Sanritsu Denki Co., Ltd.","url":"2#Town%20%26%20Country%20Surf%20Designs%20-%20Wood%20%26%20Water%20Rage%20%28USA%29.zip","filesize":1,"score":5.7,"genres":"Sports > Side view > 2D scrolling > Arcade > Tricks / stunts > Skateboarding > Surfing","desc":"<p><em>T&amp;C Surf Designs</em> features both skateboarding and surfing games. The skating section (called Street Skate Session) is a side scrolling action game where you need to navigate through an obstacle course within the given time limit. Ideally you want to earn as many points as possible by performing tricks, jumping over items, and collecting bonuses. If you crash too many times (or fall into a hole, run out of time, etc...) then the game will be over. In the surfing section (called Big Wave Encounter) you need to surf a giant wave all the way to the beach. As with skating, you can earn points by performing tricks and collecting bonuses; likewise the game ends if you crash too many times. You can choose to play either game individually, or alternate between the two (the Wood &amp; Water Rage option). You can select several T&amp;C Surf Designs characters to play as, including Thrilla Gorilla, Kool Kat, Joe Cool, and Tiki Man.</p>"},{"name":"Toxic Crusaders","year":1992,"developer":"Tose Co., Ltd.","url":"1#Toxic%20Crusaders%20%28USA%29.nes","filesize":262160,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Sci-fi / futuristic > Horror > Licensed","desc":"<p>Based on Troma's cartoon series of the same name,  the Toxic Crusaders protect the city of Tromaville against the plots of the alien Dr. Killemoff and his Radiation Rangers. That is, until Killemoff captures all of the Toxic Crusaders save one. As Toxie, you must \"mop up\" Killemoff's forces through 6 levels and rescue his comrades before it's too late.</p><p>The game is action-oriented. Toxie's only abilities are to jump and to punch his way through enemies. He initially starts with a mop weapon, which can be easily lost.</p>"},{"name":"Track & Field","year":1985,"developer":"Konami Industry Co. Ltd.","url":"3#Track_and_Field/Track_&_field.nes","filesize":41104,"score":6.9,"genres":"Sports > Side view > 2D scrolling > Direct control > Olympiad / mixed sports","desc":"<p><em>Track &amp; Field</em> is a sports game that allows the player to have an experience based around the Summer Olympic Games. Events include the 100 meter dash, the hammer throw, the javelin throw, the long jump, the high jump and the 110 meter hurdles.</p><p>The MSX version replaces the hurdles with a 400 meter dash.</p><p>The Famicom version loses the hammer throw and the high jump, but the NES version restores the high jump while adding skeet shooting, the triple jump and archery as events. The NES version also keeps the 110 meter hurdles and forgoes the 400 meter dash.</p><p>If the player wants to go to the next event or round then they will have to qualify, by beating increasingly difficult maximum times or minimum distances. This game contains a two player option, in which the players take it in turns.</p>"},{"name":"Track & Field II","year":1988,"developer":"Konami Industry Co. Ltd.","url":"3#Track_and_Field_II/Track_&_field2.nes","filesize":262288,"score":7.4,"genres":"Sports > Behind view > Side view > Top-down > 2D scrolling > Fixed / flip-screen > Olympiad / mixed sports","desc":"<p><em>Track &amp; Field II</em> is a game that allows the player to have an experience based around the Summer Olympic games. Playable events include fencing, the triple jump, swimming, diving, skeet shooting, pole vaulting, Tae Kwon Do, hammer throwing, canoing, archery, hurdles, and the horizontal bar.</p>"},{"name":"Transformers: Convoy no nazo","year":1986,"developer":"ISCO, Inc."},{"name":"Treasure Master","year":1991,"developer":"Software Creations Ltd.","url":"1#Treasure%20Master%20%28USA%29.nes","filesize":262160,"score":"","genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Treasure Master is a side-scrolling action game that sends your character on a quest of treasure acquisition. Jump your way through a variety of world environments including the islands, microprocessor-level circuitry, and the moon, and accumulate all of the material wealth you can possibly amass. You have a number of enemies to beware of (such as sharks, caterpillars, and springs). But you also have an impressive array of tools to help you in your quest (moon buggy!).</p><p>Treasure Master offers the opportunity to collect not only virtual treasure in a video game, but also treasure in the real world. After practicing the game, players had the opportunity to compete for real prizes.</p>"},{"name":"Trog","year":1990,"developer":"Bally Midway Mfg Co.","url":"1#Trog%21%20%28USA%29.nes","filesize":131088,"score":6.9,"genres":"Action > Top-down > Arcade","desc":"<p>Long ago, back in the days of cavemen and dinosaurs, there was a land called Og.  In this land, hungry one-eyed cavemen, called Trogs, loved the taste of eggs.  However, four Dino-Mites, Spike, Bloop, Rex and Gwen, were determined to rescue the eggs from certain doom!</p><p>Up to four (or just Spike and Bloop in the home conversions) can play in a race to gather up the Trog eggs as quickly as possible.  The first player to get all eggs of their colour wins the round.  Of course, Trogs also love the taste of Dino meat, and will use cavemen inventions such as fire and the wheel to catch them and gobble them up!  Luckily, the Dinos can fight back - eating a pineapple will turn them into a monstrous T-Rex that can chow down on Trogs, while a hot tamale lets them breathe fire.</p>"},{"name":"Trojan","year":1986,"developer":"Capcom Co., Ltd.","url":"1#Trojan%20%28USA%29.nes","filesize":131088,"score":6.8,"genres":"Action > Side view > 2D scrolling > Post-apocalyptic","desc":"<p>The world is ruled by a vicious warlord named Achilles and his henchmen. You are Ryu, the master of martial arts and sword-fighting, who has decided that a confrontation with Achilles is in order to bring peace and order back to the world. Your character is equipped with both a sword (for offense) and a shield (for defense). You will go through six stages starting at a ruined city, each with two boss characters (in the middle and at the end). Some enemies are so powerful that you will die the instant you fail to block. You also have to race against time as well, which makes the game that much more difficult.</p>"},{"name":"Trolls in Crazyland, The","year":1991,"developer":"KID Corp."},{"name":"Trolls on Treasure Island","year":1992,"developer":"American Video Entertainment Inc.","url":"2#Trolls%20on%20Treasure%20Island%20%28USA%29%20%28Unl%29.zip","filesize":1,"score":"","genres":"Action > Puzzle > Top-down > Fixed / flip-screen > Direct control > Fantasy > Licensed","desc":"<p>Samantha and Norbert, two teenage troll twins, were windsurfing one day and came upon an undiscovered and uncharted island. They recalled that once long ago their grandfather had told them of an island that contained lost treasures. So the twin trolls decide to explore the island to see if they can obtain these treasures.</p><p><em>Trolls on Treasure Island</em> involves the same type of gameplay found in Dudes with Attitude. In this puzzle game, the player controls one of the trolls as they bounce back and forth across the screen trying to acquire the jewels on the playfield. The one caveat is that the players troll has to match the color of the jewel he or she is trying to collect. To become the correct color to snatch up the jewels, the player has to bounce across a paint can that will change your trolls hair to that of the same color as the paint can. The object in each puzzle is to retrieve all the treasures in a room without their character falling prey to the various enemies in rooms or running out of time.</p><p>The game offers 32 levels to navigate through and the player is also able to create their own level with the custom level editor.</p><p>This is an unlicensed NES game.</p>"},{"name":"Trophy","year":2020,"developer":"Gradual Games"},{"name":"Tsuppari Ōzumō","year":1987,"developer":"Tecmo, Ltd."},{"name":"Twin Cobra","year":1989,"developer":"Toaplan Co., Ltd.","url":"2#Twin%20Cobra%20%28USA%29.zip","filesize":1,"score":7.4,"genres":"Action > Top-down > 2D scrolling > Shooter > Helicopter","desc":"<p><em>Twin Cobra</em> is a vertically scrolling shoot-em-up. You pilot the TC-17 Twin Cobra assault helicopter to fight the forces of Commander Anziga, the myopic leader of the nation of Kaban. Your job is to fly into Kaban and take out the entire military base of Commander Anziga.</p><p>You will fight small helicopters, tanks and stationary guns, defeat the large helicopters to get power-ups. By picking up colored icons (blue, yellow, red or green) you can change to different weapon types. Blue is a forward spread shot, yellow is a four-way shot, red is a wide forward laser shot and green is a continuous forward laser shot.</p><p>At the end of each section, you land on a carrier ship and count up your bonuses.</p>"},{"name":"Twin Dragons","year":2018,"developer":"Broke Studio"},{"name":"Twin Eagle","year":1989,"developer":"SETA Corporation"},{"name":"TwinBee","year":1986,"developer":"Konami Industry Co. Ltd."},{"name":"Twinbee 3: Poko Poko Daimaō","year":1989,"developer":"Konami Industry Co. Ltd."}]