[{"name":"U.S. Championship V'Ball","year":1989,"developer":"Technos Japan Corp."},{"name":"Uchūkeibitai SDF","year":1990,"developer":"HAL Laboratory, Inc."},{"name":"Uchūsen: Cosmo Carrier","year":1987,"developer":"Jaleco Ltd."},{"name":"Ufouria: The Saga","year":1991,"developer":"Sun Electronics Corp.","url":"1#Ufouria%20-%20The%20Saga%20%28Europe%29.nes","filesize":262160,"score":7.6,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Fantasy > Regional differences","desc":"<p>Hebereke (Bop Louie in PAL regions) is a penguin-like creature (though in PAL release he is more humanoid and looks like the Stay-Puft Marshmallow Man) who finds himself in a strange world. He remembers that he and his three friends fell into a crater, and decides to find his friends before attempting to escape from the unknown world. He must explore this world and face many dangers, as well as deal with severe memory issues that have afflicted his companions.</p><p><em>Ufouria</em> is a side-scrolling platform game set in a free-roaming environment. The game's world comprises interconnected areas which consist of outdoor sections, caves, water, and other thematic places with platform structures and wandering enemies. Similarly to The Dragon's Trap, the player is theoretically able to explore this world from the beginning; however, many areas are too hazardous or impossible to traverse when the player controls only one character with his limited abilities. </p><p>During the course of the game the player encounters the main hero's three friends, each of which becomes a controllable character. Each of these characters possesses special abilities that allow the player to access previously restricted areas. These abilities include swimming on the water's surface, walking on ice, jumping very high, and diving. The main character can also acquire a special item that will allow him to walk on walls.</p><p>All the characters attack by stomping on enemies, or by picking up balls left by defeated enemies and throwing them. In addition, each of the characters has his own \"secret weapon\", which must be found in optional areas and is then equipped automatically and used by holding down a button. Other items include life containers, which increase the character's overall hit points, and medicines that heal a fixed amount of health. Game progress can be saved through a password feature.</p>"},{"name":"Ultima IV: Quest of the Avatar","year":1989,"developer":"ORIGIN Systems, Inc.","url":"1#Ultima%20-%20Quest%20of%20the%20Avatar%20%28USA%29.nes","filesize":262160,"score":8.1,"genres":"Role-playing (RPG) > 1st-person > Top-down > Turn-based > Puzzle elements > Fantasy","desc":"<p>Following the defeat of the evil triad in the previous three <em>Ultima</em> games, the world of Sosaria changed beyond recognition: continents rose and sank, and new cities were built, heralding the advent of a different civilization. Unified by the reign of the benevolent monarch Lord British, the new world was renamed Britannia. Lord British wished to base people's well-being on the ethical principles of Truth, Love, and Courage, proclaiming the Eight Virtues (Honesty, Compassion, Valor, Justice, Sacrifice, Honor, Spirituality, and Humility) as the ideal everyone should strive for. The person who could accomplish full understanding and realization of these virtues would serve as a spiritual leader and a moral example for the inhabitants of Britannia; he alone would be able to obtain holy artifacts, descend into the Stygian Abyss, and access the Codex of Ultimate Wisdom. This person is the Avatar.</p><p>The fourth game in the <em>Ultima</em> series features an improved game engine, with color graphics and enhanced character interaction: the player can have conversations with non-playable characters by typing names of various topics. However, the main difference between <em>Ultima IV</em> and its predecessors in the series (as well as other role-playing games) lies in the game's objectives and the ways to fulfill them. </p><p>Instead of building up a character by any means possible in order to face a villain in the end of the game, in <em>Ultima IV</em> the player is trying to become the Avatar, a role model for people. This means upholding the Eight Virtues, basically trying to become a better person. Making morally conscious decisions and helping other people is not done expecting a material reward, but because it is the actual goal of the game and the main focus of its gameplay. The game frowns on behavior typical of most other RPGs, such as backstabbing fleeing enemies or picking up everything that isn't nailed down even if it does not belong to the protagonist. This different approach established the game's reputation as the first \"true\" <em>Ultima</em>, influencing the design philosophy of later installments and the overall spirit of the series.</p><p>Character creation is done by choosing responses to morally ambiguous questions. Each of the Eight Virtues corresponds to a character class; by determining the player's personal priorities in the virtues, the game assigns a class and a starting location for the Avatar. After emerging in Britannia, the player is free to explore it in various ways (on foot, moongate teleportation, on horseback, by ship, etc.). Certain items must be collected in any order to enter the Stygian Abyss and complete the game. The Avatar also has to reach the highest level in all virtues. This is achieved by various means: donating blood increases Sacrifice, not fleeing from combat increases Valor, etc. The process, however, is not irreversible: should the Avatar overpay a blind seller, he gains Compassion points; should he, on the other hand, cheat the seller by underpaying, his level in several virtues would decrease.</p><p>These unorthodox features of the game co-exist with plenty of traditional RPG elements, such as dungeons to explore and hostile monsters to kill. Enemies are encountered on the world map as well as in dungeons; combat takes place on separate top-down screens, allowing player-controlled and enemy parties freely move on them. Characters accumulate experience points and level up, gaining higher amount of hit points and access to stronger magic spells. Like in the previous installments of the series, world map, town exploration and combat are presented from a top-down view, while the dungeons are pseudo-3D and are explored from first-person perspective.</p><p><em>Ultima IV</em> also introduces several new gameplay features to the series and role-playing games in general. A number of initially non-playable characters living in various areas of the game world are able to to join the party and fight alongside the hero, replacing traditional player-generated characters or mercenaries and adventurers available only in special locations. Additional new elements include buying and combining reagents in order to cast spells, puzzle rooms in dungeons, and others.</p><p>The FM Towns version, while identical to the others in gameplay, introduces upgraded graphics similar to those used in next installment of the series.</p>"},{"name":"Ultima: Warriors of Destiny","year":1993,"developer":"ORIGIN Systems, Inc.","url":"1#Ultima%20-%20Warriors%20of%20Destiny%20%28USA%29.nes","filesize":262160,"score":5.3,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Turn-based > Puzzle elements > Direct control > Fantasy","desc":"<p>The Avatar Returns! Warriors of Destiny picks up where Quest of the Avatar left off; a self-contained game continuing the characters and challenges that have made Ultima® the greatest series of role playing games ever! Lord British has disappeared in the Underworld and the once-trusted Blackthorn has risen to power. You, the Avatar, hero of Britannia, and your team must rescue Lord British. On the way you'll meet hundreds of characters in panoramic lands; you'll battle the Shadowlords, horrible creatures bent on total destruction. But will you ever escape from the Underworld? Real role playing excitement!</p>"},{"name":"Ultimate Air Combat","year":1992,"developer":"Activision, Inc.","url":"1#Ultimate%20Air%20Combat%20%28USA%29.nes","filesize":524304,"score":7.4,"genres":"Action > Simulation > 1st-person > Top-down > Isometric > Direct control > Flight / aviation > Vehicular combat","desc":"<p>The dictator, General Don Gwano, has attacked his neighboring countries with his army and navy. To stop the dictator, Admiral Cliff Stormdrane suggests using the best pilot to make lightning strikes on Don Gwano's forces.</p><p>The game features 3 different flyable planes; FA-18 Hornet, AV-8 Harrier, and the F-14 Tomcat. The game features several types of missiles and bombs for the planes to use, including the harpoon, ASRAAM, rockeye, sea eagle, and maverick</p><p>Ultimate Air Combat has 36 different missions, then one last final mission. Each mission is grouped into two parts. The first part uses a cockpit view where the player must shoot down three planes before either running out of fuel or getting shot down by enemy planes. After that, the second half of the mission uses an isometric view where the player must destroy enemy forces and installations.</p>"},{"name":"Ultimate Basketball","year":1990,"developer":"Aicom Corporation","url":"3#Ultimate_Basketball/Ultimate_basketball.nes","filesize":262160,"score":6.3,"genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Direct control > Basketball","desc":"<p>In <em>Ultimate Basketball</em>, the player can choose one of seven fictional teams that each have different skills such as having tight defense or a phenomenal passing game. Each team also has their own players who are given ratings on their quickness, shooting and defensive ability.</p><p>The point of view is horizontal for the most part. Occasionally, a close-up action scene is shown on plays such as slam dunks and free throws. There are also two different play modes, \"Tournament\" and \"One Game.\" Players can play alone, against a friend, or with a friend against the computer. There is also a \"Watch\" mode where players can view games being played by the computer against itself.</p>"},{"name":"Ultimate League Soccer","year":1991,"developer":"Computer & Entertainment Inc."},{"name":"Ultimate Stuntman, The","year":1990,"developer":"Codemasters"},{"name":"Ultraman: Kaijū Teikoku no Gyakushū","year":1987,"developer":""},{"name":"Uncanny X-Men, The","year":1989,"developer":"","url":"1#Uncanny%20X-Men%2C%20The%20%28USA%29.nes","filesize":131088,"score":3.1,"genres":"Action > Top-down > Arcade > Sci-fi / futuristic > Licensed","desc":"<p>Professor Xavier and his Uncanny X-Men are all that stand in the way of the rampage of Magneto and his henchmen. The X-Men: Wolverine, Cyclops, Storm, Colossus, Iceman and Nightcrawler, are ready to fight Magneto.</p><p><em>The Uncanny X-Men</em> is an over-head view action game. Players begin by choosing two X-Men from the roster (the second either controlled by another player or the computer) and select one of five levels including a practice level. The goal in each level is to reach the hidden 'command center' and destroy it. The X-Men all share similar abilities, being able to move in any direction, jump and attack. Half of the characters (Storm, Iceman, Cyclops) have long range attacks while the other half (Wolverine, Nightcrawler, Colossus) must get in close range to punch the enemies. Each X-men can only sustain a certain number of hits before being defeated. Should the two X-Men both fall in battle, players will be able to choose two more to attempt the level again until all of the X-Men are used up.</p><p>Power-ups include an \"S\" which stops time, invincibility for a short time and a health restore. There is also a Magnet (symbol of Magneto) power-down which renders the X-men immobile for a short time.</p>"},{"name":"Uncharted Waters","year":1991,"developer":"KOEI Co., Ltd.","url":"1#Uncharted%20Waters%20%28USA%29.nes","filesize":655376,"score":7.4,"genres":"Simulation > Strategy > Top-down > Naval / watercraft","desc":"<p>The Franco family used to be one of the influential houses of Portugal. That is until the head of the family sailed out of a disastrous voyage to find the kingdom of Prester John. The disarray that followed brought about an end to the nobility of the Franco name. 100 years have passed and Portugal has prospered through it's sailing and trading empires. Young Leon Fanco wishes to restore his family's good name and make a name for himself as a sailor. At the heart of his ambition is the fair lady, Christiana, who is desired by the likely heir to the kingdom. Towards that end, Leon has been working hard to secure finances for his first ship. With the first step of his dream complete, Franco sails out with his father's good friend as first mate, you're off to find fame, adventure and fortunes out on the sea and in uncharted waters.</p><p><em>Uncharted Waters</em> is a sailing and trading simulation. Your goal is initially to sail between ports and trade goods between them to make a profit. Along the way, you may be called upon by merchants and royalty to do specific tasks. Several different nations as well as pirates roam the sea and not all have good relations with one another. You can take as long as you want and explore as much of the world as possible to complete your ultimate task of marrying Christiana, which will require your fame rating to be quite high anyway. Available at most ports is a trader for cargo, a supply station for your crew's food and water as well as repairs, a shipbuilder, an item store and finally a pub for gaining information, crew and gambling.</p><p>All of the game progresses on an overhead-view, by sea you navigate your fleet by direction and can issue additional orders including landing on any piece of land to search for supplies. A variety of hazards live at sea including storms, other ships, seaweed and simply bad winds and currents.</p>"},{"name":"Uninvited","year":1989,"developer":"ICOM Simulations, Inc.","url":"2#Uninvited%20%28USA%29.zip","filesize":1,"score":7,"genres":"Adventure > 1st-person > Fixed / flip-screen > Turn-based > Graphic adventure > Point and select > Horror","desc":"<p>Another game using the graphical adventure interface found in Déjà Vu and Shadowgate, <em>Uninvited</em> comes with a \"horror\" theme.</p><p>While driving on a lonely road at night, a strange figure blocks your vision causing you to swerve and crash your car. When you regain consciousness, you find that your brother is missing (in the NES-Version it's your sister who is missing). The only place he could have gone is a creepy old mansion which looms in front of you. With nowhere else to go, you enter the mansion in search of your brother. It turns out the mansion once belonged to an old wizard and his apprentice, and somehow it has become infested with the Undead.</p>"},{"name":"Untouchables, The","year":1991,"developer":"Special FX Software Ltd.","url":"1#Untouchables%2C%20The%20%28USA%29%20%28Rev%20B%29.nes","filesize":262160,"score":"","genres":"Action > 1st-person > Side view > Shooter > Interwar > Licensed","desc":"<p><em>The Untouchables</em> is based on the 1987 film by Brian De Palma and works to correspond to the movie's plot outline. In 1920s Chicago, Eliot Ness and his small crew of law enforcement professionals are determined to bring down Al Capone and his gang. </p><p>The game features 7 levels of action named The Street, The Warehouse, The Bridge, The Alleys, The Train station, The Hostage, and The Rooftop. Some of the levels feature traditional jumping and shooting action. Other levels pit you against the gangsters in a first person shooter-style of gameplay where your character begins behind a wall, wraps around into an open area, and must take out the bad guys. When your character runs out of ammo, he slips back behind the wall to reload. These levels are accompanied with time limits and goals for the number of enemies you must kill.</p>"},{"name":"Urban Champion","year":1984,"developer":"Nintendo R&D1","url":"1#Urban%20Champion%20%28World%29.nes","filesize":24592,"score":4.7,"genres":"Action > Side view > Arcade > Fighting","desc":"<p>Two rival characters meet up one day on the city streets and arrange a fight. Both characters will start in the middle with two blocks on either side of them leading to an open manhole. The first person to knock the other into the open manhole is the winner. Only punches are allowed, although obstacles such as falling flower pots can occur and give one player the advantage. Also, everyone is to look innocent should the police drive by.</p><p>This is a very early and simplistic fighting game. As mentioned, each player can only punch the other, trying to knock them off the screen and towards one of the waiting manholes.</p>"},{"name":"Urusei Yatsura: Lum no Wedding Bell","year":1986,"developer":"Jaleco Ltd."},{"name":"Ushio to Tora: Shin'en no Daiyō","year":1993,"developer":"Tom Create Co., Ltd."}]