[{"name":"Valis: The Fantasm Soldier","year":1987,"developer":"Telenet Japan Co., Ltd."},{"name":"Valkyrie no Boken: Toki no Kagi Densetsu","year":1986,"developer":"Namco Limited","url":":Valkyrie no Bouken - Toki no Kagi Densetsu (Japan)","filesize":36005,"score":"","genres":"Action > Role-playing (RPG) > Diagonal-down > Anime / Manga > Action RPG > Fantasy","desc":"<p>Once upon a time, the Marvel Land was a peaceful place populated by humans and other races. Zouna, a dark wizard who had once threatened the land was securely sealed in a clock tower. One day, the clock stopped working for unknown reason, and a villager who tried to fix it inadvertently dropped the key of time. A catastrophe ensued: Zouna broke free and took the key with him, preventing anyone from sealing him again. The dark minions of Zouna corrupted the hearts of Marvel Land inhabitants. Hatred and chaos descended upon the world. Finally, a savior has arrived - Valkyrie, a maiden from heaven vows to save Marvel Land from evil and defeat Zouna. </p><p><em>Valkyrie no Bōken: Toki no Kagi Densetsu</em> is an action role-playing game. Controlling Valkyrie, the player roams top-down wilderness areas, fighting enemies and collecting gold and experience points, which will eventually cause the heroine to level up and become stronger. Weapons and armor can be purchased in friendly areas or found during exploration. Valkyrie also gains access to seven different spells of offensive and healing nature. The time needed to learn the spell depends on the protagonist's intelligence parameter. The player's initial choice of star sign and blood group for the heroine may affect the changes in her statistics when she levels up.</p>"},{"name":"Vegas Dream","year":1988,"developer":"HAL Laboratory, Inc.","url":":Vegas Dream (USA)","filesize":95158,"score":"","genres":"Gambling > 1st-person > Cards / tiles","desc":"<p>As a vacationing tourist, you have $700 in your pocket and a desire to hit the Las Vegas casinos and try to win it big. Play games of chance of either Blackjack, Roulette, Slot Machines or Keno in your attempts to horde vast quantaties of money and live the Vegas Dream.</p>"},{"name":"Venice Beach Volleyball","year":1991,"developer":"Idea-Tek, Inc."},{"name":"Venus Senki","year":1989,"developer":"Human Entertainment, Inc."},{"name":"Vice: Project Doom","year":1991,"developer":"Aicom Corporation","url":":Vice - Project Doom (USA)","filesize":172764,"score":8,"genres":"Action > Racing / Driving > 1st-person > Side view > Top-down > Platform > Rail shooter > Shooter > Sci-fi / futuristic > Detective / mystery","desc":"<p>Quinn Hart and his partner, Detective Reese of the VICE squad both work to stop the trafficking of illegal substances. But something new has appeared on the scene, a neon gel with great addictive properties. During investigations as to the origin of the gel, Reese mysteriously disappears and leaves Hart without a lead. Time passes and Hart becomes romantically involved with his new partner, Christy, as he continues trying to track down the gel. But Hart is about to get a brand new lead...</p><p><em>Vice: Project Doom</em> is a game that features side-scrolling platform sequences, overhead driving modes and rail-shooter stages. In driving stages Hart's vehicle can accelerate or slow down and fire his weapon straight ahead. During side-scrolling sequences, Hart can jump, duck, climb or use his selected weapon. Weapons that can be selected include a Katana sword, a pistol and a grenade-type weapon. These weapons feature limited ammunition with the exception of the katana. Power-ups include ammunition, coins, and health. In rail-shooting stages, similar to Operation Wolf, Hart can shoot enemies with his gun or throw grenades and pick up items by shooting at them.</p><p>During these sequences, Hart must fight and maneuver his way past enemy foes to confront a boss. By destroying the boss and completing the level, Hart progresses and learns a bit more about the origins of the neon gel and what Project Doom is all about. Cinematics dialog between the levels tell the tale in a style similar to that of Ninja Gaiden.</p>"},{"name":"Vindicators","year":1989,"developer":"Atari Games Corporation","url":":Vindicators (USA) (Unl)","filesize":49375,"score":6.9,"genres":"Action > Top-down > 2D scrolling > Shooter > Tank > Sci-fi / futuristic","desc":"<p>The Tangent Empire are preparing to attack the earth with their convoy of tanks, and it is you who has been sent forward to destroy the 14 space stations which make up the potential invasion threat.</p><p>There are 3 sub-levels on each station, which can be played in any order. The action scrolls in every direction, with you guiding your tank-link droid around to shoot the opposition droids. The tank takes a while to steer, making it initially harder to avoid contact with those enemies. Each level contains energy stars, which can be traded in for upgrades such as improved weapons and extra speed after each level.</p>"},{"name":"Volguard II","year":1985,"developer":"dB-SOFT","url":":Volguard II (Japan)","filesize":27022,"score":"","genres":"Action > Side view > 2D scrolling > Shooter > Direct control > Mecha / giant robot","desc":"<p><em>Volguard II</em> is a side-scrolling shooter that is a follow-up to Volguard. Players have to shoot their way through 25 areas in one of the four difficulty levels the game offers.</p><p>Players control a flying craft that has the ability to shoot both bullets and bombs, however bullets are only usable if the craft has enough power to do so. Players can also come across a mech attachment item which will allow them to turn their craft into a mech, which has the ability to walk on the ground and throw punches at enemies and structures. Players also have to keep a close eye on their energy counter. Every time their craft is hit, the counter goes up by 1. If the counter reaches 99, the game will end.</p>"},{"name":"Volleyball","year":1986,"developer":"Nintendo R&D3","url":":Volleyball","filesize":21431,"score":4.9,"genres":"Sports > Diagonal-down > 2D scrolling > Volleyball","desc":"<p><em>Volleyball</em> is an action game for one or two players. Choose a country to represent, choose a men's or women's team, then head to the court to begin! You can serve, set the ball for a teammate, spike, lob, or dive to save the game.</p>"},{"name":"Vs. Excitebike","year":1988,"developer":"Pax Softnica"},{"name":"VS. Super Xevious","year":1986,"developer":"Tose Co., Ltd."},{"name":"Vulcan Venture","year":1988,"developer":"Konami Industry Co. Ltd."}]