[{"name":"Wacky Races","year":1991,"developer":"Atlus","url":"1#Wacky%20Races%20%28USA%29.nes","filesize":262160,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Despite what the name implies, <em>Wacky Races</em> for NES is not a racing game, and has nothing to do with the other games bearing the same name but the license. In this game, the player takes control of Muttley, the grumbling, but loyal dog from the popular Hanna-Barbera cartoon. His master Dastardly sends his on three different missions, each taking place in a different location, which in its turn is divided into smaller levels. </p><p>Muttley has to complete those levels in a rather standard platformer fashion, moving from left to right, jumping, overcoming obstacles and fighting various creatures and boss enemies from the cartoon movie. The dog's primary weapon is, unsurprisingly, his own mouth - biting regular enemies will usually lead to their instant death. Muttley can also collect bones scattered across the levels, which will grant him powerful weapons and skills of limited use, such as a bomb, a projectile attack, and the ability to heal.</p>"},{"name":"Wagan Land","year":1989,"developer":"Namcot"},{"name":"Wagan Land 2","year":1990,"developer":"Namcot"},{"name":"Wai Wai World 2 - SOS!! Parsley Jō","year":1991,"developer":"Konami Industry Co. Ltd."},{"name":"Wall Street Kid","year":1989,"developer":"SOFEL Co., Ltd.","url":"2#Wall%20Street%20Kid%20%28USA%29.zip","filesize":1,"score":5.7,"genres":"Simulation > 1st-person > Managerial / business simulation > Regional differences","desc":"<p>Your distant uncle has passed away, leaving you, his heir, with a fortune of billions of dollars. The catch? The Benedict family has extremely high standards, and you have to prove that you can make that fortune even larger on the stock market before it will be given to you. In addition, you must exercise regularly to stay healthy, and keep your girlfriend happy by pampering her frequently with gifts. </p><p>The game features a stock trading engine that is fairly simple to jump into. Buy stocks as you see fit, and finish the day. The next morning, you will find out whether your assets grew or not. If they didn't, you most likely need to invest in something else.</p>"},{"name":"Wally Bear and the NO! Gang","year":1992,"developer":"American Game Cartridges, Inc."},{"name":"Wario's Woods","year":1994,"developer":"Intelligent Systems Co., Ltd.","url":"1#Wario%27s%20Woods%20%28USA%29.nes","filesize":524304,"score":7.5,"genres":"Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Tile matching puzzle > Direct control > Fantasy","desc":"<p><em>Wario's Woods</em> is a puzzle game similar to Tetris or Columns, but with a twist. Instead of directly controlling the monsters and bombs that are falling down, the player controls Toad who has to carry around stacks of monsters and bombs and to combine them in the right way. One bomb plus at least two monsters of the same color have to be combined to make them disappear. If five or more objects are cleared at the same time, a diamond will appear. Destroying the diamond will clear all monsters of the diamond's color.</p><p>There are four different ways to pick up objects. The A button lets Toad pick up the whole stack that is in front of him, the B button lets him only pick up one object, even if it's in the middle of a stack, the Y button lets him kick a monster or bomb that's in front of him and the X button places him on top of the stack that he is carrying. He can also run up walls and stacks to catch falling objects out of the air or to pick up certain parts of a stack.</p><p>There are 5 different modes of play: a \"Round Game\" in which Toad has to clear numerous levels, a match versus a computer controlled opponent, a two player mode, a \"Time Race\" mode, and finally, an extensive training mode.</p><p>There are some differences between the SNES and NES versions. Due to a lack of buttons, controls are a little different in the NES version (although all the moves from the SNES version are present). Also, there is no vs. mode against the computer, but the \"Round Game\" mode features two modes of play: one that includes boss-fights on every level ending with a 9.</p>"},{"name":"Warpman","year":1985,"developer":"Namco Limited"},{"name":"Wayne Gretzky Hockey","year":1991,"developer":"Bethesda Softworks LLC","url":"3#Wayne_Gretzky_Hockey/Wayne_gretzky.nes","filesize":131216,"score":6.5,"genres":"Sports > Top-down > Managerial / business simulation > Hockey","desc":"<p>The first of three Wayne Gretzky games from Bethesda. It contains everything that could be found in a hockey rink, from big hits and fighting to icings and offsides. It's not only about what is on the ice but also outside, offering the player plenty of coaching options and gives you the ability to create your own players and teams.</p>"},{"name":"Wayne's World","year":1993,"developer":"Radical Entertainment Inc.","url":"1#Wayne%27s%20World%20%28USA%29.nes","filesize":262160,"score":4.7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control > Licensed","desc":"<p>Okay. I'm Wayne Campbell, your excellent host, and with me, as always, is Garth. Hi. We're glad you tuned in, because my faithful co-host and I are really getting dumped on, and we need some help, or, quite frankly, we're bucket! You see, we have this excellent cable access show, Wayne's World, but some dweeby producer from Chicago is trying to buy us out and make our show into some dweeboid \"Mister Campbell's Neighborhood.\" Shyeahh, right! Anyhow, it's a really bizarre adventure trying to save our show: things start out in the music store, where all of this bargain merchandise comes after us. Kinda like that movie where vegetables come to life and crawl around. Good call, Garth. After that, things get even hairier: bogus bouncers at the Gasworks, a bizarro trip through a T.V. studio and nasty ninjas. (As if!)</p>"},{"name":"WCW: World Championship Wrestling","year":1990,"developer":"Nihon Bussan Co., Ltd.","url":"2#WCW%20World%20Championship%20Wrestling%20%28USA%29.zip","filesize":1,"score":6.1,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Isometric > Wrestling > Licensed","desc":"<p><em>WCW: World Championship Wrestling</em> is an isometric wrestling game of the National Wrestling Alliance. Players can choose to engage in one- or two-player matches as either 1vs1 solo bouts or 2vs2 tag-teams. Upon selecting a mode, players choose their characters from among twelve featured wrestlers from the NWA league. Licensed characters include: Rick Flair (\"Nature Boy\"), Sting, Lex Luger (\"Total Package\"), Mike Rotunda, Road Warrior Hawk, Road Warrior Animal, Steve Williams (\"\"Dr. Death\"), Kevin Sullivan (\"Gamemaster\"), Ricky Steamboat (\"The Dragon\"), Ric Steiner (\"Dogface Gremlin\"), Eddie Gilbert (\"Hotstuff\") and Michael P.S. Hayes. Each wrestler has unique abilities not shared by the other wrestlers, including finishing moves and rope toss.</p><p>Prior to a match, the player is presented with a menu of eight \"moves\", of which the player chooses four to assign to the points of the directional pad. Once the match starts, the player is only able to use the four moves selected and the rope toss to attack the opponent. Each wrestler can move up, down, left and right inside the wrestling ring, climb the turnstiles at each corner and throw opponents out of the ring (where they will be disqualified if outside for 20 seconds). Each wrestler has a high damage \"finisher move\" which can only be performed when they are standing in the middle of the ring and the opponent's stamina bar is low.</p>"},{"name":"Werewolf: The Last Warrior","year":1990,"developer":"Data East Corporation","url":"1#Werewolf%20-%20The%20Last%20Warrior%20%28Europe%29.nes","filesize":262160,"score":5.8,"genres":"Action > Side view > Arcade > Platform > Horror","desc":"<p>An evil leader and his gang of bio-engineered monsters has taken over the land and only one man stands in their way. Only he's not a man, he is a lycanthrope, a person able to transform into a terrible werewolf to let loose his anger.</p><p>You start the game in human form. The human can punch, jump, move and shoot a powered up shot which moves horizontally across the screen.  By finding a Red \"W\" icon, the human is able to transform into a mighty werewolf creature. Accidentally grabbing a blue \"W\" icon or losing too much energy will change you back into a mere human being. The werewolf form offers higher jumps, quicker speed, greater strength, a shockwave attack and the ability to climb walls, so naturally you'll want this form whenever possible.  Additionally the werewolf form has an anger meter that is augmented by collecting orbs. After 5 such orbs, the werewolf will transform yet again into a SUPER werewolf with even greater strength, speed and partial invincibility.</p><p>There are 5 stages in all. Each with a boss who moves in a distinct pattern.</p>"},{"name":"Wheel of Fortune","year":1988,"developer":"Rare Limited","url":"3#Wheel_of_Fortune/Wheel_of_fortune.nes","filesize":131088,"score":"","genres":"Puzzle > 1st-person > Fixed / flip-screen > Game show / trivia / quiz > Word construction > Licensed","desc":"<p>Based on the popular Merv Griffin-produced TV game show of the same name. The goal is to solve for the missing letters in the given place, person, thing, phrase, etc. Spin the eponymous wheel for money, guess consonants, buy vowels, and try to solve the puzzle. Watch out, though...one poor spin, and you could be forced to miss your turn, or even go bankrupt. Play against human opponents or the computer and win fabulous prizes on the WHEEL...OF...FORTUNE!</p>"},{"name":"Wheel of Fortune: Family Edition","year":1990,"developer":"Rare Limited","url":"2#Wheel%20of%20Fortune%20-%20Family%20Edition%20%28USA%29.zip","filesize":1,"score":"","genres":"Puzzle > 1st-person > Fixed / flip-screen > Game show / trivia / quiz > Word construction > Licensed","desc":"<p><em>Wheel of Fortune: Family Edition</em> is one of a series of NES games based on the famous TV game show. The goal is to solve a word puzzle by guessing letters. The players take turns spinning a wheel that has designated money amounts in most spaces, but can also bankrupt the player in the wheel lands on the wrong space. A player can guess a letter and if that letter is in the puzzle, those spaces are flipped to reveal the letter and the player earns the cash amount specified by the wheel spin, multiplied by the number of occurrences of the letter. Only English consonants can be guessed-- the 5 English vowels can be purchased using a player's earnings.</p><p>This NES edition of the game allows 1, 2, or 3 human players to play against each other. Human players can also elect to play against computer players and at 3 difficulty levels.</p>"},{"name":"Wheel of Fortune: Featuring Vanna White","year":1992,"developer":"Imagitec Design Ltd."},{"name":"Wheel of Fortune: Junior Edition","year":1989,"developer":"Rare Limited","url":"2#Wheel%20of%20Fortune%20-%20Junior%20Edition%20%28USA%29.zip","filesize":1,"score":"","genres":"Puzzle > 1st-person > Fixed / flip-screen > Game show / trivia / quiz > Word construction > Licensed","desc":"<p><em>Wheel of Fortune: Junior Edition</em> is one of a series of NES games based on the famous TV game show. The goal is to solve a word puzzle by guessing letters. The players take turns spinning a wheel that has designated money amounts in most spaces, but can also bankrupt the player in the wheel lands on the wrong space. A player can guess a letter and if that letter is in the puzzle, those spaces are flipped to reveal the letter and the player earns the cash amount specified by the wheel spin, multiplied by the number of occurrences of the letter. Only English consonants can be guessed - the 5 English vowels can be purchased using a player's earnings.</p><p>This NES edition of the game allows 1, 2, or 3 human players to play against each other. Human players can also elect to play against computer players and at 3 difficulty levels.</p><p>Since this is the Junior Edition of the franchise, the puzzles are geared to be solvable for a younger audience.</p>"},{"name":"Where in Time Is Carmen Sandiego?","year":1991,"developer":"Brøderbund Software, Inc."},{"name":"Where's Waldo?","year":1991,"developer":"Bethesda Softworks LLC","url":"2#Where%27s%20Waldo%20%28USA%29.zip","filesize":1,"score":3.1,"genres":"Puzzle > Diagonal-down > Hidden object > Point and select > Licensed","desc":"<p>Waldo has a ticket to the Moon and needs the players help to get him to his destination.</p><p>Based on the popular Where's Waldo series of books. Your goal is to find Waldo in various pictures in order to progress through the game.</p><p>The pictures are still images the size of the screen in the Easy and Practice levels. In the Medium and Hard levels, the player has to scroll to the side to see the rest of the area.  The directional buttons control a magnifying glass and once the player finds Waldo, they get to go to the next level and a new picture.</p><p>In the Practice difficulty level, there is no time limit but only the Train Station, Forest and Caves levels are available. The time limit for the other difficulty levels varies: Easy=959, Medium=659, and Hard=459.</p>"},{"name":"Who Framed Roger Rabbit","year":1989,"developer":"Rare Limited","url":"1#Who%20Framed%20Roger%20Rabbit%20%28USA%29.nes","filesize":131088,"score":6.1,"genres":"Adventure > Side view > Top-down > Detective / mystery > Licensed","desc":"<p>Roger Rabbit's, a living breathing cartoon, has been framed for the murder of Marvin Acme. The motive is that his wife, Jessica Rabbit had been photographed playing patty-cake with him. Obviously this kind of affair is enough to drive a man, or rabbit, into killing. But he didn't do it and now there seems to be some kind of mystery surrounding Marvin Acme's last will and testament... and with it, ownership of Toontown. In order to clear his name, Roger has  enlisted the help of Eddie Valliant, no-nonsense detective. Together they'll need to search through Hollywood, Toontown, the Wilderness and Toontown in an effort to find the pieces to Marvin's original will and stop the evil Judge Doom and his henchmen, the Weasels.</p><p>You play this game as the Private Investigator, Eddie Valliant, while Roger Rabbit wanders around the scenery behind you. Your job is to search the city for clues, items and punchlines to jokes which will be your only defense should the Weasels catch up to poor Roger. Except for these Weasels (and birds flying overhead), Roger is more or less invincible as a toon. That means for most of the gameplay, he will be ignored. Should the Weasels appear in an area with you however (with an alarm sounding as they get close), Roger will go bug-eyed and try to run away. It is then up to Eddie to keep the Weasels away from Roger or engage in knock-knock jokes should they happen to catch him.</p><p>The bulk of the gameplay takes place on side-scrolling areas that represent city blocks, caves and room interiors. There is also a top-view world map where you navigate between areas on foot or via Benny the Cab.</p>"},{"name":"Whomp 'Em","year":1990,"developer":"Jaleco Ltd.","url":"3#Whomp_Em/Whomp_em.nes","filesize":262160,"score":6.5,"genres":"Action > Side view > Platform > Regional differences","desc":"<p>Whomp 'Em tells the tale of a little Native American Indian named Soaring Eagle who is on a quest to fill his magic pouch with totems. These totems are guarded by fearsome bosses at the end of different environments spread throughout the land. Each totem gives Soaring Eagle a new power to help him complete his journey.</p><p>Whomp 'Em is a side scrolling action platformer. The hero can run, jump, and attack with his spear. Not only can he jab forward with his spear, Soaring Eagle can also stab upwards or downwards while jumping. Further, he can use his spear to defend from attacks coming from above.</p><p>Soaring Eagle must first conquer a bossless, introductory level. From there, he is free to choose from among 6 different lands to explore: Fire test, ice ritual, secret cliff, water test, magic forest, and sacred woods. Each level is highly unique with its own dangerous enemies and lethal boss. After completing these 6 areas and collecting the associated totems, Soaring Eagle is whisked off to a cloud realm where he must use all of his accumulated power to defeat a much larger enemy.</p>"},{"name":"Widget","year":1992,"developer":"Graphic Research Co., Ltd.","url":"1#Widget%20%28USA%29.nes","filesize":262160,"score":"","genres":"Action > Platform > Sci-fi / futuristic > Licensed","desc":"<p>Widget is a game about a perpetually smiling purple alien who must save earth from a gang of alien invaders. The action consists of side scrolling jumping and shooting. However, Widget has the capacity to transform into a variety of other creatures and objects (\"widgets\") which have application in different situations. These alternate widget forms include a cannon, a mouse, a rock-man, a bird-man, and a dolphin. Transforming uses up magic points which must be replenished. Widget also communicates with a helper named Mega Brain via a wristwatch device.</p>"},{"name":"Wild Gunman","year":1984,"developer":"Nintendo Co., Ltd.","url":"3#Wild_Gunman/Wild_gunman.nes","filesize":24592,"score":6,"genres":"Action > 1st-person > Arcade > Shooter > Western","desc":"<p>As a lawman in the old west, you carry around a tin star and your NES Zapper. Your goal to to chase down outlaws and then win out over them in a fast-draw competition. Simply put, wait for your opponent to say \"Fire\" and then shoot first and shoot fast to win.</p><p>Wild Gunman can be played against one bandit, two bandits or in Gang mode where you shoot them as they appear in the doors and windows of an old saloon.</p>"},{"name":"Willow","year":1989,"developer":"Capcom Co., Ltd.","url":"1#Willow%20%28USA%29.nes","filesize":262160,"score":7,"genres":"Action > Role-playing (RPG) > Top-down > Fantasy > Licensed","desc":"<p><em>Willow</em> is an action RPG based on the movie with the same name. The player assumes the role of Willow, the chosen one who must restore human form to the benevolent sorceress Fin Raziel and destroy the evil sorceress, Bavmorda. While the game follows the movie's plot somewhat most of the time, it also expands on it and introduces characters, races and enemies not found in the movie.</p><p>Gameplay is similar to other action RPGs and The Legend of Zelda. Willow is seen from a top down perspective and all enemies are visible on screen. Slaying enemies will give Willow experience points, which will eventually lead to him increasing his stats automatically. New weapons, shields and magic items are found in various treasure chests scattered across the land or given to Willow as part of the plot. Aside from battling minor enemies Willow will also face off against several boss monsters as well as characters from the movie.</p>"},{"name":"Wily & Right no RockBoard: That's Paradise","year":1993,"developer":"Capcom Co., Ltd."},{"name":"Win, Lose or Draw","year":1990,"developer":"Softie, Inc.","url":"2#Win%2C%20Lose%20or%20Draw%20%28USA%29.zip","filesize":1,"score":5.2,"genres":"Strategy > Game show / trivia / quiz > Licensed","desc":"<p><em>Win, Lose or Draw</em> was a popular TV show requiring artistic skills and an ability to think laterally. A player on your team draws something on the big game board, and you must work out what it represents. They will be common expressions depicted literally, such as 'bright idea' showing a light bulb over somebody's head, and 'cabin fever' as a rickety building next to a man with a thermometer in his mouth. </p><p>In this computerised implementation the drawing phase of the game is handled by the computer, so your task is simply to guess the meaning of the picture by thinking laterally. Your team has 60 seconds, and you can guess repeatedly, but the picture takes time to take shape. If you fail to guess correctly, the opposition has 15 seconds to guess it (with a single try) to steal the money.</p>"},{"name":"Wing of Madoola, The","year":1986,"developer":"Sun Electronics Corp.","url":"1#Wing%20of%20Madoola%2C%20The%20%28J%29.nes","filesize":65552,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Direct control","desc":"<p>The Kingdom of Badham was once the host of the legendary Wing of Madoola bird statue. Anyone who possessed the wing would be granted tremendous power. Many wars were caused by nations wanting to have control over this powerful artifact. Thankfully, a king of the Rameru family gained possession of the wing and ordered that it be hidden away in a cave so peace would finally reign between the warring nations, and peace did indeed reign, for a while at least. Hundreds of years later, a descendant of the king, named Darutos, stumbled upon the location of the wing and decided to use it for his own ends. He summoned demons to take over his family's castle to claim it as solely his own. The remaining Rameru family line now have formed an alliance to gain back the castle and put a stop to Darutos. They decided there only hope is a magic wielding warrior named Lucia.</p><p>Players take control of Lucia throughout 16 side-scrolling stages. Her goal in each stage is to locate and beat a boss enemy and collect the crystal ball that's in its possession. The crystal ball is needed to unlock the exit of each stage.</p><p>Throughout her journey, Lucia will come across various weapons, itemsand upgrades to help her on her quest. Some of these items include boots for increased speed and higher jumping ability, swords to increase her attack strength, potions to replenish health, scrolls to recover magic points, and even the Wing of Madoola, which will give Lucia the power to fly.</p>"},{"name":"Winter Games","year":1987,"developer":"Action Graphics, Inc.","url":"2#Winter%20Games%20%28USA%29%20%28Rev%20A%29.zip","filesize":1,"score":7.2,"genres":"Sports > Side view > 2D scrolling > Direct control > Olympiad / mixed sports","desc":"<p>Another in the series of Epyx Olympic sports games. Compete in many different sporting events: Ski Jump, Hot Dog, Biathlon, Bobsled, Free Skating, Figure Skating, and more.</p>"},{"name":"Wit's","year":1990,"developer":"Athena Co., Ltd."},{"name":"Wizardry: Knight of Diamonds - The Second Scenario","year":1990,"developer":"Sir-tech Software, Inc.","url":"1#Wizardry%20-%20Knight%20of%20Diamonds%20-%20The%20Second%20Scenario%20%28USA%29.nes","filesize":262160,"score":7.3,"genres":"DLC / Add-on > Role-playing (RPG) > 1st-person > Turn-based > Fantasy","desc":"<p><em>Wizardry: Knight of Diamonds</em> is the sequel to Wizardry: Proving Grounds of the Mad Overlord. It is an early example of an expansion pack, requiring the player to have the original Wizardry installed to play. It uses the same engine and spells, but is scaled for importing existing characters rather than creating a new party. Players explore a 3D wire frame maze searching for a key item, the Staff of Gnilda, required to complete the game. The player creates a party of up to 6 characters of various classes, and then gain experience points by fighting random encounters. The maze has many hidden doors and secrets, so the player is encouraged to map out each floor on graph paper to find their way.</p><p>The story takes place after the events of the first game. The mad king Trebor has committed suicide after becoming obsessed with the amulet and fearing the return of Werdna. With both Trebor and Werdna dead all seemed well within the kingdom of Llylgamyn. Unfortunately, this peace didn't last very long. With Werdna dead and out of the limelight, an evil knight named Davalpus felt it was time to make his move. He stormed the castle, slaughtered the royal family, and declared himself supreme dictator for life. The Prince of the land fought and killed Davalpus using the legendary Staff of Gnilda and wearing the armor of the Knight of Diamonds. However, the god Gnilda took the staff back and placed it deep within his heavily guarded six-level temple. Since the staff's power protects the land from invasion by hostile outlanders, someone will need to venture into the temple and get the staff back along with Gnilda's blessing. </p><p>Though <em>Knight of Diamonds</em> is the second scenario in the series, it was the third game in the series released for Famicom/NES. The NES version was redesigned to be played by new parties and the maps were re-designed to be non-linear. This makes the NES version more like a unique entry in the series rather than a port of the computer versions. The Famicom version is compatible with the ASCII TurboFile, an accessory that allowed the player to transfer characters between the Famicom Wizardry games. This feature was removed from the NES version. The Famicom version also allowed the player to switch between English and Japanese text.</p>"},{"name":"Wizardry: Legacy of Llylgamyn - The Third Scenario","year":1989,"developer":"Andrew Greenberg, Inc."},{"name":"Wizardry: Proving Grounds of the Mad Overlord","year":1987,"developer":"Sir-tech Software, Inc.","url":"1#Wizardry%20-%20Proving%20Grounds%20of%20the%20Mad%20Overlord%20%28USA%29.nes","filesize":262160,"score":7,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Fantasy","desc":"<p>The Mad Overlord Trebor was once only power-mad, but went off the deep end after he acquired a magical amulet of immense power, only to have it stolen from him by his nemesis, the evil archmage Werdna. Werdna, not quite sure how to use the amulet properly, accidentally causes an earthquake which creates a ten-level dungeon beneath Trebor's castle. To avoid looking silly, Werdna declares the dungeon to be the new lair for him and his monster hordes. Trebor, not to be outdone, declares the labyrinth his new Proving Grounds where adventurers must prove themselves for membership in his elite honor guard, and incidentally retrieve his amulet in the process.</p><p>The first <em>Wizardry</em> was one of the original dungeon-crawling role-playing games, and stands along with  Ultima and  Might &amp; Magic as one of the defining staples of the genre.</p><p>The player generates and controls a party of up to six different adventurers, choosing from five races (humans, elves, dwarves, gnomes and hobbits), three alignments (good, neutral and evil), and four basic classes (fighter, priest, mage and thief). These can later evolve into elite classes (bishop: priest with mage spells; samurai: fighter with mage spells; lord: fighter with priest spells, and ninja: fighter with thief abilities) if they meet the necessary level requirements. After outfitting the party with basic weapons and armor, the player sends it into a 3D vector maze-like dungeon to fight monsters in turn-based combat and find treasure.</p>"},{"name":"Wizards & Warriors","year":1987,"developer":"Rare Limited","url":"1#Wizards%20%26%20Warriors%20%28USA%29.nes","filesize":131088,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p>You are Kuros, a powerful knight who enter the woods of Elrond.Legend says that a powerful wizard named Malkil has has gone completely mad during his years and turned his powerful magic to the dark side.Malkil has his base on the castle IronSpire where he has imprisoned a young and beautiful princess. It is up to Kuros to save the princess once and for all.</p>"},{"name":"Wizards & Warriors III: Kuros - Visions of Power","year":1992,"developer":"Zippo Games","url":"1#Wizards%20%26%20Warriors%20III%20-%20Kuros...Visions%20of%20Power%20%28USA%29.nes","filesize":262160,"score":6.6,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Fantasy","desc":"<p>The evil wizard Malkil was not actually vanquished at the end of the previous game. In fact, after the mighty battle with the hero Kuros, Malkil retreated to a nearby self-contained castle kingdom and conducted a hostile takeover. Kuros comes on the scene and must attempt to relieve Malkil of his ill-gotten command of the kingdom, its subjects, and especially its princesses.</p><p>The third game in the <em>Wizards &amp; Warriors</em> series features a similar feel to the first two games in that Kuros' movements are very quick and nimble. The player also has the ability to control Kuros' sword swing movements. However, Kuros has three different character classes to alternate between-- the knight, the thief, and the wizard. Each represents trade-offs between speed, attack strength, and defense strength. There are various guilds throughout the game devoted to training knights, thieves, and wizards where the player must complete challenging obstacle courses in order to increase their character class level.</p><p>The gameplay proceeds up a large vertical city/castle with dangerous, monster-filled hallways and caverns. Kuros must kill monsters, gather money, buy goods and services, raise his character class levels, rescue a variety of apprehended princesses and gather special jewels, all in a quest to face off with Malkil once again.</p>"},{"name":"Wǒ xiang niào niào","year":2017,"developer":"The Mojon Twins"},{"name":"Wolverine","year":1991,"developer":"Software Creations Ltd.","url":"1#Wolverine%20%28USA%29.nes","filesize":262160,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>In this side-scrolling action game, you play as Wolverine, stranded on a remote island by Sabretooth and Magneto, and must fight your way through nine missions, ultimately concluding with battles against Sabretooth and Magneto. Along the way, fellow X-Men Havok, Psylocke and Jubilee can be called upon to aid Wolverine in certain situations. Of course, you can always utilize your adamantium claws and healing factor when the going gets tough.</p>"},{"name":"Wonderland Dizzy","year":2015,"developer":"Dizzy Enterprises Ltd."},{"name":"World Champ","year":1990,"developer":"Visco Corporation","url":"2#World%20Champ%20-%20Super%20Boxing%20Great%20Fight%20%28Europe%29.zip","filesize":1,"score":6.4,"genres":"Sports > Boxing","desc":"<p><em>World Champ</em> is a boxing game that has many similarities to Data East's Ring King. You can play a one player \"Ranking\" mode, where you can build your boxer's stats up while climbing the ladder to eventually challenge for a championship in one of the four weight classes. There is also a two player vs. mode where you and a friend can square off. A tournament mode allows up to 8 players participate in a bracketed tournament.</p><p>Gameplay consists of each boxer moving around the ring trying to land jabs, hooks, and uppercuts. The goal is to either knock your opponent out for a 10-count or have the most points on the scorecard at the end of the allotted amount of rounds.</p>"},{"name":"World Games","year":1989,"developer":"K-Byte","url":"2#World%20Games%20%28USA%29.zip","filesize":1,"score":6.4,"genres":"Action > Sports > Diagonal-down > Side view > Olympiad / mixed sports","desc":"<p><em>World Games</em> is an Olympics-style sports game with arcade-oriented gameplay. The events players can compete in include:</p><ul><li>Barrel jumping</li><li>Bull riding</li><li>Caber toss</li><li>Cliff diving</li><li>Log rolling</li><li>Skiing</li><li>Sumo wrestling</li><li>Weightlifting</li></ul><p>In the Sega Master System version, there is only four events: </p><ul><li>Barrel jumping</li><li>Bull riding</li><li>Caber toss</li><li>Pole vault</li></ul>"},{"name":"Wrath of the Black Manta","year":1990,"developer":"A.I Co., Ltd.","url":"1#Wrath%20of%20the%20Black%20Manta%20%28Europe%29.nes","filesize":262160,"score":6.3,"genres":"Action > Side view > Arcade > Platform","desc":"<p>New York is being overrun with crime, and the city's children are mysteriously disappearing. It is up to the Black Manta to rescue the children and stop whomever is behind this. In addition to his ninja skills, Black Manta will be able to acquire additional powers (including invisibility and teleportation) to help him out against the numerous and well-armed villains. </p><p><em>Wrath of the Black Manta</em> is a side-scrolling arcade-style action game with five different levels. Throughout each level the player may come across various clues to help him find where to go next, or discover a hidden location. Some of the bad guys Black Manta comes across may also possess useful knowledge and can be interrogated if they don't kill him first.</p>"},{"name":"Wrecking Crew","year":1985,"developer":"Nintendo Co., Ltd.","url":"1#Wrecking%20Crew%20%28World%29.nes","filesize":40976,"score":6.4,"genres":"Action > Arcade > Platform > Puzzle elements","desc":"<p><em>Wrecking Crew</em> is a platform action game for one or two players. Players control Mario and Luigi, who need to demolish various buildings. After each wall in the building has been destroyed, players move on to the next (and more difficult) building. Many of the buildings have a puzzle element to them; players may need to find the path to reach all of the walls without the heroes getting trapped at a dead end. Wandering throughout the buildings are dangerous creatures and the construction foreman, all of whom will stop Mario and Luigi from completing their task. The game features 100 levels. A construction set is included, allowing players to create and play their own buildings.</p>"},{"name":"Wurm: Journey to the Center of the Earth","year":1991,"developer":"Cyclone System"},{"name":"WWF King of the Ring","year":1993,"developer":"Eastridge Technology","url":"2#WWF%20King%20of%20the%20Ring%20%28Europe%29.zip","filesize":1,"score":5.9,"genres":"Sports > Diagonal-down > 2D scrolling > Wrestling > Licensed","desc":"<p><em>WWF King of the Ring</em> is a wrestling game that uses the World Wrestling Federation license. Each wrestler possesses personal attributes in three categories: strength, speed, and stamina. The wrestlers share the same set of moves, consisting of punches, kicks, body slam, throw, dropkick, suplex, stomps, elbow drops, and a move off the turnbuckle. There are no signature moves unique to each wrestler. </p><p>There are eleven wrestlers in total: Hulk Hogan, Randy Savage, Lex Luger, Yokozuna, Razor Ramon, Bret Hart, Shawn Michaels, Mr. Perfect, Bam Bam Bigelow, The Undertaker (the last two are absent from the GameBoy version), and a wrestler the player can create with custom attributes. The game features one-on-one matches, championship matches, tag team matches, and the King of the Ring tournament.</p>"},{"name":"WWF WrestleMania","year":1989,"developer":"Rare Limited","url":"3#Wrestlemania/Wrestlemania.nes","filesize":131088,"score":5.3,"genres":"Sports > Side view > Fixed / flip-screen > Wrestling > Licensed","desc":"<p><em>WWF Wrestlemania</em> is a wrestling game using the World Wrestling Federation (WWF) license. The game features six popular WWF wrestlers:Hulk Hogan, André the Giant, \"Macho Man\" Randy Savage, The Honky Tonk Man, Bam Bam Bigelow, and \"The Million Dollar Man\" Ted DiBiase.</p><p>All the wrestlers can execute basic punches, kicks, and headbutts; turnbuckle moves and bodyslams can only be performed by particular wrestlers. Different wrestlers may use different moves with varying frequency, reflecting the preferences of their real-life counterparts. Wrestlers might also become angry (turning red on the screen), entering a rage state during which their attack power improves. Character-specific health power-ups will sometimes appear on the ring, and can be collected by corresponding wrestlers.</p><p>The two gameplay modes include a single exhibition match (one player versus the computer or two players against each other), and a tournament. In a single player tournament, the player chooses one wrestler and must defeat the other five in a series of matches to win the championship. In a tournament with up to six player-controlled wrestlers, each wrestler faces every other wrestler one time, for a total of fifteen matches.</p>"},{"name":"WWF WrestleMania Challenge","year":1990,"developer":"Rare Limited","url":"2#WWF%20Wrestlemania%20Challenge%20%28Europe%29.zip","filesize":1,"score":6.8,"genres":"Sports > Diagonal-down > Isometric > Wrestling > Licensed","desc":"<p><em>WWF Wrestlemania Challenge</em> features many of the WWF greats, such as Ravishing Rick Rude, The Big Boss Man, Andre The Giant, \"The Macho Man\" Randy Savage, Hulk Hogan, \"Hacksaw\" Jim Duggan, Brutus \"The Barber\" Beefcake, and The Ultimate Warrior. The player can go through a small career trying to become the WWF Wrestling Champion by playing as himself. There are also one-on-one playdowns, as well as Tag Teams (two versus two). The survivor series is where three wrestlers take on three others, and the last team standing after the other has been eliminated is the winner.</p>"},{"name":"WWF WrestleMania: Steel Cage Challenge","year":1992,"developer":"Sculptured Software, Inc.","url":"3#WrestleMania_Steel_Cage_Challenge/Wrestlemania_steel_cage_challenge.nes","filesize":393232,"score":6.2,"genres":"Action > Sports > Diagonal-down > Wrestling > Martial arts","desc":"<p><em>WWF Wrestlemania: Steel Cage Challenge</em> features several famous WWF stars, such as \"Macho Man\" Randy Savage, Bret \"Hitman\" Hart, The Mountie, The Undertaker, Irwin R. Schyster, \"Million Dollar Man\" Ted DiBiase, Sid Justice, \"Rowdy\" Roddy Piper, Jake \"The Snake\" Roberts and of course wrestling legend Hulk Hogan.</p><p>All wrestlers can perform their famous signature moves and have individual strengths and weaknesses. Game modes include a career mode and several modes for two players, including the name giving steel cage challenge.</p>"}]