[{"name":"Xenophobe","year":1988,"developer":"Bally Midway Mfg Co.","url":":Xenophobe (USA)","filesize":43699,"score":5.8,"genres":"Action > Side view > Fixed / flip-screen > Shooter > Sci-fi / futuristic","desc":"<p>Xenos. The very name strikes fear into every colonist's heart. A distress call is received from space stations orbiting your homeworld, then silence. A single ship escapes, piloted by a battered man who tells the tale of pods that hatch into acid-spitting Xenos. A small band of engineers has been dispatched to combat the Xeno threat before it takes over all the space stations and, eventually, your homeworld. </p><p><em>Xenophobe</em> is a side-scrolling shooter with platform elements. Assemble your band of engineers and fight the Xenos on each station, striving to either clear it or abandon it. You start out with a standard issue laser, but can pick up additional weapons as you find them, including Phasers, Lightning Rifles, Poofer guns, and bombs.</p>"},{"name":"Xevious","year":1984,"developer":"Namco Limited","url":":Xevious (Europe)","filesize":24766,"score":7.3,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>A hundred thousand years ago, an ancient civilization prospered on our Earth, their product being GAMP (General Artificial Matrix Producer). In order to survive the Ice Age, most of the Earth's inhabitants have decided to leave it, finally settling on a planet called Xevious. A group of humans remained, becoming our own ancestors. Many years have passed, and the Xevians are now planning a massive comeback to their long-lost homeland. The pilot Mu, his android companion Eve, and Mio, a Xevian who opposes the GAMP regime, are back from a space travel just in time to warn the Earth of the upcoming invasion. The prototype fighter craft Solvalou is going to be used as the main weapon against the Xevian attack.</p><p><em>Xevious</em> is a vertically-scrolling shooter which is notable for being the first game of that type to feature an aircraft flying over the Earth (as opposed to the outer space in other games), displaying views of South American nature. It also introduced, for the first time, two types of enemies to fight: aerial and ground-based (the menacing SOL towers invoked by GAMP to aid their planes). The player-controlled ship, Solvalou, is equipped with two weapons, each assigned to a button: the Zapper for air enemies, and the Blaster, which drops bombs on ground targets with the aid of a lock-on. The aerial enemies are divided into sub-categories distinguished by their attack and behavior patterns. Certain enemy types are immune to Solvalou's weapons, and must be avoided.</p>"},{"name":"XexYZ","year":1989,"developer":"Atlus Co., Ltd.","url":":Xexyz (USA)","filesize":129588,"score":6.7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Fantasy > Sci-fi / futuristic","desc":"<p>It's the year 2777. Due to nuclear wars and natural disasters, Earth's population has decreased dramatically and only five island are left, forming the nation of Xexyz. In Xexyz, humans, spirits and faeries have lived peacefully for centuries under the reign of King Xeu Star. One day, Xexyz is attacked by Goruza who murders the king, builds mechanical castles on each island and captures the queen of each island. You take on the role of a soldier named Apollo who wants to put an end to Goruza's reign.</p><p>Controlling Apollo, it is your task to free all five islands. Freeing an island is done in several different phases that feature 'Jump'n Shoot' as well as 'Shooter' levels (called \"Action Mode\" and \"Shooting Mode\"). The first level of each island is a Jump'n Shoot level that contains many doors to shops, bonus games, friendly NPCs or mid-bosses. NPCs will sometimes give you important hints, items or weapons; bonus games can be played to win some money (\"Balls\"); defeating mid-bosses (and thereby freeing a Fairy) will get you a cash reward and shops also offer weapons and items. Weapons differ largely in attack power and range. Items have temporary effects such as invincibility or improved jumping abilities. In an island's first level, you will have to find a secret room and defeat a boss, for which you will receive a Force Star that is needed to gain access to a mechanical castle. Mechanical castles look similar to other Jump'n Shoot levels but are more complex.</p><p>Once you have made your way to a \"Cyborg Rider\", a self-scrolling Shooter sequence starts in which you have to shoot your way through lots of enemies while picking up speed and weapon power-ups.At the end of this sequence you will leave the Cyborg Rider, and step onto a floating platform for a boss fight. After the boss is defeated, another Shooter sequence with another boss at the end awaits, but this time, the boss if fought from the Cyborg Rider. After defeating this boss, you start the process over with a Jump'n Shoot level. </p>"}]