[{"name":"Yamamura Misa Suspense: Kyōto Zai-tech Satsujin Jiken","year":1990,"developer":"Tose Co., Ltd."},{"name":"Yeah Yeah Beebiss II","year":2021,"developer":"Rigg'd Games"},{"name":"Yie Ar Kung-Fu","year":1985,"developer":"Konami Industry Co. Ltd."},{"name":"Yo! Noid","year":1990,"developer":"Now Production Co., Ltd.","url":":Yo! Noid (USA)","filesize":129969,"score":6.4,"genres":"Action > Side view > 2D scrolling > Platform > Licensed > Regional differences","desc":"<p>The Noid, the mascot from Domino's Pizza commercials during the 1980s, is in trouble. There is another Noid named Mr. Green, running through New York City playing practical jokes and causing trouble, but everyone is blaming the Noid for these shenanigans. Now the Noid must clear his name and save the city by catching this impostor.</p><p>It is another 2D jump and run platform for NES, but with a strange idea and cartoonish and cheerful graphics. The weird character has to beat pizza delivery boys using a yo-yo.</p>"},{"name":"Yōkai Club","year":1987,"developer":"Tose Co., Ltd."},{"name":"Yōkai Dōchūki","year":1988,"developer":"Namco Limited"},{"name":"Yoshi","year":1991,"developer":"Nintendo Co., Ltd.","url":":Yoshi (USA)","filesize":39586,"score":6.2,"genres":"Puzzle > Real-time > Falling block puzzle","desc":"<p>You have to help Mario cope with falling Goombas, Bloopers, Boo Buddies, and Piranha Plants. As they fall, catch them on trays. Switch and shuffle them to save the day. Stack two of a kind and they both disappear. Or capture a whole bunch between two eggshell halves. A different kind of Yoshi will appear depending on how many enemies are between the eggshell halves. There is a password feature to save your progress.</p>"},{"name":"Yoshi's Cookie","year":1992,"developer":"Tose Co., Ltd.","url":":Yoshi's Cookie (USA)","filesize":70637,"score":7.2,"genres":"Puzzle > Fixed / flip-screen > Real-time > Turn-based > Falling block puzzle > Tile matching puzzle > Point and select","desc":"<p><em>Yoshi's Cookie</em> is a fast-paced puzzle game. The player moves randomly placed cookies into rows and columns of cookies with similar patterns. When a row or column of the same cookies is successfully assembled, the line will disappear, and the player can begin to work on a new row or column. The \"Yoshi\" cookie is very special in both the 1-player and the 2-player game. Since this cookie is the key to both games, it should be used wisely.</p><p>The SNES version has an additional puzzle mode where players have to clear the game board in a limited number of moves. There are 100 unique puzzles in this mode.</p>"},{"name":"Young Indiana Jones Chronicles, The","year":1992,"developer":"Jaleco Ltd.","url":":Young Indiana Jones Chronicles, The (USA)","filesize":138031,"score":"","genres":"Action > Side view > 2D scrolling > Platform > World War I > Licensed","desc":"<p><em>The Young Indiana Jones Chronicles</em> is based on the television series of the same name, which is in turn based on the Lucas/Spielberg movie franchise starring Harrison Ford. In this game, a young Indiana Jones embarks on globetrotting adventures in which he gathers treasure and fights for what is good and right.</p><p>The game features side-scrolling action where young Indy trots along the ground, jumps, crawls flat, and can collect and wield a variety of weapons against copious enemies in the game. Indy starts with a whip and can find such weapons as throwing knives, grenades, pistols, rifles, and others. He can also collect hat powerups which allow him to sustain more damage.</p>"},{"name":"Ys II: Ancient Ys Vanished - The Final Chapter","year":1990,"developer":"Nihon Falcom Corp."},{"name":"Ys III: Wanderers from Ys","year":1991,"developer":"Nihon Falcom Corp."},{"name":"Ys: The Vanished Omens","year":1988,"developer":"Nihon Falcom Corp."},{"name":"Yume Kōjō: Dokidoki Panic","year":1987,"developer":"Nintendo Co., Ltd."},{"name":"Yume Penguin Monogatari","year":1991,"developer":"Konami Industry Co. Ltd."},{"name":"Yun","year":2016,"developer":"The Mojon Twins"},{"name":"Yūshi no Monshō: Deep Dungeon","year":1987,"developer":"Humming Bird Soft"}]