[{"name":"Zanac","year":1986,"developer":"Compile","url":":Zanac (USA)","filesize":42928,"score":7.5,"genres":"Action > Top-down > 2D scrolling > Shooter","desc":"<p>Millennia ago, a device known as The System was created by an ancient alien race. This device was told to contain ultimate knowledge and wisdom; however, only those aware of its secrets could hope to choose the right approach towards it. Should The System be accessed the wrong way, it would transfer itself into an instrument of immense destruction. Human beings took that risk, and were punished: The System activated its defense mechanism, and used its weapons against the human race. Years have passed, and the humans managed to learn the techniques contained within The System. Now only one task was left: to shut down The System itself...</p><p><em>Zanac A.I.</em> is a 2D vertically scrolling shooter. You are flying the fighter AFX-6502 Zanac, a space ship built by 256 Riot Fleet as man's last hope against total annihilation. On board are special weapons to help you blast your way through twelve screens of enemy creatures and destroy The System's home base. Zanac is divided into 12 \"areas\", which look like planets. The various locations range from deserts to jungles and from oceans to industrial zones.</p><p>The game has many different types of enemies. Its artificial intelligence program can intensify the action based upon your level of skill. The better you are, the more powerful The System is. The behavior of the randomly approaching enemies is based on factors such as the position of your ship on the screen, the place you last died, etc. The shooting speed of regular enemies and bosses varies as well. At the end of each area (level) you'll have to fight the area boss. Area bosses are mainly presented large, screen-filling bunker bases consisting of gun turrets and a \"core\". You also have limited time for fighting against the area boss; running out of time could lead to failure in entering the next stage, and penalty of more and more enemies attacking.</p>"},{"name":"Zelda II: The Adventure of Link","year":1987,"developer":"Nintendo Co., Ltd.","url":":Zelda II - The Adventure of Link (USA)","filesize":89341,"score":7.2,"genres":"Action > Side view > Top-down > 2D scrolling > Metroidvania > Puzzle elements > Direct control > Fantasy","desc":"<p>Link has just turned sixteen, and discovers a strange birthmark on his hand. With the help of Impa, Zelda's nursemaid, Link learns that this mark is the key to unlock a secret room where Princess Zelda lies sleeping. When young, Princess Zelda was given knowledge of the Triforce of power which was used to rule the kingdom of Hyrule, but when a magician unsuccessfully tried to find out about the Triforce from Zelda, he put her into an eternal sleep. In his grief, the prince placed Zelda in this room hoping she may wake some day. He ordered all female children in the royal household to be named Zelda from this point on, so the tragedy would not be forgotten. Now, to bring Princess Zelda back, Link must locate all the pieces of the Triforce which have been hidden throughout the land.</p><p>Each piece of the Triforce is in a temple guarded by a powerful monster which must be defeated. At the same time, Ganon's underlings are still around and gaining in strength and number. It is said Ganon could be brought back to life by sprinkling the blood of the one who defeated him on the ashes - which was Link himself.</p><p><em>Zelda II: The Adventure of Link</em> is an action role-playing game, and a sequel to The Legend Of Zelda. The gameplay alternates between a top-down view (when traveling the land) and side-scrolling perspectives (when fighting, in a temple, or town). In the top-down view, Link cannot do much except for walking: in the side-scrolling action view, however, he can fight, cast spells, collect items and talk to people. </p><p>When Link encounters an enemy in the wilderness, or enters a location which contains enemies, he can fight them with his sword. If Link is at full health, his sword can be thrown, but when he is hurt, he can only fight in melee. Link has a shield which protects him against some of the enemies' attacks if they strike the shield. Touching an enemy or getting hit by their attacks decreases Link's health. If he runs out of health, he loses a life. If he loses all his lives, it's Game Over. Link can replenish his health completely by encountering a fairy in the wilderness, or by using the services of a healer in a town. </p><p>Link also has a \"magic\" meter. He can cast spells (as long as he has learned them) if he has some magic power left. Spells cost a various amount of magic power. They have various effects: they cure Link, allow him to jump very high, shoot fireballs etc. The magic power meter can be refilled by collecting blue and red jars sometimes left behind by enemies. </p><p>When Link slays an enemy, it might leave behind an item, or give Link some experience. When Link gains enough experience, he gains a level, which allows him to buy weapon power, maximum magic, or maximum health upgrades for his experience points. The player can also decide not to buy anything and stockpile his experience points for later use. </p><p>There are some items to be found that are necessary to get past certain points in the game. <em>The Adventure of Link</em> features a battery backup so games can be saved without needing a password system.</p>"},{"name":"Zen: Intergalactic Ninja","year":1993,"developer":"Konami Co., Ltd.","url":":Zen - Intergalactic Ninja (Europe)","filesize":171726,"score":7.5,"genres":"Action > Side view > Isometric > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>Zen: Intergalactic Ninja</em>, based on a comic book of the same name, is a story about a militant environmentalist ninja named Zen. He has been assigned by a group a green, pointy-headed aliens to come to earth and stop environmental pollution by any means necessary. Eventually, he will have to find the big polluter, Lord Contaminous. The gameplay consists of side scrolling and isometric 3D scrolling action. Zen can run, jump, slice with this stick, or use powerups as the game requires.</p><p>One stage has Zen planting time bombs in a toxic factory and attempting to escape within 99 seconds. Standing in his way are roving lasers, security robots, and floating conveyor belts. The second stage takes place in an acid rain-drenched forest. Zen must revive the flowers in the forest with his photon stick while beating off acid rain-spewing floating mechanical devices.</p><p>The next stage takes place on an off shore oil rig that is going up in flames. Zen must grab fire extinguisher powerups and rescue trapped rig workers while dodging sentient oil slicks and raining fireballs. Another stage is called the High Speed Railway stage. The goal is to stop the garbagemen spreading nuclear waste. Zen is in a mining cart racing underground and fighting other enemies in carts. Zen can make this cart jump, which we will have to do often in order to survive the dangers of the mine.</p>"},{"name":"Zoda's Revenge: Star Tropics II","year":1994,"developer":"Nintendo R&D3","url":":Zoda's Revenge","filesize":295984,"score":7.1,"genres":"Action > Diagonal-down > 2D scrolling > Platform","desc":"<p>The young Mike Jones receives a telepathic message from Mica, the princess of the Argonians, whom he had rescued in the previous game. She tells Mike how to decipher a code that he and his uncle Dr. J found on the Argonian space pod. The archaeologist and his nephew read the deciphered message aloud, which teleports Mike into the Stone Age. While helping the natives, Mike discovers a strange object which Mica identifies as a \"Tetrad\". These Tetrads are scattered across different time periods, and Mike has to find them in order to help the Argonians. However, an unpleasant surprise awaits the hero: the antagonist Zoda appears to be alive and well during the same time period as the famous detective Sherlock Holmes, and is hunting for the Tetrads himself...</p><p>Like its predecessor, <em>Zoda's Revenge: Star Tropics II</em> merges action-oriented combat with light RPG elements. Mike will travel to different time periods, communicate with various characters (some of which are real historical figures), solve mysteries, and fight regular enemies as well as bosses. Mike has a larger arsenal of weapons at his disposal this time, including an axe, a dagger, and a katana. He also learns an upgradable projectile magic called Psychic Shock Wave. As in the previous game, Mike's health is measured in hearts; similarly to Zelda games, their amount can be raised during the game.</p>"},{"name":"Zoids: Chūō Tairiku no Tatakai","year":1987,"developer":"Micronics"},{"name":"Zoids: Mokushiroku","year":1990,"developer":""},{"name":"Zombie Hunter","year":1987,"developer":"Hi-Score Media Work Corp.","url":":Zombie Hunter (Japan)","filesize":80392,"score":"","genres":"Action > Role-playing (RPG) > Side view > Platform > Direct control > Fantasy","desc":"<p>The city of Palma has always been protected by the spirits of the four elements. However, Dolgo, the spirit of the earth, revolts and makes off with the Life Seeker, the controller of the world's life energies, to his underground lair. In doing so, the people of Palma begin to lose their very souls. The spirit of the air has ordered that a champion needs to be found, to retrieve the Life Seeker from the clutches of Dolgo. You are that champion.</p><p><em>Zombie Hunter</em> is an action role-playing game, somewhat similar to Zelda II with its side-scrolling battles. You receive experience from defeating your enemies and you have an inventory complete with armor and weapons.</p>"},{"name":"Zombie Nation","year":1990,"developer":"Live Planning","url":":Zombie Nation (USA)","filesize":132167,"score":6.4,"genres":"Action > Side view > Arcade > Shooter > North America > Horror > Regional differences","desc":"<p>In 1999 a mysterious object crashes into the desert and a mysterious creature, Darc Seed appears. Using magnetic powers, he soon turns the people of the United States into zombies and exerts influence over various weapons and objects. Among the weapons Darc Seed claims is the legendary samurai sword, Shura. When the great head of the samurai, Namakubi hears about this, he sets out for the United States to defeat Darc Seed and reclaim the sword.</p><p><em>Zombie Nation</em> is a side-scrolling shooter in which the player can control Namakubi's movement across the screen and the ability to shoot. The hero's designation as a \"great head of the samurai\" is to be taken literally: Namakubi is indeed a giant disembodied head. His main weapon is the ability to shoot projectiles from his eyes and bombs from his mouth which he fires at various enemies, objects and buildings. Furthermore, should a zombie hostage fall out a window he can rescue them to slowly power up his attacks. Enemies reduce health by varying amounts; health can be restored by increasing the player's score. The game features four distinct stages with two difficulty settings.</p>"},{"name":"Zunō Senkan Galg","year":1985,"developer":"dB-SOFT"}]