[{"name":"007: Agent Under Fire","year":2001,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART1/007%20-%20Agent%20Under%20Fire%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CNl%2CSv%29.zip","filesize":3327054715,"score":7.2,"genres":"Action > 1st-person > Shooter > Spy / espionage > Licensed","desc":"<p><em>007: Agent Under Fire</em> is the first James Bond game to appear on the PlayStation 2, GameCube, and Xbox. The game casts the player as the legendary James Bond who must accomplish missions throughout different areas of the world. Bond is sent on a mission rescue Zoe Nightshade, a CIA agent in the hands of Nigel Bloch. Nigel Bloch is the CEO of Identicon, a section of a highly successful industry company known as Malprave industries. Bond is also tasked to retrieve the set of DNA samples that are in Identicon's hands. So James Bond sets off on another adventure...</p><p>The game combines three game modes into one package: first-person-shooter, which is what most of the missions are, a rail-shooter, where the player only controls firing, and a driving game, where the player drives one of the many Bond cars. Numerous weapons have been added to the series, along with some fictional weapons like the Photon cannon and the 5-way grenade launcher. The player can utilize a wide array of gadgets and weapons, like the Q-Claw, Q-Decoder, and Bond's trusty Walther handgun. There is a large variety of missions, and Bond can go through most missions with weapons, or take a stealthy approach. The player is also rated in each level, based on score and difficulty level, and can unlock new features for both single and multiplayer.</p>"},{"name":"007: Everything or Nothing","year":2004,"developer":"Electronic Arts Redwood Shores Studio","url":"PS2_COLLECTION_PART1/007%20-%20Everything%20or%20Nothing%20%28Europe%29%20%28En%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":2742875128,"score":7.9,"genres":"Action > Behind view > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>A nanobot has been stolen from the work of a world-renowned scientist, Dr. Katya Nadanova, of the Oxford Department of Microtechnology by a man known only as \"the General\", who has kidnapped Dr Nadanova as well. James Bond races to rescue both the scientist and to retake the nanobots, and kills the General along with the nanobot samples. Bond returns Katya to a nearby base, but it turns out the scientist has not been so faithful to Oxford. Katya meets up with Nikolai Diavolo and gives him a hidden vial of the nanobots. Before long Bond is yet again called into action when MI6 loses contact with 003. And so Bond is off to Peru... </p><p><em>Everything or Nothing</em> is the second of the James Bond third-person shooters, after Tomorrow Never Dies for the Playstation. The game features new guns and a new and improved aiming system which allows you to strategically hug walls and fire around or crouch behind cover. New gadgets allow Bond to go invisible, disrupt electronics, or control mechanical spiders which allow him to access new areas. <em>Everything or Nothing</em> is also the first game where Pierce Brosnan actually supplies his voice for the likeness of his character. Many other actors from the Bond film series such as Judi Dench and John Cleese do likewise.</p><p>The game features a campaign with over 30 missions and a brand new co-op game where you take the roles of newly recruited MI6 agents on investigations of their own. EON also includes a same-screen deathmatch that allows for up to four players to play.</p>"},{"name":"007: From Russia with Love","year":2005,"developer":"Electronic Arts Redwood Shores Studio","url":"PS2_COLLECTION_PART1/007%20-%20From%20Russia%20with%20Love%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":2434754579,"score":7.1,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>Building on 007: Everything or Nothing's range of strengths, <em>007: From Russia with Love</em> is based on the 1963 film starring Sean Connery as James Bond. He is sent to Istanbul to acquire the Russian decoder machine known as the Lektor from a (supposedly) defecting Russian agent by the name of Tatiana Romanova. However, the Russians have no knowledge of this plan because it is a trap for James Bond created by the criminal organization known as Octopus. It is up to James Bond to seize the device and confront the dangerous assassin Red Grant and the ruthless Rosa Klebb.</p><p>In most of the 18 missions, the player progresses through linear levels while shooting everything in sight. The player can lock onto an enemy at range and cycle between visible enemies, or focus in closer on a single enemy to make opportunistic targets appear, such as uncovered grenades or gaps in armor. Sometimes Bond can also use stealth or hand-to-hand combat, which are basically quick-time events where the player needs to press a displayed button in a limited time to dispatch a foe. Special tasks can be performed with gadgets, e.g. the laser watch or a small remote-controlled helicopter. This procedure gets spiced up with occasional driving or new jet pack sequences.</p><p>The player gets rewarded for certain actions with bonus points, e.g. succeeding in melee combat or searching containers. There are three different kinds of points that unlock different things: bonus content like making-of videos, bonus levels, and weapon upgrades. Every weapon and gadget can be upgraded in different areas, but only once.</p>"},{"name":"007: Nightfire","year":2002,"developer":"Eurocom Developments Ltd","url":"PS2_COLLECTION_PART1/007%20-%20Nightfire%20%28Europe%29%20%28En%2CFr%2CIt%2CNl%2CSv%29.zip","filesize":3369292534,"score":7.4,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>You take on the role of James Bond and must save the world. The Phoenix International Corporation is focused on dismantling nuclear warheads throughout the world, but later evidence has been found that the CEO of the corporation, Raphael Drake, is using his company's concept as a means to find and use the warheads for his own purposes. Because his plans are so well hidden, it is up to Bond, with the help of Q and his gadgets, to stop Drake at whatever cost.</p><p>Throughout the game, you will be taken to more than ten exotic areas, reaching all areas of the globe, confronting the beautiful Bond women. In your quest to stop the Phoenix Corporation, you have a variety of weapons available to you, from your trusty Walther to more advanced and prototype machinery.</p><p>There are twelve total missions, all of which combine stealth, combat, and Q's trusty gadgets, such as your laser watch and X-ray eyeglasses.'</p><p>There are five levels that take place in your Aston Martin V12 Vanquish, and other exotic but deadly sports cars. These missions aren't available in the computer version of the game, instead the Windows version has some other bonus missions.</p><p>On the multiplayer side of things, there are over ten multiplayer modes, some of which include characters and settings from previous Bond moves.</p>"},{"name":"007: Quantum of Solace","year":2008,"developer":"Eurocom Developments Ltd","url":"PS2_COLLECTION_PART1/007%20-%20Quantum%20of%20Solace%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2142804624,"score":7,"genres":"Action > Behind view > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>007: Quantum of Solace is a 2008 shooter video game published by Activision. It is based on the James Bond films Casino Royale (2006) and Quantum of Solace (2008).</p>"},{"name":"10 Pin: Champions Alley","year":2005,"developer":"Atomic Planet Entertainment Limited","url":"PS2_COLLECTION_PART1/10%20Pin%20-%20Champions%20Alley%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":72698099,"score":"","genres":"Sports > Behind view > Turn-based > Direct control > Bowling","desc":"<p>Roll into action with 10 Pin: Champions Alley, the easy to play bowling game that lets you play alone or with up to seven friends.</p><p>This product is an emulated version of a PlayStation®2 game. Some functionality, including online functionality, may vary from the original PS2™ version of this product or may not be available.</p><p>Download of this product is subject to the Sony Entertainment Network Terms of Service/User Agreement and any specific additional conditions applying to this product. If you do not wish to accept these terms, do not download this product. See Terms of Service for more important information. One time fee for use of downloads on up to 2 activated compatible Home Console* systems.</p>"},{"name":"10.000 Bullets","year":2005,"developer":"Blue Moon Studio","url":"PS2_COLLECTION_PART1/10.000%20Bullets%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1626845468,"score":"","genres":"Action > Behind view > Shooter","desc":"<p>Crow is a hitman who lives in Ireland. His mother was a fortune teller who possessed mysterious powers and was killed when Crow was very young. The boy was adopted by a mob boss known as Papa Tonia. Crow inherited from his mother a unique ability to slow down time, which he trained to become a feared assassin. However, his main goal in life is to find who killed his mother, and exact his revenge.</p><p><em>10.000 Bullets</em> is a 3D third-person shooter. The player controls Crow as well as three other characters during the course of the game. The slowdown ability is similar to the bullet time effect used in Max Payne, but can be eventually upgraded so that the player character himself can move at normal speed while everything around him freezes. Killing several enemies in close succession awards the player bonus points, which can be used between levels to upgrade the protagonist's health as well as teach him special offensive and evasive manoeuvres. There are also short adventure-like sequences requiring the player to talk to characters to advance the plot.</p>"},{"name":"120 Yen no Haru - 120 Yen Stories","year":2005,"developer":"Nekoneko Software","url":"sony_playstation2_numberssymbols/120%20Yen%20no%20Haru%20-%20120%20Yen%20Stories%20%28Japan%29.zip","filesize":974035531,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Romance","desc":"<p><em>¥120 Stories</em> is a non-adult visual novel that originated on PlayStation 2 which features four separate romantic stories, each of which is revolving around something costing only 120 yen. Each story is told in a different setting and during a different season, starting with the winter one and continuing onto autumn, summer, and spring one. Each story features new protagonist and new heroine and is split in short chapters. While the game does offer save feature at any point in the story, ending of each chapter in the story will prompt to save your game progress. The game features voice-acting for heroine characters, and contains some of the typical visual novel gameplay features such as conversation log, ability to change text font, text background transparency, adjust reading speed and other similar things. Bonus features include music player, and unlockable CG gallery and recollection modes.</p><p>Story premises by season entail the following:</p><ul><li>Spring story tells of a young boy who moved to countryside where he met a girl.</li><li>Summer story tells of encounter which occurred at the vending machine.</li><li>Autumn story takes place in a city where a boy decides to help a girl in distress.</li><li>Winter story revolves around a boy meeting a girl on a train as she lost her contact lens.</li></ul>"},{"name":"12Riven - The Psi-Climinal of Integral","year":2008,"developer":"KID Corp.","url":"sony_playstation2_numberssymbols/12Riven%20-%20The%20Psi-Climinal%20of%20Integral%20%28Japan%29.zip","filesize":2356590866,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p>On May 20th, 2012, high school student Renmaru Miyabido receives an ominous message on his phone warning him that his friend Myu Takae will die atop the abandoned Integral building at noon. Meanwhile, police detective Narumi Mishima receives another message, apparently from her old classmate Makoto Yukizumi, which asks her to save Myu's life. According to the message, Myu's death will result in the success of the 'Second Eclipse Plan' - a plot by unknown conspirators that would bring about the destruction of time. Rushing to Integral, Renmaru and Narumi soon find themselves in a race against time to save Myu - and possibly the world.</p><p><em>12Riven: The Ψ Climinal of Integral</em> is a science fiction visual novel and the fourth instalment of the Infinity series. The story is told from the perspective of both Renmaru and Narumi and the player assumes the role of both characters at different points in the game. The gameplay consists of reading text overlaid on illustrated backgrounds and making decisions which affect the outcome of the story. There are multiple achievable endings, but only one 'true ending'.</p><p>The PSP port which came a year after the PS2 and Windows versions features new CG event scenes, newly recorded voice-acting and a renewed soundtrack. Some of the older CG events were redrawn due to complaints about their quality in the original PS2 release.</p>"},{"name":"187: Ride or Die","year":2005,"developer":"Ubisoft Paris Studios SARL","url":"PS2_COLLECTION_PART1/187%20-%20Ride%20or%20Die%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2370446528,"score":6,"genres":"Action > Racing / Driving > Behind view > Direct control > Automobile > Vehicular combat","desc":"<p><em>187: Ride Or Die</em> combines fighting and car racing through different game modes, including online play. In all game modes, you have to control both driving and shooting at the same time.</p><p>187 Ride Or Die takes place in the \"gangsta\" universe, where you are \"Buck\", a young thug hired to take out the members of the opposing crew while on the road. The game provides a set of different cars, characters and weapons you can play with. Weapons take a large part in the gameplay: It is quite impossible to win races without using weapons. </p><p>There are alternate mission types such as escort missions, car bomb, police escape (the only mode without weapon), and others. There are also deathmatch modes where the goal is to get the maximum of frags on other cars in arena style maps.</p>"},{"name":"1945 I & II: The Arcade Games","year":2004,"developer":"Psikyo","url":"PS2_COLLECTION_PART1/1945%20I%20%26%20II%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":88331604,"score":"","genres":"Action > Compilation > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic > World War II","desc":"<p>This compilation includes the arcade games <em>Strikers 1945</em> and <em>Strikers 1945 II</em>, though \"Strikers\" was removed from the title everywhere in the game. They are the same ports that where released individually (separate for Japan and the US, both under the name Strikers 1945) for the PlayStation in 2001.</p><p>In 1945 earth is attacked by aliens, conquering most of the planet. US, German, Japan and British forces join together to fight back. At the beginning of the game you get to choose which fighter aircraft you want to use.</p><p>The choices for <em>1945 I</em> are: P-38 (USA), P-51 (USA), Spitfire (UK), Bf-109 (Germany), Zero (Japan) and Shinden (Japan) and for <em>1945 II</em> the aircrafts are: Lightning (USA), Flying Pancake (USA), Focke-Wulf Ta 152 (Germany), Hayate (Japan), Shinden (Japan), Mosquito (UK).</p><p>Each of the planes has some differences between the weaponry, and a different special attack.</p>"},{"name":"2002 FIFA World Cup","year":2002,"developer":"Software Creations Ltd.","url":"PS2_COLLECTION_PART1/2002%20FIFA%20World%20Cup%20Korea%20Japan%20%28Europe%29%20%28En%2CSv%29.zip","filesize":2546116235,"score":7.3,"genres":"Sports > Diagonal-down > Direct control > Multiple units/characters control > Football (European) / Soccer > Asia > Japan (Modern/Futuristic) > Licensed","desc":"<p><em>2002 FIFA World Cup</em> is the official game of the 17th FIFA World Cup, held in Korea and Japan between May 31 and June 30. It is based on the engine of FIFA Soccer 2002, so experienced Fifa players can get used for it quite fast. </p><p>It is based on the 2002 World Cup - Korea and Japan and includes all of the countries who promoted to the World Cup, and a lot more. Small statistics are shown for every country - their last biggest win, appearances at the World Cup, etc.</p><p>The stadium and all players are really detailed. The player's texture's resolution is so high, you can easily recognize most of them. The stadium is big and impressive and full of colored crowd.</p><p>As in <em>FIFA Soccer 2002</em>, the animation was taken from real players, with motion sensors. Thus, some new animation was added - new sliding, falling, and more.</p><p>And the newest feature of <em>2002 FIFA World Cup</em>, is the air ball control model. You can take balls from the air, and have much more control with them - creating great goals from the air.</p>"},{"name":"21 Card Games","year":2005,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART1/21%20Card%20Games%20%28Europe%29.zip","filesize":47138001,"score":"","genres":"Gambling > Strategy > Cards / tiles > Point and select","desc":"<p>21 card games has something for everyone - edge of your seat action with Poker, Luck and Skill with Blackjack or the relaxation of a round of patience - plus many, many more.<p>"},{"name":"24: The Game","year":2006,"developer":"SCE Studio Cambridge","url":"PS2_COLLECTION_PART1/24%20-%20The%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPl%2CCs%2CHu%29%20%28Demo%29.zip","filesize":1102918595,"score":6.4,"genres":"Action > Racing / Driving > Behind view > Puzzle elements > Shooter > Licensed","desc":"<p><em>24: The Game</em> is an action-adventure game based on the Fox TV series. Set in between Seasons 2 and 3 of the TV show, the game allows you to play as Jack Bauer, Kim Bauer, Tony Almeida, Michelle Dessler, and Chase Edmunds with all of the actors of the TV show coming back to reprise their roles through voice acting. The game contains many missions ranging from 3rd-person shootouts and sniper missions to puzzles and interrogation sequences. Written by one of the writers for the TV show, it serves as a bridge to cover many of the missing elements from the TV show between the season 2/3 gap.</p><p>Playing as the TV show's various characters you’ll take part in a action-adventure experience, shooting your way through terrorists, playing puzzle mini-games where you'll defuse bombs and work with various counter-terrorism unit programs, and even interrogate suspects till they crack and give your the information you want to know. You'll know what it's like to step into the shoes of LA's finest CTU agents as yet another large conspiracy unfolds.</p>"},{"name":"25 to Life","year":2006,"developer":"Ritual Entertainment","url":"PS2_COLLECTION_PART1/25%20to%20Life%20%28Europe%29.zip","filesize":1654253544,"score":4.6,"genres":"Action > Behind view > Shooter > Stealth > Crime","desc":"<p><em>25 to Life</em> is set in the urban inner city jungle where you can choose to be either a law enforcer or law-breaker. In single-player mode, you follow the storyline of young Freeze who is trying to survive in the hood and protect his family, or that of Shaun Calderon, a gang leader who had to escape to Mexico. On the other side of the law, you can play the cop Lester Williams whose department is swamped by corruption.</p><p>Whatever you choose, the bulk of the game has to walk through the cities, hide behind corners and then bust out and shoot people. As always, you have an arsenal of weapons and moves at your disposal.</p><p>You can also play online with several people, fighting against each other in teams.</p>"},{"name":"3 LDK: Shiawase ni Narō yo (Shokai Genteiban)","year":2004,"developer":""},{"name":"4x4 Evo","year":2001,"developer":"Terminal Reality, Inc.","url":"PS2_COLLECTION_PART1/4x4%20Evo%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":439597784,"score":7,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Off-roading","desc":"<p><em>4x4 Evo</em> is a racing game featuring real-life pickup trucks and SUV's. Actual trucks from manufacturers such as Chevrolet, Ford, Dodge, Nissan, Toyota and more are included. </p><p>The actual racing game is based very heavily on Terminal Reality's Monster Truck Madness series of games, except with SUV's instead of monster trucks.</p><p>One significant feature of <em>4x4 Evo</em> is the online multi-player option. The Dreamcast, PC, and Macintosh versions can compete against each other in 4 player online races.</p><p>In addition to the on-line mode of play, there is a single player career mode. The career mode gives you a small allotment of money with which to purchase a truck. You then can compete in races to earn more money for more trucks or performance parts for your current truck.</p>"},{"name":"4x4 Evo 2","year":2003,"developer":"Terminal Reality, Inc.","url":"PS2_COLLECTION_PART1/4x4%20Evo%202%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":259153210,"score":6.8,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Automobile > Off-roading > Vehicle simulator > Licensed","desc":"<p><em>4x4 Evo 2</em> is a sequel to the 2000 release 4x4 Evo. This game is very similar to its predecessor, but now it appears on newer platforms and has more trucks, and many more tracks.</p><p>The trucks in this game are licensed likenesses of trucks you may see driving down the streets of suburban America. You can purchase a truck in career mode, and then trick it out with custom parts to turn it into an off-road monster.</p><p>The career mode from 4x4 Evo is again the main focus of 4x4 Evo 2. This time, crazy missions provide for an alternative to the races found in the rest of the game. For example, you may find yourself using your truck to track down lost gold or locate misplaced outhouses.</p><p>The GameCube version features four exclusive tracks and four exclusive trucks.</p>"},{"name":"50 Cent: Bulletproof","year":2005,"developer":"Genuine Games, Inc.","url":"PS2_COLLECTION_PART1/50%20Cent%20-%20Bulletproof%20%28Europe%29.zip","filesize":5781448440,"score":5.4,"genres":"Action > Behind view > Shooter > Licensed","desc":"<p>This game lets you step into the footsteps of 50 Cent himself. As he tries to free the kidnapped K-Dog with his crew in the streets of New York City, 50 gets shot nine times (just like his real-life counterpart) and left for dead. After getting stitched up, he sets out to find those who tried to kill him and uncovers a bigger conspiracy.</p><p>The game is a 3rd-person shooter with all the typical features: You have a wide array of weapons (including akimbo shooting), there are over 25 moves to finish people off at close range, you can find money to buy health packs, armor, and other helpful items. You can grab enemies and use them as human shields and use mobile objects (like dumpsters on wheels) as cover. The game uses the havok physics engine for a more dynamic environment.</p><p>In many missions, you'll be rolling with your crew, the G-Unit: Lloyd Banks (as a locksmith), Young Buck (weapons expert), and Tony Yayo (the demolition man). They will provide back-up and perform tasks that are necessary to complete objectives.</p><p>The game comes with lots of additional material too (some of it unlockable), like music videos and 4 CDs worth of music with lots of previously unreleased material. Guest starring are Dr. Dre as Grizz and Eminem as Detective McVicar.</p>"},{"name":"7 Blades","year":2000,"developer":"Konami Computer Entertainment Japan, Inc.","url":"PS2_COLLECTION_PART1/7%20Blades%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":3619703618,"score":"","genres":"Action > Behind view > Anime / Manga > Fantasy","desc":"<p>In the year Kanei 17, the man-made island of Dejima, home of many foreigners, has been brutally attacked by a ninja squad sent by the shogunate. At the same time, a mysterious golden dragon has appeared off the coast of Nagasaki. Hearing of all this, the penniless mercenary Gokurakumaru heads off to Nagasaki with his lover Oyuri and assistant Togizo in hopes of striking it rich. But just what are they getting themselves involved in?</p><p><em>7 Blades</em> is a third-person action-game sequel to the 1990 film <em>Zipang</em> directed by Kaizo Hayashi. The player can choose from two different characters: the womanizing mercenary Gokurakumaru, who uses a variety of swords; and his lover Oyuri, who wields pistols, rifles, and other types of firearms. Each character has their own storyline, which intertwine at various points, and plays very differently by the nature of their weaponry. The game is broken into stages, which each have a specific goal, such as to reach a certain point, defeat all the enemies, or protect another character.</p>"},{"name":"7 Sins","year":2005,"developer":"Monte Cristo Multimedia","url":"PS2_COLLECTION_PART1/7%20Sins%20%28Europe%29%20%28Fr%2CEs%2CIt%29.zip","filesize":350975719,"score":5.6,"genres":"Simulation > 3rd-person (Other) > Real-time > Mini-games > Adult","desc":"<p>In this 3rd person game, you interact with other characters to gain their confidence. Each character has interests that provide different growth on confidence levels. But each one has his own personality and they can stress, depress or excite you more than anyone can afford. To control yourself you can sin: unleash your wrath, lust, or any of the 7 sins to regain self confidence, relax or unstress.</p><p>Some actions lead you to one mini-game: G-point finder, sheep jumping, animal killing spread, visual sniper, beer drinking... they are only some of the minigames.</p><p>Win money, fame and power while seducing, lying, bribing, stealing or anyway you can. If you get the highest level, an image gallery will unlock for you.</p>"},{"name":"7 Wonders of the Ancient World","year":2007,"developer":"Hot Lava Games","url":"PS2_COLLECTION_PART1/7%20Wonders%20of%20the%20Ancient%20World%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":156626295,"score":6.3,"genres":"Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Tile matching puzzle > Point and select > Classical antiquity > Egypt (Ancient) > Middle East","desc":"<p><em>7 Wonders of the Ancient World</em> is a Bejeweled-type puzzle game. The game boards are set against the fabled 7 Wonders of the Ancient World. In the main Story mode you need to build wonders over time one after another starting with The Great Pyramid in Giza then moving to the mysterious Hanging Gardens of Babylon and other wonders. To do so, you will need to match runes on materials blocks to destroy them. After the wonder was opened in story mode it would be available to play in all other modes. There are around 56 levels in the game and 3 difficulty modes to play. Board size and configuration depend on the wonder you're currently trying to build.</p>"},{"name":"Ø Story","year":2000,"developer":"General Entertainment Co., Ltd."},{"name":"Ōkami","year":2006,"developer":"Clover Studio Co., Ltd."}]