[{"name":"A Ressha de Ikō 2001","year":2001,"developer":"Artdink Corporation"},{"name":"A Ressha de Ikō 2001: Perfect Set","year":2002,"developer":""},{"name":"A-Train 6","year":2000,"developer":"Artdink Corporation","url":"PS2_COLLECTION_PART1/A-Train%206%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":468096390,"score":"","genres":"Simulation > Strategy > 3rd-person (Other) > Managerial / business simulation > Train","desc":"<p>In <em>A Train 6</em> your goal as a the head of a major transport company is to build up an effective railway network.</p><p>You will gain the main amount of your income by transporting passengers and cargo. It is also possible to earn money by buying and selling land, housing planning and developing the local industry. It is crucial to keep optimizing the schedules, in order to improve the cost-effectiveness of your transport network.</p><p>The game is completely in 3D and offers 40 trains, each with its individual advantages and disadvantages, such as speed, capacity and costs per mile. The game features a total amount of 80 buildings and allows you to play in 6 different scenarios, all of which include unique tasks and possibilities.</p>"},{"name":"Aa Megami-sama","year":2007,"developer":"Marvelous Entertainment Inc."},{"name":"Abarenbō Princess","year":2001,"developer":"AlfaSystem Co., Ltd."},{"name":"AC/DC Fan Pack","year":2008,"developer":""},{"name":"AC/DC Live: Rock Band - Track Pack","year":2008,"developer":"Pi Studios, LLC.","url":"PS2_COLLECTION_PART1/AC-DC%20Live%20-%20Rock%20Band%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3159582056,"score":6.9,"genres":"Action > Simulation > 3rd-person (Other) > Cinematic camera > Music / rhythm > Licensed","desc":"<p>This is a track pack for the Rock Band games and in the United States it was only available at the Wal-Mart and Sam's Club chains of stores. The original game is not required to play and Volume 2 includes all eighteen songs of the album <em>Live at Donington</em> by rock band <em>AC/DC</em>. Contrary to the other track packs, it does not include many of the regular game features such as avatar customization or online play. The game also includes a code to export the songs to a hard drive for use in other Rock Band games (PS3/Xbox 360). The songs included are:* Back in Black (Live)</p><ul><li>Dirty Deeds Done Dirt Cheap (Live)</li><li>Fire Your Guns (Live)</li><li>For Those About to Rock (We Salute You) (Live)</li><li>Heatseeker (Live)</li><li>Hell Ain't a Bad Place to Be (Live)</li><li>Hells Bells (Live)</li><li>High Voltage (Live)</li><li>Highway to Hell (Live)</li><li>Jailbreak (Live)</li><li>Let There Be Rock (Live)</li><li>Moneytalks (Live)</li><li>Shoot to Thrill (Live)</li><li>T.N.T. (Live)</li><li>The Jack (Live)</li><li>Thunderstruck (Live)</li><li>Whole Lotta Rosie (Live)</li><li>You Shook Me All Night Long (Live)</li></ul>"},{"name":"Ace Combat Zero: The Belkan War","year":2006,"developer":"Namco Bandai Games Inc.","url":"PS2_COLLECTION_PART1/Ace%20Combat%20-%20The%20Belkan%20War%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3274154930,"score":7.5,"genres":"Action > 1st-person > Arcade > Flight / aviation > Vehicular combat","desc":"<p>This sixth installment in the <em>Ace Combat</em> series is a prequel to Ace Combat 5 that tells about the Belkan War eluded to in Unsung War. The story is told through the eyes of a reporter, 15 years after the altercation, uncovering secrets about the Belkan War of how it led to war, the outcome of the nuclear detonations within their borders and a near disastrous secret that nearly led to the destruction of a nation.</p><p>The main game mode is the story mode, in which the player takes control of an Ustio mercenary pilot, call-sign <strong>\"Demon Lord\"</strong>, taking part of the said war, advancing missions and advancing in the story while doing it. The missions can be anything done airborne, and there'll be escort, assault and defence missions amongst others.Like in the previous games, the game isn't about simulation, but fast paced aerial combat in highly powered aircraft.More like <em>Top Gun</em>, and less like real world.</p><p>There are 30 licensed fighter jets to choose from, and as a new gimmick, there is \"Ace Style\" -meter which determines the story as the player see's fit. The player can choose to only take out intended targets and be considered a \"knight\", take out military targets and minimal civilian causalities for a \"soldier\" ranking or be considered a \"mercenary\" where the player can take out damaged aircraft and mass destruction of civilian causalities. As the player plays the game over, the game will adjust to their style, depending on their style the game can send out new and more dangerous squadrons to try and stop the player at any cost.</p>"},{"name":"Ace Combat: Distant Thunder","year":2001,"developer":"Namco Limited","url":"PS2_COLLECTION_PART1/Ace%20Combat%20-%20Distant%20Thunder%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2845114718,"score":8.1,"genres":"Action > 1st-person > Behind view > Shooter > Flight / aviation > Vehicular combat > Licensed","desc":"<p>The continent of Usea was struck by an asteroid, causing the death of half a million people. The neighboring Erusea used this as an opportunity to invade and occupy almost all of Usea. Based on its eastern coast, the Independent States Allied Forces (ISAF) try to regain ground and engage the Eruseans in aerial battles. An elite pilot using the codename Mobius 1 is sent on a number of missions to fight Eruseans and help ISAF to win the war. While performing those missions, Mobius 1 begins to learn about the impact war has on civilians, and the pilots of the opposing side.</p><p><em>Ace Combat 04: Shattered Skies</em> is an aerial combat simulation. It allows the player to participate in semi-realistic dog-fighting with a collection of fighter jets, including the F-22 Raptor, F-16 Fighting Falcon, F-117 Nighthawk, U-2 Dragon Lady, C-130 Hercules and SR-71 Blackbird. Eighteen missions will take the player from search-and-destroy buildings to one-on-one and all-on-all dog-fighting. Along the way it becomes possible to upgrade the fighter with defense systems, deadly weapons, and other accessories.</p>"},{"name":"Ace Combat: Squadron Leader","year":2004,"developer":"Namco Limited","url":"PS2_COLLECTION_PART1/Ace%20Combat%20-%20Squadron%20Leader%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3268127694,"score":8.1,"genres":"Action > 1st-person > Behind view > Shooter > Flight / aviation > Vehicle simulator","desc":"<p>Fifteen years ago, the Belkan Federation began a war of conquest, invading nearby territories. To stop them, a military alliance was set up between the Osean Federation and the Union of Yuktobanian Republics. These two great powers drove the Belkans back but their counter-invasion was cut short when the Belkans detonated 6 nuclear warheads on their own soil, preventing the alliance from advancing on them. This ended the great war and a time of peace has reigned. The Osean and Yuktobanian nations have remained allies. On the small remote, \"Sand Island\", off the western coast of Osea, a skilled veteran of the war named Captain Bartlett (callsign: \"Heartbreaker\") trains new pilots as the 108th Tactical Fighter Squadron, designated \"Wardog\" in the Osean Air Defense Force (OADF). During a routine training operation, unidentified aircraft appear on the radar and proceed to shoot down many of the squadron's not fully trained pilots. The squadron is left with few survivors, and the incident covered up while the military tries to figure out what's going on. Soon after, the nation of Yuktobania declares war on Osea, thus beginning a new conflict.</p><p><em>Ace Combat 5: The Unsung War</em> is a first person air combat and flight simulator. Like other Ace Combat games, each mission is determined by a level briefing and objectives. There are 32 missions in the main campaign mode, while an additional \"arcade\" mode puts the player in the role of Mobius One (from Ace Combat 04: Shattered Skies) as he faces endless waves of enemy attacks. Regardless of the mode chosen, once in the air the player will have control over speed, direction, altitude, gun cannon, missiles and special weapon of their aircraft. A new feature from previous Ace Combat games, is the concept of Wingmen and being able to issue simple orders to them in the air. This allows the player to better coordinated group attacks as well as giving each wingman a personality of their own. Additionally, the player as squadron leader will be asked to make decisions (\"Yes/No\") while flying in the air. Between missions, the story is progressed through a series of cutscenes.</p><p>Successful destruction of enemy targets earns the player money, which can be used to purchase new aircraft. Unlike <em>Ace Combat 04: Shattered Skies</em> special weapons no longer need to be purchased, however airplanes in the inventory apply to the entire squadron so if the player wishes a full wing of F-16s, they must have enough for everyone to fly. </p><p>Ace Combat 5, though situated in a fictional world highlights real-world models of aircraft including the F-14 Tomcat, Su-27 Flanker, F-16, A-6 Intruder, A-10 Thunderbolt, F-15, F/A-18, Tornado, and many more.</p>"},{"name":"Ace Lightning","year":2003,"developer":"Absolute Studios","url":"PS2_COLLECTION_PART1/Ace%20Lightning%20%28Europe%29.zip","filesize":180933507,"score":"","genres":"Action > Behind view > Platform > Licensed","desc":"<p>This third-person action game is based on the BBC TV series of the same name and you play as the hero, Ace Lightning, who is the most valiant of the Lightning Knights.</p><p>Your goal is to defeat your arch-enemy Lord Fear and send him and his gang back to prison in the sixth dimension. In order to do this, you must first collect all the pieces of the magical Amulet of Zoar, which he has hidden throughout the Carnival of Doom, a surreal and spooky place.</p><p>You must make your way through its four zones - the Ghost Town, Fun Park, Circus and House of Horror.  In each zone you must use your weapons to dispatch enemies such as evil clowns and zombies through different levels before coming face to face with the bosses of each zone - the characters Lady Illusion, Pigface, Googler and Dirty Rat from the TV series. Only after you have all the parts of the Amulet will you meet the evil Lord Fear in a final battle.</p>"},{"name":"Aces of War","year":2004,"developer":"Marionette Co., Ltd.","url":"PS2_COLLECTION_PART1/Aces%20of%20War%20%28Europe%29.zip","filesize":424885267,"score":"","genres":"Simulation > 1st-person > Shooter > Flight / aviation > Vehicular combat > Historical events > World War II","desc":"<p><em>Aces of War</em> is a historical flight combat sim set in the Pacific Theater of World War II which presents a number of \"what if?\" scenarios based on famous battles and campaigns such as Bougainville, Wake Island, and Iwo Jima. While the game prominently features the infamous A6M Zero fighter plane, as well as other Japanese aircraft such as the Ki-43 Hayabusa and Ki-61 Hien, there are also many American planes available to fly, such as the P-40 Warhawk and F4F Wildcat for a total of 40 different aircraft from both sides of the conflict.</p><p>The game is on the realistic end of the simulation spectrum. Each of the 15 missions have numerous objectives, including attacking air or ground targets, bombing strategic targets, or protecting friendly units or bases from enemy attack. In addition to the mission mode, there is also a training mode and a versus mission mode for two players.</p>"},{"name":"Action Girlz Racing","year":2006,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART1/Action%20Girlz%20Racing%20%28Europe%29.zip","filesize":57259766,"score":"","genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Action Girlz Racing</em> is a kart racing game with a cast of eight girls racing in miniature cars. The gameplay is very similar to the contemporary Myth Makers: Super Kart GP by the same developer. The three game modes are single trial, time trial and grand prix. There are three difficulty levels (beginner, experienced and advanced) and three racing classes (50 cc, 100 cc and 150 cc). The game includes environments such as a fairytale castle, sunset lagoon, action girlz high, dolphin bay resort and aquacoral resort. As with many of the developer's games most of the content is locked from the start. Most characters, tracks and race classes become available after collecting a number of flowers during races as a currency. The different characters only differ in appearance, not in abilities.</p><p>While racing it is possible to bump into other racers and the tracks contain many obstacles that slow down the racers or can be knocked around. Eight types of power-ups can be picked up such as nitro, an umbrella shield, shooting opponents or stunning them. Power-ups can be doubled or maxed out by collecting diamonds. Tracks often have branching paths, but instead of offering alternative routes or short-cuts, they often lead to dead ends, forcing the racer to backtrack.</p><p>The Wii version supports local split-screen multiplayer games for up to four players. The karts are controlled through motion by holding the Wii Remote horizontally and then tilting left or right. The PS2 version supports split-screen games for two players and up to four players through Multi-Tap.</p>"},{"name":"Action Man: A.T.O.M. - Alpha Teens on Machines","year":2007,"developer":"Brain in a Jar Ltd.","url":"PS2_COLLECTION_PART1/Action%20Man%20A.T.O.M.%20-%20Alpha%20Teens%20on%20Machines%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CNo%2CDa%2CFi%29.zip","filesize":124140443,"score":"","genres":"Action > Racing / Driving > Behind view > Shooter > Vehicular combat > Licensed","desc":"<p><em>Action Man: A.T.O.M. Alpha Teens On Machines</em> is a single player game based on the a French animated television series <em>A.T.O.M. Alpha Teens On Machines</em>. The Alpha Teens are Axel Manning, Catalina Leone, Crey Kingston, Zack Hawkes, and Ollie Sharker who test prototype vehicles and weapons for Lee Industries which they use to combat criminals in the fictional Landmark City, particularly the sadistic Alexander Paine.</p><p>In this game the team are pitted against Alexander Paine who has broken free from Landmark City's triple maximum security prison. Gameplay involves testing various machines on Lee Industry's test track before taking to the streets and battling his minions.</p>"},{"name":"Activision Anthology","year":2002,"developer":"","url":"PS2_COLLECTION_PART1/Activision%20Anthology%20%28Europe%2C%20Australia%29.zip","filesize":1339539516,"score":7.6,"genres":"Compilation","desc":"<p><em>Activision Anthology</em> is a collection of classic Atari 2600 titles as well as extra items including new gameplay modes for each game, trivia, originally released patches/updates, 3D views of the cartridges, the original manuals and much more. The game comes with licensed eighties music tracks. It contains 45 games.</p><p>The content is quite similar to Activision Hits Remixed (PSP), but unlike the GBA version and Activision Anthology: Remix Edition (PC/Mac), it doesn't include the homebrew titles. The following games are included:</p><ul><li>Atlantis</li><li>Barnstorming</li><li>Beamrider</li><li>Boxing</li><li>Bridge</li><li>Checkers</li><li>Chopper Command</li><li>Commando</li><li>Cosmic Commuter</li><li>Crackpots</li><li>Decathlon (The Activision Decathlon)</li><li>Demon Attack</li><li>Dolphin</li><li>Dragster</li><li>Enduro</li><li>Fishing Derby</li><li>Freeway</li><li>Frostbite</li><li>Grand Prix</li><li>H.E.R.O.</li><li>Ice Hockey</li><li><em>Kabobber</em> (previously unreleased)</li><li>Kaboom!</li><li>Keystone Kapers</li><li>Laser Blast</li><li>Moonsweeper</li><li>Megamania</li><li>Oink!</li><li>Pitfall!</li><li>Pitfall II: Lost Caverns</li><li>Plaque Attack</li><li>Pressure Cooker</li><li>Private Eye</li><li>River Raid</li><li>River Raid II</li><li>Robot Tank</li><li>Seaquest</li><li>Skiing</li><li>Sky Jinks</li><li>Space Shuttle</li><li>Spider Fighter</li><li>Stampede</li><li>Starmaster</li><li>Tennis</li><li><em>Thwocker</em> (previously unreleased)</li></ul>"},{"name":"Adiboo and the Energy Thieves","year":2004,"developer":"Coktel Vision","url":"PS2_COLLECTION_PART1/Adiboo%20and%20the%20Energy%20Thieves%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1278191308,"score":"","genres":"Action > 3rd-person (Other) > Behind view > Diagonal-down > Side view > 2D scrolling > Direct control > Automobile > Track racing > Fantasy > Sci-fi / futuristic","desc":"<p><em>The Energy Thieves</em> is an action game for children five years and up starring the Adiboo character. There are fourteen levels with different types of gameplay as Adiboo needs to stop a robot from taking away all of the planet's resources such as lava, rocks, wood and water. Levels include 2D side-scrolling platforming sections and races using both a frontal and a behind view. There is also a central hub world where Adiboo can be moved around freely to explore and further the story. There is a two-player multiplayer mode as well as time trial challenges. The difficulty level adapts dynamically based on the player's performance.</p>"},{"name":"ADK Tamashii","year":2008,"developer":"ADK Corporation","url":"sony_playstation2_a/ADK%20Tamashii%20%28Japan%29.zip","filesize":514430647,"score":"","genres":"Action > Compilation > Side view > Top-down > Isometric > Anime / Manga > Arcade > Fighting > Shooter > Martial arts","desc":"<p><em>ADK Tamashii</em> is a compilation of five classic NeoGeo games (four of which have never been available on other platforms) for the Playstation 2. The games included are:* Aggressors of Dark Kombat</p><ul><li>Ninja Combat</li><li>Ninja Commando</li><li>Ninja Master's</li><li>Twinkle Star Sprites (original Neo-Geo version)</li></ul><p>Unlike previous SNK Playmore compilations, this set does not include arrange soundtracks for the games, or a color editing mode. However, netplay is supported, and both <em>Aggressors of Dark Kombat</em> and <em>Ninja Master's</em> have Versus and Practice Modes.</p>"},{"name":"Adventures of Cookie & Cream, The","year":2000,"developer":"FromSoftware, Inc.","url":"sony_playstation2_a/Adventures%20of%20Cookie%20%26%20Cream%2C%20The%20%28USA%29.zip","filesize":605383603,"score":7.2,"genres":"Action > Top-down > Puzzle elements","desc":"<p>Cookie and Cream are two cartoon bunnies who are on their way home on the night before their clan's yearly moon festival only to find out that the moon has decided to run away, and if Cookie and Cream aren't able to find it, there will never be another festival. Fearing this, the duo sets out to make sure that it doesn't come true.</p><p><em>The Adventures of Cookie &amp; Cream</em> is designed for cooperative gameplay with two players. The goal of each level is to get to the end in a limited amount of time. There is basically a straight road from A to B where the players have to overcome obstacles in their way. This includes standard platforming or puzzles which need both players to solve, e.g. one has to press a button so that the other can progress. Because the way is not the same for both characters the game uses a split-screen view. Power-ups increase the time limits but certain obstacles decrease it again if touched. There are overall 35 levels.</p><p>It is possible to play the game alone but then the player has to control both characters at once. The game also features a unique 4-player mode where each character is controlled by two people and one joypad.</p>"},{"name":"Adventures of Darwin, The","year":2006,"developer":"Vingt et un Systems Corporation","url":"sony_playstation2_a/Adventures%20of%20Darwin%2C%20The%20%28USA%29.zip","filesize":98137989,"score":6.2,"genres":"Action > Diagonal-down > Puzzle elements > Fantasy","desc":"<p>One night the monkey Darwin dreamt of a meteoroid flying towards the earth and destroying all life. Only he would be able to stop it, but not as he was now. For the sake of his tribe Darwin and his people would need to venture out into the world and evolve.</p><p>During the game the player is directly in control of Darwin, but can also command the followers directly around him. These followers can be commanded to attack animals, carry items, or complete tasks such as building ramps and bridges. Finding items while exploring can increase Darwin's stats and the number of followers he can bring with him. Items can also be returned to Darwin's village to expand and upgrade the services available there, such as healing at the mess hall or recruiting additional followers at the bar.</p>"},{"name":"Adventures of Jimmy Neutron, The: Boy Genius - Attack of the Twonkies","year":2004,"developer":"THQ Australia Studios Pty Ltd."},{"name":"Adventures of Jimmy Neutron, The: Boy Genius - Jet Fusion","year":2003,"developer":"Krome Studios Pty Ltd."},{"name":"Aeon Flux","year":2005,"developer":"Terminal Reality, Inc.","url":"PS2_COLLECTION_PART1/Aeon%20Flux%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":4929029534,"score":6.7,"genres":"Action > Behind view > Arcade > Puzzle elements > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p><em>Aeon Flux</em> is a 3rd person action game inspired by the 2005 movie of the same name. The story takes place 400 years in the future after the majority of Earth's population has been wiped out by industrial disease. Only one city, Bregna, remains. The city is run by the group of scientists who had discovered the vaccine to prevent the disease, but a group of rebels known as the Monicans oppose their rule. </p><p>You control the main character of the story, Aeon Flux. Aeon is a skilled fighter, and can perform light and heavy strikes, combo attacks, and a variety of acrobatic attacks. When an enemy has only a small amount of health left, you also have the ability to perform a takedown attack; when successful this will award you a bonus, such as extra health. Aeon has a health meter and a style meter; when the health meter is depleted, the game is over. The style meter is filled by attacking or killing enemies; when you have earned enough style, you can charge up your combo attacks for extra damage. Aeon is also equipped with a gun called the FUG (Flux Universal Gun) as well as various gadgets. To use the gun you will need ammo which can be picked up at various locations on each level. The various gadgets and gizmos available need to be used to get past certain areas and solve some puzzles; intel capsules provide you with important data, small orbs can be controlled to disable alarms and activate doors, Aeon can hide in rollers to navigate through areas undetected, and more.</p>"},{"name":"Aero Elite: Combat Academy","year":2002,"developer":"SEGA-AM2 Co., LTD.","url":"sony_playstation2_a/Aero%20Elite%20-%20Combat%20Academy%20%28USA%29.zip","filesize":1353756667,"score":6.4,"genres":"Simulation > 1st-person > 3rd-person (Other) > Flight / aviation > Vehicular combat > Licensed","desc":"<p><em>Aero Elite: Combat Academy</em> is the fourth game in the <em>AeroWing</em> series and is considered a true flight sim game as the planes react as their real world counterparts. There are 60 authentic aircraft to pilot including the Harrier, A-10 Warthog, the Mirage 2000 and the infamous Mig 29 along with helicopters as well. There are 12 different missions areas that are used and features the new \"Scramble Mode\" where the player is instructed to intercept a random intruder and identify and land or attack if instructed. There are multiple missions to participate in including interceptions of enemy squadrons and even mastering aerial stunt maneuvers.</p>"},{"name":"AFL Live 2003","year":2002,"developer":"IR Gurus Interactive Pty Ltd.","url":"sony_playstation2_a/AFL%20Live%202003%20%28Australia%29.zip","filesize":352933841,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Oceania > Licensed","desc":"<p>The aim of the game is simple: Choose your team and take them all the way through the regular season to the Grand Final, in front of thousands of screaming fans at the Melbourne Cricket Ground. Grab high-flying marks, kick the ball over 50 meters down the ground, score the winning goal in the dying seconds. It's all here. Besides the season you can also play an exhibition game or just the finals.</p><p>Every one of the 16 teams and players from the 2002 AFL season is included, along with all of the usual rules that you expect for an AFL game. The game also features six stadiums and different weather (wet/dry) and time (day/night) conditions.</p>"},{"name":"AFL Live 2004: Aussie Rules Football","year":2003,"developer":"IR Gurus Interactive Pty Ltd.","url":"PS2_COLLECTION_PART1/AFL%20Live%202004%20-%20Aussie%20Rules%20Football%20%28Europe%29.zip","filesize":307132217,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Oceania > Licensed","desc":"<p>As its predecessor AFL Live 2003 this game is a simulation of Australian Football and it's main league, the AFL. Updates include the chance to win player awards throughout the season (including the all important Brownlow Medal for best player of the year). Player Missions will have you attempting to re-create history, or change it, as some of the best and worst moments for each team are there for you to make or break. Plus you can now take your team through the pre-season Wizard Cup competition.</p><p>Updates to team rosters, new replay features, photo realistic player faces, and a new commentary team led by Denis Commeti round out the changes.</p>"},{"name":"AFL Live: Premiership Edition","year":2004,"developer":"IR Gurus Interactive Pty Ltd.","url":"sony_playstation2_a/AFL%20Live%20Premiership%20Edition%20%28Australia%29.zip","filesize":2263390503,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Oceania > Licensed","desc":"<p>Following on AFL Live 2004, <em>AFL Live: Premiership Edition</em> boasts the latest team lists, added gameplay features, and unlockable content like videos from the 2003 season. Also new is the inclusion of the \"Wizard Home Loan Club\", a pre-season competition with knockout-matches.</p><p>Based on Australian Rules Football, the game attempts to recreate the experience of the real games. Users can set up a single exhibition match, or play through an entire season with their favourite team. Features commentary from experts such as Dennis Cometti and Gerald Healy.</p>"},{"name":"AFL Premiership 2005","year":2005,"developer":"IR Gurus Interactive Pty Ltd.","url":"sony_playstation2_a/AFL%20Premiership%202005%20%28Australia%29.zip","filesize":304073342,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Oceania > Licensed","desc":"<p><em>AFL Premiership 2005</em> is based off the Australian Rules Football game that is quite popular in southern parts of Australia. Based off the official rules and has full licensing from the AFL board. It is a mixture of a few sports, originally developed by a Australian Cricket Coach who wanted to keep his team fit in the off season. It is mainly played throughout the state of Victoria but has now gotten a following in other states. </p><p>The game includes all the 16 teams, 692 AFL players with stats and 8 of the stadiums. The game also includes support for the Cameo Eyetoy (PS2 version) that will allow the player to put his/her head into the game on top of one of the players. Full multiplayer gameplay is supported, using Gamespy for online play, or using the Multi-tap you can have up to 4 players. The PS2 version also comes with a bonus \"100 Years of Australian Football\" DVD.</p><p>The later released Xbox and PC versions do not contain the DVD, but because of the later release changes from the AFL draft have been implemented, even though the overall team score has not been updated.</p>"},{"name":"AFL Premiership 2006","year":2006,"developer":"IR Gurus Interactive Pty Ltd.","url":"sony_playstation2_a/AFL%20Premiership%202006%20%28Australia%29.zip","filesize":527729650,"score":6.9,"genres":"Sports > Diagonal-down > 2D scrolling > Oceania > Licensed","desc":"<p><em>AFL Premiership 2006</em> is the officially licensed game of the elite professional Australian Football League. It is a fast-paced full-contact sport that was started in Victoria as the VFL and then went national in the 1980s. The game includes all 16 teams, more than 600 AFL players with stats and the major of the stadiums, including Melbourne, Geelong, Docklands, Adelaide, Perth, Homebush, Brisbane and Sydney.</p><p>The game also includes support for the Cameo Eyetoy and Digimask that allows a player to put his/her head into the game on top of one of the players. Four-player multiplayer is supported using the PS2 multitap. Game modes in <em>AFL Premiership 2006</em> are Quick Match, Single Match, Season Mode, Training Mode and Missions Mode. In the Mission Mode, you can replay historic matches and alter the outcome.</p><p>Enhancements for this edition include more thorough player and team development, post-season decisions where you can trade or draft players, more options as a coach in the Season Mode, and a new Training Mode. During the matches, there are tribunals providing commentary and reports. Commentary is voiced by Dennis Cometti, Dermott Breretton, and Christi Malthouse.</p>"},{"name":"AFL Premiership 2007","year":2007,"developer":"IR Gurus Interactive Pty Ltd.","url":"sony_playstation2_a/AFL%20Premiership%202007%20%28Australia%29.zip","filesize":700580001,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Oceania > Licensed","desc":"<p><em>AFL Premiership 2007</em> is the officially licensed game of the elite professional Australian Football League. It is a fast-paced full-contact sport that was started in Victoria as the VFL and then went national in the 1980s. <em>AFL Premiership 2007</em> includes all 16 teams, more than 600 AFL players with updated stats and all of the major stadiums, including Melbourne, Geelong, Docklands, Adelaide, Perth, Homebush, Brisbane, Sydney and Launceston.</p><p>Game modes in <em>AFL Premiership 2007</em> are Single Match, Season Mode, Career Mode, Mission Mode and Training Mode.</p><p>Single Match is the fastest way to play a game of football. Use the Single Match summary screen to set your favourite team and then randomise the other settings; such as home and way teams, stadium, weather, and rules.</p><p>Mission mode allows you to take up the challenge and feel the pressure with these historical matches. Each mission has a handicap that a team must overcome; from seemingly impossible score deficits, to slim leads with seconds left on the clock. </p><p>Career mode takes you from season to season, with features including a new calendar view of the fixtures, new training to guide your players’ development, season stats for all the players in the league, leaderboards for all stats categories, Brownlow, Coleman, Club best and fairest awards, Best on Ground awards for each match.</p><p>The game also includes support for the Cameo Eyetoy and Digimask that allows a player to put his/her head into the game on top of one of the players. Four-player multiplayer is supported using the PS2 multitap.</p>"},{"name":"After..: Wasureenu Kizuna","year":2004,"developer":"Pionesoft","url":"sony_playstation2_a/After...%20Wasureenu%20Kizuna%20%28Japan%29.zip","filesize":803402057,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>The story in this game consists of two main parts. First part focusing on school days and a group of students who set out on a hiking trip in Japanese Alps. However, the protagonist of the story, Yuuichi Takawashi, dies in an accident during mountain climbing. But because of the reincarnation process of the soul, Yuuichi's memories are played. But in order to playback the memories of the soul, it is necessary to have someone in your heart who you really want to meet. And so the story flashback to the memories of high-school when you were in third year and play until the day of your accident. Second part start with Yuuichi waking up in a hospital. But not is his own body, but rather in that of whomever you made heroine in the first part of the story. Your soul is sort-of possessing that person's body. You want to tell people you know that you are still alive somehow, but because you are not really you, it appears to be rather difficult feat to achieve. But it is a matter of time when the soul decides to merge, and because two souls cannot forever occupy the same body, the one that doesn't merge will disappear, and if Yuuichi's soul merges, he will continue to live on in this body.</p><p>This visual novel plays just as typically, you read through the text with static backgrounds and non-animated characters and occasionally make choices that may propel the story toward a certain direction. There are also unlockable CG scenes and background music which can be viewed from gallery.</p><p>Dreamcast and PlayStation 2 ports feature some new characters and scenarios which are not present in PC version.</p>"},{"name":"Agassi Tennis Generation 2002","year":2002,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART1/Agassi%20Tennis%20Generation%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":219999884,"score":5.5,"genres":"Sports > Behind view > Tennis > Licensed","desc":"<p>In this tennis game with the endorsement of former world no. 1 Andre Agassi, the player has 32 players (all male, of which Agassi is the only real player), every one with their own strengths and 16 tournaments around the world, each with their trademark court (so you can count on Carpet in St. Petersburg, Grass on London, Clay in Paris and Cement on New York). Three game modes are available: Quick game (a simple game where the players sets all options, from location to the participants), Arcade (beating a series of games in a row) and Agassi Tournament, where the player competes for the No. 1 spot. </p><p>Gameplay is simple, as usual in most tennis matches. There are four buttons, controlling a simple shot, lob, top and back spin, and to win points, the player must be positioned correctly and add the right amount of direction and strength into the shot (by moving the d-pad). Serving uses a power bar where the player presses a key to toss the ball, and the bar fills up as the best time to hit the ball approaches, when the player hits the button again. Like in Virtua Tennis there are two views, the usual TV camera and a \"behind the player\" camera. Unlike other games published by Cryo in the Roland Garros series, the camera does not change so that the player is always on the bottom court.</p>"},{"name":"Age of Empires II: The Age of Kings","year":2001,"developer":"Ensemble Studios Corporation","url":"PS2_COLLECTION_PART1/Age%20of%20Empires%20II%20-%20The%20Age%20of%20Kings%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v2.00%29.zip","filesize":354889250,"score":8.2,"genres":"Strategy > Diagonal-down > Free-roaming camera > Isometric > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Asia > Europe > Historical events > Medieval > Middle East","desc":"<p>In <em>Age of Empires II: The Age of Kings</em>, the player takes control of one of thirteen civilizations, including the Chinese, Goths, Britons, and Vikings, among others. The player starts with a handful of villagers, through expansion and careful handling of the economy, the player can advance up to the point where powerful war machines and well trained masses of troops will be the player's to make and control. </p><p>There are three distinct ways to play, one of which the object is to hunt and kill the other player(s) king, however there are a lot of options for each, anywhere from what type of map to start on (including coastal, gold rush, arabia, and rivers) to what the maximum amount of units are allowed.</p><p>The player can also play online at the Zone vs. up to seven other players, or via a TCP/IP connection.</p>"},{"name":"Agent Collection","year":2005,"developer":""},{"name":"Agent Hugo","year":2005,"developer":"ITE Media ApS (Interactive Television Entertainment)","url":"PS2_COLLECTION_PART1/Agent%20Hugo%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":566583676,"score":"","genres":"Action > Racing / Driving > Behind view > Platform > Licensed","desc":"<p>Hugo, the TV troll from the Danish television series, is on his way to start his first day at the espionage agency R.I.S.K. (Risky Intelligent Spy Knights) when he is attacked by members of the sinister organization SUSPECTRA. Their plans are threatening the entire city, but Agent Hugo soon discovers there is even more at stake.</p><p>The game is played as a platformer with racing elements. Agent Hugo can use the R.I.S.K. Aquapolis boat with heat-seeking missiles and nitro acceleration. It can also dive and regular weapons can be used. While avoiding mines, the vessels can launch boomballs to blow up energy facilities, knock out enemies and open gates. Hugo can also swim and board other types of boats. On land, he has to either attack or sneak past enemies, with several disguises to stay undetected. When discovered, a meter starts to fill up. It can only be depleted by shaking off enemies and finding a hiding spot.</p><p>During his mission Agent Hugo meets members of R.I.S.K, such as Agent 01 &amp; 02, professor W, Ms Alltobright and Honeybunny. Villains include SUSPECTRA chief Dr Nogo and the local bosses of the districts: Kizzi Mi, Oddjaw and Max Schmertz.</p>"},{"name":"Agent Hugo: Hula Holiday","year":2008,"developer":"Attractive Games Ltd.","url":"PS2_COLLECTION_PART1/Agent%20Hugo%20-%20Hula%20Holiday%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.zip","filesize":259918687,"score":"","genres":"Action > Behind view > Platform > Fantasy > Licensed","desc":"<p><em>Agent Hugo: Hula Holiday</em> is a 3D platform game staring Hugo the TV troll that is played from a behind view perspective. While on vacation Agent Hugo notices that a big fly with his robotic trash cans is transforming a nearby island into a dump, in order to feed his fly army. </p><p>Gameplay includes platforming and defeating trash cans. Killing enemies can be done with a tail sweep. A tail sweep can also be used to activate screw switches for doors. Sometimes a bubble gun can be used to shoot at distant enemies, trapping them helplessly inside floating soap-bubbles, until they can be eliminated with a tail-sweep at close range.</p>"},{"name":"Agent Hugo: Lemoon Twist","year":2007,"developer":"Coyote Developments Ltd","url":"PS2_COLLECTION_PART1/Agent%20Hugo%20-%20Lemoon%20Twist%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.zip","filesize":500577126,"score":"","genres":"Action > Behind view > Platform > Fantasy > Licensed","desc":"<p><em>Agent Hugo: Lemoon Twist</em> is a 3D platform game starring Hugo the TV troll that is played from a behind view perspective. Agent Hugo is brought in to stop Dr. Hypno, who plans to launch his Hypno-satellite into space and control the planet. Hugo is sent to the island fortress of Dr. Hypno to prevent this from happening</p><p>Gameplay includes platforming and defeating (or evading) Dr. Hypno’s hypnotized minions using your tail. Various items can be collected. Hugo can also use his speed boots, power boots, rolling ball and helicopter suit at specific points in a level.</p>"},{"name":"Agent Hugo: RoboRumble","year":2006,"developer":"ITE Media ApS (Interactive Television Entertainment)","url":"PS2_COLLECTION_PART1/Agent%20Hugo%20-%20RoboRumble%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":259483795,"score":"","genres":"Action > Racing / Driving > Behind view > Arcade > Platform > Licensed","desc":"<p><em>Agent Hugo: RoboRumble</em> is a fast paced racing game with platform elements.</p><p>The city of Aquapolis has been invaded by a new evil villain - Geekdorph, Lord of Robots. Agent Hugo escapes to a teleporter and gets beamed to the secret hideout of R.I.S.K (Risky Intelligent Spy Knights).</p><p>From the hideout, Hugo must teleport into space, the desert and Aquapolis to defeat Geekdorph's challenges and collect information about Geekdorph's secret location - so the final three stage boss-fight can take place and the citizens of Aquapolis set free.</p><p>Hugo has a companion - TEX 2000 - an intelligent hoverboard.Surf on TEX 2000. Destroy robots with his force field or shoot them with lasers, missiles and smart bombs! Accelerate TEX 2000 to extreme speeds and take risky jumps to increase your score.</p><p>The player controls Hugo standing on the hoverboard (TEX 2000) and has to help him complete three main game plays in a total of nine levels.</p><p>\"Time run\": Can you complete a number of rounds on time?  </p><p>\"Destroy all robots\": Can you takeout all robots?  </p><p>\"Point collect\": Jump high - look around! - can you make a perfect score?</p>"},{"name":"Aggressive Inline Featuring Taig Khris","year":2002,"developer":"Z-Axis, Ltd.","url":"PS2_COLLECTION_PART1/Aggressive%20Inline%20Featuring%20Taig%20Khris%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":1228221834,"score":8.1,"genres":"Sports > Behind view > Tricks / stunts > Skateboarding > Licensed","desc":"<p>Combine the many tricks and styles of the extreme sport, inline skating, with a Tony Hawk style system, complete with objectives and huge arenas, and you have Aggressive Inline.</p><p>Progress through the career mode, where you must complete objectives (such as grind a certain object(s) to jump over large gaps and gain points) to open up further arenas, which there are 7 in all, and once you are bored with them, you can make your own in the park editor. The game doesn't use a hard time limit but the so-called \"juice meter\": it fills up when performing stunts and if it gets empty, the level ends. During the game, you level up your character in seven stats, e.g. speed and grinds. The game uses a \"learning by doing\" approach to this, meaning that the stat improves if you perform the associated actions often enough. There are also five hidden keys in each level that open up new areas within the level.</p><p>10 pro inline skaters join the fun (Shane Yost, Sam Fogarty, Sven Boekhorst, Eito Yasuko and more), and you can take on a friend in 2 player split screen.</p>"},{"name":"AH-64 Apache Air Assault","year":2005,"developer":"InterActive Vision White Eagle Sp. z o.o."},{"name":"Ai yori Aoshi","year":2003,"developer":"KID Corp.","url":"sony_playstation2_a/Ai%20yori%20Aoshi%20%28Japan%29.zip","filesize":1450539550,"score":"","genres":"Adventure > Fixed / flip-screen > Anime / Manga > Mini-games > Comedy > Romance > Licensed","desc":"<p><em>Ai yori Aoshi</em> (藍より青し) is a visual novel with two separate story segments based on TV anime with the same name. The game also comes with several different 3rd-person mini-games such as fishing or skating. The player is cast in the role of Kaoru Hanabishi, the same protagonist in the original anime.</p>"},{"name":"Aikagi: Nukumori to Hidamari no Naka de","year":2003,"developer":"F&C Co., Ltd.","url":"sony_playstation2_a/Aikagi%20-%20Nukumori%20to%20Hidamari%20no%20Naka%20de%20%28Japan%29.zip","filesize":1223392862,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Visual novel > Romance","desc":"<p><em>Aikagi: Nukumori to Hidamari no Naka de</em> is a romantic visual novel adventure game. This is a console port of an adult visual novel for PC (Windows) known as Aikagi: Hidamari to Kanojo no Heyagi which strips all the adult content, mainly adult CG events, but adds new story elements.</p>"},{"name":"Air","year":2002,"developer":"Key Co., Ltd.","url":"sony_playstation2_a/Air%20%28Japan%29.zip","filesize":1468576341,"score":7.5,"genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Japan (Ancient/Classical/Medieval) > Japan (Modern/Futuristic) > Adult > Romance","desc":"<p><em>Air</em> is a visual novel officially called \"ren'ai (love) adventure game\". The gameplay is simple and traditional: you read the text, watch the scenes that unfold in front of you, and take decisions during conversations, that will determine the character of your relationships with the girls and the outcome of the story.</p><p>In the game, you play as three different characters through three different scenarios. The first one is the Dream Scenario. You play as Yukito, a travelling entertainer. You carry around a doll and move it by using your \"magic\". When you were young, your mother told you a story about a mysterious girl who lives on the opposite side of the sky. Now you travel constantly, trying to find this girl of your dreams. You meet three girls, Misuzu, Kano, and Minagi, and depending on your actions, will have different relationships with them. Once you finish the Dream Scenario, you unlock the Summer Scenario, which is set in 994 AD and in which you play as a nobleman Ryūya. The last one is the Air Scenario, in which you'll play as Misuzu's pet crow, and see the events of the first scenario from the crow's perspective.</p><p><em>Air</em> was originally released for PC as an adult game with erotic scenes. There is also an \"all ages\" version for PC, and the console ports also don't have erotic content. The PC versions do not contain voice acting as the console ports do.</p>"},{"name":"Air Raid 3","year":2006,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART1/Air%20Raid%203%20%28Europe%29.zip","filesize":45497129,"score":"","genres":"Action > Behind view > Shooter > Direct control > Flight / aviation > Vehicular combat > Africa > Asia > Europe > South America","desc":"<p><em>Air Raid 3</em> lets players become a jet fighter pilot with numerous missions all over the world. The gameplay is similar to the Ace Combat games as it is primarily focused around dogfighting versus a range of other aircraft in the sky and achieving mission based objectives such as blowing up a certain building of defeating a number of enemy aircraft.</p><p>The game was also reskinned as <em>Combat Ace</em>. Air Raid 3's jet was replaced with a biplane and sounds of the game were also altered to reflect this change, but is otherwise the same game. The game was again reskinned as <em>Space Rebellion</em>. The vehicle is now a spaceship and the game now has an outer space motif.</p>"},{"name":"Air Ranger: Rescue Helicopter","year":2002,"developer":"Garden Ltd.","url":"PS2_COLLECTION_PART1/Air%20Ranger%20-%20Rescue%20Helicopter%20%28Europe%29.zip","filesize":493689064,"score":"","genres":"Action > Simulation > 1st-person > 3rd-person (Other) > Helicopter > Vehicle simulator","desc":"<p><em>Air Ranger Rescue</em> is a single player game in which the player pilots a rescue helicopter.</p><p>There are three helicopters to fly in this game, the MBB/Kawasaki BK-117-B, the Boeing CH-47J \"Chinook \", and the Hughes/Kawasaki OH-6D. The game consists of eight timed missions each of which has three levels of difficulty, plus in the training section there's also a 'Free Flight' mode. The first missions are flown in the small OH-6D, missions two and above together with the other craft being locked off until the preceding missions have been completed successfully. <br>Missions are scored on a points system, victims must be rescued while in good health so points are lost if they are not picked up in good time and, of course, points are deducted should the helicopter hit a building or should a victim die.</p><p>The training section is in the form of a manual and it not only explains the game's controls but also the workings of the helicopter and includes sections of video footage.</p>"},{"name":"AirBlade","year":2001,"developer":"Criterion Software Ltd.","url":"PS2_COLLECTION_PART1/AirBlade%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1373058136,"score":7.1,"genres":"Action > Sports > Behind view > Arcade > Tricks / stunts > Sci-fi / futuristic","desc":"<p><em>AirBlade</em> takes place in the near future as a man named Oscar has developed a perpetual energy source that will revolutionize the world, however, the GCP Corporation has discovered it as well and fears that it will hurt the company which is heavily invested in the oil companies. Desperate, they kidnap Oscar in an attempt to silence him, but before he is captured, he gives his friend Ethan a prototype hoverboard called the AirBlade.</p><p>The player takes control of Ethan who then must transverse through various objective-based missions in an attempt to rescue Oscar, get the discovery out to the world and bring an end to the evil corporation. Each mission has the player complete certain objectives within in a certain time limit that include destroying cameras or taking out guards using the AirBlade to travel through these areas and discover various items that will help them along the way as well as bonus rooms and missions.</p><p>As the player progresses through the game, they will unlock additional modes including a \"Score Attack\" mode and a \"Freestyle\" mode that rewards the player for completing various tricks and stunts using the AirBlade. There are also a variety of multiplayer modes such as \"Ribbon Tag\" and \"Elimination\" which consists of eight players taking turns scoring points on time allotted tracks with each round eliminating the player with the lowest points until only one player is left.</p>"},{"name":"Airborne Troops: Countdown to D-Day","year":2004,"developer":"Widescreen Games SARL","url":"PS2_COLLECTION_PART1/Airborne%20Troops%20-%20Countdown%20to%20D-Day%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":339000802,"score":5.1,"genres":"Action > Behind view > Shooter > Historical events > World War II > War","desc":"<p>You are John Welsh, 25 years old, American soldier member of the paratroopers. Two days before operation Overlord, you are sent in Normandy to secure Murat.</p><p><em>Airborne Troops: Countdown to D-Day</em> is a 3D real-time shooting game, in which you will always have to choose between action and infiltration to complete your missions. You have eight weapons to choose from and the nineteen types of enemies have each their own AI.</p>"},{"name":"AirForce Delta Strike","year":2004,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_a/AirForce%20Delta%20Strike%20%28USA%29.zip","filesize":1297127923,"score":6.6,"genres":"Action > Simulation > 1st-person > Behind view > Flight / aviation > Vehicular combat > Sci-fi / futuristic","desc":"<p>Fly with the 1st, 2nd, and 3rd Element squadrons as you defend country and, eventually, Earth itself from attack. Pilot aircraft that span sixty years of aviation including WWII prop planes, Korean War jets, rare prototypes, and even aircraft from previous Konami games like the Vic Viper and TwinBee.</p><p>Between missions you can explore the base and talk to wingmates, buy new aircraft and special weapons, modify or repaint existing aircraft, and get mission briefings. Missions can have varied objectives, but any enemy crafts shot down will reward money used to buy, modify, and repair aircraft. While Ken Thomas is the main character of the game, other pilots can be used in missions as the game progresses, and using them can open up bonus missions as well as alter the story. The player can only play as Delta Squadron pilots, but the story is told from the perspective of both E.D.A.F.'s Delta Squadron and their O.C.C. Ace counterparts. Medals are awarded to each pilot as they reach milestones, such as number of enemy aces shot down or number of aircraft purchased.</p>"},{"name":"Akagawa Jirou - Tsuki no Hikari - Shizumeru Kane no Satsujin","year":2002,"developer":"Team Craze","url":"sony_playstation2_a/Akagawa%20Jirou%20-%20Tsuki%20no%20Hikari%20-%20Shizumeru%20Kane%20no%20Satsujin%20%28Japan%29.zip","filesize":637654142,"score":"","genres":"Adventure > 1st-person > Detective / mystery","desc":"<p>Based on the novel by Akagawa Jirou, the story puts you in a role of a high-school teacher who due to a painful breakup leaves his old workplace and comes to a far away place to start a new job at Bell Garden school. While taking a stroll, a woman's scream is heard... you run to see what is happening, and the mystery begins. You can select main character to be a man or a woman, which slightly influences the game scenario (when the player is a man, his partner will be a woman and vice-versa).</p><p>Game progress advances as a mystery novel. As the case becomes obvious you will investigate and use deductive skills to find out the culprit and the motive behind the crime. During the gameplay you can visit various places and check the map of the Bell Garden school and its surroundings. During investigation and story progress, you will use a character correlation diagram to connect a certain person with the matter at hand. Also, the diagram can be used to make relations between characters (for example to mark them as lovers). Story can have more endings, depending on the player's deduction and skills to solve the case. After a solved case, if available, a new scenario will open.</p>"},{"name":"Akai Ito","year":2004,"developer":""},{"name":"Akira Psycho Ball","year":2002,"developer":"KAZe Co., Ltd.","url":"PS2_COLLECTION_PART1/Akira%20Psycho%20Ball%20%28Europe%29.zip","filesize":569751240,"score":"","genres":"Action > Anime / Manga > Pinball > Licensed","desc":"<p><em>Akira Psycho Ball</em> is a pinball game based on the animated movie <em>Akira</em> (1988). The focus of the game is the story mode during which the player visits four stages (Neo-Tokyo, Laboratory, A-Room and Olympic Stadium) which are also divided into different tables. On each table, the player has to reach special objectives with the usual pinball mechanics, e.g. hitting certain things in the correct order. There are also optional secret rooms to find. After finishing all objectives, the next table is unlocked as well as a cutscene directly taken from the movie.</p><p>The arcade mode is unlocked after finishing the story and allows the player to freely play the tables for highscores. The vs. mode (either against the AI or another human) is played on two tables which are divided in the middle, but are interconnected through a loop at the top. The main goal is to send as many balls as possible to the opponent's side because each lost ball gives a penalty point. The first player to reach a certain number loses the match.</p>"},{"name":"Alan Hansen's Sports Challenge","year":2007,"developer":"Oxygen Interactive Studios Ltd.","url":"PS2_COLLECTION_PART1/Alan%20Hansen%27s%20Sports%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":990186621,"score":"","genres":"Action > Text-based / Spreadsheet > Game show / trivia / quiz > Licensed","desc":"<p><em>Alan Hansen's Sports Challenge</em> is a sports trivia game hosted by sports star Alan Hansen.</p>"},{"name":"Alarm for Cobra 11","year":2000,"developer":"VCC Entertainment GmbH & Co. KG","url":"PS2_COLLECTION_PART1/Alarm%20for%20Cobra%2011%20%28Europe%29%20%28En%2CDe%29.zip","filesize":421511319,"score":"","genres":"Action > Racing / Driving > Behind view > Automobile > Licensed","desc":"<p><em>Alarm für Cobra 11</em> is a licensed game about the eponymous German action TV series. It is the first game released in the series. As expected the player controls a car, chases bad people down and causes a lot of explosions. </p><p>The game is divided into 15 missions with goals like stopping a ghost driver or protect another car. After every mission the player unlocks a video clip from the show and sometimes he get a better car. In a second playing mode the player executes stunts like jumping over parked cars or smashing as much cars as possible.</p>"},{"name":"Alarm for Cobra 11: Hot Pursuit","year":2004,"developer":"Davilex Games B.V.","url":"PS2_COLLECTION_PART1/Alarm%20for%20Cobra%2011%20Vol.%202%20-%20Hot%20Pursuit%20%28Europe%29.zip","filesize":121394407,"score":"","genres":"Action > Racing / Driving > Behind view > Automobile > Licensed","desc":"<p><em>Alarm für Cobra 11 - Vol. II</em> is a licensed game about the eponymous German action TV series and basically the same game as its predecessor: the player uses one of 25 cars, drives on the highway and causes explosions. It is the second game in the series.</p><p>The player solves one mission after another the goal is mostly to chase other drivers down. In the process he unlocks special cars and a Making Of about the pilot movie. The courses are based on Berlin, Cologne, Hamburg and Munich.</p>"},{"name":"Alarm for Cobra 11: Vol. III","year":2005,"developer":"Provox Games","url":"PS2_COLLECTION_PART1/Alarm%20for%20Cobra%2011%20-%20Vol.%20II%20%28Europe%29%20%28En%2CDe%29.zip","filesize":561827305,"score":"","genres":"Action > Racing / Driving > 1st-person > Behind view > Automobile > Detective / mystery > Licensed","desc":"<p><em>Alarm für Cobra 11: Vol. III</em> is based on the German TV series of the same name, featuring the adventures of the German highway police and with extensive stunt scenes and action sequences.</p><p>In the third installment of the game series the player plays through a full episode in the roles of the detectives Tom and Semir. The two most important gameplay elements are car chases on the German highway and some third-person action scenes played on foot. The aim of this game is to find the head of a criminal organization and make sure justice is served.</p><p>The game features motion-captured animations, the voices of the main characters and the soundtrack of the series.</p>"},{"name":"Alex Ferguson's Player Manager 2001","year":2001,"developer":"Anco Software Ltd.","url":"PS2_COLLECTION_PART1/Alex%20Ferguson%27s%20Player%20Manager%202001%20%28Europe%29.zip","filesize":152152440,"score":"","genres":"Sports > Managerial / business simulation > Menu structures > Football (European) / Soccer > Licensed","desc":"<p>In this tactical football management game, you become the manager of a team in the English, French or Belgian league, with different subdivisions, starting in 2001. Your job includes setting out strategies, planning training sessions, keeping an eye on your players and attracting new talent, taking care of finances, and of course making sure that you win your matches. You will be given specific goals, such as qualifying for the champion's league, or defending the club's reputation. Games do not only include league matches, but friendlies and cup matches as well.</p><p>The actual games can be watched real-time in 3D, allowing for on-the-fly substitutions and tactical decisions, and a unique feature is you can both manage and play for a club, although there is no way to actually control players or actively participate. All players have different abilities and characteristics, which can be trained to create a well-balanced team. The French version portrays manager Guy Roux (famous of Auxerre), while the UK version has Alex Ferguson (Manchester United).</p>"},{"name":"Alex Ferguson's Player Manager 2002","year":2001,"developer":"Anco Software Ltd."},{"name":"Alfa Romeo Racing Italiano","year":2005,"developer":"Milestone s.r.l.","url":"sony_playstation2_a/Alfa%20Romeo%20Racing%20Italiano%20%28USA%29.zip","filesize":297466200,"score":6.1,"genres":"Racing / Driving > 1st-person > Behind view > RPG elements > Automobile > Street racing > Track racing > Vehicle simulator > Licensed","desc":"<p>The prestigious Alfa Romeo brand's cars feature in this racing game. There are several real tracks such as Hockenheim and Laguna Seca, as well as the chance to race in scenic Italian locations such as the Tuscanny hills and the Naples coastline. You can play Instant Action mode, in which you unlock these tracks one by one with indestructible cars, and Dynasty Mode, where you aim to build a more realistic career.</p><p>What sets the game apart from the crowd is its approach to driver abilities in Dynasty Mode. When setting a driver up, his abilities are split into skill areas such as reflexes and pressure-handling, with points assigned to these.  </p><p>Further skills such as Heart, Intimidation and Recovery can be developed to improve either car or driver. AI cars have the same features applied to them race by race.</p><p>The driver's heartbeat is a featured sound effect, and in pressure situations it can be heard above all other sounds. One available skill is the Tiger Effect, which allows you to rewind the game to avoid dangerous situations as they are about to happen. Its length and efficiency are 2 of the skills which can be improved.</p>"},{"name":"Alias","year":2004,"developer":"Acclaim Studios Cheltenham","url":"PS2_COLLECTION_PART1/Alias%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2320184016,"score":6.5,"genres":"Action > 3rd-person (Other) > Stealth > Spy / espionage > Licensed","desc":"<p>Based on the successful television show, <em>Alias</em> lets players take on the role of Sydney Bristow, a stealth operative working for the CIA. The game sets the player against two of Bristow's enemies from the original series in a plot which takes her from Saudi Arabia to Rio de Janeiro as she aims to find out about a mysterious device known only as \"The Machine\". The game was devised in conjunction with the writers from the show and uses official costumes, character shots and voices.</p><p>Players can use a stealth or action approach to get through the levels. With stealth Bristow needs to hug walls and use the correct timing to approach enemies from behind and knock them out. To accomplish this she has a few gadgets to her disposal, e.g. thermal vision or mini cameras. For the more direct method she uses guns found on neutralised enemies or melee combat. The latter knows different fighting styles depending on which weapon Bristow uses, e.g. knifes, unarmed or even a broom. There are also basic puzzles to solve, e.g. opening doors or a hacking mini game. Health regenerates automatically after a certain amount of time.</p>"},{"name":"Alien Hominid","year":2004,"developer":"The Behemoth","url":"PS2_COLLECTION_PART1/Alien%20Hominid%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":611651301,"score":7.3,"genres":"Action > Side view > 2D scrolling > Shooter > Fantasy > Sci-fi / futuristic > Regional differences","desc":"<p>You're a little yellow alien. The FBI has shot down your ship while flying over planet Earth. And it, quite literally, lands right on their doorstep. After a series of FBI Agents swipe your ship, what option do you have other than to blow up everything in your path to get it back?</p><p><em>Alien Hominid</em> is a 2D side-scrolling shooter with heavy references to the Metal Slug series of games - from the hand-drawn graphics, huge explosions, right down to the ability to eviscerate FBI Agents when you get up close to them. The graphics are by featured artist Dan Paladin. Your goal, is quite simply, to get to the end of the stage, and die as little as possible. Which is made difficult due to the fact that any bullet is an instant kill.</p><p>To help you out, you can grab a range of power-ups, such as lasers, spread shots, shotguns, and more, as well as hijacking vehicles and using them for protection. Grenades can be lobbed, and you can jump on enemy shoulders and choose to bite their heads off if you like, or pick them up and throw them at other enemies. You can also dive underground for a short period of time to avoid enemies - while underground, you can drag agents into the ground to kill them.</p><p>The GBA version of the game is identical in gameplay, however, with a few bosses removed (such as the robot bee and the FBI big-fisted tank robot). The PlayStation 2, Xbox and Xbox 360 versions of the game include a special \"PDA Game\" with very simple-looking graphics. Your goal in this game is to kill all the agents by hopping on their heads and then reaching the exit. Included with this game is a level editor, allowing you to make your own levels and then send them to friends if you have the Xbox or Xbox 360 version.</p>"},{"name":"Aliens in the Attic","year":2009,"developer":"Revistronic","url":"PS2_COLLECTION_PART1/Aliens%20in%20the%20Attic%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":183836882,"score":"","genres":"Action > 3rd-person (Other) > Platform > Sci-fi / futuristic > Licensed","desc":"<p>A family with a group of kids goes on summer vacation when small knee-high aliens from outer space intent on conquering the planet take up residence in the attic of the home they're staying at. You play as the Zirkonians who have to prepare the Earth for invasion by activating a Sizematron device sent long ago that can enlarge the invasion force. In this action-adventure platform game based on the movie of the same name, you go through 15 different levels through areas such as the roof, attic, vents, living room, garden, and basement.</p><p>You can switch among 4 different aliens on the fly with different abilities such as one being able to double jump, and another can throw grenades. Along the way, you collect different parts with which you can use to make various weapons including customizable ones for use with the Wii remote. The aliens also can use special attacks such as Fingernail Slash Combo, Ground Pound, and Tornado Attack. There's 4 different difficulty levels to choose from.</p>"},{"name":"Aliens Versus Predator: Extinction","year":2003,"developer":"Zono, Inc.","url":"PS2_COLLECTION_PART1/Aliens%20Versus%20Predator%20-%20Extinction%20%28Europe%29.zip","filesize":539457847,"score":6.3,"genres":"Action > Strategy > Diagonal-down > Real-time > Sci-fi / futuristic > Licensed","desc":"<p>The battle that has split more blood over centuries continues, with the human marines caught in-between the powerful Aliens and the deadly Predators.</p><p>Moving away from the FPS series on PC, Extinction has you controlling one of the three races in a real time strategy mix, building each unit and setting them out into the battlefield to complete a range of tasks.</p><p>Each race has an advantage and disadvantage. The humans have a collection of different units, from heavy weapons experts to medics, and are better known for their long range attacks. Predators are hardcore fighters, taking the battle right up to the enemy, although there are fewer of them available to counter act their superior power. Finally, the Aliens are fast and deadly, and always hunt in large packs.</p><p>Upgrade weapons and use terrain to an advantage in each level to make certain your team (whoever or whatever they may be) survive until the next battle.</p>"},{"name":"All Star Pro-Wrestling","year":2000,"developer":"Square Co., Ltd.","url":"sony_playstation2_a/All%20Star%20Pro-Wrestling%20%28Japan%29.zip","filesize":435060087,"score":"","genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>All Star Pro-Wrestling</em> is a 3D Japanese pro wrestling game with a focus on realism and authenticity, featuring more than two dozen New Japan Pro-Wrestling stars including Keiji Mutoh, Riki Choshu, Jushin Thunder Liger, and AKIRA. The game's defining feature is a unique twin-stick control scheme, with the left stick controlling the wrestler's movement, and the right stick executing different types of moves. The game includes a tournament mode, a league mode where the player can try to win the championship for each class, a challenge mode against every wrestler in the game, and exhibition matches for one or two players.</p>"},{"name":"All Star Pro-Wrestling II","year":2001,"developer":"Square Co., Ltd.","url":"sony_playstation2_a/All%20Star%20Pro-Wrestling%20II%20%28Japan%29.zip","filesize":416038024,"score":"","genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>All Star Pro-Wrestling II</em> is the sequel to Square's All Star Pro-Wrestling, featuring a number of changes. Most importantly, the roster has been expanded significantly, including wrestlers from the Noah and Zero-One promotions alongside NJPW for more than 40 wrestlers in total. The control system has also been reworked, replacing the controversial twin-stick controls of the previous game with a more traditional button-based system. Another new feature is the ability to create a new promotion and recruit different wrestlers. Game modes include a variety of different single, tag, and battle royale match types, including exhibition, tournament, and league modes.</p>"},{"name":"All Star Pro-Wrestling III","year":2003,"developer":"Square Enix Co., Ltd.","url":"sony_playstation2_a/All%20Star%20Pro-Wrestling%20III%20%28Japan%29.zip","filesize":1410217775,"score":"","genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>All Star Pro-Wrestling III</em> is the third and final title in Square's wrestling simulation series, featuring many famous wrestlers from the New Japan Pro Wrestling, Noah, and Zero-One wrestling promotions. There are once again numerous improvements over the previous game, including authentic entrances for each wrestler complete with original theme music, and a create-a-wrestler mode. All of the game modes from the previous release return, comprising single, tag, and battle royale matches in a variety of exhibition, tournament, and league modes.</p>"},{"name":"All-Star Baseball 2002","year":2001,"developer":"Acclaim Studios Austin","url":"PS2_COLLECTION_PART1/All-Star%20Baseball%202002%20%28Europe%29.zip","filesize":532535135,"score":6.9,"genres":"Sports > Behind view > Baseball > Licensed","desc":"<p><em>All-Star Baseball 2002</em> has the complete 2001-2002 MLBPA rosters. You may choose to play as one of the current teams, or you can go back to the past and play as people like Nolan Ryan or Reggie Jackson. You can also create your own player and/or team.</p><p>The featured game modes are Quick Play, Exhibition, All-Star Game, Season, Series, Home Run Derby, and Batting Practice. Batting is cursor-based, and you can choose between power or contact swing - for the latter, there are even more options available, e.g. trying to hit the opposite field. Batting is similar in as you choose your itching style (every athlete can have up to six in his repertoire) and then choose the location. Fielding can be automatic or manual.</p>"},{"name":"All-Star Baseball 2003","year":2002,"developer":"Acclaim Studios Austin","url":"PS2_COLLECTION_PART1/All-Star%20Baseball%202003%20featuring%20Derek%20Jeter%20%28Europe%29.zip","filesize":1010913284,"score":7.3,"genres":"Sports > Behind view > Baseball > Licensed","desc":"<p>Four-time World Series Champion Derek Jeter headlines the 2003 edition of <em>All-Star Baseball</em>. Every player from the Major League Baseball 2002-2003 season is here, with hundreds of stats, rules, and options to modify and jazz up your baseball experience. Along with the usual season mode, there's also the playoffs to be won, home run competitions, multiplayer options and all-star modes. New is the franchise mode which simulates 20 seasons.</p>"},{"name":"All-Star Baseball 2004","year":2003,"developer":"Acclaim Studios Austin","url":"PS2_COLLECTION_PART1/All-Star%20Baseball%202004%20featuring%20Derek%20Jeter%20%28Europe%29.zip","filesize":3409133123,"score":7.6,"genres":"Sports > Baseball > Licensed","desc":"<p>It's back to the ballpark for the 7th time in this addition to the <em>All-Star Baseball</em> series.</p><p>As in earlier versions, all current Major League Baseball teams players are featured, available for play in a number of single-game, season, and playoff modes.</p><p>New in this version is the inclusion of over 100 legendary players from seasons past, including Babe Ruth, Lou Gehrig, and Ty Cobb. The game's interface has also been revamped to be more user-friendly.</p><p>Derek Jeter returns as the cover athlete for the 2004 version and also plays host for the game's live-action stadium tours and other multimedia features.</p>"},{"name":"All-Star Baseball 2005","year":2004,"developer":"Acclaim Studios Austin","url":"sony_playstation2_a/All-Star%20Baseball%202005%20featuring%20Derek%20Jeter%20%28USA%29.zip","filesize":2457911840,"score":7.5,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>The 2005 update to the <em>All-Star Baseball</em> series includes online features such as head-to-head play and improved online updates to the rosters (both Xbox and PS2). You can now also bat using the analog controller and two new camera angles have been added: the fieldercam and the broadcastcam.</p><p>As for the gameplay, the create-a-player mode has been enhanced, and a franchise mode has been added. Steve Lyons and Thom Brennaman are the commentators, with Spanish play-by-play by Arizona Diamondbacks' commentator Oscar Soria. The game also includes a full gameplay tutorial for those new to the game.</p><p>There is special attention to the 2003 MLB season, as you can replay historic moments in the <em>This Week In Baseball</em> challenge. With an official license, there are about 80 stadiums, authentic uniforms, and a hall of fame that honours MLB legends. Next to the 30 official Major League teams, there are some historic bonus teams such as a wartime and a postwar stars team, and various fantasy teams.</p>"},{"name":"All-Star Fighters","year":2005,"developer":"Digital Zero Co., Ltd.","url":"PS2_COLLECTION_PART1/All-Star%20Fighters%20%28Europe%29.zip","filesize":246589528,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control","desc":"<p><em>All-Star Fighters</em> is a 3D one-on-one fighting game starring characters from games from the <em>Simple Series</em> by D3Publisher. The game uses typical fighting mechanics with punches, kicks and combos. When low on health a Super Impact attack can be performed that turns the tables on the enemy. Game modes include Practice, Survival and a race against the clock.</p><p>The included fighters are:* Aya (from Zombie Zone)</p><ul><li>Damdo (from World Fighting)</li><li>Deathdoll Kikashi (from Splatter Master)</li><li>Earth Defence Force (from Monster Attack)</li><li>Ginnie + Blacky (from The Suiri)</li><li>Kyo Asuka (from Yakuza Fury)</li><li>Makoto Futaba (from The Gal Mahjong: Love Song / Zombie Hunters)</li><li>Mayuki (from Street Boyz)</li><li>Namedethgar (from Power Fighters)</li><li>Princess Shaval (from The First RPG)</li><li>Reiko Mizusaki (from Party Girls)</li><li>Riho Futaba (from The Gal Mahjong: Love Song / Zombie Hunters)</li><li>Shin Fuyue (from Zombie Attack)</li></ul>"},{"name":"Alone in the Dark","year":2008,"developer":"Hydravision Entertainment","url":"PS2_COLLECTION_PART1/Alone%20in%20the%20Dark%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":2766000313,"score":5.7,"genres":"Action > 1st-person > Behind view > Puzzle elements > Shooter > Survival horror > Detective / mystery > Horror","desc":"<p>The PS2 and Wii versions of Alone in the Dark follow the same plot as the game developed for Xbox 360 and Windows by Eden Games, but were created by a different company with their own vision how the game should be implemented.</p><p>Level structure, mechanics of gameplay, and looks of the characters (Sarah, especially) sometimes differ strongly as these versions contain concept elements that were left out of the other game. The driving sequences are almost entirely taken out. The first-person view is also mostly not used, and, for example, fire can be extinguished in the third-person mode. The basic aspects of screenplay are retained, but this can be considered another \"what if\" instalment in the series, rather than a canonical entry like the other version. The endings have a different look, but remain largely the same.</p>"},{"name":"Alone in the Dark: The New Nightmare","year":2001,"developer":"Darkworks S.A.","url":"PS2_COLLECTION_PART1/Alone%20in%20the%20Dark%20-%20The%20New%20Nightmare%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":4048317782,"score":7.1,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Survival horror > Detective / mystery > Horror","desc":"<p>Edward Carnby, private eye of the paranormal, is back.</p><p>Carnby's best friend, Charles Fiske, has been found dead near Shadow Island, a mysterious island near Maine. It is your duty to take up the investigation and find out the secrets of Shadow Island. But you're not going alone... your companion will be a redhead by the name of Aline Cedrac who has her own reasons for tagging along. Aside from being a woman and inexperienced in the world of danger, she is the only one with the knowledge for translating the ancient Abkhani tabloids which may hold the secrets behind Carnby's friend's death and the disappearance of Aline's father.</p><p>Upon arriving on the island, your plane has been shot down by the things unknown, and the heroes have no other choice but to jump with a parachute, thus separating them on the island.</p><p>Now you choose the character to play with, either as Edward Carnby or Aline Cedrac, as they explore the mysterious and gloomy island with all its secrets and parallel stories that contain different locations and tasks for different characters, thus adding the level of replayability in a different experience - Carnby's story is more action oriented while Cedrac has more puzzles to solve. </p><p>Just like in the predecessors you move your characters through pre-rendered backgrounds while the camera perspective switches around. You collect various items and books which are used to solve puzzles. Many situations can only be solved with violence which means you'll have to use guns to get rid of your foes. Aiming is manual and especially when playing Cedrac ammo is scarce. Saving a game uses up a save medallion which can be found during the game.</p>"},{"name":"Alpine Racer 3","year":2002,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART1/Alpine%20Racer%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":462760294,"score":"","genres":"Sports > 1st-person > Behind view > Snowboarding / skiing","desc":"<p><em>Alpine Racer 3</em> is a downhill ski racing game. It is based on the arcade <em>Alpine Racer</em> series played on a cabinet where the player stands on a set of ski-like foot stands that are moved with horizontal motions to steer and taking corners while holding onto two bars for stability. This is the first game in the series made for a console system. The features and game modes are most likely not identical to the Alpine Racer 3 arcade game. A first for the series, it mixed skiing with snowboarding previously featured in the arcade game Alpine Surfer.</p><p>The main game mode is the Extreme Winners Cup that features cross races, slalom, one-on-one and time attack. These largely serve to qualify for the tournaments. There are eight characters to choose from (one initially locked) and several courses. Each character has different statistics based on speed, turning and power. By winning races credits are earned to upgrade the snowboard and ski gear. Next to steering an additional button can be used to crouch and gain extra speed, but this limits movement. The same button is used in the air to perform tricks. The game can be played competitively against another player through a split-screen. Some of the equipment in the game comes from licensed manufacturers.</p>"},{"name":"Alpine Ski Racing 2007: Bode Miller vs. Hermann Maier","year":2007,"developer":"49Games GmbH","url":"PS2_COLLECTION_PART1/Alpine%20Ski%20Racing%202007%20-%20Bode%20Miller%20vs.%20Hermann%20Maier%20%28Europe%29%20%28En%2CDe%29.zip","filesize":617574014,"score":7,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Snowboarding / skiing > Licensed","desc":"<p><em>Alpine Ski Racing 2007</em> is the sequel to both the <em>Ski Racing</em> series and RTL Ski Alpin 2006, but has overall more similarities to the latter. It's a downhill ski racing game.</p><p>The game features three different difficulties and it comes with six game modes: slalom, giant slalom, super-g, downhill, free ride and speed-downhill. But the heart of the game is the career mode: here the player undergoes a whole season and tries to be as successful as possible - a good enough overall rank will cause a promotion to the next higher league for the next season. Before every event there are a number of possibilities, e.g. betting on the outcome and choosing the correct wax compound. Other important parts are to keep the financial balance and to train - a certain amount of training points are divided to the athlethe's abilities. If the player doesn't want to do this himself, he can hire a coach. The controls during the events consist of steering, accelerating and, if needed, carving for faster turns.</p><p>There are overall 38 different races on 16 different peaks to ski from. Players can create their own athlete or choose one of the few pre-defined, which are modelled after real-life athletes, including Bode Miller and Hermann Maier.</p>"},{"name":"Alpine Skiing 2005","year":2005,"developer":"49Games GmbH","url":"PS2_COLLECTION_PART1/Alpine%20Skiing%202005%20%28Europe%29.zip","filesize":161734174,"score":"","genres":"Sports > Diagonal-down > Arcade > Managerial / business simulation > Direct control > Snowboarding / skiing","desc":"<p><em>Alpine Skiing 2005</em> is a skiing game featuring the following game modes:</p><ul><li>Quick Start</li><li>Practice</li><li>Career</li><li>Challenges</li></ul>"},{"name":"Alter Echo","year":2003,"developer":"Outrage Games","url":"PS2_COLLECTION_PART1/Alter%20Echo%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3709322001,"score":6.6,"genres":"Action > 3rd-person (Other) > Fighting > Puzzle elements > Sci-fi / futuristic","desc":"<p><em>Alter Echo</em> is a third-person action game with a focus on close quarters combat. It is set in the 29th century where a substance named Multiplast replaces all known construction materials because it can be formed into anything. But something is wrong on the planet Proteus, the only known source of Multiplast. Now the simple worker Nevin has to investigate and stop the megalomaniac shape shifter Paavo who controls an even more powerful substance.</p><p>Luckily soon after the beginning of the game Nevin gets his hands on a special suit, which allows him to morph into three forms. The sword form is for melee combat, in which combos can be triggered by using the correct button combinations. The cannon form is a big robot which is more suited for gunplay and the stealth form is a futuristic lizard with a long tongue. During combat the player can instantly switch between the forms, which allows for many combinations depending on the former action or movement. This gets rewarded with plasma points which are used to upgrade Nevin's life energy, new moves or better weapons.</p><p>Besides combat, the game features basic switch puzzles and rhythm-based mini games. Most notable is the Time Dilation Mode, which can be activated near enemies - then the mini game begins and, if successfully completed, launches an especially powerful attack.</p>"},{"name":"Altered Beast","year":2005,"developer":"Sega (Shanghai) Software Co., Ltd.","url":"PS2_COLLECTION_PART1/Altered%20Beast%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1818244008,"score":5.7,"genres":"Action > Behind view > Arcade > Beat 'em up / brawler > Puzzle elements > Survival horror","desc":"<p>A helicopter flying over Foret Town is attacked by a mysterious monster.  The only survivor is an amnesiac who was sealed in a metal crate.  After being ambushed by monsters on the town's outskirts, he discovers that he can transform into a powerful werewolf.  He continues on to discover who he is, and why he was sent to Foret Town.</p><p>When players control as Luke, they are not very strong.  But he is able to transform into a werewolf, which can perform high jumps in addition to becoming incredibly powerful.  Fighting monsters will give Luke DNA data that will allow him to upgrade his beast attacks for more powerful combos.  More beast forms can be discovered, each with their own special powers to overcome previously impassable obstacles.</p>"},{"name":"Alvin and the Chipmunks","year":2007,"developer":"Sensory Sweep Studios","url":"PS2_COLLECTION_PART1/Alvin%20and%20the%20Chipmunks%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":365321265,"score":5.2,"genres":"Action > Simulation > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p><em>Alvin and the Chipmunks</em> is a game based on the movie with the same name. Alvin, Simon and Theodore must play at different venues to win the right to play at the battle of the bands event called \"Rockathonapalooza.\" By clearing each venues in Story Mode, the player unlocks more venues to play at. The songs unlocked in Story Mode become available to play in Quick Play and Multiplayer or to watch in Video Mode. The gameplay is similar to Rock Band or Guitar Hero, but without the instruments. Using the controller's buttons, the player must hit the blue, pink, green and yellow Star Targets in sync with the music. Note streaks will give an up to 4x score multiplier bonus, but missing notes will deplete the Rockometer. The song fails if the Rockometer drops and turns completely red.</p><p>The track list includes songs such as:* The Chipmunk Song – Alvin and the Chipmunks</p><ul><li>Karma Chameleon – Culture Club</li><li>All the Small Things – Blink-182</li><li>Walkin' on the Sun – Smash Mouth</li><li>Blitzkrieg Bop – The Ramones</li></ul>"},{"name":"Amagami","year":2009,"developer":"Enterbrain, Inc.","url":"sony_playstation2_a/Amagami%20%28Japan%29.zip","filesize":2997643221,"score":"","genres":"Adventure > Simulation > Anime / Manga > Dating simulation > Japanese-style adventure > Visual novel > Contemporary > Comedy > Romance","desc":"<p>One frigid Christmas Eve, a young man, Junichi Tachibana, had his heart broken. Now, two years into his time in high school, at the prime time of his youth, he is wary of falling in love again, and has a particular adversity to Christmas. But through his casual conversations and daily life with six girls— Haruka Morishima, Kaoru Tanamachi, Sae Nakata, Ai Nanasaki, Rihoko Sakurai, and Tsukasa Ayatsuji— he will surely discover that one of them has the potential to melt his frozen heart at last.</p><p>Amagami is a dating simulation game by Enterbrain, and a spiritual successor to their 2006 hit, KimiKiss. It is somewhat unique from other titles in its genre, in that the player follows a non-linear scenario map allowing them to access scenes which advance the game's story. Making the right choice during these scenes will unlock additional scenes and further progress the story, hopefully leading the player towards a good ending with one of the game's six unique and quirky heroines.</p>"},{"name":"Amagami (ebKore Plus Edition)","year":2011,"developer":"","url":"sony_playstation2_a/Amagami%20%28Japan%29%20%28ebKore%20Plus%29.zip","filesize":3533247934,"score":"","genres":"Special edition > Extra content / game","desc":"<p>This <em>ebKore Plus Edition</em> is an enhanced release of Amagami which includes following additional content:* Mahjong game</p><ul><li>Conversation tree mode</li><li>Savefiles transfer option that allows carrying savefiles over from the original Amagami release</li></ul>"},{"name":"America's 10 Most Wanted","year":2003,"developer":"Black Ops Entertainment, LLC","url":"PS2_COLLECTION_PART1/America%27s%2010%20Most%20Wanted%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v1.04%29.zip","filesize":3541036270,"score":5,"genres":"Action > 1st-person > Shooter > Direct control > Regional differences","desc":"<p><em>Fugitive Hunter: War on Terror</em> is a first-person shooter starring a bounty hunter named Jake Seaver, whose mission is to track and apprehend some of the world's most notorious criminals. </p><p>Developer Black Ops Entertainment drew many of its ideas from the FBI's Most Wanted List to create a game that attempts to mirror the realistic pursuits and criminal behavior associated with nationwide manhunts. The game includes a cinematic story line and motion-captured animation, as well as a variety of weapons that can be modified by players throughout the game.</p>"},{"name":"American Chopper","year":2004,"developer":"Creat Studio, LLC","url":"PS2_COLLECTION_PART1/American%20Chopper%20%28Europe%2C%20Australia%29.zip","filesize":2109928178,"score":5.6,"genres":"Racing / Driving > Behind view > Real-time > Motorcycle > Vehicle simulator > Licensed","desc":"<p>Based on the TV show of the same name, as seen on the Discovery Channel, this game allows you to customize and race motorcycles.</p><p>There are a variety of challenges available, from regular races, to free-roaming city driving (featuring plenty of regular traffic to work around).</p><p>The game has you be the \"new guy\" on the show; the Teutuls (voiced by the actual people from the show) send you on the various missions. Each mission features several goals, some mandatory while others are optional. Completing the goals unlocks new motorcycles and parts.</p>"},{"name":"American Chopper 2: Full Throttle","year":2005,"developer":"Creat Studios, Inc.","url":"PS2_COLLECTION_PART1/American%20Chopper%202%20-%20Full%20Throttle%20%28Europe%29.zip","filesize":710796389,"score":"","genres":"Racing / Driving > Behind view > Arcade > Motorcycle > Vehicle simulator > Licensed","desc":"<p><em>American Chopper 2: Full Throttle</em> is the sequel to American Chopper and like its predecessor, based on the Discovery Channel show of the same name.</p><p>You pick one of the four main characters from the show, then one of seven customer motorcycles from the show, and are given a series of mostly racing missions where you earn fabrication points with which to upgrade your bike. These missions include things like nitrous boosts for quick bursts of speed and point bonuses for performing tricks.</p><p>Since <em>American Chopper</em> is a show about making custom bikes, this game offers a wide variety of performance and aesthetic upgrades with the ultimate objective of building your perfect custom motorcycle.</p>"},{"name":"American Idol","year":2003,"developer":"Hothouse Creations Ltd.","url":"sony_playstation2_a/American%20Idol%20%28USA%29.zip","filesize":1572264045,"score":5.1,"genres":"Action > 3rd-person (Other) > Game show / trivia / quiz > Music / rhythm > Licensed > Regional differences","desc":"<p><em>American Idol</em> is a rhythm game based on the reality TV singing competition of the same name.</p><p>Players can create characters of either gender, choosing from several character templates, and then customizing them with body size, skin color, and one of three singing voices per gender.</p><p>Created characters can then be taken through the game's various modes. In the main Competition mode, players move through different stages patterned after the TV series, from auditions to shows with a live audience and hopefully the finals. Between performances, outfit, hair style and color and make up can be customized, since not only the singing but also the style will be judged.</p><p>Playing the actual game involves a target on the screen into which symbols move in from four directions. The correct button has to be pressed in rhythm with the music when the appropriate symbol reaches the center. Besides single presses there are also connected symbols where the button has to be held and released or two buttons have to be pressed at the same time. The game also supports dance mats as an alternate type of control. Each symbol hit or not hit is graded according to the timing. Missing or hitting symbols off-sync will lead to the vocal track becoming increasingly off-key and will make it much harder to get into the next round. Completing the different stages of the competition unlocks bonus costumes as well as sets that can be used in the game's other modes.</p><p>Besides the Competition, there is the Rehearsal mode in which songs can be practiced without judges. The Jukebox mode allows simple playback of songs, while Karaoke mode allows players to actually sing along to songs. There is no scoring included, but it's possible for other players to judge the performance afterwards. Party mode enables up to four players to engage in a small competition, with players allowed to judge each other.</p><p>Visually, the game employs a cel shading style in which singers and judges are rendered. The American version includes the likenesses and voices of the three original TV judges Paula Abdul, Simon Cowell and Randy Jackson. The UK version retains only Cowell and the German version features no original judges, their places being taken by generic characters. The game's soundtrack consists of around 40 licensed pop songs. Video clips from the respective regional versions of the TV program play between stages of the competition mode.</p>"},{"name":"American Tail, An","year":2007,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART1/American%20Tail%2C%20An%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":158647118,"score":"","genres":"Action > Racing / Driving > 3rd-person (Other) > Behind view > 2D scrolling > Mini-games > Platform > Direct control > Flight / aviation > Fantasy > North America > Licensed","desc":"<p><em>An American Tail</em> is a game based on the animated movie of the same name. It consists of ten levels (six main ones, four bonus) based on scenes from the movie. Animated scenes from the film are used as cut-scenes. It tells the story how Fievel Mousekewitz and his family leave Russia for America. He becomes separated from his family when a storm hits the ship and eventually ends up in New York.</p><p>In the first level Fievel needs to be rolled in a soap bubble through a course aboard a ship to reach the block of cheese in the center. The player needs to be careful so he does not fall off. Fifteen stars can be collected as an additional challenge and opening up a bonus level with similar gameplay.</p><p>In the second level the player controls the bird Henri, a friend of Fievel. He needs to fly through New York's harbor to reach the docks. Along the way bird seed needs to be collected to keep his energy level up. Often birds cut across the screen and these need to be avoided. In the bonus level Fievel needs to be guided through a street below, avoiding clothes and collecting stars for an additional challenge as he floats down using a piece of clothing with a front view as the screen scrolls vertically. A meter shows the remaining distance.</p><p>In the next level Fievel needs to collect pieces of cheese on the streets of Manhattan to make his way to Gussie Mausheimer's rally. He can move around freely and needs to avoid getting trampled or hit by passing carts. The bonus level has the same vertical gameplay floating down as the previous one.</p><p>Next Fievel needs to follow Digit through the sewers to find his hideout without being spotted. He cannot get too close, but also has to avoid losing sight of Digit. Optionally 25 stars can be collected. The bonus level has the familiar floating down gameplay, but now in the sewer avoiding pipes and steam. Hearts replenish health and then stars can be collected as an additional challenge.</p><p>The second part of the sewer environment is a racing sequence with Fievel on rollerskates. He needs to avoid obstacles and when he hits too many of them he is caught by cats. Optionally fifteen stars can be collected.</p><p>The Secret Weapon is the final level. Here Fievel needs to be navigated along a pier transporting the secret weapon to scare the cats onto the Hong Kong Star. Some parts of the pier are very old and will crumble. There is a lives system with hearts as obstacles need to be avoided. There are seventeen cats that can be scared into the water as you make them jump off the pier by getting close.</p>"},{"name":"AMF Xtreme Bowling","year":2006,"developer":"Atomic Planet Entertainment Limited","url":"PS2_COLLECTION_PART1/AMF%20Xtreme%20Bowling%202006%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":404317806,"score":"","genres":"Sports > Direct control > Bowling > Licensed","desc":"<p><em>AMF Xtreme Bowling 2006</em> is a bowling simulation game. It has nine environments, all in regular or \"xtreme\" versions, colorful customizable characters whose stats increase as you play, customizable oil dispersion on the lane and six modes.</p><p>The modes available are practice, single player, which are self-explanatory, tournament and league, which support up to 8 alternating players and match challenge where you must attempt to get strikes with various pin arrangements of increasing difficulty.</p>"},{"name":"Amplitude","year":2003,"developer":"Harmonix Music Systems, Inc.","url":"PS2_COLLECTION_PART1/Amplitude%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1807031371,"score":8.1,"genres":"Action > 1st-person > Music / rhythm","desc":"<p><em>Amplitude</em>, the sequel to Frequency, is a fast-paced music game with over 25 levels, customizable avatars, online play with up to 4 players, and remixing. The point of the game is to play the notes to the beat while moving between different musical tracks for each song. When beginning a game, players have a few songs to choose from. More songs and items to visually customize the player character have to be unlocked. The soundtrack consists of songs by popular artists, including P.O.D. (remixed by The Crystal Method), Freezepop, Blink-182, Garbage, Weezer, David Bowie, Symbion Project, Run-DMC, Pink, Papa Roach, Slipknot and others.</p>"},{"name":"AND 1 Streetball","year":2006,"developer":"Black Ops Entertainment, LLC","url":"PS2_COLLECTION_PART1/AND%201%20Streetball%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3709881099,"score":5.6,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>In this officially licensed AND 1 Street basketball game, players can take it to the streets with playground legends like The Professor, Main Event, Hot Sauce, and Half Man Half Amazing in 5-on-5 down to 1-on-1 matchups. Ballers can play on over a dozen courts all across the world, from Venice Beach on the West Coast, to Rucker Park in the East, and even \"Down Under\" in Australia. Players can also use the Create-a-Baller feature to build their own Streetball persona and enter the story-driven AND 1 Mix Tape Tour to secure a contract with AND 1 and earn a place among legends.</p><p>The game features motion-captured trick moves, spectacular dunks, and full voiceovers and likenesses of the entire AND 1 team. Multiplayer games are supported on both PS2 and Xbox. If you have the EyeToy camera, you can also put your face in the game (PS2 only).</p>"},{"name":"Angel Wish: Kimi no Hohoemi ni Chu!","year":2005,"developer":"Favorite","url":"sony_playstation2_a/Angel%20Wish%20-%20Kimi%20no%20Egao%20ni%20Chu%21%20%28Japan%29.zip","filesize":1350786707,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Originally released as Angel Wish: Houkago no Meshitsukai ni Chu! for PC (Windows) as a romantic adult visual novel, this console port reduces rating level by removing adult content and readjusting the story to work without it. The premise remains pretty much the same. You are Seiya Kiyoshi, just another student enrolled in a private school. One day, a girl in maid outfit comes before you and tells you that you are the prince of Stella kingdom. She tells you that your life at the school campus was monitored and that you appear too shy which is not befitting the prince and that she is here to help you in your education for being a true emperor while attending the school life.</p><p>The game characters can change poses, but do not feature any talking animation except blinking eyes at random. On screen text can be turned off to see the clear background with on-screen characters. Voice-acting is present for all the characters except the protagonist. Bonus section which is accessible via main menu contains unlockable galleries, movies, and BGM player. A rather unique bonus feature is that you can see the heroines and list through their various poses and outfits that they use in the game. During conversations characters will move away or closer to you to simulate proximity as well as to emphasize whispering or yelling from a distance.</p>"},{"name":"Angelic Concert","year":2003,"developer":"Kogado Studio, Inc."},{"name":"Animal Soccer World","year":2006,"developer":"The Code Monkeys Ltd.","url":"PS2_COLLECTION_PART1/Animal%20Soccer%20World%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":443623387,"score":"","genres":"Educational > Puzzle > 3rd-person (Other) > Mini-games > Graphics / art > Pre-school / toddler","desc":"<p><em>Animal Football</em> is a puzzle game featuring Dingo Pictures half-hour cartoon titled <em>Das unglaubliche Fussballspiel der Tiere</em> which is about two animal football teams playing a game against each other. Gameplay in the original PlayStation release consists of slide puzzles as well a colouring activity.</p><p>The game was re-released as <em>Animal Soccer World</em> on the PlayStation 2 three years later. Two more minigames were added for the PS2: a Concentration-like card-matching game and some jigsaw puzzles.</p>"},{"name":"Animaniacs: The Great Edgar Hunt","year":2005,"developer":"Warthog Plc","url":"PS2_COLLECTION_PART1/Animaniacs%20-%20The%20Great%20Edgar%20Hunt%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1577499963,"score":6.7,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Fantasy > Licensed","desc":"<p>Hollywood is in an uproar - the Edgar awards for films have been stolen! The culprit is none other than C.C. Deville, who is threatening to melt down the Edgars unless he gets a ten-picture deal from Warner Bros.! Deville arrives in his airship, but accidentally crashes into the Water Tower, scattering the Edgars across the various movie lot and freeing Yakko, Wakko, and Dot at the same time. Help the Warners reclaim the Edgars!</p><p><em>Animaniacs: The Great Edgar Hunt</em> is a 3D platformer where the player controls Yakko, Wakko, and Dot. Each character has their own special skills that can be unlocked as players progress through the game. For example, Dot can limbo under low walls, Wakko can dig tunnels in soft earth, and Yakko can bomb weak walls. Players progress further through the game by collecting Edgar awards which opens up more areas in the Warner Movie Lots. There are also 300 collectibles in each world; players are awarded one Edgar at 150 collectibles and another at 300.</p><p>In addition to this, there are also bonus mini-games guest-starring Pinky and The Brain. Each of their short games features another failed attempt at world domination. The game also has the original cast of the cartoon reprising their roles for the game. There are also plenty of movie parodies, and it also takes the opportunity to riff a couple of video games as well.</p>"},{"name":"Another Century's Episode","year":2005,"developer":"FromSoftware, Inc.","url":"sony_playstation2_a/Another%20Century%27s%20Episode%20%28Japan%29.zip","filesize":2632879216,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Flight / aviation > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>In the future, interstellar political strife has led to the formation of a global governing body called the United Community of Earth, or UCE. Recently, global energy shortages have led to the development of a new energy source, a powerful substance named E2. However, there are those who want it for their own personal gain, and the UCE defense forces are the front lines in protecting the Earth against rebel groups.</p><p><em>Another Century's Episode</em>, is an robot anime crossover action game, comparable to a cross between Zone of the Enders and Super Robot Taisen. Starting as a rookie UCE pilot, the player will fight against and alongside many characters from nine famous robot anime series, piloting 40 different so-called real robots. The game features a heavy focus on fast-paced aerial combat. All mechs can fly and boost continuously -- even those that could not in their original appearances -- and have numerous weapons and abilities closely modeled after the source material.</p><p>Much like the Armored Core series by the same developer, the game is divided into missions, each with multiple objectives. Completing missions moves the story forward, and also earns Ace points, which can be used to purchase new mechs, upgrade their ship's storage capacity (allowing for more mechs), or upgrade individual mechs in various ways. Each mission also features a \"secret object\", and completing enough of these will unlock additional machines to purchase. Completing the story will open a \"free mission\" mode where any mission in the game can be replayed for better rank or to complete the secret objective. There is also a two-player battle mode, where any two unlocked machines can battle head-to-head.</p><p>The game features playable mechs from the following series:</p><ul><li><em>Aura Battler Dunbine</em></li><li><em>Blue Comet SPT Layzner</em></li><li><em>Brain Powered</em></li><li><em>Heavy Metal L-Gaim</em></li><li><em>Martian Successor Nadesico: Prince of Darkness</em></li><li><em>Metal Armor Dragonar</em></li><li><em>Mobile Suit Zeta Gundam</em></li><li><em>Mobile Suit Gundam: Char's Counterattack</em></li><li><em>Mobile Suit Gundam Wing</em></li></ul>"},{"name":"Another Century's Episode 2","year":2006,"developer":"FromSoftware, Inc.","url":"sony_playstation2_a/Another%20Century%27s%20Episode%202%20%28Japan%29.zip","filesize":2294623364,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Flight / aviation > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>Tak Kepford and Marina Carson are test pilots for a series of mecha called Arks. Following a test run of a new Ark series mecha prototype dubbed Gun Ark, the UCE base where the test was carried out is attacked by another group, attempting to steal a prototype Gundam also being tested there. During the attack, Marina is killed, Gun Ark is destroyed, and the Gundam prototype is stolen. Tak joins up with the Albion corps to help track down the stolen machine, but soon winds up involved in something much larger...</p><p><em>Another Century's Episode 2</em> is a sequel to the first title, and once again features fast-paced airborne robot action and dozens of mechs to pilot from a wide range of robot anime series. The game is structured similarly to the first, with the scenario broken into missions, each with multiple objectives, including secret objectives. Clearing missions earns Ace points, which can be used to purchase or upgrade mechs. The free mission and versus battle modes from the original game have also returned.</p><p>The game features playable mechs from the following series:</p><ul><li><em>Aura Battler Dunbine</em></li><li><em>Blue Comet SPT Layzner</em></li><li><em>Brain Powered</em></li><li><em>Heavy Metal L-Gaim</em></li><li><em>Martian Successor Nadesico</em></li><li><em>Martian Successor Nadesico: The Prince of Darkness</em></li><li><em>Metal Armor Dragonar</em></li><li><em>Mobile Fighter G Gundam</em></li><li><em>Mobile Suit Gundam 0083: Stardust Memory</em></li><li><em>Mobile Suit Gundam: Char's Counterattack</em></li><li><em>Mobile Suit Gundam Wing: Endless Waltz</em></li><li><em>Superdimensional Fortress Macross</em></li><li><em>Superdimensional Fortress Macross: Do You Remember Love</em></li><li><em>Wings of Rean</em></li></ul><p>A second version of <em>A.C.E. 2</em>, dubbed the <em>Special Vocal Version</em> was released shortly after A.C.E. 3. This version adds the the vocal theme songs for each series as optional background music, but is otherwise identical.</p>"},{"name":"Another Century's Episode 3: The Final","year":2007,"developer":"FromSoftware, Inc.","url":"sony_playstation2_a/Another%20Century%27s%20Episode%203%20-%20The%20Final%20%28Japan%29.zip","filesize":3227639480,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Flight / aviation > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>A few years after the events of A.C.E. 2, a strange meteor lands near the home of average high-school student Barrel Orland. Unidentified life forms begin to attack, and he meets a girl named Fei Roshenande, pilot of a giant robot called the Exbrau. Reluctantly, he joins Fei and becomes a pilot for the Earth Federation, fighting the invading aliens in hopes of stopping their assault on his planet.</p><p><em>Another Century's Episode 3</em> is the third and final entry in the series for the PlayStation 2, and not a whole lot has changed. The game is once again a fast-paced airborne robot action game anime crossover. The storyline is divided into missions, each with multiple objectives, though for the first time there is a branching story with two different endings. Clearing missions earns points to purchase and upgrade mechs, and the free mission and battle modes return once again. New to this version is a cooperative mode, where completed story missions can be played two-player split screen.</p><p>The game features playable mechs from the following series:<em> </em>After War Gundam X*</p><ul><li><em>Aura Battler Dunbine</em></li><li><em>Brain Powered</em></li><li><em>Getter Robo Armageddon</em></li><li><em>Macross Plus</em></li><li><em>Martian Successor Nadesico: The Prince of Darkness</em></li><li><em>Metal Armor Dragonar</em></li><li><em>Mobile Fighter G Gundam</em></li><li><em>Mobile Suit Gundam</em></li><li><em>Mobile Suit Gundam: Char's Counterattack</em></li><li><em>Mobile Suit Gundam Seed</em></li><li><em>Mobile Suit Gundam Wing: Endless Waltz</em></li><li><em>Overman King Gainer</em></li><li><em>Psalms of Planets Eureka Seven</em></li><li><em>Superdimensional Fortress Macross: Do You Remember Love</em></li><li><em>Turn A Gundam</em></li><li><em>Wings of Rean</em></li></ul>"},{"name":"Ant Bully, The","year":2006,"developer":"Artificial Mind & Movement","url":"PS2_COLLECTION_PART1/Ant%20Bully%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":705051830,"score":5.7,"genres":"Action > Behind view > Licensed","desc":"<p>Based on the animated movie, <em>The Ant Bully</em> puts you in the role of Lucas, a 10-year old boy who passes his time by tormenting an anthill. Before he knows it, the ants use a magic potion to shrink him down to their size. Then they put him to work for the colony, giving him a fresh perspective on life.</p><p>The game is played from a 3D third-person perspective. Most actions are context-sensitive, performed with the press of one button, e.g. Lucas automatically jumps when running off a ledge. You play various missions and receive medals upon their completion. These medals are worth varying amounts, depending on how well you played: gold is 50 points, silver is 30 points, and the bronze is 10. You use these medals to unlock special abilities every time you reach 300 points. The missions mostly involve fighting enemies and collecting items scattered in the game world.</p>"},{"name":"Antz Extreme Racing","year":2002,"developer":"Supersonic Software Ltd.","url":"PS2_COLLECTION_PART1/Antz%20Extreme%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":493355917,"score":5.4,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>In <em>Antz Extreme Racing</em>, the characters of the movie <em>Antz</em> are bored and start a racing championship. Each character has eight individual courses and challenges they must take on; besides the initial two the rest has to be unlocked by finishing the game with another character. Like in most arcade racers there are various power ups to collect, e.g. rockets or protective shields. The game features four basic race types: driving the backs of larger bugs, running, flying on the backs of bugs, or surfing on a leaf. </p><p>The game also can be played in four-player split-screen multiplayer.</p>"},{"name":"Anubis II","year":2005,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART1/Anubis%20II%20%28Europe%29.zip","filesize":110212302,"score":3.6,"genres":"Action > Behind view > Platform > Puzzle elements > Egypt (Ancient)","desc":"<p>A long time ago, an evil spirit known as Mumm'hotep sank the land of Egypt into eternal darkness. A deadly curse was spread across the once peaceful civilisation. The Gods had to send one man to deal with this threat, the warrior of the sand... Anubis. The player is armed with an arsenal consisting of the scepter of Ra and the Kanopic bombs of fury, with this, Anubis sets off to save Egypt once and for all! In this game, the player will have to face off with legions of evil enemies across nine playable levels of gameplay.</p><p>The player controls Anubis from a third-person perspective through levels with platform puzzles and enemies that are taken out by swinging his staff or locking on to them and shooting energy balls. In each level Anubis needs to find eight pyramids that open up the portal to end the stage. Contrary to the title, this is not the sequel to an earlier game.</p>"},{"name":"Anya ni Sasayaku: Tantei Sagara Kyōichirō","year":2006,"developer":"Design Factory Co., Ltd."},{"name":"Ao no mama de.. (Treasure Box)","year":2004,"developer":"","url":"sony_playstation2_a/Ao%20no%20mama%20de...%20%28Japan%29%20%28Treasure%20Box%29.zip","filesize":1346805185,"score":"","genres":"Special edition > Physical extras","desc":"<p>This retail limited edition boxed release includes:</p><ul><li>Ao no mama de... game</li><li>Audio drama CD</li><li>Artbook</li></ul><p>Artbook is A5 size and contains:</p><ul><li>Character art (fully colored, page 3-10)</li><li>Sketch art (black &amp; white, page 11-59)</li></ul>"},{"name":"Aoi Shiro (Shokai Genteiban)","year":2008,"developer":"","url":"sony_playstation2_a/Aoi%20Shiro%20%28Japan%29.zip","filesize":3294713828,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition release includes:</p><ul><li>Aoi Shiro game</li><li>Audio drama CD</li><li>Special booklet</li></ul>"},{"name":"Ape Escape 2","year":2002,"developer":"Sony Computer Entertainment Inc.","url":"PS2_COLLECTION_PART1/Ape%20Escape%202%20%28Europe%29.zip","filesize":1694428675,"score":7.8,"genres":"Action > Behind view > Anime / Manga > Platform","desc":"<p><em>Ape Escape 2</em> is the sequel to Ape Escape. In this platform game it's your goal to catch all the apes jumping, walking and flying around the diverse levels the game has to offer.</p><p>A large arsenal of gadgets can be used to make it all a little easier, with the catching net being the most important weapons of them all. Other gadgets include a RC Car, to drive over monkey's and collect objects, an Ape Radar, to detect the nearest monkey, a baseball bat, to hit monkeys unconscious, and a magnet, to move certain objects in the maps.</p><p>Your quest is to catch all monkeys in the levels and to stop the evil Specter from taking over the world. All monkeys in the levels are somewhat unique with their own character abilities and their unique name. Some monkeys just sit on their place, while others attack you with projectiles or run away quickly.</p>"},{"name":"Ape Escape 3","year":2005,"developer":"Sony Computer Entertainment Inc.","url":"PS2_COLLECTION_PART1/Ape%20Escape%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2821510497,"score":7.7,"genres":"Action > Behind view > Platform > Puzzle elements","desc":"<p>Specter is back once again in the third main game in the <em>Ape Escape</em> series. With the help of a human scientist named Doctor Tomoki, Specter has turned the monkeys loose on TV. Even the previous heroes of the series - Jimmy, Spike, and the professor - are all caught up in the insidious TV shows.</p><p>Kei and Yumi take the lead as the new heroes. Their quest is to capture all 400 monkeys. You control either Kei or Yumi. The gameplay involves using various methods and weapons to catch them all. The game has many levels with different themes, such as a Haunted Castle, a Racing level, Jungle settings, TV studios and other settings. You can slow the animals down with various objects such as a stun club or a slingback shooter, and then you can capture them with a net. </p><p>New to the series are the morphing abilities, eight in all. You can morph into various characters, like a knight and perform a powerful attack or a gun fighter and shoot em up or a ninja and run along walls. You can also vehicles such as a race car to knock down the monkeys. Other features are the familiar Monkeypedia and the unlockable Mesal Gear Solid mini-game (a Metal Gear Solid spoof).</p>"},{"name":"Ape Escape: Pumped & Primed","year":2004,"developer":"Sony Interactive Entertainment Inc.","url":"sony_playstation2_a/Ape%20Escape%20-%20Pumped%20%26%20Primed%20%28USA%29.zip","filesize":3301119007,"score":"","genres":"Action > Diagonal-down > Arcade > Board game > Fighting > Tank","desc":"<p><em>Ape Escape: Pumped &amp; Primed</em> is a party game for up to four players using the multitap accessory.</p><p>The game has a story mode and a VS mode. The story mode features several intermissions with videos advancing the storyline. In either mode, the gameplay consists of a series of multiplayer games with four characters battling for points to win the first place, with CPU controlled characters filling in for missing players.</p><p>The rounds have various gameplay modes: arena fighting (sometimes with tanks, slingshots, RC-cars etc.), platforming and coin collecting, underwater fights, car racing, boat racing etc.</p>"},{"name":"Appleseed EX","year":2007,"developer":"Dream Factory Co., Ltd.","url":"sony_playstation2_a/Appleseed%20EX%20%28Japan%29.zip","filesize":470305163,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Direct control > Cyberpunk / dark sci-fi > Licensed","desc":"<p><em>Appleseed EX</em> is a third-person action game based on the 2004 film of the same name, along with the manga of the same name by Masamune Shirow.</p><p>The plot builds, but expands on the existing lore. It introduces new levels, plots, enemy characters, and a mecha that is new for this game. The director Aramaki himself, who is also a mechanical designer for the game, has drawn a number of new environments, enemy mechanics, and weapons. There is a large number of weapons available in the game and the gameplay is fast-paced, often facing multiple enemies in a small environments with a mix between melee and ranged combat. An inventory is used to switch between weapons.</p><p>The game contains original cutscenes that can only be seen in the game, which were created by the movie staff, including director Shinji Aramaki. The imaging was developed by Aramaki and Digital Frontier.</p>"},{"name":"Aqua Aqua: Wetrix 2","year":2000,"developer":"Zed Two Game Design Studio","url":"PS2_COLLECTION_PART1/Aqua%20Aqua%20-%20Wetrix%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":587429570,"score":6.9,"genres":"Puzzle > Diagonal-down > Falling block puzzle","desc":"<p>Much like the original Wetrix, you must use the many different shaped blocks and build dams around the playing field to trap the water, so it won't flow off. In this version there is a story mode, where you must complete each level under a certain time limit to advance to the next. </p><p>The play field has also had some changes, with each part of the playing field represented by a bingo card in the bottom left of the screen. Every time you clear a part of the area, one of the areas on the bingo card is ticked off.</p><p>A new training mode helps you improve your speed and accuracy, and of course there is a two player battle mode, for those who wish to prove they are Wetrix champions.</p>"},{"name":"Aqua Teen Hunger Force: Zombie Ninja Pro-Am","year":2007,"developer":"Creat Studios, Inc.","url":"PS2_COLLECTION_PART1/Aqua%20Teen%20Hunger%20Force%20-%20Zombie%20Ninja%20Pro-Am%20%28Europe%29.zip","filesize":2325801933,"score":4.8,"genres":"Action > Racing / Driving > Sports > 3rd-person (Other) > Real-time > Golf > Licensed","desc":"<p>This game is based on the animated Adult Swim show <em>Aqua Teen Hunger Force</em>, featuring the crime fighting trio of food items Master Shake, Frylock and Meatwad.</p><p>Frylock had been admitted into the prestigious and exclusive Jersey Pines golf course... while Shake was rejected (he didn't actually apply, but that doesn't stop him from complaining about it). So, Shake decides to challenge Frylock in a game of golf just to prove that he's just as worthy as Frylock to be playing on that golf course. Who cares that Shake has no clue how to play golf? He's angry.</p><p>The game plays like a mix between a quite simplified golf simulator, an action game and has golf cart racing elements thrown in for good measure.</p><p>The game switches between three game mechanics. Golfing uses a basic approach: choosing a club (five choices) and aiming in the general direction. Then the power meter appears and the power/accuracy of the shot is determined by stopping the meter with the right timing. Of course the goal is to put the ball into the hole, but in some levels there are certain tasks to solve first, e.g. playing the ball through gates. After each hit, the player has to walk to the new location of the ball. Here come the action elements into play as infinitely spawning enemies have to be fend off by pressing the attack button a lot. Lastly there are golf cart races against the aliens. Those are essentially straight runs to the goal with some power-ups to collect and use (bazookas or speed-ups).</p><p>The game features lots of extras as well, such as four full episodes of the show (one of which is unaired), artwork and movie clips.</p>"},{"name":"Ar tonelico II: Melody of Metafalica","year":2007,"developer":"Gust Co., Ltd.","url":"PS2_COLLECTION_PART1/Ar%20tonelico%20II%20-%20Melody%20of%20Metafalica%20%28Europe%29.zip","filesize":3880465930,"score":7.4,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>In the world of Ar Ciel, the Reyvateil region is being threatened by an epidemic that's been killing the citizens. A knight from the Grand Bell, Croix, is sent there to deal with the epidemic. The people of Metafalss, lead by the Grand Bell, rebel against the Goddess who controls the world, in order to achieve their dream and create a utopia by singing a Song in the Hymnos language, called Metafalica - as the legend says.</p><p><em>Melody of Metafalica</em> is an RPG, much like its predecessor, Melody of Elemia, that takes place one and a half years later. It is the second installment in the <em>Ar tonelico</em> series. The turn-based battle sequences from the random enemy encounters are split up into two phases. In the first one, Attack, the different characters can perform various attacks until a time gauge runs out. When there is a Reyvateil in the party, a member of the race who can wield magic by transforming sounds into energy, players can determine which magic to use and the moment to unleash it. In the second phase, Defend, enemies have the opportunity to attack and will target the (up to two) Reyvateil who are singing at the back of the party. The other characters must then defend by timing the defensive moves. The effectiveness of attacks is also often determined by how well the attacks are synced to the requests of the Reyvateil.</p><p>The game is largely centered around female heroines and it contains a dive system where Croix can dive into the mind (Cosmospheres) of certain Reyvateils to get to know their feelings and emotions. That game element plays out with text-heavy dating-style elements where the choices can alter the storyline and it is also the system through which new Song Magic is crafted. Diving can only be done to the three main characters in the game and Croix needs to commit to one, it is not possible to hop between them. New \"evil\" Reyvateil can be converted by using the Dive system and afterwards they will contribute to the party. These are equipped through an additional item slot that affects a character through offensive or defensive means.</p>"},{"name":"Ar tonelico: Melody of Elemia","year":2006,"developer":"Gust Co., Ltd.","url":"PS2_COLLECTION_PART1/Ar%20tonelico%20-%20Melody%20of%20Elemia%20%28Europe%29.zip","filesize":2780825648,"score":7.3,"genres":"Role-playing (RPG) > Diagonal-down > Isometric > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>The story of <em>Ar tonelico: Melody of Elemia</em> takes place in the world of Sol Ciel, a world consisting of two floating islands connected by the Tower of Ar tonelico. Long ago people had built up a great civilization under the guidance of the goddesses the Trio of Elemia, but over the years things have changed; there were two disasters that have lead towards the destruction of the world. In the first disaster most of the lands and skies were lost, in the second the super civilization was lost; now in the third era another disaster is beginning. Viruses born in the Altar of Apostles have begun to appear, though normally not in physical form have now taken on the form of monsters and could destroy the world. In the upper levels of the Tower is a city called Platina where the Knights of Elemia reside; their job is to control virus outbreaks to preserve the tower. One such knight is Lyner Barsett; the main character of the story, he will need to go on a quest to find the Hymn Crystal which can save the Tower of Ar tonelico and the whole world.</p><p><em>Ar tonelico: Melody of Elemia</em> is an RPG style game where you control Lyner Barsett. As the game begins, your airship crashes in the lower world; you'll not only need to locate the Hymn Crystal somewhere in the lower world, but then figure out how to return to the upper levels of the tower! Gameplay features both an exploration mode and battle mode. When exploring you can wander around the many locations of Sol Ciel; you'll encounter numerous people to talk to, various towns and cities, as well as locate useful items. In many areas battles are randomly encountered; on the screen is a colored meter - beginning green, it slowly fades towards red. The closer to red the meter becomes, the greater your chances of randomly encountering a battle. </p><p>Battles in the game are turn based; Lyner as well as other characters in your party each have the ability to perform attacks as well as utilize various skills. Throughout the game you will encounter several characters known as Reyvateils; Reyvateils have the unique ability to sing songs which can be crafted into powerful magic for attacking, healing, or defense. When a Reyvateil is in your party, she remains at the back during battles; you can give her commands on what songs to sing - the longer she sings, the more powerful the magic will become. However singing tires a Reyvateil, and if she sings for too long she becomes so tired the built up magic is lost so you need to make sure to give a command to activate the magic before that happens. Normally opponents don't attack a Reyvateil, only the characters on the front line. Occasionally though an enemy will target a Reyvateil; when this happens you need to make sure other characters protect her, for though Reyvateils can craft powerful magic they are mostly defenseless to enemy attacks! When all opponents in the battle have been defeated, the battle is won and points are earned which can level up your characters.</p><p>Throughout the game you will need to help Reyvateils learn more powerful song magic. To do this you will need to dive into a Reyvateils cosmosphere. The cosmosphere is the world of her mind consisting of her private thoughts and emotions; when there you can interact with the Reyvateil and help her overcome obstacles to learn new songs. However since you are viewing her private thoughts, you first need to gain the trust of the Reyvateil. This is done by interacting in the real world first by talking; talk topics can be found in various locations throughout the world and also after various events. When you have enough talk topics completed you can then dive to the next level in the Reyvateils mind.</p><p>Another important skill Lyner learns early on is Grathmelding; this allows you to combine various items to form new ones. To do so, you will first need to locate a recipe so you know what to combine as well as Grathnode crystal to aid the process. The required items can sometimes be bought in shops or may be found by exploring the world. The items you create may be necessary to get past certain obstacles, or can just help you out in battle.</p>"},{"name":"Arc the Lad: End of Darkness","year":2004,"developer":"Cattle Call, Inc.","url":"sony_playstation2_a/Arc%20the%20Lad%20-%20End%20of%20Darkness%20%28USA%29.zip","filesize":2378445765,"score":5.9,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Fantasy","desc":"<p>Arc The Lad: End of Darkness takes place five years after, yet in the same world as Arc The Lad : Twilight of the Spirits.  The main character is named Edda, who possesses the special skill of exorcism.   Edda must become a hunter to rid the world of possessed beings and restore the balance of nature to the world.  For the first time in the Arc The Lad series, all battle is in action real-time.  Each individual character (25 in all) possess different weapons/attacks (similar to Diablo).  Players are able to collect/combine items and magic cards for special attacks and abilities.  As the player progresses further in the game, their ability levels and ranking increase.  The game is also online enabled so players are able to take their customized players for online co-op and competitive battles.</p>"},{"name":"Arc the Lad: Twilight of the Spirits","year":2003,"developer":"Cattle Call, Inc.","url":"PS2_COLLECTION_PART1/Arc%20-%20Twilight%20of%20the%20Spirits%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3377592673,"score":7.3,"genres":"Role-playing (RPG) > Diagonal-down > Turn-based > Fantasy","desc":"<p>The world of <em>Arc: Twilight of the Spirits</em> is populated by two races: human and Deimos. The two races prefer to avoid contact with each other, but both depend on the Spirit Stones to sustain the balance in the world. Recently, the human army began sweeping across the lands, taking over countries. This army is going after the five great Spirit Stones. The Spirits, however, are determined to prevent this; to achieve their goal, they choose two heroes who would eventually be able to unite the two races in a battle for justice. One of them a is a human nobleman named Kharg, who hates the Deimos and is planning revenge; another is a Deimos slave named Darc, who dreams of uniting and commanding his race. Will the two heroes be able to put aside their differences and save the world?..</p><p><em>Arc: Twilight of the Spirits</em> is the fourth entry in the Arc the Lad series. Like its two immediate predecessors, the game has tactical battles which allow free positioning and movement of the characters on the combat field. However, the game is closer to being a \"regular\" Japanese-style role-playing game rather than a tactical RPG. The player controls a relatively small party (up to six active combatants), and is able to explore towns and dungeons in a standard RPG fashion. In the beginning, the game puts the player into control of Kharg, but afterwards the chapters alternate between the human hero and Darc, each with his own party. Characters can use a variety of techniques, accumulating SP (spirit points) in battles and them using them to learn special attacks.</p>"},{"name":"Arcade Action: 30 Games","year":2006,"developer":"Ivolgamus UAB","url":"PS2_COLLECTION_PART1/Arcade%20Action%20-%2030%20Games%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":256039547,"score":"","genres":"Action > Puzzle > 1st-person > Arcade > Mini-games","desc":"<p>An incredible collection of games that will satisfy the entire family. Think quick and act fast with these challenging and maddeningly addictive games that will bring hours of fun into your home.</p>"},{"name":"Arcade Classics Volume One","year":2006,"developer":"Lucky Chicken Games, Inc.","url":"PS2_COLLECTION_PART1/Arcade%20Classics%20Volume%201%20%28Europe%29.zip","filesize":157353597,"score":"","genres":"Arcade","desc":"<p>Play through not one, not two but SIX classic arcade smash hit games with this amazing retro collection!</p><p>METEOR SHOWER: Avoid being hit by the flying asteroids. Each time an asteroid is hit, it will break down into several smaller faster moving fragments.</p><p>INCOMING: Protect your cities from destruction from incoming missiles using your limited supply of ammo.</p><p>SPACE RESCUE: Save the humans from the marauding aliens and avoid them being picked up and transforming into mutants.</p><p>THE INVADERS: Defend various well-known landscapes around the world from alien invasion.</p><p>ALIEN RAIDERS: Avoid swooping dive-bombing aliens whilst saving the universe.</p><p>BUGS: Destroy the multi-segmented creatures using your bug. Move up and down to get a little closer to the action.</p>"},{"name":"Arcade USA","year":2006,"developer":"Tuna Technologies Ltd.","url":"PS2_COLLECTION_PART1/Arcade%20USA%20%28Europe%2C%20Australia%29.zip","filesize":40697393,"score":"","genres":"Sports > Diagonal-down > Arcade > Direct control > Bowling","desc":"<p><em>Arcade USA</em> is a simple sports game featuring air hockey and 10 pin bowling. Both games have multiplayer support for 2 players.</p>"},{"name":"Arcade, The","year":2005,"developer":"Ivolgamus UAB","url":"PS2_COLLECTION_PART1/Arcade%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":217692982,"score":"","genres":"Action > Arcade","desc":"<p><em>The Arcade</em> is a collection of ten games heavily inspired by classical titles, with modern graphics and sound.</p><p>The games are:</p><ul><li><em>Battling Bats</em> (Pong clone)</li><li><em>Freakoids</em> (Asteroids clone)</li><li><em>Jetpac Jousting</em> (Joust clone)</li><li><em>Moon Mission</em> (Lander clone)</li><li><em>N-Vaders</em> (Space Invaders clone)</li><li><em>Galaxy Warriors</em> (Centipede clone)</li><li><em>Muncher</em> (Q*Bert clone)</li><li><em>Protectors</em> (Warlords clone)</li><li><em>Operation TNT</em> (Bomberman clone)</li><li><em>Pipe Puzzle</em> (Pipe Dream clone)</li></ul>"},{"name":"Arcana Heart","year":2007,"developer":"EXAMU Inc.","url":"sony_playstation2_a/Arcana%20Heart%20%28USA%29.zip","filesize":574234104,"score":7.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting","desc":"<p>Long, long ago, our world and the Elemental world existed as one, but for reasons unknown, they were separated, and if they were to now rejoin, the results would be catastrophic for humanity. In the sky above Tokyo, events are transpiring to lead to just such an event. The only ones who can stop this form happening are the Maidens, young girls with the ability to communicate with beings from the Elemental world known as Arcana.</p><p><em>Arcana Heart</em> is a 2D fighting game ported from the arcade original. Choose one of eleven Maidens, and from eleven Arcanas each with their own unique abilities, and get to the bottom of what's happening in Tokyo. The game plays similarly to the Guilty Gear series, incorporating a variety of advanced techniques such as air dashing and dash cancels, and making for complicated high-speed battles.</p><p>The game includes standard story, arcade, and versus modes, along with a training mode and an unlockable illustration gallery. Players can choose between the original version of the characters or the rebalanced versions from the arcade update Arcana Heart FULL!</p>"},{"name":"Archer Maclean Presents Pool Paradise","year":2004,"developer":"Awesome Studios"},{"name":"Arctic Thunder","year":2001,"developer":"Midway Games, Inc.","url":"PS2_COLLECTION_PART1/Arctic%20Thunder%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":567888522,"score":6.2,"genres":"Racing / Driving > 1st-person > Behind view > Snowmobile","desc":"<p><i>Arctic Thunder</i>, the fourth installment in Midway's arcade racing series, is a fantasy snowmobile-racing game that plays like a mix of Cruis'n and a kart racer on ice.  The main object of the PS2 and Xbox versions is to upgrade sleds and unlock secret characters or tracks.  You earn Gold Medals or lots of points to unlock most secrets, and you do this by winning races.  The gameplay involves shooting down enemies with weapons, boosting yourself ahead, and pulling off tricks.  Exclusive to the console versions is a Battle Mode that emphasizes the game's frantic combat.</p>"},{"name":"Are You Smarter Than a 5th Grader?: Make the Grade","year":2008,"developer":"ImaginEngine Corp.","url":"sony_playstation2_a/Are%20You%20Smarter%20than%20a%205th%20Grader%20Make%20the%20Grade%20%28USA%29.zip","filesize":97816105,"score":"","genres":"Simulation > 3rd-person (Other) > Game show / trivia / quiz > Licensed","desc":"<p>Similar to the earlier game, Are You Smarter Than a 5th Grader?, <em>Make the Grade</em> is a simulation of the TV show. New to this edition are 3000 more questions, improved graphics, and 3 new multi-player modes.</p><p>The new multi-player modes include Academic Academy, (Like the single-player, but questions are randomly picked, and all players get the same questions), Flashcards, (Quickly answer questions) and Spelling Bee (Pick the misspelled word).</p>"},{"name":"Area-51","year":2005,"developer":"Midway Studios - Austin Inc.","url":"PS2_COLLECTION_PART1/Area%2051%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2544904907,"score":7.4,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Regional differences","desc":"<p>Area 51, the urban legend, is a U.S. military-controlled base in the Nevada desert, apparently containing a secret aircraft testing facility. It is also famed as the subject of many UFO conspiracy theories. <em>Area-51</em>, the game, is a first-person shooter (FPS) set in this particular base, now infested with rampant aliens and a mutagenic virus that changes your character. As Ethan Cole, Special Forces, specialist in the HAZMAT (hazardous materials) Division, you have to discover what's going on inside the base and blast the menace to save the world. Your character races against time: the same virus that is mutating the facility personnel into monsters is also in his organism, slowly transforming him into an inhuman creature under the control of the alien masterminds.</p><p>The hero has access to more than ten types of human and alien weapons to fight the creatures. They are designed by Stan Winston Studios, monster creator for such films as <em>Aliens</em>, <em>Jurassic Park</em> and <em>Predator</em>. The weapons can be used in melee combat as well, and it's possible to switch to an alternate firing mode, in some cases with the downside that it consumes more ammo. Ethan can also use a scanner to investigate items of interest, documents, alien artifacts and residue. The information contributes to the backstory and is stored in the scanner's databank.</p><p>At a specific point in the game, you will gain the ability to mutate into a creature for a limited time. All monsters and humans are then highlighted by your thermal vision, and you can use claws in melee and shoot heat-seeking parasites. Staying in the mutant form consumes mutagen, which can then be replenished by draining infected corpses, killing enemies in melee or consuming special syringes with mutagen, as opposed to using normal medical syringes to restore health.</p><p><em>Area-51</em> has a two-player split-screen and an online multiplayer (for up to 16 players) component with several modes including Deathmatch, Team Deathmatch, Capture the Flag, Capture and Hold, and Infection. In Infection, all but one player start as normal healthy soldiers hunting one mutant player. The latter is able to create more mutants by killing opposing players, and thus infecting them.</p>"},{"name":"Arena Football","year":2006,"developer":"EA Tiburon","url":"sony_playstation2_a/Arena%20Football%20%28USA%29.zip","filesize":3664995676,"score":6.3,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (American) > Licensed","desc":"<p><em>Arena Football</em> is a simulation of the sport of the same name. It shares many similarities with the Madden Series, whose engine it uses, but has a different play-style thanks to Arena football's rather different rules. The game is played indoors with teams of eight on a 50-yard field and the sidelines and uprights have barriers to make balls that would go out of bounds in standard American football bounce back into the play field. It is still considered live at this point. Obviously, this makes the game much faster-paced and higher-scoring.</p><p>Features include a coach's pick which will recommend plays, a telemetry view, which lets you see how tired both your players and the opposing ones are along with passing routes so you can set good match-ups, a quick play mode, a season mode, which allows you to go up to 20 seasons and trade players, set salaries, etc, practice and online play.</p><p><em>Arena Football</em> is officially licensed by the Arena Football League and includes all the teams and players from the 2006 season. New Orleans VooDoo is not included as they sat this season out due to hurricane Katrina, though their logo is available to use for created teams. Numerous historic teams are also available.</p>"},{"name":"Arena Football: Road to Glory","year":2007,"developer":"EA Tiburon","url":"sony_playstation2_a/Arena%20Football%20-%20Road%20to%20Glory%20%28USA%29.zip","filesize":1865403653,"score":"","genres":"Sports > Diagonal-down > Football (American)","desc":"<p><em>Arena Football: Road to Glory</em> is a sequel to the original Arena Football game.</p>"},{"name":"Armored Core 2","year":2000,"developer":"FromSoftware, Inc.","url":"sony_playstation2_a/Armored%20Core%202%20%28Europe%29.zip","filesize":1637270503,"score":7.1,"genres":"Action > Behind view > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>The genuine sequel to the original Armored Core. Thrown into the world of AC mechs, you must complete the objectives set for you by a range of different companies, each with a hefty pay packet attached. If the mission is completed, the money goes towards upgrades and repairs to your mech. </p><p>The collection of items to upgrade your mech is fully stocked with weapons, defense systems, rocket packs and guidance systems to increase accuracy and speed. Certain missions require a particular upgrade for the mission to be completed correctly, so spending the cash wisely is important to your career.</p><p>Once your mech is ready for battle, you can also take on a friend in arena mode, where one-on-one battles rage on for as long as you wish in huge outdoor areas.</p>"},{"name":"Armored Core 2: Another Age","year":2001,"developer":"FromSoftware, Inc.","url":"sony_playstation2_a/Armored%20Core%202%20-%20Another%20Age%20%28Europe%29.zip","filesize":2902056726,"score":7.3,"genres":"Action > Behind view > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Another Age</em> is a stand-alone expansion to Armored Core 2, which includes 100 new missions taking place five years after the events of the base game. Once again your task is to complete a range of missions (from destroying enemy mechs to seeking out bases and carriers) and each mission comes with a reward. The money raised goes to upgrading your mech for the bigger battles down the line. Two-player split screen is supported for dog fighting action.</p>"},{"name":"Armored Core 3","year":2002,"developer":"FromSoftware, Inc.","url":"sony_playstation2_a/Armored%20Core%203%20%28Europe%29.zip","filesize":1537253200,"score":7.4,"genres":"Action > Behind view > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Armored Core 3</em> once again puts you in the shoes of a Raven mercenary, with the task of piloting your own battle machine to use in a range of tasks (from destroying other mechs to seek and destroy missions).</p><p>After each mission, you are paid in full. The money raised can then go on towards the purchase of items for your mech. Weapon upgrades, better shields, even the opportunity to purchase what's called an Exceed Orbit, smaller robot gun emplacements that hover around your mech, giving you an added boost of fire power in the crunch. Four-player deathmatch modes are also included, where players pit souped-up mechs against each other to see who is the last robot standing.</p><p>The PSP release includes additional new parts and support for ad-hoc wireless play.</p>"},{"name":"Armored Core: Formula Front - Extreme Battle","year":2005,"developer":"FromSoftware, Inc.","url":"sony_playstation2_a/Armored%20Core%20-%20Formula%20Front%20%28Japan%29.zip","filesize":2300797936,"score":6.9,"genres":"Strategy > 1st-person > 3rd-person (Other) > Real-time > Managerial / business simulation > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Unlike most other, action-oriented <em>Armored Core</em> titles, this installment is a strategy game. The player has no direct control of the mech in the action but can customize the mech as always, implementing additionally an AI that will fight on its own. The role of the player is to customize the mech and train the AI on training arenas. The two versions of the game allow for data transfer via USB, letting players exchange mech data between the PSP and PS2.</p>"},{"name":"Armored Core: Last Raven","year":2005,"developer":"FromSoftware, Inc.","url":"sony_playstation2_a/Armored%20Core%20-%20Last%20Raven%20%28Europe%29.zip","filesize":3026742566,"score":"","genres":"Action > 3rd-person (Other) > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Armored Core: Last Raven</em> is a mech combat game, the pilots are called Ravens, and isset about half a year after the events of Armored Core: Nexus. The three major corporations merged into the Alliance in order to rule the world - but a new faction, Vertex, challenges them. Smaller, independent gangs of Ravens called Warlords have grown more aggressive which does not help matters. 24 hours before Vertex plans to unleash full war on the Alliance - which is thought to have devastating consequences for the world - the player enters the scene in the shoes of a new Raven who eventually has to choose a side and play a major role in the conflict...</p><p>The game has a branching campaign structure and the progression depends on the player's choices. This leads to different missions to play and concludes in one of six endings. The missions, which are prefaced with voice-over briefings and emails to read, are action-oriented and straightforward; the player usually has to either defeat a number of enemies in the open, visit indoor levels or survive against a single, powerful Raven. The most important part is the mech customization in which the player can tune the performance of the robot and exchange parts. For the first time in the series, the outside parts (e.g. the head or the legs) have locational damage and can be destroyed during missions - for example, when an arm is destroyed the player can't use the equipped weapon anymore. Between story missions, the player can visit an arena and fight against other Ravens for training.</p><p>The PSP version has a few additional parts.</p>"},{"name":"Armored Core: Machine Side Box","year":2006,"developer":"","url":"sony_playstation2_a/Armored%20Core%20-%20Last%20Raven%20%28Japan%29%20%28Machine%20Side%20Box%29.zip","filesize":2325077010,"score":"","genres":"Compilation > Physical extras","desc":"<p><em>Armored Core: Machine Side Box</em> is a boxed compilation set of four games from the Armored Core series released to celebrate the 20th anniversary of developer FromSoftware. This collector's box includes:</p><ul><li>Armored Core</li><li>Armored Core 2</li><li>Armored Core 3</li><li>Armored Core: Last Raven</li><li>Special footage DVD</li><li>A \"Best Hits\" soundtrack CD</li><li>Premium visual book</li><li>Operation manual</li><li>Large AC blueprint poster</li></ul>"},{"name":"Armored Core: Nexus","year":2004,"developer":"FromSoftware, Inc.","url":"sony_playstation2_a/Armored%20Core%20-%20Nexus%20%28Europe%29%20%28Disc%201%29%20%28Evolution%29.zip","filesize":3476154346,"score":"","genres":"Action > 3rd-person (Other) > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Armored Core: Nexus</em> is one of FromSoftware's long line of mech simulation titles, featuring the series' well known customization and intense action. There are two discs in the package, <em>Revolution</em> and <em>Evolution</em>. <em>Evolution</em> features the standard arena mode and new missions, whereas <em>Revolution</em> is an anthology of missions from previous games, updated to the Armored Core 3 engine, as well as unlockable music and artwork from the series' history.</p><p>Also available is four-player network battling via i.Link or Ethernet networks. A notable feature of the game is that since either disc can be used for network play, a two-player network battle can be played with only a single copy of the game.</p>"},{"name":"Armored Core: Nine Breaker","year":2004,"developer":"FromSoftware, Inc.","url":"sony_playstation2_a/Armored%20Core%20-%20Nine%20Breaker%20%28USA%29.zip","filesize":1720361848,"score":6.4,"genres":"Action > 3rd-person (Other) > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Armored Core: Nine Breaker</em> is the ninth installment of the <em>Armored Core</em> series.</p><p>The game has the player fight other mechs in a series of tournaments to take on the ultimate weapon, the <em>Nine Ball</em>, a very powerful mech featured in the first game, Armored Core. There are over 400 fully customizable parts for mech upgrades, over 20 different arenas to battle in, as well as a Training mode with over 150 different missions with specific tasks to increase the player's skills in attacking and defensive maneuvers. Although there is no real main story mission, the Training mode offers skill-based missions and the Arena mode allows the player to take on enemy mechs.</p>"},{"name":"Army Men RTS","year":2002,"developer":"Pandemic Studio Pty Ltd","url":"sony_playstation2_a/Army%20Men%20-%20RTS%20%28Europe%29%20%28Fr%2CDe%2CEs%2CIt%29.zip","filesize":1588007324,"score":7,"genres":"Strategy > Diagonal-down > Real-time > Real-time strategy > Multiple units/characters control > Point and select > War","desc":"<p>The world of Army Men is under your control in the first Real-Time Strategy episode in the Army Men series. Command your Green troops, from the simple soldier to high powered tanks, against a former fellow Green commander who is now leading the enemy, the Tan Forces. The mission is simple, kill the traitor and his forces before all-out chaos begins. </p><p>Fight in the trenches of real-world battle areas set in the plastic toy world, or fight in the trenches of backyard gardens, using gnomes, flowers, and garden hoses as extra defense against the enemy. And just when the Tan army falls back, the ant or cockroach army comes rolling in, with the wildlife getting their own back on you.</p><p>The familiar \"Red Alert\" style resource management system allows you to choose from a wide range of attack and defense options. Resources themselves come from siphoning plastic and electricity from discarded toys, batteries, and the like scattered around the battlefield. When you lose a building or soldier, melt it down to re-build a new building or soldier.</p>"},{"name":"Army Men: Air Attack 2","year":2001,"developer":"The 3DO Company","url":"sony_playstation2_a/Army%20Men%20-%20Air%20Attack%202%20%28USA%29.zip","filesize":561599958,"score":6.5,"genres":"Action > 3rd-person (Other) > Helicopter","desc":"<p><em>Army Men: Air Attack 2</em> and its predecessor are shooting games similar to the ones in EA's Strike series. The player controls a green toy helicopter through a suburban setting. The aircraft is equipped with weapons and a winch. At the start of each mission, the player can choose the helicopter model and its co-pilot, whose characteristics modify the behavior of the airship (for example, a specialist in guns will increase the accuracy of shots). The mission objectives vary: there are rescue missions, where the winch is used to collect a character or object, demolition missions, where something has to be destroyed, and escort missions, where something must be protected from enemy attacks.</p><p>The PlayStation version contains two additional missions.</p>"},{"name":"Army Men: Green Rogue","year":2001,"developer":"The 3DO Company","url":"sony_playstation2_a/Army%20Men%20-%20Green%20Rogue%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1446769603,"score":4.6,"genres":"Action > 3rd-person (Other) > Side view > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>A new breed of plastic soldier is genetically engineered from the best soldiers in the green army. During a mission to transport this new form of troop to a testing facility, the transport chopper is shot down. Waylaid in the heart of Tan headquarters, the Green Rogue wakes. He must then fight his way out of the enemy base, tearing apart tan soldiers wherever he sees them. This will be the final test for these genetically engineered Green Rogues. Will they pass the test or will they fall into the hands of the tan forces?</p>"},{"name":"Army Men: Major Malfunction","year":2006,"developer":"Team17 Software Limited","url":"sony_playstation2_a/Army%20Men%20-%20Major%20Malfunction%20%28Europe%2C%20Australia%29.zip","filesize":251258734,"score":5.1,"genres":"Action > 3rd-person (Other) > Shooter","desc":"<p>Major Malfunction has gone bad. He has holed himself up inside a house and is leading an army of toys against the Army Men. The player takes control of Private Anderson and it's his job to infiltrate the house, take out Major Malfunction's army, and stop the major himself.</p><p><em>Army Men: Major Malfunction</em> is a 3rd-person platformer/shooter. Shoot, dodge, and jump through over 30 missions. Each level has 10 service medals hidden in out-of-the-way places, which unlock extras. Weapons include, among others, the standard assault rifle, a mini-gun, and a bazooka, with weapon power-ups scattered around the levels.</p>"},{"name":"Army Men: Sarge's Heroes 2","year":2001,"developer":"The 3DO Company","url":"sony_playstation2_a/Army%20Men%20-%20Sarge%27s%20Heroes%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1506862989,"score":5.9,"genres":"Action > 3rd-person (Other) > Shooter","desc":"<p>It seems those plastic men never lack any energy nor motivation to take each other out. Like in the other <em>Army Men</em> games, Sarge and the Green Army are at it again with the Tan Army. This time, General Plastro of the Tan Army has teamed up with members from the Blue side to wipe out the Green Army. As Sarge, you must fight your way through numerous missions with the backing of assorted weaponry ranging from crossbows to rocket launchers, in order to save Green Nation from the enemy invasion. Mission objectives vary from complete destruction of the other side to rescue missions.</p>"},{"name":"Army Men: Sarge's War","year":2004,"developer":"The 3DO Company","url":"sony_playstation2_a/Army%20Men%20-%20Sarge%27s%20War%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3181656052,"score":5.8,"genres":"Action > 1st-person > Behind view > Shooter > Direct control","desc":"<p>The story: in a new, grittier direction for the Army Men series, Sargeant Hawk takes on his most insidious enemy yet: Lord Malice. After years of conflict, the Green army has finally defeated the Tan menace. On the eve of the peace ceremonies, a ruthless attack wipes out all of Sarge's squad. It's now up to Sarge to even the score.</p><p>Gameplay: This is primarily a level-based, third-person shooter. Most of the weapons can also be used in a first-person view. The game includes some multiplayer games for two to four players on some platforms.</p>"},{"name":"Army Men: Soldiers of Misfortune","year":2008,"developer":"Big Blue Bubble Inc.","url":"sony_playstation2_a/Army%20Men%20-%20Soldiers%20of%20Misfortune%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":154387491,"score":"","genres":"Action > Behind view > Shooter > War","desc":"<p><em>Army Men: Soldiers of Misfortune</em> is a 3D third-person shooter and spin-off of the Army Men series. Assuming the role of a boy named Timmy, whose tan toy soldiers have begun a war against his green toy soldiers, the player must enter the battle against the tan soldiers by shrinking to their size and fighting them across the house.</p><p>The game offers five missions in which Timmy has to rescue allies, disarm threads and fight off the enemy. Sometimes, Timmy will be able to enter and use vehicles like tanks, jeeps and planes. Additional health and weapon pick-ups can also be found through the house.</p>"},{"name":"Art of Fighting: Anthology","year":2006,"developer":"SNK Corporation","url":"sony_playstation2_a/Art%20of%20Fighting%20Anthology%20%28Europe%29.zip","filesize":1357884482,"score":6.4,"genres":"Action > Compilation > Side view > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>This is a compilation of the three games in the Art of Fighting series:<em> Art of Fighting</em> Art of Fighting 2* Art of Fighting 3: The Path of The Warrior</p><p>This compilation also includes a color edit mode and arranged music scores for all three games.</p>"},{"name":"Arthur and the Invisibles: The Game","year":2006,"developer":"Étranges Libellules S.A.","url":"sony_playstation2_a/Arthur%20and%20the%20Invisibles%20-%20The%20Game%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":3424570143,"score":7.2,"genres":"Action > Behind view > Puzzle elements > Fantasy > Licensed","desc":"<p><em>Arthur and the Invisibles: The Game</em> is an action-adventure based on the mostly animated film from director Luc Besson who also wrote the children's books it originated from. It follows the film's storyline after the live-action part where a boy must save his grandmother's house from a greedy developer by finding a treasure that his grandfather went missing in searching for it in the magical land of the tiny Minimoy. When the boy Arthur enters a portal to their land, he shrinks in size and changes his appearance so he becomes like a Minimoy also. Arthur and his two friends, princess Selenia and her brother Bétamèche, try to save the Minimoys from certain destruction. </p><p>There is a tutorial which teaches you movement and combat plus how to move objects and flip switches. The action begins when a Minimoy ceremony is interrupted by enemy mosquitoes. You have to alternately play as all the three characters and use the special abilities of each to fight, solve puzzles, fly and drive. Arthur can smash spiderwebs and climb, while Selenia can cut through foliage, and Betameche can crawl through small spaces and packs an upgradable projectile-based weapon. Defeating enemies that have special keys is necessary in order to open gates to progress in the game. In one scene, they ride a mosquito through a cavern while shooting other mosquitoes from the air. There are also racing sections. Scenes from the film move the story along from one set piece to another.</p>"},{"name":"Astérix & Obélix XXL 2: Mission: Las Vegum","year":2005,"developer":"Étranges Libellules S.A.","url":"sony_playstation2_a/Asterix%20%26%20Obelix%20XXL%202%20%28Europe%29%20%28En%2CEs%2CIt%2CNl%29.zip","filesize":1514027676,"score":7.2,"genres":"Action > Behind view > Puzzle elements > Direct control > Classical antiquity > Fantasy > Licensed","desc":"<p>Several druids are kidnapped by the Romans and it seems that Getafix has something to do with it. Asterix &amp; Obelix travel to Rome only to find out that Caesar has built a huge amusement park called \"Las Vegum\" in which he holds the druids captive.</p><p>Asterix &amp; Obelix need to fight their way through countless Roman soldiers in order to find and free the druids hidden in the different themed areas of the park. On their way they team up or fight against several game-inspired NPCs like Sam Shieffer or Larry Craft. To fight foes the characters have several attack combos and special items like the famous magic potion at their disposal.</p><p>There are also some puzzles, for which you often need to switch between both characters (which you can do at any time) in order to solve them. Asterix, for instance, cannot move a heavy stone out of the way.</p><p>The PSP version adds a multiplayer mode: up to four players can play team and objective-based missions, with one team having to complete an objective (like collecting herbs, defending the village, stealing magic potion), the other having to prevent it. AI-controlled team mates join in if not enough players are available.</p>"},{"name":"Asterix and Obelix: Kick Buttix","year":2003,"developer":"Étranges Libellules S.A.","url":"sony_playstation2_a/Asterix%20%26%20Obelix%20-%20Kick%20Buttix%20%28USA%29.zip","filesize":437552163,"score":7,"genres":"Action > Racing / Driving > Behind view > Puzzle elements > Classical antiquity > Fantasy > Licensed","desc":"<p>The long and rich history of the  Asterix comics continue with its newest game entry, <em>Asterix and Obelix: Kick Buttix</em>. The story of the game involves Asterix and Obelix returning to their village in Gaul, after a day of hunting. They come to find that all their fellow village people have been captured. Along with their capture is also the theft of their magic potion, a potion that gives them superhuman strength. Caesar has captured the Gauls and spread them out to the furthest corners of the Roman Empire. Asterix and Obelix must find and free their friends and get the potion before it reaches Caesar.</p><p>The gameplay consists of the ability to switch between Asterix and Obelix at different times, using each one's skills to your advantage. Through the adventure, you will unlock and gain powerful combos and attack moves to help you. This large adventure takes you through six different countries made up of 47 areas, totaling 40 plus levels. The gameplay is varied from battling hundreds of Romans at once to riding/racing sequences and puzzle-solving. The graphics have vibrant colors, picturesque backgrounds, exciting special effects, and humorous animations. The sound includes zany effects, a range of music from roman to Egyptian, and good-humored voice acting.</p>"},{"name":"Asterix at the Olympic Games","year":2007,"developer":"Étranges Libellules S.A.","url":"sony_playstation2_a/Asterix%20at%20the%20Olympic%20Games%20%28Europe%29%20%28En%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":2049403017,"score":7.1,"genres":"Action > 3rd-person (Other) > Puzzle elements > Direct control > Licensed","desc":"<p>Lovestorix is in love with Princess Irina but Brutus also wants to marry her. To solve this problem, the Princess decides that she'll marry whoever wins the Olympic Games. At the same time the evil Doctormabus has discovered a dimensional key with which he can open portals to parallel dimensions and with it threatens to destroy the balance between the worlds. But of course Asterix &amp; Obelix come to the rescue and have to not only stop Doctormabus but also help Lovestorix win the games.</p><p>Like in Astérix &amp; Obélix XXL 2: Mission: Las Vegum you take control over both Asterix and Obelix and fight your way through hordes of Romans, building up combos with your punches and solving small riddles on the way. You can also change between controling Asterix or Obelix at any time. But since you are taking part in the Olympic Games, there are also several mini-games waiting which need to be beat in order to progress further in the story. These mini-games include things like Long Jump or Tug of War. These field events are played much like in Asterix and Obelix which means for example that you alternate between two buttons as fast as you can to run.</p><p>Once you've completed an event in the story mode, you can also play these events seperately in Olympic Mode in which two players (or one player against the CPU) fight for the gold medal in each discipline.</p><p>During the story mode you also collect helmets by destroying scenery objects or beating up Romans. These can be used to buy health or new combos ingame or unlock small parts of the movie. You also unlock new characters for the Olympic Mode as you advance in the story.</p><p>Also the game neither directly follows the storyline of the comic nor the movie, the twist with the portals to the real world is used to also include some actors of the movie in the game.</p>"},{"name":"Astro Boy","year":2004,"developer":"Sonic Team","url":"sony_playstation2_a/Astro%20Boy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2480842662,"score":5.7,"genres":"Action > 3rd-person (Other) > Anime / Manga > Sci-fi / futuristic > Licensed","desc":"<p>Action game by Sonic Team based on the anime series of the 2000s. You take the role of a robotic boy named Astro, who has to fight alongside the humans to prevent robots to take over Metro City. Through the game he gains new abilities, including Rocket Feet, Arm Cannon and 100,000-Horsepower Strength. Between missions you can freely fly through Metro City, trying to find collector cards and completing different tasks.</p>"},{"name":"Astro Boy: The Video Game","year":2009,"developer":"High Voltage Software, Inc.","url":"sony_playstation2_a/Astro%20Boy%20-%20The%20Video%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2008154735,"score":6.3,"genres":"Action > Side view > Shooter > Direct control > Sci-fi / futuristic > Licensed","desc":"<p>This is a side-scrolling beat 'em up and shoot 'em up combo based on the 2009 animated 3D movie of the long-running character from manga and anime. Astro Boy must save Metro City from President Stone and his robots while fighting through levels on the ground and in the air. In addition to fighting combination moves, he can shoot a laser from his fingertip and use a special attack if the energy meter is powered enough.  These include an Arm Cannon, Butt Machine Guns and Absorb (recharges a portion of health). Find different power-ups and costumes in hard to reach and hidden areas. </p><p>In addition to singleplayer, there is 2-player multiplayer co-op on Wii and PS2 where the second player controls another Astro Boy with a different costume.  In Story Mode, if one person dies, they can later rejoin game with full health after some time elapses. But if both die, then the game is over and must be started over.  There's also an Arena mode where both players fight with robots to determine a winner with the most points.</p>"},{"name":"Atari: 80 Classic Games in One!","year":2004,"developer":"Digital Eclipse Software, Inc.","url":"sony_playstation2_a/Atari%20Anthology%20%28Europe%29.zip","filesize":1490870925,"score":7.3,"genres":"Compilation","desc":"<p><em>Atari: 80 Classic Games in One!</em> contains Atari 2600 games from the 1970's and 1980's. Over 85 games are reproduced, including arcade titles: Asteroids, Asteroids Deluxe, Battlezone, Black Widow, Centipede, Crystal Castles, Liberator, Lunar Lander, Gravitar, Major Havoc, Millipede, Missile Command, Pong, Red Baron, Space Duel, Super Breakout, Tempest, and Warlords.</p><p>Also included are Atari 2600 titles: 3D Tic Tac Toe, Adventure, Air-Sea Battle, Asteroids, Atari Video Cube, Backgammon, Battlezone, Blackjack, Bowling, Breakout, Canyon Bomber, Casino, Centipede, Circus Atari, Combat, Crystal Castles, Demons to Diamonds, Desert Falcon, Dodge 'Em, Double Dunk, Flag Capture, Football, Fun with Numbers (a.k.a. Basic Math), Golf, Gravitar, Hangman, Haunted House, Home Run, Human Cannonball, Math Gran Prix, Maze Craze: A Game of Cops 'n Robbers, Millipede, Miniature Golf, Missile Command, Night Driver, Off the Wall, Outlaw, Quadrun, Radar Lock, RealSports Baseball, RealSports Football, RealSports Tennis, RealSports Volleyball, Sky Diver, Slot Machine, Slot Racers, Space War, Sprintmaster, Star Raiders, Star Ship, Steeplechase, Stellar Track, Street Racer, Submarine Commander, Super Baseball, Super Breakout, Super Football, Surround, SwordQuest: EarthWorld, SwordQuest: FireWorld, SwordQuest: WaterWorld, Video Checkers, Video Chess, Video Olympics, Video Pinball, Warlords, and Yars' Revenge.</p><p>Each genre of game is broken down into an individual hub where gamers can check out both arcade and home came versions of these classics. As bonus features, gamers are offered comics, instruction manuals, catalogs, and updated visual modes, which allow higher res versions of the games, to features which distort gameplay to make the games more challenging.</p>"},{"name":"Atelier Iris 2: The Azoth of Destiny","year":2005,"developer":"Gust Co., Ltd.","url":"sony_playstation2_a/Atelier%20Iris%202%20-%20The%20Azoth%20of%20Destiny%20%28Europe%29.zip","filesize":2099739332,"score":7.1,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy","desc":"<p>The story of <em>Atelier Iris 2: The Azoth of Destiny</em> follows Viese and Felt, two orphans from the land of Eden. At the beginning of the story an earthquake has caused vast portions of the land to disappear! Viese and Felt have volunteered to find out what has happened and to prevent the world of Eden from being destroyed completely. With the aid of a magical sword called the Azure Azoth, Felt sets off through a gate to another world called Belkhyde to search for the answer to their trouble while Viesa remains in Eden to take care of things there.</p><p>Throughout the game you control Viesa and Felt on their quest. Viesa has just become an alchemist; with the help of the Mana spirits of the world, this gives her the ability to take various items and magically form new items. In order to create a new item, Viesa will need a recipe indicating what ingredients to combine as well as those ingredients. All of these items can be found in various locations throughout the lands, some in Eden and some in Belkhyde. Many of the items Viesa can create with alchemy will be of great help to Felt as he explores Belkhyde and fights in battles; since Felt doesn't have the ability to create items, they will need the help of a share ring which provides the ability to exchange items even though they are in two different worlds. To progress through the game, Felt will often need to coordinate with Viesa to get useful items for either solving puzzles or making battles easier. As Felt explores Belkhyde, he will meet numerous other characters and will need to undergo various quests in order to save Eden.</p><p>The battles in the game are turn based; there is a meter at the top of the screen showing each of the characters in the battle with the rightmost character having the next turn. On each turn players may choose one of several attack options. There are two basic types of attacks, break attacks which will send your opponents further left on the meter providing more time or an extra turn, and charge attacks which increase the skill meter. Each character also has special skills which can be used if you have enough points on the skill meter. Battles are encountered randomly; as you wander enemy infested areas, a meter on the screen begins blue in color and slowly fades to red; the closer to red the meter is, the greater your chances of encountering a random battle. As you defeat enemies, this meter will slowly drain; when the meter is empty, you have defeated all of the enemies in that area. As you win battles, experience points are earned allowing your characters to level up and become more powerful.</p><p>As you progress through the game, the story will unfold. You can learn more about the land and what's going on by talking to the many people you'll find as well as through cut scenes at various points.</p>"},{"name":"Atelier Iris 3: Grand Phantasm","year":2006,"developer":"Gust Co., Ltd.","url":"sony_playstation2_a/Atelier%20Iris%203%20-%20Grand%20Phantasm%20%28Europe%29.zip","filesize":1964799068,"score":6.3,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Puzzle elements > Fantasy","desc":"<p><em>Atelier Iris 3: Grand Phantasm</em> is a traditional Japanese old-fashioned RPG with a classic turn-based battle system and 2D anime style characters.</p><p>The main feature in Atelier Iris 3 is alchemy, just as in previous games in the series. This means players will able to collect all kind of ingredients throughout their quest and make items with the help of their alchemy skills.</p><p>Players will take control of three protagonists in Atelier Iris 3:* Edge Vanhite - a 19 year old raider and alchemist, who's job is to explore the Alterworlds.</p><ul><li><p>Iris Fortner - a 16 year old girl who is Edge's childhood friend and still a novice raider.</p></li><li><p>Nell Ellis - a 15 year old girl, who is an energetic young novice raider from a noble family.</p></li></ul><p>The game's graphics is a mix of 2D images/objects and 3D backgrounds with Gust's usual 2D anime characters. The game also has several anime cut-scene including an introduction video. The game's music and sound was made by Ken Nakagawa known from the earlier Atelier games.The battle system is quite similar to the older Atelier games with (a little bit) improved traditional turn-based combat.</p><p>Some of the news to this third Iris game: An all new alchemy level system. Players can practice alchemy to improve their skills and create new items. The Active Cost Card Battle System which shows your exact order in the battle and brings more strategy to the fights. Using the new Enemy Symbol Encounter System, players can know see their enemies on the map, which helps them to plan. Players can also accept mission from an guild and improving their rating by doing so.</p>"},{"name":"Atelier Iris: Eternal Mana","year":2004,"developer":"Gust Co., Ltd.","url":"sony_playstation2_a/Atelier%20Iris%20-%20Eternal%20Mana%20%28Europe%29.zip","filesize":2140528150,"score":7.6,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy","desc":"<p>In the land of Regallzine, there is a special guild of alchemists - people who possess magic powers they draw creatures called \"mana\". The alchemists are able to manipulate elements and to fuse magical items. One of such alchemists suddenly got the idea of resurrecting an ancient god, claiming it will bring peace and happiness to humanity. To stop the madman, another alchemist, a young man named Klein, enters the scene. Klein is a particularly skillful magic user and has his way with mana, so with the help of his powers he hopes to stop the planned resurrection and to save the world.</p><p>The gameplay features traditional turn-based battles against randomly encountered enemies and a role-playing system based on the spiritual mana creatures. The characters use mana to create magical items and also equip it to learn special abilities and to gain bonuses when leveling up. Some mana creatures must be given gifts in order to obey you and to become more powerful. Mana-equipping can also grant you physical abilities which you can use to solve puzzles in dungeons.</p>"},{"name":"Atelier Marie & Elie: Salburg no Renkinjutsushi 1-2","year":2005,"developer":"Gust Co., Ltd.","url":"sony_playstation2_a/Atelier%20Marie%20%2B%20Elie%20-%20Salburg%20no%20Renkinjutsushi%201%20%26%202%20%28Japan%29.zip","filesize":1040922447,"score":"","genres":"Compilation > Role-playing (RPG) > Top-down > 2D scrolling > Fixed / flip-screen > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Managerial / business simulation > Direct control > Menu structures > Fantasy","desc":"<p>This compilation bundles together the first two Atelier games, Atelier Marie and Atelier Elie. It features the redrawn high-resolution graphics featured in the previous Windows releases, Atelier Marie (Premium Box) and Atelier Elie (Premium Box).</p>"},{"name":"Athens 2004","year":2004,"developer":"Eurocom Developments Ltd","url":"sony_playstation2_a/Athens%202004%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":2589876429,"score":6.2,"genres":"Sports > 3rd-person (Other) > Olympiad / mixed sports > Licensed","desc":"<p>The official game of the Games of the XXVIII Olympiad held in Athens in August 2004, <em>Athens 2004</em> features 25 events spread around 8 sports, the real stadiums and arenas such as the state of the art Olympic Stadium built for the competition and the Panathinaiko, venue of the first modern Olympics, and 64 nations from all around the world.</p><p>While new developers Eurocom (following two games from ATD) kept most of the gameplay still inspired by the old button-mashers of the early 80s, some events feature interesting twists. While sprinting events don't need introductions, there are two middle distance events (800m and 1500m) that require the player to control their pace in order to reach the final curve fresh enough to have a second wind and sprint towards the finish. Other innovations are on field events, such as the high jump requiring the player to alternate buttons not as fast as possible, but time them as well as possible to the athlete's steps as possible, and the discus has the player circling the analogue knobs to build up power, among others. </p><p>All four swimming events are played in the same fashion as sprinting events, except the athlete must breathe as quickly as possible in intervals, or risks losing precious speed over a section of the race.</p><p>On gymnastics, floor exercises change according to sex: mens' is mostly based on power, with mashing sequences followed by timed button presses, while womens' require the player to follow on-screen cues (similarly to games such as Dance Dance Revolution), while rings to use both analogues to match the on-screen cues, and the vault has the player mashing the buttons before following an on-screen cue to perform the routine. Some of these events require the player to choose from a predefined routine, which affects the difficulty level and the maximum score awarded by the judges.</p><p>Making its first appearance in an official videogame, the equestrian individual jump competition requires the player to navigate the horse throughout the track, jumping over obstacles while keeping a steady pace, as the winner is who took the shortest time while collecting less penalties from hitting obstacles.</p><p>Archery is only slightly modified from previous games in the genre, but skeet now has the player following a predefined path instead of the free aiming gameplay of <em>Sydney 2000</em>.</p><p>Two game modes are included, the first being arcade (practice, single competitions and a special mode developed with dance mats in minds) and competition, where the player can customize their Olympics in order to play in just one final, compete in the decathlon or heptathlon, all pool or gymnastics events or become one in the Champion mode, featuring all 25 events, the winner being that with the most points.</p>"},{"name":"Atlantis III: The New World","year":2001,"developer":"Cryo Interactive Entertainment","url":"sony_playstation2_a/Atlantis%20III%20-%20The%20New%20World%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":3015178883,"score":6.7,"genres":"Adventure > 1st-person > Puzzle elements > Sci-fi / futuristic > Detective / mystery","desc":"<p><em>Beyond Atlantis II</em> is the third adventure game in the <em>Atlantis</em> series.</p><p>This fantasy game takes place in the year 2020 as a young Egyptologist and her companion search for an ancient Egyptian site in the desert. Confronted with many riddles and puzzles, her quest eventually becomes the search for the Lost City of Atlantis itself.</p>"},{"name":"Atlantis: The Lost Continent","year":2004,"developer":"The Code Monkeys Ltd."},{"name":"ATV Offroad Fury","year":2001,"developer":"Rainbow Studios, Inc.","url":"PS2_COLLECTION_PART1/ATV%20Offroad%20-%20All%20Terrain%20Vehicle%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":660827452,"score":7.6,"genres":"Racing / Driving > Behind view > Off-roading > Track racing > Vehicle simulator","desc":"<p>Off-road racing game where you can choose from among 12 ATV models from manufacturers like Honda, Yamaha, and Kawasaki.  You can even customize your rider's apparel and your ATV's specs before you enter into 6 event types spanning more than 20 tracks </p>"},{"name":"ATV Offroad Fury 2","year":2002,"developer":"Rainbow Studios, Inc.","url":"PS2_COLLECTION_PART1/ATV%20Offroad%20Fury%202%20%28Europe%2C%20Australia%29.zip","filesize":855274846,"score":7.8,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Off-roading > Vehicle simulator","desc":"<p>The high-powered sequel to one of the early PS2 racing titles, ATV Offroad Fury 2 features over 20 authentic ATVs and 40 racing environments. Race modes include Nationals, Supercross, Freestyle Stunt, and Enduro races. Players can also take their customized racers and ATVs online and race against other players.</p>"},{"name":"ATV Offroad Fury 3","year":2004,"developer":"Climax Racing","url":"PS2_COLLECTION_PART1/ATV%20Offroad%20Fury%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":3077113280,"score":7.4,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Off-roading > Vehicle simulator","desc":"<p><em>ATV Offroad Fury 3</em> is the third title in the Sony-published series of ATV games. It also marks the handover of the franchise from US developer Rainbow Studios to UK developer Climax Racing.</p><p>It features competitive off-road circuit racing gameplay, as well as freestyle-trick based gameplay. Games can be played single player, or local multiplayer with up to four players split-screen. Online play is also fully supported with additional features such as a bulletin board feature and friends lists.</p><p>The core career mode centers around the player entering racing and freestyle championships. New tracks, vehicles and outfits can be unlocked along the way.</p>"},{"name":"ATV Offroad Fury 4","year":2006,"developer":"Climax Racing","url":"PS2_COLLECTION_PART1/ATV%20Offroad%20Fury%204%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CPl%2CRu%2CEl%29.zip","filesize":5213408282,"score":7.8,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Motorcycle > Off-roading","desc":"<p>ATV Offroad Fury 4 is the fourth and final game in the 'Offroad Fury' franchise, released on Playstation 2.</p><p>Unlike the previous three titles in the series, this game strays from just simply ATV's in it's roster of vehicles. Offroad Fury 4 introduces MX bikes, dune buggies, and trophy tricks into the mix. The game also differs from it's predecessors in that it includes long point-to-point tracks, which utilize streaming technology to immerse the player in a huge seemingly-endless world. The other notable departure from the previous titles is the inclusion of a career mode, which attempts to include a story between races using rendered cutscenes.</p>"},{"name":"ATV: Quad Power Racing 2","year":2003,"developer":"Climax (Brighton) Ltd","url":"PS2_COLLECTION_PART1/ATV%20-%20Quad%20Power%20Racing%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1225586287,"score":7.4,"genres":"Racing / Driving > Behind view > Arcade > Off-roading > Vehicle simulator","desc":"<p><em>ATV Quad Power Racing 2</em> is the sequel to ATV: Quad Power Racing, with many new features.</p><p>Choose from 10 of the top professional riders from all over the world, including Dana Creech, Kory Ellis, and Tim Farr.Race through 17 massive tracks and five environments, located in challenging countries throughout the world.Get dirty and physically fight with opponents to the finish line, letting them know that you're king off-road.Over-the-top controls and game physics, allowing players to pull huge air and amazingly fun power slides.More than 20 freestyle tricks to let riders express their wild side while tearing up the competition.Several multi-player modes of play bring action to players and their friends.Real-life in-game sponsors, adding to the realism of the game.</p>"},{"name":"Australian Idol Sing","year":2006,"developer":"Milestone s.r.l.","url":"sony_playstation2_a/Australian%20Idol%20Sing%20%28Australia%29.zip","filesize":617292360,"score":"","genres":"Action > Simulation > Music / rhythm > Oceania > Licensed","desc":"<p>Australian Idol Sing is a single and multiplayer singing game. In real karaoke style, songs appear on your screen and you have to sing the right words at the right time. Onscreen indicators inform you what pitch you need to maintain at any given time. Hit the right notes for the right amount of time, and you'll get high scores.</p><p>As the focus of the game is the TV show atmosphere, special attention has been paid to select a great variety of video clips of judge comments and special performances of the show. This way, players need to struggle to achieve a good result and are awarded with special contents from the show. The game also contains Party modes in which players compete by playing a selection of funny mini-games.</p><p>The game is bundled with a USB microphone.</p><p>The tracklist of the game features songs like Wasabi (Lee Harding), Do It With Madonna (The Androids), 4ever (The Veronicas), Love Song (Amiel), and many others.</p>"},{"name":"Auto Modellista","year":2002,"developer":"Capcom Production Studio 1","url":"sony_playstation2_a/Auto%20Modellista%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":590515688,"score":6.6,"genres":"Racing / Driving > Anime / Manga > Arcade > Automobile > Track racing","desc":"<p><em>auto modellista</em> is a cel-shaded racing game featuring many high-performance cars from different manufacturers, including Mazda, Honda, Toyota, and Subaru, as well as some Japanese concept cars.</p><p>The game has a few modes: garage life, two-player split-screen, time trial, and arcade. Garage life is the main mode in the game. Here the player will race with any of the cars they have unlocked over seven levels, each with a different number of races. The player will need to finish first in some or all of the races to move to the next level. Winning these races unlocks new parts, items, and cars. In the garage, the player may customize the appearance of their car with stickers and body parts previously won. It's also possible to tune the car by adjusting brakes, suspension, tires, etc. </p><p>The US version of the game also supports on-line play (broadband only).</p>"},{"name":"Autobahn Raser IV","year":2002,"developer":"Davilex Games B.V.","url":"sony_playstation2_a/Autobahn%20Raser%20IV%20%28Germany%29.zip","filesize":291376437,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p><em>Autobahn Raser IV</em> is another entry in the Davilex Racer series.The game contains tracks in Berlin, Munich, Hamburg and three bonus tracks in Paris, London and Las Vegas.Available are five game modes.</p>"},{"name":"Autobahn Raser: Das Spiel zum Film","year":2004,"developer":"Davilex Games B.V."},{"name":"Avatar: The Last Airbender","year":2006,"developer":"THQ Australia Studios Pty Ltd.","url":"nickelodeon-avatar-the-last-airbender-usaemersonlinogames/Nickelodeon%20Avatar%20-%20The%20Last%20Airbender%20%28USA%29emersonlinogames.iso","filesize":1616347136,"score":6.2,"genres":"Action > Top-down > Anime / Manga > Puzzle elements > RPG elements > Fantasy > Licensed","desc":"<p>Based on the animated television program of the same name, <em>Avatar: The Last Airbender</em> follows the adventures of a group of kids living in an Asian-inspired fantasy world where the nations have been divided up according to the four classical elements: Air, Water, Earth, and Fire. Within each nation are people who can control that one element, known as benders. The Avatar is a person who can control all four elements and is charged with keeping the peace between the four nations. However, 100 years previous the Avatar had disappeared, making it possible for the Fire Nation to wage a war of conquest across the world. As the show begins, the new Avatar, Aang (originally an Airbender, hence the title of the series), has been found, and now he must travel the world, learning how to bend all four elements and fighting against the Fire Nation alongside his friends Katara (a Waterbender of the Water Tribe) and Sokka (her older brother).</p><p>In the game, the player may choose one of four characters: Aang, Katara, Sokka, and Haru (an Earthbender). Each character's fighting style and abilities are unique, and new abilities can be gained as they earn experience by defeating enemies. Items are also available to assist the player, such as armor, chi, accessories, and healing potions. As an action/adventure game, the gameplay is viewed from a top-down perspective, with the player battling enemies and searching for specific items required the complete the quests necessary to progress further into the game. The story unfolds over several chapters, and players cannot return to previous areas.</p><p>Set between the first and second seasons of the show, the game follows Aang and friends as they investigate the disappearance of a young Waterbender, and find themselves in pursuit of an inventor named Lian the Maker, who has been forced to create dangerous machines for the Fire Nation. As they travel between the Water Tribe and the Earth Kingdom, the characters battle Fire Nation soldiers, strange animals, and various machines. Some other characters from the world of <em>Avatar</em> also make minor appearances in the game, including Prince Zuko, who appears during cut scenes only.</p>"},{"name":"Avatar: The Last Airbender - Into the Inferno","year":2008,"developer":"THQ Australia Studios Pty Ltd.","url":"nickelodeon-avatar-the-last-airbender-into-the-inferno-usaemersonlinogames/Nickelodeon%20Avatar%20-%20The%20Last%20Airbender%20-%20Into%20the%20Inferno%20%28USA%29emersonlinogames.iso","filesize":2285142016,"score":6.5,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fantasy > Licensed","desc":"<p><em>Avatar: The Last Airbender - Into the Inferno</em> is an action adventure game based on the American animated series <em>Avatar</em>, and follows the events of the third season of the show. The second season ended with Aang being mortally wounded during the fall of Ba Sing Se. The game starts with Aang awakening on a stolen Fire nation ship heading towards the Fire nation.</p><p>The game can be played solo or in co-op with the players taking control of Aang, Katara, Sokka, Toph and Zuko. Each of the characters has their own moves and abilities, which include bending that can be done by picking up raw elements. Sokka can’t bend but uses his sword to defeat opponents. When playing solo, the player can switch between the two characters available for each level. Appa is used to travel from one level to another.</p><p>For the Nintendo DS, a different 3D game was released.</p>"},{"name":"Avatar: The Last Airbender - The Burning Earth","year":2007,"developer":"THQ Australia Studios Pty Ltd.","url":"avatar-the-last-airbender-the-burning-earth-ps-2-iso-usa/Avatar_The_Last_Airbender_The_Burning_Earth_PS2_ISO_USA.zip","filesize":1053712166,"score":6.3,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fantasy > Licensed","desc":"<p><em>Avatar: The Last Airbender - The Burning Earth</em> is an action adventure game based on the American animated series <em>Avatar</em> and follows the events of the second season of the show. The story revolves around Aang, the series' central character, and his friends traveling to the Earth Kingdom stronghold in search of Aang's friend and teacher, Bumi.</p><p>During the game you will take control of the various characters including Aang, Katara, Sokka and Toph to fight through enemies as well as solving puzzles. You will be mainly in control of Aang, but you will be able to switch between him and the secondary character who tags along. The game can be played solo or in co-op.</p><p>For the Nintendo DS, a different 2D game was released. The Game Boy Advance also received a different 2D game.</p>"},{"name":"Azur & Asmar","year":2007,"developer":"OUAT Entertainment","url":"sony_playstation2_a/Azur%20%26%20Asmar%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1866358598,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Middle East > Licensed","desc":"<p>Based on the feature film of Michel Ocelot, <em>Azur &amp; Asmar</em> is a platform game where the player helps the two heroes in their quest to find the Djinn-fairy and release her from her chamber. The story and the visuals are inspired by North-African and Middle-Eastern folklore. </p><p>The player controls Azur the acrobat or Asmar the warrior alternatively. Each has a specific ability that is needed to beat the 22 levels, defeat the enemies and solve the puzzles placed along the way.</p>"}]