[{"name":"B-Boy","year":2006,"developer":"FreeStyleGames Ltd.","url":"PS2_COLLECTION_PART2/B-Boy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1632721684,"score":6,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p><em>B-Boy</em> is a dance battle game based around the Hip Hop element of b-boying (AKA break-dancing). The game has taken care to be true to the culture, featuring real b-boys such as Crazy Legs and recent UK Break-dancing Championship winner Mouse. Music is a mixture of classic b-boy themes such as The Mexican by Babe Ruth.</p><p>The gameplay is a combination of fighting game mechanics with a music rhythm game. The player pulls off different combinations to accrue points and defeat opponents (human and cpu). In deference to the global popularity of B-Boying, the game takes place at global locations from Japan to Europe to New York. There are 21 venues in total. In the B-Boy Life mode, you have to gather a crew and battle against superstars. You can also create your own character and define the moves.</p>"},{"name":"Babe","year":2006,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART2/Babe%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":49688091,"score":"","genres":"Action > Diagonal-down > Direct control > Licensed","desc":"<p><em>Babe</em> is a video game based on the movie of the same name. The player plays as Babe the pig as has to complete tasks such as herding sheep or finding keys. The game offers 50 levels in total. Levels take place in different locations like the countryside, a hotel, airport or hospital.</p>"},{"name":"Backyard Baseball","year":2004,"developer":"Humongous Entertainment, Inc.","url":"sony_playstation2_b/Backyard%20Baseball%20%28USA%29.zip","filesize":632450929,"score":"","genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>Build the championship baseball team of your dreams and play with the Pros in your own backyard. Create the lineup, take the field, and direct all of the action. Earn new pitching and batting power-ups to light up the scoreboard! The Backyard Baseball’ game includes kid versions of hard-hitting, base-stealing, tough-fielding players including Barry Bonds, Randy Johnson, Mike Piazza, and Ichiro.</p>"},{"name":"Backyard Baseball '09","year":2008,"developer":"FarSight Technologies Inc.","url":"sony_playstation2_b/Backyard%20Baseball%20%2709%20%28USA%29.zip","filesize":257837812,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Baseball > Licensed","desc":"<p>Knock one out of the park!<br>Backyard Baseball 2009 is the latest and greatest version of the best selling kids’ baseball video game series ever. Play hardball with David “Big Papi” Ortiz, A-Rod, Jeter, Ichiro, Griffey, Pujols, and other MLB superstars as kids. Choose your favorite MLB or Backyard team or create your own. And now, for the first time on Nintendo Wii, Backyard Baseball 2009 features NEW Backyard Baseball All Star Game and tournament mode along with season & single game options, create-a-player, Homerun Derby mini-game, and unlockables. With outrageous game play and awesome power ups combined with authentic baseball action, Backyard Baseball 09 is the most fun you can have outside the ball park.\"<br>* All current MLB teams uniforms and logos<br>* Pro player from every MLB team— David Ortiz, Alex Rodriguez, Albert Pujols, Derek Jeter, Daisuke Matsuzaka, Ken Griffey Jr., Ichiro, & more<br>* 11 Backyard Teams and your favorite Backyard Kids— Pablo Sanchez, Joey MacAdoo, Ernie Steele, Tony Delvecchio, & more<br>* NEW Auto Play, All Star Game, and Tournament Mode<br>* Season play or pick up game<br>* NEW Power Ups with Meter<br>* Custom team and player options<br>* Enhanced Hitting and Fielding Controls<br>* NEW Player Capabilities<br>* Unlockable fields & players including the great Babe Ruth!<br>* Multiple levels of difficulty</p>"},{"name":"Backyard Baseball '10","year":2009,"developer":"Humongous Entertainment, Inc.","url":"sony_playstation2_b/Backyard%20Baseball%20%2710%20%28USA%29.zip","filesize":314986886,"score":"","genres":"Sports > 3rd-person (Other) > Top-down > Baseball","desc":"<p><em>Backyard Baseball '10</em> is a baseball game that features all 30 Major League Baseball teams as well as 11 \"Backyard\" teams (6 in the DS version). The player can pick a team, players and one of the 12 different fields to play on. The game combines traditional baseball mechanics such as pitching and batting with the ability to use power-ups.</p><p>Some of the power-ups include:</p><ul><li>Screaming Liner - The ball is hit so hard it screams</li><li>Orbiter - The ball cannot be hit any harder; almost a guaranteed home run when hit</li><li>Popcorn Bunt - Confuse the defense by making a bunch of other balls appear on the field</li><li>Slime Ball - The ball is covered in goop and no one can catch it or throw it</li><li>Free Radical - The ball bounces around a few times, making it really hard to catch</li><li>Teleporter - The ball teleports on the field a few times before stopping somewhere on the field</li><li>Static Zing - The ball is electric and will shock the first person to touch it</li><li>Meteor Ball - The ball is thrown so fast that it's hard to see!</li></ul><p>On the PlayStation 2, the game uses traditional button-based controls. On the Wii, the player can swing the Wiimote to bat and pitch. On the Nintendo DS, there are two control modes. The player can either use the control pad and the B button or tap/swing the stylus on the touchscreen to pitch/bat.</p>"},{"name":"Backyard Basketball","year":2003,"developer":"Humongous Entertainment, Inc.","url":"sony_playstation2_b/Backyard%20Basketball%20%28USA%29.zip","filesize":318401693,"score":"","genres":"Sports > 3rd-person (Other) > Basketball > Licensed > Regional differences","desc":"<p>In the first fully 3D and console iteration of <em>Backyard Basketball</em>, players can create and draft a 5-character team among kid versions of real NBA pros and the Backyard Kids. You can either play a single game or an entire season.</p>"},{"name":"Backyard Football '08","year":2007,"developer":"Humongous Entertainment, Inc.","url":"sony_playstation2_b/Backyard%20Football%20%2708%20%28USA%29.zip","filesize":273528652,"score":"","genres":"Sports > Football (American) > Licensed","desc":"<p>All the hard hitting action of a realistic simulation and wacky arcade game in one!<br><br>Authentic NFL strategies & teams<br>15 Top NFL pros, 22 Backyard kids<br>Custom teams & plays<br>Easy enough for rookies, challenging for all-stars<br>Single game & season modes<br>Power-ups & unlockables<br>The only game with NFL pros as kids!</p>"},{"name":"Backyard Football '09","year":2008,"developer":"Humongous Entertainment, Inc.","url":"sony_playstation2_b/Backyard%20Football%20%2709%20%28USA%29.zip","filesize":325174098,"score":"","genres":"Sports > Football (American) > Licensed","desc":"<p>All the hard-hitting action of a realistic simulation and wacky arcade game in one!<br><br>* Authentic NFL strategies & teams<br>* 32 Top NFL pros, 22 Backyard kids<br>* Custom teams & plays<br>* Easy enough for rookies, challenging for all-stars<br>* Single game & season modes<br>* Crazy Power-ups & unlockables<br>* The only game with NFL pros as kids!</p>"},{"name":"Backyard Football '10","year":2009,"developer":"Humongous Entertainment, Inc.","url":"sony_playstation2_b/Backyard%20Football%20%2710%20%28USA%29.zip","filesize":294908841,"score":"","genres":"Sports > Diagonal-down > Direct control > Motion control > Football (American) > Licensed","desc":"<p><em>Backyard Football '10</em> is an NFL-licensed American Football game and part of the <em>Backyard Sports</em> series. Players play as young children as opposed to a professional team.</p>"},{"name":"Backyard Football 2006","year":2006,"developer":"Humongous Entertainment, Inc.","url":"sony_playstation2_b/Backyard%20Football%202006%20%28USA%29.zip","filesize":715574290,"score":"","genres":"Sports > 3rd-person (Other) > Cinematic camera > Real-time > Direct control > Point and select > Football (American)","desc":"<p>Backyard Football 2006 is the fourth installment of the Backyard Football series, and this time it brings the game into a fully 3D environment for PC players. Choose from one of 32 teams from the National Football League, or create your own custom team to play with. Draft various characters onto your team, ranging from the Backyard kids to junior versions of popular NFL pros.</p><p>Playing in either Single Game or Season Play, the goal of the game is to try to score more than your opponent before the timer runs out. Controls are still as simple as a click of a mouse, but there are new controller options to suit your play style such as the keyboard or even a game pad. Work on the best strategies to outsmart the opponent with tackles, all new power-ups, and touchdowns.</p>"},{"name":"Backyard Sports: Baseball 2007","year":2006,"developer":"GameBrains","url":"sony_playstation2_b/Backyard%20Sports%20-%20Baseball%202007%20%28USA%29.zip","filesize":468742665,"score":"","genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p><em>Backyard Baseball 2007</em> is a baseball game with kids, including young versions of, at the time of release, active MLB players. The graphics are on the cartoony side and the play on the field mostly arcade oriented. The majority of time is spent with batting or pitching which rely on timing, there is also active fielding and management of the base runners. Power-ups can be activated when the power meter is filled up and give certain advantages, e.g. the \"split ball\" power-up for pitchers causes the ball to divide into two. There are various difficulty options that can be turned on or off like automatic fielding or deactivating bat aim (when activated, the player actively has to aim into the direction the ball is supposed to fly).</p><p>The game modes are quick matches (also available for two players), a season mode with the ability to change the lineup and some statistics, and two mini-games (Home Run Derby and Fielder's Challenge which is basically fielding training). The player can either use pre-defined or customized teams and some things (e.g. the young MLB athletes or better leagues to play in) have to be unlocked by completing achievements.</p>"},{"name":"Backyard Sports: Basketball 2007","year":2007,"developer":"GameBrains","url":"sony_playstation2_b/Backyard%20Sports%20-%20Basketball%202007%20%28USA%29.zip","filesize":248516176,"score":"","genres":"Sports > Side view > 2D scrolling > Direct control > Basketball","desc":"<p><em>Backyard Basketball 2007</em> is an entry in the <em>Backyard Sports</em> series and the fourth release in the <em>Basketball</em> subseries. It is different from the 2006 handheld game Backyard Basketball 2007. The game carries an NBA license and continues the concept of the previous games, allowing players to take control of kid versions of famous teams and players such as Shaquille O'Neal, Tracy McGrady and Yao Ming, using real teams, names and uniforms.</p><p>Players can create a custom team of five players from a pool of 18 kids versions of pro players and 22 Backyard players. They have different stats based on inside shot, outside shot, ball handling etc. The game is in full 3D. Players are controlled directly and it is possible to switch between them. Buttons are used to shoot, dunk, pass, call for a screen or crossover dribble while on offense. On defense options include stealing, catching rebounds and guarding. There is voiced commentary, three difficulty levels and ten different courts. New players and power-ups can be unlocked. There are also options for the quarter length, fatigue, shot ring and fouls &amp; violations.</p><p>Next to the main Season game mode there are pick-up games, mini-games and Horse.</p>"},{"name":"Backyard Wrestling 2: There Goes the Neighborhood","year":2004,"developer":"Paradox Development","url":"PS2_COLLECTION_PART2/Backyard%20Wrestling%202%20-%20There%20Goes%20the%20Neighborhood%20%28Europe%29.zip","filesize":2370623984,"score":5.4,"genres":"Sports > 3rd-person (Other) > Fighting > Wrestling > Licensed","desc":"<p>Backyard Wrestling 2: There Goes the Neighborhood is the second game in a series of fast paced fighting-wrestling hybrid games.  The game is based on the BYW license, a gruesome series of videos of amateur wrestlers who actually do, at times, wrestle in backyards.  In the game, a tournament has shown up in your town, and the one million dollar prize is turning everyone into a backyard wrestler, and every place into a ring.  Players take their created wrestler through the different federations to have a chance at the money.  There is a versus mode, and unlockable content.</p>"},{"name":"Backyard Wrestling: Don't Try This at Home","year":2003,"developer":"Paradox Development","url":"PS2_COLLECTION_PART2/Backyard%20Wrestling%20-%20Don%27t%20Try%20This%20at%20Home%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3093896947,"score":5.9,"genres":"Action > Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>Wrestling need not be limited to a ring and bare arms. In Backyard Wrestling you can use bricks, tables and anything else found within range - nothing in the environment is statically painted-on. These objects are incorporated into many surprising stunts. The damage modeling includes full blood and gore, which coupled with an intense rock-rap soundtrack ensures that this is not a game for younger players. There are 30 pre-configured wrestlers, and you can create your own to take them on.</p>"},{"name":"Bad Boys: Miami Takedown","year":2004,"developer":"Blitz Games Ltd","url":"sony_playstation2_b/Bad%20Boys%20-%20Miami%20Takedown%20%28USA%29.zip","filesize":2203408019,"score":4.6,"genres":"Action > 1st-person > Behind view > Shooter > Licensed","desc":"<p>This game is based on the Will Smith &amp; Martin Lawrence buddy cop movie sequel Bad Boys II.  You can play as either character, Mike, or Marcus, from 1st or 3rd person viewpoints. Each has their own personalities and characteristics. </p><p>Through 15 stages, you engage in fast-paced all-action gameplay that features multiple mission objectives. Shoot your way through Colombian drug lords, Russian mobsters, and even dirty cops. Sometimes you will need to protect your computer-controlled partner or collect some evidence.  You can often duck behind a wall or around a corner, from where you will be able to pick off your targets with less chance of being hit. You will be accordingly rewarded on your successful actions and achievements on a \"Bad Boy\" rating system. You can follow all the laws and avoid unnecessary damage or take the opposite approach and be a Bad Boy. There's a good amount of different weapons from pistols and shotguns to automatic assault rifles and grenades. Environments are fully destructible. You can use a quick aiming and shooting Action mode, or search for clues and evidence using the Explore mode.</p>"},{"name":"Bakugan: Battle Brawlers","year":2009,"developer":"Premium Agency Inc.","url":"PS2_COLLECTION_PART2/Bakugan%20-%20Battle%20Brawlers%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":952993704,"score":6.3,"genres":"Action > Strategy > Anime / Manga > Turn-based > Trading / collectible card > Licensed","desc":"<p><em>Bakugan: Battle Brawlers</em> is a game based on the Bakugan animated series. In unknown Hyperspace Hal-G completes the Silent orb claiming all Bakugan will bow before him. Shortly after that a mysterious creature awakens in the Doom dimension. In the game you partner with the mysterious Bakugan Leonidas and have to stop the evil Bakugan Vladitor.</p><p>In the game you battle other Battle Brawlers and have to win Gate cards. This is done by rolling your Bakugan on the card and let it battle with the opponents Bakugan. Before rolling on a card power-ups can be collected that help the player in battle. Battles are decided by playing a mini game. There are three types of these mini games: timing, shaking and shooting.</p>"},{"name":"Bakumatsu Roman Gekka no Kenshi 1･2","year":2006,"developer":"SNK Corporation"},{"name":"Baldr Force EXE","year":2005,"developer":"GIGA","url":"sony_playstation2_b/Baldr%20Force%20EXE%20%28Japan%29.zip","filesize":2154106923,"score":"","genres":"Action > Top-down > Anime / Manga > Shooter > Visual novel > Mecha / giant robot > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Adult","desc":"<p><em>Baldr Force EXE</em> is an enhanced release of Baldr Force. It adds a new weapon (gravity field), a \"very easy\" difficulty level, and a Hell Mode, which puts the player in a row of increasingly challenging battles. The PlayStation 2 version also adds Hyper and Time Attack gameplay modes, voice-overs, and a new intro. The Windows release retains the explicit sex scenes, while the console releases removes them.</p>"},{"name":"Baldur's Gate: Dark Alliance","year":2001,"developer":"Snowblind Studios, Inc.","url":"PS2_COLLECTION_PART2/Baldur%27s%20Gate%20-%20Dark%20Alliance%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3101085717,"score":7.6,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Real-time > Action RPG > Hack and slash > Fantasy > Licensed","desc":"<p><em>Baldur's Gate: Dark Alliance</em> is an action RPG which casts the player as one of three basic characters: an elf sorceress, a human archer, or a dwarf fighter. From humble beginnings slaying rats in the cellars of an inn, the adventurer will move on to exploring caves, crypts, and mountain passes. Naturally, it's all filled to the brim with horrible monsters, wicked traps, treasures, and fabled magical weapons. As the game progresses, the player is constantly rewarded with new weaponry, new monsters to fight, and experience points to put into the adventurer's character stats to grow even more powerful. The adventurer must eventually unravel the secrets of a dark, new Thieves Guild backed by powerful mages.</p>"},{"name":"Baldur's Gate: Dark Alliance II","year":2004,"developer":"Black Isle Studios","url":"PS2_COLLECTION_PART2/Baldur%27s%20Gate%20-%20Dark%20Alliance%20II%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%29.zip","filesize":2875940640,"score":7.6,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Real-time > Action RPG > Hack and slash > Fantasy > Licensed","desc":"<p>The threat of the Onyx Tower has passed for now, but mere moments pass before a new threat to the Sword Coast arises. The heroes of the Onyx Tower have disappeared, so the fate of Baldur's Gate now rests on the shoulders of five wandering adventurers who are only now journeying into the region.</p><p><em>Baldur's Gate: Dark Alliance II</em> can be played solo or cooperatively with one other player, each choosing from 5 playable characters. The gameplay is the same as its previous incarnation: kill monsters and bad guys to collect treasure, items, and experience. By talking to townspeople in Baldur's Gate the player can learn of optional maps filled with more dangerous monsters and additional treasure. Equipment can be enchanted by the player this time, and given various magical effects such as additional fire damage, absorbing mana, or boosting stats.</p>"},{"name":"Band Hero","year":2009,"developer":"Vicarious Visions, Inc.","url":"PS2_COLLECTION_PART2/Band%20Hero%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3540909561,"score":7.5,"genres":"Action > Simulation > 3rd-person (Other) > Cinematic camera > Music / rhythm","desc":"<p><em>Band Hero</em> is a karaoke/rhythm based game, similar to the Guitar Hero games, but directed at the pop loving teenage crowd, as well as a more group based party game (unlike with guitar hero, full band instruments are included from the beginning of the series).</p><p>The instruments are the same as in the more recent GH games. You have the microphone for vocals, guitars for either lead or bass guitar and the drum kits for drumming along. Accordingly, each instrument has its own 'career' path in game.</p><p>If you are doing the vocals for your band, you have to sing along in time to the music, matching the pitch as closely as possible. Lead and bass guitar is played by holding down the fret buttons and strumming as the appropriate fret icons cross the strike line on screen. Drums are done similar to the guitars, hitting the correct drum pad's/cymbals at the correct time. The better you do, the more points you score, however if you make too many mistakes, you will fail the song.</p><p>You can either play alone on any of the instrument careers, or you can play with up to three friends on one console or online to compete with other players and bands from across the world.</p><p>Songs featured include Duran Duran's <em>Rio</em>, Don McLean's <em>American Pie</em>, Evanescence's <em>Bring Me To Life</em> and Queen's <em>Crazy Little Thing Called Love</em>.</p>"},{"name":"Barbarian","year":2002,"developer":"Saffire, Inc","url":"PS2_COLLECTION_PART2/Barbarian%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":459308087,"score":6.2,"genres":"Action > 3rd-person (Other) > Fighting > Direct control > Fantasy","desc":"<p>A dark and evil force has spread over the land of Barbaria. Rumors say that the evil wizard called Zaugg is responsible. Prophecies foretell of a savior of the land who can prove to be a champion and defeat Zaugg. Ten Barbarians, all with their own reasons to hate Zaugg, come forward, each willing to destroy the wizard and prove themselves the hero of prophecy.</p><p><em>Barbarian</em> is a 3D vs. fighting game in a fantasy setting, inspired in gameplay largely by the Power Stone series. The game features ten characters who battle it out in fully three-dimensional, multi-level arenas, including castles, sewers, shipwrecks, swamps, and caverns.</p><p>Training mode includes tutorials for all of the game's moves and a practice session against a live opponent. Versus mode allows players to set up any fight they want, including four-player battles. The game's main single-player mode is Quest mode. Players select one of the ten characters, each of which has their own storyline. The story includes fights against all the other characters in the game and also features mirror matches. In some of the fights, opponents bring some lesser minions with them for support. After a fight is won, players can select which opponent to take on next, allowing for different paths through the story. Also after a fight, players can update their characters, raising their attributes like life, strength, damage dealt or magic regeneration time, and also unlock special abilities like double jumps or a berserker mode.</p><p>The fighting system is based on two basic buttons, one for weak and quick, one for strong and slow attacks. Stringing button combinations together enables combos, which each character having their own set. Some combos unleash magical attacks, which require the magic bar to be filled. Landing combos successfully enables additional rune attacks. Blocking and counters are also possible. The game's levels feature many objects to pick up that can be used as throwing or melee weapons. Objects come in different weights and require a certain amount of strength to pick up.</p>"},{"name":"Barbie as the Island Princess","year":2007,"developer":"Ivolgamus UAB","url":"PS2_COLLECTION_PART2/Barbie%20as%20The%20Island%20Princess%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1391103178,"score":"","genres":"Action > Mini-games > Music / rhythm > Licensed","desc":"<p><em>Barbie as the Island Princess</em> is a game based on the direct-to-video computer animated film of the same name staring the American toy doll Barbie.Rosella has been shipwrecked on an tropical island and is raised by a baby elephant, peacock and red panda. One day prince Antonio happens to come across the tropical island and Rosella soon learns she is actually the princess Barbie.</p><p>In the game the player can play as Barbie, Antonio or five other characters from the film. The game offers a total of twenty-eight mini games to compete in and features footage from the movie.</p>"},{"name":"Barbie Horse Adventures: Riding Camp","year":2008,"developer":"Pixel Tales AB","url":"PS2_COLLECTION_PART2/Barbie%20Horse%20Adventures%20-%20Riding%20Camp%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1473400382,"score":"","genres":"Adventure > Sports > Life / social simulation > Horse / derby > Licensed","desc":"<p><em>Barbie Horse Adventures: Riding Camp</em> is a horse riding game starring the American toy doll Barbie.</p><p>In the game, the player can train, ride or do jumps with several different horse breeds. Both Barbie and the horse can be customized with gear and clothing. The horse has to be fed, groomed and saddled up. Ribbons can be earned for doing a good performance with the horse.</p>"},{"name":"Barbie Horse Adventures: Wild Horse Rescue","year":2003,"developer":"Blitz Games Ltd","url":"PS2_COLLECTION_PART2/Barbie%20Horse%20Adventures%20-%20Wild%20Horse%20Rescue%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":793152270,"score":6.4,"genres":"Sports > 3rd-person (Other) > Horse / derby > Licensed","desc":"<p>In <em>Barbie Horse Adventures: Wild Horse Rescue</em>, a bunch of horses have been frightened by a lightning storm and Barbie must go round them back up. Her horse serves to move her around the terrain, but she must get off to do much else. The storm also knocked some things down, so she must climb or clear obstacles to access certain areas.</p><p>When she finds a horse, she must pet it to calm it down if it's a foal, or lasso a bigger horse, then lead it to a hitching post and call the stable on her cell phone. There are also coins to find which can be used to buy new outfits for Barbie or her horse. The object of the game is to rescue all the horses and complete Barbie's wardrobe.</p>"},{"name":"Barbie in The 12 Dancing Princesses","year":2006,"developer":"Blue Monkey Studios, Inc.","url":"PS2_COLLECTION_PART2/Barbie%20in%20The%2012%20Dancing%20Princesses%20%28Europe%29.zip","filesize":1058215995,"score":"","genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Fantasy > Licensed","desc":"<p><em>Barbie in the 12 Dancing Princesses</em> is based on the 2006 direct-to-video animated movie of the same name and the story is loosely based on the fairy tale <em>The Twelve Dancing Princesses</em>. Barbie is cast as Genevieve, one of the twelve princesses who live with their windowed father King Randolph in a castle. They live a frivolous live, so Randolph brings over his cousin Duchess Rowena to raise them as proper princesses. She makes their lives miserable however and poisons the king, so they flee to a magical world brought to life through a story of their mother. Rowena traps them there, along with Genevieve's friend Derek, and they need to use a goblet to collect mystical water that can cure their father.</p><p>The player controls Genevieve in a full 3D environment, but with a small amount of freedom and sometimes with brief branching. She can be moved in any direction and can jump while twirling, to complete platform sections or to avoid water that kills instantly. The game uses many moving platforms, elevators, gaps and platforms that disappear when she stands on them too long. There is no health system and she has an unlimited amount of lives, respawning right away at the last point. Along the way she can collect gems. She sometimes meets animals she can pet. There are many sections with short mini-games activated by walking into large, spinning coins. In one of them a cat is controlled in a game of Breakout, bouncing an apple to bring down leaves from a tree or using a water bubble. In another Genevieve needs to throw berries towards birds in a nest with a moving obstacle blocking the path. Another section offers a jigsaw puzzle that needs to be completed to open a door. Between gameplay sections there are many animated cut-scenes.</p><p>After the initial section a hub is entered that leads to four different worlds where the eleven princesses can be found. They are eventually brought back to the central hub by assigning the correct gem to them. The hub levels contain more mini-games next to the main exploration. She needs to guide a water bubble to collect music notes, design a dance choreography and a water fountain show, follow dance instructions similar to the Dance Dance Revolution games, use a slingshot to get flowers on waterlilies, and create a rainbow by moving a cloud to collect colours while avoiding dark clouds. There is a falling block puzzle game where the colours of the rainbow need to be gathered by matching gems of an identical colour in a group of three, horizontally or vertically, while dark clouds appear and remove blocks. Many mini-games are often repeated multiple times for the different princesses.</p>"},{"name":"Bard's Tale, The","year":2004,"developer":"inXile Entertainment, Inc.","url":"PS2_COLLECTION_PART2/Bard%27s%20Tale%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":3899457839,"score":7.5,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Action RPG > Fantasy","desc":"<p>The Bard is a cynical, opportunistic musician who roams the country in search of carnal pleasures. However, this impatient and selfish fellow is compelled to accept the greatest quest of his life: save the princess Caleigh from a demonic cult that has kidnapped her. The unlikely hero must now explore the land in search of the princess, accompanied by the omnipresent Narrator who obviously can't stand the Bard and uses every opportunity to sarcastically comment on his actions. Furthermore, Fionnaoch, the mysterious abductor of the princess, does everything he can to stop the Bard, sending his minions after him.</p><p>A self-proclaimed \"quest for coin and cleavage\", <em>The Bard's Tale</em> is an action RPG that is more of a whimsical take on role-playing games than a remake of the classic series. As the Bard, players can fight off hordes of foes with blade and bow, and summon companions through magical Bard Songs. Leveling up allows the player to raise the character's main attributes and invest specialization points in the different types of weapons he can use. Magical companions must be sought out and then summoned during battles. After being summoned, they act pretty much like AI-controlled party members; some of them specialize in physical attacks and offensive spells, while others can heal the hero.</p><p>During conversations the player can choose \"nice\" or \"snarky\" responses for the protagonist. While mostly used for humorous effect, some of these responses may affect subsequent events. The game uses the Dark Alliance engine and has a similar camera and control scheme.</p>"},{"name":"Barnyard","year":2006,"developer":"Blue Tongue Entertainment Pty, Ltd."},{"name":"Baroque","year":2007,"developer":"Sting, Inc.","url":"PS2_COLLECTION_PART2/Baroque%20%28Europe%29.zip","filesize":2011795421,"score":6.3,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Post-apocalyptic > Horror","desc":"<p>An updated remake of Baroque, a post-apocalyptic RPG game in which all hell has literally broke loose on earth. As the game starts, the world has been devastated by a heat wave and left nothing but demon infested ruins and a mysterious \"Nerve Tower\" which many claim that holds the answers to the apocalypse. You play as an amnesiac survivor who decides to enter the tower in search for clues to both your identity and the reasons behind the apocalypse.</p><p>The game plays as an RPG dungeon-crawler, in which you control your character and attempt to clear each floor in the tower from monsters, earning experience and items and only occasionally journeying outside the tower to get weapons and equipment from a few NPCs.</p><p>The PS2 remake adds additional floors, items and creatures and updates the whole game with a completely polygonal engine (the original used 2D sprites to depict characters and monsters). Furthermore, the point of view has been changed from first person to third person and the gameplay has been modified accordingly to make the game more of an action-RPG than the original.</p>"},{"name":"Baseball 2003, The: Akikigou","year":2003,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_b/Baseball%202003%2C%20The%20-%20Battle%20Ball%20Park%20Sengen%20-%20Perfect%20Play%20Pro%20Yakyuu%20%28Japan%29%20%28v2.02%29.zip","filesize":2003158498,"score":"","genres":"Action > Sports > 3rd-person (Other) > Baseball","desc":"<p>This edition features the 2003 updated Japanese pro players and team stats. The game has more realistic television quality graphics. New additions to the game include: fielder cursors, stamina gauges, and fluid defensive plays which allows you to grab those normally out-of-reach line drives. A training mode gives you a chance to practice pitching, defense, batting and even Konami's new \"Shock System\" which makes for more fluid game where players react immediately after hitting a pitch or when on the hunt for towering pop-ups. The Shock System also allows for balanced control during the game. </p><p>There is improved AI, running commentary by announcers, comfortable camera angles, and accurate recreations of team stadiums.</p>"},{"name":"Basketball Xciting","year":2003,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART2/Basketball%20Xciting%20%28Europe%29.zip","filesize":109041516,"score":"","genres":"Sports > 3rd-person (Other) > Direct control > Basketball","desc":"<p>Become a street ball legend!<br>\"In your face\" arcade-style 3-on-3 basketball! * Get ready to school your opponents on intercity courts with a handpicked quad of 24 players allowing you to build up to eight unique teams. * Challenge a friend to Ghetto-street ball where it's all about free styling. * Show-off you're skills with highflying dunks and mind-blowing combos.</p>"},{"name":"BASS Strike","year":2001,"developer":"Pai, Inc","url":"PS2_COLLECTION_PART2/Bass%20Strike%20%28Europe%29.zip","filesize":589389454,"score":6.1,"genres":"Simulation > Sports > 1st-person > Diagonal-down > Fishing > Licensed","desc":"<p><em>BASS Strike</em> was the first bass fishing title to hit the PlayStation 2 and features a license from the B.A.S.S. (Bass Anglers Sportsman Society). The player can choose from six different anglers and fish on several different lakes, each with their own \"hot spots\". There are 36 authentic lures to choose from including real equipment and with the B.A.S.S. license, the Bass Master Classic is available to compete in with the authentic rules and regulations provided if the player qualifies through eight tournaments.</p><p>The fish react realistically to their real world counterparts along with variable weather conditions that can either help or hamper the player's chances when fishing. There is also an underwater camera for when the player casts their line and features commentary by B.A.S.S. legend, Shaw Grigsby.</p>"},{"name":"Batman Begins","year":2005,"developer":"Warner Bros. Interactive Entertainment Inc.","url":"PS2_COLLECTION_PART2/Batman%20Begins%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":3473575990,"score":6.9,"genres":"Action > Racing / Driving > 1st-person > 3rd-person (Other) > Stealth > Direct control > Fantasy > Licensed","desc":"<p>In this adaptation of the film of the same name, the origins of the Batman legend are explored. Playing as both Bruce Wayne and his alter-ego, Batman, you will need to hunt evil forces in familiar locations such as Arkham Asylum, Gotham City, but also in the Himalaya. Using both stealth and brutal skills, you take on enemies in true beat-em-up style. Batman has a vast array of moves, from kicks and punches to more exotic special moves. Multiple enemies can be attacked at once, and there are tricks to break through enemies' defenses. Also, certain attacks can only be used as a finishing move when opponents are weakened.</p><p>Next to the melee combat, Batman carries his Bat Utility Belt with a Batgrapple to reach higher areas, the Batarang and gadgets such as smoke and flash grenades, a lockpick, camera hacker and an optical wire to peek from behind corners.</p><p>Certain levels turn Batman Begins into a racing game, as you drive the shiny Batmobile at high speeds through Gotham City. During these missions, your progress is measured by a reputation meter, which increases when you take out cops and thugs, and decreases when you harm civilians. There is nitro available for even higher speeds and an armor meter shows the status of your car.</p>"},{"name":"Batman: Rise of Sin Tzu","year":2003,"developer":"Ubisoft Entertainment Inc.","url":"PS2_COLLECTION_PART2/Batman%20-%20Rise%20of%20Sin%20Tzu%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2970718197,"score":6.3,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Licensed","desc":"<p>On the anniversary of the death of his parents, Bruce Wayne must face a new evil that is turning Gotham City into a crisis zone. Batman must rise to the challenge, as Sin Tzu leaves his mark on the city.</p><p>Along with Robin, Nightwing and Batgirl, Batman must battle through various locations in Gotham City in search of the truth behind this new foe, while fighting off the threat from other well-known characters from the comic book series, Bane, Clayface and Scarecrow.</p><p>Batman can use his full collection of weapons and gadgets to his advantage, including the Batarang and grappling hook. Plus there's plenty of martial arts moves to bust on the bad guys, and if it's too much to fight off, the 2 player co-op mode allows two characters to battle side-by-side.</p>"},{"name":"Batman: Vengeance","year":2001,"developer":"Ubi Soft Entertainment Inc.","url":"PS2_COLLECTION_PART2/Batman%20-%20Vengeance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":605568014,"score":6.7,"genres":"Action > 1st-person > 3rd-person (Other) > Cyberpunk / dark sci-fi > Licensed","desc":"<p>Based on the cartoon series rather the comic books or the movies, <em>Batman: Vengeance</em> puts you in the role of the 'Dark Knight' in a 3D Gotham City, in order to face and fight enemies; such as Mr. Freeze, Poison Ivy, Harley Quinn, and, yes, The Joker.</p><p>The Joker has died after falling from a bridge mid-scuffle with our caped hero. With the big man's place at the top of the criminal hierarchy up for grabs, the city's most heinous villains are out in force, clambering over each other for the new employment opportunity. Batman's most dangerous opponents are causing a crime wave the likes of which Gotham has never seen. Nothing is as it seems. You can't even be sure that the infamous Joker has really ceased to exist. Gotham's safety hangs in the balance and only Batman can save it.</p>"},{"name":"Battle Assault 3 featuring Gundam Seed","year":2004,"developer":"Natsume Co., Ltd.","url":"sony_playstation2_b/Battle%20Assault%203%20featuring%20Gundam%20Seed%20%28USA%29.zip","filesize":556112171,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Direct control > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>THE FUTURE OF MANKIND IS IN YOUR HANDS.<br><br>* 32 playable mobile suits to choose from, including 4 unlockable mobile suits from Gundam Wing and G Gundam!<br>* Interactive 3D environments.<br>* 5 playable Modes: Mission, Versus, Tag Team, Survival, and Time Trial featuring 2 vs. 2 cooperative play.<br>ARE YOU UP FOR THE CHALLENGE?</p>"},{"name":"Battle Engine Aquila","year":2003,"developer":"Lost Toys Ltd","url":"PS2_COLLECTION_PART2/Battle%20Engine%20Aquila%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1974606148,"score":7,"genres":"Action > 1st-person > Shooter > Flight / aviation > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In the future, on the planet Allium, the situation has become desperate. This world has suffered from global warming, causing the polar ice caps to melt. The rising sea has resulted in the amount habitable land to decrease dramatically. All that is left are island chains, making land the most valuable resource on the planet. The entire population must survive and compete over these islands.</p><p>Currently, there are two distinct civilizations on Allium, settled into an uneasy cease-fire. There are the scientifically advanced Forseti and the aggressive Muspell. The Forseti have recently developed the most advanced combat vehicle in existence, the Battle Engine Aquila. The Aquila is both a four-legged mechanized tank and a combat jet, it is capable of switching modes at will. Players take the role of Hawk Winter, a Forseti cargo loader operator who has been conscripted because of his piloting skills.</p><p><em>Battle Engine Aquila</em> is a mechanized shooter taking place in a larger battlefield. The player plays only a single, yet important, role in a larger war effort. A large part of the gameplay consists of supporting and being supported by the allied forces. Players will have to fight naval, air, and ground forces in both modes of their battle engine.</p>"},{"name":"Battle Stadium D.O.N","year":2006,"developer":"Eighting Co., Ltd.","url":"sony_playstation2_b/Battle%20Stadium%20D.O.N%20%28Japan%29.zip","filesize":251416447,"score":"","genres":"Action > Side view > 2D scrolling > Fighting > Fantasy > Licensed","desc":"<p><em>Battle Stadium D.O.N</em> is a 3D fighting game played from a side view perspective similar to Super Smash Bros with 3D character models based on the <em>Dragon Ball Z</em>, <em>One Piece</em> and <em>Naruto</em> anime and manga series.</p><p>The game offers a total of twenty playable characters: Son Goku, Son Gohan, Piccolo, Future Trunks, Vegeta, Freeza, Cell, Majin Boo (<em>Dragon Ball Z</em>) - Monkey D. Luffy, Roronoa Zoro, Nami, Usopp, Sanji, Chopper (<em>One Piece</em>) - Naruto Uzumaki, Sasuke Uchiha, Sakura Haruno, Kakashi Hatake, Rock Lee and Gaara (<em>Naruto</em>). Not all of them are available at the start of the game and need to be unlocked. Each fighter has their own fighting techniques including special attacks and can run and jump on platforms in the various fighting arenas. These also contain power-ups.</p>"},{"name":"Battlefield 2: Modern Combat","year":2005,"developer":"Electronic Arts UK Ltd.","url":"PS2_COLLECTION_PART2/Battlefield%202%20-%20Modern%20Combat%20%28Europe%29%20%28En%2CEs%2CNl%2CSv%29%20%28v2.01%29.zip","filesize":2620452752,"score":7.7,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Helicopter > Tank > Contemporary > War","desc":"<p>Although called Battlefield 2, this is the first of the Battlefield series to pass over to console. Vehicles like the Humvees, tanks, APCs and helicopters all make it into the game although fixed wing aircraft are noticeable absent.</p><p>Multiplayer allows up to 24 players battle it out in a Conquest mode where you capture flags and maintain control of them until the enemy tickers run down, or Capture the Flag which is all out attack to get the enemy flag back to your own base. A single player campaign, which is story led, see's China and USA go up against each other in Kazakhstan.Throughout the single player campaign you switch between China and USA armies as you follow orders based on news reports which show both sides of the war giving you a view of how war is and how it's reported.The new Hot Swap feature allows you to jump into almost any other allied troop on the battlefield which saves loads of running and gets you into the best position for your next attack or defense.</p>"},{"name":"Battlestar Galactica","year":2003,"developer":"Warthog Games Ltd.","url":"PS2_COLLECTION_PART2/Battlestar%20Galactica%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1959095086,"score":6.9,"genres":"Action > Simulation > 1st-person > Behind view > Shooter > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>Set 40 years before the Sci-Fi Channel's 2004 <em>Battlestar Galactica</em> miniseries, the game acts as a prequel to the events in the new series. Players control Captain William Adama as he participates in 15 missions leading up to the end of the First Cylon War.</p><p>Missions are tightly scripted. Players control three varieties of Viper fighters, as well as captured Cylon raiders, depending on the needs of the mission. Players also will man the stationary defense turrets on board the <em>Galactica</em>. Missions have clear goals, often with time limits, and are expressed and tracked through voiced radio chatter between wingmen and <em>Galactica</em>'s war room. Players are graded in a variety of areas after each level (including accuracy and keeping wingmen alive), and unlock upgrades and bonus material for high ratings.</p><p>Players control their craft from either a first or third person view. Fighters have unlimited ammo, missiles, and auto-repair any damage taken, but only if enough recharging energy is available. Firing weapons and using afterburners drain energy, and the fighter only repairs itself when the energy level is full. Players must be aware of their energy usage to keep from running out at critical moments.</p><p>Missiles on every craft can also be configured on the fly through an option in the pause menu. Pilots can program missiles to have increased power at the cost of speed, or increase maneuverability at the cost of blast radius. This system allows players to adapt their missiles to the current needs of the mission, from swatting down formations of fighters to breaking through a capital ship's defenses.</p><p>Though it acts as a prequel to the new series, art and design is pulled from the original 1978 <em>Battlestar Galactica</em>. The intro from the original series is used. Cylons Raiders, Colonial Vipers, and the <em>Galactica</em> itself use the original designs, Cylons themselves look like the original chrome toasters, and the reptilian race that created them (in the original series, not the reboot) make appearances.</p>"},{"name":"BCV: Battle Construction Vehicles","year":2000,"developer":"Artdink Corporation","url":"PS2_COLLECTION_PART2/BCV%20-%20Battle%20Construction%20Vehicles%20%28Europe%29.zip","filesize":887885629,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga","desc":"<p><em>BCV: Battle Construction Vehicles</em> is a fighting game between present-day mechs: construction vehicles. </p><p>Players choose between 15 drivers and 14 bulldozers, steamrollers, cranes and forklifts, to name a few, and the goal is to defend your father's construction business. The player can fully customize the vehicles parts, attack moves and appearance, which adds to the replay value of the story mode, consisting of 16 interactive stages, aside from the 2-player mode. Most of the attacks consist or ramming other vehicles or utilizing the mechanical parts that do damage upon impact. The story is furthered through anime-like cut-scenes.</p>"},{"name":"Beat Down: Fists of Vengeance","year":2005,"developer":"cavia inc.","url":"PS2_COLLECTION_PART2/Beat%20Down%20-%20Fists%20of%20Vengeance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2975366503,"score":5.5,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Fighting > Direct control","desc":"<p>You start out in an abandoned warehouse in the grimy city of Las Sombras ready to make a drug deal and then all hell breaks loose. You have been double-crossed by your current cartel and now you seek revenge. In this beat-em up with light rpg elements, you get to choose one of the five characters whose names are: Raven, Jason G, Gina , Lola and Aaron. You walk through the city with two optional allies getting into fights with other gang members, Some gang members are able to be recruited if you best them in a one on one fight. You also have a crime level which makes gang members and police able to identify you. You can lower your crime level by purchasing and then wearing different outfits. You can also level up your characters attack, stamina and technique by gaining experience from fighting,There are two multiplayer modes in Beatdown: VS mode normal, where you can select up to three characters for your team, then choose player vs cpu, player vs player and cpu vs cpu; and also VS mode custom, where you select up to three characters for your team and load a three character party that you have recruited from the single player game.</p>"},{"name":"Beatmania","year":2006,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_b/Beatmania%20%28USA%29.zip","filesize":2610424054,"score":6.8,"genres":"Action > Top-down > Arcade > Music / rhythm","desc":"<p>The legendary rhythm game that started a craze in Japan makes its first outing in America! beatmania features over fifty songs from the classic beatmania and beatmania IIDX games, as well as a few originals.</p><p>The game includes a special turntable controller with a scratchpad and seven keys. You have to press the seven buttons and move the scratchpad according to what appears on screen, and the better you do, the more points you'll get!</p><p>This version of the game is different from other releases. Even though the game is called beatmania, it is closer both in appearance and play modes to beatmania IIDX.</p>"},{"name":"Beatmania Da Da Da!!","year":2001,"developer":"Adlink","url":"sony_playstation2_b/Beatmania%20Da%20Da%20Da%21%21%20%28Japan%29.zip","filesize":229982117,"score":"","genres":"Educational > Music / rhythm > Typing","desc":"<p><em>beatmania Da Da Da!!</em> is a console adaptation of the PC rhythm typing tutor beatmania Da!!, which combines a typing tutor with the rhythm gameplay of Konami's popular beatmania series. As in regular <em>beatmania</em>, notes descend from the top of the screen toward a bar, timed to cross the bar in time with elements of the music. Each note has a letter above it, which must be typed on the keyboard at the proper time to play the music. At certain points in each song, notes with phrases will appear, and the full phrase must be typed before the note reaches the bar in order to play it. This version includes a total of 26 songs, and comes packaged with a USB keyboard.</p>"},{"name":"Beatmania IIDX 10th style","year":2005,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_b/Beatmania%20II%20DX%2010th%20Style%20%28Japan%29.zip","filesize":3893107034,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>beatmania IIDX 10th style</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, featuring more than 80 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music. All of the game modes from the previous title have returned: Arcade, Expert, Class, Beginner's, Free, Training, and Gallery.</p>"},{"name":"Beatmania IIDX 11: IIDX RED","year":2006,"developer":"Konami Digital Entertainment Co., Ltd.","url":"sony_playstation2_b/Beatmania%20II%20DX%2011%20-%20II%20DX%20Red%20%28Japan%29.zip","filesize":4024666357,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>IIDX RED</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, featuring more than 80 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music. All of the game modes from the previous title have returned: Arcade, Expert, Class, Beginner's, Free, Training, and Gallery. The game also includes support for Internet score ranking (now discontinued) and custom-made Arcade courses.</p>"},{"name":"Beatmania IIDX 12: HAPPY SKY","year":2006,"developer":"Konami Digital Entertainment Co., Ltd.","url":"sony_playstation2_b/Beatmania%20II%20DX%2012%20-%20Happy%20Sky%20%28Japan%29.zip","filesize":4133818458,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>HAPPY SKY</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, featuring more than 80 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music. All of the game modes from the previous title have returned: Arcade, Expert, Class, Beginner's, Free, Training, and Gallery. The game also includes support for Internet score ranking (now discontinued) and custom-made Arcade courses.</p>"},{"name":"Beatmania IIDX 13: DistorteD","year":2007,"developer":"Konami Digital Entertainment Co., Ltd.","url":"sony_playstation2_b/Beatmania%20II%20DX%2013%20-%20Distorted%20%28Japan%29.zip","filesize":4079840754,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>DistorteD</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, featuring more than 80 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music. All of the game modes from the previous title have returned: Arcade, Expert, Class, Beginner's, Free, Training, and Gallery. The game also includes support for Internet score ranking (now discontinued) and custom-made Arcade courses.</p>"},{"name":"Beatmania IIDX 14: GOLD","year":2008,"developer":"Konami Digital Entertainment Co., Ltd.","url":"sony_playstation2_b/Beatmania%20II%20DX%2014%20-%20Gold%20%28Japan%29.zip","filesize":4007978366,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>GOLD</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, featuring more than 90 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music. All of the game modes from the previous title have returned: Arcade, Expert, Class, Beginner's, Free, Training, and Gallery. The game also includes support for Internet score ranking (now discontinued) and custom-made Arcade courses.</p>"},{"name":"Beatmania IIDX 15: DJ TROOPERS","year":2008,"developer":"Konami Digital Entertainment Co., Ltd.","url":"sony_playstation2_b/Beatmania%20II%20DX%2015%20-%20DJ%20Troopers%20%28Japan%29.zip","filesize":4078481713,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>DJ TROOPERS</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, featuring more than 90 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music. All of the game modes from the previous title have returned: Arcade, Expert, Class, Beginner's, Free, Training, and Gallery. The game also includes support for Internet score ranking (now discontinued) and custom-made Arcade courses.</p>"},{"name":"Beatmania IIDX 16: EMPRESS + PREMIUM BEST (Disc 1)","year":2009,"developer":"Konami Digital Entertainment Co., Ltd.","url":"sony_playstation2_b/Beatmania%20II%20DX%2016%20-%20Empress%20%2B%20Premium%20Best%20%28Japan%29%20%28Disc%201%29%20%28Empress%20Disc%29.zip","filesize":3907950816,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>EMPRESS + PREMIUM BEST</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, and the last release for the PlayStation 2. Including both a conversion of the arcade release, and a \"Premium Best\" disc, it features a whopping 180+ tracks from the arcade versions of <em>IIDX 16 EMPRESS</em> and <em>IIDX 17 SIRIUS</em>, original tracks produced for the home release, and a deep selection of returning tracks from throughout the entire series.</p><p>As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music. All of the game modes from the previous title have returned: Arcade, Expert, Class, Beginner's, Free, Training, and Gallery.</p>"},{"name":"Beatmania IIDX 16: EMPRESS + PREMIUM BEST (Disc 2)","year":2009,"developer":"Konami Digital Entertainment Co., Ltd.","url":"sony_playstation2_b/Beatmania%20II%20DX%2016%20-%20Empress%20%2B%20Premium%20Best%20%28Japan%29%20%28Disc%202%29%20%28Premium%20Best%20Disc%29.zip","filesize":4067469971,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>EMPRESS + PREMIUM BEST</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, and the last release for the PlayStation 2. Including both a conversion of the arcade release, and a \"Premium Best\" disc, it features a whopping 180+ tracks from the arcade versions of <em>IIDX 16 EMPRESS</em> and <em>IIDX 17 SIRIUS</em>, original tracks produced for the home release, and a deep selection of returning tracks from throughout the entire series.</p><p>As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music. All of the game modes from the previous title have returned: Arcade, Expert, Class, Beginner's, Free, Training, and Gallery.</p>"},{"name":"Beatmania IIDX 3rd style","year":2000,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_b/Beatmania%20II%20DX%203rd%20Style%20%28Japan%29.zip","filesize":3572946545,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>beatmania IIDX 3rd style</em> is the first PS2 release in Konami's long-running beatmania rhythm game franchise, and the first home release from the IIDX series. This version contains a selection of tracks from the first four arcade IIDX games -- <em>beatmania IIDX</em>, <em>IIDX Substream</em>, <em>IIDX 2nd style</em>, and <em>IIDX 3rd style</em> -- for a total of more than 80 songs, though it does not feature a complete selection of songs from any specific arcade version.</p><p><em>beatmania IIDX</em> is very similar to the previous <em>beatmania</em> games, with the distinct difference of the controller having seven keys -- four white and three black -- compared to the original series' five. In each song, color-coded notes scroll from the top of the screen in time with the music, and the corresponding keys must be pressed at the correct time to play along with the music. Good timing will increase the player's Groove Level, while poor timing or missed notes will decrease it, and the goal is to have the Groove Level above a certain level at the end of the song.</p><p>There are three main modes in the game. Arcade mode is presents a selection of so-called \"courses\" which consist of five songs each, which must be cleared in order. Free mode allows any track played in Arcade mode to be freely replayed. Practice mode is exactly what it sounds like: a practice mode where songs or sections of songs can be practiced without any risk of failure. There are also a large number of unlockable songs and courses, and numerous modifiers that affect the note charts and displays.</p>"},{"name":"Beatmania IIDX 4th style: new songs collection","year":2001,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_b/Beatmania%20II%20DX%204th%20Style%20-%20New%20Songs%20Collection%20%28Japan%29.zip","filesize":2417667222,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>beatmania IIDX 4th style</em> is the second home release in Konami's <em>IIDX</em> rhythm game series, featuring more than 50 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music. There are three main modes: Arcade mode tasks the player with completing several tracks in succession, Free mode lets the player freely play any unlocked song, and Practice mode lets the player practice parts of songs without danger of failure.</p>"},{"name":"Beatmania IIDX 5th style: new songs collection","year":2001,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_b/Beatmania%20II%20DX%205th%20Style%20-%20New%20Songs%20Collection%20%28Japan%29.zip","filesize":3438186709,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>beatmania IIDX 5th style</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, featuring more than 60 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music. There are three main modes: Arcade mode tasks the player with completing several tracks in succession, Free mode lets the player freely play any unlocked song, and Practice mode lets the player practice parts of songs without danger of failure.</p><p>New in this edition are two additional training modes. Beginner's Mode offers extra-easy 7-key versions of each track, simpler than even the Light-7 versions available since 3rd style. Drill mode offers a selection of specific challenges designed to help players improve their performance. Unique to this release is the ability to install game data to a PS2 hard drive to decrease loading times.</p>"},{"name":"Beatmania IIDX 6th style: new songs collection","year":2002,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_b/Beatmania%20II%20DX%206th%20Style%20-%20New%20Songs%20Collection%20%28Japan%29.zip","filesize":4160431803,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>beatmania IIDX 6th style</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, featuring more than 60 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music.</p><p>There are three main modes: Arcade mode tasks the player with completing several tracks in succession, Free mode lets the player freely play any unlocked song, and Practice mode lets the player practice parts of songs without danger of failure. The Beginner's and Drill modes introduced in 5th style also return. This edition also introduces a gallery mode where illustrations and the in-game videos can be viewed.</p>"},{"name":"Beatmania IIDX 7th style","year":2004,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_b/Beatmania%20II%20DX%207th%20Style%20%28Japan%29.zip","filesize":2425382067,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>beatmania IIDX 7th style</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, featuring more than 80 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music.</p><p>There are three main modes: Arcade mode tasks the player with completing several tracks in succession, Free mode lets the player freely play any unlocked song, and Training mode lets the player practice parts of songs without danger of failure. The Beginner's and Drill modes introduced in 5th style also return. New in this edition is Master's Mode, which challenges the player to complete numerous songs in succession with the same Groove Meter.</p>"},{"name":"Beatmania IIDX 8th style","year":2004,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_b/Beatmania%20II%20DX%208th%20Style%20%28Japan%29%20%28En%2CJa%29.zip","filesize":3608832148,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>beatmania IIDX 8th style</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, featuring more than 80 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music.</p><p>There are three main modes: Arcade mode tasks the player with completing several tracks in succession, Free mode lets the player freely play any unlocked song, and Training mode lets the player practice parts of songs without danger of failure. The Beginner's and Drill modes introduced in 5th style also return. New in this edition are two new expert modes designed to test the skills of high-level players, and the gallery mode from 6th style has also returned.</p>"},{"name":"Beatmania IIDX 9th style","year":2005,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_b/Beatmania%20II%20DX%209th%20Style%20%28Japan%29.zip","filesize":3766398557,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>beatmania IIDX 9th style</em> is one of the many titles in Konami's <em>IIDX</em> rhythm game series, featuring more than 80 tracks, primarily from the arcade version of the same title. As usual for the beatmania series, the player is given seven piano keys and a turntable, and must play along with the notes that scroll down the screen to play the music. <em>9th style</em> features a completely revamped interface compared to the previous titles, owing to the more powerful hardware that the arcade version ran on.</p><p>There are three main modes: Arcade mode tasks the player with completing several tracks in succession, Free mode lets the player freely play any unlocked song, and Training mode lets the player practice parts of songs without danger of failure. The Beginner's mode from 5th style and the Class mode from 7th style are also present, as is the gallery mode.</p>"},{"name":"Beats of Rage","year":2004,"developer":"Senile Team"},{"name":"Bee Movie Game","year":2007,"developer":"Beenox Score"},{"name":"Ben 10: Alien Force","year":2008,"developer":"Monkey Bar Games","url":"PS2_COLLECTION_PART2/Ben%2010%20-%20Alien%20Force%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1822292349,"score":"","genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p><em>Ben 10: Alien Force</em> is a 3D action-adventure game based on the TV series of the same name. </p><p>The major part of the game sees the player taking control of Ben. He can transform in to a multitude of aliens that vary in size and abilities. But some parts are played with Gwen or Kevin. Gameplay includes defeating enemies, bosses, platforming and solving puzzles. The game can be played solo or in co-op.</p><p>Regarding the plot, Ben, Gwen and Kevin are on their way to an amusement pier when the tracking system in the car picks up signals from alien artifacts located at the pier. But it appears the Forever Knights are also after the artifacts. While retrieving the artifact, they encounter the Tetramand Plumber named Gorvan who explains the Highbreed are after several artifacts on earth. Now it’s up to you to stop them.</p>"},{"name":"Ben 10: Alien Force - Vilgax Attacks","year":2009,"developer":"Papaya Studio Corporation","url":"PS2_COLLECTION_PART2/Ben%2010%20-%20Alien%20Force%20-%20Vilgax%20Attacks%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":937499830,"score":7,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Sci-fi / futuristic > Licensed","desc":"<p>Players take on the role of Ben Tennyson from the television series Ben 10: Alien Force. Vilgax is once again attempting to invade earth, and Ben is the only hero who can stand in his way of Vilgax's newly discovered Null Void cannon. </p><p>Players are able to transform into eight alien forms to battle their way through Vilgax's minions and solve various puzzles along the way. The action takes place on the home worlds of Ben's alien forms as players platform their way through the lava pits of Vulpin and break their way through the temples of Terradino. Combat uses a combo based attack system focused on grand special attacks which take out several enemies at a time. Enemies spawn in waves of several enemies each, creating swarms of enemy attackers.</p><p>Along with Vilgax, several other memorable villains from the series make appearance throughout the game in epic boss battles.</p>"},{"name":"Ben 10: Protector of Earth","year":2007,"developer":"High Voltage Software, Inc.","url":"PS2_COLLECTION_PART2/Ben%2010%20-%20Protector%20of%20Earth%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2176402090,"score":6.4,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Sci-fi / futuristic > Licensed","desc":"<p><em>Ben 10: Protector Of The Earth</em> is an action game based on the cartoon series Ben 10. The story follows the adventures of Ben Tennyson, who one day finds a watch-like device called the Ominitrix, which give him the ability to transform into different aliens each with its own special ability.</p><p>The aliens in which Ben can transform are: Fourarms, a big brute who excels at close combat, Fireblast, who can torch his enemies with fireballs, XLR8, a superfast speedster, Cannonball, who can turn into a metal ball and lastly Wildvine, who can stretch his limbs to reach new places.</p><p>The player has three kinds of attacks: light, heavy and the special moves as well as a large number of combos. The game features more than 14 levels, visiting locations as the Grand Canyon, San Francisco, Seattle, or Mt. Rushmore.</p><p>The PSP version has exclusive challenge locations and skins.</p>"},{"name":"Ben 10: Ultimate Alien - Cosmic Destruction","year":2010,"developer":"Papaya Studio Corporation","url":"PS2_COLLECTION_PART2/Ben%2010%20-%20Ultimate%20Alien%20-%20Cosmic%20Destruction%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":978890445,"score":6.1,"genres":"Action > Behind view > Beat 'em up / brawler > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p><em>Ben 10 Ultimate Alien: Cosmic Destruction</em> is a 3D action-adventure game based on the TV series <em>Ben 10: Ultimate Alien</em>. It is now no longer a secret to the world that Ben is a superhero and he is now in control of the Ultimatrix. Earth is threatened by a strange Galactic storm housing a powerful evil and the power of the Ultimatrix may not be enough. Now Ben has to find several Galvan artifacts scattered around the planet to enhance the powers of the Ultimatrix.</p><p>The player takes control of Ben and can transform in to a multitude of aliens that vary in size, and abilities. Gameplay includes defeating enemies, bosses and solving puzzles. In the game various earth locations are visited like China, Paris, Tokyo and Rome. The PS3 and Xbox versions have one extra platform unique alien. The game characters are voiced by the original TV voice actors.</p>"},{"name":"Ben Hur: Blood of Braves","year":2003,"developer":"Microïds","url":"PS2_COLLECTION_PART2/Ben%20Hur%20-%20Blood%20of%20Braves%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":908428169,"score":6.6,"genres":"Action > Racing / Driving > Behind view > Track racing > Vehicular combat > Classical antiquity > Licensed","desc":"<p><em>Ben Hur: Blood of Braves</em> is a 3D chariot racing game set in the time of the Roman empire, where the player will race and battle his opponents across the circuits of the ancient world.</p><p>The game offers a total of 15 characters to choose from and 17 race courses. These include Pompeii, Circus Maximus and Olympus among others. While racing against the other opponents 64 spells can be used. Ranging from healing to magic attacks as well as skill upgrades. Five game modes can be chosen. These include Arcade, Career, Time attack, Deathmatch and Multiplayer for two players.</p>"},{"name":"Berserk Millennium Falcon Arc: Seimasenki no Sho","year":2004,"developer":"Yuke's Co. Ltd.","url":"sony_playstation2_b/Berserk%20-%20Millennium%20Falcon-hen%20-%20Seima%20Senki%20no%20Shou%20%28Japan%29.zip","filesize":3820193437,"score":"","genres":"Action > 3rd-person (Other) > Hack and slash > Fantasy > Licensed","desc":"<p><em>Berserk Millennium Falcon Arc</em> is the second video game based on the Berserk manga and once again developed by Yuke’s Co. Ltd. This game is based on the Millennium Falcon Arc chapters 22-27 of the manga.</p><p>The Berserk world is ruled by the member of God Hand, entities with the power to manipulate the destiny of mankind. During the ceremony of the incarnation of the mercenary leader Griffith, he murders many people. In the previous game, Guts, the Black Swordsman, stands up and manages to escape with his love Casca, but has his left arm severed.</p><p>In this game, demon-slaying anti-hero Guts continues his quest, with the help of the elf Puck and Casca, who suffers from amnesia, as well as new characters such as Farnese, Serpico, Isidro and Schierke. The storyline unfolds through animated cut-scenes.</p><p>The gameplay consists of over the top hack 'n slash gameplay mixed with strategic combos, recovery time, charged attacks and blocking. By timing rights, Guts can perform reversal strikes or counter attacks to damage difficult enemies. He can also unleash special attacks and fatalities. There are different weapons to choose from, a mixture of classic slashing weapons and modern guns. Guts also needs the help of his allies - they can restore your health or provide help during battles with additional attacks or modifiers. There is also a lock-on mode and a Berserker mode for faster and more powerful attacks.</p><p>Slaying enemies results in cash which can be exchanged for magic or upgrades, such as sword proficiency, more health or boosts for your allies. When the game's main mode has been completed, two additional modes are unlocked: 100-Animal Murder (kill a set amount of enemies in a race against time) and Boss Rush (replay boss fights) Each completed level in the first mode is awarded with new weapons. The voice acting is done by actors from the original anime TV series.</p>"},{"name":"Beta Bloc","year":2006,"developer":"Tamsoft Corporation","url":"sony_playstation2_b/Beta%20Bloc%20%28Europe%29.zip","filesize":104007049,"score":"","genres":"Action > Fixed / flip-screen > Paddle / Pong > RPG elements > Direct control","desc":"<p>Prepare your paddle for brick-breaking RPG action!<br><br>7 Dooms exist in this world, with legendary monsters waiting for your challenge! Turn your system on its side and operate the dragon paddle to fight through 120 challenging stages of brick-breaking action. Earn experience points and increase the strength and spell powers of your paddle as you take on a totally unique gaming experience mixing classic brick-breaking gameplay with RPG elements.<br><br>* A unique mix of RPG and brick-breaking gameplay played vertically on your system<br><br>* Destroy all the blocs on each stage to progress and clear the land of evil<br><br>* Earn experience points and level up as you clear each stage<br><br>* Use special moves like squash hits, shake-the-wall and plasma cannon<br><br>* Battle powerful boss enemies at the end of each zone<br><br>* Fight against your friends via wireless play<br><br>Beta Bloc © Tamsoft. ALL RIGHTS RESERVED. Published by D3Publisher. Developed by Tamsoft.<br><br>Purchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.</p>"},{"name":"Beverly Hills Cop","year":2007,"developer":"3rd Dimension Creations Ltd.","url":"PS2_COLLECTION_PART2/Beverly%20Hills%20Cop%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":199348592,"score":"","genres":"Action > 1st-person > Shooter > Direct control > Licensed","desc":"<p><em>Beverly Hills Cop</em> is a game based on the popular 1980s movie series of the same name. The game contains 6 new missions for cop Axel Foley to blast his way through the city of Los Angeles, busting villains through the use of 6 unique weapons.</p>"},{"name":"Beyond Good & Evil","year":2003,"developer":"Ubisoft Pictures SAS","url":"PS2_COLLECTION_PART2/Beyond%20Good%20%26%20Evil%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1661157808,"score":8.1,"genres":"Action > Racing / Driving > 1st-person > Behind view > Puzzle elements > Shooter > Stealth > Direct control > Flight / aviation > Hovercraft > Space flight > Sci-fi / futuristic > Spy / espionage","desc":"<p>In the future, on the planet Hillys, the population suffers from constant attacks from the alien DomZ. The situation is gradually getting worse, as the rate of DomZ kidnapings increases. The Alpha Section forces, who are in charge of protecting citizens, seem to be completely ineffective, not even fighting the DomZ. In the midst of this situation, the secretive organization IRIS alleges that the Alpha Section is involved in a massive government conspiracy, and seeks to expose the truth through journalism.</p><p>The player controls a young reporter and photographer named Jade with her companions Pey'j and Double H. After experiencing first-hand a DomZ attack, she is contacted by IRIS, who recruits her as an action reporter. Jade is now tasked with infiltrating the Alpha Section, exposing the government conspiracy, and ultimately finding the truth for herself.</p><p><em>Beyond Good &amp; Evil</em> is an action game with diverse gameplay. Much of the game is based on stealth and puzzles, but there are sequences of racing, shooting, combat, and platform action. Jade fights with her staff and also uses various abilities to execute long-ranged attacks and solve puzzles. Many of the puzzles require switching between the characters and using their special abilities; often it is necessary to coordinate the actions of two characters to achieve precise co-operation that leads to a puzzle's solution. Besides hostile areas with puzzles and enemies, there is also a city and other friendly areas to explore, where various items and gadgets can (and sometimes must) be bought. There are several mini-games and even an online ranking system (used by entering codes online after they are assigned in-game when the game is saved).</p>"},{"name":"Biathlon 2008","year":2008,"developer":"49Games GmbH"},{"name":"Bible Game, The","year":2005,"developer":"Mass Media, Inc.","url":"PS2_COLLECTION_PART2/Bible%20Game%2C%20The%20%28Europe%29%20%28En%2CFr%2CIt%29.zip","filesize":377686075,"score":"","genres":"Educational > Simulation > Game show / trivia / quiz > Religion","desc":"<p><em>The Bible Game</em> is a Christian-themed party game. There are a variety of trivia questions (from a pool of 1,500) related to the Old Testament. The main two modes are \"TV Game Show\" and \"Challenge Games\". The latter lets you choose any mini-game. In the TV Game Show mode players need to buzz in quickly to answer. The game supports up to four players and includes 20 mini-games based on Biblical stories, from Jonah and the Whale to David and Goliath. It also includes music by Christian artists.</p>"},{"name":"Big Mutha Truckers","year":2002,"developer":"Eutechnyx Limited","url":"PS2_COLLECTION_PART2/Big%20Mutha%20Truckers%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":538440910,"score":6.6,"genres":"Racing / Driving > 1st-person > Behind view > Managerial / business simulation > Transport > Truck > Vehicle simulator","desc":"<p>Ma Jackson, the owner of Big Mutha Truckers, tells her four sons she is retiring. The new owner of Ma's company will be the son who makes the most money trucking through Hick State County for 60 days.</p><p><em>Big Mutha Truckers</em> is a truck racing game in which the player can take control of Bobbie-Sue, Cletus, Earl, or Rawkus. The basic gameplay consists of transporting wares from one of the game's five cities to another one. In each city, there is a local store, where these goods can be bought or sold. Each store indicates how their buying and selling prices for an item measure up against the competition. At the local bar, the player can talk to the bartender to get some tips on what kind of items to buy and where to sell them. It's also the place to get some special missions, like destroying a number of cars. Players can refuel, repair, and upgrade their truck at the garage.</p>"},{"name":"Big Mutha Truckers 2","year":2005,"developer":"Eutechnyx Limited","url":"PS2_COLLECTION_PART2/Big%20Mutha%20Truckers%202%20-%20Truck%20Me%20Harder%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":809123948,"score":6.1,"genres":"Racing / Driving > 1st-person > Behind view > Managerial / business simulation > Transport > Truck > Vehicle simulator","desc":"<p>The truckers return and this time you have to get Ma Jackson off the hook after being arrested for tax evasion. Bribe the jurors as you take the roll of Ma's cousin Jacob in a race to make money by trucking and trading.Drive and go almost everywhere at any time in a bigger environment than the original finding shortcuts and new towns to go trucking in. Trading is only a small part of the game and has been simplified to allow more time driving.</p>"},{"name":"Bigs 2, The","year":2009,"developer":"Blue Castle Games, Inc.","url":"sony_playstation2_b/Bigs%202%2C%20The%20%28USA%29.zip","filesize":1297114966,"score":"","genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p><em>The Bigs 2</em> is an arcade-oriented baseball game. During matches, the player takes the role of the active player, e.g. the batter, and tries to make a successful move. Successful actions fill up a power meter and when it is full, the player can unleash powerful abilities: Big Blast (an automatic home run when hitting the ball as batter) or Big Heat (a power pitch).</p><p>In contrast to the main console version, this version is more similar to the predecessor. The only change which has made its way into this version is the wheelhouse system which shows shows the high risk zones of each batter. Actually bringing a ball through these zones rewards a big hit to his overall effectiveness. The other additions like the Big Slam ability and new mini games are not present. The Become A Legend career mode is identical to the predecessor's Rookie Challenge.</p>"},{"name":"Bigs, The","year":2007,"developer":"Blue Castle Games, Inc.","url":"sony_playstation2_b/Bigs%2C%20The%20%28USA%29.zip","filesize":1139320846,"score":7.6,"genres":"Action > Simulation > Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p><em>The BIGS</em> is an arcade-style baseball game that is less focused on the intricate details of the game and more on the actual gameplay, proven by the inclusion of power-ups and turbos during gameplay. All 30 teams from MLB and their stadiums are included, as well as their player rosters. The Wii version of this game is controlled by flicking the Wii remote and Nunchuk. These motion controls include drumming the remote and nunchuk when trying to speed up and using the remote as a bat when hitting.</p><p>Instead of a traditional season mode as in many other baseball simulations, in <em>The BIGS</em> there is a mode titled Rookie Challenge, where the player creates a ballplayer and tries to lead him and his team to the World Series. Another mode, Home Run Pinball, puts a hitter in the middle of Times Square, New York, with the aim to hit balls into windows and neon lights.</p>"},{"name":"Biker Mice from Mars","year":2006,"developer":"Creat Studios, Inc.","url":"PS2_COLLECTION_PART2/Biker%20Mice%20from%20Mars%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":897939389,"score":"","genres":"Action > Racing / Driving > 3rd-person (Other) > Beat 'em up / brawler > Shooter > Motorcycle > Sci-fi / futuristic > Licensed","desc":"<p><em>Biker Mice from Mars</em> is a single player action game based on the <em>Biker Mice from Mars</em> cartoon. The Mice of Mars and the Catatonian empire fight a war on Mars for control of the planet. Either side is searching for a device that can turn the war in their favor. This device the Regenerator is located somewhere on Earth. Three mice have been send to earth to find the device and retrieve it and fight of the Catatonian under the leadership of General Hairball and Cataclysm. And billionaire Ronaldo Rump who apparently owns such a device.</p><p>The game offers 15 missions and three playable characters, these are: Throttle, Modo and Vinnie. There are race and brawler missions. In the race missions the player rides on his bike and can jump and use various items like turbo’s and weapons. While racing the player must shoot at enemies standing on the track. In the brawler mode the player has to beat up enemies in third person perspective.</p>"},{"name":"Bikini Beach: Stunt Racer","year":2003,"developer":"Davilex Games B.V."},{"name":"Billiards Xciting","year":2002,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART2/Billiards%20Xciting%20%28Europe%29.zip","filesize":31081424,"score":"","genres":"Sports > 1st-person > Top-down > Direct control > Pool / snooker","desc":"<p>Authentic 3D Billiards with Realistic Gameplay<br>Billiard Xciting delivers awesome gameplay, solid graphics and precision ball movement found in real pool – Billiards has never been this real! * 6 different games: Nine Ball, Eight Ball, Rotation, Basic, 14.1 Continuous and Bowliards * Story mode: Place bets and compete against 10 players in over 15 stages * Easy to use tutorial allows novice players to learn the rules * Includes vs. mode to play against others, and a Trick mode to play 30 challenging missions</p>"},{"name":"Billy the Wizard: Rocket Broomstick Racing","year":2006,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART2/Billy%20the%20Wizard%20-%20Rocket%20Broomstick%20Racing%20%28Europe%29.zip","filesize":61904651,"score":3.4,"genres":"Racing / Driving > Behind view > Flight / aviation > Fantasy","desc":"<p><em>Billy the Wizard: Rocket Broomstick Racing</em> involves Billy the Wizard having to race alongside other wizards in the broomstick Grand Prix. Opponents can be blasted out of the sky with magical powers. Players need to collect extra ammunition or power-ups while flying through the environment, dodging obstacles. There are three main sequences in the game: the racing, collecting spell books that have been escaped from the library and dragon chases where Billy and his friends hunt down a dragon to defeat it, while dealing with the minions.</p><p>There are 40 stages spread across five levels and the game also includes eight playable characters to choose from. There are six game modes in total, such as Orb Domination, two Grand Prix and Hoop Chase. Multiplayer is available for up to four players simultaneously.</p>"},{"name":"Biohazard: 5th Anniversary Special Package","year":2001,"developer":"Capcom Co., Ltd."},{"name":"Bionicle","year":2003,"developer":"Argonaut Games PLC","url":"PS2_COLLECTION_PART2/Bionicle%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CDa%29.zip","filesize":1427301140,"score":6.1,"genres":"Action > Behind view > Licensed","desc":"<p>Playing as the Toa, Toa Nuva, and finally the 7th Toa, you must explore the six elementally-themed regions of Mata Nui - a tropical paradise of high mountains, great lakes, and mighty volcanoes - rescue the scattered Matoran and break the spell of darkness sent by the evil Makuta. In doing so you will face danger in equal measure from the islands many environmental hazards (including falling rocks, rainforest winds, icicles, and lava falls) and the foul minions of Makuta. Choose any one of the six Toa characters to begin your adventure. Use the unique elemental powers of the Toa and summon blasts of elemental energy to defeat your enemies.</p>"},{"name":"Bionicle Heroes","year":2006,"developer":"Traveller's Tales (UK) Ltd.","url":"PS2_COLLECTION_PART2/Bionicle%20Heroes%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CDa%29.zip","filesize":1109717720,"score":6.4,"genres":"Action > Behind view > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Bionicle Heroes</em> is a third-person action game where the player takes on the role of the various Lego Bionicle Toa Inika - Jaller, Matoro, Hahli, Kongu, Hewkii, and Nuparu. These heroes wear Toa Masks of Power - power-ups that can be found throughout the levels to gain different elemental based abilities. There are also Bionicle canisters to aid the protagonists on their quest to defeat Vezon - the 7th Piraka who had stolen the Mask of Life.</p><p>The gameplay centers around firefights against the alien \"robots\" called Vahki, Visorak, and Bohrok. Players will collect Lego pieces for every enemy they defeat, and eventually enable an invulnerable Hero Mode to help defeat the Toa's enemies.</p>"},{"name":"Black","year":2006,"developer":"Criterion Software Ltd.","url":"PS2_COLLECTION_PART2/Black%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1988581960,"score":7.3,"genres":"Action > 1st-person > Shooter > Direct control > Contemporary","desc":"<p>Sgt. J. Keller is a Black Op and he has just failed his operation - badly. He has been incarcerated and is interrogated to reveal his mission and to find out what went wrong. The player goes through Keller's failed operation in eight areas, wasting enemy soldiers and trying to stay alive. There are primary and secondary objectives, such as reaching a rendezvous point and gathering intel.</p><p><em>Black</em> is a traditional first-person shooter with variety of weapons and interactive scenery - interactive meaning destructible in this case. Enemy soldiers can be killed by destroying a nearby fuel tank for example, and weak shelter, like a wooden fence, can be shot to pieces in order to expose the enemy.</p><p>The game can be played in four difficulty levels: easy, normal, hard, and black ops. In easy mode, only the primary objective is required. In normal and hard modes, some of the secondary objectives are required. In black ops mode - unlocked after completing the game on hard - all objectives must be reached. New weapons are also unlocked after finishing a level.</p>"},{"name":"Black & Bruised","year":2003,"developer":"Digital Fiction Inc.","url":"PS2_COLLECTION_PART2/Black%20%26%20Bruised%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2818599116,"score":6.9,"genres":"Action > Sports > 3rd-person (Other) > Fighting > Boxing","desc":"<p>Black &amp; Bruised is a cartoonish take on boxing with 18 different boxers, each with their own personality and fighting style.  There are five different modes including multi-player, exhibition, and a story mode told with CG with each boxer's life story is played out in story mode.  Each boxer has a different special attack and power-ups can be picked up to use in matches.  There are 30 different facial expressions for each boxer reacting to punches and misses giving them a life-like appearance.</p>"},{"name":"Black Market Bowling","year":2005,"developer":"Black Market Games","url":"sony_playstation2_b/Black%20Market%20Bowling%20%28Europe%2C%20Australia%29.zip","filesize":830015726,"score":"","genres":"Sports > Behind view > Bowling","desc":"<p>Take to the lanes with this exciting bowling game featuring a large and diverse cast of crazy personalities.  Whether you choose the brooding Ivan the Giant, the innocent-looking school girl Pearl, the sweet grandma Edna, or the too-cool Miles, you're sure to be up for a bowling challenge in the six diverse locations.</p><p>There are three different modes of play for single player mode: Challenge, which has you facing off against an amateur bowler, then a professional.  Beat the pro and you unlock that player!  Match Play takes you through a long ladder tournament, while Shootout pits you against two other opponents in each round.  In addition to this, you can play multiplayer with up to three of your friends.</p>"},{"name":"Black-Matrix II","year":2002,"developer":"Flight-Plan Inc.","url":"sony_playstation2_b/Black-Matrix%20II%20%28Japan%29.zip","filesize":219026892,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p>Rage was one of the four Great Generals of the Demon Army, but he was slain in a battle against the Angels. He has recently been revived, but has lost all memories of his previous life. With the war between Demons and Angels still continuing with no end in sight, he must restore his power and build his forces back up to strike back against the Angel Army.</p><p><em>Black/Matrix II</em> is a turn-based tactical strategy game similar in structure to Final Fantasy Tactics, and the sequel to Black/Matrix. Characters level up and learn abilities individually, and it is possible to recruit a variety of characters, though only 6 at a time can be deployed into a battle. There are also several different romantic interests to pursue, with multiple endings for each depending on the player's choices throughout the game.</p>"},{"name":"Blade II","year":2002,"developer":"Mucky Foot Productions Limited","url":"PS2_COLLECTION_PART2/Blade%20II%20%28Europe%29.zip","filesize":700613950,"score":5.6,"genres":"Action > Behind view > Horror > Licensed","desc":"<p>In an adaptation of the \"Blade II\" movie, you take on the role of the daywalker Blade in his quest to rid the world of vampires.  Using weapons such as a pistol, shotgun, or just wooden stakes, you must control Blade to fight through every level's exit to the ultimate confrontation.</p><p>Determined to stop the vampires, Blade battles through three huge campaigns: The Arcan Mountain Base, Lairs of Buron, and Karkov Tower. Using martial arts and weapons, you'll try to defeat vampires and collect glyphs without getting yourself killed. If you need help, request a tutorial from your friend, Whistler.</p>"},{"name":"Blazing Souls","year":2006,"developer":"Idea Factory Co., Ltd.","url":"sony_playstation2_b/Blazing%20Souls%20%28Japan%29.zip","filesize":1920829658,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > Turn-based > Tactical RPG > Fantasy","desc":"<p>Enter the world of Neverland, a war-weary world whose long-fought-for peace is being threatened by Human Genomes, a species created by a long-dead god to be the successors to humanity. Join Zelos, an amoral mercenary with a shadowy past and access to almost unlimited power, as he and a group of adventurers who insist on calling him a friend embark on an epic quest of redemption and salvation.<br><br>© 2010 IDEA FACTORY Licensed to and published by Aksys Games.<br><br>Purchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 portable systems that are associated with the purchasing account.</p>"},{"name":"Bleach: Blade Battlers 2nd","year":2007,"developer":"Racjin Co., Ltd.","url":"sony_playstation2_b/Bleach%20-%20Blade%20Battlers%202nd%20%28Japan%29.zip","filesize":1082301054,"score":"","genres":"Action > 3rd-person (Other) > Free-roaming camera > Anime / Manga > Fighting > Visual novel > Direct control > Fantasy > Japan (Ancient/Classical/Medieval) > Comedy","desc":"<p><em>Bleach: Blade Battlers 2nd</em> is the second 3D fighting game of the Blade Battlers series. It allows the player to fight against up to three enemies at the same time on an extensive, full 3D map. Each character has its own physical abilities, speed and damage. As the character damages or is damaged, a power bar grows, making it possible to use powers and transformations. With a diversified selection, the player can create his own battle approach, tactics and different fighting styles.</p><p>After the player completes different challenges, characters are unlocked. Up to 36 playable characters are available. Local multiplayer is also possible - the second player takes control of one of the three remaining characters, and fight in co-op or against the first player.</p>"},{"name":"Blitz: The League","year":2005,"developer":"Midway Games, Inc.","url":"sony_playstation2_b/Blitz%20-%20The%20League%20%28USA%29.zip","filesize":1401186645,"score":7.3,"genres":"Sports > Top-down > Quick Time Events (QTEs) > Football (American)","desc":"<p><em>Blitz: The League</em> is the first football game with no NFL license in many years - because EA signed an exclusive deal with the NFL, Midway developed one without the license. The game has 17 fantasy teams all with their own look and feel - from personalities to logos. </p><p>The game differentiates itself further from official games by giving the players an off-field presence, often involving sex, performance-enhancing drugs and violence. The game has input from the writer for Playmakers, the football-based soap opera the NFL forced ESPN to cancel.</p><p><em>Blitz: The League</em> has 8-man teams, and makes spectacular action-packed moves easier than in real life. Impressive moves boost your Clash meter, which allows you to pull off unrealistic moves, such as easier running due to Bullet Time, and some brutally tough defences tackles. If these tackles happen frequently enough the players will fight hockey-style, lunging into wild tackles. The team with the most tackles from this gains the Unleashed mode, which has even more gruesome moves, of a style the NFL would not allow to be associated with their product.</p><p>Additional features include multiplayer action with head-to-head online play and complete customization options of players, teams, stadiums and more. Lawrence Taylor appears as the poster boy.</p>"},{"name":"Blokus Club with Bumpy Trot","year":2005,"developer":"Irem Software Engineering, Inc.","url":"sony_playstation2_b/Blokus%20Club%20with%20Bumpy%20Trot%20%28Japan%29.zip","filesize":479383073,"score":"","genres":"Strategy > Top-down > Fixed / flip-screen > Anime / Manga > Turn-based > Board game > Licensed","desc":"<p><em>Blokus Club</em> is a digital version of the popular French board game Blokus featuring characters from the cult hit Steambot Chronicles. Both the four-player and two-player variations of the board game are included, with computer-controlled opponents of variable ability filling in any empty spots.</p><p>In addition to the standard modes, there is also Bumpy Trot Mode, which is a campaign mode for one player. The player moves their character around a board-game like world map with recognizable <em>Steambot Chronicles</em> landmarks. Different spaces may contain either a Blokus battle against other characters, shops where new outfits and hairstyles can be purchased, or simple hints and bonuses. Winning matches against the computer earns money to buy more items, and also unlocks additional items in an in-game gallery. Clearing the win conditions for all spaces on the board allows the player to move on to the next board, where greater winnings, tougher opponents, and new items can be found.</p>"},{"name":"Blood Will Tell: Tezuka Osamu's Dororo","year":2004,"developer":"SEGA Wow Inc.","url":"PS2_COLLECTION_PART2/Blood%20Will%20Tell%20-%20Tezuka%20Osamu%27s%20Dororo%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3086451546,"score":7.1,"genres":"Action > 3rd-person (Other) > Anime / Manga > Puzzle elements > Fantasy > Horror > Licensed","desc":"<p>Seduced by the power offered to him, a samurai allows harm to come to his infant son. The son, fated to destroy the 48 Fiends, has 48 body parts removed, one by each demon. The samurai sets the remains adrift along a river, where the still-living child is discovered by a kindly doctor. After raising the child, the doctor operates on him, replacing his missing parts with mechanical ones. Knowing the child's destiny, the doctor replaces his missing arms with sword arms, attaches a repeating rifle to one arm, and a cannon to one leg. The game begins with the now-adult Hyakkimaru beginning his quest to reclaim his body parts from the Fiends. Soon joined by the child-thief Dororo, the pair embark on a quest against ancient Japanese demons and the monsters they create.</p><p><em>Blood Will Tell</em> is an action game where the player controls Hyakkimaru, a man whose body parts were stolen by demons when he was a child. His destiny is to reclaim each of his body parts, which allow him to increase his stats such as HP and power, as well as optional special functions (for example, the eye displays the game in colour, while the vocal chords allow him to speak). Hyakkimaru wields a sword, which can be used to attack enemies - he can also swap for his two smaller swords concealed within his arms. As he uses the swords, they level up and increase in power. Hyakkimaru can also charge up a sword attack, and if released at the correct time, is given the opportunity to enter a series of button presses for combos. If the enemy is killed during this combo, the player can perform a finishing move with the Triangle button which can yield bonus items ranging from health items to swords.</p><p>Hyakkimaru is also outfitted with a repeating rifle and a cannon in his leg. While these are very powerful, they both require their own ammo and cannot be used without it. The gun can be fired rapidly at foes, while the cannon must be charged and aimed for a powerful shot. Both of these weapons have the advantage of being long-range weapons, unlike his swords which must be used at close quarters.</p><p>At a certain point in the game, Hyakkimaru meets the child thief, Dororo. Dororo often assists Hyakkimaru during combat, and can be issued commands, such as 'fight', 'evade', 'collect items' or 'search'. Sometimes the pair will split up, and Dororo will be playable on his own. These sections are more puzzle-based, with the thief pulling switches to activate puzzles, dodging traps, and stealing items. Dororo can throw rocks from a distance, and later gets smoke bombs which are more incapacitating.</p>"},{"name":"Blood+: One Night Kiss","year":2006,"developer":"Grasshopper Manufacture Inc.","url":"sony_playstation2_b/Blood%2B%20-%20One%20Night%20Kiss%20%28Japan%29.zip","filesize":1676400101,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Horror > Licensed","desc":"<p><em>One Night Kiss</em> is an action-adventure game based on the anime series <em>Blood+</em> created by Production I.G, set after episode 7 of the original series. The game is set in the fictional town of Shiki-Newtown, which has recently been terrorized by attacks from monstrous bat-like creatures called Chiropterans.</p><p>The player controls both the anime's main protagonist Saya Otonashi, a high-school girl who is capable of killing the Chiropterans, and Aoyama, a detective with the city police investigating the strange attacks. Saya wields a katana, while Aoyama uses guns as his weapon of choice. The player switches between the two characters automatically as the story proceeds.</p><p>Each character's chapters are divided into adventure parts and action parts. In adventure parts, the player walks around exploring, speaking with other characters, and looking for information. In action parts, the player must fight off the Chiropterans or other foes in closed-off arenas.</p>"},{"name":"Blood+: Souyoku no Battle Rondo","year":2006,"developer":"Sony Computer Entertainment Inc.","url":"sony_playstation2_b/Blood%2B%20-%20Souyoku%20no%20Battle%20Rondo%20%28Japan%29.zip","filesize":835438463,"score":"","genres":"Action > Adventure > 3rd-person (Other) > Anime / Manga > Beat 'em up / brawler > Japan (Modern/Futuristic)","desc":"<p>Player assumes a role of Saya Otonashi — an ordinary schoolgirl, who suffers from amnesia. Upon being attacked by a Chiropteran she learns that she's the only one who can defeat them. She engages in a journey with her family, allies, and her chevalier Haji, to defeat he Chiropterans and recover her identity.</p>"},{"name":"BloodRayne","year":2002,"developer":"Terminal Reality, Inc.","url":"PS2_COLLECTION_PART2/BloodRayne%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":1138900193,"score":6.8,"genres":"Action > Behind view > Direct control > Fantasy > World War II > Regional differences","desc":"<p>There are things in the world that humanity should not know about, and things it must be protected from. It is these things that the Brimstone Society hunts, and their newest agent for the cause is the half-vampire codenamed BloodRayne. Her mission will take her from clearing out the walking dead and man-sized insects in the swamps of Louisiana to hunting down members of the secretive Gegengheist Gruppe branch of the Nazi military around the world, as well as the monsters they unwittingly awakened.</p><p>Rayne's primary weapons against both monsters and men are the blades attached to her arms, and as the game progresses she will gain additional attacks to string together. Rayne can also hold many weapons, such as pistols, shotguns, and submachine guns, at once, but she is not overly attached to them and will discard any weapon that runs dry. Her enhanced vampiric strength even allows her to rip up mounted gun emplacements and fire them from the hip. Another vampiric strength is her ability to drain the blood out of any human she can grab in order to restore her health. By killing enemies Rayne's rage meter will fill, eventually allowing her to enter Blood Rage, slowing the world around her and gaining new combo attacks that can dismember or totally cut in half weaker opponents. Rayne's ability to perceive the world will grow as the game progresses as well, allowing her to see living things through walls, zoom in on distant targets, and speed up her perception that everything, herself included, appears to slow down.</p>"},{"name":"BloodRayne 2","year":2004,"developer":"Terminal Reality, Inc.","url":"PS2_COLLECTION_PART2/BloodRayne%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3535229839,"score":6.9,"genres":"Action > Behind view > Direct control > Fantasy > Regional differences","desc":"<p>Sequel to BloodRayne, <em>BloodRayne 2</em> follows Rayne into the modern day. No longer killing Nazis, she teams up again with the Brimstone Society to take out her Vampire Father and her various siblings. Rayne's new powers and abilities include rail sliding (among other acrobatics), blood guns, stop time, and tons of gruesome fatalities to dispatch her foes with.</p>"},{"name":"Bloody Roar 3","year":2001,"developer":"Raizing Co., Ltd.","url":"PS2_COLLECTION_PART2/Bloody%20Roar%203%20%28Europe%29.zip","filesize":577993746,"score":7,"genres":"Action > 3rd-person (Other) > Side view > Fighting","desc":"<p>The third edition of the beast transforming beat 'em up series includes 12 gameplay modes including the usual arcade, versus and practice along with survival (beat as many opponents as possible before dying) and 8 gameplay modes that can only be played once you unlock them.</p><p>The same gameplay style created in the 2 PlayStation versions continues here, where your character has the ability to morph into a beast during play to inflict more damage and combos on the enemy. However, each arena in the game now has breakable landscapes in the style of <em>Dead or Alive 2</em>, while the graphics have been improved greatly to use the available power of the PS2.</p>"},{"name":"Bloody Roar 4","year":2003,"developer":"Eighting Co., Ltd.","url":"PS2_COLLECTION_PART2/Bloody%20Roar%204%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1224380850,"score":6.2,"genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Fighting > Sci-fi / futuristic","desc":"<p>During the XGC (X-Genome Code) Incident one year ago, riots raged over the earth by beasts that did not show the XCG, and all over the country small earthquakes shook the land. The cause was unknown, but as the Crest Incident came to an end and the rioting and earthquakes subsided, people began to claim that all was due to the influence of the Stone Seal. Although the Stone Seal has been locked away, the rioting and earthquakes have returned. This time, the incidents are on a larger scale than those of a year ago. What could be behind it all?</p><p><em>Bloody Roar 4</em> is the last title in the series, and is once again a full-3D fighting game featuring the series' trademark transformation abilities. Unlike previous titles in the series, the beast gauge now acts as its own health bar; if a character's health gauge is depleted, they will automatically transform. The game features 18 playable fighters and a variety of game modes, including standard arcade, versus, time-attack, training, and survival modes. Of special mention is the career mode, in which fighting battles will earn so-called \"DNA points,\" which can be spent on abilities and equipment to customize a character for use in other modes.</p>"},{"name":"Blowout","year":2003,"developer":"KaosKontrol, Inc.","url":"PS2_COLLECTION_PART2/Blowout%20%28Europe%29.zip","filesize":212836743,"score":6.3,"genres":"Action > Side view > 2D scrolling > Sci-fi / futuristic","desc":"<p>Blowout is a game that takes a classic gameplay concept and updates it with modern graphics and sounds. This game is a side-scrolling platform shooter. The graphics are 3-dimensional polygons, but the action stays almost entirely in a 2-dimensional plane.</p><p>The setting for the game is a space station that has been overrun by hostile aliens. You play as a bad-ass soldier dude who will single-handedly wipe the aliens out.</p><p>You travel around each level in a non-linear fashion.  You have to fight your way through endless hordes to find keys, flip switches, use elevators, and then ultimately defeat a big boss at the end.</p>"},{"name":"BMX XXX","year":2002,"developer":"Z-Axis, Ltd.","url":"PS2_COLLECTION_PART2/BMX%20XXX%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29%20%28v1.01%29.zip","filesize":1264935867,"score":5.6,"genres":"Sports > Behind view > Tricks / stunts > Bike / bicycling > Adult","desc":"<p>Slightly unusual for a tricks/stunt game, BMX XXX adds a twist to its genre by employing themes involving foul language, nudity, and toilet humor.</p><p>The \"Hardcore Tour\" mode has you playing the levels, pulling off tricks and completing goals to unlock things such as new levels or stripper videos. The goals are of the odd variety, including things like collecting yellow snow for an ice cream man or gathering empty cans for a homeless guy. Also, have to watch out for a health bar that accounts for your injuries and can make you start over levels if you run out of it.</p><p>Do well enough in the game and you unlock a topless mode, where the riders are all.. well... </p><p>There's also a 'create-a-ride' mode, and a two-player split-screen option, with different games of its own. The game plays on Acclaim's own Dave Mirra series' engine.</p>"},{"name":"Board Games Gallery","year":2005,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART2/Board%20Games%20Gallery%20%28Europe%29.zip","filesize":47976774,"score":"","genres":"Strategy > Diagonal-down > Board game > Chess","desc":"<p><em>Board Games Gallery</em> is a collection of 10 classic board games:</p><ul><li>Reversi!</li><li>SnakesAlive!</li><li>Dyce!</li><li>Sea Battle</li><li>BackgammonPro</li><li>Chess Player</li><li>MegaCheckers</li><li>CatchUp!</li><li>SuperDoms</li><li>MasterMatch</li></ul>"},{"name":"Bob the Builder","year":2007,"developer":"Atomic Planet Entertainment Limited","url":"PS2_COLLECTION_PART2/Bob%20the%20Builder%20%28Europe%29%20%28En%2CDe%2CNl%29.zip","filesize":362143125,"score":"","genres":"Action > 3rd-person (Other) > Fixed / flip-screen > Persistent > Quick Time Events (QTEs) > Motion control > Europe > Licensed","desc":"<p><em>Bob the Builder</em> is a licensed PS2 game that uses characters and art from the popular UK children TV show 'Bob the Builder'.</p><p>The game was released bundled with the Eye Toy and it is central to game play. In between clips from the tv show the player hits on screen buttons via the motion control to play. For example hitting left right or jump to navigate an ATV down a country road. Cleaning the vehicles by waving your arms over their on screen position, and nailing sawing and drilling by similar methods.</p>"},{"name":"Bob the Builder: Festival of Fun","year":2007,"developer":"Atomic Planet Entertainment Limited","url":"PS2_COLLECTION_PART2/Bob%20the%20Builder%20-%20Festival%20of%20Fun%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":480083232,"score":"","genres":"Action > 1st-person > Mini-games > Motion control > Contemporary > Licensed","desc":"<p>It's a very special day in Sunflower Valley! Can you help Bob and the Can-Do Crew get the summer festival started? Yes, you can!<br>Use the unique Wii™ technology to help your favourite characters pick up rubbish, blow away leaves and mix cement in preparation for the big event!<br>All the characters from the Bob the Builder™ series including Dizzy, Spud, Pilchard, Lofty and of course Bob the Builder™ himself!<br>Many hands make light work! All ages can play together in the exciting Co-Operative mode.</p>"},{"name":"Boboboubo Boubobo - Hajike Matsuri","year":2003,"developer":"Hudson Soft Company, Ltd.","url":"sony_playstation2_b/Boboboubo%20Boubobo%20-%20Hajike%20Matsuri%20%28Japan%29.zip","filesize":944300094,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Martial arts > Licensed","desc":"<p>In the year 300X, the evil Maruhage Empire has taken over the world, and Emperor Tsuru-tsurina IV wants only one thing...</p><p>SHAVE THE WORLD BALD!!!</p><p>As the deadly Hair Snatcher Army wreaks havoc upon the world and hair everywhere, a hero must rise to stop the mad plans of Tsuru-tsurina IV...</p><p>That man is BoBoBo~Bo Bo~BoBo, defender of hair and wielder of the deadly art of True Fist of the Nose Hair!!</p><p>Join Bo~BoBo and his friends Beauty, Don Pachi, Softon, and Heppokomaru as they battle the Hair Snatcher Army and keep hair everywhere safe from evil!</p><p>This game is based on the manga by Yoshio Sawai.</p>"},{"name":"Bode Miller Alpine Skiing","year":2005,"developer":"49Games GmbH","url":"sony_playstation2_b/Bode%20Miller%20Alpine%20Skiing%20%28USA%29.zip","filesize":227982420,"score":7.5,"genres":"Sports > 1st-person > 3rd-person (Other) > Snowboarding / skiing > Licensed","desc":"<p><em>RTL Ski Alpin 2006</em> is a winter sports game with some RPG elements. It is possible to start a career as a skiing star or as a manager. One of the highlights of the game is that you can also play US ski superstar Bode Miller.</p><p>The most important part of the game is the extensive career mode. The player has to to start with an inexperienced but talented skiing amateur. After playing through a number of junior cups it is the aim to develop in a racer able to compete in World cup races. Through some RPG elements it is possible to improve a number of abilities. These improvements can be felt on the track. It is also vital to do the negotiations with sponsors and you can also do some betting against other racers.</p><p>The game features 32 tracks on 18 locations, different difficulty levels and over 900 voiced lines of commentary.</p>"},{"name":"Boku no Natsuyasumi 2: Umi no Bouken-hen","year":2002,"developer":"Millennium Kitchen Co., Ltd.","url":"sony_playstation2_b/Boku%20no%20Natsuyasumi%202%20-%20Umi%20no%20Bouken-hen%20%28Japan%29.zip","filesize":1696133750,"score":"","genres":"Simulation > 3rd-person (Other) > Cinematic camera > Fixed / flip-screen > Real-time > Life / social simulation > Sandbox / open world > Direct control > Bike / bicycling > Contemporary > Japan (Modern/Futuristic)","desc":"<p><em>Boku no Natsuyasumi 2: Umi no Bouken-hen</em> is the sequel to Boku no Natsuyasumi and has a similar concept. The nine-year-old city boy Boku once again spends his summer vacation in the countryside in 1975. It is a alternate universe sequel where the character spends his vacation with his family in a different location, but still meets many characters from the first game. The sequel is set in a Japanese southern coastal town on the tropical Izu Peninsula where his aunt and uncle have a bed and breakfast.</p><p>The game consists of fixed screen, pre-rendered environments with 3D models and a cinematic camera with a different viewpoint for each scene. Boku's vacation only lasts 31 days, but the player is free to choose how to spend his time as it is presented as a sandbox environment. It is possible to seek quests and help the people in town to solve their problems, but he can also choose to ride his bike anywhere, go bughunting, spend time fishing, dive into the ocean, launch a rocket, go on walk, play hide and seek, or play a mini-game of beetle wrestling. Many scenes offer interaction for the sake of exploration, with no further purpose. Time advances when a new scene is entered, so it is not possible to complete all content in a single playthrough.</p>"},{"name":"Bokura no Kazoku","year":2005,"developer":"Millennium Kitchen Co., Ltd.","url":"sony_playstation2_b/Bokura%20no%20Kazoku%20-%20My%20Family%20Growing%20Up%20in%20the%2021st%20Century%20%28Japan%29.zip","filesize":1911401438,"score":"","genres":"Simulation > 3rd-person (Other) > Fixed / flip-screen > Life / social simulation > Sandbox / open world > Direct control > Menu structures > Contemporary > Japan (Modern/Futuristic)","desc":"<p><em>Bokura no Kazoku</em> is a life simulation game where you see the evolution of a family during 35 years. The player follows the lives of a a newlywed couple in their 30s living in Koenji, the residential district of Tokyo. The game starts at the moment the couple has their first child and focuses on family life, especially raising children.</p><p>The game consists of fixed screen, pre-rendered environments with 3D models and a cinematic camera with a different viewpoint for each scene similar to the Boku no Natsuyasumi series by the same developer. Aside from the direct control there are many menu structures involved as the choices influence the different statistics for the children and decide how they grow up based on choosing a hobby, which school to go to and where to work. The family also needs to decide how to spend their money and those choices influence the childrens' development as well. It is not a complete sandbox simulation as the main traits of the children are determined and they all eventually find love and build their own family.</p><p>The game is meant to be played with multiple playthroughs and one of three scenarios can be chosen at the start of the game. Each scenario has a different number of kids and the third one has eight in total: four boys (Mokku, Genkotsu, Jiji and Pantsu) and four girls (Kyoro, Puu, Cocco and Nya).</p>"},{"name":"Bolt","year":2008,"developer":"Avalanche Software LLC"},{"name":"Bombastic","year":2003,"developer":"Shift Inc.","url":"PS2_COLLECTION_PART3/Bombastic%20%28Europe%29.zip","filesize":515885058,"score":7.4,"genres":"Action > Puzzle > Diagonal-down > Real-time","desc":"<p><em>Bombastic</em>, the sequel to Devil Dice, is a puzzle game where you attempt to clear a field of explosive dice. To set the dice off, you must roll the top face of the die you're standing on next to the same number of interconnected die with the same face (i.e. connect five 5's, four 4's). After a set period of time, the dice will explode, igniting any dice that the explosion touches that either match the number, or are one lower. This game is very fast-paced - you have to keep moving, because if you're on top of an exploding die, you get knocked out and you lose the game.</p><p>There are several modes of play in <em>Bombastic</em> - Trial Mode, where you try to clear 100 levels; Story Mode, where you progress through stages trying to solve preset puzzles and fight bosses, and Battle Mode, where you fight against four opponents and try to stay alive as long as you can. In addition to the standard Bombastic mode, you can also unlock classic Devil Dice mode, where the dice sink into the ground instead of exploding.</p>"},{"name":"Bomberman Hardball","year":2004,"developer":"Magical Company Ltd.","url":"PS2_COLLECTION_PART3/Bomberman%20Hardball%20%28Europe%29.zip","filesize":277128358,"score":"","genres":"Action > Sports > Behind view > Top-down > Arcade > Direct control > Baseball > Golf > Tennis > Sci-fi / futuristic","desc":"<p><em>Bomberman Hardball</em> is an action game with four different game modes: Arena, Tennis, Golf and Baseball. The three sports games tend towards the \"fun-sport\" category (relatively simple controls and physics), but are still grounded in the real rule set: there are no power-ups or special moves. The controls of all three sports follow the genre standards: in Tennis, the player walks towards the ball and hits it, Golf has the standard two-click controls and in Baseball the control switches between pitching (selecting a pitch type and aim) and batting (aiming the hit). All three modes feature either exhibition or tournament play; a few Bomberman characters with different abilities and other playing options, e.g. in Tennis the player can choose between single/double and different courts.</p><p>Arena has the standard <em>Bomberman</em> gameplay: multiple characters walk around in overhead maps and lay bombs in order to kill the competition. Bombing away destructible blocks may reveal power-ups which have positive (e.g. laying more bombs at once or higher walking speed) or negative (e.g. negating the positive power-ups) effects when picked up. Besides the classic deathmatch, there are also a few other game modes available: star battle (collecting stars), crown battle (the winner needs to find and pick up the crown) and point battle. Each match can also be customized, e.g. handicap, number of power-ups or time limit.</p><p>The Living Mode allows to create a custom character with unlockable outfits and view AI controlled matches. Except Baseball (restricted to two players), up to four players can participate in matches.</p>"},{"name":"Bomberman Jetters","year":2002,"developer":"Hudson Soft Company, Ltd.","url":"sony_playstation2_b/Bomberman%20Jetters%20%28Japan%29.zip","filesize":732944236,"score":7.2,"genres":"Action > Top-down > 2D scrolling > Platform > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>Bomberman is back in his second game for the Nintendo Gamecube. Jetters features a single-player campaign and the fan-favorite multiplayer battles. In the single-player game, players take on the roles of Bomberman and Max. Your goal is to stop the Hige Hige Bandits who plan to destroy Planet Bomber by crashing an artificial comet, Dark Star, into it. In this platforming quest, you will be aided by your use of bombs, and by Charaboms, creatures that you find that have their own special abilities that will help you progress through the game. After feeding a Charabom it will evolve, which will then make it more powerful. There are many types of Bombs and Charaboms to find throughout the single-player adventure.</p><p>Jetters also contains the classic Bomberman 4-player battles in which you and up to 3 friends basically blast each other with bombs until only 1 Bomberman remains. There is a revenge feature that keeps you in the action even after you lose. If you get blown up by a bomb, you appear on the exterior of the arena and can shoot bombs at players in the game, making sure that you can always be a part of the action.</p><p>There are 8 main battle arenas and many different types of multi-player battles. Bomberman Jetters was also originally released as a budget title for only $19.99, which made it less than half the price of most games when they first come out.</p>"},{"name":"Bomberman Kart","year":2001,"developer":"Racjin Co., Ltd.","url":"PS2_COLLECTION_PART3/Bomberman%20Kart%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":247455719,"score":"","genres":"Action > Racing / Driving > Behind view > Track racing > Fantasy","desc":"<p><em>Bomberman Kart</em> is a 3D kart racing game staring characters from the Bomberman series and offering over sixteen courses to race on. Besides the racing there is also a normal Bomberman mode.</p><p>The racing is similar to Mario Kart and also has items on the track to help the player. This Kart World mode offers the following modes: Grandprix, Time attack, Speed race, Battle race, Challenge game and Random challenges. In the Bomberman mode the player can choose from Single battle, Tag battle and Tandem battle.</p>"},{"name":"Bomberman Land 2","year":2003,"developer":"Racjin Co., Ltd.","url":"sony_playstation2_b/Bomberman%20Land%202%20-%20Game%20Shijou%20Saidai%20no%20Theme%20Park%20%28Japan%29.zip","filesize":368094142,"score":"","genres":"Puzzle > Racing / Driving > Role-playing (RPG) > Mini-games > Direct control > Sci-fi / futuristic","desc":"<p><em>Bomberman Land 2</em> is a sequel to Bomberman Land. Bomberman and his gang are invited to an all-new Bomberman Land theme park. It's up to you to collect all of the 125 Bompad pieces and also play some fun mini-games.</p><p>There are 5 modes. Survival Bomberman is an action RPG mode where you protect your small people from evil monsters. Bomberman Kart is a racing mode. Bomberman Battle is when you battle up to 4 people and blast each other with bombs. SameGame is a tile-matching puzzle game. Panic Bomber is a puzzle mode of up to 4 people. You could also read 4-panel comics, listen to music, and download 10 mini-games to your GameBoy Advance with the GameCube to GameBoy Advance Link Cable.</p>"},{"name":"Bomberman Land 3","year":2005,"developer":"Racjin Co., Ltd.","url":"sony_playstation2_b/Bomberman%20Land%203%20%28Japan%29.zip","filesize":590974014,"score":"","genres":"Action > 3rd-person (Other) > Diagonal-down > Mini-games > Direct control > Fantasy","desc":"<p><em>Bomberman Land 3</em> is a spin-off of the popular <em>Bomberman</em> series. Collect various zone pieces by beating mini-games in order to open up other zones and progress through the theme park. It is the first game in the <em>Bomberman Land</em> series to use 3D graphics.</p>"},{"name":"Bomberman Land Series: Bomberman Kart DX","year":2004,"developer":"Racjin Co., Ltd.","url":"sony_playstation2_b/Bomberman%20Kart%20DX%20%28Japan%29.zip","filesize":158084725,"score":"","genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Track racing > Vehicular combat","desc":"<p>Bomberman gets out of the maze to go racing in a kart. Like Mario Kart players get to race around on the wild tracks while attacking the other racers, pick-up bonus items along the way, and use those speed boosts to launch you past the other guys. Choose from a variety of different karts and characters.</p>"},{"name":"Boogie","year":2007,"developer":"Electronic Arts Montreal","url":"PS2_COLLECTION_PART3/Boogie%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.zip","filesize":674769013,"score":5.6,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Boogie</em> is a dance and Karaoke game. Unlike most similar games, which use special pads to control the dancing, the Wii version makes use of the Wii remote. The nunchuck can also be used to control the facial expressions in Strike-a-pose sequences, but is not required. For karaoke, Boogie includes a USB microphone. Each song can be played as a dance or a karaoke game. Players either match the rhythm and pitch, or match the song's beats to dance. Variation and combos are encouraged, as too many similar moves will lower the score. By performing well in the dances, a Boogie meter is filled. When full the player can execute a special move. While dancing, bonus items appear such as multipliers, tokens and meter boosts.</p><p>The game features a story mode centered around an intergalactic singing and dancing competition. There are five different characters, each with a unique story. For all other modes of play, players can create custom avatars based upon the five base characters, with a chapter in the story mode for each of them. Token collected during gameplay can be traded in for new songs, stages and outfits. There is also a mode where players can manipulate the camera to record their own music videos.</p>"},{"name":"Bouncer, The","year":2000,"developer":"Dream Factory Co., Ltd.","url":"PS2_COLLECTION_PART3/Bouncer%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2240106569,"score":6.4,"genres":"Action > Behind view > Anime / Manga > RPG elements > Direct control > Sci-fi / futuristic","desc":"<p>You play one of three bouncers of the bar Fate; Sion, Kou.  Dominique, a young girl, bar mascot and friend of Sion has been kidnapped by Mikado Special Forces.  You battle your way in an attempt to rescue Dominique.</p><p>Very much modeled on an interactive action film, you really do \"Play the Movie\".  Mostly a straight action fighter game, there are a few RPG twists thrown in as you can learn new moves and increase your life, power and defense.  Since the trio battles together you can choose which character to control at the beginning of each new battle.</p>"},{"name":"Bowling Xciting","year":2003,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART3/Bowling%20Xciting%20%28Europe%29.zip","filesize":53685198,"score":"","genres":"Sports > Behind view > Direct control > Bowling","desc":"<p>Line them up and knock'em down!<br>Ok pin jockeys, lace up your shoes and shine you ball its time to mix it up with Bowling Xciting. With three game modes and up to four players Bowling Xciting will have you on the lane for hours. Choose from 6 full 3D characters to wipe to competition away with. Even a novice bowler can become a master of the sport in no time with the in game tutorial.</p>"},{"name":"Boxing Champions","year":2002,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART3/Boxing%20Champions%20%28Europe%29.zip","filesize":138279589,"score":"","genres":"Sports > 3rd-person (Other) > Fighting > Boxing","desc":"<p>Next to various fighting games for the <em>PS2</em> there is this one from the Japanese Simple Series also released in Europe. As the title reveals <em>Boxing Champions</em> is a pure boxing game comparable to games like Knockout Kings 2002 but with a strong arcade emphasis. The player can enter the tournament and the survival mode on his own or choose to test the fighting abilities against a friend in a versus mode. A practice mode allows to exercise before entering a true match. Nine fictitious boxers with a variety of attributes are available at the beginning and there are two more to unlock. Furthermore, three different categories of boxers do exist: Flyweight, welterweight and heavyweight. A match takes up to 12 rounds with three minutes each.During a match the two meters indicate health and the ability to keep standing.</p>"},{"name":"Bratz Forever Diamondz","year":2006,"developer":"Coyote Developments Ltd","url":"PS2_COLLECTION_PART3/Bratz%20-%20Forever%20Diamondz%20%28Europe%2C%20Australia%29%20%28En%2CEs%2CIt%29.zip","filesize":1252254543,"score":"","genres":"Action > 3rd-person (Other) > Behind view > Life / social simulation > North America > Licensed","desc":"<p><em>Bratz: Forever Diamondz</em> is a 3D game staring the Bratz girls, based on the 2006 direct-to-DVD film of the same name. The girls from Bratz magazine (Cloe, Jade, Sasha, and Yasmin) compete in a contest across the United States against the girls from Your Thing Magazine (Burdine, Kirstee and Kaycee) to find an undiscovered teen fashion designer for the 'America Rocks Fashion' TV show competition. The winner of the competition will then receive a contract with a famous fashion designer and a pair of go-go boots covered with diamonds. </p><p>In the game you take control of one of the Bratz girls while exploring the towns you visit while searching for the teen designer. During the game, you switch between the girls and can customize their clothes, jewelry and makeup. The player will participate in photoshoots, ice skating and can adopt a pet.</p>"},{"name":"Bratz Girlz Really Rock","year":2008,"developer":"Blitz Games Ltd","url":"PS2_COLLECTION_PART3/Bratz%20-%20Girlz%20Really%20Rock%20%28Europe%29%20%28En%2CSv%2CNo%2CDa%29.zip","filesize":2317407706,"score":"","genres":"Action > Simulation > 3rd-person (Other) > Behind view > Life / social simulation > Mini-games > Music / rhythm > Timed input > Snowboarding / skiing > Licensed","desc":"<p>The Video Game with Serious Style!<br>This is your chance to be a superstar! Practice lead guitar, keyboard, or dance and rock out live on stage. Check out the Fashion Designer Suite to create wicked outfits, apply killer make-up and try out some fabulous hairstyles. Take five and catch some air skydiving, or hit the mini-golf course in single or multiplayer modes.</p>"},{"name":"Bratz Rock Angelz","year":2005,"developer":"Blitz Games Ltd","url":"PS2_COLLECTION_PART3/Bratz%20-%20Rock%20Angelz%20%28Europe%2C%20Australia%29.zip","filesize":834008082,"score":6.5,"genres":"Action > 3rd-person (Other) > Behind view > Mini-games > Licensed","desc":"<p>Join the four Bratz on an adventure to create their very own fashion magazine.<br><br>If you're a fan of the Bratz, Bratz Rock Angelz will be right up your catwalk! Explore your \"passion for fashion\" in a unique interactive adventure game. You'll be immersed in the Bratz World as the girls embark on a series of voyages in search of intriguing stories that will provide inspiration for their very own fashion magazine.* Play as any of the four Bratz Girls while exploring different adventures<br><br>Customise all of the Bratz girls' hair, make-up, and outfits as you shop for the latest fashions<br>Chat face-to-face with the Bratz characters in their own world</p>"},{"name":"Bratz The Movie","year":2007,"developer":"Blitz Games Ltd","url":"PS2_COLLECTION_PART3/Bratz%20-%20The%20Movie%20%28Europe%29%20%28En%2CFr%29.zip","filesize":1741648028,"score":"","genres":"Simulation > Behind view > Life / social simulation > Music / rhythm > Timed input > Licensed","desc":"<p>It’s time for the Bratz girls to hit the red carpet!<br><br>Join Cloe, Jade, Sasha and Yasmin as they rock out in explosive music shows, strut the fashion runway with stylin’ outfits designed by you, and dish out the hottest magazine ever! Their hard work lands them a once in a lifetime opportunity to star in their very own movie! Share their experience in the glitz and glamour of becoming real movie stars!<br><br>* Use the Wii remote to strum guitar strings and take photos.<br>* Learn the hottest Bratz songs to perform in shows.<br>* Enhanced pet features: swap pets at anytime, find out your pet’s mood, and collect different pet palaces for your pampered pet to live in.<br>* Huge array of all-new hair styles, clothing lines, make-up, and accessories to choose from.<br>* Play as all four Bratz girls (Cloe, Jade, Sasha, and Yasmin) and experience character-specific adventures.<br>* Relive favorite episodes from the Bratz TV series.</p>"},{"name":"Brave: The Search for Spirit Dancer","year":2005,"developer":"VIS Entertainment Limited","url":"sony_playstation2_b/Brave%20-%20The%20Search%20for%20Spirit%20Dancer%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2015926131,"score":6.2,"genres":"Action > Behind view > Platform > Direct control > Fantasy > Pre-Columbian Americas","desc":"<p>Brave is a young native American boy who lives in the forest. As he wants to become a warrior, the elderly shaman Grey Bear prepares an adventure and hides carvings that will grant him new skills. During the search, however, the village is brutally attacked by the demonic creature Wendigo. Brave is the only one who can defeat it, but in order to do that, he has to track the path of the mysterious shaman Spirit Dancer, discover his past, and find the means to defeat the evil force.</p><p>Brave is a 3D third-person platformer with puzzles. Set in worlds with different themes (ice world, volcanic world, wastelands, forest...), Brave can roam freely, but certain parts are only opened up after solving quests. The boy can jump, duck, climb, and do basic attack moves. While observing, for certain actions, and when using ranged weapons, a first-person view is available as well. During the adventure, Brave acquires new abilities, which allow him to track creatures by smell or their tracks, mimic animals' sounds to lure or distract them, summon creatures, or invoke shaman powers to become an animal (an eagle, a bear, a rabbit and even a skunk). Health is acquired by killing animals or destroying vegetation. Brave can also collect up to five eagle feathers, which allow him to stock up on shaman power that provides superior strength for a short time.</p><p>The exploration gameplay has been mixed with action sequences, where you canoe down river rapids, or ride on a buffalo or an eagle while fighting. There is a strong emphasis on movement and platform-jumping, and there is an adjustable difficulty level, reflected in the amount of hints Grey Bear provides through a \"mobile stone\". Next to the abilities, there are different weapons to be found, such as spears, tomahawks and bows. Additionally, Brave can search for secret totems that open up concept art in the menu.</p>"},{"name":"Bravo Music (Christmas Edition)","year":2001,"developer":"Desert Productions Inc.","url":"sony_playstation2_b/Bravo%20Music%20-%20Christmas%20Edition%20%28Japan%29.zip","filesize":223837449,"score":"","genres":"Action > Music / rhythm","desc":"<p>This game is a Christmas-themed special edition release of Bravo Music (known in the US as Mad Maestro!), featuring special holiday-themed music.</p>"},{"name":"Breath of Fire: Dragon Quarter","year":2002,"developer":"Capcom Co., Ltd.","url":"PS2_COLLECTION_PART3/Breath%20of%20Fire%20-%20Dragon%20Quarter%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1502323255,"score":7.5,"genres":"Role-playing (RPG) > 3rd-person (Other) > Cinematic camera > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Steampunk > Regional differences","desc":"<p>The world is called Deep Earth. The world is a huge underground complex of cities and labyrinths. The world is populated by people who have never seen the sky and the sun in their lives. The world is dark and hostile, and knows no mercy. Technology is well developed in this world, but the society is ruled by a cruel law, dividing all the citizens into classes, depending on the their D-ratio - a form of identifying people and assigning to them a social status at the same time. This is the reality of mankind somewhere in a fantasy universe, which the hero Ryu is thrown into. </p><p>Ryu is a simple guard, a ranger with a low D-ratio - his job is to help to protect the citizens from genics - artificial monsters who have gone wild. During one such routine patrol Ryu runs into a mysterious silent girl named Nina, and saves her from a monster. Willing to protect her, Ryu discovers in himself a devastating power. He is now determined to do something for the people of Deep Earth, and perhaps even guide them to the surface of the planet.</p><p><em>Breath of Fire V: Dragon Quarter</em> is a radical departure from the previous titles of the <em>Breath of Fire</em> series, and in some ways from standard Japanese-style role-playing games in general. The game is built like a huge dungeon crawler, with no overworld map. The combat is tactical: each character has action points (AP), which can be used to move around the screen during an enemy encounter, and perform a variety of combo attacks. There is no magic in the game, and many of the items found in dungeons are random. All the enemies are visible on screen. Depending on who first initiated a physical contact, the party or the enemies get an extra turn in battles. </p><p>The game allows (and even encourages) the player to restart it from the beginning, keeping the items and the party experience. The game also features a special counter - Ryu can use his traditional dragon transformation abilities, but the counter raises with each such transformation, and when the counter reaches 100, the game is over. Raising the D-ratio allows characters to access new areas every time the game is replayed.</p>"},{"name":"Breeders' Cup World Thoroughbred Championships","year":2005,"developer":"4J Studios Ltd.","url":"sony_playstation2_b/Breeders%27%20Cup%20-%20World%20Thoroughbred%20Championships%20%28USA%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":1822466766,"score":5.8,"genres":"Sports > Horse / derby > Licensed","desc":"<p><em>Breeders' Cup World Thoroughbred Championships</em> is a realistic horse racing simulator where players can bet and race horses in real Breeder's Cup events. You can compete in North America's premier events such as Del Mar, Belmont Park and Keeneland along with many others, leading up to the most prestige event, the Breeders' Cup.</p><p>Choose from thousands of horses to own and breed to create the ultimate champion or place bets with the most sophisticated betting system used by professional handicappers. Choose to start a career or choose a quick race to play against the computer or go head to head with a buddy, you can choose to go to an event just to bet or even choose Race a Legend to take on real Breeder's Cup winners including the legendary Seabiscuit. </p><p>The game is officially licensed by the NTRA (National Throughobred Racing Association) and features the voice of Breeder's Cup announcer Tom Durkin.</p>"},{"name":"Brian Lara International Cricket 2005","year":2005,"developer":"Swordfish Studios Limited","url":"PS2_COLLECTION_PART3/Brian%20Lara%20International%20Cricket%202005%20%28Europe%29.zip","filesize":2320285126,"score":7.5,"genres":"Sports > Diagonal-down > 2D scrolling > Cricket > Licensed","desc":"<p>The legend of cricket makes a welcome come back after years of absence and does it with style. Take part in a World Tour, tournaments and a Challenge mode where you can relive some classic cricketing moments (the graphics even go black and white) like the first Ashes match where England lost back in 1882.Simple controls make the game as pick up and play as you could possibly want so you don't need to be a cricket genius to enjoy the game or understand what's going on.</p>"},{"name":"Brian Lara International Cricket 2007","year":2007,"developer":"The Codemasters Software Company Limited","url":"PS2_COLLECTION_PART3/Brian%20Lara%20International%20Cricket%202007%20%28Europe%29.zip","filesize":2345905989,"score":7.2,"genres":"Sports > Behind view > Diagonal-down > Cricket > Licensed","desc":"<p>This entry into the Brian Lara/Ricky Ponting Cricket series features all the teams and venues of the 2007 Cricket World Cup, as well as the Champions Trophy one-day event, fast-paced Twenty20 matches, and full-length 5-day Test matches. Player names outside those tournaments are fictional.</p><p>There are more bowling styles, including increased reverse swing as the ball ages. Reflex catches from slips, extra run-outs and stumpings are added to the fielding. Batting now includes realistic modeling of shots off the edges of the bat, and a graceful sweep shot. Computer AI plays a more attacking arcade-like game.</p><p>Gameplay is offline or online tournaments (on PC and XBox 360, a first for a cricket game) with up to 16 players. Players can create their own dream team of the world's best cricketers, or try one of the new tutorials to build up cricketing knowledge. A roving team of five commentators cover the various matches.</p>"},{"name":"Britney's Dance Beat","year":2002,"developer":"Hyperspace Cowgirls","url":"PS2_COLLECTION_PART3/Britney%27s%20Dance%20Beat%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":4322222919,"score":5.4,"genres":"Action > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p>Britney Spears is holding dance auditions for her next concert.  Choose from a variety of dancers and go compete to win a spot as Britney's own dancers.  Play with some of her hits such as: Oops, I Did It Again, Baby One More Time,  I'm A Slave 4 U, and more.  You go head to head against other dancers.  Successful combos result in an attack against your opponent.  Gameplay is set on a radar type object that spins clockwise.  Buttons will appear and you have to time it and press it when the radar passes through it.  Gameplay on the Windows version differs quite a bit.  It is more like DDR where arrows will scroll up and you have to press them when they reach the top.  Unlock music videos and concert footage.</p>"},{"name":"Broken Sword: The Sleeping Dragon","year":2003,"developer":"Revolution Software Ltd.","url":"PS2_COLLECTION_PART3/Broken%20Sword%20-%20The%20Sleeping%20Dragon%20%28Europe%2C%20Australia%29%20%28En%2CEs%2CIt%29.zip","filesize":2777847878,"score":7.8,"genres":"Adventure > 3rd-person (Other) > Cinematic camera > Graphic adventure > Puzzle elements > Quick Time Events (QTEs) > Africa > Europe > Fantasy > Detective / mystery","desc":"<p>No less than six years have gone by before the third installment in the Broken Sword series saw the light of day. The first two games (The Shadow of the Templars and The Smoking Mirror) delved into the Knights Templar and Mayan mythology. This time, George Stobbart and Nico Collard are after the Voynich Manuscript to unravel its mysteries.</p><p><em>The Sleeping Dragon</em> moves away from the 2D point-and-click concept from the earlier games and features a full 3D world, with a camera that does not rotate, but uses fixed cinematic perspectives, combined with full 5.1 sound. For the Windows version the game is no longer controlled through the mouse, but now through the keyboard, for the movement of the characters as well as all the actions. The player alternately controls George or Nico. Next to typical adventure gameplay such as exploration, conversations, and searching and combining items, there are also a few action sequences. The characters can duck, sneak, hang from ledges and move crates to reach higher areas.</p><p>The locations visited throughout the game include The Congo, Paris, England, Czech Republic and Egypt.</p>"},{"name":"Brothers in Arms: Earned in Blood","year":2005,"developer":"Gearbox Software LLC","url":"PS2_COLLECTION_PART3/Brothers%20in%20Arms%20-%20Earned%20in%20Blood%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2604384284,"score":7.9,"genres":"Action > 1st-person > Shooter > Direct control > Historical events > World War II","desc":"<p>Barely seven months after the release of Brothers in Arms: Road to Hill 30, Gearbox brings us the sequel.</p><p>Brothers in Arms: Earned in Blood tells the story of Corporal Joe \"Red\" Hartsock as one of the thousands of paratroopers who landed in Normandy, France, on the eve of D-Day. Hartsock made an appearance in the previous game and now we get to see the events from his point of view, based on actual events and persons.</p><p>Though the game engine remains largely unchanged, the A.I. has been significantly improved to offer a more challenging experience as the player tries to advance through the treacherous area known as the Bocage. The player fights in first person as Hartsock but also commands either two fireteams or a fireteam and a tank as using cover and suppression fire is critical to success.</p><p>The game also offers an interesting multiplayer mode with the rare single-mission co-op option available for the PC, as well as skirmish maps and other mods such as \"Defense\".</p>"},{"name":"Brothers in Arms: Road to Hill 30","year":2005,"developer":"Gearbox Software LLC","url":"sony_playstation2_b/Brothers%20in%20Arms%20-%20Road%20to%20Hill%2030%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3219179419,"score":8,"genres":"Action > Strategy > 1st-person > Behind view > Shooter > Direct control > Historical events > World War II > Licensed","desc":"<p>Brothers in Arms, one of the few games to truly be based on actual events, places you in the shoes of real-life World War II Sergeant Matt Baker, tasked with commanding your squad through a week's worth of actual battles that Baker's 101st Airborne platoon faced. Combining the cinematic action of games such as Medal of Honor and Call of Duty with the strategic command of Full Spectrum Warrior, you must command your troops to use actual army doctrine to find, fix, flank, and finish the enemy while actually participating in the battle yourself.</p>"},{"name":"Brunswick Pro Bowling","year":2007,"developer":"FarSight Technologies Inc.","url":"PS2_COLLECTION_PART3/Brunswick%20Pro%20Bowling%20%28Europe%29.zip","filesize":104508829,"score":5.5,"genres":"Sports > Behind view > Direct control > Bowling > Licensed","desc":"<p><em>Brunswick Pro Bowling</em> is a bowling simulation game. In Career mode, after creating an avatar, players compete against the computer to work their way up from amateur to professional. The player character will increase in skill (e.g. strength, accuracy) and earn money while playing. This money can be used to buy clothing or a new bowling ball, which also affects skill. Quick Play mode, as the name suggests, allows for a quick round of bowling for one to four players.</p><p>Making a throw is a little bit different depending on the platform the game is played on. Lining up on the alley to decide the direction of the ball stays the same, but on PlayStation 2 and PSP it's also necessary to set its spin. The next step is rolling the ball. On the Wii this is done by swinging the Wiimote and releasing the trigger button, where the speed of the release determines the spin of the ball. In the other versions a sickle-shaped meter is shown; pulling down on the analog stick sets the accuracy, and pushing it forward the strength of the release.</p>"},{"name":"Buccaneer","year":2006,"developer":"Digitalware, Inc.","url":"PS2_COLLECTION_PART3/Buccaneer%20%28Europe%29.zip","filesize":38053279,"score":"","genres":"Action > 3rd-person (Other) > Hack and slash > Direct control > Sea pirates / Caribbean","desc":"<p>Ghosts! Zombies! Skeletons! Slaughter the drifting souls of the dead!!<br>In search of Fortune, Fame and Power, I became a pirate, traveling around the seas with no particular destination. Stopping at a portside Inn to replenish supplies, I heard rumours of the Demonic<br>Waters, an area shrouded in mist, where the sun never shines. Many a well-known pirate had disappeared into that mist in search of the treasures that sleep at the bottom of those waters.</p>"},{"name":"Buffy the Vampire Slayer: Chaos Bleeds","year":2003,"developer":"Eurocom Developments Ltd","url":"PS2_COLLECTION_PART3/Buffy%20the%20Vampire%20Slayer%20-%20Chaos%20Bleeds%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":3027797602,"score":7.3,"genres":"Action > Behind view > Puzzle elements > Fantasy > Horror > Licensed","desc":"<p>Buffy and the crew are back for another battle against evil. On this occasion (set as a 'missing episode' from the TV series' fifth season), the powerful vampire Kakistos and The First are ready for war, and the only ones standing in their way is Buffy the Vampire Slayer and her friends Willow (an at times powerful witch), Faith (a fellow Slayer), Spike (former evil vampire turned slightly good) and Xander (caught in the middle of his best friends work).</p><p>You get the chance to play as each character during the game as you slay vampires, solve puzzles and collect items along the way to prepare you for the final showdown. Various other characters from the show appear to help you out, while some are out to hurt you big time.</p><p>Multiplayer options are also included for up to 4 players. Go rabbit hunting in Bunny Catch; be the last person standing against wave after wave of vamps in Survival or battle for control of the arena in Domination.</p>"},{"name":"Bujingai: The Forsaken City","year":2003,"developer":"Red Entertainment Corporation","url":"sony_playstation2_b/Bujingai%20-%20The%20Forsaken%20City%20%28USA%29.zip","filesize":3607089991,"score":7.1,"genres":"Action > Behind view > Direct control > Fantasy > Sci-fi / futuristic","desc":"<p>The year is 22XX, the world civilization collapsed due to the lack of power after the explosion of a nuclear reactor. You are cast in a role of Lau, main protagonist whose character is modeled after the J-POP singer Gackt. However, your friend Lei turned on the dark side and is set to destroy what is left of the world and your plan is to stop Lei by any means necessary. The entire gameplay is very similar to that of Devil May Cry games, you can jump off the walls, performs various sword attacks, and use special magic attacks while battling the minions of darkness.</p>"},{"name":"Bully","year":2006,"developer":"Rockstar Vancouver","url":"sony_playstation2_b/Bully%20%28USA%29.zip","filesize":2510293746,"score":8.1,"genres":"Action > Sports > Behind view > Mini-games > Direct control > Dodgeball > Bike / bicycling > Contemporary","desc":"<p><em>Bully</em> is a story of one Jimmy Hopkins, whose academic success hasn't been anything spectacular as he's been expelled from various schools. His parents have a grand idea of sending him to Bullworth Academy which -- despite its grand name -- houses lots of other kids like Jimmy. This is the place where future dictators, murderers, and mad scientists reside. With a help of a few friends, some wits and hard-as-a-rock fists, Jimmy has to survive through one year in Bullworth Academy.</p><p>Often described as \"GTA in high school\", the game indeed has many similarities with the famous car-hijacking series. It features a \"sandbox\" environment, which encompasses not only the vast high school grounds, but also the nearby town of Bullworth. As in <em>GTA</em> games, the player can choose to complete missions in different order, or simply roam the game world, interacting with the environment and the characters. </p><p>Naturally, much of the typical <em>GTA</em>-like content has been changed to fit the high school setting. The violence is still present: Jimmy can punch and kick anyone he encounters, as well as use a variety of (non-lethal) weapons such as slingshots, fire crackers, and even self-made guns. It is not possible to hijack cars, but Jimmy is able to steal and ride bicycles. The missions include a variety of gameplay styles: chases, races, shooter-like sequences, escort missions, spying, random acts of vandalism, and many more.</p><p><em>Bully</em> features a plethora of activities and mini-games that can be accessed outside of the missions. Jimmy can simply attend classes and study. Each class is built like a mini-game: for example, language lesson involves composing as many words as possible out of a few given letters within a time limit. It is possible to find, buy, and wear different outfits, get jobs and earn money, and even date schoolmates and buy presents for them.</p>"},{"name":"Burnout","year":2001,"developer":"Criterion Software Ltd.","url":"PS2_COLLECTION_PART3/Burnout%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1414840440,"score":7.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Automobile > Street racing > Track racing","desc":"<p><em>Burnout</em> is an arcade style racing game in the mold of the Test Drive or Need For Speed series. In this game, you are racing on realistic streets with real traffic to contend with.</p><p>There are 6 courses on which to race, 3 of which are reminiscent of Europe, and 3 from the USA. There are several vehicles to choose from, ranging from compact cars to pickups. However, they are not based on real makes and models.</p><p>One notable feature of Burnout is the \"Burn Meter.\" The Burn Meter is a gauge that is filled by performing reckless stunts, like racing into oncoming traffic or power-drifting through corners. Once the Burn Meter is filled, your car gets a super speed boost. If you crash, however, the Burn Meter is reset and must be filled again to achieve a boost.</p>"},{"name":"Burnout 2: Point of Impact","year":2002,"developer":"Criterion Software Ltd.","url":"PS2_COLLECTION_PART3/Burnout%202%20-%20Point%20of%20Impact%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2236226447,"score":8.2,"genres":"Action > Racing / Driving > 1st-person > Behind view > Automobile > Street racing","desc":"<p>Racing a car is one thing, but racing into traffic at high speeds, where you are rewarded for the style of your crash, is another. This is the idea behind Burnout 2, which brings new modes and higher speeds compared to the original title. As usual, the aim is to speed around real-life roadways, through the traffic ahead, while avoiding collisions. </p><p>Burnout is a street racing game focused around speed and crashing.  Unlike many games that focus on closed course driving, you get to drive through cities with real traffic and city infrastructure.  Designers have built city districts and surrounding areas and implemented the racecourses throughout the streets.  As a result, many times certain parts of race-courses interlace with other parts of other races.  As well, instead of encouraging strategic driving and safe driving, Burnout strongly encourages offensive driving.  Driving on the wrong side of the road, barely missing passing traffic, drifting, and jumps all add to your boost \"burnout\" meter.  Speed boosts and jumps aid your attempt to drive past buses, trucks, and anything else that gets in the way.  The more offensive and dangerous your driving is, the more boost you get!</p><p>Burnout 2 contains a full campaign and custom car campaign.  While you can unlock regular cars and tracks, later in the campaign you unlock more raceways like reverse tracks and one-way sprints.  You can unlock over 20 cars like a Nascar, a 1920s gangster car, a Japanese muscle, and many customized vehicles with custom paint jobs and upgraded stats.  </p><p>Along with the same sense of speed and highly detailed crash animations as before, Point of Impact includes new modes of play.  Pursuit mode has you playing the cop as you chase down the speeding motorists, and to win you must crash them out of the race.  Or you can reverse that with a friend.  You can flee from a friend while he attempts to chase you.  Crash mode, as the name suggests, forces you to glide into crowded intersections to get the most cars involved in a pile-up as possible.  The bigger the crash, the better.  Up to 4 players can compete for the best score.</p><p>Training and 2 player racing modes are also included.</p>"},{"name":"Burnout 3: Takedown","year":2004,"developer":"Criterion Software Ltd.","url":"PS2_COLLECTION_PART3/Burnout%203%20-%20Takedown%20%28Europe%2C%20Australia%29%20%28En%2CEs%2CNl%2CSv%29.zip","filesize":2692500057,"score":8.7,"genres":"Action > Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing","desc":"<p>Burnout 3: Takedown is a racing game which encourages aggressive driving and lets you use your vehicle to smash your way to the finish line by taking out your rivals and causing massive multi-car pileups. The more cars you take out, damage you inflict, the more events and cars you can unlock. Burnout 3 also has a \"crash\" mode which puts your vehicle at a variety of traffic junctions jam-packed with moving vehicles and pickups to see just how much monetary damage you can inflict.</p><p>Burnout 3: Takedown continues the racing series with more cars, more tracks, a more detailed crash engine, and a multitude of new gameplay modes for single players, multiple players on one system, and online play.</p><p>Some features include:</p><p>Crash Mode: In addition to this gameplay element introduced in Burnout 2, Pick-ups have been added. They are scattered throughout the intersections. Some pick-ups will halve, double or quadruple your score, cause massive explosions to cause even more damage, or increase your damage with monetary bonuses.</p><p>Sophisticated crash technology allows for high-speed crashes with extreme detail.  Use your vehicle as a weapon and takedown rivals, using the new Aftertouch feature to control your vehicle after the moment of impact.</p><p>9 Race Modes including Single Race, Tournament, Lap Eliminator, Burning Lap and Road Rage.</p><p>Multiplayer Modes include Quick Line, Battle Race, Road Rage, and Party Crash, where 2-16 players participate in a pass-the-controller match-up.</p><p>7 Online Modes allow you to race online with up to 6 players. Battle through oncoming traffic in Crash Mode, Single Race, Road Rage, and more.</p><p>Over 70 Vehicles in 12 different classes including European exotics, American muscle cars, mid-size sedans, sports cars, compacts, buses and semi trucks.</p><p>Over 40 Tracks spanning 3 continents. Take on opponents across a broad range of environments, and experience dozens of traffic-filled crash junctions.</p>"},{"name":"Burnout: Anthology","year":2008,"developer":""},{"name":"Burnout: Dominator","year":2007,"developer":"Electronic Arts UK Ltd.","url":"PS2_COLLECTION_PART3/Burnout%20Dominator%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1816492005,"score":7.7,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p><em>Burnout Dominator</em> is an installment of the <em>Burnout</em> series for the PlayStation 2 and the PlayStation Portable systems. </p><p>The game is mainly focused on the returned <em>burnouts</em> feature - draining a complete boost meter without stopping which was last seen in Burnout 2: Point of Impact (2004). With return of burnouts feature there were four new game modes added including:</p><ul><li>Maniac Mode - Players need to drive dangerously to get highest scores by earning drifts, air, oncoming and near misses. Chaining burnouts in this mode increases the score multiplier. </li><li>Drift Challenge - Players need to obtain as many feet of drifting as possible. Chaining burnouts also increases the score multiplier here. </li><li>Near Miss Challenge - Similar as Drift Challenge, but player needs to score near miss bonuses.</li><li>Burnout Challenge - Also similar to Drift Challenge, but focusing on obtaining burnouts score.</li></ul><p>Some options have been removed from the game - for instance the Burnout Dominator doesn't feature Crash Mode, there is also no Traffic Checking Mode and Online Multiplayer. The PSP version features Burnout HQ where the player may upload scores and download new tracks. </p><p>The game consists of 12 different tracks, in 8 different real world locations. Each track has a forward and a reverse configuration.</p>"},{"name":"Burnout: Revenge","year":2005,"developer":"Criterion Software Ltd.","url":"sony_playstation2_b/Burnout%20Revenge%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%29.zip","filesize":2188914243,"score":8.6,"genres":"Action > Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing > Contemporary","desc":"<p>The fourth Burnout racing game puts you once again in the eye of traffic storms, where you do not only rush to be the fastest, but brutally, yet stylishly, take down your opponents. This is emphasized by <em>impact time</em>, which shows crashes in all their slowed-down glory, and the boost you receive after a successful wrecking. Reckless driving bumps your Revenge rank, unlocking new events. This can also be achieved by medal placings that grant new vehicles.</p><p>Collectible signature takedowns, crashbreakers (detonate your vehicle, now also in some regular races) and aftertouch for precise havoc remain, but one of the major changes is the ability to check traffic. Non-racing vehicles are no longer a nuisance with the sole purpose of slowing you down. They can now be actively used to obstruct traffic or send them into your foes. The Road Rage mode (take down a set number of rivals within a time limit) and Crash mode make a return, but Traffic Attack is new - race against the clock and level the traffic at the same time. Other modes include regular races, grand prix races, Burning Lap (high-speed time attack), Eliminator (last one after each round is out) and a normal time attack mode.</p><p>In the Crash mode, the multipliers and bonuses have been removed, and you cannot drive at full speed towards a crossroads. You have to time your start to receive a proper boost and then it is only about steering, crashbreakers and aftertouch. There are many new tracks and cars, a soundtrack with lots of famous artists, and a new world tour in different countries.</p><p>Online multiplayer is available for up to six players. New off-line additions are the split-screen Traffic Attack and a hot-seat Crash Tour for up to six players, next to the familiar Road Rage, Crash Party and Crash Battle modes.</p>"},{"name":"Bust-A-Bloc","year":2002,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART3/Bust-A-Bloc%20%28Europe%29.zip","filesize":56047315,"score":"","genres":"Action > 3rd-person (Other) > Paddle / Pong","desc":"<p><em>Bust-A-Bloc</em> is a one or two player, 3D, Breakout clone.</p><p>In addition to the single player game <em>Bust-A-Bloc</em> has a player-versus-player and a co-operative mode, one hundred and fifty levels, four camera angles and many power-ups.</p>"},{"name":"Butt-Ugly Martians: Zoom or Doom!","year":2002,"developer":"Runecraft Ltd.","url":"PS2_COLLECTION_PART3/Butt-Ugly%20Martians%20-%20Zoom%20or%20Doom%21%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":436609906,"score":5.5,"genres":"Action > Racing / Driving > Behind view > Hovercraft > Sci-fi / futuristic > Licensed","desc":"<p><em>Butt-Ugly Martians: Zoom or Doom!</em> is a futuristic racing game based on the TV series Butt-Ugly Martians. Emperor Bog is displeased by the meager results of the Martian invasion of Earth and has come up with an idea to replace the leader of Earth's invasion. Via the Conqueror's Cup, the winner has the honor to lead the invasion.</p><p>In the game, you can choose from a roster of seven characters and a total of nine tracks. Gameplay includes racing against other racers as well as using power-ups to gain an advantage.</p><p>The game offers several single-player modes like the Conqueror's Cup, practice mode, time attack, and a speed or battle challenge. There is also a multiplayer mode where two players can play against each other.</p>"},{"name":"Buzz! Junior: Ace Racers","year":2008,"developer":"Cohort Studios Ltd","url":"sony_playstation2_b/Buzz%21%20Junior%20-%20Ace%20Racers%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CEl%29.zip","filesize":1756954070,"score":"","genres":"Racing / Driving > 3rd-person (Other)","desc":"<p>The Buzz controllers used in this game enable up to four players to take part in races across different levels including by car, and plane. The game includes team modes, where friends can work together to accomplish goals, along with ten mini-games where you have to race by land, sea, and air in one of 16 different vehicles over 30 different circuits.</p>"},{"name":"Buzz! Junior: Dino Den","year":2008,"developer":"Cohort Studios Ltd","url":"sony_playstation2_b/Buzz%21%20Junior%20-%20Dino%20Den%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CEl%29.zip","filesize":1920708583,"score":"","genres":"Action > 3rd-person (Other)","desc":"<p>This game allows the user to take control of one of four different dinosaur characters and play against the other three Buzz controllers. It includes 35 multi-player games including go-cart racing, riding a tyrannosaurus rex, and dunking cavemen, which are all played to win dino eggs. The person with the most dino eggs at the end of the game is declared the King of the Dinos.</p><p>The game also includes a 2 vs 2 team mode.</p>"},{"name":"Buzz! Junior: Jungle Party","year":2006,"developer":"Magenta Software Ltd.","url":"PS2_COLLECTION_PART3/Buzz%21%20Junior%20-%20Jungle%20Party%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.zip","filesize":2450471666,"score":"","genres":"Action > Side view > Arcade","desc":"<p>Cheeky monkeys everywhere will love Buzz!™ Junior: Jungle Party, which brings five madcap mini-games from the original PlayStation®2 hit to PLAYSTATION®3.<br><br>Get ready for buzzer-bashing fun in a jungle paradise as you play baseball with elephants and even take a bubble bath with a grumpy gorilla! And don’t worry if less than four players are present – computer-controlled chimps will fill in!<br><br>Easy to play and filled to the treetops with hilarious ape antics, download Buzz!™ Junior: Jungle Party today and prepare to run wild.</p>"},{"name":"Buzz! Junior: Monster Rally","year":2007,"developer":"Magenta Software Ltd.","url":"sony_playstation2_b/Buzz%21%20Junior%20-%20Monster%20Rumble%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.zip","filesize":2451626609,"score":"","genres":"Action > Arcade","desc":"<p>Scare up some mayhem! BUZZ!™ Junior: Monster Rally lets you choose a monster to explore the dark, spooky Monster Mansion. Now for the PlayStation®3 system, BUZZ!™ Junior: Monster Rally provides 4-way mischievous action and lets players fully customize their Monsters.<br><br>* Compatible with BUZZ!™ buzzers or PlayStation®3 system controllers<br>* Fun and accessible to all ages!<br>* Play through 5 simple and hiliarious mini-games from the original PS2™ game<br>* Up to 4-player monstrous mayhem</p>"},{"name":"Buzz!: Brain of Oz","year":2009,"developer":"Relentless Software Ltd","url":"PS2_COLLECTION_PART3/Buzz%21%20Brain%20of%20Oz%20%28Australia%29.zip","filesize":3411338075,"score":"","genres":"Simulation > 3rd-person (Other) > Game show / trivia / quiz","desc":"<p>Buzz!: Brain of Oz is the next game in the Buzz! quiz series for the Playstation 2. Like the other games in the series it is played with the Buzz! controllers which will allow up to 8 players to pit the skills against each other if 2 sets of the controllers are used. It is part of the global <em>Buzz!: Brain of the World</em> brand with 21 different versions for specific countries, such as Buzz!: Brain of the UK for the UK.</p><p>Once again the game is based on a quiz show with the contestants having to answer a variety of questions specific to Australia from movies to sport, general knowledge and much more. Boasting over 4,000 questions and 'hilarious' new rounds, the EyeToy can also be used to see yourself on screen as you play.</p>"},{"name":"Buzz!: Brain of the UK","year":2009,"developer":"Relentless Software Ltd","url":"PS2_COLLECTION_PART3/Buzz%21%20Brain%20of%20the%20UK%20%28UK%29.zip","filesize":2790675529,"score":"","genres":"Strategy > 3rd-person (Other) > Fixed / flip-screen > Game show / trivia / quiz > Menu structures","desc":"<p><em>Buzz!: Brain of the UK</em> is a general knowledge quiz game about the United Kingdom in the long-running <em>Buzz</em> series. Instead of just translating the same questions for each country that is a part of the UK, each country's version has lots of nationally specific questions. For instance, in the British version there are questions on Eastenders or Corrie. It is part of the global <em>Buzz!: Brain of the World</em> brand with 21 different versions for specific countries, such as Buzz!: Brain of Oz for Australia.</p><p>In addition to that localized content, <em>Brain of the UK</em> also retains the MyBuzz feature which enables users to create custom quizzes. All quiz packs bought on previous <em>Buzz</em> games are also playable in this version.</p><p>The PlayStation 3 version features online play and allows users access to user created questions on the My Buzz! site as well as leaderboards that rank online play.</p><p>The PSP version contains a single player game and includes the \"pass-around\" mode from the previous PSP titles in the series to enable up to 6 players to take part in the same quiz.</p>"},{"name":"Buzz!: The BIG Quiz","year":2006,"developer":"Relentless Software Ltd","url":"PS2_COLLECTION_PART3/Buzz%21%20The%20Big%20Quiz%20%28Europe%29%20%28v2.00%29.zip","filesize":2444982799,"score":7,"genres":"Simulation > 3rd-person (Other) > Game show / trivia / quiz","desc":"<p><em>Buzz!: The BIG Quiz</em> is a general knowledge quiz game that uses four bespoke USB buzzers, introduced in Buzz!: The Music Quiz, instead of the usual PlayStation 2 dual shock controllers. This means that four players can play right away.</p><p>The game itself is set in the format of a TV gameshow with the contestants behind podiums. The questions appear on a jumbotron, introduced by the show's host: Buzz. The main game is split over eight rounds starting with simple game mechanics but getting gradually more complex and causing more competitiveness. The question types are general knowledge and cover a large amount of subjects using pictures, videos, music clips etc.</p><p>As well as the regular game, you can play an eight player game if you have a second set of buzzers. There's also team play and a quizmaster mode. There are two versions of the game; with or without a set of buzzers included.</p>"},{"name":"Buzz!: The Hollywood Quiz","year":2007,"developer":"Relentless Software Ltd","url":"PS2_COLLECTION_PART3/Buzz%21%20The%20Hollywood%20Quiz%20%28Europe%29%20%28Fr%2CDe%2CIt%29.zip","filesize":3626749316,"score":7.4,"genres":"Simulation > 3rd-person (Other) > Game show / trivia / quiz","desc":"<p><em>Buzz! The Hollywood Quiz</em> is the fifth game in the Buzz! series, and like the previous games in the series, it must be played using special USB 'buzzer' controllers instead of the regular controller. The game is sold both with and without these 'buzzers', and there are four buzzer controllers per set. This means that, using the PS2's two USB connections, up to eight players can play at once.</p><p>The game is set in a Hollywood awards event which contestants must answer questions on categories within the world of Hollywood (Movies, Film Stars, movie Gossip…) spread over eight different rounds, including the all new round ‘Rollover’ where players answer questions individually, and if they get them wrong the points go into a jackpot until a question is answered correctly. The game features regular questions, as well as pictures and video clips.</p><p>There are several custom modes available, which allow you to create the perfect quiz by taking out the rounds you don't want to play. A single-player mode is also available.</p>"},{"name":"Buzz!: The Mega Quiz","year":2007,"developer":"Relentless Software Ltd","url":"PS2_COLLECTION_PART3/Buzz%21%20The%20Mega%20Quiz%20%28Europe%29%20%28En%2CFr%2CNl%29.zip","filesize":3925046435,"score":7.5,"genres":"Simulation > 3rd-person (Other) > Game show / trivia / quiz","desc":"<p>Buzz! The Mega Quiz is the fourth game in the Buzz! series, and like the previous games in the series, must be played using special USB 'buzzer' controllers instead of the regular controller. The game is sold both with and without these 'buzzers', and there are four buzzer controllers per set. This means that, using the PS2's two USB connections, up to eight players can play at once.</p><p>The game takes place as a game show, in which contestants must answer questions on a variety of categories (this game, unlike the others in the series, combines music, sports and general knowledge) spread over various different rounds. The game features regular questions, as well as picture, video and sound clips.</p><p>There are several custom modes available, that allow you to create the perfect quiz by taking out the rounds you don't want to play. A single-player mode is also available.</p>"},{"name":"Buzz!: The Music Quiz","year":2005,"developer":"Relentless Software Ltd","url":"PS2_COLLECTION_PART4/Buzz%21%20The%20Music%20Quiz%20%28UK%29.zip","filesize":1248282906,"score":7.2,"genres":"Simulation > 3rd-person (Other) > Cinematic camera > Game show / trivia / quiz","desc":"<p>A music trivia game which includes four bespoke buzzers which light up and plug into one of the PS2's USB ports.</p><p>Four players battle it out over a eight rounds in a gameshow style environment. Other modes include a simple single player mode, a quickfire quiz mode and a quizmaster mode which lets you ask your own questions.</p>"},{"name":"Buzz!: The Pop Quiz","year":2008,"developer":"Relentless Software Ltd","url":"sony_playstation2_b/Buzz%21%20The%20Pop%20Quiz%20%28Europe%29%20%28En%2CFr%2CNl%29.zip","filesize":3899824942,"score":"","genres":"Simulation > 3rd-person (Other) > Game show / trivia / quiz","desc":"<p><em>Buzz! The Pop Quiz</em> is the seventh game in the Buzz! series, and like the previous games in the series, it must be played using the special USB ’Buzz! Buzzers’ controllers, instead of the regular controllers. The game is sold both with and without these ‘Buzz! Buzzers’, and there are four buzzers per set. This means that using the PS2’s two USB connections, up to eight players can play at once.Contestants must answer questions on categories within the world of nineties and noughties pop music spread over eight rounds including five new rounds. The rounds feature regular questions, as well as pictures and video clips. Also new to the game is the dancing of the characters when music is played on the set.There are several custom modes available, which allow you to create the perfect quiz by taking out the rounds you don’t want to play. A single player mode is also available.</p>"},{"name":"Buzz!: The Schools Quiz","year":2008,"developer":"Relentless Software Ltd","url":"PS2_COLLECTION_PART4/Buzz%21%20The%20Schools%20Quiz%20%28Europe%29.zip","filesize":1221213441,"score":"","genres":"Simulation > 3rd-person (Other) > Game show / trivia / quiz","desc":"<p>Buzz! The Schools Quiz is the sixth game in the Buzz! series, and like all other Buzz! titles it must be played using the USB ’Buzz! Buzzers’ controllers, instead of the regular controllers. The game is sold both with and without these Buzz! Buzzers and there are four buzzers per set. This means that using the PS2’s two USB connections, up to eight players can play at once.The game was developed in partnership with the Department for Education and Skills and expert educational consultancy Schoolzone for use in both classrooms and at home. As with all Buzz! Games, it’s set in a game show environment. Players answer questions on different subjects taken from the Key Stage 2 National Curriculum, aimed at children from age’s seven to eleven.There are several game play modes available, allowing players to play on just one subject or from a wide range. Team and single player modes are also available to allow different numbers of players to play at once. A Teacher feature gives the teacher control over how the game is played, allowing them to pause and involve children in the answers being given.</p>"},{"name":"Buzz!: The Sports Quiz","year":2006,"developer":"Kuju Entertainment Ltd.","url":"sony_playstation2_b/Buzz%21%20The%20Sports%20Quiz%20%28Europe%29%20%28En%2CFr%2CNl%29.zip","filesize":3176535024,"score":6.7,"genres":"Educational > 3rd-person (Other) > Board game > Game show / trivia / quiz","desc":"<p><em>Buzz!: The Sports Quiz</em> is a sports trivia game using the USB buzzer of the PlayStation 2 for up to eight players with three game modes: Solo, Multiplayer, and Team mode. The player may choose the difficulty and the length of the party. There are 16 characters to choose from, 3 different dress suits per characters, and 24 buzz sounds.</p>"}]