[{"name":"Cabela's African Safari","year":2006,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20African%20Safari%20%28USA%29.zip","filesize":611017208,"score":6.3,"genres":"Sports > 1st-person > Behind view > Hunting > Licensed","desc":"<p><em>Cabela's African Safari</em> takes you to the wild's of Africa in search of the most valued trophies on the planet. Hunt in 5 different countries like South Africa, Namibia, Botswana, Zimbabwe and Mozambique, each with their own challenges and perils.</p><p>You have several different firearms, rifles from the .243 (designed mostly for small antelopes) up to the .600 (for big game like Elephants and Rhinos), shotguns for bird hunting and small caliber hand guns designed to protect you against small predators.</p><p>Each stage has five hunts, from tracking several small game, one big trophy game, bird hunting, herd hunting, in which you sit in the back of a jeep and try to bring down a trophy animal in the midst of a herd, and finally the Trophy Hunt in which you take down one of the Big 5 of Africa (Rhino, Leopard, Elephant, Cape Buffalo and the Lion). You also have a tracker which gives you clues on where to find your game, a porter to give you advice of which firearm to use and a guide to help you along and set up the hunts. Each hunt has a specific time limit so you won't have time to take in the beautiful surroundings in the game. </p><p>The landscape is populated with all kinds of animals, most harmless and will run when they catch wind of you, but you have to watch out for predators who will attack, especially Hyenas, wild dogs and even leopards and cheetahs. Elephants and rhinos will attack to if they feel provoked.</p><p>After completing a safari you can play it again in the Open Safari in the main menu if you want to go back to a favorite hunt, plus after you take down the Trophy Hunt animals you can go after them again on the main menu with the option called The Big Five and even hold tournaments to see who is the better hunter. A sure-fire winner for video game hunters.</p>"},{"name":"Cabela's Alaskan Adventures","year":2006,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Alaskan%20Adventures%20%28USA%29.zip","filesize":666691670,"score":5.6,"genres":"Action > 1st-person > Behind view > Hunting > Fishing > North America > Licensed","desc":"<p><em>Cabela's Alaskan Adventures</em> takes you into the depths of twelve Alaskan regions where hunting, fishing and even dog sledding are supreme.</p><p>There are two game modes that can be played. In each of the game modes, create a hunter and choose from three difficulty settings. Open Season mode will allow you to quickly hunt or fish in any unlocked area. Adventure mode is the main mode of the game and is the true Alaskan experience. In this mode, travel to each region and visit the outposts to acquire the proper gear including clothing and tents. You will be able to go on hunts, fishing challenges and special contests. Try to unlock new regions, new gear and try to win trophies for prize catches.</p><p>When hunting, choose from an array of firearms including rifles, shotguns, muzzleloaders, handguns and bows. Grab a pair of binoculars to scan out the area or use a scope for more accurate aiming . Game calls, decoys, scents and lures will also help aid in your hunting experience. Big game animals range from Kodiak Bears and Musk Ox to Barren Ground Caribou and Mountain Goats. Also available to hunt are small game animals such as coyotes, beavers and even birds.</p><p>Fishing will take you all over Alaska trying to catch Salmon, Arctic Graylings and other Alaskan species. Use the correct bait and lures in the proper areas to make the catch. You can choose from ice fishing, spin fishing and fly fishing with a number of rods and reels to choose from.</p>"},{"name":"Cabela's Big Game Hunter","year":2002,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Big%20Game%20Hunter%20%28Europe%2C%20Australia%29.zip","filesize":1244545369,"score":"","genres":"Action > Racing / Driving > 1st-person > Behind view > Hunting > Direct control > Licensed","desc":"<p>THE NEXT EVOLUTION OF HUNTING!<br><br>* ADVANCED ANIMAL BEHAVIOR - Game design and animal movement based on actual DNR research, including sight, speed, daily routines and feeding patterns for authentic gameplay action!<br>* SPECIAL IN-GAME FEATURES INCLUDE - Bullet-Cam allows you to see your shot travel to its destination, X-Ray scopes so you can \"line-up\" the perfect shot, custom Log Cabin for your \"Trophy Room,\" plus advanced scoring system and MUCH, MUCH MORE!<br>* HUNT ALL OVER NORTH AMERICA - You will be mesmerized by the detail and expansive landscapes in 32 different locations that accurately reflect the natural environments from the Northwest Territory to West Texas.<br>* AUTHENTIC WEAPONS AND GEAR - Your hunting experience will be complete as you choose from a wide selection of today's best-selling firearms, bows, scents, clothes, stands, blinds, ATVs, boats and trucks.</p>"},{"name":"Cabela's Big Game Hunter 2005 Adventures","year":2004,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Big%20Game%20Hunter%202005%20Adventures%20%28Europe%2C%20Australia%29.zip","filesize":881286258,"score":6.9,"genres":"Action > Simulation > Sports > Hunting > Licensed","desc":"<p>Another in the Big Game Hunting series, 2005 Adventures brings you 36 big game animals in 10 locations.  Choose from many guns, bows, equipment, and clothing before heading out to take on these animals.</p><p>Head out looking for whatever animal(s) you have tags for.  Track your target through mountains, plains, hills, streams, and lakes.  Swim across lakes and streams that are in your way and drive various vehicles to save time getting where you're going.  Once you find your prey, get close enough to shoot without your target noticing you.  Then take the shot!</p><p>Play the game in quick hunt or career mode, or play with friends online.  Go to your cabin to see the animals you have shot in career mode... you can even choose your what cabin you want out of six choices!</p><p>Unlike many other hunting games that have you go out and kill what you can in a single day, you can take as many days as you need to bag your limit.  Use tents to sleep away the nights, or walk around looking for possible spots to sit and wait for prey on the following day... just don't forget to eat and drink to keep up your energy.</p><p>Play through rain and snow as well as clear weather conditions.  Animals behave differently in different conditions, just like in real life.</p>"},{"name":"Cabela's Big Game Hunter 2008","year":2007,"developer":"FUN Labs Romania S.R.L.","url":"PS2_COLLECTION_PART4/Cabela%27s%20Big%20Game%20Hunter%202008%20%28Europe%29.zip","filesize":434102374,"score":"","genres":"Simulation > Sports > 1st-person > 3rd-person (Other) > Hunting > Licensed","desc":"<p><em>Cabela's Big Game Hunter</em> takes the player to six international hotspots in an attempt to acquire prize big game trophies such as grizzly bears, mountain lions, elk, moose, caribou, etc. Such locations consist of New Zealand, Africa, Argentina, the Western United States and even British Columbia. Player can also hunt small game as well as bird hunting such as geese, duck and quail.</p><p>Authentic <em>Cabela's</em> equipment can be used such as clothing, tree and ground stands, lure attractants and calls as well as powerful weaponry consisting from rifles to shotguns and pistols. Players must also adhere to real life local hunting regulations such as bag limits, time limits and protected species. Breaking these regulations could result in a penalization and if continued can end the level as well as the game.</p>"},{"name":"Cabela's Dangerous Hunts","year":2003,"developer":"FUN Labs Romania S.R.L.","url":"PS2_COLLECTION_PART4/Cabela%27s%20Dangerous%20Hunts%20%28Europe%2C%20Australia%29.zip","filesize":945553544,"score":6.5,"genres":"Sports > 1st-person > 3rd-person (Other) > Hunting > Licensed","desc":"<p><em>Cabela's Dangerous Hunts</em> is a hunting game with adrenaline - hunt or be hunted!</p><p>Many of the animals you'll be after are dangerous and aggressive and will take you one-on-one - and you'll be armed with a primary weapon as well as a knife or pistol for close combat defense. You'll hunt for 27 animals in 12 regions. Animals include dangerous species such as bears, wolves, leopards, rhinos and cape buffalo; big game species such as moose, bighorn, mountain goat, elk and caribou; and exotic species such as impala, duiker and kudu.</p><p>The regions include British Columbia, Colorado, New Mexico, Tanzania and Zimbabwe. Game modes include Quick Hunt (one tag, one animal, one region), Action Zone (warp from location to location, where dangerous animals are waiting to attack you), and Career Hunt (a series of missions where you have some choice as to which task you'll take on next, and unlock chartered hunts).</p>"},{"name":"Cabela's Dangerous Hunts 2","year":2005,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Dangerous%20Hunts%202%20%28USA%29.zip","filesize":864736158,"score":6.4,"genres":"Action > 1st-person > Shooter > Licensed","desc":"<p><em>Cabela's Dangerous Hunts 2</em> is a hunting game focused on linear story-based gameplay, instead of the freeform hunting of the main Cabela's line. You will hunt 20 animals, including lions, tigers, and bears, across 12 main levels, and 4 hidden levels. There are three difficulty levels, and a slow-motion ability to help line up shots. Keep your eyes open; there are secret stumps in each level, which if shot can unlock extra levels and other items. In most levels, you will be assisted by a native guide, who will both draw the attention of the local wildlife, and assist you in killing them.</p><p>The story features you, a world-famous hunter, who has just found out an old friend, Bullseye Bill, is missing. Retrace his steps around the world, helping other people along the way.</p>"},{"name":"Cabela's Dangerous Hunts 2009","year":2008,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Dangerous%20Hunts%202009%20%28USA%29.zip","filesize":447165387,"score":5.7,"genres":"Sports > 1st-person > 3rd-person (Other) > Hunting > Licensed","desc":"<p><em>Cabela's Dangerous Hunts 2009</em> puts the player in the shoes of Flint Abrahams, a famous hunter who travels around the world in search of hunting challenges. The player spends much time exploring the wilderness looking for traces of prey. Because they can be hard to make out, a Hunter's Sense is included to reduce the world to grayscales and make animals stand out. The game however maintains an arcade approach and lets the player shoot everything in his way, without regard for a patient approach.</p><p>The game's Career mode has timed levels forcing quick gameplay, and the different stages are set all around the world. When facing larger animals such as bear or lions, a Hand-to-Claw Combat mode is often triggered automatically to fend them off through a number of quick time event key presses. Another option is the Adrenaline mode where time comes almost completely to a stop, making it easier to line up the shots and get a lot of kills.</p><p>Different types of equipment become available to assist in the hunt, and in certain missions it is not required to kill animals – tranquillizing them is sufficient.</p>"},{"name":"Cabela's Deer Hunt: 2004 Season","year":2003,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Deer%20Hunt%20-%202004%20Season%20%28USA%29.zip","filesize":811513223,"score":"","genres":"Sports > 1st-person > 3rd-person (Other) > Hunting > Licensed","desc":"<p>Cabela's Deer Hunt 2004 Season will have you stalking elusive deer all across North America. From well-known species like Whitetail, Mule Deer and Columbian Blacktail to exotic species such as Coues, Fallow and Sika. Each animal will present a unique challenge and environment.</p><p>Hunt through real-life locations like the Grand Tetons in Wyoming, the Sonoran Desert in Arizona, or Mille Lacs Minnesota. ATVs, trucks, snowmobiles and boats make it easier to travel around. And lots of guns and gear make every trip unique!</p>"},{"name":"Cabela's Deer Hunt: 2005 Season","year":2004,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Deer%20Hunt%20-%202005%20Season%20%28USA%29.zip","filesize":756325916,"score":6.9,"genres":"Sports > 1st-person > 3rd-person (Other) > Hunting > Licensed","desc":"<p>This sequel to Cabela's Deer Hunt 2004 Season really is more than a sequel. Improved technology gives much bigger levels with more trees and vegetation, as well as much better animal AI. 18 new missions really add to gameplay, as do the clay shooting challenges. 9 deer species across North America will give any virtual hunter hours of entertainment.</p>"},{"name":"Cabela's Legendary Adventures","year":2008,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Legendary%20Adventures%20%28USA%29.zip","filesize":947377115,"score":"","genres":"Action > 1st-person > Hunting > Shooter > Direct control > North America > Licensed","desc":"<p>Legendary Adventures – Relive the greatest hunting stories ever told based on legendary hunts from the past century.<br><br>Legendary Animals – Hunt for record-setting White-Tailed Deer, Yukon Moose, Alaskan Brown Bears, Roosevelt Elk, and more!<br><br>North America’s Top Hunting Locations – Kodiak Island, the Yukon Territory, the Rocky Mountains, and 7 others.<br><br>Over 50 Additional Hunting Adventures – Hunt for over 30 animal species of other big game, small game, waterfowl, upland birds, and turkey.<br><br>3 Hunting Modes:<br><br>Legends Mode – Progressive hunting trips that include 10 locations, 3 areas each.<br><br>Adventures Mode – Pick up and play; travel to any unlocked location.<br><br>Marksman’s Mode – Contest mode that includes special shooting contests.<br><br>Firearm Customization – Upgrade weapons for better accuracy, lower recoil, and other shooting improvements.<br><br>Wii Controls – On the Wii system, controls are compatible with the Wii Zapper.</p>"},{"name":"Cabela's Monster Bass","year":2007,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Monster%20Bass%20%28USA%29.zip","filesize":301603995,"score":"","genres":"Sports > 3rd-person (Other) > Real-time > Fishing > Naval / watercraft > North America > Licensed","desc":"<p>Cabela's Monster Bass is a game based on the fishing and hunting retailer. The main objective of the game is to catch \"The Monster Bass\" and hold on for your life. There are over 500 locations across North America to fish from, and they all have different kinds of fish. You can also battle world record trophies for the largest fish, from the smallest fish to the largest. The weather is always perfect in this game and there are no hazards. The game plays like most other Cabela fishing games, and strives to be just like real life. When you begin to catch a fish, you must press a series of buttons to catch the fish. The larger the fish, the more buttons you have to press.</p>"},{"name":"Cabela's North American Adventures","year":2010,"developer":"FUN Labs Romania S.R.L.","url":"sony_playstation2_c/Cabela%27s%20North%20American%20Adventures%20%28USA%29.zip","filesize":530956971,"score":"","genres":"Simulation > Sports > 1st-person > Hunting > Shooter","desc":"<p>Bring your A-game on this hunt - you’re on camera. In Cabela's® North American Adventures your search for trophy game is captured on film as an expert cameraman records your adventures. It’s hunting taken to the extreme with record-class opportunities in situations meant only for the pros. To make the hunt even more challenging, you not only have to wait for the right gun or bow shot opportunity; you must make sure the cameraman perfectly frames the action. You’ll hunt more than 30 game species across ten North American regions from Alaska to Mexico. Use cover and stealth to close the distance on elusive trophies, and expert duck calling in an action-packed mallard hunt. When your trophy’s down, relive the moment by watching an exciting video of the hunt’s highlights. Also featured are arcade-style shooting galleries and a Big Trophy Tournament where your persistence and skill as a hunter can help you bring down record-sized racks.</p><p>©2010 Activision Publishing, Inc. Activision is a registered trademark of Activision Publishing, Inc. All rights reserved. Cabela's and Cabela's logo are registered trademarks of Cabela's Incorporated. All other trademarks are the property of their respective owners.</p><p>Purchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America Inc. One-time license fee for downloads to up to 2 portable systems that are associated with the purchasing account.</p>"},{"name":"Cabela's Outdoor Adventures","year":2005,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Outdoor%20Adventures%20%28USA%29.zip","filesize":803710398,"score":"","genres":"Simulation > 1st-person > Hunting > Fishing > North America","desc":"<p>Take the Hunting &amp; Fishing expedition of a lifetime with 22 adventures across North America and beyond. Stalk monster bucks and trophy big game or stop off and fish the local waters. Experience the sights and sounds of a true-to-life outdoor adventure where stealth, strategy, and technique are of the utmost importance!</p>"},{"name":"Cabela's Outdoor Adventures 2010","year":2009,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Outdoor%20Adventures%202010%20%28USA%29.zip","filesize":502501525,"score":"","genres":"Simulation > Sports > 1st-person > Real-time > Hunting > Fishing","desc":"<p>The Greatest of the Great Outdoors!<br>Experience the top hunting and fishing hotspots in North America in pursuit of record breaking big game, small game, turkey, upland birds, waterfowl and trophy fish species all combined into one incredible outdoor experience!</p>"},{"name":"Cabela's Trophy Bucks","year":2007,"developer":"Sand Grain Studios","url":"sony_playstation2_c/Cabela%27s%20Trophy%20Bucks%20%28USA%29.zip","filesize":486767303,"score":"","genres":"Simulation > Sports > 1st-person > 3rd-person (Other) > Hunting > Shooter > Licensed","desc":"<p><em>Cabela's Trophy Bucks</em> has the player travel to 24 different hunting hot spots in North America in an attempt to hunt down big game such as Whitetail Deer and Mule Deer along with small game such as rabbits and squirrels. Waterfowl birds such as ducks along with birds like quail are also available for hunting using a variety of weapons ranging from the powerful 30.06, small arms such as pistols and powerful shotguns.</p><p>There are 96 different hunting missions to hunt in as well as 24 different hunting competitions to compete in. There are also five different career hunting slams where players hunt several different species in the course of a week. Players can also use authentic <em>Cabela's</em> equipment, ranging from tree stands, buck and doe calls and attractants. </p><p>Additionally, the player must also adhere to real-life hunting regulations such as bag limits, time of hunting as well as restrictions on hunting certain species. If a player shoots a protected species or an out of season animal, the player will be penalized and if they continue, the level as well as the game will end for the player.</p>"},{"name":"Cake Mania: Baker's Challenge","year":2008,"developer":"Sandlot Games","url":"sony_playstation2_c/Cake%20Mania%20-%20Baker%27s%20Challenge%20%28USA%29.zip","filesize":117270971,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Arcade > Time management > Point and select","desc":"<p>Includes 2 New Bonus Modes: Custom Kitchen and Baker's Challenge!<br><br>The Mouth-Watering Smash Hit, Now Available on the Playstation 2<br>Jill returns home from culinary school to find her grandparents' bakery closed down. Help Jill build her bakery from scratch, serve customized cakes to a collection of hilarious and hungry customers and save the Evans' bakery!<br><br>Game Features: * Deliver the goods in 84 fast-paced levels and 2 new bonus modes! * Bake and decorate cakes to order for a steady stream of demanding customers! * Earn enough money each month to keep the bakery open, purchase equipment and upgrade the kitchen! * Satisfy the appetites of picky food critics, blushing brides, hungry grannies and more with hundreds of cake combinations!</p>"},{"name":"Call of Duty 2: Big Red One","year":2005,"developer":"Treyarch Corporation"},{"name":"Call of Duty 2: Big Red One (Collector's Edition)","year":2005,"developer":"Treyarch Corporation","url":"sony_playstation2_c/Call%20of%20Duty%202%20-%20Big%20Red%20One%20%28USA%29%20%28Collector%27s%20Edition%29.zip","filesize":2795014986,"score":"","genres":"Special edition > Extra content / game","desc":"<p>This edition of Call of Duty 2: Big Red One includes:</p><ul><li>Call of Duty 2: Big Red One</li><li>4 Exclusive character skins for multiplayer gameplay – using Elite soldier models</li><li>Interviews, MoCap/VO session footage in-game voice actors from the cast of Band of Brothers </li><li>Interviews with WWII Vets of the Big Red One, including memories of in-game events</li><li>Multiplayer map fly-thrus with DVD-style developer commentary (tips, interesting facts, etc.)</li><li>Behind the scenes with Treyarch, discussing development of COD2: Big Red One </li><li>Concept and production art gallery(Art, sketches, storyboards, renders, etc.)</li></ul>"},{"name":"Call of Duty 3","year":2006,"developer":"Treyarch Corporation","url":"PS2_COLLECTION_PART4/Call%20of%20Duty%203%20%28Europe%29.zip","filesize":2614119827,"score":7.7,"genres":"Action > 1st-person > Shooter > Direct control > Tank > Historical events > World War II > War > Regional differences","desc":"<p>The third main <em>Call of Duty</em> game centers around Operation Cobra in Normandy, France, the World War II operation planned by United States Army General Omar Bradley to break out from the Normandy area after the previous month's D-Day landings. You play as 4 allied sides with American, Canadian, British and Polish soldiers in 14 chronological singleplayer missions covering the 88 days leading up to the liberation of Paris. Surprisingly, you cannot play as the French 2nd Armored Division that actually liberated Paris.</p><p>The battles are usually dramatic with many fights and scripted events at the same time, consisting of infantry and vehicles, with semi-destructible environments. In between, there are cinematics that explain the events. A few gameplay mechanics have been kept intact or make a return: slight auto aim, the damage system that allows you to recover if you hide for a moment, and smoke grenades. New features include the ability to toss back unexploded grenades and actions requiring a successful series of button combinations. This can occur in hand-to-hand combat where you can yank the weapon out of enemy soldiers' hands. Enemies work in groups, try different tactics and search for cover.</p><p>The main multiplayer modes are standard deathmatch (battle), team deathmatch (team battle), Capture the Flag (either with two flags or two sides trying to control a single, neutral flag) and Headquarters (two sides either defend or attack a structure, and players can now respawn after dying). The new mode, War, is similar to the gameplay of the Battlefield series. Two teams start with two control points each, and one neutral flag in the middle. The objective is to control all five flags.</p><p>There are multiple-occupancy vehicles (Sherman Tank, Panzer IV, Jeep, Horch, BMW, Harley), and several multiplayer classes: Rifleman, Heavy Assault, Light Assault, Medic, Scout, Support and Anti-Armor. Each class has unique abilities. There are also two rankings: a normal rank system during a single game where your abilities improve if you do well, and an overall TrueSkill ranking. Also, unlike the previous games, your team stays grouped together after a match and is not booted back to the lobby right away.</p>"},{"name":"Call of Duty 3 (Special Edition)","year":2007,"developer":"Treyarch Corporation"},{"name":"Call of Duty Trilogy","year":2008,"developer":""},{"name":"Call of Duty: Finest Hour","year":2004,"developer":"Spark Unlimited","url":"sony_playstation2_c/Call%20of%20Duty%20-%20Finest%20Hour%20%28USA%29%20%28v2.02%29.zip","filesize":1678931512,"score":6.9,"genres":"Action > 1st-person > Behind view > Shooter > Tank > Historical events > World War II > War > Regional differences","desc":"<p><em>Call of Duty: Finest Hour</em> is the first CoD game on the consoles. The story spans through three different fronts in the Second World War through three soldiers' viewpoints. Basically, the game is a heavily scripted, story-driven action game where the main focus is on the action and the dramatization of the war and the people in the middle of it all. One of the defining features if Call of Duty-games is the mood they set and the accurate reproduction of the actual WW2 battlefields and operations. As well as the usual range of WW2 weaponry, in CoD:FH there are also vehicles in which one can drive around, blasting the enemies to bits in the process.</p>"},{"name":"Call of Duty: Legacy","year":2007,"developer":""},{"name":"Call of Duty: World at War - Final Fronts","year":2008,"developer":"Rebellion (Liverpool) Ltd.","url":"PS2_COLLECTION_PART4/Call%20of%20Duty%20-%20World%20at%20War%20-%20Final%20Fronts%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":1705887146,"score":6.5,"genres":"Action > 1st-person > Shooter > Direct control > Historical events > World War II > War","desc":"<p>This version of Call of Duty: World at War is very different from its counterparts. Aside from the graphics engine, the violence is toned down, resembling its predecessor and it features different storylines, locations and missions from the other versions.</p><p>The story is divided into four campaigns. The first takes place at the beginning of the war in the South Pacific as the player takes control of Pvt. Joe Miller serving with the American 2nd Marine Division as they start out in basic training in North Carolina. This level lets the player learn the controls of the game and then fastforwards to the Guadalcanal (as though the training mission was a flashback) where the player must survive with his company. There are four more missions, two on the island of Betio and two on the island of Saipan.</p><p>The second part takes place in Europe after D-Day with four missions divided by two different experiences. The first two has the player take command of Pvt. Lucas Gibson of the American 80th Infantry Division as he and his squad make their way through Luxembourg and finally through Bastone mounted on a Sherman tank, trying to break through Nazi lines. The last two missions let the player take control of Pvt. Tom Sharpe of the British 6th Airbone Division, battling through the ruins of Bastone and the town of Bure.</p><p>The third part only consists of two missions that are divided between Pvt. Sharpe and Pvt. Gibson and is set in the closing days of the war in Europe. The first mission takes place in Wesel where Pvt. Sharpe and his division must find a way across the Rhine. The second has Pvt. Gibson and his division battle through the town of Braunau am Inn, the birthplace of Adolf Hitler, as they need to stop a V2 rocket from being launched.</p><p>The last campaign reverts back to Pvt. Joe Miller at the end of the Pacific Theatre, this time with two missions on the island of Okinawa, with the last mission having the player take Castle Shuri in an attempt to capture Okinawa and open the gate to the Japanese mainland.</p><p>The gameplay is of the first-person shooter kind and is told through in game cutscenes as well as stock footage of World War II, both black &amp; white and color. The controls are basic, with a main weapon and secondary along with two grenades (smoke and frag). Movement is done through the left analog stick with aiming through the right one. Players can fire their weapon using the \"R1\" button and switch between using \"Triangle\", manually reloading them using the \"Square\" button and aim down the sight using the \"L1\" button. Jumping and hurling obstacles (when prompted) is done through the \"X\" button, a melee attack can be obtained through the \"R3\" button and sprinting through the \"L3\" button. The \"O\" button is used for crouching while holding the button down will let the player's character prone.</p><p>Players can obtain ammo through fallen comrades and new weapons by standing over top of the weapon and holding the \"Square\" button. Likewise, fallen enemy weapons can be obtained this way. There is no number of preset lives and once a player is killed he can restart from a previous checkpoint. There is no health bar system, instead it resembles Medal of Honor: Vanguard where once the player starts to sustain an considerable amount of damage, the view will start to become red. This can be stopped by taking cover away from enemy fire which will allow the players health to replenish.</p>"},{"name":"Canvas 2: Nijiiro no Sketch (DX Pack)","year":2006,"developer":"F&C Co., Ltd.","url":"sony_playstation2_c/Canvas%202%20-%20Nijiiro%20no%20Sketch%20%28Japan%29%20%28DX%20Pack%29.zip","filesize":1943928198,"score":"","genres":"Special edition > Physical extras","desc":"<p>This DX Pack release of <em>Canvas 2</em> game comes in a boxed package and includes:</p><ul><li>Canvas 2: Nijiiro no Sketch* C2 Comptiq magazine with game artwork, interviews, short novel and comic</li><li>Canvas 2: Extra Season drama CD</li><li>Canvas 2 special movie mix DVD</li></ul>"},{"name":"Canvas 3: Tanshoku no Pastel","year":2009,"developer":"F&C Co., Ltd.","url":"sony_playstation2_c/Canvas%203%20-%20Tanshoku%20no%20Pastel%20%28Japan%29.zip","filesize":1475859899,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>You made a promise with your father that if you don't manage to get the first prize at the art competition, you will abandon your dream to become an artist and return to general studies. This visual novel centers around the art school and, of course, many beautiful girls that just happen to be your classmates.</p><p>Originally released for Windows under the name Canvas 3: Hakugin no Portrait, this PlayStation 2 release reduces the rating level due to previously included sexual content, and also features new heroine, Kanna Tsukahara. Later PSP release which added another new heroine was renamed to Canvas 3: Nanairo no Kiseki.</p>"},{"name":"Capcom Classics Collection","year":2005,"developer":"Capcom Entertainment, Inc.","url":"PS2_COLLECTION_PART4/Capcom%20Classics%20Collection%20%28Europe%29.zip","filesize":2522308616,"score":7.9,"genres":"Compilation","desc":"<p>A compilation of 22 of Capcom's greatest hits from its arcade catalog. Also featured are concept artwork and other special features to enhance the experience of revisiting these classics.</p><p>The games included are:</p><ul><li>1942</li><li>1943</li><li>1943 Kai</li><li>Bionic Commando</li><li>Commando</li><li>Exed Exes</li><li>Final Fight</li><li>Forgotten Worlds</li><li>Ghost 'N Goblins</li><li>Ghouls 'N Ghosts</li><li>Gun.Smoke</li><li>Legendary Wings</li><li>Mercs</li><li>Pirate Ship Higemaru</li><li>Section Z</li><li>Son son</li><li>Street Fighter 2</li><li>Street Fighter 2 Hyper Fighting</li><li>Street Fighter 2 Champion Edition</li><li>Super Ghouls' N Ghosts</li><li>Trojan</li><li>Vulgus</li></ul>"},{"name":"Capcom Classics Collection: Volume 2","year":2006,"developer":"","url":"PS2_COLLECTION_PART4/Capcom%20Classics%20Collection%20Vol.%202%20%28Europe%29.zip","filesize":2704164584,"score":7.4,"genres":"Compilation","desc":"<p>This collection contains 20 original Capcom titles. It is a selection of the new games from Capcom Classics Collection Remixed (PSP), the three new games from Capcom Classics Reloaded (PSP) and two games (<em>Super Street Fighter II Turbo</em> and <em>Tiger Road</em>) that did not appear in a Capcom Classics collection before. The games are upscaled from their original resolutions with anti-aliasing, showing soft images with blurry details. The following games are included:</p><ul><li>1941: Counter Attack</li><li>Avengers</li><li>Black Tiger</li><li>Block Block</li><li>Captain Commando</li><li>Eco Fighters</li><li>King of Dragons</li><li>Knights of the Round</li><li>Last Duel</li><li>Magic Sword</li><li>Mega Twins</li><li>Quiz &amp; Dragons: Capcom Quiz Game</li><li>Side Arms Hyper Dyne</li><li>The Speed Rumbler</li><li>Street Fighter</li><li>Strider</li><li>Super Street Fighter II Turbo</li><li>Three Wonders</li><li>Tiger Road</li><li>Varth: Operation Thunderstorm</li></ul><p>You can unlock cheats and training videos, and view the original game art along with the history of the games.</p>"},{"name":"Capcom Fighting Evolution","year":2004,"developer":"Capcom Production Studio 2","url":"sony_playstation2_c/Capcom%20Fighting%20Evolution%20%28USA%29.zip","filesize":256177565,"score":5.9,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p><em>Capcom’s Fighting Evolution</em> is the ultimate classic head-to-head brawler to date! And by classic we mean Classic! Fighting Evolution includes characters from not only Street Fighter II, Street Fighter III, and Street Fighter Alpha, but also from bone crushing favorites Darkstalkers and Red Earth. Even as you’re at your last wits unlocking the hidden characters, each familiar face will bring a smile to any gamer.</p><p>Each and every character maintains their original fighting styles, so strategy is king in this rumble. Picking the right character is your key to victory. This comes into play especially in the two-on-two team battles, as well as the wide variety of other gameplay modes available, and all of it in classic 6 button control scheme!</p>"},{"name":"Capcom vs. SNK 2 Millionaire Fighting 2001","year":2008,"developer":"Capcom Co., Ltd.","url":"sony_playstation2_c/Capcom%20vs.%20SNK%202%20-%20Millionaire%20Fighting%202001%20%28Japan%29.zip","filesize":173388979,"score":"","genres":"Action > Compilation > Side view > Fighting > Licensed","desc":"<p>This special value pack contains two of Capcom's classic fighting games. It does include:* Capcom Vs. SNK 2: Millionaire Fighting 2001</p><ul><li>Street Fighter III 3rd STRIKE -Fight For The Future-</li></ul>"},{"name":"Capcom vs. SNK 2: Mark of the Millennium","year":2001,"developer":"Capcom Co., Ltd.","url":"PS2_COLLECTION_PART4/Capcom%20vs.%20SNK%202%20-%20Mark%20of%20the%20Millennium%202001%20%28Europe%29.zip","filesize":173454008,"score":7.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>A fighting game with characters taken from many Capcom and SNK games. The game system is centered around \"grooves\" which are selected before any battle. These different grooves alter the character's abilities to resemble different Capcom or SNK games. There are three grooves dedicated to each company, and even the option to define a custom groove.</p><p>The \"EO\" of the GameCube and Xbox titles refer to a new groove: Easy Operation. Instead of the normal inputs needed to do special and super moves, these moves are instead done automatically by tapping the right thumb-stick in specific directions. Only a small part of each character's move set can be accessed this way, however, and if the player does not select EO then the game will play the same as the arcade and previous releases.</p><p>Playable characters come from the following games:* Street Fighter (Ryu, Ken, Eagle, Sagat)* Final Fight (Rolento)* Street Fighter II (Guile, Chun-Li, Blanka, Dhalsim, E. Honda, Zangeif, M. Bison, Balrog, Vega)* Final Fight 2 (Maki)* Super Street Fighter II (Cammy)* Super Street Fighter II Turbo (Akuma/Gouki)* Street Fighter Alpha (Dan)* Street Fighter Alpha 2 (Sakura, Shin Akuma/Gouki, Evil Ryu)* Darkstalkers (Morrigan)* Street Fighter III (Yun)* Rival Schools (Kyosuke)* Psycho Soldier (Athena)* Fatal Fury (Terry, Joe, Raiden, Geese)* Art of Fighting (Ryo, Yuri, King, Todoh)* Fatal Fury 2 (Kim, Mai)* Samurai Shodown (Haohmaru, Nakoruru)* The King of Fighters '94 (Kyo, Benimaru, Chang&amp;Choi, Rugal)* The King of Fighters '95 (Iori)* Fatal Fury 3 (Yamazaki)* The King of Fighters '96 (Vice)* The King of Fighters '97 (Orochi Iori)* The Last Blade 2(Hibiki)* Fatal Fury: Mark of the Wolves (Rock)</p>"},{"name":"Captain Scarlet","year":2007,"developer":"Brain in a Jar Ltd.","url":"PS2_COLLECTION_PART4/Captain%20Scarlet%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":100091474,"score":"","genres":"Action > Racing / Driving > Behind view > Shooter > Automobile > Sci-fi / futuristic > Licensed","desc":"<p><em>Captain Scarlet</em> is a 3D racing/shooter game based on the TV series <em>Captain Scarlet and the Mysterons</em> (1967-1968). The player takes control of Captain Scarlet who has to protect the world from the Mysterons, an alien race wanting revenge for the destruction of their base on Mars by Captain Black.</p><p>In the game captain scarlet takes on missions to thwart the plans of the Mysterons. These missions include escorting V.I.P.s, rescuing Captian Blue, destroying a bomb truck and delivering supplies in time. While playing, the player will drive two different vehicles that can fire projectiles - the Spectrum patrol car and Spectrum pursuit vehicle.</p>"},{"name":"Car Racing Challenge","year":2004,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART4/Car%20Racing%20Challenge%20%28Europe%29.zip","filesize":132423562,"score":"","genres":"Racing / Driving > Behind view > Direct control > Automobile > Street racing","desc":"<p>ACCIDENTS, CAR THEFTS, CHECK POINTS... SPEED ALONG THE TOKYO-NAGOYA FREEWAY WITH NO RULES!<br>* A real 4-hour car chase, at top speed, on the freeway<br>* 58 different car models.<br>* The real landscape of the Nagoya-Tokyo freeway has been recreated!<br>* Six breathtaking levels.</p>"},{"name":"Carmen Sandiego: The Secret of the Stolen Drums","year":2004,"developer":"Artificial Mind & Movement","url":"PS2_COLLECTION_PART4/Carmen%20Sandiego%20-%20The%20Secret%20of%20the%20Stolen%20Drums%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":2656555218,"score":6.3,"genres":"Action > 1st-person > Behind view > Platform > Puzzle elements > Stealth > Direct control > Detective / mystery","desc":"<p>Cole Gannon, a rookie in the ACME detective agency finds a set of GPS coordinates on the agency's computer server, which leads him to a museum in New York. The GPS coordinates involve a case dealing with the infamous thief Carmen Sandiego, who Cole wants to capture despite being still just in training. It seems Carmen wants to put back together a set of stolen tribal drums that will unleash an unspeakable power. </p><p>There are two other ACME operatives, Jules and Shadow, who are working on the case in Siberia at the moment so they can only help Cole with advice through email messages.</p><p>The game consists of exploring nine different locales all over the world from New York to Thailand. Each locale is broken down into several areas. Each area has different items to collect. The main items to collect are compasses. These will help in locating Carmen Sandiego's whereabouts. Another item Cole can collect is puzzle pieces. Collecting these will unlock a jigsaw puzzle for Cole to solve.</p><p>Also for Cole to make his way through areas, he has to defeat some enemy combatants who possess key codes. A few key codes are needed to unlock forcefields, which block the pathways to get further into the area. To defeat enemies, Cole is equipped with a staff he can use to whack enemies with. He also comes equipped with a dart gun, which he can use to hit switches he can't reach otherwise. Cole must also move stealthily through each area to avoid security measures and to get a drop on unsuspecting enemy units. Cole has other moves he can perform such as pole vaulting with his staff, rolling from a crouch position, pressing his body close to a wall, double jumping, tightrope walking, and hanging from ledges, pipes, and even ziplines.</p><p>During the game, players can access a menu with various tabs. The atlas tab gives educational factoids about the area Cole is in. The map tab gives detailed information about the area that Cole is currently exploring. The GPS tab gives information about where Carmen Sandiego will be heading next. The transport tab lets the player go back to the areas they previously explored in their current location. The communication tab lets the player receives messages from Jules and Shadow..</p>"},{"name":"Carol Vorderman's Sudoku","year":2007,"developer":"Atomic Planet Entertainment Limited","url":"PS2_COLLECTION_PART4/Carol%20Vorderman%27s%20Sudoku%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3952472810,"score":"","genres":"Puzzle > Top-down > Licensed","desc":"<p>A simulation of a sudoku game. Included is a classic mode, four arcade modes centered around accuracy and speed, and career and Challenge Carol modes that ask you to complete increasingly difficult puzzles in a time limit. Classic and arcade modes have four difficulty levels for puzzles.</p><p>Multiplayer modes include Free For All, where both players work on the same puzzle at the same time, competing to fill in the most squares, Quickfire, where players take turns filling in squares, and the winner is the fastest, and Time Attack, which gives each player a separate puzzle, and the winner is the one who completes their puzzle fastest. All multiplayer modes have adjustable handicaps.</p><p>Finally, tutorial videos and a sudoku solver are included. Stats are tracked across games, and are saved to memory card.</p>"},{"name":"CART Fury: Championship Racing","year":2001,"developer":"Midway Games, Inc.","url":"PS2_COLLECTION_PART4/CART%20Fury%20-%20Championship%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1652698043,"score":6.5,"genres":"Racing / Driving > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>CART Fury is one of Midway's more realistic arcade racing titles.  It features the Championship Auto Racing Teams license, championship drivers including Jimmy Vasser and Michael Andretti, and actual CART race courses such as Chicago Motor Speedway and Surfers Paradise, Australia.  The game is similar to the Cruis'n and Thunder series with its checkpoints and fantasy tracks, except that you have a Boost Meter you use to get ahead of the other drivers.  The If you complete a lap within a designated time, you get Superboost--a trail of fire to leave the other drivers in the dust!</p><p>The different modes in the PS2 version are Arcade, Simulator, Season, Sub-Games, and Driving 101.  Frantic sub-games include a time trial/practice mode and \"Last Man Standing,\" appropriately named because your opponents will try wear you down!  In addition, there are 12 secret cars, and you can watch unlocked cinema scenes in the Danny Sullivan Theater.</p>"},{"name":"Cart Kings","year":2011,"developer":"GameShastra Inc.","url":"PS2_COLLECTION_PART4/Cart%20Kings%20%28India%29%20%28En%2CHi%29.zip","filesize":476717148,"score":"","genres":"Racing / Driving > Behind view > Street racing > Licensed","desc":"<p>This licensed racing game features characters from the popular comics magazines <em>Tinkle</em> and <em>Amar Chitra Katha</em>. Characters race through streets and around famous monuments in bullock carts, with gameplay similar to classic games like Super Mario Kart.</p>"},{"name":"Cartoon Kingdom","year":2006,"developer":"The Code Monkeys Ltd.","url":"PS2_COLLECTION_PART4/Cartoon%20Kingdom%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":41401725,"score":"","genres":"Educational > Side view > Top-down > Mini-games > Point and select > Graphics / art > Pre-school / toddler","desc":"<p><em>Cartoon Kingdom</em> features the following minigames for kids:</p><ul><li>Character Dresser</li><li>Dot to Dot Activity</li><li>Simon Activity</li><li>Pairs Activity with 16, 24 and 32 cards</li><li>Block Swap Activity with 3x3, 4x4, 5x5 and 6x6 icons</li></ul><p>There are variations of these games that are playable for different characters, including dalmatians and crazy bears.</p>"},{"name":"Cartoon Network Racing","year":2006,"developer":"Eutechnyx Limited","url":"PS2_COLLECTION_PART4/Cartoon%20Network%20Racing%20%28Europe%29.zip","filesize":2984104612,"score":5.7,"genres":"Racing / Driving > 3rd-person (Other) > Behind view > Real-time > Arcade > Automobile > Licensed","desc":"<p>Much like the DS version, <em>Cartoon Network Racing</em> is a kart racer along the lines of <em>Mario Kart</em>, where players race one of several characters from various Cartoon Network shows (Johnny Bravo, Dexter's Lab, Cow and Chicken, The Powerpuff Girls, I Am Weasel and Courage the Cowardly Dog) and use weapons and power ups to beat opponents. </p><p>The major difference here is that the game includes dual riders like <em>Mario Kart Double Dash</em> - one to drive, and one to utilize various weapons. The karts have different stats, and so do the co-drivers, who have various \"toon powers\" - such as shields, speed boosts, damage output and flying capabilities. </p><p>The game includes various modes typical of racing games, such as tournament mode, battle mode and elimination races, with tournament unlocking new drivers and courses, and bonuses such as full episodes from the various shows. The game allows for 2 player multiplayer.</p>"},{"name":"Carwash Tycoon","year":2006,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART4/Carwash%20Tycoon%20%28Europe%29.zip","filesize":19550059,"score":"","genres":"Simulation > Diagonal-down > Side view > Managerial / business simulation > Point and select > Automobile","desc":"<p><em>Carwash Tycoon</em> is a simulation that puts you as the manager of your own car wash business. You start off as a simple car washer, but as the game progresses you gain the ability to manage other parts of your business, including the ability to hire staff, launch advertising campaigns, running customer surveys and opening new car wash sites.</p>"},{"name":"Casino Challenge","year":2003,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART4/Casino%20Challenge%20%28Europe%29.zip","filesize":419676056,"score":"","genres":"Gambling > Strategy > 1st-person","desc":"<p><em>Casino Challenge</em> is a single player compilation of mini casino games.</p><p>The player starts a game with £100 stake money and gambles away on either Horse-racing, Blackjack, Roulette or Slot Machines. The game has sixteen avatars to choose from and the player's winnings are ranked against the remaining fifteen in a league table. All the following games are played as single player games and </p><p>Horse-racing: The player places win, place or show bets on races between five horses. When the bets are placed the game shows a video of real horses racing with commentary, winnings and losses are calculated and the player gets to do it all again.</p><p>Blackjack: This is a fairly standard single deck Blackjack game, blackjack pays 3 to 2, insurance pays 2 to 1, and there is no limit to the bet that can be made.</p><p>Roulette: Again a standard implementation that supports all the regular bets but has no preservation of the player's betting pattern.</p><p>Slot machines: There are three machines to choose from Cel Damage, Seek and Destroy, and Road Trip. The first two are single line machines while Road Trip has three winning lines and all machines support one, two or three pound bets</p>"},{"name":"Casper and the Ghostly Trio","year":2006,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART4/Casper%20and%20the%20Ghostly%20Trio%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":51314480,"score":"","genres":"Action > Behind view > Side view > Platform > Fantasy > Licensed","desc":"<p><em>Casper and The Ghostly Trio</em> is a 3D platform game starring Casper the Friendly Ghost. Casper's uncles Fatso, Stinkie and Stretch have kidnapped his friend Wendy the Good Little Witch. They plan on misusing her magic to rule over Ghostland.</p><p>In the game the player takes control of Casper and explores the six levels in search of Wendy. Gameplay includes platforming as well as collecting four key in each map. Sometimes objects like crates have to be moved to reach certain areas. </p><p>Casper also has the ability to shoot at various ghostly enemies and additional health (blue hearts) can be collected. Between the stages a bonus level has to be played from a side view perspectivem where the player collects gems while staying ahead of danger.</p>"},{"name":"Casper: Spirit Dimensions","year":2001,"developer":"Lucky Chicken Games, Inc.","url":"PS2_COLLECTION_PART4/Casper%20-%20Spirit%20Dimensions%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":458906270,"score":6.9,"genres":"Action > Behind view > Arcade > Shooter > Flight / aviation > Licensed","desc":"<p>Casper is an action-adventure game based upon the children’s character Casper the friendly ghost.  Casper offers the players the ability to fly a ghost with complete freedom around 3D worlds, blasting things with his range attacks and collecting pick-ups to enhance them.  There are also simple collection and navigation puzzles.  The game has 16 levels and 4 bosses leading up to the final battle with his nemesis Kibosh.  </p><p>The story for the game is that Kibosh has taken over the spirit world (home of all the ghosts) and is amassing an army to invade the real world.  Casper is the last remaining free ghost.  Kibosh didn’t really think he needed to worry about the little guy and just to be sure that it won’t be a problem he has kidnapped Casper’s best friend, Wendy Witch.</p>"},{"name":"Casper's Scare School","year":2008,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART4/Casper%27s%20Scare%20School%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.zip","filesize":42821948,"score":"","genres":"Action > Racing / Driving > Behind view > Platform > Licensed","desc":"<p>GET SET FOR SPOOKTACULAR FUN!<br>Casper the Friendly Ghost has been sent to Scare School by his three uncles, but there's no time for lessons while school bully Thatch the Vampire is up to no good!<br><br>Together with his new friends Mantha the Zombie and Ra the Mummy, Casper must race around Scare School as fast as he can to stop Thatch from carrying out his evil plan to turn everyone into stone!<br>Compete with your friends in the awesome four-person multiplayer mode! * Captain your own haunted pirate ship and race around the amazing Scare School! * Help Casper and his friends in this brilliant adaption of the TV movie Casper's Scare School.</p>"},{"name":"Castle Shikigami 2","year":2004,"developer":"AlfaSystem Co., Ltd.","url":"PS2_COLLECTION_PART4/Castle%20Shikigami%202%20%28Europe%29.zip","filesize":439905420,"score":6.5,"genres":"Action > Top-down > Anime / Manga > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Sequel to Shikigami no Shiro, SS2 is a vertical-scrolling shooter with sci-fi elements.</p><p>As in most games in the genre, the game puts you in control of a small fighter as you attempt to make your way past several stages filled with enemy ships charging and attacking you in different patterns.</p><p>The game features 7 distinct characters with psychic powers (which manifest in-game as bomb-type attacks and other special moves) and unique fighters, and the game features a story mode for each character, in which they have different dialogues and plot sequences for each boss fight.</p><p>Also included is a weapon system similar to Psyvariar's in which you can enhance your power and rate of fire by scraping incoming bullets.</p>"},{"name":"Castlevania: Curse of Darkness","year":2005,"developer":"Konami Corporation","url":"PS2_COLLECTION_PART4/Castlevania%20-%20Curse%20of%20Darkness%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3144040038,"score":7,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Fantasy","desc":"<p>In <em>Castlevania: Curse of Darkness</em> you play Hector, a former Dracula servant and a Devil Forgemaster, who disowns his dark gifts and aims to live a normal life. This event left Dracula vulnerable to the attacks of the Belmont clan. Now that Dracula is vanished, you must fight back the curse cast upon all Europe. There is but one problem, another Dracula servant does not approve with your plan.</p><p>Being a Devil Forgemaster now gives the player an ability to forge familiars to fight by your side. As the player himself, they have levels and they can even morph to a different stage depending which weapon you use to fight with them.</p><p>The game has some basic role-playing elements such as character attributes and experience. Unlike Castlevania: Lament of Innocence, you are now able to use many types of weapons: Axes, swords, spears, knuckles and even shields for example. You can also craft your own weapons either by using an existing weapon as a base, and having some additional material such as bronze, steel and aluminium or having an extra amount of materials.</p><p>The battle system allows you to lock on to an enemy and hit them with multiple combos. You have some control on your Innocent Devil, and can command it to use certain skills, guard you and join the fight.</p>"},{"name":"Castlevania: Lament of Innocence","year":2003,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"sony_playstation2_c/Castlevania%20-%20Lament%20of%20Innocence%20%28USA%29.zip","filesize":2510085352,"score":7.7,"genres":"Action > 3rd-person (Other) > Hack and slash > Platform > Fantasy","desc":"<p><em>Castlevania: Lament of Innocence</em> is the prequel to all Castlevania games previously released, explaining the connection and never-ending war between the Belmont family and Dracula. </p><p>You play Leon Belmont, who was once a Baron for the King. After his betrothed, Sara, was kidnapped and taken to a large castle, Leon asked the Church for permission to command his underlings to attack the castle. Because of the Crusades going on in the East, he is denied such. But because of his love for Sara, he denounces his title and leaves, going with no weapon or clue to the castle. He is stopped by an alchemist named Rinaldo, who was once a vampire-hunter himself. He gives Leon the Whip of Alchemy, offers to help him further in his quest, and sends him on his way.</p><p>The gameplay mixes a style of hack-and-slash with a sense of strategy. In order to gain new abilities, you must first master the previous ones. This also includes relics and orbs, which will greatly help you in your quest to rescue Sara. Relics allow you to do special abilities necessary to solving certain puzzles, while orbs combine with power-ups you pick up and can create massive offensive or defensive power. The game contains many secrets, including five hidden bosses, who yield rewards (whip power-ups, orbs, relics, etc.) to the player upon defeat.</p>"},{"name":"Catwoman","year":2004,"developer":"Argonaut Games PLC","url":"PS2_COLLECTION_PART4/Catwoman%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CDa%29.zip","filesize":1230831849,"score":4.9,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>Another licensed title by EA, based on the movie with the same name, starring Halle Berry. The game follows the film's plot and its models and graphics are based upon the respective characters and locations as seen in the movie. Halle Berry also lends her voice to the character, aside from her likeness.</p><p>Catwoman has an impressive array of powers at her disposal with which to overcome obstacles and fight her enemies. The gameplay is split between overcoming obstacles using Catwoman's agility and whip, and defeating (but not killing) enemies using her abilities and the aforementioned whip, again.</p>"},{"name":"CaveMan Rock","year":2007,"developer":"CyberPlanet Interactive Public Co., Ltd.","url":"PS2_COLLECTION_PART4/Caveman%20Rock%20%28Europe%29.zip","filesize":31471856,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Tile matching puzzle > Direct control > Prehistoric","desc":"<p>Caveman and dinosaurs have lived in peace together for centuries in the Green Village. One day, a volcano nearby the village erupts!<br>Both the Caveman and Dinosaurs are confronted with loosing their homes.<br>Destroy as many lava rocks as possible that accumulate from the volcano eruption.<br>Hurry up!! The hot burning lava begins to flood the village!<br>Can you stop the village from being destroyed with the help of the dinosaurs?</p>"},{"name":"Cel Damage Overdrive","year":2003,"developer":"Pseudo Interactive, Inc.","url":"PS2_COLLECTION_PART4/Cel%20Damage%20Overdrive%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":346232336,"score":6.7,"genres":"Action > Racing / Driving > Behind view > Automobile > Track racing","desc":"<p>A vehicular combat game set in a cartoon universe with 12 different environments. Wield a massive chainsaw, giant axe or one of 34 other wild weapons. There are 3 gameplay modes: Smack Attack (smack your opponents to gain points), Gate Relay (Pass the Checkpoints 5 times before your enemies do), and Flag Rally (CTF). 6 playable characters with 4 unlockable guest stars. For 1 to 4 players.</p>"},{"name":"Centre Court: Hardhitter","year":2001,"developer":"Magical Company Ltd.","url":"sony_playstation2_c/Centre%20Court%20-%20Hard%20Hitter%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%29.zip","filesize":330497620,"score":"","genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p><em>Centre Court: Hardhitters</em> is a tennis game that can be played by up to four players if a PlayStation multitap is used, and it has English, French and German language options.</p><p>The game has three modes of play:* Training: here a player practices returning balls that are hit at/to them</p><ul><li><p>Arcade: where the player challenges six of the eight supplied AI opponents, no real tennis players are licensed by this game</p></li><li><p>Exhibition: where up to four players can compete.</p></li></ul><p>Four kinds of tennis court are represented, grass, clay, lawn and indoor. The game has save/load functions, and a create-a-player function. Players are created in the Arcade mode game, they can develop and gain experience by playing in the Arcade and Exhibition matches but there is no career or tournament mode in this game.</p>"},{"name":"ChainDive","year":2003,"developer":"Alvion Co., Ltd","url":"sony_playstation2_c/Chain%20Dive%20%28Japan%29.zip","filesize":656916499,"score":"","genres":"Action > 3rd-person (Other) > Side view > Platform > Sci-fi / futuristic","desc":"<p><em>ChainDive</em> is a 3D side-scrolling action game, similar to Namco's Klonoa. The player controls Shark, a mysterious man clad in powerful biomechanical armor, who is fighting to protect the people living on the planet Elm from a strange otherworldly menace.</p><p>Ostensibly a side-scrolling platformer, the crux of the game system lies in \"chaining\", using Shark's plasma generator to hook onto green \"boid\" points strewn throughout each stage, and using them to swing or launch around at high speed. He also wields a large double-bladed sword which can be used for both attack and defense, and can also use the plasma generator to chain through and destroy enemies.</p>"},{"name":"Champion Dreams: First to Ride","year":2006,"developer":"Lexis Numérique SA"},{"name":"Champions of Norrath","year":2004,"developer":"Snowblind Studios, Inc.","url":"PS2_COLLECTION_PART4/Champions%20of%20Norrath%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":7175187582,"score":8.1,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Real-time > Action RPG > Hack and slash > Fantasy","desc":"<p><em>Champions of Norrath</em> is an bird's-eye view action RPG and dungeon crawler based on the EverQuest universe. There are five character classes to choose from (Barbarian Warrior, Wood Elf Ranger, High Elf Cleric, Dark Elf Shadow Knight, Erudite Wizard), each may be male or female. The game spans five acts that cover various randomly generated locations across the world of Norrath.</p><p>Up to four people may play on a single console offline using a multitap, and up to four people online - one per console - via a broadband connection using the Sony Network Adapter.</p>"},{"name":"Champions: Return to Arms","year":2005,"developer":"Snowblind Studios, Inc.","url":"PS2_COLLECTION_PART4/Champions%20-%20Return%20to%20Arms%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":3422241842,"score":7.7,"genres":"Role-playing (RPG) > Diagonal-down > Action RPG > Fantasy","desc":"<p>The sequel to Champions of Norrath, <em>Champions: Return to Arms</em> is an action RPG that puts players in the EverQuest universe. The evil Innoruuk was destroyed and his remains (shards) have been scattered throughout the Planes of Power. The player must find the shards and choose between good or evil: Destroy them to rid of Innoruuk or collect them to restore him.</p><p>The game has seven playable races (two new ones from the original) and more online features. Players can import characters from the first game. It can be played single-player or with up to four players (online or with multitap).</p>"},{"name":"Championship Manager 2006","year":2006,"developer":"Gusto Games Ltd.","url":"PS2_COLLECTION_PART4/Championship%20Manager%202006%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%2CPt%29.zip","filesize":143628309,"score":"","genres":"Simulation > Sports > Strategy > Diagonal-down > Text-based / Spreadsheet > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p>The console version of <em>Championship Manager 2006</em> is in many ways similar as the PC version. Players select a club from one of many different countries and play the manager's role, taking charge of tactics, training, signing new players, negotiating contracts etc. The game is very statistics heavy and assumes a fairly deep knowledge of the football game, setting it apart from its more accessible competitors.</p><p>Since this version was released some months after the PC version it features updated stats to reflect changes in the leagues. Additionally it features new camera angles for viewing the playing field and a new interface more intuitive for the consoles.</p>"},{"name":"Championship Manager 2007","year":2007,"developer":"Beautiful Game Studios","url":"PS2_COLLECTION_PART4/Championship%20Manager%202007%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%2CPt%29.zip","filesize":111597734,"score":"","genres":"Simulation > Sports > Strategy > Diagonal-down > Text-based / Spreadsheet > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p>The console version of <em>Championship Manager 2007</em> is in many ways similar to the PC version. Like previous editions the player takes on the role of a football club manager and has to perform tasks like taking charge of tactics, training, signing new players, negotiating contracts etc.</p><p>The game features over 60 different competitions in 26 different countries. The player is free to choose a team from any of these competitions. Another possibility is to manage national teams. Matches can be viewed in a quasi 3D view where players can select from various camera angles.</p>"},{"name":"Championship Manager 5","year":2005,"developer":"Beautiful Game Studios","url":"PS2_COLLECTION_PART4/Championship%20Manager%205%20%28Europe%2C%20Australia%29%20%28En%2CSv%2CNo%2CDa%29.zip","filesize":131992961,"score":5.9,"genres":"Simulation > Sports > Strategy > Text-based / Spreadsheet > Top-down > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p>Football (soccer - damn yankees!) management simulation, for the PC. Player takes the role of a club manager responsible for the day to day running of a club in one of 26 countries. Duties include buying and selling players, arranging contracts, setting training schedules and organizing match day tactics. An interactive match day football simulation is at the heart of the game.</p>"},{"name":"Chandragupta: Warrior Prince","year":2011,"developer":"Immersive Games Limited","url":"PS2_COLLECTION_PART4/Chandragupta%20-%20Warrior%20Prince%20%28India%29%20%28En%2CHi%29.zip","filesize":457624988,"score":"","genres":"Action > 3rd-person (Other) > Asia > Historical events","desc":"<p><em>Chandragupta: Warrior Prince</em> is a 3D action game based on historical events. The game is set in 323 B.C in Ancient India and tells the story of the warrior prince Chandragupta, the Emperor of the Mauryan Empire and the first to unite the territory of what is now known as India.</p><p>The game consists of nine levels and there are also some platform elements. The prince can be moved around freely, but there is a linear path to follow. He fights with a sword, a bow etc. and can perform three types of moves that lead to ten different combos. By attacking enemies with combos a gauge is filled up. When it is full reinforcements can be called in for difficult situations and arrows rain down. Collected gold can be used to upgrade weapons. There are also a number of sliding tile puzzles where an image needs to be restored. There are different difficulty levels and a Legend mode with tougher enemies.</p>"},{"name":"Chanter: Kimi no Uta ga Todoitara","year":2007,"developer":"Interchannel-Holon Inc.","url":"sony_playstation2_c/Chanter%20-%20Kimi%20no%20Uta%20ga%20Todoitara%20%28Japan%29.zip","filesize":4413258169,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>A port of a PC version called Chanter: Kimi no Uta ga Todoitara which adds new character (Rina, Yuki's sister), additional CG events, revisioned existing and newly added scenario, and a new opening cinematic, beside the obvious dulled down of adult content.</p><p>You play as Mikiya, a third grade school student. During the summer holidays he met a couple of girls from the same school, Yuki and Sakura. But as the school classes continued after the holidays, he found out that the teacher he really respected and liked since he was much younger is about to leave for the States, together with his childhood friend, Chitose; he decided to make a farewell song for the school's festival in October.</p><p>This visual novel follows the tradition of the genre by giving you occasional choice during dialogues that may affect and branch the story in one way or another.</p>"},{"name":"Chaos Field","year":2005,"developer":"Able Corporation","url":"sony_playstation2_c/Chaos%20Field%20-%20New%20Order%20%28Japan%29.zip","filesize":1058117576,"score":5.9,"genres":"Action > Top-down > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>Chaos Field is a top-down space shooter similar in concept to the Gradius series, or Ikaruga. You control one of three ships, each with their own pilot and unique weapon systems. </p><p>The game takes place over 5 phases, in each phase you face a number of boss battles. Unlike other games in this genre, almost the entire game is composed of boss battles, each boss requiring a different strategy to defeat. </p><p>The game also uses a unique in-game difficulty adjuster. Called \"fields\", you can play in either Order or Chaos. Compared to Order, the Chaos Field offers you increased firepower and abilities but also does the same for your enemies. Order Field is more relaxed on both sides. If you can play in the Chaos Field, you stand to gain substantially more points.</p>"},{"name":"Chaos Legion","year":2003,"developer":"Capcom Co., Ltd.","url":"PS2_COLLECTION_PART4/Chaos%20Legion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1935485253,"score":6.7,"genres":"Action > Behind view > Cinematic camera > Free-roaming camera > Hack and slash > Fantasy","desc":"<p>The story of <em>Chaos Legion</em> is based on a light novel of the same name, written by the Japanese author Tow Ubukata. The events begin in the year 791 A.S. (Anno Satanis). The protagonist of the game is a Knight of the Dark Glyphs named Sieg Wahrheit. His best friend, Victor Delacroix, blames him for the death of Siela, Victor's sister and Sieg's lover. Unable to contain his despair, Victor decides to \"purify\" the sins of the world by unleashing hordes of monsters and finding three sacred glyphs to resurrect the evil spirit Azrail, who would eventually obliterate all existence.</p><p><em>Chaos Legion</em> is an action game with a heavy emphasis on melee combat. The game's stand-out feature is Sieg's ability to summon the so-called Chaos Legions. Named after various emotions (Guilt, Hatred, Malice, etc.), these Legions have different combat styles, strengths, and weaknesses. Sieg himself is weakened once a Legion is being summoned, and has to rely on their powers to survive. The legions can be assigned general combat tactics, but are otherwise controlled by the AI. They can be upgraded during the course of the game, increasing their attack power, duration of their presence, etc.</p>"},{"name":"Chaos Wars","year":2006,"developer":"Idea Factory Co., Ltd.","url":"sony_playstation2_c/Chaos%20Wars%20%28USA%29.zip","filesize":1094352888,"score":6.7,"genres":"Strategy > Diagonal-down > Anime / Manga > Turn-based > Licensed","desc":"<p>Legend says that in the mountains, there is a cave that leads to another world. There, there is a shrine, where the founder of the village is said to have come from, and where you can pray to a god to have any wish granted. After seeing a pillar of light coming from the mountain in a dream, Hyoma Kusaka, diligent student that he is, ditches class to go take a look along with his friends Shizuku Mizuki and Hayatemaru Mudouin. They find themselves transported to a mysterious world, with no idea how to return.</p><p><em>Chaos Wars</em> is a tactics RPG crossover game featuring characters from numerous game series, including Growlanser, Gungrave, Shadow Hearts, Spectral Force, and Spectral Souls. You can take teams of up to 10 into battle, recruit allies, and upgrade and customize your characters and equipment.</p>"},{"name":"Charlie and the Chocolate Factory","year":2005,"developer":"High Voltage Software, Inc.","url":"PS2_COLLECTION_PART4/Charlie%20and%20the%20Chocolate%20Factory%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":980409888,"score":4.2,"genres":"Action > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p>You play Charlie Bucket, a poor child, on a tour through eccentric confectioner Willy Wonka's fabulous candy factory in this interactive take on the classic children's story.</p><p>As Charlie you will attempt to put the factory in working order, cleaning up the messes created by other children on the tour.  You'll have to run, jump, carry objects, push buttons, and command a small army of Oompa Loompa assistants on the way to winning the ultimate prize:  the factory itself.</p>"},{"name":"Charlie's Angels","year":2003,"developer":"Neko Entertainment SARL","url":"PS2_COLLECTION_PART4/Charlie%27s%20Angels%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1595362045,"score":3.5,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Platform > Licensed","desc":"<p>Play as the three Charlie's Angels girl private investigators in this game based on the characters of the two movie versions played by Drew Barrymore, Cameron Diaz, and Lucy Liu.<br>The franchise started out as a popular 70's television series.  In the game, popular world landmarks are disappearing: the Statue Of Liberty, Arc de Triomphe, Lincoln Memorial, and Stonehenge.   </p><p>The girls must find out who is behind this and start out at a beach beauty pageant runway wearing bikinis and move on through other levels on ships, islands, or monasteries.  The gameplay is a 3D brawler beat'em up where the girls go to various world locations and take out bad guys with kicks, punches, jumps, and combo moves.  They can also block attacks and use blunt objects found in the environment to smash enemies.  Occasionally, there'll be a computer terminal or button to activate, or ladder to climb.  There are some slow-motion and cinematic camera angles at times.Defeat bosses to move onwards.  Hidden throughout the levels are items such as movie reels and memory sticks that when collected can unlock photos and trailers from the movie Charlie's Angels: Full Throttle.</p>"},{"name":"Charlotte's Web","year":2007,"developer":"Atomic Planet Entertainment Limited","url":"PS2_COLLECTION_PART4/Charlotte%27s%20Web%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":148141465,"score":"","genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>A collection of minigames based loosely around the story of the film with the farmyard serving as a central hub that the player returns to after each minigame.</p><p>In total there are 19 minigames, in which the player is given control of 1 of the 3 main characters from the film.In the farmyard area, the player controls  Wilbur the Pig, where he must find various items throughout the farm whilst keeping out of sight of the farmer and his sheepdog.Once a task has been completed on the farmyard, the game then moves to a minigame based loosely on the events of the film.You can control Wilbur in a runaway pram rolling down a hill and must keep the pram balanced until it comes to rest.Some of the games let the player control Templeton the Rat. In one minigame he must hurl rubbish at incoming birds in a rubbish dump using a catapult hastily built from the materials lying nearby. In another he must outpace a runaway egg in some tunnels under the dirt.The last playable character is Charlotte herself. These games generally involve the barn as a backdrop (in a 2D setting)  with the goal of travelling from one side to the other by swinging from webs and dodging obstacles and catching flies.</p>"},{"name":"Cheggers Party Quiz","year":2007,"developer":"The Code Monkeys Ltd.","url":"PS2_COLLECTION_PART4/Cheggers%20Party%20Quiz%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":985064209,"score":4.7,"genres":"Strategy > Fixed / flip-screen > Turn-based > Game show / trivia / quiz > Menu structures","desc":"<p><em>Cheggers Party Quiz</em> is a typical quiz game starring UK TV presenter Keith Chegwin. One playing round consists of eight questions (mostly about movies) and up to four players. Every time a question is asked the players are presented with four answer possibilities. If one of them thinks he knows the answer he buzzes in and selects the answer - if it is correct he receives money. Who has the most money at the end of the round wins. Between the questions Chegwin makes humorous remarks,</p>"},{"name":"Chess Challenger","year":2004,"developer":"Yuki Enterprise","url":"PS2_COLLECTION_PART4/Chess%20Challenger%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":15773781,"score":"","genres":"Simulation > Top-down > Fixed / flip-screen > Chess","desc":"<p>Are you ready for the Ultimate Chess Challenge? The Artificial Intelligence (A.I.) in Chess Challenge is based on the strongest chess engine currently on a games console, with levels of A.I. that will challenge players from novice to expert ability. Fully rendered board and pieces are the perfect visual companion to this full-featured chess game.<br>The game contains great features such as competition style timed games, Special A.I. strategies to avoid repeating End-Game Patterns, a Step Back Function that allows the player to 'wind back' moves great for strategy analysis and player versus Computer or two player mode.</p>"},{"name":"Chessmaster","year":2003,"developer":"Ubisoft SRL","url":"PS2_COLLECTION_PART4/Chessmaster%20%28Europe%29.zip","filesize":3090077400,"score":7.6,"genres":"Strategy > 3rd-person (Other) > Top-down > Isometric > Chess","desc":"<p>The iteration of the Chessmaster series on the PlayStation 2 contains most of the features available in the corresponding PC game - which, in this case, is Chessmaster 9000. You can play training games (with all the hints and analysis tools available), rated games (your rating changes after each play), puzzles (chess ones, not the \"build the picture\" type), learn chess by browsing through the hundreds of tutorials available in the Pandolfini's Chess School or watch famous games.</p><p>There are, however, some new features in the PS2 version; the most useful one is the Online mode. Other is the \"living world\" of the Chessmaster Championships, where the AI's rating changes, too, as they play each other. The last one is more spectacular - a fantasy-themed - orcs vs. humans - game mode with animated chess sets and a 3D environment. You get to play chess in a forest, inside a castle and in the desert.</p>"},{"name":"Chō Aniki: Seinaru Protein Densetsu","year":2003,"developer":"Psikyo"},{"name":"Chō Jikū Yōsai Macross","year":2003,"developer":"SEGA-AM2 Co., LTD."},{"name":"Chocolate: Maid Cafe Curio","year":2005,"developer":"GIGA","url":"sony_playstation2_c/Chocolat%20-%20Maid%20Cafe%20Curio%20%28Japan%29.zip","filesize":1400744553,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Romance","desc":"<p><em>Chocolate: Maid Cafe \"Curio\"</em> is a romantic visual novel revolving around the daily life of managing a coffee shop. After your father remarries and goes on a honeymoon, leaving you alone with your younger sister for three months, you start working at your father's the coffee shop called Curio. Originally released as an adult visual novel for PC (Windows) under the same title, this second console port has all the adult content removed, and all the bonus content of a previously ported Dreamcast version included. Additionally, it features more new content such as updated to gameplay system and new voice-actor for one of the heroines.</p>"},{"name":"Choro Q","year":2003,"developer":"Barnhouse Effect Co., Ltd","url":"PS2_COLLECTION_PART4/Choro%20Q%20%28Europe%29.zip","filesize":791402688,"score":6.1,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator","desc":"<p><em>ChoroQ</em> has been described by many people as a \"CarPG\" in that while you do partake in tons of arcadeish races against other super deformed cars (called ChoroQs in the game), you also drive around three different towns, talking to the ChoroQs and doing quests and mini games.</p><p>There's over 200 different body styles to unlock through the story mode (very few of them actually change the way your ChoroQ handles or performs; they're largely for show) and a wide range of parts you can buy to upgrade your car (either for performance or for looks).</p><p>The game supports two player split screen where you can import your ChoroQs from your own individual adventures and battle each other and also compete against each other in a wide range of minigames.</p>"},{"name":"Choro Q HG","year":2000,"developer":"Barnhouse Effect Co., Ltd","url":"sony_playstation2_c/Choro%20Q%20HG%20%28Japan%29.zip","filesize":734072393,"score":"","genres":"Special edition > Physical extras","desc":"<p>This deluxe version of Gadget Racer (Choro Q HG) includes:</p><ul><li>Choro Q HG game</li><li>A miniature toy car</li><li>A Jenny Hi-Grade figure</li></ul>"},{"name":"Chronicles of Narnia, The: Prince Caspian","year":2008,"developer":"Traveller's Tales (UK) Ltd.","url":"PS2_COLLECTION_PART4/Chronicles%20of%20Narnia%2C%20The%20-%20Prince%20Caspian%20%28Europe%29%20%28En%2CEs%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":2545241451,"score":6.2,"genres":"Action > 3rd-person (Other) > Fantasy > Licensed","desc":"<p><em>The Chronicles of Narnia: Prince Caspian</em> is based off of the novel and movie of the same name, giving the player the opportunity to play as one of 20 different characters, including the four Pevensie children, Lucy, Edmund, Susan, and Peter, as well as Prince Caspian.</p><p>The story takes place 1 Human year or 1,300 Narnian years after the first movie/game, where an evil king called King Miraz has begun to conquer the lands of Narnia and Prince Caspian has summoned the four Pevensie siblings in order to help Narnia and Aslan bring unity back to the lands.</p><p>Gameplay is similar to the first, basically hack-n-slash, moving through levels, battling enemies using each character's unique battling tactics. There are six chapters/levels in all, with puzzles scattered through the levels and special treasure chests that require certain amount of keys to open that will unlock special features such as artwork pictures among others associated with the film. There is also a level made exclusively for the game that was not in the film or in the novel.</p><p>The controls are system-dependent. While PlayStation 2, PlayStation 3, and Xbox 360 uses the D-pad and analog and main buttons, the Wii utilizes the Wii-remote and the PC uses the mouse and keyboard. There is also two-player co-op gameplay that can have a human player drop-in during a game.</p>"},{"name":"Chronicles of Narnia, The: The Lion, the Witch and the Wardrobe","year":2005,"developer":"Traveller's Tales (UK) Ltd.","url":"PS2_COLLECTION_PART4/Chronicles%20of%20Narnia%2C%20The%20-%20The%20Lion%2C%20the%20Witch%20and%20the%20Wardrobe%20%28Europe%29.zip","filesize":2360729038,"score":6.9,"genres":"Action > 3rd-person (Other) > Fantasy > Licensed","desc":"<p>Experience the world of C.S Lewis and Andrew Adamson's book and film. Play as Susan, Edmund, Lucy and Peter from the film, and journey through the Professor's house, the forests of Narnia, and escape the attack on London during World War II. </p><p>Depending on which level you're playing, you'll be able to play as at least two of the four children, although some levels require you to use all four. The four children all have different special abilities. Peter is the strongest of the bunch, so you can use him for fighting off enemies or breaking through barriers. Susan is a ranged fighter and she can throw arrows, tennis balls, and snowballs. Edmund is a decent melee fighter who can climb trees and walk on ice without breaking it. Lucy has the ability to heal the other children, go through small spaces and stand on big snowballs, and make them roll. During each level, you can switch between characters at any time.</p><p>Scattered throughout the levels are coins, pink and green gems, and hidden shields that will give ratings at the end of the levels, ranging from fair to outstanding.</p>"},{"name":"Chulip","year":2002,"developer":"Punchline Co., Ltd.","url":"sony_playstation2_c/Chulip%20%28USA%29.zip","filesize":482800907,"score":6.3,"genres":"Adventure > 3rd-person (Other) > Top-down > Puzzle elements","desc":"<p>A young man and his father are the newest residents of Long Life Town, a strange little town with even stranger characters. It is here that he meets the girl of his dreams - literally. But she wants nothing to do with him. The young man's mission is to improve his reputation among the many inhabitants of the town until they allow him to kiss them, and impress the girl of his dreams with his acts of kindness. </p><p><em>Chulip</em> is primarily a puzzle-solving adventure with a few role-playing elements. The player can freely explore the town, trying to figure out what to do next and how to do it. Kissing people is not as easy as it may seem; actions required to allow a person to be kissed range from waiting for the right moment to more difficult and branching puzzles like helping someone find a job. The more people the hero ends up kissing, the higher his heart meter goes, which allows the player to progress through the story and attempt more challenging tasks. </p><p>Approaching angry townspeople, doing something they don't like, or injuring himself through various means will take away the protagonist's hearts. When all his hearts are gone, the player must restart or restore a saved game. Hearts can also be regained by sleeping, eating, and certain other tasks. Money is earned by kissing Underground residents (who only show up at certain times of the day), or by selling items found in the garbage. It can be used to buy various items that may help the player get further into the game, or train tickets to travel to new areas.</p><p>Created by a team that has split off from Love-de-Lic, the game shares many stylistic and gameplay-related traits with Moon: Remix RPG Adventure (the overall goal of making people happy, exotic characters, \"gibberish\" language with subtitles, day and night cycle, character schedules, etc.).</p>"},{"name":"CID the Dummy","year":2009,"developer":"Twelve Games","url":"PS2_COLLECTION_PART4/CID%20the%20Dummy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":578376570,"score":5.1,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements","desc":"<p><em>CID The Dummy</em> is a platformer featuring, as the title bespeaks,a crash dummy as the protagonist. Cid was endowed special powers by its inventor, professor Werken, andfinds itself charged with the task of saving the daughter of his.Action is represented in 3D while the gameplay is bidimensional in reality,à la Super Mario Galaxy.Levels present to Cid both enemies and puzzles — or, more exactly, obstaclesof intellectual nature — like eluding the sights of security cams orpressing a requested button. A basic attack, plus around ten special moves,is how Cid can strike foes it comes into: each special attack is related with a gesture to be performed with the Wii Remote, with tutorials available to make the player familiarize themselves with.</p>"},{"name":"Cinderella","year":2006,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART4/Cinderella%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":496096453,"score":"","genres":"Puzzle > Fixed / flip-screen > Meditative / Zen > Cards / tiles > Direct control > Europe","desc":"<p>Cinderella for the PS2 is a retelling of the classic fairy tale of the same name. A large part of this game is that it includes an exclusive cartoon on the disc. The cartoon is a  modern update of Cinderella - complete with taxis, a modern city setting and disco dance off.</p><p>From the title screen the player can select a number of game activities such as Pairs, Colouring, Jigsaw puzzle and sliding puzzle. Pairs involves matching cards across a grid to eventually clear them all. Colouring lets the player choose from a selection of colours and with a paint bucket tool not unlike MS Paint fill in sections of a drawing. Jigsaw is exactly as you would expect, the player chooses pieces and drags them onto an empty grid to make a picture from the cartoon. Sliding jigsaw is an interesting take on the traditional jigsaw in that the player both has to flip pieces vertically and horizontally to make them match and that the pieces are animated individually - coming together to make a small loop from the cartoon.</p>"},{"name":"Circuit Blasters","year":2005,"developer":"Supersonic Software Ltd.","url":"PS2_COLLECTION_PART4/Circuit%20Blasters%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":372329371,"score":"","genres":"Action > Racing / Driving > Behind view > Diagonal-down > Direct control > Automobile > Track racing","desc":"<p>A remake of Circuit Breakers. The main noticeable differences are that the graphics have been redone and the difficulty has been increased.</p><p>Players get to race 7 other cars through 5 distinct locales. These locales are Jungle, Highway, Egypt, Swamp, and Subaqua (cars submerged in water racing). Each locale has two unique track layouts. Reversed versions of these tracks can also be played once the player conquers the originals. It should be noted that this is a reduction from <em>Circuit Breakers</em> which featured 16 unique track layouts.</p>"},{"name":"Circus Linux!","year":2008,"developer":"New Breed Software"},{"name":"Circus Maximus: Chariot Wars","year":2002,"developer":"Kodiak Interactive Software Studios, Inc.","url":"PS2_COLLECTION_PART4/Circus%20Maximus%20-%20Chariot%20Wars%20%28Europe%29.zip","filesize":833600166,"score":6.6,"genres":"Action > Racing / Driving > 1st-person > Behind view > Classical antiquity","desc":"<p><strong>Circus Maximus</strong> is a racing game that takes place in ancient Rome, and as such you'll be racing chariots around various tracks, including the famed Colliseum.</p><p>You'll be in control of both the driver and your partner, the warrior, whose job is to attack the other racers to make them fall over. Chariots are controlled by whipping horses and trying to balance an on-screen meter that keeps your chariot balanced while taking turns fast.</p><p>There are four different race modes available; Training, which gives you the basics on how to play, Arcade, which is your standard race, Multiplayer, which lets you face off against three friends (or foes), and Career, which tracks your progress over a period of time.</p><p>There are seven different environments and 19 tracks, all set throughout the Roman Empire.</p><p>Each course is littered with obstacles, power ups, weapons, and special moves, designed to give you an edge in combat.</p>"},{"name":"City Crisis","year":2001,"developer":"Syscom Entertainment Inc.","url":"PS2_COLLECTION_PART4/City%20Crisis%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":506356841,"score":6,"genres":"Action > Simulation > 3rd-person (Other) > Helicopter","desc":"<p>City Crisis is a helicopter rescue game. Your goal in this game is to move your chopper from accident to accident and rescue people from burning buildings.  Your helicopter is also equipped with a fire-fighting water cannon to stop the blazes.  You are scored on how many people you manage to rescue, how much fire damage you prevent, and how quickly you complete all the mission objectives.</p><p>In addition to the standard rescue mode, City Crisis offers a chase mode.  In chase mode, you use your helicopter to assist the police in a car chase.  You have to keep your spotlight on the suspect's car until the police can stop them. </p><p>City Crisis also has a time-trial mode, where you have to fly your helicopter through a set of floating rings as fast as possible.</p>"},{"name":"City Racer","year":2003,"developer":"Ubi Soft SRL"},{"name":"City Soccer Challenge","year":2005,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART4/City%20Soccer%20Challenge%20%28Europe%2C%20Australia%29.zip","filesize":56503959,"score":"","genres":"Sports > Top-down > Persistent > Direct control > Football (European) / Soccer","desc":"<p><em>City Soccer Challenge</em> is a cartoonish soccer sim which focuses on fun game play rather than realism like other popular titles (FIFA, PES, etc). One feature of the game which is unique is the skill point system, which when built up over the source of a game enable trick and power shots to help you crush your opponents - be they AI or best friend.</p>"},{"name":"Civil War: Secret Missions","year":2008,"developer":"Cauldron Ltd."},{"name":"Clannad","year":2006,"developer":"Key Co., Ltd.","url":"sony_playstation2_c/Clannad%20%28Japan%29.zip","filesize":2798993105,"score":8.3,"genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Tomoya Okazaki is a third year high school student whose mother died when he was young, leaving his father to raise him. Severe drinking problems caused Tomoya's father to become violent; during one of the quarrels, he injured his son. Their relationship has seemingly improved since then, but Tomoya's injuries, mental and physical, have led him to a delinquent life. This changes when he meets Nagisa Furukawa, a soft-spoken girl who gets sick easily. Tomoya begins to help her reform a drama club she failed to join last year, and gradually changes his view about life.</p><p><em>Clannad</em> is a visual novel. The game is dedicated to the development of the story, displayed as still images accompanied by text. The player's interaction is confined to occasional \"decision points\", which prompt him to make choices for Tomoya, altering subsequent events. The game is divided into two parts; the second one describes the lives of its main characters some time after the conclusion of the first one. In order to access the second part, the player has to play through all the scenarios of the first one, which are only possible to achieve by replaying it and making different choices each time.</p>"},{"name":"Classic British Motor Racing","year":2007,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART4/Classic%20British%20Motor%20Racing%20%28Europe%29.zip","filesize":83913347,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Automobile > Licensed","desc":"<p>This is a racing game featuring British cars from the 60's. There are 13 cars available: Austin Mini Cooper, MGA MKII, MGB MKI, Austin Healey 3000, MG Midget, Triumph Spitfire, Triumph TR2, Riley RM, Triumph TR2 A, Rover P6, Triumph TR5, Triumph TR6 and a secret car to be unlocked after qualifying with the 12 first cars.</p><p>The game features three gameplay modes: Single Race, Time Trials and Challenge. In order to play the Single Race and Challenge modes, the player has to unlock cars racing one lap in any circuit in the Time Trials mode, within the time limit. Once the cars are unlocked, they'll be available in the other two play modes, with three different painting options.</p><p>The Single Race mode, as the name implies, lets the player chose any of the unlocked cars and race against 7 other competitors in any course of choice. There are 6 circuits available: Scottish Highlands, Rooksley Forest, Greenwood County, Foxglove Lane, Westminster Run and London City Centre.</p><p>In the Challenge mode, three cups are available: Bronze, Silver and Gold, each one comprising 4 circuits. Each cup won unlocks the next.</p><p>The game can be played using the keyboard or a gamepad. The controls consist in buttons for steering, accelerating, breaking and hand breaking. Three camera angles are available: from behind the car (3rd person view), from the hood and from the car's front (first person views). A \"review mirror\" camera is also available.</p><p>The game has three levels of difficulty and can be played in a two player split-screen mode.</p>"},{"name":"Clear: Atarashii Kaze no Fuku Oka de","year":2009,"developer":"Moonstone","url":"sony_playstation2_c/Clear%20-%20Atarashii%20Kaze%20no%20Fuku%20Oka%20de%20%28Japan%29.zip","filesize":3964646210,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Kouichi returns to his hometown after years of absence, expecting to find many changes. Instead, the island seems pretty much the same as when he left, but people he knew changed and his rekindled friendship and relationship with people he left behind will bring a change in Kouichi. The game is a visual novel with light background animations, while character only change poses and don't animate during talking, even moving lips while talking and looking in a different direction is done via character stills and not animated. Aside from Kouichi, all NPCs feature full voice-acting.</p><p>Originally released as Clear for PC (Windows), this PlayStation 2 port was done two years after with reduced rating and removed adult content. To compensate for that, the game features new characters, new branching plot, new CG events and new opening song by Ceui. Gameplay interface has also been improved and adjusted for console gameplay.</p>"},{"name":"Clever Kids: Dino Land","year":2007,"developer":"Gamerholix Ltd.","url":"PS2_COLLECTION_PART4/Clever%20Kids%20-%20Dino%20Land%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":37480126,"score":"","genres":"Educational > Puzzle > Fixed / flip-screen > Persistent > Direct control > Ecology / nature > History > Prehistoric","desc":"<p><em>Clever Kids: Dino Land</em> is a compilation of six prehistoric themed games aimed at a younger audience. Sprocket the robot guides the player through the games which range from putting together a dinosaur puzzle to using movement cards to guide a dinosaur through a maze. Along the way various bits of interesting trivia about dinosaurs is displayed on screen.</p>"},{"name":"Clever Kids: Pony World","year":2007,"developer":"Gamerholix Ltd.","url":"sony_playstation2_c/Clever%20Kids%20-%20Pony%20World%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":46149007,"score":"","genres":"Educational","desc":"<p>Pony World brings the magic of the stable yard to life. Meet the animals, learn the facts and become a stable master. * Play a whole host of fun and educational games; spot the difference, test your stable knowledge, build a Pony-puzzle and much, much more! * Pony Grooming - Learn how to groom ponies using the intuitive control system. * Find The Pony - Go against the clock to identify and match ponies by their distinctive markings.<br>Clever Kids is a brand new multi-format product range from Midas featuring hugely enjoyable and yet educationally beneficial gaming products.</p>"},{"name":"Clock Tower 3","year":2002,"developer":"Capcom Production Studio 3","url":"PS2_COLLECTION_PART4/Clock%20Tower%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3264831695,"score":6.6,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Survival horror","desc":"<p><em>Clock Tower 3</em> is a survival horror action adventure in which you play as Alyssa, a girl approaching her 15th birthday. She is summoned home from boarding school because of a mysterious letter from her mother. When she arrives, her mother is gone and only a scary stranger is there to greet her. Alyssa is about to inherit a great power, and the mysterious stranger, who is closely related to her but keeps his identity hidden at first, is out to get it.</p><p>But before she does so, Alyssa must pacify a couple of souls in her adventure, who needs to be laid to rest, by returning to them items of sentimental value. Even though they are dead, she has the ability to interact with them and bring them happiness in the end. However, in order to do so, she will have to uncover clues that piece their stories all the while being chased by serial killers which killed those who she is trying to help. During her search and exploration, she cannot directly fight the serial killers, but will have to look for places to hide or try to outsmart them, stun them or evade their attacks since outrunning and outgunning them is not an option.</p><p>In the end, when Alyssa pacifies the lost souls, she gets to face each of them in combat. Armed with nothing but bow and arrow, the combat revolves around lots of running and attacking from the distance, using different types of arrows to stun and ultimately defeat the killers pursuing her. After all is done, the killers are defeated, and the story comes to conclusion, Alyssa will face the mysterious strange in the final struggle.</p>"},{"name":"Close to: Inori no Oka","year":2006,"developer":"KID Corp."},{"name":"Clover Heart's: Looking for Happiness","year":2004,"developer":"ALcot","url":"sony_playstation2_c/Clover%20Heart%27s%20-%20Looking%20for%20Happiness%20%28Japan%29.zip","filesize":2454466218,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Clover Heart's: Looking for Happiness</em> is a PlayStation 2 port of a PC hentai game Clover Heart's, but stripped of all the adult CGs as it is the usual case with PS2 ports of PC hentai visual novels. This game features two protagonists, twin brothers Hakuto and Itsuki. And it just so happens that during the course of the story, a twin sisters Rea and Rio enter the scene and the love relationship between the couples starts to bloom during their lives together. The story's main focus isn't only a love dating simulation, but also focuses on friends, family, and growing up.</p><p>The game is split into four chapters and contains various unlockables which can be accessed from the main menu. The gameplay is a typical visual novel style gameplay which lets you skip messages, use auto option, browse the history log, remove the on-screen text to see the clear background and character image, and occasionally select the option from the choices that appear at key points during the game.</p>"},{"name":"Club Football 2005 - AC Milan","year":2004,"developer":"Hoodoo Studios","url":"PS2_COLLECTION_PART4/Club%20Football%202005%20-%20AC%20Milan%20%28Europe%29%20%28En%2CDe%2CIt%29.zip","filesize":1791321027,"score":6.1,"genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p>Club Football 2005 is a series of 21 club-specific football games. Each version has its own opening sequence, menu graphics, and packaging as well as a Club Album that contains facts and memorabilia from each clubs present. When playing the game you earn credits that can be used to unlock features as pictures and video clips. The gameplay from last years game has been improved with a new animation system as well as some new skills including  dummies, close control and fakes. </p><p>The game comes with several different game modes. You can play in Domestic, European and Custom leagues and tournaments. The Career mode lets you create yourself in the game to play with your team. Several scenarios has been included allows you to play classic matches from the history of your club. For new players is the practice mode that lets you prepare for the big matches.</p>"},{"name":"Club Football: 2003/04 Season","year":2003,"developer":"The Codemasters Software Company Limited"},{"name":"Clumsy Shumsy","year":2005,"developer":"Ivolgamus UAB","url":"PS2_COLLECTION_PART4/Clumsy%20Shumsy%20%28Europe%29.zip","filesize":179745777,"score":"","genres":"Action > Sports > Diagonal-down > Side view > Top-down > Mini-games > Motion control > Tennis","desc":"<p><em>Clumsy Shumsy</em> is an EyeToy mini-game compilation including 8 games:</p><ul><li>Lost Shumsies</li><li>Delicious Fireworks</li><li>Air Traffic Controler</li><li>Know Your Colours</li><li>Big Journey</li><li>Clumsy Tennis</li><li>Clumsy Soup</li><li>Clumsy Parachutes</li></ul>"},{"name":"CMT Presents: Karaoke Revolution - Country","year":2006,"developer":"Harmonix Music Systems, Inc.","url":"sony_playstation2_c/CMT%20Presents%20-%20Karaoke%20Revolution%20-%20Country%20%28USA%29.zip","filesize":1145763857,"score":6.8,"genres":"Simulation > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p><em>CMT Presents: Karaoke Revolution Country</em> is the fifth game in the series released in North America. It features:* 35 classic and modern Country music hits;</p><ul><li>Fifteen different singing venues;</li><li>A rich character customization mode;</li><li>EyeToy support (during character creation and gameplay);</li><li>Party and arcade-style singing minigames;</li><li>Unlockable videos, songs, and clothes / accessories for your character.</li></ul>"},{"name":"Cocoto: Fishing Master","year":2007,"developer":"Neko Entertainment SARL","url":"PS2_COLLECTION_PART4/Cocoto%20Fishing%20Master%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":278246323,"score":5.8,"genres":"Sports > 3rd-person (Other) > Fishing","desc":"<p>In order stop a magical kettle from overflowing and defeat the evil Zaron, Cocoto embarks on a quest to wake the sleeping god Geo. With the help of his friends Fairy, Baggy, and Neuro, Cocoto must retrieve five pieces of the bait bait necessary to wake Geo. </p><p>Catching fish is a three-step process. After finding a good spot Cocoto casts and then moves around the bait around until it gets the attention of a fish. Once a fish has seen the bait it must be followed until it bites, and then set the hook. Finally, the fish is reeled in. Once caught, fish can be sold to Baggy in exchange for diamonds. The diamonds can then be used to buy bait and new fishing rods from Neuro. </p><p>When one of each type of fish is caught, Cocoto can bring them to the hermit turtle. The hermit turtle will make a special bait that can catch that level's boss fish. After catching the boss fish the next area becomes available.</p>"},{"name":"Cocoto: Funfair","year":2006,"developer":"Neko Entertainment SARL","url":"sony_playstation2_c/Cocoto%20Funfair%20%28France%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":458412334,"score":"","genres":"Action > 1st-person > Arcade > Mini-games > Shooter > Fantasy","desc":"<p><em>Cocoto: Funfair</em> is a shooting gallery staring strange fantasy creature that has to shoot at targets (monsters or pictures of monsters) at the Funfair.</p><p>The game can be played in single-player and multiplayer for up to four players and offers an Arcade, Training, Dual and Tournament mode. The single-player arcade mode can be played on three difficulty levels: easy, normal, and hard. Over 40 different mini-games are included, ranging from stationary to flipping and moving targets, as well as saving a damsel in distress from attacking monsters. A clown from the fair presents the instructions for the current mini-game.</p>"},{"name":"Cocoto: Kart Racer","year":2005,"developer":"Neko Entertainment SARL","url":"PS2_COLLECTION_PART4/Cocoto%20Kart%20Racer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":243431641,"score":"","genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Fantasy","desc":"<p><em>Cocoto Kart Racer</em> is a kart racing game where you can choose to race as one of twelve strange available creatures, each with their own features. Facing to loss of their power the creatures compete in a racing tournament with the winner claiming a mysterious cauldron and retaining their power. The racing tracks include speed strips and ramps. Power-ups can be picked up and used on opponents while racing. </p><p>The game offers several modes like a championship, time challenge, and multiplayer mode for up to four players. Five differently themed game worlds can be traversed. The worlds being Abyss, Volcano, Atlantis Jungle, and Paradise.</p>"},{"name":"Cocoto: Platform Jumper","year":2004,"developer":"Neko Entertainment SARL","url":"PS2_COLLECTION_PART4/Cocoto%20Platform%20Jumper%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":491111276,"score":6.4,"genres":"Action > 3rd-person (Other) > Platform > Fantasy","desc":"<p>The name of this game says all about it. Cocoto Platform Jumper is a circular 3D Platform Jumper with an isometric camera angle. You play as demon Cocoto in your quest to save a secret of magma and his demonic friends. For the most part of the game you run along circular platforms and fight monsters and bosses on your way to victory. Cocoto has several special abilities that will help him - some can be used to build temporary platforms and some to fight monsters.The game features 5 different game worlds, with 40 different levels. There are also 30 enemies and 5 bosses on each level. There is also a 2-player battle mode and 4 player race mode.</p>"},{"name":"Code Age Commanders: Tsugumono Tsugarerumono","year":2005,"developer":"Square Enix Co., Ltd.","url":"sony_playstation2_c/Code%20Age%20Commanders%20-%20Tsugumono%20Tsugarerumono%20%28Japan%2C%20Asia%29.zip","filesize":1960092827,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Sci-fi / futuristic","desc":"<p>The ReBorn Project was meant to terraform the planet, to restore it to its former beauty and make it inhabitable once more. Great ships called Arks were constructed, and humanity boarded them to wait for the project to complete. But... something went wrong. One by one, the Arks have crashed back into the planet, where the world is even more desolate than before, and strange hostile creatures called Otelo and Coded have appeared, a war ongoing between Black and White. A young man named Gene awakens on the surface after his Ark crashes, where he soon discovers that he is what's known as a Warhead, a type of warrior that are the link between Human and Coded. Just what happened with the ReBorn Project, and what will become of Gene's planet?</p><p><em>Code Age Commanders</em> is a stage-based third-person action game. The player initially controls only Gene, but will eventually earn access to three other characters. The game is broken into missions, which have varying objectives such as to reach a specific place or defeat certain enemies. Clearing missions will unlock further missions, some of which move the story forward, and some of which take place in the past and fill in the backstory. Clearing missions will also award Code Points (CP), which can be used to purchase and upgrade so-called Code Extensions, which are upgrades that can be equipped on the player characters to increase their abilities or grant them new weapons.</p><p>The game plays similarly to other 3D action games such as <em>Dynasty Warriors</em>. Each character can attack with weapons equipped on each arm, stringing them together into combos, as well as block enemy attacks, dash, or use special moves called \"Heroic Actions\". In addition to a regular life meter, there is also a gauge for each arm's power level which depletes from using special attacks and must be allowed to recharge over time.</p>"},{"name":"Code Lyoko: Quest for Infinity","year":2008,"developer":"Neko Entertainment SARL","url":"sony_playstation2_c/Code%20Lyoko%20-%20Quest%20for%20Infinity%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":2124174710,"score":6.3,"genres":"Action > 3rd-person (Other) > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>Code Lyoko: Quest for Infinity</em> is the second game based off of the popular French animated TV series <em>Code Lyoko</em> and it is presented as a 3D action platformer. It continues the original premise of the four high school students who discover a computer in an abandoned factory, holding a large virtual world plagued by the virus X.A.N.A., but many of the characters' backgrounds are taken from later seasons in the series.</p><p>Players take the role of one of the four heroes from the show, Ulrich, Odd, Yumi or Aelita, and fight across the virtual environment of Lyoko and the internet against the dangerous virus X.A.N.A. and his army of monsters. Levels are accessed from a main hub and players can switch between any of the characters at any time, but they share health and energy. The characters' various weapons and abilities can be used to take them out, like Ulrich's swords, Odd's laser arrows or the ability to climb walls, or Yumi being the only one who can balance on thin ledges. Many of these skills are unlocked during the course of the game. X.A.N.A. on the Internet can be hunted down using the digital submarine Skidbladnir.</p>"},{"name":"Code of the Samurai","year":2005,"developer":"Tose Co., Ltd.","url":"PS2_COLLECTION_PART4/Code%20of%20the%20Samurai%20%28Europe%29.zip","filesize":1135472615,"score":"","genres":"Action > 3rd-person (Other) > Hack and slash > RPG elements","desc":"<p>In an age where lawlessness abounds, a new force is needed to wrestle control from the warlords and bring stability back to the empire. Fight your way as a member of the Shinsengumi (the elite Samurai Police) through this brilliant action adventure, featuring huge historical locations and advanced combat techniques.</p><p>Only the strongest will survive! * Massive missions designed to hone your combat skills. * Gripping storyline with immersive gameplay. * Extensive character development and a multitude of upgrades to unlock. * Execute devastating special moves and unleash brutal combo attacks.</p>"},{"name":"Codename: Kids Next Door - Operation: V.I.D.E.O.G.A.M.E.","year":2005,"developer":"High Voltage Software, Inc.","url":"sony_playstation2_c/Codename%20-%20Kids%20Next%20Door%20-%20Operation%20-%20V.I.D.E.O.G.A.M.E.%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":3160822528,"score":6,"genres":"Action > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p>This action/adventure platformer is based on the Cartoon Network show Codename: Kids Next Door. The Kids Next Door battle their arch-nemesis from the show (Knightbrace, Count Spankulot, and others) when they escape from the maximum-security KND prison on the moon.</p><p>In each mission, you control a specific KND agent, and each agent has a unique playstyle: Numbuh One is a master of ranged weaponry, Numbuh Two pilots aircraft, and spacecraft, Numbuh Three has extra platforming mobility, Numbuh Four is a melee brawler, and Numbuh Five uses stealth to her advantage.</p>"},{"name":"Cold Fear","year":2005,"developer":"Darkworks S.A.","url":"PS2_COLLECTION_PART4/Cold%20Fear%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2977003064,"score":6.9,"genres":"Action > Behind view > Puzzle elements > Survival horror > Direct control > Horror","desc":"<p>A team from the Coast Guard boards a nameless Russian Whaler lost in a storm. Little do they know that a team of CIA operatives tried to do the sameshortly before, all of them ending up dead. Within minutes, the entire Coast Guard team shares their fate, except one person, veteran USCG Tom Hansen.Now it's up to him to discover which kind of creatures wiped out his mates. Are there any survivors? What happened aboard this vessel? How does its recent visit to the Russian scientific drilling platform \"Star of Sakhalin\" fit in?</p><p><em>Cold Fear</em> is a typical console-style action adventure, similar to gameslike the Silent Hill series. Most of the time players will be viewingthe action from a third person point of view, following the characteraround as he utilizes an array of weapons to dispose of a variety of enemies.Occasionally, a puzzle has to be solved or a cutscene (rendered with the game's own engine) must be witnessed. Additional insight can be gained by reading thevarious notes, letters and diaries that can be picked up every now and then.</p>"},{"name":"Cold Winter","year":2005,"developer":"Swordfish Studios Limited","url":"PS2_COLLECTION_PART4/Cold%20Winter%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":3443800822,"score":7.6,"genres":"Action > 1st-person > Shooter > Direct control > Spy / espionage > Regional differences","desc":"<p>In <em>Cold Winter</em>, you play the role of Andrew Sterling, a former member of MI6, the British secret intelligence service. Andrew is caught preparing to assassinate someone in China, and is thrown into prison. There he faces torture and imminent execution. But a former friend from his MI6 days arranges to rescue him and offers him a job, having planned in advance to manipulate him so that he is unable to refuse. The first task seems fairly ordinary: to track down a weapons dealer who has been supplying terrorists.</p><p>But soon Andrew's mission becomes more important, because he must deal with a sinister conspiracy that embraces the whole world. In the story, there is a secret society called the Greywings, which slowly began to form after World War I. The organization dedicated itself to stopping nuclear weapons proliferation by any means. Their obsessive leader, John Grey, finally decided that this effort is hopeless. He set in motion a plan calculated to cause the nuclear war he had been trying to prevent for his whole life, reasoning that it is better to have the war under controlled conditions, because it would have happened sooner or later. It is Andrew Sterling who must stop the plan from working. He must track them down and follow them to 'Winterlong,' a hidden bunker in the Arctic, where they have taken shelter.</p><p>In this first-person shooter, you can collect over 20 weapons to kill your enemies. You can only carry two of them simultaneously, although it is also possible to use grenades. You can make weapons by combining items you find. For example, a fuel can, a bottle, and cloth combine to make a Molotov cocktail. A business card and some poison make a business card that is poisoned. You shouldn't worry about finding healing items, though, because you carry along an unlimited health pack. You need to remember to use this at the proper time, though, or of course you will still be killed. In combat, you can use various objects to help you. For example, you can throw pots at your enemies. Large objects such as chairs, desks, and even wheeled carts can be pushed to block the enemy's path or to provide limited cover for yourself.</p><p>It is possible to take the roles of two other primary characters in the story. Enemies would respond to alarms, change posture, take cover, divide themselves, and work in groups. Depending on how quickly you are able to react, they are likely to send someone to get reinforcements, and they yell for help. Perceptions become confused when the character is under stress. The game uses flashbacks to explain what has happened prior to the events described in it.</p>"},{"name":"Colin McRae Rally 04","year":2003,"developer":"The Codemasters Software Company Limited","url":"PS2_COLLECTION_PART4/Colin%20McRae%20Rally%2004%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1168358583,"score":8.3,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p>Colin McRae is no longer with Ford and Nicky Grist is no longer Colin’s co-driver. Things have moved on in the rally-driving world, as they have with this, the fourth title in the series. This time the player is in the vehicle of their choice.</p><p>While the game features improved graphics over the older titles in the series the biggest improvement is the handling in the game, which is now based on real-world physics. Where the previous titles' handling of the cars made use of one pivot point, the new physics engine has four pivot points, each wheel interacting independently of the others. </p><p>There are four championships modes: 2WD, 4WD, Group B and Expert. 2WD is for beginners. 4WD is the next step up, offering an intermediate challenge. Group B features cars from the '80s that were banned in 1986, as they were unrestricted and capable of extreme acceleration. And finally, Expert is for those that finish 4WD in advanced mode, upon which they are presented with Expert mode where one drives with cockpit view only, and with the highest damage setting. </p><p>There are 8 national rallies in which to race, including USA, Australia, UK, Finland, Japan and Greece. There are also over 20 cars to unlock, including the Team Ford Transit van.</p>"},{"name":"Colin McRae Rally 2005","year":2004,"developer":"The Codemasters Software Company Limited","url":"PS2_COLLECTION_PART5/Colin%20McRae%20Rally%202005%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2366358952,"score":8.1,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p>The fifth iteration of the rally racing game inspired by the \"Flying Scotsman\".  Choose from over 30 car models.  The detail and physics are improved, and more playing modes are available, including a new around-the-world career mode.  Weather conditions and rally courses can both be customized.  Network play supports up to eight players with split-screen.  As always, the menu design is clean, and the tracks are dirty!</p>"},{"name":"Colin McRae Rally 3","year":2002,"developer":"The Codemasters Software Company Limited","url":"sony_playstation2_c/Colin%20McRae%20Rally%203%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1648409540,"score":8.3,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p>The third title in the rally series has you off road over a range of courses around the world as Colin McRae, in the Ford Focus rally car.</p><p>You are given 3 seasons to win the world rally championship, racing the Ford Focus RS RWC. In each season there are 8 competitions, staged in Australia, the USA, England, Sweden, Japan, Greece and Finland. Each competition has 6 stages set around different landscapes, and a special head-to-head stage at the end. You are out to beat the clock, and the time set by the opposing teams, on each occasion. Beat the time, win the stage, and you are once step closer to taking the world title.</p><p>Along the way you can alter and modify the Focus' setup, from the wheels used, gearboxes, brakes, suspension and so forth. You can also test drive the car before any event to make sure the setup is to your liking.</p><p>Apart from the championship mode you can also play stage mode, allowing you to race in any of the cars unlocked during the championship mode, on all the courses you have completed. Compete against the clock or against a friend in 2 player mode.</p>"},{"name":"College Hoops 2K6","year":2005,"developer":"Visual Concepts Entertainment, Inc.","url":"sony_playstation2_c/College%20Hoops%202K6%20%28USA%29.zip","filesize":3577187253,"score":7.5,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>College Hoops 2K6 is a game dealing with college basketball. Go through Legacy Mode as the coach to bring a small college respect and eventually win a championship. Go online to test your skills against players around the world. Also included are features such as Pre-season, the Coach's Clipboard, Midnight Madness (which allows you to participate in the first practice of the year with a midnight intra-squad exhibition that has become a college hoops tradition.), Strip 'n' Rip System, Shot Stick (which controls the way you take your shot to make a basket), and V.I.P. System. Another feature is Selection Sunday broadcast shows, where you'll watch a broadcast of your team’s placement into the NCAA Tournament and listen to commentary as video clips give you the low down on all the bracket match ups.</p>"},{"name":"College Hoops 2K7","year":2006,"developer":"Visual Concepts, Ltd.","url":"sony_playstation2_c/College%20Hoops%202K7%20%28USA%29.zip","filesize":3302079273,"score":8,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>College Hoops 2K7</em> is the update of College Hoops 2K6 and a continuation of 2K's NCAA basketball franchise. It features the obligatory roster updates (including the names of the players) with 325 NCAA Division I teams to choose from and improve crowd reactions, updated mascots, new fight songs and real life coaches such as Billy Donovan, Roy Williams and Jay Wright.</p><p>It has the standard modes and has an updated <em>Legacy</em> (franchise) mode that has the player take command of a NCAA team, recruiting and training potential NBA players for the future. It sports updated offensive and defensive A.I. and features <em>Team Unity</em> where the chemistry of the team combined with the captain's leadership qualities can combine to help their team in their performance and morale on the court.</p><p>Players can also customize by creating their own school along with uniforms and even design a unique stadium for their created school. The games are almost identical except for a few differences: the PS3 and Xbox 360 versions has the ability to create their own chants for their crowds to yell during home games and the PS3 utilizes the SIXAXIS controller to shoot free throws by tilting it.</p>"},{"name":"College Hoops 2K8","year":2007,"developer":"Visual Concepts, Ltd.","url":"sony_playstation2_c/College%20Hoops%202K8%20%28USA%29.zip","filesize":3083038604,"score":8,"genres":"Sports > 3rd-person (Other) > Side view > Top-down > Basketball > Licensed","desc":"<p>Standard update of the long-running 2K series, with some added new features.  One of which is the 6th man advantage that measures the crowds energy and excitement when scoring often and playing good defense, causing the meter to rise, the higher the meter, the better your players will become and demoralize the opposing team.</p><p>Another new feature is the ability to train your players with former college players such as Mike Conley Jr. of Ohio State, Julian Wright of Kansas, Glen Davis of LSU, Alando Tucker of Wisconsin, Al Thornton of Florida State, J.J. Redick of Duke, and Greg Oden of Ohio State.</p><p>Also has online capability that lets you share your rosters, legacies and game settings with other players online and lets you play in season and tournament modes as well.</p>"},{"name":"Colorful Aquarium: My Little Mermaid","year":2007,"developer":"Eufonie","url":"sony_playstation2_c/Colorful%20Aquarium%20-%20My%20Little%20Mermaid%20%28Japan%29.zip","filesize":2959126355,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Colorful Aquarium: My Little Mermaid</em> is a PS2 port of a hentai PC game called Colorful Aquarium. PS2 version removes adult content and adds new CG events and features five heroines.</p><p>The premise of the story is pretty much the same as in PC version. Your parents are on a business trip and for a while you've been living with your older sister. But now that she's gone as well, you're left alone in the house, doing the chores and going to school. Your childhood friend, Izumi, is staying with you to help you with chores and such, though the two of you often get into quarrel. One day, a girl with two maids come to your house. While at first you fail to understand why she treats you like she knows you, you soon recognize her as she was another childhood friend of yours you haven't seen in ages. Now, what felt like living alone will soon turn into living with a bunch of girls, any of them capable of stealing your heart.</p>"},{"name":"Colorful Aquarium: My Little Mermaid (Shokai Genteiban)","year":2007,"developer":"Nine's Fox","url":"sony_playstation2_c/Colorful%20Aquarium%20-%20My%20Little%20Mermaid%20%28Japan%29%20%28Shokai%20Genteiban%29.zip","filesize":2959126318,"score":"","genres":"Special edition > Physical extras","desc":"<p>First Print Limited Edition package of <em>Colorful Aquarium: My Little Mermaid</em> contains:</p><ul><li>Colorful Aquarium: My Little Mermaid game</li><li>Drama CD titled \"Bishoujo Sentai Pikarinja Kessei!!?\" (美少女戦隊ピカリンジャー結成!!?)</li></ul>"},{"name":"Colosseum: Road to Freedom","year":2005,"developer":"Goshow Inc.","url":"PS2_COLLECTION_PART5/Colosseum%20-%20Road%20to%20Freedom%20%28Europe%29.zip","filesize":446012611,"score":6.2,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Fighting","desc":"<p>Taken into slavery, you are now a gladiator.  Your only chance at freedom is to earn enough money in the arena to buy yourself back.  Whether in a lowly arena on the outskirts of the Empire or in the Colosseum itself, a wide variety of opponents await: heavily armed charioteers, wild bulls, fellow gladiators and more.  In a series of battles, from battle royales to one-on-one duels, you must entertain the crowds by spilling blood.</p><p>After battles, it's time to train.  A series of minigames improves your attributes and your diet perfects your body.  Study your rankings, play around with your special skills, and await the next battle.</p><p>Colosseum: Road to Freedom is a self-described Action RPG, controlled in the third-person and works as a gladiator simulator.</p>"},{"name":"Combat Elite: WWII Paratroopers","year":2005,"developer":"BattleBorne Entertainment, Inc.","url":"sony_playstation2_c/Combat%20Elite%20-%20WWII%20Paratroopers%20%28USA%29.zip","filesize":1839221506,"score":"","genres":"Action > 1st-person > Diagonal-down > 2D scrolling > RPG elements > Shooter > Direct control > Europe > World War II > War","desc":"<p><em>Combat★Elite: WWII Paratroopers</em> is primarily a top-down close-combat shooter with some RPG features. It can be played in single-player or two-player coop mode. The game lets the player take part as a paratrooper in the allied campaign in Europe during the second world war, starting out as a private soldier from either the US 101st Airborne, the US 82nd Airborne, or the British 1st Airborne regiment.</p><p>There are 40 missions strung together with a narrative, depicting the Operation Overlord (D-Day), Bastogne, Operation Market Garden and the Battle of the Bulge and beyond - ending in an fictional effort to stop the Nazis from creating an atomic bomb. During a mission, you find medical packs, ammunition (weapon specific), and new weapons as pickups lying around, or dropped by enemies killed - the drops disappear if not picked up in time. A mission takes place on a series of relatively small maps, separated into 'levels', and at the level transition points the player can save the game, and is also awarded skill points, new ranks and medals.</p><p>The RPG aspect includes the initial character specialization, and between missions levels the player get skill points, which can be saved for later or allocated between missions to improve various combat skills:Hand-to-Hand, Pistol, SMG, Rifle, Heavy SMG, Stealth, Medic, Grenade and 'Combat Sense'.</p><p>In single-player has classic run-and-gun gameplay. You use a player-centered bird's-eye view, and you must turn the character to spin the view as you can only shoot at enemies at the top of the screen, as opposed to the sniper mode, when you use a 1st person scoped view. The screen has a fixed scaling, there is no zoom or free pan, other than to automatically give you a few seconds look ahead when key locations are nearby. The player is kept in the center of the screen and the view window automatically slides over the battlefield as your character moves. Normally, enemies won't fire until they are within your view - but there are exceptions.</p><p>In two-player coop mode, each player can shoot in the direction their character is facing, and do not need to rotate the view to hit the enemy. The players cannot be farther apart than the screen size, which is fixed. The screen is centered between the player characters in this mode. If players are far apart at opposite edges of the screen, they can often be shot at from off-screen enemies, as enemies are triggered by being close enough - about half the screen size away on the map, no matter if you can see them yourself.</p>"},{"name":"Combat Queen","year":2002,"developer":"General Entertainment Co., Ltd.","url":"PS2_COLLECTION_PART5/Colosseum%20-%20Road%20to%20Freedom%20%28Europe%29.zip","filesize":446012611,"score":"","genres":"Action > 1st-person > 3rd-person (Other) > Video backdrop > Arcade > Rail shooter > Sci-fi / futuristic","desc":"<p>Mysterious giant insects have invaded Japan! These flying monstrosities have reduced Tokyo to a ghost town in less than 24 hours. Humanity only has one hope left: a team of five beautiful-yet-deadly female android soldiers. They must find and destroy the source of these creatures before Earth is overrun completely.</p><p><em>Combat Queen</em> is an FMV-based rail shooter in the Digital Pictures tradition. Each stage consists of multiple shooting-gallery sections where the player must destroy oncoming insects against a video backdrop. These are connected by short scenes of the characters interacting, moving the story forward. Certain sections also feature basic third-person walking and shooting in the vein of Resident Evil.</p><p>In both modes, the player must watch their energy level, which powers both the characters' shields and weapons. Energy can be swapped freely between them, but getting hit by enemies will deplete the red bar, and firing the weapon will deplete the blue. If the blue bar is empty, the player cannot fire, and if the red bar empties, it's game over and the stage must be restarted. Depending on the number of enemies destroyed on each, stage bonus videos and energy refills are earned.</p>"},{"name":"Come On Baby","year":2005,"developer":"Expotato Corporation","url":"sony_playstation2_c/Come%20on%20Baby%20%28Korea%29.zip","filesize":439337422,"score":"","genres":"Action > Compilation > Sports > Arcade > Direct control > Athletics > Comedy","desc":"<p>This compilation contains home ports of the two main <em>Come On Baby</em> arcade games: Come On Baby, and Come On Baby 2: Winter Championship.</p>"},{"name":"Commandos 2: Men of Courage","year":2002,"developer":"Pyro Studios S.L.","url":"PS2_COLLECTION_PART5/Commandos%202%20-%20Men%20of%20Courage%20%28Europe%29.zip","filesize":1975229296,"score":8.1,"genres":"Strategy > Diagonal-down > Free-roaming camera > Isometric > Real-time > Stealth > Multiple units/characters control > Point and select > Asia > Europe > Historical events > Oceania > World War II > War > Regional differences","desc":"<p>From the heart of the Third Reich to the most remote islands in the South Pacific, Sergeant Jack \"Butcher\" O'Hara and his elite group of gritty soldiers must combine their expertise and venture deep into enemy territory...in an attempt to change the course of the war. </p><p>This sequel contains the following enhancements:* All new 3D engine - rotate the environment 360 degrees and move seamlessly in and out of buildings, submarines, planes, underwater and zoom in and out of the environments.</p><ul><li><p>Interact like never before - steal enemy uniforms and weapons, climb and swing from cables, jump from windows and utillize vehicles.</p></li><li><p>Control 9 commandos - including the green beret, sniper, demolitions expert, seductress, thief and even a dog!</p></li><li><p>Authentic WWII scenarios - 10 missions spanning 9 different environments in night and day with realistic weather effects.</p></li><li><p>Multiplayer - players can go to war in the co-operative multiplayer mode.</p></li></ul>"},{"name":"Commandos: Strike Force","year":2006,"developer":"Pyro Studios S.L.","url":"PS2_COLLECTION_PART5/Commandos%20-%20Strike%20Force%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":907759832,"score":6.7,"genres":"Action > 1st-person > Shooter > Direct control > Europe > Historical events > World War II > War","desc":"<p>In this new Commandos game, converted from real-time strategy to first person shooter with a tactical component, you'll play as a Green Beret for the fast action, as a Sniper for the tactical shooting and as the Spy for the stealth and sabotage bits. In some missions you could use two of them, changing from one to another in real time.</p><p>The game, set in the WWII, makes you play in Stalingrad, Norway, and France, side by side with your allies, trying to wreak havoc!</p><p>The music is played by the Bratislava Symphony Orchestra and the City Choir of the same city.</p>"},{"name":"Conan","year":2004,"developer":"Cauldron Ltd.","url":"PS2_COLLECTION_PART5/Conan%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2182504592,"score":6.2,"genres":"Action > Behind view > Hack and slash > Fantasy > Licensed","desc":"<p>As Conan returns from another successful adventure, he finds that a band of masked warriors has destroyed his village and murdered his uncle, bad move. Now it's time for Revenge! </p><p>\"Conan\" is a 3D hack'n'slash action title that blends RPG elements by awarding experience points for each defeated enemy. Said points can be spent on a plethora of fighting skills which are then triggered via a simple combo system for spectacular results as you battle hordes of human warriors and supernatural monsters from beyond in your quest for revenge. Should you fall to a well-placed blow, Conan offers you the chance to try and regain your honor in the domains of Crom, where a small arena fight can restore your honor and bring you back to life and continue the game or damn you to eternity should you fail. </p><p>Also available is a multiplayer Arena mode in which you can duke it out mano-a-mano with other human players as Conan or a selection of original characters. Features the original licensed soundtrack from the Conan movies by Basil Poledouris.</p>"},{"name":"Conflict Zone","year":2001,"developer":"Mathématiques Appliquées S.A.","url":"PS2_COLLECTION_PART5/Conflict%20Zone%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2798259547,"score":7,"genres":"Strategy > Diagonal-down > Real-time > Real-time strategy > Wargame > Multiple units/characters control > Point and select > Contemporary > War","desc":"<p><em>Conflict Zone</em> is a modern-day war game with 3D graphics. Your every move is being watched by the media so you'll have to act right to make a good impression (rescue civilians,..). The impression you make will also determine how much money you will get for your missions, so there is no resource management.</p>"},{"name":"Conflict: Desert Storm","year":2002,"developer":"Pivotal Games Ltd.","url":"PS2_COLLECTION_PART5/Conflict%20-%20Desert%20Storm%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":1609443047,"score":7.1,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Historical events > Middle East > War","desc":"<p><em>Conflict Desert Storm</em> is a first-person/third-person shooter (the perspective can be switched by pressing a button), in which the player controls a squad of four soldiers from either the British S.A.S or American Delta Force during the first Gulf War. It has ideas borrowed from the book <em>Bravo Two Zero</em> and other real missions from the war. </p><p>Missions are performed behind enemy lines and have specific objectives (infiltrate a base, destroy a SAM site, assassinate an opposing general, ...). Team members can be sent orders (attack, retreat, follow, stay, ...) or controlled individually. On the team is Bradley, the team leader, Conners, the heavy weapons man, Jones, the explosives and anti-tank expert, and Foley, the team sniper. Each soldier has different skills that improve as they kill more enemies and gain experience. This results in them doing a better or faster job (Foley will have more stable aiming or Jones will plant C4 faster as their skills increase). In some missions, the player drives tanks or jeeps around while other squad members man the guns on the vehicle. At the end of each mission, the soldiers can be awarded medals for their bravery</p><p>The game also features up to four-player co-op, each player controlling a soldier in the squad.</p>"},{"name":"Conflict: Desert Storm II - Back to Baghdad","year":2003,"developer":"Pivotal Games Ltd.","url":"sony_playstation2_c/Conflict%20-%20Desert%20Storm%20II%20-%20Back%20to%20Baghdad%20%28USA%29.zip","filesize":1695264419,"score":7,"genres":"Action > Behind view > Shooter > Direct control > Historical events > Middle East > War","desc":"<p><em>Conflict: Desert Storm II: Back to Baghdad</em> is the sequel to Conflict: Desert Storm. The player is ordered back to Iraq for some unfinished business.</p><p>The gameplay and controls haven't changed since the original, but it has more detailed graphics. There are more weapons at the squad's disposal and more vehicles to drive.</p>"},{"name":"Conflict: Global Terror","year":2005,"developer":"Pivotal Games Ltd.","url":"sony_playstation2_c/Conflict%20-%20Global%20Terror%20%28USA%29.zip","filesize":1757032901,"score":6.8,"genres":"Action > Strategy > 1st-person > Behind view > Shooter > Stealth > Tactical shooter > Direct control > Multiple units/characters control > Historical events","desc":"<p>This installment of the Conflict series occurs in many diverse regions of the world: in <em>Conflict: Global Terror</em>, Red Team spends the game fighting international terrorism.</p><p>Rather than gung-ho desert tank warfare, or tense jungle ambush fighting, the game explores many non-army locations such as gas factories, cocaine production facilities and hotels.</p><p>The combat is often up close and very personal, although most levels mix up the killzone areas, giving a wide variety of combat situations over many varying ranges. Missions vary quite a bit too. Some are frenetic and fast-paced, with the team fighting for their lives, while others can be played at a much slower pace if desired. The level design really adds to counter-terrorism gameplay. Red Team is often busting sieges using C4 to blow holes in walls and smoke grenades to flush the bad guys out.</p><p>The gadgets are useful and are frequently found to be helpful: thermal goggles let the player see through smoke, and Bradley's laser designator can mark key targets for gunship air strike. Claymore mines allow the team to protect their rear or even set up ambushes.</p><p>The game is very flexible and allows for many different playing styles. Players are free to run and gun, or play as a super-stealthy special forces team. They can play as one character leading the team, or switch around between characters as they see fit. Ordering the team about and switching characters is quick and simple. It is even possible to give each member advanced orders (\"On my signal, Connors runs to the window, Bradley opens the door and Jones throws a grenade through the window. Ready... Go!\"), allowing this kind of thorough planning if the player wants to play that way. The co-op allows multiple players to take control of Red Team.</p><p>There are 4 difficulty modes and a skill learning curve for beginners and veterans alike. There are over 30 weapons with individual stats and behaviours. Each has their own distinct advantages and disadvantages. For example, pistols are sometimes a better choice than a light machine gun.</p><p>The story unfolds throughout the missions and also in the cutscenes in between. The team is made up of four distinct characters, with their own personal histories, lives and personalities.</p>"},{"name":"Conflict: Vietnam","year":2004,"developer":"Pivotal Games Ltd.","url":"PS2_COLLECTION_PART5/Conflict%20-%20Vietnam%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1928250731,"score":6.4,"genres":"Action > Strategy > Behind view > Shooter > Cold War > Historical events > War","desc":"<p><em>Conflict: Vietnam</em> is the third game in Pivotal Games' Conflict series, this time going further back in time to the bloody battleground of Vietnam. The game is set during the Tet offensive in the year 1968.</p><p>The player takes over the roles of four soldiers who aren't, contrary to previous games, elite S.A.S or Delta Force soldiers. In fact, they are normal American G.I. who are separated from their unit during battle and have to fight themselves through enemy territory with hordes of hostile Vietnamese.</p><p>Game can be played by issuing orders to every member of the squad or directly taking control over one of them. In every mission, there are one or more main and several bonus objectives, like destroying all tanks in the area or collecting Vietcong documents. For each achieved objective, killed soldier or destroyed vehicle, squad members get experience points. Each one of them has different abilities (Sniper, Leader, Heavy Weapons, Medic) which can be improved with these points. To defuse one of the numerous booby traps, it is necessary to have skills in that ability.</p><p>The levels are set around the jungle and include underground Vietcong complexes or temples. In addition to enemies, friendly characters like allied soldiers or citizens can be encountered and talked to, with some of them giving bonus objectives to complete. Furthermore, some missions involve the use of stationary weapons like machineguns and driving jeeps or tanks.</p><p>The console versions of <em>Conflict: Vietnam</em> feature a split-screen multiplayer co-op mode with up to four players (Xbox), or two players (PS2). The PC version doesn't have this feature.</p>"},{"name":"Conspiracy: Weapons of Mass Destruction","year":2005,"developer":"Kuju Entertainment Ltd.","url":"PS2_COLLECTION_PART5/Conspiracy%20-%20Weapons%20of%20Mass%20Destruction%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":519123299,"score":4.1,"genres":"Action > 1st-person > Shooter","desc":"<p>Cole Justice, a retired Secret Service agent has been recalled by The Agency for one last mission. Hydra, a rogue government agency has according to intelligence reports been developing and selling biological weapons to terrorist organizations. Now, Cole's mission is to stop them, but who should he trust, the government or Hydra?</p><p><em>Conspiracy: Weapons of Mass Destruction</em> is a first person shooter built on the Fire Warrior engine. As Cole Sullivan, players will be assigned to missions around the globe, including places such as the South American jungle and the Arctic Circle. The game contains typical FPS weapons such as the machine gun, the sniper rifle and the rocket launcher.</p><p>In addition to the campaign there's also the Endurance Mode, where enemies will spawn around you and you have to stay alive as long as possible. For each enemy you take down you'll earn points, and if you're quick you can make chain combos and get huge scores.</p>"},{"name":"Constantine","year":2005,"developer":"Bits Studios Ltd.","url":"PS2_COLLECTION_PART5/Constantine%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2433192284,"score":6.5,"genres":"Action > Behind view > Direct control > Horror > Licensed","desc":"<p>John Constantine is the name of the main character in the <em>Hellblazer</em> comic by Vertigo DC. This game is based on the movie <em>Constantine</em>, starring Keanu Reeves. The player assumes the role of Constantine, a mage/exorcist/demonslayer of the modern age. A man who fights Evil, but remains cynical and skeptical in the face of Good. He also smokes a lot.</p><p>The game is played in third person perspective, switching to first person when the hero enters narrow spaces. Constantine's goal is to discover how and why Demons have managed to physically enter Earth, although the ancient laws forbid it. He utilizes a number of holy weapons and artifacts, from twin revolvers (dubbed the Witch's Curse) that shoot stones from the Holy Lands to Holy Water Bombs and the Cross Shotgun. Constantine can also utilize various kinds of offensive magic powered by the souls of slain demons. Often he will be obliged to travel to Hell, which resembles a perpetually ablaze and decaying version of our world, in order to bypass obstacles. Each level is linear and is played sequentially, following most of the story of the movie with a few sections added in or stretched out to allow for more action. Hidden cards in levels will unlock cutscene animatics, concept art, and interviews with the stars of the film.</p>"},{"name":"Contra: Shattered Soldier","year":2002,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"PS2_COLLECTION_PART5/Contra%20-%20Shattered%20Soldier%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":847977037,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The Contra series has been a popular action game for many people.  Now the original creators have come back to bring the series back to the life.  It has the same feel of the other Contra games, but it has never looked anything like this before.  The gameplay is the same fast 2D style, but enriched with 3D environments and effects.  You can play two players simultaneously as in the past games.  Wide array of weapons are available, many of the oldies, some enhanced, some new.  Unlockable endings and levels give it even more replay value.</p>"},{"name":"Conveni 3, The","year":2003,"developer":"Masterpiece Co., Ltd.","url":"sony_playstation2_c/Conveni%203%2C%20The%20-%20Ano%20Machi%20o%20Dokusen%20seyo%20%28Japan%29.zip","filesize":266718754,"score":"","genres":"Simulation > Isometric > Anime / Manga > Managerial / business simulation","desc":"<p>Simulation game “The Conveni” is now “opened” to bring gamers the fun of running a convenience store!<br><br>Featuring the Lawson convenience stores from Japan! You will be able to run a Lawson store which is entirely authentic in terms of its façade, staff uniform and others.<br><br>Popular, well-known items are even sold in their real names! Have fun running the Lawson convenience store!<br><br>Some PlayStation®2 Classics contents may not display correctly when using a standard definition television.</p>"},{"name":"Cool Boarders 2001","year":2001,"developer":"Idol Minds, LLC","url":"sony_playstation2_c/Cool%20Boarders%202001%20%28USA%29.zip","filesize":628666719,"score":6.4,"genres":"Sports > 3rd-person (Other) > Snowboarding / skiing","desc":"<p>This is the fifth game in the Cool Boarders series.  This has many of the same features as previous editions of the series, but includes more board parks with a trick finder option.</p><p>This game also gives you the option to compete against 10 champion snowboarders including Todd Richards, Tara Dakides, Kevin Jones.</p><p>Compete in the Vans Triple Crown of Snowboarding to unlock different tracks and boards.  There are a total of 20 different courses featuring 9 different events including downhill, slalom, and trick complete.</p><p>The soundtrack also features modern music from bands including Stone Temple Pilots, Fear Factory, and Blind Dog.</p>"},{"name":"Cool Shot","year":2003,"developer":"DigiCube Co., Ltd.","url":"PS2_COLLECTION_PART5/Cool%20Shot%20%28Europe%29.zip","filesize":64103530,"score":"","genres":"Sports > Diagonal-down > Pool / snooker","desc":"<p><em>Cool Shot</em> features 5 gameplay modes:</p><ul><li>9-ball pool</li><li>Traditional 8-ball pool</li><li>Rotation</li><li>One Pocket</li><li>14-1 continuous pool</li></ul><p>The game supports single-player and multiplayer modes.</p>"},{"name":"Coraline","year":2009,"developer":"Papaya Studio Corporation","url":"PS2_COLLECTION_PART5/Coraline%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1361774535,"score":5.8,"genres":"Action > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p>Based on the the movie, players jump into the shoes of Coraline, a young girl who is not happy with her current life. Coraline is drawn through a tiny door in her new house which leads to a strange world that seems perfect. Coraline soon realizes that this \"Other World\" is not all it seems, and she must find a way to escape back to reality.</p><p>Players progress through the story by completing puzzles and interacting with the characters from the movie. Content can be purchased to customize Coraline's appearance along the way. Coraline needs to be guided through the story on her mission to free herself from the other world. She can wander to any location from the movie in a free-roaming environment, picking up clues and useful items along the way.</p>"},{"name":"Corvette","year":2004,"developer":"Steel Monkeys","url":"PS2_COLLECTION_PART5/Corvette%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":641689442,"score":6.2,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Licensed","desc":"<p>Celebrate the 50th anniversary of the great American dream machine.  This race game features over 100 Corvette models, from the 1953 original to the fine-tuned 2003.  Simple single and split-screen player modes are available, or start from the beginning and race through history, collecting and upgrading cars along the way.  There are over 15 tracks, with alternate routes that can be unlocked through races.  Models and colors are true to spec, although custom cars can be unlocked as well.</p>"},{"name":"Corvette Evolution GT","year":2006,"developer":"Milestone s.r.l.","url":"sony_playstation2_c/Corvette%20Evolution%20GT%20%28USA%29.zip","filesize":1268937718,"score":6.7,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Evolution GT</em> is a simulation-racing game that gives the player the opportunity to experience the life of a real racing driver throughout the course of his career. By choosing appropriate race tactics and driving styles, the player will grow in his ability to compete at an ever-higher level, gaining access to new racing cars as well as roadsters, coupès and eventually dream cars. Races take place across Europe; from the beautiful landscapes of the Scottish Highlands and the Cote d'Azur to London and Barcelona, without missing out on historic racing venues such as Laguna Seca or Hockenheim.</p>"},{"name":"Covert Command","year":2006,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART5/Covert%20Command%20%28Europe%29.zip","filesize":222363097,"score":"","genres":"Action > Behind view > Shooter > Direct control > World War II","desc":"<p><em>Covert Command</em> is a single player third person shooter set during World War II. In the game the player will take on the role of an unexperienced soldier that is send to the battlefield.</p><p>The offers a total of thirty missions witch usually involve killing all enemies, destroying a certain target or completing the mission in a set time. Terrain ranges from towns to jungle. While playing the player can use grenades and guns to kill the enemies. Addition ammo and guns can be recovered from the killed enemies sometimes.</p>"},{"name":"Cowboy Bebop: Tsuioku no Yakyoku","year":2005,"developer":"","url":"sony_playstation2_c/Cowboy%20Bebop%20-%20Tsuioku%20no%20Serenade%20%28Japan%29%20%28Shokai%20Genteiban%20Box%29.zip","filesize":1272598948,"score":"","genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Puzzle elements > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>Taking place in the Cowboy Bebop universe, the year is 2071 and the earth has been destroyed. But humanity lives on and on the spaceship \"Bebop\" travel companions Spike, Faye, Jett, Ed and their dog Ein as they search for bounties to collect and pay the bills.</p><p><em>Cowboy Bebop: Tsuioku no Yakyoku</em> is a 3rd person action adventure game, featuring beat-em-up and shooter action along with puzzle solving. Players select either Spike, Jett or Faye, each with their own abilities, and work to track down different wanted criminals. There are a variety of people to converse and interact with, and several puzzles that must be solved in order to catch the wanted criminals.</p>"},{"name":"Crabby Adventure","year":2007,"developer":"CyberPlanet Interactive Public Co., Ltd.","url":"PS2_COLLECTION_PART5/Crabby%20Adventure%20%28Europe%29.zip","filesize":33411736,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Real-time > Tile matching puzzle","desc":"<p>Crabby's Kingdom is under attack and is being destroyed by Marble's army! Test your speed in this exciting Adventure, as you defend Crabby's Kingdom by all means necessary.<br><br>Includes: * 30 levels * Beautiful beaches * Time Attack Mode to perfect your speed * 3 game modes: Story Mode Time Attack Mode Survival Mode * Many creative powerups and items</p>"},{"name":"Crash 'N' Burn","year":2004,"developer":"Climax Racing","url":"PS2_COLLECTION_PART5/Crash%20%27n%27%20Burn%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":486895726,"score":6.8,"genres":"Racing / Driving > 3rd-person (Other)","desc":"<p>Race aggressively against 15 other cars through various courses to win races that are run through city-street circuits. You must also keep your car running by not having it damaged too severely from car crashes. You also have to dodge the wrecks of your competitors which remain on the track after they have crashed one too many times. After each race you win, you earn cash that can be used to upgrade the cars in your garage. There are four car types available: compact, pickup, muscle, and sports.Other race modes include last man standing, bomb tag, running man, and kamikaze.</p>"},{"name":"Crash Bandicoot Action Pack","year":2007,"developer":""},{"name":"Crash Bandicoot: The Wrath of Cortex","year":2001,"developer":"Traveller's Tales (UK) Ltd.","url":"PS2_COLLECTION_PART5/Crash%20Bandicoot%20-%20The%20Wrath%20of%20Cortex%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29%20%28v2.01%29.zip","filesize":468325866,"score":7.1,"genres":"Action > 3rd-person (Other) > Platform > Direct control > Fantasy > Regional differences","desc":"<p><em>Crash Bandicoot: The Wrath of Cortex</em> is the first Crash Bandicoot game for a system other than the original PlayStation. The story is set sometime after Warped: Dr. Cortex wants revenge after being defeated by Crash (again). For this purpose, he creates Crunch, a super-bandicoot who can destroy everything that crosses his way. Crunch's power source is a set of magical masks known as the Elementals, each representing a different element, including Earth, Water, Fire, and Ice. The warp room splits levels into their respective elements, with the boss of each section being a battle against Crunch influenced by the Elemental mask of said section. </p><p>The game is a typical jump and run, with some other action passages, like air combat and a sequence where Crash is trapped inside a giant sphere rolling around in some sort of rollercoaster. All graphics are in 3D, and the sound is typical for cartoon games like this. The whole game is pretty straightforward in design, getting stuck on a puzzle is not really possible.</p>"},{"name":"Crash Nitro Kart","year":2003,"developer":"Vicarious Visions, Inc.","url":"PS2_COLLECTION_PART5/Crash%20Nitro%20Kart%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":2692156727,"score":7.2,"genres":"Racing / Driving > Behind view > Direct control > Automobile > Track racing > Fantasy > Comedy","desc":"<p>Crash Bandicoot returns to the karting scene with a host of other characters from the adventure series, and this time they have both Neo Cortex and Emperor Velo to worry about. Velo has taken the crew to a remote planet, forced to race for their lives against Neo Cortex and his many evildoers.</p><p>Choose from various game modes, from the straight into the action Arcade mode to Adventure mode, following Crash and the gang in the story to save Earth. Race against four friends in multiplayer battle modes, plus connect to the Gamecube for extra options and upload your high scores to the internet ranking system.</p>"},{"name":"Crash of the Titans","year":2007,"developer":"Radical Entertainment Inc.","url":"PS2_COLLECTION_PART5/Crash%20of%20the%20Titans%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1731866247,"score":6.8,"genres":"Action > Behind view > Arcade > Beat 'em up / brawler > Platform > Fantasy","desc":"<p>This version is different from its DS and GBA versions. The story has Crash's arch-nemeses, Neo and Nina Cortex, creating a device that turns the creatures on Crash's island into monsters, threatening to bring an end to existence on the peaceful island. Crash must stop them by \"hijacking\" these monsters and wield their power against the Cortex's.</p><p>The gameplay has the player explore levels, picking up power-ups to use against enemies as well as for the first time, use fighting combos such as punches and kicks against enemies. Players can also \"hijack\" 15 different enemy monsters to use against the others, each with their own special abilities and powers like fire breathing and earthquakes. Players can also interact with their world, climbing trees and swinging from ropes and even surf and skate throughout the levels. There is also co-op abilities where a friend can pop into the game at any point.</p><p>The games across are almost identical, excluding controls (the Wii utilizes the Wii-remote) and graphics are different depending on the systems graphics capabilities.</p>"},{"name":"Crash of the Titans: Monster Edition","year":2007,"developer":""},{"name":"Crash Tag Team Racing","year":2005,"developer":"Radical Entertainment Inc.","url":"PS2_COLLECTION_PART5/Crash%20Tag%20Team%20Racing%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":3090046549,"score":7,"genres":"Action > Racing / Driving > Behind view > Direct control > Automobile > Fantasy > Comedy","desc":"<p>When Ebeneezer von Clutch, the owner of the famed racetrack amusement park MotorWorld, has the Black Power Gem that maintains his life force stolen, he charges Crash and friends (and foes) to recover the gem and catch the culprit.</p><p>Similar to previous racing games in the Crash Bandicoot series, players are able to choose from a variety of characters from the series, including both notable allies and enemies, along with several notable new characters. In addition, <em>Crash Tag Team Racing</em> introduces the ability to 'clash' with another racer, allowing the two to create a hybrid vehicle to cooperatively destroy their opponents.</p>"},{"name":"Crash Twinsanity","year":2004,"developer":"Traveller's Tales (UK) Ltd.","url":"PS2_COLLECTION_PART5/Crash%20Twinsanity%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1821994201,"score":6.8,"genres":"Action > Behind view > Side view > Platform > Sandbox / open world > Direct control > Fantasy > Comedy","desc":"<p>Two purple birds called the Evil Twins form a new threat to Crash's homeworld. Crash has to team up with his arch rival Dr. Neo Cortex to put a stop to this new threat.</p><p>Crash Twinsanity is a classic-style Crash platform game, though this time Crash has to work together with Dr. Cortex from time to time. Crash can pick up and throw Dr. Cortex to places he can't reach himself, or use him as a hammer to slap enemies. The consistent conflict between both heroes causes many funny situations.</p>"},{"name":"Crash: Mind over Mutant","year":2008,"developer":"Radical Entertainment Inc."},{"name":"Crazy Chicken X","year":2006,"developer":"Sproing Interactive Media GmbH","url":"PS2_COLLECTION_PART5/Crazy%20Chicken%20X%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":42871084,"score":5.8,"genres":"Action > 1st-person > Shooter","desc":"<p>Moorhuhn returns with a complete redesign in 3D in this sequel to previous titles of the Moorhuhn shooter series. Instead of simply flying and running around, the chickens feature a lot of animated motion sequences that make them seem almost alive. The surroundings are completely generated in 3D and feature a lot of crazy objects and scenes such as two hedgehogs playing cards (one is actually wearing dark sunglasses!). The chickens try to hide in every conceivable place on screen, be it an old oven or in an outdoor toilet. They hide in wheat fields and even dress up as a sunflower in order to escape the player's dreadful gun. All these features make it more difficult for the player to get all the chickens. The actual shooting controls remain the same as in previous Moorhuhn games: the player aims with the mouse, shoots by clicking the left mouse button and reloads by clicking the right mouse button.</p>"},{"name":"Crazy Frog Arcade Racer","year":2007,"developer":"Neko Entertainment SARL","url":"sony_playstation2_c/Crazy%20Frog%20Arcade%20Racer%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":461039743,"score":4.4,"genres":"Racing / Driving > 3rd-person (Other) > Behind view > Mini-games > Direct control > Automobile > Bike / bicycling > Mecha / giant robot > Licensed","desc":"<p><em>Crazy Frog Racer 2</em> is a one- or two-player game featuring \"the most annoying thing on the planet\" and friends in a series of races and mini-games. The game also includes the two videos released by the Crazy Frog, \"Axel F\" and \"Popcorn\".</p><p>The game installs in English, French, German, Italian or Spanish at a default resolution of 800x600 but this can be changed. Its default controls are all on the keyboard but joystick and paddle are also supported.</p><p>Though this is, at its heart, a basic racing game there are lots of options. All the single player options apart from Time Trials have three levels of difficulty, the options are:* Championship. There are four cups to win, The Football Cup, The Ice Cup, The City Cup, and the Beach Cup, initially The Football Cup is the only one available the last three must be unlocked by winning the previous trophy.</p><ul><li><p>Single Race with twelve different courses and twelve characters available</p></li><li><p>Chase Race where the player must stay ahead of the chasing drones for as long as possible</p></li><li><p>Time Trials where the player races round the track with no opponents aiming to beat their previous best time</p></li><li><p>Mini Games, there are two of these Crazy Frog Pinball and Crazy Dance.</p><ul><li><p>Crazy Frog Pinball is unlike most pinball games as there are no paddles. The frog is fired from a canon onto the play area where it careens around destroying any robots it hits. When it hits a robot, or when it runs out of momentum, it stops and a rotating compass ring appears around it, when the dial is pointing in the desired direction the player presses the Spacebar and the process repeats. There is a separate arena for each music track and each has three difficulty levels</p></li><li><p>In Crazy Dance arrows appear rhythmically on screen and the player must hit the corresponding button on the numeric keypad 'bemani' style. Crazy dance can be performed in three levels of difficulty with any of the music tracks.<br>The music tracks available in these games are 'Hey Baby', 'I'm too sexy', 'Final Countdown', 'Axel F', and 'Popcorn'.</p></li></ul></li></ul><p>In the two-player mode the game options are:* Championship: this is the same as the single player option</p><ul><li><p>Single Race: also the same as the single player option</p></li><li><p>Battle: this is the only game mode that is unique to the multiplayer game. Players have three lives and compete in any of four arenas, last one standing wins.</p></li></ul><p>In all game options, apart from Time Trials and the mini-games, there are on-track bonuses to be collected for weapons, armour and defence.</p>"},{"name":"Crazy Frog Racer","year":2005,"developer":"Neko Entertainment SARL","url":"PS2_COLLECTION_PART5/Crazy%20Frog%20Racer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":380699199,"score":4.1,"genres":"Racing / Driving > Behind view > Real-time > Direct control > Motorcycle > Track racing > Fantasy > Licensed","desc":"<p>Take Crazy Frog, known from the ring tone, and a bunch of his friends and enemies in crazy kart-style races around 12 tracks in 4 cups (baby, funny, crazy and special), and collect the crazy power-ups. Hopefully you like his trademark sounds because you'll hear them quite often. You can play with 4 friends in 3 different multiplayer modes: championship, single race or a battle. Aside from Crazy Frog, you can choose Ninja Gorilla (Bobo), Matilda the Cow, Ellie the Fairy, the Gangsta kids (Flash, Grim and Jack), Mad French Chef (Michel) and Drone.</p><p>During the races, you can collect coins to accumulate and drop hazards, such as mines, rockets or boosts. The main singleplayer game modes include championship, single race, time trial and chase. In the options screen, you can listen to 12 Crazy Frog songs on a jukebox.</p>"},{"name":"Crazy Golf","year":2006,"developer":"Beyond Reality Games Ltd.","url":"PS2_COLLECTION_PART5/Crazy%20Golf%20%28Europe%2C%20Australia%29.zip","filesize":87704708,"score":"","genres":"Sports > Behind view > Turn-based > Golf","desc":"<p><em>Crazy Golf</em> is a mouse controlled arcade style golf game for up to four people. This game can be played as a single-player game or as a multiplayer game, all games are in full screen mode. There's no option to enter a player rid or player name, the player(s) select one of the four available canine avatars which are said to have individual personalities. There are three worlds / courses to play on, Sea World is available from the start while Sky World and Space World must be unlocked.</p><p>Single player modes are:* Career mode: here the player must achieve a set number of par scores, or better, on a course to advance, 14 par holes from 18 are needed to achieve the Bronze Trophy, 16 pars for the Silver Trophy and a perfect 18 par scores are needed for the Gold Trophy.</p><ul><li>Tournament mode: here the player plays any unlocked course trying to match or beat the par score</li></ul><p>Multiplayer modes are:* Versus Mode: play any unlocked course, and scoring a point for each hole won</p><ul><li><p>Grand Prix Mode: Players compete over 9, 18, or all currently unlocked holes in a random order.</p></li><li><p>Party Mode: play any unlocked hole on any unlocked course for fun.</p></li></ul><p>The game was first released on the PlayStation 2 platform. The PC version plays directly from the disc.</p>"},{"name":"Crazy Golf: World Tour","year":2005,"developer":"Beyond Reality Games Ltd.","url":"PS2_COLLECTION_PART5/Crazy%20Golf%20-%20World%20Tour%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":92547645,"score":"","genres":"Sports > Behind view > Turn-based > Golf","desc":"<p><em>Crazy Golf World Tour</em> is a mini golf game for up to four players. The game is in full 3D and features a number of perspectives from which the game can be viewed. Default is a behind the back perspective but this can be changed to a top down perspective for better overview of the course. The PC version is controlled by the mouse, both to aim and to swing with the club. Moving the mouse back and forth quickly will result in a hard shot.</p><p>The game's courses all have different obstacles like water hazards, slopes, jumps and moving objects. There's three courses in total, each with 18 holes. Each course has its own theme, be it the Wild West, Ghost World or Pirates Cove. The game has four game modes. In career the player has to achieve as many pars as possible to unlock the next course. In tournament the player has to complete the course in the lowest number of shots. In speed golf the player plays against the clock. Last, in the practice mode the player can play any unlocked course just for the fun of it.</p>"},{"name":"Crazy Taxi","year":2001,"developer":"Hitmaker","url":"sony_playstation2_c/Crazy%20Taxi%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":97272991,"score":7.6,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing","desc":"<p><em>Crazy Taxi</em> is an arcade-like racer where the player takes the role of a taxi driver who weaves his way through crowded streets, across sidewalks, and even underwater, in a wild and frantic race to deliver passengers on time. The courses are largely set inside cities crowded with general traffic and pedestrians (which can't be run over, they dive away). The main goal is to bring as many customers as possible to their destination in time. Available customers are marked through circles and the color represents the distance and the fare they offer. Green means long rides with plenty of money, and red ones are very short. </p><p>In the main Arcade mode, there is a timer that quickly runs down. It can be replenished by picking up customers. While driving reckless maneuvers are encouraged. Players can disregard all traffic rules and customers give extra tips for speedy and dangerous driving, but these can only be cashed when the customer arrives at his destination in time. By the same token, the reward at the end of a ride is based on the amount of time left, as each customer also has a personal timer. The city is filled with slopes and jumps, and the game uses a very loose driving model. No damage can be done to the car, so driving as fast as possible is encouraged. While driving players can toy with the gears to perform two special tricks: a crazy drift and a crazy boost to speed up more quickly.</p><p>Next to the Arcade mode, there is an Original mode and Crazy Box where specific goals need to be met on closed-down courses. In the regular modes, it is possible to disregard the usual timer and play for a fixed amount of minutes. At the end of the race, the player is rewarded with a license, either D, C, B, or A, with S for outstanding performance. Next to the interactive courses from the arcade version, there is a new course for home consoles. There are four cabs and drivers to choose from. The cars have different statistics and the drivers' different attitudes while racing. The game has a soundtrack featuring The Offspring and Bad Religion (not for the Xbox 360 version).</p>"},{"name":"Crescent Suzuki Racing","year":2004,"developer":"Kuju Entertainment Ltd.","url":"PS2_COLLECTION_PART5/Crescent%20Suzuki%20Racing%20%28Europe%29.zip","filesize":73728145,"score":"","genres":"Racing / Driving > Sports > Behind view > Motorcycle > Licensed","desc":"<p><em>Crescent Suzuki Racing</em> is a motorcycle race game for one or two players.</p><p>Crescent Racing is a race team based at the Crescent motorcycle dealership based in Dorset, England. The team has won many titles and is the official racing team of Suzuki in the UK.</p><p>This game gives the player a chance to race in six championships comprising the Amateur Series, Pro Racing or Super Cup GTR races for super bike or super sidecar. There is also a time trial race mode where the player has to beat a set time on a series of tracks.There are sixteen different tracks including Altendorf Aerodrome, Atlanta Raceway, Glendale Raceway, Rouen and Woodcote Park and twenty five kinds of super bike and super sidecars available to be ridden. However most bikes and most tracks are locked and become available as the player progresses through the game.</p><p>There are three levels of difficulty. Player one defaults to keyboard controls while player two may use either keyboard or another controller.</p>"},{"name":"Cricket 07","year":2006,"developer":"HB Studios Multimedia Ltd.","url":"PS2_COLLECTION_PART5/Cricket%2007%20%28Europe%2C%20Australia%29.zip","filesize":1132223430,"score":"","genres":"Sports > Behind view > Diagonal-down > Cricket > Licensed","desc":"<p>Time once again to don those pads and gloves, put your helmet on and your box in, pick up that willow bat and stride to the cricket pitch in EA Sports Cricket 07.</p><p>Pick from a choice of 16 international sides including England, Australia, India, South Africa or the West Indies and lead your team to domination on the field in the World Championship, play a Test Series or go on a tour encompassing one day matches, test matches and tour matches. Relive the 2005 Ashes Tournament in England or play the return leg Down Under.</p><p>Alternatively play as one of England's county teams for a season of county cricket. Play in the Liverpool Victoria County Championship four-day two-innings tournament. Compete in the NatWest Pro40 tournament, the C&amp;G Trophy and the Twenty20 Cup.</p><p>And for Australia you can play as one of the six State sides for a season of state cricket. Compete in the Pura Cup, the One Day Domestic Series or the KFC Twenty20 Big Bash.</p><p>This game supports up to four players and features \"Century Stick\" analog batting controls to choose your batting parameters to select foot choice, shot direction power and timing. Alter your bowler's line of attack with \"Quickswitch\" bowling and change between fielding positions with on-the-fly \"Dynamic Field Positioning.\"</p>"},{"name":"Cricket 2002","year":2001,"developer":"HB Studios Multimedia Ltd.","url":"PS2_COLLECTION_PART5/Cricket%202002%20%28Europe%29%20%28v2.00%29.zip","filesize":501372018,"score":"","genres":"Sports > Behind view > Diagonal-down > Cricket > Licensed","desc":"<p>This is another in Electronic Arts annual cricket franchise which first started with Cricket 96 however this was the first game developed by HB Studios.  </p><p>All ten international teams are represented together with twenty-two international stadia allowing the player to play one day games and test matches. As the player progresses through the game there are unlockable tournaments and historic teams to extend the gameplay. Other features include detailed controls that, for example, allow the player, as bowler, to spin, seam or change the pace of the ball.</p><p>The game has commentary from Richie Benaud.</p>"},{"name":"Cricket 2004","year":2004,"developer":"HB Studios Multimedia Ltd.","url":"PS2_COLLECTION_PART5/Cricket%202004%20%28Europe%29%20%28v2.00%29.zip","filesize":539258445,"score":"","genres":"Sports > Behind view > Cricket > Licensed","desc":"<p><em>Cricket 2004</em> has full licenses from the Australian, English and Wales, New Zealand, South African Cricket Boards and theInternational Cricket Council (ICC). The game has 56 teams with over 1,200 players, domestic and international. Create cricket legends with the full player editor. The game has a TV style to it, with full action replays, the third umpire, etc.</p>"},{"name":"Cricket 2005","year":2005,"developer":"HB Studios Multimedia Ltd.","url":"PS2_COLLECTION_PART5/Cricket%202005%20%28Europe%29.zip","filesize":3215820050,"score":6.3,"genres":"Sports > Behind view > Diagonal-down > Cricket > Licensed","desc":"<p>Electronic Arts continues its yearly cricket franchise with this outing. The Australian, English, South African and New Zealand national and league teams' names and likenesses are licensed. If you don't want likenesses of official players, then make your own with the built-in player editor to make the game custom to you. With 35 stadiums accurately modeled with real crowd noise the atmosphere is set for this TV style presentation (with action replay mode, third umpire, animated duck sequences, and TV style overlays) of cricket. </p><p>Fielding is fully automated, and it is possible to skip the entire bowling innings. Batting depends as much on shot timing as selection, while running between the wickets is faster than in previous editions. There are 13 tournament modes including domestic and international one-day and test matches, including England County Cricket's fast-paced Twenty20 Cup, and 2 net practice modes. The game has commentary from Richie Benaud and Jim Maxwell.</p>"},{"name":"Crime Life: Gang Wars","year":2005,"developer":"Hothouse Creations Ltd.","url":"PS2_COLLECTION_PART5/Crime%20Life%20-%20Gang%20Wars%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3720585417,"score":4.4,"genres":"Action > Diagonal-down > Fighting > Crime","desc":"<p>Crime Life is a mission-based street combat game following a storyline involving multiple gangs, corrupt cops and betrayal from within.</p><p>The player controls Tre, a new member of the Outlawz gang on his rise to the top within the fictional city of Grand Central. The Outlawz face trouble as rival Headhunterz and KYC gangs join forces against them. The members of the rap band D12 feature their voices and likenesses as the key members of the enemy Headhunterz gang.</p><p>The gameplay is influenced by old school beat-em-ups, meaning hand-to-hand combat is the main focus here. As well as featuring twenty-five story-based missions, Crime Life also gives the player the freedom to explore the game world and to experience mini-missions that include fighting whilst drunk and taking control of rival turf.</p>"},{"name":"Crimson Sea 2","year":2004,"developer":"KOEI Co., Ltd.","url":"PS2_COLLECTION_PART5/Crimson%20Sea%202%20%28Europe%29.zip","filesize":3455673012,"score":7.3,"genres":"Action > 3rd-person (Other) > Anime / Manga > Sci-fi / futuristic","desc":"<p>The sequel to Crimson Sea, this game follows the story of Sho, the protagonist of the first game. In the distant future, a solar system called Theophilus is once again attacked by a mysterious alien race, called \"the menace\". The brave bounty hunter Sho, who wields a special sword which he can also use as a gun, is determined to put an end to the invasion. During his adventure he encounters a girl named Feanay, who will help him on his journey.</p><p>In this action game you control both Sho and Feanay. Some of the missions can be accessed by both characters, while some are available only to one of them. Feanay uses energy pistols and dual laser swords as weapons. Both Sho and Feanay use the so called \"neo-psionics\", which are the magic spells of the game. There are also slight role-playing elements in the game. Defeated enemies drop special items that can be later used to upgrade your weapons. You also gain set amounts of experience points after missions.</p>"},{"name":"Crimson Tears","year":2004,"developer":"Dream Factory Co., Ltd.","url":"PS2_COLLECTION_PART5/Crimson%20Tears%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":3584895412,"score":6.7,"genres":"Action > Role-playing (RPG) > Diagonal-down > 2D scrolling > Anime / Manga > Sci-fi / futuristic","desc":"<p>The year is 2049, and Tokyo is in the midst of dangerous street riots. Dr. Kosugi, a scientist working for the A.R.M.A. corporation, has created three \"mutanoids\" - powerful bio-engineered fighters who regard him as their father. When they find out that Dr. Kosugi is missing, they venture into the dangerous areas of the city to bring him back and punish the culprits.</p><p><em>Crimson Tears</em> is an action game with role-playing elements. Controlling either of the three protagonists (Amber, Kadie, or Tokio), each with their own strengths and weaknesses, the player explores randomly generated, enemy-infested stages, disposing of the foes in combo-based hack-and-slash combat. Experience points are gained from battle victories, allowing the characters to level up and become stronger.</p><p>Weapon components can be collected from fallen enemies and combined to make new weapons. Like the characters themselves, weapons level up, increasing in attack power and reducing the necessity to repair them. The protagonists have access to ranged attacks, blocks, and powerful area attacks. The player should also keep an eye on their temperature meter, preventing them from overheating.</p>"},{"name":"Critical Bullet: 7th Target","year":2002,"developer":"Capcom Co., Ltd.","url":"sony_playstation2_c/Critical%20Bullet%20-%207th%20Target%20%28Japan%29.zip","filesize":645151027,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Sci-fi / futuristic > Detective / mystery","desc":"<p><em>Critical Bullet: 7th Target</em> is a sequel to Bounty Hunter Sara: Holy Mountain no Teiō. The stage is Neo Tokyo, a dark futuristic city where crime reigns and where no police force is strong and courageous enough to stop the criminals. This is where Sara Fitzgerald, a freelance bounty hunter, enters the picture. Your goal is to plunge into the crime world of Neo Tokyo and ultimately to defeat the greatest mafia bosses who are pulling its strings.</p><p>The gameplay is similar to that of the predecessor: you are required to make decisions for Sara, that will open to you different paths, but also might lead to tragic outcome. New is the addition of CG movies to advance the storyline, and the ability to \"rewind\" the game in order to be able to check out exactly where a wrong decision might have been taken.</p>"},{"name":"Crossword","year":2004,"developer":""},{"name":"Crouching Tiger Hidden Dragon","year":2003,"developer":"LightWeight Co., Ltd.","url":"PS2_COLLECTION_PART5/Crouching%20Tiger%2C%20Hidden%20Dragon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2990440473,"score":5.6,"genres":"Action > Behind view > Martial arts > Licensed","desc":"<p>Set in Qing dynasty of 19th Century China, this adaptation of the film of the same name follows the path of the characters Jen, Yu Shu Lien and Li Mu Bai. When warrior Li decides to retire from fighting, he gives his famous jade sword, The Green Destiny, to a nobleman. The weapon is stolen shortly afterwards, and he has to hunt down the thief with his friend Yu Shu Lien, while the sassy nobleman's daughter Jen keeps crossing their path.</p><p>The epic story has been split up in three parts, one for each character. The game mimics the film's famous martial arts, based on the Wudan fighting style, with a set of basic attacks, attack combos and special moves, combined with defensive actions such as basic blocking, combo blocking and evasion. While fighting, the characters learn new moves, collect items and earn rewards. Skills are improved according to your fighting style. Using specific attacks (e.g. unarmed) boosts the related skills, which can be leveled up.</p><p>There are different flavours of weapons to be collected, from axes to  swords, spears and sabers, and even exotic variants such as falchion, firangi or gloive. New ones can be acquired during battle, but enemies can pick them up as well.</p>"},{"name":"Crusty Demons","year":2006,"developer":"Climax Action Limited","url":"PS2_COLLECTION_PART5/Crusty%20Demons%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3123124891,"score":5.4,"genres":"Racing / Driving > Sports > 3rd-person (Other) > Tricks / stunts > Motorcycle > Off-roading","desc":"<p><em>Crusty Demons</em> is an extreme sports game based on the real-life stunt troupe of the same name. Motorized vehicles such as motorcycles and cars are used in performing tricks on ramps, half-pipes and over open areas. Large environments such as trailer parks and international cities like New York and Tokyo are available for the player to explore, do tricks and race.</p><p>The story of the videogame has the Crusty Demons meeting the Devil and agreeing to sign over their souls if given immortality. However, the Crusty Demons want to renege on the deal once they find out that they can still feel pain when fatally injured. The Devil, not without mercy, agree to offer back their souls on the condition that the Crusty Demons follow his every order and fulfill his demands for whatever stunt he asks of them.</p><p>Whenever a stunt goes fatally wrong, the games rag doll engine rewards the player with a graphic simulation of the collision or bail. This is also conjoined with the appropriate blood splatter on the screen as well as x-rays that show whichever bones have broken. Unlockables consist of pictures of \"babes\".</p>"},{"name":"CSI: Crime Scene Investigation - 3 Dimensions of Murder","year":2007,"developer":"Telltale, Inc.","url":"sony_playstation2_c/CSI%20-%20Crime%20Scene%20Investigation%20-%203%20Dimensions%20of%20Murder%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":2777153982,"score":6.8,"genres":"Adventure > 1st-person > Puzzle elements > Detective / mystery > Licensed","desc":"<p>You'll have 5 bloody cases to solve as you play a rookie investigator with the Las Vegas crime lab. The first four ultimately connect together towards solving the 5th. Your co-workers are characters from the CSI television series and voice acting is done by the real actors and actresses from the show.</p><p>Choose one of 3 levels of difficulty depending upon how familiar you are with the tv shows (and computer gaming in general). Those modes affect how much interactive help you receive inside the game - not from your co-workers, but by way of hotspots and evidence analysis. The game features a tutorial to help with the interface, which is point and click.</p><p>Asking your partner for \"hints\" detracts points. At the end of each case, Gil Grissom (the boss) will rate your performance as either a rookie, investigator or master. Your objective is to gather enough evidence and information to arrest the culprit(s) and achieve as close to a 100% rating as possible (master). This will unlock \"special features\" at the end of each case.</p><p>Unlike the previous games, the graphics are 3D allowing you a more full view of your environment. Like the earlier games, however, there is still limited exploration of the world around you.  The 3D system does provide the ability to move evidence objects in different angles which helps to locate all available fingerprints and other possible evidence.</p>"},{"name":"Cubix: Robots for Everyone - Showdown","year":2003,"developer":"Blitz Games Ltd","url":"sony_playstation2_c/Cubix%20Robots%20for%20Everyone%20-%20Showdown%20%28USA%29.zip","filesize":383686047,"score":"","genres":"Action > 3rd-person (Other) > Real-time > Turn-based > Puzzle elements > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p><em>Cubix: Robots for Everyone - Showdown</em> is a futuristic themed 3D action adventure game based on the Cubix: Robots for Everyone TV series.</p><p>The robots in Bubble Town have been infected by a substance known as Solex makes them hostile and destroy the town. The evil Doctor K. is after them now, and Connor and Abby must track the infected robots down before Doctor K. does.</p><p>In the game, the player takes control of either Connor or Abby and has to explore Bubble town by solving puzzles and battling robots. You have the ability to jump and move objects. The robot battles are turn-based and when won the robot is added to your battle team and can be used in the next battle. More than twenty-five robots can be collected. Cubix the main robot can transform into several vehicles. The game also includes mini-games that can be played with up to four players.</p>"},{"name":"Cue Academy: Snooker / Pool / Billiards","year":2006,"developer":"Icon Games Entertainment Ltd.","url":"PS2_COLLECTION_PART5/Cue%20Academy%20-%20Snooker%2C%20Pool%2C%20Billiards%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":139573736,"score":"","genres":"Sports > 1st-person > Pool / snooker","desc":"<p>The Cue Academy has one goal: to transform you into the greatest player in history. Your Snooker, Pool, and Billiards skills will be honed until they're razor sharp, enabling you to compete against a host of the most intelligent opponents you could ever meet.<br><br>* Huge Tour mode: compete against other players, unlock new content and negotiate sponsorship deals<br>* Exhibition and Tournament modes in Pool, Snooker and Billiards, with multiple rule variants to explore and master<br>* Incredible amount of unlockable content, environments, baizes, tables, cues, ball sets and more giving endless replay value<br>* 1-8 players competing in singles matches, leagues and tournaments in all game modes, with full access to all unlocked content<br>Some PlayStation®2 Classics contents may not display correctly when using a standard definition television.</p>"},{"name":"Culdcept","year":2002,"developer":"Omiya Soft, Co. Ltd.","url":"sony_playstation2_c/Culdcept%20%28USA%29.zip","filesize":967266126,"score":7.9,"genres":"Strategy > Isometric > Board game > Cards / tiles > Trading / collectible card > Fantasy","desc":"<p><em>Culdcept</em> is a hybrid board/card game where the objective is to generate the most mana before making it back to the castle.</p><p>Each player starts out with a deck of 50 cards. Card types range from monster cards (e.g. Skeleton), which are used to accumulate territory on the board to increase your mana; Equipment (e.g. Chain Mail), which will boost your monsters' abilities when they battle; and Magic (e.g. Holy Word 0), which can be used to help you or hinder the other players on the board. When a player lands on another player's monster, he/she can challenge it to a battle in an attempt to take over the territory. If the attacker wins, he/she gets the space on the board and additional mana.</p><p>There are more than sixteen different game boards, each with different rules and layouts (such as the maximum number on dice rolls, the elements on the board, etc.)</p>"},{"name":"Cupid Bistro!! 2","year":2003,"developer":"Firedog Creative Company Limited"},{"name":"Curious George","year":2006,"developer":"Monkey Bar Games","url":"PS2_COLLECTION_PART5/Curious%20George%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%2CDa%29.zip","filesize":2750991938,"score":6.3,"genres":"Action > 3rd-person (Other) > Platform > Licensed","desc":"<p><em>Curious George</em> is a platformer based on the animated movie of the same name. Ted Shackleford, a human with a big yellow hat, visits Africa in search of an idol. This project does not work out, but he finds a new friend: the monkey Curious George. The game follows their way back to America and shows scenes from the movie as cutscenes.</p><p>During the thirteen linear levels, the player takes control over George. The majority of time is spent with platform challenges which usually involve jumping or swinging over gaps. Frequently the levels are interrupted by mini-games, Those involve simple tasks, for example, rhythm sequences (pressing given buttons with the correct timing) or arcade sequences. Optionally the player can collect bananas on the way and receive special points by interacting with certain objects. Those are used to unlock bonus content: the cutscenes and mini-games already experienced during regular play as well as a few hats for George to wear.</p>"},{"name":"Curry House CoCo Ichibanya: Kyō mo Genki da! Curry ga Umai!!","year":2004,"developer":"Dorasu","url":"sony_playstation2_c/Curry%20House%20CoCo%20Ichiban%27ya%20-%20Kyou%20mo%20Genki%20da%21%20Curry%20ga%20Umai%21%21%20%28Japan%29.zip","filesize":45649982,"score":"","genres":"Simulation > 3rd-person (Other) > Licensed","desc":"<p><em>Curry House CoCo Ichibanya</em> is a cooking and restaurant management game featuring the popular Japanese curry restaurant chain CoCo Ichibanya.</p><p>The player can be either the waiter or the chef. Playing as the waiter, the player must greet customers as they enter or leave the restaurant, take orders to the chef, and take completed orders to the customers. As the chef, the player must select ingredients and prepare the correct dishes similar to Cooking Mama or Ore no Ryōri. In two-player modes, one player is the chef while the other is the waiter, while in single player modes the computer takes control of whichever job the player isn't doing.</p><p>The main game mode is the Road To Curry story mode, where the player takes the role of a new hire named Kokoichi who must work his way up to becoming the store manager. There is also a curry quiz, and several minigames that aren't related to curry.</p>"},{"name":"Curse: The Eye of Isis","year":2003,"developer":"Asylum Entertainment Ltd.","url":"PS2_COLLECTION_PART5/Curse%20-%20The%20Eye%20of%20Isis%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":465032001,"score":6.5,"genres":"Action > 1st-person > 3rd-person (Other) > Puzzle elements > Shooter > Horror","desc":"<p>Someone has stolen an artifact from the British Museum - a sacred (and CURSED) Egyptian statuette called the \"Eye of Isis\". You are called in to investigate its disappearance, find and return it to the pyramid where it once resided. The deadly curse must be stopped, and time is of the essence!</p><p><em>Curse: The Eye of Isis</em> is a horror action game. Choose to play either Dr. Darien Dane or his assistant, Victoria Sutton. Each character has different scenarios to complete to reach the same objective. Travel to seven different locations, battling undead monsters (zombies, mummies, etc. and their bosses) as well as animated deadly objects. Locate and use a variety of weapons including a shotgun, rifle, pistol, truncheon, crossbow, flame-thrower and mortar gun. Find clues, characters and puzzles to help you discover the location of the sacred statue.</p><p>During the game, realtime 3D cut scenes, interactions with NPCs as well as visual and audio messages provide more information to advance the story line. Gameplay is in 3rd person with action scenes reverting to 1st person.</p>"},{"name":"Cy Girls (Disc 1)","year":2004,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_c/Cy%20Girls%20%28USA%29%20%28Disc%201%29%20%28Ice%29.zip","filesize":3175032709,"score":6,"genres":"Action > Behind view > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Licensed","desc":"<p>It's the 21st century (a couple of decades ahead of the present time), and the world is dark cyberpunk place where cyber gear may be as deadly as a real metal gear. The game features two main characters, both ready to handle any given situations, both with special skills and abilities, and what's most important, both girls. Each girl has different methods of dealing with things and different storylines, and you can select with whom to play the game through (each girl has its own disc to boot up). Ice takes her confidence in the firearms and is cool and loud, while Aska is a ninja who prefers stealth over exposure, and uses blunt weapons like swords and daggers.</p>"},{"name":"Cy Girls (Disc 2)","year":2004,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_c/Cy%20Girls%20%28USA%29%20%28Disc%202%29%20%28Aska%29.zip","filesize":2863938027,"score":6,"genres":"Action > Behind view > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Licensed","desc":"<p>It's the 21st century (a couple of decades ahead of the present time), and the world is dark cyberpunk place where cyber gear may be as deadly as a real metal gear. The game features two main characters, both ready to handle any given situations, both with special skills and abilities, and what's most important, both girls. Each girl has different methods of dealing with things and different storylines, and you can select with whom to play the game through (each girl has its own disc to boot up). Ice takes her confidence in the firearms and is cool and loud, while Aska is a ninja who prefers stealth over exposure, and uses blunt weapons like swords and daggers.</p>"},{"name":"Cyber Troopers Virtual-On Marz","year":2003,"developer":"Hitmaker","url":"sony_playstation2_c/Cyber%20Troopers%20-%20Virtual-On%20Marz%20%28USA%29.zip","filesize":2618816739,"score":6.3,"genres":"Action > 3rd-person (Other) > Anime / Manga > Arcade > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>The world is just a business, especially when it comes to making money out of entertainment. For many, the creation of the Virtuaroids (VR) began a new age as the 49-foot mechanical giants gained the attention of everyone and anyone nearby. Noticing this, business makers used the opportunity to create a new form of entertainment upon the surface of Mars. Known as Limited War, the performances drew crowds the universe over. It wasn't until corporate greed appeared once more that things began to fall out of control. </p><p>Those in power began to fight each other for a stake in the new events, leading to internal fighting and crime. A special investigations unit was formed, in hopes it would eliminate such crime and bring order back. They are known as 'MARZ', and as a member of that team you must use your new found position to your advantage. </p><p>In each mission, you will control your own VR and must defend or attack a number of key locations and other VR units. Over time you will gain new additions to the machines armour and weapons which will aid you in later missions. You'll also unlock bigger and more powerful VR's as well.</p>"},{"name":"Cybernator","year":2004,"developer":"NCS Corporation"},{"name":"Cyclone Circus: Power Sail Racing","year":2004,"developer":"Playlogic Game Factory BV","url":"PS2_COLLECTION_PART5/Cyclone%20Circus%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":857898700,"score":"","genres":"Racing / Driving > Behind view > Real-time > Arcade > Direct control > Automobile > Flight / aviation > Track racing > Fantasy","desc":"<p>By 2078, earth's natural resources have been depleted. Massive CO2 emissions have occurred and there are no longer fossil fuel reserves. Because of global warming, the rise of the ocean level has made many countries disappear. Fortunately, extreme weather patterns have emerged and wind has become an endless resource with enormous speeds. Mankind has adapted and now uses the powerful wind as a source for transportation, constructing vehicles to make use of it. Additionally, The International Racing League is organized, a racing event where speed is determined by the control of wind. This is where you come in.</p><p><em>Cyclone Circus</em> is a racer where you can compete against 9 computer players or against another player in dual screen mode. The cars sport an exotic and futuristic design, and each car has a plasma sail that you have to use as good as you can. Turning the wind to your advantage, you can pick up numerous bonuses and even power-ups that will catapult you ahead of your opponents. Each level has a very specific setting and atmosphere, and contains a number of special jump sites and bonus areas where you can do special tricks to score more points.</p><p>There are ten characters, nine courses with shortcuts, and eight trick levels based on ramps and fly routes.</p>"}]