[{"name":"D-A:BLACK","year":2003,"developer":"Tonkinhouse","url":"sony_playstation2_d_part1/D-A%20-%20Black%20%28Japan%29.zip","filesize":1385230906,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Real-time > Visual novel","desc":"<p>High-school student Tōya Shinjō is what's known as a \"Shinigami\" -- an envoy of Hell who guides wandering souls, or \"Creeps\", who linger in the human realm. Each night, he hunts Creeps along with his partner Yuriel Arlencloyn, a white-winged Angel of Heaven. However, one night during their hunt, they happen to rescue a girl named Natsuki who recognizes Tōya as her classmate. Normal humans are not meant to know of such things as Shinigami and Creeps; with Tōya's own past shrouded in mystery to even himself, and Natsuki also interested romantically in Tōya, things quickly become complicated...</p><p><em>D→A:BLACK</em> is a so-called \"active novel\" -- a visual novel-style adventure game with realtime battle sequences, divided into six chapters. The story unfolds from Tōya's point of view, largely through voiced dialogue sequences with still images. The player must occasionally make choices that will affect how the story plays out and which of the 11 endings are reached; some decisions are timed, and in many cases not answering at all is also a valid option.</p><p>At certain points in the game, the player will be attacked by Creeps. Controlling Tōya, his partner Yuriel, and his familiar Rin, the player must defeat the attacker and defend their team in a real-time battle. Each of the characters has various actions they can perform; Tōya and Yuriel can attack, defend, and use special moves, while Rin can defend or recover the other two characters. Each character has an affinity; Tōya's attacks are Dark, and work best against Light enemies, while Yuriel's attacks are the opposite, and Rin can switch between alignments. If any character's HP reaches 0, the battle is lost and the game is over.</p>"},{"name":"D-A:BLACK (Shokai Genteiban)","year":2003,"developer":"Tonkinhouse"},{"name":"D-A:WHITE","year":2004,"developer":"Tonkinhouse","url":"sony_playstation2_d_part1/D-A%20-%20White%20%28Japan%29.zip","filesize":1667612305,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Real-time > Visual novel","desc":"<p><em>D→A:WHITE</em> is a so-called \"active novel\" -- a visual novel-style adventure game with realtime battle sequences, divided into eight chapters. Taking place two months after the events of D→A:BLACK, the player once again takes control of Tōya Shinjō, a \"Shinigami\" who works together with the angel Yuriel Arlencloyn to guide lost souls called \"Creeps\" that are lingering in the human realm.</p><p>The majority of the game again proceeds like a visual novel, featuring voiced dialogue sequences with still images, including occasional choices leading to one of 27 different endings; as before, some choices are timed, and allowing the timer to expire also counts as an option. The main difference in gameplay from the previous title is the battle sequences, which have been expanded significantly and now allow for other characters besides Tōya, Yuriel, and Rin to participate depending on the situation.</p>"},{"name":"D-A:WHITE (Shokai Genteiban)","year":2004,"developer":"Tonkinhouse","url":"sony_playstation2_d_part1/D-A%20-%20White%20%28Japan%29%20%28Shokai%20Genteiban%29.zip","filesize":1667612294,"score":"","genres":"Special edition > Physical extras","desc":"<p>First Print Limited Edition package of <em>D→A:WHITE</em> contains:</p><ul><li>D→A:WHITE game</li><li>Original DVD containing various bonus content including \"From Silent Sky\" PV and more</li></ul>"},{"name":"D-unit Drift Racing","year":2006,"developer":"Mere Mortals Ltd.","url":"sony_playstation2_d_part2/D-Unit%20Drift%20Racing%20%28Europe%2C%20Australia%29.zip","filesize":157411716,"score":"","genres":"Racing / Driving > 3rd-person (Other) > Persistent > Direct control > Automobile > Street racing","desc":"<p>D-unit Drift Racing is a racing game which focuses on drifting style car races set in range of gritty urban environments. The gameplay revolves around earning money by winning races, which can be used to upgrade your car and unlock new cars, courses and racing leagues.</p>"},{"name":"D.C. II: P.S. (DX Pack) (Disc 1)","year":2008,"developer":"Circus","url":"sony_playstation2_d_part1/D.C.II%20P.S.%20-%20Da%20Capo%20II%20-%20Plus%20Situation%20%28Japan%29%20%28Disc%201%29%20%28DX%20Pack%29.zip","filesize":3341111029,"score":"","genres":"Special edition > Extra content / game > Physical extras","desc":"<p>Deluxe Pack release of <em>Da Capo II: Plus Situation</em> which includes:</p><ul><li>D.C. II: P.S. - Da Capo II: Plus Situation DVD game (two discs)</li><li>Harukaze: Plus Situation CD game (arc in the story)</li><li><em>Da Capo II</em> TV anime remix DVD</li><li><em>Da Capo II: Plus Situation</em> soundtrack CD</li></ul>"},{"name":"D.C. II: P.S. (DX Pack) (Disc 2)","year":2008,"developer":"Circus","url":"sony_playstation2_d_part1/D.C.II%20P.S.%20-%20Da%20Capo%20II%20-%20Plus%20Situation%20%28Japan%29%20%28Disc%202%29%20%28DX%20Pack%29.zip","filesize":3193507687,"score":"","genres":"Special edition > Extra content / game > Physical extras","desc":"<p>Deluxe Pack release of <em>Da Capo II: Plus Situation</em> which includes:</p><ul><li>D.C. II: P.S. - Da Capo II: Plus Situation DVD game (two discs)</li><li>Harukaze: Plus Situation CD game (arc in the story)</li><li><em>Da Capo II</em> TV anime remix DVD</li><li><em>Da Capo II: Plus Situation</em> soundtrack CD</li></ul>"},{"name":"D.C.: Four Seasons","year":2005,"developer":"Circus","url":"sony_playstation2_d_part1/D.C.F.S.%20-%20Da%20Capo%20-%20Four%20Seasons%20%28Japan%29.zip","filesize":1858273932,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Da Capo: Four Seasons</em> for PlayStation 2 is a mixed, expanded and rewritten version of various PC releases which features some of the old scenarios, discards some, and has some of them rewritten, without the erotic content. <em>D.C.F.S.</em> is an after story to <em>D.C.P.S.</em> that takes place during four different seasons. Each season (spring, summer, autumn and winter) features three different heroines and can be played in any order.</p><p>Like majority of other visual novels, the basic gameplay consists of going through story text with occasional choices that branch the story and lead to different endings. During gameplay, the player can also check the message log or remove the on-screen text to see the unobscured background image. Additionally, graphics reached in the story arc are unlocked in the CG album, while the music player offers the complete soundtrack right from the start.</p>"},{"name":"D.C.: Four Seasons (DX Pack)","year":2005,"developer":"Circus","url":"sony_playstation2_d_part1/D.C.F.S.%20-%20Da%20Capo%20-%20Four%20Seasons%20%28Japan%29%20%28DX%20Pack%29.zip","filesize":1858271457,"score":"","genres":"Special edition > Physical extras","desc":"<p>Deluxe Pack of <em>D.C.F.S.</em> which includes:</p><ul><li>D.C.F.S.: Da Capo - Four Seasons game</li><li>Hatsunejima broadcasting station extra edition DVD (Vol.2)</li><li>Desktop calendar for year 2006 (full with 365 pages featuring Da Capo characters)</li></ul>"},{"name":"D.C.: I.F.","year":2009,"developer":"Circus","url":"sony_playstation2_d_part1/D.C.I.F.%20-%20Da%20Capo%20-%20Innocent%20Finale%20%28Japan%29.zip","filesize":780452568,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Romance > Licensed","desc":"<p><em>Da Capo: Innocent Finale</em> is a fan disk featuring an alternative setting in the series focusing on Kotori Shirakawa (白河 ことり) as the main heroine due to gaining a huge popularity among the fans. Kotori planned to confess her feelings to Junichi (純一) after being crowned a prom queen at the graduation party, but her dream collapses when Junichi's younger sister enters the scene. But that doesn't stop her from keeping on dreaming about her and Junichi, and how she will confess her feelings to him one day.</p><p>This visual novel is identical in gameplay and style with other Da Capo games, but features original video opening and theme songs. The game also features a bonus sub-scenario in addition to the main story, which provides more info about character connections and story background.</p>"},{"name":"D.C.: The Origin","year":2008,"developer":"Circus","url":"sony_playstation2_d_part1/D.C.%20-%20Da%20Capo%20-%20The%20Origin%20%28Japan%29.zip","filesize":1026354872,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Da Capo: The Origin</em> is a remake of the original PC game D.C. (abbreviation of Da Capo). This remake port for the PlayStation 2 removes all the adult scenes, thus making this a non-hentai game, as is the regular case with Sony's platforms. The voices in this remake were done by the original cast.</p>"},{"name":"D.Gray-man - Sousha no Shikaku","year":2008,"developer":"Konami Corporation","url":"sony_playstation2_d_part1/D.Gray-man%20-%20Sousha%20no%20Shikaku%20%28Japan%29.zip","filesize":2357599773,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Visual novel > Licensed","desc":"<p>It is the end of the 19th century, and the Millennium Earl has spent thousands of years building an army of loyal creatures known as Akuma. There is a select group of people that stop the Earl from carrying out his plans of mass destruction; these people are the Exorcists, chosen by God through crystals referred to as Innocence, and their job is to destroy the Akuma. The story of <em>D.Gray-man: Sōsha no Shikaku</em> focuses on five young exorcists who serve as members of the Black Order, operating under the Vatican and the Pope: Allen Walker from Great Britain, whose left arm can transform into an enormous claw called Crown Clown and whose cursed left eye allows him to see the souls of Akuma; Lenalee Lee from China, whose Dark Boots grant her extraordinary agility; Yu Kanda from Japan, wielding his sword, Mugen, in combat; Lavi, a cheerful young adult training to become one who records the history of the world around him, wielding a hammer called Tettsui that can modify its size; and Arystar Krory III of Romania, a \"vampire\" who sucks the blood of Akuma in order to obtain superhuman strength.</p><p><em>Sōsha no Shikaku</em> is an RPG based on the <em>D.Gray-man</em> anime series, adapted from the manga of the same name by Katsura Hoshino. It features cutscenes fully-voiced by the cast of the anime that lead into battle sequences with the enemies of the exorcists: Akuma and the mysterious group with superhuman abilities known only as the Noah, both under the Earl's control. At certain points in the game, the player can choose to view the story from the perspective of one of the five exorcists. The selected exorcist must then make decisions throughout the story that influence their bonds (\"KIZUNA\") with their fellow exorcists, for better or worse. Raising bonds between exorcists unlocks scenarios, some of which can only be accessed through specific routes. The battles are turn-based and take place on a grid. Attacks are limited by their range, and can only be performed successfully if an enemy is on a targeted space.</p>"},{"name":"D.N. Angel: TV Animation Series - Kurenai no Tsubasa","year":2003,"developer":"TAKARA Co., Ltd.","url":"sony_playstation2_d_part2/D.N.Angel%20-%20TV%20Animation%20Series%20-%20Kurenai%20no%20Tsubasa%20%28Japan%29.zip","filesize":991022423,"score":"","genres":"Adventure > 1st-person > Diagonal-down > Fixed / flip-screen > Isometric > Anime / Manga > Direct control > Asia > Fantasy > Crime > Romance > Licensed","desc":"<p><em>Kurenai no Tsubasa</em> (紅の翼) is based on <em>D.N. Angel</em> manga and anime and game's release coincides with the airing of the last episode of the anime TV series. In the game the player controls Daisuke Niwa, the protagonist of the series, who has inherited the ability, through family bloodline, to turn into a phantom thief. While the game features various CG events and typical visual novel character dialogue screens, core gameplay is done in 3rd-person isometric perspective where the player directly controls the protagonist. Voice-acting was done by the same actors from the anime TV series.</p>"},{"name":"D1 Professional Drift Grand Prix Series","year":2005,"developer":"Yuke's Co. Ltd."},{"name":"Da Vinci Code, The","year":2006,"developer":"The Collective, Inc.","url":"PS2_COLLECTION_PART5/Da%20Vinci%20Code%2C%20The%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1889329639,"score":5.4,"genres":"Action > 3rd-person (Other) > Puzzle elements > Stealth > Detective / mystery > Licensed","desc":"<p><em>The Da Vinci Code</em> game is based on the movie directed by Ron Howard which is in turn based on Dan Brown's best selling novel The Da Vinci Code. In this third-person action-adventure game, players have to solve riddles, fight enemies, escape in high-speed car chases and in the meantime unraveling a murder and an ancient secret.</p><p>Harvard professor Robert Langdon is in Paris for a meeting with a curator of the Louvre. When he arrives, it turns out the curator is dead. With his own blood, he has written a cryptic message. French cryptographer Sophie Neveu arrives and they team up to solve the murder and discover that Leonardo Da Vinci has left clues to a secret in his paintings. This leads them to uncover a millennia-old conspiracy. A secret society tries to stop them from doing so.</p>"},{"name":"Daemon Summoner","year":2006,"developer":"Atomic Planet Entertainment Limited","url":"PS2_COLLECTION_PART5/Daemon%20Summoner%20%28Europe%29.zip","filesize":446874132,"score":"","genres":"Action > 1st-person > Shooter > Horror","desc":"<p><em>Daemon Summoner</em> is a first person shooter that takes place in 1888, during the Victorian era of England. Players take on the role of James Farrington-Higgs. His infant son, David, has just been murdered and his wife Emily has been turned into a vampire. Now James wants to find his wife in order to kill her and put her out of her misery. </p><p>Along the way, James has to deal with many creatures such as imps, ghouls, werewolves, and vampires. James uses an assortment of weapons to defeat these creatures, with some examples including a crossbow, a revolver, and holy water. The game features seven expansive levels taking place all around London, interspersed with moody cut scenes. The game also features three difficulty settings to choose from.</p>"},{"name":"Dai Senryaku VII: Modern Military Tactics Exceed","year":2007,"developer":"SystemSoft Alpha Corporation","url":"sony_playstation2_d_part1/Dai%20Senryaku%20VII%20-%20Modern%20Military%20Tactics%20Exceed%20%28USA%29.zip","filesize":183220463,"score":"","genres":"Strategy > Top-down > Turn-based","desc":"<p>An updated release of the original Dai senryaku VII: Modern Military Tactics, <em>Exceed</em> includes more campaigns, units, and maps.</p>"},{"name":"Dai-2-Ji Super Robot Taisen Alpha","year":2003,"developer":"Banpresoft Co., Ltd.","url":"sony_playstation2_d_part1/Dai-2-Ji%20Super%20Robot%20Taisen%20Alpha%20%28Japan%29.zip","filesize":1501656244,"score":"","genres":"Strategy > Diagonal-down > Isometric > Anime / Manga > Turn-based > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p><em>Dai-2-ji Super Robot Taisen α</em> is the third game in the Alpha sub-series after Super Robot Taisen α Gaiden, picking up a few months after the previous story. Earth has successfully repelled the Neo Zeon and Zentradi attacks, but faces ever more new threats, from both inside and out.</p><p>Gameplay is the standard mission-based, turn-based strategy that the series is well-known for. Several new systems appear, including a new Platoon system that allows groups of units to work in unison, a damage scaling system where the size of units affects the damage they take from attacks, and the redesigned pilot training system introduced in Original Generation. New series featured in this entry include <em>Brain Powered</em>, <em>Crossbone Gundam</em>, <em>GaoGaiGar</em>, and <em>Steel Jeeg</em>.</p>"},{"name":"Dai-3-Ji Super Robot Taisen Alpha - Shuuen no Ginga e","year":2005,"developer":"Banpresoft Co., Ltd.","url":"sony_playstation2_d_part1/Dai-3-Ji%20Super%20Robot%20Taisen%20Alpha%20-%20Shuuen%20no%20Ginga%20e%20%28Japan%29.zip","filesize":2610189453,"score":"","genres":"Strategy > Diagonal-down > Isometric > Turn-based > Tactical RPG > Turn-based strategy > Mecha / giant robot > Sci-fi / futuristic > War > Licensed","desc":"<p>The third part of the <em>Alpha</em> timeline of <em>Super Robot Wars/Taisen</em> and the finale of the same timeline.</p><p>Only mere weeks have passed since the <em>Sealed War</em>, the conflict that usurped humanity at its very home, our planet Earth. However, a new crisis is still on the horizon. Ever since the first conflict (<em>Super Robot Wars/Taisen Alpha</em>), humanity became aware that they were not alone in space, and that a massive conflict is happening in the galaxy. The last remaining powers on Earth and its colonies came up with a number of plans to save humanity, whether by protecting our planet or by organizing an interstellar colonial fleet to seek a new world. Now, with nowhere to hide from an impending calamity, humanity scrambles for a solution.</p><p>One day, a colony ship mysteriously returns from its journey, after a long period of radio silence. In the asteroid belt, a towering structure has appeared out of nowhere. And military organizations and extraterrestrials both inside and outside our world are conspiring against humanity. The final war for mankind has begun. Only a few will ever know its outcome...</p><p>Like most games of this series, <em>Dai-3-ji Super Robot Taisen Alpha</em> (The 3rd Super Robot Wars Alpha), is a tactical RPG that combines various robots from popular Japanese anime with robots, popularly known as \"mecha\". Players control various units on an isometric map, battling numerous enemies and progressing through the story. After each mission, players can customize units' specs and weapons, as well as add peripherals that can help units in the time of need. Like its predecessor, the game allows players to make battalions of four units and each of the groups can battle other enemy battalions. Three new anime series were added to this part: Mobile Suit Gundam SEED, GaoGaiGar FINAL and Sega's Virtual-ON, marking the first time units from another video game series were introduced to the franchise. It also reintroduces important series to this timeline, such as Neon Genesis Evangelion, Macross and Gunbuster, to mark the finale.</p>"},{"name":"Daito Giken Koushiki Pachi-Slot Simulator: 24 - Twenty Four","year":2008,"developer":"Paon Corporation, Ltd.","url":"sony_playstation2_d_part1/Daito%20Giken%20Koushiki%20Pachi-Slot%20Simulator%20-%2024%20-%20Twenty%20Four%20%28Japan%29.zip","filesize":318639108,"score":"","genres":"Gambling > 1st-person > Licensed","desc":"<p><em>24</em> is a digital recreation of the pachi-slot machine (Japanese slot machine) of the same name made by Daito Giken, based on the popular American television series also of the same name. It includes a practice mode, where the player can set up a single machine and play to learn its ins and outs, and a \"real battle\" mode where the player is given a certain amount of money and must play on preset machines to win as much as possible. As usual, detailed play data tracking and an in-game gallery are also included.</p>"},{"name":"Daito Giken Koushiki Pachi-Slot Simulator: Hihouden","year":2006,"developer":"Paon Corporation, Ltd.","url":"sony_playstation2_d_part1/Daito%20Giken%20Koushiki%20Pachi-Slot%20Simulator%20-%20Hihouden%20%28Japan%29.zip","filesize":138556686,"score":"","genres":"Gambling > 1st-person > Anime / Manga > Licensed","desc":"<p><em>Hihōden</em> is a digital recreation of the pachi-slot machine (Japanese slot machine) of the same name made by Daito Giken. It includes a practice mode, where the player can set up a single machine and play to learn its ins and outs, and a \"real battle\" mode where the player is given a certain amount of money and must play on preset machines to win as much as possible. There is also a challenge mode where the player must complete certain tasks in the mini-games to unlock bonus content. Detailed play data tracking and an in-game gallery are also included.</p>"},{"name":"Daito Giken Koushiki Pachi-Slot Simulator: Ossu! Banchou","year":2005,"developer":"Paon Corporation, Ltd.","url":"sony_playstation2_d_part1/Daito%20Giken%20Koushiki%20Pachi-Slot%20Simulator%20-%20Ossu%21%20Banchou%20%28Japan%29.zip","filesize":211214305,"score":"","genres":"Gambling > 1st-person > Anime / Manga > Licensed","desc":"<p><em>Ossu! Banchō</em> is a digital recreation of the pachi-slot machine (Japanese slot machine) of the same name made by Daito Giken. It includes a practice mode, where the player can set up a single machine and play to learn its ins and outs, and a \"real battle\" mode where the player is given a certain amount of money and must play on preset machines to win as much as possible. Also included are detailed play data tracking and an in-game gallery.</p>"},{"name":"Daito Giken Koushiki Pachi-Slot Simulator: Shake II","year":2007,"developer":"Paon Corporation, Ltd.","url":"sony_playstation2_d_part1/Daito%20Giken%20Koushiki%20Pachi-Slot%20Simulator%20-%20Shake%20II%20%28Japan%29.zip","filesize":410418632,"score":"","genres":"Gambling > 1st-person > Anime / Manga > Licensed","desc":"<p><em>Shake II</em> is a digital recreation of the pachi-slot machine (Japanese slot machine) of the same name made by Daito Giken. It includes a practice mode, where the player can set up a single machine and play to learn its ins and outs, and a \"real battle\" mode where the player is given a certain amount of money and must play on preset machines to win as much as possible. The battle mode in this edition has been expanded to feature multiple pachi-slot halls and different events that can occur in each. Detailed play data tracking and an in-game gallery are also included.</p>"},{"name":"Daito Giken Koushiki Pachi-Slot Simulator: Shin Yoshimune","year":2008,"developer":"Paon Corporation, Ltd.","url":"sony_playstation2_d_part1/Daito%20Giken%20Koushiki%20Pachi-Slot%20Simulator%20-%20Shin%20Yoshimune%20%28Japan%29.zip","filesize":542423058,"score":"","genres":"Gambling > 1st-person > Anime / Manga > Licensed","desc":"<p><em>Shin Yoshimune</em> is a digital recreation of the pachi-slot machine (Japanese slot machine) of the same name made by Daito Giken, a sequel to their famous Yoshimune. It includes a practice mode, where the player can set up a single machine and play to learn its ins and outs, and a \"real battle\" mode where the player is given a certain amount of money and must play on preset machines to win as much as possible. As usual, detailed play data tracking and an in-game gallery are also included.</p>"},{"name":"Daito Giken Koushiki Pachi-Slot Simulator: Yoshimune","year":2004,"developer":"Paon Corporation, Ltd.","url":"sony_playstation2_d_part1/Daito%20Giken%20Koushiki%20Pachi-Slot%20Simulator%20-%20Yoshimune%20%28Japan%29.zip","filesize":170920108,"score":"","genres":"Gambling > 1st-person > Anime / Manga > Licensed","desc":"<p><em>Yoshimune</em> is a digital recreation of the pachi-slot machine (Japanese slot machine) of the same name made by Daito Giken. It includes a practice mode, where the player can set up a single machine and play to learn its ins and outs, and a \"real battle\" mode where the player is given a certain amount of money and must play on preset machines to win as much as possible. Also included are detailed play data tracking and an in-game gallery.</p>"},{"name":"Daito Giken Premium Pachi-Slot Collection: Yoshimune","year":2006,"developer":"Paon Corporation, Ltd.","url":"sony_playstation2_d_part1/Daito%20Giken%20Premium%20Pachi-Slot%20Collection%20-%20Yoshimune%20%28Japan%29.zip","filesize":1029079635,"score":"","genres":"Gambling > 1st-person > Anime / Manga > Licensed","desc":"<p><em>Yoshimune</em> is a digital recreation of the pachi-slot machine (Japanese slot machine) of the same name made by Daito Giken, updated from the previous conversion. This version includes the latest revisions from the real machine, along with a significant graphical overhaul. Notably, the \"real battle\" mode now replicates a complete pachi-slot hall that the player can walk around in, where all of the machines operate in real-time as they do in real life.</p>"},{"name":"Dakar 2: The World's Ultimate Rally","year":2003,"developer":"Acclaim Studios Cheltenham","url":"PS2_COLLECTION_PART5/Dakar%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1863410607,"score":6.5,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Motorcycle > Off-roading > Licensed","desc":"<p>Dakar 2 is a racing game, of course simulating the famous Paris-Dakar Rally. Although not the real 6000 kilometers can be crossed in the game, the rally mode takes the player through 12 tracks all the way from France to Dakar. The tracks lead racers through cities, forests, and the desert. Most of them are simple tracks, but there are desert tracks where the player can drive around freely, finding the checkpoints faster than the opponents. The player can choose from the officially licensed cars, trucks, and bikes from Dakar 2002, but only vehicles of the same type can compete in a race. There is also an arcade racing mode, where all the tracks and vehicles that have been unlocked in rally mode can be selected, as well as a split-screen mode for two players.</p>"},{"name":"Dalmatians 3","year":2003,"developer":"The Code Monkeys Ltd.","url":"PS2_COLLECTION_PART5/Dalmatians%203%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":407631149,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select","desc":"<p><em>Dalmatians 2</em> features a Dingo Pictures animated film titled <em>...noch mehr Dalmatiner</em>. Despite the striking similarity between the cover art and the Disney franchise 101 Dalmatians it does not have any official link or licensing agreement.</p><p>The game also features six different sliding picture puzzles with 4 difficulty options (9, 12, 25, or 36 squares). There is also a coloring book mode where players can color in six different pictures.</p><p>The game was later released on the PlayStation 2 as <em>Dalmatians 3</em>. It's the same game as the PlayStation version but adds a jigsaw puzzle mode and a pair matching mini game.</p>"},{"name":"Dance Dance Revolution X","year":2008,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"sony_playstation2_d_part1/Dance%20Dance%20Revolution%20X%20%28USA%29.zip","filesize":1223417981,"score":6.1,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Dance Dance Revolution X</em> was released to celebrate the 10th anniversary of the Dance Dance Revolution series and features a new interface, new game modes and new music.</p>"},{"name":"Dance Dance Revolution X2","year":2009,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"sony_playstation2_d_part1/Dance%20Dance%20Revolution%20X2%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":1067995066,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Dance Dance Revolution X2</em> is the sequel to Dance Dance Revolution X and the final Dance Dance Revolution game released on the PlayStation 2. It introduces a unique soundtrack, new game modes and other minor refinements and changes.</p>"},{"name":"Dance Dance Revolution: Disney Channel Edition","year":2008,"developer":"keen games GmbH & Co. KG","url":"sony_playstation2_d_part1/Dance%20Dance%20Revolution%20-%20Disney%20Channel%20Edition%20%28USA%29.zip","filesize":2319193160,"score":6.7,"genres":"Action > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p><em>Disney Channel Edition</em>, only released in the United States, is another dancing game of the Dance Dance Revolution series from Konami. This time the game aims especially for all those, who are into the Disney Channel series and can’t get enough of idols like Hannah Montana, Cheetah Girls and so on.</p><p>The game features music and characters from series like <em>High School Musical</em>, <em>Hannah Montana</em>, <em>The Suite Life of Zack and Cody</em>, <em>Cheetah Girl</em>s and more. Included are 40 songs and a new game mode called “Magic Mode”, where the player can compete against characters from the Disney Channel to unlock additional character outfits. In this mode you can fill up a combo meter to apply a handicap to the other player, which makes it then harder to hit the steps right.</p>"},{"name":"Dance Dance Revolution: Extreme","year":2003,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"sony_playstation2_d_part1/Dance%20Dance%20Revolution%20Extreme%20%28USA%29.zip","filesize":981928213,"score":7.4,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p>In DDR, you play on a mat, and as arrows rise to the top of the screen, you stomp in time with the music. Grey arrows at the top of the screen indicate when to stomp. Stomp in time and you get a \"Perfect!\" Or a \"Great!\" But step incorrectly, and you get a \"Boo!\" or a \"Almost!\", And you lose life. Life is indicated as a bar at the top of the screen. Lose all your life, and you lose.</p><p>Songs in this mix include (In the Japanese version at least):Bag  </p><p>Sakura  </p><p>Max  </p><p>A Stupid Barber</p><p>You can play using a regular PS2 controller, but you won't get the full arcade-like feel.</p>"},{"name":"Dance Dance Revolution: Extreme 2","year":2005,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"sony_playstation2_d_part1/Dance%20Dance%20Revolution%20Extreme%202%20%28USA%29.zip","filesize":3657565474,"score":7.4,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p>As with other Dance Dance Revolution games, this is meant to be played on a dance mat or platform controller. As the song plays, arrows scroll up the screen in time with the music and you score points by stepping on the corresponding arrow on the mat as they reach the top. \"Freeze arrows\" have long trails; on these you must step and hold your foot down for the duration of the arrow, using your other foot to make other steps in the meantime. Your score depends on your timing. When you step with good timing, your dance meter rises; when you miss, it falls. If your dance meter drops to empty, you fail.</p><p>Dance Master mode presents you with a series of challenges to earn points to unlock songs, courses (where you play a sequence of songs nonstop), special modes, and optional graphic textures.</p><p>You can use an EyeToy USB camera to display the player(s) dancing on the screen instead of the normal backgrounds. Hands and Feet mode uses the camera to add hand waving to the gameplay.</p><p>Workout mode that tracks your calories burned for players who use DDR in their exercise regimen.</p><p>You can play with one or two players, or with other players in online play.</p><p>A demo of Karaoke Revolution is included.</p>"},{"name":"Dance Dance Revolution: SuperNOVA","year":2006,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"sony_playstation2_d_part1/Dance%20Dance%20Revolution%20SuperNova%20%28USA%29.zip","filesize":1370597614,"score":7.3,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p>Another sweat dripper from Konami, <em>Dance Dance Revolution SuperNOVA</em> features 74 different songs to dance to, an adventure mode, online play, and EyeToy support.</p><p>The game includes animated dancers as well as classic music videos to accompany your dancing. A versus mode allows two people to play on two dance pads at once. The game also can interact with data from its arcade sibling.</p><p>New songs can be unlocked by playing \"Stellar Master\" mode. This \"adventure\" will take you to dance through a series of alien planets. You'll be starting with 42 games and from there you'll unlock the rest.</p><p>The EyeToy allows you to use your hands to interact with the screen to give you more of a full body dancing.</p>"},{"name":"Dance Dance Revolution: SuperNOVA2","year":2007,"developer":"Konami Digital Entertainment, Inc.","url":"sony_playstation2_d_part1/Dance%20Dance%20Revolution%20SuperNova%202%20%28USA%29.zip","filesize":1153859413,"score":6.5,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p>Slightly varied in technology and musical content from the Japanese arcade game and home port of the same name as well as the parallel European release <em>Dancing Stage SuperNova 2</em>, this game delivers rhythmic play that has become well-established over the course of the series' dynasty -- to gloss generally, players are rated on how effectively they deliver input in response to a continuously-scrolling list of controller direction instructions. When the screen tells players that they're about to be called upon to hit the \"left\" button as its corresponding glyph ascends up the screen, they must try to match it precisely at the moment of the glyph's overlap with a target area at the top of the screen. DDR games being what they are, this is all synchronized to player-selected electro-pop music with music video or animated dancing avatar sideshows, and of course is intended for play with the series' trademark control device, a giant four-way directional pad laid on the floor to be rhythmically walked upon. (Two can be used simultaneously for two players or one who boasts some simply spectacular dance moves.)</p><p>After the attainment of various in-game achievements have granted the players sufficient points to \"buy\" an initially-locked handful in the in-game \"store\", this game offers up 72 different songs (some in a fragmentary form) in a variety of styles from Konami's J-pop stable as well as regionalised tunes from recognized Western artists.</p><p>In addition to the standard \"pick three songs and see how high a cumulative score you can rack up, supposing you don't get prematurely booted due to low performance\" game mode, the game offers variant play types: \"hyper master\" mode (taking on extra tasks in order to earn achievements such as Supportive Modules to make things easier and Challenge Modules to make them tougher), workout mode (to help calculate calories burned and long-term exercise routines), advanced modes (initial options include battle -- competitive vs. the computer or a human player -- or course, running through a selected playlist... and eventually unlocking survival mode, endless mode, and the combo challenge mode), training mode (to help learn the steps to a particular song), and edit mode (for custom programming of your own choreographed dance steps!)</p>"},{"name":"Dance Factory","year":2006,"developer":"Broadsword Interactive Limited","url":"PS2_COLLECTION_PART5/Dance%20Factory%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":337181205,"score":6.6,"genres":"Action > Music / rhythm","desc":"<p>A rhythm action game focusing on the use of a dance mat to successfully complete a dance pattern of arrows scrolling up the screen in time to music. The object of the game is to get as many arrows in the right order and at the right time to get a high score. The unique selling point of Dance Factory is that it will automatically create a dance pattern based on any music CD inserted into the PS2 console.</p><p>Dance Factory contains six different single-player game modes which are all variations around the main game mechanic which is to match patterns moving up the screen with the button presses or foot taps of the user all in time with a music track. Along with the basic game mode, there is an endurance mode which plays through an entire CDs worth of songs, a fitness mode which counts calories and a record mode that lets you create your own dance. There is also a 'creature' mode that makes a computer animated character dance along with the music on screen and an EyeToy mode that adds hand icons to the dance patterns that the player's onscreen camera image must hit in time to the music.</p><p>Dance Factory also includes a multiplayer mode that allows two players to dance simultaneously in a head to head battle or cooperatively to compete for higher scores. Multiplayer also features a tournament mode where up to 16 players can compete in a series of head to head battles to pick an eventual winner.</p>"},{"name":"Dance Fest","year":2006,"developer":"Broadsword Interactive Limited","url":"PS2_COLLECTION_PART5/Dance%20Fest%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":209554631,"score":"","genres":"Action > Music / rhythm","desc":"<p><em>Dance Fest</em> takes the standard 'bemani' formula - arrows appear rhythmically on screen and the player must hit the corresponding button (on either a dance mat peripheral or the standard controller) in time with these arrows and the music. Points are awarded for accuracy with bonus multipliers awarded for making certain 'combos' (mini-routines within a song which are deemed especially difficult or long).</p><p>This is a game for one or two players with three difficulty settings, easy, hard and medium. The player selects their difficulty level and their track and then attempts to score points by hitting the correct buttons in sequence. During the song the player is treated to an distant view of an animated disco dancer on a stage and illuminated with coloured lights. Once the track is over the player can enter their name, assuming they have achieved a high score. The game holds eight scores for each of the three difficulty levels but no scores are recorded for Workout and Recorder modes. </p><p>The game has a workout mode in which the player first enters their weight, in kilograms, and then selects a track. Gameplay here is basically the same as the main game but instead of points the game calculates the number of calories burned. There is no difficulty setting for this game mode and the arrows come thick and fast.</p><p>The Recorder option allows the player to create and save their own dance, there is no high score for this and while the dance moves are preserved from one game to the next only one routine can be saved.</p><p>Songs included in this game are:* Merry Christmas Everyone: Shakin' Stevens</p><ul><li>Don't Cha: Pussycat Dolls</li><li>The Grid: Diablo</li><li>Movin' On Up: M People</li><li>Atlantic Ocean: Waterfall</li><li>Killin' Time: Tina Cousins</li><li>Push the Button: Sugarbabes</li><li>Dancin: Aaron Smith feat. Luvli</li><li>Flowers: Sweet Female Attitude</li><li>Pink is the Colour: K&amp;M feat. Joy</li><li>Last Goodbye: Attic feat. Julie Thompson</li><li>Stomp: Steps</li><li>U R The Future: Busface</li><li>Merry Christmas Everybody: Steps</li></ul>"},{"name":"Dance Party: Club Hits","year":2009,"developer":"Broadsword Interactive Limited","url":"PS2_COLLECTION_PART5/Dance%20Party%20Club%20Hits%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":242637883,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p>Come and Join the Dance Party!</p><p>It’s time to shake your booty with Dance Party Club Hits. Full of hot music to help you show off your latest dance floor moves. So grab your friends, it’s time to have a Dance Party!</p><p>Features* 15 uplifting club hits, including classics like “Black and Gold” by Sam Sparro, “The Creeps” from Camille Jones & “Cry For You” by September * 8-way dance steps with fully customised routines * 45 individual dance routines and 3 progressive difficulty levels, culminating in a super hardcore mode * Go Head-to-Head in a 2 player dance off * Challenge up to 8 of your friends with the Party mode * Think you got the moves? Record your own dance steps to your favourite tracks * Help get into shape with the Workout mode * 4 exclusive environments and multiple characters to dance along with * Fully compatible with all major dance mats</p>"},{"name":"Dance Party: Pop Hits","year":2009,"developer":"Broadsword Interactive Limited","url":"PS2_COLLECTION_PART5/Dance%20Party%20Pop%20Hits%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":259874756,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Dance Party: Pop Hits</em> is a one or two player dancing game which has the following features;* 15 uplifting pop hits</p><ul><li>8-way dance steps</li><li>A 2 player head-To-Head dance off</li><li>An 8 player Party Mode</li><li>A function that allows a player to record their own dance steps</li><li>A Workout mode</li></ul><p>The game is fully compatible with all major dance mats</p><p>The full track listing is;* Sophie Ellis-Bextor: Murder On The Dance Floor</p><ul><li>Sugarbabes: Push The Button</li><li>Booty Luv: Some Kinda Rush</li><li>Benjay: Dance Party(Keep On Movin')</li><li>Hardage: High On Life</li><li>Britalics: I Can C Through U</li><li>Sean Ensign: It's My Life</li><li>Romina Johnson: Love &amp; Happiness</li><li>Ivana Party: My Everything</li><li>Nicci Hall: My Family Say</li><li>Soozy Q: New Day</li><li>Vicki Young: Now That We're Together</li><li>Alan Connor: Now The Rain Has Gone</li><li>Tinman: Shooting Star</li><li>Soozy Q: Talk To The Hand</li></ul>"},{"name":"Dance Summit 2001: Bust A Move","year":2000,"developer":"Metro Corporation"},{"name":"Dance:UK","year":2003,"developer":"Broadsword Interactive Limited","url":"sony_playstation2_d_part1/Dance-UK%20%28UK%29.zip","filesize":619579483,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Dance:UK</em> takes the standard 'bemani' formula - arrows appear rhythmically on screen and the player must hit the corresponding button (on either a dance mat peripheral or the standard controller) in time with these arrows and the music. Points are awarded for accuracy with extras for making certain 'combos' (mini-routines within a song which are deemed especially difficult or long).</p><p>The PS2 and XBOX version of the game have over thirty tracks (around 20 of which are famous/original) by artists including Misteeq, Run D.M.C, Liberty X, Sugababes, Room 5, Sophie Ellis Bextor, Chic, The Trammps, 5ive, Junior Senior, Las Ketchup and DJ Sammy, while the Playstation version has a reduced twenty song tracklist.</p><p>There are initially three difficulty levels, and the player can either practice one song at a time (in Jukebox mode) or enter the Dance:UK Championship, winning which will unlock a 'Dance Recorder' mode in which players can record their own dance routines. In multiplayer up to 8 players can compete in succession or 2 players can compete head-to-head.</p><p>A karaoke mode is also provided for use with a wireless microphone (sold separately) whilst 'Aerobic' Mode calculates the number of calories you've burnt during play.</p>"},{"name":"Dance:UK XL Lite","year":2005,"developer":"Broadsword Interactive Limited","url":"sony_playstation2_d_part1/Dance-UK%20XL%20Lite%20%28UK%29.zip","filesize":237539389,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Dance: UK XL Lite</em> is very similar in content to it's forerunner Dance:UK in that it takes the standard 'bemani' formula - arrows appear rhythmically on screen and the player must hit the corresponding button (on either a dance mat peripheral or the standard PS/PS2 controller) in time with these arrows and the music. Points are awarded for accuracy with extras for making certain 'combos' (mini-routines within a song which are deemed especially difficult or long).</p><p>This game has twelve songs all by original artists DJ Casper, Blue, Sugarbabes, Westlife, Lemar, Big Brovas, Javine, Boogie Pimps, Blazin' Squad, Holly Vallance, Atomic Kitten, and the Spice Girls</p><p>There are four difficulty levels, beginner, easy, medium and expert, and the player can either practise one song at a time (in Jukebox mode) dance in Tournament or party modes. <br>Tournament mode requires two dance mats/controllers to be connected so that up to 8 players can compete in succession or 2 players can compete head-to-head. <br>Party mode requires a single dance mat/controller because the player(s) compete one at a time. During the party mode the player(s) will encounter 'Forfeit Balls', if these are not caught by the player then 'forfeit mode' begins and for a while the dance arrows will either twist at the last minute or come from another direction.</p><p>This game also has a 'Dance Recorder' mode in which players can record their own dance routines, and a karaoke mode so that player(s) can sing along to the on-screen lyrics.</p>"},{"name":"Dance:UK: eXtra Trax","year":2004,"developer":"Broadsword Interactive Limited","url":"sony_playstation2_d_part1/Dance-UK%20eXtra%20Trax%20%28UK%29.zip","filesize":199744463,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Dance:UK: eXtra Trax</em> follows in the wake of Dance:UK and it's gameplay is virtually identical in every respect. It too takes the standard 'bemani' formula - arrows appear rhythmically on screen and the player must hit the corresponding button (on either a dance mat peripheral or the standard controller) in time with these arrows and the music. Points are awarded for accuracy with extras for making certain 'combos' (mini-routines within a song which are deemed especially difficult or long).</p><p>The original game PS1 version of the game had twenty tracks, this game has just twelve. It can be played in either Aerobic mode, which calculates but does not record the number of calories you've burnt during play, or Dance mode.</p><p>Dance mode can be played in head-to-head, multiplayer or jukebox modes and has four three difficulty levels, beginner, easy, medium and expert. Head to head requires two controllers while the other two require just the one.   </p><p>In all modes the player can either select the track they wish to dance to or let the game select a random track, jukebox mode also has a dance recorder function, which does not have to be unlocked as it did in Dance:UK, but when the player dances to the playback the score is not recorded in the high score table.</p><p>Though the game is intended to be used with a dance mat it can be played using a standard controller. There is an optional karaoke feature which shows the words of the song while the player is dancing, the words do not show during the dance recording or playback features.</p>"},{"name":"Dancing Stage Fever","year":2003,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"PS2_COLLECTION_PART5/Dancing%20Stage%20Fever%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":558443455,"score":"","genres":"Action > Music / rhythm","desc":"<p>A unique dancing simulation game that uses your feet, get up and dance to such classics as \"All That She Wants\" - Ace Of Base, \"Wannabe\" - Spice Girls &amp; \"One Step Beyond\" - Madness.</p><p>You'll need quick reflexes and great timing to step on the correct arrows at the right time.  So take to the dance floor, get into the groove and show off your moves!</p><p>There are many different songs to dance to, multiple difficulty levels, lessons for beginners and a workout mode that tracks the number of calories you lose while playing.</p><p>Also features tracks from Squeeze and the Vbirds.</p>"},{"name":"Dancing Stage Fusion","year":2004,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"PS2_COLLECTION_PART5/Dancing%20Stage%20Fusion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1086618958,"score":"","genres":"Action > 1st-person > Music / rhythm","desc":"<p><em>Dancing Stage Fusion</em> is the third DS game on PS2.The object of the game is to \"dance\", which means that the player must hit the arrows that travel up the screen at the right time, thus scoring and unlocking more songs and burning some fat in the process.</p><p>The game features 54 songs from which 21 are licensed and the other 33 are made for the game. The licensed hits are:</p><ul><li>Chihuahua 2002 - DJ Bobo</li><li>Come Into My World - Kylie Minogue</li><li>Danger! High Voltage - Electric Six</li><li>Familiar Feeling - Moloko</li><li>Freak Like Me - Sugababes</li><li>Good Luck - Basement Jack feat. Lisa Kekaula</li><li>Gotta Get Thru This - Daniel Bedingsfield</li><li>Go West - Pet Shop Boys</li><li>Heaven &amp; Earth - POP!</li><li>I Believe In A Thing Called Love - The Darkness</li><li>It's Raining Men (Almighty Mix) - Geri Halliwell</li><li>Kids In America - Kim Wilde</li><li>Mickey - Toni Basil</li><li>Move Your Feet - Junior Senior</li><li>OK - Big Brovaz</li><li>Promises - Kylie Minogue</li><li>Rappers Delight - The Sugarhill Gang</li><li>Sexiest Man in Jamaica - Baker/Claxton/Prince Buster</li><li>Somebody Like You - Atomic Kitten</li><li>Sunlight</li><li>Superstar - Jamelia</li></ul>"},{"name":"Dancing With the Stars","year":2007,"developer":"Zoë Mode","url":"sony_playstation2_d_part1/Dancing%20with%20the%20Stars%20%28USA%29.zip","filesize":2804066034,"score":"","genres":"Action > Music / rhythm","desc":"<p>Dance and perform against the competition to claim the coveted title of America's favorite celebrity dancer. You'll dance to hit songs and compete in dances from the Cha-Cha to the Waltz. Play as one of nine celebrities such as Emmit Smith, Mario Lopez, or Stacey Keibler. Pair with one of the show's professional dancers, and show the judges you've got the star power!</p>"},{"name":"Dark Angel: Vampire Apocalypse","year":2001,"developer":"Metropolis Digital, Inc.","url":"sony_playstation2_d_part1/Dark%20Angel%20-%20Vampire%20Apocalypse%20%28USA%29%20%28v2.01%29.zip","filesize":554538322,"score":5.7,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Action RPG > Fantasy","desc":"<p><em>Dark Angel: Vampire Apocalypse</em> is a 3D action-role-playing game set in the seventeenth century, where you play as Anna, a mysterious woman who must protect a village against the armies of the Shadow Lord, which are made up of vampires and other assorted creatures.</p><p>Gameplay is much like the Diablo series where you are assigned a quest in one of three villages, then accomplish it in one of three dungeons or one of three battlefields battling randomly-generated groups of monsters that drop random equipment based on a drop-rate formula. You improve your character through a slow progression of leveling up from experience points and finding better equipment or purchasing it from villagers. Each mission you accomplish improves the economy, research or military stats of the village you are doing it for, which is what determines which items they have available for purchase.</p><p>There are three basic monster-types: Undead, Forgotten and Mutants. There are seven basic types of melee weapons. Two each do extra damage to each type of monster and the final does extra damage to groups. There are also four kinds of guns and a variety of bombs.</p><p>The object of the game is make Anna into an all-powerful warrior through battling and questing before a year is up and the Shadow Lord attacks. This takes upward of 100 hours of game time. At this point, she must defeat the Shadow Lord for good.</p>"},{"name":"Dark Cloud","year":2000,"developer":"Level-5 Inc.","url":"PS2_COLLECTION_PART5/Dark%20Cloud%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":926761373,"score":7.4,"genres":"Action > Role-playing (RPG) > Behind view > Quick Time Events (QTEs) > Fantasy > Steampunk","desc":"<p>400 Years ago, a war between the Eastern Continent and the Western Wizard Army destroyed the world as a great power was unleashed. Time has passed and in present day, the power-hungry General Flag has organized a ritual to awaken this power once more: the Dark Genie. Barely controlled by a spell, the Dark Genie once again breaks the world, beginning with the village of Norune. The only survivor of Norune is a boy named Toan, son of the great hero Ada. As Toan surveys the destruction, the Spirit King appears and tells him that all is not lost; pieces of the world, including buildings and people, have been sealed away in protective Atla spheres. Using a magic glove called the Atlamillia, Toan must resurrect the world and find the powers necessary to defeat the Dark Genie.</p><p><em>Dark Cloud</em> is an action-RPG title, often compared to Soul Blazer, played from the 3rd person perspective. Toan must enter randomly generated dungeons where he will battle monsters and recover Atla spheres. Toan battles with a sword, which can be slashed directly in front of him or powered up for a stronger blow. During his travels, Toan encounters other characters who will offer to aid him and can be switched to during dungeons, with individual statistics and weapons. Items are also found and shared among the party, including restorative items, attack items and general power-ups. Each character has a thirst meter, which much be replenished or health will start to drain. Should a character lose all their health, they will fall in battle and be returned to town unless Stand-In powder is used, in which case that character is unavailable and control passes to another.</p><p>Toan is the only character able to collect Atla spheres which contain different items needed to restore the villages destroyed by the Dark Genie. Rebuilding is done outside the dungeon in a designated village area. Buildings can be placed down, rotated and moved as need be. They can also be upgraded with additional furniture and people (usually the owners of the building). As the dungeons are conquered and the area becomes more lifelike, treasure chests start appearing around the town and villagers often become friendlier. Some villagers have additional requests, such as being placed facing the east, for the placement of their homes.</p><p>Each character in Toan's party uses a unique weapon, but several different types of weapon under each category can be collected. As weapons are used, they gain Absorption (Abs). These Abs points are used as \"experience\" for the weapon and can upgrade the weapon's abilities. Each weapon features a number of \"slots\" to which power-up items can be attached, any items attached to slots will be absorbed when the weapon is upgraded. Each weapon has certain attributes which must be improved in order to \"build up\" to a different type of weapon. Additionally, any weapon reaching level 5 can be broken into a Synthsphere, an item containing 60% of its abilities, which can then be attached to slots on different weapons. In this manner, weapons can always be upgraded or used in the improvement of another weapon throughout the game. The game also features certain sequences where buttons must be pressed in the correct order and correct timing in order to progress.</p>"},{"name":"Dark Cloud 2","year":2002,"developer":"Level-5 Inc.","url":"sony_playstation2_d_part1/Dark%20Cloud%202%20%28USA%29%20%28v2.00%29.zip","filesize":2936374217,"score":8.1,"genres":"Role-playing (RPG) > Behind view > Action RPG > Puzzle elements > Fantasy > Steampunk","desc":"<p>As a young inventor, you are called upon to search the dangerous dungeons, battle evil monsters and re-claim towns and cities.</p><p>By fighting your way through the various dungeons, you must find various ores hidden away. With these ores, you can determine which parts you need to re-build a town. It is up to you to find or create the parts needed to build the various buildings of each town, as well various other parts to each town.</p><p>During your adventure, you can also take pictures of various items. Once you have a certain amount, you can then come up with ideas for an invention that will aid you in your quest. From there, you must again find the parts needed to create the invention, and then use the invention either to help you defeat enemies or build the towns.</p>"},{"name":"Dark Summit","year":2001,"developer":"Radical Entertainment Inc.","url":"PS2_COLLECTION_PART5/Dark%20Summit%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":578947988,"score":6.8,"genres":"Sports > Behind view > Tricks / stunts > Snowboarding / skiing","desc":"<p>The military has mysteriously closed the summit of Mt. Garrick, and Chief O'Leary is trying desperately to drive snowboarders off the mountain.</p><p>Dark Summit is a twist on the snowboarding genre.  Instead of trying to pull off insane tricks, you'll be completing various missions, such as \"Find the Bomb\" and \"Destroy the Cannon\".  Pulling off tricks earns you points to buy new equipment.</p>"},{"name":"Darkwatch","year":2005,"developer":"High Moon Studios, Inc.","url":"PS2_COLLECTION_PART5/Darkwatch%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3239022034,"score":7.7,"genres":"Action > 1st-person > Shooter > Steampunk > Horror","desc":"<p>The Darkwatch is an ancient organization hell-bent on destroying evil in the world. They have just captured the vampire lord Lazarus and are transporting him back to headquarters for questioning, when an outlaw tries to rob the train and instead of finding riches releases Lazarus from his hold, but not before the outlaw is bitten by the vampire lord. As Jericho Cross, the former outlaw and now the newest member of the Darkwatch, you must find and kill Lazarus, lest you turn into a full-blown vampire yourself.</p><p>Darkwatch is a first-person shooter set in the Wild West with supernatural beings. Fight your way through reapers, undead riflemen, banshees and other creatures using Darkwatch weaponry that doubles as melee weapons, such as a revolver, two-fisted pistols, a crossbow (with dynamite attached to the bolts) and a Rail Rocket. You will also find dynamite along the way to throw at the enemy and to destroy barricades. Along with conventional weapons, Cross will acquire vampire powers of good or evil nature that you must choose in the story. If you decide to be good, then you receive powers such as Silver Bullet that increases your shots with holy fire or Vindicator that calls down chain lightning on your enemies. If you choose to be evil, you will receive Blood Frenzy that makes melee attacks supernaturally powerful and Soul Stealer, which sucks the very souls from distant enemies. Regardless of good or evil, you will always have Blood Shield (protection from losing health), Vampire Jump (for those hard to reach areas) and Blood Vision (causes enemies, weapons and other important objects to glow). With every creature killed, there will be at least one Blood Cloud and sometimes more to replenish your health and restore your Vampire Powers.</p><p>In single player you can choose from story mode (follow the story of Jericho Cross one chapter at a time) or Gunslinger mode (replay any level unlocked in story mode as either evil or good). At the end of the level, you see your number of kills and accuracy percentage, which, if it is good enough, will unlock some movies and concept art.</p><p>Play on-line over Xbox Live with up to 16 players or up to 4 people in split-screen mode. Multiplayer matches include Death Match, Team Death Match, Capture the Flag, Soul Hunter (fight to collect Blood Clouds and be the first to fill your Blood Bar) and Team Soul Hunter. You can adjust the settings for each match regarding the game type, map in which you wish to play, total time play, score limit and kill limit.</p><p>In the main menu, you can choose Extras to view concept art unlocked from playing Gunslinger Mode, movies from Story Mode and your statistics from Story Mode and Gunslinger Mode.</p>"},{"name":"Dave Mirra Freestyle BMX 2","year":2001,"developer":"Z-Axis, Ltd.","url":"PS2_COLLECTION_PART5/Dave%20Mirra%20Freestyle%20BMX%202%20%28Europe%29.zip","filesize":458559183,"score":7.5,"genres":"Sports > Behind view > Tricks / stunts > Bike / bicycling > Licensed","desc":"<p>Dave Mirra returns along with 14 pro riders including Ryan Nyquist, Mike Laird, and Collin Mackay. 8 levels are on offer, with a total of 1,500 tricks to master. You can create your own BMX park thanks to the Park Editor mode. And while you attempt to master the tricks, you can listen to the soundtrack featuring Ozzy Osbourne, The Cult, Methods of Mayhem, Godsmack, and Rage Against the Machine (all except Game Boy Advance version).</p>"},{"name":"David Beckham Soccer","year":2002,"developer":"Rage Games Ltd.","url":"PS2_COLLECTION_PART5/David%20Beckham%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2233636066,"score":6.3,"genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p>Endorsed by the then England and Manchester United captain and international superstar, David Beckham Soccer is the last of Rage long tradition in developing soccer games.It includes both national and club teams (from England, France, Germany, Italy and Spain), plus the ability to create custom teams,  with details ranging from the usual name, strips and colours to the stadium. Other than Beckham himself, no player is licensed (likeness is preserved, but names are replaced with phonetic equivalents, such as “Owin” or “Zanetee”), but the editor also allows the player to customize each player and team.Game modes include friendly, club season, several international cups (including the defunct Home Championship), Classic Matches (some featuring the highlights of Beckham's career, others just classic matches), Beat Brazil, where the player starts with France, and tries to beat Brazil with a progressively weaker team, Survival, where the player face top international teams, with goals against carrying over, until the player loses a match, and Train With Beckham, a series of  drill minigames destined to teach the basics of the game and unlock “secrets”. </p><p>Gameplay is similar to previous titles developed by the company (most notably Microsoft Football 2000 and UEFA Striker), and not unlike Beckham, has its strong point during dead ball situations, where the player can choose either to use a set play to get the defense offguard, or take a direct shot or swerving pass using the traditional arrow indicator.In terms of options, the game doesn’t offer much to tweak, only bookings, offsides, injuries, match length and the decider (simple or golden goal overtime and penalty shootout)</p>"},{"name":"David Douillet Judo","year":2007,"developer":"10Tacle Studios Belgium","url":"PS2_COLLECTION_PART5/David%20Douillet%20Judo%20%28Europe%29%20%28Fr%2CNl%29.zip","filesize":60041189,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Licensed","desc":"<p><em>David Douillet Judo</em> is the first 3D judo sports simulation, developed in cooperation with Olympic gold medalist David Douillet with the license of la Fédération Française de Judo. With a focus on realism the game first requires the player to go through a tutorial guided by David, where the different moves (52 in total) are explained. While fighting, it is not possible to perform each of these moves at will. The gameplay consists of fast-paced consecutive sequences where three different moves are suggested. The player has to select a move and perform it with a combination of keys or buttons. Based on the situation and the timing, it is then executed.</p><p>Next to the tutorial, three games modes are available: Quick Play, Championship and Career. There are five different dojos to compete with a traditional, regional, national and international setting, and a temple. Nine judokas are available, of which David Douillet is the only real sportsman, with the character bearing his likeness.</p>"},{"name":"Dawn of Mana","year":2006,"developer":"Square Enix Co., Ltd.","url":"sony_playstation2_d_part1/Dawn%20of%20Mana%20%28USA%29.zip","filesize":2676239042,"score":5.7,"genres":"Role-playing (RPG) > Behind view > Anime / Manga > Real-time > Action RPG > Direct control > Fantasy","desc":"<p><em>Dawn of Mana</em> (Seiken Densetsu 4) is a game in the World of Mana / Seiken Densetsu series by Square Enix. The story takes place shortly before Sword of Mana and as an action game with exploration elements the gameplay involves traversing levels full of challenges including feats of dexterity, solving puzzles, and defeating monsters in various ways. Unlike the other games in the series, it cannot be considered an RPG.</p><p>Gameplay is separated by cut-scenes that depict the plot and story using the characters and environments, voice-overs, narration, and pictures. The player controls the main character, Keldy, who wields a sword for attacking, a whip for grabbing and throwing, and pellets for ranged attacks. Unlike the other Mana games there are no shops where equipment or new items can be bought - there are only music tracks and movie clips. Keldy can only enhance his combat performance with certain ribbons and special arrows. Enhancements come through emblems, by meeting certain requirements, left behind by enemies or bought at the Challenge Arena shop. They usually boost the character's basic abilities. Magic is also available through seven different spells.</p><p>The story is divided into eight chapters and the game also sports a Challenge Arena mode where players need to complete 32 separate challenges, optionally with the help of a pet, bought in shops or obtained through eggs discovered in the game. The game uses the Havok physics system, allowing Keldy to use his whip on almost any part of the environment. This is further encouraged through the game's Mono system, where objects hit in the surroundings of enemies induces panic, also making available boost medals.</p>"},{"name":"DDRMAX 2: Dance Dance Revolution","year":2002,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"sony_playstation2_d_part1/DDRMAX2%20-%20Dance%20Dance%20Revolution%20%28USA%29.zip","filesize":773283332,"score":7.7,"genres":"Simulation > Music / rhythm","desc":"<p>The second PlayStation 2 DDR title released in Japan features 70 songs and includes the Diet and Oni modes in addition to the standard arcade mode.  As with previous titles, the player must hit the proper arrows (either with a dance pad or controller) that correspond to the beats in music.  Scoring well or completing certain songs will unlock new modes and songs.</p>"},{"name":"DDRMAX Dance Dance Revolution","year":2002,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_d_part1/DDRMAX%20-%20Dance%20Dance%20Revolution%20%28USA%29.zip","filesize":600367994,"score":7.8,"genres":"Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p>The popular arcade dance game is back in its first PS2 version.  Step in the right direction when the arrows appear.  A true test of eye-feet coordination and speed.  New to the DDR home versions are full motion video background and freeze steps, now you have to hold certain steps for a short duration.  With over 65 songs and various gameplay modes, this will be a great addition to both DDR veterans and newcomers.</p>"},{"name":"Dead Eye Jim","year":2007,"developer":"Na.p.s. Team s.n.c.","url":"PS2_COLLECTION_PART5/Dead%20Eye%20Jim%20%28Europe%29.zip","filesize":46923233,"score":"","genres":"Action > Behind view > Arcade > Shooter > Western","desc":"<p><em>Dead Eye Jim</em> is a Western themed single player 3D shooter game played from a third person. The player will take on the role of sheriff Dead Eye Jim who has to combat the bandits causing trouble in the desert towns. The game is very similar to the PS1 game Wanted from 2004.</p><p>The game offers several missions in which bandits appear in the windows of towns building. The player starts the game with three lives and has the ability to doge enemy fire. As the player progresses he can pick up better guns and use these till they are empty and points boxes for the Hi score.</p>"},{"name":"Dead or Alive 2","year":2000,"developer":"Team Ninja","url":"PS2_COLLECTION_PART5/Dead%20or%20Alive%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1124440285,"score":8.3,"genres":"Action > Side view > Fighting > Martial arts","desc":"<p>The arcade conversion adds an improved tag feature, with new stadiums to fight in, new character moves to play with, and plenty of windows, walls and ledges to fall over and crash through. Unlike Tekken Tag Tournament, however, DOA2 also includes a single player mode, a dodge button (allowing you to move left and right away from attacks), and multi-level arenas.</p>"},{"name":"Dead to Rights","year":2002,"developer":"Namco Hometek Inc.","url":"PS2_COLLECTION_PART5/Dead%20to%20Rights%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":1643775841,"score":7.2,"genres":"Action > Behind view > Mini-games > Shooter > Direct control > Detective / mystery > Regional differences","desc":"<p><em>Dead to Rights</em> is a 3rd-person shooter in which the player is Jack Slate, a police officer in Grant City. On a routine call, he finds the dead body of his father. While trying to find the murderer, he is framed for another murder. Jack becomes a fugitive; his run from the law will take him to various places, from strip joints and hotels to office complexes, and even prison, as an inmate.</p><p>When controlling Jack, players can perform various moves, such as grabbing an enemy from behind and using him as a human shield, or tossing a fire extinguisher and shooting it, causing a huge explosion. If Jack does not have a gun drawn, he can disarm an enemy which causes him to steal the enemy's gun, then performing some sort of finish, such as a neck breaker. Initially, only a few disarm moves are available, but more can be unlocked as the game progresses.</p><p>Players will sometimes have to control Jack's best friend and partner, his K-9 dog Shadow, which allows enemies to be killed from a distance. In addition, Shadow will fetch their guns and bring them to Jack.</p><p>The game also features \"adrenaline combat\", similar to \"Bullet Time\" from Max Payne. Jack will then perform slow-motion dives and spins, giving him an advantage, as long as his adrenaline meter holds out.</p>"},{"name":"Dead to Rights II","year":2005,"developer":"Widescreen Games SARL","url":"PS2_COLLECTION_PART5/Dead%20to%20Rights%20II%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":1287989480,"score":5.8,"genres":"Action > Behind view > Beat 'em up / brawler > Shooter > Direct control > Contemporary > North America > Crime","desc":"<p>Jack Slate is back, in this beat-up sequel to the first. He teams up with his K9 Dog, Shadow, to overtake the criminal underground in Grant City. The main focus of the game is on Jack taking down crime after the kidnapping of a judge. He discovers a city full of corruption and betrayal.</p><p>Included is a 360 degree fighting system. Returning to the game is the super slow motion that was originally employed in  Max Payne games and The Matrix movie. You can now use Shadow to attack enemies in real-time while you beat down on other enemies. If his stamina bar is high enough, Slate's K9 will kill the enemy, and if he is tired, he'll work to keep any enemy away with vicious bites.</p><p>This game includes a lot of weapons including rocket launchers, grenades, and Molotov cocktails. The minigames are not essential to the game, whereas they were in the original game. However, most of the game is very similar to its predecessor.</p>"},{"name":"Deadly Strike","year":2004,"developer":"Psyworks Co. Ltd","url":"PS2_COLLECTION_PART5/Deadly%20Strike%20%28Europe%29.zip","filesize":496935689,"score":"","genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Fighting > Hack and slash","desc":"<p>The player plays as 1 of 6 combatants vying for victory in one of the world's toughest tournaments. Each combatant has their own personal motivation in trying to win the tournament,</p><p>The player has to punch, slash, and shoot their way through six stages containing hordes of enemies on a quest to reach the shogun's castle.</p><p>The game contains a kill combo system (combos add up as long as you kill each enemy within a certain time), which enables the player to gain points. These points can then be used to buy new costumes, abilities, and bonuses in the shop.</p><p>There is also a survival mode which pits the player against a non-stop barrage of enemies.</p><p>The player can also unlock the Extra mode, which gives them the opportunity to walk in the enemies shoes. The player can pick from 6 grunts and see what it's like to rebel against the shogun's rule. The game also contains an unlockable  boss battle mode.</p>"},{"name":"Dear My Friend: Love Like Powdery Snow","year":2005,"developer":"Light","url":"sony_playstation2_d_part1/Dear%20My%20Friend%20-%20Love%20Like%20Powdery%20Snow%20%28Japan%29.zip","filesize":1171000384,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Originally released as an adult romance visual novel for PC (Windows) under Dear my Friend title, the PlayStation 2 version was released a year later and excludes all the adult content, but includes extra stories. Later that year, another PC (Windows) version was released which included both PS2 extra stories and adult content from the original release.</p><p>The game tells a story of Kyouichi Morikawa, a young student who soon finds himself living with a girl of same age, Mai, who wondered on his doorstep one cold winter. Appearing to be an orphan, Kyouichi's father adopts her and now both Kyouichi and Mai have to find a way to live together. Kyouichi, who was just a mediocre day-to-day student wasn't that popular, once Mai starts going to the same school and gets assigned to his class, suddenly gains popularity among the girls as they start noticing him thanks to his new company.</p><p>The game is a typical visual novel which feature static character artwork with occasionally animated emoticons that depict characters' disposition. Voice-acting is present for both heroines and male characters, with exception to the protagonist. Occasional choices during conversations branch or otherwise affect the story, and sometimes you can select a character you wish to talk to from the locations available on the map of the school campus. Bonus features include unlockable character artwork and CG events, as well as BGM player which is full unlocked from the start.</p>"},{"name":"Dear My Sun!!: Musuko, Ikusei, Capriccio (Genteiban)","year":2007,"developer":"","url":"sony_playstation2_d_part1/Dear%20My%20Sun%21%21%20Musuko%20Ikusei%20Capriccio%20%28Japan%29.zip","filesize":2787543478,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition release includes:</p><ul><li>Dear My Sun!!: Musuko, Ikusei, Capriccio game</li><li>Artbook</li><li>Free Talk CD</li></ul>"},{"name":"DearS","year":2004,"developer":"VRIDGE Inc.","url":"sony_playstation2_d_part1/DearS%20%28Japan%29.zip","filesize":1542229889,"score":"","genres":"Adventure > Simulation > 3rd-person (Other) > Anime / Manga > Visual novel > Sci-fi / futuristic > Licensed","desc":"<p>In the near future, a UFO crash in Tokyo reveals the existence of aliens to the world. The stranded aliens, who come to be known as DearS, look and act much like humans, but come from a very different society. Though contact with their homeworld is soon reestablished, many DearS remain on Earth, joining human society.</p><p><em>DearS</em> is a visual novel &amp; relationship simulation game based on the manga created by Peach-Pit. The player is cast as high-school student Takeya Ikuhara, who until recently was living alone, but has had two young, female DearS move in with him: Ren and Tina, who view Takeya as their master.</p><p>The game is broken up into days, with different actions and locations available depending on the time of day and the day of the week. The player must interact with different characters to proceed through the story and further the relationships with each character. In particular, Ren and Tina can be given both presents and orders -- such as to cook dinner, or read a book -- which will increase their attributes and their affection towards Takeya. Depending on the player's actions, different events will occur, and the ultimate goal is to reach each character's \"good ending\".</p>"},{"name":"Death by Degrees","year":2005,"developer":"Namco Limited","url":"sony_playstation2_d_part1/Death%20by%20Degrees%20%28USA%29.zip","filesize":2842641892,"score":5.6,"genres":"Action > 1st-person > 3rd-person (Other) > Beat 'em up / brawler > Stealth > Martial arts > Spy / espionage","desc":"<p>In this Tekken spin-off, you control assassin Nina Williams as she fights to take down terrorist organization/evil corporation Kometa. She infiltrated a luxury cruise ship, Amphitrite, as a fighter in an illegal fighting tournament. The mission was to find out more about this organization, and two other CIA operatives were sent onboard the cruiser. Nina was but a support member of the team, not to take anything in her own hands unless her colleagues fail. Yet, when she is taken captive, and receives the news of mission failed, she's about to take matters into her own hands, and do what she's trained to do... sweep off the decks.</p><p>Nina must make her way through a large cruise ship, finding keys and scanning prints to gain access to more areas while using stealth to avoid the guards. When stealth fails, the game's more unique aspects come into play. Although game uses 3rd-person perspective, on certain occasions it switches to 1st-person view such as when using a sniper rifle, swimming underwater, or crawling the ducts.</p><p><em>Death by Degrees</em> uses analog sticks to perform the attacks. The left stick moves Nina, and make her dodge when tapped instead of moved gradually, while the right stick makes her attack in whatever direction it is tapped, so attacks can be executed in any direction. Blocks are executed by holding the right stick toward the enemy at the precise moment of attack. In fights, you can disable enemies quickly with precisely-aimed bone-breaking maneuvers. When executed correctly, the game switches to an x-ray views to bone crushing a bit more enhanced then it was done in Rogue Ops. You can lock camera over your shoulder in most of the areas, which then allows you to freely rotate the camera while Nina is constantly in her running mode. Beside martial arts, she can use variety of melee weapons like knives, batons, swords, and such, as well as pistols, machine guns, and other firearms. As you defeat opponents, you gain points which serves you to upgrade already rich plethora of moves and attacks.</p>"},{"name":"Death Crimson OX","year":2003,"developer":"Ecole Software Corp.","url":"sony_playstation2_d_part1/Death%20Crimson%20OX%2B%20%28Japan%29.zip","filesize":308939584,"score":6.1,"genres":"Action > 1st-person > Arcade > Rail shooter > Shooter > Post-apocalyptic > Horror","desc":"<p>On July 29, 2010, the city of Saronica comes under attack by an army of monsters called the SMO as they lay siege to the city, capturing it and ruling the populace under an iron fist. During this, The Resistance is formed in an attempt to stop the SMO, lead by a woman by the name of Lily who is kidnapped when she attempts to help a man by the name of Kou. After she is captured, it is learned the man has come into possession of two ancient pistols by the name of \"Crimson\" that can destroy the monsters and their vicious leader. Kou sets out with Lily's daughter, Yuri, to bring her back and stop the evil forces within the city.</p><p><em>Death Crimson</em> is a light-gun game similar in style to House of the Dead where the player shoots at enemies that pop up on screen and save innocents from the monsters. The player can also power-up the \"Crimson\" pistols by shooting death flowers that will turn their firepower into machine guns to decimate hordes of enemies. There is also a health meter that will increase in size by successfully shooting enemies, gaining experience points. Once enough points are obtained, the health bar will increase, however missing enemies or shooting civilians will take away points.</p>"},{"name":"Deep Water","year":2004,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART5/Deep%20Water%20%28Europe%29.zip","filesize":68999652,"score":"","genres":"Action > 3rd-person (Other) > Shooter > Naval / watercraft > Post-apocalyptic","desc":"<p><em>Deep Water</em> is a single player action shooter game set in a post-apocalyptic world where the atmosphere has changed after an unspecified disaster. You now take on the role of a young man named El Shipak who hunts sea monster for a living. Six months ago Shipak has sighted a special monster and he is now obsessed with hunting it down.</p><p>Gameplay includes sailing around the oceans with El Shipaks boat. In the Oceans are floating harbors where supplies like fuel and ammo can be bought to hunt down the monster. Here the player can also buy better guns and upgrade his ship. At the harbor the player can also take on missions. Missions usually involve sailing to a certain area and gunning down enemies from the deck of your ship. Maneuvering the ship and fighting off the enemies can’t be done at the same time. If fighting enemies the player can move freely across the deck of the ship.</p>"},{"name":"Deer Hunter","year":2003,"developer":"Coresoft, Inc.","url":"sony_playstation2_d_part1/Deer%20Hunter%20%28USA%29.zip","filesize":290707916,"score":"","genres":"Action > Simulation > Sports > 1st-person > Behind view > Hunting > Direct control > North America","desc":"<p>Deer Hunter is a hunting game made for the PlayStation 2 featuring online tournament play. </p><p>Hunt in a variety of locations including Montana, British Columbia, Maine, Idaho, Mexico, Wisconsin, Tennessee and Colorado. Track and bag a wide variety of animals including grizzly bears, mountain lions, goats, elk, big horn sheep and moose.</p><p>Choose from 17 different weapons, and ride your ATV, snowmobile, boat or horse to prime hunting areas.</p>"},{"name":"Def Jam: Fight for NY","year":2004,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART5/Def%20Jam%20-%20Fight%20for%20NY%20%28Europe%2C%20Australia%29%20%28En%2CFr%29.zip","filesize":2253943851,"score":8,"genres":"Action > Side view > 2D scrolling > Fighting > Wrestling > Licensed","desc":"<p><em>Def Jam: Fight for NY</em> is the sequel to the out-of-left-field Def Jam: Vendetta.</p><p>The game opens with the person you beat in the previous game, D-Mobb, being arrested. As the police are driving, an SUV comes out of nowhere and smashes into the car, setting D-Mobb free. After a quick cutscene, it turns out the person who was driving the SUV was you, and you have now joined D-Mobb's crew.</p><p><em>Fight for NY</em>'s story mode takes you through the ranks, and pits you against tougher and tougher fighters. You start off in D-Mobb's crew as a nobody and will have to work your way up, fighting off people from other crews, including D-Mobb's rival, Crow. You'll take part mostly in one-on-one brawls, with the odd team match and free for all thrown in.</p><p>To aid you in fighting, you can use the environment to hurt your enemy. You can smash people into wooden/cement walls, fences, or just whack them off of a wooden pillar. Speakers, soda machines, garbage cans... All there to harm your enemy (or you). Some objects are interactive, such as floodlights, which will change the lighting of the ring once someone's been thrown into them. You have weapons at your disposal, usually a metal pipe, pool cue, and a broken bottle.</p><p>The crowd also gets into the action, which can be good or bad for you. You can throw an enemy into a crowd and have them push him towards you; you can knock a stunned enemy into the crowd, and they will hold him down, giving you free shots; or you can throw an opponent into a part of the crowd holding a weapon, and they'll use the weapon against him.</p><p>There are five fighting styles available to you. There is Street Fighting, which focuses on punches; Kickboxing, which focuses on kick attacks; Martial Arts, which focuses on speed, running, and acrobatic attacks; Wrestling, which focuses on standard wrestling moves, like bodyslams; and Submissions, which focus on wearing down a specific part of the enemy until that limb is damaged enough to earn a submission.</p><p>In addition to Story mode, you have Battle mode, which allows you to play with up to four players in different types of matches.</p><p><em>Fight for NY</em> has lots of unlockables. Earning reward points from Battle matches, you can purchase new fighters or venues to fight in.</p>"},{"name":"Def Jam: Vendetta","year":2003,"developer":"AKI Corporation","url":"PS2_COLLECTION_PART5/Def%20Jam%20-%20Vendetta%20%28Europe%29.zip","filesize":1796685684,"score":7.1,"genres":"Action > Sports > 3rd-person (Other) > Fighting > Wrestling > Licensed","desc":"<p>Wrestling game featuring the artists from the Def Jam Recordings hip-hop label, such as DMX, Ludacris, Method Man, N.O.R.E., Redman, Scarface, WC, Ghostface Killah and more! Featuring more than 40 playable characters (the aforementioned with 1500 wrestling moves, Def Jam: Vendetta is all about money, power, and respect on the underground wrestling business. And, of course, the hot chicks that hang around these parts! DJ:V features a cinematic story mode and many other play modes.</p>"},{"name":"Defender","year":2002,"developer":"7 Studios, Inc.","url":"sony_playstation2_d_part1/Defender%20%28USA%29.zip","filesize":2617936928,"score":6.7,"genres":"Action > Behind view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Defender is an updated version of the classic arcade game of the same name. The Manti bugs have invaded earth and the remaining human survivors now live in colonies throughout the solar system. As more swarms of Manti arrive, even the colonies are now in danger of being wiped out. You've been enlisted to help save the remaining colonists and destroy the Manti bugs! There are a total of six different ships to fly, each with its own flight characteristics and special weapons. Weapon and shield power-ups can also be found throughout the various missions. As in the original version of Defender, the Manti will try to capture any humans they can find to change them into mutants to increase their attack force. To increase chances of success you will need to rescue captured humans before this happens and bring them to a safe landing zone. Saving colonists will also earn you some credits, which can later be used to buy improved weapons or shields for your ship. Also included are several video extras detailing the historical perspective of and the making of Defender.</p>"},{"name":"Delta Force: Black Hawk Down","year":2005,"developer":"NovaLogic, Inc.","url":"PS2_COLLECTION_PART5/Delta%20Force%20-%20Black%20Hawk%20Down%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1766078003,"score":7,"genres":"Action > 1st-person > 3rd-person (Other) > Shooter > Direct control > Africa > Contemporary > Historical events > Regional differences","desc":"<p><em>Delta Force: Black Hawk Down</em> is a first-person action game that takes place in Somalia, where the famous Mogadishu operation took place. The game is based on real events that were also depicted in a book and a movie \"Black Hawk Down\". First half of the game consists of varied missions that Delta Force soldiers had to engage into, like defending UN food convoys, rescuing hostages or destroying weapon shipments.</p><p>Second half of the game covers the events of the mission Irene on October 3rd, 1993. Its goal was to capture two lieutenants of the Somali warlord Mohamed Farrah Aidid and was expected to last less than 30 minutes, but after two Black Hawk helicopters were shot down, it took US soldiers more than 16 hours to return to safety. 18 US soldiers, 1 Malaysian and hundreds of Somalis were killed. A 19th SFC. Matt Rierson died two days later in an mortar attack.</p><p>On most missions the player works as a member of a small Delta Force team, working in co-operation with US Army Rangers or UN forces. Some missions include the player riding as a machine-gunner on a Humvee or a helicopter (including Black Hawks).</p>"},{"name":"Delta Force: Black Hawk Down - Team Sabre","year":2006,"developer":"Ritual Entertainment","url":"PS2_COLLECTION_PART5/Delta%20Force%20-%20Black%20Hawk%20Down%20-%20Team%20Sabre%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":979228510,"score":6.5,"genres":"DLC / Add-on > South America > Customization / outfit / skin > Item > NPC / enemy > Other > Story / mission > Regional differences","desc":"<p><em>Team Sabre</em> is the expansion pack for NovaLogic's first-person shooter Delta Force: Black Hawk Down.</p><p>Team Sabre provides several single-player missions grouped into an anti-terrorist campaign in Iran, and a drug-lord chase through Colombia. This expansion pack breaks free of the tight streets of Somalia and sends you to diverse settings such as desert oil platforms in the Middle East, and the jungles of South America.</p><p>A few new weapons and vehicles have been added to those taken from Black Hawk Down, and hoards of new enemies will rain down on you as you fight through each mission. As with the original game, multiplayer games are available over the Internet or across the LAN. Up to 50 players can join one game, and you can choose a new character skin for your player, a British SAS officer.</p><p>The PC version of <em>Team Sabre</em> is an expansion pack and requires the original Delta Force: Black Hawk Down in order to install. The Playstation 2 version of <em>Team Sabre</em> is a standalone title and allows up to 32 players in a multiplayer game.</p>"},{"name":"Demolition Girl","year":2004,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART5/Demolition%20Girl%20%28Europe%29.zip","filesize":275024280,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Shooter > Flight / aviation > Helicopter","desc":"<p>Part of the  Simple 2000 series of games.  Tamsoft delivers the tale of a Riho; a Bikini model who becomes a giant after being stung by some sort of alien jellyfish.You then are given the task of measuring her dimensions, chasing and then bringing her back down to size.</p><p>You take on the role of a Helicopter, Jet and Tank while Riho rampages around Japan causing destruction and mayhem. Gameplay varies from measuring Riho, chasing her down a highway and protecting her sleeping form from alien squids while flying over the ocean.</p><p>As this is a Simple 2000 game, <em>Demolition Girl</em> is short and simple. The controls for each vehicle are similar and the graphical style is more or less consistent with other Tamsoft titles in the Simple 2000 series.</p>"},{"name":"Demon Chaos","year":2005,"developer":"Genki Co., Ltd.","url":"PS2_COLLECTION_PART5/Demon%20Chaos%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2800568898,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fantasy","desc":"<p>In feudal Japan, different clans are waging wars against each other. All of a sudden, demons spawn around the country and add to the chaos. In <em>Demon Chaos</em>, the player takes control of Inugami, the embodiment of the god of war, to cleanse the lands of the demons.</p><p>This title is a 3rd person hack and slay action game. Inugami can use a combination of various attacks to get rid of the demon hordes, of which there are plenty in Demon Chaos. In most missions, there are friendly armies fighting along side the protagonist that have to be protected. The player can give the armies a rudimentary follow command and create various pillars, which can for example heal surrounding units. Inugami's health can be restored by getting close to Aoi Yasaka, a priestess that accompanies him throughout the player's journey. During the fight, a spirit gauge can be charged to unleash special attacks - enemies occasionally drop items to restore the spirit energy. After each mission, new weapons are unlocked with gradually improving properties.</p>"},{"name":"Densha de Go! Final","year":2004,"developer":"Taito Corporation","url":"sony_playstation2_d_part1/Densha%20de%20Go%21%20Final%20%28Japan%29.zip","filesize":2232034677,"score":"","genres":"Simulation > 1st-person > 3rd-person (Other) > Train","desc":"<p><em>Densha de GO! Final</em> is another entry in the popular Japanese series of train driving simulations. Players can drive a number of the trains on the following lines: Yamanote Line in Tokyo, Chūō Main Line, Osaka Loop Line and Tōkaidō Main Line.</p><p>New to this game is a chain system which rewards flawless gameplay with a higher score and introduces a more arcade emphasis. Afterwards these points can be used for unlocking new trains, slide shows and videos. There is also a Conductor Mode, in which you have to announce the name of the upcoming station and open and close the trains' doors on the appropriate sides.</p>"},{"name":"Desi Adda: Games of India","year":2009,"developer":"GameShastra Inc.","url":"PS2_COLLECTION_PART5/Desi%20Adda%20-%20Games%20of%20India%20%28India%29%20%28En%2CHi%2CPa%2CTa%29.zip","filesize":359292121,"score":"","genres":"Action > 3rd-person (Other) > Direct control","desc":"<p>Follow the story of Avinash as he returns to his parents’ village to meet a host of curious characters. Along the way, learn how to play some of India’s most cherished games – including Goats and Tigers, Gilli Danda, Pachisi, Kabaddi and more.</p>"},{"name":"Desire","year":2004,"developer":"C's Ware","url":"sony_playstation2_d_part1/Desire%20%28Japan%29.zip","filesize":1405191878,"score":6.9,"genres":"Adventure > 1st-person > 3rd-person (Other) > Anime / Manga > Adult > Detective / mystery","desc":"<p>A research institute is located on a remote island. Apparently the researches being conducted there have some sort of an unofficial link with the military, so journalist Albert Macdgul is sent to investigate and see what he can find out. At the same time Tina, a young girl, is washed ashore on the island with no recollection of what has happened to her or who she is. Meanwhile, the technical manager Makoto Izumi seems to think that something weird is going on with the researches being conducted.</p><p><em>Desire</em> is a Japanese-style adventure game. The game is played via a standard text interface where the player selects commands from a menu, interacting with other characters and places. The game consists of four chapters which make up the same storyline, but viewed by different characters. In each chapter the player will see the events and situations from different angles and uncover layers of the main plotline.</p><p>The computer versions of the game have scenes with explicit nudity and sexual situations, which are not present in the console releases.</p>"},{"name":"Despicable Me: The Game","year":2010,"developer":"Monkey Bar Games","url":"PS2_COLLECTION_PART5/Despicable%20Me%20-%20The%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":904575270,"score":"","genres":"Action > Side view > 2D scrolling > Real-time > Platform > Direct control > Fantasy > Licensed","desc":"<p>Be Despicable! (It’s fun!) Despicable Me: The Game lets players of all ages experience the thrill of being Gru, one of the world’s greatest supervillains who is planning the biggest heist in history – stealing the moon. Complete heists and missions in a unique blend of action and puzzle solving that combines the fun of commanding minions and using an arsenal of Despicable gadgets and weapons.</p>"},{"name":"Destroy All Humans!","year":2005,"developer":"Pandemic Studio Pty Ltd","url":"PS2_COLLECTION_PART5/Destroy%20All%20Humans%21%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":2321718920,"score":7.2,"genres":"Action > Behind view > Sci-fi / futuristic","desc":"<p>Greetings earthlings! I, Cryptosporidium 137 of the Furon Empire, happened upon your planet on the way back from destroying the martians. Due to some experiments with atomic weaponry, we lack genitalia and the quality of our clones has degraded. Since you pathetic humans all carry Furon DNA in your genetic code, I have been instructed to collect fresh samples. Survival is not an option, but you should be honoured to support the legacy of the Furon Empire!</p><p><em>Destroy All Humans!</em> is a humorous action game with winks to the era of the goofy fifties' sci-fi movies. Crypto can hypnotize and scan people, and lift objects using psychokinesis. He can also control humans using the Hypno Blast to impose his commands. Extracted DNA can be exchanged in your mothership for new weapons and ability upgrades. Furon weaponry includes a Zap-o-Matic, disintegrator ray, abducto beam, quantum deconstructor and even the famous anal probe. Not to be overpowered, you have to disguise yourself using the Holobob. There are different alert levels, similar to the Grand Theft Auto games and if you are not careful, you will be hunted down by the police, military or the government.</p><p>You are constantly in contact with the mothership, where you can purchase upgrades, save the game and apply for new missions. Crypto does not have to run all the time, he can also use his flying saucer to abduct humans or animals, cause havoc or face bigger threats. Next to the story-based missions, you will also be instructed to collect specific samples or kill a certain amount of humans in a race against time.</p>"},{"name":"Destroy All Humans! 2","year":2006,"developer":"Pandemic Studio Pty Ltd","url":"PS2_COLLECTION_PART5/Destroy%20All%20Humans%21%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2029631388,"score":7.3,"genres":"Action > Behind view > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>Our \"hero\", Crypto 137, is back. Earth is under attack again in another alien invasion. The setting is now the 1960s. You go around hunting Humans with your Zap-o-Matic, Ray Gun, or brand new weapons. Occasionally, there are probing missions where you can hypnotize a Human to do something to carry out your plans for the Furon Empire. There are also missions where you trick humans into being abducted by your ship. </p><p>Crypto also has new weapons: the Dislocator, a gun that shoots purple discs and grabs anything (including tanks) to beat them up; the Meteor Strike, a gun that can rain down meteor showers upon the enemy... and another gun called Gastro, which is a hologram on a hovership that helps out Crypto. </p><p>The side quests have fleshed-out stories now; in addition, there are cult missions where you convince humans to worship an Alien God. A Co-op mode has also been added. The entire game can be played through on a split-screen and the second player can join in or out of the action at any time through the pause menu.</p>"},{"name":"Destruction Derby: Arenas","year":2004,"developer":"Studio 33 (UK) Ltd.","url":"PS2_COLLECTION_PART5/Destruction%20Derby%20Arenas%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":2929588371,"score":6.1,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Vehicular combat","desc":"<p>The PS1 Destruction Derby titles would put you in the seat of a high powered vehicle, in either an arena or a track, and the target was to race to the finish, while causing as much destruction to the other cars as possible.</p><p>Now comes the PS2 sequel.  Because this is now on the PS2, the capabilities are much higher, so now there is a vastly improved graphics engine, physics engine, and levels.</p><p>Arenas introduced loads of online play modes to try, with up to 19 other racers online with you, and now, the crashes are bigger than ever. The online servers for the game were closed in June 2008.</p>"},{"name":"Detective Mouse","year":2004,"developer":"The Code Monkeys Ltd."},{"name":"Detonator","year":2002,"developer":"KAZe Co., Ltd.","url":"PS2_COLLECTION_PART5/Detonator%20%28Europe%29.zip","filesize":513256255,"score":"","genres":"Puzzle > 3rd-person (Other)","desc":"<p><em>Detonator</em> is a puzzle game in which the player must destroy buildings with dynamite. It has three game modes:* The Main Game: This is a single player game with four modes, each mode has five buildings to demolish with different buildings use different kinds of explosive.</p><ul><li>Challenge mode: a single player game in which the player must demolish ninety-nine stages within the constraints of time and limited dynamite</li><li>Battle mode: This is the two player option in which players compete to demolish four buildings as quickly as possible, this is made more difficult as the losing player can restart the winning player's game map thus slowing them down</li></ul><p>Each building consists of a series of maps or stages in which the player must place and detonate blocks of dynamite. On the left of the screen is a menu showing the shapes of charge available, the player can scroll up/down this list with the SQUARE &amp; CIRCLE buttons. Once a charge type has been selected the player places it in position with the D-PAD buttons using the R1 button to rotate where necessary, they then use the CROSS button to detonate the charge. All blocks within the stage that are covered by the charge are damaged as are all blocks that are adjacent to both the charge on one side and another damaged block on the other. The object being to damage all the blocks with the amount of dynamite and turns specified for the stage.<br>When all stages in a building have been completed the player is treated to a video sequence of the demolition and the next building is unlocked.</p>"},{"name":"Deus Ex","year":2002,"developer":"Ion Storm Austin","url":"PS2_COLLECTION_PART5/Deus%20Ex%20%28Europe%29.zip","filesize":982825657,"score":8.2,"genres":"Role-playing (RPG) > 1st-person > Action RPG > Shooter > Stealth > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>Some time during the 2050's, the world is a dangerous place as terrorists, drug czars, and outlaw states rule, using violence and subterfuge as tools in their push for global conquest. A deadly virus dubbed \"gray death\" is running rampant throughout the world and the only known cure is a chemical known as \"Ambrosia\" manufactured by the VersaLife corporation. However Ambrosia supplies are scarce and world governments, particularly the United States, carefully monitor and control who receives this cure. As protest against these events, French terrorist organization \"Silhouette\" bombs the historic symbol of friendship between French and American people, The Statue of Liberty. In response to this attack, the United Nations Anti-Terrorist Coalition (UNATCO) organization is formed. Building a headquarters underground at Liberty Island, its mission is to attack terrorism and maintain peace around the world. JC Denton is a nano-enhanced agent who has been primed for UNATCO service. While JC's brother Paul is already an active agent, JC is beginning his first day of service when the National Secessionist Forces (NSF) suddenly raid a supply of Ambrosia at UNATCO headquarters.</p><p><em>Deus Ex</em> is a dark cyberpunk game that combines gameplay styles of first-person shooter and RPG, with elements of stealth and puzzle-solving. The player assumes the role of JC Denton, UNATCO anti-terrorist agent. Pitted against an elaborate global conspiracy, he must interact with characters, pick up weapons and complete objectives. While JC is essentially fixed within the mission-framework of the game, he can be customized in areas such as weapons, technical skills and physical prowess. Completing objectives rewards the player with skill points, which may be distributed to increase JC's proficiencies in eleven different disciplines. The player can choose to increase the damage JC inflicts with various types of weapons, improve his lock-picking or computer hacking abilities, etc. Each such discipline has four levels of proficiency.</p><p>Another way of customizing JC is applying nano-augmentations to his body. These cybernetic implants bestow the hero with super-human abilities, and can be installed on different body parts, up to nine at the same time. Along with combat-related benefits, nano-augmentations also grant JC abilities that can be used to overcome certain obstacles within the game world. Examples of those are jumping to extreme heights, swimming, lifting heavy objects, etc. Weapons can be customized as well: their range, accuracy, and magazine sizes can be increased, and they can be enhanced by attaching scopes, silencers, or laser sights to them.</p><p>The game leads JC to various places all around the globe. The cities he visits, as well as most mission areas, are expansive and fairly open to accommodate different approaches to solving the same problems, depending on the player's preferred style of play. Most of the missions can be tackled in various ways, e.g. with brute force, stealth, or extensive usage of lock-picking and computer hacking abilities. At certain points, the course of the storyline can also be influenced by the decisions made by the player. Similarly to System Shock games, the environment is largely interactive, the player being able to pick up, use, and discard various types of objects.</p>"},{"name":"Deus Machina Demonbane","year":2004,"developer":"Nitroplus Co., Ltd."},{"name":"Devil Kings","year":2005,"developer":"Capcom Production Studio 4","url":"PS2_COLLECTION_PART5/Devil%20Kings%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2225992621,"score":6.7,"genres":"Action > 3rd-person (Other) > Hack and slash > Fantasy","desc":"<p><em>Devil Kings</em> is in the same vein as the Dynasty Warriors series. Whereas in Dynasty Warriors, however, Koei focuses on ancient Chinese history, Devil Kings focuses more on feudal Japan, but with a fictional setting with the ability to use modern day weapons such as chain guns and shotguns as well as fighting legendary and fictional characters from the past.</p><p>The story takes place as the Devil King, a king possessed by the soul of the Devil, has unleashed an unholy army on the world to bend it to his will as the player must stop him along with many of his minions including his wife Lady Butterfly, his general the Red Minotaur, as well as loyal assassins Scorpio and Venus.</p><p>The gameplay is more arcade hack-and-slash style, with the ability of using magic spells to wipe out entire waves of enemies and as mentioned before, the ability to use modern day weapons along with historical weapons such as spears, swords among others. There are twelve playable characters to use as well, each with their own story told in CG and anime cutscenes as well as two modes of play, Conquest (the main story of the game) and Free Mode (where players can play in any unlocked stage they have completed).</p><p><em>Devil Kings</em> is the localized version of Sengoku Basara with several significant differences. The most obvious one is the setting: instead of Feudal Japan, this version is set in a fantasy world. Because of this, the character names (no longer based on historical characters), the level art as well as the story were changed. Other differences are less player characters (12 instead of 16), harder difficulty levels and the introduction of the primer system: when using the primer attack (which was one of the special attacks of the Japanese version), the enemy becomes more vulnerable.</p>"},{"name":"Devil May Cry","year":2001,"developer":"Capcom Production Studio 4","url":"PS2_COLLECTION_PART5/Devil%20May%20Cry%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2248686614,"score":8.1,"genres":"Action > 3rd-person (Other) > Cinematic camera > Hack and slash > Horror","desc":"<p>Legend has it that 2000 years ago in the depths of hell, a demon rebelled against the devil, waging a one-man war in support of the human world. </p><p>In the present, Dante, a private investigator of the supernatural, realises that the devil is rallying to rise again against mankind. Deep within Dante's blood lies the power of ancient demons and as his power builds he transforms into a demon state where he can use his power against evil he encounters.</p><p>Commencing his battle against the demonic legions with just a sword and his twin pistols, Ebony and Ivory, Dante will soon come across more powerful weapons, such as a shotgun to aid him in his mission. However, to defeat the devil Dante must also discover special weapons possessing various elemental powers. When channelled correctly these weapons will allow Dante to call upon demonic energy and launch powerful attacks against a range of enemies.</p>"},{"name":"Devil May Cry 2 (Disc 1)","year":2003,"developer":"Capcom Production Studio 1","url":"PS2_COLLECTION_PART5/Devil%20May%20Cry%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Disc%201%29.zip","filesize":1378475990,"score":6.4,"genres":"Action > 3rd-person (Other) > Hack and slash > Horror","desc":"<p><em>Devil May Cry 2</em> is the sequel to Devil May Cry. </p><p>From the start of the game, the player controls Dante, or his new partner, Lucia, through various levels as they battle waves of demons, ultimately reaching the conclusion and finding out Arius schemes. </p><p>This game features an Amulet system, with different parts being acquired throughout the levels that can be equipped by accessing the pause menu. The different parts of the amulet can be equipped to change aspects of the characters Devil Triggers form like elemental moves, time stop abilities, faster movement, flight abilities, etc. </p><p>The game is the debut of Dante's iconic sword the Rebellion. Dante also has new abilities like running on walls, aerial kicks, and multi-directional shooting. Lucia utilizes two underhanded, curved swords and also rapidly throws knives at her enemies.</p>"},{"name":"Devil May Cry 2 (Disc 2)","year":2003,"developer":"Capcom Production Studio 2","url":"PS2_COLLECTION_PART5/Devil%20May%20Cry%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Disc%202%29.zip","filesize":1378398780,"score":6.4,"genres":"Action > 3rd-person (Other) > Hack and slash > Horror","desc":"<p><em>Devil May Cry 2</em> is the sequel to Devil May Cry. </p><p>From the start of the game, the player controls Dante, or his new partner, Lucia, through various levels as they battle waves of demons, ultimately reaching the conclusion and finding out Arius schemes. </p><p>This game features an Amulet system, with different parts being acquired throughout the levels that can be equipped by accessing the pause menu. The different parts of the amulet can be equipped to change aspects of the characters Devil Triggers form like elemental moves, time stop abilities, faster movement, flight abilities, etc. </p><p>The game is the debut of Dante's iconic sword the Rebellion. Dante also has new abilities like running on walls, aerial kicks, and multi-directional shooting. Lucia utilizes two underhanded, curved swords and also rapidly throws knives at her enemies.</p>"},{"name":"Devil May Cry 3: Dante's Awakening","year":2005,"developer":"Capcom Production Studio 1","url":"PS2_COLLECTION_PART5/Devil%20May%20Cry%203%20-%20Dante%27s%20Awakening%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3057350602,"score":8.5,"genres":"Action > 3rd-person (Other) > Hack and slash > Fantasy > Horror","desc":"<p>Dante returns in this prequel to the first Devil May Cry. The story focuses on Dante's back story, mainly on why he is feuding with his brother. The game is considered to be the hardest of the series. It has a high production value with grand music, a lush atmosphere, compelling characters, and a visually impressive upgraded graphics engine with lighting and shadow effects. An all-new Style system that allows you to select your fighting style has been incorporated into this game. The game itself is non-stop action up until Dante reaches Hellgate.</p>"},{"name":"Devil May Cry 3: Dante's Awakening - Special Edition","year":2006,"developer":"Capcom Production Studio 1","url":"PS2_COLLECTION_PART5/Devil%20May%20Cry%203%20-%20Dante%27s%20Awakening%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Special%20Edition%29.zip","filesize":3534551551,"score":7.9,"genres":"Action > 3rd-person (Other) > Hack and slash > Fantasy > Horror","desc":"<p>A re-release of Devil May Cry 3, released at a budget price with several additions to the game, including:</p><ul><li>Play as Vergil</li><li>Play as Nelo Angelo</li><li>Bloody Palace area with 9,999 levels</li><li>Turbo mode, for 20% faster game speed</li><li>Extra difficulty level</li><li>Extra boss</li><li>Extra weapons</li><li>Extra style</li><li>Choice between Yellow and Gold Orb saving systems</li><li>Demo Digest, for viewing cutscenes</li></ul>"},{"name":"Devil May Cry: 5th Anniversary Collection","year":2006,"developer":""},{"name":"Devil Summoner - Kuzunoha Raidou tai Abaddon-ou Plus","year":2008,"developer":"Atlus Co., Ltd.","url":"sony_playstation2_d_part1/Devil%20Summoner%20-%20Kuzunoha%20Raidou%20tai%20Abaddon-ou%20Plus%20%28Japan%29.zip","filesize":3393109084,"score":"","genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Interwar > Post-apocalyptic > Detective / mystery","desc":"<p><em>Devil Summoner: Kuzunoha Raidō tai Abaddon Ō Plus</em> is a Japan-exclusive limited edition of Shin Megami Tensei: Devil Summoner 2 - Raidou Kuzunoha vs. King Abaddon. It contains a second disc with a special version of Shin Megami Tensei: Nocturne Maniax (itself an enhanced version of Shin Megami Tensei III: Nocturne), entitled <em>Chronicle Edition</em>, not available outside of this compilation. </p><p>This version differs from the standard one by replacing Dante, the featured main character from Devil May Cry series, with Raidou Kuzunoha, the protagonist of the titular game, as well as his cat Gotou. Raidou is confronted as a boss enemy early in the game, replacing Dante. Following a brief dialogue with Gotou, the player-controlled party fights Raidou, whose attacks are similar to those displayed by Dante in the earlier version. Raidou can also be recruited as a playable character later, if the player fulfills conditions similar to those that were required to recruit Dante.</p>"},{"name":"Di Gi Charat Fantasy Excellent","year":2003,"developer":"M2 Co., Ltd.","url":"sony_playstation2_d_part1/Di%20Gi%20Charat%20Fantasy%20Excellent%20%28Japan%29%20%28Premium-ban%29.zip","filesize":1231380544,"score":"","genres":"Adventure > 3rd-person (Other) > Fixed / flip-screen > Anime / Manga > Turn-based > Japanese-style adventure > Visual novel > Menu structures > Fantasy > Romance","desc":"<p>This updated release of Di Gi Charat Fantasy features enhanced FMVs and additional voice acting.</p>"},{"name":"Diabolik: The Original Sin","year":2009,"developer":"Artematica Entertainment","url":"PS2_COLLECTION_PART5/Diabolik%20-%20The%20Original%20Sin%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":3302271085,"score":5.3,"genres":"Adventure > 3rd-person (Other) > Puzzle elements > Detective / mystery > Spy / espionage > Licensed","desc":"<p><em>Diabolik: The Original Sin</em> is an adventure game based on the character Diabolik; an Italian comic book character known as the \"king of terror\" and \"the perfect thief\". The player controls the \"Robin Hood\"-character Diabolik, as well as his girlfriend \"Eva Kant\", and briefly some other characters in a few chapters. The Original Sin refers to a valuable painting which Diabolik is forced to steal as his girlfriend is held captive as a hostage.</p><p>In additional to a standard point and click interface, <em>Diabolik: The Original Sin</em> features a stealth system, and some action elements which require the player to act quickly in order to succeed. The game uses 3d characters on animated backgrounds, and has comic book-like animations.</p>"},{"name":"DICE: DNA Integrated Cybernetic Enterprises","year":2005,"developer":"Natsume Co., Ltd.","url":"sony_playstation2_d_part1/DICE%20-%20DNA%20Integrated%20Cybernetic%20Enterprises%20%28USA%29.zip","filesize":647172510,"score":6.3,"genres":"Action > 3rd-person (Other) > Anime / Manga > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>DICE: DNA Integrated Cybernetic Enterprises</em> is an 3D action game based on the DICE animated series. In the game the player takes on the role of a member of the DICE (DNA Integrated Cybernetic Enterprises) organization. Apparently problems have arisen in the Sarbylion galaxy and the player has to help solve them.</p><p>In the game the player will fight a variety of enemies with his or her mechanical dinosaur operated by a pilot from the series. This mechanical dinosaur is called a Dinobreaker. This Dinobreaker weapons can be upgraded and it can also transform into a driving vehicle. It’s also possible to dismount and fight as the pilot.</p>"},{"name":"Die \"Jak and Daxter\"-Sammlung","year":2009,"developer":""},{"name":"Die Hard: Vendetta","year":2003,"developer":"Bits Studios Ltd.","url":"PS2_COLLECTION_PART5/Die%20Hard%20-%20Vendetta%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":3150051290,"score":6.3,"genres":"Action > 1st-person > Shooter > Licensed > Regional differences","desc":"<p>John McClane is back. Many years have passed since his work in New York, and he now works for the Century City Police Department (CCPD) in Los Angeles.</p><p>You are in John's shoes as he must face a new threat. Piet Gruber, the son of Hans Gruber and McClane's old enemy, is up to no good at the Townsend Art Museum. He has stolen valuable art and kidnapped John's now-adult daughter and fellow CCPD police officer, Lucy.</p><p>This game is a First Person Shooter, but it also adds two features: Stealth Mode and Hero Time. Stealth Mode allows John to sneak around quietly, even being able to grab his foes and use them as hostages. This means it may not be best to go in guns blazing when they could be arrested. Hero Time allows John to react far more quickly, just like Bullet Time in Max Payne. Hero Time is earned by saving hostages and performing heroic tasks in the game.</p><p>There are several different weapons available in the game, ranging from a paintball gun for training to a sniper rifle. Most of the guns can also be used dually for the ultimate killing spree.</p>"},{"name":"Digimon Rumble Arena 2","year":2004,"developer":"Black Ship Games","url":"ps2_collection_part6_202008/Digimon%20Rumble%20Arena%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":611126320,"score":6.8,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Platform > Martial arts > Licensed","desc":"<p>Pick your favorite Digimon and battle your way to the top in this arena-style fighter based on characters from the Digimon TV show.  You can play through various interactive (and dangerous) arenas for the championship, or you can rumble with your friends in 2-4 player multiplayer mode.  Collect pickups and learn special moves to gain the advantage over your friends, and for the ultimate upgrade, you can evolve (Digi-volve) into bigger and better versions of yourself.</p>"},{"name":"Digimon World 4","year":2005,"developer":"BEC Co., Ltd.","url":"ps2_collection_part6_202008/Digimon%20World%204%20%28Europe%29%20%28En%2CDe%2CEs%2CIt%29.zip","filesize":592876875,"score":6.5,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Action RPG > Fantasy > Licensed","desc":"<p><em>Digimon World 4</em> is the second <em>Digimon</em> game for the GameCube, PlayStation 2 and Xbox consoles. Instead of a standard RPG like the previous games, it has action RPG gameplay with hack-and-slash and supports up to four players. It also contains elements of digital pet games where creatures can be trained to level up. It is loosely based on the events in the <em>Digital Monster X-Evolution</em> animated film. You can choose between Dorumon, Veemon, Guilmon, and Agumon as the playable characters. They are members of the Digital Security Guard and their mission is to save the DigiWorld from a computer virus, called X-virus, that invaded their world.</p><p>The Digimon can go through a digivolution based on a number of parameters. Magic skills are upgraded through training. There are several types of magic and each one has its own elements, type, and level. There are three difficulty levels: medium, hard, and very hard.</p>"},{"name":"Digimon World: Data Squad","year":2006,"developer":"Prokion","url":"sony_playstation2_d_part1/Digimon%20World%20-%20Data%20Squad%20%28USA%29.zip","filesize":1519633201,"score":5.4,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Direct control > Fantasy > Sci-fi / futuristic > Licensed","desc":"<p><em>Digimon World: Data Squad</em> is an adventure role-playing game based on the Digimon animated series. In the game you play as Marcus a member of the Data Squad (DATS). Some evil Digimon have appeared in the real world and this can’t go unpunished. Now you are off to defeat them.</p><p>In the game the player can move around in real time until a hostile Digimon is encountered the player will then enter Battle Drive. The Battle Drive is a fighting mode that is played turn based. The game offers over 140 Digimon to fight and tame. Along the way over 250 items can be found that can be used to solve puzzles and in battle.</p>"},{"name":"Dino Stalker","year":2002,"developer":"Capcom Production Studio 3","url":"ps2_collection_part6_202008/Dino%20Stalker%20%28Europe%29.zip","filesize":2526528181,"score":6.4,"genres":"Action > 1st-person > Shooter","desc":"<p><em>Dino Stalker</em> is a lightgun game based on the Dino Crisis series. It is similar in concept to Resident Evil: Survivor in that your character is free to move around the environment rather than being on rails as in most lightgun games. Players can also play it as a first-person shooter using the standard DualShock 2 controller.</p><p>You play a WWII fighter pilot who is teleported out of his plane to a land full of dinosaurs where he must fight to survive and to rescue a young woman. A variety of weapons can be used in the game but the player can only carry one weapon at a time. When the game is completed a two-player mode is unlocked.</p>"},{"name":"Dinosaur Adventure","year":2004,"developer":"The Code Monkeys Ltd.","url":"ps2_collection_part6_202008/Dinosaur%20Adventure%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":523925395,"score":"","genres":"Puzzle > Mini-games","desc":"<p>After a volcanic eruption, a young dinosaur named Tio gets separated from his family and goes out searching for them.</p><p>While the disc contains a Dingo Pictures animated movie titled <em>Abenteuer im Land der Dinosaurier</em>, it also contains mini-games. The PlayStation version includes a coloring book and a sliding puzzle, while the PlayStation 2 version adds an additional matching pairs game and a jigsaw puzzle.</p>"},{"name":"Dirge of Cerberus: Final Fantasy VII","year":2006,"developer":"Square Enix Co., Ltd.","url":"ps2_collection_part6_202008/Dirge%20of%20Cerberus%20-%20Final%20Fantasy%20VII%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3908346676,"score":6.2,"genres":"Action > 1st-person > 3rd-person (Other) > Anime / Manga > Platform > Shooter > Cyberpunk / dark sci-fi > Fantasy > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Set after the events of Final Fantasy VII and the Final Fantasy VII: Advent Children movie, Dirge of Cerberus lets players take the role of the mysterious Vincent Valentine.</p><p>After a new organization arises from the events known as \"Meteorfall\", Vincent is called to the surviving town of Kalm by Reeve Tuesti, an old ally who controlled Cait Sith. Vincent has been invited to the town's celebration, but during the festivities, a group of soldiers attacks the town, killing and capturing the people. It is up to Vincent to protect the innocent once more, and find out why these soldiers are also after him.</p><p>While set in the world of Final Fantasy VII, Dirge of Cerberus is an action shooter that runs through twelve chapters. The on-screen action can be controlled by the analog controller, or via the Playstation 2's mouse and keyboard accessories, making it more in line with PC-style shooters. Being a character driven shooter, the perspective can be changed from first to third person on the fly to navigate through the multi-level environments.</p><p>Several items and characters from the series make their return, as well as the Chaos break limits system, which allows Vincent to take the monstrous forms he changed into from Final Fantasy VII to inflict more damage on the enemy. Taking a nod from its RPG-based parent, the game does allow Vincent to find the usual healing items, materia spells and gil from the Final Fantasy universe, in which he can buy and sell for other new items.</p><p>The game also features a weapon customization system, which allows the player to mix and match weapon parts to form more powerful attack items and abilities.</p>"},{"name":"Dirt Track Devils","year":2002,"developer":"Vingt et un Systems Corporation","url":"ps2_collection_part6_202008/Dirt%20Track%20Devils%20%28Europe%29.zip","filesize":185560863,"score":"","genres":"Racing / Driving > Behind view > Direct control > Automobile > Off-roading > Track racing","desc":"<p>Can you keep up with the DIRT TRACK DEVILS? Give it your best as you race diverse ATVs across snowy mountain passes, treacherous forest tracks and sunny beaches. These tracks test the limits of your driving skill. Powerslide, jump and skid your way to victory in the challenging OFF ROAD RACE mode, take on the time trial challenge in the ever-changing GYMKHANA event, or beat your buddies in the VS BATTLE RACE mode.</p>"},{"name":"Disaster Report","year":2002,"developer":"Irem Corp.","url":"sony_playstation2_d_part1/Disaster%20Report%20%28USA%29.zip","filesize":1643145689,"score":6.9,"genres":"Action > Behind view > Direct control > Survival","desc":"<p>Keith Miyamoto is a reporter who works for an important newspaper in Los Angeles. In 2005, he travels to an island called Capital City, where he has to get a new job. However, on his way from the airport to the city, a terrible earthquake occurs. The train collapses and Keith finds himself abandoned by the rescue team. Now he has to escape the island, try to save the people stranded on it, and discover the true reasons behind the chaos in the city. But that will be anything but easy. The earthquake continues, and any time Keith steps on a half-collapsed bridge, crawls over a pile of rubble, or climbs a narrow path between ruined houses, the Earth can start trembling...</p><p><em>Disaster Report</em> is a combination of pure adventure and survival horror genres. Controls, inventory management, fixed camera angles and relative vulnerability of the protagonist are reminiscent of Alone in the Dark and similar games, while the complete lack of enemies to fight reminds of a classic adventure. There are many ways to preserve Keith from constant dying. You can find items and combine them into new ones (for example, finding a helmet and a lamp will allow you to build a helmet with a flashlight attached to it). Keith will also need to quench his thirst, so you'll have to find water for him. The water taps found in the game also serve as save points.</p>"},{"name":"Disgaea 2: Cursed Memories","year":2006,"developer":"Nippon Ichi Software, Inc.","url":"ps2_collection_part6_202008/Disgaea%202%20-%20Cursed%20Memories%20%28Europe%29.zip","filesize":1094586857,"score":8,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p>In order to lift the curse placed upon the inhabitants of Veldime 15 years prior, the protagonist's mother attempts to summon the evil Overilord Zenon so that her son Adell can defeat him and lift the curse. Instead his daughter, Rozalin is summoned, and Adell commits to returning her home to her father, as well as to defeating her father when they find him. </p><p>The game is a turn-based strategy RPG in the vein of Final Fantasy Tactics. Classes gain abilities by gaining character levels, and can level up those abilities through use. New items and equipment can be bought or won in battle, and can be powered up up by entering and winning battles inside a given item. Characters can also \"gang up\" on enemies by performing combos that are activated by positioning other characters near an attacking character. This action only uses the attacking character's turn, leaving the others free to attack again. Clever coordination can have characters attacking quite a few times per turn. New characters can be created (or even reborn as other classes or just more powerful versions of the same class) by petitioning (or even bribing with special items) the Dark Assembly with \"Mana\" you earn by defeating enemies.</p>"},{"name":"Disgaea: Hour of Darkness","year":2003,"developer":"Nippon Ichi Software, Inc.","url":"ps2_collection_part6_202008/Disgaea%20-%20Hour%20of%20Darkness%20%28Europe%29.zip","filesize":541639783,"score":8.2,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p>After a two-year sleep, Prince Laharl awakens to find his father, King Krichevskoy, dead and the Netherworld in the middle of a civil war over who takes the throne. Not willing to give up his rightful place as the next king, Laharl joins with his subordinate Etna and her underlings to fight back.</p><p>The Overlord's castle acts as a hub to manage the party. It has shops to get new equipment, a gate to the different battles, a NPC to travel to the Item World, which is used to boost items, and the Dark Assembly, where the player can create new units, and have the assembly vote to pass (or not) special laws that will affect the game. To unlock some characters, a special chapter must first be unlocked by the Assembly.</p><p>The story progresses in the form of chapters. In each chapter, new battles become one after another, with dialogues at the beginning and end of those battles. Any completed battle becomes available to play again, sometimes with minor changes. At the end of every chapter, a parody cut-scene announcing the next chapter,(most often, it is Etna who tells the story as if she were the protagonist) is shown.</p><p><strong>Battle</strong>In a similar style to Final Fantasy Tactics and Ogre Battle, <em>Disgaea</em> is a turn-based strategy RPG on an isometric grid. Characters are dispatch in battle one after another, and each have a move action and an battle action. Each class has its own set of abilities, ranging from simple attacks and area attacks to magics that can affect all the battlefield. In each battle, up to ten bonuses can be obtained by clearing the Geo Panels and defeating enemies to fill the Bonus Gauge. The battle is won when all enemies are defeated, or, in the Item World, by accessing a gate to move to the next floor.</p><p><strong>The Item World</strong>The Item World is a world divided in floors, inside any of the player's item. The goal of the Item World is to progress through the floors, which raises the item's level. The more enemies are defeated before moving to the next floor, the more the item will improve. A special king of enemies, Residents, can be found in the Item World. These have their own level, and add a bonus to the item in which they reside. Once a Resident is defeated, it is \"subdued\", its level doubles and it can be moved between items. Residents can be fused together to get better bonuses. This is necessary because each item has a maximum number of Residents it can contain, determined by the item's rarity (common, rare or legendary) .</p>"},{"name":"Disney G-Force","year":2009,"developer":"Eurocom Developments Ltd","url":"ps2_collection_part6_202008/Disney%20G-Force%20%28Europe%29%20%28En%2CFr%2CEs%2CNl%29.zip","filesize":1109038700,"score":7.1,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p><em>G-Force</em> is a licensed game based on the movie of the same name. The player takes the control of Darwin who is member of a secret government organization consisting of guinea pigs. His mission: defending the evil industrial magnate Saber who manipulates home appliances and uses them as weapons. </p><p>Not surprisingly these are the main foes in this game. But Darwin is not even close to helpless: various guns and gadgets, e.g. a jet pack, a electronic whip or a grappling hook, are used to dispatch of them. Most of the time is spent in fights but there are also puzzles. Many of them require the usage of Mooch, a fly. It can be summoned at any time and is able to reach high grounds, to deactivate electronic devices, to fly through small holes and even to slow down time to pass through fast moving obstacles.</p><p>During the course of the game the player can find computer chips and hidden disks. On one hand these can be used to refresh ammo and health or to upgrade weapons. There is also the option to switch to a infrared view and scan objects. This rewards additional information.</p><p>The PlayStation 3 and Xbox 360 versions have an optional playing mode for 3D glasses.</p>"},{"name":"Disney Golf","year":2002,"developer":"T&E Soft, Inc.","url":"ps2_collection_part6_202008/Disney%20Golf%20%28Europe%29.zip","filesize":544387052,"score":"","genres":"Sports > Behind view > Turn-based > Direct control > Golf > Fantasy > Licensed","desc":"<p>Disney Golf is a continuation of the T&amp;E SOFT New 3D Golf Simulation series. This time is Disney branded and features brightly coloured cartoon-influenced 3D graphics, as you would expect. It features six fictional courses: American, Western, Mountain, Tropical, European, and Sky Course—the last two of which are unlocked through gameplay. It also features new game modes not seen before in the series—long-drive and near-pin challenges.</p><p>It was released in Japan and USA in 2002 and Europe in 2005. This is the final home console golf game from T&amp;E SOFT, Inc.</p>"},{"name":"Disney High School Musical 3: Senior Year Dance!","year":2008,"developer":"Page 44 Studios, LLC","url":"ps2_collection_part6_202008/Disney%20High%20School%20Musical%203%20-%20Senior%20Year%20Dance%21%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":655374538,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p><em>Disney High School Musical 3: Senior Year Dance!</em> is a rhythm game based on the film <em>High School Musical 3: Senior Year</em>. Players can choose to be one of the characters of the film (Chad, Gabriella, Kels, Ryan, Sharpay, Taylor or Troy) or create a new, customized Wildcat. It features several environments and songs from the three films. Gameplay is presented as a series of dance-offs where small orbs floating in one of four directions need to be timed correctly when they pass a threshold to keep the dance and the song going. On the Wii the swings are measured while the Xbox 360 version supports the tracking of steps on a dance pad.</p><p>Next to the single-player mode there is a head-to-head competitive dance mode. Sometimes quick mini-games break out in the middle of songs and special effects can be activated while dancing. By learning dance moves from the characters additional songs, clothing and characters can be unlocked.</p>"},{"name":"Disney Move","year":2004,"developer":"Artificial Mind & Movement","url":"ps2_collection_part6_202008/Disney%20Move%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":459292603,"score":"","genres":"Action > Mini-games > Party game > Licensed","desc":"<p>YOU'RE THE STAR, THE ACTOR IS YOU!</p><p>Enter into the worlds of Disney * Star with more than 15 Disney characters in 6 Disney worlds * 3 levels of difficulty per game * Expect the unexpected - explosions, bonus scoring, surprise events, crazy effects! * Single, multiplayer and survival mode</p><p>Beat Donald Duck as he tries to score against you * Fly Aladdin's magic carpet across Agrabah's sky * Shake down and groove on drums and cymbals with Lilo and Stitch * Get spooked in the Haunted Mansion * Become a sorcerer's apprentice * Fight Captain Hook and his fearsome gang pf swashbuckling pirates!</p>"},{"name":"Disney Pirates of the Caribbean: At World's End","year":2007,"developer":"Eurocom Developments Ltd","url":"ps2_collection_part6_202008/Disney%20Pirates%20of%20the%20Caribbean%20-%20At%20World%27s%20End%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1176274958,"score":5.7,"genres":"Action > 3rd-person (Other) > Cinematic camera > Platform > Quick Time Events (QTEs) > Fantasy > Licensed","desc":"<p>Based on the second and third movies of the popular \"Pirates of the Caribbean\" series, players step into the roles of Captain Jack Sparrow, Will Turner and Elizabeth Swann, as they continue their adventures on the high seas. The game is set up as a 3D action-adventure in a free-roaming world that allows players to explores the islands and seas of the Caribbean.</p><p>Players will have to face off again Davy Jones, his Flying Dutchman crew and the villainous kraken in addition to the Chinese pirate Sao Feng, cannibals, other pirates, and the East India Trading Company.</p><p>Players must battle their way through the events of \"Dead Man's Chest\" and \"At World's End\" using a variety of sword and item attacks, in addition to a system called \"Black Pearls\", which only allows players to block for so long until the Black Pearls are drained and no longer able to block until it recharges. Each character has their own special attack, and other weapons, such as pistols and daggers, can be found for use in combat.</p><p>The console and PC versions uses regular controls, whereas the Wii version makes use of the Wiimote for motion based attacks. The game makes use of quick time events called \"Jackanisms\", which allow players to handle themselves through certain events in a manner that Captain Jack Sparrow would.</p>"},{"name":"Disney Pixar Cars","year":2006,"developer":"Rainbow Studios, Inc.","url":"sony_playstation2_d_part1/Disney-Pixar%20Cars%20%28Europe%2C%20Australia%29%20%28v2.00%29.zip","filesize":1719751347,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Motion control > Automobile > Off-roading > Track racing > Fantasy > Licensed","desc":"<p><em>Cars</em> is a racing game, based on the movie of the same name, that allows the player to explore the world of Radiator Springs and surrounding areas in an open world mission-based structure. The story revolved around racing rookie Lightning McQueen, who wants to become a famous racer and compete in the Piston Cup, the equivalent of NASCAR races. You can roam freely, talk to other characters, and accept race challenges to advance the story.</p><p>There are over 20 Road Races to choose from in the Story Mode as well as 5 Piston Cup Races and additional mini-games. The player is awarded bonus points in the Story Mode that can be used to unlock bonus content material such as boost abilities, new racers (10 in total), new environments, and mini-games, such as an obstacle course or a military training event. The game also features an Arcade Menu that allows quick access to races unlocked from Story Mode as well as a VS. Mode where the player can compete head-to-head.</p>"},{"name":"Disney Pixar Cars: Mater-National Championship","year":2007,"developer":"Incinerator Studios LLC","url":"ps2_collection_part6_202008/Disney-Pixar%20Cars%20-%20Mater-National%20Championship%20%28Europe%2C%20Australia%29.zip","filesize":1569355978,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Fantasy > Licensed","desc":"<p><em>Cars: Mater-National</em> is a game adaptation of the animated feature film Cars. It features 13 characters in total, 3 areas and the following modes:* Profile: Here you can check/load any of the existing profiles and see how many points you have, the races you have won and the completion percentage you have achieved.</p><ul><li><p>Bonus Content: Bonus Content has two options – Characters and Art. In the 1st option you can use the points you have earned to unlock new cars or buy new colours for the ones you already have. The 2nd option allows you to unlock art from the cars, tracks etc. again in exchange for points.</p></li><li><p>Story Mode: You play as Lightning McQueen in the world of Radiator Springs, Ornament Valley and Tailfin Pass. While there, you can just look around, talk with other cars or enter races to earn points that can be expend to unlock new characters and other staff in the <em>Bonus Content</em> section and Bolt Banners that are needed to unlock more areas. Each time you enter a race/mini-game you’ll see a cutscene of Lightning and the cars that will compete (races only) and if you win, these races/mini-games will become available in Arcade mode. Also by winning races new events will be unlocked in Story Mode.</p></li><li><p>Arcade: Arcade mode has two options as well. Race and Minigame. The 1st option will enable you to choose one of the available cars and race in any of the tracks that you have unlocked in Story Mode. In the 2nd option you can play mini-games such as hitting the buttons that appear on the screen at the right time, trying to finish a race before running out of fuels, playing tag with another car, etc.</p></li><li><p>Versus: This mode allows you to compete against another human player.</p></li></ul>"},{"name":"Disney Pixar Cars: Race-O-Rama","year":2009,"developer":"Incinerator Studios LLC","url":"ps2_collection_part6_202008/Disney-Pixar%20Cars%20-%20Race-O-Rama%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1865884560,"score":6.1,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Licensed","desc":"<p><em>Cars: Race-O-Rama</em> is a racing game set in the Disney/Pixar Cars universe. It is the third entry in a series of THQ licensed games that include Cars and Cars: Mater-National Championship . The game includes a single-player story mode and an arcade mode. In story mode, you progress through a series of races and mini-games with a series of cutscenes. In arcade mode, you can replay story mode events and compete in 2-player split-screen races.</p><p>The plot of <em>Cars: Race-O-Rama</em> centers around Lightning McQueen as he trains students of the Doc Hudson Racing Academy to compete in the Race-O-Rama Circuit. Soon, Lightning discovers that his arch-enemy, Chick Hicks, is training a rival group of racers who don't race by the rules. Lightning must compete against these rival racers in an effort to win the Race-O-Rama trophy.</p><p>Story mode uses an open-world format, where you can explore the world and play different events by driving to marked waypoints. There are 7 different main explorable areas including Radiator Springs Stadium, Ornament Valley, Tailfin Pass, Radiator Springs, Santa Carburera, Autovia, and Motoropolis. There are also 3 mini-games based on the Disney/Pixar animated short series \"Cars Toons\" that center around the character Mater. These include \"Mater the Greater\", \"El Materdor\", and \"Tokyo Mater\".</p><p>While racing, there is a boost meter that slowly fills over time. Using the boost will give you a quick speed increase. There is also a new drifting mechanic that allows you to take tighter turns and fill the boost meter more rapidly. You can also jump in most races to avoid obstacles and other racers.</p>"},{"name":"Disney Pixar Finding Nemo","year":2003,"developer":"Traveller's Tales (UK) Ltd.","url":"ps2_collection_part6_202008/Disney-Pixar%20Finding%20Nemo%20%28Europe%29.zip","filesize":1603579623,"score":6.5,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>Guide Nemo and Marlin through their underwater adventure. Meet all of the characters from the Disney/Pixar movie, <em>Finding Nemo</em>, as you live all of the film's storyline. The search for Nemo is on, and it is up to you to find him. Dive in!</p><p>Features:* Live the film through the game and help reunite Nemo and his father Marlin.</p><ul><li>Over 15 levels of action and adventure with multiple unlockable mini-games in each level.</li><li>Play as all 3 of the main characters from the film: Nemo, Marlin, and Dory.</li><li>3-D underwater environments.</li><li>Interact with all the characters from the film including Bruce, Crush, and the Tank Gang.</li><li>Features film clips that capture the essence of the movie.</li></ul>"},{"name":"Disney Pixar Monsters, Inc.","year":2002,"developer":"Kodiak Interactive Software Studios, Inc.","url":"sony_playstation2_d_part1/Disney-Pixar%20Monsters%2C%20Inc.%20%28USA%29.zip","filesize":1969799761,"score":"","genres":"Action > Behind view > Platform > Licensed","desc":"<p><em>Monsters, Inc.</em> on the PlayStation 2 is a 3D platformer based on the Pixar film.</p><p>Players control James P. \"Sulley\" Sullivan through 8 levels based on environments from the movie, including the scream factory, the streets of Monstropolis, Sulley's apartment, the Himalayas, and more. In each level, the main goals might include picking up one or more special items, or simply finding the exit. Sulley has to make his way across platforms, ladders and conveyor belts by jumping, climbing, flipping switches and pushing crates around. Enemies are rare, but Sulley can take them out with a whack of his tail, which is also used to break crates that contain items. There are also stealth sections, where Sulley has to avoid being seen by another character. Since the game is intended for younger players, there is no limit to the retries to any level, and helpful hints are always available.</p><p>Each level also includes a number of collectibles and special tasks. There are 100 discarded screams to pick up - finding a certain percentage of them unlocks mini-game bonus levels. There are also 5 scream canisters to find and a small challenge involving scaring 5 mice within a time limit. If both are completed, clips from the movie are unlocked.</p>"},{"name":"Disney Pixar Monsters, Inc.: Scare Island","year":2002,"developer":"Artificial Mind & Movement","url":"sony_playstation2_d_part2/Disney-Pixar%20Monsters%2C%20Inc.%20-%20Scare%20Island%20%28Europe%2C%20Australia%29.zip","filesize":2585774267,"score":6.8,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>This is the action game based on the movie from Disney/Pixar, \"Monsters Inc.\". You play as either James P. \"Sulley\" Sullivan (the big hairy monster) or Mike Wazowski (the small green \"walking eye\"). The goal of the game is to become Masters of Scare. The first level is training, where you learn movement and how to scare someone. Scaring is done by standing in front of the person to be scared and pressing a combo of buttons (your playing figure will then perform really funny moves and sounds). To be scary enough, you need to collect monster slime - some persons can only be scared with a special amount of monster slime.</p><p>The game is presented in 3D graphics and all of the voices are from the movie.</p>"},{"name":"Disney Pixar Ratatouille","year":2007,"developer":"Asobo Studio S.A.R.L.","url":"ps2_collection_part6_202008/Disney-Pixar%20Ratatouille%20%28Europe%2C%20Australia%29.zip","filesize":833334293,"score":6.5,"genres":"Action > 3rd-person (Other) > Platform > Licensed","desc":"<p><em>Ratatouille</em> is based on the Pixar film of the same name. The version by Asobo Studio is, like other versions, a 3D platform game, but has its own design, levels and missions.</p><p>The game follows the plot of the film only loosely, but has the main voice cast from the movie reprising their roles. The player controls Remy, a rat with a refined sense of taste. When Remy finds himself in Paris near the restaurant of the famous deceased chef Gusteau, he works on making his dream of becoming a chef himself come true, while helping out his fellow rats to procure food.</p><p>While many of the environments in the game are similar to those in the next-generation version, this version has almost none of the open world elements seen in the other title, with smaller levels and mostly linear progress. To get around in the various levels that include the sewers, streets and rooftops of Paris, the restaurant kitchen and a food market, Remy can jump and double-jump, swing along poles, balance on ropes, crawl on certain walls and defend himself with tail swipes or by using spoons as weapons. He can also engage his keen sense of smell, which displays the path to the next goal or objective. Sometimes, Remy must evade guards by hiding out of sight until their attention wanes. Other sequences in the levels involve sliding down pipes, rafting through water currents and fleeing from humans that chase Remy. Another large part are mini-games, many of which involve cooking, with Remy having to pick ingredients or peel potatoes.</p><p>There are some optional bonus missions, taking the form of dream sequences, in which Remy navigates landscapes made of foodstuffs. All levels include many collectibles. In most levels there will be up to 100 stars to collect. Special items in certain levels include batteries, darts or lightbulbs. Collecting all of a certain kind of item in an area awards bonus points, which can be spent in Gusteau's shop to unlock bonuses, including various kinds of artwork as well as the possibility to play the mini-games outside the main game, in both single and multiplayer modes.</p>"},{"name":"Disney Pixar Toy Story 3","year":2010,"developer":"Asobo Studio S.A.R.L.","url":"ps2_collection_part6_202008/Disney-Pixar%20Toy%20Story%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":268622701,"score":"","genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>2 Great ways to play!<br><br>Story Mode: No toy gets left behind as you run, ride, and fly through favorite scenes from Disney∙Pixar’s Toy Story 3! Mini-Adventures: Battle the evil Zurg in all new Buzz Lightyear Adventures and help Sheriff Woody keep the Old West safe in exciting new Woody’s Roundup mini-games.</p>"},{"name":"Disney Pixar Up","year":2009,"developer":"Asobo Studio S.A.R.L.","url":"sony_playstation2_d_part1/Disney-Pixar%20Up%20%28USA%29%20%28En%2CFr%29.zip","filesize":916253681,"score":6.3,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p><em>Up</em> is based on the animated movie of the same name. Carl Fredericksen always wanted to be an adventurer but he never got around to it. After his wife dies he gets depressed but finally decides to experience adventures after all. He gets accompanied by the scout Russel.</p><p>Most levels are played with two characters with different abilities: Carl can use his walking aid as jumping help and crowbar while Russel balances on small ledges, catches insects or blinds enemies with his magnifying glass. Sometimes the dog Dug joins them who can pass through small holes and swim. The levels are basic platforming stages with many puzzles which need all these abilities to be solved. Of course this can be played in co-op too. Diversion is brought by a few flying levels with a biplane.</p><p>There are numerous differences to the Xbox 360/Playstation 3/Wii version. There are more levels, additional mini games like a raft trip where the player has to dodge crocodiles, the story is told with actual cutscenes from the movie and there are more unlockable extras, e.g. cheats. The two player characters gain additional gadgets during the game which can be used to reach new areas in already beaten levels. The multiplayer modes are also different: this version lacks the simultaneous flying duels for four players but two variants for two players and six other mini games which can be player as tournament for four players.</p>"},{"name":"Disney Pixar Wall-E","year":2008,"developer":"Asobo Studio S.A.R.L.","url":"ps2_collection_part6_202008/Disney-Pixar%20WALL-E%20%28Europe%29%20%28En%2CEs%2CPt%29.zip","filesize":1806044814,"score":6.7,"genres":"Action > 3rd-person (Other) > Puzzle elements > Flight / aviation > Sci-fi / futuristic > Licensed","desc":"<p>This game follows the Disney/Pixar movie of the same name. The player takes control of the main protagonist, Wall-E and his friend EVE. The gameplay of the game has Wall-E explore various levels through basic platforming ideas by picking up power-ups, defeating enemies by picking up objects and throwing them at enemies and solving puzzles to reach areas that are normally inaccessible to the player due to Wall-E's small stature and limitations.</p><p>The player can also control EVE in a series of flying stages where the player uses EVE to fly into constricted areas and avoid falling objects and stationary obstacles in the way of the player. While the game does feature environments from the movie, it also has added environments and characters made exclusively for the game.</p><p>This version does differ from its other version. This one does feature the same control setup, but has a different developer and has eighteen different worlds to play in while the other only has nine. Also, players can use music in this version to summon assistance during a level.</p>"},{"name":"Disney Princess: Enchanted Journey","year":2007,"developer":"Papaya Studio Corporation","url":"ps2_collection_part6_202008/Disney%20Princess%20-%20Enchanted%20Journey%20%28Europe%29%20%28En%2CDe%2CEs%29.zip","filesize":568243412,"score":"","genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>Players create their own custom character to explore the worlds of the Disney Princesses. Players travel to the castles of Ariel, Jasmine, Cinderella, and Snow White to use their wand to fight the evil Bog creatures which have invaded each of the princess' worlds. Players can defeat Zara, the evil ex-princess, alone or with a friend in a cooperative experience.</p><p>At the end of the game, the player has learned the virtues of a princess and becomes one themselves.</p>"},{"name":"Disney Sing It","year":2008,"developer":"Zoë Mode","url":"ps2_collection_part6_202008/Disney%20Sing%20It%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":2981679346,"score":"","genres":"Simulation > 3rd-person (Other) > Video backdrop > Music / rhythm > Licensed","desc":"<p>Belt out to your favorite songs and videos from the hottest Disney stars!</p><p>You and your friends can now belt out to some of your favorite songs from the coolest stars and shows - - sing to 35 chart-topping tunes including hits from Camp Rock, High School Musical, Hannah Montana, Cheetah Girls, as well as hits from Aly & AJ, Corbin Bleu, Everlife, Jordan Pruitt, and more.</p>"},{"name":"Disney Sing It: High School Musical 3 - Senior Year","year":2009,"developer":"Zoë Mode","url":"ps2_collection_part6_202008/Disney%20Sing%20It%20-%20High%20School%20Musical%203%20-%20Senior%20Year%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":2329083292,"score":7.2,"genres":"Simulation > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p><em>Disney Sing it: High School Musical 3 Senior Year</em> is a karaoke game similar to the SingStar games based on the <em>High School Musical</em> movie franchise. It includes song from the three movies, accompanied by video footage directly from the movies. The track list includes the following songs:</p><p>From <em>High School Musical</em>:* We're All In This Together</p><ul><li>Breaking Free</li><li>When There Was Me And You</li><li>Stick To The Status Quo</li><li>Bop to the Top</li><li>Get'cha Head In The Game</li><li>Start Of Something New</li></ul><p>From <em>High School Musical 2</em>:* All For One</p><ul><li>Everyday</li><li>Gotta Go My Own Way</li><li>I Don't Dance*</li><li>You Are The Music In Me</li><li>Work This Out*</li><li>Fabulous</li><li>What Time Is It</li></ul><p>From <em>High School Musical 3: Senior Year</em>:* High School Musical</p><ul><li>Walk Away</li><li>Scream (NA only)</li><li>The Boys Are Back</li><li>A Night To Remember</li><li>Just Wanna Be With You</li><li>Can I Have This Dance?</li><li>I Want It All</li><li>Right Here, Right Now*</li><li>Now Or Never*</li></ul><p>The songs with an asterisk (*) are only available in the North American version of the game.</p>"},{"name":"Disney Sing It: Pop Hits","year":2009,"developer":"Zoë Mode","url":"ps2_collection_part6_202008/Disney%20Sing%20It%20-%20Pop%20Hits%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":2471847670,"score":"","genres":"Simulation > Music / rhythm","desc":"<p>Take the Karaoke Challenge as You Rock to the Latest Hits and Videos</p>"},{"name":"Disney Think Fast","year":2008,"developer":"Magenta Software Ltd.","url":"ps2_collection_part6_202008/Disney%20Think%20Fast%20%28Europe%29.zip","filesize":1487852503,"score":7.1,"genres":"Simulation > 3rd-person (Other) > Game show / trivia / quiz > Licensed","desc":"<p>A game based upon the popular Buzz! series. The questions are now all Disney related and the host of the show is Genie from Aladdin.</p><p>Battle with up to 4 players against each other using the buzzers. Players can choose between a few different game modes. The game modes include a Quick start mode (play 5 rounds using basic settings), Basic game mode (players can now choose for how long they want to play, at what location they want to play, and can choose a sound that will be played when they hit the big red button on their buzzer), and a Custom game mode (players can select their favorite rounds).</p><p>Players can choose the length of their game. A short game hosts five rounds, an average game hosts seven rounds, and a long game hosts nine rounds. The playing time for a short game is around thirty minutes, while a long game takes up to one hour. Players can also adjust the difficulty by selecting how much knowledge they have of Disney movies.</p><p>Players can even unlock bonus items. When playing a multiplayer game, the winner unlocks unique accessories for their character. There are also three hidden Disney figures that can only be unlocked when the player scores 10.000, 20.000 or 30.000 points in the single player mode.</p>"},{"name":"Disney's Chicken Little","year":2005,"developer":"Avalanche Software LLC","url":"ps2_collection_part6_202008/Disney%27s%20Chicken%20Little%20%28Europe%29.zip","filesize":1564104772,"score":6.5,"genres":"Action > 3rd-person (Other) > Arcade > Puzzle elements > Licensed","desc":"<p>Based on Disney's film, take part in Chicken Little's adventure as he and his friends, the Misfits, tries to save the world.</p><p>The game begins with Chicken Little missing his school bus and it's up to you to help him get to school. There are a total of 24 levels and you must complete a set of objectives in each one before being able to advance to the next. </p><p>By collecting Buck Cluck Trading Cards in each game level, you can purchase Minigames at the Minigame Store to play with a friend.</p>"},{"name":"Disney's Chicken Little: Ace in Action","year":2006,"developer":"Avalanche Software LLC","url":"ps2_collection_part6_202008/Disney%27s%20Chicken%20Little%20-%20Ace%20in%20Action%20%28Europe%29.zip","filesize":2339672159,"score":7,"genres":"Action > Behind view > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Ace in Action</em> is based off the superhero movie within the movie <em>Disney's Chicken Little</em>. <em>Ace in Action</em> features Ace, Abby, Runt, and Mr Fish, as they fight against Foxy Loxy, Goosey Loosey and their minions.</p><p><em>Ace in Action</em> is a third-person shooter. Battle your way across four worlds, (Pluto, Saturn, Mars, and the Moon) with multiple missions on each planet. Each mission is performed by one of the three main characters: Ace's missions have him running around, Runt's missions have him in a tank, and Abby's missions have her in a hovership. Each character has a main weapon with unlimited ammo, and a secondary weapon with limited ammo. By collecting items, destroying scenery, and completing challenges such as completing the mission fast enough, and finding all bonus objects, the player can collect acorns, which are used as a currency. Between missions, they can be used to buy upgrades for each character, and unlock multiplayer games, concept art and music. Missions can be replayed to get more acorns.</p>"},{"name":"Disney's Dinosaur","year":2001,"developer":"Ubi Soft Entertainment Inc.","url":"ps2_collection_part6_202008/Disney%27s%20Dinosaur%20%28Europe%29%20%28En%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":1507887632,"score":5.5,"genres":"Action > 3rd-person (Other) > Top-down > Puzzle elements > Licensed","desc":"<p><em>Disney's Dinosaur</em> is a puzzle-adventure game based on the movie of the same name. You control three characters: Flia the pteradon, Aladar the Iguanadon and Zini the lemur, each of whom has different abilities. Flia can fly, Aladar can wade through water and crush rocks and Zini can fit through small spaces and pick things up. The game is seen from a top-down perspective, with the player switching characters on the fly. As in the movie, they must work together to reach the sacred nesting grounds for water and food after the rest of world dries up.</p><p>Throughout the game, the characters' abilities are upgraded via an Intelligent Points System in an RPG-like addition. There are twelve levels divided into four acts.</p><p>The game includes FMV clips from the movie and a dinosaur encyclopedia with information about real dinosaurs.</p>"},{"name":"Disney's Donald Duck: Goin' Quackers","year":2000,"developer":"Ubi Soft Entertainment Inc.","url":"sony_playstation2_d_part1/Disney%27s%20Donald%20Duck%20-%20Goin%27%20Quackers%20%28USA%29.zip","filesize":616362735,"score":6.9,"genres":"Action > 3rd-person (Other) > Behind view > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The evil wizard Merlock has kidnapped intrepid reporter Daisy Duck. Donald Duck wants to rescue her, and his friend Gyro Gearloose's latest invention, a teleporter, can help. Unfortunately, it can't reach Daisy directly due to a lack of power. To increase the energy, Donald must place weather vanes that catch gamma rays at the world's highest summits: the peak of Duckie Mountain, the Beagle Tower in Duckburg, and the flying mansion of Magica De Spell. Only then can the teleporter reach Merlock's temple so Donald can free Daisy.</p><p><em>Donald Duck: Goin' Quackers</em> on the PlayStation 2 and GameCube follows the same story, general gameplay style and level themes as the versions on other platforms, but features unique level designs, enemies and gameplay mechanics.</p><p>The game is a platformer employing 3D graphics, offering three different styles of level in a manner similar to games in the Crash Bandicoot series: the camera is either placed behind Donald as he runs forward, at his side (emulating classical side-scrolling platform gameplay) or in front of him in levels where he is chased by a giant hand and must run towards the screen.</p><p>Each level must be completed within a time limit. There are many holes and gorges Donald must jump over, traps to avoid, as well as enemies he can dispatch by hitting or jumping on top of them. Picking up 100 golden gears gains Donald an extra life while collecting five within a second or less spells out one letter of the word SPECIAL. Once the word is completed and the level finished, Donald's nephews will teach him a special move. These moves make him invincible for a short time and result in the gears being worth more when picked up. To activate a move, Donald must jump on three enemies in a row without touching the ground, then pressing the activation button to begin entering a unique button combination within three seconds.</p><p>When Donald is hit by an enemy or hurt by a trap, he gets in a grumpy mood (indicated by his trademark quacking) and the next hit means the loss of a life. Picking up a milkshake will restore his good mood and health, however. Should he find a glass of orange juice, he becomes Hyper Donald for a short time, allowing him to run over enemies and crash through walls to find hidden areas. Stashed away there (but also sometimes in plain sight) are golden threads. Picking up all three per level unlocks bonus costumes that Donald can change into in Gyro's lab.</p><p>Each of the four worlds features three or four levels, plus a training stage and a boss fight. The boss fights follow the classic template of each boss repeating an attack pattern that must be avoided, as well as a single weakness that can be exploited to finish them off.</p>"},{"name":"Disney's Extreme Skate Adventure","year":2003,"developer":"Toys for Bob Inc.","url":"ps2_collection_part6_202008/Disney%27s%20Extreme%20Skate%20Adventure%20%28Europe%29.zip","filesize":1992592043,"score":7.6,"genres":"Sports > 3rd-person (Other) > Skateboarding > Licensed","desc":"<p>Skateboard your way through the worlds of Toy Story, Tarzan, and The Lion King each including a variety of different levels and locals to visit. Play as characters from those universes or create your own from scratch. Each included character has their own look, board, moves, and collectible. Practice Modes and Freeskate moves provide the opportunity to try things out safely and freely and there are several \"pro moves\" and level-specific moves that can be done.</p><p>The game is 3D with a 3rd person perspective (usually behind the player) that uses the game engine from Tony Hawk's Pro Skater 4 and features a custom soundtrack with current bands.</p>"},{"name":"Disney's Kim Possible: What's the Switch?","year":2006,"developer":"Artificial Mind & Movement","url":"ps2_collection_part6_202008/Disney%27s%20Kim%20Possible%20-%20What%27s%20the%20Switch%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":442947422,"score":6.8,"genres":"Action > 3rd-person (Other) > Side view > Platform > Puzzle elements > Detective / mystery > Spy / espionage > Licensed","desc":"<p>When intercepting Drakken and Shego's latest plan to swipe a mystical monkey idol from a spooky mansion, Dr. Drakken and Ron Stoppable get their minds switched! The idol is quickly lost, and Kim Possible and her arch-rival Shego reluctantly team up to get it back and set things back to normal.</p><p><em>Kim Possible: What's the Switch?</em> is a side-scrolling 2D platformer with visual similarities to Klonoa 2, excluding the ability to change the paths you take. The camera follows Kim (or Shego) as you progress through various levels - while it plays like a 2D platformer, it gives the illusion of 3D. The main goal of each level is to get to the end of the level; however, there are also sub-goals of collecting all the Kimmunicator tokens within a level (which unlock concept art amongst other things), and collecting the Club Banana tokens hidden in secret spots (which unlock new outfits to wear).</p><p>Shego and Kim control quite similarly, in that they can both perform kung-fu attacks, backflips and double jumps. Later on, they both gain the ability to use a grapple and EMP bomb to disable special enemies. In addition to this, Kim has super sticky gum which can be used to snag enemies and control switches remotely, while Shego gains a magnetic power to move metal objects from far away.</p>"},{"name":"Disney's Peter Pan: The Legend of Never Land","year":2005,"developer":"Blue52 Games Limited","url":"ps2_collection_part6_202008/Disney%27s%20Peter%20Pan%20-%20The%20Legend%20of%20Never%20Land%20%28Europe%29%20%28En%2CEs%29.zip","filesize":1449169691,"score":"","genres":"Action > Platform > Fantasy > Licensed","desc":"<p>In Peter Pan: Adventure in Neverland swashbuckle your way through hoardes of pirates and evil enemies. Free your kidnapped friends and find the hidden pixie dust. Track down Captain Hook in a final duel to decide the fate of Never Land itself.</p>"},{"name":"Disney's PK: Out of the Shadows","year":2002,"developer":"Ubi Soft SARL","url":"sony_playstation2_d_part1/Disney%27s%20PK%20-%20Out%20of%20the%20Shadows%20%28USA%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":508811151,"score":6,"genres":"Action > 3rd-person (Other) > Sci-fi / futuristic > Licensed","desc":"<p>Donald Duck was minding his business one day at his boring security guard job when the evil Evronian empire decided to attack Earth. A computer being known as One detected the invasion early and teams up with Donald to turn him into the superhero PK. Now it is PK's job to repel the alien invasion.</p><p>The PK character may be unfamiliar to American audiences, but he is popular in Italy (and some other parts of Europe) through a series of comic books.  This game is a simple 3rd person action shooter game.  You control PK as he targets Evronian soldiers with his blasters, jumps through colorful environments, and rescues captured scientists.</p>"},{"name":"Disney's Stitch: Experiment 626","year":2002,"developer":"High Voltage Software, Inc.","url":"ps2_collection_part6_202008/Disney%27s%20Stitch%20-%20Experiment%20626%20%28Europe%29%20%28En%2CSv%29.zip","filesize":2671563271,"score":6.4,"genres":"Action > Behind view > Shooter > Licensed","desc":"<p>Stitch Experiment 626 is a prequel to Disney's animation, Lilo &amp; Stitch. Stitch is trying to escape his home planet by scaling walls, grappling across dark ooze, and using his jetpack.</p>"},{"name":"Disney's Tarzan Untamed","year":2001,"developer":"Ubi Soft Entertainment Inc.","url":"ps2_collection_part6_202008/Disney%27s%20Tarzan%20-%20Freeride%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":947625392,"score":6.7,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>When an evil scientist, Oswald Gardner, comes to the jungle and imprisons all of the baby apes, Tarzan must rescue all of the baby apes and destroy Gardner's 75 film reels. There are 15 levels of exploration that involve vine-swinging, bungee jumping, surfing, and wrestling.</p><p>Story mode challenges you to conquer the 15 levels in order to rescue the baby apes while Terk's Challenge mode is a race against the clock. Terk, Tarzan, Jane, Tantor, and Professor Porter are all included in the game as well.</p>"},{"name":"Disney's The Haunted Mansion","year":2003,"developer":"High Voltage Software, Inc.","url":"sony_playstation2_d_part2/Disney%27s%20The%20Haunted%20Mansion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":744697520,"score":7.2,"genres":"Action > 3rd-person (Other) > Puzzle elements > Industrial Age > North America > Detective / mystery > Horror > Licensed","desc":"<p>In <em>Disney's The Haunted Mansion</em>, an action game based on a combination of the popular Disneyland attraction and the 2003 movie of the same name, players guide Zeke Holloway through the house of 999 happy haunts in order to solve a mystery, put the spirits to rest, and get out of the house alive. They are allowed full roam of the mansion, once they collect enough Shriveled Souls inside their Beacon of Souls, a special lantern designed to collect the various lesser ghosts throughout the rooms.</p><p>Though Zeke handles his quest alone, he is aided by Madame Leota and six friendly ghosts, who will provide hints and items throughout the journey. As Zeke solves puzzles, completes various tasks, and helps to rid the house of its evil spirits, these spiritual companions will provide Soul Gems, which amplifies the power of the Soul Beacon. Once fully charged, Zeke will have the ability to face the main spirit, Atticus Thorn, for the final showdown.</p>"},{"name":"Disney's Treasure Planet","year":2002,"developer":"Bizarre Creations, Ltd.","url":"ps2_collection_part6_202008/Disney%27s%20Treasure%20Planet%20%28Europe%29%20%28En%2CEs%2CIt%2CSv%2CDa%29.zip","filesize":1668924053,"score":6.4,"genres":"Action > Behind view > Puzzle elements > Steampunk > Licensed","desc":"<p><em>Disney's Treasure Planet</em> is a 3D action game based on the animated Disney movie of the same name. The game follows the adventures of Jim Hawkins, a young boy on a quest to locate a mythical planet called Treasure Planet. To find the planet he needs to travel to many locations throughout the universe and complete tasks before he finds the ultimate prize. The tasks range from finding a certain number of items to catching runaway animals to flipping a series of switches. Completing the tasks lights a beacon, and when a set number of these beacons are lit, the next level is then available. </p><p>Jim is also able to ask for help from his \"pet,\" Morph, to get him past areas that pose a challenge. Morph can change his shape into a helpful item like giant robotic arms or a jetpack. Another adaptation from the movie is solar surfing. During the surfing missions Jim pilots a futuristic surfboard to complete the mission objectives.</p><p>For the PlayStation, a different 3D game was released. The Game Boy Advance also received a different 2D game.</p>"},{"name":"Disney's Winnie the Pooh's Rumbly Tumbly Adventure","year":2005,"developer":"Phoenix Studio","url":"ps2_collection_part6_202008/Disney%27s%20Winnie%20the%20Pooh%27s%20Rumbly%20Tumbly%20Adventure%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1526171843,"score":6.4,"genres":"Adventure > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p>While taking a walk with his friend Christopher Robin, Pooh's tummy gave out a great rumble. Looks like Pooh's hungry. Christopher suggests that he think of something else...something happy to forget about his hunger. Pooh decides to recall his friends' birthdays - which are the happiest of times.</p><p>In <em>Winnie the Pooh's Rumbly Tumbly Adventure</em>, join Pooh and his friends in Hundred Acre Woods on three different types of games:</p><p><strong>Birthday Scrapbook Adventure Mode</strong>: Pooh flips through his birthday scrapbook and re-live 5 different birthday adventures. Each adventure consists of tasks and problems Pooh has to help solve in order to ensure his friends have the best birthday ever. </p><p>Pooh can interact with many different elements around him. For example, if there's a box blocking his way, have Pooh push it away. Gopher is always nearby to pop up and give Pooh tips on what he has to do and how to do it. Pooh will also have to talk to other characters to complete his tasks. For example, in Piglet's Birthday, you will have to find Kenga and borrow her broom for Piglet. Some tasks will require the help of Pooh's friends. For instance, you will have to help Roo collect butterflies for Piglet's birthday by climbing on Eeyore's back and running after the butterflies.</p><p>Every now and then Pooh will be confronted by Heffalumps and Woozles. Avoid being touched by them because that will cause you to have to start that segment all over. The only way to get rid of them is by popping a balloon...but don't worry, there is always one nearby.</p><p><strong>Junior Mode</strong>: a place for younger players to interactive with Pooh and his friends in Hundred Acre Woods. See what happens when Pooh approaches a hive or play as Tigger as he spins around.</p><p><strong>Multiplayer Mini-Game</strong>:Play as Pooh, Roo, Tigger or Piglet in 6 mini-games on your own or with a friend!:</p><p><em>Cookie Maze</em> - Grab as many cookies as possible while avoiding the Heffalumps and Woozles.</p><p><em>Catching the Honey Pot</em> - Try to catch as many honey pots as possible before time runs out.</p><p><em>Find the Cookies</em> - Look around and find the hidden cookies. You will have to find a required number of cookies before time runs out!</p><p><em>The Scare-Off</em> - Play as Pooh or Piglet and try to make a scary face that will scare the other by pressing the correct button shown on the screen.</p><p><em>Follow the Line</em> - Trace the line around a path without getting out of the line as quickly as possible before time runs out.</p>"},{"name":"DJ Hero","year":2009,"developer":"FreeStyleGames Ltd.","url":"ps2_collection_part7/DJ%20Hero%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2701608702,"score":8.3,"genres":"Action > Simulation > 3rd-person (Other) > Cinematic camera > Real-time > Music / rhythm","desc":"<p><em>DJ Hero</em> is in the same vein as the Guitar Hero series, with the guitar replaced with a DJ's turntable, and the rock music replaced by dance music.</p><p>Gameplay involves 'scratching' your faux-turntable to produce notes in time to the music. The better you do, the more points you score, but if you do too badly you will fail the song and fail to progress.</p><p><em>DJ Hero</em> features more than 100 tracks from artists such as The Black Eyed Peas, DJ AM, Eminem and Daft Punk.</p>"},{"name":"DJ: Decks & FX House Edition","year":2004,"developer":"Relentless Software Ltd","url":"ps2_collection_part7/DJ%20-%20Decks%20%26%20FX%20-%20House%20Edition%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CNo%2CDa%29.zip","filesize":1897291756,"score":6.2,"genres":"Simulation > 1st-person > Music / rhythm","desc":"<p>Use your PlayStation 2 to mix House records. The game gives you two decks, mixer, sampler, effects unit and loops unit and lets you loose on 70 tunes from the likes of Masters at Work, Dimitri from Paris, Shapeshifters, DJ Gregory, Francios K.</p><p>This really isn't a game in the traditional sense as there are no highscores to beat. It's purely about being creative and creating a mix which your audience will enjoy. Play in one of two live modes or record your mix to memory card.</p>"},{"name":"DNA: Dark Native Apostle","year":2001,"developer":"Hudson Soft Company, Ltd.","url":"ps2_collection_part7/DNA%20-%20Dark%20Native%20Apostle%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":539876034,"score":"","genres":"Action > Puzzle > 3rd-person (Other) > Direct control > Sci-fi / futuristic","desc":"<p><em>DNA: Dark Native Apostle</em> is a single player science fiction themed action puzzle game in which you take control of B13, a human who is genetically modified. The game starts with the player trying to escape the testing facility in which he is held.</p><p>Gameplay includes fighting off enemies by placing bombs on the floor that will explode with a slide delay. During play the player can find Bio chips that can increase speed and power of the bombs. Puzzle include finding objects and inserting them so you can move on, finding switches that open doors or moving crates to reach certain areas. Aside from the normal enemies there are also bosses. HP can be recovered by picking up health or regenerating it at a save points.</p>"},{"name":"Document of Metal Gear Solid 2, The","year":2002,"developer":"Konami Corporation","url":"ps2_collection_part7/Document%20of%20Metal%20Gear%20Solid%202%2C%20The%20%28Europe%29.zip","filesize":3521018887,"score":7.6,"genres":"Action > Educational > Graphics / art","desc":"<p><em>The Document of Metal Gear Solid 2</em> is a \"making-of\" documentary of Metal Gear Solid 2 for the PS2. An interactive program and not just a DVD, every little detail that went into the process of creating the game is covered, including many details and aspects of the game that were never before revealed. </p><p>Also on the disc is a playable sneak peek of the new VR Training missions that will be on Metal Gear Solid 2: Substance.</p>"},{"name":"Dodgeball","year":2004,"developer":"Access co., ltd.","url":"ps2_collection_part7/Dodgeball%20%28Europe%29.zip","filesize":44708284,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Dodgeball","desc":"<p><em>Dodgeball</em> is a team dodgeball game. First team to get the other team out is the winner, be it through the one-shot system or a \"life system\" where the object is to lower the opposition's players health to zero. If both teams are still in by the end of the game, the team with the most players wins the game. If teams have an equal amount of players left then the team with the least damage taken wins. If equal damage has been taken by either team then the game ends in a tie.</p><p>Play as one of six teams who each represent a certain country, spearheaded by a figure from history or national folklore - Japan (Nobunaga), Germany (Bach), Greece (Pythagoras), Norway (King Harald I), Great Britain (King Arthur) and the United States of America (Wyatt Earp). There are three other teams to unlock as the game progresses.</p><p>Either play through the single-player World Tournament to become Dodgeball World Champion, play against a friend in a Team Battle, or team up with up to three friends for a Multi-Player Battle against the computer.</p>"},{"name":"Dodonpachi Dai-Ou-Jou","year":2003,"developer":"CAVE Interactive Co., Ltd.","url":"sony_playstation2_d_part2/DoDonPachi%20Dai-Ou-Jou%20%28Japan%29.zip","filesize":1530599996,"score":7.6,"genres":"Action > Top-down > Arcade > Shooter","desc":"<p>A PS2 port of the fourth installment of the Donpachi series, originally developed by Cave. It follows the same pattern as its predecessors: a manic-style 2D vertical shooter with millions of bullets to dodge and up to six machine/pilot combinations.</p><p>The most notable features of the PS2 version are: a \"simulation mode\" where you can adjust all the parameters of the game, the possibility of recording game replays, and the \"Death Label\" mode, where you must fight insanely overpowered versions of all the bosses in the game.</p>"},{"name":"Dog Island, The","year":2007,"developer":"Yuke's Co. Ltd."},{"name":"Dog of Bay","year":2000,"developer":"Tamsoft Corporation"},{"name":"Dog's Life","year":2003,"developer":"Frontier Developments Ltd.","url":"sony_playstation2_d_part2/Dog%27s%20Life%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":1804188947,"score":6.5,"genres":"Action > Adventure > 1st-person > 3rd-person (Other)","desc":"<p>In <em>Dog's Life</em> you play Jake the puppy, as he explores the USA in an attempt to foil a fiendish plot. Miss Peaches doesn't like dogs, and sees them as a way of making money, by dog-napping Daisy the pedigree dog.</p><p>The dog elements are closely integrated into the game - smells are indicated by lines of coloured smoke, emphasising a dog's acute sense of smell. Locating footprints is also done via this Smellovision mode. Tricks can be learnt, and used to win treats from humans.</p><p>Jake must explore vast environments and interact with 15 breeds of dog. The aim is to get them onto his side, which is usually done by either having more bones than them, or winning a subgame against them. These are also dog-based - in one you must dig up bones, while another has you 'marking territory' to annex a full screen.</p>"},{"name":"Dokapon Kingdom","year":2007,"developer":"Sting, Inc.","url":"sony_playstation2_d_part2/Dokapon%20Kingdom%20%28USA%29.zip","filesize":299963483,"score":7.1,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Turn-based > Board game","desc":"<p>In <em>Dokapon Kingdom</em> monsters have attacked and pillaged the kingdom of its riches. For the adventurer who returns the kingdom's wealth, his majesty offers the honor of his daughter's hand, and therefore the title of future king. This doesn't mean, however, that you aren't permitted to play as a female character. You simply receive an altered ending in this instance.</p><p>Three different modes are available: Story Mode, Normal Mode, and Shopping Race. You then create your character and begin play, the mode you choose having an affect on the overall goal to be achieved. The Story Mode is the standard play through of the plot, Normal Mode lets you generate certain factors of play ahead of time, like starting level, and go from there, etc. There are 3 started classes (warrior, chief and magician) and through levelling eventually 11 become available.</p><p>While having a board game scenario with a spinner that allows the player to move over a game board, this is very much a <em>light</em> role-playing game as it has basic jobs, a battle system, and upgrades. Landing on a spot can trigger a battle, advance the story or introduce a mini-game. It is a 2-player game at all times (with another character controlled by the computer), but up to 4 people can participate.</p>"},{"name":"Doko e Iku no, Ano Hi: Hikaru Ashita e (Shokai Genteiban)","year":2005,"developer":"","url":"sony_playstation2_d_part2/Doko%20e%20Iku%20no%20Anohi%20-%20Hikaru%20Ashita%20e...%20%28Japan%29.zip","filesize":1255093431,"score":"","genres":"Special edition > Physical extras","desc":"<p>This special edition release includes</p><ul><li>Doko e Iku no, Ano Hi: Hikaru Ashita e game</li><li>Audio drama CD</li><li>Bonus booklet with making-of materials and interviews</li></ul>"},{"name":"Don 2: The Game","year":2013,"developer":"GameShastra Solutions Pvt Ltd","url":"ps2_collection_part7/Don%202%20-%20The%20Game%20%28India%29.zip","filesize":1282953636,"score":"","genres":"Action > Behind view > Shooter > Direct control > Europe > Crime > Licensed","desc":"<p>Don rules the Asian underworld; but now the crime boss craves European domination. With trigger-happy gangs and ruthless cops hunting his every step, Don must become a moving target as he takes out his enemies to cash in on his money-laden schemes.</p>"},{"name":"Donkey Xote","year":2008,"developer":"Revistronic","url":"ps2_collection_part7/Donkey%20Xote%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2716396680,"score":"","genres":"Action > 3rd-person (Other) > Platform > Licensed","desc":"<p><em>Donkey Xote</em> is a tie-in game for the animated movie Donkey Xote. It tells the adventures of Don Quixote as seen from his donkey. The story is told through cutscenes from the film.</p><p>Donkey Xote is a 3D platform game, and resembles similar 3D platform games such as Spyro The Dragon. The player can jump to reach platforms and often has to collect items such as coins.</p><p>During the game the player can switch between playing Rucio (the donkey), Don Quixote himself and Sanco Pancha, Don Quixotes sidekick.</p>"},{"name":"Doomsday Racers","year":2005,"developer":"Mere Mortals Ltd.","url":"ps2_collection_part7/Doomsday%20Racers%20%28Europe%29.zip","filesize":76274359,"score":"","genres":"Racing / Driving > 3rd-person (Other) > Post-apocalyptic","desc":"<p><em>Doomsday Racers</em> is a single player, keyboard controlled racing game though a joystick is also supported. </p><p>The game is set in a post apocalyptic world. It's quite a simple game as the cars take no damage, there are no gears, and if the player gets stuck behind an obstacle they must press SPACE to reposition the car on the track.<br>There are three race modes; Tournament, Quick Race and Time Trial.The races are run around two courses, Red Desert and Space Dome. For the Quick Race and the Time trial these courses are divided into stages with only the first few stages of Red Desert being available, other stages are unlocked as the player progresses through the tournament mode.<br>The tournament mode starts with the player racing in the Neutron league, success there allows the player to race in the Gamma league which in turn leads to the Galactic league. All tournaments are over four races and take place on sections from either of the two courses.</p><p>There is a variety of cars to choose from Warrior, Enforcer, MODGT, Raider, Fusion, and Evo which are available at the start of the game plus Interceptor and Xtreme and a mystery vehicle which are unlocked by winning tournaments. Apart from colour the vehicle all have the same performance.</p>"},{"name":"Dora the Explorer: Dora Saves the Crystal Kingdom","year":2009,"developer":"High Voltage Software, Inc."},{"name":"Dora the Explorer: Dora Saves the Mermaids","year":2008,"developer":"Totally Games, Inc."},{"name":"Dora the Explorer: Dora Saves the Snow Princess","year":2008,"developer":"High Voltage Software, Inc.","url":"ps2_collection_part7/Dora%20the%20Explorer%20-%20Dora%20Saves%20the%20Snow%20Princess%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CNl%29.zip","filesize":1500173838,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > Licensed","desc":"<p>A simple, easy to pick up and play, platform-based game aimed at pre-school children age 2-5, Dora Saves the Snow Princess makes good use of the intuitive Wii Remote. Within minutes your child will be building snowmen, ice skating, snowboarding, riding Pegasus, as well as enjoying a slew of other winter-themed activities. And with the game's 'Snowy Forest Helper' feature, parents can join in the fun as their child learns the importance of helping those in need and the value of friends.<br><br>* Over 12 Unique Wii Remote motions – build a snowman, steer a dogsled, paddle a canoe, ride a Pegasus and more.<br>* Authentic character voice of Dora and other characters from the Dora the Explorer TV show.<br>* Grown-ups can join in using the Snowy Forrest Helper Feature and a second controller.<br>* Make your way through the Winter Forest, Icy Coast and Frozen Mountains to reach the Castle Grounds and save the Snow Princess.<br>* Ice skate, snowboard and ski your way to find the magic crystal.<br>* Kid-Tested approval by children and moms for age-appropriateness, fun-factor and quality.</p>"},{"name":"Dora the Explorer: Dora's Big Birthday Adventure","year":2010,"developer":"High Voltage Software, Inc."},{"name":"Dora the Explorer: Journey to the Purple Planet","year":2005,"developer":"Monkey Bar Games"},{"name":"Double Reaction! Plus","year":2004,"developer":"Datam Polystar","url":"sony_playstation2_d_part2/Double%20Reaction%21%20Plus%20%28Japan%29.zip","filesize":1923262559,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Double Reaction! PLUS</em> for PlayStation 2 is an otome visual novel, and a port of the PC version called Double Reaction. However, the PS2 version has the hentai content removed, but adds more CG events and play modes not included in the PC version.</p><p>The story is overall the same, though. The female protagonist, Yuri, is jealous of her good looking twin brother, Kairi. One day she comes to a wishing stone and picks it up wishing she is good looking and sexy, but drops the stone and breaks it in pieces. A couple of weeks later, she wakes up one day realizing she doe no longer have her body. Something happened and made her and her brother switch the bodies. Now she has to go to school pretending she was her brother and vice versa until whatever enchantment was placed upon them wears off or they figure out how to lift it.</p>"},{"name":"Double Wish (Shokai Genteiban)","year":2004,"developer":"","url":"sony_playstation2_d_part2/Double%20Wish%20%28Japan%29%20%28Shokai%20Genteiban%29.zip","filesize":1587886389,"score":"","genres":"Special edition > Physical extras","desc":"<p>This First Print Limited Edition release comes in a cardboard slipcase which contains:</p><ul><li>Double Wish game</li><li>Secret Book hardcover bonus booklet</li></ul><p>Secret Book contains 20 pages of character sketches and artwork, and 10 colored postcards embedded as pages of the book.</p>"},{"name":"Downforce","year":2002,"developer":"Smart Dog","url":"ps2_collection_part7/Downforce%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":490724302,"score":7.3,"genres":"Racing / Driving > Behind view > Arcade > Track racing","desc":"<p><em>Downforce</em> is an arcade racing game released in 2002. The game includes multiple game modes, including championships, time trials, free race, standard split-screen and multiplayer tag - a mode where the winner is decided by who stays in the lead for the most amount of time rather than who crosses the finish line first.</p>"},{"name":"Downhill Domination","year":2003,"developer":"Incog Inc. Entertainment","url":"ps2_collection_part7/Downhill%20Domination%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2421295930,"score":7.5,"genres":"Racing / Driving > Sports > 3rd-person (Other) > Tricks / stunts > Bike / bicycling","desc":"<p><em>Downhill Domination</em> is a racing game where the player rides a bike and tries to win downhill races. This means that the player constantly moves downwards while avoiding obstacles and - if he is in range - hit an opponent to hinder his progress. The main objective is of course to be the first one to cross the finishing line but prize money is also rewarded for stunts - opportunities for them are plentiful on the 27 courses. An important point about them is that they are branching, meaning they feature multiple paths and shortcuts.</p><p>Cash is used to improve the athlete's abilities, e.g. new combat moves, or to buy better equipment and bikes. Besides the career mode there are also multiple additional playing modes, e.g. training, multiplayer, freeride, time trials or BMX Cross with special challenges. The athletes, bikes and upgrades are licensed.</p>"},{"name":"Downhill Slalom","year":2006,"developer":"Mere Mortals Ltd.","url":"ps2_collection_part7/Downhill%20Slalom%20%28Europe%29.zip","filesize":73794013,"score":"","genres":"Sports > Behind view > Snowboarding / skiing","desc":"<p><em>Downhill Slalom</em> is a single-player skiing game from Tuna Technologies which is very similar to their snowboarding game Snow Rider. It was originally released on the PlayStation 2 platform but in 2006 the developers signed a deal to bring the title to the PC where it was published by Phoenix Games both as a standalone title and in the Ultimate Gamers 10 Pack compilation and others.</p><p>The game is keyboard controlled by default but a joystick is also supported. The player can play as one of five characters, three of which are locked at the start of the game. There are three game modes:* Slalom: here the player must complete a course as quickly as possible and correctly navigate all the gates on the way down, missing five gates means disqualification.</p><ul><li><p>Token Dash: in this game mode the player must collect coins as they race downhill. This is more of an arcade mode than the other two as there are power-ups, speed boosts, coin magnets, extra grip etc. to be collected.</p></li><li><p>Sprint: this is a straight race to the bottom, no gates, no coins, no power-ups.</p></li></ul><p>The player starts the game ranked as 'Beginner' and progresses to 'Champ' in each game mode by winning gold medals, When they are champion in all three game modes they are awarded the title of Resort Champion. In all three game modes the player has access to just one course, Whiteout Glacier, other courses and competitors are unlocked if the player finishes in the top three but only for the game mode in which the player medalled.</p>"},{"name":"Dr. Dolittle","year":2006,"developer":"Aqua Pacific Ltd.","url":"ps2_collection_part7/Dr.%20Dolittle%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":47502664,"score":"","genres":"Action > Diagonal-down > Isometric > Real-time > Managerial / business simulation > Healthcare > Licensed","desc":"<p>The game <em>Dr. Dolittle</em> is just loosely based on the well known <em>Twentieth Century Fox Film Corporation</em> movie. Surprisingly, the game has some obvious similarities to another title of developer <em>Aqua Pacific</em>: Chemist Tycoon.In this vet adventure, emergency calls concerning sick animals come in via cell phone. The protagonist is running through this city called Spa Town and, just like in the movie, has to talk to these animals to find out more about their illnesses. In order to cure them the player has to collect items and ingredients to make medicine. Selling the medicine via a store has to be managed as well.</p>"},{"name":"Dr. Muto","year":2002,"developer":"Midway Games West, Inc.","url":"ps2_collection_part7/Dr.%20Muto%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2521087145,"score":7.2,"genres":"Action > Behind view > Platform > Sci-fi / futuristic > Comedy","desc":"<p>Burnital Industries is causing an energy crisis on Planet Midway. In a desperate attempt to rectify the situation the mayor reluctantly asks the mad scientist, Dr. Muto, to use his Genitor 9000 machine. However, the machine winds up destroying the majority of Planet Midway. In order to restore the planet, Muto must go out searching for isotopes, Terra, and pieces of the Genitor 9000 that got scattered on the four planets that Burnital Industries owns.</p><p>Gameplay involves collecting the aforementioned items. While the isotopes can be found all over, the Terra pieces are collected by completing challenges. andthe Genitor pieces are earned by defeating a planet's boss. Each planet also holds seven scrap parts for Muto to find. Collecting the scraps will give Muto a new gadget to use such as rocket boots or an invisibility suit.</p><p>While Dr. Muto can jump and zap enemies, he is also able to morph into several different creatures by using his Splizz Gun. Muto can morph into a mouse, spider, gorilla, fish, or a pterodactyl. This is necessary as the creatures have unique abilities such as the mouse being able to fit into tight spaces and the pterodactyl having the ability to fly.</p>"},{"name":"Dr. Seuss' The Cat in the Hat","year":2003,"developer":"Magenta Software Ltd.","url":"sony_playstation2_d_part2/Dr.%20Seuss%27%20The%20Cat%20in%20the%20Hat%20%28USA%29.zip","filesize":616043930,"score":6,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>Based on Dr Seuss's Cat in the Hat movie, you play as thecheeky cat. There are all the original characters including,Conrad, Sally, and Mr. Quinn who tricked Conrad, and Sallyinto opening the box the Cat was in, as he was released intothe outside world. The Cat must help Conrad and Sally to return the magic to the box the cat came in, and get all three pieces of the \"Crab Lock\" in order to lock the box for good. The game allows you to see rooms that where not included in the movie.</p>"},{"name":"Drag & Stock Racer","year":2006,"developer":"Brain in a Jar Ltd."},{"name":"Drag Racer USA","year":2007,"developer":"Mere Mortals Ltd.","url":"ps2_collection_part7/Drag%20Racer%20USA%20%28Europe%29.zip","filesize":169924993,"score":"","genres":"Racing / Driving > Behind view > Arcade > Automobile > Street racing","desc":"<p>Instead of offering real drag racing experience <em>Drag Racer USA</em> simply is an arcade style 3D racing game. The tracks are supposed to be located in well known cities and also close to famous tourist attractions of the U.S., although regional characteristics can hardly be recognized. Players can choose the single player mode or a race against a friend. The single player mode offers a quick race, a practice mode and the championship where new tracks can be unlocked. In addition, in the garage cars can be upgraded or pimped individually.</p>"},{"name":"Dragon Ball Z Trilogy","year":2008,"developer":""},{"name":"Dragon Ball Z: Budokai","year":2002,"developer":"Dimps Corporation","url":"sony_playstation2_d_part2/Dragon%20Ball%20Z%20-%20Budokai%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1971653069,"score":7,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Fighting > Martial arts > Licensed","desc":"<p><em>Budokai</em> is based on the TV action animated series <em>Dragonball Z</em>. The story begins after Goku defeats Piccolo at the World Martial Arts Tournament and he comes to visit Master Roshi, when all of a sudden, his brother Raditz appears and kidnaps his son, Gohan. After he saves him, he is sent to Other World to train with King Kai for two more powerful Saiyan arriving one year later. This wild ride story takes the player from the Saiyan to the Cell Games Saga.</p><p>There are also several options in the game: there is a world tournament mode where the player may buy new moves and a practice mode where to sharpen skills before entering story mode. The player may also summon Shenron after collecting all 7 Dragonballs.</p>"},{"name":"Dragon Ball Z: Budokai 2","year":2003,"developer":"Dimps Corporation","url":"ps2_collection_part7/Dragon%20Ball%20Z%20-%20Budokai%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":601472088,"score":7.3,"genres":"Action > Anime / Manga > Fighting > Martial arts > Licensed","desc":"<p>This is the second installment of the Budokai series. Goku and the Z Warriors travel through the Dragonball Z universe from the Saiyan to the Kid Buu Saga. It has all new cel-shaded characters with absorptions and fusions. Instead of story mode, they have Dragon World, where you can create your own Dragonball Z adventure!</p>"},{"name":"Dragon Ball Z: Budokai 3","year":2004,"developer":"Dimps Corporation","url":"ps2_collection_part7/Dragon%20Ball%20Z%20-%20Budokai%203%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1167961436,"score":7.6,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Side view > Anime / Manga > Fighting > Quick Time Events (QTEs) > Martial arts > Licensed","desc":"<p>All the power of DBZ is yours. A Hall of Fame cast of the greatest DBZ, DBGT and DBZ movie characters meet for first time for some of the fastest paced, highest intensity battles ever seen. New abilities include, for the first time on PlayStation 2, the ability to fly at will in a DBZ fighting game. Pummel your foes on the ground and in the air.</p><p>In North America, an exclusive re-release package of the game (for the PlayStation \"Greatest Hits\" line) was released. It contained extras not included in the original black label release. This special version includes an unlockable bonus feature that lets you listen to the original Japanese voice over cast, as well an additional unlockable costume for Goku, Piccolo, and Trunks. It also uses the original Japanese cover art for the case.</p>"},{"name":"Dragon Ball Z: Budokai Tenkaichi","year":2005,"developer":"Spike Co., Ltd.","url":"ps2_collection_part7/Dragon%20Ball%20Z%20-%20Budokai%20Tenkaichi%20%28Europe%2C%20Australia%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2730709082,"score":7.6,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p>Dragon Ball Z: Budokai Tenkaichi lets you fight all the major battles, from the Saiyan Saga up to the early Baby Saga, with 56 unique characters and a total of 90 forms, including some characters that have never appeared in any other Dragon Ball Z game!</p><p>You can relive almost all the battles of the Dragon Ball Z series in \"Battle Gate\" mode, fight 100 opponents and become a champion in \"Ultimate Battle\" mode, or face of in the \"World Tournament\". Also supports head-to-head two player battles.</p>"},{"name":"Dragon Ball Z: Budokai Tenkaichi 2","year":2006,"developer":"Spike Co., Ltd.","url":"sony_playstation2_d_part2/Dragon%20Ball%20Z%20-%20Budokai%20Tenkaichi%202%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1856342708,"score":7.3,"genres":"Action > Behind view > Anime / Manga > Fighting > Licensed","desc":"<p><em>Tenkaichi 2</em> is a fighting game with more than 120 playable characters, the biggest amount ever featured in a Dragon Ball game. The main Dragon Adventure mode follows an epic story mode that covers the first Dragon Ball Z saga (Saiyan Saga) right up to the last Dragon Ball GT saga (Dragon Saga), including all of the major battles, making it one of the most comprehensive Dragon Ball Z games.</p><p>The same battle format from the predecessor is taken, but extended with improved mechanics, including the return of the \"Planet Freedom\" feature (last seen in Dragon Ball Z: Budokai 3). There are more combat combos and in-battle transformations, all topped of with a featured encyclopedia, which covers all the most important aspects of the Dragon Ball universe.</p><p>All the characters from the previous version are present, with some new ones (there are more in the Wii version), and up to ten characters can participate in a single battle, with a tag system. The locations include those of the previous game, with some additional ones.</p>"},{"name":"Dragon Ball Z: Budokai Tenkaichi 3","year":2007,"developer":"Spike Co., Ltd.","url":"sony_playstation2_d_part2/Dragon%20Ball%20Z%20-%20Budokai%20Tenkaichi%203%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2027013202,"score":7.5,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Direct control > Fantasy > Licensed","desc":"<p><em>Budokai Tenkaichi 3</em> is a 1vs1 fighting game based on the anime/manga Dragon Ball by Akira Toriyama. It includes the apocalyptic battles and the essence of the Dragon Ball series following the main story of the popular manga. As in the previous games of the series, you'll have to select your character (over 162 characters with their own movements and combos) and fight against a friend or the computer in many different game modes with many different stages and weather/time conditions.</p><p><em>Budokai Tenkaichi 3</em> is the third game of the Budokai Tenkaichi series and features some new things like new characters, Battle Replay to capture your fights and save them to a SD card, night and day stages for more accurate battles following the history made by Akira Toriyama and a Disc Fusion to unlock new modes with the need of previously released games <em>Budokai Tenkaichi</em> and <em>Budokai Tenkaichi 2</em>. There are also new combos and movements as well as the possibility to take control of the Giant Apes for the Saiyans.</p>"},{"name":"Dragon Ball Z: Infinite World","year":2008,"developer":"Dimps Corporation","url":"ps2_collection_part7/Dragon%20Ball%20Z%20-%20Infinite%20World%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1955813133,"score":"","genres":"Action > 3rd-person (Other) > Side view > Fixed / flip-screen > Free-roaming camera > Anime / Manga > Persistent > Fighting > Direct control > Licensed","desc":"<p>This is a fighting game in the Dragon Ball franchise.You can choose over 40 different characters from the Dragon Ball Z (and even GT) series.Over 130 missions to choose from in Dragon Missions mode (essentially a story mode)100 transformations to unlock and 25 different battle stages.</p>"},{"name":"Dragon Ball Z: Sagas","year":2005,"developer":"Avalanche Software LLC","url":"sony_playstation2_d_part2/Dragon%20Ball%20Z%20-%20Sagas%20%28USA%29.zip","filesize":1203635009,"score":5.9,"genres":"Action > 3rd-person (Other) > Anime / Manga > Beat 'em up / brawler > RPG elements > Sci-fi / futuristic > Martial arts > Licensed","desc":"<p><em>Dragon Ball Z: Sagas</em> is an action game that tells how the story of Dragon Ball Z began. Players can choose between six different heroes from the show, such as Goku, Gohan, and Piccolo. Their mission is to recreate the elements of the Saiyan-Cell Games Sagas. Along the way, they must fight evil enemies, as well as collect Z-Coins, to achieve new abilities and moves, and Capsules, which give more fighting power and energy. Some areas end with a boss fight (Raditz, Nappa, Captain Ginyu, Frieza, and Cell). </p><p>The single-player mode features three difficulty levels. The game also has a co-op mode, where any chapter from the single-player mode can be selected, but with a higher difficulty level.</p>"},{"name":"Dragon Blaze","year":2006,"developer":"Psikyo","url":"ps2_collection_part7/Dragon%20Blaze%20%28Europe%29.zip","filesize":134266529,"score":"","genres":"Action > Top-down > 2D scrolling > Shooter > Fantasy","desc":"<p><em>Dragon Blaze</em> is a 2D vertically scrolling shoot 'em up game where you take control of one of four dragon riders in a fantasy themed setting. The riders are Quaid with his fire dragon, Sonia with her three aqua dragons, Rob with his two-headed thunder dragon and Ian with his skull dragon.</p><p>As you make progress through the colorful stages and fight off fantasy themed enemies, weapon power-ups in the form of swords can be retrieved. The dragon and rider can separate for a strong close range attack. The game can be played solo or with a friend.</p>"},{"name":"Dragon Quest & Final Fantasy in Itadaki Street Special","year":2004,"developer":"Paon Corporation, Ltd.","url":"sony_playstation2_d_part2/Dragon%20Quest%20%26%20Final%20Fantasy%20in%20Itadaki%20Street%20Special%20%28Japan%29.zip","filesize":1129307107,"score":"","genres":"Strategy > Top-down > Turn-based > Board game","desc":"<p><em>Itadaki Street Special</em> is the fifth title in the long-running Itadaki Street series. While earlier titles had references to the Dragon Quest series, this one prominently features dozens of characters and boards from both <em>Dragon Quest</em> and its once-rival Final Fantasy, not to mention copious other fan service such as arranged music.</p><p>The same basic gameplay of the previous titles is retained -- players move around the board purchasing properties and investing in districts to earn money -- but this is the first title in the series to make any significant changes to the game's structure with the introduction of the level-up system. Rather than simply counting laps around the board, players earn EXP from various actions such as collecting suits or reaching the bank, and leveling up will increase the money they earn when reaching the bank. The game has also been rebalanced to be more forgiving to novice players, along with a wide range of other minor changes.</p><p>The main new mode in this entry is the \"Sphere Battle\" mode, which replaces the chance card board with so called Sphere Dice, resembling the Sphere Grid from Final Fantasy X, and which causes various random effects to occur when it is rolled.</p>"},{"name":"Dragon Quest V: Tenkuu no Hanayome","year":2004,"developer":"Arte Piazza Ltd.","url":"sony_playstation2_d_part2/Dragon%20Quest%20V%20-%20Tenkuu%20no%20Hanayome%20%28Japan%29.zip","filesize":1224160126,"score":"","genres":"Role-playing (RPG) > 1st-person > 3rd-person (Other) > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p><em>Dragon Quest V: Tenkū no Hanayome</em> is a remake of the earlier game of the same name. It retains the story and the basic gameplay of the original version, while including a significant graphical overhaul and new gameplay features.</p><p>The remake has fully 3D graphics with rotatable camera. The player is able to physically interact with many objects in the environment: for example, lifting and breaking a pot to reveal an item is graphically displayed, rather than being indicated by a text message. The music has been re-recorded with a life orchestra, as opposed to the synthesized tracks of the original version.</p><p>The player can now have four active controllable party members instead of three. The amount of monsters who can join the party has been increased as well. Some mini-games are added to those that already existed in the original version. A trinkets museum has been added, which rewards the player for collecting local specialties from various places.</p><p>Once the player finishes the game, he gains access to an additional dungeon with powerful enemies. A demo disc for  Dragon Quest VIII is included.</p>"},{"name":"Dragon Quest VIII: Journey of the Cursed King","year":2004,"developer":"Level-5 Inc.","url":"sony_playstation2_d_part2/Dragon%20Quest%20VIII%20-%20Journey%20of%20the%20Cursed%20King%20%28USA%29.zip","filesize":3088620326,"score":8.3,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>The court jester Dhoulmagus of the kingdom of Trodain stole a powerful magical scepter sealed beneath the royal castle. Using the power of the scepter, Dhoulmagus destroyed the castle, placed a curse upon the kingdom and its people, and turned King Trode into a troll and the princess into a horse. A sole surviving castle guard journeys with the king, the princess, a reformed bandit named Yangus and a few other companions in search of the evil jester and a way to break the curse. </p><p><em>Dragon Quest VIII: Journey of the Cursed King</em> is a traditional Japanese-style role-playing game with random enemy encounters, simple turn-based combat mechanics, and management of a party consisting of four characters, each belonging to a clearly defined class. Unlike its predecessors in the series and most Japanese RPGs in general, the game features a continuous world with fairly vast landscapes and integrated towns and dungeons, as opposed to world map traveling and locations represented by icons. The game features full camera rotation and optional first-person view. Like in the previous <em>Dragon Quest</em> games, many objects can be interacted with; for example, barrels can be physically lifted, carried, and broken, to reveal items hidden within.</p><p>In addition to experience points, the player receives skill points from battles, which can be manually allocated into a skill category of the player's choice. These categories include three different kinds of weapons, fisticuffs, and a discipline unique to each character. After a required amount of skill points has been invested into a particular category, the correspondent character learns a new ability or becomes more proficient with the chosen weapon. The Alchemy Pot system allows players to gather recipes and mix items to create new ones.</p><p>The international version of the game features several updates to the original Japanese version, including voice acting, graphic menu, symphonic soundtracks, and flashier effects.</p><p>When the game was later released for the 3DS some alterations were made. Random encounters (besides those encountered while sailing) have been eliminated in favor of battles being started by running into enemies visible on screen, battle animations can be fast forwarded, the ability to quick save anywhere, the ability to capture and caption screenshots with a new photo mode feature (this mode is also side quest related too), the alchemy pot now produces items instantly and can also produce multiples of the same items right out of the gate, More major additions include the two characters Red and Morrie now being able to be recruited into the players party, new story sequences, two new challenging dungeons, new monster arena challenges, new costumes, new recipes, new equipment, and new monsters among other tweaks.</p>"},{"name":"Dragon Quest: Shounen Yangus to Fushigi no Dungeon","year":2006,"developer":"cavia inc.","url":"sony_playstation2_d_part2/Dragon%20Quest%20-%20Shounen%20Yangus%20to%20Fushigi%20no%20Dungeon%20%28Japan%2C%20Asia%29.zip","filesize":3337647284,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>Part of the immensely popular Dragon Quest franchise, this entry to the Fushigi no Dungeon / Mysterious Dungeon series stars twelve-year old thief's son Yangus.</p><p>Like its predecessor Torneko no Daibōken / Torneko: The Last Hope, Shōnen Yangus is a direct spin-off of a Dragon Quest main series title, in this case Dragon Quest VIII. The events of Shōnen Yangus are set decades before the plot of Dragon Quest VIII and recurring characters are the titular hero Yangus, his girlfriend Red and monster trainer Morrie.</p><p>Shōnen Yangus is a so-called 'roguelike', an RPG featuring extensive explorations of dungeons randomly generated at the beginning of each game.Unlike roguelikes such as Diablo the game has turn-based combat and as such isn't an action-RPG. It includes the option to capture, train and breed monsters found in dungeons, similar to the DQ Monsters series, another Dragon Quest spin-off.</p>"},{"name":"Dragon Rage","year":2001,"developer":"The 3DO Company","url":"ps2_collection_part7/Dragon%20Rage%20%28Europe%29%20%28Es%2CIt%29.zip","filesize":909195199,"score":6.2,"genres":"Action > Behind view > Shooter > Flight / aviation > Fantasy","desc":"<p><em>Dragon Rage</em> is a 3D action game in which the players takes control of the dragon Cael Cyndar. Cael is one of the last members of his race and has been caught by the orcs who have hunted his race to extension. The orcs are after an element called Zeenium that gives the dragons the ability to breath fire. Moment before his death he escapes the Zeenium factory.</p><p>Gameplay includes flying around and destroying building and ships with Caels dragon breath as well as killing the orcs responsible for the mistreatment of his race. Cael can do 32 different attacks like biting, stomping and tail whipping.</p>"},{"name":"Dragon Sisters","year":2005,"developer":"Tamsoft Corporation","url":"ps2_collection_part7/Dragon%20Sisters%20%28Europe%29.zip","filesize":158524225,"score":"","genres":"Action > Side view > Anime / Manga > Beat 'em up / brawler > Fighting > Sci-fi / futuristic","desc":"<p><em>Dragon Sisters</em> is set 100 years after the great war, and the East Asian state is not doing very well. Constant wars and natural disasters have crippled its economy, so they decide to attack the neighboring Empire in hope of kidnapping some scientists and other skilled individuals. As Empire is a peace-loving country, East Asia defeats their forces in just three days. Luckily there are Kiku and Hanna, two highly trained cyborg soldiers with only one objective: to protect Empire and its citizens.</p><p><em>Dragon Sisters</em> is a 3D brawler fighting game for one or two players in the style of Fighting Force or Streets of Rage. The game's ten stages each end with a boss battle. As the game progresses, the characters gain experience by collecting orbs from the fallen enemies. These orbs lets you upgrade the characters' abilities such as speed, power and health. While fighting different types of attacks can be combined to form large combos.</p>"},{"name":"Dragon's Lair 3D: Return to the Lair","year":2004,"developer":"Dragonstone Software","url":"ps2_collection_part7/Dragon%27s%20Lair%203D%20-%20Special%20Edition%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":619794863,"score":6.8,"genres":"Action > Behind view > Platform > Puzzle elements > Fantasy > Licensed","desc":"<p>The goofy, but courageous knight Dirk the Daring is on a quest to save the pretty princess Daphne. The princess was kidnapped by the evil dragon Singe and imprisoned in a medieval castle owned by an even more evil wizard called Mordroc. Now, it's only up to Dirk to use his courage and his quick reflexes to overcome the traps in the castle, if he wants to save the princess and his skin.</p><p><em>Dragon's Lair 3D: Return to the Lair</em> can be considered a re-imagining of the 1983 arcade game: gameplay-wise it deviates from it significantly, being a full-fledged action platformer with unrestricted character movement. Dirk has to battle enemies, jump across platforms and hazards, and solve a few puzzles on his way. Health and mana points can be upgraded over the course of the game. Dirk can also use a crossbow to combat enemies and solve some of the puzzles. Collecting Dragon Essences scattered through the castle grants him new powers.</p><p>The game features the familiar cartoon-like style of the original version (done with cel-shaded technique), as well as many familiar locations and boss enemies.</p>"},{"name":"Drakan: The Ancients' Gates","year":2002,"developer":"Surreal Software, Inc.","url":"ps2_collection_part7/Drakan%20-%20The%20Ancients%27%20Gates%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2601147437,"score":7.7,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Fantasy","desc":"<p>After the dragon rider Rynn returns to her home village, she finds it destroyed, and all its inhabitants massacred. Her dragon, Arokh, tells her that he hears a voice that calls them to the city of Surdana. There, they find out that a race of three-faced monsters, called Desert Lords, have been terrorizing the human population recently. In order to fight them, the humans need powerful allies. But the gateway to the world of dragons has been sealed, and only a dragon of the Elder Breed can open it. Rynn and Arokh must now venture to the dragon world, restore the bond between humans and dragons, and defeat the Desert Lords.</p><p><em>Drakan: The Ancients' Gates</em> is an action game with RPG elements. The player will take control of both Rynn and Arokh during the course of the game. Arokh's gameplay involves flying to distant lands and dealing with some of the more powerful foes. Rynn's gameplay has more RPG elements, as she can specialize in the arts of melee fighting, archery, or magic, acquiring experience from defeated enemies.</p>"},{"name":"Drakengard","year":2003,"developer":"Square Enix Co., Ltd.","url":"ps2_collection_part7/Drakengard%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3940143799,"score":6.5,"genres":"Action > Role-playing (RPG) > Behind view > Direct control > Fantasy","desc":"<p><em>Drakengard</em> follows the story of a kingdomless prince named Caim who fights for the Union against the Empire. Under the Union's protection are the Hierarchs and the Goddess, currently Caim's sister Furiae, who is a human manifestation of one of the four seals that protect the world from being broken. As the game begins, Cain is fatally wounded in a battle with the Empire. Encountering a captured Red Dragon who is also near death, Caim makes a fateful choice. In exchange for both their lives, the Red Dragon and Caim will enter a pact. This pact will forever chain their lives to one another and link their souls, at the cost of something irreplaceable. Recharged with the fires of a Dragon, Caim's vengeance burns over the enemy...</p><p>The player controls Caim on his quest. The game is separated into three distinct modes: Aerial combat, Ground combat and Event Combat. In Aerial Combat, Caim rides dragonback against a variety of airborne foes breathing fireballs (strong single shots and weaker multiple lock-on shots). The Dragon is agile and is able to evade incoming threats, turning around completely in a moment. In Ground combat, the game is shown in 3rd person though usually large, open areas. Controlling Caim, his primary ability is the use of a variety of weapons found on the battlefield. These are leveled up through continued usage, and specifically through the killing of individual enemies. Though magic (determined by weapon choice), timed attacks and evasion, Caim breaks through enemy armies. Characters recruited as allies by Caim can also be summoned during battles, steadily losing health until control is returned to Caim. In ground combat, Caim may also call forth his Dragon to ride and strafe enemies from the air. The Dragon's movements are generally the same as in aerial combat but more limited and less agile. Event combat is similar to Ground combat, but shown isometrically, restricted to a single weapon and without the aid of a dragon. It is used mainly to tell story sequences.</p><p>Levels that have been visited before might become \"Expedition Missions\" which are optional and contain new objectives, enemies and weapons. Additionally, any level previously played in the storyline may be revisited at any time. Depending on Caim's choices (and prerequisites for those choices), there are five different endings to Drakengard.</p>"},{"name":"Drakengard 2","year":2005,"developer":"Square Enix Co., Ltd.","url":"ps2_collection_part7/Drakengard%202%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2717571732,"score":6.4,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Fantasy","desc":"<p>Because of the events of the first game the world was broken, requiring the Red Dragon, Angelus, to restore the magical seals and hold back the apocalypse. In the eighteen years since, the Union has taken rule over the land and made prisoner the former soldiers of the Empire's forces. The priestess child Mannah has grown and lives in the company of these imprisoned forces. Among the Union forces, the Knights of the Seal were formed in dedication to the protection of the magical seals. General Oror of the Knights was on a campaign in the wilds when he came across a young boy, named Nowe, who was cared for and able to talk to the Blue Dragon, Legna. Deciding to raise the boy as his son, Oror brought both Nowe and Legna back to the Union. The Hierach leader, Seere, recognized Nowe's potential and dubbed him \"The Savior\". Over time, Nowe grew up among the knights and aspired to join their ranks. Now finally after many years and training, Nowe is ready to formally become a member of the Knights of the Seal...</p><p><em>Drakengard 2</em> is a 3rd person role-playing action game like the first title. The player controls Nowe on his quest, as well as other characters who join him along the way. The game is separated into two modes: Aerial combat and Ground combat. In Aerial Combat, Nowe rides dragonback against a variety of airborne foes breathing fireballs (strong single shots and weaker multiple lock-on shots). The Dragon is agile and is able to evade incoming threats, turning around completely in a moment. In Ground combat, the game is shown in 3rd person though usually large, open areas. Controlling Nowe, his primary ability is the use of a variety of weapons found on the battlefield. Each type of weapon can only be equipped by a specific character, and so changing to a new weapon type will also change the playable character from Nowe to another member of his party. These weapons are leveled up, gaining new combos and more powerful magic, through continued usage, and specifically through the killing of individual enemies. Accessories and items, such as healing and magic restorers, can also be found and used during combat. Though magic (determined by weapon choice), timed attacks and evasion, Nowe is able to defeat enemies and earn experience. Defeated enemies drop items and coins, though weapons are only found in treasure chests. In ground combat, Nowe may also call forth his Dragon to ride and strafe enemies from the air. The Dragon's movements are generally the same as in aerial combat but more limited and less agile.</p><p>Progress in the game is shown on the world map. Levels that have been visited before might become \"Expedition Missions\" which are optional and contain new objectives, enemies and weapons. Additionally, any level previously played in the storyline may be revisited at any time. Additionally, villages will appear which sell weapons and items in exchange for gold coins.</p>"},{"name":"Dream Mix TV: World Fighters","year":2003,"developer":"Red Company Corporation","url":"sony_playstation2_d_part2/Dream%20Mix%20TV%20-%20World%20Fighters%20%28Japan%29.zip","filesize":521774866,"score":"","genres":"Action > 3rd-person (Other) > Side view > Fighting > Platform","desc":"<p>A television program is facing low ratings and they are told by their TV network that they are on the verge of being canceled. In order to hold onto their jobs, the people in charge of the program decide to hold a fighting brawl tournament involving some of japan's superstars from the licenses of Hudson, Konami and Takara.</p><p>Invited to this cross-over tournament are: Takahashi Meijin aka Master Higgins (from the Adventure Island series), White Bomberman (from the Bomberman series), Yugo (from the Bloody Roar series), Momotaro and Bimbogami (from Momotaro Densetsu), Sengoku Manjimaru (from Tengai Makyo II: Manjimaru), Simon Belmont (from the Castlevania series), Twinbee (from the Twinbee series), Power Pro-kun (from Jikkyo Powerful Pro Yakyo '94), Solid Snake (from the Metal Gear series), Moai (from the Gradius series), Convoy aka Optimus Prime and Megatron (from Transformers), Microman (from Micronauts), Takao Kinomiya (from BeyBlade), Licca-Chan (a popular dress up doll franchise) and Aska (from the game Cy Girls).</p><p><em>Dream Mix TV World Fighters</em> is a side-scrolling 2D platform fighting game displayed on a 3D world, similar to Super Smash Bros. Between two and four players are selected to compete against one another in the arena. The goal of the player is to damage and destroy the other players by impacting them with attacks and special abilities, the specifics of which vary by the character selected. A group energy bar showing all characters individually on a bar is displayed at the bottom of the screen.</p>"},{"name":"DreamWorks & Aardman Flushed Away","year":2006,"developer":"Monkey Bar Games","url":"ps2_collection_part7/DreamWorks%20%26%20Aardman%20Flushed%20Away%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1159381103,"score":5.9,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>In this game, based on Aardman Animation's first computer-animated movie with 3D graphics, you control a pair of rats: Roddy who is from the posh side of Kensington and gets flushed into the London sewers, and Rita who owns a boat on the sewer named the Jammy Dodger. The evil Toad wants to destroy the rat community of Ratropolis and you must thwart his plan and return Roddy home. Journey through the various settings from the movie in this 3D platformer with 10 levels while using weapons to vanquish foes.  </p><p>Roddy uses a toothpick as a fencing weapon while Rita can kick and use a bouncing bungee, and the boat has a crayon crossbow.  There are power-ups such as Rita's Ruby, a fire extinguisher, and air cannon. There are also minigames you can play against a partner titled Rat Traps &amp; Crayons, Castle Siege, and Pathfinder. They allow you to increase your health and unlock exclusive content by collecting and salvaging rare treasures.</p>"},{"name":"DreamWorks Shark Tale","year":2004,"developer":"Edge of Reality, Ltd.","url":"ps2_collection_part7/DreamWorks%20Shark%20Tale%20%28Europe%29.zip","filesize":1188173238,"score":7,"genres":"Action > Racing / Driving > 3rd-person (Other) > Licensed","desc":"<p><em>Shark Tale</em> is inspired by the movie of the same name and follows the adventures of Oscar, a blue-streaked cleaner wrasse fish. Oscar seems to have got himself into a bit of trouble as he needs to earn money to pay off a loan shark.</p><p>The game consists of over 25 chapters with each chapter having three missions to perform. The three missions are broken into a regular one, a bonus one, and an elite one. Completing missions earn Oscar fame points which affect his fame rating. Also, depending on how well Oscar performs missions will determine how much money he earns to pay off his debt. Missions are varied including things like escaping a shark, erasing graffiti, and a dancing segment.</p>"},{"name":"Driv3r","year":2004,"developer":"Reflections Interactive Limited","url":"ps2_collection_part7/Driv3r%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3562509005,"score":5.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Sandbox / open world > Shooter > Detective / mystery > Spy / espionage","desc":"<p>Continuing from the storyline of the previous Driver games, players reprise their role as the undercover cop Tanner, this time infiltrating a worldwide high-performance car theft ring.</p><p>Nothing is too dangerous or too risky for Tanner, as he'll hop into any car, truck, or motorcycle, and cruise the streets of three re-created cities (Miami, Nice and Istanbul) with over 156 miles of roads, in more than 25 storyline missions featuring some characters from the previous installments.</p>"},{"name":"Drive to Survive","year":2005,"developer":"Supersonic Software Ltd.","url":"sony_playstation2_d_part2/Drive%20to%20Survive%20%28USA%29.zip","filesize":250798932,"score":7.1,"genres":"Action > Racing / Driving > Top-down > Arcade","desc":"<p><em>Mashed: Fully Loaded</em> is a re-release of the original Mashed: Drive to Survive.</p><p>Besides updated graphics, improved camera control and a better race physics, it also introduces the possibility to race at night or cover the track with very slippery ice. That updates the possible driveable versions of every track to five. In addition to that, there are two new tracks waiting to be raced on with two new cars which increases the available car park to 15 vehicles. Some power-ups have also been rebalanced and new ones introduced.</p><p>The game now also features a tutorial, 21 new single player-challenges and a few new game modes like the ice tournament or the challenge cup.</p>"},{"name":"Driven","year":2001,"developer":"BAM! Studios Europe Ltd.","url":"ps2_collection_part7/Driven%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2872364357,"score":5.8,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Licensed","desc":"<p>The game <em>Driven</em> is based on the movie by the same name with Sylvester Stallone. The player competes in a series of open-wheel races that follow the plotline of the movie. Each selected driver has different attributes that affect the performance of the car. If the driver is skilled enough he can enter “The Zone”. Once in “The Zone”, the car performs at optimum efficiency. The point of the game is to win the series championship against your arch-rival. The game contains an arcade mode, a story mode, and a multiplayer mode.</p>"},{"name":"Driver: Parallel Lines","year":2006,"developer":"Ubisoft Reflections Ltd.","url":"sony_playstation2_d_part2/Driver%20-%20Parallel%20Lines%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3431769348,"score":6.9,"genres":"Action > Racing / Driving > Behind view > Shooter > Automobile","desc":"<p>Driver: Parallel Lines is the fourth game in the Driver series, following the story of TK. In 1978, TK (who was then an 18-year-old driver-for-hire who had just graduated from high school) was sentenced to 28 years in prison for a crime he did not commit, and is released from prison in 2006. Now, with his driving skills, he seeks revenge against the police department for having to serve time for something someone else should've gone to prison for!</p><p>Unlike Driv3r, Driver: Parallel Lines mostly takes place behind the wheel, returning back to the formula that made the first game a classic. The game still has a GTA-style open-ended design, though, and you can still exit your vehicle for some on-foot action. However, there's no reason to exit your vehicle unless it's damaged and you can no longer drive it, as almost all of the game's missions involve cop car chases. If that's the case, then you can either go to the repair shop to repair your vehicle, or just steal someone else's vehicle! Until then, you can punch the cops with your fists and steal their weapons when they're dead, so that you can use them for future on-foot combat.</p><p>The game takes place in both 1978 (before TK went to prison) and in 2006. The 2006 setting has a much more modern soundtrack than the 1978 setting, which has a mostly disco soundtrack. Obviously, the 2006 setting has the architecture, technology, and cars of today.</p>"},{"name":"Driving Emotion Type-S","year":2000,"developer":"Escape Co., Ltd.","url":"ps2_collection_part7/Driving%20Emotion%20Type-S%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":429348268,"score":6,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Licensed","desc":"<p>Much like Gran Turismo 2, Type-S has all of the best official cars from BMW, Honda and much more. And as you complete each objective (i.e. winning each race) you can unlock up to 50 new cars (including those from Ferrari and Porsche) and 10 new tracks. Each track ranges from easy to hard, and once you have finished you can go through the entire race in a TV like replay.</p><p>The European and North American releases of the game feature revised controls and additional content.</p>"},{"name":"Drome Racers","year":2002,"developer":"Attention to Detail Limited","url":"ps2_collection_part7/Drome%20Racers%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CDa%29.zip","filesize":1051782510,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Off-roading > Track racing > Sci-fi / futuristic > Licensed","desc":"<p><em>Drome Racers</em> is a futuristic combat racing game based on the LEGO (Drome) Racers line of construction toys from 2002. <em>Drome Racers</em> features on- and off-road racing in vehicles that resemble their LEGO counterparts, with some designs being completely new. </p><p>The game focuses on the Career mode, where the player takes the role of Max Axel, the driver of the newly-formed Team Nitro, one of the six racing teams in Drome, a large elliptic racing arena with many different natural and urban surroundings. All drivers compete in a set of Multi Challenge Races (MCR), which are a series of connected races. At the start of each MCR, a drag race determines the pole position, while in all subsequent races, the position, and delay at which the driver approaches the starting line is determined by the results of the previous race. Hence, whoever wins the last race of an MCR, wins the MCR itself. There are 9 standard tracks available, and each one has A and B variations (up to half of the track can differ), and can be driven in forward or backward directions, resulting in 4 ways to drive on each track. Three MCR categories exist; Novice, Intermediate, and Expert, with the opening MCRs of each category unlocking new tracks. Different times of day and weather conditions are also featured.</p><p>After a certain number of MCRs, individual drivers will challenge Max to race in all four variations of a track. Finishing in fourth place or better (or just first in challenges) earns upgrade points (which can be used to improve the engine, turbo, aerodynamics, tires, and armour), and finishing certain MCRs or challenges earns build tokens, which can be used to unlock new cars. All cars can be driven with automatic or manual gear changing, except for manual-only drag cars. </p><p>Scattered on the tracks are health and weapon powerups, as well as accelerator pads. Each car has four measures of health - the less health it has, the slower it gets, and when it loses all the measures in the health meter, some (non-essential) parts can fall off the car. Various weapons add to the arcade nature of the game and help drivers maintain their position or press forward. </p><p>Joining Max in Team Nitro are Rocket, a retired driver who arranges practice and challenge sessions and gives tips on the game mechanics; Shicane, the team's mechanic who informs Max of the upcoming races and manages the garage (cars, upgrades, and unlocking); and Slot, the analyst who follows Max' statistics and enables saving/loading of the Career mode progress. They assist Max in winning the 2015 Drome championship and dethroning the current champion, Sever from Team Exo Force.</p><p>In addition to the Career mode, players can choose Arcade mode and the Quick Race mode (which is the same as Arcade, only with randomized settings). These modes only feature tracks that have been unlocked in at least one saved game from the Career mode and can be played by one or two players in local split-screen multiplayer.</p>"},{"name":"Dropship: United Peace Force","year":2002,"developer":"SCEE Camden Studio","url":"ps2_collection_part7/Dropship%20-%20United%20Peace%20Force%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1589322854,"score":7.6,"genres":"Action > Simulation > 1st-person > Behind view > Shooter > Flight / aviation > Tank > Sci-fi / futuristic","desc":"<p>Dropship is an action game set in the year 2050. Terrorist attacks have increased severely, which is why big nations of the world decided to form the UPF, \"United Peace Force\", replacing the UN and NATO. It is an anti-terror army, operating world-wide.</p><p>But there is another globally operating group: A massively militarised drug syndicate. When an attack on a peace convoy in Columbia is linked to this cartel, the UPF starts investigation. A central base and training camp of the drug cartel is believed to be located somewhere in Libya. The UPF opens up a base in this country and starts looking for the criminals.</p><p>The player is a recently recruited soldier and pilot of the UPF. During the campaign, which lasts for 20 rather long missions, he can travel and fight on foot, in tanks and various other ground vehicles, but most of the time he will be piloting a dropship, either of the attack, defender or transport class. Dropships can operate in hover and flight mode, and carry a large amount of weapons and cargo.</p><p>Dropship simulates a massive, global conflict, with the player taking part in all the action. Six training missions make it easier to learn the controls of the game.</p>"},{"name":"DT Carnage","year":2008,"developer":"AXIS Entertainment Co., Ltd.","url":"sony_playstation2_d_part2/DT%20Carnage%20%28USA%29.zip","filesize":1000822495,"score":"","genres":"Racing / Driving > Behind view > RPG elements > Automobile > Vehicular combat","desc":"<p>Smash, Crash & Destroy!<br>When speed isn't enough in the underground racing, violence becomes the only solution. DT Carnage will have you using every trick up your sleeve while racing against unhinged opponents. Use weapons and skills to slow other cars down, slam them againt the outer track wall and flip them over. Everyone else will be doing whatever it takes to be proclaimed number one and so will you. * Complete over 100 missions * Race 18 different courses based on real cities * Customize your car from a selection of 33 cars * Crush your opponents or be crushed * Execute precise moves to become a legend in the underground racing</p>"},{"name":"DT Racer","year":2003,"developer":"AXIS Entertainment Co., Ltd.","url":"ps2_collection_part7/DT%20Racer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1733063355,"score":"","genres":"Racing / Driving > 1st-person > 3rd-person (Other)","desc":"<p><em>DT Racer</em> is an arcade and simulation racer featuring 21 facsimiles of real race cars. Players can select from Arcade, GT, and Free modes. In Arcade the player progresses through increasingly more difficult grand prix to unlock more powerful tiers of cars. In GT mode players are awarded credits for finishing races that they can buy new cars with, and higher level races require higher tier cars to be played. Courses range from ovals to city courses, and include facsimiles of real tracks such as the Circuit de Monaco.</p><p>Before a race the tires, downforce, and suspension of a car can be modified. During a race cars take damage from impacts, causing parts to break and fall off the car. This damage will also hinder a car's performance.</p>"},{"name":"Dual Hearts","year":2002,"developer":"Matrix Software","url":"sony_playstation2_d_part2/Dual%20Hearts%20%28USA%29.zip","filesize":1326396031,"score":7.1,"genres":"Action > 3rd-person (Other) > Puzzle elements > Fantasy","desc":"<p>Long, long ago, the real world and dream world were one and the same. But because of the dark thoughts in people's minds, the Nightmare was born and threatened to end the world. A brave sage appeared and, by using the Holy Instruments and the Dream Stone, sealed the Nightmare away into the holy land. Peace was restored but the world is now separated into the real world and dream world. </p><p>Years later, people forgot what has happened, and only recalled the events as a legend. Many have also heard about the Dream Stone sealed within the Temple of Dreams. Enter our hero, Rumble, a Ruinseeker (a high ranked treasure hunter) who wish to find the Dream Stone. At the same time, in the Dreamworld, a Baku (a weird looking animal that lives in the Dreamworld) who Rumble later names Tumble accidentally drops the box which holds 7 keys to the seal of the Temple. The keys went and hid in different people's dreams. To retrieve them, one must enter the dream and seek out the keys. Tumble can enter the dreams but there are many monsters within dreams and puzzles that he may need help with. Rumble realize he must get the keys in order to find the Dream Stone. Seeing that the two can help meet each other's goals, Rumble and Tumble decides to work together.</p><p>In <em>Dual Hearts</em>, Rumble and Tumble will travel around Sonno Island, meeting the people there and seek out those whose dreams holds one of the seven keys. Each dream is different as each person is different, which means that the enemies and puzzles Rumble will encounter will be different in each dream he visits. Within the dreamworld, everything is filled with gold and gems - even the boss is a giant money bag.</p><p>Within the dreams, Rumble will be able to use the Holy Instruments (in the form of a spear and sword) to fight enemies there. Rumble can use both weapons at the same time enabling him to do a variety of combo attacks. Tumble will help Rumble by carrying him on his back, enabling him to reach higher planes. He can also perform different attacks like the Breath Attack.</p><p>In order to advance, there are a variety of puzzles for our heroes to solve. For example, in one puzzle, you will be presented with movable blocks, several switches and a closed door. You must figure out which switch will open the door and move the block on the switch. If you run into any problems, you can always talk to Tumble or the Dream Sheep for hints and help.</p>"},{"name":"Duel Masters (Limited Edition)","year":2004,"developer":"High Voltage Software, Inc.","url":"ps2_collection_part7/Duel%20Masters%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2627046527,"score":"","genres":"Strategy > 3rd-person (Other) > Anime / Manga > Cards / tiles > Trading / collectible card > Licensed","desc":"<p>See the creatures of DUEL MASTERS (WOTC \"Magic: The Gathering\" style card game) come to life and battle in dramatic combat sequences!  Build powerful decks to customize offensive and defensive strategies.</p>"},{"name":"Dukes of Hazzard, The: Return of the General Lee","year":2004,"developer":"Ratbag Pty, Ltd.","url":"ps2_collection_part7/Dukes%20of%20Hazzard%2C%20The%20-%20Return%20of%20the%20General%20Lee%20%28Europe%29.zip","filesize":1796454081,"score":6.2,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>You play gold old boys Bo &amp; Luke Duke as you fight to rescue Uncle Jesse from jail and save Hazzard County from Boss Hogg's latest rotten scheme.</p><p>As Bo &amp; Luke you'll tour Hazzard County by car on back roads, race circuits, and country routes in a series of timed missions which range from racing to chasing to gathering parts to build their famous car, the General Lee.  Hazzard County's famous landmarks are all here, from the Duke Farm to Cooter's Garage to the Boar's Nest and all points between.</p><p>The slip-sliding, rally-style, third person action takes place exclusively behind the wheel.  Controls include steering, braking, rear view, etc.  Dixie Horn and \"Yee-HAW!\" buttons included.</p><p>Based on the original television series.  Surviving original cast members provide the voices.</p>"},{"name":"Dynamite 100","year":2008,"developer":"Mere Mortals Ltd.","url":"ps2_collection_part7/Dynamite%20100%20%28Europe%29.zip","filesize":246429724,"score":"","genres":"Action > Compilation > Puzzle > Racing / Driving > Strategy > Arcade > Board game > Mini-games","desc":"<p>Dynamite 100 is a collection of 100 mini games in different genres - arcade, puzzle, racing and many others. The list is endless. Play these mini games together with your friends or family, as numerous are available in 2-player mode. Enjoy the most comprehensive mini games collection!</p>"},{"name":"Dynasty Tactics","year":2002,"developer":"Tecmo Koei Games Co., Ltd.","url":"ps2_collection_part7/Dynasty%20Tactics%20%28Europe%29.zip","filesize":3080697877,"score":7.8,"genres":"Role-playing (RPG) > Strategy > Top-down > Isometric > China (Ancient / Imperial) > Historical events","desc":"<p>A tactical strategy game set in feudal China, Dynasty Tactics is an offshoot of the Dynasty Warrior series. The game puts the player in the shoes of one of 3 military leaders. Through strategy, acquired military might, and diplomacy, the player must strive to conquer the game's 60 cities. </p><p>Battles take place on a 3D grid, in a turn-based format. Through deft use of battlefield tactics, including a deep combo attack system, players must meet certain requirements to win the battle. Multiple paths through the game (including multiple endings) will keep armchair military generals coming back.</p>"},{"name":"Dynasty Tactics 2","year":2003,"developer":"KOEI Co., Ltd.","url":"ps2_collection_part7/Dynasty%20Tactics%202%20%28Europe%29.zip","filesize":2625481705,"score":7.6,"genres":"Strategy > China (Ancient / Imperial) > Historical events","desc":"<p>The sequel to Dynasty Tactics gives the player more tactics to choose from, and introduces some new characters and features.</p><p>Like in the first game, the player assumes the role of 3 important leaders in ancient China: Cao Cao, Liu Bei and Sun Ce. A new choice is the warrior Lu Bu.The characters have their own, unique story paths, which are affected by choices and outcomes occurring during the chapters the game is divided into. The player organizes and moves his officers and armies over the map while engaging others, trying to fulfill certain objectives during a turn limit.</p><p>For battles, the game switches from the map to a dedicated screen showing the battlefield. The battle system is a bit like chess: the player moves the units around the battlefield in a turn-based fashion, mostly trying to bring them in a position to pull off special tactics. Ideally, this results in effective combos, that may not only defeat enemy units, but also capture the leading officers, which may join the player (there are over 200 in the game). </p><p>Morale and terrain need to be taken into consideration as well. Units have different abilities depending on their type and position in the army, Engineers may build useful installments like supply depots for example. Army strategists can use the link command retained from the previous game for pinning down enemy units and helping to rack up higher combos, in addition, they may order chains now. These allow individual officers to perform multiple tactics (provided the conditions are met for each of them), but cost morale. </p><p>The game also contains a two player versus mode, which consists of random battles.</p>"},{"name":"Dynasty Warriors 2","year":2000,"developer":"Omega Force","url":"ps2_collection_part7/Dynasty%20Warriors%202%20%28Europe%29.zip","filesize":525595490,"score":6.8,"genres":"Action > Strategy > 3rd-person (Other) > Arcade > Hack and slash > China (Ancient / Imperial) > Historical events","desc":"<p>Play as one of nine generals in this action packed 3D fighting, combat strategy and simulation game based in the second century AD China.   China is torn with internal civil conflict as the 400 year Han Dynasty comes to an end.  Try and unite the country during the Yellow Turban wars. </p><p>You control a character, on foot and mounted on horse back, as you fight against thousands of enemies in a 3D world.</p>"},{"name":"Dynasty Warriors 3","year":2001,"developer":"Omega Force","url":"ps2_collection_part7/Dynasty%20Warriors%203%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2141689149,"score":7.3,"genres":"Action > Strategy > 3rd-person (Other) > Real-time > Arcade > Hack and slash > Real-time strategy > China (Ancient / Imperial) > Historical events","desc":"<p>About 1800 years ago in China, there were three fearless warriors battling for ultimate control over the country. One who sought hegemony. One who sought ambition. One who stood up for righteousness. Veterans who shared the same swarmed under each leader. These stalwart souls waged war across the vast expanse of the land and, like blood thirsty demons, cut down any and all who stood in their way.</p><p>They followed their own rules, they were both revered and feared by millions... they are the Dynasty Warriors.</p><p><em>Dynasty Warriors 3</em> takes place over the 50 years of war recounted in <em>Romance of the Three Kingdoms</em>, from the first flames of battle in the Yellow Turban Rebellion to the final battle between Wei and Shu on the plains of Wu Zhong. Over 40 characters are playable, both from the three main sides as well as leaders of lesser armies along the way. Each character that belongs to either Wu, Wei, or Shu has their own series of levels where they will turn the tide of battle for their force to win. Each character has their own unique weapon type and magic ability, although they can share weaker variations of weapons with other characters who use the same style of weapon. Weapons and items are dropped randomly from boxes in levels as well as from defeated enemy generals, and each has a range of stats dependent on the difficulty level and the strength of the general. The most powerful weapons and items, however, can only be collected by completing hidden objectives as each character. Characters grow more powerful by collecting stat up items from defeated generals, and doing well in levels rewards points that level up the bodyguards who follow the player character.</p><p>Most completed levels can be replayed with any character and any side in free mode. An encyclopedia is included as well that details every event and character from the <em>Romance of the Three Kingdoms</em>, even those that never appear in <em>Dynasty Warriors 3</em>.</p>"},{"name":"Dynasty Warriors 3: Xtreme Legends","year":2003,"developer":"Omega Force","url":"ps2_collection_part7/Dynasty%20Warriors%203%20-%20Xtreme%20Legends%20%28Europe%29.zip","filesize":2621017093,"score":7.3,"genres":"Action > Strategy > 3rd-person (Other) > Arcade > Hack and slash > China (Ancient / Imperial)","desc":"<p><em>Dynasty Warriors 3: Xtreme Legends</em> is a stand-alone expansion to Dynasty Warriors 3. In both games, you take control of a military general in ancient China, each with their own unique abilities and weapons.</p><p>The gameplay is simple: you destroy hoards of differently ranked enemies on an open battlefield. Your objective in most missions is to defeat one or more enemy generals. Each character you choose has a different storyline (this story mode is referred to as \"Musou Mode\"), with seven battles progressing the story along. Battles get harder as you move along in the story. There is also a free mode, which allows you to play any level that you have unlocked with any general that you have unlocked (you start the game with three generals from three different dynasties).</p><p>The difference between <em>Xtreme Legends</em> and the original <em>Dynasty Warriors 3</em> is that in <em>Xtreme Legends</em>, the Musou Mode only features seven unaligned generals that you couldn't play as in the original. There are also challenge modes in <em>Xtreme Legends</em> not featured in the original. And there is a more advanced bodyguard system allowing you to name them, customize their advancement, and choose from more weapons you unlock as you play through the game.</p>"},{"name":"Dynasty Warriors 4","year":2003,"developer":"Omega Force","url":"ps2_collection_part7/Dynasty%20Warriors%204%20%28Europe%29.zip","filesize":2211516201,"score":7.6,"genres":"Action > Strategy > Behind view > Arcade > Hack and slash > China (Ancient / Imperial) > Fantasy","desc":"<p>Take it to the battlefield and challenge multiple opponents at once as you fight against impossible odds. Developed by Omega Force, Dynasty Warriors 4 uses the most advanced melee-fighting engine to deliver the next evolution of tactical action.</p><p>Ancient grudge and new mutiny bring an end to the four hundred year reign of the Han dynasty. The once noble empire is divided into three warring states. Dynasty Warriors 4 covers a one hundred year cycle, from civil unrest to the reunification of China under the Jin dynasty.</p><p>Fourth in its series, this game's deep storyline incorporates a host of new features, character depth and insight into the turbulent events of the Three Kingdoms era. Can you succeed as a warrior of honor  and loyalty in the face of adversity? Your obligations to lords and allies guide your path as you fight to unify a divided empire.</p>"},{"name":"Dynasty Warriors 4: Empires","year":2004,"developer":"Omega Force","url":"ps2_collection_part7/Dynasty%20Warriors%204%20-%20Empires%20%28Europe%29.zip","filesize":1045650262,"score":6.9,"genres":"Action > Strategy > Behind view > Hack and slash > China (Ancient / Imperial) > Fantasy > Historical events","desc":"<p>Dynasty Warriors 4: Empires is a strategy-oriented variant of Dynasty Warriors 4, mixing it with gameplay similar to Romance of the Three Kingdoms. The heart of the game, campaign mode, begins by choosing any of 24 regions and 42 rulers (custom characters can be created). Beginning with a small kingdom, the ultimate goal is the conquering of all others. Each turn, the player is given a choice from 4 different governing options (brought to your attention by your generals) followed by a single decision of action. These actions typically include the invasion or defense of a specific province or the option to aid an allied empire with those same actions.</p><p>In any battle, be it offense or defense, the player chooses up to three generals and three lieutenants and their troops to form the army. Soldiers fill the battlefield with different ranks and styles (normal, archers, guards, sorceresses and 2 types of siege weapons) as well as horses which can be riden. The player, in 3rd person perspective, may guard, parry, attack, charge, fire arrows, jump, announce or charge up to unleash a special musou attack. All generals and lieutenants are displayed on the map and may be attacked or challenged. Enemy characters who are defeated enough times in a battle can be challenged to a duel. The obvious goal of the battlefield is to control strongholds at strategic points that will make it easier to defend or reach a certain area or opponent. At any given time, these stronghold areas are under control of either of the two sides. They are won by defeating all of the opposing forces in the immediate area. Strongholds routinely generate health recovery items. The winner of a offensive action can win territory and capture enemy soldiers. Each province under control of an empire nets that empire 100 gold each turn which may be spent on various governing decisions.</p><p>The game also features a 2-player mode where players compete against one another in 4 different styles: Defeat more enemies (Vanquish), Collect more treasure (Pilfer), Knock more enemies off a wall (Melee) and a test of survival (Endurance). The game also features unlockable art galleries and data that can be imported from either Dynasty Warriors 4 or Dynasty Warriors 3: Xtreme Legends.</p>"},{"name":"Dynasty Warriors 4: Xtreme Legends","year":2003,"developer":"Omega Force","url":"ps2_collection_part7/Dynasty%20Warriors%204%20-%20Xtreme%20Legends%20%28Europe%29.zip","filesize":2553278596,"score":7,"genres":"Action > Strategy > 3rd-person (Other) > China (Ancient / Imperial) > Fantasy","desc":"<p>Just like the other Xtreme expansions in the Dynasty Warriors franchise, <em>Dynasty Warriors 4: Xtreme Legends</em> adds more weapons, items, and modes into the mix. Choose one of the 42 characters from the original Dynasty Warriors 4 and raise a body count of several thousand soldiers. The game can be played in conjunction with <em>Dynasty Warriors 4</em>, adding new features to the original game, or it can be played through new levels custom-made for each general.</p><p>The graphics are slightly improved, there are two new difficulty levels (Beginner and Chaos), and three new game modes: Xtreme, Arena Challenge and Legend. Xtreme offers randomly generated skirmishes. Players can earn points and buy new items. Arena Challenge focuses on one-on-one duals while Legend focuses on the strengths and weaknesses of the individual warriors in 42 stages. To play external modes with the new content, the original disc is required. Save data is compatible between the two games.</p>"},{"name":"Dynasty Warriors 5","year":2005,"developer":"Omega Force","url":"ps2_collection_part7/Dynasty%20Warriors%205%20%28Europe%29.zip","filesize":3212413962,"score":6.9,"genres":"Action > Strategy > Behind view > Hack and slash > China (Ancient / Imperial) > Fantasy","desc":"<p>The series returns for yet another iteration removing majority of the features included in Empires and Xtreme Legends. The setting is again ancient China. This time there are 48 different characters to choose from in Musou mode. The majority of the 48 characters have to be unlocked and only 6 new characters have been added to the series. Each character has his or her own storyline.</p><p>There are more enemies to square up against on screen then any previous game in the series. The game uses the same graphics engine as the previous game. Changed for this edition are the bodyguards: they now do a better job of protecting the player character against the enemies. The stronghold system from <em>Dynasty Warriors 4: Empires</em> has been carried over, enabling players to take over an enemy base by killing its leader.</p>"},{"name":"Dynasty Warriors 5: Empires","year":2006,"developer":"Omega Force","url":"PS2_COLLECTION_PART8/Dynasty%20Warriors%205%20-%20Empires%20%28Europe%2C%20Australia%29.zip","filesize":1916236880,"score":6.4,"genres":"Action > Strategy > 1st-person > 3rd-person (Other) > Real-time > Turn-based > Hack and slash > Managerial / business simulation > China (Ancient / Imperial) > Fantasy > Historical events","desc":"<p>Set in ancient China, <em>DW5: Empires</em> brings the Empire mode to the latest DW game, while the basic hack &amp; slash, button mashing gameplay remains the same.</p><p>The Empire mode adds a strategy overlay to the basic game, with a map of 25 areas to conquer. Each turn consists of two parts: empire control, and war making. Your territories bring you tax revenue each turn, which you can spend on various different actions. You can create items and tactics for your generals to use in battle. Recruit generals and troops, fortify your territories, among many other command options. You can wage war on other territories, or may be called upon to defend your own. For each battle you select which generals and lieutenants will fight. There are 4 scenarios to unlock, though they offer little to differentiate each other.</p><p>There is two player split-screen co-op, in either of Empire of Free play modes. Next to the soundtrack of the base game, this edition also adds soundtracks from previous titles, including Dynasty Warriors 2, Dynasty Warriors 3 and Dynasty Warriors 4.</p>"},{"name":"Dynasty Warriors 5: Xtreme Legends","year":2005,"developer":"Omega Force","url":"PS2_COLLECTION_PART8/Dynasty%20Warriors%205%20-%20Xtreme%20Legends%20%28Europe%29.zip","filesize":3657466524,"score":6.4,"genres":"Action > Strategy > 3rd-person (Other) > China (Ancient / Imperial) > Fantasy","desc":"<p>A kind of expansion to Dynasty Warriors 5, <em>Xtreme Legends</em> allows the player to do a lot more with the Romance of the Three Kingdoms generals. Standard battles and co-op are still present, plus a new character creation feature and 'destiny' mode which sees you follow a soldier from grunt to officer.</p><p><em>Xtreme Legends</em> can be played by itself or it can be used with an existing <em>Dynasty Warriors 5</em> save file in order to unlock new content such as battlefields and dozens of characters based on the novels.</p><p>In most respects the game sticks to the tried and tested Dynasty Warriors formula, and the core gameplay boils down to charging one general into the ranks of the enemy and coming out unscathed, all underscored by cheesy rock guitars.</p>"},{"name":"Dynasty Warriors 6","year":2008,"developer":"Omega Force","url":"sony_playstation2_d_part2/Dynasty%20Warriors%206%20%28USA%29.zip","filesize":7111734499,"score":6.1,"genres":"Action > Strategy > 3rd-person (Other) > Hack and slash > China (Ancient / Imperial) > Fantasy > Historical events > Martial arts","desc":"<p>Released in Japan as <em>Shin Sangoku Musō 5 Special</em>, the PS2 version of Dynasty Warriors 6. Six characters that originally had clone move sets from other character (Ma Chao, Yue Ying, Cao Pi, Zhang He, Taishi Ci, and Ling Tong) now have their own weapons and moves and are given their own Musou Mode. Other than those six new stories, the game also features five completely new stages. The new weapons go as follow:</p><ul><li>Ma Chao now has a great sword similar to Fu Xi's rather than a spear</li><li>Cao Pi's short sword is exchanged for a longsword</li><li>Zhang He gets his trademark claws instead of a spear</li><li>Taishi Ci also switched from a spear to his trademark rods</li><li>Ling Tong's three section staff replace his halberd</li><li>Yue Ying switches from a longbow to a bladed crossbow</li></ul><p>The game also has gone through various minor changes, and had dueling and swimming removed. Water bodies are now shallow enough to cross by foot.</p><p>In addition to these changes, the PSP version has Meng Huo, who was missing from the game but added in Dynasty Warriors 6: Empires, as a playable character.</p>"},{"name":"Dynasty Warriors: Gundam","year":2008,"developer":"KOEI Co., Ltd."},{"name":"Dynasty Warriors: Gundam 2","year":2008,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_d_part2/Dynasty%20Warriors%20-%20Gundam%202%20%28USA%29.zip","filesize":2980618849,"score":6.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>Like the previous title this game brings traditional Dynasty Warriors hack'n'slash gameplay to the Gundam franchise. This iteration includes a greatly expanded selection of playable Mobile Suits, now including grunt units like Zaku and Jegan, as well as additional playable characters from the Gundam series <em>War in the Pocket</em>, <em>F91</em>, <em>V Gundam</em>, <em>Turn A Gundam</em>, <em>Gundam SEED</em>, and <em>Gundam SEED Destiny</em>. Another addition are fights against colossal size mobile suits such as the Byg-Zam and Psyco Gundam.</p><p>As in the previous game, Original Mode recounts the events of <em>Mobile Suit Gundam</em>, <em>Zeta Gundam</em>, <em>Double Zeta</em>, and <em>Char's Counterattack</em> from the perspective of each series' protagonist through a series of levels and text interludes. Mission Mode allows the player to select any pilot in the game. Allies and enemies will be made based on who the player chooses to engage in combat, eventually becoming trusted friends or bitter rivals. Each pilot has a series of short story missions in Mission Mode that are mostly based on events from their native series, but altered or expanded to make use of the additional characters in the game. Nearly every Official and Mission Mode level can be played in co-operative mode, and there are also competitive modes (both online and off) that pit players against each other in a race to complete objectives or score kills.</p><p>Pilots grow more powerful as they defeat foes, and they learn new skills from the Mobile Suit they use in combat. A Mobile Suit's stats are derived from its torso and four limbs, each of which can be replaced with better parts by destroying that model MS in combat.</p><p>Besides the variety of game modes and missions there is also a comprehensive library containing information on all Mobile Suits, battleships, and characters in the game.</p>"}]