[{"name":"Eagle Eye Golf","year":2006,"developer":"Telenet Japan Co., Ltd.","url":"PS2_COLLECTION_PART8/Eagle%20Eye%20Golf%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1801380445,"score":"","genres":"Sports > Behind view > Direct control > Golf","desc":"<p><em>Eagle Eye Golf</em> includes 6 game modes (such as a tournament mode, mission mode and survival mode), custom character and golf course creation and a control scheme in which the analog stick controls your swing.</p>"},{"name":"Earache Extreme Metal Racing","year":2006,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART8/Earache%20-%20Extreme%20Metal%20Racing%20%28Europe%29.zip","filesize":2126039745,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Cinematic camera > Real-time > Direct control > Vehicular combat > Physical extras > Licensed","desc":"<p>This vehicular combat game set in Hell revolves around the production of Earache Records, a British label that specialized in death metal and other genres of extreme music. Each selectable vehicle is themed after one of the bands that were on the Earache roster at the time of release, including Deicide, Morbid Angel and Municipal Waste. Every vehicle features a unique weapon, which may be projectile or melee. More tracks and vehicles are unlocked with points, which are accumulated by holding the pole position, eliminating opponents or running over pedestrians: these are zombies that wander aimlessly around the tracks, some of which also offer power-ups. The cars compete against each other in a variety of modes, such as multiple-lap race, deathmatch arena, league and \"zombie massacre\" - a mode where the car that runs over most zombies in the arena wins.</p><p>The track race, league and deathmatch modes are also playable in split-screen multiplayer. The game soundtrack features songs of all the bands represented in the game, as well as of bands from the past Earache roster such as Carcass or Cathedral.</p>"},{"name":"Ecco the Dolphin: Defender of the Future","year":2002,"developer":"Appaloosa Interactive Corporation","url":"PS2_COLLECTION_PART8/Ecco%20the%20Dolphin%20-%20Defender%20of%20the%20Future%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":731478549,"score":7.4,"genres":"Action > Behind view > Direct control > Sci-fi / futuristic","desc":"<p>Hundreds of years in the future, mankind and dolphins live peacefully together and share the earth. Dolphins, who are much more intelligent than they seem, act as the earth's caretakers, while dolphins and humans explore the galaxy. An alien force, known as the Foe, seeks to end this happy existence. The Foe damages the Earth's defense system, and alters history for the worse. One extraordinary dolphin, Ecco, must travel through time to set things right.</p><p>Ecco is a 3d underwater adventure game. There are more than 25 aquatic environments to explore. Ecco must communicate with other ocean creatures and learn to manipulate his environment if he is to succeed in defeating the Foe.</p>"},{"name":"Echo Night: Beyond","year":2004,"developer":"FromSoftware, Inc.","url":"PS2_COLLECTION_PART8/Echo%20Night%20-%20Beyond%20%28Europe%29.zip","filesize":1230924617,"score":6.5,"genres":"Adventure > 1st-person > Sci-fi / futuristic > Horror","desc":"<p>In the year 2044, Richard Osmond and Claudia Seifer take a flight into space in order to be married on Earth's Moon. However during the flight there is an accident and Richard wakes up disoriented and alone. Something strange seems to be going on, and maybe Richard is even seeing ghosts! He has to find Claudia before it's too late, and figure out what's going on.</p><p><em>Echo Night: Beyond</em> is a 1st person adventure game. Controlling Richard, the player moves around picking up and interacting with objects, including security cameras and computer logs. He remains in his space suit which provides a flashlight as well as a heart monitor. As he explores his surroundings on the moon, he's bound to become fearful and a little creeped out. If Richard's heart rate ever goes above 300, he'll die and the game is over.</p>"},{"name":"Ed, Edd n Eddy: The Misadventure","year":2005,"developer":"Artificial Mind & Movement","url":"PS2_COLLECTION_PART8/Ed%2C%20Edd%20n%20Eddy%20-%20The%20Mis-Edventures%20%28Europe%29.zip","filesize":1578495422,"score":5.6,"genres":"Action > Behind view > Platform > Puzzle elements > Licensed","desc":"<p>Ed, Edd, and Eddy are three stupid friends obsessed with one thing and one thing only: jawbreakers! Eddy is the fearless leader, eager to make a quick buck; Ed is the tall, strong, and stupid one, while Edd (or Double-Dee) is the smart, polite neat-freak, who communicates with his family through sticky notes.</p><p><em>Ed, Edd n Eddy: The Mis-Edventures</em> allows you to play as the trio through a series of levels, called 'scams'. Each level is a get-rich-quick scheme dreamed up by Eddy, allowing the Eds to get some jawbreakers. Each level can be accessed via the hub world, the 'Cul-de-sac', where the Eds have their adventures and meet other neighborhood kids.</p><p>Players control all three Eds; more specifically, they're always in control of an Ed, and the other two tag along. You can switch your Ed at any time with the press of a button. Each Ed has their own abilities: Eddy can hurl stink bombs and form a tower to reach high objects, Ed can dig in sandpits, lift and throw objects, and charge at things to smash them, while Double Dee can use his slingshot, activate machines, and be thrown high into the air by the other two Eds.</p>"},{"name":"Ef: A Fairy Tale of the Two.","year":2010,"developer":"minori"},{"name":"Ef: A Fairy Tale of the Two. (Shokai Gentei Tokubetsu DÅkon Han)","year":2010,"developer":""},{"name":"Egg Mania","year":2002,"developer":"HotGen Studios Ltd.","url":"sony_playstation2_e/Egg%20Mania%20-%20Eggstreme%20Madness%20%28USA%29.zip","filesize":298904795,"score":7.4,"genres":"Action > 3rd-person (Other) > Fixed / flip-screen > Arcade > Platform > Puzzle elements","desc":"<p><em>Egg Mania</em> is a puzzle game in which the player controls an egg-shaped character against either a computer opponent or another player via the link cable. The object of the main modes is to build a tower tall enough to reach a balloon at the top of the playfield before the opponent does. If the player tries to take a short cut and not build complete floors, the structure will start crumbling and the water will come up faster. There are plenty of obstacles, both from the game and from competing opponents. Falling meteors can knock the player down into the water, while bombs thrown by the opponent will destroy parts of the player's structure. The main modes include Over Easy and Hard Boiled, the difference being that in the latter a different difficulty can be chosen.</p><p>There are four extra modes: Survival, Solo, Time Trial, and Bomb. In Survival the player must survive as many rounds as possible, while the goal in Solo is to increase the overall score by completing rows and performing combos; Time Trial challenges the player to continually beat his or her own best time; finally, in Bomb, whoever destroys the opponent's tower first wins.</p><p>Compared to the GBA version, the console versions have improved graphics and sound, cutscenes at the beginning of each level, a play area that is wider by one block, two additional modes (8-player Tournament and Custom, where the rules can be customized by activating different options), but lacks the Time Trial mode. Otherwise, they are completely identical, both in gameplay and level design.</p>"},{"name":"Eien no Aseria: Kono Daichi no Hate de","year":2005,"developer":"Xuse","url":"sony_playstation2_e/Eien%20no%20Aseria%20-%20Kono%20Daichi%20no%20Hate%20de%20%28Japan%29.zip","filesize":2600129298,"score":"","genres":"Role-playing (RPG) > Strategy > Anime / Manga > Turn-based > Fantasy","desc":"<p>In <em>Eien no Aseria</em>, you play the role of Yuuto Takamine, a Japanese orphan boy who grew up together with his sister Kaori. One day, shortly after an encounter with a mysterious girl, he is transported into another world, called Fantasmagoria. In this there are several kingdoms which fight each other because of a spiritual energy called \"mana\". Yuuto discovers that his sister is held captive by the king of the country he was teleported. He has no choice but to fight for this country. He doesn't know yet that some of his classmates were transported into other kingdoms, all that being part of a plan to use them as mana-hunters, since they can wield spiritual swords native Fantasmagoria are unable to. </p><p>The game combines elements of Japanese RPG, strategy, and \"dating sim\". Yuuto controls four parties of three characters each. He has to assign strategies to those parties and then send them to fight enemies and to collect mana. The turn-based, first-person perspective battles develop automatically according to your preparations. Yuuto also must fortify the kingdom he fights for, building training grounds, facilities, etc. He'll also dedicate time to romance, trying to win the attention of one of the many beautiful girls he encounters.</p>"},{"name":"Eighteen Wheeler: American Pro Trucker","year":2001,"developer":"SEGA-AM2 Co., LTD."},{"name":"Eizo Play: Megumi","year":2003,"developer":"Pony Canyon, Inc."},{"name":"Eizo Play: Nemoto Harumi","year":2003,"developer":"Pony Canyon, Inc."},{"name":"eJay ClubWorld","year":2002,"developer":"Unique Development Studios AB","url":"PS2_COLLECTION_PART8/EJay%20ClubWorld%20-%20The%20Music%20Making%20Experience%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2839769504,"score":7.4,"genres":"Educational > Side view > Music / rhythm > Music > Licensed","desc":"<p>eJay ClubWorld lets you to create your own hit music without any musical training. Eight real world clubs and locations are available, each with a different music style. Over 10.000 royalty-free samples from House, Hip Hop, Trance, Ambient, Drum &amp; Bass, Acid &amp; Electro, Reggae and Techno  are available for you to choose from and can be mixed using an intuitive interface. In addition, a synthesizer, a drum machine and even a virtual turntable lets you create your own unique sounds. There is also a Video Mode that visualizes your musical creation.Also, up to four players can simultaneously participate in a Live Jam session, where each player controls an instrument.</p>"},{"name":"El Tigre: The Adventures of Manny Rivera","year":2008,"developer":"Blue Tongue Entertainment Pty, Ltd."},{"name":"Endgame","year":2002,"developer":"Cunning Developments","url":"PS2_COLLECTION_PART8/Endgame%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1133264724,"score":6.6,"genres":"Action > 1st-person > 3rd-person (Other) > Shooter > Sci-fi / futuristic","desc":"<p><em>Endgame</em> is an futuristic action light-gun shooter which has been compared to Time Crisis games.</p><p>The story is about an evil plot to use virtual reality mind-control to take over the world. The main character is Jade Cornell, a foxy redhead, whose friend Tyler has gotten too close to the truth. The game starts when Jade receives a message from him telling her where to find the gun he left in her apartment. As soon as she grabs the gun, the door bursts open .. and the first gunfight begins. </p><p>The game is played out in five fast-and-furious chapters, all of which are timed. Jade will trek through exotic European locales (including the Swiss Alps and the London Underground), shooting baddies and bosses. The faster you shoot each wave of enemies the better, as the time saved is added to the next chapter.</p><p>The environment is totally destructible. You can shoot pictures off the walls, shoot cabinets open and have glassware crash to the floor and otherwise wreck much of your surroundings. Also, you can cause explosions that will kill all the enemies in the vicinity.</p><p>Finishing the game the first time unlocks additional modes of play and mini-games.</p>"},{"name":"Endonesia","year":2001,"developer":"VANPOOL Inc.","url":"sony_playstation2_e/Endonesia%20%28Japan%29.zip","filesize":236985545,"score":"","genres":"Adventure > 3rd-person (Other) > Puzzle elements > Fantasy","desc":"<p>In <em>Endonesia</em>, the player takes the role of a boy who went into the park and suddenly found himself in another world. A mysterious voice contacts him and says that this world is called Endonesia, and if he wants to return home, he has to call upon its fifty gods. In order to find the gods, the hero has to communicate with the inhabitants of Endnesia by transferring his own emotions to others.</p><p>Created by  Taro Kudo and  Kazuyuki Kurashima of  Love-de-lic fame, <em>Endnesia</em> is one of the spiritual descendants (along with  Giftpia and  Chulip) of their seminal game  Moon: Remix RPG Adventure. Like those other games, <em>Endnesia</em> is a puzzle-solving adventure with RPG elements such as statistics, item-gathering, and character growth. </p><p>The theme of the game is sharing emotions; gameplay-wise, it translates into puzzle-solving which involves using the right emotion on the right characters at the right time. For example, using the Hunger emotion on an animal will make it hungry, urging it to find food, which will clear the path for the hero.</p><p>Similarly to <em>Moon</em> and its descendants, <em>Endnesia</em> has a day-night cycle. The hero's health meter is depleted due to exhaustion; though the game's world is quite large, the player always has a time limit for his daily activities. The player should also feed the hero; hunger makes his vision blurry and slows down his pace.</p>"},{"name":"Energy Airforce","year":2002,"developer":"Taito Corporation","url":"PS2_COLLECTION_PART8/Energy%20Airforce%20%28Europe%29.zip","filesize":2335498733,"score":"","genres":"Simulation > 1st-person > 3rd-person (Other) > Flight / aviation > Licensed","desc":"<p><em>Energy Airforce</em> is a realistic flight simulator where the player can pilot many real-life military aircraft such as the F/A-22 Raptor, F-16 Fighting Falcon, and X-35 JSF. It takes a similar approach as racing simulator Gran Turismo, requiring the player to train and pass license tests before more advanced missions and aircraft are unlocked, as only the F-16 is unlocked at the start. However, there are also free Dogfight and Arcade modes where an impatient player can jump straight in.</p>"},{"name":"Energy Airforce: aimStrike!","year":2003,"developer":"Taito Corporation","url":"PS2_COLLECTION_PART8/Energy%20Airforce%20-%20Aim%20Strike%21%20%28Europe%29.zip","filesize":2918690863,"score":"","genres":"Simulation > 1st-person > 3rd-person (Other) > Flight / aviation > Licensed","desc":"<p><em>Energy Airforce: aimStrike!</em> is the second title in Taito's military flight sim series, and is greatly expanded over its predecessor. Several new types of aircraft have been added, including the F/A-18 Super Hornet, F-15 Eagle, and A-10 Thunderbolt II, and the need to pass license tests to unlock aircraft has been removed.</p><p>As before, the game includes a wide range of missions, including both air-to-air and air-to-surface missions, and there is also a mission generator called Strike Mode, where the player can set up a wide range of options and play a free mission.</p>"},{"name":"England International Football","year":2004,"developer":"Codemasters","url":"PS2_COLLECTION_PART8/England%20International%20Football%20%28Europe%29.zip","filesize":918775957,"score":"","genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p>This is the only official game of the England soccer team and developed by the makers of the <em>Club Football</em> series, Kuju Entertaiment. <em>England International Football</em> allows the players to play for England as their official team. Simple enough, your goal in this game is to lead the England team squad to the international victory. As the official England football game, it features all the 25 members of the England's team including their Swedish coach. All of them are 3D modeled from their real life counterparts, resulting in some uncannily accurate virtual likenesses. The game uses an improved version of the <em>Club Football 2005</em> game engine. There are some minor improvements in the gameplay such as shooting and improved AI. In the game's menu you will find an European Championship mode where you can battle against twenty of Europe's top national teams. If this is not enough for you, there are extra 12 teams including Brazil, Argentina and Cameroon in another different mode called the World Cup--emulating International Cup mode.</p><p>In addition there is a Create-A-Player system where you get a chance to get involved in the on-pitch action. The game's reward system includes England Trophy Room which is a collection of unlockable rewards such as player profiles, photographs from over the years and even video clips - including England's infamous 5-1 triumph over Germany that can be unlocked if you preform well. Other features include crowd voices recorded from real life matches and commentary from Gary Lineker and Barry Davies. The game includes seven game modes, namely: European Championship, International League, International Cup, Exhibition, Quick Start, Custom Cup and Custom League.</p>"},{"name":"Enter the Matrix","year":2003,"developer":"Shiny Entertainment, Inc.","url":"PS2_COLLECTION_PART8/Enter%20the%20Matrix%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v2.00%29.zip","filesize":3152771292,"score":6.1,"genres":"Action > 1st-person > Behind view > Sci-fi / futuristic > Licensed","desc":"<p><em>In the war to save Zion, what part will you play?</em><em>Enter The Matrix</em> casts the player as Niobe or Ghost, captain and first mate of the rebel ship Logos, respectively. Niobe is a master combatant, capable of beating up everyone in her way. She is an excellent pilot, both in the real world and in the Matrix. Ghost is very adept at firearms, and his marksmanship is a mastery. Both characters are very athletic, and throughout the game the player will have to walk, run, jump, strafe, peek, run on walls, climb ladders and pipes, and fight various enemies.</p><p>Available weapons include a security pistol, an automatic pistol, a submachine gun, a machine gun, a shotgun, and grenades. Besides weapons, a variety of hand-to-hand moves are available, from punches, throws, and grabs to kicks and chokes. Throughout the game, the player will be called upon to utilize Focus moves, which is basically bullet time from the films. When Focused, time slows to a crawl, allowing the player to zoom around enemies, dodge bullets, and jump to avoid oncoming obstacles.</p><p>The game was written and directed by the Wachowskis, and its plot is intertwined with that of the second movie, <em>The Matrix Reloaded</em>.</p>"},{"name":"Enthusia: Professional Racing","year":2005,"developer":"Konami Computer Entertainment Studios, Inc.","url":"PS2_COLLECTION_PART8/Enthusia%20-%20Professional%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1400390152,"score":7.2,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile","desc":"<p><em>Enthusia: Professional Racing</em> is a driving simulation that features hundreds of licensed vehicles from dozens of various manufacturers. The cars vary in type, class, and time periods, so you can find some old timers as well as family cars and test them on the given tracks, race against another player in split-screen mode, or play the Enthusia Life mode and fill in your garage with as many cars as you can hold, or try the Driving Revolution to tune up your driving skills.</p><p>You can drive in first-person view or looking at the car from the typical back third-person view, with some extras you can turn on, such as the VGS (Visual Gravity System) which provides detailed information about car handling and tire traction. The cars in this game are true to their physics (you can see a movie comparison of real car and Enthusia in-game car if you wait a little while on main menu), more than 300 different physics parameters were reproduced for every car.</p>"},{"name":"EOE: Eve of Extinction","year":2002,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART8/E.O.E%20-%20Eve%20of%20Extinction%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1332165203,"score":6.2,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Quick Time Events (QTEs) > Sci-fi / futuristic","desc":"<p>Josh Calloway is an employee of Wisdom Incorporated, well known for its work in gene therapy, genome-based drugs, cloning technology and genetic modification of food. He is subjected to tests day after day, hoping to use his increased abilities for the great of science and technology.</p><p>Little does he know that Wisdom is actually developing LEGACY, a close ranged weapon of great power, hoping to use it to gain military power. Once Josh finally discovers the truth about his new found power, he attempts a daring escape from the base with girlfriend and co-worker Eliel Evergrand. They never made it.</p><p>Now Eliel's soul has been placed inside the core of a new LEGACY weapon, the E.O.E. and Josh holds it inside his modified arm. Only he can put an end to Wisdom's plans, and only he can save Eliel and bring her back to human form.</p><p>Eve of Extinction is a 3D beat 'em up action title, combining onscreen command elements during play (as in Dynamic Cop) to direct you in the right direction, and help you out of harms way. With the weapon-switching technology, you can change weapons during an attack to increase the attacks power on enemies. When bosses are defeated new weapons are awarded including a crossbow and an axe. These can be upgraded using the ley seeds found throughout the game.</p>"},{"name":"Ephemeral Fantasia","year":2000,"developer":"Konami Computer Entertainment Japan, Inc.","url":"PS2_COLLECTION_PART8/Ephemeral%20Fantasia%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":988844228,"score":5.7,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Real-time > Turn-based","desc":"<p>In this game, the player controls Mouse, a silent musician who travels with his talking guitar Pattimo. One day Mouse is invited to play at a royal wedding on an island called Pandule. But soon he discovers that the groom Xelpherpolis has put an awful time-looping spell on the island, and intends to destroy this way the entire population. Mouse has to stop the villain and, most importantly, recruit other people to help him break the spell.</p><p><em>Ephemeral Fantasia</em> is a Japanese-style role-playing game with turn-based combat. Several characters can be recruited to the party. The game's stand-out feature is the time-looping system, which is somewhat similar to the one implemented in  The Legend of Zelda: Majora's Mask. The game has an internal clock, and the first five days repeat themselves until Mouse finds a way to stop it. Certain events occur only if Mouse travels to a specific location at a specific time.</p>"},{"name":"Eragon","year":2006,"developer":"Stormfront Studios","url":"sony_playstation2_e/Eragon%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2975149046,"score":5.7,"genres":"Action > 3rd-person (Other) > Hack and slash > Fantasy > Licensed","desc":"<p><em>Eragon</em> is a third-person, fixed camera action adventure game based off of the plot of the movie of the same name. One or two players can fight as Eragon through the world of Alagaesia, with drop-in drop-out coop support. In addition to lots of fighting combos and team attacks, the player can unleash magical attacks on his enemies. There are also a number of dragon flying levels, with the player(s) controlling the powerful Saphira as she cleaves through hordes of enemies. The 360 version of this title contains additional levels and enemies.</p>"},{"name":"Erde: Nezu no Ki no Shita de","year":2002,"developer":"KID Corp.","url":"sony_playstation2_e/Erde%20-%20Nezu%20no%20Ki%20no%20Shita%20de%20%28Japan%29.zip","filesize":1852973752,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p><em>Erde</em> is a romance visual novel adventure game set in a near future with a slight fantasy elements. The gameplay, like in most visual novels, consists of reading through descriptions and dialogues, and selecting choices where presented which branch the story or take the events in a certain direction. The protagonist of the game is a village boy named Takumi. The game settings consist of an actual world which is set around the village Takumi lives in, and a virtual world which can be accessed using special bed-like terminals. One day, a girl on a motorcycle crashes into his house, leaving the hole in the wall. As chance has it, she'll need to stay until she fixes her bike and make it mobile again so she can get back on the road and see the world. Yoko's aspiration to see the world does not leave Takumi indifferent and he starts to ponder the idea himself.</p>"},{"name":"Erementar Gerad: Matoe, Suifu no Ken","year":2005,"developer":""},{"name":"ESA Charity Game Pack","year":2005,"developer":""},{"name":"Escape 03","year":2003,"developer":""},{"name":"Escape from Monkey Island","year":2001,"developer":"LucasArts Entertainment Company LLC","url":"PS2_COLLECTION_PART8/Escape%20from%20Monkey%20Island%20%28Europe%29.zip","filesize":1428720948,"score":7.4,"genres":"Adventure > 3rd-person (Other) > Cinematic camera > Graphic adventure > Puzzle elements > Direct control > Sea pirates / Caribbean > Comedy","desc":"<p>Guybrush Threepwood has finally defeated the zombie pirate LeChuck, and married his sweetheart Elaine Marley. The happy couple is returning home from an exciting honeymoon. But as they arrive on Melee Island, they notice some very strange changes. A mysterious stranger who calls himself Charles L. Charles is organizing a campaign to become the next governor. The Australian businessman Ozzie Mandrill is turning the Caribbean into an attraction for tourists. And on top of that, Elaine's mansion is being demolished! Naturally, it's up to our hero to revert the things back to normal, even if that means traveling to exotic islands and solving puzzles on the way.</p><p><em>Escape From Monkey Island</em> is a direct sequel to  The Curse of Monkey island, and is the fourth game in the  Monkey Island series. The gameplay relies mainly on inventory-based puzzles and branching dialogues, just like in the previous installments. The interface is similar to that of  Grim Fandango: mouse is not used, and the interaction is done via context-sensitive commands that appear on the screen whenever you navigate Guybrush close to an object. The game utilizes pre-rendered backgrounds and 3D character models.</p>"},{"name":"Espgaluda","year":2004,"developer":"CAVE Co., Ltd.","url":"sony_playstation2_e/Espgaluda%20%28Japan%29.zip","filesize":272915648,"score":"","genres":"Action > 3rd-person (Other) > Top-down > Arcade > Shooter","desc":"<p><em>Espgaluda</em> is a vertically scrolling shooter. You are given the option of controlling one of two siblings, Ageha (faster but with narrower shooting capabilities) or Tateha (slower but with a wider attack). As you fly through the various stages various mechanical enemies attack with a very significant number of bullets, often nearly filling the screen. Aside from the regular shots, Ageha and Tateha also have additional abilities which help the player navigate through the numerous bullets. The first is a guard barrier; when activated the player is immune to collisions and as a bonus when the barrier button is released a more powerful laser shot is fired. A meter at the bottom of the screen indicates how much power is left in the barrier. The second ability is called the Kakusei mode; when this mode is activated your character switches sex and is able to fire a more powerful shot. More importantly, when this mode is activated all of the enemies and their bullets slow down considerably while the players speed remains the same making it easier to navigate through a tricky pattern of bullets. Activating Kakusei mode will rapidly deplete the players supply of green gems; since the number of gems isn't limitless the player may not be able to remain in Kakusei mode for long. When not in Kakusei mode additional gems can be collected by destroying the various enemies. If the player completely runs out of gems, enemy bullets begin travelling faster than usual. Another bonus in the game is gold inguts which greatly increase the players score. These are found when in Kakusei mode; when an enemy is destroyed, all of its bullets will turn into ingots which can be collected by the player.</p>"},{"name":"ESPN College Hoops","year":2003,"developer":"Kush Games, Inc.","url":"sony_playstation2_e/ESPN%20College%20Hoops%20%28USA%29%20%28v1.03%29.zip","filesize":2753241212,"score":7.5,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>ESPN College Hoops</em> is the second of Sega's college basketball games and follow-up to NCAA 2K3, to which it adds several new gameplay modes and other enhancements. It also carries over several of ESPN NBA Basketball's improvements in controls and graphics.</p><p>Returning game modes include Quick Play, Exhibition, Season, Legacy, Tournament, Practice and Gym Rat. The Legacy mode has redesigned menus and adds full season recruiting via assistant coaches, scout visits of high school games and a new trophy room. New modes include Rival mode, which lets players set up quick games that feature classic school rivalries, and Slam Dunk Challenge. The Challenge offers five different dunk competitions: Beat the Clock, Style, Horse, Dunk-O-War (who can fire up the crowd the most, needs to be unlocked) and a Championship of all modes. Dunks are executed through QTE-style pressing of buttons in the correct order in quick succession. Players can create their own schools in the new Create-A-School mode, allowing for customization of mascot, fight song and even floor type.</p><p>On the court, major changes include IsoMotion controls similar to those seen in <em>ESPN NBA</em>, which allow a variety of new offensive moves and manual stealing on defense through use of the right thumbstick. Also new are ability icons, which quickly indicate a player's special skill (speed, 3-point-shots, defense or star quality).</p><p>The game features many unlockables in the Campus Store. Currency for the store is earned by completing challenges on the court, which can then be spent to unlock mascot teams, alternate uniforms, professional and fantasy courts and classic teams.</p>"},{"name":"ESPN College Hoops 2K5","year":2004,"developer":"Visual Concepts Entertainment, Inc.","url":"sony_playstation2_e/ESPN%20College%20Hoops%202K5%20%28USA%29.zip","filesize":3450315417,"score":7.4,"genres":"Sports > 3rd-person (Other) > Isometric > Basketball > Licensed","desc":"<p>College Hoops 2K5 offers a comprehensive college basketball experience.  Go through Legacy Mode to bring a small college respect and eventually earn a job with a major program.  Go online to test your skills against players around the world.</p>"},{"name":"ESPN International Track & Field","year":2000,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"PS2_COLLECTION_PART8/ESPN%20International%20Track%20%26%20Field%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":381099716,"score":7,"genres":"Sports > 1st-person > 3rd-person (Other) > Diagonal-down > Licensed","desc":"<p>Compete in twelve international track &amp; field events ranging from 100m dash to hammer throw. Most of the action is done via button mashing and timed button presses, similarly to the now classic NES Track &amp; Field games.</p>"},{"name":"ESPN International Winter Sports 2002","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"sony_playstation2_e/ESPN%20International%20Winter%20Sports%202002%20%28USA%29.zip","filesize":380523896,"score":6,"genres":"Simulation > Sports > 3rd-person (Other) > Behind view > Olympiad / mixed sports > Snowboarding / skiing > Licensed","desc":"<p>While not officially endorsed by the Winter Olympics, the game is modeled closely to it with 10 events that include skiing, curling, bobsledding, figure skating among more. The gameplay for each event varies, but feature similar controls that require the player to tap a set of buttons when prompted for control, speed, etc. Depending on if the player hits the required buttons successfully and the timing will determine the outcome of these events.</p><p>There are four different gameplay modes that include <em>Championship</em> which lets the player compete in a series of events to win the coveted gold medal and <em>Head-to-Head</em> which allows two players to compete against each other. It also features the ESPN license which adds to the realism with a TV-style presentation along with announcers for in-game commentary.</p>"},{"name":"ESPN Major League Baseball","year":2004,"developer":"Visual Concepts Entertainment, Inc.","url":"sony_playstation2_e/ESPN%20Major%20League%20Baseball%20%28USA%29.zip","filesize":1268619467,"score":7.4,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>ESPN Major League Baseball is the successor to Sega's World Series Baseball 2k3. Back are all of the game play modes from last years release:  exhibition, playoffs, season, and franchise. Additionally, gamecast, duel, situation and GM career have been added to the game.</p><p>In gamecast mode, you can manage and watch a game as it progresses, make substitutions and then jump into the action when you want to.</p><p>In duel mode, you'll pick a pitcher and hitter and duke it out against the computer to see who can get the most hits and who can throw the most strikes.</p><p>In situation mode, you can set the field up how you want to and change a number of settings like how many players on base to what inning it is and who is up to bat so you can figure out your ultimate 'what-if' scenario.</p><p>In GM career mode, you'll need to run a franchise while keeping your owner happy. Got an owner who is financially conscious? He'll want you to make sure you hire only moderately priced players and do reasonably well. Get a maverick, and you'll get a longer leash, a bit more money, but the added pressure of needing to take your team to the playoffs.</p><p>All 30 MLB teams are included with their stadiums along with 16 different all-star teams. It also has 6 classic stadiums and a team made up of the greatest players of all time. Each team also has a number of alternate and throwback jerseys. Also, new is the ESPN authentic feel in the form of graphics and play break downs. Get a particularly nice strike out and you'll get to see the trajectory with ESPN K-Zone. Strike someone out three times in a row and Rex Hudler and Jon Miller will applaud you for a job well done.</p><p>You can also use the X-box version to grab the latest roster or play against someone online in an exhibition game on either the PS2 or the X-box version.</p>"},{"name":"ESPN MLS Extra Time","year":2001,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"sony_playstation2_e/ESPN%20MLS%20ExtraTime%20%28USA%29.zip","filesize":401440199,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p><em>ESPN MLS Extra Time</em> is the first soccer game created by Konami's Hawaiian Studio and borrows the game engine from the ISS series but is built from the ground up for the MLS (Major League Soccer) license.</p><p>It features all 12 MLS teams of the time including 53 International soccer teams as well as 4 MLS All-Star squads to choose from along with the top players of the day with over 500 individual character animations available with authentic facial mapping. It also features authentic 3D world arenas, authentic uniforms and logos of the MLS and International squads and has five different modes to choose from including <em>Exhibition</em>, <em>League</em> and <em>Match Play</em>.</p><p>It features a TV-style presentation in cooperation with ESPN and has two different language options, English and Spanish, with their separate commentators: The English commentator is ESPN anchor man Bob Ley while the Spanish commentator is Louis Tapia, most notably famous for his trademark \"GOOOOOOOOAAAAALLLLL!!!!\".</p>"},{"name":"ESPN National Hockey Night","year":2001,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"PS2_COLLECTION_PART8/ESPN%20National%20Hockey%20Night%20%28Europe%29.zip","filesize":466912581,"score":6,"genres":"Sports > Diagonal-down > Hockey > Licensed","desc":"<p>National Hockey Night includes the gameplay options that are standard for hockey games. There is exhibition mode for up to two players, season mode, create-a-player mode, and a playoffs mode. The seasons can be 29 or 82 games long. Statistics are tracked in 10 categories, and players get on hot or cold streaks as the season wears on. The create-a-player option allows you to max out a player's abilities in six different categories, choose from four different facial patterns, and adjust the player's height and weight. All 30 NHL teams are included.</p><p>The graphics represent an ESPN NHL broadcast.  The team of Steve Levy and Gary Thorne handles the announcing duties for the games ESPN-style announcing.</p>"},{"name":"ESPN NBA 2K5","year":2004,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART8/ESPN%20NBA%202K5%20%28Europe%29.zip","filesize":2568246867,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>New to this year's version is the \"Association\", which is a new feature of Franchise mode. With it, Franchise mode features new simulation models and allows you to manage key attributes of your team, such as weekly training and team chemistry.</p><p>Franchise mode also gives you the ability to play games on a play-by-play basis, like a management game, while letting you control everything and giving you replays to see what happened.</p><p>Control wise, the game features the same Iso Motion as found in last year's title, but also gives you options depending on your player. <em>2K5</em> uses a new momentum system which factors the player's ability in deciding what he can do. A short guy, who can't run very fast or jump very high, won't be able to score a lot of dunks.</p><p>24/7, the \"story\" mode of last year's game, has returned with some new features. You get over one hundred new items, a respect system, the ability to play multiplayer games, and new timed mini-games.</p><p>Like all of the <em>2K5</em> titles, this one has the standard ESPN presentation, which includes camera angles, follow-cams, stat overlays, and running commentary. Commentators include Michele Tafoya, who reports from the sideline, and Bill Walton, a hall of famer, as the commentator.</p><p><em>ESPN NBA 2K5</em> has online play over Xbox Live (Xbox only), as well as the PlayStation 2's online service.</p>"},{"name":"ESPN NBA 2Night","year":2000,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"PS2_COLLECTION_PART8/ESPN%20NBA%202Night%20%28Europe%29.zip","filesize":454226344,"score":5.4,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p><em>ESPN NBA 2night</em> is a basketball game with an ESPN license. It features all the NBA teams and players and allows you to create your own player. Gameplay is a mixture between arcade and simulation style play. Game modes include: Practice, Pre-Season, NBA Season, Enhanced Season and Tournament.</p><p>In-game commentary is provided by anchormen Stuart Scott and Brent Musberger.</p>"},{"name":"ESPN NBA 2Night 2002","year":2002,"developer":"Konami OSA Ltd.","url":"sony_playstation2_e/ESPN%20NBA%202Night%202002%20%28USA%29.zip","filesize":455409684,"score":6.1,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>Another in a long line of basketball titles and a sequel to ESPN NBA 2Night. This game features updated rosters, new character animations and the obligatory game modes: exhibition, playoffs, season, franchise and also features a soundtrack with musicians like Pete Rock and DJ Hi-Tek. It can support up to four players and features the voice talents of ESPN Sportscenter newscaster Stuart Scott and not only is in conjunction with ESPN but also is endorsed by Tracy McGrady.</p>"},{"name":"ESPN NBA Basketball","year":2003,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART8/ESPN%20NBA%20Basketball%20%28Europe%29.zip","filesize":1541404278,"score":8.5,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p><em>ESPN NBA Basketball</em> is the follow up to last years NBA 2K3.</p><p>Using Sega's exclusive license with ESPN, the game's presented like you were watching an NBA broadcast. There are stat overlays, pre-game, half-time and end-game shows, action replays, and various other animations.</p><p><strong>ESPN NBA Basketball</strong> has all the standard game modes, from quick game to practice, as well as additional modes, such as one-on-one and street basketball, where you can compete in a variety of games, such as being the first player to score twenty-one. It also comes standard with franchise mode, which lets you lead a team of your choice to victory (or defeat) in multiple seasons.</p><p>The newest and biggest mode of the game is 24/7, which starts you off as a nobody basketball player in a local gym. You must win matches to improve your stats (scoring two three pointers in a row will increase your long shot stat, etc.), and you have to take on \"bosses\" to get further. Beat a \"boss\", and he'll give you his cell phone number, which you can then use to call him for help if you need a partner for a doubles game.</p><p>The game introduces the IsoMotion control systems, which is designed to help you pull off certain moves. By moving the right analog stick, you can perform more advanced dekes, spins and fakes. The IsoMotion moves also have an opposite effect, and using it too much may result in you being charged with a personal.</p><p>Both systems offer online play. The PlayStation 2 lets you play on a narrow or broadband connection, and has PS2 only leagues you can take part in.</p><p>There are a ton of specials to unlock by completing various tasks. If you make a total of fifteen double-double's, you can unlock a new team, or score five hundred points total to unlock some new music or background colors.</p><p><strong>ESPN NBA Basketball</strong> features all the standard NBA teams, including the New York Knicks and the Toronto Raptors. There are also special teams, and the game gives you the ability to create your own player or team.</p>"},{"name":"ESPN NFL 2K5","year":2004,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART8/ESPN%20NFL%202K5%20%28Europe%29.zip","filesize":3661000026,"score":8.7,"genres":"Sports > 1st-person > Diagonal-down > Direct control > Multiple units/characters control > Football (American) > Licensed","desc":"<p><em>ESPN NFL 2K5</em> has a ton of new features for the new season.</p><p>To start off, the ESPN presentation has been greatly expanded. Chris Berman, who did voiceover for the half-time show in 2K4, returns for this season. Instead of just voice, there is a virtual Chris Berman, who does an introduction to each game, a half-time report, and a post-game show. To illiustrate certain points, he uses replays from each game. Every move you pull off of every quarter of every game is saved and used in these replays (Xbox only). Suzy Kobler gives reports from the sideline.</p><p>One new feature is the V.I.P. system, which keeps track of how you play the game. If you pass 80% of the time, and run 20% of the time, your V.I.P. profile will reflect this. At a later time, you can play against your V.I.P., and the AI will play as if it were you.</p><p>ESPN celebrates it's 25th anniversary this year, and as such, a special 25th Anniversary Mode has been added. This mode allows you to play moments from classic football games, including The Heidi Bowl and The Immaculate Reception.</p><p>The Crib has an overhaul this year. Instead of earning specific items by completing tasks, you earn points, which you can use to buy items of your choice. New to the Crib is a dart board, as well as a phone, which you will use to answer calls from celebrities. You may get a call from Steve-O, Carmen Electra, Jamie Kennedy, David Arquette or Funkmaster Flex, challenging you to a game.</p><p>Franchise mode also gets an overhaul. New to 2005 is the ability to schedule weekly preps for your team. You can choose to have players work out, play practice games, watch tapes, all in an effort to gear your team up for the next game.</p><p>ESPN NFL 2K5 can be played over Xbox Live, with future support for leagues. The game is also \"always connected\", as long as you have an internet connection. This allows it to keep buddy lists up to date, see friends, receive requests, all the time, whether you're actually playing an online game or not. Roster updates will be available in the future.</p>"},{"name":"ESPN NFL Football","year":2003,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART8/ESPN%20NFL%20Football%20%28Europe%29.zip","filesize":3173069709,"score":8.5,"genres":"Sports > 1st-person > Diagonal-down > Direct control > Multiple units/characters control > Football (American) > Licensed","desc":"<p>While the title of this game boasts the ESPN license, this is actually the next game in Sega's NFL 2K series.</p><p>ESPN NFL Football has many gameplay modes that include quick game, franchise, season, tournament, practice, first-person football, and online play. The most extensive mode in the game is the franchise mode. This mode allows you to play one season after another and comes complete with a draft and off-season player dealings, like signing and releasing players, governed by the real rules of the NFL, where trade deadlines and salary caps are standard.</p><p>Another new feature in ESPN NFL Football is a virtual apartment called 'The Crib.' The Crib serves as a showcase for all of the bonus items and awards you win by completing objectives. The objectives range from simple accomplishments, like looking at certain things in the game's menu, playing for one hour, and playing for five hours, to big play accomplishments, like returning a punt or kick for 99 yards or completing a game without dropping any passes. With every completed objective, you earn a trophy or item that you can use to decorate your crib. The items range from different-looking furniture, like couches and bar stools, to bobble heads and in-game cheats. You can also find hidden free agents, like Michael Irvin, and posters and soundtracks from old Sega games, like Jet Set Radio and previous NFL 2K games.</p><p>Another feature added to this game is first-person football.  This setup was created to give you a virtual experience of what it's like playing on the field.</p><p>Chris Berman again adds ESPN style commentary for the audio track.</p>"},{"name":"ESPN NFL Primetime 2002","year":2001,"developer":"FarSight Technologies Inc.","url":"sony_playstation2_e/ESPN%20NFL%20PrimeTime%202002%20%28USA%29.zip","filesize":612587414,"score":5.9,"genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p>ESPN NFL Primetime 2002 is the first football game to combine the NFL license with the ESPN license.  This NFL adaptation boasts a comprehensive franchise mode that introduces some innovations in this standard mode.  One of these is a draft ticker, which puts your team on the clock each time it selects a player in the draft. With the draft ticker on, it is important to scout college players beforehand and analyze draft positions and team needs in order to preselect your team's draft candidates. In simulated games, NFL Primetime gives a variety of coach options. Here you can customize your team's aggressiveness level in offense and blitz tendencies and even set spies on more mobile quarterbacks for simulated games. Naturally, there are also obvious franchise mode options such as the ability to draft, trade, and sign/release free agents over multiple seasons.</p><p>The game also provides the standard football modes of exhibition and season play.</p><p>The cutscenes between plays give the game a TV-style presentation, which borrows graphics from the ESPN Primetime show.</p><p>Chris Berman and his Primetime sidekick, Tom Jackson, provide the commentary during games.</p>"},{"name":"ESPN NHL 2K5","year":2004,"developer":"Kush Games, Inc.","url":"PS2_COLLECTION_PART8/ESPN%20NHL%202K5%20%28Europe%29.zip","filesize":2694239701,"score":8.4,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p><em>ESPN NHL 2K5</em> is the second hockey game using Sega's partnership with the worldwide leader in sports, ESPN.</p><p>As with any sports game, you get the standard game modes. 2K5 has a vastly improved Franchise mode over last year's game. In addition to the e-mail system that was introduced, you have the ability to hire several coaches. You can choose a head coach, offensive coach, defense coach, scouting coach, a goaltending coach and more. When it comes time to hire and fire players, you use actual money, and not points to negotiate contracts.</p><p>There are a few special game modes as well. You have access to the skills mode, which was also found in last year's game. You can choose accuracy shooting, puck control, hardest shot, fastest skater, and a few more. There is also a Party Mode, which is set up for one to four players (you and friends or you and the computer), which pits you in fast action games. An example is a free-for-all, where you have to get the puck and score it in the net while the constantly moving cinder wall, which blocks the net, is down.</p><p>Like last year's game, 2K5 features multiplayer hockey over Xbox Live (Xbox) and PlayStation 2's network service. You can jump into a game, or create or join a league of friends and foes.</p><p>The Skybox is back, and it's been slightly improved. Like in <em>ESPN NFL 2K5</em>, you earn points by completing tasks, such as scoring five goals in a single period, winning ten faceoffs, etc. You then use these points to purchase unlockables which will adorn your Skybox or allow you to play as special teams. You can also unlock retro jerseys. Once you win a trophy, it's added to your Skybox, with the Stanley Cup being the center of attention. There are three mini-games you can play from your Skybox; air hockey, shuffleboard, and a trivia machine.</p><p>For those who have an Xbox, you will have the ability to import the music on your harddrive and set songs (or bits of songs) to play for various events. You can choose to play something like Ozzy Osbourne's \"Crazy Train\" for the stadium intro, something uplifting for when you score or something insulting for when you get scored on. If you like doing a lot of work, you can even set different events depending on the stadium, so if you want \"Crazy Train\" to play in Anaheim for the stadium intro, but want \"Dragula\" in Detroit, you can.</p>"},{"name":"ESPN NHL Hockey","year":2003,"developer":"Kush Games, Inc.","url":"PS2_COLLECTION_PART8/ESPN%20NHL%20Hockey%20%28Europe%29.zip","filesize":1408163528,"score":8.2,"genres":"Sports > Diagonal-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>ESPN NHL Hockey is the latest addition in Sega's NHL 2K series of games that just happens to add an ESPN license to the graphics and title.</p><p>As in the previous version (NHL 2K3), you can once again perform checks into the benches, pin opponents on the boards, and design penalty killing and power-play strategies.  </p><p>ESPN NHL Hockey adds a revamped franchise mode. This year's franchise mode includes an e-mail system that sends you notices about team injuries, current playoff statuses, and trade deadlines. Even simple words of encouragement are emailed from the team owner.</p><p>The skybox mode acts as a hub for the game's unlockables, stat tracking, and other random features.  There are two new gameplay modes in this year's game: skills and mini-games. Skills mode is a re-creation of the exhibition competitions held during the NHL All-Star weekend. You find a number of different competitions, including the hardest-shot competition, a shoot-out relay, a puck-control challenge, a fastest-skater competition, and a shooting-accuracy challenge. The roster of mini-games include pond hockey, mini-rink, shootout, and super-speed hockey.</p><p>ESPN NHL Hockey has plenty of unlockables, including classic jerseys, teams, and goalie masks. There are even a couple of unlockable mini-games.</p>"},{"name":"ESPN Winter X Games Snowboarding","year":2000,"developer":"Konami OSA Ltd.","url":"sony_playstation2_e/ESPN%20Winter%20X%20Games%20Snowboarding%20%28USA%29.zip","filesize":1423745743,"score":6.8,"genres":"Sports > Behind view > Direct control > Snowboarding / skiing > Licensed","desc":"<p><em>ESPN Winter X Games Snowboarding</em> is a snowboarding game based on the ESPN Winter X Games event. The game's license allows for a multitude of professional snowboarders, boards and apparel to be present within the game. Game modes include Snowboarder, Session, Free Ride and Movie mode. Snowboarder is a career mode where you have to perform in games that are taken directly from the Winter X Games event itself and include: Big Air, Boarder Cross, Halfpipe and Slopestyle. Each of these games can be played with up to four players or AI opponents in X Games and Session modes. Free Ride allows you to do whatever you want in on a large slope and challenge friends to races. Movie mode is a collection of movies from professional snowboarders.</p>"},{"name":"ESPN Winter X Games Snowboarding 2002","year":2002,"developer":"Konami OSA Ltd.","url":"sony_playstation2_e/ESPN%20Winter%20X%20Games%20Snowboarding%202002%20%28Japan%29.zip","filesize":1792360328,"score":6.8,"genres":"Sports > Behind view > Direct control > Snowboarding / skiing > Licensed","desc":"<p>This is the sequel to the previous year's incarnation, ESPN Winter X-Games Snowboarding. This one features 13 professional snowboarders along with 20 authentic tracks sponsored by the Winter X Games. Not only can players compete in authentic events, they can also garner sponsors in order to buy better equipment and can make their own video highlights and show off to friends as well. Players can pull of combos with the \"linking system\", producing wild stunts and gaining higher scores.</p>"},{"name":"ESPN X Games Skateboarding","year":2001,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"sony_playstation2_e/ESPN%20X%20Games%20Skateboarding%20%28USA%29.zip","filesize":423505660,"score":5.9,"genres":"Sports > Behind view > Tricks / stunts > Skateboarding > Licensed","desc":"<p><em>ESPN X Games Skateboarding</em> lets players experience a simulation of actual skateboarding based on the extreme sporting event, the X Games, that are held annually. The player can choose from eight different real-life skateboarding pros such as Chad Fernandez, Lincoln Ueda, Kerry Getz, Bob Burnquist, Rick McCrank, Colin McKay, Chris Senn, and Carlos DeAndrade and may choose from 64 different authentic licensed skate board designs and equipment.</p><p>The main goal of the game is to travel through various locations in three cities, Los Angeles, San Francisco, and New York, competing in a series of events with the main purpose to pull of tricks and stunts with more points being awarded to more complex and trickier stunts. Players may compete in official X-Games locations or choose for more exotic locations like a museum or a cruise ship. It also features music from Linkin Park and Voodoo Glow, among many others.</p>"},{"name":"Eternal Poison","year":2008,"developer":"Flight-Plan Inc.","url":"sony_playstation2_e/Eternal%20Poison%20%28USA%29.zip","filesize":1956436231,"score":7.1,"genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p>In the Kingdom of Valdia, the Princess is kidnapped by demonic forces of the Realm of Besek, known as Majin. It is also said that the Majin guard a secret treasure, the Eternal Poison. Responding to the King's call, many adventurers head off to the Princess' rescue, but what are their incentives, and is it really the Princess they're looking for?</p><p><em>Eternal Poison</em>, also known as <em>Poison Pink</em>, is a strategy role-playing game by the Summon Night series creator, set in a dark fantasy/gothic environment. In the same vein as most tactical RPGs, battles are performed in turn-based style, in a grid-based battlefield. The player may choose to battle demons or to capture them in order to use them as allies in his party. Returning to his base, the player may purchase weapons, build up his army and customize his \"Majin\" or transform them to special items. The story is told from the perspective of five different parties, and the choices made can define the outcome.</p>"},{"name":"Eternal Quest","year":2002,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART8/Eternal%20Quest%20%28Europe%29.zip","filesize":85780385,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Fantasy","desc":"<p><em>Eternal Quest</em> takes the player to the land of swords, sorcery and maze-like underground lairs, in which they must defeat monsters, collect better equipment, acquire gold (to buy better equipment). Descend lower in the game's 50 leveled dungeon in the story mode which is about a shogun who summons a champion (you) to save his shogunate from an evil presence once and for all.</p><p>The gameplay is very similar to Nethack, and other \"roguelike\" games. The game is turn based, and as you take a step, so does every monster in the level. When you're standing still, so does everything else in the game. Also, like in some \"roguelike\" games, levels in this one are randomly generated.</p>"},{"name":"Eternal Ring","year":2000,"developer":"FromSoftware, Inc.","url":"PS2_COLLECTION_PART8/Eternal%20Ring%20%28Europe%29.zip","filesize":724590388,"score":5.5,"genres":"Role-playing (RPG) > 1st-person > Action RPG > Fantasy","desc":"<p>Cain Morgan is the adopted son of the leader of the Security Force in the kingdom of Heingaria. One day, Cain has a strange dream that brings back memories from his childhood, when his native country Solcia was invaded by the neighboring Aldine. All he remembers is that \"everyone went to the island\". This mysterious Island of No Return is presently of great interest to the king, who is trying to find why the Elders sent a research team there. The island is rumored to harbor a ring with unseen powers, and the king secretly dispatches Cain to investigate the fate of the people who had ventured there and disappeared without a trace.</p><p><em>Eternal Ring</em> is a first-person action role-playing game similar in concept to King's Field series. It is focused on exploring interconnected dungeons, fighting enemies within. Compared to King's Field games, its world is smaller and less open. With a few exceptions, the only type of weapon Cain can use are swords. However, weapons play a relatively small role in the game, and there is also no armor. The gameplay system largely relies on magic spells that the player can gain by equipping special rings and imbuing them with gems.</p><p>The spells and the gems containing them come in six different elemental flavors: Fire, Water, Earth, Wind, Light, and Darkness. The player creates rings by experimenting with different types of gems, resulting in various effects. Up to six gems can be placed on both sides of a ring. Gems also have different levels which affect the outcome of the experiment. The resulting rings may modify Cain's attributes, increase his affinity for a particular element, provide auxiliary bonuses, or grant Cain powerful attack spells.</p>"},{"name":"Etude Prologue - Yureugoku Kokoro no Katachi","year":2006,"developer":"Takuyo Co., Ltd.","url":"sony_playstation2_e/Etude%20Prologue%20-%20Yureugoku%20Kokoro%20no%20Katachi%20%28Japan%29.zip","filesize":1329102856,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>While originally released in 1998 for Windows and Sega Saturn, this PlayStation 2 release came out 8 years later and contains many changes and updates. Basically, the game has been completely renewed, it contains new voice acting, new artwork, new music, and new gameplay system. The script has also been updated and extended resulting in much longer game story.</p><p>The PSP release which shares the same title as PS2 version, includes all the changes that were done in the PS2 version, and in addition it features the \"Little Aid\" sub-scenario which takes place a year before the main story. PSP version also uses widescreen aspect ratio which shows more of the picture than earlier versions.</p>"},{"name":"Eureka Seven Vol. 1: The New Wave","year":2005,"developer":"BEC Co., Ltd.","url":"sony_playstation2_e/Eureka%20Seven%20Vol.%201%20-%20The%20New%20Wave%20%28USA%29.zip","filesize":1100583218,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p><em>Eureka Seven Vol. 1: The New Wave</em> is an action game based on the Eureka Seven anime and manga series though it features an original storyline and characters and is set before the show. The game follows a boy named Sumner Sturgeon who dreams of becoming a LFO (mech) pilot.</p><p>Gameplay includes mech based combat using melee and long range projectiles to neutralize the opponent on the ground or in the air. There are also parts where the player walks around the airbase and can talk to NPCâ€™s or race on a hover board. Itâ€™s also possible to customize the weapons and part for the mech. The game was followed by a sequel named Eureka Seven Vol. 2: The New Vision.</p>"},{"name":"Eureka Seven Vol. 2: The New Vision","year":2006,"developer":"BEC Co., Ltd.","url":"sony_playstation2_e/Eureka%20Seven%20Vol.%202%20-%20The%20New%20Vision%20%28USA%29.zip","filesize":1488625374,"score":5.1,"genres":"Action > 3rd-person (Other) > Anime / Manga > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p><em>Eureka Seven Vol. 2: The New Vision</em> is an action game based on the Eureka Seven anime and manga series and the sequel to Eureka Seven Vol. 1: The New Wave. Sumner Sturgeon, the hero from the first part is now on the run from the military who want him dead.</p><p>Gameplay is largely similar to part 1 and includes mech based combat using melee and long range projectiles to neutralize the opponent on the ground or in the air. Itâ€™s also still possible to walk around and talk to NPCâ€™s or race on a hover board. The game offers over fifteen different vehicles to pilot and mechs weapons can be customized.</p>"},{"name":"Euro Rally Champion","year":2004,"developer":"Brain in a Jar Ltd.","url":"PS2_COLLECTION_PART8/Euro%20Rally%20Champion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":101532462,"score":"","genres":"Racing / Driving > Sports > 1st-person > 3rd-person (Other)","desc":"<p>Euro Rally Champion is a simple rally simulation that could be described under the number 2 symbol : two game modes (championship, timed race), two skill levels (easy, normal), two game options (automatic or manual transmission, autosave or not).</p><p>You drive in various countrysides, mountains, but also in Africa and even in a closed circuit ! You will have first to choose your driver, and car, then fine tune it before the race.</p>"},{"name":"European Tennis Pro","year":2003,"developer":"Magical Company Ltd.","url":"PS2_COLLECTION_PART8/European%20Tennis%20Pro%20%28Europe%29.zip","filesize":270486021,"score":"","genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p><em>European Tennis Pro</em> is a tennis game for one or two players, or up to four with multi-tap.</p><p>The game does not feature any star names or licensed locations. In addition to the training mode the player(s) can either compete in an exhibition match or a world tour. Exhibition matches can have either a tie break, a three game set or a six game set format and can last for one, three or five sets, and the player(s) have a choice of five different surfaces to play on. The world tour consists of twenty-four different venues and the player can select from a choice of sixteen different players, each with differing strengths.</p>"},{"name":"EVE Burst Error Plus","year":2003,"developer":"Seaware","url":"sony_playstation2_e/Eve%20-%20Burst%20Error%20Plus%20%28Japan%29.zip","filesize":2798595674,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Detective / mystery > Horror","desc":"<p><em>Eve Burst Error Plus</em> is a remake of Eve Burst Error. The main story and most of the gameplay remain the same as in the original version. The remake has updated graphics (especially noticeable is the more \"serious\", realistic style of character graphics, as opposed to the \"super-deformed\" anime style of the original), better event management, alternate scenarios, and more animations. This remake is based on the original console version and therefore does not feature adult content present in the PC releases.</p>"},{"name":"EVE: New Generation","year":2006,"developer":"Kadokawa Shoten","url":"sony_playstation2_e/Eve%20-%20New%20Generation%20%28Japan%29.zip","filesize":2683553186,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Detective / mystery","desc":"<p>In this installment of the  EVE series, the two protagonists are once again the young careless private detective Kojiroh Amagi, and the sexy government agent Marina Houjou. Five years have passed since the events described in  EVE: The Fatal Attraction. One day, Kojiroh bumps into a young girl on the street, accompanied by a foreigner. Immediately afterwards he receives a call from his ex-girlfriend, who tells him a girl has been kidnapped, and sends him a picture of that girl. To his astonishment, Kojiroh realizes this is the very same girl he just saw on the street...</p><p>Meanwhile, Marina encounters a young man who jumps from the roof of a high building in front of her eyes. Examining the body, Marina notices a strange tattoo on the young man's hand. What was the reason for the suicide? What is the meaning of the tattoo? And how is this case connected to the one Kojiroh is investigating?</p><p>Like all the previous EVE games, this is a traditional Japanese adventure without puzzles. The standard menu-based and point-and-click interfaces are replaced by a new one; whenever you have the freedom of action, you press a combination of buttons on your gamepad. For example, circle button and the left directional button pressed together will make you examine the objects you see to your left, etc. True to the tradition of EVE series, you control both Kojiroh and Marina. You can switch between their scenarios at any time.</p>"},{"name":"Ever17: The Out of Infinity","year":2002,"developer":"KID Corp.","url":"sony_playstation2_e/Ever%2017%20-%20The%20Out%20of%20Infinity%20%28Japan%29%20%28Infinity%20Plus%29.zip","filesize":2697923082,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p>The game is set in a huge futuristic water amusement park. Built on the ocean, this park is technology's latest word, and is at the first sight the most fascinating and secure construction of all. However, something goes wrong, and seven people - two boys and five girls - become trapped in the park. The danger increases as they face a mysterious virus that brings them on the verge of death. </p><p>The player controls two different characters: Takeshi Kuranari, a simple, normal Japanese teenager, and a mysterious boy with amnesia, who cannot even remember his name. The relationship between the characters becomes more and more tense as the story develops. Will the young people be able to solve the mystery and escape death?</p><p><em>Ever17</em> is the second game in KID's <em>Infinity</em> series. The game is not connected to Never7: The End of Infinity either by storyline or protagonists, but both games share the same \"dreamy\", semi-futuristic setting, and their stories have a similar style. The gameplay of <em>Ever17</em> is that of a visual novel: the player reads dialogues and watches scenes, viewing them as one of the two protagonists, occasionally having to make decision as to what to do next and how to answer in a conversation. Those decisions influence the course of the story and lead to different endings.</p>"},{"name":"Ever17: The Out of Infinity - Premium Edition","year":2003,"developer":"KID Corp.","url":"sony_playstation2_e/Ever%2017%20-%20The%20Out%20of%20Infinity%20Premium%20Edition%20%28Japan%29.zip","filesize":2686049413,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>This port of Ever17: The Out of Infinity comes with several in-game updates, including two new songs and new opening movie.</p>"},{"name":"Everblue","year":2001,"developer":"Arika Co., Ltd.","url":"PS2_COLLECTION_PART8/Everblue%20%28Europe%29.zip","filesize":140325345,"score":"","genres":"Simulation > 1st-person > Naval / watercraft","desc":"<p>The player takes the role of Leonardo, a young novice scuba diver. In the process of exploring the Daedalus sea for treasure you will also find the chance to learn about a mysterious treasure that has haunted your family for generations and in the process perhaps alter the fate of the Daedalus sea. Along the way you will meet a cast of varied characters from who you can perform missions in order to advance both the main story and side plots.</p><p>You explore the ocean in first person using radar to find valuables. This radar works by bleeping faster and faster until you are directly on your target. Apart from open ocean you enter sunken ships and even old submerged temples. By collecting these items as well as selling them you can improve your gear and bring your underwater exploration to new levels. You are given both HP and Air meters as you travel under water if if your Air runs out your HP will go down and the end is sure to follow. The game also features a weight system where each object you pick up has a weight assigned, if you become too burdened you will not be able to move.</p><p>The land sections are presented in a in a pre-rendered environment with a point-and-click interface.</p>"},{"name":"Everblue 2","year":2002,"developer":"Arika Co., Ltd.","url":"PS2_COLLECTION_PART8/Everblue%202%20%28Europe%29.zip","filesize":388410174,"score":6.8,"genres":"Simulation > 1st-person > Naval / watercraft","desc":"<p>Leonardo (Professional Salvager / Diver) and his partner Zucco wash up on a Caribbean island after sailing into a storm. Though quickly back on his feet their boat is going to need some heavy repairs if they intend  to escape this tropical paradise. This is no problem of course with your slightly beat up scuba-gear and radar you set into the shallows to search for anything salvageable. Old rusted dog tags and broken CDs being worth quite a sum here your able to start repairs swiftly. However, with so much money involved in this business it is inevitable that unscrupulous folk are going to get involved. And sure enough a large corporation is looking to buy out the island oust the inhabitants and use it for their own money making schemes. Can you as Leo beat them to the treasures of the deep and foil their plans?</p><p>You explore the ocean in first person using radar to find valuables. This radar works by bleeping faster and faster until you are directly on your target. Apart from open ocean you enter sunken ships and even a crashed airplane, sometime for treasure sometimes for jobs given to your on shore. By collecting these items you can improve your gear and bring your Ocean exploration to new levels. </p><p>You are given both HP and Air meters as you travel under water if if your Air runs out your HP will go down and the end is sure to follow.</p><p>Any part of the game that deals with its story takes place on land in a first person point and click environment.</p>"},{"name":"EverGrace","year":2000,"developer":"FromSoftware, Inc.","url":"PS2_COLLECTION_PART8/Evergrace%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2061318240,"score":6.4,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Fantasy","desc":"<p>A young swordsman named Darius and a homemaker named Sharline grew up together in Solta, one of the villages in the Fontraile empire. Solta is populated by people who bear strange marks known as crests. Ancient Billiana Trees cover the landscape shared by Solta and the neighboring Morea, and the two villages disagree as to their role: the people of Morea consider them sacred, while the people of Solta claim they suck out the energy of the land. Eventually, a war erupts, and Darius' parents are killed by assassins from Morea. The two young people have to follow each their own way to restore justice and peace.</p><p><em>Evergrace</em> is an action role-playing game. The player can follow Darius and Sharline through two separate storylines, and switch between the two characters at save points. The game allows players to switch between characters at any save point. Experience is gathered by using items and equipment rather than by leveling up a character directly. Equipped items can also be combined with special items to increase the parameters of the characters.</p>"},{"name":"EverQuest Online Adventures","year":2003,"developer":"Sony Online Entertainment Inc.","url":"sony_playstation2_e/EverQuest%20-%20Online%20Adventures%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1178745311,"score":7.5,"genres":"Role-playing (RPG) > 1st-person > Behind view > Persistent > Real-time > Massively Multiplayer > Fantasy","desc":"<p><em>EverQuest Online Adventures</em> is set five hundred years before the original EverQuest. Players create their own story and history through battles, exploration and cave hunting.</p><p>Five continents, Odus, Tunaria (the past before Antonica, as the Elves are just beginning to leave the world), Faydwer, Kunark, and Velious, the moon Luclin, and alternate planes of existence are available to explore, although some can only be reached after a character achieves a certain level of experience.</p><p>Non-playable characters (NPCs) will give players main quests to complete, depending on their specific classes. Players can also complete their own quests cooperating with other players or working against them.</p>"},{"name":"EverQuest Online Adventures: Frontiers","year":2003,"developer":"Sony Online Entertainment Inc.","url":"sony_playstation2_e/EverQuest%20-%20Online%20Adventures%20-%20Frontiers%20%28USA%29.zip","filesize":1383033999,"score":7.6,"genres":"Role-playing (RPG) > 1st-person > Behind view > Persistent > Real-time > Fantasy","desc":"<p>EverQuest Online Adventures: Frontiers is set in the world of Norrath, 500 years before the PC game EverQuest. It is the standalone second edition of EQOA for the PS2.</p><p>Much of the game has improved upon the original design. Included are a new playable race, a new character class, thousands of new items, hundreds of new quests, new musical scores, level advancement to 60, a class mastery system to further customize characters, and 2 additional areas to explore (Odus and Rathe Mountains).</p><p>Additionally, the game is continually updated. Some of the additional features since the first edition include unlocking of new zones, an auction system, and lycanthropy character enhancements.</p>"},{"name":"Evil Dead (Special Movie Edition)","year":2003,"developer":"VIS Entertainment plc","url":"sony_playstation2_e/Evil%20Dead%20-%20A%20Fistful%20of%20Boomstick%20%28Europe%29%20%28Special%20Movie%20Edition%29.zip","filesize":1494759663,"score":"","genres":"Action > 3rd-person (Other) > Shooter > Horror > Licensed","desc":"<p>This combined release includes:</p><ul><li>Evil Dead: A Fistful of Boomstick (game)</li><li><em>Evil Dead 2</em> (movie)</li></ul>"},{"name":"Evil Dead: A Fistful of Boomstick","year":2003,"developer":"VIS Entertainment Limited","url":"sony_playstation2_e/Evil%20Dead%20-%20A%20Fistful%20of%20Boomstick%20%28Europe%29.zip","filesize":1051676507,"score":6.2,"genres":"Action > Behind view > Shooter > Horror > Licensed","desc":"<p>Ash returns for another round of killing, slashing and destroying the undead.</p><p>On this occasion, with a brand new story based on the world created in the Evil Dead films, Ash can teleport to 4 distinct eras of Dearborn, to not only see how the invasion of the dead took place all those years ago, but to watch in horror as they multiply and control the world they now live in.</p><p>As Ash, you must use his chainsaw for a hand, as well as the trusty shotgun and pistol, new magic abilities (call down a rain of fire or possess the enemy to do the dirty work for you), plus a host of other weapons (grenades, shovels, etc.) to destroy the dead.</p><p>Once you complete a level in story mode, you can go back into that level in arcade mode and attempt to complete a range of challenges (for example, taking down a certain amount of evil in a set amount of time).</p>"},{"name":"Evil Dead: Regeneration","year":2005,"developer":"Cranky Pants Games","url":"PS2_COLLECTION_PART8/Evil%20Dead%20-%20Regeneration%20%28Europe%29.zip","filesize":2200629676,"score":6.7,"genres":"Action > Behind view > Shooter > Horror > Licensed","desc":"<p>Taking place right after the events depicted in the movie,<em>Evil Dead 2</em>, Ash is arrested for the murder of the Deadite bodies found at the cabin and convicted. Found psychopathic, Ash is sentenced to Sunny Meadows, an institute for the criminally insane. Though free from the madness that plagued him in the woods, Ash learns that the Necromonicon Ex Mortis, the Book of the Dead has fallen into the hands of Dr. Vladamir Reinhard, the person in charge of the asylum. In the basement, Dr. Reinhard experiments on unlocking the secrets of the Necromonicon. Using a helpless inmate named Sam as a test subject, the mad doctor frees the evil and once again Ash must live the nightmare as evil forces break free and inmates are turned into zombie deadites!</p><p>Evil Dead Regeneration is a third person action game like The Suffering. Players control Ash, who fights with a variety of collectable weapons, which include the trademark chainsaw-hand and shotgun, as well as a pistol, flamethrower, grenade launcher and a harpoon gun to pick up. For the most part, Ash will need to hack and shoot at various zombie creatures until their bodies become weak. At that point the player can press a button to have Ash unleash a finishing move using his weapons. Ash can also collect \"evil essence\" in order to turn himself into \"Evil Ash\", a more powerful version of himself.</p><p>Also along on the quest is Sam, turned into a half-Deadite by Dr. Reinhard, he acts as Ash's sidekick in a quest for revenge. Sam can be controlled after finding certain \"possession\" symbols in the game. Ash can also kick Sam in order to attack enemies and activate puzzles.</p><p>Ash is still voiced by Bruce Campbell while Sam is voiced by Ted Raimi.</p>"},{"name":"Evil Twin: Cyprien's Chronicles","year":2001,"developer":"In Utero","url":"PS2_COLLECTION_PART8/Evil%20Twin%20-%20Cyprien%27s%20Chronicles%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":772024702,"score":7.1,"genres":"Action > 3rd-person (Other) > Platform","desc":"<p><em>Evil Twin: Cyprien's Chronicles</em> is a surrealistic 3D platformer from France. The player guides the orphan boy Cyprien through a darkly comical environment spanning 8 distinct islands and about 70 stages, in a mission to save his 4 friends, find his talking teddy bear, and confront his inner self. </p><p>Cyprien is helped and hindered through his quest by an assortment of strange beings, from an elephant named Wilbur, who makes his entrances and exits on a swing, a tribe of demis - creatures cut in half, a giant termite queen, a dark root, and many many more.</p><p>He is not helpless in his battle against the odds however. He has brought along to this strange dimension Super-Cyp, his heroic alter ego, into whom he may change temporarily using the power-ups scattered around the levels.</p>"},{"name":"Evolution Skateboarding","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"PS2_COLLECTION_PART8/Evolution%20Skateboarding%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":897695576,"score":"","genres":"Sports > 3rd-person (Other) > Skateboarding","desc":"<p><em>Evolution Skateboarding</em> is a 3D skateboarding game featuring skaters like Arto Saari, Danny Way, Mark Appleyard, Rick McCrank, Chris Senn, Stevie Williams, Kerry Getz and Colin Mckay.</p><p>The game offers over seventy different tricks, several different locations, and an editing studio to create replay videos. Fifteen different tunes from bands like CKY to Unwritten Law are also included.</p>"},{"name":"Evolution Snowboarding","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"PS2_COLLECTION_PART8/Evolution%20Snowboarding%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2284123155,"score":"","genres":"Action > Sports > Behind view > Arcade > Snowboarding / skiing","desc":"<p>YEAR 20XX: EARTH IS PLAGUED BY AN INEXPLICABLE AND LETHAL CHANGE IN CLIMATE.<br><br>EVIL FORCES HAVE INHABITED THE LAND, TAKING ADVANTAGE OF THE DESPERATE SITUATION.<br><br>SOMETHING MUST BE DONE BEFORE IT IS TOO LATE...<br><br>* SAVE THE WORLD THROUGH EIGHT MISSION-FILLED LEVELS<br>* PICKUP AND USE WEAPONS TO FIGHT YOUR CAUSE<br>* IMPROVE YOUR SKILLS BY BUILDING UP POINT TOTALS FOR YOUR BOARDER<br>* INCLUDES MUSIC BY ROADRUNNER RECORDS ARTISTS STONESOUR, SKIPKNOT, MURDERDOLLS, AND MORE...</p>"},{"name":"Extermination","year":2001,"developer":"Deep Space, Inc.","url":"PS2_COLLECTION_PART8/Extermination%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2203333293,"score":7.1,"genres":"Action > 3rd-person (Other) > Shooter > Survival horror","desc":"<p>On December 24, 2005, Sergeant Dennis Riley, member of the special U.S. Marine Team Red Light receives a distress call from Fort Stewart, a top secret research facility in Antarctica. The signal requests an immediate air strike on the base. The team is sent to investigate the matter, but their plane crashes in the tundra. When Dennis arrives at the facility he finds out that something horrible has occurred, and must fight for his life as he encounters mutated creatures and is in danger of getting infected himself.</p><p><em>Extermination</em> is a survival horror game. The player character has limited ammunition for his firearms and in many cases it is advisable to run away from monsters. Besides the traditional health bar Dennis also has an Infection Rate, which may gradually grow when attacked by monsters. Once his Infection Rate reaches 100% he becomes very weak and would eventually mutate into a monster. Infection can be countered by applying MTS vaccines. </p><p>The player character's default weapon, a special purpose rifle, can be customized with enhancements such as zoom scope, flashlight grip, radar, and parts which convert it to other weapon types such as flame thrower, shotgun, or rocket launcher. Dennis can also fight with a knife. Throughout the game batteries must be collected and used for activating various machines and saving the game.</p>"},{"name":"Extreme Sprint 3010","year":2005,"developer":"Ivolgamus UAB","url":"PS2_COLLECTION_PART8/Extreme%20Sprint%203010%20%28Europe%29.zip","filesize":216283699,"score":"","genres":"Action > 3rd-person (Other) > Cyberpunk / dark sci-fi","desc":"<p><em>Extreme Sprint 3010</em> is a single-player, keyboard controlled, running jumping kind of a game. Set in the year 3010, this game envisions a world where evil governments are desperate for something good to put on TV to entertain their teeming masses. The solution - a race. <br>In this race the runner races around an obstacle strewn track chased by a machine that is a cross between a tank and a steam roller. Stay ahead and you win, get caught and you're history.</p><p>The game is controlled by the keyboard. It is a little unusual in that the player's point of view is always above and in front of the runner, looking back at them as they run towards the camera. The track is littered with objects which the runner must either avoid, jump over, or duck under. These obstacles can just pop up out of the track as the runner approaches so quick reactions are needed</p><p>There are three game modes:* Standard Mode: here there is the Single sprint mode where the player can practice any unlocked circuit. Then there's the Multiple Sprint mode which is locked until Tournament Mode has been completed, completing the Multiple Sprint mode unlocks 16th stadium.</p><ul><li><p>Tournament Mode: here there are five leagues, completing a league will unlock further stadiums and hence give access to the next league. Completing the final league unlocks stadium fifteen and the Multiple Sprints mode</p></li><li><p>Exploration Mode: Here the player has to complete series of races that unlock new characters.</p></li></ul>"},{"name":"ExZeus","year":2004,"developer":"Hyper-Devbox s.a.r.l.","url":"PS2_COLLECTION_PART8/ExZeus%20%28Europe%29.zip","filesize":375392086,"score":"","genres":"Action > 3rd-person (Other) > Arcade > Rail shooter > Flight / aviation > Mecha / giant robot > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>In 2102 C.E., a giant asteroid enters Earth's orbit, and inside is a horde of aliens led by the entity Diadora, unleashing an invasion on mankind. Hiding deep underground, the surviving rebels create three experimental robots, Sophia, Calista and Dynamis, to combat Diadora's army, the objective codenamed \"Operation ExZeus\". These three robots are humanity's last hope.</p><p><em>ExZeus</em> is an on-rails arcade shooter in a third-person perspective. The player can move in all directions while progressing forward, shooting enemies and collecting power-ups and gold. The player has the ability to lock onto enemies and fire powerful missiles at them, and also has a laser (which recharges by itself after every use) they can launch by holding down the fire button. The player can also send out nuclear bombs that destroy all of the enemies on screen, which can also be used to help with bosses.</p><p>At the end of every level, the player faces a boss. Before the fight begins, a screen will display the weaknesses of that boss. Successfully defeating a boss will bring the player to the item shop, where they can buy items to power up their robot, and then proceed to the next level.</p>"},{"name":"EyeToy Play: Hero","year":2008,"developer":"SCEE Studio London","url":"PS2_COLLECTION_PART8/EyeToy%20Play%20-%20Hero%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%2CPl%2CRu%2CEl%2CCs%29.zip","filesize":1502729910,"score":"","genres":"Action > 3rd-person (Other) > Motion control > Fantasy > Medieval","desc":"<p>IT'S YOUR ADVENTURE & YOU'RE THE HERO<br>For many years, all across the kingdom the mischievous Warlock has been spreading fear and causing trouble. It is foretold that a brave hero will step forth with an enchanted blade to save the land and bring peace back to the realm.<br><br>The only question is - do you have the courage to fight angry bandits, the Nefarious Knight and the terrifying Warlock himself?<br><br>* Swing, block and dodge as the EyeToyâ„¢ Camera detects your sword's movement and transforms it into a magical, glowing weapon.<br>* Battle through over 20 exciting challenges in pursuit of the wicked Warlock and his nasty henchmen.<br>* Team up with a fellow adventurer and take it in turns to fight the powers of darkness!</p>"},{"name":"EyeToy Play: PomPom Party","year":2008,"developer":"Playlogic Game Factory BV","url":"PS2_COLLECTION_PART8/EyeToy%20Play%20-%20PomPom%20Party%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%2CPl%2CRu%2CEl%2CCs%29.zip","filesize":1333805824,"score":"","genres":"Action > 3rd-person (Other) > Board game > Music / rhythm","desc":"<p>Grab your pompoms and become the coolest cheerleader in EyeToy Play: PomPom Party!The basic gameplay in this dancing game revolves around following traces on screen and collecting stars by touching them. Dancing gameplay is combined with several minigames like bursting balloons or wiping stains.Players are scored by how accurately they follow the traces, how many stars they collect and how they perform in the minigames. Earned stars can be used to unlock new costumes for your on-screen co-dancers.</p><p>Three game modes are available: tutorial, dance and freestyle. \"Tutorial\" explains the basic game mechanics. \"Dance\"-mode is the main gameplay mode, where you play for score. \"Freestyle\" allows to dance just for fun, without scoring.</p><p>Up to two players can play simultaneously. They can work together in \"Team\"-mode or battle it out in \"Duel\"-mode.Additionally up to four players can compete in the \"Tournament\"-mode in hot seat fashion.</p><p>The game includes 25 songs to dance to and is bundled with a pink and a green pompom, which are mandatory for gameplay.A gallery allows to watch snapshots and videos of previous performances.</p>"},{"name":"EyeToy: AntiGrav","year":2004,"developer":"Harmonix Music Systems, Inc.","url":"sony_playstation2_e/EyeToy%20-%20Antigrav%20%28USA%29.zip","filesize":1009236506,"score":6.8,"genres":"Racing / Driving > Sports > 3rd-person (Other) > Skateboarding > Snowboarding / skiing > Sci-fi / futuristic","desc":"<p><em>EyeToy: AntiGrav</em> is the first full-fledged game for the PS2 Eyetoy camera peripheral. Using a head-and-hands body recognition system, the onscreen character responds to the control of the player's body movements. Take one of 8 hoverboarders through 5 tracks ranging from a run-down Chinese wharf to an intense professional hoverboarding arena. And while it is an \"extreme\" sports boarding game, the gameplay contains flavors of SSX, DDR, Stun Runner, a little Return of the Jedi, and a lot of other influences. Of course, it is the uniqueness of the controls that drives the design of the game, the experience of the game, and ultimately whether or not the player enjoys it. </p>"},{"name":"EyeToy: Chat","year":2004,"developer":"SCEE Studio London","url":"PS2_COLLECTION_PART8/EyeToy%20-%20Chat%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":15320060,"score":"","genres":"Strategy > Top-down > Board game > Chess > Naval / watercraft","desc":"<p>Primarily EyeToy Chat is a video phone application for PlayStation 2s equipped with an EyeToy and a network adapter.  In addition to chatting and other video communication features, EyeToy Chat includes three simple games that can be played while connected.  Naval War is the classic game where players place their one to four long ships in a ten by ten area and then try to bomb each others squares in turns attempting to sink the vessels before the other does.  Chess and Checkers (Chequers) are the rest of the lineup and need no further description.  The games do not have any computer AI or local play option, players must be connected to the chat service in order to play the games.</p>"},{"name":"EyeToy: EduKids","year":2005,"developer":"Sony Computer Entertainment Korea Inc."},{"name":"EyeToy: Groove","year":2003,"developer":"SCEE Studio London","url":"sony_playstation2_e/EyeToy%20-%20Groove%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":2023599946,"score":7.3,"genres":"Action > 3rd-person (Other) > Video backdrop > Music / rhythm","desc":"<p>In this game, you are given many popular songs to choose from and dance to. Since this is the Eye Toy we are talking about, it is much more interactive. As lights shoot at buttons around the screen, you touch the buttons. Songs include:</p><p>Music by Madonna  </p><p>Cheeky Holiday by The Cheeky Girls  </p><p>Move Your Feet by Junior Senior  </p><p>and much, much more.</p>"},{"name":"EyeToy: Kinetic","year":2005,"developer":"SCEE Studio London","url":"PS2_COLLECTION_PART8/EyeToy%20-%20Kinetic%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CNo%29.zip","filesize":2985956372,"score":7.7,"genres":"Sports > Meditative / Zen > Music / rhythm > Martial arts","desc":"<p><em>EyeToy: Kinetic</em> is an interactive fitness workout game that makes use of the PS2 EyeToy to let the player do over 20 exercises covering four fitness zones: combat, cardio, toning, and mind &amp; body. Developed with Nike Motionworks, the game's background includes aerobics, martial arts, and dance.</p><p>Players can customize a 12-week training program and the EyeToy technology analyzes their actions and provides feedback on their performance. Up to four players can take turns with each routine and have their progress saved. An EyeToy USB Camera is included in the package.</p>"},{"name":"EyeToy: Kinetic Combat","year":2006,"developer":"SCEE Studio London","url":"PS2_COLLECTION_PART8/EyeToy%20-%20Kinetic%20Combat%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CNo%29.zip","filesize":4263511242,"score":"","genres":"Simulation > Sports > Fixed / flip-screen > Meditative / Zen > Motion control","desc":"<p><em>EyeToy: Kinetic Combat</em> is an interactive fitness workout game that makes use of the PS2 EyeToy to let the player take part in Hung Gar Kung Fu workouts and battle on screen characters. It is a spin off from the earlier 2005 game EyeToy: Kinetic.</p><p>The player can launch a 16 week training program with their choice of three personal trainers, or try one of the 12 combat-themes training games. These include sparring with a Chinese dragon and dodging its counter attacks, hitting on screen targets while moving to avoid on screen projectiles and correctly matching poses shown on screen. There is also 25 hour of interactive classes included to take part in.</p>"},{"name":"EyeToy: Monkey Mania","year":2004,"developer":"Sony Computer Entertainment Japan","url":"PS2_COLLECTION_PART8/EyeToy%20-%20Monkey%20Mania%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":472556479,"score":"","genres":"Action > Mini-games > Party game","desc":"<p>Join those crazy Ape Escape monkeys on Freaky Floaty Island for over 50 totally manic EyeToy minigames!<br>Are you all ready for the craziest EyeToy game yet? Those pant-wearing Ape Escape monkeys have invited you and your friends to join them on Freaky Floaty Island for a manic minigame party!</p>"},{"name":"EyeToy: Operation Spy","year":2005,"developer":"SCEE Studio London","url":"sony_playstation2_e/EyeToy%20-%20Operation%20Spy%20%28USA%29.zip","filesize":593590755,"score":5.6,"genres":"Action > 1st-person > Puzzle elements > Spy / espionage","desc":"<p>In <em>Operation Spy</em>, the player can engage in multiple games, utilizing the EyeToy and movements of the player for games like skydiving, disarming bombs and break secret codes. Players can also use the game with the EyeToy to record surveillance videos, saving the video on a memory card, which also has the ability for night vision. It also features face recognition, using it to upload a player's profiles and options.</p>"},{"name":"EyeToy: Play","year":2003,"developer":"SCEE Studio London","url":"PS2_COLLECTION_PART8/EyeToy%20-%20Play%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":476439913,"score":7.4,"genres":"Action > Simulation > Sports > 3rd-person (Other) > Side view > Fighting > Music / rhythm > Paddle / Pong > Puzzle elements > Boxing > Football (European) / Soccer > Martial arts","desc":"<p>Eye Toy: Play is a set of games for your Eye Toy camera.12 games are included, each one unique.There is Kung Fu,where you fight off ninjas, Wishi Washi, where you wash windows, and much much more.Using the Eye Toy is easy: just plug it into the USB port of your PS2 and play!</p>"},{"name":"EyeToy: Play 2","year":2004,"developer":"SCEE Studio London","url":"PS2_COLLECTION_PART8/EyeToy%20-%20Play%202%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%2CEl%29%20%28v1.00%29.zip","filesize":1138732978,"score":7.5,"genres":"Action > Simulation > Sports > 3rd-person (Other) > Side view > Arcade > Board game > Fighting > Boxing > Football (European) / Soccer > Ping pong / table tennis > Spy / espionage","desc":"<p>EyeToy: Play 2 is the sequel to the first EyeToy: Play game and includes 12 new mini-games to play using the EyeToy USB camera. Games include Mr Chef (making burgers for customers), Table Tennis (playing table tennis against AI opponent), Goal Attack (being a goal keeper) and many more. There are also over 75 bonus games to try out future possibilities of EyeToy technology.</p>"},{"name":"EyeToy: Play 3","year":2005,"developer":"SCEE Studio London","url":"PS2_COLLECTION_PART8/EyeToy%20-%20Play%203%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%2CEl%29.zip","filesize":1989199235,"score":6.4,"genres":"Action > Board game > Music / rhythm","desc":"<p><em>EyeToy: Play 3</em> contains a set of over 50 different games you can play with the help of a USB camera connected to Playstation 2. Amount of players can vary from 1-4 players and the game is suitable for people of all ages.</p><p><em>EyeToy: Play 3</em> provides single player challenges such as Ghost Grab where you enter a ghost house and try to catch ghosts while trying to avoid objects thrown at you and Boot Camp where you try to pass the different challenges thrown at you such as running through an obstacle course or following sergeants orders. Additionally, for someone preferring slightly less intense action, there is music conducting and working in a beauty salon. </p><p>However when two or more players are included many more games open in party mode such as Monkey Rampage, Kitty Loves Me and Athletics, with bowling, American football and such. These party games are fast-paced and usually all 4-players can play on the screen at the same time.</p>"},{"name":"EyeToy: Play Astro Zoo","year":2007,"developer":"ZoÃ« Mode","url":"PS2_COLLECTION_PART8/EyeToy%20Play%20-%20Astro%20Zoo%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%2CPl%2CRu%2CEl%2CCs%29.zip","filesize":1124854971,"score":"","genres":"Puzzle > Augmented reality > Real-time > Party game","desc":"<p>EyeToy: Play Astro Zoo is a PS2 game developed by ZoÃ« Mode and released exclusively for Europe and Australia in late 2007. The game play revolves around use of the Eyetoy camera in a series of minigames with the end goal of herding scattered zoo animals back into their respective zones.</p><p>The mini games consist of interacting with the animals on screen via the Eyetoy USB Camera. This could be herding animals back into their pen, shearing the sheep or even making sure they have space suits on.</p>"},{"name":"EyeToy: Play Sports","year":2006,"developer":"SCEE Studio London","url":"PS2_COLLECTION_PART8/EyeToy%20-%20Play%20Sports%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%2CPl%2CEl%2CCs%2CTr%29.zip","filesize":762042586,"score":"","genres":"Sports > Augmented reality > Real-time > Motion control > Athletics > Boxing > Golf > Olympiad / mixed sports > Snowboarding / skiing > Tennis","desc":"<p>Players use the Eyetoy USB Camera to interact with the onscreen graphics in 101 mini games with a sports theme. As the title implies these mini games are sports themes and cover a wide range of activities, from Olympic sports like sprinting and swimming through to car racing and trampolining. Most games require four players but there are plenty that can be played with only two.</p>"},{"name":"EyeToy: Tales","year":2005,"developer":"Sony Computer Entertainment Korea Inc."}]