[{"name":"F: Fanatic","year":2004,"developer":"PrincessSoft","url":"sony_playstation2_f/F%20-%20Fanatic%20%28Japan%29.zip","filesize":1224049798,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Visual novel > Fantasy > Detective / mystery > Horror","desc":"<p><em>F: Fanatic</em> is a horror visual novel set in a fictional 19th century London. The player takes on a role of a young newspaper journalist following the case involving a series of murders. Someone is offing young ladies in a manner that closely resembles that of the infamous Jack the Ripper. As you dig deeper into the story you realize that supernatural element too is involved.</p>"},{"name":"F1 2001","year":2001,"developer":"Image Space Inc.","url":"PS2_COLLECTION_PART8/F1%202001%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.zip","filesize":517349001,"score":7.6,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Officially licensed Formula 1 racer for the 2001 GP season featuring every car, driver, and track featured in the real life Formula 1 season. </p><p>The game boasts new physics and graphics engines which actually model and take into account track irregularities and bumps, and add some extras like fully animated 3D pit crews. Game modes available are the same as in last year's edition (Quick Race, Test Day, Multiplayer, Grand Prix and Championship) with the addition of the new \"Driving School\" mode, plus a series of brand new driving aids.</p>"},{"name":"F1 2002","year":2002,"developer":"Image Space Inc.","url":"PS2_COLLECTION_PART8/F1%202002%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.zip","filesize":384733404,"score":7.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing > Oceania > Licensed","desc":"<p>Every track, driver, team, and pit crew from the official F1 2002 competition are included in this, the '02 version of the long-standing EA F1 series.</p><p>Drive in a full season, a single race, test sessions (where you can modify your car's setup to increase your cars speed, handling, etc and test them under normal racing conditions) and training, where you can learn the basics and more advanced areas of Formula 1 racing.</p>"},{"name":"F1 Career Challenge","year":2003,"developer":"Visual Sciences Ltd.","url":"sony_playstation2_f/F1%20Career%20Challenge%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":425694698,"score":7.4,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>F1 Challenge '99-'02</em> spans four entire championship seasons and features accurate team, vehicle, and driver data for each.</p><p>Across the four racing seasons, <em>F1 Challenge '99-'02</em> features 14 different teams, 44 different vehicles, and 17 of the world's most famous racing circuits--some of which have slightly different configurations, depending on the year. The level of detail on the visuals looks to be second to none, with each circuit boasting its own real-life structures, bumps in the track, motion-captured pit crews, animated grid girls, and planes and helicopters in the sky above.</p><p>The cars in the game feature realistic driving physics and damage models that take into account the materials that the various components are made of. Fortunately, players have access to the same kind of data telemetry that real drivers and their teams do, so it should be possible to devise car setups that are appropriate for each circuit and so minimize the chances of crashing.</p>"},{"name":"F1 Championship: Season 2000","year":2000,"developer":"Image Space Inc.","url":"PS2_COLLECTION_PART8/F1%20Championship%20Season%202000%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":445956196,"score":7.6,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>All cars and drivers from the 2000 season are here and the game modes include a single race, a championship season, a custom season (where you pick the track order yourself) and a quick race where you start at last place in the field, and you must get as far up the field as possible in just 4 laps.</p>"},{"name":"F1 Racing Championship","year":2001,"developer":"Ubi Soft Entertainment Software","url":"PS2_COLLECTION_PART8/F1%20Racing%20Championship%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":478067622,"score":7.9,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Automobile > Track racing > Licensed","desc":"<p><em>F1 Racing Championship</em> is the third Ubi Soft F1 racing simulation game, published with the FIA license by Video System. It features official tracks, drivers and cars of the 1999 F1 season.</p><p>The game is based on a new engine bringing a real technological step compared to the two first titles (F1 Racing Simulation and Monaco Grand Prix Racing Simulation 2).</p><p>Available game modes are Single Race, Grand Prix, Championship, Private Trials and Time Attack. The tracks were modelled in 3D from GPS data sampled on the real roads. There are realistic physics, a telemetry system to analyse behaviour of your car and to tune its settings, complex driving AI, recordable replays, strategy management with animated pit sequences, weather simulation, and LAN support for multiplayer games.</p>"},{"name":"F355 Challenge: Passione Rossa","year":2002,"developer":"SEGA-AM2 Co., LTD.","url":"PS2_COLLECTION_PART8/Ferrari%20F355%20Challenge%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1946029857,"score":7.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Get behind the wheel of one of the most world's most prestigious cars - the F355 Ferrari. </p><p>F355 features a number of game modes: the Arcade mode which is the same as the checkpoint arcade version; Championship mode where you race a total of 6 races for the combined highest score; Single play which is the same as Arcade mode but with no time limit; Versus play with a two player split screen; and Network Race where you can connect to the Internet and race a time attack against other players ghost cars.</p><p>The courses that are available to race on are Motegi, short and long versions of Suzuka, Monza, Sugo, Long Beach, Atlanta Motor Speedway, Nurburgring (GP track), Laguna Seca, Sepang, and Fiorano (Ferrari's test track). </p><p>The game features 3 levels of difficulty. There are also four Assist functions - Stability Control for cornering, Traction Control from the engine to the tires, Anti Lock Brake System to keep the tires from locking during braking and Intelligent Brake System for braking before corners so beginners can concentrate on steering.</p><p>You can also connect to the Internet and register your driver data.</p>"},{"name":"Fairly OddParents!, The: Breakin' da Rules","year":2003,"developer":"Blitz Games Ltd","url":"sony_playstation2_f/Fairly%20OddParents%2C%20The%20-%20Breakin%27%20da%20Rules%20%28USA%29.zip","filesize":2111008428,"score":6.4,"genres":"Action > Behind view > Platform > Puzzle elements > Fantasy > Comedy > Licensed","desc":"<p><em>The Fairly OddParents: Breakin' da Rules</em> is a 3D platformer game based on <em>The Fairly OddParents</em> cartoon. The game starts with Timmy’s parents leaving for a seminar weekend leaving the babysitter Vicky in charge. Timmy accidentally wishes he doesn’t have to follow the rules from Cosmo and Wanda’s fairy rulebook anymore. Cosmo grants this wish with the rulebook falling to the floor, but soon a news bulletin arrives that states that the first person touching the book will gain Cosmo and Wanda’s powers. Moments later Vicky picks up the book spelling trouble for Timmy and the fairies. Cosmo, Wanda, and Timmy are then summoned to the Fairy court. They are found guilty for losing the rulebook and are sentenced to retrieve the rulebook within 49,5 hours or lose their Fairy license forever.</p><p>In the game, you take control of Timmy Turner and have to retrieve the pages from the rulebook through a variety of environments ranging from cyberspace to a medieval castle. Gameplay includes platforming, defeating enemies, and puzzle-solving. As well as collecting wish stars (5 stars for a wish) and crowns (100 crowns for another chance at a failed task). All levels are accessed from different objects in the house.</p>"},{"name":"Fairly OddParents!, The: Shadow Showdown","year":2004,"developer":"Blitz Games Ltd","url":"PS2_COLLECTION_PART8/Fairly%20OddParents%2C%20The%20-%20Shadow%20Showdown%20%28Europe%29.zip","filesize":1094514252,"score":"","genres":"Action > Behind view > Licensed","desc":"<p><em>The Fairly OddParents!: Shadow Showdown</em> is a 3D platformer game based on <em>The Fairly OddParents</em> cartoon. When the TV goes out just as the season finale of Crash Nebula starts, Timmy Turner asks his Fairy Godparents for a little help. When they find their magic is gone, they travel to the Fairy world, where they quickly learn that the Royal jewel is missing and Jorgen von Strangle thinks a recently fired jester is responsible. Now the player is off to uncover the truth.</p><p>Players take control of Timmy Turner and guide him through a variety of environments ranging from Fairy world to his dad's dream world. Gameplay includes mostly platforming and a bit of puzzle-solving. As well as collecting wish stars (3 stars for a wish) that let the player obtain items to overcome obstacles like a pogo stick, glider or jetpack.</p>"},{"name":"Falling Stars","year":2007,"developer":"Ivolgamus UAB","url":"PS2_COLLECTION_PART8/Falling%20Stars%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CRu%29.zip","filesize":376219989,"score":5.4,"genres":"Role-playing (RPG) > 3rd-person (Other)","desc":"<p><em>Falling Stars</em> is a role-playing game designed for children. As the player uncovers the mysteries of Dazzleon, they must participate in seven unique mini-games, train their own pet, dress Luna in an assortment of unique outfits, and battle a variety of deadly monsters. </p><p>The story starts as an ancient spirit detects a dark power awakening in the peaceful world of Dazzleon. The player takes the role of a young spirit entrusted with a mission of great importance. To investigate this world, the spirit must take the form of a young girl named Luna. However, restoring peace to Dazzleon ends up not being such a simple task as thwarting evil requires the player to complete various quests and challenges, train their own pet, and command their pet in battle against rogue monsters unleashed by Luna’s wicked uncle, Matt. </p>"},{"name":"Fallout: Brotherhood of Steel","year":2004,"developer":"Interplay Entertainment Corp.","url":"PS2_COLLECTION_PART8/Fallout%20-%20Brotherhood%20of%20Steel%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":3367755343,"score":5.7,"genres":"Action > Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Action RPG > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>In a post-apocalyptic future, a society known as the Brotherhood of Steel is born, wielding powerful weapons and armor from the time before the war, they seek to bring some form of order to the wastelands of what used to be the United States. As a new member(s) to the Brotherhood, you'll soon find yourself separated from your comrades and forced to contend with a variety of missions and challenges alone. Radscorpions, Super-Mutants and Deathclaws are all in the Brotherhood's way, and bringing an end to their tyranny will certainly make the wasteland a safer place.</p><p><em>Brotherhood of Steel</em> is an action game set in the <em>Fallout</em> universe. The Brotherhood members are well armed and carry full clips of ammo (which does run out). New weapons of various nature can be found and equipped to bring new tactics. Shooting down enemies earns experience points and these points are used to improve the attributes of various individual skills. Additionally, your character will have to contend with finding keys and other objects, protecting NPCs and jumping over bottomless pits.</p>"},{"name":"Fame Academy","year":2003,"developer":"Monte Cristo Multimedia","url":"PS2_COLLECTION_PART8/Fame%20Academy%20%28UK%29.zip","filesize":440800328,"score":6.6,"genres":"Strategy > 3rd-person (Other) > Managerial / business simulation > Licensed","desc":"<p><em>Fame Academy</em> is licensed game about the eponymous TV show where the player controls the show's winner. It is a variant of The Sims, which means the player has to take care of the character's needs. At first he furnishes the candidate's house, e.g. a gaming console helps the need for leisure, a bed for relaxation and so on. Of course the candidate also has to train for his career: Tutors give tasks which have to be fulfilled in a certain time, e.g. singing. Mostly the player has to buy items like a microphone for this.</p><p>The player can give instructions to his character by clicking on the item he wants to use. If he does nothing the AI takes over. For concerts the player assembles a performance with the learned dancing steps which are performed automatically.</p>"},{"name":"Fame Academy: Dance Edition","year":2003,"developer":"Widescreen Games SARL"},{"name":"Family Board Games","year":2005,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART8/Family%20Board%20Games%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":56626131,"score":"","genres":"Strategy > Board game > Chess","desc":"<p>Rediscover the world's best loved board games, now brought up to date for the PlayStation 2 * Including family favourites: Chess, Checkers, Backgammon, Quatro, Reversi and Enigma. * Enjoy them alone or with family and friends. * Suitable for all ages and abilities.</p>"},{"name":"Family Feud","year":2006,"developer":"Atomic Planet Entertainment Limited","url":"sony_playstation2_f/Family%20Feud%20%28USA%29.zip","filesize":246861558,"score":"","genres":"Strategy > Game show / trivia / quiz > Licensed","desc":"<p>A simulation of the TV game show of the same name. Two families will compete against each other to choose the most common answers to questions such as \"Things a jockey needs\", or \"Clothes that don't go on hangers\". More than 1000 questions are included.</p><p>The 2006 edition has both standard and quick games. The standard game contains 5 rounds. In rounds 1-4, two people are selected, one from each team, who compete to buzz in a common answer to the question on the board. The team that wins control then has to figure out the other common answers, earning a strike for any answers that are not common. If any common answers remain after that team's third strike, the other team has a chance to steal all the points for that round by guessing an unrevealed answer. In rounds 3 and 4, the stakes are higher. In round 5, two people from the winning team work together to find common answers to questions before time runs out. The quick game has just one family, who has to guess the common answers to a question. Finding all answers earns bonus points.</p><p>The standard game can be played against the computer, another player on the same computer, or over the Internet. Answer questions by typing them out or using the on-screen keyboard; the computer will recognize word variations and some misspellings. A family editor is included, which lets you edit body type and clothing. By playing the game, new clothing options and studios will be unlocked.</p>"},{"name":"Family Guy Video Game!","year":2006,"developer":"High Voltage Software, Inc.","url":"PS2_COLLECTION_PART8/Family%20Guy%20-%20Video%20Game%21%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2604094403,"score":5.5,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Shooter > Stealth > Direct control > Licensed","desc":"<p>The Griffin family from Fox's animated TV series makes its way to video gaming for the first time.</p><p>In this action-adventure, which runs like an episode from the show, players control Peter, Brian and Stewie through various goals and adventures.</p><p>After being hit on the head by a satellite dish, Peter wakes up in a hospital believing that Mr. Belvedere (from the 1980's sitcom) has kidnapped his family, and everyone in town is an accomplice.  Peter makes his way through town beating up anyone who gets in his path, in a side-scrolling beat-em-up fighting mode.</p><p>Brian is falsely accused of impregnating Carter Pewterschmidt's prized racing dog Seabreeze.  Brian must escape the police station without being seen and collect evidence proving that he is not the father.  Brian's game mode relies heavily on stealth/espionage gameplay.</p><p>Stewie's battle against his half-brother Bertram continues as Stewie must destroy everything in his path to infiltrate a hospital and the inside of Peter in order to find Bertram's lair and stop him from taking over the world.  Stewie's adventure takes place as a platformer action game with shooting elements.</p><p>Much like the show, there are segues which translate into mini-games that will yield power-ups for each mission if completed successfully.</p>"},{"name":"Fantastic 4","year":2005,"developer":"7 Studios, Inc.","url":"PS2_COLLECTION_PART8/Fantastic%204%20%28Europe%29.zip","filesize":2583990665,"score":6.7,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>This game is a licensee of the 2005 movie \"Fantastic 4\". Unlike many licensed titles, this third-person action game in the vein of the Onimusha or Devil May Cry series only takes the base of its plot from the actual movie, then liberally changes it to make for better gameplay.</p><p>Generally, the game brings in more content from the comic books than the movie, particularly considering the villains that appear. While the movie pretty much only concerned itself with Victor von Doom aka \"Doctor Doom\" as its supervillain of choice, the game brings in various characters from the comic books as well - the Mole Man, the Puppet Master, or Diablo, to name a few.</p><p>The gameplay usually consists of walking the heroic title characters around a level and beating up the various enemies that cross their path. There are mission objectives, but usually, the only way to achieve them leads through the enemies, and just, as usual, the only way to fail them is to be overwhelmed by the Bad Guys. Beating up enemies yields points, which can be used to upgrade characters with new special moves or unlock various bonus materials.</p><p>To spice it all up, developer Seven Studios have also thrown in a co-op mode that allows for playing the normal single-player mission in a tag team with a second player.</p>"},{"name":"Fantastic Fortune 2","year":2003,"developer":"GeneX","url":"sony_playstation2_f/Fantastic%20Fortune%202%20%28Japan%29.zip","filesize":1677832560,"score":"","genres":"Adventure > Simulation > 1st-person > 3rd-person (Other) > Anime / Manga > Visual novel > Fantasy","desc":"<p><em>Fantastic Fortune 2</em> is a romance simulation game. There is also an updated version of the game released under the name of Fantastic Fortune 2: Triple Star. In this otome game the protagonist is one of the three female characters: Aoi (16-year old priestess summoned from another world), Marine (15), or Aqua (13-year old with a memory loss). The story takes place in a fantasy setting and it unfolds during a seven month training period where you try to become a \"Daughter of Star\".</p><p>But aside from trying to train to become a \"Daughter of Star\", each of the three girls has another goal they aspire to. Aoi is trying to return to her home world. Aqua is trying to regain her memory. And Marine is trying to find a man she met at a young age. During the training period, you can upgrade your character's various skills such as charisma, fortune (monetary), music, construction, speech, and many other among close to 30 different skills. When you're not training, you can explore the city and talk to characters you meet in an adventure mode common to visual novels.</p>"},{"name":"Fantastic Four: Rise of the Silver Surfer","year":2007,"developer":"7 Studios, Inc.","url":"PS2_COLLECTION_PART8/Fantastic%20Four%20-%20Rise%20of%20the%20Silver%20Surfer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2409160570,"score":4.9,"genres":"Action > Diagonal-down > Arcade > Beat 'em up / brawler > Sci-fi / futuristic > Licensed","desc":"<p>The mysterious herald known as the Silver Surfer has arrived on Earth. You must unravel his secret to save the planet.</p><p>You take control of any one of the four members of the Fantastic Four and are able to switch to any team member you need to. You can play solo or co-op with up to four people. You will fight through various Fantastic Four enemies such as the Silver Surfer, Super-Skrull, Dr. Doom, etc. The plot follows the movie in that you must stop the Silver Surfer from handing over your planet to Galactus but also contains game-only story lines.</p>"},{"name":"FantaVision","year":2000,"developer":"Sony Computer Entertainment Inc.","url":"PS2_COLLECTION_PART8/Fantavision%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1316899545,"score":6.3,"genres":"Puzzle > Side view > Real-time > Arcade","desc":"<p>Fireworks are launching across a city's skyline.  In this puzzle game, you must connect them quickly to have them explode.  Earn more points for detonating more fireworks at the same time.  You can also work against another player to see who can gain the most points.  Be careful, as control of the screen can shift and one player could be left with few fireworks to explode.</p>"},{"name":"Fast and the Furious, The","year":2006,"developer":"Eutechnyx Limited","url":"PS2_COLLECTION_PART8/Fast%20and%20the%20Furious%2C%20The%20%28Europe%29.zip","filesize":626861283,"score":6.3,"genres":"Racing / Driving > 3rd-person (Other) > Licensed","desc":"<p>Based on the movie The Fast and the Furious: Tokyo Drift, the game puts you in the shoes of a rookie trying to make it in the world of drift racing. As in the movie, the game is set on the streets of Tokyo (and at night, of course) and stars some of the same characters and their cars. At first, you don't have a lot of cash, but as you win more races and earn more money, you're able to upgrade, customize and trick out your vehicle into a top-notch drifting machine.</p>"},{"name":"Fatal Frame","year":2001,"developer":"Tecmo, Ltd.","url":"sony_playstation2_f/Fatal%20Frame%20%28USA%29.zip","filesize":1881959019,"score":7.7,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Survival horror > Horror","desc":"<p>Miku Hinasaki is a young girl with a strange sixth sense.  Her brother, Mafuyu, and his mentor, Junsei Takamine, went to investigate a mansion that once was inhabited by a powerful landowner who had absolute control over the area.  Unfortunately, they never returned from their investigation. Miku enters the mansion, armed with only an antique camera given to her by her deceased mother, to try to find her brother.</p><p>While inside the mansion, Miku will encounter ghosts and other spiritual apparitions.  In order to overcome these spirits and survive, she must use the magical camera to capture the ghosts on film, thereby trapping them forever. Ghosts range from invisible fragments hidden in scenery, to memories of the past that appear only for a moment before vanishing, to full body apparitions that will attempt to attack and kill Miku.</p><p>In order to defeat an aggressive ghost the Camera Obscura's shot must first be \"charged\" by keeping the ghost centered while it is visible. If Miku snaps a shot while the ghost is attacking or is vulnerable then she will drain even more energy from it, resulting in more spirit points being earned. Points can then be spent to improve her camera's attributes or give it special abilities, like slowing a ghost or pushing it away. The Camera Obscura can also reveal clues and dispel illusions, which Miku will need to utilize to solve puzzles within the mansion.</p>"},{"name":"Fatal Frame II: Crimson Butterfly","year":2003,"developer":"Tecmo, Ltd.","url":"sony_playstation2_f/Fatal%20Frame%20II%20-%20Crimson%20Butterfly%20%28USA%29.zip","filesize":2155664373,"score":8.1,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Survival horror > Horror","desc":"<p>Twin sisters Mio and Mayu, while visiting a vacation spot from their childhood, become lost in a dark forest. The path disappears behind them as they enter the Lost Village, a place that vanished from the living world years ago. Ghosts of the townspeople walk the streets and search for the twins, intent on completing a dark ritual long left unfinished. Mayu begins to grow distant from Mio as well, and she begins to speak as if she were another person entirely. By chance Mio finds the Camera Obscura, and with its powers she searches for a way to get her sister and herself out of the village.</p><p><em>Fatal Frame II</em> has mostly the same gameplay as the first game in the series, although with a few tweaks. The camera no longer has to charge up a shot, but different film types now have loading times that can leave Mio defenseless if she takes a picture at a bad time. Special abilities for the camera no longer require a disposable item, and are instead charged by taking good shots of attacking ghosts. The stats of the camera and special abilities are still upgraded/unlocked with spirit points, but an item must first be found and spent as well to upgrade each level of a stat.</p>"},{"name":"Fatal Frame III: The Tormented","year":2005,"developer":"Tecmo, Ltd.","url":"sony_playstation2_f/Fatal%20Frame%20III%20-%20The%20Tormented%20%28USA%29.zip","filesize":2242137895,"score":8.2,"genres":"Action > 1st-person > 3rd-person (Other) > Cinematic camera > Puzzle elements > Survival horror > Horror","desc":"<p>The Fatal Frame series is back. Rei Kurosawa's fiancé, Yuu Asou, dies in an ugly car accident when she is driving. She enters a haunted mansion as part of a reporting assignment. Here she is frightened by images of her dead fiancé. The game incorporates the camera mode from the previous games, used to capture ghosts. You use the camera obscura not only as a weapon to capture ghosts but as a guide by taking pictures of the ghosts and creepy objects in the house in order to solve the mystery and get rid of the curse. You walk around with a strobe light looking for clues to the mystery.</p><p>Throughout the course of the game you can play as three women and switch between a dream world and real-life. All in all, it carries over the same Japanese horror theme as the first two.</p>"},{"name":"Fatal Fury: Battle Archives Volume 1","year":2006,"developer":"SNK Corporation","url":"sony_playstation2_f/Fatal%20Fury%20-%20Battle%20Archives%20Volume%201%20%28USA%29.zip","filesize":1971422866,"score":7,"genres":"Action > Compilation > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting","desc":"<p>This collection is the first release in the Fatal Fury series on the PlayStation 2. It includes:</p><ul><li>Fatal Fury</li><li>Fatal Fury 2</li><li>Fatal Fury 3: Road to the Final Victory!</li><li>Fatal Fury Special</li></ul><p>All games are faithful conversions of the Neo Geo versions. Button remapping per game is supported, as well as sprite palette customization, but no progressive-scan option.</p>"},{"name":"Fatal Fury: Battle Archives Volume 2","year":2007,"developer":"SNK Corporation","url":"sony_playstation2_f/Fatal%20Fury%20-%20Battle%20Archives%20Volume%202%20%28USA%29.zip","filesize":1621054914,"score":6.9,"genres":"Action > Compilation > Side view > Anime / Manga > Arcade > Fighting","desc":"<p>The second <em>Battle Archive</em> release bundles the 3 Real Bout Fatal Fury fighting games:</p><ul><li>Real Bout Fatal Fury</li><li>Real Bout Fatal Fury Special</li><li>Real Bout Fatal Fury 2: The Newcomers</li></ul><p>The game also allows you to remap controls, edit the character colors, choose between an original or an arranged soundtrack, and access a special training mode. Another new feature is the ability to see your character's move list while playing the game.</p><p>The Japanese version of the game allows you to play against other users via the KDDI Matchmaking Network. This feature is not available outside of Japan.</p>"},{"name":"Fate-stay night","year":2007,"developer":"Type-Moon","url":"sony_playstation2_f/Fate-stay%20night%20-%20Realta%20Nua%20%28Japan%29%20%28Extra%20Edition%29.zip","filesize":2746188050,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Contemporary > Fantasy > Japan (Modern/Futuristic) > Adult","desc":"<p>Fuyuki City is home to an underground battle between sorcerers, each trying to obtain a powerful relic known as the Holy Grail, summoning spiritual familiars (\"Servants\") to do their bidding. An amateur teenage mechanic named Shirō Emiya was once thought to harbor the powers of a sorcerer, but has lived through most of his life without any connection to magic. This changed on the day when a hostile Servant attacked him, and he inadvertently summoned another one, becoming involved in the grand battle.</p><p><em>Fate/stay night</em> is a visual novel. The player reads text accompanied by still anime-style images, and is from time to time prompted to make a decision that would influence subsequent events. There are three main plot arcs in the game that can be accessed through these choices, each corresponding to a female character in the game.</p><p>The computer version of the game contains scenes with explicit sexual content. The console version does not feature these scenes.</p>"},{"name":"Fear, The (Disc 1)","year":2001,"developer":"Digital Frontier Inc.","url":"sony_playstation2_f/Fear%2C%20The%20%28Japan%29%20%28Disc%201%29.zip","filesize":4228463334,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Horror","desc":"<p>A group of young Japanese filmmakers decide to shoot a horror film in a mansion with a troubled past. But as they enter the mansion, the horror becomes reality. Strange sounds, dead bodies, monsters and other terrible things haunt the mansion. The young people, guided by the protagonist of the game, called \"Camera Man\", have no choice but to explore the house and its history, and to find out the answer for all the questions.</p><p>\"The Fear\" is an interactive movie in the true sense of the word. Featuring live actors and full-motion video, the game occupies 4 DVDs. Unlike many other interactive movies, you actually have control over your actions in \"The Fear\". You can move from first-person perspective, each movement being shown as a full-motion video. There are also some puzzles to solve and even short action sequences.</p>"},{"name":"Fear, The (Disc 2)","year":2001,"developer":"Digital Frontier Inc.","url":"sony_playstation2_f/Fear%2C%20The%20%28Japan%29%20%28Disc%202%29.zip","filesize":4194846521,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Horror","desc":"<p>A group of young Japanese filmmakers decide to shoot a horror film in a mansion with a troubled past. But as they enter the mansion, the horror becomes reality. Strange sounds, dead bodies, monsters and other terrible things haunt the mansion. The young people, guided by the protagonist of the game, called \"Camera Man\", have no choice but to explore the house and its history, and to find out the answer for all the questions.</p><p>\"The Fear\" is an interactive movie in the true sense of the word. Featuring live actors and full-motion video, the game occupies 4 DVDs. Unlike many other interactive movies, you actually have control over your actions in \"The Fear\". You can move from first-person perspective, each movement being shown as a full-motion video. There are also some puzzles to solve and even short action sequences.</p>"},{"name":"Fear, The (Disc 3)","year":2001,"developer":"Digital Frontier Inc.","url":"sony_playstation2_f/Fear%2C%20The%20%28Japan%29%20%28Disc%203%29.zip","filesize":4208868962,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Horror","desc":"<p>A group of young Japanese filmmakers decide to shoot a horror film in a mansion with a troubled past. But as they enter the mansion, the horror becomes reality. Strange sounds, dead bodies, monsters and other terrible things haunt the mansion. The young people, guided by the protagonist of the game, called \"Camera Man\", have no choice but to explore the house and its history, and to find out the answer for all the questions.</p><p>\"The Fear\" is an interactive movie in the true sense of the word. Featuring live actors and full-motion video, the game occupies 4 DVDs. Unlike many other interactive movies, you actually have control over your actions in \"The Fear\". You can move from first-person perspective, each movement being shown as a full-motion video. There are also some puzzles to solve and even short action sequences.</p>"},{"name":"Fear, The (Disc 4)","year":2001,"developer":"Digital Frontier Inc.","url":"sony_playstation2_f/Fear%2C%20The%20%28Japan%29%20%28Disc%204%29.zip","filesize":3886484999,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Horror","desc":"<p>A group of young Japanese filmmakers decide to shoot a horror film in a mansion with a troubled past. But as they enter the mansion, the horror becomes reality. Strange sounds, dead bodies, monsters and other terrible things haunt the mansion. The young people, guided by the protagonist of the game, called \"Camera Man\", have no choice but to explore the house and its history, and to find out the answer for all the questions.</p><p>\"The Fear\" is an interactive movie in the true sense of the word. Featuring live actors and full-motion video, the game occupies 4 DVDs. Unlike many other interactive movies, you actually have control over your actions in \"The Fear\". You can move from first-person perspective, each movement being shown as a full-motion video. There are also some puzzles to solve and even short action sequences.</p>"},{"name":"Ferrari Challenge: Trofeo Pirelli","year":2008,"developer":"Eutechnyx Limited","url":"sony_playstation2_f/Ferrari%20Challenge%20-%20Trofeo%20Pirelli%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v2.00%29.zip","filesize":2419454817,"score":6.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Ferrari Challenge: Trofeo Pirelli</em> is a re-make of F355 Challenge: Passione Rossa and made after Ferrari's actual racing series in which professional and amateur racers take part in a series of races sponsored by Ferrari. There are 16 different International tracks to compete in ranging from Silverstone in England to Homestead-Miami Speedway in Florida and features over 50 different Ferrari models to race in.</p><p>There are a variety of modes to choose from: <em>Challenge</em>, <em>Arcade</em>, <em>Quick Race</em>, <em>Time Trial</em> and features the technical expertise of GP2 driver, Bruno Senna, who is the nephew of Formula One legend Ayrton to give the cars and game a more realistic feel including handling and a responsive AI similar to their real-life counterparts.</p><p>While the games are similar there are some differences such as graphics and control scheme (the PS2 and PS3 use a similar scheme while the Wii utilizes the Wii-Remote and the Wii Wheel). Also the PS3 has online capabilities where players can compete in online races.</p>"},{"name":"Festa!!: Hyper Girls Party (Genteiban)","year":2006,"developer":"","url":"sony_playstation2_f/Festa%21%21%20Hyper%20Girls%20Party%20%28Japan%29.zip","filesize":3477685808,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition release includes:</p><ul><li>Festa!!: Hyper Girls Party game</li><li>Festa!! special mook</li><li>Original audio drama CD</li></ul>"},{"name":"FIFA 13","year":2012,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART9/FIFA%2013%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%2CNl%29.zip","filesize":3394197793,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (European) / Soccer > Licensed","desc":"<p><em>FIFA 13</em> on the Playstation 2 doesn't have the same features as other console versions, it still has the FIFA 07 engine, and there's new commentary from Andy Townsend (Clive Tyldesley's commentary is again the same as in FIFA 07), and the only new updates are the latest transfers to each club and updated kits.</p><p>Game modes include Kick off (a simple friendly match), Be a Pro/Be a Keeper mode where the player can play as a single footballer or as a goalie), Career mode offers you to be manager, Player/Manager or just a player of a team. Accomplishment Mode is where you have to win trophies/scenarios to unlock fan shop points (in the fan shop you can unlock new stadiums, teams, footballs and third kits). There's also the regular season and tournament modes plus a Practice Mode.</p>"},{"name":"FIFA 14: Legacy Edition","year":2013,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART9/FIFA%2014%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%2CNl%29.zip","filesize":3306466722,"score":"","genres":"Sports > 2D scrolling > Direct control > Football (European) / Soccer > Licensed","desc":"<p><em>FIFA 14: Legacy Edition</em> is a version with minimal upgrades for the PS2 platform, focused mostly on bringing the content up to date for the contemporary season. Like the separate FIFA 13 for the PS2 the year before it uses the FIFA 07 game engine and the only updates are transfers, kits and soundtrack. Game modes are the same as previous offerings but include Kick Off (friendly), Season mode, Tournament mode, and Career mode where you can play as a player, player/manager or a manager.</p>"},{"name":"FIFA 2001 World Championship","year":2000,"developer":"Electronic Arts Canada","url":"sony_playstation2_f/FIFA%202001%20-%20World%20Championship%20%28Japan%29.zip","filesize":411160197,"score":7.7,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>FIFA 2001 comes back to the series' fast-paced roots. The gameplay is balanced differently to previous versions, and includes online play as an option. </p><p>It includes 17 leagues from around the world in addition to over 50 national teams. Exhibition, Tournament, League, Cup, Season, and Training modes are available to play, ranging from simple round-robin competition to simple knock-outs to combinations of the two, and the player rosters are as up-to-date as possible.</p>"},{"name":"FIFA Soccer 06","year":2005,"developer":"Electronic Arts Canada","url":"sony_playstation2_f/FIFA%20Soccer%2006%20%28USA%29%20%28En%2CEs%29.zip","filesize":2684365556,"score":7.3,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer > Licensed","desc":"<p>Featuring a brand new engine (replacing the one used in five titles since <em>FIFA 2003</em>), FIFA 06 features new controls and gameplay, the most visible being more animations and better-detailed ball and player physics and animation, the removal of the unpopular <em>Off the Ball</em> controls implemented in their <em>2004</em> version and remaking the free-kick interface so it's no longer obvious if the player decided for a shot on goal or a pass to a forward. Also new is the concept of \"Team Chemistry\" which affects how well a team plays collectively. </p><p>Featuring 26 leagues from 19 countries, 29 real stadiums and over 10'000 players with data for the 2005-06 seasons, as well as international teams, the game kept the \"Create a player\" feature as well as the many managing options untouched from previous versions. Career mode, the 15-year long climb to the top of the game, features new options such as sponsorships (which will only accept good results), player contracts and more weight on the player morale: a demoralized player (usually from not playing or possible influence from random events) is more likely to underperform as well as pressuring the \"Team Chemistry\" values downwards and might refuse attempts to renew his contract, leaving on a free transfer.</p><p>While there are still many unlockables in the game (mostly third kits), the way to earn points changed. Instead of gaining points from completing tasks (from entering the EA Trax or creating a player to winning the Champions League or completing a career), the player has over 100 scenarios to way in five difficulty levels.</p>"},{"name":"FIFA Soccer 07","year":2006,"developer":"Electronic Arts Canada","url":"sony_playstation2_f/FIFA%20Soccer%2007%20%28USA%29%20%28En%2CEs%29.zip","filesize":2719684807,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>Enhancing the engine debuted with the previous game and official 2006 World Cup game, FIFA Soccer 07 includes enhanced ball and player collision physics and more player animations adding to the 16 trick moves and first touch ball reception introduced to the game engine with the previous games in the series. Players can choose between 2 and 10 minutes halves in three different game speeds and four different difficulty levels. Over 510 teams are accurately represented in the game. 27 leagues from 20 nations are included, along a \"Rest of the World\" for the best teams in championships left outside the game and international teams. Spain, England (with two), France, Germany, and Italy also feature second divisions. Players can also create two clubs, customizing their badge, kits and home stadium, selecting players from anywhere in the game, along with the starting budget in manager mode. The player creation tool remains mostly unchanged, with the ability to customize everything, from faces (with a complete set of options, from jaw width to eyebrow shape) to the appearance and playing abilities.</p><p>While the focus of this yearly update was on the game engine, the Manager mode was also enhanced: players now also improve their playing ability from being active members of the squad, forcing the player to choose between keeping his celebrated stars near retirement in the starting eleven or give the benefits of the youth system a chance to shine. Another new feature, in what is now the primary mode of the series, is the ability to watch the game in a simplified text mode, with the ability to jump into action to turn the events still available. The points system was replaced by a less abstract currency model (with the ability to choose between Pounds, Euros or Dollars). Other game modes include Tournaments (including the creation of custom tournaments) and Challenges. By completing challenges (similar to the Global Challenges mode in World Cup 2006) the player can spend points in the Fanshop with items such as new teams, a special overhead camera, new balls from Adidas (including all original World Cup balls from 1974 to 2002), stadiums, third kits and special celebrations for created players.</p><p>Finally, online gaming received a new mode: Interactive Leagues. These are online-only leagues based on the fixtures of their real counterparts (English Premier League, French Ligue 1, German Bundesliga, and Mexican 1st division). Then, online players go head-to-head with their favorite teams with a victory counting one vote for their favorite team. Once the week is over, the team with more votes is declared the winner of the week, getting three points. The number of weekly matches a player can do in this mode is unlimited.</p>"},{"name":"FIFA Soccer 08","year":2007,"developer":"Electronic Arts Canada","url":"sony_playstation2_f/FIFA%20Soccer%2008%20%28USA%29%20%28En%2CEs%29.zip","filesize":2432006042,"score":7.1,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (European) / Soccer > Licensed","desc":"<p><em>FIFA Soccer 08</em> is another yearly update in the soccer franchise. The version for PS2 and PC uses the same graphics technology as in the years before while updating rosters and stats, adding new teams, new control options and new game modes.</p><p>As in other versions, there are 620 teams, from 30 national leagues, adding the Australian, Czech and Irish leagues. Returning game modes include single matches, tournaments, challenges, manager mode (with optional PS2-PSP connectivity) and online interactive leagues. The major new game mode is called Be A Pro - Co-op Season. Unlike the Be A Pro mode from the next-generation version where a single player is controlled via shoulder cam in one match only, the mode on PS2/PC lasts an entire season and features local co-op for up to four players with regular camera perspectives. Players can gain experience points for completing pre-set goals or being man of the match, which can be used to boost attributes.</p><p>Among the new control options are manual passes and crosses, with direction and strength determined by analog stick direction and length of the button press, respectively. On defense, the best defender for the current situation can be selected via the right analog stick. In one-on-one situations, it is now possible to switch control to the keeper directly, with manual saves and slide tackles possible.</p>"},{"name":"FIFA Soccer 09","year":2008,"developer":"Electronic Arts Canada","url":"sony_playstation2_f/FIFA%20Soccer%2009%20%28USA%29.zip","filesize":2863062801,"score":7.3,"genres":"Sports > Diagonal-down > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>LET'SFIFA09 * >MORE AUTHENTIC ACTION More than 350 new animations deliver the most authentic football experience on the PlayStation®2 computer entertainment system * >ALL-NEW CASUAL CONTROLS Pass, shoot, and score using a graduated gameplay system featuring a simplified two-button control configuration. * > BE A PRO: SEASONS Create a professional player or play as an existing superstar, then master his position during a four-year career. * > NEW SKILL MOVES Recreate awe-inspiring signature moves of real- world superstars with more than 30 professional skill moves.</p>"},{"name":"FIFA Soccer 10","year":2009,"developer":"Electronic Arts Canada","url":"sony_playstation2_f/FIFA%20Soccer%2010%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":2809400006,"score":8.4,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer > Licensed","desc":"<p>FIFA 10 is the 19th game of the series with new game features giving players new levels of control, new game modes and new strategy options for the teams. The game has over 30 leagues, 500 teams, 41 national teams, 50 stadiums and different weather conditions trying to create a realistic experience for the matches.</p><p>For FIFA 10 the manager mode has been revamped with many different improvements like a new transfer system, pre-season friendlies (only for PS3 and Xbox 360) or a different growth system. With Virtual Pro you can create a player and use it for the be-a-pro mode as well as other modes like the manager mode or the arena. You can also create a face on the official website of the game and download it for the game.</p>"},{"name":"FIFA Soccer 11","year":2010,"developer":"HB Studios Multimedia Ltd.","url":"sony_playstation2_f/FIFA%20Soccer%2011%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":2815043580,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer > Licensed","desc":"<p><em>FIFA Soccer 11</em> is the iteration of the <em>FIFA</em> franchise on the PS2 that covers the 2010-2011 season. The engine is the same dating back to the FIFA Soccer 07 PS2 instalment, and it sets the PS2 game apart from next-generation releases.</p>"},{"name":"FIFA Soccer 12","year":2011,"developer":"Electronic Arts Canada","url":"sony_playstation2_f/FIFA%20Soccer%2012%20%28USA%2C%20Brazil%29.zip","filesize":2765703143,"score":"","genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p>The PS2 <em>FIFA Soccer 12</em> installment in the soccer series is very different from the other console and PC versions of the 2012 game. It does not share any of the novelties introduced in those versions and is very similar in gameplay and features to FIFA Soccer 2011 and those of the years before. This PS2 version is still based on the FIFA Soccer 07 engine and uses the same commentary. The main addition is the updated player listings, jerseys and competitions.</p><p>It offers different modes of play such as Kick Off to play a simple exhibition game with either Be A Pro or Be A Keeper mode (where the player can play as a either a single player or a keeper on a team depending on the chosen mode). The Career mode offers a chance to play as either a player, player/coach or manage a team with Manager mode. Accomplishment mode is where the player has to beat certain scenarios/win trophies in order to unlock fan shop points.</p><p>The game also contains the usual Season and Tournament modes and also a Practice mode as well. In the Fan Shop, the player can unlock alternateive sound effects and two classic teams. Stadium packs unlock stadiums that can be used in Practice mode. Additional football and third kits can be unlocked as well.</p>"},{"name":"FIFA Soccer 2002","year":2001,"developer":"Electronic Arts Canada","url":"sony_playstation2_f/FIFA%20Soccer%202002%20%28USA%29%20%28En%2CDe%2CEs%2CNl%2CSv%29.zip","filesize":1133103305,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>With the new open passing system, FIFA 2002 allows you more freedom of play for the new season. Over 75 licensed national teams and 16 licensed leagues including the English Premier League are available for your control, and you have the opportunity to lead your team to the World Cup of 2002.Updates to the series also include:</p><p>Improved tackling system. Depending on which angle you make a tackle determines the referee's call.</p><p>Commentary by John Motson and Andy Gray.</p><p>New set plays (similar to the style of the NBA Live series) allow for more control over your players during critical corners or free kicks.</p><p>Consecutive seasons bring promotion or relegation of your team in Europe.</p>"},{"name":"FIFA Soccer 2003","year":2002,"developer":"Electronic Arts Canada","url":"sony_playstation2_f/FIFA%20Soccer%202003%20%28USA%29%20%28En%2CEs%29.zip","filesize":2208026885,"score":7.8,"genres":"Sports > 3rd-person (Other) > Diagonal-down > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>FIFA 2003 continues the trend of improving each year's new release by keeping the formula that worked, while also adding new features to make the game more enjoyable.</p><p>Some of these new features including a \"Freestyle\" control, which is activated by the right thumbstick, causing you to do special moves, such as a deke, or kick the ball a fair length forwards to gain some speed.</p><p>New and improved \"dead ball\" control makes corner kicks, free kicks, etc. more controllable and gives you more options.  The passing game has been improved to allow better passing by kicking directly to a teammate, passing to nowhere in particular, or open passing to allow anybody to take it.</p><p>FIFA 2003 includes all FIFA clubs, leagues, and players.</p>"},{"name":"FIFA Soccer 2004","year":2003,"developer":"Electronic Arts Canada","url":"sony_playstation2_f/FIFA%20Soccer%202004%20%28USA%29%20%28En%2CEs%29.zip","filesize":2208387615,"score":7.6,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p><em>FIFA Soccer 2004</em> features eighteen leagues, with thirty-five national teams and over ten thousand players. Take them into a multi-season career, or individual tournaments or matches.</p><p>Like EA's other 2004 games it has an in-depth career mode, where you must manage your budget and team. Promote players, demote players, and renegotiate contracts, all in an effort to get your team to the finals again and again.</p><p>The skills to master range from kicked passes and headers to lob passes and bicycle kicks. You can take control of players before the ball reaches them, which makes it easier to find space to take the ball. Like other 2004 titles, <strong>FIFA</strong> uses the right analog stick for it's Freestyle gameplay.</p><p>Console versions use the EA Sports Bio, whereby you can continue to improve your gamer level and unlock rewards by playing other 2004 titles, such as Madden NFL 2004 or NBA Live 2004.</p>"},{"name":"FIFA Soccer 2005","year":2004,"developer":"Electronic Arts Canada","url":"sony_playstation2_f/FIFA%20Soccer%202005%20%28USA%29.zip","filesize":2113780332,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer > Licensed","desc":"<p>Released only a few months after <em>Euro 2004</em>, FIFA 2005 brings several features to the franchise, such as the return of a player creation tool, where a player can be created from scratch from customizing the face (while it's not possible to define the texture like in previous EA Sports games such as <em>NHL 2000</em>, the player can customize the facial features such as shape of the eyes or the cheeks, in a way similar to RPGs such as Neverwinter Nights), accessories and playing abilities. It's also possible to create all kinds of competitions. The Career mode was also extended, allowing now up to 15 seasons, and giving the player the chance to turn the tide of a simulated match anytime. This mode is a \"light\" managerial mode, where the player not only plays, but also signs new players and increases the club's abilities in trainers, medical staff, and other club staff).</p><p>The main gameplay change was the addition of \"First Touch\" controls. By performing one of the \"trick\" moves before the player gets possession of the ball it's possible to do a number of moves, such as touching the ball forward to gain a few yards ahead of the defenders or touch the ball to one side, and roll to the other of a rushing defender, and then pick up up the ball a bit ahead leaving the opponent stranded, and the inclusion of a fake shot move, which allows forwards to sit a goalkeeper before scoring in style or make defenders jump from their positions, opening room for a through pass or a run into the goal. Other aspects of the game, such as the \"Off The Ball\" controls (allows the control of players that aren't in possession, moving them into an open position) remain unchanged.</p><p>Another new feature is the FIFA Shop, where the player can trade points earned in many ways, from simple tasks like having a peek at the Jukebox to obtaining 10 victories in a row in Career mode, for several items, such as third jerseys, additional music, more balls and night stadiums.</p><p>As it became the norm with the series, the game features 18 leagues and 38 national teams (some of these, due to licensing problems feature only generic kits and logos), summing up to around 11,000 real footballers.</p>"},{"name":"FIFA Street","year":2005,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART9/FIFA%20Street%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":1460105630,"score":6.4,"genres":"Sports > Diagonal-down > 2D scrolling > Tricks / stunts > Football (European) / Soccer > Licensed","desc":"<p>As a spin-off of the FIFA lineage, <em>FIFA Street</em> combines arcade action with the culture of freestyle street soccer. By removing the rules from the simulation soccer experience, FIFA Street exposes the heart of the world's beautiful game, on-the-ball flair, and individual style.</p><p>Leading this movement are the world's top professional players, showing off their skills and individual style in 4-on-4 match-ups against the backdrop of global venues that represent the true culture of street soccer. In the game's dynamic 1-on-1 encounters, beating your opponent will require skill, technique, and the careful selection of specific moves. Take on the best and earn their respect, gradually building your reputation and team into an unstoppable force, that leads the tide of street soccer.</p>"},{"name":"FIFA Street 2","year":2006,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART9/FIFA%20Street%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1617708972,"score":6.6,"genres":"Sports > Diagonal-down > 2D scrolling > Tricks / stunts > Football (European) / Soccer > Licensed","desc":"<p>Take your skills out of the stadium and into the street in EA's second installment of the FIFA Street franchise. <em>FIFA Street 2</em> includes a new trick stick control mechanic, improved tricks, and a skill-testing juggle mechanic. You can dupe your opponent, juggle the ball on your knees and shoulders, and there are various new combos to show off. Pick from 20 teams from around the globe and watch over 300 of your favorite football stars duel it out in 4-on-4 match-ups. Select from 10 playable venues ranging from London's Westway Leisure Center to the sandy beaches of Brazil.</p><p>You can do quick matches (Play Now), change the looks and skills of players in the Creation Zone, and design your own venue. The main game modes include Friendly, Rule the Street (the career mode), and Skills Challenge where you can show off your football tricks. The career mode adds new goals in this version, based on acquiring a certain amount of skill points, scoring lots of goals, or scoring only with gamebreakers. You can select a radio station to play during the matches, mixing music with commentary.</p>"},{"name":"FIFA World Cup: Germany 2006","year":2006,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART9/FIFA%20World%20Cup%20Germany%202006%20%28Europe%29%20%28En%2CEs%2CPt%29.zip","filesize":2180818340,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Europe > Licensed","desc":"<p>Released one month before the actual World Cup 2006, this game lets players play all the matches before they even started. Featuring 12 official German stadiums and all the teams that qualified for the World Cup 2006 in Germany, plus additional teams and unlockable classic players. The playable modes let you try any of the qualifying stages or skip right to the world cup mode assuming as one of the qualified teams. Additional modes include Global Challenge where you can replay 40 historical moments in football history to change the outcome and various multiplayer matches.</p>"},{"name":"Fight Club","year":2004,"developer":"Genuine Games, Inc.","url":"sony_playstation2_f/Fight%20Club%20%28USA%29.zip","filesize":1219828406,"score":4.1,"genres":"Action > 3rd-person (Other) > Fighting > Licensed","desc":"<p><em>Fight Club</em> is based on David Fincher's film adaption of Chuck Palahniuk's novel of the same name. Fed up with consumerist American culture, a fight club is founded as a new type of therapy through bare-knuckle fighting. The game focuses on the fights and uses many characters and environments from the original story. You can create a new fighter or clone one of the generated characters. There are three general fighting styles to choose from: grappling, kung fu or brawling. The moves range from basic punches to devastating moves with broken bones, ripped clothes and real-time facial deformation. After each successful fight, you earn Character Development Points (CDP's) which can be used to upgrade or heal your character.</p><p>Aside from the regular arcade, survival and training mode, there is a story mode in which you need to work your way up as a rookie to become a key player in Project Mayhem in a storyline very loosely based on the original plot. Both the PS2 and Xbox version have an online multiplayer mode as well.</p><p>The game music has tracks by famous bands such as The Dust Brothers, Limp Bizkit, Korn and Queens of the Stone Age.</p>"},{"name":"Fight Night 2004","year":2004,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART9/Fight%20Night%202004%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1039281860,"score":7.8,"genres":"Sports > 3rd-person (Other) > Boxing","desc":"<p><em>Fight Night</em> is EA Sports' new boxing series, replacing the previous <em>Knockout Kings</em> line of games.</p><p>You have the option of creating your own personalized boxer, and entering a career mode, where you start off on the lowest rung in dirty, rundown gyms, as you make your way up the ropes to become the undisputed champion. Throughout your career you will have to battle many enemies, all vying for the same title. As you play, you will be able to train, improving your boxer's stats. You can hit a punching bag to increase power and speed, spar with an opponent for more stamina and agility, attack the dummy to improve chin and body, or hit the mitts to improve heart and cut. Besides career mode, you have access to the standard modes.</p><p><em>Fight Night 2004</em> features the \"Total Control\" system, which utilizes both sticks to give you complete percision over your boxer's moves. The right analog stick controls all the punching, and the left stick controls movement and defense/blocks.</p><p>There are several unlockables available, all of which must be earned through career mode. You can buy new clothes, entrance music, even new girls to accompany you to the ring.</p><p>The PlayStation 2 version of <em>Fight Night 2004</em> supports online play via EA Sports' online network.</p><p>As with all other EA Sports titles, <em>Fight Night 2004</em> utilizes the EA Sports Bio, which tracks your progress through all EA Sports games. The more games you play, the longer you play them, and the better you do translates into a higher Gamer Level. When you reach certain levels, you can unlock special rewards.</p>"},{"name":"Fight Night Round 2","year":2005,"developer":"Electronic Arts Chicago","url":"PS2_COLLECTION_PART9/Fight%20Night%20Round%202%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2357221842,"score":8.2,"genres":"Sports > 3rd-person (Other) > Fighting > Boxing","desc":"<p>EA's Fight Night returns in its second installment. Once again, you can create a new boxer and start a career that begins as an amateur in a shady gym somewhere in Queens, NY, and fight your way up to the top. Alternatively, you could relive the careers of some legendary boxers.</p><p>Of course, you could go for a simple match with either a computer or a live opponent.</p><p>Round 2 offers many new features, like fancy particle effects that show blood and sweat spraying into the camera in ultra slow-motion. The \"Total Boxer Control\", which lets you throw punches by making certain movements with the analog stick, has been improved. There are also many ways to customize the appearance of your character, up to the shaping of the cranium and ears.</p><p>The soundtrack consists of a dozen contemporary (but unfortunately edited) hip-hop tracks.</p><p>All the previous features are still there too: You can play online (now on Xbox too), and you can unlock more moves, clothes, and equipment as you proceed in career mode.</p><p>Also, included in the GameCube version is a port of the SNES game Super Punch-Out!!</p>"},{"name":"Fight Night Round 3","year":2006,"developer":"Electronic Arts Chicago","url":"PS2_COLLECTION_PART9/Fight%20Night%20Round%203%20%28Europe%29%20%28En%2CFr%29.zip","filesize":2191083977,"score":8.3,"genres":"Action > Sports > 3rd-person (Other) > Fighting > Boxing","desc":"<p>EA Sports' <em>Fight Night Round 3</em> from EA Chicago lets you make your own fighter, train them up, and literally take on the world. </p><p>Start by creating your own champ and customizing how they look, what equipment they have, their fighting style, their weight class, their signature move, and even their own illegal hit. Get equipment and trainers for your fighter to enhance his look and performance.</p><p>Then take your fighter to career mode where you'll play fight your way up from the local gym all the way up to five-star venues. Get trainers to enhance your training and boost your speed and power. Play against randomly generated fighters all the way up through the ranks till you beat them in points or to a pulp. Certain fights may get you a bit of extra money as an incentive, or give you a promotional deal, but pick your fights carefully because strategy inside the ring won't matter if you mismanage your fisher outside.</p><p>Fight smart during the fight by using the total punch control system to throw the punches you want to by using the analog stick. The total punch control system maps your fists to the analog stick getting rid of the need for senseless button mashing.</p><p>You can also play in historical fights like Taylor vs. Hopkins, Gatti vs. Ward, or Robinson vs. Lamotta in the ESPN Classic mode to play in the fights that made boxing history.</p><p>Once you've got the computer down for the count, you can play with any fighter or user created fighters or any of the ESPN Classic fights in local multiplayer with a friend. You can also take the fight online and prove your the real champion of the world against any opponent anytime, anywhere.</p>"},{"name":"Fightbox","year":2004,"developer":"Gamezlab","url":"PS2_COLLECTION_PART9/FightBox%20%28UK%29.zip","filesize":302459840,"score":"","genres":"Sports > 3rd-person (Other) > Platform > Licensed","desc":"<p>Re-live the FightBox BBC TV experience. Design and build your own virtual athlete to take part in a series events against other warriors and the Sentients, to take the ultimate prize of the Fightbox, and become the 7th Sentient.</p><p>The retail game features all the arenas from the TV series, plus 4 new arenas, allowing you to replay the TV series in your own home, or playing your own tournaments.</p><p>After building and training your warrior, you then take part in a series of test - completion of these allows you to upgrade your warriors strength, speed and weapons.</p><p>The gameplay consists of various gladitorial style events, such as fighting other warriors on moving platforms, or two warriors each trying to collect as many points from the same arena.</p>"},{"name":"Fighter Maker 2","year":2002,"developer":"Enterbrain, Inc.","url":"sony_playstation2_f/Fighter%20Maker%202%20%28USA%29.zip","filesize":389099115,"score":6.7,"genres":"Action > 3rd-person (Other) > Fighting > Martial arts","desc":"<p><em>Fighter Maker 2</em> is a 3D versus fighting game in which the player can create his or her own fighter. The game is a sequel to Fighter Maker for the PlayStation 1.</p><p>The things the player can personalize on his or her fighter are: special moves, body type, costumes and fighting styles like karate or freestyle. Over 260 separate parts can be customized on each fighter model. If the fighter is complete it can be tested in a VS mode.</p>"},{"name":"Fighting Angels","year":2004,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART9/Fighting%20Angels%20%28Europe%29.zip","filesize":94724647,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting","desc":"<p><em>Fighting Angels</em> is a story-less 3D fighting game featuring an all-female cast. The game is a 1-on-1 fighting game with minor wrestling influences: players can freely move in all directions around the arena, the ropes surrounding the arena can be incorporated into the fighting, and there is ground-based grappling much like in wrestling.</p><p>Each character has four attacks -- weak and strong punches and kicks -- which have three variations each. Besides normal attacks, there are so-called \"Sexy Attack\", which are weaker than normal attacks but are much flashier and will build the character's \"Sexy Gauge\". There are also \"Plain Attack\", which are more traditional but drain the Sexy Gauge. If a character's Sexy Gauge is full, they'll have a chance to use a super-powerful Sexy Combo Attack, which is often powerful enough to completely drain the opponent's health. It is also possible to block and use a basic grab move, as well as pick up objects around the arena to use as weapons.</p><p>The game includes a number of different modes. The main single-player mode is tournament mode, in which the player chooses a character and tries to defeat each computer opponent in order. There is also a standard versus mode for one or two players, a survival mode, and a practice mode. As is the standard for Tamsoft's Simple 2000 sports games, there is also a view mode where the player can dress and of the characters in any unlocked outfit and watch their animations from any angle.</p>"},{"name":"Fighting Beauty Wulong","year":2006,"developer":"Dream Factory Co., Ltd."},{"name":"Fighting for One Piece","year":2005,"developer":"Flat-Out Inc.","url":"sony_playstation2_f/Fighting%20for%20One%20Piece%20%28Japan%29.zip","filesize":272237722,"score":"","genres":"Action > Side view > Anime / Manga > Fighting > Sea pirates / Caribbean > Licensed","desc":"<p><em>Fighting for One Piece</em> is a 3D versus fighting game played from a side view perspective and based on the One Piece anime and manga series. Each of the fighter can run and jump and has his/her own fighting techniques including special attacks. Several fighting arenas are available and the game offers thirteen characters from the series to play as.</p><p>Playable characters include: Monkey D. Luffy, Roronoa Zoro, Nami, Usopp, Sanji, Chopper, Nico Robin, Franky, Smoker, Crocodile, Aokiji, Portgas D. Ace and Enel. Game modes offered are Fighting Mode, VS Fight mode, Gamble Mode, Record Mode, Replay mode and a Training mode.</p>"},{"name":"Fighting Fury","year":2000,"developer":"Arc System Works Co., Ltd.","url":"PS2_COLLECTION_PART9/Fighting%20Fury%20%28Europe%29.zip","filesize":558325481,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p><em>Fighting Fury</em> is a one on one fighting game, based on the Grappler Baki Anime. The 'Fighting Fury' tournament is a place where the best fighters from different combat techniques come together to battle for victory. There are 13 characters to choose from, and each is skilled in a different fighting style (Karate, Wrestling, Kenpo, Street Fighting etc). Players are able to create their own moves lists by learning moves from the other fighters, and then editing them together to customize their character. The game also features an 'Endorphin Gauge', which will unlock super powerful moves.</p>"},{"name":"Final Approach","year":2004,"developer":"PrincessSoft","url":"sony_playstation2_f/Final%20Approach%20%28Japan%29.zip","filesize":1442058879,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Sci-fi / futuristic > Comedy > Romance","desc":"<p><em>Final Approach</em> is a romantic comedy visual novel following the story of Ryo Mizuhara who finds himself an unwilling participant in a secret government operation to oppose the declining of birthrates in Japan. Ryo ends up paired with a young girl, Shizuka, who in turn gets presented as his new fiancée. Despite his protests, the bodyguards that came in with Shizuka doesn't give Ryo much of a chance to throw her out, plus she herself isn't the one to take no for an answer. Ryo is forced to do as best he can with the cards he's been dealt, and so his everyday boring life suddenly turns filled with unexpected surprises. This game originated on PS2 and as such was never an adult visual novel to begin with. It's release date coincides with the release of the TV anime series with the same title.</p>"},{"name":"Final Approach (Shokai Genteiban)","year":2004,"developer":""},{"name":"Final Approach 2: 1st Priority","year":2008,"developer":"PrincessSoft","url":"sony_playstation2_f/Final%20Approach%202%20-%201st%20Priority%20%28Japan%29.zip","filesize":1800101415,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Comedy > Romance","desc":"<p><em>Final Approach 2: 1st Priority</em> is a visual novel following the story of Kodama Makoto, an average high school student, whose fate takes a sharp turn when he meets Anna, an idol girl, who suddenly announces that she is going to be engaged to him. Both of them are against this development, but despite all the struggle, they end up living together.</p>"},{"name":"Final Armada","year":2007,"developer":"I-Imagine Interactive","url":"PS2_COLLECTION_PART9/Final%20Armada%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":923922193,"score":"","genres":"Action > Behind view > Shooter > Tank > Sci-fi / futuristic","desc":"<p>Propel yourself into explosive action, with Final Armada, as you take control of the Aggressor a powerful and sophisticated transforming combat vehicle of mass destruction. Fight your way through swarms of enemies as you confront a powerful Alien race that has devastated the colony world Taro-459! Foil the Qorax, save Taro-459 and become the ultimate hero! Up to 4 players can battle in wireless multiplayer mode.</p>"},{"name":"Final Fantasy X","year":2001,"developer":"Square Co., Ltd.","url":"PS2_COLLECTION_PART9/Final%20Fantasy%20X%20%28Europe%2C%20Australia%29.zip","filesize":4186681760,"score":8,"genres":"Role-playing (RPG) > Behind view > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Direct control > Menu structures > Multiple units/characters control > Fantasy > Sci-fi / futuristic","desc":"<p>Tidus is a young athlete who lives in a futuristic city of Zanarkand - \"the city that never sleeps\". He plays blitzball, a ball game where players throw the ball while flying around. Suddenly, a terrible disaster happens. A huge dark wave engulfs the city, spawning monsters. Tidus comes in contact with the mysterious creature, and as a result finds himself in a different world, a thousand years into the future. The civilization he is used to doesn't exist any more. He learns that the world he knew was destroyed by Sin, a terrible being that is believed to be indestructible. Tidus meets a young summoner named Yuna, and joins her as a guardian on her quest to put an end to Sin.</p><p><em>Final Fantasy X</em> is Japanese-style role-playing game set in a world somewhat similar to South Asia. Only individual locations can be physically explored; there is no \"world map\" in the game, and exploration is fairly linear. Enemy encounters are random; the game abandons the series' traditional ATB (active-time battle) combat in favor of a Conditional Turn-Based Battle system, in which the turns of the participants are determined by characters' stats and actions, with turn order displayed in the upper corner of the screen. </p><p>The game also departs from the usual leveling up system. There are no character levels in the game: instead, experience points received after battles can be allocated by the player directly to upgrade the characters' parameters. Each character has his or her special \"sphere map\", with straight or branching paths containing spots that increase the character's personal statistics, or teach him or her active and passive abilities. The characters are given distinct class attributes, and it is possible top switch between all the party members during the same battle. Monster summons (called aeons in the game) now behave like playable characters, have their own hit points (HP), and can fight for the party until defeated.</p><p>Conversations that occur during cutscenes have voice overs, for the first time in the series. The game features various mini-games, the most prominent of which are blitzball tournaments.</p>"},{"name":"Final Fantasy X International","year":2002,"developer":"Square Co., Ltd.","url":"sony_playstation2_f/Final%20Fantasy%20X%20International%20%28Japan%29%20%28En%2CJa%29.zip","filesize":4108015140,"score":8.3,"genres":"Role-playing (RPG) > Behind view > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Direct control > Menu structures > Multiple units/characters control > Fantasy > Sci-fi / futuristic","desc":"<p><em>Final Fantasy X International</em> is the Japanese re-release of Final Fantasy X with content not available in the original NTSC releases. These include battles with dark versions of the game's aeons, the superboss Penance, and various added scenes. It also contains a video clip of 12 minutes, Eternal Calm, bridging the gap with the sequel Final Fantasy X-2. The new content was included in the European version in 2002.</p>"},{"name":"Final Fantasy X-2","year":2003,"developer":"Square Co., Ltd.","url":"PS2_COLLECTION_PART9/Final%20Fantasy%20X-2%20%28Europe%2C%20Australia%29.zip","filesize":3585129354,"score":7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Real-time > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p><em>Final Fantasy X-2</em> is the first direct sequel in the history of the series. The events of the game take place two years after Yuna and her guardians defeated Sin in Final Fantasy X, and peace was restored in Spira. The Yevon religion has all but disappeared, and two political factions begin to compete for dominance: the Youth League, led by Mevyn Nooj, and the New Yevon Party, led by Praetor Baralai. Meanwhile, Yuna's cousin Rikku finds a strange sphere that mysteriously shows an image resembling Tidus, Yuna's one and only love. Rikku brings the sphere to Yuna. Determined to discover the truth behind the mystery, Yuna organizes a journey of \"sphere-hunting\", to collect more spheres scattered around the world and perhaps find Tidus.</p><p>The sequel brings back the ATB (active time battle) system, which was replaced by turn-based combat in its immediate predecessor. The battles develop at a somewhat quicker pace than earlier games in the series, with more emphasis on quick decision and timing. The player can control only three characters throughout the game, all of them female: Yuna and her friends Rikku and Paine. The job system similar to that of Final Fantasy V is featured, with the possibility to learn various abilities and customize character classes. Limited jumping and climbing are now possible in certain locations. The game's structure is less linear than in most other games belonging to the genre. Though there is only one way to advance through the main story, the player can opt to visit most other locations early in the game, since the airship is available already at that stage.</p>"},{"name":"Final Fantasy X-2: International + Last Mission","year":2004,"developer":"Square Enix Co., Ltd.","url":"sony_playstation2_f/Final%20Fantasy%20X-2%20International%20%2B%20Last%20Mission%20%28Japan%2C%20Asia%29.zip","filesize":3864599645,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Real-time > Turn-based > Fantasy","desc":"<p>Just like Final Fantasy X International, Final Fantasy X-2 was treated to a Japanese-only international version. It includes 2 completely new dresspheres and an additional Last Mission at a location called Yadonoki Tower. Players can also choose Tidus, Auron and Seymour from the previous game during battles. For the main story (not Last Mission), the English voiceovers are used, with Japanese subtitles.</p>"},{"name":"Final Fantasy XI - All in One Pack 2004","year":2003,"developer":"","url":"sony_playstation2_f/Final%20Fantasy%20XI%20-%20All%20in%20One%20Pack%202004%20%28Japan%29.zip","filesize":1998501946,"score":7.8,"genres":"Compilation","desc":"<p>This release includes the main game Final Fantasy XI Online and the expansion Final Fantasy XI Online: Rise of the Zilart. Roughly one year after the release of <em>Final Fantasy XI</em> in Japan, the first expansion <em>Rise of the Zilart</em> was released. At the same time, <em>Final Fantasy XI Online: All-In-One Pack 2003</em>, a bundle including the game and the expansion was released in Japan. The subsequent releases of <em>Final Fantasy XI</em> for PS2 and Windows in North-America and Europe also included <em>Rise of the Zilart</em>.</p>"},{"name":"Final Fantasy XI - All in One Pack 2006","year":2006,"developer":"","url":"sony_playstation2_f/Final%20Fantasy%20XI%20-%20All%20in%20One%20Pack%202006%20%28Japan%29.zip","filesize":2471108711,"score":"","genres":"Compilation","desc":"<p>This collection is an updated release of Final Fantasy XI Online: The Vana'Diel Collection. In addition to the previous compilation with the original game and two expansion packs, it now includes three add-ons:* Rise of the Zilart</p><ul><li>Chains of Promathia</li><li>Treasures of Aht Urhgan</li></ul><p>The collection comes with a fold-out map of Vana'diel with mini walkthroughs to help new players get started, a 30-day free trial, and a Vana'diel buddy pass to invite a friend to try the game free for 30 days. It is released at a budget price.</p>"},{"name":"Final Fantasy XI Online","year":2002,"developer":"Square Enix Co., Ltd.","url":"sony_playstation2_f/Final%20Fantasy%20XI%20-%20Online%20%28USA%29.zip","filesize":1659640218,"score":5.9,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Persistent > Massively Multiplayer > Fantasy","desc":"<p><em>Final Fantasy XI Online</em> is an MMORPG which is played in the persistent medieval world of Vana'diel. This base version was only released in Japan. The final North American release includes the Rise of the Zilart expansion pack and the XBox 360 version includes two more expansions: Chains of Promathia and Treasures of Aht Urhgan.</p><p>Create your own character by choosing your race, gender, face, body size and job. The five unique races are: Hume, Elvaan, Tarutaru, Mithra (female only), and Galka (male only).</p><p>Beginning jobs include: Warrior, Monk, Thief, White Mage, Black Mage and Red Mage. More jobs, such as Bard, Paladin, Beastmaster or Ranger, become available after certain quests are completed. Players can change their job at any time, but only in their Mog House, and each job has its own experience pool and level. They also each have unique traits that are acquired by leveling up, and their own set of abilities. The latter are not acquired by leveling, but by using scrolls bought from shops or acquired in special job quests. Each scroll requires a minimum level to be used. A second \"support\" job can also be set and changed at the Mog House by completing a special quest. The support job level is always maxed at the half of the main job level, rounded down. The character has access to all abilities, skills and traits from both jobs at their current level. The second job also adds to the characters stats. The maximum level a character can attain by gaining experience from battles and quest is 50, but, thanks to the game updates and add-ons, that maximum can eventually be raised to 55, 60, 65 and so forth, up to level 100 by completing the corresponding quests. At level 75, the character gains the ability to gather experience in a separate pool rather than the level pool, to earn merit points that can be spent to improve some aspects of the character.</p><p>Join other players to form a party of up to six players, on even an alliance of multiple parties, on various servers to fight the evil beastmen, the other species from Vana'diel (Orcs, Goblins, Quadavs, Yagudos, etc.). You can communicate with other players in your group using text and body language. A special device called a linkshell can be used by a group of players to communicate with each other, like in a chat channel.</p><p>Traveling through Vana'diel can be done by foot, on airships, riding a Chocobo, or by teleporting to the outposts scattered in each area. To teleport to a selected location, a supplies quest must first be completed. Next to each outpost is a book that enables special trainings. By defeating specific enemies, the character will gain extra experience and gils from those training manuals. Once engaged in a battle, the character will hit the targeted enemy if it is in range. Additional actions can be selected from a list, or used via a macro system. Aggressive foes will pursue their target until it has moved to another area.</p>"},{"name":"Final Fantasy XI Online: A Crystalline Prophecy","year":2009,"developer":""},{"name":"Final Fantasy XI Online: A Moogle Kupo d'Etat","year":2009,"developer":""},{"name":"Final Fantasy XI Online: A Shantotto Ascention","year":2009,"developer":""},{"name":"Final Fantasy XI Online: Chains of Promathia","year":2004,"developer":"","url":"sony_playstation2_f/Final%20Fantasy%20XI%20-%20Online%20-%20Chains%20of%20Promathia%20%28USA%29.zip","filesize":1379328290,"score":"","genres":"DLC / Add-on > Item > Map / level > NPC / enemy > Other > Story / mission","desc":"<p>This is the 2nd Expansion Pack for Final Fantasy XI Online. In this expansion, players can learn more out about the legends talked about in the main game.</p><p>Journey through new territories, find new equipment, and meet brand new NPCs as well as monsters in the lands of Movalpolos, Bibiki Bay, Tavnazian Archipelago and Uleguerand Range.</p><p>This expansion cannot be played without installing the full version of Final Fantasy XI. It has been included in the first release of the European Windows version, along with the first expansion pack.</p>"},{"name":"Final Fantasy XI Online: Heroes of Abyssea","year":2010,"developer":""},{"name":"Final Fantasy XI Online: Rise of the Zilart","year":2003,"developer":"Square Enix Co., Ltd."},{"name":"Final Fantasy XI Online: Scars of Abyssea","year":2010,"developer":""},{"name":"Final Fantasy XI Online: Seekers of Adoulin","year":2013,"developer":"Square Enix Co., Ltd."},{"name":"Final Fantasy XI Online: The Vana'Diel Collection","year":2004,"developer":"Square Enix Co., Ltd."},{"name":"Final Fantasy XI Online: Treasures of Aht Urhgan","year":2006,"developer":"","url":"sony_playstation2_f/Final%20Fantasy%20XI%20-%20Online%20-%20Treasures%20of%20Aht%20Urhgan%20%28USA%29.zip","filesize":1394622839,"score":6.9,"genres":"DLC / Add-on > NPC / enemy > Other > Story / mission","desc":"<p><em>Treasures of Aht Urhgan</em> is the third expansion for the original Final Fantasy XI Online game. It introduces a new continent on Vana'diel: Aridjiah (known as the Near East), with the Aht Urhgan race. Just like the previous expansions, there are new jobs available: Blue Mage, Corsair and Puppetmaster. New monsters have been included as well. This expansion, along with the first two, is included with the Xbox 360 release of the game.</p>"},{"name":"Final Fantasy XI Online: Ultimate Collection","year":2009,"developer":""},{"name":"Final Fantasy XI Online: Vana'Diel Collection 2008","year":2007,"developer":""},{"name":"Final Fantasy XI Online: Vision of Abyssea","year":2010,"developer":""},{"name":"Final Fantasy XI Online: Wings of the Goddess","year":2007,"developer":"","url":"sony_playstation2_f/Final%20Fantasy%20XI%20-%20Online%20-%20Wings%20of%20the%20Goddess%20Expansion%20Pack%20%28USA%29.zip","filesize":1586861195,"score":6.3,"genres":"DLC / Add-on > Map / level > NPC / enemy > Other > Story / mission","desc":"<p><em>Wings of the Goddess</em> is the fourth chapter of the  Final Fantasy Online series and add-on to Final Fantasy XI Online. It features new quests for players to explore and new locations to explore and defeat new enemies and monsters with new jobs that can be obtained.</p><p>Not only can players explore online through the Xbox 360, but also through the PC platform as well as the Playstation 2 version.</p>"},{"name":"Final Fantasy XII","year":2006,"developer":"Square Enix Co., Ltd.","url":"PS2_COLLECTION_PART9/Final%20Fantasy%20XII%20%28Europe%2C%20Australia%29.zip","filesize":3653004901,"score":8.7,"genres":"Role-playing (RPG) > Behind view > Real-time > Fantasy","desc":"<p>Two powerful empires, Archadia and Rozaria, are at war. All they care for is victory over the opponent. In order to achieve it more quickly, Archadia invades the small kingdom of Dalmasca. The young prince of Dalmasca falls in battle shortly after his marriage to the beautiful princess Ashe. The king is murdered under mysterious circumstances just before signing a peace treaty with Archadia. The iron rule of the empire is established in the small country.</p><p>The player takes control of a young thief named Vaan who lives in Rabanastre, the capital city of Dalmasca. Through a series of events Vaan finds himself involved in the political struggle, hoping to avenge the death of his treacherously murdered brother.</p><p><em>Final Fantasy XII</em> is set in Ivalice, a fantasy world which also served as a setting for Final Fantasy Tactics. The game differs from its predecessors in several core gameplay-related aspects. The game world is composed of vast areas with visibly walking enemies. There are no separate battle screens in the game; combat takes place in the same environment as exploration. Player-controlled characters can freely move during combat. Actions are still selected by choosing commands from a pop-up menu, and each character has a traditional ATB bar that determines when he or she may act; however, overall the combat resembles the \"real-time with pause\" system of Western role-playing games such as Knights of the Old Republic.</p><p>The player can issue specific commands to the party members, or assign to them combat strategies (called \"gambits\" in the game). New magic, abilities, and equipment are bought from stores or found in containers in the world. Before a character can use any of these, the player has to buy a corresponding license by spending license points earned in combat. These act like skill points, and can be allocated by the player manually on the character's license board.</p><p>In addition to the enemies and bosses found by following the story, the player can also accept \"Hunts\" posted in bars or offered to the player in conversations. These are optional encounters where the player has to track down and either trap or lure a very powerful monster before defeating it.</p>"},{"name":"Final Fantasy XII: International Zodiac Job System","year":2007,"developer":"Square Enix Co., Ltd.","url":"sony_playstation2_f/Final%20Fantasy%20XII%20International%20-%20Zodiac%20Job%20System%20%28Japan%29.zip","filesize":3789366118,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Real-time > Turn-based > Fantasy","desc":"<p><em>International Zodiac Job System</em> is a Japanese-only re-release of the original Final Fantasy XII. It comes in a slipcase and contains the following changes and enhancements:* Improved voice acting: US voices with Japanese subtitles</p><ul><li>16:9 Widescreen compatible</li><li>Completely redone job system</li><li>Double-speed mode which allows you to complete the game faster.</li><li>Survival style trial mode</li><li>More control over guest characters and summoned creatures</li><li>FFXII Archives booklet</li><li>Final Fantasy 20th Anniversary DVD</li></ul>"},{"name":"Final Fantasy: 25th Anniversary Ultimate Box","year":2012,"developer":"Square Enix Co., Ltd."},{"name":"Final Fight: \"Streetwise\"","year":2006,"developer":"Capcom Studio 8, Inc.","url":"PS2_COLLECTION_PART9/Final%20Fight%20-%20Streetwise%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2579168244,"score":4.6,"genres":"Action > Behind view > Beat 'em up / brawler","desc":"<p>The player takes the role of Kyle Travers, an underground pit fighter and brother of Cody Travers from the original Final Fight series. Cody has been kidnapped and, as a new drug plunges modern day Metro City into chaos, Kyle must rescue his older brother. </p><p>The game itself is non-linear 3D beat-em-up. Unlike the previous games, players can interact with NPCs as well as pursue new side missions. An all-new combo system has also been incorporated in which the player can buy new moves to expand Kyle's moveset as the game progresses. Like the previous games, players can pick up various objects like pool cues, shotguns, and lead pipes to use in combat.</p>"},{"name":"Finalist","year":2006,"developer":"PrincessSoft","url":"sony_playstation2_f/Finalist%20%28Japan%29.zip","filesize":1423609183,"score":"","genres":"Adventure > 1st-person > Anime / Manga","desc":"<p><em>Finalist</em> is romance comedy visual novel written by the scenario writer of Final Approach romance comedy adventure game. The story takes place in a high-school campus, where the protagonist, Yoshiki Shirasagi, has been assigned a room in the women's dormitory, being mistaken for a girl due to his name. You play as Yoshiki, a first year high-school student, in a typical love simulation visual novel game where you will interact with other girls in your school and dormitory. Some of the girls are: Tamamo Sawaragi (who lives next door to you), Honoka Serizawa (Tamamo's roommate), Masaho Susukino (senior student, very social and bright), and Wakana Sakoi (a talented violinist). Each of the heroines in this game were designed by a different character designer to give them unique feel and personality.</p>"},{"name":"Finalist (Shokai Genteiban)","year":2006,"developer":""},{"name":"Finkles World","year":2007,"developer":"CyberPlanet Interactive Public Co., Ltd.","url":"PS2_COLLECTION_PART9/Finkles%20World%20%28Europe%29.zip","filesize":18723202,"score":"","genres":"Puzzle > Fixed / flip-screen > Tile matching puzzle","desc":"<p>Welcome to miracle forest, the place where Finkles live. They like to fly out of the forest, so you will have to catch them before they run away and the door closes, as they will be forever lost from the magic forest.</p>"},{"name":"Finny the Fish & the Seven Waters","year":2004,"developer":"SEGA Wow Inc.","url":"sony_playstation2_f/Finny%20the%20Fish%20%26%20the%20Seven%20Waters%20%28USA%29.zip","filesize":2771906907,"score":"","genres":"Action > 3rd-person (Other) > Puzzle elements","desc":"<p>It's a fish-eat-fish world in the vast depths of the waters with countless others as predator and fishing humans making life dangerous, but something far more sinister lurks in the deepest fathoms. As an earthquake shakes the very foundations of Finny's home stream, it also shakes the foundations of his fishy life. Now lead by Kappa, the protector of Finny's home, he must travel throughout the vast seas in order to meet the Masters and collect their statues.</p><p>One of the most important parts of the game is the hunger meter. Finny must eat fish in order to survive, or else his hunger meter will deplete and he will gradually lose health. He is able to lock onto different fish with a targeting system. He can even eat fish that are larger than him by biting it a certain amount of time. However, he cannot eat lures. In order to escape from fishing humans, he must either break the fishing line or jump out of the water to unhook himself. He'll also need to avoid other dangers such as alligators and electric eels. The game keeps track of what fish he's eaten and what lures he's taken.</p><p>Other than that, this game has many puzzles to be solved and people to help. You can collect one item at a time to bring them to people that need them.</p>"},{"name":"Fire Heroes","year":2004,"developer":"Garden Ltd.","url":"PS2_COLLECTION_PART9/Fire%20Heroes%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":831759082,"score":"","genres":"Action > Simulation > 1st-person > Behind view > Real-time > Contemporary > Healthcare > Survival","desc":"<p>December 24th... In St. Albert City looms the construction site of the Clayton Tower... 7:32PM: A massive explosion occurs, followed by a fire.<br><br>* YOU CAN CHOOSE 1 OF 3 LEAD CHARACTERS, DOUGLAS THE FIREMAN, MAX THE COP, OR SCOTT THE ARCHITECT, TO PLAY THE GAME AS.<br>* THE ENDING OF THE GAME WILL CHANGE DEPENDING ON YOUR GAME PLAY.<br>* USE THE INFORMATION GIVEN ON THE TOWER MAP TO EXPLORE ALL 30 FLOORS OF THIS SPRAWLING TOWER AND RESCUE ALL SURVIVORS.</p>"},{"name":"Fire Pro Wrestling Returns","year":2005,"developer":"S-NEO Co., Ltd.","url":"PS2_COLLECTION_PART9/Fire%20Pro%20Wrestling%20Returns%20%28Europe%29.zip","filesize":625036241,"score":7.7,"genres":"Simulation > Sports > Diagonal-down > Isometric > Wrestling","desc":"<p><em>Fire ProWrestling Returns</em> is a 2D-graphic based wrestling simulation game. The game has a north-south/east-west-axis movement system. This allows for dual-plane movement rendering it to play like a 3D wrestling game (although the moves are still done in 2D).</p><p>The game features 327 wrestlers on the main roster, from over 10 major Japanese wrestling and mixed-martial arts organizations. This in-depth roster allows the player to simulate classic matches or matches that could never take place.</p><p>Game modes include a standard exhibition match, tag team exhibition match with 2 to 4 player teams, a round robin league tournament featuring up to 64 wrestlers, a sudden elimination tournament featuring up to 16 wrestlers, mixed martial arts matches aka Ultimate Fighting (with either Pride or K*1 Rules), battle royal matches with up to eight players in the ring at the same time, 5-man team elimination matches, and for the first time ever in a <em>Fire ProWrestling</em> game, a North American cage match mode.</p><p>The edit mode allows the player to create wrestlers, referees, and even entire wrestling organizations (with their own ring and logo). This mode features over 1,648 moves and holds the player can assign to wrestlers, whose CPU logic may be tweaked so as to make them behave as when controlled by the computer.</p><p>The new features for the <em>Fire ProWrestling</em> series debuting in <em>Fire ProWrestling Returns</em> are North American cage matches, face layering on edit mode, and ring seconds (aka managers) that accompany wrestlers to the ring. It also features over 20 brand new moves, including some reanimations of old moves.</p>"},{"name":"Fire ProWrestling Z","year":2003,"developer":"Paon Corporation, Ltd.","url":"sony_playstation2_f/Fire%20Pro%20Wrestling%20Z%20%28Japan%29.zip","filesize":364069804,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Isometric > Wrestling","desc":"<p><em>Fire ProWrestling Z</em> is the direct follow-up to Fire Pro Wrestling D, intended as the series' swan song and final entry, though it would return just two years later. The game itself plays essentially the same as its predecessor, isometric sprite-based, timing-centric gameplay intact. The key distinguishing feature is the addition of even more wrestlers, custom parts, and moves -- nearly 1500 moves are available in the creation mode, for example.</p><p>Included are a wide variety of play modes, including tournament and league modes, free battles, 5-on-5 elimination matches, 8-man battle royale, and a story mode where the player leads a team of four wrestlers through a full career. Up to four players can play simultaneously.</p>"},{"name":"Fireblade","year":2002,"developer":"Kuju Entertainment Ltd.","url":"PS2_COLLECTION_PART9/FireBlade%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":568364751,"score":6.9,"genres":"Action > 3rd-person (Other) > Shooter > Helicopter","desc":"<p>An elite anti-terrorist force, Fireblade has been mobilized to take care of a dangerous terrorist group known as \"United Eastern States\", who are plotting to develop weapons of mass destruction.</p><p>Piloting the powerful attack helicopter through various missions, you must take out a range of enemy units, from military bases hidden in the middle of nowhere to other attack craft (both air and ground-based). The Fireblade includes a range of weapons to use during each mission, such as swarm missiles, cannons, and homing missiles.</p>"},{"name":"Firefighter F.D. 18","year":2004,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"PS2_COLLECTION_PART9/Firefighter%20F.D.18%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":860506509,"score":6.6,"genres":"Action > Behind view","desc":"<p>Firefighter F.D. 18 is your basic action/adventure game with a twist. Instead on monsters, the game's main protagonist Dean McGregor has to take on some nasty fires instead.Most of the time the player is putting out fires, saving innocent people and completing other tasks.Once in a while, there is also a \"Boss Fire\" who has to be defeated before one can proceed to the next level. This is not a fireman simulation by any means, but an arcade-like experience with lots of flames, and a storyline, which revolves around an arsonist and is as deep and multi layered as your typical action movie. The main thing about Firefighter F.D. 18 however, is the action, and there's plenty of it.</p>"},{"name":"First Battalion","year":2006,"developer":"ZootFly, LLC."},{"name":"First Kiss Stories","year":2003,"developer":"","url":"sony_playstation2_f/First%20Kiss%20Stories%20%28Japan%29.zip","filesize":3647400443,"score":"","genres":"Adventure > Compilation > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>First Kiss Stories</em> is a PlayStation 2 release which includes:</p><ul><li>First Kiss Story* First Kiss Story II: Anata ga Iru Kara</li></ul><p>Both games are integrated together and are ran from the main menu. This is also the only release of either of the two games for PlayStation 2 platform.</p>"},{"name":"Fisherman's Bass Club","year":2002,"developer":"Vingt et un Systems Corporation","url":"sony_playstation2_f/Fisherman%27s%20Bass%20Club%20%28USA%29.zip","filesize":146848580,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Fishing","desc":"<p><em>Fisherman's Bass Club</em> takes anglers of all ages and abilities into the world of Trophy Bass Fishing. Learn the secrets to hooking bigmouth bass in remote lakes around the world. Discover and use the best strategies for selecting locations that yield the highest quantity and quality of sports fish.</p><p>In this 3D fishing simulation, fight some of the toughest freshwater sports fish around. Select favorite fishing holes and hone skills as a fisherman in multiple bids to win each tournament. Choose the right lures for a personalized style of fishing and come back with load after load of prize-winning bass.</p>"},{"name":"Fisherman's Challenge","year":2003,"developer":"Konami OSA Ltd.","url":"PS2_COLLECTION_PART9/Fisherman%27s%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":230124390,"score":7.1,"genres":"Sports > 1st-person > 3rd-person (Other) > Fishing","desc":"<p>A next-gen upgrade of Fisherman's Bait: A Bass Challenge for the PSOne. This one features five different lakes to fish in, each free-roaming and with seven different types of fish to catch including Catfish, Trout and Bass to name a few. There are a 110 different lures to choose from as well as 100 different rod and reel combinations to choose from. To catch fish the players must hit certain buttons when prompted in order to keep the fish hooked, the larger the fish, the faster and harder the sequences.</p><p>There is even a Fish Mood Meter that gives the player tips on why the fish aren't biting and how to remedy the situation. There is also a two-player mode, where friends can take on each other head-to-head or against an AI opponent in a series of mini-games along with the obligatory career mode.</p>"},{"name":"Fishing Fantasy: Buzzrod","year":2005,"developer":"Starfish Kaihatsu Ltd.","url":"PS2_COLLECTION_PART9/Fishing%20Fantasy%20-%20Buzzrod%20%28Europe%29.zip","filesize":110332441,"score":"","genres":"Role-playing (RPG) > Sports > Behind view > Anime / Manga > Fishing > Fantasy","desc":"<p>EXPERIENCE AN INCREDIBLE FISHING ADVENTURE...<br>...WITH POSSUM, DISCOVER NEW SPECIES OF FANTASTIC FISH, BUT THAT'S NOT ALL; SOME SECRET TEXTS WILL LEAD YOU TO AN ANCIENT CULTURE THAT WORSHIPS FISH AS THE MESSENGERS OF GOD...<br><br>THE FISH HAVE TAKEN THE BAIT AND YOUR QUEST IS JUST BEGINNING!</p>"},{"name":"Fist of the North Star","year":2007,"developer":"Arc System Works Co., Ltd."},{"name":"Fitness Fun","year":2004,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART9/Fitness%20Fun%20%28Europe%29.zip","filesize":155464364,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Music / rhythm","desc":"<p><em>Fitness Fun</em> is an exercise-themed rhythm game starring D3 Publisher's virtual idol Riho Futaba. Riho is putting on a special concerts for the 5th anniversary of her debut, and her manager has asked her to do dance aerobics training to perfect her rhythm.</p><p>During each song, a cursor scrolls across a set of four bars with notes arranged on them in time with the music. The player must move the cursor to as many notes as possible, and press the button on the controller in time with the music to dance along. Play well, and Riho will stay with the rhythm and earn points, but play poorly and she will start to get out of breath. If too many wrong notes are played, the song will be failed and end early.</p><p>Extra songs and costumes can be unlocked by beating preset scores in the Lesson mode. There are a total of 12 songs and 14 costumes to unlock. It is also possible to save replays of performances to watch later without the note bar obscuring the view of Riho.</p>"},{"name":"FlatOut","year":2004,"developer":"Bugbear Entertainment Oy","url":"PS2_COLLECTION_PART9/FlatOut%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":1186294157,"score":7.4,"genres":"Action > Racing / Driving > 1st-person > Behind view > Tricks / stunts > Direct control > Automobile > Off-roading > Track racing > Regional differences","desc":"<p>FlatOut is a driving game where crashing your car can be more fun than racing it. You drive muscle cars around dirt tracks, battle them on destruction derby arenas, and take part in Ragdoll Olympics. That last one may need some explanation. When you crash in FlatOut, your driver (the Ragdoll) is flung through the windscreen, very much like in Rekkaturvat. This feature is used in the Ragdoll sports where the task is to propel the hapless driver as far, as high, or as accurately as possible. On the demolition arena the goal is to wreck other cars before yours is. Simple as that.</p><p>The bulk of the game is racing though and it can be performed in typical quick race and time trial modes in addition to the proverbial career mode. There are also two different handling modes for the cars. Normal mode gives arcade type handling, suitable for gamepads. Professional mode seems to be designed for steering wheel owners and provides very challenging simulator-type handling. Not surprisingly since Bugbear's previous racing title Rally Trophy was considered to be very challenging, even demanding, simulation.</p><p>Bugbear's experience with simulation dynamics shows in FlatOut. Almost everything on the track can be run into and it behaves as it should in real life. Or at least as in a car-chase movie. Stuff that cars scatter around are there on the next lap too and cars are gradually dismantled when hit to other cars or solid objects around the track.</p><p>Multiplayer modes are of course great party hits. Depending on platform, FlatOut has hotseat, split screen, LAN, and/or online multiplay modes.</p>"},{"name":"FlatOut 2","year":2006,"developer":"Bugbear Entertainment Oy","url":"PS2_COLLECTION_PART9/FlatOut%202%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2556357634,"score":7.8,"genres":"Action > Racing / Driving > 1st-person > Behind view > Tricks / stunts > Automobile > Off-roading > Track racing > Regional differences","desc":"<p>As in FlatOut your goal is to drive as reckless as you can and still win the race. But contrary to its predecessor, <em>FlatOut 2</em> is now a complete arcade-racing game.</p><p>The core of the game is the career mode which features 3 different racing-classes: Derby, Race and Street. Every class is also divided into 3 levels. You begin your career in the derby class level 1. Here you drive old, wrecked cars straight from the dump. As you progress to the race class and finally to the street class you can buy better and faster cars which you can then also tune to your needs, like installing a new engine.</p><p>Inside the classes you find different kinds of events: from normal races over Destruction Derbies to stunt events. All of the events feature a fully destructible environment. This is not only eye-candy but is also required to fill up your nitro and handicap your enemies.</p><p>If you get bored of that, you can play one of the 12 mini-games. Like in FlatOut your goal here is to do all kinds of crazy stuff with your driver. You can use him as a football, throw him through burning rings and more. These mini-games can also be played with up to 8 players on one PC in a hot-seat mode.</p>"},{"name":"Flintstones in Viva Rock Vegas, The","year":2001,"developer":"Toka S.a.r.l.","url":"PS2_COLLECTION_PART9/Flintstones%20in%20Viva%20Rock%20Vegas%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":395431904,"score":5.6,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Track racing > Prehistoric > Licensed","desc":"<p>Cart Racer based on the second Flintstones Movie. Eight racetracks, can also be raced mirrored or reverse. 9 different vehicles (not counting the bonus vehicle - a UFO controlled by Gazoo the Great). 4 Player multiplayer split screen mode. Diverse weapons and power ups. Several drivers to choose from (Barney, Fred, Wilma, Chip Rockefella etc.). A multitude of different game modes such as bomb hunt, where the player needs to pass along a bomb before it explodes.</p>"},{"name":"Flintstones, The: Bedrock Racing","year":2006,"developer":"Coyote Developments Ltd","url":"PS2_COLLECTION_PART9/Flintstones%2C%20The%20-%20Bedrock%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":92085687,"score":"","genres":"Racing / Driving > Behind view > Persistent > Direct control > Automobile > Prehistoric > Licensed","desc":"<p><em>The Flintstones: Bedrock Racing</em> is a racing game which features licensed characters from the Hanna-Barbera cartoon of the 1960's - <em>The Flintstones</em>.</p><p>From the main menu the player is presented with arcade, time trial and two player game modes. All of the classic Flintstones family members are available as playable characters with Fred, Barney, Wilma, Betty, Pebbles and Bam-Bam represented. Some characters are locked until progress is made in Arcade mode collecting items during the race. Time trial and the corresponding records option keep track of a players best times during races and two player mode lets two willing participants engage in head to head prehistoric foot based racing.</p>"},{"name":"Flipnic: Ultimate Pinball","year":2003,"developer":"Sony Computer Entertainment Inc.","url":"sony_playstation2_f/Flipnic%20-%20Ultimate%20Pinball%20%28USA%29.zip","filesize":2373036950,"score":6.5,"genres":"Action > 1st-person > Top-down > Pinball","desc":"<p>A pinball game with multiple twists.Flipnic isn't your basic pinball game, it's a psychedelic trip through fantastic land of pinball. The game features multiple tables in which the player must complete a given set of tasks before she can proceed to the next level. Each of the \"tables\" consists of many smaller playing areas and every one has some gimmick in them. For example, one must first freeze the waterfall and then destroy the ice and climb a mountain behind it. All this using only the paddles and the ball.</p>"},{"name":"Flow: Urban Dance Uprising","year":2005,"developer":"Artificial Mind & Movement","url":"PS2_COLLECTION_PART9/Flow%20-%20Urban%20Dance%20Uprising%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":704992835,"score":6.7,"genres":"Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p><em>FLOW: Urban Dance Uprising</em> is a dance game similar to Konami's Dance Dance Revolution series. Instead of being focused on J-Pop and other licensed tracks, the game is focused on hip-hop and urban culture. The game features fifty different songs from classic hip-hop artists such as The Sugarhill Gang and Kurtis Blow.</p><p>The point of the game is to clear several songs by pressing buttons on either a compatible dance pad or on your game pad. Your performance will affect your final score and any unlockable bonuses you get.</p><p>There are several unlockable features in the game, including more songs, characters, costumes and game locations. You obtain these as you progress in the game by completing the requirements given to you before you begin a stage. The game also supports the EyeToy accessory, so you can see yourself on the screen as you dance with the game.</p>"},{"name":"Flower Sun and Rain","year":2001,"developer":"Grasshopper Manufacture Inc."},{"name":"Football Generation","year":2006,"developer":"Trecision S.p.A.","url":"PS2_COLLECTION_PART9/Football%20Generation%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v2.00%29.zip","filesize":446182396,"score":"","genres":"Sports > 3rd-person (Other) > Football (European) / Soccer","desc":"<p>Football Generation features 44 international and 33 major club teams from across the globe. The players' names are not licensed, but the game has a wide array of game modes:</p><ul><li>Quick match: a friendly match between national teams, clubs or a mix of both.</li><li>Clubs cup: a complete cup with the classic rules such as the away goal rule, extra time and the golden goal.</li><li>Clubs league: a full league, followed by a championship.</li><li>Custom competition: a fully configurable custom competition.</li><li>Scenario mode: play specific cup and league scenario's.</li></ul><p>Using Criteron's Renderware engine and Firelight's FMOD sound engine, Football Generation contains detailed stadiums, 3D players, four camera angles, realistic weather effects and various replay modes.</p>"},{"name":"Football Kingdom: Trial edition","year":2004,"developer":"Namco Limited","url":"sony_playstation2_f/Football%20Kingdom%20-%20Trial%20Edition%20%28Japan%29.zip","filesize":459465980,"score":"","genres":"Sports > Top-down > Football (European) / Soccer","desc":"<p><em>Football Kingdom</em> is a football (soccer) game designed for greater realism and freedom of control compared to contemporary franchises such as Winning Eleven or FIFA. It features official licenses from JFA and FIFPro, so real player names are included, and there also is an in-depth player and team edit mode included.</p><p>The game's key distinction is its highly detailed and nuanced control system which allows for an exceptionally wide range of control over actions like passing, dribbling and running, kicks, feints, and even goalkeeping. The game includes a standard Exhibition mode, along with Kingdom, League, and Cup modes where the player can take their personalized custom team against other teams from around the world.</p>"},{"name":"For Symphony: With All One's Heart","year":2005,"developer":"Takuyo Co., Ltd.","url":"sony_playstation2_f/For%20Symphony%20-%20With%20All%20One%27s%20Heart%20%28Japan%29.zip","filesize":1073910709,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Originally for Dreamcast platform, this game was soon ported to Windows with several updates. However, PlayStation 2 release features yet more additional updates which include full voice-acting, renewed videos and art, new CG events and 2 new characters.</p><p>The game story, unlike in many visual novels and love simulations, let you select a male or female student to play as. Most of the events take place in high-school during your senior year. The story and love interest will change depending whether you play as a boy or a girl. During the conversation, you are occasionally presented with the choice selection that decide the direction the remaining story take.</p>"},{"name":"Forbidden Siren 2","year":2006,"developer":"Project Siren","url":"PS2_COLLECTION_PART9/Forbidden%20Siren%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":4617135601,"score":7.4,"genres":"Action > 1st-person > Behind view > Puzzle elements > Stealth > Survival horror","desc":"<p>The sequel to the Siren survival horror game puts you again in control of several characters. The game takes place on a island on the coast of Japan called Yamijima. The story begins when the characters have to dock to the island to survive the raging storm. 29 years earlier, all the island's inhabitants disappeared in a blackout and you will need to investigate this mystery.</p><p>The sequel adds new features in the game, which most notably you will notice, apart from the original Shibito zombies, as the new Yami Bito demons. The sequel also has a new alert system which functions through the controller's vibration function and alerts you of any nearby danger.</p><p>Stealth plays an important role, as well as light and darkness, as the creatures are sensitive to it in different ways. Just like in the previous game, you can sight-jack enemies and animals, to view the environment through their eyes. There are over 30 weapons to collect and there are three difficulty options.</p>"},{"name":"Ford Bold Moves Street Racing","year":2006,"developer":"Razorworks","url":"sony_playstation2_f/Ford%20Bold%20Moves%20Street%20Racing%20%28USA%29.zip","filesize":182988068,"score":5.9,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Street racing > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Ford Bold Moves Street Racing</em> is the third Razorworks-developed title in the licensed Ford Racing series since they took over development in Ford Racing 2. Unlike its predecessors, this version has an urban atmosphere. The road races, off-road challenges and circuit tracks have been removed and the action has been taken entirely to the streets of Los Angeles, with 24 tracks available. As in the previous version, the 18 available cars are all Fords, ranging from the 1968 Mustang GT to the 2007 Shelby GT 500.</p><p>There are 4 main modes: Quick Race, Team Racing, Solo Racing and Multiplayer. Solo Racing offers quick races, and championships where new vehicles and tracks can be unlocked. The real novelty is the Team Racing mode, split up in single races, team championships, challenges and tutorials. Team Racing has the player control two or three vehicles in a single team during a race in modes such as Race, Elimination or Duel. The team with the highest point total wins, so the player either has to switch between the vehicles to drive (the others cars then become AI-controlled) or issue orders such as Block (slow down another vehicle) or Draft (additional speed in the slipstream) to influence the driving behaviour of the team mates. This can be extended to double or even triple actions of the same effect. Blocked cars have to brake and weave across the track until they regain control.</p><p>Racing or completing challenges earns credits, which can be spent to buy new vehicles in the showroom. Despite the urban theme, there are no tuning options. Cars can only be viewed, repaired and sold. </p><p>The PSP version adds 6 new Ford cars (1962 Thunderbird Sports Roadster, 1971 Mustang Mach 1, 2004 Bronco Concept, 2005 Shelby GR-1 Concept, 2005 SVT Sport Trac Adrenalin Concept, 2005 Thunderbird) and 7 new tracks. In the Team Racing mode, two cars can be controlled (3 in the console versions) and solo and team multiplayer is supported over Wi-Fi.</p><p>There is also an alternate Australian PS2 release Ford Street Racing (XR Edition), with 4 additional cars synonymous with the history of Ford in Australia: the 1970 Ford XY GT Falcon, the 1970 Ford XY GTHO Falcon (Phase III), the 2003 Falcon XR8 Ute and the Australian Falcon XR8. That version is also the only PSP version released in Australia.</p>"},{"name":"Ford Mustang: The Legend Lives","year":2005,"developer":"Eutechnyx Limited","url":"PS2_COLLECTION_PART9/Ford%20Mustang%20-%20The%20Legend%20Lives%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":163280824,"score":6.7,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>The Ford Mustang is featured in its very own game, as players can choose from 40 different models ranging from the original 1964 Mustang all the way up to the 2005 version. Career mode and \"coin-op\" Challenges provide a test of driver skill as you unlock new cars and tracks, all while racing against AI drivers and dealing with traffic. New York City is one of seven U.S. cities you will race through, with 22 different layouts overall. Multi-player is supported for 2 players.</p>"},{"name":"Ford Racing 2","year":2003,"developer":"Razorworks","url":"PS2_COLLECTION_PART9/Ford%20Racing%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":344347156,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p>If you love Fords and racing, you'll get a chance to live out your fantasies in <strong>Ford Racing 2</strong>.</p><p>Drive Mustangs, Thunderbirds, concept cars, stock cars, exotic sports and race cars - even F-Series pick-up trucks. Choose from 32 models, legendary classics as well as futuristic supercars, like the Ford GT (classified under these categories in the game: Living Legends, Movie Stars, SVT, Concept, Off Road, Custom and Stock Car).</p><p>The 16 graphically detailed venues include road race tracks, off-road (over desert and jungle terrain), high speed oval speedways and race circuits. There are different competition types to test your driving skills including: Time Attack, Elimination, Racing Line, Driving Skills and more.</p><p>You select the amount of driving control you want. Standard gives you automatic transmission, anti-lock brakes and traction control. Choose Advanced for more precision driving with a manual transmission and more option selections. Learn the controls of the game in \"Quick Race\" which automatically selects a car for you and puts you on a pre-selected track. Then choose the \"Single Player\" to race with computer opponents or \"Multi Player\" for head-to-head competition with a friend. Select from different background music types (rock, funk etc.) to further customize your experience.</p><p>Views can be toggled between 1st and 3rd person perspective. On screen in the first person view, the speedometer, tachometer, rear view mirror, are shown as well as a map on left side showing your current location and nearby competitors. Classic car dash panels differ from more modern cars, too. Depending upon your perspective, you'll see your lap times, overall position, rpms and speed.</p>"},{"name":"Ford Racing 3","year":2005,"developer":"Razorworks","url":"sony_playstation2_f/Ford%20Racing%203%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":384054802,"score":6.4,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p>Ford Racing 3 is the sequel to Ford Racing 2.</p><p>Now there are 55 Ford models available (Ford GTs, Thunderbirds, concepts, SVT vehicles, Mustangs and Trucks) and you unlock them as you win the races.</p><p>Twenty six tracks are available, including road, off-road and oval ones, in different environments (snow, mud, water, mountain trails, beach, race tracks and more).</p><p>It has 2 play modes: Ford Competition and Ford Challenge. In Ford Competition you run 14 thematic cups. In Ford Challenge, you run single races in different game modes: boost, relay, overtake, elimination, duel, drafting, driver skills, seconds out, race line and time attack. As you win the races, you collect Ford cars, tracks and race types.</p><p>The multiplayer mode allows you to play via LAN (only for PC) and split screen mode (on PS2 and Xbox).</p>"},{"name":"Ford Racing Off Road","year":2008,"developer":"Razorworks","url":"sony_playstation2_f/Ford%20Racing%20-%20Off%20Road%20%28USA%29.zip","filesize":365990454,"score":5.2,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Licensed","desc":"<p>As you might expect, this game takes the <em>Ford Racing</em> series off the road, and into the desert, forest, and ice. Features 12 tracks (plus reverse versions of all tracks), and 18 Ford and Land Rover vehicles.</p><p>Game modes include Quick Race, which drops you right in the action, Career mode, which starts you out with a few thousand credits and a map of the nearest races, Tournament, which is a shorter version of Career mode, Arcade mode, which lets you play a single race with the track, mode, and vehicle you want, and Multiplayer, which lets you race split-screen. Some tracks and vehicles need to be unlocked through career mode before they become available.</p>"},{"name":"Ford Street Racing: XR Edition","year":2007,"developer":"Razorworks","url":"PS2_COLLECTION_PART9/Ford%20Street%20Racing%20XR%20Edition%20%28Australia%29.zip","filesize":240989914,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Licensed","desc":"<p>The XR edition of Ford Street Racing is an Australian-only re-release for the PS2 and the first release for the territory on the PSP. It is completely identical to the original version, but contains 4 additional cars synonymous with the history of Ford in Australia: the 1970 Ford XY GT Falcon, the 1970 Ford XY GTHO Falcon (Phase III), the 2003 Falcon XR8 Ute and the Australian Falcon XR8.</p>"},{"name":"Ford Vs. Chevy","year":2005,"developer":"Eutechnyx Limited","url":"PS2_COLLECTION_PART9/Ford%20vs.%20Chevy%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1077695056,"score":"","genres":"Racing / Driving > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Pick from one of the 48 accurately modeled classic and contemporary Ford and Chevy vehicles to try and win the Westington Cup. </p><p>Pick your side, either Ford or Chevy, and compete in circuit races, point to point races, time trials, drag races, and other events. Work with your teammates to gain a leg up on your opponents by choosing when to play aggressively and ram them to gain position and when to block them from trying to steal your position. Tweak your car to get the most performance possible by getting over a hundred parts from over twenty manufacturers. </p><p>Play against a friend in split screen mode or up to 5 other people either online or via system link.</p>"},{"name":"Forever Kingdom","year":2002,"developer":"FromSoftware, Inc.","url":"sony_playstation2_f/Forever%20Kingdom%20%28USA%29.zip","filesize":2637670078,"score":6.9,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Fantasy","desc":"<p><em>Forever Kingdom</em> is the prequel to Evergrace set directly before those events. The player controls Darius (the main character), Ruyan (the childhood friend), and Faeana (the amnesiac). While traveling the party comes upon a strange girl named Solca, who is summarily kidnapped by an evil wizard named Darsul. During that event, the party is cursed by Darsul, and they now share 1 life bar.</p><p>Battles occur in real-time, and the player can freely switch controls to any of the three characters. Skills are gained through equipping items. Each character is assigned a button and can use their skills by pressing that button. Using multiple skills from each character can result in combos that give bonus damage.</p>"},{"name":"Forgotten Realms: Demon Stone","year":2004,"developer":"Stormfront Studios","url":"PS2_COLLECTION_PART9/Forgotten%20Realms%20-%20Demon%20Stone%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2749375581,"score":6.9,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Fantasy > Licensed","desc":"<p>Centuries ago two unspeakably evil forces were entrapped in a Demon Stone while battling each other. Now three adventurers happen to meet by chance and discover the Demon Stone just as it breaks and releases the two spirits: a Githyanki general and a Slaad lord. Now only these three can prevent a war that will sweep over all Faerun.</p><p><em>Forgotten Realms: Demon Stone</em> is an action RPG set in the world of <em>Dungeons &amp; Dragons: Forgotten Realms</em>. Take control of three heroes, Rannek the fighter, Illius the sorcerer, and Zhai the rogue, as they try to destroy the evil unleashed by the breaking of the Demon Stone. </p><p>The player only controls one character at a time but can switch between them on the fly with the direction pad. Each character has his/her own attack and can perform combos by pressing certain button combinations, e.g. B + B or A + B + A, and even perform team attacks and a team super attack. As they gain experience they will gain levels and can purchase new moves (combos) or upgrade old ones with experience points. They also collect gold with which they purchase new weapons, armor, and accessories at the end of each chapter.</p>"},{"name":"Formation Final","year":2003,"developer":"Konami Computer Entertainment Studios, Inc."},{"name":"Formula Challenge","year":2005,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART9/Formula%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":59769206,"score":4.6,"genres":"Racing / Driving > 1st-person > Arcade > Automobile > Track racing > Vehicle simulator > Oceania","desc":"<p><em>Formula Challenge</em> is a formula 1 game aimed at beginners. There are two single player modes: quick race and championship. The championship consists of ten races with two qualifying laps and up to ten laps and each. The number of laps is adjustable. Unlike other formula 1 games the handling and physics simulation is action oriented. The not licensed tracks are set in Europe, America, Africa and Asia.</p>"},{"name":"Formula One 04","year":2004,"developer":"SCE Studio Liverpool","url":"sony_playstation2_f/Formula%20One%2004%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CFi%29%20%28v2.02%29.zip","filesize":1437539359,"score":7.1,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>This licensed F1 game includes all official tracks, sponsors, drivers and cars of the FIA Formula One championship. The 2004 update includes all the latest changes to the teams, up-to-date driver rosters, and also the new Bahrain and China circuits. Online multiplayer is introduced and the singleplayer mode has been extended with time attack races against ghost cars, and historic cars that can be unlocked upon completing a full championship.</p><p>The career mode is another new addition. You start at the back of the grid and you have to impress sponsors and manager to earn a spot on a team. Success leads to lucrative deals, while failure gets you fired. There are four difficulty levels and gamers can race as themselves, with their name lined up on the starting grid.</p>"},{"name":"Formula One 05","year":2005,"developer":"SCE Studio Liverpool","url":"PS2_COLLECTION_PART9/Formula%20One%2005%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CFi%29.zip","filesize":2959136991,"score":7.4,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>The 2005 game in Sony's licensed Formula One series has been updated with the official teams, drivers and circuits from the 2005 season, including the new Istanbul track in Turkey, which will be opened on August 21, 2005, and the Red Bull Team. This instalment also introduces online multiplayer, up to ten players at the same time, with a world ranking ladder.</p><p>Next to the season mode and quick races, the career mode has been expanded, and there are new features such as interactive pit stops, a pre-race grid line-up set against a backdrop of mechanics, grid girls, journalists, cameramen and special events. By advancing in the career mode, you can unlock classic F1 cars and bonus tracks. The game supports EyeToy with DigiMask technology: create your own driver and wrap your picture smoothly around the model's face to be the champion yourself.</p>"},{"name":"Formula One 06","year":2006,"developer":"SCE Studio Liverpool","url":"sony_playstation2_f/Formula%20One%2006%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CFi%29.zip","filesize":3537877854,"score":7,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Behind view > Licensed","desc":"<p>The official game of the 2006 FIA Formula One World Championship is here exclusively on PSP and PS2, with all the new updates from the 2006 season. All the drivers and teams race onto your screen, including three new teams: Scuderia Toro Rosso, Super Aguri F1 Team, and Midland F1 Racing. All 18 tracks, from Bahrain to Brazil, are ready to test your driving skills. All the new rules brought in for the 2006 season apply, including the new knockout qualifying and tyre regulations. New racing aids allow beginners to race like professionals, and teaching experts new tricks. Career Mode: Live the dream and become a Formula One driver. Join a team, take on the competition, and rise to the top. Split screen: Race with a friend against a grid of opponents or go head to head and see who the better racer is on PS2.</p>"},{"name":"Formula One 2001","year":2001,"developer":"SCE Studio Liverpool","url":"sony_playstation2_f/Formula%20One%202001%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CFi%29%20%28v2.00%29.zip","filesize":3203199971,"score":7.4,"genres":"Racing / Driving > Simulation > Sports > 1st-person > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>Formula One 2001 is an officially licensed formula one racing game. All tracks, teams, cars and drivers from the 2001 season are in the game and can be selected. The game features a realistic damage model and various racing modes, including championship, single race-weekend, free practice and splitscreen mode for two players. Before each race, many aspects of the car can be customised. Further features are a replay mode and race commentary by famous reporters of each language.</p>"},{"name":"Formula One 2002","year":2002,"developer":"SCE Studio Liverpool","url":"PS2_COLLECTION_PART9/Formula%20One%202002%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CFi%29.zip","filesize":1412740023,"score":7.1,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Officially licensed racing game based on the FIA Formula One World Championship 2002. Features all the drivers, teams and tracks from this season. A variety of single and multiplayer game modes, including full Race Weekend, World Championship, Time Attack, Hotseat and Arcade modes. Bundled with free DVD - The official review of the 2001 FIA Formula One World Championship.</p>"},{"name":"Formula One 2003","year":2003,"developer":"SCE Studio Liverpool","url":"PS2_COLLECTION_PART9/Formula%20One%202003%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CFi%29.zip","filesize":1205916660,"score":7.3,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>This game is an officially licensed product of the FIA Formula One 2003 championship. It features all the drivers, tracks (including changes), teams and the new qualifying rules and point tables. You can fine-tune almost every aspect of the chosen car to create the best setup for the current track. You can set gear ratios, set front and rear air foils/wings etc etc. This time around, you can also set the brake bias.</p><p>The game has a single player and a multiplayer mode. Some settings such as gearbox, screen layout, and cockpit camera mode can be customised separately for each player. In addition to the standard controller, which has four non customisable configurations to choose from, the game also supports the Speedster 2, Driving Force and GT Force steering wheels.</p><p>The single player game has Arcade Race, Arcade Season, Custom Race, Race Weekend, 2003 World Championship and Time Attack modes of play. The multiplayer game has Arcade Race Player Vs Player, Custom Race, Hot Seat and Time Attack options. The Multiplayer Arcade Race and Custom Race options are split screen games while the players take turns to race in the other two options.</p><p>The game also has a Spectator Mode, where the game runs all the cars and the player can sit back, relax, and watch the action</p>"},{"name":"Forty 4 Party","year":2001,"developer":"HuneX Co., Ltd.","url":"PS2_COLLECTION_PART9/Forty%204%20Party%20%28Europe%29.zip","filesize":127483636,"score":"","genres":"Action > Mini-games > Party game","desc":"<p>A GAME FOR THE WHOLE FAMILY. A CHALLENGE TO THE LAST MINIGAME<br><br>* Lots of nice little animals challenge each other in over 35 different mini-games!<br>* Easy but exhilarating! Dozens of amazing minigames anyone can play!<br>* Are you good at pressing buttons quickly? Do you like to use your brain and have a good memory? Whatever your specialty, in The Party Game you will find the right games for you!</p>"},{"name":"Fragments Blue","year":2006,"developer":"Silver Bullet Co., Ltd.","url":"sony_playstation2_f/Fragments%20Blue%20%28Japan%29.zip","filesize":1133530116,"score":"","genres":"Adventure > 3rd-person (Other) > Anime / Manga > Visual novel > Detective / mystery","desc":"<p>One summer day, a young man named Kaname Ōsaka receives a letter with no return address. <em>\"If you remember where I fell, go there with Momoka and search.\"</em> The letter includes a small key, and is signed by Chika Yazawa, Kaname's childhood friend and Momoka's sister. However, Chika had died two years earlier when no donor could be found for a heart transplant. Kaname and Momoka, along with their friend Natsune, have no idea what the letter means, but decide they must investigate.</p><p><em>Fragments Blue</em> is a mystery-themed visual novel with light investigation elements. The player takes the role of Kaname who, along with his two cute female friends, goes to investigate the circumstances surrounding the strange letter he received. The story proceeds with lightly-animated illustrations and fully-voiced dialogue, and at certain points the player must choose from multiple responses, which determine the direction of the story and lead to different endings.</p><p>As the story proceeds, the player collects various pieces of information, which are collected in an in-game log and can be reviewed at any time. Certain events may require the player to select one or two pieces of information as evidence, and the resulting conclusions will also change the path of the story.</p>"},{"name":"Frank Herbert's Dune","year":2001,"developer":"Widescreen Games SARL","url":"PS2_COLLECTION_PART9/Frank%20Herbert%27s%20Dune%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":426201073,"score":5.2,"genres":"Action > Behind view > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p><em>Frank Herbert's Dune</em> is a 3D action game based on the TV mini-series. As Paul, the son of the Duke Atreides's concubine and heir to the throne, you must earn the trust and respect from the natives of the planet Dune, the Fremen, to ultimately become their prophesied Messiah, Muad'Dib. You will have to free them from the desolate conditions their home planet is in. Done that, there still is the evil Lord Harkonnen, who, with covert backup from the Emperor, slaughtered your family... do you really let him get away with this?</p>"},{"name":"Franklin: A Birthday Surprise","year":2006,"developer":"Neko Entertainment SARL","url":"PS2_COLLECTION_PART9/Franklin%20the%20Turtle%20-%20A%20Birthday%20Surprise%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CNo%2CDa%2CFi%29.zip","filesize":1655266797,"score":"","genres":"Action > Side view > Platform > Direct control > Licensed","desc":"<p>Franklin wants to give his best friend, Bear, a surprise birthday party. Franklin is very busy getting ready for the party. He has to prepare the food, send out invitations, get the decorations and do some errands. He also has to get Bear to the party without giving away the secret. Franklin has to progress through 10 different levels to get ready for the party, solving problems and avoiding obstacles. Franklin finds it difficult to concentrate on his errands as his friends want to play hide-and-seek.</p><p>Key Features: * Play Franklin in this exciting adventure for young gamers. * Explore Franklin's neighbourhood across 10 fun platform levels. * Unlock 10 mini-games that can be played in single or multiplayer mode!</p>"},{"name":"Freak Out: Extreme Freeride","year":2007,"developer":"Coldwood Interactive AB","url":"PS2_COLLECTION_PART9/Freak%20Out%20-%20Extreme%20Freeride%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":239295272,"score":6.6,"genres":"Action > Sports > 3rd-person (Other) > Tricks / stunts > Snowboarding / skiing","desc":"<p><em>Freak Out: Extreme Freeride</em> is an arcade skiing game, focused on performing tricks and stunts. The main mode is Mission, where players need to jump gaps, make tricks, grind rails and pick stars. Completing the different challenges is rewarded with money, exchanged for basic equipment (skis, boots, helmets) and style equipment (jackets, goggles, gloves) at the shop. It also opens up new slopes and mountains. In Freeride the aim is to get the highest score, opening up slopes and mountains, there are four mountains in total, and earning endurance points. Bone Ride has the player collect bones against a time limit to earn balance points and beating courses in the Slope Style mode requires the player to reach a pre-defined score to receive trick skill points. These different game modes are grouped in the main Career, Single race and Multiplayer sections.</p><p>Mostly about tricks, players need to take care of their landings - touch the ground with back, front or side weight and a lower score multiplier is awarded. Next to the basic information on the screen such as time, score and stunts, the game also keeps track of your \"flow\", by doing consecutive tricks. There are six different characters and the arsenal of tricks includes flips, rolls, carve/cross skis, grabs, rails, jumps and specials.</p>"},{"name":"Freaky Flyers","year":2003,"developer":"Midway Home Entertainment, Inc.","url":"PS2_COLLECTION_PART9/Freaky%20Flyers%20%28Europe%29.zip","filesize":2813543308,"score":6.1,"genres":"Action > Racing / Driving > Behind view > Arcade > Flight / aviation","desc":"<p>This cartoon style racing game replaces the usual kart formula with planes (and all sorts of flying technology, such as UFOs, flying carpets, and plenty more). </p><p>Choose from one of the many different, and wacky, characters and take to the sky over various locations, each with its own set of obstacles and shortcuts. Each character has a different level of ability (for example, one may be highly accurate in cornering but slow, while another is much faster but less responsive in turning).</p><p>Apart from the usual race modes, you can also take on a 4 player race (split-screen only).</p>"},{"name":"Free Running","year":2007,"developer":"Rebellion (Derby) Ltd","url":"PS2_COLLECTION_PART10/Free%20Running%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1219930138,"score":5.9,"genres":"Action > Sports > Behind view > Tricks / stunts","desc":"<p><em>Free Running</em> is a third-person open-environment arcade game, based around the sport of Parkour.</p><p>Set across multiple high and low rise urban environments, Parkour participants (known as traceurs) navigate around and over various obstacles using only the natural abilities of the human body. By stringing together spectacular gymnastic style moves, the player builds up 'flow', and is awarded points according to their agility and grace.</p><p>In the single player story mode, the players creates a novice traceur, who is mentored by Parkour athletes from Urban Freeflow, and by the Parkour guru Sebastian Foucan.</p><p>In addition, there are numerous single and multiplayer challenge modes - races, collection events, style based challenges, timed events and more.</p><p>Successful completion of challenges unlocks new levels, videos, clothing, footwear and music tracks.</p>"},{"name":"Freedom Fighters","year":2003,"developer":"Io-Interactive A/S","url":"PS2_COLLECTION_PART9/Freedom%20Fighters%20%28Europe%29.zip","filesize":1888828373,"score":7.8,"genres":"Action > Behind view > Shooter > Direct control > Cyberpunk / dark sci-fi > Post-apocalyptic","desc":"<p>The Soviet Union has invaded New York City! Chris Stone is just a plumber, and he was willing to live out his life normally even after the occupation until the Soviets picked up his brother Troy and charged him for being a terrorist (i.e. freedom fighter). Now Chris must contact the real freedom fighters, get his brother out, and eventually, drive the invaders out of New York.</p><p><em>Freedom Fighters</em> is a third-person shooter with squad-based tactics, with a variety of typical weapons such as pistol, revolver, assault rifle, submachine gun, shotgun, rocket launcher, grenade, and so on. As you proceed further in the game, you can control more and more people in your squad, until you end up with up to a dozen different freedom fighters all fighting alongside you in your quest to drive out the invaders.</p>"},{"name":"Freekstyle","year":2002,"developer":"Page 44 Studios, LLC","url":"PS2_COLLECTION_PART9/Freekstyle%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":799420281,"score":7.7,"genres":"Racing / Driving > Sports > 3rd-person (Other) > Tricks / stunts > Motorcycle","desc":"<p>Freekstyle is an EA Sports' take on motocross racing.  This game is all about going fast and doing cool tricks.  There are essentially two games here: first there is a straightforward racing game, where you race three laps around a circuit and attempt to finish first.  The second part of the game is a freestyle competition, where you perform tricks to score points and attempt to rack up the biggest total.</p><p>The racing game, or \"Freekstyle\" mode, combines racing and tricks.  You will race around a circuit track, and attempt to perform tricks at the big jumps you encounter along the way.  Performing tricks fills your boost meter, which then gives you a speed boost you can use at your discretion.  If you perform enough tricks, eventually you can break into \"freakout\" mode, where you can travel at ludicrous speed.</p><p>Freekstyle features the voices and likeness of several real-life motocross stars.</p>"},{"name":"Freestyle MetalX","year":2003,"developer":"Deibus Studios Ltd.","url":"PS2_COLLECTION_PART10/Freestyle%20Metal%20X%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2386265234,"score":7,"genres":"Racing / Driving > Sports > 3rd-person (Other) > Tricks / stunts > Motorcycle > Licensed","desc":"<p><em>Freestyle MetalX</em> is, as the name implies, a motocross stunt game. It contains 9 pro riders and twelve licensed bikes to begin with, plus some secret ones. It is structured somewhat like the Tony Hawk series with a career mode that is a succession of levels, each one containing goals like doing specific tricks, finding gaps and finding things, which could take the form of breaking windows, running people over, etc. In this case, there are also racing goals. Each goal gives you money, which can be used to unlock new riders, bikes, and levels.</p><p>Controls consist of an accelerator, brake, and clutch along with jump, trick and trick modifier buttons. The modifier can be used to turn a superman into a nothing superman, for instance. Wheelies are controlled with the right analog stick.</p>"},{"name":"Freestyle Street Soccer","year":2004,"developer":"Silicon Dreams Studio Ltd."},{"name":"Fren-ze","year":2004,"developer":"Hermitgames"},{"name":"Frequency","year":2001,"developer":"Harmonix Music Systems, Inc.","url":"PS2_COLLECTION_PART10/Frequency%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":477850545,"score":7.8,"genres":"Action > 1st-person > Music / rhythm","desc":"<p>A rhythm and music game -- played using audio triggers instead of visual triggers.  The goal is to piece together each track of a song within a certain time period; not piecing enough tracks together loses the round.  </p><p>To piece together each track of a song, you use the controller buttons to try to hit marks laid out on the track as they pass underneath your marker.   Complete a track, then move onto the next one.  Once you have completed each track, you are free to jam and mix freely with all tracks of the song in bass, rhythm, vocals, etc.  Each song is broken down into 8 tracks and there are dozens of progressivley more difficult dance songs by major names such as Crystal Method, BT, Juno Reactor, Paul Okenfold, Orbital, Jungle Brothers, DJ QBert, and No Doubt.</p>"},{"name":"Friends: Seishun no Kagayaki","year":2004,"developer":"FairyTale","url":"sony_playstation2_f/Friends%20-%20Seishun%20no%20Kagayaki%20%28Japan%29.zip","filesize":1197763515,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Romance","desc":"<p>The PlayStation 2 version of Friends: Seishun no Kagayaki includes improved graphics, a new CG opening, and a new world map. It also features two additional female characters.</p>"},{"name":"Friends: The One with All the Trivia","year":2005,"developer":"Artech Studios Ltd.","url":"PS2_COLLECTION_PART10/Friends%20-%20The%20One%20with%20All%20the%20Trivia%20%28Europe%29.zip","filesize":2543980962,"score":6.7,"genres":"Educational > Turn-based > Game show / trivia / quiz > Licensed","desc":"<p>This game challenges player to answer a series of multiple-choice questions about characters and events of the 10 seasons of Friends. There are six different question categories: Relationships, Shake-ups and make-ups, Work and play, Memorable moments, Friends of friends, Wild card. Game also includes six different question types: Next line please, Says who?, What are they talking about?, The one with..., Timeline and Which friend?</p><p>Beginning of each game, player is assigned to a floor of the Friends apartment building. When you answer questions correctly, the windows on your floor will light up. When your floor is completely lit, you move into Central Park where you will answer a final, game-winning question. Game uses combination of friends video and audio clips. Game is hosted by Maggie Wheeler, James Michael Tyler, Elliott Gould and Christina Pickles.</p>"},{"name":"Frogger Beyond","year":2003,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"PS2_COLLECTION_PART10/Frogger%20Beyond%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1264124579,"score":5.6,"genres":"Action > Top-down","desc":"<p>Frogger just got back from his adventure at the Temple of the Frog and is enjoying life in the swamp. Before long, it's his birthday, and he is summoned to the Elder Council. Frogger has come of age, and it is time for him to complete his rite of passage. Each of the 8 council members will send Frogger to a different world, where he will be tested to prove his readiness to be a teenage frog.</p><p>This game follows the gameplay model seen in the Game Boy Advance Frogger games. You play the game from an overhead view and must move Frogger to the end of many maze-like, trap ridden levels.</p>"},{"name":"Frogger: Ancient Shadow","year":2005,"developer":"Hudson Soft Company, Ltd.","url":"sony_playstation2_f/Frogger%20-%20Ancient%20Shadow%20%28USA%29%20%28En%2CEs%29.zip","filesize":309727933,"score":5.9,"genres":"Action > Diagonal-down > Arcade > Puzzle elements","desc":"<p>While his friend Lumpy is away, Frogger learns from his girlfriend Lily that the evil crocodile Dr. Wani is threatening Firefly Swamp.  He must save his home by solving puzzles, collecting gold coins and dodging hazards. In addition to running and jumping, Frogger can also manipulate objects with his tongue. The game's single-player story mode spans seven worlds and twenty-eight levels. The story levels can also be played in a timed challenge mode, and there is a multiplayer battle mode with a variety of scenarios. It is also possible to unlock the original Frogger arcade game.</p>"},{"name":"Frogger: The Great Quest","year":2001,"developer":"Konami of America, Inc.","url":"PS2_COLLECTION_PART10/Frogger%20-%20The%20Great%20Quest%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2309934481,"score":5.2,"genres":"Action > Behind view","desc":"<p>Frogger returns with a brand new look, style of gameplay and attitude. Enter Firefly pond and join a magical adventure where an all-new Frogger searches for the princess of his dreams. In a lush 3D environment, Frogger explores dark caverns, goblin trails, swirling streams, perilous swamps and huge castles. During his adventures, Frogger interacts with over 80 unique characters that will help or hinder him in his quest to become a prince.</p>"},{"name":"Frogger's Adventures: The Rescue","year":2003,"developer":"Hudson Soft Company, Ltd.","url":"sony_playstation2_f/Frogger%27s%20Adventures%20-%20The%20Rescue%20%28USA%29.zip","filesize":764545292,"score":6.4,"genres":"Action > Top-down > Arcade > Puzzle elements > Licensed","desc":"<p>'The Rescue' is another game in the storied Frogger franchise. You play as Frogger who must \"hop-n-dodge\" his way through 7 worlds and 25 plus levels. All this in search for his girlfriend. The gameplay follows in its predecessors' footsteps with challenging puzzles and enemies. On your quest, you will also encounter mini-quests and side stories adding to the fun. In addition to the story mode is a multiplayer mode for up to 4 players to compete in action.</p>"},{"name":"Front Mission 4","year":2003,"developer":"Square Enix Co., Ltd.","url":"sony_playstation2_f/Front%20Mission%204%20%28USA%29.zip","filesize":1220578362,"score":7.5,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Turn-based > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In the year 2096, the Wanzer (\"Walking Tanks\" mecha) form the backbone of many military forces. The European Community is enjoying a period of relative peace when it is surprised by sudden attacks on German bases from a mysterious force. To investigate, it is decided to send the EC Armor Tactics Research Corps, also known as \"Durandal\". Inside the Durandal, a young new recruit, Elsa soon finds herself caught in an international plot. Meanwhile, the nation of Venezuela, is attempting to secede from the Unified Continental States (U.C.S.). UCS Forces are sent in to restore order and dispose of Governor Diaz. During a routine patrol, Sgt. Darril and his patrol witness a cargo plane being shot down. Heading to investigate, they soon discover it was a plane carrying part of Diaz's gold. For demoralized UCS soldiers like Darril, this smells like opportunity...</p><p><em>Front Mission 4</em> is a turn based strategy game where the plot switches between two different theaters of operation: Elsa and Darril. Controlling the wanzer forces of either character, the story progresses simultaneously. Most battles take place on an overhead map divided into a Player phase and an Enemy phase. Typically a wanzer can move once and use his remaining Action Points (AP) to fire on the enemy or use an ability. Success in battle earns Experience Points, which are traded in for new abilities, such as Rapid Fire or Evasion bonuses. Each character has a set limit of Skill slots, which are filled up differently by abilities. While each character starts with a preference in skills, there is no limitation on what any pilot can learn. Money, found during on the map (along with items) or earned after a successful battle, can be used to upgrade wanzers and purchase new weapons.</p>"},{"name":"Front Mission 5: Scars of the War","year":2005,"developer":"Square Enix Co., Ltd.","url":"sony_playstation2_f/Front%20Mission%205%20-%20Scars%20of%20the%20War%20%28Japan%29%20%28Ultimate%20Hits%29.zip","filesize":2776136196,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Turn-based > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Front Mission 5: Scars of the War</em> is the fifth in Square's Front Mission tactical RPG series. It brings the player back to a gritty futuristic world in which conflicts are waged between five world powers: the U.S.N., O.C.U., E.C., O.A.C., and the Republic of Zaftra. Such conflicts are waged with the wanzer, Front Mission-speak for mecha.</p><p>Gameplay-wise, the game is a true return to Front Mission 2 roots while incorporating various features from Front Mission 1, 3, and 4. The player takes part in turn-based missions, which pit their group of wanzers against enemy forces. Old features that have returned include the ability to upgrade parts and mission branching. New features to <em>Front Mission 5</em> include friendly fire and the ability to recruit new pilots.</p><p>Unlike the previous games which were fairly standalone, <em>Front Mission 5</em> covers the time period from 2070 to 2121. In effect, it goes through conflicts seen in the previous games as the years pass by. Through the eyes of U.S.N. soldier/officer Walter Feng, the player experiences his story as he deals with the aforementioned conflicts. With the passing of time, he becomes witness to hidden truths and accounts. Eventually, Feng is drawn to the on-going war on terrorism and begins to search for the truth.</p>"},{"name":"Front Mission Online","year":2005,"developer":"Square Enix Co., Ltd.","url":"sony_playstation2_f/Front%20Mission%20Online%20%28Japan%29.zip","filesize":1118337925,"score":"","genres":"Action > 3rd-person (Other) > Arcade > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>A multiplayer-only arcade shooter based on Square's Front Mission universe of futuristic mecha warfare. Joining either the USN or OCU during the second Huffman conflict, you duke it out on online arenas in your Wanzer for fame and money, which you can use to further upgrade your Wanzer with new weapons and special upgrades.</p><p>All strategy elements from the series are removed save from the mechanics of damage and action, and the game is played from a 3rd person perspective similar to other 3d action titles. Registration to Square's PlayOnline service and a monthly free is required for playing. The game has built-in support for VoIP.</p>"},{"name":"Fruit Fall","year":2005,"developer":"Mere Mortals Ltd.","url":"sony_playstation2_f/Fruit%20Fall%20%28Europe%2C%20Australia%29.zip","filesize":33578146,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Tile matching puzzle","desc":"<p><em>Fruit Fall</em> is a keyboard-controlled, tile matching puzzle game for up to four players.</p><p>The player is presented with a game area in the form of an irregular walled maze. Within the maze are pieces of fruit, the object of the game being to get three pieces of the same fruit touching each other at which point they vanish and the player scores points. The only controls the player has are action keys which rotate the game area clockwise or counterclockwise.</p><p>The game has three game worlds: a ghoulish ghost world, an underwater lost city, and deep space - each with twenty-five levels. There are three modes of play:* Single Player Arcade mode: Playing one stage at a time where each stage contains five levels. The aim is to complete each level within the time limit to advance to the next level. Points are awarded for completing the levels quickly, and bonuses can be won for clearing multiple fruit types in one move.</p><ul><li>Single Player Tight Turn Mode: Here the aim is to complete each level within the allotted number of moves.</li><li>Multiplayer: Where up to four players compete against each other by playing in a split-screen game</li></ul>"},{"name":"Fruit Machine Mania","year":2006,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART10/Fruit%20Machine%20Mania%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":78435537,"score":"","genres":"Action > Gambling > 1st-person","desc":"<p><em>Fruit Machine Mania</em> is a slot machine simulator for one person. The game is entirely keyboard controlled and contains six slot machines.Each machine looks and plays differently. Play to unlock new machines or bonus games.</p>"},{"name":"Fu'un Super Combo","year":2007,"developer":"SNK Corporation"},{"name":"Fukakutei Sekai no Tantei Shinshi: Agyō Sōma no Jiken File (Genteiban)","year":2009,"developer":"","url":"sony_playstation2_f/Fukakutei%20Sekai%20no%20Tantei%20Shinshi%20-%20Akugyou%20Souma%20no%20Jiken%20File%20%28Japan%29.zip","filesize":1343515482,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition release includes:</p><ul><li>Fukakutei Sekai no Tantei Shinshi: Agyō Sōma no Jiken File</li><li>Audio drama CD</li></ul>"},{"name":"Full House Kiss","year":2004,"developer":"Capcom Co., Ltd.","url":"sony_playstation2_f/Full%20House%20Kiss%20-%20Ren%27ai%20Adventure%20%28Japan%29%20%28Taikenban%29.zip","filesize":449308560,"score":"","genres":"Simulation > 2D scrolling > Anime / Manga > Visual novel > Point and select > Contemporary > Japan (Ancient/Classical/Medieval) > Detective / mystery > Romance","desc":"<p>Your parents have passed away and you have lost your entire fortune. Six months ago, in order to find your sister who has gone missing, you enter into contract with a man.</p><p>“You are a teacher in the morning and a housewife at night. When chance strikes you become a private detective… but in fact you are actually a high school student”</p><p>By making good use of these 4 masks, where will your fate take you…?</p><p>Some PlayStation®2 Classics contents may not display correctly when using a standard definition television.</p>"},{"name":"Full Spectrum Warrior","year":2005,"developer":"Pandemic Studios, LLC","url":"PS2_COLLECTION_PART10/Full%20Spectrum%20Warrior%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1237893151,"score":7.6,"genres":"Action > Strategy > 3rd-person (Other) > Shooter > Tactical shooter > Contemporary","desc":"<p>In <em>Full Spectrum Warrior</em>, you take on the role of commander of two squads of the United States military, Alpha and Bravo, as you guide them in the fictional country of Zekistan on a mission to capture or kill the terrorist Al Afad.</p><p>In this game, you don't directly control your troops. You don't take aim at a target and shoot, and you don't circle-strafe around enemies. Instead, you tell your squad what to do, and they'll do it. It's like a real-time strategy game. You can tell your two squads to do numerous things, such as hide behind a wall, take cover behind a car, lob a grenade, fire off a rocket, or attack a target. You will need to utilize both squads to be successful. For example, you can have Alpha squad hide behind a car and lay down covering fire at a target that you can't directly kill, giving Bravo squad cover so they may cross open terrain, and get into a position where they will be able to kill the enemy.</p><p>The game takes place in one location, a Middle Eastern country, that is split up into several areas. You will have to make your way through parks, an airport, city streets, and even some buildings. Throughout the country are many terrorists, all of whom are trying to kill you. You have four members on each squad; the team leader, automatic rifleman, grenadier and rifleman, each playing a unique role.</p><p><em>Full Spectrum Warrior</em> supports Xbox Live, where two players can play through the single player campaign. Instead of controlling both squads, one player controls Alpha while the other controls Bravo.</p>"},{"name":"Full Spectrum Warrior: Ten Hammers","year":2006,"developer":"Pandemic Studios, LLC","url":"PS2_COLLECTION_PART10/Full%20Spectrum%20Warrior%20-%20Ten%20Hammers%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":2108306494,"score":7.1,"genres":"Action > Strategy > Behind view > Shooter > Contemporary > Regional differences","desc":"<p><em>Full Spectrum Warrior: Ten Hammers</em> is the successor of Full Spectrum Warrior.</p><p>Although you killed the tyrant of Zekistan in the first game, the situation hasn't improved. A civil war begins to unfold and various insurgencies fight against the Western forces. Even ethnic hostilities erupt in violence. So once again squads of US Light Infantry are send into the country to secure the Tien-Hamir (or \"Ten Hammers\") Province. But this time they can call upon the assistance of the British elements of the Coalition Forces.</p><p>Like in Full Spectrum Warrior you are the commander of two Fire Teams called Alpha and Bravo. But now you can brake down a Fire Team to a Buddy Team consisting of the Team Leader with the Automatic Rifleman and the Grenadier with the Rifleman. In some missions you also have now access to a Bradley Fighting Vehicle which you control just like you control a fire team. In some missions you'll also find tanks or APCs which your Fire Teams can enter and use.</p><p>You can now also give orders to a specific teammate. So if you want to breach a door, you order the Grenadier to unpack the rocket launcher and make a nice hole. It is also possible to give orders to the Fire Team you don't control right now.</p><p>Unlike the first game, Ten Hammers doesn't feature a separate tutorial but you rather learn how to play in the very first mission.</p><p>The twelve missions of the campaign feature several different objectives like reaching a convoy or destroy a street barrier. Since your squads can now enter buildings you have a whole new tactical layer to use against the many foes that hide in the shadows ready to kill you. To support this new feature, you can now also deploy a sniper in a building and activate the sniper mode in which you can take out the enemies one by one.</p><p>The multiplayer-mode also got updated and features now the ability to play cooperatively with four friends or do a few 2-on-2 objective based missions.</p>"},{"name":"Fullmetal Alchemist 2: Curse of the Crimson Elixir","year":2004,"developer":"Racjin Co., Ltd.","url":"sony_playstation2_f/Fullmetal%20Alchemist%202%20-%20Curse%20of%20the%20Crimson%20Elixir%20%28USA%29.zip","filesize":2134240800,"score":6.7,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Licensed","desc":"<p><em>Fullmetal Alchemist 2: Curse of the Crimson Elixi</em> is a 3D cel-shaded action a role-playing video game based on the Fullmetal Alchemist anime and manga series. That follows the journey of the two brothers Edward and Alphonse Elric as they travel to the desert city of Lior where they have to deal with Father Cornello in search for leads on Philosopher's Stone. But there is more going on than meets the eye. It's a prequel to Fullmetal Alchemist and the Broken Angel, with 30 minutes of original animation exclusive to the game.</p><p>In the action RPG style gameplay, players control Edward while Alphonse tags along as a sidekick. Edward can use alchemy to transmute mundane objects into a variety of weapons for him or Al to use.</p>"},{"name":"Fullmetal Alchemist 3: Kami o Tsugu Shōjo","year":2005,"developer":"Racjin Co., Ltd."},{"name":"Fullmetal Alchemist and the Broken Angel","year":2003,"developer":"Racjin Co., Ltd.","url":"sony_playstation2_f/Fullmetal%20Alchemist%20and%20the%20Broken%20Angel%20%28USA%29.zip","filesize":1835890662,"score":6.5,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Licensed","desc":"<p><em>Fullmetal Alchemist and the Broken Angel</em> is a game based on the manga and anime series <em>Fullmetal Alchemist</em>, which follows the journey of Edward and Alphonse Elric on their quest for the Philosopher's Stone. The game takes place during their journey to Central City. The story and events depicted in the game take place between episode 17 and 18 of the anime, and were written by the original creator Hiromu Arakawa.</p><p>In this action RPG game, the player can use the sibling's alchemical powers to create items and equipment to use in battle. It features Edward as the main character, and Alphonse as a sub character who can be called in battle.</p>"},{"name":"Fur Fighters","year":2001,"developer":"Bizarre Creations, Ltd."},{"name":"Fūraiki","year":2006,"developer":"FOG inc."},{"name":"Fūraiki 2","year":2005,"developer":"FOG inc."},{"name":"Furry Tales","year":2004,"developer":"Mad Monkey Studio","url":"PS2_COLLECTION_PART10/Furry%20Tales%20%28Europe%29%20%28En%2CFr%29.zip","filesize":144360055,"score":"","genres":"Strategy > Diagonal-down > Real-time > Real-time strategy > War","desc":"<p>After a thousand years of warfare, the conflict still rages between Sheep and Wolves. This conflict devastates meadows and forests, soiling them with blood.</p><p>The wolves are jealous of the green pastures where sheep nonchalantly graze. Full of hate the wolves want to prove their superiority.</p><p>The sheep have decided to react. Armed with all sorts of weapons they are ready to proudly protect their wool.</p><p>Either play solo or with a friend and try to achieve all objectives in the 10 elaborate missions.</p><p>Will you be able to rid the world of these nasty wolves!</p>"},{"name":"Futakoi Alternative: Koi to Shōjo to Machinegun","year":2005,"developer":"Marvelous Interactive, Inc.","url":"sony_playstation2_f/Futakoi%20Alternative%20-%20Koi%20to%20Shoujo%20to%20Machine%20Gun%20%28Japan%29.zip","filesize":1457454585,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Licensed","desc":"<p><em>Futakoi Alternative</em> (aka Twin Love Alternative) is a spin off of a TV anime with the same name. As the title implies, <em>Futakoi Alternative</em> is an alternate version based on the original <em>Futakoi</em> TV anime and video game. While some characters are recurring, the setting and everything is completely different, like an alternate version of the overall story (think parallel universe where base is the same, characters are the same, but everything happens differently).</p><p>The story focuses on Rentarou Futaba and his detective agency. One day, a pair of twins, Sara and Souju Shirogane, appear at his place and start working as his secretaries at the agency. But Sara and Souju are by far not the only twin sisters that appear in the game. Unlike most of static visual novels, <em>Futakoi Alternative</em> includes a couple of quick-time modes during the adventure part of the game where you have to press the right button before the time runs out. The game also includes CG and BGM player in the extras section of the main menu.</p>"},{"name":"Futurama","year":2003,"developer":"Unique Development Studios AB","url":"PS2_COLLECTION_PART10/Futurama%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2236957617,"score":6.5,"genres":"Action > 3rd-person (Other) > Behind view > Platform > Puzzle elements > Shooter > Comedy > Licensed","desc":"<p>The <em>Futurama</em> series, winner of a 2002 Emmy Award for Best Animated Program, has been recreated on gaming consoles. The game has been developed in close cooperation with the people behind the TV series and is presented as a 3D platform game with an authentic cartoonish look. All famous characters make an appearance and the story is guided with animations and original advertisements with the look and feel of the TV series.</p><p>Mom has bought Planet Express Deliveries from Professor Farnsworth and has gained control over planet Earth. It's up to the player's crew (Fry, Leela, Dr. Zoidberg, Bender, ...) to stop her evil plans.</p>"},{"name":"Future Tactics: The Uprising","year":2004,"developer":"Zed Two Game Design Studio","url":"PS2_COLLECTION_PART10/Future%20Tactics%20-%20The%20Uprising%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":348943680,"score":6.1,"genres":"Strategy > 3rd-person (Other) > Turn-based > Turn-based strategy > Fantasy","desc":"<p>Future Tactics: The Uprising is a turn-based tactical game by developer Zed Two. The world of Pillage has been taken over by alien creatures and the player has to stop this, taking the role of Low and his little sister Pepper, along with other characters they meet along the way. </p><p>The battle system in Future Tactics combines tactics with a few reflexes. By firing a gun you have to play some sort of mini-game. The better you play, the more accurate your shot will be. Future Tactics uses cartoon-like 3D graphics with completely deformable terrain.</p>"}]