[{"name":"G-Force","year":2006,"developer":"Mere Mortals Ltd.","url":"sony_playstation2_g/G-Force%20%28Europe%2C%20Australia%29.zip","filesize":90022888,"score":"","genres":"Sports > Behind view > Persistent > Tricks / stunts > Direct control > Snowboarding / skiing > Naval / watercraft","desc":"<p>G-Force takes the player on an journey into the wide world of water skiing.</p><p>The game consists of three play modes. Practice - for honing your skills in the noble art of water skiing and mastering tricks. Race - a points based mode where you compete against AI based on the point value of the tricks you land, and last but not least Championship. Where levels must be completed by getting a minimum point score to unlock the next course. Making the players journey harder is the large amount of detritus to avoid in the rivers, from floating logs to harsh riverbanks.</p>"},{"name":"G.I. Joe: The Rise of Cobra","year":2009,"developer":"Double Helix Games","url":"PS2_COLLECTION_PART10/G.I.%20Joe%20-%20The%20Rise%20of%20Cobra%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1799284420,"score":5.1,"genres":"Action > 3rd-person (Other) > Arcade > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>G.I. Joe: The Rise of Cobra</em> is based off of the 2009 blockbuster movie, but features a brand new storyline that differs from the movie where an elite group of soldiers must fight against the diabolical Cobra Commander and stop his organization known as Cobra from taking over the world.</p><p>The gameplay is similar to Neo Contra with a behind the back view where the player uses a variety of weapons including machine guns and rocket launchers and the Delta 6 Accelerator Suit that makes the player invulnerable for a short period of time. Using these weapons and accessories the player must fight his way through a horde of enemies including soldiers, tanks and jet fighters, along with the standard end of level bosses.</p><p>The player can choose from 12 different Joes, but only a certain set at the beginning and unlocking more for completing missions, each with their own weapon and strengths depending upon their rank (<em>Commandos</em> are great at close range, <em>Heavy Weapons</em> are good at shooting from long distances while <em>Soldiers</em> are a mix of both), along with using various vehicles scattered throughout the stages. The game also features a two-player drop-in/drop-out co-op option that allows a friend to join a game at any time, however during gameplay without a human ally, the computer's A.I. will take over for the second on-screen soldier.</p>"},{"name":"G1 Jockey","year":2001,"developer":"KOEI Co., Ltd.","url":"PS2_COLLECTION_PART10/G1%20Jockey%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":327336054,"score":"","genres":"Action > Sports > Horse / derby","desc":"<p><em>G1 Jockey</em> a horse racing game with two game modes, a single player story mode and a one or two player trial mode in which the player(s) just compete in random races without the career progression.</p><p>In story/career mode the player starts as a novice jockey alongside two other AI jockeys and joins a stable. Each week they bid to take part in races aiming to end the year with the Rookie Of The Year contest after which they progress through successive to become Leading Jockey. The game is, in a way, endless because achieving leading Jockey status is not the end of the game - the player can continue playing season after season after season ...</p><p>Very early on the player acquires an agent who gives advice on tactics and career development. The player is not guaranteed races on good horses until they have experience. Initially they must bid for races on unproven horses and impress the trainers by finishing higher in the standings than predicted.<br> All races are viewed from the traditional rear, 'jockey's backside' point of view though the L1/R1 buttons do provide a sideways view and, when held down continually a rear view. During the race the player has to balance four things - the overall speed of the horse, the stamina, horse motivation, and the potential, which affects for how long the horse can keep the speed high after all stamina was lost. By using the whip on both left and right the horse can be raised to it's 'Go' state - motivated for the final surge.</p><p>The game boasts over two thousand unique horses, and sixty five AI opponents each season</p>"},{"name":"G1 Jockey 3","year":2002,"developer":"KOEI Co., Ltd.","url":"PS2_COLLECTION_PART10/G1%20Jockey%203%20%28Europe%29.zip","filesize":289013070,"score":"","genres":"Sports > 3rd-person (Other) > Horse / derby","desc":"<p>Fancy hats, oval turf tracks and people waving tiny bits of paper on the stands. Welcome to the world of horse racing. While most other racing games have the player controlling a motorized vehicle (such as a car or a powerboat), or using physics to move closer to the goal (skiing, sailing and so on), in <em>G1 Jockey</em> the player is controlling an animal, which makes it slightly different from other racing games in the market.</p><p>The player has to balance four things - the overall speed of the horse, the stamina, horse motivation, and the potential, which affects for how long the horse can keep the speed high after all stamina was lost - crucial for the last stretch sprint. It's impossible to raise all four at once, so players must have a well defined strategy to succeed.</p><p>Depending on their abilities, each horse might be better suited for a particular strategy or type of race, and each must be treated differently to achieve the best possible result. The game features a large roster of horses, and many tracks to choose from, including flat track and steeplechase races. Game modes include race training, a tutorial, two player mode, and the career mode, where the player starts as a rookie jockey, and must complete races and training sessions to attract the attention of better stables.</p>"},{"name":"G1 Jockey 3 + Winning Post 5: Maximum 2002","year":2002,"developer":""},{"name":"G1 Jockey 4","year":2008,"developer":"KOEI Co., Ltd.","url":"PS2_COLLECTION_PART10/G1%20Jockey%204%20%28Europe%2C%20Australia%29.zip","filesize":455726412,"score":"","genres":"Sports > 3rd-person (Other) > Horse / derby","desc":"<p>A revolutionary horse racing experience that brings you closer to the real thing than ever before. Work your way up from novice status to become a renowned horse racing legend throughout a full, in depth career.</p>"},{"name":"Ga-rou-den Breakblow","year":2005,"developer":"Opus Corp.","url":"sony_playstation2_g/Garouden%20-%20Breakblow%20%28Japan%29.zip","filesize":2196108759,"score":"","genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Fighting > Martial arts > Licensed","desc":"<p>Bunshichi Tanba is a man who loves to fight. He seeks out opponents wherever they might be found, but one day he stumbles upon an underground fighting league and is promptly humiliated by an opponent much stronger than himself, and he vows to become stronger and to return for a rematch.</p><p><em>Ga-rou-den Breakblow</em> is a 3D fighting game based on the manga by Baku Yumemakura and Keisuke Itagaki. Choose from a variety of martial arts experts, each with their own special techniques and special moves. There is a focus on grappling and submission moves, and unlike most fighting games, the two combatants share a life bar which will move back and forth depending on performance, and granting the use of different special moves. The game offers a standard story mode where the the story can be experienced with different characters, as well as a versus mode, a training mode, and a survival mode.</p>"},{"name":"Gadget & Gadgetinis","year":2004,"developer":"Eko Software SARL","url":"PS2_COLLECTION_PART10/Gadget%20%26%20the%20Gadgetinis%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":163449480,"score":"","genres":"Action > Behind view > Platform > Shooter > Licensed","desc":"<p><em>Gadget &amp; the Gadgetinis</em> is a 3D platform game that is played from a behind view perspective. Villains are spreading a gas across Las Vegas that makes people go mad. WOMP - the organization that Gadget is part of - suspects that MAD and Dr. Claw are behind it. Gadget is sent to deal with the culprits and has to destroy several laboratories across the globe that produce the gas.</p><p>Gameplay includes platforming with Inspector Gadget and defeating various enemies. The game offers more than twelve gadgets and four levels. These are Las Vegas, China, WOMP headquarters and MAD’s base. Sometimes you take control of one of the Gadgetinis and have to shoot at enemies.</p>"},{"name":"Gadget Racers","year":2002,"developer":"Barnhouse Effect Co., Ltd","url":"PS2_COLLECTION_PART10/Gadget%20Racers%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":173465794,"score":"","genres":"Racing / Driving > Behind view > Arcade > Automobile > Vehicle simulator","desc":"<p><em>Gadget Racers</em> is a racing game in the <em>Choro Q</em> series. This title differs slightly differently compared to other games. There are no RPG elements to this game, with tracks and races chosen through a menu system similar to a Gran Turismo title rather than talking to other cars.</p><p>The player starts by choosing one of six car bodies. Later the other bodies can be purchased through the shop, along with other variants (bodies are purely cosmetic). Upgrading the player's vehicle is done by buying parts. Many of the parts are normal for racing games (engines, tires etc.) with some more specialized parts like wings or skis. Money is gained by completing races, a bonus is added depending on your position.</p><p>Game modes included are: Sprint, Grandprix, Engine Regulation, Endurance, Off-Road Regulation, Body Type Regulation, Parts Regulation, and Duel.* Sprint races are simple and standard races in three difficulty levels (Beginner, Intermediate and Upper)</p><ul><li><p>Grand Prix requires licenses gained from the Driving School, once gained the GP choices are as follows:</p><ul><li>Country GP</li><li>Global GP</li><li>High Grade GP</li></ul></li><li><p>Engine Regulation races are dependent on the horsepower of your engine, and are ranked in 3 classes (Light, Middle, and Heavy)</p></li><li><p>Endurance races feature more laps than the regular races. There are only 5 tracks included in the mode</p></li><li><p>Off-Road Regulations tests the players ability to handle off-road situations. Three grades are available: Dirt Mini, Dirt Big and Dirt HG.</p></li><li><p>Body Type Regulation races are split between 8 styles, and is based on the body type of the player's vehicle</p></li><li><p>Parts Regulation races are designed with the special parts in mind.</p></li><li><p>Duel races are one-on-one races between the player and the computer</p></li></ul>"},{"name":"Gaelic Games: Football","year":2005,"developer":"IR Gurus Interactive Pty Ltd.","url":"PS2_COLLECTION_PART10/Gaelic%20Games%20-%20Football%20%28Europe%29%20%28En%2CGd%29.zip","filesize":166261966,"score":"","genres":"Sports > Football (European) / Soccer","desc":"<p>Gaelic football is a popular sport in Ireland. It's similar to soccer in so far as you got a goalie on each end, but it also has similarities with basketball since you can lift the ball off the ground with your hands, hand pass etc. Players will pass, kick and carry the ball up the other end of the field, and will attempt to score while attempting to dodge opponent players trying to gain possession of the ball. </p><p>The goals are a bit different to soccer as well, the player can attempt to kick the ball past the goalie for higher points, but they can also kick the ball over the goalies head where the goalie can't defend for fewer points. </p><p>The game itself has sponsorship from the Gaelic Athletes Association who owns all the rights to the team names and stadiums etc. The game did not however have sponsorship from the Gaelic Players Association who has the rights to the actual player names, so none of the official player names will feature in the game.</p><p>All the team Guernseys appear in the game from 32 of the teams, plus New York. 11 stadiums feature in the game. </p><p>3 of the major competitions feature in the game. </p><p>League which plays similar to soccer league in so far as you got 4 different divisions, teams move in between divisions depending how they do each year, and teams win for each division.</p><p>Provincial, which features the 4 provinces in Ireland, teams from each province will battle it out against each other.</p><p>Al Ireland, based on the performance of the Provincial matches, teams will battle it out against each other to find out who will win for all of Ireland. </p><p>The game features full fixtures, that allow you to monitor how your team has been playing in the different competitions, and you'll also have the chance to trade/improve players at the end of the season.</p>"},{"name":"Gaelic Games: Football 2","year":2007,"developer":"IR Gurus Interactive Pty Ltd.","url":"PS2_COLLECTION_PART10/Gaelic%20Games%20-%20Football%202%20%28Europe%29%20%28En%2CGd%29.zip","filesize":290696737,"score":"","genres":"Sports > 3rd-person (Other) > Rugby > Licensed","desc":"<p><em>Gaelic Games: Football 2</em> is the officially licensed game of the Gaelic Athletic Assocation. It includes all 32 County teams, over 300 Club teams, and 12 major stadiums, including Croke Park, Casement Park, Parnell Park, St Tiernach's Park, Semple Stadium, O'Moore Park, Hyde Park, Fitzgerald Stadium, Pairc U Chaoimh, and Parc Tailteann. The jerseys and stadia are authentic, but as it does not carry the GPA license, the players' names and faces are not.</p><p>The game modes are Single Match, Season Mode, Manager Mode, Mission Mode and Training Mode. Single Match is the fastest way to play a game of football. Use the Single Match summary screen to set your favourite team and then randomise the other settings; such as home and way teams, stadium, weather, and rules. Mission mode allows you to take up the challenge and feel the pressure with these historical matches. Each mission has a handicap that a team must overcome; from seemingly impossible score deficits, to slim leads with seconds left on the clock. Manager mode takes you from season to season, with features including a new calendar view of the fixtures, new training to guide your players’ development, season stats for all the players in the league, and leaderboards for all stats categories.</p><p>The extensive team editing functions in the game allow you to edit the names of the County team players, and to edit all details of the Club teams; including the team name, uniform style and colours, and the names, appearance, and details of each of the players.</p><p>The game also includes support for the Cameo EyeToy and Digimask that allows a player to put his/her head into the game on top of one of the players. Four-player multiplayer is supported using the PS2 multitap.</p>"},{"name":"Gaelic Games: Hurling","year":2007,"developer":"IR Gurus Interactive Pty Ltd.","url":"PS2_COLLECTION_PART10/Gaelic%20Games%20-%20Hurling%20%28Europe%29%20%28En%2CGd%29.zip","filesize":302789403,"score":"","genres":"Sports > 3rd-person (Other) > Licensed","desc":"<p><em>Gaelic Games: Hurling</em> is the officially licensed game of the Gaelic Athletic Association. Hurling is a fast-paced Gaelic sport that is played with sticks (the hurley) and a ball (the sliotar). </p><p>Gaelic Games: Hurling includes all 32 County teams, over 300 Club teams, and 12 major stadiums, including Croke Park, Casement Park, Parnell Park, St Tiernach's Park, Semple Stadium, O'Moore Park, Hyde Park, Fitzgerald Stadium, Pairc U Chaoimh, and Parc Tailteann.</p><p>Game modes in Gaelic Games: Hurling are Single Match, Season Mode, Manager Mode, Mission Mode and Training Mode. Single Match is the fastest way to play a game of hurling. Use the Single Match summary screen to set your favourite team and then randomise the other settings; such as home and way teams, stadium, weather, and rules. Mission mode allows you to take up the challenge and feel the pressure with these historical matches. Each mission has a handicap that a team must overcome; from seemingly impossible score deficits, to slim leads with seconds left on the clock. Manager mode takes you from season to season, with features including a new calendar view of the fixtures, new training to guide your players’ development, season stats for all the players in the league, and leaderboards for all stats categories.</p><p>The extensive team editing functions in the game allow you to edit the names of the County team players, and to edit all details of the Club teams; including the team name, uniform style and colours, and the names, appearance, and details of each of the players.</p><p>The game also includes support for the Cameo EyeToy and Digimask that allows a player to put his/her head into the game on top of one of the players. Four-player multiplayer is supported using the PS2 multitap.</p><p>The game comes with the Official GAA Hurling / Football skills DVD. This DVD features routines which can be practiced to help master the key skills of the game.</p>"},{"name":"Gakuen Heaven: Boy's Love Scramble!","year":2003,"developer":"Spray","url":"sony_playstation2_g/Gakuen%20Heaven%20-%20Boy%27s%20Love%20Scramble%21%20%28Japan%29.zip","filesize":2215776303,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Gakuen Heaven: Boy's Love Scramble</em> is a visual novel in which a male player character pursues relationships with other men, more widely known in Japan as a BL (boys' love) game. The story is told from the perspective of Keita Itō, an average teenager who by sheer luck is admitted into the prestigious Bell Liberty Academy. Keita enjoys his stay until his admittance is revealed to be a mistake, as Keita has no special skills that place him in line with the elite that attend the school. Frustrated with this turn of events, Keita attempts to confront the school's chairman before receiving an email from the man himself, informing him that if anything will keep him in the school, it's his amazing luck which in itself is an admirable ability. The next day, a contest begins to determine the MVP of the school, and Keita must use this opportunity to prove to the chairman and the entire student body that he deserves to be a part of Bell Liberty Academy. Here, Keita and a partner of his choice embark on their quest for total victory and eventual romance. </p><p>There are 10 characters which Keita can pursue a relationship with, each with different endings. There are also bonus scenarios, unlocked by completing routes in the main game. The PlayStation 2 version introduces voice actors for the characters, with full voice acting not seen in the original PC game.</p>"},{"name":"Gakuen Utopia: Manabi Straight! - Kirakira Happy Festa!","year":2007,"developer":"Marvelous Interactive, Inc.","url":"sony_playstation2_g/Gakuen%20Utopia%20-%20Manabi%20Straight%21%20Kira%20Kira%20Happy%20Festa%21%20%28Japan%29.zip","filesize":1754644752,"score":"","genres":"Action > Adventure > 3rd-person (Other) > Fixed / flip-screen > Anime / Manga > Visual novel > Sci-fi / futuristic > Licensed","desc":"<p>Originally a console visual novel, and as such non-adult by default, this game focuses on a slice-of-life story of Manami Amamiya. The year is 2035 and the Earth is suffering from decreased birthrate. Also, many schools are closing because they lack sufficient number of students. Seiou Academy (聖桜学園) is one such school in crisis of being closed. Manami Amamiya, who switched schools and recently became the student of Seiou Academy, is trying to prevent that from happening. Along with her friends, she is on a mission to bring back the vitality in the area, help various townsfolk, and organize the summer festival.</p><p>The game is based on the <em>Gakuen Utopia: Manabi Straight!</em> manga from 2005 which also spanned anime series which started airing in 2007, just a couple of months before this game's release.</p>"},{"name":"Galactic Wrestling featuring Ultimate Muscle","year":2004,"developer":"AKI Corporation","url":"sony_playstation2_g/Galactic%20Wrestling%20featuring%20Ultimate%20Muscle%20-%20The%20Kinnikuman%20Legacy%20%28USA%29.zip","filesize":575429047,"score":6.8,"genres":"Action > Sports > 3rd-person (Other) > Fighting > Wrestling > Sci-fi / futuristic > Licensed","desc":"<p>GWfUM is a wrestling/fighting game developed by the same development team that did Def Jam Vendetta.  There are 45 different characters based on the Fox Channels \"Ultimate Muscle\" TV show, each with their own unique features and finishing moves.  There are several locations to wrestle in along with six different modes including one on one exhibition, tag team, battle royal and even a five on five tag team match.  Four players can use multitap to play against each other or tag up against each other.</p>"},{"name":"Galerians: Ash","year":2002,"developer":"Polygon Magic, Inc.","url":"PS2_COLLECTION_PART10/Galerians%20-%20Ash%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3859832391,"score":6.2,"genres":"Action > 1st-person > 3rd-person (Other) > Puzzle elements > Survival horror > Sci-fi / futuristic","desc":"<p><em>Galerians: Ash</em> continues directly the story told in the first Galerians. Five hundred years into the future, an ultra-intelligent mother computer named Dorothy was given the responsibility of managing humans' lives. However, the computer's mind told her the humans must be destroyed as weak, imperfect beings, and a race of super-humans, the Galerians, must be created. But Rion, the hero of the first game, destroyed Dorothy in a dramatic battle. Now Rion is brought back to life and learns that Dorothy was able to execute a destructive program before her death. Once again, Rion must face and defeat Dorothy's creations, the Galerians.</p><p>The gameplay is similar to that of its preceding game, complementing a traditional survival horror scheme with the protagonist's unique abilities. Rion can fight enemies using various psychic techniques. The more he uses a technique, and the more damage he sustains, the more \"addicted\" he becomes, and when the addiction meter reaches the limit, his hit points get gradually depleted, and he cannot walk normally anymore. Like in other survival horror games, the protagonist relies heavily on healing and restoring items. Enemies also drop items that would raise Rion's maximum hit points or make his weapons stronger, in a RPG-like fashion.</p>"},{"name":"Galileo Mystery: The Crown of Midas","year":2009,"developer":"Independent Arts Software GmbH","url":"PS2_COLLECTION_PART10/Galileo%20Mystery%20-%20Die%20Krone%20des%20Midas%20%28Germany%29.zip","filesize":2094961548,"score":"","genres":"Adventure > 3rd-person (Other) > Cinematic camera > Graphic adventure > Puzzle elements > Point and select > Contemporary > Fantasy > Detective / mystery","desc":"<p>In <em>Galileo Mystery: The Crown of Midas</em> you have a new job as watchmen in a museum. But in your first night shift your adventure begins and mysterious things happen. Together with your girl friend you need to solve riddles and puzzles like rebuilding a dinosaur skeleton, find secret chamber and things, play a chess-like-game, balance over an abyss and so on.</p>"},{"name":"Gallop Racer 2001","year":2001,"developer":"Tecmo, Ltd.","url":"sony_playstation2_g/Gallop%20Racer%202001%20%28USA%29.zip","filesize":532648177,"score":7,"genres":"Simulation > Sports > 3rd-person (Other) > Horse / derby","desc":"<p><em>Gallop Racer 2001</em> is the first in the series to make it's appearance on the PlayStation 2 console. The player can partake in a simulation where, as an owner of a stable, they can buy, sell, retire and breed various race horses throughout their career while training and conditioning them along the way. The player will start out with a small amount of <em>Jockey Points</em> that act as currency in this game, using this to start out their stable by buying a horse and entering them in races. Depending how well their horses and jockeys perform during races, they can continue to expand their empire and become the best in the business.</p><p>Not only can the player act as an owner, on race day they can also become the jockey and use their horses strengths to win races in a variety of tracks. The player must play to their horse's strengths and avoid exposing their weaknesses through various weather conditions. If the player and horse does well enough, the horse's attributes can change after the match, but also be affected negatively if they do poorly.</p><p>There is also a <em>Practice</em> mode where the player can learn how to play the game through the various modes and even have the ability to bet on horse races, however this can only be done on this mode. Players can also go head-to-head in a split-screen, either with default horses or ones from their season mode.</p>"},{"name":"Gallop Racer 2003: A New Breed","year":2002,"developer":"Tecmo, Ltd.","url":"sony_playstation2_g/Gallop%20Racer%202003%20-%20A%20New%20Breed%20%28USA%29.zip","filesize":768821118,"score":6.9,"genres":"Racing / Driving > Simulation > Sports > 3rd-person (Other) > Horse / derby","desc":"<p>Gallop Racer 2003 is an update of it's previous incarnations with the standard modes (exhibition and season mode) and has six different jockeys to choose for the players character in the season mode as well as 32 different tracks and over 3000 different horses.</p><p>Players can breed horses using a series of mini-games, the outcome, either good or bad, will determine the type of horse, the better the player is at the mini-games, the more powerful the breed will be.  Also the player can bet on races in the season mode, using the proceeds to buy better facilities to train their stable.  It also features an extensive training program for new players to the Gallop series.</p>"},{"name":"Gallop Racer 2004","year":2004,"developer":"Tecmo, Ltd.","url":"sony_playstation2_g/Gallop%20Racer%202004%20%28USA%29.zip","filesize":748664228,"score":7,"genres":"Sports > Strategy > 3rd-person (Other) > Horse / derby","desc":"<p>GR 2004 is an update of its predecessor, with more tracks and horses to choose from as well as an revamped camera system along with the betting system from previous games and the same gameplay (pressing buttons at certain times during the race to urge and slow the horse). It features the same modes from others like exhibition and season mode with the ability for players to breed up too eight different horses at one time in season mode. It also features a multiplayer tournament for friends to play against each other after each turn.</p>"},{"name":"Gallop Racer 2006","year":2006,"developer":"Tecmo, Ltd.","url":"sony_playstation2_g/Gallop%20Racer%202006%20%28USA%29.zip","filesize":648508462,"score":7.1,"genres":"Simulation > Sports > 3rd-person (Other) > Horse / derby","desc":"<p><em>Gallop Racer 2006</em>, is the perennial update of the Gallop Racer series, with the standard gaming modes: <strong>Exhibition</strong> and <strong>Career</strong>, along with new modes such as <strong>Memorial Quest</strong>, where players can partake in over a 100 classic horse races from past years and <strong>Field of Legend</strong>, where players can test their created horses against actually horses from past years of horse racing. This entire setting is set in a theme park-style arena called <strong>Gallop Racing Square</strong>.</p><p>Not only can players create their own horses, but they can also race classic and legendary horses from previous years in the history of horse racing. The gameplay is virtually the same as previous versions, pressing buttons at a certain point in time to urge the horse while racing, with several gauges to monitor such as the horses stamina, their position in the race as well as their mental condition. Players can also bet in races, with a true feel of betting simulation, figuring in weather conditions, the horses conditions as well as the horses stats.</p>"},{"name":"Game ni Natta yo! Dokuro-chan: Kenkou Shindan Daisakusen (Genteiban)","year":2005,"developer":"","url":"sony_playstation2_g/Game%20ni%20Natta%20yo%21%20Dokuro-chan%20-%20Kenkou%20Shindan%20Daisakusen%20%28Japan%29%20%28Genteiban%29.zip","filesize":1119082383,"score":"","genres":"Special edition > Physical extras","desc":"<p>The <em>limited edition</em> release of <em>Game ni Natta yo! Dokuro-chan: Kenkou Shindan Daisakusen</em> contains:</p><ul><li>Game ni Natta yo! Dokuro-chan: Kenkou Shindan Daisakusen</li><li>Artbook</li><li>Special interview CD</li></ul>"},{"name":"Games Galaxy 2","year":2007,"developer":"","url":"PS2_COLLECTION_PART10/Games%20Galaxy%202%20%28Europe%29.zip","filesize":139715763,"score":"","genres":"Action > Compilation > Puzzle > Strategy > Diagonal-down > Side view > 2D scrolling > Fixed / flip-screen > Arcade > Artillery > Board game > Paddle / Pong > Platform > Shooter > Tile matching puzzle > Tank","desc":"<p><em>Games Galaxy 2</em> is a collection of 25 games that are:</p><ul><li>Cosmo-Jump - An autorun platformer where the player has to make jumps over stacked boxes.</li><li>Color Heroes- A Color Lines variant.</li><li>Sewer Masters - A Pipe Dream variant.</li><li>Connector - A puzzle game where players have to connect together pieces of pipe, but can only rotate them in place.</li><li>Explosive Pumpkin - A Bomberman variant.</li><li>Balls Trapper - A Color Lines variant.</li><li>Towerball - A game where players rotate a central tower and have to collect 4 of the same colored balls that roll in to the playfield to make them disappear.</li><li>Total Wipeout - A Breakout variant.</li><li>One Step - A Tile maze removal variant.</li><li>Apple Eater - A Snake variant.</li><li>Coco Catcher - A Breakout variant.</li><li>Road Breaker - An Amidar variant.</li><li>Football Monster - A Pong variant.</li><li>Old Legends - A Reversi variant.</li><li>Hills in Hell - An action game where the player has to make it to the goal by hopping on lava rocks that are constantly submerging.</li><li>Armored Toys - An overhead tank shooter.</li><li>Retro Battle - An Artillery variant</li><li>Last Standing - An action game where the player shoots exploding discs across a board to try and explode their opponents discs. The player with the last remaining disc wins.</li><li>Space Liberator - An Asteroids variant.</li><li>Gravity Play - A Lunar Lander variant.</li><li>Artic Ranger - A Frogger variant.</li><li>Territory Divider - A Five in a Row variant.</li><li>Combiner - A tile matching puzzle game.</li><li>Space Hockey - A game of hockey where the player controls a ball and tries to hit a puck into the goal.</li><li>Balls Invasion - A Puzzle Bobble variant.</li></ul>"},{"name":"Gametrak: Dark Wind","year":2004,"developer":"Atomic Planet Entertainment Limited"},{"name":"Gantz: The Game","year":2005,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_g/Gantz%20-%20The%20Game%20%28Japan%29.zip","filesize":530078970,"score":"","genres":"Action > Behind view > Free-roaming camera > Anime / Manga > Shooter > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>Gantz: The Game</em> is 3D action game based on a Japanese manga series with the same name. Gantz tells a story of two high school students who die in a train accident and become involved in a \"game\" in which they are forced to hunt down and kill aliens.</p>"},{"name":"Garfield","year":2004,"developer":"The Code Monkeys Ltd.","url":"PS2_COLLECTION_PART10/Garfield%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":359187749,"score":"","genres":"Action > Adventure > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p>Play as the fat cat himself in this interactive puzzle, adventure game. The game takes place entirely inside Garfield's house which is presented in full 3-D.</p><p>Jon has left Garfield and Odie, the dog, alone in the house for the day.  The day has been uneventful until Garfield is rudely awakened from his afternoon nap by a loud noise. He finds that Odie has made a real mess of the house ... and Jon is due home in an hour!</p><p>It's particularly difficult for cats and dogs to use cleaning equipment and supplies...but you'll find a way to use a vacuum cleaner and other objects.  You'll get a big plate of lasagna as a reward if you get it all done before Jon walks in.</p><p>The game is controlled with the keyboard and mouse. Puzzles come in the form of \"mini games.\" You'll be finding and using inventory objects as part of their solutions.</p>"},{"name":"Garfield: A Tail of Two Kitties","year":2006,"developer":"Asobo Studio S.A.R.L."},{"name":"Garfield: Lasagna World Tour","year":2007,"developer":"Eko Software SARL","url":"PS2_COLLECTION_PART10/Garfield%20-%20Lasagna%20World%20Tour%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":280440633,"score":"","genres":"Action > Behind view > Platform > Puzzle elements > Direct control > Fantasy > Licensed","desc":"<p>In <em>Garfield: Lasagna World Tour</em> the cat Garfield joins a treasure hunt called 'The Lasagna World Tour' organized by PAWS TV Channel. Players get to explore ten levels in locations such as Egypt, Italy and Mexico, mixing action with puzzle elements and different mini-games. Odie is often present. He can be chased around, order to help solve a puzzle and he can also be ridden in racing sequences. Garfield gets dressed up as a chef, a cowboy a fakir or a football and has access to certain superpowers. Next to the single-player Adventure mode there is a multiplayer mode where the mini-games are turned into family games for two local players.</p>"},{"name":"Garfield: Saving Arlene","year":2005,"developer":"Eko Software SARL","url":"PS2_COLLECTION_PART10/Garfield%20-%20Saving%20Arlene%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":174184067,"score":"","genres":"Action > 3rd-person (Other) > Puzzle elements > Direct control > Fantasy > Licensed","desc":"<p>Garfield is taking his nap, as usual, when he is awakened by the dog Odie. From the corner of his eye, he gets a glimpse of his pal Arlene, being taken away in a pound car. Despite his natural laziness, he decides to rescue his on-and-off girlfriend, along with Odie. Based on the comics and incorporation the known sense of humour, Garfield and Odie travel through a 3D world solving puzzles that involve doors, keys, but also team-based actions with your partner. Of course there are enemies to defeat, such as bad dogs and evil piranhas.</p><p>Next to the regular moves, Garfield can also gain special powers based on his eating habits: big burger kicks, healing lasagna, etc. You cannot control Odie, who is invincible, directly, unless a second players hops in, but you can give him orders by whistling or kicking him. You can even travel over water by standing on his head. During gameplay, important story elements are told through comic strip-style panels to show you what Garfield cannot see (for instance to show you a switch between a well, or a hidden door). You can then take the appropriate action (it usually involves kicking Odie) to solve these problems.</p>"},{"name":"Garou: Mark of the Wolves","year":2005,"developer":"SNK Corporation"},{"name":"Garou: Mark of the Wolves (Limited Edition)","year":2005,"developer":"SNK Playmore Corporation"},{"name":"Gauntlet: Dark Legacy","year":2001,"developer":"Midway Games West, Inc.","url":"PS2_COLLECTION_PART10/Gauntlet%20-%20Dark%20Legacy%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":662401229,"score":6.7,"genres":"Action > Diagonal-down > Isometric > Arcade > Puzzle elements > RPG elements > Fantasy","desc":"<p>A port of the arcade game, <em>Gauntlet: Dark Legacy</em> is the follow-up to Gauntlet: Legends and another installment in the long-running Gauntlet series of hack-and-slash action games. As with all the <em>Gauntlet</em> games, you play a medieval fantasy character who, along with allies if you have them, fights his or her way through hordes of evil creatures on the never-ending quest for more gold and perhaps even an eventual goal. </p><p>This version contains the characters and levels from <em>Gauntlet: Legends</em>, plus the new characters and levels from the <em>Dark Legacy</em> arcade game, with a few extra levels thrown in.</p><p>There are eight characters to initially choose from: the mighty Warrior, the deadly Valkyrie, the quick-footed Archer, the powerful Wizard, the spellcasting Sorceress, the stalwart Knight, the valiant Dwarf, and the chaotic Jester. Although there are similarities between characters from the two games, each character looks and plays differently. In addition, there are eight alternative-modes for these characters to unlock, plus dozens of secret characters to obtain. With a multi-tap, up to four players can play, with rules governing how much they can hurt each other. Unlike the original Gauntlets, the levels you'll face take place in various terrain from forests to mountains to volcanic plains. Many of the monsters are familiar to old fans of the series, but there is some new blood among the ranks of evil, including some rather large foes. </p><p>Unlike the early Gauntlet arcade games, the camera angle varies from location to location, from bird's eye to nearly ground level. The lands, creatures, and heroes are all rendered in 3D. While the graphics have been upgraded, the gameplay is very similar. You basically run around levels, hacking at what seems like unlimited armies of monsters, searching for gold, keys, and health-giving food...as well as a way out of the level. Bosses and other scripted events slow down the repetitious nature of the originals.</p><p>While levels can be gained and characters saved, <em>Gauntlet: Dark Legacy</em> is an action game with some RPG trappings and should not be confused with the more true types from that genre.</p>"},{"name":"Gauntlet: Seven Sorrows","year":2005,"developer":"Midway Studios - San Diego","url":"PS2_COLLECTION_PART10/Gauntlet%20-%20Seven%20Sorrows%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":967292060,"score":6.2,"genres":"Action > Diagonal-down > Isometric > Arcade > Puzzle elements > Fantasy","desc":"<p>Gauntlet is back for yet another iteration. The Emperor has crucified his four loyal heroes to a magic tree, driven by a maniac thirst for their immortality. Hundreds of years later, as only a ghost, he came to regret all the wrong deeds he has done and frees them, asking them to defeat his six former advisors in an attempt to undo what he has done.</p><p>This version of Gauntlet goes back to the roots: The warrior, valkyrie, elf, and wizard fight their way through hordes of enemies to make their way to the six bosses. The game is mostly a hack'n'slash affair, puzzles are limited to finding keys and pressing buttons that open doors and portals. Every character has a unique set of moves and attacks: The warrior has rather powerful attacks, the valkyrie has quick moves, the elf can shoot powerful arrows, and the wizard has several magical range attacks.</p><p>Defeating enemies gives you experience points that may be used to increase your three stats; some chests in the levels contain better armor or weapons. Also, new moves can be purchased with gold.</p><p>The game can be played both in single-player as well as cooperative multi-player, where up to four players fight together.</p><p>The newest feature of this game (other than the much better graphics) is the online gaming feature. Played online, the game is identical to a regular multiplayer game, with each player on a different box.</p>"},{"name":"Gecko Blaster","year":2007,"developer":"","url":"PS2_COLLECTION_PART10/Gecko%20Blaster%20%28Europe%29.zip","filesize":49835076,"score":"","genres":"Action > Fixed / flip-screen > Arcade > Paddle / Pong > Direct control","desc":"<p>Prepare for cracking 50 levels of arcade mayhem in Gecko Blaster.</p><p>This remake features an animated main character Gecko, many bonuses, and dynamic gameplay.</p><p>Have fun in 50 randomly generated levels spread across 5 unique visual themes.</p>"},{"name":"Gekibo 2","year":2001,"developer":"Irem Software Engineering, Inc."},{"name":"Gene Troopers","year":2006,"developer":"Cauldron Ltd.","url":"PS2_COLLECTION_PART10/Gene%20Troopers%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1279223339,"score":5.3,"genres":"Action > 1st-person > RPG elements > Shooter > Sci-fi / futuristic","desc":"<p>A long war has ended and the Galactic Empire has grown but it isn't stable. Rebel groups still fight the regime but with the invention of genetic transformation, a normal civilian can be transformed into a mindless, easy to command but strong fighting unit. These civilians weren't asked, they were forced to undergo the procedure. You play one of these civilians. First they took your daughter and then they came for you. But before the procedure was completed, you were rescued by the rebels. Now it's your turn to fight back.</p><p><em>Gene Troopers</em> is basically a shooter but it lets you build and upgrade your weapons with stuff you find lying around. You can also extract the genes of an enemy to upgrade your own. With these codes you can choose in which direction you want to go with your character. This means you can either choose to upgrade your stealth abilities or to devote them to becoming a fighter.</p><p>The game takes you to 6 different planets including a jungle world. There are drivable vehicles and team members to help you with your task.</p>"},{"name":"Genji: Dawn of the Samurai","year":2005,"developer":"Game Republic Inc.","url":"sony_playstation2_g/Genji%20-%20Dawn%20of%20the%20Samurai%20%28USA%29.zip","filesize":2363944508,"score":7.4,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Hack and slash > Fantasy > Martial arts","desc":"<p><em>Genji: Dawn of the Samurai</em> is a third-person action role-playing game (RPG) set in medieval Japan around the 12th century. At the time, a clan called the Heishi has conquered most of Japan through supernatural means. These means refer to magical stones called the Amahagane which bring supernatural powers (called the Kamui) to the wearers. The hero of this saga is a young man called Yoshitsune, a samurai who also possesses an Amahagane. The game starts when young Yoshitsune is attacked by the Heishi as they are searching for other Amahagane stones. The fate of the world depends on those who controls these magical stones and at that moment, the Heishi seem invincible as they posses most Amahagane. Later in the story, the player acquire a second hero, the giant warrior monk Benkei, who also owns an Amahagane. The story then revolves around the struggles of these two unlikely heroes against the tyranny of the Heishi clan.</p><p>Gameplay is standard click-and-slash action. The player may either control Yoshitsune or Benkei in alternating turns. The unique side of this game is the use of the Amahagane, enabling the player unleash powerful blows at the enemy, particularly useful against multiple foes. The more powerful the Amahagane, the slower enemies become when the Amahagane is activated. Timing is of the essence as the player must attack at the exact moment indicated by the game or the move will fail.</p>"},{"name":"Genso Suikoden V (Genteiban)","year":2006,"developer":"","url":"sony_playstation2_g/Gensou%20Suikoden%20V%20%28Japan%29%20%28Genteiban%29.zip","filesize":3974829540,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition release includes:</p><ul><li>Genso Suikoden V game</li><li>Soundtrack CD</li><li>Foldable art screen (each side is about A4 size cardboard print)</li><li>Artbook (A4 size, 191 pages)</li></ul><p>Artbook is fully colored and contains:</p><ul><li>Page 004-124: Character Artwork and Data</li><li>Page 126-127: World Map</li><li>Page 128-164: World Art and Data</li><li>Page 165: Flags</li><li>Page 166-167: Ship Art and Data</li><li>Page 168-169: Rune Art</li><li>Page 170-172: Monster Art and Data</li><li>Page 173-176: Story Boards</li><li>Page 178-183: Character Early Design</li><li>Page 184-189: Music Score</li></ul>"},{"name":"George of the Jungle and the Search for the Secret","year":2008,"developer":"Papaya Studio Corporation","url":"sony_playstation2_g/George%20of%20the%20Jungle%20and%20the%20Search%20for%20the%20Secret%20%28USA%29.zip","filesize":215215985,"score":4.5,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Licensed","desc":"<p>Players take the role of George from the popular cartoon show, <em>George of the Jungle</em>, in a 3D side scrolling action-adventure. Players swing, climb, and platform their way through the jungle in search of the missing documents which could hold the key to the \"secret\" medical mystery. The camera views and turns show the 3D view, but essentially the game is played as a 2D platformer with a linear path on a single plane. Often George needs to manipulate objects in the environment, for instance moving boxes to create a platform, to continue.</p>"},{"name":"Germany's Next Topmodel","year":2009,"developer":"Coreplay GmbH","url":"PS2_COLLECTION_PART10/Germany%27s%20Next%20Topmodel%20%28Germany%29.zip","filesize":232275998,"score":"","genres":"Simulation > 3rd-person (Other) > Licensed","desc":"<p><em>Germany's Next Topmodel: Das offizielle Spiel zur Staffel 2009</em> is based on the German reality show <em>Germany's Next Topmodel</em>. The player takes control over one of twelve contestants which all live in a free accessible apartment. Every twenty days they are judged by a jury and the worst one gets eliminated from the show. The judgment is based on three character stats: styling, self confidence and popularity. </p><p>Popularity gets improved by talking with the other contestants. Here the player has to choose between three sentences, two mean and a nice one. Of course just the nice one improves the stat. The styling is divided into clothes, make up and hairstyle. In each one the player receives a reference and needs to shape his model after it. Then this gets judged by the game and it tells one false aspect. Every try costs one day. The last stat, self confidence, gets raised by answering trivia questions about fashion styles and successful photo shoots. These are mini games where the player needs to emulate movements with his input device.</p>"},{"name":"Get on da Mic","year":2004,"developer":"Artificial Mind & Movement","url":"PS2_COLLECTION_PART10/Get%20on%20da%20Mic%20%28Europe%29%20%28En%2CFr%2CIt%29.zip","filesize":1851354573,"score":"","genres":"Simulation > 3rd-person (Other) > Music / rhythm > Voice control","desc":"<p><em>Get On Da Mic</em> is a karaoke game based exclusively on Hip-Hop songs. Players have to sing along with the songs as a version plays sung by an amateur singer and the lyrics scroll along on the screen. The singer's voice is adapted based on the player's timing, pitch is not taken into account. The songs are not sung by the original performers, but re-recorded. Scoring is based on the overall timing of the words. The words do not have to be sung correctly. It also registers when random noises are made as long as the timing is correct. As it mostly consists of rap songs, there is a bar and spacing between the words to provide help with the lyrical flow, along with a moving color highlighting the words. Songs can be sung in three difficulty levels. When performing well, a meter is filled up until the <em>rock the mic</em> sequence is activated, adding snow to the location or money falling from the sky.</p><p>In the main career mode the player has to make his way up to sing in better venues (starting in the bathroom) with eleven in total. Money earned along the way can be spent on items to customize the character or to buy a mansion and decorate it. Other modes are exhibition (sing any song) and practice (similar to exhibition but without scoring). In the freestyle mode players can rap freely over the beats without the regular vocals. There is also a multiplayer freestyle mode where another player uses the controller to judge the freestyle. There are different characters to choose from, each with their own poses and animations.</p><p>The game supports the EyeToy peripheral to replace the graphics with a video image. It supports the microphones bundled with the Karaoke Revolution games and one is bundled with the game. Hand-held Logitech microphones (+ headset) are also available separately.</p><p>The included songs are:* Black Rob - Whoa</p><ul><li>David Banner - Crank It Up</li><li>Digital Underground - The Humpty Dance</li><li>Dizzee Rascal - Fix Up</li><li>DMX - Ruff Ryders' Anthem</li><li>DMX - X Gon' Give It To Ya</li><li>Dr. Dre - Nothing but a G Thang</li><li>Dr. Dre feat. Snoop Dogg &amp; Nate Dogg - The Next Episode</li><li>Dr. Dre - Wit Dre Day</li><li>J-Kwon - Tipsy</li><li>Jay-Z - Beware of the Boyz</li><li>Joe Budden - Pump It Up</li><li>Kanye West - Jesus Walks</li><li>Kanye West - Through the Wire</li><li>Lil' Flip - Game Over</li><li>Lil' Kim feat. Mr Cheeks - The Jump Off</li><li>M.O.P. feat. Busta Rhymes - Ante Up (Remix)</li><li>Missy Elliott - Get Ur Freak On</li><li>Missy Elliott - Pass that Dutch</li><li>Missy Elliott - Work It</li><li>Murphy Lee - What Da Hook Gon Be</li><li>N.W.A - Express Yourself</li><li>Notorious B.I.G. - Hypnotize</li><li>Public Enemy - Don't Believe the Hype</li><li>Salt-N-Pepa - Push It</li><li>Sean Paul - Get Busy</li><li>Sir Mix-A-Lot - Baby Got Back</li><li>Sir Mix-A-Lot - Posse on Broadway</li><li>Snoop Dogg - Beautiful</li><li>Snoop Dogg - Gin and Juice</li><li>T.I. - Rubber Band Man</li><li>Talib Kweli - Get By</li><li>The Black Eyed Peas - Hey Mama</li><li>The Clipse - Ma, I Don't Love Her</li><li>The Sugarhill Gang - Rapper's Delight</li><li>Tupac Shakur - California Love (Remix)</li><li>Tupac Shakur - Still Ballin (Nitty Remix)</li><li>Unknown - Dude</li><li>Ying Yang Twins - Naggin</li></ul>"},{"name":"Getaway, The","year":2002,"developer":"Team SOHO","url":"sony_playstation2_g/Getaway%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v3.00%29.zip","filesize":3414272340,"score":7.3,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control > Automobile > Street racing > Contemporary > Europe > Crime","desc":"<p>Mark Hammond is an ex-gangster who wants to forget his past and live honestly with his wife and little son. Everything goes horribly wrong when London's most vicious criminal, the organized crime boss Charlie Jolson, decides that he needs Mark's services and obtains them in a twisted and cruel way: Mark's wife is murdered, he is framed for this murder, and his child gets kidnapped. </p><p>Jolson makes it clear: unless Mark does what he orders him to do, the boy dies. Using the helpless man in his plan to bring down other criminal organizations of the city, Jolson sends Mark on suicidal missions during which Mark has three terrible choices: walk away and lose his son, get killed in a battle against overwhelming odds, or single-handedly help Jolson to get rid of his adversaries.</p><p>Once the player completes Mark Hammond's story, a new scenario opens, in which the player controls Frank Carter, a vigilante cop who won't stop until he brings Charlie Jolson to justice. Frank's scenario is parallel to Mark's, shedding more light on events that remain somewhat unexplained during Mark's scenario.</p><p><em>The Getaway</em> is a hybrid of driving and third-person shooter gameplay, similar in concept to Grand Theft Auto III. London has been digitally recreated for this game, and the player can explore it freely on foot or driving a vehicle. Unlike <em>GTA III</em>, missions follow each other linearly, dictated by the plot. The game is more story-driven and does not have any free-roaming activities. Many of the driving sequences also have a time limit, restricting free exploration. </p><p>Each mission usually consists of a driving section, which requires the player to drive to a certain destination (sometimes chasing another vehicle or being chased by enemies), and a third-person shooter section, often with an additional driving section afterwards. Police or rival gangs will frequently pursue the protagonist. The player can hijack any car or bus from the streets, or move on foot. </p><p>Third-person shooter sequences are longer and more prominently featured than the corresponding sections of <em>GTA III</em>. The protagonist can perform a variety of moves: sneak, crouch, roll to the sides, etc. A few missions are completely stealth-oriented, and are failed if the player character is discovered by enemies. It is possible to use the butt of the gun as a melee weapon, and also take hostages to prevent the police from shooting at the player character.</p><p>The game's distinguishing visual feature is a total absence of visible interface and text feedback. Rather than consulting a map, the player follows the car's blinking lights to arrive at the right destination. Damage taken by the protagonist is indicated by the character bending over, walking slower, and having blood on his clothes. Health is recovered by resting (leaning against a wall); there are no health kits scattered around. The protagonist can carry only two small or one larger weapon at once.</p>"},{"name":"Getaway, The: Black Monday","year":2004,"developer":"Team SOHO","url":"sony_playstation2_g/Getaway%2C%20The%20-%20Black%20Monday%20%28Europe%29%20%28En%2CPt%2CRu%2CEl%29%20%28v2.00%29.zip","filesize":2139193883,"score":6.7,"genres":"Action > Racing / Driving > Behind view > Shooter > Stealth > Direct control > Automobile > Street racing > Contemporary > Europe > Crime","desc":"<p>It's going to be a day to remember for Sgt Mitchell. His first shift back on the MET's Organised Crime Squad begins with a dawn raid on a council estate that turns nasty. The next 48 hours will put him against the suspicions of his team mates, a new ruthless wave of crime and the most powerful man in London.</p><p>Meanwhile on the other side of the city, amateur boxer Eddie O'Conner is in severe trouble. The bank job went horribly wrong, his small-time crew has been wiped out and his only ally in this whole mess is Sam, a teenage thief more comfortable with nicking laptops than gang violence. Eddie knows he's way out of his depth, now his friends are dead and somebody is going to pay...</p><p>The game is split into sections. Once you complete Sgt Mitchell's part, you get to play as Eddie. You play the same story, but view it from two different angles. Some events that look vague when played from Mitchell's side get explained when controlling Eddie. Some portions of the game are played as Sam, providing yet another piece of the puzzle.</p><p>The gameplay is divided into driving and shooting/sneaking parts. Usually you receive a mission, drive to a certain destination, and then shoot (or sometimes sneak) your way to the goal. London has been digitally recreated for this game, and you can drive through it freely. As Eddie, you'll have to avoid police and rival gangs chasing you. You can hijack cars and even buses. You can also leave a car at any time and run through London on foot. For the shooting parts, there is a variety of moves you can perform: sneaking, hiding, crouching, rolling to the sides, etc. You can knock your enemies down by using your gun's butt as a melee weapon or take pedestrians hostage to prevent the policemen from killing you. Eddie also has unarmed boxing moves to help you fight your way out of trouble, and Sam has the ability to get out of trouble by climbing out of the way, or sneaking under objects to hide.</p>"},{"name":"GetBackers - Dakkan'ya - Ubawareta Mugenjou","year":2002,"developer":"Konami Corporation","url":"sony_playstation2_g/GetBackers%20-%20Dakkan%27ya%20-%20Ubawareta%20Mugenjou%20%28Japan%29.zip","filesize":604179422,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p>The game is based on the manga series <em>Get Backers</em>. You control two characters, Ben and Ginji, who possess special powers that allow them to find and to recover items, valuables, and even people who got lost. Now they are offered a huge sum of money for a recovery job they have to do for a mysterious customer from an even more mysterious Castle of Infinity. </p><p>The gameplay is based on exploration of randomly generated dungeons. You search for items and also trigger important cut scenes by exploring every corner in the dungeons. The action-based combat resembles a fighting game. You can perform a variety of moves, block your opponent's attack, and switch between the characters. Attacks deplete your stamina bar, so continuously using the strongest attacks is not always the best choice. When your stamina bar is full, you can perform powerful combo attacks.</p>"},{"name":"Ghost in the Shell: Stand Alone Complex","year":2004,"developer":"cavia inc.","url":"PS2_COLLECTION_PART10/Ghost%20in%20the%20Shell%20-%20Stand%20Alone%20Complex%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2489668965,"score":7.1,"genres":"Action > Behind view > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Ghost in the Shell: Stand Alone Complex</em> is an action game based on the television series of the same name. The game takes place in the year 2030; you control the cyborgs Motoko Kusunagi and Batou, members of the secret government agency Section 9 with the mission of fighting terrorism and crime. Gameplay is from a 3rd person perspective; you will need to fight, jump and climb your way through twelve missions, with the story unfolding in full motion video between missions and communications received during a mission. There are many different weapons available for use, and after defeating enemies you may be able to pick up extra ammo or weapons; occasionally you will also acquire a hacking key. With this, you will be able to see the location of other enemies in the area onscreen. You will also be able to attempt to hack certain enemies; when attempting to hack, two spinning rings appear on the screen. If you successfully match up the ring patterns, you will be able to control the enemies actions. Computer terminals can also be found in many areas allowing you to hack into enemies. The game can be played on three difficulty levels, and a multiplayer mode is available where up to four players can compete.</p>"},{"name":"Ghost Master: The Gravenville Chronicles","year":2004,"developer":"Spiral House Ltd.","url":"PS2_COLLECTION_PART10/Ghost%20Master%20-%20The%20Gravenville%20Chronicles%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":645622226,"score":6.3,"genres":"Strategy > Diagonal-down > Horror","desc":"<p><em>Ghost Master: The Gravenville Chronicles</em> is the console version of the PC game Ghost Master. In this strategy game, you become the scourge of humanity by managing haunting teams consisting of various ghosts. The levels, usually inspired by famous scenes from horror movies, require you to scare mortals and complete additional objectives such as freeing trapped ghosts. Deployed ghosts need to be bound to certain objects, called fetters, that match their type.</p><p>By scaring humans, you collect plasm, the main resource in the game. Plasm can be used to recruit new ghosts, or expand their abilities. Rather than deploying a massive amount of creatures, the game rewards creative use of limited resources to haunt mortals in original ways. Each human has a believe meter. An important aspect is figuring out each human's weakness. As you exploit this, they become more susceptible to various phenomena and provide more plasm. Along the way, you will meet fierce resistance as ghostbreakers, priests and witches can detect and ban your ghosts.</p><p>The game is not a direct port. Instead, Spiral House was contracted to modify the original codebase by Sick Puppies to make it more user-friendly for the consoles. This includes a complete overhaul of the interface to make commands easier to access, the introduction of battle elements - next to the regular missions - to speed up the game's pace, a more linear game structure, and a redesign of the control over ghosts. They now have less AI and there is more variety in the types, requiring you to tap wisely into the plasm pool to deploy the most adequate ghost for each situation.</p>"},{"name":"Ghost Rider","year":2007,"developer":"Climax Solent","url":"PS2_COLLECTION_PART10/Ghost%20Rider%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2524586745,"score":6,"genres":"Action > 3rd-person (Other) > Hack and slash > Motorcycle > Licensed","desc":"<p><em>Ghost Rider</em> is an action game set after the events of the movie of the same name, which is in turn based on the Marvel Comics character.</p><p>You are Johnny Blaze, who sold his soul to a demon named Mephisto for noble reasons. Now, some rogue demons have escaped from hell and Mephisto needs to to destroy them before they cause him trouble. If you don't, he'll take your girlfriend back to hell with him.</p><p>Ghost Rider attacks with his flaming hellfire chains in a manner similar to God of War. If he uses a variety of moves and avoids being hit, it fills a vengeance bar. The more this meter fills, the more souls he gets from enemies he kills. Souls are used to purchase new moves and extras like additional characters. There are some shielded enemies where you must have a minimum vengeance bar to damage them. There is also a spirit gauge, which is essentially a special meter and is also built up by attacking. It allows the uses of special moves, like your shotgun.</p><p>There are also Hellcycle levels, where you must successfully avoid obstacles while destroying enemies with the bike's hellshots attacks and your chains.</p>"},{"name":"Ghost Vibration","year":2002,"developer":"Artoon Co., Ltd.","url":"PS2_COLLECTION_PART10/Ghost%20Vibration%20%28Europe%29.zip","filesize":919063724,"score":"","genres":"Action > 1st-person > Shooter > Horror","desc":"<p>In this first person shooter on rails you are George, a ghost hunter, accompanied by his childhood friend and scientist Alicia. You have to exterminate the ghosts that inhabit an old mansion using a special weapon called Spirit Gun. After capturing the various spirits you can read their memories and use this information to solve the mysteries of this ancient mansion.</p>"},{"name":"Ghostbusters: The Video Game","year":2009,"developer":"Red Fly Studio, Inc.","url":"PS2_COLLECTION_PART10/Ghostbusters%20-%20The%20Video%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":2337391581,"score":7.1,"genres":"Action > Behind view > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>An official sequel to the two Ghostbusters movies, <em>Ghostbusters: The Video Game</em> puts the player in control of Rookie, the unnamed newest member of the Ghostbusters. Shortly after being hired a mysterious ghostly shock wave flows through New York City, prompting the Ghostbusters to begin an investigation. Over the course of the game they will return to many locations from the movies and meet returning characters as well as some new locations and characters.</p><p>As the Rookie the player must explore levels to find and capture any ghosts while being assisted by fellow Ghostbusters following you. A ghost must first be weakened using any of the proton pack weapon modes it is vulnerable to, then by dragging the stunned ghost to a trap placed by the player or their teammates. Other enemy types must be defeated by first revealing a weak point and then pulling it out with the proton pack's blast stream, or by simply dealing enough damage to the enemy. If the Rookie takes too much damage themselves they will be knocked unconscious, and their allies will attempt to get to them and help them back up. The Rookie can do the same if any of their allies are knocked unconscious, and if all current members of the team are knocked down the game will return to the last checkpoint. Information about enemies and objects in the world can be obtained by scanning them, and concept art for the entries can be added by finding hidden pages in the levels. The Rookie receives upgrades to their proton pack automatically over the course of the game, and by finding enough scanner entries they can increase their health.</p><p>Ghostbusters: The Video Game on the Wii and PS2 shares the same story, level settings, and most of the dialogue of the XBOX360/PS3/Windows version, but it also has several departures. Levels are condensed, redesigned, and occasionally completely removed. The art assets were changed to a cartoon-like style, and some bosses were redesigned as a result. While this version lacks an online mode, the Wii release does allow two players to play through story mode in co-op, something impossible in the high definition version. Finally the player has the option of playing a female Rookie, although this has no impact on the story (and some characters still refer to the Rookie as being male).</p>"},{"name":"Ghosthunter","year":2003,"developer":"SCE Studio Cambridge","url":"PS2_COLLECTION_PART10/Ghosthunter%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":2989373641,"score":7,"genres":"Action > Behind view > Horror","desc":"<p>What started as a simple report of strange lights at an abandoned school has become something much more for rookie cop Lazarus Jones. After unwittingly unleashing hundreds of ghosts from a containment facility, including one that took a liking to Lazarus' partner, it's now his job to travel to the four corners of the earth and recapture them. This is going to be one long night.</p><p>Lazarus starts the game with a pistol, but bullets aren't much use against the incorporeal. Eventually he will find energy weapons that can drain away a ghost's energy, and when a ghost has been sufficiently weakened it can be captured with Lazarus' homing \"Ghost Grenade\". Not all the monsters Lazarus faces are the undead, however, and more solid foes can be dispatched the traditional way: shooting them until they stop moving. Levels are traveled through sequentially and range from flooded bayous to a sunken battleship and abandoned prison island. Sometimes Lazarus will be assisted by a mute ghost named Astral who can reach areas beyond Lazarus and open paths for him. She has to be careful however as she has no way to attack or defend herself.</p>"},{"name":"Giants: Citizen Kabuto","year":2001,"developer":"Planet Moon Studios","url":"PS2_COLLECTION_PART10/Giants%20-%20Citizen%20Kabuto%20%28Europe%29.zip","filesize":735034708,"score":7.9,"genres":"Action > Strategy > 1st-person > Behind view > Real-time > Managerial / business simulation > Real-time strategy > Sci-fi / futuristic > Comedy > Regional differences","desc":"<p>On a far away planet, three races fight for control of the few landmasses available: the marooned Meccs, who specialize in firearms and other things that go boom, the mystical and cold-blooded Reapers, who were the original inhabitants of the planet, but were forced to live in the sea by Kabuto, the third character; a truly gigantic monster with a ravenous appetite and a fondness for performing wrestling maneuvers on those the size of his hand.</p><p>You can control any of these races (although in the single player mode, you have to progress through the storylines of the Meccs and Reapers first) in their bid to be the dominant species. Each species varies in the way they play the game and have vastly different types of attacks available to them.</p><p><em>Giants: Citizen Kabuto</em> is an action/real-time-strategy game that emphasizes action. While there is base-building and resource management for most of the races, it is done through a simple to control interface and one or two keystrokes. The majority of the game is spent in a third person view (first person mode is available) jet-packing/warping/leaping about the 3D landscape. Single player sessions consist of missions with specific goals, such as rescuing Smarties or recovering lost items. Multiplayer options include standard deathmatch, capture the Smartie (flag), the above with basebuilding as an option.</p><p>Other creatures also inhabit the islands. From the meek Smarties (who are employed to build your bases or eaten as a primary source of protein, depending on your species), to the cow-like vimps to the deadly rippers, the fauna of the planet will either try to kill you or avoid being killed/eaten/captured. While not so energetic, the flora of the islands can be crushed, knocked over, or burned in careless combat (or by Kabuto not paying attention). </p><p>Game controls are similar to Shiny's MDK and can best be described as a simplified shooter interface. You can run, jump, turn, shoot, and strafe. Beyond that, a half-dozen keystrokes are all you need to play (and some, like Kabuto's howls, are for fun and show). </p><p>The alien world in the game is bright and presented with vibrant colors. In addition, the game tries to maintain a humorous streak. The single player game has goofy dialogue and a few jokes spread along its story line and even the multiplayer is lighthearted, with Smarties cheering you on as you carry them on your back, among other little sounds and nuances.</p>"},{"name":"Gift","year":2001,"developer":"Eko Software SARL","url":"PS2_COLLECTION_PART10/Gift%20%28Europe%29.zip","filesize":549809981,"score":7.2,"genres":"Action > 3rd-person (Other) > Arcade > Puzzle elements > Shooter","desc":"<p>A group of game developers are deep into the final stages of testing their new game. All of a sudden, their characters revolt and break out of their control, taking on lives and ambitions of their own. A princess character is kidnapped and the only way to save her is to send in heroes from other games. Various warriors and wizards are dispatched to try to save her, but nothing works. As a last resort, Gift, a comical, clumsy, little red alien volunteers and is sent in to save the day.</p><p>The player controls Gift in 3D arcade fashion and must navigate 10 levels and special rooms, picking up numerous items along the way and meeting characters from other games and films. There are the dwarfs from Snow White, a Darth Vader’s light sabre, Indiana Jones’ whip, and a machine gun from Quake, among others, throughout the levels. He’ll leap between moving platforms, avoid death rays, zap enemies, etc. His progress is often impeded by thought-provoking roadblock type puzzles, which require imagination, logic, and a keen sense of humor.</p>"},{"name":"Gift: Prism (Shokai Genteiban)","year":2006,"developer":"","url":"sony_playstation2_g/Gift%20-%20Prism%20%28Japan%29.zip","filesize":3125079345,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition boxed release includes:</p><ul><li>Gift: Prism game</li><li>Audio drama CD</li><li>Illustration card book</li></ul>"},{"name":"GigaWing Generations","year":2005,"developer":"Takumi Corporation","url":"PS2_COLLECTION_PART10/GigaWing%20Generations%20%28Europe%29.zip","filesize":629378152,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Giga Wing Generations</em> is a vertically scrolling shooter and the third game in the Giga Wing series. Players control one of four available ships over the constantly scrolling landscapes and need to earn a high score (and survive!) by shooting the various enemies that appear and dodging numerous bullets and obstacles. The game is a \"bullet hell\" style shooter and there are a significant number of bullets to dodge, sometimes hundreds at a time covering the entire screen. Each of the available ships has three types of attacks. The first is the basic attack. Next is the reflect force; this acts as a temporary shield and any bullets that are encountered are gathered and then fired back at the enemy. The final attack is a bomb and is the most powerful attack affecting everything on the screen. The four ships each have different attack abilities and flight characteristics. As is typical in arcade style shooters, weapon upgrades can be acquired to increase your firepower.</p>"},{"name":"Girl Zone","year":2005,"developer":"Mere Mortals Ltd.","url":"sony_playstation2_g/Girl%20Zone%20%28Europe%2C%20Australia%29.zip","filesize":171329700,"score":"","genres":"Adventure > Compilation > 3rd-person (Other) > 2D scrolling > Fixed / flip-screen > Meditative / Zen > Hidden object > Mini-games > Direct control","desc":"<p>In the distant future, two girls become bored and decide to travel between planets in search of adventure to cure them of one of the galaxies worst enemies - boredom.</p><p>Game play consists of ten basic mini games themed around things which may interest young girls, such as playing dress up, collecting animals, setting up on the beach for a day of relaxation and even a side scroller avoding nasty animals while collecting points. As mentioned on the back cover completing all mini games will unlock a mystery 11th mini game.</p>"},{"name":"Girls Bravo: Romance 15's (DX Pack)","year":2005,"developer":"","url":"sony_playstation2_g/Girls%20Bravo%20-%20Romance%2015%27s%20%28Japan%29%20%28DX%20Pack%29.zip","filesize":1121695612,"score":"","genres":"Special edition > Physical extras","desc":"<p>This Deluxe Pack release includes:</p><ul><li>Girls Bravo: Romance 15's game</li><li>Audio drama CD</li><li>Bathing powder</li><li>Make-up soap</li><li>Hand towel cloth</li></ul>"},{"name":"Gitaroo Man","year":2002,"developer":"iNiS corporation","url":"PS2_COLLECTION_PART10/Gitaroo%20Man%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":3279988145,"score":8.2,"genres":"Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p>In this strange music rhythm game, you play Gitaroo-Man as you go against various music themed villains.  The game puts a new twist on music games as you not only have to time button presses but you have to move the analog stick around in a radar circle to follow a line that passes through the center point.  You can play up to 4 players using the multitap and choose from a variety of characters, songs, and locales.</p>"},{"name":"Gladiator: Road to Freedom Remix","year":2005,"developer":"Goshow Inc.","url":"sony_playstation2_g/Gladiator%20-%20Road%20to%20Freedom%20-%20Remix%20%28Japan%29.zip","filesize":561737436,"score":"","genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Fighting","desc":"<p>An updated Japan only release of Colosseum: Road to Freedom. Changes include the additions of new weapons, armor and skills, two new background origins (Germania and Parthia), weapons are now usable with the Striker style, and equipment can now be upgraded from materials acquired after winning a match. Also, the Arena mode adds two more gladiator types plus the New Game+ mode lets players go through the main campaign again now with the option to select body types from characters in the game.</p>"},{"name":"Gladiator: Sword of Vengeance","year":2003,"developer":"Acclaim Studios Manchester","url":"PS2_COLLECTION_PART10/Gladiator%20-%20Sword%20of%20Vengeance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3144537712,"score":6.8,"genres":"Action > 3rd-person (Other) > Platform > Fantasy > Regional differences","desc":"<p><em>Gladiator: Sword of Vengeance</em> is an action game that takes place in the times of the Roman empire. You take control of Invictus Thrax, a Roman slave, who ascended through the ranks to become champion of all gladiators. Favored by the emperor, Invictus was to be granted his freedom. Mysteriously though, the emperor was killed and replaced by a crazy man named Arruntius. Arruntius, so full of himself, has decided to destroy Rome and replace it with a city named Arruntium. As the game begins, an epic event is staged with Invictus as the gladiator. Invictus fights bravely, but he is killed by an unknown and possibly un-human creature. In the afterlife, Invictus meets the sons of Jupiter. They inform him of how Arruntius' power came from help of the gods of terror. They charge him with the task of eliminating Arruntius and restoring Rome to glory.</p><p><em>Gladiator</em> is essentially an 3d action/combat game which features hand to hand combat with weapons, combos and magic. The action also includes maneuvering around, from gliding down ropes to jumping traps. Challenges are scattered around the game world, which when defeated, unlock magical powers granted by the gods, such as Pluto's power, which raises spirits from the dead to help you in battle. A unique feature of the game is the execution maneuver. Upon the near death of certain enemies, you can execute this maneuver which will result in a cinematic random brutal execution by Thrax.</p><p>The game's graphics try to recreate the atmosphere of gladiator films such as <em>Spartacus</em>. A wide range of characters are featured from opposing gladiators to mythical enemies like cyclopes, demons. and skeleton warriors. Audio features include a blend of soft and hectic tunes, and voice over acting.</p>"},{"name":"Gladius","year":2003,"developer":"LucasArts","url":"PS2_COLLECTION_PART10/Gladius%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":1719985595,"score":7.5,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Turn-based > Fantasy","desc":"<p>Gladius is a turn-based gladiatorial RPG. Players try to build a championship gladiator school by gaining experience through fighting battles in the arenas and recruiting new members.</p><p>From the manual: \"The story of Gladius starts just as two schools begin the pursuit of the Championship. It follows the epic saga of two young heroes: Ursula, daughter of the barbarian king from the land of Nordagh; and Valens, the son of Imperia's greatest gladiator. Become one of these characters and embark upon a spectacular and brutal journey to fulfill their destinies to keep the world from heading into another disastrous war.\"</p>"},{"name":"Glass Rose","year":2003,"developer":"Capcom Production Studio 3","url":"PS2_COLLECTION_PART10/Glass%20Rose%20%28Europe%29.zip","filesize":2689583675,"score":5.8,"genres":"Adventure > 3rd-person (Other) > Quick Time Events (QTEs) > Fantasy > Interwar > Detective / mystery","desc":"<p>Cast in the role of Takashi Kagetani, a reporter for the Tonichi Times, you get interested in a case offered by Emi Katagiri. Reading Takashi's article entitled \"unsolved serial killer cases\", she notices a familiar killer case she recognized from her grandfather's notebook. She asks Takashi for help and the two of them get involved in the case of the \"Cinema Mansion Serial Murder\" that happened over seventy years ago.</p><p>One day, the two of them together enter the old mansion in search of some clues and get pulled back in time, Emi spiritually lost with a broken heart and Takashi cast in a role of the first victim's prodigal son, Kazuya Nanase.</p><p>Thus the plot starts to unveil as you race against time while trying to figure out who is the mysterious killer, how are the victims selected, and why did you never find out anything on this mysterious Kazuya Nanase character that apparently was a witness to all the killings.</p><p>The story stretches across three-day time and is entirely fitted inside the Yoshinodou's mansion. The will of master Yoshinodou stated that all his children be called to the mansion and spend three days together before reading it. The three days that may prove fatal for whoever is in the mansion at the time. But due to awaiting the final hour, you will uncover lots of hidden secrets of this mansion, its history, and the background story of its inhabitants.</p>"},{"name":"Global Defence Force","year":2005,"developer":"Sandlot","url":"PS2_COLLECTION_PART10/Global%20Defence%20Force%20%28Europe%29.zip","filesize":451909839,"score":"","genres":"Action > 3rd-person (Other) > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>The second game in the <em>The Chikyuu Boueigun series</em>, renamed <em>Global Defence Force</em> for its English release (similarly the first game was renamed <em>Monster Attack</em> for its English release).</p><p>It's been two years since the invading alien menace was defeated by the Global Defence Force (the game renames the \"Earth Defence Force\" from the previous game), but like any good off-world threat, they're back for more, and they've brought new weapons and technology in their attempts to take Earth and eliminate humanity. Thankfully, the GDF has also been developing new technology to fight them.</p><p><em>Global Defence</em> Force is a third-person action shooter. Choose from either an GDF infantryman or the flight-capable Pale Wing, each with different abilities and dozens of weapons each, and set out to shoot down hordes of giant insects, enormous robots, and UFOs of incredible scale. You can choose two weapons to carry for each mission, and pickups dropped by enemies will unlock new weapons and increase your character's maximum health. You can play the game split-screen cooperatively.</p><p>Beyond adding a second player class to choose from; the Pale Wing; a fragile but powerful melee centric character with a limited Jetpack and her own weapon set, to go alongside the infantry man of the first game, Global Defence Force doesn't change much of the basic game play of Monster Attack. But leaving at that would undersell the game; there are numerous new alien types, weapons and environments that add much more variety to things. The maps are larger and more detailed and missions are longer and much more scripted (where as the original game nearly always threw you into an environment against some preplaced bug's, this time you often have some simple objective(s)) to add further variety. Finally the physics have been notably enhanced.</p><p>Like Monster Attack, the player in Global Defence Force fights completely by themselves despite being part of an army (unless playing offline only 2 player split screen); the original Japanese version features radio chatter from other GDF squads and your commanding officer, to give the illusion that you are fighting alongside others. This was cut from the English release.</p>"},{"name":"Global Defence Force: Tactics","year":2006,"developer":"thinkArts Co.,Ltd.","url":"PS2_COLLECTION_PART10/Global%20Defence%20Force%20Tactics%20%28Europe%29.zip","filesize":363922025,"score":"","genres":"Strategy > Diagonal-down > Turn-based > Turn-based strategy > Sci-fi / futuristic","desc":"<p>Lead an elite GDF unit to overcome the aggressive alien invasion. This time, the NTZ adventure goes way beyond cities like Tokyo and London...it goes all the way down to the subterranean nests of these foul creatures.</p><p>Manoeuvre the ground troops, armed with heavy weaponry, and the \"Pale Wing\" air unit to fight through battles scenes that will have your pulse pounding.</p>"},{"name":"Go Go Golf","year":2000,"developer":"Magical Company Ltd.","url":"PS2_COLLECTION_PART10/Go%20Go%20Golf%20%28Europe%29.zip","filesize":436738611,"score":"","genres":"Sports > 3rd-person (Other) > Golf","desc":"<p><em>Go Go Golf</em> is a player golfing game for one to four, where there's only one human player the game provides the opposition.</p><p>The player(s) play as one of eight predefined golfing characters, each with their own strengths, on three golf courses which can be played in three ways:</p><p>Stroke Play: here the match is played over eighteen holes and the player who completes the round in the fewest strokes wins</p><p>Match Play: where it is the player who wins the most holes who takes the match, here if a player is, say, five holes ahead with just four remaining they are declared the winner</p><p>Tour: Here the objective is to win more than $1.5m in one season. In order to achieve this the player must win a qualifying match in May so that they can compete in a major tournament. There are four major golfing tournaments in Japan in June and July, two nationals the All Japan Masters and the Asian Open, and two internationals the International World Classic and the World Classic. By winning the nationals the player can progress to the internationals and the big prize money. Games can only be saved during a tour</p><p>The game has an unusual, one button, style of gameplay. Cross is used to initiate a stroke. As the player shapes up to take their swing a shadowy outline appears behind them and the player must press Cross again at, or near to the top of the swing, the game does not allow Cross to be used beyond the top of the swing. On the downswing the player must press Cross again at the point of impact. With each press during the back and down strokes the player sees a message ranging from \"Too Fast\"; \"A Bit Too Fast\", \"Correct\", \"Perfect\"; Amazing Skill\", through to \"Too Slow\" and others. <br>Club selection is automatic and the player cannot make their own shots, with most approach strokes the player has a choice of three shots to play and on the green there is only one shot option.</p><p>There is no course or hole flyby in this game, no gimme's, no mulligan's, and no character creation. Neither the eight players nor the three courses are based on anyone or anywhere in real life. In-game the player can view the ground ahead before they play their shot but all camera viewpoints are automatic.<br>All matches are played over eighteen holes, none of that 'front nine', 'back nine' rubbish here.</p>"},{"name":"Go Kart Rally","year":2008,"developer":"","url":"PS2_COLLECTION_PART10/Go%20Kart%20Rally%20%28Europe%29.zip","filesize":68853356,"score":"","genres":"Racing / Driving > Behind view > Track racing","desc":"<p>Battle your way to the top of the rankings and become the champion of the Go-Karting circuits!</p><p>Go Kart Rally puts you in the driving seat against some fiendishly competitive opponents on circuit after circuit of neck-and-neck, bumper-to-bumper, fast and furious karting.</p><p>Choose from a exhaustive line-up of karts and battle it out in Tournament mode, get that all-important practice in Quick Race mode or go all out for the killer records in the Time Trials.</p><p>Have you got what it takes to make it to the top?</p>"},{"name":"Go, Diego, Go!: Great Dinosaur Rescue","year":2008,"developer":"High Voltage Software, Inc."},{"name":"Go, Diego, Go!: Safari Rescue","year":2008,"developer":"High Voltage Software, Inc.","url":"PS2_COLLECTION_PART10/Go%20Diego%20Go%21%20Safari%20Rescue%20%28Europe%29%20%28En%2CFr%2CNl%29.zip","filesize":1627623499,"score":"","genres":"Adventure > Educational > Side view > 2D scrolling > Africa > Licensed","desc":"<p>Go Wild On An African Safari Rescue!</p><p>Travel through time with Diego and Baby Jaguar to help Maia the Maiasaura find her way back to her family in this amazing rescue adventure. You’ll have to climb rock walls, travel along monkey bars, solve puzzles and even jump on a pogo stick to help Diego’s friend find her way home on this prehistoric journey.</p><p>* Over 12 Wii Remote motions including: climbing, flapping, pulling and stomping<br>* Authentic character voice of Diego and other characters from the Go, Diego, Go! TV show<br>* Grown-ups can join in using the Dinosaur Guide Helper Feature and a second controller<br>* Explore 5 levels and search your way through Cretaceous Jungle and Volcano Cliffs to find your way to Egg Island<br>* Kid-Tested approval by children and moms for age-appropriateness, fun-factor and quality</p>"},{"name":"Goblin Commander: Unleash the Horde","year":2003,"developer":"Jaleco Entertainment, Inc.","url":"PS2_COLLECTION_PART10/Goblin%20Commander%20-%20Unleash%20the%20Horde%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":490906079,"score":6.9,"genres":"Strategy > Diagonal-down > Real-time > Fantasy","desc":"<p>Goblin Commander: Unleash the Horde is a fast-paced action style real-time strategy game set in the fantasy goblin world of Ogriss.  In it, the player will have the ability to control up to 3 unique clans of ten goblins at one time and use them to wage war in 4 unique and highly destructible environments. Each clan can be controlled either by placing waypoints with the cursor or by taking direct control of them, giving the player the ability to put themselves right in the middle of the action.  Apart from goblins, each clan also has its own unique Turret and Titan that is associated with it: Turrets are defensive structures that can be placed in the world to ward off enemies while Titan’s are huge monstrosities that can be used to wreak havoc upon their enemies. Boasting 17 missions in the single-player campaign as well as 12 split-screen multi-player maps per console, Goblin Commander: Unleash the Horde brings RTS to a whole new generation of console fanatics.</p>"},{"name":"God Hand","year":2006,"developer":"Clover Studio Co., Ltd.","url":"PS2_COLLECTION_PART10/God%20Hand%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1682368820,"score":7.3,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Quick Time Events (QTEs) > RPG elements > Fantasy > Western > Regional differences","desc":"<p>When assaulted by a gang of vicious thugs, a shady drifter named Gene gets his right arm cut off. When he comes to, he finds himself with a young girl at his side, and his right arm reattached. But this is no longer an ordinary arm: it's been replaced with the legendary 'God Hand', and now that he's got it, Gene's on the hunt by every demon in the county, as they all want their hands on his. And with four powerful figures planning the demise of the world, things are probably gonna get ugly.</p><p><em>God Hand</em> is a Western-style 3D beat-em-up where the protagonist punches enemies repeatedly with an incredibly powerful fist. The player can completely customize their attacks to their liking, as well as earning new ones. It is possible to set up a combo for four presses of the square button (choosing each attack for each press), or select more powerful special attacks and juggles. Dodging enemy attacks can be performed by moving the analog stick in the corresponding direction. Sometimes, stunning an enemy will cause a \"press this button\" icon to appear on-screen (similarly to God of War); if the player performs well at this bonus prompt, Gene will deal some extra damage to the enemy.</p><p>Once Gene has wailed on enemies enough with his regular fists, his 'Tension Gauge' will become full and the player can then press a special button to use the God Hand itself. This will make Gene completely invincible, more powerful and sped-up for a brief time. The player also has the option to use 'Roulette Moves', which use a special attack depending on the one selected.</p><p>The game also features a casino where the player can gamble using the slots, video poker, or blackjack. Cash earned at the Casino can be used to purchase all sorts of moves for Gene as well as other power-ups.</p>"},{"name":"God of War","year":2005,"developer":"SCE Studio Santa Monica","url":"PS2_COLLECTION_PART10/God%20of%20War%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6846462299,"score":8.7,"genres":"Action > 3rd-person (Other) > Cinematic camera > Hack and slash > Puzzle elements > Quick Time Events (QTEs) > Direct control > Classical antiquity > Fantasy > Regional differences","desc":"<p><em>God of War</em> is set in the age of ancient Greek myths. The hero of the game is a mortal warrior Kratos. Long time ago, Kratos was the leader of Spartans, a fearless and brutal general who waged wars for the glory of his city. Today, he is known as the Ghost of Sparta. For the past ten years, he is tormented with terrible nightmares, unable to forget the tragedy that happened in his past. He has to serve the gods of Olympus, who promised to forgive his sins if he becomes their champion. Finally, the goddess Athene tells Kratos that redemption will be granted to him if he defeats her brother, the god of war Ares, who was the very reason for the tragic event of his past...</p><p><em>God of War</em> is a 3D action game with platforming and puzzle-solving elements. Kratos has two default swords that he will always carry with him, called the Blades of Chaos. They allow the player to perform combos, which will constantly climb until the fight is over or until it takes too long to register another hit. The higher the combo total, the more red orbs Kratos receives from defeated enemies.</p><p>Similar to Devil May Cry, the red orbs collected from fallen enemies can be used to purchase upgrades. It is possible to upgrade the default weapons, learning new moves and striking faster, or put the orbs into different weapons acquired throughout the game, such as Blade of Artemis. Kratos will, over time, also have access to a selection of magic spells. At specific points in the game, he will be able to generate an arc of electricity, courtesy of Zeus, or use the decapitated head of a Gorgon to turn enemies into stone with Meduza's Gaze.</p><p>The game features several unlockable extras, which are only acquired when the player has beaten the game on different difficulty modes. Most of the features are a behind-the-scenes look at various aspects of the game, such as creating the world, modeling Kratos, and a look at deleted levels that didn't make the final cut of the game.</p>"},{"name":"God of War II","year":2007,"developer":"SCE Studio Santa Monica","url":"PS2_COLLECTION_PART10/God%20of%20War%20II%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CRu%29.zip","filesize":6850572654,"score":8.9,"genres":"Action > Behind view > Hack and slash > Puzzle elements > Quick Time Events (QTEs) > Classical antiquity > Fantasy > Adult","desc":"<p>The brutal warrior Kratos returns as the new vengeful God of War. The second chapter of the series focuses once more on a tale of revenge. Having defeated Ares and now a god himself, Kratos proves to be a more vicious and power-hungry god than Ares ever was. Eventually he finds himself betrayed, with his godly powers and abilities removed from him. Kratos sets upon another epic quest to find the Sisters of Fate and do what no mortal or god has ever done: change his destiny and reclaim his power.</p><p>Like its predecessor, <em>God of War II</em> is an action game with platforming and puzzle-solving elements. Still utilizing the Blades of Chaos, Kratos must rip apart his enemies and and other gods, heroes, and monsters from the Greek myths that stands in his way to revenge and power. As before, the higher the combo achieved from killing an enemy, the more red orbs will be awarded to Kratos for upgrades. Kratos has a selection of spells which utilize the blue orbs. Some are familiar from the previous game, while others are new to the sequel and its storyline.</p><p>In addition to the action and light puzzle-solving, Kratos takes to the sky in the sequel with some rail-based flying levels on the back of either a Pegasus or gryphon. He also learns several new abilities for combat as well as for solving the puzzles in the game, such as for example the ability to slow down time.</p><p>Included with the game is a second disc that has such bonus features as deleted levels, the voices of <em>God of War II</em>, the musical score, and a documentary about bringing the game to life.</p>"},{"name":"God of War II (Special Edition)","year":2007,"developer":""},{"name":"Godai: Elemental Force","year":2002,"developer":"The 3DO Company","url":"PS2_COLLECTION_PART10/Godai%20-%20Elemental%20Force%20%28Europe%29.zip","filesize":303174371,"score":4.7,"genres":"Action > 3rd-person (Other) > Fantasy","desc":"<p>Hiro was orphaned shortly after being born; his parents the king and queen killed by the evil Element Master Akunin. Now fully grown, Hiro sets out to best the four element trials and become an Element Master himself, while Akunin waits for the chance to finish what he started years ago. The elemental trial of Earth is the first Hiro must complete, but after that the three remaining trials, as well as the stages leading up to them, may be attempted in any order. On his quest Hiro will find many weapons of different classes, such a short swords and spears. These weapons will become damaged over time and eventually break, but they can be repaired with an item Hiro can find. After having completed an elemental trial Hiro gains the ability to cast magic of that element, increasing his effectiveness against enemies weak to that element.</p><p>In multiplayer mode two players can face off against each other in deathmatch arenas with special rules, such as tag, survival, and time attack.</p>"},{"name":"Godfather (Limited Edition), The","year":2006,"developer":"","url":"sony_playstation2_g/Godfather%2C%20The%20-%20The%20Game%20%28USA%29%20%28Limited%20Edition%29.zip","filesize":2704388538,"score":"","genres":"Special edition > Physical extras","desc":"<p>In this Limited Edition of The Godfather you get the regular game with an additional bonus DVD that includes:</p><ul><li>Concept art</li><li>Special packaging</li><li>Making-of footage and interviews.</li><li>Documentary feature exploring the cultural impact of <em>The Godfather</em> film.</li><li>In-depth video walkthroughs of game strategy.</li><li>Behind-the-scenes videos with actors James Caan and Robert Duvall who also voiced some characters.</li></ul>"},{"name":"Godfather, The: The Game","year":2006,"developer":"Electronic Arts Redwood Shores Studio","url":"PS2_COLLECTION_PART10/Godfather%2C%20The%20%28Europe%29%20%28En%2CNl%2CPt%2CSv%2CDa%2CPl%29.zip","filesize":2515251980,"score":7.2,"genres":"Action > Racing / Driving > Behind view > Crime > Licensed","desc":"<p>Set in post-WWII New York City, <em>The Godfather: The Game</em> follows the player-created character's rise through a crime syndicate based on the book and film franchises. Combining events from the movie with side-story missions, the player must earn respect by completing missions in territories controlled by New York's five crime families.</p><p>Largely open-ended, the game's story is driven by a series of missions where the player can use violence, intimidation, or diplomacy to affect the outcome and influence future events and other character's reactions. A third-person action game, <em>The Godfather: The Game</em> features a punching mechanism to brutally assert yourself, a car theft and driving engine, and a shooting system which allows for locational damage.</p><p>The game features a persistent offline world populated with locations from the franchise and characters who are often voiced by the actors who portrayed them onscreen.</p>"},{"name":"Godzilla: Save the Earth","year":2004,"developer":"Pipeworks Software, Inc.","url":"PS2_COLLECTION_PART10/Godzilla%20-%20Save%20the%20Earth%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":591380808,"score":6.8,"genres":"Sports > Fighting > Basketball > Bowling > Wrestling > Sci-fi / futuristic > Licensed","desc":"<p>Godzilla, a gigantic creature from underneath the sea, has been both the bane and the savior of Earth. Godzilla's power is so feared that scientists have begun experimenting on it's DNA and creating artificial G-Cells of the monster's power. A group of aliens, named the Vortek decide to invade the Earth to take away G-Cells created using Godzilla's DNA. They do this by controlling various other gigantic monsters, who will battle amongst themselves. Only a monster with free-will would be able to destroy the Vortek's army and drive away the Vortek.</p><p><em>Godzilla: Save the Earth</em> is a 3-D Fighting game, somewhat of a sequel to Godzilla: Destroy All Monsters Melee. Players choose from among 18 monsters, previously seen in Godzilla movies, with which to engage in battle and destruction. The roster includes: Godzilla (1990's version &amp; 2000's version), Mecha-Godzilla (version 2 &amp; version 3), Spacegodzilla, Anguirus, Destoroyah, Gigan, Moguera, Jet Jaguar, Baragon, Rodan, Megalon, Megaguirus, Mothra (in larval &amp; adult forms), Orga, King Ghidorah and Mecha-King Ghidorah. Each monster comes with a variety of punches, kicks, grabs, throws, blocks and ranged attacks. In addition, each monster has a variety of unique moves activated by combinations of buttons. Many monsters can even fly. Power-Ups can be found that restore health, restore energy, activate Rage mode and target the enemy for Air Strikes.</p><p>There are a variety of game modes: Action, Versus, Survival, Challenges and Melee. During Action mode it's one monster against a number of monsters in 1vs1 combat, the number of monsters to be fought dependant on the difficulty settings. Action mode also features mini-challenges such as Bowling, Demolition, Osaka crunch, Rail Shooter, Vorillium Basket Ball, Mother Ship, Protect the Tower, Destroy the City (percentage), Destroy the City (point value), Attack the Navy and more. Many of these are unlocked in the Challenges mode after encountering them. Success in the Action mode (or by picking up G-cells) awards the player with points to unlock Gallery Photos, Arenas and new characters. Versus mode is the multiplayer version of Save the Earth. Survival Mode. Melee mode also feature multiplayer and is a 4-person free-for-all of monster mayhem in a small, contained arena.</p>"},{"name":"Godzilla: Unleashed","year":2007,"developer":"Pipeworks Software, Inc.","url":"PS2_COLLECTION_PART10/Godzilla%20-%20Unleashed%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":819761363,"score":4.6,"genres":"Action > 3rd-person (Other) > Side view > Fighting > Sci-fi / futuristic > Licensed","desc":"<p>Godzilla: Unleashed is a fighting game featuring 23 of the classic Toho monsters from the past, including some brand new ones and the games namesake as well, Godzilla.  Players will fight against each other in eight destructible cities, letting the player destroy everything from skyscrapers to small buildings and pick up power-ups from causing the destruction.</p><p>The storyline is different from others, a non-linear one which constantly changes depending upon the decisions the player makes before, during and after battles.  The Wii's gameplay uses the Wii Remote and Nunchuk and can support up to four-players, while the PS2 version only features two player simultaneous play.</p>"},{"name":"Goemon: Bōken Jidai Katsugeki","year":2000,"developer":"Konami Computer Entertainment Kobe, Inc."},{"name":"Gokujо̄ Seitokai","year":2005,"developer":"KID Corp.","url":"sony_playstation2_g/Gokujou%20Seitokai%20%28Japan%29.zip","filesize":2166509475,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Mini-games > Point and select > Romance > Licensed","desc":"<p><em>Gokujou Seitokai</em> is a dating simulation visual novel, based on manga and anime with the same title. The story takes place at Miyagami Private Academy and has romantic theme, unlike the anime which only focused on girl protagonists in the academy. While the visual novel gameplay is similar to any other such game, on-screen characters show subtitles in a bubble during dialogues which adds a feel of a comic book. On the map screen player can select various places to visit which display a specific girl that the player can meet at a specific place. Aside from visual novel main gameplay, the game features several card-based mini-games The game features full voice acting for the heroines, as well as many romantic options and outcomes. Clearing the game unlocks CG gallery, music gallery and bonus video clips. Launch release came with a bonus audio CD which included an audio drama and a soundtrack on the same disc.</p>"},{"name":"Gokuraku Jong Premium","year":2003,"developer":"Enterbrain, Inc.","url":"sony_playstation2_g/Gokuraku-jong%20Premium%20%28Japan%29.zip","filesize":313960994,"score":"","genres":"Gambling > Puzzle > Side view > Real-time > Arcade > Cards / tiles > Falling block puzzle > Tile matching puzzle","desc":"<p><em>Gokuraku Jongg Premium</em> is an enhanced port of the mahjong puzzle game Gokuraku Jongg which includes several new modes. Time Attack mode gives the player a 3-minute time limit to earn the highest score possible, Mission 16 mode gives the player 16 different mahjong hands to complete in a single play, and Yakuman Attack mode asks the player to get as many Yakuman (the highest-scoring Mahjong hands) as possible in a single game. It also adds in a new collectibles system, along with a handful of other tweaks.</p>"},{"name":"Golden Age of Racing","year":2005,"developer":"Brain in a Jar Ltd.","url":"PS2_COLLECTION_PART10/Golden%20Age%20of%20Racing%20%28Europe%29.zip","filesize":77509885,"score":"","genres":"Racing / Driving > 1st-person > Behind view","desc":"<p><em>Golden Age of Racing</em> is a one or two player game based on the racing cars of the 1960's. The two player game uses a split screen display</p><p>The game has ten courses, three levels of difficulty and five cars which can be played in Time Challenge, Exhibition and Championship modes. There are multiple liveries for each car but only one is immediately available, the rest have to be unlocked by winning races.<br>There are four championships to compete in:* The Club Championship - five races each of five laps on the club circuits</p><ul><li>The GP Championship - five races each of five laps on the Grand Prix circuits</li><li>The World Championship - ten races each of ten laps, one race on each of the five club circuits and one race on each of the five GP circuits</li><li>The Endurance Championship - one race of thirty laps on the Montessa GP circuitInitially only the Club Championship is available, the other championships are unlocked by completing the one before</li></ul>"},{"name":"Golden Compass, The","year":2007,"developer":"Shiny Entertainment, Inc.","url":"PS2_COLLECTION_PART10/Golden%20Compass%2C%20The%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2870400841,"score":5.2,"genres":"Action > 3rd-person (Other) > Puzzle elements > Fantasy > Steampunk > Licensed","desc":"<p><em>The Golden Compass</em> is an adaptation of the 2007 movie of the same, which in turn is based on the novel <em>Northern Lights</em>, the first in the <em>His Dark Materials</em> trilogy by British novelist Philip Pullman.</p><p>The game is set in a fantastical parallel universe where the soul of person resides out of the body and lives in the form of animals known as dæmons. The main character is Lyra Belacqua. Her best friend Roger is kidnapped by evil Gobblers and her uncle Lord Asriel is imprisoned when he discovers evidence that proves the existence of Dust particles, much to the dismay of the Magisterial representatives who rule the world as a dogmatic theocracy and do not allow people to contradict their doctrine. Lyra has to leave the safe haven that is Jordan College in Oxford to right the situation.</p><p>In typical 3rd-person action gameplay, Lyra needs to navigate the different environments. She excels at moving around with acrobatic actions and when enemies appear she relies on her wit, hiding behind objects or searching an escape route. When she is spotted, she can use one of the four collectibles to escape from a tricky situation. Health is represented as \"courage\" and a large extent of courage helps solving the puzzles. She can also play a Deception mini-game to outwit characters and gain additional courage.</p><p>Two other characters provide assistance her during her quest. The first is Pan, Lyra's dæmon and the manifestation of her spirit. Pan can transform into up to four different forms, gradually discovered during the quest. The basic Ermine form allows Pan to chew through ropes and reveals the areas where Lyra needs to solve puzzles or move around. The Sloth form introduces swinging to grab hold of branches or reach areas hard to access. The third form, Hawk, lets Lyra glide from great heights. She can also send out Pan in this form to retrieve objects at difficult locations. The final Wildcat form has Lyra slide down from special surfaces, climb nets and it provides a dash move to evade enemies.</p><p>Brute strength is represented by the second support character Iorek Byrnison, an armoured bear known as <em>panserbjørne</em>. He has most of the physical attacks. Next to health (replenished by bloodmoss) he has an armour gauge, filled up by gathering sky armour. Collected rage orbs fill up a rage meter, which introduces a special attack when maxed out. Pan is always by Lyra's side, while Iorek joins the party later in the game and he is not always present.</p><p>Lyra's journal stores her tasks, information about key locations and a section for the Alethiometer, the golden compass. It is a device that reveals the answer to any question when operated by a trained user. It contains four needles - three to construct a question and fourth for the answer. To ask questions and solve puzzles, Lyra needs to play the Divining game. It consists of three sessions where Lyra needs to match symbols to keep the focus (a circle of light) centred on the device, by pressing a key or button to spin a hand in a timely fashion. The meaning of the different symbols is revealed during the course of the game, by interacting with objects and characters. Conversations often introduce mini-games to keep the talking going.</p><p>Each of the characters can pick up objects that grant new abilities such as new forms, a slow spell, double damage or more insight into the workings of the Alethiometer.</p>"},{"name":"GoldenEye: Rogue Agent","year":2004,"developer":"Electronic Arts Los Angeles","url":"PS2_COLLECTION_PART10/GoldenEye%20-%20Rogue%20Agent%20%28Europe%29%20%28En%2CIt%2CNl%2CSv%29.zip","filesize":3693447996,"score":6.3,"genres":"Action > 1st-person > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>After being fired from MI6 for your ruthless behavior in an MI-6 simulator, you begin to work for Auric Goldfinger doing evil deeds.  After the first mission (Which is the simulator) you are assigned a Goldeneye by Francisco Scaramanga who acts as the villain’s version of 'Q'.  Your Goldeneye can do four separate things which are to see through cover, toss enemies around, use a shield, and hack into computers.  The levels in this FPS are all basic run-and-gun style.</p>"},{"name":"Goosebumps HorrorLand","year":2008,"developer":"Gusto Games Ltd.","url":"sony_playstation2_g/Goosebumps%20HorrorLand%20%28USA%29.zip","filesize":278360895,"score":"","genres":"Action > Diagonal-down > Mini-games > Horror > Licensed","desc":"<p>Goosebumps HorrorLand is an adventure game set in a fright-themed amusement park filled with over thirty thrilling rides and bone-chilling attractions. Sounds like fun--until you discover the scares are all too real and find yourself vanquishing vampires, hanging on for life on the Roller Ghoster and battling Certain Death. As you fiendishly try to escape the park, you will unravel a mystery, encounter a host of creepy horrors, monsters and mummies plus trademark Goosebumps twists and cliffhangers. Goosebumps HorrorLand offers suspense, tension, humor, and pulse-pounding action.</p><p>* five terror inducing and unique park areas<br>* play in story mode or arcade mode<br>* 30 bone chilling rides and attractions<br>* multi-player features<br>* collectible monster cards</p>"},{"name":"Gradius III and IV","year":2000,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"PS2_COLLECTION_PART10/Gradius%20III%20and%20IV%20%28Europe%29.zip","filesize":431956592,"score":6.3,"genres":"Action > Compilation > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>This is a compilation containing two side scrolling shooters from Konami:</p><ul><li>Gradius III</li><li>Gradius IV</li></ul><p>Both games are straight emulation of their arcade counterparts, though some additional features are also included (adjustable difficulty and speed, a stage select option, and some extra game modes). Also, a new 3D introduction movie was created to introduce the games.</p>"},{"name":"Gradius V","year":2004,"developer":"Treasure Co., Ltd.","url":"PS2_COLLECTION_PART10/Gradius%20V%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":545599340,"score":8.2,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Long ago, the Gradius army destroyed an evil life form that was threatening the galaxy. But somehow some of the Bacterian cells survived, and a new army has appeared ready to take over the galaxy! The Gradius forces have developed a super spatial-temporal fighter (called the Vic Viper) which you must pilot in order to destroy all of the enemies. The gameplay in <em>Gradius V</em> is an arcade style shooter and is very similar to the other games in the series. You need to guide the Vic Viper through a series of side scrolling screens and destroy the many enemies that appear (including several very large bosses). Although you begin the game with very limited firepower, additional weapons can be acquired. After destroying certain enemies, a power up capsule is left behind; collecting these will advance the weapon selector. When the weapon you want is selected after collecting enough capsules, you can activate it to equip the Vic Viper with that weapon. Your choices are speed up, missiles, double fire, lasers, multiples (these circle the Vic Viper providing additional firepower), and force fields. As you progress through the game, short animated cut scenes will reveal the story, and the enemies become tougher and more numerous. The game is somewhat customizable, allowing you to set the controls, difficulty level, and number of lives you begin with.</p>"},{"name":"Graffiti Kingdom","year":2004,"developer":"Taito Corporation","url":"PS2_COLLECTION_PART10/Graffiti%20Kingdom%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2568200364,"score":6.8,"genres":"Action > Role-playing (RPG) > 3rd-person (Other)","desc":"<p>Prince Pixel is in a pickle. His parents have been kidnapped by an evil demon, called... Demon!Pixel has to rely on the power of Graffiti and his pet dog Pastel to release his parents from peril.The story follows Pixel around 22 levels in which he does various tasks with the help of creatures made with his magic wand.</p><p>The gameplay is that of a basic action RPG where one battles monsters, jumps on platforms and gains stuff which will help them advance through the game.</p><p>The power of Graffiti enables the Prince to animate anything. Anything at all. With Graffiti, the player can make their own monsters which are theirs to control. For example, if they make a monster with huge feet, that monster will be able to jump high, whereas if they make one with huge spiked arms, it will probably pack quite a punch. </p><p>Monster construction is very free, and that means the player can draw anything, and \"make them alive\". Players can draw different parts of a monster, attach them to each other as they please, add a few accessories, paint the parts, and define which part is a hand, leg or an attacking device. Only the player's imagination is the limit.</p>"},{"name":"Gran Turismo 3: A-spec","year":2001,"developer":"Polyphony Digital Inc.","url":"sony_playstation2_g/Gran%20Turismo%203%20-%20A-Spec%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v2.00%29.zip","filesize":3341393504,"score":8.3,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Street racing > Track racing","desc":"<p>This is the third game in the Gran Turismo series of racing games.</p><p>The game is now an even more realistic driving experience with lighting now having an effect on the game, such as buildings blocking the sunlight. There are smoke effects caused by skidding and even heat rising from the road.</p>"},{"name":"Gran Turismo 4","year":2004,"developer":"Polyphony Digital Inc.","url":"PS2_COLLECTION_PART10/Gran%20Turismo%204%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5085799322,"score":8.4,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Street racing > Track racing > Vehicle simulator","desc":"<p>Gran Turismo is back and there is a huge variety of cars, including the Model T Ford, Jay Leno's Tank Car, and some of the famous Le Mans cars from down the years. GT4 has brand new tracks, including the famous Nürburgring, and tracks set in famous locations such as Paris, the Grand Canyon, and many more.There is a new Photo mode in GT4 where you can take photographs of a saved replays or in photo mode, and save them to your memory card, or a USB storage device. There is also a new B-Spec mode where become race manager, in other words you let the computer do the work, so it's useful if your doing a endurance race.</p>"},{"name":"Gran Turismo 4: \"Prologue\"","year":2003,"developer":"Polyphony Digital Inc.","url":"PS2_COLLECTION_PART10/Gran%20Turismo%204%20-%20Prologue%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2975535557,"score":7.2,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Gran Turismo 4: Prologue</em> is a lite version of the later released game Gran Turismo 4. In reality, this game, although a full game in its own right, is really nothing more than a extended demo of what to expect in the final release of <em>Gran Turismo 4</em>.</p><p>The game features two modes: </p><ul><li><strong>Arcade</strong>: there are five brand new tracks to sample, four tarmac, and one rally course. The player may either choose to race against opponents or the clock in this mode;</li><li><strong>School Mode</strong>: is where the game is at. This is where players can accumulate new cars by completing the task. School Mode is simply the License Mode from the previous games. This mode involves the user having to complete either a number of laps, or a segment or track within a certain time limit. The player is then graded as Gold, Silver, and Bronze of Fail.</li></ul>"},{"name":"Gran Turismo Concept: 2001 Tokyo","year":2002,"developer":"Polyphony Digital Inc.","url":"sony_playstation2_g/Gran%20Turismo%20Concept%20-%202001%20Tokyo%20%28Japan%2C%20Asia%29.zip","filesize":3485938442,"score":"","genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator","desc":"<p>\"Gran Turismo Concept: 2001 Tokyo\" is a standalone release that features 51 cars, some of which are not seen in the previous versions of Gran Turismo. New, Race, Dirt, \"Dream\" and Concept vehicles populate the list of available cars in this release.</p><p>Course License, Single Race, 2-player and i.Link Battle modes are available.  Additionally, an \"Ace\" difficulty is unlockable once the Normal and Professional races are cleared.</p><p>Four special bonuses are included once certain challenges are cleared. The bonuses are:</p><ol><li>Gran Turismo 3 A-Spec European Opening Movie</li><li>Gran Turismo Concept: Tokyo 2001 Ending Movie</li><li>1,000,000 CR Gran Turismo 3 A-Spec Memory Card Data (appendable to your Japanese GT3 A-Spec Save Data)</li><li>Toyota Pod &amp; Pod Special Course Challenge</li></ol>"},{"name":"Gran Turismo Concept: 2002 Tokyo-Geneva","year":2002,"developer":"Polyphony Digital Inc.","url":"sony_playstation2_g/Gran%20Turismo%20Concept%20-%202002%20Tokyo-Geneva%20%28Asia%29%20%28En%2CZh%29%20%28SCPS-55902%29.zip","filesize":8038490056,"score":7.4,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Some of the worlds best car manufactures join forces with Polyphony Digital and Sony to develop Gran Turismo Concept.</p><p>Over 100 cars to choose from, including concept cars designed by the likes of Honda, Toyota, Suzuki and Mitsubishi, fantasy cars by Sony and other car designers, updated models to existing Gran Turismo car selections (i.e. body kits and engine improvements) and much more. Some won't even see the light of day in the real world. </p><p>5 tracks, 4 previously seen in Gran Turismo 3 plus 1 enhanced track Gran Turismo 2 to this semi-expansion game, are available to race across with up to 6 cars at once. Meanwhile, to make the playing experience easy to get into, only the basic options are included, those being single player and multiplayer arcade mode. 6 players, using the iLink technology, can join in on a race.</p>"},{"name":"Grand Prix Challenge","year":2002,"developer":"Infogrames Melbourne House Pty Ltd.","url":"PS2_COLLECTION_PART10/Grand%20Prix%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1424608265,"score":7.6,"genres":"Racing / Driving > Simulation > 1st-person > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Grand Prix Challenge is an F1 racing game, officially licensed by Formula One Administration Limited. The game features all the 22 drivers, 11 cars and 17 circuits from the 2002 F1 season.</p><p>There are 4 levels of AI (the hardest one needs to be unlocked) and 3 skill levels. In Expert mode you have the choice of Automatic or Manual gears, and can even adjust the Traction Control settings while racing.</p><p>As well as time trials, single races and the full championship, you can take on the <em>Grand Prix Challenge</em> - A series of themed mini-championships designed to take you from a beginner to an expert racer, slowly introducing various aspects of the game such as damage, tire wear, fuel, pitstops, weather, etc.</p><p>Other features are: variable weather (it can rain in the middle of a race), fuel usage, tire wear, interactive pitstops, car setup and split-screen multiplayer.</p>"},{"name":"Grand Theft Auto III","year":2001,"developer":"DMA Design Limited","url":"sony_playstation2_g/Grand%20Theft%20Auto%20III%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v1.60%29.zip","filesize":1485664058,"score":8,"genres":"Action > Racing / Driving > Behind view > Sandbox / open world > Shooter > Direct control > Automobile > Street racing > Contemporary > Crime > Regional differences","desc":"<p>After leaving San Andreas and going on a crime spree throughout the country, Claude Speed and Catalina head to Liberty City for a life of crime. During a bank heist, Claude is betrayed by Catalina and her Colombian friend Miguel, and he is shot by her just as they are leaving the scene of the crime. Claude fully recovers....in a prison cell. However, while being transported to a prison, Colombians ambush the prison van for an inmate riding with Claude. Claude and his friend, 8-Ball, escape in the process. Now it is time for revenge. Claude slowly rises through the ranks of the local gangs, gaining trust from local mob bosses and turning on others. Claude gains influence, trust, and most importantly, money along the way. It is time for Claude to rise from the dead and get revenge for what Catalina has done.</p><p><em>Grand Theft Auto III</em> is similar in its concept to its predecessors: the player is cast in the role of a vicious (albeit novice) criminal, who performs tasks for crime lords and gradually raises his rank in the criminal world. Driving is the main gameplay element in the game, though the player can also fully explore the city on foot. For the first time in the series, the entire game is rendered in 3D. Different camera angles are available for driving, and free camera rotation is available when on foot. </p><p>As opposed to the previous games, Liberty City is the only city the player can explore in the game. The game puts more emphasis on the story, displaying cutscenes before each mission. In order to complete the game, it is necessary to perform all the main story missions; however, the player often has the choice between several missions at a given moment. The missions include chases, races, short third-person shooter sequences, as well as various mini-game-like activities. Outside of the missions, the player is free to explore the city and undertake sub-missions, for example working as a taxi driver, delivering sick people to the hospital in an ambulance car, etc.</p>"},{"name":"Grand Theft Auto: Liberty City Stories","year":2006,"developer":"Rockstar Leeds Ltd.","url":"PS2_COLLECTION_PART10/Grand%20Theft%20Auto%20-%20Liberty%20City%20Stories%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1131341675,"score":8.3,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control > Automobile > Street racing > Contemporary > Crime > Regional differences","desc":"<p>This is the next installation of the Grand Theft Auto series, now back in Liberty City, just like GTA 3.</p><p>This time, the action takes place in 1998, and you're in the footsteps of Toni Cipriani. As usual in the series, you start off pretty low and work your way up in the food chain of the mob, fighting wars with other mafia families and doing all other sorts of dirty work.</p><p>The game is part of the Grand Theft Auto universe, so there you'll occasionally encounter characters you met in previous games of the series, although the storyline is pretty independent and makes few references to previous incidents and events.</p><p>All the other well-known elements of earlier games are in: You can have little side-missions as a pizza delivery boy, vigilante, cab driver, and more.</p><p>The PSP version supports multiplayer gameplay. Up to six gangsters can compete in deathmatches, capture the flag, and king of the hill.</p>"},{"name":"Grand Theft Auto: San Andreas","year":2004,"developer":"Rockstar Games, Inc.","url":"PS2_COLLECTION_PART10/Grand%20Theft%20Auto%20-%20San%20Andreas%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v2.01%29.zip","filesize":3118017460,"score":8.3,"genres":"Racing / Driving > Behind view > Quick Time Events (QTEs) > Shooter > Direct control > Contemporary > Crime","desc":"<p>The events of the game take place in the early 1990s. The player takes control of Carl Johnson (C.J.), who had moved to Liberty City in order to distance himself from his past as a member of a gang in his home city, San Andreas. But the past catches up with him in a way he had not imagined: he finds out that his mother was killed by a rival gang. He goes back to San Andreas to attend her funeral. Realizing how corrupted local police is, seeing how his relatives and friends need him, determined to avenge his mother's death, C. J. has no other choice but to revert to his old ways.</p><p><em>Grand Theft Auto: San Andreas</em> is the fifth game in the <em>GTA</em> series. The basic premise remains the same: roam the \"sandbox\" environments, hijack cars, and complete missions to advance the story. The game's world is significantly larger than in its two immediate predecessors, encompassing three cities and a vast countryside between them, with smaller towns, mountains, rivers, and other places of interest. The interactivity with the environment is enhanced since the player character can now swim and dive, being able to access every corner of the game world.</p><p>The missions vary in structure and gameplay, including chases, races, longer and more intense third-person shooter sequences, as well as a wide variety of vehicles to navigate, which range from different new types of cars (such as lowriders), bicycles, motorcycles, to boats, helicopters, planes, trains, and exotic devices such as monster trucks and jetpacks. Some of the missions involve recruiting gang members and attacking turfs belonging to rival gangs.</p><p>As in the previous games, there are many activities to perform outside of the missions. Working as a taxi driver, taking part in races, delivering sick people to the hospital, etc., return from the preceding games in the series. <em>San Andreas</em> adds many new activities of its own, some of them with a role-playing flavor. C.J. can go to the gym and work out, increasing his stamina. From time to time he has to eat - though overeating will make him look fatter. He is also able to have romantic relationships with certain female characters, asking them out for dinner, giving them presents, etc.</p>"},{"name":"Grand Theft Auto: San Andreas - Special Edition","year":2005,"developer":""},{"name":"Grand Theft Auto: The Trilogy","year":2006,"developer":""},{"name":"Grand Theft Auto: Vice City","year":2002,"developer":"Rockstar North Ltd.","url":"PS2_COLLECTION_PART10/Grand%20Theft%20Auto%20-%20Vice%20City%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v3.00%29.zip","filesize":2846756518,"score":8.4,"genres":"Action > Racing / Driving > Behind view > Sandbox / open world > Shooter > Direct control > Automobile > Street racing > Contemporary > Crime > Regional differences","desc":"<p>Tommy Vercetti is a gangster who just got off a fifteen-year prison sentence for not squealing on his friends. Because he didn't rat out his \"family\", Tommy's sent to work with Sonny Forelli, his old boss. Sonny gives him an easy drug job, but everything goes wrong, and Tommy loses everything. Upon returning to Sonny, he gets mad and wants his money back. Unfortunately, everybody in Vice City, from gangsters and Cubans to bikers and politicians are in his way, and it's up to Tommy to clear a path.</p><p><em>Grand Theft Auto: Vice City</em> offers the same free-roaming driving and action gameplay style as its predecessor, but in a new setting based on the city of Miami. The game includes all the features of the previous installment and builds upon them. There are new cars in the game, reminiscent of typical vehicles from the 1980s. Some cars are earlier models of the vehicles from <em>GTA III</em>. A few missions also involve the protagonist navigating a boat.</p><p>New to this installment is the ability to drive motorcycles. Tommy can drive a variety of two-wheeled vehicles, from huge Harley-esque bikes to dirt bikes to a standard motorcycle. Flying is also a bigger part of the game, as the player can fly small planes and helicopters, traveling from area to area, landing on helipads on top of towering skyscrapers.</p><p>Firearms are for the most part the same as in <em>GTA III</em>, and melee weapons have been added to the protagonist's arsenal. Tommy can use riot batons, crowbars, and a few others. Activities outside of the missions (driving taxis, delivering sick people to hospitals, firefighting, and playing a vigilante policeman) are available as well.</p><p>To effectively capture the mood of the 1980s, the soundtrack has been altered to fit the time period. Players will listen to an estimated nine hours of music (nearly three times the amount featured in the previous game) across ten radio stations. The eclectic mix features such noteworthy titles as <em>I Ran</em> by Flock of Seagulls, <em>The Message</em> by Grandmaster Flash, <em>You've Got Another Thing Coming</em> by Judas Priest, and <em>Out of Touch</em> by Hall &amp; Oates.</p>"},{"name":"Grand Theft Auto: Vice City Stories","year":2007,"developer":"Rockstar North Ltd.","url":"PS2_COLLECTION_PART10/Grand%20Theft%20Auto%20-%20Vice%20City%20Stories%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1338368419,"score":8,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control > Automobile > Street racing > Contemporary > Crime > Regional differences","desc":"<p><em>Vice City Stories</em> is a prequel to Grand Theft Auto: Vice City (2 years earlier) and it is the sequel to Grand Theft Auto: Liberty City Stories. Set in 1984, players take on the role of Vic Vance, an army soldier who loves his country, family, and himself. One bad decision turns everything around and he is kicked onto the streets of a tough city. He has to build an empire to survive, or be left to die. Together with his brother Lance, a drug addict, the siblings try to take over Vice City.</p><p>Just like other GTA titles, gameplay consists of third-person shooting and driving sequences in an open environment. You will meet new enemies and gangs, and old foes. The missions require you to kill with a selection of weapons, steal vehicles such as a car, a boat, or a plane, rob to make it big, or just to have fun. New features for the portable version include swimming, and side missions such as Air Rescue, Vigilante, Firefighter, and Paramedic.</p><p>Similar to San Andreas' gang wars, this title has an Empire mode. To make money, you have to take over businesses from other gangs. By attacking and damaging rival businesses, it will be put up for sale, for you to take over. With a new building constructed, you can then choose an activity such as prostitution, drugs, protection racket, smuggling, robbery, or work as a loan shark. These activities earn money and the location in the city influences the revenue.</p><p>Multiplayer is available over Wi-Fi with ten different game modes, either focusing on fighting (Vice City Survivor), businesses (Empire Takedown), racing (Street Rage), stealing/selling (Grand Theft Auto), capture the flag game types, or games centered around a single vehicle such as a tank.</p>"},{"name":"Grandia II","year":2002,"developer":"Game Arts Co., Ltd.","url":"PS2_COLLECTION_PART10/Grandia%20II%20%28Europe%29.zip","filesize":1039231905,"score":7.7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy > Steampunk","desc":"<p>Long ago, the battle of light and darkness was held, pitting the god Granas against the demon Valmar. Though scars of the battle still mark the land, time has passed and the people of the world have built new civilizations and kingdoms to colonize the planet. The \"Day of Darkness\" will someday occur, heralding the resurrection of Valmar.</p><p>Ryudo is a \"GeoHound\", a mercenary available for hire, usually for slaying monsters and recovering goods. Working with a talking bird named Skye, who sites on Ryudo's shoulder, they will \"do anything\" if the price is right. One day Ryudo receives a job from a branch of the Church of Granas, they ask Ryudo to become a bodyguard for a young priestess named Elena during a prayer ceremony. During the ceremony, strange events occur requiring Ryudo to escort Elena on a journey towards the </p><p><em>Grandia 2</em> is a 3D RPG, viewed from a top-down perspective for most of the game and a 3rd person view during battle. Controlling Ryudo, the player will explore various locations, locating townspeople and objects within an area to interact with. Towns and dungeons are displayed in the same manner, though dungeons tend to be mazes filled with monsters and towns tend to be friendly areas filled instead with conversation and shops. Any monsters present in these areas will be shown walking around. Walking over to and touching the monster in any way will activate a battle. If the monster notices the player approaching it is considered a normal battle, if Ryudo is able to approach undetected the player's party will gain the initiative in battle, if any party member besides Ryudo is approached by the enemy then the party loses initiative.</p><p>In battle, each character is able to choose from a list of actions that include \"attack combos\" (standard attack command), Special Abilities/Magic, \"Critical Strike\", Guard, Evade and Escape. Critical Strikes are weaker versions of attack combos with the advantage that they can block an enemy's action. This partly depends on the positions of the character on the action bar, displayed at the bottom of the screen, which shows each character's (and enemy's) time to act within the battle. Some magic spells and special abilities are also able to block enemy actions, though they take longer to perform than normal attacks. Both combo attacks and critical attacks require the attacker to run up to the enemy in order to perform the action. This depends heavily on the character's individual movement as well as other characters acting as obstacles on the screen. Successfully defeating enemies in battle awards experience points, power points, magic points, gold, and items.</p>"},{"name":"Grandia III (Disc 1)","year":2005,"developer":"Game Arts Co., Ltd.","url":"sony_playstation2_g/Grandia%20III%20%28USA%29%20%28Disc%201%29.zip","filesize":4047984125,"score":7.2,"genres":"Role-playing (RPG) > 3rd-person (Other) > Turn-based > Fantasy > Steampunk","desc":"<p>In <em>Grandia III</em>, you play Yuki, a young boy who has a passion for constructing and piloting airplanes. Finally he manages to build a model that is powerful enough to take him away from the secluded island he lives on with his mother. Unfortunately, the mother won't let him go away so easily, and her weight makes the airplane crash... That would have been half the trouble if Yuki hadn't also encountered a young girl named Alfina, who has mysterious powers and needs his protection. The adventure Yuki has always dreamed of begins.</p><p><em>Grandia III</em> is not connected to its predecessors story-wise, but it utilizes a nearly identical combat system. Once again, there is an IP gauge in battles which allows you to time your attacks precisely and to cancel enemies' moves upon exact execution. The skill books and the mana eggs from the previous game return, allowing you to customize your characters.</p>"},{"name":"Grandia III (Disc 2)","year":2005,"developer":"Game Arts Co., Ltd.","url":"sony_playstation2_g/Grandia%20III%20%28USA%29%20%28Disc%202%29.zip","filesize":3804092890,"score":7.2,"genres":"Role-playing (RPG) > 3rd-person (Other) > Turn-based > Fantasy > Steampunk","desc":"<p>In <em>Grandia III</em>, you play Yuki, a young boy who has a passion for constructing and piloting airplanes. Finally he manages to build a model that is powerful enough to take him away from the secluded island he lives on with his mother. Unfortunately, the mother won't let him go away so easily, and her weight makes the airplane crash... That would have been half the trouble if Yuki hadn't also encountered a young girl named Alfina, who has mysterious powers and needs his protection. The adventure Yuki has always dreamed of begins.</p><p><em>Grandia III</em> is not connected to its predecessors story-wise, but it utilizes a nearly identical combat system. Once again, there is an IP gauge in battles which allows you to time your attacks precisely and to cancel enemies' moves upon exact execution. The skill books and the mana eggs from the previous game return, allowing you to customize your characters.</p>"},{"name":"Grandia Xtreme","year":2002,"developer":"Game Arts Co., Ltd.","url":"sony_playstation2_g/Grandia%20Xtreme%20%28USA%29.zip","filesize":1594707025,"score":6.8,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Fantasy > Sci-fi / futuristic > Steampunk","desc":"<p>The Spirits, who once protected the world, have gone loose. Running around wildly, they created monsters who disturbed the peace in the world and provoked two mighty nations to start an all-destroying war. After years of battles and pain, the two nations finally decided to sign a peace agreement. Now they wish concentrate together on hunting down and eliminating the insane Spirits. You control a young boy named Evan, who wants to become a Ranger (a fighter who possesses unique abilities), like his father. But before he can be initiated as a Ranger, he has to fulfill an important mission and help to save his world from the Spirits.</p><p><em>Grandia Xtreme</em> is the first <em>Grandia</em> game to be originally released for Playstation 2. Its combat system is virtually the same as in the previous two games, a mixture of strategic planning and combo attacks. Your party members can run around, avoid enemy attacks, and their attack power depends on their distance from the enemies. <em>Grandia Xtreme</em> is heavily based on combat, with more dungeons, more fighting, and less story than the two previous installments of the series.</p>"},{"name":"Grandia Xtreme (Limited Box)","year":2002,"developer":"","url":"sony_playstation2_g/Grandia%20Xtreme%20%28Japan%29%20%28Limited%20Box%29.zip","filesize":1629052416,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition release includes:</p><ul><li>Grandia Xtreme game</li><li>Pocket watch</li><li>Cloth pendant</li></ul>"},{"name":"Gravity Games Bike: Street - Vert - Dirt","year":2002,"developer":"Midway Home Entertainment, Inc.","url":"PS2_COLLECTION_PART11/Gravity%20Games%20Bike%20-%20Street.%20Vert.%20Dirt.%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2731681439,"score":4.9,"genres":"Sports > Behind view > Real-time > Tricks / stunts > Direct control > Bike / bicycling > Licensed","desc":"<p>AIR ON THE SIDE OF INSANITY<br><br>* Exclusive Gravity Games™ License<br>* 21 characters to choose from including edgy fantasy riders and 7 top pros!<br>* 10 HUGE freestyle environments<br>* 5 insane game modes<br>* Get mad air with more than 1,500 mind-blowing tricks<br>* Killer music from Disturbed, Sevendust, 311, Adema, Sugar Ray and more!<br>* Get up close and personal with the pro riders in behind-the-scenes DVD footage. Plus, DVD Extras!</p>"},{"name":"Great British Football Quiz, The","year":2005,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART11/Great%20British%20Football%20Quiz%2C%20The%20%28Europe%29.zip","filesize":25712221,"score":"","genres":"Sports > Board game > Football (European) / Soccer","desc":"<p><em>The Great British Football Quiz</em> is a football trivia game for up to four players. It contains four different game modes:* Top of the League</p><ul><li>Play or Pass</li><li>Shootout</li><li>Football Crazy</li></ul><p>The game includes thousands of questions spanning both world cup, international, European and domestic competitions. For each question the player gets four alternatives to choose from. Top of the League consists of three rounds of eight questions and the player with most points at the end of round three wins. With use of jokers the player can remove two wrong alternatives. Play or Pass also consists of three rounds of eight questions and players play together. Jokers are not available in this mode. In Shootout jokers are used to force the other player to answer. Football Crazy is played over three rounds consisting of one round of each of the other game modes. All modes can be played by up to four players but only the Top of the League mode can be played by one player.</p>"},{"name":"Great Escape, The","year":2003,"developer":"Pivotal Games Ltd.","url":"PS2_COLLECTION_PART11/Great%20Escape%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2075419302,"score":5.8,"genres":"Action > 1st-person > 3rd-person (Other) > Behind view > Cinematic camera > Rail shooter > Shooter > Direct control > Flight / aviation > Motorcycle > Vehicle simulator > Vehicular combat > Europe > Historical events > World War II > War > Licensed","desc":"<p>In this game you play the role of an American fighter pilot who is captured by the Germans during the second World War. The game is based on the film of the same name which was also based on true events. Your character is a computer generated version of Steve McQueen as are all the other actors for their characters.</p><p>The game play involves sneaking about the prison camp and interacting with other prisoners to obtain various items to aid you in your escape. The physics are identical to Conflict: Desert Storm. The game play shifts to all-out combat as well as the infamous motorbike chase.</p>"},{"name":"Green Green: Kanenone Dynamic","year":2003,"developer":"WellMADE","url":"sony_playstation2_g/Green%20Green%20-%20Kane%20no%20Ne%20-%20Dynamic%20%28Japan%29.zip","filesize":1979173763,"score":"","genres":"Special edition > Physical extras","desc":"<p>This special release includes:</p><ul><li>Green Green: Kanenone Dynamic game</li><li>Audio drama CD</li><li>Kanenone academy emblem embroidery</li></ul>"},{"name":"Green Green: Kanenone Romantic","year":2003,"developer":"WellMADE","url":"sony_playstation2_g/Green%20Green%20-%20Kane%20no%20Ne%20-%20Romantic%20%28Japan%29.zip","filesize":1984450788,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Romance > Licensed","desc":"<p>Originally released for PC (Windows) as an adult visual novel known as Green Green, the PlayStation 2 port of the game was split into two games, one sub-titled <i>Dynamic</i> and one <i>Romantic</i>, each focusing on a different aspect of the story. The PS2 version has removed adult content, but features new CG events, new heroines, and new song. This <i>Kanenone Romantic</i> (鐘の音 ロマンティック) game focuses on romantic part of the story which takes place at the Kanenone campus, an isolated boarding school in Japan's countryside. The school is entirely comprised of male students, and the protagonist, as well as his friends, are questioning their daily life without a presence of other girls to interact with. That changes when a bus full of girls arrives at the campus one day.</p>"},{"name":"Greg Hastings' Tournament Paintball Max'd","year":2006,"developer":"WXP, Inc.","url":"sony_playstation2_g/Greg%20Hastings%27%20Tournament%20Paintball%20Max%27d%20%28USA%29.zip","filesize":946106129,"score":7.3,"genres":"Sports > 1st-person > 3rd-person (Other) > Shooter > Paintball > Licensed","desc":"<p>Greg Hastings returns in a second paintball game. Play with your friends on the same console (2 player split-screen on the PS2, 4 player on the Xbox) or with more players using the Network Adaptor on the PS2, or through System Link or Xbox Live on the Xbox. You have the options to set your teammates' starting positions, moves and targets, and use voice commands to control your teammates in the heat of the action. You will have the chance to lead your team of rookies all the way through the pro circuit and into the national championships.</p><p><em>MAX’D</em> includes online features such as Xbox Live Multiplayer, Xbox Live Tournaments and Scoreboards (Xbox only). This title also includes 29 tournaments and 213 different field layouts. You can design your own custom fields with the included editor and share them over Xbox Live! (Field sharing is Xbox only.) Your character is completely customizable with new licensed markers, clothes and accessories. The soundtrack includes music by B-Real, DJ Lethal and many more.</p>"},{"name":"Gregory Horror Show","year":2003,"developer":"Capcom Production Studio 3","url":"sony_playstation2_g/Gregory%20Horror%20Show%20-%20Soul%20Collector%20%28Japan%29.zip","filesize":1429069008,"score":7.4,"genres":"Adventure > 3rd-person (Other) > Anime / Manga > Puzzle elements > Horror > Licensed","desc":"<p>Escape Gregory's mansion before he steals your soul in this anime-based adventure from Capcom.</p><p>You have to run around a spooky hotel collecting all the Lost Souls. However, the guests have stolen the souls and aren't going to give them back willingly. To steal those souls back, you've gotta have cunning. Peek through keyholes and listen to the guests' insane mumblings. Find out their weak point and then use it against them to win the soul. Once you steal a soul off a guest, that guest will chase you. If he/she catches you, you will be put through a \"horror show\" where the guest tortures you and makes it look like a show!</p>"},{"name":"Gretzky NHL 06","year":2005,"developer":"Page 44 Studios, LLC","url":"sony_playstation2_g/Gretzky%20NHL%2006%20%28USA%29.zip","filesize":3129326451,"score":6.7,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p><em>Gretzky NHL 06</em> is another in the long line of hockey games and a line of Gretzky licensed games, this one featuring the obligatory roster updates and games modes, exhibition, season mode and a new feature called \"99 mode\". In \"99 mode\" the player can sign Wayne Gretzky as a free agent for any team they play for, filling up a meter during the game, once it is full they can activate \"99 mode\" and bring Gretzky into the game.</p><p>Players competing against each other can both activate Gretzky if they \"99\" meter is full. The action is more fast paced, arcade-styled gameplay as to the traditional simulation games on the market. There is also on-line capabilities where players can compete against each other and view each others stats. Not only does the game contain license's for Gretzky, the NHL, and the NHLPA, but also the AHL as well including it's top players.The games are also called by color commentators Mike Emrick and Darren Pang.</p>"},{"name":"Gretzky NHL 2005","year":2004,"developer":"989 Studios","url":"sony_playstation2_g/Gretzky%20NHL%202005%20%28USA%29.zip","filesize":3244655369,"score":"","genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>Skate Gretzky Style! - Pursue the Stanley Cup™ or the World Cup of Hockey Championship as The Great One from his playing days in the NHL and Team Canada.</p>"},{"name":"Grim Adventures of Billy & Mandy, The","year":2006,"developer":"High Voltage Software, Inc.","url":"sony_playstation2_g/Grim%20Adventures%20of%20Billy%20%26%20Mandy%2C%20The%20%28USA%29.zip","filesize":452332817,"score":6.3,"genres":"Action > 3rd-person (Other) > 2D scrolling > Direct control > Fantasy > Comedy > Horror > Licensed","desc":"<p>Based after the Cartoon Network series of the same name, Grim Adventures (for consoles) plays very much like an arena fighter based on <em>Power Stone</em>. </p><p>Regarding the plot - one day, Grim's Mojo Balls are unleashed into Endsville, giving all the residents supernatural rage. This leads into mass fighting and mayhem, and it is up to Grim, Billy, Mandy, and Irwin to figure out who unleashed the balls.</p><p>Each character has special abilities and moves, as well as weapons to utilize. Each character also has a Mojo meter, which is a power bar. If filled once, it can be used to deal heavy damage, and if filled twice, it can be used to knock out all players. </p><p>The game spans across several levels that are destructible and feature roughly most of the major characters from Grim Adventures, and have various single-player and multiplayer modes.</p>"},{"name":"GRiMgRiMoiRe","year":2007,"developer":"Nippon Ichi Software, Inc.","url":"PS2_COLLECTION_PART11/GrimGrimoire%20%28Europe%29%20%28En%2CJa%29.zip","filesize":470419208,"score":7.8,"genres":"Strategy > 3rd-person (Other) > Side view > Anime / Manga > Fantasy","desc":"<p>This game has both the slick, cutesy, story-heavy style that Nippon Ichi has come to be known for as well as moderately deep real-time strategy gameplay.</p><p>In <em>GrimGrimoire</em>, the player character is a young magician who has just arrived at her new spellcasting academy only to be the only one to escape its destruction. She travels back in time to relive the past few days and find a way to prevent it. In the lengthy RTS levels, she leads an army of magical beings, each having one of four types which are arranged in a rock-paper-scissors-style system of strengths and weaknesses.</p>"},{"name":"GrooveRider: Slot Car Thunder","year":2003,"developer":"King of the Jungle Ltd.","url":"sony_playstation2_g/Grooverider%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":163150186,"score":5.9,"genres":"Action > Racing / Driving > 1st-person > Behind view > Real-time > Arcade","desc":"<p>Grooverider is a slot-car inspired arcade racer aimed at the budget/casual market.  In this game, you race against three other cars around a track inside different rooms of a luxury apartment.  </p><p>There are three different difficulties, or voltages, each faster than the last. There is a selection of cars to race in: British classics, 70's cop show, stock cars, GT sports, Formula X and Japanese.</p><p>Although the racing is limited to fixed lanes that you switch between there are also roadblocks, ramps, splits, loops, merges, and power-ups along the track, and you can barge other cars off.</p><p>The game has both single-player and two-player split-screen modes, and some extra game modes such as cops-n-robbers, and time trial with ghost car.</p>"},{"name":"Growlanser Generations (Disc 1)","year":2004,"developer":"Atlus Co., Ltd.","url":"sony_playstation2_g/Growlanser%20Generations%20%28USA%29%20%28Disc%201%29%20%28Growlanser%20II%20-%20The%20Sense%20of%20Justice%29.zip","filesize":484026916,"score":7.7,"genres":"Compilation > Role-playing (RPG) > Strategy > Top-down > Anime / Manga > Real-time > Turn-based","desc":"<p>Growlanser Generations marks the first time this Turn-Based Strategy RPG series made it to the States. Growlanser Generations is a compilation of 2 games from the series, Growlanser II: The Sense of Justice and Growlanser III: The Dual Darkness. Growlanser Generations can give RPG fans over 60 hours of gameplay between the two games as well as multiple endings so pure RPG fans can play through a few different ways to try to see them all.</p><p>In combat, the player controls each party member by giving them orders in the beginning of each turn. Each game also includes an auto-battle feature which will let the computer fight your battles for you.</p>"},{"name":"Growlanser Generations (Disc 2)","year":2004,"developer":"Atlus Co., Ltd.","url":"sony_playstation2_g/Growlanser%20Generations%20%28USA%29%20%28Disc%202%29%20%28Growlanser%20III%20-%20The%20Dual%20Darkness%29.zip","filesize":541415327,"score":7.7,"genres":"Compilation > Role-playing (RPG) > Strategy > Top-down > Anime / Manga > Real-time > Turn-based","desc":"<p>Growlanser Generations marks the first time this Turn-Based Strategy RPG series made it to the States. Growlanser Generations is a compilation of 2 games from the series, Growlanser II: The Sense of Justice and Growlanser III: The Dual Darkness. Growlanser Generations can give RPG fans over 60 hours of gameplay between the two games as well as multiple endings so pure RPG fans can play through a few different ways to try to see them all.</p><p>In combat, the player controls each party member by giving them orders in the beginning of each turn. Each game also includes an auto-battle feature which will let the computer fight your battles for you.</p>"},{"name":"Growlanser II: The Sense of Justice","year":2001,"developer":"Career Soft","url":"sony_playstation2_g/Growlanser%20II%20-%20The%20Sense%20of%20Justice%20%28Japan%29.zip","filesize":470723104,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > Anime / Manga > Real-time > Turn-based > Fantasy","desc":"<p><em>Growlanser II: The Sense of Justice</em> is a sequel to the  first Growlanser; it is set in the same universe and timeline, featuring characters from the previous game. The story once again focuses on the war between the kingdoms of Rolandia and Burnstein; as opposed to the first game, the spotlight here is on the latter, as the player takes control of a young knight named Wein Cruz. Dreaming of becoming an Imperial Knight, the highest rank in his country, Wein gradually begins to see that not everything is the way it seems, and has to recount events from his own past, face injustice, and solve moral dilemmas concerning duty and friendship.</p><p>The gameplay mostly follows the template introduced in its predecessor. It is a tactical RPG (also called SRPG, \"strategy RPG\") with the distinguishing characteristics of the series: the real-time element in the turn-based battles. Physical attackers must actively move towards the selected target; mages require time to execute spell; instead of the traditional \"grids\" the movement range depends on the characters' speed parameters, etc. New to the series is the ability to equip unique \"Ring Weapons\", which can be enhanced by imbuing them with gems that have various beneficial effects on the character.</p><p>As in the first game, there is a strong dating element in <em>Growlanser II</em>. The player can choose to date several female characters in the game, choosing dialogue options and other decisions of the protagonist. The ending sequence is ultimately influenced by this decisions.</p>"},{"name":"Growlanser II: The Sense of Justice (Deluxe Pack)","year":2001,"developer":"Career Soft","url":"sony_playstation2_g/Growlanser%20II%20-%20The%20Sense%20of%20Justice%20%28Japan%29%20%28Deluxe%20Pack%29.zip","filesize":470723228,"score":"","genres":"Special edition > Physical extras","desc":"<p>This <em>Deluxe Pack</em> includes:</p><ul><li>The game Growlanser II: The Sense of Justice</li><li>A telephone Card</li><li>A world reference</li><li>A bandana</li></ul>"},{"name":"Growlanser III: The Dual Darkness","year":2001,"developer":"Career Soft","url":"sony_playstation2_g/Growlanser%20III%20-%20The%20Dual%20Darkness%20%28Japan%29.zip","filesize":540126470,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Real-time > Turn-based > Fantasy","desc":"<p>The events of <em>Growlanser III: The Dual Darkness</em> take place long before those described in the first game of the  series, effectively making it the prequel. The entire planet is in danger, since the sun's energy is being gradually depleted. Two powerful countries try to seize control of the land: the kingdom of Aggressival and the Xironia Federation. The player takes control of Slayn Wilder, a young man with amnesia. Following a battle against Aggressival soldiers, Slayn is rescued by a girl named Annette, who turns out to be the daughter of the president of Xironia Federation. Together, they decide to uncover the secrets of Slayn's past, and find a way to stop the war and save the planet.</p><p><em>Growlanser III</em> retains many elements of the previous games - free movement during battles, the addition of real-time element to the turn-based system, the Ring Weapon system from the  previous game, etc. It also introduces new gameplay elements, such as magic combinations and skill growth. However, the most notable change in the game is the emphasis on \"pure\" RPG aspects and the reduction of strategy elements to the point that it cannot be qualified as a true strategy game. The party is reduced from eight controllable character to four; instead of being dictated by the story, most battles occur randomly; the player is able to physically move and explore the world map, towns, dungeons, etc.</p><p>The dating element is still present; instead of a branching storyline (as in the previous game), the dating largely depends on character creation (determining Slayn's blood group, etc.). Dialogue choices, however, are still plentiful, and different endings can be reached depending on the relationship level the player has reached.</p>"},{"name":"Growlanser V: Generations","year":2006,"developer":"Career Soft","url":"sony_playstation2_g/Growlanser%20V%20-%20Generations%20%28Japan%29.zip","filesize":3224399889,"score":6.5,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Anime / Manga > Real-time > Turn-based","desc":"<p>Once, an isolated island continent  was plunged into war. The people who wished to end the warring revived a powerful weapon called the \"Admonisher\" and threatened the participants of the war with it. Thus all of the wars were ended by force. The people behind this called themselves the \"Peace Maintenance Brigade.\" 20 years later the old men of the Brigade are no longer able to maintain the peace.</p><p>Now war has once again broken out among the inhabitants of the continent. A mysterious famine has appeared, leaving the citizens to fight over what little fertile land is left, while the cities are constantly attacked by fierce amphibious monsters known as \"Screapers\"</p><p>Battles take place in real-time, and there is no transition to a separate battle map (which is usually found in traditional Japanese RPGs). As such the game forces players to come up with strategies and tactics immediately as the situation calls for it.</p>"},{"name":"Growlanser: Heritage of War (Limited Edition)","year":2007,"developer":"Career Soft","url":"PS2_COLLECTION_PART11/Growlanser%20-%20Heritage%20of%20War%20%28Europe%29.zip","filesize":2949165474,"score":6.1,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Anime / Manga > Real-time > Turn-based","desc":"<p>In North America <em>Growlanser V: Generations</em> was released as a limited edition containing the following:* Growlanser: Heritage of War. The North American version of the game features an enhanced game engine that makes the game run smoother and an increased level of difficulty.</p><ul><li>A 100 page artbook</li><li>A bonus disc containing music and artwork</li><li>A keychain</li><li>Two lenticular cards</li><li>Three pins</li></ul>"},{"name":"Growlanser: Wayfarer of Time","year":2003,"developer":"Career Soft"},{"name":"GT Racers","year":2005,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART11/GT%20Racers%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":157517131,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p><em>GT Racers</em> is a simple racing game with two single player modes: quick race and championship with three modes. (Bronze, Silver and Gold)Completing mode unlocks new cars. There are eleven cars altogether. They are based on real-life cars.Included are ten tracks in five city's: Berlin, London, Paris, Tokyo and New York City. Each locale has one day track and one night track.</p>"},{"name":"GT-R 400","year":2004,"developer":"Kuju Entertainment Ltd.","url":"sony_playstation2_g/GT-R%20400%20%28Europe%2C%20Australia%29.zip","filesize":64271510,"score":"","genres":"Racing / Driving > Behind view > Automobile > Track racing","desc":"<p><em>GT-R 400</em> is a touring car racing game. It features two kinds of car types: production models and GT models. The races takes place on closed circuit tracks and the cars are entirely controlled from a third-person perspective. The driving experience can be customized with a number of gameplay options such as car damage, driving aids and automatic gears. Two licensed cars are available, the Ascari KZ1 and the Mosler MT900. Sixteen tracks are available and they cover three continents. </p><p>A number of game modes are available. The quick race mode is for players that want go straight to the action on the circuit. It's available for one or two players in split-screen multiplayer. The championship mode allows the player to complete in three different championships for each car type. Each championship consists of a number of races and in each race the player has to finish among the top three to qualify for the next race. Three retries are available for each championship. When all are used the player has to restart from the beginning. </p><p>The time trial mode is about beating a specific time limit that is set before the race. The game offers 15 time trials for the player to unlock. When both these and all championship modes have been completed, a 16th time trial becomes available. Beating it unlocks a secret supercar.</p>"},{"name":"GT-R Touring","year":2006,"developer":"Kuju Entertainment Ltd.","url":"PS2_COLLECTION_PART11/GT-R%20Touring%20%28Europe%29.zip","filesize":132221028,"score":"","genres":"Racing / Driving > Behind view > Arcade > Direct control","desc":"<p><em>GT-R Touring</em> is an arcade racing game featuring 36 cars, 28 circuits and head-to-head splitscreen multiplayer.</p>"},{"name":"GTC: Africa","year":2001,"developer":"Rage Games Ltd.","url":"PS2_COLLECTION_PART11/GTC%20Africa%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":268119816,"score":6.5,"genres":"Racing / Driving > Sports > 3rd-person (Other) > Licensed","desc":"<p><em>GTC Africa</em> (GTC meaning Global Touring Challenge) is a rally game for 1-2 players in a geographical setting of Africa. The game could be seen as a follow-up to the developers previous game Wild Wild Racingthough now we stay in one continent only, and use more ordinary rally cars.</p><p>The game has 9 cars used in 19 circuits in environments from cities to savannah and jungle, which can be raced individually or in one of three championships, either East Coast Championship, the North South Challenge or a full African Tour with all 19 circuits.</p><p>For 2 players, only the individual races are available, not the championships, which only allow one player racing against AI. There is also a Practice and a Challenge mode, which consists of a mini-game on a mixed circuit.Customization is only selecting Teams (with team colors, and cars) and choosing automatic or manual gearbox.</p><p>Driveable cars are:</p><ul><li>Ford Cougar</li><li>Ford Escort RS Cosworth (Mk V)</li><li>Ford Focus RS WRC (Mk I)</li><li>Ford Mustang (Mk IV)</li><li>Mitsubishi Lancer (Evolution VI)</li><li>Pontiac Firebird Trans Am</li><li>Pontiac Grand Am</li><li>Pontiac Vibe</li><li>Subaru Impreza</li></ul>"},{"name":"Guerrilla Strike","year":2006,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART11/Guerrilla%20Strike%20%28Europe%29.zip","filesize":199090184,"score":"","genres":"Action > Top-down > 2D scrolling > Shooter > Helicopter","desc":"<p>The War has been initiated by the evil forces. You are an Air Forces officer, the member of an Alliance that was formed to stop this war. Your goal is to complete the most important mission planned by the Alliance. You have to pilot a super modern helicopter and destroy the enemy lines on the unreachable, for the regular armed forces, territories.</p>"},{"name":"Guilty Gear Isuka","year":2004,"developer":"Arc System Works Co., Ltd.","url":"PS2_COLLECTION_PART11/Guilty%20Gear%20Isuka%20%28Europe%29.zip","filesize":1416476740,"score":6.7,"genres":"Action > Side view > Anime / Manga > Beat 'em up / brawler > Fighting > Direct control > Fantasy","desc":"<p>The next installment in the Guilty Gear sci-fi fighting series, in which bio weapons called Gears fight among each other for ultimate supremacy and survival, as they escape the so called Holy Knights who aim to hunt down and destroy them.</p><p>As with previous games in the series the game involves tournament-styled battles between characters using their special abilities and moves. However for GG Isuka the battles are 2-on-2 instead of 1-on-1, taking place in multi-plane arenas (similar to Fatal Fury) and requiring the players to switch orientation manually.</p><p>Added features include two new characters (only one playable), new backgrounds and game modes including the new \"Boost\" mode, which turns the game into a 2D side scrolling beat 'em up.</p>"},{"name":"Guilty Gear X","year":2001,"developer":"PicPac Airreal Co., Ltd.","url":"PS2_COLLECTION_PART11/Guilty%20Gear%20X%20%28Europe%29.zip","filesize":424486108,"score":7.7,"genres":"Action > Side view > Anime / Manga > Fighting > Martial arts","desc":"<p>When the humans created artificial beings named \"gears\" in 22th century, they didn't expect that their creation will eventually turn against them. Because gears had no will of their own and could only obey humans. Only one gear, named Justice, was able to transfer his will onto other gears and to rebel against the humans. In year 2180, Justice was killed as a result of a bloody tournament organized by the Sacred Order of Holy Knights. Yet recently, a new gear was discovered. He showed no signs of hostility, yet he had no master and was roaming about free. It was impossible to capture or to kill him because he was immensely strong. Fearing a new Justice will grow out of this gear, the Order organized yet another tournament, this time with a solid prize: five hundred thousand world dollars for the winner.</p><p><em>Guilty Gear X</em> is a follow up to  Guilty Gear, and is also a 2D fighting game. There are now 16 characters available for you to choose. The battle system became more complicated, thanks to the variety of moves you can perform. Beside special attacks which you can execute if you build up your Tension Gauge by attacking or advancing towards your opponent, there is also a variety of defensing moves to perform. The instant kill moves are back from the previous game.</p>"},{"name":"Guilty Gear X Plus","year":2001,"developer":"Arc System Works Co., Ltd.","url":"sony_playstation2_g/Guilty%20Gear%20X%20Plus%20%28Japan%29.zip","filesize":496867776,"score":"","genres":"Action > Side view > Anime / Manga > Arcade > Fighting > Sci-fi / futuristic","desc":"<p><em>Guilty Gear X Plus</em> is an enhanced edition of Guilty Gear X. This \"Plus\" edition adds Kliff and Justice from the original Guilty Gear as playable characters, as well as a Story Mode, which has since remained as a mainstay of the series.</p>"},{"name":"Guilty Gear X2","year":2002,"developer":"Arc System Works Co., Ltd.","url":"PS2_COLLECTION_PART11/Guilty%20Gear%20X2%20%28Europe%29.zip","filesize":1932422190,"score":8,"genres":"Action > Side view > Arcade > Fighting > Martial arts","desc":"<p>In <em>Guilty Gear X2</em>, 6 new characters join the list of 14 from the previous Guilty Gear series for an all out brawl of extreme 2D martial arts, magic and huge combos.</p><p>Along with the usual training and story modes, <em>GGX2</em> includes Medal of Millionaires, where each battle earns you medals and points instead of simple wins. Mission mode has you completing certain objectives for each fight in order to continue, while Survival and 2 player head to head modes round out the options.</p>"},{"name":"Guilty Gear X2: The Midnight Carnival","year":2003,"developer":"Sammy Corporation","url":"PS2_COLLECTION_PART11/Guilty%20Gear%20X2%20%23Reload%20-%20The%20Midnight%20Carnival%20%28Europe%29.zip","filesize":2156768620,"score":7.8,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting","desc":"<p><em>#Reload</em> is an update to Guilty Gear XX, which changes gameplay by balancing out a lot of the moves, also removing some of the moves which gave a character an unfair advantage over another. Additionally, this version adds a new instantly playable character and new missions to play through for the others.</p><p>The action is viewed from the side, and the characters include Holy Knights, assassins and bounty hunters. Unlockable extras form a big part of the challenge. The story modes aim to incorporate an evolving storyline with full dialogue. Online play is offered on some systems.</p>"},{"name":"Guilty Gear XX Accent Core","year":2007,"developer":"Arc System Works Co., Ltd.","url":"sony_playstation2_g/Guilty%20Gear%20XX%20Accent%20Core%20%28USA%29.zip","filesize":1830431881,"score":7.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting","desc":"<p><em>Λ Core</em> is the third revision of the original Guilty Gear X2 fighting game. This edition includes balance changes and a new special move: Force Break. The characters either have new special moves or existing ones upgraded, or turned into a Force Break, which consumes 25% of the tension bar. Other gameplay changes include new moves that throw and hold an opponent against floors or walls, throw breaks, and Slashback a parrying move with reduced block stun. Two characters have been removed: Justice and Kliff.</p><p>Unlike the earlier revisions, the graphics and sounds have also been updated. Many of the voices have been re-recorded or replaced, the players' artwork was redone and there are 2 new music tracks. There are 3 fighting systems per character: Guilty Gear, Guilty Gear X, and Λ Core.</p>"},{"name":"Guilty Gear XX Accent Core Plus","year":2008,"developer":"Arc System Works Co., Ltd.","url":"sony_playstation2_g/Guilty%20Gear%20XX%20Accent%20Core%20Plus%20%28Europe%29.zip","filesize":2578218046,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Fantasy > Sci-fi / futuristic","desc":"<p><em>Λ Core Plus</em> (Accent Core Plus) is a major update of Guilty Gear XX Λ Core. The game includes a wide array of balance and gameplay tweaks and bugfixes. Kliff Undersn and Justice have been added back in as playable characters, Mission and Survival modes have been added, and a new Story mode has been added. The story picks up directly after the events of Guilty Gear XX, and includes a unique story path for each of the playable characters.</p><p>The PS2 version is available as both a stand-alone release and an \"append\" disc that requires the original Λ Core. The PSP version adds a 3-on-3 tag match mode, while the PS3 and Xbox 360 releases add online play.</p>"},{"name":"Guilty Gear XX Slash","year":2006,"developer":"Arc System Works Co., Ltd.","url":"sony_playstation2_g/Guilty%20Gear%20XX%20Slash%20-%20The%20Midnight%20Carnival%20%28Japan%29.zip","filesize":1742856366,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting","desc":"<p><em>Slash</em> is the second update to Guilty Gear XX, after #Reload. It again features a wide range of balance tweaks and other adjustments, along with two new characters: A.B.A (originally introduced in Isuka) and Order Sol, and a new canceling system called Force Roman Cancel.</p>"},{"name":"Guitar Freaks 3rd Mix & DrumMania 2nd Mix","year":2000,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_g/GuitarFreaks%203rd%20Mix%20%26%20DrumMania%202nd%20Mix%20%28Japan%29.zip","filesize":845878621,"score":"","genres":"Strategy > Arcade > Music / rhythm","desc":"<p>'Guitar Freaks' and 'DrumMania' are basically two separate music games that are now linked together, on a single cd.</p><p>Basically, you're told how to play your instrument via a scrolling collection of bars. The longer you go without missing a note, the higher your score. Miss too many, and your game ends. At the end of every song, you're given a report card that tallies up your mistakes and gives you a letter grade based on your performance.</p>"},{"name":"Guitar Hero","year":2005,"developer":"Harmonix Music Systems, Inc.","url":"PS2_COLLECTION_PART11/Guitar%20Hero%20%28Europe%29.zip","filesize":2392726146,"score":8.8,"genres":"Action > Simulation > 3rd-person (Other) > Cinematic camera > Music / rhythm","desc":"<p><em>Guitar Hero</em> simulates the thrill and the glory of rock 'n' roll. Choose from eight different characters, from classic rockers to metal heads, and build a career as a working rock musician.</p><p>The real kick is in the gameplay, which incorporates an included guitar-shaped controller. It allows you to \"play along\" with 30 awesome rock tunes by pressing fret buttons and working a responsive and durable strum bar. There's even a whammy bar for extreme action. The songs include selections from the Red Hot Chili Peppers, Boston, Audioslave and White Zombie.</p><p>Four difficulty levels test your skills and six venues will place you before increasingly larger audiences. You love rock music. You're a master at air guitar. Take the next step and walk a career's worth of miles in a rocker's shoes.</p>"},{"name":"Guitar Hero 5","year":2009,"developer":"Neversoft Entertainment, Inc.","url":"PS2_COLLECTION_PART11/Guitar%20Hero%205%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":4264777762,"score":8.3,"genres":"Action > Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Guitar Hero 5</em> is the fifth main game in the musical rhythm series. Similar to the previous title, Guitar Hero: World Tour, the focus is on a band-experience, with a lead and bass guitar, drums and vocals. The title is available standalone or bundled with the instruments.</p><p>Next to a new soundtrack with 85 songs, many animated lead singers are now modelled after famous musicians such as Johnny Cash, Carlos Santana, Shirley Manson, Kurt Cobain, and Matthew Bellamy. Players can still compose their own songs in the included studio and the game relies heavily on downloadable content, through tracks and full albums. A portion of the songs of <em>Guitar Hero: World Tour</em>, Guitar Hero Smash Hits and Band Hero can be imported in exchange for a small fee per song.</p><p>In the Band Lobby players can assemble a party of local and remore players to form a band, play the Career mode or opt for Quickplay. Most of the competitive multiplayer modes are carried over from former versions, along with two new ones: Party Play (random song selection with the option to join and leave at will using any instrument) and RockFest, a band mode for up to four (local) or up to eight (online) players with a variety of submodes. The songs are divided in smaller portions and for each section the players are rewarded based on a variety of conditions.</p><p>General new features introduced to the gameplay include drop-in/drop-out play, where it is possible to join in the middle of a song or stop playing without interrupting gameplay. There is also a new Challenges section in the Career mode.</p><p>The different game versions are identical, except for the PS2 version that lacks online game modes and downloadable content, drop-in/drop-out play and song challenges. It is also limited to two instruments and the multitap is not supported. The Wii version is very similar to the major console versions, including downloadable content on SD cards, multiplayer through the global Wii address book, and the Mii Freestyle mode from the previous game. It also supports interaction with the Nintendo DS to edit videos and provides access to the Roadie Battle mode, similar to the main battle mode of Guitar Hero III, where players complete mini-games on the Nintendo DS to sabotage the players on the console.</p>"},{"name":"Guitar Hero Encore: Rocks the 80s","year":2007,"developer":"Harmonix Music Systems, Inc.","url":"PS2_COLLECTION_PART11/Guitar%20Hero%20-%20Rocks%20the%2080s%20%28Europe%2C%20Australia%29.zip","filesize":1539598932,"score":7.1,"genres":"Action > Simulation > 3rd-person (Other) > Cinematic camera > Music / rhythm > Direct control","desc":"<p><em>Guitar Hero Encore: Rocks the 80s</em> is an incremental title in the Guitar Hero series, using the features and gameplay from Guitar Hero II but with a completely new batch of songs. The game's theme is the eighties, reflected by the characters and their clothing, the venues and of course the songs themselves. It is the last title in the series developed by the original creators Harmonix Music Systems, Inc.</p><p>As in the previous games, in the single-player mode the player works his way through a setlist unlocking increasingly difficult songs, divided over 4 main difficulties. By performing well, new songs and venues become available, but there are less unlockables compared to the previous titles. Notable bands in this edition include A Flock of Seagulls, The Police, Iron Maiden, Judas Priest, Asia, Dio and Anthrax. Unlike the previous games, there are no bonus tracks.</p><p>The game is played through the guitar controller introduced for this series. The multi-player modes include Co-op, Face-off and Pro Face-off, identical to the previous game.</p>"},{"name":"Guitar Hero II","year":2006,"developer":"Harmonix Music Systems, Inc.","url":"PS2_COLLECTION_PART11/Guitar%20Hero%20II%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2568976178,"score":8.8,"genres":"Action > 3rd-person (Other) > Cinematic camera > Music / rhythm","desc":"<p><em>Guitar Hero II</em>, the follow-up to the PS2-only game Guitar Hero, expands upon the gameplay and features of the original game. As a wannabe rockstar, you need to play songs by pressing combinations of five fret buttons on a guitar-shaped controller, while working the strum bar, along with an optional whammy bar for distortion. The sequel contains 64 songs, of which 40 have been licensed. One of the tracks was discovered through a contest at beaguitarhero.com, where unlicensed bands could send in a demo to be included in the game. Most of the tracks have been covered in-studio, but a few use original recordings.</p><p>The career mode has been revamped as a high school battle where you need to make your way to the top. Every venue is now represented by a different city. There are also encore performances, and unlockables can still be bought in the shop. A completely new addition is the practice mode (Shred School). When you keep getting stumped by a single track, you can train in this mode. The background music is dropped, you can choose a certain section to practice, and there four types of speeds available, to slowly get the hang of difficult passages.</p><p>In the multiplayer mode, you can still play the traditional mode from the first game, where sections are traded off between players. The co-op mode is new: both players play the same song at the same time, but one is given the lead guitar, while the other handles the bass or rhythm guitar. Unlike the traditional mode, you can fail and both player share the score, rock meter and multiplier. To activate star power (a short power-up mode where the score multiplier is doubled, built up in a meter by playing a number of star-shaped notes without flaws and best saved for difficult sections) both players need to raise the guitar at the same time. You cannot practice together in this mode, but the different sections are available in the singleplayer practice mode. The final mode is called Face-Off. Here, both players play every single note at the same time. In the multiplayer mode, each player can now choose an individual difficulty level. Upon completing Face-Off, Pro Face-Off becomes available, where both players need to use the same difficulty level.</p><p>Other additions are the introduction of three-button chords, the use of hammer-ons and pull-offs (holding one note while playing another and vice versa) is smoother, and the screen now shakes if you break a note streak (only of the side of the player who makes the mistake in the multiplayer mode).</p>"},{"name":"Guitar Hero III: Legends of Rock","year":2007,"developer":"Neversoft Entertainment, Inc.","url":"PS2_COLLECTION_PART11/Guitar%20Hero%20III%20-%20Legends%20of%20Rock%20%28Europe%2C%20Australia%29.zip","filesize":3157356854,"score":8.5,"genres":"Action > Simulation > 3rd-person (Other) > Cinematic camera > Music / rhythm > Direct control","desc":"<p><em>Guitar Hero III: Legends of Rock</em> is the third full game in the Guitar Hero series and fourth game overall. The gameplay remains similar to the previous games: using a guitar-shaped controller, you need to coordinate pressing the five fret buttons and strumming to the scrolling notes on screen. Missing notes will cause your performance meter to drop; if the meter drops too low then the performance is a failure and you will need to try again. This edition of the game features 71 new songs to play from various artists including Cream, The Rolling Stones, Black Sabbath, Aerosmith, Guns N' Roses, Santana, Sonic Youth, Weezer, and many more. In addition to the available songs the game also features \"boss battles\" against famous guitarists such as Slash, Tom Morello and Lou the Devil. Several game modes are available including career mode, co-op mode, and multiplayer mode. In addition to the main game modes, training and practice modes are available to aid in learning the game or figuring out a tricky passage in a song.</p><p>In <strong>career mode</strong> you play the part of a wanna-be rock star. Beginning with easier songs in small venues, you need to successfully complete tracks to make your way up to a superstar. Each venue you play requires a certain number of songs to be performed before you can move on to the next larger venue. Successful completion of songs also earns money which can be used to unlock characters, outfits, new guitars, and other bonuses.</p><p>The <strong>co-op career mode</strong> is similar to the single player variation, except two players work together (one on lead guitar, the other on bass or rhythm guitar) to complete songs. </p><p>The <strong>multiplayer</strong> game modes allow two players to compete against each other. In the Face-Off variation, two players take turns performing a song. The Pro Face-Off variation allows two players to compete at the same time playing the exact same note chart. Finally, in the battle mode each player can earn power ups by performing well which can be used to disrupt the other player.</p>"},{"name":"Guitar Hero Smash Hits","year":2009,"developer":"Beenox Inc.","url":"sony_playstation2_g/Guitar%20Hero%20-%20Smash%20Hits%20%28USA%29.zip","filesize":3034400772,"score":7.2,"genres":"Action > Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Guitar Hero Smash Hits</em> is a spin-off <em>Guitar Hero</em> game featuring a compilation of songs from earlier releases in the franchise, including Guitar Hero, Guitar Hero II, Guitar Hero Encore: Rocks the 80s, Guitar Hero III: Legends of Rock and Guitar Hero: Aerosmith.</p><p>The game's set list now supports four players in a full band set-up (introduced to the <em>Guitar Hero</em> series in  World Tour), an 8-player battle of the bands setup, and all songs are now original recordings from the genuine artists and are all playable in the Quick Play mode without the need to complete the career first.</p><p>Slight changes have also been made to the gameplay mechanics, including the addition of slider notes (again from <em>World Tour</em>) and the inclusion of the Expert+ difficulty setting for drums, which is carried over from Guitar Hero: Metallica.</p><p>Songs from <em>Guitar Hero</em>:</p><ul><li>Blue Öyster Cult - \"Godzilla\"</li><li>Boston - \"More Than A Feeling\"</li><li>Deep Purple - \"Smoke On The Water\"</li><li>Franz Ferdinand - \"Take Me Out\"</li><li>Helmet - \"Unsung (Live)\"</li><li>Incubus - \"Stellar\"</li><li>Joan Jett &amp; The Blackhearts - \"I Love Rock N' Roll\"</li><li>Ozzy Osbourne - \"Bark At The Moon\"</li><li>Pantera - \"Cowboys From Hell (Live)\"</li><li>Queen - \"Killer Queen\"</li><li>Queens Of The Stone Age - \"No One Knows\"</li><li>The Donnas - \"Take It Off\"</li><li>The Exies - \"Hey You\"</li><li>White Zombie - \"Thunder Kiss '65\"</li></ul><p>Songs from <em>Guitar Hero II</em></p><ul><li>Alice In Chains - \"Them Bones\"</li><li>Avenged Sevenfold - \"Beast And The Harlot\"</li><li>Danzig - \"Mother\"</li><li>Foo Fighters - \"Monkey Wrench\"</li><li>Iron Maiden - \"The Trooper\"</li><li>Jane's Addiction - \"Stop!\"</li><li>Kansas - \"Carry On Wayward Son\"</li><li>Lamb Of God - \"Laid To Rest\"</li><li>Lynyrd Skynyrd - \"Free Bird\"</li><li>Mötley Crüe- \"Shout At The Devil\"</li><li>Nirvana - \"Heart-Shaped Box\"</li><li>Rage Against The Machine - \"Killing In The Name\"</li><li>Reverend Horton Heat - \"Psychobilly Freakout\"</li><li>Rush - \"YYZ\"</li><li>Stone Temple Pilots - \"Trippin' On A Hole\"</li><li>The Police - \"Message In A Bottle\"</li><li>The Sword - \"Freya\"</li><li>Warrant - \"Cherry Pie\"</li><li>Wolfmother - \"Woman\"</li></ul><p>Songs from <em>Guitar Hero III: Legends of Rock</em></p><ul><li>AFI - \"Miss Murder\"</li><li>DragonForce - \"Through The Fire And Flames\"</li><li>Heart - \"Barracuda\"</li><li>Kiss - \"Rock And Roll All Nite\"</li><li>Living Colour - \"Cult Of Personality\"</li><li>Pat Benatar - \"Hit Me With Your Best Shot\"</li><li>Priestess - \"Lay Down\"</li><li>Slayer - \"Raining Blood\"</li></ul><p>Song from <em>Guitar Hero: Aerosmith</em></p><ul><li>Aerosmith - \"Back In The Saddle\"</li></ul><p>Songs from <em>Guitar Hero Encore: Rocks The 80's</em></p><ul><li>Anthrax - \"Caught In A Mosh\"</li><li>Extreme - \"Play With Me\"</li><li>Judas Priest - \"Electric Eye\"</li><li>Poison - \"Nothin' But A Good Time\"</li><li>Ratt - \"Round and Round\"</li><li>Twisted Sister - \"I Wanna Rock\"</li></ul>"},{"name":"Guitar Hero: Aerosmith","year":2008,"developer":"Neversoft Entertainment, Inc.","url":"PS2_COLLECTION_PART11/Guitar%20Hero%20-%20Aerosmith%20%28Europe%2C%20Australia%29.zip","filesize":2479039229,"score":7.1,"genres":"Action > Simulation > 3rd-person (Other) > Cinematic camera > Music / rhythm","desc":"<p><em>Guitar Hero: Aerosmith</em> is considered an expansion of Guitar Hero III and it is the first title in the series primarily focused on a single band. The gameplay concept is similar to the game it is based on. About 60% of the included tracks are by Aerosmith, while the others have influenced or have opened for the band (Run-D.M.C., The Kings, Lenny Kravitz, ...). Four songs were re-recorded by the band directly for the game and they also performed as motion capture actors for their 3D models. The majority of the tracks consists of master recordings.</p><p>The prominent game segment is the career mode where players go through the band's history, from the earlier seventies to 2001. Times of internal issues are not touched upon. Players initially start as Joe Perry but can later also unlock the other band members Brad Whitford and Tom Hamilton. The career has been divided into six tiers with five tracks, each based on a period in the band's history. There are also encores when a tier has been completed, and two opening acts playing as another band. After each tier, bonus material is shown such as trivia or video sequences and interviews.</p><p>Songs are unlocked gradually and become available in the other modes, identical to <em>Guitar Hero III</em> (Quickplay, Cooperative, Competitive + Battle modes). Only the cooperative career mode is absent. The menus have been redesigned and there are new venues, based on historical performances. There are 41 songs in total, of which 31 can be unlocked in the career mode and an additional 10 in the vault.</p><p>The game is available in a bundle with a custom guitar or as a single game release. For the PS2 version there are two bundles, one with a single, wireless guitar and another with two, wired guitars.</p>"},{"name":"Guitar Hero: Metallica","year":2009,"developer":"Neversoft Entertainment, Inc.","url":"PS2_COLLECTION_PART11/Guitar%20Hero%20-%20Metallica%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5501293149,"score":8.3,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Guitar Hero: Metallica</em> is the second game in the Guitar Hero series to focus on specific band, following the release of Guitar Hero: Aerosmith.</p><p>This title largely borrows from the novelties introduced in Guitar Hero: World Tour, with band career modes for single or multiple players with a storyline drawn as a cartoon, competitive modes online, and the possibility to play with different instruments such as a regular guitar, a bass guitar, drums, and doing the vocals. The storyline describes how a band wants to follow in the footsteps of the Metallica and become a leading act on their tour. This edition adds an Expert+ difficulty mode where players need to drum using a second bass pedal to mimic the playing style of Lars Ulrich, the drummer of the band. The members also did motion capture sessions for the avatars in the game.</p><p>The music selection consists of 28 master recordings and 21 additional songs by others selected by the band. Bonus features include various videos and trivia about the songs. Progress is made by completing sets of songs, rather than a series of gigs as in <em>Guitar Hero: World Tour</em>, set in venues that were in important in the band's career. Performances are rated with stars and a certain amount is needed to progress and unlock a new set.</p><p>The game also includes the GHTunes from <em>World Tour</em> where new songs can be created and shared. A new Drum Mode offers the possibility to play the drums without an existing drum track to create new rhythms, and the Battle mode (from Guitar Hero III: Legends of Rock), has been updated with Metallica influences for the power-ups, with names like Fade To Black, Under The Ice and Ride The Lightning.</p><p>Although released in Europe packaged with a guitar controller and Metallica faceplate, other regions were not so fortunate and only received a solus edition. Custom drumsticks and a second bass pedal were offered as pre-order bonuses in certain stores.</p><p>The Metallica tracklist includes:</p><ul><li>All Nightmare Long</li><li>Battery</li><li>Broken, Beat &amp; Scarred</li><li>Creeping Death</li><li>Cyanide</li><li>Disposable Heroes</li><li>Dyers Eve</li><li>Enter Sandman</li><li>Fade to Black</li><li>Fight Fire with Fire</li><li>For Whom the Bell Tolls</li><li>Frantic</li><li>Fuel</li><li>Hit the Lights</li><li>King Nothing</li><li>Master of Puppets</li><li>The Memory Remains</li><li>Mercyful Fate (Medley)</li><li>My Apocalypse</li><li>No Leaf Clover (Live)</li><li>Nothing Else Matters</li><li>One</li><li>Orion</li><li>Sad But True</li><li>Seek &amp; Destroy</li><li>The Shortest Straw</li><li>The Thing That Should Not Be</li><li>The Unforgiven</li><li>Welcome Home (Sanitarium)</li><li>Wherever I May Roam</li><li>Whiplash</li></ul><p>The guest tracklist includes:</p><ul><li>Alice in Chains - No Excuses</li><li>Bob Seger and the Silver Bullet Band - Turn the Page (Live)</li><li>Corrosion of Conformity - Albatross</li><li>Diamond Head - Am I Evil?</li><li>Foo Fighters - Stacked Actors</li><li>Judas Priest - Hell Bent for Leather</li><li>Kyuss - Demon Cleaner</li><li>Lynyrd Skynyrd - Tuesday's Gone</li><li>Machine Head - Beautiful Mourning</li><li>Mastodon - Blood and Thunder</li><li>Mercyful Fate - Evil</li><li>Michael Schenker Group - Armed and Ready</li><li>Motörhead - Ace of Spades</li><li>Queen - Stone Cold Crazy</li><li>Samhain - Mother of Mercy</li><li>Slayer - War Ensemble</li><li>Social Distortion - Mommy's Little Monster (Live)</li><li>Suicidal Tendencies - War Inside My Head</li><li>System of a Down - Toxicity</li><li>The Sword - The Black River</li><li>Thin Lizzy - The Boys Are Back in Town</li></ul><p>Metallica songs of the Death Magnetic album bought for previous versions are incorporated into the game.</p>"},{"name":"Guitar Hero: Van Halen","year":2009,"developer":"Underground Development","url":"sony_playstation2_g/Guitar%20Hero%20-%20Van%20Halen%20%28USA%29%20%28En%2CFr%29.zip","filesize":3624729557,"score":5.8,"genres":"Action > Simulation > Top-down > Isometric > Arcade > Music / rhythm","desc":"<p>An expansion to the wildly popular Guitar Hero series, GHVH features 25 songs by the group Van Halen, as well as 19 bonus songs by other artists that were inspired by Van Halen.</p><p>You'll find VH classics like \"Jump\", \"Hot for Teacher\", \"Atomic Punk\", and many more. Other groups featured include the Foo Fighters, Queen, Tenacious D, and Judas Priest.</p>"},{"name":"Guitar Hero: World Tour","year":2008,"developer":"Neversoft Entertainment, Inc.","url":"PS2_COLLECTION_PART11/Guitar%20Hero%20World%20Tour%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5455890331,"score":7.9,"genres":"Action > Simulation > 3rd-person (Other) > Cinematic camera > Music / rhythm","desc":"<p><em>Guitar Hero: World Tour</em> is the fourth main game in the series and brings a major change to the concept. Following the release of Rock Band that built on the <em>Guitar Hero</em> concept but added additional instruments, <em>World Tour</em> introduces these as well to allow players to play together simultaneously as a real band. Next to the guitar that was the main peripheral for the previous titles, the bundled edition of the game adds a microphone for the vocal parts and drums for percussion. Just like the previous game, the guitar tracks are split up for the lead and bass. The lyrics and the vocal pitch is shown near the top of the screen, while the bottom part is split up for bass guitar, lead guitar and drums, each with a separate set of notes that need to be hit to correctly play the part.</p><p>While playing, a rock meter keeps track of successive notes hit (one for each player), which leads to score multipliers. When the meter becomes too low, other players can make up for this on a shared, general performance meter. In the same vein players share a star power meter, built up by playing through certain sections successfully, that any player can access.</p><p>There are four difficulty levels and a new beginner mode where notes are made as easy as possible to introduce the concept to new players. Most of the game content is centered around a Career mode (both Solo and Band) where players start a new band, choose an avatar an instrument, and then play different gigs unlocking new songs along the way. Completing tracks earns money that can be spent on outfits or instruments. There are once again encore songs and \"boss challenges\" where the lead guitar enters a duel. This is similar to the battles in <em>Guitar Hero III</em>, but without the power-ups. Instead it returns to a call-and-response mechanic similar to the Face-Off mode. Bands consists of offline players but online members can join as well. Complete bands can take on others online through the Battle of the Bands mode.</p><p>Through the Music Studio editor new songs can be composed and shared using the GHTunes service (not for the PS2). In this edition avatars can be customized with more detail using the Create-a-Rocker mode. Major artists have licensed their appearance in the game. The Wii version contains a Mii Freestyle mode where players can use their Mii characters in-game and compose songs through motions of the Wii remote and the Nunchuk controller.</p><p>There are several bundles for the game, based on the amount of instruments included, but also a stand-alone version as most of the versions are compatible with the controllers of previous games and even some of <em>Rock Band</em>.</p>"},{"name":"Gumball 3000","year":2002,"developer":"Climax Solent","url":"PS2_COLLECTION_PART11/Gumball%203000%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1690124651,"score":6.2,"genres":"Action > Racing / Driving > Behind view > Automobile > Europe > Licensed","desc":"<p><em>Gumball 3000</em> is a racing game based on the real-life 3000 mile rally of the same name that has been running annually since 1999. The full race is a single player game but other races have two player modes. </p><p>This game has the following game modes;<em> Spirit of Gumball: This game mode consists of two race types and a picture gallery;    + Single Race: In this race the player competes against two other cars in the same class on any unlocked course.     The courses in the race are set in the UK, Spain, France, the Riviera, Italy, Switzerland and Germany. Initially only the first UK stage, Airport Dash, and the first Spanish leg of the race are unlocked, further rally stages are unlocked as the player completes these and subsequent stages.    + Gumball 3000: This is the full race, the player starts in the UK on day one and must complete all stages in order commencing with the Airport Dash to Stanstead airport. From their the cars are loaded onto an Antonov aircraft and are flown to the next stage in Spain. The race continues across Europe to Baden-Baden in Germany before returning to the UK.    + Gumball Gallery: This is a series of tasks, four per stage, which set specific goals for the player to achieve during a stage. For the tasks for the Woodland Rendezvous stage are as follows; the player must achieve a speed of 200mph; collect two speed cameras; finish the stage in first position; and wreck a Gumball Squad vehicle, each task completed earns the player Gumball points.</em> Gumball Squad: In this game mode the player drives a law enforcement vehicle and is tasked with stopping a specified Gumball racer in each stage by whatever means necessary. Thirty-two Gumball points are needed to unlock this game mode</p><ul><li>Gumball King: Seventy-three Gumball points are needed to unlock this game mode in which the player and two others divide the game's twenty-one vehicles amongst them, that's seven each, and they then compete over seven races</li><li>Time Trial: Here there are no competitors and no other traffic, player races to achieve a fast time. As with the Spirit of Gumball's Single Race option only the first stage of the UK &amp; Spanish parts of the race are available at the outset, other stages are unlocked as the player progresses. Beating the course record will unlock another race car.</li><li>Multiplayer: This game mode is a three of the single player, short race, game modes;<ul><li>Single Race: Where the player races against a real and an AI opponent</li><li>Gumball Squad: Here one player is the racer and the other drives the police vehicle</li><li>Gumball King: This plays the same as the previously described Gumball King mode but in this game one of the other players is real</li></ul></li></ul>"},{"name":"Gun","year":2005,"developer":"Neversoft Entertainment, Inc.","url":"PS2_COLLECTION_PART11/Gun%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":1322838436,"score":7.6,"genres":"Action > Gambling > Racing / Driving > 3rd-person (Other) > Behind view > Fighting > RPG elements > Shooter > Western > Regional differences","desc":"<p>The Wild Wild West meets Grand Theft Auto in this free-roaming action game. Set in 1870, you are Colton White, a young gunslinger whose father is killed by an Indian tribe led by Reverend Reed. Just before passing away, your father hands you a token and reveals you are not his son. Sworn to avenge his death, you pursue the killers and unravel the secrets surrounding the item. Although you are on your own, temporary alliances can be formed with townspeople, Apaches, and posse members, but watch your back as they can turn against you.</p><p>The main storyline, written by Hollywood screenwriter Randall Jahnson (The Mask of Zorro, 1998,) is linear. You will have to fight duels, defend towns against bandits, help build railway tracks, intervene in various conflicts, and kill heavily-armed bossed. There are also many side missions or alternative ways to earn money. You can play poker in the casino, help out farmers with their livestock, assist the local sheriff, or deliver items with the pony express. Other possibilities include bounty hunting, regular hunting for rare animals, mining for gold, and various rescue missions. </p><p>The RPG elements involve acquiring and improving skills, such as QuickDraw (shown in Bullet Time,) Zoom Firing, Melee Combat, improved accuracy, the ability to throw axes, and strategically equipping and upgrading different weapons. There are hand weapons (knives, tomahawks, bayonets), archery arms, explosive throwable items, and regular guns, such as sharpshooter rifles, colts, and Winchesters. Some are earned during the missions, others can be bought and sold for cash in the towns.</p><p>The GTA reference is reflected in the main means of transportation: horses. There are different animals to find with extensive movement options. Go on wild chases, spurt, gallop, do skid attacks, or trample your enemies. Give them some rest from time to time, or you will wear them down to death. In the melee combat, you can do roll maneuvers, use objects to provide cover, grab your opponents, and even scalp them. You are free to steer away from the main storyline and explore the giant landscape, with towns, deserts, mountains, wilderness, and caves.</p>"},{"name":"Gunbird: Special Edition","year":2004,"developer":"X-Naut.Psikyo","url":"PS2_COLLECTION_PART11/Gunbird%20Special%20Edition%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":143510017,"score":"","genres":"Action > Compilation > Top-down > Anime / Manga > Arcade > Shooter","desc":"<p><em>Gunbird Special Edition</em> contains two shoot em 'ups from the Gunbird series previously not released for the PlayStation 2.* Gunbird</p><ul><li>Gunbird 2</li></ul>"},{"name":"Gunfighter II: Revenge of Jesse James","year":2003,"developer":"Rebellion Developments Ltd.","url":"PS2_COLLECTION_PART11/Gunfighter%20II%20-%20Revenge%20of%20Jesse%20James%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":261583210,"score":"","genres":"Action > 1st-person > Arcade > Shooter","desc":"<p><em>Gunfighter II</em>, the sequel to the 2001 PlayStation release, continues the wild adventures of Jesse James as players strap on a six-shooter and prepare to gun down an assortment of two-bit thugs and double crossing varmints who done them wrong. </p><p>Two different modes of play include Story and Arcade. The Story mode follows Jesse James' quest for revenge as he seeks out bandits through an assortment of locales, including a mine, campsite, and various hideouts. Players will eventually confront boss characters whose weapons are automatically earned after their defeat.</p><p>To help players complete each stage within the time limit, a pocket watch will appear, adding more seconds to the clock if successfully hit.</p>"},{"name":"Gungrave","year":2002,"developer":"Positron Co., Ltd.","url":"PS2_COLLECTION_PART11/Gungrave%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1341519394,"score":6.7,"genres":"Action > 3rd-person (Other) > Anime / Manga","desc":"<p>In <em>Gungrave</em>, you play Grave, a long dead assassin sent back from the dead to annihilate endless hordes of enemies. Players battle their way through massive areas filled with non-stop shooting foes in this anime-style, third person shooter.</p><p>You blast through the stages using your two weapons with unlimited ammo, and with your coffin, which can be used as a rocket launcher. The game keeps players pounding down on the square button, or just using the rapid fire option. </p><p>There are also various special types of shots in the game that are limited for each level. Also included in this game is a targeting system.</p>"},{"name":"Gungrave: Overdose","year":2004,"developer":"Ikusabune Inc.","url":"PS2_COLLECTION_PART11/Gungrave%20-%20Overdose%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":3491944129,"score":7.1,"genres":"Action > 3rd-person (Other) > Anime / Manga > Licensed","desc":"<p>Three years after the events that took place in the original Gungrave, the Corsione family has unleashed the deadly drug SEED upon the populace. Now it's up to Grave, Spike and Mika to follow the trail of SEED back to its source and eradicate it once and for all.</p><p>Much like its predecessor, <em>Gungrave: Overdose</em> offers up several action-packed levels that simply don't allow the player to let up on the fire button. This sequel ups the ante with even larger hordes of enemies to blast through along with a slew of destructible environments to wreak havoc in. Along the way, Grave will team up with newcomers Juji and Billy. Juji fights using a unique combination of close-range guns and swordplay, while Billy defeats his enemies with the sheer power of his electric guitar.</p><p>Gungrave: Overdose features character designs by Yasuhiro Nightow (creator of the anime/manga Trigun) and Kosuke Fujishima (known for his work on Sakura Wars, Ah My Goddess, and the Tales series), and soundtrack composition by Tsuneo Imahori (composer for Trigun, Hajime no Ippo and the Gungrave anime series). This game was released by Mastiff as a budget-priced title.</p>"},{"name":"Gungriffon Blaze","year":2000,"developer":"Game Arts Co., Ltd.","url":"PS2_COLLECTION_PART11/Gungriffon%20Blaze%20%28Europe%29.zip","filesize":359075220,"score":7,"genres":"Action > 1st-person > Behind view > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Gungriffon Blaze</em> is a 3D battlemech game. The game contains six scenarios with a multitude of free-roaming levels. The gameplay is mainly action-oriented, allowing to customize the player-controlled robot before it goes to fight, or within the game after picking up various extras. There are about forty different enemy types, including tanks, other mechs, etc. Much of the environment is destructible. The game only features single-player mode.</p>"},{"name":"Gunvari Collection + Time Crisis","year":2002,"developer":"Namco Limited","url":"sony_playstation2_g/Gunvari%20Collection%20%2B%20Time%20Crisis%20%28Japan%29%20%28With%20GunCon2%29.zip","filesize":894310379,"score":"","genres":"Action > 1st-person > Anime / Manga > Arcade > Mini-games > Party game > Shooter > Direct control","desc":"<p>A collection of previous Sony Playstation light gun shooters GunBullet, GunBarl, GunBalina (aka Point Blank Series) and Time Crisis, all on one single DVD for the Sony Playstation 2. </p><p>The first 3 titles are very popular arcade games, with cartoonish and super deformed art style, suitable for all ages. Each stage is very short, much in Wario Ware's vein (although these titles predate the Nintendo game). Time Crisis is the first installment of the famous Virtua Cop rival saga, made by Namco for the arcades and the Sony Playstation. The action is on rail with the character moving automatically after clearing each segment, the player can hide behind walls and objects while reloading and quickly studying the stage (time is limited though).</p>"},{"name":"Guy Game, The","year":2004,"developer":"Topheavy Studios"}]