[{"name":"H2O+ (DX Pack)","year":2008,"developer":""},{"name":"H2O+: Footprints in the Sand","year":2008,"developer":"Makura","url":"sony_playstation2_h/H2O%2B%20-%20Footprints%20in%20the%20Sand%20%28Japan%29.zip","filesize":3798699862,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Romance","desc":"<p><em>H2O+</em> is a port of a romantic adult visual novel known as H2O: Footprints in the Sand. The PS2 console port has all the adult CG event scenes removed but as an addition features a bonus heroine, expanded scenario, changed game system and full voice acting.</p>"},{"name":"Habitrail Hamster Ball","year":2004,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART11/Habitrail%20Hamster%20Ball%20%28Europe%29.zip","filesize":56292275,"score":"","genres":"Action > Racing / Driving > Behind view > Platform > Fantasy > Licensed","desc":"<p><em>Habitrail Hamster Ball</em> is an action game based around controlling a hamster encapsulated in a ball rolling through environments such as a castle or a children's playroom with platforms, small ledges and obstacles. There are two difficulty levels and two game modes: a 'normal' mode and a 'time attack' mode. A level is completed by rolling between finish posts. Moving forward without interruption builds up a speed meter and causes the hamster to go faster. The game supports local multiplayer games through split-screen for up four players racing each other on the same course.</p><p>The game carries the license of Habitrail hamster products and show general information about hamster and taking care of them in the opening screens. The main menu also has a hamster care guide.</p>"},{"name":"Hagane no Renkinjutsushi: Dream Carnival","year":2004,"developer":"Eighting Co., Ltd.","url":"sony_playstation2_h/Hagane%20no%20Renkinjutsushi%20-%20Dream%20Carnival%20%28Japan%29.zip","filesize":557017289,"score":"","genres":"Action > Side view > Anime / Manga > Fighting > Fantasy > Licensed","desc":"<p><em>Fullmetal Alchemist: Dorīmu Kānibaru</em> is a 3D cel-shaded versus fighting game played from a side view perspective and based on the Fullmetal Alchemist anime and manga series. In the game characters from the series participate in a fighting tournament in a two man team.</p><p>Playable characters include: Edward Elric, Alphonse Elric, Winry Rockbell, Lust, Gluttony, Scar, Roy Mustang, Riza Hawkeye, Alex Louis Armstrong and Maes Hughes. Each of the fighters can run and jump and has his/her own fighting techniques including special attacks. All fights are two vs two.</p>"},{"name":"Hakuoki: Demon of the Fleeting Blossom","year":2008,"developer":"Idea Factory Co., Ltd."},{"name":"Half-Life","year":2001,"developer":"Gearbox Software LLC","url":"PS2_COLLECTION_PART11/Half-Life%20%28Europe%2C%20Australia%29.zip","filesize":342068394,"score":7.5,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>The PlayStation 2 version of Half-Life is a port of the Windows game, but with a significant overhaul for the weapons and character models, as well as the overall map geometry and some extended levels.</p><p>It also includes an expansion pack that is referred to as <em>Half-Life: Decay</em>, which was never officially available as an expansion for the Windows game until it was eventually recreated as a modification. The third expansion for the original game, it features two-player cooperative gameplay (in split-screen) with the two female scientists Gina Cross and Colette Green as the protagonists. It is meant to be played with two players at the same time as it is more puzzle-oriented than the original game and the first two expansions. Singleplayer is also possible, but then switching between the two characters is necessary to advance. When not active, the other character is AI controlled for basic actions.</p><p>It is set at the same time of the events in the original <em>Half-Life</em>, but from the perspective of other characters. All enemies and weapons are based on the original game and many of the missions have a more friendly approach about working together or rescuing NPCs. Unique to the series as a whole is the lack of a single narrative; instead the add-on consists of fixed, separate missions. At the end of each mission, statistics are shown and the player is graded. When the nine levels are completed with an A grade, a bonus mission is unlocked where players control and work together as two Vortigaunts. As an additional bonus, the entire singleplayer can then also be completed as a Vortigaunt.</p><p>The game supports an USB mouse and keyboard for more precise control.</p>"},{"name":"Hametsu no Mars","year":2005,"developer":"Idea Factory Co., Ltd.","url":"sony_playstation2_h/Hametsu%20no%20Mars%20%28Japan%29.zip","filesize":1132555244,"score":"","genres":"Action > Adventure > 1st-person > Anime / Manga > Sci-fi / futuristic > Licensed","desc":"<p>The game is based on the anime series <em>Mars of Destruction</em>. In year 2016, mankind finally reaches the planet Mars. They gather Martian artifacts, intending to bring them to the Earth for further study. But a malfunction causes their spaceship to explode shortly before landing in Japan, and the artifacts fall onto the Earth, releasing a terrible virus that makes people insane and violent. A special unit called AAST is assembled to fight the threat. The group consists of five beautiful girls, the captain, and the protagonist Takeru. </p><p><em>Hametsu no Mars</em> is a Japanese-style adventure with action sequences. You'll battle against mutants in your protective suit, reacting quickly to the enemies' actions and attacking them with various degree of strength. Between battles you'll have enough time to talk to your lovely combatants, trying to make the right decisions and to conquer the affection of one of them.</p>"},{"name":"Hamster Heroes","year":2006,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART11/Hamster%20Heroes%20%28Europe%29.zip","filesize":42798888,"score":"","genres":"Action > Racing / Driving > Behind view > Platform > Direct control > Fantasy","desc":"<p><em>Hamster Heroes</em> is an action game based around controlling a hamster encapsulated in a ball rolling through environments similar to the concept of the Super Monkey Ball games. It builds on the concept of the earlier Habitrail Hamster Ball by the same developer and with very similar mechanics. The player steers a hamster through environments floating in the sky with small ledges and platforms to reach the exit without falling off. The game has a large amount of levels as small courses to complete and then move on, unlocking the next one. Levels can be played in a 'normal' mode or in a 'time attack' mode. Moving forward without interruption builds up a speed meter and causes the hamster to go faster. The game supports local multiplayer games through split-screen for up four players racing each other on the same course.</p>"},{"name":"Hannah Montana: Spotlight World Tour","year":2008,"developer":"Avalanche Software LLC"},{"name":"Hansel & Gretel","year":2007,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART11/Hansel%20and%20Gretel%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":499330204,"score":"","genres":"Puzzle > Fixed / flip-screen > Point and select","desc":"<p>Deep in the forest lives a poor woodcutter with his vicious wife and two nice children, Hansel and Gretel. The family are poverty stricken and cannot afford to eat.</p><p>The nasty wife convinces her husband to take the children into the woods and to leave them there.</p><p>What will become of the children?</p><p>Including various activities:</p><p>Watching Cartoons, Colouring, Pairs Activity, Jigsaw Puzzle, Sliding Puzzle</p>"},{"name":"Hanuman: Boy Warrior","year":2009,"developer":"Aurona Technologies Ltd.","url":"PS2_COLLECTION_PART11/Hanuman%20-%20Boy%20Warrior%20%28India%29%20%28En%2CHi%29.zip","filesize":335109629,"score":"","genres":"Action > 3rd-person (Other) > Asia > Fantasy","desc":"<p><em>Hanuman: Boy Warrior</em> is a 3D action game in which have to save the world and play as Hanuman an immortal being from Hinduism that has the appearance of a human with an ape face. </p><p>The game offers nine levels in which you have to defeat several creatures from Indian mythology. Hanuman is armed with a big mace and has the ability to jump and swing from rope to rope. Besides the normal attacks he can also preform special attacks.</p>"},{"name":"Happy Breeding","year":2003,"developer":"Purple Software Ltd"},{"name":"Happy Breeding: Cheerful Party (Shokai Genteiban)","year":2003,"developer":"","url":"sony_playstation2_h/Happy%20Breeding%20-%20Cheerful%20Party%20%28Japan%29.zip","filesize":627242706,"score":"","genres":"Special edition > Physical extras","desc":"<p>This First Print Limited Edition boxed release contains:</p><ul><li>Happy Breeding: Cheerful Party game</li><li>Special artbook (32 pages) containing colored illustrations, character comments, and making-of sketches</li></ul>"},{"name":"Happy Feet","year":2006,"developer":"Artificial Mind & Movement","url":"PS2_COLLECTION_PART11/Happy%20Feet%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1160783585,"score":4.8,"genres":"Action > Behind view > Puzzle elements > Licensed","desc":"<p>The <em>Happy Feet</em> game features the voices of Elijah Wood and Brittany Murphy, who reprise their roles from the movie. The game puts the player in the shoes of Mumble, a young penguin born into a nation of singing emperor penguins where each needs a heart song to attract a soul mate. And while Mumble is cursed with being the worst singer in the world, he just happens to be a great tap dancer.</p><p>Following the general story of the film, the game has you play as Mumble as he belly-sleds, dances, and swims through Antarctica on an adventure complemented by a playful and lively soundtrack. </p><p>The game consists of 3 types of gameplay. First, there is belly-sledding where you control Mumble sledding down a track trying to beat Ramon and the Amigos to the finish. Swimming will have you move Mumble around trying to avoid getting eaten by the evil leopard seal. In Dancing, you have to help Mumble's footwork as he tries to impress his friends and family.</p>"},{"name":"Hard Hitter Tennis","year":2002,"developer":"Magical Company Ltd.","url":"sony_playstation2_h/Hard%20Hitter%20Tennis%20%28USA%29.zip","filesize":242764597,"score":"","genres":"Action > Sports > 3rd-person (Other) > Tennis","desc":"<p><em>Hard Hitter Tennis</em> challenges you to become the best in the world. Choose one of 14 athletes or make your own, and grow your character's stats over the course of a year. Playing well during the game will increase the mentality meter, giving your player a better chance of making tough shots. The mentality meter can also be expended to make a shot that will be difficult to hit back. Whichever player has won the most money from tournaments by the end of the year is crowned champion.</p><p>Also included is a multiplayer mode for up to four players and a minigame mode where the player must either hit specific targets to spell out words, or hit a number of targets with a limited number of balls.</p>"},{"name":"Hard Knock High","year":2007,"developer":"Opus Studio Inc.","url":"PS2_COLLECTION_PART11/Hard%20Knock%20High%20%28Europe%29.zip","filesize":436274467,"score":"","genres":"Action > Side view > Fighting > Direct control > Martial arts","desc":"<p>RISE TO POWER AS \"GRIPPER\", HARD KNOCK HIGH'S GANG LEADER!<br>**HELP GRIPPER TO TAKE OVER ALL 9 SCHOOLS BY CHALLENGING THE LEADER OF EACH SCHOOL TO A FIGHT. PUNCH, SCRAP, GRAPPLE AND KICK <br>YOUR WAY TO THE TOP!BE THE TOUGHEST THUG IN THE NEIGHBOURHOOD!**<br><br>Start off fighting in your own school, building up your skills from simple punches and kicks to mastering special and combo attacks. There are up to 160 different moves and attacks you can master on your way to becoming No. 1!<br><br>MASTER LOADS OF COOL FIGHTING STYLES!<br><br>Fight your opponents with cool styles like Karate, Boxing, Judo, Professional Wrestling, Wu Shu and Sumo. There's no fighting styles that can stop you!<br><br>PIT YOUR FIGHTERS AGAINST EACH OTHER!<br><br>Train a number of fighters throughout the course of the game and then pit them against each other! Use your save data to start fights between your favorite characters.<br><br>MINI-GAMES TO STRENGTHEN YOUR FIGHTER!<br><br>Put Gripper through an assortment of mini-games to strengthen him! By clearing each of the mini-games, you can raise your his overall strength and learn new moves and attacks!</p>"},{"name":"Hard Rock Casino","year":2006,"developer":"FarSight Technologies Inc.","url":"PS2_COLLECTION_PART11/Hard%20Rock%20Casino%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":599171599,"score":5.4,"genres":"Gambling > 1st-person > Behind view > Top-down > Cards / tiles > Direct control > Licensed","desc":"<p><em>Hard Rock Casino</em> is a gambling simulation game which includes over 20 different gambling games including Slots, 5 various forms of Poker, Blackjack, Baccarat, Craps, Roulette and Pai Gow as well as horse race and sports betting. There are unique, and sometimes influential, NPC characters to meet and play against, side tasks to complete, invitation only tournaments and unlockables for enhancing your customized character. The game also features a tutorial accessed from the main menu</p><p>There are three game modes, Adventure, Quick Play, and Poker Tournaments. In Adventure mode the player creates an identity and starts in the Hard Rock Casino. They are free to play any game but must complete a set of goals before they can unlock the next casino. While playing at the Hard Rock they may also be asked to undertake challenges, or side tasks, in which they can earn extra money. In one such challenge a customer complains that a slot machine is broken because it does not pay out so the manager offers $100 as a reward for getting a winning line on that machines maximum bet.</p><p>Quick play allows the player access to all the games in the unlocked casinos playing as a randomly selected game character. Here there are no goals or challenges.Poker Tournaments gives the player instant access to the same poker tournaments that are available in both Adventure and Quick play modes however the Adventure mode has a greater variety of table limits. </p><p>There are four different casinos in which to play, each with its own games, house rules and table limits. Players start with a modest amount of money, $1000, in the Hard Rock. The object is, naturally, to win lots more and earn a high enough reputation to be able to play in invitation-only tournaments and high stakes games. The major goal is to become the \"Hard Rock High Roller\".</p>"},{"name":"Hardware: Online Arena","year":2003,"developer":"SCEE Studio London","url":"PS2_COLLECTION_PART11/Hardware%20-%20Online%20Arena%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":249419875,"score":6.7,"genres":"Action > Racing / Driving > 3rd-person (Other) > Shooter > Tank","desc":"<p><em>Hardware: Online Arena</em> is an online vehicle combat game, along the lines of Twisted Metal: Black ONLINE.</p><p>Players choose from a variety of tanks and jeeps before hopping into the thick of the action. Jeeps are faster but tanks have more armor. There are numerous pick-ups and weapons to be found such as missiles, lasers and even an air-strike, which kills everyone on the level, including the player themselves if they don't get under cover.</p><p>There 5 different environments; Arctic, Quarry, Ruins, Mayan Temple and Area 51. There are also 4 different game modes such as Deathmatch and King of the Hill. Though this is primarily an on-line game there is a single player training mode in which all of these levels can be played in any of the available vehicles</p>"},{"name":"Harley-Davidson: Race to the Rally","year":2006,"developer":"Sand Grain Studios","url":"sony_playstation2_h/Harley-Davidson%20Motorcycles%20-%20Race%20to%20the%20Rally%20%28USA%29.zip","filesize":2629248578,"score":5.7,"genres":"Racing / Driving > Behind view > Motorcycle > Street racing > Vehicle simulator > Licensed","desc":"<p><em>Harley-Davidson: Race to the Rally</em> is a motorcycle racing game that involves racing AI opponents across tracks coast to coast in America. There are 20 motorcycles licensed and designed after real Harley-Davidson's from Softail, Dyna, Touring, Sportster and others. The bikes can be tuned, styled and upgraded in ways which involve over 1000 possibilities according to the developers. The gameplay involves dodging traffic, obstacles and other drivers while gaining points for making jumps, drifting, drafting, kicking opponents off, speed boosting and your position during the race. The game accelerates at a high sense of speed when you drive using speed boost. Head on crashes with debris and such are shown in different angles. The game features licensed music from acts like George Thorogood, Heart, Poison, Great White and others.</p>"},{"name":"Harry Potter and the Chamber of Secrets","year":2002,"developer":"Electronic Arts UK Ltd.","url":"PS2_COLLECTION_PART11/Harry%20Potter%20and%20the%20Chamber%20of%20Secrets%20%28Europe%29.zip","filesize":603952951,"score":6.8,"genres":"Action > Behind view > Mini-games > Puzzle elements > Licensed","desc":"<p><em>Harry Potter and the Chamber of Secrets</em> follows the exploits of Harry during his second year at the Hogwarts School of Witchcraft and Wizardry. During his time there, Harry's classmates are coming under a mysterious paralysis and Harry must get to the bottom of what is happening.</p><p>The game involves Harry being given objectives to complete along with him having to go to class to learn spells. The game also has some mini-game diversions such as playing Quidditch, dunking gnomes in water, and collecting wizard cards.</p><p>Occasionally Harry will find himself in a combat situation. Harry can be equipped with up to three different spells at a time. If the player can make Harry cast a spell with correct timing, the spell will be more powerful than normal.</p><p>The PlayStation 2 version was ported internally by Electronic Arts instead of by Eurocom who developed the other console versions, hence the PS2 version sporting some noticeable differences. but otherwise keeping the majority of the game the same. Some differences include the PS2 version of the game having an overall lower difficulty level plus when Harry is riding a broom he can land it anywhere instead of only in designated landing spots. Speaking of platform differences, the GameCube version has an exclusive feature that allows the player to connect to the GBA game and unlock a new Wizard Card.</p>"},{"name":"Harry Potter and the Goblet of Fire","year":2005,"developer":"Electronic Arts UK Ltd.","url":"PS2_COLLECTION_PART11/Harry%20Potter%20and%20the%20Goblet%20of%20Fire%20%28Europe%29%20%28En%2CNl%2CSv%2CNo%2CDa%2CFi%2CPl%29.zip","filesize":1528520682,"score":6.5,"genres":"Action > 3rd-person (Other) > Puzzle elements > Fantasy > Licensed","desc":"<p><em>Harry Potter and the Goblet of Fire</em> is an action-adventure game that follows the story of the fourth movie and book of the same name. In addition to the usual challenges and dangers that Harry, Ron, and Hermione need to face, the Triwizard Tournament will be held at Hogwarts and mysteriously Harry is in the tournament!</p><p>One to three players control Harry, Ron, and Hermione (the computer controls the remaining characters for one and two-player games). Played with a third-person view, you will need to complete numerous game levels which feature a variety of action and puzzle-solving as well as completing the three tasks in the Triwizard Tournament and facing Lord Voldemort. Each character has magic spells that can be used to help out, and additional spells can be learned as you make your way through the game. Occasionally all three characters will need to work together to complete a task, such as moving a particularly large object or defeating a tough opponent. During the game you will come across Bertie Bott's Every-Flavor Beans; collecting these can help out by restoring stamina or magic powers. Additionally, at the end of each level, the Beans can be used to purchase collector cards; these are used to increase a character's abilities.</p>"},{"name":"Harry Potter and the Half-Blood Prince","year":2009,"developer":"EA Bright Light","url":"PS2_COLLECTION_PART11/Harry%20Potter%20and%20the%20Half-Blood%20Prince%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CEs%2CIt%2CNl%2CPt%2CPl%2CRu%2CCs%2CHu%29.zip","filesize":2243876987,"score":6.1,"genres":"Action > Behind view > Fantasy > Licensed","desc":"<p><em>Harry Potter and the Half-Blood Prince</em> is based on the movie of the same name. The player takes the role of Harry Potter who has to fight against Lord Voldemort and his minions. </p><p>The game is not completely linear - between the chapters Harry can explore the school at his own leisure. If the player does not want to walk and search around, they have two ways to cut a corner: portraits, which are unlocked during the course of the game, can be used to teleport instantly to another place. Harry can also call a ghost which shows him the fastest way to the next mission. Exploration has mostly one goal: finding the 150 (more or less) hidden crests which unlock achievements and trophies. Because Harry lost his ability to jump and climb, he has to use spells to reach them.</p><p><strong>Mini Games</strong>  </p><p>The player will spend most of his time in three mini games: magic duels, brewing potions, and quidditch. The duels are used to learn new spells respectively improve the already known. Harry basically faces other magicians and uses his spells to defeat them, e.g. by paralyzing them or by parrying their spells. To perform a spell the player has to use his input device to recreate a certain movement.</p><p>Quidditch is a reaction test. Harry's broom flies automatically and the player can only slightly move it to fly through rings or avoid obstacles. While brewing potions Harry faces a bowl, ingredients and a time limit. Now he simply needs to recreate the receipt by using the ingredients in the correct on the bowl. Sometimes he needs to heat up the bowl or stir the brew up with his input device. If he makes a mistake there is smoke which costs time.</p>"},{"name":"Harry Potter and the Order of the Phoenix","year":2007,"developer":"Electronic Arts UK Ltd.","url":"sony_playstation2_h/Harry%20Potter%20and%20the%20Order%20of%20the%20Phoenix%20%28Europe%29%20%28En%2CNl%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":3613182886,"score":6.5,"genres":"Action > 3rd-person (Other) > Puzzle elements > Quick Time Events (QTEs) > Fantasy > Detective / mystery > Licensed","desc":"<p>Based off the fifth book and movie of the series, players take control of Harry Potter in this 3D adventure as he faces the dangers of his fifth year of Hogwarts, avoiding the malicious Professor Dolores Umbridge, builds Dumbledore's Army, and faces off with Voldemort himself as the prophecy continues to unfold.</p><p>Players will navigate through the castle of Hogwarts and beyond, learning fifth year spells, solving multiple puzzles, avoiding traps, and even get a chance to play as the Weasley brothers, Sirius Black and Dumbledore himself. </p><p>All versions are the same with the exception of the Wii.  Players can use the Wiimote as Harry's wand to cast spells, allowing a new level of control never before possible in a Harry Potter game.  </p><p>Survive the year, learn new spells, and survive one of the darkest battles in Harry's life as he faces his first real battle against Voldemort, \"He-Who-Must-Not-Be-Named\"!</p>"},{"name":"Harry Potter and the Prisoner of Azkaban","year":2004,"developer":"Electronic Arts UK Ltd.","url":"PS2_COLLECTION_PART11/Harry%20Potter%20and%20the%20Prisoner%20of%20Azkaban%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.zip","filesize":2935121703,"score":6.5,"genres":"Action > 3rd-person (Other) > Puzzle elements > Fantasy > Detective / mystery > Licensed","desc":"<p>Based on the third book and movie of the series, players now take control of Harry, Ron, and Hermione in this 3D adventure as they face the dangers of their third year of Hogwarts, avoiding the soul-stealing Dementors, and trying to solve the mystery of escaped convict Sirius Black. </p><p>Players will navigate through the castle of Hogwarts and beyond, as they learn new spells and how to work together as a team, solving multiple puzzles and avoiding traps that will either require teamwork, or one of the kid's particular skills.  Harry can leap across chasms and climb ropes.  Ron can sense secret areas.  Hermione, being the smallest, can fit into areas where the others can't.  Players can also control Hedwig the owl, or Buckbeak the hippogriff to accomplish other tasks and overcome obstacles.</p><p>Survive the year, learn new spells, and discover the truth of Sirius Black's role during the night Harry became known as \"The Boy Who Lived\".</p>"},{"name":"Harry Potter and the Sorcerer's Stone","year":2003,"developer":"Warthog Games Ltd.","url":"sony_playstation2_h/Harry%20Potter%20and%20the%20Sorcerer%27s%20Stone%20%28USA%29%20%28En%2CEs%29.zip","filesize":1496896462,"score":6.4,"genres":"Action > 3rd-person (Other) > Fantasy > Licensed","desc":"<p>Two years after versions on other platforms, the then-current consoles got their own adaptation of the first Harry Potter book and film. Like in the computer and PlayStation versions, Harry Potter's first year at school of magic Hogwarts is presented as a 3D action-adventure title.</p><p>After a tutorial at Ollivander's Wand Shop and an introductory first night at Hogwarts, the game is organized into distinct days and nights. Days mostly consist of lessons, where usually Harry will learn new spells. The more interesting stuff happens at night, of course, when Harry sneaks around the castle to do things like meeting Draco Malfoy for a duel, fighting a troll in the dungeons, and other important scenes from the film and book.</p><p>Most tasks involve platform sections, where Harry has to jump over chasms and balance along edges. Often, creatures will be in the way that have to be fought using the correct spells, and magic must also be used to solve the occasional puzzle. At night, Harry must watch out for prefects patrolling the floors of the castle to avoid getting sent back to the common room. There's also broomstick flying in the game, including a Quidditch match against Slytherin.</p><p>After classes, Hogwarts can be freely explored. At any time, it is possible to revisit school lessons to get better grades, often only possible after some more advanced spells have been learned. Also, lots of collectibles can be found both in the open and hidden areas: collecting 20 wizard cards increases Harry's health and Every Flavour Beans can be traded in Fred and George's shop for more cards and some other useful items.</p>"},{"name":"Harry Potter Collection","year":2007,"developer":""},{"name":"Harry Potter: Quidditch World Cup","year":2003,"developer":"Electronic Arts UK Ltd.","url":"PS2_COLLECTION_PART11/Harry%20Potter%20-%20Quidditch%20World%20Cup%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%29.zip","filesize":1901529337,"score":6.6,"genres":"Sports > 3rd-person (Other) > Fantasy > Licensed","desc":"<p>Quidditch, the broomstick and ball “sport” of the Harry Potter world comes to life in this simulation.  For those unfamiliar with the game, two seven-player teams of flying wizards attempt to score goals with one ball while dodging more flying balls and each other.  For those who are familiar with the game, you will be happy to know that the players, positions, and “strategies” of Quidditch are faithfully recreated.</p><p>The game starts with a player selecting which of the four Hogwarts school teams he or she wishes to play for.  Following some tutorial events, they are launched into the competition for the Hogwarts Cup against the other three teams.  As the player wins games and completes specific challenges (such as “score 120 points in one game”) they collect Quidditch cards which unlock special combo moves.  Once a player has won the school championship, they can go on to play as one of nine international teams competing for the Quidditch World Cup each with its own style and special combo moves.  After winning the cup once, there are still more cards to be collected by playing and winning as different teams.</p><p>People familiar with actual sports know that the rules of Quidditch (as described in Rowlings' books) are fundamentally flawed and that the only meaningful part of the game is the 1 on 1 competition between the two seekers trying to catch the golden snitch.  Quidditch World Cup alleviates this problem with the “golden snitch bar”.  As the game progresses, completing action combos and performing special moves adds to a team progress bar.  Eventually, when the snitch appears, the team with better positioning on the bar will start with an advantage in the chase.  Ironically, this system rewards things other than actual scoring so in-game goals still remain mostly meaningless (except on lower difficulty levels where it is very easy to build a 160+ point lead and make the snitch inconsequential).</p><p>Because it is designed for younger audiences, Quidditch World Cup lacks most of the advanced features you would expect in an EA sports game (league play, team management, etc…).  It also lacks any multiplayer options other than two-player (same machine) exhibition matches</p>"},{"name":"Haru no Ashioto","year":2006,"developer":"minori"},{"name":"Harukanaru Toki no Naka de 3","year":2004,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_h/Harukanaru%20Toki%20no%20Naka%20de%203%20%28Japan%29.zip","filesize":1147130688,"score":"","genres":"Adventure > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy","desc":"<p>The games tells a story of Nozomi Kasuga and her two friends encountering a strange boy at their high school, who sends them hurtling across time and space to a place in another world called Kyō.</p>"},{"name":"Harukanaru Toki no Naka de 3: Izayoiki","year":2005,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_h/Harukanaru%20Toki%20no%20Naka%20de%203%20-%20Izayoiki%20%28Japan%29.zip","filesize":1500484921,"score":"","genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Visual novel > Fantasy","desc":"<p>Izayoiki is a side story that adds a new main story route for <em>Harukanaru Toki no Naka de 3</em> to be unlocked as well as various other extras such as new illustrations and voices.</p>"},{"name":"Harukanaru Toki no Naka de 4","year":2008,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_h/Harukanaru%20Toki%20no%20Naka%20de%204%20%28Japan%29.zip","filesize":726885642,"score":"","genres":"Adventure > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy","desc":"<p>Chihiro Ashihara is a high school girl with no memory of her past, who lives together with her classmate Nagi and teacher Kazahaya, and who believes that her future -- indeed, her destiny lies elsewhere. One day, a man named Hiiragi appears before them, explaining that Chihiro is in fact the princess of his kingdom. He whisks the three of them off to his world, a war-ravaged land on the brink of collapse, where she must work together with her companions to rebuild a lost kingdom, form alliances with many people, and perhaps even find true love.</p><p><em>Harukanaru Toki no Naka de 4</em> is a fantasy romance game with light RPG elements aimed at a female audience. The game is a Japanese-style adventure game with 3D exploration and RPG-style battles added in. Interactions with other characters will affect the story path and romantic interest between characters, leading to several different endings. During battles, up to four characters can be in the party, but the player only directly controls Chihiro; other characters' actions are controlled automatically.</p>"},{"name":"Harukanaru Toki no Naka de: Yume no Ukihashi Special","year":2009,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_h/Harukanaru%20Toki%20no%20Naka%20de%20-%20Yume%20no%20Ukihashi%20Special%20%28Japan%29.zip","filesize":1181738255,"score":"","genres":"Adventure > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based strategy > Fantasy","desc":"<p>Harukanaru Toki no Naka de: Yume no Ukihashi is a crossover game of the first three Haruka entries. The Special edition features new romance routes, new and additional voices, 24 save slots, and much more.</p>"},{"name":"Harvest Moon: A Wonderful Life (Special Edition)","year":2005,"developer":"Marvelous Interactive, Inc.","url":"sony_playstation2_h/Harvest%20Moon%20-%20A%20Wonderful%20Life%20-%20Special%20Edition%20%28USA%29.zip","filesize":476980819,"score":"","genres":"Simulation > 3rd-person (Other) > Real-time > Managerial / business simulation","desc":"<p><em>Harvest Moon: A Wonderful Life</em> is the second game in the Harvest Moon series to appear on the PS2. It is almost identical to the original GameCube version, but carries some new features, granting it the Special Edition title, as there is no regular release for this platform.</p><p>The game simulates the everyday chores of farm life. When the player's character arrives in the Forget-Me-Not-Valley, he is given a tour on his new farm and starts with some seeds and a single cow. The game is divided in different chapters that end when certain requirements are met. Tasks include raising cattle and taking care of them, fishing, cooking, sowing seeds, and trading your goods with the local merchants. The player can also explore the valley and meet its inhabitants.</p><p>New features for the PS2 version include up to four wives to marry, to have a son or a daughter with a mini career path, new farming equipment such as the fertilizer machine, and a free play mode to continue playing when all the chapters have been completed.</p>"},{"name":"Harvest Moon: Save the Homeland","year":2001,"developer":"Victor Interactive Software, Inc.","url":"sony_playstation2_h/Harvest%20Moon%20-%20Save%20the%20Homeland%20%28USA%29.zip","filesize":75871636,"score":7.2,"genres":"Simulation > Top-down > Anime / Manga > Managerial / business simulation","desc":"<p>The first Harvest Moon game for the PS2 takes a little deviance from all the other games in the series.  The goal this time around is to save your town from being turned into a resort next year.  The game focuses more on relationships than making money - which is the goal in all other Harvest Moon games to date.  You still are running a farm and must succeed in the life of a farmer, but the actual gameplay rewards those who interact with the townspeople over those who just work the fields.</p>"},{"name":"Harvey Birdman: Attorney at Law","year":2008,"developer":"High Voltage Software, Inc.","url":"sony_playstation2_h/Harvey%20Birdman%20-%20Attorney%20at%20Law%20%28USA%29.zip","filesize":1970935540,"score":6.4,"genres":"Adventure > Full Motion Video (FMV) > Puzzle elements > Licensed","desc":"<p>Harvey Birdman: Attorney at Law is based off of the Adult Swim show of the same name.  The game is more of an interactive story that leads your through five separate cases and features characters from the TV show.</p><p>The gameplay is mostly consistent of exploring crime scenes, finding evidence, talking to cartoon character witnesses and give try to prove the innocence of your client by any needs necessary.  You only are allowed five crests during your court hearing, losing all five when making a mistake will result in having to restart back at the last checkpoint and starting over again.</p><p>Picking certain moves while talking to other people can result in extra crests for your court hearing or even unlock a Street Fighter cameo (Guile, Dhalsim, Zangief, Ryu and Chun Li) that will unlock a secret movie that you can view.</p>"},{"name":"Hasbro Family Game Night","year":2008,"developer":"EA Bright Light","url":"PS2_COLLECTION_PART11/Hasbro%20Family%20Game%20Night%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CEs%2CNl%29.zip","filesize":190689686,"score":6.4,"genres":"Puzzle > Strategy > 1st-person > Side view > Top-down > Turn-based > Board game > Word construction > Naval / watercraft > Licensed","desc":"<p><em>Hasbro Family Game Night</em> is a mini-game collection of conversions of Hasbro board games. It contains the classic versions as well as advanced or remixed variants. The game is hosted by Hasbro's toy figure Mr. Potato Head.</p><p>The includes games are:* Battleship</p><ul><li>Boggle</li><li>Connect 4</li><li>Scrabble (North American versions only, PS3 (PSN) and Xbox 360 retail + XBLA)</li><li>Sorry!</li><li>Sorry! Sliders</li><li>Yahtzee</li></ul><p>There is no retail PS3 release. On the Xbox 360 it was also released on XBLA next to a retail version. There it was made available as a free application where users can buy the individual games to be played through the <em>Hasbro Family Game Night</em> hub, similar to <em>Game Room</em>. Not all games were released simultaneously on XBLA and three additional titles are available for that platform:* Connect 4x4</p><ul><li>Jenga</li><li>Pictureka</li></ul><p>Those three games are also available for the Wii, but as a part of the retail game Family Game Night 2.</p><p>The Wii version includes a Party mode (only for human players) with a mixed-up mish-mash of each of the six games and rules similar to the Mario Party series. Most games can be played with up to four players, except for the PlayStation 2 version where only two players can compete.</p>"},{"name":"Hatsukoi: First Kiss","year":2005,"developer":"PrincessSoft","url":"sony_playstation2_h/Hatsukoi%20-%20First%20Kiss%20%28Japan%29.zip","filesize":787958091,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Hatsukoi: First Kiss</em> is the PlayStation 2 port of the Windows hentai visual novel Hatsukoi, with removed adult content and reduced rating. The story revolves around a high-school students, featuring Minoru Hatsushima as a protagonist. Following day-to-day lives of the students, Minoru's wish to find himself a girlfriend stars when a couple of his friends start to date each other. With many cute girls in his class and senior classes, he will find himself in a situation where his first love can be any of those girls. The game features typical visual novel commands such as checking the history log, selecting choices that may branch the story and progressing through the dialogues with other characters. Character animation is non-existent, but they vary in poses and facial expressions during dialogues.</p>"},{"name":"Hatsukoi: First Kiss (Shokai Genteiban)","year":2005,"developer":""},{"name":"Haunting Ground","year":2005,"developer":"Capcom Co., Ltd.","url":"PS2_COLLECTION_PART11/Haunting%20Ground%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":4178689028,"score":7.3,"genres":"Adventure > 3rd-person (Other) > Cinematic camera > Real-time > Puzzle elements > Survival horror > Horror","desc":"<p>In <em>Haunting Ground</em> you play as Fiona Belli, a young girl who has lost her memory. She awakens in a basement of a strange castle, and soon learns that a car accident has taken away the lives of her parents. She is told that the has inherited the castle she found herself in. However, the castle inhabitants are, for various reasons, not very happy to see Fiona as the new owner. Soon she realizes that she must fight for her life, and the only creature she can trust is a dog called Hewey, who will be her faithful companion on her perilous adventure.</p><p><em>Haunting Ground</em> is a horror game that centers around avoiding combat and escaping from your enemies. Fiona can fight, but usually she is too weak to defeat her foes in combat, so she will have to run away, hide, and use items as distraction until the enemy loses sight of her and she is able to continue exploring. The most important gameplay tool is your dog. You can issue commands to the dog, telling him to scout a room for you, warn you of upcoming enemies, defend you in battle, pick up items, etc. The dog will obey or disobey you depending on how you develop your relationship with him. If you are nice to the dog, pet him and give him food, he will follow your commands more efficiently.</p>"},{"name":"Haven: Call of the King","year":2002,"developer":"Traveller's Tales (UK) Ltd.","url":"PS2_COLLECTION_PART11/Haven%20-%20Call%20of%20the%20King%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2224079996,"score":7.1,"genres":"Action > Racing / Driving > 1st-person > 3rd-person (Other) > Platform > Puzzle elements > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>The King Athellion has left his homeworld to fight in an intergalactic crusade. He left behind a huge bell - The Golden Voice - for his people to call him should they ever be in danger. During his absence however, the evil Lord Vetch invades the planet and enslaves Athellion's people by infecting them with a deadly virus. A virus, that requires a constant treatment with an antidote called catana. As the only one controlling the catana-support, Lord Vetch was easily able to force everyone to work for him. In order to prevent Athelion's return he has hidden The Golden Voice and soon it was forgotten along with the king's promise. Forgotten until Haven, one of the slaves, starts having dreams about a hill and a bell; dreams whose meaning he does not understand. When the news of Haven's dreams reach Lord Vetch, he orders to murder him. Haven manages to escape and eventually learns about the real meaning of his dreams and is determined to find The Golden Voice and put an end to Lord Vetch's reign.</p><p>Haven is a fast-paced, action-packed platformer but it also incorporates elements of several other genres.Haven can pick up many different weapons and parts of the game play more like a Shoot'Em Up than a platformer. There are also several vehicles to control, ranging from speedboats and jetcars to gliders, spaceships and jetpacks. Despite all these action elements, there are also some slower paced levels, which put more emphasis on puzzle-solving and exploration.</p><p>Haven's conceptual artwork was done by Rodney Matthews, a fairly well-known English sci-fi/fantasy artist, which is evident in Haven's surrealistic, bizarre design.</p>"},{"name":"Hawk Kawasaki Racing","year":2006,"developer":"Infusion Games Ltd","url":"PS2_COLLECTION_PART11/Hawk%20Kawasaki%20Racing%20%28Europe%29.zip","filesize":168096338,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Motorcycle > Track racing","desc":"<p>Open up the throttle and crank through the gears of the awesome 200BHP Superbike from the Hawk Racing Team, part of the world-renowned British Superbike Championship! Developed in close association with the Hawk Racing team, and with additional license support of such leading manufacturers as Arai, Renthal and Dunlop tyres, HAWK SUPERBIKE RACING offers the ultimate superbike experience!<br><br>*Featuring 14 circuits in both normal and reversed modes<br>*Race Superbikes and Super-Sidecars in ‘Production’ and ‘Race Tuned’ classes<br>* Experience the thrills and spills of wet weather racing<br>* Thrash it out head-to-head in the multiplayer modes</p>"},{"name":"Headhunter","year":2002,"developer":"Amuze AB","url":"PS2_COLLECTION_PART11/Headhunter%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2936644029,"score":7.6,"genres":"Action > Racing / Driving > Behind view > Quick Time Events (QTEs) > Sci-fi / futuristic","desc":"<p>Welcome to the future. In the early 21st century, gang warfare and crime have lead to the creation of privatised law enforcement. The Anti-Crime Network (ACN) employs bounty hunters known as ‘Headhunters’ to track down the most wanted criminals, using combat skills and high-tech weaponry. </p><p>You are Jack Wade, an ex-cop turned Headhunter. At the beginning of the game you find yourself strapped to an operating table and manage to escape. After passing out in an alley, you awake in hospital from a coma. With your license revoked and few memories, you are hired by Angela Stern, to find her fathers murderer. Maybe you’ll even find out what happened to yourself if you can stay alive long enough…</p><p>Headhunter is an action adventure viewed from over the shoulder. In the top right of the screen you have a radar which will track your movements and those of the enemy. Jack has a few moves at his disposal. He can duck and roll, push, pull and climb objects as well as flatten himself up against a wall. Using this technique he can peek around corners for a better view of the action, and then attack from this position, using the wall as protection.</p><p>Between levels, Jack has a motorcycle that he uses to transport himself between various locations in the city according to the clues he receives. You will need to earn skill points however before you can arrive at a destination. Certain parts of the city are unavailable until you have gained the appropriate Headhunter license.</p><p>As you have no recollection of your past, you have to take a series of licenses that will grant you access to greater parts of the city, weaponry and gadgets. These are taken in a VR simulator known as the Law Enforcement Intelligence and Licence Approval (LEILA). At various times in the game you will need to go to the LEILA building and upgrade your licence by practising your combat, stealth and driving skills.</p><p>Jack will need to pass LEILA tests in order to grant him access to the equipment dispensers. He starts the game with a standard issue Stimulator Automatic, but can acquire grenades, proximity mines, neurostunners, decoy shells, shotguns and automatic weapons as he progresses. The weapons in the game fire Electric Neural Projectiles (ENP’s) instead of bullets. These cause brain death so as to preserve the internal organs of the person being shot.</p><p>Jack also uses a CASIO Visual Manager to keep in touch with Angela and his former chief at the ACN. This is a wristwatch with video capabilities and a direct link to the LEILA database.</p>"},{"name":"Headhunter: Redemption","year":2004,"developer":"Amuze AB","url":"PS2_COLLECTION_PART11/Headhunter%20-%20Redemption%20%28Europe%29.zip","filesize":2885067934,"score":6.7,"genres":"Action > 1st-person > 3rd-person (Other) > Sci-fi / futuristic","desc":"<p>In the 21st century, a dreadful virus wiped out millions. The vaccine was found, but at the time the world was engulfed into chaos. A new world order emerged, splitting the world into two distinct yet dependent worlds: Above and Below.</p><p>The world Above reflects a chrome city, a high-rise, high-tech metropolis served by elevators and elevated freeways. A place for hardworkers and law-abiding people. On the contrary to Above, the world Below, which is the product of earthquake damages, is a subterranean network of labour colonies. Those who are not wanted Above for one reason or another are sent Below.</p><p>One day, now veteran Headhunter, Jack Wade, took a call to investigate an intrusion to the upper levels. Facing the trespasser, Jack saw a potential in the girl and instead of turning her in, he gave her a second chance... to become his apprentice. Jack is back, but this time, he's not alone but accompanied by his sidekick Leeza X. Together, they will face whatever threat lurks from the world Below.</p><p>The gameplay is set in 3rd-person view with ability to rotate camera or set it behind your back at the single click. Headhunter's main accessory is IRIS (Intelligent Realtime Information Scanner). Once you get the IRIS, you'll be able to scan every item just by pointing the gun at it, or use the scanner in 1st-person view which will let you examine the surroundings in more detail. Also, IRIS will provide you with a full 3D map info even displaying the enemies so you can avoid them or use stealth if necessary. Enemies will hear you running and shooting, so if you decide to take an action, be aware that they will surround you and launch a team strike at you from all the sides. You only effective aid against them, beside your weapon, of course, is the ability to perform a roll or lean against the walls and fire from the corners, although aiming itself may not be easy as your hand will not be steady while on the move or panicking.</p>"},{"name":"Heartbeat Boxing","year":2003,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART11/Heartbeat%20Boxing%20%28Europe%29.zip","filesize":171578222,"score":"","genres":"Sports > Side view > Anime / Manga > Boxing","desc":"<p><em>Heartbeat Boxing</em> is a straightforward 3D boxing game featuring an all-female cast, built off the earlier Boxing Champions from the same developer. The nine characters are divided into three weight classes, and each have the usual array of punches, jabs, and uppercuts, as well as their own unique special moves. Two additional characters, as well as extra costumes, can also be unlocked.</p><p>The game features several different modes. There is a single-player Tournament (story) mode, a two-player versus mode, a survival mode, and a practice mode. There is also a View mode where the different outfits and character animations can be freely viewed.</p>"},{"name":"Heatseeker","year":2007,"developer":"IR Gurus Interactive Pty Ltd.","url":"PS2_COLLECTION_PART11/Heatseeker%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2766773719,"score":6.2,"genres":"Action > 1st-person > 3rd-person (Other) > Arcade > Shooter > Flight / aviation > Licensed","desc":"<p><em>Heatseeker</em> is an arcade aerial blaster in which the player flies nearly 40 fully-licensed modern jet fighters at supersonic speeds, firing huge numbers of missiles at vast numbers of enemy planes, tanks, ships, cruise missiles and anything else that looks in need of being taught a lesson. It features the ImpactCam, which lets you watch the effects of your destruction up close and personal, avoiding the long-distance 'blip killing' often found in other flight games.</p><p>Players take on the role of pilot, Mike 'Downtown' Hudson, who flies for the International Council's Air Force. A dictator has launched a terrorist attack - you are part of the response to fight sea and airborne enemies in an attempt to avert an international crisis. Missions take place on locations all over the world.</p><p>Heatseeker's arcade presentation includes infinite ammo, huge kill counts, a colourful, saturated look, and over-the-top characters and scenarios.</p><p>In the Wii version, players can use physical movements to control the aircraft. The plane can either be steered using the Wii remote as a pointer, or with the Nunchuk as a flight stick.</p><p>The PSP version has no voice-overs, only text; it is also the only version to support multiplayer games - up to 4 players in 5 game modes: Dogfight, Team Dogfight, Base vs Base, Fox &amp; Hounds, and Last Man Flying.</p>"},{"name":"Heavenly Guardian","year":2008,"developer":"Joyfulstar Inc.","url":"sony_playstation2_h/Heavenly%20Guardian%20%28USA%29.zip","filesize":46143613,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Shooter > Fantasy","desc":"<p>Heavenly Guardian is a scrolling shooter similar to the Pocky and Rocky series. The game's story involves Sayuki, the game's protagonist, who must save her beloved from a curse by finding the correct ingredients for a cure. The game can be played either singleplayer or multiplayer with another person. Sayuki is also followed by Toto, her pet snow rabbit, which can shoot freezing shots at enemies.The player can move Sayuki (or Sayuki's younger sister Koyuki in multiplayer) in any direction using the Nunchuck on the Wii or the Analog Stick on the Playstation 2. In two player mode, it is a contest to see which of the sisters can destroy the most ghosts and collect the most snowballs in their path. The Wii version offers you to shoot with the Wii pointer, but the Playstation 2 version eliminates this feature. There is also a boss attack you can play once you beat a boss.</p>"},{"name":"Heavy Metal Thunder","year":2005,"developer":"Media.Vision Entertainment Inc.","url":"sony_playstation2_h/Heavy%20Metal%20Thunder.%20%28Japan%2C%20Asia%29.zip","filesize":3870126300,"score":"","genres":"Simulation > 3rd-person (Other) > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p>In the year 2980 CE, recent breakthroughs in robotics technology have brought a surge in the popularity of robots, called the Heavy Metal Revolution. \"Robot Wrestling\", fights between superpowered miniature robots, only about 30cm tall, have become the most popular sport all over the world. Denki Akihabara, a student at Hagane-cho Middle School, has just heard from his father for the first time in ten years on his 15th birthday. Unfortunately for Denki, his father has gone and entered him into the world's most prestigious Robot Wrestling tournament with a brand new high-spec robot. Denki must now give everything he has to win the tournament and become stronger, prove himself to the girl he loves, and finally show up his father.</p><p><em>Heavy Metal Thunder</em> is a turn-based robot fighting simulation game. On each turn, each player selects a command for their robot, which will counteract each other similar to a match of <em>Rock, Paper, Scissors</em>. However, making things more interesting, certain combinations will build the robots' heat and synchro gauges. The higher the heat gauge is, the stronger that robot's attack, but if it fills completely, it becomes unable to attack. The synchro gauge, on the other hand, will allow for different special attacks depending on what level it reaches. The goal of each round is to knock out the other player's robot.</p><p>Between battles, the player can visit a shop to purchase and upgrade parts for their robot. Apart from the main story mode, there is also a straight ranking battle mode where the player must defeat multiple opponents in succession, as well as a versus battle mode where two players can pit their robots against each other. However, neither mode becomes available until the story mode is completed.</p>"},{"name":"Hello Kitty: Roller Rescue","year":2005,"developer":"Typhoon Games (Hong Kong) Ltd.","url":"PS2_COLLECTION_PART11/Hello%20Kitty%20-%20Roller%20Rescue%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1067055531,"score":6.5,"genres":"Action > 3rd-person (Other) > Anime / Manga > Platform > Puzzle elements > Licensed","desc":"<p>When Sanrio Town is invaded by the evil King Block and his minions, only one skating kitten can save the day! Hello Kitty must battle the villainous block troops that have kidnapped Hello Kitty's friends and family.</p><p><em>Hello Kitty: Roller Rescue</em> is an action platform game where the player controls Hello Kitty and battle through various captured levels of Sanrio Town. The player also gets the option of a computer-controlled partner to help battle the villains. Partners include My Melody, Purrin, and Monkichi. Each partner has their own special attack or ability that can help Hello Kitty out.</p><p>As they progress through the game, players can unlock movie clips and music from the game. They can also unlock character bios on various characters in the Hello Kitty Universe, as well as different outfits for Hello Kitty to wear and new weapons for her to use.</p>"},{"name":"Heracles: Battle with the Gods","year":2006,"developer":"Neko Entertainment SARL","url":"PS2_COLLECTION_PART11/Heracles%20-%20Battle%20with%20the%20Gods%20%28Europe%29.zip","filesize":217825317,"score":"","genres":"Action > Side view > Platform > Direct control > Classical antiquity > Fantasy","desc":"<p><em>Heracles: Battle with the Gods</em> is a 3D platform game staring Heracles (Hercules). After flying around on the back of Pegasus, Heracles returns him to the stable. While walking away suddenly he hears a lot of noise and returns to the stable. Finding his precious Pegasus stolen by Poseidon. Heracles begs his father Zeus to help him save his Pegasus. Zeus offers his son magical wristbands that are able to create stone arches to assist him and save Pegasus.</p><p>The game can be played on three difficulty modes: easy, medium and hard. Gameplay includes platforming using the wristbands to create the stone arches to reach higher areas. As well as collecting coins and defeating various beasts and mythological creatures.</p>"},{"name":"Heracles: Chariot Racing","year":2007,"developer":"Neko Entertainment SARL","url":"PS2_COLLECTION_PART11/Heracles%20-%20Chariot%20Racing%20%28Europe%29%20%28En%2CFr%29.zip","filesize":97383462,"score":"","genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Classical antiquity > Fantasy","desc":"<p><em>Heracles: Chariot Racing</em> is a 3D racing game staring Heracles (Hercules) and several mythological creatures from Greek mythology competing for the title Champion Charioteer. The game has several modes like championship, single race and time trial.</p><p>When racing against the AI three difficulty modes can be selected: easy, normal and hard. Aside from Heracles the following nine characters can be chosen: Koboldo, Snake, Medusa, Minitaur, Beesy, Satyre and Poseidon and Leares. The ten tracks feature five different landscapes and the player can compete in three cups: the Bronze, Silver and Golden trophy. On the track are items that can help the player to win the race like lighting, shields, fireballs and speed strips.</p>"},{"name":"Herdy Gerdy","year":2002,"developer":"Core Design Ltd.","url":"PS2_COLLECTION_PART11/Herdy%20Gerdy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3066673756,"score":6.6,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements","desc":"<p>Gerdy, an apprentice herder, embarks on a quest to rescue his father from an evil spell. His journey takes him across an island of diverse territories, populated by an assortment of wild creatures, each of which form part of a complex inter-related food chain. To avenge his father's nemesis and restore goodness to the island, Gerdy must hone his herding skills and ultimately compete in a tournament to become Master Herder.</p><p><em>Herdy Gerdy</em> is primarily a platform game with strategy and puzzle elements. The levels involve Gerdy traversing hazardous areas with timed jumps, avoiding or destroying obstacles. However, a significant portion of the gameplay is dedicated to collecting various animals, leading them onto a safe path, similarly to Lemmings. Each of the animals has its own behavior and skills (e.g. swimming), requiring the player to utilize different tactics to capture them.</p>"},{"name":"Herkules","year":2004,"developer":"The Code Monkeys Ltd."},{"name":"Heroes of Might and Magic: Quest for the DragonBone Staff","year":2001,"developer":"New World Computing, Inc.","url":"PS2_COLLECTION_PART11/Heroes%20of%20Might%20and%20Magic%20-%20Quest%20for%20the%20DragonBone%20Staff%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":730765674,"score":6.5,"genres":"Strategy > Diagonal-down > 2D scrolling > Isometric > RPG elements > Fantasy","desc":"<p>Heroes of Might and Magic: Quest for the DragonBone Staff is really the old classic King's Bounty from New World Computing for the PC with revamped graphics. Very little else has changed, in fact even the text was the exact same with the original.</p><p>For those who are not familiar with the history of the series, King's Bounty was a spin-off of the Might &amp; Magic RPG series which was then still in its early chapters and was inspired by board games. The gameplay resembles a simplified Heroes of Might &amp; Magic game with only one Hero and no city improvements. Combat is turn-based using a set grid and stacked units.</p><p>The goal of the game is to discover an ancient artifact by collecting pieces of a map and identifying its location before time runs out. Of course the player must have amassed a strong army by then because he will have to face the evil Dragon overlord before the end.</p>"},{"name":"Heroes of the Pacific","year":2005,"developer":"IR Gurus Interactive Pty Ltd.","url":"PS2_COLLECTION_PART11/Heroes%20of%20the%20Pacific%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1978295286,"score":7.4,"genres":"Action > Simulation > Behind view > Flight / aviation > Asia > Historical events > North America > Oceania > World War II","desc":"<p><em>Heroes of the Pacific</em> is an arcade flying game set in the Pacific theatre of World War II. Heroes has six game modes including Campaign Mode, Mission Mode, Instant Action, Training, Historical Missions and Multiplayer.</p><p>In the Campaign mode, the player is William Crowe, a young pilot who survives the Japanese attack on Pearl Harbor, but loses his brother. Crowe vows to avenge his bother's death, pursuing the squadron responsible though the major battles in the Pacific. The game follows the player's quest from Pearl Harbor, to Wake Island, Marshall Islands, Coral Sea, Midway, Guadalcanal, Gilbert Islands, Marianas, Philippines, and finally Iwo Jima.</p><p>As players progress through the campaigns, they earn new planes, including fighters, dive-bombers, torpedo-bombers, and medium bombers. Early in the game the player only has the most basic fighters; like the Warhawk and Wildcat. As they complete missions and progress through the campaign, they are awarded new planes.</p><p>The game features over thirty famous planes including: F6F Hellcat, P-38 Lightning, TBF Avenger, F4U Corsair, B25 Mitchell, P-51 Mustang, Seafire, A6M Zero \"Zeke\", J2M Raiden \"Jack\", Ki-84 Hayate \"Frank\", ME262 and FW190.</p><p>The war in the Pacific and William Crowe's personal quest for revenge both come together in the final assault on Iwo Jima, the volcanic fortress-island under Japanese control.</p>"},{"name":"Hidden Invasion","year":2001,"developer":"Toka S.a.r.l.","url":"PS2_COLLECTION_PART11/Hidden%20Invasion%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1686333994,"score":4.6,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > Sci-fi / futuristic","desc":"<p>The Shadowforce Team is an elite and secretive team deployed for situations of national security. The commisioner of Alpha City, the nation's capital has requested the aid of Shadowforce against a mysterious terrorist organization. Deployed to the field, Special Agents Dean Travis and Karen Bride must engage and defeat the terrorists and discover the truth and conspiracy behind their demands. A conspiracy of a hidden invasion...</p><p>Hidden Invasion is a 3rd person fighting game. Controlling either Dean Travis or Karen Bride, the player relies on hand-to-hand combat and different weapons to defeat foes. Hand-to-hand includes the ability to punch, kick, block and perform combos thereof. Weapons include shotguns, machine guns, energy weapons and assasult rifles, as well as a standard police pistol holstered on the player. Each weapon uses a target-and-shoot system to a single button, based on line of sight. While the game has full 3D environments, movement is only allowed in the proximity of certain predefined paths. Level objectives include disarming bombs, finding keycards and defeating terrorist leaders.</p><p>The US Playstation 2 release features an additional two player cooperative mode where both agents can be used at once. The game tracks progress via a password.</p>"},{"name":"High Heat Major League Baseball 2002","year":2001,"developer":"The 3DO Company","url":"sony_playstation2_h/High%20Heat%20Major%20League%20Baseball%202002%20%28USA%29.zip","filesize":257850335,"score":7.5,"genres":"Sports > Baseball > Licensed","desc":"<p>High Heat 2002 is the 3rd game in the \"High Heat\" series. Gone from the previous two games is the Sammy Sosa title. Like the previous games HH2002 is a total baseball simulator. You can set back and just manage your team or you can get right on the field and play each game. You can configure the game in many different formats. </p><p><strong>You can:</strong>  </p><p>Lengthen or Shorten a season  </p><p>Create new teams  </p><p>Re-arrange the divisons  </p><p>move players from different teams before the game starts  </p><p>Change team settings  </p><p>Create custom made players  </p><p>...and generally do just about anything you want  </p><p>From the swing of the bat to making blockbuster trades you have all the controls.</p>"},{"name":"High Heat Major League Baseball 2003","year":2002,"developer":"The 3DO Company","url":"PS2_COLLECTION_PART11/High%20Heat%20Major%20League%20Baseball%202003%20%28Europe%29.zip","filesize":237716796,"score":8.1,"genres":"Sports > Baseball > Licensed","desc":"<p>The <em>High Heat</em> series returns for another season of baseball, this time with the following updates:</p><ul><li>Improved Truplay AI technology, allowing more true to life animations for batter, fielders and pitchers, etc.</li><li>All the updated team rosters for the new season.</li><li>Two man commentary team.</li><li>On field coaches and managers.</li><li>New gameplay modes including home run derby, fantasy draft, create-a-player, batting practice, and a two on two challenge.</li></ul>"},{"name":"High Heat Major League Baseball 2004","year":2003,"developer":"The 3DO Company","url":"sony_playstation2_h/High%20Heat%20Major%20League%20Baseball%202004%20%28USA%29.zip","filesize":385424484,"score":7.7,"genres":"Action > Sports > 3rd-person (Other) > Managerial / business simulation > Baseball > Licensed","desc":"<p>Bringing High Heat to a new level, this 2004 version takes all the best from previous versions and adds more to give you a top-notch baseball game.</p><p>This new version brings you improved graphics thanks to a new graphics engine.  You also get new career and franchise modes so you can manage your own team and build up multi-year stats for it.  Recruit from all the minor leagues (A through AAA) to help your team become the best.</p><p>Play the 2-on-2 Showdown and select a pitcher and batter to compete against another pitcher and batter.  This does not include competing against another human player in the PC version, which has no multiplayer support.</p><p>Also, experience a more realistic audio environment as you hear people yelling and cheering, and vendors selling hot dogs, not to mention the return of the two-man announcer team.</p><p>Watch realistic player movements, including jumping and diving for the ball, sliding, and even shaking fists when hit by the ball.</p>"},{"name":"High Rollers Casino","year":2004,"developer":"Cinemaware, Inc.","url":"sony_playstation2_h/High%20Rollers%20Casino%20%28USA%29.zip","filesize":480696038,"score":"","genres":"Gambling > Strategy > 3rd-person (Other) > Cards / tiles","desc":"<p>In <em>High Rollers Casino</em>, you navigate a Las Vegas style casino environment with a male or female character you create from pre-selected options (head, hair, etc.), or you may create a character with the mix and match generator. Along with the character parts, the character's voice is also pre-set. Creating a character is required to play, and only one player may play at a time. Once a character is generated, you may enter the casino, which you navigate by walking around, and is viewed from a third person perspective of your character.</p><p>Table games (where you play against a dealer) include Blackjack (including Blackjack, Spanish 21, Double Exposure, and Triple-7), Caribbean Stud Poker, Craps, Let It Ride, Mini Baccarat, Pai Gow Poker, Roulette, Sic-Bo (similar to Roulette, except with three dice in a cage), and Three Card Poker. Machine games include Slots, Video Keno, Video Poker and Video Slots. Poker games include 5 Card Draw, 7 Card Stud, Omaha, Omaha 8's or Better, Razz, and Texas Hold 'Em. You may play the table and machine games by going directly to them to start, but you must go to the Poker Manager to play the poker games.</p><p>In addition to the Poker Manager, other features available in the casino include the Bartender, who is responsible for explaining the rules for the games, and providing tutorials for playing them. The Cashier will help you when you are out of money by providing markers, or letting you sell prizes won in tournaments. The Elevator lets you access your game play statistics, clothing options, prizes, and VIP status, and the Casino Manager provides information about prizes, handles VIP access, and allows you to enter tournaments. Competing in tournaments requires an entry fee of differing amounts, but if won, you gain all of the other player's entry fees. If you win consecutive tournaments, you win Tournament Bonus prizes which may be cashed in at the Cashier.</p><p>As your bankroll increases, you gain VIP status and corresponding VIP cards (Silver, Gold, and Platinum) which increase your ranking and unlocks an additional costume for your character. Gaining the High Rollers card just gives you the High Roller Ranking. These are collected at the Casino Manager's booth. You may access the menu at any time to go directly to a game, change system settings like music and sound volume, game settings and clearing game statistics, help to get detailed game rules and betting options, and to save and load your game.</p>"},{"name":"High School Musical: Sing It!","year":2007,"developer":"Artificial Mind & Movement"},{"name":"Hissatsu Ura Kagyou","year":2005,"developer":"LightWeight Co., Ltd.","url":"sony_playstation2_h/Hissatsu%20Ura%20Kagyou%20%28Japan%29.zip","filesize":2774573147,"score":"","genres":"Action > 3rd-person (Other) > Stealth","desc":"<p><em>Hissatsu Ura Kagyō</em> is an action game set in Japan during the Edo period, inspired by the popular <em>Hissatsu Series</em> historical drama (jidaigeki). The player controls Keijirō Teitō, who by day is a well-liked doctor in his hometown. However, by night, he takes up his sword and exacts bloody vengeance on the wicked and the corrupt.</p><p>During the daytime, the player can move about Keijirō's hometown, speaking with people to gather information, visiting the many shops such as a restaurant and a bookstore, and perhaps even getting into a fight now and then. Returning to his home allows him to save the game, view and accept the current job requests, and consult with his father about a variety of topics.</p><p>During the night, the game becomes more like a stealth action game such as Tenchu. Controlling either Keijirō or one of several other characters, the player must continue to gather information about the targets for each request while evading detection, eventually reaching the main target who must be killed. Successfully completing requests will earn money and reputation.</p>"},{"name":"History Channel, The: Battle for the Pacific","year":2007,"developer":"Sand Grain Studios","url":"PS2_COLLECTION_PART11/History%20Channel%2C%20The%20-%20Battle%20for%20the%20Pacific%20%28Europe%29.zip","filesize":1363886216,"score":"","genres":"Action > 1st-person > Shooter > Historical events > Oceania > World War II > Licensed","desc":"<p>You play as Lieutenant Jonathan Farrel, an American G.I. previously stationed in Europe but assigned as single member of the special-ops group called \"Eagle Rage\", fighting in the Pacific during World War II against Japanese soldiers. You will have to carry 12 missions, mostly in jungle environment and with a certain degree of freedom like choosing an alternate road or hiding behind a rock. But be careful when you're reloading your weapon, a blur effect is triggered and affects your view.</p><p>The PS2 and Wii versions are different from the 360/PS3/PC. Indeed, you're playing a Lieutenant with a background story, doing his job alone and narrating himself his time during WWII and not a simple soldier, accompanied by his comrades, following his sergeant's orders.</p><p>Being a History Channel product, this FPS is based on real weaponry or places. Each level begins with a documentary composed of authentic footage.</p>"},{"name":"History Channel, The: Civil War - A Nation Divided","year":2006,"developer":"Cauldron Ltd.","url":"sony_playstation2_h/History%20Channel%2C%20The%20-%20Civil%20War%20-%20A%20Nation%20Divided%20%28USA%29.zip","filesize":796870154,"score":5.7,"genres":"Action > 1st-person > Shooter > Historical events > Licensed","desc":"<p><em>Civil War: A Nation Divided</em> lets players relive the horror and chaos of the Civil War fighting for both the Union and the Confederate Armies in 12 of the most bloodiest battles in America's history.</p><p>As the Union, fight in Fredericksburg and repel the confederate forces or go to Gettysburg and take on hordes of confederates, then on to Chattanooga to begin the invasion of the south leading to battles at Fort Fisher, in Selma, Alabama and take the last line of defensive at Petersburg to march towards the enemie's capital.</p><p>As the Confederates, hold your ground against the Union army at Bull Run, Shiloh and Chickamauga, survive the chaos of Antietam and Chancellorsville and hold off the relentless Ulysses S. Grant at Cold Harbor and try to save the south from falling. With historical accurate weapons with the help of the History Channel, go into battle as a different soldier and relive the battles as they faced and the challenges to survive the chaos that is The Civil War.</p>"},{"name":"History Channel, The: Great Battles of Rome","year":2007,"developer":"Slitherine Software UK Ltd.","url":"PS2_COLLECTION_PART11/History%20Channel%2C%20The%20-%20Great%20Battles%20of%20Rome%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":848479790,"score":5.1,"genres":"Strategy > Real-time > Historical events > Licensed","desc":"<p><em>The History Channel: Great Battles of Rome</em> is a real time strategy game set in Roman times. The game allows you to play all the great battles from Roman history. In between missions you can watch (up to 50 minutes of) TV footage from The History Channel's documentaries on Rome. Additionally, the story of Marcus Aurelius is completely voice-acted as well. Gameplay is similar to Slitherine's previous game Legion Arena: You control your armies in real time on a 3D map. There is no resource gathering or city building, but at the end of every battle you are given points which can be used to purchase new units and upgrade surviving units which you bring along to the next battle.</p><p>The game features 14 different campaigns portraying over a 100 different battles. There are 20 different types of units which can all be customized with different skills and clothing.</p><p>The PSP version features some bonus missions taken from Legion Arena: Cult of Mithras in which you play as the Celts. Both the PSP and Windows version include multiplayer modes, but the Playstation 2 version lacks this.</p>"},{"name":"Hisui no Shizuku: Hiiro no Kakera 2","year":2007,"developer":"Idea Factory Co., Ltd.","url":"sony_playstation2_h/Hisui%20no%20Shizuku%20-%20Hiiro%20no%20Kakera%202%20%28Japan%29.zip","filesize":1502452122,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Suzu Takachiho is the daughter of the Tamayorihime, a princess with the sole purpose of sealing away a dangerous artifact of the gods, the Onikirimaru. Suzu's close cousin and sister figure, Mao Yasaka, is next in line to succeed her mother as Tamayorihime and keep the seal on the Onikirimaru in place, protecting the land from the wrath of the gods. All is well until Mao mysteriously disappears, bringing Suzu back to her bloodline and forcing her to take on the role of Tamayorihime in her cousin's place. Suzu must now seal away the Onikirimaru once again, all while attempting to uncover the mystery behind Mao's disappearance and its ties to a dangerous woman known only as the Toyotamahime. Fortunately, she has the aid of her guardians, six young men who have taken an oath to protect the Tamayorihime from any danger she may face.</p><p><em>Hisui no Shizuku: Hiiro no Kakera 2</em> is the sequel to Hiiro no Kakera, though despite the minor parallels between the roles of the protagonist, the story takes place in a completely different setting with a new cast. It is a visual novel targeted at a female audience, allowing the player to choose between the seven eligible bachelors by making choices throughout the story. The common route splits into separate routes for each of the men at a certain point in the story, with affection from correct choices determining which route the heroine is set on for the rest of the story; choices after that determine whether the heroine obtains a bad end or a good end.</p>"},{"name":"Hitman 2: Silent Assassin","year":2002,"developer":"Io-Interactive A/S","url":"sony_playstation2_h/Hitman%202%20-%20Silent%20Assassin%20%28USA%29%20%28v3.01%29.zip","filesize":1940870913,"score":8,"genres":"Action > 1st-person > Behind view > Shooter > Stealth > Direct control > Crime > Spy / espionage > Thriller","desc":"<p>The perfect hitman, Agent 47, tries to distance himself from his violent past and becomes a humble church gardener. But he is tricked into returning to his trade when his friend, a priest, gets kidnapped by an Italian mafioso. <em>Hitman 2: Silent Assassin</em> is a third-person stealth game. As a titular hitman, you have to complete a number of missions all over the world. Each mission generally involves assassinating someone and possibly fulfilling a couple of other objectives. </p><p>Typically, your target will be protected by numerous guards. While there's a large arsenal of weapons available to you - ranging from stealthy weapons such as a garrote or a silenced pistol, up to machine guns and sniper rifles - your main weapon will be stealth. Agent 47 can sneak around to remain undetected, and he can disguise himself in clothes from killed or stunned guards. </p><p>The guards aren't completely stupid, however, as they will investigate suspicious noises, and they'll react if they see you waving around a gun. They'll get suspicious if they see you running around, raise alarm upon finding a corpse, and if you hang in a disguise around them too long, they'll eventually realize you're not one of their buddies. </p><p><em>Hitman 2: Silent Assassin</em> brings something new to the series: depending on your stealthiness, you are given a rating upon completing a mission. Going trigger-happy on everyone will result in being called a \"Mass Murderer\", while only the most patient and skilled players will manage to receive the \"Silent Assassin\" rating, which generally involves stealthily eliminating the target without raising any suspicion.</p>"},{"name":"Hitman Trilogy","year":2007,"developer":""},{"name":"Hitman: Blood Money","year":2006,"developer":"Io-Interactive A/S","url":"sony_playstation2_h/Hitman%20-%20Blood%20Money%20%28USA%29.zip","filesize":2837260587,"score":8,"genres":"Action > 1st-person > Behind view > Shooter > Stealth > Direct control > Crime > Thriller","desc":"<p>Agent 47 the assassin returns in the 4th installment of the <em>Hitman</em> series. This time he goes on a trip around America, undertaking missions in major cities such as Las Vegas, New Orleans, Los Angeles and other exotic locations. This time, he better watch his back, as his long-time employer, the International Contract Agency, is threatened by a mysterious rival. </p><p>Gameplay in <em>Hitman: Blood Money</em> is generally similar to the previous installments. Once again, your job will be to complete several assassination missions. You can sneak around in disguise to avoid the suspicious guards, or you can instead open fire on everyone you see. When you complete your mission, you're given a rating - from \"Mass Murderer\" up to the coveted \"Silent Assassin\". </p><p><em>Blood Money</em> introduces a lot of new features, however. A new notoriety system will track every single one of your moves, which in turn will demand utmost calculation in order to successfully accomplish your objectives. For those of you who are tired of a direct approach, you will be given the opportunity to stage accidents and should you be suspected, bribes and \"other\" accidents will always be at hand. <em>Blood Money</em> also gives the player the opportunity to customize weapons.</p>"},{"name":"Hitman: Contracts","year":2004,"developer":"Io-Interactive A/S","url":"sony_playstation2_h/Hitman%20-%20Contracts%20%28USA%29.zip","filesize":2539535649,"score":7.5,"genres":"Action > 1st-person > Behind view > Stealth > Crime > Spy / espionage > Thriller","desc":"<p><em>Hitman: Contracts</em> is a third-person stealth game. Players take the role of \"47\", a hitman who is unlucky enough to get shot, and falls to the floor dying. The whole game takes place in \"flashbacks\", where 47 is reminiscing about past missions, some of which were previously seen in Hitman: Codename 47, the first game from the <i>Hitman</i> series.</p><p>Gameplay in <em>Hitman: Contracts</em> is similar to the previous installments. Your job will be to complete several missions which involve assassinating targets all over the world. You can sneak around in disguise to avoid the suspicious guards, or you can instead open fire on everyone you see. When you complete your mission, you're given a rating - from \"Mass Murderer\" up to the coveted \"Silent Assassin\". If you manage to complete a mission with a \"Silent Assassin\" rating, you receive a reward: a special weapon (such as dual sawed-off shotguns), and you can try playing a previously completed mission using one of the special weapons.</p>"},{"name":"Hits Collection: Need for Speed: Underground 2 / Medal of Honor: Rising Sun","year":2005,"developer":""},{"name":"Hobbit, The","year":2003,"developer":"Inevitable Entertainment, Inc.","url":"PS2_COLLECTION_PART11/Hobbit%2C%20The%20-%20The%20Prelude%20to%20the%20Lord%20of%20the%20Rings%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1389549229,"score":6.4,"genres":"Action > 3rd-person (Other) > Fantasy > Licensed","desc":"<p>Third-person platformer adapted from J.R.R. Tolkien's famous book.Players control Bilbo as he's taken from his safe little hole in the Shire by a band of Dwarves to confront the dragon Smaug while picking up a glowing sword, an invisibility ring, and coins and crystals.</p>"},{"name":"Hokenshitsu e Youkoso","year":2006,"developer":"PrincessSoft","url":"sony_playstation2_h/Hokenshitsu%20e%20Youkoso%20%28Japan%29%20%28Shokai%20Genteiban%29.zip","filesize":1265514616,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Fantasy","desc":"<p><em>Hokenshitsu e Yōkoso</em> is a non-adult PlayStation 2 port of an adult visual novel romance adventure game Hokenshitsu e Yōkoso: Magical Pure Lesson released half-a-year earlier. The PS2 port features new opening movie song and adjustments in the scenario content. During the spring break, Koutarou Tanaka (田中 湖太郎), the story protagonist, had an accident at the mountain which almost costed him his life. After a long absence from school, he returned to classes and was promptly elected a member of a health committee. During his absence, a new teacher was appointed in the school's infirmary, and she seems to be using a new magical medicine to help students. While on a health committee, Koutarou became very close with Marina Kasuga (春日 鞠奈), who graduated with honors at magical university overseas. Marina is dabbling in magical medicine and is trying to helping Koutarou. What her medicine does, however, is split his personality in two, Kou being his old self, and Low being the product of a strange new medicine. This visual novel displays typical features for the genre, from static characters portraits over background images, full voice-acting for NPCs, message history, constant player choices which branch the story, and very fast forward option through dialogues and scenes.</p>"},{"name":"Home Alone","year":2007,"developer":"Coyote Developments Ltd","url":"PS2_COLLECTION_PART11/Home%20Alone%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":56133216,"score":"","genres":"Action > Diagonal-down > Arcade > Direct control > Crime > Licensed","desc":"<p><em>Home Alone</em> is based off the movie of the same name. The player, who can play as Kevin, Kelly, Carl and Carly, has to protect their home from burglars in all sorts of crazy ways, such as firecrackers, bowling bowls, pet tarantulas and more!</p>"},{"name":"Home Maid: Tsui no Yakata (Shokai Genteiban)","year":2005,"developer":"","url":"sony_playstation2_h/Homemaid%20-%20Tsui%20no%20Yakata%20%28Japan%29.zip","filesize":786119317,"score":"","genres":"Special edition > Physical extras","desc":"<p>This Shokai Genteiban (First Print Limited Edition) release includes:</p><ul><li>Home Maid: Tsui no Yakata game</li><li><em>Home Maid Voice Message: Ano Hi kara no Tegami</em> audio drama</li></ul>"},{"name":"Homerun","year":2001,"developer":"Magical Company Ltd.","url":"PS2_COLLECTION_PART11/Homerun%20%28Europe%29.zip","filesize":236788819,"score":"","genres":"Sports > 3rd-person (Other) > Behind view > Direct control > Baseball","desc":"<p>Step up to the plate and get ready to hit a homerun.</p><p>Combining incredible life like player models and total control pitching and batting, Homerun delivers true baseball arcade action.</p>"},{"name":"Homura","year":2005,"developer":"Skonec Entertainment, Co., Ltd","url":"PS2_COLLECTION_PART11/Homura%20%28Europe%29.zip","filesize":66250926,"score":"","genres":"Action > Top-down > Anime / Manga > Shooter > Fantasy","desc":"<p>An evil fallen angel steals the Divine Crystal, one of Heaven's untouchable treasures. With this crystal he gains the power to control the thoughts of Shogun Ieyasu Tokugawa, and forces him to occupy Osaka castle and put himself in power using his newfound powers. In Heaven, the leaders of the individual heavenly families form a council with one aim... to regain the Divine Crystal. But they can't do this alone, so they decide to use the prisoner Homura to aid them. While they don't want to release him, he is the only one who's blood is half that of an angel and half human making him immune against the Crystal's powers. Homura refuses at first, but when he finds out that his mother was one of the victims at Osaka he picks up his sword and is ready to fight once again...</p><p><em>Homura</em> is a top-down shoot'em up of the bullet-hell persuasion. The player takes on the role of Homura as he fights his way through 4 levels filled with demons. Each stage has a branching path where Homura can pick which route to take. The paths will meet up at the end of the stage however, so the boss fight will always be the same.</p><p>There are several ways to dispose of the enemies in the game, where the common one is a projectile attack (as it the norm of the genre). What sets this game apart is Homura's sword slash technique; When used it makes the enemies' bullets bounce back towards them. The more bullets are slashed at once, the higher the score multiplier will be. The sword slash has to be recharged for a few seconds each time after use. There are also powerful special attacks which will clear the screen of all enemies or do massive damage to bosses.</p><p>Killed enemies drop money, which is used to fill up a meter. When the meter is full, an \"option\" helper is added to Homura's side adding additional fire power.</p><p>The aspect ratio can be changed in the options menu in a multitude of ways, one of which means placing the screen sideways (for standing the TV on its side) to make it more similar to the original arcade cabinet's setup.</p><p>There is also an unlockable art gallery which will have more pictures added to it the further the player makes it through the game.</p>"},{"name":"Honoo no Takuhaibin","year":2006,"developer":"POT, Inc.","url":"sony_playstation2_h/Honoo%20no%20Takuhaibin%20%28Japan%29.zip","filesize":2799322215,"score":"","genres":"Action > Racing / Driving > 3rd-person (Other) > Anime / Manga > Sci-fi / futuristic","desc":"<p>The Donkame Courier Company is in big trouble! Nearly all of its employees have quit or been hospitalized by members of the Jakuniku Transport Company, an evil delivery company bent on world domination run by the ambiguously-foreign businessman/cult leader Jack Nick. Jirō, an experimental enhanced humanoid developed by Jakuniku to be the ultimate deliveryman, has rejected their goals and has defected to Donkame, where he is determined to deliver to his customers in the name of love, justice, and low prices! But Jack Nick is not about to let him go, and will stop at nothing to crush Donkame and force Jirō back under his control.</p><p><em>Honō no Takuhaibin</em> (\"Blazing Express Delivery\") is an action delivery game where the player, as Jirō, must deliver packages within a time limit, while at the same time defeating or avoiding various enemies. Jirō has access to both a hand cart and a van, which he can switch between at will, though the van cannot enter certain areas. Defeating enemies and completing deliveries will earn Delivery Spirit, which can be used to launch special attacks and boost Jirō's speed.</p><p>The game is divided in to chapters, which are further divided into days, each of which comprises one stage in the game. Each day can be tackled on one of three difficulty levels, and has a set number of packages that must be delivered. Additional bonus deliveries may appear during the stage, and some days will include boss fights that must be defeated before the final delivery can be made. The story is told through fully-voiced cut scenes made from sparsely-animated stills, which play at the beginning and end of each day.</p><p>Between stages, the player can use points earned on previous days to purchase upgrades for their van, including new engines, tires, and even frames. There are also a large number of hidden packages strewn about the city, which each unlock a bonus item in the menu when collected.</p>"},{"name":"Hooligan","year":2002,"developer":"Front Wing Co., Ltd."},{"name":"Hooligan: Kimi no Naka no Yūki (Genteiban)","year":2002,"developer":"Front Wing Co., Ltd.","url":"sony_playstation2_h/Hooligan%20-%20Kimi%20no%20Naka%20no%20Yuuki%20%28Japan%29.zip","filesize":1868952703,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited-edition release of Hooligan: Kimi no Naka no Yūki includes the game along with a special limited-edition dress-up doll with two outfits and three character heads.</p>"},{"name":"Hoppie","year":2008,"developer":"CyberPlanet Interactive Public Co., Ltd.","url":"PS2_COLLECTION_PART11/Hoppie%20%28Europe%29.zip","filesize":40114253,"score":"","genres":"Puzzle > Diagonal-down > Isometric","desc":"<p>Jump across surprise lands filled with treasures and traps; Catch Holy Stars, Heaven Rings, and Power Gems to level up; Avoid Magic Bombs and gaping holes; Turn bouncing blocks to their original colorful state before the earth is dried up; Fun and addicting stages offer hours of exciting gameplay</p><p>Your mission is to save your land from ruin in this fun-filled adventure game featuring Hoppie, the bouncing bunny who brings livelihood to everything he touches! You must break the evil spell cast on the entire kingdom before it is too late! Jump across surprise lands filled with treasures and traps! Catch Holy Stars, Heaven Rings, and Power Gems to level up. But beware! Magic Bombs and gaping holes will send you back to where you started. Fun and addicting stages offer hours of exciting gameplay as you restore each land block back to its original state before the earth is dried up!</p>"},{"name":"Hoshifull: Hoshi no Kudaru Machi (Genteiban)","year":2008,"developer":"","url":"sony_playstation2_h/Hoshifuru%20-%20Hoshi%20no%20Furu%20Machi%20%28Japan%29.zip","filesize":1894649946,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition release includes:</p><ul><li>Hoshifull: Hoshi no Kudaru Machi game</li><li>New audio drama</li><li>Official setting material collection</li></ul>"},{"name":"Hot Shots Golf 3","year":2001,"developer":"Clap Hanz Ltd.","url":"sony_playstation2_h/Hot%20Shots%20Golf%203%20%28USA%29%20%28v2.00%29.zip","filesize":1254765901,"score":8.3,"genres":"Sports > Golf","desc":"<p><em>Hot Shots Golf 3</em> takes the series of detailed yet accessible golf simulations onto the PS2. The overall look and feel of the game is pretty much the same as it's predecessors, taking the PS2's extra power into account. The same 'tap-tap-tap' system for hitting the ball is back. </p><p>There are a number of different courses, characters, clubs, and ball types to choose from. New equipment can be purchased with experience points, which your characters earn by winning matches. Better equipment will ease up the games difficulty a bit by providing greater accuracy, distance, and control.</p><p>As an addition feature, the game has an international ranking system of sorts. With a password from the game you can post your scores on a website, where you can see how you measure up against everyone else out there.</p>"},{"name":"Hot Shots Golf: Fore!","year":2004,"developer":"Clap Hanz Ltd.","url":"sony_playstation2_h/Hot%20Shots%20Golf%20Fore%21%20%28USA%29.zip","filesize":2444923192,"score":7.9,"genres":"Sports > 3rd-person (Other) > Golf","desc":"<p>Hot Shots Golf Fore! (HSG4) continues the cute-golf style of Hot Shots Golf 3 with a new major addition - online play. You can take your golf game online and challenge other golfers in stroke play or match play games to see who the best video golfer in the world is.</p><p>You can play through tournaments on one of 12 different golf courses, each with varied layouts, weather, and hazards. There is also a par-3 short course, and two mini-golf courses where your goal is to score points by sinking long putts within two strokes.</p><p>There are many things to unlock in HSG4. You can add new golfers to your roster by challenging and defeating them in Vs. Mode. You can also purchase new costumes, caddies, clubs, and balls at the golf shop by earning points during tournaments and Vs. play. As you perform well in these game, your ranking will improve (from Rookie to Amateur to Pro), and so too will the strength of the opposition.</p>"},{"name":"Hot Shots Tennis","year":2006,"developer":"Clap Hanz Ltd.","url":"sony_playstation2_h/Hot%20Shots%20Tennis%20%28USA%29.zip","filesize":376469769,"score":6.9,"genres":"Sports > Behind view > Diagonal-down > Tennis","desc":"<p><em>Hot Shots Tennis</em> (<em>Everybody's Tennis</em> in Europe) is a simulation of the tennis sport. It is very arcade oriented which means the player only needs to the correct position to the ball and a good timing. The player also can choose between different shot variants by pressing the assigned buttons. There are three playing modes: trainings, exhibition matches and challenge mode. The latter consists of a series of matches against the AI. After a few victories the player improves his abilities and can play in a better league with stronger opponents. It also unlocks new characters, referees and stadiums with different advantages and disadvantages.</p><p>In multiplayer and free matches the player can vary various settings, including the basic rules, and use his unlocked rewards. There are also fun options, e.g. unrealistic physics and slow motion mode.</p>"},{"name":"Hot Wheels: Beat That!","year":2007,"developer":"Eutechnyx Limited","url":"PS2_COLLECTION_PART11/Hot%20Wheels%20-%20Beat%20That%21%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":200886745,"score":6.5,"genres":"Action > Racing / Driving > 3rd-person (Other) > Arcade > Shooter > Licensed","desc":"<p>In <em>Hot Wheels: Beat That!</em>, the player can take the controls of 30 authentic <em>Hot Wheels</em> cars and compete in 12 different racing environments in a variety of single-player games and multiplayer games.</p><p>Players race through enlarged environments, similar to Micro Machines, that include bedrooms and backyards, avoiding obstacles, knocking out competitors, picking up power-ups and complete stunts through a variety of tracks such as the loop-de-loop. There are standard races along with elimination races where players fire rockets at each other in an attempt to knock each other out of the race.</p>"},{"name":"Hot Wheels: Stunt Track Challenge","year":2004,"developer":"Climax (Brighton) Ltd","url":"PS2_COLLECTION_PART11/Hot%20Wheels%20-%20Stunt%20Track%20Challenge%20%28Europe%2C%20Australia%29.zip","filesize":1050990589,"score":6.4,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Top-down > Tricks / stunts > Automobile > Licensed","desc":"<p>Hot Wheels meets Fear Factor. Players can play this game with 30 different Hot Wheels race cars through 24 challenges, 12 race tracks, and 12 mini-games. They can collect many decals, wheels and race cars as the try out six different worlds with Ryan Storm (your host) guiding them through all these events to race for the number one spot.</p>"},{"name":"Hot Wheels: Velocity X","year":2002,"developer":"Beyond Games","url":"PS2_COLLECTION_PART11/Hot%20Wheels%20-%20Velocity%20X%20-%20Maximum%20Justice%20%28Europe%29.zip","filesize":392520594,"score":6.4,"genres":"Racing / Driving > Behind view > Direct control > Automobile > Cyberpunk / dark sci-fi > Licensed","desc":"<p>When a criminal gang of street-racing villains steals Professor Justice's secret Velocity X fuel formula, his son Max must put his driving skills and mean street machines to the ultimate test.</p><p><em>Hot Wheels: Velocity X</em> is a game based on Mattel's Hot Wheels line of miniature racing vehicles. In the game, the player has to drive one of over 30 Hot Wheels cars in races on 3D curvilinear tracks, which include banded loops or crazy stunt launchers. During the races, weapon attacks and power-ups are available. The racing is mission-based with 14 missions to complete in the game's main Adventure Mode.</p>"},{"name":"Hot Wheels: World Race","year":2003,"developer":"Climax (Brighton) Ltd","url":"sony_playstation2_h/Hot%20Wheels%20-%20World%20Race%20%28Europe%2C%20Australia%29.zip","filesize":501291389,"score":6.3,"genres":"Racing / Driving > 1st-person > Behind view > Licensed","desc":"<p>Compete to be the world's greatest driver in the most intense race ever created - The Highway 35 Circuit. Do You have what it takes to master treacherous jumps, death-defying loops, and win the Hot Wheels World Race event?</p><p>Hot Wheels Highway 35: World Race, celebrating the 35th Anniversary of the Hot Wheels range, features dozens of authentically modeled Mattel Hot Wheels cars.</p>"},{"name":"Hourglass of Summer","year":2002,"developer":"PrincessSoft"},{"name":"Hresvelgr","year":2000,"developer":"Gust Co., Ltd.","url":"sony_playstation2_h/Hresvelgr%20%28Japan%29.zip","filesize":630026433,"score":"","genres":"Action > Racing / Driving > Behind view > Direct control > Flight / aviation > Track racing > Sci-fi / futuristic","desc":"<p>This futuristic 3D racing game has players taking to the sky in futuristic spacecraft. Ships draw power from a special track shaped like a ribbon in the sky; players can drive their ships in any direction, but must keep close to the ribbon to keep up their power and move at full speed. Enemies can also shoot at players, requiring them to dodge shots while staying on-track and moving as fast as possible.</p><p>The International Version update, released later, adds a two-player mode and customizable controls along with a few bonus features.</p>"},{"name":"HSX: HyperSonic.Xtreme","year":2002,"developer":"Blade Interactive Studios Ltd.","url":"sony_playstation2_h/HSX%20-%20HyperSonic.Xtreme%20%28USA%29.zip","filesize":1375628284,"score":6,"genres":"Racing / Driving > Behind view > Direct control > Hovercraft > Sci-fi / futuristic","desc":"<p><em>HSX: HyperSonic Xtreme</em> is a futuristic hover sled racing game. Races take place on elevated tracks littered with speed boosts, shield power ups, and big jumps. There are several game modes, including a cup mode and slalom races, either of which can be played in two player split screen.</p><p>One of <em>HSX</em>'s major features is it's built-in track editor. The full-featured track editor lets you create your own tracks, complete with flashy special effects.</p>"},{"name":"Hudson Selection Vol. 1: Cubic Lode Runner","year":2003,"developer":"Hudson Soft Company, Ltd.","url":"sony_playstation2_h/Hudson%20Selection%20Vol.%201%20-%20Cubic%20Lode%20Runner%20%28Japan%29.zip","filesize":237615260,"score":"","genres":"Action","desc":"<p>Lode Runner is a puzzle video game, first published by Brøderbund in 1983. It is one of the first games to include a level editor, a feature that allows players to create their own levels for the game. This feature bolstered the game's popularity, as magazines such as Computer Gaming World held contests to see who could build the best level. Tozai, Inc. currently holds the intellectual property[clarification needed] and trademark rights of Lode Runner.</p><p>The Hudson Selection Vol. 1-4 are a collection of video games by Hudson Soft, released only in Japan. Each volume is an enhanced remake of the following games.</p><p>Hudson Selection Vol. 1 - Cubic Lode Runner: Lode Runner is a remake of the classic 8-bit Famicom / NES action game Lode Runner. The remake version features 3D and 2D graphics, 60 stages and an Edit Mode for creating custom stages. The BGMs are also rearranged.</p><p>The legendary Lode Runner rolls once again with a 3-D update. Run across isometrically viewed playfields and dump pursuers by creating holes in your wake. Collect all the \"lode\" scattered across the screen to progress to new levels. Although blasting open holes are your salvation, they will eventually fill up again and trapped pursuers who fall into the holes provide a walking \"plank\" for their fellows to walk over.</p><p>A hefty 60 stages are included in the game with the difficulty level progressively becoming steeper as you blow through the first couple of easy ones. Later levels require a bit of thinking in order to collect the lode - for example, there's buried treasure in some levels and one must think about blasting holes properly so that you'll get the gold as well as provide yourself with an escape route.</p><p>Once you've conquered all 60 levels, an Edit Mode allows the creations of new and crafty levels for your own pleasure or to share with friends who come over to test their best."},{"name":"Hudson Selection Vol. 2: Star Soldier","year":2003,"developer":"Sting, Inc.","url":"sony_playstation2_h/Hudson%20Selection%20Vol.%202%20-%20Star%20Soldier%20%28Japan%29.zip","filesize":88307543,"score":7,"genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>A budget remake of the top-down sci-fi shooter Star Soldier for next-gen consoles. </p><p>The game puts you in charge of a lone Galactic Empire starfighter as you make your way through several alien-infested stages using nothing but your reflexes and your laser weapons.</p><p>The remake replaces the original graphics with a completely polygonal engine, featuring particle effects for all weapons and a new interface. New mid-stage bosses have been added to the mix and a new close-range attack has been included in your ship for added damage.</p>"},{"name":"Hudson Selection Vol. 3: PC Genjin","year":2003,"developer":"Hudson Soft Company, Ltd.","url":"sony_playstation2_h/Hudson%20Selection%20Vol.%203%20-%20PC%20Genjin%20-%20Pithecanthropus%20Computerurus%20%28Japan%29.zip","filesize":294033276,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>Fourteen years after its debut, PC Genjin (<em>Bonk's Adventure</em>) is remade as the third game out of four in the Hudson Selection series of game remakes. While the game remains mostly the same as the original, the graphics and sound have been completely overhauled. The graphics are fully 3D rendered and are similar in design to Yoshi's Story. Bonk has a meaner look and practically every sound effect is spelled out on-screen. Some of the levels are altered. Fruit is not as common and there are no crystal hearts, but lives are much more plentiful. There are three difficulty levels, which after being fully completed, unlock the three original PC Genjin Japanese TV commercials.</p>"},{"name":"Hudson Selection Vol. 4: Takahashi Meijin no Bōken Jima","year":2003,"developer":"Hudson Soft Company, Ltd.","url":"sony_playstation2_h/Hudson%20Selection%20Vol.%204%20-%20Takahashi%20Meijin%20no%20Boukenjima%20%28Japan%29.zip","filesize":557616512,"score":"","genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>A budget remake of the side-scrolling platform game Adventure Island for the GameCube and PlayStation 2.The story starts out with Master Higgins and his girlfriend relaxing until a purple cloud takes his girlfriend away to King Quiller. So it's up to Master Higgins to go and rescue her.This remake is different from the original in that the graphics were rendered to 3D, the music was completely overhauled, the bosses do more things than throw their weapons at Master Higgins, and this remake contains bonus materials.</p>"},{"name":"Hugo: Bukkazoom!","year":2003,"developer":"ITE Media ApS (Interactive Television Entertainment)","url":"PS2_COLLECTION_PART11/Hugo%20-%20Bukkazoom%21%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%2CPl%29.zip","filesize":343610961,"score":"","genres":"Racing / Driving > Behind view > Track racing > Fantasy > Licensed","desc":"<p><em>Hugo: Bukkazoom!</em> is a 3D racing game based starring Hugo the TV Troll, a popular cartoon character on Danish television. In this game Hugo is shrunk to the size of little green creatures called greenflies. He must race a kart through marshes, deserts and various landscapes. The circuits have checkpoints, upgrades and a scoring system open to different possible strategies. Both single-player and multiplayer games for up to two players are supported. Included game modes are balloon race, greenflies in basket, regular races, capture the balloon, taxi race, free roam and time trial. There are different characters to choose from and they can use power-ups during the races, such as a shield, a cluster bomb or a turbo.</p>"},{"name":"Hugo: Cannon Cruise","year":2004,"developer":"ITE Media ApS (Interactive Television Entertainment)","url":"PS2_COLLECTION_PART11/Hugo%20-%20CannonCruise%20%28Europe%29%20%28En%2CEs%2CPt%2CPl%29.zip","filesize":287828208,"score":5.6,"genres":"Action > Behind view > Shooter > Naval / watercraft > Fantasy > Licensed","desc":"<p><em>Hugo: Cannon Cruise</em> is a 3D shooting game starring Hugo the TV troll in a nautical adventure. In long forgotten times Iduna the witch queen planted a magical tree. This tree is located in her tomb and each thousand years one apple grows from this tree, granting the first to eat from it three wishes. Scylla the evil witch is after the apple now, but to get in she has to raise all statues of Iduna's sisters from the sea floor, to break the tomb's magical seal. Scylla has send messages to all her allies to help her.</p><p>You take control of Hugo and his ship. Gameplay includes sailing around and destroying various enemy ships and towers with your cannon. Enemies include Vikings, Romans and pirates that try to prevent you from reaching the tomb. Destroyed ships sometimes drop additional ammo and extra health.</p>"},{"name":"Hugo: Magi i Troldeskoven","year":2009,"developer":"Attractive Games Ltd.","url":"PS2_COLLECTION_PART11/Hugo%20-%20Magic%20in%20the%20Trollwoods%20%28Europe%29%20%28En%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":877977177,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > Licensed","desc":"<p>When humans start to clear the forest, the root of all evil is uncovered and threatens both their world and the magical creatures that live in the forest. Hugo is a troll that's a magician in training and is entrusted by the animal elders with the sacred Elder's Staff to combat the evil. </p><p><em>Hugo: Magic in the Troll Woods</em> is a 3D platformer where you control Hugo as he jumps. slides, climbs and swings through the forest while collecting hidden items and solving puzzles. The evil has transformed some forest animals into shadow creatures that must be combated and restored.</p>"},{"name":"Hulk","year":2003,"developer":"Radical Entertainment Inc.","url":"PS2_COLLECTION_PART11/Hulk%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1684422152,"score":6.4,"genres":"Action > 3rd-person (Other) > Cinematic camera > Beat 'em up / brawler > Direct control > Licensed","desc":"<p>Taking place after the events of the blockbuster movie (starring Eric Bana), you play Dr. Bruce Banner and his alter ego, green giant The Hulk. After fighting his way through the first year of his new identity, Bruce and The Hulk must now face a new enemy, The Leader, who wants to use the same gamma technology that created The Hulk in Bruce to develop an army of giants.</p><p>Levels in the game have you controlling either Bruce or The Hulk. Bruce must use his smaller size to sneak around areas 'Splinter Cell' style, while The Hulk can bash and blast his way through enemy territory in every way possible, with over 40 different attacks to use.</p>"},{"name":"Hummer: Badlands","year":2006,"developer":"Eutechnyx Limited","url":"PS2_COLLECTION_PART11/Hummer%20Badlands%20%28Europe%29.zip","filesize":179220954,"score":5.8,"genres":"Action > Racing / Driving > Sports > 3rd-person (Other) > Off-roading > Licensed","desc":"<p>Get down and dirty in this hummer racing game. Drive and choose from 19 different hummer models, as you race to win in different races through all the modes of the game: Championship, Tug'O'war, and Extreme Off-road where you race to the top of a mountain through intense weather over fallen trees, bushes and tall grass. As you win, you unlock custom hummers, tracks, and customizations to upgrade your vehicle. Multiplayer includes 2-player head-to-head races on split-screen.</p>"},{"name":"Hungry Ghosts","year":2003,"developer":"Deep Space, Inc.","url":"sony_playstation2_h/Hungry%20Ghosts%20%28Japan%29.zip","filesize":989905226,"score":"","genres":"Action > Adventure > 1st-person > Horror","desc":"<p>You are dead. In life, you were a warrior who took many other lives. But now, your own life at its end, you find yourself at the River Styx with none other than Death himself as your guide. He tells you that you have a choice. You can let your soul be carried off to Hell, where it will suffer endless torment for an eternity, or you can attempt to be accepted at the Gate of Judgment, proving yourself worthy of being reborn as a human. Of course, the path there is long and wrought with peril, and only through your actions as you journey through the netherworld can you change your own fate.</p><p><em>Hungry Ghosts</em> is a first-person adventure game with light action elements. The player controls the recently-deceased warrior as he travels through the afterlife searching for the Gate of Judgment. Many objects can be examined, collected, or interacted with in various ways. The protagonist begins the game with a spear and an empty crossbow, but can acquire and use a number of other weapons and items throughout the game. It is necessary to collect so-called Soul Fragments by helping out other lost souls, which will allow the player to progress through the next gate.</p><p>Every action in the game has an effect on the protagonist's fate. Simply reaching the Gate of Judgment is not enough to redeem him; the player will be judged accordingly on the actions they took to get there. For example, break open too many barrels and hoard every possible item, and the protagonist will be judged a glutton. In order to be judged fit for rebirth, the player must be judicious in their choices; take only what is necessary, help out others wherever possible, and do not cause undue suffering...</p>"},{"name":"Hunter: The Reckoning - Wayward","year":2003,"developer":"High Voltage Software, Inc.","url":"PS2_COLLECTION_PART11/Hunter%20-%20The%20Reckoning%20-%20Wayward%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2252720593,"score":7.1,"genres":"Action > Role-playing (RPG) > Top-down > Isometric > Horror > Licensed","desc":"<p>The town of Ashcroft is plagued by darkness once again.  A cult of evil has formed; the undead threaten the living.  All that stands between light and darkness is a group of Hunters, rogues and renegades who have had their life touched by darkness and now battle against it.  </p><p>This one or two-player game allows the player/s to pick among five unique Hunters and battle the undead in Ashcroft using a variety of weapons and special powers called Edges.</p>"},{"name":"Hurrah! Sailor","year":2004,"developer":"Datam Polystar"},{"name":"Hurrah! Sailor (Shokai Genteiban)","year":2004,"developer":""},{"name":"Hustle, The: Detroit Streets","year":2006,"developer":"Blade Interactive Studios Ltd.","url":"sony_playstation2_h/Hustle%2C%20The%20-%20Detroit%20Streets%20%28USA%29.zip","filesize":1826410299,"score":6,"genres":"Sports > Isometric > Pool / snooker","desc":"<p><em>The Hustle: Detroit Streets</em> takes you through the pool halls and clubs of Detroit, as you prove yourself against the masters of the game. Take on the role of either Jack Stone or Kat Hudson as they make their way to the top of the pool circuit through two different game modes. Players hone their pool skills in their quest for respect and cash, alone or in tough AI competition.</p><p>Once you've mastered the AI, you can hook up your network adapter and play against up to 9 friends, or take it online and challenge players around the world.</p><p>The game features over 180 different pool sharks, 200 variations on the game of pool, trick shots, 9 unique venues, character customization and a bevy of non-player characters.</p>"},{"name":"Hyakko: Yorozuya Jikenbo!","year":2009,"developer":"5pb. Inc.","url":"sony_playstation2_h/Hyakko%20-%20Yorozuya%20Jikenbo%21%20%28Japan%29.zip","filesize":1704981312,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Detective / mystery","desc":"<p><em>Hyakko: Yorozuya Jikenbo!</em> is a visual novel adventure game with a high school setting. It features four lead characters from the same-named anime, with the same voice-actresses from the anime. While main protagonist is Torako Kageyama, the story is told from the perspective of all four characters. Aside from Torako, that includes Tatsuki Iidzuka, Suzume Saotome, and Ayumi Nonomura.</p><p>The story revolves around the four high school girls stumbling upon a room in school that is said to belong to a group called Yorozuya (Eng. Jack of all trades). Members of that group, apparently, focus on looking for lost things, helping people and doing other detective-like work. Torako gets attracted to that group and along with her friends becomes a member of Yorozuya group. There, the boss of the group presents them with a task to test their abilities.</p>"},{"name":"Hyakko: Yorozuya Jikenbo! (Shokai Genteiban)","year":2009,"developer":"5pb. Inc."},{"name":"Hype: The Time Quest","year":2001,"developer":"Ubi Soft Entertainment Inc.","url":"PS2_COLLECTION_PART11/Hype%20-%20The%20Time%20Quest%20%28Europe%29%20%28En%2CEs%2CIt%2CNl%29.zip","filesize":608729654,"score":7.2,"genres":"Action > Behind view > Puzzle elements > Fantasy > Licensed","desc":"<p>King Taskan IV celebrates the end of a civil war. The valiant warrior Hype is given the Sword of Peace for his heroic deeds and his loyalty to the throne. However, a mysterious black knight named Barnak appears and casts a powerful spell on Hype, turning him into a statue and sending him two hundred years into the past. The magician Gogoud brings Hype back to life, and the brave knight has to figure out a way to return to his own time, defeat Barnak, and marry his sweetheart Vibe.</p><p>Based on the medieval castle toy series from Playmobil, <em>Hype: The Time Quest</em> is an action game with puzzle-solving and light role-playing elements, similar in style to 3D installment of the Zelda series. Hype primarily fights with close-range weapons, though he can also cast offensive spells in three elemental categories. Hostile areas occupy the largest portion of the game; Hype will explore dungeons, face boss monsters, and will have to hunt for quest items needed to advance the story. Some of the puzzles revolve around time-traveling concept.</p>"},{"name":"Hyper Street Fighter II: The Anniversary Edition","year":2003,"developer":"Capcom Co., Ltd.","url":"PS2_COLLECTION_PART11/Hyper%20Street%20Fighter%20II%20-%20The%20Anniversary%20Edition%20%28Europe%29.zip","filesize":2341590760,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts","desc":"<p>This release celebrates the 15th anniversary of the <em>Street Fighter</em> series. All of the characters from all the <em>Street Fighter 2</em> games (the World Warrior, Hyper Fighting, Championship Edition, Super, Turbo, and Super Turbo) have been brought into one, brand new <em>Street Fighter 2</em>.</p><p>Also included in the PlayStation 2 disc is the 1994 animated feature film <em>Street Fighter 2: The Animated Movie</em> in its entirety.</p>"},{"name":"Hyper Street Fighter II: The Anniversary Edition / Vampire: Darkstalkers Collection Value Pack","year":2008,"developer":"Capcom Co., Ltd."}]