[{"name":"I-Ninja","year":2003,"developer":"Argonaut Games PLC","url":"PS2_COLLECTION_PART12/I-Ninja%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1787998798,"score":7.1,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Martial arts","desc":"<p>A robot army led by Master O-Dor has destroyed the ninja clan. As the last of your kind, you must take on the robot army and defeat Master O-Dor. You play a cartoon ninja with a big head in a level-based 3D platform game. Each level is packed with new skills to master, challenges to beat, and grades to earn.</p><p>Various power-ups can be acquired as you progress, including sword upgrades, shurikens, darts and a ninja revive move which boosts your health.</p>"},{"name":"I-O","year":2006,"developer":"Regista Ltd.","url":"sony_playstation2_i/I-O%20%28Japan%29.zip","filesize":3970273104,"score":"","genres":"Adventure > 3rd-person (Other) > Anime / Manga > Visual novel > Cyberpunk / dark sci-fi > Detective / mystery","desc":"<p>April 26, 2032, 12:12 AM, Tokyo. During the first lunar eclipse in three years, the Moon turns blood red, and strange, inexplicable events begin happening all over the city. Computers everywhere begin going haywire, students go missing, and and a boy receives a message from his sister who vanished more than two years prior. Nobody seems to know what is going on, and it seems like society is heading for a grand collapse...</p><p><em>I/O</em> is a sci-fi mystery visual novel. There are three main protagonists: Hinata Aoi, a terminally-depressed teenage boy; Ishtar, a freelance programmer who leads the hacker team \"Criminal\"; and a mysterious man known only as \"He\". The player proceeds through one of four scenarios as their chosen characters, making regular decisions which will affect not only the flow of that scenario and lead to many different endings, but also affect what options are available in other scenarios, and even potentially unlocking completely new scenarios. Dialogue is fully-voiced, and there are quick-save and chat log options available.</p><p>The PC release, <em>I/O revision II</em>, adds additional character portraits and revises some of the text, but is otherwise identical to the original PS2 release.</p>"},{"name":"I-O (Special Edition)","year":2006,"developer":"Regista Ltd."},{"name":"I.Q. Remix+: Intelligent Qube","year":2000,"developer":"Sugar & Rockets, Inc.","url":"sony_playstation2_i/I.Q%20Remix%2B%20-%20Intelligent%20Qube%20%28Japan%29.zip","filesize":341525554,"score":"","genres":"Action > Puzzle > Top-down > Direct control","desc":"<p><em>I.Q. Remix+</em> is an enhanced version of the PlayStation game Intelligent Qube. Gameplay is essentially the same: blocks of qubes roll toward the player, who must mark squares on a grid to destroy them. There are also green advantage qubes which can be used to zap a 3x3 block all at once and black forbidden qubes which the player is not allowed to destroy.</p><p>The game contains unique features such as psychedelic background effects to distract the player (the original I.Q had a stark black backdrop), an electronic-themed soundtrack, and two-player simultaneous play.</p>"},{"name":"Ibara","year":2006,"developer":"CAVE Co., Ltd.","url":"sony_playstation2_i/Ibara%20%28Japan%29.zip","filesize":144704497,"score":"","genres":"Action > Top-down > Anime / Manga > Arcade > Shooter","desc":"<p><em>Ibara</em> is a vertical scrolling shoot 'em up. The back story revolves around a group of sisters, led by Professor Teresa Rose, who want to destroy all technological progress in the land of Edelweiss, essentially turning it into a rose garden. Players can choose to either lead the characters Bond or Dyne and their airplanes through several levels of \"bullet hell\"-style gameplay in an attempt to defeat the sisters.</p><p>The player's weapons arsenal consists of a main gun and bombs. Bombs must be collected in fragments, and once the player has all of them, the Hadou Cannon can be used. Staying behind the cannon will make the player invincible for the duration of the effect. Additionally, enemies drop various \"options,\" up to two of which can be attached to the wings of the plane to further increase fire power.</p><p>The game has a ranking system. If the player does really well, they go up in rank and thus boss battles will be a lot harder. Rank can be strategically decreased either by dying or by collecting roses, which are created from enemy bullets when the player sets off a bomb. Scoring works by collecting gold medals dropped by destroyed enemies. They must be quickly collected to keep up a scoring chain. Once a new medal pops up, and the medals on screen already haven't been collected yet, the chain is broken.</p>"},{"name":"Ice Age 2: The Meltdown","year":2006,"developer":"Eurocom Developments Ltd","url":"PS2_COLLECTION_PART12/Ice%20Age%202%20-%20The%20Meltdown%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":2042447292,"score":6.7,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Licensed","desc":"<p><em>Ice Age 2: The Meltdown</em> is loosely based on the movie of the same name. The game takes place in prehistory - you play as Scrat, the hapless (but not totally helpless!) proto-squirrel, helping your friends escape the coming of a huge flood.</p><p>In the Windows version the WASD keys move you forward and back, left and right, and the mouse controls camera movement and some actions. Scrat has a few special moves as well, such as sniff, his spin attack, a double jump, a ground stomp (useful for breaking ice), and a roll attack. Much of the game consists of hunting down acorns and other special nuts for health renewal or for unlocking bonuses. There are a few mini-games within the game - you can play as Sid, zipping along an ice slide while avoiding obstacles; there's also penguin-bowling and a mini-game where you \"shoot\" at monkeys to regain a walnut that was whisked out from under your nose.</p>"},{"name":"Ice Age: Dawn of the Dinosaurs","year":2009,"developer":"Eurocom Developments Ltd","url":"sony_playstation2_i/Ice%20Age%20-%20Dawn%20of%20the%20Dinosaurs%20%28USA%29%20%28En%2CFr%29.zip","filesize":3072876774,"score":7.1,"genres":"Action > 3rd-person (Other) > Platform > Licensed","desc":"<p><em>Ice Age: Dawn of the Dinosaurs</em> is based on the animated movie of the same name. The story has the basic premise that Sid gets kidnapped by dinosaurs and his friends need to save him. During the course of the game the player takes control over six characters - most of them vary notably regarding gameplay.</p><p>Most of the time is spent in a 3rd person platformer where the player controls his character while jumping over gaps, avoiding enemies and collecting items. Depending on the character the player has different attacks at his disposal. There are also numerous levels with are basically mini games, e.g. a classic 2D platforming section, a side-scrolling shooter, balancing on a snowball or dogfights while riding a pterodactyl.</p>"},{"name":"Ichigeki Sacchuu!! HoiHoi-san","year":2003,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"sony_playstation2_i/Ichigeki%20Satchuu%21%21%20Hoihoi-san%20%28Japan%29.zip","filesize":314726394,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Shooter > Licensed","desc":"<p>In the near future, household pests have become highly resistant to all kinds of chemical pesticides. Naturally, the answer to this plague is miniature customizable robots, programmed to hunt down and destroy household pests using miniaturized weapons. A lonely young man named Aburatsubo has just purchased Mars Pharmaceuticals' latest model, ID-3 HoiHoi-san, a cute 10cm pink-haired girl in a maid dress made to serve his every whim, just so long as that whim is to ruthlessly gun down cockroaches.</p><p><em>Ichigeki Sacchū!! HoiHoi-san</em> (\"One-Shot Extermination! HoiHoi-san\") is a third-person action shooting game based on the eponymous manga by Kunihiko Tanaka. The player takes direct control of HoiHoi-san in various mission-based stages. The goal of each stage is generally to defeat a certain number of pests, while avoiding their attacks and ensuring that HoiHoi-san's batteries remain charged. Two different weapons can be equipped at any given time, including both long-range firearms and short-range bladed weapons, among numerous others.</p><p>As stages are cleared, the player earns money which can be used to purchase new outfits and weapons for HoiHoi-san at the local drug store. An unusual feature of the game is an optional filter that obscures the appearance of the various pests, so even those who can't stand the sight of cockroaches can play!</p>"},{"name":"Ichigeki Sacchuu!! HoiHoi-san (Genteiban)","year":2003,"developer":"","url":"sony_playstation2_i/Ichigeki%20Satchuu%21%21%20Hoihoi-san%20%28Japan%29%20%28Genteiban%29.zip","filesize":314726406,"score":"","genres":"Special edition > Physical extras > Licensed","desc":"<p>This limited-edition release of Ichigeki Sacchū!! HoiHoi-san includes the game along with a 1:1 scale poseable <em>HoiHoi-san</em> action figure that includes several different weapon accessories.</p>"},{"name":"Ico","year":2001,"developer":"Team Ico","url":"PS2_COLLECTION_PART12/Ico%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":741252912,"score":8.5,"genres":"Action > 3rd-person (Other) > Cinematic camera > Platform > Puzzle elements > Direct control > Fantasy > Regional differences","desc":"<p>Ico is a boy with horns. At the age of twelve, when his horns grew large enough, the elders send him away to be sacrificed in order to prevent evil spirits from attacking the village. Entombed in a crumbling ancient castle, Ico only manages to begin his escape when a freak earthquake shakes loose the vessel he has been locked in. Ico shortly meets a princess named Yorda, who has been imprisoned by the evil queen. The two children must explore the ominous castle, trying to find a way to escape, persecuted by the queen's shadow minions.</p><p><em>ICO</em> is a third-person perspective game that mixes action-based exploration gameplay with puzzles. The game is set almost exclusively in the castle, which consists of dozens of rooms, passages, platforms, and contraptions. Ico will run, climb, and jump his way through these environments. The puzzles in the game are physical (environmental): Ico must push and pull objects, manipulate switches, re-arrange structures, etc. </p><p>Yorda will accompany Ico throughout most of the game. Many of the puzzles revolve around creating a way for Yorda to access special glowing blue doors, which only she is capable of unlocking with her powers. Being less athletic than Ico, Yorda will often need a more comfortable path built for her. Ico can hold Yorda's hand to lead her with him, and also call her to come nearer. </p><p>With the exception of the final (and only) boss, all the enemies in the game are shadows. They attack in groups, either at pre-set points, or when Ico is separated from Yorda for a long time. Their goal is always the same: to capture Yorda and carry her towards a black whirlpool. If the player fails to rescue her before she is consumed by this shadow portal, the game is over. Conversely, Ico can not be killed by the shadows; they can only push him, preventing him from reaching Yorda in time. The player must therefore fend off the shadows (Ico uses a stick for the largest portion of the game), at the same time hurrying towards Yorda. Protecting and rescuing Yorda is one of the primary gameplay elements in <em>ICO</em>.</p><p>The game has no HUD (heads-up display). Other distinguishing features are the soft lightning visual style, low-key use of in-game music, and conversations through a fictional language, leaving much to the player's imagination.</p>"},{"name":"Idol Janshi Suchie-Pai IV","year":2007,"developer":"Jaleco Entertainment, Inc.","url":"sony_playstation2_i/Idol%20Janshi%20Suchie-Pai%20IV%20%28Japan%29.zip","filesize":1477862207,"score":"","genres":"Strategy > Top-down > Anime / Manga > Cards / tiles","desc":"<p><em>Idol Janshi Suchie-Pai IV</em> is the fourth main game in the <em>Idol Janshi Suchie-Pai</em> series (discounting Bishōjo Janshi Suchie-Pai). Kyoko Misaki (Suchie-Pai) is missing, and Shoko Misaki has come to town looking for her. Shoko can also transform into a hero: Suchie-Pai S. She is the manager at the You and Me Cafe, and she enlists the help of maids from other cafes to find Kyoko.</p><p>Like previous titles, you play strip mahjong against young attractive girls. This time, however, no actual nudity is present. Characters include both new and familiar faces. There is also a sound test for listening to vocal tracks, a dialogue replay mode, and a photo mode with costumes that can be purchased, as well as a replay match mode.</p>"},{"name":"IGPX: Immortal Grand Prix","year":2006,"developer":"Sting, Inc.","url":"sony_playstation2_i/IGPX%20-%20Immortal%20Grand%20Prix%20%28USA%29.zip","filesize":830672633,"score":"","genres":"Action > Racing / Driving > 3rd-person (Other) > Anime / Manga > Fighting > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>In the year 2049, and the most popular sport in the world is a combat race played by teams of robots. These high-speed machines, called IG Machines, travel at speeds surpassing 350mph on twisting tracks measuring 60 miles or longer, and the racers will fight brutally to be the first to the finish line.</p><p><em>Immortal Grand Prix</em> is a combination fighting/racing game based on the anime series of the same name. Control your team of pilots in a 3-on-3 race where the robots involved will literally fight for position. You can switch freely between each pilot on your team and give them orders. Between races you can customize your mechs in a variety of ways.</p><p>The game offers multiple Grand Prix levels to play through, as well as a two-player versus mode and a training mode.</p>"},{"name":"IHRA Drag Racing 2","year":2002,"developer":"","url":"sony_playstation2_i/IHRA%20Drag%20Racing%202%20%28USA%29.zip","filesize":171961179,"score":"","genres":"Racing / Driving > Behind view > Real-time > Direct control > Automobile > Licensed","desc":"<p>NOTHIN' BUT ATTITUDE!<br>IHRA Drag Racing 2 features some of the world's best-known drag racing stars racing in today's hottest cars on 1/4 and 1/8-mile tracks. Whether you're new to drag racing or a lifelong fan, IHRA Drag Racing 2 is one game you can't live without. * Experience day and night racing with fully detailed weather and atmospheric dynamics * Choose from 50 vehicles, including classics and late models * Features top cars and drivers from Top Fuel, Pro Mod, Pro Stock, and Funny Car * Customize 70 vehicle components, from tires to transmissions to electronics</p>"},{"name":"IHRA Drag Racing: Sportsman Edition","year":2006,"developer":"Bethesda Game Studios","url":"sony_playstation2_i/IHRA%20Drag%20Racing%20-%20Sportsman%20Edition%20%28USA%29.zip","filesize":228339220,"score":"","genres":"Racing / Driving > 3rd-person (Other) > Behind view > Real-time > Direct control > Automobile > Track racing > Licensed","desc":"<p>Experience the next generation of drag racing action with IHRA Drag Racing Sportsman Edition, featuring intense bracket racing between cars of all makes and models.</p><p>Choose the Arcade Mode for instant action in a single event or two-player split screen race. For more in-depth play, select the Season Mode to experience the excitement and challenge of an IHRA Sportsman 12-event season.</p><p>* Official IHRA Bracket Racing rule set of the Sportsman Series - featuring Top Sportsman and Top Dragster car classes.<br>* Customize, tweak, and tune 60 cars in the Garage's Paint Shop or Parts Store.<br>* 22 total tracks to race and unlock, including 11 officially licensed IHRA tracks and 11 original tracks.<br>* Customizable controls and DUALSHOCK® analog controller support.<br>* Split-screen multiplayer support.</p>"},{"name":"IHRA Professional Drag Racing 2005","year":2004,"developer":"Bethesda Game Studios","url":"sony_playstation2_i/IHRA%20Professional%20Drag%20Racing%202005%20%28USA%29.zip","filesize":675275488,"score":"","genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>As with the 2004 edition, <em>IHRA Professional Drag Racing 2005</em> is a simulation of drag racing. However, the 2005 edition has been radically changed to be more accessible and is built on an entirely new code base. The controls have been modified and many functions have been automated. The graphics have also been improved, along with a new physics model.</p><p>Included is an arcade mode, in both singleplayer and multiplayer, as well as a new simulation mode. In the simulation mode, there is a series of racing tests/tutorials to teach the basics, then purchasing and customizing a car, then going drag racing. The game contains 24 official drivers and 11 official tracks. There are 35 vehicles and 70 vehicle components to customize, from tires to transmissions to electronics.</p><p>The game features the official endorsement of the International Hot Rod Association.</p>"},{"name":"Ikki Tousen - Shining Dragon","year":2007,"developer":"Dream Factory Co., Ltd.","url":"sony_playstation2_i/Ikki%20Tousen%20-%20Shining%20Dragon%20%28Japan%29.zip","filesize":474501089,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Martial arts > Licensed","desc":"<p><em>Shining Dragon</em> is a 3D action fighting game based on the <em>Ikkitōsen</em> anime franchise created by Yuji Shiozaki, also known as <em>Battle Vixens</em> internationally. Tying in with the events of the anime's second season, it presents an original scenario where a mysterious woman named Chōsen appears, seemingly bent on stealing the powers that heroine Sonsaku Hakufu and her friends possess.</p><p>The game plays much like a classic beat-'em-up, only in full 3D. Each character has light and heavy attacks, which can be strung together into various combo attacks, as well as the ability to block enemy attacks. Each character also has a super power mode, which must be charged up by landing hits on the opponent. In most situations, the goal is simply to defeat the opponent without running out of health.</p><p>The main Story Mode follows a basic pattern. Each chapter begins with an \"adventure\" sequence where the characters interact via still images and voice overs, much like a traditional visual novel. This leads into a two-stage fight, where the first part pits the player against a group of weaker enemies, while the second is a one-on-one fight against a boss. After each stage, the player earns points based on their performance, which can be used to upgrade their character's abilities, then the adventure part begins again. There is also a Mission Mode where the player can challenge specific timed objectives.</p><p>There are six characters available to choose from in the story mode, each with their own scenario: Sonsaku Hakufu, Ryomō Shimei, Kanu Unchō, Chōun Shiryū, Chōhi Ekitoku, and Ryūbi Gentoku. A further four characters can be unlocked for play in the mission mode: Chōsen, Kakōen Myōsai, Ryofu Hōsen, and Ukitsu. There is also an unlockable mode called Cosplay Mode where the characters wear various special outfits; it is structured like the Scenario Mode, only without the adventure parts.</p>"},{"name":"Ikki Tousen - Shining Dragon (Gentei Bakuretsu Pack)","year":2007,"developer":""},{"name":"Iku ze! Onsen Takkyuu!!","year":2000,"developer":"Psikyo","url":"sony_playstation2_i/Iku%20ze%21%20Onsen%20Takkyuu%21%21%20%28Japan%29.zip","filesize":304546064,"score":"","genres":"Sports > 3rd-person (Other) > Anime / Manga > Ping pong / table tennis","desc":"<p><em>Ikuze! Onsen Takkyū!!</em> is a 3D table tennis game featuring two modes: story and versus (against another player or the computer). There are 6 stages to play in and 8 characters to choose from, seven fictional ones plus real life Japanese table tennis player Ai Fukuhara. Each of the eight characters has their own plot in the story mode, with cutscenes and voice acting. Gameplay is simple; two buttons for different shot types while the left analog stick/d-pad moves the player. If the ball is high in the air, with precise timing and good positioning, a super-move can be executed, delivering an especially powerful and well-placed shot.</p>"},{"name":"Impossible Mission","year":2007,"developer":"Ziggurat Interactive, LLC","url":"sony_playstation2_i/Impossible%20Mission%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":96304379,"score":5.9,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Sci-fi / futuristic > Spy / espionage","desc":"<p>In six hours the evil Professor Elvin Atombender's nuclear missiles will launch and destroy strategic locations on the earth. Only one agent can infiltrate his secret base and undertake this <em>Impossible Mission</em>.</p><p>The goal of <em>Impossible Mission</em> is to acquire nine passwords and bring these to Atombender's Control Room in time to shut down the rockets. Unfortunately these passcodes (contained on punch cards) have been broken into four pieces each, and each piece hidden in computers, furniture, and waste bins throughout the base. On top of that Atombender has an entire army of robots patrolling the base. If a robot touches or shocks the agent then ten minutes are removed from the clock and the room is reset. The agent can jump over robots, but the only way to stop them is to expend a specific item on a room's computer terminal, and even that only disables them for a few seconds.</p><p>The 2007 release of the game has a few improvements over the original version, mostly to improve the graphics and make the game easier. The player can select one of three agents, although all of them possess the same abilities. Robots are now color coded according to what they are capable of doing (yellow only patrol, red patrol and shock, blue can follow and shock), but some aspects of each robot's personality can still only be figured out by watching or approaching them. Finally an easy mode has been added that adds an extra two hours to the clock and marks rooms which you have cleared out of items. The original mode with the original graphics can also be played, as well as a \"mixed\" mode that uses the old avatar graphics, makes all robots the same color, but keeps any other graphical upgrades.</p>"},{"name":"In the Groove","year":2005,"developer":"Roxor Games, Inc.","url":"sony_playstation2_i/In%20the%20Groove%20%28USA%29.zip","filesize":3846478417,"score":7.2,"genres":"Action > Music / rhythm > Direct control","desc":"<p><em>In The Groove</em> is a dancing game similar to the games in the Dance Dance Revolution series. Gameplay involves watching arrows scroll up on top of a music video and the player has to step on the corresponding arrows on the dance mat in time..Performing well will start a combo meter going up, but if the player misses to many the game will end. The unique aspect of the game is arrow modification. Arrows can be modified which can alter the difficulty with things such as no jumps, spinning, or increased speed making things easier or harder for the player.</p><p>The game consists of several modes:* Dance Mode: lets the player choose to play with either one (Singles) or two (doubles) dance pads. Players can choose to play through one to seven songs, or an endless amount if event is selected.</p><ul><li><p>Battle Mode: lets the player compete against another player or a computer controlled opponent. Both players share a life bar and a three leveled combo gauge. If one of the players fills the combo gauge, a random arrow modifier will be activated for the opposing player.and depending what level the combo gauge was at, the more stronger the modification that will be added. The winner is the player who has the longer life bar at the end of a song.</p></li><li><p>Marathon Mode: the game lets players select from preset packages of songs. Players have to complete four or five of these songs in a row. The songs can be played with a Normal or an Intense option selected, with the Intense option increasing the difficulty. Beating a package of songs opens up more packages to choose from.</p></li><li><p>Fitness Mode: players enter their weight and indicate their weight loss goal. Then they can select a song, a package of songs, or an endless amount of random songs. The game counts the calories being burned during the play session.</p></li><li><p>Practice Mode: lets the player practice any part of a song. There is also an in-game interactive tutorial video to ease the player into the gameplay.</p></li></ul><p>The game contains over 70 songs that have between four or five different difficulty settings (Novice, Easy,Medium, Hard, and Expert). The game also keeps track of the players scores.</p>"},{"name":"Incredible Hulk, The","year":2008,"developer":"Edge of Reality, Ltd.","url":"PS2_COLLECTION_PART12/Incredible%20Hulk%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":4053059518,"score":5.5,"genres":"Action > 3rd-person (Other) > Sandbox / open world > Licensed","desc":"<p><em>The Incredible Hulk</em>, based on the 2008 film of the same name, is a 3rd-person open world game that focuses on the Hulk's incredible physical strength. The game allows the user to control Hulk in a large recreation of New York City allowing Hulk to smash cars, buses, lamp posts, and even entire buildings using a combination of jump attacks, charge attacks, and punches. After destroying cars and buildings pick up debris and us it to smash even more. The story mode follows Hulk and Rick Jones on their quest to stop an evil organization called the Enclave, the Army, and to rid Banner of his alter ego, the Hulk. </p><p>Standard control configuration uses the left analog stick to move Hulk, the right analog stick to pan the camera 360 degrees around, and the face buttons to perform punches, jumps, and grabs. The game features hundreds of collectible items, some of which unlock bonus art, unlockable special characters, and numerous mini-games.</p>"},{"name":"Incredible Hulk, The: Ultimate Destruction","year":2005,"developer":"Radical Entertainment Inc.","url":"PS2_COLLECTION_PART12/Incredible%20Hulk%2C%20The%20-%20Ultimate%20Destruction%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":2072625023,"score":8,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > RPG elements > Sandbox / open world > Licensed","desc":"<p>The Incredible Hulk faces against his greatest adversary - the Abomination - in a free-roaming, open-world action-adventure.  Every object is interactive, plus you can also wield the power of 'weaponization', whereby you can create new weapons from everyday objects.  As the most powerful creature on earth, take the battle from the city to the badlands, smash six classic Marvel bosses and finally defeat the Devil Hulk inside your mind.</p>"},{"name":"Incredibles, The","year":2004,"developer":"Heavy Iron Studios, Inc.","url":"sony_playstation2_i/Incredibles%2C%20The%20-%20Os%20Super-Herois%20%28Portugal%29.zip","filesize":1096561445,"score":6.3,"genres":"Action > Behind view > Platform > Licensed","desc":"<p>This game is based on the hit Pixar film of the same name and same plot.</p><p>The action game sees you controlling the Incredible family members, each with their own superpowers. Lift insanely heavy objects, bash through walls as Mr. Incredible, stretch to swing across chasms and grab enemies as Mrs. Incredible as well as taking control of their kids' Dash (run amazingly fast) and Violet (invisibility) in the 3D action game.</p>"},{"name":"Incredibles, The: Rise of the Underminer","year":2005,"developer":"Heavy Iron Studios, Inc."},{"name":"Indiana Jones and the Emperor's Tomb","year":2003,"developer":"The Collective, Inc.","url":"PS2_COLLECTION_PART12/Indiana%20Jones%20and%20the%20Emperor%27s%20Tomb%20%28Europe%29.zip","filesize":917094847,"score":7.2,"genres":"Action > Behind view > Puzzle elements > Interwar > Licensed > Regional differences","desc":"<p>Indiana Jones is at it again. This time, he must travel his way through-out Asia to recover an artifact that, according to those who required his assistance, is the most powerful in the world. As usual, Indy isn't the only one who is out to find the treasure, with the Nazi's right on his tail.</p><p>Along with a heavy dose of exploration, whip cracking and platform jumping, you will also control Indy through fighting elements against a range of enemies. Hand-to-hand combat and a collection of weapons (from guns to table legs) can be used to defend yourself.</p>"},{"name":"Indiana Jones and the Staff of Kings","year":2009,"developer":"Artificial Mind & Movement","url":"PS2_COLLECTION_PART12/Indiana%20Jones%20and%20the%20Staff%20of%20Kings%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1820498175,"score":6,"genres":"Action > 3rd-person (Other) > Puzzle elements > Interwar > Licensed","desc":"<p>In this newest 3D Indiana Jones adventure, the famed archaeologist finds himself once again searching for \"fortune and glory\" by seeking the fabled Staff of Kings, the staff that Moses used to part the Red Sea.</p><p>Set in 1939, Indy's adventures take him across the globe through areas such as San Francisco, Istanbul, Odin and Panama, and he races against time to find the religious artifact before the Nazis do.</p><p>The game features highly interactive backgrounds (called \"Hot Sets\") that allow Indiana Jones to utilize a large number of items and environments that are used to subdue his foes. In addition to his whip, Indy can use his revolver to take out foes in an arcade style shooting mode, and ride vehicles or animals in certain action sequences. Quick Time Events also make up certain action and chase moments, requiring quick timing to get through perilous situations. Multi-player modes are also available, allowing players to re-enact scenes from the movies, or battle against each other.</p><p>While the game is the same for all platforms, the Wii version uses motion controls to simulate Indy's fists, whip, and gun. In addition the Wii version includes an exclusive emulation of the classic PC title Indiana Jones and the Fate of Atlantis.</p>"},{"name":"Indigo Prophecy","year":2005,"developer":"Quantic Dream SA","url":"sony_playstation2_i/Indigo%20Prophecy%20%28USA%29.zip","filesize":1183990095,"score":8,"genres":"Action > Adventure > 1st-person > 3rd-person (Other) > Quick Time Events (QTEs) > Sci-fi / futuristic > Adult > Detective / mystery > Horror > Thriller","desc":"<p>January 2009. On a cold, snowy night in New York City, an ordinary citizen named Lucas Kane, under the control of an unknown force, unwillingly murders a complete stranger in a diner. Once he comes to senses, Lucas realizes he must escape while leaving as little evidence as possible behind. Barely managing to accomplish that, Lucas contacts his brother and tries to understand what has caused him to commit the crime, recalling the events of his own past in the process. Meanwhile, two police detectives investigating the murder, Carla Valenti and Tyler Miles, are determined to find the perpetrator, at the same time trying to deal with the personal problems of their lives.</p><p><em>Indigo Prophecy</em> (<em>Fahrenheit</em> in Europe) is a psychological thriller in which the player is able to control different characters on both sides of a murder - the killer and those who are trying to find him. The game's core gameplay style is adventure. The three protagonists explore various locations, talk to other characters, and interact with the environment in order to advance. However, the game is heavy on various action-oriented sequences, from tasks that must be completed within a limited amount of time to quick time events, which require the player to press the correct button during a scene.</p><p>The game emphasizes realism in the player's interaction with the environment. For example, picking up a rag and cleaning the floor requires the player to move the mouse or the analog stick back and forth, imitating the actual movements of the object. Dialogue with character often imposes time limits on the player; failure to choose the optimal response in time will prompt the game to choose another, not always the optimal one. The player's choice will sometimes influence the subsequent events and the outcome of the entire story, eventually leading it to one of the three possible endings.</p><p>Cinematic treatment is evident in the game's handling of action-based gameplay and cutscenes, which are often seamlessly integrated into each other. An example of this is the split-screen technique, which is often used during the game's most dramatic moments: while the player is trying to complete the required action in time on one screen, another one displays what is happening around the controlled character.</p>"},{"name":"IndyCar Series","year":2003,"developer":"Brain in a Jar Ltd.","url":"PS2_COLLECTION_PART12/IndyCar%20Series%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2229687246,"score":7,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>IndyCar Series</em> is the official game of the 2002 Indy Racing League season, including the world-famous Indianapolis 500. It's a fast-paced racing sim with up to 33 cars racing on track at a time, at speeds well over 220 mph. The game features commentary by Bob Jenkins, and a Masterclass training mode taught by Indy 500 winner Eddie Cheever Jr.</p>"},{"name":"IndyCar Series 2005","year":2004,"developer":"The Codemasters Software Company Limited","url":"PS2_COLLECTION_PART12/IndyCar%20Series%202005%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2053752835,"score":6.8,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Following in the footsteps of the previous game, <em>IndyCar Series 2005</em> once again puts players inside the world of high-speed racing.</p><p>Choose Quick Race to get straight onto the speedway, IndyCar Series to race the entire Indy circuit, or Indy 500 to experience the thrills of the Indianapolis 500 from qualifying to race day.</p><p>The game includes 4 skill levels (Easy, Normal, Pro and Custom), 15 race tracks, a long list of famous professional drivers to choose from, garage tweaking and tuning, driver profile customization, and the \"Masterclass Course\" tutorial. The \"Trading Card Album\" contains the unlockables attained by accomplishing certain feats in the game, such as finishing a race in its entirety. The unlockable content includes the ability to create a custom driver, car accessories, car skins and more.</p><p>In any single player game it is possible for as many as 33 competitors to be onscreen at one time. Friends can play against each other offline in split screen. Multiplayer can be by direct system link or over the internet.</p>"},{"name":"Infinity Plus","year":2008,"developer":""},{"name":"Initial D: Special Stage","year":2003,"developer":"Sega Rosso","url":"sony_playstation2_i/Initial%20D%20-%20Special%20Stage%20%28Japan%29%20%28v2.00%29.zip","filesize":1585290763,"score":"","genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Anime / Manga > Arcade > Licensed","desc":"<p><em>Initial D: Special Stage</em> for PS2 is an enhanced port of the arcade game  <em>Intial D : Arcade Stage (ver2)</em>.</p><p>There are two modes present in the game. The \"Arcade Mode\", as its name suggests, is a direct port of the arcade game, where the player chooses a car from a list of Japan's most famous drift machines, and hits the streets challenging characters out of the manga. The objective here is to simply beat every one of the characters to become the number one driver. As players go along, they collect points, which can be used to upgrade the car.</p><p>The second mode, \"Story Mode\", allows the player to control Takumi, the protagonist of the series. In this mode, there are a number of missions the player must complete. These missions are modelled after the events of the manga and anime series. Most of the missions involve racing characters from the manga, in the same order that Takumi raced them in the original work.</p>"},{"name":"Innocent Life: A Futuristic Harvest Moon - Special Edition","year":2007,"developer":"Arte Piazza Ltd.","url":"sony_playstation2_i/Innocent%20Life%20-%20A%20Futuristic%20Harvest%20Moon%20-%20Special%20Edition%20%28USA%29.zip","filesize":235435597,"score":"","genres":"Simulation > 3rd-person (Other) > Real-time > Managerial / business simulation","desc":"<p><em>Innocent Life: A Futuristic Harvest Moon (Special Edition)</em> is an improvement version of Innocent Life: A Futuristic Harvest Moon released for the PSP. This version has some minor improvements compared to the original PSP version, including better sound quality, higher graphic resolution and a new close-up camera that pans down for conversations, allowing the player to see the characters up close.</p><p>It also has a special dictionary where players can read about all kind of things in the game. Some extra events with Becky character are also represented. The drama section of TB unlocks a stray cat the player can get to come to his farm. Also some prices were tuned to change the game difficulty and in the main quest players need to crop 5,000 in one year opposite to 1,000 in 2 years on the PSP.</p>"},{"name":"Inspector Gadget: Mad Robots Invasion","year":2003,"developer":"Silmarils","url":"PS2_COLLECTION_PART12/Inspector%20Gadget%20-%20Mad%20Robots%20Invasion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":148391571,"score":"","genres":"Action > Side view > Platform > Licensed","desc":"<p><em>Inspector Gadget: Mad Robots Invasion</em> is a 3D platform game that is played from a mostly side view perspective. Dr. Claw is once again attempting to take over the world, this time with advanced robots. Penny and her dog Brain are kidnaped to distract Inspector Gadget. Now you have to save them.</p><p>Gameplay includes platforming and defeating various enemies including Dr. Claws robots and underlings. Sometimes objects like crates can be moved and extra health can be picked up. Inspector Gadget can use a helicopter and extendable legs gadgets to overcome obstacles. The game offers five levels each with their own boss.</p>"},{"name":"Intellivision Lives!","year":2003,"developer":"Realtime Associates, Inc.","url":"sony_playstation2_i/Intellivision%20Lives%21%20%28USA%29.zip","filesize":582195662,"score":6.5,"genres":"Compilation","desc":"<p><em>IntelliVision Lives!</em> is a compilation of over sixty games that appeared on the IntelliVision game system in the early 1980's. You get over sixty games in several categories, and they are:</p><p><strong>Combat and Sorcery</strong>  </p><ul><li>Armor Battle  </li><li>Battle Tanks  </li><li>Biplanes  </li><li>B-17 Bomber  </li><li>Hover Force  </li><li>Sea Battle  </li><li>Sub Hunt  </li><li>Thunder Castle  </li><li>Tower of Doom  </li><li>Utopia</li></ul><p><strong>Unreleased Titles</strong>  </p><ul><li>Number Jumble  </li><li>Space Cadet  </li><li>Demo Cartridge (not a game, but a demo showcasing IntelliVision games)  </li><li>Hypnotic Lights  </li><li>Takeover  </li><li>Magic Carousel</li></ul><p><strong>Space</strong>  </p><ul><li>Astrosmash  </li><li>Space Armada (think Space Invaders)  </li><li>Space Battle  </li><li>Space Hawk  </li><li>Space Spartans</li><li>Star Strike</li></ul><p><strong>Kids</strong>  </p><ul><li>Crosswords  </li><li>Factor Fun  </li><li>Frog Bog  </li><li>Math Master  </li><li>Memory Fun  </li><li>Sharp Shot  </li><li>Word Hunt  </li><li>Word Rockets</li></ul><p><strong>Sports</strong>  </p><ul><li>Baseball (Baseball, World Championship Baseball)  </li><li>Basketball (Basketball, Slam Dunk: Super Pro Basketball)  </li><li>Bowling  </li><li>Boxing  </li><li>Football (Football, Super Pro Football)  </li><li>Golf (Golf, Chip Shot: Super Pro Golf)  </li><li>Hockey (Hockey, Slap Shot: Super Pro Hockey)  </li><li>Racing (Auto Racing, Motocross, Stadium Mudbuggies)  </li><li>Skiing (Skiing, Mountain Madness: Super Pro Skiing)  </li><li>Soccer  </li><li>Tennis  </li><li>Track &amp; Field (Super Pro Decathlon)  </li><li>Volleyball (Spiker: Super Pro Volleyball)  </li><li>Wrestling (Body Slam: Super Pro Wrestling)</li></ul><p><strong>Arcade</strong>  </p><ul><li>Bomb Squad  </li><li>Buzz Bombers  </li><li>Racing Cars  </li><li>Night Stalker  </li><li>Pinball  </li><li>Shark! Shark!  </li><li>SNAFU  </li><li>Thin Ice  </li><li>Vectron</li></ul><p><strong>Gaming and Strategy</strong>  </p><ul><li>Backgammon  </li><li>Checkers  </li><li>Horseracing  </li><li>Las Vegas Poker &amp; Blackjack  </li><li>Reversi  </li><li>Las Vegas Roulette  </li><li>Royal Dealer</li></ul><p>The game also features two video features; one is the history of the IntelliVision, and the other is a collection of interviews with various game programmers who worked with the IntelliVision. You can also unlock bonus commercials for the games (as shown originally in the eighties) by completing goals in certain games (like scoring 20,000 points in Space Armada).</p>"},{"name":"Interlude","year":2003,"developer":"Longshot LLC","url":"sony_playstation2_i/Interlude%20%28Japan%29.zip","filesize":2736337582,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Interlude</em> is a visual novel for PlayStation 2 and an updated port of the original Dreamcast release that came out a little over half a year earlier. The PlayStation 2 release has an updated artwork, expanded story scenario and new CG event scenes.</p>"},{"name":"International Cricket Captain III","year":2007,"developer":"Childish Things Ltd.","url":"PS2_COLLECTION_PART12/International%20Cricket%20Captain%20III%20%28Europe%29.zip","filesize":93959669,"score":"","genres":"Sports > 3rd-person (Other) > Direct control > Cricket > Licensed","desc":"<p>All the action comes to you with TV style replays in the all new 3D highlights. Fully motion captured animations, Ball Tracker cam analysis and all the tension, stress and pressure of coaching your team to ultimate success. Are you up for the challenge?<br><br><br>Features<br>* Brand new 3D game engine and new televisual style display so players can watch the match as well as captain it. With fully motion captured animations.<br>* New 2007 database of each player for the current season, last season and career for Test matches, first class, ODI, List A limited overs, T20 and International T20 cricket.<br>* New Ball Tracker Cam instant replay displays the flight, pitch and line of each and every ball.<br>* Realistic ball dynamics accurately simulating bowler speeds with spin and swing varying according to bowler's style and pitch condition.<br>* Full range of over 60 classic strokes and aggressive slogs covering stops, sweeps, drives, cuts, hooks and many more.<br>* Extended recorded commentaries from Jonathan (Aggers) Agnew.<br>Match Modes<br>* Exhibition Match: go straight into a one off match with two international teams in either T20 or a One Day International (ODI) match.<br>* Match Series: create a Test or One Day series of your choice with any two international teams.<br>* County & International Career: captain both the county team of your choice and international team from the start of the game.<br>* World Cup Series: replay the World Cup tournament in the West Indies or choose from historical World Cups.<br>* Multiplayer: Set-up two player matches to challenge for cricketing glory.</p>"},{"name":"International Cue Club 2","year":2005,"developer":"Icon Games Entertainment Ltd.","url":"PS2_COLLECTION_PART12/International%20Cue%20Club%202%20%28Europe%29.zip","filesize":212333357,"score":"","genres":"Sports > Pool / snooker","desc":"<p>You've rolled into town with $50 in your pocket. Looking to hustle your way towards a few more bucks you step inside \"Shooters\" Pool Hall. It doesn't take long for the other sharks to notice you. If you can keep your nerve, it won't be long before you're making your way to the big leagues against the world's best. International Cue Club 2 delivers the ultimate pool experience across 10 cool locations. With dozens of fully animated characters to play against and over 100 unlockable secrets to discover, you'll be sure to keep racking them up. * Multiple rule variations including 9-ball, 8-ball, Rotation, 6-ball, 10-ball, 15-ball, and Straight Pool. * Over 40 different opponents to face, each with varied experience and skill levels. * Multiplayer modes for up to 8 players, across all game modes.</p>"},{"name":"International Golf Pro","year":2004,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART12/International%20Golf%20Pro%20%28Europe%29%20%28Fr%2CDe%2CEs%2CIt%29.zip","filesize":288111305,"score":5.3,"genres":"Sports > 3rd-person (Other) > Golf","desc":"<p>In <em>International Golf Pro</em> you can play a tournament over 3 different courses - England, Morocco and California, each with 18 holes. There are 3 Different modes of play - Quick Round, Match Play, or Championship mode on top of the Practice Mode. The game has a small selection of semi-famous golfing personalities. It uses the standard Swingometer for the golf swings, where the power and hook/slice is set by your timing and reaction speed.</p>"},{"name":"International Pool Championship","year":2003,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART12/International%20Pool%20Championship%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":62982475,"score":"","genres":"Sports > Behind view > Diagonal-down > Direct control > Pool / snooker","desc":"<p><em>International Pool Championship</em> features multiple game modes such as novice, pool tournament tables, knockout and leagues, multiple difficulty levels from Rookie to Championship and multiplayer options.</p>"},{"name":"International Snooker Championship","year":2004,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART12/International%20Snooker%20Championship%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":61172506,"score":"","genres":"Sports > Pool / snooker","desc":"<p>\"TV STYLE ACTION IN A GREAT</p><p>SNOOKER PACKAGE!\"</p><p>State of the art physics lie at the heart of the amazingly accurate snooker game for your PlayStation® 2. Whilst the high tech enables you to recreate in great detail all of the elements of the great game, the same technology allows you to control the game through simple and incredibly intuitive controls - making this game accessible to everyone.</p><p>Whether you are an expert or new to gaming; or even whether you are an expert or new to snooker - this game will give you hours and hours of great gaming fun. * Recreate all the styles of play found at the Snooker Hall and choose between knockout or leagues * TV style camera angles allow you to get the most from the game play * Pick the type of game to suit your skill level. From Beginner through Pro to Championship level * Play head to head in the competitive 2 player mode - or even against the clock * Fantastic stats and facts options provide detail as you progress * Play over 4 game modes from novice through to an actual pro style snooker tournament</p>"},{"name":"International Super Karts","year":2005,"developer":"Midas Interactive Entertainment Ltd.","url":"PS2_COLLECTION_PART12/International%20Super%20Karts%20%28Europe%29.zip","filesize":47203685,"score":"","genres":"Racing / Driving > Behind view > Track racing","desc":"<p>Racing across the tarmac only inches above the road, International Super Karts gives an adrenalin rush like nothing else. Using every ounce of your driving skill is a must in these high-speed, lightweight vehicles. Take part in a variety of Championships, Exhibition Races and Challenges and unlock extra karts on your way to claiming the Karting crown.<br><br>* 3 kart classes to master, from highspeed commercial karts to insanely fast 250cc super karts<br>* Use the TV style replay to instantly view the action from a number of camera angles<br>* Two player split screen for action packed wheel to wheel racing<br>* Race the 10 incredibly detailed outdoor international venues against fearsome opponents.</p>"},{"name":"International Superstar Soccer","year":2000,"developer":"Major A","url":"PS2_COLLECTION_PART12/International%20Superstar%20Soccer%20%28Europe%29%20%28En%2CDe%29.zip","filesize":592654155,"score":7,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p>International Superstar Soccer is a game for one or two players, or up to four players with multitap. It is by the same team who did the N64 games.</p><p>The six main game modes are represented on the main menu by pentagonal facets on a stylised football, they are:* Open Play: Here the player can select any of the A Teams (22 players) or Under 23 teams (18 players) and play a single match in a stadium of their choosing. These matches can be player vs player, player vs cpu or cpu vs cpu. For each team the game's difficulty, and the motivation of the team, goalkeeper etc can be customised</p><ul><li>World League: Again using any of the A teams or Under 19 teams the player takes part in a round robin league to become world champion. The league can have as few as four or as many as thirty two teams in it, and the tournament can be a single match or a two match round robin affair.</li><li>The International Cup: This is played between sixty four A teams which are divided into sixteen groups of four for the preliminary round. The top thirty two teams then take part in the Group League with the top sixteen taking part in the Final Tournament</li><li>The Under 23 International Cup: This is played between thirty two teams which are divided into eight groups of four for the preliminary round.</li><li>P.K.: This is a penalty kick shootout competition</li><li>Scenario Mode: Ten situations most of which involve trying to win a match, or avoid losing, in the last few minutes of the game. each can be played with up to five difficulty settings</li><li>Under 23 League:</li></ul><p>Players can train and edit their teams, change the formations and tactics before the match. During the match they can adjust camera angles, make substitutions and tactical changes, adjust the game speed and so on. The main game element though is controlling the players, making searching passes and scoring goals.</p>"},{"name":"International Superstar Soccer 2","year":2002,"developer":"Major A","url":"PS2_COLLECTION_PART12/International%20Superstar%20Soccer%202%20%28Europe%29%20%28En%2CDe%29.zip","filesize":467531930,"score":7,"genres":"Sports > Isometric > Football (European) / Soccer","desc":"<p><em>International Superstar Soccer 2</em> is a next-generation update of Konami's International Superstar Soccer, featuring a similar array of modes (friendly, international cup, league, training) to the original. This installment also makes use of an official FIFPro license, meaning that many of the 58 national teams include real player names.</p>"},{"name":"International Superstar Soccer 3","year":2003,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"PS2_COLLECTION_PART12/International%20Superstar%20Soccer%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1065604207,"score":6.7,"genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p>This is the last installment to the discontinued Konami's ISS series, the arcade-oriented brother of the PES/WE saga. In ISS 3 you can choose from Friendly mode, International Cup, Custom League, World League, or Training mode, where you will take part with the best national teams. You will also count with a points system, where for every match you win you will accumulate points that later can be given away in exchange for extra moves, extra modes, or stadiums. There's also a Mission mode, which is quite similar to the Scenario mode previously seen in the earlier ISS games. The game itself has many arcade components, as the possibility to execute spectacular dribblings adorned with flashes and lights or the fact that you can't usually make poor directed shots. The players will also look like their counterparts in real life.</p>"},{"name":"International Tennis Pro","year":2007,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART12/International%20Tennis%20Pro%20%28Europe%29.zip","filesize":93677196,"score":"","genres":"Sports > Behind view > Tennis","desc":"<p>Take to the centre court and smash your way to becoming the number 1 seed on the World’s toughest Pro Tour.<br><br>Stunning international venues, a range of challenging singles and doubles tournaments and great multiplayer game modes will keep you coming back until you’re crowned the world’s greatest!<br><br>* ‘Quick Match’ game modes across men’s and women’s singles and doubles games<br>* Multiplayer support across all modes for 1-4 players!<br>* World Tour mode – Win a series of tournaments and increase your player’s abilities<br>* Create your own character with the player editor.</p>"},{"name":"Inuyasha: Feudal Combat","year":2005,"developer":"Eighting Co., Ltd.","url":"sony_playstation2_i/Inuyasha%20-%20Feudal%20Combat%20%28USA%29.zip","filesize":481485599,"score":5.9,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Direct control > Fantasy > Licensed","desc":"<p><em>Inuyasha: Feudal Combat</em> is a 3D versus fighting game in which you take control of characters from the Inuyasha series. The game offers four chapters in story mode. These are Inuyasha’s chapter, Sango/Miroku’s chapter, Sesshomaru's chapter and Shippo’s chapter.</p><p>Besides the Story mode the game also offers a Mission mode, Battle mode and Practice mode. Twelve characters can be played in the game. In the battle mode players can fight each other or fight as a team against two AI controlled opponents.</p>"},{"name":"InuYasha: The Secret of the Cursed Mask","year":2004,"developer":"Kamui","url":"sony_playstation2_i/Inuyasha%20-%20The%20Secret%20of%20the%20Cursed%20Mask%20%28USA%29.zip","filesize":2257813873,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Fantasy > Licensed","desc":"<p><em>Inuyasha: The Secret of the Cursed Mask</em> is based on an anime series of the same name. You can play either as a teenager boy or a teenager girl, named by the player. The two scenarios are very similar and basically follow the same story: you live in modern-day Tokyo and one day discover a strange symbol in an old storehouse. As a result, you are transported to medieval Japan. You encounter the half-demon Inuyasha, who introduces you to Kagome Higurashi, the heroine of the anime series. Together you embark on a journey to retrieve scattered pieces of the Sacred Jewel and to find a way to get back home.</p><p>This is a fairly traditional Japanese-style RPG with random encounters and turn-based combat viewed from over-the-shoulder perspective. You can attack physically, use special techniques, and power up to combo attacks with multiple characters.</p>"},{"name":"Iridium Runners","year":2008,"developer":"Playstos S.r.l.","url":"PS2_COLLECTION_PART12/Iridium%20Runners%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":433380709,"score":5.9,"genres":"Action > Racing / Driving > Sports > Behind view > Fighting > Tricks / stunts > Sci-fi / futuristic","desc":"<p><em>Iridium Runners</em> is a futuristic running game that pits competitors against each other on hazard-riddled race tracks in foot races. Players can choose one of 20 characters that have unique running skills and techniques. Some of the characters and tracks can only be unlocked as the game progresses.</p><p>All of the runners will do just about anything to win, so the action can become down and dirty. Almost anything goes during the races including knocking opponents completely off the track with a well-placed kick, fist or weapon. Power-ups and booster items are scattered around the course for increasing performance, speed or providing a new method of attack. Strategy comes into play by knowing which character and which \"pod\" sidekick to choose.</p><p>There are three modes of play: Single Race, Cup and Championship. Each offers unique environments, different obstacles and challenges.</p><p>The Single Player game will put the player up against 5 CPU opponents. Multiplayer is offline and includes Deathmatch and Team modes (2 players on 2 teams) and up to 4 players in split screen.</p>"},{"name":"Iris","year":2003,"developer":"KID Corp.","url":"sony_playstation2_i/Iris%20%28Japan%29.zip","filesize":1906113769,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Iris</em> is one of Kid's romantic visual novels with a school setting. This story centers around junior high-school students in their final year and takes place in a town called Hisame-cho during winter time. This visual novel focuses on the story of one's first love. You are Haruki Setohara, a third year junior high-school student, and by selecting different choices in the story, you focus your affections toward the girl of your choice. Leading female characters you get in contact with are Sakura, your classmate, Shinonome, Sakura's close friend, Yui, a junior high school graduate who lives next door, Miu, a first year junior high-school student, Manami, your class president, and Natsumi, your cousin and also your classroom teacher.</p><p>The story branches based on player's choices which are presented at key points in the story. It features many options regarding the style menu for visual design, and sound menu where you can setup the music and even turn on/off voice-acting for an individual female characters. As you play the game, many extras are unlocked which can be accessed from the main menu. Extras include CG artwork, background music, opening cinematic, and a list of the cleared chapters.</p>"},{"name":"Iron Aces 2: Birds of Prey","year":2001,"developer":"Kadokawa Shoten","url":"PS2_COLLECTION_PART12/Iron%20Aces%202%20-%20Birds%20of%20Prey%20%28Europe%29.zip","filesize":489486764,"score":"","genres":"Action > Simulation > 1st-person > Flight / aviation","desc":"<p>The first Iron Aces game took place using World War II era planes. <em>Iron Aces 2: Birds of Prey</em> ignores this limitation and lets the player choose from a variety of fighters including the first jets and missile-armed fighters... right up to the F/A-18 Hornet. The player can fly these fighters on a variety of objective-based missions or set the fighters loose in Free Battle Mode and place any plane type against any other.</p>"},{"name":"Iron Chef","year":2008,"developer":"CyberPlanet Interactive Public Co., Ltd.","url":"PS2_COLLECTION_PART12/Iron%20Chef%20%28Europe%29.zip","filesize":54073629,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements","desc":"<p><em>Iron Chef</em> is a single player timed platform game.</p><p>Cookie and Bread are two cute characters living in the village of Wonderful Land. Everyone in Wonderful Land is happy and lives in harmony with each other and with nature. Cookie and Bread are expert chefs and share a dream that one day they will open their own restaurant so that the rest of the village can share their magical food.  </p><p>One day a giant kidnapped all the people and all the animals in the village. Cookie was one of the victims and brave Bread sets out to rescue her and, of course, everyone else. He strikes a deal with the giant. If Bread can make the giant the world's best food then the giant will let everyone go.</p><p>Thus begins a platform / puzzle game in which Bread must collect food and ingredients over four levels and thirty-two sub levels. In each level the object is to collect the food items before time runs out. This means climbing ladders in the most efficient sequence and dislodging items of food so that they fall into the baskets below. On some levels there are mice who will attack Bread and, if successful, will cost the player one of their three lives. </p><p>Though the greater part of the game is keyboard driven, there are mini-games where a mouse is needed.</p>"},{"name":"Iron Man","year":2008,"developer":"Artificial Mind & Movement","url":"sony_playstation2_i/Iron%20Man%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":1069520341,"score":5.2,"genres":"Action > Behind view > Shooter > Flight / aviation > Licensed","desc":"<p>Mostly based on the 2008 movie Iron Man, this videogame of the one-man-army hero has been released for seven different platforms.</p><p>The game of Iron Man puts you under the skin of Tony Stark. He is a billionaire weapon-industrialist and genius inventor who, after being kidnapped by terrorists who want to force him to build weapons for them, builds an armor instead to escape. Since then, he decided to stop producing weapons and keeps on working on the suit to fight them back.</p><p>The games take the story further, giving the player the chance to go through more than 12 different missions and even fight villains that do not appear on the movie, like Whiplash and Titanium Man. All this is shown through cinematics between every mission and use the voices of actors of the movie like Robert Downey Jr. and Terrence Howard.</p><p>By foot or by air, with the first armor at the beginning and in the characteristic red and gold suit later, using range weapons or melee attacks, the game features Stark fighting with armies of soldiers, tanks, helicopters, canons, etc. with the help of an array of upgradeable weapons like missiles, micro-grenades, repulsive shots, EMP blasts, a flame thrower and the powerful \"Unibeam\". Both the weapons and the suit (propulsion and armor systems) are upgradeable, and there are many special armors from the comics to unlock in most of the versions.</p><p>Differences in this version from the Xbox360/PS3 version consist of altered visuals and altered upgrade system (rather than spending money on them, the player's gear is upgraded based on how much it has been used).</p>"},{"name":"Iron Sea","year":2004,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART12/Iron%20Sea%20%28Europe%29.zip","filesize":98931871,"score":"","genres":"Action > 1st-person > Arcade > Shooter > World War II > War","desc":"<p><em>Iron Sea</em> is a single player shooter game played from a first person perspective set during World War II. In the game the player will take command of a flagship and will refight the navel engagements of 1942, 1943 and 1944.</p><p>The game offers several historical navel battles to play through and can be played on three difficulty setting : easy, normal and hard. Gameplay includes firing the ships guns and torpedoes at enemy surface ships, submarines and planes.</p>"},{"name":"Island Xtreme Stunts","year":2002,"developer":"Silicon Dreams Studio Ltd."},{"name":"Itadaki Street 3 - Okuman Chouja ni Shite Ageru! Katei Kyoushi Tsuki!","year":2002,"developer":"Tamsoft Corporation","url":"sony_playstation2_i/Itadaki%20Street%203%20-%20Okuman%20Chouja%20ni%20Shite%20Ageru%21%20Katei%20Kyoushi%20Tsuki%21%20%28Japan%29.zip","filesize":477758815,"score":"","genres":"Strategy > Top-down > Turn-based > Board game","desc":"<p><em>Itadaki Street 3</em> is, despite what the name might suggest, the fourth title in the long-running Itadaki Street series. In this <em>Monopoly</em>-inspired digital board game, players take turns moving around the board, which is divided into districts made up of multiple properties. Landing on a property allows you to buy it, and owning multiple properties in the same district increases their value, but landing on a property owned by another player forces you to pay them based on the property's value. There are also other types of spaces around the board: chance spaces let you draw a card with a random effect, transport spaces move you to distant locations, and the ever-useful bank gives you a bonus when you reach it.</p><p>This is the first title in the series to be presented in full 3D, including elaborate backgrounds for each map. There is also an in-depth tutorial mode to teach new players how the game works. In addition to the standard Free Play and Tournament modes, there are two new modes present: Training mode, where the player teaches a computer-controlled character by example, trying to train them to be a top player; and Itadaki Quest, which gives specific single-player objectives to complete on preset maps. There are more than 30 maps to play, including returning maps from previous titles.</p>"},{"name":"Italian Job, The","year":2003,"developer":"Climax Group Limited","url":"PS2_COLLECTION_PART12/Italian%20Job%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":679203183,"score":6.2,"genres":"Action > Racing / Driving > 1st-person > Behind view > Automobile > Street racing > Vehicle simulator > Crime > Licensed","desc":"<p>Based on the movie remake of the 1969 film, <em>The Italian Job</em> is the story of a gang of thieves who stage the ultimate gold heist of all time. Little do they know that one of their gang members has double-crossed them, taking the gold and leaving them for dead.</p><p>As a member of the team, it is your job to stage the next big heist of all time, taking back the gold from your former friend. The game allows you to control a range of vehicles that you must drive to destinations before a certain time limit in order for the plan to work. Of course, the Mini comes into play as you escape from the police.</p><p>Apart from the movie based story mode, you can also drive the Mini's through a range of multiplayer modes, including stunt driving and circuit racing.</p>"},{"name":"Itsuka, Todoku, Ano Sora ni.: You no Michi to Hi no Tasogare to","year":2007,"developer":"Lump of Sugar","url":"sony_playstation2_i/Itsuka%2C%20Todoku%2C%20Ano%20Sora%20ni.%20-%20You%20no%20Michi%20to%20Hi%20no%20Tasogare%20to%20%28Japan%29.zip","filesize":1049446951,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Turn-based > Visual novel > Romance","desc":"<p>This title follows a story of Saku — a member of a noble Tatsumi family. Not able to live up to his family's expectations, he receives a word from his grandfather who tells him to live the way he wishes. Saku decides to travel to the estate of Kuumeishi, a town that has never seen the stars due to it's cloud shrouded sky.</p>"},{"name":"Itsuka, Todoku, Ano Sora ni.: You no Michi to Hi no Tasogare to (Shokai Genteiban)","year":2007,"developer":""},{"name":"Izayoi Renka: Kami Furusato","year":2004,"developer":"Chise","url":"sony_playstation2_i/Izayoi%20Renka%20-%20Kamifurusato%20%28Japan%29.zip","filesize":2397236992,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Izayoi Renka: Kamifurusato</em> is a PlayStation 2 port of the PC (Windows) hentai visual novel Izayoi Renka. All adult content has been removed from the PS2 port, and in addition a new scenario and new CG events have been added. The PlayStation 2 version also comes with a soundtrack disc included.</p><p>The story takes place in a small mountain village during an early Showa period. The protagonist returns to his hometown one day, where he reunites with his old friends and meets new ones, and gradually gets caught up in lots of strange incidents in this romance visual novel. The game consists mostly of reading descriptions and listening to dialogues with other characters, where occasional events prompt the player for a response. Characters are not animated during conversations, but change their gestures and poses depending on the occasion.</p>"},{"name":"Izumo 2","year":2006,"developer":"Studio Ego","url":"sony_playstation2_i/Izumo%202%20-%20Takeki%20Tsurugi%20no%20Senki%20%28Japan%29%20%28v2.02%29.zip","filesize":1283393919,"score":"","genres":"Role-playing (RPG) > 1st-person > 3rd-person (Other) > Isometric > Anime / Manga > Turn-based > Adult","desc":"<p>The hero of the game is Takeru, an ordinary Japanese teenager who attends the private academy Izumo. He leads a normal school-boy life, hanging out with his friends, chasing pretty girls, and occasionally training in the martial art of kendo. One day, a terrible earthquake shatters the school. The entire place has become infested by monsters. Takeru must now fight for his life and find a way to stop the invasion.</p><p>The sequel to  Izumo is nearly identical to the predecessor in gameplay and graphical style. As before, the main portion of the gameplay is dedicated to old-school Japanese RPG, with party management, dungeon exploration (now with an auto-map), random turn-based battles (isometric perspective), and learning magical spells of different elements. There are also large chunks of \"visual novel\" gameplay style, during which the player watches events unfold in still pictures. As in the first game, there is nudity and sexual scenes here.</p>"}]