[{"name":"J.League Pro Soccer Club o Tsukurou! 5","year":2007,"developer":"SEGA Corporation","url":"sony_playstation2_j/J.League%20Pro%20Soccer%20Club%20o%20Tsukurou%21%205%20%28Japan%29.zip","filesize":2303919659,"score":"","genres":"Simulation > Sports > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p><em>J.League Pro Soccer Club o Tsukurō! 5</em> is part of Sega's long-running football management sim, updated to the end of the 2006 season. The player takes the reins of a football club that has just reached the J.League Division 2, and must guide it to the top of the division and into Division 1. Standard management options like recruiting, training, and scheduling are of course available. Many features from the previous release have been reworked or redesigned, with the meeting and data views greatly streamlined along with an enhanced match highlight system. Another new addition is the Hometown system, where the player can even guide urban development of the team's home city, turning it into a booming metropolis or a pleasant small town.</p>"},{"name":"Jackass: The Game","year":2007,"developer":"Sidhe Interactive","url":"PS2_COLLECTION_PART12/Jackass%20-%20The%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2244163517,"score":5.9,"genres":"Action > 3rd-person (Other) > Top-down > Arcade > Licensed","desc":"<p>The Jackass crew (minus Bam Margera) is in a jam, while getting ready to begin shooting for their much anticipated TV return, their one and only camera man is injured and it is up to you to get the show going. Take over as your favorite Jackass characters in a series of stunts to earn money to complete the episodes and get footage for the new season.</p><p>To earn money, complete certain tasks or injure yourself which will pay big money, once you earn enough money, your episode will be complete and you can move on to another. Completing episodes will unlock other characters, you get to start out with the core players (Johnny Knoxville, Steve-O, Ryan Dunn and Chris Pontius), while Wee-Man has his own mini-games, called Wee-Games which have ones like Roof Top Cart Stop, Poo Shower and Wee Tattoo.</p><p>Once you complete a stunt in MTV Story mode, you can replay it in Challenge mode and replay the level with new challenges, doing so will earn you more money that you can earn in Jackass-Mart, to unlock costumes, props, more characters to play and classic clips from the TV show. You can also go head to head with a buddy in the Wee Games or compete in a Round Robin up to four players (PS2). The PSP version offers multiplayer through WiFi. Crazy game with a ton of fun stunts to play and has an insane injury system which ranges from anything like turf burn all the way up to broken necks.</p><p>The PSP version supports the editing and exporting of replays. The PS2 version contains more detailed environments, including pedestrians to annoy during the stunts, and an expanded Bail-Out feature, where points are scored based on how many injuries the character sustains.</p>"},{"name":"Jacked","year":2006,"developer":"Sproing Interactive Media GmbH","url":"sony_playstation2_j/Jacked%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":863838953,"score":5.4,"genres":"Action > Racing / Driving > 3rd-person (Other) > Fighting > Motorcycle","desc":"<p>Reminiscent of the classic Road Rash, Jacked is a high-octane arcade motorcycle racer featuring over-the-top combat elements. In Jacked, the world's fastest and hottest motorbikes - including the gas turbine powered Marine Turbine Superbike - can be yours.</p><p>Race across the USA, from New York to LA, fulfill a variety of missions and steal your enemies' bikes at high speed while they are moving by \"jacking\" them.</p><p>Fight your enemies with baseball bats and tazers, flame them with Molotov Cocktails, shoot them off their rides with shotguns or blow them out of the way with frag grenades. When they are stunned you can jack their bikes - at any speed, on the road or in midair. In some missions you can even take your biker gang along to help you out in your endeavors.</p><p>Jacked features an extensive Single Player Mission Mode that includes a big variety of different Race- and Combat Missions. In the Multiplayer Mode you can challenge a friend to a Race or a Gang Battle on the tracks and bikes unlocked in the Mission Mode.</p>"},{"name":"Jackie Chan Adventures","year":2004,"developer":"Atomic Planet Entertainment Limited","url":"sony_playstation2_j/Jackie%20Chan%20Adventures%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.zip","filesize":1084748494,"score":6.8,"genres":"Action > Sports > 3rd-person (Other) > Cards / tiles > Music / rhythm > Platform > Puzzle elements > Fishing > Martial arts > Licensed","desc":"<p>The insidious Dark Hand clan, lead by Valmont, a man possessed by a Chinese demon called Shendu, are planning to free imprisoned demons using a Pan Ku puzzle box. When this box is solved in a specific area of the world, the demon is unleashed, free to wreak havoc once more. It's up to Jackie Chan to travel the world and stop Valmont before he completes his goal.</p><p>Along the way, he will collect twelve mystical Talismans - one for each sign of the Chinese zodiac. These Talismans grant Jackie special powers, including levitation, laser eyes, re-animation, transformation, and invisibility.</p><p><em>Jackie Chan Adventures</em> is a cross between an action-adventure similar to The Legend of Zelda: The Ocarina of Time and a beat 'em up. Players control Jackie, who can perform a variety of Kung Fu moves to defeat enemies. They can also perform Jackie's trademark 'running up walls' technique to reach certain areas. Other areas allow Jackie to interact with characters and play mini-games such as fishing, jump rope or drum playing. The game also features an in-depth collectible card mini-game similar to Yu-Gi-Oh!.</p>"},{"name":"Jade Cocoon 2","year":2001,"developer":"Genki Co., Ltd.","url":"PS2_COLLECTION_PART12/Jade%20Cocoon%202%20%28Europe%29.zip","filesize":1670454587,"score":7.6,"genres":"Role-playing (RPG) > 3rd-person (Other) > Turn-based","desc":"<p><em>Jade Cocoon 2</em> is the sequel to Jade Cocoon: Story of the Tamamayu. The events of the game take place a thousand years after Levant's adventures in the first game. You play Kafu, a young warrior, who must defend his country from an evil force called Kalma.</p><p>The gameplay is pretty similar to that of the first game. It is a monster-breeding RPG. Fight monsters, catch them, breed them, cross-breed them, and create a powerful army that will help you to complete the quest.</p>"},{"name":"Jak 3","year":2004,"developer":"Naughty Dog, Inc.","url":"PS2_COLLECTION_PART12/Jak%203%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CRu%29.zip","filesize":3012983422,"score":8.1,"genres":"Action > Racing / Driving > Behind view > Platform > Shooter > Sci-fi / futuristic","desc":"<p><em>Jak 3</em> is a 3D action platform game and sequel to Jak II. One year has passed since Jak and Daxter saved Haven City from Kor and the attacking Metal Heads, yet Haven City is still immersed in deadly chaos as three groups fight for control of the streets. The people of Haven City have grown to distrust Jak's dark powers, and as rumors boil of Jak's ties with Krew and Kor, the city blames Jak for its current woeful circumstances. When the palace is destroyed by a surprise Metal Head attack, even Ashelin cannot protect Jak as the High Council's power broker, Count Veger, forces Jak into banishment to the desolate Wasteland. Jak is flown to the harsh island and dumped. With Daxter and Pecker bravely by his side, the three begin their next adventure where the battle for the city has just begun.</p><p>Gameplay includes platforming, vehicle racing, rescue missions, hover boarding, playing mini games and shooting at various enemies (including boss fights). Weapons including the shotgun, sniper rifle, machine gun and a powerful blast weapon from the previous game as well as two upgrades for each weapon. The upgrades become available after making progress in the game and at the end the player can freely switch between these twelve weapons.</p>"},{"name":"Jak and Daxter: The Lost Frontier","year":2009,"developer":"High Impact Games, LLC","url":"PS2_COLLECTION_PART12/Jak%20and%20Daxter%20-%20The%20Lost%20Frontier%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%2CPl%29.zip","filesize":2931652069,"score":7.3,"genres":"Action > Behind view > Quick Time Events (QTEs) > Flight / aviation > Sci-fi / futuristic","desc":"<p>Story-wise, <em>Jak &amp; Daxter: The Lost Frontier</em> picks up after the events of Jak X: Combat Racing. Jak, Daxter and Kiera travel to the Brink -- the edge of the known world -- to investigate the recent Eco shortage, and end up caught up in a struggle between the region's inhabitants and a group of Sky Pirates.</p><p>The gameplay is a return to the series' 3D platforming roots -- a balance of jumping/traversal challenges, weapon-based and melee combat. There are also several aerial combat segments (both objective-based and free-form dogfighting), as well as brawler-like stages where the player controls the giant, Hulk-like \"Dark Daxter\". As usual, the player can unlock and customize Jak's Eco powers and vehicles along the way.</p>"},{"name":"Jak and Daxter: The Precursor Legacy","year":2001,"developer":"Naughty Dog, Inc.","url":"PS2_COLLECTION_PART12/Jak%20and%20Daxter%20-%20The%20Precursor%20Legacy%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":938112639,"score":8.5,"genres":"Action > Behind view > Platform > Direct control > Sci-fi / futuristic","desc":"<p>Jak and Daxter are two mischievous village friends who, in spite of the wise (but grumpy) sage, Samos' warning sneak off to Misty Island. There Daxter accidentally falls into a pool of evil Dark Eco, and transforms into a weasel-like creature. Bringing Daxter to his original human form is enough of a problem, and now the Lurkers are using this Dark Eco for their own malign intentions. The plot goes on as the game plays.</p><p>Our hero(es) can jump, double-jump, spin-kick, uppercut, hang onto things, and ride various vehicles and an occasional creature along the way to complete their assigned tasks. There are also several NPCs to interact with and play their side quests and mini-games.</p>"},{"name":"Jak II","year":2003,"developer":"Naughty Dog, Inc.","url":"sony_playstation2_j/Jak%20II%20%28USA%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%2CKo%29%20%28v2.01%29.zip","filesize":3203526305,"score":8.2,"genres":"Action > Racing / Driving > Behind view > Platform > Puzzle elements > Sci-fi / futuristic","desc":"<p><em>Jak II</em> is a 3D action platform game and sequel to Jak and Daxter: The Precursor Legacy. After completing their quest from the original title, Jak and Daxter are shot into another time and space and the future of their planet, and everything is different. The two are split up, with Jak thrown into jail by Baron Praxis, the ruler of Haven City. For two years Jak is experimented on with dark Eco, turning him into an almost Hulk-like character, mean and filled with rage. </p><p>Rescued by Daxter, the two must set off and find a way to shut down the operation and get revenge for Jak's uncontrollable change. Along the way they will meet new friends and deadly enemies (known as Metal Heads), but at least now Jak has something special on his side: weapons, and lots of them. Including a shotgun, sniper rifle, machine gun and a powerful blast weapon. Gameplay includes platforming, vehicle racing, rescue missions, hover boarding, playing mini games and shooting at various enemies (including boss fights).</p>"},{"name":"Jak X: Combat Racing","year":2005,"developer":"Naughty Dog, Inc.","url":"sony_playstation2_j/Jak%20X%20-%20Combat%20Racing%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CRu%29%20%28v2.00%29.zip","filesize":3686512053,"score":7.2,"genres":"Action > Racing / Driving > 3rd-person (Other) > Sci-fi / futuristic","desc":"<p>After saving Haven City once again, Jak and Daxter find themselves poisoned forced into competition on the international car-racing circuit by the execution of Krew's will. </p><p>Featuring over a dozen customizable vehicles designed with unique handling characteristics, players will race through 20 tracks in eight different terrain arenas. With an assortment of power-ups available, including projectile weapons, mines, ranged weapons, turbo boosts, shields, and smart bombs, players should have the means necessary to ensure they're the first to cross the finish line.</p><p>The game supported both offline and online multiplayer. Offline multiplayer is the typical two-player split-screen multiplayer. Online multiplayer was playable with up to five other players. Both modes featured the same game types, which are the same as the single player except that human players are replacing the AI. The  online servers for the game have now been closed.</p>"},{"name":"James Cameron's Dark Angel","year":2002,"developer":"Radical Entertainment Inc.","url":"PS2_COLLECTION_PART12/James%20Cameron%27s%20Dark%20Angel%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2776717503,"score":5.9,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Cyberpunk / dark sci-fi > Licensed","desc":"<p>James Cameron's tv series in game form. Dark Angel has you playing as Max Guevera, a 'genetically engineered super-soldier' running around in a post-apocalyptic Seattle, looking to uncover past, family and the evil plans of the \"- I - Corporation\".</p><p>Most of the game involves beat-'em-up style hand-to-hand combat. Max can pull off a variety of flashy moves such as roundhouse kicks and backflipping off walls. The camera also enters the 'bullet time' mode when she does a combo sometimes. Certain levels ask you to assume use of the few stealth skills that Max has to offer.</p><p>The game features voiceovers by the actual stars of the show - Jessica Alba and Michael Weatherly.</p>"},{"name":"James Pond 2: Codename: RoboCod","year":2006,"developer":"Vectordean Ltd.","url":"PS2_COLLECTION_PART12/James%20Pond%20-%20Codename%20-%20RoboCod%20%28Europe%29.zip","filesize":107502893,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>In his second adventure, James Pond must retrieve the toys Dr. Maybe has stolen. Pond has been armed with an Inspector Gadget-style stretch device, which he can use to view higher areas or claw onto ceilings so as to slide across them.</p><p>The gameplay takes place across worlds themed around particular types of toys, such as sporting goods, candy, and aircraft. The levels scroll sideways, although a small amount of vertical movement is included. On each level Pond must collect 2 penguins and reach the exit, although there are usually multiple exits and lots of secret areas to explore. After completing each pair of two worlds (each of which has three sub-levels), a boss must be faced.</p>"},{"name":"Jaws: Unleashed","year":2006,"developer":"Appaloosa Interactive Corporation","url":"sony_playstation2_j/Jaws%20Unleashed%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2406826666,"score":6,"genres":"Action > Behind view > Puzzle elements > Horror > Licensed","desc":"<p>Based on the film series of the same name, players take control of the Great White killer shark known as \"Jaws\".  In an open-ended world, players visit Amity Island just in time for the 4th of July holiday season, and do what the predator does best: eat, kill, and destroy.</p><p>As the game progresses, Jaws will rampage through aquatic theme parks, chemical plants, beaches and more, facing off against boats, divers, and other marine life.  As players continue through the game, they will earn new upgrades that will allow Jaws to ram, bite, and survive with greater potency.  Up to 32 side quests are available, allowing various item and bonus feature unlockables.</p>"},{"name":"Jeep Thrills","year":2008,"developer":"GameSauce Ltd.","url":"PS2_COLLECTION_PART12/Jeep%20Thrills%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":400802365,"score":"","genres":"Racing / Driving > 3rd-person (Other) > Behind view > Off-roading > Track racing","desc":"<p>Jeep, the undisputed King of off road adventure, invites you to climb into the driver's seat and experience racing like never before! 18 customizable Jeep vehicles (including futuristic concept cars!), 35 intense tracks, and one main objective: conquering the terrain and the elements and owning the planet. From the jungles of Central America to the frozen Alaskan tundra, this is adventure racing like it ought to be! Jeep Thrills! And everyone else? Get left behind.<br><br>* Nearly 20 drivable custom-colored Jeep® vehicles-from the classic World War II body style to<br>* 36 unique outdoor race tracks.<br>* Course spread over six diverse environments- race through hilled jungles, frozen tundra, and treacherous mountain conditions<br>* Find the secret passages on each race track to improve lap times</p>"},{"name":"Jello","year":2008,"developer":"CyberPlanet Interactive Public Co., Ltd.","url":"PS2_COLLECTION_PART12/Jello%20%28Europe%29.zip","filesize":34729090,"score":"","genres":"Puzzle > Fixed / flip-screen > Tile matching puzzle","desc":"<p><em>Jello</em> is a tile matching puzzle game. The playfield consists of a grid of jellos. By clicking on two or more of the same colored adjoined jellos this will remove them from the board. They will then quickly be replaced by more jellos. The bigger the group of jellos removed, the more money earned by the player. Between levels players can buy upgrades with the money they earned. For instance, players can purchase a board upgrade which will add another column of jellos to the playfield. </p><p>The game has three modes:Classic mode - Players have to fill a power meter before time runs out.Short mode - Earn high scores before time runs out. There is no power meter in this mode.Relax mode - Earn money to upgrade items. Time limit only</p><p><em>Jello</em> was reskinned as <em>Monster Eggs</em>.The gameplay is the same, just now with a monster motif.</p>"},{"name":"Jelly Belly: Ballistic Beans","year":2009,"developer":"Blue Monkey Studios, Inc.","url":"PS2_COLLECTION_PART12/Jelly%20Belly%20-%20Ballistic%20Beans%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":63131998,"score":"","genres":"Puzzle","desc":"<p>A fast-paced arcade style game of skill, Jelly Belly Ballistic Beans! combines simple but highly addictive gameplay with a world-recognized license to provide a gaming experience that will appeal to casual players as well as seasoned veterans. Try your hand at hundreds of puzzles across 8 different themes. Simple to pick up, but impossible to put down!<br><br>The main objective is to get the required number of Jelly Belly Beans into the matching cups while scoring points, using power-ups, and earning bonuses along the way. Players use the bean launcher to propel the beans through intricate puzzle patterns. Exploding beans, rocket beans, and extra beans are just some of the power-ups to help players beat the puzzle quickly to score medals.<br><br>Features<br><br><br>* Eight different and exciting themes available including Halloween, Space, and Sport<br>* Play in single-player “Beantastic” mode, or take on a friend in “Battling Beans”<br>* Over 150 unique world layouts providing various objectives with opportunities for high scores medal rewards<br>* Five different game modes including the special “Spill the Beans” game<br>* Extensive single and multiplayer options plus various unlockable game modes and features encourage replay and reward experienced players<br>* Use the Recipe Maker to create special mixes of bean flavors<br>* Collect various power-ups to gain special abilities and empower the beans with spectacular results</p>"},{"name":"Jeopardy!","year":2003,"developer":"Artech Digital Entertainment, Ltd.","url":"sony_playstation2_j/Jeopardy%21%20%28USA%29.zip","filesize":1826680320,"score":"","genres":"Puzzle > Game show / trivia / quiz > Licensed","desc":"<p>The classic TV game show, now interactive. The game is played by picking a dollar amount under a category (Let's say \"<em>Video Games</em>\"), getting presented with an answer (\"<em>This user-contributed database contains information about thousands of games.</em>\"), to which the player who buzzes in first attempts to provide the correct question (\"<em>What is MobyGames?</em>\"). If the question is correct, the player earns that amount of money; otherwise they lose it. If they happen to select one of the rare Daily Doubles, the player instead wagers as much of their current earnings as they wish. In the second round, <em>Double Jeopardy!</em>, dollar values on the board are doubled. In the third round, <em>Final Jeopardy!</em>, there is only one answer. After learning the category each player wagers as much of their earnings as they desire. The player who ends the game with the most money wins. This version of the game has more than 5,200 answers.</p><p>In this version, players can keep a saved profile which keeps track of their name (written by analog stick) as well as statistics on such things as how many answers they've correctly and incorrectly responded to, and the most money they've earned in a game.</p><p>As in most console versions of Jeopardy!, players enter their questions by selecting letters with the analog stick or control pad.  After several letters have been picked, it will start presenting options for you to pick to save time.  For instance, typing in <b>KEL</b> may present options such as <b>KELLOG'S</b> or <b>KELSEY GRAMMER</b>.</p>"},{"name":"Jeremy McGrath Supercross World","year":2001,"developer":"Acclaim Studios Salt Lake City","url":"PS2_COLLECTION_PART12/Jeremy%20McGrath%20Supercross%20World%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":371143412,"score":5.2,"genres":"Racing / Driving > Sports > 3rd-person (Other) > Tricks / stunts > Motorcycle > Licensed","desc":"<p>This updated version of Supercross 2000 lets the players take to 25 different dirt bike tracks, each with their own twists, turns, bumps and jumps while performing insane gravity-defying tricks. Players can customize their bikes to their liking as well as choose from ten professional riders including the game's namesake, Jeremy McGrath. There are also multiplayer capabilities that allows two friends to compete head-to-head through split-screen.</p>"},{"name":"Jet de GO!2","year":2002,"developer":"Taito Corporation","url":"sony_playstation2_j/Jet%20de%20Go%21%202%20%28Japan%29.zip","filesize":2127689359,"score":"","genres":"Educational > Simulation > 1st-person > 3rd-person (Other) > Geography > Flight / aviation","desc":"<p>Jet de GO!2 (translated 'Let's go by airliner!2') is an airliner simulation featuring passenger jets of Japan Air Lines(JAL). It is the direct sequel of the first Jet de GO! game that was released for PSX and Windows.</p><p>Aircrafts available:</p><ul><li>Boeing 737-400 </li><li>Boeing 747-400/D </li><li>Boeing 767-300 </li><li>Boeing 777-200/300 </li><li>DC-10-40</li></ul><p>Hidden aircrafts:</p><ul><li>MD-11 McDonnell Douglas MD-11 </li><li>DC-8 Douglas DC-8 </li><li>YS-11 Japan YS-11 aircraft </li></ul><p>Airports:</p><ul><li>Haneda Airport </li><li>New Chitose Airport </li><li>Komatsu Airport </li><li>Nagoya Airport </li><li>Osaka Airport </li><li>Kansai International Airport </li><li>Hiroshima </li><li>Fukuoka Airport </li><li>Naha </li><li>Shimoji Island Airport</li></ul><p>In comparison to the first game, available destinations now include whole Japan, including Hokkaido and Okinawa provinces.</p><p>Game Modes:</p><ul><li>Scenario modeIt includes plane manoeuvering to the starting strip, takeoff, and landing a variety of playing situations. The purpose is to finish all the scenarios.</li></ul><p>Pilot Mode:It includes departing and arriving with selected aircraft from the airport and on time. You start as newby, as a co-pilot, and will be promoted to captain.</p><p>Free-cruise mode:As it says - just flying, just for fun!</p>"},{"name":"Jet Ion GP","year":2000,"developer":"Gust Co., Ltd.","url":"PS2_COLLECTION_PART12/Jet%20Ion%20GP%20%28Europe%29.zip","filesize":644516760,"score":"","genres":"Action > Racing / Driving > 1st-person > Behind view > Direct control > Flight / aviation > Track racing > Sci-fi / futuristic","desc":"<p><em>Jet Ion GP</em> is set in the year 2040, a time when petrol prices have risen as oil-wells start to run dry. The future of mankind lies in the new technology of Cold Fusion but this is being suppressed by the oil companies who are more powerful than governments. Pilot Jet Jevons leads a rebel faction who learn of this and they fight to give the power back to the governments. He does this by competing in high powered races around the world.</p><p><em>Jet Ion GP</em> is a futuristic racing game for one or two players in which the player(s) pilot high speed aircraft around three dimensional courses avoiding obstacles and dodging enemy fire. All the courses are marked by a ribbon in the sky which the pilot needs to follow because that ribbon is what the craft draw power from. Straying too far from the ribbon means they lose speed, energy, and probably the race.</p><p>Besides Jet Jevons there are other pilots and teams in the race and the player can fly as any of them. The game can be played in four modes:* The Grand Prix mode where the player must qualify for and then compete in a series of five races. Grand Prix' are competed in in five levels of difficulty, Standard, Expert B, Expert A, Master B, Master A, and Master S but only Standard is available at the beginning of the game and as the player progresses additional courses and craft are unlocked. As the player progresses through the race calendar additional vehicles become available, the courses become harder, and the races become longer.</p><ul><li><p>Single Spot where the player qualifies for and competes in a single race.</p></li><li><p>Time Attack where the player attempts to beat the track record for a course.</p></li><li><p>VS which is the two player head-to-head game.</p></li></ul>"},{"name":"Jet Li: Rise to Honor","year":2004,"developer":"Sony Studio Foster City","url":"sony_playstation2_j/Jet%20Li%20-%20Rise%20to%20Honour%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CZh%29.zip","filesize":3280387437,"score":6.9,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Shooter > Crime > Martial arts","desc":"<p>Kit Yun (character model after Jet Li), is an undercover Hong Kong police officer, tasked to protect Chiang, a boss of one of the Hong Kong crime gangs, and a friend of Kit's late father. But Chiang is contemplating leaving the life of crime which doesn't seem to sit well with certain key people in the organized crime and before soon everybody is attempting to assassinate him. Despite his efforts, Kit fails to protect him, but decides to follow the dying man's wish which consequently puts him in a non-stop action.</p><p>This is an action game heavily influenced by Hong Kong action movies with strong emphasis on martial arts. Jet Li motion captured his signature moves which gives this game a feel of actually playing one of his action movies, more to the fact that Cory Yuen was in charge of fighting choreography used in the game.</p><p>Game settings takes place in Hong Kong and San Francisco, both indoor and in the open. Story progress is linear and freedom of exploration is non-existent, but you can utilize your surrounding while fighting your enemies. From time to time you will get to use a cover system when in a firefight, but your main weapon of choice will most of the time be your martial art skill. You will often find yourself surrounded by multiple enemies where you will fight with basic attack moves and various combos. You can slam your enemies to the wall or desk, or hold and slide them along the bar counter, or you can pick certain objects and use them in your combat (i.e. take a stool and toss it at your opponent). Certain moves can be performed with your AI partner, when present, though that may more often be the case when it comes to boss fights.</p><p>Game progresses in an episodic manner through the key checkpoints from which you can continue your story. Audio track also gets unlocked as you progress through the story, and game soundtrack, as well as cut-scenes, can be viewed in audio/video player accessed via main menu. Beside the regular 4:3 aspect ratio, game also supports 16:9 widescreen format.</p>"},{"name":"Jet X2O","year":2002,"developer":"Killer Game","url":"sony_playstation2_j/Jet%20X2O%20%28USA%29.zip","filesize":782935478,"score":"","genres":"Action > Racing / Driving > Behind view > Tricks / stunts > Direct control > Naval / watercraft > Track racing","desc":"<p>THE WILDEST RIDE ON WATER!<br>* Hop a 300 foot waterfall, roar through a raging river and blast through Poseidon's mouth to the ancient city of Atlantis - one of 8 massive, fantastical worlds to conquer.<br>* Catch huge air as you pull off more than 30 insane tricks through wild, multi-path tracks!<br>* Challenge intense riders to wake-eatin' races on any of 10 highly stylized watercrafts.</p>"},{"name":"Jetix Puzzle Buzzle","year":2008,"developer":"Broadsword Interactive Limited","url":"PS2_COLLECTION_PART12/Jetix%20-%20Puzzle%20Buzzle%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":31333769,"score":"","genres":"Puzzle > Fixed / flip-screen > Falling block puzzle","desc":"<p>Build a high tower from falling pieces of all shapes and sizes before the rising water below destroys your progress in this fun and frantic puzzle game!</p><p>Jump up to catch the shape you need, rotate it and place it in your tower without leaving gaps. To win, you must reach the top before your opponent does!</p><p>4 BONUS GAME MODES!</p><p>Demolish your opponent's tower in the explosive Bomb Mode and last as long as possible in Survival Play!</p><p>TRICKS BRICKS!</p><p>Create incredible combos to score big points, and collect bonus bricks to earn extraordinary powers!</p><p>MULTIPLAYER FUN!</p><p>Compete against a friend to see who'll become crowned Puzzle Buzzle champion!</p>"},{"name":"Jikkyou Powerful Pro Yakyuu 12","year":2005,"developer":"Pawapuro Production","url":"sony_playstation2_j/Jikkyou%20Powerful%20Pro%20Yakyuu%2012%20%28Japan%29.zip","filesize":1479118694,"score":"","genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p><em>Jikkyō Powerful Pro Yakyū 12</em> is the 12th installment in the series of baseball games by Konami. It features a tournament mode with 12 real professional teams and 15 high school teams, exhibition mode (for one or two players), and the series trademark Success mode, where players create a player character and train him to become a professional baseball player.</p><p>New to this installment is the Cheering Songs Editor: players can create their own cheering chants. A password system allows the transfer of players and chants to other installments in the series.</p><p>The game is viewed from a behind view when pitching and hitting and a bird's eye view when the ball is hit. The characters as usual are cartoony figures composed of spherical forms.</p>"},{"name":"Jikkyou Powerful Pro Yakyuu 15","year":2008,"developer":"Pawapuro Production","url":"sony_playstation2_j/Jikkyou%20Powerful%20Pro%20Yakyuu%2015%20%28Japan%29.zip","filesize":1865387889,"score":"","genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p><em>Jikkyō Powerful Pro Yakyū 15</em> is one of the many titles in Konami's <em>Power Pro</em> baseball franchise. It features full player rosters for all 12 Central and Pacific league teams, with player data through the 2008 season. Standard league, exhibition, solo career, and home run derby modes are present, along with the series' ubiquitous Success mode featuring two brand new scenarios. There is also a practice mode, and even the ability to compose your own crowd chants. The Wii release also includes a special motion-controlled mode where the player's Miis can be used in-game.</p>"},{"name":"Jikkyou Powerful Pro Yakyuu 2009","year":2009,"developer":"Pawapuro Production","url":"sony_playstation2_j/Jikkyou%20Powerful%20Pro%20Yakyuu%202009%20%28Japan%29.zip","filesize":1960070839,"score":"","genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p><em>Jikkyō Powerful Pro Yakyū 2009</em> is one of the many titles in Konami's <em>Power Pro</em> baseball franchise, and the last to appear on the PlayStation 2. Gameplay and functionality are identical to the previous entry, though the player and team data has been updated for the start of the 2009 season. There is also an additional Success Mode scenario, \"Dream Japan\", which originally appeared in Power Pro 14 Ketteiban, alongside the two scenarios from <em>Power Pro 15</em>.</p>"},{"name":"Jikkyou Powerful Pro Yakyuu 7","year":2000,"developer":"Diamond Head","url":"sony_playstation2_j/Jikkyou%20Powerful%20Pro%20Yakyuu%207%20%28Japan%29.zip","filesize":352830067,"score":"","genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p><em>Jikkyō Powerful Pro Yakyū 7</em> is one of the many titles in Konami's long running <em>Power Pro</em> baseball series, and the first to appear on the PlayStation 2. There are a variety of different game modes, including Exhibition, Pennant Race, and League tournament modes, a Scenario mode that recreates memorable moments in baseball history, a Home Run Derby. The centerpiece is the so-called Success mode, where the player creates a single player and, starting in the minor leagues, trains them up into the majors and maybe even to the hall of fame. There is also a records mode that includes a database of all games from the 1999 season.</p><p>The game is fully-licensed by the NPB and includes player and team data through May 2000. The later-released \"Ketteiban\" is nearly identical but includes player data and match records through the end of the 2000 season.</p>"},{"name":"Jim Henson's Muppets Party Cruise","year":2003,"developer":"Jim Henson Interactive","url":"PS2_COLLECTION_PART12/Jim%20Henson%27s%20Muppets%20Party%20Cruise%20%28Europe%29%20%28En%2CFr%29.zip","filesize":1001205235,"score":"","genres":"Action > 3rd-person (Other) > Board game > Licensed","desc":"<p>The Muppets remember the fun times they had on their last vacation in this 4-player party game. This game follows the pattern of most party games, like Mario Party, for example, in that your overall goal is to win a board game. To win the board game, you must succeed at a variety of mini-games, which may include a wide variety of gameplay styles. Winning a mini-game earns you a party favor of a certain color. The ultimate goal is to accumulate the most party favors to win. Party favors you win can then be used to unlock additional mini-games and bonus videos. If you unlock enough mini-games, you can then unlock a new game board in the main game.</p><p>You can choose to play as Gonzo, Animal, Kermit, Miss Piggy, Pepe, or Fonzie. In addition, a lot of other Muppet characters have cameo appearances.</p>"},{"name":"Jimmy Neutron: Boy Genius","year":2002,"developer":"BigSky Interactive, Inc."},{"name":"Jissen Pachi-Slot Hisshouhou! Hokuto no Ken","year":2004,"developer":"","url":"sony_playstation2_j/Jissen%20Pachi-Slot%20Hisshouhou%21%20Hokuto%20no%20Ken%20%28Japan%29.zip","filesize":124234177,"score":"","genres":"Gambling > 1st-person > Anime / Manga > Licensed","desc":"<p><em>Hokuto no Ken</em> is one of the many titles in Sammy's long-running <em>Jissen Pachi-Slot Hisshōhō</em> pachi-slot simulation series, this one based on Sammy's own <em>Hokuto no Ken</em> machine, in turn based on the famous <em>Fist of the North Star</em> manga and anime created by Buronson and Tetsuo Hara. It offers an authentic reproduction of the real machine, with the standard array of simulation options allowing the player to set up a variety of situations to practice their technique. A video gallery and a <em>Hokuto no Ken</em> encyclopedia are also included as bonus features.</p>"},{"name":"Johnny Bravo in The Hukka-Mega-Mighty-Ultra-Extreme Date-O-Rama!","year":2007,"developer":"Extra Mile Studios Ltd","url":"PS2_COLLECTION_PART12/Johnny%20Bravo%20in%20The%20Hukka-Mega-Mighty-Ultra-Extreme%20Date-O-Rama%21%20%28Europe%29.zip","filesize":324347535,"score":"","genres":"Action > Mini-games > Licensed","desc":"<p>JOHNNY BRAVO</p><p>Wannabe stud Johnny Bravo is thrilled when he's invited to appear on the game show Hukka Mega Mighty Ultra Extreme Date-o-Rama to try to win a dream date with a hot chick, but even with his self- professed stunning good looks, incredible strength, and superior intelligence he has his work cut out to win the competition. Can you beat your rival studs and get the girl in this side-splitting action game based on the hit Cartoon Network series?</p><p>Compete in eight wacky games to impress the chick, including Strike A Pose, Food Fight and Disco Dance-Offi</p><p>Play as Johnny or against him in single and dual-player modes!</p><p>Unlock classic clips from the show, hilarious Johnny 'quips,' and fun Johnny postcards!</p>"},{"name":"Jojo no Kimyou na Bouken - Ougon no Kaze","year":2002,"developer":"Capcom Co., Ltd.","url":"sony_playstation2_j/Jojo%20no%20Kimyou%20na%20Bouken%20-%20Ougon%20no%20Kaze%20%28Japan%29.zip","filesize":3319359843,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Sci-fi / futuristic > Licensed","desc":"<p>Can you handle the power of the Stand?</p><p>In the far future in Italy, the son of the evil vampire Dio, Giorno (nicknamed GioGio), has discovered the power of the \"Stand\", a psychic manifestation that can either assist or hinder the one affected by it. His Stand is the Golden Experience, which can drain the life of his foes to heal himself. GioGio, aided by several of his friends, feels an evil power looming before them, like nothing they've ever seen before. And before it's too late, they must destroy that evil...before it destroys them!</p><p>This game is based on the manga JoJo's Bizarre Adventure by Hirohiko Araki.</p>"},{"name":"Jonny Moseley: Mad Trix","year":2001,"developer":"The 3DO Company","url":"PS2_COLLECTION_PART12/Jonny%20Moseley%20Mad%20Trix%20%28Europe%29.zip","filesize":497420153,"score":6,"genres":"Sports > Behind view > Direct control > Snowboarding / skiing > Licensed","desc":"<p><strong>Jonny Moseley Mad Trix</strong> is an extreme skiing game, in the vein of Tony Hawk's Pro Skater and Dave Mirra Freestyle BMX.</p><p>As Jonny Moseley, or a number of other real-life skiers, you must perform various stunts, of which there are hundreds, to attract the attention of movie studio's, ultimately to film you on runs.</p><p>There are two modes of play; Slopestyle, where you can go down hills and perform stunts without any mission goals or other distractions, and Big Mountain, where you perform tricks to star in a ski movie.</p><p>By performing good tricks, you will be able to see your run on the \"big screen\".</p><p>In Big Mountain mode, you will ski down several real-life mountains, including Everest, Kilimanjaro, and the Alaskan mountains. In Slopestyle, head down fictional environments, like a snowed-in San Francisco, Washington D.C., and Las Vegas.</p>"},{"name":"Judge Dredd: Dredd vs Death","year":2003,"developer":"Rebellion Developments Ltd.","url":"PS2_COLLECTION_PART12/Judge%20Dredd%20-%20Dredd%20vs.%20Death%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":3176353279,"score":6.3,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Licensed > Regional differences","desc":"<p>Judge Dredd is back. The comic book character who acts as judge, jury, and executioner makes another video game appearance in a first-person shooter set in the 22nd century, where crime and hopelessness run rampant amidst the chaos left behind from a nuclear holocaust.</p><p>Players must enforce the law using any means necessary within the sprawling, overpopulated Mega-City One, which serves as the gritty backdrop for <em>Judge Dredd: Dredd Vs. Death</em>. Players will battle vampires, the undead, and even a cadre of Dark Judges as they try to maintain some semblance of order in a world gone wild. In keeping with the spirit of the comic, some perpetrators of lesser crimes need to be arrested while others must be taken out with extreme prejudice. </p><p>The ultimate goal is to confront the evil Judge Death, who has taken it upon himself to cause as much mayhem and destruction to the beleaguered city as possible.</p>"},{"name":"Juiced","year":2005,"developer":"Juice Games Limited","url":"PS2_COLLECTION_PART12/Juiced%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":1679848222,"score":7.2,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Street racing > Vehicle simulator","desc":"<p><em>Juiced</em> is a racing game, set in the fictive Angel City, that embraces the lifestyle and culture of street racing and tuning, similar to Need for Speed Underground, with slick, fully customizable cars, fast races, gaining respect and betting. The arcade mode offers quick races and in the custom mode you can set up events with unlocked cars and tracks. There are 52 vehicles from known manufacturers to acquire, and the game boasts a total of 7.5 trillion car customization possibilities. To make available all cars, tracks and parts, you need to progress in the career mode, where you build cars and participate in racing events to earn cash and respect. Aside from the traditional circuit and point-to-point races, there are also drag races (sprints) and show-offs with difficult maneuvers requiring advanced driving techniques.</p><p>When you achieve acclaim in the career mode, some of the eight racing crews in Angel City will offer a position on their team. Each crew has specific challenges and crew racing introduces additional gameplay elements. You have to organize events by phone, gamble, and race opponents for their cars (pink slip races). The team leader's respect is controlled by the amount of damage given and sustained (distress, which also affects the car's performance) and your personal car collection. In team races, there is a strategic element as you can control your team members' aggressiveness in-game.</p><p>Up to six player can race in the multiplayer mode, in which pink slip races, based on the car collection from the offline career mode, are also available. Statistics are organized on a world ranking server, with record times from singleplayer games and a rating based on your online performance. Ratings can be improved by beating higher-ranked players or multiple drivers in a single race.</p>"},{"name":"Juiced 2: Hot Import Nights","year":2007,"developer":"Juice Games Limited","url":"PS2_COLLECTION_PART12/Juiced%202%20-%20Hot%20Import%20Nights%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1807823845,"score":7.1,"genres":"Racing / Driving > 1st-person > Behind view","desc":"<p>The sequel to Juiced, this version adds more to the original, giving the player an in-depth look at the culture of car tuning and drifting, immersing them in authentic music used at events as well as woman models to showcase next to the cars.</p><p>Players can also race in a variety of events, from drifting, where players are given points and nitrous refills the longer they have their car sideways around a corner as well as playing for pinks, where cars are put on the line, the winner keeping the losers car and even the classic simple racing to the finish line. There is also a career mode, where the player advances through closed in courses, different from the original which had the player avoid against traffic while this version is a more organized feel to it.</p><p>There are authentic Exotics, European, Old Muscle and New Muscle cars to choose from including hundreds of actual racing parts giving them thousands of customization options even with the ability to customize labels and logos for their cars.</p><p>They can also hire and fire crews to work on the cars as well compete against real life drivers and their crews portrayed in the game. Racing takes place all over the world, ranging from England to San Fransisco, even Australia and racing in Rome's famed Coliseum.</p><p>Each version is almost similar, excluding the graphics depending upon each systems respective capabilities and track layout is a bit different in the Xbox 360 version. The PSP version misses the Paris track.</p>"},{"name":"Jumanji","year":2007,"developer":"Atomic Planet Entertainment Limited","url":"PS2_COLLECTION_PART12/Jumanji%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":55577336,"score":"","genres":"Action > Diagonal-down > Top-down > Arcade > Mini-games > Party game > Direct control > Licensed","desc":"<p><em>Jumanji</em> is a video game based on the 1995 movie of the same name that takes inspiration from the Mario Party series. Players take turns moving around the board and, after every player has taken their turn, they play a mini-game.</p>"},{"name":"Jumper: Griffin's Story","year":2008,"developer":"Red Tribe","url":"PS2_COLLECTION_PART12/Jumper%20-%20Griffin%27s%20Story%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2354359178,"score":3.8,"genres":"Action > Behind view > Fighting > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>Jumper: Griffin's Story</em> is an extension of the movie, <em>Jumper</em>, that starred Hayden Christensen. This version tells the story of the Jumper, Griffin, which was portrayed by Jamie Bell in the movie and voiced by him in the game, telling the backstory of how he learned of being a jumper and the family tragedy that lead him into war against the Paladins.</p><p>The gameplay consists of exploring levels, fighting enemies in hand-to-hand combat or using weapons using the teleport ability to get close enough to enemies and retreating, picking up weapons and using the ability to teleport to other locations to finish off his enemies. There are five different locations to explore: The Colosseum, Griffin’s desert lair, Nepal, Tokyo and an experimental laboratory.</p><p>The games are virtually the same, sans graphics and control scheme (the Wii uses the Wii remote) with the story is told through CGI and gameplay graphics are cell-shaded.</p>"},{"name":"Junior Board Games","year":2004,"developer":"Mere Mortals Ltd.","url":"sony_playstation2_j/Junior%20Board%20Games%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v2.00%29.zip","filesize":36375551,"score":"","genres":"Puzzle > Diagonal-down > Side view > Board game","desc":"<p><em>Junior Board Games</em> is a collection of kids' board games:</p><ul><li>Snakes &amp; Ladders</li><li>Ludo</li><li>Dominoes</li><li>A Dice game</li><li>Battleships</li></ul>"},{"name":"Jurassic Park: Operation Genesis","year":2003,"developer":"Blue Tongue Entertainment Pty, Ltd.","url":"PS2_COLLECTION_PART12/Jurassic%20Park%20-%20Operation%20Genesis%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":433534086,"score":7.4,"genres":"Educational > Simulation > Strategy > 1st-person > Diagonal-down > Free-roaming camera > Ecology / nature","desc":"<p><strong>Jurassic Park: Operation Genesis</strong> puts you in the shoes of a Dr. Hammond-type scientist, and challenges you to build a dinosaur themed amusement park.</p><p>Similar to the first movie, you can lay down electric fences. Some fences have a higher electric discharge than others, and are meant for the bigger dinosaurs. While a 100 volt fence might keep a raptor safe, it might take a 500 volt fence to keep a T-Rex from escaping.</p><p>You have various buildings at your disposal, from the standard restaurant and bathroom to gift stalls and photo booths.</p><p>You can opt to construct a safari tour, like what took place in the first movie. You even have the ability to take the tour yourself, and see your park as your visitors see it.</p><p>One of the most important objects is the Ranger Station. With this building, you can have helicopters patrol your park to watch for any disasters. If a dino should escape, you have the option of entering the helicopter in a first person view to try to shoot the dino with a tranquilizer dart. If you want to stick to building only, you can let the AI capture the dino.</p><p>In order to breed a dinosaur, you must hire a team to locate fossils, then you must have the fossils analyzed. The whole process takes a while, but the longer you let your teams work, the longer your dino will live, and the happier your visitors will be. Force the team to give you the results early, and your dino might only live for ten days.</p><p>The different dino's require different resources. Herbivores require lots of trees and grass, while carnivores require goats and cows. Your carnivores may get tired of being fed, so you might have to send in a smaller sized dino (a raptor in a T-Rex pen, for example), for the larger dino to hunt.</p><p>The game includes multiple camera angles. You can rotate 360 degrees, zoom in and out, enter \"visitor\" cam, ride on the safari, take a scenic tour in a hot air balloon, or look out the helicopter.</p><p>Also included is a comphrensive guide to dinosaurs, geared to help you figure out what each dino likes and dislikes, and how to make them happy, as well as a brief history of each specific dino.</p>"},{"name":"Jurassic: The Hunted","year":2009,"developer":"Cauldron Ltd.","url":"sony_playstation2_j/Jurassic%20-%20The%20Hunted%20%28USA%29.zip","filesize":642926785,"score":6.2,"genres":"Action > 1st-person > Quick Time Events (QTEs) > Shooter","desc":"<p><em>Jurassic: The Hunted</em> is a first-person shooter where the players controls weapons and survival expert Craig Dylan. In 1983 an expedition to the Bermuda Triangle disappeared, but almost 30 years later the daughter of Dr. Sayrus, one of the original members, receives the S.O.S. transmission of the long lost team. Dylan is a part of the team hired to investigate, but their plane is struck by a storm and all members need to parachute down, where they are sucked into mysterious energy portals. Craig Dylan suddenly finds himself on an island filled with dinosaurs.</p><p>The environment is filled with dense jungle, fortifications and volcano areas. Players need to fight thirteen different types of dinosaurs such as the velociraptor, pterosaur, triceratops, tyrannosaurus and many more. Aside from the straightforward shoot-em-up gameplay, Dylan also has access to an Adrenaline Burst that slows down all the action for more accurate shots. It also lights up the dinosaurs' weak spots in a bright color. The thirteen weapons at his disposal range from a civil war rifle, to crossbows with explosive arrows and even a futuristic plasma rifle. There are also a number of stationary turrets to ward off large hordes.</p><p>Next to the regular story mode with twelve levels in total, there is a survivor mode where the player can go against an endless wave of dinosaurs. During the regular mode scattered pieces of a new weapons can be found and when it is fully assembled it becomes available in the survivor mode.</p>"},{"name":"Just Cause","year":2006,"developer":"Avalanche Studios AB","url":"PS2_COLLECTION_PART12/Just%20Cause%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":1943765816,"score":6.6,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control > Helicopter > Spy / espionage","desc":"<p>You are Rico Rodriguez, a CIA-agent who is sent to the small Island of San Esperito to start a revolution and bring down the current regime under the rule of General Salvador Mendoza.</p><p>After you jumped out of the airplane and helped your local contact survive an attack by gang members, you have - much like GTA: San Andreas - the freedom to do what you want. The complete island is accessible from the beginning and you can either follow the main storyline, engage in side-missions, or collect items all over the place. To help the revolution you can also drive the government out of the individual sectors on the island. This is accomplished by a three-stages fight in which you have to go up against a huge army of government forces.</p><p>As a fully trained agent, Rico can also perform many stunts. He has always an parachute equipped which he can open whenever he has enough speed. So he often uses cars or bikes as a jump-pad and then sails smoothly into the sunset.</p><p>But of course he cannot impress the evil regime with that, so he also has access to a wide range of weapons from pistols with unlimited ammo to rocket launchers and machine guns. Rico is also trained to drive everything that has an engine, from a normal bike to a fully-armed military helicopter.</p>"},{"name":"Justice League Heroes","year":2006,"developer":"Snowblind Studios, Inc.","url":"PS2_COLLECTION_PART12/Justice%20League%20Heroes%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2576925994,"score":7.1,"genres":"Action > 3rd-person (Other) > Top-down > RPG elements > Licensed","desc":"<p>Military robots cause havoc in a high tech Metropolis research facility. In Finland, genetically-engineered creatures take over the top secret Deep Space Communications Array. A team of super powered criminals, having never worked together before, seize a Nevada missile base. And deep beneath the surface of Mars, dozens of alien warriors are released from their long imprisonment…</p><p>These seemingly unrelated events prove to be pieces of a sinister plan, and it will take Earth’s greatest superheroes to stop it: The Justice League!</p><p><em>Justice League Heroes</em> is an action game, also for two players cooperatively, based on the popular DC Comics series. Control DC’s most popular heroes: Superman, Batman, Wonder Woman, Green Lantern, Martian Manhunter, The Flash, Zatanna and a handful of unlockable characters like Aquaman, Green Arrow, Hawkgirl, Huntress, Hal Jordan, and Kyle Rayner. In addition, the PSP version features exclusive unlockable heroes: Supergirl and Black Canary.</p><p>Players battle through famous locations such as Metropolis, S.T.A.R. labs, and for the first time, the Justice League's Watchtower.</p><p>Many of DC’s greatest villains face against our heroes including Braniac, Killer Frost, Darkseid, and Doomsday. Boss battles are furious and unique, with no two defeated the same way.</p><p>Superpowers are developed through experience orbs collected from a wide range of enemies such as The White Martians, Brainiac’s assassin droids, and alternate-dimensional creatures. Some special orbs known as “boosts” can enhance superpowers. The boosts range from enhanced damage, efficiency, attack range, luck, speed, and super power duration. Multiple boosts can combine into a single, more powerful boost. Players can allocate their orbs and boosts to customize heroes to best suit their playing style.</p><p>Special shield icons placed throughout the game can be collected and spent to unlock characters and alternate costumes which affect the heroes' abilities as well their appearances.</p>"}]