[{"name":"K-1 Premium Dynamite!!","year":2004,"developer":"","url":"PS2_COLLECTION_PART12/K-1%20Premium%20Dynamite%21%21%20%28Europe%29.zip","filesize":438906660,"score":"","genres":"Sports > 3rd-person (Other) > Bowling > Martial arts > Licensed","desc":"<p>WHO WILL BE THE LAST</p><p>MAN STANDING? WHO WILL BE THE HERO? WITH THIS GAME, YOU WILL DECIDE!</p><p>With K1-Dynamite!! You will have a chance to take part in real class K-1 matches and to compete with heavyweight boxers.</p><p>Fight according to official K-1 rules or choose ROMANEX rules.</p><p>Use all the moves of real fighters and practice new, original techniques.</p><p>More then 20 pro athletes to choose from.</p><p>Play alone or against a friend. Take part in the most prestigious championship challenge.</p>"},{"name":"K-1 World Grand Prix","year":2002,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_k/K-1%20World%20Grand%20Prix%20%28USA%29.zip","filesize":3157979011,"score":"","genres":"Sports > Boxing > Martial arts > Licensed","desc":"<p>Eight Men Enter, One Man Survives</p><p>Brace yourself for the new breed of fighting sport and take on the best mixed martial artists. Stand up and fight your way to the world's top bout - the World Grand Pro in Tokyo, Japan</p><p>* 2-Player head-to-head fighting * Intense graphics and powerful knockouts * Signature moves from over 20 real K-1 fighters * Use Training to improve your fighter's skills in Champion's Revolution Mode * Fully directional attacks and guards</p>"},{"name":"Ka 2: Let's Go Hawaii","year":2003,"developer":"Zoom, Inc.","url":"sony_playstation2_k/Ka%202%20-%20Let%27s%20Go%20Hawaii%20%28Japan%29.zip","filesize":2413988390,"score":"","genres":"Action > 3rd-person (Other) > Stealth","desc":"<p><em>Ka 2</em> is the Japanese-exclusive sequel to Mister Mosquito. Once again, the player assumes the role of a mosquito that must drain human blood to survive. This time, there's a choice between American and Japanese mosquitoes, each attacking a family of its nationality.</p><p>The player controls the mosquito, flying around the room where the victim takes a rest. When approaching the human, the possible target areas on the body glow green. When the insect lands on those places, a small zoom screen shows the exposed skin and the mosquito ready to attack. Pressing the analog button makes the bug bite the victim, and moving the analog control fast starts the pumping action, where a syringe starts to slowly fill with blood. The danger of the human swatting the bug increases as the skin surrounding the bite gets more red.</p><p>Sometimes the human gets up and starts to search for the mosquito. Green beams shine forth from the eyes, and the player must maneuver the insect out of its reach. When engaging in battle mode, the mosquito must bite certain body parts to decrease the human stress shown at the bottom of the screen.</p>"},{"name":"Kaan: Barbarian's Blade","year":2004,"developer":"Eko Software SARL","url":"PS2_COLLECTION_PART12/Kaan%20-%20Barbarian%27s%20Blade%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":335929828,"score":5.9,"genres":"Action > 3rd-person (Other) > Platform > Fantasy","desc":"<p><em>Kaan: Barbarian's Blade</em> is a 3D action game in which the titular protagonist must recover the stolen Orb of Hope from an evil sorcerer. The hero travels to various locations, from the great Asaquan to the Syrkonian lands, and fights his way through many foes including skeletons, sorcerers, bear-men and huge monsters. Throughout the missions Kaan will have the opportunity to engage in Arena Battles to enhance his skills. To recover the stolen artifact Kaan will need to master different weapons, each with its unique combination of attacks.</p>"},{"name":"Kaena","year":2004,"developer":"Xilam Animation","url":"sony_playstation2_k/Kaena%20%28Japan%2C%20Asia%29.zip","filesize":2516393532,"score":"","genres":"Action > 3rd-person (Other) > Fantasy > Licensed","desc":"<p><em>Kaena</em> is based on the French computer graphics movie <em>Kaena: La Prophétie</em> (Kaena: The Prophecy), that was released in Europe in 2003.</p><p>Kaena is a girl who lives on an alien planet called Astria. In the middle of the planet stands a giant tree called Axis, and its sap is vital to the planet's inhabitants. Lately, the sap has been rapidly running out for an unknown reason. Kaena sees a dream in which Axis is calling her for an important mission. The village people don't believe her, but Kaena firmly decides to venture inside of Axis and to find out what is going on. Another motive that drives Kaena is the disappearance of Essy, her best friend's nine-year old brother.</p><p>The game has plenty of combat with various alien monsters. You attack enemies in real time with your weapons, and can also perform stronger combos by pressing several buttons in a row. Once defeated, the enemies randomly drop little spheres of three different kinds. The first kind is used to upgrade Kaena's weapon and to make it more powerful, the second raises her berserk meter (when it is full, she can perform a particularly strong attack), the third heals her. The game has a static camera with pre-rendered backgrounds, and character-based controls (similar to those implemented in survival horror games).</p>"},{"name":"Kaido Racer","year":2004,"developer":"Genki Co., Ltd.","url":"PS2_COLLECTION_PART12/Kaido%20Racer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2392825541,"score":"","genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile","desc":"<p><em>Kaido Battle 2: Chain Reaction</em> is a sequel to Kaido Battle: Nikko, Haruna, Rokko, Hakone which contains all the tracks and racing styles of that game and then some. The game also support GT Force steering wheel and pedals as a controller. In additional to previously introduced CA (Corner Artist) and SA (Spirit Attack) modes, this sequel also features new gameplay modes such as FL/LF (First and Last / Last and First) battle mode, TAC (Time Attack Collision) or CAT (Corner Ring Artist Target) battle.</p><p>Throughout the courses, the player can check the rival's info, sponsor's info, lover's info, change and tune up the car or check the prize. Cars can be bought new or in used cars shop, along with various parts for your car such as engine parts, air cleaner, turbo kit, cooling module, tires, and such. For aesthetics and dress up, things such as car color, wings, and other visual gadgets can be installed. Battle modes include Speed King mode, CA King mode and SP King mode. Additionally, two players can race in Versus battle on a split-screen.</p>"},{"name":"Kamaitachi no Yoru 2: Kangokujima no Warabeuta","year":2002,"developer":"Chunsoft Co., Ltd.","url":"sony_playstation2_k/Kamaitachi%20no%20Yoru%202%20-%20Kangoku-jima%20no%20Warabe-uta%20%28Japan%29.zip","filesize":2601074196,"score":"","genres":"Adventure > Fixed / flip-screen > Visual novel > Detective / mystery > Horror","desc":"<p><em>Kamaitachi no Yoru 2</em> is the second in the series of <em>Kamaitachi no Yoru</em> murder mystery adventures. As with other series, all of the characters in the story are displayed as silhouettes while the background graphic used for locations is photo realistic. The game takes place in a villa on a deserted island of Mikadzuki. The creator of <em>Kamaitachi no Yoru</em> invited all the people he has based his characters on. Upon their arrival they find out the host is nowhere to be found, and someone is killing the guests one by one.</p>"},{"name":"Kamen Rider: Climax Heroes","year":2009,"developer":"Eighting Co., Ltd.","url":"sony_playstation2_k/Kamen%20Rider%20-%20Climax%20Heroes%20%28Japan%29.zip","filesize":496671556,"score":"","genres":"Action > Side view > Arcade > Fighting > Sci-fi / futuristic > Licensed","desc":"<p><em>Kamen Rider: Climax Heroes</em> is a 3D crossover fighting game featuring the heroes of 10 different <em>Kamen Rider</em> TV series, from <em>Kuuga</em> through to <em>Decade</em>. The story is set in the <em>Decade</em> universe, where the worlds of the other nine Riders are all combining into one, and they must work together to save their worlds before they are completely destroyed.</p><p>The game plays much like other 3D fighters such as Tekken, with the major addition being the so-called \"Form Change\" system that allows each Rider to transform during battle, and even in the middle of a combo. The main story mode is \"Decade Mode\", where the player must complete various missions with different characters to proceed through the story. There are also standard Versus, Survival, and Training modes. The game also includes a simple control option for younger players.</p>"},{"name":"Kamiwaza","year":2006,"developer":"Acquire Corp.","url":"sony_playstation2_k/Kamiwaza%20%28Japan%29.zip","filesize":767697413,"score":6.3,"genres":"Action > Behind view > Stealth > Direct control > Japan (Ancient/Classical/Medieval)","desc":"<p>On the streets of Mikado, only the tough survive. For one man, a heist gone wrong would change his life forever.</p><p>Set during the Edo period of Japan, Kamiwaza stars amateur thief Ebizo, who aspires to steal from the rich and give to the poor. During his first stint, however, he and his mentor, Ainosuke, witness their own men take the lives of innocent civilians. Disillusioned by the horrific display of violence, Ainosuke advises Ebizo to escape with the only survivor—a lone girl.</p><p>A decade later, Ebizo has held fast to his morals, living an honest and fulfilling life with Suzuna, the young girl he took in as his own daughter. But the illusion of security is shattered once Suzuna falls ill. In order to buy the medicine she desperately needs, Ebizo is faced with a heavy financial burden. Conflicted, Ebizo is forced to return to the underbelly of Mikado, but vows only to steal for the sake of those less fortunate.</p><p>Will you walk the path of honor, even as a thief? The choice is yours to make.</p>"},{"name":"Kanojo no Densetsu, Boku no Sekiban.: Amirion no Ken to Tomo ni","year":2003,"developer":"Bestmedia Co., Ltd.","url":"sony_playstation2_k/Kanojo%20no%20Densetsu%2C%20Boku%20no%20Sekiban%20-%20Amirion%20no%20Ken%20to%20Tomo%20ni%20%28Japan%29.zip","filesize":676442730,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Fantasy","desc":"<p>A nameless young salaryman, bored with his ho-hum life, has started having strange dreams and visions. He hears calls for help from a distant voice, and catches glimpses of a fantastic kingdom not of this world. One night, he comes home from work and finds a curious program on his laptop, which seems to be a simple picture-book creator. Intrigued, he starts it up, when suddenly a bright light envelopes him. When he awakens, he is in the strange land he saw in his dreams, surrounded by five beautiful young girls. They believe he is the savior that they have been waiting for, and without any way to return to his home, the man has no choice but to join them on their adventure.</p><p><em>Kanojo no Densetsu, Boku no Sekiban</em> (Her Legend, My Picture) is a traditional Japanese-style visual novel. The player reads along as the story proceeds, occasionally making decisions which will lead to one of over 20 different endings. Somewhat anachronistically, the protagonist has access to his laptop, which he can use to review previous events, check his email, or fiddle with a variety of settings and other features.</p>"},{"name":"Kanokon SE","year":2008,"developer":"5pb. Inc.","url":"sony_playstation2_k/Kanokon%20Esuii%20%28Japan%29.zip","filesize":1263225441,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Visual novel > Comedy > Romance","desc":"<p><em>Kanokon SE</em> is a romantic comedy adventure game based on the <em>Kanokon</em> TV anime but with an original story and scenario. Originally released for PS2 console, this game was a non-adult from the start. As a visual novel adventure game, the gameplay and visual style is similar to any other title from its genre. Much like in <em>EVE</em> series, the game features a viewpoint change which switches between the two main characters who came to an isolated island during summer vacation.</p>"},{"name":"Kanon","year":2002,"developer":"Key Co., Ltd.","url":"sony_playstation2_k/Kanon%20%28Japan%29.zip","filesize":615502430,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Romance","desc":"<p><em>Kanon</em> for the Dreamcast and PlayStation 2 consoles is a port of an adult visual novel Kanon. The console port had adult rating reduced to all ages by removing all the explicit content, but in turn has added new graphical content and full voice-acting.</p><p>This all-age re-release for Windows includes updated scenario and removed adult scenes as on the console releases, but doesn't have voice-acting. Smartphone all-ages versions of the game are same as the Windows release in that they too don't have voice-acting but otherwise have updated scenario and removed adult scenes.</p>"},{"name":"Kao the Kangaroo: Round 2","year":2004,"developer":"Tate Multimedia S.A.","url":"PS2_COLLECTION_PART12/Kao%20the%20Kangaroo%20-%20Round%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":440717056,"score":6.9,"genres":"Action > Behind view > Platform","desc":"<p><em>Kao the Kangaroo Round 2</em> is a third-person perspective platform game about a young, cute, yellow kangaroo, who saves animals from the hands of the evil Hunter and his equally evil colleagues. In order to bribe the guard and get aboard Hunter's ship, Kao must collect lots of coins scattered throughout the game. The main character can fight with his boxing gloves and can throw lethal boomerangs. </p><p>The game consists of 25 levels in 5 different worlds. Playing through the levels, the player must jump over platforms, make difficult leaps, and fight about 30 different types of enemies, free captured friends and solve many puzzles. Occasionally Kao will get to ride a vehicle like a barrel or a snowmobile. </p><p>Kao can also find purple crystals, which can be spent to buy minigames to play. There are also stars - collecting 50 of them will upgrade one of Kao's abilities, e.g. giving him the ability to stomp on the ground to defeat enemies around him. A rarely encountered item is a winged helmet, which, when grabbed, allows Kao to fly for a short while.</p>"},{"name":"Karaoke Revolution","year":2003,"developer":"Harmonix Music Systems, Inc.","url":"sony_playstation2_k/Karaoke%20Revolution%20%28USA%29.zip","filesize":1646713436,"score":7.9,"genres":"Simulation > 3rd-person (Other) > Real-time > Board game > Music / rhythm > Licensed","desc":"<p><em>Karaoke Revolution</em> allows PlayStation 2 gamers to show off their singing skills and get real-time feedback on their performances. It's similar to Dance Dance Revolution, but with singing instead of dancing. </p><p>Players sing using the Logitech PS2 Headset (or other approved PlayStation 2 USB microphone devices). The game rates the player's performance based on their vocal pitch and timing. A visual indicator shows the player's current pitch in real time and also the pitch of vocals of the original song. If the original notes of the song are too high for the player's vocal range, the game allows the player to sing at higher or lower octaves to hit the correct notes. </p><p>If the player sings well, the crowd gets into the performance by clapping, cheering and dancing. If the performance is bad, the audience becomes bored and the user can get booed off the stage.</p><p><strong>Single Player Game Modes include:</strong></p><ul><li>Arcade Mode: where users sing 3–5 songs and try to score big points</li><li>Showtime Mode: Players start at a living room party and work to a huge concert at the Enormobowl. Additional venues include: a subway station, The Pit Stop, a county fair, the Superstar TV show, Club Avalanche, and a royal hall.</li><li>Karaoke Mode: Players can enjoy singing the song without having to worry about bring rated or scored.</li></ul><p><strong>Multi-player Game Mode include:</strong></p><ul><li>Arcade Mode: 2–8 players perform songs and try to be the player with the highest score at the end of each round. The player who wins the most rounds is the winner.</li><li>Karaoke Competition: 3–8 players compete against each other. The main twist of this mode is that each player rates the performance of the other players to determine the winner of the Karaoke competition.</li></ul><p>Over 35 songs from the '70s, '80s, '90s, and current hits including (as made famous by):</p><p>\"Addicted\" (Simple Plan), \"All You Wanted\" (Michelle Branch), \"Are You Happy Now?\" (Michelle Branch), \"Believe\" (Cher), \"Billie Jean\" (Michael Jackson), \"Bizarre Love Triangle\" (New Order), \"Broken Wings\" (Mr. Mister), \"Celebration\" (Kool and the Gang), \"Chain of Fools\" (Aretha Franklin), \"Complicated\" (Avril Lavigne), \"Crawling in the Dark\" (Hoobastank), \"Don't Know Why\" (Norah Jones), \"Every Morning\" (Sugar Ray), \"Everything You Want\" (Vertical Horizon), \"Girls Just Want to Have Fun\" (Cyndi Lauper), \"Hey Jealousy\" (The Gin Blossoms), \"Hit Me With Your Best Shot\" (Pat Benatar), \"How You Remind Me\" (Nickelback), \"I'm Coming Out\" (Diana Ross), \"It's The End of the World As We Know It\" (REM), \"Kiss Me\" (Sixpence None the Richer), \"Ladies' Night\" (Kool and the Gang), \"Like a Virgin\" (Madonna), \"One Week\" (Barenaked Ladies), \"Red Red Wine\" (UB40), \"Save Tonite\" (Eagle Eye Cherry), \"Science Genius Girl\" (Freezepop), \"She Talks to Angels\" (Black Crowes), \"Smooth Criminal\" (Michael Jackson/Alien Ant Farm), \"Son of a Preacher Man\" (Dusty Springfield), \"The Power of Love\" (Huey Lewis and the News), \"Waiting for Tonight\" (Jennifer Lopez), \"When a Man Loves a Woman\" (Michael Bolton), \"Wind Beneath My Wings\" (Bette Midler), \"You Really Got Me\" (Van Halen), \"You're the One That I Want\" (Less Than Jake)</p><p>Players can unlock extra characters, additional outfits, more songs, and behind the scenes videos.</p><p>The game includes an option for Expansion Discs - which means players will be able to karaoke to additional songs in the future.</p>"},{"name":"Karaoke Revolution Presents: American Idol","year":2007,"developer":"Blitz Games Ltd","url":"sony_playstation2_k/Karaoke%20Revolution%20Presents%20-%20American%20Idol%20%28USA%29.zip","filesize":3418049906,"score":7.8,"genres":"Simulation > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p><em>Karaoke Revolution Presents American Idol</em> pairs the popular line of Karaoke games with the television series based on a singing contest. In addition to the standard Karaoke Revolution trapping, three judges have been added who comment on your performance. Simon Cowell and Randy Jackson appear from American Idol, though Paula Abdul is replaced by original character Laura. Venues are also recreated from the show such as the audition room and Hollywood theater.</p><p>The forty-song line-up is a combination of popular songs that have been used on American Idol and songs from previous American Idol winners. Performing well unlocks video clips from the show and clothes for your avatar. You can use EyeToy to give your character your own face.</p><p>Modes include the standard Karaoke Revolution modes like scoreless karaoke, duets and head-to-head elimination as well as an American Idol mode, which is essentially a career mode based on the structure of the show where you must make it through the audition and several rounds of elimination to get into the contest, then make your way to the top to be the next American Idol.</p>"},{"name":"Karaoke Revolution Presents: American Idol - Encore","year":2008,"developer":"Blitz Games Ltd","url":"sony_playstation2_k/Karaoke%20Revolution%20Presents%20-%20American%20Idol%20Encore%20%28USA%29.zip","filesize":3213871925,"score":7,"genres":"Simulation > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p><em>Karaoke Revolution Presents: American Idol Encore</em> is a sequel to its predecessor. It still has the main basic features, auditioning for the show as well as performing to become the next <em>American Idol</em> in front of celebrity judges Randy Jackson, Simon Cowell, and Paula Abdul (which was not present in the previous incarnation). There are also new songs that players can sing and head-to-head against a human player.</p><p>Each version is almost identical, sans graphics and controls (the Wii utilizes the Wii remote to navigate menus). Each version has the ability to customize their character with an assortment of clothing, however the PS3 and PS2 has the ability to use the Eyetoy device to put a 3-D model of the players head into the game or the PS3 can use the Playstation Eye to directly put the player into the game. Likewise the PS3 and 360 version has online capabilities to download over 140 songs using their respective online providers.</p>"},{"name":"Karaoke Revolution: J-Pop Best - vol.1","year":2003,"developer":"Konami Corporation","url":"sony_playstation2_k/Karaoke%20Revolution%20-%20J-Pop%20Best%20Vol.%201%20%28Japan%29.zip","filesize":181887618,"score":"","genres":"Action > Music / rhythm","desc":"<p>This <em>Karaoke Revolution</em> title is the first in the series of J-Pop music. It comes with 50 titles in total. The gameplay consists of selecting the song of your liking in one of the several gameplay modes, from singleplayer to team battles, and using a USB microphone or a USB headset to sing along the on-screen lyrics which mark the words that need to be sung in real time.</p><p>The game offers several different gameplay modes such as Revolution and Stage Challenge where you need to sing as is supposed to in order to avoid game over screen, Team Battle which lets 4, 6, or 8 players go in 2 vs 2, 3 vs 3, or 4 vs 4 battles by naming their groups, selecting and naming their characters and pick to songs to try on against each other, and Audition mode which is a story mode which plays as a short visual novel in between singing, where the player selects one of the four characters trying to enter the music company by auditioning.</p><p>During karaoke singing, player can see only the lyrics or additionally display one's current score in real-time. Background animations during lyrics can be toggled on and off in game options. Any song can be fast-forwarded during playback if you wish to sing particular part or just skip the instrumental pauses.</p><p>Volume 1 of J-Pop best features these tracks:</p><ul><li>19 - \"Ano Kami Hikouki Kumorizora Watte\"</li><li>Aiko - \"Boyfriend\"</li><li>Aiko - \"Sakura no Toki\"</li><li>BoA - \"Every Heart: Minna no Kimochi\"</li><li>BoA - \"Jewel Song\"</li><li>Bump of Chicken - \"Tentaikansoku\"</li><li>Chemistry - \"You Go Your Way\"</li><li>Chemistry - \"Kimi wo Sagashiteta: New Jersey United\"</li><li>Do as Infinity - \"Hi no Ataru Sakamichi\"</li><li>Ego-Wrappin' - \"Kuchibashi ni Cherry\"</li><li>Glay - \"Winter, Again\"</li><li>Hide with Spread Beaver - \"Rocket Dive\"</li><li>Hitomi - \"Samurai Drive\"</li><li>Judy and Mary - \"Sobakasu\"</li><li>Misia - \"Nemurenu Yoru wa Kimi no Sei\"</li><li>Mongol 800 - \"Aisuru Hana\"</li><li>Mr. Children - \"Namonaki Uta\"</li><li>Mr. Children - \"Hero\"</li><li>Rip Slyme - \"One\"</li><li>The Blue Hearts - \"Linda Linda\"</li><li>The Blue Hearts - \"Jounetsu no Bara\"</li><li>Zone - \"Secret Base: Kimi ga Kureta Mono\"</li><li>Kuzu - \"Ikiteru Kototte Subarashii\"</li><li>Sharam Q - \"Single Bed\"</li><li>Spitz - \"Sora mo Toberu Hazu\"</li><li>Spitz - \"Cherry\"</li><li>Morning Musume. - \"Love Machine\"</li><li>Morning Musume. - \"Koko ni Iru zee!\"</li><li>Naotarou Moriyama - \"Sakura\" (Dokushou)</li><li>Rebecca - \"Friends\"</li><li>Road of Major - \"Taisetsu na Mono\"</li><li>Hikaru Utada - \"Colors\"</li><li>Hikaru Utada - \"First Love\"</li><li>Chihiro Onitsuka - \"Sign\"</li><li>Miki Douzan - \"Lifetime Respect\"</li><li>Akiko Kobayashi - \"Koi ni Ochite\"</li><li>Mai Kuraki - \"Kaze no La La La\"</li><li>Mika Nakashima - \"Will\"</li><li>Tsuyoshi Nagabuchi - \"Tonbo\"</li><li>Hitomi Shimatani - \"Itsu no Hi ni ka...\"</li><li>Yutaka Ozaki - \"Oh My Little Girl\"</li><li>Ayumi Hamasaki - \"Love: Destiny\"</li><li>Ayumi Hamasaki - \"Appears\"</li><li>Ayumi Hamasaki - \"Seasons\"</li><li>Ayumi Hamasaki - \"M\"</li><li>Ayumi Hamasaki - \"July 1st\"</li><li>Ayumi Hamasaki - \"Hanabi\"</li><li>Ayumi Hamasaki - \"Voyage\"</li><li>Ayumi Hamasaki - \"Everywhere Nowhere\"</li><li>Ayumi Hamasaki - \"Heartplace\"</li></ul>"},{"name":"Karaoke Revolution: J-Pop Best - vol.2","year":2003,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_k/Karaoke%20Revolution%20-%20J-Pop%20Best%20Vol.%202%20%28Japan%29.zip","filesize":187605065,"score":"","genres":"Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p>Second volume selection of J-Pop's best gives you fifty more songs at your disposal to go wild and sing karaoke using real microphone or USB headset.</p><p>| Tracklist || Artist(romanimation) | Song(romanization) || --- | --- || Aiko | カブトムシ(Kabutomushi) || BoA | Listen to My Heart || Chemistry | It Takes Two || Chemistry | Solid Dream || Day After Tomorrow | My Faith || Dragon Ash | Fantasista || Dreams Come True | 未来予想図ＩＩ(Mirai Yosouzu II) || Every Little Thing | Fragile || Exile | Song For You || Exile | Kiss You || Glay | ずっと２人で・・・(Zutto Futari de...) || Glay | 春を愛する人(Haru wo Aisuru Hito) || Glay | Way of Difference || Going Steady | もしも君が泣くならば(Moshimo Kimi ga Nakunaraba) || Mongol 800 | 小さな恋のうた(Chiisana Koi no Uta) || Mr. Children | Youthful Days || Rip Slyme | 楽園ベイビー(Rakuen Baby) || Speed | White Love || The Blue Hearts | Train-Train || ゴスペラーズ(The Gospellers) | 永遠に(Eien ni) || コブクロ(Kobukuro) | 風(Kaze) || サザンオールスターズ(Southern All Stars) | Tsunami || チューリップ(Tulip) | サボテンの花(Saboten no Hana) || ポルノグラフィティ(Porno Graffitti) | Mugen || モーニング娘。(Morning Musume) | ザ・ピース！(The Peace!) || ゆず(Yuzu) | 夏色(Natsuiro) || 安室奈美恵(Namie Amuro) | Can You Celebrate? || 井上陽水(Yousui Inoue) | 少年時代(Shounen Jidai) || 宇多田ヒカル(Hikaru Utada) | Automatic || 華原朋美(Tomomi Kahala) | I'm Proud || 岩崎良美(Yoshimi Iwasaki) | タッチ(Touch) || 鬼束ちひろ(Chihiro Onitsuka) | 月光(Gekkou) || 元ちとせ(Chitose Hajime) | ワダツミの木(Wadatsumi no Ki) || 髙橋真梨子(Mariko Takahashi) | For You... || 髙橋真梨子(Mariko Takahashi) | 桃色吐息(Momoiro Toiki) || 髙橋真梨子(Mariko Takahashi) | ごめんね・・・(Gomen ne...) || 今井美樹(Miki Imai) | Pride || 小柳ゆき(Yuki Koyanagi) | あなたのキスを数えましょう〜You were mine〜(Anata no Kiss wo Kazoemashou) || 松浦亜弥(Aya Matsuura) | Yeah!めっちゃホリディ(Yeah! Meccha Holiday) || 中島みゆき(Miyuki Nakajima) | 地上の星(Chijou no Hoshi) || 藤井フミヤ(Fumiya Fujii) | True Love || 尾崎 豊(Yutaka Ozaki) | I Love You || 浜崎あゆみ(Ayumi Hamasaki) | Evolution || 浜崎あゆみ(Ayumi Hamasaki) | Who... || 浜崎あゆみ(Ayumi Hamasaki) | We Wish || 浜崎あゆみ(Ayumi Hamasaki) | Real Me || 浜崎あゆみ&amp;KEIKO(Ayumi Hamasaki &amp; Keiko) | A Song is Born || 福山雅治(Masaharu Fukuyama) | Squall || 平井 堅(Ken Hirai) | Life is...〜another story〜 || 槇原敬之(Noriyuki Makihara) | 君の名前を呼んだ後に(Kimi no Namae wo Yonda Ato ni) |</p>"},{"name":"Karaoke Revolution: J-Pop Best - vol.3","year":2003,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_k/Karaoke%20Revolution%20-%20J-Pop%20Best%20Vol.%203%20%28Japan%29.zip","filesize":180436513,"score":"","genres":"Simulation > Music / rhythm > Menu structures > Voice control","desc":"<p>This <em>Karaoke Revolution</em> title is the third in the series of J-Pop music which adds yet another 50 titles, thus expanding the total number to 150 from the beginning of the series. The gameplay remains unchanged to its predecessors and basically brings you a karaoke at home which can be played by either a USB microphone or USB headset.</p><p>The game offers several different gameplay modes such as Revolution and Stage Challenge where you need to sing as is supposed to in order to avoid game over screen, Team Battle which lets 4, 6, or 8 players go in 2 vs 2, 3 vs 3, or 4 vs 4 battles by naming their groups, selecting and naming their characters and pick to songs to try on against each other, and Audition mode which is a story mode which plays as a short visual novel in between singing, where the player selects one of the four characters trying to enter the music company by auditioning.</p><p>During karaoke singing, player can see only the lyrics or additionally display one's current score in real-time. Background animations are some old some new for this game and try to match the song lyrics more or less (i.e. \"Traveling\" song will display a road animation in the background, \"Moonlight\" song will display starry sky in the background, etc.) title and can be toggled on and off in game options. Any song can be fast-forwarded during playback if you wish to sing particular part or just skip the instrumental pauses.</p><p>Volume 3 of J-Pop best features these tracks:</p><ul><li>175R - \"Sakura\"</li><li>175R - \"Sora ni Utaeba\"</li><li>B-Dash - \"Cho\"</li><li>BoA - \"Valenti\"</li><li>Chemistry - \"Piece of a Dream\"</li><li>Chemistry - \"Kimi wo Sagashiteta: The Wedding Song\")</li><li>Dragon Ash - \"Grateful Days\"</li><li>Every Little Thing - \"Time Goes By\"</li><li>Every Little Thing - \"Unspeakable\"</li><li>Fayray - \"Tears\"</li><li>Go! Go! 7188 - \"Koi no Uta\"</li><li>Going Steady - \"Ginga Tetsudou no Yoru\"</li><li>J-walk - \"Nanimo Ienakute... Natsu\"</li><li>Judy and Mary - \"Over Drive\"</li><li>Minmi - \"The Perfect Vision\"</li><li>Misia - \"Everything\"</li><li>Mongol 800 - \"Ryuukyuu Ai Uta\"</li><li>Mongol 800 - \"Mujun no Ue ni Saku Hana\"</li><li>Mr. Children - \"Dakishimetai\"</li><li>Mr. Children - \"Innocent World\"</li><li>Mr. Children - \"Tomorrow Never Knows\"</li><li>Noa - \"Ima wo Dakishimete\"</li><li>Rui - \"Tsuki no Shizuku\"</li><li>SMAP - \"Yozora no Mukou\"</li><li>SMAP - \"Sekai ni Hitotsu Dake no Hana\"</li><li>The Yellow Monkey - \"Jam\"</li><li>Kuzu - \"Moonlight\"</li><li>Ketsumeishi - \"Tomodachi\"</li><li>Ketsumeishi - \"Kachoufuugetsu\"</li><li>Gomattou - \"Shall We Love?\"</li><li>The High-Lows - \"Seishun\"</li><li>Southern All Stars - \"Itoshi no Eri\"</li><li>Morning Musume. - \"Do It! Now\"</li><li>Yuzu - \"Itsuka\"</li><li>Yuzu - \"Koi no Kayoubi\"</li><li>Namie Amuro - \"Say the Word\"</li><li>Namie Amuro - \"I Will\"</li><li>Namie Amuro - \"Wishing on the Same Star\"</li><li>Anzen Chitai - \"Wine Red no Kokoro\"</li><li>Hikaru Utada - \"Traveling\"</li><li>Yasuhiro Yamane - \"Get Along Together\"</li><li>Aya Matsuura - \"Good Bye Natsuo\"</li><li>Seiko Matsuda - \"Anata ni Aitakute: Missing You\"</li><li>Mika Nakashima - \"Stars\"</li><li>Mika Nakashima - \"Aishiteru\"</li><li>Ayumi Hamasaki - \"A Song for XX\"</li><li>Ayumi Hamasaki - \"I Am...\"</li><li>Masaharu Fukuyama - \"Sakurazaka\"</li><li>Ken Hirai - \"Ookii na Furudokei\"</li><li>Kishidan - \"One Night Carnival\"</li></ul>"},{"name":"Karaoke Revolution: J-Pop Best - vol.6","year":2003,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_k/Karaoke%20Revolution%20-%20J-Pop%20Best%20Vol.%206%20%28Japan%29.zip","filesize":180152705,"score":"","genres":"Simulation > Fixed / flip-screen > Music / rhythm > Menu structures > Voice control","desc":"<p>This <em>Karaoke Revolution</em> title is the sixth in the series of J-Pop music which adds yet another 50 titles, thus expanding the total number of j-pop tracks to 300 from the beginning of the series. The gameplay remains unchanged to its predecessors and basically brings you a karaoke at home which can be played by either a USB microphone or USB headset.</p><p>The game offers several different gameplay modes such as Revolution and Stage Challenge where you need to sing as is supposed to in order to avoid game over screen, Team Battle which lets 4, 6, or 8 players go in 2 vs 2, 3 vs 3, or 4 vs 4 battles by naming their groups, selecting and naming their characters and pick to songs to try on against each other, and Audition mode which is a story mode which plays as a short visual novel in between singing, where the player selects one of the four characters trying to enter the music company by auditioning.</p><p>During karaoke singing, player can see only the lyrics or additionally display one's current score in real-time. Background animations during lyrics can be toggled on and off in game options. Any song can be fast-forwarded during playback if you wish to sing particular part or just skip the instrumental pauses.</p><p>Volume 6 of J-Pop best features these tracks:</p><ul><li>Every Little Thing - \"Grip!\"</li><li>Every Little Thing - \"Jump\"</li><li>Every Little Thing - \"Nostalgia\"</li><li>Every Little Thing - \"Ai no Uta\"</li><li>I WiSH - \"Ashita e no Tobira\"</li><li>Sayaka - \"Garden\"</li><li>Zone - \"True Blue\"</li><li>Southern All Stars - \"Hotel Pacific\"</li><li>Southern All Stars - \"Love Affair: Himitsu no Date\"</li><li>Southern All Stars - \"Oh! Claudia\"</li><li>Southern All Stars - \"Ya Ya Ano Jidai wo Wasurenai\"</li><li>Southern All Stars - \"Erotica Seven\"</li><li>Southern All Stars - \"Christmas Love: Namida no Ato ni wa Shiroi Yuki ga Furu\"</li><li>Southern All Stars - \"Chalk no Kaigan Monogatari\"</li><li>Southern All Stars - \"Manpi no G-Spot\"</li><li>Southern All Stars - \"Miss Brand New Day\"</li><li>Southern All Stars - \"Melody\"</li><li>Southern All Stars - \"Natsu wo Akiramete\"</li><li>Southern All Stars - \"Kibou no Wadachi\"</li><li>Southern All Stars - \"Namida no Kiss\"</li><li>Southern All Stars - \"Namida no Umi de Dakaretai: Sea of Love\"</li><li>Southern All Stars - \"Shiori no Theme\"</li><li>Sonim - \"Tokyo Midnight Loneliness\"</li><li>Taki &amp; Tsubasa - \"Sotsugyou: Sayonara ha Ashita no Tame ni\"</li><li>Becky - \"Sarara\"</li><li>Minimoni. - \"Rock 'n' Roll Kenchoushozaichi\"</li><li>Morning Musume. - \"As for One Day\"</li><li>Anzenchitai -\"Kanashimi ni Sayonara\"</li><li>Anzenchitai - \"Aoi Hitomi no Elis\"</li><li>Asami Abe - \"Our Song\"</li><li>Yousui Inoue - \"Yume no Naka e\"</li><li>Tomomi Kahara - \"Hate Tell a Lie\"</li><li>Maki Gotou - \"Uwasa no Sexy Guy\"</li><li>Maki Gotou - \"Scramble\"</li><li>Ryouko Hirosue - \"Maji de Koisuru 5 Byou Mae\"</li><li>Ryouko Hirosue - \"Daisuki!\"</li><li>Tatsurou Yamashita - \"2000 Ton no Ame\"</li><li>Aya Matsuura - \"Nee?\"</li><li>Seiko Matsuda - \"Aoi Sangoshou\"</li><li>Seiko Matsuda - \"Taisetsu na Anata\"</li><li>Aya Ueto - \"Hello\"</li><li>Aya Ueto - \"Kizuna\"\"</li><li>Aya Ueto - \"Message\"</li><li>Mai Kuraki - \"Kiss\"</li><li>Mai Kuraki - \"Time After Time: Hana Mau Machi de\"</li><li>Nanase Aikawa - \"Break Out!\"</li><li>Ringo Shiina - \"Tobira to Batsu\"</li><li>Miki Fujimoto - \"Boogie to Rain '03\"</li><li>Asuka Hayashi - \"Chiisaki Mono\"</li><li>Masayuki Suzuki - \"Mou Namida wa Iranai\"</li></ul>"},{"name":"Karaoke Revolution: J-Pop Best - vol.7","year":2003,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_k/Karaoke%20Revolution%20-%20J-Pop%20Best%20Vol.%207%20%28Japan%29.zip","filesize":169225160,"score":"","genres":"Simulation > Fixed / flip-screen > Music / rhythm > Menu structures > Voice control > Licensed","desc":"<p>This <em>Karaoke Revolution</em> title is the seventh in the series of J-Pop music which adds yet another 50 titles, thus expanding the total number of j-pop tracks to 350 from the beginning of the series. The gameplay remains unchanged to its predecessors and basically brings you a karaoke at home which can be played by either a USB microphone or USB headset.</p><p>The game offers several different gameplay modes such as Revolution and Stage Challenge where you need to sing as is supposed to in order to avoid game over screen, Team Battle which lets 4, 6, or 8 players go in 2 vs 2, 3 vs 3, or 4 vs 4 battles by naming their groups, selecting and naming their characters and pick to songs to try on against each other, and Audition mode which is a story mode which plays as a short visual novel in between singing, where the player selects one of the four characters trying to enter the music company by auditioning.</p><p>During karaoke singing, player can see only the lyrics or additionally display one's current score in real-time. Background animations during lyrics can be toggled on and off in game options. Any song can be fast-forwarded during playback if you wish to sing particular part or just skip the instrumental pauses.</p><p>Volume 7 of J-Pop best features these tracks:</p><ul><li>3B Lab. - \"Present\"</li><li>C-C-B - \"Romantic ga Tomaranai\"</li><li>Chemistry - \"Floatin'\"</li><li>Chemistry - \"Motherland\"</li><li>Chemistry - \"Naturally Ours\"</li><li>Chemistry - \"Point of No Return\" (Ketsumeishi no Remix.)</li><li>Chemistry - \"Still Echo\"</li><li>Chemistry - \"Two\"</li><li>Chemistry - \"Us\"</li><li>Chemistry - \"Ashita e Kaeru\"</li><li>Chemistry - \"My Way\"</li><li>Chemistry - \"Aishisugite\"</li><li>Chemistry - \"Aikagi\"</li><li>Chemistry meets S.O.S. - \"My Gift to You\"</li><li>Hiro - \"Baby Don't Cry\"</li><li>Kinki Kids - \"To Heart\"</li><li>Kinki Kids - \"Kanashimi Blue\"</li><li>Kinki Kids - \"Jet Coaster Romance\"</li><li>Kinki Kids - \"Flower\"</li><li>Kinki Kids - \"Boku no Senaka ni wa Hane ga Aru\"</li><li>Kinki Kids - \"Aisareru yori Aishitai\"</li><li>Kinki Kids - \"Ai no Katamari\"</li><li>Kinki Kids - \"Eien no Bloods\"</li><li>Kinki Kids - \"Kokoro ni Yume wo Kimi ni wa Ai wo\"</li><li>Kinki Kids - \"Ao no Jidai\"</li><li>Kinki Kids - \"Zenbu Dakishimete\"</li><li>Kinki Kids - \"Hakka Candy\"</li><li>SMAP - \"Dynamite\"</li><li>SMAP - \"Sekai ni Hitotsu Dake no Hana\" (Single Version)</li><li>SMAP - \"Boku wa Kimi wo Tsureteyuku\"</li><li>V6 - \"Mejirushi no Kioku\"</li><li>Ketsumeishi - \"A Session Please\"</li><li>Ketsumeishi - \"Natsu no Omoide\"</li><li>Namie Amuro - \"Chase the Chance\"</li><li>Hikaru Udata - \"Addicted to You\"</li><li>Hikaru Utada - \"Can You Keep a Secret?\"</li><li>Hikaru Utada - \"Distance\"</li><li>Hikaru Utada - \"Final Distance\"</li><li>Hikaru Utada - \"In My Room\"</li><li>Hikaru Utada - \"Letters\"</li><li>Hikaru Utada - \"Movin' on without You\"</li><li>Hikaru Utada - \"Wait &amp; See: Risk\"</li><li>Hikaru Utada - \"Uso Mitai na I Love You\"</li><li>Mika Nakashima - \"Amazing Grace\" (Album Version)</li><li>Mika Nakashima - \"Love Addict\"</li><li>Ken Hirai - \"Even if\"</li><li>Ken Hirai - \"Kiss of Life\"</li><li>Ken Hirai - \"Ring\"</li><li>Ken Hirai - \"Rakuen\"</li><li>Arashi - \"Tomadoinagara\"</li></ul>"},{"name":"Karaoke Revolution: J-Pop Best - vol.9","year":2004,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_k/Karaoke%20Revolution%20-%20J-Pop%20Best%20Vol.%209%20%28Japan%29.zip","filesize":192142272,"score":"","genres":"Simulation > Music / rhythm > Licensed","desc":"<p>This <em>Karaoke Revolution</em> title is the ninth compilation of 50 J-Pop songs of <em>Karaoke Revolution</em> series. The gameplay remains unchanged to its predecessors and basically brings you a karaoke at home which can be played by either a USB microphone or USB headset.</p><p>The game offers several different gameplay modes such as Revolution and Stage Challenge where you need to sing as is supposed to in order to avoid game over screen, Team Battle which lets 4, 6, or 8 players go in 2 vs 2, 3 vs 3, or 4 vs 4 battles by naming their groups, selecting and naming their characters and pick to songs to try on against each other, and Audition mode which is a story mode which plays as a short visual novel in between singing, where the player selects one of the four characters trying to enter the music company by auditioning.</p><p>During karaoke singing, player can see only the lyrics or additionally display one's current score in real-time. Background animations during lyrics can be toggled on and off in game options. Any song can be fast-forwarded during playback if you wish to sing particular part or just skip the instrumental pauses.</p><p>Volume 9 of J-Pop best features these tracks:</p><ul><li>BoA - \"Rock with You\"</li><li>Chemistry - \"Your Name Never Gone\"</li><li>Day After Tomorrow - \"Starry Heavens\"</li><li>Do as Infinity - \"Hiiragi\"</li><li>Do as Infinity - \"Honjitsu wa Seiten Nari\"</li><li>Every Little Thing - \"Mata Ashita\"</li><li>Exile - \"Choo Choo Train\"</li><li>Gackt - \"12-gatsu no Love Song\"</li><li>Glay - \"Beautiful Dreamer\"</li><li>I WiSH - \"Futatsu Hoshi\"</li><li>Misia - \"In My Soul\"</li><li>Misia - \"Kokoro Hitotsu\"</li><li>Mr. Children - \"Kurumi\"</li><li>Mr. Children - \"Tenohira\"</li><li>Soul'd Out - \"Love, Peace &amp; Soul\"</li><li>Speed - \"Be My Love\"</li><li>Tak Matsumoto featuring Zard - \"Ihoujin\"</li><li>Tak Matsumoto featuring Mai Kuraki - \"Imitation Gold\"</li><li>Tokio - \"Ambitious Japan\"</li><li>Tokio - \"Love Love Manhattan\"</li><li>W-inds. - \"Love Is Message\"</li><li>Yoshii Lovinson - \"Tali\"</li><li>Orange Range - \"Shanghai Honey\"</li><li>Orange Range - \"Rakuyou\"</li><li>Ketsumeitsu - \"Natsu no Omoide\"</li><li>Ketsumeitsu - \"Taiyou\"</li><li>Sonim - \"Goukon Go no Family Restaurant nite\"</li><li>Taki &amp; Tsubasa - \"Yumemonogatari\"</li><li>Porno Graffiti - \"Melissa\"</li><li>Porno Graffiti - \"Ai ga Yobu Hou e\"</li><li>Monimoni. - \"Crazy About You\"</li><li>Morning Musume. Otome-gumi - \"Ai no Sono ~Touch My Heart!~\"</li><li>Morning Musume. Sakura-gumi - \"Hare Ame Nochi Suki\"</li><li>Rina Aiuchi - \"Kuuki\"</li><li>Chihiro Onitsuka - \"Beautiful Fighter\"</li><li>Chihiro Onitsuka - \"Watashi to Waltz wo\"</li><li>Maki Gotou - \"Genshoku Gal Hade ni Iku be!\"</li><li>Maki Gotou - \"Daite yo! Please Go on\"</li><li>Kumi Kouda - \"Come with Me\"</li><li>Jikyuu 800-yen - \"Shinu Hodo Anata ga Suki Dakara\"</li><li>Aya Matsuura - \"The Last Night\"</li><li>Aya Ueto - \"Kanshou\"</li><li>Mika Nakashima - \"Yuki no Hana\"</li><li>Riina Shingo - \"Ringo no Uta\"</li><li>Ayumi Hamasaki - \"No Way to Say\"</li><li>Shougo Hamada - \"Kimi ni Sasageru Love Song\"</li><li>Masaharu Fukuyama - \"Niji\"</li><li>Hitomi Yaida - \"Hitori Jenga\"</li><li>Arashi - \"Hadashi no Mirai\"</li><li>Megumi Hayashibara - \"Makenaide, Makenaide...\"</li></ul>"},{"name":"Karaoke Revolution: Love & Ballad","year":2003,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_k/Karaoke%20Revolution%20-%20Love%20%26%20Ballad%20%28Japan%29.zip","filesize":183817899,"score":"","genres":"Simulation > Anime / Manga > Music / rhythm > Licensed","desc":"<p><em>Love &amp; Ballad</em> is a compilation of 50 J-Pop love songs of. The gameplay remains unchanged to <em>J-Pop Best</em> series and even the same gameplay modes are supported. Same as other <em>Karaoke Revolution</em> games, this basically brings you a karaoke at home which can be played by using either a USB microphone or a USB headset.</p><p>The game offers several different gameplay modes such as Revolution and Stage Challenge where you need to sing as is supposed to in order to avoid game over screen, Team Battle which lets 4, 6, or 8 players go in 2 vs 2, 3 vs 3, or 4 vs 4 battles by naming their groups, selecting and naming their characters and pick to songs to try on against each other, and Audition mode which is a story mode which plays as a short visual novel in between singing, where the player selects one of the four characters trying to enter the music company by auditioning.</p><p>During karaoke singing, player can see only the lyrics or additionally display one's current score in real-time. Background animations during lyrics can be toggled on and off in game options. Any song can be fast-forwarded during playback if you wish to sing particular part or just skip the instrumental pauses.</p><p>Tracklist:</p><ul><li>Dreams Come True - \"Mirai Yosouzu II\"</li><li>Dreams Come True - \"Thank You.\"</li><li>Dreams Come True - \"Love Love Love\"</li><li>Glay - \"However\"</li><li>KinKi Kids - \"Mou Kimi Igai Aisenai\"</li><li>Kiroro - \"Nagaiaida\"</li><li>Love Psychodelico - \"These Days\"</li><li>Misia - \"Everything\"</li><li>Misia - \"Hana/Tori/Kaze/Tsuki\"</li><li>Mr. Children - \"Over\"</li><li>Mr. Children - \"Ovarinaki Tabi\"</li><li>Mr. Children - \"Yasashii Uta\"</li><li>Siam Shade - \"Dareka no Kimochi wo Kangaeta Koto ga Arimasu ka?\"</li><li>SMAP - \"Lion Heart\"</li><li>Speed - \"My Graduation\"</li><li>T-Bolan - \"Hanashitaku wa nai\"</li><li>Ann Lewis - \"Linda\"</li><li>Off Course - \"Sayonara\"</li><li>Southern All Stars - \"Bye Bye My Love\"</li><li>Spitz - \"Kaede\"</li><li>Chage &amp; Aska - \"Say Yes\"</li><li>Porno Graffiti - \"Saudade\"</li><li>Morning Musume. - \"Love Machine\"</li><li>Morning Musume. - \"Dekkai Uchuu ni Ai ga Aru\"</li><li>Namie Amuro - \"Can You Celebrate?\"</li><li>Anri - \"Kanashimi ga Tomaranai\"</li><li>Mayo Okamoto - \"Tomorrow\"</li><li>Izumi Katou - \"Suki ni Natte, Yokatta\"</li><li>Hana・Hana - \"Sayonara Daisuki na Hito\"</li><li>Toshinobu Kubota with Naomi Campbell - \"La La La Love Song\"</li><li>Mariko Takahashi - \"For You...\"</li><li>Momoe Yamaguchi - \"Cosmos\"</li><li>Momoe Yamaguchi - \"Ii Hi Tabidachi\"</li><li>Yasuhiro Yamane - \"Get Along Together\"</li><li>Kazumasa Oda - \"Love Story wa Totsuzen ni\"</li><li>Yumi Matsutouya - \"Hello, My Friend\"</li><li>Chisato Moritaka - \"Watashi ga Oba-san ni Nattemo\"</li><li>Maki Ooguro - \"Wakaremashou Watashi kara Kiemashou Anata kara\"</li><li>Maki Ooguro - \"Genki Dashite\"</li><li>Chikako Sawada - \"Aitai\"</li><li>Mariya Takeuchi - \"Genki wo Dashite\"</li><li>Miho Nakayama - \"You're My Only Shinin' Star\"</li><li>Miho Nakayama &amp; Wands - \"Sekaijuu Dare yori Kitto\"</li><li>Fumiya Fujii - \"True Love\"</li><li>Yutaka Ozaki - \"I Love You\"</li><li>Ayumi Hamasaki - \"Dearest\"</li><li>Ayumi Hamasaki - \"Seasons\"</li><li>Ayumi Hamasaki - \"End Roll\"</li><li>Ayumi Hamasaki - \"Far Away\"</li><li>Shougo Hamada - \"Kanashimi wa Yuki no you ni\"</li></ul>"},{"name":"Karaoke Revolution: Party","year":2005,"developer":"Harmonix Music Systems, Inc.","url":"sony_playstation2_k/Karaoke%20Revolution%20Party%20%28USA%29.zip","filesize":1658408362,"score":7.7,"genres":"Simulation > 3rd-person (Other) > Board game > Music / rhythm > Licensed","desc":"<p>The Karaoke Revolution continues with this entry which supports the DDR dance pad and EyeToy USB camera as well as the required USB microphone (a handheld microphone is included).  Karaoke Revolution Party features 50 new songs (ranging from Dean Martin's That's Amore to Beyonce's Crazy in Love) and a host of new party options.</p><p>Sing by yourself, in a duet, or compete one-on-one or in teams to show your Karaoke mastery.  Characters now have more customization options and you can use the EyeToy USB camera to really be the star of the show.  If you have a DDR dance pad, then you can put on a song and dance routine.  There are also a variety of minigames to test your vocal abilities including unique takes on volleyball and stage diving.</p>"},{"name":"Karaoke Revolution: Snow & Party","year":2003,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_k/Karaoke%20Revolution%20-%20Snow%20%26%20Party%20%28Japan%29.zip","filesize":177090428,"score":"","genres":"Simulation > Music / rhythm > Menu structures > Voice control > Licensed","desc":"<p><em>Snow &amp; Party</em> is a compilation of 50 J-Pop winter holidays themed songs. The gameplay remains unchanged to <em>J-Pop Best</em> series and even the same gameplay modes are supported. Same as other <em>Karaoke Revolution</em> games, this basically brings you a karaoke at home which can be played by using either a USB microphone or a USB headset.</p><p>The game offers several different gameplay modes such as Revolution and Stage Challenge where you need to sing as is supposed to in order to avoid game over screen, Team Battle which lets 4, 6, or 8 players go in 2 vs 2, 3 vs 3, or 4 vs 4 battles by naming their groups, selecting and naming their characters and pick to songs to try on against each other, and Audition mode which is a story mode which plays as a short visual novel in between singing, where the player selects one of the four characters trying to enter the music company by auditioning.</p><p>During karaoke singing, player can see only the lyrics or additionally display one's current score in real-time. Background animations during lyrics can be toggled on and off in game options. Any song can be fast-forwarded during playback if you wish to sing particular part or just skip the instrumental pauses.</p><p>Tracklist:</p><ul><li>Bakufu-Slump - \"Runner\"</li><li>Chemistry meets S.O.S. - \"My Gift to You\"</li><li>Do as Infinity - \"We Are.\"</li><li>Dreams Come True - \"Winter Song\"</li><li>Dreams Come True - \"Santa to Tenshi ga Warau Yoru\"</li><li>Globe - \"Can't Stop Fallin' in Love\"</li><li>Globe - \"Departures\" (Radio Edit)</li><li>Globe - \"Face\"</li><li>Globe - \"Love Again\"</li><li>Globe - \"Perfume of Love\"</li><li>Judy and Mary - \"Christmas\"</li><li>Kiroro - \"Fuyu no Uta\"</li><li>L'Arc-en-Ciel - \"Honey\"</li><li>Lindberg - \"Ima Sugu Kiss Me\"</li><li>Speed - \"White Love\"</li><li>T.M.Revolution - \"High Pressure\"</li><li>The Blue Hearts - \"Linda Linda\"</li><li>The Brilliant Green - \"Angel Song: Eve no Kane\"</li><li>Trf - \"Samui Yoru Dakara...\"</li><li>Voice - \"24 Jikan no Shinwa\"</li><li>X Japan - \"Tears\"</li><li>Alice - \"Fuyu no Inazuma\"</li><li>Oniiyan &amp; Oneeyan - \"Hurricane Size II\"</li><li>Christmas Song - \"Kiyoshiko no Yoru\"</li><li>Christmas Song - \"Jingle Bells\"</li><li>Christmas Song - \"Akahana no Tonakai\"</li><li>The Gospellers - \"Hoshikuzu no Machi\"</li><li>Chanels - \"Runaway\"</li><li>Bubblegum Brothers - \"Won't Be Long\"</li><li>Pink Lady - \"Pepper Keibu\"</li><li>Morning Musume. - \"Sou Da! We're Alive\"</li><li>Junichi Inagaki - \"Chrismas Carol no Koro ni wa\"</li><li>Hiromi Gou - \"140,000,000 no Hitomi\"</li><li>Keisuke Kuwata - \"Shiroi Koibitotachi\"</li><li>Koumi Hirose - \"Dear...again\"</li><li>Koumi Hirose - \"Promise\"</li><li>Koumi Hirose - \"Gerende ga Tokeru Hodo Koishitai\"</li><li>Koumi Hirose - \"Romance no Kamisama\"</li><li>Miki Imai - \"Piece of My Wish\"</li><li>Tatsurou Yamashita - \"Christmas Eve\"</li><li>Shonentai - \"Kamenbutoukai\"</li><li>Yumi Matsutoya - \"Koibito ga Santa Claus\"</li><li>Keizou Nakanishi - \"Nemurenu Omoi\"</li><li>Mika Nakashima - \"Tears\"</li><li>Ayumi Hamasaki - \"Appears\"</li><li>Ayumi Hamasaki - \"Audience\"</li><li>Shougo Hamada - \"Kanashimi wa Yuki no you ni\"</li><li>Akiko Wada - \"Ano Kane wo Narasu no wa Anata\"</li><li>Noriyuki Makihara - \"Fuyu ga Hajimaru Yo\"</li><li>Noriyuki Makihara - \"Kitakaze: Kimi ni Todokimasu You ni\"</li></ul>"},{"name":"Karaoke Revolution: Volume 2","year":2004,"developer":"Harmonix Music Systems, Inc.","url":"sony_playstation2_k/Karaoke%20Revolution%20Volume%202%20%28USA%29.zip","filesize":1871495145,"score":7.7,"genres":"Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p>Karaoke Revolution Volume 2 continues the saga of the Karaoke Revolution series with new modes and songs.  The Karaoke Revolution series lets players sing into a microphone and get real-time feedback on their performance.  An indicator bar lets you know where to sing and if you're high or flat.  You can also sing an octave higher or lower if you're out of your range.  Sing well, and the crowd will love you.</p><p>Includes all of the Karaoke Revolution 1 singing modes, plus a new short-song mode.</p><p>Requires either the PS2 headset, included in certain bundles, or the Logitech PS2 Microphone.</p><p>Songs include Baby One More Time, Born to be Wild, Cry, Drift Away, Every Breath You Take, Friends in Low Places, Genie in a Bottle, Heartbreak Hotel, Here Without You, Hot Stuff, I Believe in a Thing Called Love, I Hate Everything About You, I Will Survive, I'll Make Love To You, I'm With You, Irresistible, It's My Life, I've Got You Under My Skin, Jessie's Girl, Lady Marmalade, Let's Get It On, Miss You, My Girl, Papa Don't Preach, Perfect, Rich Girl, Rock and Roll All Nite, (Sittin' On) The Dock of the Bay, Sweet Home Alabama, The First Cut is the Deepest, The Joker, Toxic, Virtual Insanity, We Are Family, and White Flag.</p>"},{"name":"Karaoke Revolution: Volume 3","year":2004,"developer":"Harmonix Music Systems, Inc.","url":"sony_playstation2_k/Karaoke%20Revolution%20Volume%203%20%28USA%29.zip","filesize":1630773429,"score":8,"genres":"Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p>Released shortly after Karaoke Revolution Volume 2, Karaoke Revolution Volume 3 continues the saga of the Karaoke Revolution features new modes and songs in the familiar but popular Karaoke Revolution framework.  You still sing the songs on screen, and a pitch meter tracks how well you are doing.  You can sing an octave higher or lower if you are out of your range.  </p><p>New to the Karaoke Revolution series is a Duets mode, where two people can sing any song they want simultaneously or one of a dozen pre-authored songs with different tracks in harmony with eachother.</p><p>Requires either the PS2 headset, or the Logitech PS2 Microphone, which is in a few of the bundles under the Konami brand name.</p><p>Songs include ABC, Against All Odds, Ain't no Mountain High Enough, Beat It, Burn, California Dreamin', Careless Whisper, China Grove, Come Clean, Don't You (Forget About Me), Flashdance... What a Feeling, Hold On, I Got You Babe, If I Ain't Got You, In the Midnight Hour, Joy to the World, Killing Me Softly, Leave (Get Out), Love Shack, Meant To Live, My Immortal, New York New York, Oops!... I Did It Again, Respect, Shining Star, Snake Eater, Someday, Take My Breath Away, Thank You, The Reason, Twist and Shout, Unchained Melody, Under Pressure, Waiting for You, When I'm Gone, Why Can't I, and You're the One That I Want.</p>"},{"name":"KART Racer","year":2009,"developer":"Brain in a Jar Ltd.","url":"sony_playstation2_k/Kart%20Racer%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":194834417,"score":"","genres":"Racing / Driving > Simulation > 1st-person > Real-time > Direct control > Automobile > Track racing > Vehicle simulator > Contemporary","desc":"<p><em>KART racer</em> is a track racing game primarily for 1 player.</p><p>There are three kart classes: 60cc, 125cc and 250cc Super, and 15 different tracks to drive.</p><p>A new player starts with the lowest class of cart on a single track; you unlock more tracks and cart classes by climbing a score table based on your performance. Losing races may re-lock previously unlocked tracks and cart classes.</p><p>The game has four modes: Race, Knockout, Challenge and Stunt Arena. (The last two modes are locked initially).</p><p>In 'Race' mode you compete against 15 AI opponents, in 5, 10 or 15 laps of a track.You gain points by passing other carts, and the better your placement, the higher ranking on the score table, and the more unlockable content you gain.</p><p>In 'Knockout' mode you compete against 8 AI opponents, and each lap the last cart is taken off the race; so keep at least one behind you to stay in the race. The last (and only) cart over the finish line in the last lap wins.</p><p>The 'Challenge' mode is a competition of consecutive races, where you need to win three tracks in a row to unlock another off-road dirt track and a stunt challenge arena.</p><p>The 'Stunt Challenge' arena is a lap-time limited icy arena where you get points for slides and jumps. The timer is shorter each lap, but unused time from the previous laps is added. The goal is to achieve as many laps as possible before the timer runs out.</p><p>A two-player split-screen mode with special challenges is also mentioned on the covers for for the Wii and PS2 platforms, it seems to have been omitted in the PC version.</p><p>While in a game you can pause and watch replays of the race from various positions.</p><p>Collisions cause visual damage to the kart, as body parts can fly off the players kart (but not the AI kart's), but this causes no control/handling problems.</p><p>If you end up far behind, there is a turbo button to give a short speed boost to your kart to keep up (the AI don't have this).</p><p>In addition to the score table, there is a trophy room showing your won races, the currently unlocked carts/tracks and any special achievements.</p>"},{"name":"Katakamuna: Ushinawareta Ingaritsu","year":2004,"developer":"","url":"sony_playstation2_k/Katakamuna%20-%20Ushinawareta%20Ingaritsu%20%28Japan%29.zip","filesize":865218115,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition retail release comes in a transparent slipcase and includes:</p><ul><li>Katakamuna: Ushinawareta Ingaritsu game</li><li>Soundtrack</li><li>Game production materials booklet</li><li>Mouse pad with rounded corners (width: 13.5 cm, height: 18.8 cm)</li></ul><p>Soundtrack consists of a single audio CD which comes in a digipak and contains these audio tracks:</p><ul><li>02:36 | \"Kazagumo\" (風雲)</li><li>01:47 | \"Chouro\" (朝露)</li><li>01:43 | \"Totsu\" (突)</li><li>03:31 | Izanami's Theme: \"Youkou\" (陽光)</li><li>01:50 | \"Konton\" (混沌)</li><li>02:09 | \"Da\" (堕)</li><li>02:04 | \"Sou\" (想)</li><li>01:07 | Sachika's Theme: \"Myoujou\" (明星)</li><li>03:27 | \"Seijaku\" (静寂)</li><li>01:50 | \"Genmu\" (幻夢)</li><li>01:42 | \"Rouen\" (朗宴)</li><li>01:12 | \"Hakuon\" (迫闇)</li><li>01:51 | Tsukuyomi's Theme: \"Byakuya\" (白夜)</li><li>02:00 | \"You\" (遙)</li><li>01:47 | \"Retsu\" (裂)</li><li>02:11 | \"Fuhen\" (普遍)</li><li>01:21 | Ruka's Theme: \"Zen\" (禅)</li><li>01:49 | \"Ryuusei\" (流星)</li><li>02:11 | \"Ranbu\" (乱舞)</li><li>02:06 | \"Niji\" (虹)</li></ul><p>Booklet with production materials is black &amp; white, A5 size, and contains:</p><ul><li>Table of contents (page 1)</li><li>Main heroines' sketches &amp; info (page 2-17)</li><li>Sketches of sub-characters (page 18-21)</li><li>Sketches of CG event scenes (page 22-32)</li><li>Package, poster, and other art sketches (page 33-39)</li><li>Postscript by Kyou Yamamoto (山本京), the artist (page 40)</li></ul>"},{"name":"Katamari Damacy","year":2004,"developer":"Namco Limited","url":"sony_playstation2_k/Katamari%20Damacy%20%28USA%29.zip","filesize":1316638671,"score":8.3,"genres":"Action > Puzzle > Behind view > Diagonal-down > Direct control > Comedy","desc":"<p>The King of All Cosmos accidentally destroyed the stars and—having recovered—wants the prince to rebuild them.  Unfortunately the prince stands a little less than half a foot tall, so recreating the stars will require some effort.  Enter the Katamari, a sphere the prince can push around our world to “roll up” items increasing the Katamari’s size until it’s suitable for the King.</p><p>Taking place in stylized versions of Japanese houses, cities, and environs, the prince pushes the Katamari around collecting items which adhere to it.  At first, the prince can only pick up smaller items, but as the Katamari grows, the more it can collect.  Push pins and paper clips cling to the Katamari increasing its size so it can roll over obstacles and pick up bigger items.  Over many levels, the Katamari can eventually pick up people, cars, and other bigger items.</p><p>Players steer the Katamari from a third-person perspective using the analog sticks on the PS2.  A tutorial stage takes the player through the controls and sets up the story as well as introducing a side story about a Japanese girl who can feel the cosmos.  Wanting to challenge the prince, the King sets requirements on the Katamari’s size and sets time limits on the level.  Bonus missions restore constellations and have their own restrictions.  </p><p>The world of Katamari Damacy is brought to life with off-beat animation and a catchy soundtrack.  Players can find presents hidden in the levels that contain accessories for the prince.  Two players can also battle head-to-head in a Katamari competition.</p>"},{"name":"Katekyoo Hitman Reborn!: Dream Hyper Battle!","year":2007,"developer":"Marvelous Interactive, Inc.","url":"sony_playstation2_k/Katekyoo%20Hitman%20Reborn%21%20Dream%20Hyper%20Battle%21%20Shinu%20Ki%20no%20Honoo%20to%20Kuroki%20Kioku%20%28Japan%29.zip","filesize":647083602,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p><em>Katekyō Hitman Reborn! Dream Hyper Battle!</em> is a 3D fighting game based on the anime <em>Reborn!</em>, and developed by the company that produced the show specifically to promote it. It features a story that spans from the beginning of the series, when average middle school student Tsunayoshi Sawada is first told by the notorious assassin Reborn that he is next in line to lead a mafia family, to the attack of Mukuro Rokudo's Kokuyo Gang.</p><p>The gameplay itself is in the style of a one-on-one brawler, where players are able to travel around an open area as they battle their opponent. Every character has the ability to dash, block, and call in support, with other abilities being unique to each character. Additionally, every character can enter Dying Will Mode upon filling a gauge at the bottom of the screen, giving their character greater strength, along with a special move that may be activated upon the complete loss of the opponent's health. Two main modes are available for play: Episode mode, which contains scenes and dialogue from the anime, or Dream Hyper Battle! mode, which gives the player freedom to battle with and against all unlocked characters. Playable characters include Tsunayoshi Sawada, Hayato Gokudera, Takeshi Yamamoto, Kyoya Hibari, Dino, Lancia, Ken Joshima, Chikusa Kakimoto, Mukuro Rokudo, and Xanxus.</p>"},{"name":"Kelly Slater's Pro Surfer","year":2002,"developer":"Treyarch Corporation","url":"PS2_COLLECTION_PART12/Kelly%20Slater%27s%20Pro%20Surfer%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":3850060245,"score":7.7,"genres":"Action > Sports > Behind view > Tricks / stunts > Surfing > Licensed","desc":"<p>Do you like to surf? Have you ever imagined surfing at different remote locations around the world? Well, Kelly Slater takes you around the world on his boat to surf some of the more famous beaches. With a control scheme similar to all the other Activision O2 brand games, it's easy to jump into the game and surf. </p><p><strong>Game Play Modes:</strong>  </p><p><strong>Infinite Time</strong> - With no clock, no objectives, and nobody around, this gives you the best opportunity to just enjoy the surf. </p><p><strong>High Score</strong> - With 3 minutes, how high of a score can you get?</p><p><strong>Icon Challenge</strong> - See how many icons you can collect and how high of a score you can get before time runs out.</p><p><strong>Career Mode</strong> - Select a surfer and journey around the world to surf the best waves on the best beaches. As you progress you will unlock new beaches, new surf boards, and new tricks which will be usable in all the other modes of play.</p><p><strong>Multiplayer Modes:</strong>  </p><p><strong>Push</strong> - Two players surf simultaneously in an attempt to \"push\" the split screen towards their opponent's half of the screen. As you score points the screen gets pushed more. The winner is decided once one player is pushed from the screen.</p><p><strong>Head to Head</strong> - Similar to Push but the screen is stationary and the winner is the person with the highest points when the time runs out.</p><p><strong>Time Attack</strong> - Players take turns to achieve the most points possible. The more points you get the less time is alloted to your opponent.</p><p>The Pros in the game: Kelly Slater, Lisa Andersen, Tom Carroll, Tom Curren, Nathan Fletcher, Donavon Frankenreiter, Bruce Irons, Rob Machado, Kalani Robb, and some other secret characters.</p><p>The beaches in the game: Sebastian, Trestles, Mavericks, Antarctica, Jaws, Pipeline, Teahupoo, Bells, Curren's Point, Kirra, G-Land, J-Bay, Mundaka, Cortez Bank, and perhaps some other tucked-away hide-aways.</p><p>The PS2 version of the game also includes a playable demo of Tony Hawk's Pro Skater 4.</p>"},{"name":"Kengo 3","year":2004,"developer":"LightWeight Co., Ltd.","url":"sony_playstation2_k/Kengou%203%20%28Japan%29.zip","filesize":2406829305,"score":"","genres":"Action > 3rd-person (Other) > Fighting","desc":"<p><em>Kengo 3</em> is a 3D fighting game with some Role Playing influences. In the game you learn to master \"The Way of the Warrior\" (Bushido). In this third part of the series it is your aim to travel around Japan during medieval times and win battles to claim your place as the most powerful samurai. The game features a real day/night system and allows you to visit 11 regions in different time periods of Feudal Japan. There are six different weapons to fight with and four stances and attacks to use them with. 30 historical warriors have to be fought in one on one katana fights in various missions. Role Playing elements in the game include being able to pick missions and a large world in which you can travel around freely.</p>"},{"name":"Kengo: Master of Bushido","year":2000,"developer":"LightWeight Co., Ltd.","url":"PS2_COLLECTION_PART12/Kengo%20-%20Master%20of%20Bushido%20%28Europe%29.zip","filesize":368285248,"score":6.8,"genres":"Action > 3rd-person (Other) > Meditative / Zen > Fighting > Martial arts","desc":"<p><em>Kengo: Master of Bushido</em> is a Fighting game in which you try to master \"The Way of the Warrior\" (Bushido). The game features three modes single-player, versus and tournament. The first starts your training where your master teaches you all the knowledge required for this martial art form. In your Dojo you will slowly advance in technique and weaponry, starting with wooden sticks and ending with katanas. Your character has several statistics such as strength and speed which can be upgraded in RPG-like fashion. Besides fighting you will also learn to meditate in various ways. In versus or tournament mode you can bring your experience into practice and play against friends or the computer.</p>"},{"name":"Keroro Gunsou - Mero Mero Battle Royale","year":2004,"developer":"Now Production Co., Ltd.","url":"sony_playstation2_k/Keroro%20Gunsou%20-%20Mero%20Mero%20Battle%20Royale%20%28Japan%29.zip","filesize":638765812,"score":"","genres":"Action > 3rd-person (Other) > Top-down > Anime / Manga > Arcade > Fighting > Licensed","desc":"<p>Keroro is a plucky little green, frog-like alien who claims to be leading an invasion of Earth... but after his platoon is caught by Fuyuki and Natsumi Hinata -- a young brother and sister -- while hiding in their house, they are abandoned by their home planet, and take up residence with the Hinata family. Keroro insists he is still trying to conquer the planet, but seems more interested in building Gundam models than world domination, and fails miserably with every attempt.</p><p><em>MeroMero Battle Royale</em> is a multiplayer party fighting game similar to Power Stone, based on the popular anime and manga franchise known internationally as <em>Sgt. Frog</em>. Up to four players can play as one of twelve characters -- five of the frog-like invaders, five human characters, plus two hidden characters -- and duke it out in an overhead-view arena. Many items and weapons pop up during battles, which characters can grab and use against their opponents. One peculiar feature of the game is that everything takes place in a diorama, and each stage has two such arenas connected, which will switch depending on conditions in the battle.</p><p>The game includes a Story Mode that follows specific characters and offers unlockable bonuses, a Free Mode where up to four players can duke it out on a stage of their choosing, and a Training Mode. There is also a gallery mode where unlockable illustrations, videos, and voice clips can be viewed.</p>"},{"name":"Keroro Gunsou - Mero Mero Battle Royale Z","year":2005,"developer":"Now Production Co., Ltd.","url":"sony_playstation2_k/Keroro%20Gunsou%20-%20Mero%20Mero%20Battle%20Royale%20Z%20%28Japan%29.zip","filesize":327678073,"score":"","genres":"Action > 3rd-person (Other) > Top-down > Anime / Manga > Arcade > Fighting > Licensed","desc":"<p><em>MeroMero Battle Royale Z</em> is the sequel to the first game. It plays virtually identically, but adds three new playable characters for a total of 15, and also adds three new game modes: a Challenge Mode that gives 10 missions to clear for each character, a Survival mode where the player must complete as many missions as possible without running out of life, and a 2D Fighter mode that limits movement to a 2D plane, mimicking games like Super Smash Bros. The story mode, however, has been removed.</p>"},{"name":"Kessen","year":2000,"developer":"KOEI Co., Ltd.","url":"PS2_COLLECTION_PART12/Kessen%20%28Europe%29.zip","filesize":4017738343,"score":6.9,"genres":"Strategy > 3rd-person (Other) > Top-down > Managerial / business simulation > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p><em>Kessen</em> is a strategy game that tells the story of the events that brought feudal Japan out of a century of civil war and installed the Tokugawa Shogunate as the dominant political entity for the next two hundred years.</p><p>As either Tokugawa Ieyasu or his opponents, you'll engage in real time battles, including Sekigahara, one of the largest and most famous battles in Japanese history. Victory or defeat will steer you down a campaign trail, taking you either through the historical events of the time or down fictional 'what if?' scenarios. </p><p>Battles take place in real time, with you instructing your various generals on where to lead their troops, who to engage, and what special actions to perform. These special actions, such as firing your cannons, charging your opponent, or unleashing a flight of arrows, are depicted in close-up, cinema-like cut-scenes. </p><p>Before, after, and sometimes even during battles you'll be shown cut-scenes that depict the personal struggles of your various subordinates.</p>"},{"name":"Kessen II","year":2001,"developer":"KOEI Co., Ltd.","url":"PS2_COLLECTION_PART12/Kessen%20II%20%28Europe%29.zip","filesize":3821929950,"score":7.4,"genres":"Strategy > Behind view > Diagonal-down > Managerial / business simulation > China (Ancient / Imperial) > Historical events","desc":"<p>It is a time of war. Many leaders from different factions fight to control their land. One such leader, Liu Bei, has only one wish: peace. But war stands in his way, after his land Shu is attacked by the kingdom of Wei, led by the warlord Cao Cao, who abducts Liu Bei's beloved Diao Chan, the keeper of the Imperial Seal. Liu Bei has to flee, but swears to return, exact revenge on Cao Cao, and liberate the kingdom of Shu.</p><p><em>Kessen II</em> is a real-time strategy game, and a follow-up to Kessen. Unlike the first game, it is set in the Chinese Three Kingdoms period. The account of historical events is heavily fictionalized in the game, liberally adding new sub-plots (such as the entire romance angle of the story) and supernatural elements. The player can choose to command the armies of either Liu Bei or Cao Cao in their respective scenarios.</p><p>The gameplay is similar to that of the previous game, the most notable change being the shift to supernatural warfare, including the addition of magical attacks such as tornadoes, lightning strikes, earthquakes, meteor showers, etc. The player can now control 500 units at one time, as opposed to 100 in the previous game. New unit types (elite horsemen, elephant cavalry, etc.) have been added.</p>"},{"name":"Kessen III","year":2004,"developer":"KOEI Co., Ltd.","url":"PS2_COLLECTION_PART12/Kessen%20III%20%28Europe%29.zip","filesize":4597892302,"score":7,"genres":"Action > Strategy > Behind view > Top-down > Japan (Ancient/Classical/Medieval)","desc":"<p>In <em>Kessen III</em>, the player takes control of Nobunaga Oda and unlike the previous two games, the player may not choose a side to play on. Nobunaga has only one goal: to unify the lands and rid his world of misery and suffering.</p><p>Following the predecessors, this game comes with lots of cinematics and stays true to strategic as well as action gameplay, adding a few new things along the road, like collecting items during battles.</p><p>The two main aspects of this game are planning and engaging in battle. Select officers and strategically place them on the field of battle, assign commands and issue orders. When on the battlefield, each of the officers, including Nobunaga, will have his/her army at their disposal which can be controlled at any point. Level-ups bring additional special attacks to both officers and their troops.</p>"},{"name":"Kiddies Party Pack","year":2006,"developer":"The Code Monkeys Ltd.","url":"PS2_COLLECTION_PART12/Kiddies%20Party%20Pack%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":44022927,"score":"","genres":"Action > Puzzle > Paddle / Pong","desc":"<p>An incredible collection of activities that will give your kids hours & hours of fun.</p><p>5 different Cartoon Characters: * King of the Lions * Dinosaurs * Hercules * Mulan * Crazy Football</p><p>Each Cartoon Character has 5 different activities: * Jigsaw Game with 24, 48 or 96 pieces * Block puzzle with 24, 48 or 96 pieces * Colouring activity with 22 different colours * Puzzle Activity with 3x3, 4x4, 5x5 and 6x6 icons * Scenemaker</p>"},{"name":"Kidou Senshi Gundam - Ichinen Sensou","year":2005,"developer":"Namco Limited","url":"sony_playstation2_k/Kidou%20Senshi%20Gundam%20-%20Ichinen%20Sensou%20%28Japan%29.zip","filesize":2951136192,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Shooter > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p><em>One Year War</em> is a third-person action shooting game based on the original <em>Mobile Suit Gundam</em> television series from 1979. Following the events of the \"One Year War\", the player takes the role of young pilot Amuro Ray through 28 missions that recreate key events from the original series. The game includes both ground and space battle stages, and there are a wide variety of different weapons and machines to use. One notable feature is the so-called \"Memorial Actions\" system, where completing special requirements that match events in the series will unlock additional bonus content.</p>"},{"name":"Kidz Sports: Basketball","year":2005,"developer":"Data Design Interactive Ltd","url":"sony_playstation2_k/Kidz%20Sports%20Basketball%20%28Europe%2C%20Australia%29.zip","filesize":39793655,"score":"","genres":"Sports > Basketball","desc":"<p>TAKE IT TO THE COURT!<br><br>Take control of your favorite Kidz Sports characters in some of the wackiest games of full-court 3-on-3 ever!<br><br><br>* Pick Up and Play: Use the Wii Remote and Nunchuk to dribble your way through the competition and slam dunk your way to victory!<br>* Hours of Fun: Defeat all challengers in the single-player Knockout Cup tournament, or take on a friend in two-player head-to-head action!<br>* Wild Zany Action: This isn't your parents' basketball game! Unleash dominating Super Moves with Wii Remote gestures, like triple jumps, super slams, and more!</p>"},{"name":"Kidz Sports: Ice Hockey","year":2004,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART12/Kidz%20Sports%20Ice%20Hockey%20%28Europe%29.zip","filesize":41666900,"score":"","genres":"Sports > Hockey","desc":"<p>LACE UP YOUR SKATES!<br><br>Get your skates on and take control of your favorite Kidz Sports characters in some of the wackiest games of ice hockey ever!<br><br>* Pick Up and Play: Use the Wii Remote and Nunchuk to skate rings around the competition and slap shot your way to victory!<br>* Hours of Fun: Defeat all challengers in the single-player Knockout Cup tournament, or take on a friend in two-player head-to-head action!<br>* Wild Zany Action: This isn't your parents' ice hockey game! Unleash dominating Super Moves with Wii Remote gestures, like chip shots, power shots, and more!</p>"},{"name":"Kill.switch","year":2003,"developer":"Namco Hometek Inc.","url":"PS2_COLLECTION_PART12/Kill.switch%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2956601387,"score":7.1,"genres":"Action > 1st-person > Behind view > Sci-fi / futuristic","desc":"<p>An innovative third person shooter that makes heavy use of a 'cover system'.  This allows the player to 'attach' to objects so that they can fire at the enemy from a safe position.    </p><p>Basically you are some sort of enhanced soldier with no memory of who or where you came from.  The story unfolds over the course of fifteen missions, spanning 5 levels, and through FMV cinematics.  </p><p>At first you'll cause all sorts of mayhem in various global hotspots, but as the past is made clear, the real enemy and their ultimate objective will be revealed.</p>"},{"name":"Killer 7","year":2005,"developer":"Capcom Production Studio 4","url":"PS2_COLLECTION_PART12/Killer%207%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2677662534,"score":7.5,"genres":"Action > 1st-person > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Contemporary > Japan (Modern/Futuristic)","desc":"<p>In an alternate version of the Earth's history, a treaty was signed in the early 21st century, during which all countries willingly destroyed their nuclear arsenals, ending international conflicts. The presumed era of world peace, however, is marred by continuous attacks carried out by a new terrorist group called \"Heaven Smile\", which consists of human mutants under the influence of a lethal virus, and targets the United Nations and the International Ethics Committee (IEC). Meanwhile, the relationship between the United States and Japan deteriorates, as the latter becomes controlled by a party that proposes to sever connections to the USA.</p><p>A group of assassins known as Killer7 is hired by a man named Christopher Mills, on behalf of the US government. The group is led by an elderly wheelchair-bound man named Harman Smith, endowed with an ability known as \"Multifoliate Personae Phenomenon\", which allows him to transform into seven different personalities who were professional assassins in their lives, and whose souls were absorbed by Harman after they were killed in a mysterious incident fifty years ago. Garcian Smith is the leading persona among these seven, and the only one who can communicate with Harman.</p><p><em>Killer7</em> is a hybrid game that incorporates shooting and puzzle-solving with light role-playing elements. The player can switch between any of the seven characters during most parts of the game. Each character has unique abilities. Dan, for example, is a true marksman, while Coyote is an experienced thief with exceptional movement. The unusual cast also includes the blind Con who moves very fast, Kaede with ranged skills, Mask who has the deadliest arsenal, the albino Kevin who can turn invisible, as well as Garcian, the leader of the pack who possesses the ability to revive the bodies of slain personalities. </p><p>Despite its 3D environments, character navigation in the game is restricted: playable characters can only move along pre-determined (though often branching) paths. Drawing out a weapon switches the view to a first-person perspective with free camera rotation, but no possibility to move. Typically, the player should eliminate the approaching enemy as quickly as possible before sustaining damage, using various combinations of characters and weapons. Defeated enemies (particularly those dispatched with critical hits) yield the player \"blood\", which can be turned into serum in special rooms and used to enhance the abilities of the characters. A considerable portion of the gameplay is dedicated to solving various puzzles and gathering plot-related information by conversing with the game's exotic characters.</p>"},{"name":"Killzone","year":2004,"developer":"Guerrilla B.V.","url":"PS2_COLLECTION_PART12/Killzone%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":3795048989,"score":7.2,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>During the era of space exploration, a faction of humans colonized the planet Helghan. In order to survive in the harsh environment, these people mutated to the point of no longer remaining human. They developed a passionate hatred for mankind, and eventually formed the Helghast Empire, attacking the planet Vekta controlled by the Interplanetary Strategic Alliance (ISA). As Helghast soldiers invade the planet's perimeter, the ISA forces are trying to hold the ground and find a way to stop them.</p><p><em>Killzone</em> is a sci-fi-themed first-person shooter. The game's stand-out feature is the ability to control any of the four different protagonists, each with his or her own strengths and weaknesses. These characters are: Templar, the balanced squad leader; Rico, who prefers heavy weaponry and is on a quest for revenge; Luger, the team's only female member and a specialist in stealth, who can access special areas; and Hakha, a half-Helghast who can use Helghast weapons and proximity mines.</p><p>Up to sixteen players could compete in the online multiplayer portion, which includes eight maps and six modes: Deathmatch, Team Deathmatch, Assault, Defend and Destroy, Supply Drop, and Domination. The online servers of the game have now been closed down.</p>"},{"name":"Kimi ga Nozomu Eien","year":2003,"developer":"Âge"},{"name":"Kimi ga Nozomu Eien: Rumbling Hearts","year":2003,"developer":"","url":"sony_playstation2_k/Kimi%20ga%20Nozomu%20Eien%20-%20Rumbling%20Hearts%20%28Japan%29.zip","filesize":3226387598,"score":"","genres":"Special edition > Physical extras","desc":"<p>This first print limited edition release contains:</p><ul><li>Kimi ga Nozomu Eien: Rumbling Hearts game</li><li>Hand towel (28 x 28 cm)</li><li>Picture labels</li></ul>"},{"name":"KimiKiss","year":2006,"developer":"Enterbrain, Inc.","url":"sony_playstation2_k/KimiKiss%20%28Japan%29.zip","filesize":2513496611,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Dating simulation > Visual novel > Asia > Romance","desc":"<p><em>KimiKiss</em> (キミキス) is a romantic visual novel dating simulation game. The game features Kouichi Aihara, a high-school student whose summer vacation has ended, as the protagonist. As any other juvenile, he is wondering what it feels to fall in love and even more so, what it feels to kiss a girl. Little did he know that this school year will give him plenty of chances to experience exactly what his heart wishes.</p><p>Similar to other dating simulations, the story progresses one day at a time on a calendar, features several heroines and love interests for the player, and each of the girls will have to be approached in a different manner, learning what they do and don't like, and find the right topics of conversation to keep them interested. The dialogues and dialogue choices work in a generally same manner as on other visual novel as well as selecting the next location within the school to visit, which progresses time and gives the player a chance to meet and talk to a different girl.</p><p>Unlike many visual novels which are based on manga and anime, this game was followed by several manga adaptations as well as anime television series.</p>"},{"name":"Kinetica","year":2001,"developer":"SCE Studio Santa Monica","url":"sony_playstation2_k/Kinetica%20%28USA%29.zip","filesize":700883776,"score":7.4,"genres":"Racing / Driving > Behind view > Direct control > Sci-fi / futuristic","desc":"<p>The absolute merging of man and cycle technology has arrived. They're called Kinetic skins. Scientifically advanced exoskeletons are fused with humans to allow them to harness unbelievable speed and incredible agility. They can adhere to any surface and use anti-gravity maneuvers for stunts that would normally be impossible. Use this incredible advantage to perform insane stunts and draft behind opponents to enhance the Skin's speed. Prepare for racing in the world of Kinetica!</p>"},{"name":"King Arthur","year":2004,"developer":"Krome Studios Pty Ltd.","url":"PS2_COLLECTION_PART12/King%20Arthur%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2316764046,"score":6.5,"genres":"Action > 3rd-person (Other) > Classical antiquity > Europe > Fantasy > Licensed","desc":"<p><em>King Arthur</em> is a 3D action game based on the Jerry Bruckheimer film of the same name. Players can choose to play as Arthur, Lancelot, Tristan, Bors, and Guinevere, each with their own attack moves and combos, and challenge friends through the multi-player combat option. Other game features include horseback combat levels and cutscenes that utilize footage from the movie.</p>"},{"name":"King of Clubs","year":2007,"developer":"Eipix d.o.o.","url":"PS2_COLLECTION_PART12/King%20of%20Clubs%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":313518853,"score":5.3,"genres":"Sports > Behind view > Golf","desc":"<p>King of Clubs is a crazy golf game set in Big Bubba’s run down theme park in the middle of the Nevada desert.  It features 96 holes, set in 5 different environment themes.  Each environment theme has its own resident ‘Course Pro’ resplendent in suitably themed fancy dress costume.</p><p>There are 4 single player modes (Career, Tournament, Speed Golf, Practice).  As you progress through the game, you’ll unlock special balls and clubs which enable you to play different types of shots (e.g. chip clubs, swerve clubs, rubber balls, speed balls).  Combinations of these balls and clubs then allow you to approach holes in different ways and attempt various trick shots to try and get a hole in one (which is possible on every hole).</p><p>In multi-player, you can play against up to 3 friends.  The multi-player game features specific pickups which can help you &amp; hinder your opponents as well as a ‘distraction’ feature which allows non-active players to trigger sound effects &amp; rumble the pad of the player currently taking a shot.</p><p>The game also features a ‘Pro-Shop’ where buy various gadgets to customise various elements of the game such as the colour of your ball, its trail and even the sound effects it makes when you hit it.</p>"},{"name":"King of Fighters '94 Re-bout (Special Edition), The","year":2004,"developer":"","url":"sony_playstation2_k/King%20of%20Fighters%20%2794%2C%20The%20-%20Re-Bout%20%28Japan%29%20%28Special%20Genteiban%29.zip","filesize":2461255424,"score":"","genres":"Special edition > Physical extras","desc":"<p>This special edition of The King of Fighters '94 Re-bout comes with the following items:</p><ul><li>The King of Fighters '94 Re-bout</li><li>81 page reference book which includes character profiles, artwork, chronology and history of the series, story line for King of Fighters '94 and feedback from the creators.</li><li>Limited edition NeoGeo Pad2 controller for the PS2.</li><li>King of Fighters 10th Anniversary cell phone strap.</li></ul>"},{"name":"King of Fighters '94 Re-bout, The","year":2004,"developer":"Fine Co., Ltd.","url":"sony_playstation2_k/King%20of%20Fighters%20%2794%2C%20The%20-%20Re-Bout%20%28Japan%29.zip","filesize":2461248734,"score":"","genres":"Action > Side view > Arcade > Fighting","desc":"<p>In celebration of its 10th anniversary SNK re-releases the title that started its most famous fighting game franchise: The King of Fighters '94.</p><p>The remake smooths and upscales the original character sprites, includes completely new backgrounds with 3d elements, and adds the ability to edit the teams. </p><p>Also included is the original game in full emulated form, as well as online capabilities for multiplayer matches through KDDI's Multi Matching BB service, plus new character artwork and additional bonus features such as an animé intro and promotional videos.</p>"},{"name":"King of Fighters '98, The: Ultimate Match","year":2008,"developer":"SNK Playmore Corporation","url":"PS2_COLLECTION_PART12/King%20of%20Fighters%20%2798%2C%20The%20-%20Ultimate%20Match%20%28Europe%29.zip","filesize":2766466212,"score":7.5,"genres":"Action > 3rd-person (Other) > Side view > Fighting","desc":"<p>A remixed version of King of Fighters '98 with rebalanced gameplay, \"Ultimate\" fighting mode, an unlockable art gallery, and 64 fighters to choose from (10 of these were previously unseen in KoF '98). Also included is the original Neo Geo version. Additionally, the game now supports 480p resolution.</p><p>Featuring 5 game modes: Arcade, Single Play (no team), Endless (endurance trial), Practice and Challenge mode. Options include the ability to increase character sprite size, soften the sprite by various degrees (reduces blockiness), and a 3D/2D background toggle. The Ultimate fighting mode lets you toggle three different modes: Move Type: Dash / Step, Evasion Type: Avoiding / Urgent and Power Gauge: Advanced / Extra</p><p>The game comes with a second bonus disc, containing trailers and wallpapers for both this title, and the upcoming King of Fighters XII.</p>"},{"name":"King of Fighters 2000, The","year":2002,"developer":"SNK Corporation","url":"sony_playstation2_k/King%20of%20Fighters%202000%2C%20The%20%28USA%29.zip","filesize":1152288644,"score":7.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>The final King of Fighters game released by SNK in its original state, <em>The King of Fighters 2000</em> expands on the story and gameplay presented in The King of Fighters '99. This year's tournament is sponsored by the Ikari Warriors in an attempt to discover more about the NESTS organization, and to derail the plans of potential NESTS agents K' and Maxima. Not everything is as straight-forward as it usually is, however, and even the Ikari Warriors themselves are at risk of being betrayed from within by the end of the tournament.</p><p><em>The King of Fighters 2000</em> features a roster of 34 fighters plus 2 unlockable boss characters. The four-man teams and the striker system introduced during the previous year return in this year's tournament, with the striker system itself receiving significant improvement. One change in particular is the \"alternate\" striker system, where every fighter in the game now has another character linked to him or her that may be chosen instead of the normal character for striking purposes. For example, one may elect to use Iori Yagami's alternate striker instead of using Iori himself; in his case, the player could elect to choose and use his old teammates Mature and Vice for striker duty instead. Some characters also have hidden \"maniac\" striker with strange (but potentially useful) abilities.</p>"},{"name":"King of Fighters 2000/2001, The","year":2003,"developer":"","url":"PS2_COLLECTION_PART12/King%20of%20Fighters%202000-2001%2C%20The%20%28Europe%29.zip","filesize":885954309,"score":7.4,"genres":"Compilation","desc":"<p>This is a two-game release which includes The King of Fighters 2000 and The King of Fighters 2001.</p>"},{"name":"King of Fighters 2001, The","year":2003,"developer":"BrezzaSoft","url":"sony_playstation2_k/King%20of%20Fighters%202001%2C%20The%20%28USA%29.zip","filesize":1345564141,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts","desc":"<p>In this eighth installment of the King of Fighters series, ten different teams once again battle it out in several countries to decide which team will be this year's King of Fighters. However, the NESTS organization is once again standing in the participant's way; they have deployed their own team of four fighters, lead by two individuals of high-rank within NESTS: a man claiming to be the original Zero and Igniz, the CEO of NESTS.</p><p>The character roster has been updated yet again for this release in the series. Counting the new characters (May Lee, Angel, K9999, Original Zero, Igniz) and returning fighters (such as Heidern and Goro Daimon), <em>The King of Fighters 2001</em> has 40 normal characters and 2 boss characters to choose from. In terms of gameplay, the system used in The King of Fighters 2000 remains more or less unchanged with the exception of the striker system, which has been redeveloped since that last KOF release. The number of strikers you may have is now fully customizable; you can have as many as 3 characters assigned as strikers and one as a fighter, or assign all 4 of your characters as active fighters. The number of strikers and fighters can be changed after each battle. In addition, the amount of power you can store for special maneuvers and Desperation Moves increases with each character assigned as a striker. A fully active fighting team has only one Power Stock to play with, while a team that is striker-dedicated (save for the single fighter) can access up to four Power Stocks.</p>"},{"name":"King of Fighters 2002, The: Challenge to Ultimate Battle","year":2004,"developer":"Eolith Co., Ltd.","url":"sony_playstation2_k/King%20of%20Fighters%202002%2C%20The%20-%20Challenge%20to%20Ultimate%20Battle%20%28USA%29.zip","filesize":3373465558,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy > Martial arts","desc":"<p>The second plotless \"dream match\" in <em>The King of Fighters</em> series, this game sports 39 normal characters and 5 hidden characters, some of whom haven't appeared since KOF98. <em>The King of Fighters 2002</em> also has five characters exclusive to the X-Box, the PS2 and/or Dreamcast systems: Shingo Yabuki, King, Geese Howard, \"Riot of the Blood\" Iori and Leopold Goenitz. Shingo and King are available on all the non-Neo Geo systems, while Geese and the rest are only available on the PS2 and X-Box platforms.</p><p>The gameplay system has also changed. The striker system and four-character teams found in the last three KOF releases have been totally removed. In their place are the old-school three man teams and the \"Advanced system\" from The King of Fighters '97 and The King of Fighters '98.</p>"},{"name":"King of Fighters 2002, The: Unlimited Match","year":2009,"developer":"SNK Playmore Corporation","url":"sony_playstation2_k/King%20of%20Fighters%202002%2C%20The%20-%20Unlimited%20Match%20%28Japan%29.zip","filesize":2375275263,"score":"","genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy > Martial arts","desc":"<p><em>The King Of Fighters 2002 Unlimited Match</em> is an remake of the original The King of Fighters 2002: Challenge to Ultimate Battle. The game now has many new features, including all new music, completely redesigned stages, and many more characters.</p><p>The game includes all the characters from the original version (with the exception of <em>K9999</em>, which has been replaced by a new character, <em>Nameless</em>), it also adds ten new playable characters from The King of Fighters '99, The King of Fighters 2000 and The King of Fighters 2001, as well as the bosses from all the aforementioned games and Omega Rugal, the final boss in the original version of <em>The King of Fighters 2002: Challenge to Ultimate Battle</em>. These bosses are all unlockable; along with them, there are also six hidden characters to unlock.</p><p>Like other recent SNK releases, the game also has an endless mode where you can play as long as you can keep your character alive, a challenge mode where you must clear certain objectives and challenges, and character and ending galleries. The disc also includes the original Neo-Geo version of the game - it does not include any of the additions (such as extra characters, remixed music, or the puzzle game mode) from the earlier Dreamcast and PS2 ports of the game.</p>"},{"name":"King of Fighters 2002, The: Unlimited Match - Tougeki Ver.","year":2010,"developer":"SNK Playmore Corporation","url":"sony_playstation2_k/King%20of%20Fighters%202002%2C%20The%20-%20Unlimited%20Match%20-%20Tougeki%20Ver.%20%28Japan%29.zip","filesize":2386866095,"score":"","genres":"Action > 3rd-person (Other) > Fighting > Martial arts","desc":"<p><em>The King of Fighters 2002: Unlimited Match Tougeki Ver.</em>, is a rebalanced re-release of The King of Fighters 2002: Unlimited Match. Several infinite combos and gameplay bugs have been fixed; all fixes were based on the updated arcade version of the game.</p><p>The game does not have any additional features, but was sold at a lower price than its predecessor.</p>"},{"name":"King of Fighters 2002/2003, The","year":2005,"developer":""},{"name":"King of Fighters 2003, The","year":2004,"developer":"SNK Playmore Corporation","url":"PS2_COLLECTION_PART13/King%20of%20Fighters%202003%2C%20The%20%28Europe%29.zip","filesize":502684368,"score":7.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>The tenth installment in SNK's long running King of Fighters series, and the last KOF to appear on the Neo Geo system. This game's storyline focuses on the unexpected return of the Orochi power, who was thought to have been permenantly sealed away back in 1997 by Kyo Kusanagi, Iori Yagami and Chizuru Kagura. It appears that someone has been tampering with the seal, however...</p><p>This year there are 30 characters, 2 edit characters (Kyo Kusanagi and Iori Yagami) and 2 hidden characters (Kusanagi from KOF '02 and Chizuru Kagura) to choose from. There are several returning characters (Jhun Hoon, King, Shingo Yabuki, Hinako Shijou, Billy Kane and Ryuji Yamazaki) and few new fighters as well (Ash Crimson, Shen Woo, Duo Lon, Malin, Adelheid Bernstein and Mukai).</p><p>Like The King of Fighters 2002, this game reverts back to the old 3-on-3 format used from KOF '94 to KOF '98. A new feature to this game that old-school KOF fans might have trouble getting used to is the new interchangeable team system. You still pick three characters and decide your character order before a match, but now you have the option to change to another character during a match. For example, if your character is low on power during a match, you can have either one of the other two characters at your disposal step in and take their place. It also works if you do not like the character that you have selected, or if you are having trouble using that character. You can change at any time during a match, but you cannot when two of your teammates have been taken out, and only one character is left in reserve.</p>"},{"name":"King of Fighters 2006, The","year":2006,"developer":"SNK Playmore Corporation","url":"sony_playstation2_k/King%20of%20Fighters%202006%2C%20The%20%28USA%29.zip","filesize":1873126818,"score":6.8,"genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Arcade > Fighting","desc":"<p>Second in the 3D \"Maximum Impact\" King of Fighters games, MI2 brings you back to the team fighting universe of the KOF with the added spin of using a polygonal engine.</p><p>All of the characters from the original MI return, and are joined by 4 newcomers and 14 secret guest stars, totaling a whopping 38 characters, each with a unique story mode and dozens of possible costumes.</p><p>The story this time deals with the appearance of the evil Jivatma in South Town, where all the heroes converge for their own personal reasons. Gameplay changes include the ability to sidestep and super cancel several moves; additional backgrounds and bonus features can be unlocked after beating the story mode, as well as completing the mission mode and time attack challenges.</p>"},{"name":"King of Fighters Collection, The: The Orochi Saga","year":2008,"developer":"SNK Corporation","url":"PS2_COLLECTION_PART13/King%20of%20Fighters%20Collection%2C%20The%20-%20The%20Orochi%20Saga%20%28Europe%29.zip","filesize":700644579,"score":6.8,"genres":"Action > Compilation > Side view > 2D scrolling > Anime / Manga > Fighting > Martial arts","desc":"<p><em>The King of Fighters Collection: The Orochi Saga</em> contains emulated versions of the first five games in the King of Fighters series:</p><ul><li>The King of Fighters '94</li><li>The King of Fighters '95</li><li>The King of Fighters '96</li><li>The King of Fighters '97</li><li>The King of Fighters '98: Dream Match Never Ends</li></ul><p>The package also includes a Challenge mode, where you can unlock over two hundred bonus goodies, like character art and music from the games.</p>"},{"name":"King of Fighters XI, The","year":2006,"developer":"SNK Playmore Corporation","url":"PS2_COLLECTION_PART13/King%20of%20Fighters%20XI%2C%20The%20%28Europe%29.zip","filesize":2133858588,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting","desc":"<p>The eleventh installment in SNK Playmore's long-running King of Fighters series and the ninth event in the official storyline, <em>The King of Fighters XI</em> is the first game in the series to forego the traditional numbering convention used by the series, and the first game in the series to move beyond the hardware capabilities of the Neo-Geo system. After the controversial resurgence of the Orochi power in the 2003 King of Fighters tournament, the tournament and the fighters return after a two year break in the action. Some are motivated to investigate the new Orochi situation and the antagonistic fighter Ash Crimson, while others enter the tourney to settle old scores...</p><p><em>The King of Fighters XI</em> features a roster of 33 \"team\" characters, 7 PS2 exclusive characters, 5 mid-boss characters and 2 boss characters. In total, this allows a player to choose between +40 characters. Many of the characters are returning fighters from the other games in the KOF series, though notable new faces exist in the effective forms of Oswald, Duck King, Bonne Jenet, Elisabeth Blanctorche and Gai Tendo.</p><p>The \"tag system\" used in The King of Fighters 2003 is still employed in KOF XI. However, the change in the arcade hardware has brought about many gameplay changes since the 2003 release. A new power stock system - specifically called \"Skill Stocks\" - has been added for use with a few extra special maneuvers called \"Shifts\". A character can use a \"Quick Shift\" to tag in another fighter while in the middle of a combo, while that character may also use a \"Saving Shift\" to tag out if they are on the verge of defeat. Another maneuver, called the \"Dream Cancel\", has also been added to the system. Dream Cancels can be used to interrupt a special move with another one, even allowing a fighter to interrupt a Desperation Move to initiate a Leader Desperation Move. The \"Time Out\" system has be revamped as well - the system now takes into account the number of fighters defeated on a team and the number and power of attacks made by a team to reach its verdict.</p>"},{"name":"King of Fighters, The: Neowave","year":2005,"developer":"SNK Playmore Corporation","url":"PS2_COLLECTION_PART12/King%20of%20Fighters%2C%20The%20-%20Neowave%20%28Europe%2C%20Australia%29.zip","filesize":1813667870,"score":6.6,"genres":"Action > Side view > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>King of Fighters Neowave is a 2D fighting game where you select a team of 3 fighters and compete against other teams of 3 fighters with the ultimate goal of reaching the final boss and defeating him.</p><p>King of Fighters Neowave was developed for the Atomiswave arcade hardware and has now been ported to home systems. Fight using a team of 3 fighters chosen from 43 characters plus several secret characters. Backgrounds are now detailed 3d models replacing the flat backgrounds of previous King of Fighters games. Choose from 3 different fighting styles, Super Cancel, Guard Break and Max 2. Try endless mode where you fight an unlimited number of opponents. This game also features a practice mode and an art gallery.</p>"},{"name":"King of Fighters, The: Nests Collection","year":2007,"developer":"SNK Playmore Corporation"},{"name":"King of Fighters, The: Orochi-Hen","year":2006,"developer":"SNK Corporation"},{"name":"King of Fighters, The: Orochi-hen (Genteihan)","year":2006,"developer":"SNK Playmore Corporation"},{"name":"King of Route 66, The","year":2003,"developer":"SEGA-AM2 Co., LTD.","url":"PS2_COLLECTION_PART13/King%20of%20Route%2066%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1333878261,"score":6.1,"genres":"Racing / Driving > 1st-person > Behind view > Tricks / stunts > Transport > Truck > Vehicle simulator","desc":"<p><em>The King of Route 66</em> is an arcade style 18-Wheeler driving game. The game takes place on the famous Route 66, a highway that runs through America from Illinois to California.</p><p>This game features a story mode in which the Evil Tornado Corporation has taken over all the trucking jobs along Route 66. You play a hero trucker who challenges Tornado drivers all along the route and puts them in their place by getting your cargo to the destination first. This game mode, called the King of Route 66, plays mostly like a sequel to 18 Wheeler. The next game mode is called the Queen of Route 66. In this mode you have to clear a challenge set to you by the Queen of the particular state you have selected, such as the Queen of Illinois needing you to race around open areas and collect gems before time runs out or the Queen of Oklahoma asking you to finish a race without destroying any of the city.</p><p>There are other game modes as well. The Route 66 Challenge has you performing various stunts with your truck. The Rival Chase is a straightforward race similar to King mode. Vs. Battle is a two player mode.</p>"},{"name":"King's Field: Dark Side Box","year":2007,"developer":""},{"name":"King's Field: The Ancient City","year":2001,"developer":"FromSoftware, Inc.","url":"sony_playstation2_k/King%27s%20Field%20-%20The%20Ancient%20City%20%28USA%29.zip","filesize":427358668,"score":6.7,"genres":"Action > Role-playing (RPG) > 1st-person > Fantasy","desc":"<p>Many years ago, a powerful talisman known as Idol of Sorrow turned the ancient Holy Land, the home of the Forest Folk, into the cursed Land of Disaster. The idol's evil powers once again awakened when the king of Heladin mistook it for a symbol of peace. One day, Prince Devian of Azalin Empire is visited by a mysterious stranger. The stranger hands him the Idol of Sorrow, and before long Devian realizes that he has been entrusted with the difficult task of taking the idol back to the Land of Disaster and finding a way to remove the curse.</p><p><em>The Ancient City</em> is a first-person action role-playing game and the fourth entry in the King's Field series. Its core gameplay mechanics are similar to those of the predecessors: the player must explore vast interconnected areas and fight hostile creatures and weapons and magic. There are four types of weapons in the game: swords, clubs, axes, and bows. Repeatedly attacking with the same weapon raises its level, eventually allowing more powerful attacks with it. Magic is handled in a similar way, with spells increasing in power and raising Devian's magic points when used. Weapons and armor slowly deteriorate, but a blacksmith can repair them. Like in the previous games, every NPC can be attacked and killed. As opposed to the predecessors, the protagonist can swim underwater for a limited amount of time.</p>"},{"name":"Kingdom Hearts","year":2002,"developer":"Square Co., Ltd.","url":"sony_playstation2_k/Kingdom%20Hearts%20%28Europe%2C%20Australia%29.zip","filesize":2198652112,"score":7.8,"genres":"Role-playing (RPG) > Behind view > Action RPG > Direct control > Fantasy > Licensed","desc":"<p>Sora's world is shattered when a violent storm hits his home, and he is separated from his two closest friends. The storm scatters the three to unknown worlds. At the same time, there is turmoil in the Disney Castle. King Mickey is missing, and Court Wizard Donald and Captain Goofy are out to find him. On their travels they meet Sora, on his own search for his lost friends. The three are told of ominous creatures called Heartless, being without hearts derived from an unknown dimension and are the ones responsible for the devastating storm. </p><p>The Disney villains, enticed by the power of darkness, manipulate the Darkness to help them gather the princesses of heart, who are needed to open a mysterious final door. Upon discovering the link between the Heartless, the storm, and the disappearance of King Mickey, Sora, Donald, and Goofy join forces and help familiar Disney heroes to save their worlds from the Heartless.</p><p>In <em>Kingdom Hearts</em> players step into the very large shoes of Sora, wielder of the keyblade. Sora can attack with the blade, and as he levels up he will gain more attacks that are automatically chained together. Sora can learn magic and put healing items into a quick menu, and both can only be used in real time. Donald and Goofy (as well as an additional character exclusive to each world/disney movie) will follow Sora. Their equipment and AI can be adjusted, but they can not be directly controlled. Defeated enemies will drop many kinds of items including synthesis materials. Sora can take these to the Synthesis shop in Twilight Town to turn them into usable items, accessories, and weapons.</p><p>Traveling between each world requires Sora's party to fly through space in a Gummi Ship. The Gummi Ship can be completely customized, from speed and armor to weapons and shape, out of parts picked up from destroyed Gummi Ships, found in worlds, or bought from a store. Larger, more complex ships can be built as the game progresses, and plans can be found from destroyed enemies or from an NPC that will automatically build a Gummi Ship of specific specifications.</p>"},{"name":"Kingdom Hearts II","year":2005,"developer":"Square Enix Co., Ltd.","url":"PS2_COLLECTION_PART12/Kingdom%20Hearts%20II%20%28Europe%2C%20Australia%29.zip","filesize":3179251222,"score":8.2,"genres":"Role-playing (RPG) > Behind view > Action RPG > Quick Time Events (QTEs) > Direct control > Fantasy","desc":"<p>Sora, Donald, and Goofy are back in the third installment (second for PS2) of the <em>Kingdom Hearts</em> series, continuing where Kingdom Hearts: Chain of Memories left off. The trio awakens from their sleep and goes to Twilight Town. When the game begins, you will first have control over a boy name Roxas who wields a dual-Keyblade. He is trying to enjoy the remainder of his summer vacation with his friends but he keeps having flash-backs of someone else's memories.</p><p>When he meets up with Sora, the two learns they have a special connection with one another. Afterwards, the group will continue their search for King Mickey and Riku. This time, they will travel to new worlds and work with various characters from the Disney and Final Fantasy universes. This includes worlds from not only Disney's animated movies but other movies as well like Pirates of the Caribbean and TRON.</p><p>In <em>Kingdom Hearts II</em>, Sora and his friends will battle various enemies including the Heartless from Kingdom Hearts, but also a group of enemies called Nobodies. Nobodies are \"nonexistent beings\" who are under the control of Organization XIII - a group of 13 members in black coats that Sora and his friends have reduced down to just half. </p><p>Gameplay is very similar to <em>Kingdom Hearts</em>: the player controls Sora with Donald and Goofy helping with their magic and attacks. Sora can use various magic powers as well as use Summon which will call upon the aid of special Disney characters that will temporarily fight alongside him. A new feature of combat are \"Reaction Commands\". Some enemies will leave themselves open during attacks, and if the player presses the Reaction Command button when prompted Sora will take advantage of the situation, either turning an enemy's attack against them, striking from a defenseless side for extra damage, or avoiding an otherwise unavoidable attack. As the trio levels up and progresses in the game they will gain new abilities that they can equip. Also, after Mickey meets the party, if Sora is KO'd the player will have the option of controlling Mickey and defending Sora until he can recover.</p><p>Another new feature is the Drive gauge. When filled and activated Sora absorbs the strength of his allies and gains new powers, like long range magical bullets in Magician form or the ability to use two keyblades in Strength form. Using Drive forms will power them up, unlocking new abilities and allowing them to be used for longer periods of time.</p><p>The Gummi Ship returns, but the speed of combat during Gummi Ship level has been greatly increased. While the path of the Gummi Ship is still out of the player's control, the ship can now attack enemies to the front, sides, and behind. Gummi Ship levels can be re-challenged at different difficulty levels, with different levels offering greater challenge and new enemy patterns. Achieving high scores in these levels rewards new Gummi Ship parts and plans.</p>"},{"name":"Kingdom Hearts II: Final Mix+","year":2007,"developer":"Square Enix Co., Ltd.","url":"sony_playstation2_k/Kingdom%20Hearts%20II%20-%20Final%20Mix%20%28Japan%29.zip","filesize":3493579080,"score":"","genres":"Action > Compilation > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Puzzle elements > Quick Time Events (QTEs) > Fantasy > Licensed","desc":"<p><em>Kingdom Hearts II: Final Mix+</em>, only released in Japanese territories, is a 2-disc set that includes <em>Kingdom Hearts II Final Mix</em> an updated re-release of the original Kingdom Hearts II and a 3D PS2 version remake of Kingdom Hearts: Chain of Memories called Kingdom Heart Re:Chain of Memories with extra scenes and voice-overs for particular scenes.</p><p><em>Kingdom Hearts II Final Mix</em> improvements include an English voice cast, tweaks in all difficulty modes and a new \"Serious Mode\" difficulty, new areas and redesigned navigation maps, new scenes from the Japanese Manga, new boss battles against the mysterious Organization XIII, one of the fights that was a cut-scene in the original is now playable, and all censored parts of the game are no longer censored.</p><p><em>Kingdom Hearts Re:Chain of Memories</em> improvements include: fully 3D render, Kingdom Hearts II reaction commands system, new cards and boss battles, all scenes now fully voiced in Japanese, and the game save data affects Kingdom Hearts II: Final Mix.</p>"},{"name":"Kingdom Hearts: Final Mix","year":2002,"developer":"Square Co., Ltd.","url":"sony_playstation2_k/Kingdom%20Hearts%20-%20Final%20Mix%20%28Japan%2C%20Asia%29.zip","filesize":2934083374,"score":"","genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Puzzle elements > Fantasy > Licensed","desc":"<p><em>Kingdom Hearts Final Mix</em> is an updated re-release of the original Kingdom Hearts for the Japanese territory only. It includes the additional content from the American/European version, along with various enhancements:</p><ul><li>The bosses Ice Titan, Kurt Zisa and Sephiroth, as well as the opportunity to fight one of the \"Unknowns\" featured in the secret ending at Hollow Bastion.</li><li>Various enemies now have a different colour and more HP.</li><li>New Heartless: NEO-Shadow (team attack). This one was originally only available in the secret ending \"Another Side, Another Story\", but can now be fought at a location. The others are Black Ballade, Sniper Wild, Chimera, Pink Agaricus, and Jet Balloon &amp; Missile Diver</li><li>Next to the original secret ending, a new one, entitled \"Deep Dive\", can now be unlocked.</li><li>New cutscenes and additional conversations further explaining the story.</li><li>Two new keyblades: One-Winged-Angel and Diamond Dust</li><li>While travelling between worlds, there are now missions for your Gummi Ship.</li><li>2 new Ansem Reports</li><li>11 new abilities for Sora: Slap Shot, Slide Dash, Stun Impact, Gravity Break, Ripple Drive, Hurricane Period, Zantetsuken, Leaf Veil, Tech Plus and Encounter Up</li><li>New music: the tracks \"Disappeared\" and \"Another Side\", as well as the English version of \"Night on Bald Mountain\" and \"One-Winged Angel\".</li><li>Other additions include two new difficulty levels, a new camera system, the English voice tracks with Japanese subtitles, some level design changes, a cut-scene skip feature, and a trailer for Final Fantasy X-2.</li></ul>"},{"name":"Kingdom Hearts: Final Mix (Limited Edition)","year":2002,"developer":"Square Co., Ltd.","url":"sony_playstation2_k/Kingdom%20Hearts%20-%20Final%20Mix%20%28Japan%29%20%28Platinum%20Limited%29.zip","filesize":2934083247,"score":"","genres":"Special edition > Physical extras","desc":"<p>This Japanese-only, limited edition comes in a box with the following:</p><ul><li>Kingdom Hearts: Final Mix</li><li>A set of stickers</li><li>An action figure of Sora</li><li>Three badges</li><li>Sketches of some of the main characters</li></ul>"},{"name":"Kingdom Hearts: Re:Chain of Memories","year":2008,"developer":"Square Enix Co., Ltd.","url":"sony_playstation2_k/Kingdom%20Hearts%20-%20Re-Chain%20of%20Memories%20%28USA%29.zip","filesize":4043936010,"score":7.2,"genres":"Role-playing (RPG) > Behind view > Action RPG > Direct control > Fantasy","desc":"<p><em>Kingdom Hearts: Re:Chain of Memories</em> is the PS2 remake of the GBA game Kingdom Hearts: Chain of Memories. It was initially released as a part of Kingdom Hearts II: Final Mix+ and only later made available as a standalone game.</p><p>The most important change is that the world and battles are now in full 3d, including voice acting and a full soundtrack. Basic gameplay elements such as the battle system based on cards remain identical, but with additions such as the Reaction Command from Kingdom Hearts II. There are also a number of new cutscenes and entirely new battles, such as the fight with Zexion in Reverse/Rebirth. Upon completing the game, all cutscenes can be viewed in chronological order in the Theater Mode.</p>"},{"name":"Kinnikuman: Muscle Grand Prix Max","year":2006,"developer":"AKI Corporation","url":"sony_playstation2_k/Kinnikuman%20-%20Muscle%20Grand%20Prix%20Max%20%28Japan%29.zip","filesize":848586903,"score":"","genres":"Action > Sports > 3rd-person (Other) > Anime / Manga > Fighting > Wrestling > Licensed","desc":"<p><em>Kinnikuman Muscle Grand Prix Max</em> put the Kinnikuman game series to a new level. Now, the game includes 33 characters from the anime (the highest to this point for a Kinnikuman game), including those who appear in the Second Generation (basically, the sons of the main characters). Also, the scenarios and its music themes will be easily recognizable for those who watched the anime series.</p><p>The movements of the characters are not a simulation of a real life wrestling fight, and in fact many characters do not even look human (you will find characters who are, literally, a \"W.C. man\", a \"spring man\", an Egyptian-looking guy with 6 arms, among other picturesque ones). The special attacks of these characters are a mix of acrobatic and very spectacular movements, just like in the anime cartoons. There is also a Tension Meter, which will indicate the ideal moment to execute a special attack.</p><p>In the game options you have the History Mode (classic mode in which the characters follow the plot of the anime, and also have conversations between them), the Versus Mode and the Stage Mode (mode where you will have to dispute fights with several kinds of added difficulties and handicaps).</p>"},{"name":"Kinnikuman: Muscle Grand Prix Max 2: Tokumori","year":2008,"developer":"syn Sophia, Inc.","url":"sony_playstation2_k/Kinnikuman%20-%20Muscle%20Grand%20Prix%202%20-%20Tokumori%20%28Japan%29.zip","filesize":960236970,"score":"","genres":"Action > Sports > 3rd-person (Other) > Anime / Manga > Fighting > Wrestling > Licensed","desc":"<p><em>Kinnikuman Muscle Grand Prix Max 2: Tokumori</em> is the sequel to  Kinnikuman Muscle Grand Prix Max. In this game the characters of the first title will be joined by 6 new fighters (Kinnikuman Super Phoenix, Kinnikuman Zebra, Kinnikuman Mariposa, Kinnikuman Big Body, Neptuneman and Big the Budou), thus making 39 in total. Also, there will be 3 new stages (Osaka Castle, Cube Ring and Fist of Heracles).</p><p>The game modes have several additions. Besides History, now there is Tournament, Practice, Collection and Special. Collection is a mode in which you can unlock picture galleries of the fighters by executing certain movements during a fight, and Special is a mode in which you can play two early games based in the Kinnikuman universe:  M.U.S.C.L.E. of the NES and  Kinnikuman: Kinnikusei Oui Soudatsusen of the Famicom Disk System.</p>"},{"name":"Kira Kira: Rock 'n' Roll Show","year":2009,"developer":"Overdrive","url":"sony_playstation2_k/Kira%20Kira%20-%20Rock%20%27N%27%20Roll%20Show%20%28Japan%29%20%28Shokai%20Genteiban%29.zip","filesize":1717317569,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Originally released as an adult visual novel for PC (Windows) under title Kira Kira, which once ported to PlayStation 2 removed the adult content and added <em>Rock 'n' Roll Show</em> subtitle. The PS2 release also includes additional characters and story elements to complement removal of adult scenes. The story revolves around Shikanosuke Maejima (前島 鹿之助), a student at Oubi Academy, who one day teams up with Kirari Shiino (椎野 きらり) and forms a rock band. The school festival is approaching, and they are determined to perform live.</p><p>The game doesn't use typical dialogue boxes, but instead displays the text and dialogues over the full, slightly dimmed, background image. For clear background picture, the dialogue text and dimmed effect can be toggled on and off. Depending on player's choices, the game will reach one of several different endings, as well as affect the ending song. Character animation is non-present, only different poses and facial expressions depict character's disposition, and the CG events are also present to more vividly emphasize certain key moments in the story. Voice-acting is fully present for non-playable characters during dialogues.</p>"},{"name":"Kirikou and the Wild Beasts","year":2007,"developer":"Wizarbox SARL","url":"sony_playstation2_k/Kirikou%20and%20the%20Wild%20Beasts%20%28France%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1483561371,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>Adapted from the famous movie by Michel Ocelot and Benedict Galup, Kirikou and the Wild Beasts puts you in the shoes of a hero who must face the dangers hanging over his people. Jump from platform to platform to protect the village from the wild animals of the savannah. But beware, Karaba the witch is never far away …</p>"},{"name":"Kishin Hōkō Demonbane","year":2004,"developer":"","url":"sony_playstation2_k/Kishin%20Houkou%20Demonbane%20%28Japan%29.zip","filesize":3641617962,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited-edition package of Kishin Hōkō Demonbane includes the game along with an Etheldreda scale statue made by Volks, a <em>Demonbane</em> anime OVA DVD, and a telephone card.</p>"},{"name":"Kishin Hōkō Demonbane (DX Pack)","year":2004,"developer":"Nitroplus Co., Ltd.","url":"sony_playstation2_k/Kishin%20Houkou%20Demonbane%20%28Japan%29%20%28DX%20Pack%29.zip","filesize":3641617302,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited-edition package of Kishin Hōkō Demonbane includes the game along with a <em>Demonbane</em> anime OVA DVD, a <em>Nitro+ Special DVD Video</em>, a 48-page artbook containing black &amp; white production sketches from the game's development, and a set of character business cards.</p>"},{"name":"Klonoa 2: Lunatea's Veil","year":2001,"developer":"Namco Limited","url":"PS2_COLLECTION_PART13/Klonoa%202%20-%20Lunatea%27s%20Veil%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1827921594,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Klonoa, our floppy-eared hero, along with his two newly found buddies, Lolo and Popka, have to foil a sinister force which is causing a mire of gloom to plague the land of Lunatea. By ringing the four bells across the land, Klonoa can restore harmony, but the Sky Pirate Leorina is in hot pursuit, after Klonoa's magic ring...</p><p><em>Klonoa 2: Lunatea's Veil</em> is a 3D side-scrolling platformer. The main goal of the game is to get to the end of each level (or 'Vision'), but there are also special goals to achieve. Firstly, each Vision contains six Momett Dolls hidden in each level. Secondly, there are Dream Stones scattered throughout each level - green ones are worth one, while blue ones are worth five. Certain puzzles also contain tricky use of the \"Dream Spirit\", which doubles the value of all collected Dream Stones. New to <em>Klonoa 2</em> are hoverboard sections, which play at a faster, more action-oriented pace.</p><p>But what makes Klonoa unique is his abilities. Klonoa can shoot a 'wind bullet' into foes, which puffs them up and allows Klonoa to carry them. Klonoa can then launch them straight at foes, or jump with them, giving him an extra boost. If he needs extra length to his jump, holding the jump button will allow him to hover for a little longer, too. Different enemies have different effects - for example, certain foes have propellers on their heads and will rocket you into the sky, while others will act like time bombs and explode after a short while.</p>"},{"name":"Knight Rider 2: The Game","year":2004,"developer":"Media Design Group","url":"PS2_COLLECTION_PART13/Knight%20Rider%202%20-%20The%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":443908413,"score":5.1,"genres":"Racing / Driving > Behind view > Puzzle elements > Shooter > Licensed","desc":"<p>In the sequel to Knight Rider: The Game, Michael and KITT are targeted by a missile attack while driving back to the foundation. They barely survive and set up a meeting with the base. On their way home however, they notice unusual black marks in demolished villages, and decide to investigate.</p><p>All missions have the player control KITT, who has now been equipped with three weapons: a lock-on laser, a plasma gun, and missiles. There is also turbo boost to jump over obstacles, micro jam to scan items and recharge, the ski mode to drive on two wheels through narrow passages, super pursuit mode for faster speed, and a shield to block incoming attacks. When damaged or running low on energy, certain functions are disabled.</p><p>The different missions are linked by sequences where the story is further explained using the in-game engine. Many familiar characters from the tv series make an appearance, such as Bonnie, Devon, Garth and KARR. Missions either focus on racing or exploration. In the first type, the player mainly evades attacks while racing on a highway. The latter has the player drive inside closed areas, maneuvering through passages and fighting robots. There are also a few puzzle elements where the player has to locate terminals, shoot an object in the environment, or find enemies' weaknesses. When a stunt is performed, the action slows down and the camera switches to a spectacular angle.</p><p>Next to the main story mode, the individual missions can be replayed in the mission mode. The player can also unlock TV scenes, view background information about the series, or do a quiz.</p>"},{"name":"Knight Rider: The Game","year":2002,"developer":"Davilex Games B.V.","url":"PS2_COLLECTION_PART13/Knight%20Rider%20-%20The%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.zip","filesize":423809471,"score":5.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Detective / mystery > Spy / espionage > Licensed","desc":"<p>This is a game based on the famous TV series <em>Knight Rider</em> starring David Hasselhoff, which aired from 1982 to 1986 in the US.</p><p>In the game, the player takes control over the <em>Knight Industries Two Thousand</em>, better known as KITT, a high-tech, fully computerised car. Together with Michael Knight, you have to fight crime in 10 missions and 15 races.</p><p>Many original ideas from the TV series have been included in the game. KITT, Michael, Bonnie and Devon are all in the game, as are the evil Garth and KARR. The player can also use various original functions of the car, like Turbo Boost, Super Pursuit Mode, Ski Mode or the famous Scanner, whose sound everyone should recognise.</p><p>The game can only be played in campaign mode, where KITT and Michael have to solve a mysterious case, starting out as a simple bank robbery.</p>"},{"name":"Knights of the Temple II","year":2005,"developer":"Cauldron Ltd.","url":"PS2_COLLECTION_PART13/Knights%20of%20the%20Temple%20II%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":988769287,"score":6.5,"genres":"Action > Role-playing (RPG) > 1st-person > 3rd-person (Other) > Fantasy","desc":"<p>In <em>Knights of the Temple II</em>, you again play the role of a Templar knight: Paul de Raque, the grandmaster of the Order of the Temple. The game is set in medieval 13th century Europe and the Middle East. The story revolves around the new crusade of our hero to recover 3 ancient pagan artifacts essential to prevent the imminent attack of the demon armies into our realm of existence.</p><p>It is a 3D 3rd-person action game with RPG elements. Gameplay consists of completing quests through travelling in the various locations in the game or battling your way through enemy men and monsters.</p><p>The storyline for one is non-linear. At the start of the game you can choose 1 out of 3 locations to visit. Advancing in the game will unlock new locations. Each location is either a city or town where you can advance in the primary mission, obtain sub-quests, trade, meet people, etc. or it could be a dungeon type location crawling with monsters. Often its a little combination of both.</p><p>Most of the gameplay (when not exploring cities) revolve around combat and character development. Combat consists of 3D 3rd Person Perspective point of view where you can attack enemies using various skills, abilities and attack combo's. Each of which can be upgraded at any point of the game by spending experience points to the pointed skill, ability or combo.</p><p>On character development, there are 3 major areas that may be upgraded: (1) Knightly Abilities; Spiritually oriented gifts of the Templar knight: from healing to other holy abilities. (2) Skill Abilities; These are usually attack-based skills. Various attacking styles to soften and defeat both men and monster. (3) Combo's. The extension of the \"attack button\". Upgrading the combo section provides additional attack moves.</p><p>Combat also is uniquely divided into 3 different weapons. The first is the standard Sword and Shield, providing high defense and standard attack, useful in defensive stances and vs. ranged enemies; The second is the 2-handed weapon, primary for direct damage in close-combat against single or multiple enemies; The third is ranged combat using a crossbow. The perspective in ranged combat diverts to 1st person perspective (though you can still see your head). </p><p>During the course of the game, you can obtain additional weapons and armor (as well as other items), either from the course of a sub-quest or purchasing it from a local trader.</p>"},{"name":"Knights of the Temple: Infernal Crusade","year":2004,"developer":"Starbreeze Studios AB","url":"PS2_COLLECTION_PART13/Knights%20of%20the%20Temple%20-%20Infernal%20Crusade%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":2625519865,"score":6.6,"genres":"Action > 1st-person > 3rd-person (Other) > Hack and slash > Europe > Fantasy > Medieval > Middle East","desc":"<p><em>Knights of the Temple</em> is a dynamic camera third-person hack and slash game set in medieval times.</p><p>You take the role of Paul, a fresh-baked Templar knight on his first Crusade, to stop the end of the world. Fighting your way through the somber gloom of European monasteries and villages to the colourful bazaars and powerful bastions of the crusader castles under the blazing sun of the Holy Land. Even enter the realms of hell and face your worst nightmares. </p><p>As the game progresses, Paul gains new sword combos and even divine powers enabling him to heal himself, conjure up a divine shield around himself and even shoot off homing fireballs that seek out his enemies.</p>"},{"name":"Knockout Kings 2001","year":2001,"developer":"Black Ops Entertainment, LLC","url":"PS2_COLLECTION_PART13/Knockout%20Kings%202001%20%28Europe%29.zip","filesize":562406649,"score":7.4,"genres":"Sports > Boxing > Licensed","desc":"<p>Fight as your favorite boxers including Sugar Ray Lewis, Muhammad Ali, Lennox Lewis, Oscar De La Hoya and plenty more past winners and current champions. There's also plenty of things to do, including a straight up arcade game (so you can beat your mates to the punch!) and a career mode, where you can take your chosen player from the rookie list to the world stage, all in one day.</p>"},{"name":"Knockout Kings 2002","year":2002,"developer":"Black Ops Entertainment, LLC","url":"PS2_COLLECTION_PART13/Knockout%20Kings%202002%20%28Europe%29.zip","filesize":633568628,"score":7.6,"genres":"Sports > 3rd-person (Other) > Boxing","desc":"<p>Knockout Kings 2002 is a boxing game brought to you EA Sports.</p><p>You can choose to fight as a bunch of different real life boxers, such as Muhammad Ali, Evander Holyfield, Trinidad, Lewis and De La Hoya, or you can create a custom boxer and play through a career mode.</p><p>In addition to Career, you can play in Exhibition or Tournament mode.</p><p>KK2002 features an improved control scheme which results in faster and more accurate control.</p><p>KK2002 features Judge Mills Lane, the judge of the daytime TV court show of the same name, as one of the referees.</p>"},{"name":"KO King","year":2006,"developer":""},{"name":"KOF: Maximum Impact","year":2004,"developer":"Noise Factory Co., Ltd.","url":"sony_playstation2_k/KOF%20-%20Maximum%20Impact%20%28USA%29.zip","filesize":1151100936,"score":7,"genres":"Action > 3rd-person (Other) > Fighting","desc":"<p>The Addis gang, which has long controlled Southtown, has been struck a major blow. Their leader, Fate, has been killed by Duke, leader of the newfound Mephistopheles gang. The subsequent warfare between the two gangs has decimated Southtown. In the midst of all this chaos, a new fighting tournament has begun, with claims that it is being sponsored by the Metatron Foundation charity. Twenty fighters step up to the challenge.</p><p>KOF: Maximum Impact - Maniax is the first 3D iteration of the venerable King of Fighters series. The game features fourteen returning characters:</p><ul><li>Athena Asamiya</li><li>Clark Steel</li><li>Iori Yagami</li><li>K'</li><li>Kyo Kusanagi</li><li>Leona Heidern</li><li>Mai Shiranui</li><li>Maxima</li><li>Ralf Jones</li><li>Rock Howard</li><li>Ryo Sakazaki</li><li>Seth</li><li>Terry Bogard</li><li>Yuri Sakazaki</li></ul><p>Six new combatants are also available:</p><ul><li>Alba Meira</li><li>Chae Lim</li><li>Duke</li><li>Lien Neville</li><li>Mignon Beart</li><li>Soiree Meira</li></ul><p>Maximum Impact also features four distinct modes of play:</p><ul><li><strong>Story Mode -</strong> Choose a fighter and guide them through a series of fights in the tournament.</li><li><strong>Versus Mode -</strong> Face off against an opponent in a 1-vs-1 or 3-vs-3 team match.</li><li><strong>Mission Mode -</strong> Go through a series of missions with unique setups and goals in an attempt to unlock additional game features.</li><li><strong>Time Attack Mode -</strong> Face the clock as you race to defeat a string of opponents.</li></ul><p>Online multiplayer over Xbox Live includes head-to-head fighting, re-match (instantaneously battle your opponent again and again) and a tournament mode. There are also four different jump attacks per character and a new sideways move. During gameplay, you can pause the game and take photographs from all angles with the stop action camera. You can review all aspects of the characters in the profile mode, and you can even choose between English and Japanese language in each battle. </p><p>As an added bonus the PS2 version includes a bonus dvd with making-of videos and behind the scenes interviews.</p>"},{"name":"KOF: Maximum Impact Regulation A","year":2007,"developer":"SNK Playmore Corporation","url":"sony_playstation2_k/KOF%20-%20Maximum%20Impact%20Regulation%20A%20%28Japan%29.zip","filesize":882978574,"score":"","genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p><em>KOF: Maximum Impact Regulation \"A\"</em> is a rebalanced version of The King of Fighters 2006 originally meant for competitive arcade play. Four new characters make an appearance: Ash Crimson, Blue Mary, Mizoguchi, and original character Xiaolon.</p><p>Most of the single-player modes from the original game have been stripped out, and the focus is now on versus play. Gone are the story and mission modes, as well as the unlockable extra costumes. All the available costumes and characters are available from the beginning.</p>"},{"name":"Kokoro no Tobira","year":2004,"developer":"","url":"sony_playstation2_k/Kokoro%20no%20Tobira%20%28Japan%29.zip","filesize":635183111,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>When you were a child, your younger sister was hospitalized and, while she was sick, she asked you to create your picture book for her. Time has passed since, you're both in school, her illness is gone, and the graduation is nearing. While everybody is thinking about the future, your plans are aimlessly vague at best. One day, she brings your picture book to school and asks you to continue it, and not to forget your dreams from childhood days.</p><p><em>Kokoro no Tobira</em> is PlayStation 2 is a port of the Windows version named Manatsu no Tobira: Kimi to Tsudzuru Monogatari. The PlayStation 2 port features additional scenario, full voice-acting, opening movie and new song. This visual novel adventure system offers nothing new and can be compared to any other visual novel adventure game. The route can occasionally be altered by selecting a different action when the choice occurs on the screen.</p>"},{"name":"Konami Kids Playground: Alphabet Circus","year":2007,"developer":"ImaginEngine","url":"sony_playstation2_k/Konami%20Kids%20Playground%20-%20Alphabet%20Circus%20%28USA%29.zip","filesize":102922285,"score":"","genres":"Action > Educational > Mini-games > Pre-school / toddler > Reading / writing","desc":"<p>Recommended for ages 2-5</p><p>An Active New Way to Learn and Play</p><p>Konami Kids Playground is an innovative new series of PlayStation®2 computer entertainment system games that turns learning into a fun, full-body activity for your preschooler. Kids will love to jump, stomp and learn their way through each of these fun and educational games!</p><p>ALPHABET CIRCUS</p><p>Join Chico the Clown, Fred the Monkey and Ethyl the Elephant in twelve foot-stomping activities that make the ABCs come to life. * Channel your child's energy into a fun way to learn! * Learn to recognize the ABCs and to read simple words * 12 mini-games for hours of fun and exercise * Varying levels of difficulty to challenge different ages * Also works with Konami's DDR Controller</p>"},{"name":"Konami Kids Playground: Dinosaurs - Shapes & Colors","year":2007,"developer":"ImaginEngine","url":"sony_playstation2_k/Konami%20Kids%20Playground%20-%20Dinosaurs%20-%20Shapes%20%26%20Colors%20%28USA%29.zip","filesize":81926784,"score":"","genres":"Action > Educational > Mini-games > Pre-school / toddler > Prehistoric","desc":"<p>Recommended for ages 2-5</p><p>An Active New Way to Learn and Play</p><p>Konami Kids Playground is an innovative new series of PlayStation®2 computer entertainment system games that turns learning into a fun, full-body activity for your preschooler. Kids will love to jump, stomp and learn their way through each of these fun and educational games!</p><p>DINOSAURS SHAPES & COLORS</p><p>Kids will have hours of fun exploring the age of giant reptiles as they play through twelve foot-stomping activities that make shapes and colors come to life. * Channel your child's energy into a fun way to learn! * Learn shapes and colors while exploring the prehistoric world * 12 mini-games for hours of fun and exercise * Varying levels of difficulty to challenge different ages * Also works with Konami's DDR Controller</p><p>Works with controller mat (sold separately)</p>"},{"name":"Konami Kids Playground: Frogger - Hop, Skip & Jumpin' Fun","year":2007,"developer":"ImaginEngine","url":"sony_playstation2_k/Konami%20Kids%20Playground%20-%20Frogger%20-%20Hop%2C%20Skip%20%26%20Jumpin%27%20Fun%20%28USA%29.zip","filesize":107134897,"score":"","genres":"Action > Educational > Mini-games > Pre-school / toddler","desc":"<p>Recommended for ages 2-5</p><p>An Active New Way to Learn and Play</p><p>Konami Kids Playground is an innovative new series of PlayStation®2 computer entertainment system games that turns learning into a fun, full-body activity for your preschooler. Kids will love to jump, stomp and learn their way through each of these fun and educational games!</p><p>FROGGER - HOP, SKIP & JUMPIN' FUN</p><p>Join Frogger and Lily in a dozen foot-stomping activities designed to keep young players on their toes for hours. * Channel your child's energy into a fun way to learn! * Intro to the series improves overall coordination * 12 mini-games for hours of fun and exercise * Varying levels of difficulty to challenge different ages * Also works with Konami's DDR Controller</p><p>Works with controller mat (sold separately)</p>"},{"name":"Konami Kids Playground: Toy Pals - Fun with Numbers","year":2007,"developer":"ImaginEngine","url":"sony_playstation2_k/Konami%20Kids%20Playground%20-%20Toy%20Pals%20Fun%20with%20Numbers%20%28USA%29.zip","filesize":98064654,"score":"","genres":"Action > Educational > Mini-games > Math / logic > Pre-school / toddler","desc":"<p>Recommended for ages 2-5</p><p>An Active New Way to Learn and Play</p><p>Konami Kids Playground is an innovative new series of PlayStation®2 computer entertainment system games that turns learning into a fun, full-body activity for your preschooler. Kids will love to jump, stomp and learn their way through each of these fun and educational games!</p><p>TOY PALS - FUN WITH NUMBERS</p><p>Kids will delight in the colorful world of Scratch the Cat, Sniff the Dog and Stan the Bear as they learn to count in these twelve foot-stomping activities that make numbers come to life.. * Channel your child's energy into a fun way to learn! * Learn numbers and counting with endearing toy pals * 12 mini-games for hours of fun and exercise * Varying levels of difficulty to challenge different ages * Also works with Konami's DDR Controller</p><p>Works with controller mat (sold separately)</p>"},{"name":"Kono Aozora ni Yakusoku wo: Melody of the Sun and Sea","year":2007,"developer":"GIGA","url":"sony_playstation2_k/Kono%20Aozora%20ni%20Yakusoku%20o%20-%20Melody%20of%20the%20Sun%20and%20Sea%20%28Japan%29.zip","filesize":4187908016,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Kono Aozora ni Yakusoku wo: Melody of the Sun and Sea</em> is a non-adult PlayStation 2 port of an adult visual novel Kono Aozora ni Yakusoku wo that originated on PC (Windows). All the adult scenes from the original game version have been removed, but to compensate for that, the PlayStation 2 version came with lots of upgrades and additions.</p><p>Main additions and improvements in this PS2 release include:</p><ul><li>main scenario and story revised to fit the lack of old and inclusion of new CG events</li><li>lots of new CGs created for the revised scenario, and made by the same character designer</li><li>eye-blinking animations and lip-sync animations added to characters</li><li>new opening movie song added, \"Chiisana Brilliant\" (小さなブリリアント)</li><li>existing \"Taiyou to Umi no Melody\" (太陽と海のメロディ) BGM made into vocal song</li><li>new opening movie added</li><li>added number of playable short stories after finishing the game's main scenario</li><li>added Back Log Load feature which lets you replay missed part of the story</li></ul>"},{"name":"Kono Hareta Sora no Shita de","year":2005,"developer":"Cromwell Inc.","url":"sony_playstation2_k/Kono%20Hareta%20Sora%20no%20Shita%20de%20-%20Under%20the%20Blue%20Sky%20%28Japan%29.zip","filesize":1527807877,"score":"","genres":"Adventure > 3rd-person (Other) > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p>In the near future, atmospheric damage has raised radiation and ultraviolet levels on Earth to dangerous levels, forcing humanity to only venture outside during the night hours. Artificial lifeforms called \"Mimics\", which look and act much like humans, now perform daytime work of many kinds. Though the use of Mimics is highly regulated, they are believed to be highly safe and reliable, but following an apparent Mimic suicide, a government investigation is launched at Biowell Corporation, the creators of the Mimics. Is there something sinister lurking within Biowell, and within the Mimics themselves?</p><p><em>Kono Hareta Sora no Shita de</em> (\"Under the Blue Sky\") is a Japanese-style sci-fi visual novel. The player takes the part of insurance investigator Reiichi Kuroha, who along with his partner and a representative from Biowell, must investigate the circumstances surrounding the mysterious Mimic suicide. The game consists primarily of written text with accompanying still images, and there are occasional choices that will cause the story to branch.</p>"},{"name":"Konohana 2: Todokanai Requiem","year":2002,"developer":"VRIDGE Inc.","url":"sony_playstation2_k/Konohana%202%20-%20Todokanai%20Requiem%20%28Japan%29.zip","filesize":624198830,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Detective / mystery","desc":"<p>Meguru Momoi, a second-year student at Konohana high-school returns in another murder mystery adventure. He gained status of recognition after the infamous Grim Reaper murder mystery in the original game. Everything's back to normal, or so everybody thought, until one morning on their way to school, Meguru Momoi and his partner, Miako Tachibana, arrive only to see police cordoning the area of what appears to be a murder case. Thus they end up entangled in yet another series of murders case.</p><p>This murder mystery adventure game plays as a typical visual novel with ability to view past dialogues, fast skip through them or use auto-play feature. There are many choices throughout the game which eventually yield several different endings. Extras section of the main menu contains BGM player and unlockable album gallery containing event scenes from the game.</p>"},{"name":"Konohana 3: Itsuwari no Kage no Mukou ni","year":2003,"developer":"VRIDGE Inc.","url":"sony_playstation2_k/Konohana%203%20-%20Itsuwari%20no%20Kage%20no%20Mukou%20ni%20%28Japan%29.zip","filesize":593084403,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Detective / mystery","desc":"<p>Meguru Momoi and Miako Tachibana are back in their third murder-mystery adventure game, <em>Itsuwari no Kage no Mukou ni</em> (Eng. \"Beyond the Shadow of Lies\"). The story picks up lightly with Meguru and Miako bickering about. After some computer chatting, Miako arranged to go with Meguru and Shinobu to a Water Island amusement park. There, they would also meet up with some other friends and acquaintances. Time went by as they were checking all kinds of interesting places at the amusement park, until they entered the house of horror attraction. One of the people among them was found killed in a haunted house and everyone's a suspect. It is up to Meguru and Miako to once again put their minds to the task of solving the murder mystery and finding the culprit.</p><p>As with previous games in the series, <em>Konohana 3</em> also comes with multiple endings, lots of choices during dialogues, and unlockable gallery of CG events. The game also includes a couple of character collectable cards similar to those that previous games included.</p>"},{"name":"Konohana 4: Yami o Harau Inori","year":2004,"developer":"VRIDGE Inc."},{"name":"Konohana Pack: 3tsu no Jikenbo","year":2004,"developer":"VRIDGE Inc."},{"name":"Kouenji Joshi Soccer","year":2006,"developer":"","url":"sony_playstation2_k/Kouenji%20Joshi%20Soccer%20%28Japan%29.zip","filesize":1674935450,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition release includes:</p><ul><li>Kōenji Joshi Soccer game</li><li>Original soundtrack</li><li>Kōenji Joshi campus student notepad</li></ul>"},{"name":"Kowloon Youma Gakuenki","year":2004,"developer":"Shout!Designworks Co., Ltd.","url":"sony_playstation2_k/Kowloon%20Youma%20Gakuenki%20%28Japan%29%20%28Deluxe%20Pack%29.zip","filesize":957869213,"score":"","genres":"Adventure > Puzzle > Role-playing (RPG) > 1st-person","desc":"<p>The year is 2004, and you play the role of an exchange student who arrives at the Kamiyoshi School in Shinjuku District in Tokyo. In fact, although you came there to study, you are more interested in another activity - treasure hunting! That is precisely what you do when you have time - descend into ancient ruins and unravel their mysteries. But it seems you came to the right place. The place on which the school building stands is surrounded by legends, and soon you find a secret passage that leads to ruins... but of course, you'll need the co-operation of your schoolmates to have success!</p><p><em>Kowloon Yōma Gakuen Ki</em> (which can be translated as <em>Chronicles of Kowloon Demon School</em>) is a hybrid game that has elements of various genres - most notably RPG, Japanese and Western-style adventure. The entire game is viewed from a first-person perspective. Moving through 3D dungeons, you can examine and manipulate items, which is required to solve puzzles, in a Western adventure fashion. The Japanese-style adventure element is notable in conversations with the characters, which follow the pattern of a <em>dating simulation</em> - your responses influence your relationship with characters. In dungeons there are also enemies to fight. The battles are strategic, resembling those of  Fallout. You move your party through the room in a turn-based fashion; each move costs you AP. Once the enemy is within range, you can perform a variety of attacks and special techniques.</p>"},{"name":"Kuma Uta","year":2003,"developer":"MuuMuu Co., Ltd.","url":"sony_playstation2_k/Kuma%20Uta%20%28Japan%29%20%28v2.01%29.zip","filesize":227644227,"score":"","genres":"Simulation > 3rd-person (Other) > Side view > Anime / Manga > Music / rhythm","desc":"<p>In <em>Kuma Uta</em> (literally \"Bear Song\"), a polar bear from outer space lands on earth, and the player must write music for him to sing. The bear asks the player multiple questions, and comes up with lyrics based on the answers. The song that he composed can then be edited by choosing the lyrics among a selection of phrases. The bear then sings the song in enka, a traditional Japanese type of singing.</p><p>Songs may be downloaded from the net, or composed by the player in kana, kanji, and romaji. The composed songs can be shared with friends over the PlayStation 22 Network.</p>"},{"name":"Kung Fu Panda","year":2008,"developer":"XPEC Entertainment Inc."},{"name":"Kuon","year":2004,"developer":"FromSoftware, Inc.","url":"PS2_COLLECTION_PART13/Kuon%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1664573186,"score":6.4,"genres":"Action > 3rd-person (Other) > Puzzle elements > Survival horror > Fantasy > Japan (Ancient/Classical/Medieval)","desc":"<p><em>Kuon</em> is a horror game set in Heian period (12th century) in Japan. The player controls three protagonists in the game. The story revolves around a man named Doman, an exorcist who was summoned by one of the noblemen to investigate a cursed manor. His daughter Utsuki is out to search for him when he doesn't return, and her sister is charmed by demons inhabiting a mysterious castle, turning into a demon herself. A young girl named Sakuya, Doman's disciple, also ventures into the depths of the demonic world, to prove herself worthy of her master. Once the player completes Utsuki's and Sakuya's scenarios, he unlocks the third scenario where he experiences the story from the point of view of Doman himself.</p><p>The game is a mixture of third-person action and puzzle-solving. As in all survival horror games, the player's means of defense are limited and scarce. Unlike most games of the kind, physical attacks with weapons are not the player's only way to defend themselves against hordes of undead creatures. The player can also learn and cast spells in the game, and even summon creatures (wolves, spiders, etc.) to fight at their side.</p>"},{"name":"Kya: Dark Lineage","year":2003,"developer":"Eden Games S.A.S.","url":"PS2_COLLECTION_PART13/Kya%20-%20Dark%20Lineage%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2282696883,"score":7.3,"genres":"Action > 3rd-person (Other) > Arcade > Platform > Puzzle elements","desc":"<p>Kya and her brother Frank have been transported into a different dimension, and upon arriving are separated! Kya meets (and is saved by) the native creatures of this world (known as the Nativs), however Frank is captured by a dangerous enemy known as the Wolfens under the rule of Brazul. To make matters worse, Kya learns that the Wolfens are actually the peaceful Nativs which have been captured and transformed, and Brazul is actually her long lost father! Kya must now embark on a quest to rescue her brother as well as find a way to restore the Wolfen to their Nativ form and defeat Brazul.</p><p><em>Kya: Dark Lineage</em> is an action adventure game. You control Kya and need to explore the colorful world she's arrived in. This strange world consists of various floating islands with many tunnels, platforms, dangerous life forms, and other obstacles. Powerful winds blow around many areas, and you'll often need to use the winds to your advantage by floating in them through tunnels, over gaps or slowing your descent in a free fall. There is some puzzle solving as well; you'll need to locate objects to use, hop on various platforms, buy items in the Nativ city, and more to reach new areas.</p><p>You'll also need to fight often, as the Wolfen are numerous and can found guarding many areas you need to get through. You can fight with your fists as well as items that can be acquired (such as various boomies, or boomerangs, and fighting bracelets). After defeating a Wolfen, you can use a magic spell to transform it back to its Nativ form which will then return back to the Nativ city. Upon returning to the city, many of the Nativs will then open up a shop; as new shops are opened, you will have the opportunity to buy new items and power ups to help on your quest. Alternatively, some Nativs may instead build a challenge in the city instead of opening a shop. You can earn money by betting and completing challenge objectives (or you can simply practice a challenge).</p><p>As you progress through the game, the story will unfold until you are (hopefully) successful in your quest!</p>"}]