[{"name":"L.A. Rush","year":2005,"developer":"The Pitbull Syndicate Limited","url":"PS2_COLLECTION_PART13/L.A.%20Rush%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2630525744,"score":6.1,"genres":"Racing / Driving > Behind view > Automobile > Street racing","desc":"<p>You are Trikz, a well-known street racer who lives the good life: A fat crib, lots of money, and an impressive collection of pimped-out rides. However, your arch-enemy Lidel, fuming with envy, uses his connections to take all that away from you. Your cash? Your place? Your beloved cars? All gone.</p><p>You are now set on getting it all back from Lidel, and, while you're at it, stealing his girl's heart too. You begin your mission at the bottom with some punk-ass car, winning back money and cars race by race. There are many kinds of races, like Endurance Races, Stunt Races, Cross-town Races, and many more.</p><p>As the name suggests, the game is set on the streets of Los Angeles, which is filled with traffic and cops that stand in your way to fame and fortune. Being set in the street racer scene, the game also offers lots of possibilities to pimp out our cars (through a tie-in with West Coast Custom), and the game's soundtrack is full with (edited, T-rated) hip-hop.</p>"},{"name":"La Pucelle: Tactics","year":2002,"developer":"Nippon Ichi Software, Inc.","url":"PS2_COLLECTION_PART13/La%20Pucelle%20-%20Tactics%20%28Europe%29.zip","filesize":418269358,"score":8,"genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p>Prier and her brother Culotte are novices with the demon-hunting organization, La Pucelle.  They've just passed their final exams and are ready to do real work fighting demons and zombies, but quickly find themselves embroiled in a series of plots orchestrated by a rival church with dark intentions.  The gameplay is played on a tactical map, as teams up to six characters work to clear boards of enemies and dark energy.  The unique \"purify\" command allows players to recruit monsters to their team and execute complex \"miracle\" energy attacks.</p>"},{"name":"Lake Masters Ex","year":2002,"developer":"Dazz Interactive","url":"PS2_COLLECTION_PART13/Lake%20Masters%20EX%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":71259102,"score":"","genres":"Sports > 3rd-person (Other) > Fishing","desc":"<p><em>Lake Masters EX</em> is a single player, bass fishing game.</p><p>The player competes in tournaments over the course of a season and gains points by winning or at least finishing in the rankings. As well as winning trophies the player unlocks additional kit such as new lures and with enough points they can eventually unlock, and later upgrade, their own private lake.  </p><p>In all there are twenty-four tournaments spread over three lakes, there are no tournaments on the private lake. As well as the tournament mode there's also a free fishing mode where the player can fish any of the lakes in the game.</p>"},{"name":"Langrisser III","year":2005,"developer":"NCS Corporation","url":"sony_playstation2_l/Langrisser%20III%20%28Japan%29.zip","filesize":435436101,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>This is a prequel to the two Langrisser games (the first one is known in the US as Warsong). The events of the third game occur thousand years before those described in the first \"Langrisser\". The story centers around the creation of a holy sword named <em>Langrisser</em>, and the first Descendants of Light, the only people who can wield it. The main character is the knight Diharuto, the ancestor of Leon (Elwin's rival in \"Langrisser II\"). He must defeat the evil Boser, who is bound to the evil sword Alhazzard.</p><p>In <em>Langrisser III</em>, you don't control whole armies, but only their generals, whom you move around the battle field. Once two enemy generals meet each other, a 3D battle sequence occurs, during which the two armies fight; the outcome of the battle is decided only by the victory or defeat of the general. The game also features <em>love simulation</em> elements: depending on the main hero's responses to various female characters, you can raise their \"love level\".</p>"},{"name":"Lara Croft: Tomb Raider - Anniversary","year":2007,"developer":"Buzz Monkey Software, LLC","url":"PS2_COLLECTION_PART13/Lara%20Croft%20Tomb%20Raider%20-%20Anniversary%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2740981669,"score":8,"genres":"Action > Behind view > Platform > Puzzle elements > Quick Time Events (QTEs) > Direct control > Africa > Europe > South America","desc":"<p><em>Lara Croft Tomb Raider: Anniversary</em> is a remake of the original Tomb Raider with a technically more advanced graphics engine. It has the same basic storyline, though some cutscenes and much of the dialogue within have been expanded or modified in other ways. Locations correspond to those of the original version and are accessed in the same order, but have been re-designed with different layouts and mostly completely different puzzles which allow implementation of new moves introduced in Lara Croft Tomb Raider: Legend: swinging on ropes and using a grappling hook at specific points.</p><p>Puzzles are generally more focused on acrobatics in this version, ledges being much more prominently featured as a level design element, requiring combinations of jumping and shimmying across them to access areas. This type of gameplay replaces the key-retrieval and block-pushing puzzles of the original almost entirely. Combat is similar to that of the first game, though the player must now manually activate targeting. Some boss fights have been made a separate enclosed stage rather than being part of the exploration as in the original version. These fights may have puzzle-solving elements and often require the player to use Lara's new \"adrenaline dodge\" ability, which slightly slows down time when the opponent charges at her while in an \"enraged\" state. Some cutscenes require the player to participate in quick-time events.</p><p>The version released for the Wii incorporates motion controls and also features some puzzles exclusive to that platform.</p>"},{"name":"Lara Croft: Tomb Raider - Legend","year":2006,"developer":"Buzz Monkey Software, LLC","url":"PS2_COLLECTION_PART13/Lara%20Croft%20Tomb%20Raider%20-%20Legend%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2634814626,"score":7.8,"genres":"Action > Behind view > Platform > Puzzle elements > Quick Time Events (QTEs) > Direct control","desc":"<p><em>Legend</em> is the seventh major game in the Tomb Raider series, now for the first time developed by Crystal Dynamics, along with the original character designer of the game's protagonist Lara Croft: Toby Gard.</p><p>Heroine Lara is searching for a South American relic, but her adventure takes a different course when rogue anthropologist Amanda Evert shows up. Presumed dead along with a team of graduate students after an accident in a tomb in Peru, where Lara was the only one to escape, Amanda is back with a score to settle as they both race, along with the shady James Rutland Jr., to obtain an ancient artifact. Many other characters, both friends and foes, will stir things up. The story takes Lara through locations all over the world, from the Himalayas to Ghana, Kazakhstan, Bolivia, Japan, and England, including her famous mansion filled with secrets and collectibles. Aside from current events, Lara's past is also revealed, through flashbacks. Among other things, you will get to know how she lost her mother and why it is such a burden.</p><p>The typical third-person action-adventuring exploring is still present. Lara can move more freely and is no longer limited by specific jumps. As you travel through rough environments, you will need to run, dive, swim, climb on poles, ladders, roofs, use zip lines, shimmy, and vault, with acrobatic actions such as somersaults and flips. You need to cross difficult terrain, solve puzzles to advance or open up new areas, and engage in combat. New tools include a grappling hook, not only used to move around but also to haul enemies Scorpion-style, binoculars, a PLS (personal light source), flares, a PDA and a headset to keep in contact with tech support Zip.</p><p>Enemies are still rather scarce. Both humans and animals will attack you, and the game retains the auto lock-on mode, but now with a slide attack and close combat with both kicks and punches, plus bullet-time actions to get behind enemies quickly. Lara carries her trademark dual-wielded pistols, but can also pick up new weapons along the way, such as a shotgun and grenades. Missions take place in both indoor and outdoor environments, with arcade motorcycle and jeep sequences in between. As usual, Lara has a fancy outfit for each location.</p><p>The PSP version includes the full game and adds a multiplayer mode: Tomb Trials. You can race another player through tombs to see who comes out first, or go on a timed scavenger hunt for artifacts.</p>"},{"name":"Lara Croft: Tomb Raider - The Angel of Darkness","year":2003,"developer":"Core Design Ltd.","url":"PS2_COLLECTION_PART13/Lara%20Croft%20Tomb%20Raider%20-%20The%20Angel%20of%20Darkness%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3492570171,"score":6.2,"genres":"Action > Behind view > Platform > Puzzle elements > Direct control > Europe > Regional differences","desc":"<p>Help Tomb Raider's famous heroine, Lara Croft, save the world from the forces of evil.</p><p>As the game begins, Lara wakes from a stupor. Recalling what she can of the past few hours, she remembers walking in on a killer after discovering the body of Von Croy, her friend and former mentor. She must make a hasty escape from the authorities who blame her for the crime. Determined to discover the fiend responsible, Lara eventually uncovers an evil plot that could cause the destruction of mankind. If the reincarnation of the \"angel of darkness\" is allowed to happen, the world is doomed!</p><p>The game environment is set in the somewhat distant future. You'll lead Lara mostly in 3rd person perspective, travelling to various locales in Europe. Explore sewers, cemeteries, warehouses, factories and cities. A multitude of NPCs will be encountered, both in the form of friend as well as foe.</p><p><em>Angel of Darkness</em> introduces new stealth and close-combat moves - ducking, sneaking and hug-the-walls walking. Lara must build her skills by performing action sequences. You'll have her running, dodging, performing flying leaps and platform jumps, shimming along walls and cables, as well as moving boxes and other obstacles around. Advancements are achieved with strategically placed power-ups. Collect weapons and ammunition, artifacts and money.</p><p>You'll also play Kurtis Trent, a new male counterpart, for several \"levels\". Although Kurtis gets in Lara's way when she first meets him, he eventually becomes an ally when they realize they are both working towards the same goal.</p>"},{"name":"Largo Winch: Empire Under Threat","year":2002,"developer":"Ubi Soft Annecy Studios","url":"PS2_COLLECTION_PART13/Largo%20Winch%20-%20Empire%20Under%20Threat%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":942415578,"score":6.6,"genres":"Adventure > 3rd-person (Other) > Puzzle elements > Detective / mystery > Licensed","desc":"<p>This adventure game is based on the famous comic book character of the same name. The hero - Largo was a Yugoslavian orphan, who was adopted by the world's wealthiest man, who was in search of an heir. When his adoptive father dies, the now 26-year-old Largo inherits the Winch Corporation, a financial consortium worth more than 10 billion dollars. Drawn to the challenge of presiding over such a vast empire, Largo takes over from his father and plunges headfirst into a new, unexpectedly vicious world of murder and deceit.</p>"},{"name":"Lassie","year":2007,"developer":"EM Studios","url":"sony_playstation2_l/Lassie%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":334752009,"score":"","genres":"Action > Behind view > Direct control > Licensed","desc":"<p>Your chance to take part in a thrilling adventure as the most famous dog in the world! Lassie returns in this fun action game following on from the acclaimed movie.</p><p>The story opens with the discovery that the villainous Eddie Hynes has returned to steal Lassie's litter of six pups. Through each level of the game you'll need to show bravery and determination to track down the missing pups and bring Hynes to justice!</p><p>Six varied levels - follow the clues in the underground mine, race downhill on a high-speed sled and help to round-up sheep on the farm.</p><p>Use Lassie's sense of sight, smell and hearing to find each pup. Outwit groundsmen on patrol and befriend angry guard dogs. Collect bones for bonus activity.</p><p>Once rescued each of the six puppies will require your attention. Keep them happy by providing special treats, water and play.</p>"},{"name":"Le Mans 24 Hours","year":2001,"developer":"Infogrames Melbourne House Pty Ltd.","url":"PS2_COLLECTION_PART13/Le%20Mans%2024%20Hours%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":626799631,"score":7.4,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Behind view > Managerial / business simulation > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Take on the LeMans endurance racing challenge! Join one of the 25 factory teams take one of the over 50 vehicles (designed with assistance of actual teams) on the eight different LeMans circuits. The actual wear and tear are simulated. Tire wear, oil and fuel consumptions...  Day and night and back to day driving...</p>"},{"name":"Le Tour de France","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd."},{"name":"Le Tour de France: 1903-2003 - Centenary Edition","year":2003,"developer":"DC Studios, Inc."},{"name":"Leaderboard Golf","year":2006,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART13/Leaderboard%20Golf%20%28Europe%29.zip","filesize":249131823,"score":"","genres":"Sports > 3rd-person (Other) > Golf","desc":"<p><em>Leaderboard Golf</em> is a typical golf game with courses inspired by the European and US Tour. Included are four different modes of play: quick round, match play, championship mode and practice Mode. It uses the standard Swingometer for the golf swings, where the power and hook/slice is set by your timing and reaction speed.</p>"},{"name":"League Series Baseball 2","year":2001,"developer":"Magical Company Ltd.","url":"sony_playstation2_l/League%20Series%20Baseball%202%20%28Europe%2C%20Australia%29.zip","filesize":303575187,"score":"","genres":"Sports > Behind view > Direct control > Baseball","desc":"<p>In LEAGUE SERIES BASEBALL 2 you get to manage your own unique baseball team to victory against thousands of league opponents. You decide which players to field, what tactics to use and when to bring out the big-hitters! You are given total control of your team's roster and tactics. Every decision could mean the difference between sweet victory and bitter defeat...</p><p>Using all your baseball know-how you must guide your team to the top of the league. Or you can challenge a friend to an instant-access game in the two-player VS. Mode!</p><p>* Intuitive control system lets you get straight into the action so you'll be battling like a pro in minutes!<br>* VS. Mode lets two players fight to tally up the most home runs. Use tactical expertise and skilled play to defeat your opponent.<br>* Edit the rosters and tactical play for any of 4000 playable teams in the one-player mode.<br>* A great random weather system means conditions can change at any time.</p>"},{"name":"Legacy of Kain Series, The: Blood Omen 2","year":2002,"developer":"Crystal Dynamics, Inc."},{"name":"Legacy of Kain: Defiance","year":2003,"developer":"Crystal Dynamics, Inc.","url":"PS2_COLLECTION_PART13/Legacy%20of%20Kain%20-%20Defiance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3177298746,"score":7.6,"genres":"Action > Behind view > Puzzle elements > Fantasy > Horror","desc":"<p>Following the events of Legacy of Kain: Soul Reaver 2, Raziel and Kain were trapped in the Serafan fortress. Separated by sudden events, Raziel was forced to retreat into the spectral realm, leaving Kain to escape from the Serafan on his own. Both must escape the predicament they find themselves in and fight back against those who would seek to use them as manipulations in a grander plot. From both heroes cry out shouts of defiance, and a thirst to find the revelations that have been buried in the world of Nosgoth.</p><p><em>Legacy of Kain: Defiance</em> is a third-person action game with light puzzle-solving elements, combining concepts seen in both Blood Omen 2 and Soul Reaver 2. The story unfolds through chapters, focusing alternately on Kain and Raziel as they pursue their separate, though intertwined quests. Control of each character alternates between levels, however both are controlled from a behind-the-shoulder perspective. While both heroes are different, they are similar in movement, ability to attack, defend, jump and access special abilities. </p><p>Kain and Raziel no longer pick up weapons, instead both using a form of the Soul Reaver weapon (Kain uses the physical sword form, Raziel uses an energy blade). Each Soul Reaver can now be \"charged\" to unleash a special ability, determined by the current alignment of Soul Reaver at the time. Both Kain and Raziel lose energy at a constant rate and must feed to replenish life energy (Kain feeds on the blood of living creatures, Raziel feeds on the souls of living and non-living creatures). And both Kain and Raziel feature telekinetic abilities to manipulate objects at a distance. </p><p>The two are, however, different characters that play differently, each requiring use of his talents, to bypass obstacles (sometimes the same obstacle). Kain focuses on strong combat and destructive abilities. He is able to power up the Soul Reaver weapon using properties of the Pillars of Nosgoth. Raziel is more subtle, able to use stealth and the phasing between material and spectral worlds in order to discover new paths. As in <em>Soul Reaver</em>, Raziel can phase into the spectral world at any time but must find a special location in order to phase back. Raziel powers up the Soul Reaver using elemental powers.</p>"},{"name":"Legacy of Kain: Soul Reaver 2","year":2001,"developer":"Crystal Dynamics, Inc.","url":"PS2_COLLECTION_PART13/Legacy%20of%20Kain%20-%20Soul%20Reaver%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3949599671,"score":8,"genres":"Action > Behind view > Puzzle elements > Fantasy > Horror","desc":"<p>Following the events in Legacy of Kain: Soul Reaver, Raziel discovers a way back through time and encounters one of the Circle of the Nine, Mobius the timestreamer. Mobius urges Raziel to continue his quest for revenge and destroy the vampire lord Kain. Raziel reluctantly agrees and heads off to discover the knowledge and weapons that will allow him to achieve his goal.</p><p><em>Soul Reaver 2</em> is a third-person action game with puzzle-solving and some platforming elements, similar to the previous installment. The game world is viewed from behind Raziel's shoulder; the player can move him in any direction, climb, attack, swim, jump and use specific abilities. Raziel retains his special moves from the previous game, which include gripping onto the sides of ledges, climbing walls, and gliding downwards with his torn wings. Like in the previous installment, Raziel can travel between the material world and the spectral realm at will, gaining access to new areas by exploiting distortions that exist between the mirrored worlds. As before, he must drain the souls of his enemies to prolong his existence in the material realm.</p><p>Raziel no longer gains abilities from absorbing great souls and instead must imbue his Soul Reaver weapon by activating certain elemental temples. Once activated, various \"elemental fonts\" can be used to charge the Soul Reaver to specific attributes. Raziel can arm himself with a variety of other weapons including daggers, swords, axes, spears as well as the Soul Reaver and bare-handed claws.</p><p>Unlike the previous game, <em>Soul Reaver 2</em> is linear and follows specific paths through different areas. Raziel cannot return to certain areas once he has left them behind. The game features diverse puzzles, often involving blocks or manipulation of different devices. One common theme is \"light puzzles\" where Raziel must reflect light, using mirrored objects, so that they touch switches or objects which require activation.</p>"},{"name":"Legaia 2: Duel Saga","year":2001,"developer":"Prokion","url":"PS2_COLLECTION_PART13/Legaia%202%20-%20Duel%20Saga%20%28Europe%29.zip","filesize":1652236190,"score":7.1,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based","desc":"<p>A group of people known as Mystics live like outcasts, shunned by most humans because of their unique connection to the world of spirits: they are able to summon powerful supernatural beings called Origins. A small village of Nohl is a refuge for Mystics; one of them is a young swordsman named Lang, whose duty is to protect a crystal that supplies the town with water. One day, Lang meets a mysterious man who manipulates him into giving up the crystal. Determined to correct his mistake, Lang sets on a journey to retrieve the crystal, on which he will learn more of the role the Mystics and their Origins play in the world.</p><p><em>Legaia 2: Duel Saga</em> is a follow-up to Legend of Legaia, though it is not directly connected to it story-wise, featuring a different cast of characters. Like its predecessor, it is a Japanese-style role-playing game with turn-based combat. The game utilizes a system called \"Arts\", which requires the player to press a combination of buttons corresponding to fighting moves during battles. These are divided into the sub-categories \"Normal Arts\" (basic moves), \"Hyper Arts\" (more powerful moves that require special points to be spent), \"Mystic Arts\" (Origin powers), and, finally, \"Variable Arts\" (team attacks). </p><p>The game also features a Camping mode; accessing it, the player is able to communicate with the characters in the party, prepare meals from ingredients, and craft items such as weapons, armor, and accessories.</p>"},{"name":"Legend of Alon D'ar, The","year":2001,"developer":"Stormfront Studios","url":"sony_playstation2_l/Legend%20of%20Alon%20D%27ar%2C%20The%20%28USA%29.zip","filesize":425208207,"score":5,"genres":"Role-playing (RPG) > 3rd-person (Other) > Real-time > Turn-based > Fantasy","desc":"<p>Chandar is a floating world populated by different races; unfortunately, not all of them are at peace with each other. One day, a young warrior of the Orin race named Jarik, who lived in the small town Hollow Grange, awoke from a terrible nightmare. He saw a mysterious evil creature consuming the energy of the planet. At the same moment, a group of warriors of the Dagani race attacked the town. One of them turned into a horrifying monster when Jarik killed him. A strange stone was coughed out by the creature, and after Jarik touched it, a scar was burned into his hands...</p><p><em>The Legend of Alon d'Ar</em> is a Japanese-style role-playing game with several distinguishing characteristics. The player controls Jarik and a party of characters as they roam the world, completing quests, acquiring items, and fighting enemies. Battles either occur at pre-set points, or are triggered randomly. Combat is a mixture of turn-based and real-time styles, somewhat similar to the <em>ATB</em> system of  Final Fantasy games. The difference is that in this game, the amount of time a character has to wait before acting is directly related to the weapon and/or magic spell he/she is using.</p><p>The game features heavy customization of weapons and spells. To upgrade them, the player needs to distribute PP (proficiency points) collected in battles. Weapons and spells have different characteristics, which can be enhanced individually by channeling PP into them. For example, it is possible to upgrade the attack speed of daggers by investing proficiency points into the corresponding categories.</p>"},{"name":"Legend of Camelot","year":2007,"developer":"Brain in a Jar Ltd.","url":"PS2_COLLECTION_PART13/Legend%20of%20Camelot%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":402468035,"score":"","genres":"Puzzle","desc":"<p>A long time ago there was a fiery war between Britain and the Saxons. During a great battle, Arthur, the son of the King and Queen of Britain, is taken into hiding by his teacher Merlin, the wise and good wizard. Year's later a mysterious sword in a stone appears in London. The words \"who so ever pulls this sword from the stone shall be the legitimate king of all Britain\" are engraved in the stone.</p><p>Will Arthur pull the sword from the stone and take his rightful place as King?</p><p>Including various activities: Watching Cartoons, Colouring, Pairs Activity, Jigsaw Puzzle, Sliding Puzzle.</p>"},{"name":"Legend of Kay","year":2005,"developer":"NEON Software GmbH","url":"PS2_COLLECTION_PART13/Legend%20of%20Kay%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2643688947,"score":7.4,"genres":"Action > Behind view > Puzzle elements > Fantasy > Martial arts","desc":"<p><em>Legend of Kay</em> is an action-adventure game where a young hero called Kay, a cat, rises to the challenge when emperor Shun, king of the mighty gorillas, invades the island Yenching with his troops. Kay may only be a scholar, but he is a brave and agile fighter. He leaves his village only with his sword and soon becomes a seasoned fighter.</p><p>The fights in <em>Legend of Kay</em> are reminiscent of eastern martial-arts-movies. There are various moves the player can execute: uppercuts, back flips, somersaults, powerful magic attacks and there are combo moves. When you gain a combo, you can auto-aim at enemies, which makes it easy for the player to execute double and triple blows. In the beginning there is only a sword, but later in the game Kay receives steel claws and a powerful war hammer. All weapons can be upgraded. Kay has to fight a lot of different enemies on the ground and in the air. There is a lot of jump-and-run action, puzzles and many fights.</p>"},{"name":"Legend of Mulan","year":2004,"developer":"The Code Monkeys Ltd."},{"name":"Legend of Spyro, The: A New Beginning","year":2006,"developer":"Krome Studios Pty Ltd.","url":"PS2_COLLECTION_PART13/Legend%20of%20Spyro%2C%20The%20-%20A%20New%20Beginning%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1970897720,"score":6.9,"genres":"Action > Diagonal-down > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>The Legend of Spyro: A New Beginning deals with Spyro's birth and his journey to meet his destiny. The intro shows Spyro being rescued by a Guardian Dragon called Ignitus from the attack of the \"Dark Master\". After his eclosion, Spyro is raised by dragonflies in a swamp until one day he discovers that he is in fact a dragon, and he and his half-brother, the dragonfly Sparx, leave the swamp to find out more about Spyro's past and fight the forces of evil.</p><p>In contrast to previous Spyro games, the emphasis is put on combat instead of platforming. Spyro can do several combat moves, using both his tail and his claws, and has four different breath attacks: fire, electricity, ice, and earth. The game also features several rail shooter passages similar to games like Panzer Dragoon.</p>"},{"name":"Legend of Spyro, The: Dawn of the Dragon","year":2008,"developer":"Ã‰tranges Libellules S.A.","url":"PS2_COLLECTION_PART13/Legend%20of%20Spyro%2C%20The%20-%20Dawn%20of%20the%20Dragon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":2278249092,"score":7.2,"genres":"Action > Diagonal-down > Cinematic camera > Beat 'em up / brawler > Flight / aviation > Fantasy","desc":"<p><em>Dawn of the Dragon</em> is the third and final chapter of the <em>Legend of Spyro</em> trilogy. It starts when Spyro and Cynder are freed from their crystalline prison. They are former foes, but the Dark Master binds them through green energy chains. After escaping their prison with Sparx and Hunter, they are shown what the Dark Master has done after he escaped from the Well of Souls during the Night of Eternal Darkness. They travel through Dragon City, the Burned Lands and the Floating Islands to confront Malefor at his lair.</p><p>Just like the previous game, <em>Dawn of the Dragon</em> is a third-person action game with a focus on fighting and exploration even though progress is entirely linear. New to the series is the ability to fly at any time. This edition also provides a cooperative mode with Spyro and Cynder and with just a single player it is possible to switch between them at any time. Spyro attacks with fire, electricity, earth and ice, while Cynder controls poison, fear, wind and shadow. Collected gems provide power-ups and both characters can also equip pieces of dragon armour. Gems include blue ones to upgrade moves, red ones restore health, and green ones make available element attacks through dragon magic. The amount of blue ones provided is based on a melee combo system.</p><p>Fury gems have been removed. They are replaced with dark crystals that need to be destroyed as they drain magic. Fury is now determined through a meter that fills up during attacks. Next to the regular enemies there are now elite enemies that were a mask with a certain colour. A specific attack is needed to get rid off the mask and then regular attacks become effective.</p>"},{"name":"Legend of Spyro, The: The Eternal Night","year":2007,"developer":"Big Ant Studios Pty Ltd","url":"PS2_COLLECTION_PART13/Legend%20of%20Spyro%2C%20The%20-%20The%20Eternal%20Night%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1818242057,"score":6.2,"genres":"Action > Diagonal-down > 2D scrolling > Arcade > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>Spyro wakes up late one night to discover that his rescued friend, Cynder, is running away from the temple where they live. Spyro (and reluctantly, his friend Sparx) chase after her. Little do they know that they are in for another adventure, where they will meet the mysterious Chronicler and eventually face off against Gaul, the Ape King.</p><p><em>The Legend of Spyro: The Eternal Night</em> is a 3D action platformer which takes place right after the events at the end of The Legend of Spyro: A New Beginning. Players control Spyro as he searches for his friend Cynder. Initially, he has lost all of his different breath powers from the first game, but he gradually recovers the ability to breathe fire, ice, earth and electricity. New to this game is the ability for Spyro to slow down time using his newly-learned 'Dragon Time' ability.</p><p>While the game has some basic puzzles involving pressing switches, the main focus is still around fighting. Spryo's primary attack is his headbutt, but he can also use his assorted breaths to defeat foes provided that he has enough magic power. He also earns blue gems from defeating foes which will allow him to level up his powers.</p>"},{"name":"Legend of the Dragon","year":2007,"developer":"Neko Entertainment SARL","url":"PS2_COLLECTION_PART13/Legend%20of%20the%20Dragon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":469997950,"score":5,"genres":"Action > Side view > Arcade > Fighting > Fantasy > Licensed","desc":"<p><em>Legend of the Dragon</em> is a 3D versus fighting game that plays like a 2D versus fighting game. The game is based on the animated series of the same name and resolves around a battle between good and evil. Woo Yin an evil Zodiac Master plans to steel the powers of the twelve guardians of the Chinese Zodiac temples in his goal to rule over China.</p><p>The game offers eighteen playable fighters from the series each with their own moves. In addition to the kick and punch moves each of the characters can transform into a more powerful Zodiac avatar mode. Single player modes include quest (this mode also has a power-up system), quick fight, survival, time attack and ranking. Multiplayer modes include versus battle, tag battle and team battle. The game can be played with up to four players (two simultaneous) and features destructible terrain while fighting an opponent.</p>"},{"name":"Legends of Wrestling","year":2001,"developer":"Acclaim Studios Salt Lake City","url":"sony_playstation2_l/Legends%20of%20Wrestling%20%28USA%29%20%28v1.02%29.zip","filesize":645769975,"score":5.6,"genres":"Sports > Wrestling > Licensed","desc":"<p><em>Legends of Wrestling</em> takes one of America's most popular (fake) sports and turns back the clock. The game is all about the classic superstars including Hulk Hogan, Bret \"Hitman\" Hart, Jerry \"The King\" Lawler, Jimmy \"Superfly\" Snuka, Rob Van Dam, Terry Funk, The Road Warriors and George \"The Animal\" Steele.</p><p>The game features in-depth match analysis and career guidance by some of wrestling's greatest managers, including Captain Lou Albano and \"The Mouth Of The South\" Jimmy Hart. They will guide you through your career should you chose that mode of play. For those who just want to hit the mats right away, you can simply jump into an exhibition match in several match types including Tag Team Challenge, Three- and Four-Way Dances, and special guest referees.</p>"},{"name":"Legends of Wrestling II","year":2002,"developer":"Acclaim Studios Salt Lake City","url":"sony_playstation2_l/Legends%20of%20Wrestling%20II%20%28USA%29.zip","filesize":3863282064,"score":6.5,"genres":"Sports > 3rd-person (Other) > Direct control > Wrestling","desc":"<p>The sequel is enhanced and improved first part, in which you control a fighter or a party of them in most unbloody fighting sport, which is called wrestling. Over 65 famous \"Champions\" are available to you, such as Hulk Hogan, Andre The Giant, Rowdy Roddy Piper, Bruno Sammartino, Bret \"Hitman\" Hart, Sid Vicious, \"Big Poppa Pump\" Scott Steiner and Jerry \"The King\" Lawler.</p><p>There are many types of fights, including 6- and 8-man Elimination Bouts, Cage, Battle Royal, Ladder, Table and 3- and 4-way dances, also Body Slam Challenge with Big John Studd and tag-team tournaments with great teams such as The Road Warriors, Steiner Brothers, British Bulldogs, Nasty Boys, Rock-n-Roll Express and more.</p><p>Create-A-Legend feature now is bigger and better, allowing players to make their ultimate grappler.</p>"},{"name":"Legion: The Legend of Excalibur","year":2002,"developer":"7 Studios, Inc.","url":"PS2_COLLECTION_PART13/Legion%20-%20The%20Legend%20of%20Excalibur%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2857809991,"score":6,"genres":"Action > Role-playing (RPG) > Strategy > 3rd-person (Other) > Real-time > Fantasy","desc":"<p>Based on the popular legends of  King Arthur, <em>Legion: The Legend of Excalibur</em> puts the player in control of the famed Knights of the Round Table, as they lead legions of knights into battle against the evil Morgan Le Fay and her army of undead warriors.</p><p><em>Legion: The Legend of Excalibur</em> is essentially an action game with elements of real-time strategy (RTS) and role-playing. The player first commands only one knight, with several others fighting on his side. During the course of the game, the player will control up to four parties of warriors simultaneously. The RTS element with sending troops to battle enemies or protect important locations co-exists with rather simple \"hack-and-slash\" combat mechanics that apply to the characters which are controlled directly by the player.</p>"},{"name":"LEGO Batman: The Videogame","year":2008,"developer":"Traveller's Tales (UK) Ltd.","url":"PS2_COLLECTION_PART13/LEGO%20Batman%20-%20The%20Videogame%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CDa%29.zip","filesize":1330301036,"score":7.4,"genres":"Action > 3rd-person (Other) > Side view > 2D scrolling > Platform > Direct control > Fantasy > Licensed","desc":"<p>Continuing the tradition of adapting known franchises such as Star Wars and Indiana Jones with visuals based on LEGO, this game takes on the Batman universe. The basic concept is the same, with characters and objects built up using LEGO blocks, but here shown against surroundings drawn in a regular fashion. Most of the environments are side-scrolling with a fixed camera perspective, but in 3D with quite some depth. </p><p>It is not based on a certain movie or comic, but on the franchise as a whole with a new story. The animations and sequences are rather quirky and share nothing with the darker atmosphere of the contemporary <em>Batman</em> movies. A cast of villains has escaped from Arkham Asylum and now roam through Gotham City wreaking havoc. The first half of the game, players control Batman and his sidekick Robin to take on all enemies with typical brawler gameplay. Enemies will often respawn endlessly until the player figures out how to progress. The environments can be explored using a number of gadgets such as the batarang and the grappling hook, and players can switch between the two characters at any time. They can both fight and the inactive character is always controlled by the computer AI. Both characters have unique powers they can access by changing their suits. Batman can then glide through the air or plant bombs, while Robin has for instance a technology suit that allows his to walk on metal surfaces in any direction. They can also drive certain vehicles.</p><p>Both characters operate out of the Batcave that acts as a central hub to store trophies and access missions. Many of the missions have small puzzle elements with buttons or passages that need to be cleared. Objects and characters explode into smaller LEGO blocks and at certain sections the hero need to build structures with blocks to create new objects. After completing a mission in the story mode, it becomes available in a separate free play mode.</p><p>In the second part of the game players take control of the different villains such as Poison Ivy, The Joker, Mr Freeze, The Riddler, Killer Moth, Hush, Clayface, Man-Bat and more. They all have different powers and their section of the game always ends at the moment they are confronted by Batman and Robin. This way, the game shows how they set up their plans prior to the fights in the first part of the game. The characters collect coins, objects and hearts. Even though they can die, they immediately respawn.</p><p>Multi player options vary between platforms. Home console and Windows versions allow drop in/drop out co-op. The PSP release fares worst of all and does not contain any kind of multiplayer option.</p>"},{"name":"LEGO Indiana Jones: The Original Adventures","year":2008,"developer":"Traveller's Tales (UK) Ltd.","url":"PS2_COLLECTION_PART13/LEGO%20Indiana%20Jones%20-%20The%20Original%20Adventures%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CDa%29.zip","filesize":1692102441,"score":7.7,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Licensed","desc":"<p>In <em>LEGO Indiana Jones: The Original Adventures</em> the players get to explore the Indiana Jones universe with \"LEGO-fied\" characters. </p><p>The game focuses on the three original films: Raiders of the Lost Ark, Indiana Jones and the Temple of Doom, and Indiana Jones and the Last Crusade, each film consisting of six separate chapters retelling the stories in a humorous, light-hearted way that tones down the violence while removing some of the more overt religious and political references found in the film.</p><p>All of the sets and props are also made out of LEGOs, and retain their properties such as the ability to be rebuilt and fall apart.</p><p>In this third-person platform/action game, players take control over various heroes including Indiana Jones, Marion Ravenwood or Dr. Marcus Brody, and also allows players to play the villains such as Belloq and Mola Ram.</p><p>Each character has different abilities and weapons. While Indiana Jones has a whip with which he can pull items out of reach, the female characters can jump higher, scholars can decipher hieroglyphics, mechanics can fix machines and diggers can unearth buried treasure. The characters also have different phobias (snakes, rats, spiders), each corresponding to their personalities.</p><p>The main campaign of the game is called Story Mode in which the player follows the film's stories with two pre-defined characters and cut-scenes. Once the level has been cleared, however, the player can return in Free Play mode and switch between all the characters that have been unlocked, allowing access to previously unreachable areas to collect all other artifacts and bonus items.</p><p>Destroying or building objects produces Lego studs, which allows the player to buy additional characters and cheat modes in Barnett College (the main hub). Players can also watch previous cut-scenes, examine previously found treasures, enter codes, or explore the college at their leisure.</p><p>As in the LEGO Star Wars series, in addition to the single-player game, there is also a 2 player co-op mode that allows two players to play the Story Mode. The second player can enter the game at any given time by pressing a button on the second controller.</p>"},{"name":"LEGO Racers 2","year":2001,"developer":"Attention to Detail Limited","url":"PS2_COLLECTION_PART13/LEGO%20Racers%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CDa%29.zip","filesize":569500447,"score":6.4,"genres":"Racing / Driving > Behind view > Direct control > Automobile > Off-roading > Track racing > Truck > Sci-fi / futuristic > Licensed","desc":"<p>Following the first game, Rocket Racer issues a new challenge to find the best racer in the galaxy, summoning the greatest racers of all time to Planet Xalax for the Galactic Racing Championship. Players must prove their driving skills to qualify for the ultimate race on planet Xalax. </p><p>The Story Game mode is where all the real action of Lego Racers 2 takes place. In this mode, you become a new racer, determined to become Galactic Racing Champion. Along the way, other racers challenge you as your quest to become number 1 continues. The more races you win, the more Golden Blocks you win. Golden Blocks help you move throughout the different levels of the game. You start out with zero Golden Blocks and move up as you win more races.</p><p>There are also a number of multiplayer modes.</p>"},{"name":"LEGO Star Wars II: The Original Trilogy","year":2006,"developer":"Traveller's Tales (UK) Ltd.","url":"sony_playstation2_l/LEGO%20Star%20Wars%20II%20-%20The%20Original%20Trilogy%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CDa%29.zip","filesize":1100609741,"score":7.9,"genres":"Action > 3rd-person (Other) > Cinematic camera > Platform > Sci-fi / futuristic > Licensed","desc":"<p>The Legos strike back in the sequel to the original LEGO Star Wars: The Video Game, where players now get to explore the original trilogy (Episodes IV, V, and VI) of the <em>Star Wars</em> movie series. Players use LEGO-ized Star Wars characters to reenact all three of the original movies. All of the sets and props are also made out of LEGO bricks, and retain their properties such as the ability to be rebuilt and fall apart. Like its predecessor, the game puts a spin on the series by adding a light-hearted, humorous touch to the movies, and also by using no dialogue. </p><p><em>LEGO Star Wars II</em> is a third-person action game with platforming elements. Players take control of the characters and vehicles of Star Wars. In Story Mode, players reenact the key events of the original movies with LEGO bricks. Each character has different weapons, like lightsabers for Jedi or crossbows for Wookies, as well as new character-specific attacks and maneuvers. Each character also has different abilities, e.g. Jedi being able to use the force, R2-D2 being able to unlock doors, or Boba Fett being able to use his jetpack. It is up to the player to use these abilities to solve simple puzzles and traverse the levels of the game. Vehicle levels are more prominently featured than in the previous game, with longer sequences dedicated to piloting traditional Star Wars aircraft.</p><p>In addition to a single-player game, there is also a co-op mode that allows two players to go through the Story Mode. In the single-player mode, the second character is controlled by the AI. Like in the first game, the Free-play mode allows players to go back and replay beaten levels with any playable character they have unlocked. A new feature allows players to create their own mixed-up LEGO characters and vehicles. Power Brock items and coin stubs collected in Story Mode will also unlock new characters, vehicles, and items for players to experiment with.</p>"},{"name":"LEGO Star Wars: The Video Game","year":2005,"developer":"Traveller's Tales (UK) Ltd.","url":"PS2_COLLECTION_PART13/LEGO%20Star%20Wars%20-%20The%20Video%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CDa%29.zip","filesize":604304797,"score":7.7,"genres":"Action > 3rd-person (Other) > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>LEGO Star Wars: The Video Game</em> allows players to relive the events of the <em>Star Wars</em> prequel movie trilogy (Episodes I, II and III) in LEGO form. Players take control of over thirty characters to play through key moments from <em>The Phantom Menace</em>, <em>Attack of the Clones</em> and <em>Revenge of the Sith</em>. The storyline includes most of the important events in the movies, omitting or adding a few sequences. The presentation of these events, however, is humorous, with all the characters and environments made out of LEGO bricks. Objects would often break apart like physical LEGO bricks, characters have comical expressions, and all dialogue from corresponding events from the movies is replaced by gestures.</p><p>The basic gameplay is action with platforming and light puzzle-solving elements. Players navigate two or more characters through stages, each representing a chapter in a movie. These chapters must be unlocked in a plot-dictated order, eventually completing the entire movie. Characters use different weapons (blasters, lightsabers, crossbows, etc.), and each character type also possesses specific abilities. For example, Jedi can use the force to lift, combine, and destroy objects; robots can unlock encrypted doors; other characters may use a grappling hook to access higher platforms, etc. Some of these abilities overlap (i.e. a problem can be solved in more than one way), though often a specific type of character is required to deal with the situation. In the single-player mode, one player can switch between the available characters; in the co-op mode, two players navigate at least two different characters.</p><p>A few levels involve players piloting aircraft, fighting hostile vehicles, overcoming obstacles or destroying targets on the ground. The Free Mode allows players to access previously visited stages with any characters they have unlocked. This may lead to a discovery of previously inaccessible areas. Various collectible items and LEGO studs (which serve as currency) can be gathered during exploration. Characters cannot permanently die in the game; when a character is killed, he or she only loses collected LEGO studs.</p>"},{"name":"Leisure Suit Larry: Magna Cum Laude","year":2004,"developer":"High Voltage Software, Inc.","url":"PS2_COLLECTION_PART13/Leisure%20Suit%20Larry%20-%20Magna%20Cum%20Laude%20%28Europe%29.zip","filesize":2130349634,"score":6.1,"genres":"Action > 1st-person > 3rd-person (Other) > Mini-games > Puzzle elements > Quick Time Events (QTEs) > Adult > Comedy","desc":"<p>Larry Lovage learned everything he knows from his uncle, Larry Laffer, the famous polyester-clad fellow who starred in the previous games. Young Larry finally makes it to college, <em>the best</em> place to meet and pick up girls. He finds them <em>everywhere</em> .. in restaurants, night clubs, dormitories and at fraternity parties. All those scantilly clad, gorgeous babes! But, does Larry have half a chance <em>to score</em> with even one of them? Will he get a peek at what's underneath that braless, too-tight tank top?</p><p>Larry's sexcapades include varied types of arcade mini-games. Some simply require good reflexes while others involve memory and/or correct timing. For instance, steer a little joker sperm through an obstacle course of flying objects, all the while trying to keep the \"course\" of the conversation on track. Or .. put the correct ingredients into a bar drink in order - and in the time allowed. Several of the games become more difficult as the game progresses.</p><p>This action/adventure features three endings, over 20 locations, 3D graphics, and hilarious adult situations and conversations.</p>"},{"name":"Lemmings","year":2006,"developer":"Team17 Software Limited","url":"PS2_COLLECTION_PART13/Lemmings%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":290255472,"score":"","genres":"Puzzle > 3rd-person (Other) > Side view > Real-time > Platform","desc":"<p>This version of <em>Lemmings</em> is a port of the PSP version released earlier in 2006. The main difference is the optional use of the EyeToy camera as a direct way to influence the gameplay. The player has to stretch his/her limbs in the recorded picture to help the Lemmings. There are 20 new levels which specifically utilize this new control method.</p><p>The player's duty still consists of driving Lemmings, mindless beings, from the start of each level to the end of it. Various commands can or need to be given to the Lemmings. Of course a minimum quantity of Lemmings is requested to be brought to the end of the level safe, extra ones saved will lead to a reward in terms of score.</p>"},{"name":"Lemony Snicket's A Series of Unfortunate Events","year":2004,"developer":"Adrenium Games","url":"PS2_COLLECTION_PART13/Lemony%20Snicket%27s%20A%20Series%20of%20Unfortunate%20Events%20%28Europe%29.zip","filesize":1918010547,"score":7.3,"genres":"Action > Behind view > Puzzle elements > Steampunk > Licensed","desc":"<p>Life for the Baudelaire orphans is incredibly unpredictable and rather unfortunate.  After losing their parents in a mysterious fire, the orphans are sent to live with their sinister uncle, Count Olaf, who will stop at nothing to get his greedy hands on the Baudelaire famile fortune!  Only by combining their talents will the orphans have a chance to defeat the evil Count Olaf and his horrible henchmen.</p><ul><li><p>Play as all three Baudelaire orphans, each with their own unique skills.</p></li><li><p>Adventure through 16 action-packed missions based on the movie and book series.</p></li><li><p>Build gadgets to help you defeat Count Olaf and his horrendous henchmen.</p></li></ul>"},{"name":"Let's Make a Soccer Team!","year":2006,"developer":"Sega Sports Japan","url":"sony_playstation2_l/Let%27s%20Make%20a%20Soccer%20Team%21%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2786940387,"score":5.3,"genres":"Sports > Strategy > Diagonal-down > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>Doing exactly what it says in the title, <em>Let's Make a Soccer Team!</em> starts with the player creating his own football team. At the start, the player chooses one of the six leagues, the region, hometown and colours of the club, as well as their characteristic playing style and the club secretary, which will guide the player through the most basic features. Additional features (such as designing the club kits and logo) are unlocked as the player advances.</p><p>At the start of the game, the player learns the backstory of the club - established 15 years ago, it quickly rose through the amateur divisions, but at an enormous expense - it's the end of the season, and to reach the second division the team has made a huge effort signing players, and while they're in the promotion playoffs, the club is broke, and the only way to survive is to reach the second division. To make things worse, a local tycoon is eyeing a club to buy, and the nearly bankrupt club might be the easiest target...</p><p>While the presentation is a lot different from other managers (excluding, perhaps, the ZOO Digital rehash of <em>Premier Manager</em>) due to the extensive use of 3D characters and models in the menus, as well as featuring some story elements, it features the same options as other managers in the market, featuring player and staff signing, team tactics and training, but also financial decisions like sponsoring and stadium and facility improvement.</p>"},{"name":"Let's Ride: Silver Buckle Stables","year":2008,"developer":"Coresoft, Inc.","url":"PS2_COLLECTION_PART13/Let%27s%20Ride%21%20Silver%20Buckle%20Stables%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":621117919,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Direct control > Horse / derby","desc":"<p>Ride the horse of your dreams!</p><p>Congratulations your're the owner of a new horse farm called Silver Buckle Stables! Choose your horse, pick out your riding outfits and even accessorise your horse with saddles, ribbons and more. The competitions are tough, but practice hard at the corral to perfect your riding technique and you'll make it to the Equestrian Center where you can show off your skills to win blue ribbons and buckles!</p><p>* Create the horse of your dreams from hundreds of combinations of coats, manes, saddles, bridles, blankets and more!<br>* Personalise your character by picking out your clothes, boots, hair color and hat.<br>* Take a leisurely stroll through the fields, woods and streams of Silver Buckle Stables and play mini adventures!<br>* Head to the practise corral to prepare you and your horse for your big barrel racing competition.<br>* Rise from an unranked rider all the way to a AAA riding professional!</p>"},{"name":"Lethal Skies II","year":2003,"developer":"Bit Town Inc.","url":"PS2_COLLECTION_PART13/Lethal%20Skies%20II%20%28Europe%29.zip","filesize":1726005210,"score":7.4,"genres":"Simulation > 1st-person > 3rd-person (Other) > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>Lethal Skies II</em> is a combat flight simulator which continues the story of the first game adding a powerful, new enemy into the mix with ideas of controlling the world.</p><p>Gameplay and options are similar to the first game, but <em>Lethal Skies II</em> has some additional features and improvements. In addition to upgraded graphics and sound, it has some new features like several difficulty settings, weather effects, five different 1st and 3rd person views, fully interactive battle maps, split-screen, a 2-player mode, and over 20 new missions. Seven new fighter planes increase the arsenal to 19 aircraft including some futuristic fighters as well as \"black ops\" jets. New campaigns can be unlocked which let the player change sides and fly enemy planes.</p>"},{"name":"Lethal Skies: Elite Pilot: Team SW","year":2001,"developer":"Bit Town Inc.","url":"PS2_COLLECTION_PART13/Lethal%20Skies%20-%20Elite%20Pilot%20-%20Team%20SW%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":982461146,"score":6.6,"genres":"Simulation > 1st-person > Behind view > Fighting > Shooter > Direct control > Flight / aviation > Sci-fi / futuristic","desc":"<p>When the ice in the Siberian region melts, a worldwide catastrophe occurs and 90% of the earth is submerged under water. Lifting the major cities and providing assistance is the objective of the newly formed World Alliance, comprised of most of the surviving nations. Opposing the World Alliance are terrorist and militant countries who banded together under WORF (World Order Reorganization Front) looking to profit from the disaster. With global war imminent, the World Alliance organizes a multi-national military organization known as Frontier Nations and its air force, Team SW.</p><p><em>Lethal Skies: Elite Pilot: Team SW</em> is a realistic combat flight simulator for the single player. It features vibration and G-force effects, 2 cockpit views as well as 3rd person and full screen, mid-air refuelling (in certain situations), 14 different missiles for air-to-air and air-to-ground battles, radar, and GPS. Change pilots, planes and weapons in the Hangar. Depending upon the scenario, take off from runways or aircraft carriers. Select Replay to view completed, saved missions.</p><p>The Training Modes are:  </p><p>Mission - take offs and landing, air-to-air attack, air-to-ground attack, combination  </p><p>Dogfight - simulated battles against the computer (one-on-one to four-on-four)  </p><p>Free Flight - fly freely in different stages without enemy confrontation</p><p>The heart of the game takes place in Campaign Mode which has 20 missions selected from a world map. A preliminary briefing and information about the enemy is provided for each mission.</p><p>Choose to control these fighter planes:* F-14D Super Tomcat</p><ul><li>F-16 Fighting Falcon</li><li>F/A-18E Super Hornet</li><li>F-15E Strike Eagle</li><li>F-22 Raptor</li><li>EF2000 Typhoon</li><li>JAS39 Gripen</li><li>MiG29 Fulcrum</li><li>Su27 Flanker</li></ul>"},{"name":"Lifeline","year":2003,"developer":"Sony Computer Entertainment Inc.","url":"sony_playstation2_l/Life%20Line%20%28USA%29.zip","filesize":2963383844,"score":6.6,"genres":"Action > 1st-person > 3rd-person (Other) > Cinematic camera > Puzzle elements > Voice control > Sci-fi / futuristic > Survival","desc":"<p>The year is 2029. The date is Christmas Eve. At the grand opening of the Japan Space Station Hotel, a horde of creatures bursts into the hotel and they start killing everyone. You manage to escape, but you are trapped inside a security room with no chance of getting out. Your only hope lies in Rio, a lone woman, whom you guide by talking to her. Guide her well, and she may be able to rescue you. Rely on her, for she is your one and only life line.</p><p><em>Lifeline</em> is the first game on the PlayStation 2 that is entirely voice controlled. You do not directly control Rio. Instead, you speak to her and tell her what to do. If you want her to open the bathroom door, tell her to open the bathroom door. If there is a keycard laying on the table, tell her to pick it up. If a monster is closing in that she can't shoot, tell her to run away. You explore the entire Space Station Hotel, from the kitchen to maintenance to bedrooms to bathrooms, finding items and encountering a slew of different enemies. </p><p>The game recognizes over two thousand words and phrases. Commands generally consists of a noun and a verb, but many of those can be combined into a single command (e.g. reload, shoot, retreat). Rio can also be ordered to target specific parts of enemies to exploit their weaknesses and players can also change the attack order in a similar fashion.</p><p>A headset is required to play the game, from a game bundle, a third-party headset, or any headset compatible with USB.</p>"},{"name":"Lime Iro Senkitan: Jun - Meiji Nihon, Otome Sakimorisu","year":2004,"developer":"Elf Co., Ltd.","url":"sony_playstation2_l/Lime-iro%20Senkitan%20Jun%20-%20Meiji%20Nihon%2C%20Otome%20Sakimorisu.%20%28Japan%29.zip","filesize":3322960231,"score":"","genres":"Adventure > Strategy > 1st-person > Anime / Manga > Visual novel > Licensed","desc":"<p>This PlayStation 2 version is a port from PC (Windows) game Lime Iro Senkitan (which in turn spanned a TV anime series as well), but with removed adult content and a removed mature rating.</p><p>The story takes place in Meiji era Japan, around the turn of the 20th century, when Japan and Russia are in the major conflict. You play Shintarou, a Russian diplomat originally from Japan, who defects to Japan and arrives at Sapporo to teach the girls at the academy to fight the Russian invading forces. But the five girls that you meet are not your ordinary girls, they have special powers which allows them to summon powerful being to fight for them. They are known as the Lime unit.</p><p>The game is largely a visual novel where you can move through the ship and explore areas, talk to characters and occasionally select among the dialogue choices. During dialogues, characters are slightly animated when facing you (i.e. moving lips, blinking eyes). During the strategy part of the game, you command the Lime unit and tell them how to fight the enemy and stop any invading forces that are trying to destroy your ship.</p>"},{"name":"Lime Iro Senkitan: Jun - Meiji Nihon, Otome Sakimorisu (DX Pack)","year":2004,"developer":"Elf Co., Ltd.","url":"sony_playstation2_l/Lime-iro%20Senkitan%20Jun%20-%20Meiji%20Nihon%2C%20Otome%20Sakimorisu.%20%28Japan%29%20%28DX%20Pack%29.zip","filesize":3322961552,"score":"","genres":"Special edition > Physical extras","desc":"<p>This deluxe pack release of <em>Lime Iro Senkitan</em> contains:<em> Lime Iro Senkitan: Jun - Meiji Nihon, Otome Sakimorisu.</em> <em>Lime Iro Senkitan: Jun</em> (Premium Video DVD)</p><ul><li>Six calendar postcards featuring game characters</li></ul>"},{"name":"Lion and the King 2","year":2004,"developer":"The Code Monkeys Ltd."},{"name":"Little Britain: The Video Game","year":2007,"developer":"Gamerholix Ltd.","url":"PS2_COLLECTION_PART13/Little%20Britain%20-%20The%20Video%20Game%20%28Europe%29.zip","filesize":582451757,"score":4.1,"genres":"Action > Puzzle > Racing / Driving > Sports > 3rd-person (Other) > Diagonal-down > Side view > Top-down > Arcade > Falling block puzzle > Tile matching puzzle > Tricks / stunts > Football (European) / Soccer > Licensed","desc":"<p>This is a collection of mini-games based on the UK comedy sketch TV series <em>Little Britain</em> that ran between 2003 and 2006. The included games are based on some of the scenes and recurring characters. It also includes the original voices of the two leads and the narrator. Players need to unlock the different games by competing in a Tour with three difficulty levels. On Easy, for each 50,000 points another game is opened up and clips from the series are unlocked. The included games are set at different, fictitious locations in Britain and require a lot of button mashing:* Darkley Noone: Vicky Pollard needs to complete two laps on roller-skates in a skate park. She has to collect CDs to throw a party, while avoiding hazards, performing tricks when jumping in the air, and grinding on rails.</p><ul><li><p>Herby: Lou and Andy go to the swimming pool, but as soon as they are there, Andy doesn't like it. While Lou explains to a guard how he wants his handicapped friend to swim, Andy needs to dive off diving boards and perform tricks. There are three boards to choose from and he needs to get back in his wheelchair before time runs out.</p></li><li><p>Sessex: Weight Watcher guide Marjorie runs around in a supermarket collecting cookies in a Pac-Man-style mini-game. The ghosts are represented by fatties she needs to avoid, but by picking up cake (similar to the original power pellets), she can take them out for a short time.</p></li><li><p>Slut: Letty has to squash all the frogs in her living room, making sure not to hit any other objects. Gameplay is similar to the Whac-A-Mole concept, except that the frogs jump around instead of popping up.</p></li><li><p>Old Haven: Emily, a real lady, needs to score a number of goals in a game of football (soccer) before time runs out. She needs to progress over the pitch step by step and avoid hitting the defenders as that returns her to the starting location. She does get points for shooting them in their private parts. The PSP version is slightly different as it is presented as a game of penalty kicks, without defenders. The direction and the force of the kick can be determined separately.</p></li><li><p>Pox: make matches of three identical items collecting food in Maggie's gullet as she gulps it down. Once it is full, she can spew out all the food over her friends at the party for extra points.</p></li><li><p>Llandewi Breffi: Dafydd Thomas is the only gay in the village and needs to prove it. He rides a bicycle through the streets and needs to collect copies of Gay Magazine while running down other people and slapping fake gays.</p></li></ul><p>The PSP version contains an additional game:* Flatley: help \"Eh Eh Eh\" Anne at the psychiatric institute to destroy the flowers in the garden. She can stamp them, pull them out, and then smash it or chuck it. She needs to avoid the men in white coats that chase after her. She can temporarily stun them by flashing them when she lifts her skirt.</p><p>Next to the games in the Tour, there are also Challenges where a mini-game needs to be replayed with a specific goal, a movie gallery where the unlocked clips can be viewed, and a highscore list. Aside from graphical differences, gameplay is largely identical across the platforms. The PSP version includes wireless multiplayer for up to two players.</p>"},{"name":"Little Busters!","year":2009,"developer":"Key Co., Ltd.","url":"sony_playstation2_l/Little%20Busters%21%20Converted%20Edition%20%28Japan%29.zip","filesize":3783545680,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Riki Naoe has lost both his parents when he was a child. His life started to have meaning only after he met a group of youngsters who called themselves \"Little Busters\", self-described as noble protectors of the weak who fights against evil. One day, Kyosuke Natsume, the leader of the group, asks Riki to find female candidates for an upcoming baseball game. As Riki begins to explore the school and talk to the inhabitants of the dormitories, he discovers that reality has been shifted, and nothing is what it seems...</p><p><em>Little Busters!</em> is a visual novel in which the player reads text superimposed on still anime-style images, and is occasionally prompted to make a decision, putting the storyline on one of the several possible paths. The characters in the game have statistics and sometimes fight each other. These fights are non-interactive, but they play a role in story development: if a character loses a fight, the player may want to change some of the choices made earlier, so that the character's statistics and subsequent outcome of the fight will be altered.</p>"},{"name":"Living World Racing","year":2007,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART13/Living%20World%20Racing%20%28Europe%29.zip","filesize":89933299,"score":"","genres":"Action > Racing / Driving > Behind view > Anime / Manga > Hovercraft > Off-roading > Track racing > Licensed","desc":"<p><em>Living World Racing</em> is a boat racing game with a cast of eight animals racing in the <em>Living World</em> universe, serving as an advergame.</p><p>It features three game modes (single race, time trial and challenge) and three difficulty levels (beginner, experienced and advanced) to choose from. As with many of the developer's games most of the content is locked from the start : for example only the four first characters can be chosen when you first start a game : Mr Mouse, Mr Hamster, Mr Rat and Mr Guinea Pig. Other characters, boats, tracks and race classes become available after collecting a number of stars.</p><p>The other power-ups are extra lives, power boosts and nutritious items, such as red donuts, green puffs or yellow triangles. Do not forget to \"drive\" over speed stripes to boost your boat, but also collect weapons. These are carrot missiles and pumpkin bombs. But if you use an invincibility shield, no one can use these weapons against you.</p><p>From the option menu, you can set up sound and music, but also controls and use 8 save slots. As a side feature of the game, the last menu choice gives pet information to kids : chinchillas, mice, Guinea pigs, ferrets, dwarf rabbits, rats, hamsters and rabbits.</p>"},{"name":"LMA Manager 2002","year":2002,"developer":"Hoodoo Studios","url":"PS2_COLLECTION_PART13/LMA%20Manager%202002%20%28Europe%29.zip","filesize":1311819850,"score":7.4,"genres":"Simulation > Sports > Diagonal-down > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>LMA 2002 is the third in the Playstation football management series, and also the first to be released for Playstation 2. The PS1 version features 8,000 players in 302 clubs, whilst PS2 expands this to 17,000 players in 722 clubs across the European leagues. Both platforms offer the choice of playing a full career or taking on one of 10 challenges, such as taking over the bottom-placed team mid-season and attempting to avoid relegation. Regardless of game mode, managers have access to detailed tactics and training settings, allowing you to work on players' weaknesses and build on their strengths.</p><p>The PS2 version lets you watch the full match in 3D, and both versions have a comprehensive highlights section, voiced on PS2 by real-life BBC analysts Gary Lineker and Alan Hansen.</p>"},{"name":"LMA Manager 2003","year":2002,"developer":"The Codemasters Software Company Limited","url":"PS2_COLLECTION_PART13/LMA%20Manager%202003%20%28Europe%29.zip","filesize":1497532545,"score":7.3,"genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p><em>LMA Manager 2003</em> is the 2002/03 season update of the best-selling football management game on console, and the first to be released on Xbox. You can manage any team from the 16 main leagues in England, Scotland, France, Germany, Italy or Spain. The 3D match engine allows you to watch the action unfold, and the interactive highlights let you analyse in detail after the game. Contains over 17,000 players at 720 clubs from 28 different countries.</p>"},{"name":"LMA Manager 2004","year":2004,"developer":"The Codemasters Software Company Limited","url":"PS2_COLLECTION_PART13/LMA%20Manager%202004%20%28Europe%29.zip","filesize":1841080621,"score":7.5,"genres":"Sports > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>The brand new game in the LMA Manager series. The game has over 18,500 players, 778 clubs, and 31 countries. Watch the matches in the 3D match section, and you can make your very own football club with the Fantasy Team mode. On the Xbox version of the game you can tell the team what to do with the Xbox Communicator. You may play as an English, French, German, Spanish, and an Italian team, and the game has all stats from the 2003/2004 season.</p><p>The game has two levels of difficulty and the AI staff can help with finance and training, just finance, or the player can handle everything themselves. The number of clubs is considerable, in the PS2 game they come from the following countries and leagues:* England - Premiership, Division 1, Division 2 and Division 3</p><ul><li>Scotland - Premiership, Division 1, Division 2 and Division 3</li><li>Italy - Serie a and Serie b</li><li>Spain - Primera DivisiÃ³n and Segunda DivisiÃ³n</li><li>Germany - Liga 1 and Liga 2</li><li>France - Division 1 and Division 2</li></ul>"},{"name":"LMA Manager 2005","year":2004,"developer":"The Codemasters Software Company Limited","url":"PS2_COLLECTION_PART13/LMA%20Manager%202005%20%28Europe%29.zip","filesize":1134228271,"score":7.1,"genres":"Simulation > Sports > 3rd-person (Other) > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>The 2005 edition of the LMA Manager franchise allows players to manage a soccer club from any of the top European leagues, including Holland and Portugal for the first time - or even create a team from scratch in Fantasy mode. You can also interact with the action in new ways - on PS2 you can take an Eyetoy photo to put yourself in the game, on Xbox you can shout instructions to your players via the communicator headset. Uniquely for an Xbox or PS2 soccer game, players can download updated rosters and stats during the season via the internet.</p>"},{"name":"LMA Manager 2006","year":2005,"developer":"The Codemasters Software Company Limited","url":"PS2_COLLECTION_PART13/LMA%20Manager%202006%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1973282917,"score":6.3,"genres":"Simulation > Sports > 3rd-person (Other) > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>LMA Manager 2006 adds further detail to the soccer management series, with more players, more clubs and more playable leagues than ever before. A more complex transfer market, additional player stats and 3D training matches allow for more sophisticated management than in previous years. You can also now create your own manager model and see yourself marching along the touchline during a match, being interviewed at press conferences, and picking up awards at the end of the season.</p><p>The game starts with the pre-season stats for August 2005 but there was a process whereby the player could update their game by downloading a mid season database which was saved onto their memory card. The game can be played with real clubs or a fantasy team, it has two levels of difficulty and the AI staff can help with finance &amp; training, just finance, or the player can handle everything themselves.  </p><p>The number of clubs is very extensive and covers the following countries and leagues:* England - Premiership, Championship, League one, League two and Conference</p><ul><li>Scotland - Premiership, Division 1, Division 2 and Division 3</li><li>Italy - Serie a and Serie b</li><li>Spain - Liga 1 and Liga 2</li><li>Germany - Liga 1, Liga 2, Regional Nord and Regional Sud,</li><li>France - Division 1, Division 2, National</li><li>Holland - Eredivisie and Eerstedivisie</li><li>Portugal - Supa liga and Liga de Honra</li></ul>"},{"name":"LMA Manager 2007","year":2006,"developer":"The Codemasters Software Company Limited","url":"PS2_COLLECTION_PART13/LMA%20Manager%202007%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1983434750,"score":6.5,"genres":"Simulation > Sports > Strategy > Diagonal-down > Text-based / Spreadsheet > Managerial / business simulation > Menu structures > Football (European) / Soccer > Licensed","desc":"<p><em>LMA Manager 2007</em> is a soccer management game in the LMA Manager series. Like its predecessors, the game allows players to manage a soccer team. Included are teams from over 50 different countries and leagues from 8 of those countries. Available are over a 1000 different officially licensed teams. The game features an improved database engine and a transfer system with more depth than its predecessors.</p><p>All matches can be watched in full 3D. The AI plays the matches out, but it is still possible to make adjustments to player positions and the like. It is also possible to see the results of matches and all kinds of player and team statistics in the ingame magazine \"FootballOne\".</p>"},{"name":"London Cab Challenge","year":2006,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART13/London%20Cab%20Challenge%20%28Europe%2C%20Australia%29.zip","filesize":72814192,"score":"","genres":"Action > Racing / Driving > Behind view > Arcade > Automobile > Vehicle simulator","desc":"<p><em>London Cab Challenge</em> is a racing/driving game similar to Crazy Taxi but using a British taxi cab.</p><p>Each \"mission\" involves picking up and delivering customers to their destinations as quickly as possible, all while staying in the proper lane and avoiding collisions with traffic. A green arrow appears on-screen as a direction guide, changing to red when the destination spot is within sight. A yellow arrow helps in navigation, warning when a direction can be hazardous. An on-screen speedometer displays how fast the cab is going at all times.</p><p>Missions increase in difficulty as the game progresses, and better drivers gain rewards that can be used to upgrade the cab. Scores are kept on a Ranking board.</p>"},{"name":"London Racer II","year":2002,"developer":"Davilex Games B.V.","url":"PS2_COLLECTION_PART13/London%20Racer%20II%20%28Europe%29.zip","filesize":262328539,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p><em>London Racer II</em> is another iteration in the prolific Racer series by Davilex. The races take place primarily in the streets of London and Edinburgh, with additional tracks in Las Vegas, New York and Chicago.</p><p>There are three single player modes available: Single Race, Tournament and Time Trial. In Single Race, the player is free to choose any of the 6 characters available, any of the tracks and any of the unlocked cars. In Tournament mode, the player races in a series of tracks while collecting money prizes and unlocking new cars. In both modes, players race against other racers while avoiding being caught by the police. In the Time Trial mode, players race against the clock trying to beat the best time for each track.</p><p>Each car (driven by a different character) has different stats in acceleration, top speed, handling, breaking and strength. The cars can also be upgraded using money collected from winning races and collecting money tokens during races. The cars also take damage when hit and can break into total loss if the damage bar is full. Repair tokens can be collected during races and if a car finishes a race damaged, it can be repaired before the next one using money. Nitro tokens can also be collected and bought, and the cars' colors can be changed.</p><p>There are also two split-screen two player modes: Duel and Cop vs. Driver. In the Duel mode, players race against each other in any given track. In Cop vs. Driver, one player is the cop and the other a regular racer, and the cop player must try to crash the driver within the time limit.</p><p>The game can be played from either first (hood camera) or third person (behind the car) perspective.</p>"},{"name":"London Racer: Destruction Madness","year":2005,"developer":"Davilex Games B.V.","url":"PS2_COLLECTION_PART13/London%20Racer%20-%20Destruction%20Madness%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":251377668,"score":5.2,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>London Racer Destruction Madness is an arcade race game in Davilex Racer series. This particular instalment is like the name implied more destructive than previous instalments.</p><p>The game features 12 environments spread across 10 European cities. Each environment has 5 tracks for a total of 60 tracks, which can all be played in 4 different time settings.</p><p>In these cities it is your task to cause as much mayhem and destruction as possible. Compete in races and take out your opponents so they will never reach the finish line, with a wide array of weaponry available. Or take on your opponents in a Destruction Derby style arena.</p><p>You can collect power-ups to visibly improve your car. Several new cars and tracks can be unlocked for a total of 19 vehicles. Cars show visible damage and street furniture can be demolished.</p>"},{"name":"London Racer: Police Madness","year":2005,"developer":"Davilex Games B.V.","url":"PS2_COLLECTION_PART13/London%20Racer%20-%20Police%20Madness%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":159003900,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>In this instalment of the London Racer series you play as the police. You have to arrest and ticket traffic offenders and illegal street racers.</p><p>You can perform all kinds of actions to reach your goals, such as: hanging out your window to shoot at criminals during high speed chases and scanning cars for offenders.</p><p>Available to the player is a range of police equipment and weaponry to assist him in his capabilities. The player can buy traffic cameras and other items to improve overview of the track.</p>"},{"name":"London Racer: World Challenge","year":2003,"developer":"Davilex Games B.V.","url":"PS2_COLLECTION_PART13/London%20Racer%20-%20World%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.zip","filesize":186081695,"score":5.5,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>This high speed racing game takes gamers on races across 18 cities around the world including London, Paris, Berlin, New York and Los Angeles.</p><p>Enhancements like nitro boosts emulate the sensation of speed. Compete in championship mode unlocking new cars and tracks. Race against lifelike A.I opponents in single player mode or challenge friends in the two player and multiplayer modes.</p><p>While racing you will have to try to lose the police and watch out for traffic, which you can use to your advantage in causing crazy accidents. Breaking through roadblocks and rules will help you win.</p><p>Gameplay is in the style of Midtown Madness.</p>"},{"name":"London Taxi: Rush Hour","year":2006,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART13/London%20Taxi%20-%20Rushour%20%28Europe%29.zip","filesize":61165715,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Real-time > Arcade > Direct control > Transport > Contemporary","desc":"<p><em>London Taxi: Rush Hour</em> is an arcade style racer where the player takes the role of a London taxi driver attempting to deliver passengers to their destinations within a short time limit while dodging traffic.</p><p>The entire game takes place in a stylised representation of London featuring winding streets and a variety of famous London landmarks around the map including the London Eye and Big Ben.</p><p>London Taxi: Rush Hour features three game modes: - Time Games - Earn as much money as possible within the time limit.- Money Games - Attempt to earn a target amount of money within a specified time limit.- Perfect Day - Transport as many passengers in a row as possible without failing.</p><p>The player begins the game with access to a traditional black London taxi cab and the ability to unlock an additional seven vehicles with points earned by completing the main game modes.A variety of power-ups are also strewn around the game map; these can clean the player's vehicle and extend the time limit for the current fare.</p>"},{"name":"Looney Tunes: Acme Arsenal","year":2007,"developer":"Red Tribe","url":"PS2_COLLECTION_PART13/Looney%20Tunes%20-%20Acme%20Arsenal%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1258431934,"score":4.7,"genres":"Action > 3rd-person (Other) > Arcade > Platform > Sci-fi / futuristic > Licensed","desc":"<p>In <em>Acme Arsenal</em>, an evil mad scientist named Dr. Frankenbeans has created a time machine and is bent on destroying the Looney Tunes world by traveling back in time and erasing their ancestors with an army of evil robots. The players takes control of Bugs Bunny, Daffy Duck, Tazmanian Devil, Foghorn Leghorn, Marvin the Martian and Gossamer in order to keep the mad scientist from erasing them from existence. The players will travel to Camelot, Ancient Egypt, Mars and the Wild West to name a few to fight off the mad scientist countless robot soldiers.</p><p>Each character has their own types of abilities, such as Foghorn Leghorn can use his fists while Taz can let out a deadly belch and Marvin the Martian can use swords against his enemies. There is also a weapon vending machine that can produce anything from freeze guns and shotguns, even mini-guns to more cartoonish-type like a bear-trap launching gun and the classic spring-loaded boxing glove.</p><p>The gameplay is very similar, jumping, punching, shooting, the basic 3-D platform type with the exception of the Wii with the ability to use the remote and nunchuk. The health system is the same, but the players can cycle through each character, if one character dies it will then switch to another until the list of characters is exhausted resulting the player to restart to the last checkpoint.</p><p>It does have a multiplayer option as well and basically are the same, but the Playstation 2 version has an exclusive level and skins for the characters.</p>"},{"name":"Looney Tunes: Back in Action","year":2003,"developer":"Warthog Games Ltd.","url":"PS2_COLLECTION_PART13/Looney%20Tunes%20-%20Back%20in%20Action%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3152765176,"score":6.5,"genres":"Action > 3rd-person (Other) > Platform > Licensed","desc":"<p>Bugs Bunny and Daffy Duck join forces in this Looney Tunes outing. Change between the two stars to overcome puzzles and hazards throughout this bright cartoon adventure to rescue all the Munkeys and recover the Blue Monkey Diamond from the ACME Chairman. Face other famous characters like Yosemite Sam, Elmer Fudd and Taz on this 3D platform game. There are 5 different locations in the game including the ACME film studio and the jungles of Africa. The mini-games along the way help make sure this game doesn't get boring and gives the game longevity.</p>"},{"name":"Looney Tunes: Space Race","year":2002,"developer":"Infogrames Melbourne House Pty Ltd.","url":"PS2_COLLECTION_PART13/Looney%20Tunes%20-%20Space%20Race%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":316969377,"score":7.1,"genres":"Racing / Driving > Behind view > Arcade > Track racing > Vehicle simulator > Sci-fi / futuristic > Licensed","desc":"<p>The classic characters of Looney Tunes come to life in <em>Space Race</em>. There are 9 legendary characters to choose from; including Bugs Bunny, Daffy Duck, Taz, Sylvester, Yosemite Sam, and more.</p><p>Riding high-powered ACME rockets, players will have to guide their chosen rider through 12 unique tracks from throughout the Looney Tunes universe, each with their own short-cuts, jumps and traps, in a frantic race for the finish line. </p><p>Along the way, the player will pick up many wacky distractions to slow down their opponents, including the portable hole, spring-loaded boxing gloves, falling elephants, and more. </p><p>One can even step the insanity up a notch, in some 4 player, split-screen action. That's all, folks!</p>"},{"name":"Lord of the Rings Collectie, The","year":2006,"developer":""},{"name":"Lord of the Rings, The: Aragorn's Quest","year":2010,"developer":"Tt Fusion Ltd.","url":"PS2_COLLECTION_PART13/Lord%20of%20the%20Rings%2C%20The%20-%20Aragorn%27s%20Quest%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":613514173,"score":"","genres":"Action > Role-playing (RPG) > Diagonal-down > Real-time > Fantasy > Licensed","desc":"<p>The handheld and PlayStation 2 version of <em>Aragorn's Quest</em> follows the same story as the eponymous console version: the story of Aragorn during the War of the Ring is narrated by Frodo's friend, Samwise Gamgee, who recalls the story to entertain his children who want to know about the adventures of the one known as Strider. In this version, however, the hobbits are only seen in cutscenes, and has no gameplay in the Shire, that serves as the game hub in the PlayStation 3 and Wii version of the game.</p><p>In game, the player takes control of Aragorn who fights orcs, trolls and other enemies using both his sword and his bow. Aragorn can block, use quick or strong sword attacks and shoot arrows and charge his bow for more powerful attacks. He can also use a variety of special moves, many of which are acquired as the game progresses. Defeating foes replenishes some health, and gives experience points and morale. Aragorn's morale is depleted by using some special moves. As in most RPGs, gaining experience results in leveling-up, which improve Aragorn's stats and rewards the player with points to use to learn previously acquired special moves. Pieces of equipment such as swords and belts can be equipped to increase Aragorn's prowesses.</p><p>This version does not have cooperative play, but has an Arena mode.</p>"},{"name":"Lord of the Rings, The: The Fellowship of the Ring","year":2002,"developer":"Surreal Software, Inc.","url":"PS2_COLLECTION_PART13/Lord%20of%20the%20Rings%2C%20The%20-%20The%20Fellowship%20of%20the%20Ring%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2937871157,"score":6.3,"genres":"Role-playing (RPG) > 3rd-person (Other) > Diagonal-down > Isometric > Action RPG > Puzzle elements > Fantasy > Licensed","desc":"<p>Based on the legendary novels by the late JRR Tolkien, you take control of the Fellowship as they follow a path of evil to the steps of Mount Doom, in order to cast the One ring of Sauron back into the depths of the volcano, in turn destroying the evil that lies within it. This first in a trilogy follows Frodo and the fellowship as they begin their journey to Mount Doom, only to find that what lies ahead may be too much to handle.</p><p>The Xbox version, a 3rd person adventure, has you scaling the lands of middle earth in real time combat with a host of evil creatures to find your way past. Along the way, you will come across familiar characters that will aid or hinder your progress.</p><p>Unlike the movie trilogy, this adaption of the tale includes characters not seen on the big screen, including Tom Bombadil and others, as well as including many of the songs written by Tolkien as puzzles.</p>"},{"name":"Lord of the Rings, The: The Return of the King","year":2003,"developer":"Electronic Arts Redwood Shores Studio","url":"PS2_COLLECTION_PART13/Lord%20of%20the%20Rings%2C%20The%20-%20The%20Return%20of%20the%20King%20%28Europe%29%20%28En%2CNl%2CPt%2CSv%2CPl%29.zip","filesize":1910747090,"score":7.8,"genres":"Action > Behind view > Hack and slash > RPG elements > Fantasy > Licensed","desc":"<p>The Lord of the Rings: Return of the King video game again puts the fate of middle-earth in the hands of the gamer.  In the last installment of the movie trilogy, destroy the Ring by casting it into the Crack of Doom, which frees Middle Earth from Dark Lord Sauron.</p><p>Return of the King's third person gameplay allows immersive action set in rich, interactive levels.  The new game also features an all new co-op multiplayer mode which lets players form their own Fellowship and eight playable characters like Gandalf, Aragorn, Legolas, Gimil, Sam and Frodo all played out by thier actual actors from the films, battle vicious boss monsters like Shelob and the final showdown with Dark Lord Sauron, all backed up by Academy Award winner Howard Shore.</p>"},{"name":"Lord of the Rings, The: The Third Age","year":2004,"developer":"Electronic Arts Redwood Shores Studio","url":"PS2_COLLECTION_PART13/Lord%20of%20the%20Rings%2C%20The%20-%20The%20Third%20Age%20%28Europe%29%20%28En%2CNl%2CPt%2CSv%2CPl%29.zip","filesize":3415581958,"score":7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Behind view > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Licensed","desc":"<p>Unlike the  Game Boy Advance version of the game, the console version of The Lord of the Rings:The Third Age introduces entirely new characters which aren't mentioned in the books or movies. The game does relate to the movies by including scenes from all three movies, with new background speech by Ian McKellen (Gandalf).</p><p>There are seven playable characters in the game which have been created specifically for it, as well as small appearances by characters such as Gandalf, Aragorn, Eowyn, Faramir, and Gothmog.</p><p>The game covers events in all three movies/books, mostly with references to major events shown through cut scenes, or the scenes from the movies with Ian McKellen's narration.</p><p>A classic RPG game, The Lord of the Rings: The Third Age has gameplay elements similar to Final Fantasy, where you have a party of characters, each with a different set of skills and attributes, who gain levels, making them stronger as the game progresses. Battles are turn-based, and let the gamer make different decisions on what they want to do to change the outcome of the battle. The game travels through many areas throughout Tolkien's Middle Earth, including The Pelennor Fields and Moria.</p>"},{"name":"Lord of the Rings, The: The Two Towers","year":2002,"developer":"Stormfront Studios","url":"sony_playstation2_l/Lord%20of%20the%20Rings%2C%20The%20-%20The%20Two%20Towers%20%28Europe%2C%20Australia%29%20%28En%2CNl%2CSv%29.zip","filesize":2857477747,"score":7.6,"genres":"Action > 3rd-person (Other) > Cinematic camera > Hack and slash > Fantasy > Licensed","desc":"<p>Electronic Arts' first game based on the Lord of the Rings movies is an action game with classic beat'em up-style gameplay. Despite the title, it covers events from both the first and the second film in the trilogy.</p><p>Players, choosing to control Aragorn, Legolas or Gimli, must battle the evil forces of the Dark Lord Sauron in order to protect the Ring of Power and restore peace to Middle-earth. </p><p>The player character moves through the levels, fighting hordes of Orcs, Goblins and other creatures with various attack and parrying moves. The more varied the attacks are and the less the player is hit, the more points are awarded for each kill. At the end of each level, kill points are accumulated and can be used to gain new abilities. Most of these are new attack moves, unleashed through various button combinations. Others increase health or upgrade the strength or speed of existing attacks. Each of the three characters has unique upgrades and moves.</p><p>Several levels feature boss battles with the likes of the Watcher of Moria or Lurtz, leader of the Uruk-hai. Each boss requires a unique strategy to defeat.</p><p>Most combat scenes from the movies have been turned into levels for the game: from the confrontation with the Ringwraiths at the Weathertop and the battle in the Mines of Moria from the first film to fights with Warg-riders and other enemies on the plains of Rohan from the second film. The game culminates in the defense of Helm's Deep, even though the depiction of the battle in the game differs considerably from that in the film.</p><p>Between the levels, cutscenes tell the story. These scenes combine actual film footage with footage rendered with the game engine.</p><p>The game offers lots of bonus content, some of which must be unlocked by completing missions or reaching certain levels with the characters. Featured are interviews with the filmmakers and actors (who also provide voices for the game) as well as various making-of features.</p>"},{"name":"Los Simpson: El Video Juego (EdiciÃ³n Limitada)","year":2007,"developer":""},{"name":"Lost Aya Sophia","year":2004,"developer":"Idea Factory Co., Ltd.","url":"sony_playstation2_l/Lost%20Aya%20Sophia%20%28Japan%29.zip","filesize":841116607,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Fantasy","desc":"<p>The protagonist of the game, Yuuji Oguma, is having a strange dream lately. He's dreaming of someone being surrounded by the flames. Not really sure what to think about this recurring dream, one day he meets a girl in town, Mary, who tells him that his soul has been possessed by the devil. Yuuji is a student in a religious school, and just as the next semester begins, he realizes that the girl he met in town just transferred to this school. Together, the two of them start to get involved in solving the mystery. The game plays as a typical visual novel where choices affect the path of the story and your character's personality, which may lead to one of the two different ending.</p>"},{"name":"Lost Passage: Ushinawareta Issetsu (Shokai Genteiban)","year":2003,"developer":"","url":"sony_playstation2_l/Lost%20Passage%20-%20Ushinawareta%20Issetsu%20%28Japan%29%20%28Shokai%20Genteiban%29.zip","filesize":839233019,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition release includes:</p><ul><li>Lost Passage: Ushinawareta Issetsu game</li><li>Princess Magazine, extra version</li></ul>"},{"name":"Lotus Challenge","year":2001,"developer":"Kuju Entertainment Ltd.","url":"PS2_COLLECTION_PART13/Lotus%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":478172178,"score":6,"genres":"Racing / Driving > Simulation > Behind view > Licensed","desc":"<p>First game of new millennium to be officially licensed by Group Lotus Plc. A British company famous for their racing and sports cars notable appearances in earlier games include James Bond: The Spy Who Loved Me starring Roger Moore and Lotus: The Ultimate Challenge.</p><p>Features 42 cars spanning the companyâ€™s history covering: Formula One era (1962 Type 25, 1978 Type 79T to 2001 Formula Lotus), Classic era (1957 Seven S1 to 1986 Excel SE) to modern sports cars (1964 Competition Elan, 1980 E-spirit S2 to new Elise), and two concept cars designed by Lotus Engineers. Each virtual Formula One car is based on actual Team Lotus accomplishments, and other models were thoroughly tried by actual Lotus test drivers. A brief corporate history is also provided in the game.</p><p>â€œChallengeâ€ mode begins on â€˜Lotus test trackâ€™ beat best lap time to qualify, then select a character from fictional Lotus Challenge team in story based contest a mixture of World Series Championship racing circuits, stunt driving, and one-on-one races. Each completed segment is â€˜unlockedâ€™. â€œCollectionâ€ mode gives playersâ€™ access to every car and track â€˜unlockedâ€™. â€œChampionshipâ€ mode involves seven different championship classes of Classic cars to Super cars, only two of these can be used, as others must be â€˜unlockedâ€™ to play. â€œSingleâ€ mode lets you play a quick game of up to 15 laps of any event, challenges, stunts, and races that is â€˜unlockedâ€™.</p><p>Twenty circuits across various locations from city, speedway to custom circuits: Trafalgar Square or Buckingham Palace in London, Arizona Yuma County Speedway, Florida Jupiter Beach to Tokyo Bay Tunnel in either day or night with set weather conditions like sunny, fog, rain or snow. Circuits range from flat terrain, navigating sharp hairpins to steep hill climbs. Diversions include nine special events, four stunt sequences and nine different challenges â€“ stunts on Hollywood movie set or advertisements to car football; tasks like fleeing the paparazzi in approaching traffic to transporting against time a pregnant woman to hospital before delivery. Official Lotus test drivers offer advice on undertaking individual courses.</p><p>A variety of options are available from transmission controls, driving aids, and opponent skill to degree of vehicle damage ranging in minimum windows or headlights breakage to total bodywork and engine destruction from minor or major indentation, scraping to separable tires. </p><p>In game visuals provide information on current ranking in comparison to other drivers, laps completed and remaining, overall circuit map, transmission setting, relevant times for present to entire race time, Speedo and revs counter, three tags for anti-lock braking system, traction control and assisted steering.</p><p>Selected multi-player games have access to hidden cars and circuits that can be â€˜unlockedâ€™ by finishing agreed single or championship race.</p>"},{"name":"Love Doll: Lovely Idol (Shokai Genteiban)","year":2005,"developer":""},{"name":"Love Hina Gorgeous: Chiratto Happening!!","year":2003,"developer":"Konami Computer Entertainment Japan Co., Ltd.","url":"sony_playstation2_l/Love%20Hina%20Gorgeous%20-%20Chiratto%20Happening%21%21%20%28Japan%29.zip","filesize":770868135,"score":"","genres":"Adventure > 1st-person > 3rd-person (Other) > Anime / Manga > Mini-games > Licensed","desc":"<p><em>Love Hina Gorgeous</em> is an adventure which puts you in the shoes of the only male protagonist in the series, Keitaro Urashima, who is trying to get into college while at the same time performing his duties as the dorm manager. He need to improve his grade if he's ever going to get a chance to get into a college of his choice, a University of Tokyo. Taking care of a girls only dormitory won't help him achieve his goal, quite the contrary, it may lead him into many troubled situations and misadventures. Adventure mode plays in a sort-of visual novel fashion with limited time for certain choices while exploration mode lets you explore the locations in third person using the cursor to interact with items and characters around you. There are also various action event sequences which comprise of various mini-games as well as studying portion of the game which requires you to answer questions correctly and level up your character skills. Additionally, the main menu includes a bonus album containing gallery of CG events and artwork which can be seen after encountering them in the story mode.</p>"},{"name":"Love Smash! 5: Tennis Robo no Hanran","year":2003,"developer":"HuneX Co., Ltd.","url":"sony_playstation2_l/Love%20Smash%21%205%20-%20Tennis%20Robo%20no%20Hanran%20%28Japan%29.zip","filesize":824868868,"score":"","genres":"Sports > 3rd-person (Other) > Anime / Manga > Arcade > Tennis","desc":"<p><em>Love Smash! 5</em> is a sequel to the budget tennis game Love Smash!. Once again, a secret underground organization has brought together the world's greatest tennis players, though this time they all happen to be attractive young women. In addition to the story mode, there is also an Exhibition mode for one or two players. While the game plays quite similarly to the original title, the option to play Doubles has been removed.</p><p>This sequel brings the total character count to 12, including two secret characters, each with their own stats and special moves. There are four different courts, all of them highly-unorthodox. There is a specific focus on the female characters, as each has multiple unlockable outfits and full CG ending movies. There is also a \"photo gallery\" that includes images of each character, and a model viewer where each character's animations can be viewed from any angle.</p><p>The game was re-released in 2005 as <em>Love Smash! 5.1</em> as part of the Simple 2000 Ultimate series. This version features updated character models and minor gameplay tweaks, but is otherwise identical.</p>"},{"name":"Love Smash!: Super Tennis Players","year":2002,"developer":"HuneX Co., Ltd.","url":"sony_playstation2_s_part2/Simple%202000%20Series%20Ultimate%20Vol.%201%20-%20Love%20-%20Smash%21%20%28Japan%29.zip","filesize":145864779,"score":"","genres":"Sports > 3rd-person (Other) > Anime / Manga > Arcade > Tennis","desc":"<p><em>Love Smash!</em> is a basic tennis game for one to four players. A secret underground society has assembled eight of the greatest players in the world to compete for fame and fortune. The game features both Tournament (story) and Exhibition modes and offers both Singles and Doubles play.</p><p>There are eight characters to choose from, plus two hidden unlockable characters, each with their own abilities and signature special move, as well as a variety of costumes to unlock. A total of eight different courts are available, ranging from traditional stadiums to outlandish locales such as an army base, construction site, and mountain top.</p>"},{"name":"Love Songs Adv: Futaba Riho 14-sai - Natsu","year":2004,"developer":"HuneX Co., Ltd.","url":"sony_playstation2_l/Love%20Songs%20-%20ADV%20Futaba%20Riho%2014-sai%20-%20Natsu%20%28Japan%29.zip","filesize":1631224862,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>First visual novel adventure game in the <em>Love Songs</em> franchise which focuses on one of the idols, namely Riho Futaba (åŒè‘‰ ç†ä¿), during her second year as a junior high-school student. Riho has been active in the entertainment industry since she was only 4 years old, but after being involved in an unfortunate kidnapping incident, she retired from the entertainment world and went to live in a small rural town in the island of Kyushu. The player takes a role of a rookie manager working at a talent scouting agency, looking for the next new talent. While there are many girls you will interact with, the focus of the story will be Riho once you get to meet her. However, persuading her to return to the entertainment scene might prove difficult due to her traumatic experience she has undergone as a child.</p><p>Most of the basic visual novel gameplay elements are present, from message log to fast forwarding. Characters feature lip-syncing during regular conversations, but remain still during CG event scenes. On screen text does can't be toggled off, but there's a brief delay when changing to a new scene before the on-screen text appears which shows the clear background image. Occasionally, characters appear in small window images showing only animated portraits instead of full body images, depending on the scene. All the NPCs in the game, heroines and side characters, feature full voice-acting.</p><p>The game release includes a thick booklet which features an introductory comic and a couple of pages dedicated to making-of sketches of the heroines from the game.</p>"},{"name":"Love Songs: Idol ga Classmate","year":2001,"developer":"HuneX Co., Ltd.","url":"sony_playstation2_l/Love%20Songs%20-%20Idol%20ga%20Classmate%20%28Japan%29.zip","filesize":2587048839,"score":"","genres":"Adventure > Simulation > 1st-person > 3rd-person (Other) > Anime / Manga > RPG elements > Romance","desc":"<p><em>Love Songs</em> is a dating simulation and adventure game with a setting in high-school. You are an unnamed high-school student (you create your character profile before starting the game) and your high-school is holding a performing arts course. And it just so happens that a currently popular idol, Ayano Seto, enrolled as a student here and ends up as one of your classmates.</p><p>The game takes place over three-year high-school period until graduation day. During that time you can perform various school and extracurricular activities to upgrade your character stats. You can study, train, sleep, work a part-time job to earn money, ask girls on a date and more. You can also write and receive love e-mails on your computer. Your goal is to become popular among the girls, and that means you must study hard, earn money, keep your body in shape, be fashionable, and know what to say while on a date with the girl that peeks your interest.</p>"},{"name":"Love Songs: Idol ga Classmate (Shokai Gentei Box Type A: Seto, Mizuki Version)","year":2001,"developer":"HuneX Co., Ltd.","url":"sony_playstation2_l/Love%20Songs%20-%20Idol%20ga%20Classmate%20%28Japan%29%20%28Shokai%20Gentei%20Box%29.zip","filesize":2587049097,"score":"","genres":"Special edition > Physical extras","desc":"<p>This First Print Limited Box package comes in three different package types marked as Type A, Type B, and Type C.</p><p>Type A package contains:* Love Songs: Idol ga Classmate</p><ul><li>Type A style limited edition design package featuring Ayano Seto and Yuka Mizuki</li><li>Type A music CD</li><li>Type A style limited edition desktop clock</li></ul><p>Type B package contains:* Love Songs: Idol ga Classmate</p><ul><li>Type B style limited edition design package featuring Riho Futaba, Minako Sakurai and Arisu Kagura</li><li>Type B music CD</li><li>Type B style limited edition desktop clock</li></ul><p>Type C package contains:* Love Songs: Idol ga Classmate</p><ul><li>Type C style limited edition design package featuring Ryoko Tachibana, Kana Momozono and Miyu Amagi</li><li>Type C music CD</li><li>Type C style limited edition desktop clock</li></ul>"},{"name":"Lowrider","year":2002,"developer":"Runtime, Inc.","url":"sony_playstation2_l/LowRider%20-%20Round%20the%20World%20%28Japan%29.zip","filesize":552650268,"score":"","genres":"Simulation > 3rd-person (Other) > Arcade","desc":"<p><em>Lowrider</em> is a digital recreation of one of the US' most popular automotive subcultures, in which classic cars are lowered to the ground, fitted with hydraulics, and painted up in all manner of flashy colors and liveries. Pick from 18 different cars and show your skills at hopping, pancaking, juggling, and several other maneuvers in a contest against either the computer or another player. The game also includes a custom paint feature, as well as a soundtrack consisting of either southern crunk (in the US release) or Japanese hip-hop music (in the Japan release).</p>"},{"name":"Lucinda Green's Equestrian Challenge","year":2006,"developer":"IR Gurus Interactive Pty Ltd.","url":"PS2_COLLECTION_PART13/Lucinda%20Green%27s%20Equestrian%20Challenge%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":353296030,"score":"","genres":"Sports > 3rd-person (Other) > Horse / derby > Licensed","desc":"<p>Equestrian Challenge is an horse riding game based on three-day eventing: Show Jumping, Cross Country, and Dressage.</p><p>The player begins as a young rider at the two-star level who is taken under the wing of Lucinda Green, one of the world's most accomplished eventing riders, who trains them and their horse to reach three and four-star competitive events.</p><p>These competitive events take place at our officially licensed event locations: Adelaide, Kentucky, Badminton, and Burghley.</p><p>The playerâ€™s horse must be cared for at home in the paddock to make sure it's fed, watered, groomed, and happy.  The player is also able to develop the horseâ€™s stats (Speed, Stamina, Jumping, Agility, Trust) by winning events and progressing through the game.</p><p>At the four star-level, the player must compete against some of the world's top riders, including: Polly Stockton, Mary King, Phillip Dutton, William Fox-Pitt, Andreas Dibowski, Wendy Schaefer, Caroline Powell, Jan Thompson/Byyny, Andrew Scott, Megan Jones, Dirk Schrade, Clayton Fredricks, Karren Oâ€™Connor, Nick Gaulett, Darren Chiaccia, and David Oâ€™Connor.</p><p>During the game the player wins hundreds of unlockables, including: clothes, ribbons and prizes.  Some of these are used to improve your performance in subsequent events, others as awards for winning competitions.</p><p>With Lucinda Green's guidance, the ultimate goal is to win all four four-star events at Adelaide, Kentucky, Badminton, and Burghley.</p>"},{"name":"Lucky Star - Ryouou Gakuen Outousai","year":2008,"developer":"VRIDGE Inc.","url":"sony_playstation2_l/Lucky%20Star%20-%20Ryouou%20Gakuen%20Outousai%20%28Japan%29.zip","filesize":2060357554,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Comedy > Licensed","desc":"<p><em>Lucky Star: Ryouou Gakuen Outousai</em> is a visual novel adventure game based on the <em>Lucky Star</em> manga and anime series. Character art is more comic-style, while the gameplay is that of a typical visual novel, consisting of on-screen dialogue text with character still over background images. The game contains various unlockable bonuses accessible via main menu, such as CG gallery, music player, and more.</p>"},{"name":"Lucky Star - Ryouou Gakuen Outousai (DX Pack)","year":2008,"developer":"","url":"sony_playstation2_l/Lucky%20Star%20-%20Ryouou%20Gakuen%20Outousai%20%28Japan%29%20%28DX%20Pack%29.zip","filesize":2060357365,"score":"","genres":"Special edition > Physical extras","desc":"<p>This special edition release includes:</p><ul><li>Lucky Star: RyÅÅ Gakuen ÅŒtÅsai game</li><li>Ryouou campus school uniform</li><li>Ryouou campus school designated guide</li><li>Ryouou campus school designated nameplate</li><li>Lucky Star collection poster set</li><li>Strap pendant</li></ul>"},{"name":"Lumines Plus","year":2007,"developer":"Q ENTERTAINMENT, Inc.","url":"PS2_COLLECTION_PART13/Lumines%20Plus%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1625569267,"score":8.5,"genres":"Puzzle > Real-time > Falling block puzzle > Music / rhythm","desc":"<p>A puzzle game in which the goal is to place as many 2-color falling blocks (a la Tetris) on the playing field in like-colored blocks in order to wipe it clean.  During play, a timeline crosses the field from left to right, clearing and counting up your matches.  The more matches you make before the timeline wipes them clean, the bigger the combo multiplier towards your score.</p><p>As you progress through the game, Lumines will reward you with new \"skins\" which completely change the graphics, sound effects and music during play.</p><p>In \"puzzle\" mode, you stack the blocks in order to create the various shapes that you are shown.</p><p>Lumines also lets you play against the CPU or wirelessly against another player on the PSP.</p><p>The 2007 PS2 port is completely identical to the PSP version, except for some new skins.</p>"},{"name":"Lupin Sansei: Colombus no Isan wa Ake ni Somaru","year":2004,"developer":"NexTech Corporation","url":"sony_playstation2_l/Lupin%20Sansei%20-%20Columbus%20no%20Isan%20wa%20Ake%20ni%20Somaru%20%28Japan%29.zip","filesize":3135086818,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Shooter > Stealth > Spy / espionage > Licensed","desc":"<p>Master thief Lupin the Third is after yet another high-value target: the ship's log from Christopher Colombus' famous voyage to the New World. It's scheduled to go up for bidding at the St. Mary Charity Auction taking place on the top floor of Gable Tower, an incredibly secure high-tech fortress. Of course, such defenses are but a trifle for Lupin and his partners, right?</p><p><em>Lupin Sansei: Colombus no Isan wa Ake ni Somaru</em> (\"Lupin the Third: The Inheritance of Colombus is Dyed in Vermilion\") is the second PS2 game based on the popular <em>Lupin the Third</em> anime franchise, after Treasure of the Sorcerer King. Like its predecessor, it is once again a third-person action game with a heavy focus on stealth and disguises. Lupin can use a variety of weapons including his trusty P38 pistol, as well as steal items and outfits from enemies and disguise himself to avoid detection.</p><p>At certain points, the player can also take control of Lupin's teammates. Fujiko's sections are similar to Lupin's, except rather than stealing disguises she can use her feminine wiles to charm enemies into giving her information. Jigen's sections consist of on-rails shooting, while Goemon's consist of basic sword-slicing action.</p>"},{"name":"Lupin Sansei: Lupin ni wa Shi o, Zenigata ni wa Koi o","year":2007,"developer":"NEX Entertainment Co., Ltd.","url":"sony_playstation2_l/Lupin%20Sansei%20-%20Lupin%20ni%20wa%20Shi%20o%2C%20Zenigata%20ni%20wa%20Koi%20o%20%28Japan%29.zip","filesize":2839347475,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Shooter > Stealth > Spy / espionage > Licensed","desc":"<p>After receiving a message from his on-again off-again love interest Fujiko Mine, master thief Lupin the Third has just arrived in the ancient city of Canghai along with his partners Jigen and Goemon. However, when they arrive at the meeting point, a mafia boss named Kouring shows up, demanding Lupin's cooperation in exchange for Fujiko's life. Of course, Lupin is having none of that, and tries to rescue Fujiko himself, but winds up cursed by an ancient black art, which will kill him in three days. Ancient documents that Fujiko found show that the Cang dynasty treasure she's looking for may also hold the key to curing Lupin's curse. But with only three days, will they be able to find the treasure and save Lupin's life?</p><p><em>Lupin Sansei: Lupin ni wa Shi o, Zenigata ni wa Koi o</em> (\"Lupin the Third: Lupin is Dead, Zenigata is in Love\") is the third and final PS2 game based on the popular <em>Lupin the Third</em> anime franchise. There is less of a focus on stealth compared to the previous titles, but it is still possible to use disguises to sneak past and glean information from enemies. The player also controls Jigen, Goemon, and Fujiko at certain points, each with their own unique game style. The player also takes control of Inspector Zenigata in some chapters, a first for the series. At certain points, Lupin and Zenigata must actually work together to escape or defeat enemies.</p>"},{"name":"Lupin the 3rd: Treasure of the Sorcerer King","year":2002,"developer":"","url":"sony_playstation2_l/Lupin%20the%203rd%20-%20Treasure%20of%20the%20Sorcerer%20King%20%28USA%29.zip","filesize":1569203445,"score":7,"genres":"Action > 1st-person > 3rd-person (Other) > Anime / Manga > Puzzle elements > Stealth > Detective / mystery > Licensed","desc":"<p><em>Lupin the 3rd: Treasure of the Sorcerer King</em> is a stealth action game putting players in the role of anime legend Lupin the 3rd. Together with Jigen and Goemon, Lupin seeks to steal valuable treasures out from under Inspector Zenigata's nose. Players have access to Lupin's wide array of gadgets and disguises, which allow him to pass by guards unnoticed or to get close enough to pick their pockets.</p><p>The game plays like an arcade answer to Metal Gear Solid or Splinter Cell. The game also has puzzles in the classic Resident Evil mode. It plays out from a third-person perspective with a first-person free look option.</p>"},{"name":"Luxor: Pharaoh's Challenge","year":2007,"developer":"MumboJumbo, LLC","url":"PS2_COLLECTION_PART13/Luxor%20-%20Pharaoh%27s%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":115336353,"score":6.5,"genres":"Puzzle","desc":"<p>A Thrilling Egyptian Action-Puzzle Adventure!</p><p>Embark on a thrilling adventure through the lands of ancient Egypt in the latest installment of the hit LUXOR series. Enjoy 88 gorgeously-rendered levels of brilliantly crisp and stunning graphics portraying pyramids, temples and many more of Egyptâ€™s amazing marvels. Guide your mystical winged-shooter, swooping back and forth, as you destroy an onslaught of magical spheres before they reach the pyramid lying at the end of their path. To help eliminate enemy spheres, LUXOR: Pharaohâ€™s Challenge features more explosive power-ups than ever before!</p><p>* Prove your expertise by earning 25 spectacular skill badges<br>* Ranking system progressively increases power-up effectiveness<br>* 13 powerful blessings can be activated to make any level manageable</p>"}]