[{"name":"Naked Brothers Band, The: The Video Game","year":2008,"developer":"Barking Lizards Technologies L.L.C."},{"name":"Namco Classic Fighter Collection","year":2008,"developer":"Namco Limited"},{"name":"Namco Museum","year":2001,"developer":"Mass Media, Inc.","url":"sony_playstation2_n/Namco%20Museum%20%28USA%29.zip","filesize":76224883,"score":6.9,"genres":"Compilation","desc":"<p>A total of 12 games are offered in <em>Namco Museum</em>: </p><ul><li>Pac-Man</li><li>Pac-Man Arrangement</li><li>Galaga</li><li>Galaga Arrangement</li><li>Dig Dug</li><li>Dig Dug Arrangement</li><li>Pole Position</li><li>Pole Position II</li><li>Ms. Pac-Man</li><li>Galaxian</li><li>Pac-Attack</li><li>Pac-Mania</li></ul><p>The only game not originally from the arcades is <em>Pac-Attack</em>, released on the Genesis and the SNES in 1993 and for the first time since their arcade days, Pac-Man Arrangement, Galaga Arrangement and Dig Dug Arrangement are ported to the home console.</p><p>Everything is exactly the same as the original arcade versions, including the music, cut scenes, graphics, and even the many graphical errors that appear.</p>"},{"name":"Namco Museum: 50th Anniversary","year":2005,"developer":"Namco Limited","url":"PS2_COLLECTION_PART15/Namco%20Museum%2050th%20Anniversary%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":255411469,"score":6.3,"genres":"Compilation","desc":"<p>Namco is honoring its 50th anniversary by releasing this compilation of arcade classics. Using a retro interface, you check out a virtual arcade hall where you can select each classic in its original arcade cabinet.</p><p>Exclusive to the Xbox version are Live Leaderboards where you can post high-scores.</p><p>The 16 games included are:</p><ul><li>Pac-Man</li><li>Ms. Pac-Man</li><li>Galaga</li><li>Galaxian</li><li>Dig Dug</li><li>Pole Position</li><li>Pole Position II</li><li>Rolling Thunder</li><li>Rally X</li><li>Bosconian</li><li>Dragon Spirit</li><li>Sky Kid</li><li>Xevious</li><li>Mappy</li><li>Galaga '88 (unlockable)</li><li>Pac-Mania (unlockable)</li></ul>"},{"name":"Namco x Capcom","year":2005,"developer":"Monolith Software, Inc.","url":"sony_playstation2_n/Namco%20x%20Capcom%20%28Japan%29.zip","filesize":1206823413,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Isometric > Anime / Manga","desc":"<p>Set in the year 20XX, a space-time distortion dubbed \"Yurigi\" has been appearing throughout the world. Join Reiji and Shaomu, members of the Shinra organization as they attempt to solve the mysteries of the Yurigi distortions and the paths it creates into the alternate Namco and Capcom worlds.</p><p>Gameplay is traditional SRPG fare. A squad of units is placed on an isometric battlefield where they battle against an AI-controlled squad of units. The quirk here lies in the battles that take place when units attack each other. At this point, the game switches to a 2D-side view reminiscent of classic fighting games. Here, using menu commands and fighting-game style button inputs, battles take place between the two units. Special moves and combos unique to each character are available and are often showcased with hand-drawn artwork of the characters.</p>"},{"name":"Nanatsuiro Drops Pure!!","year":2007,"developer":"Unison Shift","url":"sony_playstation2_n/Nanatsuiro%20Drops%20Pure%21%21%20%28Japan%29.zip","filesize":3143212020,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Fantasy","desc":"<p><em>Nanatsuiro Drops Pure!!</em> is a PlayStation 2 port of a PC (Windows) adult visual novel by the name Nanatsuiro Drops. In addition to adult content being tuned down and rating level reduced, this port features more characters, new numerous CG events and expanded story, theme track done for each character, and renewed opening movie.</p>"},{"name":"Nano Breaker","year":2005,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"PS2_COLLECTION_PART15/Nanobreaker%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2699021924,"score":5.2,"genres":"Action > 3rd-person (Other) > Hack and slash > Post-apocalyptic > Sci-fi / futuristic","desc":"<p><em>Nano Breaker</em> is a hack-n-slash game that has the user take control of an experimental cyborg. In the future, Nanomachines have rebelled against mankind and has taken control of humans, turning them into horrible half-machines/half-human creations, bent on delivering Armageddon to humans. The player must stop them at all costs.</p><p>The gameplay is basic, travel through levels, hack at enemies using button mashing combos, facing bosses at the ends of the levels. The main weapon of choice is a Plasma Blade which has the ability to change shape. It also has a Time Attack mode along with the standard Story mode.</p>"},{"name":"NARC","year":2005,"developer":"Point of View, Inc.","url":"sony_playstation2_n/Narc%20%28USA%29.zip","filesize":1444239206,"score":5,"genres":"Action > Behind view > Fighting > Shooter > Stealth > Direct control > Detective / mystery","desc":"<p><em>NARC</em> is a 3rd-person shooter that has the player tracking the distribution of the deadly new narcotic \"Liquid Soul\" across two different cities in Asia and the U.S.A. The player controls one of two characters - Narcotics detective Jack Forezenski (voiced by Michael Madsen), or D.E.A. agent Marcus Hill (voiced by Bill Belamy). Both are led by Narcotics chief Joe Kowalski (voiced by Ron Pearlman), and the player switches between the two as the story unfolds.</p><p>As an undercover cop, players are free to roam the streets and dispense justice at their discretion. Aside from storyline missions, players can encounter 12 types of randomized street crimes and stop them to boost their \"badge rating\" (loosely, a measure of their trust within the police). Players can likewise flash their badge around to cause perps to surrender or run. Criminals that resist must be beaten in a small \"struggle\" minigame to get cuffed. Players can also arrest alleyway drug dealers and deposit their drugs safely at the station.</p><p>Alternatively, the player can beat up drug dealers for their cash and stash, then sell the drugs to civilians for income. The player can also use the drugs themselves for temporary beneficial effects (ecstasy keeps enemies from attacking, speed makes you run and shoot faster, etc.) at the cost of badge points and the potential to become addicted. Excessive use of force against innocent civilians, or selling drugs to other undercover cops, result in major losses of badge points.</p><p>Players have a maximum badge rating of 100. If it drops below 49, they are demoted to Patrolman and cannot take new story missions. The player must roam the streets in their police blues and stop enough random crimes to be moved back to Narcotics. If the player's rating drops below 24, they are kicked off the force and rendered jobless. Jobless players cannot fight or shoot weapons without attracting police attention. Further drops in rating cause the player to be wanted by the police, with a rating of 5 or lower spawning officers specifically to shoot or arrest the player.</p><p>There are 25 hidden drug stashes in each city. Finding all of them will unlock the original N.A.R.C. arcade game for play.</p>"},{"name":"Naruto Shippuden: Ultimate Ninja 4","year":2007,"developer":"CyberConnect2 Co., Ltd.","url":"PS2_COLLECTION_PART15/Naruto%20Shippuden%20-%20Ultimate%20Ninja%204%20%28Europe%29%20%28En%2CFr%29.zip","filesize":3444851419,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Direct control > Fantasy > Licensed","desc":"<p><em>Naruto Shippuden: Ultimate Ninja 4</em> is the first game in the series that moves into the Shippuden storyline. The newly added \"Master Mode\" tells an original story that takes place during Naruto's journey with Jiraiya and is centered around a demon named Black Shadow who demands human sacrifices from a nearby village. After this is resolved the mode continues with Shippuden's regular Kazekage story arc.</p><p>The \"Master Mode\" features a small but open game world for the player to explore. Naruto can collect items, fight enemies and talk to people in order to progress. However, the actual fighting remains to be the core of the Ultimate Ninja experience and was more refined and expanded in Ultimate Ninja 4. When two opponents clash, they will begin a series of high-speed attacks, appearing as a pair of blurs flashing across the stage. The winner is determined by a game similar to that of Rock, Paper, Scissors. There is also the addition of \"Awakening Jutsu\", a technique that is more powerful than the standard Ultimate Jutsu and, as the name implies, \"awakens\" a character's hidden powers and can only be used when certain conditions are met.</p>"},{"name":"Naruto Shippuden: Ultimate Ninja 5","year":2007,"developer":"CyberConnect2 Co., Ltd.","url":"PS2_COLLECTION_PART15/Naruto%20Shippuden%20-%20Ultimate%20Ninja%205%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1697859639,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Fantasy > Licensed","desc":"<p><em>Naruto Shippuden: Ultimate Ninja 5</em> is a fighting game developed by CyberConnect2 and is the last installment of the Ultimate Ninja series for the PlayStation 2.</p><p>The game follows Naruto's return to Konoha after the events of its predecessor, at the end of the Sasuke and Sai arc. Naruto will take on a more powerful group of enemies, with reliance on his friends and skills to proceed. The game primarily focuses on adding content that its predecessor lacked. The game contains 62 new characters, as well as updated jutsus and assist characters. The game has not been released in North America.</p>"},{"name":"Naruto: Ultimate Ninja","year":2003,"developer":"CyberConnect2 Co., Ltd.","url":"PS2_COLLECTION_PART15/Naruto%20-%20Ultimate%20Ninja%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2206186685,"score":7.3,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p>Based off Masashi Kishimoto's manga and anime <em>Naruto</em>, <em>Ultimate Ninja</em> is the first installment of the <em>Ultimate Ninja</em> series, known in Japan as the <em>Narutimate Hero</em> series. It is a fighting game with cel-shaded graphics resembling figures straight out of the manga. <em>Ultimate Ninja</em> contains twelve characters from the show, each with their own unique movesets and special attacks. In the overseas versions, two more bonus characters were added: Curse Mark Sasuke and Nine-Tailed Naruto. These were already playable in the Japanese version as a stronger mode for the regular characters, but split off into separate characters for the other versions. As such, the base characters cannot transform into these variations in the versions released outside of Japan.</p><p>The characters can fight in several locations seen in the show and comics, such as Hidden Leaf Village, the Chunin Exam arena, and the Forest of Death. There is a main story mode with six battles and dialogue between the characters.</p>"},{"name":"Naruto: Ultimate Ninja 2","year":2004,"developer":"CyberConnect2 Co., Ltd.","url":"PS2_COLLECTION_PART15/Naruto%20-%20Ultimate%20Ninja%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1653484173,"score":7.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p>Based on Masashi Kishimoto’s manga (and anime adaptation later) Naruto, <em>Ultimate Ninja 2</em> is the second installment of the <em>Ultimate Ninja</em> series. The current <em>Naruto</em> game has cel shaded graphics and features the following modes: Ultimate Road, VS. Duel, Iruka’s Training, Naruto’s House and Tanzaku Market.<em> </em><em>Ultimate Road</em><em>: Ultimate Road is your basic story mode and focuses on the events that took place on the finals of the Chunin Exam up to the point where Tsunade agrees to become the 5th Hokage. There is also an additional story that revolves around Tsunade and becomes accessible when you finish the main story. The particular mode features pre-rendered backgrounds that you can freely move within and 4 locations including the Village Hidden in the Leaves and Tanzaku Town. To advance the story you need to talk to certain people and win a row of battles each time. With each battle you’re given certain conditions that should be met in order to win. Such conditions are simply to win the battle, fight till time is up or more challenging like win the battle – with enemy’s defense power high. For specific events you may also choose a support character, before the battle starts, that will appear at regular intervals to give you items like shuriken and ninja scrolls that can be thrown to the enemy. The battles are one on one and play like in </em>Vs. Duel<em> mode. When the battle ends you get money and points depending on how many of your available moves you used, how many items you used, in how many arenas you fought, etc. You can spend money on </em>Tanzaku Market* and can use points to customize your characters’ stats like Attack and Defense from the menu. From the menu you can also check any missions available. Missions are actually battles with conditions such as the ones that are mentioned at the beginning but are of wider variety and higher difficulty.</p><ul><li><p><strong>VS. Duel</strong>: A versus fighting mode where you can choose your fighter and the opponent from 32 players available to fight versus the CPU or a human player. You start with 17 players and can unlock the rest by talking to them or defeating them in a fight in <em>Ultimate Road</em> mode. In the battle you get your basic moves like the substitution jutsu, double jump, blocking, etc. that are the same for all the players and combos and special techniques that are different to each character and do more damage than your normal moves. The arenas have multi-layers and destructible objects that reveal items you can throw or points to replenish your chakra (it can also be replenished by throwing your opponent to the ground or holding down the down cursor button). Chakra is what some combos and all 3 levels of special techniques need to execute. When executing special techniques you are given the chance to interact with them. For example you may have to continuously push a certain button, rotate the right analog stick or press a combo of buttons that appear on the screen. If done correctly you may proceed to the next “stage” of the attack, add critical damage to it or reduce damage and/or cancel a technique if it’s initiated by the opponent.</p></li><li><p><strong>Iruka’s Training</strong>: This is a practice mode where you can choose any of the 32 players available and master their moves.</p></li><li><p><strong>Naruto’s House</strong>: Here you can view items bought at <em>Tanzaku Market</em> as well as enter codes.</p></li><li><p><strong>Tanzaku Market</strong>: In <em>Tanzaku Market</em> you can buy Figures, Videos, Music, Ninja Info Cards, etc. that can be viewed at Naruto’s House.</p></li></ul>"},{"name":"Naruto: Ultimate Ninja 3","year":2005,"developer":"CyberConnect2 Co., Ltd.","url":"PS2_COLLECTION_PART15/Naruto%20-%20Ultimate%20Ninja%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3981406151,"score":7.5,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p><em>Naruto Ultimate Ninja 3</em> is a 3D action game based on the Naruto anime and manga series. It is the third installment of the <em>Ultimate Ninja</em> series.</p><p>Like its predecessor, it offers several modes. The story modes included are Ultimate Contest and Hero History. In Ultimate Contest, the player can freely explore the Hidden Leaf Village while Hero History lets the player relive all major battles from the series beginning with the training battle against Kakashi until the fight with Sasuke. Returning modes from the previous instalment are VS. Duel, Iruka’s Training, Tanzaku Market, and Naruto’s House. Another new mode is The Breaker Room that lets the player play several mini games.</p>"},{"name":"Naruto: Uzumaki Chronicles","year":2005,"developer":"Racjin Co., Ltd.","url":"PS2_COLLECTION_PART15/Naruto%20-%20Uzumaki%20Chronicles%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2119290411,"score":6.4,"genres":"Action > 3rd-person (Other) > Anime / Manga > Puzzle elements > Licensed","desc":"<p><em>Naruto: Uzumaki Chronicles</em> is a completely new story from the world of Naruto, known from the animated TV series. Many incidents have been happening lately around Leaf Village. It appears that Orochimaru is planning to destroying the Leaf Village and it is up to Naruto &amp; The Gang to stop him. This is the first PS2 Naruto game rendered in a 3D environment (no longer cel-shaded) with genuine CGI cutscenes.</p><p>This Naruto game plays differently than the previous two PS2 fighting-based games because you have the option to roam freely and practice your skills before taking up the mission-based storyline. You can perform your basic melee combos and power strikes, as well as jutsu moves using chakra like sexy jutsu and shadow replication to name a few. Naruto can also transform into Nine-Tails Naruto when his health drops below a certain level. You can increase your health, stamina, chakra levels or learn new skills by purchasing them using \"virtue points\" earned by winning battles. You also gain allies to help you in battles, like Sasuke, Kakashi and Chouji.</p>"},{"name":"Naruto: Uzumaki Chronicles 2","year":2006,"developer":"cavia inc.","url":"PS2_COLLECTION_PART15/Naruto%20-%20Uzumaki%20Chronicles%202%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":4027333514,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Puzzle elements > Licensed","desc":"<p><em>Naruto: Uzumaki Chronicles 2</em> is the sequel to Naruto: Uzumaki Chronicles and is based off of the animated TV series <em>Naruto</em>. The Five Great Nations are exposed to an army of living dolls called Puppet Walkers, who are attacking villages and obtaining \"Spirit Orbs\". Naruto Uzumaki and his friends have to stop the Puppet Walkers from getting the last of five Spirit Orbs.</p><p>Unlike its predecessor, <em>Naruto: Uzumaki Chronicles 2</em> is not mission-based. The game plays similar, though. The versus mode and the mission mode have a lot of replayability, despite <em>Uzumaki Chronicles 2</em> being a shorter game to beat. Sasuke and Kakashi are playable in the game as well, depending on the actions taken by the player.</p>"},{"name":"NASCAR 06: Total Team Control","year":2005,"developer":"Point of View, Inc.","url":"sony_playstation2_n/NASCAR%2006%20-%20Total%20Team%20Control%20%28Europe%2C%20Australia%29.zip","filesize":2987943632,"score":7.8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>NASCAR returns with some new drivers and veterans (as in Jeff Gordan, Dale Earnhardt Jr. and etc), and all the tracks from the NASCAR circuit. This NASCAR has a new feature were you can take control of another racing partners car to help them get out in front, and all the classic features. Graphics are updated, see tires, debris, and oil and etc, everywhere. Get all new unlockables of drivers, tracks, and upgrades on cars and tracks. Customize anything you please, build your own driver and change track settings where you want, so get out there and race.</p>"},{"name":"NASCAR 07","year":2006,"developer":"Point of View, Inc.","url":"PS2_COLLECTION_PART15/NASCAR%2007%20%28Europe%29.zip","filesize":2240455285,"score":6.6,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>NASCAR returns with a new roster of drivers and features in <em>NASCAR 07</em>. The gameplay and available modes are fairly identical to the previous game (including the team racing controls), but the pace has been kicked up a notch, with an added blur effect to enhance the sense of speed. A new feature is the Adrenaline meter. When full, it offers improved handling and speed. Drivers now carry ranks with different attributes (Dynamic Driver Attributes) and racing tendencies. Specific drivers will perform better on certain tracks. Players can earn skill points to improve their attributes by keeping a lead, making clean passes, intimidation or survive dangerous situations.</p><p>The main modes are Race Now, Season Mode, Chase for the Cup, Fight to the Top (Whelen Modified series, Craftsman Series, Craftsman Trucks, NBS, and NEXTEL Cup), Online Races (Quick Matches and Optimatch - where the host can fully define the event) and Dodge Challenges. The Dodge Speed Zone mode is no longer included. Important racers are shown in FMV interviews prior to Dodge Challenge races. As usual, the car can be tweaked and fine-tuned in many ways.</p><p>This is the first NASCAR game to appear on the PSP. It is fairly similar to the console versions, but does not include Total Team Control to talk with the team. The handheld version includes a new feature: Instant Rewind. While racing, a meter builds up with time, which can be used to rewind the game action when crashing or taking a bad turn. A few of the game modes are different.</p><p>Sterrance is featured on the US cover, as the driver for the #12 Alltel Dodge. The PAL release has Thomas's DeWalt Ford Fusion.</p>"},{"name":"NASCAR 08","year":2007,"developer":"EA Tiburon","url":"PS2_COLLECTION_PART15/NASCAR%2008%20%28Europe%2C%20Australia%29.zip","filesize":1112396627,"score":6.3,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>The 2008 edition of the NASCAR series of video games allows players to takes themselves into the game, with their name, and also the ability to customize the body color scheme and car design. Most of the game's new content is provided through the Earn Your Stripes career mode (PS2).</p><p>In Earn your Stripes, you start by going through time trials to get better starting contracts. After you get a contract, you can start racing. You can tune up your car in the areas of acceleration, tire wear, top speed, among several others. After a set amount of races, you will need to go through another time trial to get to the next set of races. As you complete races and gain reputation, more contracts will come in. In every race, you need to complete some objectives set in your contract. Some contracts are easy to complete (such as finishing a race), while others give more complex objectives (such as gaining several allied cars). Players can also race in the Craftsman Truck, National (Busch), and NEXTEL Cup.</p><p>The PS3 and Xbox 360 versions allow players to share their setups online. The chase mode offers a series of challenges like drafting or passing to unlock new features. All versions offer online multiplayer races.</p>"},{"name":"NASCAR 09","year":2008,"developer":"EA Tiburon","url":"PS2_COLLECTION_PART15/NASCAR%2009%20%28Europe%29.zip","filesize":1030252375,"score":7.1,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>NASCAR 09</em> is the continuation of EA's long running NASCAR franchise and an update from the previous years. It features an updated driving roster as well as update paint schemes, featuring the top drivers of the NASCAR Sprint, Nationwide and Craftsman Truck Series.</p><p>There is also two new \"racing models\" for players to choose from, depending on their skill. Either competing in \"Normal\" mode, which is more forgiving and is designed for new players and a \"Pro\" mode that is designed for hardcore racing players. Players can also learn from the games cover driver, Jeff Gordon, learning tricks of the trade on how to draft and pass as well as introduce new features to the game.</p><p>There are the standard modes to the game, exhibition for either one or two players, \"Chase for the Cup\", which is the standard career mode where players start out in the Craftsman Truck Series and work their way up to the Sprint Cup Series by winning races and securing prime sponsorships. There are also new \"Sprint Driver Challenges\", that lets the player go head-to-head against top Sprint Cup drivers in racing challenges, which will unlock new paint schemes and bonus material for winning these challenges.</p><p>Also there is online capabilities for the Xbox 360 and Playstation 3 (the Playstation 2 does not feature online) where players can customize special paint schemes for their cars utilizing the \"Paint Booth\", letting them customize paint schemes however they choose. Letting players download templates from Electronic Arts Sports website, incorporating the templates into editing programs such as Photoshop.</p>"},{"name":"NASCAR 2001","year":2000,"developer":"Black Box Games","url":"sony_playstation2_n/NASCAR%202001%20%28USA%29.zip","filesize":242444548,"score":7.3,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Stunning 3D graphics and visual effects, and real Nascar cars, tracks and lifestyle put you in the driver's seat.  </p><p>Key FeaturesUses a game engine designed for the PS2 with enhanced graphics, car physics, and challenging computer AI model. </p><p>Stunning Damage Physics and Effects.</p><p>Race at Daytona: For the first time, the world center of racing appears in a Nascar Playstation 2 videogame.  Race against the pact in the Daytona 500!</p><p>Authentic Nascar Racing:  The real drivers, cars, teams, tracks, sponsers, and rules.  </p><p>Top Drivers: Over 30 drivers including Jeff Gordon, Dale Earnhardt, Tony Stewart, Dale Jarrett, Bobby Labonte, Mark Martin, Dale Earnhardt Jr and Bobby Hamilton.</p><p>More Tracks: Daytona and 13 other Nascar tracks with both day and night racing.</p><p>Full or \"Track Pack\" Season: Race a full or half Nascar season or choose to compete on track packs: race just on short tracks, road courses, speedways or superspeedways.</p>"},{"name":"NASCAR 2005: Chase for the Cup","year":2004,"developer":"EA Tiburon","url":"sony_playstation2_n/NASCAR%202005%20-%20Chase%20for%20the%20Cup%20%28USA%29.zip","filesize":3521833087,"score":8.2,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>NASCAR 2005: Chase for the Cup</em> marks a change in name for the series, but continues the style of gameplay and game modes from the NASCAR Thunder titles.</p><p>Four new racing series have been added for this year; in addition to NEXTEL cup cars, players can race in the Featherlite Modified, Craftsman Truck, Nascar National (Busch), or production car series. Each type of car has its own unique feel and gives a different on-track experience. Real-life driver rivalries and confrontations are brought into the game with the enhanced grudges and alliances system. Computer drivers will remember whether you drive naughty or nice, and will payback favors in kind. The new Intimidator feature allows you to shake up an opponent by getting behind him and putting on the pressure.</p><p>In fight to the top mode, players can follow the career of their driver by starting in the Modified series and working their way up the NASCAR ranks. Performing well in races, as well as participating in autograph sessions, affects fan support, which in turn improves the driver's income.</p><p>Online support for the PlayStation 2 and Xbox allow up to four players to compete in a full 43-car field.</p>"},{"name":"NASCAR Heat 2002","year":2001,"developer":"Monster Games, Inc.","url":"sony_playstation2_n/NASCAR%20Heat%202002%20%28USA%29.zip","filesize":1702178681,"score":7.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator","desc":"<p>Race as one of twenty-five drivers at nineteen tracks, in this simulation of the 2001 Winston Cup season.  Race head-to-head against your friends, or try to beat the real drivers' ghost cars in Race The Pro.  Real racing scenarios are recreated to provide a quick challenge, in Beat the Heat.</p><p>The Xbox version differs from the PS2 version: it has all-new track models, textures, and car models.  Also, rather than returning to the UI between Practice/Qualify/Race, the player would experience \"race day\" on a track-side monitor.</p>"},{"name":"NASCAR Thunder 2002","year":2001,"developer":"EA Tiburon","url":"sony_playstation2_n/NASCAR%20Thunder%202002%20%28USA%29.zip","filesize":397948563,"score":8.1,"genres":"Racing / Driving > Simulation > Sports > 1st-person > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>This game is the first entry in EA's NASCAR Thunder series, where players can choose from sixty different drivers including Jeff Gordon, Dale Earnhardt Jr., Jimmie Johnson, Mark Martin, Tony Stewart, Dale Jarrett, just to name a few. There is an <em>Quick Race</em> mode where players can go against the computer or compete against three friends and can customize their options including turning yellow flags on or off, realistic damage and the length of races.</p><p>A 20 season <em>Career Mode</em> is also present that let's players build a car from scratch by choosing a number, paint scheme and up to four different sponsors. As the player progresses through their career, they can use money earned from races to buy better parts to upgrade their car and land bigger sponsors, depending on if the player meets their sponsor's goals.</p><p>There are also options where player's can tweak their car to their liking including change air pressure of their tire's, gear ratios, the angle of their spoiler, among others, depending on which track they race on. 23 real-life tracks are present including Lowe's Motor Speedway, Watkins Glen International Speedway and even the famed Daytona Speedway, home of the Daytona 500. Another feature lets the player race against the legend himself, Richard Petty, if they can win eight season championships.</p>"},{"name":"NASCAR Thunder 2003","year":2002,"developer":"Image Space Inc.","url":"sony_playstation2_n/NASCAR%20Thunder%202003%20%28USA%29.zip","filesize":1313257862,"score":7.8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>NASCAR Thunder 2003 simulates the NASCAR driver experience.  Dozens of locations are available, each with several alternate tracks.  All the big-name drivers of the present, and a few of the past, are available to choose from, or you can create your own driver and car.  Simulate a season, or even a full 20-year career complete with sponsorship deals and car improvements along the way.  Moments of the Race places you in real-life racing situations, asking you to either duplicate reality's outcome, or improve upon it.  Or you can race against up to three people.  The choice is yours.</p>"},{"name":"NASCAR Thunder 2004","year":2003,"developer":"EA Tiburon","url":"sony_playstation2_n/NASCAR%20Thunder%202004%20%28USA%29.zip","filesize":3000267452,"score":7.2,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>You can race on a variety of courses, from twenty three real world Winston Cup courses, twelve road courses and eleven fantasy courses, including a costal town and a busy city. There are sixty challenges in all.</p><p>When racing, what you do on the circuit affects future races. Ram someone into the wall or cause someone to spin out, and they'll remember. They'll try to get back at you in a future race. Help someone out, by clearing a path or sharing the draft, and they'll return the favor to you. Grudges and alliances are tracked throughout your career, so the more you piss someone off, the more likely they'll try to harm you.</p><p>Like the Football Camp mode in Madden NFL 2004, the Speed Zone is comprised of different many games that will earn you points and increase your skill, such as passing and drafting, blocking and drifting.</p><p>With the Career mode, you can go through a full twenty seasons before having to retire. You manage everything, from your pit crew and car parts to your sponsors and research and development.</p><p>There are seventy officially licensed drivers and over 180 vehicle skins. If nothing suits you, create your own driver and car and see how you do.</p><p>As in every 2004 edition of EA Sports console games, you'll find the EA Sports Bio, which is a career tracker that tracks your stats over every EA Sports game. The more games you play and the longer you play, the higher your level and the more rewards you can unlock.</p><p>Tune your car right and drive like a pro, and you may just make it to the finish line.</p>"},{"name":"NASCAR: Dirt to Daytona","year":2002,"developer":"Monster Games, Inc.","url":"sony_playstation2_n/NASCAR%20-%20Dirt%20to%20Daytona%20%28USA%29.zip","filesize":2712528356,"score":8.1,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>NASCAR action with 4 different series: Weekly Racing Series Presented by Dodge (dirt), NASCAR Featherlite (open wheel modifed), NASCAR Craftsman Truck Series (pickup trucks), NASCAR Cup Series (what people think of first when they hear NASCAR).</p><p>Players can upgrade their vehicles in Career mode as they start off with dirt cars and move up through the ranks if they do well enough.  Players can also just jump in for fast action races.</p><p>Cars reflect damage in their models and performance.  Players can paint their own schemes on their cars, and can place sponsorship placards to bring in more cash.</p>"},{"name":"National Geographic Safari Adventures: Africa","year":2007,"developer":"Neko Entertainment SARL","url":"PS2_COLLECTION_PART15/National%20Geographic%20-%20Safari%20Adventures%20Africa%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":2008279875,"score":"","genres":"Action > Adventure > 3rd-person (Other) > Africa","desc":"<p>Help your friends save the animals!</p><p>Discover the various planet ecosystems and resolve the problems linked to environmental degredation. Make friends with over 50 animals, including elephants, cheetahs and more. Fill your photo album with pictures of all your latest explorations and new found friends. 90 amazing habitats to choose from and over 90 missions to solve!</p>"},{"name":"Natsu Shoujo: Promised Summer","year":2004,"developer":"","url":"sony_playstation2_n/Natsu%20Shoujo%20-%20Promised%20Summer%20%28Japan%29.zip","filesize":1401181959,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Visual novel > Romance","desc":"<p><em>Natsu Shōjo: Promised Summer</em> is a romantic visual novel ported from PC game called Natsu Shōjo.</p><p>While the PS2 game has all the adult content from PC version removed, it has:</p><ul><li>Added romance route for fourth heroine, Kaname Shirayama, who was sub-character in PC version</li><li>New CG event scenes and artwork not present in the PC version</li></ul>"},{"name":"Natsuiro Komachi: Ichijitsu Senka","year":2003,"developer":"Purple Software Ltd"},{"name":"Natsuiro Komachi: Ichijitsu Senka (Shokai Genteiban)","year":2003,"developer":"Purple Software Ltd","url":"sony_playstation2_n/Natsuiro%20Komachi%20-%20Ichijitsu%20Senka%20%28Japan%29%20%28Shokai%20Genteiban%29.zip","filesize":642757831,"score":"","genres":"Special edition > Physical extras","desc":"<p>This Shokai Genteiban (初回限定版) release of Natsuiro Komachi (夏色小町) contains:</p><ul><li>Natsuiro Komachi: Ichijitsu Senka game</li><li>Original Soundtrack, Arrange Version</li><li>Secret URL to 3 desktop wallpapers (available in 640x480, 800x600, and 1024x768 resolutions)</li></ul>"},{"name":"Natsuiro: Hoshikuzu no Memory (Shokai Genteiban)","year":2004,"developer":"","url":"sony_playstation2_n/Natsuiro%20-%20Hoshikuzu%20no%20Memory%20%28Japan%29.zip","filesize":1079412521,"score":"","genres":"Special edition > Physical extras","desc":"<p>This First Print Limited Edition release includes:</p><ul><li>Natsuiro: Hoshikuzu no Memory* Artbook (32 pages, includes colored artwork and making-of character sketches)</li></ul>"},{"name":"Natsuyume Yawa","year":2003,"developer":"KID Corp."},{"name":"Natural 2: Sakurairo no Kisetsu","year":2005,"developer":"DreamSoft inc.","url":"sony_playstation2_n/Natural%202%20-%20Duo%20-%20Sakura-iro%20no%20Kisetsu%20%28Japan%29.zip","filesize":2246920180,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>PlayStation 2 version is a port from PC version called Natural 2 DUO which has removed adult content, but adds voice-acting to the game which was not included in the PC version. This game port also includes the scenario featured in Game Boy Advance version of <em>Natural 2 DUO</em>.</p>"},{"name":"Natural 2: Sakurairo no Kisetsu (DX Pack)","year":2005,"developer":"DreamSoft inc."},{"name":"Naval Ops: Commander","year":2004,"developer":"Micro Cabin Corp.","url":"PS2_COLLECTION_PART15/Naval%20Ops%20-%20Commander%20%28Europe%29.zip","filesize":1253153986,"score":"","genres":"Simulation > Diagonal-down > Naval / watercraft","desc":"<p>Customize your command ship with over 200 weapons and defensive systems and take it across the seas in 80 challenging missions. Purchase or use of this item is subject to the PlayStation®Network Terms of Service, this item’s use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.This title has been converted from the original PlayStation®2 version to the PS3™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionalities may not be available.Naval Ops: Commander © 2002-2004 TECMO KOEI GAMES Co., Ltd. All rights reserved. Naval Ops and the KOEI logo are registered trademarks of TECMO KOEI GAMES Co., Ltd.</p>"},{"name":"Naval Ops: Warship Gunner","year":2003,"developer":"Micro Cabin Corp.","url":"PS2_COLLECTION_PART15/Naval%20Ops%20-%20Warship%20Gunner%20%28Europe%29.zip","filesize":838864637,"score":"","genres":"Action > 3rd-person (Other) > Naval / watercraft","desc":"<p><em>Naval Ops: Warship Gunner</em> is a single player, naval game that combines strategy and shooting elements.</p><p>The player takes command of a warship which, for plot reasons, encountered some kind of electrical storm that flipped the ship into an alternate reality. On arrival the ship is immediately attacked by the forces of the Empire. From there on the player sides with the Freedom Forces and helps lead the battle against the Empire and its superships.</p><p>There are two kinds of game available. From the main menu the player can start a new game or they can select a WWII option. In the 'normal' game the player can invest in technology and use this to build new ships, in WWII mode the game is played with World War II ships from either the USA, Japan, England or Germany and is limited to the technology of the period.</p><p>The game consists of three areas of battle, each area has ten stages and the player must complete one stage before they can progress to the next. Each stage starts in the dock, this is where the ship is equipped with new armament, weapons and so-on, alternatively the player can scrap their ship and use the parts and the cash they have to design and build another to their own design.<br>Once the re-fit is complete the mission begins and the game makes success / failure really easy to understand - Complete the objective and escape and it's a successful mission, sink and it's not. Once the mission is over there's a battle report to review and it's on to the next mission.</p><p>Ships are not limited to battleships with big guns, there are aircraft carriers too. Ships can be repaired while afloat and power-ups can be picked up by sailing over them.</p><p>Completing the game unlocks a Survival Mode in which the player selects a class of ship and stays with that unmodified ship throughout a replay of the game.</p>"},{"name":"NBA 06","year":2005,"developer":"SCE Studios San Diego","url":"sony_playstation2_n/NBA%2006%20%28USA%29.zip","filesize":3176648091,"score":6.3,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>NBA 06</em> deviates from other traditional NBA titles with the addition of the Life Mode. While it does include classic features such as exhibition, season, franchise, and multiplayer modes, the life mode is a take similar to the MLB: The Show.</p><p>The life mode has the player take control of an NBA rookie right out of college and just being drafted. As in the MLB Show series, the player may only control one character and cannot control others on their team or make any management decisions. The player's role of the team will be determined by their performance on and off the court. The better the player is at playing basketball and being a teammate, the more likelier they will be a huge part of the team and receive better contracts and endorsement deals.</p><p>Likewise, the decisions the player makes off the court will determine who they are perceived as well, such as how they interact with teammates, what they buy or who they hang around with. The player can also train their character through a series of 20 mini-games, e.g. one-on-one, three-on-three, etc.</p><p>The game also features Showtime Gameplay, where the player may increase attributes and become a better team player with no-look alley-oops and highlight reel dunks. It also has online capabilities as well as the option of utilizing the EyeToy to put the user's face onto a created character.</p>"},{"name":"NBA 07 featuring the Life Vol 2","year":2006,"developer":"SCE Studios San Diego","url":"sony_playstation2_n/NBA%2007%20featuring%20the%20Life%20Vol.%202%20%28USA%29.zip","filesize":2432739093,"score":"","genres":"Sports > 3rd-person (Other) > Real-time > Direct control > Basketball > Licensed","desc":"<p>Experience the NBA’s Next Great Rivalry.<br>* Live the life of an NBA player while experiencing it all on and off the court.<br>* Volume 2 highlights the rivalry between The Kid and Big W as both playable characters battle for MVP honors and a championship.<br>* In addition to The Life Volume 2, NBA '07 offers a true simulation featuring all the NBA teams, players and arenas.<br>* New Power Boarding Mechanic let’s you crash the boards will authority (sic) and pull down the rebound.<br>* New Open Shot Indicator clearly illustrates how open your shooter is based on the defensive pressure.<br>* More than a dozen mini-games including Own The Court, Free Throw, Two-On-Two and other playground classics.</p>"},{"name":"NBA 08","year":2007,"developer":"SCE Studios San Diego","url":"sony_playstation2_n/NBA%2008%20featuring%20the%20Life%20Vol.%203%20%28USA%29.zip","filesize":2560535257,"score":6,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>NBA 08</em> features volume three of \"The Life\" series that concludes and revolves around a coach by the name of \"Coach T\" as his career is winding down. The player takes control of a player for Coach T. with the ability to choose from five different characters depending on the position they want to play or create their own with 60 different scenarios to participate in.</p><p>The game follows a realistic view of basketball by attending news conferences, signing endorsements, interact with fellow players and coaches and rivals as well. The decisions determines how the player is viewed as either a team player or a lone troublemaker. Depending on how their player performs during games, they can receive attribute points to strengthen their players.</p><p>There is also a Smart Shot Indicator, which has a color indication before a player takes a shot at the basket, letting them know how hard the defense is pressing and the likely hood of missing or completing the shot.</p><p>The game features updated animation and a feeling of a real broadcast on television featuring the voice talents of Kevin Calabro and Mark Jackson. There are minigames to compete in, like 3-Point Shootout and the Playstation Skill Challenge and online capabilities where players can compete head-to-head or in tournaments.</p>"},{"name":"NBA 09: The Inside","year":2008,"developer":"SCE Studios San Diego","url":"sony_playstation2_n/NBA%2009%20-%20The%20Inside%20%28USA%29.zip","filesize":2905445610,"score":6.5,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>NBA 09: The Inside</em> is the sequel to NBA 08 where once again the player can partake in a new chapter in \"The Life\" mode. This time around the player can take control of a created superstar (five total) with the ability to interact with three different characters and constantly change the storyline. </p><p>The <em>Team Progression System</em> makes a return, rewarding the player for game exploration and completing certain achievements given to them throughout the game. Completing these tasks can unlock certain accessories that they can use for their created character, showing off their status. Players can also associate with various teammates and coaches, how they act towards these characters will determine their place with the team (being a team player and helping out others will have the coaches play you more and have create a bigger fan base and being a individual loner will alienate them from the team and have a smaller fan base).</p><p>The obligatory game modes also exist in this version as well (<em>Franchise</em>, <em>Exhibition</em>) as well as updated NBA rosters with every NBA team available. The Havok engine is introduced for this version, giving the game a more realistic feel when combined with new animations and enhanced character models.</p><p><em>NBA Replay</em> also returns, letting players relive classic moments from the 07/08 as well as partake in the 08/09 season by downloading them off of the Playstation Network (five each week during the season). Players can also upload and share data, show off their created superstars and track their progress through leaderboards and even play against each other in online exhibition games.</p><p>Audio commentary is provided by Seattle Supersonics star Kevin Calabro and franchise newcomer Kenny \"The Jet\" Smith.</p>"},{"name":"NBA 2K10","year":2009,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART15/NBA%202K10%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2185021629,"score":8.2,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Basketball > Licensed","desc":"<p>The next release in the NBA 2K series, <em>NBA 2K10</em> expands previous game modes, brings roster updates, and adds a number of new online-linked features meant to add more realism to the game.</p><p><em>2K10</em> features an improved player-creation mode that, aside from standard physical and appearance options, also includes tendencies, attitudes, dribble and dunk styles, and signature moves. Created players can be used in the new \"My Player\" simulation mode, where the created basketballer rises from an undrafted rookie through the entirety of his NBA career. This mode is a simulation in the truest sense, and players imported into it must pick a position on their team and are expected to play it accurately, unselfishly, and without deviation (no wandering the court in search of dunks and flashy superstardom).</p><p>Xbox360 and PS3 players may download the NBA 2K10 Draft Combine game to create a player and give him a head-start on skills in My Player mode. Players can also form online crews and play pick-up games that don't affect the character's schedule, but still result in experience points.</p><p>\"The Association\" sim mode has been expanded, allowing players to control and manage all 30 NBA teams at once, follow the realistic progress of generated players, share custom draft classes, and manage new developmental league teams.</p><p>Internet-connected consoles may elect to receive live updates through the \"NBA Today\" feature. This optionally updates rosters and stats to reflect changes in the actual NBA (including trades and injuries), down to offering date-specific color commentary based on when the game is being played.</p><p>A variety of other gameplay tweaks have been made, including new dribbling and defensive controls, lockdown defense, a new stamina system, 24 active play calls, and the ability to save progress in the middle of a game and return to it later.</p>"},{"name":"NBA 2K11","year":2010,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART15/NBA%202K11%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2447240618,"score":8.4,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p>This release in 2K Sports' long-running NBA 2K basketball series touts Michael Jordan as the cover athlete, and builds a number of challenges around his career. This is in addition to a series of improvements to game modes like My Player and The Association, as well as a new dribbling and animation mechanic.</p><p>Jordan's involvement is maximized from the start, with four modes based around Jordan's career. The \"Jordan Challenge\" has the player control Michael in ten highlight games through his career. The player must successfully recreate Jordan's real-life performance in the virtual scenario. In Quick Game mode, players can select eight different years of Jordan-led Chicago Bulls squads, and pit them against current-day rosters. Players can control a rookie Jordan in \"MJ: Create a Legend\" mode, and guide him through a modern-day career in the NBA. Finally, players are awarded pairs of Air Jordans for in-game achievements. Players are encouraged to collect all the Air Jordans Michael wore through his career, and each gives a stat bonus when equipped by the player's character.</p><p><em>2K11</em> features revised \"Iso-Motion\" dribbling controls, allowing players to perform fancy moves with combinations of the right stick and trigger. These include crossovers, hesitations, and behind-the-back moves. Players can also use the \"Shot Stick\" controls for analog control over their shot and release, as well as their drive to the basket. Combinations of stick and trigger moves allow players abilities from quickly switching the ball to the opposite hand, to controlling a layup or dunk. Alternatively, players can use the face buttons for basic pass/fake/shot controls, and engage icon passing to accurately select their target. An \"On-The-Fly Coaching\" system uses a series of branching menus on the controller's direction pad to change A.I. strategies, or call out new ones in multiplayer. Finally, a new \"Shot Branching\" system lets players adjust their shots when airborne, without being stuck to a canned animation.</p><p>\"My Player\" mode allows players to create a new rookie and take him through a career in the NBA. Each created player starts in the NBA Draft Combine (included here, not sold separately as last year) and hopefully signs with a team based on their performance. From there, players will handle their character both on and off the court, and build up limited RPG-style stats. Off-court gameplay includes elements like talking to the press after a game (and picking responses from a few possible choices), communicate with your coach (such as asking for a trade), and gaining and managing product endorsements. On-court, players are expected to play their role on the team, and are graded and rewarded (with skill points) as such. Each game has specific goals to meet, such as scoring a set amount of points, and some games will be marked as \"key\" games - netting a boost to exposure and skill points if completed successfully.</p><p>\"Association\" mode allows players to manage a team as both coach and GM, and gives control over scouting, assigning players, negotiating salaries, and the like. This year, a greater emphasis is put on team chemistry and player egos, similar to the relevant stats in \"My Player\" mode. If star players aren't given the court time they feel they deserve, they become disgruntled. Up to 30 teams can be set for player control, allowing for multiple players to engage in an elaborate fantasy league simulation. Players can use an existing NBA team as a template, or create their own.</p><p>Online, players can form clubs and leagues. Clubs are most similar to an MMO \"guild,\" or an enhanced friends list. Players can use a created character or one from the NBA roster. Club stats are tracked as any players win or lose games, which feed into leaderboards showing how the clubs stack up. Leagues are more dedicated multiplayer simulations of seasons, from draft to finals. Players join and battle other players to take their team to the top. League admins are granted the ability to kick inactive players. Returning from previous years is the Sprite-sponsored \"NBA Blacktop\" mode, putting NBA players in street ball pickup games (like 21) online or offline. New for this year is a \"Slam Dunk Showdown,\" scoring players on the flashiest dunks. Standard one-game multiplayer matchups are also, of course, supported.</p><p>The final major new feature for <em>2K11</em> is the \"NBA Today 2.0\" system. Live NBA news and game results are streamed from online, along with a \"living roster\" system that updates player stats and injuries. In addition, this system is a blanket term for improvements to the game's presentation. Players now reflect their real-world tendencies and emotions when applicable, crowds and chants are dynamic, stadiums and halftime shows are accurately represented, and commentary is more accurate and organic. Players can create their own game highlight reels, player DNA, or custom situations, and upload them to share with other players.</p>"},{"name":"NBA 2K12","year":2011,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART15/NBA%202K12%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2318196804,"score":8.6,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Basketball > Licensed","desc":"<p><em>NBA 2K12</em> took what had made NBA 2K11 successful and added some new features.</p><p>More than 1,000 new animations have been added, and more post-play moves are implemented.</p><p>New to NBA 2K fans is the NBA's Greatest mode, which let you relive some of the defining moments of 15 NBA legendary players including Michael Jordan, Magic Johnson, and Larry Bird. The Create-A-Legend mode let you guide an NBA player to Hall-of-Fame success. The Association and My Player modes have been revamped.</p><p>There are 30 classic NBA teams to unlock. NBA 2K12 supports 3D display for the PlayStation 3.</p>"},{"name":"NBA 2K2","year":2002,"developer":"Visual Concepts Entertainment, Inc.","url":"sony_playstation2_n/NBA%202K2%20%28USA%29.zip","filesize":1270773839,"score":8.2,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Basketball > Licensed","desc":"<p><em>NBA 2K2</em> is the third game in SEGA's NBA 2K series of basketball simulations. This is the first game in the series to be released for multiple platforms (instead of solely for the Dreamcast). In addition to updated graphics, rosters, arenas, team uniforms, and signature moves for the 2001-2002 season, the 2K2 edition now supports zone defenses (a new NBA rule where you have to choose to play man or zone defense), intercepting of passes, and making adjustments and actions in mid-animation.</p><p>There are detailed statistics for each team and player, for a year, the current season or an entire career. The game modes include Exhibition, Season (play a full season along with management), Franchise (more than one season), some arcade street modes and the option to create custom tournaments.</p>"},{"name":"NBA 2K3","year":2002,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART15/NBA%202K3%20%28Europe%29.zip","filesize":1702980005,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>Sega Sports has added a new season of their basketball franchise.  NBA2K3 comes packed with a new feel, graphics, gameplay, and updated stadiums and rosters.  The ESPN broadcast presentation makes it seem even more realistic.  You can now adjust your shot in mid-air, dive for loose balls going out of bounds, fight for position down low, and fake your opponent out as you move around him. You can do it all in NBA2K3.  Also new for the Xbox and PS2 is Online play. You can now play online against other players across the globe.  Franchise mode offers extended gameplay as well as managing your team from the inside out. Street mode has also return with more courts and interactive bystanders.</p>"},{"name":"NBA 2K6","year":2005,"developer":"Visual Concepts Entertainment, Inc.","url":"sony_playstation2_n/NBA%202K6%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2996907964,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>2K's long running basketball franchise, this one features the obligatory roster updates as well as an updated control scheme such as utilizing the analog stick to pass, shoot and even dunk. The turbo button has been eliminated, but players can now choose how to adjust their players aggressiveness in the game to determine how they will play.</p><p>It also features many NBA players such as Shaquille O'Neal, Steve Nash and Amare Stoudemire along with many others. It also feature \"The Crib\", similar to Madden's apartment, where players can unlock and buy items to place in their apartment, upgrading as they progress through the game. There are also the regular game modes such as exhibition and even a franchise mode where players can control everything, from hiring new players, coaches and even scout out players.</p><p>The Xbox 360 features the V.I.P. feature, where players can view and even download their profiles to compare and compete against each other. It also features the commentary of Kevin Harlan and Kenny Smith.</p>"},{"name":"NBA 2K7","year":2006,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART15/NBA%202K7%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2668064533,"score":8.3,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>NBA 2K7 continues the tradition of the NBA 2K series into the next generation for the first time. All your standard modes and options that you normally find on a basketball simulation are here, including online head-to-head modes and complete customization of your team and leagues, but it's the exclusives for next generation systems that step up the game, with signature styles (where by each individual athlete performs and acts just as they do in real life), the return of the shot stick (determining your accuracy on the court) and further in-depth options involving trades, player fatigue, online customization and a complete player creator feature.</p>"},{"name":"NBA 2K8","year":2007,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART15/NBA%202K8%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2547394374,"score":8.2,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p><em>NBA 2K8</em> is a continuation of 2K's NBA franchise, featuring the obligatory roster and stats updates for each team as well as the standard game modes: <em>Exhibition</em>, <em>Season</em>, <em>Career</em> as well as a <em>Franchise</em> mode which is known as <em>The Association</em>, where players can identify key players as well as troublemakers, keep up-to-date injuries and stats as well as simulate games.</p><p>The controls still remain the same from previous versions with some added tweaks. One of which is where players can switch to other players on offense besides the ball handler and set up alley-oops and set up screens to fool defenses. Players can also use the right analog stick for defensive purposes, locking onto opponents and run defensive plays against them. There is also Signature Style, giving the NBA players in the game and more life-like and fluid feel to them.</p><p>There is also a Slam Dunk Contest sponsored by Sprite with the ability to use over 300 different dunk variations as well as compete against four other opponents online. Music in the game is provided by well-know rappers such as Q-Tip, Run-DMC, Percee P among many others.</p>"},{"name":"NBA 2K9","year":2008,"developer":"Visual Concepts, Ltd.","url":"PS2_COLLECTION_PART15/NBA%202K9%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2392477721,"score":8.4,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p><em>NBA 2K9</em> is the latest update in the long running 2K series with the obligatory roster update with the latest NBA stars. The same game modes are still present: <em>Exhibition</em>, <em>Season</em> and <em>Franchise</em> with the same type of gameplay with some tweaks.</p><p>One of the newest tweaks is the ability for the player to change their shot's trajectory in mid-air and an advanced AI that reacts to the players performance. Players can also track their players performance, morale and attitude during franchise mode to keep their players happy and content with their place on the team.</p><p>There are also new cutscenes for the highlight reels and features online capabilities where players can compete in online leagues or face against another team head-to-head. </p><p>Players can also upload their created players along with custom made highlight reels that they can share on their respective online provider (the PS2 version does not feature this mode). Clark Kellogg, Cheryl Miller and Kevin Harlan provide their voice talents to the game.</p>"},{"name":"NBA Ballers","year":2004,"developer":"Midway Games, Inc.","url":"PS2_COLLECTION_PART15/NBA%20Ballers%20%28Europe%29.zip","filesize":2647420423,"score":7.9,"genres":"Action > Sports > 3rd-person (Other) > Arcade > Basketball > Licensed","desc":"<p>NBA Ballers is the exclusive one-on-one basketball videogame highlighting the \"bling-bling\" lifestyle of NBA Superstars; chromed-out cars, ice, ladies, tatts and jets all hinge on the killer cross-over. NBA Ballers also features NBA Legends dropping dimes and dunking in your grill to determine who is the greatest baller of all time. 60+ NBA Players: Including Kobe Bryant, Vince Carter, Allen Iverson, Kevin Garnett, Shaquille O’Neal, Yao Ming, Steve Francis, Chris Webber, Gary Payton, Latrell Sprewell, and more! 24 NBA Legends: Including Rick Barry, Larry Bird, Wilt Chamberlain, Clyde Drexler, Julius Irving, Magic Johnson, Bill Russell, Jerry West, James Worthy, and more!</p>"},{"name":"NBA Ballers: Phenom","year":2006,"developer":"Midway Games, Inc.","url":"sony_playstation2_n/NBA%20Ballers%20-%20Phenom%20%28USA%29.zip","filesize":2017438485,"score":7.1,"genres":"Sports > 3rd-person (Other) > Direct control > Basketball > Licensed","desc":"<p><em>NBA Ballers: Phenom</em> is the sequel to NBA Ballers and is a continuation of the Midway NBA series started in 1994 with NBA Jam. The objective of the game is to best your opponent in rounds of street basketball. The game is broken up into many modes, including a full story mode, versus and practice modes. Players have the option to play as one of many NBA players, or create their own character to take through story mode, with the game's Create-A-Baller mode.</p><p>The plot of story mode follows you, a young gun trying to make a break into the big leagues of street ball and your one time friend, Hot Sauce. Hot Sauce betrayed you, and stole your girlfriend, taking his fame and fortune to the top of the leagues. Now it's up to you to win it all, and take back your pride and your game.</p><p>The game features celebrities such as Hot Sauce, Ludacris, Trikz, Jin, and Chingy. The players' looks can be fully customized.</p>"},{"name":"NBA Hoopz","year":2001,"developer":"Eurocom Developments Ltd","url":"PS2_COLLECTION_PART15/NBA%20Hoopz%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":431367957,"score":6.6,"genres":"Action > Sports > 3rd-person (Other) > Arcade > Basketball","desc":"<p>Play three-on-three basketball in the arcade style of older Midway games, such as NBA Jam and NBA Showtime. Besides playing regular games, you can also play mini-games like Around the World and 21.</p>"},{"name":"NBA Jam","year":2003,"developer":"Acclaim Studios Austin","url":"PS2_COLLECTION_PART15/NBA%20Jam%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%29.zip","filesize":1399566024,"score":6.9,"genres":"Sports > Diagonal-down > Side view > Arcade > Direct control > Basketball > Licensed","desc":"<p>3-on-3 arcade-style basketball with over 50 of the NBA's all time greatest players.  Enter a Legends Tournament and travel back in time as you work your way up through the ranks in head-to-head battle with the best from each era.  Each time you defeat a team their players are available for you to use in creating your ultimate dream team.  And for some real high-flying action build up your Jam Meter and hit the lights with the over 40 unique Monster Dunks.</p><p>This game feautres tons of unlockables (teams, courts, and cheats) as well as commentary by Tim Kitzrow and Bootsy Collins.</p>"},{"name":"NBA Live 06","year":2005,"developer":"Electronic Arts Canada","url":"sony_playstation2_n/NBA%20Live%2006%20%28Europe%29.zip","filesize":1854930279,"score":7.8,"genres":"Sports > Behind view > Diagonal-down > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p>With a new season of the NBA comes a new edition to the NBA Live series. <em>NBA Live 06</em> lets you play as professional basketball teams in the NBA 2005-2006 season. You can play in single player Dynasty Mode, which allows you to play 25 seasons with your team, draft and trade players, as well as control players movements in mid-air for ultimate control of dunks and other moves. The game features graphics and AI that are improved from the last NBA Live game and real commentary from Marv Albert, Steve Kerr, Ernie Johnson, and Kenny \"The Jet\" Smith.</p>"},{"name":"NBA Live 07","year":2006,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART15/NBA%20Live%2007%20%28Europe%2C%20Australia%29%20%28En%2CDe%2CIt%29.zip","filesize":2963288141,"score":7.1,"genres":"Sports > Behind view > Diagonal-down > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p>ELEVATE YOUR GAME<br>FEATURES * ALL-NEW EA SPORTS™ TOTAL FREESTYLE CONTROL: Take complete control of EA SPORTS™ Freestyle Superstars, including shooters, scorers, stoppers, and more, by changing skill attributes on the fly. * UNPRECEDENTED ESPN INTEGRATION: The worldwide leader in sports delivers updates, scores, and breaking news via the most advanced ESPN integration package ever. * THE DEEPEST NBA DYNASTY MODE™: Manage player morale and team chemistry as you make key decisions based on player personality, ability and age. * NBA ALL-STAR WEEKEND: Analysts Greg Anthony and Ernie Johnson highlight every spectacular play during the Slam Dunk Contest and 3 Point Shootout. The weekend ends with the Rookie Challenge and All-Star Game. * VOICES OF THE NBA<br>Former Chicago Bulls star Steve Kerr joins the legendary Marv Albert courtside to call the action from the best seats in the house</p>"},{"name":"NBA Live 08","year":2007,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART15/NBA%20Live%2008%20%28Europe%2C%20Australia%29%20%28En%2CDe%2CIt%29.zip","filesize":2389072484,"score":6.7,"genres":"Sports > Behind view > Diagonal-down > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p>NBA Live 08 is another basketball game released by EA Sports for the 2007-2008 season. The game modes of NBA Live 08 include Quick Play, Season, Playoffs, Dynasty, All-Star Weekend, FIBA World Championship, 1-on-1, and Practice. Commentary is handle by Marv Albert and Steve Kerr. NBA Live 08 has some new features including \"Go To Moves\", \"Hot Spots\", \"Quick Strike Ballhandling\", and \"Own the Paint\". \"Freestyle Superstars\" and \"X-Factor\" from NBA Live 07 have been removed from the game. FIBA World Championship mode includes eight national teams ( Argentina, China, France, Germany, Greece, Italy, Spain and the USA ).</p><p>NBA Live 08 has updated rosters for the 2007-2008 season. Most NBA players that are playing in the NBA for the 2007-2008 season are in NBA Live 08. The game includes all of today's NBA stars such as LeBron James, Kobe Bryant, Kevin Garnett, Chris Paul, Yao Ming, and Tim Duncan. In addition to the game modes, there's also online play.</p><p>In the All-Star Weekend mode there's the Slam-Dunk Contest, the 3-point Shootout, the Rookie vs Sophomore game, and of course, the All-Star game. Dynasty mode, the game's main mode, is 30-year long. Dynasty mode is like Season mode but at the end of each season you get to draft rookies, sign coaches and free agents, scout players and do other things.</p>"},{"name":"NBA Live 09","year":2008,"developer":"HB Studios Multimedia Ltd.","url":"sony_playstation2_n/NBA%20Live%2009%20%28Europe%2C%20Australia%29%20%28En%2CIt%29.zip","filesize":2374652850,"score":"","genres":"Sports > Behind view > Diagonal-down > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p><em>NBA Live 09</em> is a simulation of the basketball sport. As usual the player controls the athletes himself and tries to perform typical basketball maneuvers with his gamepad. The main difference to the PS3 and Xbox 360 version is that every new feature described there is missing. This means the game is more or less the same as NBA Live 08.</p><p>The player can choose between playing a whole season, play-offs or the FIBA World Championship. In the Dynasty Mode the player takes the role of the executive of a basketball team which means he has to grapple with managerial tasks like transfers or training Be-a-Pro is a mode were the player only takes control over one athlete.</p>"},{"name":"NBA Live 2001","year":2001,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART15/NBA%20Live%202001%20%28Europe%29.zip","filesize":423432217,"score":7.4,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p><em>NBA Live</em> is back! Enhanced Chat &amp; Match-up with the fast, easy-to-use Match-up System. Improved trade system can involve up to 3 teams and 15 players. Improved \"player personality\" means you'll see players argue calls, celebrate a key basket, encourage their teammates, and much more. Also, play the legends such as Michael Jordan in 1-on-1 or 5-on-5 games.</p>"},{"name":"NBA Live 2002","year":2001,"developer":"NuFX, Inc.","url":"PS2_COLLECTION_PART15/NBA%20Live%202002%20%28Europe%29.zip","filesize":426532345,"score":7,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>The NBA Live series' second attempt on the PS2 brings the following updates:</p><p>Yes he has been in it since Live 2000, but this is first game to have Jordan with his new team, the Washington Wizards.</p><p>Cut scenes evolve the focus on player vs player interaction during stops in play and arguments between player and referee.</p><p>An improved interface allowing you to get into the games quicker, and an improved control system for better defensive and offensive moves.</p><p>New player moves, plays and celebration animations.</p><p>The Franchise Mode lets you control your team for 10 years, trading players and keeping an eye on rookies.</p><p>Legendary players list so you can see who really is the greatest.</p>"},{"name":"NBA Live 2003","year":2002,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART15/NBA%20Live%202003%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2352290950,"score":8.1,"genres":"Simulation > Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>The 2003 version of the NBA simulator has improved graphics in relation to the previous installments and features like detailed faces and a player design engine. It also has rosters in accordance to the 2002-2003 Season.</p><p>The game features more than 30 new rebound animations worked out by motion capture sessions, different passing styles and blocks and a frame rate of 60 frames per second.</p><p>As usual, a complete fantasy draft is included and multiplayer support is present.</p>"},{"name":"NBA Live 2004","year":2003,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART15/NBA%20Live%202004%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2315875101,"score":7.8,"genres":"Sports > Behind view > Diagonal-down > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p>It's another season of the NBA, and with it comes another edition of NBA Live.</p><p>For 2004, the player can expect an expanded EA Sports Freestyle control scheme, allowing the player to pull off plays by simply using the right analog stick in collaboration with the player's  movement with the left analog stick. Dynasty mode has also been upgraded, with the opportunity of expanding the player's squad with the top free agents and rookies from the college leagues.</p><p>Up to 4 players can play on the Xbox, while PlayStation 2 players can go online with full stat tracking.</p>"},{"name":"NBA Live 2005","year":2004,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART15/NBA%20Live%202005%20%28Europe%29%20%28En%2CDe%2CIt%29.zip","filesize":2457515737,"score":7.9,"genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p>The 2005 edition of the NBA Live Basketball series has a new graphics engine, and adds new moves and signature moves to personalize the players. Another feature is Freestyle Air, with more control of players in the air, and the option to specify 10 different freestyle configurations. You can build your team over multiple seasons, and additional management in the Dynasty Mode is introduced through rookie scouting, along with a calendar to mark all the important dates. Management is based on dynasty points. By progressing, you earn points that can be spent on training sessions, new equipment, or to send out scouts all over the world.</p><p>Different multiplayer options are offered, and events include a NBA all-star weekend with a Slam Dunk contest, a Rookie/Sophomore game and a 3-Point shootout, next to the regular game modes. You can also go freestyle anywhere in North America. The game has become quicker than the 2004 version, and the game strategies have been balanced by creating more emphasis on the mid-range jumper.</p>"},{"name":"NBA ShootOut 2001","year":2001,"developer":"989 Studios","url":"sony_playstation2_n/NBA%20ShootOut%202001%20%28USA%29.zip","filesize":526176115,"score":6.6,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>NBA Shootout 2001</em> is an officially licensed basketball game that features all the current NBA teams at the time including top players such as Shaquille O'Neal, Alonzo Mourning and many others. It has the standard set of modes that included exhibition, playoff and season mode. Players also had a choice of either playing a more fast paced game with Arcade or a more realistic experience with Simulation.</p><p>It features over 400 different plays to choose from including team specific plays and also has awards such as Defensive Player of the Year, Rookie of the Year and MVP that is handed out in season mode. Players can also play against each other in a versus mode.</p>"},{"name":"NBA ShootOut 2003","year":2002,"developer":"989 Studios","url":"sony_playstation2_n/NBA%20ShootOut%202003%20%28USA%29.zip","filesize":1181047790,"score":"","genres":"Sports > 3rd-person (Other) > Real-time > Direct control > Basketball > Licensed","desc":"<p>* PRACTICE, EXHIBITION, SEASON, PLAYOFF & CAREER MODES<br>* RIGHT STICK BUTTON OFFERS 22 UNIQUE SPECIAL MOVES<br>* DEDICATED POST UP GAMEPLAY CONTROLS<br>* COMPLETELY REBUILT ANIMATION & A.I. ENGINES</p><p>NBDL Signs with NBASO Career Mode<br>Rookies hit the Summer League circuit as they vie for a spot on an NBA roster. Time will tell if they have the skills to flourish in the NBA or be sent down to the NBDL - exclusively in NBA ShootOut 2003.</p><p>Pratice Makes Perfect For Rookie Ballers<br>Rookies become veterans with the All-New Practice Mode where you can perfect your timing on jumpers, nail some sick special moves, fine tune free throws and elevate your game.</p><p>Hall of Famer Says \"Just Unbelievable\" To Two-Man Booth With Ian Eagle<br>Catch all your favorite Waltonisms as he provides commentary along side New Jersey Nets' Ian Eagle. The new dynamic duo calls the shots as cameras pan, track and zoom to capture every highlight and lowlight of the game.</p><p>New Dunk Contest Winner is Truly NBA - Nothing But Air<br>Take your game to new heights and defy gravity as you string together some of the most infamous moves in the game to make your own signature jam with Create Dunk.</p>"},{"name":"NBA ShootOut 2004","year":2003,"developer":"Killer Game","url":"sony_playstation2_n/NBA%20ShootOut%202004%20%28USA%29.zip","filesize":2124237888,"score":6.3,"genres":"Sports > 3rd-person (Other) > Direct control > Basketball > Licensed","desc":"<p>NBA Shootout 2004 lets you play either a full season or exhibition matches of fully licensed NBA basketball with your favorite teams and players. Fully textured 3d players with faces of the top NBA players are mapped into the game. Listen to commentary by Ian Eagle and Bill Walton as they call the games right as you play.</p><p>While there is no franchise mode like other more traditional sports games, there is a career mode where you create a character who tries to make his way up through the summer leagues and the NBDL. You'll be given challenges that you'll need to meet so that you can ultimately make your way to the NBA and get an actual contract to join a NBA team. Once in the NBA, you'll need to work even harder to win championships and titles so you can eventually be inducted into the NBA Hall of Fame.</p><p>You can also unlock the 50 greatest players of all time by completing challenges in exhibition games like scoring a certain number of points or using a certain person to get a number of assists.</p><p>Use a USB microphone to give your teammates commands to help. Give them commands on offense or defense about where to move so you can use your teammates effectively.</p><p>Take your game online and play against the rest of the world. Look at leaderboards to see who the best person is, chat on message boards, participate in polls, read news, and even play in online tournaments.</p>"},{"name":"NBA Starting Five","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"sony_playstation2_n/NBA%20Starting%20Five%20%28USA%29.zip","filesize":407070633,"score":"","genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>NBA Starting Five</em> is an NBA-licensed basketball game, and a follow-up to Konami's earlier NBA 2Night games.</p><p>Included players and teams are based on the 2002-2003 season. Game modes include Exhibition, Quick Start for a random match-up, Season, Playoffs and Franchise (up to 25 seasons in length). Franchise mode features the rookie draft between seasons, as well as signing, trading and releasing players. The signing is based on a point system, with 1000 points available to spend for the entire team.</p><p>Multiplayer options allow control of the entire team or individual athletes for competitive or cooperative play, with up to 4 players supported on Xbox and up to 8 on PS2 via multitap.</p>"},{"name":"NBA Street","year":2001,"developer":"NuFX, Inc.","url":"PS2_COLLECTION_PART15/NBA%20Street%20%28Europe%29%20%28En%2CFr%29.zip","filesize":374264347,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>Play 3 on 3 basketball like never before. Perform amazing moves, including dunks and passes to drive pass the opposing team, and take on the best of the NBA to become the ultimate street basketball player. To add to the action, you can also create your own player(s) and throw them into the street arenas.</p>"},{"name":"NBA Street V3","year":2005,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART15/NBA%20Street%20V3%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2060451961,"score":8.7,"genres":"Sports > 3rd-person (Other) > Tricks / stunts > Direct control > Basketball > Licensed","desc":"<p>Bring your game to the street in EA's third installment of the NBA Street franchise. NBA Street V3 includes a new trick stick control mechanic, in-depth single-player career mode, improved gameplay mechanics and online play. Watch today’s biggest NBA stars go head to head in 3-on-3 match-ups against the legends of yesterday. Create your own character using the Create Baller feature and play in familiar venues such as The Cage and Rucker Park or create your own using the Court Creator.</p><p>The main game modes include quick matches (Play Now), Street Challenge (the career mode), and Dunk Contest where you can win over the judges by performing gravity defying dunks combined with impossible mid-air tricks. The career mode adds new goals in this version, based on scoring only with 3-point baskets, dunks, or gamebreakers. You can build up your gamebreaker by performing a complicated series of jukes, passes, or dunks. DJ Bobbito provides the commentary along with a mix of new and old school hip-hop.</p>"},{"name":"NBA Street Vol. 2","year":2003,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART15/NBA%20Street%20Vol.%202%20%28Europe%29%20%28En%2CFr%29.zip","filesize":1614403123,"score":8.4,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>Return to the street for the unqiue basketball experience that allows you to show off to the crowd, wear crazy gear, and pull of crazy shots, passes and moves.</p><p>Modes include Street School (a tutorial that allows you to learn all the basic and more complex moves of the game), Pick Up Game (exhibition mode, in which you can win points to unlock rewards), NBA Challenge has you competing against the current crop of talent from the NBA, as well as collection of legendary players from the past, and Be a Legend give you the opportunity to create your own original basketball player and take him on a tour to compete against the world's best, unlocking new moves, clothes and other surprises.</p>"},{"name":"NCAA  March Madness 07","year":2007,"developer":"Electronic Arts Canada"},{"name":"NCAA Basketball 09","year":2008,"developer":"","url":"sony_playstation2_n/NCAA%20Basketball%2009%20%28USA%29.zip","filesize":1831042131,"score":"","genres":"Sports > 3rd-person (Other) > Real-time > Direct control > Basketball > Licensed","desc":"<p>REAL COLLEGE BASKETBALL<br>KEY FEATURES: * NEXT-LEVEL AUTHENTICITY - For the first time ever, the creators of the Blue Ribbon™ College Basketball Yearbook provide authentic team ratings to replicate real-life team behaviors and tendencies. * AUTHENTIC NCAA® BASKETBALL - Call offensive and defensive sets in the heat of the game with the Floor General Playcalling system, and take advantage of a momentum-filled ratings boost to get the ball into the hands of your can't-miss Go-To guy. * BE THE SIDELINE GENERAL - As head coach, lead your team to the NCAA® Championship by calling set plays, making substitutions, and taking charge of other key decisions. * BECOME THE ULTIMATE CHAMPION - Choose from a selection of the all-time greatest teams from every era, and create dream matchups by building a custom Tournament of Legends. * RECRUIT TOP-NOTCH BLUE CHIPPERS - Use in-season recruiting tools to go after McDonald's™ All-Americans and premiere junior college players at any time. * ALL-NEW IN-SEASON TOURNAMENTS - Cut down the nets by dominating premier pre-season tournaments, including the Old Spice Classic, Anaheim Classic, Puerto Rico Tip-Off, and more.</p>"},{"name":"NCAA College Basketball 2K3","year":2002,"developer":"Kush Games, Inc.","url":"sony_playstation2_n/NCAA%20College%20Basketball%202K3%20%28USA%29.zip","filesize":2326172846,"score":7.9,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>Play as one of over 300 college hoops teams in this first college outing for the 2k lineup.  Take control of a full coaching career from inception at a small time college working your way up to a major powerhouse performer.  You can also play a skirmish with a friend, go out for a two-on-two game, or one of many other play modes you would expect in a competitive basketball game.  Just don't play it like the NBA... the college game has a different, more team-oriented feel, and this comes through in the gameplay.</p>"},{"name":"NCAA College Football 2K3","year":2002,"developer":"Avalanche Software LLC","url":"sony_playstation2_n/NCAA%20College%20Football%202K3%20%28USA%29.zip","filesize":977107974,"score":7.1,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>This is Sega Sports' collegiate football sim including brand-new player models, completely redesigned stadiums, all 25 official Bowl Championship Series (BCS) bowls, and a revamped Legacy mode in which gamers can recruit high-school stars and compare lifetime records against other collegiate programs in the historical rankings system. Using the game's Legacy mode, you will be able to follow the entire career of a college player from freshman year to entering the NFL draft.</p>"},{"name":"NCAA Final Four 2001","year":2000,"developer":"Killer Game","url":"sony_playstation2_n/NCAA%20Final%20Four%202001%20%28USA%29.zip","filesize":376371327,"score":5.4,"genres":"Simulation > Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>The continuation of 989 Sports long running NCAA basketball franchise and the first for the PS2, once again returns with 31 NCAA Division 1-A schools along with over 300 of the top teams of the time.</p><p>Once again the obligatory game modes apply such as <em>Exhibition</em>, <em>Season</em>, <em>Playoffs</em>, etc. It also features authentic motion capturing and 3D rendered character models of the top stars of the time to give it a more realistic feel. A shooting meter has also been added to give players a better chance at both shooting and free-throws.</p><p>Quinn Buckner also makes an appearance to lend his voice for play-by-play commentary.</p>"},{"name":"NCAA Final Four 2002","year":2001,"developer":"Killer Game","url":"sony_playstation2_n/NCAA%20Final%20Four%202002%20%28USA%29.zip","filesize":518203549,"score":6.2,"genres":"Simulation > Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>The follow-up to Final Four 2001 features the obligatory roster updates with over 300 real NCAA teams and 31 conferences with authentic fight songs and 70 new player models to give the game a feel of realism. The standard modes apply such as <em>Exhibition</em> that supports both one-player or two-player and a <em>Dynasty mode</em> that lets the player compete in a full-season in order to secure a place in the 64-team tournament known as \"March Madness\". It also features the voice talents of Eddie Doucette and Billy Packer who provide play-by-play commentary.</p>"},{"name":"NCAA Final Four 2003","year":2002,"developer":"Killer Game","url":"sony_playstation2_n/NCAA%20Final%20Four%202003%20%28USA%29.zip","filesize":928268900,"score":"","genres":"Sports > 3rd-person (Other) > Real-time > Direct control > Basketball > Licensed","desc":"<p>* 303 DIVISION I-A TEAMS AND ARENAS<br>* 70 NEW PLAYER MODELS CONSISTING OF 4,500 POLYGONS<br>* THE JOHN R. WOODEN AWARD®, TOP 25 RANKINGS AND \"BUBBLE WATCH\"<br>* NEW COMMENTARY FROM BILLY PACKER AND EDDIE DOUCETTE</p><p>Team Benefits From New Practice Facility<br>Practice your plays and sharpen your skills with the new \"Practice Mode\" with a unique practice arena.</p><p>Team Beats Rival With Furious 3-point Attack<br>Team-specific playbooks mean each team plays exactly like its real-life counterpart.</p><p>Recruiting Class Makes Immediate Impact<br>New, multiple stage recruiting process delivers the deepest \"Dynasty Mode\" ever implemented into a college basketball game.</p><p>Star Player Hits Buzzer Beater To Solidify Upset<br>New player rating icons during gameplay indicate which player is your star performer, best shooter and fastest player.</p>"},{"name":"NCAA Final Four 2004","year":2003,"developer":"Killer Game","url":"sony_playstation2_n/NCAA%20Final%20Four%202004%20%28USA%29.zip","filesize":1422265715,"score":"","genres":"Sports > 3rd-person (Other) > Real-time > Direct control > Basketball > Licensed","desc":"<p>* CLASSIC COLLEGE BASKETBALL RIVALRIES SETTLED ONLINE AND OFFLINE<br>* EXCLUSIVE PLAYER RATING ICONS FOR STAR PLAYERS, BEST SHOOTERS AND FASTEST PLAYERS<br>* NEW ANIMATIONS - DUNKS, PASSES, SHOTS, BLOCKS AND DRIBBLES<br>* NEW COMPUTER OPPONENTS PROVIDE THE ULTIMATE CHALLENGE</p><p>Online Success Invaluable During Tournament Run<br>Create your own 65 team tournament and tell gamers nationwide why you're #1 using a USB headset (for PlayStation®2). Deep 989 Sports online lobby features user-hosted tournaments, message boards, downloadable roster updates, buddy lists, and large-scale stat tracking. Live sports ticker allows you to monitor real sports scores as you compete for the National Championship.</p><p>Team in Control from Opening Tip<br>All-new right analog stick controls allow you to move the ball and direct the offense like a true floor general: Execute spin moves and drop steps out of the post, confuse defenders with crossover and behind-the-back dribbles, and make precision passes.</p><p>College Hoops Hysteria Sweeping the Country<br>Relive the excitement of college hoops with over 303 Division 1-A teams, 50 team mascots, cheerleaders, fight songs performed by the USC marching band, Top 25 rankings and the John R. Wooden Award®.</p><p>College Basketball's Deepest Roster Overwhelming the Competition<br>Sharpen your skills in \"Practice Mode\". Build a powerhouse collegiate program over multiple seasons by recruiting freshmen to replace graduating seniors in \"Dynasty Mode\". Start off as an assistant coach at a small school and work your way up to head coach at a major college basketball program in \"Career Mode\".</p>"},{"name":"NCAA Football 06","year":2005,"developer":"EA Tiburon","url":"sony_playstation2_n/NCAA%20Football%2006%20%28USA%29.zip","filesize":3182999228,"score":8.5,"genres":"Sports > 3rd-person (Other) > Diagonal-down > Multiple units/characters control > Football (American) > Licensed","desc":"<p>EA Sports 2005 edition of its college football franchise comes with some great new features and its new impact stick technology.  As usual you can play a quick game or choose a dynasty, but it also includes the new Race for the Heisman mode as you start out as a Freshman, moving your way up through the college ranks, winning the big games and becoming a legend by winning the most covenant prize in college football, the Heisman Trophy.  You can also play mini-games skills such as the Pass Skeleton, Oklahoma Drill, Option Attack and Rushing Attack and now with in studio commentary with Brad Nessler, Kirk Herbstreit and Lee Corso's famous mascot predictions just before kickoff.  It has much improved graphics and an improvement over previous versions.</p>"},{"name":"NCAA Football 07","year":2006,"developer":"Team Fusion","url":"sony_playstation2_n/NCAA%20Football%2007%20%28USA%29.zip","filesize":2555385241,"score":8.1,"genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p>Another update of EA's perennial NCAA collegiate football franchise, this edition features updated rosters and stats. It also has new features such as a momentum meter, the more players either in favor or against a team, the more the meter will light up or darken, affecting the teams morale and success of plays. It also has a new kicking meter along with spring drills, letting players update their stats along with a new Spring Game where players can scout out their new players in exhibition games.</p><p>Aside from the PSP version, Campus Legend is also a novelty - an update of the Race for the Heisman mode of the previous edition and it is quite similar to the NFL Superstar mode from the Madden franchise. A new player starts at football camp, practises and is eventually awarded a scholarship to play in a division. Rather than a single drill, it is now a series of four. Where in the previous version players could choose a scholarship, the game now offers a selection from the available schools based on the performances. Once enrolled, players choose a major, follow progress reports, read headlines in the school newspaper and have a dorm room where fan mail arrives. The player's girlfriend, shown as a photo of the wall, becomes more beautiful based on the success in the games. Days consist of attending classes, practice, studying, meeting tutors, drills or social activities. These can also boost popularity and overall success. Characters can be uploaded to Madden 07 where it can determine their draft position. The game is also aligned with ESPN, updating with real news from ESPN Radio and ESPN.com. It features the voice talents of Lee Corso, Brad Nessler and Kirk Herbstreit.</p><p>The 360 version lacks the Spring Drills and Campus Legend modes. Instead it has improved graphics and a series of mini-games.</p>"},{"name":"NCAA Football 08","year":2007,"developer":"EA Tiburon","url":"sony_playstation2_n/NCAA%20Football%2008%20%28USA%29.zip","filesize":2086128769,"score":7.9,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>An update to EA's NCAA college football franchise with updated rosters and stats. It has new features such as the ability to boost skill performance and increase overall ratings by making user-controlled plays that elevate the team's motivation levels. As a coach, you can make promises to recruits to gain commitments and depending on whether or not you keep those promises, your coaching integrity rating will rise or fall causing players to transfer. The game has many college specific features such as home field advantage, composure ratings, an all-new fatigue system, and new trick plays like the Statue of Liberty and Hook and Ladder. You can revisit your top accomplishments in My Shrine, your personal Hall of Fame that stores trophies, custom photos, and video highlights. There is a Campus Legend Mode where you can develop a player from a star high school player to a backup college player.</p>"},{"name":"NCAA Football 09","year":2008,"developer":"EA Tiburon","url":"sony_playstation2_n/NCAA%20Football%2009%20%28USA%29.zip","filesize":1892440729,"score":7.8,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>EA's long running college football franchise returns, featuring the obligatory rosters updates as well as brand new animations and offensive/defensive plays. It features the standard Dynasty Mode, Exhibition, Multiplayer and now has the option to play football games with team mascots in full uniform. It also features minigames to train QBs, RBs as well as linebackers and even kickers.</p><p>There is also online capabilities for the PS3 and Xbox 360 versions (PS2 does not support online) where players can share files and stats with others as well as play in exhibition games against each other. Players can also play an online dynasty with the ability to play with 11 players online and pick their own schedule up 60 seasons worth.</p>"},{"name":"NCAA Football 10","year":2009,"developer":"EA Tiburon","url":"sony_playstation2_n/NCAA%20Football%2010%20%28USA%29.zip","filesize":2105902860,"score":"","genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p>Settle who’s #1 once and for all with NCAA® Football 10. With the eyes of college football upon you, begin your Road to Glory in a fully customizable career mode featuring player progression and authentic college football atmospheres. Become college football’s biggest star by developing your skills with bonus points earned for solid performances. Dominate your rivals with Freshman mode, featuring an easy-to-use play-calling system with simplified game controls and playbooks. From controlling a player’s overall progression to controlling the pace of a game, make a historic run for the BCS National Championship with NCAA® Football 10!</p><p>© 2009 Electronic Arts Inc. EA, EA SPORTS and the EA SPORTS logo are trademarks or registered trademarks of Electronic Arts Inc. in the U.S. and/or other countries. All Rights Reserved. The \"Officially Licensed Collegiate Products\" label is the exclusive property of The Collegiate Licensing Company. The \"Collegiate Licensed Product\" label is the property of the Independent Labeling Group. All names, logos, team icons, and mascots associated with the NCAA, universities, bowls and conferences are the exclusive properties of the respective institutions. NCAA is a registered trademark of National Collegiate Athletic Association and the NCAA Football logo is a registered trademark of the NCAA licensed to NCAA Football USA, Inc. Heisman Memorial Trophy and likeness of the actual trophy are registered service marks by the Heisman Trophy Trust under registration numbers 936,853 and 935,852 respectively. All other trademarks are the property of their respective owners.</p><p>Purchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 portable systems that are associated with the purchasing account.</p>"},{"name":"NCAA Football 11","year":2010,"developer":"EA Tiburon","url":"sony_playstation2_n/NCAA%20Football%2011%20%28USA%29.zip","filesize":2112646154,"score":7.7,"genres":"Simulation > Sports > 3rd-person (Other) > Isometric > Managerial / business simulation > Football (American) > Licensed","desc":"<p>EA's 2010-2011 release in their NCAA Football series focuses on recreating the unique nuances of each of the 120 schools in the NCAA. Playbooks, stadiums, mascots, traditional team strengths, tendencies, and even locker room rituals are included with as much accuracy as possible. Games also use a complete ESPN broadcast package, including graphics, fly-ins, and replays. Broadcasters Kirk Herbstreit, Brad Nessler, and reporter Erin Andrews offer commentary and sideline updates throughout each game. The lighting engine has also been improved for all on-field conditions.</p><p>Gameplay improvements target A.I. and physics. The Locomotion and Pro-Tak systems from the Madden series moves to NCAA in this release, basing the success of the running game and tackles more on physics and momentum, and less on arbitrary player stats. Players can also use the analog sticks for precision running, with direction on the left, and spins, jukes, and stiff-arms on the right. A.I. has been updated to run its assignments more effectively, and utilize new routes and concepts like double-blocking.</p><p>Also in <em>NCAA 11</em> is expanded use of social media and online integration. Players can run all aspects of their Dynasty online, and keep up with their team's performance. The Team Builder returns from NCAA Football 10 with expanded options; allowing players to go online and build a team from uniform color to on-field logo, and then share their teams online for public or private download. Players can also use the StoryBuilder online feature to package clips, shots, and results from games into news stories that can be published on Facebook, YouTube, and Twitter.</p><p>Multiplayer uses EA's Online Pass system, and requires a code from a new copy of the game, or one purchased through XBL/PSN, to use any of the online features.</p>"},{"name":"NCAA Football 2002","year":2001,"developer":"EA Tiburon","url":"sony_playstation2_n/NCAA%20Football%202002%20%28USA%29.zip","filesize":619064403,"score":8.2,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>College football game, same engine as Madden 2001 just with improved AI and graphics. Also has over 120 teams to pick from and several modes such as Dynasty, Season, Exhibition and more.</p>"},{"name":"NCAA Football 2003","year":2002,"developer":"EA Tiburon","url":"sony_playstation2_n/NCAA%20Football%202003%20%28USA%29.zip","filesize":1236324343,"score":8.3,"genres":"Sports > Managerial / business simulation > Football (American) > Licensed","desc":"<p>NCAA Football 2003 is EA's followup to NCAA Football 2002. New features in NCAA Football for the 2003 season include over 200 licensed fight songs, 3D cheerleaders and 144 different schools.</p><p>Dynasty mode has been enhanced with the ability to redshirt a player and schedule your non-conference games before each season. In Dynasty Mode you can win all the real trophies to add to your own personal collection which you can show off later. These awards include the Heisman, Coach of the Year and Bowl-specific trophies. You can also win special trophies for winning certain rivalry games, which is another new play mode in 2003. There are 23 different \"Rivalry\" trophies for you to earn to go alongside your Dynasty trophies. </p><p>Create-A-School mode makes it into this edition, letting you create your own football team. Everything from the logos on the field to your school's fight song can be customized. Your created team can be played in Exhibition play or imported into Dynasty mode.</p><p>The last notable feature new to NCAA Football 2003 is the customizable interface. You choose your favorite team and the game interface will be based around your team's fight song, mascot, logos and school colors.</p>"},{"name":"NCAA Football 2004","year":2003,"developer":"EA Tiburon","url":"sony_playstation2_n/NCAA%20Football%202004%20%28USA%29.zip","filesize":2384577139,"score":8.8,"genres":"Sports > Managerial / business simulation > Football (American) > Licensed","desc":"<p>NCAA Football 2004 is another entry in EA Sports' NCAA Football series.  This edition features the return of gameplay modes seen in previous versions such as Dynasty Mode, but also has some new additions.  The College Classics mode allows you to replay classic games in college football history.  Some smaller gameplay changes have been made too.  The game has new tackling animations and more realistic zone defense.</p>"},{"name":"NCAA Football 2005","year":2004,"developer":"EA Tiburon","url":"sony_playstation2_n/NCAA%20Football%202005%20%28USA%29.zip","filesize":2514903649,"score":8.4,"genres":"Sports > 3rd-person (Other) > Diagonal-down > Multiple units/characters control > Football (American) > Licensed","desc":"<p>NCAA Football 2005 is the latest in EA's counterpart series to Madden.  Once again you are given the charge of earning a national championship for your college program.  Once players graduate, you can export the draft class for later use in Madden 2005.  Play online on Xbox and PS2 to challenge gamers around the world.</p>"},{"name":"NCAA GameBreaker 2001","year":2000,"developer":"RedZone Interactive, Inc.","url":"sony_playstation2_n/NCAA%20GameBreaker%202001%20%28USA%29.zip","filesize":461193788,"score":6.6,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>Like previous games in 989 Studios' GameBreaker series, NCAA GameBreaker 2001 is a counterpart to their NFL GameDay series. You start out as a bottom-rung coach at one of the 115 division 1-A college teams and as your performance increases, you obtain promotions and offers from other schools. At the end of the season, you're able to export your players to NFL GameDay. As with the previous games, broadcaster Keith Jackson returns to provide voice commentary.</p>"},{"name":"NCAA GameBreaker 2003","year":2002,"developer":"SCEA Sports Studio - Red Zone","url":"sony_playstation2_n/NCAA%20GameBreaker%202003%20%28USA%29.zip","filesize":891772686,"score":"","genres":"Sports > 3rd-person (Other) > Real-time > Direct control > Football (American) > Licensed","desc":"<p>* 117 DIVISION I-A TEAMS AND STADIUMS + 66 ALL-TIME TEAMS<br>* 27 BOWL GAMES INCLUDING THE BOWL CHAMPIONSHIP SERIES<br>* THE HEISMAN™ TROPHY, TOP 25 RANKINGS & ALL-AMERICAN AWARDS<br>* THREE DISTINCT PLAYBOOKS - BALANCED, RUNNING & PASSING</p><p>New Game Plan Equals Championship Season<br>A new, redesigned game engine delivers 500 new tackling, catching, running and throwing animations plus player models and stadiums detailed to perfection.</p><p>Head Coach Fired; Replacement Announced Tomorrow<br>Climb the coaching ranks in Coaching Career Mode and see if you know your X's and O's to earn a head coaching job at a national powerhouse.</p><p>New Broadcast Team Getting Rave Reviews<br>Tim Brant joins Keith Jackson, the voice of college football, providing GameBreaker® with detailed commentary and analysis.</p><p>QB's Audible Sparks 4th Quarter Rally<br>New \"Hot Routes\" let you change your receiver's patterns at the line of scrimmage. If the receiver is isolated one-on-one send him deep; if the \"D\" is playing back call for a quick slant.</p>"},{"name":"NCAA GameBreaker 2004","year":2003,"developer":"989 Studios","url":"sony_playstation2_n/NCAA%20GameBreaker%202004%20%28USA%29.zip","filesize":2046716319,"score":6.5,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p><em>NCAA GameBreaker 2004</em> is a college football game that includes 117 Division I-A teams plus an additional 66 classic teams.</p><p>Modes include Scrimmage, Bowl Season, Tournament Season, Career Mode, Tournament Mode, Practice Mode, and Athletic Department. Scrimmage is an exhibition game between two teams. Bowl Season and Tournament Season let the player play a regular season and if their team is good enough for the post season, they can then participate in a bowl game or a tournament playoff, depending on the mode respectively. Career Mode lets the player take on the role of a coach. The goal is to have a good season at a small school, in hopes of either getting promoted or getting a job offer from a bigger school. Tournament Mode lets the player compete in a tournament right from the start. Practice Mode lets the player hone their skills. The Athletic Department mode allows the player to view rosters, recruit players, and create walk-on players. </p><p>The game offers a style setting that let's the player choose whether to play simulation or arcade style, with the arcade style making the gameplay faster and giving the players on the field more exaggerated moves.</p>"},{"name":"NCAA March Madness 06","year":2005,"developer":"Electronic Arts Canada","url":"sony_playstation2_n/NCAA%20March%20Madness%2006%20%28USA%29.zip","filesize":3087557401,"score":7.5,"genres":"Sports > 3rd-person (Other) > Side view > Top-down > Basketball","desc":"<p>Electronic Art's NCAA Basketball franchise returns with new and improved features for the 2005 season. The new lockdown stick allows you to force opponent's to make easier turnovers and make smoother passes to teammates.  You can have your senior captain  get your team into the game and get your crowd fired up to rattle your rivals into mistakes.  With an much more updated dynasty mode you can now recruit Junior College players with updated stats to keep you ahead of your rivals and relive some of the greatest moments with College Classics and play up to 20 great games, repeating history or completely changing it.</p>"},{"name":"NCAA March Madness 08","year":2007,"developer":"Electronic Arts Canada","url":"sony_playstation2_n/NCAA%20March%20Madness%2008%20%28USA%29.zip","filesize":1833264526,"score":6.7,"genres":"Sports > 3rd-person (Other) > Side view > Top-down > Basketball > Licensed","desc":"<p><em>NCAA March Madness 08</em> is an updated version of the long running college basketball computer games, which has updated rosters, along with new authentic arenas as well. It still features the dynasty mode, tournament mode and single-season and exhibition modes along with the lockdown stick and Floor General playcalling system.</p><p>It also includes the NIT tournament and the McDonald's High School All-American game and has online capability to check out real-time stats from college basketball and is partnered with ESPN.</p>"},{"name":"NCAA March Madness 2002","year":2002,"developer":"NuFX, Inc.","url":"sony_playstation2_n/NCAA%20March%20Madness%202002%20%28USA%29.zip","filesize":427116558,"score":5.9,"genres":"Simulation > Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>Another entry in the March Madness series with the standard updated rosters on over 130 official NCAA teams along with their real life logos and nicknames. The standard modes also apply including <em>Exhibition</em>, which supports multiplayer capabilities, <em>Season</em> and <em>Tournament</em>. It also gives the player the ability to change the game's difficulty to there liking including fatigue settings, computer A.I., period lengths, etc.</p><p>Players can also create their own college using 14 logos, different jersey styles, head coaches and three different types of stadiums (Field House, Stadium and Arena). It also features the voices of renown NCAA Coaches including Roy Williams, Billy Donovan and many others that will give the player advice throughout the game.</p>"},{"name":"NCAA March Madness 2003","year":2002,"developer":"NuFX, Inc.","url":"sony_playstation2_n/NCAA%20March%20Madness%202003%20%28USA%29.zip","filesize":895468727,"score":7.4,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>NCAA March Madness 2003</em> is the second appearance of Electronic Arts' college basketball series on the PlayStation 2. Compared to the previous year's version, it adds several new game modes and also includes several of the new control options previously seen in NBA Live 2003.</p><p>Returning modes from the predecessor are single games and tournaments, along with the Create-A-School mode. Newly added are single seasons and the multi-season dynasty mode. The number of available teams has increased to over 160. More authentic team mascots and fight songs have also been added.</p><p>A major change in controls are the Freestyle Controls reused from <em>NBA Live 2003</em>: using the right analog stick allows for a wide variety of offensive moves. The Quick Plays functionality that allows quick playcalling via the d-pad has also been added.</p>"},{"name":"NCAA March Madness 2004","year":2003,"developer":"Electronic Arts Canada","url":"sony_playstation2_n/NCAA%20March%20Madness%202004%20%28USA%29.zip","filesize":3327061718,"score":7.6,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>Electronic Arts' college basketball series returns for another year on the PlayStation 2 and makes its debut on the Xbox with <em>NCAA March Madness 2004</em>.</p><p>The number of included teams has been doubled to over 320 from the predecessor and several authentic arenas have been added. All the previous year's game modes return, including single games, tournaments, season and dynasty. Newly added are the mascot game, in which the teams consist of players in their schools' mascot outfits. A rivalry mode allows a quick set-up of a game pitching classic rival teams against each other. The dynasty mode has added Campus Challenges: by completing these challenges in dynasty games, players earn points that can be used to improve players' stats. Exclusive to the PS2 version is the introduction of online multiplayer, featuring single games and tournaments.</p><p>Some of the gameplay changes on the court were previously seen in NBA Live 2004: these include the separation of the buttons for dunks and shots and the introduction of the pro hop button, which allows for context-sensitive special offensive moves.</p>"},{"name":"NCAA March Madness 2005","year":2004,"developer":"Electronic Arts Canada","url":"sony_playstation2_n/NCAA%20March%20Madness%202005%20%28USA%29.zip","filesize":2355748400,"score":7.3,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>Electronic Art's 2004 incarnation of the NCAA Basketball franchise comes with some brand new features. With a sophisticated play calling system you can call your plays with still moving the ball down the court to get your team mates in contention. The dynasty mode goes up to 30 years with a recruiting system that keeps up to date of your prospects while keeping your other players in line just in case they decide to stray from their studies or worse. You can play one on one against the computer or against a buddy, playing in custom tournaments, rivalry games or even play as your favorite teams mascots. It also features the all-new Pontiac College Classics, allowing you to recreate classic games from the past or even rewrite history. The game also features the voices of Brad Nessler and the legendary Dick Vitale.</p>"},{"name":"Need for Speed: Carbon","year":2006,"developer":"Electronic Arts Black Box","url":"PS2_COLLECTION_PART15/Need%20for%20Speed%20-%20Carbon%20%28Europe%29%20%28En%2CNl%2CSv%2CDa%2CFi%2CPl%2CCs%2CHu%29.zip","filesize":3809197282,"score":7.2,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p>The 2006 game in the <em>Need for Speed</em> series is an evolution of the gameplay introduced in the previous games. The career mode offers complete freedom in a city with a story mode supported by FMV cutscenes, as featured in Need for Speed: Most Wanted, but now also set in the Carbon Canyon, where racers duel for territory in the city below. There still are many police pursuits. At the same time, the focus on tuning and sculpting your car remains, as introduced in Need for Speed Underground. As you win money from races, you can visit garages and car lots to make improvements to your vehicle.</p><p>Enhancements are still unlocked gradually, but the cars have now been divided over different tiers. There are about 40 cars to unlock. Many of them have been featured in previous installments, but there is a new selection and this year's edition introduces powerful muscle cars such as the Ford Mustang and Dodge Charger. Other features include the possibility to form your own crew, more detailed sculpting features, drifting races (introduced in <em>NFS:U</em> and replaced by drag races in <em>NFS:MW</em>) and the new car classes. The PC, PS3 and Xbox 360 versions offer online multiplayer, missing from the PS2, GC and Xbox releases. Up to eight players can race together, in the Pursuit Tag or Pursuit Knockout modes, with a few variations. Pursuit Tag is a race of one civilian car against cop cars. To become the civilian car, you have to tag it and then try to fend off the cops as long as possible until you are tagged again by other players. In Pursuit Knockout everyone starts as a civilian car, but the last one at the end of the first lap becomes a cop and needs to cause as much damage as possible to the other speeders. Another mode allows you to drive cooperatively (up to four players) in a single race.</p><p>The city and the surroundings in the career mode have been divided into different territories, controlled by gangs. You are either invited or challenged to race in the sections and claim them as your own. To do so, you have to impress the gang leader by winning races until he challenges you for a duel - first in the city, then over the narrow roads of Carbon Canyon. Scores are based on proximity. You need to follow the boss in the first race, and he is in pursuit in the second one. There are 4 boss duels in total.</p><p>The crew feature, with room for up to 6 cars, allows you to assign three roles to racers: drafters, scouts and blockers. These are supporting characters you can hire to help you win races. Drafters leave behind a coloured trail that makes it easier to find the way, scouts discover hidden shortcuts, and blockers try to cause mayhem to slow your opponents down. If you hire a scout, you get access to the new AutoSculpt feature. It enables you to modify the height of every part of your car through sliders, solely for visual effect. You can also buy full body kits.</p>"},{"name":"Need for Speed: Carbon (Collector's Edition)","year":2006,"developer":"","url":"sony_playstation2_n/Need%20for%20Speed%20-%20Carbon%20-%20Collector%27s%20Edition%20%28Europe%2C%20Australia%29.zip","filesize":3226382721,"score":7.7,"genres":"Special edition > Digital extras > Extra content / game","desc":"<p>The collector's edition of Need for Speed: Carbon includes the following additions:</p><ul><li>four new cars: 2006 Chevrolet Camaro Concept, 2007 Jaguar XK, 2006 Koenigsegg CCX, 1992 Nissan 240SX</li><li>ten pre-tuned versions of existing cars</li><li>extra events: six new races and three challenge series, including drift courses in the city</li><li>ten new vinyl kits</li><li>bonus DVD with a behind-the-scenes feature about the cars, environments, characters and actors, and the Need for Speed AV Wars Remix Project, a collection of six audiovisual remixes based on the game.</li></ul><p><strong>Windows version</strong> - there is additional content available if the collector's edition was pre-ordered through EA Downloader. It includes:</p><ul><li>two new cars: 1971 Dodge Challenger and the 2006 Pagani Zonda F</li><li>every performance upgrade in the game automatically unlocked</li></ul>"},{"name":"Need for Speed: Collector's Series","year":2006,"developer":""},{"name":"Need for Speed: Hot Pursuit 2","year":2002,"developer":"Black Box Games","url":"PS2_COLLECTION_PART15/Need%20for%20Speed%20-%20Carbon%20%28Europe%29%20%28En%2CNl%2CSv%2CDa%2CFi%2CPl%2CCs%2CHu%29.zip","filesize":3809197282,"score":8.2,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing","desc":"<p>The Need for Speed series returns, this time reverting back to the 'chase' arcade experience instead of a racing simulation. Top speed racing is the name of the game, where you must outchase not just the opposing drivers, but the cops.</p><p>Choose from a selection of today's (and yesterday's) top sports cars, including the Ferrari F50, Porsche 911 and a range from the likes of Ford, Corvette, BMW, Lotus, Mercedes, Aston Martin, the McLaren F1 and a lot more.</p><p>The competitive race mode allows you to take on other drivers and beat them to the line. A selection of tracks allows you to not only dodge incoming traffic, but perform deadly jumps and stunts to receive points. These points, combined with the points recieved from your finishing position, can unlock new cars and tracks.</p><p>The Hot Pursuit mode combines all the major elements of the competitive mode with the chance to out run the cops. They will throw everything at you to try and stop you, including running you off the road, setting up road blocks and unleashing an attack helicopter equiped with missiles. Three busts by the cops ends the race.</p>"},{"name":"Need for Speed: Most Wanted","year":2005,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART16/Need%20for%20Speed%20-%20Most%20Wanted%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%2CSv%2CDa%2CFi%2CPl%29.zip","filesize":3628805335,"score":7.9,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing > Vehicle simulator","desc":"<p><em>Need for Speed: Most Wanted</em> is in fact a cross between the Underground and the Hot Pursuit spin-offs. The player must gain notoriety by racing in the streets and attracting the attention of the cops in order to ascend in the Black List of illegal racers. In the end he must face no.1, Razor who tricked him out of his own car and used it to get to the top.</p><p>Many racing modes are carried on from NFSU2 with the addition of \"Milestones\", special events where the driver must evade capture and/or disable police cars by bringing down Pursuit Breakers, specially marked buildings such as gas stations and water towers. For each one of the 15 Blacklisted opponents, the player must win a specific number of events from each of the two main types and gain enough notoriety in the process. The player can invest bet money to buy new cars or improve his existing one's looks and performance so that he remains competitive.</p><p>In <em>Most Wanted</em>, Josie Maran replaces Brooke Burke as the racer girl. The plot is furthered through use of FMV video with live actors and digital sets, which has been heavily enhanced so that it looks quite real.</p>"},{"name":"Need for Speed: Most Wanted (Black Edition)","year":2005,"developer":"","url":"sony_playstation2_n/Need%20for%20Speed%20-%20Most%20Wanted%20-%20Black%20Edition%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%29.zip","filesize":3626767872,"score":7.4,"genres":"Special edition > Digital extras > Extra content / game > Physical extras","desc":"<p>This is a special edition of Need for Speed: Most Wanted that celebrates the 10th anniversary of the Need for Speed series.</p><p>This edition includes:</p><ul><li>Need for Speed: Most Wanted</li><li>2 exclusive vehicles: a '67 Camaro, the only American classic in Need for Speed Most Wanted, and a specially-tuned BMW M3 GTR street machine right out of the box in Online (Xbox only) and Quick Race modes.</li><li>8 custom rides - Eight specially-tuned rides with hand-selected body kits, spoilers, rims, roof scoops, and more are unlocked and available in Online (Xbox only) and Quick Race modes. Featured cars: Supra, Lotus Elise, Porsche 911 GT2, Mercedes-Benz SL65 AMG, Corvette C6, Mercedes-Benz SL 500, Porsche 911 Carrera S, and Corvette C6.R.</li><li>Exclusive Pursuit Challenge that features waves of supercharged SUV cops and the most aggressive police tactics.</li><li>3 exclusive races, unlocked and available to drive right from the start.</li><li>Exclusive and unlocked vinyls</li><li>Bonus DVD with vehicle showcases, an exclusive car art gallery, ten Need for Speed Most Wanted movies, a behind-the-scenes look at the creation of the in-game cinematics with Josie Maran</li></ul>"},{"name":"Need for Speed: ProStreet","year":2007,"developer":"Electronic Arts Black Box","url":"PS2_COLLECTION_PART16/Need%20for%20Speed%20-%20ProStreet%20%28Europe%29%20%28En%2CNl%2CSv%2CDa%2CFi%2CPl%2CCs%2CHu%29.zip","filesize":3058811092,"score":7.1,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Vehicle simulator > Licensed","desc":"<p><em>Need For Speed: ProStreet</em> is the 11th game in the NFS series.</p><p>It doesn't just include new and more detailed graphics, it includes a new type of gameplay. The game doesn't have a Free Roam mode (as in Underground 2, Most Wanted or Carbon), but it has an Event Map, similar to Juiced's Event Calendar.</p><p>The player's main goal in this game is to become the \"King of the street\". Nothing new. However, there are no more illegal races in the game - all of the available races are sponsored, and the action takes place on different racing tracks. No more traffic, no more in-town driving.</p><p>The game features 2 gameplay modes. Career (you start your \"life\" as a lowlife race driver and over time you will conquer everyone) and free play (where you can race unlocked cars and unlocked tracks).</p><p>As usual, the game includes a jukebox where you can listen to some singles, used by EA as the game's Sound Track.The game also includes new car models, and the classic racing modes except for cop chases, since ProStreet does not promote illegal racing. Also as usual, when you first start the game you will be prompted to create an alias (profile). You can choose which one will be loaded when you start the game again. After creating the alias, you are prompted to choose your difficulty settings.</p><p>All versions, except for the PlayStation 2 and Wii, contain online multiplayer modes.</p>"},{"name":"Need for Speed: Undercover","year":2008,"developer":"Exient Entertainment","url":"PS2_COLLECTION_PART16/Need%20for%20Speed%20-%20Undercover%20%28Europe%29%20%28En%2CNl%2CPl%2CRu%2CCs%2CHu%29.zip","filesize":3281087606,"score":6.5,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing","desc":"<p>Chase or Be Chased.</p><p>You never thought it would turn out like this-an all-out chase where you’re the hunted. And the hunter. Now you must use all of your experience-and every ounce of skill- to infiltrate and take down a ruthless international crime syndicate, outrun the law, & unlock the truth that puts an end to this chase once and for all.</p>"},{"name":"Need for Speed: Underground","year":2003,"developer":"Electronic Arts Black Box","url":"PS2_COLLECTION_PART16/Need%20for%20Speed%20-%20Underground%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":2201358263,"score":7.6,"genres":"Racing / Driving > 1st-person > Behind view > Real-time > Direct control > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p><em>Need For Speed: Underground</em> is the seventh game in the long running <em>Need For Speed</em> racing series. </p><p>The game revolves around illegal night time street racing with heavily modified import cars and has been greatly influenced by the movie <em>the Fast And The Furious</em> and its sequel. Players get the chance to build their own racing machine almost from the ground up, with hundreds of real licensed parts and lots of licensed cars, including the Mazda RX-7 and the Nissan Skyline GT-R. The game also features over 100 single player races and a hip hop/hard rock soundtrack including artists such as Mystikal, Rob Zombie, and the Crystal Method.</p>"},{"name":"Need for Speed: Underground 2","year":2004,"developer":"Electronic Arts Black Box","url":"PS2_COLLECTION_PART16/Need%20for%20Speed%20-%20Underground%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CDa%29%20%28v2.00%29.zip","filesize":3068299013,"score":7.7,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p>This installment in the Need for Speed series, Underground 2 is a racing game based on illicit, night time races, with the player gaining street credit, cash and access to unique tuner parts by schooling the competition.</p><p>Taking place in a massive, open city, NFS Underground 2 allows players to explore the city at will, engaging random challengers and moving into the coveted Underground Racing League. Once in the Underground Racing League, the player advances first by race wins, then with building up their tuner car and taking on tougher opponents. The objective is to win all Underground Racing League engagements and trick out your car to the max.</p><p>The PC version is the only version that allows the user to save magazine screen shots of your tricked out car to disk.</p>"},{"name":"Need for Speed: Underground J-Tune","year":2004,"developer":"Electronic Arts Black Box","url":"sony_playstation2_n/Need%20for%20Speed%20-%20Underground%20J%20%28Japan%29.zip","filesize":2371785135,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p>A Japan only release of Need for Speed Underground that includes changes to that game. Changes include voices being dubbed into Japanese, car model branding being localized, some of the unique vinyls being replaced with seven exclusive Art Factory vinyls. and an increase from 23 to 27 magazines.</p>"},{"name":"Negima! 3-jikanme - Koi to Mahou to Sekaiju Densetsu! (Engeki-ban)","year":2006,"developer":"Konami Computer Entertainment Japan Co., Ltd.","url":"sony_playstation2_n/Negima%21%203-jikanme%20-%20Koi%20to%20Mahou%20to%20Sekaiju%20Densetsu%21%20%28Japan%29%20%28Engeki-ban%29.zip","filesize":3379774853,"score":"","genres":"Action > Adventure > 1st-person > 3rd-person (Other) > Anime / Manga > RPG elements > Visual novel > Fantasy > Licensed","desc":"<p>The third period of <em>Negima</em> RPG games for PlayStation 2 based on the manga with the same name comes in two different releases: theatrical and live. This theatrical version comes with different cover art and instead of a music disc contains an audio drama CD titled \"Mahora Girls Vol.4\". The gameplay consists of visual novel style dialogues and choices using 1st-person perspective, as well as exploration, talking to NPCs and battles using 3rd-person perspective.</p>"},{"name":"Neo ATLAS III","year":2000,"developer":"FlipFlop Productions","url":"sony_playstation2_n/Neo%20Atlas%20III%20%28Japan%29%20%28v2.00%29.zip","filesize":1528769664,"score":"","genres":"Adventure > Simulation > Diagonal-down > Free-roaming camera > Real-time > Managerial / business simulation > Sandbox / open world > Direct control > Menu structures > Naval / watercraft > Africa > Asia > Europe > Fantasy > Historical events > North America > Oceania > South America > Comedy > Detective / mystery","desc":"<p>Neo ATLAS III is a further enhancement of the PlayStation iterations of the Atlas series, featuring improved graphics taking advantage of the PlayStation 2, as well as additional story content and mysteries.</p><p>As in the prior titles, you run a trading company in Portugal in the 15th century, and your goal is to explore the mysteries of the world while bringing in a tidy profit. As your admirals search far and wide, you get the privilege of believing or disbelieving in their reports of the world afar, and this influences the shape of the map as you uncover more and more of it. In turn, this affects the resources available, treasure you find, events which occur, and obstacles in your way.</p><p>Unlike prior Neo ATLAS titles, the world is a globe from the start, rather than depending on your belief in the concept as you progress. It additionally brings back the concept of discovering the \"cultures\" of the world as the home computer iterations did, and in this version you can enable people to migrate which affects the cultural makeup of cities and regions.</p>"},{"name":"Neo Contra","year":2004,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"PS2_COLLECTION_PART16/Neo%20Contra%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2040144822,"score":6.8,"genres":"Action > Diagonal-down > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Neo Contra is the sequel to Contra: Shattered Soldier. The game is a 3-D Shooter with lots of action and huge boss battles. Unlike Shattered Soldiers this game has a top-down perspective. The game is set in the future with Bill Razer's return. He teams up with a samurai, Genbei Jaguer Yagyu. The game takes about two hours to beat but will take you several tries to make it there.</p>"},{"name":"NeoGeo Battle Coliseum","year":2005,"developer":"SNK Playmore Corporation","url":"PS2_COLLECTION_PART16/NeoGeo%20Battle%20Coliseum%20%28Europe%2C%20Australia%29.zip","filesize":1737806259,"score":7.1,"genres":"Action > Side view > Fighting","desc":"<p><em>NeoGeo Battle Coliseum</em> assembles 40 characters from past NeoGeo fighters and action games into one big tag-team brawl, along with some new ones.</p><p>The characters represent the games King of Fighters, Fatal Fury, Mark of the Wolves, Samurai Shodown, Art of Fighting, Last Blade, King of the Monsters, World Heroes, Athena, Aggressors of Dark Kombat, Kizuna Encounter: Super Tag Battle and Metal Slug. The two new characters are Ai and Yuki, along with a secret character not found in the arcade version. The background graphics have been improved, there is newly arranged music, a colour edit mode, command editor function and a new Tag Play mode.</p>"},{"name":"NeoGeo Online Collection: Complete Box - Gekan","year":2009,"developer":""},{"name":"NeoGeo Online Collection: Complete Box - Jōkan","year":2009,"developer":"SNK Playmore Corporation"},{"name":"Neon Genesis Evangelion: Ayanami Ikusei Keikaku with Asuka Hokan Keikaku","year":2003,"developer":"Westone Bit Entertainment"},{"name":"Neopets: The Darkest Faerie","year":2005,"developer":"Idol Minds, LLC","url":"sony_playstation2_n/Neopets%20-%20The%20Darkest%20Faerie%20%28USA%29.zip","filesize":2641884099,"score":7,"genres":"Action > Behind view > Puzzle elements > Fantasy > Licensed","desc":"<p>Players control Tor and Roberta, two animal-like Neopets on a quest against evil. By switching between the two at any time, players can use Tor's up-close melee attacks or cause damage from afar with Roberta's spells. This game stays faithful to the traditional third-person action-adventure. Magical items and weapons gained along the way will develop the characters' abilities and strengths. In particular, elementally-aligned motes can be attached to weapons and armor as a combat bonus. There are many puzzles and side-quests along the way, and players will fight evil Neopets.</p>"},{"name":"Nettai Teikiatsu Shoujo (Shokai Genteiban)","year":2007,"developer":"Nine's Fox","url":"sony_playstation2_n/Nettai%20Teikiatsu%20Shoujo%20%28Japan%29%20%28Shokai%20Genteiban%29.zip","filesize":1568634517,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Takashi is a high-school student aspiring to become a weather forecaster. One day, a new transfer student gets transferred to his class. Her name is Tomoe, a red-haired girl who seems to be a magnet for troubles. This peeks Takashi's interest as he thinks there's more to it. Some time later, a huge tropical cyclone is generated over the southern sea and sets on a straight path towards the town Takashi lives in. At the same time, Japanese government proclaims that Tomoe is a person of interest and may be dangerous. Now Takashi is let with a dilemma on his hands... if he can survive the cyclone.</p>"},{"name":"Never7: The End of Infinity","year":2004,"developer":"KID Corp.","url":"sony_playstation2_n/Never%207%20-%20The%20End%20of%20Infinity%20%28Japan%29.zip","filesize":3188180757,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Makoto is a student who never attends the lectures at the school. As a punishment, he has to attend an extra seminar on an island with other classmates. However, when he arrives on the island, strange thing start happening. A girl is found dead on April 6th, with a small bell in her hand. Immediately after that, Makoto finds himself in bed and sees the date - April 1st! Was the vision of the girl just a dream, or does he possess the power to predict the future? This is what he will have to find out as a series of strange deaths make his seminar much more suspenseful than he would have thought.</p><p><em>Never7</em> is a visual novel. The player reads text accompanied by still anime-style pictures and from time to time makes decisions, which branch the plot, lead to different endings, and unlock new scenarios.</p>"},{"name":"NFL 2K2","year":2001,"developer":"Visual Concepts Entertainment, Inc.","url":"sony_playstation2_n/NFL%202K2%20%28USA%29.zip","filesize":1510986551,"score":8.2,"genres":"Sports > Diagonal-down > Direct control > Multiple units/characters control > Football (American) > Licensed","desc":"<p>NFL 2K2 is a complete football simulation, giving you a variety of ways to play.  You can compete in a single exhibition game, start up a franchise, or move directly to the playoffs.</p><p>NFL 2K2 uses a TV-style presentation, featuring telestration, action replays, sideline animations, stadium lighting and a director feature that zooms in on the play.</p><p>Included in NFL 2K2 are all the teams and plays from the 2001-2002 season, including stadiums and uniforms.</p><p>You have the option to choose a team and select your own roster, or you can create your own team and take them through a franchise.</p>"},{"name":"NFL 2K3","year":2002,"developer":"Visual Concepts Entertainment, Inc.","url":"sony_playstation2_n/NFL%202K3%20%28USA%29.zip","filesize":2068928059,"score":8.6,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (American) > Licensed","desc":"<p>Sega brings another season of its football game in NFL 2K3.  With new lifelike player animations, new play-calling intelligence, an on-the-fly audible system, and a brand new ESPN broadcast system with the famous overlays, scores, and highlights, it adds a whole new feel to the series. In these days of free agency when championships are won or lost in the front office as well as down on the field, NFL 2K3’s new Franchise mode gives you total team control as player, coach, and general manager -- track the best players, make the smartest trades, and build the most dominant team in the league. It is complete with all of the updated rosters, NFL alignment changes, and authentic stadiums redesigned in full 3D for the 2002 season.  Also new to the series is online play.</p>"},{"name":"NFL Blitz 2002","year":2002,"developer":"Midway Games, Inc.","url":"sony_playstation2_n/NFL%20Blitz%202002%20%28USA%29.zip","filesize":1213313066,"score":7.4,"genres":"Sports > 3rd-person (Other) > Top-down > Arcade > Football (American) > Licensed","desc":"<p>The <em>NFL Blitz 20-02</em> incarnation promises deeper gameplay, more animations, better AI, more mini-games, and even harder hits. Still focusing on its roots of hard-hitting football action with no rules whatsoever, the game hopes to hit the consoles as hard as its players hit each other.</p>"},{"name":"NFL Blitz 2003","year":2002,"developer":"Point of View, Inc.","url":"sony_playstation2_n/NFL%20Blitz%202003%20%28USA%29.zip","filesize":780579131,"score":7.7,"genres":"Sports > 3rd-person (Other) > Direct control > Football (American) > Licensed","desc":"<p>This latest update to the NFL Blitz series offers more options and refines the options presented earlier in the series.  Of significant note is the create a player option.  By desiging the look of the player as well as assigning various stats to their abilities, you can craft a whole team to compete in the league.  Also improved is the artificial intelligence in the one-player game setting.  Fantasy Stadiums in exotic locales and Fantasy Players are another new option.  Updated rosters, schedules, uniforms, and stadiums including the addition of the Houston Texans.</p>"},{"name":"NFL Blitz Pro","year":2003,"developer":"Midway Home Entertainment, Inc.","url":"sony_playstation2_n/NFL%20Blitz%20Pro%20%28USA%29.zip","filesize":1454466054,"score":"","genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p><em>NFL Blitz Pro</em> is the 2003 entry in Midway's arcade football series. Like NHL Hitz Pro however, this entry moves away from its arcade roots toward more of a simulation style, while still retaining some arcade flavor in that there are no penalties or injuries and players can \"catch on fire\". The main changes to the predecessors are full 11-on-11 teams, standard 10 yard downs and more support for running plays.</p><p>Game modes include Quick Play and Exhibition, a full Season, a 10-season Franchise and 4- or 8-player tournaments. There also is a create-a-player feature. While there are no hot routes and audibles are limited to a pre-determined set of four, the Impact Player feature allows control of one specific player who can make last-minute adjustments. Only the PlayStation 2 version includes an online mode for multiplayer games and roster updates.</p><p>The game has many special features unlockable through the Blitz Shop. Credits for the shop are earned by performing feats in non-franchise games. Available for purchase are fantasy teams and stadiums, and new game modes: in Butterfingaz mode, every hit leads to a fumble, while Cyberleague features robot teams and an exploding ball. Also available is the customary Big Head mode, among several others. Old-school Blitz series arcade gameplay is available in Blitz Classic mode.</p>"},{"name":"NFL GameDay 2001","year":2000,"developer":"RedZone Interactive, Inc.","url":"sony_playstation2_n/NFL%20GameDay%202001%20%28USA%29.zip","filesize":465251072,"score":6.6,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>This edition features lifelike player specific graphics that make players look like their real life counterparts. Also new is commentary by Dick Enberg and Phil Simms.  Another feature is total-control passing and running. Total-control passing lets you lead, overthrow, and underthrow your receivers so that you can throw more completions and prevent defenders from intercepting your passes.  The play editor has been improved making it easier to make new patterns for your receivers and running backs. The general manager mode has also been changed, mostly to help you with the draft so you can easily see what areas of your team need improvement.</p>"},{"name":"NFL GameDay 2002","year":2001,"developer":"989 Studios","url":"sony_playstation2_n/NFL%20GameDay%202002%20%28USA%29.zip","filesize":1177414485,"score":6.7,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>This year's edition features motion-capture animation and commentary by Dan Fouts and Dick Enberg.</p><p>There are four primary modes of play, including season, arcade, franchise, and exhibition. The franchise mode keeps track of full individual player and team statistics over multiple seasons. Players will be drafted, improve throughout the course of their career, and retire into the game's hall of fame. The franchise mode also keeps track of statistics for the coach and the franchise. Career win/loss records, playoff appearances, and Super Bowl wins are tracked.  Season mode allows players to compete for one individual season, while exhibition mode allows for a single game to be played.  Arcade mode features simplified controls for those players looking to simply mix it up.</p>"},{"name":"NFL GameDay 2003","year":2002,"developer":"SCEA Sports Studio - Red Zone","url":"sony_playstation2_n/NFL%20GameDay%202003%20%28USA%29.zip","filesize":1369063664,"score":6.9,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>Play a full season with your favorite team or try the franchise mode and build a legacy. You can even create teams and players.</p><p>In general manager mode, when you go into the off-season, several different things happen. First, you'll see a list of players who have retired from your team and the reasons they've left, which are usually related to injuries or diminishing skills. If you lose some key players, then you'll need to make every effort to ensure that those positions are filled by free agents with similar skills or rookies who have solid potential. You're frequently stuck with trying your luck in the draft, where you can select a rookie based on how you finished the season, like in the real NFL draft. GameDay has a feature that gives you a breakdown on the draft and provides you with an overall rating for each rookie. Following the draft, you have to sign your rookies with whatever cap money you've set aside for that purpose. When you're all done, it's time to start the next season.</p><p>There's also a tournament mode where you can select up to 16 teams. There's also a regular season mode, similar to the franchise mode, except it lacks the off-season part.</p><p>GameDay's best new feature is online play support. You can view your online stats, and see who the best players are online to challenge.</p>"},{"name":"NFL GameDay 2004","year":2003,"developer":"SCEA Sports Studio - Red Zone","url":"sony_playstation2_n/NFL%20GameDay%202004%20%28USA%29.zip","filesize":2272808683,"score":7.2,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>This year's edition has many new features that include tournaments, built-in message boards, virtual e-mail, and a voice recognition option.</p><p>NFL GameDay 2004 also showcases the standards in mode selection. There are preseason, season, general manager, tournament, practice, and franchise management options. The general manager mode functions as the game's franchise mode in which you can take a team through numerous seasons in hopes of winning a Super Bowl, or, building a dynasty. The general manager mode lets you perform actions like trading players, signing free agents, drafting new players, managing playbooks, and viewing statistics to get a glimpse at the top players. </p><p>Also featured is online play. There are message boards where you talk with other players and also e-mail other players by using your online nickname, and 989 Sports can even give you feedback on the game. The online mode also offers tournaments as well as stat tracking.</p><p>The commentary team is headed up by Dick Enberg and Dan Fouts.</p>"},{"name":"NFL Head Coach","year":2006,"developer":"EA Tiburon","url":"sony_playstation2_n/NFL%20Head%20Coach%20%28USA%29.zip","filesize":2424895630,"score":6.4,"genres":"Simulation > Sports > Strategy > 3rd-person (Other) > Managerial / business simulation > Football (American) > Licensed","desc":"<p>Taking a detour from its traditional football games, Electronic Art presents its first 3-D NFL strategy game, <em>NFL Head Coach</em>, focusing more on a coaching perspective than a player's perspective. You experience the day to day job as a NFL coach, recruiting big players, meeting with assistant coaches and running practice drills.</p><p>Become a legend in the coaching industry by creating pro bowl caliber players, winning Super Bowls and mentoring coordinators into great coaches themselves in hopes of earning a spot in the Hall of Legends. You can also use the USB Headset to call plays like a real coach, giving you a much more realistic feel to the game as well. It gives you an idea of how tedious a head coaches job can really be.</p>"},{"name":"NFL QB Club 2002","year":2001,"developer":"Acclaim Studios Austin","url":"PS2_COLLECTION_PART16/NFL%20QB%20Club%202002%20%28Europe%29.zip","filesize":493405884,"score":6.4,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>This is the eighth installment of the <em>Quarterback Club</em> series. This edition features all of the teams and players of the current NFL ranks and allows the player to unlock legendary passers such as John Elway, Dan Marino, and Steve Young. Kevin Harlan and Bill Maas provide commentary. </p><p>The game features a total of four primary modes of play: season, exhibition, playoffs, and pro bowl. Also featured in QB Club 2002 is the quarterback challenge mode, which allows the player to take favorite NFL quarterbacks through a competition focusing on four different skill sets: speed and mobility, accuracy throw, read and recognition, and long distance throw.</p>"},{"name":"NFL Street","year":2004,"developer":"EA Tiburon","url":"PS2_COLLECTION_PART16/NFL%20Street%20%28Europe%29.zip","filesize":1693713792,"score":7.9,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Tricks / stunts > Football (American) > Licensed","desc":"<p><em>NFL Street</em> is an arcade style football game that is based on pick up football. <em>NFL Street</em> is 7 on 7 with players playing both offense and defense. There are no helmets or stadiums in <em>NFL Street</em>, instead the games are played in parks, on the street and in the dirt lots.</p><p>In <em>NFL Street</em>, the player should strive not just to win but to look good doing it. The player can achieve this by performing style moves during a play. These might be a taunting run, a spectacular spin, or a crazy pass.</p><p><em>NFL Street</em> has Quick Game, Pickup Game, NFL Challenge and Online game modes.</p>"},{"name":"NFL Street 2","year":2004,"developer":"EA Tiburon","url":"PS2_COLLECTION_PART16/NFL%20Street%202%20%28Europe%29.zip","filesize":901250680,"score":7.6,"genres":"Sports > 3rd-person (Other) > Tricks / stunts > Direct control > Football (American) > Licensed","desc":"<p><em>NFL Street 2</em> is the second game in EA's arcade football series. Players try to become the world's best urban footballer by conquering other teams using several gravity-defying tricks like up-the-wall passes, off-the-wall catches, and highlight-reel wall jukes.</p><p>Like the other games in the Street franchise, the game is played with a small amount of players and a focus on arcade gameplay. Unlike the first game, the walls can now be used for run-up passes and receptions, or bonuses by aiming for posters and hotspots.</p><p>There are twelve arenas to compete in (2 unlockable) and the players are licensed from the 2004 NFL rosters. Multiplayer is available on the PS2, PSP and Xbox versions. In singleplayer, there are various game modes such as NFL Challenge where the player has 150 days to build a team to take on a squad of legends. Progress is based on milestones where you sharpen specific skills to reach the top or beat sufficient teams. When five days are left, the team enters a final tournament.</p><p>Another one is the new Own the City mode, where the player create a new character and has to win all street games in the city. New players need to be recruited from pick-up games. The final team to beat consists of rapper Xzibit and a team of NFL stars. Characters created in this mode can be imported into the NFL Challenge, but also in Madden NFL 06.</p><p>The PSP version is a faithful port, with some of the cut scenes removed, and 3 new street modes added for Wi-Fi multiplayer: Street Slalom (an obstacle course), Style Point Challenge, and Style Standoff, a end zone dance contest, similar to Space Channel 5, next to the regular multiplayer modes. Up to four players can play on a single PSP in the Party Play game modes such as the 2 Minute Challenge and Jump Ball Challenge.</p>"},{"name":"NFL Street 3","year":2006,"developer":"Buzz Monkey Software, LLC","url":"PS2_COLLECTION_PART16/NFL%20Street%203%20%28Europe%2C%20Australia%29.zip","filesize":744650212,"score":6.9,"genres":"Action > Sports > 3rd-person (Other) > Tricks / stunts > Football (American) > Licensed","desc":"<p>The NFL Street Series is back. The game continues its humorous approach to NFL, like all of the various sports games in the EA BIG lineup. The game plays out as a wrestling/football game. You play as different NFL teams in backyards of different cities. The different modes include elimination, attack mode and possession-based limits. The game is very offensive minded. Other modes are exhibition, quick game, and four-on-four and open-field showdown. Visually the game includes various animations, taunts, and many touchdown poses.</p>"},{"name":"NGT: US Open 2002","year":2002,"developer":"Carapace"},{"name":"NHL 06","year":2005,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART16/NHL%2006%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%2CFi%2CCs%29.zip","filesize":1767175866,"score":7.9,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>New rules and updated rosters and season schedules feature in this update of the longrunning <em>NHL</em> series, as do many new features.</p><p>Deking is now performed using the left analog stick, with swift signature moves of star players that confuse opponents and reward skill. The same stick is used to increase the accuracy when shooting. While preparing for a shot, a bull's-eye appears in the enemy goal and you can quickly move the target to the corners for precision. To add to the individual qualities, statistics such as speed and size are now reflected during gameplay in the players' momentum and turning radius. To get past opponents quickly, you can generate momentum for quick speed boosts.</p><p>With the introduction of R.P.M. (Realistic Puck Momentum) dynamics, there is more randomness with the puck, as a shot off the mask can now stun goalies. Another small addition is the deformation of the ice during the match. In the player creation mode, where you can now apply bruises, broken noses, black eyes and scars to your players, the thumbstick is used for \"face sculpting\" - changing the different features.</p><p>All the regular game modes are present, of which the Dynasty Mode from the previous version is the most complete, with scouting and full management options, inside and outside the arena. Contrary to the last game, you can now intervene during simulated AI games and win the match for your team.</p><p>The PC, PS2 and Xbox version support online multiplayer games, and as a special bonus, the original NHL 94 game, one of the first in the series, has been included with the PS2 edition.</p>"},{"name":"NHL 07","year":2006,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART16/NHL%2007%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%2CFi%2CCs%29.zip","filesize":2209680143,"score":7.9,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>EA Sports' 2007 installment of their NHL Hockey franchise refreshes all of the existing NHL team rosters and schedules and adds the Czech Elite League teams to the European Elite League rosters.</p><p>Player modeling has been improved and features new life-like player specific moves and styles. Additional enhancements to the analog stick controls have also been made, making players easier than ever to control, while still mainting the realism of true hockey.</p><p>Other features returning from previous editions include GM Mode, single game and season play, Dynasty mode and online play.</p><p>The XBOX 360 Version now includes support the for Skill Stick controller for precision player control.</p>"},{"name":"NHL 08","year":2007,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART16/NHL%2008%20%28Europe%29%20%28En%2CDe%2CSv%2CFi%2CCs%29.zip","filesize":2401139322,"score":8.1,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>The 2008 edition of EA's ice hockey simulation includes many improvements to the Skill Stick feature that was introduced in NHL 07. Another novelty is the Goalie mode where players can manually take control of the goalie through a 3rd-person camera. Players can create and work towards custom players and a rumble feature introduces a new form of communication where the player can call for the puck by tapping the ice with the stick.</p><p>In addition to NHL teams, this edition also features international teams and the 29 AHL teams, as well as the new jerseys for the regular NHL season.</p><p>The PS3 and Xbox 360 version do not contain a fantasy draft to create a dream team to take through the Stanley Cup in the Dynasty mode, but have the Sweden's Elitserien and Finland's SM-liiga. Commentary in this version is done by Gary Thorne and Bill Clement.</p>"},{"name":"NHL 09","year":2008,"developer":"Electronic Arts Canada","url":"sony_playstation2_n/NHL%2009%20%28Europe%2C%20Australia%29%20%28En%2CDe%2CSv%2CFi%2CRu%2CCs%29%20%28v2.00%29.zip","filesize":3406785408,"score":8.4,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>The 2009 edition of EA Sports ice hockey simulation refreshes all of the existing NHL and international team rosters and schedules and adds the Russian Elite League and sees the the addition of the \"Be A Pro\"-mode in which players create a new player and only control him on the field. This mode is also available in multiplayer for up to 12 players in 6-on-6-matches in which every player on the ice is controlled by a human.</p><p>The defensive stick control has also been revamped and now allows for example to prevent direct passes. And it's possible to control both puck and stick with one hand in the offensive, allowing the player to better outplay the goalie. Of course all this complicates the already complex controls even more so that now it's possible to switch to the control scheme from NHL '94 which only needs a few buttons and one analog stick to be successful.</p>"},{"name":"NHL 2001","year":2000,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART16/NHL%202001%20%28Europe%29%20%28En%2CSv%2CFi%29.zip","filesize":618788879,"score":8,"genres":"Sports > Behind view > Diagonal-down > Side view > Top-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>Lace up the skates and play with or against all 30 NHL teams including the new expansion Columbus Blue Jackets and Minnesota Wild. NHL 2001 invites the world to play with the addition of 20 international teams including Ukraine and Latvia. Feel the full hockey flavor by building a custom team with the jersey editor, logo importer, and customizable city and team names. EA SPORTS puts you in the game with the \"Face in the Game\" feature -- witness fans throw their hats on the ice in your honor after a hat trick. With a variety of game modes including Quick Game, Season Play, Career Mode, Playoffs and Tournaments, all the goals are just a slap shot away. </p>"},{"name":"NHL 2002","year":2001,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART16/NHL%202002%20%28Europe%29%20%28En%2CSv%2CFi%29.zip","filesize":600983232,"score":8.1,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>NHL 2002 is EA's latest incarnation of their NHL series.</p><p>New features over previous years includes the \"Breakaway Cam\", which causes the game to slow down, turn blue, and go into letterbox mode when you're one on one with the goalie, and \"EA GameStory\", which tracks your progress and rewards you for outstanding performance.</p><p>NHL 2002 is the first in the series to include NHL Cards, which is the equiviliant of Madden's NFL Cards.  By performing special moves, such as scoring within the first 30 seconds or winning 10 face-offs, you get points, which you can then use to buy cards.</p><p>NHL 2002 includes all the professional NHL teams, as well as the International teams, such as Team Canada and U.S.A.  Every stadium is included, and so is every player.</p><p>NHL 2002 has many game modes, including Season, Quick Play, Shootout, and Exhibition.  It also has a \"Create-A-Skater\" mode.</p>"},{"name":"NHL 2003","year":2002,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART16/NHL%202003%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%2CFi%2CCs%29.zip","filesize":3051167483,"score":7.8,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>This year's edition features many different modes of gameplay for the NHL enthusiast.  Players can start the game right away in play now mode, play an international game, play through a playoff series, or start a franchise. The franchise mode puts you in charge of a team for a 10-year legacy. You can either play every game during a season or simulate each game and take a manager role. After each season, you have the option to play around with the roster in anticipation of next season. You can draft new players, sign free agents, make trades with other teams, and retire old players. Statistics are kept throughout the life of a franchise in several categories.</p><p>Also new this year is the use of the right analog stick to execute manual dekes and slip the puck past the goalkeeper.</p>"},{"name":"NHL 2004","year":2003,"developer":"Electronic Arts Black Box","url":"PS2_COLLECTION_PART16/NHL%202004%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%2CFi%29.zip","filesize":2406127106,"score":8.1,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>The \"best selling pro hockey franchise\" is back with the 2004 edition, and it's loaded with more.</p><p>Like Madden NFL 2004, NHL 2004 has a deep career mode, titled Dynasty Mode. You take on the role of GM for up to twenty seasons. As GM, you'll have to negotiate contracts, conduct drafts, make trades, sign free agents, make sure your players are getting the training they need, and more. If you're good enough, you may make it into the GM Hall of Fame.</p><p>Besides Dynasty mode, you've got the basic game modes; Season, Exhibition, and Playoffs.</p><p>The control for NHL 2004 has been refined, allowing for more precise movement than in the previous games. Precise passes, shots, and accurate skating are accomplished by simply tapping the button.</p><p>NHL 2004 features a new fighting engine, allowing for more accurate and realistic fights. The right analog stick controls \"Bruise Control\", which lets you perform different moves by tilting the stick in different directions. Before you get into fights, you'll need to agitate a player, and this is where his Agitation Meter comes in. Losing the game, being checked, making sloppy passes all raises his Agitation Meter, until he is ready to burst and will fight at the slightest poke check.</p><p>NHL 2004 contains the EA Sports Bio, which is a feature found on all console versions of EA Sports game. Playing more EA Sports titles, playing them for a long time, and winning special accomplishments (such as your first shutout in NHL 2004 or your first number one finish in NASCAR Thunder 2004) will earn you a higher Gamer Level, and will reward you with bonuses, such as cheat codes and new stadiums. This feature isn't found on the PC version.</p><p>In addition to the standard roster of NHL teams, there are thirty nine international teams for you to choose from, such as Germany's DEL or Sweden's Elitserien, plus the usual U.S.A., Canada, and other regulars.</p><p>The PlayStation 2 and Windows versions of NHL 2004 support online play.</p>"},{"name":"NHL 2005","year":2004,"developer":"Electronic Arts Black Box","url":"PS2_COLLECTION_PART16/NHL%202005%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%2CFi%29.zip","filesize":2866449443,"score":7.7,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>EA sports long running hockey franchise continues for the 2005 season. This year tweaks features from last year and adds some new enhancements to the game engine. </p><p>The graphics have been even more improved from last year. Now the 'cyber players' look so close to their real life counterparts that their hard to distinguish. Player models are updated with more life like skin, hair and features. This includes more facial animations and emotions. The coaches are also redone in this manner. The in-game meanwhile adds a whole slew of new animations, cutscenes, goalie animations and enhancements to the fighting engine.</p><p>In the control department, NHL 2005 adds a new feature called Open-Ice control. This feature lets you potentially control players without the puck, set up for picks, double team and more. Shooting wrist shots and slap shots are also now mapped to separate buttons for more flexibility.</p><p>The gameplay introduces a new feature as personalities for players. Such that a player like Tie Domi will play more like an enforcer, while Markus Naslund will rely more on finesse and skill. You will be relied on to balance this personalities on each line of a team to create chemistry. The dynasty mode has been redone with a new interface and tweaks. Free Agency and Trading has been tweaked along with the handling of a team. The new system allows you to keep up to date on weekly injuries/streaks reports, letters from your owner, players, etc. </p><p>This year adds new modes such as the World Cup tournament and  Free-for-All. In Free-For-All players compete 2 on 2 trying to score on the other while also defending. Along with the modes come minor tweaks, such as the options for no touch icing, delayed offsides and shootout options for tied games. The create a team feature remains in this year but create a player didn't make it in. Jim Hughson and Craig Simpson return with commentary.</p>"},{"name":"NHL 2K10","year":2009,"developer":"Visual Concepts Entertainment, Inc.","url":"sony_playstation2_n/NHL%202K10%20%28USA%29.zip","filesize":2610402713,"score":7,"genres":"Sports > Diagonal-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>NHL 2K10 returns to the ice; in its second year of being developed by Visual Concepts. </p><p>New features include improved graphics/presentation; which includes brand new player models, player faces and all new intros unique for all 30 teams in the league.</p><p>There is also a revamped franchise mode; which includes new GM Personalities, Roster Management, League Records, Team States, and support for fantasy drafts and created teams.</p><p>The Wii version includes Mii Superskills that offers five new mini-games to play with your own avatar.  These includes Hardest Shot, Fastest Skater, Accuracy Shooting, Breakaway Relay, and Goalie Supersave.</p><p>Also on the Nintendo Wii this year is support for Wii motion plus allowing for 1:1 on ice motions, as well as online support with 2K's full suite (leagues, team up, quick matches). The game also supports Wii Speak so you can chat with your friends during online games.</p>"},{"name":"NHL 2K3","year":2002,"developer":"Treyarch Corporation","url":"sony_playstation2_n/NHL%202K3%20%28USA%29.zip","filesize":1035569086,"score":8,"genres":"Sports > Diagonal-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p><strong>NHL 2K3</strong> is the first hockey game on the XBox to support XBox Live.</p><p>Using it's partnership with the ESPN sports network, Sega has created NHL 2K3 using the same presentation method as ESPN. Natural camera transitions, cut scenes, and overlay graphics are all used in cooperation with ESPN to give the game a more realistic feel.</p><p>All the standard game modes are here, from exhibition games and playoff games, to a very in depth Franchise mode that gives you complete control over your team. You act as the general manager, coach, scout and player. You can negotiate contracts, make trades, and draft rookies.</p><p>On the ice, you have a lot of control over your team as well. You can anchor lines with key players, rotate your lines to always be matched up, and make sure you have the advantage every which way.</p><p>You can also play online via XBox System Link or XBox Live. The latter allows you to connect to a player from anywhere, and engage in a game of hockey. Using the headset, you can taunt or compliment your opponent, without any interruption to the game.</p><p>Rosters are from the 2002-2003 season.</p>"},{"name":"NHL 2K6","year":2005,"developer":"Kush Games, Inc.","url":"sony_playstation2_n/NHL%202K6%20%28USA%29.zip","filesize":3098135628,"score":7.9,"genres":"Sports > Diagonal-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>Among the <em>2K6</em> edition's new features is the Crease Control, which allows you to take direct control of the goalie and slow everything down for a matter of seconds, giving you time to find where the puck is and prepare a save.</p><p><em>NHL 2K6</em> has a complete feature set, including Franchise Mode, Exhibition, ProControl, On-The-Fly Coaching, the Enforcer system, and, of course, multiplayer over Xbox Live.</p><p>Most of the rule changes adopted by the NHL following the lockout of the past season are incorporated into the game.</p><p>All your teams are here, from the Toronto Maple Leafs to the Boston Bruins to the Ottawa Senators and the Tampa Bay Lightning. There are also All-Star and Legend teams to play.</p>"},{"name":"NHL 2K7","year":2006,"developer":"Kush Games, Inc.","url":"PS2_COLLECTION_PART16/NHL%202K7%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2742540062,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>Updated to the 2007 NHL season, the <em>NHL 2K7</em> ice-hockey game also includes a few changes from NHL 2K6, including an improved camera that gives a better view of the action while still showing the field. This parametric camera is closer down than a typical top-down camera and includes automatic zooming and turning based on the players' position on the ice. Other improvements are the option to shadow opponents to put pressure on them and increase their chance of making a mistake. This is done by holding the left bumper and steering the right control stick towards another player. The amount of pressure can then be determined through taps, with hard tapping inevitably leading to a powerful check.</p><p>Aside from that, the game modes from the previous version are identical, as is most of the gameplay and the mini-games included. It has a new rivalry system where statistical bonuses and takeaways are created depending on how players play in games against their rival teams. The main improvements introduced to the Xbox 360 version of the game, such as the \"cinematic\" presentation system, are not carried over. This is most visible in the graphical area.</p>"},{"name":"NHL 2K8","year":2007,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART16/NHL%202K8%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3010119619,"score":7,"genres":"Sports > Diagonal-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p><em>NHL 2K8</em> is an instalment of 2K Sports' yearly hockey series. The player can control any of the 30 NHL teams and bring them to Stanley Cup glory on either Franchise or Season mode, or just play them in simple exhibition matches.</p><p>The franchise mode was extended, allowing more control of the team during the off-season (such as improvements in the draft and in negotiations), as well as tweaks to player progression and other changes to improve the realism of post-lockout NHL management - waivers, salary cap management, free agents and more. On the ice, while the game remains mostly unchanged, the new Superstar Moves bring a spark of world class hockey to the game, particularly on breakaways and penalty shots.</p>"},{"name":"NHL 2K9","year":2008,"developer":"Visual Concepts Entertainment, Inc.","url":"PS2_COLLECTION_PART16/NHL%202K9%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2441930300,"score":7.1,"genres":"Sports > Diagonal-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p><em>NHL 2K9</em> is 2K Sports' entry into Hockey gaming for the 2008-2009 season. The game is built on the same engine that many of the previous 2K hockey games used, and features include Season, Franchise, 2-on-2 Mini Rink, 4-on-4 Pond Hockey, and Shootout modes. Season Mode allows you to take basic control over an NHL team and guide them through an entire 82-game schedule, as well as (if you're good enough) the playoffs. Franchise is like Season Mode, but much deeper. In it, you guide a team through multiple seasons of hockey, and have control of options like drafting, contract signings, free agency, and hiring staff. The 2-on-2 and 4-on4 modes allow you and a friend to hand-pick a team of players (3 or 5, depending on the mode) and face off in a wide-open, arcade-style hockey game. Shootout works exactly like a shootout in real hockey: three skaters per side alternate taking shots at the goaltender, and most goals wins. Aside from game play modes, you also have the option of creating your own player or your own team from scratch, as well as modifying the existing roster (ie make trades, edit line combination) to your taste.</p><p>NHL 2K9 is the first NHL Sports title for the Nintendo Wii. The Wii version features motion controls for shooting, passing, checking, and even fighting. There's also a new system for those who like to take control of the goaltender, which involves mimicking controller movements as they flash up on the screen in order to make saves. </p><p>The PS3 and XBOX 360 version include online play, in which you can jump into a quick game with up to 11 other players, or participate in online leagues or tournaments.</p><p>In the broadcast booth, Bob Cole and Harry Neal have been replaced by the San Jose Sharks' announcing team of Randy Hann and Drew Remenda. The game soundtrack mainly comprised of energetic rock tunes, and features the likes of The Offspring, Bad Religion, and Mastodon.</p>"},{"name":"NHL FaceOff 2001","year":2001,"developer":"SolWorks","url":"sony_playstation2_n/NHL%20FaceOff%202001%20%28USA%29.zip","filesize":470918624,"score":7,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>This year's edition allows you to compete against legendary players including Gordie Howe, Bobby Hull, Phil Esposito, and Marcel Dionne.  New Jersey Devils announcers Mike Emrick &amp; Darren Pang call the games.</p><p>There is an exhibition mode for up to eight players with the Multitap, a season mode for multiple players, playoff mode, tournament mode, a practice option, and shoot-out mode, that helps to sharpen your breakaway and deke moves.</p><p>Also new this year are the updated rosters of all NHL teams including expansion teams Columbus BlueJackets and Minnesota Wild.</p>"},{"name":"NHL FaceOff 2003","year":2002,"developer":"SolWorks","url":"sony_playstation2_n/NHL%20FaceOff%202003%20%28USA%29.zip","filesize":2578904172,"score":6.2,"genres":"Sports > Diagonal-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>NHL FaceOff 2003 allows you to play the role of General Manager for an NHL team. Players can build a team using drafts, free agency, trades, and signings.  Other modes of play include skating in single elimination Tournament Mode as either an NHL or international team, going one-on-one with the goalkeepers in Shootout Mode, or Practice Mode.</p><p>There are also three difficulty settings for the different modes of play: rookie, normal, and veteran.</p><p>New presentations in the gameplay include watching the players walk through the tunnel before the game, pre-game warm-ups, player shoves after the whistle, jibes from the penalty box, and post-game celebrations.</p>"},{"name":"NHL Hitz 2002","year":2001,"developer":"Black Box Games","url":"sony_playstation2_n/NHL%20Hitz%202002%20%28USA%29%20%28v2.00%29.zip","filesize":489156520,"score":7.9,"genres":"Sports > 3rd-person (Other) > Hockey > Licensed","desc":"<p>Midway introduces hockey with its no-rules twist that is seen in NFL Blitz.  Hockey may have fewer rules than football, but NHL Hitz features hard-hitting action and very simple 3-on-3 gameplay.  The game has franchise modes for a created team that you can design along with championship and exhibition modes.  You earn attribute points and credits that you can use to unlock items and improve your players along the way.  There are several mini-games and extras hidden deep in the game for you to unlock.  NHL Hitz is Midway's attempt at making the most action-packed hockey game to ever hit consoles.</p>"},{"name":"NHL Hitz 2003","year":2002,"developer":"Black Box Games","url":"PS2_COLLECTION_PART16/NHL%20Hitz%202003%20%28Europe%29.zip","filesize":810429129,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p>This game uses the same three-on-three style that debuted in Hitz 2002.  The 2003 installment has larger rinks, bigger crowds, a referee, and animated coaches.  All 30 NHL teams are represented with motion-capture animation, and you can build your own players with the Create-Player option. The game's Season mode now allows for trades, stat tracking, and player awards.</p><p>Up to four players can play each other in exhibition mode. Season mode puts you into a standard NHL schedule, but you can change to a shorter season if you want. There is also a small numer of hockey-related minigames, such as keep-away. Franchise mode is where you pick and name your team, name your players, and play against other teams to earn experience points. Those points can be used to upgrade your players in categories such as toughness, speed, passing, and agility. After beating all the lesser teams in a tier, you can move on to battle a \"boss team\" for that region. Beating that team nets you some new equipment for your players, which also improves their stats.</p>"},{"name":"NHL Hitz Pro","year":2003,"developer":"Next Level Games, Inc.","url":"PS2_COLLECTION_PART16/NHL%20Hitz%20Pro%20%28Europe%29.zip","filesize":1471555573,"score":7.8,"genres":"Sports > 3rd-person (Other) > Top-down > Hockey > Licensed","desc":"<p>NHL Hitz Pro is Midway's 2003/2004 entry into the licensed hockey market. For the 2004 sports season, Midway introduced a directive to move their sports titles away from over-the-top arcade-style gameplay, and introduce a more sim-like approach to sports. For NHL Hitz Pro, this meant moving away from 3-on-3 hockey to 5-on-5 hockey gameplay to make the game more authentic for the demands of the sim hockey player. While NHL Hitz Pro still maintains many of the arcade-style elements that were a signature feature of the Hitz series such as checks over the boards and hits through glass, the gameplay has been tuned to provide an experience that is accurate to the sport of hockey. That being said, the player has extensive options for tuning the gameplay for either a fast-paced arcade experience, or a slower, more sim-like style of play.</p><p>As with competing titles, Hitz Pro supports a franchise mode, season and exhibition gameplay and a game tutorial/practice mode. The title also sports a pickup hockey mode with several environments that are reminiscent of playing hockey in outdoor venues.</p>"},{"name":"NHRA Championship Drag Racing","year":2005,"developer":"Lucky Chicken Games, Inc.","url":"sony_playstation2_n/NHRA%20Championship%20Drag%20Racing%20%28USA%29.zip","filesize":823055973,"score":"","genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Licensed","desc":"<p>Compete in the world's fastest cars at 20 authentic tracks and 35 of NHRA's top stars. Choose a quick race and take on the computer or go head-to-head with a buddy or start a career and take on legends of drag racing. Take on superstar Greg Anderson of the Pro Stock division, the perennial powerhouse Tony Schumacher of the Top Fuel Dragsters or take on the legendary Funny Car driver John Force.  Choose a sponsor and hire a crew chief to set up your car or if your feeling confident, tune the car your way. Get it right, you win, get the big sponsors, the best equipment and become champion. Get one thing wrong... and meet Mr. Wall and see your car torn up in painful slo-mo.</p>"},{"name":"NHRA Drag Racing: Countdown to the Championship","year":2007,"developer":"Pipeworks Software, Inc.","url":"sony_playstation2_n/NHRA%20Drag%20Racing%20-%20Countdown%20to%20the%20Championship%20%28USA%29.zip","filesize":435896929,"score":"","genres":"Racing / Driving > 3rd-person (Other) > Licensed","desc":"<p><em>NHRA Drag Racing: Countdown to the Championship</em> is a simulation of drag-racing. It features four different classes of car (Top Fuel, Funny Car, Pro Stock, and Pro Stock Motorcycle), with the PSP version having Jet Powered as a bonus in Quick Race mode. There are 5 modes: Tutorial, Quick Race, Single Event, Career, and Vs.</p><p>The tutorial is a series of videos that walk the player through the steps needed to properly race without getting disqualified. Quick race lets the player select a vehicle, driver, and weather, then simply race. (Unique to the PSP version is the ability to race different classes against each other, with the less powerful car getting a head start.) Single event mode strings together multiple races. It includes 4 qualifying rounds, then the top 16 racers will move on to an elimination tournament. Career follows a driver through multiple events, tracking money from wins and spent on repairs. Vs is a quick race between two human players. On the PSP, this is done through ad-hoc wireless; on the PS2, split-screen.</p><p>There are three difficulty levels: rookie, veteran, and pro. Higher difficulties have tougher opponents, and require more precise aiming. In addition, rookie difficulty allows for auto-align on the track, and auto-tuning during the pre-race tune-up. No matter what game mode is being played, the pre-race tuning is incredibly important. There is only a limited amount of time (5 minutes in rookie difficulty, 3 otherwise) to pick the best settings, and everything from tire pressure to weight distribution is included. Finally, additional drivers can be unlocked by winning championships in career mode.</p>"},{"name":"Ni Hao, Kai-Lan: Super Game Day","year":2009,"developer":"High Voltage Software, Inc."},{"name":"Nicktoons Movin'","year":2004,"developer":"Mass Media, Inc.","url":"sony_playstation2_n/Nicktoons%20Movin%27%20%28USA%29.zip","filesize":496364359,"score":"","genres":"Action > Sports > 3rd-person (Other) > Puzzle elements > Bowling > Flight / aviation > Naval / watercraft > Licensed","desc":"<p><em>Nicktoons Movin'</em> is an EyeToy mini-game collection based on popular Nickelodeon cartoons. The game features 13 different mini-games with different skill levels based on series like SpongeBob SquarePants, Jimmy Neutron, The Fairly OddParents and Danny Phantom. The players steer a hang glider, control a bowling ball, defend a goal against pucks playing as a goalie, guide a submarine, zap ghosts, solve a classic puzzle by moving the pieces, and more - all by EyeToy registered movement of the player's hands.</p><p>The game features voice acting done by the original actors from the cartoons and the characters deliver numerous lines of dialog throughout the game.</p>"},{"name":"Nicktoons Unite!","year":2005,"developer":"Blue Tongue Entertainment Pty, Ltd.","url":"sony_playstation2_n/Nicktoons%20Unite%21%20%28USA%29.zip","filesize":566485790,"score":"","genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Fantasy > Licensed","desc":"<p><em>Nicktoons Unite!</em> is a 3D action platformer game. The game combines and links the TV series SpongeBob SquarePants, Danny Phantom, The Fairly OddParents, and The Adventures of Jimmy Neutron: Boy Genius.</p><p>In the game you take control of the four heroes: Danny Phantom, SpongeBob SquarePants, Timmy Turner and Jimmy Neutron. Gameplay includes platforming, defeating enemies and puzzle solving. Each characters has their own special abilities and weapons to overcome obstacles and enemies. These can be upgraded by collecting tokens. The game can be played with up to four players. When playing with less players or solo players, you can freely switch between them with the additional characters being controlled by the AI.</p><p>The game starts with Plankton taking over Bikini Bottom. SpongeBob then witnesses Jimmy Neutron's robot dog Goddard exiting a portal, delivering a message from Jimmy Neutron who explains that bad guys from the four shows have banded together. He asks SpongeBob for help who then enters the portal. On the other side Jimmy, Danny Phantom and Timmy Turner are waiting. It appears Jimmy’s latest invention the Universe Portal Machine (that allows travel between worlds) has fallen into the hands of Professor Calamitous. He used it to contact Plankton, Vlad Plasmius, Denzel Crocker and formed the Syndicate. Now they are stealing energy from the four worlds.</p>"},{"name":"Nicktoons: Attack of the Toybots","year":2007,"developer":"Blue Tongue Entertainment Pty, Ltd.","url":"sony_playstation2_n/Nicktoons%20-%20Attack%20of%20the%20Toybots%20%28Europe%2C%20Australia%29.zip","filesize":991637857,"score":6.7,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Fantasy > Licensed","desc":"<p><em>Nicktoons: Attack of the Toybots</em> is a side-scrolling platform game. It involves popular characters from several Nicktoons franchises such as Spongebob Squarepants, Timmy Turner, Jimmy Neutron, Gir, Ren, and Tak. Professor Calamitousfuels his army by feeding fairies krabby patties. This makes them emit a gas that, when mixed with ghost energy, can fuel robots. When Patrick Star and SpongeBob SquarePants deliver a large amount of krabby patties to a house, they are all sucked up and accidentally Patrick is taken along. After selecting a character, players traverse the insides of Professor Calamitous' toy factory to fight evil robot copies of themselves.</p><p>The main gameplay element of Nicktoons: Attack of the Toybots is the platforming style which involves actions such as jumping across gaps, balancing on moving terrain and collecting blue energy cubes to use as currency for unlocking more playable Nicktoons characters. Furthermore, the side-scrolling manner of play is broken up by bonus levels which allow the player to take control of a Mech suit used to destroy the Professor's factory. There is also an option for a second player to join at any time for co-operative play.</p><p>The game features levels set in different universes based on the franchises of the different characters. For each level and universe, a different set of characters becomes playable.</p>"},{"name":"Nicktoons: Battle for Volcano Island","year":2006,"developer":"Blue Tongue Entertainment Pty, Ltd.","url":"sony_playstation2_n/Nicktoons%20-%20Battle%20for%20Volcano%20Island%20%28USA%29.zip","filesize":897552378,"score":6.6,"genres":"Action > 3rd-person (Other) > Platform > Fantasy > Licensed","desc":"<p><em>Nicktoons: Battle for Volcano Island</em> is a 3D action platformer game and sequel to Nicktoons Unite! The game combines and links the TV series SpongeBob SquarePants, Danny Phantom and The Fairly OddParents. Jimmy Neutron is not playable this time but does make a cut-scene appearance.</p><p>The heroes are summoned to Volcano Island by its crab inhabitants after Mawgu, an ancient evil has broken free of its imprisonment. Mawgu has interrupted the summoning ritual scattering the heroes across the island. It's up to you to stop the Mawgu evil and find the scattered heroes.</p><p>In the game you take control of the heroes: Danny Phantom, SpongeBob SquarePants, Timmy Turner, Patrick Star, Sandy Cheeks and Sam Manson. Gameplay includes platforming and defeating enemies. The game can be played solo or in co-op. Players can freely switch between characters with the remaining being controlled by the AI. Costumes for the characters and bonus levels can be unlocked during play.</p>"},{"name":"Nightmare of Druaga, The: Fushigino dungeon","year":2004,"developer":"Chunsoft Co., Ltd.","url":"sony_playstation2_n/Nightmare%20of%20Druaga%2C%20The%20-%20Fushigino%20Dungeon%20%28USA%29.zip","filesize":447210415,"score":"","genres":"Role-playing (RPG) > Isometric > Fantasy","desc":"<p>In this turn-based dungeon crawler you play as Gil, whose beloved fiancee has been kidnapped by a sorceress and taken to the Tower of Druaga. Gil puts on a suit of armor that radiates light, and proceeds into the dungeon to save his beloved Ki.</p><p>The map is set up in a grid, and you do everything in turns, like moving, battling, or recovering. The timing of moves is also critical, and the game feels like a real-time game because you aren't waiting like you typically would for turn-based games.</p><p>The Nightmare of Druaga: Fushigino dungeon is a collaboration between the Mysterious Dungeon series and the arcade classic The Tower of Druaga.</p>"},{"name":"NiGHTS into Dreams..","year":2008,"developer":"Sonic Team","url":"sony_playstation2_n/NiGHTS%20into%20Dreams...%20%28Japan%29.zip","filesize":2369482568,"score":7.3,"genres":"Action > Compilation > Side view > 2D scrolling","desc":"<p>This version of NiGHTS into Dreams... is a port of the Saturn version with identical gameplay, but also incorporates the levels included in Christmas NiGHTS into Dreams... as a bonus. It also contains the feature from that version where the characters wearing special seasonal clothing during certain holidays. The game offers two graphics modes: a remake mode with updated graphics and a classic SEGA Saturn graphics mode. Other additions include support for 16:9 wide screen (PS2), an illustration gallery and a movie viewer mode.</p><p>The later released version released for the PS3, Xbox 360 and Windows is another port of the Saturn version, but offered as a digital download release and not limited of Japan. The content is identical to the PS2 version released four year before, but with redesigned HD graphics and support for contemporary resolutions. All versions offer the option to switch back to the original Saturn visuals. Some content of the PS2 version is not available, such as a two-player mode and the ability to play as Sonic. Additions for the 2012 release include leaderboards and achievements/trophies.</p>"},{"name":"NiGHTS into Dreams.. (Nightopia Dream Pack)","year":2008,"developer":""},{"name":"Nightshade","year":2003,"developer":"SEGA Wow Inc.","url":"sony_playstation2_n/Nightshade%20%28USA%29.zip","filesize":3664034981,"score":6.9,"genres":"Action > 3rd-person (Other) > Anime / Manga > Hack and slash","desc":"<p>The Nakatomi company is searching for the pieces of the Akujiki sword, shattered by Hotsuma in the predecessor, Shinobi. Luckily, the Oboro ninja clan has since reformed. As Hibana, kunoichi (female ninja) of the Oboro clan, you are charged with the task of finding the pieces of the Akujiki before Nakatomi does.</p><p>Nightshade is a sequel to Overworks' Shinobi for the PS2. Like its predecessor, it features several levels full of challenging enemies to fight using a combination of your sword, shuriken, and magic scrolls. Speed and stealth remain the emphasis, as you use stealth dashes and the ability to walk on walls to perform long strings of kills called tates. One of the main improvements to the gameplay system is the ability to create much larger combos/tates. In order to facilitate this, they've expanded the battle system to include flying kicks to break your opponent's guard and stealth attacks to kill unsuspecting foes in a single blow.</p>"},{"name":"Ninja Assault","year":2002,"developer":"Now Production Co., Ltd.","url":"PS2_COLLECTION_PART16/Ninja%20Assault%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":359009374,"score":6.1,"genres":"Action > 1st-person > Rail shooter > Japan (Ancient/Classical/Medieval)","desc":"<p><em>Ninja Assault</em> is a light gun rail shooter set in ancient Japan. Princess Koto has been kidnaped by the evil shogun Kigai. Kigai plans to use her in a resurrection ritual. In the game you take on the role of Guren and Gunjo two gunslinger ninja’s.</p><p>The game was originally released in the arcades and later also on the PS2. The PS2 version has besides the arcade version, one extra playable character named Aoi, three extra chapters in story mode for each of the characters and Bonus games.</p><p>The game moves the player's character automatically as he has to gun down enemies. To reload the player has to shooting off screen. First aid kids can be picked up during the game to replenish health. The game can be played solo or with a friend.</p>"},{"name":"Ninjabread Man","year":2005,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART16/Ninjabread%20Man%20%28Europe%29.zip","filesize":45502254,"score":3.4,"genres":"Action > Behind view > Platform > Fantasy > Martial arts","desc":"<p>Happiness and peace reign in Candy Land, when all of a sudden a horde of menacing jelly monsters, rageful bees and menacing cupcakes invades the land. A samurai as valiant as Ninjabread Man can't keep idle at the sight of such a thing: he starts the journey to save the world then, brandishing his cutting sword.Ninjabread's adventure is structured as a platform game; a level is cleared when all the eightrods scattered around are gathered; once levels have been completed a first time, new game modes will be available if they are played further, such as Time Attack and Hidden Pickups, the latter consisting in having to find hidden objects.As regards the jelly monsters, enraged bees and snapping cupcakes, they can be attacked by distance attacks and close ones, employingNinja Stars, Samurai Kicks, the cutting sword obviously, and more.</p>"},{"name":"Nitrobike","year":2008,"developer":"Left Field Productions, Inc.","url":"PS2_COLLECTION_PART16/Nitrobike%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":951017728,"score":5.5,"genres":"Action > Racing / Driving > Sports > 3rd-person (Other) > Arcade > Tricks / stunts > Motorcycle","desc":"<p>Nitrobike is a take on the classic game of Excitebike, where the player takes the helm of a motorbike equipped with a nitro rocket, racing in 20 different tracks and over 60+ different events. The player must avoid stationary obstacles and slower riders.</p><p>There is career mode where the player can unlock new characters and bikes by winning these events and a six-player online capability. The controls mostly consist of using the Wii remote to steer and accelerate as well as boosting with the nitro rocket. There is also a four-player bowling game where players can hurl their rider at a set of huge bowling pins.</p>"},{"name":"Noble Racing","year":2008,"developer":"Brain in a Jar Ltd.","url":"PS2_COLLECTION_PART16/Noble%20Racing%20%28Europe%29.zip","filesize":106110185,"score":"","genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing","desc":"<p>Noble Automotive Ltd. is one of the most exciting car manufacturers in the world today, famous for producing some of the most extreme sports cars on the planet. Now you get your chance behind the wheel of some of their greatest creations in Noble Racing.</p><p>Lovingly recreated in stunning detail each of these cars is now yours to unlock and drive out on the track. Can you master the handling characteristics and tame the raw power of these fearsome machines come race day? At last, this is your chance to find out!</p><p>* Official licensed Noble cars to master including: M12 GT3-R, M400, Noble Racing Car and the M14 Concept Car!<br>* Show your racing mastery across 12 two-stage gruelling circuits<br>* Track Challenge, Club Event, Practice Drive and Car Challenge single player modes<br>* 2-player head-to-head and full grid race modes</p><p>Some PlayStation®2 Classics contents may not display correctly when using a standard definition television.</p>"},{"name":"Nobunaga no Yabō: Kakushin with Power Up Kit & Sangokushi 11 with Power Up Kit (Twin Pack)","year":2008,"developer":""},{"name":"Nobunaga no Yabou - Ranseiki","year":2002,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_n/Nobunaga%20no%20Yabou%20-%20Ranseiki%20%28Japan%29.zip","filesize":454487994,"score":"","genres":"Strategy > Point and select > Historical events > Japan (Ancient/Classical/Medieval) > War","desc":"<p><em>Nobunaga no Yabou: Ranseiki</em> is a tactical strategy game set in 16th century feudal Japan. It is ninth game in <em>Nobunaga's Ambition</em> war simulation series.</p>"},{"name":"Nobunaga no Yabou - Soutenroku","year":2003,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_n/Nobunaga%20no%20Yabou%20-%20Soutenroku%20%28Japan%29.zip","filesize":437565203,"score":"","genres":"Strategy > Behind view > Isometric > Turn-based > Historical events > Japan (Ancient/Classical/Medieval) > War","desc":"<p><em>Nobunaga no Yabō: Sōtenroku</em> is a turn-based tactical strategy game set in 16th century feudal Japan. It is the tenth title in the <em>Nobunaga's Ambition</em> series. This game returns to castle-taking battles. It is single-player only. There is also no multiplayer in any versions of the game.</p>"},{"name":"Nobunaga's Ambition: Iron Triangle","year":2006,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_n/Nobunaga%27s%20Ambition%20-%20Iron%20Triangle%20%28USA%29.zip","filesize":517402229,"score":7.3,"genres":"Strategy > Top-down > Turn-based > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p><em>Nobunaga's Ambition: Iron Triangle</em> is another entry in KOEI's long-running series of grand strategy games. As in the previous instalments, the player assumes the role of a Japanese feudal lord during the famous Sengoku period (from the XV to the XVII century).</p><p>The main game screen shows an overhead 3D rendered view of the landscape, showing buildings and moving armies belonging to each clan. The player gives orders using a menu with a list of commands, that branch out with several options: City (to construct buildings), Personnel (to employ officers), Military (to move and attack with the army), Strategy, Diplomacy (to negotiate treaties and exchange technology) and others to review the resources. The game is paused while issuing the orders, and they are only executed when in Active mode, where time passes and seasons change.</p><p>The different seasons have an impact on certain resources and activities, like harvesting and drafting. The scheduled actions and rank position of the clans can be reviewed at any time, on a separate screen. The game has several scenarios and special modes, with historical notes coming up when the game time synchronizes with some major events in Japan's timeline.</p>"},{"name":"Nobunaga's Ambition: Kakushin with Power Up Kit","year":2008,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_n/Nobunaga%20no%20Yabou%20-%20Kakushin%20with%20Power-Up%20Kit%20%28Japan%29.zip","filesize":1351268864,"score":"","genres":"Compilation > Strategy > Top-down > Turn-based > Wargame > Historical events > Japan (Ancient/Classical/Medieval) > War","desc":"<p>The compilation of Nobunaga's Ambition: Iron Triangle and Nobunaga no Yabō: Kakushin - Power Up Kit.</p>"},{"name":"Nobunaga's Ambition: Ranseiki with Power Up Kit","year":2002,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_n/Nobunaga%20no%20Yabou%20-%20Ranseiki%20with%20Power-Up%20Kit%20%28Japan%29.zip","filesize":457913527,"score":"","genres":"Compilation > Strategy > Diagonal-down > Wargame > Multiple units/characters control > Historical events > Japan (Ancient/Classical/Medieval) > War","desc":"<p>The compilation of Nobunaga no Yabō: Ranseiki and Nobunaga no Yabō: Ranseiki - Power Up Kit.</p>"},{"name":"Nobunaga's Ambition: Rise to Power","year":2004,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_n/Nobunaga%27s%20Ambition%20-%20Rise%20to%20Power%20%28USA%29.zip","filesize":700689377,"score":"","genres":"Strategy > 3rd-person (Other) > Top-down > Turn-based > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p><em>Nobunaga's Ambition: Rise to Power</em> is the first instalment in KOEI's long-running Nobunaga's Ambition strategy game series to feature full 3D environment. The player once again take the role of Nobunaga Oda, or one of his rival warlords, and set to unify 16thy century Japan under one ruler.</p><p>The scenarios spans from 1551 to Nobunaga's death in 1582, and feature hypothetical 'What if' turns of event. The many characters present in the game affect how events turn out with their unit stats and skills. From the castle and surrounding areas, the player issues orders to manage the resources and growth of the land under the warlord's control. The construction of the village and the life of its people evolve in real-time. In battle, either field battles or sieges, up to 24 units on each side ranging from spearmen to cannon troops can engage in real-time 3D battle. Routing the enemy lowers their morale, which allows the use of charges and counter attacks. In siege battles, the adequate use of skills and resources is key to victory.</p><p>When most of the land is under the player's control, the 'Kessen' command becomes available. Kessen is an all-or-nothing all-out attack that will either result in the unification of the land, or the total loss of the player's land.</p>"},{"name":"Nobunaga's Ambition: Soutenroku with Power Up Kit","year":2003,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_n/Nobunaga%20no%20Yabou%20-%20Soutenroku%20with%20Power-Up%20Kit%20%28Japan%29.zip","filesize":831616965,"score":"","genres":"Compilation > Strategy > Top-down > Turn-based > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p>The compilation of Nobunaga no Yabō: Sōtenroku and Nobunaga no Yabō: Sōtenroku - Power Up Kit.</p>"},{"name":"Nobunaga's Ambition: Tenkasousei with Power Up Kit","year":2005,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_n/Nobunaga%20no%20Yabou%20-%20Tenka%20Sousei%20with%20Power-Up%20Kit%20%28Japan%29.zip","filesize":1025723890,"score":"","genres":"Compilation > Strategy > Top-down > Turn-based > Wargame > Multiple units/characters control > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p>The compilation of Nobunaga's Ambition: Rise to Power and Nobunaga no Yabō: Tenka Sōsei - Power Up Kit.</p>"},{"name":"Noddy and the Magic Book","year":2006,"developer":"Neko Entertainment SARL","url":"PS2_COLLECTION_PART16/Noddy%20and%20the%20Magic%20Book%20%28Europe%29%20%28En%2CFr%2CPt%2CNo%2CDa%29.zip","filesize":1787971694,"score":"","genres":"Action > Racing / Driving > 3rd-person (Other) > Mini-games > Automobile > Fantasy > Licensed","desc":"<p>Noddy is a small wooden boy who lives in the magical world of Toyland where all toys are alive and adventures never cease! He has lots of friends and whenever any of them are in trouble Noddy is always willing to lend a helping hand. The two naughty goblins Sly and Gobbo have stolen Big Ears' magic book and are using it to play tricks on people.</p><p>Join Noddy around Toyland by car, rocket, and airplane as he makes right the wrongs caused by Sly and Gobbo and tries to catch the two troublemakers so they don't cause anymore mischief!</p><p>Key Features: * Play and interact with Noddy and his good friends from Toyland * The game is an exciting 3D adventure with fun arcade style mini games * 5 levels of difficulty</p>"},{"name":"North Wind: Eien no Yakusoku (Shokai Genteiban)","year":2005,"developer":"","url":"sony_playstation2_n/North%20Wind%20-%20Eien%20no%20Yakusoku%20%28Japan%29.zip","filesize":2734291268,"score":"","genres":"Special edition > Physical extras","desc":"<p>This special edition release includes:</p><ul><li>North Wind: Eien no Yakusoku game</li><li>Audio drama CD</li></ul>"},{"name":"NPPL Championship Paintball 2009","year":2008,"developer":"FUN Labs Romania S.R.L.","url":"sony_playstation2_n/NPPL%20Championship%20Paintball%202009%20%28USA%29.zip","filesize":1175385998,"score":"","genres":"Sports > 1st-person > Shooter > Paintball > Licensed","desc":"<p><em>NPPL Championship Paintball 2009</em> is a first-person paintball game that features real life tournament locations and official branded paintball gear. Players can choose between different professional playballers, with different statistics, and teams. In the career mode a character starts as a division 2 competitor and by winning matches credits are earned to upgrade gear and equipment. Attributes that can be upgraded, with a maximum of 40, are speed, accuracy, communication, marker handling and reload.</p><p>The game also includes the ability to create your own field. Along with single-player modes, including capture-the-flag, there is online multiplayer for up to fourteen players. The game also features over 35 tournaments with regulation professional paintball field layouts. In the Exhibition Mode, Woodsball can be played next to Speedball. It includes an option to cheat by attempting to wipe a hit. This is done by timing a swinging bar in a cheat meter.</p>"},{"name":"NRA Gun Club","year":2006,"developer":"Jarhead Games Inc.","url":"sony_playstation2_n/NRA%20Gun%20Club%20%28USA%29.zip","filesize":271704947,"score":"","genres":"Simulation > 1st-person > Shooter > Licensed","desc":"<p>NRA Gun Club is a non-violent, first person shooter.  Over 100 licensed firearms are in the game and the game is approved by the National Rifle Association.</p><p>The game features Certification Mode, Quick Match and Mini Games. In Certification Mode, the player can unlock courses and events by meeting the minimum target score for each course they pass.</p><p>Plinking, trap &amp; skeet shooting, long-range rifle and practical/tactical courses challenge the player throughout the course of Certification Mode. </p><p>These levels are also available immediately from Quick Match mode if the user wishes to practice a specific range or course. All ranges and courses are available in Quick Match for practice only.</p><p>Pistols, rifles and automatic weapons are available in the game; the player can read short descriptions for any of the firearms.</p><p>Mini Game modes include variants of Darts, Golf, Tic-Tac-Toe and Bowling. An amusement-park style Shooting Gallery is also available for players to enjoy.</p><p>Up to 8 players can play against each other in \"hot seat\", turn-by-turn play.</p>"},{"name":"NRL Rugby League","year":2003,"developer":"Sidhe Interactive"},{"name":"NUGA-CEL! Nurture Garment Celebration","year":2009,"developer":"Idea Factory Co., Ltd.","url":"sony_playstation2_n/Nuga-Cel%21%20Nurture%20Garment%20Celebration%20%28Japan%29.zip","filesize":913639524,"score":"","genres":"Role-playing (RPG) > Simulation > 3rd-person (Other) > Anime / Manga > Turn-based","desc":"<p>Tokyo-23 is a land in turmoil. Each of the 23 districts has its own leader hoping to unify Tokyo-23 under one rule. Some do so for peace and justice, while some do so for their own personal gain. The Red Lance Corps of Minato Area are a team of schoolgirl warriors led by a charismatic young leader, whom they simply call \"Master\". Together, they must fight to unite Tokyo-23, but obviously that is easier said than done...</p><p><em>NUGA-CEL!</em> is a light-hearted simulation RPG set in a fantasy version of modern-day Tokyo. The player, as the unseen Master, must assemble a team of female fighters, dress them up in super-powered cosplay outfits, and lead them into battle to unify all of Tokyo-23. The game is divided into days, during which the player can manage their territories and team members, shop for and create new outfits, and either enter a dungeon or attack a neighboring territories. The available territories are often dictated by the story progression, and there are also various scenarios centering on the different characters in the player's team.</p><p>The defining aspect of the game is its cosplay system. In-game battles are turn-based, up to 3-vs-3. Each character can be assigned an outfit, which each give them different skills and abilities, not to mention appearance. However, as characters take damage, so do their clothes, which will eventually be destroyed leaving them vulnerable. It is necessary to switch and repair outfits to keep characters in fighting shape. Outside of battle, the player can purchase items and outfits at shops, and there is also an extensive crafting system where new outfits and items can be produced.</p>"},{"name":"NUGA-CEL! Nurture Garment Celebration (Genteiban)","year":2009,"developer":""},{"name":"NYR: New York Race","year":2001,"developer":"Kalisto Entertainment SA","url":"PS2_COLLECTION_PART16/NYR%20-%20New%20York%20Race%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":461787243,"score":6.7,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Arcade > Sci-fi / futuristic > Licensed","desc":"<p>New York Race is game about future racing. Game is inspired by Luc Besson's film \"Fifth Element\". There are more than 30 high-tech flying machines to choose and pilot (including the notorious Taxi and the cool police car).</p><p>There are four different modes available in NYR, the main one being the Championship mode that takes place over four different categories; Qualification, Beginner, Pro and Expert. Other modes include Single Race, Time Attack and the rather cool Keirin mode, that eliminates the contestant in last place at every checkpoint until the last man remains. </p><p>In every race, you can pick up 4 elements which give you an added advantage: <strong>Water</strong> - leaves a liquid sphere behind you that slows your opponents down if they hit it, <strong>Fire</strong> - allows you to shoot a homing fireball at your opponents, <strong>Earth</strong> activates a temporary shield and <strong>Air</strong> - gives you a speed boost.3 Dimensional action allows the player complete freedom of movement on a vertical and horizontal axis.The races take place on 12 tracks, which can be unlocked by advancing through levels. The tracks are divided into four districts: Jet Set, Middle Class, Seedy District and China Town.</p>"}]