[{"name":"P.T.O.: Pacific Theater of Operations IV","year":2002,"developer":"KOEI Co., Ltd.","url":"PS2_COLLECTION_PART19/P.T.O.%20IV%20-%20Pacific%20Theater%20of%20Operations%20%28Europe%29.zip","filesize":385373399,"score":"","genres":"Strategy > 3rd-person (Other) > Isometric > Real-time > Turn-based > Naval / watercraft > Historical events > World War II","desc":"<p>The fourth installment in Koei's P.T.O. series brings strategic naval combat to the PS2.  There are two levels of play: global strategy and resource management are handled with a turn-based system on a world map while individual battles are fought using a real-time system on a much smaller scale.</p><p>The campaign can be played as the Americans, British, Japanese, or Germans, starting either in September 1939 or December 1941.  If a players chooses to be American or Japanese with a 1939 start date, they will sit on the sidelines and watch the war until December 1941, but they will still be able to gather resources and spend them to build units or develop technologies.  Players can also concoct \"what-if\" scenarios by changing which countries belong to which powers: for example, one could play an Alliance of America and Germany against an Axis of Japan and Great Britain, or even play three-on-one for more of a challenge.</p><p>The world map used in the turn-based grand strategy side of the game is broken down into territories connected in a web of lines indicating where fleets may pass from territory to territory.  Game turns on this scale represent one month, and the time it takes a fleet to move from one territory to another correlates loosely to the length of the line connecting them.</p><p>Players collect resources from the territories they control every turn.  Resources include money, iron ore, aluminum, and oil.  Money is used for construction of new units and facilities and to speed scientific development, iron is used in construction of ships, aluminum is used in construction of aircraft, and oil is consumed when fleets move.</p><p>Technological advances are not purchased; instead players direct their scientists to focus on particular developmental paths, and breakthroughs come semi-randomly.  The longer the scientists have been working on a particular problem, the more likely a breakthrough becomes.  Giving the scientists extra money accelerates this process.  In addition to the ship and aircraft types that become available automatically with scientific advancements, players can design their own custom types using whatever technology is available to them at the time.</p><p>Players decide which types of ships and aircraft to build and how many.  Ships are formed into fleets that can be moved about the world map while aircraft can be assigned to defend land-based airfields or assigned to fleets with ships capable of carrying aircraft.</p><p>When two hostile fleets meet in the same territory, or when a hostile fleet enters a territory defended by land-based aircraft, a battle ensues.  Battles are controlled in real-time with a 3-D isometric view.  Players control entire fleets, not individual ships.  Orders include sending a fleet to a particular point, ordering a fleet to attack a particular other fleet or airfield, and launching and recovering aircraft for CAP or to attack a particular fleet or airfield.</p><p>Players can assign the computer to control as much or as little of strategy as desired.  A player who enjoys the turn-based grand strategy but not the real-time battles can have the computer automatically resolve individual battles.  Conversely, a player who enjoys the real time battles but not resource management can assign various aspects of resource management to the computer so that the player only has to decide where to move fleets.  At the extreme, a player could even assign fleet movement to the computer and focus entirely on real-time combat.  The game also offers a scenario mode that skips grand strategy entirely and throws the player into an individual battle.</p>"},{"name":"Pac-Man Fever","year":2002,"developer":"Mass Media, Inc.","url":"sony_playstation2_p/Pac-Man%20Fever%20%28USA%29.zip","filesize":456438852,"score":5.7,"genres":"Action > Strategy > Top-down > Board game","desc":"<p><em>Pac-Man Fever</em> takes place again! This time, Pac-Man is throwing a party and has invited his other Namco friends to join in the activities. Players can choose for the six following characters:</p><p>Pac-Man (from Pac-Man), Ms. Pac-Man (from Ms. Pac-Man), Heihachi Mishima (from Tekken), Tiger Jackson (from Tekken), Astaroth (from Soul Calibur), and Reiko (from Ridge Racer).</p><p>Gameplay is similar to Nintendo's <em>Mario Party</em>, in which each player competes in a set of mini-games to advance around the board of three various worlds (Medieval, Space and Tropical).</p><p>Players set the length of the game (short, medium, long) and play in rounds. Each round begins with a mini-game which determines how far a player can move on the board. Each tile on the board enables players to move forward or go backward, lose, gain, or steal tokens, play a single or two player mini-game, spend earned tokens, or a raffle game to earn redemption tickets.</p><p>With store tiles, players can spend tokens to move forward, move other players backward, buy raffle tickets, or gamble for more tokens.</p><p>Once a player reaches the end of the board, players receive redemption tickets based on how far they got on the board. These can be used to buy each mini-game separately for tournament play outside the game. Once all the mini-games have been purchased, players can add up all of their tickets to total up their overall high score.</p>"},{"name":"Pac-Man Power Pack","year":2008,"developer":""},{"name":"Pac-Man World 2","year":2002,"developer":"Namco Hometek Inc.","url":"PS2_COLLECTION_PART18/Pac-Man%20World%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":929143426,"score":7.4,"genres":"Action > 3rd-person (Other) > Platform > Direct control > Fantasy","desc":"<p>Long ago, an evil stronger then anything before or after it, was trapped underneath a tree, which grew the five golden fruits. Years later the band of ghosts, who continue to roam Pac-World, have stolen the fruits from the tree. Unknown to them, they have also unleashed the evil that lurked beneath the tree on a helpless Pac-World. Only one Pac can return the five golden fruits to the tree and stop both the ghosts and the new evil from destroying Pac-World, and that's Pac-Man.</p><p>Using his famous munching skills, Pac-Man must explore 20 monster, pit and trap filled levels. But of course, the Pac-Pills can be found across each map to aid Pac-Man in his quest.</p><p>The game also features four classic <em>Pac-Man</em> games to unlock, all taken from different Namco compilations. They are, in order of appearance:</p><ul><li>Pac-Man (taken from Namco Museum Vol. 1)</li><li>Ms. Pac-Man (taken from Namco Museum Vol. 3)</li><li>Pac-Mania (taken from Namco Museum Vol. 5)</li><li>Pac-Attack (remake taken from Namco Anthology 2)</li></ul>"},{"name":"Pac-Man World 3","year":2005,"developer":"Blitz Games Ltd","url":"PS2_COLLECTION_PART18/Pac-Man%20World%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1338590534,"score":6.8,"genres":"Action > Behind view > Platform","desc":"<p>Pac-Man is teleported by Orson through 15 different levels to fight Erwin, his army of robots, monsters and Spectral Entities to save the world, Pac-Land and the Spectral Realm. Erwin plans to siphon spectral energy from the Spectral Realm to power his army of robots in order to rule the world. Pac-Man uses punching, Rev Rolls, Butt-Bouncing and various new Power Pellets to defeat Erwin and his minions. Pac-Man also pilots Toc-Man in a battle against Erwin’s robot army.</p><p>Joined by Pac-Man’s old enemies, Orson, Clyde and Pinky, and new friends along the way, Pac-Man adventures through different levels from a boneyard of old bots to a burning tower, up mountains, through deserts and the Spectral Realm to destroy all of Erwin’s Spectral Syphons. In this title, Pac-Man has also been given full speech, voiced by Martin T. Sherman.</p>"},{"name":"Pac-Man World Rally","year":2006,"developer":"Smart Bomb Interactive, Inc.","url":"sony_playstation2_p/Pac-Man%20World%20Rally%20%28USA%29.zip","filesize":249125517,"score":6.6,"genres":"Action > Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p>A kart-race game with Pac-Man and other characters from previous Pac-Man games and other Namco franchises. For instance the PlayStation Portable version features Mr. Driller, Mappy and the Prince from Katamari Damacy .</p><p>The game is packed with not only the traditional Dots to consume and enemies to avoid, but also with power-ups and temporary advantages which players should use strategically to win the race and beat opponents. One example is a power slide to turn corners at full speed. Of course, enemies can also be bitten after eating a Power Pellet.</p>"},{"name":"Pachi-Slot Aruze Oukoku 6","year":2001,"developer":"Aruze Corp.","url":"sony_playstation2_p/Pachi-Slot%20Aruze%20Oukoku%206%20%28Japan%29.zip","filesize":460687027,"score":"","genres":"Gambling > 1st-person > Licensed","desc":"<p><em>Pachi-Slot Aruze Ōkoku 6</em> is a pachi-slot (Japanese slot machine) simulation game featuring three machines made by Aruze: <em>Donchan 2</em>, <em>Dekadonchan 2</em>, and <em>Heracles</em>. It is the first in the series to appear on the PlayStation 2, and also the first to feature fully-3D reproductions of the real-life machines. Included are standard Free and Challenge modes, as well as (now defunct) internet ranking. All three machines feature detailed stat tracking and configuration modes.</p>"},{"name":"Pachi-Slot Kanzen Kouryaku - Onihama Bakusou Gurentai - Gekitou-henn","year":2005,"developer":"Syscom Entertainment Inc.","url":"sony_playstation2_p/Pachi-Slot%20Kanzen%20Kouryaku%20-%20Onihama%20Bakusou%20Gurentai%20-%20Gekitou-hen%20%28Japan%29.zip","filesize":50264737,"score":"","genres":"Gambling > 1st-person > Anime / Manga > Licensed","desc":"<p><em>Onihama Bakusō Gurentai</em> is a digital recreation of the pachi-slot machine (Japanese slot machine) of the same name made by Abilit and Syscom Amusement. It features detailed stat tracking, a theater mode where the win videos can be viewed, and a curious mode that uses the EyeToy camera to project the player's face as a reflection on the playfield glass.</p>"},{"name":"PachiPara 12: Ōumi to Natsu no Omoide","year":2005,"developer":"Irem Software Engineering, Inc.","url":"sony_playstation2_p/Pachi%20Para%2012%20-%20Ooumi%20to%20Natsu%20no%20Omoide%20%28Japan%29%20%28v2.01%29.zip","filesize":1104000185,"score":"","genres":"Adventure > Simulation > 1st-person > 3rd-person (Other) > Anime / Manga > Licensed","desc":"<p><em>PachiPara 12: Ōumi to Natsu no Omoide</em> is one of the many titles in Irem's long-running pachinko simulation series. It features faithful 3D recreations of two pachinko machines made by Sanyo Bussan: <em>CR Ōumi Monogatari M56</em> and <em>CR Ōumi Monogatari M2</em>. There are two modes available: <em>Tsūjō</em> (normal) mode allows the player to modify a wide range of settings for each machine, while <em>Jissen</em> (battle) mode challenges the player to win as many balls as possible on the default settings with a limited starting pool and time limit. There is also a view mode where the various animations that play on the in-game display can be freely viewed.</p><p>The story mode this time is <em>Pachi-Pro Fūunroku 4: Gindama Satsujin Jiken</em>, which introduces a new story set in Showa-era Gindama. The game has been redesigned from the ground up using the Steambot Chronicles engine, and is a murder mystery with a heavy emphasis on investigation. The player can choose either a male or female character, and can freely explore the town on foot, visit pachinko parlors, restaurants, and various shops, go fishing, go on dates, and a variety of other activities. The apartment customization from the previous games has also returned, and there is also a day/night cycle that dictates when shops are open for business.</p>"},{"name":"PachiPara 13: Super Umi to Pachi-Pro Fūunroku","year":2006,"developer":"Irem Software Engineering, Inc.","url":"sony_playstation2_p/Pachi%20Para%2013%20-%20Super%20Umi%20to%20Pachi%20Pro%20Fuuunroku%20%28Japan%29.zip","filesize":2229434919,"score":"","genres":"Adventure > Simulation > 1st-person > 3rd-person (Other) > Anime / Manga > Licensed","desc":"<p><em>PachPara 13</em> is one of the many titles in Irem's long-running pachinko simulation series. It features faithful 3D recreations of two pachinko machines made by Sanyo Bussan: <em>CR Super Umi Monogatari M55W</em> and <em>CR Super Umi Monogatari M55X</em>. There are two modes available: Tsūjō (Normal) mode allows the player to modify a wide range of settings for each machine, while Jissen (Battle) mode challenges the player to win as many balls as possible on the default settings with a limited starting pool and time limit. There is also a View mode where the various animations that play on the in-game display can be freely viewed.</p><p>The story mode this time is <em>Pachi-Pro Fūunroku 5: Seishun-hen</em>, set many years after the previous title at the end of the Showa era. Choosing either a male or female character, the player takes control of a recent high school graduate who has just discovered a knack for pachinko. The game focuses on the day-to-day life of a pachinko player, including practice and pachinko battles, maintaining good health, and of course, dating.</p>"},{"name":"PachiPara 14: Kaze to Kumo to Super Umi in Okinawa","year":2007,"developer":"Irem Software Engineering, Inc.","url":"sony_playstation2_p/Pachi%20Para%2014%20-%20Kaze%20to%20Kumo%20to%20Super%20Umi%20in%20Okinawa%20%28Japan%29.zip","filesize":2670517715,"score":"","genres":"Adventure > Simulation > 1st-person > 3rd-person (Other) > Anime / Manga > Licensed","desc":"<p><em>PachPara 14</em> is the last PS2 release in Irem's long-running pachinko simulation series. It features faithful 3D recreations of two pachinko machines made by Sanyo Bussan: <em>CR Super Umi Monogatari in Okinawa MTA</em> and <em>CR Super Umi Monogatari in Okinawa SAD</em>. There are two modes available: Tsūjō (Normal) mode allows the player to modify a wide range of settings for each machine, while Jissen (Battle) mode challenges the player to win as many balls as possible on the default settings with a limited starting pool and time limit. There is also a View mode where the various animations that play on the in-game display can be freely viewed, and a customization mode where different picture combinations can be placed in the menu background.</p><p>The story mode this time is <em>Pachi-Pro Fūunroku 6: Jōnetsu-hen</em>, a direct sequel set four years after the previous title, and featuring the same cast. The protagonist's attempts to build a career playing pachinko have had many ups and downs, but after a particularly humiliating defeat, they come very close to suicide, only to be rescued at the last moment. The story follows the protagonist as they attempt to rebuild their life and find true love.</p><p>It is once again possible to choose either a male or female character and freely explore the town, either on foot, on a bicycle, or even driving a car. The major new addition to this installment is the theater system; the protagonist joins an acting troupe, and can perform parts in plays, with the player choosing the lines as the scene proceeds. The character and apartment customization options from the previous game have returned, and there is of course also plenty of pachinko playing and dating. The player must stay healthy by eating and exercising, and can also go fishing or even play a few rounds at a batting center.</p>"},{"name":"Pacific Warriors II - Dogfight!","year":2004,"developer":"InterActive Vision White Eagle Sp. z o.o.","url":"PS2_COLLECTION_PART18/Pacific%20Warriors%20II%20-%20Dogfight%21%20%28Europe%29.zip","filesize":214598030,"score":7,"genres":"Action > Simulation > 1st-person > 3rd-person (Other) > Flight / aviation > Oceania > World War II","desc":"<p><em>Pacific Warriors II: Dogfight</em> is an arcade combat flight simulation set in the Pacific campaign during World War II. The player can choose between a variety of WWII-era fight and bomber planes on both the US and Japanese side.</p><p>In total, there are 25 missions in the campaign for each side. After the mission briefing, the player is taken to an upgrade screen, where they can buy various enhancements for their planes, ranging from weapon upgrades to increased speed and better handling. Upgrades are paid for by stars and stars in turn are awarded for successful missions. The amount the player gets depends on the difficulty of each mission.</p><p>During most missions, it is possible to switch the aircraft type by landing on specific airfields. Taking off and landing is an automatic process, the player only has to fly through a series of guidance rings. The missions usually centre around destroying or protecting a certain amount of units.</p>"},{"name":"Paddington Bear","year":2007,"developer":"Atomic Planet Entertainment Limited","url":"PS2_COLLECTION_PART18/Paddington%20Bear%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":378064162,"score":"","genres":"Action > 3rd-person (Other) > Mini-games > Licensed","desc":"<p><em>Paddington Bear</em> is based on the classic Paddington Bear stories. It comprises a collection of mini games, each advancing the story. The game is played from a third person perspective, with 3D cartoon style graphics. The game features appearances from other characters in the books, such as the Brown family, Mrs Bird and Mr Gruber. It is intended for a young audience.</p>"},{"name":"Panic!","year":2002,"developer":"Office I"},{"name":"Panzer Front Ausf.B","year":2004,"developer":"Soyuz","url":"sony_playstation2_p/Panzer%20Front%20Ausf.B%20%28Japan%29.zip","filesize":1397573944,"score":"","genres":"Simulation > Strategy > 1st-person > Behind view > Tank > Historical events > World War II","desc":"<p>Panzer Front Ausf. B is a tank simulation game, in which the player takes control of a squad of tanks from either German, Italian or British armies. The game is about the second World War and happens in the African Front.Gameplay consists of realistic missions in which there are some objectives to complete such as destroying a target, moving from point A to B and so forth. There are a number of different tanks to choose from, and each have accurate damage modeling.Panzer Front Ausf. B is a strange case in console world as there isn't so many realistic simulations available on them.</p>"},{"name":"Paparazzi","year":2004,"developer":"HuneX Co., Ltd.","url":"PS2_COLLECTION_PART18/Paparazzi%20%28Europe%29.zip","filesize":212923677,"score":"","genres":"Simulation > 1st-person > Anime / Manga > Shooter","desc":"<p><em>Paparazzi</em> is a game where you take the role of a photographer who is after great shots of famous models. Unlike your typical paparazzi, you don't get to hide in bushes and take photos of women in compromising positions - instead, you go to preset photo shoots, and try to take the best shots of the subject using your rolls of film. You have a choice of three different models to take photographs of: Riho (a sporty girl), Lena (a supermodel), and Nano (an Internet idol).</p><p>Initially, you have a basic camera, but as you take better photographs, you can earn more money to upgrade its functionality. New lenses, such as telephoto and wide angle lenses can be used, and a tripod can be purchased to stop your shaky hands.</p><p>To get models to perform poses for you and to look at you, you can also perform an \"appeal\". You can dance, jump, call out, or wave your hands - each appeal has a different mini-game associated with it. If you perform the same appeal multiple times in a row, your subject will lose interest, so it's important to vary your actions. The more success you have with appeals, the more interesting and unique poses you can get your model to perform (which are worth more points in the photo shoot).</p>"},{"name":"PaRappa the Rapper 2","year":2001,"developer":"NanaOn-Sha Co., Ltd.","url":"PS2_COLLECTION_PART18/PaRappa%20the%20Rapper%202%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3051241859,"score":7.1,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p>PaRappa The Rapper 2 is the sequel to PaRappa The Rapper. Defeat the Noodle Syndicate by rapping your way through various levels. On each level there is a teacher that raps a phrase, and you repeat each phrase by tapping various combinations of buttons in response to the teacher. </p><p>The game is mostly a single player game, but after you finish a level, you can return to it and play Head-2-Head with the computer or another player.</p><p>Your friends from the first game are back, including Sunny Funny (the girl of your dreams), Moosesha and Chop Chop Master Onion. And don't forget.... You Gotta Believe!</p>"},{"name":"Paris-Dakar Rally","year":2001,"developer":"Broadsword Interactive Limited","url":"PS2_COLLECTION_PART18/Paris-Dakar%20Rally%20%28Europe%29.zip","filesize":715482727,"score":5.1,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Off-roading > Licensed","desc":"<p><em>Paris-Dakar Rally</em> is a licensed rally game that takes place in the famous Paris-Dakar course that put to the test 300 pilots from all over the world in 10.000 Km of arid African and European deserts. The game includes licensed car teams and models as well as real rally pilots to choose from.</p><p>The game offers you 4 types of vehicles to test your mettle in the stages that make up the Paris-Dakar course: 4x4s, Enduro bikes, Buggies and Quad-cycles, with several vehicles from different brands in each category that you must unlock by completing the stages in time. You also have a set of customizing options for your vehicles that include suspension adjustment, tire pressure, etc.</p>"},{"name":"Paris-Marseille Racing II","year":2002,"developer":"Davilex Games B.V.","url":"PS2_COLLECTION_PART18/Paris-Marseille%20Racing%20II%20%28France%29.zip","filesize":261994571,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>Almost two years after the first Paris-Marseille Racing, Davilex Games decided to continue the story and make a series.</p><p>In this follow-up, the player can choose between six drivers (one female) with unique driving skills, and two game modes, one or two players. In the single player mode, you will have to choose between the three classic sub-modes : tournament, time attack and single race. New with this release are the two 2-players modes : Duel and Driver Vs Police. In the Duel mode, race head to head against a friend. In the Driver Vs Police mode, one choose to play a police man, the other must try to drive as fast as possible to escape.</p><p>The game also features three skill levels, repairing and fine-tuning options in the tournament mode, and of course new and enhanced graphics to race through France and its famous cities such as Marseilles, Paris or Lyon. Three bonus races can also be played in London, Edinburgh or Las Vegas!</p>"},{"name":"Party Carnival","year":2005,"developer":"HuneX Co., Ltd.","url":"PS2_COLLECTION_PART18/Party%20Carnival%20%28Europe%29.zip","filesize":161514216,"score":"","genres":"Action > Mini-games > Party game","desc":"<p>200% Satisfaction<br>300% Enjoyement, Playing with Friends!<br>* 40 quick and easy mini-games to compete in!<br>* 40 games of button pushing races and games.<br>* Lots of simple but addictive games for all age groups.<br>* Up to 4 people can play at once.<br>* Play with your family and friends and enjoy the party!<br>* Dazzling game courses to choose from!<br>* Sports course, Festival course, Japanese style course... several courses in a variety themes to choose from!<br>* Choose how you play, one game at a time or all 40! Go for the gold medal!</p>"},{"name":"Party Girls","year":2004,"developer":"HuneX Co., Ltd.","url":"PS2_COLLECTION_PART18/Party%20Girls%20%28Europe%29.zip","filesize":303059483,"score":"","genres":"Sports > 3rd-person (Other)","desc":"<p>If you ever watched any of the games without limits show, this may strike you as if one of them got made into a video game with a difference that each game requires two and only two competitors. Games you can compete at in this game are all water connected if only for the fact all the contestants (and they're all women) here wear swimsuits. Each competition consists of five mini-games and you must win all five in order to win. After you win, you get extras, though (think swimsuits). You can play versus another player or the CPU in games which vary from backward facing butt-kicking each other to fall into water, rubbing thermometer to reach the required temperature first, spreading legs as far as possible without falling into water, swimming, selecting the right wig to wear, jumping over the water, and more. So, select one of the ten contestants: Ayano Seto, Yuuka Mizuki, Ryouko Tachibana, Minako Sakurai, Arisu Kagura, Riho Futaba, Kana Momozono, Miyu Amagi, Reiko Mizusaki, or Kyouko Mizusaki, and try to be the top girl at this swim meet.</p>"},{"name":"Payout: Poker & Casino","year":2006,"developer":"Bits Studios Ltd.","url":"PS2_COLLECTION_PART19/Playwize%20Poker%20%26%20Casino%20%28Europe%29%20%28En%2CFr%2CIt%29.zip","filesize":795774972,"score":"","genres":"Simulation > 1st-person > Behind view > Top-down > Cards / tiles > Direct control","desc":"<p>Wander around up to five casinos from around the world in real 3D.  Take a spin on the roulette table, play Baccarat, Craps and even the slots.  And of course, enjoy the numerous poker modes, including Omaha and Texas Hold'em.As you win money, and fame you can collect different outfits, use the character designer to customise your avatar as you see fit, and move onto new casinos with better poker players and higher stakes.</p>"},{"name":"PBR: Out of the Chute","year":2008,"developer":"Totally Games, Inc.","url":"sony_playstation2_p/Pro%20Bull%20Riding%20-%20Out%20of%20the%20Chute%20%28USA%29.zip","filesize":351601284,"score":"","genres":"Sports > Behind view > Horse / derby > Licensed","desc":"<p><em>PBR: Out of the Chute</em> gives players the opportunity to experience PBR (Professional Bull Riders) either through the eyes of the riders themselves or even the bulls (24 total, 12 of each), each with their own strengths and weaknesses as well as signature moves. The goal for the riders is to stay on for a full eight seconds while the bull's is to buck off the rider as fast as possible.</p><p>The list of riders and bulls are: </p><p><strong>Bull Riders</strong>* Brian Canter</p><ul><li>Ross Coleman</li><li>J.W. Hart</li><li>Mike Lee</li><li>Guilherme Marchi</li><li>Justin McBride</li><li>Adriano Moraes</li><li>Ty Murray</li><li>Wiley Peterson</li><li>Chris Shivers</li><li>Mike White</li><li>Sean Willingham</li></ul><p><strong>Bulls</strong>* Big Bucks</p><ul><li>Cat Daddy</li><li>Chicken on a Chain</li><li>Dr. Proctor</li><li>Just a Dream</li><li>Little Yellow Jacket</li><li>Okeechobee Spots</li><li>Reindeer Dippin</li><li>Shane</li><li>Versus Blackout</li><li>Vertical Limit</li><li>White Magic</li></ul><p>The modes consists of a quick ride as either a rider or a bull or a tutorial that the player can learn the controls of the two. There is also an unlimited mode where players can battle a bull without the eight second rule and see how long they can stay on. There is also a season mode where the player can either use a rider or a bull in a ten city schedule (Dallas, Anaheim, Atlanta, Uncasville, Albuquerque, Tacoma, New York, New Orleans, Tulsa and Las Vegas) in an attempt to win the championship or the award for Bull of the Year with each event lasting three rounds.</p><p>The controls consist of using the the Left Analog stick for the rider and the bull, either to lean in a certain direction to keep from being thrown or for the bull, to buck and spin in an attempt to throw off the rider with the Right Analog stick only used to run in any direction for the bull. The shoulder buttons are also used, the L1 and R1 is used for the rider to tighten their grip on the bull to keep from being thrown off, however these are only present in the medium and hard modes. Likewise, the L2 and R2 are used for both the bull and rider and for their signature modes. The X button is also used for the rider to dismount the bull, hitting it again while in air to land on their feet will give the player bonus points, also the X button can also be used during the ride to spur on the bull, resulting in bonus points as well. Additionally, the bull can receive bonus points by breaking cameras and signs scattered around the side of the pen.</p><p>There are two different meters with the same purpose, the rider has a health meter which can be lowered, the lower it is the more likely the player will be thrown off. Additionally, if a rider is injured in a ride, their health will be depleted slightly for the next round. A rage meter is used for the bull, the higher the meter the more likely they can buck off a rider, but the lower it is the more the rider has a chance to complete the ride.</p><p>There are also power-ups that can be obtained through the season mode (however only in the medium and hard difficulty levels) that are obtained for scoring a certain sets of points for a round. For the rider a spur is obtained and can be used to slow down the bull while the bull receives a set of horns that speeds up the bull and increases the chances of throwing off a rider. These power-ups are activated by pressing and holding the Down button on the D-pad for a second.</p><p>There is also multiplayer capabilities where two friends can battle head-to-head, one as the rider and the other as the bull. Players can also unlock videos of actual PBR action by completing certain objectives throughout the game.</p>"},{"name":"PDC World Championship Darts","year":2006,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART18/PDC%20World%20Championship%20Darts%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29%20%28v2.00%29.zip","filesize":151646759,"score":"","genres":"Simulation > Sports > 1st-person > Licensed","desc":"<p><em>PDC World Championship Darts</em> is an officially licensed darts game. The player can opt to play as champions such as Allan Warriner-Little or Raymond van Barneveld or create his own player.</p><p>Included game modes are: World Championship, World Grand Prix, UK Open, Holland Open and Desert Classic. Each is modeled after the actual real life events. The game includes three existing darts arenas. An additional game mode is the party mode, a multi-player mode that consists of fifteen different party games. These can only be played on the same machine however and not on-line or via LAN.</p>"},{"name":"PDC World Championship Darts 2008","year":2008,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART18/PDC%20World%20Championship%20Darts%202008%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":211514635,"score":5.9,"genres":"Simulation > Sports > 1st-person > Licensed","desc":"<p><em>PDC World Championship Darts 2008</em> is an officially licensed darts game and sequel to its earlier incarnation. The player can opt to play as existing champions or create his own player. This new version includes even more stars to choose from.</p><p>It also includes more licensed events to participate in. Each is modeled after the actual real life events. The game includes three existing darts arenas. An additional game mode is the party mode, a multi-player mode that consists of fifteen different party games. These can only be played on the same machine however and not on-line or via LAN.</p>"},{"name":"Perfect Ace 2: The Championships","year":2005,"developer":"Atomic Planet Entertainment Limited","url":"PS2_COLLECTION_PART18/Perfect%20Ace%202%20-%20The%20Championships%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":366759817,"score":"","genres":"Sports > Tennis > Licensed","desc":"<p>“Tennis doesn’t get any better than this!” – Tim Henman</p><p>* Licensed players, including Tim Henman.<br>* Dozens of all new stadia.<br>* New male and female player models and animations.<br>* Advanced motion-blending to give total control over player movements and an ultra real tennis experience.<br>* Full player-editor.<br>* Full International career mode.<br>* Fast and exciting multiplayer mode.</p>"},{"name":"Perfect Ace: Pro Tournament Tennis","year":2003,"developer":"Aqua Pacific Ltd.","url":"sony_playstation2_p/Perfect%20Ace%20-%20Pro%20Tournament%20Tennis%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":169840436,"score":5.8,"genres":"Sports > Behind view > Tennis","desc":"<p><em>Perfect Ace: Pro Tournament Tennis</em> is a tennis game for one to four players. It offers three different game modes: single matches, tournament and world championship. Single matches can be played against either AI of human opponents and involves both singles and doubles matches. Sixteen courts from locations all over the world can be chosen. The tournament consists of five rounds and can be played alone or cooperatively with a friend. First round is played on an easy setting and for each new round the difficulty goes up. The world championship is a series of ten tournaments around the world where one player takes control of a duo representing their country with the aim of scoring enough points to become number one in the world. </p><p>The game is played from a third person perspective. When serving a power bar is used to determine the power of the serve and while the ball is in play there are different strokes that the player can make. These are normal shot, topspin, lob and slice. Some aspects of the game are customizable. The player can choose speed of game, games per set (1-6), difficulty and whether to play with tie breaks or not.</p>"},{"name":"Persona 3 FES (Append Edition)","year":2007,"developer":"Atlus Co., Ltd.","url":"PS2_COLLECTION_PART18/Persona%203%20FES%20%28Europe%29.zip","filesize":3278193738,"score":"","genres":"DLC / Add-on > Game mode > Other > Story / mission","desc":"<p><em>Persona 3 FES (Append Edition)</em> is a slightly different version of Persona 3 FES. Unlike the standalone version, the Append Edition requires that you insert the Persona 3 disc in order to play the expanded storyline. All other features remain the same.</p><p>The game was released at a cheaper price for people who already owned Persona 3.</p>"},{"name":"PES 2008: Pro Evolution Soccer","year":2007,"developer":"Winning Eleven Productions","url":"PS2_COLLECTION_PART18/PES%202008%20-%20Pro%20Evolution%20Soccer%20%28Europe%29%20%28En%2CEs%29.zip","filesize":2330217982,"score":7.9,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p><em>Pro Evolution Soccer 2008</em> is a simulation of the soccer sport. The player can choose between numerous (partly licensed) teams and use the usual playing modes, e.g. training, cup championships or the Master League with a few additional managerial components. The main differences to Pro Evolution Soccer 2007 are a new adaptive AI for the Master League and a new animation system.</p><p>This version of the game has numerous differences to the NextGen version: It lacks the ability to perform dives and to change the player wall during free kicks. In return there are a few additional features: more stadiums (33 instead of 12), matches with random players, a more extensive training mode, the World Tour mode (about 100 challenges where the player has to solve certain goals in pre-defined situations, e.g. scoring a goal in a limited time) and unique community features, e.g. a friends list or private tournaments. The latter - along with all savegames - are compatible to both the PSP and PS2 version.</p>"},{"name":"PES 2009: Pro Evolution Soccer","year":2008,"developer":"Winning Eleven Productions","url":"PS2_COLLECTION_PART18/PES%202009%20-%20Pro%20Evolution%20Soccer%20%28Europe%29%20%28En%2CEs%2CIt%2CPt%29.zip","filesize":2807258403,"score":7.7,"genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p>Pro Evolution Soccer 2009 is the eighth game of the Pro Evolution Soccer Series and features for the first time the \"Become A Legend\" mode in which you can create your own player and improve him playing in clubs all over Europe as well as playing with your national time in many international cups.</p><p>The Ligue 1 and the Eredivise are the fully licensed leagues. The Premier League, the LFP and the Calcio leagues are partially licensed and for the first time you'll be able to play the UEFA Champions League. You can also play with many other teams from other countries as well as 60 national teams in many leagues and cups. The \"Master League\" mode is still available.</p><p>The game has new moves, readjustment for ball movements, new animations and improved graphics.</p>"},{"name":"PES 2010: Pro Evolution Soccer","year":2009,"developer":"PES Productions","url":"PS2_COLLECTION_PART18/PES%202010%20-%20Pro%20Evolution%20Soccer%20%28Europe%29%20%28En%2CNl%2CSv%2CRu%2CEl%29.zip","filesize":2399697149,"score":7.8,"genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p><em>Pro Evolution Soccer 2010</em> follows the yearly instalments of the football franchise and comes with up-to-date player transfers for the 2009/2010 season. The game features many new moves and the players move more slowly and realistic. Even a mediocre player can now have a lucky strike and hit the net from 40 meters away. Most graphical improvements go into the detail of players' faces and shadows. Although there are still five levels of gameplay, this time the computer AI acts differently from before and opens up new ways to play the game.</p><p>There are game modes present from earlier titles in the franchise, such as Exhibition or Master League, but also some new ones like UEFA Champions League and UEFA Europa League. Become a Legend mode introduced in PES 2009 is also available. Aside from graphics, details were put into tactics and strategy where players can be positioned with more accuracy, according to his talent. An entirely new feature is the card system, tied to certain players' unique abilities. This gives that player an advantage over its opponent. In previous titles certain top players could perform stunning moves without the player's control. With the card system in <em>PES 2010</em>, direct control over this becomes available.</p><p>The Master League mode is more detailed and comes with sponsors, youth teams and real currencies (including Euro, British Pound, US Dollar, or Japanese Yen). Money can also be used to pay a scout who deals with negotiations, physical aspects, the trainer and other staff members. The Premier League, Liga Española, Italian League, Eredivisie and others are still included, as well as World Cup, Konami Cup and others, with national teams and league teams largely up-to-date.</p><p>Unlike earlier instalments, the player's individual graphical representation is gone. It is still possible to see them as a part of an entire team, but no longer for individual players. This means it takes time to get acquainted with them by going through numerical statistics or checking the compatibility of the players' maximum performance with the position they are at.</p><p>Co-op is on par with the franchise, with assisted player switching and semi-assisted and manual switching. Manual meaning is complete and the player will not be switched until it is determined by the player, while semi-automatic will switch to the player a pass is given to.</p>"},{"name":"PES 2011: Pro Evolution Soccer","year":2010,"developer":"Winning Eleven Productions","url":"PS2_COLLECTION_PART18/PES%202011%20-%20Pro%20Evolution%20Soccer%20%28Europe%29%20%28En%2CNl%2CSv%2CRu%2CTr%29.zip","filesize":2138613334,"score":7.6,"genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p><em>Pro Evolution Soccer 2011</em> comes with new teams for 2010/2011 and plenty new features. Good old fending off the attackers from the early versions is here and fending off means a lot if you want to dribble your opponent or keep the ball in your possession in one-on-one tackle. You can now turn on stamina gauge above controlling player and see ball kicking gauge every time you hit a ball, be that shooting on a goal or a simple pass to another friendly player. There is more detailed game plan than before with easy adjustment of strategies, especially when it comes to positions of an individual player. According to Konami, aside the typical passing, feints, dribbling or defence actions, this game features over 1000 new motions, but what can be done with the ball depends, as usual, on the player you are controlling.</p><p>There are even more licensed cups and leagues this time, UEFA Champions League, UEFA Europa League as well as some new ones like Copa Libertadores and UEFA Super Cup. Even a Club World Cup mode is available as a part of other modes, but without a licensed name or logo. National teams are all there, some of them licensed and some with fictional player names, and same goes for clubs with addition to some new licensed clubs like Werder Bremen. UEFA cups are integrated within Master League as well as other leagues, and recent new mode like Become a Legend is still there. Now, for the first time, Become A Legend and Master League are playable online.</p>"},{"name":"PES 2012: Pro Evolution Soccer","year":2011,"developer":"PES Productions","url":"PS2_COLLECTION_PART18/PES%202012%20-%20Pro%20Evolution%20Soccer%20%28Europe%29%20%28En%2CNl%2CSv%2CRu%2CTr%29.zip","filesize":1840463107,"score":7.6,"genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p><em>PES 2012: Pro Evolution Soccer</em> is a soccer game in which the player directly controls the athletes. In various playing modes the player takes control over a team to dominate the match. This includes a mode where a single athlete is controlled, the league in which additional management jobs are undertaken and a training mode. New in this version is the club boss mode with even more tasks to take care of.</p><p>The direct pass system, introduced in a former installment of the series, has now five settings so new players can slowly accustom to them. Besides a few new graphical effects, the main improvements are regarding AI and controls, most notably the possibility to manually control a second athlete of the own team. The license package is mostly the same as in the predecessor with a few additional teams.</p>"},{"name":"PES 2013: Pro Evolution Soccer","year":2012,"developer":"PES Productions","url":"sony_playstation2_p/PES%202013%20-%20Pro%20Evolution%20Soccer%20%28Europe%29%20%28En%2CNl%2CSv%2CRu%2CTr%29.zip","filesize":1348751533,"score":7.5,"genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p>The 2013 game from the <em>Pro Evolution Soccer</em> games returns to the basics of soccer: the control of a single soccer player with all its movements and its own style to play. There is a couple of different game modes: take part with a team in a tournament, play the life of a soccer legend, win a championship or take part in an online match.</p>"},{"name":"PES 2014: Pro Evolution Soccer","year":2013,"developer":"PES Productions","url":"PS2_COLLECTION_PART18/PES%202014%20-%20Pro%20Evolution%20Soccer%20%28Europe%29%20%28En%2CNl%2CSv%2CRu%2CTr%29.zip","filesize":1190065798,"score":7.4,"genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p><em>PES 2014: Pro Evolution</em> is a soccer game. In comparison to its predecessor, the biggest change is of technical nature: a completely different engine. This mostly has an effect on graphics, animations and physics and allows to initiate body movements like pushing. The playing speed is slower than in the previous installment and there are few smaller adjustments to the controls, e.g. optional guides during standard situations, a new system for penalties and the option to set and activate tactical predefined combinations for up to three playing field zones.</p><p>There are no major changes regarding playing modes, the player still can participate in different matches, competitions and leagues. The two major modes are Master League, in which the player takes on some managerial responsibilities like hiring new athletes (new: the player can change the club or manage national teams), and Become A Legend, in which the player accompanies a single athlete over his career (new: the option to become a goal keeper).</p>"},{"name":"Petanque Pro","year":2007,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART18/Petanque%20Pro%20%28France%29.zip","filesize":27273751,"score":"","genres":"Sports > Behind view > Direct control","desc":"<p>Claiming to be the first-ever pétanque video game, <em>Pétanque Pro</em> is the rare video game simulating the French sport of pétanque, a game similar to lawn bowling or bocce in which players must throw or roll boules (balls) closer to the target ball than their opponents.</p><p>With support for 1-2 players, the game features three playing fields -- a village, a garden, and a covered stadium -- along with tournament and quick game modes.</p>"},{"name":"Peter Jackson's King Kong: The Official Game of the Movie","year":2005,"developer":"Ubisoft Pictures SAS","url":"sony_playstation2_p/Peter%20Jackson%27s%20King%20Kong%20-%20The%20Official%20Game%20of%20the%20Movie%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":1233137347,"score":7.7,"genres":"Action > 1st-person > Behind view > Shooter > Interwar > Licensed","desc":"<p>Jack Driscoll, scriptwriter, follows director Carl Dernham and actress Ann Darrow to Skull Island where Dernham intends to film his next movie. But primeval creatures await them: giant insects, dinosaurs, and King Kong. Based on Peter Jackson's 2005 remake, King Kong lets you play as Jack Driscoll and Kong himself.</p><p>Jack's levels are HUDless FPS levels set on Skull Island. Jack must use a variety of weapons, traps, and fire to kill or repel Skull Island's fauna. Kong's levels are third-person brawlers set on Skull Island and New York City, where Kong must puzzle his way through environmental obstacles and thrash his opponents.</p><p>The PSP version is shorter, with some parts cut out which featured in the console and PC releases.</p>"},{"name":"Peter Pan","year":2007,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART19/Peter%20Pan%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":546141551,"score":"","genres":"Puzzle > Mini-games","desc":"<p>In London live three children with their parents. One evening, whilst the parents are out at a ball, Peter Pan visits the children.</p><p>First he teaches them all to fly and then he takes them on a great adventure to his home land; Neverland.</p><p>What adventure will the children have? Will then ever come home?</p><p>Including various activities:</p><p>Watching Cartoons, Colouring, Pairs Activity, Jigsaw Puzzle, Sliding Puzzle</p>"},{"name":"Petit Copter","year":2003,"developer":"Aqua System Co., Ltd.","url":"sony_playstation2_p/Petit%20Copter%20%28Japan%29.zip","filesize":279060943,"score":6.3,"genres":"Simulation > 3rd-person (Other) > Helicopter > Vehicle simulator","desc":"<p>RC Helicopter Indoor Adventure is a RC helicopter flight simulation. You have to navigate your way through rooms, hallways and corridors collecting points to gain access to bigger and faster helicopters.</p><p>There are no enemies, just you, rc helicopter, ticking time and some obstacles. There are 2 game modes: challenge and adventure. Challenge contains missions and in adventure you have to collect stars.</p>"},{"name":"Petz: Catz 2","year":2007,"developer":"Yuke's Co. Ltd.","url":"sony_playstation2_p/Petz%20-%20Catz%202%20%28USA%29.zip","filesize":803227998,"score":"","genres":"Action > 3rd-person (Other) > Mini-games > Stealth","desc":"<p><em>Catz</em> on the PlayStation 2 is a single player action game and not the virtual pet game one might expect based on the plethora of games in that genre which share the same name.</p><p>The story behind the game runs as follows:  </p><p>Once upon a time there was a young cat, the player, who lived on a magic island. They lived with Arvin and Ione in a pretty little house. Arvin was an important cat because he had a Magic Hat which he used to keep the peace, ensure order prevailed over chaos and generally protect everyone.<br>Now it just so happened that there was an evil wolf, Ivlet, who did lots of really bad things. He got caught and was locked up in the local jail on the magic island. The young cat and his friend Victor sneaked in to see Ivlet in the night and he tricked them into letting him see the Magic Hat which he snatched in his big strong jaws and put on his head. Using the Magic Hat's powers he destroyed houses, turned the wild beasts against the cats, broke bridges and did all sorts of damage. <br>The young cat was in lots of trouble now and was thrown into jail but was let out so that he could help the cats on the island who had suffered as a result of his foolishness. Now the Magic Hat was no ordinary hat, besides being magic it had a mind of its own. Along the way the young cat meets Beat who was the good half of the Magic Cats mind who gave him lots of advice, a magic encyclopaedia and other information.</p><p>This is a 'save the world' action game with quests, money to be earned and shops to spend it in. There are characters to interact with but no voice acting, the characters all make catlike noises while the relevant text is displayed on screen. There are enemies who may or may not attack depending on their status which is clearly displayed in a bubble above their head. As the player progresses through the game they will learn new skills, there are eleven in all, such as fishing, catching insects, and pushing rocks.  </p><p>The game claims to have sixty mini games. When these are unlocked by playing them in Adventure mode they can be accessed from a separate game menu to be played separately</p>"},{"name":"Petz: Dogz 2","year":2007,"developer":"Yuke's Co. Ltd.","url":"sony_playstation2_p/Petz%20-%20Dogz%202%20%28USA%29.zip","filesize":813993575,"score":"","genres":"Action > Life / social simulation > Mini-games > Platform > Stealth","desc":"<p>Pick a puppy pal from a pack of fuzzy and adorable puppies in Petz Dogz 2! Together, you and your new cuddly companion will encounter a world that’s fun to play in, explore, and share.</p><p>Dress up your puppy in fun puppy clothes, play for hours with new toys, or look for hidden surprises that can give your puppy new abilities. Customize your puppy’s environment with items and toys, and unlock more goodies as you get better at caring for your new best friend.</p><p>Watch your puppy grow, go on quests and adventures together, and unlock awesome mini-games.</p><p>* Choose a puppy from over 40 different breeds, and make him cuter with clothing and accessories<br>* Create a comfortable pet village and guide your lovable bundle of fur through 60 fun adventures<br>* Compete against your friends in mini-games such as racing and treasure-hunting</p>"},{"name":"Petz: Horsez 2","year":2007,"developer":"Phoenix Studio","url":"sony_playstation2_p/Petz%20-%20Horsez%202%20%28USA%29.zip","filesize":1024725676,"score":"","genres":"Sports > 1st-person > 3rd-person (Other) > Behind view > Horse / derby > Licensed","desc":"<p><em>Pippa Funnell: Ranch Rescue</em> is a single player game based on horse riding.</p><p>There's a story to this game featuring a young girl called Lily. A big, bad, banker called Rud Van Guiness tries to seize the family ranch and Lily sets out to stop him by winning prizes with her horses. On the way she meets a number of other characters such as Grant a famous horse whisperer, Liam , and Carla Van Guiness who treats her horses brutally. Lily appears again in another game Imagine: Champion Rider.</p><p>The game has Lily winning, caring for, breaking in, training and raising horses from any of these six breeds Merene, Fresian, Anglo-Arabian, French Saddlebred, American Paint Horse and Peruvian Paso. They are trained in the three main equestrian disciplines, show jumping, cross country and steeple chasing. <br>By competing in local competitions Lily gains federation points which later permit her to enter international contests.</p><p>The game also contains two mini games, 'Return the Chickens' and 'Return the Sheep'. These are unlocked as the player progresses through the game and, once unlocked, can be played repeatedly.</p>"},{"name":"Phantasy Star Universe","year":2006,"developer":"Sonic Team","url":"sony_playstation2_p/Phantasy%20Star%20Universe%20%28USA%29.zip","filesize":3818085372,"score":6.6,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Persistent > Sci-fi / futuristic","desc":"<p><em>Phantasy Star Universe</em> can be considered the sequel to Phantasy Star Online with hack-and-slash RPG gameplay. Once again, there are two components: both offline and online content. In the offline single-player story, the 17-year old Ethan Weber is a military cadet on a mission to save his kidnapped sister from a mysterious force called THE SEED. This events and characters complement the online gameplay. Additionally, there is an offline mode that plays similar to the online mode, with character customization.</p><p>In the online MMORPG component, players create their character based on four races: Humans, CASTs, Newmans and Beasts, with 3 main classes that can still be changed during gameplay. Once at a high level, there is further specialization with 7 advanced classes. The character's customization includes the clothes, hair, facial features, voice, and body proportions.</p><p>The game takes place in the Gurhal Star System, with three planets to explore. Players can also team up in squad-based combat and tackle over twenty massive dungeons. The movement options of the previous game have been improved, with enhancements such as strafing. Characters can wield different weapons for each hand and there are player-controlled vehicles. A monthly fee is required to keep playing.</p>"},{"name":"Phantasy Star Universe: Ambition of the Illuminus","year":2007,"developer":"Sonic Team","url":"PS2_COLLECTION_PART19/Phantasy%20Star%20Universe%20-%20Ambition%20of%20the%20Illuminus%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":3282364654,"score":6.2,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Persistent > Sci-fi / futuristic","desc":"<p><em>Phantasy Star Universe: Ambition of the Illuminus</em> is an expansion to Phantasy Star Universe. It offers more customizable options for the player character, more possibilities for social interaction, e.g. in a casino lobby, more weapons, more combat abilities, more levels and more enemies.</p><p>It also features an offline playing mode which continues the story of <em>Phantasy Star Universe</em>. The player needs to stop the secret organization Illuminus which wants to destroy all non-human races. This time he also can create his own character for the offline mode instead of being restricted to a pre-defined one.</p>"},{"name":"Phantom Brave","year":2004,"developer":"Nippon Ichi Software, Inc.","url":"PS2_COLLECTION_PART19/Phantom%20Brave%20%28Europe%29.zip","filesize":455049540,"score":8,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Anime / Manga > Turn-based","desc":"<p><em>Phantom Brave</em> is a strategy RPG which takes place in the world of Ivoire. Ivoire consists of vast seas and numerous islands; it used to be a peaceful place, but an ancient (and powerful) force is now threatening life in the various lands. The character you control in the game is Marona, a 13 year old orphaned girl. Marona has the ability to communicate with phantoms, an ability that brings a lot of resentment from other people but will help her to head out into the world and solve the problems that are occurring. A phantom known as Ash acts as Marona's guardian; as the game progresses, other phantoms will join your party, each of which have different capabilities.</p><p>The game features a turn based combat system. During battles, Marona is able to attack enemies by herself, and she can also summon phantoms in her party to help out. To summon phantoms, you will need to confine them to an object on the screen (such as a rock or tree). Once confined to an object, you will then be able to control the phantom in battle, though phantoms only remain controllable for a limited number of turns. The object you confine a phantom to will affect it's abilities; for example, a rock may make a phantom stronger but move slower. By defeating enemies in battle you earn experience points allowing to level up and become more powerful.</p><p>The games story takes place in 20 episodes. Each episode features a unique goal to be completed before moving on. Between episodes you can visit your home on Phantom Island; here you can summon additional phantoms to join your party. Initially only a few types of phantoms can be summoned, but more become available as experience is gained. You may also replay already completed episodes or enter a random dungeon in order to level up your party and earn additional money to buy items.</p>"},{"name":"Phantom of Inferno","year":2003,"developer":"Nitroplus Co., Ltd."},{"name":"Phase Paradox","year":2001,"developer":"Sony Computer Entertainment Japan","url":"sony_playstation2_p/Phase%20Paradox%20%28Japan%29.zip","filesize":1944978628,"score":"","genres":"Adventure > 3rd-person (Other) > Puzzle elements > Sci-fi / futuristic > Horror > Survival","desc":"<p><em>Phase Paradox</em> serves as a sequel to <em>Philosoma</em>.</p><p>The GALLANT, a spacecraft carrier that was severely destroyed during the eruption of Planet 220, is the subject of <em>Phase Paradox</em>. The collision has killed or wounded 20% of the passengers, some survivors are going insane, and unseen creatures inhabit the ship. Jude, Renee, and Alia are the three characters available to the player. The aim of the game is to live in situations that are both fascinating and threatening, and then to flee from the GALLANT.</p><p>When it comes to puzzles and exploring, as well as the overall style, such as the use of pre-rendered environments, unlike its predecessor, the gameplay is both a survival-horror and interactive game, since the game does not feature proper action and only requires the player to push a button at certain points in the game to advance the plot.</p>"},{"name":"Piglet's Big Game","year":2003,"developer":"Doki Denki SA"},{"name":"Pilot Down: Behind Enemy Lines","year":2005,"developer":"Wide Games","url":"PS2_COLLECTION_PART19/Pilot%20Down%20-%20Behind%20Enemy%20Lines%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1930907013,"score":5.5,"genres":"Action > 1st-person > Behind view > Stealth > World War II > War","desc":"<p>Over 180,000 Allied airmen were shot down on enemy territory during WW2. This game is about one of those men, trying to get to safety of Switzerland through hostile territory.</p><p>The gameplay is mostly about sneaking around varied environments such as a lumberyard, wilderness and so forth trying not to be detected by the German troops and making as little commotion as possible. With the aid of different objects (such as cigarette packs for distracting guards or apples for a quick stamina replenishing) the player must make it through the levels. The player character has a stamina which means that it's not very good idea to be standing in a freezing cold water for too long because if the stamina meter runs out, the health meter starts to deplete. Because of it, it's a good idea to warm up by campfires or eat something once in a while, thus restoring stamina.Of course there is some weapons also, which one can use to dispatch enemies that wander too close. They range from a piano string to machine pistols.</p>"},{"name":"Pimp My Ride: Street Racing","year":2009,"developer":"Virtuos Ltd.","url":"PS2_COLLECTION_PART19/Pimp%20My%20Ride%20%28Europe%29.zip","filesize":709701013,"score":"","genres":"Racing / Driving > 3rd-person (Other) > Behind view > Automobile > Street racing > Licensed","desc":"<p>Do You Have What It Takes to Dominate the Streets?!</p><p>Pack your bags and grab your keys… you’re about to race in cities around the world, where style matters more than anything else! Take control of street-racing competitions, from London to Paris, from the Hills to the ‘Hood.' Pimp out your ride with brand new customizations and equipment upgrades… and rip up the road!</p>"},{"name":"Pinball","year":2000,"developer":"Astroll Ltd","url":"PS2_COLLECTION_PART19/Pinball%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":445977729,"score":"","genres":"Simulation > Isometric > Arcade > Pinball","desc":"<p><em>Play It Pinball</em> is based on the popular American table game of pinball which involves using a pair of flippers to direct a small ball into bumpers, thus scoring points.</p><p>The tables featured in this game are all in 3D and are based on real life tables that were around during the 1950's in America. The pinball tables have various American themed designs, which include Surf King, Western Sheriff, Horror and Baseball. The game also has all the features of a real pinball table, including the tilt option.</p><p>Originally released in Japan, it subsequently got a European release, but never a North American release.</p>"},{"name":"Pinball Fun","year":2003,"developer":"HuneX Co., Ltd.","url":"PS2_COLLECTION_PART19/Pinball%20Fun%20%28Europe%29.zip","filesize":243669380,"score":"","genres":"Action > Diagonal-down > Arcade > Pinball > Direct control > Medieval > Post-apocalyptic","desc":"<p>Discover how addictive pinball can be in this amazing game. Test your skills to the limit on three theme based tables and try to beat that high score, trying to make the most out of bonuses, score multipliers and multi balls. And to get to know all the features of the game you can use the comprehensive tutorial mode where you will run through all the details of each table.</p><p>SO WHAT ARE YOU WAITING FOR, GO FOR THOSE BUMPERS!</p><p>ATTACK THE DRAGON</p><p>Travel through time into an ancient world and face powerful dragons! Attack the Dragon is a mystic and fantasy pinball table where legends can become true.</p><p>LOVE SONG</p><p>Meet sweet girls which will sing and perform on the stage for you! Hit the bumpers and unlock the combinations to make them appear. This table looks like a disco!</p><p>OPERATION THUNDER STORM</p><p>The atmosphere of war is recreated in this table! Plan your strategy carefully and manage your resource wisely to overcome the enemy. Several bonuses become available to increase your shooting power.</p>"},{"name":"Pinball Hall of Fame: The Gottlieb Collection","year":2004,"developer":"FarSight Technologies Inc.","url":"PS2_COLLECTION_PART19/Pinball%20Hall%20of%20Fame%20-%20The%20Gottlieb%20Collection%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":296965661,"score":7.2,"genres":"Action > 1st-person > Pinball > Licensed","desc":"<p><em>Pinball Hall of Fame</em> aims to bring eight classic tables from 50s to the 90s to the modern day by realizing them in full 3d with sounds just like the originals had. You'll be able to choose from tables like Ace High, Central Park, Big Shot, Genie, Black Hole, Victory, Tee'd Off and a secret unlockable table.</p><p>You'll also be able to unlock additional gameplay modes, artwork, interesting information and neat little distraction games like a love tester machine or a Xolten fortune teller machine.</p><p>The game also features realistic ball physics to attempt to duplicate the experience of the actual machines and six different views so you can get the view you want. When you finish going through the tables by yourself, you can invite three of your friends over to see who can get the highest score.</p><p>The Xbox version also lets you upload your best scores up to Xbox Live! to compete against the world.</p>"},{"name":"Pinball Hall of Fame: The Williams Collection","year":2008,"developer":"FarSight Technologies Inc.","url":"sony_playstation2_p/Pinball%20Hall%20of%20Fame%20-%20The%20Williams%20Collection%20%28USA%29.zip","filesize":676643545,"score":8.2,"genres":"Simulation > 1st-person > Top-down > Pinball > Licensed","desc":"<p><i>Pinball Hall of Fame: The Williams Collection</i> is another entry in the PHOF budget series. Included in the PS2 version are eight authentic pinball tables, some of the best from the 1970s, 1980s and 1990s. The tables are:</p><ul><p></p><li>Black Knight (1980)</li><li>Firepower (1980)</li><li>Funhouse (1990)</li><li>Gorgar (1979)</li><li>Pinbot (1986)</li><li>Space Shuttle (1984)</li><li>Taxi (1988)</li><li>Whirlwind (1988)</li><p></p></ul>The 3DS version contains all the tables mentioned above minus Firepower.<p></p><ul>The PSP and Wii versions add two additional tables:<ul><li>Jive Time (1970)</li><li>Sorcerer (1985)</li></ul>The PS3 and XBox 360 versions add three more tables:<ul><li>Medieval Madness (1997)</li><li>No Good Gofers (1997)</li><li>Tales of the Arabian Knights (1996)</li></ul>The pinball tables can be combined with multi-player competitions that feature up to four players. The game includes table art and audio galleries. For the PSP version, the game can be played vertically from a top-down view with a larger playing field. The Wii version offers a control options where the movements with the Wiimote mimic flippers of a real pinball table.  The PS3 and XBox 360 versions feature 1080p display, sharper textures, online high score boards, and new achievements/trophies.</ul>"},{"name":"Pink Pong","year":2003,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART19/Pink%20Pong%20%28Europe%29.zip","filesize":131791973,"score":"","genres":"Sports > 3rd-person (Other) > Anime / Manga > Ping pong / table tennis","desc":"<p><em>Pink Pong</em> is a straightforward 3D table tennis game featuring an all-female cast. Gameplay is simple; the face buttons execute different shot types, while the stick moves the player left and right. It is also possible to use the shoulder buttons to execute special moves, but these must be allowed to recharge after use.</p><p>The game features four different game modes. The main attraction is the Dramatic mode, in which the player selects a character and plays through a single-player story against a series of opponents. Additional costumes, items, and characters can be unlocked through this mode. There is also a Versus mode for two players, and a Free mode where the player can play a single match against the computer. There is also a Practice mode with multiple options.</p><p>The game features 13 total characters, including unlockables, as well as dozens of costumes and items to collect. There is also a View mode where the player can dress any character up in any of the available outfits and watch their animations, as well as listen to voice clips and read character bios.</p>"},{"name":"Pinocchio","year":2007,"developer":"Aqua Pacific Ltd.","url":"PS2_COLLECTION_PART19/Pinocchio%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":516334389,"score":"","genres":"Puzzle > Top-down > Turn-based > Cards / tiles > Tile matching puzzle > Point and select","desc":"<p>The puppet maker Gepetto carves a wooden puppet boy as he has no son of his own. The puppet comes to life and Gepetto names him Pinocchio. Gepetto sends him off to school - will Pinocchio be a good boy, or will his mischief get the better of him?</p><p><em>Pinocchio</em> is a game based on the popular fairy tale of the same name. It features a short cartoon which tells the tale of Pinocchio and his many adventures. The mini-games are based on scenes from the cartoon. They are:</p><ul><li><strong>Coloring</strong>: Select a line art version of a scene, and then color it in using the pointer and paint pots.</li><li><strong>Pairs</strong>: Match up all the pairs of cards displayed on the screen.</li><li><strong>Jigsaw</strong>: Select a scene from the cartoon, and then reassemble the Jigsaw Puzzle.</li><li><strong>Puzzle</strong>: Select a scene from the cartoon, and then reassemble the scene by swapping puzzle pieces until they are all in their correct positions.</li></ul>"},{"name":"Pipe Mania","year":2008,"developer":"Razorworks","url":"PS2_COLLECTION_PART19/Pipe%20Mania%20%28Europe%29%20%28En%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":523854307,"score":7.5,"genres":"Puzzle > Top-down > Real-time > Point and select","desc":"<p>Alfonso Senior, having made his fortune from the original <em>Pipe Mania</em>, has retired to Paradise Island. Unfortunately, the island has an alarmingly high number of plumbing-related problems. Alfonso's retired, but he's called in his kids Junior and Fawcett to fix up the island, and maybe learn a few things about plumbing along the way.</p><p>Gameplay is similar to the classic Pipe Dream/Pipe Mania, but with a more mission-based structure, and more unusual modes. Missions can be replayed to get a higher grade, and high grades can unlock various treasures, such as movies, character bios, and new game modes. <em>Pipe Mania</em> even has a multiplayer mode; compete against a friend for points, or use your attacks to damage your opponent's pipes.</p>"},{"name":"Pirates of the Caribbean: The Legend of Jack Sparrow","year":2006,"developer":"7 Studios, Inc.","url":"sony_playstation2_p/Pirates%20of%20the%20Caribbean%20-%20The%20Legend%20of%20Jack%20Sparrow%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28v2.00%29.zip","filesize":3871930606,"score":5.4,"genres":"Action > 3rd-person (Other) > Puzzle elements > Sea pirates / Caribbean > Licensed","desc":"<p>Colorful Captain Jack Sparrow weaves a tale tall as only he is capable, retelling events fans have come love, and adding new and even more far fetched adventures. Accompanying Captain Jack on his journey of fancy are the young Will Turner and his bride to be Elizabeth Swann.</p><p>Gameplay flows much like other third-person action-adventures such as God of War or Demon Stone. Players can fight alone, or team up with a friend to conquer the fast-paced, hack and slash romp through exotic locations. Other features include a player-controlled upgrade system, along with a diverse set of sword fighting and grappling moves. Puzzles in the form of mini-games can be found throughout the game's 20+ levels.</p>"},{"name":"Pirates: Legend of the Black Buccaneer","year":2006,"developer":"Widescreen Games SARL","url":"sony_playstation2_p/Pirates%20-%20Legend%20of%20the%20Black%20Buccaneer%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":949528766,"score":5.8,"genres":"Action > 3rd-person (Other) > Puzzle elements","desc":"<p>Pirate Francis Blade suffers shipwreck and washes ashore on the mysterious island La Borgne. In a cave, he discovers an amulet that allows him to transform into Black Buccaneer, a cursed pirate with supernatural voodoo powers. He needs to find a way off the island, collect items to repair his ship, and fight the witch La Borgne who guards the treasure she has collected over the years.</p><p>The 3rd-person gameplay is similar to the modern Prince of Persia games. Francis Blade uses his sword, gun, and magic to fight enemies in a Caribbean setting. There are also a lot of environment-based puzzles with acrobatic moves. The area has been divided into 18 major sections, not all of them available right away. Blade needs to collect new powers for his Black Buccaneer form, and can for instance take control of enemies or summon minions.</p><p>Killing enemies provides points, which can be used to offer to the voodoo god to continue when Blade dies.</p>"},{"name":"Pirates: The Legend of Black Kat","year":2002,"developer":"Westwood Studios, Inc.","url":"PS2_COLLECTION_PART19/Pirates%20-%20The%20Legend%20of%20Black%20Kat%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2151904024,"score":7.2,"genres":"Action > 1st-person > 3rd-person (Other) > Naval / watercraft > Fantasy","desc":"<p>Mara Rousseau, the fearless leader of the Pirates of Skull Cove, decided to settle down one day. She married Marcus de Leon, the governor of the Pirate Isles, and they had a daughter named Katarina. The governor always wanted to protect her from the dangers of a pirate's life - especially after her mother disappeared without a trace. But when the ruthless Captain Hawke begins to terrorize the islands with his gang, the Crimson Guard, Katarina realizes she must find a way to stop him at all costs.</p><p><em>Pirates: The Legend of Black Kat</em> is an action game consisting of two main modes: sailing and land exploration. While sailing, Katarina's ship encounters hostile vessels and may engage in naval battles. The player must explore islands on foot to find special items that would unlock new areas on the map. Each island is a fairly linear area with respawning enemies hindering Katarina's progress. The player can also find keys allowing him to unlock treasure chests, and search for various items for collecting purposes.</p>"},{"name":"Pitfall: The Lost Expedition","year":2004,"developer":"Edge of Reality, Ltd.","url":"PS2_COLLECTION_PART19/Pitfall%20-%20The%20Lost%20Expedition%20%28Europe%29.zip","filesize":691080456,"score":6.9,"genres":"Action > Behind view > Metroidvania > Puzzle elements > South America","desc":"<p>You play as Pitfall Harry, intrepid adventurer on a mission to rescue an archaeological expedition that has gotten lost in the Peruvian jungle.  Along the way you'll do battle with your arch rival, Jonathan St. Claire, and help fulfill an ancient prophecy to save the world.</p><p>Gameplay takes the form of classic platformer action meets Metroid-style adventure as you explore through jungles, ruins, caverns, and mountains, looking for items that will open new avenues for exploration in a huge, connected world.</p>"},{"name":"Pizzicato Polka: Ensa Genya","year":2004,"developer":"Pajamas Soft","url":"sony_playstation2_p/Pizzicato%20Polka%20-%20Ensa%20Gen%27ya%20%28Japan%29.zip","filesize":1611789723,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Visual novel","desc":"<p><em>Pizzicato Polka: Ensa Genya</em> for PlayStation 2 and Dreamcast is port of an adult PC (Windows) visual novel called Pizzicato Polka: Suisei Genya released half a year earlier. Despite the fact that console releases retain mature rating, the sex scenes have been removed and story adjusted to work without it.</p><p>Unique elements and main additions to console port are:</p><ul><li>additional scenario by Romeo Tanaka* lip-syncing character animation added (by KID development team)</li><li>new event CG (over 30 images) and updated original graphics</li><li>new theme song</li><li>built-in KID's visual novel gameplay system</li></ul>"},{"name":"Planetarian: The Reverie of a Little Planet","year":2006,"developer":"Key Co., Ltd."},{"name":"Playboy: The Mansion","year":2005,"developer":"Cyberlore Studios, Inc.","url":"PS2_COLLECTION_PART19/Playboy%20-%20The%20Mansion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1746455783,"score":5.8,"genres":"Simulation > Strategy > Diagonal-down > Free-roaming camera > Real-time > Managerial / business simulation > Adult > Licensed","desc":"<p>Live the life of Hugh Hefner in this \"Virtual Hef\" simulation.</p><p>As a young Hugh Hefner, it is the player's goal to build the Playboy empire through sexy parties and putting together Playboy magazine every month. Build friendships and business contacts with celebrities, political figures, musicians, sports stars and more through hosting events and charming over people. </p><p>On the business side, Hef has to hire a staff to take photos and write articles for the magazine. The \"Playboy Photoshoot\" mode allows the player to take the role of photographer. On the personal side, invite friends into your inner circle, and find a girlfriend... or two.... or more. The better the parties Hef throws, the more fame he gets, as well as more interesting people to fill the magazine. More money means a larger staff, and more items (toys and furniture) for Hef to display in the Mansion.</p><p>Doing well in the game earns Hef points which can be used to purchase extra features, such as cheats and archive photos of Hef and past issue covers.</p>"},{"name":"Pochi and Nyaa","year":2004,"developer":"Compile","url":"sony_playstation2_p/Pochi%20to%20Nyaa%20%28Japan%29.zip","filesize":105083992,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Falling block puzzle > Martial arts","desc":"<p>Far beyond our own dimension, on a planet not too different from ours, lies a magical land that is home to all sorts of gods. But the gods the denizens worship most of all are Pochi, the god of dogs, and Nyaa, the god of cats. Every 1000 years, these two gods hold a \"Pochi and Nyaa\" tournament to determine which god shall rule the heavens in the millennium to come. But, in order to hold this tournament, they'll need all the mortal help they can get. And that's where our heroine, the novice mage (and sweets lover) Prim, enters the picture...</p><p><em>Pochi to Nyaa</em> is a puzzle game where a single player controlling Prim must fight through a series of kooky characters in hopes of making the millennial Pochi and Nyaa tournament go off without a hitch. To do so, Prim must stack up Nyans of the same color together and set them off by turning a Nyan into a Spiky Nyan. (The more Nyans, tails and/or splits involved, the higher the attack power.) Depending on how powerful the attack is, Intruders (dogs) will drop on the opposing side's field. When the opponent is drowned in a flood of cute animals, it's Game Over.</p><p>In addition to Story Mode, the player can fight in head-to-head battles - against either the CPU or a friend.</p>"},{"name":"Poker Masters","year":2005,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART19/Poker%20Masters%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":47770093,"score":"","genres":"Gambling > Strategy > 3rd-person (Other) > Cards / tiles","desc":"<p><em>Poker Masters</em> is a single player poker game.</p><p>This game features five popular variants of the game Texas Hold Em, Stud, 5 Card Draw, Caribbean, and Omaha. There are two modes of play, Quick Play and Career Mode. In Career Mode the player can select the player they wish to play as and as they progress through the game they get to play in five different locations starting in the Alleyway.</p>"},{"name":"Polar Express, The","year":2004,"developer":"Blue Tongue Entertainment Pty, Ltd.","url":"sony_playstation2_p/Polar%20Express%2C%20The%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":967059645,"score":6,"genres":"Action > Behind view > Licensed","desc":"<p><em>The Polar Express</em> is a 3D action platformer based on Robert Zemeckis' animated Christmas film from 2004.</p><p>Play as Chris, the hero boy, and make your way to the North Pole on The Polar Express, helping the other kids to overcome the hazards and villains on the way to meet Santa!</p><p>Find the children's missing tickets, navigate the spooky train carriage, run along the carriage rooftop, fight against Scrooge, ski down the slopes with the hobo, ride in the suck-o-matic tube system and fly the zeppelin to North Pole!</p><p>A variety of activities make up this exciting Christmas adventure, including beat/dancing games, run and jumping levels, flying, skiing, and adventure elements, such as collecting lost train tickets and defeating mischievous toys!</p>"},{"name":"Police 24-7","year":2002,"developer":"Konami Corporation","url":"PS2_COLLECTION_PART19/Police%2024-7%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":171246214,"score":"","genres":"Action > 1st-person > Shooter > Direct control > Automobile > Japan (Modern/Futuristic) > North America > Crime","desc":"<p>This shooter-on-rails light gun game throws the player into the role of a police officer responding to several different incidents with armed criminals. The game is unique in that the arcade machine reads the player's physical movements, leading to an intense play experience (and workout). The player must rely on both situational awareness and physical ability as they duck, crouch and lean to dodge enemy shots and hide behind cover.</p>"},{"name":"Police Chase Down","year":2003,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART19/Police%20Chase%20Down%20%28Europe%29.zip","filesize":117906311,"score":4.9,"genres":"Action","desc":"<p>Escort the Government VIP and defend him from the unrelenting terrorists assaults in this all action adventure. As part of an elite police squad you get to choose from one of four tough law enforcement officials. Race through freeways, cities and wilderness areas in over 10 top-secret missions.</p>"},{"name":"Pool Shark 2","year":2004,"developer":"Blade Interactive Studios Ltd.","url":"PS2_COLLECTION_PART19/Pool-shark%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1124880026,"score":6.7,"genres":"Sports > 1st-person > Pool / snooker","desc":"<p><em>Pool:shark 2</em> is a simulation of the pool sport. Its most unique aspect is its setting: instead of high class tournaments, the player finds themself in smoky pubs with opponents like truck-drivers and lightly clad biker women. The handling, however, is similar to other pool games. The player has a lot of opportunities to tweak the position of the cue. A analog stick or mouse movement simulates the shot.</p><p>The game features ten pool variants, including popular ones like Eight-Ball and trick shots or exotic ones like snowboat pool. When playing the career mode (called \"Hustler\"), the player can bet money. The winnings are reinvested in clothes or pieces of equipment which look different but have no bearing on gameplay. Every successful match unlocks the next from a roster of 20 opponents overall.</p>"},{"name":"Pop'n music 10","year":2004,"developer":"Konami Corporation","url":"sony_playstation2_p/Pop%27n%20Music%2010%20%28Japan%29%20%28v2.00%29.zip","filesize":1047070180,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>pop'n music 10</em> is one of the many titles in Konami's long-running rhythm game franchise. Notes scroll toward the bottom of the screen along nine tracks, and the player must tap the correct buttons in time with the music to play along. Play well, and the \"groove meter\" increases, but play poorly and it will drop. If the groove meter is high enough at the end of the song, the player can move on to the next song. This version includes over 80 tracks, primarily from the arcade version of the same title. The arcade, free, challenge, battle, and study modes from previous releases have returned.</p>"},{"name":"Pop'n music 7","year":2002,"developer":"Konami Corporation","url":"sony_playstation2_p/Pop%27n%20Music%207%20%28Japan%29.zip","filesize":760960251,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>pop'n music 7</em> is one of the many titles in Konami's long-running rhythm game franchise, and the first to appear on the PlayStation 2. Notes scroll toward the bottom of the screen along nine tracks, and the player must tap the correct buttons in time with the music to play along. Play well, and the \"groove meter\" increases, but play poorly and it will drop. If the groove meter is high enough at the end of the song, the player can move on to the next song.</p><p>Owing to the more powerful hardware, the sound and visual quality has been increased to the same level as the arcade version. This release also includes a new \"Study Mode\" that teaches new players how to play, and also includes the Battle mode for the first time in a home release. The tracklist is similar to but not the same as the arcade version, and includes more than 90 tracks total including unlockables.</p>"},{"name":"Pop'n music 8","year":2003,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_p/Pop%27n%20Music%208%20%28Japan%29.zip","filesize":802861368,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>pop'n music 8</em> is one of the many titles in Konami's long-running rhythm game franchise. Notes scroll toward the bottom of the screen along nine tracks, and the player must tap the correct buttons in time with the music to play along. Play well, and the \"groove meter\" increases, but play poorly and it will drop. If the groove meter is high enough at the end of the song, the player can move on to the next song.</p><p>This version includes over 100 tracks, primarily from the arcade version of the same title. The arcade, free, challenge, battle, and study modes from previous releases have returned. There is also a board game where unlockable songs and other items can be obtained by completing randomized challenges in arcade mode.</p>"},{"name":"Pop'n music 9","year":2004,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_p/Pop%27n%20Music%209%20%28Japan%29.zip","filesize":1024769306,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>pop'n music 9</em> is one of the many titles in Konami's long-running rhythm game franchise. Notes scroll toward the bottom of the screen along nine tracks, and the player must tap the correct buttons in time with the music to play along. Play well, and the \"groove meter\" increases, but play poorly and it will drop. If the groove meter is high enough at the end of the song, the player can move on to the next song.</p><p>This version includes over 110 tracks, primarily from the arcade version of the same title. The arcade, free, challenge, battle, and study modes from previous releases have returned. Unlockable songs and items are obtained through a dungeon-crawling minigame at the end of every arcade play.</p>"},{"name":"Pop'n music: Best Hits!","year":2003,"developer":"Konami Computer Entertainment Studios, Inc.","url":"sony_playstation2_p/Pop%27n%20Music%20Best%20Hits%21%20%28Japan%29.zip","filesize":491802414,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>Best Hits!</em> is one of the many titles in Konami's long-running rhythm game franchise. Notes scroll toward the bottom of the screen along nine tracks, and the player must tap the correct buttons in time with the music to play along. Play well, and the \"groove meter\" increases, but play poorly and it will drop. If the groove meter is high enough at the end of the song, the player can move on to the next song.</p><p>This version includes more than 50 fan-favorite tracks from the first six entries in the series, including several tracks that were cut from the home release of pop'n music 6.</p>"},{"name":"PopCap Hits! Vol 1","year":2007,"developer":"","url":"sony_playstation2_p/PopCap%20Hits%21%20Vol.%201%20%28USA%29.zip","filesize":110646034,"score":"","genres":"Compilation","desc":"<p>The first PopCap compilation of games for the PlayStation 2. It bundles two games that were previously not available for the platform:* AstroPop</p><ul><li>Bejeweled 2</li></ul>"},{"name":"PopCap Hits! Vol 2","year":2008,"developer":"","url":"sony_playstation2_p/PopCap%20Hits%21%20Vol.%202%20%28USA%29.zip","filesize":325729217,"score":"","genres":"Compilation","desc":"<p>The second PopCap compilation of games for the PlayStation 2. It bundles two games that were previously not available for the platform:* Heavy Weapon</p><ul><li>Zuma</li></ul>"},{"name":"PopStar Guitar","year":2008,"developer":"Broadsword Interactive Limited","url":"sony_playstation2_p/PopStar%20Guitar%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3253919358,"score":"","genres":"Simulation > Music / rhythm","desc":"<p>Jam to the hottest hits!</p><p>STEP UP TO THE CHALLENGE - Get a quick blast with single player & multi-player mini games.</p><p>GLAMORIZE - Form a band and customize by shopping for the latest fashions and raddest instruments.</p><p>FIND FAME AND FORTUNE - Perform over 50 Pop Hits on your way to stardom.</p>"},{"name":"Portal Runner","year":2001,"developer":"The 3DO Company","url":"PS2_COLLECTION_PART19/Portal%20Runner%20%28Europe%29%20%28Fr%2CDe%2CEs%2CIt%29.zip","filesize":2811543259,"score":6.1,"genres":"Action > 1st-person > Behind view > Arcade > Puzzle elements > Shooter","desc":"<p>Brigitte Bleu began to rule the world after the imprisonment of General Plastro. She tries to get rid of her rival Vicki in order to get hold of her sweetheart Sarge. However, Vicki has other plans in mind. Teaming up with a friendly lion named Leo, she embarks on a quest to end Brigitte's reign once and for all.</p><p><em>Portal Runner</em> is a 3D action game with puzzle-solving elements, and a spin-off in the Army Men series. There are five worlds to travel to in the game. Environmental puzzles, platform jumping and battles against enemies constitute the bulk of the gameplay. Vicki can shoot arrows at the enemies, and strafe to avoid their fire. Leo can be controlled either indirectly, by issuing orders to him, or in exclusive stages where he fights using his claws. Some stages feature Vicki riding Leo.</p>"},{"name":"Postman Pat","year":2008,"developer":"The Code Monkeys Ltd.","url":"sony_playstation2_p/Postman%20Pat%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":291931917,"score":"","genres":"Action > Mini-games > Licensed","desc":"<p>LOTS OF FUN WITH POSTMAN PAT AND FRIENDS!<br><br>Join in the fun with Postman Pat and Jess, his black and white cat, as they deliver the post and make their way to the Greendale bike race. Encountering many adventures and helping Pat's friends along the way, there are many different games for you to play, based on the much-loved Postman Pat animation series. * 4 PLAYABLE CHARACTERS! Play as Postman Pat, handyman Ted Glen, vet Amy Wrigglesworth and PC Selby in their own unique challenges! * BLOW INTO THE MICROPHONE! Have fun blowing letters around the sorting office and blow Ted Glen around the village! * 10 MINI-GAMES! Play hide-and-seek with Jess the cat, find missing post, and take part in the Greendale bike race!</p>"},{"name":"Power Drome","year":2004,"developer":"Argonaut Sheffield","url":"sony_playstation2_p/Power%20Drome%20%28USA%29.zip","filesize":1200205765,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Sci-fi / futuristic","desc":"<p>An update of an Amiga and ST game, <em>Powerdrome</em> is racing in its purest form. </p><p>Breathtaking speeds of 1,000 miles per hour make Powerdrome the fastest and most dangerous racing sport. 12 riders risk all each with their own personality, racing style, and friends or foes.</p><p>Push your skills to the max in single player and multiplayer action, including split screen, and system link for the XBox.</p>"},{"name":"Power Rangers: Dino Thunder","year":2004,"developer":"Pacific Coast Power & Light","url":"PS2_COLLECTION_PART19/Power%20Rangers%20-%20Dino%20Thunder%20%28Europe%29.zip","filesize":493453427,"score":"","genres":"Action > Behind view > Fantasy > Licensed","desc":"<p><em>Power Rangers: Dino Thunder</em> is a 3D action game based on the TV show of the same name. The evil Mesogog wants to return the world to the days that the dinosaurs walked the earth, by harnessing the power of Dino Gems. To stop this evil plan from happening, three students become Dino Thunder Power Rangers, giving them control over mechanical dinosaurs known as DinoZords.</p><p>In the game you take control of a DinoZord and have to complete missions. These range from collecting items, destroying enemies and escorting and defending AI controlled allies. Controllable Zords include the flying Ptera Zord and the walking Tricera and Tyranno Zord. During missions the player can freely switch between them and they are fused together during boss fights into a giant mech known as a Megazord.</p>"},{"name":"Power Rangers: Super Legends","year":2007,"developer":"Artificial Mind & Movement","url":"PS2_COLLECTION_PART19/Power%20Rangers%20-%20Dino%20Thunder%20%28Europe%29.zip","filesize":493453427,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>Power Rangers: Super Legends</em> is an action game based on the <em>Power Rangers</em> franchise. Lord Zedd has reappeared and is hiding in a hidden dimension where he interferes with the time stream in an attempt to destroy the Power Rangers permanently by altering the course of history. Omega Ranger takes on Zedd by gathering a force of Power Rangers.</p><p>The game features 20 rangers to choose from and a two-player mode. It is entirely in 3D but mostly plays as a 2.5D platformer.</p>"},{"name":"Power Volleyball","year":2007,"developer":"","url":"PS2_COLLECTION_PART19/Power%20Volleyball%20%28Europe%29.zip","filesize":70366243,"score":"","genres":"Sports > Volleyball","desc":"<p>It's summer time - beautiful seashore, hot sand, burning sun, and most importantly big amounts of fun!</p>"},{"name":"Powerpuff Girls, The: Relish Rampage","year":2002,"developer":"VIS Entertainment Limited","url":"PS2_COLLECTION_PART19/Powerpuff%20Girls%2C%20The%20-%20Relish%20Rampage%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":1562759528,"score":"","genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>Townsville in a relish rampage!?</p><p>The Powerpuff Girls are in a real pickle this time!   Mojo Jojo, in his bid to become mayor, has accidentally summoned an entire race of mutant pickles to Townsville and they're taking over!   Chaos reigns and the whole city has gone mad, or is that just plain marinated?   It's time for some serious Powerpuff action!   Your mission is to take on that bad monkey, Mojo Jojo, and then send those perilous polluting pickles back home!</p>"},{"name":"Powershot Pinball","year":2006,"developer":"","url":"PS2_COLLECTION_PART19/Powershot%20Pinball%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":93476392,"score":"","genres":"Action > Diagonal-down > Arcade > Pinball","desc":"<p>All the addictive charm of the classic pinball machine brought to your living room.</p><p>A great mix of thrilling traditional tables and inspired fantasy settings. Groundbreaking double player option: Battle it out in duel mode or choose to play co operatively. Multiple modes to play: Time Mode, Adventure Mode and Multiplayer.</p><p>This product is an emulated version of a PlayStation®2 game. Some functionality, including online functionality, may vary from the original PS2™ version of this product or may not be available.</p><p>Download of this product is subject to the Sony Entertainment Network Terms of Service/User Agreement and any specific additional conditions applying to this product. If you do not wish to accept these terms, do not download this product. See Terms of Service for more important information. One time fee for use of downloads on up to 2 activated compatible Home Console* systems.</p>"},{"name":"Predator: Concrete Jungle","year":2005,"developer":"Eurocom Developments Ltd","url":"PS2_COLLECTION_PART19/Predator%20-%20Concrete%20Jungle%20%28Europe%29.zip","filesize":1135923956,"score":5.3,"genres":"Action > 3rd-person (Other) > Direct control > Sci-fi / futuristic > Licensed","desc":"<p>When a sweltering night arrives in the summer of 1930, New Way City is visited by a creature of extraterrestrial origin. He is not there it conquer or to make first contact; he is there to hunt, and his prey is Man. After taking on warring mobsters the Predator is shot in the eye and hastily escapes, but leaves some of his equipment behind. While attempting to escape from the city in his ship, rubble falls onto the wounded hunter and pins him in place. In a suicidal attempt at preventing his remaining gear from being pilfered by humans, the Predator causes his ship to self-destruct; However, he survives and is rescued by his clan-folk. By committing the grave taboo of allowing his prey to obtain Predator technology, the one-eyed Predator is exiled to a hostile desert planet.</p><p>Fast forward one hundred years and the Predator, now known as Scarface, returns to the city of his botched hunting trip. New Way City has grown into the futuristic Neonopolis, where gangs still reign in terror. In order to regain his honor, Scarface must regain his captured hunting gear and will not let anyone stand in his way. Just like the natural variant, the concrete jungle is a competitive and unwelcoming place where only the fittest survive. Scarface faces brutal gangs, hulking robots, heavily armed soldiers, cyborgs, and even his own kin in his quest to retrieve his lost technology. The hunt is on.</p><p>In <em>Predator: Concrete</em> Jungle the player assumes the role of Scarface, the dishonored Predator on trail of his stolen equipment. It is a 3rd-person action game where the player often has to resort to hand-to-hand combat. Players make use of various upgradeable weapons such as glaives, mauls, a combistick, and famous wrist blades to take on enemies of increasing difficulty and specific weaknesses. Projectile weapons include a spear gun that can pin enemies to walls and the notorious shoulder-mounted plasma caster. Scarface also has access to the iconic cloaking device and a helmet with thermal vision. The player can tear the skulls and spinal cords out of certain enemies to claim as trophies to display in Scarface's ship. The city is \"level\" based, often requiring the play to complete certain objectives before moving on to the next \"level\". Players can also unlock special costumes for Scarface, many of which are from the various <em>Predator</em> / <em>Aliens vs. Predator</em> films.</p>"},{"name":"Premier Manager 08","year":2007,"developer":"ZOO Digital Publishing Ltd.","url":"PS2_COLLECTION_PART19/Premier%20Manager%2008%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":109833644,"score":5.9,"genres":"Sports > Text-based / Spreadsheet > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p><em>Premier Manager 08</em> is a soccer manager where the player is responsible for the athletic and financial success of his team. Similarly to other games of the sort, there are a lot of details to take care of, e.g. searching for sponsors, stadium expansion, player transfers, lineup and tactics. But, as usual for English soccer managers, the emphasis is on the athletic aspect.</p><p>The player character earns experience depending on his successes and unlocks new abilities with it, like constructing a certain building. The same goes for the staff members. The second innovation is a new bar where the player has quick access to his staff members who keep him up to date - this replaces the usual news systems. The matches themselves use an abstract presentation: the soccer field is shown in a top-down, tactical perspective and the player movements are shown with blue and yellow balls. The game features about 400 teams in six leagues.</p>"},{"name":"Premier Manager 09","year":2008,"developer":"ZOO Digital Publishing Ltd.","url":"PS2_COLLECTION_PART19/Premier%20Manager%2009%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":83026428,"score":"","genres":"Simulation > Sports > Text-based / Spreadsheet > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p>Premier Manager 09 is the longest running football management simulation in the games industry.</p><p>The main focus of Premier Manager games lately is ease of use, aiming for a pick up and play audience rather than hard-core football simulation fanatics.</p><p>It offers a simpler management game with a less complex match and tactics engine to appeal to younger gamers who are looking for a casual introduction to football management.</p><p>The game boasts:</p><p>A maximum of 6 playable leagues to choose from (England, Germany, Spain, Italy, France &amp; Scotland) each with their own sub divisions.</p><p>An easy to use interface for full management of a chosen club, with a browser style favourites section to store most visited options.</p><p>RPG style levelling up of players, staff and facilities over time.</p><p>An all new stadium builder which allows for controlled expansion of stadium capacity with the option to move to new stadiums.</p><p>Improved look and feel with faster navigation of menus and club specific themes and backgrounds.</p>"},{"name":"Premier Manager 2003-04","year":2003,"developer":"ZOO Digital Publishing Ltd.","url":"PS2_COLLECTION_PART19/Premier%20Manager%202003-04%20%28Europe%29.zip","filesize":22748174,"score":"","genres":"Simulation > Sports > Strategy > 1st-person > Managerial / business simulation > Football (European) / Soccer","desc":"<p><em>Premier Manager 2003-04</em> is a soccer management sim, in which the player is responsible for the athletic and financial success of a soccer team. </p><p>The game features all 4 divisions and domestic cups of the English leagues, all 4divisions, FA and league cups of the Scottish one, and the top 2 divisions and domestic cups of the French, German, Italian and Spanish leagues.</p><p>The matches are shown using a 2D engine.</p>"},{"name":"Premier Manager 2004-2005","year":2004,"developer":"Tuna Technologies Ltd.","url":"PS2_COLLECTION_PART19/Premier%20Manager%202004-2005%20%28Europe%29.zip","filesize":63342563,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Top-down > Managerial / business simulation > Football (European) / Soccer","desc":"<p><em>Premier Manager 2004-2005</em> is a soccer manager where the player is responsible for the athletic and financial success of his team. As usual there are a lot of details to take care of, e.g. searching for sponsors, stadium expansion, player transfers, lineup and tactics. But, as usual for English soccer managers, the emphasis is on the athletic aspect.</p><p>The matches itself use an abstract presentation: the soccer field is shown in a top-down, tactical perspective and the player movements are shown with blue and red balls. It also features a new meeting system where the player needs to convince the management of his views before important decisions.</p>"},{"name":"Premier Manager 2005-2006","year":2005,"developer":"Tuna Technologies Ltd.","url":"PS2_COLLECTION_PART19/Premier%20Manager%202005-2006%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":339510335,"score":"","genres":"Sports > Managerial / business simulation > Football (European) / Soccer","desc":"<p>In this version of Premier Manager, the player has the ability to control a team in the top two divisions in England, Italy, Spain, Germany or France, but many players are also available from non-playable leagues.</p><p>The manager is in charge of hiring and selling players and staff; improving club property, such as the stadium, club shop and medical facilities; and of course, finding the perfect tactic (among seven available) for the players. The player has the option to jump one day or straight to the next event, which can be player transfer offers (or new progress on one), injuries or other club-related news.</p>"},{"name":"Premier Manager 2006-2007","year":2006,"developer":"ZOO Digital Publishing Ltd.","url":"PS2_COLLECTION_PART19/Premier%20Manager%202006-2007%20%28Europe%29%20%28En%2CFr%2CIt%29.zip","filesize":233937234,"score":"","genres":"Simulation > Sports > Text-based / Spreadsheet > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p>Experience all the emotion of football management in Premier Manager. Hand-pick the perfect squad from nearly 10,000 players then guide them through 14 divisions and 12 cups across 6 countries. Can you make it to the top or will you fall off the table? * Manage your team and update your strategies fast through an intelligent interface. Training players, negotiation transfers and dealing with the press – you'll be in total control.</p>"},{"name":"Premier Manager: 2002-2003 Season","year":2002,"developer":"Runecraft Ltd.","url":"PS2_COLLECTION_PART19/Premier%20Manager%202002-2003%20Season%20%28Europe%29.zip","filesize":535453264,"score":"","genres":"Simulation > Sports > Strategy > 1st-person > Managerial / business simulation > Football (European) / Soccer","desc":"<p>After many versions developed by Realms of Fantasy and Dinamic Multimedia, when Gremlin was acquired and then disbanded, it seemed this long-running series were about to end, but in 2002 ZOO Digital announced the return.</p><p>Featuring five nations (England with three leagues and Germany, Spain, France and Italy with two), PM takes a new approach to the series, not much different from the classic Match Day Manager. Each day has several time slots (from 8 a.m. to 6 p.m.) which your secretary can fill with appointments with other staff members, the chairman or players in order to discuss contracts and other working orders. While you can act freely between time slots, most actions can only be completed after a meeting with the staff.</p><p>As usual with managers with less detailed databases (those who don't allow to manage in the Estonian second division while tapping the youth pool in Taiwan), the player is also in control of setting ticket prices (and stadium building), advertising and website (which increases the value of the club, and lead to higher merchandise sales) and manage staff.</p><p>All staff conversations and player information screens are presented in full 3D, as well as the match engine. The news screen is based on real-life sports news TV channel EurosportNews.</p>"},{"name":"PRIDE FC: Fighting Championships","year":2003,"developer":"Anchor, Inc.","url":"sony_playstation2_p/Pride%20FC%20-%20Fighting%20Championships%20%28USA%29.zip","filesize":1153774826,"score":6.6,"genres":"Simulation > Sports > 3rd-person (Other) > Fighting > Wrestling","desc":"<p>All fighting styles are accepted in PRIDE fight. Fight in all positions; standing, in a clinch, and on the ground. 25 fighters from around the world are available to use. A 16- man single- elimination tournament is available. Play alone, or with up to 16 human players, or just watch 16 computer players fight the tournament.Customize your own character and fight in One Match mode to get ready for the Grad Prix. Also, get your name in one of the Top Ten Fighting Legends by defeating all 25 PRIDE fighters in Survival Mode.</p>"},{"name":"Primal","year":2003,"developer":"SCE Studio Cambridge","url":"PS2_COLLECTION_PART19/Primal%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3470460433,"score":7.5,"genres":"Action > 3rd-person (Other) > Platform","desc":"<p>Jen is the girlfriend of a metal rocker named Lewis, who have both been through rough times in the past together. A strange and powerful creature attacks Lewis after a concert and runs off into the night with him, leaving Jen injured and near-death.</p><p>Jen meets a short gargoyle named Scree, who informs her that she must leave the physical plane Mortalis and accompany him to the demon plane Oblivion. The creature who kidnapped Lewis and left her for dead is an agent of Abaddon who represents Chaos and has been locked in struggle for aeons with Arella, representing Order. The balance between Chaos and Order has been upset and it is Jen's task to restore the balance, all the while hoping to discover the whereabouts of Lewis.</p><p><em>Primal</em> can be described as a \"3D platformer\", being somewhat similar in its basic gameplay mechanics to  Tomb Raider games. Puzzle-solving and action-based combat constitute the focus of the gameplay. The player can switch between Jen and Scree at any time; Jen is capable of fighting, but Scree is invulnerable to enemy attacks. When Jen is incapacitated in combat, Scree must quickly restore her to life within a time limit; failure to do so prematurely ends the game.</p><p>Combat is heavily based on \"finishing moves\" and Jen's ability to transform into demonic forms. There are four demons Jen can merge herself with; they are obtained one by one as the game's narrative advances. These demonic forms allow Jen to use special abilities, which include jumping to extreme heights, unnaturally fast swimming, slowing down time, and using powerful weapons.</p>"},{"name":"Prince of Persia Trilogy","year":2006,"developer":""},{"name":"Prince of Persia: The Sands of Time","year":2003,"developer":"Ubisoft Entertainment Inc.","url":"PS2_COLLECTION_PART19/Prince%20of%20Persia%20-%20The%20Sands%20of%20Time%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3366756952,"score":8.4,"genres":"Action > Behind view > Platform > Puzzle elements > Fantasy > Middle East","desc":"<p>The King and the Prince of Persia are besieging the Maharajah's castle to plunder the treasures hidden inside. In order to impress his father, the Prince sneaks inside to recover the magical Dagger of Time. He quickly learns that this dagger has the ability to control time. The malevolent Vizier has other plans for the dagger, however, and tricks the Prince into unlocking a mysterious secret of the Dagger that causes the King and many of his subjects to be turned into sand zombies. Now, the Prince must figure out what has happened and try to set things right again.</p><p><em>Prince of Persia: The Sands of Time</em> is an action game with platforming and puzzle-solving elements. It updates many of the gameplay concepts from the previous games, and brings them into a fully three-dimensional world. The Prince will engage in sword fighting, wall climbing, spike dodging, puzzle solving, and more in his quest. The Prince also carries the Dagger of Time, which allows him to unleash several magical powers. The most important of these powers is the ability to reverse time. This ability allows the player to reverse their actions when they lead the Prince to his death.</p>"},{"name":"Prince of Persia: The Two Thrones","year":2005,"developer":"Ubisoft Entertainment Inc.","url":"PS2_COLLECTION_PART19/Prince%20of%20Persia%20-%20The%20Two%20Thrones%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2645118049,"score":7.9,"genres":"Action > Behind view > Platform > Puzzle elements > Quick Time Events (QTEs) > Fantasy > Middle East","desc":"<p>After many dangerous adventures, the Prince finally makes his way home to Babylon, bringing with him his new bride Kaileena, the Empress of Time. Their hopes for a peaceful and happy future together are dashed, however, when they arrive in Persia to find the land ravaged by war. Kaileena is promptly captured and murdered by the evil Vizier, and her death unleashes the Sands of Time, from which the Vizier derives terrifying new powers.</p><p>Once again the Prince of Persia must stand to fight, but this time he will be stronger than ever, thanks to his new alter ego the Dark Prince, born of the Prince's contact with the Sands. As he fights to reclaim his kingdom from the hands of a madman, he must also battle with his own inner demons as the Dark Prince threatens to consume him entirely.</p><p>The game is very similar (in terms of fight and puzzle sequences) to the previous installments of UbiSoft's Prince of Persia trilogy: The Sands of Time and Warrior Within. There are some major innovations like the character of the Dark Prince, who possesses the main protagonist from time to time and offers him new combos and moves. There is also a new ability, called \"Speed Kill\", which is very effective against all opponents in the game (victims are attacked from behind and murdered in brutal and stealthy fashion).</p><p>In Prince of Persia: The Two Thrones player will explore not only the streets of Babylon, but also a ruined palace of his father, a temple and the famous Hanging Gardens.</p>"},{"name":"Prince of Persia: Warrior Within","year":2004,"developer":"Ubisoft Entertainment Inc.","url":"PS2_COLLECTION_PART19/Prince%20of%20Persia%20-%20Warrior%20Within%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":3695213542,"score":7.7,"genres":"Action > 1st-person > Behind view > Platform > Puzzle elements > Fantasy > Middle East","desc":"<p><em>Prince of Persia: Warrior Within</em> is the direct sequel to Prince of Persia: The Sands of Time. Seven years later, the Prince is hunted by a monster known as Dahaka. He finds out that anyone who manipulates the Sands of Time is destined to die shortly afterwards; but the Prince has escaped his fate, and that's the reason for Dahaka's rage. Now the Prince must travel to the mysterious Island of Time, where he hopes to find the Empress of Time and, through time manipulation, somehow prevent her from creating the Sands in the first place...</p><p>The game comes with a new, darker look for the Prince and his surroundings. The fights are more brutal and take a larger part in the game, as the Prince now has enhanced fighting moves including new attack moves via walls and poles.</p><p>Even though the fights make up a large part of the game, the puzzle sections are still present and more complicated than before. A new move in the puzzle sections of the game is the curtain slide, which allows you to slide down to the ground slowly. There are still plenty of options for time manipulation and the storyline also lets you travel back and forth in time, visiting the same locations in an alternate time period.</p>"},{"name":"Princess Maker 5","year":2008,"developer":"Gainax Co., Ltd.","url":"sony_playstation2_p/Princess%20Maker%205%20%28Japan%29.zip","filesize":1304450506,"score":"","genres":"Simulation > 1st-person > Fixed / flip-screen > Anime / Manga > Turn-based > Life / social simulation > Menu structures > Fantasy","desc":"<p>The fifth of the Princess Maker games by Studio Gainax.</p><p>Unlike all the rest, this one takes place in modern Japan, albeit a Japan in a world where there are demons and fairies.</p><p>Also in other series firsts, the player is not automatically a father. If they so choose, they can be a mother. Lastly, this daughter has no Canon Name.</p>"},{"name":"Prisoner of War: World War II","year":2002,"developer":"Wide Games","url":"PS2_COLLECTION_PART19/Prisoner%20of%20War%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1478842824,"score":6.7,"genres":"Action > 3rd-person (Other) > Stealth > World War II > War","desc":"<p>It is World War II, and the player takes the role of an American pilot, Captain Lewis Stone, who is thrown into a prison camp of the Nazis. While attempting to escape the camp, Captain Stone discovers that the Germans are developing a secret weapon they intend to use against the Allies. Soon his personal wish of escape turns into a desire to save the world from the destruction the Nazis are planning.</p><p><em>Prisoner of War</em> can be described as a stealth game. Unlike most other games of its kind (e.g. the Thief series), the game relies on stealth entirely, without offering violent options. The protagonist is helpless in the prison camp, and his only weapon is his wit. Sneaking past guards to deliver an important object to a fellow prisoner, hiding items, staying in shadows to avoid being recognized, and other stealth-based activities occupy the largest portion of the game.</p>"},{"name":"Private Nurse Maria","year":2003,"developer":"AngelSmile","url":"sony_playstation2_p/Private%20Nurse%20-%20Maria%20%28Japan%29.zip","filesize":1068943996,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Healthcare","desc":"<p><em>Private Nurse Maria</em> is the PlayStation 2 port of the Windows hentai visual novel Private Nurse. Aside from adding the name of the lead heroine to the game's title, all the adult content has been removed and the story adjusted accordingly so it works without it. The staff from the original release has been reassembled to update and polish the graphics, soundtrack, and the story scenario. Additionally, after the end game a bonus scenario becomes available which adds more to the story and overall gameplay. This release also includes a small band-aid pouch holding 10 band-aids, both items featuring artwork of a lead heroine Maria from the game.</p>"},{"name":"Pro Biker 2","year":2007,"developer":"","url":"PS2_COLLECTION_PART19/Pro%20Biker%202%20%28Europe%29.zip","filesize":77221572,"score":"","genres":"Racing / Driving > Behind view > Bike / bicycling","desc":"<p>Out-peddle, outwit & outrun the best in a contest of twists, jumps, skidmarks and dust.</p><p>Develop your skills in the Quick Races, get your name up there among the fastest in the Time Trials, and take on the very best to win the coveted trophies in the Tournaments to become the champion Pro Biker!</p><p>It’s all about the peddle power!</p>"},{"name":"Pro Evolution Soccer","year":2001,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"PS2_COLLECTION_PART19/Pro%20Evolution%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%29%20%28v2.00%29.zip","filesize":614227601,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p><em>Pro Evolution Soccer</em> has more than 50 international soccer sides and 16 of the best club teams from around the world - ranging from Manchester United and AC Milan to Leeds United, who were briefly a top side at this time.</p><p>The player also has a large array of options. The player can play single matches as well as league or cup tournaments, and there is also a training mode. There are 5 difficulty levels, different weather conditions, and injuries are optional, as are extra time and penalty shoot-outs. Players can be designed with a range of physical and mental attributes, as well as different appearances.</p><p>Gameplay is not as end-to-end as the contemporary FIFA titles, and finishing is more of a matter of precise timing and skill. Players and officials make mistakes on occasion as well.</p>"},{"name":"Pro Evolution Soccer: Management","year":2006,"developer":"Konami Digital Entertainment Co., Ltd.","url":"PS2_COLLECTION_PART19/Pro%20Evolution%20Soccer%20Management%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1839869424,"score":"","genres":"Sports > Strategy > Text-based / Spreadsheet > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p><em>Pro Evolution Soccer: Management</em> is a football management game from the developers of the long running Pro Evolution Soccer series. The main game is single player but there is a two player option to play a single game with a friend.</p><p>This game claims to give the player the chance to manage any of one hundred and sixteen clubs from six top European leagues. This is not a fully licensed title, so while in the English league Chelsea and Arsenal are present, other teams are Merseyside Red, Merseyside Blue, Man Red etc. instead of Liverpool, Everton and Manchester United. The full list of leagues and teams available is as follows:* Serie A (Italy): Juventus, AC Milan, Inter, Udinese, Sampdoria, Palermo, Messina, AS Roma, Livorno, Lazio, Lecce, Reggina, Siena, Chievo Verona, Fiorentina, Parma, Trevisio, Ascoli, Cluesusritchi</p><ul><li>Eredivisie (Netherlands): PSV Eindhoven, Ajax, AZ, Feyenoord, SC Heerenveen, FC Twente, Vitesse, Roda JC, RKC Waalwijk, Willem II, FC Utrecht, FC Groningen, NEC Nijmegen, ADO Den Hag, NAC Breda, RBC Roosendaal, Heracles Almedo, Sparta Rotterdam</li><li>Liga Española (Spain): FC Barcelona, R. Madrid, Villarreal C.F., R. Betis, R.C.D. Espanyol, Sevilla F.C., Valencia C.F., R.C. Deportivo, Athletic Club, Malaga C.F., C. Athletico Madrid, R. Zaragoza, Getafe C. F., R. Sociedad, At. Osasuna, R. Racing C., R.C.D. Mallorca, Cadiz, Celta, Alaves</li><li>England League: Chelsea, Arsenal, Man Red, Merseyside Blue, Merseyside Red, Middlebrook, Teeside, Man Blue, North East London, West Midlands Village, South East London Reds, West Midlands City, West London White, Tyneside, Lancashire, Pompy, West Midlands Stripes, Wearside, Lancashire Athletic, East London</li><li>French League: Rhine, Pas de Calais, Azur, Bretagne, Bouches du Rhone, Somesterrine, Nord, Bourgogne, Ile de France, Franche-Comte, Alsace, Alpes Maritime, Garonne, Corse Sud, Aquitaine, Moselle, Loire Ocean, Meurthe-et-Moselle, Sarthe, Aube</li><li>German League: Isar, Ruhr, Weser, Hauptstadt, Neckar, Rhein, Westfalen, Hanseaten, Autostadt, Niedersachsen, Karneval, Pfalz, Alm, Franken, Fohlen, Domstadt, Stahlstadt, Rhein-Main</li></ul><p>There are two modes of play: Match Mode, where the player manages their team for a single match, and Season Mode, where the player's team competes in both the league and various championships.</p><p>A season lasts from July 1st in one year through to June 30th of the following year. At the end of a season the manager may be offered a contract renewal with their existing club and/or they may be offered positions with other clubs. The player starts the season by accepting a job offer. As the season progresses, their reputation may rise or fall. If it rises, the player may be given the chance to move to a higher ranked club; if it falls, they may be asked to leave and have to seek employment with a lower club.</p><p>After accepting an offer, the new manager appoints additional staff, an assistant manager, and three scouts. The announcement of the new manager is then made and the season begins. The player has a budget assigned as a lump sum at the start of the season. Any revenue from increased ticket sales or prize money goes to the club and not into the manager's budget; this and any leftover money determines how much cash the club has available for the next season.</p><p>During the season, the manager competes in the domestic league, the domestic cup and, depending on the club's position in the previous season's league, possibly the European Cup, European Super Cup and Konami Cup. </p><p>Players can be bought, sold, coached, and/or promoted from the youth team to the first team. The manager can request meetings with players, staff and the chairman. The manager also decides tactics for the squad and at an individual player level, selects the squad, and fine tunes the formation. Scouts give advice not just on new players but on the opposition. </p><p>All matches are played automatically based on the team as selected by the manager though of course there's a pause menu which has the option to change the team tactics, camera angle, etc. during the game. The game is played in 3D with commentary and occasional close-ups.</p><p>Match Mode can be player vs. computer, player vs. player (this requires two controllers), or computer vs. computer. This mode gives the player(s) access to fifty-seven national squads and one hundred and thirty-eight league clubs which includes all the league clubs listed above plus others. <br>This mode also gives the player(s) access to eighteen 'Environment' parameters that affect the match. These include the standard season, weather, and time of day settings as well as choosing the referee, the motivation of the teams, which team the supporters cheer for and the ratio of home and away supporters. Some effects such as the type of ball and the ball trace effect used in replays have to be unlocked by achieving targets in the main game.</p><p>The game also has an edit mode in which the player's appearance and names can be changed. There's a lot of detail that can be tweaked to get a realistic likeness of a player or manager; there are over forty different settings, most of them facial, which include thirteen different nose shapes and twelve cheek types. Teams can be created and changed too, with the player having the power to edit strips, team emblems, logos, names and more.</p>"},{"name":"Pro Pinball: Trilogy","year":2005,"developer":"Cunning Developments"},{"name":"Pro Race Driver","year":2002,"developer":"The Codemasters Software Company Limited","url":"sony_playstation2_p/Pro%20Race%20Driver%20%28USA%29.zip","filesize":2598247800,"score":7.8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Race Driver</em> adds a storyline and career structure to the Codemasters touring car racing lineage. You are Ryan McKane, son of a fatally crashed racer and younger brother of a very successful racer. Guide Ryan to the top of closed-wheel racing.</p><p>A wide roster of championships and cars are featured. You can race a Mercedes DTM silhouette car, a BTCC Peugeot, Australia's V8 Supercars, and more. Realistic circuits are included, although many have to be unlocked. The physics engine is realistic, and multiple camera angles are on offer.</p><p>The Director's Cut release has extra tracks and some of the championships are updated.</p>"},{"name":"Pro Rally","year":2002,"developer":"Ubi Studios SL","url":"PS2_COLLECTION_PART19/Pro%20Rally%202002%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":320112198,"score":6.4,"genres":"Racing / Driving > Sports > 3rd-person (Other) > Off-roading","desc":"<p>Pro Rally is a simulation of the sport of rally racing. It features real licensed cars from manufacturers such as Seat, Subaru, Audi, Mitsubishi, Toyota, and Peugeot. It features stages all over the world including places like Italy, Argentina, England, and Sweden.</p><p>There are several modes of play which become available:</p><ul><li><strong>Time Trial:</strong>  Practice to get the fastest times.</li><li><strong>School:</strong>  Earn a license by doing well in events which test performance in various conditions.</li><li><strong>Championship:</strong>  The heart of the game. Race for the fastest time in various events, and accumulate enough points to stay on top.</li><li><strong>Arcade:</strong>  Race against multiple computer-controlled racers simultaneously.</li><li><strong>Trophy:</strong>  Compete to continue on a tournament bracket.</li><li><strong>Versus:</strong>  Race against another player in split-screen.</li></ul>"},{"name":"Project Eden","year":2001,"developer":"Core Design Ltd.","url":"PS2_COLLECTION_PART19/Project%20Eden%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":977519629,"score":7.3,"genres":"Action > 1st-person > 3rd-person (Other) > Puzzle elements > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Earth's population has grown, and because of this, humongous skyscrapers have been erected. The rich and average live in these skyscrapers, while the poor, deranged, illegal and criminals live at the very bottom, in the scummy area. The only time people go down there is to do foundation maintenance. Recently, a team of engineers has gone missing at the \"Real Meat Factory\", and the Urban Protection Agency (UPA) team is sent in.</p><p><em>Project Eden</em> is a 3D shooter with an emphasis on puzzle-solving. The player takes control of four UPA agents: Carter Dorlan, Andre Herderman, Minoko Molensky, and Amber Torrelson. Each of the protagonists has his or her own special ability, which must be frequently used to solve puzzles and advance in the game. Carter can interview suspects and open locked doors; Andre uses a special Omnitool to repair broken equipment or machinery; Minoko can hack into computer terminals, accessing information and controlling cannons, robots, tanks, and other machines; Amber can shoot pulse laser bolts and missiles, and is unaffected by hazards such as flames, poison gas, electricity, cold temperatures, etc.</p><p>Problem-solving in the game often involves cooperation between characters. Shooting can be done from either first- or third-person perspective. The game also contains a multiplayer mode, allowing up to four players in a cooperative or deathmatch game.</p>"},{"name":"Project Minerva Professional","year":2003,"developer":"Flat-Out Inc.","url":"PS2_COLLECTION_PART19/Project%20Minerva%20Professional%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2844946804,"score":"","genres":"Action > Behind view > Tactical shooter > Direct control","desc":"<p><em>Project Minerva Professional</em> is a less complex tactical third person shooter.</p><p>Against her brother's will, Alicia joined a special Peacekeeping Unit of the UN created to preserve justice, the UNPAC, to find herself. In the 21st century, a rogue terrorist organization is threatening humanity and it is up to the player and their hand-picked team to take on the threat.</p><p>In a campaign to save humanity, the Minerva Corporation created a technology of assault robots, which were deployed throughout Earth. The robots revolted, however, and started their own military campaigns across the planet. Minerva denied all allegations. Countries without recourse to withstand these assaults turned to UNPAC, which is where you and your A3 unit come in.</p><p>As part of the Simple 2000 series, Project Minerva Professional is a third person shooter where the player takes on missions for the UNPAC, equipping multiple kinds of different weapons and armor for their team before dispatching on level-based missions to take out enemy forces. Missions vary from simple enemy elimination missions to hostage rescues and reconnaissance missions. The player will receive money and items to arm and customize their team for each mission.</p>"},{"name":"Project: Snowblind","year":2005,"developer":"Crystal Dynamics, Inc.","url":"PS2_COLLECTION_PART19/Project%20-%20Snowblind%20%28Europe%2C%20Australia%29.zip","filesize":1541091706,"score":7.1,"genres":"Action > 1st-person > Shooter > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Spy / espionage","desc":"<p><em>Project: Snowblind</em> is a first-person spy action game set in the year 2065. You play Lt. Nathan Frost, a cybernetically enhanced super-commando sent to Hong Kong to stop a terrorist plot to shut down all of the world's electronic systems. Player abilities include cyborg enhancements such as cloaking devices and ballistic shields, the ability to take control of robots and vehicles, and the typical FPS assortment of weapons.</p>"},{"name":"ProStroke Golf: World Tour 2007","year":2006,"developer":"Gusto Games Ltd.","url":"sony_playstation2_p/ProStroke%20Golf%20-%20World%20Tour%202007%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":959800929,"score":6.4,"genres":"Simulation > Sports > 1st-person > 3rd-person (Other) > Golf","desc":"<p><em>ProStroke Golf: World Tour 2007</em> is a golf simulation which unique feature is the innovative control scheme. In contrast to other golf simulations the tee is performed in first person mode. After choosing the club and the feet position the player needs to use both analog sticks. With the left one he simulates the swing and with the right one he relocates his body weight. It is not enough to relocate it simply in the right direction, the player needs to achieve a constant back and forth movement. </p><p>This only works when using a gamepad, alternatively there is also a more traditional three-click control scheme in 3rd person. There the player chooses the body weight movement before the strike. With the first click he strikes out, with the second one he determines the precision and with the last one the strength. This, however, is still different to other golf simulations because the kind of swing is not chosen beforehand but determined by the swing parameters.</p><p>Less innovative are the playing modes. The game features the usual training, single tournament and career mode. The career mode however are just many tournaments tacked together. The player character improves his rank with successes but this just influences the conditions of participation for other tournaments and not the gameplay itself.</p><p>The game features nine licensed golfers, 18 courses (two licensed) and three real-life golf-commentators. With the editor the player can build own courses and tournaments.</p>"},{"name":"Pryzm: Chapter One - The Dark Unicorn","year":2002,"developer":"Digital Illusions Canada, Inc.","url":"PS2_COLLECTION_PART19/Pryzm%20-%20Chapter%20One%20-%20The%20Dark%20Unicorn%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":3314567653,"score":5.9,"genres":"Action > 1st-person > 3rd-person (Other) > Fantasy","desc":"<p><em>Pryzm: Chapter One - The Dark Unicorn</em> is set in a peaceful land where all five races (gnomes, elves, trolls, nymphs and unicorns) have their own kingdom. Unfortunately an epidemic infests all kingdoms except the one inhabited by the unicorns. Of course this leads to accusations and the unicorn Pryzm is sent out to end the plague - she is accompanied by the troll magician Karrock who distrusts her. The player takes control over both of them at the same time: the left analogue stick controls the unicorn and the right one the troll.</p><p>The basic gameplay is simple: the player rides through the 16 levels and battles infected flora and fauna. After defeat they transform back to their real selves - if the whole level (including the periodic mini bosses) is rescued the player can proceed to the next one. The roles of the heroes are evenly divided: Pryzm is used for moving at different speeds, jumping and defensive spells, e.g. stun. Karrock on the other hand uses offensive spells and his magic wand to hit the enemies nearby. The game can be played in first or third person perspective.</p>"},{"name":"Psi-Ops: The Mindgate Conspiracy","year":2004,"developer":"Midway Games, Inc.","url":"PS2_COLLECTION_PART19/Psi-Ops%20-%20The%20Mindgate%20Conspiracy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3275185145,"score":7.8,"genres":"Action > Behind view > Shooter > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Spy / espionage > Regional differences","desc":"<p><em>Psi-Ops</em> is an action game with a twist: no longer do you have to rely solely on big weapons and explosions to progress through it - you also have the aid of psychic powers to take down army after army of enemy soldiers.</p><p>In the game you take the role of Nick Scryer, a secret agent who had his face reconstructed and mind wiped clean in order to infiltrate a growing psychic organization calling itself The Movement. Nick, however, is captured, but manages to free himself and continue his mission to stop The Movement, regaining his psychic abilities along the way.</p><p>The game mixes regular weapons with the weapons of the mind. You'll have access to a series of mind powers, such as Telekinesis (the ability to fling object and soldiers around), Pyrokinesis (the ability to set things on fire), Mind Drain (for draining Psi power out of foes' minds) and Remote Viewing (leaving your body behind and exploring the level).</p>"},{"name":"Psikyo Shooting Collection Vol. 2: Sengoku Ace & Sengoku Blade","year":2004,"developer":"X-Naut.Psikyo","url":"sony_playstation2_p/Psikyo%20Shooting%20Collection%20Vol.%202%20-%20Sengoku%20Ace%20%26%20Sengoku%20Blade%20%28Japan%29.zip","filesize":117343298,"score":"","genres":"Action > Compilation > Side view > Top-down > 2D scrolling > Anime / Manga > Arcade > Shooter > Fantasy > Sci-fi / futuristic","desc":"<p>Volume two of the <em>Psikyo Shooting Collection</em> contains the following arcade shoot 'em up games:* Sengoku Ace</p><ul><li>Sengoku Blade: Sengoku Ace Episode II</li></ul><p>Both games have been previously released on the Sega Saturn.</p>"},{"name":"Psikyo Shooting Collection Vol. 3: Sol Divide & Dragon Blaze","year":2005,"developer":"Psikyo","url":"sony_playstation2_p/Psikyo%20Shooting%20Collection%20Vol.%203%20-%20Sol%20Divide%20%26%20Dragon%20Blaze%20%28Japan%29.zip","filesize":197503571,"score":"","genres":"Action > Compilation > Side view > Top-down > 2D scrolling > Anime / Manga > Arcade > Shooter > Fantasy","desc":"<p>The third volume in the Psikyo Shooting Collection contains two shoot 'em ups that were previously unreleased on the PlayStation 2.</p><ul><li>Dragon Blaze</li><li>Sol Divide</li></ul>"},{"name":"Psychic Force Complete","year":2005,"developer":"Taito Corporation","url":"sony_playstation2_p/Psychic%20Force%20Complete%20%28Japan%29.zip","filesize":1046911081,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Cyberpunk / dark sci-fi > Martial arts","desc":"<p><em>Psychic Force Complete</em> is a compilation of 3 System 11 / System 12 arcade fighting games:</p><ul><li>Psychic Force</li><li>Psychic Force 2012</li><li>Psychic Force 2012-EX</li></ul><p>There are four different versions of this title, either just the base game, or bundled with figures of the characters Won, Wendy or Emirio.</p>"},{"name":"Psychonauts","year":2005,"developer":"Double Fine Productions, Inc.","url":"PS2_COLLECTION_PART19/Psychonauts%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":3115155589,"score":7.8,"genres":"Action > Behind view > Platform > Puzzle elements > Sci-fi / futuristic","desc":"<p>At a summer camp for up-and-coming psychics, a young boy with an unusually high level of psychic ability inexplicably shows up. The boy, named Raz, is allowed to stay at the camp until his father comes to pick him up, but his arrival coincides with very strange circumstances. Soon, evidence that someone is psychically tampering with the campers' minds reveals itself, and Raz is the only one who can stop it. Raz must project himself into the psyches of several different people in order to figure out what is going on and who is behind the recent occurrences.</p><p><em>Psychonauts</em> is a 3D platform game with a rather unorthodox style. The characters' inner worlds are the game's levels. Each world reflects the personality of the person whose psyche it represents, often resulting in unique, surreal creations, and influencing the gameplay style. For example, the psyche of a giant lungfish is presented as a large city populated by fish people, in which Raz himself becomes a giant monster who can destroy entire buildings; the psyche of a mental patient is a huge board game, where Raz has to command armies in order to defeat Napoleon, etc.</p><p>There are also many gameplay elements and tasks which are common for all the levels. These include Raz fighting the (not very numerous) regular enemies, defeating level bosses, collecting currency, \"figments of imagination\" needed to upgrade his powers, and bonus items such as complete sets of the character's memories and others. Many of the game's puzzles require the usage of psychic powers, which Raz obtains in a more or less strict order. These powers range from combat abilities such as Psy Shield to Telekinesis (moving objects without touching them) and Clairvoyance (reading other people's minds). </p><p>The camp itself serves as the game's \"hub\", in which the player can explore, interact with characters, search for secret areas and items, and so on.</p>"},{"name":"Psyvariar 2","year":2004,"developer":"Skonec Entertainment, Co., Ltd","url":"sony_playstation2_p/Psyvariar%202%20-%20Ultimate%20Final%20%28Japan%29.zip","filesize":144189748,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Direct control > Flight / aviation > Sci-fi / futuristic","desc":"<p>Psyvariar 2 is another specimen of the recent breed of \"newschool\" arcade shoot'em'ups (other examples being Ikaruga and Border Down). As many other recently released shoot'em'ups, it combines basic arcade shooter gameplay with modern 3D graphics to liven up the genre. The level backgrounds as well as all enemies are modeled in full 3D, with the action taking place in a vertically scrolling two-dimensional plane which moves through the level.</p><p>As most of the other new-style SHMUPs, Psyvariar 2 has a gimmick: getting close to enemies or shots without actually being hit is called \"buzzing\" and yields massive extra score. In addition, the player ship's rate of fire is rather slow by default and can be raised by shaking the ship left and right a few times and then keeping moving horizontally - as soon as the horizontal movement stops, the fire rate drops down to normal again. </p><p>As in most other of the new Japanese style of shoot'em'ups, there are usually an extremely high number of enemy shots on the screen. All these factors combine to make learning precise control a central part of the game.</p>"},{"name":"Psyvariar: Complete Edition","year":2002,"developer":"Skonec Entertainment, Co., Ltd","url":"PS2_COLLECTION_PART19/Psyvariar%20-%20Complete%20Edition%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%29.zip","filesize":568567412,"score":"","genres":"Action > Top-down > Arcade > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Two games in one pack (Psyvariar Medium Unit together with revision), Psyvariar is a vertical-scrolling sci-fi shooter.</p><p>In the game, the human race has been exiled out of the solar system, and now live a peaceful existence under the watchful eye of the GUIS AI. Unfortunately a recent super nova has caused the AI to go out of control, and threatens to use the same weapons and defensive capabilities that kept humanity alive in outer space to completely destroy them.</p><p>You star as a lone pilot who must fly his mecha deep into the core of GUIS and destroy it before its too late, shooting your way through several enemy-infested stages (6 in the original, 8 in the arranged version) with the next stage being decided by the rank you get in the previous one. The game doesn't feature much in the way of power-ups or upgradeable weapons, but instead features the unique \"Buzz\" system, which increases your rate of fire and power in relation to horizontal rolling and movement, encouraging the player to move all over the screen. Also, your mecha has a unique power-bar that can only be filled by \"buzzing\" enemy bullets, which involves getting close to said bullets so that they scrape the edges of your mecha and charge it up. When max power is reached you can become invulnerable for a short time, which you can use to continue buzzing and extend your invulnerability to survive the intricate attack patterns.</p><p>The game uses polygonal graphics and features both the original arcade Psyvariar Medium Unit and a Revision mode, which upgrades the graphics and adds a few stages.</p>"},{"name":"Psyvariar: Medium Unit","year":2003,"developer":"Skonec Entertainment, Co., Ltd"},{"name":"Psyvariar: Revision","year":2003,"developer":"Skonec Entertainment, Co., Ltd"},{"name":"Puchi Copter (Compact Flight Controller Set)","year":2003,"developer":"Aqua System Co., Ltd."},{"name":"Pump It Up: Exceed","year":2005,"developer":"Andamiro Co., Ltd.","url":"sony_playstation2_p/Pump%20It%20Up%20-%20Exceed%20%28USA%29.zip","filesize":4150108815,"score":7.4,"genres":"Simulation > Arcade > Music / rhythm","desc":"<p><em>Pump It Up: Exceed</em> is a dancing game similar to the games in the Dance Dance Revolution series. The <em>Pump It Up</em> dance mat is different from the norm as the arrows are set on diagonals and includes a button in the middle which allows for more complexity in the dance moves that are required to be performed in the game.</p><p>The general gameplay has the player watching a music video as symbols scroll by. The player must match the symbols on the screen with the symbols on the <em>Pump It Up</em> dance pad with their feet. Hitting the arrows in sync with the music will keep the players life bar up and give the player a good rating, while doing the opposite will drain the life bar and give bad ratings. If the life bar drains all the way, the game ends.</p><p>The game has several mode to choose from:</p><ul><li>Arcade Mode has the player trying to achieve an “A” or an “S” rating on three consecutive songs. Doing that allows the player to play an extra song. Successfully completing songs in the Arcade mode opens them for play in Home Mode.</li><li>Home Mode allows the player to choose any song they have available to them.</li><li>Sudden Death Mode forces the player to perform a song flawlessly or the game ends. </li><li>Survival Mode - This mode becomes available after the player completes twenty songs in the Home Mode. This is an endurance test for the player, as the game keeps giving the players songs to go through until their life bar is finally depleted.</li><li>Video Mode - This mode is unlocked after the player completes a total of twenty songs in either Home or Arcade Mode. It allows the player to just watch the videos for any song they've completed.</li><li>Tutorial mode - Teaches the player how the game works.</li></ul><p>The game also keeps track of the players statistics (the rating grades they received for each song). </p><p>The PS2 version of the game features 101 songs, while the Xbox version contains 97 songs, but offers the option to download more songs. As some songs are more difficult then others, the game provides a rating from one to twenty to inform the player on just how hard of a task they are taking on by choosing a particular song.Two dance mats will be required for some songs that offer a freestyle option if the player chooses that setting.</p>"},{"name":"Punisher, The","year":2005,"developer":"Volition, Inc.","url":"PS2_COLLECTION_PART19/Punisher%2C%20The%20%28Europe%29%20%28En%2CFr%29.zip","filesize":1574626548,"score":7.2,"genres":"Action > 1st-person > Behind view > Quick Time Events (QTEs) > Shooter > Direct control > Licensed","desc":"<p>The Punisher is a third person action game that pits the player against the darkest scum of the Marvel Comics' universe.  With over a dozen grimy New York locales, this superhero adaptation embraces the feel of the 30 year comic series.</p><p>Featuring loads of weapons, brutal environmental kills and an innovative new interrogation engine where the player controls every last aspect of over 70 torture scenarios, the Punisher  provides a rich gaming experience for fans of dark, intense action.</p><p>Story written by comics authors Garth Ennis and Jimmy Palmiotti.</p>"},{"name":"Puyo Pop Fever","year":2004,"developer":"Sonic Team","url":"PS2_COLLECTION_PART19/Puyo%20Pop%20Fever%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":389642661,"score":7.6,"genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Falling block puzzle > Direct control","desc":"<p>Accord, teacher of the local magic school, has lost her magic flying cane. There is word of an award so the students are busy searching high and low for it. Naturally, our heroes Amitie and her school nemesis Raffine make their way toward the distant dark castle, challenging - and being challenged by - everyone you come across in a game of Puyo Pop.</p><p><em>Puyo Pop Fever</em> is a puzzle game of the falling-block variety, the goal of which is to clear your blocks (Puyos) by combining four or more of the same color, which will then vanish. This will produce Nuisance Puyos. These colorless Puyos will fall onto your opponents screen, thus blocking chains and combos they could create. These pesky Puyos can only be exterminated by removing neighboring Puyos.</p><p>When an opponent sends Nuisance Puyos to your screen you can try to \"offset\" by clearing your own Puyos and limiting the number that would fall on your screen. This will also increase your Fever Meter. When this meter fills you will be given a set of prearranged Puyos with which you can wrack up giant combos and send tons of Nuisance Puyos to your opponent. When any player's field becomes so full that they can no longer drop Puyos they lose the game.</p><p>The game features a two-player mode. Some versions allow for more people such as the DS version which allows up to eight players to compete in free-for-all or team modes.</p>"},{"name":"Puyo Puyo Fever 2","year":2005,"developer":"Sonic Team","url":"sony_playstation2_p/Puyo%20Puyo%20Fever%202%20%28Japan%29.zip","filesize":344635588,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Falling block puzzle > Direct control","desc":"<p>A sequel to Puyo Puyo Fever, the next-gen re-imagining of the classic arcade puzzle game Puyo Puyo, in which you play against either an AI or player controlled opponent to see who can stack and arrange the falling blobs (or \"puyos\") in the correct color patterns that allow you to send \"garbage\" puyos to the opposing player and help flood him and lose.</p><p>The game includes a single-player arcade mode, as well as a story mode with 3 different characters and campaigns that take you across the game world battling different sets of enemies. The \"fever\" meter from the previous game returns (which increases the number and abilities of the garbage puyos you send depending on how many puyos you chain in succession) and a new ranking system has been implemented that awards you money you can use between stages to buy special items that modify the game rules in your favor.</p>"},{"name":"Puyo Puyo!: 15th Anniversary","year":2007,"developer":"Sonic Team"},{"name":"Puzzle Challenge: Crosswords and More!","year":2006,"developer":"Supersonic Software Ltd.","url":"sony_playstation2_p/Puzzle%20Challenge%20-%20Crosswords%20and%20More%21%20%28USA%29.zip","filesize":306502997,"score":"","genres":"Puzzle > Text-based / Spreadsheet > Top-down > Word construction","desc":"<p>Puzzle Challenge: Crosswords and More, over 1000 unique word and logic puzzle games arranged in an easy to use format, providing over 200 hours of game play. Full of puzzles and brainteasers to entertain and challenge all word puzzle lovers!</p><p>Features</p><p>* Easy Crosswords - standard crosswords with easy clues<br>* Challenging Crosswords - standard crosswords with challenging clues<br>* Codebreakers - each letter of the alphabet is assigned a number, figure out which number matches which letter to fill in the crossword puzzle<br>* Cryptic - standard crosswords with cryptic clues<br>* Diamonds - standard crosswords lay out in a diamond shape</p>"},{"name":"Puzzle Maniacs","year":2003,"developer":"HuneX Co., Ltd.","url":"PS2_COLLECTION_PART19/Puzzle%20Maniacs%20%28Europe%29.zip","filesize":287954237,"score":"","genres":"Puzzle","desc":"<p>YOU'RE A PUZZLE MANIAC TOO!</p><p>* Jigsaw: the classic that never fails: put the image back together again.<br>* Slide Puzzle: do you remember the 15 game? Imagine it with images! Imagine it ANIMATED!<br>* Illustrated puzzle: also known a, \"crucipixel\" or \"picross\". it's original and fiendishly difficult. With a never before seen colour version!!</p>"},{"name":"Puzzle Party: 10 Games","year":2006,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART19/Puzzle%20Party%20%28Europe%29.zip","filesize":203580638,"score":"","genres":"Puzzle > Diagonal-down > Arcade","desc":"<p><em>Puzzle Party: 10 Games</em> is a simple collection of 10 puzzle games:</p><ul><li>Tetroban requires the player to destroy a given number of lines to proceed to the next level, with more completed stages equalling a higher score.</li><li>Towerball requires the player to connect 4 balls of the same colour to get them to disappear, with a certain number of balls needing to disappear in order to proceed to the next level.</li><li>Combiner gives the player multiple coloured balls, and they have to combine balls of the same colour in order to get them to disappear. Once all balls are gone they proceed to the next level.</li><li>Gravitex requires the player to form a line with 4 stones of the same colour.</li><li>Terracut involves the player having to conquer as many of the opponent's balls as possible by placing their own balls next to the opponent's balls.</li><li>Hexines requires the player to form a certain number of lines made up with 5 stones of the same colour in order to proceed to the next stage.</li><li>Gems Tracker requires the player to collect as many gems as possible by stepping onto them with a tracker and rotating it.</li><li>Connector requires the player to connect several branches together in order to destroy everything within their borders. The player has to destroy a set number of branches that is displayed on the screen.</li><li>Cubefall requires the player to move cubes from one side of a waterfall to another in order to ensure that there is enough room for new cubes.</li><li>Balls Trapper requires players to remove gems from the borders of the land by placing the gem with the same colour nearby.</li></ul>"},{"name":"Puzzle Quest: Challenge of the Warlords","year":2007,"developer":"Engine Software B.V.","url":"PS2_COLLECTION_PART19/Puzzle%20Quest%20-%20Challenge%20of%20the%20Warlords%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":102455400,"score":8.1,"genres":"Puzzle > Role-playing (RPG) > Diagonal-down > Side view > 2D scrolling > Fixed / flip-screen > Turn-based > Tile matching puzzle > Point and select > Fantasy > Medieval","desc":"<p>As a citizen of the kingdom of Bartonia, it's your job to discover why the Undead have begun swarming all over the world of Etheria. In this RPG hybrid you'll be following the story of your character as they rid Etheria of the Undead scourge and save Bartonia, complete sidequests for extra money, experience, items and companions, craft your own weapons and armor, capture monsters for use as mounts or to learn their spells, and even lay siege to neighboring kingdoms in order to add them to your own empire. However, Puzzle Quest is an RPG with a twist. Everything is done (as the name implies) with puzzles.</p><p>Everything in Puzzle Quest is done with puzzles. The puzzles themselves are similar to Bejeweled in execution, with a few slight variations used for things like item crafting and enemy capture.</p><p>When fighting an enemy (which can range from zombies to orcs and even castle strongholds, each with their own special spells and abilities), you both take turns using the same board. The goal is to reduce your opponents hitpoints to zero, which can be done directly by linking up skulls in rows of three or more, or by using spells which require mana. To build up mana, just link three or more runes of the same color together, just like the skulls. Every time you gain mana, it's stored in your reserves until you use it (or are hit with a mana draining attack). Gold and experience are built up in the same way, using gold coins or purple experience orbs that occupy the same board and can be linked just like runes and skulls.</p><p>The real strategy behind the game comes into play when you factor in elemental mastery (gaining extra mana when linking runes for a specific element), equipment (which can prevent damage, drain mana and more), spells (which can poison, drain mana, stun and so on) and linking up groups of four or more. The reason groups of four are important is that every time a row of four-of-a-kind is created, you get an extra turn. While it doesn't sound important, getting four runes in a row could possibly give you enough mana to cast an extremely powerful spell and give you the extra turn to cast it before your enemy can even move.</p><p>There is also a direct action mode in which players can hone their skills against various opponents independent from the story mode, as well as wireless multi-card play where two players can square off using their own characters from the campaign mode.</p>"}]