[{"name":"Q-Ball Billiards Master","year":2000,"developer":"Ornith","url":"sony_playstation2_q/Q-Ball%20-%20Billiards%20Master%20%28USA%29.zip","filesize":226838578,"score":6.5,"genres":"Simulation > Sports > 1st-person > Pool / snooker","desc":"<p>Q-Ball is a hyperrealistic billiards simulation.  The focus is squarely upon accurate, realistic physics &amp; ball behavior - friction, speed, collisions, etc.  </p><p>Players can learn trick shots, practice, and even compete against the various computer players who are Pro-Ranked.  There's also a 2 player mode to play against a friend, over a total of 10 different games.</p>"},{"name":"Quake III: Revolution","year":2001,"developer":"id Software, Inc.","url":"PS2_COLLECTION_PART19/Quake%20III%20-%20Revolution%20%28Europe%29%20%28En%2CFr%2CIt%29.zip","filesize":687169819,"score":7.4,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>The PS2 version of PC game Quake III: Arena includes all the maps and skins from the original title and the add-on pack Quake III: Team Arena. Quake is known for its fast-paced gameplay, movement-based tactics and jumps, and a balanced range of weapons, both prediction-based and hit-scan.</p><p>An updated single player mode is available, as well as several multiplayer modes. Choose from Deatmatch, Team Deathmatch, Single Weapon Deathmatch, Single Weapon Team Deathmatch, 1 Flag Capture the Flag, Capture the Flag, Team Possession, and Possession. Up to 4 players can play together through split-screen.</p><p>In this console version players get to use a variety of weapons: the Plasma Gun, Shotgun, Rocket Launcher, Chain Gun, Rail Gun and Machine Gun. The game's levels include many different landscapes ranging from wide open areas to winding tunnels. There are lava pits, water ways and a space station.</p>"},{"name":"Que - Ancient Leaf no Yousei","year":2007,"developer":"PrincessSoft","url":"sony_playstation2_q/Que%20-%20Ancient%20Leaf%20no%20Yousei%20%28Japan%29.zip","filesize":1695581394,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>You are Makoto, a high-school sophomore. One day, you receive a package with a virtual reality gadget that lets you experience a social networking service called Que. It just so happens that service is for girls only. As such, you create your female avatar and enter the world of an Ancient Leaf. While hiding your identity when talking to girls in virtual reality, many of your friends in real world have no idea about you, but at the same time you have an opportunity to find out more about them, things they wouldn't usually share with a guy.</p><p>The game is a typical visual novel which consists of reading through the text, which has full voice-over support for NPCs, lets you check the message log, and remove the text to see the clear background image with character sprites. Occasionally, choices are made to branch the story, and you can even select to go to different locations on the city map, both during daytime and nighttime.</p>"},{"name":"Quest for Aladdin's Treasure, The","year":2007,"developer":"Broadsword Interactive Limited","url":"PS2_COLLECTION_PART19/Quest%20for%20Aladdin%27s%20Treasure%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":180835687,"score":"","genres":"Puzzle > 1st-person > Behind view > Top-down > Fantasy > Middle East","desc":"<p><em>The Quest for Aladdin's Treasure</em> is 3D puzzle game based on the tale from the book of <em>One Thousand and One Nights</em>.</p><p>After all his adventures Aladdin has retired and lives a quiet happy live with his princess. One day Ali Baba arrives and loots the kingdom. Deciding he must stop Ali Babas, Aladdin heads off to tell the princes of his plan to stop Ali Baba. While arriving in her chambers he discovers she has been kidnapped by an evil sorcerer from his past. Now he is off to take on both Ali Baba and sorcerer to save his princess.</p><p>The player takes control of Aladdin and has to solve puzzles while traveling on his magical flying carpet from one location to another. Puzzles include slide puzzles, moving planks of different lengths on pillars and pushing blocks in gaps in the floor to reach the exit, among others.</p>"},{"name":"Quest for Sleeping Beauty","year":2006,"developer":"Spiral House Ltd.","url":"PS2_COLLECTION_PART19/Quest%20for%20Sleeping%20Beauty%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":227439954,"score":"","genres":"Action > Diagonal-down > Arcade > Fantasy","desc":"<p><em>Quest for Sleeping Beauty</em> is a 3D Pac-Man variant played from a bird's-eye perspective. It is based on the fairytale <em>Sleeping Beauty</em>. Bored of her royal tasks Sleeping Beauty decides to enter a dangerous forest alone. Eventually she gts lost after wandering deep into the forest and takes shelter in an abandoned castle. She is now waiting for a prince to rescue her.</p><p>The player takes control of a young boy or girl and has to collect all the pellets on a map to advance. Spiders and other enemies are harassing the player and when caught by a spider, a live is lost. Across the map potions can be found to fend off the enemies. These come in several colors: Red ones will scare the enemies away, blue ones will freeze the enemies (run over it to kill it) and green ones will make you invisible.</p>"}]