[{"name":"U-Move Super Sports","year":2004,"developer":"Konami Computer Entertainment Studios, Inc.","url":"PS2_COLLECTION_PART27/U-Move%20Super%20Sports%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":95419236,"score":6.3,"genres":"Sports > 1st-person > Baseball > Football (European) / Soccer > Golf > Horse / derby > Rugby","desc":"<p>A Konami-developed game for the EyeToy USB Camera. <em>U-Move Super Sports</em> features dozens of mini-games, with sports such as Rugby and Soccer being the main basis for levels. </p><p>The game is loosely based on the original EyeToy game EyeToy: Play. Many of the games are very similar and it plays much the same. Most levels have a jungle setting with fitting music. Every level is different from the last, and tests different skills, such as how quick you can react to a signal or how accurate a batter you are.</p>"},{"name":"Uchuu Senkan Yamato: Ankoku Seidan Teikoku no Gyakushuu","year":2005,"developer":"BEC Co., Ltd.","url":"sony_playstation2_u/Uchuu%20Senkan%20Yamato%20-%20Ankoku%20Seidan%20Teikoku%20no%20Gyakushuu%20%28Japan%29.zip","filesize":3236160144,"score":"","genres":"Action > Strategy > 3rd-person (Other) > Anime / Manga > Real-time > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Uchū Senkan Yamato: Ankoku Seidan Teikoku no Gyakushū</em> is the second part of the \"Dark Nebula series\", after <i>Uchū Senkan Yamato: Iscandar e no Tsuioku</i>. It follows the events of the first part of the fourth <em>Yamato</em> movie, <em>Be Forever Yamato</em>. </p><p>After the battle of Iscandar, the Dark Nebula Empire strikes back and invades Earth. They aim to force the earthlings into submission with the threat of a planetary neutron bomb. The bomb's trigger is located on the Empire's home planet, and so the Yamato takes off once again to find a way to prevent the bomb from exploding. Meanwhile, Yuki Mori finds herself stranded on Earth, and joins the Resistance against the invader. The game's story is based on co-creator Leiji Matsumoto's original ideas, and is quite different from the movie, with some characters meeting very different fates. </p><p><em>Uchū Senkan Yamato: Ankoku Seidan Teikoku no Gyakushū</em> features real-time space battles that are very similar to its predecessor, but also new third-person phases, where the player takes direct control of a character and must navigate 3D levels to accomplish specific objectives. Like previous games of the series, the game features character-design by Keisuke Masunaga, based on the original characters created by Leiji Matsumoto. The story is told both with animated 2D movies and fully-voiced in-games cutscenes. The characters are rendered in cel-shading.</p>"},{"name":"Uchuu Senkan Yamato: Iscandar e no Tsuioku","year":2004,"developer":"BEC Co., Ltd.","url":"sony_playstation2_u/Uchuu%20Senkan%20Yamato%20-%20Iscandar%20e%20no%20Tsuioku%20%28Japan%29%20%28Genteiban%29.zip","filesize":2095762886,"score":"","genres":"Action > Strategy > Anime / Manga > Real-time > Sci-fi / futuristic > Licensed","desc":"<p>Continuing the story of the space battleship Yamato after <i>Saraba Uchū Senkan Yamato: Ai no Senshitachi</i>, <em>Uchū Senkan Yamato: Iscandar e no Tsuioku</em> adapts the third movie of the franchise, <em>The New Voyage</em>. When the holy planet Iscandar becomes the target of the evil Dark Nebula Empire, Earth and Gamilas have to put their enmity aside and work together to defend Iscandar. The Yamato takes off for a new galactic odyssey, that will be a baptism of fire for the rookie crew. </p><p>Developed by the same team as the two PlayStation games, <em>Uchū Senkan Yamato: Iscandar e no Tsuioku</em> offers a very different gameplay. The semi-turn-based tactical battles are no more, as the game is now a real-time strategy/action game, where the player controls the Yamato and allied ships during 3D space battles. While following the plot of the movie, the game also includes some new twists, characters and adventures on the way to Iscandar.</p><p>Like previous games of the series, the game features character-design by Keisuke Masunaga, based on the original characters created by Leiji Matsumoto. The story is told both with animated 2D movies and fully-voiced in-games cutscenes. The characters are rendered in cel-shading.</p>"},{"name":"Uchuu Senkan Yamato: Nijuu Ginga no Houkai","year":2005,"developer":"BEC Co., Ltd.","url":"sony_playstation2_u/Uchuu%20Senkan%20Yamato%20-%20Nijuu%20Ginga%20no%20Houkai%20%28Japan%29.zip","filesize":2505039059,"score":"","genres":"Action > Strategy > 3rd-person (Other) > Anime / Manga > Real-time > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Uchū Senkan Yamato: Nijū Ginga no Hōkai</em> is the third and final part of the \"Dark Nebula series\", after <em>Uchū Senkan Yamato: Iscandar e no Tsuioku</em> and <em>Uchū Senkan Yamato: Ankoku Seidan Teikoku no Gyakushū</em>. It follows the events of the second half of the fourth Yamato movie, <em>Be Forever Yamato</em>. The Yamato and the Yukikaze have finally reached the Dark Nebula, and discover it is actually two parallel galaxies, one of light, and one of darkness. Entering this new universe, the heroes of Earth are about to discover the secrets of the Empire, and engage in a deadly battle to ensure the future of the human race.</p><p><em>Uchū Senkan Yamato: Nijū Ginga no Hōkai</em> is a very similar to the previous two Playstation 2 games, and feature both the real-time space battles and third-person phases, where the player takes direct control of a character and must navigate 3D levels to accomplish specific objectives. Like previous games of the series, the game features character-design by Keisuke Masunaga, based on the original characters created by Leiji Matsumoto. The story is told both with animated 2D movies and fully-voiced in-games cutscenes. The characters are rendered in cel-shading.</p><p>The game's story is based on co-creator Leiji Matsumoto's original ideas and is quite different from the movie, offering two possible endings.</p>"},{"name":"UEFA Challenge","year":2001,"developer":"Infogrames Studios Limited","url":"PS2_COLLECTION_PART27/UEFA%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.zip","filesize":1969649601,"score":6.3,"genres":"Sports > 3rd-person (Other) > Top-down > Football (European) / Soccer > Licensed","desc":"<p><em>UEFA Challenge</em> is European football with an official UEFA license.</p><p>The game features the biggest football star players and their teams on 30 authentic stadiums including Old Trafford, Highbury, Anfield, and Nou Camp. Each player has their own playing style.</p><p>There are more than 125 national and club teams to choose from including Manchester United, Real Madrid, Arsenal, Juventus, and Chelsea.</p><p>A multi-season mode is also included.</p>"},{"name":"UEFA Champions League 2004-2005","year":2005,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART27/UEFA%20Champions%20League%202004-2005%20%28Europe%29.zip","filesize":1309157422,"score":7.3,"genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p>After many years under Eidos/Silicon Dreams ownership and development, EA releases the official Champions League game for the 2004/2005 season. </p><p>The last rehash of the engine debuted on <em>FIFA 2003</em>, it draws most of it's gameplay elements from the <em>2005</em> edition, but with some changes to gameplay such as a slightly more aggressive AI on attack (reducing the need to constantly push players forward using the <em>Off The Ball</em> controls, still present), new refereeing aspects such as some deliberate errors (as in occasional bad offside calls or throw-ins, not cheating the player through mistakes), advantage rule and handballs and a new set piece system, which replaces the much criticized \"targeting\" and \"push and shove\" featured in 2005. This system is much less rigid and less formulaic, as a directional arrow and powerbars define how balls are crossed and there are four player movement setups, thus making each corner and indirect free kicks different. For direct free kicks, players have the option to take driven or curved shots or drop a pass to a nearby player to explore a gap in the defense. All options are available at all times, instead of being determined by the distance to goal. Many of these changes were later adapted into the new <em>FIFA 06</em> engine, and it was also chosen as the match engine for subsequent Bright Future's <em>FIFA Manager</em>. </p><p>The presentation takes notes from real television broadcasts, with goals, fouls and attempts on goal being recapped not only in the full-time highlight reel but also during game stoppages and PiP popups. As the game is presented in a faux letterboxed format, next to the scoreline some statistics occasionally popup, allowing to keep track of them for some missions. A very requested feature, the ability to see the energy bars of the closest players to the ball of both teams, was finally included, as well as icons for the special abilities (speed, shooting, dribbling or tackling) of the best players.</p><p>The Champions League, where the player leads one team to the Final in the Atatürk Olympic Stadium in Istanbul, in the quest to succeed FC Porto as European Champions, is one of the available modes, but not the most important. That honour goes to the \"The Season\" mode, where the player starts by creating his managing avatar, and then proceeds to a a series of 50 missions, with the first being a close last-week match against a Champions League spot rival, proceeding with a buyout of the club and increased expectations, and (hopefully) closing with the Champions League final. This mode also allows players to unlock additional features such as balls, a stadium and special exhibition modes by fulfilling objectives set by the club president during the season, some of them crucial matches (which can result in a sacking if failed), others simply a matter of balancing the squad. Other modes include the usual friendlies, \"home and away\" (a two-legged friendly), scenarios (where the player can create situations such as a defending a 1-0 nil for 45 minutes while two man down) and practice.</p>"},{"name":"UEFA Champions League 2006-2007","year":2007,"developer":"HB Studios Multimedia Ltd.","url":"PS2_COLLECTION_PART27/UEFA%20Champions%20League%202006-2007%20%28Europe%29.zip","filesize":1605449447,"score":7.3,"genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p>A football (soccer) game from Electronic Arts leveraging a UEFA License. This game focuses on delivering the atmosphere of the 2006 - 2007 UEFA Champions League event it was released to coincide with. </p><p>Building on similar FIFA Licensed products, EA continues to tune their new Match AI and celebrate such football events with lavish presentation and attention to detail. </p><p>The most unique aspect of this title on Xbox 360 is the Ultimate Team mode which allows the player to manage a fantasy team using a deck of virtual cards analogous to other fantasy trading card games played with real cards.  The deck represents a team of players, managers and other staff which are used to manage and develop a fantasy team from humble beginnings to the best team in the in the game. Cards may also be put up for trade with other players to help you acquire rare cards and earn game credits. Players can take their Ultimate Teams online and use additional game play cards to strategic advantage during the match.</p>"},{"name":"UEFA Champions League Season 2001-2002","year":2002,"developer":"Silicon Dreams Studio Ltd.","url":"PS2_COLLECTION_PART27/UEFA%20Champions%20League%20-%20Season%202001-2002%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1655195358,"score":6.7,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p>The last game in the line of Silicon Dreams' Champions League licensed titles (and only released in European markets), Season 2001/2002 includes all 32 teams qualified for the competition plus all finalists since 1960. There is exclusive Champions League footage to be unlocked and the in-game commentary is done by Guy Mowbray, Barry Venison and Gabby Logan.</p><p>The game allows the player to participate in friendlies, Champions League matches, leagues and cup tournaments. You can also edit players and create teams with custom players. Tactics can be modified to suit the team's style and qualities. The gameplay remains close to the previous title, with free-flowing ball physics and the stress on accurate passing. The new changes mostly revolve around set pieces (it is now possible to aim to a player). </p><p>Graphically, it uses a new engine with features such as volumetric grass and real-time lighting.</p>"},{"name":"UEFA Euro 2004 Portugal","year":2004,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART27/UEFA%20Euro%202004%20-%20Portugal%20%28Europe%29%20%28En%2CIt%2CNl%29.zip","filesize":1080338311,"score":7.3,"genres":"Sports > Diagonal-down > Direct control > Football (European) / Soccer > Europe > Licensed","desc":"<p>As a tie-in with the European soccer championship, held in Portugal on June 2004, EA Canada created this spin-off of the FIFA Soccer series. With a full license, players can choose any from the 51 nations and duke it out in friendly matches, or follow the path to the championship's final through the qualifying stages, group stages and eventually the play-off. You can also create your own dream team with players from different nations.</p><p>Other highlights includes a new bag of tricks, different weather types, a system to track injuries and suspensions and a dynamic morale system that fluctuates based on individual and team performances. There are also TV-style replays, crowd chants, national anthems and trophy celebrations.</p>"},{"name":"UEFA Euro 2008","year":2008,"developer":"Electronic Arts Canada","url":"PS2_COLLECTION_PART27/UEFA%20Euro%202008%20-%20Austria-Switzerland%20%28Europe%29%20%28En%2CNl%2CSv%2CPl%2CRu%29.zip","filesize":1773903879,"score":7.6,"genres":"Sports > Diagonal-down > Direct control > Football (European) / Soccer > Europe > Licensed","desc":"<p><em>UEFA Euro 2008</em> is yet another football game from EA Sports. This time it's basically FIFA 08 modified to let the player experience this summer's European Championship. </p><p>Euro 2008 lets you control any European national football team in many different ways. For example you can decide to create your own character and play as good as possible on your position on the field in order to become good enough to captain your team. This is basically a slightly modified version of the \"be a pro\"-mode from FIFA 08.</p><p>You can also try different challenges and tournament modes in order to unlock extras or just test your abilities. You can play through the full championship experience, including the qualifying stages, or you can skip ahead to the group stages. You can also play a very extensive challenge mode where you try to make you nation the best in European football by clearing different challenges against all the other European teams. </p><p>As with FIFA 08 the PC and console versions are quite different. In fact, they are based on completely different game engines. While the Xbox 360 and Playstation 3-versions boasts state of the art graphics and a new and improved control system, the PC-version still basically looks and functions like the 2006-version.</p>"},{"name":"UFC Sudden Impact","year":2004,"developer":"Opus Corp.","url":"PS2_COLLECTION_PART27/UFC%20-%20Sudden%20Impact%20%28Europe%29.zip","filesize":1519950339,"score":5.7,"genres":"Simulation > 3rd-person (Other) > Fighting > Licensed","desc":"<p>UFC Sudden Impact features 40 real-life UFC fighters including champions Tim Sylvia and Matt Hughes or players can create their own fighter and climb up the ranks of the UFC.  There are new moves that can be used depending on the distance the fighters stand from each other and real-time injuries such as bruises and bloody wounds give it an added realism and challenge.  Game modes consist of 1P v. CP, head-to-head and career mode and gameplay mostly consist of combining buttons to chain moves such as striking as well as submission and pinning moves.</p>"},{"name":"UFC: Throwdown","year":2002,"developer":"Opus Corp.","url":"PS2_COLLECTION_PART27/UFC%20-%20Throwdown%20%28Europe%29.zip","filesize":461086285,"score":6.8,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>UFC: Throwdown</em> is based on the UFC (Ultimate Fighting Championship), mixed martial arts sports. The game places you in the position as a real-world fighter, utilizing various fighting styles, such as Freestyle, Wrestling, Kickboxing, Ju Jitsu, etc.</p><p>Each fighter has a variety of real-life moves, in different categories. There are punches, kicks, grapples and takedowns. There are also ways of making your opponent submit, or \"tapout\", to gain a victory.</p><p>You have the ability to perform combos, but these combos are realistic; you can perform a 1-2-3-4 punch combo, or a punch-punch-kick, or any variation of those. There are over twenty five fighters in the game, each one based off of real-life UFC fighters. The game includes fighter entrances and authentic voices.</p>"},{"name":"Ultimate Beach Soccer","year":2009,"developer":"Power and Magic Development"},{"name":"Ultimate Board Game Collection","year":2006,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART27/Ultimate%20Board%20Game%20Collection%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":302880633,"score":"","genres":"Puzzle > Strategy > 1st-person > Board game > Cards / tiles > Chess > Mental training > Tile matching puzzle","desc":"<p><em>Ultimate Board Game Collection</em> includes over 20 classic board and tabletop games. Each game contains a trophy that can be unlocked by completing a specific goal. Depending on the game, up to six players can compete by passing around a single controller.</p><p>The games include:</p><ul><li>3D Tic-Tac-Toe</li><li>Anagrams</li><li>Backgammon</li><li>Checkers</li><li>Chess</li><li>Chinese Checkers</li><li>Concentration</li><li>Dice</li><li>Dominoes</li><li>Enigma</li><li>Go</li><li>Jigsaws</li><li>Mahjong Solitaire</li><li>Mancala</li><li>Naval Battle</li><li>Parcheesi</li><li>Quatro</li><li>Reversi</li><li>Snakes and Ladders</li><li>Word Cubes</li></ul>"},{"name":"Ultimate Casino","year":2003,"developer":"Amedio Co., Ltd.","url":"PS2_COLLECTION_PART27/Ultimate%20Casino%20%28Europe%29.zip","filesize":319739508,"score":"","genres":"Gambling > Strategy > Cards / tiles","desc":"<p>Ultimate Casino is the best way to live out your dreams of making a fortune the easy way. You won't believe your eyes... you've been so lucky! But you still want more and you bet everything you've got, because even if you lose, it's still only a game! * 15 GAMES TO CHOOSE FROM * SELECT THE PROFILE OF THE PLAYER * SIMPLE AND EFFICIENT INTERFACE * DIFFERENT VIRTUAL CROUPIERS TO INTERACT WITH * EXPERIENCE THE REAL ATMOSPHERE OF THE CASINO DIRECTLY FROM YOUR HOME</p>"},{"name":"Ultimate Film Quiz, The","year":2005,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART27/Ultimate%20Film%20Quiz%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29%20%28v2.00%29.zip","filesize":18863022,"score":"","genres":"Strategy","desc":"<p><em>The Ultimate TV &amp; Film Quiz</em> is a quiz game for three or four players/teams.</p><p>The questions are, obviously, based on films and television and there are four game modes:* Super Star: In this mode the game is played over three rounds of eight questions. The winner is the player with the most points and players each have two 'jokers' to remove a wrong answer</p><ul><li>Play or Pass: This is also played over three eight question rounds. Players have three lives and lose a life with each incorrect answer, they also have one joker per round which they can use to pass a tough question on to an opponent. If a player answers their question correctly they can select which opponent is asked the next question.</li><li>Shoot Out: A quick on the button round where questions are not addressed in turn to each player</li><li>Quiz Trilogy: This consists of one round from each of the above quiz modes.</li></ul><p>All quiz modes have three eight question rounds and the right answer is not given when a question is answered incorrectly. All questions are asked in 'teleprompter' style, i.e. they are 'typed out' on screen to the accompaniment of a clacking sound, and they are all multiple choice with four possible answers to choose from. The game has no 'high score' table to record how many times a player wins nor does it have any movie/TV clips or soundbytes.</p><p>This game is a little unusual in that players share controllers, players one and two share controller one with player one using the Cross,Square, Triangle, Circle buttons while player two answers the questions using the D-Pad buttons. Players three and four share controller two in a similar way. The game can be configured to set individual player handicaps.</p>"},{"name":"Ultimate Mind Games","year":2002,"developer":"Yuki Enterprise","url":"PS2_COLLECTION_PART27/Ultimate%20Mind%20Games%20%28Europe%29.zip","filesize":67501492,"score":"","genres":"Strategy > Turn-based > Board game > Cards / tiles > Chess","desc":"<p><em>Ultimate Mind Games</em> is a collection of mini games that can either be played in story mode or individually.</p><p>In story mode the player takes the role of a child with special powers, because their parents can move between board game world, Brun, and another they too have this ability. On returning to the Brun one day the player is met by their friend Mana who informs them that the town is deserted because they have been invaded. The whole country has been invaded by the kingdom of Jejune and board games are banned!  </p><p>Mana takes the player to resistance HQ and explains that, because the player is so good they must tour round all the towns on the world map, play games in each location improve morale and weaken the invaders grip. More money can be earned by gambling or by taking part in the Sunday matches at the coliseum.  </p><p>Time in Brun is measured in weeks. Every Monday supporters of the resistance will pay in their money, on the same day the Jejune invaders will increase their hold in all regions by five percent. Money earned can be used to lobby citizens in a region to support the resistance, this is the game mechanic that allows players who are bad at one of the featured games, say Chess, to take control of that region without having to win at that game.</p><p>The games in the package are:* Kalah: an ancient African game, there's a good description of Kalah here</p><ul><li>Crystals: (aka Pyramid) a strategy game played on a 5x5 board with fifty-five crystals. The objective is to capture space and build upwards, the player who plays the most pieces wins.</li><li><p>Capture the Flag: is, according to the game's description, a Kogun variant of Shōgi, Shōgi as we all know is a Japanese board game closely related to Western chess and Chinese xiangqi.</p></li><li><p>Fan Tan: (aka Seven's, Parliament or Domino) is a card game in which the seven of each suit is laid on the table and the players take turns to play cards in sequence down to the ace and up to the king.</p></li><li>Seven Bridge: is a mahjong game played with cards</li><li><p>Chinese Checkers: is a game like these.</p></li><li><p>Chess: the champion of both strategy and board games, one of those games that need not be described here.</p></li><li>Draughts: (aka Checkers), if chess is the champion of strategy games then this is the prince, it's another board game that needs no introduction.</li><li>Domination: is another variant of Shōgi, that uses just the pawn and promoted pawn pieces. These move like rooks in chess and the objective is to capture pieces by surrounding them, the first player with three of fewer pieces loses.</li><li><p>Backgammon: considered by some to be a game with the perfect balance of skill and luck Backgammon, of which there are many implementations is another board game that needs no description.</p></li><li><p>Four-In-A-Row: is a game of Connect Four.</p></li><li><p>Page One: (aka American Page One or Pagat) is a card game in which each player starts with six cards and attempts to play them all onto a central stack. Cards can be disposed of if they match by number or suit.</p></li><li><p>Ponnuki Go: a simplified version of Go that focuses on the number of pieces captured.</p></li><li><p>Pairs: is a Concentration type of game played with Mah Jong tiles instead of cards</p></li><li>Leap Frog: is a dice game played on a Shōgi board. Dice, actually gold pieces, are thrown in order to determine how many squares a player can move. For each circuit the player makes their piece advances in rank. A piece that is passed by another player loses one rank. The first player to achieve the rank of Emperor wins.</li></ul><p>The menu carousel has a section which describes the rules for each game, another which describes the tactics to be employed, one each for the story mode and freeplay, and finally a section for game configuration options</p>"},{"name":"Ultimate Music Quiz, The","year":2005,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART27/Ultimate%20Music%20Quiz%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29%20%28v2.00%29.zip","filesize":17945436,"score":"","genres":"Puzzle > Game show / trivia / quiz","desc":"<p>\"How many No.1 UK singles have The Beatles had?\"</p><p>\"Which Robbie Williams album did Angels' appear on?\"</p><p>\"Who appeared first at the 2005 Live8 gig in Hyde Parke\"</p><p>* Thousands of questions spanning the decades and genres of popular music<br>* Multiple difficulty levels and handicaps to suit players of all levels of ability<br>* Single-player, multiplayer and team-based options to make this the perfect party game for up to 4 teams or individuals.<br>* Multiple modes of play including: hit or miss, battle of the bands and top of the charts</p>"},{"name":"Ultimate Spider-Man","year":2005,"developer":"Treyarch Corporation","url":"PS2_COLLECTION_PART27/Ultimate%20Spider-Man%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2086130461,"score":7.6,"genres":"Action > Behind view > Sci-fi / futuristic > Licensed","desc":"<p>When 15-year-old Peter Parker was bitten by a genetically altered spider he became faster, stronger, more agile and gained the spider-like ability to cling to walls.  Add web shooters and a costume and Peter becomes Spider-Man.  Eddie Brock, Jr. is Peter’s childhood friend.  In search of his scientist father’s legacy, Eddie came in contact with a symbiotic suit which transformed him into the monstrous Venom.  Ultimate Spider-Man follows both their Brian Michael Bendis-scripted adventures, as Spidey attempts to prevent Venom from killing innocents while Venom seeks to avoid S.H.I.E.L.D.’s machinations.</p><p>The Ultimate version of the Spider-Man mythos revamps the franchise, bringing in edgier (and often younger) versions of famous superheroes and supervillains.  The Human Torch, Wolverine, Electro, and Green Goblin are some of the Ultimate characters who make appearances.  Ultimate Spider-Man features a fully rendered, cel-shaded Manhattan open to exploration.  </p><p>With few exceptions, Spider-Man and Venom can explore Manhattan and Queens, climbing, jumping, and web swinging away.  Story missions show up as hot spots on the map as do other in-game objectives.  When the player is done patrolling (or destroying) the city, they can hit these hot spots to advance the story.  Between story missions, Spider-Man and Venom can follow race paths, go on combat tours, discover and collect hidden icons, and help (or hurt) the citizens of New York.</p>"},{"name":"Ultimate Spider-Man (Limited Edition)","year":2005,"developer":"","url":"sony_playstation2_u/Ultimate%20Spider-Man%20%28Europe%29%20%28Limited%20Edition%29.zip","filesize":2955355574,"score":"","genres":"Special edition > Digital extras > Physical extras","desc":"<p>This edition of Ultimate Spider-Man includes:</p><ul><li>An interview with Stan Lee, co-creator of Spider-Man.</li><li>G4 Special: \"Making of Ultimate Spider-Man\".</li><li>Biographies for Spider-Man, Venom, Beetle, and Carnage.</li><li>Developer tricks and tips.</li><li>Special Edition Ultimate Spider-Man comic book</li></ul>"},{"name":"Ultimate Sports Quiz, The","year":2005,"developer":"Mere Mortals Ltd.","url":"sony_playstation2_u/Ultimate%20Sports%20Quiz%2C%20The%20%28Europe%29%20%28v2.00%29.zip","filesize":19220209,"score":"","genres":"Puzzle > Game show / trivia / quiz","desc":"<p>\"In which year did Boris Becker win Wimbledon as an un-seeded 17 year old?\"</p><p>\"How old was Tiger Woods when he won his first US Masters?\"</p><p>\"How many times has Mohammed Ali won the World Heavyweight Boxing Championship?\"</p><p>* Thousands of questions covering all of the world's favourite sports<br>* Multiple modes of play including Top of the League, Play Or Pass, Shootout Multiple difficulty levels and handicaps to suit players of all levels of ability<br>* Single-player, multiplayer and team-based options to make this the perfect party game for up to 4 teams or individuals.<br>* Includes questions on Football, Tennis, Golf, Rugby, Cricket. Athletics, Formula 1, Snooker, Olympics plus many more.</p>"},{"name":"Ultimate Trivia Quiz, The","year":2006,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART27/Ultimate%20Trivia%20Quiz%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":19351143,"score":"","genres":"Puzzle > Game show / trivia / quiz","desc":"<p>\"Which US President was the Teddy Bear named after?\"</p><p>\"What line of work did Al Capone have on his business cards?\"</p><p>\"Which Disney character was introduced as the world's first talking cartoon character?\"</p><p>* Thousands of questions based on numerous subjects including: Sport, entertainment, current affairs, literature, history, and popular culture.<br>* Multiple modes of play including Top of the Class, Play or Pass, Quick Fire, and Multigame.<br>* Multiple difficulty levels and handicaps to suit players of all levels of ability.<br>* Single-player, multiplayer and team- based options to make this the perfect party game for up to 4 teams or individuals.</p>"},{"name":"Ultimate World Cup Quiz, The","year":2006,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART27/Ultimate%20World%20Cup%20Quiz%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":18399610,"score":"","genres":"Sports > Board game > Football (European) / Soccer","desc":"<p><em>The Ultimate World Cup Quiz</em> is a football trivia game for up to four players. It's identical to The Great British Football Quiz except it only includes questions about the FIFA World Cup. It spans all the way back to the original 1930 World Cup in Uruguay. It contains four different game modes:* Top of the League</p><ul><li>Play or Pass</li><li>Shootout</li><li>Football Crazy</li></ul><p>For each question the player gets four alternatives to choose from. Top of the League consists of three rounds of eight questions and the player with most points at the end of round three wins. With use of jokers the player can remove two wrong alternatives. Play or Pass also consists of three rounds of eight questions and players play together. Jokers are not available in this mode. In Shootout jokers are used to force the other player to answer. Football Crazy is played over three rounds consisting of one round of each of the other game modes. All modes can be played by up to four players but only the Top of the League mode can be played by one player.</p>"},{"name":"Under the Skin","year":2004,"developer":"Capcom Co., Ltd.","url":"PS2_COLLECTION_PART27/Under%20the%20Skin%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3220012242,"score":5.6,"genres":"Action > 3rd-person (Other) > Sci-fi / futuristic","desc":"<p>An alien called Cosmi got stuck on earth after his spaceship crashed on a satellite. The only way he can return home is by gaining enough money to repair his spaceship. Unfortunately for the humans, the only way Cosmi can obtain money is by causing panic amongst them. </p><p>The player takes the role of Cosmi and can use several different weapons and gadgets to scare away the humans. You can launch a giant bowling ball, a cannon or a karaoke set to terrify the people with your awful singing. To obtain new weapons you have to scan the DNA of humans walking the streets, each having their own set of abilities. When you scare humans enough, they drop coins. Getting enough coins completes a level and ultimately, the game.</p><p>Under the Skin brings you to different locations, including Raccoon City, the place where the Resident Evil games take place. In that level you battle the ultimate foe Nemesis, who this time is entirely cel-shaded, just like the rest of the game.</p>"},{"name":"Underworld: The Eternal War","year":2004,"developer":"Lucky Chicken Games, Inc.","url":"PS2_COLLECTION_PART27/Underworld%20-%20The%20Eternal%20War%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":909484172,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Shooter > Direct control > Fantasy > Horror > Licensed","desc":"<p><em>Underworld: The Eternal War</em> is based on the 2003 movie <em>Underworld</em>. The storyline revolves around the eternal war between the vampires and werewolves, and as the player, you can choose the side you're teaming with. You can either choose the movie's heroine Selene, or can be the \"bad guy\" Raze, who is a werewolf.</p><p>It's an all out slugfest as you take on to the battlefields where you must accomplish missions, were they about protecting someone, kill someone, get an item from somewhere, or just kill everyone. The action is the name of the game here and there are lots of it. Using different weapons, you smack the opposition to kingdom come. Many, many times. After that, it's more smacking. And then some.</p>"},{"name":"Unison: Rebels of Rhythm & Dance","year":2000,"developer":"Tecmo, Ltd.","url":"sony_playstation2_u/Unison%20-%20Rebels%20of%20Rhythm%20%26%20Dance%20%28USA%29.zip","filesize":754445341,"score":6.9,"genres":"Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p>In the city of Twin Ships, Ducker has banished dancing from the land!  It is up to the Unison team to bring dance back to the people of the city.  Players must memorize and perform routines by using the twin analog sticks.  The game features several licensed songs by artists such as Nelly and Aqua.</p>"},{"name":"Unlimited Saga","year":2002,"developer":"Square Co., Ltd.","url":"PS2_COLLECTION_PART27/Unlimited%20Saga%20%28Europe%29.zip","filesize":2422429718,"score":5,"genres":"Role-playing (RPG) > 3rd-person (Other) > Turn-based","desc":"<p>\"Unlimited SaGa\" is a sequel to Square's famous series of non-linear RPGs. Like in the early  Romancing Saga games, and in  Saga Frontier, you assume the role of eight main characters (selectable at the beginning of the game). The story centers around Laura, a 30-year old widow and an ex-pirate, but you view the story and make it progress differently depending on which character you have chosen, and on the decisions you take throughout the game. Each character is represented by a different kind of flower.</p><p>\"Unlimited SaGa\" feels and plays a lot like a classic board RPG. Everything - from disarming traps to hitting the enemy successfully in a battle - depends on the so-called REEL system. You have to stop a spinning slot machine at the right time, in order to perform an action successfully. It is similar to the classic dice system in pen-and-paper RPGs, and to the Judgment Ring system in  Shadow Hearts. You can explore the world in a non-linear fashion, visit many optional areas and fight monsters at your will. Some puzzles have multiple solutions and can be solved by using a character's special skill. For example, a character with a Swim skill can cross a river and reach the next area of the game.</p>"},{"name":"Unlimited Saga (Limited Edition)","year":2002,"developer":"","url":"sony_playstation2_u/Unlimited%20Saga%20%28Japan%29%20%28Limited%20Edition%29.zip","filesize":2112633053,"score":"","genres":"Special edition > Physical extras","desc":"<p>The limited edition of <em>Unlimited Saga</em> contains the following items:* The game Unlimited Saga</p><ul><li>Music CD</li><li>Artbook</li></ul>"},{"name":"Unreal Tournament","year":2000,"developer":"Digital Extremes, Inc.","url":"PS2_COLLECTION_PART27/Unreal%20Tournament%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":400014568,"score":8,"genres":"Action > 1st-person > Shooter > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p><em>Unreal Tournament</em> is completely different from Unreal: it is now mainly based on multiplayer, like Quake 3.</p><p>At the beginning, you have to play classic deathmatch rounds. After you have successfully won some of them, a new game mode becomes available, domination. In domination there are about three or four different areas scattered around the map to be controlled by your team. For a certain amount of seconds you control one area, a point is added to your score. The more areas you control, the faster your team's score rises. When you or the other team reaches a certain score, the game is over. The third mode is called capture the flag, every team has a flag to defend and tries to capture the other team's flag to score a point. </p><p>The fourth game mode is called assault. This mode requires completion of real missions, such as attacking an enemy base and destroying a specific object in it. Again, there are two teams, the defenders and the attackers. You have to complete the mission in a certain time, for example five or ten minutes. If you were successful, your team has to defend this time and the other team attacks. But the attacking team now only has as much time as you needed to attack.</p><p>All these modes are either playable in single or multiplayer mode. If playing alone, you have a large menu with orders you can give your bots. Also, all weapons were redesigned, and some new ones are added.</p>"},{"name":"Urban Chaos: Riot Response","year":2006,"developer":"Rocksteady Studios Ltd","url":"PS2_COLLECTION_PART27/Urban%20Chaos%20-%20Riot%20Response%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3808640443,"score":7.4,"genres":"Action > 1st-person > Shooter","desc":"<p>In <em>Urban Chaos: Riot Response</em>, you play as Nick Mason, a member of a new anti-terrorist team named T-Zero. Terrorists and gang members have destroyed your city, and your goal is to bring order back to the city while destroying any terrorists and gang members you encounter. Since your enemies are armed to the teeth (usually with meat cleavers, Molotov cocktails, and sawed-off shotguns), you're equipped with a riot shield that can be used by holding the left trigger. It can absorb an infinite amount of projectiles, but you cannot shoot while you are using it. You can get the assistance of firefighters to put out fires, and medics to replenish your health.</p><p>Your weapons can be upgraded by earning medals during your missions. You can earn these medals by scoring headshots, arresting enemies with your taser (as opposed to killing them), collecting gang masks, etc. You can even unlock extra missions and weapons by arresting gang leaders at the end of each level, so that the police can interrogate him and find out the gang's next move.</p>"},{"name":"Urban Constructor","year":2008,"developer":"Uxus Games","url":"PS2_COLLECTION_PART27/Urban%20Constructor%20%28Europe%29.zip","filesize":447171948,"score":"","genres":"Action > Puzzle > Top-down > Arcade","desc":"<p>A QIX variant with 3D graphics where you play a tractor that tries to build a city by drawing rectangles and other figures while opposed by tornadoes, cloud storms and other enemies. Different random bonuses could appear as well, and each out of 50 levels is done after 45% of the land is all built up.</p>"},{"name":"Urban Extreme","year":2006,"developer":"Data Design Interactive Ltd","url":"PS2_COLLECTION_PART27/Urban%20Extreme%20%28Europe%29.zip","filesize":41441314,"score":"","genres":"Racing / Driving > Behind view > Direct control > Automobile > Street racing","desc":"<p>Put your key in the ignition and start your engines, it's time for \"Urban Extreme' racing!</p><p>Choose from a selection of 8 crazy vehicles!</p><p>Drive at break neck speeds through the many \"Urban Extreme locations available!</p><p>Ram your opponents into parked cars and watch them explode in a ball of flames!</p><p>Hook up with your friends in the Multiplayer race mode.</p>"},{"name":"Urban Reign","year":2005,"developer":"Namco Limited","url":"PS2_COLLECTION_PART27/Urban%20Reign%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1669534753,"score":5.8,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler","desc":"<p><em>Urban Reign</em> is a Namco-produced 3D brawler, done in the tradition of Double Dragon and Final Fight. The story follows Brad Hawk, a hired thug, as he tries to find a gang member that was captured by a rival group. In each level, you set off against a handful of bruisers from one of Green Harbor's many gangs in search of clues. Make use of different allies, which can be given instructions, with skills in various fighting techniques to accomplish your goals, as you fight your way through 100 levels. There are different combos and special moves, different objects can be picked up and used as a weapon, and incoming attacks can be avoided by dodging.</p>"},{"name":"Urbz, The: Sims in the City","year":2004,"developer":"Maxis Software Inc.","url":"PS2_COLLECTION_PART27/Urbz%2C%20The%20-%20Sims%20in%20the%20City%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%2CFi%2CPl%29.zip","filesize":1008231367,"score":7,"genres":"Simulation > 3rd-person (Other) > Real-time > Life / social simulation > Point and select > Contemporary","desc":"<p>The Urbz is a reworking of the Sims franchise for the console market.</p><p>The Sims have finally moved out of the suburbs and into the big city where reputation is the key to success.</p><p>Socialize with over sixty unique characters, work jobs in a Sims game for the first time, buy new clothes that are actually gameplay relevant (they affect whether how likely other characters are to like you), get tattoos and body piercings and own and decorate one of three unique apartments.</p>"},{"name":"US Racer","year":2002,"developer":"Davilex Games B.V.","url":"sony_playstation2_u/US%20Racer%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.zip","filesize":598043893,"score":6.6,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator","desc":"<p>A clandestine group has been organizing illegal street races in the USA for more than 50 years. What started as a fun event has grown into an annual contest for cash and glory. Only six are given a chance to prove their worth.</p><p><em>USA Racer</em> contains 11 tracks in different locations across the USA. Players can race in cities such as Los Angeles, New York or Washington DC or can take part in a race through the Grand Canyon or Yellowstone. Next to Time Trial and Single Race, the Tournament is the main event. It has been split up in three sections: Park Trial, City Trial and US Race. After completing a section, the next one is opened up.</p><p>The tracks contain obstacles and jumps. Enemies will try to push other cars off the road, and the police also make an appearance. Scattered around the tracks are power-ups that repair the car, provide boost or cash. The money can be used to upgrade the car, repair it or buy boost prior to the race. After completing an entire tournament with a certain car, an alternate vehicle becomes available for that character.</p><p>In the Windows version two-player duels are available over LAN or TCP/IP. Players can either go head-to-head or play a game of Cop vs. Racer.</p>"},{"name":"Utau: Tumbling Dice","year":2004,"developer":"EMU","url":"sony_playstation2_u/Utau%20-%20Tumbling%20Dice%20-%20Watashitachi%203nin%2C%20A%20Ge%20Ru%20%28Japan%29.zip","filesize":796534087,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Dating simulation > Visual novel > Romance","desc":"<p>This console port of Utau: Tumbling Dice game for PC (Windows) has features 2 new characters and expanded story that include new characters.</p>"},{"name":"Utawarerumono","year":2006,"developer":"Leaf","url":"sony_playstation2_u/Utawareru%20Mono%20-%20Chiri%20Yuku%20Mono%20e%20no%20Komori-uta%20%28Japan%29%20%28Shokai%20Genteiban%29.zip","filesize":1689680756,"score":"","genres":"Adventure > Role-playing (RPG) > 3rd-person (Other) > Diagonal-down > Free-roaming camera > Anime / Manga > Tactical RPG > Visual novel > Fantasy > Adult","desc":"<p>In <em>Utawarerumono</em>, the player takes the role of Hakuoro, a mysterious masked man who awakens one day in a strange village without having any recollections of his past. Soon he discovers that the country inhabitants are being oppressed by their emperor. Hakuoro organizes a rebellion, and eventually becomes the emperor himself. Determined to bring peace to the world, Hakuoro must nevertheless fight against countries who oppose his benevolent rule, and discover the truth about his own past in the process.</p><p><em>Utawarerumono</em> is a turn-based tactical RPG with elements of a visual novel. Much of the narrative develops through text and still images, with the player being able to make a choice from time to time. Battles occur as dictated by the narrative. The player navigates the characters on the battle field, attacking enemies when they are in range. Experience points are gained after the victory, and are distributed to raise the parameters of the characters.</p><p>The original PC version has explicit sexual scenes, which have been removed for the PS2 release.</p>"}]