[{"name":"V-Rally 3","year":2002,"developer":"Eden Studios","url":"PS2_COLLECTION_PART27/V-Rally%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1670606828,"score":7.3,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p>The rally racing series is back, with more drivers, cars and tracks than in the preceding games.</p><p>Players can choose from a variety of game modes including rally racing in V-Rally Mode, time runs in Time Attack mode or time limited challenge runs in Challenge Mode, the last two also being available for up two four players taking turns in multiplayer mode. But the main goal is to defeat every racer on the rally circuit and become champion. The better players are and the further they get the more cars and tracks can be unlocked. In all, there are 80 drivers (six being actual rally drivers), 48 tracks (across six countries), and 20 cars for players to beat and unlock. There are two titles to earn - the 1.6 liter 2WD championship, and the 2 liter 4WD championship.</p><p>Players can view the race from inside the car or behind it as they scream through snow, rain, fog, dirt, gravel and over jumps at different times of day and night as they try to become the best rally racer on the planet.</p>"},{"name":"V.I.P.","year":2002,"developer":"Shanghai UBIsoft Computer Software Co., Ltd.","url":"PS2_COLLECTION_PART27/V.I.P.%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":530461390,"score":"","genres":"Action > Quick Time Events (QTEs) > Rail shooter > Licensed","desc":"<p>LOCK AND LOAD...</p><p>Here's your shot to team up with bombshell bodyguard Vallery Irons (Pamela Anderson) and the crime-bustin' specialists at V.I.P.! Hollywood's premier plastic surgeon has been snatched by a murderous mobster, and Val needs some cover.</p><p>-READY FOR SOME ACTION?</p><p>* Hot Heroines: Play as V.I.P. femme fatales Vallery Irons, Tasha Dexter, Nikki Franco and Kay Simmons - and the men of V.I.P., Quick Williams and Johnny Loh.<br>* Play What You Watch: Feel the heat of your very own interactive V.I.P. episode, loaded with action and exciting crime-bustin' missions.<br>* Gunplay & Martial Arts Madness: Keep your cross hair steady and your fists flying as you rumble through a barrage of finger-flying missions.<br>* Get Behind The Camera: Score enough cash and unlock the HOT SHOT video mode - then stage your own photo and video shoots with the women of V.I.P.<br>* Bonus Footage: Unlock over 45 photos and 24 mini-movies of the entire V.I.P. team.</p>"},{"name":"Valkyrie Profile 2: Silmeria","year":2006,"developer":"tri-Ace Inc.","url":"PS2_COLLECTION_PART27/Valkyrie%20Profile%202%20-%20Silmeria%20%28Europe%2C%20Australia%29.zip","filesize":3808085010,"score":7.9,"genres":"Role-playing (RPG) > 3rd-person (Other) > Side view > Anime / Manga > Fantasy","desc":"<p><em>Valkyrie Profile 2: Silmeria</em> is a prequel of the original PlayStation video game Valkyrie Profile and addresses some of unanswered questions in the previous game's storyline. </p><p>Several hundred years before the story of the Valkyrie Lenneth, the young and rebellious Valkyrie Silmeria angers the god Odin and becomes imprisoned in the body of Alicia, the princess of Dipan. However, Silmeria manages to retain her consciousness and shares the body with Alicia, leading her father, King Barbarossa, to believe that she is possessed. As a result, he fakes her death and banishes her to a faraway land. When Odin learns of Silmeria's actions, he sends the third valkyrie, Hrist, to find Alicia and to bring Silmeria back to Asgard. In the meantime, Alicia and Silmeria seek the legendary Dragon Orb, an artifact that would allow them to be free from Odin forever. </p><p>Although the game retains the side-scrolling aspect of the first <em>Valkyrie Profile</em> while traversing through dungeons or other locations, the second installment is rendered in three-dimensions throughout. The game takes advantage of this during the battle sequences as you must move and position your characters correctly to perform attacks. As in the previous game, Alicia/Silmeria will meet and recruit Einherjar, characters that will assist you in your quest.</p>"},{"name":"Vampire Night","year":2001,"developer":"Wow Entertainment, Inc.","url":"PS2_COLLECTION_PART27/Vampire%20Night%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":726126728,"score":7.2,"genres":"Action > 1st-person > Shooter > Horror","desc":"<p>The legend has existed for centuries. Very few have survived to tell their account of terror. But we know, the Vampire is real. Grab a friend and the GunCon2 and experience the bone-chilling shoot'em up action. Namco puts you in the role of the vampire hunter. Improved over the arcade version, Vampire Night for the PlayStation 2 computer entertainment system also includes a special training mode, an adventure mode, and other hidden features for players to unlock.  Can be purchased with or without the GunCon 2.</p>"},{"name":"Vampire Panic","year":2004,"developer":"AlfaSystem Co., Ltd.","url":"sony_playstation2_v/Vampire%20Panic%20%28Japan%29.zip","filesize":63281170,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Horror","desc":"<p>The year is 1806, and the small town of Insel in the kingdom of Berkgard is being terrorized by vampires. The ISLA -- the International Spiritually Liberators Association -- is an organization dedicated to eradicating the threat of vampires wherever they may be found. With Insel paralyzed by these nefarious creatures, the ISLA has sent three of their most capable agents in to protect the people and kill the vampires.</p><p><em>Vampire Panic</em> is a third-person action game with minor adventure and stealth elements. Controlling one of the three ISLA agents, the player must eliminate the vampire infestation in Insel and escort as many residents as possible to safety outside the town. Vampires can attack by biting either the player or friendly villagers, causing them to start turning; if the transformation completes before the affliction can be healed, villagers will turn into enemies and can no longer be saved, while the player turning results in an immediate game over. The game's story will change depending on which and how many villagers the player is able to rescue.</p><p>The player can control three different ISLA agents, switching freely between them at designated safe locations. Rusty is a young swordsman who is relatively inexperienced with vampire combat, but is highly skilled with a blade; his special technique is a guard that protects from enemy attacks. Mary is a girl whose mother was bitten by a vampire just before she was born, and was raised by the ISLA to fight against vampires; she uses her fists to fight, and her special technique is a transformation that increases her speed and power, but stops stamina regeneration. Last, Abbey is a highly-experienced ISLA agent who uses a revolver; his special technique reloads his weapon, but leaves him open to attack.</p>"},{"name":"Vampire: Darkstalkers Collection","year":2005,"developer":"Capcom Co., Ltd.","url":"sony_playstation2_v/Vampire%20-%20Darkstalkers%20Collection%20%28Japan%29.zip","filesize":766094757,"score":"","genres":"Action > Compilation > Anime / Manga > Fighting","desc":"<p><em>Vampire: Darkstalkers Collection</em> is a compilation of all five arcade releases in Capcom's <em>Darkstalkers</em> series:</p><ul><li>Vampire: The Night Warriors</li><li>Vampire Hunter: Darkstalkers' Revenge</li><li>Vampire Savior: The Lord of Vampire</li><li>Vampire Hunter 2</li><li>Vampire Savior 2</li></ul><p>Each game includes a number of updates over the arcade originals, such as training modes and move lists, as well as unlockable characters and bonus features. Also included is an unlockable art gallery.</p>"},{"name":"Van Helsing","year":2004,"developer":"Saffire, Inc","url":"sony_playstation2_v/Van%20Helsing%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1763965041,"score":6.6,"genres":"Action > 3rd-person (Other) > Platform > Shooter > Fantasy > Steampunk > Horror > Licensed","desc":"<p>Take the role of Van Helsing, legendary monster hunter and fight through Transylvania towards Count Dracula. This is an action/adventure game where the player encounters monsters such as the Wolfman, the Frankenstein monster, Dr. Jekyl/Mr. Hyde, vampires, and many other terrifying creatures. Use an arsenal of weapons and skills to destroy these monsters, including the unique grapple gun. This game takes the player to many of the places seen in the movie <em>Van Helsing</em> and features voice talent from many of the original actors including Hugh Jackman.</p>"},{"name":"Vegas Casino II","year":2008,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART27/Vegas%20Casino%20II%20%28Europe%29.zip","filesize":115592688,"score":"","genres":"Gambling > Fixed / flip-screen > Arcade","desc":"<p><em>Vegas Casino II</em> is a collection of 8 classic gambling games. Play in a Las Vegas Casino for the title of professional player in games like Blackjack, Baccarat, Roulette, Keno, Poker, Twenty One, Slot Machine and Craps.</p>"},{"name":"VeggieTales: LarryBoy and the Bad Apple","year":2006,"developer":"Papaya Studio Corporation"},{"name":"Venus & Braves: Majo to Megami to Horobi no Yogen","year":2003,"developer":"Namco Limited","url":"sony_playstation2_v/Venus%20%26%20Braves%20-%20Majo%20to%20Megami%20to%20Horobi%20no%20Yogen%20%28Japan%29.zip","filesize":2845436646,"score":"","genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga > Fantasy","desc":"<p>You play as a soldier named Blood Boal. In the year 999 you are revived and are granted immortality by the goddess Ariah. She explains to you that a prophecy foretold the Apocalypse, a total destruction of human civilization in 1099. You must build an army of fourteen best soldiers and try to prevent the Apocalypse.</p><p>The game advances through the hundred years between your rebirth and the prophesied Apocalypse. The strategic turn-based battles take place on a grid four squares wide and three rows deep. Seven of your fourteen warriors can actively participate in battle. You put the soldiers on the field in three rows: the first one attacks, the second one either supports the attackers or attacks with bows, the third one heals. Your HP is replenished after each battle, but soldiers carry over fatigue and excessive damage until their stats are lowered and you must bring them back to the town to rest. Since the soldiers you recruit age and eventually become unable to participate in battles (the immortal hero always remains the same), you must arrange the fights in such a way that a male and a female soldier will fall in love. If you have successfully developed a love story between two soldiers, they will bring children to the world, which will typically become stronger than their parents.</p>"},{"name":"Vexx","year":2003,"developer":"Acclaim Studios Austin","url":"sony_playstation2_v/Vexx%20%28USA%29.zip","filesize":1739803752,"score":7,"genres":"Action > Behind view > Platform > Fantasy","desc":"<p>On the forsaken remains of the planet Astara, the villagers of Rockhaven lived difficult but peaceful lives, until the day the Shadowraith, Dark Yabu, and his minions swept down from the sky. With ferocity and ruthless efficiency, they descended upon the townfolk, enslaving them to work deep in the caves that surrounded their village. </p><p>Dark Yabu murdered the grandfather of the young Vexx, who managed to slip quietly aboard the enemy's windship. There, locked deep within Yabu's sanctum, was the last pair of Astani Battle-gauntlets. The gauntlets leapt onto Vexx's outstretched hands and bonded to his arms giving him special powers. Prepared to meet his destiny, Vexx embarks on a quest through volcanic islands, frozen citadels and giant castles to confront Dark Yabu, save his people and avenge the death of his grandfather.</p>"},{"name":"Vib-Ripple","year":2004,"developer":"NanaOn-Sha Co., Ltd.","url":"sony_playstation2_v/Vib-Ripple%20%28Japan%29.zip","filesize":88603454,"score":"","genres":"Action > 3rd-person (Other) > Top-down > Music / rhythm","desc":"<p>Vib Ripple is the sequel to Vib Ribbon, and the third in the Vib Ribbon series. While Vib Ribbon was based around the tone of music, and Mojib Ribbon was based around lyrics, Vib Ripple is themed around drums and percussion.</p><p>Players once again control the vector rabbit Vibri as they play. This time, they must move her around a gigantic picture (think of the picture as a giant trampoline), and use the any of the face buttons to make her jump. If you time the jumps to the beat of the music, Vibri will jump higher, and jumping on certain parts of the picture will reveal 'Peta Characters' - 2D representations of objects, such as bunny rabbits, onions, and presents. The goal of each level is to reveal the Peta Characters shown in the crown at the bottom left of the screen (of course, you can uncover more if you're game).</p><p>In later levels, blobby enemies known as 'Boonchies' turn up and begin to slowly zero in on Vibri. She must dodge these enemies in addition to bouncing in time to the beat as she uncovers Peta Characters.</p><p>Vib Ripple, like Vib Ribbon and Mojib Ribbon, allows players to extend their potential playtime. You can create new levels by hooking up certain USB cameras and mobile phones, and uploading photos to your PS2. However, as with the previous games, the preset levels seem to work the best.</p>"},{"name":"Victorious Boxers 2: Fighting Spirit","year":2004,"developer":"Grandprix Inc.","url":"PS2_COLLECTION_PART27/Victorious%20Boxers%202%20-%20Fighting%20Spirit%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":3020150278,"score":6.6,"genres":"Action > Sports > 1st-person > 3rd-person (Other) > Anime / Manga > Boxing > Licensed","desc":"<p><em>Victorious Boxers 2: Fighting Spirit</em> is a boxing game based on the manga Hajime no Ippo. It holds 81 playable characters from the manga, such as Ippo himself, Ippo's coach both young and old, the bear Takamura fights, as well as any other character that was in the manga up until Takamura's match with David Eagle. You also get to face most of these characters in the Story Mode, which features almost every match from the manga up until, again, Takamura's match with David Eagle.</p><p>The controls allows jabs, straights, hooks and uppercuts to be thrown at the enemy, and swaying and dodging is done by holding down one button while steering the character. The characters with special attacks are equipped with these and the specials are thrown by holding down a button and pressing a corresponding punch button, but watch your stamina or you'll be too slow to hit your opponent.</p>"},{"name":"Victorious Boxers: Ippo's Road to Glory","year":2000,"developer":"NEW Corporation","url":"PS2_COLLECTION_PART27/Victorious%20Boxers%20-%20Ippo%27s%20Road%20to%20Glory%20%28Europe%29.zip","filesize":1266029991,"score":6.5,"genres":"Sports > Anime / Manga > Fighting > Boxing > Licensed","desc":"<p><em>Victorious Boxers: Ippo's Road to Glory</em> closely follows the manga <em>Hajime No Ippo</em>. It is a straightforward boxing game, with buttons for jabs, hooks and uppercuts. You can also bob and weave with the analog sticks. During the career mode you play many different boxers, in the hopes of eventually winning the championship belt or to sometimes achieve a different story goal. It was followed by Victorious Boxers 2: Fighting Spirit.</p>"},{"name":"Victory Wings: Zero Pilot Series","year":2004,"developer":"Opera House Inc.","url":"sony_playstation2_v/Victory%20Wings%20-%20Zero%20Pilot%20Series%20%28Japan%29.zip","filesize":388037733,"score":"","genres":"Simulation > 1st-person > Shooter > Flight / aviation","desc":"<p><em>Victory Wings</em> is an arcade-style flight-sim game set in the European Theater of World War II, offering a wide variety of planes to fly from both sides of the conflict. The main draw is the Campaign Mode, which features ten missions starting with an air raid on London that must be repelled, leading all the way up to the fall of Berlin. Each mission has different objectives and requirements, and may involve mid-air dogfights against enemy planes, torpedo attacks on naval targets, or bombing runs on strategic targets.</p><p>There is also a Free Combat mode there the player can practice the campaign missions, duel 1-on-1 against the computer or another player, go on bombing runs or various other types of missions. There is also of course a training mode available to explain how to complete each type of mission.</p>"},{"name":"Video Poker & Blackjack","year":2005,"developer":"Black Ops Entertainment, LLC","url":"PS2_COLLECTION_PART27/Video%20Poker%20%26%20Blackjack%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":140801791,"score":"","genres":"Gambling > Top-down > Cards / tiles","desc":"<p>Video Poker is the most popular game in casinos. It combines the excitement of Slot Machines with the skill of playing Poker. This is the most realistic simulation of the casino games of Video Poker & Blackjack available.</p><p>* Learn real play-strategies that are the scourge of casinos worldwide<br>* Identify the best machines to play after you master all the most popular games: Jacks or Better, Deuces Wild, Joker's Wild, Kings or Better, Double and Triple Bonus Games<br>* Powerful and advanced gambling machine programming, as used in casinos around the world, make this simulator as real as it can get<br>* Discover if you are a real High-Roller by playing the Video Blackjack simulator</p>"},{"name":"Vietcong: Purple Haze","year":2004,"developer":"Illusion Softworks, a.s.","url":"PS2_COLLECTION_PART27/Vietcong%20-%20Purple%20Haze%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":1199890670,"score":6.3,"genres":"Action > Compilation > 1st-person > Shooter > Direct control > Asia > Cold War > Historical events > War","desc":"<p><em>Vietcong: Purple Haze</em> is a compilation pack that bundles the original Vietcong game alongside its expansion pack Vietcong: Fist Alpha. For the PlayStation 2 and Xbox version this is the first and only release of the game; the individual game and its expansion were not available separately.</p>"},{"name":"Viewtiful Joe","year":2004,"developer":"Capcom Production Studio 4","url":"PS2_COLLECTION_PART27/Viewtiful%20Joe%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1938010815,"score":8.4,"genres":"Action > Side view > Beat 'em up / brawler > Platform","desc":"<p>Joe is your normal everyday guy, watching movies and hanging out with his girlfriend, Silvia. But when Silvia is sucked into a movie reel by an evil force, Joe's life is turned upside down. It's up to you to take everyman Joe and turn him into a superhero to end all superhero's and save his girl.</p><p>With a heavy dose of comic book visuals, <em>Viewtiful Joe</em> is an action-heavy 2D side-scroller inside a 3D world, that will have you using the amazing abilities of the hero in question as you slice and dice the many enemies on screen with VFX special moves, such as Slow and Mach Speed. You'll have the chance to earn 'Viewtifuls', which will boost your abilities with new killer moves and special items. You'll need them as you progress further into the seven episodes and big bosses at the end of each.</p>"},{"name":"Viewtiful Joe 2","year":2004,"developer":"Clover Studio Co., Ltd.","url":"PS2_COLLECTION_PART27/Viewtiful%20Joe%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1131285959,"score":8,"genres":"Action > Side view > Beat 'em up / brawler > Platform","desc":"<p>Joe's back, and his girlfriend has come along for the ride, in the sequel to the surprise hit Viewtiful Joe. Once again the side-scrolling action is frantic as you battle through the themed based levels and taking out the enemy with a combat techniques like no other.</p><p>Silvia is ready to play and join the mission, bringing her pompoms and projectile weapons along with her. Joe also has a few new tricks up his sleeve along with some added VFX abilities, including the Replay, where you can record a certain move and play it over three times for a killer blow or a bonus health boost. Another new features is V-Touch, allowing you to switch between the two characters during play, also an important feature to solve some of the puzzles along the way.</p>"},{"name":"Virtua Cop: Elite Edition","year":2002,"developer":"SEGA-AM2 Co., LTD.","url":"PS2_COLLECTION_PART27/Virtua%20Cop%20-%20Elite%20Edition%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":201402558,"score":"","genres":"Action > 1st-person > Rail shooter","desc":"<p><em>Virtua Cop: Elite Edition</em> is a combination of Virtua Cop 1 &amp; 2.</p><p>You play a cop who has been called out to deal with a certain situation, armed with your trusty sidearm. Enemies pop out from behind most objects and a reticule lights up around them to let you know they are armed and dangerous. You have to have quick reflexes as innocent people pop up which need to be protected.</p><p>There are 6 levels in all, 3 from each game and these levels have multiple stages. With the three difficulty levels on offer, along with the modifications you can make in the options setup such as the number of continues and auto reload and taking off the enemy indicator, you can make the game as difficult or as easy as you wish. There are multiple paths on some levels so there is some incentive to replay the levels.</p><p>There is a 2 player co-operative mode which can still be played with two light guns or you can use the Dual Shock pad. Training is also available. Even though this an old Sega Saturn game, it hasn't been improved much for the PS2 so expect a smoother gameplay of the older graphics.</p>"},{"name":"Virtua Fighter 4","year":2002,"developer":"SEGA-AM2 Co., LTD.","url":"PS2_COLLECTION_PART27/Virtua%20Fighter%204%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":539285936,"score":8.2,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > Martial arts","desc":"<p><em>Virtua Fighter 4</em> offers a selection of thirteen characters to engage in one-on-one beat 'em up action similar to previous titles in the series. Most of them are from previous games, but two of them are brand new to this game.</p><p><em>VF4</em> has the standard array of modes, like Arcade, VS, and Practice, and it also has a new feature, called \"A.I. Sparring\", in which you train a player, controlled by the computer, by using various moves and techniques.</p><p>There are a lot of arenas to choose from. Some are interactive, in which you can break away from the main ring. When fighting on sand or snow, your fighter will leave footprints. When you're in water, you will make splashes. If you hit your opponent hard enough on a concrete floor, his body might break that part of the floor into chunks.</p><p>Each fighter has a wide array of moves, from your standard punches and kicks to ten hit combos and specials.</p>"},{"name":"Virtua Fighter 4: Evolution","year":2003,"developer":"SEGA-AM2 Co., LTD.","url":"PS2_COLLECTION_PART27/Virtua%20Fighter%204%20-%20Evolution%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1618442103,"score":8.7,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > Martial arts","desc":"<p>A conversion of the update to Virtua Fighter 4, Evo features two brand new characters (Goh Hinogami and Brad Burns) and Quest Mode, an all new addition to the series that replaces Kumite mode.</p><p>In Quest Mode, you choose your particular fighter and take him or her around the various arcades in Japan where you must earn your chance to enter tournaments. Each battle may also vary in conditions (for example, one match will have you simply fighting to be the winner, while another may ask you to win by only using punches, etc.).</p><p>Certain battles will also involve prizes, including clothing and money. Money can be spent on more clothing, wallpapers, character models and much more.</p>"},{"name":"Virtua Pro Football","year":2006,"developer":"Sega Sports Japan","url":"PS2_COLLECTION_PART27/Virtua%20Pro%20Football%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2210161093,"score":5.7,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p><em>Virtua Pro Football</em> is Sega's attempt to compete with the FIFA and Pro Evolution Soccer series. It's more similar to those than the more arcade based games in the Virtua Striker series. Controls work as can be expected and include short and long passes, crosses, shots and different defence options. The game features a special one on one mode where offensive players can challenge and dribble past a defender. The camera then zooms in to a behind the shoulder perspective of the dribbler and the player can do different stick and button combinations to get past the defender. Some of the movement options that are possible are lunge, feint and nutmeg.</p><p>The game features over 250 teams in twelve leagues (including three licensed ones; Dutch Eredivisie and Gouden Gids Divisie and Spanish LFP Primera Division). Competitions that the player can compete in are domestic leagues, club cups, international cup and custom leagues and cups. More unique is the player mode where the player gets to create and develop his own footballer. For each week the player can choose between practice, rest and going out. Practice is done through different mini games and by playing these the different skills will increase but so does the risk for injuries. Therefore rest is also needed at times. Going out means interacting with different people at various places and is needed to become more known to the supporters and the public. It's also possible to buy stuff, both football items and luxury items. Part of the player mode is also various events such as comments from the coach, meetings with the press and contract negotiations. The game also features a play book mode where the player can create his own tactics for set pieces. </p><p>Teams created in Sega's other football game, Let's Make A Soccer Team! can be imported into Virtua Pro Football.</p>"},{"name":"Virtua Quest","year":2004,"developer":"SEGA-AM2 Co., LTD.","url":"sony_playstation2_v/Virtua%20Quest%20%28USA%29.zip","filesize":1260238941,"score":5.9,"genres":"Action > 3rd-person (Other) > Fighting > RPG elements > Sci-fi / futuristic","desc":"<p><em>Virtua Quest</em> is a 3D action game with roleplaying elements and spin-off from the Virtua Fighter series.</p><p>The player takes control of a boy named Sei, who has been convinced by his friend Hayami to start treasure hunting in the virtual world known as the Nexus. He and others can enter this digital world that resembles the real world via a network. Not all parts of the Nexus are evenly well maintained. The sloppier forgotten areas are used by treasure hunters to search for lost data \"Data Chips\".</p><p>Gameplay includes climbing, jumping, swinging yourself around with some kind of energy whip and defeating enemies in a beat 'em-up manner. You can level up and buy various upgrades from the Data Chips you found. Special fighting techniques can be obtained by defeating \"Virtua Souls\" who will then teach you these moves.</p>"},{"name":"Virtua Tennis 2","year":2002,"developer":"Sega AM3 R&D Division","url":"PS2_COLLECTION_PART27/Virtua%20Tennis%202%20-%20Sega%20Professional%20Tennis%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":238447664,"score":8.3,"genres":"Sports > Behind view > Diagonal-down > Direct control > Tennis","desc":"<p>Sequel to the original game which was released two years prior.</p><p>The game's graphics have been improved, and there is a greater roster of players to choose from. The most noteworthy addition is that of female players, such as Venus and Serena Williams, and Monica Seles. You cannot however play as a male against a female.</p><p>The gameplay is a lot faster than the original. The players you control move a lot faster, as do the AI computer players. Less diving, but more getting at shots that go behind you and over-the-shoulder shots.</p><p>The game modes from the original are the same, featuring tournament mode, where you play against the pros; exhibition mode for a one-on-one, best-out-of-three game; and world tour mode which now features the option of creating and customizing your own player. Build your character up, buy equipment, and hire pros to play in doubles matches with you.</p>"},{"name":"Visual Mix: Ayumi Hamasaki Dome Tour 2001","year":2001,"developer":""},{"name":"Vitamin X: We are Super Supriment Boys","year":2007,"developer":"HuneX Co., Ltd.","url":"sony_playstation2_v/Vitamin%20X%20-%20We%20are%20Super%20Supriment%20Boys%20%28Japan%29.zip","filesize":2614017556,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Yuri Minami is a young teacher working at Seitei Gakuen, a campus containing all levels of school until university. Yuri is still new to the middle school when she receives a surprising promotion to the high school. However, the reasons behind her move become clear when she finds that she is assigned as homeroom teacher to the infamous Class X. A particular group of students known as the B6 (Baka 6) give the class its bad reputation: Tsubasa Makase, the spoiled son of an English model and a Japanese businessman, is fluent in English but struggles with Japanese; Hajime Kusanagi, a former soccer player known for his volatile temper and bad memory; Goro Fuumonji, a short boy who dresses as a girl and values art, at the expense of hating math; Shun Nanase, the bass player of a rock band who would rather spend his time working and making money than going to school; Mizuki Madarame, a quiet and remarkably lazy student who spends most of his time sleeping; and Kiyoharu Sendou, an excellent basketball player who finds joy in tormenting his superiors with pranks. The majority of the B6 have been held back, or are facing expulsion. It is now up to Yuri to turn around their academic performance and lead them to graduation.</p><p><em>Vitamin X</em> is an otome visual novel in which the player, as Yuri, must choose a student and improve their academics while pursuing a relationship. Each character has two endings, which are determined based on how many Love or Study points the player has accumulated over the course of the school year. Throughout each route, the boys have lines that are inaccurate or completely false. When the player spots such a line, they have two options: letting it slide earns the player Love points, while correcting the mistake earns Study points. A certain number of both Love points and Study points must be collected in order to achieve the \"Perfect\" end, in which the student typically graduates high school to go on to the college of their dreams and begins a relationship with Yuri.</p>"},{"name":"Vitamin Z: Welcome our New Supplement Boys","year":2009,"developer":"HuneX Co., Ltd.","url":"sony_playstation2_v/Vitamin%20Z%20-%20Welcome%20Our%20New%20Supplement%20Boys%20%28Japan%29.zip","filesize":3762842428,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Vitamin Z</em> is the sequel to Vitamin X, taking place after the events of the previous game. Former protagonist Yuri Minami leaves the school to study abroad, and her position of teaching the infamous Class X (now known as Class Z) is taken by new teacher Manami Kitamori. Manami, having just graduated college, is eager for the job until she learns of the A4 (Aho 4): the four most troublesome students of Class Z who refuse to take school seriously. The A4 is made up of the wealthy Tenjuro Narumiya, who loves to surf and is intent on finding his future wife, but despises studying; Chisato Fuwa, the best friend of Tenjuro who is focused on protecting him due to a bond between their families, but has trouble arriving to school on time for extra lessons; Yakumo Tachibana, a short boy who lives a double life as an idol in a boy band, and refuses to put in the effort required for good grades; and the perverted Arata Mine, a gifted tennis player who would rather put his time into building a harem of girls than studying. As in the predecessor, Manami must choose a student to tutor and then collect a combination of Love points (by letting their mistakes pass) and Study points (by correcting their mistakes) in order to obtain the best of a possible three endings. The B6 (Baka 6) make a return as teachers, with one assigned to each student in order to aid Manami in handling them. </p><p>Alternatively, Manami can choose one of the P2 (2 Princes) of the student council to help her deal with the A4. Kei Hōjō and Nachi Hōjō are twin brothers who are devoted to their jobs and each other. Like the A4, they also have three endings each.</p>"},{"name":"Volleyball Challenge","year":2003,"developer":"","url":"PS2_COLLECTION_PART27/Volleyball%20Challenge%20%28Europe%29.zip","filesize":403538223,"score":"","genres":"Sports > Direct control > Volleyball","desc":"<p>TAKE YOUR TEAM TO SUCCESS IN THIS CHALLENGING 3D ARCADE STYLE VOLLEYBALL GAME. FOUR DIFFERENT GAME MODES: LEAGUE, SURVIVAL, EXHIBITION AND A COMPREHENSIVE TRAINING MODE, WHERE YOU CAN LEARN ALL THE SECRETS OF SERVING, SPIKING AND RECEIVING. USE DEFAULT SETTINGS TO PERFORM YOUR FAVOURITE MOVE BY THE PRESS OF A BUTTON, OR CHOOSE YOUR ACTION BY SETTING FREE MOVEMENT ALL-AROUND. AND IF YOU REALLY WANT TO SURPRISE YOUR OPPONENTS, GO FOR THE SPECIAL SHOTS! * True arcade-style gameplay! * Choose between 16 teams + 4 hidden teams! * Fully customizable strategies! * Unlock extra features by progressing in the game! * Challenge a friend in the VS model</p>"},{"name":"Volleyball Xciting","year":2003,"developer":"Success Corp.","url":"PS2_COLLECTION_PART27/Volleyball%20Xciting%20%28Europe%29.zip","filesize":59637928,"score":"","genres":"Sports > 3rd-person (Other) > Side view > Anime / Manga > Volleyball","desc":"<p>Volleyball Xciting is a very arcade-like and light volleyball experience for those not looking for that ultra realistic feeling many sports games try to achieve.</p><p>It features an all girl cast of cell-shaded manga girls, starting out with 8 teams but more are added as you unlock them along with more courts to play at as you progress through the game.</p><p>The game contains several modes of playing, such as World Exhibition and Beach Volleyball, and you can play as many as 4 people at the same time with the aid of a multi-tap.</p><p>You never have to move the players around the court yourself as they do it themselves, and you just have to time the shots with the corresponding button to make them whack the ball across the net.</p>"}]