[{"name":"Wacky Races: Mad Motors","year":2007,"developer":"Beyond Reality Games Ltd.","url":"PS2_COLLECTION_PART27/Wacky%20Races%20-%20Mad%20Motors%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29%20%28v2.00%29.zip","filesize":50732445,"score":"","genres":"Racing / Driving > Behind view > Direct control > Licensed","desc":"<p>THE WACKY RACES ARE ON!<br>Ever wanted to take the wheel of the Arkansas Chugabug? Or pilot the Crimson Haybailer? Or control the crazy Convert-A-Car? Well, now you can - in the amazing Wacky Races videogame! All the Wacky Racers are here, ready and raring to go - even sneaky Dick Dastardly and his snickering sidekick Muttley! Choose your favourite and embark on a thrilling race adventure around the world. It's the ultimate - and wackiest - test of man and machine!</p><p>* Play as your favourite Wacky Racer - they're all here! * Race for victory on 12 crazy courses set around the globe! * Go head-to-head against a mate to find who's wackiest!</p>"},{"name":"Wacky Races: Starring Dastardly & Muttley","year":2001,"developer":"Infogrames Studios Limited","url":"sony_playstation2_w/Wacky%20Races%20Starring%20Dastardly%20%26%20Muttley%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":504084432,"score":7.4,"genres":"Racing / Driving > Behind view > Licensed","desc":"<p>The wackiest, wildest cartoon racing game ever is here. Based on the original Hanna-Barbera cartoon, Wacky Races lets you join your favorite characters on a wild race where only your wits, your driving skills and your bag of dirty tricks will get you across the finish line first!<br>- 11 wacky characters to play including Penelope Pitstop, Dick Dastardly & Muttley, and the Slag Brothers<br>- Each vehicle has its own special gadgets and unique abilities<br>- Race across 22 tracks filled with jumps, shortcuts, tunnels, and traps<br>- Foil your adversaries with foul tactics and diabolical schemes<br>- Select from multiple racing modes - Track Challenge, Wacky Cup, Dastardly Time Trials, Vs., Golden Muttley Challenge, and more!</p>"},{"name":"Wacky Zoo GP","year":2007,"developer":"","url":"PS2_COLLECTION_PART27/Wacky%20Zoo%20GP%20%28Europe%29.zip","filesize":71571507,"score":"","genres":"Racing / Driving > Behind view > Direct control > Automobile > Track racing","desc":"<p>Skid, jump and bump to first place with the help of the boosts, bombs, rockets & more! Blast your way around Wacky Town, bash your way around the Jungle tracks, and generally throw all you can grab at those who dare race ahead of you!</p><p>Practice with the weapons in the Quick Races, get your name up in lights in the Time Trail records, and take on (or blow up!) the best to win the coveted trophies in the Tournaments to become top of the Wacky Zoo GP!</p>"},{"name":"Wakeboarding Unleashed featuring Shaun Murray","year":2003,"developer":"Shaba Games LLC","url":"PS2_COLLECTION_PART27/Wakeboarding%20Unleashed%20featuring%20Shaun%20Murray%20%28Europe%29.zip","filesize":4372101092,"score":7.9,"genres":"Sports > Behind view > Tricks / stunts > Wakeboarding > Licensed","desc":"<p>Wakeboarding is part of Activision's line of Extreme Sports titles. A rider (using a board that's like a combination of a surf board, body board and skateboard) is pulled along the water by rope at high speeds by the boat up front, and must pull of tricks either by jumping of jumps or using the wake left by the boat itself (hence the sport's name).</p><p><em>Unleashed</em> takes this sport and turns it upside down, allowing you to fly down water ways through well known locations around the world, pulling stunts off buildings or cliff faces. Other objectives are included that have you completing tasks and busting tricks in a unique way.</p><p>Multiplayer modes include one-on-one trick attack and horse, where both players compete against each other to pull off the best tricks. Co-operative mode has one player driving the boat while the other hangs on behind, with new challenges for the boat driver to complete as well as the rider.</p>"},{"name":"Wallace & Gromit in Project Zoo","year":2003,"developer":"Frontier Developments Ltd.","url":"PS2_COLLECTION_PART27/Wallace%20%26%20Gromit%20in%20Project%20Zoo%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1273110765,"score":6.1,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Licensed","desc":"<p>Inventor Wallace and his clever dog Gromit, characters in a series of Academy Award-winning Claymation short films, star in this video game adventure.</p><p>Project Zoo starts off one morning as Wallace and Gromit are preparing to visit their adopted friend, Archie the polar bear, in the local zoo.  As soon as they get to the zoo, they find that it's been closed!  What's worse, a villainous penguin named Feathers McGraw has taken Archie and hidden him deep within the zoo.  So, Wallace and Gromit set out to rescue him.</p><p>This game is an action-platform game, with many puzzles and side quests.  The player controls the long-suffering Gromit, and must cooperate with Wallace to complete tasks such as fixing machines or pulling switches. The main goal of each of the six levels is to free 3 trapped baby animals.  Doing so  opens up new areas and allows you to continue to the next area.  In addition, there are hidden bonus levels and coins to collect that unlock video clips from the animated shorts.</p>"},{"name":"Wallace & Gromit: The Curse of the Were-Rabbit","year":2005,"developer":"Frontier Developments Ltd.","url":"PS2_COLLECTION_PART27/Wallace%20%26%20Gromit%20-%20The%20Curse%20of%20the%20Were-Rabbit%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1094972878,"score":6.8,"genres":"Action > Behind view > Licensed","desc":"<p>A faithful game to film tie in of the hit animated duo Wallace and Gromit, based on the feature film released in 2005 and featuring all the plasticine characters in their full glory. Your job as Anti Pesto the pest control team of Wallace, Gromit and Hutch is to protect the prize winning vegetables from garden pests using the tailor made bun gun and other cracking contraptions. And to uncover the terrible truth about the Wererabbit that plagues Wallaby Gardens.</p>"},{"name":"Walt Disney's The Jungle Book: Rhythm n' Groove","year":2001,"developer":"Ubi Soft Entertainment Inc.","url":"sony_playstation2_w/Walt%20Disney%27s%20The%20Jungle%20Book%20-%20Rhythm%20n%27%20Groove%20%28USA%29.zip","filesize":2974485579,"score":6.6,"genres":"Action > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p>Rhythm n' Groove is a dancing game very much modeled after Dance Dance Revolution.  Arrows travel across the screen, and when they reach the right spot, you hit the necessary button on either your controller or dance pad.</p><p>The game follows the story of Disney's The Jungle Book cartoon.  Some songs are remixes of the cartoon's music, while others are original.</p>"},{"name":"Wangan Midnight","year":2002,"developer":"Genki Co., Ltd.","url":"sony_playstation2_w/Wangan%20Midnight%20%28Japan%29.zip","filesize":531347187,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Anime / Manga > Real-time > Direct control > Automobile > Street racing > Asia > Licensed","desc":"<p><em>Wangan Midnight: R</em> is a racing game based on the <em>Wangan Midnight</em> manga. For Arcade it is a revised and updated version of Wangan Midnight while for the PS2 it is the first version and the first home console release in the series as well.</p><p>The PS2 release has an AC Scenario mode (original Arcade Scenario mode), Mission mode, Time Attack mode and an i.Link Battle mode (local multiplayer) similar to the Versus mode used for the two units of the arcade cabinet. There is also a Replay Theater where replays of races can be viewed. The mission mode has a number of challenges against one or more opponents divided over eleven series (series one to ten and then Tune as the final one). The game contains licensed cars from the manufacturers Mazda, Mitsubishi, Nissan, RUF, Subaru and Toyota.</p>"},{"name":"War Chess","year":2004,"developer":"SuperEmpire Interactive Inc.","url":"PS2_COLLECTION_PART27/War%20Chess%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":187846358,"score":5.8,"genres":"Strategy > Diagonal-down > Chess","desc":"<p><em>War Chess</em> is a basically a chess game with a unusual presentation. All the set pieces for the game are substituted for the character of the High Fantasy setting. Whites are pictured as joined armies of humans and elves, while blacks are mostly represented by the undead forces. The player has an ability to choose from 11 various location for the match to take place. Those include: Forest, Desert, Ice and Lava, Dragon Cave etc. All the environments and pieces are rendered in full 3D with a fully rotatable camera.</p><p>For the single playing experience the game provides a difficulty slider to account for gamer's proficiency skill. Additionally War Chess offers a multiplayer mode for two players to battle each other as at one PC so as over the network.</p><p>The game obviously takes it inspiration from the Battlechess series, however doesn't provide unique animations for each type of encounter on the chessboard. Each piece has a double set of animations: one for attacking, another for dying. Those do not differ depending on the type of the opposing piece.</p>"},{"name":"War of the Monsters","year":2003,"developer":"Incog Inc. Entertainment","url":"PS2_COLLECTION_PART27/War%20of%20the%20Monsters%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3873794689,"score":7.5,"genres":"Action > 3rd-person (Other) > Fighting > Sci-fi / futuristic","desc":"<p><em>War of the Monsters</em> is a sci-fi melee fighting game. An alien race comes to earth and attacks the earth. Eventually the humans come up with a new technology to destroy the aliens, only to discover that strange liquid from the damaged UFO's stream into different areas, and create monsters to cause more damage to the Earth. </p><p>Single or two-player fighting modes are available. The game modes include \"Adventure\", \"Free For all\", \"Endurance\", \"Elimination\" and Mini-Games. Some modes are only for either one player or two player. The game has saving options after each level and you can load it later. In each battle there are health pick-ups, weapon pick-ups like cars, rubble and spears, energy pick-ups and special cubes. Each adventure mode battle awards tokens that can be used to purchase new monster costumes, new arenas and mini-games.</p>"},{"name":"Warhammer 40,000: Fire Warrior","year":2003,"developer":"Kuju Entertainment Ltd.","url":"PS2_COLLECTION_PART27/Warhammer%2040%2C000%20-%20Fire%20Warrior%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":1097036909,"score":6,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Licensed","desc":"<p>Set in the grim future of the Warhammer 40,000 table-top game, <em>Fire Warrior</em> is a first person shooter where the player spends a day in the life of a Tau (an alien race) commando. Charged with rescuing an immortal who has been captured by the human Imperium, he will soon realize there are darker forces at work.</p><p>The game offers a twenty-one mission single player story as well as multiplayer death matches, team death matches and capture the flag for up to eight people online. Players can use and pick up a wide variety of weapons of both Tau and extraterrestrial origin including a sniper rifle as well as healing capsules, to confront both men and vehicle enemies.</p>"},{"name":"WarJetz","year":2001,"developer":"The 3DO Company","url":"PS2_COLLECTION_PART27/World%20Destruction%20League%20-%20WarJetz%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1174639709,"score":5.5,"genres":"Action > 3rd-person (Other) > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>War Jetz is the much-anticipated sequel to 3DO's World Destruction League: Thunder Tanks. Instead of cruising around 3-D landscapes in your tank looking for your opponents you can now think in 4 dimensions. You now have the ability to hop into the cockpit of several futuristic air combat machines in this next step in WDL history.</p>"},{"name":"Warriors of Might and Magic","year":2001,"developer":"The 3DO Company","url":"PS2_COLLECTION_PART27/Warriors%20of%20Might%20and%20Magic%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1416381797,"score":5.7,"genres":"Role-playing (RPG) > Behind view > Real-time > Action RPG > Direct control > Fantasy","desc":"<p>From damnation to salvation,<br>only one shall rise...</p><p>Wrenched from the life he knew by unknown forces bent on his destruction, one man embarks upon a fateful journey of legendary proportions. Forced to wear a mask of shame, this renegade warrior sets out to learn the truth about himself and the world he is destined to save. As his nemesis draws ever closer, Alleron finds that he is the only one with the power to save his world from certain destruction.</p><p>The battle is to the death; you are the world's last hope. - 9 massive 3D worlds packed full of adventure powered by an all-new PlayStation 2 engine.</p><p>* Viciously authentic melee and jaw-dropping spell combat with 30 different breed of monsters<br>* Dozens of weapons, armor, and spell varieties for maximum medieval mayhem<br>* Immersive plot and edge-of-your-seat adventures set in the Might and Magic Universe<br>* Gorgeous special effects including real-time lighting and reflective surfaces<br>* True character interaction: NPC dialogue, puzzle solving, combat training, and spell development<br>* Hours of brutal fantasy combat action</p>"},{"name":"Warriors Orochi","year":2007,"developer":"Omega Force","url":"PS2_COLLECTION_PART27/Warriors%20Orochi%20%28Europe%29.zip","filesize":1269039328,"score":5.9,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Hack and slash > Fantasy","desc":"<p><em>Warriors Orochi</em> is a crossover between Koei's Dynasty Warriors and Samurai Warriors franchises. The Serpent King, Orochi, has made a rift in time and taken the most powerful warriors from the Sengoku period of Japan, and China's Three Kingdoms era for a showdown of the ages.</p><p>Battle the demon Orochi, and hack and slash his armies with a team of three warriors you can rotate between at any time. Your two inactive teammates will recuperate during their downtime. If your active character dies, however, you'll have to restart the mission or load a saved game. A total of 79 playable characters from Dynasty Warriors 5, Samurai Warriors 2 and two new combatants are available to you. The new Weapon Fusion technique allows you to combine a particular character's different weapons into a single stronger one.</p><p>Choose from four unrelated story campaigns, Shu, Wei, Wu, and Samurai Warriors Story, with different unlockable characters, weapons and items in each. In the game's Free Mode, you can use any character in any stage you've already completed.</p><p>Play with a friend in two player split screen co-op.</p>"},{"name":"Warriors Orochi 2","year":2008,"developer":"Omega Force","url":"PS2_COLLECTION_PART27/Warriors%20Orochi%202%20%28Europe%29.zip","filesize":2353102719,"score":5.9,"genres":"Action > Behind view > Hack and slash > Fantasy > Martial arts","desc":"<p><em>Warriors Orochi 2</em> is the sequel to Warriors Orochi, a game that combines characters from the Dynasty Warriors and Samurai Warriors games into a new unique storyline.</p><p>Wishing to test his strength, the Serpent King Orochi kidnapped the warriors of Dynasty and Samurai Warriors. After many battles he was eventually defeated, but the peace was to be short lived. While former officers from the Orochi army banded together to form their own armies, a mysterious group appeared to bring Orochi back from the netherworld. Picking up from where Warriors Orochi left off, this game pits the warriors of Wu, Shu, Wei and the Samurai against these foes and their armies.</p><p>This game features similar gameplay to the other <em>Dynasty</em> and <em>Samurai</em> games like unlockable characters, upgradable weapons and multiple stages to play through. Also seeing a return is the team mate system from the previous Orochi game, which allows you to rotate between three different warriors. Choose these three warriors from over 90 playable characters, and use them to battle with as you strive to defeat the vast armies of your opponents.</p><p>New features in this version include Dream Mode, which tells even more of Orochi's story then the last game, and new unlockable characters and weapons not seen before in the series. The North American release of <em>Warriors Orochi 2</em> also contains 10 additional Dream Mode stages and two additional characters, Benkei and San Zang from <em>Musou Orochi Z</em>, a Japanese Only Playstation 3 exclusive.</p>"},{"name":"Warriors, The","year":2005,"developer":"Rockstar Toronto","url":"sony_playstation2_w/Warriors%2C%20The%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2964007411,"score":8,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Crime > Licensed","desc":"<p>Based on the 1979 Paramount Pictures film of the same name and voiced by most of the original cast, <em>The Warriors</em> follows the career of a Coney Island street gang. Starting months before the events of the film, The Warriors expand and defend their Coney Island turf, while proving that they are heavy enough players to join The Riffs’ network. With a citywide rep, they can get invited to a major gang meeting where the future of New York street crime will be decided. </p><p>The game follows the nine lead members of The Warriors (with flashback missions showing how they came to The Warriors): leader Cleon, Swan, Ajax, Cowboy, Cochise, Snow, Fox, Rembrandt, and Vermin. During the game, the player will control each member, usually acting as a war chief and leading a squad of Warriors on a mission. Missions vary from simply wrecking another crew to completing a series of objectives while avoiding arrest or worse. </p><p>During missions, players can mug pedestrians, steal car radios, commit smash and grabs, tag walls or bomb other gangs’ burners, and load up on flash. Between each story based mission, The Warriors return to their Coney Island hangout where they can train to improve their stats, go out on patrol, review their accomplishments, replay levels, or enter into a series of quick-play combat matches. </p><p>The game plays like a squad-based brawler. Each Warrior has his own fighting style and much of the game environment can be weaponized. Fights are fast and often brutal, but stealth is also an option. Players can perform stealthy finishing moves and distract police or other gang members with thrown bottles. The game’s environments are fully 3D allowing Warriors to escape along the rooftops, hop over fences, or dash into shadowy areas.</p>"},{"name":"Warship Gunner 2","year":2006,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_w/Warship%20Gunner%202%20%28USA%29.zip","filesize":1499562684,"score":6.7,"genres":"Simulation > 3rd-person (Other) > Real-time > Naval / watercraft > Historical events","desc":"<p>A continuation in Koei's Naval Ops series, <em>Warship Gunner 2</em> has the player take control of huge naval forces in an alternate 1940's, with the ability of not only using traditional weapons of the times, such as huge deck guns and cannons, but also more advanced technology such as huge lasers.</p><p>The player has the option to choose which ship they would like to use, using the analog controls to aim weapons and move the game camera to see more of the battlefield as well as using the d-pad to steer their ships. They can also research technology to build bigger and better weapons and build their own custom ships from the ground up with over a 1,000 customizable parts to use.</p><p>Players can employ anything from destroyers, battleships, cruisers as well as submarines to destroy their enemies and has 100 missions to play in as well.</p>"},{"name":"Water Horse, The: Legend of the Deep","year":2008,"developer":"Atomic Planet Entertainment Limited","url":"PS2_COLLECTION_PART27/Water%20Horse%2C%20The%20-%20Legend%20of%20the%20Deep%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":321269062,"score":"","genres":"Action > Behind view > Diagonal-down > Stealth > Licensed","desc":"<p><em>The Water Horse: Legend of the Deep</em> is based on the movie by the same which in turn is based on a children novel by Dick King-Smith. It's a tale about a young boy, Angus MacMorrow, who on the shores of Loch Ness finds an egg which hatches into a water horse. The game starts shortly after that when Angus needs to get food to the newborn little creature. The story of the game is told between missions with clips from the movie.</p><p>The player gets to control both Angus and Crusoe (the water horse). As mentioned before the game starts with Angus having to collect food for Angus. Angus is controlled from a bird's-eye view perspective and has to sneak around the farm without being spotted by his mother or any of the soldiers that are patrolling the area. Each level has to be completed within a set time limit. Angus can use different objects to help him progress. Stones can be thrown to distract guards, four-leap can be used to avoid guards and wood planks and boxes can be used to cross streams and climb fences. </p><p>The player also gets to control Crusoe during different stages of growth. Depending on which stage he is in the gameplay will also differ. In the baby stage he needs to eat to grow. The player controls Crusoe in a barrel full of water and needs to catch apples that are dropped into the barrel before they sink. There's both good and rotten apples and it's important to only eat the good ones. In the toddler stage Crusoe needs to learn how to swim in a bath tub. This is done with a quick time event where the player has to press the right keys at the right time as they appear on the screen. In the teenager stage Crusoe needs to swim around a pond to find fish that he can eat. The more fish he eats the faster he swims, while the reeds and lily pads in the pond makes him slow down. In the adult stage the player controls a full grown Crusoe in the loch. Here Crusoe has to navigate through the loch while avoiding the different dangers of the loch such as mines, Victoria gun shells and photographer boats. At the same time Crusoe must find food and surface now and then to catch his breath.</p><p>Throughout the levels of the game the player will come across mosaic pieces that can be collected. In total there is 100 pieces and they can used to unlock clips from the movie. In addition to the story mode the player can also play through individual levels at any time, as long as these are unlocked in the story mode.</p>"},{"name":"Wave Rally","year":2001,"developer":"Opus Corp.","url":"sony_playstation2_w/Wave%20Rally%20%28USA%29.zip","filesize":610634612,"score":6.4,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Sailing / boating","desc":"<p>Experience the thrill of adrenaline fuelled competitive Jet Ski racing as you launch off realistic crashing waves, speed over jump ramps and perform spectacular freestyle tricks. Race through the beaches of Florida, the white water rapids of New Zealand, the canals of Venice and more.</p>"},{"name":"Way of the Samurai","year":2002,"developer":"Acquire Corp.","url":"PS2_COLLECTION_PART27/Way%20of%20the%20Samurai%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1415929248,"score":6.8,"genres":"Action > Behind view > Hack and slash > Direct control > Martial arts","desc":"<p>This is a story of the Way of the Samurai in their final days. Warring factions are vying for control of feudal Japan. At Rokkotsu Pass, three groups wrestle for power. Into this conflict walks a lone samurai who is quickly swept up into battles that threaten to engulf the entire region.</p><p>Combat, deception and betrayal are tools to be used at will. So grasp your sword and prepare yourself, for history is forged in the fires of battle. </p>"},{"name":"Way of the Samurai 2","year":2003,"developer":"Acquire Corp.","url":"PS2_COLLECTION_PART27/Way%20of%20the%20Samurai%202%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1768703757,"score":6.4,"genres":"Action > 3rd-person (Other) > Fighting > Martial arts","desc":"<p>Acquire's second <em>Way of the Samurai</em> game is designed to offer the authentic settings, deep sword-fighting system, and cause-and-effect role-playing found in the original, while boosting the graphics and enhancing the interface. Characters can obtain as many as 60 different swords and, with the proper equipment and practice, perform more than 100 different special moves. Also as in the original, the hero must choose his own path through the plot lines, and the decisions he makes can drastically affect the outcome of the story.</p><p>The adventure begins as the player's lone samurai warrior comes upon a small, remote village mired in the midst of large, internal dispute. The traditional village leaders favor fealty to feudalistic powers that are becoming prominent throughout the land, while a group of outlaw rebels, known as the Aoto, vehemently oppose acquiescence to the regional authority. As the main character and hero of the story, the player must bring resolution to this conflict, and peace to the town, in whatever Way he deems best.</p><p>There is a realistic day and night cycle and various strategical elements. You can talk to various characters, accept tasks and shop for new items. Decisions influence the relationships with the different groups. There are 60 swords, hammers and clubs to choose from, and you have to keep a variable quality and durability level in mind. You can perform both offensive and defensive moves, and even perform special actions. Swords can be enhanced or upgraded in stores, according to your fighting style.</p>"},{"name":"WCR: World Championship Rugby","year":2004,"developer":"Swordfish Studios Limited","url":"PS2_COLLECTION_PART27/WCR%20-%20World%20Championship%20Rugby%20%28Europe%2C%20Australia%29%20%28En%2CFr%29.zip","filesize":530748171,"score":6.8,"genres":"Sports > Diagonal-down > 2D scrolling > Rugby > Licensed","desc":"<p><em>WCR: World Championship Rugby</em> is an action-oriented translation of the rugby sport. The player uses the gamepad or the keyboard to simulate various motion sequences, e.g. passing or kicking. Playing modes are single matches or a world cup championship using one of the 20 teams which participated in the 2003 World Cup. </p><p>The game also features most of the official rugby rules, the original names for the teams of England and Wales and commentary by Miles Harrison and Stuart Barnes.</p>"},{"name":"We Are","year":2006,"developer":"","url":"sony_playstation2_w/We%20Are-%20%28Japan%29.zip","filesize":2533007108,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition release includes:</p><ul><li>We/Are* game</li><li>Original soundtrack</li><li>Audio drama CD</li></ul>"},{"name":"We Love Katamari","year":2005,"developer":"Namco Limited","url":"PS2_COLLECTION_PART27/We%20Love%20Katamari%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":2613758602,"score":8.2,"genres":"Action > Puzzle > Behind view > Direct control > Fantasy > Comedy","desc":"<p>After the success of Katamari Damacy, the King of all Cosmos and his son, the Prince, have gained quite a bit of fame. To keep all of the fans happy, the Prince is once again sent to Earth to roll stuff up with a katamari (a clump of stuff); this time he's taking requests from the fans as to what should be rolled up!</p><p>The gameplay is the same as in Katamari Damacy; using both of the analog sticks you can push the katamari around. When the katamari runs over an object that is small enough, it will stick causing the katamari to grow in size. As the katamari grows, you'll be able to roll up increasingly larger objects. There are a variety of different objectives that need to be completed; some tasks will have you rolling up as much as you can within a time limit, others may have you rolling up a fixed number of objects as fast as can, and sometimes certain objects need to be avoided. Most of the missions take place in a large settings: such as a series of rooms, an open park and even complete cities. Special settings require the prince to roll up clouds to bring back the sun, or to collect lights so a young man can study.</p><p>As the katamari rolls around, it can pick up almost anything; umbrellas, desks, erasers, pencils, batteries, plants, beach balls, tea kettles, fences, assorted animals, people, buildings, trees, mountains, cars, and many other objects. Between levels there are short-cut scenes providing some back story on the Prince and the King of all Cosmos. All missions start from the meadow, a central location where animals and people call for help. The prince can choose to accept the mission or look for something else. Upon completion, the prince returns to the king and the katamari is sent into space as a planet, or as stardust when there already is a better or larger planet available.</p><p>To the end the game, the prince is transported to the cosmos to roll up all the planets and finally roll up the sun. In the meadow, players can view presents, rankings, collections, and change general options or save/restore a game. The game features all new unusual songs as well as a new two-player mode. The visuals are very bright, with unusual characters and conversations.</p>"},{"name":"Weakest Link","year":2001,"developer":"Traveller's Tales (UK) Ltd.","url":"PS2_COLLECTION_PART27/Weakest%20Link%2C%20The%20%28Europe%29.zip","filesize":923863150,"score":5.7,"genres":"Simulation > 3rd-person (Other) > Game show / trivia / quiz > Licensed","desc":"<p>A home version of the popular TV show, where playing as one of the 24 selectable characters you will have to answer questions, bank prize money and vote tactically to become the winner.  </p><p>Questions are presented in a multiple choice format with only the first letter of the answers displayed. Difficulty settings can be changed so that all the answers are shown fully, or for the Junior setting there is only a choice of 2 answers.</p><p>The game supports single and multiplayer options for the main game plus there is a longer single player championship mode where you must play and win 4 shows to succeed. </p><p>The game faithfully creates the TV studio setting and features video and sound clips of host Anne Robinson for an authentic Weakest Link experience.</p>"},{"name":"Wheel of Fortune","year":2003,"developer":"Artech Digital Entertainment, Ltd.","url":"sony_playstation2_w/Wheel%20of%20Fortune%20%28USA%29.zip","filesize":1161872757,"score":"","genres":"Puzzle > Game show / trivia / quiz > Word construction > Licensed","desc":"<p><em>Wheel of Fortune</em> is a video game based on the TV game show of the same name. This game can be player with up to three players. They have the option of playing with or without computer players giving contestants the ability to go head to head in a game against a friend. The game also features a \"sample contestant exam\" to see if you have what it takes to make the real show, presented by Vanna White. The game also gives you the ability to compete at different venues for a change of scenery with 3,200 puzzles in total.</p>"},{"name":"Whiplash","year":2003,"developer":"Crystal Dynamics, Inc.","url":"PS2_COLLECTION_PART27/Whiplash%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1109208911,"score":6.9,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Sci-fi / futuristic","desc":"<p>Chained together and doomed for destruction, you must make your escape from the evil animal testing laboratory. As Spanx, the only weapon and tool you have is the indestructible Redmond</p><p>Dip Redmond in toxic waste to poison enemies, electro-charge him to zap attackers, fill him with helium to lift you to higher platforms.</p><p>Make your getaway, free other animals and sabotage the twisted corporation.</p>"},{"name":"Whirl Tour","year":2002,"developer":"Papaya Studio Corporation","url":"PS2_COLLECTION_PART27/Whirl%20Tour%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1843863667,"score":6.5,"genres":"Action > Sports > 3rd-person (Other) > Tricks / stunts","desc":"<p>During a concert of band \"Flipside\" you're a roadie of, a portal to a new dimension opens and sucks the band in. Being the ever-loyal roadie, you grab your trusty scooter and set off to free them.</p><p>Throughout many levels, you will now have to defeat monsters - using a wide array of tricks and stunts with your scooter. As you progress, you'll learn more tricks and gain access to different scooters.</p><p>An extreme sport game with many nods towards Tony Hawk, however in a jolly cartoony setting.</p>"},{"name":"White Breath: Kizuna - With Faint Hope","year":2006,"developer":"KID Corp.","url":"sony_playstation2_w/White%20Breath%20-%20Kizuna%20%28Japan%29.zip","filesize":2099032626,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>This PlayStation 2 port is released roughly two years after the original Windows version, but is stripped of all the adult graphics. The story premise remains the same, however. The protagonist of the story is Tsukasa Sagami, a high-school student who had miraculously recovered from a fatal illness when he was a child. Over time he became fairly popular in school and somewhat of a soccer star. But the illness returned and he was diagnosed with very little time left to live, probably not even until the graduation.</p><p>The game progresses through the calendar, day by day, letting you decide which characters you want to meet. Namely, you can only select among five different girls, most of which will exclude one another as the places and activities happen at the same time in a different place. The game then progresses as a visual novel where you read the story and occasionally select your action when the choice presents itself. During the gameplay characters are mildly animated (eyes, mouth, breath).</p>"},{"name":"White Breath: Kizuna - With Faint Hope (Genteiban)","year":2006,"developer":"KID Corp."},{"name":"White Clarity: And, The tears became you.","year":2005,"developer":"PrincessSoft"},{"name":"White Clarity: And, The tears became you. (Shokai Genteiban)","year":2005,"developer":"PrincessSoft","url":"sony_playstation2_w/White%20Clarity%20-%20And%2C%20the%20Tears%20Became%20You%20%28Japan%29%20%28Shokai%20Genteiban%29.zip","filesize":1208929535,"score":"","genres":"Special edition > Physical extras","desc":"<p>First Print Limited Edition package which includes:</p><ul><li>White Clarity: And, The tears became you. game</li><li>White Clarity cellphone strap</li></ul>"},{"name":"White Van Racer","year":2007,"developer":"Tuna Technologies Ltd.","url":"PS2_COLLECTION_PART27/White%20Van%20Racer%20%28Europe%29.zip","filesize":86989234,"score":"","genres":"Racing / Driving > 3rd-person (Other)","desc":"<p>Known to many road users, the infamous White Van Man is the workman that drives his light commercial vehicle through traffic in a particularly aggressive and infuriating manner. Frivolous honking and cutting off other road users are his trademark. In <em>White Van Racer</em>, players are given the chance to turn the tables on this modern-day phenomenon, and become a White Van Man of their own.</p><p>Selectable vans range from nondescript models to ice cream trucks, mobile burger shops, or business vehicles for painters and window cleaners. While there is no civilian traffic on the roads, drivers compete against up to 4 other computer-controlled vans in a dash for the finish line. There is a total of 12 linear stages, set in 2 scenarios and consisting of variations (direction, time of day) on 4 basic road sections. True to the White Van Man disposition, pushing and shoving competitors is a necessary tactic for the successful driver. Apart from quick race and time trial modes, three championships allow players to unlock more stages and vans.</p>"},{"name":"Whiteout","year":2002,"developer":"Driver-Inter, Ltd.","url":"PS2_COLLECTION_PART27/Whiteout%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":327663414,"score":5.6,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Snowmobile","desc":"<p>This is a snowmobile racing game. The game engine simulates the real physics of a sled on all kinds of surfaces such as snow, ice, mud and many others so the player has to pay attention to where and how to accelerate, break and turn in order to win a race. The AI engine uses a complicated model that simulates real human behaviors so that NPC opponents can fall asleep on fanfares or get reckless in a rage. Making different stunts is not the last tactic that might lead to the win.</p>"},{"name":"Who Wants to Be a Millionaire: 2nd Edition","year":2002,"developer":"Revolution Software Ltd.","url":"PS2_COLLECTION_PART27/Who%20Wants%20to%20Be%20a%20Millionaire%20-%202nd%20Edition%20%28Europe%29.zip","filesize":422106693,"score":5.7,"genres":"Puzzle > Game show / trivia / quiz > Licensed","desc":"<p><em>Who Wants to Be a Millionaire Second Edition</em> is the second game based on the hit TV gameshow. You have to answer fifteen questions, slowly going up to the one million mark. If you have trouble, there are three lifeline you can use to help you: Phone a friend, 50/50 and ask the audience.</p>"},{"name":"Who Wants to Be a Millionaire: Party Edition","year":2006,"developer":"Climax Action Limited","url":"PS2_COLLECTION_PART27/Who%20Wants%20to%20Be%20a%20Millionaire%20-%20Party%20Edition%20%28Europe%29.zip","filesize":793565538,"score":"","genres":"Puzzle > Game show / trivia / quiz > Party game > Licensed","desc":"<p><em>Who Wants to Be a Millionaire: Party Edition</em> is a quiz game based on the successful TV show and varies it to be more suited for multiplayer. The basic rules are still the same: The player takes the role of a candidate and has to answer 15 questions by choosing the correct answer out of four given possibilities. For every right answer he receives money but he also loses money when choosing poorly (there are two \"guarantee points\" where he falls back to so he doesn't lose all). There are also three jokers: eliminating two false answers, asking the viewers in the studio per poll and phoning a friend. In the game the latter is a prerecorded conversation.</p><p>The game has a more comical look as in the former game versions because the player has to choose between different characters which are present during the game and give humorous statements. New are also the three difficulty levels: while \"normal\" represents the regular rules described above the \"easy\" mode add three lives which are basically second chances when answering a question wrong and in \"hard\" mode the player has no access to jokers. In the \"quick fire\" mode the player needs to answer as much questions as possible.</p><p>Multiplayer mode has even less to do with the original rules. Here every player can buzz in after the game states the question. The fastest player has to answer within one second or another player can steal it from him. He has also the possibility to force another player to answer the question - but of course he gets punished when the other player gets it right (who also gets an extra reward). Every player gets three lives. The goal is to answer 15 questions correctly. There are also four additional multiplayer variations: quick fire, play-or-pass (a player can choose to answer a question himself or pass it away), millionaire remix (collecting lives and guarantee points) and multimillionaire (team-based).</p>"},{"name":"Wild Arms 3","year":2002,"developer":"Sony Computer Entertainment Inc.","url":"PS2_COLLECTION_PART27/Wild%20Arms%203%20%28Europe%29.zip","filesize":2873006847,"score":7.4,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Puzzle elements","desc":"<p>In ancient times, a war was fought against demons on a world named Filgaia. The planet bears the scars of this encounter as much of the world is barren and the ocean has turned to sand. For different reasons, four characters set out to become \"drifters\" and make their own path over the plains. Virginia Maxwell chose this trip on a steam train because she was bored by the monotonous life in a sleepy village and wanted to explore the world. Treasure-hunter Jet Enduro thinks the train will bring him to a place where a flower with magic powers can be found. Gallows Caradine is a shaman of his tribe and is the guardian of a sacred artifact. Clive Winslet is a cynical archaeologist and part-time bounty hunter. A fateful encounter aboard a train will bring these four together and mix them up in the doings of a mysterious organization of scientists. This Council of Seven once was formed to renew the life force of Filgaia, but now seems to be harnessing it for their own means.</p><p>This third installment of the <em>Wild Arms</em> series continues the tradition of two previous games, adding a stronger emphasis on the (fantasy) Wild West atmosphere. Characters have the ability to attack using ARMS (projectile weapons), use special abilities, use items or cast Arcana (magic). From the beginning of the game, each of the four characters has an introductory chapter before becoming a party and traveling together. The battles are random, with a FP gauge which fills while attacking and defending, and usage of Arms and magic which require FP, similar to the second game of the series. Later on, special vehicles feature their own type of battle system. Other similarities to the previous game include the search system (towns and dungeons are not indicated on the map until you discover them), the ability to cancel a random battle and special abilities used outside of battles to solve puzzles. A new feature is a dialogue based on key words, similar to a system commonly used in adventure games, which allows a more flexible use of dialogue options.</p>"},{"name":"Wild Arms 4","year":2005,"developer":"Media.Vision Entertainment Inc.","url":"PS2_COLLECTION_PART27/Wild%20Arms%204%20%28Europe%29.zip","filesize":3167793430,"score":7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Post-apocalyptic","desc":"<p>You play as a young teenager named Jude Maverick. You live in a quiet village that floats high above the ground, unaware of the world that lies beneath it. But one day, your world is shattered to pieces, and you descend onto the earth to face the terrible reality: the world of Filgaia was devastated by wars. A few settlements amidst rusty tanks is all that is left of civilization. The democratically elected government has some plans for improving the conditions of the world, but as you meet a young girl whom they used as a tool for their purpose, you realize you must find a better plan to save her, and the world, from complete destruction.</p><p>The fourth installment of the <em>Wild Arms</em> series abandons its traditional Wild West theme and is set in a post-apocalyptic world. The gameplay system introduces hex-based battles. Battle screens are divided into seven hexes, each one of which can hold several party members or foes. You navigate your characters on the battle field, trying to force the enemy into an uncomfortable position. There is also a variety of skills you can learn and apply in battles to get benefits. As in previous <em>Wild Arms</em> games, the dungeons contain many environmental puzzles to solve.</p>"},{"name":"Wild Arms 5","year":2006,"developer":"Media.Vision Entertainment Inc.","url":"PS2_COLLECTION_PART27/Wild%20Arms%205%20%28Europe%29%20%28En%2CFr%2CIt%29.zip","filesize":2892478732,"score":7.4,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based","desc":"<p>In the fifth Wild Arms game, the player returns to the spaghetti western world of Filgaia as the young Dean Stark. Dean is a boy who dreams of becoming a hunter of golems, the huge, ancient machines that were once built to serve mankind. Along with his childhood friend Rebecca Streisand, and Avril Vent Fleur, a mysterious girl who falls from the sky, Dean sets out on an adventure to chase his dream of becoming a golem hunter and to help Avril recover her memories.</p><p><em>Wild Arms 5</em> is a third-person role-playing game where the player explores the world and fights battles in turn-based combat sequences with up to 3 characters in your party. The playing field during combat is split in seven hexagonal sections, of which some have special properties. Players can use guardian beasts, combination arts (team work), chain attacks, original attacks and others. Just like the previous game, these are based on a force meter, which increases when characters attack or are being attacked.</p><p>In the exploration mode, Dean and his party can use vehicles or run around, and during dungeon exploration there are two modes: Action (jumps, slides, interaction) and Shooting (through ARMs, Dean can choose from various cartridges to interact with the environment, destroying or manipulating it).</p>"},{"name":"Wild Arms Alter Code: F","year":2003,"developer":"Media.Vision Entertainment Inc.","url":"sony_playstation2_w/Wild%20Arms%20-%20Alter%20Code%20-%20F%20%28USA%29.zip","filesize":6645537094,"score":7.2,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Puzzle elements > Fantasy","desc":"<p>This is the story of three heroes. Rudy is a young man from a quiet village who possesses the secret of ARMS, a forbidden technology. He is expelled from his home for using this power to defeat a monster. Jack is a careless treasure hunter who roams caves and ruins with his trusty friend, the blue rodent Hanpan. Cecilia is a young princess who was sent to a magician school to study the lore of magic. She has the ability to communicate with ancient powerful beings called the Guardians. The three heroes meet each other and embark on a journey to save the world of Filgaia from a grave danger.</p><p>\"Wild Arms Alter Code: F\" is a remake of the original Wild Arms for Playstation. The basic gameplay premise remained the same: you participate in random turn-based battles, using attacks, special magic unique to each character, and other abilities (such as summoning Guardians). In dungeons there are many physical and environmental puzzles to solve. The remake features fully 3D graphics, changes and more detail in the design of many locations, and a new party to control. In the original, only Rudy, Jack, and Cecilia were available as playable characters. In the remake, several other characters can be taken into your party and even switched during the same battle.</p>"},{"name":"Wild Water Adrenaline featuring Salomon","year":2005,"developer":"Fresh3D S.A.R.L.","url":"PS2_COLLECTION_PART27/Wild%20Water%20Adrenaline%20featuring%20Salomon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":598219240,"score":"","genres":"Action > Sports > 3rd-person (Other) > Licensed","desc":"<p><em>Wild Water Adrenaline</em> is a game based on whitewater kayaking and rafting. Up to four players, in single kayaks or controlling a raft together, can play simultaneously to go down rivers, conquer rapids and drop off cliffs. The player especially needs to pay attention to the steering, which is controlled through the analogue sticks, one for each of the character's arms, to avoid a variety of obstacles. This is done by constantly moving them in a circular motion.</p><p>Next to the main game modes, there is also a training to explore the course and get used to the handling. The game is endorsed and has been developed in collaboration with Salomon, a manufacturer of articles for outdoor sports.</p>"},{"name":"Wild Wild Racing","year":2000,"developer":"Rage Games Ltd.","url":"PS2_COLLECTION_PART27/Wild%20Wild%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":395316165,"score":6.6,"genres":"Racing / Driving > Sports > Behind view > Automobile > Off-roading","desc":"<p>Wild Wild Racing was one of the very first games released for the Playstation 2 in the United States. It is a straightforward off-road racing game. You drive one of nine dune buggies in races that take place around the world, in places like the American desert, India, Iceland, Australia or Mexico.</p><p>Wild Wild Racing features a championship mode where you compete in a series of races to win a title. It has a challenge mode where you attempt to perform feats such as driving through a stunt course or collecting letters littered across a race course. It also has a time-attack mode.</p>"},{"name":"WinBack 2: Project Poseidon","year":2006,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_w/WinBack%202%20-%20Project%20Poseidon%20%28USA%29.zip","filesize":1182638783,"score":5.8,"genres":"Action > 3rd-person (Other) > Shooter > Spy / espionage","desc":"<p>A third-person action game which centers around the exploits of a crisis response team. The three player characters, Craig Contrell, Nick Bruno, and Mia Cabrera, must shoot their way through 30 missions of hostage rescuing, drug cartel smashing, and world saving in a wide variety of offices, warehouses, mansions, and laboratories.</p><p>The most unique aspect of the game is its \"Route\" system. Each mission has two different characters, and is played through from both perspectives. During the first part each mission, a number of \"Assist\" points will happen where the player must assist the second character -- their performance here affects the playthrough of the second part of the mission, and doing well will reward you with cover fire or health bonuses later.</p><p>There is also a multiplayer mode for up to four players, featuring several game mode including deathmatch and sniper battles. Bots are available if you have fewer than four players.</p>"},{"name":"WinBack: Covert Operations","year":2000,"developer":"Omega Force","url":"sony_playstation2_w/WinBack%20-%20Covert%20Operations%20%28USA%29%20%28En%2CJa%29.zip","filesize":518005203,"score":7.1,"genres":"Action > Strategy > Behind view > Shooter","desc":"<p>A combination of Metal Gear Solid and Syphon Filter, <em>WinBack</em> has you as part of the Strategic Covert Actions Team (SCAT), who have been called upon to stop a terrorist group called the Crying Lions. Already the enemy has destroyed the Center for Space Research, and have taken over a high-security complex that houses the GULF Strategic Weapons System. You have three hours to take back the complex, before the system lets loose on the world.</p>"},{"name":"Wind: A Breath of Heart","year":2003,"developer":"minori","url":"sony_playstation2_w/Wind%20-%20A%20Breath%20of%20Heart%20%28Japan%29.zip","filesize":1624989448,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Originally released for PC (Windows) under the same title, as an adult visual novel, the game was then ported to consoles with removed adult contents, but additional CG events and story elements to compensate for the lack of erotic scenes. The game follows Makoto Okano (丘野 真) as he returns to his hometown after 10 years away. Before he left, he and Minamo Narukaze (鳴風 みなも) made a promise to each other to meet again. She told him she will keep on playing the harmonic and even though he may be too far away to see it, the wind will carry the melody, hopefully all the way to his place.</p><p>Ten long years have passed, and together with his younger sister, Hinata Okano (丘野 ひなた), Makoto returns to his hometown. One evening, after school classes, he hears a melody that attracts his attention, which in turn leads him to the roof where he sees a girl with a purple hair, playing a harmonica. Not realizing at first who she is, the truth soon becomes clear that the girl is none other than Minamo, and promise of their reunion has been fulfilled via serendipity, but that is just the beginning of their story.</p><p>The game comes with lost of bonus unlockable elements, from BGM and CG galleries to animated videos, all accessible via main menu. Character animation is limited to talking only while the rest relies on still drawn in different poses. The game also relies on zooming and scrolling to emphasize certain scenes or when introducing new characters to the scene. Voice-acting in the game is present for everyone but the main character.</p>"},{"name":"Winky the Little Bear","year":2006,"developer":"The Code Monkeys Ltd."},{"name":"Winning Eleven: Pro Evolution Soccer 2007","year":2006,"developer":"Winning Eleven Productions","url":"sony_playstation2_w/Winning%20Eleven%20-%20Pro%20Evolution%20Soccer%202007%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2917929616,"score":8.2,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p>Pro Evolution Soccer 6 enters the display of 2006/2007 with up-to-date exchange of club and national players. Some new clubs were brought to their proper names (such as Manchester United instead of Man Red), while others have lose it (such as Chelsea which is now once again London FC). However, despite the names, players are correct as Chelsea does have Ballack and Schevchenko, Real Madrid now has Van Nistelrooy which was in Manchester United and so on.</p><p>Controls are the same, but moves and strategies have changed, as they tend to do from game to game. Fouls are not as easygoing as in previous game, but players turning is now too slow unless you know how to do it properly. Moves are much more realistic and goal keepers don't catch every ball with an ease, even easy one can sometimes slip by. That said, it all makes one step closer to reality, while it loses the reality factor on some other sides. Cameras are typical broadcast, tower, and bird-perspective, and cups, league and master league are still included.</p><p>The Xbox 360 version is the only one to have hi-definition graphics and more animations, as the PC version is a conversion of the PS2 engine. The 360 version lacks a few features however, such as co-operative play, the PES shop, a replay save feature and some minor settings such as the ability to create players, rename leagues, edit kits, team names, boots and player appearances, and you cannot swap kit combinations.</p>"},{"name":"Winning Post 5: Maximum 2002","year":2002,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_w/Winning%20Post%205%20Maximum%202002%20%28Japan%29.zip","filesize":505721791,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Horse / derby","desc":"<p><em>Maximum 2002</em> is an updated annual release of Winning Post 5, which includes complete race programs, jockey rosters, and horse data for the 2002 race season. Also included are a comprehensive edit mode for both jockeys and horses, the ability to race against famous historic champions, and the new option to choose from three difficulty levels.</p>"},{"name":"Winning Post 5: Maximum 2003","year":2003,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_w/Winning%20Post%205%20Maximum%202003%20%28Japan%29.zip","filesize":948368552,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Horse / derby","desc":"<p><em>Maximum 2003</em> is an updated release of Winning Post 5, featuring race programs and rosters updated for the 2003 race season. Compared to the previous edition, the jockey training system has been modified to add additional options, and two more additional difficulty levels have been added.</p>"},{"name":"Winter Sports","year":2007,"developer":"Nu Generation Games Ltd.","url":"PS2_COLLECTION_PART27/Winter%20Sports%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":224989904,"score":"","genres":"Sports > 3rd-person (Other) > Olympiad / mixed sports > Snowboarding / skiing","desc":"<p><em>Winter Sports</em> (no connection to the 49Games series) is a typical winter sports game, featuring 10 nations competiting in the usual events - downhill, cross country, slalom, ski jump, biathlon and snowboarding.</p><p>Game mode include tournament (where the player is in a race for points in all events in sequential order), multiplayer (against up to 4 human opponents) and practice.</p>"},{"name":"Winter Sports 2: The Next Challenge","year":2008,"developer":"49Games GmbH","url":"sony_playstation2_w/Winter%20Sports%202%20-%20The%20Next%20Challenge%20%28USA%29%20%28En%2CFr%29.zip","filesize":842942286,"score":6.2,"genres":"Sports > 3rd-person (Other) > Snowboarding / skiing","desc":"<p>Following previous winter sports titles (including the official game of the Torino 2006 Olympic Games), 49Games presents another light simulation of some of the most popular winter sports, including alpine skiing, snowboard half-pipe, ski jump, speed skating, biathlon, luge, bobsleigh, skeleton, figure skating and curling, for a total of 18 different events.</p><p>While not as complex as the specialized games developed by the German company (there's no waxing the skis, for instance), the game features a solid physics engine, which provides more realism than some of the more arcadish approaches to the genre. Gameplay varies by event, with the player being in full control of the athlete in most events like alpine skiing and half-pipe (which plays like most radical sports games featuring tricks and flicks instead of being \"on-rails\"), while other modes feature an higher focus on rhythm, like speed skating and figure skating. Curling plays like most games previously featuring the event, but there are two modes: simulation plays like the actual sport, where a team scores a point for each stone closer to the middle than the opponents' closest, while game awards points for each of the stones inside the target.</p><p>The game features three modes: Competition, where the player can participate in 5, 9 or all 16 events (or customize them), Campaign, where the player has to complete a number of quick goals to unlock additional tracks and features from previous games, while Career requires the player to compete in 15 levels with an increasing number of events to do the same. Single Events allow the player to train on any event.</p>"},{"name":"Winter Sports 2008: The Ultimate Challenge","year":2007,"developer":"49Games GmbH","url":"sony_playstation2_w/Winter%20Sports%202008%20-%20The%20Ultimate%20Challenge%20%28Europe%29.zip","filesize":892750247,"score":6.7,"genres":"Sports > 1st-person > 3rd-person (Other) > Arcade > Olympiad / mixed sports > Snowboarding / skiing","desc":"<p><em>Winter Sports: The Ultimate Challenge</em> is an arcade-oriented 3D simulation of the most popular winter sports. It features 15 different disciplines in 9 different sports like skiing, bobsleigh, speedskating, ski jumping, figure skating and curling. In campaign mode you can try to master all of the 42 challenges to unlock more levels. The competition mode offers an Olympic event with opening and medal ceremony. The realism is enhanced through commentators, TV cameras, mascots and background sound. There are multiplayer modes for up to four players.</p>"},{"name":"Winx Club","year":2006,"developer":"DC Studios, Inc.","url":"PS2_COLLECTION_PART27/Winx%20Club%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2222382467,"score":6.2,"genres":"Action > Adventure > Behind view > Fantasy > Licensed","desc":"<p><em>Winx Club</em> is a 3D action adventure game based on the Italian cartoon series of the same name. The story is similar to that of Harry Potter, only this time the main character is a fairy. She gets to go to a fairy school in fairytale world called Magix where she has to find her true self.</p><p>This game loosely retells the story of the first season of the television series.</p><p>There are \"action\" and \"adventure\"levels. In the adventure levels gameplay consists of finding items for specific NPCs and playing various mini-games. In the action levels the player has to jump, climb, and fight enemies. The main character, Bloom, has a magic shield and two attacks that improve during the game. She can also cast a number of spells that can aid her in finding the items she needs. During boss battle Bloom changes to her Winx form in which she is more powerful and can fly. During the levels there are various items to be picked up which improve Blooms health or attacks or unlock new outfits that can be worn.</p>"},{"name":"WipEout Fusion","year":2002,"developer":"SCE Studio Liverpool","url":"PS2_COLLECTION_PART27/WipEout%20Fusion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1641679911,"score":7.9,"genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p><em>WipEout Fusion</em> is a futuristic racing game with action elements. Players compete in the F9000 Anti-Gravity Race League, driving hovercrafts and sometimes using weapons against opponents to achieve victory. </p><p>Like WipEout 3, the game contains single-race and league modes, as well as two-player split screen gameplay. The single race mode (called Arcade) is used to unlock new tracks. The challenge mode from WipEout 64 returns with a few enhancements: each team has its own set of six challenges, which must be completed with a medal in order to unlock the next one. A new Zone mode requires players to drive as many loops as possible on a track while continuously increasing the speed.</p><p>New weapons include the proton cannon, flamethrower, gravity bomb, super missiles, seismic field, nitro rocket, and others. A total of eight vehicles and teams are available: Xios (Finland), Feisar (European Consortium), Van Uber (Germany), Tigron (Russia), EG-R (China), G-tech (Japan), Auricom (North America), and Piranha (Brazil). Once a team has completed a sufficient amount of challenges in the Challenge mode, it acquires a license for a unique super weapon. </p><p>Another new feature in <em>WipEout Fusion</em> are hovercraft upgrades. Depending on their performance, players receive credits after races, which can be used to increase speed, thrust, weapon power, shield strength, lateral stability, and brake force of a vehicle. Upgraded vehicles can be used in any other game mode, with the exception of the Challenge mode.</p>"},{"name":"WipEout Pulse","year":2009,"developer":"SCE Studio Liverpool","url":"PS2_COLLECTION_PART27/WipEout%20Pulse%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3767595099,"score":8.2,"genres":"Action > Racing / Driving > 1st-person > Behind view > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p>Like the other titles in the series, <em>WipEout Pulse</em> is a futuristic racing game where players control a hovercraft-like vehicle that hovers above the ground and can reach very high speeds. The game is set in 2207 where players take part in the FX400 Anti-Gravity Racing League with courses all over the world.</p><p>The vehicles are divided over different teams (twelve including downloads), each with their own characteristics based on handling, speed, acceleration and more. While racing, moving over pads provides boosts or both offensive and defensive power-ups such as shields, rockets, a wall of fire, autopilot, a gun or a turbo boost. Instead of using weapons, they can now also be absorbed to restore the energy levels. A single button is used to accelerate, with regular steering and also air brakes for sharp corners. The visuals are very fast and the soundtrack consists of mostly electronic tracks, a hallmark of the series.</p><p>The base game consists of twelve tracks, but these can be driven in both directions (designated by black or white in the title name). New to the track design are waterfall-like drops, loops and corkscrews. At certain section the vehicle is glued to the track to pass these. Entirely new to the series is the revamped progression system. As usual, new tracks and faster models need to be unlocked by winning races, but instead of a linear model these are now grouped as hexagon-clustered grids with different modes of play. When available, players can choose any of the sections to participate in a time trial, single race, head-to-head, eliminator games (returning from Wipeout 3) and Zone games (introduced in WipEout Fusion) where the vehicle constantly accelerates and transforms into faster models until all health is depleted. A certain amount of races need to be won to access a new grid, but using this system some difficult races can be avoided or ignored. In all races the vehicles are destroyed when all energy is depleted. Based on the performance a bronze, silver or gold medal is awarded and there are three difficulty settings.</p><p>Using the vehicle of a certain team regularly is awarded with a loyalty system. The game supports game sharing and multiplayer modes using both Ad Hoc and Infrastructure as access. Up to 30 mp3 files can be loaded on a memory stick to use as the in-game soundtrack, there is photo mode to take screenshots during replays and on the game's official website players can design their own car skins using a flash client to use in the game. As with the previous games, there are many expansion packs that introduce new teams and tracks.</p>"},{"name":"Without Warning","year":2005,"developer":"Circle Studio Limited","url":"PS2_COLLECTION_PART27/Without%20Warning%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1564105259,"score":4.9,"genres":"Action > 3rd-person (Other) > Puzzle elements > Shooter","desc":"<p>When terrorists invade a chemical plant and the employees are struggling to get out of the plant alive, a Navy SEALs team has come to rescue hostages and trapped employees, as well as killing terrorists and defusing bombs at the plant.</p><p>In <em>Without Warning</em> the player is able to control six different characters with overlapping storylines. Three of these characters are the SEALs that come to the plant. The other characters include a security guard and a secretary at the plant, as well as a news reporter whose chopper was shot down at the plant and wants to get a story of what is going on. The game mixes traditional run-'n-gun elements with puzzles such as unlocking doors and defusing bombs.</p>"},{"name":"Wizardry Xth: Academy of Frontier","year":2005,"developer":"Michaelsoft Inc."},{"name":"Wizardry Xth: Unlimited Students","year":2006,"developer":"Michaelsoft Inc."},{"name":"Wizardry: Tale of the Forsaken Land","year":2001,"developer":"Racjin Co., Ltd.","url":"PS2_COLLECTION_PART27/Wizardry%20-%20Tale%20of%20the%20Forsaken%20Land%20%28Europe%29.zip","filesize":493387662,"score":7.2,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Fantasy","desc":"<p>What was once a peaceful kingdom of Duhan has been radically changed due to a flash that tore through the night. Thousands were killed and the kingdom is ruined, and only a handful remain after this flash devastated the land. The main city in a state of perpetual cold, separated from the outside world. The Queen of Duhan has disappeared into the depths of a giant labyrinth beneath the castle. It is up to the game's protagonist and his chosen companions to explore the Duhan labyrinth and find the answers and the means to revert this unfortunate state.</p><p>Despite its Japanese origins, <em>Wizardry: Tale of the Forsaken Land</em> is very similar to early <em>Wizardry</em> games. The game's environments consist of the town, where the player can recruit characters into the party, rest and buy supplies, and the vast maze-like 3D dungeon. The bulk of the gameplay is dedicated to exploring said dungeon, trying to find the right way through the maze, collecting treasure, triggering scenes, and fighting enemies in turn-based combat.</p><p>There are eight character classes in the game: Warrior, Priest, Thief, Sorcerer, Bishop, Samurai, Knight, and Ninja. A party is formed by selecting characters belonging to these classes, some of which have their own background stories. Some of the classes will only join a character who has had a certain amount of experience exploring the dungeon.</p><p>Thieves can unlock chests and disarm traps, which is done by participating in a mini-game that involves repeating a pattern of buttons within a time limit. Magic requires memorizing a fixed amount of spell units per level. By collecting components and taking them to the shop the player can craft a stone used to upgrade spells.</p>"},{"name":"Women's Volleyball Championship","year":2007,"developer":"ART Co.,Ltd.","url":"sony_playstation2_w/Women%27s%20Volleyball%20Championship%20%28USA%29.zip","filesize":177125717,"score":"","genres":"Sports > 3rd-person (Other) > Real-time > Direct control > Volleyball","desc":"<p>Think You've Got What It Takes?<br>Some of the greatest athletes in the world will not be found on the gridiron, running bases or shooting hoops. They are behind the net, bumping, setting, and spiking their way to victory. Women's Volleyball Championship™ captures the speed and intensity of the sport at its finest. Play as one of twelve countries battling their way to the top of the ranks, or train and create your own team of pros to take on the world. This game is not for the fainthearted; it is a world where only the finest athletes can compete.</p><p>Are you up to the challenge?</p><p> * Take on the world's best teams in the quest to becoming the world's #1 ranked team. * Organize your team's roster to bring your best game on the court! * Create and train your own team!</p>"},{"name":"Woody Woodpecker","year":2001,"developer":"Eko Software SARL","url":"PS2_COLLECTION_PART27/Woody%20Woodpecker%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":390325025,"score":7.4,"genres":"Action > 3rd-person (Other) > Platform > Licensed","desc":"<p>In the same style of other toon-based games like Bugs Bunny &amp; Taz: Time Busters and Disney's Donald Duck: Goin' Quackers, <em>Woody Woodpecker: Escape from Buzz Buzzard</em> brings the famous Universal Studios' character Woody, his nephew Knothead and niece Splinter to Buzz Buzzard dangerous \"amusement\" park. First, playing as Woody, the player must rescue the kids from this weird park. After that, these characters are unlocked and can be controlled to continue the game story. </p><p>The game is an action platformer in which the protagonists traverse cartoon-like 3D levels composed out of passages, platforms, and bridges. Extra lives are scattered through the stages, and can also be won by playing slot machines. The stages contain many hazards and traps with light puzzle-solving elements. Woody's trademark beak can be used to fend off enemies, climb wooden boxes, open doors, and trigger switches.</p>"},{"name":"World Championship Cards","year":2008,"developer":"LTI Gray Matter","url":"sony_playstation2_w/World%20Championship%20Cards%20%28USA%29.zip","filesize":443530917,"score":"","genres":"Strategy > Cards / tiles","desc":"<p>TRY YOUR HAND AT OVER 33 CLASSIC CARD GAMES,<br>FROM THE PUBLISHER OF THE BEST SELLING POKER VIDEOGAME \"WORLD CHAMPIONSHIP POKER\"</p><p>World Championship Cards includes over 33 classic card games... Bridge, Gin Rummy, Spades, Hearts and more! Challenge your family and friends to prove who is the real card shark. * Create your own custom characters with variations of skin tone, hair, clothes, hats, and personalities. * Compatible for online play with World Championship Cards PlayStation 2 computer entertainment system users with PSP (PlayStation Portable) system users.</p>"},{"name":"World Championship Paintball","year":2008,"developer":"Coresoft, Inc.","url":"sony_playstation2_w/World%20Championship%20Paintball%20%28USA%29.zip","filesize":218436938,"score":"","genres":"Action > Sports > 1st-person > Shooter > Direct control > Paintball > Contemporary > North America","desc":"<p>BALLERS WANTED...LOAD AND GO!<br>Beat down the competition in the fiercest paintball experience ever! Trick out your team in the best gear and advance them bunker by bunker to World Championship supremacy!</p><p>Breakout and control the field! Lead your team and change game strategy on the fly. Snap shoot, joust, suppress fire and bunker – give your team changing tactics right in the middle of the action!</p><p>Battle Royale! Roll head-to-head and face off in 6 different match types from pro level 1-Hit-1-Kill competitions to Castle Siege.</p><p>Create and choose from nearly an infinite variety of battle zones using the Playfield builder. Drop in your favorite bunker configurations using cylinders, tents, pyramids, loafs, pipes, monoliths and more!</p><p>Shag the best gear for every mission-choose from 160 professional pieces of equipment. Graffiti other teams online with fully featured multiplayer, leader-board and voice chat support.</p>"},{"name":"World Championship Poker","year":2004,"developer":"Coresoft, Inc.","url":"PS2_COLLECTION_PART27/World%20Championship%20Poker%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":235366714,"score":6.1,"genres":"Gambling > Strategy > 3rd-person (Other) > Cards / tiles","desc":"<p><em>World Championship Poker</em> is a poker simulation featuring twelve types of poker (Texas Hold'em, Omaha, Pineapple, Crazy Pineapple, Tahoe, Double Flop Hold'em, Super Hold'em, Five-Card Draw, Seven-Card Stud, Triple Draw, Billabong Poker, and Shanghai). WCP supports both online and offline play. Online, you can play poker with random people, or your friends. Offline play includes a tutorial, Sit &amp; Go mode for a fast game or a more extensive Tournament mode.</p><p>In addition, the game features the ability to create your own custom character, by adjusting the appearance of various features. Both the players and the tables are completely in 3D. The games supports online multiplayer.</p>"},{"name":"World Championship Poker 2 featuring Howard Lederer","year":2005,"developer":"Point of View, Inc.","url":"sony_playstation2_w/World%20Championship%20Poker%202%20featuring%20Howard%20Lederer%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":449394872,"score":7,"genres":"Gambling > Strategy > 1st-person > 3rd-person (Other) > Cards / tiles > Licensed","desc":"<p><em>World Championship Poker 2 Featuring Howard Lederer</em> is a poker simulation featuring fourteen types of poker, including Texas Hold'em, Five Card Draw, Seven Card Stud and Pineapple. WCP 2 supports both online and offline play. Online, you play poker with up to seven other players. Offline play includes Quick Play mode for a fast game or a more extensive Career mode where the players begins his career as a low ranking upstart living in their mothers basement. As the player advances in their career, they encounter real professional poker players, including Greg Raymer, Clonie Gowen, Amir Vahedi, Paul Darden, Robert Williamson III, Matt Savage, and Annie Duke.</p><p>Using WiFi, you can use the PSP version to play against PS2 players. The PS2 version supports EyeToy to add your own likeness to the game. AI players have their own playing style, emotions and they react to the events. In-game commentary is provided by Matt Savage.</p>"},{"name":"World Championship Poker featuring Howard Lederer: All In","year":2006,"developer":"Point of View, Inc.","url":"PS2_COLLECTION_PART27/World%20Championship%20Poker%20featuring%20Howard%20Lederer%20-%20All%20In%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":655257255,"score":"","genres":"Simulation > Diagonal-down > Cards / tiles > Licensed","desc":"<p>DO YOU HAVE WHAT IT TAKES TO BECOME THE NEXT POKER CHAMPION?</p><p>Do you have what it takes to square off against the world’s toughest players like Howard Lederer, Annie Duke, Robert Williamson III, Marcel Luske, Thomas Bihl and Erin Ness? You’ll need superb skills, nerves of steel and a stone-cold poker face to win the pot in this latest version of World Championship Poker featuring Howard Lederer: All-In.</p><p>Features</p><p>* Play 19 of today’s favorite poker variations from Texas Hold’em and Five-Card Stud to Deuce-to-Seven Triple Draw and Razz<br>* Compete against the amazing likenesses, play styles and signature personality traits of six of the world’s best professional poker players<br>* Become your own card champion with an enhanced Create-a-Character mode including more variations of skin tone, clothes, hats, and accessories<br>* Experience an enhanced look-and-feel, with more realistic characters and advanced animations something happening all the time!<br>* Discover six new themed poker environments to host the action with multi-table online tournament capabilities<br>* Challenge yourself like never before with smarter AI that actually thinks ahead</p>"},{"name":"World Championship Pool 2004","year":2004,"developer":"Blade Interactive Studios Ltd.","url":"PS2_COLLECTION_PART27/World%20Championship%20Pool%202004%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1306307855,"score":7,"genres":"Sports > Pool / snooker > Licensed","desc":"<p><em>World Championship Pool 2004</em> is a pool game similar to the World Championship Snooker series and working under the same engine.</p><p>Both single-player and multiplayer gameplay are available, with six different play modes to choose from. It is possible to compete against real-world pool players, or create custom players to take through the tournament. An aiming mode for beginners is available. Also included are off-beat bonus games such as Minefield.</p>"},{"name":"World Championship Snooker 2002","year":2001,"developer":"Blade Interactive Studios Ltd.","url":"PS2_COLLECTION_PART27/World%20Championship%20Snooker%202002%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":967780895,"score":6.9,"genres":"Sports > 1st-person > 3rd-person (Other) > Pool / snooker > Licensed","desc":"<p><em>World Championship Snooker 2002</em> features a career mode, quick start, single match, tournament, and a special mode that adds new rules to the game. The career mode starts with a training that explains all the basics. Like in the previous game in the series, players can turn on a variety of aiming guides that let them view what way they are aiming and where the balls will bounce.</p><p>There are 65 players to beat in the tournaments of career mode. Once players have made your way to the top 30, they will gain access to the more prestigious championship. A number of professional players such a Ronnie O'Sullivan, Mark Williams and Stephen Hendry are included.</p>"},{"name":"World Championship Snooker 2003","year":2003,"developer":"Blade Interactive Studios Ltd.","url":"PS2_COLLECTION_PART27/World%20Championship%20Snooker%202003%20%28Europe%29.zip","filesize":1154186926,"score":7.2,"genres":"Sports > 1st-person > Top-down > Pool / snooker > Licensed","desc":"<p>The 2003 edition of the snooker series features more than 25 top professional players, including every world champion from the last 11 years. Players can create their own characters and compete in all the major tournaments in Career Mode, earning ranking points and unlocking new features as they progress. It is also possible to play 8 or 9-ball Pool, a Coaching Mode, several mini-games, and a Trickshot Challenge presented by John Virgo, who provides in-game commentary alongside Dennis Taylor.</p>"},{"name":"World Championship Snooker 2004","year":2004,"developer":"Blade Interactive Studios Ltd.","url":"PS2_COLLECTION_PART27/World%20Championship%20Snooker%202004%20%28Europe%29.zip","filesize":1232555800,"score":7.5,"genres":"Sports > 1st-person > Top-down > Pool / snooker > Licensed","desc":"<p>This edition of Codemasters' official licensed snooker game includes over 30 snooker champions and 10 official tournaments.</p><p>The LG Tour is the campaign of the game in which you can make your own player and play against the best of the world to win the championship. To make it easy for beginners and as realistic as possible for those who want it, you can change how much help the program gives you while you play (i.e. a aim-meter). Also included is a tutorial which teaches you everything from the rules to the right angle for a shot. It is possible to make a free game where you get feedback for every shot you make.</p><p>Besides the campaign you can also play 8-Ball &amp; US-9-Ball Pool, trick-snooker, five bonus game-modes (e.g. Against the clock - play a frame with the clock ticking and only a limited amount of time for each shot) and the Classic Match mode, which allows you to play famous games from the history of snooker. </p><p>LAN or online gameplay against up to 16 players is included as well. The names of the best players appear in the hall of fame on the official website.</p>"},{"name":"World Destruction League: Thunder Tanks","year":2000,"developer":"The 3DO Company","url":"PS2_COLLECTION_PART27/World%20Destruction%20League%20-%20Thunder%20Tanks%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1166399125,"score":5.9,"genres":"Action > Behind view > Shooter > Tank","desc":"<p>In a grim, dystopian future, the World Destruction League has become the prime source of entertainment. Television crew is following the participants as they travel across the world, competing in just what the league's name implies: destruction. With their heavily armed tanks, the combatants do not just destroy each other: they lay waste to everything around them...</p><p><em>World Destruction League: Thunder Tanks</em> is a tank combat game that has similarities with BattleTanx games, as well as vehicular combat titles in the vein of Twisted Metal. Single-player gameplay consists of a tournament mode, in which the player selects a tank and takes it through a series of combat matches. The game's focus, however, is on the multiplayer, which includes different modes: deathmatch, capture-the-flag, frenzy, (a capture-the-flag variant with randomly appearing flags), as well as a so-called \"domination mode\", in which players must capture several tank generators scattered across the arena. Up to four players can compete in each of the multiplayer modes. </p><p>Various power-ups can be picked up on the arenas. These include turbo boosts, shields, fire missiles, grenades, mines, artillery and satellite strike (which allow players to target a specific spot on the arena and bombard it with missiles or a focused ion cannon blast), as well as guided missiles, which can be steered through the arena.</p>"},{"name":"World Fighting","year":2003,"developer":"Daft Co., Ltd.","url":"PS2_COLLECTION_PART27/World%20Fighting%20%28Europe%29.zip","filesize":263765646,"score":"","genres":"Action > 3rd-person (Other) > Fighting > Martial arts","desc":"<p><em>World Fighting</em> is a 3D versus fighting game offering several diffrent fighting styles from around the world. Thai boxing meets kung fu meets karate meets wrestling in four different \"fighting arenas\" actually being regular boxing rings with varying colours. Ten different fighters with individual and unique characteristics can be selected for a versus match against a friend, the tournament or a survival match. There also exists a training mode to exercise techniques and moves before entering true fights.</p>"},{"name":"World Heroes: Anthology","year":2007,"developer":"ADK Corporation","url":"PS2_COLLECTION_PART27/World%20Heroes%20Anthology%20%28Europe%29.zip","filesize":1697980902,"score":6.6,"genres":"Action > Compilation > Side view > Fighting","desc":"<p>This is a compilation of the four games in the World Heroes series:<em> World Heroes</em> World Heroes 2<em> World Heroes 2 JET</em> World Heroes Perfect</p><p>The game also allows you to remap controls, edit the character colors, choose between an original or an arranged soundtrack, and access a special training mode. Another new feature is the ability to see your character's move list while playing the game.</p><p>The Japanese version of the game allows you to play against other users via the KDDI Matchmaking Network. This feature is not available outside of Japan.</p>"},{"name":"World of Outlaws: Sprint Car Racing 2002","year":2002,"developer":"Ratbag Pty, Ltd.","url":"sony_playstation2_w/World%20of%20Outlaws%20-%20Sprint%20Cars%202002%20%28USA%29.zip","filesize":3306781434,"score":8,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Licensed","desc":"<p><em>World of Outlaws: Sprint Car Racing 2002</em> is a game that focuses on the niche motorsport of sprint car racing. The game is for the most part a simulation of real-life racing, with a career mode and a number of customization options. </p><p>The game has a number of different modes to choose from. The most basic of these are the time trial and single race options, both of which are self-explanatory. There is also an arcade championship mode that lets you jump right in and start as part of a professional racing team, complete with your own vehicle and free maintenance. The career mode is the most in-depth of all the options, as it puts you in the shoes of an aspiring sprint car driver. You'll start off with just enough cash to buy a basic car and enter a local event. The goal is to win the event, or at least place high enough in it to begin building your reputation as a racer. One of the keys to success is impressing sponsors, who will offer you contracts if you do well enough. At first, because you're low on funds, you'll have to wait for events to come to your local track. As your wealth and reputation grow, you'll be able to travel to larger events with larger prizes and more visibility. </p><p>Each event consists of a battery of races and a somewhat complicated process of progression and elimination that you'll need to brave on your way to the prize. At the beginning of each championship or career race, you'll have the option of taking a few practice laps to get warmed up. Once you've gotten a feel for the track, you can move on ahead to the qualifying race.</p><p>The qualifying race has you complete three laps around the track. The first is to get you up to speed, while the second and third have you trying to post a good time for each. The times you post in these laps are compared with the times of other qualifying racers, and the starting position of each racer is decided in this way. After you've received your position, you'll move on to one of two heats involving 12 racers each. The heats usually consist of five laps, and the top six cars from each heat move on to the trophy dash, while the bottom six cars from each heat are pushed into the B race. The racers participating in the trophy dash race another five laps or so to vie for a better starting position in the main event. The racers in the B race complete another five laps as well, and the top four cars from this event are brought back into the main event. </p><p>After this somewhat process of elimination and progression, the top 12 cars will compete for the trophy in the main race, which typically consists of 15 to 20 laps. In single player mode, you have your chance to race against the <em>World Of Outlaw</em> drivers, from Steve Kinser to Stevie Smith.</p>"},{"name":"World Poker Tour","year":2005,"developer":"Coresoft, Inc.","url":"PS2_COLLECTION_PART27/World%20Poker%20Tour%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1148432869,"score":6.5,"genres":"Strategy > 1st-person > Cards / tiles > Licensed","desc":"<p>Poker tournament game with six tour-exclusive casinos to choose from. Possibility to create custom poker games with editor or choose from 15 different community poker game types. You can either play against 1000 different AI characters or go on-line and battle other players.</p>"},{"name":"World Racing","year":2003,"developer":"Synetic GmbH","url":"PS2_COLLECTION_PART27/World%20Racing%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":792444451,"score":6.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing","desc":"<p><em>World Racing</em> is a racing game developed in cooperation with DaimlerChrysler AG, allowing players to control various Mercedes-Benz cars.</p><p>The game features 117 different tracks throughout 7 large terrains (Nevada, Japan, Mexico, Australia, the Alps, the City, and the Test Centre). Players can drive more than 100 original Mercedes-Benz cars, including classic Silberpfeile and Mercedes-Benz SLR McLaren. Different mission types include Sport Runs, Training Sessions, Test Runs, Checkpoint Races, Endurance Contests and others.</p><p>Players can customize AI skill level and simulation precision (from arcade to real simulation). In dynamic AI skill mode computer opponents will adapt to the player's skill.</p>"},{"name":"World Racing 2","year":2006,"developer":"Synetic GmbH","url":"PS2_COLLECTION_PART27/World%20Racing%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1602273952,"score":6.6,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p>Compared to its predecessor, where players could only drive different Mercedes Benz cars, this sequel allows them to control over 90 different cars from 17 different manufacturers, such as Alfa Romeo, Morgan, and others.</p><p>The core of the game is the career-mode with 120 races which take players all around the globe, from Italy to Florida, where players can earn their 'Speedbucks' to buy new cars and tuning options.</p><p>The game also features oncoming traffic and a detailed damage model including realistic driving physics. Players can also customize their cars with vinyls, alloy rims and many other extras.</p>"},{"name":"World Series Baseball 2K3","year":2003,"developer":"Exile Interactive Inc.","url":"sony_playstation2_w/World%20Series%20Baseball%202K3%20%28USA%29.zip","filesize":1018136111,"score":8.4,"genres":"Sports > 3rd-person (Other) > Diagonal-down > Direct control > Multiple units/characters control > Baseball > Licensed","desc":"<p><em>World Series Baseball 2K3</em> is a follow-up to World Series Baseball 2K2. This installment of the series includes several new features:</p><ul><li>The new ESPN broadcast license allows improved replay and cutscenes, adding further realism to the presentation of baseball</li><li>Hall of Fame legends join the complete list of MLB teams, players and coaches, along with retro and alternate uniforms for all teams.</li><li>Some of the classic ballparks from yesteryear are fully featured, including Crosley Field and Griffth Stadium.</li></ul><p>Other additions and enhancements include improved animations for players, a new jump button for outfield catches, a full list of MLB awards to win during the regular season and playoffs, and updated team lists including the latest rookies and trades made during the offseason.</p>"},{"name":"World Series of Poker","year":2005,"developer":"Left Field Productions, Inc.","url":"PS2_COLLECTION_PART27/World%20Series%20of%20Poker%20%28Europe%29.zip","filesize":303219263,"score":5.9,"genres":"Gambling > Strategy > 3rd-person (Other) > Top-down > Cards / tiles > Licensed","desc":"<p>The official game of the premier poker tournament, <em>World Series Of Poker</em> allows you to take on some of the greatest poker players in 26 different poker games, earn WSOP bracelets and earn a place in the \"WSOP Hall of Fame\".</p><p>During tournaments, you take part in several tables en route to the final table. Each table consists of 8 players that are automatically replenished with new players when numbers dwindle.Once the tournament is down to the last 16, you move onto the \"featured table\", and once down to the last 8, you move onto the final table, where the winner will be decided.</p><p>Several famous poker players make an appearance in game including Chris \"Jesus\" Ferguson, Men the Master and Jennifer Tilly.</p>"},{"name":"World Series of Poker 2008: Battle for the Bracelets","year":2007,"developer":"Left Field Productions, Inc.","url":"PS2_COLLECTION_PART27/World%20Series%20of%20Poker%202008%20-%20Battle%20for%20the%20Bracelets%20%28Europe%29.zip","filesize":2717328706,"score":7.4,"genres":"Gambling > Strategy > Cards / tiles > Licensed","desc":"<p>Players are invited to the 2008 World Series of Poker not only to win championship bracelets and the famous $10000 Main Event, but also to obtain the coveted title of Player of the Year. </p><p>Poker star Phil Hellmuth headlines this game along with 32 other famous pros including Mike Matusow, Johnny Chan, Chris Ferguson, Annie Duke and Clonie Gowen. Also, Lon McEachern and Norman Chad return once again to provide their commentary.</p><p>Texas Hold'em, Omaha, Seven Card Stud, and Razz are featured in all World Series of Poker events, including the cash games. This game also features a custom Create-a-Player, interactive tutorials by Phil Hellmuth, and the ability to play online against other players.</p>"},{"name":"World Series of Poker: Tournament of Champions","year":2006,"developer":"Left Field Productions, Inc.","url":"sony_playstation2_w/World%20Series%20of%20Poker%20-%20Tournament%20of%20Champions%20-%202007%20Edition%20%28Europe%2C%20Australia%29.zip","filesize":1088663650,"score":6.5,"genres":"Gambling > Strategy > Cards / tiles > Licensed","desc":"<p>The second installment of the <em>World Series of Poker</em> video game franchise takes a story-based approach, as players are guided through the circuit under the tutelage of a renowned professional poker player, Chris Ferguson. Players can test their Hold'em skills against over 30 professional players, competing in circuit events to qualify for the Tournament of Champions at the Rio Resort in Las Vegas. </p><p>The game also includes other poker variants: Omaha, Omaha Hi-Lo, Seven Card Stud, Seven Car Hi-Lo, Razz and HORSE. Via the Xbox Live Vision Camera, players can map their own faces into the Xbox 360 version for both single player and multiplayer game modes.</p>"},{"name":"World Snooker Championship 2005","year":2005,"developer":"Blade Interactive Studios Ltd.","url":"PS2_COLLECTION_PART27/World%20Snooker%20Championship%202005%20%28Europe%29.zip","filesize":1434650208,"score":7.4,"genres":"Sports > 1st-person > 3rd-person (Other) > Pool / snooker > Licensed","desc":"<p><em>World Snooker Championship 2005</em> continues the World Championship Snooker series. Like its predecessors, it features professional players; this time the 100 top players from all over the world, such as Ronnie O'Sullivan, Stephen Hendry, Matthew Stevens and Paul Hunter. Authentic locations, including the Crucible Theatre, from the 2004/2005 season are represented in the game. There are multiple game modes to play with, including an unlockable League of Champions which allows you to replay past events. As a bonus you can also play Pool, Billiards and Bar Billiards. The game enables you to create your own character.</p><p>Commentary in the game is provided by Steve Davis, John Virgo and John Parrott.</p>"},{"name":"World Snooker Championship 2007","year":2007,"developer":"Blade Interactive Studios Ltd.","url":"PS2_COLLECTION_PART27/World%20Snooker%20Championship%202007%20%28Europe%29.zip","filesize":1406143006,"score":6.8,"genres":"Sports > 1st-person > 3rd-person (Other) > Pool / snooker > Licensed","desc":"<p><em>World Snooker Championship 2007</em> continues the World Championship Snooker line of games. The game recreates 20 real-life snooker tournaments. Players can create their own character and compete against (or play as) professional snooker players such as: Shaun Murphy, Ronnie O'Sullivan, Efren Reyes and Earl Strickland. Game modes include Snooker, 8 Ball, 9 Ball and Trick-shot. This latest edition includes improvements on the visual aids the player can turn on. The player is now able to see where the cue ball will end up after his shot.</p><p>In-game commentary is provided by John Parrot, John Virgo and Steve Davis.</p>"},{"name":"World Soccer: Winning Eleven 6 International","year":2002,"developer":"Digitalware, Inc.","url":"sony_playstation2_w/World%20Soccer%20Winning%20Eleven%206%20-%20International%20%28USA%29.zip","filesize":1817679720,"score":7.9,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p>This is Konami's second soccer (European football) simulation for the Playstation 2. Choose one of the 54 international or 16 leagues teams (plus 7 hidden ones), to participate basically in any kind of tournament you wish, from friendship games to world cup, with a vast choice of customizable tournaments. You can create your own players with personal statistics, and then put them into any team. You can also play legendary teams, for example, Brazil with Pele, Argentina with Maradona, etc.</p>"},{"name":"World Soccer: Winning Eleven 7 International","year":2003,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"sony_playstation2_w/World%20Soccer%20Winning%20Eleven%207%20-%20International%20%28USA%29%20%28En%2CEs%29.zip","filesize":2738431375,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p>The third installment of the Pro Evolution Soccer series, with improved graphics and a bigger Master League. Because the Master League is so big, it's split into 4 zones with 2 divisions, and cup competitions in each zone. Other than most of the Italian teams, club names are fictional, as are many of the players. However, the game has an improved edit mode, so you can edit the team's name, flag, logo, shirts, and stadium.</p><p>You can use the 'shop' system to unlock hidden features such as classic teams. The game also has a training mode, and a challenge mode, in which you have to dribble around cones as quick as you can. Replays can be fast-forwarded and rewound, and the view can be rotated. The advantage rule is now implemented, so a foul will only stop play if the fouled team suffers from it.</p>"},{"name":"World Soccer: Winning Eleven 7 International (Adidas Premium Package)","year":2004,"developer":""},{"name":"World Soccer: Winning Eleven 8 International","year":2004,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"sony_playstation2_w/World%20Soccer%20Winning%20Eleven%208%20-%20International%20%28USA%29%20%28En%2CEs%29.zip","filesize":1799083902,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p>The new Pro Evolution Soccer has over 3000 licensed players,and Fully Licensed Leagues &amp; teams from Serie A (Italy), Liga Espanola (Spain), &amp; Eredivisie (Holland). So this new PES has definitely improved on the License front. There's also full leagues of  England, France &amp; Germany.  Also there is a revampedMaster League, and this time you don't have to start with them stupid rubbish Default players, you can start with the proper team!!!Still if you want a challenge you can choose to start the ML with the default players. Another thing you can create your very own team,and play against the world in the Master League, and you get toswap the Default players, for half-decent ones!It's not just the master league that's changed in the Edit mode,you get to edit or change the player's goal celebrations!Another feature is the PES Shop, you acquire points to unlock bonuses! </p>"},{"name":"World Soccer: Winning Eleven 9","year":2005,"developer":"Konami Digital Entertainment Co., Ltd.","url":"sony_playstation2_w/World%20Soccer%20Winning%20Eleven%209%20%28USA%29%20%28En%2CEs%29.zip","filesize":2246260394,"score":8.3,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer > Regional differences","desc":"<p>Pro Evolution Soccer 5 pushes the franchise one level up towards realism by expanding and improving character moves and control. Now, the match feels more real to the actual play as players make mistakes more often and passes don't go too well if the player is on the wrong foot, or makes a bad turn. The new gameplay may require slight adjustment for players to switch from older versions to this one. The standard modes are here, match mode (with newly added memorial match), various leagues, and cups. Some more teams now have their proper names (like \"Arsenal\" and \"Chelsea\"), and are having up to date players in the teams. Also, new weather condition has been added, snow.</p>"},{"name":"World Super Police","year":2005,"developer":"Dual Corporation","url":"PS2_COLLECTION_PART27/World%20Super%20Police%20%28Europe%2C%20Australia%29.zip","filesize":1203345806,"score":"","genres":"Racing / Driving > Behind view > Automobile","desc":"<p><em>World Super Police</em> is a single player police pursuit game.</p><p>The story behind the game is that normal police cars cannot catch criminals in really fast cars so, in order to combat increasing car crime, the World Super Police (WSP) have been formed. There are two strands to this game, one based around the Blue Wing group (WSP Japan) and the other around Red Hawks (WSP USA). In each strand there is a story but the missions are basically the same, the player's car sits firmly in the centre of the screen at the bottom and the scenery rushes by. On the left of the screen is a vertical bar which gives a 'radar' view the road ahead  </p><p>The object is to keep the car on the road, travel as fast as possible avoiding other traffic, and take-out the bad guy with whatever weapons the player equipped their car(s) with. This involves racing for a minute or so until the target(s) show up on the radar at which point the felonious fiend must be stopped before they reach the border. Some missions are solo and unarmed, while in others the player is accompanied by fellow WSP in super cars and they can switch between offensive and defensive formations.</p><p>The game's main menu also features a Training option which, unusually, is greyed out at the start of the game and can only be accessed once the player has completed one or more missions in either story. The menu also has a Royal Scramble option in which the player can replay old missions, naturally this too can only be accessed once the player has completed one or more missions</p>"},{"name":"World Tour Soccer 2002","year":2001,"developer":"Team SOHO","url":"sony_playstation2_w/World%20Tour%20Soccer%202002%20%28USA%29.zip","filesize":417877154,"score":7.4,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer","desc":"<p><em>World Tour Soccer 2002</em> continues the <em>World Tour Soccer</em> (<em>This is Football</em>) series. Features include a full season mode with promotion, relegation and qualification for European tournaments, as well as 320 Club and International teams. The game is endorsed by FIFPro, the International Federation of Professional Footballers.</p><p>The game has four levels of difficulty, matches can range from four to twenty minutes and can be played during the day or at night in a variety of weather conditions. The player can play one or two player exhibition matches or compete in either national seasons or international competitions. However the player cannot compete in all national seasons, only the English, Spanish, Dutch, French, Italian, German, Scottish, Belgian and Portuguese are available. The international competitions are the World Cup, Euro Cup, South America Cup, America Cup, Africa Cup, and Asia Oceania Cup; plus there are six Special Competitions for superteams, timewarp teams, custom and school teams.</p><p>The national teams available are:* European: Austria, Belgium, Bulgaria, Croatia, Czech Republic, Denmark, England, Germany, Greece, Hungary, Irish Republic, Israel, Italy, Lithuania, N. Ireland, Netherlands, Norway, Poland, Portugal, Romania, Russia, Scotland, Slovakia, Spain, Sweden, Switzerland, Turkey, Wales, and Yugoslavia.</p><ul><li>South American: Argentina, Bolivia, Brazil, Chile, Columbia, Ecuador, Paraguay, and Uruguay.</li><li>Americas: Canada, Costa Rica, El Salvador, Honduras, Jamaica, Mexico, Trinidad and United States.</li><li>African: Cameroon, Egypt, Ghana, Morocco, Nigeria, South Africa, Tunisia, Zambia.</li><li>Asian: Australia, China, Iran, Japan, New Zealand, Saudi Arabia, South Korea, U.A.E.</li></ul><p>National leagues include the Belgian League, Dutch League, English League, English Division 1, French Divisions 1 &amp; 2, German League, Italian League, Portuguese League, Scottish League, Spanish League. In addition there is a Super Team which is the best players in Europe, Timewarp Teams ranging from 50's Madrid through to 90's São Paulo, Euro Clubs 1 containing teams from Athens to Istanbul F, Euro Clubs 2 containing teams Kiev to Zurich, World Club Cup teams and School Teams.</p><p>The player can edit any team, or create their own team based on any existing team.</p>"},{"name":"World Tour Soccer 2003","year":2002,"developer":"SCEE Studio London","url":"sony_playstation2_w/World%20Tour%20Soccer%202003%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.zip","filesize":2107777902,"score":7.5,"genres":"Sports > 3rd-person (Other) > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p><em>World Tour Soccer 2003</em> allows you to play with or against teams from 15 different national leagues including over 13,500 FIFPro players from 700 international and league teams. Compete in a total of 10 different stadiums from around the world with weather and daytime options.</p><p>Features include creating your own custom team, playing whole seasons, player careers, tournaments, or international and challenge modes. Edit teams and players as you please. Keep in touch with your records and be sure to check your trophy cabinet to see your accomplishments and cheats unlocked.</p><p>The full range of competitions that the player can compete in is* A full season in the Argentinean, Belgian, Brazilian, Dutch, English, French, German, Italian, Japanese, Korean, Mexican, North American, Portuguese, Scottish or Spanish leagues. <br>It's not just the top division from each country that's available, for example the Dutch season consists of eighteen teams in the 1st division, eighteen teams in the second division, the Dutch cup with thirty-two teams, the Inter Euro Cup with twenty-four teams, the Euro Club Cup with sixty four teams, The Euro Super League with thirty two teams, the Euro Super Cup, and the World Club Cup. Naturally many of these competitions apply to other nations as well.<br>Any of the international teams or club teams can be customised and the customised teams can be used in these competitions</p><ul><li><p>Competitions include the World Cup, Euro Cup, South Americas Cup, America's Cup, Africa Cup, and the Asia Oceania Cup. Here the player selects a nation and plays other national sides.</p></li><li><p>In the Custom Competition option the player can create their own league or cup competition or play in the Time Warp Cup or Time Warp Leagues as one of the classic teams of years gone by. The Timewarp teams available are from the 1950's Madrid; from the 60's Glasgow, Lisbon, Manchester and Milano; from the 70's Amsterdam, Bayern, Brussels, Glasgow Rangers, Highbury, Liverpool, New York and St Etienne; fro m the 80's Milan, Nottingham Forest, Turin; From the 90's Barcelona, Marseilles, Nagoya, Sao Paulo and 1994 Korea.</p></li><li><p>The Career mode starts in the English schools league with teams like Hedley Walter, Horsenden, London Nautical. Here the player can change the team strip, manager name, player appearance etc and take the team to greatness. Naturally these matches start off being played on school playing fields which makes a change from the usual football stadiums</p></li><li><p>Finally there is the Exhibition match option where the player can play in any of the major stadiums, the school pitches are not available here, selecting any of the international teams or club teams from the leagues listed above. There's also a group of 'Other Teams' available in this game option which includes sixty or so teams such as Al Ahly and Athens through to Zagreb and Zurich.</p></li></ul><p>All matches can be played in four difficulty settings and matches can be from four to twenty minutes long, other configuration options are available. The trophy room allows the player to collect all trophies, there are twenty seven vacant slots available for an English Premier division club, at each of the game's difficulty settings</p>"},{"name":"World Tour Soccer 2005","year":2004,"developer":"SCEE Studio London","url":"sony_playstation2_w/World%20Tour%20Soccer%202005%20%28USA%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":1565794988,"score":7.2,"genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p><em>World Tour Soccer 2005</em> (<em>This is Football 2004</em> in the UK) is an installment in the perennial soccer series. It features over 900 International teams, as well as over 18000 different players from 30 different divisions and 22 leagues. It also has classic teams to choose from, such as 1990's Barcelona Team, 1980's Milan team and the 1970's Liverpool Team.</p><p>There are four modes to compete in: Exhibition, Season, Career and Challenge as well as competing in World and Euro Cups. The game has enhanced graphics, an updated trading system, a revamped control scheme (compared to the previous incarnations of the series) and new updated stadiums.</p>"},{"name":"World Tour Soccer 2006","year":2004,"developer":"SCEE Studio London","url":"sony_playstation2_w/World%20Tour%20Soccer%202006%20%28USA%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":1844972499,"score":6.6,"genres":"Sports > 3rd-person (Other) > Top-down > Football (European) / Soccer","desc":"<p>This is the 2005, and last, edition of the This is Football game series.</p><p>It allows you to take an existing team and take control of them and guide them through a season by season basis. You can also create a new team, mold it in every detail, from kit to player. From there, you start off in the school league and earn league titles and promotions through the national leagues of your choice.</p><p>As well as leagues, you can take part in all the major club and international knock out tournaments, such as the Champion's League, Euro Club Cup and the World Cup.</p><p>It also now includes the ability to create a digital mask of yourself using the EyeToy play camera and apply it to a new player or any existing player of your choice.</p>"},{"name":"World War Zero: Iron Storm","year":2004,"developer":"Rebellion Developments Ltd.","url":"PS2_COLLECTION_PART27/World%20War%20Zero%20-%20IronStorm%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":920421945,"score":6.3,"genres":"Action > 1st-person > Shooter","desc":"<p>It is the 1960's, and the First World War never stopped being fought. In this alternate reality, war is the only thing powering the global financial markets and warfare is one vast continent wide trench bound slogging match. The player controls a commando sent to try to break the stale-mate. He must cross the front lines and penetrate deep into enemy territory.</p><p><em>World War Zero: Iron Storm</em> is an updated version of Iron Storm. It has enhanced graphics, reworked (mostly simplified) levels, and a few additional weapons, such as a flamethrower and a mini-gun. The Windows release is based on the Playstation 2 version, and retains all the omissions it has compared to the original <em>Iron Storm</em>: no multiplayer, no quick save feature, no optional third-person view, and many cutscenes cut out.</p>"},{"name":"World Wrestling Championship","year":2007,"developer":"","url":"PS2_COLLECTION_PART27/World%20Wrestling%20Championship%20%28Europe%29.zip","filesize":330136702,"score":"","genres":"Sports > 3rd-person (Other) > Wrestling","desc":"<p>In <em>World Wrestling Championship</em> or simply <em>WWC</em> you can choose between a single player mode or a one-on-one match to challenge a friend. For the single mode there is to select from three different game modes such as \"Challenge\" to fight for the championship, \"Friendly Bout\" and \"Practice\".At the beginning you can just choose from 6 different wrestlers that have vague similarities to licensed characters but there are 30 more wrestlers to fight against.You can also select \"View Ranks\" in the menu which shows a gallery of all included wrestlers to find out more about your upcoming opponents.</p>"},{"name":"Worms 3D","year":2003,"developer":"Team17 Software Limited","url":"PS2_COLLECTION_PART27/Worms%203D%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":810468151,"score":7.3,"genres":"Strategy > 1st-person > Behind view > Top-down > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p>As depicted very well by the title of the game, the infamous quarrelsome Worms are squirming for the first time in full 3D.The goal of the game hasn't changed a single bit from its predecessors: the objective is still to crush, annihilate and put into oblivion the worm team of the enemy using massively-wacky weapons of destruction. About all the features of its original 2D ancestors are also present, including random wind and a fully destructible landscape.</p><p>Not all the weapons that were previously available have made the cut into the 3 dimensional realm, however Worms 3D comes too with a selective set of new weaponry such as the Lottery Strike or the Gas Grenade which should allow you to find a few dozen of new ways to kill your fellow worms online.</p>"},{"name":"Worms 4: Mayhem","year":2005,"developer":"Team17 Software Limited","url":"PS2_COLLECTION_PART27/Worms%204%20-%20Mayhem%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1367239182,"score":7.3,"genres":"Strategy > 1st-person > Behind view > Top-down > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p><em>Worms 4: Mayhem</em> is a sequel to Worms 3D. Like its predecessor, it is a turn-based artillery variant with humorous themes and weapons, in which players control small armies of worms. The gameplay is similar to that of the previous game, adding a more developed Story mode, in which the player cooperates with the wise Professor Worminkle, who can use a time machine to travel to different time periods such as American Old West, ancient Arabia, and Prehistoric Age.</p><p>In this installment, players can customize the appearance of their worms, including helmets, glasses, facial hair, gloves, etc. A new mode called \"Weapon Factory\" has been added, allowing players to forge their own weapons. The game also contains a shop where players can purchase various items, using points accumulated by completing story missions or unlocking trophies. Shop items include new maps, accessories, outfits, character voices, etc.</p>"},{"name":"Worms Blast","year":2002,"developer":"Team17 Software Limited","url":"PS2_COLLECTION_PART27/Worms%20Blast%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":277933745,"score":6.7,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Tile matching puzzle","desc":"<p><em>Worms Blast</em> is a puzzle game similar in concept to Puzzle Bobble, with several important distinctions and gameplay features taken from <em>Worms</em> games. Instead of releasing and matching bubbles, the player has to color blocks on a hexagonal grid. Unlike most Bust-A-Move variants, the player character can move right and left, sailing in a boat. Various weapons, such as bazooka, grenades, dynamite, and others, can be used to fire at the blocks, coloring them on impact. Like in the main, artillery-based <em>Worms</em> games, holding down the fire button increases the power of the weapon, affecting the distance it travels. </p><p>If the player hits a block that is either the same color as the missile fired, that block and any other same-colored blocks adjacent to it will be destroyed. Differently-colored blocks will not be affected by shooting at them; however, if they are held solely by a group of blocks of the same color, they will fall into the water when that group disappears. Blocks with rainbows on them can count as any color. Unlike <em>Puzzle Bobble</em>, there are no walls in single-player mode. If the player aims the weapon outside of the screen, a heavy object might fall on the player-controlled boat, damaging it.</p><p>The game's main mode is called \"Puzzle mode\": the player completes various stages, the goal being different in each (e.g. shooting down certain forms of blocks, avoiding hostile blocks that move around the screen, etc.). Beside this mode, the game features a single-player tournament mode with high scores, as well as a variety of multiplayer modes. The action component is particularly noticeable in this mode, since the walls between the areas will periodically open, allowing players to use this opportunity to shoot at each other's boats.</p>"},{"name":"Worms Forts: Under Siege","year":2004,"developer":"Team17 Software Limited","url":"PS2_COLLECTION_PART27/Worms%20Forts%20-%20Under%20Siege%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":398505622,"score":6.4,"genres":"Strategy > 1st-person > Behind view > Top-down > Turn-based > Artillery > Direct control > Multiple units/characters control > Classical antiquity > Egypt (Ancient) > Japan (Ancient/Classical/Medieval) > Medieval > Comedy > War","desc":"<p><em>Worms Forts: Under Siege</em> is a turn-based strategy game where 2 – 4 people battle it out with a team of 4 worms with the help of weapons and forts. Each player takes timed turns bombing, shooting, causing natural and unnatural disasters, punching and blowing up the opponent’s worms. Each worm has a set amount of health and once that health is depleted or the worm drowns that worm is dead.</p><p>New to the series is the ability to construct buildings to aid in the fight. Build hospitals to resurrect dead worms, science labs to increase your firepower, strongholds to base your operations in and protect your worms, towers, keeps, castles and citadels to deploy weapons from their tops and weapon factories to produce multiple weapons around them at the start of each turn you take. Along with these typical buildings you can create Wonders which your opponent has two turns to knock down and if they don’t succeed you win. If they in turn build their own you must destroy it to win the game.</p><p>Along with the typical <em>Worms</em>-style weapons like the mini gun, bazooka, rocket launcher, earthquake and homing pigeon (a homing missile in the form of a pigeon), you will also have weapons to destroy buildings like the trebuchet, fridge launcher, nuclear strike and the Trojan Donkey (which you get to place where you like and it remains there until it explodes, how long it takes to explode is not known). Some weapons like the Old Women and Rhino can be steered to your desired location upon which they explode on contact, or they can be exploded early by pressing a button.</p><p>Throughout the game different crates will fall from the sky or teleport onto the playing field. There are four different types of crates: weapon crates (more powerful weapons); health crates (increase the health of a wounded or sick worm); utility crates, which carry instant utilities such as spy (see contents of all crates on the field), double time (doubling the time for your turn) and double damage (for one turn inflict double the damage); and collectible utilities like freeze (freeze your worms or buildings to protect them from damage for one turn), parachute (so your worm can safely jump from heights), jet pack (to reach distant locations and heights) and repair (to fix damaged buildings). </p><p>Single play allows for a quick game, tutorial, campaign, the trials (death match against the CPU) and the viewing gallery, which allows you to view movies you have unlocked in the game by winning matches, see how much of the game you have completed, check out the credits and look through the Fortapedia (a list of buildings available in the game and their descriptions).</p><p>As with the other <em>Worms</em> games, in multiplayer you have a plethora of options to choose from to set up a match against other people including allowing the CPU to play. Choose schemes (selection of pre-set weapons and game options), landscapes (the type of playing field – Roman, Egyptian, Samurai and Old World), Fortpot (a slot machine that randomly selects three game options from the many available), game settings (wins required, turn time, etc.), worm health and sudden death settings.</p>"},{"name":"Wrath Unleashed","year":2004,"developer":"The Collective, Inc.","url":"PS2_COLLECTION_PART27/Wrath%20Unleashed%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1468529870,"score":6.5,"genres":"Action > Strategy > Diagonal-down > Real-time > Turn-based > Arcade > Fighting > Fantasy","desc":"<p><em>Wrath Unleashed</em> is a strategy game with both turn-based and real-time components, as well as action-oriented battles, similar in concept to Archon: The Light and the Dark. The gods of the four Elements (Water, Fire, Earth, and Wind) inhabit an asteroid belt, the only remnant of their former world, which has been shattered to pieces. The gods are waging war on each other, each trying to reclaim the coveted throne of Gaia. Each of the gods represents an alignment: Light Order, Light Chaos, Dark Order, or Dark Chaos, ranging from the most benevolent to the most evil. Their armies consist of supernatural creatures. The player can choose to command any of the armies, taking it to victory through four campaign missions each.</p><p>In the game's campaign mode, the units are navigated in turn-based fashion over a board of hexagonal spaces, each representing a type of terrain. The main objectives of this strategic part of the game usually involve occupying the opposing army's temples or defeating specific enemies. When two opposing units meet on the same hexagonal space, a battle ensues. The battles take place on large arenas, and are a combination of real-time strategy and pure action. The player can take control of individual fighters and engage in direct arcade-like combat against the opponents.</p><p>Versus and team fighter modes are available, both removing all the strategic elements, retaining only the action battles. Also included is an editor that allows players to create and customize their own soldiers and units.</p>"},{"name":"WRC 3: The Official Game of the FIA World Rally Championship","year":2003,"developer":"Evolution Studios Ltd.","url":"sony_playstation2_w/WRC%203%20-%20The%20Official%20Game%20of%20the%20FIA%20World%20Rally%20Championship%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CNo%2CFi%29.zip","filesize":2806463726,"score":7.1,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Off-roading > Licensed","desc":"<p><em>WRC 3: The Official Game of the FIA World Rally Championship</em> is the third game of the official license <em>World Rally Championship</em>. The player can play the 14 official rallies of the 2003 season, divided in 125 special stages. It gives the player nearly one thousand kilometres of driving. The player has the choice of seven official rally cars (Hyundai Accent wrc3, Citroen Xsara wrc, Peugeot 206 wrc, Ford Focus wrc03, Mitsubishi Lancer Evolution VIII wrc, Subaru Impreza wrc 2003m, and Skoda Fabia wrc) plus thirty-five more to unlock.</p><p>Game modes are Quick Race, Time Trial, and WRC. In the last mode (WRC), the player may enter a simple race or championship either with solo or multiplayer settings. It is also possible to test cars. Gameplay is almost the same of the previous opus, WRC II Extreme.</p>"},{"name":"WRC 4: The Official Game of the FIA World Rally Championship","year":2004,"developer":"Evolution Studios Ltd.","url":"sony_playstation2_w/WRC%204%20-%20The%20Official%20Game%20of%20the%20FIA%20World%20Rally%20Championship%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CNo%2CFi%29%20%28v2.00%29.zip","filesize":2679459980,"score":7.6,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Automobile > Off-roading > Licensed","desc":"<p>The 4th game of the WRC series, <em>WRC 4: The Official Game of the FIA World Rally Championship</em> contains all the official races, drivers and cars of the 2004 season.</p><p>The player can compete in a championship mode, a quick race mode, and a time trial mode. Players can also play the Pro Driver Challenge in which players can experience a career in WRC as they race through the key events in a driver's journey from beginner to the top. Also, a new type of race appears called the Super Special. This unique rally event pits the player against another rally car in a two-lane rally across the super special stage.</p>"},{"name":"WRC II Extreme","year":2002,"developer":"Evolution Studios Ltd.","url":"sony_playstation2_w/WRC%20II%20Extreme%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CFi%29.zip","filesize":4018061796,"score":7.8,"genres":"Racing / Driving > Sports > 1st-person > 3rd-person (Other) > Automobile > Off-roading > Licensed","desc":"<p><em>WRC II Extreme</em> is the sequel to WRC World Rally Championship, in a series officially sponsored by the FIA. The game features improved graphics and visible damage to the cars. All 14 official WRC events are available to race on, from Monte Carlo to Kenya to Argentina. Over 800 kilometers of track to race on are available, from mountains to forests to snow, all created from satellite data. </p><p>There are 7 official WRC teams featuring 21 drivers, including the likes of Tommi Makinen, Richard Burns, and Carlos Sainz. Drivers and co-drivers faces have been re-created in game, using facial technology, as have the actual voices of co-drivers. Players can unlock \"Extreme\" bonus vehicles created by WRC designers for a look at the possible future of rally driving.</p>"},{"name":"WRC World Rally Championship","year":2001,"developer":"Evolution Studios Ltd.","url":"sony_playstation2_w/WRC%20-%20World%20Rally%20Championship%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CFi%29.zip","filesize":2526392203,"score":7.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Off-roading > Track racing > Licensed","desc":"<p><em>WRC World Rally Championship</em> is a rally game that features licensed FIA cars, tracks, and drivers of the 2001 racing season. While the game has full single and multiplayer options, most of the play centers around a detailed career mode where an entire racing season can be experienced.</p><p>To start, the game allows the selection of a professional rally car (from a set of 7) and a driver. Selecting a driver also includes the co-driver/navigator that assists during the actual races. Playing an actual season involves completing 14 events in the game's 80+ tracks. Each track matches its real world counterpart and rendered in accurate terrain and weather detail - asphalt to dirt roads to rocky trails.</p><p>In addition to the normal driving controls and feedback common to most racing games, the game adds a simple car damage system that not only affects the visual appearance (muddied paint, busted lights) of the vehicles but also the gameplay. A particularly brutal race for instance, might leave the car listing and handling poorly towards the end of the event.</p><p>Two players can compete in a time-based competition.</p>"},{"name":"WRC: Rally Evolved","year":2005,"developer":"Evolution Studios Ltd.","url":"sony_playstation2_w/WRC%20-%20Rally%20Evolved%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CNo%2CFi%29%20%28v2.00%29.zip","filesize":3431560109,"score":7.8,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Off-roading > Licensed","desc":"<p><em>WRC: Rally Evolved</em> is the fifth game of the <em>WRC</em> series. It features game modes commonly found in a rally game: quick races, single rally, and full championship. New modes include Rally Cross, a race on a multi-lap track in solo or multi-player (four players on the same screen or sixteen through the internet). Another new mode involves challenging the multiple French world champion of WRC, Sebastien Loeb, in a list of races where the player starts with a time handicap. A final mode gives the ability to free-run on a big complex on different kinds of road in the middle of a big oval track to test more than forty rally cars, coming from past, present and future.</p><p>This installment of the series has enhanced features compared to the previous game. Navigator voice acting is more precise, and gameplay has a new feature: environmental hazards that affect the race, such as fire, rocks, animals or other competitors, which must be avoided.</p>"},{"name":"Wreckless: The Yakuza Missions","year":2002,"developer":"Bunkasha Games","url":"PS2_COLLECTION_PART27/Wreckless%20-%20The%20Yakuza%20Missions%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":1289950243,"score":6.4,"genres":"Action > Racing / Driving > 1st-person > 3rd-person (Other)","desc":"<p>The updated port of the original Xbox version of Wreckless: The Yakuza Missions adds several new features. Missions are now ranked based on how quickly they are completed, and fast times reward medals. By completing a bonus objective on hard mode, such as destroying traffic, a bonus mission will be unlocked. Earning a gold medal in a bonus mission will further unlock a cheat code, like unlimited time or low gravity. A free mode is available now too, allowing the player to drive through the city without worrying about a time limit. Finally two new features have been added to the cars: an adrenaline feature that slows down time, and a limited supply of short-range missiles.</p><p>A new multiplayer mode allows two players to play on a single screen, with the camera following the trailing player. Different modes are available, such as a mode where the trailing car attempts to ram the leading car, or a normal racing mode.</p>"},{"name":"Wrestle Angels Survivor","year":2006,"developer":"Success Corp.","url":"sony_playstation2_w/Wrestle%20Angels%20Survivor%20%28Japan%29.zip","filesize":1046946099,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Anime / Manga > Turn-based > Managerial / business simulation > Wrestling","desc":"<p><em>Wrestle Angels Survivor</em> is a wrestling management simulation and a reboot of the long-dormant Wrestle Angels series. Eschewing the involved story modes of the later PC titles, <em>Survivor</em> focuses on the simulation and management elements and on individual wrestlers. The player takes the part of a wrestling association president, recruiting and training wrestlers, sending them to matches and other events, and even directing them during matches.</p><p>The main mode is the Association mode, where the player must build a team of wrestlers and their company from scratch. The player sets the number of rival associations, the length of the campaign in years, and the number of players -- much like Super Wrestle Angels up to four players can compete against each other to see who can build the top team.</p><p>The game is broken up into months, which each have an office/gym phase and an event phase. In the first phase, the player can recruit or retire wrestlers, schedule training and events, directly coach individual wrestlers, and do a variety of training and business-related tasks. In the event phase, the scheduled events are played out, including exhibition matches and tournaments, and each player can choose to either direct their wrestlers directly with a card-based battle system, or trust their training and put the battle on auto. Depending on the results of each match, the attributes and popularity of both the association and individual wrestlers will change.</p><p>Other modes allow the player to set up free matches of multiple types, including Exhibition, Tournament, and League, with any of the more than 70 wrestlers in the game. There is also a gallery mode where any of the event CG images seen in Association mode can be viewed.</p>"},{"name":"Wrestle Angels Survivor 2","year":2008,"developer":"Success Corp.","url":"sony_playstation2_w/Wrestle%20Angels%20Survivor%202%20%28Japan%29.zip","filesize":1295280457,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Anime / Manga > Turn-based > Managerial / business simulation > Wrestling","desc":"<p><em>Wrestle Angels Survivor 2</em> is the sequel to Success' reboot of the long-running Wrestle Angels wrestling management series. The game follows the same basic template as the previous title, again focusing on the Association mode where the player must recruit a team of wrestlers, training them into the world's top wrestling association. The free match and gallery modes from the original game also return. Compared to the previous title, there are numerous tweaks and updates to the training system, as well as many new wrestlers to recruit bringing the total cast to over 100, but the basic gameplay and progression are identical.</p><p>All preorders included a \"Doki Doki Angel Voice\" character voice CD. The first-print limited edition also includes a bonus \"Panic Live Angels\" music and drama CD, and comes packed in a cardboard slipcase with different artwork.</p>"},{"name":"Wrestle Kingdom","year":2006,"developer":"Yuke's Co. Ltd.","url":"sony_playstation2_w/Wrestle%20Kingdom%20%28Japan%29.zip","filesize":2011277990,"score":"","genres":"Action > Sports > 3rd-person (Other) > Fighting > Direct control > Wrestling","desc":"<p><em>Wrestle Kingdom</em> is a licensed wrestling game using a modified version of the engine used for the WWE: Day of Reckoning series. The gameplay is a mix of a realistic wrestling simulation with some arcade action elements. The career mode is called the Drama mode. Players create a wrestler and train under top stars to earn a promotion. By training the stats are improved and that makes it possible to unlock new moves.</p><p>The roster includes wrestlers from New Japan Pro-Wrestling, All Japan Pro Wrestling and Pro Wrestling Noah, as well as legends and freelancers. The wrestlers Brock Lesnar and Giant Bernard are exclusive to the PlayStation 2 version of the game, and Kazuyuki Fujita is exclusive to the Xbox 360 version.</p>"},{"name":"WTA Tour Tennis","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"PS2_COLLECTION_PART27/WTA%20Tour%20Tennis%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":206984754,"score":6.2,"genres":"Sports > Diagonal-down > Direct control > Tennis > Licensed","desc":"<p>Play with The Pros!<br>Serve up action with up to 4 players<br>Challenge the pros including Serena Williams, Martina Hingis and Jelena Dokic<br>Lifelike graphics with intuitive controls<br>Track your success with statistics on all aspects of your game<br>10 locations around the world<br>3 court surfaces affecting ball dynamics</p>"},{"name":"WWE All Stars","year":2011,"developer":"THQ San Diego","url":"sony_playstation2_w/WWE%20All%20Stars%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1429022422,"score":7.2,"genres":"Action > Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWE All Stars</em> can be seen as a successor to WWF Wrestlemania: The Arcade Game. Unlike the simulation-based WWE SmackDown vs. Raw  games, it offers a more arcade-oriented gameplay, featuring elements of fighting games, with over-the-top moves and unrealistic animation. </p><p>Similarly to versus fighters, the wrestling in the game is predominantly combo-based. The wrestler's signature moves are exaggerated, including nearly supernatural elements such as diving high into the air or slow motion moves. The game features popular WWE wrestlers from its time, such as Triple H, The Undertaker, Rey Mysterio, Big Show and John Cena, as well as WWF wrestlers from the past: Hulk Hogan, Bret Hart, The Ultimate Warrior, Jake the Snake and the \"Macho Man\" Randy Savage.</p><p>The game includes a Path Of Champions mode, where players can choose a WWE Legend or Superstar to either become the WWE Champion, the World Heavyweight Champion, or the WWE Tag Team Champions.</p>"},{"name":"WWE Crush Hour","year":2003,"developer":"Pacific Coast Power and Light","url":"PS2_COLLECTION_PART27/WWE%20Crush%20Hour%20%28Europe%29.zip","filesize":968409764,"score":5.8,"genres":"Action > Racing / Driving > 3rd-person (Other) > Shooter > Licensed","desc":"<p>Despite what its title might imply, <em>WWE Crush Hour</em> is not a wrestling game. It takes the best wrestlers of World Wrestling Entertainment out of the usual ring of body slams and into an even bigger ring of rocket fire and engine fumes.</p><p>The game has the WWE crew in their own combat vehicles, in battles of fire power and crazy stunts. The likes of The Rock and the Hardy Boys are represented, each with a varying amount of special attacks, weapons and moves under the hood of their vehicle. Simply dive head long into the battle and be the victor at the end.</p><p>Game modes range from a simple defeat-the-enemy style to challenges that have the player character holding the championship belt for the longest amount of time without blowing up, or taking out the most opponents in the limited amount of time. Multiplayer support is also included.</p>"},{"name":"WWE Smackdown vs. Raw","year":2004,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART27/WWE%20SmackDown%21%20vs.%20Raw%20%28Europe%2C%20Australia%29.zip","filesize":2583406043,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Wrestling > Licensed","desc":"<p>In the sixth installment of the <em>WWF / WWE Smackdown</em> series, and the first to feature <em>Smackdown vs. Raw</em> in the title, players can compete in six-man contests with the help of a multi-tap. Match types include Hell in the Cell, Slobber Knocker, Table Matches, First Blood, and the new Parking Lot Brawl mode. Visually, the game has been given a boost, featuring more detailed character models and costumes, with a continued emphasis on facial recreation and animation. WWF superstars of former years have been reinstated for the roster as well, with the likes of Bret \"The Hitman\" Hart, \"Rowdy\" Roddy Piper, Andre The Giant, \"Superfly\" Jimmy Snuka, and others.</p>"},{"name":"WWE Smackdown vs. Raw 2006","year":2005,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART27/WWE%20SmackDown%21%20vs.%20Raw%202006%20%28Europe%2C%20Australia%29.zip","filesize":3004948534,"score":8.1,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>This installment of the <em>Smackdown</em> series continues the <em>Smackdown vs. Raw</em> era, which now uses a yearly date in the title, similarly to other sports titles.</p><p>The game includes an updated roster of wrestlers, as well as many classic superstars like Bret Hart or British Bulldog. It also includes many new arenas from recent Pay-Per-Views, as well as a classic arena from Wrestlemania 9. A new recorded dialogue for many of the wrestlers is featured in the storyline, as the player goes through many different plots in the Season Mode, chasing the championship belts.</p><p>Gameplay has been slightly enhanced, with a larger list of moves available to each wrestler, and pre-match mini-games to start your fight off with and determine who has the upper hand.</p><p>Another addition is the General Manager Mode, where the player takes the role of a GM trying to book a weekly show. Taking into account costs to contract wrestlers, keeping a chosen wrestler happy and healthy, and putting on matches and setting up feuds to keep the ratings for the show high are the objectives of this mode.</p><p>It is also possible to earn Smackdown Dollars in the game, which the player can use to buy new moves, new create-a-wrestler items, Legends wrestlers, and even furniture to customize a locker room. The player can also earn trophies for his trophy case by completing challenges and beating the GM Mode.</p>"},{"name":"WWE Smackdown vs. Raw 2007","year":2006,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART27/WWE%20SmackDown%20vs.%20Raw%202007%20%28Europe%2C%20Australia%29.zip","filesize":3597335691,"score":7.8,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWE SmackDown vs. Raw 2007</em> is the third installment of the <em>WWE SmackDown vs. Raw</em> series. As with most installments of the series, the roster has been updated to include new wrestlers for the season. The game also features a new Analog Control Grappling System, which makes fighting more realistic, allowing more precise movement and elements of control. An enhanced Season Mode provides multiple branching storylines and numerous levels of player choice, as well as over a dozen environmental hotspots.</p>"},{"name":"WWE Smackdown vs. Raw 2008","year":2007,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART27/WWE%20SmackDown%20vs.%20Raw%202008%20%28Europe%2C%20Australia%29.zip","filesize":3158192681,"score":7,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>The 2008 edition in the <em>Smackdown vs. Raw</em> series holds new features to the WWE game franchise. This is the first in the series to include the extremists of ECW, including The Sandman, Marcus Cor Von and CM Punk.</p><p>The game also features a new struggle submission system, new weapon choices including guitars, and eight superstar fighting styles, including Showman, Powerhouse, High-Flyer and more. Each player can now choose a primary and a secondary fighting style. It continues the legend trend and new arenas, such as Wrestlemania 23, Unforgiven and Summerslam as well as the classic superstars like Undertaker, Shawn Michaels and Ric Flair. The roster largely depends on the platform, and some versions include wrestlers not available in the other ones.</p><p>The season and general manager modes of the previous games have been merged into the WWE 24/7 mode (PlayStation, Xbox 360), allowing to create a new superstar, play as an existing one or choose to manage someone. In the Wii version this is called Main Event mode, and it does not contain an option to manage wrestlers. </p><p>There is also a new Tournament mode with various challenges. Some of the features match types are Iron Man, Battle Royal, Hell in a Cell, Tables, Ladders, and Chairs match, Hardcore, Ladder, Elimination Chamber and Royal Rumble. In the Wii version five match types are available: Single (One on One), Tag Team (Two on Two), K.O. Match, Triple Threat and Hardcore. It does not have the WWE Shop and a smaller move list, but includes Mii integration (menu screens and in-game HUD) as well as motion-sensing attacks based on the controls.</p><p>The Xbox 360 versions allows players to use custom music during entrances while the PS3 version offers a first-person view during those sequences. Both are the only ones to offer online multiplayer.</p>"},{"name":"WWE Smackdown vs. Raw 2009","year":2008,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART27/WWE%20SmackDown%20vs.%20Raw%202009%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3054802320,"score":7.8,"genres":"Action > Sports > 3rd-person (Other) > Fighting > Direct control > Wrestling > Licensed","desc":"<p>The <em>Smackdown vs. Raw</em> series continues with the 2009 edition. This game features improvements on the tag team action, including a new Hot-Tag mode, tag team finishers, and new actions to help in the match.</p><p>As with the previous game, the roster includes over 60 superstars from Smackdown, Raw and ECW. To keep the roster up-to-date, the game includes a roster editor allowing players to change the superstars on it, as well as change their appearance from face to heel. However, this is also the first game in the <em>Smackdown</em> series since Here Comes the Pain not to feature any legends.</p><p>Another new feature is Create-a-Finisher, which allows players to create their own unique finishing move out of over 500 different animations. These can also be shared online during online matches.</p><p>The game includes two different story modes: Road to Wrestlemania and Career mode. Road to Wrestlemania mode allows the player to experience six unique stories involving the wrestlers Triple H, CM Punk, Chris Jericho, The Undertaker, John Cena, and a co-op storyline featuring Batista and Rey Mysterio. Career mode is the replacement of GM Mode from previous games. This mode allows the player to make a career for superstars and upgrade custom wrestlers.</p><p>Other features include the Highlight Reel, which lets the player create videos from his matches, new Inferno and Gauntlet matches, as well as new positions in the backstage brawl.</p>"},{"name":"WWE Smackdown vs. Raw 2010","year":2009,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART27/WWE%20SmackDown%20vs.%20Raw%202010%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3424702460,"score":8,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>The 2010 edition of WWE SmackDown vs. Raw revamps some of the features of its predecessor, while adding a new Story Designer mode to the series of professional wrestling fighting games. As before, players can control one of the available wrestlers, competing in career matches or in quick single bouts against human or computer-controlled opponents. A custom character can still be created with the Create-A-Superstar tool, now expanded to include 3D apparel and decorations. The Create-A-Finisher feature now has aerial techniques, with jumping trajectory and speed customization.</p><p>Some modifications were made to the gameplay, with more grapple moves and a new training mode for beginners. Instead of using the previous two-button system, reversals are now performed based on timing, where the player has to press the correct button when the icon appears. In the PS3/Xbox 360 versions, players can share online their wrestlers, shows and moves. The PS3 version can upload the highlights reel directly to YouTube.</p>"},{"name":"WWE Smackdown vs. Raw 2011","year":2010,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART27/WWE%20SmackDown%20vs.%20Raw%202011%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2999208760,"score":7.6,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWE SmackDown vs. Raw 2011</em> is a professional wrestling video game that is based on the two brands of WWE, Raw and SmackDown.</p><p>One of the main changes in the game is the incorporation of a new physics system that allows objects to be used more realistically, such as objects involved in the Tables, Ladders, and Chairs match. Tables now break differently depending on the impact placed upon them. Inside and outside the ring, ladders can now be rested onto the ring ropes and be broken in half. For the first time since the original WWE SmackDown! vs. Raw game, chairs can be thrown at your opponents.</p><p>The Hell in a Cell match is revamped with expanded cell walls, weapons underneath the ring, steel steps near the poles, and the cell door is removed. In addition, the game adds new ways to escape the steel cage.</p><p>The game's new \"WWE Universe\" mode replaces the career mode from previous games. The mode builds storylines, and integrates cut scenes and rivalries between wrestlers based on the matches that are wrestled. These cut scenes appear randomly before, during, and after the match.</p><p>Road to WrestleMania mode has been modified to include new features such as backstage roaming, mini-quests, and further interaction with other Superstars. Playable storylines involve Rey Mysterio, John Cena, Christian, and Chris Jericho. Along with that is the new storyline in which players choose Kofi Kingston, John Morrison, Dolph Ziggler, R-Truth, or a created superstar in a quest to end The Undertaker's undefeated WrestleMania streak.</p>"},{"name":"WWE Smackdown! Here Comes the Pain","year":2003,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART27/WWE%20SmackDown%21%20Here%20Comes%20the%20Pain%20%28Europe%29.zip","filesize":3155514828,"score":8.2,"genres":"Sports > Wrestling > Licensed","desc":"<p><em>WWE SmackDown! Here Comes the Pain</em> is a follow-up to WWE SmackDown! Shut Your Mouth, showcasing more than 55 WWE superstars (including Brock Lesnar, Scott Steiner, Rey Mysterio, Bill Goldberg, and others), as well as adding famous wrestlers of former times (\"WWE Legends\") to the roster. </p><p>The game features real-life attributes of strength, submission, technique, speed and stamina for each wrestler. These new attributes allow players to wear down their opponents and take advantage of each Superstar's unique abilities and extensive move sets, expanding the amount of stances to sixteen (as opposed to four in the previous game). The presentation has been enhanced with new camera angles, superstar voiceovers, additional animations, and new arena and crowd elements. </p><p>Players can create, play and develop their own superstar through various storylines staged by the WWE. New match types and modes are available as well. Players can track their progress with seasonal stats, earn money to build up superstar abilities, and unlock hidden features.</p>"},{"name":"WWE Smackdown! Shut Your Mouth","year":2002,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART27/WWE%20SmackDown%21%20Shut%20Your%20Mouth%20%28Europe%29.zip","filesize":3026056680,"score":7.6,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWE Smackdown! Shut Your Mouth</em> features an updated roster with even more World Wrestling Entertainment superstars, including Hollywood Hulk Hogan, Stacy Keble, DDP, Ric Flair, and many more.</p><p>The revamped season mode allows the player to take an untested wrestler through the ranks of the WWE while reliving moments that have happened in the past year of the WWE, such as the co-ownership storyline between Vince McMahon, Ric Flair and the reintroduction of the NWO. Also added is a create-a-wrestler mode that allows the player to customize nearly every physical aspect of their wrestler, including animations.</p>"},{"name":"WWE Smackdown! vs. Raw Superstar Series","year":2008,"developer":""},{"name":"WWF Smackdown! Just Bring It","year":2001,"developer":"Yuke's Co. Ltd.","url":"PS2_COLLECTION_PART27/WWF%20SmackDown%21%20Just%20Bring%20It%20%28Europe%2C%20Australia%29.zip","filesize":2578260549,"score":6.8,"genres":"Sports > Wrestling","desc":"<p><em>WWF Smackdown! Just Bring It</em> is the third installment in the <em>WWF Smackdown</em> series. Like its predecessors, the game allows players to control many real-world WWF wrestlers, as well as create a custom wrestler and train him to become a WWF champion. New modes include six-man tag team matches, as well as six-man and eight-man battle royals (elimination matches), invented specifically for this game. This is also the first game in the series to give each wrestler two finishing moves, as well as allow the player to edit the wrestlers' move sets. The game features many areas to fight outside the ring, such as a parking lot, a dressing room, etc.</p><p>An enhanced Story Mode is included, in which the player can take on the career of any wrestler in the game. The player can fight for titles, accept or reject fight offers, and unlock secrets through the story mode, which include additional playable wrestlers.</p>"},{"name":"WWI: Aces of the Sky","year":2006,"developer":"Na.p.s. Team s.n.c.","url":"PS2_COLLECTION_PART27/WWI%20-%20Aces%20of%20the%20Sky%20%28Europe%29.zip","filesize":67535986,"score":"","genres":"Action > Behind view > Shooter > Flight / aviation > World War I","desc":"<p><em>WWI: Aces of the Sky</em> vehicle based shooter game set during World War I in which the player will control a biplane.</p><p>The game offers thirty missions witch take place above both land and sea. Players will take on enemy aircraft like bombers and other biplanes as well as ships on the sea and trains on land. During missions it’s possible to land on airfields where the plane can be repaired, get new fuel and ammo and even switch planes.</p>"},{"name":"WWII: Battle Over Europe","year":2008,"developer":"InterActive Vision A/S","url":"PS2_COLLECTION_PART27/WWII%20-%20Battle%20over%20Europe%20%28Europe%29.zip","filesize":154189287,"score":"","genres":"Action > Behind view > Shooter > Flight / aviation > Europe > World War II","desc":"<p><em>WWII Battle Over Europe</em> is the sequel to Pacific Warriors II: Dogfight set during the European theater of World War II.</p><p>The game is played from a third person perspective in and lets the player control a fighter plane from either Germany or Britain. Both the British RAF and German Luffwaffe have their own campaign in which the player will battle over Britain and Normandy among others. Players will take on enemy aircrafts as well as ships on the sea. The game offers fifty missions and can be played on three difficulty levels: rookie, veteran and elite.</p>"},{"name":"WWII: Battle Over the Pacific","year":2006,"developer":"Na.p.s. Team s.n.c.","url":"PS2_COLLECTION_PART27/WWII%20-%20Battle%20over%20the%20Pacific%20%28Europe%29.zip","filesize":29251261,"score":"","genres":"Action > Simulation > Behind view > Arcade > Flight / aviation > World War II","desc":"<p><em>WWII: Battle Over the Pacific</em> is a World War II-themed arcade-style flight simulator. The player takes control of a pilot fighting for the Allies to dominate the Pacific. The action is viewed from a third-person perspective. As the free world's only hope, the protagonist fights enemy aircraft, tanks and battle ships, as well as bomb enemy installations. It is possible to land on carriers for rearming, repairing and even switching to another aircraft type.</p>"},{"name":"WWII: Soldier","year":2005,"developer":"Atomic Planet Entertainment Ltd","url":"PS2_COLLECTION_PART27/WWII%20-%20Soldier%20%28Europe%29.zip","filesize":95232477,"score":"","genres":"Action > 1st-person > Shooter > Direct control > Europe > World War II > War","desc":"<p><em>WWII: Soldier</em> is a single player first person shooter in which the player has to rescue a captured American general during World War II. The general is being held in a castle located in the Swiss alps deep in enemy territory and apparently holds vital information regarding the war.</p><p>The game offers can be played on three difficulty levels: easy, normal or hard. Weapons include: a rifle, single or twin pistols, grenades and a sub-machine gun. Useful items can be found b searching killed German soldiers.</p>"},{"name":"WWII: Tank Battles","year":2006,"developer":"InterActive Vision A/S","url":"PS2_COLLECTION_PART27/WWII%20-%20Tank%20Battles%20%28Europe%29.zip","filesize":226424362,"score":"","genres":"Action > Behind view > Shooter > Tank > World War II","desc":"<p><em>WWII: Tank Battles</em> is a single player third person shooter game in which the player controls a Allied or German tank and will take on various missions set during World War II.</p><p>The game offers an Allied and German campaign in which the player will visit among others Normandy, the Ardennes and North Africa. Missions range from protecting ground units to finding enemy bases and can be played on three difficulty levels: rookie, veteran and elite. Several tanks can be chosen including a Tiger tank and Sherman tank.</p>"}]