[{"name":"X Factor Sing, The","year":2005,"developer":"Milestone s.r.l.","url":"PS2_COLLECTION_PART27/X%20Factor%20Sing%2C%20The%20%28Europe%29.zip","filesize":2216325903,"score":"","genres":"Action > Simulation > 3rd-person (Other) > Game show / trivia / quiz > Music / rhythm > Licensed","desc":"<p><em>X-Factor</em> is a single and multiplayer singing game. In real karaoke style, songs appear on your screen and you have to sing the right words at the right time. Onscreen indicators inform you what pitch you need to maintain at any given time. Hit the right notes for the right amount of time, and you'll get high scores.</p><p>As the focus of the game is the TV show atmosphere, special attention has been paid to select a variety of video clips of judge comments and special performances of the show. This way, players need to struggle to achieve a good result and are awarded with special contents from the show. The game also contains Party modes in which players compete by playing a selection of humorous mini-games.</p><p>Both versions of the game are bundled with a USB microphone.</p><p>The tracklist of the game features songs like <em>Superstar</em> (Melanie C.), <em>Shiver</em> (Natalie Imbruglia), <em>Is there something I should know?</em> (Duran Duran), <em>Is this the way to Amarillo?</em> (Tony Christie), and many others.</p>"},{"name":"X Squad","year":2000,"developer":"Electronic Arts Square, K.K.","url":"PS2_COLLECTION_PART27/X%20Squad%20%28Europe%29.zip","filesize":362024470,"score":5.9,"genres":"Action > Behind view > Shooter > Sci-fi / futuristic","desc":"<p>The year is 2037. Ash is the leader of an elite organization of soldiers known as X-Squad. One day he receives a cryptic message concerning an experiment known as Project Medusa. It appears that the head of the project, Dr. Bianca Noble, has been kidnapped. Ash and his three companions must discover the truth behind the experiment, and find out who was behind the attack.</p><p><em>X Squad</em> is a third-person 3D squad-based shooter. The player directly controls Ash; his three companions are controlled by the AI, but the player can issue general orders to them. Ash can crouch and roll to evade enemy fire. The gameplay is predominantly action-oriented; Ash and his friends have to deal with enemy soldiers, automated guns, and boss enemies. Other tasks are usually confined to hitting switches in order to open doors.</p>"},{"name":"X-Files, The: Resist or Serve","year":2004,"developer":"Black Ops Entertainment, LLC","url":"PS2_COLLECTION_PART27/X-Files%2C%20The%20-%20Resist%20or%20Serve%20%28Europe%29.zip","filesize":1858517546,"score":7,"genres":"Action > 3rd-person (Other) > Puzzle elements > Sci-fi / futuristic > Detective / mystery > Horror > Licensed","desc":"<p>Based upon the successful television series The X-Files, <em>Resist or Serve</em> acts as 3 new episodes in the show's 7th season. The game features music from the series as well as voice acting by the show's stars.</p><p>As is routine for the team of paranormal investigators, Fox Mulder and Dana Scully travel to a small town in the Rocky Mountains to dig into the source of some strange and unexplained murders. The two prime suspects are girls accused of practicing witchcraft, but Mulder believes there's more to the story. Each episode has two acts, and takes players from secret facilities, to FBI headquarters, to a remote location in Siberia in search of the truth.</p><p>Gameplay is similar to the Resident Evil series. A fixed camera tracks the player and changes angles at specified points in the room. Control is similar, and players lock on to enemies to fire, and cannot move while shooting. Each episode can be played as either Mulder or Scully, with a few different locations and challenges (such as autopsies and puzzles for Scully) for each side of the story.</p><p>Bonus content includes brief videos of the dialogue recordings and concept art for the game.</p>"},{"name":"X-Men Origins: Wolverine","year":2009,"developer":"Amaze Entertainment, Inc.","url":"sony_playstation2_x/X-Men%20Origins%20-%20Wolverine%20%28USA%29%20%28En%2CFr%29.zip","filesize":1604368549,"score":"","genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Licensed","desc":"<p>Uncage the Ultimate Weapon!</p><p>Uncage Wolverine’s tragic past and discover how the ultimate weapon was created. Unleash the razor sharp adamantium claws, feral instincts and mutant regeneration power of the world’s fiercest hero. Visceral combat. Pure rage. Epic battles. Take on the impossible in your hunt to uncover the secrets of Weapon X…then exact your revenge.</p><p>* Features 8 uniquely designed areas to tell the story of Wolverine - such as the Canadian wilderness<br>* Beautifully rendered movies that aid in story telling<br>* Controls specifically tuned for Wii allowing for unique gestures to perform special attacks<br>* RPG Lite setup that will allow you to customize Wolverine to your play style<br>* Collect tokens for a Blob bonus level<br>* Unlockable difficulty setting that is harder and will allow you to carry over your previous stats and upgrades</p>"},{"name":"X-Men: Legends","year":2004,"developer":"Raven Software Corporation","url":"sony_playstation2_x/X-Men%20Legends%20%28USA%29.zip","filesize":1461461372,"score":7.5,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Action RPG > Cyberpunk / dark sci-fi > Licensed","desc":"<p>Shortly after teen Alison Crestmere begins to exhibit her mutant powers, she's hunted through the streets of New York City by anti-mutant troops and The Brotherhood. Rescued by the X-Men, Alison is taken to Professor Charles Xavier's School for the Gifted where she begins her quest to learn control over her lava-based powers.</p><p><em>X-Men: Legends</em> is a role-playing game set in the Marvel Universe. Offering single and multiplayer support, Legends tells the broad story of the war between mutants and humankind and the conflict between the X-Men and The Brotherhood, against the personal story of Alison and the role she plays.</p><p>Controlling a party of four X-Men, picked from a roster that grows to 15 mutants, players take on armed guards, evil mutants, and killer Sentinels. Mutant powers grow stronger as the X-Men level up, but so do the challenges: securing an aircraft carrier, preventing a nuclear power plant meltdown and more.</p>"},{"name":"X-Men: Legends II - Rise of Apocalypse","year":2005,"developer":"SuperVillain Studios, Inc.","url":"PS2_COLLECTION_PART27/X-Men%20Legends%20II%20-%20Rise%20of%20Apocalypse%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":2487120482,"score":7.9,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Action RPG > Cyberpunk / dark sci-fi > Licensed","desc":"<p>The mutants from the Brotherhood and the X-Men try to forget their differences since a common enemy has appeared - the dreaded Apocalypse. His plan involves kidnapping mutants, and, with the help of the mad geneticist Mr. Sinister, extract their powers and use them to make himself even more powerful. At first, the heroes must rescue Professor X, who has fallen into the clutches of the enemy. However, when Apocalypse kidnaps Magneto's son Quicksilver, the leader of the Brotherhood is determined more than ever to team up with his former foes and stop Apocalypse's evil plans.</p><p><em>X-Men: Legends II - Rise of Apocalypse</em> is an action role-playing game and a sequel to X-Men Legends. The player controls a party of four characters, though only one at a time can be controlled directly. Beside switching the characters for combat purposes, the player is often obliged to do so, because some of the tasks in the game require the specific abilities of a certain mutant. For example, Iceman can put out fire, Magneto can generate a metal bridge across a gap, etc.. Most of the time, however, is spent in combat, collecting loot and acquiring experience points. Unlike the first game, items dropped by enemies are random. The character will level up, become stronger, and learn new skills. The player can opt to allocate all the experience and skill points manually.</p><p>Each character has several different skills based on their mutant powers. These include melee, boost, projectile, traps, and others. Each character can also learn powerful super skill: for example, Cyclops has a super beam attack that can hit multiple targets; Wolverine has a spinning attack that inflicts heavy damage; Magneto has a metal attack, crushing everything in sight by manipulating metal objects in the environment, etc.</p><p>New in the sequel is on-line multiplayer with both co-operative and six competitive modes. Four players can play on a single console by plugging in additional controllers at any time.</p>"},{"name":"X-Men: Next Dimension","year":2002,"developer":"Paradox Development","url":"PS2_COLLECTION_PART27/X-Men%20-%20Next%20Dimension%20%28Europe%29.zip","filesize":1317668637,"score":6.7,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Licensed","desc":"<p>A group of humanoids known as the Sentinels plan to to rid the world of mutants. The X-Men must ally with their greatest enemies in order to save their teammate - Forge. The mutants must save Forge before the Sentinels can coax secrets from him that are capable of destroying all mutant-kind.</p><p><em>X-Men: Next Dimension</em> is a fighting game in which the player can choose between up to twenty-four available characters. The game features an extensive combo system, including normal chains, air juggles, and air launchers. Beside the basic blocking system, characters have various counter-attacks available, specific to the type of attack the player is countering. In addition to standard attacks, the player can execute super attacks by pressing two punch or kick buttons simultaneously. These include blasts or beams, some of which can stun an opponent, as well as physical attacks that have special effects. There are several different types of super attacks, each having four different levels of power.</p><p>The stages are rendered in 3D; unlike in most fighting games, many stages consist of multiple screens. The player can choose to move between these screens; kicking the opponent out of the current screen also leads to a location change. </p><p>Most of the versions include the following modes:<em> </em>Story Mode* - the player follows a scripted mode; only several of the characters are available to control.</p><ul><li><em>Arcade Mode</em> - a one-player mode where the player fights against the AI in a series of ten matches.</li><li><em>Versus Mode</em> - a two-player game for one-on-one combat.</li><li><em>Survival Mode</em> - a one-player game where the player tests his skills against a never-ending series of enemies, achieving as many victories as possible with only one life bar.</li></ul><p>The GameCube version contains two exclusive modes, Team and Practice. The Xbox version features an extra stage and the ability to play as Pyro.</p>"},{"name":"X-Men: The Official Game","year":2006,"developer":"Z-Axis, Ltd.","url":"PS2_COLLECTION_PART27/X-Men%20-%20The%20Official%20Game%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":2901881722,"score":6.1,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Hack and slash > Flight / aviation > Licensed","desc":"<p><em>X-Men: The Official Game</em> acts as a story bridge between the second and third <em>X-Men</em> movies. In the game, the player takes control of Wolverine, Iceman and Nightcrawler, as they deal with the aftermath of the incident at Alkali Lake. The heroes return to Alkali Lake to recover two stolen Cerebro parts, and find out that an unknown organization is doing a salvage operation on the base. What they uncover reveals to be a threat to all mutants...</p><p>The three playable characters have distinct fighting abilities. Wolverine fights from a fixed third-person view; the player essentially has to \"button mash\" his way through hordes of soldiers and classic <em>X-Men</em> villains as Sabretooth and Lady Deathstrike. Iceman can fly; his abilities are widely used when he traverses the ice bridge to fly out and save places such as a nuclear power plant and the Statue of Liberty. As Nightcrawler, the player views the world from a free third-person perspective; he possesses a teleportation ability, which allows him to drop on his enemies while getting the missing Cerebro parts and saving the Brooklyn Bridge from Mirror Man.</p>"},{"name":"X-treme Express","year":2002,"developer":"Syscom Entertainment Inc.","url":"PS2_COLLECTION_PART27/X-treme%20Express%20-%20World%20Grand%20Prix%20%28Europe%29.zip","filesize":547390398,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Real-time > Direct control > Train","desc":"<p>Racing trains across ten varied landscapes, X-treme Express offers a unique and exciting experience. With masses of trains and courses to unlock, a challenging tournament mode and many varied tasks to master in the Trial mode, you will need all your skill to get to the platform first. Computer opponents or players’ trains will be out to derail you in this crazy race to the finish!</p><p>* Over 80 trains to unlock, each with their own abilities and some crazy styling!<br>* 10 courses to race over. Be sure to make use of the points to take the express route to the finish!<br>* An exciting Trial mode to beat. Stop runaway trains, barge enemies off the track, or struggle to the finish with faulty instruments.<br>* Go solo in the one-player modes, or try out the two-player split-screen mode.</p>"},{"name":"X-Treme Quads","year":2005,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART27/X-treme%20Quads%20%28Europe%29.zip","filesize":146332327,"score":"","genres":"Racing / Driving > 3rd-person (Other)","desc":"<p><em>X-Treme Quads</em> is a single player, keyboard controlled racing game though a joystick is also supported. </p><p>There are three race modes;Tournament, Quick Race and Time Trial.  </p><p>The races are run around two courses, Outlaw Canyon and Vengence Viaduct. For the Quick Race and the Time trial these courses are divided into stages with only the stages of Outlaw Canyon being available, other stages are unlocked as the player progresses through the tournament mode.<br>The tournament mode starts with the player racing in the Amateur league, success there allows the player to race in the Semi-Pro league which in turn leads to the Pro league. All tournaments are over four races.</p><p>There is no reverse so when the player gets stuck, say behind a rock,they must press SPACE to reposition their vehicle</p><p>There is a variety of quad bikes to choose from, The Tiger, LaZer, Hawk, Phantom, Wasp, Falcon plus the Enforcer and Xtreme 2 which are locked at the start of the game. Some action keys can be redefined and the player can choose the number of opponents they race against (between zero and five)</p>"},{"name":"X2: Wolverine's Revenge","year":2003,"developer":"GenePool Software","url":"sony_playstation2_x/X2%20-%20Wolverine%27s%20Revenge%20%28USA%29.zip","filesize":1473968128,"score":6.7,"genres":"Action > Behind view > Sci-fi / futuristic > Licensed","desc":"<p>Wolverine has just hours to find a cure to a virus and save his life. Along the way, he will discover further details on his past, and fight against other familiar characters from the X-Men franchise, including Magneto and Sabertooth.</p><p>Returning to the lab where Logan became Weapon X, you must use his unique abilities (adamantium claws and hightened sense of smell) to sneak your way around the areas past the many guards. And if needs be, you can use stealth abilities to quietly attack the enemy from behind or above.</p><p>Bonus objectives include finding hidden Wolverine comic covers and dog tags to unlock secrets such as new costumes and improved abilities.</p>"},{"name":"Xena: Warrior Princess","year":2007,"developer":"Extra Mile Studios Ltd","url":"PS2_COLLECTION_PART27/Xena%20-%20Warrior%20Princess%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":149292562,"score":"","genres":"Action > 1st-person > 3rd-person (Other) > Fighting > Platform > Fantasy > Licensed","desc":"<p><em>Xena: Warrior Princess</em> is a 3D action-platform game based on the TV series of the same name. Ares, the God of War has captured Xena’s friend Gabrielle in an attempt to convince her to come back at his side. Gabrielle is chained up in a dungeon that slowly fills with water. Xena now has to fight her way through the enchanted citadel of Ares.</p><p>As the you make progress you fight various enemies including bowman, swordsman, skeletons and the God of War himself in a third-person perspective using your sword and a ring blade that can be thrown at enemies from a first-person perspective. Object like vases can be picked up and used to smash in doors other doors require switches. Sometimes crates/blocks have be moved around to activate switches for a door or platforms have to be jumped to reach a switch.</p>"},{"name":"Xenosaga Episode II - Jenseits von Gut und Boese (Disc 1)","year":2004,"developer":"Monolith Software, Inc.","url":"PS2_COLLECTION_PART27/Xenosaga%20Episode%20II%20-%20Jenseits%20von%20Gut%20und%20Boese%20%28Europe%29%20%28En%2CFr%2CDe%29%20%28Disc%201%29.zip","filesize":3818129972,"score":7.2,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Xenosaga: Episode II - Jenseits von Gut und Böse</em> is a direct sequel to the first episode of the science-fiction RPG <em>Xenosaga</em> series.</p><p>The story takes place thousands of years in the future, when mankind has long left the Earth, which is now called Lost Jerusalem, and founded a star empire. The main threat humanity has to face is the appearance of a super-powerful alien race called the Gnosis. The story picks up just after the concluding events of the first episode. Shion Uzuki, the young engineer who designed the powerful android KOS-MOS, arrives with her friends at the planet Second Miltia. They aim to learn more about the heritage of the late genius scientist Joachim Mizrahi, and foil the schemes of the mysterious antagonists Albedo and Margulis. Jin Uzuki, Shion's brother, who was only mentioned in the first chapter, becomes an important controllable character in the second episode. Much of the plot's content is dedicated to exploring the past and the origins of Jr., as well as his connection to Albedo.</p><p>The gameplay in general and the battle system in particular are similar to that of the first game. All enemies are visible on screen, and field objects can be destroyed in order to attract the attention of the enemy or to create a zone that will weaken it. The turn-based combat again features two types of basic attacks, which now inflict different damage on enemies of different height. Special attacks can suspend enemies in the air or flatten them on the ground, which makes them more vulnerable. Enemies can also be \"broken\" by specific combinations of attacks, which are in many cases the only key to victory. Another addition is the ability to wait two or three turns in a battle, accumulating energy for a stronger attack, which can be used tactically whenever the opponent is in a weakened state.</p><p>The AGWS (giant mech) battles are still present in the second episode, but it is no longer possible to switch to AGWS at any point, as it was in the first game. Instead, these battles are dictated by the plot and require the player to exploit the unique abilities of the mechs. Another game aspect removed from the first game is money, as well as shops, weapons, and armor of any kind. The only items in the game are healing items or keys that unlock the ability to learn high level skills. The skill system has been re-designed, each character possessing his or her own \"tree\" of unique skills they can gradually learn. Like in the first episode, the dungeons contain environmental and logical puzzles to solve.</p><p>The second episode continues to be heavy on story development, and also has a significant amount of non-interactive cutscenes. Character graphics underwent an aesthetic change: the characters look now somewhat more realistic and less influenced by anime visual style.</p>"},{"name":"Xenosaga Episode II - Jenseits von Gut und Boese (Disc 2)","year":2004,"developer":"Monolith Software, Inc.","url":"PS2_COLLECTION_PART27/Xenosaga%20Episode%20II%20-%20Jenseits%20von%20Gut%20und%20Boese%20%28Europe%29%20%28En%2CFr%2CDe%29%20%28Disc%202%29.zip","filesize":3822557062,"score":7.2,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Xenosaga: Episode II - Jenseits von Gut und Böse</em> is a direct sequel to the first episode of the science-fiction RPG <em>Xenosaga</em> series.</p><p>The story takes place thousands of years in the future, when mankind has long left the Earth, which is now called Lost Jerusalem, and founded a star empire. The main threat humanity has to face is the appearance of a super-powerful alien race called the Gnosis. The story picks up just after the concluding events of the first episode. Shion Uzuki, the young engineer who designed the powerful android KOS-MOS, arrives with her friends at the planet Second Miltia. They aim to learn more about the heritage of the late genius scientist Joachim Mizrahi, and foil the schemes of the mysterious antagonists Albedo and Margulis. Jin Uzuki, Shion's brother, who was only mentioned in the first chapter, becomes an important controllable character in the second episode. Much of the plot's content is dedicated to exploring the past and the origins of Jr., as well as his connection to Albedo.</p><p>The gameplay in general and the battle system in particular are similar to that of the first game. All enemies are visible on screen, and field objects can be destroyed in order to attract the attention of the enemy or to create a zone that will weaken it. The turn-based combat again features two types of basic attacks, which now inflict different damage on enemies of different height. Special attacks can suspend enemies in the air or flatten them on the ground, which makes them more vulnerable. Enemies can also be \"broken\" by specific combinations of attacks, which are in many cases the only key to victory. Another addition is the ability to wait two or three turns in a battle, accumulating energy for a stronger attack, which can be used tactically whenever the opponent is in a weakened state.</p><p>The AGWS (giant mech) battles are still present in the second episode, but it is no longer possible to switch to AGWS at any point, as it was in the first game. Instead, these battles are dictated by the plot and require the player to exploit the unique abilities of the mechs. Another game aspect removed from the first game is money, as well as shops, weapons, and armor of any kind. The only items in the game are healing items or keys that unlock the ability to learn high level skills. The skill system has been re-designed, each character possessing his or her own \"tree\" of unique skills they can gradually learn. Like in the first episode, the dungeons contain environmental and logical puzzles to solve.</p><p>The second episode continues to be heavy on story development, and also has a significant amount of non-interactive cutscenes. Character graphics underwent an aesthetic change: the characters look now somewhat more realistic and less influenced by anime visual style.</p>"},{"name":"Xenosaga Freaks","year":2004,"developer":"Monolith Software, Inc.","url":"sony_playstation2_x/Xenosaga%20Freaks%20%28Japan%29.zip","filesize":1927688356,"score":"","genres":"Adventure > Puzzle > 1st-person > Anime / Manga > Visual novel > Sci-fi / futuristic > Comedy","desc":"<p><em>Xenosaga Freaks</em> is a side game in the Xenogears / Xenosaga universe. It contains two different games, a glossary of terms used in <em>Xenosaga Episode I</em>, and a playable demo of <em>Episode II</em>.</p><p>The first game contained in <em>Freaks</em> is <em>XenoComi</em>, a humorous adventure game set during the same timeframe as <em>Episode I</em>. It follows several series characters as they try to stop the out-of-control robot KOS-MOS and discover why she's been acting up.</p><p>The other game is called <em>Kotoba no Puzzle: Xenopittan</em>, a word-based puzzle game with a <em>Xenosaga</em> theme.</p>"},{"name":"Xenosaga: Episode I - Der Wille zur Macht","year":2002,"developer":"Monolith Software, Inc.","url":"sony_playstation2_x/Xenosaga%20Episode%20I%20-%20Der%20Wille%20zur%20Macht%20%28USA%29.zip","filesize":7497288374,"score":7.6,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p>In the 21st century, a group of scientists discovered a mysterious monolith near the Lake Turkana in Kenya. The substance contained within it, which later received the name <em>Zohar</em>, has quickly become a source of immense power. Humanity was eventually able to reach the stars, founding the Galaxy Federation and colonizing known space.</p><p>In the year 4767 T.C. (Transcend Christ) or 7277 A.D., according to the old year-counting system, humanity has long left the planet Earth, which has been renamed <em>Lost Jerusalem</em> and erased from star maps, the way to it no longer known. The original Zohar substance has been proven to be too dangerous, and was sealed on the planet Old Miltia, most humans resorting to use less powerful device called <em>Zohar emulators</em> instead. However, some organizations still long to re-discover the true Zohar, believing it to be the path to Lost Jerusalem. </p><p>Meanwhile, a new race of aliens known as Gnosis has emerged. The Vector Corporation decides to develop an android called KOS-MOS to be the ultimate weapon against the Gnosis. Shion Uzuki is a young engineer leading this project. After having completed KOS-MOS, Shion and her team are attacked by the Gnosis. Through a series of events, Shion becomes the target of the terrorist U-TIC organization and other mysterious figures, whose goal seems to be the secret path to Old Miltia. Other characters become involved in the conflict, and eventually Shion realizes that she is not alone in her struggle, and that the initial Gnosis attack was but a small part of a complex, multi-layered conspiracy.</p><p><em>Xenosaga: Episode I - Der Wille zur Macht</em>, the first chapter of a trilogy, is a Japanese-style sci-fi role-playing game, sharing many common themes and gameplay elements with Xenogears. The battle system is not unlike the one used in <em>Xenogears</em> (combo attacks, AP and EP gauges, etc.), but random encounters are eliminated. Instead, the enemies are now visible and battles can be avoided. During combat the few upcoming ally and enemy turns are shown onscreen, allowing the player to make strategic decisions based on who will act next. A rolling slot moves with each turn as well, conferring a bonus such as added damage or bonus XP for any action on that turn. If the enemy would be in position to take an advantage then the player can expend a character's boost gauge to cut in and act next, although enemies can boost as well, and enemy boosts always over-ride player boosts. </p><p>Each character has a unique tree of ether spells they can learn by spending ether points earned in battle, with lower spells requiring spells above them to be purchased first. After a spell is purchased, so long is it does not require a unique talent of that character, the spell can also be purchased and learned by any other character that can afford double its normal cost. The Anti-Gnosis Weapon Systems can be equipped with different weapons and accessories and can be used in combat provided that a character has enough AP on that turn to board their AGWS.</p>"},{"name":"Xenosaga: Episode III - Also Sprach Zarathustra (Disc 1)","year":2006,"developer":"Monolith Software, Inc.","url":"sony_playstation2_x/Xenosaga%20Episode%20III%20-%20Also%20sprach%20Zarathustra%20%28USA%29%20%28Disc%201%29.zip","filesize":3198607696,"score":7.7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>The concluding chapter of the <em>Xenosaga</em> science fiction role-playing game series begins one year after the events described in the previous episode. The main heroine Shion Uzuki is shocked by the discovery that implies a connection between Vector Corporation, the organization she is working for, and the Gnosis event, which set the whole story in motion. She leaves her post and tries to solve the mystery on her own. Meanwhile, the KOS-MOS project is halted, and a mysterious new android, T-elos, emerges to replace it. Shion and her friends are about to fight the ultimate battle that will determine the destiny of mankind.</p><p>The third episode retains the combat basics of the two previous games, resembling more the system of the first episode. Weapon and equipment management returns, and the complex break system from the second chapter has been simplified. Once again, there are two kinds of combat, in human form and piloting giant robots. The usage of ether attacks, boost gauge, and other typical Xenosaga gameplay elements are also present in this game. Robot combat is more prominently featured and is handled somewhat differently, the giant gears having a wider variety of attacks at their disposal. Both player-controlled and enemy parties have now a special bar that renders them immobile when filled. Exploiting this feature is yet another strategic addition to the combat.</p><p>There is an in-game database listing all events, people, items, monsters and locations. Next to the main storyline, there are 60 puzzle mini-games. The game includes an editor to create these custom puzzles and share them with friends.</p>"},{"name":"Xenosaga: Episode III - Also Sprach Zarathustra (Disc 2)","year":2006,"developer":"Monolith Software, Inc.","url":"sony_playstation2_x/Xenosaga%20Episode%20III%20-%20Also%20sprach%20Zarathustra%20%28USA%29%20%28Disc%202%29.zip","filesize":3806066552,"score":7.7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>The concluding chapter of the <em>Xenosaga</em> science fiction role-playing game series begins one year after the events described in the previous episode. The main heroine Shion Uzuki is shocked by the discovery that implies a connection between Vector Corporation, the organization she is working for, and the Gnosis event, which set the whole story in motion. She leaves her post and tries to solve the mystery on her own. Meanwhile, the KOS-MOS project is halted, and a mysterious new android, T-elos, emerges to replace it. Shion and her friends are about to fight the ultimate battle that will determine the destiny of mankind.</p><p>The third episode retains the combat basics of the two previous games, resembling more the system of the first episode. Weapon and equipment management returns, and the complex break system from the second chapter has been simplified. Once again, there are two kinds of combat, in human form and piloting giant robots. The usage of ether attacks, boost gauge, and other typical Xenosaga gameplay elements are also present in this game. Robot combat is more prominently featured and is handled somewhat differently, the giant gears having a wider variety of attacks at their disposal. Both player-controlled and enemy parties have now a special bar that renders them immobile when filled. Exploiting this feature is yet another strategic addition to the combat.</p><p>There is an in-game database listing all events, people, items, monsters and locations. Next to the main storyline, there are 60 puzzle mini-games. The game includes an editor to create these custom puzzles and share them with friends.</p>"},{"name":"XGIII: Extreme G Racing","year":2001,"developer":"Acclaim Studios Cheltenham","url":"PS2_COLLECTION_PART27/XGIII%20-%20Extreme%20G%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29%20%28v2.00%29.zip","filesize":528788290,"score":7.8,"genres":"Action > Racing / Driving > Behind view > Cyberpunk / dark sci-fi","desc":"<p><em>XGIII: Extreme G Racing</em> is a futuristic racing game. Six teams are competing to win a racing championship, the player taking control of any of the two riders available in each team. The game retains the action elements of the previous titles: as before, opponents will try to sabotage the race, and the player-controlled character is able to answer them with his own arsenal of weapons.</p><p>Unlike the previous installments, weapons cannot be picked up on the road: the player has to purchase them with the money earned after a successful race. All weapons now deplete the player's weapon bar with each shot. Another change is the absence of the \"nitro\" boosts utilized in the previous entries; they have been replaced with a turbo system, where using the boost drains energy from the player character's shields.</p>"},{"name":"XGRA: Extreme G Racing Association","year":2003,"developer":"Acclaim Studios Cheltenham","url":"PS2_COLLECTION_PART27/XGRA%20-%20Extreme%20G%20Racing%20Association%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":933202770,"score":7.1,"genres":"Action > Racing / Driving > Behind view > Direct control > Hovercraft > Track racing > Cyberpunk / dark sci-fi","desc":"<p>After the F1 Nurburgring disaster of 2025, the Extreme Gravity Racing Association, or XGRA, was set up as a regulatory governing body for all heavy gravity race events as an equivalent of NASCAR or the FIA. The year is 2080 and a new season is about to begin. You start as a new rookie for a team and have to work your way up through leagues of increasing difficulty with various racing modes: Endurance, Peacekeeper, Speed Limited, Extreme Weather Races, Burn Off and Warmonger.</p><p>Jump into your speed bike and race in more than 14 different courses, while you blast your enemies to little bits with an assortment of lasers, mines and rockets. After a few successful races, you have the opportunity to upgrade your bike and access new areas.</p>"},{"name":"Xiaolin Showdown","year":2006,"developer":"BottleRocket Entertainment, Inc.","url":"PS2_COLLECTION_PART27/Xiaolin%20Showdown%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":790517551,"score":5.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p><em>Xiaolin Showdown</em> is a game based on the animated series of the same name from Warner. It is a fighting game where you play as the four main characters of the show (Kimiko, Omi, Raimundo and Clay). Even if you play alone (the game supports 4 simultaneous players in story mode), the other 3 are present, controlled by the computer. You can also unlock 2 additional characters: Jack Spicer and Chase Young.</p><p>The players must defeat waves of enemy robots to collect Shen Gong Wu artifacts to increase their power and defeat series of enemies, until they are able to face Mala Mala Jong and put an end on the plans of the evil boy genius, Jack Spicer. Each Shen Gong Wu provides a new power, like locking nearby characters or punching the ground for area damage. Additional Shen Gong Wu can be bought using coins collected during the game.</p><p>The gameplay is inspired by party fighting games, like Power Stone and Super Smash Bros. You can chain combos with button combinations, jump and give flying kicks.</p><p>Between the game levels, there are showdowns, where the characters have to bet a Shen Gong Wu. The one that wins the challenge chooses a Shen Gong Wu from the player who lost. You can also only play the showdowns, instead the full story mode.</p>"},{"name":"XII Stag","year":2003,"developer":"Triangle Service","url":"PS2_COLLECTION_PART27/XII%20Stag%20%28Europe%29.zip","filesize":613599862,"score":6,"genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p><em>XII Stag</em> is a vertical scrolling arcade shooter. The player controls a futuristic aircraft and tries to reach the end of each stage, where a boss fight waits.</p><p>There are several different types of attacks: a regular shot, which can be upgraded five times by power-ups dropped by enemy ships; a side attack is a risky manoeuvre that involves pushing the control stick quickly left and right to destroy enemies to the left or right of the player's ship. This will also increase the score multiplier. The ship's exhaust can also be put to use by damaging enemies that come up from behind. The final weapon is the barrier, which creates a protective ring around the player, destroying all enemies that touch it.</p><p>The game also features a difficulty setting adjusted dynamically by the score - the higher the player scores, the more difficult the game gets. <em>XII Stag</em> also has checkpoints in each level, which compare the current player's score to the high score at this point in the game.</p>"},{"name":"XIII","year":2003,"developer":"Ubisoft Paris Studios SARL","url":"sony_playstation2_x/XIII%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2054365617,"score":7.4,"genres":"Action > 1st-person > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p><em>XIII</em> is a cel-shaded first-person shooter based on the popular Belgian cult comic created by Jean Van Hamme and illustrated by William Vance. The game is loosely based on the first five comics. The main theme of the game is based on Robert Ludlum's book <em>The Bourne Identity</em>, and features a man who is suffering from amnesia and quite possibly involved in the recent assassination of the President of the United States. The hero knows almost nothing except that he must be important, since everyone is trying to kill him. Gradually uncovering the mystery, the hero, learns more about his secret agent past and his curious name: XIII.</p><p>The player unravels clues, trying to solve a conspiracy set in an environment that breathes a comic book ambiance. Footsteps and shots are visualized in text and actions: for example, head shots are shown in a series of still images. Aside from that, the game has all the typical FPS elements: both stealth and action, more than fifteen weapons (shotguns, crossbows, rifles, ...), interaction with environmental objects and plenty of enemies in levels spread all over the world. During the game, the player can learn a number of skills such as silent walking, lockpicking and dual weapons handling.</p>"},{"name":"Xtreme Speed","year":2004,"developer":"Mere Mortals Ltd.","url":"PS2_COLLECTION_PART27/Xtreme%20Speed%20%28Europe%29.zip","filesize":432452674,"score":"","genres":"Racing / Driving > Behind view > Direct control > Automobile > Street racing","desc":"<p>It's time to hit the road again for another great racing challenge!</p><p>Feel the high speed adrenalin rush in GT Team Rally. Take control of the wheel in the Classic Car Challenge and push your skills to the limit. Buckle up and put the pedal to the metal in Street Style Blitz. Speed through chicanes, drift around corners as you race for the chequered flag in Speed Freaks.</p><p>If you want all the excitement of a race day, Xtreme Speed has everything you need!</p>"},{"name":"Xyanide: Resurrection","year":2007,"developer":"Playlogic Game Factory BV","url":"PS2_COLLECTION_PART27/Xyanide%20-%20Resurrection%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3441836851,"score":6.8,"genres":"Action > 3rd-person (Other) > Shooter > Sci-fi / futuristic","desc":"<p><em>Xyanide Resurrection</em> is a sequel to the Xbox game Xyanide. It takes place after the happenings of the first game. The evil space witch Aguira is still alive after having escaped her death sentence. It's once again up to the executioner Drake to find her and bring her to justice. Aguira has used the xyanide to create a strange world that Drake has to travel through and battle countless of enemies.</p><p>Xyanide Resurrection is a third person shoot 'em up, similar to a rail shooter. The player controls a spaceship travelling through space. Forward motion is automatic but the player can move the ship up and down and left and right to avoid the fire of the incoming enemies. The player can also rotate the view as the enemies attack from all angles. As enemies are destroyed they drop pieces of xyanide that the player can collect. Xyanide restores health but it can also be used to purchase upgrades and new weapons in the store between levels. When starting out the ship is equipped with a simple fusion gun that shoots single shots and bombs when bigger explosions are needed. Three extra weapons can be bought: shotgun, laser and rockets. It is also possible to buy a magnet to easier collect xyanide and a shield that can take some damage. </p><p>The game's story mode consists of five levels that have to be completed sequentially. By playing the story mode, levels are unlocked for the quick play mode where the player can perfect his score. A digital comic and artwork can also be unlocked. There is also a score attack mode where the player has to get as many points as possible before time runs out. The multiplayer mode is for two players that compete in getting the highest score by collecting pickups.</p>"}]