[{"name":"Yakuza","year":2005,"developer":"Amusement Vision, Ltd.","url":"PS2_COLLECTION_PART27/Yakuza%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3337862219,"score":7.7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Mini-games > Direct control > Japan (Modern/Futuristic) > Crime","desc":"<p>Kiryu Kazuma was brought up in the Sunflower Orphanage, and has been protected since his childhood by a lieutenant of the Dojima Family, affiliated with the Tokyo-based Tojo Clan of the Japanese organized crime syndicate, the yakuza. His back covered with a tattoo of a dragon, Kazuma soon becomes a prominent member of the Dojima Family - until he takes the blame for the murder of its leader in order to protect his best friend, and is sent to prison.</p><p>Ten years later, Kazuma returns to his home town Kamurocho. He finds out that Yumi Sawamura, a young woman he grew up with in the orphanage, has disappeared. Ten billion yen has been stolen from the Tojo Clan, and various yakuza groups are searching for the money everywhere. Against his will, Kazuma becomes involved again in the struggles and intrigues of the yakuza world. </p><p><em>Yakuza</em> is a hybrid game that contains elements of free-roaming exploration, hand-to-hand fighting, and role-playing. In the exploration mode, Kazuma explores the Kamurocho district on foot. The game's structure is mission-based: the player can, for the most part, explore the town, entering some of the buildings, shopping, or participating in various mini-games, such as UFO catcher, batting cage, slot machines, blackjack, and others. Beside plot-advancing missions, the game also features side quests, which can be triggered by interacting with some of the characters roaming the town.</p><p>Hostile yakuza will often approach Kazuma on the city streets or during the missions, which leads to combat sequences. The battles take place on separate screens; Kazuma must eliminate all of his enemies to achieve victory. Though guns can be used by Kazuma or his opponents, the vast majority of the fights involve melee combat. Kazuma can fight bare-handed, and is able to execute a variety of moves - punches, kicks, grabbing, throwing, and combinations thereof. In addition, the player can interact with many objects seen on the battle screen and use them as weapons. These include standard weapons such as baseball bats, but also more exotic items, e.g. chairs, umbrellas, neon signs (which electrify enemies), and even larger objects such as bicycles. Weapons usually break after a few uses, but Kazuma can also disarm opponents and take possession of the weapons they are using.</p><p>Role-playing elements are present in the game's economy (money is gained after fights and can be spent on food, drinks, healing items, weapons, gifts, etc.) and in the character growth system. Kazuma receives experience points and levels up following battles. The player is able to distribute ability points when leveling up, increasing Kazuma's health, heat gauge (special power meter), and unlocking new moves.</p>"},{"name":"Yakuza 2","year":2006,"developer":"Amusement Vision, Ltd.","url":"PS2_COLLECTION_PART27/Yakuza%202%20%28Europe%29.zip","filesize":6495898869,"score":7.9,"genres":"Role-playing (RPG) > 3rd-person (Other) > Mini-games > Direct control > Japan (Modern/Futuristic) > Crime","desc":"<p>One year has passed since Kazuma Kiryu, \"yakuza with the heart of gold\", defeated his biggest adversary in the  previous game. Despite this victory, Kazuma has lost more than he had ever imagined. </p><p>But events from the past continue to haunt him. A man he had admired so much, who was like a father to him, has revealed a terrible secret before he died. It's time for Kazuma to solve the mystery once and for all. Caught in the eternal fight between Kantou and Kansai, the Eastern and the Western organized crime groups of Japan, he soon realizes that there are other powers on the stage, including a mysterious Korean organization that seems to be connected somehow to his past.</p><p>The sequel to <em>Yakuza</em> continues the story from the previous game, featuring many recurrent characters. The main gameplay idea also remains the same - on-foot exploration of urban environments, hand-to-hand fighting, and role-playing elements, somewhat similar to the kind of gameplay that was introduced in  Shenmue games. The sequel features some technical improvements, such as the ability to rotate the camera during the fights. It also contains more side missions and mini-games, ranging from playing pool and mahjong to running a club and dating women.</p>"},{"name":"Yakuza Fury","year":2005,"developer":"Vingt et un Systems Corporation","url":"PS2_COLLECTION_PART27/Yakuza%20Fury%20%28Europe%29.zip","filesize":117927987,"score":"","genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Direct control","desc":"<p>Duty, Friendship and Betrayal... Can you reach the top in the world of honor?<br>* Your honor will increase or decrease based on your playing skills. If you behave well, you will be promoted and become a boss.<br>* With money earned in fighting you can buy various pieces of clothing and personalize your hero!<br>* Acquire new skills according to the clothes you wear!</p>"},{"name":"Yanya Caballista: City Skater","year":2001,"developer":"CAVE Co., Ltd.","url":"sony_playstation2_y/Yanya%20Caballista%20-%20City%20Skater%20%28USA%29.zip","filesize":352005100,"score":6.6,"genres":"Action > Sports > 3rd-person (Other) > Anime / Manga > Arcade > Skateboarding > Sci-fi / futuristic","desc":"<p>New San Francisco, the skateboarding Mecca of the world, has been invaded by mysterious alien creatures called Gawoo. There is only one way to stop them, and skateboarding is the key!</p><p><em>Yanya Caballista: City Skater</em> is a cartoony skateboarding game played with a unique fingerboard controller that fits over the Dual Shock controller's analog sticks. Move the fingerboard as a real skateboard would move to control it and pull off different tricks. Each stage is populated with various Gawoo, and the only way to get rid of them is to pull skateboarding tricks. The color and shape of the Gawoo tells you what tricks are their favorite, so pull those tricks and combo nearby to get rid of them before the timer runs out!</p><p>There are many different unlockable characters, and several different modes including a 2-player versus mode, a challenge mode, and a \"ramp mode\" where successfully completing tricks builds up and creates music tracks.</p>"},{"name":"Yatohime Zankikou - Ken no Maki","year":2007,"developer":"Terios","url":"sony_playstation2_y/Yatohime%20Zankikou%20-%20Ken%20no%20Maki%20%28Japan%29.zip","filesize":1813009773,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Fantasy","desc":"<p><em>Yatohime Zankikou: Tsurugi no Maki</em> is a PlayStation 2 port of the Windows game Yatohime Zankikou. It was released two years after the original game. The PlayStation 2 port tunes down the adult and erotic scenes. It is a visual novel adventure game set in modern day world that mixes fantasy elements and supernatural.</p><p>The protagonist of this visual novel is Yuuma Nagamine, a regular high-school student with some extraordinary powers we was not aware of. Lately he's been plagued by dreams and nightmares, bordering between illusion and reality. Soon he will find out there's more to that, and what he considered just a bunch of strange dreams might be visions of things to come. Around the same town, a strange series of murders started to occur in the town. A mysterious girl wielding sword might be behind the recent events... but might also be the one that Yuuma has seen in his visions. Pretty soon, he's about to get involved in more than he ever thought.</p>"},{"name":"Yetisports: Arctic Adventure","year":2005,"developer":"Pirate Games","url":"PS2_COLLECTION_PART27/Yetisports%20Arctic%20Adventures%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":460230320,"score":"","genres":"Action > Behind view > Mini-games > Party game > Fantasy > Licensed","desc":"<p><em>Yetisports: Arctic Adventure</em> is a party game staring the yeti and penguin from the Yetisports browser games. The game features six mini games and eighteen levels in total. The six mini games are:</p><ul><li>Baseball: the yeti has to hit a penguin jumping from a hole with the baseball bat as far as possible, extra points can be collected along the way;</li><li>Free flight: the player has reach the end of the level before the time runs out, by navigating an albatross through rings in the air to gain extra time. Red feathers can be collated to gain more speed;</li><li>Pingu flight: the player has to launch a penguin in the air that will then be picked up by an albatross. By collecting white feathers the albatross gains stamina. When unable to go farther the penguin has to be drop as close as possible to a target for more points;</li><li>Snowboarding: while snowboarding the player has to pick up penguins. At the end the penguins must be thrown at ice statues for points.</li><li>Pingu golf: the penguin has to be hit by the yeti with an ice bat into a golf hole for the highest score;</li><li>Half pipe racing: the player has finish several laps with a penguin thrown by the yeti before the time runs out, by collecting pocked watches extra time is gained. Additional speed can be gained by hitting red bowties;</li><li>Pingu darts: the Yeti has to throw snowballs at jumping penguins in front of a dartboard to get them in the dartboard and earn points.</li></ul>"},{"name":"Yoshinoya","year":2004,"developer":"Success Corp."},{"name":"Yotsunoha: A Journey of Sincerity","year":2008,"developer":"Haikuo Soft","url":"sony_playstation2_y/Yotsunoha%20-%20A%20Journey%20of%20Sincerity%20%28Japan%29.zip","filesize":1218791129,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Originally released for Windows as Yotsunoha, this PlayStation 2 release removes the erotic content, but adds new CG events. The game focuses on four female protagonists and features the story that plays in pre-determined order of selection. The four female protagonists were reunited after being separated for three years during the closure of the academy they were all attending together. They soon find out that the time capsule they buried prior to going separate ways have been dug up and instead, they find a note saying that their former teacher took it and buried it someplace else. The four of them decide to find that time capsule.</p><p>The visual novel element of gameplay is regular, consists of reading on-screen text with occasional choices and top-down navigation through the map of the school campus. After the original PC game, but before this PS2 port, the game also branched into OVA series and manga series.</p>"},{"name":"Yourself!Fitness","year":2005,"developer":"Respondesign","url":"sony_playstation2_y/Yourself%21Fitness%20%28USA%29.zip","filesize":1637473713,"score":"","genres":"Sports > Meditative / Zen > Health / nutrition","desc":"<p><em>Yourself!Fitness</em> is a fitness game that includes over 500 types of exercises led by a virtual personal fitness coach named Maya. There are five areas in which you can focus your exercise: Weight Loss, Cardio, Upper Strength, Core Strength, and Lower Strength. Also, you can do Yoga and many healthy recipes are included in the program. The game starts with a fitness assessment where the intensity of the training is determined by comparing the player's resting heart rate with the heart rate after performing a set of jumping jacks. External elements such as an exercise ball, hand weights, an exercise step, or a heart rate monitor can be incorporated in the program.</p>"},{"name":"Ys I・II: Eternal Story","year":2003,"developer":"Nihon Falcom Corp.","url":"sony_playstation2_y/Ys%20I%20%26%20II%20-%20Eternal%20Story%20%28Japan%29.zip","filesize":959073982,"score":"","genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Anime / Manga > Action RPG > Fantasy","desc":"<p><em>Ys I・II: Eternal Story</em> is an updated version of Ys I II Complete. It introduces an additional mode that re-balances the leveling system for a smoother transition between the two games. It also contains a bonus \"Magic World\", which contains new characters, a few sub-quests, as well as access to artwork gallery and sound test. Voice acting has been added as well.</p><p>This version also introduces changes to the weapon system. In all previous releases of the games a more powerful sword rendered weaker ones useless. In this version, each sword has additional properties: for example, the initial Short Sword can now stun enemies.</p>"},{"name":"Ys III: Wanderers from Ys","year":2005,"developer":"Taito Corporation","url":"sony_playstation2_y/Ys%20III%20-%20Wanderers%20from%20Ys%20%28Japan%29.zip","filesize":336149226,"score":"","genres":"Role-playing (RPG) > Side view > 2D scrolling > Anime / Manga > Action RPG > Platform > Fantasy","desc":"<p><em>Ys III: Wanderers from Ys</em> is a remake of an earlier game with the same name. Like the original, the game has 2D graphics, with character sprites and hand-drawn backgrounds. The visuals have been redone in higher resolution and with new artwork. Character portraits and voice acting have been added.</p><p>The game retains the story, locations, and general gameplay mechanics of the original release. The default difficulty level is lower than in the earlier version. Also, enemies get stunned for a short while when hit, granting the player character a short period of invulnerability. On the other hand, it is no longer possible to hold the attack button to hit several enemies at once.</p>"},{"name":"Ys IV: Mask of the Sun - A New Theory","year":2005,"developer":"Arc System Works Co., Ltd.","url":"sony_playstation2_y/Ys%20IV%20-%20Mask%20of%20the%20Sun%20-%20A%20New%20Theory%20%28Japan%29.zip","filesize":272547993,"score":"","genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Anime / Manga > Action RPG > Fantasy","desc":"<p><em>Ys IV: Mask of the Sun - A New Theory</em> is a remake of Ys IV: Mask of the Sun. This version is visually similar to Ys VI: The Ark of Napishtim, having character sprites and 3D environments, unlike the fully 2D graphics of the original release.</p><p>The \"bumping\" combat style of the earlier version has been replaced by the more common system that requires the player to press an attack button to hit the enemy. There are three levels of attack strength for the swords, as well as new elemental weapons and magic spells. The general plot is the same as in the original version, but several events have been altered or added.</p>"},{"name":"Ys V: Lost Kefin, Kingdom of Sand","year":2006,"developer":"Access co., ltd.","url":"sony_playstation2_y/Ys%20V%20-%20Lost%20Kefin%2C%20Kingdom%20of%20Sand%20%28Japan%29.zip","filesize":1014352739,"score":"","genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Anime / Manga > Action RPG > Fantasy","desc":"<p><em>Ys V: Lost Kefin, Kingdom of Sand</em> is a remake of Ys V: Ushinawareta Suna no Miyako Kefin. It retains the general story of the original version, though a few events have been altered (for example, characters are introduced to the plot at a different time, etc.). Location layout is generally preserved, though there are a few changes in the overworld area.</p><p>The remake utilizes 3D background graphics, similarly to Ys VI: The Ark of Napishtim. It also adds voice-overs to the dialogue. The player character can jump and defend with the shield, and magic system has been re-designed, requiring the player to equip various stones on swords to execute spells.</p>"},{"name":"Ys VI: The Ark of Napishtim","year":2005,"developer":"Nihon Falcom Corp.","url":"PS2_COLLECTION_PART27/Ys%20-%20The%20Ark%20of%20Napishtim%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":2187733468,"score":6.8,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Anime / Manga > Action RPG > Fantasy","desc":"<p><em>Ys VI: The Ark of Napishtim</em> is a direct sequel to Ushinawareta Suna no Miyako Kefin, the fifth installment of the Japanese action RPG series. Once again, the player controls the main character of the series, the adventurer Adol Christin, on a new journey. Adol's ship has been attacked, and he loses his consciousness. After a while, he wakes up on a sea shore, rescued by the Rehda, elf-like people who live in a small village. Soon he becomes involved in a quest for mysterious treasure hidden somewhere on nearby islands, and has to face an ambitious empire officer who will not tolerate any rivals on his hunt.</p><p><em>The Ark of Napishtim</em> is an action role-playing game set (for the first time in the series) in a fully 3D environment. The game world is seamless, with transitional overworld areas connecting dungeons and settlements. Much of the game takes place in hostile areas, where the protagonist engages in fast-paced action combat against regular enemies and bosses. Like its immediate predecessor, the game abandons the \"bumping\" combat style of the earlier installments, opting instead for the more common active combat. Adol can execute regular attacks and jump, as well as combine those for upward and downward slashes, dash attacks, and longer jumps. Experience points and money are awarded for defeating enemies, and leveling up is fully automatized. Armor and accessories can be found in treasure chests or purchased.</p><p>There are only three swords during the game, each corresponding to a particular element. Each sword comes with its own unique magic spell. These swords can be leveled up in a specific workshop by spending blue crystals known as \"emel\", which are dropped by enemies. As the swords level up their attack power increases, and their respective magic spells gain levels and become more damaging as well.</p>"},{"name":"Yu Yu Hakusho: Ghost Files - Dark Tournament","year":2004,"developer":"Digital Fiction Inc.","url":"PS2_COLLECTION_PART27/Yu%20Yu%20Hakusho%20-%20Dark%20Tournament%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":1009854121,"score":6.3,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Fantasy > Licensed","desc":"<p><em>Yu Yu Hakusho: Ghost Files - Dark Tournament</em> is a 3D versus fighting game in which you take control of characters from the Yu Yu Hakusho series. The game is set during the Dark Tournament Saga off the series where Yusuke accepts an invitation by a demon named Toguro to a demon martial arts tournament. The price of this tournament is anything the winner desirers.</p><p>The game offer over twenty-five characters from the series who all have their own moves and attacks. The fighting takes place in eight destructible arenas. Beside the Dark Tournament Saga mode are also an arcade mode, Skirmish mode, Training mode and Token game mode.</p>"},{"name":"Yu-Gi-Oh! GX: Tag Force","year":2007,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_y/Yu-Gi-Oh%21%20Duel%20Monsters%20GX%20-%20Tag%20Force%20Evolution%20%28Japan%29.zip","filesize":628377966,"score":5.9,"genres":"Strategy > Top-down > Anime / Manga > Turn-based > Cards / tiles > Trading / collectible card > Licensed","desc":"<p><em>Yu-Gi-Oh! GX Tag Force</em> is a card game, following the TCG rules (OCG in Japan) and based on the first season of the <em>Yu-Gi-Oh! GX</em> anime series. The player controls a young boy who enrolls at a foreign student at the Duel Academy.</p><p>The game is divided in three parts. In the first one the player has to team up with one of the famous characters from the anime. There are different conversation options and each Sunday a Tag Duel is held with one of the chosen partners. Affection needs to be built up through conversations and gifts until a partner has six hearts. Eventually the Tag Force Tournament at the end of July needs to be won and that is where the second part starts. A final partner is chosen and the characters much progress through duels to acquire 90 GX Medals and make it to the final round of the tournament. In the third part all Shadow Riders (Steven Stars in Japan) must be defeated that have brainwashed other characters.</p><p>The protagonist starts with a water deck and gains cards, which can be purchased from the store with DPs, as time goes by. After completing the game it an be restarted with another character to gain DPs. The duels are played from an almost top-down view with turn-based card desk battles.</p>"},{"name":"Yu-Gi-Oh!: Capsule Monster Coliseum","year":2004,"developer":"Konami Computer Entertainment Japan, Inc.","url":"PS2_COLLECTION_PART27/Yu-Gi-Oh%21%20Capsule%20Monster%20Coliseum%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":3161505391,"score":7,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Anime / Manga > Turn-based > Trading / collectible card > Licensed","desc":"<p>This 3D board game consists of a series of duels, which are played with cards. The game has been split up in a Campaign Mode, in which you take on all levels of the Monster Coliseum on your own, a Free Battle Mode where you play skirmish matches against enemies defeated in the campaign, and a versus mode to take on a human opponent. Before starting, you have to choose a symbol, assign parameters to it (based on monster points, action points and power points) and buy a starter kit card deck.</p><p>In a typical campaign game, you start in the entrance hall, where you manage your cards and monsters. To duel, you choose one of the four areas with five levels each, and defeat the opponents. New monsters are acquired by winning the match. The turn-based duels are played as a card game. Both characters start with a deck of cards and a number of health points. When a health status reaches zero, the battle is over. You attack your opponent by summoning monsters and assigning abilities to them. Trick cards can be used to gain both offensive and defensive advantages. Before each duel, you have to pick a monster that is up for ante, and the fighting is influenced by various parameters, including the land form you are playing on.</p><p>On the game board, each monster is bound by a certain movement range and attack range. They can level up, evolve, or fuse to form more powerful creatures. The goal is to become King of Capsule Monsters, the highest rank in the Coliseum. If you have cleared the four areas, the final area, King Coliseum, will appear.</p>"},{"name":"Yu-Gi-Oh!: The Duelists of the Roses","year":2001,"developer":"Konami Computer Entertainment Japan, Inc.","url":"PS2_COLLECTION_PART27/Yu-Gi-Oh%21%20The%20Duelists%20of%20the%20Roses%20%28Europe%29%20%28Fr%2CDe%2CEs%2CIt%29.zip","filesize":1039549905,"score":6.8,"genres":"Strategy > 3rd-person (Other) > Turn-based > Cards / tiles > Trading / collectible card","desc":"<p>Loosely based on historical events that took place in England in the 15th century, known as the <em>Wars of the Roses</em> (a battle for power between the houses of Lancaster and York), <em>Yu-Gi-Oh! The Duelists of the Roses</em> sees the heroes of the <em>Yu-Gi-Oh!</em> manga and card game series, Yugi Muto and Seto Kaiba, assume the identity of the head of the Lancaster house (Red Rose, later the Tudor dynasty), Henry Tudor, and the leader of the Yorkist faction (White Rose), Christian Rosenkreuz, respectively. The player controls a Rose Duelist, who is initially sent by Henry Tudor (Yugi) and the Lancastrians to Stonehenge, with the mission of disrupting a barrier imposed by the White Rose forces. However, Rosenkreuz (Seto) arrives and offers the hero to side with the Yorkists. From that point on, the player can choose to follow either the Red or the White Rose, in two different scenarios.</p><p>Like most other <em>Yu-Gi-Oh!</em> video game adaptations, this is a strategy card game. The duels of the game take place on a 7x7 table; each player commands a \"Deck Leader\", who acts as the representation of the player character's hit point, as well as the central square on the map around which cards can be placed. Monsters can be navigated freely on the board, with the goal of surrounding and defeating the opponent's Deck Leader. Various field bonuses and card fusions are also present.</p>"},{"name":"Yukigatari: Renewal-ban","year":2005,"developer":"Takuyo Co., Ltd.","url":"sony_playstation2_y/Yukigatari%20-%20Renewal-ban%20%28Japan%29.zip","filesize":833249660,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>Originally released for PC (Windows) platform as hentai visual novel in 2001, it was ported to Dreamcast a year later as Limited Edition version which removed adult content but added renewed artwork and new scenario events. Later on, the new, non-adult, PC (Windows) version came out with yet additional scenarios and new character under the name \"Renewal Version\". Finally, in 2005, a PlayStation 2 version came out under the same title featuring most of those changes, and also includes bonus scenarios and various unlockable as well as already unlocked bonus content accessible via main menu.</p>"},{"name":"Yumemi Hakusho: Second Dream","year":2008,"developer":"PrincessSoft","url":"sony_playstation2_y/Yumemi%20Hakusho%20-%20Second%20Dream%20%28Japan%29.zip","filesize":2007528988,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>The protagonist, Yuuto Yumekawa, finally mustered courage to confess his feelings to his childhood friend and a girl he loved, Tamaki Amanogawa. But when he came to the point of admitting his love, he couldn't. Later that day, on her way back home, Tamaki was hit by a car and passed away. Gnawing at the cruel reality and the fact he could never tell her how he felt now, Yuuto fell in despair. While he was madly thinking \"what if...\", God of Death in a form of a girl came to him and offered him a second chance... one that may even bring Tamaki back to life.</p><p>Besides the obvious lack of adult scenes in comparison to PC version, PlayStation 2 release features additional character graphics, voice acting, and new scenario.</p>"},{"name":"Yumemishi","year":2006,"developer":"H℃","url":"sony_playstation2_y/Yumemishi%20%28Japan%29.zip","filesize":1328701752,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Fantasy > Romance","desc":"<p>Hirou Yumemura (夢村 広宇) is a high-school student, living with his grandmother after his parents died in a car accident. One day, he starts to experience deja-vu, reliving the events of the previous day. As he meets new people and notice various accidents happen around him, he starts to use his new found ability to try and prevent those events, some of which are done automatically, while others are determined by player's choices. The story features three chapters, each focusing around a different character. Only the first chapter is unlocked on the first play, and unless finished with a good ending, following chapters remain locked. Certain mysteries in the story get answered in the sequel, Yumemi Hakusho: Second Dream.</p><p>Many visual novel elements are present, from detailed system settings and customization to visual art and gameplay. Bonus menu becomes available after starting the main story, offering unlockable BGM tracks and CG artwork. Originally released for PlayStation 2, this game is romance without adult scenes, a year later the game was ported to PC (Windows) with some additional elements as well as sexual content. As a bonus content, this PlayStation 2 release of the game includes three postcards with artwork from the game.</p>"}]