[{"name":"Zapper: One Wicked Cricket!","year":2002,"developer":"Blitz Games Ltd.","url":"sony_playstation2_z/Zapper%20-%20One%20Wicked%20Cricket%20%28USA%29.zip","filesize":460030863,"score":6.3,"genres":"Action > 3rd-person (Other) > Diagonal-down > Platform > Shooter > Direct control > Fantasy > Comedy","desc":"<p>In this game the player controls a cricket named Zapper on a mission to save his brother. The protagonist will have to pass through six worlds divided into 20 levels, each with hazards to avoid and eggs to capture, meeting both friends and enemies that help and hinder his progress towards a diabolical nest-building magpie named Maggie. Zapper can move in four directions, climb vertical surfaces like trees and walls, and zap opponents with his electric antennae.</p>"},{"name":"Zatch Bell!: Mamodo Battles","year":2005,"developer":"Eighting Co., Ltd.","url":"sony_playstation2_z/Zatch%20Bell%21%20Mamodo%20Battles%20%28USA%29.zip","filesize":393512012,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p><em>Zatch Bell: Mamodo Battles</em> is a cel-shaded fighting game that is based off the 2003 anime <em>Zatch Bell!</em>, known as <em>Konjiki no Gashbell!!</em> in Japan. In this game there are fifteen playable characters, and seven game modes:</p><ul><li>Story Mode, lets you choose one of the six characters to play as and follow their stories.</li><li>Time Attack, this mode challenges you to see how fast you can clear all of the stages.</li><li>1P Mode, allows you to choose your character and an opponent and fight it with the opponent being the computer.</li><li>2P Mode, will allow you to choose your character and fight it with a friend.</li><li>Develop Mode, will let you distribute points to raise the characters abilities.</li><li>Bonus Mode, will let you Spend points to buy cards, view the card gallery, or input passwords to unlock secrets.</li><li>Practice Mode, will let you practice with the computer as your opponent.</li></ul>"},{"name":"Zatch Bell!: Mamodo Fury","year":2004,"developer":"Mechanic Arms","url":"sony_playstation2_z/Zatch%20Bell%21%20Mamodo%20Fury%20%28USA%29.zip","filesize":1066009821,"score":6.1,"genres":"Action > Behind view > Anime / Manga > Fighting > Licensed","desc":"<p>Every 1000 years, a tournament takes place on Earth to decide the most powerful Mamodo. This time, Zatch Bell is determined to win. The only problem? He can't fight alone. Assisting him is the human Kiyo, who, by reading spells from a book, can activate Zatch's powers.</p><p>In this 3D fighting game, you will control Kiyo, or one of 19 other characters, each with a associated Mamodo. You can either attack your opponent directly, or have your Mamodo attack with a spell. (Four attack spells, one defensive spell, and one super spell.) You can even switch control to your Mamodo directly, though this leaves you defenseless.</p><p><em>Zatch Bell! Mamodo Fury</em> features a rather long story mode, stage select mode, 1 and 2 player vs. mode, arcade mode, and several types of mini-games, for 1 to 4 players.</p>"},{"name":"Zathura","year":2005,"developer":"High Voltage Software, Inc.","url":"PS2_COLLECTION_PART27/Zathura%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":1367257357,"score":5.5,"genres":"Action > 3rd-person (Other) > Platform > Fantasy > Sci-fi / futuristic > Licensed","desc":"<p><em>Zathura</em> is a third-person platformer based on the 2005 fantasy science fiction film of the same name, which is in turn inspired by the book by Chris Van Allsburg. After an argument with his brother Walter, Danny goes into the basement of his house and finds an old mechanical board game. When they start to play the game, their house is catapulted into space, they get a large battle robot, and visit other planets in order to complete the game and return home.</p><p>You play in turn as either one of the brothers or the robot. Walter can melee combat with a wrench and shoot projectiles while Danny has a slingshot, and the robot can shoot lasers or a charged shot, and can charge an enemy and jump high. As they progress through the different levels cut-scenes advance the story. They can grab power-ups and need to fight boss enemies as well.</p>"},{"name":"Zero no Tsukaima: Maigo no Period to Ikusen no Symphony (Genteiban)","year":2008,"developer":"","url":"sony_playstation2_z/Zero%20no%20Tsukaima%20-%20Maigo%20no%20Period%20to%20Ikusen%20no%20Symphony%20%28Japan%29%20%28Genteiban%29.zip","filesize":1405918063,"score":"","genres":"Special edition > Physical extras","desc":"<p>The <em>limited edtiion</em> release of <em>Zero no Tsukaima: Maigo no Period to Ikusen no Symphony</em> contains:</p><ul><li>Zero no Tsukaima: Maigo no Period to Ikusen no Symphony</li><li><em>Zero no Tsukaima: Fantasy Force 2nd Impact</em> bonus disc</li></ul>"},{"name":"Zill O'll Infinite","year":2005,"developer":"KOEI Co., Ltd.","url":"sony_playstation2_z/Zill%20O%27ll%20Infinite%20%28Japan%29.zip","filesize":2989465649,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Zill O'll Infinite</em> is an enhanced version of Zill O'll. The gameplay system and the layout of the locations remain unchanged. The graphics are technically more advanced, with more detailed 3D character models and sharper-looking pre-rendered backgrounds. A few events have been altered, and in some cases different requirements must be met to advance relationships with certain characters. This version also introduces new characters, raising the amount of possible endings to 48 (as opposed to 24 in the original release). It also has a New Game+ feature which effectively adds a new opening scenario to the story.</p>"},{"name":"Zombie Attack","year":2004,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART27/Zombie%20Attack%20%28Europe%29.zip","filesize":253302747,"score":"","genres":"Action > Diagonal-down > Hack and slash > Horror","desc":"<p><em>Zombie Attack</em> is a 3D action game played from a birds eye perspective in which the player takes control of the female zombie hunter Fu Yue.</p><p>In the game the player has to fight zombies and along the way pick up survivors and guide them to the end of the map. Zombies can be attacked with a sword, gun or magical attack. The game offers seven levels and a variety of different zombies including bosses. Weapons like the players sword and gun can be leveled up.</p>"},{"name":"Zombie Hunters","year":2005,"developer":"Tamsoft Corporation"},{"name":"Zombie Hunters 2","year":2007,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART27/Zombie%20Hunters%202%20%28Europe%29.zip","filesize":576635202,"score":"","genres":"Action > 3rd-person (Other) > Hack and slash > Direct control > Horror","desc":"<p>READY FOR A BLOOD SPLATTERING ZOMBIE WAR?<br>Fight onslaught after onslaught of terrifying zombies to get to the source of a mysterious disease that turned a once-pleasant city into a gateway to hell!</p><p>MASTER MULTIPLE ATTACK COMBINATIONS!<br>SIZZLING SWORD-WIELDING SISTERS, CRAZY COMBAT ACTION & HARDCORE, BLOOD-CURDLING HORROR!<br>Increase your attack power by splattering yourself in Zombie blood! As you go into berserk mode, you'll kill everything in sight!</p><p>DOUSE YOURSELF IN ZOMBIE BLOOD!<br>Control 3 sets of tough sisters as you slice & dice zombies with loads of cool attacks. Increase your character's strength and skill to unleash a variety of jaw-dropping combination attacks.</p><p>CAN YOU SURVIVE THIS ONSLAUGHT OF FLESH AND BLOOD?</p>"},{"name":"Zombie Virus","year":2005,"developer":"Vingt et un Systems Corporation","url":"PS2_COLLECTION_PART27/Zombie%20Virus%20%28Europe%29.zip","filesize":137226805,"score":"","genres":"Action > Racing / Driving > 3rd-person (Other)","desc":"<p><em>Zombie Virus</em> is volume 95 in D3 Publisher's Simple 2000 series of budget games. Zombies have taken over Sunlight City. It's up to a young medical student to get behind the wheel of his ambulance and look for survivors in the dead city. Rescue engineers and mechanics so you can upgrade your ambulance with front and wheel mounted blades, rockets and brighter lights. Save police officers and soldiers to keep the morale of the survivors up or it's game over! If zombies climb onto your ambulance twirl the analog sticks wildly to shake them off and resume your mission.</p>"},{"name":"Zombie Zone","year":2004,"developer":"Tamsoft Corporation","url":"PS2_COLLECTION_PART27/Zombie%20Zone%20%28Europe%29.zip","filesize":172884715,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Hack and slash > Horror","desc":"<p>In <em>Zombie Zone</em>, you control Aya, a young girl who has lived with her father. An excellent swordsman, he has left his wife and the daughter Saki to live in a secluded place, teaching Aya sword techniques. His wife died, and Saki blamed the father for her death. She killed her own father, and went off to find an artifact to resurrect her mother. Now Aya must stop her own sister and avenge her father's death.</p><p>The gameplay is hack-and-slash with some advanced things put in. You're fighting against zombies, so your enemies are not very smart. It's basically Aya against a very large number of slowly moving enemies, a bit like in  Dynasty Warriors. There is a feature called \"sword fatigue\": if you don't clean your sword in time, it will get stuck in an enemy, giving him an advantage over you. There are also slight RPG elements. You can upgrade your characters by collecting orbs dropped by defeated enemies. At the end of each level, you can use the orbs to make Aya more powerful. Sometimes the enemies drop red orbs; if you collect enough of them, you turn into a demon. Your attacks become more powerful, but they also take away from your health.</p>"},{"name":"Zone of the Enders","year":2001,"developer":"Konami Computer Entertainment Studios, Inc.","url":"PS2_COLLECTION_PART27/Zone%20of%20the%20Enders%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":1515431931,"score":7.4,"genres":"Action > 3rd-person (Other) > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In the late 22nd century, humans have colonized Mars, and also set up a few colonies in Jupiter's orbit. Giant robots known as Laborious Extra-Orbital Vehicles (L.E.V.) have helped them to achieve this lofty goal. However, as time passed, the inhabitants of the Earth started to treat the space colonists, whom they called \"Enders\", with suspicion, subjecting them to harsh laws and repercussions. Eventually, some of the colonists founded rebel organizations, armed with particularly powerful mechas called Orbital Frames. A young colonist from Jupiter, Leo Stenbuck, unexpectedly comes into contact with an Orbital Frame named Jehuty. A terrible power is in his hands - will he use it for good, or for evil?..</p><p><em>Zone of the Enders</em> is an action game that primarily focuses on combat between the player-controlled Jehuty and hostile Orbital Frames. Jehuty can use an energy sword, an energy projectile, and various sub-weapons to defeat his foes. As the player progresses, Jehuty's arsenal grows, and he is able to learn new abilities. Jehuty can also hover and fly, grab and throw enemies, and use booster jets to move quickly and dodge enemy attacks. Some objectives require the player to minimize damage to nearby buildings and civilians.</p>"},{"name":"Zone of the Enders: The 2nd Runner","year":2003,"developer":"Konami Computer Entertainment Japan, Inc.","url":"sony_playstation2_z/Zone%20of%20the%20Enders%20-%20The%202nd%20Runner%20%28USA%29.zip","filesize":1886749730,"score":8.1,"genres":"Action > Behind view > Shooter > Direct control > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Dingo Egret is minding his own business, investigating a hidden power source Metatron, when out of the blue his mining team is ambushed by BAHRAM. He discovers that the source of the Metatron is actually an abandoned battle robot, Jehuty (seen in the original Zone of the Enders), and decides to use the machine against BAHRAM.</p><p>Dingo soon realises that there's more to the story than simply wanting to own a powerful machine, as treachery and evil power comes into play. It's up to you to control the Jehuty and fight BAHRAM .</p><p><em>Zone of the Enders: The 2nd Runner</em> is a sequel to <em>Zone of the Enders</em>. Like its predecessor, it is an action game that concentrates on piloting the giant mecha Jehuty (walking or hovering in the air), engaging in battles against other robots, using his energy sword and secondary weapons and techniques. Unlike the first game, there is no \"world map\" to travel on; the player is taken to the next stage automatically. Jehuty can upgrade his abilities by destroying enemies and gathering experience. Sub-weapons are acquired after having successfully eliminated a boss enemy. The game also allows the player to participate in a battle against a friend in a two-player battle mode, or try out the special VR training missions.</p>"},{"name":"Zone of the Enders: The 2nd Runner - Special Edition","year":2003,"developer":"Konami Computer Entertainment Japan, Inc.","url":"PS2_COLLECTION_PART27/Zone%20of%20the%20Enders%20-%20The%202nd%20Runner%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Special%20Edition%29.zip","filesize":2314606749,"score":7.7,"genres":"Action > 3rd-person (Other) > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>The Special Edition of Zone of the Enders: The 2nd Runner is the localized European and Oceanian release of the game. In addition to the base game as it was released in the United States and Japan, it contains a number of improvements and additions:* New gameplay sequences and polygon demos</p><ul><li>A new opening demo</li><li>More secret areas</li><li>New 3D models</li><li>Improved graphics</li></ul><p>There is no regular European version of the game.</p>"},{"name":"Zoo Puzzle","year":2004,"developer":"Kiteretsu Inc.","url":"PS2_COLLECTION_PART27/Zoo%20Puzzle%20%28Europe%29.zip","filesize":494822101,"score":7.6,"genres":"Action > Puzzle > Fixed / flip-screen > Anime / Manga > Tile matching puzzle > Point and select","desc":"<p>The zoo animals have revolted against the zoo keeper. It is your job to restore order and \"capture\" all of the animals.</p><p>In this fast-paced match-up game, players select animals of the same type using either the touch-screen or a standard controller. Line like animals up in rows by swapping them from spot to spot in the time allowed. </p><p>There are five varied game play modes: Normal, Tokoton, Quest, Time Attack and 2P.  Normal mode has you clearing a set amount of animals each level before progressing to the next.  Tokoton is similar to Normal, but has all the animal amounts set to 100 before you'll level up.  Quest has you playing ten set stages with specific goals (such as only capturing animals of a certain type) that you must attempt to achieve.  Time Attack has you aiming to get the highest score possible in the time limit.  2P has two players battling it out against each other.</p>"},{"name":"ZooCube","year":2006,"developer":"PuzzleKings LLP","url":"PS2_COLLECTION_PART27/ZooCube%20%28Europe%29.zip","filesize":375916425,"score":7.3,"genres":"Puzzle > Diagonal-down > Fixed / flip-screen > Real-time > Falling block puzzle > Tile matching puzzle > Asia > Egypt (Ancient) > Middle East > Sci-fi / futuristic","desc":"<p><em>ZooCube</em> is a puzzle game that involves matching parts of animals to eliminate them and get points.</p><p>The Cube is a 3D object in the center of the screen and the animal parts fall towards it. In a similar style to Tetris the player must keep the sides from building too high. It is a quickly paced, real-time game and at later stages the player struggles to juggle the cube items to keep eliminating animals on all sides. Power-ups can be used to destroy animal parts, get points, or to make life more difficult for the player's opponents, such as by speeding up the rate at which animal parts fall to their cube, or reduce how fast their cube can spin.</p>"},{"name":"Zwei!!","year":2004,"developer":"Nihon Falcom Corp.","url":"sony_playstation2_z/Zwei%21%21%20%28Japan%29.zip","filesize":1034389996,"score":"","genres":"Action > Role-playing (RPG) > Diagonal-down > Anime / Manga > Japanese-style RPG (JRPG)","desc":"<p>Magic was once strong in Granvallen, the miraculous world of floating continents. A thousand years ago, six demons lords rebelled against the benevolent twin goddesses Aplyes and Espina. Thus the Great Sorcery War began, in which humans fought valiantly against demons. Tiara, the Priestess Princess of the Holy Kingdom of Valence, and the Crusader Paradys managed to defeat the demons, but the force of magic that penetrated Granvallen began to fade as a result.</p><p>Five hundred years later, a mysterious masked man enters the peaceful village of Puck on the continent of Arshes. Two fourteen-year-old children, the girl Pipiro and the boy Pokkle, witness how he enters the village temple, murders a guard, and steals six Goddess statues, the village's biggest treasure. The kids decide to leave Puck, track down the stranger, bring him to justice, and perhaps gain fame and fortune in the process.</p><p><em>Zwei!!</em> is an action role-playing game with bright, cartoon-like 2D visuals. The player can switch between Pipiro and Pokkle at any time; when controlling one character, the other is handled by the AI. Pipiro uses magical projectiles while Pokkle fights with a drill-like close-combat weapon. Elemental and combo attacks can be used to exploit enemy weakpoints and force them to drop better items.</p><p>The player accesses individual locations from the overworld. Most of them are labyrinthine dungeons with multiple levels populated by enemies. Experience points are obtained from food dropped by enemies or found in the game world. Food items can be combined in a restaurant to create more powerful ones with a higher experience count. The player can also acquire a pet animal (a cat or a dog), who follows the protagonists, helps them collect items, and unlocks specific combo attacks.</p>"}]