[{"name":"Aero Blasters","year":1990,"developer":"Kaneko Co., Ltd.","url":"f#Aero%20Blasters%20%28USA%29.zip","filesize":292779,"score":7.1,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p><em>Air Buster</em> is a fast side-scrolling shooter. The player controls a small craft through different levels with many enemies. Every level ends with a boss and some sections speed up the gameplay, offering fast obstacle courses both horizontally and vertically scrolling. Flying orange pods release many power-ups at once, enhancing the ships with new or more powerful lasers, wing men and shields. The player can also hold the fire key to charge a blast that removes all enemy bullets from the screen and deals damage to all enemies. With an unforgiving difficulty, every hit is fatal, but the game can be continued from any point as long as there are lives and credits left. The game can be played with two players cooperatively.</p>"},{"name":"After Burner II (J)","year":1990,"developer":"SEGA Enterprises Ltd.","url":"g#A/After%20Burner%20II%20%28JP%29.pce","filesize":524288,"score":6.8,"genres":"Action > Behind view > Arcade > Shooter > Flight / aviation","desc":"<p><em>After Burner II</em> is an updated re-release of After Burner. Besides extra levels, a few new enemies, a few touches at the soundtrack and more disposable missiles, the biggest addition is the ability to slow down or speed up manually. The rest of the gameplay remains identical.</p><p>Despite being called <i>After Burner</i>, most ports to home computers and consoles are based on this version. The NES, Amiga and Commodore 64 received two different ports with significant technical differences. This entry documents the original ports and the second ones can be found under the following entries: NES and Amiga / C64.</p>"},{"name":"Air Zonk","year":1992,"developer":"Naxat Soft","url":"f#Air%20Zonk%20%28USA%29.zip","filesize":324363,"score":7.6,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>In 1992, Hudson Soft expanded upon the Bonk's Adventure franchise they had built by creating <em>Air Zonk</em>, a 2D side-scrolling \"cute 'em up\" shooter set in a cyberpunk-esque future. While <em>Air Zonk</em> differed from its successor in terms of gameplay, the cartoonish style of the Bonk series could still be seen all throughout the game, especially in the graphics, the characters, &amp; of course, Zonk himself.</p><p><em>Air Zonk</em> may appear to feature a candy cartoon coating on the outside, but it's still a traditional shoot-'em-up at heart. You still have a selection of your basic weapon power-ups (8 in total here), but spread guns &amp; powerful bursts are now represented by killer decks of cards &amp; giant metal mandibles. Large, imposing endbosses are still the norm, but here your foes range from giant heaps of living garbage to killer football players. And outer space? Who needs to blow up things there when you have other venues (5 in total) such as a gigantic stadium to do it in?</p><p>In addition to all of this, <em>Air Zonk</em> gives you a feature that allows you to choose from one of 10 \"friends\" at the beginning of each level who will fight by your side once you pick up a certain power-up. These friends range from giant scud missiles to living dump trucks to floating cow-things, among others. Pick up another power-up, &amp; Zonk &amp; his friend combine to create a powerful hybrid form, featuring some of the strangest attacks you may ever see in a video game.</p><p>So will Zonk be able to defeat King Drool, rescue the moon from his clutches, &amp; save the world? As usual, the answer is up to you...</p>"},{"name":"Alien Crush","year":1988,"developer":"Naxat Soft","url":"f#Alien%20Crush%20%28USA%29.zip","filesize":159334,"score":6.9,"genres":"Action > Top-down > Pinball > Sci-fi / futuristic","desc":"<p><em>Alien Crush</em> is an alien-themed video pinball game. The graphics feature strong similarities to the art from the <em>Alien</em> movies, and everything has a dark and sinister look.</p><p>The main table has numerous moving targets and ball locks and is two screens high. There are at least three bonus games that are accessible from the top screen. Bonus games consist of knocking out moving targets on a separate single-screen bonus table.</p>"},{"name":"Altered Beast","year":1989,"developer":"Team Shinobi"},{"name":"Aoi Blink","year":1990,"developer":"Westone Co., Ltd.","url":"g#A/Aoi%20Blink%20%28English%20Translated%2C%20Rev%200.99b%29.pce","filesize":393216,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Licensed","desc":"<p><em>Aoi Blink</em> is a side-scrolling platformer based on the TV anime series of the same name. The five levels are similarly built as the ones in Super Mario Bros. 3: they are divided into various areas which are reached through a map screen with branching paths. Those areas need to be solved to be able to walk further on the map. </p><p>The speciality of this game is that the player can switch between three characters with different abilities on the fly, e.g. one can jump high and another has a better gun. Those are important to be able to solve the challenges the levels bring, mostly consisting of traditional platforming and avoiding/shooting enemies. However, the boss area at the end of the level map has to be opened with a master key. There is one hidden in every area.</p><p>The three characters are based on characters of the series and change depending on the level. The health pool is shared between all characters and losing all hearts results in losing a life. Hearts can be refilled by collecting money which is left behind by killed enemies.</p>"},{"name":"Appare! Gateball","year":1988,"developer":"Westone Co., Ltd."},{"name":"Atomic Robo-Kid (J)","year":1990,"developer":"UPL Co., Ltd","url":"g#A/Atomic%20Robo-Kid%20Special%20%28JP%29.pce","filesize":524288,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>As the half-human half-cyborg flying machine of the title, you are faced with 28 levels to clear of enemies. The gameplay is horizontally scrolling. Your unit is able to fly and then hold at a certain level in space. Defeated enemies often release gems, which can be collected towards power-ups. These include more powerful or multi-directional firing.</p>"},{"name":"AV Poker","year":1992,"developer":"Games Express"}]