[{"name":"Ballistix","year":1991,"developer":"Reflections Interactive Limited","url":"f#Ballistix%20%28USA%29.zip","filesize":109863,"score":6.7,"genres":"Action > Top-down > 2D scrolling > Arcade > Direct control","desc":"<p>Psygnosis' <em>Ballistix</em> is an arcade game in which you have to manipulate a ball in order to score a goal with your opponent. To do this, you will control an arrow that defines a direction, and pressing the fire key will launch a ball from this arrow in the direction the arrow points to; by launching balls at correct angles, you will manipulate the main ball and control the way it moves. Ballistix also keeps certain physics laws (namely gravity and friction), and will present you with varying obstacles in either one or two player mode.</p>"},{"name":"Bari Bari Densetsu (J)","year":1989,"developer":"Taito Corporation","url":"g#B/Bari%20Bari%20Densetsu%20%28JP%29.pce","filesize":393216,"score":"","genres":"Racing / Driving > Behind view > Arcade > Motorcycle > Track racing > Licensed","desc":"<p><em>Bari Bari Densetsu</em> is a racing game based on the anime of the same name. The player takes the role of a young athlete who takes part in the motorcycle World Grand Prix. Every race consists of a qualifying and the race itself, the goal of course being to gather a good position in the end. The game also features some basic bike customization in which the player can change the tires, brakes, engine, suspension or mission before a race. The weather influences the bike's performance and handling, depending on the bike parts and the course. Additionally there is a travel mode in which the 16 courses can be chosen freely.</p>"},{"name":"Barunba","year":1990,"developer":"ZAP Corporation","url":"g#B/Barunba%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":524288,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Shooter","desc":"<p><em>Barunba</em> is a shooter in comic style. </p><p>You control a spacecraft that has a weapons ring around it and therefore can shoot in various directions. Weapons can be upgraded by shooting enemies and picking up the pods they might change in. The levels automatically scroll and move in all directions. Each level has its own theme and is quite long and has two bosses: a mid-level boss and an end boss. Both bosses have to be defeated before you can continue to finish the level or go to the next. A status bar at the bottom of the screen shows the energy bar of your ship and it's game over when that bar has depleted.</p>"},{"name":"Batman (J)","year":1990,"developer":"Sun Electronics Corp.","url":"g#B/Batman%20%28JP%29.pce","filesize":393216,"score":6.8,"genres":"Action > Diagonal-down > Licensed","desc":"<p>The TurboGrafx-16 version of <em>Batman: The Video Game</em> is a top-down maze-like game, somewhat similar to Pac-Man or Bomberman.</p><p>The game consists of five stages based on the movie: the Streets of Gotham, Flugelheim Museum, AXIS Chemical Factory, the Parade and the Cathedral, where Batman finally faces the Joker. The first four stages are divided into 12 sub-stages or mazes. Each main level has its own objective, which basically consists of finding items in the mazes: collecting \"smilex\" components in the streets of Gotham, cleaning paintings at the museum, planting bombs at the factory and cutting off the ropes of Joker's balloons at the parade. Before each level, a cutscene with scenes from the movie is displayed.</p><p>Batman can attack his enemies with his Batarang. Through the levels, he will collect items which will upgrade his speed and give his Batarang a longer range and multiple shots.</p>"},{"name":"Battle Chopper","year":1989,"developer":"Irem Corp."},{"name":"Battle Lode Runner (J)","year":1993,"developer":"Hudson Soft Company, Ltd.","url":"g#B/Battle%20Lode%20Runner%20%28JP%29.pce","filesize":262144,"score":7,"genres":"Action > Puzzle > Side view > Platform > Direct control","desc":"<p>Originally released only in Japan on the PC Engine (TurboGrafx-16), <em>Battle Lode Runner</em> is a sequel to Lode Runner and its major draw is a 5 player mode. Players move around several platforms collecting gold. Various enemies inhabit the levels, and the player, armed with a drill, attempts to drill holes to capture the enemies. Unfortunately, this does not defeat the enemies, only disables them for a short time. After a few seconds, the enemies respawn and resume their chase of the player.</p><p>The five-player option was new to any incarnation of Lode Runner, and operates in a very similar manner to Bomberman, except with hole drilling instead of bombing.</p>"},{"name":"Battle Royale","year":1990,"developer":"Incredible Technologies, Inc.","url":"f#Battle%20Royale%20%28USA%29.zip","filesize":319398,"score":"","genres":"Sports > 3rd-person (Other) > Wrestling","desc":"<p><em>Battle Royale</em> is a wrestling game that presents last-man-standing type battles between up to five wrestlers. </p><p>The game features three difficulty settings, five wrestlers to choose from, and two game modes. For single players only is the tournament mode, featuring 15 possible consecutive battles, beginning with one-on-ones and continuing up to a full five-man match. In the second mode, the number of competitors can be freely set for a single match. There is a catch in how a player chooses their wrestler, though: before the match, the fighters' managers duke it out on their way to select their favorite fighter - temporarily knocking out the opposition is encouraged.</p><p>The matches take place in a side view of the ring. The A and B buttons are used for a variety of kicks and punches and the Select button can be used for an extra powerful attack. The goal is to toss the opponents out of the ring and remain the last man standing.</p><p>The single match mode can be played by up to five human players.</p>"},{"name":"Benkei Gaiden","year":1989,"developer":"Sun Electronics Corp."},{"name":"Blazing Lazers","year":1989,"developer":"Compile","url":"f#Blazing%20Lazers%20%28USA%29.zip","filesize":208512,"score":8.2,"genres":"Action > Top-down > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Blazing Lazers</em> is a top-down shooter featuring 9 levels of varied and fast-paced action. The story here is the usual save-the-world variety. You must pilot your ship against 8 super-weapons and ultimately destroy the menace once and for all.</p><p>The power-up system in Blazing Lazers deserves special mention. There are four main types of weapons, and each type of weapon can be upgraded several times to produce an incredible amount of firepower. In addition, there are secondary weapons systems that provide you with shields, homing missiles, multi-fire units, or super weapon power.</p>"},{"name":"Bloody Wolf","year":1989,"developer":"Data East Corporation","url":"f#Bloody%20Wolf%20%28USA%29.zip","filesize":215995,"score":7.2,"genres":"Action > Top-down > Shooter > Spy / espionage","desc":"<p>Snake and Eagle, two commandos of the Bloody Wolf special forces, receive instructions from their commander to destroy the enemy's heavily armed base to rescue the President and any allies who have been reported as MIA.</p><p>This top-down run and gun shooter takes a nod to Contra-style gameplay, allowing the mercenaries to blast their way through eight levels of enemy opposition armed with only a knife and a machine gun.  </p><p>Along the way, new weapons such as shotguns, bazookas, flash bombs, and grenades can be added to the arsenal, as well as health and defensive power-ups.  Players can even find a motorcycle to ride in some areas, or swim through certain parts of a level.</p>"},{"name":"Bodyconquest II: Kyūseishu","year":1993,"developer":"Games Express"},{"name":"Bōken Danshaku Don: The Lost Sunheart","year":1992,"developer":"Manjyudo Co., Ltd."},{"name":"Bomberman","year":1990,"developer":"Hudson Soft Company, Ltd.","url":"f#Bomberman%20%28USA%29.zip","filesize":193445,"score":7.9,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Direct control > Sci-fi / futuristic","desc":"<p>The black spaceman kidnapped Bomberman's beloved and brought her to his chambers in the castle, far beyond his reach, over the rivers, forest and mountains. Bomberman's job is to save her, battling the sea of the enemies, with only bombs at his disposal.</p><p>The range of Bomberman's bomb explosions can be upgraded with time, but if he dies, the range resets back to the minimum range and Bomberman loses his previous skills. Some updates can make Bomberman walk through the walls, increase his speed, and give him some other assets to aid him in his quest to save the woman he loves.</p><p>This top-down action-arcade game consists of nine levels per stage, each tougher than the other, and each final one consisting of the boss that will have to be dealt with. Bomberman can move horizontally and vertically and lay down bombs behind him, thus evaporating the enemies, but beware: Bomberman can block himself with his own bomb, and thus become a victim of his own bomb.</p>"},{"name":"Bomberman '93","year":1992,"developer":"Hudson Soft Company, Ltd.","url":"f#Bomberman%20%2793%20%28USA%29.zip","filesize":389569,"score":8,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Direct control > Sci-fi / futuristic","desc":"<p>Black Bomberman has cut power to the galaxy's own power station, which resulted in disputes between seven planets, and it is up to White Bomberman to restore power to the station and bring peace to the planets again. The objective is the same as in Dyna Blaster: use bombs to destroy all enemies in a level. Once you have destroyed them all, find the exit hidden in a block so you can be transported to the next level. A block will also flash yellow to let you know that a power-up can be obtained there. Power-ups include more bombs, manual detonation, extra lives, and extended flames. Occasionally, you also get the ability to walk through bombs or walls, or to kick bombs.</p><p>If you manage to reveal the exit before all enemies are destroyed, it remains in an \"inactive\" state, meaning that you cannot be transported to the next level until you blow up all the enemies and therefore making it \"active\". If you accidentally blow up the exit, whether it is active or not, or if time runs out, you will unleash a few enemies that you also need to destroy. After every eighth level, there is a boss that you need to destroy to proceed to the next planet.</p><p>Besides this Normal mode, there are two other modes: Battle and Versus. In Battle, you can play against four human- or computer-controlled players in one of seven stages, each with different features like warp holes, conveyor belts, revolving doors, and much more. In Versus, you play head-to-head against a friend using the TurboExpress for non-stop action. Regardless of these two modes, you can still obtain power-ups to give out some punishment against your fellow players, and the maximum number of wins can be set before play.</p>"},{"name":"Bonk 3: Bonk's Big Adventure","year":1993,"developer":"A.I Co., Ltd.","url":"f#Bonk%20III%20-%20Bonk%27s%20Big%20Adventure%20%28USA%29.zip","filesize":549168,"score":7.8,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p><em>Bonk's Big Adventure</em> is the third instalment in the side-scrolling platformer series. As in previous games, the player assumes the role of a caveman named Bonk who headbutts his way through various enemies in order to defeat King Drool. Familiar moves include swinging on trees, bouncing off walls, breaking blocks and climbing walls with his teeth. Compared to the previous games, he walks and moves a little faster.</p><p>Bonk has the new ability to pick up red and blue candy power-ups that make him grow or shrink and grab a flower copter. As always, there is plenty of platforming and enemies to discover. The game consists of seven rounds, set in the Dinosaur Kingdom, finished off with a boss. At the end of each stage, 16 smileys can be exchanged to play up to eight different bonus stages (2 smileys per stage needed). New level elements include ziplines and sewer pipes. The game also features a cooperative multiplayer mode.</p>"},{"name":"Bonk's Adventure","year":1989,"developer":"Atlus","url":"f#Bonk%27s%20Adventure%20%28USA%29.zip","filesize":228074,"score":7.7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Prehistoric","desc":"<p><em>Bonk's Adventure</em> is a prehistoric platform game where you are in control of a large bald headed caveman, guiding him through the levels taking out all manner of strange prehistoric creatures that get in your way including King Drools henchmen - all in effort to free the captured/controlled residents of Moonland (bosses) - including the Princess Za from King Drool attempted take over.</p><p>The game is not unlike other platform games of the era. Though it's unique in that you can climb walls and swing on rope with your teeth and your only method of attack is head butting enemies - straight forward or dive bomb style. The game starts off with simplistic point A to point B style, but focuses more on exploration in the later stages, which include finding hidden bonus areas. </p><p>The game is also known for its trademark gameplay mechanism of 'spin attack', where Bonk floats through the air if you have the turbo button on. This can be used to float around the level and reach areas for extra/hidden items, but also as a method of attack as well. The game starts you off with 3 hearts, but allows you to increase this number when you find special heart container items, allowing Bonk to take a number of hits before dying.</p><p>A variety of bonus stages can be found throughout the game, which provide bonus points upon completion and thus resulting in accumulating extra lives. Enemies themselves can be 'milked' for points in that you can keep 'bonking' their dead bodies and not letting them hit the ground. Spin attack is another method for doing this.</p>"},{"name":"Bonk's Revenge","year":1991,"developer":"Red Company Corporation","url":"f#Bonk%27s%20Revenge%20%28USA%29.zip","filesize":350769,"score":8.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>Bonk has his revenge on King Drool III in his second game for the TurboGrafx.  It's not exactly clear why Bonk is so vengeful, but it appears that King Drool is responsible.  Bonk uses his over-sized cranium as a lethal weapon in this sequel.</p><p>The gameplay in this adventure is very similar to the first game.  Bonk has  head-butting, head-stomping, and fire-breathing moves when he eats some spicy meat.</p>"},{"name":"Bonze Adventure","year":1990,"developer":"Taito Corporation"},{"name":"Boxyboy","year":1990,"developer":"Thinking Rabbit","url":"f#Boxyboy%20%28USA%29.zip","filesize":73088,"score":"","genres":"Puzzle > Top-down > Direct control","desc":"<p><em>Boxyboy</em> is a Soko-Ban variant, explicitly based on the gameplay of the original version by Thinking Rabbit. The gameplay is unchanged, but the game features 250 new levels. They take place in five different countries with their own graphics set.</p><p>The basic principle: The player works in a warehouse and needs to clear out the boxes which are spread out over the level. Those boxes have to pushed into certain places of the level which are marked. However, the player character can only push a box; pulling is out of the question. This means it is possible to create a dead end by pushing a box in the wrong way. If that happens, the undo function can be used to take back the last steps.</p>"},{"name":"Bravoman","year":1990,"developer":"Namco Limited","url":"f#Bravoman%20%28USA%29.zip","filesize":274449,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade","desc":"<p>The evil Dr. Bomb has taken over Nitta village and only you, an ordinary salary man, can stop his evil plans by transforming into the fabulous superhero Bravoman!</p><p>The game is a side-scrolling action platformer. As Bravoman, you have the power to elongate your members depending on how long you press each button allowing you to jump higher or punch enemies on the other side of the screen.</p><p>Features 22 stages filled with bizarre settings and enemies, all rendered using colorful 2D graphics.</p>"},{"name":"Break In (J)","year":1989,"developer":"Hudson Soft Company, Ltd.","url":"g#B/Break%20In%20%28JP%29.pce","filesize":262144,"score":"","genres":"Sports > Top-down > Pool / snooker","desc":"<p><em>Break In</em> is a pool simulator. The game features six different billiard games, including 9 Ball, Rotation, and Carom. It also features different modes: Simulation, Action, and Technique. Up to four players may play.</p>"},{"name":"Bull fight: Ring no Hasha (J)","year":1989,"developer":"Cream","url":"g#B/Bull%20Fight%20-%20Ring%20no%20Hasha%20%28JP%29.pce","filesize":393216,"score":"","genres":"Action > Sports > Side view > 2D scrolling > Fighting > Boxing > Martial arts","desc":"<p><em>Bullfight: Ring no Hasha</em> is a boxing game in which the player takes part in a competition with eight boxers. The tournament consists of four fights and a finale and each boxer can be controlled by a human player. The boxers have different statistics (strength, agility and endurance) which can be improved between fights with a training fight. Each boxer has four moves (left swing, right swing, uppercut and dodge) and a hit both depletes the opponent's energy bar and gives points. Similar to real boxing, those points are used to determine the winner if no boxer is knocked out during the regular rounds. A knockout happens when the energy runs out, but when the player mashes a button fast enough when the boxer is given a count, he stands up again with a partly replenished energy bar. </p><p>Additionally there is also a side-scrolling fighting game included. Here the player walks from left to right and fights enemies in martial arts melee combat.</p>"},{"name":"Burning Angels (J)","year":1990,"developer":"Naxat Soft","url":"g#B/Burning%20Angels%20%28JP%29.pce","filesize":393216,"score":"","genres":"Action > Top-down > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>The Burning Angels are two scarcely clothed women who fight with space ships. Their current goal is to rescue the head of a science project who was kidnapped by aliens. Now they head into their ships, fly through the vertically scrolling levels and kill everything they see, including several boss enemies. Killed enemies leave behind power ups which reward five extra weapons, e.g. missiles or drones, which can be used simultaneously or a smart bomb equivalent. The player has a health bar which decreases when the ship is hit by enemies and when it is completely empty, the game is over because there are no continues or extra lives. Similarly, the death of one players ends the game when using the co-operational multiplayer mode.</p>"}]