[{"name":"Cadash","year":1991,"developer":"Taito Corporation","url":"f#Cadash%20%28USA%29.zip","filesize":259157,"score":7.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > RPG elements > Fantasy","desc":"<p>Trouble is in the kingdom of Dilsarl: the young, beautiful princess Salasa was abducted by the evil arch-mage Balrog. The king seeks help from the four best warriors of the country. The task is clear, but not so simple: find Balrog, destroy his evil minions and other monsters roaming the land, and rescue the princess.</p><p><em>Cadash</em> is a platform action role-playing game. The player chooses one of the four character classes in the beginning of the game: fighter, priestess, mage, or ninja (the Genesis version has only two characters: fighter and mage). The protagonist fights his or her way through dungeons, attacking physically or casting spells (as priestess or mage). Like in regular platform games, there are places where the player character is required to jump, duck, or climb. The protagonist gains experience for defeating monsters, and their level rises in a true RPG fashion.</p>"},{"name":"Champion Wrestler (J)","year":1990,"developer":"Taito Corporation","url":"g#C/Champion%20Wrestler%20%28JP%29.pce","filesize":393216,"score":"","genres":"Sports > Side view > Wrestling","desc":"<p><em>Champion Wrestler</em> is a wrestling game where you have the choice of eight fighters to become champion. You have various moves to use to beat your opponent into submission including kicks, punches and throws. The action is viewed from the side at an elevated angle showing the whole ring. If you leave the ring you have a small time limit to get back into the ring or it's fight over. Up to four players can play and the multi-player options are one player versus the computer, two players fighting each other, two players fighting together against the computer or four players split into two teams fighting each other.</p>"},{"name":"Champions Forever Boxing","year":1991,"developer":"Distinctive Software, Inc.","url":"f#Champions%20Forever%20Boxing%20%28USA%29.zip","filesize":339090,"score":"","genres":"Sports > Behind view > Fixed / flip-screen > Boxing > Licensed","desc":"<p><em>Champions Forever Boxing</em> is a boxing game licensed from the 1989 documentary about the sport, featuring the likenesses of five all-time greats: Ali, Foreman, Frazier, Holmes and Norton. Players can both control the legendary boxers or measure up against them in the ring.</p><p>The game includes single player exhibition and career modes, a two-player versus mode and an auto-play mode which sees AI boxers taking each other on for demonstration. Career mode starts in 1968 and lasts up to fifteen years, with one fight per year, taking into account the actual historical standings of the featured boxers. In career mode, all fights last 12 rounds, while in the other modes the number of rounds can be set between 3 and 12.</p><p>Fights are shown from the side of the ring. Controls allow for five different punches: Button II launches a jab, while button I in combination with a direction button enables left and right hooks, a body blow and an uppercut. Pressing Run blocks high, Run + Down blocks low. Clinching is possible when in close proximity and it is also possible to taunt the opponent with a showboating move. Strength and stamina meters show the condition of the boxer: the opponent landing a blow lowers strength, throwing punches lowers stamina. When strength is depleted, the boxer is knocked down and must button-mash to get back up, the difficulty of which increases with each knockdown.</p><p>Rounds last 3 minutes. Between rounds, the corner screen appears for 30 seconds, showing judges' scores, statistics about punches landed, successful blocks and knockdowns made and a visualization of the damage to the boxers' faces. In the 30 seconds, it is possible to either regain strength or stamina or to increase the power of certain punches.</p><p>Progress in career mode is stored via password or backup memory on a TurboGrafx-CD or with a TurboBooster-Plus.</p>"},{"name":"Chase H.Q.","year":1990,"developer":"Taito Corporation","url":"f#Taito%20Chase%20H.Q.%20%28USA%29.zip","filesize":228441,"score":6.8,"genres":"Action > Racing / Driving > Behind view > Automobile > Crime","desc":"<p>As an undercover agent of Chase Headquarters, your job is to patrol the streets and track down five criminals. You are given a mission briefing before you start which gives information on the suspect and what car they drive. Then you drive across the city without crashing into other cars, and catch up with the criminal's car. To arrest the suspects, you must keep bumping into their car until it is no longer functional. And you have to do this under a strict time limit. You can't afford to crash into cars or buildings or you waste time getting on the road again. </p><p>However, once you've caught up with your suspect, you are given more time. Your car is also equipped with turbo boosts, which you can use to gain extra speed if you are way behind the criminal. Each arrest is based on a \"suspicion\".</p>"},{"name":"Chew Man Fu","year":1990,"developer":"Now Production Co., Ltd.","url":"f#Chew%20Man%20Fu%20%28USA%29.zip","filesize":145313,"score":6.6,"genres":"Action > Top-down > Platform","desc":"<p>Chew Man Fu has set a curse to rob the world of fried rice, egg rolls and all its other favourite foods. To stop him you must work through 550 rounds, clearing them by placing four different coloured balls into the appropriately-coloured hole.</p><p>Gameplay is something of a Pengo variant, as the single-screen levels are inhabited by enemies, who can be killed by firing one of the balls at them at speed. When it hits one it will continue moving in the same direction, rebounding off walls if neccessary, and pushing you backwards slightly if it comes back to you - but it can be instantaneously brought back under control. Blocks can also be moved at a more casual speed, including round corners. Once a block is placed onto its spot, it can be used again as a weapon. The levels are in a maze style, and parts of this can be opened up. The game also includes a small bonus Kick-Ball game for 2 players, which doubles as practice with the control system.</p>"},{"name":"Chibi Maruko-chan: Quiz de Piihyara","year":1992,"developer":"Namco Limited"},{"name":"China Warrior","year":1987,"developer":"Hudson Soft Company, Ltd.","url":"f#China%20Warrior%20%28USA%29.zip","filesize":131145,"score":4.8,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Martial arts","desc":"<p><em>China Warrior</em> is a game in the spirit of Kung-Fu Master. The story is of a Kung-Fu warrior named Wang who sets out to destroy the Dark Emperor and liberate China. The gameplay is a side-scroller and the goal of the game is to make it to the end of the stage and battle its boss, bashing bad guys along the way. There are only three types of attack; punch, kick and jump-kick and there are four stages in all.</p>"},{"name":"Circus Lido (J)","year":1991,"developer":"Uni Post Company Ltd.","url":"g#C/Circus%20Lido%20%28JP%29.pce","filesize":262144,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Platform > Direct control","desc":"<p><em>Circus Lido</em> is a single-screen action puzzle game in which you have to help the chameleon Leon escape from forty mazes. Leon cannot jump, but can use his tail to grab and climb onto some platforms, and can swallow and spit out enemies. Feed all enemy critters in a stage to the flesh-eating plants to open the exit.</p>"},{"name":"City Hunter","year":1990,"developer":"Sun Electronics Corp.","url":"g#C/City%20Hunter%20%28English%20Translated%2C%20Rev%201.1%29.pce","filesize":393216,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Shooter > Licensed","desc":"<p><em>City Hunter</em> is based on the eponymous manga by Tsukasa Hojo. The story focuses on Ryo Saeba, a young man with a mysterious past, who founds the City Hunter team in Shinjuku, Tokyo. The City Hunter is an underground private detective agency, which takes care of particularly dangerous cases. In the game, the player is able to play through three of such cases, which are unrelated to each other and can be played in any order. </p><p>The gameplay is essentially that of a side-scrolling shooter. The player navigates Ryo through the stages, dispatching of the frequently appearing enemies with his gun. The gameplay system is rather simple; multiple mission items may be carried but different weapons or power-ups are not available for use. The levels are usually designed as vast indoor areas, with many rooms Ryo can enter. The structure of the game also reveals mild adventure elements: often it is necessary to speak to a character, receive an item (such as a key), back-track to a previous area in order to reach a previously inaccessible room, etc.</p>"},{"name":"Cloud Master","year":1992,"developer":"Taito Corporation"},{"name":"Columns (J)","year":1991,"developer":"SEGA Enterprises Ltd.","url":"g#C/Columns%20%28JP%29.pce","filesize":131072,"score":7.2,"genres":"Action > Puzzle > Fixed / flip-screen > Falling block puzzle > Direct control > Fantasy","desc":"<p><em>Columns</em> is loosely derived from Tetris, as it involves arranging falling blocks in such a way as to clear them. However, in columns they are groups of 3 same-size but varying color blocks, which must be arranged into sequences of 3 or more, either horizontally, vertically or diagonally. Sequences of 4 or 5 count for double or triple points, and diagonal sequences score the most. The real trick is to set up 'combos' - where one line causes other blocks to drop so as to create other lines.</p><p>As well as the normal game mode, there is also a 'flash' mode, in which the aim is simply to remove a particular block from the base of the pre-formed pile of bricks. The difficulty of this can be determined by increasing the number of complete rows which are already in place.</p>"},{"name":"Coryoon: Child of Dragon (J)","year":1991,"developer":"Naxat Soft","url":"g#C/Coryoon%20-%20Child%20of%20Dragon%20%28JP%29.pce","filesize":524288,"score":7.8,"genres":"Action > Side view > Anime / Manga > Shooter > Fantasy","desc":"<p>As Coryoon the dragon, you must save the princess in this horizontally-scrolling shoot 'em up. Most shot enemies release fruit (larger pieces from tough enemies requiring multiple shots), which can be collected for bonus points. The game is split into several worlds, each with two bosses to destroy at regular intervals, and each level is loosely colour-themed.</p><p>Storks regularly fly by, and can be shot to release one of the many bonus weapons. These include super-powerful shots, multi-directional fire, and assisting drones. When you get killed while in possession of one, you lose the weapon rather than a life.</p>"},{"name":"Cratermaze","year":1990,"developer":"Nihon Bussan Co., Ltd.","url":"f#Cratermaze%20%28USA%29.zip","filesize":172761,"score":"","genres":"Action > Strategy > Top-down > Anime / Manga > Arcade > Sci-fi / futuristic","desc":"<p><em>Cratermaze</em> is an action puzzle game viewed from an overhead perspective. Each stage consists of a maze filled with various enemies and items. You must collect all of the keys on the stage to open the exit door while avoiding or eliminating enemies. Your primary method of dealing with enemies is to dig holes; if an enemy walks into a hole, they are momentarily trapped and you can then fill the hole to kill the enemy.</p><p>You can also obtain temporary weapon powerups such as rayguns and yo-yos, as well as extend your digging reach to dig multiple holes at once. There are also several bosses encountered throughout the game.</p><p>The Japanese release, Doraemon: Meikyū Daisakusen, features popular children's character Doraemon and his friends. The game is a conversion of the 1987 Nichibutsu coin-op <em>Kid no Hore Hore Daisakusen</em>, which also saw a modified Famicom version called Booby Kids.</p>"},{"name":"Cross Wiber: Cyber-Combat-Police (J)","year":1990,"developer":"Sankindo","url":"g#C/Cross%20Wiber%20-%20Cyber%20Combat%20Police%20%28JP%29.pce","filesize":524288,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p><em>Cross Wiber: Cyber-Combat-Police</em> is a sequel to Cyber Cross and follows the adventures of Cross Wiber, an special inspector of the cyber combat police. Several years after the happenings in <em>Cyber Cross</em>, a new threat threatens Earth: Duma and his alien forces. Wiber now starts his counter-attack on Duma.</p><p>This game is a side-scrolling action game with emphasis on combat, but also with some platforming sequences. The player has the ability to switch between four forms: human and three robot suits. All those forms have different abilities, e.g. one robot has a special gun and the human can only kick to attack but is the only form which has a special attack taking up a bit of life energy. The power-ups which can be collected during play have different effects depending on the used form, e.g. as human everything gives life energy and as robots there are weapon and armor upgrades as well as ammo.</p>"},{"name":"Cyber Core","year":1990,"developer":"AlfaSystem Co., Ltd.","url":"f#Cyber%20Core%20%28USA%29.zip","filesize":211897,"score":7.1,"genres":"Action > Top-down > 2D scrolling > Shooter","desc":"<p><em>Cyber-core</em> is a vertically scrolling shooter in which the player fights insects. The basic idea is traditional: shooting everything before they can shoot/touch the player: after three hits the chitin armor breaks and a life is lost. Besides flying enemies which are disposed of with the standard gun, the player also has to deal with enemies on the ground which need to be hit with one of the unlimited bomb. </p><p>The player has the choice between four insect forms which are changed by collecting the associated extra symbols. Collecting more of the same symbol upgrades the insect, but this also rises the difficulty level. Other extras include smart bombs, extra lives, armor refreshments or a protection shield. The game features the possibility to turn on rapid fire or to slow down the speed as well as big boss enemies at the end and within the levels.</p>"},{"name":"Cyber Cross","year":1989,"developer":"ITL Co., Ltd."},{"name":"Cyber Knight","year":1990,"developer":"Advance Communication Company"}]