[{"name":"Darius","year":1990,"developer":"Taito Corporation"},{"name":"Darius Alpha","year":1990,"developer":"Taito Corporation","url":"g#D/Darius%20Alpha%20%28JP%29.pce","filesize":393216,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>One of the rarest games for the PC Engine, <em>Darius Alpha</em> was only offered to those who bought both the CD and HuCard versions of Darius Plus (Which doesn't make much sense, considering how similar the two versions are). People who just couldn't get enough of Darius could now play another variation on the same theme. Darius Alpha is built on the same codebase as Darius Plus, but has been remodeled into a so-called \"boss-fight\" game, e.g. a game where you only fight the bosses of a game or game series. You start out with an unequipped ship and must take down the boss of the first level, King Fossil. Upon defeating King Fossil, you are granted some slight upgrades and proceed directly to the boss of the next level. And so on.</p>"},{"name":"Davis Cup Tennis","year":1993,"developer":"Loriciel SA","url":"f#Davis%20Cup%20Tennis%20%28USA%29.zip","filesize":312207,"score":7.6,"genres":"Sports > Behind view > 2D scrolling > Tennis > Licensed","desc":"<p>The Davis Cup is an annual international team event in men's tennis. The participating countries, consisting of different players, compete in both singles and doubles matches. The entire championship has been made available in this game, and the matches are played using a third-person perspective.</p><p>There are different types of courts and difficulty levels. Aside from the championship, you can also practice, enter tournaments or play exhibition matches. Work along with a friend as a team or compete in singles matches. Aside from the familiar strokes, timing is important to determine the amount of spin.</p>"},{"name":"Dead Moon","year":1991,"developer":"ZAP Corporation","url":"f#Dead%20Moon%20%28USA%29.zip","filesize":232279,"score":6.7,"genres":"Action > Side view > Shooter > Sci-fi / futuristic","desc":"<p>About 200 years in the future, a comet is detected at the edge of the solar system. Astronomers determine that it will pass near the earth, and send probes to examine it. When the probes near the comet, it abruptly changes directions and heads towards earth. At the last moment, the people of earth are able to launch surface-to-comet missiles and deflect its impact into the moon. At the center of the impact crater, alien war machines are gathering! The U.N. sends a lone spaceship to the moon to destroy the alien threat.</p><p><em>Dead Moon</em> is a side scrolling shooter with 6 levels that take place on earth, in space, and on the moon. It features 4 different primary weapon types, and several secondary weapon types. Each level features mini-bosses and end of level bosses.</p>"},{"name":"Deep Blue","year":1989,"developer":"Pack-In-Video Co., Ltd","url":"f#Deep%20Blue%20%28USA%29.zip","filesize":114496,"score":5.2,"genres":"Action > Side view > 2D scrolling > Shooter","desc":"<p>Aliens are invading the ocean and have mutated the fish and other aquatic beings! But an A.N.G.E.L. Fish Attack Sub is on its way to blast through four scenes of swimming terror and stop the aliens from taking over the sea. Fortunately, the A.N.G.E.L. is helped on its way by a number of power-ups - for instance, Healing Power completely repairs the sub and Speed Power speeds it up. Up to three modes of attack can be used to combat the mutant fish - the starting Pulse Shot, the destructive Swirl Cutter, and the Bubble Beam. But the A.N.G.E.L. is not indestructible. Four colors on the A.N.G.E.L.'s eye indicate the amount of damage the sub has sustained, and when it's had enough and explodes, that's the end of the A.N.G.E.L. and the end of the game.</p>"},{"name":"Detana!! TwinBee","year":1992,"developer":"Konami Co., Ltd.","url":"g#D/Detana%21%21%20TwinBee%20%28JP%29.pce","filesize":524288,"score":7.2,"genres":"Action > Top-down > Anime / Manga > Arcade > Shooter","desc":"<p>Another top-down shooter in the TwinBee series of \"cute'em ups\".</p><p>Detana!! Introduces for the first time the characters behind the TwinBee &amp; WinBee fighters, Pastel and Light, and chronicles their journey to save Princess Melora from an evil force that threatens the world. Nevertheless its still all about shooting the heck out of surreal and cute enemies through 6 stages of vertically-scrolling action.</p><p>Power-ups and upgrades can be gained by shooting the colored bells that some enemies leave behind until they stay the color you want them to, with many combinations possible. A new charge-shot feature has been added to your basic arsenal, and the game features single and 2-player cooperative gameplay.</p>"},{"name":"Devil's Crush","year":1990,"developer":"Naxat Soft","url":"f#Devil%27s%20Crush%20%28USA%29.zip","filesize":204087,"score":8.2,"genres":"Action > Top-down > Pinball > Fantasy","desc":"<p>Imagine an adventure game in the format of pinball, and you get Dragon's Fury. Your hero is a small silver ball, and your battlefield is a three-tiered pinball machine. Using your ball, you can defeat monsters, rack up points, and enter bonus stages. If you play with enough skill, you can trigger all sorts of point-accumulating bonuses. If you get one billion points, you get to fight the final boss and view the ending to the game.</p>"},{"name":"Die Hard","year":1990,"developer":"Pack-In-Video Co., Ltd","url":"g#D/Die%20Hard%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":524288,"score":6.6,"genres":"Action > Side view > Top-down > Shooter > Licensed","desc":"<p>Terrorists are holding people hostage in Nakatomi Plaza in an attempt to steal $600 million. John McClain decides to visit his wife Holly, who happens to be one of the hostages, and gets involved in the situation. Unlike other versions of <em>Die Hard</em> that are in the MobyGames database, the TurboGrafx-16 version is played from a top-down perspective, and consists of ten stages which have you fighting bad guys from forests, all the way through the Nakatomi Building, and finally on the roof where the final confrontation takes place. Weapons can be picked up by knocking down enemies, and include machine guns, laser shots, and flamethrowers. If you look hard enough, you may even obtain a bullet-proof vest, which may protect you from shots, but can also reduce its life.</p>"},{"name":"Digital Champ","year":1989,"developer":"Naxat Soft","url":"g#D/Digital%20Champ%20%28JP%29.pce","filesize":262144,"score":"","genres":"Sports > 1st-person > Boxing","desc":"<p><em>Digital Champ</em> is a boxing game where you have to fight various other fighters to become a champ. The game is viewed from the perspective of your fighter with your gloves in front of your face. The other fighter is stood in front of you. The joypad is used and can enable you to dodge punches, throw various punches, use your super punch and defend your face. As well as the main playing area you also can see your stamina and energy bars, the other fighters' bars and a timer.</p>"},{"name":"Disney's Darkwing Duck","year":1992,"developer":"Radiance Software","url":"f#Darkwing%20Duck%20%28USA%29.zip","filesize":374040,"score":"","genres":"Action > Side view > Puzzle elements > Licensed","desc":"<p>Darkwing Duck was a popular animated television show that aired on weekday afternoons in the early 1990's. Darkwing was a crime-fighting duck that kept the city safe from a bunch of not-so-smart criminals. </p><p>The TurboGrafx-16 game based on the cartoon is very different from the NES and Game Boy Darkwing games. Although it is a side-scrolling platformer, the gameplay and level structure are very different. This game has 4 side-scrolling areas, 1 of which is the final boss level. The other 3 levels can be tackled in any order, and in them you must collect several puzzle pieces. After collecting all the puzzle pieces and finishing the level, you can put the pieces together and solve the puzzle to unlock the last level. Each level features a boss character taken directly from the animated series.</p>"},{"name":"Disney's TaleSpin","year":1991,"developer":"Interactive Designs","url":"f#TaleSpin%20%28USA%29.zip","filesize":376590,"score":"","genres":"Action > Side view > Top-down > 2D scrolling > Arcade > Platform > Shooter > Licensed","desc":"<p>The game, based on the early-90's animated series of the same name, allows you to play as Baloo, star of Disney's Jungle Book movie and ace cargo plane pilot.</p><p>At the start of the game, Baloo's old friend Louie tells him of a stone artifact that points the way to a treasure in the clouds.  Unfortunately the artifact has been broken into 4 pieces spread out over the island. Baloo must make his way through 4 levels to recover them.  Along the way Baloo will be challenged by familiar enemies from the TV show.</p><p>Most of this game is side-scrolling action. Between levels, you get to play a sky-surfing bonus game played from a top-down perspective.  There is also a short side-scrolling shooter level near the end of the game.</p>"},{"name":"Don Doko Don","year":1990,"developer":"Taito Corporation","url":"g#D/Don%20Doko%20Don%21%20%28JP%29.pce","filesize":393216,"score":7.1,"genres":"Action > Side view > Fixed / flip-screen > Platform > Puzzle elements","desc":"<p>In this game, you play a bearded dwarf whose girlfriend has been kidnapped and taken away to the dragon's castle, and in order to rescue her, you must defeat enemies with your mallet. Once you do, you can pick them up and throw them at other enemies, and collect the fruit that they leave behind. When you have defeated all enemies, you proceed onwards to the next round. If you take too long to complete a level, a winged devil will appear who will try to kill you while flying around the screen.</p><p>Occasionally, power-ups will appear in the middle of the level, and these power-ups will increase your power, award you with different weapons, kill enemies, or freeze time. The more power you have,  the more walls that you can through enemies through. At maximum power, you are able to throw enemies through all walls.If you happen to carry the blue hammer, you are able to throw it through walls, too.</p><p>There are five areas that consist of ten levels each. At the end of each area, you have to defeat a boss in order to proceed further.</p>"},{"name":"Doraemon: Meikyu Daisakusen","year":1989,"developer":"Nihon Bussan Co., Ltd.","url":"g#D/Doraemon%20-%20Meikyuu%20Daisakusen%20%28JP%29.pce","filesize":262144,"score":"","genres":"Action > Strategy > Top-down > Anime / Manga > Arcade > Sci-fi / futuristic > Licensed","desc":"<p>One day, Doraemon and his friends went to go on a picnic. Using a time machine, they were going to visit the past to find a great place, but their plans were ruined by the evil Gigazombie, who has captured all of Doraemon's friends and trapped them in different time periods. Now, Doraemon must travel through time to rescue Nobita, Shizuka, Gian, and Suneo from Gigazombie's henchmen!</p><p><em>Meikyū Daisakusen</em> is an action puzzle game viewed from an overhead perspective. Each stage consists of a maze filled with various enemies and items. You must collect all of the keys on the stage to open the exit door while avoiding or eliminating enemies. Your primary method of dealing with enemies is to dig holes; if an enemy walks into a hole, they are momentarily trapped and you can then fill the hole to kill the enemy.</p><p>You can also obtain temporary weapon powerups such as rayguns and yo-yos, as well as extend your digging reach to dig multiple holes at once. There are also several bosses encountered throughout the game.</p><p>The game is a conversion of the 1987 Nichibutsu coin-op <em>Kid no Hore Hore Daisakusen</em>, which also saw a modified Famicom version called Booby Kids. An unmodified conversion was released in North America as Cratermaze.</p>"},{"name":"Doraemon: Nobita no Dorabian Night","year":1991,"developer":"Now Production Co., Ltd.","url":"g#D/Doraemon%20-%20Nobita%20no%20Dorabian%20Night%20%28JP%29.pce","filesize":524288,"score":"","genres":"Action > Side view > Anime / Manga > Platform > Sci-fi / futuristic > Licensed","desc":"<p>Based on the popular  Doraemon franchise, <em>Nobita no Dorabian Night</em> follows the adventures of the titular robotic cat, as he tries to rescue his friends from different time periods. How did this happen? Naturally, because of Nobita, Doraemon's best friend and geek extraordinaire. Something went wrong when Nobita was showing his friends a time machine, so they ended up stranded in hostile worlds, and now it's Doraemon's job to save them!</p><p>The game is a traditional platformer; Doraemon's main activities are jumping his way through the levels and eliminating enemies who try to stop him. Doraemon starts with an ordinary gun, but later is able to find other weapons, including a homing bowling ball launcher and a stun gun. He can also collect various power-ups, such as limited invincibility, high speed, an item that freezes all the enemies on the level for a short time, etc. It is possible to switch weapons and power-ups at any time.</p><p>Doraemon can enter different rooms and caves scattered through the levels. Some of them lead to mini-games (finding a correct way through a maze, memory games, etc.), which, in their turn, lead to significant power-ups, such as an extra life. The game has a symmetrical structure: each \"world\" is divided into four levels, the last one leading to the boss battle, after which Doraemon travels to another world.</p>"},{"name":"Double Dungeons","year":1989,"developer":"NCS Corporation","url":"f#Double%20Dungeons%20-%20W%20%28USA%29.zip","filesize":152282,"score":5.4,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Fantasy","desc":"<p><em>Double Dungeons</em> is a solo dungeon crawler in the strictest sense. One or two players can explore pseudo-3D, maze-like dungeons (without auto-map feature, but with directions displayed on the screen) and fight the monsters populating them. The player(s) can choose to venture into any of the available 20 dungeons. The dungeons have the same textures, but their layout varies; the higher is the number of the chosen dungeon, the more dangerous are its enemies. Two-player mode features a split screen; the two players start exploring the dungeon from different points.</p><p>The basic gameplay is very simple. Enemies appear at specific points (they can also re-spawn), and must be defeated in order to proceed. The combat is turn-based at its core, though the turns follow very quickly, and the enemies will attack even if the player does nothing. Attacking is done simply by pressing a button; there are no other combat options. </p><p>The player can find equipment and healing items (which can also be dropped by enemies). These can be used to restore the player character's HP outside of battles. Leveling up is completely automatic.</p><p>There is no narrative in the game; the only story-related information comes in form of very short text intros to the different dungeons, along the lines of \"the king wants to retrieve a treasure and sends a warrior into the dungeon\" or comparable mission objectives.</p>"},{"name":"Down Load","year":1990,"developer":"AlfaSystem Co., Ltd.","url":"g#D/Download%20%28JP%29.pce","filesize":524288,"score":7.7,"genres":"Action > Side view > Anime / Manga > Arcade > Shooter > Cyberpunk / dark sci-fi","desc":"<p>Nearing the end of the 21th century, human society entered a development stage that was dubbed \"neo capitalism\". Powerful mega-corporations built gigantic computer systems which were able to create entire virtual worlds, where humans sought refuge from the grim reality and the certainty of death. But crime flourished in the cyber world as well; a unit of special agents called \"cyber divers\" was created in order to fight criminal organizations. Syd is one of such cyber divers. His companion Ohala was once trapped in the cyber world and never returned. And now, another friend of his, the lovely Deva, tells him that she has been arrested while trying to investigate Ohala's disappearing. It's time for Syd to ride his flying bike and get to the bottom of the business - in real world as well as in the dangerous virtual reality.</p><p><em>Down Load</em> is a side-scrolling shooter. The player controls Syd on his flying bike, which acts, for all purposes, like other aircrafts in comparable games. Before each mission, the player selects one of the two available main weapons: vulcan cannon (spreading fire, up to five directions if powered-up), and laser beam (powerful, focused fire; beams are added with power-ups). The secondary weapons include homing missiles, a bomb-like gadget, and a shield - all with limited ammunition/energy. </p><p>The stages include real-world locations as well as abstract \"computer-like\" virtual reality worlds, with geometrical figures and computer-related objects as enemies. Boss enemies usually guard the exit to each level, and utilize a variety of shooting patterns to stop the hero. Anime-style cut scenes advance the story between the missions.</p>"},{"name":"Dragon Saber: After Story of Dragon Spirit","year":1991,"developer":"Namco Limited","url":"g#D/Dragon%20Saber%20%28JP%29.pce","filesize":524288,"score":7.2,"genres":"Action > Top-down > 2D scrolling > Shooter > Direct control > Flight / aviation > Fantasy","desc":"<p>Whereas Dragon Spirit was a multi-format conversion, only Turbo-Grafx / PC Engine users initially got to play the lesser-known sequel at home. Gameplay-wise, little has changed from the original, as both games are vertically-scrolling shoot 'em ups putting you in control of a dragon. You are flying over built-up land, complete with rivers and their banks. The enemies and waves can be shot or avoided - shooting them reveals extra points as well as the occasional power-up. Ground units are shooting at you but can't be shot back, so be careful which parts of the screen you occupy at which times.</p>"},{"name":"Dragon Spirit","year":1988,"developer":"Namco Limited","url":"f#Dragon%20Spirit%20%28USA%29.zip","filesize":160704,"score":7.2,"genres":"Action > Top-down > 2D scrolling > Shooter > Fantasy","desc":"<p>Princess Alicia of the kingdom of Mitgult is kidnapped by the monster Zawell. It's now up to the heroic warrior Amul to transform himself into a blue dragon and go and rescue the princess.</p><p><em>Dragon Spirit</em> is a vertically scrolling shoot-em-up which consists of nine stages. Players fly around and destroy everything in their path. Much like in Xevious, action takes place on two planes, both in the sky (where the dragon is flying) and on the ground. The dragon has two different kind of attacks: fire that shoots up the screen, and fire that drops to hit a place on the ground in front of the dragon. Enemies exist both in the air and on the ground, and some can fly up from the ground to the sky.</p><p>Players can pick up power-ups, or upgrades, that will help them in their fight. Upgrades can include extra heads on the dragon, health, faster shots, and more. At the end of each stage is a boss that needs to be defeated. Having good upgrades that are not lost from being hit before reaching the bosses will help.</p><p>The NES version is unique in that it presents a somewhat altered story and an additional gameplay mode. Technically, it is a sort of sequel, with \"A New Legend\" being its subtitle. In this version, Zawell is already defeated and King Amul and his now wife Queen Alicia, have two children named Iris (a princess) and Lace (a prince). A new evil named Galda has decided to attack the Earth. Galda also has taken Iris captive and now Lace must go rescue her. </p><p>The NES version also adds a new initial stage. If the player survives it, the game continues in a \"Blue Dragon\" game much like the original arcade game. If the player fails to clear this initial stage in one life, an easy mode called \"Gold Dragon\" begins, skipping about half the game's stages, giving the player extra hit points, and features a different ending.</p><p>Also of note, the TurboGrafx-16 version's seventh and eighth stage are different than the other versions. The underwater and dark themed stages were changed to castle interior themed stages.</p>"},{"name":"Dragon's Curse","year":1990,"developer":"Westone Co., Ltd.","url":"f#Dragon%27s%20Curse%20%28USA%29.zip","filesize":169730,"score":8.4,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > RPG elements > Fantasy","desc":"<p><em>Wonder Boy III: The Dragon's Trap</em> is a direct sequel to Wonder Boy in Monster Land. When Tom-Tom defeats the MEKA dragon, the wounded beast casts a spell on him, turning him into a Lizard-Man. To regain his original human form, he has to find the Salamander Cross, hidden by the Vampire Dragon in Monster Land.</p><p>Unlike its predecessor, this side-scrolling platform game is not divided into sequences of levels. The protagonist is allowed to go anywhere, as long as he has the right shape or equipment. During his quest, Tom-Tom has to defeat various dragon bosses. Each win will give him a new shape with new abilities such as flying, swimming, walking on ceilings, or clinging to walls. These abilities also allow the player access to new parts of the world. The possible shapes are Lizard-Man, Mouse-Man, Piranha-Man, Lion-Man, and Hawk-Man, and the main abilities are defined by attacking power, defense points, and charm points (needed for equipment by collecting charm stones). Also, certain blocks can only be destroyed by specific weapons or are only accessible to certain shapes.</p><p>The basic actions consist of attacking and jumping, and in the status screen, it is possible to equip swords, shields, and armor. Special attacks include fireballs, tornadoes, arrows, boomerangs, and thunder strikes. Along the way, the player collects keys (only one at all times) and gold left behind by defeated creatures, and places need to be re-visited sometimes to access new areas. Equipment and items can be bought in towns. A password is given at the beginning of each town to continue from there.</p><p>The Game Gear version has minor tweaks to level layouts to accommodate the smaller resolution better. Prices of shop items have also changed.</p>"},{"name":"Drop Off","year":1990,"developer":"Data East Corporation","url":"f#Drop.Off%20%28USA%29.zip","filesize":70852,"score":6.4,"genres":"Action > Arcade > Paddle / Pong","desc":"<p><em>Drop Off</em> is similar to  Breakout, in that the player controls a paddle which can move left and right, hitting a ball which the player is using to eliminate jewels at the upper end of the play field. The game differs from <em>Breakout</em>, however, in that the paddle can also be moved up and down, the jewels are moving down toward the player's paddle, and there is a border at the bottom of the play field which bounces the ball back.</p><p>The plot of the game involves the antagonist character's girlfriend being in a coma. A muse appears and tells the player that his girlfriend is trapped in a nightmare and is possessed by someone. The muse then casts a spell to put the player into her dreams.</p>"},{"name":"Dungeon Explorer","year":1989,"developer":"Atlus Co., Ltd.","url":"f#Dungeon%20Explorer%20%28USA%29.zip","filesize":252749,"score":7.3,"genres":"Action > Role-playing (RPG) > Top-down > Fantasy","desc":"<p>The former king of Oddesia has entrusted you with an important, dangerous task. You must find the sacred ORA stone, which possesses the powers of life, light and happiness, and retrieve it before the king of the alien race, Natas, does. He has conquered this land and plunged it into an age of terror and despair, plagued with violence. It is up to you to stand against him and return your world to its former glory.</p><p><em>Dungeon Explorer</em> plays like Gauntlet: you choose one of several different characters to play as (Fighter, Thief, Warlock, Witch, Bard, Bishop, Elf and Knome) and set out on your adventure alone or with up to four other players. Battles are real-time and of the shooter variety, ie, rather than swing a sword, you fire knives (or spells depending on your class). Enemies respawn out of holes in the ground which must be eradicated to keep them from pouring forth in waves. There are a number of items to be found and used throughout the game including potions of white and black magic, healing drinks and the like, but unlike <em>Gauntlet</em> there is no food to worry about.</p>"}]