[{"name":"F-1 Dream","year":1989,"developer":"Capcom Co., Ltd."},{"name":"F-1 Pilot","year":1989,"developer":"Pack-In-Video Co., Ltd","url":"g#F/F-1%20Pilot%20-%20You%27re%20King%20of%20Kings%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":393216,"score":"","genres":"Racing / Driving > 1st-person > Direct control > Automobile > Track racing","desc":"<p><em>F-1 Pilot</em> is a Formula 1 racing game featuring eights tracks to race on. It is the only racing game for the TurboGrafx-16 with a first-person perspective. The names of the drivers are not officially licensed: Nelson Poquet, Alain Perost ...</p>"},{"name":"F1 Circus (J)","year":1990,"developer":"Nihon Bussan Co., Ltd.","url":"g#F/F1%20Circus%20%28JP%29.pce","filesize":524288,"score":7.1,"genres":"Racing / Driving > Top-down > 2D scrolling > Arcade > Automobile > Track racing","desc":"<p><em>F1 Circus</em> is a Formula 1 simulation racing game. Unlike later entries in the series, this version does not feature an official license, and so only features generic teams and drivers. Races are viewed from a top-down perspective, and there are a variety of machine settings as well as basic vehicle damage.</p><p>A total of 15 courses are on offer, and there is a World Championship mode, as well as a \"Constructors\" mode for one or two players where the player can take the role of team manager while the computer does the actual racing. The Famicom release also adds a Time Attack mode for practicing and perfecting each course.</p>"},{"name":"F1 Circus '91 (J)","year":1991,"developer":"Nihon Bussan Co., Ltd.","url":"g#F/F1%20Circus%20%2791%20%28JP%29.pce","filesize":524288,"score":7.5,"genres":"Racing / Driving > Top-down > 2D scrolling > Arcade > Automobile > Track racing","desc":"<p><em>F1 Circus '91</em> is a Formula 1 simulation racing game. The series did not yet feature an official license, and so just like the first game it only features generic team and driver names. The game itself plays much the same, with the overhead race view and focus on car tuning and damage. The World Championship mode has of course returned, though the managerial Constructors mode is no longer present. There is also a Free Attack mode, where any course can be freely practiced; a Training mode, where special training courses can be raced on to learn the ins and outs of the game; and a Watch mode, where the player can choose a course and watch a demonstration race.</p>"},{"name":"F1 Circus '92 (J)","year":1992,"developer":"Nihon Bussan Co., Ltd.","url":"g#F/F1%20Circus%20%2792%20-%20The%20Speed%20of%20Sound%20%28JP%29.pce","filesize":786432,"score":"","genres":"Racing / Driving > Top-down > 2D scrolling > Direct control > Automobile > Track racing","desc":"<p><em>F1 Circus '92</em> is an entry in the <em>F1 Circus</em> racing series. You control an F1 car from a top-down perspective racing on a variety of tracks. You start by qualifying for the race by beating a certain time, then compete for the top spot. Each top three finish gives you points and allows you to continue to the next course. Car tuning options are plentiful and a necessity in order to perform well on specific tracks.</p>"},{"name":"F1 Triple Battle (J)","year":1989,"developer":"Human Entertainment, Inc.","url":"g#F/F1%20Triple%20Battle%20%28JP%29.pce","filesize":393216,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Track racing","desc":"<p><em>Fastest 1</em> is a Formula One racing game. The game doesn't have an official FIA license, but much like Human's Fire Pro Wrestling series, includes a number of recognizable fictionalized drivers, such as Ayrton Sesna and Satoru Inakajima. The game includes a world championship mode, where the player must start from the lowest rankings and win races to become the F1 world champion. There is also a battle mode where one or two players can race each other or against computer opponents, as well as a test run mode where the player can learn each course and try to set course records. There are a total of 16 different courses, which can be played in either dry, wet, or half-wet conditions, as well as a wide variety of vehicle settings that can be tweaked.</p>"},{"name":"Falcon","year":1992,"developer":"Spectrum Holobyte, Inc.","url":"f#Falcon%20%28USA%29.zip","filesize":264270,"score":"","genres":"Action > Simulation > 1st-person > Flight / aviation > Vehicular combat","desc":"<p>Spectrum HoloByte's series of hardcore flight simulations makes its only appearance on a console with <em>Falcon</em> for TurboGrafx. Owing to the limited control options, the game is more action and less simulation, but still opts for a certain amount of realism.</p><p>Players control an F-16 Falcon in combat against a terrorist group planning to construct a nuclear bomb. Before the main campaign, several training scenarios allow the practice of bombing ground targets, intercepting bombers, engaging in dogfights and facing flak guns or SAM sites. The same kinds of scenarios are faced in the campaign. Before taking off, players can outfit their plane with the correct weapons for the mission at hand, including various realistic models of air-to-air and air-to-ground missiles and bombs as well as ECM pods and extra fuel tanks.</p><p>Takeoffs and landings are taken care of automatically. Gameplay is seen through a cockpit perspective patterned after a real F-16, with the environment and air and ground targets rendered as flat-shaded polygons. The directional pad is used to steer the plane, Select to change weapons and Button II to fire. Button I is a multi-purpose button that changes the functions of the other buttons, allowing the pilot to set the throttle, bank, shift the radar lock, and fire countermeasures. Realistic features during flight include red and blackouts, and of course, stalls and crashes.</p><p>The game features a high score table and saves mission progress via passwords (or to battery-backed RAM with a Turbo Booster Plus). A unique feature is a head-to-head mode supported on TurboExpress handhelds via Turbo Link cable.</p>"},{"name":"Fantasy Zone","year":1988,"developer":"SEGA Enterprises Ltd.","url":"f#Fantasy%20Zone%20%28USA%29.zip","filesize":178110,"score":7.3,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The Fantasy Zone is a solar system consisting of eight brightly colored, fantastic planets. The evil Menons are trying to take over all of the planets in the Fantasy Zone by using misappropriated foreign currency to build their forces. It is the player's job to recover all of the coins and save the solar system! </p><p><em>Fantasy Zone</em> is an arcade style shooter for one or two players. The goal is to destroy all of the creatures on each planet and collect as many of the lost coins as possible. At the end of each level is a large enemy that will have to be defeated before moving on to the next world. At various points in the game, the player will be able to find a parts shop, which allows purchasing improvements for his spaceship, including better weapons and faster engines.</p>"},{"name":"Final Blaster (J)","year":1990,"developer":"Aisystem Tokyo","url":"g#F/Final%20Blaster%20%28JP%29.pce","filesize":393216,"score":7,"genres":"Action > Top-down > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p><em>Final Blaster</em> is a vertically scrolling shooter with seven levels. As usual, the player mans a space ship, has to kill the enemy opposition and a powerful boss enemy at the end of each level. A speciality is the dynamic difficulty: if the player offers a good performance in a level, he gets ranked up which affects the difficulty of the next. There are four of those ranks. </p><p>The game features two power ups which are represented with different colours: weapon upgrades and drones which accompany the player. Those can be upgraded twice each and are compatible to each other. If the player dies, the extras are evacuated into a green capsule. It can be then picked up when using the next life.</p>"},{"name":"Final Lap Twin","year":1989,"developer":"Namco Limited","url":"f#Final%20Lap%20Twin%20%28USA%29.zip","filesize":197339,"score":7,"genres":"Racing / Driving > Behind view > Top-down > Arcade > RPG elements > Automobile > Track racing","desc":"<p><em>Final Lap Twin</em> is an open-wheel F1-style racing game loosely based on Namco's Final Lap arcade game. The game display is always in split screen mode, even if only one player is playing. The other display shows your nearest rival if you are racing against the computer.</p><p>There are two basic modes: Grand Prix and Quest. Grand Prix consists of a multi-race points championship. There are two car types for this mode: F-3000 and F1. Grand Prix mode can be played with one or two players.</p><p>Quest mode has more depth and forms the core of Final Lap Twin. This is essentially a racing RPG. You take the role of a boy who desires to become the World Champion. To do so, you must travel from town to town finding challenges and winning them to gain money and special items to improve your car. As you move around the game world, which is presented in an overhead view, you will encounter random challenges, much like random battles in a traditional RPG.</p>"},{"name":"Final Match Tennis","year":1991,"developer":"Human Entertainment, Inc.","url":"g#F/Final%20Match%20Tennis%20%28English%20Translated%2C%20Rev%201.2%29.pce","filesize":262144,"score":8,"genres":"Sports > Diagonal-down > Tennis > Oceania","desc":"<p><em>Final Match Tennis</em> is a tennis game for the PC Engine that was only released in Japan. It features 16 different (all male) players and all the normal strokes like smashes, stop balls, lobs, volleys and the like. Through the use of a multiplayer adapter up to 4 people can play the game in any combination in singles and doubles. A tournament and practice mode is also present.</p>"},{"name":"Final Soldier (J)","year":1991,"developer":"Hudson Soft Company, Ltd.","url":"g#F/Final%20Soldier%20%28JP%29.pce","filesize":524288,"score":7.2,"genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>A sci-fi top-down shooter, sequel to the Star Soldier games. Once again its your job to protect the Galactic Empire from an alien invasion using nothing but your trusty starfighter.</p><p>The game is divided in several stages in which enemies attack you in several waves until you reach the stage boss and proceed to the next one. <em>Final Soldier</em> incorporates four different gun pods mapped to each button, which can be fired independently or in conjunction. What you equip in each pod is up to you however as not only you get to select weapon loadouts between levels, but also shooting power-ups cycles to the available weapon types that you can incorporate mid-game.</p>"},{"name":"Fire Pro Wrestling 2nd Bout (J)","year":1991,"developer":"Human Entertainment, Inc.","url":"g#F/Fire%20Pro%20Wrestling%202%20-%202nd%20Bout%20%28JP%29.pce","filesize":524288,"score":"","genres":"Sports > 3rd-person (Other) > Wrestling","desc":"<p><em>Fire Pro Wrestling 2nd Bout</em> is the second game in the <em>Fire Pro Wrestling</em> series. It is very similar to Fire Pro Wrestling Combination Tag and doesn't offer much in terms of new content, other than a few new modes, including Excite Series, World Champion Series, Super Tournament, and Elimination Match.</p>"},{"name":"Fire Pro Wrestling 3: Legend Bout (J)","year":1992,"developer":"Human Entertainment, Inc.","url":"g#F/Fire%20Pro%20Wrestling%203%20-%20Legend%20Bout%20%28JP%29.pce","filesize":1048576,"score":"","genres":"Sports > 3rd-person (Other) > Wrestling","desc":"<p><em>Fire Pro Wrestling 3: Legend Bout</em> is the third game in the long-running <em>Fire Pro Wrestling</em> series. The game is very similar to the first two. There is a significant increase in the amount of wrestlers, however, and there are a few new modes, such as wrestler editing mode and \"hidden mode\". There are 28 regular wrestlers, and 4 hidden wrestlers. As usual, while fictitious, they are based on real wrestlers, such as Hulk Hogan. This was the last of the series for the PC Engine as a stand-alone console, with one more being released for its Arcade CD-ROM² add-on.</p>"},{"name":"Fire Pro Wrestling Combination Tag (J)","year":1989,"developer":"Human Entertainment, Inc.","url":"g#F/Fire%20Pro%20Wrestling%20-%20Combination%20Tag%20%28JP%29.pce","filesize":393216,"score":"","genres":"Sports > 3rd-person (Other) > Wrestling","desc":"<p><em>Fire Pro Wrestling Combination Tag</em> is the first game in the <em>Fire Pro Wrestling</em> series. There are many wrestlers in the game, all fictional. However, they are all based on real wrestlers from several different countries. The game features one-on-one, tag-team, and 5 man elimination modes. It features more moves than most wrestling games of the time.</p>"},{"name":"Formation Armed F (J)","year":1990,"developer":"Nichibutsu","url":"g#F/Formation%20Armed%20F%20%28JP%29.pce","filesize":262144,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Formation Armed F</em> is a vertically scrolling shooter. The basic gameplay principle offers no surprises: shooting a lot of aliens without getting hit by their attacks. Additionally there are environmental obstacles like poisonous gas or walls. Of course the player can collect power ups to upgrade the ship, e.g. speed-ups or a large variation of weaponry. Each of the seven levels has its own set of weaponry which suits the enemies. The big exception are smaller ships which stay near to the main ship. By pressing a second fire button, the formation can be changed. There are no continues.</p>"},{"name":"Formation Soccer on J League (J)","year":1994,"developer":"Human Entertainment, Inc.","url":"g#F/Formation%20Soccer%20-%20On%20J%20League%20%28JP%29.pce","filesize":524288,"score":"","genres":"Sports > Top-down > 2D scrolling > Direct control > Football (European) / Soccer > Licensed","desc":"<p><em>Formation Soccer on J League</em> is an officially licensed football game based on the J League. It is released one year after the first season of the J League. It contains ten teams:* Kashima Antlers</p><ul><li>JEF United Ichihara</li><li>Urawa Red Diamonds</li><li>Verdy Kawasaki</li><li>Yokohama Marinos</li><li>Yokohama Flügels</li><li>Nagoya Grampus</li><li>Gamba Osaka</li><li>Sanfrecce Hiroshima</li></ul>"},{"name":"Fushigi no Yume no Alice","year":1990,"developer":"FACE","url":"g#F/Fushigi%20no%20Yume%20no%20Alice%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":393216,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>Based on Lewis Carrol's Alice in Wonderland novels, <em>Fushigi no Yume no Alice</em> is a cute 2-D platformer which casts you as Alice, a blond-haired girl wearing a pink dress. Your job is to make your way through forests and caves, defeating enemies that you come across by either jumping on their heads or shouting 'IYA' at them. Some enemies will drop eggs which will explode. You can kick these eggs and use them to destroy the enemies themselves. There are three levels in each area, and each level ends with you defeating a boss.</p>"}]