[{"name":"Gaiflame","year":1990,"developer":"Masaya"},{"name":"Galaga '90","year":1988,"developer":"Namco Limited","url":"f#Galaga%20%2790%20%28USA%29.zip","filesize":118020,"score":7.4,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Galaga '88</em> takes the basic gameplay of Galaga and adds higher-quality graphics, triple ship abilities, parsec progression, power-ups, asteroids, bosses and other enhancements. Periodically the player encounters Challenging Stages, which are set to music and feature \"dancing\" enemies. The objective is to shoot all 40 enemies before they disappear, for a bonus of at least 10,000 points. There are a total of 29 stages. The player can begin with one ship with two in reserve or start right out with a dual ship (but only one in reserve). </p><p>Some enemies now have the ability to combine into a much larger single enemy that takes multiple shots to destroy. Others explode in a brilliant shower of fireworks when destroyed, and occasionally these enemies drop a small formation of much smaller enemies that \"wiggle\" their way down the screen. Some enemies arrive in spherical \"eggs\" and emit a loud, high-pitched noise when hit. These creatures take multiple hits to destroy in flight (just one hit in formation), and their main attack pattern is to move about halfway down the screen, stop, fire multiple shots at once, and then fly straight down off the bottom of the screen. Another type of enemy takes at least five hits to destroy, and it grows larger with each consecutive hit, making it both a larger target and allowing it to act as a shield to other enemies. </p><p>Later in the game some enemies are equipped with armor that renders them invincible while in formation. When one of these enemies starts its dive, it will flip over and expose its vulnerable side, then flip over again and become invincible while it moves back up the screen, then flip one more time and finish its dive. While vulnerable, this enemy can be destroyed in one hit, scoring bonus points. In addition, many different kinds of obstacles appear throughout the game, including blue crystals, boulders and green blobs.</p>"},{"name":"Gekisha Boy","year":1992,"developer":"Irem Software Engineering, Inc.","url":"g#G/Gekibo%20-%20Gekisha%20Boy%20%28English%20Translated%2C%20Rev%200.99%29.pce","filesize":524288,"score":"","genres":"Action > Side view > 2D scrolling > Direct control > Comedy","desc":"<p><em>Gekisha Boy</em> is a 2D side-scrolling game in which you play the part as a camera man who is out to snap some high paying photos to please their contractor. You control the movement of the shutter aim and you have slight control over the character as well (using the same style of control as such games as Cabal). You walk along a side-scrolling street and you have to snap unusual/tragic/funny or simply weird photos to rack up the points. It can be anything from crashing airplanes to Marilyn Monroe lookalikes and UFOs abducting cars. Every stage has a set score you need to reach to progress to the next one or you have to start it over again.</p><p>The PlayStation version <em>The Cameraman: Gekisha Boy Omakefu</em> is an updated and expanded port released as Volume 94 of the <em>Simple 1500</em> series and contains an additional stage. It also has an unlockable cooperative mode with a second player as the Gekisha Girl. Otherwise the versions are identical in graphics, sound and gameplay.</p>"},{"name":"Genpei Tōma Den","year":1990,"developer":"Namco Limited"},{"name":"Ghost Manor","year":1992,"developer":"ICOM Simulations, Inc.","url":"f#Ghost%20Manor%20%28USA%29.zip","filesize":277613,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Horror","desc":"<p>The peaceful village of Anoraff is threatened by the evil Orb Gamut, who terrorizes the villagers with his army of undead. Someone has to travel to his manor and destroy the overlord, a job falling to young Arthur.</p><p><em>Ghost Manor</em> is a horror-themed platform game in which players control Arthur on his quest for the manor. It consists of several large levels, including the road to the manor and various rooms inside, including hallways, storerooms and cellars. To move on to the next stage, Arthur usually has to find a key that opens the exit door. This might be hidden in some corner or only appear once a certain monster is defeated. To defeat enemies, Arthur uses a magic orb that fires projectiles. Ammunition is limited but can be restored through a power-up. Arthur can also find stars which increase the shot power, hearts that restore lost health, extra lives, and various special items used to tackle obstacles in his way. Not all enemies are harmful: some can be utilized to carry Arthur around the level or catapult him to a place he can't otherwise reach.</p>"},{"name":"Gomola Speed (J)","year":1990,"developer":"UPL Co., Ltd","url":"g#G/Gomola%20Speed%20%28JP%29.pce","filesize":393216,"score":7.2,"genres":"Action > Top-down > Arcade > Sci-fi / futuristic","desc":"<p><em>Gomola Speed</em> is an action game featuring a robot snake. You must find the pieces of your body strewn about each maze-like stage, which increase your size, and use your length to surround items, food, and enemies in order to eliminate them. You can also use bombs to stun more dangerous enemies.</p><p>Different stages may have different goals -- for example, you may have to find a key, or use your surround ability on floor tiles to reveal items or enemies. Only your snake's head is vulnerable; if an enemy hits your body it will scatter all the pieces and you'll have to collect them again. After completing set conditions on each stage, a door will open that leads to the next stage, at which point you'll be just a head again, and will have to hunt for your body once more.</p><p>The game has the same unique UPL style that will be familiar to fans of games such as Atomic Robo-Kid and Mutant Night.</p>"},{"name":"Gradius (J)","year":1991,"developer":"Konami Industry Co. Ltd.","url":"g#G/Gradius%20%28JP%29.pce","filesize":262144,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>The people of Gradius are in trouble. The ameoboid Bacterions have launched an all out attack against the planet, and it's up to you to fly into battle and save them. Along the way you'll be able to power up your ship with hyper speed, force fields, lasers, missiles, double beam cannons and more to help you battle. </p><p><em>Gradius</em> is a side-scrolling shooter. Shooting certain enemies will leave a power up pod behind which can be collected to add more power to your ship. Each level features a wide variety of enemies trying to stop you, with a large boss at the end. Gameplay is for one player or two players alternating.</p>"},{"name":"Gunboat","year":1992,"developer":"Accolade, Inc.","url":"f#Gunboat%20%28USA%29.zip","filesize":288263,"score":6.7,"genres":"Action > Simulation > 1st-person > Naval / watercraft","desc":"<p><i>Gunboat</i> is a 2D action simulation. You take control of a U.S. Gunboat in several conflict zones.</p><p>Your Gunboat carries a crew of four men:</p><ul><li>A first-class petty officer who serves as boat captain and pilot<br></li><li>A gunner’s mate, who controls the forward guns<br></li><li>An engine man, who takes care of the engines and serves as midship gunner<br></li><li>A seaman who controls the aft guns<br></li></ul><p>All four men are cross-trained in each other’s tasks … redundancy becomes crucial if one or two crew members are wounded or dead.</p><p>Be careful on the rivers ...!</p><p>Anchors aweigh!</p>"}]