[{"name":"Hana Taaka Daka!","year":1991,"developer":"Natsume Co., Ltd.","url":"g#H/Hana%20Taaka%20Daka%21%20%28JP%29.pce","filesize":524288,"score":"","genres":"Action > Side view > 2D scrolling > Shooter > Direct control > Flight / aviation > Fantasy","desc":"<p><em>Hana Taaka Daka!?</em> is a horizontally-scrolling shoot'em-up set in a fantasy universe. You control a long-nosed flying mythical creature and the monsters you face are tanuki (racoon dogs) impersonating birds, animals or even traps such as falling stones. You play as the sacred Tengu to rescue Inari who has been abducted by the evil tanuki lord Jikanda. During the game, you find many power-ups to make your tengu more powerful, and several bonus stages are hidden, scattered around the colourful stages.</p>"},{"name":"Hani in the Sky","year":1989,"developer":"FACE","url":"g#H/Hanii%20in%20the%20Sky%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":262144,"score":"","genres":"Action > Top-down > Shooter > Fantasy","desc":"<p>One day, Hani (sometimes known as Honey), who is a phallic <em>objet d'art</em> from stoneage Japan, is summoned by the god Izanaki. Izanaki is worried because his wife Izanami's heart has been invaded by a demon. His once peaceful wife now kills thousands of humans each day and threatens to destroy the world that she once created together with her husband. Hani must fly into Izanami's heart and destroy the demon.</p><p>Once Hani has entered Izanami's heart, and you are put in control, it turns into a vertically-scrolling shoot'em up. One button fires the gun, but the other one rotates the gun clockwise, so that you may shoot at enemies coming from any direction. Hani is thus reminiscent of a flying tank. Hani starts out with only one life to spare and a weak weapon, usually giving few minutes of play before game over. However, each enemy shot gives spiritual power to Hani. Pressing the run button puts you in contact with Izanaki, who will let you trade in those power points in exchange for the usual assortment of power-ups, such as multiple shots. Izanaki will also grant you teleportation abilities, so that you may travel back and forth between levels.</p>"},{"name":"Hani on the Road","year":1990,"developer":"Arc Co., Ltd.","url":"g#H/Hanii%20on%20the%20Road%20%28JP%29.pce","filesize":393216,"score":"","genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Hani, the Haniwa clay figure, (and Lemon if a second player is present), head out on a road trip. This time Hani has to defeat the demons that came from the God's Realm.</p><p>The game features a similar set up to earlier games such as SonSon and Shockway Rider. In each level the playfield is split into 4 separate paths. Hani can move freely between paths. The paths themselves are littered with pits that can be jumped and enemies which need to be kicked. Also on the paths are items like blue jars (collecting 25 will earn Hani an extra life), mystery jars which are worth varying points, rockets, trampolines, among others.</p><p>Hani can't take all day to complete a level as there is a countdown timer that will cost Hani a life if he takes to long. Luckily there are a few time clocks scattered around which will put more time on the clock when collected.</p>"},{"name":"Hatris","year":1991,"developer":"Bullet-Proof Software, Inc.","url":"g#H/Hatris%20%28JP%29.pce","filesize":131072,"score":6,"genres":"Puzzle > Fixed / flip-screen > Real-time > Falling block puzzle > Regional differences","desc":"<p>In <em>Hatris</em>, the falling blocks of Tetris are replaced by falling hats which are top hats, cowboy hats, baseball caps, derbys, party hats and crowns. The setting is a hat factory, where hats are dropped down from a conveyor belt two at a time and must be stacked on one of six mannequin heads. Once five hats of the same kind have been stacked on top of each other, they fall down onto another conveyor belt below and are shipped out of the factory, rewarding the player with a cash bonus (the game keeps track of score as money, not simply points). Once enough hats are shipped out of the shop, the game goes up a level to the next shop. The higher shop number the player gets to, the more types of hats start appearing to make it more difficult for the player to accomplish their task. The game ends when one of the stacks of hats reaches the top of the screen.</p><p>The NES version of the game also features an aid system. Players can receive aid from the avatars of either Alexey Pajhitnov or Vladimir Pokhilko. The aid is earned by completing 5 sets of a hat type (each avatar has 3 hat types dedicated to them) and multiple aid can be stored up til the player chooses to use it. Vladimir can switch hat columns while Alexey can remove hats from the bottoms of the hat columns. At the end of a level, any stored aid can be kept or sold for money.</p><p>The Famicom version of the game contains some differences from the NES version of the game. It doesn't have a point bonus for clearing a set of hats at the same time and there is no aid system. At the end of a level. there is a sale screen, which lets the player choose which hat type they want to sell, which will remove it from the playfield. While the sale screen is seen in other versions of the game, there is no extra points received in the Famicom version.</p>"},{"name":"Heavy Unit","year":1989,"developer":"Kaneko Co., Ltd.","url":"g#H/Heavy%20Unit%20%28JP%29.pce","filesize":393216,"score":6.7,"genres":"Action > Side view > 2D scrolling > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>The human colony \"Le Tau\" is under attack by some strange aliens. It is the player's job to use a special starship and destroy everything which moves. <em>Heavy Unit</em> is a typical side-scrolling shooter with six levels filled with enemies, mid and end bosses. </p><p>Destroyed enemies may leave behind items which have beneficial effects when collected: increased speed, better weapon power, a shield, extra lives or transformation into a robot. The robot has a more powerful weapons system (laser beam and homing energy balls instead of a vulcan gun), but also a downside: its large size makes it easier to be hit by enemies or crash into the environment. If that happens, a life and all collected upgrades are lost and the ship is reset at the last checkpoint.</p><p>While the level layouts are identical in all versions, there are some minor differences in enemy placement, graphics (e.g. the Genesis version has more colours and bigger enemies) and sound.</p>"},{"name":"Hisou Kihei X-SERD","year":1990,"developer":"NCS Corporation","url":"g#H/Hisou%20Kihei%20X-SERD%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":786432,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > Anime / Manga > Turn-based > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Set during the 24th century, a human settlement on Jupiter was attacked by hostile forces. These forces then moved on to start attacking Earth. To combat this menace, all of the Earth's armies made up of regional federations  joined together. The human army had a technical breakthrough with SERD, a  High Mobility Humanoid Weapon System, which gives the humans a chance to fight off the alien invaders. </p><p>This game is a turn-based strategy game. The player takes on the role of a captain of the mobile fortress aircraft carrier ALTEA. The captain is in command of up to seven SERD pilots at a time. Each SERD unit has its own unique characteristics.</p><p>The game has 10 scenarios to play through. Battles can earn the pilots attack and evasion experience points which will increase their hit rate and evasion rate, respectively. Evasion experience is earned by dodging attacks.</p>"},{"name":"Hit the Ice: The Video Hockey League","year":1991,"developer":"Taito Corporation","url":"f#Hit%20the%20Ice%20-%20VHL%20-%20The%20Official%20Video%20Hockey%20League%20%28USA%29.zip","filesize":180074,"score":6.2,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Arcade > Hockey","desc":"<p><em>Hit the Ice</em> is a fast-paced, high-impact hockey game. Having more in common with Midway's Arch Rivals than any sane hockey simulation, this arena is no place for penalties, and no place for wimps. While the idea is still to somehow put the puck into the opposing team's goal, each team only has three players, there is a heavy focus on checking, and it is possible to do a \"super shot\" which is strong enough to send the goalie into the net along with the puck.</p><p>Available are exhibition and tournament modes for one or two players. Two players can even team up to take on the computer. The TurboGrafx-16 release also adds a four-player mode, while the Gameboy version adds a \"shot race\" mode where the player must get a certain number of goals as quickly as possible.</p>"}]