[{"name":"J.J. & Jeff","year":1987,"developer":"Hudson Soft Company, Ltd.","url":"f#J.J.%20%26%20Jeff%20%28USA%29.zip","filesize":139714,"score":6.2,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>Kato &amp; Ken Detective Agency are assigned the task of locating a missing rich man, and you can choose either Kato or Ken to go on the mission. Your partner doesn't like this one bit, so he decides to make a nuisance of himself along the way. Similar to Adventure Island, you must make your way through several levels, destroying wildlife along the way, but instead of using a hammer, you have three different ways to kill them: jump on or kick them, or when they are walking on the ground, blow gas out of them. </p><p>While scrolling through the level, your vitality will decrease, but it can be restored by collecting fruit and junk food. During your travels, you will also encounter your partner doing things that shouldn't be done in public, but sometimes, he will throw stuff at you to make you lose some of your vitality. The only way that you can deal with him is by kicking him where it hurts.</p><p>Along the way, you can enter doors. Doing this will give you a hint about the level and your vitality will be increased as well. You can kick certain objects such as lamp posts, trashcans, or thin air to obtain coins, or to make hidden platforms appear. Coins can be used in slot machines that will give you extra vitality, more lives, extra coins, and more. Slot machines only appear when you enter certain doors.</p>"},{"name":"Jack Nicklaus' Turbo Golf","year":1989,"developer":"Accolade, Inc.","url":"f#Jack%20Nicklaus%27%20Turbo%20Golf%20%28USA%29.zip","filesize":148743,"score":7.1,"genres":"Sports > Behind view > Golf","desc":"<p><em>Jack Nicklaus' Greatest 18 Holes of Major Championship Golf</em> is a 3D golf simulation featuring an 18 Hole course created by Jack Nicklaus himself. Each of the 18 holes are from famous courses around the world and include number 8 at Pebble Beach, number 18 from Muirfield, number 12 from St. Andrews, number 12 from Augusta, number 10 at Riviera, and more. Gameplay is for one to four players and can be either stroke play or a skins game.</p>"},{"name":"Jackie Chan's Action Kung Fu","year":1991,"developer":"Now Production Co., Ltd.","url":"f#Jackie%20Chan%27s%20Action%20Kung%20Fu%20%28USA%29.zip","filesize":290998,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Martial arts > Licensed","desc":"<p>Jackie Chan and his twin sister Josephine were great kung fu fighters in China and trained under a great master. One day when Jackie and Josephine were out walking, the Master's great enemy, The Sorcerer, appeared. The Sorcerer had come to rule over China and knew the twins would stand in his way, so he cast a spell to make Josephine disappear. Now it's up to Jackie Chan to follow after the Sorcerer and battle his minions in order to rescue his sister and save China.</p><p><em>Jackie Chan's Action Kung Fu</em> is a side-scrolling fighting game. Jackie's controls are one button to jump and another one to attack or be used in combination with a direction for a special attack. On his quest, Jackie must punch and kick his way past frogs, ninjas, birds and other enemies. Jackie can acquire special-moves such as the Tornado attack, the 180 degree spin kick, the 360 degree spin kick and the Sky Attack. Other power-ups include energy refills and bonus points.</p>"},{"name":"Jaseiken Necromancer","year":1988,"developer":"Hudson Soft Company, Ltd."},{"name":"Jinmu Densho (J)","year":1989,"developer":"Manjyudo Co., Ltd.","url":"g#J/Jinmu%20Denshou%20%28JP%29.pce","filesize":524288,"score":"","genres":"Action > Behind view","desc":"<p><em>Jinmu Denshō</em> is a game based on the style of Space Harrier where you play a Samurai who must run and jump into the screen to destroy evil creatures who run and fly at you from a distance with your sword. You do have the ability to run back on yourself, though, and later levels have platform jumping action. Scattered along the way are statues, which, when broken, allow you to collect health or shurikens that you can throw at distant enemies.</p>"}]