[{"name":"Lady Sword: Ryakudatsusareta 10-nin no Otome","year":1992,"developer":"Games Express","url":"g#L/Lady%20Sword%20-%20Ryakudatsu%20Sareta%2010-nin%20no%20Otome%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":1048576,"score":"","genres":"Role-playing (RPG) > 1st-person > Anime / Manga > Turn-based > Fantasy > Adult","desc":"<p>In this game, the player takes control of a young nameless traveler. One day, the hero meets a man who tells him a sad story: monsters have kidnapped his granddaughter, and locked her away in a tower. Apparently, the monsters also took away nine other young girls, and have some evil plans in mind. The hero agrees to venture into the tower's labyrinth and succeed where no other adventurer could...</p><p><em>Lady Sword</em> is a first-person solo dungeon crawler. The player navigates the hero through the complex, maze-like corridors of the tower (with an auto-map feature), trying to find the right way to the stairs to the next floor. Fake walls, teleporters, one-way doors, items that must be collected to unlock hidden passages, boss enemies, etc., are there to make this task harder than it looks. Regular enemies pop out randomly, and must be defeated in a very simple turn-based combat. </p><p>There is no damage feedback for the hero (though the player can see exactly how badly the hero himself is hurt), no weapons, armor, or items for combat usage. The player can heal the hero's wounds by selecting \"sleep\" from the menu. Sleeping restores the hero to full HP; but if he rests too much, a tough demon will appear and attack.</p><p>Character growth is handled via direct stat increasing; there are no \"levels\", and the hero's HP, attack and defense power, as well as agility, increase gradually the more he fights.</p><p>On each floor, a digitized photo of a young woman will greet the hero and encourage the player to explore further - at the stairs to the next floor, should the hero overcome all the obstacles, the player will be able to see the girl naked.</p>"},{"name":"Legend of Hero Tonma","year":1991,"developer":"Irem Corp.","url":"f#Legend%20of%20Hero%20Tonma%20%28USA%29.zip","filesize":226123,"score":7.1,"genres":"Action > Side view > Platform","desc":"<p>A little caped hero called Tommy must fight his way to the boss' castle through a cute world to rescue a princess, but stopping him from his rescue mission will be several enemies, which he has to deal with by launching little fireballs at them. Tommy may also jump on their heads to stun them for a moment.</p><p>Getting power-ups will make the fireball soon increase to a bouncing fireball, which will deal more damage to enemies. Treasure chests can be busted open, allowing Tommy to collect coins. Tommy's journey will have him explore ruins, cliffs, statues, dungeons, and finally the castle. At the end of each level, there is a boss that must be defeated in order to proceed to the next stage.</p>"},{"name":"Legendary Axe II, The","year":1990,"developer":"Red Company Corporation","url":"f#Legendary%20Axe%20II%2C%20The%20%28USA%29.zip","filesize":154287,"score":7.7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Fantasy > Regional differences","desc":"<p>The Axe is back... with twice the force and twice the fury of 1989's \"Videogame of the Year\"! This time it's brother against brother locked in deadly combat. Your older brother has summoned unspeakable forces of evil to take control of the kingdom. Treachery rules! Your only hope is the legendary royal sword! But will its power be enough to overcome the Cliffs of Chaos? The Skull Dungeons? And the treacherous Crypts of Slime? Only your courage, your fighting skill, and the Legendary Axe can answer!</p><p>This game has you fighting monsters through seven stages with just a sword, but three other weapons can be picked up along the way, and include axes, chain spears, and smart bombs. These weapons can only be obtained by collecting the power-up that a defeated enemy leaves behind. Weapons can be switched along the way. At the end of each level, you must defeat a huge boss in order to go to the next stage.</p>"},{"name":"Legendary Axe, The","year":1988,"developer":"Victor Musical Industries, Inc.","url":"f#Legendary%20Axe%2C%20The%20%28USA%29.zip","filesize":165931,"score":7.4,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Fantasy","desc":"<p>You are the mighty warrior Gogan, whose village has been required  by the Jagu tribe to give a human sacrifice each year. Flare, your childhood friend, has been chosen as the sacrifice. Your task is to rescue Flare and destroy the Jagu and their leader. To help you complete your mission, you are given the Legendary Axe, which is said to possess tremendous power that is usable only to its wielder. </p><p>There are six zones in the game and has Gogan exploring forests, caves, mountains, dungeons, and castles, while defeating enemies that get in his way with his axe. Idols can be broken to reveal power-ups that will increase the axe's power and speed up its swing. These power-ups can also award you extra lives, more points, and the ability to access secret areas. At the end of each zone, you have to defeat a boss in order to proceed.</p>"},{"name":"Life Force","year":1991,"developer":"Konami Industry Co. Ltd."},{"name":"Liquid Kids","year":1992,"developer":"Taito Corporation"},{"name":"Lode Runner: Lost Labyrinth","year":1990,"developer":"Brøderbund Software, Inc.","url":"g#L/Lode%20Runner%20-%20Lost%20Labyrinth%20%28English%20Translated%2C%20Rev%200.99%29.pce","filesize":262144,"score":"","genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Direct control","desc":"<p><em>Lode Runner: Lost Labyrinth</em> is an exact conversion of the original Lode Runner. However, this version features one hundred levels which mostly differ from the original ones. Another difference is that the levels scroll.</p><p>This is a platformer in which the protagonist needs to collect all gold which is spread out over the levels. Unfortunately there are a lot of enemies roaming around which should be avoided. The protagonist can't jump and so he needs to resort to ladders and horizontal ropes for dodging. The only way to temporarily get rid of a guard is to make a hole in the ground where they can't get out when falling in. After a certain amount of time a hole is filled up and a trapped guard respawns.</p>"}]