[{"name":"Magical Chase","year":1991,"developer":"Quest Corporation","url":"f#Magical%20Chase%20%28USA%29.zip","filesize":295340,"score":7.5,"genres":"Action > Side view > 2D scrolling > Shooter > Fantasy","desc":"<p><em>Magical Chase</em> is a 2D side-scrolling shoot 'em up set in a fantasy world.</p><p>Game's heroine is a little witch called Ripple, who is flying on a magic broomstick. The gameplay is typical for the genre: Ripple flights from left to right and shoots enemies. She has two sidekicks - anthropomorphic stars called Star Maidens, which work like a the options of Gradius. When she destroys enemies, they will leave behind different colored gemstones, which serve as the game's currency that can be used in special shop.</p><p>The game has six stages, and each level has a mid-boss and an end boss.</p>"},{"name":"Mahjong Gokū Special","year":1990,"developer":"Chat Noir Co., Ltd."},{"name":"Maison Ikkoku: Omoide no Photograph","year":1989,"developer":"Micro Cabin Corp.","url":"g#M/Maison%20Ikkoku%20%28English%20Translated%2C%20Rev%201.01%29.pce","filesize":524288,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Meditative / Zen > Japanese-style adventure > Menu structures > Comedy > Romance > Licensed","desc":"<p><em>Maison Ikkoku: Omoide no Photograph</em> is a Japanese menu-based graphical adventure game based on the anime and manga series. Players control Yusaku Godai and will need to help him find a secret photograph that's been hidden away by the manager. Godai will need to bribe the inhabitants, which constantly move around the house in order to get access to Kyoko's room. But even if Godai makes it into the manager's room and tries to look at the framed photo, something will always happen which will force Godai to leave the room. Thus, after multiple attempts, Godai makes the (il)logical decision to gather photos of all the inhabitants of the boarding house to make Kyoko show him the photo. The game has the player move between locations in the boarding house and the town, constantly running out of money, and meeting all the cast from the original comic book, including Nikaido who did not appear in the anime.</p>"},{"name":"Makai Hakkenden Shada","year":1989,"developer":"Data East Corporation","url":"g#M/Makai%20Hakkenden%20Shada%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":262144,"score":"","genres":"Action > Role-playing (RPG) > Diagonal-down > Anime / Manga > Fantasy","desc":"<p>The story of this game is loosely based on the 19th century Japanese epic novel <em>Nansō Satomi Hakkenden</em> (\"Tale of Eight Dogs\") by Kyokutei Bakin. In the game, the player controls a young warrior named Shin. The elder of his home village tells him that a magical artifact known as the Statue of the Four Gods has been stolen. This artifact was sealing away the spirit of the evil Tamazusa. To prevent Tamazusa's resurrection, Shin must find seven other warriors. Only when they are united can the evil be defeated once and for all...</p><p>Despite the premise of eight warriors, <em>Makai Hakkenden Shada</em> is an action RPG in which the player controls only Shin. The game is similar to the better-known  Ys games in many ways. As in <em>Ys</em>, the hero fights enemies simply by \"bumping\" into them. Defeated enemies produce money, which can be spent in villages to purchase weapons and various types of armor, and experience points. Once a set amount of those is accumulated, the hero gains a level.</p><p>Later in the game Shin receives spells and special techniques, which must be executed actively, by pressing a button. There is also a \"search\" command in the game, which is required to use to solve certain situations.</p>"},{"name":"Makai Prince Dorabocchan (J)","year":1990,"developer":"Red Company Corporation","url":"g#M/Makai%20Prince%20Dorabocchan%20%28JP%29.pce","filesize":393216,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Platform > Fantasy","desc":"<p><em>Makai Prince Dorabocchan</em> is a platformer in which the player takes control over the son of a mighty vampire. Unfortunately he opens a seal which causes monsters to come into the world. Now he needs to cross six levels (each with a boss) while avoiding to lose all life energy. The levels are side-scrolling with horizontal movement involved. Besides dodging by jumping, the player character has two standard ways to deal with enemies: using the unlimited vampire breath (works like a gun) or using tomatoes as bombs which have to be found first. The enemies leave behind various power-ups when killed, e.g. energy, extra lives or armor.</p>"},{"name":"Maniac Pro-Wrestling: Ashita e no Tatakai","year":1990,"developer":"A.I Co., Ltd."},{"name":"Marchen Maze","year":1990,"developer":"N.H. System","url":"g#M/Ma%CC%88rchen%20Maze%20%28English%20Translated%2C%20Rev%201.1%29.pce","filesize":262144,"score":"","genres":"Action > Side view > Top-down > Arcade > Shooter","desc":"<p><em>Märchen Maze</em> is a platform/shooter game and conversion of Namco's 1988 arcade game of the same name. The gameplay remains largely the same - the player takes control of Alice who must shoot bubbles at enemies to knock them off platforms. Unlike the arcade original which was in isometric perspective, Märchen Maze on the PC Engine is an overhead game. This version features different stages than the arcade game, and because of the lack of a time limit, many of the stages are much more expansive. The chequered platforms at the end of a level are static rather than moving, hopping on to them automatically takes you to the boss. Also, instead of starting from a checkpoint when you die, your lives are represented by balloons. Should Alice fall, you'll be respawned on the spot.</p>"},{"name":"Mega Bomberman","year":1993,"developer":"Hudson Soft Company, Ltd."},{"name":"Metal Stoker (J)","year":1991,"developer":"Sankindo","url":"g#M/Metal%20Stoker%20%28JP%29.pce","filesize":524288,"score":"","genres":"Action > Top-down > Arcade > Shooter","desc":"<p><em>Metal Stoker</em> is a 2D top-down, multi-directional shooter. The player controls a female pilot (presented only in several cut-scenes) controlling a prototype CS-05 tank. The tank can freely be moved around the screen in any direction and the game scrolls along until the edge of the area is reached. The tank needs to destroy enemies and locate the exit. There are several weapons such as lasers, homing missiles, mines, a force field etc. The tank's turret can be locked into one position to shoot, so it is possible to strafe. Sometimes the player must destroy all the enemies or a boss to progress. The game has seven levels in totals and many parts of the levels are mazes.</p>"},{"name":"Military Madness","year":1989,"developer":"Hudson Soft Company, Ltd.","url":"f#Military%20Madness%20%28USA%29.zip","filesize":282926,"score":7.5,"genres":"Strategy > Top-down > Turn-based > Sci-fi / futuristic","desc":"<p><em>Military Madness</em> is a futuristic turn-based strategy war game. The year is 2089 and the setting is Earth’s moon, which yields many important resources. While the governments of Earth bicker over their staked claims on the moon, the evil Axis Empire launches a lunar military campaign and takes over the moon, using its factories to produce advanced weaponry, the most devastating of which is the SAM (Supreme Atomic Missile). As commander of the Allied forces, it is the player’s responsibility to lead what’s left of the Allied armies in a desperate offensive against the Axis Empire on the lunar surface before they can use the SAM to destroy Earth.</p><p>There are 32 maps (2 different campaigns with 16 maps each) to play through. In each map, the player must strategically defeat the outnumbering Axis forces either by destroying all enemy units or capturing the enemy base camp. There are many different units that both sides utilize - infantry, tanks, aircraft, artillery, and a few others that have specialized functions. Gameplay consists of moving units into positions that will gain the best advantage to attack the enemy, capitalizing on many factors, which include battle experience, terrain, support tactics, and - sometimes - pure luck.</p>"},{"name":"Momotarō Densetsu Gaiden","year":1992,"developer":"Hudson Soft Company, Ltd."},{"name":"Momotarō Densetsu II","year":1990,"developer":"Hudson Soft Company, Ltd."},{"name":"Momotarō Densetsu Turbo","year":1990,"developer":"Hudson Soft Company, Ltd."},{"name":"Morita Shōgi PC","year":1991,"developer":"Random House Co., Ltd."},{"name":"Moto Roader","year":1989,"developer":"NCS Corporation","url":"f#Moto%20Roader%20%28USA%29.zip","filesize":138899,"score":6.2,"genres":"Action > Racing / Driving > Top-down > Shooter","desc":"<p>The action in this racing game is viewed from above and features rotational controls. There are 6 racetracks featured including real-world ones such as Laguna Seca. Before each race you can buy a full compliment of upgrades and weapons, with each area (engine, handling, turbo and so on) having several variably-priced options. The unusual thing about the racing system is that the action always follows the leader. If you slip too far behind, your car is blown up and placed back onto the track further on in order to keep up (similarly to Micro Machines). This can only happen a limited number of times before the game is over.</p>"},{"name":"Moto Roader II (J)","year":1991,"developer":"JTS","url":"g#M/Moto%20Roader%20II%20%28JP%29.pce","filesize":393216,"score":7.2,"genres":"Racing / Driving > Top-down > 2D scrolling > Arcade > Motorcycle > Track racing > Sci-fi / futuristic","desc":"<p><em>Moto Roader II</em> is a racing game shown in a top-down perspective. Five vehicles compete on a course with the goal to finish first. However, the screen always follows the leading vehicle and if a vehicle is left behind, it gets replaced on the current screen. Every vehicle has a fuel counter which gets a penalty if the vehicle is hit or needs to be replaced. Reaching zero ends the race. Players can choose between three vehicles which drive differently (car, tank or hovercraft) and, if they have gathered enough prize money, can upgrade it between races (including weapons). In contrast to the predecessor, the game has a futuristic look.</p>"}]