[{"name":"Nastar Warrior","year":1990,"developer":"Taito Corporation"},{"name":"Naxat Open (J)","year":1989,"developer":"Naxat Soft","url":"g#N/Naxat%20Open%20%28JP%29.pce","filesize":393216,"score":"","genres":"Simulation > Sports > Top-down > Golf","desc":"<p>Naxat's first foray into golf games features a full 18-hole course and lots of top professional opponents. You choose your clubs before starting play, and the game automatically chooses what it feels is the best club for each shot. Before each shot you can view either a fly-by of the course or a close-up of the green and its contours. The game's courses scroll in multiple directions form an overhead view, and feature bunkers, trees, water hazards and all the rest. A three-press control system is used for playing shots, switching to a two-click once you reach the green (as draw and fade become irrelevant).</p>"},{"name":"Necros no YÅsai","year":1990,"developer":"ASK Kodansha Co., Ltd."},{"name":"Neutopia","year":1989,"developer":"Hudson Soft Company, Ltd.","url":"f#Neutopia%20%28USA%29.zip","filesize":245596,"score":7.1,"genres":"Action > Top-down > Fantasy","desc":"<p>The princess Aurora was kidnapped by the evil Dirth, and the king send a warrior named Jazeta on a mission to rescue her. It appears that once Dirth way sealed by eight wise men who used the power of eight sacred medallions. Princess Aurora is the only one who knows how to use those medallions, and that is why Dirth abducted her. The hero must explore the land, descend to the dangerous labyrinths, retrieve the eight medallions, rescue the princess, and defeat Dirth.</p><p>Very similar to  Zelda games, <em>Neutopia</em> allows the player to freely roam the vast land, fighting many different monsters in wilderness areas as well as in dungeons. Dungeons also require some puzzle-solving (pushing stones, blowing walls with bombs, etc.). The game has a slight RPG flavor, allowing the player to power-up by collecting various items, and equip different weapons and armor.</p>"},{"name":"Neutopia II","year":1991,"developer":"Hudson Soft Company, Ltd.","url":"f#Neutopia%20II%20%28USA%29.zip","filesize":440605,"score":7.2,"genres":"Action > Top-down > Fantasy","desc":"<p>Some years have passed since the brave hero Jazeta destroyed Dirth, the Emperor of Darkness. Peace has returned to the land of Neutopia. But there are still monsters roaming the countryside, and some of them were spotted near Yurius Shrine. Jazeta went there to find out what exactly had happened. But he never returned. His son must first of all find his missing father. Can it be that the shadow of Emperor of Darkness threatens the peaceful land again?...</p><p><em>Neutopia II</em> is similar to its predecessor in every way. Navigating the hero from a top-down view, the player explores the vast countryside, fighting monsters in action-based combat. The game is not a true RPG; the protagonist does not gain any experience points from combat, only collecting money to buy supplies. In dungeons, the player can use bombs on walls to reveal secret passages, push stones, and fight many regular enemies and bosses.</p>"},{"name":"New Adventure Island","year":1992,"developer":"Hudson Soft Company, Ltd.","url":"f#New%20Adventure%20Island%20%28USA%29.zip","filesize":328384,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Somewhere on the peaceful Adventure Island, Master Higgins weds Tina, the new \"Miss Island\". Everyone who was invited to the wedding begins to celebrate when, suddenly, the evil Baron Bronsky appears and snatches Tina away, while his henchmen take the six children away. To reach his castle and rescue Tina, Master Higgins must first rescue the six children, each of whom is hidden on a separate island.</p><p><em>New Adventure Island</em> is a one-player action game that consists of seven areas, with four rounds each. In order to get through the areas, you must use your hatchet to destroy wildlife such as frogs, spiders, birds, snails, insects, and other pests, and watch out for hazards such as rocks, fire, water, and pits. </p><p>As you progress further, your vitality will get low, so fruit must be collected in order to restore it. Along the way, you can smash open eggs that will award you with better weapons that include boomerangs, arrows, and magical fire. Some of the eggs will also reveal a fairy, which will protect you from getting hit. If you are unlucky enough to find an eggplant hidden in one of these eggs, your vitality will drain away very fast, and you need to get fruit every five seconds in order to survive.</p><p>When you get to the end of an area, you will have to defeat one of the henchmen and rescue a child from one of the four castles.</p><p>An update of the original NES game.</p>"},{"name":"New Zealand Story, The","year":1990,"developer":"Taito Corporation"},{"name":"Night Creatures","year":1992,"developer":"Manley & Associates, Inc.","url":"f#Night%20Creatures%20%28USA%29.zip","filesize":237663,"score":"","genres":"Action > Side view > Horror","desc":"<p><em>Night Creatures</em> is a side-scrolling action game. You are an unfortunate peon who is bitten by Hecate, a witch. Unless you kill Hecate by sun-up you will forever be doomed to be a creature of the night.</p><p>The world of Night Creatures consists of several different scenes, a town, a grave yard, a forest, and so on. You can travel from one scene to the next in a non-linear fashion. You have to determine the fastest way to find the weapons and abilities you need to beat Hecate. There are several boss encounters as well. After defeating a boss, you gain the ability to transform into an animal, such as a wolf or an owl.</p>"},{"name":"Ninja Gaiden","year":1992,"developer":"Tecmo, Ltd."},{"name":"Ninja Spirit","year":1990,"developer":"Irem Corp.","url":"f#Ninja%20Spirit%20%28USA%29.zip","filesize":257938,"score":7,"genres":"Action > Side view > Platform > Direct control > Fantasy","desc":"<p>A ninja-based action game that has the player leading Moonlight through numerous enemy-riddled levels on a quest to exact revenge against his father's murderer. To accomplish this task Moonlight is armed with a katana, shurikens, bombs, and a sickle and chain weapon. Each weapon offers its own advantages and must be used at certain times to overcome specific obstacles or opponents. </p><p>The game's coin-op origins are evident in the fact that that the home versions do not have passwords or saves. To compensate for this, however, adjustable difficulty settings were added.</p>"},{"name":"Ninja Warriors, The (J)","year":1989,"developer":"Taito Corporation","url":"Ninja_Warriors_The_Japan/Ninja_Warriors_The_Japan.pce","filesize":393216,"score":7,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control","desc":"<p><em>The Ninja Warriors</em> is a one or two player side-scrolling beat-em-up. The Taito coin-op featured three monitor screens side by side, while the Amiga version was developed in letterbox format in order to show as much of the wide screen background graphics as possible. </p><p>The player(s) control robot Ninjas, which battle their way through the levels using Shuriken and knives. As the Ninja's take damage their classic Ninja garb is torn away to reveal robotic limbs, torso or head. When the damage reaches a critical level the Ninja Robot explodes scattering mechanical body parts.</p><p>As with The Sales Curve's later title SWIV, <em>The Ninja Warriors</em> uses the company's Dynamic Loading System to load sprites, sound and background graphics from disk on the fly.</p>"},{"name":"Nintendo World Cup","year":1992,"developer":"Technos Japan Corp."}]