[{"name":"Obocchama-kun","year":1991,"developer":"Pack-In-Video Co., Ltd","url":"g#O/Obo%20Chama-kun%20-%20Little%20Princeling%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":524288,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p><em>Obocchama-kun</em> is an action game based on the TV anime of the same name (which itself is based on a manga). Winning the game is basically achieved by getting to the end of each level and beating the boss (sometimes replaced by another special challenge). Of course there are also a variety of enemies (two different per level) running around which try to harm the protagonist. He has two weapons to use against them: either shooting them or, well, jumping in their face with his buttocks. There are also power ups to collect, e.g. weapon upgrades or summoning an ally which supports him through the rest of the stage. The protagonist also has the ability to transform himself, e.g. into a dog or a blind man.</p>"},{"name":"Operation Wolf","year":1990,"developer":"Taito Corporation","url":"g#O/Operation%20Wolf%20%28JP%29.pce","filesize":524288,"score":7,"genres":"Action > 1st-person > 2D scrolling > Arcade > Rail shooter","desc":"<p>You have been recruited for Operation Wolf, a desperate attempt to rescue prisoners from the enemy. Through a series of missions, you'll engage a variety of enemies, from soldiers to ninjas, patrol boats to helicopters, and more. Can you carry the day?</p><p><em>Operation Wolf</em> is an arcade game by Taito. It is essentially a bitmapped \"rail-shooter\", where you basically hold the gun and shoot just about everything that moves, while conserving your ammo and grenades. Shoot ammo/grenades and healing items on the screen to \"pick them up\". Your primary machine gun can kill everything if you hit it enough times, but you can also use the grenade launcher for really deadly targets like helicopters or armored cars. You can collect a machine gun which will allow you to shoot faster for a few seconds. </p><p>You'll be pummelled by a LOT of enemies. Some will be shooting, others will be tossing grenades, knifes, and more. Some are armored and requires more than a few hits, others dodges. You can shoot grenades and knifes out of the air if you aim well enough. There are also civilians running around which can be shot, but it's not beneficial. </p><p>Bosses appear at the end of some levels, and each has a specific weakness you need to exploit.</p>"},{"name":"Order of the Griffon","year":1992,"developer":"Westwood Associates","url":"f#Order%20of%20the%20Griffon%20%28USA%29.zip","filesize":322701,"score":"","genres":"Role-playing (RPG) > 1st-person > Top-down > Turn-based > Fantasy > Licensed","desc":"<p>The people of Radlebb Keep are worried: Undead and werewolves have been seen in the nearby forests, and rumor has that a vampire has taken residence at Koriszegy Keep. Lord Korrigan hires a group of adventurers to dispel the rumors. They soon find out that not only the rumors are true, but that there are also other evil forces at work in the area.</p><p><em>Order of the Griffon</em> is a role-playing game based on 1st Edition <em>Dungeons &amp; Dragons</em> rules (many well-known monsters, magic items and spells are present) and set in the D&amp;D world of Mystara. It uses gameplay conventions that are somewhat similar to those from Strategic Simulations, Inc's Gold Box titles: When the party is in towns and dungeons, a first-person view is used, while overland travel happens on a large map of the area. Combat with monsters is turn-based and takes place on a special tactical screen.</p><p>A party consists of four characters, which cannot be created but must be selected from a list of 21 different predetermined characters.</p>"},{"name":"Ordyne","year":1989,"developer":"Namco Limited","url":"f#Ordyne%20%28USA%29.zip","filesize":213945,"score":6.2,"genres":"Action > Side view > Shooter > Sci-fi / futuristic","desc":"<p><em>Ordyne</em> is a horizontal side-scrolling shoot 'em up (also considered a \"cute 'em up\" due to its lighter tone) that puts players in the role of Yûichirô Tomari, a genius scientist, and Sunday Chin, his faithful assistant. The two heroes must rescue Tomari's fiancee Kana Aibara from the evil Dr. Kubota.</p><p>During gameplay, players can obtain crystals that can be used to buy special weapons, extra lives, and other power-ups at shops located throughout the levels. There are also bonus games that allow players to win multiple crystals or points by shooting at rotating targets.</p><p>Ordyne is two-player simultaneous.</p>"},{"name":"Out Live","year":1989,"developer":"Sun Electronics Corp.","url":"g#O/Out%20Live%20%28English%20Translated%2C%20Rev%201.1%29.pce","filesize":303104,"score":"","genres":"Role-playing (RPG) > 1st-person > Anime / Manga > Turn-based > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>A very important discovery was recently made on the planet Laffra - ancient ruins at an excavation site, containing relics of another civilization, with technique that would surely benefit the great intergalactic Empire. But a mysterious organization that calls itself Mars began to stir unrest on the planet. The head of Imperial Scouts sends the hero, piloting a combat robot known as FW, into the depths of the ruins, to face the enemies and retrieve the precious knowledge...</p><p><em>Out Live</em> is a solo dungeon crawler; unlike most representatives of this genre, it is set in a sci-fi environment, and the player controls a giant robot rather than a medieval warrior. Most of the enemies are also machines and robots of different kinds.</p><p>Before venturing into the dungeon, the player has access to various shops, where it is possible to repair the robot, buy weapons, protective shields, and items that restore the robot's energy. Most of the gameplay takes place in pseudo-3D, maze like underground complexes (without an auto-map, but with a compass feature). There, the game plays similarly to other dungeon crawlers: random enemies must be fought in turn-based fashion; they drop money and award the player character with experience points.</p><p>A somewhat unusual feature is double leveling: the robot has two independent levels, for attack and for defense. The experience points the robot receives after battles also come in two different flavors. Depending on the enemy type and outcome of the battle, the robot receives different amounts of experience. The leveling-up itself is automatic, increasing maximum energy, attack and defense parameters.</p>"},{"name":"Out Run","year":1990,"developer":"SEGA-AM2 Co., LTD.","url":"g#O/Out%20Run%20%28JP%29.pce","filesize":524288,"score":7.4,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing","desc":"<p><em>OutRun</em> is a racing game that allows the player to race across varied terrain in a readily available Ferrari, complete with a female passenger, over a series of short tracks.</p><p>Gameplay is viewed from just above and behind the car. The roads are full of sharp bends and hazards, contact with which can cause the car to roll and lose the player's time. On each section of track there is a fork in the road, allowing the player to choose which direction he or she wishes to go in. The player has to to complete five track sections in total, out of the fifteen in the game.</p>"},{"name":"Override","year":1991,"developer":"Sting, Inc.","url":"g#O/Override%20%28JP%29.pce","filesize":262144,"score":7.1,"genres":"Action > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Override</em> is a vertically-scrolling shooter in which the player controls a fighter craft on a mission to stop an alien invasion of the Earth. Much of the action takes place on planet surfaces, and enemies include spaceships of various kinds as well as ground enemies, mobile (tanks) or stationary (turrets). The player-controlled craft begins with two lives with three hit points each; restoring power-ups can repair the plane or increase its number of lives. </p><p>Other power-ups come in two varieties: strength-increasing or secondary weapons. Depending on the color, the latter grants the plane wingmen with laser attacks, spreading fire, side lasers, rotating energy balls, etc. The strength of secondary weapons can be increase by flying over strength-increasing power-ups as well. Special weapon that hurts all enemies on screen must be activated by charging, which is achieved by not pressing the fire button for a certain amount of time.</p>"}]