[{"name":"P47 Thunderbolt (J)","year":1989,"developer":"Nihon Micom Kaihatsu","url":"g#P/P-47%20-%20The%20Freedom%20Fighter%20%28JP%29.pce","filesize":262144,"score":6.2,"genres":"Action > Side view > Shooter > Historical events > World War II","desc":"<p>The P-47 was one of the toughest planes in use in World War 2, and this side-scrolling shoot 'em up puts you in control of one as you take on hordes of Nazis. 16-bit versions have a simultaneous 2-player mode, as well as the ability to wrap-around the game with increased difficulty up to 4 times.</p><p>You are initially armed with a machine gun, but can also pick up bombs, spray missiles and multi-missiles by picking up the appropriate letter. Each weapon can be upgraded by picking up further tokens of the same type. Tokens offering extra lives and speed-ups are also on offer.</p>"},{"name":"Pac-Land","year":1989,"developer":"Namco Limited","url":"f#Pac-Land%20%28USA%29.zip","filesize":84651,"score":6.5,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Pac-Land</em> is a side-scrolling 1-2 player game with a cartoony feel to it. Now equipped with arms, face, and legs, Pac must guide a fairy back to her home in Fairy Land, but this task will not be easy because Inky, Blinky, Pinky, Clyde, and Sue will pursue Pac-Man as he travels through Pac-Land. When he finally transports the fairy back to her home, Pac is given some magic shoes, which will help him get to his own home, where he will be greeted by his family: Ms. Pac-Man, Baby Pac-Man, Chomp Chomp, and Sourpuss. </p><p>There are sixteen rounds to complete, with four trips each. During each round, he can grab a power pellet, which cause ghosts to turn blue, allowing Pac-Man to eat them for points. Points are also awarded by collecting fruit that appear, like cherries and strawberries. In some rounds, Pac must use a springboard to jump over a lake. He must also make it to the end of each round before time runs out, otherwise a ghost will chase him.</p>"},{"name":"Panza Kick Boxing","year":1991,"developer":"Futura","url":"f#Andre%27%20Panza%20Kick%20Boxing%20%28USA%29.zip","filesize":330185,"score":7.5,"genres":"Sports > Side view > Fixed / flip-screen > Fighting > Boxing > Martial arts > Licensed","desc":"<p>Endorsed by André Panza, this video game adaptation of Thai kick boxing features over 35 moves. Use the training gym to build up your character's abilities until you feel ready to take on an opponent. You also have the ability to customize your attacks. When you are ready, go to the ring to take on various opponents as you try to become the best kick boxer in the game.</p>"},{"name":"Parasol Stars: The Story of Bubble Bobble III","year":1991,"developer":"Taito Corporation","url":"f#Parasol%20Stars%20-%20The%20Story%20of%20Bubble%20Bobble%20III%20%28USA%29.zip","filesize":241215,"score":8.1,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform > Direct control > Fantasy","desc":"<p>This sequel to Rainbow Islands sees a return to the gameplay of Bubble Bobble, but with Bub and Bob in their now-human forms.</p><p>The boys must clear a series of screens of bad guys - who take slightly more esoteric forms than the angry caterpillars from Rainbow Islands - and again pick up a whole bunch of power-ups.</p><p>But this time they're armed with umbrellas! Oh, okay then, parasols...</p>"},{"name":"Parodius (J)","year":1992,"developer":"Konami Industry Co. Ltd.","url":"g#P/Parodius%20Da%21%20-%20Shinwa%20kara%20Owarai%20e%20%28JP%29.pce","filesize":1048576,"score":8.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter > Comedy > Regional differences","desc":"<p>This is mostly the parody of Gradius (Nemesis on some systems), with some flavor from other shoot-em-ups, like Twinbee. The series is available on numerous platforms.</p><p>The game is a right-to-left scrolling shoot-em-up. You can choose from 4 different flying creatures, with different weapons. You must finish 7 stages, each having a boss at the end. You may start at either one, but must complete every level to advance to the final stage.</p>"},{"name":"Populous (J)","year":1991,"developer":"Bullfrog Productions, Ltd.","url":"g#P/Populous%20%28JP%29.pce","filesize":524288,"score":7.7,"genres":"Strategy > Diagonal-down > Isometric > Real-time > Managerial / business simulation > Real-time strategy","desc":"<p>You play a god, gaming against other gods in a celestial game of conquest. To win, you must help your chosen people take over the world and wipe out the vermin who worship that other god.</p><p>Each god starts out with a single human, dumped into the middle of the wilderness. Sometimes there is inhabitable land in sight, sometimes not. To get a chance to win, you must change the landscape, creating flat land for your followers to build on. The more followers you have, the more powerful you will be, so take care of them. Build as fast as you can, because the other god is doing the same.</p><p>When you have enough followers, you can make the leader of your people into a hero. He will then go around the land you have built, literally taking strength from the people into himself, and working his way toward the enemy. When he gets there, he will engage in holy warfare upon your enemy's people. He will burn; he will kill.  And he won't stop until they're all dead... or he is.</p><p>But you don't have to let your people have all the fun; the gods have other tools as well. You can drown your enemies one at a time with your land-lowering powers, submerge their towns in swamps, or raise a volcano in the middle of their best farmland. Even better, you can flood the land and drain all the people who didn't build on high ground. </p><p>And when you win, you'll have 500 more worlds to conquer. A god's play is just never done.</p>"},{"name":"Power Drift (J)","year":1990,"developer":"SEGA-AM2 Co., LTD.","url":"g#P/Power%20Drift%20%28JP%29.pce","filesize":524288,"score":7.6,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p>Ever wanted to race dune buggies at high speed on a variety of tracks? <em>Power Drift</em> is an arcade racer that gives you the chance to do just that.</p><p>There are 5 tracks to choose from, each with 5 stages. The stages range from cities, to deserts to tracks over water. There are also 12 drivers to pick from, from businessmen to skinheads and mohicans. </p><p>Your buggy has 2 gears, high and low. Once the light goes green, just keep the pedal to the metal. You’ll need to place third or higher to continue to the next stage. Be careful not to bump into other buggies or objects next to the road. While your buggy can take a pounding, crashing will slow you down. </p><p>Finish all 5 stages in a level and you’ll be presented with a bonus level.</p>"},{"name":"Power Eleven (J)","year":1991,"developer":"Westone Co., Ltd.","url":"g#P/Power%20Eleven%20%28JP%29.pce","filesize":393216,"score":"","genres":"Sports > 3rd-person (Other) > Top-down > Football (European) / Soccer","desc":"<p><em>Power Eleven</em> is a top-down soccer game with three playing modes: multiplayer, penalty kicks (shown from the back of the transparent goalkeeper) and a tournament mode. The latter is the main mode for solo players and features twelve national soccer teams. Then the player needs to defeat the other teams with rising difficulty to win the Hudson Cup. Regarding rules, the game features no fouls or off-sides.</p><p>Each athlete has a rating in the five statistics (run, dribble, kick, technique and power) which influences his performance on the field. The player can also choose between different formations and after successful matches athletes can be substituted. The most unusual aspect of the game is the power rating which is lowered when using the power mode which allows faster movement and forceful shots. However, the power does only get completely refilled after a match so it needs to be used with care. Because the activation of this mode takes up a button, there is no dedicated passing button to be found. The distance of a shot is chosen by pressing the fire button quickly or holding it.</p>"},{"name":"Power Gate (J)","year":1991,"developer":"","url":"g#P/Power%20Gate%20%28JP%29.pce","filesize":262144,"score":"","genres":"Action > Side view > 2D scrolling > Shooter > Direct control > Flight / aviation > Fantasy","desc":"<p><em>Power Gate</em> is a 2D side-scrolling shooter with gameplay similar to U.N. Squadron / Area 88. You pilot a realistic jet against other realistic enemies, jets, tanks and so on.</p><p>For the power-up system you collect items dropped by certain enemies (the red ones like in <em>Area 88</em>) that consist of speed up or down or a regular power-up for the main shot. You can also collect several special weapons more powerful than the regular straight-forward bullets or ground-bombing shots. Special weapons include smart bombs, a time limited invulnerability, a sort of after-image effect, homing missiles and other kinds of attacks. When you use them your jet also backfires, attacking enemies coming from behind. You cannot cycle between the special weapons and you can only use them in the order you picked them.</p><p>Your airplane has several life segments. Simple bosses await at the end of each stage. They are quite small, except a huge ship in a bay or the last boss. The screen scrolls slowly. The game difficulty spikes a lot in the last two stages where you need to avoid a lot of obstacles. At the end of each stage you are rated not only on how you performed but also according to how many special weapons you used or kept in stock.</p>"},{"name":"Power Golf","year":1989,"developer":"Hudson Soft Company, Ltd.","url":"f#Power%20Golf%20%28USA%29.zip","filesize":172245,"score":5.8,"genres":"Sports > Behind view > Top-down > 2D scrolling > Fixed / flip-screen > Direct control > Golf","desc":"<p><em>Power Golf</em> is played primarily with a top-down view of each hole, and a third-person perspective for hitting the ball. There is also stroke and match play, in addition to a competition mode for up to three players.</p><p>The object of the game is simply that of golf: To complete the course with the fewest shots and lowest score.</p><p>Game modes:</p><ul><li>Stroke Play -- Regular mode where competition is based on the total strokes, lowest number of course, is the winner.</li><li>Match Play -- This mode can be against the computer or another player. Players compete for each hole or in Club Match, for each other's clubs.</li><li>Competition -- This is the three-player mode. The game operates in the form of a contest and is recommended for players of differing abilities. Driving and pin contests are also included in this mode.</li></ul>"},{"name":"Power League 4 (J)","year":1991,"developer":"","url":"g#P/Power%20League%204%20%28JP%29.pce","filesize":524288,"score":"","genres":"Sports > 3rd-person (Other) > Baseball","desc":"<p><em>Power League 4</em> is a baseball game. It is similar to the first game in its series, World Class Baseball. However, since it was only released in Japan, most of the teams in the game are based on major league teams in Japan. It includes two leagues, the P League and the C League, as well as a couple hidden teams.</p>"},{"name":"Power Tennis (J)","year":1993,"developer":"Now Production Co., Ltd.","url":"g#P/Power%20Tennis%20%28JP%29.pce","filesize":524288,"score":"","genres":"Sports > 3rd-person (Other) > Top-down > Tennis","desc":"<p><em>Power Tennis</em> is a tennis game. It features three modes: singles, doubles, and world tour. Countries featured include Japan, the United States of America, the United Kingdom, Australia, and France. The player can choose between various athletes, and different types of courts (hard, lawn, and clay).</p>"},{"name":"Pro Yakyuu World Stadium (J)","year":1988,"developer":"Namco Limited","url":"g#P/Pro%20Yakyuu%20World%20Stadium%20%28JP%29.pce","filesize":262144,"score":"","genres":"Sports > 3rd-person (Other) > Top-down > Baseball","desc":"<p><em>Pro Yakyuu World Stadium</em> is the first baseball game released for the PC-Engine. The general gameplay as well as the graphics style closely resembles that of Namco's own \"Family Stadium/Famista\" baseball series for the Nintendo NES/Famicom. Game options include a one or two-player mode as well as watching two computer opponents play against each other. Players can choose from one of ten non-licensed teams.</p><p>The game itself follows the standard formula of nearly all baseball games of its time, with having a 3rd-person view from behind the batter during the pitching/batting scenes and an overhead view of the field once the player hits the ball. Progress is saved via passwords given after each match.</p>"},{"name":"Psycho Chaser (J)","year":1990,"developer":"Sting, Inc.","url":"g#P/Psycho%20Chaser%20%28JP%29.pce","filesize":262144,"score":6.8,"genres":"Action > Top-down > Arcade > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Space year X2981Y. Earth has developed battle androids to fight bloodless wars. A new battle android called \"Aura\" was developed and sent into battle, and seemed to be leading its country to victory. However, Aura broke free of human control and revolted against the Earth, taking control of the other androids and starting a war against humanity. In a last ditch effort, humanity developed one more android, stronger than any before and imbued with the wishes of humanity, dubbed \"Psycho Chaser.\" It is making its assault on Aura's stronghold to end the war.</p><p><em>Psycho Chaser</em> is a vertically-scrolling sci-fi shooter. The player takes control of the titular battle android. There are multiple weapons which can be picked up and freely switched between, and also power-ups which allow for weapon and energy upgrades between stages.</p>"},{"name":"Psychosis","year":1990,"developer":"Dual Corporation","url":"f#Psychosis%20%28USA%29.zip","filesize":138788,"score":6.1,"genres":"Action > Side view > 2D scrolling > Shooter","desc":"<p>There is something wrong with your brain. It is being taken over by the Devil Ugar himself! Your only recourse is to fight back against this hostile invasion. Thankfully your mind has created the ultimate weapon: a ship with which you can navigate the five causes (stages) and blast back the Devil's evil minions. It is your only hope, your one last chance to free your mind from this evil influence.</p><p><em>Psychosis</em> is a side-scrolling shooter where each level is meant to represent a different location within your mind. One looks like the sky, another filled with aquatic plants, one with what resemble tetris blocks. It is within these stages that you must blast everything in sight while collecting power ups to upgrade your weapon and shield. You can gain two floating balls that resemble mechanical eyes and can be directed 360 degrees around your ship to either act as a shield or to direct your weapon. Battle your way through each stage and defeat the boss at the end and eventually you'll do battle against the very DEVIL himself.</p>"},{"name":"Puzzle Boy","year":1991,"developer":"Renovation Game","url":"g#P/Puzzle%20Boy%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":262144,"score":7.2,"genres":"Puzzle > Top-down > Direct control","desc":"<p><em>Puzzle Boy</em> is a port of the Game Boy title Kwirk, but features more and different levels along with changed graphics. In contrast to the original version, the perspective is straight top-down and there is no undo-function.</p><p>However, regarding gameplay this is still a Soko-Ban variant. The player finds himself in a maze and needs to find the way to the exit. The obstacles on the way are boxes which can be pushed but not pulled, holes and revolving doors. The game features three playing modes, most notably the level mode with 100 levels. They are divided over four sets of 20 each. Those sets have a difficulty level associated with them and each rewards the same ending when solved. The other two modes are the challenge mode (solving ten levels in a limited amount of time) and a split-screen multiplayer mode.</p>"},{"name":"Puzznic (J)","year":1990,"developer":"Taito Corporation","url":"g#P/Puzznic%20%28JP%29.pce","filesize":262144,"score":7.3,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Tile matching puzzle > Point and select","desc":"<p>The challenge in each level of <em>Puzznic</em> is to manoeuvre a selection of blocks into place so as to clear them all, by making them make contact with blocks of the same design. You control a cross-hair, which can move a block left or right, which can cause it to fall if there is no block under the space it would occupy.</p><p>There are many complications in terms of solving the levels. Moving platforms meaning that you need to move a block at a particular time, or in particular order, to prevent them being blockaded. In some situations there are an odd number of a certain type of block - solving these requires positioning two of the blocks one space apart, such that a move will result in a piece making contact with two others, and immediately removing all three. You will also encounter blocks positioned on platforms suspended in space and gaps in level arrangements meaning that a certain number of blocks must be in place to make a certain move possible (by forming a stack, for example).</p><p>The game structure is slightly unusual, as after you complete each batch of four levels you get a choice of two sets of levels - you are progressing through an expanding matrix of levels, which means there are two sets on level 2, three on level 3, four on level 4, and so on. This means that there are a total of 220 screens in the game. Each screen is played against a time limit, and losing a level (either by running out of time, or by making a poor move and leaving an impossible position) loses one of your three lives.</p>"}]