[{"name":"Special Criminal Investigation (J)","year":1991,"developer":"Taito Corporation","url":"g#S/S.C.I.%20-%20Special%20Criminal%20Investigation%20%28JP%29.pce","filesize":524288,"score":6.9,"genres":"Action > Racing / Driving > Behind view > Shooter > Automobile > Crime","desc":"<p>Three girls have been reported missing including the mayor's daughter, and Chase Special Investigations has asked you to track down five vehicles, mentioned in the mission briefing, who are believed to be involved in the kidnapping. Using a heavy-designed machine with a V6 DOHC 3000CC Twin Turbo Engine, five sets of nitro-fuel boosts, and a gun attached to the steering wheel (which you can use to damage the target vehicle), your mission is to patrol the streets and find these vehicles.</p><p>The gameplay is similar to Chase H.Q., but there are a few differences. For example, cars travel in both directions instead of one, and some of them will catch up to your car and shoot at you. At least once in every stage a helicopter does a fly by and drops you some grenades you can use to further damage the target vehicle. A guy on a motorcycle will catch up to you and throw grenades at your car. And, most importantly, as mentioned earlier, you can shoot at the target vehicle rather than just bumping into it.</p><p>Have fun driving around, but remember, there is a strict time limit, so I wouldn't waste time or keep crashing into things if I were you.</p>"},{"name":"Sadakichi Sebun: Hideyoshi no Ougon","year":1988,"developer":"Sofix Corporation"},{"name":"Saint Dragon","year":1990,"developer":"NMK Co. Ltd."},{"name":"Samurai-Ghost","year":1992,"developer":"Namco Limited","url":"f#Samurai-Ghost%20%28USA%29.zip","filesize":391971,"score":5.1,"genres":"Action > Side view > Arcade > Fantasy","desc":"<p><em>Samurai-Ghost</em> is the sequel to the Japan-only Genpei Tōma Den. You start the game as the undead ronin Kagekiyo, who sets out on a quest for revenge to defeat the demons and mystical monsters that haunt the Japanese countryside.</p><p>The game is an action side-scroller, in which you control Kagekiyo as he scrolls through several stages slashing all the enemies that cross his path. Your ghostly nature also grants you energy-based attacks and several supernatural abilities which are mostly used to take you to surreal stages in which you can levitate and walk on water.</p>"},{"name":"Sengoku Mahjong","year":1988,"developer":"Hudson Soft Company, Ltd."},{"name":"Shanghai","year":1987,"developer":"Activision, Inc.","url":"g#S/Shanghai%20%28English%20Translated%2C%20Rev%200.99%29.pce","filesize":131072,"score":8,"genres":"Puzzle > Top-down > Fixed / flip-screen > Cards / tiles > Tile matching puzzle","desc":"<p><em>Shanghai</em> is one of the first video game adaptations of the tile-based game played with the Chinese mahjong stones - essentially a puzzle game that has little to do with real mahjong rules.</p><p>The gameplay involves 144 tiles, each depicting different images, which have to be removed by matching them into pairs. The tiles are arranged in a gridded pattern, which is higher near the centre. A tile can only be removed if it has no tile next to it on at least one side.</p><p>This computer implementation can generate a random board layout to take on and features five preset challenges, some of which have time limits of five or ten minutes, as well as a multiplayer mode.</p>"},{"name":"Shinobi (J)","year":1989,"developer":"Team Shinobi","url":"g#S/Shinobi%20%28JP%29.pce","filesize":393216,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control > Fantasy","desc":"<p>You control a shinobi, Joe Musashi, who must battle his way through each level in search of hostages which must be rescued. You have shurikens, kicks and punches to defend yourself with, as well as powerful ninja magic which can clear the screen of enemies in one go.</p><p>Each level is broken down into smaller scenes, and hostages are guarded by big blokes who throw swords. Watch out for gun-toting enemy henchmen and ninjas.</p><p>Reaching the end of each level will find you battling it out with a boss. These range from 8ft tall giants to helicopter gunships.</p>"},{"name":"Shiryou Sensen: War of the Dead","year":1989,"developer":"Fun Project, Inc.","url":"g#S/Shiryou%20Sensen%20-%20War%20of%20the%20Dead%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":278528,"score":"","genres":"Action > Role-playing (RPG) > Diagonal-down > Side view > Anime / Manga > Shooter > Post-apocalyptic","desc":"<p>This version of <em>Shiryō Sensen: War of the Dead</em> can be described as a cross between the MSX and the PC-88 releases. </p><p>Similarly to the original MSX release, guns require ammunition, battles have backgrounds, several enemies may attack at once, and it is possible to leave the side-scrolling battle area (which became larger in this release) by walking to its edge. However, map layout and locations are almost identical with those of the PC-88 version, hence being completely different from those of the MSX release.</p><p>The most significant change - which is unique to this version - is the addition of a RPG system. Whereas in the two other versions the battles didn't serve any other purpose but challenge the player and impede the progress of the story, in the PC Engine (TurboGrafx-16) release they are essential to Laila's character growth. Like in most RPGs, Laila can now gain levels, which enhance her parameters and make her stronger in combat. When defeated, enemies leave orbs of various colors and chests; these serve to heal Laila, grant her experience points, \"mind points\" (to replenish her psychic abilities), or ammunition for the firearms.</p>"},{"name":"Shockman","year":1991,"developer":"Winds Co., Ltd.","url":"f#Shockman%20%28USA%29.zip","filesize":290709,"score":5.8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Platform > Sci-fi / futuristic","desc":"<p>In the sequel to Kaizō Chōjin Shubibinman once again the player takes the role of either cyborg Tasuke or Kyapiko (renamed Arnold and Sonya for their US debut) to face an alien threat to the world.</p><p>Both cyborgs have traded their energy blades for ranged attacks, which change the pacing of the game a bit but nevertheless remains an action-oriented side-scrolling platformer in which your objective is to clear the stage of all enemies and bosses, while picking up any power-ups that can aid you in your quest. The game makes a linear progression from stage to stage, losing the world map from the original as well as the upgrade buying between levels (since \"Doc\" the inventor of both cyborgs and provider of upgrades has been abducted by the aliens), although new shooter stages have been included to spice things up.</p>"},{"name":"Side Arms Hyper Dyne","year":1989,"developer":"Capcom Co., Ltd.","url":"f#SideArms%20-%20Hyper%20Dyne%20%28USA%29.zip","filesize":165855,"score":6.7,"genres":"Action > Side view > Shooter > Sci-fi / futuristic","desc":"<p>Originating in the arcades, <em>Side Arms</em> is a horizontally scrolling shoot ‘em up in which you control Lieutenant Henry (a second player can control Sergeant Sanders in some versions), armed with crude weaponry and protective jump-suits. They must save the earth from the mercenary invaders of Bozon. You must first reach Bozon’s territories, then wipe out its forces hidden in caverns and lurking in underground seas, before destroying the main invasion ship. Lots of extra weapons can be picked up, often with similar tokens to those in 1943 and some other Capcom titles. Most weapons can be shot either to the left or the right, giving you more range to launch attacks.</p>"},{"name":"Silent Debuggers","year":1991,"developer":"Data East Corporation","url":"f#Silent%20Debuggers%20%28USA%29.zip","filesize":256459,"score":5.5,"genres":"Action > 1st-person > Anime / Manga > Survival horror > Sci-fi / futuristic","desc":"<p>Arriving at a desolate cargo station searching for treasure, a debugger and his buddy Leon encounter monsters instead.</p><p><em>Silent Debuggers</em> is an action game with a first-person perspective. The game advances in real-time but movement progresses in fixed steps like in many first-person dungeon games. Enemies are targeted with a crosshair that can be moved around the screen.</p><p>Fight monsters with a variety of weapons and protect the valuable utility rooms around the center of the station from being cut-off by monsters as you advance through each level of the station. Tools provided by Leon give the player special abilities.</p>"},{"name":"Sindibad: Chitei no Daimakyū","year":1990,"developer":"IGS Corp."},{"name":"Sinistron","year":1990,"developer":"AlfaSystem Co., Ltd.","url":"f#Sinistron%20%28USA%29.zip","filesize":169667,"score":7.2,"genres":"Action > Side view > Shooter > Sci-fi / futuristic","desc":"<p><em>Sinistron</em> is a side scrolling shooter similar to R-Type, but has a unique weapons system in which you can open and close your shields to improve your fire power at the expense of making your ship vulnerable. There are also several different powerups you can pick up such as missiles and different types of lasers.</p><p>The plot in the game is not real clear according to the instruction booklet. Apparently something called a \"Sinistron\" has invaded your quadrant of the galaxy and you have to blow it up, just because.</p><p>This game has large enemy sprites and large boss characters. The levels take place mostly in outer space and alien environments. Some of the sprites are Macross-like mechs.</p><p>The Japanese version, \"Violent Soldier\", had slightly different graphics.</p>"},{"name":"Skweek (J)","year":1991,"developer":"Loriciel SA","url":"g#S/Skweek%20%28JP%29.pce","filesize":262144,"score":7.5,"genres":"Action > Puzzle > Top-down > Direct control","desc":"<p>The Skweeks lived in harmony for centuries, being a naturally peaceful peoples, until Pitark arrived. He ruined their bright pink land by removing the colour, and it was only after he died that they had the opportunity to clean the land up. Your job is to travel through the 99 continents and clean each one in sequence.</p><p>Skweek can move in each of the four compass directions, and is armed with a simple weapon, whose shots rebound around before they hit one of Pitark's minions, the Schnoreuls - contact with which is instantly fatal. Some squares contain arrows which force you in a particular direction, while there are also blockades to avoid. Bomb squares blow up surrounding squares but give you time to move away from them as they do this, while Shortcut squares allow you to move to another teleport-type square by pushing the joystick in its direction.</p>"},{"name":"Soldier Blade","year":1992,"developer":"Hudson Soft Company, Ltd.","url":"f#Soldier%20Blade%20%28USA%29.zip","filesize":394653,"score":7.8,"genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>A top down sci-fi shooter in which you take to the skies of several planets in an advanced starfighter in order to eradicate an alien invasion.</p><p><em>Soldier Blade</em> puts you in direct control of a starfighter as you make your way through each enemy-infested stage. You are not alone in the fight this time however, as a small mecha follows your fighter at all times, and provides cover and supporting firepower at regular intervals.</p><p>The game also features a unique weapon system with three customizable gun pods, in which you can mount any of the several types of weapons available. Additionally you can sacrifice each of your pods to incorporate \"option\" satellites, bombs and other super moves depending on the pod/weapon combination you have equipped.</p>"},{"name":"Solitaire Poker","year":1990,"developer":"Success Corp."},{"name":"Somer Assault","year":1991,"developer":"Atlus Co., Ltd.","url":"f#Somer%20Assault%20%28USA%29.zip","filesize":272695,"score":6.5,"genres":"Action > Side view","desc":"<p><em>Somer Assault</em> is a difficult to describe game. In it you control a pink slinky character with guns attached to it. You move around mazes, climbing on walls, on the ceiling, through shortcuts, and attempt to find your way to the end. Along the way, you have to shoot out many, many enemies. And at the end, you will find a nasty boss surprise.</p><p>The story is bizarre, which fits the concept of the game. A sorceress has plans to rule the world. To do so, she has summoned 12 beasts, each based on a sign of the zodiac. It's up to you, pink slinky, to defeat the 12 astrological signs.</p>"},{"name":"Son Son II","year":1989,"developer":"Capcom Co., Ltd.","url":"g#S/Son%20Son%20II%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":262144,"score":7.6,"genres":"Action > Side view > Platform","desc":"<p>In this platformer, loosely based on the classic Chinese novel Xi You Ji, players take control of Son Goku who has to rescue his friends from a mysterious villain. In seven levels, Son Goku has to survive various jumping puzzles, fight off enemies with his staff and collect money in form of fruit. Along the way, he can pick up various helpful items that can either be bought in stores or found hidden within the levels. They include: Medicine that refills Son Goku's health, a magic lamp that allows him to continue after losing a life, keys that open doors, a glove that breaks certain walls and a cloud that Son Goku can use to fly during boss-battles. Additionally, Son Goku can buy longer and more powerful staffs if he finds somebody who sells them.</p>"},{"name":"Sonic Spike","year":1990,"developer":"Information Global Service","url":"f#Sonic%20Spike%20-%20World%20Championship%20Beach%20Volleyball%20%28USA%29.zip","filesize":110950,"score":6.1,"genres":"Sports > 3rd-person (Other) > Volleyball","desc":"<p><em>Sonic Spike</em> is a beach volleyball game. The player takes the role of a volleyball team with two athletes (which have different strengths and disadvantages) and tries to win a tournament. The second athlete can also be played by a second human player. The controls offer no surprises: players move an athlete over the field and use two buttons for jumping and hitting. Single players also have to switch between the two athletes.</p><p>However, each athlete has a n energy value which decreases over the course of a match. By using a water bottle the energy gets filled up again, but there is only a limited amount available. When using the training mode instead of the tournament, players can choose between one of three fields and an easy mode which is basically a slow motion mode.</p>"},{"name":"Space Harrier","year":1988,"developer":"AM R&D Dept. #2","url":"f#Space%20Harrier%20%28USA%29.zip","filesize":212341,"score":7.1,"genres":"Action > Behind view > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>Run… fly… dodge those obstacles, but return fire on wave after wave of attacking aliens. Armed with a really big gun, you have to defend yourself against the alien hordes using your wits to navigate around the screen. But watch out for those end of level bosses!</p><p>Originating in the arcades, <em>Space Harrier</em> is a third-person rail shooter with pseudo-3D graphics, set in the same world as Fantasy Zone. The lone titular hero fights aliens with a fireball-launching cannon, which can also be used to transform the hero into a flying rocket. The protagonist is constantly in motion, but the speed of his movement can be regulated by the player.</p>"},{"name":"Space Invaders: Fukkatsu no Hi (J)","year":1990,"developer":"Taito Corporation","url":"g#S/Space%20Invaders%20-%20Fukkatsu%20no%20Hi%20%28JP%29.pce","filesize":262144,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The Invaders are back and tougher than ever! <em>Space Invaders: Fukkatsu no Hi</em> (Day of Resurrection) is an update of the iconic game from Taito. The game features updated graphics and nearly a dozen different weapon types, as well as a much wider variety of enemy Invaders to shoot down.</p><p>Also included is a conversion of the original 1978 coin-op.</p>"},{"name":"Splatterhouse","year":1990,"developer":"Namco Limited","url":"f#Splatterhouse%20%28USA%29.zip","filesize":268175,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Direct control > Horror","desc":"<p><em>Splatterhouse</em> is the first game in the series, but only the second game to appear on a home console (after Splatterhouse: Wanpaku Graffiti on the NES), which was later continued on the SEGA Genesis.</p><p>Rick and his girlfriend Jennifer enter West Mansion (known as Splatterhouse) to study Dr. West's parapsychology teachings for a school project. After a flash of lightning and a scream, Jennifer is gone, and Rick is left wearing the Terror Mask, which gives the wearer great strength.</p><p>Rick must survive seven blood-soaked levels full of corpses, demons, and other disturbing creatures in this arcade side-scrolling beat-em-up. Several weapons are at Rick's disposal throughout the house, such as a meat cleaver, a two by four, and a shotgun. If Rick wants to find Jennifer alive, he must move quickly through the floors of the mansion.... as a happy reunion is not always guaranteed.</p>"},{"name":"Stratego","year":1992,"developer":""},{"name":"Street Fighter II: Champion Edition","year":1993,"developer":"Capcom Co., Ltd.","url":"g#S/Street%20Fighter%20II%27%20-%20Champion%20Edition%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":2621440,"score":8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Martial arts","desc":"<p>This version of Street Fighter II is similar in most aspects to the original, save that all 12 characters are selectable from the get-go (the boss characters were originally locked), and the game engine has been revamped.</p>"},{"name":"Strip Fighter II (J)","year":1993,"developer":"Games Express","url":"g#S/Strip%20Fighter%20II%20%28JP%29.pce","filesize":1048576,"score":"","genres":"Action > Side view > Arcade > Fighting > Adult","desc":"<p><em>Strip Fighter II</em> is similar to Street Fighter II, but has a distinguishing feature: in this fighting game all the participants are attractive women. Players can choose one of six female characters. The player-controlled character must use her fighting and combat strengths to defeat the other five girls and a palette-swap of herself. </p><p>The game has some fairly explicit content: during some moves the fighters would take their clothes off; after each fight the player is presented with a picture of female stripper.</p>"},{"name":"Super Dodge Ball","year":1990,"developer":"Technos Japan Corp."},{"name":"Super Momotarō Dentetsu II","year":1991,"developer":"Hudson Soft Company, Ltd."},{"name":"Super Soccer","year":1990,"developer":"Human Entertainment, Inc."},{"name":"Super Star Soldier","year":1990,"developer":"Inter State Co., Ltd.","url":"f#Super%20Star%20Soldier%20%28USA%29.zip","filesize":283674,"score":7.6,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Super Star Soldier</em> takes place in the far future, where you are the last hope for planet Earth, which is being attacked by an alien race.</p><p>The game features top-down view with vertical scrolling levels, similar to its predecessor Star Soldier. The game features the following game play modes: normal play, score play, 2 minutes play and 5 minutes play.Each level has its own tough boss at the end.</p>"},{"name":"Super Volleyball","year":1990,"developer":"Video System Co., Ltd.","url":"f#Super%20Volleyball%20%28USA%29.zip","filesize":100336,"score":6.3,"genres":"Sports > Side view > 2D scrolling > Volleyball","desc":"<p><em>SUPER Volley ball</em> is an indoor volleyball game for one or two players. The single player mode offers two game options: normal game and World League. Choosing normal game pits the player against the computer in a single game. Choosing World League pits the player against all other teams available. A password save is available in this mode.</p><p>The game features eight national teams (USA, USSR, Brazil, Holland, France, Italy, Japan and China), with fictitiously named players. Players can be changed during gameplay by pressing C. There is also an option to create new teams, choosing the team's name, color, player's position and names.</p><p>Gameplay is viewed from a side scrolling perspective, with the camera fixed on the ball. A small radar on the top of the screen shows the players' positions of both teams. Players can bump, set, spike, dump, block and dig. A collection of serves is also available: underhand, overhand and jump serve. There are also options for three ball speeds, beginning points (from 0 to 10, out of 15) and handicap.</p>"},{"name":"Susanoō Densetsu","year":1989,"developer":"Hudson Soft Company, Ltd."}]