[{"name":"W Ring (J)","year":1990,"developer":"Flight-Plan Inc.","url":"g#W/W-Ring%20-%20The%20Double%20Rings%20%28JP%29.pce","filesize":393216,"score":6.8,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p><em>W Ring</em> is a horizontally scrolling shooter in which the player sits in a space ship and shoots a lot of enemies, preferably without being hit by their deadly shots or touch. There are six levels which also scroll slightly up and down and end with a big end boss. Some of those levels are a bit gimmicky, e.g. one level has a lot of water movement in the background which makes it harder to keep an overview and level five is a fast scrolling maze system in which the player needs to take the correct paths to avoid dead ends (and therefore certain death). </p><p>Of course there are also power ups to collect: depending on their colour, they stand for a different weapon system (overall five) like lasers or rings which circle around the ship and make it harder to crush against the environment. Collecting multiple symbols of the same colour upgrades the current weapon up to two times. The game features three difficulty levels and a rapid fire option.</p>"},{"name":"Wallaby!! Usagi no Kuni no Kangaroo Race","year":1990,"developer":"TENKY Co. Ltd."},{"name":"Winning Shot (J)","year":1989,"developer":"Data East Corporation","url":"g#W/Winning%20Shot%20%28JP%29.pce","filesize":262144,"score":"","genres":"Sports > 3rd-person (Other) > Top-down > Golf","desc":"<p><em>Winning Shot</em> is a golf game which is completely played from a top-down perspective. The hitting mechanics are based on a menu in which the player can set the used club (out of 14), the hitting strength and the location where the ball is hit. The courses feature many obstacles which should be avoided and wind which should be calculated in. Besides the single-player mode in which the player participates in tournaments there are also two multiplayer modes: one for two players and another one for up to four players. The basic goal for both is to have the lowest amount of hits after 18 holes, but in the second mode there are penalty points assigned for every hit above the hole's limit.</p>"},{"name":"Wonder Boy in Monster Land","year":1987,"developer":"Escape"},{"name":"Wonder Momo","year":1989,"developer":"Namco Limited","url":"g#W/Wonder%20Momo%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":524288,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Sci-fi / futuristic","desc":"<p>In <em>Wonder Momo</em> you play as Momo, an actress playing the lead role in a kid's show about a crime-fighting heroine that puts the hurt on several alien monsters and assorted criminals.</p><p>Set in the stage of the \"Namco Theater\", the game plays as an action side-scroller in which you progress across each stage kicking the snot out of all the enemies you run across. By collecting the right power-up you can transform into Wonder Momo for a limited time, who can perform ranged attacks with a hoola-hoop and is more powerful than regular Momo.</p><p>Not only must you clear the enemies of each stage, but also please the crowd with your performances, being wary of perverts that attempt to take pictures of your underwear whenever you attack (Momo shows quite a bit of leg whenever she \"kicks high\") which results in blinding flashes that stun Momo and leave her open to an attack.</p>"},{"name":"World Class Baseball","year":1988,"developer":"Hudson Soft Company, Ltd.","url":"f#World%20Class%20Baseball%20%28USA%29.zip","filesize":122826,"score":6.7,"genres":"Sports > Baseball","desc":"<p><em>World Class Baseball</em> is a baseball game. The player controls the pitcher and fielders (through an automatic systemthat, following baseball games' tradition, gives to him control on the one of the players who is closest to the ball); not the batter. One or two little windows display the runner's status during the face-off between the batter and the pitcher; once the ball is hit the view changes to a bird's eye one, showing a good portion of the game field where the action is taking place, together with a permanent small field's image at the right bottom of the screen displaying the position of every player on the whole field.</p><p>This game comprises an arcade mode (namely «Pennant mode») in which the player is tasked with straightly defeating one by one all opponent teams; a two-player mode (Versus mode) where two players just play versus each other in a single game, the «Open mode» to challenge the computer in a single match and a computer-only mode (Watch mode), seeing a challenge between two teams both controlled by the CPU. The Edit mode allows the player to change the starting lineup and starting rotation for the team.</p><p>The teams are bracketed in two groups: South Division (consisting of teams from Bangkok, Beijing, Moscow, Paris, Rome, Sidney);North Division (counting teams based in Chicago, Los Angeles, London, New York, Tokyo, Toronto). No official licensed baseball teams are there.</p>"},{"name":"World Court Tennis","year":1988,"developer":"Namcot","url":"f#World%20Court%20Tennis%20%28USA%29.zip","filesize":99851,"score":7.9,"genres":"Sports > Behind view > Fixed / flip-screen > Direct control > Tennis","desc":"<p><em>World Court Tennis</em> is a tennis game with a twist. The action itself features no big surprises: the players control their characters over the scrolling tennis field and try to counter balls from their opponents. It is possible to perform typical tennis actions like cross, smash or lob and the hit performance depends on the timing.</p><p>However, the unique feature of this game is a story mode which takes various elements from Japanese role-playing games. The story involves an evil king who banned all tennis matches outside of membership courts. The player goes out to overthrow the king so tennis can be brought back to everyone. So the player explores a top-down world map reminiscent of Dragon Warrior, explores the surrounding and fights enemies. Those fights are either random encounters or scripted boss battles and play out as regular tennis matches.</p><p>The overall goal is to find all membership courts and defeat the inhabitants. Because of this, the game does not end when defeated; the player gets dragged to the king and has to pay a penalty fee. Money is the only resource and is earned by defeating enemies. It is used to buy updated equipment: shoes improve speed, rackets improve power and shirts help to evade random encounters. The game is no RPG, however, because there is no actual character development.</p>"},{"name":"World Jockey (J)","year":1991,"developer":"Namco Limited","url":"g#W/World%20Jockey%20%28JP%29.pce","filesize":262144,"score":"","genres":"Gambling > Sports > Diagonal-down > Side view > Real-time > Horse / derby","desc":"<p><em>World Jockey</em> is a horse racing game. You can choose between a one-player or a multiplayer game mode (simultaneous). This mode also features a Family Game sub-mode, that allows up to four family members to race and bet. The commands are quite simple, press I to use your whip, or press II to jump over obstacles. Power-ups can be collected to increase stamina, speed, but there are also power-downs.</p>"},{"name":"World Sports Competition","year":1992,"developer":"Hudson Soft Company, Ltd.","url":"f#World%20Sports%20Competition%20%28USA%29.zip","filesize":308603,"score":6.5,"genres":"Sports > Side view > 2D scrolling > Olympiad / mixed sports","desc":"<p><em>World Sports Competition</em> is a Summer Olympics title, originally released on the PC Engine (TurboGrafx-16).</p><p>Events include:* Archery</p><ul><li>Field - Broad Jump, Triple Jump, High Jump, Discus Throw, Hammer Throw &amp; Javelin Throw</li><li>Rowing</li><li>Shooting - Clay pigeon &amp; pistol target shooting.</li><li>Swimming - Back Stroke, Breast Stroke, Butterfly, Free Style &amp; Individual Medley.</li><li>Track - 100 Meter Dash, 110 Meter Hurdles &amp; 400 Meter Dash.</li></ul>"}]