[{"name":"Yo, Bro","year":1991,"developer":"ICOM Simulations, Inc.","url":"f#Yo%2C%20Bro%20%28USA%29.zip","filesize":251556,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>Yo, Bro</em> is a skateboarding action game that takes place in California. Professor Liverhosen has unleashed a plethora of nasty surprises on the poor kids in 6 California cities. It is up to you, Little Bro, to stop the evil crimes against nature. You will have your trusty slingshot at your disposal, as well as whatever freeze rays and rocket-propelled grenades you may find laying in the street.</p><p>Between levels you are given the chance to rack up serious points in shooter style bonus rounds.</p><p>The tunes in this game are synthesized arrangements of 4 popular songs by the Beach Boys.</p>"},{"name":"Youkai Douchuuki","year":1988,"developer":"Namco Limited","url":"g#Y/Youkai%20Douchuuki%20%28English%20Translated%2C%20Rev%201%29.pce","filesize":270336,"score":"","genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Tarosuke has died and now must cross the purgatory as depicted in Buddhist lore, fighting enemies and advancing in his path towards ultimate redemption. Depending on just how well he behaves in this afterlife you can see up to 5 different endings, which involve everything from re-incarnation to eternal damnation in hell.</p><p><em>Yōkai Dōchūki</em> plays as a side-scrolling action platformer, in which you control Tarosuke as he jumps around the game world, avoiding pitfalls and other traps. Enemies can be defeated by the use of a ki-based projectile attack and, once defeated, monsters leave behind money which can be exchanged in-game for health and other unique power-ups. Bosses are based on several Buddhist tales; being much too powerful for Tarosuke, he must invoke his guardian spirit to defeat such demons, which involves finding a shrine and praying until it is summoned.</p>"},{"name":"Yū Yū Jinsei","year":1988,"developer":"Hudson Soft Company, Ltd."}]