[{"name":"3D Baseball","year":1996,"developer":"Crystal Dynamics, Inc.","url":"e#3D%20Baseball%20%28USA%29.zip","filesize":151802543,"score":7,"genres":"Sports > Behind view > Baseball > Licensed","desc":"<p><em>3D Baseball</em> is a 3-D polygon baseball game with over 700 actual Major League players and their previous years stats to choose from. There are over 50 real-life batter stances that were motion-captured through the actual players themselves with five different dynamic camera angles to choose.</p><p>The standard modes apply such as <em>Exhibition</em> and <em>Pennant</em> along with a <em>General Managers Mode</em> where players can trade and even alter the stats of their players to create the ultimate team. It feature realistic animation and the voice talents of Van Earl Wright with over 1,000 different commentary phrases.</p><p>Though it did feature the MLBPA (Major League Baseball Players Association) license, it did not however feature the actual MLB (Major League Baseball) team names and logos.</p>"},{"name":"3D Lemmings","year":1996,"developer":"Clockwork Games Limited","url":"e#3D%20Lemmings%20%28Europe%29.zip","filesize":404829133,"score":7.3,"genres":"Puzzle > Free-roaming camera > Real-time > Point and select","desc":"<p>You, as in all other Lemmings games, are responsible for leading hordes of lemmings to safety through hazardous environments. However, this installment goes just that little bit further by introducing the lemmings to 80 new 3-dimensional levels!</p>"},{"name":"3x3 Eyes - Kyuusei Koushu S (Japan) (Disc 1)","year":1996,"developer":"Nihon Create","url":"e#3x3%20Eyes%20-%20Kyuusei%20Koushu%20S%20%28Japan%29%20%28Disc%201%29.zip","filesize":356085145,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Licensed","desc":"<p><em>3x3 Eyes: Kyūsei Kōshu S</em> is an enhanced version of 3x3 Eyes: Kyūsei Kōshu. It includes new animated sequences, new voice recording, graphical enhancements, and an extra \"Making Of\" CD.</p>"},{"name":"3x3 Eyes - Kyuusei Koushu S (Japan) (Disc 2)","year":1996,"developer":"Nihon Create","url":"e#3x3%20Eyes%20-%20Kyuusei%20Koushu%20S%20%28Japan%29%20%28Disc%202%29.zip","filesize":247779054,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Licensed","desc":"<p><em>3x3 Eyes: Kyūsei Kōshu S</em> is an enhanced version of 3x3 Eyes: Kyūsei Kōshu. It includes new animated sequences, new voice recording, graphical enhancements, and an extra \"Making Of\" CD.</p>"},{"name":"3x3 Eyes - Kyuusei Koushu S (Japan) (Disc 3)","year":1996,"developer":"Nihon Create","url":"e#3x3%20Eyes%20-%20Kyuusei%20Koushu%20S%20%28Japan%29%20%28Disc%203%29%20%28Special%20CD-ROM%29.zip","filesize":557269405,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Licensed","desc":"<p><em>3x3 Eyes: Kyūsei Kōshu S</em> is an enhanced version of 3x3 Eyes: Kyūsei Kōshu. It includes new animated sequences, new voice recording, graphical enhancements, and an extra \"Making Of\" CD.</p>"},{"name":"6 Inch My Darling (Japan)","year":1998,"developer":"KID Corp.","url":"e#6%20Inch%20My%20Darling%20%28Japan%29.zip","filesize":289877214,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Fantasy > Romance","desc":"<p><em>6inch My Darling</em> is a visual novel romance adventure originally released by KID for Sega Saturn with free for all rating, thus not including adult content. Half a year later, the game was released on PC platform by Airyu with added adult content and altered setting and story elements.</p><p>The story follows a high-school student, named by the player, who lives with his parents and a younger sister. During his time off of school he is helping his mom by part-time working at the liquor store. One day, upon returning from school, he stumbled on a buried box while taking a path through the woods. Inside was a strangely shaped figuring with a message on the inside of the box lid. Not sure what it all was about, he left it on the desk and went to sleep. The next day, he heard a voice in his room, and while trying to determine the source of the voice he stumbled upon a small girl by the name of Etosera. And by small, it means 6 inches in size. But she wasn't the only one that appeared due to the mysterious box, two more girls, Minty and Pim, just as well, also became his secret roommates. Thus his next couple of weeks filled with surprises and getting to know each other commence, all the way while they are trying to build trust and assess the relationship with humans, namely, the player.</p>"}]