[{"name":"Actua Soccer: Club Edition","year":1997,"developer":"Gremlin Interactive Limited","url":"e#Actua%20Soccer%20-%20Club%20Edition%20%28Europe%29.zip","filesize":111644643,"score":6,"genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p><em>Actua Soccer Club Edition</em> is a re-edition of Actua Soccer, released with the 20 teams of the English Premiership instead of international competitions. New commentary was recorded and some Premiership historical data was included. All remaining aspects of the game were unchanged or just tweaked.</p><p>The rest of the game is well known to fans of the genre - it was the first fully polygonal football game on the market, which allowed an unprecedented graphical realism and (technically) unlimited camera angles.</p>"},{"name":"Advanced V.G.","year":1997,"developer":"Technical Group Laboratory, Inc.","url":"e#Advanced%20V.G.%20%28Japan%29.zip","filesize":314739786,"score":"","genres":"Action > Side view > Anime / Manga > Fighting","desc":"<p>The story of <em>Advanced V.G.</em> follows a similar template as those of the previous  Variable Geo games: the strongest young women in the country hold a tournament, which is sponsored by various restaurant chains, which in turn ask the competing girls to pose as waitresses working in said restaurants, for promotional purposes. The girls of the Jahana group who starred in the previous games return, with the new main protagonist being the young martial artist Yuka Takeuchi, who has been training in a secluded forest area before joining the competition. </p><p>Like its predecessors, <em>Advanced V.G.</em> is a fighting game, with the basic \"kick\" and \"punch\" moves, while the various special attacks are executed by pressing combinations of buttons. There are three modes in the game, \"Normal\", \"Vs.\", and \"Story\". The normal mode is basically training matches between the player character and an AI-controlled girl. Vs. mode allows two-player mode, as well as demo \"computer vs. computer\" gameplay, with the possibility to choose any of the stages. Any of the nine heroines is available as a playable character in these modes (Yuka Takeuchi, Chiho Masuda, Jun Kubota, Manami Kusunoki. Kaori Yanase, Reimi Jahana, Satomi Yajima, Ayako Yūki, and Erina Goldsmith). The story mode, on the other hand, allows the player to control Yuka Takeuchi only, and follow her story. Cut scenes advance the story between matches. </p><p>The SNES received a stripped-down version, <em>Super V.G.</em>, without the Story Mode and all explicit hentai elements. Hybrids (pair of bosses in <em>Advanced V.G.</em>) were also removed.</p>"},{"name":"Air Management '96","year":1996,"developer":"KOEI Co., Ltd."},{"name":"Airs Adventure","year":1996,"developer":"GAME STUDIO Inc.","url":"e#Airs%20Adventure%20%28Japan%29.zip","filesize":457163553,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Fantasy","desc":"<p><em>Airs Adventure</em> takes place in an environment reminiscent of 17th century Europe. The game follows the story of an aspiring knight (default name Henry), who is framed for a crime and is about to be executed. However, the beautiful princess of the country feels mercy and stops the execution at the last moment. As the hero tries to uncover the truth about his conviction, fate brings the two together, and they begin a journey to discover distant lands in search for adventure, and perhaps even develop feelings for each other...</p><p>The game's combat is a rather simple version of the traditional Japanese-style RPG system. The player controls a party that contains only Henry and the princess. Whenever enemies are encountered, a separate battle screen appears. Commands are executed via a standard menu, allowing physical attacks, defense, as well as offensive and supporting magic spells. Graphically, <em>Airs Adventure</em> combines pre-rendered character sprites with partially polygonal backgrounds, with an over-the-shoulder view.</p>"},{"name":"Albert Odyssey: Legend of Eldean","year":1996,"developer":"Sun Corporation","url":"e#Albert%20Odyssey%20-%20Legend%20of%20Eldean%20%28USA%29.zip","filesize":551639654,"score":7.6,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>The Legend of Eldean tells of a trio of powerful magic-wielding siblings from the ancient kingdom of Fargasta: Radoria, Estan and their sister Cirrus. As they and their powers grew, the Black Dragon Vlag, hungry to devour this power and make it his own, began a campaign of assault against the siblings and their kingdom. Together, the Eldean clan was able to defeat Vlag, and with the killing strike were showered in his vile blood and imbibed with immortality. Fargasta ascended into a prosperous age under the leadership of their fabled heroes, but this period of revelry was soon cut short as Radoria began to descend into a madness that stemmed from his claiming of the foul sword Madriker, crafted from the soul of the vanquished Black Dragon. As his madness, and power, grew, he claimed the title of \"Immortal Emperor\" and set about imposing his will upon the lands, destroying all that was pure and crushing any who opposed him and his fiend-sword Madriker. The black tide that had swallowed his soul soon threatened to swallow everything. In a final act of desperation, Cirrus called upon the one power she had hidden from her brothers and transformed herself into the Holy Sword of Eldean, equipping to Estan and allowing him to cast a mighty blow towards Radoria, causing a blast that sent tremors throughout the lands entire. As the dust settled on the battleground, there was to be no trace of any of the Eldean clan; all had vanished, and all the people believed the Legend of Eldean had come to its tragic conclusion.</p><p>Generations of relative peace passed following the fateful battle between the Eldean siblings, but with time the ancient truces that united the land during Radoria's scourge began to unravel. War and unrest began to take root, new agents of evil began to take power and the violence spread out to all corners of the world. Pike, a young boy whose parents were murdered at the outset of this new unrest, while he was still just an infant, awakes one morning in his home in the Harpy Village, where he was taken by Laia, the harpy that found him after his parents' demise. The Harpy Village had managed to remain isolated from the troubles brewing elsewhere until this morning, when it is attacked by a dark, dragon-mounted warrior named Belnard on a ruinous quest to collect all the Power Crystals in the land, one of which is housed in the Harpy Village. During the attack, Laia is petrified by Belnard, forcing Pike to gather his courage and venture forth from the Village. Armed with his father's old magical, talking sword, Cirrus, Pike sets out on a quest to save Laia and all that he holds dear; soon taking up allies that join him on his quest to stop the evil Belnard and the dark forces he works for from conquering the world.</p><p>Players assume the role of Pike as he travels the land, gaining 4 comrades to help in his quest, fighting menu-driven battles and exploring towns and dungeons. The player controls their inventory and party by use of items and magic, equipping of weapons and armor and monitoring the status of party characters. While traveling from town to town or exploring dungeons, the player will be engaged in random encounters by enemies unseen on the screen or overworld. Each character's agility skill determines the order of turns during combat. Battles reach their conclusion when either all of the enemies or all of Pike's party have been depleted of their hit points. Winning a battle nets the player experience points, gold and occasionally an item. Running from a battle is also an option, though this results in nothing gained. If all of the player's party is slain during the battle, the game will be over. The player will come across shops selling items and equipment in each town they come across, at which the player can use gold earned from winning battles or selling outdated equipment to purchase new wares. Magic and skills play a large role in battles, with characters calling upon their stores of MP to utilize them in lieu of standard attacks during battle.</p><p>Albert Odyssey: Legend of Eldean is a standard Japanese-style Turn-Based RPG. Though released on the 32-bit Sega Saturn, it is visually reminiscent of other classic top-down 16-bit SNES RPGs. The extra graphical horsepower is used to make things just a bit crisper, clearer and more vibrant than its predecessors. It also utilizes its fifth-generation capabilities in the form of CD-quality audio for the thoroughly composed soundtrack, and the occasional voiceover, most prominently in the opening intro. Players will take their party of 5 characters through several cities and dungeons, traversing to and from each on a minimal overworld map rife with random encounters. Each character gains experience and levels up independently, with stats gained and spells learned automatically with progression. Combat occurs in typical Turn-Based fashion, with options for each character to attack, use magic, use an item, defend or run. Though power-leveling is easy due to the frequent random encounters, it is not greatly needed thanks to the abundance of boss battles and the high amount of experience gained from winning each one. Through the majority of the game, the highest-caliber weapons and armor are bought from the cities' shops, but the most powerful of these items are found in longer, more complex endgame dungeons. The game is split into 2 chapters, the 2nd taking place a few years after the 1st and building upon a plot thread started in it. </p><p>Legend of Eldean is part of the Albert Odyssey series, with 2 previous Japan-only releases on SNES, although there is no continuation of storyline established in the first 2 Albert Odyssey's in Legend of Eldean, save for a few reference to Albert, the main character of the original, and some of his exploits. Legend of Eldean also differs from the previous entries through its Turn-Based combat, where the first 2 employed a Tactical style. It is not fully known to what extent the translation team at Working Designs stuck to the original Japanese script. Their conversion brings with it many pop-culture references (some timeless, some definitely rooted in the time of release), 4th wall-breaking allusions and humorous punchlines and non-sequiturs; mostly through the brief interactions the player can engage in with NPC townsfolk, but even interjected into the more plot-crucial conversations and events taking place with the fairly large cast of important characters involved, breaking mold with what would have been an otherwise standard fantasy-fare storyline and setting.</p>"},{"name":"Album Club (Mune Kyun): Saint Paulia Jogakuin","year":1997,"developer":"SEGA Enterprises Ltd.","url":"e#Album%20Club%20%28Mune%20Kyun%29%20-%20Saint%20Paulia%20Jogakuin%20%28Japan%29.zip","filesize":445950961,"score":"","genres":"Adventure > 3rd-person (Other) > Fixed / flip-screen > Anime / Manga > Mini-games > Direct control > Japan (Modern/Futuristic) > Sci-fi / futuristic","desc":"<p><em>Album Club: Mune Kyun Saint Paulia Jogakuin</em> is a game set in Japan that tells the story of a young schoolgirl and her robot through several mini-games such as Janken as she progresses through her daily activities, while the robot takes pictures of students for the school album. Cut-scenes take the form of anime and live-action.</p>"},{"name":"Alien Trilogy","year":1996,"developer":"Probe Entertainment Ltd.","url":"e#Alien%20Trilogy%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":460138974,"score":7.3,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic > Licensed > Regional differences","desc":"<p><em>Alien Trilogy</em> is a first-person shooter based on the first three <em>Alien</em> movies. You control Lt. Ripley in three sections, each based on one film: The colony complex on LV426 (from <em>Aliens</em>), the prison planet (from <em>Alien³</em>) and the derelict spaceship (from <em>Alien</em>). Each section consists of about 10 missions. In every mission, certain goals must be accomplished to continue. These include killing a certain number of enemies, finding items or activating switches.</p><p>Enemies include everything the alien life cycle provides: facehuggers, chestbursters, warrior aliens, dog aliens (from <em>Alien³</em>) and alien queens, one of which waits in the final mission of every section. In addition to the Aliens, you also have to fight employees of the Company, who have either been infected by the aliens and are beyond saving or who actively want to obstruct your mission.</p><p>Weapons to be used include pistol, shotgun, pulse rifle, flame thrower and smart gun. Ammunition, health upgrades and other useful items are scattered throughout the levels. Hidden areas may be uncovered by using explosives like grenades and seismic charges. An auto mapping system helps in not getting lost, night goggles and shoulder lamps (running on battery power) allow you to see in the dark and the motion tracker tells you where your enemies are - but only if they are moving.</p>"},{"name":"All-Star Baseball '97 featuring Frank Thomas","year":1997,"developer":"Iguana Entertainment Incorporated","url":"e#All-Star%20Baseball%20%2797%20featuring%20Frank%20Thomas%20%28USA%29.zip","filesize":369872702,"score":6,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>This baseball game is the follow up to Frank Thomas Big Hurt Baseball. It features an Exhibition, Season, Playoff, All-Star, Batting Practice, and Home Run Derby modes. It also features all the 28 MLB teams plus the Tampa Bay and Arizona squads, the 2 new expansion teams of that era. The game includes the real players, stats, stadiums, and logos of each team. </p><p>During full season play, the game keeps track of stats in more than 27 different categories. The player can also trade players from their team during the season.</p><p>The play-by-play commentary is from sportscaster Jon Miller.</p>"},{"name":"Alone in the Dark: Jack Is Back","year":1996,"developer":"Infogrames Europe SA","url":"e#Alone%20in%20the%20Dark%20-%20Jack%20Is%20Back%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":147428778,"score":7.3,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Survival horror > Interwar > Detective / mystery > Horror","desc":"<p>In <em>Alone in the Dark 2</em>, you take the role of detective Edward Carnby, one of the two main characters in the original Alone in the Dark. Carnby is now called upon to investigate a bootlegger named One Eyed Jack after an old detective colleague named Stryker attributes Jack to the kidnapping of young Grace Saunders. Stryker attempts to infiltrate Jack's dilapidated mansion of Hell's Kitchen and rescue the girl, only to disappear himself. That's where Carnby comes in.</p><p>Carnby soon learns that Jack and his gangsters are really 15th-century pirates who gained immortality after Jack joined forces with Elizabeth Jarret, a Voodoo witch. However, the dark magic which keeps them immortal also requires Jack and his crew to regularly make human sacrifices (which explains Grace's kidnapping).</p><p>Now Carnby must battle his way through Hell's Kitchen and Jack's army of Tommy-gun-wielding gangsters, searching for a way to break the spell and make them stay dead. </p><p><em>Alone in the Dark 2</em> is an action-adventure game, similar to the original <em>Alone in the Dark</em>. Like its predecessor, the game uses hybrid 2D-3D graphics. Completing the game requires you to solve a lot of puzzles while fighting zombie pirates along the way. Some enemies can be killed with the numerous weapons at your disposal, while others need to be defeated via trickery. </p><p>Apart from Edward Carnby, the game also includes a short section (two sections in the CD-ROM version) where you play as the little Grace Saunders. Grace obviously cannot fight, and thus the sections featuring her are all about fast reflexes and wits to evade and outsmart the enemies.</p>"},{"name":"Amok","year":1997,"developer":"Scavenger, Inc.","url":"e#Amok%20%28USA%29.zip","filesize":524161253,"score":6.8,"genres":"Action > Behind view > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Amok</em> portrays a futuristic storyline on a planet which is identified in the manual as having the same name. There, two gigantic corporations, referred to by the acronyms NONLUN and AZTK, had previously been having an all-out war between them for forty-seven years. The war had involved all possible fronts and theaters, including operations in the air, on the surface of the land and sea, and beneath the water. Very recently, a weak peace accord had only just been reached. In the manual, the peace accord is described as being much like \"a blanket covering the fire that smolders in the hearts of the people. The agreement is sufficiently unsteady that an influential mercenary company, known only as \"the Bureau,\" has now decided to hire a capable battle walker pilot named Gert Staun to restart the war so they can continue to make large amounts of money by taking lucrative contracts from both sides. The player takes the role of Gert Staun.</p><p>Naturally \"the Bureau\" has placed a high priority on this, and they are funding it entirely on their own. Indeed, Gert Staun's battle walker, called the \"Slambird\" is explicitly said to be custom-modified. In particular, the Slambird can not only survive either on land or underwater, but it can transition between the two -- it can move, fight, and safely control its vertical position in either environment. These abilities are portrayed as costly and not standard to such vehicles in the universe where <em>Amok</em> takes place. The transformation of the Slambird between an underwater vehicle and a land vehicle is automatically scripted, however. The player has no power to control this transformation or alter the time when it happens. Instead, the player must get to the point when Staun will automatically bring the Slambird ashore to continue his attacks.</p><p>The object of this arcade-type game is to meet a series of objectives, and to do so in such a way that each side will blame the other. The game has a linear structure, based on levels that present tasks of increasing difficulty, and all sorts of hazards and targets are encountered. These include military bases, power generators, land mines, infantry, tanks, submarines -- even sharks and huge, aggressive birds. Infantry elements are poorly armored, so they can be killed by being run over. In one mission, the only way that the player will be able to get enough time to escape is to open with a surprise attack, slowing pursuit by destroying a parking facility full of unattended troop transport vehicles. Power-ups are scattered throughout the levels. The Slambird carries a variety of explosive devices and line-of-sight weapons. Some of the explosive weapons can bounce in a parabolic trajectory, and in addition there are two laser cannons that can fire rapidly an unlimited number of times. These cannons are useful in case no other weapons remain, and they can be used to create complex ripple fire, which can be used to cover an area that is surprisingly wide. When underwater, propellers are used, while torpedoes are automatically used instead of missiles.</p>"},{"name":"Andretti Racing","year":1996,"developer":"Stormfront Studios","url":"e#Andretti%20Racing%20%28Europe%29.zip","filesize":485730940,"score":7.5,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>For the first time ever in an arcade racer, take control of either NASCAR or Indy cars and cruise around 16 detailed tracks. There are 3 views available to drive from. As well as individual races, you can play a full career. Derek Daly and Bob Jenkins provide a running commentary. Outside factors such as pit-crew mistakes and mechanical failures can affect your races.</p>"},{"name":"Anearth Fantasy Stories: The First Volume","year":1997,"developer":"Media Works Inc."},{"name":"Angel Devoid: Face of the Enemy","year":1996,"developer":"Electric Dreams Inc."},{"name":"Angel Graffiti S: Anata e no Profile","year":1997,"developer":"Astrovision","url":"e#Angel%20Graffiti%20S%20-%20Anata%20e%20no%20Profile%20%28Japan%29.zip","filesize":255294193,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Angel Graffiti</em> is a visual novel romance simulation game for PlayStation, ported a year later to Sega Saturn under the name <em>Angel Graffiti S</em>. The player character is a high-school sophomore student, whose name, nickname, birth date and blood type is decided by the player at the beginning of the game. One day, while walking through the park, you notice a beautiful girl, but don't really manage to make a good impression on her and she soon goes away. The next day, your homeroom teacher announces you have a new student joining your class ... her name is Misuzu Amano ... the girl you met a day ago in the park. Your luck didn't completely run out as now you will have plenty of time to try and make an impression on her and possibly make her fall in love with you. But she is not the only girl in school that caught your eyes, so you will have to decide who is your person of interest and who you will try to woo. Luckily for you, you are not alone on your quest, you will have a help from heaven itself, an angel by the name Eve, who will often give you advice on girls' feelings.</p><p>The basic gameplay is similar to visual novel style with dialogues and occasional selectable answers, but while you're in your room you'll be able to perform some other actions such as study, work part-time to earn some income, ask Eve for advice, set events on your calendar, join the school clubs and similar options. While dialogues use typical anime character style to represent characters, each of the main heroines also has a small figure-like character that represents her. They come in five different degrees of emotions between love and hate, the middle one being neutral, neither loving nor hating you. The game features animations for certain memorable events, while the dialogues mostly use static images with different postures. Voice-acting is included but is not complete, meaning even the heroines that talk during dialogues do not talk throughout all of their dialogues bust only some of them.</p>"},{"name":"Angel Paradise Vol. 1: Sakaki Yuko - Koi no Yokan in Hollywood","year":1996,"developer":"Sammy Corporation","url":"e#Angel%20Paradise%20Vol.%201%20-%20Sakaki%20Yuko%20-%20Koi%20no%20Yokan%20in%20Hollywood%20%28Japan%29.zip","filesize":388092239,"score":"","genres":"Puzzle","desc":"<p>Featuring a certain Ms. Yuko Sakai on holiday in Hollywood, successfully completing the puzzles rewards players with plenty of snaps of her having fun and frolics poolside, sunbathing on the beach, enjoying a blast on the roller blades or a burger at the local joint. Though judging from her figure, it was the only burger she enjoyed. Plenty of info in the Yuko fact file and even her singing along to the ending theme.</p>"},{"name":"Angel Paradise Vol. 2: Yoshino Kimika - Isshoni I-ta-i in Hawaii","year":1996,"developer":"Sammy Corporation","url":"e#Angel%20Paradise%20Vol.%202%20-%20Yoshino%20Kimika%20-%20Isshoni%20I-ta-i%20in%20Hawaii%20%28Japan%29.zip","filesize":472199103,"score":"","genres":"Puzzle > Fixed / flip-screen > Full Motion Video (FMV) > Live action > Video backdrop > Point and select > Romance > Licensed","desc":"<p>Released only five months after Angel Paradise Vol.1, volume two of <em>Angel Paradise</em> features similar gameplay but focuses on a new gravure idol, namely, Kimika Yoshino (吉野公佳).</p><p>The main game takes place on an Oahu Hawaiian island where player travels from Japan and solves animated jigsaw puzzles within the allotted time in order to unlock the next level. Aside from starting point in Japan, there are 15 move levels scattered across Oahu island. Levels are made in a way to tell the traveling story of Kimika and feature live-action animation that looks in the background of the jigsaw puzzle. Jigsaw puzzles aren't the typical in look and size but are mostly square in overall shape with a bit of embellishments inside which helps determine the shape and minimizes the number of places where it can fit. Player takes puzzle piece from the right side (two are visible on screen, but player can look through all remaining pieces and place them in any wanted order) and put them on top of the big portion of left part of the screen where the jigsaw puzzle with animated video in the background is placed. Kimika will tell you in her own voice if the placed piece of puzzle fits or not. Any reached levels can be selected and replayed from the travel map.</p><p>Aside from the main story, from the main menu the player can also access data room which holds about a dozen or so photo still of Kimika Yoshino along with a scrollable info about her... and not just the three-number proportion, but also trivia on par with her favorite animal, favorite food, pet name, and whatnot. A bonus game which is also accessible from the main menu is a Quiz game. There, Kimika will ask you through pre-recorded live-action videos ten questions about herself to see how big of a fan you are and how well you know here. All answers yield to \"yes\" or \"no\" option only and will prompt her different reaction whether you answer them correctly or incorrectly. In the end, the score screen will show a specific photo of Kimika and her message to you depending on how well you answered her questions.</p><p>In the game options screen, aside from typical audio setup and level difficulty selection, they player can also assign controller keys and check any of the 49 unlockable movies. First print featured a present campaign where the first 500 players could get an alarm clock featuring Kimika Yoshino's photo and wake-up voice.</p>"},{"name":"Angelique Duet","year":1998,"developer":"Ruby Party","url":"e#Angelique%20Duet%20%28Japan%29.zip","filesize":448639188,"score":"","genres":"Simulation > Anime / Manga > Life / social simulation > Romance","desc":"<p><em>Angelique Duet</em> is a spin-off of the first Angelique. It offers players the ability to play as Rosalie, the rival of the first game.</p><p>The gameplay and flow remains much the same to the first game if the player picks Angelique, but has altered romance events for Rosalie to distinguish it from the base game. It also includes features and events that were added in Angelique Special 2, such as the gift giving and written date invitations. On top of that there are now Friendship events between Angelique and Rosalie. There is also a change in character portraits and backgrounds as they received a graphical update.</p><p>The DS port includes a communication mode taking advantage of the wireless connection capabilities the Nintendo DS. This allows players to message each other and trade items through an in-game messaging system and room visits.</p>"},{"name":"Angelique Special","year":1996,"developer":"KOEI Co., Ltd.","url":"e#Angelique%20Special%20%28Japan%29.zip","filesize":351898526,"score":"","genres":"Adventure > Strategy > Top-down > Anime / Manga > Fantasy","desc":"<p>In every sector of the Cosmos, there is a queen who rules over it, keeping the powers of the elements in balance with the help of the Nine Guardians. But with time, the queen's power fades, and a new queen must replace her. Several candidates compete until one of them proves that she has the knowledge of the nine elements and has convinced the Guardians to lend their power to her. The heroine of the game is a seventeen-year-old Angelique Limoges, and her main adversary is a rather unpleasant girl named Rosalia. Will Angelique be able to befriend the Guardians and become the next queen?</p><p><em>Angelique</em> borrows elements from different genres: Japanese-style adventure (without puzzles), \"dating sim\", and (not overly complex) strategy. The goal is to make sure that Angelique has good relationship with the Guardians, maintaining the balance. For that, Angelique has to visit them daily, talk to them, and see what effects their powers have over the land. The situation is further complicated by the fact that Angelique - depending on the Zodiac sign the player chooses for her - has a certain affinity with one of the elements, and therefore, with one of the Guardians. This can lead to a love relationship, which will forfeit Angelique's chances to become a queen, but deliver an ending which can still be considered satisfying.</p><p>The SNES original was later ported to other platforms and that version of the game features slightly improved graphics, CD-quality music, voice acting, and anime-style cutscenes.</p>"},{"name":"Angelique Special 2","year":1997,"developer":"KOEI Co., Ltd.","url":"e#Angelique%20Special%202%20%28Japan%29.zip","filesize":395156496,"score":"","genres":"Adventure > Strategy > Top-down > Anime / Manga > Fantasy","desc":"<p>Following the events of the  first Angelique game, Angelique Limoges has become the queen of Cosmos, and her former rival Rosalie - her aid. Now a whole new Cosmos has appeared, and it's time to choose a new queen for it. The candidates this time are Angelique Collet (the protagonist of the game) and Rachel Hart.</p><p>The gameplay system remains largely unchanged in this sequel. Once again, Angelique has to use diplomacy to make the Nine Guardians lend her their powers (making the inhabitants of her land happy), or develop stronger feelings for her. New in this sequel is the ability to work with three different instructors, developing mind, sense, or dignity of the heroine, which will influence the way she interacts with other characters and also affect the behavior of the Guardians.</p>"},{"name":"Aqua World: Umibi Monogatari","year":1996,"developer":"Mizuki Co., Ltd."},{"name":"Arcade Gears Vol. 1: Pu Li Ru La","year":1997,"developer":"Taito Corporation","url":"e#Arcade%20Gears%20Vol.%201%20-%20Pu%20Li%20Ru%20La%20%28Japan%29.zip","filesize":365654025,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler","desc":"<p><em>Pu-Li-Ru-La</em> is a psychedelic side-scrolling arcade beat 'em up set in the magical land of Radishland.As the story goes, some evil magical entity has stolen the keys of time for the towns in Radishland, freezing time and turning every animal and creature into evil magical contraptions. Only Zac and Mel, empowered with their \"invented magic sticks\" are able to escape the curse and must thread through Radishland turning all the monsters back into their original form and recovering the keys of time.</p><p>Gameplay-wise the game is a side-scrolling beat 'em up in which you control your character in a 2.5D isometric plane as he clears each stage by beating the many wacky enemies with his stick and a few magic spells that are randomly selected whenever you start the game. At the end of each stage there is a harder \"boss\" creature you must defeat and upon doing so you proceed to the next stage.</p><p>The game is notable for its surreal graphic design, featuring digitized graphics merged with hand-drawn sprites and featuring mostly colorful nonsensical graphics. Features single player or co-op two-player gameplay modes.</p>"},{"name":"Arcade Gears Vol. 2: Gun Frontier","year":1997,"developer":"Taito Corporation","url":"e#Arcade%20Gears%20Vol.%202%20-%20Gun%20Frontier%20%28Japan%29.zip","filesize":321380999,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>Gun &amp; Frontier</em> is a 1990 arcade vertical shoot-'em-up. The setting of the series and purportedly of the game is an extraterrestrial American Wild West, with the player fighting to defend settlers from airborne pirates -- the game, though, actually looks to be an entirely standard military-themed shooter, with the player's jet fighter set against tanks and other airplanes. Guns and bombs are levelled-up and collected by dropped power-ups, which are money-themed, with the gun upgrades shown as American dimes and bombs as gold bars.</p><p><em>Gun &amp; Frontier</em> was ported to the Sega Saturn in 1997 and was later included in the cross-platform compilation Taito Legends 2 in 2006.</p>"},{"name":"Arcade Gears Vol. 3: Wonder 3","year":1998,"developer":"Capcom Co., Ltd.","url":"e#Arcade%20Gears%20Vol.%203%20-%20Wonder%203%20%28Japan%29.zip","filesize":476926123,"score":"","genres":"Action > Compilation > Diagonal-down > Side view > Arcade > Platform > Puzzle elements > Shooter > Direct control","desc":"<p><em>Three Wonders</em> contains three different games: <em>Midnight Wanderers</em> (side-scrolling action), <em>Chariot</em> (shoot-em-up) and <em>Don't Pull</em> (puzzle).</p><p><strong>Midnight Wanderers: Quest for the Chariot</strong><em>Midnight Wanderers</em> (<em>Roosters</em> in the Japanese version) is a run-and-gun game. The player walks along side-scrolling stages while shooting enemies with a bow. The player can grab power-ups such as stronger shot, or a companion that follows the avatar and shoots. The gameplay is very similar to Ghosts 'N Goblins, made by the same developer. If the avatar gets hit he loses his clothes and will walk in his underwear in the same way.</p><p><strong>Chariot: Adventure Through The Sky</strong><em>Chariot</em> is a shoot-em-up similar to Gradius. The player shoot enemies on a vertically scrolling screen, collect power-ups and fight end bosses. The player collects power-ups such as three-way shot, stronger laser, extra points, bombs and shields. If the player picks up extra bombs, they attach to his or her ship like a tail. The end bosses are themed after the classic elements, like the wind, the Moon, the sun, etc.</p><p><strong>Don't Pull</strong><em>Don't Pull</em> is essentially a polished and updated version of Pengo. In this single screen game, the player plays as a bunny or chipmunk walking through a maze full of baddies. The player can push the blocks of the maze to crush the enemies.</p><p>If a tile that is pushed is blocked by another tile, it is crushed and clears the way through the maze. There also are special blocks, for example a block with a bomb icon, that explodes and stuns any nearby enemies. Bonus points are earned for crushing multiple enemies with a single block push.</p>"},{"name":"Arcade Gears Vol. 4: ImageFight & XMultiply","year":1998,"developer":"Irem Corp.","url":"e#Arcade%20Gears%20Vol.%204%20-%20ImageFight%20%26%20XMultiply%20%28Japan%29.zip","filesize":511816345,"score":"","genres":"Action > Compilation > Side view > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Part of the Arcade Gears series, this compilation features two old Irem scrollers: ImageFight and X Multiply.</p>"},{"name":"Arcade's Greatest Hits","year":1997,"developer":"Atari, Inc.","url":"e#Arcade%27s%20Greatest%20Hits%20-%20The%20Atari%20Collection%201%20%28USA%29.zip","filesize":391365547,"score":6.9,"genres":"Compilation","desc":"<p>Another in the series of Midway's retro arcade compilations, this is the first to feature early Atari titles (in addition to the usual FMV interview segments.)<br>The games included are:<br>* Asteroids<br>* Battlezone<br>* Centipede<br>* Missile Command<br>* Super Breakout<br>* Tempest</p>"},{"name":"Area 51","year":1996,"developer":"Mesa Logic, Inc.","url":"e#Area%2051%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":277918394,"score":6.5,"genres":"Action > 1st-person > Video backdrop > Arcade > Rail shooter > Sci-fi / futuristic","desc":"<p>Using a light gun you blast your way through the secret base, Area 51, which has been taken over by mutant aliens. As you work your way to the secrets at the heart of Area 51, you'll need to destroy an increasingly dangerous line of aliens, upgrade your firearm, and cause as much collateral damage as possible. The game rewards the player for destroying windows, light fixtures, computers, explosive barrels, and even fire extinguishers. Each consecutive hit increases your streak rating (which adds to your score) and certain combinations of these collateral hits will open up secret bonus rooms.</p><p>The home version has special bonuses and additional secret levels not found in the arcade version and a mouse option is available.</p>"},{"name":"Arthur to Astaroth no Nazomakaimura: Incredible Toons","year":1996,"developer":"Capcom Co., Ltd.","url":"e#Arthur%20to%20Astaroth%20no%20Nazomakaimura%20-%20Incredible%20Toons%20%28Japan%29.zip","filesize":425646769,"score":"","genres":"Puzzle > Side view > 2D scrolling > Point and select > Fantasy","desc":"<p>A Japanese-only entry in Dynamix's <em>The Incredible Machine</em> series based on the Ghosts 'N Goblins series. </p><p>It is the only <em>The Incredible Machine</em> game with a plot, which is the same as in every <em>Ghosts 'N Goblins</em> game: the princess is kidnapped by Astaroth (the main villain of the games), so Arthur (the main character in the series) has to save her. It features all of the known characters of the series, such as the Red Arremer (who would get his own game series: Gargoyle's Quest). It also features items from the game, for example the armor icon, which is required for Arthur to move in this game. Not only does it have the most well known characters in the <em>Ghosts 'N Goblins</em> games, it also features remixed music of the series. </p><p>As with the <em>The Incredible Machine</em> games, there are different kinds of puzzles, one of them even involves killing Arthur. However, unlike the <em>The Incredible Machine</em> games, there are no Head-to-Head puzzles and no Freeform Machine mode, so there's only single player puzzles.</p>"},{"name":"Assault Rigs","year":1997,"developer":"Psygnosis Limited","url":"e#Assault%20Rigs%20%28Japan%29.zip","filesize":525931124,"score":7.2,"genres":"Action > 1st-person > 3rd-person (Other) > Shooter > Tank > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In the future, physical sports will be replaced by a violent virtual contest, where a lot of gambling and corporate cash is involved.</p><p>Such is the setting for this action-packed game, where you act as a jockey for a virtual tank of massive firepower, called a Rig. Navigate through the maze-like arenas with jumps, elevators and movable blocks. Pick up power-ups to overcome other Rigs, or Gems to advance through more than 40 levels.</p><p>Graphics and ambiance are inspired, it seems, by Tron, and place the player in a \"wire framed\" virtual environment. The focus here, though, is not racing, but rather blowing your opponent to oblivion. For that purpose the game gives the player progressively more power and versatility. Mini guns, laser cannons and heat seeking missiles are pretty much standard gear, but it also has a couple of twists of its own: feed your guns bouncing or shattering ammo rounds for added firepower, or experiment with the fly-by-wire missiles, where you remote control it to your target of preference. Shields and turrets are also at your disposal.</p><p>Also, as the game progresses, you can choose different tanks (Rigs) to use in your struggle to survive the clash. The game features 3-D graphics with light sourcing and multiplayer features.</p>"},{"name":"Assault Suit Leynos 2","year":1997,"developer":"NCS Corporation","url":"e#Assault%20Suit%20Leynos%202%20%28Japan%29.zip","filesize":395714130,"score":"","genres":"Action > 3rd-person (Other) > Side view > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Japan-only sequel to Target Earth, Leynos 2 puts you in the cockpit of a giant mecha robot as you scroll and shoot your way through a series of 7 individual missions tied loosely together by a generic sci-fi plot. </p><p>The game itself plays as a side-scrolling shooter set in different planets as well as outer space (where you can fly anywhere with your jump-jets). You have a variety of upgradeable weaponry which allow you to shoot anywhere on-screen as well as auto-lock individual enemies, and depending on how well you do on each stage you get a specific rating score that allows you to upgrade and customize your mech.</p>"},{"name":"Astal","year":1995,"developer":"SEGA Enterprises Ltd.","url":"e#Astal%20%28USA%29.zip","filesize":555971147,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Antowas has created a land of striking beauty and magic, with Astal and his beloved Leda among its happy inhabitants. However, Jerado has set out to destroy it, capturing Leda and forcing Astal to set off to save her.</p><p><em>Astal</em> is a side-scrolling platform game with lots of Anime-esque background detail. You have birds helping you if you can rescue them. Special moves such as a smart bomb can be collected.</p>"},{"name":"Astra Superstars","year":1998,"developer":"Santa Claus","url":"e#Astra%20Superstars%20%28Japan%29.zip","filesize":540670358,"score":"","genres":"Action > Side view > Anime / Manga > Arcade > Fighting","desc":"<p>A one-on-one 2D fighting game, Astra Superstars pits all the champions of the magical kingdom against each other in a series of 3-round fights to earn the right to challenge the evil Satan Volte and try to put an end to his reign of terror.</p><p>Seeing as how all the fighters have magical abilities, the fights take place in mid-air, allowing you and your opponent to fly all over the arena while you try to defeat each other using your basic attacks, special moves (triggered by specific controller motions) and super attacks (which deplete your energy bar but cause tremendous damage).</p><p>Graphics-wise the games uses 2D sprites, with colorful doll-ish designs. Gameplay modes include 1P arcade, 2P Vs mode, an art gallery featuring conceptual artwork and a story mode with selectable dialogue options that influence match difficulty.</p>"},{"name":"Asuka 120% Limited: Burning Fest. Limited","year":1997,"developer":"Fill in Café Co., Ltd.","url":"e#Asuka%20120%25%20Limited%20-%20Burning%20Fest.%20Limited%20%28Japan%29.zip","filesize":476537634,"score":"","genres":"Action > 3rd-person (Other) > Fighting > Martial arts","desc":"<p>The girls of Ryōran School for Young Women are back for their first and only official release on the SEGA Saturn. New contenders in the inter-school tournament this semester include Asuka's mentor, Tetsuko, and, as an unlockable extra, the principal of the school himself!</p><p><em>Asuka 120% Limited</em> doesn't add any new systems to the series, instead focusing on changing and tweaking moves to better balance the fighters. Character sprites are larger in comparison to the previous PlayStation entry, but like most SEGA Saturn games true transparencies were removed. The story mode is a standard linear fight to fight affair with text dialog in between matches. Versus mode includes options for Player vs CPU, Player vs Player, and exhibition CPU vs CPU. The final game mode is a survival mode where the player fights each character in turn, and health is restored based upon their score during the fight.</p>"},{"name":"Atelier Marie Plus: Salburg no Renkinjutsushi","year":1997,"developer":"Gust Co., Ltd."},{"name":"Athlete Kings","year":1996,"developer":"Sega AM3 R&D Division","url":"e#Athlete%20Kings%20%28Europe%29.zip","filesize":116667782,"score":7.7,"genres":"Sports > 3rd-person (Other) > Olympiad / mixed sports > Regional differences","desc":"<p>Sega's own version of Decathlon, the most grueling of multi-event sports consisting of the 100-Meter Dash, Long Jump, Shot Put, High Jump, 400-Meter Race, 110-Meter Hurdles, Discus Throw, Pole Vault, Javelin Throw and the 1500-Meter Race, split over two days of competition. Featuring eight athletes with different abilities and specialties, from the agile Karl Vain and Femi Kadiena, the fast Li Huang and Ellen Reggiani, the well balanced Joe Kudou and Rick Blade to the powerhouses Aleksei Rigel and Jef Jansens, the player must achieve the best scores possible in each event to get to the World's best results table, not only in the decathlon points table but also on the individual events table.</p><p>All events follow the core gameplay of other athletics titles (such as Track &amp; Field), with some changes from event to event. Spriting events such as the 100-meter dash are pure button-bashing, with the 110-Meter Hurdles requiring an additional tap in the action button to pass the athlete at the correct time over the hurdle without losing speed or knocking it down. At the opposite level, the 400-Meter and the 1500-Meter Race add a stamina bar that must be kept above critical levels at all times to keep the athlete fresh until the end, this being done by simply pacing the number of presses done by the player (the 1500M also requires the player to steer the athlete in the best path: as close as possible to the inside edge without hitting other runners or losing speed from going over the edge). Jumping events, along the javelin, require a fast build-up, an well-timed action (be it jump, set the pole or release the javelin), and setting the most appropriate angle. Discus is the only event where button mashing isn't required, and asks the player to rotate the D-pad clockwise to build strenght, followed by a push of the action button to set the angle of release as well as the direction. </p><p>Like in the original ST-V version (which means it is in every way similar to the arcade version), two players can compete at the same time in the running event, and at the 1500M race six drones compete at the same time.</p>"},{"name":"Atlantis: The Lost Tales (Disc 1)","year":1997,"developer":"Cryo Interactive Entertainment","url":"e#Atlantis%20-%20The%20Lost%20Tales%20%28Europe%29%20%28En%2CDe%2CEs%29%20%28Disc%201%29.zip","filesize":578519569,"score":7,"genres":"Adventure > 1st-person > Puzzle elements","desc":"<p>The advanced city design of Atlantis shows that a fully-fledged society must've functioned there, and this adventure game brings it to life. Queen Rhea is the leader who is under threat, and young Seth is the character you control as he aims to save the day. How can he know who to trust, and who has their own agenda in this complex world?</p><p>The world of Atlantis is displayed in fully-rotational full-screen 3D comprising of millions of polygons and full lip-synching using a proprietary system. Listen out for sounds of danger - sometimes they are the first warning you get.</p><p>There are 5 different continents to explore, and each has its own cultures. In total there are 50 characters you will interact with, and puzzles using an inventory system. Save points are limited by the game.</p>"},{"name":"Atlantis: The Lost Tales (Disc 2)","year":1997,"developer":"Cryo Interactive Entertainment","url":"e#Atlantis%20-%20The%20Lost%20Tales%20%28Europe%29%20%28En%2CDe%2CEs%29%20%28Disc%202%29.zip","filesize":421561242,"score":7,"genres":"Adventure > 1st-person > Puzzle elements","desc":"<p>The advanced city design of Atlantis shows that a fully-fledged society must've functioned there, and this adventure game brings it to life. Queen Rhea is the leader who is under threat, and young Seth is the character you control as he aims to save the day. How can he know who to trust, and who has their own agenda in this complex world?</p><p>The world of Atlantis is displayed in fully-rotational full-screen 3D comprising of millions of polygons and full lip-synching using a proprietary system. Listen out for sounds of danger - sometimes they are the first warning you get.</p><p>There are 5 different continents to explore, and each has its own cultures. In total there are 50 characters you will interact with, and puzzles using an inventory system. Save points are limited by the game.</p>"},{"name":"Ayakashi Ninden Kunoichiban Plus (Disc 1)","year":1998,"developer":"Zero System","url":"e#Ayakashi%20Ninden%20Kunoichiban%20Plus%20%28Japan%29%20%28Disc%201%29.zip","filesize":365076969,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Dating simulation > Japanese-style adventure > Life / social simulation > Visual novel > Menu structures > Asia > Contemporary > Comedy > Romance","desc":"<p>In an alternate modern-day world where being a ninja is recognized as a legitimate profession, our heroine and main protagonist, Kaede Hagakure, transfers into Himeyuri Gakuen, a girls' training school for kunoichi (female ninjas). During her time at the school, she is bound to encounter numerous friends, comrades and potential rivals, as well as a few very grave situations here and there...</p><p><em>Ayakashi Ninden Kunoichiban</em> is a yuri-themed visual novel and dating sim revolving around female ninjas. The bulk of the gameplay involves around stat-raising in a school environment, as well as choosing which of the main heroines the protagonist will spend their time with, potentially leading in the direction of a romantic ending with any of them. Players will also occasionally be thrown into battle sequences, and their time spent raising stats will greatly affect how these battles can progress.</p>"},{"name":"Ayakashi Ninden Kunoichiban Plus (Disc 2)","year":1998,"developer":"Zero System","url":"e#Ayakashi%20Ninden%20Kunoichiban%20Plus%20%28Japan%29%20%28Disc%202%29.zip","filesize":365075194,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Dating simulation > Japanese-style adventure > Life / social simulation > Visual novel > Menu structures > Asia > Contemporary > Comedy > Romance","desc":"<p>In an alternate modern-day world where being a ninja is recognized as a legitimate profession, our heroine and main protagonist, Kaede Hagakure, transfers into Himeyuri Gakuen, a girls' training school for kunoichi (female ninjas). During her time at the school, she is bound to encounter numerous friends, comrades and potential rivals, as well as a few very grave situations here and there...</p><p><em>Ayakashi Ninden Kunoichiban</em> is a yuri-themed visual novel and dating sim revolving around female ninjas. The bulk of the gameplay involves around stat-raising in a school environment, as well as choosing which of the main heroines the protagonist will spend their time with, potentially leading in the direction of a romantic ending with any of them. Players will also occasionally be thrown into battle sequences, and their time spent raising stats will greatly affect how these battles can progress.</p>"}]