[{"name":"Baku Baku Animal: World Zookeeper Contest","year":1995,"developer":"Sega AM3 R&D Division","url":"e#Baku%20Baku%20Animal%20-%20World%20Zookeeper%20Contest%20%28Europe%29.zip","filesize":524104325,"score":6.9,"genres":"Puzzle > Real-time > Falling block puzzle","desc":"<p>The Minister approaches the King to tell him that his only daughter, the Princess, wants a new pet. But the King says she already has too many, and she can't take care of so many animals. Thus the Minister purposes a contest of skill and daring to select the Royal Zookeeper. Master Piggy then sends his pupil, Polly, to participate in the contest.</p><p><em>Baku Baku Animal</em> is a variation on the very often copied Tetris type of game. The game has three different play modes: practice, normal and hard. It also can be played by two players against each other (except for the Master System version).</p><p>The objective is to pair animal heads with their respective food. If a rabbit head comes falling, you must make it fall on a pile of carrot tiles, dog heads with bones, panda heads with bamboos and monkey heads with bananas. There is a bonus item, the \"BB coin\", which will appear from times to times, and remove piled tiles from the playfield. Removed tiles will be sent to the opponent's playfield all at once, increasing the difficulty of the task. Polly will face several contestants, and she'll win when her opponents get their playfield piled to the top.</p>"},{"name":"Bakushō!! All Yoshimoto Quiz-Ou Ketteisen DX","year":1995,"developer":"Tose Co., Ltd."},{"name":"Baldies","year":1998,"developer":"Creative Edge Software"},{"name":"Bandit Kings of Ancient China","year":1996,"developer":"KOEI Co., Ltd."},{"name":"Baroque","year":1998,"developer":"Sting, Inc.","url":"e#Baroque%20%28Japan%29.zip","filesize":349270593,"score":"","genres":"Action > 1st-person > Post-apocalyptic > Horror","desc":"<p>The Armageddon came. A huge Heat Wave ruined the planet, humans have mutated into strange creatures who worship strange gods, trying to exterminate each other in bloody wars, and Ikei demons populate the surface of the planet. In the middle of the wasteland stands the Nerve Tower. Nobody knows what it is: the symbol of evil or the final hope for salvation, because nobody ever dared to enter it. But the hero of the game is determined to explore the tower, and perhaps to cleanse the world of evil once and for all.</p><p><em>Baroque</em> is horror-themed action game with elements of survival gameplay. The whole game is set in the tower: you slowly work your way to the top, fighting demons as you progress. You have HP as well as stamina gauge. If your stamina is depleted, you walk slower and can't react well in a battle.</p>"},{"name":"Bases Loaded '96: Double Header","year":1995,"developer":"Jaleco Ltd.","url":"e#Bases%20Loaded%20%2796%20-%20Double%20Header%20%28USA%29.zip","filesize":100938388,"score":"","genres":"Sports > Behind view > Diagonal-down > Direct control > Baseball > Licensed","desc":"<p>This baseball game features real MLBPA players from the 1994 baseball season. The teams they actually played for are only represented by the cities the actual teams are from. The game has an Exhibition mode, a Regular Season mode, and a Championship Game mode. The Regular Season mode lets the player choose to play either a 13, 26, 52, or 162 game season, while the Championship Game mode lets the player play either a 3, 5, or 7 game championship game series against an opposing team.</p><p>The game also allows baseball players to be traded to other teams, and it also allows the player to select to play in 1 of 7 different MLB ballparks, plus one extra ballpark designed by Jaleco. Gameplay options include turning automatic fielding on or off.</p><p>When on the field, batting makes use of a behind the batter view, while pitching makes use of a behind the pitcher view. Pitching is kept simple by the player being only able to control where the pitch goes, while batting only involves timing the swing to make contact with the pitched ball.</p>"},{"name":"Batman Forever: The Arcade Game","year":1996,"developer":"Iguana Entertainment Incorporated","url":"e#Batman%20Forever%20-%20The%20Arcade%20Game%20%28Europe%29.zip","filesize":16675347,"score":5,"genres":"Action > Side view > Beat 'em up / brawler > Martial arts > Licensed","desc":"<p>A Final-Fight/Double-Dragon style game which features the Caped Crusader and his sidekick Robin in a traditional beat-em-up. Based on the Batman Forever movie, this side-scrolling beat-em-up features the plot, several memorable characters, and quotes from its movie counterpart.</p><p>The player gets to use batarangs, a bat grapple, and tons of other Batman-specific goodies in order to accomplish their goals. The player can create their own combos and collect power-ups to help them in their quest to rid the streets of Gotham from an everlasting flow of bad guys.</p>"},{"name":"Batsugun","year":1996,"developer":"Toaplan Co., Ltd.","url":"e#Batsugun%20%28Japan%29.zip","filesize":537478526,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Flight / aviation","desc":"<p><em>Batsugun</em> was the last release from the arcade game development studio Toaplan and one of the earliest if not the earliest manic or \"bullet hell\" shoot-'em-ups. A large part of the team later went on to work at CAVE Co., Ltd. where the genre would be refined.</p><p><em>Batsugun</em> for the Saturn integrates the two revisions of the original 1993 arcade game, where the second one, <em>Batsugun Special Version</em>, was completed but never released because the company was bankrupt. Both versions were used to create the Saturn version by the Toaplan offshoot Gazelle. It is a military-themed vertical shooter with a choice of three weapons for the player's plane at start, with leveling-up of weapons determined by experience points, given when enemies are destroyed, rather than dropped power-ups.</p>"},{"name":"Battle Arena Toshinden Remix","year":1995,"developer":"Tamsoft Corporation","url":"e#Battle%20Arena%20Toshinden%20Remix%20%28Europe%29.zip","filesize":336815395,"score":6.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Martial arts","desc":"<p>Toshinden Remix or Toshinden S as it was called in Japan is a port of Takara's Playstation fighting game Battle Arena Toshinden to the Sega Saturn by Sega.</p><p>It adds an additional secret character as well as a story mode for each character. These additions also hint at some of the plot twists in the game's sequel Battle Arena Toshinden 2.</p><p>The games graphics took a huge hit in the port; the Playstation version really does look considerably better. Though the character model and arena for the afore mentioned port exclusive character looks notably better than the ported graphics.</p><p>Toshinden Remix also redubs all the games voice samples with more light-hearted samples with over the top and arguably outrageous accents.</p><p>Like the graphics, the game speed also takes a huge hit in this port running considerably slower than the Playstation original.</p>"},{"name":"Battle Arena Toshinden URA: Ultimate Revenge Attack","year":1996,"developer":"TAKARA Co., Ltd.","url":"e#Battle%20Arena%20Toshinden%20URA%20-%20Ultimate%20Revenge%20Attack%20%28Europe%29.zip","filesize":414894653,"score":5.9,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > Martial arts","desc":"<p><em>Battle Arena Toshinden Ultimate Revenge Attack</em> is the second <em>Toshinden</em> game for the Saturn, following Battle Arena Toshinden Remix</p><p>Whereas <em>Remix</em> was a tweaked version of the Playstation’s Battle Arena Toshinden, <em>Ultimate Revenge Attack</em> isn't a tweaked version of the Playstation’s Battle Arena Toshinden 2 but rather a new game. It abandons the plot of the original <em>Toshinden</em>/<em>Toshinden Remix</em> and tells a new standalone tale revolving around the assassination of renowned warriors all over the world.</p><p>The game adds three new fighters compared to its predecessor; RonRon, Ripper and Tracy and three new bosses and secret characters bringing the total number of fighters to 15. The original <em>Toshinden</em>’s final boss and also <em>Remix</em>’s exclusive character have been removed. The gameplay could be described as a hybrid of the Playstation’s <em>Toshinden</em> and <em>Toshinden 2</em> with movement like the former but the latter’s combo system.</p>"},{"name":"Battle Athletess Daiundoukai","year":1996,"developer":"AIC Spirits","url":"e#Battle%20Athletess%20Daiundoukai%20%28Japan%29.zip","filesize":332575939,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p>Set in the year of 4998, after the war with an alien race, the battle is no longer waged with devastating weapons but through a contest of physical strength between representatives of each race. In <em>Battle Athletes</em>, Akari Kanzaki (神崎 あかり), the protagonist of the story, but not the player, is a daughter of a former Cosmic Beauty who promised her mother on her deathbed to follow in her steps. Akari enrolls in a training school and strives to shape her body and become the next Cosmic Beauty. The story progresses one day at the time, leaving you to go through a half-year long training with Akari. The player can go to various areas in the school, talk to other characters, and perform daily training routines such as running, swimming, aerobics, and more. As Akari trains more, her physical characteristics improve, such as stamina, endurance, strength, and other. To check Akari's current stats, you can visit the school nurse to give you a rundown on her current condition. The game mostly plays as visual novel and features anime style videos and voice-acting. Characters during conversation are not animated in any way, but character portrait icons appear in various expressions to emphasize their posture during dialogues.</p>"},{"name":"Battle Garegga","year":1998,"developer":"Raizing Co., Ltd.","url":"e#Battle%20Garegga%20%28Japan%29.zip","filesize":597008178,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Battle Garegga</em> is a vertically scrolling shoot'em up arcade game.The storyline takes place in a sort of dieselpunk version of the 1940s. Main heroes are brothers Brian and Jason — the sons of a genius designer who want to destroy the evil Federation. Players control planes (4 aircrafts to choose), fly forward, collect items and shoot enemies. Unlike in most other scrolling shooter games, where bullets are brightly colored to make them stand out from the background, bullets in this game are realistically colored, making them difficult to see.As a bonus, by entering a code, you can unlock four of the characters from Mahou Daisakusen.</p>"},{"name":"Battle Monsters","year":1995,"developer":"Scarab","url":"e#Battle%20Monsters%20%28Europe%29.zip","filesize":37074232,"score":4.5,"genres":"Action > Side view > Fighting > Platform > Martial arts","desc":"<p>Try to gain control of the underworld in <em>Battle Monsters</em>. You must choose from a variety of monsters, and then enter one-on-one combat. Twelve characters are available (from a human/bird hybrid to a headless creature) with each having its own set of special moves, like juggling opponents in the air, and pit monster against monster. Fight through several different places where each level's background is made up of multiple levels, allowing combatants to jump from one platform to another with two attack buttons and two jump buttons controlling the action.</p>"},{"name":"Battle Stations","year":1997,"developer":"Realtime Associates, Inc.","url":"e#Battle%20Stations%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":481926580,"score":6.4,"genres":"Action > Strategy > 3rd-person (Other) > Top-down > Isometric > Real-time > Arcade > Real-time strategy > Naval / watercraft","desc":"<p>This naval combat game feature a 1 and 2 player game. The 1 player game is split between either Arcade or Campaign mode. The 2 player game is split between Arcade or War Games mode.</p><p>The Campaign mode features 50 missions with objectives such as eliminating enemy supply convoys or carrying out a full scale assault on an opponent's homeland. The player then selects the admiral they want to fight in the battle. There are 5 opposing admirals and each admiral has their own set of skills on how they wage war.</p><p>The Arcade mode lets 1 or 2 players choose their ship and then have a 1 on 1 ship battle. Players earn points for sinking their opponent's ships which will allow them to climb 10 naval ranks all the way from Ensign to Fleet Admiral.</p><p>The War Games mode allows 2 players to play against each other in 26 different locations. Players can compete in these locations in three different ways. One way, is called war, with the objective to destroy every one of their opponent's ships. Another way, is to play capture the flag, which has the player trying to sink their opponent's flag ship and then return the flag back to their own harbor. The final way is called capture the harbor. This has the player attempt to drop marines, who are being carried inside a troop transport, off into their enemy's harbor, so the harbor can be attacked and captured. In this mode, players also get to choose between playing as one of several countries, or have a balanced or custom naval force. This choice affects the number of units of each type of ship the player starts the battle with.</p><p>The game features 8 types of ships which are aircraft carriers, destroyers, battleships, cruisers, patrol boats, mine layers, troop transports, and submarines. Each ship has different ratings in the categories of top speed, target range, hull strength, main guns, special weapon, and defensive weapon.</p><p>Gameplay has players moving their ships strategically on an overhead map. When two ships move close enough to each other, a battle can happen. In the battle, players try maneuvering a target reticule on their opponent ship to attack them, while also attempting to move out of the way of their opponents attacks. Once one of the ships health meters become empty from taking to much damage, they are sunk.</p>"},{"name":"BattleSport","year":1997,"developer":"The 3DO Company","url":"e#BattleSport%20%28USA%29.zip","filesize":441974116,"score":6.5,"genres":"Action > Sports > 1st-person","desc":"<p><em>Battlesport</em> simulates the sport of the future. Choose your vehicle and enter the arena to face your computer opponents to see who scores the most goals before the clock runs out.</p><p>Scoring isn't easy. The ball constantly bounces over the arena, retrieved by a player constantly bombarded by opponents. A variety of weapons are available to shoot your competitor, and anyone that takes a hit while carrying the ball loses possession, sending the ball bouncing across the arena. Taking too many shots results in a temporary inability to take part in the action while your opponent happily scores goals. </p><p>Winning matches increases standing in the rankings and the acquisition of cash to purchase a better vehicle and enhanced offensive or defensive items.</p>"},{"name":"Bishoujo Senshi Sailor Moon SuperS - Various Emotion","year":1996,"developer":"Visual Science Laboratory, Inc.","url":"sega-saturn-champion-collection-updated/B/Bishoujo%20Senshi%20Sailor%20Moon%20SuperS%20-%20Various%20Emotion%20%28JP%29.zip","filesize":468030669,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Fantasy > Licensed","desc":"<p><em>Bishoujo Senshi Sailor Moon SuperS: Various Emotion</em> is 2D (with pseudo-3D graphic) fighting game, based on Sailor Moon (Super S) anime series, with story given through anime cut-scenes. The player controls one of six different characters in story mode: Sailor Moon, Sailor Chibi Moon, Sailor Venus, Sailor Mars, Sailor Mercury and Sailor Jupiter. Versus mode features additional playable characters such as Sailor Pluto, Sailor Saturn, Sailor Uranus and Sailor Neptune. Each character has own set of unique fighting moves. <em>Bishoujo Senshi Sailor Moon SuperS: Various Emotion</em> is a typical fighting game - the players choose character and fights in series of matches, using punches, kicks and magic attacks.</p>"},{"name":"Black Dawn","year":1996,"developer":"Black Ops Entertainment, LLC","url":"e#Black%20Dawn%20%28Europe%29.zip","filesize":363851101,"score":7.6,"genres":"Action > 1st-person > Behind view > Helicopter","desc":"<p><em>Black Dawn</em> fulfills a few childhood dreams by putting gamers in control of a military helicopter. Terrorists have grown powerful in the world and it is up to you to restore stability and peace throughout the lands. Assigned to a variety of campaigns, you must fly the AH-69 Mohawk (sounds like something Jan-Michael Vincent from AIRWOLF would pilot) as you battle through enemy territory across different global locales.</p>"},{"name":"Black Fire","year":1995,"developer":"NovaLogic, Inc.","url":"e#Black%20Fire%20%28USA%29.zip","filesize":260696868,"score":6.6,"genres":"Action > 1st-person > Arcade > Helicopter > Sci-fi / futuristic","desc":"<p>In <em>Black Fire</em>, the player takes control of the most sophisticated helicopter on the planet taking on a very dangerous enemy. The player's helicopter is state of the art, but the enemy they are fighting has acquired alien technology and is using it to try and conquer the world and it is up to the player to use all the flying skill they have and try to stop them.</p><p><em>Black Fire</em> is rendered in 3-D and has a 360 degree field to maneuver. The chopper is outfitted with missiles and machine guns and flies through 15 levels, destroying enemy targets and providing support to allied units with the story told through CGI cutscenes.</p>"},{"name":"Black Matrix","year":1998,"developer":"Flight-Plan Inc.","url":"e#Black%20Matrix%20%28Japan%29%20%28Reprint%29.zip","filesize":420855677,"score":"","genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p>The cosmic battle between angels and demons ended in the demons' victory. They took control of the world and reversed the ideology of the angels to suit their own demonic nature. The most positive and beautiful emotions belonged to the seven mortal sins. Angels were deprived of their rights and had to exist as slaves, obeying their demon masters in everything. You play an angel named Abel. In the beginning, you choose your master from several available characters. Your master, however, is soon accused of love - one of the seven greatest sins. You have to escape from prison, where you were thrown shortly after your master was banned, and to find a way to save your master.</p><p><em>Black/Matrix</em> is a strategy RPG that is divided into large battles and story sequences. You fight in turn-based mode by moving your party members on an isometric battle field, attacking and using magic, for which you require blood of defeated enemies. The experience points you gather after the battle can then be divided among your party members the way you like.</p>"},{"name":"Blast Chamber","year":1996,"developer":"Attention to Detail Limited","url":"e#Blast%20Chamber%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":479937024,"score":7.2,"genres":"Action > 3rd-person (Other) > Puzzle elements > Sci-fi / futuristic","desc":"<p>A quite weird puzzle/actiongame in 3d, where you are a little guy in a chamber which is rotatable by pushing around the corners. Objects will fall down then and some other parts of the level get accesible.</p><p>The game also supports a 2 player competitive mode, where you have to pick up objects and put them in another one's crystal. Try to avoid the other to get to his crystal by moving around the chamber.</p>"},{"name":"Blast Wind","year":1997,"developer":"Technosoft Co., Ltd.","url":"e#Blast%20Wind%20%28Japan%29.zip","filesize":534678245,"score":"","genres":"Action > Top-down > Arcade > Shooter","desc":"<p><em>Blast Wind</em> is 2D arcade vertical scrolling shooter in post-apocalyptic universe. Players control artificial life forms - Kyo (Player 1) or Faun (Player 2). They fight against Gorn - robotic force, who wants to destroy last remnants of humanity. Game is typical shoot'em up - the player controls a ship, collects bonuses to gain more firepower, shoots enemies and bosses. <em>Blast Wind</em> has one unique feature - the game is non-linear, the player can choose an alternative route by pressing the special switches on levels.</p>"},{"name":"Blazing Dragons","year":1996,"developer":"The Illusions Gaming Company","url":"e#Blazing%20Dragons%20%28Germany%29.zip","filesize":271036580,"score":7.5,"genres":"Adventure > 3rd-person (Other) > 2D scrolling > Real-time > Arcade > Puzzle elements > Point and select > Fantasy > Licensed","desc":"<p><em>Blazing Dragons</em> is an adventure game based on the Nelvana cartoon of the same name. In this twist on the King Arthur legend, the player controls a young dragon named Flicker who lives in the kingdom of Camelhot. Flicker is an inventor who wants to become a knight and win a tournament. The prize is the hand in marriage of Princess Flame, Flicker's lifelong love interest. The player must solve puzzles to defeat the evil mechanical Black Dragon, the human race's entry into the tournament. The gameplay is mostly straight inventory-based point-and-click, but there are several arcade sequences that the player must successfully complete in order to progress.</p>"},{"name":"Blazing Heroes","year":1995,"developer":"Micro Cabin Corp.","url":"e#Blazing%20Heroes%20%28USA%29.zip","filesize":131666499,"score":8,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Turn-based > Fantasy","desc":"<p>You are Aragon, the prince of Mystaria. Long time ago, your father was one of the twelve mighty warriors who opposed Sith, the evil being that once tried to open the sacred portals of Mystaria. In the ultimate battle, your father was slain by Sith, but his eleven companion captured the villain and banished him, depriving him of his forces. Sith spend many years in a remote prison, until he grew powerful again. Now he came back to Mystaria and took over the kingdom. It is now up to Aragon to find eleven companions in order to be able to defeat evil again.</p><p>This is a strategy RPG along the lines of  Shining Force series. Your party contains twelve characters, six of which can be used in battles. The turn-based battles are long and strategic - you move your characters on the battlefield, and the force of your attack depends on the amount of previous movement made by you. You can also use a variety of magic spells to hurt many enemies at the same time.</p>"},{"name":"Blue Breaker: Ken Yori mo Hohoemi o","year":1997,"developer":"HuneX Co., Ltd.","url":"e#Blue%20Breaker%20-%20Ken%20Yori%20mo%20Hohoemi%20o%20%28Japan%29.zip","filesize":515567008,"score":"","genres":"Role-playing (RPG) > Side view > 2D scrolling > Anime / Manga > Turn-based","desc":"<p>The world of <em>Blue Breaker</em> is called \"the path in the middle of empty sky\": floating islands connected with each other by bridges. It is the tradition of the people in this world that a fighter's full initiation can be completed only when he finds his true love and marries her. Such day has come now in the life of a young warrior named Kain, the hero of the game. His father explains to him that besides the usual warrior's goal of defeating the evil Dark Lord, Kain also has to find the girl of his dreams. He introduces to him a young sorceress named Asha, who becomes his first companion. But on his journey Kain meets many other young women, and it won't be so easy to choose one to whom he can give his heart!</p><p>Labeled as <em>Love Role-Playing</em>, \"Blue Breaker\" is a genre-crossing game that combines traditional Japanese RPG with town and dungeon exploration, party-based combat, etc., with \"love adventure\", in which your behavior towards girls influences the story. \"Blue Breaker\" features branching story progressing: events appear depending on the progress you have made with your female companions. Your typical RPG activities will influence your relationship with the girls. For example, if you fight too much, the girls will be tired; if you give a girl too many orders in battle (you can set battle in auto mode and only interfere occasionally) she will be displeased, and so on. It is also important to form a party in which the girls will have as few internal conflicts with each other as possible.</p>"},{"name":"Blue Seed: Kushinada Hirokuden","year":1995,"developer":"SIMS Co., Ltd."},{"name":"Bomberman Wars","year":1998,"developer":"Metro Corporation"},{"name":"Book of Lulu, The","year":1996,"developer":"Dada Média"},{"name":"Bottom of the 9th","year":1996,"developer":"Konami Computer Entertainment Chicago, Inc.","url":"sega-saturn-champion-collection-updated/B/Bottom%20of%20the%209th%20%28NA%29.zip","filesize":315688497,"score":7.4,"genres":"Simulation > Sports > Diagonal-down > 2D scrolling > Baseball","desc":"<p>One of the earliest in Konami's franchise, this version featured 300 actual MLB players at the time, but did not feature the MLB licensed teams. Players can choose to either play against a friend in <em>Exhibition</em>, <em>Season</em> or Playoffs. The gameplay is geared for more of a simulation style of play with the players stats determining on how well they hit, pitch and field.</p><p>Along with the standard modes for a baseball game, this one also featured the ability to customize their teams and choose any player to create their \"Dream Team\". It also had a variety of different camera angles to choose from and had meters to show their players progress such as a \"Streak Bar\" that showed a batters hitting ability and a \"Pitching Bar\" that showed whether a pitcher was fatigued.</p>"},{"name":"Brain Dead 13","year":1996,"developer":"ReadySoft Incorporated","url":"e#Brain%20Dead%2013%20%28USA%29.zip","filesize":554718501,"score":6.2,"genres":"Action > Full Motion Video (FMV) > Quick Time Events (QTEs)","desc":"<p>In <em>Brain Dead 13</em>, the player takes on the role of a young computer expert who one day is called to fix a computer at some scary castle and in no time flat, finds himself in trouble.</p><p>It is up to the player to use the complex moves of an interactive movie to escape from the castle. This animated adventure is basically based on the player's judgment on which direction you think the character might go, and if the player guesses wrong, death.</p>"},{"name":"Break Point Tennis","year":1996,"developer":"Smart Dog","url":"e#Break%20Point%20%28Europe%29%20%28En%2CFr%29.zip","filesize":116513473,"score":6.7,"genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p>Break Point is your basic tennis game. You can play on several different courts which differ in surroundings and style. There's a couple of fantasy courts as well as some real life courts. Player can choose between various motion captured players and game modes including practice, cup, tournament and so on.The speciality in this one is the fact that you can play with up to 8 players in tournament.</p>"},{"name":"BreakThru!","year":1995,"developer":"ZOO Corporation","url":"sega-saturn-champion-collection-updated/B/BreakThru%21%20%28JP%29.zip","filesize":7350555,"score":6.1,"genres":"Puzzle > Fixed / flip-screen > Real-time > Tile matching puzzle > Point and select","desc":"<p>In the award-winning tradition of Tetris, comes BreakThru! This time, your goal is to make as many bricks disappear as you can before time runs out. Click on a group of same-colored bricks to remove bricks and make the wall come tumbling down.</p>"},{"name":"Bubble Bobble also featuring Rainbow Islands","year":1996,"developer":"Probe Entertainment Ltd.","url":"e#Bubble%20Bobble%20also%20featuring%20Rainbow%20Islands%20%28Europe%29.zip","filesize":55133262,"score":7.2,"genres":"Action > Compilation > Side view > Arcade > Platform","desc":"<p>Bubble Bobble: One or two players attempt to save their friends in this re-release of the 1987 classic puzzle/action game. Players blow bubbles to trap enemies. When they pop the bubbles, fruit comes out and the players compete for the points. If they don't pop the bubbles in time, the enemies escape and become faster.</p><p>Rainbow Islands: One or two players. Rainbow Islands is the sequel to Bubble Bobble. Instead of bubbles, you create rainbows. The highly versatile rainbow can be used as bridges, as platforms, or as a weapon. You can shoot a rainbow at an enemy, you can trap it inside, or you can drop a rainbow on an enemy from above.</p>"},{"name":"Bubble Symphony","year":1997,"developer":"Taito Corporation","url":"sega-saturn-champion-collection-updated/B/Bubble%20Symphony%20%28JP%29.zip","filesize":484438860,"score":"","genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform","desc":"<p>In <em>Bubble Symphony</em>, you play one of four dragons - Bubblun, Bobblun, Kululun, and Cororon. Each dragon has its advantages and disadvantages. You have the task of trapping your enemies in bubbles, then bumping into them to make them turn into food, which you can get for points. There are multiple paths that you can take, and bosses that you have to defeat in order to proceed to the next set of levels. Multiple endings are viewed depending on skill and secrets found. Features an excellent soundtrack and guest appearances from various Taito games.</p>"},{"name":"Bug Too!","year":1996,"developer":"Realtime Associates, Inc.","url":"e#Bug%20Too%21%20%28Europe%29.zip","filesize":583780799,"score":6.4,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p><em>Bug Too!</em> is the sequel to Bug!. It is a third-person action platformer with console-style play mechanics. You play as Bug and his two sidekicks, SuperFly and Maggot Dog. You go through several 3D worlds, all of which are parodies of movies. You must defeat the themed villains through all of the environments to make your homeland safe again.</p>"},{"name":"Bug!","year":1995,"developer":"Realtime Associates, Inc.","url":"e#Bug%21%20%28Europe%29.zip","filesize":158754775,"score":7.8,"genres":"Action > Behind view > Side view > Platform > Direct control > Fantasy","desc":"<p>Bug's creepy-crawly insect friends need rescuing from the evil widow Queen Cadavra's clutches. Fight your way through six worlds to rescue them and find and defeat the spider queen. There are three levels to get through in each world of 3D platform action. Bug's key attack is his bug bounce but he can also somersault, spit and zap when powered up. The game also includes some simple puzzle elements.</p>"},{"name":"Bulk Slash","year":1997,"developer":"CAProduction Co., Ltd.","url":"sega-saturn-champion-collection-updated/B/Bulk%20Slash%20%28English%20Translated%2C%20Rev%201.001%29.zip","filesize":126266446,"score":"","genres":"Action > Behind view > Anime / Manga > Shooter > Direct control > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Bulk Slash</em> is a third-person action mecha simulation. The player assumes the role of Cress Dawley, the pilot of a transforming mech in a 3D level map with a boss at the end of each stage. A notable gameplay feature is the M.I.S.S. system: on every stage, a female navigator can be recruited and each one provides their own special abilities.</p>"},{"name":"Burning Rangers","year":1998,"developer":"Sonic Team","url":"e#Burning%20Rangers%20%28Europe%29.zip","filesize":324668846,"score":7.7,"genres":"Action > Behind view > Shooter","desc":"<p>As a member of the Burning Rangers, it is your job to put out a range of fires and rescue those trapped in the heat of the blaze.</p><p>During each level, your quad leader informs you of the critical areas inside certain buildings, such as multi-level warehouses.Following his advice, you must use your cybernetic powersuit to put out the flames in each area. Along the way you will also come across boss characters, who are out to light up the town, and you.Your performance is then rated on your time to complete the objectives, how many lives were saved, and so forth. The better you go, the higher the rating.</p>"},{"name":"Bust-A-Move 2: Arcade Edition","year":1996,"developer":"Taito Corporation","url":"e#Bust-A-Move%202%20-%20Arcade%20Edition%20%28Europe%29.zip","filesize":291247324,"score":7.6,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Arcade > Tile matching puzzle > Direct control > Fantasy","desc":"<p>Bub and Bob are back! Like in Tetris in reverse, you shoot bubbles at an array of different-colored bubbles stuck in an ever descending ceiling, attempting to match them up three by three to make them disappear.</p><p>This edition contains both puzzle challenges, multiplayer and normal progressive stages.</p>"},{"name":"Bust-A-Move 3","year":1997,"developer":"Taito Corporation","url":"e#Bust-A-Move%203%20%28Europe%29.zip","filesize":270882309,"score":7.8,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Arcade > Tile matching puzzle > Direct control > Fantasy","desc":"<p>One day, Dunk, the magic magician of Bubble World, releases a spell that transports eight characters from their home worlds to Bubble World. Now it is the player's turn to bring them back home!</p><p>In Bust-A-Move 3, you must try to remove all the bubbles in each stage by connecting three or more of the same color.</p><p>Five playing modes are available:</p><ul><li>Arcade mode.</li><li>Challenge mode: in this mode the player's performance is evaluated and the game adapts to it.</li><li>Win Contest mode: challenge all eight characters.</li><li>Collection mode: a collection of levels created by <em>Bust-A-Move</em> players. Each round carries the designer's name.</li><li>Edit mode: players can create and play their own puzzles.</li></ul><p>The Nintendo 64 version also includes two- and four-player modes.</p>"}]