[{"name":"Can Can Bunny Extra","year":1997,"developer":"Cocktail Soft","url":"e#Can%20Can%20Bunny%20Extra%20%28Japan%29.zip","filesize":450440161,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Adult","desc":"<p>The fifth  Can Can Bunny game is also the first direct sequel within the series. The story is very similar to the one of the  previous game: once again, the hero is lonely and is anxious to get a girlfriend, or, to be more precise, to have sex with different girls. And once again, the benevolent and gorgeous goddess Swatty is here to provide assistance, together with her side-kicks, the Seven Lucky Gods from the Japanese mythology.</p><p>Even though the story is pretty much the same as in the previous game, the gameplay underwent significant enhancements. The interface is still traditional Japanese-style menu commands, but there are many more locations now, many of which can be freely accessed by clicking on them while on the main map. Once the player has reached the point where he can begin the physical seduction of the girl, the interface switches to point-and-click, with context-sensitive cursor for touching, kissing, etc. It is necessary to try different actions more than once to understand what the girl considers pleasant and what not, otherwise the girl might get angry and the game will be over. There are many more girls to seduce here than in the previous game, ranging from a school girl to a Catholic nun (seriously). There are also various extras (as the title implies), including an extensive album that arranges various pictures of the girls so that they tell her story, and an additional collection of stories, in which the hero can learn more about the girls he had met in the main game, and even interact with them again.</p>"},{"name":"Can Can Bunny Premiere","year":1996,"developer":"Cocktail Soft","url":"e#Can%20Can%20Bunny%20Premiere%20%28Japan%29%20%281M%29.zip","filesize":357168130,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Adult","desc":"<p>In this game, the player assumes the role of an ordinary Japanese young man who works in a restaurant. One day he comes home and finds seven strange creatures sitting at his table and discussing something you have no clue about. But before you decide to throw the uninvited guests out of your apartment, a beautiful green-haired woman appears. This is the goddess Swatty, and she has power over the Seven Lucky Gods, which the mysterious seven creatures turn out to be. Swatty feels pity for the lonely hero, and decides to help him to find a girlfriend.</p><p><em>Can Can Bunny Premier</em> is the fourth installment in the  Can Can Bunny series. Compared to its predecessors, it is the most pure Japanese-style adventure, without the strategy parts of the  previous game. The player chooses menu commands (\"Look\", \"Talk\", etc., as well as context-sensitive commands and dialogue choices) in order to advance the game. At several points it is possible to branch the story line, which mostly influences the amount of success the hero has had with a girl.</p>"},{"name":"Can Can Bunny Premiere 2 (Disc 1)","year":1996,"developer":"Cocktail Soft","url":"e#Can%20Can%20Bunny%20Premiere%202%20%28Japan%29%20%28Disc%201%29.zip","filesize":391977774,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga > Dating simulation > Japanese-style adventure > Life / social simulation > Contemporary > Comedy > Romance","desc":"<p>The goddess Swatty and the Seven Lucky Gods she commands are at it again, and they have bestowed upon you, the protagonist, a Star of Guidance to aid in your lack of fortuity in romantic affairs with the opposite sex. With six possible heroines to romance, where could things possibly go from here...?</p><p>Can Can Bunny Premier 2 is the sequel to Can Can Bunny Premier, and the fifth Can Can Bunny title. It is also the first title in the series to be released for Windows personal computers. The gameplay is quite similar to its predecessor, and continues in the vein of Cocktail Soft dating sim titles from this era.</p>"},{"name":"Can Can Bunny Premiere 2 (Disc 2)","year":1996,"developer":"Cocktail Soft","url":"e#Can%20Can%20Bunny%20Premiere%202%20%28Japan%29%20%28Disc%202%29%20%28Can%20Bani%20Himekuri%20Calendar%29.zip","filesize":310203807,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga > Dating simulation > Japanese-style adventure > Life / social simulation > Contemporary > Comedy > Romance","desc":"<p>The goddess Swatty and the Seven Lucky Gods she commands are at it again, and they have bestowed upon you, the protagonist, a Star of Guidance to aid in your lack of fortuity in romantic affairs with the opposite sex. With six possible heroines to romance, where could things possibly go from here...?</p><p>Can Can Bunny Premier 2 is the sequel to Can Can Bunny Premier, and the fifth Can Can Bunny title. It is also the first title in the series to be released for Windows personal computers. The gameplay is quite similar to its predecessor, and continues in the vein of Cocktail Soft dating sim titles from this era.</p>"},{"name":"Capcom Generation: Dai-1-shuu Gekitsuiou no Jidai","year":1998,"developer":"Capcom Co., Ltd.","url":"e#Capcom%20Generation%20-%20Dai-1-shuu%20Gekitsuiou%20no%20Jidai%20%28Japan%29.zip","filesize":295125437,"score":"","genres":"Action > Compilation > Top-down > Arcade > Shooter","desc":"<p>The first of Capcom's classic collections for PlayStation and Saturn includes the 194X shooter series with the following games:</p><ul><li>1942</li><li>1943</li><li>1943 Kai</li></ul>"},{"name":"Capcom Generation: Dai-2-shuu Makai to Kishi","year":1998,"developer":"Capcom Co., Ltd.","url":"e#Capcom%20Generation%20-%20Dai-2-shuu%20Makai%20to%20Kishi%20%28Japan%29.zip","filesize":337539831,"score":7.4,"genres":"Compilation","desc":"<p>The <i>Capcom Generation 2</i> compilation contains 3 games from the Ghost 'N Goblins series:</p><ul><p></p><li>Ghost 'N Goblins</li><li>Ghouls 'N Ghosts</li><li>Super Ghouls 'N Ghosts</li></ul>"},{"name":"Capcom Generation: Dai-3-shuu Koko ni Rekishi Hajimaru","year":1998,"developer":"Capcom Co., Ltd.","url":"e#Capcom%20Generation%20-%20Dai-3-shuu%20Koko%20ni%20Rekishi%20Hajimaru%20%28Japan%29.zip","filesize":521150194,"score":"","genres":"Compilation","desc":"<p>The third release in the <em>Capcom Generation</em> series, featuring four early but unrelated Capcom games:</p><ul><li>Vulgus</li><li>Son Son</li><li>HiGeMaru</li><li>Exed Exes</li></ul>"},{"name":"Capcom Generation: Dai-4-shuu Kokou no Eiyuu","year":1998,"developer":"Capcom Co., Ltd.","url":"e#Capcom%20Generation%20-%20Dai-4-shuu%20Kokou%20no%20Eiyuu%20%28Japan%29.zip","filesize":534593132,"score":"","genres":"Action > Compilation > Top-down > Arcade > Shooter","desc":"<p>Volume four of the <em>Capcom Generation</em> series, which includes three top-down shooter games ported from the arcade originals:</p><ul><li>Commando (Senjō no Ōkami)</li><li>Gun.Smoke</li><li>Mercs (Senjō no Ōkami II)</li></ul>"},{"name":"Capcom Generation: Dai-5-shuu Kakutouka-tachi","year":1998,"developer":"Capcom Co., Ltd.","url":"e#Capcom%20Generation%20-%20Dai-5-shuu%20Kakutouka-tachi%20%28Japan%29.zip","filesize":350602651,"score":"","genres":"Fighting","desc":"<p>Capcom Generation: Dai 5 Shuu Kakutouka-tachi is the fifth of five compilations for the Sega Saturn (and PlayStation) developed by Capcom.</p><p>Games included:<br>* Street Fighter II: The World Warrior<br>*Street Fighter II′: Champion Edition<br>*Street Fighter II′ Turbo: Hyper Fighting</p>"},{"name":"Casper","year":1996,"developer":"Funcom Oslo A/S","url":"e#Casper%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":430520490,"score":6.6,"genres":"Adventure > Diagonal-down > 2D scrolling > Real-time > Puzzle elements > Direct control > North America > Comedy > Licensed","desc":"<p>Based on the Casper film, the game puts you in the role of the friendly ghost trying to make a friend and a second chance at life instead of scaring everyone away.</p><p>The plot centers around the \"spoiled, grasping inheritor of Whipstaff Manor\" - Carrigan Crittenden.  She's after the treasure she thinks is hidden in the walls.  Casper will need the help of Dr. James Harvey - therapist to the dead - if he has any hope of succeeding in his adventures.</p><p>Casper will also have to deal with his uncles - Stretch, Stinkie, and Fatso, who just love to scare \"Fleshies\" and thwart Casper's efforts.  The gameplay is 3d - and is mostly puzzle solving, with Casper able to take a variety of forms and can manipulate objects.</p>"},{"name":"Castlevania: Symphony of the Night","year":1998,"developer":"Konami Computer Entertainment Tokyo, Inc."},{"name":"Cat the Ripper - 13Ninme no Tanteishi","year":1997,"developer":"Tonkinhouse","url":"e#Cat%20the%20Ripper%20-%2013Ninme%20no%20Tanteishi%20%28Japan%29.zip","filesize":490735322,"score":"","genres":"Adventure > 1st-person > Meditative / Zen > Graphic adventure > Point and select > Europe > Detective / mystery","desc":"<p>A game based on a Choose-Your-Own-Adventure book by Yamaguchi Masaya. You wake up dizzy and confused in a private detective's office and discover the corpse of the detective next to you. After searching the office for clues, you are confronted by two police officers. In hiding, you decide to discover the truth and catch the mysterious murderer called Cat the Ripper.</p>"},{"name":"Center Ring Boxing","year":1995,"developer":"Victor Entertainment Inc.","url":"e#Center%20Ring%20Boxing%20%28USA%29.zip","filesize":129190889,"score":7.4,"genres":"Sports > 3rd-person (Other) > Top-down > Boxing","desc":"<p><em>Center Ring Boxing</em> is an unlicensed 3-D polygon boxing game where the player can choose from 30 different male or female boxers and compete in six different weight divisions. They may also create their own boxer and use them to rise through the ranks to become champion choosing from one of five distinct styles of boxing.</p><p>There is also a trainer by the name of Snake that will help train the player as they progress thorough the game as well as become a selectable character along with a hidden character in two-player versus mode once the player becomes heavyweight champion. A practice mode also is present that will allow the player to get accustomed to the game's controls and features 12 different camera angles and a replay mode that will the player to view their previous fight in it's entirety.</p>"},{"name":"Chaos Control","year":1995,"developer":"Infogrames Multimedia SA","url":"e#Chaos%20Control%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":513912879,"score":5.6,"genres":"Action > 1st-person > Anime / Manga > Arcade > Rail shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>The year is 2071, the aggressive Kesh Rhan aliens have already destroyed the human colonies on Mars and Pluto, and now plan to wipe out all humans from Earth as well. You play as Jessica Darkhill, lieutenant and most skilled pilot of the Orbital Defence Forces. The counter-attack you are about to launch is the last hope to save the Earth of chaos. </p><p><em>Chaos Control</em> is a fast-paced shoot'em up featuring 3d pre-rendered environments, which means you cannot actually control the spaceship you are flying in, but are merely in charge of aiming at the various enemies appearing on screen.</p>"},{"name":"Chaos Seed: Fūsui Kairōki","year":1998,"developer":"Neverland Co., Ltd."},{"name":"Chase H.Q. + S.C.I.","year":1996,"developer":"Taito Corporation","url":"e#Taito%20Chase%20H.Q.%20%2B%20S.C.I.%20%28Japan%29.zip","filesize":38349791,"score":"","genres":"Action > Compilation > Racing / Driving > Behind view > Shooter > Direct control > Automobile > Vehicle simulator > Crime","desc":"<p>A compilation on one disc of the Japanese versions of the Arcade games ported to the Saturn:</p><ul><li>Chase H.Q.</li><li>S.C.I.: Special Criminal Investigation</li></ul>"},{"name":"Chō Aniki: Kyūkyoku Muteki Ginga Saikyō Otoko","year":1996,"developer":"Pre-Stage Inc."},{"name":"Chō Jikū Yōsai Macross: Ai Oboete Imasu ka","year":1997,"developer":"Scarab"},{"name":"Christmas NiGHTS into Dreams...","year":1996,"developer":"Sonic Team","url":"e#Christmas%20NiGHTS%20into%20Dreams...%20%28Europe%29.zip","filesize":576761224,"score":8,"genres":"Action > Side view > Direct control > Fantasy","desc":"<p><em>Christmas NiGHTS into Dreams...</em> is essentially a demo that was given away through various promotions and magazines. While it may have 'only' appeared to be a one-level demo of NiGHTS into Dreams... (Spring Valley), it is really a bit more.</p><p><em>Christmas NiGHTS into Dreams...</em>'s title screen, level backgrounds and even character models change according to the current season. Play it throughout an entire year and experience not only Christmas NiGHTS, but also Winter NiGHTS, New Year NiGHTS and NiGHTS: Limited Edition. Santa will appear on his sleigh on Christmas Day, and Reala will make a guest appearance on April Fool's Day, to mention only a few of its little cameos.</p><p>The gameplay is identical to that of <em>NiGHTS into Dreams...</em>, but it arguably has more longevity due to the Presents Box. The box contains unlockable artwork, promotional movies, Time Attack and Link Attack modes, Sonic as a playable character in the game, and more!</p>"},{"name":"Cleopatra Fortune","year":1997,"developer":"Natsume Co., Ltd.","url":"e#Cleopatra%20Fortune%20%28Japan%29.zip","filesize":424977314,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Falling block puzzle","desc":"<p><em>Cleopatra Fortune</em> is a falling-block puzzle game featuring a cutesy anime Egyptian theme. Groups of stones and gems of different shapes fall from the top of a well. Gems can be cleared by enclosing them within a group of stones, and stones can be cleared by making complete rows from them. Blocks will fall when those under them are cleared, which can create chains for more points.</p><p>The game includes three different play modes. First is a standard endless mode where play continues until the player is overwhelmed by the blocks. Second is a versus mode for two players. Last is a puzzle mode where the player is given a set field, a set sequence of drops, and a specific goal such as clearing all the gems or achieving a chain of a certain length. The puzzle mode has the player rescuing Cleopatra's friends who have been trapped in a pyramid by the evil Sphinx.</p>"},{"name":"Clockwork Knight 2: Pepperouchau's Adventure","year":1995,"developer":"SEGA Enterprises Ltd.","url":"e#Clockwork%20Knight%202%20-%20Pepperouchau%27s%20Adventure%20%28Europe%29.zip","filesize":275241466,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p><em>Clockwork Knight 2</em> is the second game featuring the adventures of Sir Tongara de Pepperouchau III. It has the same gameplay style (a mixture of 2D side-scrolling platformer with 3D elements) as its predecessor and Bug!. The story continues directly after the events of the first game: the brave hero has rescued Princess Chelsea, but she doesn't wake up. As the toys try to figure out how to solve this problem, the princess is kidnapped once again, and Pepper embarks on a journey to save her. </p><p>There are some minor additions to the gameplay formula, such as collectible cards scattered through the stages, forced side-scrolling levels in which Pepper rides his horse Barobaro who shoots projectiles from his head, and a mode that allows the player to fight all the bosses from both this game and the previous one.</p>"},{"name":"Clockwork Knight: Pepperouchau's Adventure","year":1994,"developer":"SEGA Enterprises Ltd.","url":"e#Clockwork%20Knight%20-%20Pepperouchau%27s%20Adventure%20%28Europe%29.zip","filesize":197408176,"score":6.9,"genres":"Action > 3rd-person (Other) > Side view > Platform","desc":"<p><em>Clockwork Knight</em> is a game that depicts the sometimes friendly, sometimes combative, secret lives of toys. Betsy has a huge number of toys that come to life in the absence of humans and normally play nicely with each other. In the opening introduction, the somewhat inept clockwork knight Pepperouchau is competing with some other knights for the affections of a princess who lives in the clock. Everyone is having a grand time until a rogue toy shows up through the air vent, absconds with the princess, and turns many of the other toys against Pepperouchau.</p><p>The gameplay consists of side scrolling action through various stages constructed of elaborate series of toys, traps, and common household items. The first stage is a quest through Betsy's room with lots of letter blocks, sharp crayons, and dollhouses precariously balanced on robots that tend to fall on you. Pepperouchau is armed with a key sword that has offensive use as well as the ability to open boxes that functions as warps to other areas. The second stage takes place in Betsy's brother's room. Kevin has a lot of engineering skill and has built an impressive network of cranes and trains that Pepperouchau will need to activate in order to clear the area. Watch out for the jet transformer boss at the end of the room.</p><p>Other stages include missions through other areas of the house including the kitchen and the attic. Throughout the game you also collect coins. 20 coins are worth a continue when you run out of lives. Further, you meet other friendly toys between levels who give you the opportunity to gamble with your earned coins.</p>"},{"name":"Code R","year":1998,"developer":"Quintet Co., Ltd.","url":"e#Code%20R%20%28Japan%29.zip","filesize":543068080,"score":"","genres":"Adventure > Racing / Driving > 3rd-person (Other) > Top-down","desc":"<p><em>Code R</em> is an unique 3D racing game mixed with a manga-like visual-novel style adventure game in a story mode (but all text is in Japanese). The player is a race driver, and in story mode, he can move around the city, visit special places and talk with various people, the game has even day and night cycles. </p><p>Besides the story mode, the player can race in 2 additional modes, time attack and battle mode. In time mode the player must pass all the routes as soon as possible. In battle mode, the player races against one opponent. The player can customize many car settings like transmission, suspension or breaks.</p>"},{"name":"College Slam","year":1996,"developer":"Torus Games Pty. Ltd.","url":"sega-saturn-champion-collection-updated/C/College%20Slam%20%28NA%29.zip","filesize":249446418,"score":6.7,"genres":"Sports > Diagonal-down > 2D scrolling > Arcade > Basketball > Licensed","desc":"<p>Part of the NBA Jam series of basketball games, College Slam allows you to choose from over 40 real college teams and take part in head-to-head games, tournament games, and season-long play. The gameplay is arcade-style two-on-two fast action featuring backboard shattering wild dunks, power-ups and other crazy moves. The game also features fight songs from all the available teams.</p>"},{"name":"Command & Conquer (Disc 1)","year":1996,"developer":"Westwood Studios, Inc.","url":"e#Command%20%26%20Conquer%20%28Europe%29%20%28En%2CFr%2CDe%29%20%28Disc%201%29%20%28GDI%29.zip","filesize":537649913,"score":8.1,"genres":"Strategy > Diagonal-down > Free-roaming camera > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Africa > Europe > Sci-fi / futuristic > War > Regional differences","desc":"<p><em>Command &amp; Conquer</em> develops ideas from Westwood's previous game Dune 2, forming a real-time strategy (RTS) game. The control system involves selecting units with the mouse and then directing them, while the opponents make their moves without waiting for a \"turn\" to end.</p><p>The game focuses on a war between two organizations, The Brotherhood of Nod and the Global Defense Initiative. The player can take control of either side for more than 15 missions. Both have different units and structures, including artillery, tanks and light infantry.</p><p>In most missions, a base needs to be built first in order to build new units and structures. Most important are the harvesters, which collect Tiberium and deliver it to a refinery, where it's converted into money, thus funding the construction of a base and an army.</p><p>The game also features FMV mission briefings and victory cutscenes.</p>"},{"name":"Command & Conquer (Disc 2)","year":1996,"developer":"Westwood Studios, Inc.","url":"e#Command%20%26%20Conquer%20%28Europe%29%20%28En%2CFr%2CDe%29%20%28Disc%202%29%20%28NOD%29.zip","filesize":542598072,"score":8.1,"genres":"Strategy > Diagonal-down > Free-roaming camera > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Africa > Europe > Sci-fi / futuristic > War > Regional differences","desc":"<p><em>Command &amp; Conquer</em> develops ideas from Westwood's previous game Dune 2, forming a real-time strategy (RTS) game. The control system involves selecting units with the mouse and then directing them, while the opponents make their moves without waiting for a \"turn\" to end.</p><p>The game focuses on a war between two organizations, The Brotherhood of Nod and the Global Defense Initiative. The player can take control of either side for more than 15 missions. Both have different units and structures, including artillery, tanks and light infantry.</p><p>In most missions, a base needs to be built first in order to build new units and structures. Most important are the harvesters, which collect Tiberium and deliver it to a refinery, where it's converted into money, thus funding the construction of a base and an army.</p><p>The game also features FMV mission briefings and victory cutscenes.</p>"},{"name":"Congo: The Movie - The Lost City of Zinj","year":1996,"developer":"Jumpin Jack Software, Inc.","url":"sega-saturn-champion-collection-updated/C/Congo%20-%20The%20Movie%20-%20The%20Lost%20City%20of%20Zinj%20%28NA%29.zip","filesize":452811033,"score":6.4,"genres":"Action > 1st-person > Shooter > Licensed","desc":"<p>This game is loosely based off of the movie of the same name.  The player is put in the role of a mercenary for the TraviCom Corporation who is sent in to find the Lost City of Zinj in an attempt to find the infamous diamond mine.  The story is told through FMV with original scenes made for the game and spliced footage from the movie into it.</p><p>The gameplay is a standard first-person shooter, roaming through four different environments and shooting at various enemies such as giant spiders, mutant dragonflies, monstrous lizards and of course the dangerous gray apes.  The starts out with a hand gun and can pick up more powerful weapons as well as medical packs to restore their health.</p>"},{"name":"Contra: Legacy of War","year":1997,"developer":"Appaloosa Interactive Corporation","url":"sega-saturn-champion-collection-updated/C/Contra%20-%20Legacy%20of%20War%20%28NA%29.zip","filesize":386253395,"score":6.3,"genres":"Action > Diagonal-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The first Contra game for the 32-bit consoles and released exactly 10 years after the first Contra.</p><p>Unlike the original Contra and follow-ups, this is an overhead-view 2D shooter (with 3D graphics) that plays more like a side-scrolling Commando or Mercs.</p><p>The graphics are truly 3D; an option allows you to view them as red/blue images, and some packages of Contra: LoW come with 3D glasses to garner full enjoyment of the feature.</p><p>Hidden within the game – accessible on a certain level and through a secret code – are a mini-version of Gyruss and a Pac-Man-like game called Pactank.</p>"},{"name":"Conveni 2, The: Zenkoku Chain Tenkai da!","year":1998,"developer":"Access co., ltd.","url":"e#Conveni%202%2C%20The%20-%20Zenkoku%20Chain%20Tenkai%20da%21%20%28Japan%29.zip","filesize":26959278,"score":"","genres":"Simulation > 1st-person > Isometric > Anime / Manga > Managerial / business simulation","desc":"<p>In this latest The CONVENI 2, you run convenience stores as you try to expand your chain nationwide. As the owner, try to boost sales and increase your number of stores to achieve the goals on each map. The game's graphics have been completely retooled and more maps have been added! A high-speed mode has also been added! Even playability has been improved! This is a complete convenience simulation in which you can send spies to rival stores to collect information and even buy out your competitors! Go for it! Expand till you are a nationwide chain!</p>"},{"name":"Conveni, The: Ano Machi o Dokusen seyo","year":1997,"developer":"Access co., ltd.","url":"e#Conveni%2C%20The%20-%20Ano%20Machi%20o%20Dokusen%20seyo%20%28Japan%29.zip","filesize":15581892,"score":"","genres":"Simulation > Top-down > Anime / Manga > Managerial / business simulation","desc":"<p>Become the owner of a convenience store franchise, and experience the fun of arranging products and customizing your store to meet land features and seasons!</p><p>Can you bring in lots of customers?</p><p>Can you succeed in opening up ten stores?</p><p>Can you serve a million customers?</p><p>...A store owner faces so many challenges!</p>"},{"name":"Corpse Killer","year":1995,"developer":"Digital Pictures, Inc."},{"name":"Courier Crisis: The Saga of the Modern Fatalist","year":1997,"developer":"New Level Software, Inc.","url":"e#Courier%20Crisis%20-%20The%20Saga%20of%20the%20Modern%20Fatalist%20%28USA%29.zip","filesize":239167179,"score":6.5,"genres":"Action > Behind view > Bike / Bicycling","desc":"<p>Courier Crisis is a game that simulates the life of a bicycle courier.  As you peddle around a virtual city, you must pick up packages from grumpy customers, and then deliver them to other grumpy customers before a timer runs out.</p><p>The 3D city and the traffic in Courier Crisis are your biggest obstacles.  You can pull off crazy jumps and huge tricks that help you dodge them.  There are many different areas of the city in which you can do delivery runs, such as the wharf, China town, the slums, and the city center. In total, there are more than 250 missions to complete.  As you complete missions, you earn money that you can use to buy better rides.</p>"},{"name":"Creature Shock (Disc 1)","year":1996,"developer":"Argonaut Software Ltd.","url":"e#Creature%20Shock%20%28Japan%29%20%28Disc%201%29.zip","filesize":419809071,"score":6.9,"genres":"Action > 1st-person > Video backdrop > Rail shooter > Sci-fi / futuristic > Horror","desc":"<p>The earth is overpopulated and mankind must find a second home. The spaceship Amazon is sent to investigate Saturn and Jupiter for possible colonization. Near the end of its mission, all contact is lost with the ship except for a distress beacon. The player is part of the crew sent to the Amazon's last known location to find out what happened.</p><p><em>Creature Shock</em> is a first-person shooter with Full Motion Video and arcade-like elements. Aliens of all sizes and types will try to destroy the team, but each one has a weak point that can be exploited. The fighting takes place on the surface of asteroids and within mazes of passageways underground. </p><p>There are also two 3D sections where the player gets to pilot the ship.</p>"},{"name":"Creature Shock (Disc 2)","year":1996,"developer":"Argonaut Software Ltd.","url":"e#Creature%20Shock%20%28Japan%29%20%28Disc%202%29.zip","filesize":420143299,"score":6.9,"genres":"Action > 1st-person > Video backdrop > Rail shooter > Sci-fi / futuristic > Horror","desc":"<p>The earth is overpopulated and mankind must find a second home. The spaceship Amazon is sent to investigate Saturn and Jupiter for possible colonization. Near the end of its mission, all contact is lost with the ship except for a distress beacon. The player is part of the crew sent to the Amazon's last known location to find out what happened.</p><p><em>Creature Shock</em> is a first-person shooter with Full Motion Video and arcade-like elements. Aliens of all sizes and types will try to destroy the team, but each one has a weak point that can be exploited. The fighting takes place on the surface of asteroids and within mazes of passageways underground. </p><p>There are also two 3D sections where the player gets to pilot the ship.</p>"},{"name":"CrimeWave","year":1996,"developer":"Eidos Interactive Limited","url":"e#Crimewave%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":51597932,"score":6.1,"genres":"Action > Racing / Driving > Diagonal-down > Shooter > Direct control > Automobile > Vehicular combat > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Crime","desc":"<p>Welcome to the urban jungle.  Crime is out of control and the cops have been replaced by bounty hunters like you.  Fire up one of eight heavily-armed vehicles and buzz through eight zones of devastation.  Use guns, grenades, rocket launchers, tire treads...whatever it takes.</p><p>Car combat game released only on the Sega Saturn.</p>"},{"name":"Criticom","year":1997,"developer":"Kronos Digital Entertainment","url":"e#Criticom%20%28USA%29.zip","filesize":360257267,"score":5.8,"genres":"Action > Side view > Fighting > Sci-fi / futuristic","desc":"<p><em>Criticom</em> is a one-on-one fighting game where 8 diverse fighters from across the galaxy vie for a crystal artifact. The game features a sci-fi backstory that involves mystery and intrigue surrounding the crystal and each of the 8 fighters is given a unique storyline to explain why he or she is so interested in the artifact. Among the colorful characters are a giant lizard man named Gorm, a ninja lady named Yenji, a killing robot named S.I.D., and a mysterious vampire-like creature named Demonica who places little value on clothing.</p><p>The fighting action takes place on a round, elevated platform. Each fighter begins the fight with a full power meter and one power meter refill in reserve that is activated when the primary meter is depleted. Thus, there are no rounds. The fight runs until one fighter is knocked out (no more power in their meter), one is knocked out of the arena (or steps/jumps out), or the time runs out.</p>"},{"name":"Croc: Legend of the Gobbos","year":1997,"developer":"Argonaut Software Ltd.","url":"e#Croc%20-%20Legend%20of%20the%20Gobbos%20%28Europe%29.zip","filesize":475533818,"score":7.3,"genres":"Action > Behind view > Platform > Fantasy","desc":"<p><em>Croc: Legend of the Gobbos</em> is a 3D platform game where you play as a crocodile. </p><p>Small hairy creatures called Gobbos live peacefully on an island until one day they see a basket drifting in the water. After pulling it ashore they find a baby crocodile inside it. The Gobbos raise him as their own until he is three times their size. The game starts with the island being attacked by the evil Baron Dante and his minions. They capture most of the Gobbos, but the crocodile manages to escape. Now you need to rescue the Gobbos and fight Baron Dante and his minions.</p><p>As you make progress you visit several islands with different themes like a forest, snow, desert or castles. Along the way you have to collect crystals (which serve as health), rescue Gobbos and defeat enemies and bosses. You can attack enemies with your tail, destroy crates with a jump down attack and, in some stages, it is possible to swim. Secret stages and a secret island can be unlocked if all Gobbos are rescued and all jigsaw pieces in the secret stages are collected.</p>"},{"name":"Crow, The: City of Angels","year":1996,"developer":"Gray Matter Inc."},{"name":"Crows: The Battle Action for SegaSaturn","year":1997,"developer":"Athena Co., Ltd.","url":"sega-saturn-champion-collection-updated/C/Crows%20-%20The%20Battle%20Action%20for%20Sega%20Saturn%20%28JP%29.zip","filesize":285566570,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Beat 'em up / brawler > Direct control > Japan (Modern/Futuristic) > Licensed","desc":"<p><em>Crows: The Battle Action</em> is a beat-'em-'up game based on Hiroshi Takahashi's delinquent manga series. Players can take control of one out 2 available characters, with 2 extra characters being unlockable as players clear the game.</p><p>Apart from the standard punches and kicks, the game offers special attacks which drain a bit of health when successfully used and a dash option as well. Weapons and objects can also be picked up and used against enemies. The game is linear, opting to put players through a lot of short stages which last for a few minutes before switching to a new one.</p>"},{"name":"Crusader: No Remorse","year":1996,"developer":"ORIGIN Systems, Inc.","url":"e#Crusader%20-%20No%20Remorse%20%28USA%29.zip","filesize":440222505,"score":7.6,"genres":"Action > Diagonal-down > Isometric > Shooter > Direct control > Sci-fi / futuristic > Regional differences","desc":"<p>You are a silencer, the elite of the elite soldiers of World Economic Consortium. You are used to orders of hunting down the Resistance, a ragtag band of rebels committing sabotage and other acts of terrorism against the WEC, but slowly, you realized the WEC is not quite what it appears to be... then one day you and two other Silencers, your best buddies, were ambushed by a WEC mech patrol when it was supposed to be a routine mission. You alone survived. It is clear that the Silencer is being silenced... and the only place to turn is the Resistance... </p><p><em>Crusader: No Remorse</em> is the first in the series, which is best described as a 2D isometric shooter. Your silencer can roll left, roll right, kneel, jump, run, and perform other acrobatic moves. You get plenty of different weapons, from assault rifles and shotguns to grenade launchers and lasers, to really exotic weapons like microwave cannon, EMP discharger, and even plasma cannons. You're up against the full military might of the WEC, from simple guards to full-fledged Guardmechs and elite forces (though none are quite as good as you). You can find supplies and money off of killed enemies (if you left a body, that is, and some of the extreme weapons don't). You'll often need to bypass traps, open doors, disable alarms, take out security cameras, and more. The action is intense, and there's usually a bit of puzzle involved. It's often a matter of exploring the map to find a switch or a terminal with the code that'll let you access another part or another level of the map. </p><p>Between missions you can chat in the Resistance base and/or buy/sell weapons. You can also find recharge stations to replenish your energy and health (you can also find batteries and first aid kits too). The missions range from simple sabotage to rescue.</p>"},{"name":"Cyber Doll","year":1996,"developer":"I'Max Corp.","url":"e#Cyber%20Doll%20%28Japan%29.zip","filesize":392011045,"score":"","genres":"Role-playing (RPG) > Side view > Anime / Manga > Turn-based > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In year 1999, the ancient prophecy of Nostradamus was fulfilled: humanity was attacked by a terrible disease. It was called Muscular Loosening Disease, or MLD. Before soon, the humans were on the verge of extinction. Under the supervision of the US president, scientists initiated the Human Machiners Project - human body parts were replaced or strengthened by artificial ones, that could resist MLD. But the result was that such humans lost their true nature and became immortal...</p><p>Years have passed. In 2039, the futuristic megapolis Zero City is threatened by mutant members of a mysterious organization, who call themselves \"Dark Visitor\". You, the hero of the game, join the combat unit Debugger, and are assigned to a mission of locating and exterminating the Dark Visitor. Your personal motive is revenge: your family was killed by monsters when you were a child...</p><p><em>Cyber Doll</em> is a futuristic RPG. You fight randomly appearing enemies in turn-based combat, that is viewed from a platform perspective. You have separate hit points for your body parts, and so do your enemies. You have a wide variety of weapons, including small guns that can target one body part of the enemy, and machine guns that cause damage to the entire body. Targeting body parts adds to combat strategy: for example, if the HP of enemy legs is depleted, he won't be able to move and to attack you in close range.</p>"},{"name":"Cyber Speedway","year":1995,"developer":"NexTech Corporation","url":"e#Cyber%20Speedway%20%28Europe%29.zip","filesize":349449196,"score":6.6,"genres":"Racing / Driving > 1st-person > Behind view > Track racing > Sci-fi / futuristic","desc":"<p><em>Cyber Speedway</em> is a hover sled racing game set in the distant future. The civilizations of many planets have decided to end all wars. Instead, they will settle their differences in the Cyber Race. You are the best hope to protect and expand the Earth's power.</p><p><em>Cyber Speedway's</em> main game is the story mode. The story follows your character as he qualifies as Earth's driver, and makes his way through a series of planetary races to become the champion. In each of the races, you must place first to continue.</p><p>Each race consists of 5 laps around a high-speed track. You have missiles you can use to slow down your opponents and take the lead.</p>"},{"name":"Cyberbots: Fullmetal Madness","year":1997,"developer":"Capcom Co., Ltd.","url":"e#Cyberbots%20-%20Fullmetal%20Madness%20%28Japan%29%20%281M%29.zip","filesize":489594609,"score":7.3,"genres":"Action > Side view > Arcade > Fighting > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>A sci-fi one-on-one fighting game in which several characters converge in the wastes of the far future and must fight each other for their own personal reasons aboard giant battle mechs.</p><p>As in One Must Fall, you select your pilot (who provides the storyline) and the mech (who provides the moves and stats) separately, and can also replace a few limbs and accessories to enhance your mech's capabilities.</p><p>The game uses 2D sprites for the graphics and controls and plays as most 2D fighting games, with both characters facing each other in a side-scrolling stage and with your attacks and moves being triggered by different combinations of controller motions and button presses. Features either a single player story-based tournament, or a 2-player Vs mode.</p>"},{"name":"Cyberia","year":1996,"developer":"Xatrix Entertainment, Inc.","url":"e#Cyberia%20%28Europe%29.zip","filesize":337332321,"score":7.1,"genres":"Action > 1st-person > 3rd-person (Other) > Video backdrop > Puzzle elements > Rail shooter > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In the year 2027, the world is controlled by two rival superpowers, the western-bloc Free World Alliance and the east-bloc Cartel. Transmissions from an FWA spy reveal the location of a secret multi-national laboratory deep within Siberia, the Cyberia Complex, where a mysterious weapon is being developed. FWA leader Devlin frees a cyber-hacker named Zak from prison and sends him to infiltrate the complex and discover the true nature of the Cyberia weapon.</p><p>Unfortunately, the Cartel is also interested in the weapon and will stop at nothing to get it. Not only must Zak make his way past the Cartel forces sent to stop him, but he must also overcome the Cartel agents which have already seized control of the complex. To make matters worse the Cyberian scientist's genetically engineered creations are running rampant in the same area as the weapon and Devlin also appears to have something up his sleeve.</p><p><em>Cyberia</em> is an action game with puzzle sequences and a heavy reliance on scripted events and cutscenes. The game allows limited navigation between locations, which usually lead to a puzzle or (more often) action scenes that involve either shooting down planes with a gun turret or navigating various flying vehicles, destroying enemies in a Star Wars: Rebel Assault-style confrontations.</p>"}]