[{"name":"D (France) (Disc 1)","year":1995,"developer":"Rozner Labs Software Group","url":"e#D%20%28France%29%20%28Disc%201%29.zip","filesize":490370871,"score":6.4,"genres":"Adventure > 1st-person > Puzzle elements > Quick Time Events (QTEs) > Horror","desc":"<p>The story begins in 1997. It's the dead of night in the city of Los Angeles, and there has been a mass murder at a general hospital on the outskirts of downtown. The perpetrator is the director of the hospital, Richter Harris. He has shut himself up in the hospital and taken a number of patients as hostages, leaving the police helpless and unable to move in. After hearing the situation, Richter's only daughter, Laura Harris, rushes to Los Angeles from San Francisco to the tragic scene at the hospital. Upon entering, Laura finds herself transported to an old mansion, while the disembodied voice of her father pleads with her to leave. Nevertheless, she must press forward to save her father and herself.</p><p><em>D</em> is a puzzle game requiring Laura to solve esoteric inventory puzzles on a very strict time limit. Each of the game's four discs must be completed in about thirty minutes each, and saving is not an option. The time is kept track of using Laura's pocket watch. The pocket watch can also be used to supply hints for puzzles, but after three uses the glass will shatter and it will stop working. The game also has multiple endings.</p>"},{"name":"D (France) (Disc 2)","year":1995,"developer":"Rozner Labs Software Group","url":"e#D%20%28France%29%20%28Disc%202%29.zip","filesize":446040027,"score":6.4,"genres":"Adventure > 1st-person > Puzzle elements > Quick Time Events (QTEs) > Horror","desc":"<p>The story begins in 1997. It's the dead of night in the city of Los Angeles, and there has been a mass murder at a general hospital on the outskirts of downtown. The perpetrator is the director of the hospital, Richter Harris. He has shut himself up in the hospital and taken a number of patients as hostages, leaving the police helpless and unable to move in. After hearing the situation, Richter's only daughter, Laura Harris, rushes to Los Angeles from San Francisco to the tragic scene at the hospital. Upon entering, Laura finds herself transported to an old mansion, while the disembodied voice of her father pleads with her to leave. Nevertheless, she must press forward to save her father and herself.</p><p><em>D</em> is a puzzle game requiring Laura to solve esoteric inventory puzzles on a very strict time limit. Each of the game's four discs must be completed in about thirty minutes each, and saving is not an option. The time is kept track of using Laura's pocket watch. The pocket watch can also be used to supply hints for puzzles, but after three uses the glass will shatter and it will stop working. The game also has multiple endings.</p>"},{"name":"D-Xhird (Japan)","year":1997,"developer":"NexTech Corporation","url":"e#D-Xhird%20%28Japan%29%20%281M%29.zip","filesize":297905157,"score":"","genres":"Action > Side view > Arcade > Fighting","desc":"<p><em>D-Xhird</em> is 3D arcade, weapon-based 1vs 1 fighting game, similar to Battle Arena Toshinden (1 character from Battle Arena Toshinden, Eiji Shinjo comes back as unlockable character). The player can choose 1 from 10 initially playable characters (+4 unlockable heroes), each with own weapon (for example, Sabrina uses stun baton, Lucifer uses scythe, Karen has 2 chakrams). Game is based on 3d arenas - players can strafe and be thrown out from ring. Gameplay is typical - player must beat opponent to go to next opponent.</p>"},{"name":"Daikōkai Jidai: Gaiden","year":1998,"developer":"KOEI Co., Ltd."},{"name":"Daikoukai Jidai II (Japan)","year":1997,"developer":"KOEI Co., Ltd.","url":"e#Daikoukai%20Jidai%20II%20%28Japan%29.zip","filesize":62455107,"score":7.3,"genres":"Simulation > Strategy > Diagonal-down > Naval / watercraft","desc":"<p>In the first Uncharted Waters game, it was the 15th century and the New World was discovered. Now in <em>New Horizons</em>, it is the early 16th century and the age of exploration and sea trade is underway. Players choose from any one of six adventurers (scenarios), each with their own distinctive but intertwining plot, to embark on a quest of sailing, seamanship and exploration. The six characters are:<em> </em><em>João Franco</em>* is the son of Duke Leon Franco, the hero of the first Uncharted Waters game and an influential man in Portugal. His father wants to make him into a strong man and so decides to send him out to sea. Young Joao is tasked with learning the skills of the sailor (he is the only character who starts at level one) and embarking on a quest of discovery; reaching the far east and eventually looking for the secret of Atlantis.</p><ul><li><p><strong>Catalina Erantzo</strong> is a Spanish naval officer who believes her beloved and her brother were both murdered by the Portuguese armada. Vowing revenge she turns to a life of piracy and soon becomes a red haired scourge of the seas.</p></li><li><p><strong>Pietro Conti</strong> is a indebted man, having inherited the financial woes of the Conti family. When the Duchess Franco hires him to spy on her son, he accepts the job and obtains a ship. Pietro hopes to use these resources to seek out valuable treasure and clear up his family's debt.</p></li><li><p><strong>Ernst Von Bohr</strong> is a geographer who is teaching classes in Holland. He yearns to leave the classroom and sail the high seas, living a life of adventure that he has only read about in books. When his friend, Mercator offers to finance his initial voyage in exchange for cartography information about the world, Ernst is given the opportunity to live out his dream.</p></li><li><p><strong>Ali Vezas</strong> is a poor orphaned child living in Istanbul and serving others. He dreams of becoming his own master and making his own fortune across foreign lands. A twist of fate aides in providing him with small loans, with which he is able to afford his first ship and sail out with a cargo hold full of goods...</p></li><li><p><strong>Otto Baynes</strong> styles himself a Royal Knight of the British Empire, in the service of his majesty the king. Promoted to Admiral of the British fleet, the kingdom is worried about the increased naval power of Spanish fleets. Otto is given a letter of marque by the king and ordered to terrorize the Spanish Fleet. Equipping himself simply at first, Otto strives to become a great privateer in the name of king and country.</p></li></ul><p>Regardless of the character chosen, <em>Uncharted Waters: New Horizons</em> is a top-down sailing simulation. At sea, players control the direction of their ship, where speed is affected by the number/health of the crew, the wind and the currents. Players can navigate anywhere there is water (though some ships are not ocean worthy) and discover interesting landmarks and new ports. Upon landing at a port, the view is also top-down and the player can enter different buildings, each with unique services and goods. These include: the Inn, the Item Shop, the Shipyard, the Tavern, the Castle, the Guild Hall, the Church, the Merchant and the Harbor. It's up to the player to earn enough gold to keep the crew fed and financed and keep the fleet repaired. Primary methods of earning money are through sea trade, accepting jobs from the guild, gambling and battle with other ships.</p><p>During naval combat, the game becomes a turn-based top-down strategy game, with the player moving ships in order to obtain trajectories needed to fire cannons at enemy ships, or run alongside enemy vessels in order to board them. If the player's flagship attacks the flagship of the enemy fleet, they can challenge the opponent to a duel. If accepted, the game changes to a side-view of the two captains engaged in a fight. During this sequence, the player can only choose which fighting maneuver (strike, thrust, parry, lash) they wish to engage in.</p>"},{"name":"Daisuki (Japan) (Disc 1)","year":1997,"developer":"Success Corp.","url":"e#Daisuki%20%28Japan%29%20%28Disc%201%29.zip","filesize":466186429,"score":"","genres":"Adventure > Simulation > Anime / Manga > Dating simulation > Interactive fiction / text adventure > Japanese-style adventure > Mini-games > Visual novel > Sci-fi / futuristic > Romance","desc":"<p>It is the year 2296, and the protagonist has just transferred into Union Academy, a prestigious military flight academy. Plenty of cute young ladies are attending this academy along with you, but will you be able to make it along with these rookies, or perhaps even find a girlfriend...?</p><p><em>Daisuki</em> (lit. \"I Love You\") is a simulation game with romantic elements. The player is tasked with monitoring their character's stats by performing various activities, and the opportunity to form a relationship with one of the game's numerous heroines will present itself as well. During conversational scenes, the player will often be prompted to make branching choices in dialogue. There is also an assortment of mini-games.</p>"},{"name":"Daisuki (Japan) (Disc 2)","year":1997,"developer":"Success Corp.","url":"e#Daisuki%20%28Japan%29%20%28Disc%202%29.zip","filesize":77964655,"score":"","genres":"Adventure > Simulation > Anime / Manga > Dating simulation > Interactive fiction / text adventure > Japanese-style adventure > Mini-games > Visual novel > Sci-fi / futuristic > Romance","desc":"<p>It is the year 2296, and the protagonist has just transferred into Union Academy, a prestigious military flight academy. Plenty of cute young ladies are attending this academy along with you, but will you be able to make it along with these rookies, or perhaps even find a girlfriend...?</p><p><em>Daisuki</em> (lit. \"I Love You\") is a simulation game with romantic elements. The player is tasked with monitoring their character's stats by performing various activities, and the opportunity to form a relationship with one of the game's numerous heroines will present itself as well. During conversational scenes, the player will often be prompted to make branching choices in dialogue. There is also an assortment of mini-games.</p>"},{"name":"Darius Gaiden","year":1995,"developer":"Taito Corporation","url":"e#Darius%20Gaiden%20%28Europe%29.zip","filesize":354231434,"score":7.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Shooter > Sci-fi / futuristic","desc":"<p>Take command of your Silverhawk fighters once again as you battle to take back the planet Darius from the evil forces that had overpowered it! Converted from the Taito 1994 arcade game for the Windows platform (9x and NT).</p>"},{"name":"Darius II","year":1996,"developer":"Taito Corporation","url":"e#Darius%20II%20%28Europe%29.zip","filesize":426591903,"score":7.3,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>Long time ago, the planet of Darius went into ruin but Proco and Tiat of Darius gave birth to a new planet and named it Orga. After the passing of many centuries, Proco Jr. and Tiat Young receive a strange radio broadcast from the galaxy. They discover the radio broadcast is a mayday signal from another descendant of Darius. They board the Silverhawk, preparing to defeat an evil force and journey to the galaxy.</p><p><em>Darius II</em>, or <em>Sagaia</em> as it is known in the West, is the second installment in Taito's shoot 'em up series. Its main distinguishing features are the non-linear level system and the enemies, which are different kinds of seafood.</p>"},{"name":"Dark Legend","year":1995,"developer":"Data East Corporation"},{"name":"Dark Savior","year":1996,"developer":"Climax Entertainment","url":"e#Dark%20Savior%20%28Europe%29.zip","filesize":297874355,"score":7.7,"genres":"Action > Diagonal-down > Puzzle elements > Fantasy > Regional differences","desc":"<p>The bounty hunter Garian is entrusted with the task of accompanying a monster named Bilan to a prison island. On the ship, Bilan escapes, and Garian must stop him before he reaches the captain's cabin...</p><p>...at which point the game's narrative is split into three different scenarios (called <em>Parallels</em>), which depend on how much time it has taken the player to reach the captain. <em>Parallel I</em> occurs if the player needed more than four minutes; in this scenario, Bilan escapes and goes on a killing spree, and Garian must catch him again. Should the player need between three and four minutes to reach the captain, <em>Parallel II</em> is triggered; Garian defeats Bilan, but the monster undergoes a surprising transformation, and Garian realizes that a deeper plot has to be uncovered. Finally, if the player manages to reach the captain under three minutes, <em>Parallel III</em> begins, with Bilan being confined, but escaping once again. </p><p><em>Dark Savior</em> is a 3D action game with elements of platforming, puzzle-solving, and battles that resembles fights of a fighting game. The player navigates Garian through 3D environment, but the view switches to isometric perspective once a fight is triggered.</p>"},{"name":"Dark Seed II","year":1997,"developer":"Destiny Software Productions, Inc."},{"name":"Darklight Conflict","year":1997,"developer":"Rage Games Ltd.","url":"e#Darklight%20Conflict%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.zip","filesize":395918067,"score":6.8,"genres":"Action > Simulation > 3rd-person (Other) > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>A space combat game like Wing Commander; you control a space ship, as the lone man trying to save humanity from not one, but two alien races. It also has multiplayer modes like Race and Tag for IPX network users.</p>"},{"name":"Darkseed (Japan)","year":1995,"developer":"Cyberdreams, Inc.","url":"e#Darkseed%20%28Japan%29.zip","filesize":23944156,"score":6.9,"genres":"Adventure > 3rd-person (Other) > Fixed / flip-screen > Graphic adventure > Puzzle elements > Point and select > Horror","desc":"<p><em>Dark Seed</em> is an adventure game which capitalizes on the drawings of famous horror designer H. R. Giger as a source of background artwork and inspiration.</p><p>You play Mike Dawson, an ad company manager who, in pursuit of his goal in life to become a writer, purchases a solitary mansion in a small town called Woodland Hills. Although the low cost and hush-hush transactions when purchasing the house do raise your suspicion, the solitary environment and sheer beauty of the house crush common sense and you decide to buy the house. That's when trouble begin. Upon reaching the house, you suddenly feel tired. You find a bed and fall asleep...</p><p>... and wake up from a terrible dream, only to find out that your life has just become a worse nightmare: an unknown source has implanted a seed of darkness in your mind, and you only have three days to find a way to stop it.</p>"},{"name":"Darkstalkers 3","year":1998,"developer":"Capcom Co., Ltd."},{"name":"Daytona USA","year":1995,"developer":"AM R&D Dept. #2","url":"e#Daytona%20USA%20%28Europe%29.zip","filesize":379786384,"score":7.7,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>A port of the most successful arcade racer ever, the home versions of Daytona USA include the same elements that made the original version successful: three highly detailed tracks, arcade driving physics that challenge the player to find the best trajectory to make a flying lap without kissing the rails and beating the checkpoint timer. The 40 cars of the Easy race (later named 3-7 Speedway), one of the stalwarts of the original version, are also present in this version.</p><p>These home versions include a new mode (Saturn or PC Mode, depending on the platform) where the three tracks are played without the timer, and optionally in mirror mode, using one of the bonus cars (with additional abilities such as driving on grass or hitting the rails without losing speed) and in one of three lengths: Normal (identical to the arcade original), Grand Prix (2.5 times longer) and Endurance (10 times longer). </p><p>On the downside, detail and frame rate suffered a drop to fit the game into the limited hardware of the Saturn and Personal Computers, and lacking any kind of multiplayer, comparing to the two to eight player rumbles of the arcade version.</p>"},{"name":"Daytona USA C.C.E. Net Link Edition","year":1998,"developer":"SEGA-AM2 Co., LTD.","url":"e#Daytona%20USA%20C.C.E.%20Net%20Link%20Edition%20%28USA%29.zip","filesize":476461639,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Licensed","desc":"<p>This is a <em>Daytona USA: CCE</em> version that takes advantage of the online feature of the Net Link, an accessory for the US Saturn that among other things, allowed web browsing, IRC, e-mail, and of course, online gaming with the games that supported it. This game, at first, could be just brought from Sega directly, but nowadays it can be found in several specialized shops, plus the second hand market. It included two manuals, one in colour (the original from Daytona USA: CCE), which also served as a cover, and another in black and white, where it explained how to play online. Besides online gaming, you could also play offline. Nowadays it's still possible to play online with a direct call modem-to-modem, but not anymore through the more handy NetLink Zone, since the servers were shut down in 2001.</p>"},{"name":"Daytona USA: Championship Circuit Edition","year":1996,"developer":"SEGA-AM2 Co., LTD.","url":"e#Daytona%20USA%20-%20Championship%20Circuit%20Edition%20%28USA%29.zip","filesize":470491415,"score":7.4,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Licensed","desc":"<p>All of its predecessor and then some.  More tracks, many more cars (hidden cars as well), smarter AI, more music (no more lyrics for the in-game race music either), broader 2-player gameplay, more refined arcade physics...and on top of everything else- BETTER GRAPHICS!  The first Daytona on the Saturn boasted some hefty visuals, great for displaying the Saturn's power to the masses at the console's birth; but for the Saturn to be revered for everything it was, Sega (and AM2) had to make something a little flashier.  All the graphics in the game have been updated...both the cars and tracks have higher polygon count, better texture mapping; the framerate is QUITE noticeably improved, everything is very smooth.</p>"},{"name":"Dead or Alive (Japan)","year":1997,"developer":"Tecmo, Ltd.","url":"e#Dead%20or%20Alive%20%28Japan%29%20%282M%29.zip","filesize":386505997,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting","desc":"<p>The first in the Dead or Alive series, and features many of the same features that has made the DoA series so popular today; somewhat realistic combat, good character design, and scantily clad women whose breasts bounce a lot.</p><p>The game doesn't mess too much with a background story- it's a 3D one on one fighter that takes place within an arena of limited space.  Each character has their own unique way of fighting, their own abilities, and even their own hobbies and likes.  (For example, Ryu Hayabusa- yes, he of Ninja Gaiden fame- likes sushi, mountain climbing, and fishing.)</p>"},{"name":"Death Crimson (Japan)","year":1996,"developer":"Ecole Software Corp.","url":"e#Death%20Crimson%20%28Japan%29.zip","filesize":99257563,"score":"","genres":"Action > 1st-person > Rail shooter > Direct control > Europe","desc":"<p><em>Death Crimson</em> is a first-person rail shooter. Doctor and former mercenary Combat Echizen has spent the past ten years researching KOT Syndrome, a disease that has spread across Europe and transformed countless people into monstrous creatures. Eventually, he learns of a connection between the disease and the Death Crimson - a mysterious gun he found in some ruins ten years prior during his time in the Marumara Army. Echizen then resolves to wield the Death Crimson (controlled by the player via light gun) against those infected with the Syndrome and get to the heart of what's going on.</p>"},{"name":"Death Throttle: Kakuzetsu Toshi kara no Dasshutsu (Japan)","year":1996,"developer":"Imagexcel","url":"e#Death%20Throttle%20-%20Kakuzetsu%20Toshi%20kara%20no%20Dasshutsu%20%28Japan%29.zip","filesize":474194502,"score":6.5,"genres":"Action > Racing / Driving > 1st-person > Shooter > Automobile > Cyberpunk / dark sci-fi","desc":"<p>In <em>Quarantine</em>, you play the part of a taxi driver, desperate to escape from the violent prison city of Kemo. Deliver passengers to their destinations, so you can earn money to upgrade your cab, and take on undercover missions in the hope that somehow you can find a way out. An impressive array of cab-mounted weaponry will help you to survive.</p>"},{"name":"Deep Fear (Disc 1)","year":1998,"developer":"Sega AM7 R&D Division","url":"e#Deep%20Fear%20%28Europe%29%20%28Disc%201%29.zip","filesize":512024695,"score":7.7,"genres":"Action > 3rd-person (Other) > Survival horror > Sci-fi / futuristic > Horror","desc":"<p>All contact is lost with a submarine on a routine mission which then crashes into an underwater facility. The occupants of the underwater facility are ordered to board the submarine and find out what went wrong. On board the vessel, strange things are happening which are taking control of the crew. The crew are mutating due to an alien parasite and members of the search team have to figure out what is happening and how to stop it!</p><p>The game is played via a third person view which is just behind the character and you look over his shoulder. The game is based underwater in a submarine so the developers have added a claustrophobic feeling by giving some areas a limited amount of air so you have to run through to activate the air circulation system. Controls are your typical Resident Evil style which is you pull the Right shoulder button to draw your gun, your d-pad to aim and then a button to shoot. Along your journey of the submarine, you will need to find objects such as keycards to unlock doors and better weapons.</p>"},{"name":"Deep Fear (Disc 2)","year":"","developer":"","url":"e#Deep%20Fear%20%28Europe%29%20%28Disc%202%29.zip","filesize":487184437,"score":7.7,"genres":"Action > 3rd-person (Other) > Survival horror > Sci-fi / futuristic > Horror","desc":"<p>All contact is lost with a submarine on a routine mission which then crashes into an underwater facility. The occupants of the underwater facility are ordered to board the submarine and find out what went wrong. On board the vessel, strange things are happening which are taking control of the crew. The crew are mutating due to an alien parasite and members of the search team have to figure out what is happening and how to stop it!</p><p>The game is played via a third person view which is just behind the character and you look over his shoulder. The game is based underwater in a submarine so the developers have added a claustrophobic feeling by giving some areas a limited amount of air so you have to run through to activate the air circulation system. Controls are your typical Resident Evil style which is you pull the Right shoulder button to draw your gun, your d-pad to aim and then a button to shoot. Along your journey of the submarine, you will need to find objects such as keycards to unlock doors and better weapons.</p>"},{"name":"Defcon 5","year":1995,"developer":"Millennium Interactive Ltd.","url":"e#Defcon%205%20%28Europe%29.zip","filesize":271100997,"score":6.3,"genres":"Action > Strategy > 1st-person > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In the far future, conflict is at an all-time low and outdated defence bases are being vacated and replaced with automated software. You play as an engineer sent to update one such base. Just after uploading the automating code, the base is suddenly invaded by unknown assailants from the air and ground. You must rely on your wits and the defence software to fend them off.</p><p>The main game takes place in a first-person view inside the complex. Trams connect the maze-like living areas to a handful of manned turrets outside. You must shuttle between shooting down waves of fighters in the turrets, and scouring the base levels for card keys during the downtime.</p><p>A third consideration is the \"Virtual Operating System\" controlling all major base functions. You use this interface to repair damage from attacks, monitor intruders, and place robot sentries to guard key passages. As you find more access keys, you can increase the software's efficiency to the point that you can command turrets remotely, or set them to auto-attack with a high degree of success. </p><p>As defending the base becomes more automated and efficient, you have more time to search the levels for keys. Your ultimate goal is to find the clearance to self-destruct the base, defend your escape shuttle, and get out alive.</p>"},{"name":"Densetsu no Ogre Battle (Japan)","year":1996,"developer":"Quest Corporation","url":"e#Densetsu%20no%20Ogre%20Battle%20%28Japan%29.zip","filesize":437629921,"score":8.3,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Isometric > Real-time > Turn-based > Fantasy","desc":"<p>Twenty-five years ago Empress Endora conquered the entire continent of Zetegenia. Her reign proved to be tyrannical, and people of different social classes and positions began to long for a better future. Eventually, a resistance movement called the Liberation Army was formed. The protagonist (whose name and background are chosen by the player) takes command of the new army, and leads his allies towards a revolution.</p><p><em>Ogre Battle</em> has elements of a real-time strategy game and a tactical RPG. The player manages a large army consisting of characters belonging to a vast amount of different classes. These classes include military specializations as well as mythological creatures such as dragons, angels, hellhounds, undead trees, etc. Each class its own unique characteristics and abilities in battle. For example, vampires and werewolves can only be deployed when the battle takes place during the night.</p><p>The player moves troops in real time on the tactical map. Individual battles between units are handled in a turn-based RPG style. The player is able to select general commands for the battle, as well as use powerful tarot cards for special techniques. Characters level up, change classes and grow stronger over the course of the game. The player can also purchase items in towns.</p><p>The protagonist's reputation is affected by the player's decisions during the storyline. The player can make choices that may prove to be popular or unpopular with the nation in contact with the Liberation Army. In addition, every character has his or her own alignment, ranging from good to evil. Liberating towns with evil characters may lower the army's reputation. These and other choices affect the plot's development and eventually lead to one of the thirteen possible endings.</p>"},{"name":"Densha de Go! EX","year":1998,"developer":"Taito GM R&D Sect. #2"},{"name":"Derby Stallion","year":1999,"developer":"ParityBit"},{"name":"Deroon Dero Dero (Japan)","year":1996,"developer":"Tecmo, Ltd.","url":"e#Deroon%20Dero%20Dero%20%28Japan%29%20%281M%29.zip","filesize":553909672,"score":"","genres":"Puzzle > Real-time > Falling block puzzle","desc":"<p><em>Tecmo Stackers</em> is a puzzle game in the vein of Tetris with the objective of the game is to match up four blocks of the same color to eliminate those colors. When the player eliminates those colors in a chain reaction, those same blocks will be dropped on either the computer opponent or a friend. There are also bombs that can be used to clear out large sections at one time.</p><p>There are four game modes to choose from: <em>Arcade</em> <em>Competition</em>, <em>Time Trials</em> and <em>Chain Reaction</em>, each with their own set objectives and difficulty with more than 20 levels with photo backdrops.</p>"},{"name":"Desire (Japan) (Disc 1)","year":1997,"developer":"C's Ware","url":"e#Desire%20%28Japan%29%20%28Disc%201%29.zip","filesize":473090149,"score":6.9,"genres":"Adventure > 1st-person > 3rd-person (Other) > Anime / Manga > Adult > Detective / mystery","desc":"<p>A research institute is located on a remote island. Apparently the researches being conducted there have some sort of an unofficial link with the military, so journalist Albert Macdgul is sent to investigate and see what he can find out. At the same time Tina, a young girl, is washed ashore on the island with no recollection of what has happened to her or who she is. Meanwhile, the technical manager Makoto Izumi seems to think that something weird is going on with the researches being conducted.</p><p><em>Desire</em> is a Japanese-style adventure game. The game is played via a standard text interface where the player selects commands from a menu, interacting with other characters and places. The game consists of four chapters which make up the same storyline, but viewed by different characters. In each chapter the player will see the events and situations from different angles and uncover layers of the main plotline.</p><p>The computer versions of the game have scenes with explicit nudity and sexual situations, which are not present in the console releases.</p>"},{"name":"Desire (Japan) (Disc 2)","year":1997,"developer":"C's Ware","url":"e#Desire%20%28Japan%29%20%28Disc%202%29%20%281M%29.zip","filesize":198928560,"score":6.9,"genres":"Adventure > 1st-person > 3rd-person (Other) > Anime / Manga > Adult > Detective / mystery","desc":"<p>A research institute is located on a remote island. Apparently the researches being conducted there have some sort of an unofficial link with the military, so journalist Albert Macdgul is sent to investigate and see what he can find out. At the same time Tina, a young girl, is washed ashore on the island with no recollection of what has happened to her or who she is. Meanwhile, the technical manager Makoto Izumi seems to think that something weird is going on with the researches being conducted.</p><p><em>Desire</em> is a Japanese-style adventure game. The game is played via a standard text interface where the player selects commands from a menu, interacting with other characters and places. The game consists of four chapters which make up the same storyline, but viewed by different characters. In each chapter the player will see the events and situations from different angles and uncover layers of the main plotline.</p><p>The computer versions of the game have scenes with explicit nudity and sexual situations, which are not present in the console releases.</p>"},{"name":"Destruction Derby","year":1996,"developer":"Reflections Interactive Limited","url":"e#Destruction%20Derby%20%28Europe%29.zip","filesize":590434529,"score":7.3,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicular combat","desc":"<p>You probably feel like a crash test dummy when you're playing this game - it's not only a racing game, but you get points for wrecking your enemies! The amount of points you get depends on how you hit them ... e.g. you get more points for getting them do a 360 other than driving into their sides at high speed. The game has more to offer: a head to head mode with only two cars or the legendary destruction derby itself - a huge arena, every car starts at the edge of it, and then - have a nice crash!</p>"},{"name":"Detana Twinbee Yahoo! Deluxe Pack (Japan)","year":1995,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"e#Detana%20Twinbee%20Yahoo%21%20Deluxe%20Pack%20%28Japan%29%20%283M%29.zip","filesize":593784049,"score":"","genres":"Action > Compilation > Top-down > Anime / Manga > Arcade > Shooter","desc":"<p>Prepare to enter the bizarre side of Konami's creative mind with their <em>Twinbee</em> series! Take control of the fighter ships, Twinbee, Winbee, and Gwinbee, as you and a friend save some strange and bizarre worlds from even more bizarre enemies and freaks! This pack contains the arcade games Detana!! TwinBee (released in a home version for the PC Engine) and Twinbee Yahoo! (never released separately for home), in all their arcade glory!</p>"},{"name":"Devil Summoner - Soul Hackers (Japan) (Disc 1)","year":1998,"developer":"Atlus Co., Ltd.","url":"e#Devil%20Summoner%20-%20Soul%20Hackers%20%28Japan%29%20%28Disc%201%29.zip","filesize":397745817,"score":7.4,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Cyberpunk / dark sci-fi","desc":"<p>Amami City is a Japanese megalopolis of the near future. In this huge city, each house has a computer, and all computers are linked to one big network. The flow of information is being controlled by the government, and software companies create huge virtual locations-networks. An eighteen-year-old member of a hacker group called Spookies and his companions gain access to one of these networks - a virtual city called Paradigm-X, created by Algon Soft. However, an accident occurs during the hacking, and a mysterious demon who calls herself Nemissa emerges. The Spookies must find the true reason behind Nemissa's arrival, and confront a shadowy organization known as Phantom Society, which employs demon summoners.</p><p><em>Soul Hackers</em> is similar in its themes, structure and gameplay to its predecessor, as well as to the main Shin Megami Tensei series. Set in a futuristic cyberpunk environment, the game contains many characteristic elements such as two weapon types (swords and guns) for the main hero, a female companion who can learn and cast magic spells, and a party of six active combatants, of which four are demons. Like in many other <em>Megami Tensei</em> games, the player can communicate with randomly encountered demons and recruit them into the party by selecting appropriate dialogue choices. These demons can also be fused with each other to create more powerful ones.</p><p>The loyalty system from the previous game returns; however, this installment makes it easier to raise the loyalty level of a demon. By taking a demon into battles and repeatedly performing action it likes (indicated by its comments to the player's choices), the player can gradually make it fully controllable and obedient. Attack and magic power of the demons raises together with their loyalty levels.</p><p>New in this installment is a limited ability to fuse demons outside of specific fusion places, by using the protagonist's demon-summoning computer (COMP). The player can also purchase and install software on this computer, which has a variety of functions, from combat-aiding and mapping utilities to the possibility to save the game anywhere in the dungeon.</p>"},{"name":"Devil Summoner - Soul Hackers (Japan) (Disc 2)","year":1998,"developer":"Atlus Co., Ltd.","url":"e#Devil%20Summoner%20-%20Soul%20Hackers%20%28Japan%29%20%28Disc%202%29.zip","filesize":417125415,"score":7.4,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Cyberpunk / dark sci-fi","desc":"<p>Amami City is a Japanese megalopolis of the near future. In this huge city, each house has a computer, and all computers are linked to one big network. The flow of information is being controlled by the government, and software companies create huge virtual locations-networks. An eighteen-year-old member of a hacker group called Spookies and his companions gain access to one of these networks - a virtual city called Paradigm-X, created by Algon Soft. However, an accident occurs during the hacking, and a mysterious demon who calls herself Nemissa emerges. The Spookies must find the true reason behind Nemissa's arrival, and confront a shadowy organization known as Phantom Society, which employs demon summoners.</p><p><em>Soul Hackers</em> is similar in its themes, structure and gameplay to its predecessor, as well as to the main Shin Megami Tensei series. Set in a futuristic cyberpunk environment, the game contains many characteristic elements such as two weapon types (swords and guns) for the main hero, a female companion who can learn and cast magic spells, and a party of six active combatants, of which four are demons. Like in many other <em>Megami Tensei</em> games, the player can communicate with randomly encountered demons and recruit them into the party by selecting appropriate dialogue choices. These demons can also be fused with each other to create more powerful ones.</p><p>The loyalty system from the previous game returns; however, this installment makes it easier to raise the loyalty level of a demon. By taking a demon into battles and repeatedly performing action it likes (indicated by its comments to the player's choices), the player can gradually make it fully controllable and obedient. Attack and magic power of the demons raises together with their loyalty levels.</p><p>New in this installment is a limited ability to fuse demons outside of specific fusion places, by using the protagonist's demon-summoning computer (COMP). The player can also purchase and install software on this computer, which has a variety of functions, from combat-aiding and mapping utilities to the possibility to save the game anywhere in the dungeon.</p>"},{"name":"Die Hard Arcade","year":1997,"developer":"Sega Technical Institute","url":"e#Die%20Hard%20Arcade%20%28Europe%29.zip","filesize":542036045,"score":7.5,"genres":"Action > Side view > Arcade > Beat 'em up / brawler > Quick Time Events (QTEs) > Licensed","desc":"<p><em>Die Hard Arcade</em> is a 3D beat 'em up game based on the first <em>Die Hard</em> movie. One or two players work their way up and down a skyscraper in attempting to rescue the President's kidnapped daughter.A large number of fighting moves are available through the simple controls of punch, kick and jump, plus movement.Many weapons are available from knives and broken bottles to machine guns and rocket launchers. Other objects can be picked up and used as weapons such as chairs, an aerosol and lighter combo and even a grandfather clock!Between several of the stages are reaction tests that require a button to be pressed quickly, usually punch, kick or jump. Failure means an extra fight has to be won often with little or no reward in terms of items.The climax sees the heroes fighting the mastermind (who has many swords on his person) on the roof of the skyscraper.Also included is an old Sega arcade game, Deep Scan, used to gain extra credits for the main game.</p>"},{"name":"Die Hard Trilogy","year":1997,"developer":"Probe Entertainment Ltd.","url":"e#Die%20Hard%20Trilogy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.zip","filesize":463258546,"score":7.2,"genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Rail shooter > Shooter > Direct control > North America > Crime > Licensed","desc":"<p><em>Die Hard Trilogy</em> lets players guide New York cop John McClane through three arcade-style games based on each of the three <em>Die Hard</em> movies. Each movie is represented through a totally different style, making this a \"3 games in 1\" style package. </p><p><strong>Die Hard</strong> is a third person action/adventure through thirty floors of the Nakatomi Tower high-rise. Terrorists have interrupted the company's Christmas party and taken hostages. As McClane, the player must search for hostages through computer, construction, maintenance, and executive levels. McClane's default pistol holds infinite ammo, and the player can collect limited-ammo machine guns and grenades inside the levels. Walls turn transparent when they intersect the camera, allowing players to follow McClane through hallways and rooms with ease. After all the hostages on a level have been rescued, the player has 30 seconds to locate a bomb sent down by elevator, then use that elevator to move to the next level. </p><p><strong>Die Hard 2: Die Harder</strong> is a first-person arcade gun game, nearly identical to Virtua Cop. Terrorists have attacked Washington/Dulles Airport. The player automatically moves through the airport and surrounding areas \"on rails,\" shooting bad guys that appear from behind the scenery. Weapon upgrade icons can be shot to be collected, and either use limited ammo, or are retained until the player is hit (identical to Lethal Enforcers). Players can also destroy parts of the environment by shooting it, which can be used to take out nearby terrorists (with explosions, or by shooting overhead items to drop on them). This game supports pad controls, or any of the PlayStation's gun controllers. </p><p><strong>Die Hard With A Vengeance</strong> has players racing through New York City streets in a variety of vehicles, trying to locate bombs before they explode. A strict timer ticks off the next explosion, and the player is guided only by a direction arrow and the vocal suggestions of their co-driver. Bombs are hidden inside everyday objects (like phone booths and benches) and are defused by ramming them, which activates the timer on the next bomb. Occasional \"bomb cars\" must be chased and rammed until their life bar is depleted. Powerups can be collected by running over icons in the streets, and include extra time, turbo boosts, and jumps to rocket over obstacles.</p><p>All three games are exaggeratedly bloody (players can run over pedestrians in Die Hard 3 and wipe the blood away with windshield wipers). Each of the three games also uses a combination of textured polygons and sprites to generate their worlds, resulting in warping textures and some quirky \"paper doll\" effects.</p>"},{"name":"Digital Dance Mix Vol. 1: Namie Amuro (Japan)","year":1997,"developer":"SEGA-AM2 Co., LTD.","url":"e#Digital%20Dance%20Mix%20Vol.%201%20-%20Namie%20Amuro%20%28Japan%29%20%28Rev%20A%29%20%2811M%29.zip","filesize":392298134,"score":"","genres":"Simulation > 3rd-person (Other) > Mini-games > Music / rhythm > Licensed","desc":"<p><em>Digital Dance Mix</em> is a rhythm based game featuring songs by Namie Amuro, a j-pop singer. There are three different features this game includes. Digital Dance is focused on stage dancing where the player has full control of the camera and can select the song, a costume for the 3D character modeled after Namie Amuro, and the stage and background where the character will be dancing. Sing It focuses on singing part featuring the same songs where the player needs to match lyrics with the song. The setup for character and stage works the same way as in Digital Dance.</p><p>The third and last thing on the menu is called Presents where the game presents four mini-games. Beside mini-games the player can also do the general sound setup and check Namie's discography by clicking on the profile button.</p><p>Four mini-games are included:* Chase The Dance: the player need to press the right button to match dance to the song in question</p><ul><li><p>Sweet 16 Cards: a memory card game where the player has to match card pairs showing the same dance pose</p></li><li><p>Door My Sunshine: a puzzle game where the player has to build the door using puzzle tiles</p></li><li><p>A Walk in the Maze: the player navigates a character through the maze toward the designated goal area</p></li></ul>"},{"name":"Digital Monster Ver. S: Digimon Tamers","year":1998,"developer":"Tose Co., Ltd."},{"name":"Digital Pinball","year":1996,"developer":"KAZe Co., Ltd.","url":"e#Digital%20Pinball%20%28Europe%29.zip","filesize":521033634,"score":"","genres":"Simulation > Isometric > Pinball > Horror","desc":"<p>Digital Pinball: Necronomicon is the successor to Digital Pinball: Last Gladiators. Like the title indicates, the theme of and inspiration to the game is derived from the fictional book Necronomicon and the general work of horror author H.P. Lovecraft.</p><p>The game features three different tables, which can be played separately or in the so-called \"Realms Mode\", where you start with a fixed table and have to achieve a certain mount of progress to move on to the other tables.</p><p>Like with its predecessor, the tables are displayed in an isometric view, similar to the Pro Pinball series. There is an ingame manual which explains the scoring mechanics (which include a multiball mode) of each table. The game also offers a two player mode.</p>"},{"name":"Digital Pinball: Last Gladiators Ver.9.7 (Japan)","year":1997,"developer":"KAZe Co., Ltd.","url":"e#Digital%20Pinball%20-%20Last%20Gladiators%20Ver.9.7%20%28Japan%29.zip","filesize":582659316,"score":"","genres":"Simulation > Top-down > Pinball","desc":"<p>This rerelease of Digital Pinball: Last Gladiators features rebalanced gameplay, adjusted ball physics, and the ability to save multiple scores per table instead of just one. It also includes a playable demo of their recently-released pinball game Digital Pinball: Necronomicon.</p>"},{"name":"Discworld II - Missing Presumed...!","year":1997,"developer":"Perfect Entertainment, Ltd.","url":"e#Discworld%20II%20-%20Missing%20Presumed...%21%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":438208086,"score":7.8,"genres":"Adventure > 3rd-person (Other) > Graphic adventure > Puzzle elements > Point and select > Fantasy > Licensed","desc":"<p><em>Mortality Bytes</em> casts players again in the role of Rincewind, from the first game.</p><p>Death, the grim reaper, who normally ushers the Discworld inhabitants into the afterlife, is on an extended vacation. This means that those whose \"time is up\" are faltering around in limbo. Now it's up to Rincewind to bring him back or suffer the fate of immortality.</p><p>Gameplay is divided into 4 Acts. There are many locations to explore and a multitude of obstacles in Rincewind's path to overcome. Conversations with characters and interaction with inventory objects is necessary to move ahead.</p><p>The game features unique humour similar to the previous game.</p>"},{"name":"DoDonPachi (Japan)","year":1997,"developer":"CAVE Co., Ltd.","url":"e#DoDonPachi%20%28Japan%29.zip","filesize":482937658,"score":8,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>DoDonPachi</em> is Cave's sequel to their 1995 arcade release DonPachi. Like its predecessor, <em>DoDonPachi</em> is a vertical-scrolling and military- and robot-themed manic shooter featuring a giant mecha bee for a final boss. The player's ship and the gameplay are virtually the same as in <em>DonPachi</em>, with one of three weapons selected at start then levelled-up by collecting dropped power-ups.</p>"},{"name":"Dōkyūsei","year":1996,"developer":"Elf Co., Ltd."},{"name":"Dōkyūsei 2","year":1997,"developer":"Elf Co., Ltd."},{"name":"DonPachi (Japan)","year":1996,"developer":"CAVE Co., Ltd.","url":"e#DonPachi%20%28Japan%29.zip","filesize":226318108,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>DonPachi</em> is a 1995 vertical manic shoot-'em-up originally in arcades and was the first game from the developer Cave. Settings are mainly woodland and enemies are military vehicles and robots, culminating in the final boss, a huge robotic bee. One of three weapon configurations is chosen at start and then levelled up through dropped power-ups. <em>DonPachi</em> was ported to the Sega Saturn and Sony Playstation in 1996.</p>"},{"name":"Doom","year":1997,"developer":"id Software, Inc.","url":"e#Doom%20%28Europe%29.zip","filesize":587620363,"score":7,"genres":"Action > Compilation > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Horror","desc":"<p>This release of <em>Doom</em> is based on The Ultimate Doom and Doom II and contains most of the levels and enemies from both games as well as about half a dozen exclusive maps.</p><p>The Doom maps are based off the Jaguar version and hence feature the same simplifications as that release. The PC Ultimate Doom and Doom II maps were converted especially for this release and also feature some simplifications, though not to the degree of the Doom maps. Some Doom II enemies have been added to the Doom and Ultimate Doom maps.</p><p>The engine has been upgraded to a 32 bit renderer allowing for smoother distance shading and more notably, in the PS1 version, coloured lighting. This version of Doom features also entirely new sounds and music.</p>"},{"name":"Doraemon - Nobita to Fukkatsu no Hoshi (Japan)","year":1996,"developer":"Epoch Co., Ltd.","url":"e#Doraemon%20-%20Nobita%20to%20Fukkatsu%20no%20Hoshi%20%28Japan%29.zip","filesize":343042677,"score":"","genres":"Action > Side view > Anime / Manga > Platform > Sci-fi / futuristic > Licensed","desc":"<p>One winter, the robotic blue cat from the future, Doraemon, takes Nobita and his friends on a trip into outer space. However, while they're flying across the galaxy, they wind up making an emergency landing on a strange planet after a collision... and are attacked by strange robots as soon as they land! Now, Nobita and his friends must figure out what's happened on this strange planet, and find a way to repair their ship and get home!</p><p><em>Doraemon: Nobita to Fukkatsu no Hoshi</em> (\"Doraemon: Nobita and the Planet of Revival\") is a side-scrolling action platformer, and one of the many titles based on the long-running children's cartoon. The game is divided into short platform stages, each with a specific objective or goal that must be completed to move on. Between stages, there are voiced visual novel-style sequences which move the story forward. There are sometimes choices available in these sections, which can affect which stage the player reaches next.</p>"},{"name":"Double Switch","year":1995,"developer":"Digital Pictures, Inc."},{"name":"Doukoku Soshite...","year":1998,"developer":"Data East Corporation"},{"name":"Dragon Ball Z: Idainaru Dragon Ball Densetsu (Japan)","year":1996,"developer":"BEC Co., Ltd.","url":"e#Dragon%20Ball%20Z%20-%20Idainaru%20Dragon%20Ball%20Densetsu%20%28Japan%29.zip","filesize":372588115,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p><em>Idainaru Dragon Ball Densetsu</em> is a game that adds another <em>Dragon Ball</em> to the franchise of the same name and starts with the events of the Saiyan Saga and the fight with Vegeta and Nappa.</p><p>In <em>Idainaru Dragon Ball Densetsu</em> you don’t have your natural one on one fights. At the beginning of each fight you are given a total of 4 fighters (up to 6 later) from which you have to choose the 3 that you would like to participate in the battle that follows. Each fighter has 2 bars – a green and a yellow one. The green represents the life force and the yellow the power force which is depleted with every attack you do. At the bottom of the screen there is a blue bar and a red one that form a gauge called Power Balance. The reason for this gauge to be there is because your attacks don’t affect the enemies’ life bar directly. By continuously attacking the enemy the bar that represents your power (blue bar) increases while that of the enemy (red bar) decreases. When the blue bar covers all the gauge a random attack sequence, from the current character you’re controlling, is initiated and that’s how you can actually injure your opponents. The same can happen to you though if the enemy’s red bar covers all the gauge.</p>"},{"name":"Dragon Ball Z: Shinbutouden (Japan)","year":1995,"developer":"Tose Co., Ltd.","url":"e#Dragon%20Ball%20Z%20-%20Shinbutouden%20%28Japan%29.zip","filesize":429885707,"score":"","genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Fighting > Licensed","desc":"<p><em>Dragon Ball Z: Shin Butōden</em> is a 2D fighting game which maintains (unlike PSX's DBZ: Ultimate Battle 22) the classic split-screen mode all 16 bits fighting games based on the Akira Toriyama's most famous series enjoyed, but now you will have the possibility to choose from no less than 27 characters, among them: Super Saiyajin Son Goku, Super Saiyajin Son Goku (3rd level), Son Gohan, Son Goten, Vegeta, Young Trunks, Trunks, Gotenks, Piccolo Diamoah, Kulilin, Tenshinhan, Kamesennin, Zarbon, Recoom, Ginew, Freeza, A-18, A-16, Cell, Kaioushin, Dabura, Majin Buu, Super Buu, Mr. Satan, The Great Saiyaman, Young Son Gokou and Gogeta. Also, you will be able to show your abilities in the Story Mode, Versus Mode, Group Battle Mode, Tournament Mode, or the very Mr. Satan Mode, in which you play as Mr. Satan betting on who will win each match.</p>"},{"name":"Dragon Force","year":1996,"developer":"J-Force","url":"e#Dragon%20Force%20%28Europe%29.zip","filesize":288874186,"score":8.2,"genres":"Strategy > Diagonal-down > 2D scrolling > Isometric > Anime / Manga > Real-time > RPG elements > Fantasy","desc":"<p>The world of Legendra was ruled by benevolent goddesses, but the last of them, Astea, was challenged by a dark god named Madruk. In order to defeat Madruk, Astea created a powerful dragon, who eventually emerged victorious and was able to seal Madruk away.</p><p>Years have passed. Legendra is now divided into eight kingdoms. One of them, Fandaria, is ruled by a monarch named Goldark. The other kings have heard rumors that Goldark is planning to take over Legendra by conquering all the other kingdoms. Everyone is preparing for the war, without realizing that the ancient evil is about to raise its head once again...</p><p><em>Dragon Force</em> is a real-time strategy game (RTS). The player can choose one of the six monarchs (plus two additional ones that become available once the game is completed) with their unique scenarios. The gameplay is divided into three modes: management, overworld movement, and battle. Management mode allows the player to assign generals, decide the fate of prisoners, prepare the army for battles, etc. Navigation on the map is done in real time; once two warring armies have reached the same spot, the player is taken to a separate battle screen. The battles also evolve in real time, the goal usually being killing or capturing enemy general. If all the soldiers are killed, the two generals can opt for a duel that will decide the outcome of the battle.</p><p>Each kingdom has unique \"strong\" fighter types, which the player should use to target the weaknesses of the opposing armies. Each fighter type also has his own special techniques and abilities.</p>"},{"name":"Dragon Master Silk","year":1997,"developer":"Datam Polystar"},{"name":"DragonHeart: Fire & Steel","year":1996,"developer":"Funcom Oslo A/S","url":"e#DragonHeart%20-%20Fire%20%26%20Steel%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":381176361,"score":4.9,"genres":"Action > Side view > 2D scrolling > Fantasy > Licensed","desc":"<p>This game is a tie-in for the movie directed by Rob Cohen starring Dennis Quaid and Sean Connery as the voice of Draco.</p><p>DragonHeart puts you in the sweaty medieval shoes of dragon hunter Bowen, as he faces the last dragons still surviving, and then ends up befriending one, Draco. With his help, he goes after King Einon, a former pupil of the dragon hunter, who has turned to evil.</p><p>Dragonheart's gameplay is quite similar to the Golden Axe series. Hack'n'slash your way through the nine levels of the game, killing dragons, befriending Draco and then going after Einon with Draco's help (who will toast everything in the way with his flame breath).</p>"},{"name":"Druid: Daemons of the Mind","year":1998,"developer":"Synthetic Dimensions PLC"},{"name":"Duke Nukem 3D","year":1997,"developer":"3D Realms Entertainment, Inc.","url":"e#Duke%20Nukem%203D%20%28Europe%29.zip","filesize":498073200,"score":8.1,"genres":"Action > 1st-person > Shooter > Direct control > North America > Sci-fi / futuristic > Adult > Comedy > Regional differences","desc":"<p>Aliens have landed in futuristic Los Angeles and it's up to the Duke to bring the pain and show them the door. After the initial entries of side-scrolling platform games, <em>Duke Nukem 3D</em> introduces a first-person perspective to the series and turns the game into a full-fledged shooter with 2.5D graphics.</p><p>Duke's arsenal includes pistols, pipe bombs, laser trip mines, Nordenfelt guns, a chain gun and various rocket launchers, but also his mighty foot to kick enemies. The game sports a high level of interactivity. Many objects in the environment can be broken or interacted with, such as pool tables, arcade machines, glass, light switches and security cameras. The protagonist is also able to hand strippers dollars to have them remove their top.</p><p>The main character regularly delivers commentary on the events through one-liners. There are twenty-eight levels, divided over three episodes, set in locations such as streets, a church, a space station, a Japanese villa, a football field and many modern environments. Enemies mainly include aliens, mutated humans and members of the police force that have been turned into Pig Cops. Next to weapons, Duke also has access to medikits, steroids to enhance his speed, night vision, protective boots, a hologram known as the \"holoduke\", and a jetpack to reach higher areas. Most of the gameplay is action-oriented, but there is also an amount of puzzles needed to progress or access secret areas.</p><p>The game includes network play through the IPX protocol, for deathmatch and cooperative games.</p><p>While the port for the Sega Saturn features, among other things, a new secret level called Area 51, the Sony PlayStation version adds a whole new 7 level long episode called Plug 'N' Pray with new enemies and rearranged music.</p>"},{"name":"Dungeon Master Nexus (Japan)","year":1998,"developer":"Victor Interactive Software, Inc.","url":"e#Dungeon%20Master%20Nexus%20%28Japan%29.zip","filesize":162847980,"score":"","genres":"Role-playing (RPG) > 1st-person > Real-time > Puzzle elements > Fantasy","desc":"<p><em>Dungeon Master Nexus</em> is the first game in the Dungeon Master series using a 3D graphics engine. The game features 3 dungeons with 15 levels in total. Upon entering the ground level of the dungeon, the player is to compose his party made up of up to 4 heroes from the \"Hall of Champions\". Throughout the game, the player finds scrolls with spells composed of 6 different symbols which can be used my magicians. Most monsters and adversaries (mummies, trees, goblins, knights, dragons) making appearance in the game are also featured in the original Dungeon Master game, as well as the final boss. The dungeon structure has been conserved as well as some of the puzzles to be solved.</p>"},{"name":"Dungeons & Dragons Collection (Japan) (Disc 1) (Tower of Doom)","year":1999,"developer":"Capcom Co., Ltd.","url":"e#Dungeons%20%26%20Dragons%20Collection%20%28Japan%29%20%28Disc%201%29%20%28Tower%20of%20Doom%29.zip","filesize":456307854,"score":7.4,"genres":"Action > Compilation > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Direct control > Fantasy > Licensed","desc":"<p>The <em>Dungeons &amp; Dragons Collection</em> is a compilation of Capcom's <em>Dungeons &amp; Dragons</em> series, comprised of the coin-op arcade games Dungeons &amp; Dragons: Tower of Doom and Dungeons &amp; Dragons: Shadow Over Mystara. Gameplay is in the beat 'em up style <em>à la</em> Streets of Rage.</p>"},{"name":"Dungeons & Dragons Collection (Japan) (Disc 2) (Shadow over Mystara)","year":1999,"developer":"Capcom Co., Ltd.","url":"e#Dungeons%20%26%20Dragons%20Collection%20%28Japan%29%20%28Disc%202%29%20%28Shadow%20over%20Mystara%29.zip","filesize":541265382,"score":7.4,"genres":"Action > Compilation > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Direct control > Fantasy > Licensed","desc":"<p>The <em>Dungeons &amp; Dragons Collection</em> is a compilation of Capcom's <em>Dungeons &amp; Dragons</em> series, comprised of the coin-op arcade games Dungeons &amp; Dragons: Tower of Doom and Dungeons &amp; Dragons: Shadow Over Mystara. Gameplay is in the beat 'em up style <em>à la</em> Streets of Rage.</p>"}]