[{"name":"F1 Challenge","year":1995,"developer":"Bell Corporation","url":"e#F1%20Challenge%20%28Europe%29.zip","filesize":388295945,"score":7.5,"genres":"Racing / Driving > Simulation > Behind view > Automobile > Track racing > Vehicular combat > Licensed","desc":"<p><em>F1 Challenge</em> was the only Formula One title released on the SEGA Saturn, giving the player the opportunity to control five authentic Formula One cars and their drivers (Michael Schumacher, Damon Hill, Jean Alesi, Ukyo Katayama and Mika Häkkinen), with the ability to tweak their car before races, ranging from tire pressure, tire type, wing angle, etc.</p><p>There are six tracks to choose from: Hockenheim, Monte Carlo, Suzuka and three different configurations for a fictional track, Neo City, each with their own hairpin turns and fast straightaways. The player can choose from two behind the car views (no cockpit view is available) along with a pop-up screen that acts as a rear view mirror. Features a FOCA (Formula One Constructors Association) license which allows the use of thirteen teams with twenty-six drivers from the 1995 season from which the above mentioned five are the only ones playable.</p>"},{"name":"Falcom Classics (Japan) (Disc 1) (Game Disc)","year":1997,"developer":"Victor Interactive Software, Inc.","url":"e#Falcom%20Classics%20%28Japan%29%20%28Disc%201%29%20%28Game%20Disc%29.zip","filesize":506918349,"score":"","genres":"Compilation","desc":"<p>This compilation contains three classic Nihon Falcom games redone for the Saturn:* Dragon Slayer</p><ul><li>Xanadu</li><li>Ys: The Vanished Omens</li></ul><p>All games feature newly remade graphics and music, as well as new features to counter the age of the gameplay mechanics in some games (like the addition of a dash button for <em>Ys</em>).</p>"},{"name":"Falcom Classics (Japan) (Disc 2) (Special CD)","year":1997,"developer":"Victor Interactive Software, Inc.","url":"e#Falcom%20Classics%20%28Japan%29%20%28Disc%202%29%20%28Special%20CD%29.zip","filesize":520390952,"score":"","genres":"Compilation","desc":"<p>This compilation contains three classic Nihon Falcom games redone for the Saturn:* Dragon Slayer</p><ul><li>Xanadu</li><li>Ys: The Vanished Omens</li></ul><p>All games feature newly remade graphics and music, as well as new features to counter the age of the gameplay mechanics in some games (like the addition of a dash button for <em>Ys</em>).</p>"},{"name":"Falcom Classics II (Japan)","year":1998,"developer":"Victor Interactive Software, Inc.","url":"e#Falcom%20Classics%20II%20%28Japan%29.zip","filesize":454896215,"score":"","genres":"Compilation","desc":"<p>This is the second compilation of classic Nihon Falcom games redone for the Saturn. It contains remakes of:* Asteka II</p><ul><li>Ys II</li></ul><p>As before, all games feature newly remade graphics and music, as well as new gameplay features to counter the age of the gameplay mechanics in the games.</p>"},{"name":"Farland Saga - Toki no Michishirube (Japan)","year":1998,"developer":"Technical Group Laboratory, Inc.","url":"e#Farland%20Saga%20-%20Toki%20no%20Michishirube%20%28Japan%29.zip","filesize":354693799,"score":"","genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga > Fantasy","desc":"<p>Eight years have passed since the great war between humans and magical people. Brian, one of the war's great heroes, died peacefully, leaving behind the girl Kalin, of whom he had been taking care all the years following the war. Kalin leaves her country and goes on a ship to look for a job as a mercenary. On her way she meets Al, a boy who wanders around aimlessly, suffering from amnesia. Together, they reach a town where they receive jobs in the local guild. One of their assignments involves busting a pirate ship, and that is where their great adventure begins...</p><p><em>Toki no Michishirube</em> is a direct sequel to the first Farland Saga game. It is an anime-style strategy RPG which consists mainly of large strategic battles, taking place on isometric battle fields. The player moves the characters over the battle field, attacking physically or casting spells. After a battle, characters gain experience points, which the player can freely distribute among the party members.</p>"},{"name":"Farland Saga (Japan)","year":1998,"developer":"Technical Group Laboratory, Inc.","url":"e#Farland%20Saga%20%28Japan%29.zip","filesize":153942043,"score":"","genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga > Fantasy","desc":"<p>Three warriors who were heading to the palace save the princess Fam from attackers. As they venture into the palace, they find out that a great hero who was trying to bring peace to the races of humans and magical people, was killed. Princess Fam is accused of murder. The three knights help her to flee the castle, but the ruler of magical people, Kaiser, declares war on humans. The runaway princess and her loyal knights find refuge in another country, and the inevitable war begins.</p><p><em>Farland Story</em> is an anime-style tactical RPG. The game mainly consists of large strategic battles, during which you navigate your troops over an isometric battle fields, attack the enemies physically or cast spells. Terrain height plays a role in the battles, since some spells will only affect one level of terrain and one direction.</p>"},{"name":"FEDA Remake!: The Emblem of Justice","year":1996,"developer":"Max Entertainment"},{"name":"FIFA Soccer 96","year":1995,"developer":"Electronic Arts Canada","url":"e#FIFA%20Soccer%2096%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.zip","filesize":519268549,"score":7.6,"genres":"Simulation > Sports > Diagonal-down > 2D scrolling > Isometric > Managerial / business simulation > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p><em>FIFA Soccer 96</em> is a football (soccer) simulation. The game includes eleven leagues from all around the world, ranging from the unknown players of the Malaysian league to the celebrated stars of the English and Italian leagues. 59 International teams are also featured, and it's possible to match the teams you want to against each other through friendlies, or you can also choose to play domestic tournaments or International ones such as the World Cup. If you're not satisfied with the composition of the various teams, you can create your own dream team through the custom team creator.</p><p>British commentator John Motson comments all the incidents and happenings on the pitch in real-time. The ambient commentary is varied, and systems with more than the minimum memory level get extra commentary phrases. The Virtual Stadium technology has numerous pre-defined camera angles.</p>"},{"name":"FIFA Soccer 97","year":1996,"developer":"Electronic Arts Canada","url":"e#FIFA%20Soccer%2097%20%28USA%29.zip","filesize":524491634,"score":7.3,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>This iteration of the <em>FIFA</em> lineage includes commentary from John Motson with summaries from Andy Gray, with the between-match sections covered by Des Lynam. All player moves are from David Ginola using the MotionBlending technology. Full interactive replays are included.</p><p>You can play a league or cup tournament, and practice your skills before playing. The game can be tailored to action or simulation style, with fouls, injuries and offsides available to toggle on or off. This version also includes a 6 vs 6 indoor play mode, and various multiplayer options</p>"},{"name":"FIFA: Die WM-Qualifikation 98 (Germany)","year":1997,"developer":"XYZ Productions","url":"e#FIFA%20-%20Die%20WM-Qualifikation%2098%20%28Germany%29.zip","filesize":417933725,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>The late-1997 edition of <em>FIFA</em> was heavily tied in with the qualifying procedure for the 1998 World Cup. In the <em>Road to the World Cup</em> mode, you take a team from first qualification through to the main tournament, using the varying systems in different parts of the world. The game features 16 distinct outdoor stadia. The League play features 189 clubs and 11 leagues. Each team has specific crowd chants incorporated into the ambient sound.</p><p>The action is faster than in previous versions, and AI has been expanded. Players have distinct facial feature and hair styles. Each match is introduced by Des Lynam and commentated on by John Motson and former Scotland international Andy Gray.</p>"},{"name":"Fighter's History Dynamite","year":1997,"developer":"Data East Corporation"},{"name":"Fighters Megamix","year":1996,"developer":"SEGA-AM2 Co., LTD.","url":"e#Fighters%20Megamix%20%28Europe%29.zip","filesize":535875652,"score":8.1,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts","desc":"<p>Virtua Fighter 2 was full of many brand new gameplay elements implemented into the realistic fighting engine of the first Virtua Fighter. The Virtua Fighter series has been heralded before as the fighting game with most involving gameplay. </p><p>In Fighters Megamix, another game has been added, a game called Fighting Vipers. Fighting Vipers has drastically different gameplay than the more popular Virtua Fighter 2. Instead of being sophisticated, Fighting Vipers is simplified to appeal to a wider audience of video gamers and was meant for \"casual\" gamers.</p><p>Mixing a simplistic video game and a sophisticated video game must have been difficult. But Fighters Megamix manages to do so by offering many options. The most important option available is the choice of having Fighters Megamix run under the Fighting Vipers style of gameplay or the Virtua Fighter 2 style of gameplay. Other options are unlockable while playing the game.</p><p>One good thing about mixing two games into one is that the game would include more selectable characters. Not only are there the 22 characters from Virtua Fighter 2 and Fighting Vipers but there are also 10 other hidden characters that can be unlocked by playing well in the Saturn version, including two from the arcade-only Sonic the Fighters. There are only 4 characters from Virtua Fighter 2 and 4 from Fighting Vipers in the Game.Com version.</p><p>This game was one of the very last games to appear on the Sega Saturn in the United States and was directed by Yu Suzuki.</p>"},{"name":"Fighting Vipers","year":1996,"developer":"SEGA-AM2 Co., LTD.","url":"e#Fighting%20Vipers%20%28Europe%29.zip","filesize":349978414,"score":7.5,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p>Armstone City, year unknown. The Mayor decided to hold a fighting tournament with the grand finale being held on the top of the city tower, and the Vipers, young urban warriors decide to compete, each with their own goal on mind. All eight came from several backgrounds, like the hard-rocker <em>Raxel</em>, the orphan with a burning desire to meet his father <em>Bahn</em>, former gang leader <em>Tokyo</em>, queen of the catwalk <em>Grace</em>, the giant with an unknown past <em>Sanman</em>, construction worker and former marine trainee <em>Jane</em>, fashion designer to-be <em>Candy</em> and skater boy <em>Picky</em>, plus <em>Mahler</em>, someone with a score to settle with the Mayor.</p><p>While based on the same Model-2 arcade board as <em>Virtua Fighter 2</em>, Fighting Vipers included several changes, such as a wall surrounding the battle area and equipping each fighter with a two-piece (chest and legs) armour that can only be broken with power hits. Once the armour is gone, the unfortunate fighter is more vulnerable to opponent hits, and damage can also be collected after hitting the wall or floor after a throw. </p><p>Gameplay is also radically different from Virtua Fighter - noticeably faster, with combos done by fast button-mashing sequences sometimes on the same button, instead of the timed presses that require an additional push on the d-pad of the first title. Another new addition to gameplay is the Quick recovery, which allows a fighter that suffered a severe blow to quickly get on his feet, avoiding damage and allowing for a quick counter, but at the same time leaving him open for another blow if the opponent is fast enough. to react.</p><p>Game modes include Arcade, Vs, Team Battle (best of 9) and Training. Game options allow the player to tweak the difficulty setting, number of rounds before a match winner is decided, size of life bars, if there's a time limit, if the order of opponents is random or predefined and between three game modes: Original (based on the arcade version), Arrange (gameplay tweaked for the Sega Saturn) and Hyper (allows Vipers to voluntarily drop their armour, allowing to perform special attacks at lightening fast speeds), Stage selection, and to change the disposition of the control pad to better suit the players' style.</p><p>Another mode, Playback, allows to see rounds previously saved by the player or fighting demos recorded by the AM#2 staff, each with the ability to choose a camera. As usual with Sega's fighting ports, extensive bookkeeping is included, as well as a few hidden characters.</p>"},{"name":"Final Fight Revenge (Japan)","year":2000,"developer":"Capcom Digital Studios, Inc.","url":"e#Final%20Fight%20Revenge%20%28Japan%29.zip","filesize":223896205,"score":5.8,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts","desc":"<p>The Mad Gear gang is on the loose again! Take control of a total of 10 fighters (all from the original Final Fight) and foil them, making Metro City safe from crime once again.</p><p>Known as the last game released on the Saturn in Japan, \"Final Fight Revenge\" is a conversion of the arcade game (the only other \"Final Fight\" game released on that platform). As they battle 1-on-1 in a series of 3-D environments, one or two players control 10 characters from the original - the original three of Guy, Cody, and Haggar, plus enemy characters El Gado, Poison and Andore and four boss characters - Damnd, Sodom, Edi E. and Rolento.</p><p>In the single-player mode, the player fights through 6 opponents (followed by a final boss battle with a zombie version of the original \"Final Fight\" final boss Belger), armed with two punch buttons, two kick buttons and a special move button, which can used either to side-step (by holding while pressing up or down) or to pick up weapons and recovery items. Weapons that can be used against opponents include flamethrowers, lead pipes and machine guns. (Players can equip up to three at a time or toss one to their opponent.)</p><p>In addition, each player has a set of grappling moves, and three Super Moves that are available when they fill the corresponding Super Move gauge.</p>"},{"name":"Formula Karts - Special Edition","year":1997,"developer":"Manic Media Productions Ltd.","url":"e#Formula%20Karts%20-%20Special%20Edition%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":514872492,"score":7.1,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Formula Karts</em> is a semi-realistic racing title that attempts to capture the spirit of kart racing with it's low slung feeling of speed, and corner after corner of impressive handling (and inevitable sliding). The title supports both simulation and arcade modes, and features some effective race AI for non-player vehicles. Two player split screen is supported albeit with some slowdown.</p>"},{"name":"Frank Thomas Big Hurt Baseball","year":1996,"developer":"Iguana UK","url":"e#Frank%20Thomas%20Big%20Hurt%20Baseball%20%28Europe%29.zip","filesize":273920189,"score":6.5,"genres":"Simulation > Sports > Behind view > Diagonal-down > 2D scrolling > Baseball > Licensed","desc":"<p>Baseball player Frank Thomas licensed one of the first baseball games to use motion-captured 3D graphics and multiple camera angles. 28 stadia have been rendered in 3D, and each has its own visible and significant differences. </p><p>There are 6 distinct game modes, allowing for single exhibition matches as well as full seasons on the playoffs. There is also a Home Run Derby mode, allowing the player to pelt the ball out of the ground for points. </p><p>You can choose pitchers and batters, based on their statistics and form. Bowling options are set to define the delivery, with fastballs and curveballs as well as more precise setting of pace and height. Fielding is optional - it's best to leave this to the computer at first You can always alter the infield and outfield depth and shift.</p>"},{"name":"Frankenstein: Through the Eyes of the Monster","year":1995,"developer":"Amazing Media, Inc."},{"name":"Freestyle Boardin' '99","year":1997,"developer":"Atelier Double Co. Ltd."},{"name":"Friends: Seishun no Kagayaki","year":1999,"developer":"FairyTale"},{"name":"Fushigi no Kuni no Angelique (Japan)","year":1997,"developer":"KOEI Co., Ltd.","url":"e#Fushigi%20no%20Kuni%20no%20Angelique%20%28Japan%29.zip","filesize":258782451,"score":"","genres":"Strategy > Top-down > Anime / Manga > Board game > Fantasy","desc":"<p>This game is a variation on the  Angelique story: an ordinary school girl named Angelique becomes involved in a struggle to become the Queen of Cosmos, for which it is necessary to befriend the handsome and powerful Guardians of the Elements. The game features the same world and graphics as  Angelique Special, with a slightly different story: Angelique falls asleep outside near a tree, and dreams that she fell through a rabbit hole (in an <em>Alice in Wonderland</em> fashion) into the magical land where she encounters her eternal rival Rosalia.</p><p>Unlike other Angelique games, <em>Fushigi no Kuni no Angelique</em> plays like a board game, with the kingdom divided into fields on which Angelique moves. There are no visible dice, but the amount of fields Angelique can walk on is determined randomly by clicking on the \"move\" button. Fields can either be empty, placed inside a location (like Angelique's own room), trigger events, conversations, etc. In some places it is possible to find items, which can then be used on another field to help Angelique advance more quickly, increasing her chances to become the queen.</p>"}]