[{"name":"Gakkō no Kowai Uwasa: Hanako-San ga Kita!!","year":1995,"developer":"WorkJam Co., Ltd."},{"name":"Gakkou no Kaidan","year":1995,"developer":"Japan Media Programming Inc.","url":"e#Gakkou%20no%20Kaidan%20%28Japan%29.zip","filesize":391883718,"score":"","genres":"Adventure > Full Motion Video (FMV) > Horror > Licensed","desc":"<p><em>Gakkō no Kaidan</em> is an interactive movie with adventure elements, made to tie in with a Japanese ghost-themed film of the same name. Like some other Sega CD games with similar thematics, it features FMV sequences with interactive options. For example, escaping some of the enemies may require the player to press directional keys or the A/C buttons. The other element of the game is a point-and-click style set.</p>"},{"name":"Galactic Attack","year":1995,"developer":"Taito Corporation","url":"e#Galactic%20Attack%20%28Europe%29.zip","filesize":475632814,"score":7.6,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Space flight > Post-apocalyptic > Sci-fi / futuristic","desc":"<p><em>Galactic Attack</em> is a top-down shooter, there are seven levels to play, ranging from battles in the atmosphere of planets to battling over mountain ranges, each with their own standard huge bosses at the end of each of these levels. The player takes control of a starfighter called the RVA-818 X-LAY, out to destroy any opposing forces.</p><p>The story has the future of Earth governments gathering together to construct a massive super computer called Con-Human to help with the planet's environment, providing nutrients to the earth and caring for the ecosystem. However, a cloned human is linked with the system and makes Con-Human a sentient being. The system eventually becomes insane and starts to create natural disasters, wiping all nearly all of mankind and destroying the ecosystem, driving the survivors into space to develop colonies on other planets. Con-Human then makes Earth into a giant fortress and is assembling a massive armada to destroy the remaining survivors, but before it can attack, the survivors amass a first strike in order to reclaim the Earth.</p><p>The goal is to fly around in the level, using the primary laser weapon to destroy various enemies flying in and out of the screen. Players can upgrade this weapon by collecting \"L\" icons floating around when enough enemies are destroyed. There is also a secondary weapon, a lock-on missile launcher, that has the ability to fire upon eight different ground enemies at once.</p>"},{"name":"Galaxy Fight: Universal Warriors","year":1995,"developer":"Sun Corporation","url":"e#Galaxy%20Fight%20-%20Universal%20Warriors%20%28Japan%29.zip","filesize":568386326,"score":7,"genres":"Action > Side view > 2D scrolling > Fighting > Sci-fi / futuristic","desc":"<p>As the millennium nears in the far future, a being of ultimate power named Felden will make his appearance in the galaxy. It is unknown whether he comes to destroy all living beings or use his powers for good, but whatever the reason a group of skilled fighters from all corners of the universe have decided to beat each other up in order to face off against him and claim his power.</p><p>Enter <em>Galaxy Fight</em>, a one-on-one 2D fighter set in the far future and featuring sci-fi characters and settings. In the game itself, you have to select from 8 fighters, each with his unique moveset and stats, and then attempt to defeat the other character in 2 out of 3 matches using your special moves and attacks while avoiding your opponent's strikes.</p><p>Features single player and 2-player Vs. game modes, secret bosses and bonus rounds.</p>"},{"name":"Gale Racer","year":1994,"developer":"SEGA Enterprises Ltd.","url":"e#Gale%20Racer%20%28Japan%29%20%28En%2CJa%29%20%281A%29.zip","filesize":386163876,"score":6.6,"genres":"Racing / Driving > 1st-person > Direct control > Automobile > Off-roading > Track racing","desc":"<p><em>Rad Mobile</em> is a 1st-person racing game where the scenarios are 2D and all of them correspond to 20 zones across the United States. The only available camera is the one inside the car, from where you can see the wheel and indicators (again, in 2D). Also, the game features weather effects, like rain, fog and night, for which you should use either the headlights or the windscreen wiper to succeed in the race.</p><p>The Saturn version is similar to the Arcade version except that your rivals are fully polygonal cars. It also adds Full Motion Video sequences, as well as a CD soundtrack.</p>"},{"name":"Gals Panic SS","year":1996,"developer":"Kaneko Co., Ltd.","url":"e#Gals%20Panic%20SS%20%28Japan%29.zip","filesize":518880573,"score":"","genres":"Action > Puzzle > Top-down > Anime / Manga > Arcade > Direct control","desc":"<p><em>Gals Panic SS</em> is the first game in the <em>Gals Panic</em> series designed specifically for home consoles. That said, there is no nudity. It is very similar to Gals Panic 4 before it in that all the girls are drawn in an anime style, with no photographic models whatsoever. The gameplay is changed in this game. The same basic gameplay of uncovering a girl's picture with <em>Qix</em>-like gameplay is used, but you spend 5 rounds on each girl. After this, instead of moving on to the next girl, the game saves and ends. You then play another girl after starting the game again. There is a gallery where the unlocked CG can be viewed. There are a total 12 models in the game, the last two unlocked after beating all the available girls. Some of these girls are reused from <em>Gals Panic 4</em>.</p>"},{"name":"Game no Tetsujin - The Shanghai","year":1995,"developer":"Success Corp.","url":"e#Game%20no%20Tetsujin%20-%20The%20Shanghai%20%28Japan%29.zip","filesize":460427179,"score":"","genres":"Strategy > 1st-person > Top-down > Fixed / flip-screen > Turn-based > Board game > Point and select > Japan (Modern/Futuristic)","desc":"<p>Within <em>Game no Tatsujin</em> are four different classic Japanese board games made by different developers, which are Mahjong, Shogi, Go and Reversi. The board games can be played in three different modes including the Training Mode with five opponents, the Free Battle Mode with progressive levels of difficulty and World Mode with a total of 21 game masters to challenge with the ultimate goal beating them all and earning the award title \"Master of the Game\".</p>"},{"name":"Game Tengoku - The Game Paradise!","year":1997,"developer":"Jaleco Ltd.","url":"e#Game%20Tengoku%20-%20The%20Game%20Paradise%21%20%28Japan%29.zip","filesize":498177085,"score":"","genres":"Action > Top-down > 2D scrolling > Anime / Manga > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Game Tengoku</em> is a conversion of the coin-op game of the same name. The game is a vertical scrolling comical shooter similar to Konami's Parodius series and Hudson's Star Parodier. </p><p>The game is playable in normal or time attack mode.</p><p>The playable characters are:</p><ul><li>Jeynus Starmine, pilot of the Fighter-EX from Exerion</li><li>Seria, pilot of the ship from Plus Alpha</li><li>Z-DYNE MK II, the successor to the mech from Formation Z</li><li>Pig, from Okkotoshi Puzzle Tonjan!?</li><li>Momoko, from Momoko 120%</li><li>Miki and Misato, two young girls piloting the radar ship Genesis 3 from Field Combat</li></ul>"},{"name":"Garou Densetsu 3 - Road to the Final Victory","year":1996,"developer":"SNK Corporation","url":"e#Garou%20Densetsu%203%20-%20Road%20to%20the%20Final%20Victory%20%28Japan%29.zip","filesize":574206334,"score":7.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Fantasy","desc":"<p>An adaptation of the Neo-Geo fighting game.  2-D scrolling one-on-one fighter with pseudo-3D aspects (that allows for players to \"escape\" holds, throws, and other attacks).  Part of the incestuously-popular SNK fighting game pantheon...</p>"},{"name":"Gekirindan","year":1997,"developer":"Taito Corporation"},{"name":"Gensou Suikoden","year":1998,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"e#Gensou%20Suikoden%20%28Japan%29.zip","filesize":385709306,"score":8,"genres":"Role-playing (RPG) > Top-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Regional differences","desc":"<p>Loosely based on the classic medieval Chinese novel <em>Water Margins</em>, the game is a fantasy RPG set in an imaginary universe, its main theme being political struggle. The hero of the game is the young son of Theo McDohl, a general who serves the Scarlet Moon Empire, presently controlling the land of Toran. Through a series of events the hero becomes involved in a rebellion against the Empire, led by an organization known as the Liberation Army. Will the hero find a new home there, will he be able to tear himself away from everything that has been sacred to him, including his own father?</p><p><em>Suikoden</em> is a Japanese-style role-playing game with several unusual additions. There are three kinds of combat in the game, the most common one being the traditional turn-based party combat (players can have up to six people in their active party). Magic runes can be equipped on the player's characters which allow limited usage of offensive and healing spells. There are also a few army battles, where the player must control whole units of fighters, archers, magicians, etc., and one-on-one fights (duels).</p><p>The game allows the player to build and customize a castle, which serves as their home base and fortress. 108 characters can be recruited in the game, a tribute to 108 Stars Of Destiny in \"Water Margins\". Many of those characters will be available as active party members and participate in battles, while others will act as strategy advisers, or enhance the castle itself in various ways.</p>"},{"name":"Gex","year":1995,"developer":"Crystal Dynamics, Inc.","url":"e#Gex%20%28Europe%29.zip","filesize":193107815,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Enter your television to defeat the evil Rez by collecting remotes to open worlds inside your tv. You are a gecko with all the usual platform hero skills such as jump, fire, and close-range attack, but also suction cups to help you scale walls, a tongue to pick up those tricky to get power-upsand plenty of wise-cracks to keep you amused. Use them all to make your way through TV land searching for the remotes, collecting pickups, power-ups, and killing TVs.</p>"},{"name":"Ghen War","year":1995,"developer":"Jumpin Jack Software, Inc.","url":"e#Ghen%20War%20%28Europe%29.zip","filesize":386648439,"score":7,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p><em>Ghen War</em> is a classic first-person shooter. The solar system is being attacked by an evil force of aliens known as Ghen. The player is a Lieutenant surface engineer in a hypersuit, and it is his task to boot these aliens out of your world in twenty levels. From the cockpit of this hypersuit, the character operates lasers, grenades, mines, missiles and more while making his way across planet surfaces and city environments protecting the human race. It also has a claw that can operate elements in the environment and can send out a decoy of itself to confuse opponents.</p><p>The game is also one of the first to feature deformable terrain. Explosions make craters and firing into the environment can make it wear away.</p>"},{"name":"Girls in Motion Puzzle Vol. 1: Hiyake no Omoide + Himekuri","year":1995,"developer":"Japan Media Programming Inc.","url":"e#Girls%20in%20Motion%20Puzzle%20Vol.%201%20-%20Hiyake%20no%20Omoide%20%2B%20Himekuri%20%28Japan%29.zip","filesize":342484916,"score":"","genres":"Puzzle > Fixed / flip-screen > Live action > Cards / tiles","desc":"<p><em>Hiyake no Omoide</em> (日灼けの思い出) is a jigsaw puzzle game for one or two players featuring photo stills and live videos. The puzzle pieces portray stills and videos featuring five different girls, namely Ayumi (桜井 亜弓), Mami (長谷川 真美), Kyoko (藤本 恭子), Miwako (工藤 美和子), and Chiyoko (山室 千代子).</p><p>The game feature three gameplay modes. Movie Puzzle mode features countdown mode where player races against time to assemble the animated jigsaw puzzle. Animated thumbnail video can be scrolled over to get the better preview. Upon completing the puzzle, the player is rewarded with fullscreen video of the girl in question, and the next jigsaw puzzle video gets unlocked. VP Puzzle mode lets you play against other player or CPU where photo is displayed only for a brief moment before the game starts. During the battle, puzzles set in place by each of the player are marked with the player's color on the grid map. But the battle isn't just about who can put the right piece at the right place faster, instead, there are several different traps and weapons of a sort that one player can use against the other player such as having a character hunt down the puzzle piece the player is carrying and take it off, or mess up the player controls to make everything reverse. The last mode is called Himekuri and is a single-player mode for assembling the jigsaw puzzle of a still image.</p><p>Options, which are accessible via main menu, feature movie and photo viewers which let you watch all the videos and photo still you have unlocked during your gameplay. Unlike the majority of Sega Saturn jewel case packages, the game comes in a sleeve which contains jewel case sized cardboard digipak with CD slot and manuals which are made as part of the digipak.</p>"},{"name":"Girls in Motion Puzzle Vol. 2: Body Special 264","year":1996,"developer":"Japan Media Programming Inc.","url":"e#Girls%20in%20Motion%20Puzzle%20Vol.%202%20-%20Body%20Special%20264%20%28Japan%29.zip","filesize":569821161,"score":"","genres":"Puzzle > Fixed / flip-screen > Cards / tiles","desc":"<p><em>Body Special 264</em> is the second game in <em>Girls in Motion Puzzle</em> jigsaw game series featuring photos and videos of Japanese bikini models. Unlike in its prequel, this game features only three models, namely Akiko Hinagata (雛形 あきこ), Senna Matsuda (松田 千奈), and Akira Kiuchi (木内 あきら).</p><p>The game feature three gameplay modes:</p><ul><li>Movie Puzzle - Countdown mode where player races against time to assemble an animated jigsaw puzzle. Animated thumbnail video can be scrolled over to get the better preview. To select the model you wish to use for jigsaw puzzle backdrop, you need to spin the selection and stop it which works similar to roulette wheel. Each model has 7 different videos which need to be assembled and unlocked sequentially after which every unlocked video can be replayed in any order.</li><li>VS Puzzle - A two player match which lets you play against another player or a CPU. Unlike the regular modes, versus matches include a few more kinks and give you gadgets to help you solve the puzzle faster and hinder your opponent.</li><li>Puzzle Club - A single-player mode for assembling the jigsaw puzzle of a still image. There is no countdown, but the fastest solving time is logged per photo, the default one is set to 99 minutes.</li></ul><p>Options, which are accessible via main menu, feature movie and photo viewers which let you watch all the videos and photo still you have unlocked during your gameplay.</p>"},{"name":"Goiken Muyou: Anarchy in the Nippon","year":1997,"developer":"Mediamuse"},{"name":"Golden Axe: The Duel","year":1995,"developer":"SEGA Enterprises Ltd.","url":"e#Golden%20Axe%20-%20The%20Duel%20%28Europe%29.zip","filesize":507211358,"score":7.6,"genres":"Action > Side view > 2D scrolling > Fighting > Fantasy","desc":"<p>This is a one-on-one fighting game in the vein of Street Fighter 2 and Samurai Shodown featuring the cast of Sega's Golden Axe games (actually their fictional descendants). The game's story is that Death Adder has been resurrected and stolen the legendary Golden Axe from Gilius Thunderhead's family. For some reason Death Adder decided to set up a Street Fighter-like tournament to give his enemies an opportunity to slay him and prevent the end of the world.</p><p>The game play formula follows Street Fighter 2 closely with several playable characters that are essentially the same as the cast of the original Golden Axe (for all extents and purposes).</p><p>It’s essentially an elimination tournament with each character having special moves similar to that of Street Fighter 2 characters. You can play against another player or against the computer. It does feature scaling backgrounds similar to Samurai Shodown.</p>"},{"name":"Gotha II: Tenkuu no Kishi","year":1996,"developer":"Micronet Co. Ltd.","url":"e#Gotha%20II%20-%20Tenkuu%20no%20Kishi%20%28Japan%29.zip","filesize":550315217,"score":6,"genres":"Strategy > Behind view > Top-down > Turn-based > Multiple units/characters control > Sci-fi / futuristic","desc":"<p><em>Heir of Zendor: The Legend and The Land</em> is a turn-based strategy game and a sequel to Gotha: Ismailia Seneki. </p><p>The game is set on Zendor, a planet with floating continents thanks to anti-gravity ore. The most important resource is water, which after the Great Wars still remained only in the continent named Terra Sancta. The player assumes the role of the Prince of Zendor, commander of the Zendorian Squadron of the Royal Alliance Expeditionary Forces and needs to defeat the \"Five Kings\".</p><p>As any strategy game, Heir of Zendor has objective driven stages called missions. Completing these objectives the player reaches new missions. The player needs to deploy ships, arm them, move each unit individually or as a complete formation, and when the player's units are close enough to attack the enemies, command their in battle (that consists in: select a weapon, select a target and shoot). Turn ends when all player's units moved or attacked an enemy.</p>"},{"name":"Gotha: Ismailia SenEki","year":1995,"developer":"Micronet Co. Ltd.","url":"e#Gotha%20-%20Ismailia%20SenEki%20%28Japan%29.zip","filesize":467101858,"score":"","genres":"Strategy > 3rd-person (Other) > Top-down > Turn-based > Tactical shooter > Menu structures > Sci-fi / futuristic","desc":"<p>Taking inspirations from Yoshiki Tanaka's \"Legend of the Galactic Heroes\", the game consists of two divided human factions at war after an increasingly hostile colonization across the Milky Way. The player simply positions tactical units in airspace, configures their stats then assigns each unit specific commands. If decisions are done correctly, a successful strategy ensures a victory against all enemy units.</p>"},{"name":"Gradius Deluxe Pack","year":1996,"developer":"Konami Co., Ltd.","url":"e#Gradius%20Deluxe%20Pack%20%28Japan%29.zip","filesize":302354184,"score":7.2,"genres":"Action > Compilation > Side view > Shooter","desc":"<p>This pack contains both the arcade classics Gradius I and II, ported to Windows 95, Sony Playstation and Sega Saturn.</p><p>Story: the Bacterians are attacking the planet Gradius, and in a state-of-the-art fighter ship you have to stop them. Both games have similar gameplay and graphics, with only different music and level layout setting them apart.</p><p>Each of these side-scrolling shooters has over a dozen levels each, all of which are completely unique. There are no enemy types that are re-used from level to level (except for the boss who is the same in every level). You can collect powerups that provide things like extra speed, laser shots, target-seeking missiles, shields, etc.</p><p>While there have been many small modernising touches made to the games, there is still no ability to save. Be prepared to set aside a considerable amount of time to finish in one go.</p>"},{"name":"Grand Slam","year":1997,"developer":"Burst"},{"name":"Grandia (Disc 1)","year":1997,"developer":"Game Arts Co., Ltd.","url":"e#Grandia%20%28Japan%29%20%28Disc%201%29%20%282M%29.zip","filesize":509852034,"score":7.7,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy > Steampunk","desc":"<p>The ancient Angelou civilization has ceased to exist centuries ago, and technology in the world develops rapidly. General Baal, the head of the militaristic Garlyle Forces, organizes an excavation of ancient ruins, apparently for philanthropic reasons. Meanwhile, Justin, a young boy from the nearby town of Parm, decides to investigate the ruins in search of the Spirit Stone, an artefact that once belonged to his missing father. A mysterious holographic image tells him that he should travel to faraway lands to discover the stone's true power, and he embarks on the most dangerous adventure of his life without hesitation. </p><p><em>Grandia</em> is a Japanese-style role-playing game. The characters are represented by 2D sprites which are moved around over 3D backgrounds in towns and dungeons. The game makes use of anime-style cutscenes to advance the story. Combat is initiated by coming into contact with enemies on the screen, rather than through random battles. Battles occur in pseudo-real-time, using an 'IP Gauge' to determine when a character takes action. Striking at the right time or with the right ability can even delay or cancel an enemy's turn.</p><p>The characters in the game gradually advance in level as they gain experience points for killing monsters. Characters also gain experience based on the weapon (e.g. sword, mace, whip, etc.) or magic (e.g. fire, water, etc.) that they use, powering up their spells and learning new ones from continuous usage. There are a large number of spells, weapons, and other items to use throughout the game.</p>"},{"name":"Grandia (Disc 2)","year":1997,"developer":"Game Arts Co., Ltd.","url":"e#Grandia%20%28Japan%29%20%28Disc%202%29%20%284M%29.zip","filesize":474909955,"score":7.7,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy > Steampunk","desc":"<p>The ancient Angelou civilization has ceased to exist centuries ago, and technology in the world develops rapidly. General Baal, the head of the militaristic Garlyle Forces, organizes an excavation of ancient ruins, apparently for philanthropic reasons. Meanwhile, Justin, a young boy from the nearby town of Parm, decides to investigate the ruins in search of the Spirit Stone, an artefact that once belonged to his missing father. A mysterious holographic image tells him that he should travel to faraway lands to discover the stone's true power, and he embarks on the most dangerous adventure of his life without hesitation. </p><p><em>Grandia</em> is a Japanese-style role-playing game. The characters are represented by 2D sprites which are moved around over 3D backgrounds in towns and dungeons. The game makes use of anime-style cutscenes to advance the story. Combat is initiated by coming into contact with enemies on the screen, rather than through random battles. Battles occur in pseudo-real-time, using an 'IP Gauge' to determine when a character takes action. Striking at the right time or with the right ability can even delay or cancel an enemy's turn.</p><p>The characters in the game gradually advance in level as they gain experience points for killing monsters. Characters also gain experience based on the weapon (e.g. sword, mace, whip, etc.) or magic (e.g. fire, water, etc.) that they use, powering up their spells and learning new ones from continuous usage. There are a large number of spells, weapons, and other items to use throughout the game.</p>"},{"name":"GridRun","year":1996,"developer":"Radical Entertainment Inc.","url":"e#GridRun%20%28Europe%29.zip","filesize":440908756,"score":6.5,"genres":"Action > Diagonal-down > Sci-fi / futuristic","desc":"<p>Aliens have captured you and you are forced to play a deadly game of what appears to be capture the flag combined with tag. Race your way around the area and capture the required number of flags before being touched by your opponent. If they do touch you, you must find and touch them before they capture the right number of flags. Who ever is \"it\" cannot capture flags until their opponent is tagged. There is a story and 2 player versus mode. Through the story, you face many different enemies with ranging speeds and firepower (gun fire only slows down the person shot, there is no health bar).</p>"},{"name":"Groove on Fight: Gōketsuji Ichizoku 3","year":1997,"developer":"Atlus Co., Ltd."},{"name":"Guardian Force","year":1998,"developer":"Success Corp.","url":"e#Guardian%20Force%20%28Japan%29.zip","filesize":14141297,"score":"","genres":"Action > Top-down > 2D scrolling > Shooter > Direct control > Tank > Sci-fi / futuristic","desc":"<p><em>Guardian Force</em> is a shoot-em-up where the player controls a tank that can fire in eight directions. While the body of the tank can be moved freely around the screen, each press of the outer buttons will rotate the tank's turret 45 degrees clockwise or counter-clockwise. The tank/screen will scroll vertically for much of the game, but will sometimes be reoriented midlevel to scroll horizontally or diagonally.</p><p>There are five unique weapons which can be used: a standard shmup spread shot (Tusk), a non-continuing laser (Feeler), what is essentially a giant yo-yo that can be launched and retracted (Fang), a short-ranged explosive attack (Horn), and a bevy of missiles (Beak). Each of them has a designated color (red, yellow, green, purple, and blue respectively) and special attack (bomb equivalent), and will increase in damage/ability as the tank's level increases. The tank also has a standard repeating shot that will always fire in the direction the screen is scrolling.</p><p>Regular play revolves around a number of onscreen collectibles. The standard weapon power-up will cycle through the aforementioned weapon colors before eventually going dark, floating or fading away. It will change the player's current weapon to the one of its color when picked up, or upgrade the tank's level if it matches the color of the player's current weapon. In addition, there are pink gems that drop from particular enemies that also upgrade the tank's level, a missile power-up that will add either homing or straight-shooting rockets to the player's current weapon, and a special attack refill (equivalent to one shot).</p><p>Certain enemies and destructible objects will also drop medals when destroyed. The first medal will always spawn at level I, worth 100 points. Once it's collected, the next medal spawned will increase in rank and double in score; this continues until medals reach level VIII/12,800 points. If a medal goes uncollected for whatever reason (it either disappears or is overtaken by the scrolling screen), the next medal spawned will reset to level I. Score bonuses can also be had from quickly killing a number of midbosses, as well as collecting the weapon power-up once it stops cycling through the weapon colors.</p>"},{"name":"Guardian Heroes","year":1996,"developer":"Treasure Co., Ltd.","url":"e#Guardian%20Heroes%20%28Europe%29.zip","filesize":512607689,"score":8,"genres":"Action > Role-playing (RPG) > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Fighting > Fantasy > Martial arts","desc":"<p>Ages ago, the spirits of Earth and Sky waged war on each other. Neither could win, and eventually the Sky Spirits bestowed some humans with their powers, turning them into wizards and allies in the war. The Earth Spirits were banished into darkness; but the Sky Spirits feared the human wizards and cast them underground as well.</p><p>Years have passed, and a powerful wizard named Kanon escaped from the gloomy prison and turned the human land into a puppet state trembling before his might. One legendary sword is said to bring an end to Kanon's reign. Four warriors - Han, Randy, Nicole and Ginjirou - retrieved the sword, but knights sent by Kanon are determined to take it away and destroy it at all costs. Aided by the renegade knight Serena, the four heroes must keep the world safe and protect themselves against the onslaught.</p><p><em>Guardian Heroes</em> is a hybrid of a side-scrolling beat-em-up and a role-playing game. The four initial player characters are distinguished by their attributes and abilities: Han is a strong fighter who cannot use magic; Randy is a sorcerer who can cast attack spells but is physically more vulnerable; Ginjirou is a ninja-type, agile character; finally, Nicole has weak attacks but can cast healing spells.</p><p>The fighting mechanic is slightly deeper than in most other games of this type, with light and heavy attacks, special moves (executed the same way as usually in fighting games), magical attacks and the ability to block. Defeating enemies yields experience points, with which the player can upgrade the characters between levels, sharing them between various factors such as strength, speed, constitution and magic resistance.</p><p>The game has a branching storyline that develops according to the player's selection of stages. There is also a \"Karma\" system that evaluates the player's actions depending on how he or she treats enemies or innocent people in the game world.</p><p>Even in one-player mode there are always two controllable characters on screen - the player commands the other character by changing his \"mood\" - aggressive, cowardly etc. - of which there are six. On top of this, it is possible to play the game as a more traditional beat-em-up with up to six players (human or AI-controlled); in this mode it is possible to play as any character encountered during the main game mode.</p>"},{"name":"Gun Griffon","year":1996,"developer":"Game Arts Co., Ltd.","url":"e#Gun%20Griffon%20%28Europe%29.zip","filesize":464200342,"score":7.7,"genres":"Action > 1st-person > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Pilot an enormous walking mech to complete missions set all over the world in late 21st century warfare fighting other mechs, trucks and helicopters. The missions, set in different weathers and at different times of day, usually have specific objectives, be they search and destroy, protecting allies or killing everything. Four weapons are available: the main cannon; a weak machine gun that overheats with prolonged use; clusters of grenades and limited supplies of homing missiles. Damage repair and extra ammo is available from supply helicopters, but these are vulnerable to attack. Ally mechs can be useful, but it is the player who has to do most of the work by far, battling mechs that are sometimes faster and more agile, therefore a certain amount of strategy and planning is required.</p>"},{"name":"Gunbird","year":1995,"developer":"Psikyo","url":"e#Gunbird%20%28Japan%29.zip","filesize":463665455,"score":6.8,"genres":"Action > Top-down > 2D scrolling > Anime / Manga > Arcade > Shooter > Fantasy > Steampunk","desc":"<p>Gunbird is a vertically scrolling shoot 'em up developed by Psikyo. It hit the Japanese arcade in 1994 and was followed by a Japanese release to the Saturn and the Playstation in the following year.</p><p>The game is set in a fantasy setting with steampunk elements. Lush forests and medieval castles meet steam trains and mech robots. Instead of piloting the genre-traditional space ships, Gunbird lets the player chose between five different characters (Ash, Marion, Valnus, Yuan Nang and Tetsu) who traverse the game world on broomstick, jet packs and pedal-powered helicopters on a quest to find the pieces of a magic mirror across seven stages. </p><p>Unorthodox vehicles aside, the gameplay follows traditional genre standards. The main goal is to dodge all bullets that fill the screen while collecting power-ups to make the character stronger. Gunbird features one power-up that incrementally increases the firepower of the standard weapon (P-items) as well as additional ammo for the screen-clearing special ability (B-items). Standard weapon and special ability differ from character to character. Where some characters excel in high firepower in a straight line others allow for a wider spread of bullets or additional homing missiles.</p>"},{"name":"GunBlaze-S","year":1998,"developer":"Active Software","url":"e#GunBlaze-S%20%28Japan%29.zip","filesize":304673879,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based","desc":"<p><em>GunBlaze S</em> is a remake of  GunBlaze.</p><p>The story remains the same as in the original game, and the dialogues almost the same, with a few minor omissions. The gameplay is also largely unchanged.</p><p>The main difference between the two versions is in the graphics. Many locations and cut scenes in <em>GunBlaze S</em> were re-drawn from scratch. Some of the locations have different layout. Generally, the graphics are clearly more detailed, even though they retain the simple 2D top-down style of the original. There are voice-overs for all story-related dialogues in this version.</p><p>There is also another significant change: the original <em>GunBlaze</em> had scenes with nudity; <em>GunBlaze S</em> has none. The sexual innuendo is present in the dialogues, and there are scenes with scantily clad young girls; but the adult content is gone.</p>"},{"name":"Gungriffon II","year":1998,"developer":"Kouyousha Ltd.","url":"e#Gungriffon%20II%20%28Japan%29.zip","filesize":526747601,"score":"","genres":"Action > 1st-person > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Gungriffon II</em> is 3D FPP mecha simulator, similar to  Armored Core or Mechwarrior, continuation of Gungriffon, released only in Japan. The player is a pilot of giant humanoid looking, heavily armed robot. He must complete various missions (search &amp; destroy, guard various objects, etc.), and fight against other robots and tanks. Various robots and equipment for combat can be selected. The game also has two additional game modes, a special virtual training mode, and survival mode. <em>Gungriffon II</em> supports up to 2 players on one machine and 4 with cable link for multiplayer.</p>"}]