[{"name":"Hang-On GP","year":1995,"developer":"Genki Co., Ltd.","url":"e#Hang-On%20GP%20%28USA%29.zip","filesize":439248683,"score":6.9,"genres":"Racing / Driving > 1st-person > Behind view > Motorcycle > Track racing","desc":"<p><em>Hang-On GP</em> features three tracks: Albatross Cliff Reef, Great Crimson Wall, and New Dwells. Each track contains an additional route that becomes available after a high placing. This makes a total of six possible races. </p><p>Players can choose from among ten motorcycles to use during a race as well as an automatic or manual transmission for each. Players can also decide how the bike should control, highside or power slide.</p><p>Placing in the top three on any of the first three tracks will release the additional routes. When players place in the top three on the additional routes an endurance mode will be available. In endurance mode players attempt to complete as many laps as they can in 10 minutes.</p>"},{"name":"Hansha de Spark! (Japan)","year":1997,"developer":"Sieg","url":"e#Hansha%20de%20Spark%21%20%28Japan%29.zip","filesize":284260322,"score":"","genres":"Action > Top-down > Arcade","desc":"<p><em>Hansha de Spark!</em> is a 2D top-down arcade game, similar in style to Bomberman, but instead of using bombs, players can shoot energy balls that receive power by bouncing off the special walls. They can collect bonuses to gain advantage. Game features both single-player mode where the player fights against zombie-like regular enemies and bosses, and a multi-player mode where you fights against other players or bots.</p>"},{"name":"Harukaze Sentai V-Force","year":1997,"developer":"Ving Co., Ltd."},{"name":"HatTrick Hero S (Japan)","year":1995,"developer":"Taito Corporation","url":"e#HatTrick%20Hero%20S%20%28Japan%29.zip","filesize":197092093,"score":"","genres":"Sports > Diagonal-down > Arcade > Football (European) / Soccer","desc":"<p><em>Hattrick Hero S</em> reminds us of the side-scrolling arcade soccer games in 2D that were popular in the coin-ops of the 90's, especially of the Super Sidekicks series. In this game we can choose among a large list of national teams (42 in total) from all the continents, and we can compete in either a friendly match, a championship, a world league or a penalty shoot out session. Each team counts with an \"Ace\" player (you can guess who he is by seeing \"Ace\" above his head during a match), or in other words, the man with the best skills in the team. The game also counts with a system that lets you execute special actions during a match, but these have to be \"exchanged\" for something called units (you start every match with 20 of them), so for example, if you want to execute an Hyper Shoot (the most effective shoot in the game) you will have 6 units less. These actions must be executed by your \"Ace\", and he can be as far as the area as he wants, because in all cases the shoot will still be almost unstoppable.</p>"},{"name":"Hebereke's Popoitto","year":1995,"developer":"Sun Corporation","url":"e#Hebereke%27s%20Popoitto%20%28Europe%29.zip","filesize":496531627,"score":6.4,"genres":"Puzzle > Anime / Manga > Real-time > Falling block puzzle","desc":"<p><em>Hebereke's Popoitto</em> is a Tetris variant. The goal in each level is to remove the blocks already on the playfield, representing characters from the franchise. Other blocks fall down from the top of the screen and have to be steered to the right place before touching the ground or another block. When four or more of the same blocks are together, they vanish. The catch of this variant is that the blocks which have to be removed move over the playfield. The player takes the role of the penguin Hebereke who wants to win a tournament against his friends.</p>"},{"name":"Henry Explorers (Japan)","year":1997,"developer":"Konami Co., Ltd.","url":"e#Henry%20Explorers%20%28Japan%29.zip","filesize":401752182,"score":5.7,"genres":"Action > 1st-person > Arcade > Rail shooter > Shooter > Horror","desc":"<p>Crypt Killer is a horror-themed lightgun shooter. As a tireless adventurer, you are looking for the \"Eyes of Guidance\", ancient crystals of mysterious power. To find them, you have to shoot your way through hordes of monsters.</p><p>The game has six stages which can be taken on in any order. Each stage consists of four acts. The levels range from dark forests to deep caves, ancient crypts and underwater labyrinths. You move through the 3D levels on a predetermined path and shoot at skeletons, zombies, spiders, demons and other foul beasts. Your standard weapon is a shotgun, but you can gain additional weapons like gatling guns and grenade throwers. Some enemies throw projectiles like knives or bones at you, so be sure to aim at those as well. If the screen becomes too crowded, clear it with a smartbomb. At the end of some acts, you can choose from one of two paths through the next act, giving you different ways of completing a stage. At the end of each stage, a boss enemy awaits.</p>"},{"name":"Herc's Adventures","year":1997,"developer":"LucasArts Entertainment Company LLC"},{"name":"Hexen","year":1996,"developer":"Raven Software Corporation","url":"e#Hexen%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":538160908,"score":7.4,"genres":"Action > 1st-person > Shooter > Direct control > Fantasy","desc":"<p><em>Hexen</em> is the sequel to Heretic. While the Heretic was destroying D'Sparil, the other two Serpent Riders have come to your dimension and slaughtered everyone. Or so they thought. Three humans have managed to escape with their lives and now seek vengeance against the Serpent Rider Korax who remains in their world.</p><p>Like <em>Heretic</em>, <em>Hexen</em> is a fantasy game based on an enhanced DOOM engine. All of <em>Heretic</em>'s innovations like vertical looking, flying, and the inventory system have been carried over. The new major changes this time around are three characters for the player to choose from and the level hub system. The characters are the Fighter, the Cleric, and the Mage. Each one has four unique weapons and different levels of speed and armor.</p><p>The hub system steps away from the traditional \"single levels stringed along into episodes\" system which had been carried over into the FPS genre from sidescrollers and made popular by Wolfenstein 3D. In <em>Hexen</em>'s hub system each episode is still made up of interconnected levels, but most of the levels are connected to a single \"hub\" level through portals. There are also portals between some of the \"spoke\" levels. Many of the puzzles in <em>Hexen</em> require travel back and forth between different levels.</p><p>Other innovations in <em>Hexen</em> include weather effects, jumping, earth-quakes, and destructible objects such as trees and vases. The game also includes scripted sequences created with a language called ACS, allowing for much more complex puzzles and dramatic scenes.</p>"},{"name":"Hi-Octane","year":1995,"developer":"Bullfrog Productions, Ltd.","url":"e#Hi-Octane%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":310955476,"score":7,"genres":"Racing / Driving > 1st-person > Behind view > Shooter > Hovercraft > Sci-fi / futuristic","desc":"<p>A futuristic racing game with hover cars, in the same line as Wipeout, using a modified version of the Magic Carpet 2 engine.</p><p>Gameplay takes a straightforward approach, with the directional keys controlling the steering and throttle, and three keys to fire the minigun, missiles or charge the booster. While the minigun has unlimited ammo, both fuel, armour and missiles must be replenished by passing through some marked areas or picking up powerups in the track or by left destroyed opponents. While the vehicles float on the track they are still influenced by the ground material: they slow down on dirt and even more on water. Each track has a number of shortcuts or alternate routes that offer powerups, and some tracks feature gates and ramps that open or close randomly.</p><p>Includes 9 tracks and several game modes (for Saturn owners and PC players with the 1.2 patch installed) such as single race mode (with option to change the number of laps), a Championship mode, Split Screen, Clone Race (beating the ghost of the best race time), Death Match (Where instead of finishing first what matters is finish alive and with the most kills) and Hot Seat, where up to eight players can compete in the same race by taking turns, with the computer taking control of the players' vehicles waiting for their turn. There are six hover cars to choose from: the fast Flexiwing and Outrider, the balanced KD-1 Speeder and Vampyr and the slow but armed to the teeth Berserker and Jugga. In addition to the natural capacity of each, their Minigun, Missle and Booster capacities can be upgraded by picking up powerups during the race. There are Eight teams to choose from, which change the colour of the vehicle: Mad Medicine (white), Bullfrog (aqua green), Storm Riders (purple), Fire Phreaks (orange), DethFest (blue), Foo Fighters (yellow), Gorehounds (red) and Assassins Anonymous (black).</p>"},{"name":"High Velocity: Mountain Racing Challenge","year":1995,"developer":"CAVE Co., Ltd.","url":"e#High%20Velocity%20-%20Mountain%20Racing%20Challenge%20%28USA%29.zip","filesize":312749788,"score":7.2,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing","desc":"<p><em>High Velocity</em> is an arcade-style racing game that allows the player to drive sports cars on twisty roads around Japanese mountain tops. There are 3 tracks on which to drive, each with forward and reverse routes. The player may choose from one of 6 different cars, each with different driving characteristics. There are three different game modes:</p><ul><li>King Battle: The player competes in one of 6 head-to-head races against the computer on each of the tracks. Win all the races and be declared King of the Mountain.</li><li>VS. Battle: The player competes head to head against another player.</li><li>Time Trial: The player races for the best time around a course.</li></ul>"},{"name":"Hissatsu! (Japan)","year":1996,"developer":"KID Corp.","url":"e#Hissatsu%21%20%28Japan%29.zip","filesize":327297029,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control > Japan (Ancient/Classical/Medieval) > Licensed","desc":"<p><em>Hissatsu!</em> is an action game set in Japan during the Edo period, inspired by the popular <em>Hissatsu</em> historical drama series.</p><p>The game has a similar gameplay to the <em>Shinobi</em> series. At the start of each level, players are given a choice of playing as 2 characters out of the available 4 (Including Nakamura Mondo from the aforementioned series) and the game features 5 levels in total. The story is told through cutscenes and a gory cutscene depicting how the protagonist dealt the finishing blow to the enemy is shown after defeating each boss. Each protagonist has their own weapons which can be short range or long range, as well as a special attack that deals extra damage to their foes. Both players and the enemies can block each other's attacks. Players may also swap their characters at any time to allow one of the protagonists to regain their special attack gauge.</p>"},{"name":"Hokuto no Ken","year":1995,"developer":"Natsume Co., Ltd."},{"name":"Hōma Hunter Lime: Perfect Collection","year":1995,"developer":"Copya System Ltd."},{"name":"Horde, The (Germany)","year":1995,"developer":"Toys for Bob Inc.","url":"e#Horde%2C%20The%20%28Germany%29.zip","filesize":557871577,"score":7.5,"genres":"Action > Strategy > Diagonal-down > Isometric > Fantasy","desc":"<p>You are Chauncey, a serving lad who saves his monarch from choking on his meal. The King rewards you with his magical sword, Grimthwacker, and a village, and the mission to go forth and prosper by felling waves of Hordlings, who are bent on eating everything in the province.  The better you get at defending villagers, crops, and cows from Hordlings, the better equipped you become.  Success wins you further favor from the King, along with bigger challenges and more enmity from the evil High Chancellor.There are several types of Hordlings, each with their peculiar style of picking through the edibles under your care.  Success is measured by how many villagers and crops survive each season's gluttonous attacks.</p>"},{"name":"House of the Dead, The","year":1998,"developer":"Sega AM1 R&D Division","url":"e#House%20of%20the%20Dead%2C%20The%20%28Europe%29.zip","filesize":385386558,"score":6.9,"genres":"Action > 1st-person > Arcade > Rail shooter > Direct control > Fantasy > Horror","desc":"<p><em>The House of the Dead</em> is a rail shooter. Go through the four chapters with branching paths and kill all the zombies, avoid killing the humans, and rescue the girl. Shooting various special targets along the way or in a certain time period give the player temporary health and weapon upgrades.</p><p>The Saturn version of the game contains two extra modes called Saturn Mode and Boss Mode. Saturn mode plays like the arcade game, but offers the player different characters to choose from. Character selection matters since they each have varying attributes such as their reload time and how much damage they can take before dying. The Boss Mode allows the player to fight one boss of their choosing or all of the game's four boss monsters consecutively.</p>"},{"name":"Hyper 3D Taisen Battle Gebockers","year":1996,"developer":"Riverhill Soft Inc."},{"name":"Hyper Duel (Japan)","year":1996,"developer":"Technosoft Co., Ltd.","url":"e#Hyper%20Duel%20%28Japan%29.zip","filesize":491336435,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Hyper Duel</em> is a 2D side-scrolling space shooter. The player controls one of three \"Buster Gears” pilots: Keith Spader, Lisa Rowling, or Dr. B. Lloyd, and must destroy alien forces. \"Buster Gears” look like normal spaceships from other games but have two modes - spaceship and robot - with different fire modes. The ships can also acquire additional helper units (similar to option from  Gradius  but more independent) by collecting either the T or G items. The weapon can be upgraded by collecting P items. There are eight stages.</p>"}]