[{"name":"Ide Yōsuke Meijin no Shinmi Sen Mahjong","year":1996,"developer":"Capcom Co., Ltd."},{"name":"Idol Janshi Suchie-Pai II","year":1996,"developer":"Jaleco Entertainment, Inc."},{"name":"Idol Janshi Suchie-Pai Mecha Genteiban: Hatsubai 5 Shūnen Toku Package","year":1998,"developer":"Jaleco Ltd."},{"name":"Idol Janshi Suchie-Pai Secret Album","year":1999,"developer":"Jaleco Entertainment, Inc."},{"name":"Idol Janshi Suchie-Pai Special","year":1995,"developer":"Jaleco Ltd."},{"name":"Idol Mahjong Final Romance 2 (Japan)","year":1995,"developer":"Video System Co., Ltd.","url":"e#Idol%20Mahjong%20Final%20Romance%202%20%28Japan%29.zip","filesize":216964692,"score":"","genres":"Strategy > 1st-person > Anime / Manga > Cards / tiles > Adult","desc":"<p><em>Taisen Idol-Mahjong Final Romance 2</em> is the second game in the <em>Final Romance</em> series and the first to feature anime-style girls instead of digitized photos of real models. It is also the first to be ported to home systems. Like the first, you play strip mahjong against various girls. You can use your score to purchase various cheating methods.</p>"},{"name":"Idol Mahjong Final Romance R (Japan)","year":1996,"developer":"Kool Kizz Amusement Works","url":"e#Idol%20Mahjong%20Final%20Romance%20R%20%28Japan%29.zip","filesize":303466038,"score":"","genres":"Strategy > 1st-person > Anime / Manga > Cards / tiles > Adult","desc":"<p>The third <em>Final Romance</em> game. Challenge several girls to strip mahjong. If you win, you get to watch animated strip sequences. Points earned may be spent on cheating devices.</p>"},{"name":"Impact Racing","year":1997,"developer":"Funcom Dublin Ltd.","url":"e#Impact%20Racing%20%28USA%29.zip","filesize":482389136,"score":6.8,"genres":"Action > Racing / Driving > 1st-person > Behind view > Shooter","desc":"<p>With disregard for a background story, Funcom Dublin offers a Wipeout-esque mix of racing and driving at a very fast pace. Completing laps within the allotted time does not suffice, you also need to destroy a certain amount of vehicles. Contrary to the aforementioned title, you drive ordinary racing cars, if you count out the mounted weapons. These include mines, concussion missiles, smart bombs, heat-seeking missiles, lasers and firewalls. Some are provided by taking out enemies, but power-ups, time bonuses, energy, armor and a handicap that turns the screen upside-down, can also be collected.</p><p>Five cars are available, with different statistics and built-in weapons. The initially weak weapon is soon replaced when you collect upgrade icons. To activate these, you have to complete a bonus stage after which you can also save your game. To add to the game's length, each of the twelve tracks, based on the settings \"city\", \"mountain\" or \"space\", has three variations: reverse, at night or the combination of the two. Other features include a small diagram showing approaching cars to time your mines, and pumping electronic tracks to match the game's pace.</p>"},{"name":"In the Hunt","year":1995,"developer":"Irem Corp.","url":"e#In%20the%20Hunt%20%28Europe%29.zip","filesize":438115322,"score":7.1,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Naval / watercraft > Sci-fi / futuristic","desc":"<p>A 2D side scrolling shooter in which you take control of a small attack submarine and engage in underwater combat. The Dark Anarchy Society's forces threaten to destroy the earth's most important cities  and only you can get past their defenses and destroy their secret underwater lair.</p><p>In the Hunt follows the classic template for 2D shooters, with the added feature of being able to control scrolling speed. Includes seven levels of underwater action (and keep an eye out for threats from above the surface), upgradeable weapons, and two player cooperative gameplay.</p>"},{"name":"Incredible Hulk, The: The Pantheon Saga","year":1996,"developer":"Silicon Dreams Studio Ltd.","url":"e#Incredible%20Hulk%2C%20The%20-%20The%20Pantheon%20Saga%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":512303368,"score":5.4,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Licensed","desc":"<p><em>The Incredible Hulk</em> is an isometric 3D action game.</p><p>The popular Marvel comic book hero <em>The Hulk</em> returns to the PC, Playstation and Saturn systems to battle tons of lowly enemies and the occasional monstrous super-villain. When the lawful Pantheon society of superheroes kidnaps the green giant, he joins forces with his abductors and smashes through 13+2 isometric 3D levels (in a look reminiscent of the Loaded series of games).</p><p>True to the comic books, the Hulk relies on no other weapons than his massive muscles to punch, kick and crush his enemies. When he has accumulated enough gamma energy, he may use powerful special moves like a Vortex Spin or the Floor Hammer. Rare bonus items also allow the Hulk to summon one of the four Pantheon team members Atalanta, Ulysses, Ajax and Hector to assist in the thick of battle. </p><p>Most levels include at least one arch-enemy, such as Piecemeal, Trauma &amp; Lazarus or the U-Foes. Luckily, the Hulk’s regenerative powers allow him to regain health slowly. Little seems to be left of the Hulk’s legendary leaping capacity, however, so the green meat ball is forced to hop from platform to platform every now and then. </p><p>You can find more information on <em>The Incredible Hulk</em> comic books in the trivia and links sections.</p>"},{"name":"Independence Day: The Game","year":1997,"developer":"Radical Entertainment Inc.","url":"e#Independence%20Day%20-%20The%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.zip","filesize":352332858,"score":5,"genres":"Action > Simulation > 3rd-person (Other) > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic > Licensed","desc":"<p>This arcade game is based loosely on the 1996 blockbuster movie \"Independence Day.\" Interspersed with cutscenes lifted from the film, the game consists of flying a jet through various missions in order to take down the gargantuan, city-destroying spaceships. This entails flying around the 3D level and taking out targets such as: communication uplinks, shield generators, the occasional alien fighter craft, and ultimately bringing down the major alien ship via a strike on its main cannon. Powerups are plentiful, such as medical packs that heal your jetcraft, bonus weapons, bonus planes, and an item that freezes enemy planes for a brief time.</p><p>Mission settings include the Grand Canyon, Washington D.C., and New York City. There are other missions that are provided on a need-to-know basis (as stated in the manual). The game also features 2-player head-to-head action via a network or null modem link.</p>"},{"name":"Interactive Movie Action: Thunder Storm & Road Blaster (Japan) (Disc 1) (Thunder Storm)","year":1995,"developer":"Data East Corporation","url":"e#Interactive%20Movie%20Action%20-%20Thunder%20Storm%20%26%20Road%20Blaster%20%28Japan%29%20%28Disc%201%29%20%28Thunder%20Storm%29.zip","filesize":394594960,"score":"","genres":"Action > Compilation > 1st-person > Anime / Manga > Full Motion Video (FMV) > Helicopter","desc":"<p><em>Thunder Storm &amp; Road Blaster</em> is a bundle composed of two discs that features two FMV arcade games by Data East:* Thunder Storm</p><ul><li>Road Blaster</li></ul><p>The bundle was only released in Japan.</p>"},{"name":"Interactive Movie Action: Thunder Storm & Road Blaster (Japan) (Disc 2) (Road Blaster)","year":1995,"developer":"Data East Corporation","url":"e#Interactive%20Movie%20Action%20-%20Thunder%20Storm%20%26%20Road%20Blaster%20%28Japan%29%20%28Disc%202%29%20%28Road%20Blaster%29.zip","filesize":393030169,"score":"","genres":"Action > Compilation > 1st-person > Anime / Manga > Full Motion Video (FMV) > Helicopter","desc":"<p><em>Thunder Storm &amp; Road Blaster</em> is a bundle composed of two discs that features two FMV arcade games by Data East:* Thunder Storm</p><ul><li>Road Blaster</li></ul><p>The bundle was only released in Japan.</p>"},{"name":"Iron Man & X-O Manowar in Heavy Metal (Japan)","year":1996,"developer":"Realtime Associates, Inc.","url":"e#Iron%20Man%20%26%20X-O%20Manowar%20in%20Heavy%20Metal%20%28Japan%29.zip","filesize":451095501,"score":5.7,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>This game is a linear beat 'em up Final Fight type game with the choice to play as one of two comic book heroes: Iron Man or X-O Manowar. The game follows the pattern of sidescrolling action in each level with a comic book boss at the end of each.</p><p>Levels are as follows:1. Nuclear Plant Siege with bosses Mr. Hyde and the Melter.2. Stark Enterprises with bosses Titania, Yellowjacket and Goliath.3. Retake New York City with bosses Vizier and Mistress Crescendo.4. Dromak Base Assault with bosses Absorbing Man and Dromak Gladiator.5. Assault on Zola's Castle with bosses Arnim Zola and Mistress Crescendo.6. Alien Dig: The Cosmic Cube with bosses Baron Zemo and Mistress Crescendo.7. Board Dromak Ship with Final Boss General Krytos.</p>"},{"name":"Iron Storm","year":1995,"developer":"Sega AM7 R&D Division","url":"e#Iron%20Storm%20%28USA%29.zip","filesize":284577853,"score":7.9,"genres":"Strategy > Top-down > Turn-based > Tank > Historical events > World War II","desc":"<p><em>Iron Storm</em> is a traditional turn-based strategy game. The original Japanese release was the second entry in Sega's Advanced Daisenryaku series, with gameplay very similar to that of it's 16-bit predecessor, changing some details and using 3D animations for the combat cutscenes. The game uses a hex-based map and features fog-of-war, weather, unit experience, unit upgrading, supply, and other common strategy wargame features.</p><p>Unlike the previous game, three campaigns are available instead of one. Japanese, as well as United States forces can be commanded now in addition to German units. The scenarios that are played during a campaign can change depending on the battle results - a successful player may invade North America for example. There are also ten scenarios with pre-set forces separately available for selection in Standard Mode, during which the control of all involved armies can be switched to a human player.</p>"},{"name":"Ishin no Arashi","year":1997,"developer":"KOEI Co., Ltd."}]