[{"name":"J. League Jikkyou Honoo no Striker (Japan)","year":1998,"developer":"Konami Computer Entertainment Sapporo Co., Ltd","url":"e#J.%20League%20Jikkyou%20Honoo%20no%20Striker%20%28Japan%29%20%281M%29.zip","filesize":184376663,"score":"","genres":"Sports > Side view > Real-time > Direct control > Football (European) / Soccer > Licensed","desc":"<p>Soccer game for the SEGA Saturn by Konami, essentially a version of their International Superstar Soccer franchise that was well known on the N64 and PlayStation.</p>"},{"name":"J. League Victory Goal '96 (Japan)","year":1996,"developer":"Team Aquila","url":"e#J.%20League%20Victory%20Goal%20%2796%20%28Japan%29%20%282M%29.zip","filesize":583311474,"score":"","genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p><em>Victory Goal '96</em>, the direct sequel to Victory Goal (not to be mistaken for International Victory Goal, which unlike the game in question was distributed for all regions), is the game that set the bases further development of Sega Worldwide Soccer 97 and the sequels.</p><p>From the previous games of the series this soccer game just kept the title, because the game engine, music, video scenes and almost everything else, all had the same ingredients that in the West could be seen for first time with the later <em>Worldwide Soccer 97</em>. Also, just as its predecessor, this game includes all the teams of the Japanese J.League (of which it had an official license), but on the other hand, it does not include any international teams. The game features commentary tracks by two of Japan's most famous commentators.</p>"},{"name":"J. League Victory Goal '97 (Japan)","year":1997,"developer":"SIMS Co., Ltd.","url":"e#J.%20League%20Victory%20Goal%20%2797%20%28Japan%29.zip","filesize":553276807,"score":"","genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p><em>Victory Goal '97</em> can be considered Sega Worldwide Soccer 97 but with 17 of the teams of the Japanese Professional Football League. Just like the previous <em>Victory Goal</em> games it does not include any international teams, but instead the updated club teams and player names for the 1997 season.</p><p>The first in the series not developed by Team Aquila but this time adapted by SIMS, it became the last of the series dedicated exclusively to the Japanese league, and also the last of SEGA games to carry \"Victory Goal\". Further releases would use the title \"Worldwide Soccer\", also in Japan.</p>"},{"name":"J.B. Harold: Blue Chicago Blues (Japan) (Disc 1)","year":1995,"developer":"Althi Inc.","url":"e#J.B.%20Harold%20-%20Blue%20Chicago%20Blues%20%28Japan%29%20%28Disc%201%29.zip","filesize":472982163,"score":7.6,"genres":"Adventure > 1st-person > Full Motion Video (FMV) > Detective / mystery","desc":"<p>Following  Murder Club, this is another detective story about the fearless private investigator J.B. Harold. This time, an unknown woman in a red dress was murdered in Chicago. A female detective who began investigating the murder was killed as well, and this time the killer made it look like a suicide. J.B. Harold arrives in Chicago and now has to work together with the local police to solve the mystery.</p><p><em>J.B. Harold: Blue Chicago Blues</em> is an interactive movie. Most of the player's time is spent watching movie footage (with real actors and scenery). At certain points, the movie freezes, and the player is presented with a screen with two or more choices. Each choice advances the clock, so it is necessary to plan well in order not to run out of time and to successfully solve the case.</p>"},{"name":"J.B. Harold: Blue Chicago Blues (Japan) (Disc 2)","year":1995,"developer":"Althi Inc.","url":"e#J.B.%20Harold%20-%20Blue%20Chicago%20Blues%20%28Japan%29%20%28Disc%202%29.zip","filesize":470283907,"score":7.6,"genres":"Adventure > 1st-person > Full Motion Video (FMV) > Detective / mystery","desc":"<p>Following  Murder Club, this is another detective story about the fearless private investigator J.B. Harold. This time, an unknown woman in a red dress was murdered in Chicago. A female detective who began investigating the murder was killed as well, and this time the killer made it look like a suicide. J.B. Harold arrives in Chicago and now has to work together with the local police to solve the mystery.</p><p><em>J.B. Harold: Blue Chicago Blues</em> is an interactive movie. Most of the player's time is spent watching movie footage (with real actors and scenery). At certain points, the movie freezes, and the player is presented with a screen with two or more choices. Each choice advances the clock, so it is necessary to plan well in order not to run out of time and to successfully solve the case.</p>"},{"name":"Jewels of the Oracle","year":1996,"developer":"ELOI Productions","url":"e#Jewels%20of%20the%20Oracle%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%29.zip","filesize":391472339,"score":6.5,"genres":"Puzzle > 1st-person > Top-down > Fixed / flip-screen > Board game > Cards / tiles > Tile matching puzzle > Point and select > Math / logic > Egypt (Ancient) > Middle East","desc":"<p><em>Jewels of the Oracle</em> is a stationary puzzle game with no real story line or plot. A total of 24 ingenious puzzles must be solved, each independent of the others. Most of them can be played in two difficulty levels (Easy or Hard), and the Oracle provides clues to help along the way.</p><p>The graphics for the puzzles are designed in an Egyptian or Mesopotamian style. Music plays in the background to provide atmosphere, but it can be turned off, if it gets repetitive. The basic layout is a hexagon around an Oracle's well. There are three doors on the outside of the hexagon, and the first one is where you begin the game. In each room is a puzzle you have to solve to get a jewel which must be taken back to the Oracle's well.</p><p>The puzzles in this game can be compared to those found in The 7th Guest. The Chinese Checkers puzzle in Shivers rivals many of the ones contained in <em>Jewels of the Oracle</em>.</p>"},{"name":"Jikkyou Oshaberi Parodius: Forever with Me (Japan)","year":1996,"developer":"Konami Co., Ltd.","url":"e#Jikkyou%20Oshaberi%20Parodius%20-%20Forever%20with%20Me%20%28Japan%29.zip","filesize":201637968,"score":7.8,"genres":"Action > Side view > Anime / Manga > Shooter > Comedy","desc":"<p><em>Jikkyō Oshaberi Parodius</em> is the third in the <em>Parodius</em> series. It retains the same gameplay and humorous elements that substantiated the first two games. Gameplay itself is a parody of Konami's famous Gradius series; the screen scrolls from left to right (most times) and the player manoeuvres a flying character around the screen destroying waves of enemies and avoiding obstacles. Unlike previous <em>Parodius</em> titles, this game contains a difficulty adjustment option, allowing the player to make things easier or harder. Also unique to this installment are bits of digital voice acting. Survival throughout the level leads the player to a boss fight, which frequently includes some of the strangest characters in the game. </p><p>Power-ups include, besides the standard version (red, used to upgrade weapons), the shield power-up (blue) and a variety of different coloured bells. Green Bells will make the protagonist huge on the screen; Yellow Bells are worth points (points in turn are worth extra lives); Blue Bells are \"big bombs\" that clear the screen of enemies and can be saved until you need them; White Bells will give the player character a megaphone that will shout out phrases that damage enemies; Red Bells stockpiles the hero with three point-defense lasers, only one of which can be activated at a time and disappears after a short while; Purple Bells will clear the screen of all but the strongest enemies, turning them into power-ups.</p><p>This time around there are sixteen different characters to chose from, each with unique power-ups and weapons. These include familiar faces from earlier games as well as new ones: Vic Viper, the \"gradius ship\" equipped with its traditional Gradius weapons; Pentaro from Penguin Adventure, whose Potion weapon may now hit multiple enemies and his normal weapon shots explode against obstacles; Soitsu, a green stickman surfing aboard a paper airplane, whose laser weapon is able to charge up to deliver more power and who drops little stickmen onto the ground which occasionally dance around rather than attacking; Mike, a cute little kitten who happens to to have a very powerful wave weapon which can travel through obstacles and enemies, as well as a multiple bomb ability which requires his \"upgrade ability\"; Memim, a flying fairy in bikini who carries missile weapons whose direction is determined by her current location on the screen when fired; Tako, the flying octopus wearing a baseball cap; Upa, the flying baby with a Mega Crush ability that destroys all enemies on screen, and others.</p>"},{"name":"Jikuu Tantei DD (Dracula Detective): Maboroshi no Lorelei (Japan) (Disc A)","year":1996,"developer":"System Sacom","url":"e#Jikuu%20Tantei%20DD%20%28Dracula%20Detective%29%20-%20Maboroshi%20no%20Lorelei%20%28Japan%29%20%28Disc%20A%29.zip","filesize":340023521,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Sci-fi / futuristic > Detective / mystery","desc":"<p><em>Jikuu Tantei DD</em> is a detective noir adventure game with a futuristic setting. The game is one big cinematic drama which plays as an interactive movie (think Cyberia). The story takes place aboard a zeppelin ship Lorelei. In 2238 human race got the freedom to use the ability to travel back in time, which eventually led to the emergence of crime. You are a Raizou Narukami, a detective who runs an agency that specializes in space-time crimes. Womanizer at first glance, you are very skilled at what you do, namely in power of observation, reasoning and deduction. You are known as DD (short for Dracula Detective) because your are a direct descendant of legendary Dracula. Due to your genes, you also exert some superhuman powers and abilities.</p>"},{"name":"Jikuu Tantei DD (Dracula Detective): Maboroshi no Lorelei (Japan) (Disc B)","year":1996,"developer":"System Sacom","url":"e#Jikuu%20Tantei%20DD%20%28Dracula%20Detective%29%20-%20Maboroshi%20no%20Lorelei%20%28Japan%29%20%28Disc%20B%29.zip","filesize":437593728,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Sci-fi / futuristic > Detective / mystery","desc":"<p><em>Jikuu Tantei DD</em> is a detective noir adventure game with a futuristic setting. The game is one big cinematic drama which plays as an interactive movie (think Cyberia). The story takes place aboard a zeppelin ship Lorelei. In 2238 human race got the freedom to use the ability to travel back in time, which eventually led to the emergence of crime. You are a Raizou Narukami, a detective who runs an agency that specializes in space-time crimes. Womanizer at first glance, you are very skilled at what you do, namely in power of observation, reasoning and deduction. You are known as DD (short for Dracula Detective) because your are a direct descendant of legendary Dracula. Due to your genes, you also exert some superhuman powers and abilities.</p>"},{"name":"Johnny Bazookatone","year":1996,"developer":"Arc Developments","url":"e#Johnny%20Bazookatone%20%28Europe%29.zip","filesize":500230747,"score":6.5,"genres":"Action > Side view > 2D scrolling > Platform > Shooter","desc":"<p>The original guitar hero with the Elvis attitude and purple hair pompadour, Johnny Bazookatone, has been imprisoned in the year 2050 in Sin Sin Prison by El Diablo, the Lord of the Underworld, who is jealous of his talent and kidnaps other musical legends as well in this 3D side-scrolling platformer.  Johnny's guitar Anita has been taken from him and he sets out to escape and vanquish foes on his way to be reunited with Anita. </p><p>He can perform moves such as 360-degree spin jumps and hover jumps, among others, while using his bazooka guitar as a weapon.  When powered up, it can emit a special sonic blast that fries anything within hearing range. As you make your way through the demonic levels such as Hotel Demonique, Hell's Kitchen, and Mr. Diablo's fiery Penthouse, you can acquire more weapons, power-ups and find secret passages that lead to bonus levels. The game's soundtrack includes the title track contributed by Bon Jovi guitarist Richie Sambora and Tico Torres.</p>"},{"name":"Jonah Lomu Rugby","year":1997,"developer":"Rage Games Ltd.","url":"e#Jonah%20Lomu%20Rugby%20%28Europe%29.zip","filesize":335699484,"score":7.4,"genres":"Sports > 3rd-person (Other) > Rugby > Licensed","desc":"<p>Based on the 1995 Rugby World Cup in South Africa and officially licenced by player of the tournament Jonah Lomu, this game plays as more of an arcade style of gameplay rather than a sports simulation. Players can compete in the full World Cup, a round-robin league, or a knock-out cup.</p><p>The 32 included teams range from the All Blacks of New Zealand and Springboks of South Africa to minnows such as Namibia and Hong Kong, neither of which qualified for the final stages.</p>"},{"name":"Jun Classic C.C. & Rope Club (Japan)","year":1997,"developer":"T&E Soft, Inc.","url":"e#Jun%20Classic%20C.C.%20%26%20Rope%20Club%20%28Japan%29%20%282M%29.zip","filesize":236769646,"score":"","genres":"Sports > Behind view > Cinematic camera > Golf > Licensed","desc":"<p><em>Jun Classic C.C. &amp; Rope Club</em> is a continuation of the T&amp;E SOFT <em>New 3D Golf Simulation</em> series. It is played at the Jun Classic Country Club and the Rope Club in Tochigi Prefecture. Unlike most other games in this series, this one offers two golf courses each of which have three different routes of varying difficulty. The game itself is visually similar to other T&amp;E SOFT golf games released around the same time as it runs on what is largely the same engine. Compared to the fixed viewpoint camera of the predecessors, this game features a cinematic camera, along with optional free roaming \"golf cart\" mode that can be activated from the menu.</p>"},{"name":"Jung Rhythm (Japan)","year":1998,"developer":"Altron Corporation","url":"e#Jung%20Rhythm%20%28Japan%29.zip","filesize":504081751,"score":"","genres":"Action > 3rd-person (Other) > Cinematic camera > Anime / Manga > Full Motion Video (FMV) > Music / rhythm > Japan (Modern/Futuristic) > Comedy","desc":"<p><em>Jung Rhythm</em> is a rhythm action game, whose gameplay is most closely reminiscent of PaRappa the Rapper or Space Channel 5. The player takes the role of Vanilla Essence, a young girl who dreams of being a star, and the story follows her quest from eating breakfast through to a duet with her favourite superstar, the puzzlingly named Mr. Chorking!</p><p>The gameplay itself takes the form of call-and-response dance and song duets with various characters, where the other character will sing a line and you’re asked to repeat it. Lyrics appear in a shaded box at the top of the screen, while input prompts appear in the first of a pair of bars along the bottom of the screen as they sing, and the player then repeats it on the second bar. Ad-libbed inputs are also permitted, and there are specific ad-lib segments.</p><p>Vanilla Essence’s performance is then graded in five categories and given an overall score. A score above 70 is a passing grade, and allows continuing to the next story segment. Between story segments there is a short full-motion video cutscene connecting the dots.</p><p>The game additionally includes a practice mode, as well as a 2-player battle mode, where two players can compare their skills.</p>"},{"name":"Jungle Park: Saturn Shima (Japan)","year":1998,"developer":"Saru Brunei","url":"e#Jungle%20Park%20-%20Saturn%20Shima%20%28Japan%29%20%28Rev%20A%29.zip","filesize":101212460,"score":"","genres":"Adventure > Full Motion Video (FMV) > Point and select","desc":"<p><em>Jungle Park</em> is a point and click adventure game that invites the player to explore the titular park. More a walking simulator than a traditional adventure game, it has few goals and instead lets the player discover the park and its surroundings at their own pace.</p>"}]