[{"name":"Kakinoki Shougi (Japan)","year":1995,"developer":"ASCII Corporation","url":"e#Kakinoki%20Shougi%20%28Japan%29.zip","filesize":159091946,"score":"","genres":"Strategy > Top-down > Fixed / flip-screen > Turn-based > Chess > Direct control > Japan (Modern/Futuristic)","desc":"<p>The player participates in a classic Shogi board game hosted by champion Yoshikazu Kakinoki. Each move made the player gets a voice announcement of the chosen move. Playing by the traditional rules the game, the player has to move different pieces across the 9x9 square board and put the opposing king in checkmate.</p>"},{"name":"Kakyūsei","year":1997,"developer":"Elf Co., Ltd."},{"name":"Keio Flying Squadron 2","year":1996,"developer":"Victor Entertainment Inc.","url":"e#Keio%20Flying%20Squadron%202%20%28Europe%29.zip","filesize":484104968,"score":7.3,"genres":"Action > Side view > Anime / Manga > Platform","desc":"<p><em>Keio Flying Squadron 2</em> is a 2D platform game, departing from the shoot 'em up-oriented style of its predecessor. The player once again controls Rami Nana-Hikari, a fourteen-year-old girl who is also the keeper of a secret treasure that unlocks valuable treasure. Dr. Pon and a new villain, Himiko Yamatai, are hunting for that treasure, and it is up to Rami to stop them.</p><p>Rami traverses side-scrolling levels, defeating enemies and overcoming obstacles with the three tools: a mallet (basic melee weapon), an umbrella (allows Rami to float and deflect projectiles), and a bow (long-ranged weapon). Rami also collects spheres that award the player with useful information and points. A few stages are vertically scrolling or return to the shoot 'em up roots of the series.</p>"},{"name":"Kekkon - Marriage (Japan)","year":1995,"developer":"Westone Co., Ltd.","url":"e#Kekkon%20-%20Marriage%20%28Japan%29.zip","filesize":114369063,"score":"","genres":"Simulation > 1st-person > Anime / Manga > Dating simulation > Menu structures > Romance","desc":"<p><em>Kekkon</em> is a Japanese adventure game in dating simulation style. You meet up to five girls, or guys if you start the game as a female, and go on several dating activities, following a schedule. As time passes your relationship with them might evolve, from girlfriend/boyfriend to fiance, and finally spouse.</p>"},{"name":"Kidō Senshi Gundam: Gihren no Yabō","year":1998,"developer":""},{"name":"King of Fighters '95, The","year":1996,"developer":"SNK Corporation","url":"e#King%20of%20Fighters%20%2795%2C%20The%20%28Europe%29.zip","filesize":497275964,"score":7.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Direct control > Martial arts","desc":"<p>The first sequel in the <em>King of Fighters</em> series picks up a year after the end of the first tournament. Once again, fighters from all over the world receive a mysterious invitation to a team-based fighting tournament. And just like last year, it appears that the notorious criminal Rugal Bernstein is behind it, apparently returning from the dead to raise havok once again...</p><p><em>The King of Fighters '95</em> introduces Kyo Kusanagi's rival Iori Yagami, and firmly places Kyo as the main character for the rest of the series. The gameplay of <em>The King of Fighters '95</em> is essentially unchanged from the previous title, though it does introduce the \"team edit\" concept which would remain as a standard feature of the series. Using the \"team edit\" feature, it is possible to create a totally customized team using any of the available fighters, or use one of the default teams if you wish.</p>"},{"name":"King of Fighters '96, The (Japan)","year":1996,"developer":"SNK Corporation","url":"e#King%20of%20Fighters%20%2796%2C%20The%20%28Japan%29%20%281M%29.zip","filesize":503702886,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting","desc":"<p>\"Violent fighting to come again!\"</p><p>SNK's flagship series returns for another year. Many of the changes in this year's KOF release come in the form of improved graphics, sound effects, music and totally redone character sprites. The gameplay of the system has been altered with the addition of \"Rush\" multi-hit combos and new moves for practically every character. The storyline of the series receives heavy focus in this release with the Orochi Saga swinging into high-gear.</p><p><em>The King of Fighters '96</em> has 27 regular characters plus 2 boss characters (who can be unlocked with the use of a code). Newcomers to the tournament include Mr. Big from the Art of Fighting series, the bosses from Fatal Fury (Wolfgang Krauser and Geese Howard), and completely original characters like Leona Heidern, Mature and Vice. Other features carried over from the previous year include the ability to choose between the default \"Team Fighting\" mode or the traditional \"Single Fighter\" style of gameplay, plus the \"Versus\" and \"Survival\" gameplay modes.</p>"},{"name":"King of Fighters '97, The (Japan)","year":1998,"developer":"SNK Corporation","url":"e#King%20of%20Fighters%20%2797%2C%20The%20%28Japan%29.zip","filesize":488442764,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Regional differences","desc":"<p>Another year, another KOF. Additions this year come in the form of slightly improved graphics and sounds, new moves and a new game mode. Gameplay is much more plot-driven, as you have middle-bosses that can change depending on what team you select. In addition, there are several special endings which are only shown when certain \"Edit Team\" combinations are selected.</p><p>As of <em>The King of Fighters '97</em>, you can play in either the Extra or Advanced game modes. Extra Mode is the typical AOF/KOF scheme, in which your power gauge fills up as you defend yourself or charge yourself up. The new Advanced Mode, on the other hand, only allows you to charge your gauge as you perform special moves and attacks, similar to the Street Fighter series. Extra allows one to sidestep attacks while Advanced allows the character to roll past and dodge attacks; Advanced also allow a character to perform a potent \"Super Desperation Move\" (or SDM) at any time provided the character has at least two full bars of charged energy stored. In contrast, SDMs can only be performed in Extra when a character has less than a quarter of their health left.</p><p>New characters include the New Face Team, the Fatal Fury Outlaw Team (featuring the KOF debut of \"Blue\" Mary Ryan and Ryuji Yamazaki, and the return of Billy Kane), and Kyo's pupil Shingo Yabuki. In total, <em>The King of Fighters '97</em> sports 29 separate characters (without counting the six Orochi-related boss characters, which are all accessible via a secret code).</p>"},{"name":"King of Fighters Best Collection, The","year":1998,"developer":"SNK Corporation"},{"name":"Kiss yori...","year":1999,"developer":"KID Corp."},{"name":"Koi no Summer Fantasy: in Miyazaki Seagaia (Japan)","year":1997,"developer":"Japan System Supply","url":"e#Koi%20no%20Summer%20Fantasy%20-%20in%20Miyazaki%20Seagaia%20%28Japan%29.zip","filesize":459912469,"score":"","genres":"Simulation > 1st-person > Full Motion Video (FMV) > Live action > Dating simulation > Menu structures > Japan (Modern/Futuristic) > Romance > Licensed","desc":"<p><em>Koi no Summer Fantasy: in Miyazaki Seagaia</em> is a dating simulation made to promote the Seagaia Ocean Dome. In it, players take idol Megumi Okina on a date through the eponymous water park, experiencing various attractions and making dialogue choices at pre-determined points in the story.</p>"},{"name":"Konami Antiques: MSX Collection Ultra Pack (Japan)","year":1998,"developer":"Konami Computer Entertainment Studios Yokohama","url":"e#Konami%20Antiques%20-%20MSX%20Collection%20Ultra%20Pack%20%28Japan%29%20%282M%29.zip","filesize":108895758,"score":"","genres":"Compilation","desc":"<p>This collection of Konami MSX games bundles the three previous PlayStation releases in the series. The full list of 30 games includes:</p><ul><li>Athletic Land</li><li>Antarctic Adventure</li><li>Comic Bakery</li><li>Gofer no yabō: Episode II</li><li>Gradius</li><li>Gradius 2</li><li>Hyper Sports II</li><li>Hyper Sports III</li><li>Knightmare</li><li>King's Valley</li><li>Konami's Boxing</li><li>Konami's Golf</li><li>Konami Rally</li><li>Konami's Soccer</li><li>Konami's Tennis</li><li>Magical Tree</li><li>Mopiranger</li><li>Parodius</li><li>Penguin Adventure</li><li>Ping-Pong</li><li>Pippols</li><li>Road Fighter</li><li>Salamander</li><li>Sky Jaguar</li><li>Super Cobra</li><li>Time Pilot</li><li>Twin Bee</li><li>Yie Ar Kung-Fu</li><li>Yie Ar Kung-Fu 2: The Emperor Yie-Gah</li></ul>"},{"name":"Krazy Ivan","year":1996,"developer":"Psygnosis Limited","url":"e#Krazy%20Ivan%20%28Europe%29.zip","filesize":478356771,"score":6.6,"genres":"Action > 1st-person > Arcade > Shooter > Mecha / giant robot > Europe > Middle East > Sci-fi / futuristic","desc":"<p>In the early 21st century, the Earth is under attack by aliens. In five areas of the planet, they have erected energy generators, creating a field that slowly encompasses the entire planet surface. They have also taken hundreds of humans prisoner. Someone has to stop them. Enter Russian Commander Ivan Popovich, nicknamed \"Krazy Ivan\". He is a paranoid schizophrenic, prone to burst out into violence at any time. In other words, he's perfect for the job.</p><p>The player controls Ivan's \"Steel Cossack\" power suit on the three-dimensional battlefields. In each of the five areas in the game, two kinds of enemies can be found: Drones and Sentients. Drones are smaller air and ground vehicles that often respawn. Sentients are mechs similar in size and capability to the Steel Cossack. Each of the Sentients must be eliminated before the energy field generator can be destroyed to complete the mission.</p><p>The Cossack is capable of carrying lots of weapons: projectile and energy guns, unguided and guided missiles, and other special weapons. Destroyed enemies reveal captured humans, to be rescued by Ivan, and power-ups, which recharge shields or rearm weapons.</p><p>After a successful mission, Ivan can upgrade the Cossack with more powerful weapons and replace the mech's armor.</p><p>Between the missions, rather humorous live-action cutscenes (starring English actors sporting thick Russian accents) continue the story.</p>"},{"name":"Kunoichi Torimonochō","year":1998,"developer":"Polestar Co., Ltd."},{"name":"Kuro no Danshou: The Literary Fragment (Japan)","year":1997,"developer":"Abogado Powers","url":"e#Kuro%20no%20Danshou%20-%20The%20Literary%20Fragment%20%28Japan%29%20%282M%29.zip","filesize":515598600,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Adult > Detective / mystery > Horror","desc":"<p><em>The Literary Fragment</em> is the first game in  Abogado's mystery/horror/adult  Detective Suzusaki series. The story focuses on Satoshi Suzusaki, a private investigator with a tragic past, which has left a permanent scar on his life and mental abilities. The case that opens the game's story is a horrifying death of an entire family in their house, at the dining table; circumstances lead to an assumption of either a ritual suicide or murder. Suzusaki, his lovely secretary Asuka, and his young friend, psychologist extraordinaire Kusanagi, have to do everything in their powers to solve the case, while the hero's mysterious past continuous to haunt him...</p><p>Though Suzusaki is the main hero of the game, the player sometimes controls and sees the events from Kusanagi's point of view. The gameplay is point-and-click adventure without puzzles. To interact with the object, the player is required simply to click on it. Sometimes, different ways of interactions open up, such as verb commands, dialogue choices, and decision-making.</p><p>The game features scenes with horror content as well as explicit sexual situations.</p><p>Sega Saturn release comes with a bonus CD-ROM which includes:</p><ul><li>Audio track - game soundtrack (21 tracks in total)</li><li>Data track - containing character, background, and CG art comparison between PC-98 and Sega Saturn versions</li></ul>"},{"name":"Kururin Pa! (Japan)","year":1996,"developer":"Sky Think Systems Co. Ltd.","url":"e#Kururin%20Pa%21%20%28Japan%29.zip","filesize":394035536,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Anime / Manga > Real-time > Falling block puzzle","desc":"<p><em>Kururin Pa!</em> takes an explosive take on the falling block genre. Players drop pairs of blocks containing string; linking up different blocks of string can produce long lines that cross the playfield. Sometimes, the player will be given a spark of fire instead; lighting up one of the ends of a piece of string will set the entire piece on fire, destroying many pieces at once. In addition to the string, there are a few garbage blocks: snowmen, who melt when adjacent squares are comboed; and two different kinds of bombs, which expand the players' combo abilities.</p>"},{"name":"Kuusou Kagaku Sekai Gulliver Boy (Japan) (Disc 1)","year":1996,"developer":"Hudson Soft Company, Ltd.","url":"e#Kuusou%20Kagaku%20Sekai%20Gulliver%20Boy%20%28Japan%29%20%28Disc%201%29.zip","filesize":446907137,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Licensed","desc":"<p>The game is based on the anime <em>Gulliver Boy</em>, created by Teruhisa Hiroi. Gulliver is a young boy who studies magic in a school in a small town in Italy, but is bored with the studies and craves adventure. After he gets his magical diploma, he goes to Venice to hook up with his best friends - the girl Misty, who has healing powers, and the genius inventor Edison. Together, they must stop the plot of the Spanish crown to dominate the world.</p><p><em>Kūsō Kagaku Sekai Gulliver Boy</em> differs greatly from the Super Famicom interpretation of the anime. Unlike that action role-playing game, it is a traditional Japanese-style turn-based RPG. It utilizes traditional battle system with a four-heroes party, physical attacks and magic, etc. Stand-out features include a money system that is based on trading rather than obtaining gold from defeated foes, and the fact that the enemies are visible on the field and the combat initiates once Gulliver comes into contact with them, rather than appearing randomly.</p><p>Much of the exploration in the game is done by navigating a ship across the Mediterranean sea. Though story progression is linear, several areas of the game's fairly vast world can be explored in a non-linear fashion. The setting is loosely based on real world locations, with deliberately stereotypical, comical and anachronistic elements, involving science fiction and supernatural themes. The game features full-motion anime-style movies (instead of comic-book-like cutscenes typical for PC Engine CD games) and voice acting.</p>"},{"name":"Kuusou Kagaku Sekai Gulliver Boy (Japan) (Disc 2)","year":1996,"developer":"Hudson Soft Company, Ltd.","url":"e#Kuusou%20Kagaku%20Sekai%20Gulliver%20Boy%20%28Japan%29%20%28Disc%202%29.zip","filesize":487854236,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Licensed","desc":"<p>The game is based on the anime <em>Gulliver Boy</em>, created by Teruhisa Hiroi. Gulliver is a young boy who studies magic in a school in a small town in Italy, but is bored with the studies and craves adventure. After he gets his magical diploma, he goes to Venice to hook up with his best friends - the girl Misty, who has healing powers, and the genius inventor Edison. Together, they must stop the plot of the Spanish crown to dominate the world.</p><p><em>Kūsō Kagaku Sekai Gulliver Boy</em> differs greatly from the Super Famicom interpretation of the anime. Unlike that action role-playing game, it is a traditional Japanese-style turn-based RPG. It utilizes traditional battle system with a four-heroes party, physical attacks and magic, etc. Stand-out features include a money system that is based on trading rather than obtaining gold from defeated foes, and the fact that the enemies are visible on the field and the combat initiates once Gulliver comes into contact with them, rather than appearing randomly.</p><p>Much of the exploration in the game is done by navigating a ship across the Mediterranean sea. Though story progression is linear, several areas of the game's fairly vast world can be explored in a non-linear fashion. The setting is loosely based on real world locations, with deliberately stereotypical, comical and anachronistic elements, involving science fiction and supernatural themes. The game features full-motion anime-style movies (instead of comic-book-like cutscenes typical for PC Engine CD games) and voice acting.</p>"},{"name":"Kyuutenkai: Fantastic Pinball","year":1995,"developer":"Technosoft Co., Ltd."}]