[{"name":"Langrisser III","year":1996,"developer":"NCS Corporation","url":"e#Langrisser%20III%20%28Japan%29%20%281M%29.zip","filesize":328944696,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>This is a prequel to the two Langrisser games (the first one is known in the US as Warsong). The events of the third game occur thousand years before those described in the first \"Langrisser\". The story centers around the creation of a holy sword named <em>Langrisser</em>, and the first Descendants of Light, the only people who can wield it. The main character is the knight Diharuto, the ancestor of Leon (Elwin's rival in \"Langrisser II\"). He must defeat the evil Boser, who is bound to the evil sword Alhazzard.</p><p>In <em>Langrisser III</em>, you don't control whole armies, but only their generals, whom you move around the battle field. Once two enemy generals meet each other, a 3D battle sequence occurs, during which the two armies fight; the outcome of the battle is decided only by the victory or defeat of the general. The game also features <em>love simulation</em> elements: depending on the main hero's responses to various female characters, you can raise their \"love level\".</p>"},{"name":"Langrisser IV","year":1997,"developer":"Career Soft","url":"e#Langrisser%20IV%20%28Japan%29%20%281M%2C%203M%29.zip","filesize":461164936,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Langrisser IV</em> is the fourth in the long-running Japanese strategy RPG series.</p><p>Cleons, the king of the country Regenburg, offers his general Gizarov a reward for his achievements on the battlefield. For a mysterious reason, Gizarov chooses only one small town, called Gotaal. Immediately after having the town in his possession, Gizarov presses the population with heavy taxes. Landius, the son of Gotaal's mayor, fails to convince Gizarov to stop raising the taxes, and as a result, he has no other choice but to support the people in rebellion...</p><p>The game returns to the traditional gameplay style of the first two <em>Langrisser</em> games. You create your character and choose his class by answering questions in the beginning of the game (similar to Ultima games). Before the battles, you should recruit mercenaries, buy weapons and items, etc. Once in battle mode, you command several units led by stronger generals. Each unit has its own \"judgment\" ability; units with high judgment ability will perform more moves during a turn.</p>"},{"name":"Langrisser V: The End of Legend","year":1998,"developer":"Career Soft","url":"e#Langrisser%20V%20-%20The%20End%20of%20Legend%20%28Japan%29%20%281M%29.zip","filesize":398094463,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Fantasy > Sci-fi / futuristic","desc":"<p>The story of <em>Langrisser V</em> is closely connected to the one told in Langrisser IV - the two games form a kind of a sub-series within the Langrisser universe. </p><p>The game's plot revolves around Sigma, an artificial human created by the great warlock and scientist Gizarov. One day, Sigma is awakened from his sleep inside a storage crystal in one of Gizarov's labs by Lambda, a girl who was also created by the scientist. Apparently, a powerful lord named Rainforce has invaded Gizarov's laboratory with the intention of destroying it. Meanwhile, a powerful artificial human called Omega, another \"child\" of Gizarov, distracts Rainforce. The two heroes flee to Regenburg, a country under Gizarov's rule, only to find out that they will soon have to stop a greater evil endangering the world - a new leader of darkness, who is after the powerful evil sword Alhazard...</p><p><em>Langrisser V</em> features classical Langrisser-style gameplay: you prepare your units before a battle, buy items etc., then in battle, you control various types of army units (archers, pikemen, etc.), together with the generals. The \"Judgment System\" from the previous game is back: your units can perform several moves per turn depending on their \"judgment level\". Like in Langrisser III, there is an element of \"love simulation\" in the game - at certain points you'll have to choose between various answers that will determine the further development of your relationship with the female party members.</p>"},{"name":"Langrisser: Dramatic Edition","year":1998,"developer":"Career Soft","url":"e#Langrisser%20-%20Dramatic%20Edition%20%28Japan%29%20%281M%29.zip","filesize":552753044,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>This is a remake of two games: Langrisser (known as <em>Warsong</em> in the USA) and its sequel, Langrisser II – or, better to say, the enhanced version of this sequel, known as Der Langrisser. </p><p>The remake features the Ultima-style character creation (you choose between various answers to morally provoking questions) introduced in <em>Der Langrisser</em>, and also offers a branching storyline (you can be good or side with the evil forces, if you wish). </p><p>The Sega Saturn port titled <em>Langrisser: Dramatic Edition</em> adds 2 new story lines to the <em>Langrisser II</em> part. One is \"true brilliant\" route which is the best ending that allows most characters to stay alive at the ending. The other one, \"downfall\" route, is a totally tragic ending as the name suggests.</p>"},{"name":"Last Bronx","year":1997,"developer":"Sega AM3 R&D Division","url":"e#Last%20Bronx%20%28Europe%29.zip","filesize":373318275,"score":7.3,"genres":"Action > 3rd-person (Other) > Fighting","desc":"<p>The leader of Soul Crew, the toughest gang in Tokyo, was viciously killed. Shortly after that an anonymous challenge appeared in graffiti scrawls all over the city \"inviting\" all of the city's gang leaders to a fighting tournament that will settle which group has the power to rule Tokyo. Everyone knew refusing to participate was not an option.</p><p>Just like in Virtua Fighter 2, you fight in 3D stages and every character has its unique style and feel. But unlike the PC version of Virtua Fighter 2, where the background of every stage is a flat picture, in Last Bronx all the scenery is done in 3D. Plus, you can taunt your opponent during the fight!</p>"},{"name":"Last Gladiators: Digital Pinball","year":1995,"developer":"KAZe Co., Ltd.","url":"e#Last%20Gladiators%20-%20Digital%20Pinball%20%28USA%29%20%283S%29.zip","filesize":521285777,"score":7.4,"genres":"Simulation > Top-down > Pinball","desc":"<p><em>Digital Pinball: Last Gladiators</em> is a pinball simulator. It has four different tables (Gladiators, Knight of the Roses, Dragon Showdown and Warlock). Each table has approximately 10 rounds and a multiball mode. The manual includes a map and detailed round descriptions for each table.</p>"},{"name":"Layer Section II","year":1997,"developer":"Taito Corporation","url":"e#Layer%20Section%20II%20%28Japan%29.zip","filesize":605221534,"score":7.3,"genres":"Action > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>RayStorm</em> is a shoot'em-up game created for the arcades, later ported to the Playstation and Saturn home consoles. Although there is no story connection, it is often thought of as the spiritual successor to RayForce, which had similar gameplay.</p><p>You have 2 weapons at you disposal, a vulcan gun and a lock-on missile attack. You can also do 2 special attacks by using the lock-on system in a special way. The graphics are all in 3D, but the gameplay mechanics are in 2D. There are 7 stages, each ending with a giant end boss.</p>"},{"name":"Legend of Heroes I & II, The: Eiyuu Densetsu","year":1998,"developer":"Nihon Falcom Corp.","url":"e#Legend%20of%20Heroes%20I%20%26%20II%2C%20The%20-%20Eiyuu%20Densetsu%20%28Japan%29.zip","filesize":426922688,"score":"","genres":"Compilation > Role-playing (RPG) > Fantasy","desc":"<p><em>The Legend of Heroes I &amp; II</em> is a bundle composed of two games of the Legend of Heroes series:* The Legend of Heroes</p><ul><li>The Legend of Heroes II</li></ul><p>The bundle was only released in Japan.</p>"},{"name":"Legend of Oasis, The","year":1996,"developer":"Ancient Co. Ltd.","url":"e#Legend%20of%20Oasis%2C%20The%20%28USA%29.zip","filesize":58328123,"score":8.1,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Top-down","desc":"<p>Long time ago, Reharl, the King of Spirits, fought the destroyer Agito. Both sides used powerful armlets - Golden and Silver. Many years later, a warrior named Ordan found the Golden Armlet. recognizing unseen powers in his apprentice Leon, Ordan gave the armlet to him. Leon must become the new King of Spirits and defeat Agito, who is believed to be in possession of the Silver Armlet. In order to gain the power of the six Spirits, Leon must descend into the Spirits' dungeons. </p><p><em>The Legend of Oasis</em> is the prequel to  Beyond Oasis, also known as <em>The Story of Thor</em>. Like its predecessor, it is an action game with role-playing elements. The gameplay is quite similar to that of <em>Beyond Oasis</em>. Leon can attack with melee weapons or use a bow for long-ranged attack. His armlet also allows him to summon spirits, who would damage the enemy or heal Leon. Instead of the usual experience points system the game features \"ranks\" (equivalent to levels); higher ranks increase the protagonist's hit points and can be gained by recovering his health multiple times.</p>"},{"name":"Linda³: Kanzenban","year":1998,"developer":"MARS Corporation","url":"e#Linda%5E3%20Kanzenban%20%28Japan%29.zip","filesize":425799689,"score":"","genres":"Role-playing (RPG) > 1st-person > Top-down > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p><em>Linda³: Kanzenban</em> (\"Perfect Edition\") is a slightly different version of  Linda³ Again - which, in its turn, is a remake of the PC Engine (TurboGrafx) CD  original version. </p><p>For the most part, the game looks, sounds, and plays exactly the same as the Playstation remake. However, the Saturn version comes with a few extras, in-game as well as in the packaging.</p><p>In addition to the new difficulty levels and mission objectives introduced in the Playstation remake, there are more statistics and battle objectives, which can be selected directly from the main menu and then set on the difficulty/mission selection screen. The game then keeps track of these battle records, similarly to the way it registers the amount of captured animals and other mission objectives.</p><p>Packaging-wise, the game comes with an additional CD which contains the game's soundtrack. A mini artwork book with level designs and character sketches is also included.</p>"},{"name":"Linkle Liver Story","year":1996,"developer":"NexTech Corporation","url":"e#Linkle%20Liver%20Story%20%28Japan%29.zip","filesize":105721949,"score":"","genres":"Action > Role-playing (RPG) > Top-down > Anime / Manga > Sci-fi / futuristic","desc":"<p><em>Linkle Liver Story</em> is an action-oriented RPG that takes place on a distant planet called Mamuuna whose inhabitants are humans with animal qualities. The story centers around the \"Mother Flower\" which gives life to all new beings on the planet when one day it disappears.</p><p>This is where the player takes control of a cat-girl character by the name of Kittchu, who is accompanied by a pink seed-pod that resembles a pig, traveling the planet from continent to continent in a tornado whirlwind, vanquishing enemies in an attempt to recover the \"Mother Flower\" and bring order back to the planet.</p><p>The gameplay is reminiscent of the earlier Zelda games, where the player uses various weapons to hack and slash enemies, likewise the players seed companion will charge at enemies from distance. To obtain weapons, the player must search for weapons seeds and using water left behind vanquished enemies to grow them. There are six different color coded seeds to be found which are powered up through four different levels which gives over 120 different weapons to be used. Likewise, health recovery items are acquired in the same manner, by using water to grow special trees that will produce fruit.</p>"},{"name":"Liquid Kids","year":1998,"developer":"Taito Corporation"},{"name":"Loaded","year":1996,"developer":"Gremlin Interactive Limited","url":"sega-saturn-champion-collection-updated/L/Loaded%20%28NA%29.zip","filesize":559660590,"score":7.8,"genres":"Action > Top-down > Shooter","desc":"<p>Loaded is a violent, bloody top-down shooter which places you in the boots of one of six characters, who are all strange and deformed, from a psychotic clown to a huge baby.</p><p>Loaded is a mission based game, where you have to complete various objectives, such as \"escape the prison.\" Throughout each mission, there are tons of enemies to kill.</p><p>You can choose to play through the single player campaign, or you can go head to head in two player.</p>"},{"name":"Lode Runner Extra","year":1997,"developer":"Presage Software, Inc.","url":"e#Lode%20Runner%20Extra%20%28Japan%29.zip","filesize":472015282,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Platform > Direct control","desc":"<p><em>Lode Runner Extra</em> is a stand-alone expansion for Lode Runner: The Legend Returns, featuring 110 new levels for advanced players and an integrated level editor. The gameplay remains the same in this action-platformer, where the objective is to collect all the gold nuggets and bars scattered around each stage to activate a portal to the next level. Red monks chase the main character around the many platforms and ledges, killing the adventurer when finally reaching him. New tools and other helpful pieces of equipment are slowly introduced with cutscenes showing their usage.</p>"},{"name":"Lode Runner: The Legend Returns","year":1996,"developer":"Presage Software, Inc.","url":"e#Lode%20Runner%20-%20The%20Legend%20Returns%20%28Japan%29.zip","filesize":463686171,"score":7.5,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Platform > Direct control","desc":"<p>A resurrection of the original classic platform game with a number of updates such as one and two player options, detailed graphics, character moves, a level editor, and music with sound effects. Besides running from some red-toga wearing \"Mad Monks\" that eat you (like in the \"Beast Master\" movie) if they catch you, you have a few things on hand to use: small bombs, big bombs (nothing will reappear when they destroy something), a drill (for stone floors), booby-traps, and a few other things up your sleeve.</p>"},{"name":"Lost Vikings 2: Norse by Norsewest","year":1997,"developer":"Blizzard Entertainment Inc.","url":"e#Lost%20Vikings%202%20-%20Norse%20by%20Norsewest%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":171140088,"score":7.2,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Fantasy > Sci-fi / futuristic > Comedy","desc":"<p>Get ready for more nights of masochistic puzzle goodness, because the Lost Vikings need your help once again! The brothers (Erik the Swift, Baleog the Fierce and Olaf the Stout) are trying to get back home and you need to guide them through. Two brand new characters (Fang the Werewolf and Scorch the Dragon) also join the fray. Each character has their own special talents and they must be used in concert if you are to win.</p>"},{"name":"Lost World, The: Jurassic Park","year":1997,"developer":"DreamWorks Interactive L.L.C.","url":"e#Lost%20World%2C%20The%20-%20Jurassic%20Park%20%28Europe%29.zip","filesize":470893910,"score":6.4,"genres":"Action > 1st-person > Side view > Sci-fi / futuristic > Licensed","desc":"<p>The dinosaurs are back in this monstrous sequel. Take a dinosaur-stomping adventure through 'Site B' as you try to reach a radiophone to call a helicopter to get you out of there. But your journey won't be easy, because along the way you'll run into fierce, menacing dinosaurs that'll try to catch and eat you.</p><p>Play as characters from the movie and use weapons such as the tranquilizer, rocket launcher, and the shotgun. Featuring music straight out of the movie, many levels and fast gameplay, JURASSIC PARK is back... with bite!</p><p>5 different playable characters, over 30 levels, 20 different dinosaurs, variety of secret paths and hidden areas, 3D rendered graphics.</p>"},{"name":"Lunar 2: Eternal Blue (Disc 1)","year":1998,"developer":"Game Arts Co., Ltd.","url":"e#Lunar%202%20-%20Eternal%20Blue%20%28Japan%29%20%28Disc%201%29.zip","filesize":491076057,"score":7.9,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG)","desc":"<p><em>Lunar: Eternal Blue Complete</em> is a remake of the SEGA CD game Lunar: Eternal Blue. </p><p>Similarly to the remake of the first game in the series, this version features reworked, 32-bit graphics. The anime-style cutscenes of the original have turned into similarly styled movies. Some cutscenes have been removed from the remade version; however, many of the remaining scenes have been expanded.</p><p>A few dungeons are absent in the remake, while a few others were added. Dungeon design have been somewhat simplified compared to the original version. Some monsters (in particular a number of bosses) have a different visual design. </p><p>The most notable gameplay-related change in the remake is the absence of random battles. Enemies are now visibly walking on the screen and can be avoided. Enemy encounters on the world map have been eliminated completely.</p>"},{"name":"Lunar 2: Eternal Blue (Disc 2)","year":1998,"developer":"Game Arts Co., Ltd.","url":"e#Lunar%202%20-%20Eternal%20Blue%20%28Japan%29%20%28Disc%202%29.zip","filesize":519244476,"score":7.9,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG)","desc":"<p><em>Lunar: Eternal Blue Complete</em> is a remake of the SEGA CD game Lunar: Eternal Blue. </p><p>Similarly to the remake of the first game in the series, this version features reworked, 32-bit graphics. The anime-style cutscenes of the original have turned into similarly styled movies. Some cutscenes have been removed from the remade version; however, many of the remaining scenes have been expanded.</p><p>A few dungeons are absent in the remake, while a few others were added. Dungeon design have been somewhat simplified compared to the original version. Some monsters (in particular a number of bosses) have a different visual design. </p><p>The most notable gameplay-related change in the remake is the absence of random battles. Enemies are now visibly walking on the screen and can be avoided. Enemy encounters on the world map have been eliminated completely.</p>"},{"name":"Lunar: Silver Star Story","year":1996,"developer":"Game Arts Co., Ltd.","url":"e#Lunar%20-%20Silver%20Star%20Story%20%28Japan%29.zip","filesize":491999156,"score":8.4,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG)","desc":"<p><em>Lunar: Silver Star Story Complete</em> is an enhanced remake of Lunar: The Silver Star.</p><p>The remake features 32-bit graphics (as opposed to the 16-bit of the original); many of the locations and characters have been re-designed. The anime-style cutscenes from the original have turned into full-motion animated movies. Some scenes were added and/or prolonged.</p><p>While the main storyline remains the same in the remade version, changes were made to some of the quests, dialogue, and motivations of some of the characters. A few characters that play a role in the plot development were added. Some of these changes affect the gameplay as well: for example, a certain character accompanies the party during a major quest in the remake, while in the original that character remained at home.</p><p>Gameplay system also underwent significant changes. The most notable difference is the elimination of random battles; in the remake, enemies are visibly walking on the screen and can be avoided. Also, enemies no longer appear on the world map. The magic system of the game was altered to resemble the one from the original's  sequel. New items have been introduced, and the properties of some others changed. The protagonist Alex's side-kick Nall has now an active role in the battles: he would revive fallen characters, restoring them to 1 HP.</p>"}]