[{"name":"M: Kimi wo Tsutaete","year":1996,"developer":"Nexus Interact, Ltd.","url":"e#m%20%5Bemu%5D%20-%20Kimi%20o%20Tsutaete%20%28Japan%29%20%282M%29.zip","filesize":210748419,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga","desc":"<p><em>M</em> is a love/dating simulation game. The game immediately starts by asking you a series of questions to determine your personality, after which the heroine is determined based on your personality. Similar to other simulation games, player has a set of skills that may be upgraded by performing various tasks. Things like sleeping, working, shopping and such. The game story takes time during the 85 days where you exchange the diary with others, reaching good ending if you connect with someone by the time the time runs out.</p>"},{"name":"Machi","year":1998,"developer":"Chunsoft Co., Ltd."},{"name":"Machine Head","year":1996,"developer":"Core Design Ltd.","url":"e#Machine%20Head%20%28USA%29.zip","filesize":505338507,"score":7.1,"genres":"Action > 1st-person > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Blam! Machinehead is basically a normal 3D shooter where you shoot enemies and explore the futuristic, barren wastelands and abandoned factories and such as you try to save the world. The player controls Kimberly Stride, who is a scientist.She has to save the world from bad DNA that is slowly \"eating\" everything away.</p><p>As a player, you control this hovercraft-thingy which was designed to be a safe vehicle to be in while travelling through this infested world. The game has nice 3D graphics and a very unique mood to it that separates it from the more common shooters.</p>"},{"name":"Madden NFL 97","year":1996,"developer":"Tiburon Entertainment","url":"e#Madden%20NFL%2097%20%28Europe%29.zip","filesize":396802369,"score":7.7,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>The Madden football series makes its debut on the 32-bit consoles with <em>Madden NFL 97</em>. Like the PC version, the game moves into the world of polygonal 3D graphics, but has a unique set of modes, teams and options.</p><p>The game includes the 30 teams of the 1996 NFL season, the 1996 All-Madden team plus 68 classic teams from NFL history. Playing modes include Exhibition, Season and Tournament. All scheduled games during a season can be either played or simulated. The tournament is for either 8 or 16 players in single elimination mode. The game also includes the 30 team's home stadiums plus one extra arena in Hawaii.</p><p>Many features introduced in previous titles are reused here: variable weather (including night games), injuries and substitutions, ten different penalties (all adjustable), two skill levels, a bluffing mode for play calling, color commentary by John Madden, instant replays, and team roster editing with player creation (stats are set from a point pool), trading, releasing and signing of free agents. Player records and season progress can be saved to memory card/backup RAM. A new feature is the possibility to change which team is controlled at any time during a game.</p><p>During a game, the stadiums are rendered in polygonal texture-mapped 3D, with only the players, referees and ball as bitmaps. The game allows to choose from eight different camera perspectives, including views from the end zones and sidelines, a diagonal view and a \"classic cam\" emulating the perspective of earlier titles in the series on Genesis and SNES.</p>"},{"name":"Madden NFL 98","year":1997,"developer":"Tiburon Entertainment","url":"e#Madden%20NFL%2098%20%28USA%29.zip","filesize":475480963,"score":7.5,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>Madden NFL 98</em> is the second game in the series to appear on PlayStation and Saturn. It is based closely on the previous year's edition, but with the usual updates, revisions and several new features. Compared to versions on other platforms, the 32-bit console version comes with its own graphics engine and selection of teams, modes and options.</p><p>The game includes the 30 teams of the 1997 NFL season, the 1997 All-Madden team and 85 classic teams from NFL history, spanning 1960 to 1996. All the team's home stadiums plus the Pro Bowl stadium in Hawaii and the Super Bowl stadium in San Diego are available. Further teams and stadiums can be unlocked via secret codes. Returning playing modes from the predecessor are Exhibition, Season (including Playoffs and Super Bowl, based on the 1997 NFL schedule) and Tournament (8 or 16 player single elimination). Added to these are the new Custom Season and Fantasy Draft. Custom Season allows players to customize the NFL divisions and thus the schedule with all available teams, including the classic teams. Fantasy Draft is a custom tournament mode for four or eight teams. Players create their own teams by giving them names and then drafting players. The tournament consists of a round-robin round followed by semi-finals and finals. The option of creating and trading players also returns, and can be made more realistic by employing salary caps and trading deadlines within a season.</p><p>During a game, the same graphics style employed by the previous year's game is used: polygonally-rendered 3D stadiums with players, ball and referees as 2D bitmaps. The camera can be toggled between several perspectives, with most returning from the predecessor, but some being replaced by new ones.</p>"},{"name":"Madō Monogatari","year":1998,"developer":"Compile"},{"name":"Magic Carpet","year":1996,"developer":"Bullfrog Productions, Ltd.","url":"e#Magic%20Carpet%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CSv%29.zip","filesize":386576609,"score":7.6,"genres":"Action > Compilation > 1st-person > Shooter > Flight / aviation","desc":"<p>This compilation contains:</p><ul><li>Magic Carpet (base game)</li><li>Magic Carpet: Hidden Worlds (add-on)</li></ul><p>In Europe, this version was made available as a re-release of <em>Magic Carpet</em>, not using Plus in the title.</p>"},{"name":"Magic Knight Rayearth","year":1995,"developer":"Sega AM7 R&D Division","url":"e#Magic%20Knight%20Rayearth%20%28USA%29.zip","filesize":498087393,"score":7.4,"genres":"Action > Top-down > Anime / Manga > Fantasy > Licensed","desc":"<p>The balance in the magical world of Cefiro is supported by the prayers of the lovely princess Emerald. When the evil Sage Master imprisoned her, the existence of the entire world was endangered. Using her spiritual powers, the princess contacted three Japanese high-school girls, Hikaru, Umi, and Fuu, turned them into Magic Knights, and summoned them to Cefiro, where their goal is to save her and to restore the balance.</p><p>This adaptation of the eponymous manga and anime series is an action game with light role-playing elements, somewhat similar in style to  Zelda games. The protagonists are all the three girls, but the player can controls only one of them at a time. Each one has advantages and disadvantages, as well as different fighting styles: Hikaru uses swords, Umi a rapier, and Fuu a bow. The player advances through the game by exploring the world, talking to non-playable characters, and fighting enemies in real-time combat. There is no experience system; new abilities (among them swimming and jumping) are gained as dictated by the story, and must be used in certain points in order to advance.</p>"},{"name":"Magical Drop","year":1995,"developer":"Data East Corporation","url":"e#Magical%20Drop%20%28Japan%29.zip","filesize":317039804,"score":7.4,"genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Tile matching puzzle > Direct control","desc":"<p>This is the very first coin-op game (and home conversions) in the <em>Magical Drop series</em>. Similar to other titles in the series, the goal of the game is to clear the screen of constantly advancing objects called 'drops'. The player character, stuck at the bottom of the screen, has a grapple which can be used to pull down a single drop, change its colour and put it back in line. Drops disappear when a line of three or more drops of the same colour is created.</p><p>There are several game modes: endless mode, story mode, two-player mode, and puzzle mode.</p>"},{"name":"Magical Drop 2","year":1996,"developer":"Data East Corporation","url":"e#Magical%20Drop%202%20%28Japan%29.zip","filesize":566700618,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Tile matching puzzle > Licensed","desc":"<p>In <em>Magical Drop II</em>, you control a clown that can grab and throw balloons. You have to match three balloons of the same colour or more vertically to pop them and clear the screen. You can hold multiple balloons of the same colour at once and cause consecutive collisions. There are special balloons that cannot be removed that easily and power-ups that clear entire rows or provide additional help.</p><p>Depending of the originating country, there are different game modes:<em> </em>Survival*: Play as long as you can - an endless flow of balloons appears at a rapidly increasing speed while you move up levels.</p><ul><li><p><em>Puzzle</em>: You have a limited time to clear a fixed set of balloons before time runs out.</p></li><li><p><em>VS Mode</em>: Fight the CPU or a fellow player in a direct split-screen duel. Each character has specific item balloons during gameplay.</p></li></ul>"},{"name":"Magical Drop III: Toretate Zoukangou!","year":1997,"developer":"Data East Corporation","url":"e#Magical%20Drop%20III%20-%20Toretate%20Zoukangou%21%20%28Japan%29%20%282M%29.zip","filesize":566165368,"score":6.7,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Tile matching puzzle > Licensed","desc":"<p>This is the third installment in the puzzle frenzy series Magical Drop. In the game you control a clown who throws marbles up on the screen into the cluster of multi-colored marbles, rocks and crystals. The goal is to get three or more of the same color to remove marbles, but you can also grab more than one at the time to create long chain combos and gain better \"special\" blocks at the top of the screen.</p><p>You can play the game in single player modes or versus a friend in versus mode. In versus mode you get to pick your character, much like in a fighting game, each with their own counter attacks and abilities.</p><p>For the PSX version, the first Magical Drop was included on a separate disc.</p>"},{"name":"Magical Night Dreams Cotton 2","year":1997,"developer":"Success Corp.","url":"e#Magical%20Night%20Dreams%20Cotton%202%20%28Japan%29.zip","filesize":25516613,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter","desc":"<p>The true sequel to Cotton, Cotton 2 introduces Cotton's rival Appli for 2-player support for the first time and the story this time deals with the disappearance of the magic \"Bluewater Willow\" from the Kingdom's treasury. Cotton and Appli must now search the lands for the magic willow battling all the enemies they encounter in the way before its too late.</p><p>The game follows in the 2D-side scrolling shooter roots of the original with new spells, different elemental weapons that can be upgraded with experience crystals and a new energy bar that allows you to take a few hits before going down.</p><p>There are also new \"command\" shots that are triggered by specific controller moves as well as a hit-combo system that allows you to earn more power-ups and items. The Saturn version also has a \"Saturn\" mode which changes the enemy arrangement and makes some changes to the game balance.</p>"},{"name":"Magical Night Dreams Cotton Boomerang","year":1998,"developer":"Success Corp.","url":"e#Magical%20Night%20Dreams%20Cotton%20Boomerang%20%28Japan%29.zip","filesize":23748474,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter","desc":"<p>Cotton Boomerang is sort of an expanded edition of Cotton 2, with remixed levels and enemies. </p><p>The only real differences are in the gameplay mechanics, which aim to make the game more action-oriented by removing the health bar and the restrictions for weapon upgrading. Now that the health bar is gone, you get to select 3 different characters from a group of 8 that act as your \"lifes\" but each has distinct shooting patterns and abilities to enhance the gameplay. Additionally you can switch between characters at will (as long as they are alive) which triggers a bomb-like effect.</p><p>Also includes an art gallery featuring Cotton 2 and Cotton Boomerang material, additional difficulty modes and controller configuration options that allow you to map the command-shots.</p>"},{"name":"Mahjong Gokuu Tenjiku","year":1994,"developer":"Terajima Joho Kikaku Co., Ltd.","url":"e#Mahjong%20Gokuu%20Tenjiku%20%28Japan%29.zip","filesize":563155503,"score":"","genres":"Strategy > 1st-person > Cards / tiles","desc":"<p><em>Mahjong Gokū Tenjiku</em> is a mahjong tournament between characters from <em>Xi You Ji</em> (\"Journey to the West\"), the classic Chinese novel. The player can choose to play as either of the four \"good\" characters from Xi You Ji: the Buddhist monk Xuan Zang, the famous monkey Sun Wukong, the pig Bajie, and Xuan Zang's pupil Wujing. They compete against a variety of Xi You Ji villains. The player can choose a location to set the mahjong game in and can configure most of the mahjong rules to their own preference in a special menu.</p>"},{"name":"Mahjong Taikai II Special","year":1996,"developer":"KOEI Co., Ltd."},{"name":"Mahou Gakuen Lunar!","year":1997,"developer":"Ehrgeiz","url":"e#Mahou%20Gakuen%20Lunar%21%20%28Japan%29%20%282M%29.zip","filesize":510037795,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>This prequel to Lunar: The Silver Star begins in the same town of Burg hundreds of years earlier. Two teenage girls, Elie and Lena, set out to join the Magic School of Ien. There they meet new friends and go on lighthearted adventures around the world.</p><p><em>Lunar</em> is a traditional Japanese RPG, featuring random battles and turn-based combat. Compared to the original Game Gear version, this remake features battles more in tune with the other Lunar games along with an expanded plot, CD audio soundtrack, and animated cutscenes.</p>"},{"name":"Mahoutsukai ni Naru Houhou","year":1998,"developer":"Technical Group Laboratory, Inc.","url":"e#Mahoutsukai%20ni%20Naru%20Houhou%20%28Japan%29.zip","filesize":356086911,"score":"","genres":"Action > Role-playing (RPG) > Simulation > 1st-person > Top-down > Anime / Manga > Meditative / Zen > Real-time > Action RPG > Direct control > Point and select > Fantasy > Medieval","desc":"<p><em>Mahoutsukai ni Naru Houhou</em> is a Simulation/Action Role-playing game taking place on an island. Players take the role of a wizard's apprentice who's aspiring to become a mage and players are given 3 girls to choose from (Lime, Berry or Nut). To become a mage, players must study how they can make scrolls and collect the ingredients necessary to make them. The game features a first person perspective while players are at home and switches to a top-down 2D view when they go outside (The Saturn and Playstation releases render areas in 3D). There are 102 days in a year in this game and 5 seasons during which different materials can be found on the island. The game has 70 kinds of scrolls and around 150 kinds of materials to collect.</p>"},{"name":"Mansion of Hidden Souls, The","year":1994,"developer":"SEGA Enterprises Ltd.","url":"e#Mansion%20of%20Hidden%20Souls%2C%20The%20%28USA%29.zip","filesize":375543976,"score":6.8,"genres":"Adventure > 1st-person > Full Motion Video (FMV) > Video backdrop","desc":"<p>This Saturn-exclusive game is actually a sequel to the Sega CD game Mansion of Hidden Souls, even though the title might lead one to believe it is a remake.</p><p>This game takes place after the events of the first game. The souls of the hidden mansion have asked you to return, because they have recognized that you possess special powers that allow you to see the butterfly manifestations of the souls living there. Something terrible is afoot at the mansion, and you must investigate things and set them right. Along the way you must discover the true purpose of the mansion and it's significance in the universe.</p><p>Much like the Sega CD game, this is an FMV adventure. You move from location to location via video sequences, and solve puzzles to move on in the story.</p>"},{"name":"Manx TT SuperBike","year":1997,"developer":"Sega AM3 R&D Division","url":"e#Manx%20TT%20SuperBike%20%28Europe%29.zip","filesize":244826175,"score":6.7,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Motorcycle","desc":"<p>Race motorcycles in this arcade port based on the real-life Isle of Man Trophy Race.  There are two courses to race with the usual reversed and mirrored variations on the tracks.  Also provided is a short and long version of the main course.  Play modes include arcade (standard tracks), PC mode (added variations), time trial, and network games with up to eight people.</p>"},{"name":"Maria: Kimitachi ga Umareta Wake","year":1997,"developer":"Break"},{"name":"Marica: Shinjitsu no Sekai","year":1997,"developer":"Victor Interactive Software, Inc.","url":"e#Marica%20-%20Shinjitsu%20no%20Sekai%20%28Japan%29.zip","filesize":395006525,"score":"","genres":"Role-playing (RPG) > 1st-person > Top-down > Anime / Manga > Turn-based","desc":"<p><em>Shinjitsu no Sekai</em> means <em>real world</em> in Japanese - and indeed, the game is set in modern-day Tokyo. The protagonist is an ordinary (at least in the beginning) girl named Marica, who lives together with her parents and her little sister. One day a dog steals a piece of meat she bought in a store. Following the dog, Marica encounters a strange, scary-looking man, who turns out to be a former terrorist on the run from his even scarier comrades, who are involved in supernatural activities. Marica becomes the sole owner of information that is vitally important to the terrorist organization, and has to protect her life with her newly discovered paranormal skills.</p><p>Despite the unusual (for an RPG) setting, the gameplay system of <em>Marica</em> is similar to other Japanese RPGs. There are no random enemies, but initiating contact with a hostile character on screen leads to a turn-based battle, viewed from first-person perspective. Marica and the two other girls who join the party later in the game can attack with equipped weapons or execute their special moves. Those attacks are displayed as anime-style still shots. The story is advanced mostly through extensive dialogue (no subtitles) between characters, with large anime-style portraits super-imposed on the background.</p>"},{"name":"Marvel Super Heroes","year":1997,"developer":"Capcom Co., Ltd.","url":"e#Marvel%20Super%20Heroes%20%28Europe%29.zip","filesize":516233688,"score":7.7,"genres":"Action > Side view > Fighting > Licensed","desc":"<p><em>Marvel Super Heroes</em> is a 2D fighting game and the second Capcom title to feature characters from the Marvel comic universe. The gameplay is very similar to X-Men: Children of the Atom, but with a simplified Super Combo gauge and the addition of infinity gems. Each character starts with a set of gems. These can be activated during a fight to improve speed, power and defence, or provide special abilities to create crushing stone walls, open up a rift in space, or reverse the opponent's controls. The use of the gems is inspired by the <em>The Infinity Gauntlet</em> comic book series.</p><p>There are ten playable characters. The heroes are Captain America, The Incredible Hulk, Iron Man, Psylocke, Spider-Man and Wolverine. The villains are Blackheart, Juggernaut, Magneto and Shuma-Gorath. Anita from the Darkstalkers series is a hidden character in the Japanese version. The bosses are Doctor Doom and Thanos. During the boss fight Thanos steals all the player's gems (except for mind) and uses them with new effects.</p>"},{"name":"Marvel Super Heroes vs. Street Fighter","year":1998,"developer":"Capcom Co., Ltd.","url":"e#Marvel%20Super%20Heroes%20vs.%20Street%20Fighter%20%28Japan%29.zip","filesize":436759879,"score":7.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Martial arts > Licensed > Regional differences","desc":"<p><em>Marvel Super Heroes Vs. Street Fighter</em> is a 2D fighting game and the first to combine characters from Capcom's Street Fighter series with those of the Marvel comic universe. It is also the first in Capcom's games to introduce a tag team style of combat where the player can call for another character during a fight.</p><p>Matches consists of two-on-two battles where the player can only control one character at a time. The other character can be called in regularly or while doing an attack. The off-screen one also regains some health while waiting. Both opposing characters need to be defeated to win the match, and when one dies the other is called in automatically. The tag team options introduces Variable Attack, Variable Counter and Variable Combination where the two characters team up to attack, counter of perform a special move.</p><p>Most of the X-Men characters were already present in X-Men: Children of the Atom and Marvel Super Heroes: Cyclops, Storm, Juggernaut, Magneto and Wolverine, with the addition of Rogue, Gambit and Sabretooth. The Street Fighter characters are gathered from Street Fighter Alpha 2: Ryu, Ken, Cammy/Chun-Li, Charlie, Zangief, Dhalsim, M. Bison and Akuma. The final boss of the game is Apocalypse.</p><p>The PlayStation version does not include the tag team feature and relies on the more traditional best-two-of-three round setup.</p>"},{"name":"Mass Destruction","year":1997,"developer":"NMS Software Ltd.","url":"e#Mass%20Destruction%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":406839941,"score":7,"genres":"Action > Strategy > Top-down > Shooter > Tank","desc":"<p><em>Mass Destruction</em> puts players behind the controls of a one-man tank. The environments range from arctic to desert to urban. The player can blow up trees, buildings, walls - whatever you don't like the look. Enemies will come at you in tanks, planes, helicopters, and on foot. Each of the different weapons available to the player works best on a specific enemy. The player can use guided missiles for the helicopters and run over infantry men with the tank.</p>"},{"name":"Masters: Harukanaru Augusta 3","year":1995,"developer":"T&E Soft, Inc.","url":"sega-saturn-champion-collection-updated/M/Masters%20-%20Harukanaru%20Augusta%203%20%28JP%29.zip","filesize":439611958,"score":"","genres":"Sports > 1st-person > Behind view > Free-roaming camera > Live action > Menu structures > Golf > Licensed","desc":"<p><em>Masters: Haruka Naru Augusta 3</em> is a sequel to Masters: Haruka Naru Augusta 2 golf game and in that relation very similar to its predecessor. This game also features the Augusta National golf course and is licensed by Augusta National Golf Club. The game plays from the third-person perspective, showing your golfer sideways with a mini-map of the current hole on the right side of the screen. Several modes are accessible from the main menu, including Masters, Tournament, Stroke Play, Match, and Training.</p><p>Much like its predecessors, the game uses live-action golfers and caddies over 3D golf course terrain. During the rotation of the terrain, the game removes the texture details to moves more smoothly. Camera rotation lets you gain altitude on your current position, check the area around the hole immediately, or use your cart car to drive across the terrain and examine it in more detail before starting.</p><p>When playing a game you can select among four different golfers and four different caddies. Each golfer has its own advantages and disadvantages when playing such as the swinging gauge may be harder or easier to accurately select depending on the type of terrain of the golf club your golfer uses. The terrain level can be checked in more detail even while you're not on the green near the hole, and though it gives little help to use at those places it's still available. The course supports both members and masters tee plays and also includes a detailed guide for every hole. Various records for every hole are saved and can be checked along with other statistics.</p>"},{"name":"Maximum Force","year":1997,"developer":"Mesa Logic, Inc.","url":"sega-saturn-champion-collection-updated/M/Maximum%20Force%20%28NA%29.zip","filesize":369120584,"score":5.3,"genres":"Action > 1st-person > Video backdrop > Arcade > Rail shooter","desc":"<p><em>Maximum Force</em> is the follow up to Area 51, however, this time around instead of shooting up aliens, the player goes up against a terrorist organization.</p><p>The gameplay is similar to other first-person shooter gun games where the player can use a light gun or a controller to shoot at bad guys popping up from behind objects or coming off from the side of the screen. If a player gets shot by a bad guy, they will loose a bar of health or can also loose health by accidentally shooting innocent bystanders.</p><p>There are also power-ups scattered throughout the stage that can restore health, upgrade their weapons power among many others. There are three levels in all and 35 secret rooms scattered throughout the stages. It also supports a second player simultaneously.</p>"},{"name":"MechWarrior 2: 31st Century Combat","year":1997,"developer":"Activision, Inc.","url":"e#MechWarrior%202%20-%2031st%20Century%20Combat%20%28Europe%29.zip","filesize":336419007,"score":8.1,"genres":"Action > Simulation > 1st-person > Behind view > Direct control > Mecha / giant robot > Vehicular combat > Sci-fi / futuristic > War > Licensed","desc":"<p>You are the genetically engineered Clan Mechwarrior. The Clans are invading the Inner Sphere. Join either the Wolf Clan or the Jade Falcon Clan as they pursue their own agenda against the Inner Sphere and other Clans. Take your advanced Omnimechs into battle against all comers. Win high warrior ratings (by using less mechs or smaller mechs than needed, completing secondary objectives, etc.) and you'll get chance at a promotion trial where you face superior odds in an arena. If you win, you advance in rank. If you are very successful, you can make it all the way up to Khan, leader of the Clan.</p><p><em>Mechwarrior II</em> was developed in-house by Activision as the successor to their original Mechwarrior. While this time there are no dynamic campaign and mercenary actions, the Clan culture is integrated into the two campaigns. Different clans have different mechs and different rules, even different weapons. You can customize your mechs in order to use less than the \"par\" force in order to get a higher rating. The game features full 3D environments. The addition of NetMech allowed users to fight each other online. </p><p>When 3D cards came along, special versions of the game were created to take advantage of 3D texturing.</p>"},{"name":"Mega Man 8","year":1997,"developer":"Capcom Co., Ltd.","url":"e#Mega%20Man%208%20%28USA%29.zip","filesize":273072275,"score":7.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>The Blue Bomber returns! The evil Dr. Wily discovers the remains of a strange robot that evidently came from space, and discovers a source of unbelieveablely powerful energy that could allow him to control the world with an army of unstoppable Robot Masters!</p><p>It's up to Mega Man to stop Wily once again! Now joined by a new ally, Duo, Mega Man takes off on his greatest mission yet!</p>"},{"name":"Mega Man X3","year":1996,"developer":"Capcom Co., Ltd.","url":"e#Mega%20Man%20X3%20%28Europe%29.zip","filesize":538928667,"score":7.5,"genres":"Action > Side view > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>A Reploid scientist named Dr. Doppler begins creation of a new city for Reploids, which will bring a new era of peace to the Reploids and humans. But something goes terribly wrong, and now Mavericks have begun to appear everywhere! It's up to X and Zero to find out who is behind this Maverick revolt and bring them down for good!</p><p>For the first time in the series, players can play use X's friend, Zero. However, he is pretty much restricted to only about one third of each level, and has only one life (i.e when he loses all his energy, he is put out of the fight for the rest of the game).</p>"},{"name":"Mega Man X4","year":1997,"developer":"Capcom Co., Ltd.","url":"e#Mega%20Man%20X4%20%28USA%29.zip","filesize":467130890,"score":7.3,"genres":"Action > Side view > Anime / Manga > Arcade > Platform > Shooter > Sci-fi / futuristic","desc":"<p>Mega Man X, the reploid leader of the 17th unit Maverick Hunters, and his best friend Zero have to stop a reploid rebellion. Each of them gets involved in a different way and you can play as either character through the  parallel stories.</p>"},{"name":"Metal Black","year":1996,"developer":"City Connection Co., Ltd.","url":"e#Metal%20Black%20%28Japan%29%20%281M%29.zip","filesize":454973294,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p><em>Metal Black</em> is an arcade 2D side-scrolling shoot'em up, made as continuation of Final Gun Frontier\" and Darius. Aliens (called Nemesis) invaded Earth, won the war, and took most of the raw materials and the player, piloting a spaceship, fights against those aliens. His vehicle is the CF-345 Black Fly, and he must \"fly right, and shoot enemies\". He has only 1 weapon, and collects special pickups to increase firepower (and activate power-beam). The game has 6 levels &amp; 2 bonus levels, each with their own song.</p>"},{"name":"Metal Slug - Super Vehicle-001","year":1997,"developer":"Nazca Corporation","url":"e#Metal%20Slug%20-%20Super%20Vehicle-001%20%28Japan%29.zip","filesize":453369124,"score":8.2,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Tank > War","desc":"<p><em>Metal Slug</em>, originally released on the Neo Geo, is a side-scrolling shoot'em'up.</p><p>The player(s) takes the role of a soldier (or two) and fights a gigantic army. Every level consists of running forward blasting anything that moves, while collecting power-ups along the way (there's also a wide selection of weaponry in the game). In the end of each level the player goes up against one gigantic boss. </p><p>The PlayStation port introduces some extra features: there is a combat school where the player may fight with other players for the best time on each level and an art gallery.</p>"},{"name":"Mighty Hits","year":1996,"developer":"Altron Corporation","url":"e#Mighty%20Hits%20%28Europe%29.zip","filesize":337949065,"score":"","genres":"Action > 1st-person > Arcade > Shooter > Direct control > Western","desc":"<p><em>Mighty Hits</em> is a shooting gallery game and the gameplay and stages are very similar to Point Blank in theme and presentation. The game has a cartoony wild west theme throughout the cut scenes and menu screens.</p><p>One or two players compete in a series of mini games, which last about 20 or 30 seconds each. The rules of the mini games are displayed before each round. In general players have complete objectives and puzzles by shooting at targets. After each round a results screen shows if the objectives were completed or failed. Failing a round and the player loses a life feather, lose all feathers and the game is over.</p><p>There are 3 courses to select from, represented by a blue, green and yellow tin can. There is Easy (6 mini-games), Medium (9 mini-games) and Hard (15 mini-games) and completing hard mode unlocks a black tin can for Very Hard with 18 mini-games. The game is played in sets of 3 stages, the player has to shoot 3 cards to select the stages. The cards are quickly flipping randomly through mini-games. After 3 stages the player draws a bonus card and moves onto the next 3 stages. A bonus card might contain \"2 stage select\" where 2 of the stage cards will flip more slowly allowing the player to purposefully select a stage.</p><p>There are many mini games, including shooting away parts to complete a doll, a Three Shell type game, shoot ice to free a penguin, shoot colored bells to recreate a melody, throwing balls into cups, shoot the object in the room that has changed, and in general shooting at various targets like fish, bees, lights, eggs, floating lanterns, toppling pictures frames and other targets.</p>"},{"name":"Minnesota Fats: Pool Legend","year":1995,"developer":"Data East Corporation","url":"sega-saturn-champion-collection-updated/M/Minnesota%20Fats%20-%20Pool%20Legend%20%28NA%29.zip","filesize":416608058,"score":6.7,"genres":"Simulation > Sports > Top-down > Pool / snooker > Licensed","desc":"<p><em>Minnesota Fats: Pool Legend</em> is a pool game where the player can participate in a story mode and play against a set of pros in six different pool halls in an attempt to face off against Minnesota Fats himself. There are seven different variations of pool to play: Eight-Ball, Nine-Ball, Rotation, 14-1 rack, Three ball, Cut Throat &amp; One Pocket. There is also a <em>Versus Mode</em> to let players take on any opponent of their choice including a two-player option to take on a friend and a <em>Tournament Mode</em>. Players can also try out the <em>Trick Mode</em> that has the player try to compete 16 different trick shots.</p>"},{"name":"Moon Cradle (Disc 1)","year":1997,"developer":"Tose Co., Ltd.","url":"e#Moon%20Cradle%20%28Japan%29%20%28Disc%201%29.zip","filesize":483289891,"score":"","genres":"Adventure > 3rd-person (Other) > Isometric > Live action > Direct control > Menu structures > Japan (Modern/Futuristic) > Detective / mystery","desc":"<p><em>Moon Cradle</em> is a mystery adventure game which uses live-action video for cut-scenes and fixed isometric perspective during actual gameplay. The player controls the character directly while actions such as \"search\", \"talk\" or \"use\" are presented in a menu-selected manner.</p>"},{"name":"Moon Cradle (Disc 2)","year":1997,"developer":"Tose Co., Ltd.","url":"e#Moon%20Cradle%20%28Japan%29%20%28Disc%202%29.zip","filesize":440342567,"score":"","genres":"Adventure > 3rd-person (Other) > Isometric > Live action > Direct control > Menu structures > Japan (Modern/Futuristic) > Detective / mystery","desc":"<p><em>Moon Cradle</em> is a mystery adventure game which uses live-action video for cut-scenes and fixed isometric perspective during actual gameplay. The player controls the character directly while actions such as \"search\", \"talk\" or \"use\" are presented in a menu-selected manner.</p>"},{"name":"Moon Cradle (Disc 3)","year":1997,"developer":"Tose Co., Ltd.","url":"e#Moon%20Cradle%20%28Japan%29%20%28Disc%203%29.zip","filesize":483976974,"score":"","genres":"Adventure > 3rd-person (Other) > Isometric > Live action > Direct control > Menu structures > Japan (Modern/Futuristic) > Detective / mystery","desc":"<p><em>Moon Cradle</em> is a mystery adventure game which uses live-action video for cut-scenes and fixed isometric perspective during actual gameplay. The player controls the character directly while actions such as \"search\", \"talk\" or \"use\" are presented in a menu-selected manner.</p>"},{"name":"Mortal Kombat II","year":1996,"developer":"Midway Manufacturing Company","url":"e#Mortal%20Kombat%20II%20%28Europe%29.zip","filesize":23128963,"score":7.9,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts > Regional differences","desc":"<p>The Mortal Kombat fighters, plus several new ones, return for a tournament held by the evil Shang Tsung of the Outworld. The action is one-on-one as before, and famed for its high level of violence and blood (other than the sanitised Nintendo version). There are 5 difficulty levels and optional credits, as well as the usual two player mode including same character duels.</p><p>To win the main tournament, the player must beat each of the other human players, before taking on Shang Tsung, Kintaro and finally Shao Kahn. Players have a range of punches and kicks available, as well as flying kicks, uppercuts, roundhouses, and the special moves, which vary for each player. These include throws, uppercuts, long-distance bullets, bicycle kicks and a teleport feature.</p>"},{"name":"Mortal Kombat Trilogy","year":1997,"developer":"Midway Games, Inc.","url":"e#Mortal%20Kombat%20Trilogy%20%28Europe%29.zip","filesize":456493137,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy > Martial arts","desc":"<p>All the characters from the first three Mortal Kombat games return for the ultimate battle. You can play as Kano, Reptile, Mileena, Kung Lao, Shang Tsung, Sindel, Sketor, Stryker, Nightwolf, Sheeva, Kitana, Scorpion, Sonya, Smoke (Cyber Ninja), Rain, Jade, Baraka, Johnny Cage, Ermac, Noob Saibot, Sub-Zero (Unmasked), Sub-Zero (Classic), Jax, Rayden, Cyrax, Liu Kang, Smoke (Human), Kabal, Goro, Kintaro, Motaro, or Shao Kahn.</p><p>This game is one-on-one martial arts fighting. The player can choose from over thirty different characters, all with their own fighting style and their own special moves. Trilogy differs from the other games in that you can play combinations of people that otherwise isn't possible, such as old Liu Kang vs. new Liu Kang, etc.</p><p>Mortal Kombat Trilogy also allows you to challenge a friend to a fight through a Windows IPX network connection.</p>"},{"name":"Mouja","year":1996,"developer":"Four Winds Inc.","url":"sega-saturn-champion-collection-updated/M/Mouja%20%28JP%29.zip","filesize":260361218,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Falling block puzzle","desc":"<p>Take Money Puzzle Exchanger, sprinkle on some Puyo Puyo, and what do you get? Hey presto, it's Moujya! Players control falling pairs of yen coins, in assorted denominations from 1 through 500. Making change by combining coins into the amount of a higher denominations combines the set of coins into one coin of the larger size, and combining two 500 yen coins makes them disappear. Efficient coin placement can lead to making large combos by letting transformed coins fall into place to make change for a higher denomination.</p><p>This rendition of <em>Moujya</em> gives the original game a bright and colourful makeover and replaces the cast with cute cats.</p>"},{"name":"Mr. Bones (Disc 1)","year":1996,"developer":"Zono, Inc.","url":"e#Mr.%20Bones%20%28USA%29%20%28Disc%201%29.zip","filesize":480511357,"score":7.7,"genres":"Action > Side view > Top-down > Platform > Horror","desc":"<p>A philosopher named DaGoulian came up with a dubious doctrine: he believes that the only way to ensure the survival of the good is by making the world more evil. He invented a special set of drums using science and alchemy, allowing him to control a power called \"skeletism\". By using this power, DaGoulian reanimates the dead, raising people's skeletons from their graves and building a fearsome army to fulfill his mad plan. However, one of these skeletons had been a person of a particularly pure heart, and instead of being afflicted with the red (evil) skeletism, he is reanimated with its blue version, allowing him to retain his free will and refuse the madman's orders. DaGoulian orders his minions to get rid of this rebel, who has to fight for his life and eventually figure a way to stop the insanity.</p><p><em>Mr. Bones</em> is an action game that consists of numerous stages. With the exception of a few, each stage has a different goal and introduces unique gameplay style. The stages also vary greatly in length, some being extended platform levels and others consisting of short timed sequences. Many of the stages involve avoiding hazards or enemies, as well as tasks that must be completed within a certain time limit. Mr. Bones, the skeletal protagonist of the game, usually has no offensive arsenal. When damaged, he begins to lose limbs and bones, which affects his manoeuvrability and speed; he may even end up with nothing but a head and a neck hopping on the ground.</p><p>Some of the stages are simple one-screen arcade levels, while others may deviate from the action-oriented gameplay (e.g. a stage during which the player has to combine sentences into jokes to get past guards). A few stages involve music exercises, for example a level that requires Mr. Bones to play blues guitar to impress a skeleton crowd. Another stage is a paddle game variant in which a small Mr. Bones bounces off a giant head of himself, trying to collect his own bones. In another level the hero must protect a village of tiny people against enemy assault.</p><p>The story is advanced by video cutscenes displayed between the levels. Some of these are computer-generated, while others utilize footage of live actors, or a mixture of both.</p>"},{"name":"Mr. Bones (Disc 2)","year":1996,"developer":"Zono, Inc.","url":"e#Mr.%20Bones%20%28USA%29%20%28Disc%202%29.zip","filesize":482326498,"score":7.7,"genres":"Action > Side view > Top-down > Platform > Horror","desc":"<p>A philosopher named DaGoulian came up with a dubious doctrine: he believes that the only way to ensure the survival of the good is by making the world more evil. He invented a special set of drums using science and alchemy, allowing him to control a power called \"skeletism\". By using this power, DaGoulian reanimates the dead, raising people's skeletons from their graves and building a fearsome army to fulfill his mad plan. However, one of these skeletons had been a person of a particularly pure heart, and instead of being afflicted with the red (evil) skeletism, he is reanimated with its blue version, allowing him to retain his free will and refuse the madman's orders. DaGoulian orders his minions to get rid of this rebel, who has to fight for his life and eventually figure a way to stop the insanity.</p><p><em>Mr. Bones</em> is an action game that consists of numerous stages. With the exception of a few, each stage has a different goal and introduces unique gameplay style. The stages also vary greatly in length, some being extended platform levels and others consisting of short timed sequences. Many of the stages involve avoiding hazards or enemies, as well as tasks that must be completed within a certain time limit. Mr. Bones, the skeletal protagonist of the game, usually has no offensive arsenal. When damaged, he begins to lose limbs and bones, which affects his manoeuvrability and speed; he may even end up with nothing but a head and a neck hopping on the ground.</p><p>Some of the stages are simple one-screen arcade levels, while others may deviate from the action-oriented gameplay (e.g. a stage during which the player has to combine sentences into jokes to get past guards). A few stages involve music exercises, for example a level that requires Mr. Bones to play blues guitar to impress a skeleton crowd. Another stage is a paddle game variant in which a small Mr. Bones bounces off a giant head of himself, trying to collect his own bones. In another level the hero must protect a village of tiny people against enemy assault.</p><p>The story is advanced by video cutscenes displayed between the levels. Some of these are computer-generated, while others utilize footage of live actors, or a mixture of both.</p>"},{"name":"My Dream - On Air ga Matenakute (Disc 1)","year":1997,"developer":"Nihon Create","url":"e#My%20Dream%20-%20On%20Air%20ga%20Matenakute%20%28Japan%29%20%28Disc%201%29.zip","filesize":347082900,"score":"","genres":"Adventure > Simulation > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel","desc":"<p><em>My Dream</em> is an simulation game focusing on the world of voice-actors. There are eight different heroines in the game, and each has been voiced by three different actresses. Voice actress for each heroine can be set up at the beginning of a new game, right after entering the player's name. The game doesn't feature default name for the player, and other characters will address you by the name you enter (both Japanese and Latin letters are available during name creation). The player focuses on a single heroine and by setting up a weekly schedule for her, the game advances as a visual novel with selectable dialogue and action choices at certain locations and during certain conversations. The weekly schedule is set by selecting locations on the map you wish to visit, one location per day. Different location offer different actions and participation in various events and meeting and talking to other characters. Each heroine has a default set of attributes which change over time, such as physical strength, self-confidence, stress, speaking skill, and other. During gameplay, static character images with mild animations such as talking, are glued over blurred real-life photos which are used as backgrounds.</p><p>Heroines with selectable voice-actresses include:</p><ul><li>Nao Utsumi (voiced by Naoko Takano, Nao, or Miki Nagasawa)</li><li>Haruka Kudou (voiced by Tarako, Rika Matsumoto, or Kotono Mitsuishi)</li><li>Izumi Watanabe (voiced by Mayumi Tanaka, Noriko Hidaka, or Chisa Yokoyama)</li><li>Reika Shirouchi (voiced by Ai Orikasa, Naoko Matsui, or Rika Matsumoto)</li><li>Miyuki Yoshizawa (voiced by Kikuko Inoue, Miwako Hatayama, or Yuriko Fuchizaki)</li><li>Aya Takai (voiced by Mayumi Tanaka, Aya Hisakawa, or Akiko Hiramatsu)</li><li>Kurumi Kawai (voiced by Tarako, Yuriko Fuchizaki, or Yuuko Miyamura)</li><li>Erina Saitoh (voiced by Mika Nakai, Manami Komori, or Naoko Matsui)</li></ul>"},{"name":"My Dream - On Air ga Matenakute (Disc 2)","year":1997,"developer":"Nihon Create","url":"e#My%20Dream%20-%20On%20Air%20ga%20Matenakute%20%28Japan%29%20%28Disc%202%29.zip","filesize":393587839,"score":"","genres":"Adventure > Simulation > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel","desc":"<p><em>My Dream</em> is an simulation game focusing on the world of voice-actors. There are eight different heroines in the game, and each has been voiced by three different actresses. Voice actress for each heroine can be set up at the beginning of a new game, right after entering the player's name. The game doesn't feature default name for the player, and other characters will address you by the name you enter (both Japanese and Latin letters are available during name creation). The player focuses on a single heroine and by setting up a weekly schedule for her, the game advances as a visual novel with selectable dialogue and action choices at certain locations and during certain conversations. The weekly schedule is set by selecting locations on the map you wish to visit, one location per day. Different location offer different actions and participation in various events and meeting and talking to other characters. Each heroine has a default set of attributes which change over time, such as physical strength, self-confidence, stress, speaking skill, and other. During gameplay, static character images with mild animations such as talking, are glued over blurred real-life photos which are used as backgrounds.</p><p>Heroines with selectable voice-actresses include:</p><ul><li>Nao Utsumi (voiced by Naoko Takano, Nao, or Miki Nagasawa)</li><li>Haruka Kudou (voiced by Tarako, Rika Matsumoto, or Kotono Mitsuishi)</li><li>Izumi Watanabe (voiced by Mayumi Tanaka, Noriko Hidaka, or Chisa Yokoyama)</li><li>Reika Shirouchi (voiced by Ai Orikasa, Naoko Matsui, or Rika Matsumoto)</li><li>Miyuki Yoshizawa (voiced by Kikuko Inoue, Miwako Hatayama, or Yuriko Fuchizaki)</li><li>Aya Takai (voiced by Mayumi Tanaka, Aya Hisakawa, or Akiko Hiramatsu)</li><li>Kurumi Kawai (voiced by Tarako, Yuriko Fuchizaki, or Yuuko Miyamura)</li><li>Erina Saitoh (voiced by Mika Nakai, Manami Komori, or Naoko Matsui)</li></ul>"},{"name":"Myst","year":1994,"developer":"Cyan Worlds, Inc.","url":"e#Myst%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":427740089,"score":6.9,"genres":"Adventure > 1st-person > Graphic adventure > Puzzle elements > Point and select > Fantasy","desc":"<p>You have just stumbled upon a most intriguing book, a book titled Myst. You have no idea where it came from, who wrote it, or how old it is. Reading through its pages provides you with only a description of an island world. But it's just a book, isn't it? As you reach the end of the book, you lay your hand on a page. Suddenly your own world dissolves into blackness, replaced with the island world the pages described. Now you're here, wherever here is, with no option but to explore.</p><p><em>Myst</em> is a first-person point-and-click adventure where the player controls a character known as The Stranger. Magically transported into the world described in the book, he needs to explore Myst Island and solve its mysteries. The game is presented as a series of static scenes where the player acts with the environment by clicking and manipulating objects. There are no enemies and it is not possible to die. Through Myst Island, the game is further divided into mini-worlds set in different ages accessed through different books. </p><p>The game's interface is reduced to a single cursor for navigation and interaction. Rather than collecting items and using them to solve puzzles, the player must gather subtly placed clues and manipulate complex mechanical devices in order to advance in the game. The world of <em>Myst</em> is mostly uninhabited, and the game has very few live-action scenes with characters and dialogue.</p>"}]