[{"name":"Nanatsu no Hikan","year":1996,"developer":"KOEI Co., Ltd."},{"name":"NASCAR 98","year":1997,"developer":"Stormfront Studios","url":"e#NASCAR%2098%20%28Europe%29.zip","filesize":339773856,"score":7.4,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>With top-of-the-line racing simulation NASCAR 98 allows you to race with 24 drivers including legend Dale Earnhardt and 10 official tracks and extra 6 fantasy tracks. This NASCAR game allows you to hear all screeching burnouts, oiled skids, and emergency vehicles, or listen to provided music. This includes the modes season, Arcade, and new custom racing(control opponents,laps,gas gauge, and just about anything.).</p>"},{"name":"NBA Action","year":1996,"developer":"Gray Matter Inc.","url":"e#NBA%20Action%20%28Europe%29.zip","filesize":396003628,"score":"","genres":"Sports > 3rd-person (Other) > Real-time > Direct control > Basketball > Licensed","desc":"<p>There was a series of video games released by Sega Sports for the Sega Genesis, Sega Game Gear and Sega Saturn with the name NBA Action.</p>"},{"name":"NBA Action 98","year":1997,"developer":"Visual Concepts Entertainment, Inc.","url":"e#NBA%20Action%2098%20%28USA%29.zip","filesize":239221804,"score":7.3,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>Sega's first attempt at Basketball on the PC includes plenty of neat visuals; realistic AI and motion capture work; official licenses of the NBA including players, teams and courts; practice mode to help you get used to your team; and a multiplayer mode (for up to 5 players on one computer). You can also create your own team and players in the edit mode, in case you don't like what the NBA offers.</p>"},{"name":"NBA Jam Extreme","year":1996,"developer":"Sculptured Software, Inc.","url":"e#NBA%20Jam%20Extreme%20%28Europe%29.zip","filesize":117038753,"score":6.4,"genres":"Sports > Diagonal-down > Arcade > Direct control > Basketball","desc":"<p>\"Takes the NBA Jam game and puts into an all new 3d engine with lifelike player movement. All the real basketball action is bundled with extreme moves. Zany sound fx, commentary and victory dances by the players.\"</p><p>Basketball with altered gameplay. Features two players on each team with a huge number of special dunks and moves. There is an inclusion of a new extreme button for added excitement. Commentary by Marv Albert.</p>"},{"name":"NBA Jam: Tournament Edition","year":1995,"developer":"Midway Manufacturing Company","url":"e#NBA%20Jam%20-%20Tournament%20Edition%20%28Europe%29.zip","filesize":339211810,"score":7.6,"genres":"Action > Sports > Side view > 2D scrolling > Arcade > Direct control > Basketball > Licensed","desc":"<p>This game lets you play two-on-two arcade basketball with players from all the NBA teams. Gameplay is fast and action-packed, with few rules, no fouls, and deliberately unrealistic jamming. Players are rated on eight ability categories, from steals and blocks, to dunks and 3-pointers.</p><p>Up to four human players can take part, each always controlling a single player for their team, and AI for missing players. This allows for four players to face each other in teams of two, or for two players to team up against a third player with a CPU team-mate.</p><p>The <em>Tournament Edition</em> ups each team's roster to three players, and allows for substitutions between quarters. Shoving players now results in injuries, which lower a player's stats; encouraging you to sub them out and let them recover. Aside from the usual secret characters and cheat modes, the T.E. also includes four new additions you can individually enable from the special options menu:* \"Hot Spots\" are randomized zones on the court that reward extra points (up to a 9-point shot!) for making a basket while standing within them.</p><ul><li><p>Powerup icons appear randomly, and convey temporary arcade-like benefits when picked up. Some examples are instant \"on-fire,\" enhanced 3-point accuracy, monster dunks from anywhere on the court, or a bomb that knocks all other players to the ground.</p></li><li><p>\"Juice Mode\" increases the speed of the game up to 4x.</p></li><li><p>\"Tournament Mode\" disables all other modes, special characters, and cheats, and challenges you to defeat all the NBA teams to unlock extra players (2 extra players for almost every team). Winning Tournament Mode also unlocks a higher CPU difficulty level.</p></li></ul>"},{"name":"NBA Live 97","year":1996,"developer":"NuFX, Inc.","url":"e#NBA%20Live%2097%20%28Europe%29.zip","filesize":281140718,"score":7.1,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p><em>NBA Live 97</em> is a basketball game with an emphasis on realism. You can choose from all of the NBA teams, create a team with players you create yourself, or choose a team formed by the All-Star players of the east or West coasts. When you create a player yourself you can customize the player to a high degree. There are over 60 offensive and 10 defensive set-ups. Match options include an exhibition match, a whole season or the playoffs.</p>"},{"name":"NBA Live 98","year":1997,"developer":"Electronic Arts Canada","url":"e#NBA%20Live%2098%20%28Europe%29.zip","filesize":388195763,"score":7.7,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p><em>NBA Live 98</em> offers the player all teams, players and stadiums of the 1998 NBA season. More than 350 faces got scanned to improve realism. Also some new moves like crossover or fade-aways are implemented. You can play single games, whole seasons, the playoffs or new things like manager career or 3-point-shootout in the style of an all-star-game.</p>"},{"name":"Nekketsu Oyako","year":1995,"developer":"Technosoft Co., Ltd."},{"name":"Nemesis: The Wizardry Adventure","year":1998,"developer":"Sirtech Canada Ltd."},{"name":"Neon Genesis Evangelion","year":1996,"developer":"SEGA-AM2 Co., LTD."},{"name":"Neon Genesis Evangelion: 2nd Impression","year":1997,"developer":"SEGA-AM2 Co., LTD."},{"name":"Neon Genesis: Evangelion - Koutetsu no Girlfriend (Japan) (Disc 1)","year":1998,"developer":"Gainax Co., Ltd.","url":"e#Neon%20Genesis%20-%20Evangelion%20-%20Koutetsu%20no%20Girlfriend%20%28Japan%29%20%28Disc%201%29.zip","filesize":458219465,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Sci-fi / futuristic > Licensed","desc":"<p>This is a Japanese-style adventure game based on the popular TV anime series <em>Neon Genesis Evangelion</em>. A girl named Mana Kirishima arrives at Tokyo-3 and studies in the same class with Shinji Ikari, the series' main hero. About the same time, a giant robot attacks the city. Is there a connection between the new student and the sudden assault?</p><p>Unlike the two previous <em>Neon Genesis Evangelion</em> games, <em>Kōtetsu no Girlfriend</em> is not an interactive movie. The player controls Shinji by selecting locations to travel to, looking at people, and talking to them. The locations are graphically represented as anime-style still screens.</p>"},{"name":"Neon Genesis: Evangelion - Koutetsu no Girlfriend (Japan) (Disc 2)","year":1998,"developer":"Gainax Co., Ltd.","url":"e#Neon%20Genesis%20-%20Evangelion%20-%20Koutetsu%20no%20Girlfriend%20%28Japan%29%20%28Disc%202%29.zip","filesize":438685767,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Sci-fi / futuristic > Licensed","desc":"<p>This is a Japanese-style adventure game based on the popular TV anime series <em>Neon Genesis Evangelion</em>. A girl named Mana Kirishima arrives at Tokyo-3 and studies in the same class with Shinji Ikari, the series' main hero. About the same time, a giant robot attacks the city. Is there a connection between the new student and the sudden assault?</p><p>Unlike the two previous <em>Neon Genesis Evangelion</em> games, <em>Kōtetsu no Girlfriend</em> is not an interactive movie. The player controls Shinji by selecting locations to travel to, looking at people, and talking to them. The locations are graphically represented as anime-style still screens.</p>"},{"name":"Next King: Koi no Sennen Oukoku (Japan)","year":1997,"developer":"AlfaSystem Co., Ltd.","url":"e#Next%20King%20-%20Koi%20no%20Sennen%20Oukoku%20%28Japan%29.zip","filesize":376360757,"score":"","genres":"Role-playing (RPG) > Simulation > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>In a country named Herb Land, several princes are preparing to the great competition, in the end of which one of them will become a king! But you, the young hero of the game (who also happens to be a prince), should know one important thing: if a prince doesn't have success with girls, he won't win the competition! And so, your quest for the crown and for the attention of the fairer sex begins...</p><p><em>Next King: Koi no Sennen Ōkoku</em> is a mixture of a board game, dating simulation, and role-playing. It can also be described as a <em>table RPG</em>. You compete against three other princes, and must have more success with the game's several main female characters in order to become a king. Your actions in the game are determined by the roll of dice. It will tell you at what time of the week you'll be able to begin your turn, how many steps you take on the world map, how much damage you do in battles, and so on. When you visit a town, you should go to see the girls and take quests from them. Those can include the elimination of an evil monster or a simple fetch task. You will also fight against the other princes in tournament mode.</p>"},{"name":"NFL '97","year":1996,"developer":"GameTek, Inc.","url":"e#NFL%20%2797%20%28USA%29.zip","filesize":88084592,"score":5.9,"genres":"Sports > 3rd-person (Other) > Top-down > Football (American) > Licensed","desc":"<p>This version of the SEGA Sports NFL franchise was released only for the SEGA Saturn. It features all fully licensed NFL teams and their respective logos along with updated rosters for the 1996 NFL season. It also has the option to create a brand new NFL team from scratch if the player chooses to and even create their own plays that can be used in games.</p><p>The standard game modes apply here such as <em>Exhibition</em>, <em>Season</em>, etc. and keep extensive track of stats in over 70 different categories and over 150 offensive and defensive plays to choose from. Eight friends can also go against each other using multi-tap.</p>"},{"name":"NFL Quarterback Club 96","year":1995,"developer":"Iguana Entertainment Incorporated","url":"e#NFL%20Quarterback%20Club%2096%20%28Europe%29.zip","filesize":113434632,"score":7.5,"genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p>Another game in <em>NFL Quarterback series</em>.Every team from the 1996 NFL season is shown here, with real player numbers and stats. 32 offensive plays and 16 defensive plays are available as you play. Options include setting quarter lengths, from one to 15 minutes, and selecting your mode of play: Preseason, Playoffs, or a full Season, in which you play 18 games towards the goal of the Super Bowl.</p>"},{"name":"NFL Quarterback Club 97","year":1996,"developer":"Iguana Entertainment Incorporated","url":"e#NFL%20Quarterback%20Club%2097%20%28USA%29.zip","filesize":112742378,"score":6.5,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p><em>NFL Quarterback Club 97</em> utilizes many of the same gameplay elements seen in Madden NFL 97 - including the kicking T-meter, the three-quarter overhead primary camera angle, and the button assignments and controls. Player animations are fluid and realistic, and the player sprites have clearly visible jersey numbers and names. </p><p>The game also boasts a historic simulation mode. Players can choose among 50 different classic NFL game situations and try to rewrite history. Imagine...it's December 23, 1973. The Dallas Cowboys are down 28-13 to the 49ers. With under a minute remaining, the Boys score a touchdown and recover an onside kick. Can you complete one of the greatest comebacks in NFL history?</p>"},{"name":"NHL 97","year":1997,"developer":"Electronic Arts Canada","url":"e#NHL%2097%20%28USA%29.zip","filesize":436122480,"score":7.8,"genres":"Sports > Diagonal-down > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>1997 edition of EA's NHL sport simulation series. Improvements in this edition come mostly in the graphical arena, with a refined version of the \"virtual stadium\" system that adds new camera angles (including the classical top-down one strangely missing from NHL 96), and polygonal players instead of the bitmap-based ones with motion-captured animations.</p><p>Other extras include multiplayer support for up to 8 players through network or Gravis's GrIP system, the option to create new players and trade them around, and the usual amount of EA sports licensed multimedia flair, including an interesting \"Goalie Mask Viewer\" which lets you observe the elaboratedly decorated helmets of 30 goalies.</p>"},{"name":"NHL 98","year":1997,"developer":"Electronic Arts Canada","url":"e#NHL%2098%20%28Europe%29.zip","filesize":425371559,"score":8,"genres":"Sports > Diagonal-down > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>NHL 98 features much faster and refined gameplay (now using four action keys instead of two, removing the need to double-tap to perform some actions), along other new features such as \"in-the-fly\" tactics developed by Marc Crawford, then manager of the Colorado Avalanche and new commentary lines from Jim Hughson and Darryl Reaugh and a re-worked interface.Graphics are improved from the previous version with the players being less angular, and thanks to 3Dfx support, with less pixels showing in the textures. The in-game presentation follows a TV-style script, zooming in players while displaying stats during clock stoppages.</p><p>As far as game modes go, in the year of the first Olympic Tournament with professional players, NHL 98 introduced the first real international competition, with 18 International teams to choose from. Other game modes include Season (option to pick between 25 or 82 games) and Playoff (best of 1, 3, 5 or 7 matches) and a Penalty Shootout mode.</p>"},{"name":"NHL All-Star Hockey","year":1995,"developer":"Gray Matter Inc.","url":"e#NHL%20All-Star%20Hockey%20%28Europe%29.zip","filesize":437574651,"score":6.6,"genres":"Sports > 3rd-person (Other) > Side view > Isometric > Hockey > Licensed","desc":"<p>NHL All-Star Hockey is the first of Sega's own line of Saturn NHL licensed titles. It includes the ability to play pre-season matches, a full season or just the playoffs, as well as multimedia content, such as a tour of the NHL Hall of Fame in Toronto, information on the trophies and real player trading cards (from the Fleer Ultra collection). It's also possible to trade players and create players and teams for use in pre-season matches.</p><p>If a player owns two of Sega's 6 player adapters, all players can be controlled by human players, but in lesser number of human players, it's still possible to . Due to the large size of the league save games, the use of the external memory cartridge is advised.</p>"},{"name":"NHL All-Star Hockey 98","year":1997,"developer":"Radical Entertainment Inc.","url":"e#NHL%20All-Star%20Hockey%2098%20%28USA%29.zip","filesize":197193611,"score":7.3,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p><em>NHL Powerplay 98</em> is a hockey game where the player can control a team of his choice to bring it to victory and glory. The game modes are the typical genre choices: Either a whole NHL season, the NHL playoffs or a league with 15 national teams. The team logos and player names are official licensed but in contrast to NHL 98 it uses the data from 1996/1997.</p><p>The gameplay itself is more action oriented than a simulation and uses several shooting and pass variations which are activated with more or less complicated key combinations. Six camera angles and a instant replay feature complement the TV atmosphere. </p><p>The game also features several tactical possibilities. For eight game situations the player can choose between three behaviours, e.g. how the players set up shots in the offensive zone. During the season there is a option to trade players with other teams. Extensive mid-season statistics, which can be shown for every team in the league, help planning transfers and tactics.</p>"},{"name":"NHL Powerplay '96","year":1997,"developer":"Radical Entertainment Inc.","url":"e#NHL%20Powerplay%20%2796%20%28Europe%29.zip","filesize":217091203,"score":7.8,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>An early competitor to the EA Sports NHL series, <em>NHL Powerplay '96</em> features motion-captured players, an NHL Player’s Association license, a variety of managerial options, and the ability to play seasons and tournaments.</p><p>It is the first NHL game to include a World Tournament mode in which the NHL players can compete against each other on their respective national teams.</p><p>In a time where developers tried to get the most from 32-bit consoles, leading to the \"unlimited camera angles\" blurb on many games, NHL Powerplay stuck with the one most people used, the overhead \"behind the goal\" view, popularized by EA's NHL series - and it was one of first full 3D sports games on the market.</p>"},{"name":"Night Striker S (Japan)","year":1996,"developer":"Taito Corporation","url":"e#Night%20Striker%20S%20%28Japan%29.zip","filesize":395092534,"score":5.1,"genres":"Action > Racing / Driving > Behind view > Arcade > Shooter > Flight / aviation > Cyberpunk / dark sci-fi","desc":"<p><em>Night Striker</em> is a third-person shooter reminiscent of Space Harrier. Laser optics expert Dr. Lindvery Maska and his daughter have been kidnapped by a terrorist group, and Dick Dagras, head of the Special Service Agency, is mobilizing a group of elite soldiers experienced in the use of special armored flying cars, in order to rescue Dr. Maska and destroy this terrorist group.</p><p>The player flies through each stage, controlling their armored car and shooting down waves of enemies. A boss appears at the end of each stage, and after this the player must choose what path to take in the next stage, as in Darius. Instead of lives, the player has a shield that takes damage from each hit, but is recharged at the end of each stage.</p><p>The Sega CD version of the game features remixed CD-audio, and the Saturn version features a set of exclusive bonus levels.</p>"},{"name":"Night Warriors - Darkstalkers' Revenge","year":1996,"developer":"Capcom Co., Ltd.","url":"e#Night%20Warriors%20-%20Darkstalkers%27%20Revenge%20%28Europe%29.zip","filesize":441653182,"score":8,"genres":"Action > Side view > 2D scrolling > Fighting > Horror","desc":"<p><em>Night Warriors: Darkstalkers' Revenge</em> is an entry in Capcom's Darkstalkers franchise. It is a one-on-one fighting game where a number of fighters based on assorted mythological monsters (such as a vampire, a werewolf, and a succubus) take each other out with a variety of supernatural moves against colorful and creepy backdrops.</p><p>There are 14 Darkstalkers franchise characters in this version: Victor, Demitri, Sasquatch, Bishaman, Hsien-Ko, Anakari, Huitzel, Felicia, Donovan, Raptor, Morrigan, Talbain, Rikuo, and Pyron.</p>"},{"name":"NiGHTS into Dreams...","year":1996,"developer":"Sonic Team","url":"e#NiGHTS%20into%20Dreams...%20%28Europe%29.zip","filesize":472306239,"score":8.3,"genres":"Action > Behind view > Side view","desc":"<p>It all started about two young kids.  First there is this boy named Elliot Edwards who loves to play basketball, but then he was humiliated in front of his friends by a group of older kids who wants to play in a \"friendly\" game.  Then there is Claris Sinclair, she loves to sing, but when she step on the stage, she felt so nervous that she ran out to the exit like a coward.  </p><p>NiGHTS was a first class Maren together with Reala.  They were both created by Wizeman.  As day pass by, NiGHTS notice how his master becoming so evil.  So when he started to refuse on obeying his master's evil deeds, Wizeman punished him by locking him up into an Ideya Palaces.</p><p>But NiGHTS found out that he has a chance to escape his prison by combining his body to a human dreamer.  Those dreamers were Elliot and Claris.  He also found out that those two have a Red Ideya within them.  As he finally free himself out of the Ideya Palace, he will find Wizeman and destroy him with the help of Elliot and Claris. </p><p>Here you basically control Elliot, Claris and Nights. You start a level by choosing Elliot and Claris. Gameplay is similar to Sonic but unique in a way that it is best to use the special D-pad. As you fly through the levels you should pass through a certain number of loop rings to finish each level. You gain bonuses by dancing which can be easily achieved by using a D-pad.</p>"},{"name":"Ninja Jajamaru-kun: Onigiri Ninpouchou Gold (Japan)","year":1997,"developer":"Atelier Double Co. Ltd.","url":"e#Ninja%20Jajamaru-kun%20-%20Onigiri%20Ninpouchou%20Gold%20%28Japan%29.zip","filesize":330606367,"score":"","genres":"Action > Behind view > Platform > Shooter > Direct control > Fantasy","desc":"<p><em>Ninja Jajamaru-kun: Onigiri Ninpōchō - Gold</em> is a 3D platformer and the follow-up to Ninja Jajamaru-kun: Onigiri Ninpōchō. Despite what the title would imply, <em>Gold</em> is an entirely new game with different levels and enemies to that of its predecessor. The gameplay and story, however, are mostly unchanged: players control the ninja protagonist Jajamaru-kun from a behind-view perspective as he battles enemies with his shuriken and katana on a quest to rescue Princess Sakura from the clutches of Catfish Tayu. Like the previous game, levels contain power-ups for Jajamaru-kun to collect.</p><p>Although most of the game takes place in 3D environments, it also includes some 2D levels in the style of the original Ninja Jajamaru-kun game so that the 2D and 3D approaches to the series can be directly compared.</p>"},{"name":"Nippon Daihyou Team no Kantoku ni Narou! Sekaihatsu Soccer RPG","year":1998,"developer":"Tose Co., Ltd."},{"name":"Nobunaga no Yabou Sengoku Gunyuuden (Japan)","year":1998,"developer":"Koei Tecmo Games Co., Ltd.","url":"e#Nobunaga%20no%20Yabou%20Sengoku%20Gunyuuden%20%28Japan%29.zip","filesize":39066779,"score":"","genres":"Strategy > Top-down > Turn-based > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p><em>Nobunaga's Ambition II</em> is the sequel to Nobunaga's Ambition. The setting is 16th century feudal Japan, a period when ruthless <em>daimyo</em> (feudal lords) contended with each other for dominance. Ultimately, the winner in this struggle will become <em>Shogun</em> and hold actual power over the islands, while being nominally subject to the Emperor.</p><p>The game casts the player as one of the <em>daimyo</em>, allowing them freedom to decide the fate and future of feudal Japan, through diplomacy and ultimately war. The objective is to unify Japan under the player's rule. If the player fails through death on the battlefield, assassination at the hands of a ninja, or through natural causes, they can choose a successor and play on. Functionally, the first job is to let prosper the <em>fief</em> (province) under the player's control through agricultural development and town investment. </p><p>There are two scenarios available in the game: * <strong>Warlords: 1560 A.D.</strong>  </p><p>The first scenario begins as the <em>daimyo</em> prepare what will eventually become a full scale war in the whole of Japan. The <em>warring states period</em> begins here. There are 28 of them included in the scenario, among others: the Mori clan, the Takeda, the Hojo clan, the Uesugi clan, etc.</p><ul><li><strong>Nobunaga's Ambition: 1582 A.D.</strong>  </li></ul><p>The second scenario follows the rise of Oda Nobunaga in 1582 A.D. to power and allows the player to play either as Oda Nobunaga or as one of his chief allies or rivals.</p><p><strong>Samurai</strong>  </p><p>The game improves on its predecessor by including some 400 historical samurai in the game, providing the player with generals for troops and governors for a conquered <em>fief</em>. </p><p>Each samurai is characterized by statistics: Age, Rank, Body Points, War, Politics, Ambition, Charisma, and Loyalty. There are also additional attributes for specific military purposes: Skill, Arms Level, and Unit Type. Some of these attributes may be improved through training (i.e. war, politics, and skill), rewards (i.e. loyalty), or through merchants (i.e. arms level). </p><p><strong>Strategy</strong>  </p><p>The game is turn-based, with each turn representing one month. Certain events take place annually such as tax collecting (March) and rice harvest (September), while other events, such as invading neighbors, follows the player's time table.</p><p>The game uses an initiative system to determine what actions can be completed in a particular month. Each <em>daimyo</em> and samurai has a stock of \"Body Points\" that represent the attention he can afford to spend on an action. Each action has a cost in Body Points for the character executing it, and if he does not have the point’s necessary, he may not perform it. Body Points are refreshed a little each month. The level of Body Points refreshed per month is depends on the level of his Political skill. Intensive operations will deplete Body Points and then require turns of inaction to stock up again, so timing actions to coincide with Body Point availability is an extra wrinkle to the management of resources.</p><p><strong>Combat</strong>  </p><p>Each samurai can lead a 100-strong unit, which must be recruited, then trained, and equipped with weapons for battle. The attack of an army results in a tactical play out of the resulting battle or siege. A hex-based map of the area of the battlefield will form the playing board for the movement to combat and actual fighting. Fortifications (castles) have a dramatic benefit for the defender. The attacker must defeat the defender within 30 days or must force a withdrawal. Additionally, both sides must pay attention to their food provisions as each day subtracts food supplies in accordance to their army size.<strong>Unit Types</strong>The game introduces 3 basic military unit types: Infantry (Inf), Cavalry (Cav), and Rifles (Rif). Each unit type has certain special abilities and tactical advantages/disadvantages in combat:+ <strong>Infantry</strong> have the ability to ambush anywhere on the main <em>fief</em> map (explained later) and have 4 movement points; + <strong>Cavalry</strong> have the ability to charge at an enemy (inflicting considerable damage on both sides) with the chance of breaking through the defending unit and emerging on the other side. Samurai leaders may often be killed (instead of captured) if their unit reaches zero. Cavalry have 6 movement points; + <strong>Rifles</strong> may attack using muskets which have devastating offensive capabilities, which may also kill an enemy samurai unit if the opponent's unit reaches zero (thus, a standard non-rifle attack is also available for capturing an enemy samurai leader). Rifles have 3 movement points.</p><p>Additionally, both Infantry and Rifle units may move over walls or through water during the castle siege for a certain amount of movement points.</p><p><strong>Tactical Combat</strong>  </p><p>Tactical combat occurs in two different locations:</p><p>The first is the tactical map of the <em>fief</em>, where the attackers first arrive and the defenders surrounding the castle. In this setting, each days is divided into three time periods: morning, afternoon, and night, before the day ends. At night, armies may maneuver to surprise attack enemies in the dark, which does considerably more damage than an average attack. This may be done if the enemy is at least two squares away (not adjacent).</p><p>The second is the castle siege map, which occurs if the defender chooses to retreat to the castle from the previous map. Here, each turn represents one day, thus the time limit of the attack as well as the provisions of both sides, rapidly decrease with each turn. In this setting, the siege force must break down gates leading towards the castle for the final engagement. The defender is defeated, if the governor of the <em>fief</em> retreats, or if his unit is destroyed: resulting either in his capture or death.</p><p>The end outcome is either the fall of the <em>fief</em> to the attacking forces or victory for the defenders. Either way, captured samurai (if any) will require a prompt response for release, beheading, or recruitment to the winner's force.</p>"},{"name":"Nobunaga no Yabou Shouseiroku (Japan)","year":1998,"developer":"KOEI Co., Ltd.","url":"e#Nobunaga%20no%20Yabou%20Shouseiroku%20%28Japan%29%20%282M%29.zip","filesize":426714306,"score":"","genres":"Strategy > Diagonal-down > Isometric > Turn-based > Historical events > Japan (Ancient/Classical/Medieval) > War","desc":"<p><em>Nobunaga no Yabō: Shōseiroku</em> is a turn-based tactical strategy game set in 16th century feudal Japan. It is the seventh title in the <em>Nobunaga's Ambition</em> series.</p>"},{"name":"Nobunaga no Yabou Tenshouki (Japan)","year":1995,"developer":"KOEI Co., Ltd.","url":"e#Nobunaga%20no%20Yabou%20Tenshouki%20%28Japan%29.zip","filesize":452763571,"score":"","genres":"Strategy > Diagonal-down > Isometric > Turn-based > Historical events > Japan (Ancient/Classical/Medieval) > War","desc":"<p><em>Nobunaga no Yabō: Tenshōki</em> is a tactical strategy game set in 16th century feudal Japan. It is the sixth game in the <em>Nobunaga's Ambition</em> war simulation series. The player can educate warlords and increase their fighting power. He/she can let them go into battle and check their statuses in the meantime. It is possible to have dozens of opponents fighting alone in a given scenario.</p>"},{"name":"Nobunaga no Yabou Tenshouki with Power-Up Kit (Japan)","year":1997,"developer":"Koei Tecmo Games Co., Ltd.","url":"e#Nobunaga%20no%20Yabou%20Tenshouki%20with%20Power-Up%20Kit%20%28Japan%29.zip","filesize":455979709,"score":"","genres":"Compilation > Strategy > Diagonal-down > Wargame > Historical events > Japan (Ancient/Classical/Medieval) > War","desc":"<p>A compilation of Nobunaga no Yabō: Tenshōki and Nobunaga no Yabō: Tenshōki - Power Up Kit.</p>"},{"name":"Noël: Not Digital 3 (Special Edition)","year":1998,"developer":""},{"name":"Nonomura Byouin no Hitobito (Japan)","year":1996,"developer":"Silky's","url":"e#Nonomura%20Byouin%20no%20Hitobito%20%28Japan%29.zip","filesize":507289354,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Adult > Detective / mystery","desc":"<p>The principal of Nonomura hospital has killed himself. Or so it appears at first sight. But the private detective Takumaro Kaibara is not so sure about that. Maybe it was a suicide, but maybe it was a murder. To find out what has really happened, Kaibara heads to Nonomura hospital. It should be mentioned that Kaibara is famous not only for his talent as a detective, but also for his skills as a seducer. And it is also known that Nonomura hospital is full of beautiful nurses. To kill two birds with one stone, Kaibara tries to make his way to the hearts of the sexy nurses, at the same time gathering information for the crime investigation. Will he be able to succeed in both?</p><p><em>Nonomura Byōin no Hitobito</em> contains erotic images and scenes and is marked for the ages 18+. The genre to which the game belongs can be described as a digital novel, in which the interaction consists entirely of text, and the gameplay is devoid of puzzles and is largely based on dialogues and decisions made in certain situations.</p>"},{"name":"Noon (Japan)","year":1998,"developer":"Micro Cabin Corp.","url":"e#Noon%20%28Japan%29%20%28Rev%20A%29.zip","filesize":554225153,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Anime / Manga > Arcade > Puzzle elements","desc":"<p>it's a puzzle game, not an action game, and it can be played by anyone, not just newtypes. It is, though, a game with a lot to hold your interest, and there's even a bit of mystery outside of the game itself to enjoy, too! But I'll get back to that later. First: the game itself.</p>"}]