[{"name":"Off-World Interceptor Extreme","year":1995,"developer":"Crystal Dynamics, Inc.","url":"e#Off-World%20Interceptor%20Extreme%20%28Europe%29.zip","filesize":353710552,"score":6.9,"genres":"Action > Racing / Driving > Behind view > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>You play a Trashman, a bounty hunter paid to capture criminal scum hiding on harsh alien worlds. </p><p>Your job is to race the enemy crime boss to the finish, blasting his goons along the way. Get blown up or drive too slowly and the boss gets away. But if you make it to the checkpoint in time, you block the boss' escape and trap him on the planet.</p><p>You can upgrade your vehicle with the cash from your bounties. You can also go up against a buddy in the vertical split-screen deathmatch mode.</p><p><em>Off-World Interceptor</em>'s most unique feature is the storyline, told in full-motion video. Standard for the time. But <em>OWIE's</em> FMV is mocked by a couple of guys sitting in chairs, a la Mystery Science Theater 3000.</p>"},{"name":"Olympic Soccer","year":1996,"developer":"Silicon Dreams Studio Ltd.","url":"e#Olympic%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":416507752,"score":7.1,"genres":"Sports > 3rd-person (Other) > Isometric > Football (European) / Soccer > Licensed","desc":"<p>While the soccer tournament is often downplayed not only inside the Olympic movement but also by the soccer-following community, in 1996, by the occasion of the Games of the XXVI Olympiad in Atlanta, US Gold decided to release a game representing the tournament.</p><p>The player can choose one of the 33 teams, and participate in exhibition matches, arcade (a 32-team cup knockout), Olympic (the 16 team tournament mimicking the actual tournament), or play on an all-versus-all league (from 3 to 16 teams). The games feature the usual options found in contemporary games, such as match length and draw rules, as well as define several weather patterns from wind to the bumpiness of the grass. All 5 stadiums used in the actual Olympics are present.</p>"},{"name":"Ou-chan no Oekaki Logic","year":1995,"developer":"Santa Claus","url":"e#Ou-chan%20no%20Oekaki%20Logic%20%28Japan%29.zip","filesize":222026993,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Anime / Manga > Point and select > Licensed","desc":"<p><em>Oh-chan no Oekaki Logic</em> is a digital conversion, with anime mascots, of the classic Japanese newspaper puzzle nonograms. A nonogram is a puzzle on a square or rectangular grid the object of which is to reveal a hidden picture. Along each row and column there is a number or series of numbers which indicate how many squares will be colored in that row or grid. Example; \"5 9 4\" would mean there would be sets of five, nine, and four colored squares in the grid, in that order, with at least one blank in between. </p><p><em>Oh-chan no Oekaki Logic</em> adds a story mode where starring the titular character, Hebereke's friend who first appeared in Ufouria: The Saga. Oh-Chan, representing the player, competes with other blobby anime characters in finding hidden images in the nonogram grids.</p>"}]