[{"name":"Quake","year":1997,"developer":"id Software, Inc.","url":"e#Quake%20%28Europe%29.zip","filesize":525128358,"score":8.1,"genres":"Action > 1st-person > Shooter > Direct control > Fantasy","desc":"<p>An enemy with the codename ''Quake'', which is believed to come from another dimension, is using teleporter gates to invade Earth. The player takes the role of a nameless soldier who arrives at his base only to find out Quake has overrun it and killed everyone. Somewhere in the base, there must be a teleporter to Quake's realm. The mission is clear: take the fight to the enemy, overcome countless hordes of monsters, and exact revenge.</p><p>id Software's follow-up to Doom and Doom II, <em>Quake</em> is a first-person shooter. Its main technological innovation is the use of a true 3D engine - the levels themselves, as well as the enemies, are polygonal. This not only allows for more natural level-designs and character animations, but also for more realistic lighting and the inclusion of simulated physics that have an effect on gameplay: grenades can bounce off walls and around corners, for example.</p><p>In single-player mode, gameplay consists mainly of proceeding through the levels (spread over four distinct episodes) in search of an exit, killing everything that moves. Interaction with the game world is reduced to a minimum: since there is no use key, buttons are pressed by running into or shooting at them. As in id's earlier games, many secrets are waiting to be discovered, including a few hidden levels.</p><p>Unlike Doom's rather straightforward design that couples futuristic environments with demonic imagery, the theme of Quake's levels, enemies, and weapons is not so easily pinpointed. While each episode begins in a futuristic military base (with a technological 'slipgate' as the level exit), later levels take place in environments inspired by medieval fantasy and gothic horror (castles, dungeons, and caverns) and the player passes through magical portals to advance. In a departure from Doom's colorful environments, all Quake levels are dominated by earth colors.</p><p>The enemies conform to the mishmash of designs: there are human opponents armed with shotguns and energy weapons in the early levels, while the later levels include medieval knights, ghosts, zombies, ogres (armed with grenade launchers and chainsaws), and some more unearthly beasts. The player's weapons, while relatively modern, all have a low-tech feel. Besides a (bloodstained) axe, there are shotguns, nailguns, rocket and grenade launchers, and the Thunderbolt, which discharges electrical energy.</p><p><em>Quake</em> was one of the first games playable natively over the Internet in addition to LANs. The single-player levels can be played cooperatively, but the game is most famous for its deathmatch mode. One-on-one duels, team play, and free-for-all competition are possible. The emphasis is on fast reaction and skillful maneuvering through the levels. All of the single-player maps can be used as arenas, but the game also comes with six maps specially designed for deathmatch.</p>"},{"name":"Quantum Gate","year":1995,"developer":"Hyperbole Studios"},{"name":"Quarterback Attack","year":1995,"developer":"Digital Pictures, Inc.","url":"sega-saturn-champion-collection-updated/Q/Quarterback%20Attack%20%28NA%29.zip","filesize":551749948,"score":5.7,"genres":"Sports > 3rd-person (Other) > Cinematic camera > Video backdrop > Menu structures > Football (American)","desc":"<p>In this semi-FMV game, you play a rookie facing his first game as starting quarterback on a fictional team, and this just happens to be The Big Game.</p><p>The entire game consists of this confrontation. When starting the game you watch a video of a kickoff and return, and then you get to select among 110 plays (100 passing and 10 running). The meat of the game is on the passing plays, where you are switched to a 3rd person behind-the-quarterback view from which you can see oncoming rushers. You can also zoom in on any receiver and via a targeting cursor make passes, or scramble if you don't find an open man.</p><p>Graphics consist mostly of FMV and super-imposed digitized images of no more than 320 x 200 pixels in resolution. There are also 6 difficulty settings to choose from.</p>"}]