[{"name":"R?MJ: The Mystery Hospital","year":1997,"developer":"System Sacom","url":"e#RMJ%20-%20The%20Mystery%20Hospital%20%28Japan%29.zip","filesize":485131475,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Sci-fi / futuristic > Detective / mystery > Horror","desc":"<p><em>R?MJ</em> is an interactive movie horror adventure game with full voice-acting and without subtitles to feel more like a movie. The story takes place in a summer of 1999, as a large explosion occurred in a General Hospital. Due to a deadly virus being released, the hospital is on lockdown, and you are left with no way out. The player assumes the role of Hajime, who after going to visit his best friend, finds himself trapped in a hospital along with two friends, Ryou and Tomowo, and a rookie nurse, Aya. The gameplay consists of exploring locations in the hospital by moving in a certain direction (forward, turn left or right, or turn back) which uses pre-rendered animation for every movement from one point to another. Certain locations can be zoomed in to give you more details or to pick up an item. Your companions will often give you some comments while you explore, most of which may seem a selection of five sentences that are randomly selected. The game also features the use of player's senses (sight, hearing, touch, smell and taste) which must be used at key locations and events in order to progress the game.</p>"},{"name":"Rabbit","year":1997,"developer":"Aorn","url":"e#Rabbit%20%28Japan%29.zip","filesize":371737897,"score":"","genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p><em>Rabbit</em> is a 2D fighting game, with cartoonish colorful graphics. The game has 8 playable characters - Wu Ling (Rabbit), Tien-Ren (hawk), Eight (ox), Hou-En (wolf), Ja-Koh (snake), Yu-Lan (fox), Rex (tiger) and Eddy (wild boar). The player chooses one from these heroes, and must defeat all opponents, plus the final boss.</p><p>Each character has a special animal spirit that helps with the battle (e.g. JoJo's Bizarre Adventure) - and they have a spirit' bar to use these specials. The game uses the joystick plus 4 buttons - for light punch, heavy punch, light kick, and heavy kick.</p>"},{"name":"Race Drivin'","year":1995,"developer":"K.K. Time Warner Interactive","url":"e#Race%20Drivin%27%20%28Japan%29%20%282M%29.zip","filesize":216029974,"score":"","genres":"Racing / Driving > 1st-person > Arcade > Tricks / stunts > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Race Drivin'</em> is an updated remake of the 1990 coin-op racing game of the same title. It features the original <em>Hard Drivin'</em> course, the courses added in the original <em>Race Drivin'</em>, and three brand new courses only found in this new version. The number of available vehicles has also increased from 3 to 8. The game includes both a single-player championship mode and an arcade time attack mode.</p>"},{"name":"Radiant Silvergun","year":1998,"developer":"Treasure Co., Ltd.","url":"e#Radiant%20Silvergun%20%28Japan%29.zip","filesize":212374522,"score":8.6,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Direct control","desc":"<p>The story of <em>Radiant Silvergun</em> begins with the end of the world. As the pilot of the starfighter Radiant Silvergun, you are sent back in time in search of the key to save the planet. In various time periods, you will battle hordes of enemies in search of an alien being known as the Origin. Only by destroying the Origin can the dark future of the planet be altered.</p><p>Radiant Silvergun is a top-down shooter from the Japanese codeshop Treasure (Gunstar Heroes, Silhouette Mirage) released in Japan for the Sega Saturn in 1998. To tackle the swarm of enemies that fill your screen you got three different means of attack. A straight shot, a homing laser and a devastating spread shot.</p>"},{"name":"Ragnagard","year":1997,"developer":"System Vision"},{"name":"Rampage World Tour","year":1997,"developer":"Game Refuge Inc.","url":"sega-saturn-champion-collection-updated/R/Rampage%20-%20World%20Tour%20%28NA%29.zip","filesize":105448787,"score":5.9,"genres":"Action > Side view > 2D scrolling > Arcade","desc":"<p><em>Rampage World Tour</em> is an updated version of the classic Rampage. Rampage World Tour starts off at Scumlabs International where three lab technicians, George, Lizzy, and Ralph have mutated in an accident involving toxic waste. George has turned into a gigantic ape, Lizzy a gigantic lizard or dinosaur, and Ralph some sort of gigantic wolf. The three destroy the lab they previously worked at and then embark on a path of destruction encompassing the entire globe.</p><p>The player chooses one of these three characters and begins destroying buildings, eating civilians, knocking planes out of the sky, and stepping on tanks. The ultimate goal of the game is to rid the world of Scumlabs by traveling to the cities where they are located. Being creatures of such massive size, there are many cities that must be destroyed along the way. Scumlabs and the various militaries make it a priority to destroy you and optionally another player that can play simultaneously.</p><p>The graphics are worth noting as they are of a unique, colorful \"cartoon\" flavor. Gameplay includes players climbing buildings while punching, kicking, and eating their inhabitants to destroy them. Once all the buildings for a particular stage have been destroyed, the stage is clear and players proceed to the next stage. Players can get many different kinds of power-ups that make them more powerful or restore health.</p>"},{"name":"Rampo (Disc 1)","year":1995,"developer":"System Sacom","url":"e#Rampo%20%28Japan%29%20%28Disc%201%29.zip","filesize":364007759,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Detective / mystery > Licensed","desc":"<p><em>Rampo</em> is an interactive movie which uses pre-rendered backdrops and live actors much in the veins of The 7th Guest, without the puzzle-solving part. The game features Edogawa Rampo, a Japanese mystery novel writer, as a protagonist and is based on the movie with the same name which was released a year earlier. In real life, Edogawa Rampo (江戸川 乱歩) is a pseudonym of Hirai Tarou (平井 太郎), a Japanese novelist who wrote mystery fiction in the early-to-middle of 20th century.</p><p>Having a writer's block and still under influence that your work has been banned from publishing due to the level of disturbance portrayed, with your editor, Yokomizo Seishi, pressing you to write your next piece, you just can't wrap around your head to make it happen. So you get up from your writing desk and head to do the landlord business and pick up the rent from the occupants. The place is man-exclusive, there is no women allowed, yet you secretly find out someone has been bringing a woman and not just to talk to. What may have started as debauchery will soon turn your life around when it reveals a much bigger mystery than you bargained for.</p><p>The game is played in 1st-person perspective where you can turn left or right, or move forward and backward. Moving forward in closed locations will often end up in zooming certain objects and occasionally pick them up if they are of any importance. Picked up objects can be viewed in your inventory and used in certain locations or during dialogues. Movie is not free 3D movement, but instead uses pre-rendered cutscenes for every movement animation. Characters will often cycle through their dialogues unless there is a time where you can inquire about some item from your inventory. Yokomizo Seishi, your editor, will accompany you and will often provide comments when you won't be able to go to certain areas or if you try to do weird things (i.e. try to go outside without a reason, or try to unlock someone else's room without a proper cause). Occasionally your protagonist will also speak, at which moment the picture will be frozen (there is no idle movements of characters or animate objects in the areas when you're talking or just standing still).</p>"},{"name":"Rampo (Disc 2)","year":1995,"developer":"System Sacom","url":"e#Rampo%20%28Japan%29%20%28Disc%202%29.zip","filesize":459786472,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Detective / mystery > Licensed","desc":"<p><em>Rampo</em> is an interactive movie which uses pre-rendered backdrops and live actors much in the veins of The 7th Guest, without the puzzle-solving part. The game features Edogawa Rampo, a Japanese mystery novel writer, as a protagonist and is based on the movie with the same name which was released a year earlier. In real life, Edogawa Rampo (江戸川 乱歩) is a pseudonym of Hirai Tarou (平井 太郎), a Japanese novelist who wrote mystery fiction in the early-to-middle of 20th century.</p><p>Having a writer's block and still under influence that your work has been banned from publishing due to the level of disturbance portrayed, with your editor, Yokomizo Seishi, pressing you to write your next piece, you just can't wrap around your head to make it happen. So you get up from your writing desk and head to do the landlord business and pick up the rent from the occupants. The place is man-exclusive, there is no women allowed, yet you secretly find out someone has been bringing a woman and not just to talk to. What may have started as debauchery will soon turn your life around when it reveals a much bigger mystery than you bargained for.</p><p>The game is played in 1st-person perspective where you can turn left or right, or move forward and backward. Moving forward in closed locations will often end up in zooming certain objects and occasionally pick them up if they are of any importance. Picked up objects can be viewed in your inventory and used in certain locations or during dialogues. Movie is not free 3D movement, but instead uses pre-rendered cutscenes for every movement animation. Characters will often cycle through their dialogues unless there is a time where you can inquire about some item from your inventory. Yokomizo Seishi, your editor, will accompany you and will often provide comments when you won't be able to go to certain areas or if you try to do weird things (i.e. try to go outside without a reason, or try to unlock someone else's room without a proper cause). Occasionally your protagonist will also speak, at which moment the picture will be frozen (there is no idle movements of characters or animate objects in the areas when you're talking or just standing still).</p>"},{"name":"Rayman","year":1995,"developer":"Ubi Soft Paris Studios","url":"e#Rayman%20%28Europe%29%20%28En%2CFr%2CDe%29%20%281S%29.zip","filesize":547829064,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>When a villain known only as Mr. Dark appears, trouble brews in Rayman's world. Mr. Dark captures the Toons - source of light and Rayman's friends. With no more light, evil creatures begin to roam, making the world unsafe for everyone. It’s up to you, as Rayman, to free your friends and put an end to Mr. Dark's dastardly schemes!</p><p><em>Rayman</em> is a side-scrolling platformer starring the titular Rayman, a big-nosed chap with no arms or legs. Rayman can jump and use his hair to hover for a short period of time. He can also attack by throwing his fists, or winding up his fists for a more powerful punch. He can occasionally find special power ups that grant him unlimited flying power, giving him the ability to navigate through tricky mazes.</p>"},{"name":"Real Bout Fatal Fury Best Collection","year":1998,"developer":"SNK Corporation"},{"name":"Real Bout Garou Densetsu","year":1996,"developer":"SNK Corporation","url":"e#Real%20Bout%20Garou%20Densetsu%20%28Japan%29%20%282M%29.zip","filesize":359384921,"score":7.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>The fourth title of fighting Fatal Fury series. Now, you can destroy fight scene objects and the \"Fatal Fury 2\" fighters are back forming this list: Terry Bogard, Andy Bogard, Joe Higashi, Franco Bash, Mai Shiranui, Bob Wilson, Geese Howard, Billy Kane, Hon-Fu, Ryuji Yamazaki, Sokaku Mochizuki, Blue Mary, Kim Kaphwan, Jin Chonrei, Jin Chonshu and Duck King.</p>"},{"name":"Real Bout Garou Densetsu Special","year":1997,"developer":"SNK Corporation","url":"e#Real%20Bout%20Garou%20Densetsu%20Special%20%28Japan%29.zip","filesize":548113838,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>It was the sequel of Real Bout Fatal Fury, with which sixth delivery of the series was arrived at his, in this we had 20 characters (Terry Bogard, Andy Bogard, Joe Higashi, Mai Shiranui, Tung Fu Rue, Cheng Chinzan, Laurence Blood, Wolfgang Krauser, Duck King, Kim Kaphwan, Blue Mary, Hon-Fu, Bob Wilson, Mochizuki Sokaku, Franco Bash, Ryuji Yamazaki, Jin Chonshu, Jin Chonrei, Billy Kane and Geese Howard) and their aspects are 100% remodeled.Also, the game maintains the capacity to destroy some things of the fight zone.</p>"},{"name":"Real Mahjong Adventure: Umi e - Summer Waltz","year":1998,"developer":"","url":"e#Real%20Mahjong%20Adventure%20-%20Umi%20e%20-%20Summer%20Waltz%20%28Japan%29.zip","filesize":331463571,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>This spin-off title in the <em>Super Real Mahjong</em> series takes a much different approach. It's a visual novel. You can pursue a relationship with several girls from Super Real Mahjong PV, P VI, and P7. There is a lot of talking, and you often have to make choices of what to say or do. An overworld map system is utilized, as the girls are in different locations.</p>"},{"name":"Real Sound: Kaze no Regret (Disc 1)","year":1997,"developer":"Warp Inc.","url":"e#Real%20Sound%20-%20Kaze%20no%20Regret%20%28Japan%29%20%28Disc%201%29%20%282M%29.zip","filesize":344597148,"score":"","genres":"Adventure > Audio game","desc":"<p>Mizu Sakura is a Tokyo elementary student who is transferred to a new school. There, she falls in love with a boy named Hiroshi Nonoichi. The two decide to elope together, fearing that nobody will accept their relationship at such a young age. However, Mizu never shows up for the meeting; a while later Hiroshi learns that she has been transferred to another school.</p><p>Several years have passed. Mizu is looking for a job and Hiroshi attends college. It looks like both have moved on with their lives. But their past catches up with them when they learn about a mysterious disappearance in the subway system.</p><p><em>Real Sound: Kaze no Regret</em> is an audio game: it has no graphics or other visuals of any kind. Gameplay-wise, it is identical to visual novels, with written text and images being replaced by sound. The player listens to the voice-acted story, which is occasionally interrupted by a chime, prompting the player to make a decision and branch the plot.</p>"},{"name":"Real Sound: Kaze no Regret (Disc 2)","year":1997,"developer":"Warp Inc.","url":"e#Real%20Sound%20-%20Kaze%20no%20Regret%20%28Japan%29%20%28Disc%202%29%20%282M%29.zip","filesize":502319554,"score":"","genres":"Adventure > Audio game","desc":"<p>Mizu Sakura is a Tokyo elementary student who is transferred to a new school. There, she falls in love with a boy named Hiroshi Nonoichi. The two decide to elope together, fearing that nobody will accept their relationship at such a young age. However, Mizu never shows up for the meeting; a while later Hiroshi learns that she has been transferred to another school.</p><p>Several years have passed. Mizu is looking for a job and Hiroshi attends college. It looks like both have moved on with their lives. But their past catches up with them when they learn about a mysterious disappearance in the subway system.</p><p><em>Real Sound: Kaze no Regret</em> is an audio game: it has no graphics or other visuals of any kind. Gameplay-wise, it is identical to visual novels, with written text and images being replaced by sound. The player listens to the voice-acted story, which is occasionally interrupted by a chime, prompting the player to make a decision and branch the plot.</p>"},{"name":"Real Sound: Kaze no Regret (Disc 3)","year":1997,"developer":"Warp Inc.","url":"e#Real%20Sound%20-%20Kaze%20no%20Regret%20%28Japan%29%20%28Disc%203%29%20%282M%29.zip","filesize":268867581,"score":"","genres":"Adventure > Audio game","desc":"<p>Mizu Sakura is a Tokyo elementary student who is transferred to a new school. There, she falls in love with a boy named Hiroshi Nonoichi. The two decide to elope together, fearing that nobody will accept their relationship at such a young age. However, Mizu never shows up for the meeting; a while later Hiroshi learns that she has been transferred to another school.</p><p>Several years have passed. Mizu is looking for a job and Hiroshi attends college. It looks like both have moved on with their lives. But their past catches up with them when they learn about a mysterious disappearance in the subway system.</p><p><em>Real Sound: Kaze no Regret</em> is an audio game: it has no graphics or other visuals of any kind. Gameplay-wise, it is identical to visual novels, with written text and images being replaced by sound. The player listens to the voice-acted story, which is occasionally interrupted by a chime, prompting the player to make a decision and branch the plot.</p>"},{"name":"Real Sound: Kaze no Regret (Disc 4)","year":1997,"developer":"Warp Inc.","url":"e#Real%20Sound%20-%20Kaze%20no%20Regret%20%28Japan%29%20%28Disc%204%29%20%283M%29.zip","filesize":597575494,"score":"","genres":"Adventure > Audio game","desc":"<p>Mizu Sakura is a Tokyo elementary student who is transferred to a new school. There, she falls in love with a boy named Hiroshi Nonoichi. The two decide to elope together, fearing that nobody will accept their relationship at such a young age. However, Mizu never shows up for the meeting; a while later Hiroshi learns that she has been transferred to another school.</p><p>Several years have passed. Mizu is looking for a job and Hiroshi attends college. It looks like both have moved on with their lives. But their past catches up with them when they learn about a mysterious disappearance in the subway system.</p><p><em>Real Sound: Kaze no Regret</em> is an audio game: it has no graphics or other visuals of any kind. Gameplay-wise, it is identical to visual novels, with written text and images being replaced by sound. The player listens to the voice-acted story, which is occasionally interrupted by a chime, prompting the player to make a decision and branch the plot.</p>"},{"name":"Refrain Love: Anata ni Aitai","year":1997,"developer":"Riverhillsoft Inc."},{"name":"Resident Evil","year":1997,"developer":"Capcom Co., Ltd.","url":"e#Resident%20Evil%20%28Europe%29.zip","filesize":493973952,"score":8,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Survival horror > Direct control > Contemporary > North America > Horror > Regional differences","desc":"<p>A team of S.T.A.R.S (Special Tactics And Rescue Squad) members are called to investigate a series of murders near Raccoon City.While searching the woods near the city, the team is attacked by bloodthirsty dogs and they have to retreat to a nearby mansion. </p><p>The player chooses between Jill Valentine or Chris Redfield and starts to explore the mansion. It soon becomes very clear that it isn't just any mansion, but a hellish place where the undead walk the corridors, and other horrors are lurking in the darkness, waiting to eat some heads. While solving puzzles, collecting keys, and shooting monsters, the player has to unravel the mystery behind this mansion and, if possible, get out alive.</p><p>Exclusive to the SEGA Saturn version is a Battle Mode bonus mode, where, with limited ammo and under the threat of limited time, the player must survive a series of rooms filled with monsters.</p>"},{"name":"Return to Zork","year":1996,"developer":"Activision, Inc.","url":"e#Return%20to%20Zork%20%28Japan%29%20%281M%29.zip","filesize":533987604,"score":6.8,"genres":"Adventure > 1st-person > Graphic adventure > Puzzle elements > Point and select","desc":"<p>You are standing behind the white house. There is something in the mailbox. A video message from a wizard informing you that you are the sweepstakes winner to the Valley of the Sparrows... right now, by magic flight. Upon arriving at this mysterious place however, not everything is as it should be. There's nobody to meet you and those who you do come across don't seem to have any knowledge about a sweepstakes. It looks like this is a private vacation and you'll need to find your own way through this land.</p><p><em>Return to Zork</em> is a first-person adventure game using live actors and video sequences. The game is similar to Myst in interface; the player is also able to rotate the viewpoint to discover new areas and uncover items that can be used or picked up. Various characters will be met along the way and spoken to via a system of dialog choices. The game allows the player to experiment with items in various ways, including discharging them; however, this often leads to \"dead ends\", rendering it impossible to complete the game.</p>"},{"name":"Revolution X: Music Is the Weapon","year":1995,"developer":"Midway Manufacturing Company","url":"e#Revolution%20X%20-%20Music%20Is%20the%20Weapon%20%28Germany%29%20%285S%29.zip","filesize":576007617,"score":5.1,"genres":"Action > 1st-person > Rail shooter > Sci-fi / futuristic > Regional differences","desc":"<p>Revolution X is about the ol' Rock &amp; Roll.</p><p>There is an evil nation putting the youth down and banning our beloved rock music. Who you gonna call? Aerosmith!With the help of Aerosmith, the player must shoot his/her way through enemy infested levels, (light) guns blazing, collecting power-ups and releasing hostages.</p><p>Almost all of the graphics are digitized and Aerosmith themselves are too! There are also lots of fmv videos. </p>"},{"name":"Riglordsaga 2","year":1996,"developer":"Micro Cabin Corp.","url":"e#Riglordsaga%202%20%28Japan%29%20%282M%29.zip","filesize":539397236,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Turn-based > Fantasy","desc":"<p>The sequel to  Blazing Heroes, originally known as <em>Riglord Saga</em>. You play the role of Mieu, the princess of Dragoon Kingdom. One day the castle is attacked by two men from a mysterious organization called the Seven Wisemen. The princess and her best friend have no choice but to escape, but it seems that they are the ones their enemies are looking for!</p><p>The game utilizes the same gameplay system as the predecessor. You form a large party with which you participate in long, strategic turn-based battles. You move your characters on the battle field, attacking enemies or casting magical spells. The strength of your attacks depend on the amount of movements you have made before.</p>"},{"name":"Rise 2: Resurrection","year":1996,"developer":"Mirage Technologies (Multimedia) Ltd.","url":"e#Rise%202%20-%20Resurrection%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":421832463,"score":6.2,"genres":"Action > Side view > 2D scrolling > Fighting > Cyberpunk / dark sci-fi","desc":"<p>In the sequel new troubles in ElectroCorp have begun. As we remember, this corporation made robots for civilian jobs, but one Supervisor decided to make robot-killers. Human brains were implanted on some of them. But this time, one hacker has infected the ElectroCorp's network with a virus, so Supervisor lost control over robots and they began to kill each other. You are one of them.</p>"},{"name":"Riven: The Sequel to Myst (Disc 1)","year":1998,"developer":"Cyan Worlds, Inc.","url":"e#Riven%20-%20The%20Sequel%20to%20Myst%20%28Japan%29%20%28Disc%201%29.zip","filesize":440659298,"score":8.1,"genres":"Adventure > 1st-person > Puzzle elements > Fantasy > Steampunk","desc":"<p>After the Stranger has rescued Atrus, the master of \"linking books\", from the imprisonment caused by his sons, a new task awaits the hero. Atrus's wife, Catherine, has been taken by Gehn, his own father. Gehn has appointed himself as the one to rule the Age of Riven, and has driven his world to collapse. Now he holds Catherine hostage on Riven, hoping that his son will restore the book link to the Age and free him from there. The Stranger is requested by Atrus to travel to Riven and find a way to rescue Catherine.</p><p><em>Riven</em> is a sequel to  Myst, and is very similar to its predecessor in gameplay style, controls, and visual presentation. The game world is presented as a series of computer-generated still screens; the player explores it in a point-and-click fashion. Interaction with the environment is possible only when said environment is highlighted as a \"hot spot\", and is also performed by simple clicking. Like its predecessor, <em>Riven</em> is heavy on puzzles, which rarely include using inventory items, but usually involve understanding and manipulating the complex environments and machinery of the game world.</p>"},{"name":"Riven: The Sequel to Myst (Disc 2)","year":1998,"developer":"Cyan Worlds, Inc.","url":"e#Riven%20-%20The%20Sequel%20to%20Myst%20%28Japan%29%20%28Disc%202%29.zip","filesize":404041930,"score":8.1,"genres":"Adventure > 1st-person > Puzzle elements > Fantasy > Steampunk","desc":"<p>After the Stranger has rescued Atrus, the master of \"linking books\", from the imprisonment caused by his sons, a new task awaits the hero. Atrus's wife, Catherine, has been taken by Gehn, his own father. Gehn has appointed himself as the one to rule the Age of Riven, and has driven his world to collapse. Now he holds Catherine hostage on Riven, hoping that his son will restore the book link to the Age and free him from there. The Stranger is requested by Atrus to travel to Riven and find a way to rescue Catherine.</p><p><em>Riven</em> is a sequel to  Myst, and is very similar to its predecessor in gameplay style, controls, and visual presentation. The game world is presented as a series of computer-generated still screens; the player explores it in a point-and-click fashion. Interaction with the environment is possible only when said environment is highlighted as a \"hot spot\", and is also performed by simple clicking. Like its predecessor, <em>Riven</em> is heavy on puzzles, which rarely include using inventory items, but usually involve understanding and manipulating the complex environments and machinery of the game world.</p>"},{"name":"Riven: The Sequel to Myst (Disc 3)","year":1998,"developer":"Cyan Worlds, Inc.","url":"e#Riven%20-%20The%20Sequel%20to%20Myst%20%28Japan%29%20%28Disc%203%29.zip","filesize":379975162,"score":8.1,"genres":"Adventure > 1st-person > Puzzle elements > Fantasy > Steampunk","desc":"<p>After the Stranger has rescued Atrus, the master of \"linking books\", from the imprisonment caused by his sons, a new task awaits the hero. Atrus's wife, Catherine, has been taken by Gehn, his own father. Gehn has appointed himself as the one to rule the Age of Riven, and has driven his world to collapse. Now he holds Catherine hostage on Riven, hoping that his son will restore the book link to the Age and free him from there. The Stranger is requested by Atrus to travel to Riven and find a way to rescue Catherine.</p><p><em>Riven</em> is a sequel to  Myst, and is very similar to its predecessor in gameplay style, controls, and visual presentation. The game world is presented as a series of computer-generated still screens; the player explores it in a point-and-click fashion. Interaction with the environment is possible only when said environment is highlighted as a \"hot spot\", and is also performed by simple clicking. Like its predecessor, <em>Riven</em> is heavy on puzzles, which rarely include using inventory items, but usually involve understanding and manipulating the complex environments and machinery of the game world.</p>"},{"name":"Riven: The Sequel to Myst (Disc 4)","year":1998,"developer":"Cyan Worlds, Inc.","url":"e#Riven%20-%20The%20Sequel%20to%20Myst%20%28Japan%29%20%28Disc%204%29.zip","filesize":345147445,"score":8.1,"genres":"Adventure > 1st-person > Puzzle elements > Fantasy > Steampunk","desc":"<p>After the Stranger has rescued Atrus, the master of \"linking books\", from the imprisonment caused by his sons, a new task awaits the hero. Atrus's wife, Catherine, has been taken by Gehn, his own father. Gehn has appointed himself as the one to rule the Age of Riven, and has driven his world to collapse. Now he holds Catherine hostage on Riven, hoping that his son will restore the book link to the Age and free him from there. The Stranger is requested by Atrus to travel to Riven and find a way to rescue Catherine.</p><p><em>Riven</em> is a sequel to  Myst, and is very similar to its predecessor in gameplay style, controls, and visual presentation. The game world is presented as a series of computer-generated still screens; the player explores it in a point-and-click fashion. Interaction with the environment is possible only when said environment is highlighted as a \"hot spot\", and is also performed by simple clicking. Like its predecessor, <em>Riven</em> is heavy on puzzles, which rarely include using inventory items, but usually involve understanding and manipulating the complex environments and machinery of the game world.</p>"},{"name":"Road & Track Presents: The Need for Speed","year":1996,"developer":"Electronic Arts, Inc.","url":"e#Road%20%26%20Track%20Presents%20-%20The%20Need%20for%20Speed%20%28Europe%29%20%28En%2CDe%29.zip","filesize":593879979,"score":7.9,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing","desc":"<p>Drive some of your favourite sports cars through wild and fast tracks, including the Dodge Viper, Lamborghini, Ferrari, Porsche, Corvette, Mazda RX7, Toyota Supra Turbo, and Acura NSX.Some of the tracks are open road, meaning you simply fly down a huge highway, with cops following in hot pursuit. One of the options in the game allows you to pick which time of the day to race in.</p>"},{"name":"Road Rash","year":1996,"developer":"Papyrus Design Group, Inc.","url":"e#Road%20Rash%20%28Europe%29.zip","filesize":483256477,"score":7.7,"genres":"Action > Racing / Driving > Behind view > Motorcycle > Street racing","desc":"<p>Road Rash is a remake of the original from the early nineties. For those who've not played the original, you're competing against thirteen other \"Road Rashers\" who will stop at nothing to win. During the race, you have two options available: you can either do your best to cross the finish line or use your weapon to bring the Rashers to the ground if they give you trouble. Do the latter, and your opponents will do the same to you during the next race.</p><p>There are five circuits to race: The City, The Peninsula, Pacific Highway, Sierra Nevada, and Napa Valley. Some of these circuits are dangerous. In addition to the obstacles and traffic you encounter along the way, there are also police motorcycle units that will arrest you if you happen to crash or stop near them. Get caught, and you'll have to pay a fine to get in any more races. If you crash too often, your bike will be wrecked, forcing you to pay for damages. The amount you have to pay depends on the bike you are riding. Once you have completed the first five circuits, you have to race them again another four times - but at a much higher difficulty. Manage to win all five circuits on all levels, and you win the Road Rash cup!</p><p>There are about five bikes to choose from, divided into three groups; Rat, Sport, and Super. You start the first level with a Rat bike. As you progress through the levels it will become increasingly important to pick bikes from different classes.</p><p>If you have no plans to win the Road Rash cup, you can choose the game's Thrash mode. The difference between this and the other mode is that there is no money involved (i.e., you are not allowed to buy bikes), and you're competing against fourteen opponents. And if you wreck your bike or get busted, you have to start all over again. Regardless of the mode you pick, you will always start in the last place.</p><p>The remake also contains FMV movies that usually depict the outcome of the races, as well as limited songs performed by various recording artists, including Soundgarden, Therapy?, Monster Magnet, and Swervedriver. These songs can be changed on-the-fly via the game's options menu.</p>"},{"name":"Robo Pit","year":1996,"developer":"Altron Corporation","url":"e#Robo%20Pit%20%28Europe%29.zip","filesize":318552182,"score":6.4,"genres":"Action > Side view > Fighting > Sci-fi / futuristic","desc":"<p>Robo Pit is an arena fighter, plain and simple. Well, maybe not so simple. When you start your game, you have to build your mechanical gladiator; choosing the color, body, eyes and legs. While most of your starting choices are purely cosmetic, the legs you choose do slightly affect your game by changing the speed and mobility of your fighter, as well as its special attack.</p><p>Once you've created your robotic brawler, it's time to start climbing the ranks. To progress, you have to fight the robot that's occupying the rank above yours. Once you beat them, you get to take an arm and then move up. The game continues on in this fashion until you've bested all of the other combatants. However, a few curve-balls are thrown your way as you climb the ladder. For starters, there are several different arms you can acquire; from swords and shields to cannons and lasers, and the more you use them, the faster and more effective (i.e. damaging) they are. On top of that, even so often a sort of \"boss\" robot is put in your way. These \"bosses\" use special weapons that only they have access to. Until you pound them into scrap and take them, that is. These weapons can be incredibly powerful if you stick with them, making the rest of the fighters, save number one, a breeze. As an added bonus, you can even save your cyber-combatant to a memory card and bring it to a friend's house for some one-on-one let's-see-who-has-the-best-robot fighting goodness!</p><p>The arenas themselves are fairly basic, but they are varied, offering up different layout and obstacles to take cover behind or use to get the drop on your opponent. They also have ledges, and like most fighting games a ring-out means an instant loss. As for the fighting, it's simple, but effective. Square and circle attack with the left and right arms, X jumps and triangle triggers your special (which has to charge of course). Of course different weapons have different ranges and timing, which will also improve the more you use them.</p>"},{"name":"Robotica: Cybernation Revolt","year":1995,"developer":"Micronet Co. Ltd.","url":"e#Robotica%20-%20Cybernation%20Revolt%20%28Europe%29.zip","filesize":109290632,"score":6.1,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p><em>Robotica</em> was the first, first-person shooter for the platform and a first generation game for the console. It is somewhat similar to Space Hulk, only that the player takes the role of a machine that rebels against the robots to save mankind. The weapons include a punch, Vulcan gun, Missiles, and Lasers. The main environment is made up of various hallways. The player runs through the various stages collecting keys, using computers, and triggering lights. The enemies are relatively basic but are dangerous in numbers.</p><p>The game is set in 2877, 800 years after the world's peacekeeping unions have collapsed. They are replaced with World Silent Security Service, a global world order to maintain the security on earth and in space. However, over time the role of the order is questioned, and the Reformist Faction rebel group sends three pilots in Laocorn assault robots to the WSSS' space station Daedalus in earth's orbit. Two are immediately destroyed, but the player gets to control the remaining robot.</p>"},{"name":"Rohga: Armor Force","year":1997,"developer":"Data East Corporation"},{"name":"Romance of the Three Kingdoms IV - Wall of Fire","year":1995,"developer":"KOEI Co., Ltd.","url":"e#Romance%20of%20the%20Three%20Kingdoms%20IV%20-%20Wall%20of%20Fire%20%28USA%29.zip","filesize":448591312,"score":7,"genres":"Strategy > Top-down > Isometric > Turn-based > China (Ancient / Imperial) > Historical events","desc":"<p>The Three Kingdoms era of Chinese history is the setting for this strategic war game. Select one of 38 leaders and guide your people to power by military or diplomatic means in an isometrically viewed world. Military tactics such as well-placed taunts and deliberate enemy confusion are on offer. Weaponry includes catapults and automatic-firing crossbows.</p>"},{"name":"Romance of the Three Kingdoms IV with Power Up Kit","year":1997,"developer":"KOEI Co., Ltd."},{"name":"Ronde (Disc 1)","year":1997,"developer":"Atlus Co., Ltd.","url":"e#Ronde%20%28Japan%29%20%28Disc%201%29.zip","filesize":248256795,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p>\"Ronde\" is the third game in  Majin Tensei series, which is, in its turn, a part of  Megaten franchise. The game is set in the near future, in Japan. A teenage boy named Asuka and his friends visit a demon museum. Suddenly, one of the demon statues comes to life and kidnaps Asuka's little brother. This is just a beginning of a demon invasion that Asuka and his friends must stop at all costs.</p><p>Like the two previous Majin Tensei games, \"Ronde\" is a strategy RPG. You can control your characters only during battles, which occupy the entire gameplay section of the game. During the turn-based battles, you can move your characters freely on a 3D battlefield. When you come in contact with a demon, you can choose your action (attack, magic, etc.), after which an automatic battle sequence occurs. Like in all other Megaten games, you can communicate with the enemies you meet. In this particular game, the demons will initiate a conversation by themselves, which will allow you to recruit them and make them fight on your side. You can also make contracts with the demons to use their magic spells in battles.</p>"},{"name":"Ronde (Disc 2)","year":1997,"developer":"Atlus Co., Ltd.","url":"e#Ronde%20%28Japan%29%20%28Disc%202%29.zip","filesize":261744328,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p>\"Ronde\" is the third game in  Majin Tensei series, which is, in its turn, a part of  Megaten franchise. The game is set in the near future, in Japan. A teenage boy named Asuka and his friends visit a demon museum. Suddenly, one of the demon statues comes to life and kidnaps Asuka's little brother. This is just a beginning of a demon invasion that Asuka and his friends must stop at all costs.</p><p>Like the two previous Majin Tensei games, \"Ronde\" is a strategy RPG. You can control your characters only during battles, which occupy the entire gameplay section of the game. During the turn-based battles, you can move your characters freely on a 3D battlefield. When you come in contact with a demon, you can choose your action (attack, magic, etc.), after which an automatic battle sequence occurs. Like in all other Megaten games, you can communicate with the enemies you meet. In this particular game, the demons will initiate a conversation by themselves, which will allow you to recruit them and make them fight on your side. You can also make contracts with the demons to use their magic spells in battles.</p>"},{"name":"Roommate 3 - Ryouko Kaze no Kagayaku Asa ni","year":1998,"developer":"Vision Works","url":"e#Roommate%203%20-%20Ryouko%20Kaze%20no%20Kagayaku%20Asa%20ni%20%28Japan%29.zip","filesize":338605715,"score":"","genres":"Adventure > 1st-person > Top-down > Anime / Manga > Visual novel","desc":"<p>The final game in the <em>Roommate</em> series centering around Ryouko Inoue lead female character. She has just returned from her stay in United Stated and is now a third year high-school student. It is February, and high-school graduation is approaching soon. As her new roommate, you will be spending what little time there is left until the graduation, and maybe even fall in love along the way.</p><p>The game uses top-down view of a house where you can move from one room to another, which effectively enters a slightly richer visual-novel adventure mode where you can perform a predefined set of actions such as look at the calendar or water the flower or talk to other characters in the room, depending on the location you are at.</p>"},{"name":"Roommate Complete Box: Ryōko Inoue","year":2000,"developer":""},{"name":"Roommate: Ryōko in Summer Vacation (Shokai Genteiban)","year":1997,"developer":"Vision Works"},{"name":"RoX - 6 = Six","year":1998,"developer":"Altron Corporation","url":"e#RoX%20-%206%20%3D%20Six%20%28Japan%29.zip","filesize":6513452,"score":"","genres":"Puzzle > Falling block puzzle","desc":"<p>Rox is a falling block/matching game, but with a twist. Each of the blocks is a dice which has a number on it. Instead of only matching colors, in this game both the colors and numbers matter.</p><p>In order to remove dice two end numbers must be the same, with that amount of other dice in between them. For instance if two dice are ones, there must be one die in between them. If both of the end dice are the same color, all of the dice in between will also be erased, however if they are two different colors than only the end dice will be erased.</p>"},{"name":"Ruriiro no Yuki","year":1998,"developer":"AIL"},{"name":"Ryoko no Osyaberi Room","year":1999,"developer":"Fupac"}]