[{"name":"Sakura Taisen - Hanagumi Taisen Columns","year":1997,"developer":"Red Company Corporation","url":"e#Sakura%20Taisen%20-%20Hanagumi%20Taisen%20Columns%20%28Japan%29.zip","filesize":269786099,"score":"","genres":"Action > Adventure > Puzzle > 1st-person > Fixed / flip-screen > Anime / Manga > Real-time > Falling block puzzle > Visual novel > Direct control > Menu structures > Interwar > Steampunk","desc":"<p><em>Hanagumi Taisen Columns</em> is a Sakura Wars spinoff that crosses the series over with SEGA's classic puzzle game Columns. The core gameplay follows the classic <em>Columns</em> rules: players control falling columns of three blocks of assorted colours with the goal of creating horizontal, vertical, or diagonal sets of 3 pieces of the same colour. Unlike the original <em>Columns</em>, this game introduces a new Puyo Puyo-style competitive mechanic. As players perform combos, a super gauge fills, with longer combos rewarding progressively larger amounts of super meter. Each time the meter fills to a full level, players are given the option to keep charging or to perform an offensive or defensive special technique. Offensive attacks send garbage blocks to the opponent's side; these pieces have the same colours as normal pieces, but can't be used in a combo until a certain number of turns passes. Defensive techniques remove lines of blocks from the player's side. The longer the player charges up their super meter, the more powerful techniques become.</p><p>A visual novel story mode gives the player a traditional <em>Sakura Wars</em>-style story, complete with branching story paths using the series's trademark LIPS option-selection system. However, instead of mech battles, characters settle their differences with matches of <em>Columns</em>. The story follows the troupe's production of <em>Cinderella</em>, with each character vying for the best parts in the show.</p>"},{"name":"Sakura Taisen (Disc 1)","year":1996,"developer":"Overworks","url":"e#Sakura%20Taisen%20%28Japan%29%20%28Disc%201%29%20%287M%2C%209M%29.zip","filesize":478564094,"score":7.3,"genres":"Adventure > Strategy > 1st-person > Diagonal-down > Isometric > Anime / Manga > Turn-based > Japanese-style adventure > Point and select > Mecha / giant robot > Interwar > Steampunk","desc":"<p>It is the Taishou Era in Japan, and the Western world has begun to make its way through traditional Japan. Technology is evolving, and the use of steam has made for great breakthroughs in transportation in weaponry. But the world faces a deadly threat: a dark cult wishes to destroy Japan and the very world itself. To combat any possible threats, the Imperial government of Japan brings together 6 young ladies from around the world to form the Hanagumi (Flower Bridage) division of the Teikoku Kagekidan (Imperial Floral Assault Group). Clad in their proud spiritual armor, the Kobou, these young women are the frontline of defense against the demon worshippers, but they haven't a leader to guide them into battle.</p><p>And, with a single letter, young Navy ensign Ichiro Ogami's life is about to take a very interesting turn as the chosen leader of the Hanagumi! Ichiro now has to gain the trust of the members of the Hanagumi if he expects to keep things under control.</p><p>The gameplay of <em>Sakura Taisen</em> is a combination of Japanese-style adventure with dating mechanics and tactical turn-based combat. Most of the game is spent exploring the theater, which serves as a disguise for the military base. Depending on the player's decisions - where to go, which girl to look for, how to answer the questions (there is a time limit for responses) - the protagonist will develop different relationships with the girls, which will influence not only further dialogues and the ending, but also slightly affect their parameters in battles. During combat, the player navigates Ichiro and the girls over an isometric battlefield and attack the enemies physically, or charge for powerful special attacks. Each turn it is possible to perform two different actions per character; walking distance and attack range are limited and unique to each character. There is no experience points system and also no equipment in the game.</p>"},{"name":"Sakura Taisen (Disc 2)","year":1996,"developer":"Overworks","url":"e#Sakura%20Taisen%20%28Japan%29%20%28Disc%202%29%20%287M%29.zip","filesize":469229756,"score":7.3,"genres":"Adventure > Strategy > 1st-person > Diagonal-down > Isometric > Anime / Manga > Turn-based > Japanese-style adventure > Point and select > Mecha / giant robot > Interwar > Steampunk","desc":"<p>It is the Taishou Era in Japan, and the Western world has begun to make its way through traditional Japan. Technology is evolving, and the use of steam has made for great breakthroughs in transportation in weaponry. But the world faces a deadly threat: a dark cult wishes to destroy Japan and the very world itself. To combat any possible threats, the Imperial government of Japan brings together 6 young ladies from around the world to form the Hanagumi (Flower Bridage) division of the Teikoku Kagekidan (Imperial Floral Assault Group). Clad in their proud spiritual armor, the Kobou, these young women are the frontline of defense against the demon worshippers, but they haven't a leader to guide them into battle.</p><p>And, with a single letter, young Navy ensign Ichiro Ogami's life is about to take a very interesting turn as the chosen leader of the Hanagumi! Ichiro now has to gain the trust of the members of the Hanagumi if he expects to keep things under control.</p><p>The gameplay of <em>Sakura Taisen</em> is a combination of Japanese-style adventure with dating mechanics and tactical turn-based combat. Most of the game is spent exploring the theater, which serves as a disguise for the military base. Depending on the player's decisions - where to go, which girl to look for, how to answer the questions (there is a time limit for responses) - the protagonist will develop different relationships with the girls, which will influence not only further dialogues and the ending, but also slightly affect their parameters in battles. During combat, the player navigates Ichiro and the girls over an isometric battlefield and attack the enemies physically, or charge for powerful special attacks. Each turn it is possible to perform two different actions per character; walking distance and attack range are limited and unique to each character. There is no experience points system and also no equipment in the game.</p>"},{"name":"Sakura Taisen 2: Kimi, Shinitamou Koto Nakare (Disc 1)","year":1998,"developer":"Production I.G, Inc.","url":"e#Sakura%20Taisen%202%20-%20Kimi%2C%20Shinitamou%20Koto%20Nakare%20%28Japan%29%20%28Disc%201%29%20%283M%2C%204M%29.zip","filesize":457192078,"score":7.3,"genres":"Adventure > Strategy > 1st-person > Diagonal-down > Isometric > Anime / Manga > Turn-based > Japanese-style adventure > Point and select > Mecha / giant robot > Interwar > Steampunk","desc":"<p>Japan, 1920's. After having defeated the ultimate evil, the charming ladies of the Hanagumi Squad and their young commander Ichiro Ogami believe that Japan is safe forever. But their archenemy is resurrected by a mysterious hand. And even though the heroes defeat him once again, they realize that sooner or later they'll have to confront the masked demon who has brought their foe back to life, find out who or what is pulling the strings behind the scene, and revive once again the tragic past.</p><p>Being a direct continuation to the first Sakura Taisen, the second installment is very similar to it graphically and gameplay-wise. The game is divided into adventure and battle modes. In adventure mode, the player controls Ichiro Ogami, moving around the theater (into which the base is disguised), trying to initiate conversations with the girls and choosing timed responses, which influence the hero's relationship with the girl and also slightly affect her parameters in combat. Battles are pre-set and take place on large isometric fields, on which the player navigates mech-piloting girls and Ichiro himself, fighting enemy forces in turn-based combat. There are two new characters in the game, and several refinements to the timed answer system.</p>"},{"name":"Sakura Taisen 2: Kimi, Shinitamou Koto Nakare (Disc 2)","year":1998,"developer":"Production I.G, Inc.","url":"e#Sakura%20Taisen%202%20-%20Kimi%2C%20Shinitamou%20Koto%20Nakare%20%28Japan%29%20%28Disc%202%29%20%281M%2C%202M%29.zip","filesize":455317776,"score":7.3,"genres":"Adventure > Strategy > 1st-person > Diagonal-down > Isometric > Anime / Manga > Turn-based > Japanese-style adventure > Point and select > Mecha / giant robot > Interwar > Steampunk","desc":"<p>Japan, 1920's. After having defeated the ultimate evil, the charming ladies of the Hanagumi Squad and their young commander Ichiro Ogami believe that Japan is safe forever. But their archenemy is resurrected by a mysterious hand. And even though the heroes defeat him once again, they realize that sooner or later they'll have to confront the masked demon who has brought their foe back to life, find out who or what is pulling the strings behind the scene, and revive once again the tragic past.</p><p>Being a direct continuation to the first Sakura Taisen, the second installment is very similar to it graphically and gameplay-wise. The game is divided into adventure and battle modes. In adventure mode, the player controls Ichiro Ogami, moving around the theater (into which the base is disguised), trying to initiate conversations with the girls and choosing timed responses, which influence the hero's relationship with the girl and also slightly affect her parameters in combat. Battles are pre-set and take place on large isometric fields, on which the player navigates mech-piloting girls and Ichiro himself, fighting enemy forces in turn-based combat. There are two new characters in the game, and several refinements to the timed answer system.</p>"},{"name":"Sakura Taisen 2: Kimi, Shinitamou Koto Nakare (Disc 3)","year":1998,"developer":"Production I.G, Inc.","url":"e#Sakura%20Taisen%202%20-%20Kimi%2C%20Shinitamou%20Koto%20Nakare%20%28Japan%29%20%28Disc%203%29%20%284M%2C%205M%29.zip","filesize":443715427,"score":7.3,"genres":"Adventure > Strategy > 1st-person > Diagonal-down > Isometric > Anime / Manga > Turn-based > Japanese-style adventure > Point and select > Mecha / giant robot > Interwar > Steampunk","desc":"<p>Japan, 1920's. After having defeated the ultimate evil, the charming ladies of the Hanagumi Squad and their young commander Ichiro Ogami believe that Japan is safe forever. But their archenemy is resurrected by a mysterious hand. And even though the heroes defeat him once again, they realize that sooner or later they'll have to confront the masked demon who has brought their foe back to life, find out who or what is pulling the strings behind the scene, and revive once again the tragic past.</p><p>Being a direct continuation to the first Sakura Taisen, the second installment is very similar to it graphically and gameplay-wise. The game is divided into adventure and battle modes. In adventure mode, the player controls Ichiro Ogami, moving around the theater (into which the base is disguised), trying to initiate conversations with the girls and choosing timed responses, which influence the hero's relationship with the girl and also slightly affect her parameters in combat. Battles are pre-set and take place on large isometric fields, on which the player navigates mech-piloting girls and Ichiro himself, fighting enemy forces in turn-based combat. There are two new characters in the game, and several refinements to the timed answer system.</p>"},{"name":"Sakura Tsuushin","year":1998,"developer":"Media Gallop","url":"e#Sakura%20Tsuushin%20%28Japan%29.zip","filesize":385177511,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Romance","desc":"<p><em>Sakura Tsuushin</em> is a romantic visual novel adventure which follows the story of Touma Inaba (因幡 冬馬), the protagonist, who is trying to get into Keio University. On the day the exam scores are posted, he meets Mieko Yotsuba (四葉 美咲子), a readhead he falls in love to at first sight. After he finds out she got in, but didn't, he decides to lie and say he passed the exam and got into in order to impress her. He lives with Urara Kasuga (春日 麗) who has an unrequited love for him which is the only reason why she doesn't tell anyone that he is not really a college student and helps him in his love pursuit.</p><p>The game features anime style video clips as well as dialogues with slightly animated characters on static backdrops which forwards the story, branching it based on players actions and answers during conversation with other characters. Save game options is only available at key points in the story and cannot be done anywhere during gameplay as is case with most of visual novels. Bottom screen is used for text and does not have opacity, with graphical content appearing only in the upper area, whether static images or video clips. Certain key animations are done in full screen.</p>"},{"name":"Salamander Deluxe Pack Plus","year":1997,"developer":"","url":"e#Salamander%20Deluxe%20Pack%20Plus%20%28Japan%29.zip","filesize":463581315,"score":"","genres":"Action > Compilation > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Salamander Deluxe Pack Plus</em> is a compilation featuring ported versions of the arcade classic Salamander, its westernized port Life Force, and for the first time since its arcade release Salamander 2.</p><p>In all the games you control a lone starfighter as he battles the armies of Zelos, a terrible alien creature that threatens to eat the entire galaxy. Collect power-ups, defeat bosses and clear stages until you defeat the game without being blasted into space dust.</p><p>All games feature small tweaks like infinite continues and difficulty settings, but are otherwise faithfully recreated from their arcade counterparts.</p>"},{"name":"Samurai Spirits Best Collection","year":1998,"developer":""},{"name":"Samurai Spirits: Amakusa Kourin","year":1997,"developer":"SNK Corporation","url":"e#Samurai%20Spirits%20-%20Amakusa%20Kourin%20%28Japan%29%20%28En%2CJa%2CEs%2CPt%29.zip","filesize":539310705,"score":8.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Fantasy > Japan (Modern/Futuristic) > Martial arts","desc":"<p>Bringing a new breath to SNK's swordsman fighting series, this 4th installment marks the return of 3 classic characters (Yagyu Jubei, Charlotte and Tam Tam, now with updated stuff), introduces 2 newcomers for the pantheon (the brothers Sogetsu Kazama and Kazuki Kazama) and brings some new backgrounds.</p><p>In spite of these little improvements, the game preserved (and improved a lot) many elements that did the previous one (Samurai Shodown III: Blades of Blood) a quite popular title, like the dodge move and the chance to choose between two versions of the fighter: the standard one and an alternative dark-styled one (SLASH and BUST, respectively).</p><p>With the intention to provide more action in the battles, the \"No Contest\" Moves were introduced: working in similar way (and under certain conditions) to the many games of Mortal Kombat Series, your fighter will execute an ultimate-slaughter move in a stunned opponent.</p>"},{"name":"Samurai Spirits: Zankurou Musouken","year":1996,"developer":"SNK Corporation","url":"e#Samurai%20Spirits%20-%20Zankurou%20Musouken%20%28Japan%29.zip","filesize":514588473,"score":7.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fantasy > Martial arts","desc":"<p><em>The 12 samurai (and ninja) elite are back, this time to answer the threat of the demon Zankuro, Minazuki. The possessed swordsman has brutally slaughtered innocents in his path, yet could not raise his blade to the cries of an innocent baby. Vowing never to spill innocent blood again, he targets those who live by the way of the sword...but now the hunter becomes the hunted:</em><em> </em><em>Amakusa, Shiro Tokisada</em>* - The orb wielding Boss from Samurai Shodown I is now a contender in the race against Zankuro, his next religious sacrifice for enlightenment.</p><ul><li><p><strong>Basara, Kubikiri</strong> - The embodiment of hate has risen Basara the Executioner from his grave for revenge against Zankuro for murdering his lover (and himself). Love is stronger than death.</p></li><li><p><strong>Gaira, Kafuin</strong> - A Buddhist monk with giant prayer beads as his weapon. He had an argument with his grandfather, the great Nicotine and was kicked out from the monastery. Wandering aimlessly, he witnesses the demon Zankuro spill innocent blood. The monk vows to teach the demon a thing or two on the teachings of Buddha...the hard way.</p></li><li><p><strong>Galford and Poppy</strong> - The American Ninja and his beloved dog seeks to defeat the demon Zankuro in the quest for justice for the deaths of refugees killed by Zankuro.</p></li><li><p><strong>Genjuro, Kibagami</strong> - Former colleague of Haohmaru, now rival. Genjuro the Assassin almost killed Haohmaru in a match for a scroll that would increase one's fighting skill, but instead got expelled from his fighting school. Flamed with vengeance, now he's has his sword aimed at Haohmaru's heart...history will not repeat itself.</p></li><li><p><strong>Haohmaru</strong> - Learns from a boy that a demon killed his parents, out of compassion Haohmaru takes the task to avenge the boy of his parents.</p></li><li><p><strong>Hanzo, Hattori</strong> - Darkness never sets in the eyes of the Ninja Hanzo and death is its only release. The stench of death by the demon Zankuro only draws him nearer, to what may be his ultimate release.</p></li><li><p><strong>Kyoshiro, Senryo</strong> - The famed Kabuki artist searches out his next dramatic play by defeating the demon Zankuro for his next best-selling kabuki play!</p></li><li><p><strong>Nakoruru</strong> - Sensing a disturbance in Mother Nature, Nakoruru with the help of Shikuruu the wolf and Mamahaha the falcon seeks out the demon Zankuro.</p></li><li><p><strong>Rimururu</strong> - Nakoruru's ice-wielding sister. Determined to protect her sister at all costs feels instead that the disturbance in nature is caused by Amakusa.</p></li><li><p><strong>Shizumaru, Hisame</strong> - A boy with an umbrella searching for his past. Remembers only the never-ending screams of his parents being murdered by a vile demon...maybe this is the demon he's been searching all this time at long last...</p></li><li><p><strong>Ukyo, Tachibana</strong> - The blue-haired master swordsman finds his sensei and students dead. He learns that the demon Zankuro is responsible and heads off for revenge. The female fans still await him from a distance...</p></li></ul><p>The third series of Samurai Shodown introduces 2 different techniques for each character. The \"Slash\" techniques are the original moves of the most of the characters whereas the \"Bust\" techniques maybe the \"darker\" version of each character.</p>"},{"name":"Sangokushi Eiketsuden","year":1996,"developer":"KOEI Co., Ltd.","url":"e#Sangokushi%20Eiketsuden%20%28Japan%29.zip","filesize":252934872,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Isometric > Turn-based > China (Ancient / Imperial) > Historical events","desc":"<p>To commemorate Kou Shibusawa's 35th anniversary, the \"Kou Shibusawa Archives\" will be opened in the Steam Store. Here we will revive popular previously released titles.</p><p>In this eighth round of releases, we offer \"Sangokushi Eiketsuden,\" which was released in 1995.</p><p>This game is a simulation RPG in which players become Liu Bei and battle for the restoration of the Han Imperial court. The game progresses around the battle map. Players fulfill the victory conditions of each battle as they go from battlefield to battlefield to advance the story.</p>"},{"name":"Sangokushi Koumeiden","year":1997,"developer":"KOEI Co., Ltd.","url":"e#Sangokushi%20Koumeiden%20%28Japan%29.zip","filesize":368874124,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Isometric > Turn-based > China (Ancient / Imperial) > Historical events","desc":"<p><em>Sangokushi Kōmeiden</em> is the second installment in the <em>Sangokushi Eiketsuden</em> series.</p><p>Unlike its predecessor, <em>Sangokushi Kōmeiden</em> relies heavily on the player's ability and success in each combat to determine how the game will conclude. The game tracks the player's overall record by monitoring the character's overall health and counting the number of times the player has resorted from battle and restarted a level, in addition to having decisions at the beginnings of most stages that affect troop placements for both sides, event triggers, and the items found in armories and granaries. Zhuge's health will be badly harmed if he takes too many rounds to reach a specific point in the tale, or if he restarts fights too many times, and if he becomes too weak, he will die before the final Battle of Wuzhang Plains takes place. If the player's skill level is high enough, Zhuge Liang will pretend to die, leading his adversary, Sima Yi, out into the open. After then, the game will go to the last chapter, which will feature a series of climactic conflicts against the kingdoms of Cao Wei and Sun Wu.</p>"},{"name":"Sangokushi V","year":1996,"developer":"KOEI Co., Ltd.","url":"e#Sangokushi%20V%20%28Japan%29.zip","filesize":547259291,"score":7.6,"genres":"Strategy > Diagonal-down > Turn-based > China (Ancient / Imperial) > Historical events","desc":"<p><em>Romance of the Three Kingdoms V</em> is the fifth game in the popular turn-based strategy game series, based on the classic medieval Chinese novel \"San Guo\" (\"Three Kingdoms\"). The novel, written by Luo Guanzhong, is perhaps the most popular classic book in China and all countries influenced by the Chinese culture (such as Japan). Its events occur in the third century AD, during the Later Han Dynasty. Several army leaders (the most important ones being Liu Bei, Cao Cao, Sun Jian) are trying to unite China under their rule, and each one strives to defeat his opponents.</p><p><em>Romance of the Three Kingdoms V</em> offers many innovations. You won't only participate at wars, but also manage your country, and learn resource management of people and goods. A new \"Reputation\" parameter directly affects the people's opinion of you as the leader. Multiplayer allows participation of up to eight players (playing the eight main characters).</p><p>The game was never translated into English. It was released in Japan for the PC (both DOS and Windows), and for PlayStation. A Chinese translation of the game (DOS version) is available.</p>"},{"name":"Saturn Bomberman","year":1996,"developer":"Hudson Soft Company, Ltd.","url":"e#Saturn%20Bomberman%20%28Europe%29.zip","filesize":497274174,"score":8,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>An all out party game, this Saturn exclusive title has you controlling the little blue bomber along with up to 10 other bomber pals planting bombs to trap enemy characters. </p><p>Although there is no story mode, you can take on a host of other characters in one on one battles to see who is the master of the bomb. 10 players can then play on the one screen at a time, either against each other or in teams.</p><p>Saturn Bomberman can also connect to the Sega Saturn NetLink internet system, allowing two people from opposite ends of the earth to battle it out.</p>"},{"name":"Saturn Bomberman Fight!!","year":1997,"developer":"Eleven Co., Ltd.","url":"e#Saturn%20Bomberman%20Fight%21%21%20%28Japan%29.zip","filesize":499038755,"score":"","genres":"Action > Diagonal-down > Isometric > Arcade > Direct control > Sci-fi / futuristic","desc":"<p><em>Saturn Bomberman Fight!!</em> uses the basic formula of previous titles of the franchise like Saturn Bomberman, but strays from it in some aspects. It uses an isometric perspective in a 3D-polygon environment, where up to four characters of the Bomberman universe can fight each other in battles, either controlled by the AI or a human companion. </p><p>Players start out with the ability to jump over obstacles and throw bombs without having to collect powerups first, and there is also a health meter, so it's possible to survive more than one bomb blast. A brown horse is the only mount available, it can move quickly, absorb damage, and swallow bombs. Aside from the core battle mode, there is a story mode (which is rather similar to the battle mode in that it consists of matches against computer players) and a survival mode which goes endlessly on until the player is defeated.</p>"},{"name":"Scorcher","year":1997,"developer":"Zyrinx","url":"e#Scorcher%20%28Europe%29.zip","filesize":107339934,"score":6,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Post-apocalyptic","desc":"<p><em>Scorcher</em> is a futuristic racing game by Scavenger. In dark post-war-looking decors, you race against a couple of opponents driving in a spherical racer. You can pick up special triangles to gain speed powerups.</p><p>The graphics support resolutions up to 640x480.</p>"},{"name":"Scud: The Disposable Assassin","year":1997,"developer":"Syrox Developments, Ltd."},{"name":"Sea Bass Fishing","year":1996,"developer":"A Wave, Inc.","url":"e#Sea%20Bass%20Fishing%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":196988213,"score":"","genres":"Sports > Behind view > Direct control > Fishing","desc":"<p>No more fish tales, it's time to wind in that dream catch in the comfort of your own home. Follow the instructor's expert advice and choose from an extensive range of tackle developed by the fishing experts at Daiwa.</p><p>From Barracuda to Tuna, watch the bite close up in beautifully rendered 3D graphics, as the perspective zooms in on the underwater action. With a choice of Tournament and Free Fishing modes you can learn how to be a better fisherman and even fry up your catch in the lodge keeper's kitchen, so there will be no more talk about the one that got away.</p>"},{"name":"Sega Ages Volume 1","year":1997,"developer":"SEGA-AM2 Co., LTD.","url":"e#Sega%20Ages%20Volume%201%20%28Europe%29.zip","filesize":546448282,"score":7.8,"genres":"Compilation","desc":"<p>This compilation includes the following games:</p><ul><li>After Burner II</li><li>Outrun</li><li>Space Harrier</li></ul>"},{"name":"Sega Ages: Columns Arcade Collection","year":1997,"developer":"","url":"e#Sega%20Ages%20-%20Columns%20Arcade%20Collection%20%28Japan%29.zip","filesize":331091173,"score":"","genres":"Action > Compilation > Puzzle > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p>This compilation features four <em>Columns</em> titles:</p><ul><li>Columns</li><li>Columns II: The Voyage Through Time</li><li>Stack Columns</li><li>Columns 97</li></ul><p>All titles are available for the Saturn for the first time through this release.</p>"},{"name":"Sega Ages: Fantasy Zone","year":1997,"developer":"SEGA Enterprises Ltd.","url":"e#Sega%20Ages%20-%20Fantasy%20Zone%20%28Japan%29.zip","filesize":495552395,"score":7.3,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The Fantasy Zone is a solar system consisting of eight brightly colored, fantastic planets. The evil Menons are trying to take over all of the planets in the Fantasy Zone by using misappropriated foreign currency to build their forces. It is the player's job to recover all of the coins and save the solar system! </p><p><em>Fantasy Zone</em> is an arcade style shooter for one or two players. The goal is to destroy all of the creatures on each planet and collect as many of the lost coins as possible. At the end of each level is a large enemy that will have to be defeated before moving on to the next world. At various points in the game, the player will be able to find a parts shop, which allows purchasing improvements for his spaceship, including better weapons and faster engines.</p>"},{"name":"Sega Ages: Galaxy Force II","year":1998,"developer":"Sega R&D1","url":"e#Sega%20Ages%20-%20Galaxy%20Force%20II%20%28Japan%29.zip","filesize":189427124,"score":5.5,"genres":"Action > Behind view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Galaxy Force II</em> is an expanded version of Galaxy Force. It adds two additional levels, the old levels are revised (expanded and re-balanced) and the four missiles can be fired with a single button press.</p><p>You are strapped into a spaceship to take on six dangerous settings, ranging from a pleasant garden to hostile fire and tough ice. You will have to fly freely before cutting through tunnels and canyons, and finally destroying an alien base. Your energy read out starts at 1200 and decreases as shots hit you, or you make contact with a wall or blockage. You have infinite cannons and guided missiles to help you along. You can get regular energy recharges and power upgrades, by shooting and then collecting their carrier pods.</p>"},{"name":"Sega Ages: I Love Mickey Mouse - Fushigi no Oshiro Daibouken & I Love Donald Duck - Georgia Ou no Hihou","year":1998,"developer":"","url":"e#Sega%20Ages%20-%20I%20Love%20Mickey%20Mouse%20-%20Fushigi%20no%20Oshiro%20Daibouken%20%26%20I%20Love%20Donald%20Duck%20-%20Georgia%20Ou%20no%20Hihou%20%28Japan%29.zip","filesize":101398113,"score":"","genres":"Compilation","desc":"<p>This compilation includes the following games:</p><ul><li>Castle of Illusion Starring Mickey Mouse</li><li>QuackShot starring Donald Duck</li></ul>"},{"name":"Sega Ages: Memorial Selection Vol. 1","year":1997,"developer":"SEGA Enterprises Ltd.","url":"e#Sega%20Ages%20-%20Memorial%20Selection%20Vol.%201%20%28Japan%29.zip","filesize":301856507,"score":"","genres":"Compilation","desc":"<p>This compilation includes the following games:</p><ul><li>Flicky</li><li>Head On</li><li>Pengo</li><li>Up 'n down</li></ul>"},{"name":"Sega Ages: Memorial Selection Vol. 2","year":1997,"developer":"SEGA Enterprises Ltd.","url":"e#Sega%20Ages%20-%20Memorial%20Selection%20Vol.%202%20%28Japan%29.zip","filesize":45113039,"score":"","genres":"Compilation","desc":"<p>This compilation includes the following games:</p><ul><li>Penguin Land</li><li>Monaco GP</li><li>Samurai</li><li>The Ninja</li><li>Sindbad Mystery</li><li>Star Jacker</li></ul>"},{"name":"Sega Ages: OutRun","year":1996,"developer":"SEGA-AM2 Co., LTD.","url":"e#Sega%20Ages%20-%20OutRun%20%28Japan%29.zip","filesize":478984267,"score":7.4,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing","desc":"<p><em>OutRun</em> is a racing game that allows the player to race across varied terrain in a readily available Ferrari, complete with a female passenger, over a series of short tracks.</p><p>Gameplay is viewed from just above and behind the car. The roads are full of sharp bends and hazards, contact with which can cause the car to roll and lose the player's time. On each section of track there is a fork in the road, allowing the player to choose which direction he or she wishes to go in. The player has to to complete five track sections in total, out of the fifteen in the game.</p>"},{"name":"Sega Ages: Phantasy Star Collection","year":1998,"developer":"SEGA Corporation","url":"e#Sega%20Ages%20-%20Phantasy%20Star%20Collection%20%28Japan%29.zip","filesize":343070488,"score":7.6,"genres":"Compilation > Role-playing (RPG) > Top-down > Turn-based > Sci-fi / futuristic","desc":"<p>This compilation includes the following games:</p><ul><li>Phantasy Star</li><li>Phantasy Star II</li><li>Phantasy Star III: Generations of Doom</li></ul><p>The Saturn version contains Phantasy Star: The End of the Millennium as well.</p>"},{"name":"Sega Ages: Power Drift","year":1998,"developer":"SEGA-AM2 Co., LTD.","url":"e#Sega%20Ages%20-%20Power%20Drift%20%28Japan%29.zip","filesize":394084494,"score":7.6,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p>Ever wanted to race dune buggies at high speed on a variety of tracks? <em>Power Drift</em> is an arcade racer that gives you the chance to do just that.</p><p>There are 5 tracks to choose from, each with 5 stages. The stages range from cities, to deserts to tracks over water. There are also 12 drivers to pick from, from businessmen to skinheads and mohicans. </p><p>Your buggy has 2 gears, high and low. Once the light goes green, just keep the pedal to the metal. You’ll need to place third or higher to continue to the next stage. Be careful not to bump into other buggies or objects next to the road. While your buggy can take a pounding, crashing will slow you down. </p><p>Finish all 5 stages in a level and you’ll be presented with a bonus level.</p>"},{"name":"Sega Ages: Space Harrier","year":1995,"developer":"AM R&D Dept. #2","url":"e#Sega%20Ages%20-%20Space%20Harrier%20%28Japan%29%20%281M%29.zip","filesize":209618025,"score":7.1,"genres":"Action > Behind view > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>Run… fly… dodge those obstacles, but return fire on wave after wave of attacking aliens. Armed with a really big gun, you have to defend yourself against the alien hordes using your wits to navigate around the screen. But watch out for those end of level bosses!</p><p>Originating in the arcades, <em>Space Harrier</em> is a third-person rail shooter with pseudo-3D graphics, set in the same world as Fantasy Zone. The lone titular hero fights aliens with a fireball-launching cannon, which can also be used to transform the hero into a flying rocket. The protagonist is constantly in motion, but the speed of his movement can be regulated by the player.</p>"},{"name":"Sega Rally Championship (Made in EU)","year":1995,"developer":"Sega AM3 R&D Division","url":"e#Sega%20Rally%20Championship%20%28Europe%29%20%28Made%20in%20EU%29.zip","filesize":422210429,"score":8.3,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p>Sega Rally was a major success in the arcades, bringing rally-style racing to the masses before the Colin McRae games. Four detailed tracks have been created, with a succession of stomach-churning bends and jumps, and you can choose from 3 different cars. As well as the main championship, there is a time-trial mode featuring a ghost car to beat, so you always know how your run compares with your best-ever. Two machines can be linked for multi-player action. The handling of the cars is unrealistic, to put the focus on action and instant playability.</p>"},{"name":"Sega Saturn de Hakken!! Tamagocchi Park","year":1998,"developer":"Ancient Co. Ltd.","url":"e#Sega%20Saturn%20de%20Hakken%21%21%20Tamagocchi%20Park%20%28Japan%29.zip","filesize":5112357,"score":"","genres":"Simulation > Fixed / flip-screen > Anime / Manga > Real-time > Life / social simulation > Direct control > Multiple units/characters control > Point and select > Fantasy > Comedy > Healthcare > Licensed","desc":"<p><em>Sega Saturn de Hakken!!: Tamagotchi Park</em>  is a Tamagotchi game for the SEGA Saturn. The player can raise Tamagotchis. It is compatible with Saturn Backup Memory cartridge.The game features some SEGA characters, such as Sonic the Hedgehog as a Tamagotchi.</p>"},{"name":"Sega Touring Car Championship","year":1997,"developer":"Sega AM9 R&D Division","url":"e#Sega%20Touring%20Car%20Championship%20%28Europe%29.zip","filesize":468144302,"score":6.7,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>After <em>Virtua Racing</em>, <em>Daytona USA</em> and <em>Sega Rally</em>, yet another classic SEGA arcade racer (this time, from the Model 2C CRX architecture) is converted for home users. After open-wheel, stock and rally cars, Sega took on the popular European Touring Car races (factory models modified for racing), featuring four real models (Alfa Romeo 155V6TI, Toyota Supra GT, AMG Mercedes C-Class and Opel Calibra V6) as well as some hidden cars. Some models feature four-wheel drive (easier to control on sharper turns) while other only have rear-wheel drive (forcing the player to calculate turns properly so the car doesn't skid). Because of this, gameplay is notoriously tighter and less forgiving than in any of the previous titles by Sega. </p><p>Like with other Sega arcade ports, this home versions features both an \"Arcade\" and a \"PC\"/\"Saturn\" mode (the biggest difference being the time constraints and inability to use tweaked cars in arcade) with the usual Championship (three races in a row) and Time Attack modes, and a 2P split-screen race is also available. There are three tracks, plus one more as the final race (as usual with contemporary Sega arcade racers), and two viewpoints (behind and front bumper) are at the disposal of the player.As usual, there are additional modes, tracks and cars to be unlocked for those proficient in the game.</p><p>Another feature was the \"Global Ranking\" mode, where players of either version could e-mail Sega of Japan a password containing his times, and compare them to the World's finest players, as well as in special one-day only \"Global Net Events\".</p>"},{"name":"Sega Worldwide Soccer '98 - Club Edition","year":1997,"developer":"SIMS Co., Ltd.","url":"e#Sega%20Worldwide%20Soccer%20%2798%20-%20Club%20Edition%20%28Europe%29%20%28En%2CFr%2CEs%29.zip","filesize":335010103,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p><em>Sega Worldwide Soccer 98</em> picks up where its predecessor stopped, adding two new stadiums, new animations, faster gameplay, and the most important, club teams from England, Spain and France for a total of 60 teams adding to the 48 of the International mode. While the game still lacks a license (except the English league, that has real player and team names), the name editor is still present. In the commentary box, Gary Bloom is joined by former England international and 1966 World Cup winner Jack Charlton. </p><p>There are seven games modes: Friendly match, Club exhibition, Worldwide Cup, Club League, Cup Tournament and Penalty shootout.</p>"},{"name":"Sega Worldwide Soccer 97","year":1996,"developer":"Team Aquila","url":"e#Sega%20Worldwide%20Soccer%2097%20%28Europe%29.zip","filesize":495577857,"score":8.3,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p>Well, it's a soccer game made by Sega but with an arcade-like style of gameplay. So the handling is kept pretty straight-forward: one button for a shot towards the enemy goal (from any position on the field), one for passing to teammates and one for lobbing. But  simple doesn't mean limited since a couple of things are not explained in the manual and you'll have to figure them out yourself, which can take some time.You can choose between dozens of national teams from all over the world. Player names are made up since there's no Fifa license or anything but they're editable if you feel like correcting that. Game modes include Exhibition, Tournament, League or World Cup. You can play either versus the CPU, vs. up to 2 human players or even coop (2 humans vs. the CPU or other 2 humans).</p>"},{"name":"Segata Sanshirou - Shinken Yuugi","year":1998,"developer":"Ecole Software Corp.","url":"e#Segata%20Sanshirou%20-%20Shinken%20Yuugi%20%28Japan%29.zip","filesize":287374220,"score":"","genres":"Action > 3rd-person (Other) > Side view > Arcade > Platform > Puzzle elements","desc":"<p><em>Segata Sanshirō Shinkenyugi</em> is a game starring popular Segata Sanshiro, a fictional character created by Sega to advertise the Sega Saturn in Japan between the years 1997 and 1998. This game could be defined a miscellaneous, and much in the line with the WarioWare series (except for the multiplayer option, which this game does not have), where what we do is taking part in several mini games, all of them based in the TV adverts Segata Sanshiro protagonized. They will range from side-scrolling platformers to puzzles, button smashing or memory games, and if you finish them correctly, it would unlock the video clip of the commercials each mini game was based in. Also, radio advertisements and other hidden bonuses have been included.</p>"},{"name":"Seifuku Densetsu: Pretty Fighter X","year":1995,"developer":"Sol"},{"name":"Sentimental Graffiti (Disc 1)","year":1998,"developer":"NEC Interchannel, Ltd.","url":"e#Sentimental%20Graffiti%20%28Japan%29%20%28Disc%201%29%20%28Game%20Disc%29%20%281M%29.zip","filesize":514144068,"score":"","genres":"Simulation > 1st-person > Anime / Manga","desc":"<p>The protagonist of the game is a Japanese high school student, who was frequently transferred from school to school in various cities of Japan. During the summer holidays, he receives an anonymous letter, containing only one sentence: \"I want to meet you\". He decides to travel to all the cities where he attended high school, and resume the contact with the girls who could have sent him this letter. But which one did send it, and which one is going to be his true love?..</p><p><em>Sentimental Graffiti</em> is what is usually referred to as <em>dating simulation</em>. Instead of following a story, like in adventure games, the player makes choices that influence his relationships with the game's female characters, thus shaping his own story. </p><p>There are twelve cities to travel to, and twelve girls to have a relationship with. Compared to some other dating simulations (such as  Tokimeki Memorial games), the gameplay system in <em>Sentimental Graffiti</em> is rather simple, focusing on freedom of movement and choice rather than statistics. </p><p>The player can choose between various means of transportation (different kinds of train, plane, boat, etc.), and different locations within each city. The backgrounds are digitized photos of real locations in Japan, while the characters are hand-drawn anime style pictures.</p>"},{"name":"Sentimental Graffiti (Disc 2)","year":1998,"developer":"NEC Interchannel, Ltd.","url":"e#Sentimental%20Graffiti%20%28Japan%29%20%28Disc%202%29%20%28Second%20Window%29%20%281M%2C%202M%29.zip","filesize":492457530,"score":"","genres":"Simulation > 1st-person > Anime / Manga","desc":"<p>The protagonist of the game is a Japanese high school student, who was frequently transferred from school to school in various cities of Japan. During the summer holidays, he receives an anonymous letter, containing only one sentence: \"I want to meet you\". He decides to travel to all the cities where he attended high school, and resume the contact with the girls who could have sent him this letter. But which one did send it, and which one is going to be his true love?..</p><p><em>Sentimental Graffiti</em> is what is usually referred to as <em>dating simulation</em>. Instead of following a story, like in adventure games, the player makes choices that influence his relationships with the game's female characters, thus shaping his own story. </p><p>There are twelve cities to travel to, and twelve girls to have a relationship with. Compared to some other dating simulations (such as  Tokimeki Memorial games), the gameplay system in <em>Sentimental Graffiti</em> is rather simple, focusing on freedom of movement and choice rather than statistics. </p><p>The player can choose between various means of transportation (different kinds of train, plane, boat, etc.), and different locations within each city. The backgrounds are digitized photos of real locations in Japan, while the characters are hand-drawn anime style pictures.</p>"},{"name":"Sentimental Graffiti: First Window","year":1997,"developer":""},{"name":"Sexy Parodius","year":1996,"developer":"Konami Computer Entertainment Roppongi Co., Ltd.","url":"e#Sexy%20Parodius%20%28Japan%29.zip","filesize":312572382,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter > Fantasy > Comedy","desc":"<p><em>Sexy Parodius</em> is the fourth game in the series. As one of the members of Parodius Team, you must stop a lecherous octopus and his army from hoarding a huge treasure mound for their own no-good deeds. Featuring several classic Parodius cast members (including sexy bunny sisters Hikaru and Akane, Takosuke the Octopus, Koitsu the stickman), newcomers, and tons of classic Parodius scenes. Plus, there's a few \"extra\" surprises for those who love the trademark wackiness of the series.</p><p>This game was never released outside of Japan.</p>"},{"name":"Shanghai: Great Moments","year":1996,"developer":"Quicksilver Software, Inc.","url":"e#Shanghai%20-%20Great%20Moments%20%28Japan%29%20%282M%29.zip","filesize":309985438,"score":7.2,"genres":"Puzzle > Top-down > Fixed / flip-screen > Real-time > Cards / tiles > Tile matching puzzle","desc":"<p>Shanghai is a puzzle game using MahJongg tiles where you slide available matching tiles off the stack to reveal more tiles.　Slide all 144 tiles off the board and you win the game.</p><p>This game includes four versions of the classic Shanghai game: The Great Wall (Shanghai meets Tetris), Beijing (slide rows to make matches), Action Shanghai (clear tiles quickly before more appear), and Classic Shanghai (either regular or face down for an extra challenge).</p>"},{"name":"Shanghai: Triple-Threat","year":1995,"developer":"Success Corp.","url":"e#Shanghai%20-%20Triple-Threat%20%28USA%29.zip","filesize":4434641,"score":8.2,"genres":"Puzzle > Top-down > Turn-based > Cards / tiles > Falling block puzzle > Direct control","desc":"<p>Another version of the ancient game of Mah-Jong. The player is presented with an arrangement of tiles, lined up together and stacked, with either 2 or 4 of each of an array of patterns. These must be removed by matching pairs, but only tiles that are visible and have a space to the left or right can be removed.</p><p>This release in the Activision's Shanghai series includes three games along with the <em>Classic Shanghai</em>. In <em>The Great Wall</em>, the tiles are stacked vertically, and fall when lower tiles are removed, a lá Tetris. In <em>Beijing</em>, gaps are created to slide groups of tiles along. <em>The Golden Tile</em> sees two players attempt to clear a set layout at once. The Triple-theme continues with three game modes: Solitaire, 2-player \"Pandamonium\", and Arcade. Three themed tile sets complete the \"Triple Threat\".</p>"},{"name":"She'sn","year":1998,"developer":"Gaibrain","url":"e#She%27sn%20%28Japan%29.zip","filesize":168693501,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Romance","desc":"<p><em>She'sn</em> (aka \"season\") is a visual novel love adventure game which focuses on a four different stories through all four seasons. The player can select to play the story of any season in any order. Different season also features different heroines and different love stories to play through. The spring story revolves around a forbidden love with your sister-in-law. The summer season tells the love story with your childhood friend. Love story in the fall is about the school romance. And the winter season is a sad love story between the protagonist and a girl with an incurable disease.</p>"},{"name":"Shellshock","year":1996,"developer":"Core Design Ltd.","url":"e#Shellshock%20%28Germany%29.zip","filesize":522366651,"score":6.4,"genres":"Action > Racing / Driving > 1st-person > Tank","desc":"<p>Da Wardenz, an anti-terrorist tank force, is called in whenever there is trouble somewhere in the world. You are a rookie hired by the tank force and must prove yourself in 25 increasingly difficult missions.</p><p>'The Pen' is Da Wardenz' headquarters. It has all sorts of locations including the main hangar, basketball court, simulation room, workshop area, briefing room and various lockers (used for loading and saving missions). Before a mission, you can explore the headquarters and interact with each member of the team; you may learn something.</p><p>When you start a mission, the action is viewed from a first-person perspective. It has you controlling the M-13 Predator, a highly sophisticated and upgradable tank. The game is arcade-oriented and has much more in common with 'Quarantine' and 'Doom' than serious counterparts like 'M1 Tank Platoon'.Your tank has unlimited bullets, can sustain heavy damage and can destroy enemies but also trees and buildings.</p><p>When a mission is successfully completed you earn cash which you can spend on repairing your tank and extra upgrades.</p>"},{"name":"Shienryuu","year":1997,"developer":"Warashi Inc.","url":"e#Shienryuu%20%28Japan%29.zip","filesize":37657067,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Caravans are colony ships that venture into deep space in search of Earth-like planets. Eventually, Caravan 7861 discovered a a suitable planet in another star system. Nearly a hundred years later, the new mother planet became overrun by aliens under the command of the mysterious Shienryu. Fortresses were built with the goal of preventing any human development. Eventually, a special team called Burn Dragoon was established, comprising the best pilots who had to use all their skills against the alien threat.</p><p><em>Shienryu</em> is a vertically scrolling shoot-em-up. The player-controlled ship starts with the default vulcan gun, which can be later switches to laser beam or missiles. Power-ups include weapon upgrades, speed enhancement (up to three times), bombs that can be used alongside the main weapons (up to twenty), temporary invulnerability, firepower and speed boost, and various items that increase the player's points.</p>"},{"name":"Shin Megami Tensei: Devil Summoner","year":1995,"developer":"Atlus Co., Ltd.","url":"e#Shin%20Megami%20Tensei%20-%20Devil%20Summoner%20%28Japan%29%20%28Rev%20B%29.zip","filesize":301683073,"score":"","genres":"Role-playing (RPG) > 1st-person > Turn-based > Cyberpunk / dark sci-fi","desc":"<p>A modern-day Japanese college student is about to go on a date with his girlfriend Kumiko, who has found a particularly interesting book about ancient Japanese history in the local library. On the way to the date the young man is attacked by demonic creatures and saved by the devil summoner Kyōji Kuzunoha. Shortly thereafter, Kumiko is kidnapped by a mysterious man named Sid Davis, who hunts her boyfriend down and kills him. It appears that Kyōji was killed as well, but the student's soul is miraculously transferred into his body. Taking Kyōji's identity, the young man must now fill his place as a devil summoner, liberating the city from demons and locating Sid Davis in an attempt to rescue Kumiko.</p><p><em>Devil Summoner</em> continues the tradition of Megami Tensei games, being a role-playing game with a heavy emphasis on dungeon crawling and communication with randomly encountered enemies. Unlike the main Shin Megami Tensei series, the game is set entirely in modern-day Japan. The player navigates the protagonist on an overhead city map, while individual locations are maze-like 3D dungeons explored from a first-person perspective. For the most part the player controls the main protagonist and his associate Rei, while the other four available slots of an active party can be occupied by summoned demons.</p><p>Both human characters can use either swords or guns in battles, their efficiency depending on the particular enemy's weaknesses. Weapons as well as ammunition for guns can be bought in shops. Rei and many demons can also cast a variety of offensive, supportive, and healing magic spells. First-person combat is turn-based, with player-controlled characters positioned in two rows, which affects their attack and defense values. When the hero and Rei level up the player must manually raise their parameters, further customizing their combat performance.</p><p>The player can avoid fighting randomly appearing enemies by opting to have a conversation with them. These conversations are more complex than in <em>Shin Megami Tensei</em> games, featuring a wider selection of dialogue choices. They may result in the demon joining the party or exchanging items, and their outcome depends on the demon's personality type and current moon phase as well. Demons consume a type of energy known as magnetite when summoned, which is gained from defeating enemies and can be exchanged for money and vice versa. Two or three demons can be fused in special locations to create more powerful ones. </p><p>In addition, the game introduces a \"loyalty\" system: newly recruited demons have various degrees of loyalty, and might even disobey the player's orders in battles if their loyalty level is too low. Loyalty can be increased through various means, depending on the personality of the demon. Most demons would gradually become loyal when repeatedly summoned and taken to fight enemies.</p>"},{"name":"Shin Megami Tensei: Devil Summoner Special Box","year":1996,"developer":"Atlus Co., Ltd."},{"name":"Shingata Kururin Pa!","year":1996,"developer":"Sky Think Systems Co. Ltd."},{"name":"Shining Force III","year":1997,"developer":"Sonic Co.","url":"e#Shining%20Force%20III%20%28Europe%29.zip","filesize":173059141,"score":8.1,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Isometric > Turn-based > Fantasy","desc":"<p>Set in a world of fantasy and magic, Shining Force III places you in the boots of a young general, fighting to preserve the peace in your world. The story starts out as the Emperor is abducted from within the city of Saraband, and you must go on the run with your king, who is suspected of being the mastermind behind the abduction. Of course, things are not as they seem, and you will be taken through a web of lies and deceit in your quest to prove the King innocent.</p><p>The game is very similar in style to the earlier Shining Force titles, so anyone who's played them will be comfortable with the game, though likely they'll also be happy to find the game graphically overhauled, with a 3-D landscape and 3D characters during the battle animations. As ever the main game is controlled like a traditional RPG, with you controlling the main character, talking to NPC's and searching various items. However, the main selling point of the Shining Force series has always been its battle sequences. </p><p>The combat system is amended from the earlier titles, with a new and unique \"friendship\" system, whereby the more two characters work together (helping each other out, healing each other etc.) the closer they bond, and they will start to give each other bonuses on the battlefield. Other traditional features, such as the rock-paper-scissors nature of the weapons (sword beats axe, axe beats spear, spear beats sword etc.) and the terrain effects (someone hiding in a forest is going to get better protection than someone on an open road) remain fully intact, and anyone who's played the earlier titles in the series will likely be very comfortable with the combat system.</p><p>It should be noted that this is actually the western conversion of Shining Force III: Episode I, and was therefore only the first episode in an intended series of three. Unfortunately the other two titles were never released outside of Japan, so most western gamers were only able to experience a third of the storyline.</p>"},{"name":"Shining Force III: Scenario 2 - Nerawareta Miko","year":1998,"developer":"Camelot Software Planning","url":"e#Shining%20Force%20III%20-%20Scenario%202%20-%20Nerawareta%20Miko%20%28Japan%29.zip","filesize":220492194,"score":7.8,"genres":"Role-playing (RPG) > 3rd-person (Other) > Turn-based > Fantasy","desc":"<p>This is the second in the three scenarios of the Shining Force 3 series. The story continues with the adventure of the Empire youngest prince Medion.  A game for those who like strategy RPG.</p>"},{"name":"Shining Force III: Scenario 3 - Hyouheki no Jashinguu","year":1998,"developer":"Camelot Software Planning","url":"e#Shining%20Force%20III%20-%20Scenario%203%20-%20Hyouheki%20no%20Jashinguu%20%28Japan%29.zip","filesize":362861264,"score":"","genres":"Role-playing (RPG) > Isometric > Turn-based > Fantasy","desc":"<p>This is the third and final game from the Shining Force III trilogy. In it, you take the role of a young mercenary called Julian accompanying a mysterious boy called Gracia, trying to bring peace to the world. It follows on in exactly the same strategical RPG vein as the previous games in the series. </p><p>During the game, the plot from the previous two scenarios is unraveled and in the final chapter, all 3 forces join together to fight the final battle against an Evil god trying to rise again.</p>"},{"name":"Shining the Holy Ark","year":1996,"developer":"Sonic Co.","url":"e#Shining%20the%20Holy%20Ark%20%28Europe%29.zip","filesize":189717182,"score":7.8,"genres":"Role-playing (RPG) > 1st-person > Anime / Manga > Turn-based > Fantasy","desc":"<p>Part of the <em>Shining</em> game universe, <em>Shining the Holy Ark</em> is a pure console-style RPG (unlike  Shining Force games, that were strategy/RPG hybrids). You play the role of a young swordsman Arthur, who decided to work as a mercenary for various people needing his services. On his first mission, the King of Enrich sends him to a mine, in order to find and punish a renegade ninja who has escaped from him. However, an accident occurs that makes Arthur realize that he'll have to do much more than his usual mercenary assignment, and that there is a true evil in the world that must be defeated at all costs.</p><p>The game features 3D graphics and utilizes first-person perspective for dungeons and battles. The turn-based battles are of a traditional Japanese RPG kind, except the addition of \"Pixie System\". In various places in the game you can find pixies who can later be used as allies in battles.</p>"},{"name":"Shining Wisdom","year":1995,"developer":"Sonic Co.","url":"e#Shining%20Wisdom%20%28Europe%29.zip","filesize":51108027,"score":7.2,"genres":"Action > Top-down > Puzzle elements > Fantasy","desc":"<p>Several years after the events described in Shining Force II, an orphan named Mars begins his work as a guard in the Odegon castle. One night, a strange fog descends upon the land, and Mars witnesses a mysterious elf entering the Ancient Shrine. Through a series of events and lies on his part, Mars becomes the elite guard of the princess, and soon has to redeem himself by stopping the dark elf Pazort from destroying the world.</p><p><em>Shining Wisdom</em> is the fourth game in the Shining series, but is completely different from the others. Neither a turn-based dungeon crawl like Shining in the Darkness, or a tactical RPG like Shining Force, the game plays very similarly to Zelda with its overhead exploration, action combat and occasional puzzle-solving. RPG elements are very light; the protagonist's health can be increased by finding HP bubbles, but there is no experience system of any kind. The game proceeds by collecting various items found in dungeons and then combining them with magical orbs to create different spell effects that can be used to tackle enemies and solve the riddles that must be bested to beat each labyrinth.</p>"},{"name":"Shinobi-X: Shin Shinobi Den","year":1995,"developer":"Sega AM7 R&D Division","url":"e#Shinobi-X%20-%20Shin%20Shinobi%20Den%20%28Europe%29.zip","filesize":444086013,"score":7.7,"genres":"Action > Side view > 2D scrolling > Arcade","desc":"<p>A ninjitsu master trains three children: two brothers, Kazuma and Sho, and his own daughter Aya. As they grow up, the oldest boy, Kazuma, becomes obsessed with power and demands to learn the sacred techniques of absolute power. The master refuses, and Kazuma leaves, vowing revenge.</p><p>Many years later, long after the master's death, Kazuma returns with an army. He plots his revenge by kidnapping Aya and thus luring Sho into his hideout. As Sho, you must defeat Kazuma and rescue Aya.</p><p><em>Shinobi Legions</em> is a side-scrolling action game, similar to Shinobi III. Sho's primary weapons are a sword and a finite number of shurikens, both of which are activated with separate buttons. Sho can learn nearly a dozen sword abilities (spinning slash, downward slash, sword shielding, etc.) by collecting powerups scattered throughout levels. There are also \"Fire Dragon\" powerups that act as single use ninja magic attacks that damage all enemies onscreen, which is the only ninja magic available to Sho. The 9 levels range from fighting in the jungle to climbing Mount Fuji, where Sho will encounter mostly enemy ninjas and a few animal enemies (eagles, snakes, etc.). <em>Shinobi Legions</em> is the only Shinobi game for the Saturn and is notable for its use of live-action cutscenes and its use of blood (the first in the series).</p>"},{"name":"Shinpi no Sekai: El-Hazard for Sega Saturn","year":1996,"developer":"TamTam Co., Ltd."},{"name":"Shinpi no Sekai: El-Hazard for Sega Saturn (Shokai)","year":1996,"developer":""},{"name":"Shinrei Jusatsushi Taroumaru","year":1997,"developer":"K.K. Time Warner Interactive","url":"e#Shinrei%20Jusatsushi%20Taroumaru%20%28Japan%29.zip","filesize":481097255,"score":7.2,"genres":"Action > Side view > Arcade > Shooter > Fantasy","desc":"<p>Psychic ninja Taroumaru and his partner Enkai set off to vanquish the supernatural forces that threaten the Japanese countryside. You must battle through several stages of side-scrolling action set in feudal Japan, dealing with all sorts of undead horrors and saving villages from rampaging demons.</p><p>Your weapons are your psychic powers, which allow you to lock onto enemies and channel energy bolts to destroy them. You can power-up your basic attack with collectible power-ups and you can also take psychic control of several weaker enemies to watch your back while you fight, grapple, jump and climb through the stages.</p><p>Graphics are 2D with polygonal elements used for some background elements. Supports up to two player cooperative gameplay.</p>"},{"name":"Shinsetsu Samurai Spirits - Bushidou Retsuden","year":1997,"developer":"SNK Corporation","url":"e#Shinsetsu%20Samurai%20Spirits%20-%20Bushidou%20Retsuden%20%28Japan%29.zip","filesize":294840708,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Side view > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p><em>Shinsetsu Samurai Spirits: Bushidōretsuden</em> (unofficially known in the Western world as <em>Samurai Shodown RPG</em>) is a Japanese-style role-playing game based on the <em>Samurai Shodown</em> universe. The player has to explore the world, find items, participate in battles, and acquire accessories that will contribute to his success.</p><p>The player can start the adventure as any of the six personages that are available (Haohmaru, Nakoruru, Genjuro Kibagami, Galford D. Weller, Ukyo Tachibana and Cham Cham). The main line of the argument does not diverge much depending on the player's choice; the differences will be more noticeable in the dialogues or the appearance of some character-focused scenes thorough the game.</p><p>The fighting mode is fairly different from those found in most other Japanese-style RPGs: the moves are executed by pressing the same button combinations as in the arcade fighting games.</p>"},{"name":"Shippuu Mahou Daisakusen - Kingdom Grandprix","year":1996,"developer":"Raizing Co., Ltd.","url":"e#Shippuu%20Mahou%20Daisakusen%20-%20Kingdom%20Grandprix%20%28Japan%29.zip","filesize":465055980,"score":"","genres":"Action > Racing / Driving > Top-down > 2D scrolling > Arcade > Shooter > Fantasy > Sci-fi / futuristic","desc":"<p>Kingdom Grandprix is a 2D arcade shooter and racing combination - a continuation of Sorcer Striker. The game has many fantasy creatures and futuristic vehicles.The player chooses 1 of 8 characters - all others are rivals in the race. Player moves faster holding down the fire button (but then he is defenseless), and by getting closer to the top end of the screen. Beside this, the game is a typical vertical-scrolling shooter - player flies forward, shoots enemies and bosses, and collects various power-ups, like extra bombs, homing bullets, or more power to fire the gun. The game has twelve stages, but is non-linear - after completing each level, the player chooses one of the two levels.</p>"},{"name":"Shockwave Assault","year":1996,"developer":"Electronic Arts, Inc.","url":"e#Shockwave%20Assault%20%28Europe%29.zip","filesize":551364798,"score":6.5,"genres":"Action > Compilation > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>Shockwave Assault combines Shock Wave and its expansion Operation Jumpgate and makes them available for systems other than the 3DO for the first time.</p><p>In Shock Wave, the player takes the role of a rookie pilot, defending the Earth from an alien invasion. From the cockpit of the F-177 fighter, one shoots at the alien walkers and fighters with lasers and missiles, rearming and refueling at supply depots when necessary. The story is told with live-action cutscenes.</p><p>Operation Jumpgate continues the story with several further missions, set around the solar system.</p>"},{"name":"Shoujo Kakumei Utena: Itsuka Kakumei Sareru Monogatari (Disc 1)","year":1998,"developer":"Sega CS1","url":"e#Shoujo%20Kakumei%20Utena%20-%20Itsuka%20Kakumei%20Sareru%20Monogatari%20%28Japan%29%20%28Disc%201%29.zip","filesize":397705327,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Turn-based > Visual novel > Menu structures > Contemporary > Fantasy > Romance","desc":"<p>When a high school girl gets a sudden transfer to the prestigious boarding school her parents went to, she expects her life has nowhere to go but up. She's immediately thrust into the school's complicated political dynamics, where she has to ask herself: who is that strange, menacing girl who keeps showing up? What is this student council that seems to rule the school from the shadows? Why does someone seem to have it in for her? And why does it feel like there's something about their past her parents aren't telling her?</p><p>Based on the classic anime <em>Revolutionary Girl Utena</em>, this game lets the player experience surreal school life at Ohtori Academy. Instead of having the player take control of one of the show's characters, the game's protagonist is a brand-new character meeting the cast for the first time. Players can make alliances (and enemies) as they interact with characters and settle in; the story branches based on how characters feel about the protagonist, with nine possible endings and an enormous number of branching story paths. A page in the player's student handbook shows the player how every one of the main cast feels about her, letting the player be strategic with the route they take through the game.</p><p><em>Utena</em> captures the show's aesthetic with art and music taken directly from the show alongside new artwork, cutscenes and music which match the original show's presentation. All dialogue is fully voice-acted with the original actors from the show reprising their roles, alongside new actors playing the game's original characters.</p>"},{"name":"Shoujo Kakumei Utena: Itsuka Kakumei Sareru Monogatari (Disc 2)","year":1998,"developer":"Sega CS1","url":"e#Shoujo%20Kakumei%20Utena%20-%20Itsuka%20Kakumei%20Sareru%20Monogatari%20%28Japan%29%20%28Disc%202%29.zip","filesize":473102456,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Turn-based > Visual novel > Menu structures > Contemporary > Fantasy > Romance","desc":"<p>When a high school girl gets a sudden transfer to the prestigious boarding school her parents went to, she expects her life has nowhere to go but up. She's immediately thrust into the school's complicated political dynamics, where she has to ask herself: who is that strange, menacing girl who keeps showing up? What is this student council that seems to rule the school from the shadows? Why does someone seem to have it in for her? And why does it feel like there's something about their past her parents aren't telling her?</p><p>Based on the classic anime <em>Revolutionary Girl Utena</em>, this game lets the player experience surreal school life at Ohtori Academy. Instead of having the player take control of one of the show's characters, the game's protagonist is a brand-new character meeting the cast for the first time. Players can make alliances (and enemies) as they interact with characters and settle in; the story branches based on how characters feel about the protagonist, with nine possible endings and an enormous number of branching story paths. A page in the player's student handbook shows the player how every one of the main cast feels about her, letting the player be strategic with the route they take through the game.</p><p><em>Utena</em> captures the show's aesthetic with art and music taken directly from the show alongside new artwork, cutscenes and music which match the original show's presentation. All dialogue is fully voice-acted with the original actors from the show reprising their roles, alongside new actors playing the game's original characters.</p>"},{"name":"Sid Meier's Civilization: Shin Sekai Shichidai Bunmei","year":1997,"developer":"MicroProse Software, Inc.","url":"e#Sid%20Meier%27s%20Civilization%20-%20Shin%20Sekai%20Shichidai%20Bunmei%20%28Japan%29.zip","filesize":65017750,"score":8,"genres":"Strategy > Top-down > Isometric > Turn-based > 4X > Managerial / business simulation > Turn-based strategy > Multiple units/characters control","desc":"<p><em>Civilization</em> has the widest scope of any strategy game of its time. You are a leader of a nation. You begin in the Stone Age, and complete the game in the XXIth century (unless your civilization gets destroyed earlier). Your eventual goal is to become the dominant civilization in the world, either by wiping out everybody else, or being the first to get a space ship to Alpha Centauri.</p><p>As the nation's leader, you have many responsibilities. You have to build cities, and then micromanage them, constructing various buildings. Most of people in your cities will be working on the neighbouring lands to get food (without it, your city won't survive or grow), production (used to build military units and buildings) and trade (which can be exchanged for money, science (see below) or luxuries that make people happy. You decide how much trade you want to invest into each of these areas.) You have to make sure that your people are in a good mood; if they get too unhappy, the city will collapse into disorder, and won't produce anything until you fix the situation. </p><p>If you're ambitious, you can build Wonders of the World - epic constructions, such as the Pyramids or the Hoover Dam. Each Wonder is an unique thing, and only one of each can exist in the world. They give you a lot of benefits if you complete them, but they take a long time to build, and many of them will eventually stop working. </p><p>There are other nations in the world, and there are also barbarians, so you'll have to invest into the military to protect yourself and to attack. Sure, you can sign peace treaties with other nations, and even exchange scientific knowledge with them (although sometimes they'll demand tribute from you), but eventually you'll probably have to fight. You control each of your military units on the world map, attacking your opponents' units and cities (possibly taking over them). </p><p>Not all units are for combat though. Settlers are used to build cities, create roads (for easier travel of your units) and improve the land around cities, increasing production. Diplomats can be sent to foreign cities to negotiate with the other nations or create embassies, but they can also bribe enemy units to join you and conduct espionage and sabotage in the enemies' cities. Caravans can be sent to faraway cities to increase trade in their home city, and they can also help in building Wonders of the World. </p><p>Scientific progress is an important part of the game. The more science your cities produce, the faster you research new technologies. Initially, you'll be finding out about the wonders of Alphabet or Bronze Working, but late in the game you'll be researching Computers and Robotics. Most technologies give you some new units, buildings and other things, although some have more interesting effects - for example, after inventing the Automobile, you'll find out that your citizens started producing pollution. Pollution is a bad thing; if there's too much of it, global warming may occur. </p><p>How your cities prosper depends partially on the type of government that your nation has. Initially you're living in Despotism, but this can stunt growth of your civilization, so it's a good idea to switch to something else - Monarchy, Republic, Democracy or Communism.</p>"},{"name":"Side Pocket 3 - 3D Polygon Billiard Game","year":1997,"developer":"Data East Corporation","url":"e#Side%20Pocket%203%20-%203D%20Polygon%20Billiard%20Game%20%28Japan%29.zip","filesize":403510040,"score":"","genres":"Sports > 1st-person > Pool / snooker","desc":"<p><em>Side Pocket 3</em> is a pool/billiard game with 3D graphics, full voice-acting and a playable music on a hi-fi starting from track 2.</p><p>The game includes:</p><ul><li>Story Mode - two different stories available with set of different characters to talk to and play against</li><li>Versus Mode - contains 11 games (8-ball, 9-ball, 3-ball, Rotation, Pocket Game, etc.) against computer or human players</li><li>Trick Mode - contains both game and editor for various trick shots</li><li>Training Mode - includes Pocket and Carom training modes where player's performance gets rated</li></ul>"},{"name":"Silhouette Mirage","year":1997,"developer":"Treasure Co., Ltd.","url":"e#Silhouette%20Mirage%20%28Japan%29.zip","filesize":526400571,"score":7,"genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Shooter > Sci-fi / futuristic > Regional differences","desc":"<p>Following genetic experiments conducted by a group of scientists at the turn of the millennium, a biological explosion contaminated the genetic structure of life on Earth. Two attributes emerged from the ruins, known as Silhouette and Mirage; like Yin and Yang, they cannot exist without each other, but are fundamentally opposed in their nature and ideology. Only a Messenger, one who contains both attributes in a balance, is able to get to the Edo facility and reverse back the genetic disaster, destroying both Silhouette and Mirage. This messenger is a young girl named Shyna Nera Shyna.</p><p><em>Silhouette Mirage</em> is a side-scrolling action game. The basic gameplay is somewhat similar to that of Gunstar Heroes. The game's standout feature is the concept of the two attributes. Depending on the enemy's attributes and the type of attack used by Shyna, damage can be increased, and spirit (equivalent to magic power) can be absorbed from enemies. Shyna can dash, jump, crouch, slide, and grab enemies, executing combo attacks. It is also possible to master moves, acquire money, and purchase special creatures called \"parasites\", which teach Shyna various types of attacks.</p>"},{"name":"SimCity 2000","year":1995,"developer":"Maxis Software Inc.","url":"e#SimCity%202000%20%28Europe%29.zip","filesize":98194534,"score":7.7,"genres":"Simulation > Strategy > Diagonal-down > Free-roaming camera > Isometric > Real-time > City building / construction simulation > Managerial / business simulation > Point and select > Contemporary","desc":"<p><em>SimCity 2000</em> is the successor to the city simulation game Sim City. You are once again the mayor, but this time you can fully customize the terrain before building your city. The graphics are isometric, whereas the original had graphics displayed in a top-down fashion.</p><p>This title adds numerous features over the original such as the ability of building \"light\" zones, subways, hospitals, colleges, zoos, and arcos which are actually cities in cities. You can now give names to places, and your city is surrounded by neighboring towns with which you can trade goods. Finally, instead of the poll in the first game, you now have the option of reading several newspapers to get an idea of your progress.</p>"},{"name":"Simulation RPG Tsukuru","year":1998,"developer":"Pegasus Japan Corp.","url":"e#Simulation%20RPG%20Tsukuru%20%28Japan%29.zip","filesize":25847323,"score":"","genres":"Role-playing (RPG) > Strategy > Top-down > Anime / Manga > Turn-based","desc":"<p><em>Simulation RPG Tsukuru</em> is, much akin to its brethren in the RPG Maker line of games, a construction kit and editor to make RPGs. In this case, it's \"simulation\" RPGs or, as they're more commonly known, tactical/strategy RPGs in the vein of Fire Emblem and Shining Force.</p><p>The construction kit gives the player a menu based interface where it's possible to change almost every detail of the game being made, down to the character sprites, background music and individual statistics for each character.</p>"},{"name":"Skeleton Warriors","year":1996,"developer":"Neversoft Entertainment, Inc.","url":"e#Skeleton%20Warriors%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":242849810,"score":6.8,"genres":"Action > 3rd-person (Other) > Side view > Platform > Fantasy","desc":"<p>You're Prince Lightstar, with the quest to conquer and slay Baron Dark, who holds the half of a mighty crystal called the Lightstar Crystal. With that crystal he can change anyone with an evil heart into his skeleton slave.</p><p>The game is a 2D sidescrolling platform game with 3D pre-rendered graphics, with about 100 types of enemies for you to slay with the weapons you possess. You need to complete 21 levels filled with demonic evil creatures before you can fight the Baron Dark himself, with 3D rendered cutscenes inbetween some levels.</p>"},{"name":"Skull Fang: Kuuga Gaiden","year":1997,"developer":"Data East Corporation","url":"e#Skull%20Fang%20-%20Kuuga%20Gaiden%20%28Japan%29.zip","filesize":423193754,"score":"","genres":"Action > Top-down > 2D scrolling > Shooter > Direct control > Flight / aviation","desc":"<p><em>Skull Fang</em> is a vertical shoot'em up and the third entry in the <em>Kuuga</em> series. It takes place 40 years after the events of the previous installment, Wolf Fang. Players control one of four different fighter jets in a mission to destroy the Ragnarok terrorist organization, which plots to take over the world using its army of mechs. Power-ups can be collected by destroying certain enemy types, including laser cannons, homing missiles, machine guns, and spread shots. Players can also pick up a weapon attachment known as an S-Unit, which can be fired towards enemies as a homing attack and can be detonated to help clear out enemy formations. Stages conclude in a boss that must be defeated; in these fights, bosses will often leave the screen and players can use a mechanic named Skyeyes to see how far the boss is from them.</p>"},{"name":"Sky Target","year":1997,"developer":"Sega AM1 R&D Division","url":"e#Sky%20Target%20%28Europe%29.zip","filesize":516078300,"score":6.6,"genres":"Action > Behind view > Arcade > Shooter > Flight / aviation > Vehicular combat","desc":"<p>Another 3rd person perspective arcade flight sim by Sega, similar to their classic  After Burner in gameplay but featuring new gameplay mechanics and an entirely polygonal engine.</p><p>As in most games of it's type your objective is to clear a number of stages by shooting anything that moves, but at the end of each stage you can select where to go next thanks to branching paths a-la  Darius, which coupled with 4 different planes to select give the game an increased gameplay value. No multiple lives are given, but you get a life bar (which can be replenished in-flight) to help you outlast your enemies.</p>"},{"name":"Slam 'n Jam '96 featuring Magic & Kareem (Signature Edition)","year":1996,"developer":"Left Field Productions, Inc.","url":"e#Slam%20%27n%20Jam%20%2796%20featuring%20Magic%20%26%20Kareem%20-%20Signature%20Edition%20%28Europe%29.zip","filesize":105470058,"score":6.4,"genres":"Sports > Behind view > Basketball > Licensed","desc":"<p>A fast paced 5-on-5 basketball game very similar to the Run and Gun series from Konami. This game features no real NBA license but two real legends: Earvin \"Magic\" Johnson and Kareem Abdul-Jabbar. There are player stats and skills for each player which are modeled to be similar to their actual NBA counterparts. Features exhibition, season and playoff modes.</p>"},{"name":"Slam Dunk: I Love Basketball","year":1995,"developer":"BEC Co., Ltd."},{"name":"Slayers Royal","year":1997,"developer":"Onion Egg","url":"e#Slayers%20Royal%20%28Japan%29.zip","filesize":345238361,"score":"","genres":"Strategy > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy > Licensed","desc":"<p>Lina, Gourry, and Naga are barely together for a day before finding themselves yet again as the only thing standing in the way of world-wide cataclysm. It's up to them, as well as many returning friends, to save to world, or what will be left of it anyways.</p><p>Gameplay in <em>Slayers Royal</em> takes place in a mixture of 2D town screens and 3D turn based battle arenas. In towns you can move between multiple areas as well as look at objects and people to examine or talk to them. Lina will often get into (occasionally voiced) conversations with her companions, and in most conversations choices can come up that determine if the party receives stat upgrades or money. In battle each character in the party can be controlled either manually, or left up to an automated AI. Most characters can use magic, but each spell has a wait time that prevents a character from casting more magic until enough turns have passed. Characters do not gain strength or money from battle, instead strength is determined by how rested and full the stomachs of the characters are before combat.</p>"},{"name":"Slayers Royal 2","year":1998,"developer":"Onion Egg","url":"e#Slayers%20Royal%202%20%28Japan%29%20%281M%2C%202M%29.zip","filesize":317006634,"score":"","genres":"Strategy > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy > Licensed","desc":"<p>That didn't take long. Only a few months after the events of Slayers Royal and already Lina, Gourry, and an even larger cast of characters will have to save the world yet again. If they don't all kill each other first, of course.</p><p><em>Slayers Royal 2</em> plays similarly to the first game, but with several tweaks. You can no longer look at any object on a town screen, but there is now an event button that will automatically talk to anyone on the screen you're able to talk to. The passage of days from the first game has been expanded to include five times of day, and some events only happen at specific times. In combat the automatic turn system from the first game has been replaced with a more traditional one turn at a time. Terrain now has variable height, and can be raised or lowered with specific spells. Finally a spell's wait time is now reflected in the time it takes a character to cast a spell, making it possible to avoid a spell or attack a caster to prevent the spell from finishing.</p>"},{"name":"Snatcher","year":1996,"developer":"Konami Co., Ltd.","url":"e#Snatcher%20%28Japan%29.zip","filesize":492186555,"score":8,"genres":"Adventure > 1st-person > Anime / Manga > Japanese-style adventure > Quick Time Events (QTEs) > Shooter > Cyberpunk / dark sci-fi > Detective / mystery","desc":"<p><em>Snatcher</em> is set in the futuristic Neo Kobe City, a city of madness and decadence. The year is 2047 (or 2042, according to the original Japanese version). Mankind is facing its gravest crisis. A mysterious bio-roid life form has appeared. Its true nature and purpose are unknown. Is it some country's secret weapon, or an alien from another world? They appear in the winter, killing people and taking their place in society. They wear artificial skin and can sweat and even bleed. They are called \"Snatchers\" because they \"snatch\" their victims before they take their place.</p><p>A new police force, specifically trained to fight the Snatchers, has been formed. They are JUNKERs (which is deciphered as \"Japanese Undercover Neuro-Kinetic Elimination Rangers\" in the English version). Every time you encounter someone, a difficult question must be asked — is it a person or a snatcher? </p><p>The player takes control of Gillian Seed, one of the JUNKERs. The gameplay largely follows the structure of a Japanese-style adventure. The player uses a menu-driven interface to execute commands, which include moving between locations and interacting with the environment. Typically, every room contains objects that can be examined, leading to text descriptions and comments. Conversations occupy a large portion of the gameplay, with various topics available and a wealth of information about the game's world and characters. A few parts contain light puzzle-solving elements, though as a rule the game is almost completely devoid of puzzles.</p><p>During key moments of the narrative, the player will be prompted to participate in intense shooting sequences. The goal is usually to kill all the enemies that pop out on the screen before they are able to kill Gillian. Some of such sequences are timed, i.e. the player is required to quickly shoot before another events is triggered, leading to the protagonist's death.</p>"},{"name":"Soeldnerschild","year":1997,"developer":"KOEI Co., Ltd.","url":"e#Soeldnerschild%20%28Japan%29.zip","filesize":105303264,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > Isometric > Anime / Manga > Turn-based > Fantasy > Medieval","desc":"<p>In this strategy role-playing game, you and your mercenary group decide which of the six warring factions to support on your journey to unify the land. Battles take place on a traditional turn-based movement grid, transitioning to real-time skirmishes between armies or between individual commanders.</p>"},{"name":"Sōkyūgurentai","year":1997,"developer":"Raizing Co., Ltd."},{"name":"Sol Divide","year":1998,"developer":"Psikyo","url":"e#Sol%20Divide%20%28Japan%29.zip","filesize":301078327,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Fantasy","desc":"<p>Set against a medieval fantasy backdrop, <em>Sol Divide</em> is a 2D side-scrolling shooter that pits one or two players against a horde of flying enemies. There are three different characters that can be played as, each with their own weapon and fighting style. Various magic scrolls can be found by defeating enemies which allow the player to cast several different types of spells including lightning and fire.</p><p>The story itself concerns an evil being who sets out looking for a Power Stone and cuts down all in his path with his sword, the Sol Divide. It is up to you to stop him, battling your way through several stages in both Arcade and Original Mode (which contain different areas and require different tactics to beat, the Original Mode being designed as a more difficult experience for players who want to progress on to a higher challenge).</p><p>Defeating enemies rewards the player with different items to help them on their journey, including the aforementioned magic scrolls, healing potions, magic bottles (only when playing Arcade Mode) and protection accessories (if playing Original Mode).</p>"},{"name":"Solar Eclipse","year":1995,"developer":"Crystal Dynamics, Inc."},{"name":"Sonic 3D Blast","year":1996,"developer":"Traveller's Tales (UK) Ltd.","url":"e#Sonic%203D%20Blast%20%28USA%29.zip","filesize":598880424,"score":6.9,"genres":"Action > Diagonal-down > Isometric > Arcade","desc":"<p>While visiting Flicky Island, Sonic notices that the Flickies, his small, feathered friends that can travel between parallel worlds, were captured and turned into badniks (the robot enemies of Sonic) by Dr. Robotnik in his never-ending quest for the Chaos Emeralds. Seven levels separate Sonic from the final showdown with Robotnik.</p><p><em>Sonic 3D</em> was the last Sonic title released for the Mega Drive, the only platforming presence of the blue blur in the Sega Saturn, and one of his rare appearances in Personal Computers. The title, considering the era it was released, is somewhat misleading, as instead of full blown 3D graphics it uses an isometric view where Sonic can move not only forwards and backwards, but also left and right. </p><p>Gameplay is much slower when compared to other games in the series, and the number of badniks is reduced to five in each section. As usual, when Sonic destroys one badnik, an animal leaps free from its insides, but this time Sonic has to pick him up and lead them to an interdimensional ring. While they can be taken one by one, exploring the level with all five allow the player to reach for otherwise inaccessible continue tokens. Unlike all other previous games, time isn't a requirement: if the player completes a level in more than 10 minutes, it would only mean there would be no time bonus at the end. Finally, to collect all seven Chaos Emeralds, Sonic first must find Tails or Knuckles and offer them at least 50 rings.</p>"},{"name":"Sonic Jam","year":1997,"developer":"Sonic Team","url":"e#Sonic%20Jam%20%28Europe%29.zip","filesize":471313504,"score":8.2,"genres":"Action > Compilation > Behind view > Side view > 2D scrolling > Anime / Manga > Platform","desc":"<p>A compilation of Sonic's greatest 2D adventures. Included on the disk is the original Sonic the Hedgehog, Sonic 2 (featuring Tails), Sonic 3 plus Sonic &amp; Knuckles.</p><p>Each game has you taking control of Sonic (and later on in the series, Tails and Knuckles) who must use his speed to blast his way through level after level and rescuing his animal friends from the evil Dr. Robotnik. Along the way you will also enjoy 3rd person bonus rounds and take on a host of end of level bosses.</p><p>Exclusive to the Saturn compilation is the Sonic 3D museum, which allows you to control a 3D animated Sonic through a world full of historical information on the Sonic series, including behind the scenes, details on the characters from each game, artwork and more.</p>"},{"name":"Sonic R","year":1997,"developer":"Sonic Team","url":"e#Sonic%20R%20%28Europe%29.zip","filesize":603759977,"score":6.9,"genres":"Racing / Driving > Behind view > Anime / Manga > Arcade","desc":"<p>While on vacation, Tails and Sonic come across a recruiting advertisement for the World Grand Prix race. Sonic is not interested at first, but once he notices that Dr. Robotnik will participate he decides to enter. Robotnik is only interested in the race because he's learned the location of the Chaos Emeralds and now he'll get a chance to beat Sonic while he gets them. Knuckles finds out that Sonic will participate, so he joins him. Amy overhears Robotnik's plan, so she will also be racing to get the Chaos Emeralds.</p><p>There are many modes of gameplay in Sonic R:</p><p>Grand Prix: You race against the rest of the characters on each of the circuits, and get a chance to race the level's boss to unlock some of the extra playable characters.</p><p>Time Attack: Run on one of the tracks as fast as you can, get 5 balloons or tag 4 characters.</p><p>Multi Player: 4 players on a split-screen or over a network. You can race against up to three players or challenge them on a balloon finding game. The screen can be divided horizontally or vertically for 2 player games. </p>"},{"name":"Sonic Wings Special","year":1996,"developer":"Video System Co., Ltd.","url":"e#Sonic%20Wings%20Special%20%28Japan%29.zip","filesize":47603928,"score":6.6,"genres":"Action > Top-down > Arcade > Shooter > Flight / aviation","desc":"<p>A secret organization called Fata Morgana is developing a weapon that is capable of killing or wounding two-thirds of the world's population. A super-national group of combat experts from all over the world called Project Blue has been established to counteract Fata Morgana's evil doings. </p><p><em>Sonic Wings Special</em> is an enhanced and expanded port of <em>Aero Fighters Special</em> (<em>Sonic Wings Limited</em> in Japan), a coin-op shoot-'em-up with vertical scrolling. The original coin-op game uses altered levels, graphics and many features from Aero Fighters, Aero Fighters 2 and Aero Fighters 3. </p><p>The home console version adds new characters and endings, new bosses, updated graphics and unlockable planes. There are also Time Attack and 2-player modes. The game uses a branching stage system, so it is impossible to see all levels in one sitting. There is a total of 14 playable characters and many different endings (some of which are reused from previous games in the series). Overall the game has a comic feel. </p><p>As of Summer 2012, the Android version of <em>Sonic Wings Special</em> has only 4 playable characters with 4 endings and 9 stages. However, the publisher is planning to add further elements of the original version.</p>"},{"name":"Sotsugyou II: Neo Generation","year":1995,"developer":"Bandai Visual Co., Ltd.","url":"e#Sotsugyou%20II%20-%20Neo%20Generation%20%28Japan%29%20%282M%29.zip","filesize":543955580,"score":"","genres":"Simulation > Anime / Manga > Managerial / business simulation","desc":"<p><em>Graduation</em> is a Japanese anime \"life-sim\" game. You take the role of a homeroom teacher who is given the responsibility of teaching five girls in their last year of high school. You determine their class schedules, do guidance counseling, interfere with their weekend plans, and occasionally take to the streets to make sure they're not getting into trouble. Each of the girls has their own individual personality and problems, and the choices you make will determine whether they graduate from high school, what they do with their lives afterward, and whether or not they wind up hating your guts. Get them all into top colleges and your boss will praise your genius. If they all flunk or wind up wanting to marry you, you'll obviously be fired.</p><p>Despite what common sense and knowledge of the Japanese psyche might lead you to believe, this is not an adult (or hentai) game and there's no nudity and only an average amount of anime sexploitation.</p>"},{"name":"Soukuu no Tsubasa: Gotha World (Disc 1)","year":1997,"developer":"Micronet Co. Ltd.","url":"e#Soukuu%20no%20Tsubasa%20-%20Gotha%20World%20%28Japan%29%20%28Disc%201%29.zip","filesize":322823499,"score":"","genres":"Strategy > Anime / Manga > Sci-fi / futuristic","desc":"<p>Set in the aerial world \"Gotha World\", this is the great epic story that depicts the fight between the private garrison where the main character belongs and the pirate guild!</p><p>After deciding operations for all units for both allies and enemies, the \"Personal Time System\" in action will greatly influence the outcome of the battle!</p><p>Predicting the enemy 's actions, making strategy plans and carry out the actions in battle will be the key to victory!</p>"},{"name":"Soukuu no Tsubasa: Gotha World (Disc 2)","year":1997,"developer":"Micronet Co. Ltd.","url":"e#Soukuu%20no%20Tsubasa%20-%20Gotha%20World%20%28Japan%29%20%28Disc%202%29.zip","filesize":441608976,"score":"","genres":"Strategy > Anime / Manga > Sci-fi / futuristic","desc":"<p>Set in the aerial world \"Gotha World\", this is the great epic story that depicts the fight between the private garrison where the main character belongs and the pirate guild!</p><p>After deciding operations for all units for both allies and enemies, the \"Personal Time System\" in action will greatly influence the outcome of the battle!</p><p>Predicting the enemy 's actions, making strategy plans and carry out the actions in battle will be the key to victory!</p>"},{"name":"Soviet Strike","year":1997,"developer":"Electronic Arts, Inc.","url":"e#Soviet%20Strike%20%28Europe%29.zip","filesize":557731440,"score":7.7,"genres":"Action > Diagonal-down > Shooter > Flight / aviation > Helicopter","desc":"<p>In 1991, the U.S.S.R. (Union of Soviet Socialist Republics); boasting the largest military force in history, suddenly and unexpectedly collapsed. Since that time, the fallen empire has lain lifeless -- a rich corpse waiting to be picked clean. Now, a sinister ex-KGB general codenamed Shadowman directs a flock of vultures to swoop in from all parts of Eastern Europe and claim Russia's nuclear warheads and weapons of mass terror. With these \"wars of liberation\", Shadowman intends to shake democratic Russia to its foundations, bringing about a return to the Cold War... or even worse. </p><p><em>Soviet Strike</em> is the fourth installment in the Strike series and the first for 32-bit consoles.Once again, this is a shooting game where the player is in control of a combat helicopter, this time guiding it through 41 deadly missions across five unique 3D worlds, from Crimea to the streets of Moscow or above the Black Sea.This installment introduces a brand new \"Living Battlefields\" feature, where the enemy troops, their tactics and vehicle responses will adapt to the player's actions as they progress toward their objective, sometimes triggering events without waiting for the player to be on site.</p>"},{"name":"Space Hulk: Vengeance of the Blood Angels","year":1996,"developer":"Key Game","url":"e#Space%20Hulk%20-%20Vengeance%20of%20the%20Blood%20Angels%20%28Europe%29.zip","filesize":360791673,"score":7.4,"genres":"Action > Strategy > 1st-person > Top-down > Sci-fi / futuristic > Licensed","desc":"<p><em>Space Hulk: Vengeance of the Blood Angels</em> is a mix of a First-Person-Shooter and a tactical fighting game. It is placed in theWarhammer 40k background of the Games Workshop tabletop games. It is the successor of the PC game Space Hulk from 1993 and it tells of the fight between the Terminators of the Blood Angels Chapter of Space Marines and the Tyranid Genestealers.</p><p>You control up to ten Terminators. You give them orders in a tactical screen and/or take over one of them and then move in a 3D environment and fight the Genestealers just as in a First-Person-Shooter. So the game includes tactical planning and fighting in a good balance.</p>"},{"name":"Space Invaders","year":1996,"developer":"Kinesoft Development Corp.","url":"e#Space%20Invaders%20%28Japan%29.zip","filesize":51850221,"score":6.8,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>This version of <em>Space Invaders</em> is based on the 1994 arcade game Space Invaders DX but lacks the parody mode of that game. What remains is the classic mode that allows the player to choose the type of arcade cabinet (upright, black &amp; white, etc.) as background to the action as well as the versus mode for two players. The versus mode is split-screen, each player trying to survive and eliminate more invaders than the opponent.</p><p>The Game Boy version has both one- and two-player modes using the usual Game Boy tones (black and grey). However, plugging the cart into a Super Game Boy allows playing the game in all four cabinet types of the SNES version. </p><p>The PC Engine (TurboGrafx) CD version offers an additional \"cosmic versus\" mode, where the background is composed of anime-style pictures of girls. They also appear in the \"omake mode\", which is a single-player variant with the same backgrounds.</p><p>The WonderSwan version doesn't offer all four cabinet types (only black &amp; white) but keeps the versus mode.</p>"},{"name":"Space Jam","year":1996,"developer":"Sculptured Software, Inc.","url":"e#Space%20Jam%20%28Europe%29.zip","filesize":285128805,"score":5.5,"genres":"Sports > 3rd-person (Other) > Side view > Basketball > Licensed","desc":"<p>Based on the movie of the same name, <em>Space Jam</em> centres around an invasion of Looney Tunes land by tiny aliens. The fate of the Tunes is to be decided by a basketball game, and for this the aliens turn into the huge, evil Monstars.</p><p>The game is about two thirds basketball sim and then minigames are stuck in to fill all the gaps. You can play as the Monstars or the Looney Tunes who have the help of Michael Jordan. The basketball games themselves come in two flavours, two-on-two and three-on-three.</p><p>Successful completion of the minigames upgrades your character's abilities on the court. There are several - one involves finding MJ's basketball togs, one is a space race in the style of the retro Micro Machines games. There are about five minigames in all, and a player from both teams participates.</p><p>The multiplayer is a big aspect of the game. There is the traditional two-player versus, one team Tunes, one team Monstars, and there is also co-operative mode. In this two or even three players can play on the same team. Using multitaps, you can actually have a three-on-three game.</p><p>The Tunes roster is made up of Michael Jordan, Bugs Bunny, Daffy Duck, Lola Bunny, Taz, Foghorn Leghorn, Pepé Le Pew, Sylvester, Wile E. Coyote, Porky Pig, Elmer Fudd and Yosemite Sam. The Monstars have access to Pound, Bupkus, Bang, Blanko and Nawt.</p><p>There are three statistics in the game, namely Speed, Shooting and Rebounds. These are pretty self-explanatory, but there is another more subtle one that's similar to stamina. Throughout the course of play your characters will get tired and lose their focus. A successful slam dunk usually tops this up.</p><p>The closest thing the game has to a single player mode is the Intergalactic Tournament (though it can be played multiplayer). This is a series of five matches in a row. One captain is picked and plays every game, while the rest of the team is substituted in and out.</p><p>There is no real way to progress in the game as it does not support memory cards. Space Jam has more of an arcade, lighthearted feel to it.</p>"},{"name":"Spot Goes to Hollywood","year":1996,"developer":"Burst","url":"e#Spot%20Goes%20to%20Hollywood%20%28Europe%29.zip","filesize":537346645,"score":6.6,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Fantasy > Licensed","desc":"<p>The central character in this game is Spot, the little red mascot from the 7-Up TV commercials. Spot has somehow become trapped in a movie projector. As he jumps from film to film, he encounters many classic film genres that make up all the different levels of the game. The main levels are a pirate movie, an adventure movie and a horror movie, but there are also many other bonus films to unlock.</p><p>The game is played from an isometric overview perspective. Spot has to collect five Hollywood stars per level to unlock hidden areas and ultimately complete the game 100%.</p>"},{"name":"Stakes Winner: GI Kanzen Seiha e no Michi","year":1996,"developer":"AM Factory","url":"e#Stakes%20Winner%20-%20GI%20Kanzen%20Seiha%20e%20no%20Michi%20%28Japan%29.zip","filesize":308038142,"score":"","genres":"Sports > Diagonal-down > Arcade > Horse / derby","desc":"<p><em>Stakes Winner</em> is a horse racing game. </p><p>Races can be entered by one or two players and involve eight horses struggling for victory; each of the eight horses (in the order which the game presents them in: White Heat, Hot Sand, Euro Union, Asian Hope, Brave Lady —the sole female one—, Be Silent, US Fighter, Sky Dancer) given for selection is characterized by three parameters (named «abilities» in-game): speed, stamina, strength, all measured in stars from a minimum of one to a maximum of five. Rival horses are not available for selection to the player: their names are, for instance, the ominous- or hilarious-sounding «Mr Devious», «Red Vision», «Sunk Star», «HelpMe», «OhMygod», «Nutseater». The names are also differentiated by being written all in capital letters the latter ones, normally the former.</p><p>Before the beginning of the race, while horses approach the starting point, the name of the circuit, course plan, prize money and circuit time record are displayed. During the race, the indicators on the screen are: the course plan (with a moving coloured circular indicator representing the position of each contender), the chronometric indication of time, the horse's energy bar with a line composed of three segments beside it: a red one (that means the horse is in its full strength), a yellow and a blue one (denoting lack of strength); a representation of the horse's face, which portrays its, more or less fatigued or strong status and how intensely it is running.</p><p>The game controls require the use of two buttons and the control stick or directional pad: one button controls the reins, for slight acceleration, which consumes a little of the horse's energies. The other one controls the whip, for sharp acceleration: this consumes the horse's force significantly. Should the energy be consumed entirely, racing will have to be given up for a while. Two rapid touches on the joystick or directional pad in the direction of travel allow to force away a horse blocking the player's road to victory; two rapid touches in the direction opposite to that of travel vigorously reduce speed. </p><p>Power-up items represented by icons placed on the course may be taken during the race, raising one of the parameters of the horse by one for some time, giving a temporary boost in speed, or partially restoring the horse. Weather conditions change from time to time: the drizzle may be an obstacle, worsening the status of the terrain. A real second corresponds to two seconds in game (therefore, for instance, a one-minute race will last half a minute).</p><p>After every stage, the track length, as well as the prize money awarded to the first three finishers are augmented. The series of levels are separated by training stages. If done successfully, training on the dirt or on the turf respectively increases the horse's stamina and speed, whereas training on or «against»,the hill strengthens it. Success in training session is to be attained by pushing a button as rapidly as possible, while avoiding assorted obstacles and hindrances. The player can choose what type of training to opt for.</p><p>Race courses proceed in the ensuing sequence: * Maidens</p><ul><li>Sapporo Juvenile</li><li>Juvenile Stakes</li><li>training</li><li>2000 Guineas</li><li>Derby Stakes (the $1.300.000 prize money is mistakenly displayed as «$ 130.000»)</li><li>St. Leger (BC Classic in the original arcade game)</li><li>training</li><li>Japan Grandprix</li><li>Emperor Spring Cup</li><li>Champion Stakes</li><li>St. Leger (difficulty is now higher than the previous time)</li><li>training</li><li>Japan Cup</li><li>Japan Grandprix (difficulty is this time higher than previously)</li><li>The Arc The Triomphe</li></ul><p>The game is identical to the original one in all of its fundamental aspects, save for a number of modifications to minor details: continues are still named «credits» (four of them are given: it is possible to select a different horse when continuing the game using a credit after game over) and their quantity is indicated, likewise in arcade games, at the bottom of the screen (although the flashing «Insert coin» on the opening screen followed by «Push P1 start !» has been replaced with «Push P1 or P2 start !»).</p><p>While the original game was entirely in Japanese (except for race names, given an English translation), the console version, despite not having been released outside of Japan, can be said to be in English (conversely, now race course names have a Japanese translation next to the English name); money prizes are now in dollars rather than in yen, and remarkably changed in value: whereas YPN 5300 were the reward in the arcade version, $540000 are awarded to the winner of a race. Initially, nothing but crossing the finish line in the first place allowed progression in the game; in the console conversion finishing in the first three places guarantees advancement to the next race.</p><p>Horse energy is named «power» in the Neo Geo version, adhering to the original game, while in the Wii version it was renamed to «life»; furthermore, in the Neo Geo version the blue and red segments are shown inverted beside the energy bar. The console version presents fours levels of difficult: easy, normal, hard, MVS.</p>"},{"name":"StarFighter 3000","year":1996,"developer":"The World Federation Entertainments Network","url":"e#StarFighter%203000%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":459468258,"score":7.2,"genres":"Action > 1st-person > Behind view > Flight / aviation > Space flight > Sci-fi / futuristic","desc":"<ol><li>FedNet is now in control of the federation, and in an attempt to gain the trust of the population following decades of corruption and warfare, the FedNet Space Corps were sent to the outermost planets to crush the small-time warlords still running the show there. After being \"convinced\" to join them in a tour of duty, he is assigned to an elite flight group with the only purpose of testing the most cutting-edge technology.</li></ol><p>A remake of the original game of the same title released a few years before for the Acorn Archimedes platform, <em>Starfighter 3000</em> features more detailed graphics (now all surfaces are texture-mapped and a fogging filter reduces clipping). Featuring 15 levels in 4 worlds, the player controls the Predator Mark-IV, a fighter ship capable of space and atmospheric flight. However, other than the handy boost button, the player has no control over the throttle, (unless he uses a flight stick with thrust controls such as 3DO's CH Pro stick) and must keep moving at all times. </p><p>In post 3DO releases, only two points of view are available: behind (better for acrobatics and general flying) and cockpit (accurate aiming and NOE flight). The 3DO release contained several more, like a TV-style fly-by-cam, weapon cameras, and enemy cams that could show a nearby enemies' POV. </p><p>By picking up crystals the player is able to upgrade his craft and obtain more ammo, and by combining colours, get more powerful weapons, some also obtainable from parachute drops sent by FedNet.</p><p>One of the defining features of the game is using the laser (basic weapon) to terraform the map. As the game map is composed of tiles, some with higher or lower vertexes can be leveled by simply firing repeatedly at the same area. This allows players to strategically avoid heavy defense turrets by simply collapsing a hill, or destroy a heavier turret by simply burrowing the ground beneath it.</p><p>The player starts the game with three lives and earns one every 250k points. Losing all lives means a game over, but as there isn't a profile for each pilot (like in Tie Fighter), the game can be resumed freely from the last savegame.</p>"},{"name":"Steam-Heart's","year":1998,"developer":"Technical Group Laboratory, Inc.","url":"e#Steam-Heart%27s%20%28Japan%29.zip","filesize":589874883,"score":"","genres":"Action > Top-down > 2D scrolling > Anime / Manga > Arcade > Shooter > Sci-fi / futuristic > Adult","desc":"<p><em>Steam Heart's</em> is a 2D sci-fi vertically scrolling shoot-em-up with erotic content. The game takes place in the far future, on an alien planet dominated by seven elf-like or catgirl princesses that have fallen under the spell of a unique virus that has driven them mad and threatens to destroy the planet if all the rulers declare all-out war.</p><p>Only Blondia Varady (nicknamed \"Blow\") and his sister Fallandia have been spared from the disease and must pilot their fighter ships in order to penetrate deep into the domain of each princess, destroy their war machines, and administer the antidote. Fortunately for Blow, the antidote has been synthesized into his reproductive organ, so that means there is only one way to inoculate the girls....</p><p>The player controls the fighter ship through vertically scrolling stages, trying to destroy every ship that crosses its path and reach the end boss. The ship has a primary weapon that can be constantly upgraded by collecting power-ups, and a secondary slot for all sorts of collectible weapons that can be picked up in mid-air. The game features 2P-cooperative gameplay and cutscenes made of still images that explain the plot and depict the protagonist's encounters with each princess.</p>"},{"name":"Steamgear Mash","year":1995,"developer":"Tamsoft Corporation","url":"e#Steamgear%20Mash%20%28Japan%29.zip","filesize":388930094,"score":"","genres":"Action > Diagonal-down > Isometric > Platform","desc":"<p><em>SteamGear Mash</em> is an isometric platformer. It has the (almost) classic case of \"kidnap and rescue\", except now you play a robot who has to save a little girl called Mina. She was lonely and the scientist with whom she lived built her a robot, called Mash. One day, while these two were playing outside, an alien spaceship came around and fell in love with the girl. He sent his minions to take her and they did. Now it's your job to rescue Mina. There are seven stages, two of which are shoot 'em up stages.</p>"},{"name":"Steep Slope Sliders","year":1997,"developer":"CAVE Co., Ltd.","url":"e#Steep%20Slope%20Sliders%20%28Japan%29.zip","filesize":349631910,"score":7.6,"genres":"Sports > 3rd-person (Other) > Snowboarding / skiing","desc":"<p><em>Steep Slope Sliders</em> is a snowboarding game offering a free rotation system for a large variety of tricks. The game sees you picking one of a motley crew of boarders and taking to the slopes as you try to get the best times and/or scores on each slope. Courses from Canada to Italy to Japan are available, as well as the option to play on a half-pipe purely for points and an Alpine track for time attacks. In addition, the game boasts a number of unlockable characters and locations. It also features a replay system with editable camera/graphics effects, and thanks to the Saturn's clock you'll find yourself boarding at the various locales at an appropriate time of day relative to the system clock setting.</p>"},{"name":"Stellar Assault SS","year":1998,"developer":"SIMS Co., Ltd.","url":"e#Stellar%20Assault%20SS%20%28Japan%29.zip","filesize":289139835,"score":"","genres":"Action > 1st-person > Behind view > Arcade > Shooter > Direct control > Space flight > Sci-fi / futuristic","desc":"<p><em>Stellar Assault SS</em> is a 3D space combat shooter and a sequel to Stellar Assault. Like in the first game, you also controls a space fighter in a series of battles against huge enemy ships, but this time the gameplay is more story-driven, with supporting characters and voice acting. <em>Stellar Assault SS</em> was released exclusively in Japan.</p>"},{"name":"Street Fighter Alpha 2","year":1996,"developer":"Capcom Co., Ltd.","url":"e#Street%20Fighter%20Alpha%202%20%28Europe%29.zip","filesize":418523814,"score":8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control","desc":"<p>Another Street Fighter sequel (this time for Street Fighter Alpha) adds even more to the classic fighting series.</p><p>New characters in this version include Gen (a wise kung-fu master), Rolento (who you may remember from another Capcom classic, Final Fight) and Sakura, a young school girl who follows her hero Ryu so close, she has the same type of moves. Dhalsim and Zangief also return to the fight with some news moves.</p><p>The other major difference is the loss of chain-combos and the gain of a custom combo system. Once you reach the required level (which is 1 at the least) you can execute a custom combo by combining any of the buttons (which there are 6 in total) or any of the special attacks (fireballs, etc.)</p>"},{"name":"Street Fighter Alpha 3","year":1999,"developer":"Capcom Co., Ltd."},{"name":"Street Fighter Alpha: Warriors' Dreams","year":1996,"developer":"Capcom Co., Ltd.","url":"e#Street%20Fighter%20Alpha%20-%20Warriors%27%20Dreams%20%28Europe%29.zip","filesize":566201291,"score":8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Fantasy > Martial arts","desc":"<p>It's Street Fighter as you always remember it, with some new moves, characters and combo systems, as well as a more polished look and feel.</p><p>The new moves available for each fighter, called Super moves, allow them to fire off very powerful moves. A bar at the bottom of the screen represents the power that you have to use for the moves. You start the first round on 0, and each attack that you make adds power to the bar. Once you reach level 3, you can unleash the special attacks, that can sometimes KO the opponant.</p><p>The other major change over the Street Fighter 2 series are the Alpha counters. These can be used to counter an on-coming attack after blocking.</p>"},{"name":"Street Fighter Collection (Disc 1)","year":1997,"developer":"Capcom Co., Ltd.","url":"e#Street%20Fighter%20Collection%20%28USA%29%20%28Disc%201%29.zip","filesize":571556337,"score":7.8,"genres":"Compilation > Fighting","desc":"<p>Street Fighter Collection is a bundle comprising several different games of the Street Fighter series. It includes:</p><ul><li>Super Street Fighter II: The New Challengers</li><li>Super Street Fighter II Turbo</li><li><em>Street Fighter Alpha 2 Gold</em> (updated Street Fighter Alpha 2 with balancing fixes: Evil Ryu and Cammy added as playable characters, timing of some characters changed)</li></ul>"},{"name":"Street Fighter Collection (Disc 2)","year":1997,"developer":"Capcom Co., Ltd.","url":"e#Street%20Fighter%20Collection%20%28USA%29%20%28Disc%202%29.zip","filesize":428292970,"score":7.8,"genres":"Compilation > Fighting","desc":"<p>Street Fighter Collection is a bundle comprising several different games of the Street Fighter series. It includes:</p><ul><li>Super Street Fighter II: The New Challengers</li><li>Super Street Fighter II Turbo</li><li><em>Street Fighter Alpha 2 Gold</em> (updated Street Fighter Alpha 2 with balancing fixes: Evil Ryu and Cammy added as playable characters, timing of some characters changed)</li></ul>"},{"name":"Street Fighter Collection 2","year":1998,"developer":"Capcom Co., Ltd."},{"name":"Street Fighter: The Movie","year":1995,"developer":"Capcom Co., Ltd.","url":"e#Street%20Fighter%20-%20The%20Movie%20%28Europe%29%20%282S%29.zip","filesize":550442982,"score":5.5,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Licensed","desc":"<p><em>Street Fighter: The Movie</em> is a 2D versus fighting game based on the movie of the same name, which in turn is based on the well known Capcom series, Street Fighter. Gameplay is similar to Street Fighter II and Super Street Fighter II Turbo. Select from a range of fighters (including Ryu, Ken, Guile, M. Bison and Chun Li) each with their own set of special moves, and defeat all of the opposition to become the King of street fighting. The game uses digitized animation based on the actors and the many locations featured in the film.</p><p>Also included is a story mode which follows the story of the movie and uses FMV in-between fights and a Trial Battle Mode, where the player takes on Guile in a range of different battle events to test their skills.</p>"},{"name":"Street Racer","year":1996,"developer":"Vivid Image","url":"e#Street%20Racer%20%28Europe%29.zip","filesize":362133276,"score":7.5,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p><em>Street Racer</em> is a kart racing game similar to Super Mario Kart.</p><p>Up to four players can play by split-screen. If there are no human opponents, the player can drive against seven computer opponents in three leagues. If the player wins the first league, they can play the second and so on. The game has eight different vehicles with different skills in speed, haste or resistance. There are also some power-ups on the tracks such as bombs, nitro fuel, and health packs.</p>"},{"name":"Striker 96","year":1996,"developer":"Rage Software Ltd.","url":"e#Striker%2096%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":270300731,"score":6.7,"genres":"Simulation > Sports > 3rd-person (Other) > Football (European) / Soccer","desc":"<p>1996's edition of the Striker football series from Rage Software.</p><p>Graphics combine a 3D pitch with 2D player sprites.  The game includes multiple camera angles as well as different weather effects. You can modify any team's roster, select basic formations, time limits, difficulty, etc.</p><p>Select from 41 international teams and take part in either friendly games, league, or cup tournaments.Also included is a 6 on 6 indoor mode, and multiplayer support for up to 4 players using Gravis's GrIP system or through a network. </p><p>The game includes commentary by Scottish commentator Andy Gray.</p>"},{"name":"Strikers 1945","year":1996,"developer":"Psikyo","url":"e#Strikers%201945%20%28Japan%29.zip","filesize":140539154,"score":7,"genres":"Action > Top-down > Arcade > Shooter > Flight / aviation > World War II","desc":"<p><em>Strikers 1945</em>, not to be confused with the US PSX game Strikers 1945, which is actually the sequel <em>Strikers 1945 II</em>, is a port of the top-down vertically-scrolling arcade shooter. Set during World War II, the player can choose from different ships and pilots to engage the enemy. At the end of the war, all sides are left powerless and defeated. A secret organization known as CANY manages to initiate a coup among each country's military forces. The last resort is a team assembled with the best fighters from the US, Japan, Germany and England, with the goal to push back CANY.</p><p>The list of planes and pilots includes:* P-38 (Lockheed P-38 Lightning) - Cindy Volton</p><ul><li>P-51 (North American P-51 Mustang) - Tina Prize</li><li>Spitfire (Supermarine Spitfire) - Alice Herring</li><li>Bf-109 (Messerschmitt Bf-109/Me-109) - Lean Beirer</li><li>Zero (Mitsubishi A6M Zero) - Ai Mikami</li><li>Shinden (Kyushu J7W Shinden) - Ainzaemon</li></ul><p>Each plane has a normal shot, a charged shot and a bomb that clears the entire screen. The P-51 can also block bullets with its charged shot. Destroyed enemies and buildings leave behind gold bars for bonus points. This adaptation includes two original modes, an arcade mode and an index of the different fighters. Co-op is available for up to two players.</p>"},{"name":"Strikers 1945 II","year":1998,"developer":"Psikyo","url":"e#Strikers%201945%20II%20%28Japan%29.zip","filesize":129825418,"score":7.3,"genres":"Action > Side view > Top-down > 2D scrolling > Arcade > Shooter > Direct control > Flight / aviation > World War II","desc":"<p><em>Strikers 1945 II</em> is a 2D side-scrolling shooter with a WWII theme. Use basic weaponry and many power-ups for real and not-so-real aircraft from the age. To keep in sync with the arcade version, the home versions are presented in a letterbox format.</p>"},{"name":"Suchie-Pai Adventure: Doki Doki Nightmare (Disc 1)","year":1998,"developer":"Jaleco Ltd.","url":"e#Suchie-Pai%20Adventure%20-%20Doki%20Doki%20Nightmare%20%28Japan%29%20%28Disc%201%29.zip","filesize":403543112,"score":"","genres":"Adventure > 1st-person > Isometric > Anime / Manga > Fantasy","desc":"<p>Something strange has been happening in Kamiyōga recently. Young girls have been falling into inexplicable comas, one after another. Suchie-Pai, defender of justice, believes that someone or something sinister is causing all this, but needs help finding the true culprit and saving the people of Kamiyōga!</p><p><em>Doki Doki Nightmare</em> (\"The Throbbing Nightmare\") is a Japanese-style adventure game with dating elements. The game is a spinoff of the popular Suchie-Pai strip-mahjong series. The player is given a week to travel around the city of Kamiyōga, interacting with its (primarily young and female) inhabitants to discover who has caused the strange curse on the city. The player can travel to a large number of locations throughout the city, and depending on what the player does and where, different story branches are unlocked.</p><p>In addition to the main game, the second disc features several minigames and a variety of bonus materials. After the game is cleared, it is also possible to ask other characters out on a date if their relationship has significantly progressed. Additionally, CG scenes and movies unlocked in the main game can also be reviewed here.</p>"},{"name":"Suchie-Pai Adventure: Doki Doki Nightmare (Disc 2)","year":1998,"developer":"Jaleco Ltd.","url":"e#Suchie-Pai%20Adventure%20-%20Doki%20Doki%20Nightmare%20%28Japan%29%20%28Disc%202%29.zip","filesize":471645511,"score":"","genres":"Adventure > 1st-person > Isometric > Anime / Manga > Fantasy","desc":"<p>Something strange has been happening in Kamiyōga recently. Young girls have been falling into inexplicable comas, one after another. Suchie-Pai, defender of justice, believes that someone or something sinister is causing all this, but needs help finding the true culprit and saving the people of Kamiyōga!</p><p><em>Doki Doki Nightmare</em> (\"The Throbbing Nightmare\") is a Japanese-style adventure game with dating elements. The game is a spinoff of the popular Suchie-Pai strip-mahjong series. The player is given a week to travel around the city of Kamiyōga, interacting with its (primarily young and female) inhabitants to discover who has caused the strange curse on the city. The player can travel to a large number of locations throughout the city, and depending on what the player does and where, different story branches are unlocked.</p><p>In addition to the main game, the second disc features several minigames and a variety of bonus materials. After the game is cleared, it is also possible to ask other characters out on a date if their relationship has significantly progressed. Additionally, CG scenes and movies unlocked in the main game can also be reviewed here.</p>"},{"name":"Sugoventure: Dragon Master Silk Gaiden","year":1998,"developer":"Gimmick House"},{"name":"Suiko Enbu Fuunsaiki","year":1996,"developer":"Data East Corporation"},{"name":"Super Adventure Rockman (Disc 1)","year":1998,"developer":"Capcom Co., Ltd.","url":"e#Super%20Adventure%20Rockman%20%28Japan%29%20%28Disc%201%29.zip","filesize":506172622,"score":"","genres":"Action > 1st-person > 3rd-person (Other) > Anime / Manga > Full Motion Video (FMV) > Sci-fi / futuristic","desc":"<p>Dr. Wiley is at it again! This time he's uncovered an ancient temple that houses a super computer he uses to recreate some of his old robots (from Mega Man 2 and Mega Man 3). Another added bonus of this computer is that it can affect anything electrical, which he of course uses to his advantage. Rockman's sister, Roll, is one of the first to get affected by it. Dr. Light manages to make Rockman and his friends (the robots from the first Mega Man) immune to the evil computer and they set off to stop Dr. Wiley once again on the island where he's hiding.</p><p>The game plays out like an interactive anime tv mini-series where each disc in the game is an \"episode\" with opening and ending credits. The player basically follows the plot through numerous movie clips and every now and then is asked to make decisions, be it a reply to a character, the left or right path, or even some quick time events. Aside from this the player is also thrown into battles at certain key points of the game, where the game switches to a static first person view in which the player has to kill whatever enemy or boss has crossed Rockman's path.</p><p>In true Mega Man/Rockman fashion, Rockman absorbs the powers of any boss he defeats along the way, to be used against another boss later on in the game or any difficult enemies he encounters.</p>"},{"name":"Super Adventure Rockman (Disc 2)","year":1998,"developer":"Capcom Co., Ltd.","url":"e#Super%20Adventure%20Rockman%20%28Japan%29%20%28Disc%202%29.zip","filesize":548871137,"score":"","genres":"Action > 1st-person > 3rd-person (Other) > Anime / Manga > Full Motion Video (FMV) > Sci-fi / futuristic","desc":"<p>Dr. Wiley is at it again! This time he's uncovered an ancient temple that houses a super computer he uses to recreate some of his old robots (from Mega Man 2 and Mega Man 3). Another added bonus of this computer is that it can affect anything electrical, which he of course uses to his advantage. Rockman's sister, Roll, is one of the first to get affected by it. Dr. Light manages to make Rockman and his friends (the robots from the first Mega Man) immune to the evil computer and they set off to stop Dr. Wiley once again on the island where he's hiding.</p><p>The game plays out like an interactive anime tv mini-series where each disc in the game is an \"episode\" with opening and ending credits. The player basically follows the plot through numerous movie clips and every now and then is asked to make decisions, be it a reply to a character, the left or right path, or even some quick time events. Aside from this the player is also thrown into battles at certain key points of the game, where the game switches to a static first person view in which the player has to kill whatever enemy or boss has crossed Rockman's path.</p><p>In true Mega Man/Rockman fashion, Rockman absorbs the powers of any boss he defeats along the way, to be used against another boss later on in the game or any difficult enemies he encounters.</p>"},{"name":"Super Adventure Rockman (Disc 3)","year":1998,"developer":"Capcom Co., Ltd.","url":"e#Super%20Adventure%20Rockman%20%28Japan%29%20%28Disc%203%29.zip","filesize":548845206,"score":"","genres":"Action > 1st-person > 3rd-person (Other) > Anime / Manga > Full Motion Video (FMV) > Sci-fi / futuristic","desc":"<p>Dr. Wiley is at it again! This time he's uncovered an ancient temple that houses a super computer he uses to recreate some of his old robots (from Mega Man 2 and Mega Man 3). Another added bonus of this computer is that it can affect anything electrical, which he of course uses to his advantage. Rockman's sister, Roll, is one of the first to get affected by it. Dr. Light manages to make Rockman and his friends (the robots from the first Mega Man) immune to the evil computer and they set off to stop Dr. Wiley once again on the island where he's hiding.</p><p>The game plays out like an interactive anime tv mini-series where each disc in the game is an \"episode\" with opening and ending credits. The player basically follows the plot through numerous movie clips and every now and then is asked to make decisions, be it a reply to a character, the left or right path, or even some quick time events. Aside from this the player is also thrown into battles at certain key points of the game, where the game switches to a static first person view in which the player has to kill whatever enemy or boss has crossed Rockman's path.</p><p>In true Mega Man/Rockman fashion, Rockman absorbs the powers of any boss he defeats along the way, to be used against another boss later on in the game or any difficult enemies he encounters.</p>"},{"name":"Super Puzzle Fighter II Turbo","year":1996,"developer":"Capcom Co., Ltd.","url":"e#Super%20Puzzle%20Fighter%20II%20Turbo%20%28Europe%29.zip","filesize":409820070,"score":7.8,"genres":"Puzzle > Real-time > Falling block puzzle","desc":"<p>A Tetris-like puzzle game featuring popular characters from many Capcom games.</p><p>Colored gems fall from the top of the screen in pairs, but this time lining up those of the same color is not enough. To break the gems and punish your opponent with counter gems you have to place a crash gem of the same color next to the gems. If you make a block of gems of the same color they'll fuse, forming a power gem. Breaking a power gem sends more counter gems to your opponent than breaking the same amount of gems in some other configuration. But the ultimate attack is breaking power gems in chain.</p>"},{"name":"Super Real Mahjong Graffiti","year":1995,"developer":""},{"name":"Super Real Mahjong P VI","year":1996,"developer":"SETA Corporation"},{"name":"Super Real Mahjong P7 (P's Club Special Edition)","year":1998,"developer":"SETA Corporation","url":"e#Super%20Real%20Mahjong%20P7%20%28Japan%29%20%28P%27s%20Club%20Special%20Edition%29.zip","filesize":419679580,"score":"","genres":"Strategy > 1st-person > Anime / Manga > Cards / tiles > Adult","desc":"<p>More animated strip mahjong awaits in the seventh arcade game in the <em>Super Real Mahjong</em> series. Challenge three more lovely girls, Yurina Asahina, Natsuki Asahina, and Serika Randoh, and they'll take their clothes off for you. And if you win at least one match with a baiman hand or higher, the fun won't end with just the three of them...</p>"},{"name":"Super Real Mahjong PV (P's Club Special Edition)","year":1995,"developer":"SETA Corporation","url":"e#Super%20Real%20Mahjong%20PV%20%28Japan%29%20%28P%27s%20Club%20Special%20Edition%29%20%282M%29.zip","filesize":254373261,"score":"","genres":"Strategy > 1st-person > Anime / Manga > Cards / tiles > Adult","desc":"<p><em>Super Real Mahjong PV</em> is the fifth installment in the strip mahjong series. There is no background story in the game; the player is merely introduced to three high school girls - Mizuki, Aya, and Akira - who challenge him to the game of mahjong. The main mahjong mode is that of the one-on-one variety; after each completed round the girl removes a part of her clothing.</p><p>The computer versions of the game contain scenes with nudity; among the console versions, the PC-FX one is the only one that similarly lacks censorship. Some of the versions have secondary gameplay modes, such as a team mode in which the player controls three girls and plays mahjong against three others.</p>"},{"name":"Super Robot Wars F","year":1997,"developer":"Winky Soft Co., Ltd."},{"name":"Super Robot Wars F Final","year":1998,"developer":"Winky Soft Co., Ltd."},{"name":"Super Tempo","year":1998,"developer":"Red Company Corporation"},{"name":"Swagman","year":1997,"developer":"Core Design Ltd."},{"name":"Sword & Sorcery","year":1996,"developer":"Micro Cabin Corp.","url":"e#Sword%20%26%20Sorcery%20%28Japan%29%20%282M%29.zip","filesize":407888340,"score":7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p>Follow the story of an absent-minded young sorceress Lucienne and her gang of misfit monsters, as they try to stop the evil mage Death Shadow from destroying the world.</p><p><em>Lucienne’s Quest</em> is a game of the classic roleplaying genre but presented in full 3D graphics (and sprite characters) uncommon for the time. The battles are fought in a traditional turn-based manner but allow for more strategy than most classic RPGs. The game places ambient obstacles on the battlefield to block some attack paths but allows the player to strategically reposition his fighters along the bottom two rows of the map before every turn to take advantage of the terrain.</p><p>The game also features a dynamic day/night system that serves little purpose other than changing one of your party members from human into a werewolf and back.</p>"}]