[{"name":"Tactics Ogre: Let Us Cling Together (Japan)","year":1996,"developer":"Riverhill Soft Inc.","url":"e#Tactics%20Ogre%20-%20Let%20Us%20Cling%20Together%20%28Japan%29.zip","filesize":336000987,"score":8.6,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p>The land of Valeria is in a state of constant tension between the three nations that populate it. The Gargastan people, which constitute the majority, find themselves in a turbulent political situation. The Walstanian minority is being oppressed by the more powerful neighbors. The king of Bacrum, a nation that considered itself Valeria's elite, eventually gained the upper hand in the struggle, and managed to establish an era of peace and stability. All this ended when mysterious accidents began to plague the royal family. A new conflict arose, and eventually led to the ethnic cleansing of the Walstanians. Denim Powell, one of the survivors, embarks on a quest for revenge against those who slaughtered his people.</p><p><em>Tactics Ogre</em> is a 3D isometric tactical role-playing game. The player starts out with a band of troops, builds a small army and fights many battles with choices to make in between, that will determine which one of the eight possible endings will be reached in a non-linear storyline. The player has the option to recruit characters, control individual equipment of each character, with over six male character classes, six female character classes, three demi-human classes, and more. It is also possible to train at safe locations to prepare the army before the next battle or storyline advancement.</p>"},{"name":"Taikō Risshiden II","year":1996,"developer":"KOEI Co., Ltd."},{"name":"Taisen Mahjong Final Romance 4","year":1998,"developer":"Video System Co., Ltd."},{"name":"Taklamakan: Tonkou Denki (Japan)","year":1996,"developer":"InterServ International Inc.","url":"e#Taklamakan%20-%20Tonkou%20Denki%20%28Japan%29.zip","filesize":323487131,"score":5.5,"genres":"Adventure > 1st-person > Video backdrop","desc":"<p>A FMV adventure set in the caves of Dun-Huang. A trap was set for a terrible demon. The trap worked all too well as it also trapped the stone cutters that built the trap in the walls of the cave. Its your mission to go in and unlock the stone cutters by solving various puzzles based on Chinese myth and lore.</p><p>The game uses the same slide show puzzles that made Myst famous. Unlike Myst, you have a mysterious guide who transforms in to a lotus blossom and provides history and explanations for the various puzzles. </p><p>There is also a help feature that provides clues to how to solve puzzles.</p>"},{"name":"Tama: Adventurous Ball in Giddy Labyrinth","year":1994,"developer":"K.K. Time Warner Interactive"},{"name":"Tantei Jinguuji Saburou: Mikan no Report (Japan)","year":1996,"developer":"Data East Corporation","url":"e#Tantei%20Jinguuji%20Saburou%20-%20Mikan%20no%20Report%20%28Japan%29.zip","filesize":402192101,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Japanese-style adventure > Menu structures > Contemporary > Detective / mystery > Thriller","desc":"<p><em>Tantei Jingūji Saburō ~ Mikan no Rupo</em> is a Japanese style adventure game in the detective/mystery genre. It is the 5th game in the Jake Hunter / Tantei Jingūji Saburō series, being released between <em>Toki no Sugiyuku Mama ni... (1990)</em> and <em>Yume no Owari ni (1998)</em>. While following the same formula of the previous titles, the game features a \"Zapping System\", allowing the player to see the story from the perspective of other characters as well as Jingūji. Also featured in this title is car chase and following suspects in the form of 3D mini-games, although these features would rarely be seen again in future releases.</p><p>One day, an air mail arrives in Jingūji's office. The sender was a drinking friend of Jingūji's named Ikegami, the package contained a key that seemed to be from a coin locker. As the detective investigates cases of missing persons, drug dealings, and murders, the mystery of the key is gradually revealed. Now the famous detective has to follow the leads left by his friend and avoid the traps cleverly set by his enemies.</p>"},{"name":"Tantei Jinguuji Saburou: Yume no Owari ni (Japan)","year":1998,"developer":"Data East Corporation","url":"e#Tantei%20Jinguuji%20Saburou%20-%20Yume%20no%20Owari%20ni%20%28Japan%29%20%283M%29.zip","filesize":514074277,"score":"","genres":"Adventure > Cinematic camera > Anime / Manga > Japanese-style adventure > Direct control > Japan (Modern/Futuristic) > Crime > Detective / mystery","desc":"<p><em>Tantei Jingūji Saburō: Yume no Owari ni</em> (literally translated as <em>Detective Jingūji Saburō: To the End of Dream</em>) is the 6th entry in the Jake Hunter series.</p><p>In this game, Jingūji is tormented by hideous dreams of his past in New York. One day, he helped Nagata Yuka, a high-school friend of his assistant Yōko Misono, to solve the stalker problem. After he thought that he had already solved this case successfully, Nagata vanished. At the same time, a series of women missing cases were happening.</p>"},{"name":"Teitoku no Ketsudan III (Japan)","year":1996,"developer":"KOEI Co., Ltd.","url":"e#Teitoku%20no%20Ketsudan%20III%20%28Japan%29.zip","filesize":220478036,"score":7.1,"genres":"Simulation > Strategy > Top-down > Naval / watercraft > Historical events > World War II","desc":"<p>PTO II is a KOEI game that depicts the conflict between the USA and Japan during World War II. The player takes control of the Navy forces of both nation, and tries to outsmart each other.</p>"},{"name":"Tempest 2000","year":1996,"developer":"Atari Corporation"},{"name":"Ten Pin Alley","year":1997,"developer":"Adrenalin Entertainment"},{"name":"Tenchi Muyo!: Ryoohki - Gokuraku CD-ROM for Sega Saturn","year":1995,"developer":"Yumedia"},{"name":"Tenchi Muyo!: Toko Muyo","year":1997,"developer":"Xing Entertainment"},{"name":"Tengai","year":1996,"developer":"Psikyo"},{"name":"Tengai Makyou: Daishi no Mokushiroku - The Apocalypse IV (Japan) (Disc 1)","year":1997,"developer":"Red Company Corporation","url":"e#Tengai%20Makyou%20-%20Daishi%20no%20Mokushiroku%20-%20The%20Apocalypse%20IV%20%28Japan%29%20%28Disc%201%29.zip","filesize":500821981,"score":"","genres":"Role-playing (RPG) > 1st-person > Diagonal-down > Anime / Manga > Turn-based","desc":"<p>New Orleans, Louisiana, 1893. A boy named Rizing is exploring the surroundings of his hometown together with a couple of friends. They discover a mysterious old house, go inside, and discover what seems to be a mummy in a coffin. They don't realize that at this moment they unleashed a powerful demon into the world, and that this demon has already possessed the soul of one of the boys...</p><p><em>The Apocalypse IV</em> is the first <em>Tengai Makyō</em> game that is set outside of the Japan-like country Jipang. Much like Jipang of earlier games, United States of the late 19th century is not in a historically correct environment in this game, but an alternate world populated by demons, Biblical figures, and deliberate clichés (cardboard Native Americans, pop culture references, etc). </p><p>The gameplay largely follows the general Japanese RPG template and <em>Tengai Makyō</em> gameplay style in particular. As in the previous games, magic spells have to be sought out and acquired rather than learned or bought. A notable change is the absence of random enemies - all the enemies are visibly wandering on the world map or in the dungeons. Other gameplay additions include special attacks that can also performed by several members of the party as a combo, and obtaining money by selling trophies received in battles.</p>"},{"name":"Tengai Makyou: Daishi no Mokushiroku - The Apocalypse IV (Japan) (Disc 2)","year":1997,"developer":"Red Company Corporation","url":"e#Tengai%20Makyou%20-%20Daishi%20no%20Mokushiroku%20-%20The%20Apocalypse%20IV%20%28Japan%29%20%28Disc%202%29.zip","filesize":490924609,"score":"","genres":"Role-playing (RPG) > 1st-person > Diagonal-down > Anime / Manga > Turn-based","desc":"<p>New Orleans, Louisiana, 1893. A boy named Rizing is exploring the surroundings of his hometown together with a couple of friends. They discover a mysterious old house, go inside, and discover what seems to be a mummy in a coffin. They don't realize that at this moment they unleashed a powerful demon into the world, and that this demon has already possessed the soul of one of the boys...</p><p><em>The Apocalypse IV</em> is the first <em>Tengai Makyō</em> game that is set outside of the Japan-like country Jipang. Much like Jipang of earlier games, United States of the late 19th century is not in a historically correct environment in this game, but an alternate world populated by demons, Biblical figures, and deliberate clichés (cardboard Native Americans, pop culture references, etc). </p><p>The gameplay largely follows the general Japanese RPG template and <em>Tengai Makyō</em> gameplay style in particular. As in the previous games, magic spells have to be sought out and acquired rather than learned or bought. A notable change is the absence of random enemies - all the enemies are visibly wandering on the world map or in the dungeons. Other gameplay additions include special attacks that can also performed by several members of the party as a combo, and obtaining money by selling trophies received in battles.</p>"},{"name":"Tennis Arena","year":1998,"developer":"Smart Dog"},{"name":"Terra Cresta 3D (Japan)","year":1997,"developer":"Nihon Bussan Co., Ltd.","url":"e#Terra%20Cresta%203D%20%28Japan%29%20%282M%29.zip","filesize":300369353,"score":"","genres":"Action > Behind view > Top-down > Isometric > Arcade > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>This 3D sequel to Terra Cresta takes a simple, cut-down approach to shooting. Players blast off into space to take out waves of enemy spacecraft through several different levels. Most of the game is presented from an overhead view with a slightly tilted camera, giving the player a slightly longer view of the stage. A few stages switch the camera up to a chase camera, which is set behind the player's craft as they shoot at enemies as they fly towards the camera instead. There are three different craft, but unlike in most shooters players don't choose one at the beginning; instead, players can switch forms at any time to respond to the current situation. Unlike in most arcade-style shooters, there's no score whatsoever: the player's goal is simply to survive to the end of the game, not to reach any kind of high score.</p>"},{"name":"Terry Pratchett's Discworld","year":1996,"developer":"Teeny Weeny Games, Ltd.","url":"e#Terry%20Pratchett%27s%20Discworld%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":390507161,"score":7.9,"genres":"Adventure > 3rd-person (Other) > Graphic adventure > Puzzle elements > Point and select > Fantasy > Licensed","desc":"<p>This adventure game puts the player in the shoes of Rincewind, a wizard whose sole purpose in life is to stay alive. He appears to be very good at it as well, because apparently the universe has decided to continuously challenge him. The game takes place in the humorous fantasy world created by Terry Pratchett. The world is called the Discworld, as it is actually a flat disc carried on the backs of four gigantic elephants, which themselves stand on the back of an even larger turtle.</p><p>The story is loosely based on the novel \"Guards! Guards!\". Both in the book and the game, a dragon is summoned by a group of mysterious conspirators and now terrorizes the city state of Ankh-Morpork. Being the most expendable wizard of the Unseen University, Rincewind is given the task to get rid of the beast (only in the game though; in the book, the city's nightwatch has to deal with the problem).</p><p><em>Discworld</em> is a classical point-and-click adventure game with a few original features. For example, Rincewind's inventory is limited to two objects, and the majority of his belongings is stored in the Luggage, an intelligent chest with dozens of little feet. Furthermore, at a certain point in the game the player gains access to a time-traveling device and has to send Rincewind to the past and back in order to solve some of the puzzles.</p>"},{"name":"Tetris Plus","year":1996,"developer":"Jaleco Ltd.","url":"e#Tetris%20Plus%20%28Europe%29.zip","filesize":528704151,"score":6.8,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p>This is yet another updated version of Tetris which was released for PlayStation, Saturn, and Game Boy.  This version features Classic mode, Puzzle mode, Versus mode, and Edit mode.  In Puzzle mode, you must save the professor who climbs his way to the top.  In order to do that, you must clear the blocks away and bring him to the bottom.  Versus mode brings you head to head with another player.  Edit mode allows you to create and save your own custom levels.</p>"},{"name":"Tetris S (Japan)","year":1996,"developer":"UNiT Inc.","url":"e#Tetris%20S%20%28Japan%29.zip","filesize":122333842,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p><em>Tetris S</em> is the second of two Tetris games released for the Sega Saturn in 1996. Unlike the arcade port Tetris Plus which was released a few months earlier, it was specifically made for the console. This version includes a single player mode as well as multiplayer against an AI or between two human players. </p><p>The single player mode works like traditional Tetris and uses the same rotation rules as Sega's earlier arcade game conversions. Like always the player guides blocks down a well with the aim of creating lines at the bottom. These lines are then removed and the player earns points. The game ends when the blocks reach the top of the well, but in this version there is a continue option allowing the player to keep playing at the current level. The multiplayer works the same way but with one difference: if more than one line is removed the opponent's next few blocks will fall at a greater pace. The number of lines removed affects how many blocks will be sped up. A multiplayer game is played over a set number of matches and the aim is simply to stay alive longer than the opponent.</p>"},{"name":"Theme Park","year":1995,"developer":"Bullfrog Productions, Ltd.","url":"e#Theme%20Park%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CSv%29.zip","filesize":211927645,"score":7.8,"genres":"Strategy > Diagonal-down > Free-roaming camera > Real-time > City building / construction simulation > Managerial / business simulation > Point and select","desc":"<p>Dominating the exciting world of Theme Park ownership is your goal in this strategy game from Bullfrog. The first task is to set up your rides within the available land, structuring convenient paths and queues and ideally leaving some space for bigger rides once they become available, and include some lakes and trees to increase the park's allure. Rides range from Teacups and Haunted Houses to the biggest most elaborate roller-coaster you can design, and water rides that loop around other rides.</p><p>Shops must also be included so that the visitors can buy food, drinks, and souvenirs - the cunning player will combine salt, sugar, and caffeine settings to maximize consumer interest. Staff must be hired to keep everything running smoothly, and they will only work for what they consider a fair rate of pay.</p><p>You are competing against other Theme Parks, so don't let them get an advantage over you - monitor your success in attracting customers and financial viability closely using the supplied statistics pages. More important, ensure that research is adequately funded to produce new rides.</p><p>It can be played in three modes - Sandbox level lets you concentrate on the park design elements, while Sim and Full add more strategic features.</p>"},{"name":"Three Dirty Dwarves","year":1996,"developer":"Appaloosa Interactive Corporation","url":"e#Three%20Dirty%20Dwarves%20%28Europe%29.zip","filesize":383669838,"score":6.6,"genres":"Action > 3rd-person (Other) > Side view > Beat 'em up / brawler > Fantasy","desc":"<p><em>Three Dirty Dwarves</em> is a side-scrolling action game with an interesting plot: genetically altered \"super kids\" playing <em>Dungeons &amp; Dragons</em> open a portal that allows their \"alter-egos\" (the three dirty dwarves) to enter our world and try to rescue them from their evil Army Base captivity.</p><p>Once the dwarves arrive, they ransack the local \"armory\" (a sporting goods store) for weapons and set off to rescue the kids. The portal also lets in a number of fantasy bad guys too and they must be squashed on the way.</p><p>The main game mechanics allows the player to switch between each dwarf and uses its special attack (e. g. baseball bat and baseballs, bowling pins and bowling balls, and a shotgun). Additionally, there is the DwarfMorph\" attack where the dwarves act as one.</p>"},{"name":"Thunder Force V (Japan)","year":1997,"developer":"Technosoft Co., Ltd.","url":"e#Thunder%20Force%20V%20%28Japan%29.zip","filesize":513011311,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The first installment in the Thunder Force series made for 32-bit consoles. As a pilot for the Thunder Force group, it's up to you to destroy an evil alien race bent on destroying the Earth and all of its inhabitants. As in its predecessors, the gameplay is fast and furious, with more powerful weapons. All weapons now have an extra powerful blast mode, triggered by holding down the fire button. Sprites have been forfeited in favour of 2D polygons made possible by the new platform. The musical score contains a lot of techno rearrangements of old Thunder Force themes. In spite of all the changes, Thunder Force V aims to please fans of old-schoolers by not abandoning concepts and details introduced in earlier games in the series.</p>"},{"name":"Thunder Force V (Special Pack)","year":1997,"developer":"Technosoft Co., Ltd."},{"name":"Thunder Force: Gold Pack 1","year":1996,"developer":"Technosoft Co., Ltd."},{"name":"Thunder Force: Gold Pack 2","year":1996,"developer":"Technosoft Co., Ltd."},{"name":"Thunderstrike 2","year":1995,"developer":"Core Design Ltd.","url":"e#Thunderstrike%202%20%28USA%29.zip","filesize":425173742,"score":7.8,"genres":"Action > Simulation > 1st-person > 3rd-person (Other) > Helicopter > Vehicular combat","desc":"<p>This is the sequel to Core's Sega CD game, AH-3 Thunderstrike. Like the previous game in the series, this is a helicopter simulator/shooter. It features realistic features like multiple weapons selection, full freedom of movement, and a mission-based structure. On the other hand, it also throws lots and lots of enemy tanks and helicopters at you to blow up.</p><p>The graphics in Thunderstrike 2 are drawn completely with 3D polygons, including the helicopter's cockpit. As you track an enemy, the view changes so that it is always in your sights. There are 8 campaigns to complete, each with multiple missions.</p>"},{"name":"Tilt!","year":1996,"developer":"NMS Software Ltd.","url":"e#Tilt%21%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":196356312,"score":7.8,"genres":"Action > Arcade > Pinball","desc":"<p>Tilt! is a pinball game. The 6 pinballs you can play in the 3D full screen-modus or in the classic 2D scroll-modus. The themes of the pinballs are Science Fiction (Star Quest), Horror (Monster), Racing (Road King), Underworld (Gangster), Fantasy (Myst &amp; Majik) and Fair (Funfair). Every pinball has multi-ball gaming, animations (esp. ball-locks) during the game and intermezzos in the scoring field.</p>"},{"name":"Time Commando (Japan)","year":1998,"developer":"Adeline Software International","url":"e#Time%20Commando%20%28Japan%29.zip","filesize":460790118,"score":7.7,"genres":"Action > 3rd-person (Other) > Puzzle elements > Fantasy > Sci-fi / futuristic","desc":"<p>In the near future, the military has created an advance computerized combat simulation, which allowed participants to be trained in various forms of combat throughout human history. However, a programmer working for a corporation that seeks the downfall of the simulation developers infects the system with a virus. This virus creates a dimensional vortex that threatens to swallow the entire world. Stanley Opar, a member of S.A.V.E (Special Action for Virus Elimination) enters the vortex with one goal: destroy the virus before the universe ceases to exist.</p><p><em>Time Commando</em> is an action game with light puzzle-solving elements. The player character travels to eight different time periods: Prehistoric, Roman Empire, Feudal Japan, Medieval, Conquistador, Wild West, Modern Wars, and Future. Each era has its own characteristic enemies and sets of weapons: for example, Stanley fights with rocks and bone knives in the Prehistoric era, switching to shurikens and katanas in Japan, revolvers and shotguns in the Wild West, laser pistols in the future, etc. </p><p>Most of the time in the game is spent fighting enemies. Character navigation and combat resemble those of Alone in the Dark. The navigation is character- rather than camera-based, similarly to survival horror games. During combat, Stanley has three attack moves at his disposal, as well as a blocking move. Part of the challenge relies on choosing the right weapons against particular enemies. </p><p>Stanley starts with a small life bar that can be increased by picking up life power-ups, as well as multiple lives. Time limit is imposed on each level. To lower the countdown, the player has to deposit computer chips collected throughout the levels in special orb pools. The game utilizes animated pre-rendered sequences to represent locations, and polygonal models for the characters.</p>"},{"name":"Time Gal & Ninja Hayate","year":1997,"developer":"Taito Corporation"},{"name":"TNN Motor Sports HardCore 4X4","year":1997,"developer":"Gremlin Interactive Limited","url":"e#TNN%20Motor%20Sports%20HardCore%204X4%20%28USA%29.zip","filesize":304816749,"score":6.3,"genres":"Racing / Driving > Sports > Behind view > Direct control > Off-roading > Licensed","desc":"<p>TNN Motorsports Hardcore 4x4 is an off road racing game. You drive a 4x4 like a Jeep or pickup truck around cross-country loops and attempt to get to the finish line first.  There are three race types.  In single race mode you participate in only one race on a track of your choice against 5 other competitors.  Championship allows you to race through all 6 courses in a row in an attempt to win a hidden truck.  Time trial lets up to 8 players compete round-robin style for the fast lap time around a track.</p><p>This game utilizes 3D environments and truck models. The sound track features hard rock music.</p>"},{"name":"Tokimeki Mahjong Paradise: Koi no Tenpai Beat (Japan)","year":1995,"developer":"","url":"e#Tokimeki%20Mahjong%20Paradise%20-%20Koi%20no%20Tenpai%20Beat%20%28Japan%29.zip","filesize":317692419,"score":"","genres":"Strategy > Fixed / flip-screen > Anime / Manga > Turn-based > Cards / tiles > Turn-based strategy > Direct control > Japan (Modern/Futuristic) > Adult","desc":"<p><em>Tokimeki Mahjong Paradise: Koi no Tenpai Beat</em> is a Mahjong tile-based game with two game modes. The Date Mode has the player competing against five girls to win their hearts. Each time they lose a match, the girls strip of some of their clothing in a cutscene, but whenever the player loses, they refuse any further favors. The Free Play allows the player to practice the game without any rewards for winning or consequences for losing.</p>"},{"name":"Tokimeki Memorial Drama Series Vol. 1: Nijiiro no Seishun (Japan)","year":1997,"developer":"Konami Co., Ltd.","url":"e#Tokimeki%20Memorial%20Drama%20Series%20Vol.%201%20-%20Nijiiro%20no%20Seishun%20%28Japan%29.zip","filesize":521482551,"score":"","genres":"Adventure > Sports > 1st-person > Anime / Manga > Visual novel > Football (European) / Soccer","desc":"<p><em>Nijiiro no Seisyun</em> (虹色の青春) if the first story in the <em>Tokimeki Memorial Drama Series</em> trilogy which takes place within the same years of school life depicted in the original Tokimeki Memorial: Forever with You, but focuses on a shorter time period. Each of the three games features different protagonist who are all childhood friends of Shiori Fujisaki, the main heroine from the <em>Tokimeki Memorial</em> series. Player can enter the name of the protagonist at the beginning of the game, or accept the default one.</p><p>In this, first story, the protagonist is a high-school sophomore who is member of a soccer club. As substitute player he doesn't get much chance to play, but is secretly practicing in order to gain skill level and show his teammates and the coach why he should play. Luckily for him, he's not alone, as the manager on the team, Saki Nijino, is supporting him in his training. Unlike visual novel gameplay style, which is also present, you can often move mouse cursor around the screen to interact with objects (i.e. look, take, throw, etc.) and characters (.e. look, talk, call to, etc.), and while talking to characters there will be various topics and sub-topics you can talk about. Beside adventure style gameplay, the game also features soccer mini-games which requires you to kick the ball at the designated target to score a point. That gameplay elements is most similar to golf games, where you adjust the point where you want to kick the ball and use a power-bar to select the intensity of your kick.</p>"},{"name":"Tokimeki Memorial Drama Series Vol. 2: Irodori no Love Song (Japan) (Disc 1)","year":1998,"developer":"Konami Computer Entertainment Japan Co., Ltd.","url":"e#Tokimeki%20Memorial%20Drama%20Series%20Vol.%202%20-%20Irodori%20no%20Love%20Song%20%28Japan%29%20%28Disc%201%29%20%282M%29.zip","filesize":489699887,"score":"","genres":"Action > Adventure > 1st-person > 3rd-person (Other) > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Mini-games > Visual novel > Romance","desc":"<p><em>Irodori no Love Song</em> is the second game in the <em>Tokimeki Memorial Drama Series</em> which centers around another heroine from the <em>Tokimeki Memorial</em> franchise, namely Ayako Katagiri. The game takes place during the season of autumn in the same high-school during the culture festival. The protagonist is an amateur yet popular guitarist in the school who wrote an original song for festival competition. He forgot his encounter in the past with Ayako, but the more fate brings them back together, the more he will start to remember, and his feelings will turn into a love song.</p><p>The game mostly plays as a visual novel with adventure elements such as selecting actions to perform (i.e. see, talk, etc.), but also includes several action mini-games such as guitar game, comic dialogue game, knitting game, and swimming game. While game supports both gamepad controller and mouse, some of the mini-games (namely guitar game and knitting game) do not support mouse controller.</p>"},{"name":"Tokimeki Memorial Drama Series Vol. 2: Irodori no Love Song (Japan) (Disc 2)","year":1998,"developer":"Konami Computer Entertainment Japan Co., Ltd.","url":"e#Tokimeki%20Memorial%20Drama%20Series%20Vol.%202%20-%20Irodori%20no%20Love%20Song%20%28Japan%29%20%28Disc%202%29%20%282M%29.zip","filesize":524131352,"score":"","genres":"Action > Adventure > 1st-person > 3rd-person (Other) > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Mini-games > Visual novel > Romance","desc":"<p><em>Irodori no Love Song</em> is the second game in the <em>Tokimeki Memorial Drama Series</em> which centers around another heroine from the <em>Tokimeki Memorial</em> franchise, namely Ayako Katagiri. The game takes place during the season of autumn in the same high-school during the culture festival. The protagonist is an amateur yet popular guitarist in the school who wrote an original song for festival competition. He forgot his encounter in the past with Ayako, but the more fate brings them back together, the more he will start to remember, and his feelings will turn into a love song.</p><p>The game mostly plays as a visual novel with adventure elements such as selecting actions to perform (i.e. see, talk, etc.), but also includes several action mini-games such as guitar game, comic dialogue game, knitting game, and swimming game. While game supports both gamepad controller and mouse, some of the mini-games (namely guitar game and knitting game) do not support mouse controller.</p>"},{"name":"Tokimeki Memorial Drama Series Vol. 3: Tabidachi no Uta (Japan) (Disc 1)","year":1999,"developer":"Konami Computer Entertainment Japan Co., Ltd.","url":"e#Tokimeki%20Memorial%20Drama%20Series%20Vol.%203%20-%20Tabidachi%20no%20Uta%20%28Japan%29%20%28Disc%201%29.zip","filesize":502457044,"score":"","genres":"","desc":""},{"name":"Tokimeki Memorial Drama Series Vol. 3: Tabidachi no Uta (Japan) (Disc 2)","year":1999,"developer":"Konami Computer Entertainment Japan Co., Ltd.","url":"e#Tokimeki%20Memorial%20Drama%20Series%20Vol.%203%20-%20Tabidachi%20no%20Uta%20%28Japan%29%20%28Disc%202%29.zip","filesize":506094773,"score":"","genres":"","desc":""},{"name":"Tokimeki Memorial Selection: Fujisaki Shiori (Japan)","year":1997,"developer":"Konami Co., Ltd.","url":"e#Tokimeki%20Memorial%20Selection%20-%20Fujisaki%20Shiori%20%28Japan%29.zip","filesize":472607699,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Full Motion Video (FMV) > Visual novel","desc":"<p>This is a spin-off from the main <em>Tokimeki Memorial</em> game series with main focus on Shiori Fujisaki, the main heroine from the original Tokimeki Memorial game.</p><p>Gameplay-wise, the game contains four really shot date visual novels, one for each season (spring, summer, fall and winter) and a rock-paper-scissors mini-game you can play with Shiori. The mini-game rules are like this: the one who wins the rock-paper-scissors game points toward left or right and the one that lost has to look in the right direction or losses a point. The winner is the one who first gets three points. The game features full voice-acting for Shiori whenever she is talking on the screen, whether in visual novels, mini-game or various extras.</p><p>Extras consist of two music video which use animated Shiori incorporated on the live animated backdrops. Videos mostly show sea and nature, as well as some rural and known Japanese cities such as Yokohama. The portrait collection contains over a dozen of scrollable portraits of Shiori in various different outfits and locations. The voice collection includes various words and sentences you can hear Shiori say upon selection. Shiori's mini-character is walking around the screen and stops to say to selected word or a sentence.</p>"},{"name":"Tokimeki Memorial: Forever with You","year":1996,"developer":"Konami Computer Entertainment Tokyo Co., Ltd."},{"name":"Tokyo Highway Battle","year":1997,"developer":"Genki Co., Ltd."},{"name":"Tomb Raider","year":1996,"developer":"Core Design Ltd.","url":"e#Tomb%20Raider%20%28Europe%29.zip","filesize":387547400,"score":7.8,"genres":"Action > Behind view > Platform > Puzzle elements > Direct control","desc":"<p>Lara Croft is a Tomb Raider, an archaeologist who explores ancient sites in search of valuable artifacts, who is hired to retrieve an artifact from a tomb in Peru, which turns out to be one of three parts of the Atlantean Scion. Soon betrayed by her employer, Lara Croft travels to Greece, Rome and Egypt to recover the other parts before this powerful device falls into the wrong hands.</p><p><em>Tomb Raider</em> is a 3D action game with platforming and puzzle-solving elements, in which players control Lara Croft from a third-person perspective. The camera follows Lara as she climbs, jumps, and swims through detailed environs overcoming environmental obstacles and deadly fauna. Moving through levels often involves finding spots where Lara can climb, looking for spots where Lara can use her acrobatic ability, and sliding blocks and pushing levers to solve puzzles and open passageways.</p><p>Lara is armed with twin pistols with infinite ammunition, but she can pick up higher caliber weapons to take on deadlier human opponents. Lara also comes across restorative health packs and has a compass with which she can orient herself. Lara’s opponents include animals, gunmen, as well as primeval and supernatural beings. Careful explorers can also find secret areas and avoid traps.</p>"},{"name":"Top Shop","year":1998,"developer":"KID Corp."},{"name":"Torico (Disc 1)","year":1996,"developer":"System Sacom","url":"e#Torico%20%28Europe%29%20%28Disc%201%29.zip","filesize":564011173,"score":7.2,"genres":"Adventure > 1st-person","desc":"<p>A traveler named Fred has lost his memory. The only thing that gives him a clue to his past is a mysterious tattoo on his forehead that leads him to a strange place called City of Mists. Wandering through the bizarre locations of the town, Fred has to reveal the secret that leads to his past and to stop the evil plans of the maniacal Lord Gordon.</p><p><em>Lunacy</em> is a first-person adventure of the  Myst school, with a simple interface and many complex puzzles.</p>"},{"name":"Torico (Disc 2)","year":1996,"developer":"System Sacom","url":"e#Torico%20%28Europe%29%20%28Disc%202%29.zip","filesize":580483482,"score":7.2,"genres":"Adventure > 1st-person","desc":"<p>A traveler named Fred has lost his memory. The only thing that gives him a clue to his past is a mysterious tattoo on his forehead that leads him to a strange place called City of Mists. Wandering through the bizarre locations of the town, Fred has to reveal the secret that leads to his past and to stop the evil plans of the maniacal Lord Gordon.</p><p><em>Lunacy</em> is a first-person adventure of the  Myst school, with a simple interface and many complex puzzles.</p>"},{"name":"Touge King the Spirits (Japan)","year":1995,"developer":"SIMS Co., Ltd.","url":"e#Touge%20King%20the%20Spirits%20%28Japan%29.zip","filesize":339542035,"score":"","genres":"","desc":""},{"name":"Touge King the Spirits 2 (Japan).zip","year":1997,"developer":"SIMS Co., Ltd.","url":"e#Touge%20King%20the%20Spirits%202%20%28Japan%29.zip","filesize":480502814,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>As a sequel to Tōge King: The Spirits, this game continues in the same vein of fast racing over the dangerous ridges and mountain tops. The game expands on the first one adding more details and additional content. Game contains only three courses consisting of curved and challenging Japanese mountain roads, plus they can be played in various seasons which requires a whole new driving tactic. Main racing modes include \"King Battle\" (main mode where you have to prove yourself to be the king and win all the races), \"Free Battle\" (one player mode where you can select your rival and your car and test your skill), \"VS Battle\" (a two-player mode where you can play against your friend in a split-screen view), and \"Training\" (which offers Time Attack, Free Driving and Dricon where you get rewarded based on your drifting skill).</p>"},{"name":"Touryuu Densetsu: Elan Doreé","year":1999,"developer":"Sai-Mate"},{"name":"Tower, The (Japan)","year":1996,"developer":"OPeNBooK Co., Ltd.","url":"e#Tower%2C%20The%20%28Japan%29.zip","filesize":299163179,"score":7,"genres":"Simulation > Side view > Managerial / business simulation","desc":"<p>Maxis takes their Sim-building line vertical with SimTower, an original concept from Japan (where vertical living is much more commonplace than in many parts of the world). </p><p>Your goal is to build a skyscraper that is both tall, aesthetically pleasing, popular, and, most importantly, economically profitable. To be successful, your building cannot just be endless levels of office space or purely an apartment sky-rise, but rather a multi-functional haven for humanity featuring everything from penthouses to theatres, restaurants to shopping malls. The centerpiece of your tower design is your elevators and proper management is key.</p><p>You can watch your Sims enter and leave your grand tower, getting impatient waiting for elevators, or having a hectic workday at the office. You can even train in on one or two, to serve as a metering stick for their compatriots, or just to peek into the average workday of the little people living in your building. Or watch the security and rescue crews race as disasters like bomb threats and fires rampage through your well-crafted skyscraper.</p><p>The PlayStation version adds an additional bonus map.</p>"},{"name":"Transport Tycoon","year":1997,"developer":"Chris Sawyer Productions"},{"name":"Trash It","year":1997,"developer":"Rage Software Ltd.","url":"e#Trash%20It%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":485227939,"score":6.7,"genres":"Action > Diagonal-down > Side view","desc":"<p><em>Trash It</em> is an arcade action game where player(s) have to destroy buildings with a gigantic hammers. As a player, you take a role of construction worker who has only one mission: To smash everything to bits.Pieces are flying and houses falling as players hack their way through levels and earning points as they go.</p>"},{"name":"Triad Stone","year":1995,"developer":"Data East Corporation"},{"name":"True Pinball","year":1996,"developer":"Digital Illusions CE AB","url":"e#True%20Pinball%20%28Europe%29.zip","filesize":541051360,"score":7.3,"genres":"Simulation > Top-down > Isometric > Arcade > Pinball","desc":"<p><em>True Pinball</em> is a console version of Pinball Illusions that has 4 different tables, named \"Extreme Sports\", \"Vikings - The Tales\", \"Ricochet\" and \"Babewatch\".</p><p>Both 2D and 3D views (not available in computer versions) are available and over 32,000 colors in high resolutions boost it visually.</p>"},{"name":"Tryrush Deppy","year":1996,"developer":"System Supply N‑Tech"},{"name":"Tunnel B1","year":1997,"developer":"NEON Software GmbH","url":"e#Tunnel%20B1%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":325019817,"score":6.8,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>You are on a mission to destroy the ultimate weapon of your enemy. This involves travelling through a set of precarious tunnels in your high-tech hover-craft. The tunnels are filled with enemy vehicles, choppers and sentry guns which you have to take out or avoid. To make life even worse, a lot of sections require you to clear them in a given time limit. The only good thing is that you'll be able to upgrade your weaponry often.</p>"},{"name":"Twin Cobra II","year":1997,"developer":"Takumi Corporation"},{"name":"Twinkle Star Sprites","year":1997,"developer":"ADK Corporation"}]