[{"name":"UEFA Euro 96: England","year":1995,"developer":"Gremlin Interactive Limited","url":"e#UEFA%20Euro%2096%20-%20England%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":259061181,"score":6.9,"genres":"Sports > Diagonal-down > Direct control > Football (European) / Soccer > Europe > Licensed","desc":"<p>An official licensed game of the European Championships held in England in 1996. All 16 teams are available to choose from and the following Game Types: European Championship, Friendly Game, Practice Penalties and Practice Match (only the opposition's goalkeeper is on the pitch). </p><p>A couple of options of note are variable/adjustable wind and a choice of referees each with two difficulty levels of 'vision' and 'discipline' (the latter is available for friendly games only). Long time BBC sport commentator Barry Davies provides the commentary. The game is based on Gremlin Interactive's Actua Soccer engine.</p>"},{"name":"Ultimate Mortal Kombat 3","year":1996,"developer":"Midway Manufacturing Company","url":"e#Ultimate%20Mortal%20Kombat%203%20%28Europe%29.zip","filesize":347567590,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p><em>Ultimate Mortal Kombat 3</em> combines the best of all the Mortal Kombats into a single cartridge. 23 playable characters are immediately available, such as Reptile, Cyrax, Scorpion, Sub-Zero, Jax, Katana, Sonya, and more. There are two bosses that are unlockable, as well as additional characters.</p><p>There is a variety of new levels, some of which are interactive. Characters can uppercut someone, causing them to hit the ground hard and crash through to the bottom floor, or they can knocked someone off a bridge, landing in a pit of spikes.</p><p>Players can go against the computer one-on-one, two-on-two, or take part in the 8-fighter tournament.</p><p>The DS version has a wireless one-one-one multiplayer mode and includes the Puzzle Kombat mini-game from Mortal Kombat: Deception.</p>"},{"name":"Unsolved, The","year":1997,"developer":"Japan Media Programming Inc."}]