[{"name":"Valora Valley Golf","year":1995,"developer":"T&E Soft, Inc.","url":"e#Valora%20Valley%20Golf%20%28Europe%29.zip","filesize":279621660,"score":7.2,"genres":"Sports > Behind view > Golf","desc":"<p><em>Valora Valley Golf</em> is an exaggerated approach to the world of golf. While it does feature traditional golf course hazards like water hazards and bunkers, lava pits and greens on top of a mountain are also present.</p><p>The courses range from basic-looking golf courses with long fairways where the player can drive the ball 450 yards in one shot and giant water hazards to ancient ruins and a course inside of a volcano.</p><p>The controls are simplistic, click one time to bring up a meter, click again to set the angle, and once more for how much power to drive the ball with special shots are obtained at the end of the meter. It doesn't feature any real-life golfers or courses.</p>"},{"name":"Vandal Hearts","year":1997,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"sega-saturn-champion-collection-updated/V/Vandal%20Hearts%20-%20Ushinawareta%20Kodai%20Bunmei%20%28English%20Translated%2C%20Rev%201.5%29.zip","filesize":415389235,"score":7.7,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Turn-based > Tactical RPG > Fantasy","desc":"<p><em>Vandal Hearts</em> is a turn-based strategy RPG. It follows a fixed plot-line with set battles, focusing more on strategic elements than adventure elements. </p><p>The combat takes place in a series of 3D grid based maps and each character in the party has a certain amount of movements they can perform each turn. As the game progresses, other characters join and leave the party and as they increase in level they can progress along different paths of development. Between each battle there is a cut scene that develops the plot using the same 3D engine as the combat (and often the same areas).</p><p>In between battles you have the opportunity to talk to people in cities as well as purchase different equipment for the up coming battles.</p>"},{"name":"Vegas Casino","year":1997,"developer":"Coconuts Japan Entertainment Co., Ltd."},{"name":"Victory Boxing","year":2000,"developer":"Pegasus Japan Corp.","url":"e#Victory%20Boxing%20%28Europe%29.zip","filesize":129190339,"score":6.7,"genres":"Sports > 1st-person > 3rd-person (Other) > Boxing","desc":"<p>Contender 2 is an arcade-style boxing game. It does not claim to be a realistic simulation in any way. It is meant to be easy to pick up and learn. It boasts a starting cast of about 10 characters with about 10 other secret characters that can be unlocked by playing throgh the single-player Main Event mode. Each character has a standard set of punches, a set of special punches specific to each character, and a special 5-punch combo attack. </p><p>There are two play modes, Main Event and Exhibition. Main Event is a single-player career mode. When playing through Main Event mode, you only start with one special punch and you get trained to learn the other special punches as you win matches. In Exhibition you can pit any two unlocked fighters against each other in a one player or two player match.</p>"},{"name":"Victory Goal","year":1995,"developer":"Team Aquila","url":"sega-saturn-champion-collection-updated/V/Victory%20Goal%20%28JP%29.zip","filesize":497627202,"score":7.3,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p><em>Victory Goal</em> is the club-only older brother of Sega International Victory Goal. That makes it not only the first game of the series, but also the first game of the series to include clubs, in this case those of the Japanese J.League. It is also the first one to include real player names, since it is an officially licensed product. </p><p>Regarding other aspects, such as gameplay, graphic engine, cameras, etc, everything is exactly like in <em>Sega International Victory Goal</em>, which was in fact supposed to be an worldwide-friendly version of its older brother. As such it was released once the SEGA Saturn had been introduced in all Western markets, unlike this title, which was in fact one of the first titles for the Japanese catalog.</p>"},{"name":"Virtua Cop (2S)","year":1995,"developer":"AM R&D Dept. #2","url":"e#Virtua%20Cop%20%28Europe%29%20%282S%29.zip","filesize":433125852,"score":7.7,"genres":"Action > 1st-person > Arcade > Rail shooter","desc":"<p><em>Virtua Cop</em> is a light gun rail shooter and first game in the series. Cast as one of two brave cops, players are charged with bringing down an evil crime syndicate that is running riot in some unspecified town. </p><p>Dropped into a series of locations, one or two players must arm up and shoot their way through three death filled levels, in an attempt to restore peace and order. Played from a first person perspective view, players can use keys or joypad, to aim and fire at the multitude of sharp shooters who come gunning for them.Starting the game armed with just a trusty old six-shooter, players can pick up more powerful, state-of-the-art weapons -- such as machine guns and shotguns -- as they progress. As these are hidden away in crates and the like, finding these weapons is an important part of the game and they can give players extra firepower when they most need it. In particular, such weapons can be extremely useful when trying to take on the customary end-of-level bosses. Made of stern stuff, you'll need all the help you can get in dispatching them off to hell.</p>"},{"name":"Virtua Cop 2","year":1996,"developer":"AM R&D Dept. #2","url":"e#Virtua%20Cop%202%20%28Europe%29.zip","filesize":300462742,"score":7.7,"genres":"Action > 1st-person > Arcade > Rail shooter > Direct control","desc":"<p><em>Virtua Cop 2</em> is a light gun rail shooter like its predecessor Virtua Cop. The player assumes the role of a police officer and is sent after criminals, from subways and a bank to aboard helicopters.</p><p>It follows the same gameplay pattern of its predecessor and is played from a first person perspective. The game moves the player automatically, although the player can find hiding places to shoot from a safe angle. The main task is to aim and fire the cop’s weapon so as to take out the bad guys for points. Avoid the innocents, as shooting them costs the player points. The enemies have tougher firepower than in the original and the game can be played solo or with a friend.</p>"},{"name":"Virtua Cop Special Pack","year":1998,"developer":"AM R&D Dept. #2"},{"name":"Virtua Fighter","year":1994,"developer":"SEGA-AM2 Co., LTD.","url":"e#Virtua%20Fighter%20%28USA%29.zip","filesize":523178376,"score":8.3,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > Martial arts","desc":"<p><em>Virtua Fighter</em> is considered one of the progenitors of one-on-one fighting games with fully 3D environments and characters. The fighters and arenas are rendered in flat-shaded polygons. Unlike many fighting games, Virtua Fighter focuses on gameplay based on actual fighting styles, rather than outrageous special moves and storylines.</p><p>There are eight fighters to choose from in Virtua Fighter, and an equal number of fighting backdrops in which to compete. Each fighter has a distinctive fighting style, and their own set of signature moves.</p>"},{"name":"Virtua Fighter 2 (Made in USA)","year":1995,"developer":"SEGA-AM2 Co., LTD.","url":"e#Virtua%20Fighter%202%20%28Europe%29%20%28Made%20in%20USA%29.zip","filesize":573986982,"score":8,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Martial arts","desc":"<p>One year after after the first tournament Akira, Wolf, Pai, Jeffry, Kage, Jacky, Sarah and defending champion Lau are invited to the World Fighting Tournament, and are joined by the master of drunken Kung-Fu Shun-di, who wants to prove he's more than an old geezer and Lion Rafale, who's fighting for his freedom. Each fighter has his own style, from the lightning fast attacks of Pai to the powerful slams of Jeffry.</p><p>Home port of Sega's popular Model 2A arcade vs. fighter released in 1995. Game modes include classic arcade mode, 2P vs mode, Expert mode (where the computer character progressively learns and counters players' technique), Ranking Mode (similar to Arcade, but at the end, a fighting style analysis is shown based on number of specials and time to knock down an opponent), Team Battle Mode (two teams composed of five fighters go against each other, the first to beat five characters being the winner) and Watch mode (allows choosing two fighters and then see them fighting). Both VF2 and VF2.1 (a tweaked version available only in Japan) modes are included. Gameplay keeps the same style from the first game, adding more moves to each fighters' roll. Using a three-key layout (block, kick and punch, being possible to assign button combinations to the extra keys) the player is able to control their fighter, aiming to knock or push the opponent outside the rink inside the time limit. Combo moves range from the quickest, which require the player to push up to five buttons quickly, to strong moves that require more button presses along d-pad nudges to be successful. As with the previous game, fighting is realistic (except the physics-defying leaps), and each fighter has nothing but their body to harm the opponent.</p><p>While in comparison with the arcade version some parts took a hit on graphical quality (such as the texture details and backgrounds), the game uses the Saturn High-Resolution mode and flowing 60-fps  to bring the arcade experience home.</p>"},{"name":"Virtua Fighter Kids","year":1996,"developer":"SEGA-AM2 Co., LTD.","url":"e#Virtua%20Fighter%20Kids%20%28Europe%29.zip","filesize":460347031,"score":7.5,"genres":"Action > 3rd-person (Other) > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p><em>Virtua Fighter Kids</em> is a modified version of Virtua Fighter 2 for the Sega Saturn. All characters were left the same, but the difference is that they are no longer adults but kids with traditional anime huge heads and short arms and legs.</p><p>A variety of new features has been added to increase the gameplay such as the ability to program specified moves for each character or new endings.</p>"},{"name":"Virtua Fighter Remix","year":1995,"developer":"Sega AM1 R&D Division","url":"e#Virtua%20Fighter%20Remix%20%28Europe%29.zip","filesize":524523858,"score":8.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Fantasy > Martial arts","desc":"<p>Akira Yuki, the only active master of the powerful Kung Fu technique known as Hakkyoku ken (“The Eight Point Fist\") travels the world in search of enlightenment and worthy opponents. He has found them in in the World Fighting Tournament, where the strongest fighters determine who the master of hand-to-hand combat is. All techniques are allowed as long as the contestants use no weapons but their own bodies.</p><p>After weeks of trials, only seven other warriors remain:Sarah Bryant and her brother Jacky, Lau Chan and his daughter Pai, Jeffry McWild, Wolf Hawkfield and the ninja Kagemaru.</p><p>Virtua Fighter PC (aka - Virtua Fighter PC Remix) is an enhanced port of Sega's arcade hit Virtua Fighter. It features the original characters and stages with higher polygon counts and texture mapping (a la Virtua Fighter 2) and various minor gameplay tweaks.</p>"},{"name":"Virtua Racing","year":1995,"developer":"SEGA-AM2 Co., LTD.","url":"e#Virtua%20Racing%20%28Europe%29.zip","filesize":239772104,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view","desc":"<p>Virtua Racing is a polygon-based racing game in which you must beat an opponent, who is either human or computer controlled. In the conversion to the Saturn, many new features were added:</p><ul><li>7 new tracks, which brings the total number of tracks in the game to 10.</li><li>4 new cars, which brings the total number of cars in the game to 5. The new cars are a go-kart, a Porsche 911, an F-160 racer, and a GTP-class car.</li><li>A new Grand Prix mode. The Grand Prix mode is a career simulation. You must work your way up from one class of vehicle to next be accumulating points in a series of races.</li></ul>"},{"name":"Virtual Casino","year":1996,"developer":"Digital Factory Inc.","url":"e#Virtual%20Casino%20%28Japan%29.zip","filesize":389143034,"score":"","genres":"Gambling > 1st-person > Cards / tiles","desc":"<p><em>Virtual Casino</em> lets the player experience the real sights and sounds of a casino in full 3-D, complete with authentic sounds of cards being flipped, coins dropping into the slot machine trays and the ever beautiful casino girls that will try to take the players money each and every time.</p><p>It features three locations to choose from, <em>Las Vegas</em>, <em>Atlantic City</em> and <em>Monte Carlo</em> with a variety of games to play such as seven-card stud, baccarat, blackjack, roulette and of course the ever popular (or hated) one-armed bandit (a.k.a. slot machines).</p>"},{"name":"Virtual Golf","year":1995,"developer":"Core Design Ltd.","url":"e#Virtual%20Golf%20%28Europe%29.zip","filesize":245437709,"score":6.9,"genres":"Simulation > Sports > 3rd-person (Other) > Golf > Licensed","desc":"<p>In the golf simulator you are allowed to win in Scottish Open on Championship Golf Courses, including The Bowery, Kilmarney, Penperro, and Carnoustie. There are many players in the game, who can rise during the playing. You can choose, edit or create one of them. Choosing a club, striking a ball, and counting turns, you have to beat your opponents, taking into account wind and height of landscape.</p><p>The game employs 3 different camera angles to capture the most realistic aspect on the course.</p>"},{"name":"Virtual Hydlide","year":1995,"developer":"T&E Soft, Inc.","url":"e#Virtual%20Hydlide%20%28Europe%29.zip","filesize":318352927,"score":5.3,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Fantasy","desc":"<p><em>Virtual Hydlide</em> is a 3D remake of the original Hydlide for the NES. You must defeat the evil demon Varalys, who turned a beautiful princess into three fairies. Before you confront the ultimate fiend, you must find the three fairies and restore the princess to her normal self by collecting three jewels.</p><p>You roam the 3D world of Hydlide, fighting monsters in real time, finding weapons and armor, descending into dungeons, hunting for treasure, and collecting points after defeating your foes, which you can then exchange for items. RPG elements are very slight, as you level up only after completing a portion of the game. You can also generate random maps by yourself and let the hero perform the same quest in your own world.</p>"},{"name":"Virtual On: Cyber Troopers","year":1996,"developer":"Sega AM3 R&D Division","url":"e#Virtual%20On%20-%20Cyber%20Troopers%20%28Europe%29.zip","filesize":335968979,"score":7.9,"genres":"Action > 3rd-person (Other) > Anime / Manga > Arcade > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Get it on with Virtual On! The home port of Sega's arcade hit where you take control of gigantic, fully armored battle droids and duke it out against other droids in duel-like battles over a set of different arenas.</p><p>The game boasts 8 fully polygonal droids, each with his own strengths and weaponry and 10 different arenas with their own layout and traps. Proceed through the entire campaign via subjecting yourself to \"virtual training\" and then facing off for the real thing against the other computer controlled droids, or go against a human opponent in multiplayer combat over Lan, modem, serial link or the same computer with split screen display.</p>"},{"name":"Virtual Open Tennis","year":1995,"developer":"Arc System Works Co., Ltd.","url":"e#Virtual%20Open%20Tennis%20%28Europe%29.zip","filesize":486504043,"score":7.1,"genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p>One of only two tennis games released for the Saturn. Features include a 3 modes of play (tournament, exhibition and practice), 3 playing surfaces and 10 players.</p>"},{"name":"Virus (Disc 1)","year":1997,"developer":"Hudson Soft Company, Ltd.","url":"e#Virus%20%28Japan%29%20%28Disc%201%29.zip","filesize":450550463,"score":"","genres":"Action > Adventure > 1st-person > Puzzle elements > Shooter > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Detective / mystery","desc":"<p>It is the 22nd century. Human beings have long reached outer space and traveled to other planets. But they could not find happiness, and soon their only source of feelings became the \"Cyber Net\", a virtual world where people could experience simple emotions such as love or hatred. One day, a deadly virus was discovered in the Cyber Net. A special unit called Blue Metal was sent to annihilate the virus. But something went wrong, and the members of the unit were killed. Serge Shadix survived, but his brother Leon never came back. This accident made Serge join a force called STAND (Special Team for Alert to Network Destruction), which specialized in cybernetic crimes. Will Serge be able to solve the mystery and discover the secret of the virus?</p><p><em>Virus</em> is an adventure game with elements of a shooter, similar in concept to Snatcher, but with much more developed and frequent combat. During the adventure portions of the game, the player views locations and talks to characters from first-person perspective, interacting with the environment by selecting command icons from a bar on the bottom of the screen, and then moving the cursor on the screen to select the object to interact with in a point-and-click fashion. The game has many more puzzles than most other Japanese-style adventures; most of them are logic- or memory-based, though a few require the player to explore the environment and use inventory items.</p><p>The protagonist often enters and explores first-person 3D dungeon-like areas, where he can physically move around and also encounter enemies. Battles take place on a separate screen; the hero fights by aiming at enemies and shooting at them in real time. Each action in combat costs action points (AP); once the main character's AP bar is depleted, he cannot perform actions until it refills gradually or until the player uses an AP-restoring item. It is also possible to use shields and various offensive items during combat. Weapons and items can be bought in stores. Many boss battles require the player to locate the enemy's weakpoint and attack it.</p>"},{"name":"Virus (Disc 2)","year":1997,"developer":"Hudson Soft Company, Ltd.","url":"e#Virus%20%28Japan%29%20%28Disc%202%29.zip","filesize":489722218,"score":"","genres":"Action > Adventure > 1st-person > Puzzle elements > Shooter > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Detective / mystery","desc":"<p>It is the 22nd century. Human beings have long reached outer space and traveled to other planets. But they could not find happiness, and soon their only source of feelings became the \"Cyber Net\", a virtual world where people could experience simple emotions such as love or hatred. One day, a deadly virus was discovered in the Cyber Net. A special unit called Blue Metal was sent to annihilate the virus. But something went wrong, and the members of the unit were killed. Serge Shadix survived, but his brother Leon never came back. This accident made Serge join a force called STAND (Special Team for Alert to Network Destruction), which specialized in cybernetic crimes. Will Serge be able to solve the mystery and discover the secret of the virus?</p><p><em>Virus</em> is an adventure game with elements of a shooter, similar in concept to Snatcher, but with much more developed and frequent combat. During the adventure portions of the game, the player views locations and talks to characters from first-person perspective, interacting with the environment by selecting command icons from a bar on the bottom of the screen, and then moving the cursor on the screen to select the object to interact with in a point-and-click fashion. The game has many more puzzles than most other Japanese-style adventures; most of them are logic- or memory-based, though a few require the player to explore the environment and use inventory items.</p><p>The protagonist often enters and explores first-person 3D dungeon-like areas, where he can physically move around and also encounter enemies. Battles take place on a separate screen; the hero fights by aiming at enemies and shooting at them in real time. Each action in combat costs action points (AP); once the main character's AP bar is depleted, he cannot perform actions until it refills gradually or until the player uses an AP-restoring item. It is also possible to use shields and various offensive items during combat. Weapons and items can be bought in stores. Many boss battles require the player to locate the enemy's weakpoint and attack it.</p>"},{"name":"Virus (Disc 3)","year":1997,"developer":"Hudson Soft Company, Ltd.","url":"e#Virus%20%28Japan%29%20%28Disc%203%29.zip","filesize":541193573,"score":"","genres":"Action > Adventure > 1st-person > Puzzle elements > Shooter > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Detective / mystery","desc":"<p>It is the 22nd century. Human beings have long reached outer space and traveled to other planets. But they could not find happiness, and soon their only source of feelings became the \"Cyber Net\", a virtual world where people could experience simple emotions such as love or hatred. One day, a deadly virus was discovered in the Cyber Net. A special unit called Blue Metal was sent to annihilate the virus. But something went wrong, and the members of the unit were killed. Serge Shadix survived, but his brother Leon never came back. This accident made Serge join a force called STAND (Special Team for Alert to Network Destruction), which specialized in cybernetic crimes. Will Serge be able to solve the mystery and discover the secret of the virus?</p><p><em>Virus</em> is an adventure game with elements of a shooter, similar in concept to Snatcher, but with much more developed and frequent combat. During the adventure portions of the game, the player views locations and talks to characters from first-person perspective, interacting with the environment by selecting command icons from a bar on the bottom of the screen, and then moving the cursor on the screen to select the object to interact with in a point-and-click fashion. The game has many more puzzles than most other Japanese-style adventures; most of them are logic- or memory-based, though a few require the player to explore the environment and use inventory items.</p><p>The protagonist often enters and explores first-person 3D dungeon-like areas, where he can physically move around and also encounter enemies. Battles take place on a separate screen; the hero fights by aiming at enemies and shooting at them in real time. Each action in combat costs action points (AP); once the main character's AP bar is depleted, he cannot perform actions until it refills gradually or until the player uses an AP-restoring item. It is also possible to use shields and various offensive items during combat. Weapons and items can be bought in stores. Many boss battles require the player to locate the enemy's weakpoint and attack it.</p>"},{"name":"Voice Fantasia S: Ushinawareta Voice Power (Disc 1)","year":1997,"developer":"Pre-Stage Inc.","url":"e#Voice%20Fantasia%20S%20-%20Ushinawareta%20Voice%20Power%20%28Japan%29%20%28Disc%201%29.zip","filesize":484159465,"score":"","genres":"Adventure > Top-down > Anime / Manga > Fantasy","desc":"<p>The hero of this game is a young man who enjoys playing video games (don't we all?..). One fine day, he rents a new game; after firing it up, a princess appears on the screen, calling for help. A moment later, a demonic hand reaches to the hero and pulls him into the TV! The hero is teleported into an alternate world, a kingdom that is a mixture of medieval and modern day-like environment. This world is in danger, and only those who have the magical \"voice power\" can save it! The hero meets the young female magician named Whip and the princess of the country, Fret; together, they must stop the evil and figure out a way for the hero to go back to his world.</p><p><em>Voice Fantasia</em> might look like an RPG, but in reality its gameplay is much closer to the adventure variety, the RPG elements reducing to a mini game-like status. Most of the gameplay here is dedicated to exploring the world, talking to characters, and acquiring and using items needed to advance the story. The infrequent turn-based battles are dictated by the story. Three girls join the party, and are able to use \"voice powers\", which are in effect attacks of various properties. There is no experience system of any kind.</p><p>There is also a mild \"dating simulation\" element in the game. The player is able to buy presents for the girls, invite them for dinner, etc. When staying at the hotel, those anime-style fantasy characters are replaced by video footage of real voice actresses. The player is able to talk to them and ask a variety of questions.</p>"},{"name":"Voice Fantasia S: Ushinawareta Voice Power (Disc 2)","year":1997,"developer":"Pre-Stage Inc.","url":"e#Voice%20Fantasia%20S%20-%20Ushinawareta%20Voice%20Power%20%28Japan%29%20%28Disc%202%29%20%28Premium%20CD-ROM%29.zip","filesize":360130369,"score":"","genres":"Adventure > Top-down > Anime / Manga > Fantasy","desc":"<p>The hero of this game is a young man who enjoys playing video games (don't we all?..). One fine day, he rents a new game; after firing it up, a princess appears on the screen, calling for help. A moment later, a demonic hand reaches to the hero and pulls him into the TV! The hero is teleported into an alternate world, a kingdom that is a mixture of medieval and modern day-like environment. This world is in danger, and only those who have the magical \"voice power\" can save it! The hero meets the young female magician named Whip and the princess of the country, Fret; together, they must stop the evil and figure out a way for the hero to go back to his world.</p><p><em>Voice Fantasia</em> might look like an RPG, but in reality its gameplay is much closer to the adventure variety, the RPG elements reducing to a mini game-like status. Most of the gameplay here is dedicated to exploring the world, talking to characters, and acquiring and using items needed to advance the story. The infrequent turn-based battles are dictated by the story. Three girls join the party, and are able to use \"voice powers\", which are in effect attacks of various properties. There is no experience system of any kind.</p><p>There is also a mild \"dating simulation\" element in the game. The player is able to buy presents for the girls, invite them for dinner, etc. When staying at the hotel, those anime-style fantasy characters are replaced by video footage of real voice actresses. The player is able to talk to them and ask a variety of questions.</p>"},{"name":"VR Golf '97","year":1996,"developer":"Gremlin Interactive Limited","url":"e#VR%20Golf%20%2797%20%28USA%29.zip","filesize":317706889,"score":7.8,"genres":"Simulation > Sports > 3rd-person (Other) > Golf","desc":"<p><em>Actua Golf</em> is a golf simulation with full 3D terrain and characters. It comes with two courses to play at (country and tropical), customizable characters and multi-view shot tracking and action replays.</p><p><em>Actua Golf</em> uses similar game controls as older golf titles did. With a swing meter, where you have to time correctly to hit the ball right.</p><p>The game features two difficulties and various game modes such as foursome, four ball challenge and skins. </p><p>Commentary in the game is provided by Tony Adamson, Pat O'Brien, and Peter Alliss.</p>"},{"name":"VR Soccer","year":1996,"developer":"Gremlin Interactive Limited","url":"e#VR%20Soccer%20%28USA%29.zip","filesize":77431368,"score":6.8,"genres":"Sports > Diagonal-down > Football (European) / Soccer","desc":"<p>In 1995 the increased power of the new wave of systems made 3D football games a possibility several companies investigated. Most of the features people later took for granted in football games were pioneered, or at least fairly fresh, when they appeared in the first of the Actua Sports titles.</p><p>Multiple camera angles were available to view the full-3D action, with 3 Sheffield Wednesday FC players providing motion capture. 44 international squads of 22 players, each with 8 individual skill attributes, were featured. BBC commentator Barry Davies provided a full flowing commentary over the top. A full range of customised tournaments were available, as well as multi-player options allowing for both same-system and networked play.</p>"}]