[{"name":"Wachenröder","year":1998,"developer":"TNS Co., Ltd."},{"name":"Waialae no Kiseki: Extra 36 Holes","year":1997,"developer":"T&E Soft, Inc."},{"name":"Waku Waku 7","year":1997,"developer":"Sun Corporation","url":"e#Waku%20Waku%207%20%28Japan%29.zip","filesize":502821713,"score":7.5,"genres":"Action > Side view > Anime / Manga > Arcade > Fighting","desc":"<p>The seven magical Waku Waku balls have surfaced once again and the few that know of their existence decide to battle against each other in order to collect them all. If they are able to defeat the powerful monster enslaved in them, the Waku Waku balls will grant the lucky victor whatever wish they desire.</p><p>The game was created as a parody of animé series in general, WW7 pools together all the mainstays of the genre and has them fight against each other. From furry catgirls and effeminate, super-cool elfs to cute pokémon-like creatures and dumb and loud heroes.</p><p>Gameplay-wise the game is a 2D fighting game in which two characters try to defeat each other in one-on-one combat using their attacks and special moves. The player selects his/her character and then tries to defeat all opponents in succession. As in most games of the genre each character possesses individual strengths and movesets, plus a power-bar that gets charged by unleashing special moves that allows one to trigger super moves and even unblockable attacks at the expense of power slots.</p><p>Features arcade and Vs gameplay modes as well as an artwork gallery for the Saturn version which showcases the bright colorful art design of WW7.</p>"},{"name":"Waku Waku Puyo Puyo Dungeon","year":1998,"developer":"Compile","url":"e#Waku%20Waku%20Puyo%20Puyo%20Dungeon%20%28Japan%29%20%284M%29.zip","filesize":60177694,"score":"","genres":"Role-playing (RPG) > Isometric > Anime / Manga > Real-time","desc":"<p>A dungeon-crawler RPG based on the characters and setting of the Puyo Puyo series. You take your pick of either magician Arle, priest Rulue or the knight Schezo and set out to loot a series of dungeons based on the Puyo Puyo game world.</p><p>The game is a 2D action-rpg viewed from an isometric perspective with an emphasis placed on beating countless monsters and gaining better equipment. Dungeons are generated randomly each time you enter them, as are item spawning points and the enemies and spells available (but not the bosses).</p>"},{"name":"WanChai Connection","year":1994,"developer":"Micronet Co. Ltd."},{"name":"Wangan Dead Heat","year":1995,"developer":"Genki Co., Ltd.","url":"e#Wangan%20Dead%20Heat%20%28Japan%29.zip","filesize":472507088,"score":6.5,"genres":"Racing / Driving > 1st-person > Behind view","desc":"<p><em>Highway 2000</em> is a racing game that offers five racing tracks and three cars (Mad Viper, Dark Nebula and Rapid Fire) with different statistics based on speed, acceleration, handling and grip. The game has several modes like the tournament mode in which you race against AI-controlled opponents and a time trial mode. There is also a two-player race mode in where you race another player in split-screen.</p>"},{"name":"WarCraft II: The Dark Saga","year":1997,"developer":"Blizzard Entertainment Inc.","url":"e#WarCraft%20II%20-%20The%20Dark%20Saga%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":483325801,"score":7.5,"genres":"Strategy > Top-down > Free-roaming camera > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Fantasy > Steampunk > War","desc":"<p>This port of <em>Warcraft II</em> includes all the missions from Warcraft II: Tides of Darkness and its expansion pack, Beyond the Dark Portal, into one package. </p><p>New features for the console release include an auto-build option, where the player can set a queue of units to be produced and the ability to select sixteen units at a time instead of the PC's nine.</p>"},{"name":"Warriors of Fate","year":1996,"developer":"Capcom Co., Ltd."},{"name":"Welcome House","year":1997,"developer":"Gust Co., Ltd."},{"name":"Whizz","year":1997,"developer":"Flair Software Ltd.","url":"e#Whizz%20%28Europe%29.zip","filesize":269654167,"score":6.4,"genres":"Action > Isometric > Platform","desc":"<p><em>Whizz</em> is one of the few 3D platformers to use an isometric viewpoint. The controls reflect this, with moving the controller to the right actually moving the character down and right, moving it down and right moving the character down directly, and so on. Each level is played out against a time limit, and the paths through the level aren’t always clear-cut. There are four different types of doors, each of which needs a particular icon to pass (the icons represent the door type, such as ice or bricks, rather than hot water or a key, or anything you’d logically expect to clear the path). You can avoid the baddies, which may be the best option, as killing them costs you some energy –this reduces the significance of the points system.</p>"},{"name":"Williams Arcade Classics","year":1997,"developer":"Digital Eclipse Software, Inc."},{"name":"Willy Wombat","year":1997,"developer":"Westone Co., Ltd.","url":"e#Willy%20Wombat%20%28Japan%29.zip","filesize":430256895,"score":"","genres":"Action > Diagonal-down > Isometric > Platform > Puzzle elements > Direct control","desc":"<p><em>Willy Wombat</em> is an isometric action platformer. The camera is fixed from a top-down angle, but can be rotated using the shoulder buttons. Each stage features a series of intricate puzzles that stand in way of the exit at the end. Cutscenes are featured throughout, with fully voiced English dialogue.</p><p>The game takes place in an ideal society named Prison, where it's residents are able to essentially live forever without sickness through regeneration, however, this society is heavily regulated by their elite managers. One of Prison's managers, Willy Wombat, opts to escape this society in search of freedom in the land of Eden. To get there, he must search for six miracle gems, scattered across Prison. However, these gems attract deadly ghosts, who Willy must deal with using his set of attacks, including his boomerang. The other managers of Prison are also on Willy's tail, seeking to eliminate him. Essential items are scattered throughout these areas, like crystals, keys, and force powerups, that will aid Willy in his quest to find Eden.</p>"},{"name":"Wing Arms","year":1995,"developer":"Bell Corporation","url":"e#Wing%20Arms%20%28Europe%29.zip","filesize":386341527,"score":7.3,"genres":"Action > Simulation > 1st-person > 3rd-person (Other) > Shooter > Flight / aviation","desc":"<p>Wing Arms is action/shooter starring airplanes mainly from the WW2 era. There is very little simulation here as you shoot your way through levels where usually your mission is to shoot everyone, or to bomb certain targets. Night missions add to the variety. Gameplay is similar to the Wing Commander series, and is intended to be easy to play but hard to master.</p>"},{"name":"Winning Post 2","year":1996,"developer":"KOEI Co., Ltd.","url":"e#Winning%20Post%202%20%28Japan%29%20%282M%29.zip","filesize":112780340,"score":"","genres":"Simulation > Horse Racing","desc":"<p>Winning Post 2 (ウイニングポスト２) is a Simulation - Horse Racing game, published by KOEI, which was released in Japan in 1996 for the Sega Saturn.</p>"},{"name":"Winning Post 3","year":1998,"developer":"KOEI Co., Ltd."},{"name":"Winning Post EX","year":1995,"developer":"KOEI Co., Ltd.","url":"e#Winning%20Post%20EX%20%28Japan%29%20%282M%29.zip","filesize":295097426,"score":"","genres":"Simulation > Sports > Cinematic camera > Horse / derby","desc":"<p><em>Winning Post</em> lets the player take control of a stable of horses, breeding and training them for the ultimate goal, to win the French Grand Prix.</p><p>The player can hire breeders, trainers, and jockeys and race in over 240 different races to earn more money. That money can then be used to buy even better personnel and breed faster, stronger horses as well as to keep their horses healthy. Players can also bet on races.</p><p>The gameplay consists of choosing options before races, such as choosing which horses to train and what regiment they undertake, viewing stats, hiring personnel, and placing bets. However, the player has no control over races, cannot participate, and is only viewable as a spectator.</p>"},{"name":"Winter Heat","year":1997,"developer":"Sega AM3 R&D Division","url":"e#Winter%20Heat%20%28Europe%29.zip","filesize":347715391,"score":8,"genres":"Sports > 3rd-person (Other) > Olympiad / mixed sports","desc":"<p><em>Winter Heat</em> is the home conversion of the DecAthlete (also known as Athlete Kings) sequel, replacing decathlon by Winter sports. Competition (in Arcade, Saturn or Practice modes) includes 11 events featuring eight athletes of different nationalities - Li Huang, Karl Vain, Joe Kudou, Ellen Reggiani, Aleksei Rigel and Rick Blade are joined by B.B. (replacing Jef Jansens, who appears as a secret athlete) and Johann Stensen (instead of Femi Kadiena). </p><p>The game is a typical Winter-sports game, in the line of those released by Epyx but with a more arcade feel. The events include:<em> </em><em>Speed Skiing:</em>* A simple dashing event where the goal is to descend the hill as fast as possible (in speeds over 200 km/h). Action is reduced to mash the button to gain speed.</p><ul><li><p><strong>Ski Jumping:</strong> Composed by four parts: The run up (mash the button to gain speed), the jump (selecting the angle), the flight (mash the button to gain extra length) and the landing (pressing the action button too early will lose valuable meters, too late will cost the jump).</p></li><li><p><strong>Downhill:</strong> A simplified version of the real downhill event. It's impossible to miss the gates, and the challenge is to get a strong start-up, keep a straight path not losing speed hitting the fences and hitting the action button to jump hills perfectly.</p></li><li><p><strong>Short Track Speed Skating:</strong> A straightforward event where the directional pad controls the direction of the athlete along the speed button to control the pace. As the event runs for over 40 seconds, it's possible to hold second position, making the opponent cut air resistance which allows the player to reach fastest speeds with less button presses.</p></li><li><p><strong>Skeleton:</strong> The first event in the ice tunnels, it requires a fast run-up followed by a strong entrance in the tunnels. By pressing the action button it's possible to slow down the sled and make more controlled turns, or the athlete can fall from it, which not only loses time but also requires a small run-up.</p></li><li><p><strong>Slalom:</strong> Just like the Downhill, it's impossible to miss a gate in the Slalom. After an initial sprint the player has to press the action button to approach each flag in the best way possible. Hitting the button too early or too late will make the athlete hit the flag, losing valuable time.</p></li><li><p><strong>Aerial:</strong> An event similar to the Ski Jump. Instead of offering a \"click-along\" version, the player starts by setting the difficulty of the jump, and then three parts follow: in the run-up, the player sets the speed by mashing the speed button, followed by the jump which sets the strength (by pressing the action button) and when the athlete leaves the launch ramp, the player must mash the speed button once again to complete the jump. To complete a jump, the player must fill each section of the jump bar by making enough button presses</p></li><li><p><strong>Bobsleigh:</strong> In all similar to the Skeleton, except there's no option to slow down.</p></li><li><p><strong>Speed Skating:</strong> Another simple button-mashing event but with a twist: speed must be controlled on the turns, or the athlete will slip out losing a few seconds in the process. The speed can be controlled by a color graph above the power bar.</p></li><li><p><strong>Snowboard:</strong> A mix between the Slalom and Downhill. There are several gates to be passed, plus two jumps. Unlike the other two events, it's possible to miss a gate, which carries a one second penalty for each missed.</p></li><li><p><strong>Cross Country:</strong> The stamina-influenced event. There's a long track with some hills that can be taken for advantage, as during downhill slopes it's possible to gain a lot of speed without losing stamina.</p></li></ul>"},{"name":"WipEout","year":1996,"developer":"Psygnosis Limited","url":"e#WipEout%20%28Europe%29.zip","filesize":613000913,"score":7.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p><em>WipEout</em> is a futuristic racing game set in the year 2052. Racing for one of four teams, the player competes in the F3600 Anti-Gravity Racing League on six tracks. Each team's hovercraft racer has different ratings in speed, acceleration and turning. In addition to high-speed racing, there is also shooting in the game, with different weapon pickups like rockets and mines available, useful for slowing one's opponents down. Shields can also be picked up and can block the weapons' effects.</p><p>There are championship, single race and time trial modes. Winning the championship in the regular Venom class unlocks the Rapier class, where the craft are faster and the tracks have slightly different looks.</p><p>There is also a two-player mode where two opponents can race and shoot at each other.</p>"},{"name":"WipEout 2097","year":1997,"developer":"Psygnosis Limited","url":"e#WipEout%202097%20%28Europe%29.zip","filesize":584311659,"score":7.8,"genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p><em>WipEout XL</em> is set in the year 2097, around four decades after its predecessor. Instead of the F3600 anti-gravity racing competition, the game features an even faster and more dangerous tournament: the F5000 AG league. The gameplay system is similar to that of the previous game: players race against each other or computer in high-speed futuristic environments, liberally picking up weapons scattered around the stages and using them against the opponents to finish the race in the highest position.</p><p>Each vehicle is provided with a shield; once this shield is breached (by weapons or other kinds of damage), the craft explodes. As in the first game, the vehicles move at very high speeds. The game's four difficulty levels are used to crank the speed up and down, with the highest setting corresponding to the highest speed. In addition to the main championship mode, there are also challenge modes, winning in which rewards the player with faster game settings, new tracks, and new vehicles.</p>"},{"name":"With You: Mitsumete Itai","year":1999,"developer":"NEC Interchannel, Ltd."},{"name":"Wizard's Harmony","year":1995,"developer":"Arc System Works Co., Ltd.","url":"e#Wizard%27s%20Harmony%20%28Japan%29.zip","filesize":308600924,"score":"","genres":"Simulation > Strategy > 1st-person > Fixed / flip-screen > Anime / Manga > Fantasy > Medieval","desc":"<p>Rather than science, swords and sorcery flourish in this world. Our story takes place at the school of \"Skill & Wisdom,\" founded for youngsters who long for adventure.</p><p>The hero of our story, \"Rufus Craoun\" (you), is an active young man who participates in club activities at the Wizard Academy. But this Wizard Academy is suffering from a major problem...</p><p>The former head master carried out a number of misdeeds, and you're the only member of faculty. You've got to hire more faculty members to keep the academy going, but also make sure to pass the exams presented three times a year! Study and go on adventures with faculty members on the weekdays! Even enjoy school life with a charming member of staff from time to time! Think you can keep the academy up and running? Give it your best shot!</p>"},{"name":"Wizard's Harmony 2","year":1997,"developer":"Arc System Works Co., Ltd.","url":"e#Wizard%27s%20Harmony%202%20%28Japan%29%20%281M%29.zip","filesize":219029045,"score":"","genres":"Simulation > Strategy > 1st-person > Fixed / flip-screen > Anime / Manga > Fantasy > Medieval","desc":"<p>Rather than science, swords and sorcery flourish in this world. Our story takes place at the school of “Skill & Wisdom”, founded for youngsters who long for adventure.</p><p>In this game, you will play as an energetic young man who participates in club activities at the “Wizard’s Academy”. But all of a sudden all the other members quitted because of a big mistake made by you in an experiment! The student council, which has never been fond of the club, takes this chance and plans to abolish the club unless you can complete the tasks listed out by them. Now it is up to you to recruit more members to keep the academy going, and at the same time make sure to pass the exam that comes three times a year! Can you save the club and hold it up this time?</p>"},{"name":"Wizardry VI & VII Complete","year":1996,"developer":"Sir-tech Software, Inc."},{"name":"Wizardry: Llylgamyn Saga","year":1998,"developer":"Soliton Soft"},{"name":"World Advanced Daisenryaku: Sakusen File","year":1996,"developer":"Sega CS1","url":"e#World%20Advanced%20Daisenryaku%20-%20Sakusen%20File%20%28Japan%29%20%281M%29.zip","filesize":214689626,"score":"","genres":"Strategy > 3rd-person (Other) > Top-down > 2D scrolling > Cinematic camera > Turn-based > Turn-based strategy > Point and select > World War II > War","desc":"<p><em>World Advanced Daisenryaku: Sakusen File</em> is an entry in the <em>Daisenryaku series</em> with the campaign focusing on the eastern front during World War II. The game uses hexagonal grid over the battlefield map similar to that in the original Panzer General game. Available gameplay modes include standard mode and campaign mode. In standard mode the player can choose and play any map in singlepalyer or multiplayer and available selection of units is preset. In campaign mode, the player can go through Soviet story campaign which follows the actual historical events of WWII, or Cenozoic virtual campaign where any of the five available forces, namely US, British, Soviet, German, or Japanese, can be selected. During the campaigns the units evolve over time and upgrade into more powerful units that were developed during the course of World War II.</p>"},{"name":"World Cup Golf: In Hyatt Dorado Beach","year":1996,"developer":"Arc Developments","url":"e#World%20Cup%20Golf%20-%20In%20Hyatt%20Dorado%20Beach%20%28Japan%29%20%28En%2CJa%29.zip","filesize":585741601,"score":6.5,"genres":"Sports > 1st-person > Behind view > Golf > Licensed","desc":"<p><em>World Cup Golf</em> takes the player to Puerto Rico's own Hyatt Dorado Beach Golf Course as they can choose from a bevy of fictional golfers or create their own in 18 rounds of golf. There are 15 types of tournaments to choose from including skins, medals, and Stableford to name a few. Players can also practice their swing on the driving range.</p><p>Players can also customize weather conditions as well as choose from a plethora of camera shots including the \"Ball Cam\" that follows the ball to its location. Like many golf games, a meter is used to determine the accuracy and the power of the player's swing and also features in-game commentary.</p>"},{"name":"World Heroes Perfect","year":1996,"developer":"SNK Corporation","url":"e#World%20Heroes%20Perfect%20%28Japan%29.zip","filesize":437386474,"score":7.2,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p>In this entry in the <em>World Heroes</em> saga, all sixteen fighters from previous games return for another tournament. New features include:</p><ul><li>An attack mode where the player must use all four buttons to attack the opponent.</li><li>A power bar which grants special abilities unique to each character.</li><li>Additional stages set across different locations in Earth's past and future.</li><li>Three secret characters to choose from, including a character new to the series.</li></ul>"},{"name":"World League Soccer '98","year":1998,"developer":"Silicon Dreams Studio Ltd."},{"name":"World Series Baseball","year":1995,"developer":"SEGA Enterprises Ltd.","url":"e#World%20Series%20Baseball%20%28Europe%29.zip","filesize":84383095,"score":8,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>This version of <em>World Series Baseball</em> features the MLB and MLBPA licenses, three different baseball parks, and CD-quality sound. Gameplay modes include:</p><ul><li>Exhibition</li><li>Pennant Race</li><li>Playoffs</li><li>All-Star Game</li><li>Home Run Derby</li></ul>"},{"name":"World Series Baseball 98","year":1997,"developer":"SEGA Enterprises Ltd.","url":"e#World%20Series%20Baseball%2098%20%28USA%29.zip","filesize":339635092,"score":"","genres":"Sports > 3rd-person (Other) > Top-down > Baseball > Licensed","desc":"<p><em>World Series Baseball 98</em> features the full MLB license, including 20 teams and 700 major players with updated rosters and schedules from the 1997 season. The three standard modes of the series - Exhibition, Season, and Playoff - are included.</p><p>The game also features an updated graphics engine compared to the previous installment, giving it more realistic visuals, including animations of the major batters, pitch's wind-ups and batting stances. There are also several camera angles to choose from. Play-by-play commentary is included as well.</p>"},{"name":"World Series Baseball II","year":1996,"developer":"SEGA Enterprises Ltd.","url":"e#World%20Series%20Baseball%20II%20%28Europe%29.zip","filesize":214603275,"score":7.6,"genres":"Sports > Behind view > Direct control > Baseball > Licensed","desc":"<p>All 28 Ballparks in Rendered Detail * Updated MLB Stats & Rosters * Play as the 1998 expansion Arizona Diamondbacks or Tampa Bay Devil Rays * Create your own expansion team roster * Awesome New Camera Angles * Choose from 8 players to call up from the farm.</p>"},{"name":"Worldwide Soccer: Sega International Victory Goal Edition","year":1995,"developer":"Team Aquila","url":"e#Worldwide%20Soccer%20-%20Sega%20International%20Victory%20Goal%20Edition%20%28USA%29%20%28RE%29.zip","filesize":436057418,"score":7.5,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer","desc":"<p><em>International Victory Goal</em> was Sega's first attempt at a 32-bit soccer game outside the Japanese market, one of the first Saturn sports games released and the predecessor to Worldwide Soccer 97 and 98.</p><p>Focused on national teams (12, including Italy, Spain, Denmark, Netherlands, England, Argentina, France, USA, Germany, Romania, Belgium and Brazil), the game offers a 2.5D environment (polygonal stadium and sprites for players) and three camera angles (back, isometric and side) with four zooming levels. Modes include Exhibition, World League (either single or double, with 44 matches and a grand final to crown the Grand Champion), S-League (just one round, 11 matches), cup knockout and penalty shootout, the game keeping track of statistical information of each competition. Gameplay is regular arcade, with simplicity being privileged over tactical knowledge or complex controls, with the game offering the possibility to choose between three types of controls. Other options include the ability to choose one of four difficulty levels, length of each half (3, 6 or 15 minutes) and weather conditions (fine, rain or random).</p>"},{"name":"Worms","year":1996,"developer":"Team17 Software Limited","url":"e#Worms%20%28Europe%29.zip","filesize":412072962,"score":7.6,"genres":"Strategy > Side view > 2D scrolling > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p><em>Worms</em> is a turn-based strategy game. It features up to 4 teams of 4 worms, aiming to destroy the others on a generated terrain. Each worm has 100 hitpoints and dies when his hit points fall to 0. Upon death, a worm explodes, causing damage to everyone around.</p><p>Gameplay is turn-based. Each turn, the player can control one specific worm from his team. The worm can crawl left and right or jump. However, there is a time limit to make a move; also, if the worm falls from a great height, it loses health and the turn ends immediately; and if a worm falls into water or offscreen, it dies. Each turn, a worm can also make a single attack: the player can aim up and down, choose a weapon and then fire it. After attacking, the turn ends. </p><p>There are a lot of weapons available - the standard ones as bazookas (which are affected by the (random) wind settings and gravity) and grenades. The others include a Fire Punch, dynamite, airstrikes, and utilities such as ropes and girders.</p><p>There are 10 styles of terrain, ranging from forests and deserts to Candy land and the moon (complete with affected gravity). Shots leave craters in the ground, and complex tunnels can be formed.</p>"},{"name":"WWF In Your House","year":1996,"developer":"Sculptured Software, Inc.","url":"e#WWF%20In%20Your%20House%20%28Europe%29.zip","filesize":409748548,"score":5.9,"genres":"Sports > Side view > 2D scrolling > Arcade > Fighting > Wrestling > Licensed","desc":"<p><em>WWF In Your House</em> is a successor to WWF WrestleMania: The Arcade Game. Like its predecessor, it is a hybrid of wrestling game and arcade versus fighter, with over-the-top, unrealistic moves. Concept and presentation are similar to Mortal Kombat games: digitized sprites are used to represent the wrestlers, and the game features finished moves that are performed before the final pin. There are a total of ten WWF wrestlers in the game: The British Bulldog, Goldust, Bret Hart, Owen Hart, Hunter Hearst Helmsley, Ahmed Johnson, Shawn Michaels, The Ultimate Warrior, The Undertaker, and Vader. A new four-player mode is available.</p>"},{"name":"WWF WrestleMania: The Arcade Game","year":1996,"developer":"Midway Manufacturing Company","url":"e#WWF%20WrestleMania%20-%20The%20Arcade%20Game%20%28USA%29.zip","filesize":458815319,"score":7.4,"genres":"Action > Sports > Side view > 2D scrolling > Arcade > Wrestling > Licensed","desc":"<p><em>WWF WrestleMania: The Arcade Game</em> merges the personalities and action of the WWF TV show characters with a Mortal Kombat-style fighting game. This title features digitized graphics of 8 WWF superstars: Doink, Razor Ramon, Bret \"Hit Man\" Hart, Shawn Michaels, The Undertaker, Yokozuna, Bam Bam Bigelow, and Lex Luger.</p><p>Although presented as a wrestling title, this game is structured like a one-on-one fighter, features over-the-top special moves characteristic of WWF. Each match is divided into a series of rounds, much like a fighting game. Instead of each round ending in a KO, it simply ends when the player forces the other wrestler(s) to fall by reducing their energy meter. Game modes include single player arcade mode, tournament mode, and versus mode for one-on-one multiplayer.</p>"}]