[{"name":"X Japan: Virtual Shock 001 (Japan)","year":1995,"developer":"i2 PROJECT co.,ltd.","url":"e#X%20Japan%20-%20Virtual%20Shock%20001%20%28Japan%29%20%284M%29.zip","filesize":553808427,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Music / rhythm > Contemporary > Licensed","desc":"<p>This game acts as a cross between an FMV-based adventure game and an interactive concert video. Based on a real-life X Japan concert held at the Tokyo Dome on December 30 and 31, 1994, it puts the player in the role of a concert photographer. The player starts out backstage, able to navigate the Tokyo Dome from a first-person perspective through live-action still photos and video scenes. By speaking to backstage employees and searching through rooms, they can access their press pass and photo equipment; this grants the player the ability to go onstage to photograph the concert. At this point the game switches over to video footage of the concert; the player can't control the camera, but can decide when to take photos.</p>"},{"name":"X-Men vs. Street Fighter (Japan)","year":1997,"developer":"Capcom Co., Ltd.","url":"e#X-Men%20vs.%20Street%20Fighter%20%28Japan%29%20%281M%29.zip","filesize":436188927,"score":7.8,"genres":"Action > Side view > 2D scrolling > Fighting > Licensed","desc":"<p><em>X-Men vs. Street Fighter</em> is a fighting game, the first in which characters from the Marvel Comics universe (in this case, the X-Men) compete against Capcom's own creations, the heroes of the <em>Street Fighter</em> series.</p><p>The X-Men characters are mostly the same as in X-Men: Children of the Atom and Marvel Super Heroes; three new characters are Rogue, Gambit and Sabretooth. The <em>Street Fighter</em> cast is based on that of Street Fighter Alpha 2; however, the appearance and combat styles of some of them have been altered, to match the abilities of the X-Men heroes.</p><p>The gameplay system is similar to that of the aforementioned games, adding a tag-team gameplay feature. The player controls one character at a time, while the other awaits off-screen. The starting character can tag the waiting one in at any time by hitting specific buttons; the tag partner will jump in with an attack and taunt the enemy. Resting character gradually recuperate their health. The two partners can execute the so-called \"variable attacks\", which depend on the combination of buttons pressed.</p><p>The tag team feature has been omitted from the PlayStation version due to memory limitations.</p>"},{"name":"X-Men: Children of the Atom","year":1995,"developer":"Capcom Co., Ltd.","url":"e#X-Men%20-%20Children%20of%20the%20Atom%20%28Europe%29.zip","filesize":537300940,"score":7.8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Licensed","desc":"<p><em>X-Men: Children of the Atom</em> is a 2D fighting game and the first Capcom title to use licensed characters from the Marvel comic universe. It has six main characters and four of their enemies that are playable. The X-Men are Colossus, Cyclops, Iceman, Psylocke, Storm and Wolverine. The villains are Omega Red, Sentinel, Silver Samurai and Spiral. The two main bosses are Juggernaut and Magneto, and Akuma is available as a secret character.</p><p>Fighting is done one-on-one with a traditional best-two-out-of-three match setup, with automatic or manual blocking. Similar to the Super Combo gauge in Super Street Fighter II Turbo there is an X-Power gauge of different levels, filled up when the player performs moves. When it is maxed out an X-Ability or Hyper X special move can be performed. Other general features are the abilities to super jump, roll away and aiming projectiles.</p>"},{"name":"Xianjian Qixia Zhuan","year":1999,"developer":"Softstar Entertainment Inc."}]