[{"name":"Yellow Brick Road","year":1996,"developer":"Synergy Inc.","url":"e#Yellow%20Brick%20Road%20%28Japan%29%20%283M%29.zip","filesize":389486557,"score":"","genres":"Adventure > Strategy > 1st-person > Isometric > Real-time > Fantasy","desc":"<p>Inspired by the <em>Oz</em> Books by L. Frank Baum, <em>Yellow Brick Road</em> concerns the player's attempt to thwart an invasion of the Emerald City by the Gnome King. Along the way s/he teams up with the tin man, lion, and eventually the scarecrow. Besides these, other recognizable figures from the books include Jack Pumpkinhead, the little Wizard of Oz, and Glinda, who, in the game, is queen of Oz. </p><p>The game's structure is reminiscent of first-person adventures: the player interacts with the environment and manipulates inventory items to proceed. The puzzles, however, are kept to a minimum, since combat occupies a significant portion of the game, effectively turning it into a hybrid of adventure and small-scale real-time strategy.</p><p>Battles usually occur as dictated by the plot. The player does not fight directly, but instead acts as a general to his/her companions. Each character has a quick but weak base attack or can use one of the items found throughout the game. Many of the items act differently depending on who uses them. For instance, the flute calls field mice into battle for the Tin Woodman, while it calls crows into battle for the Scarecrow. The more powerful the item, the longer the downtime for the character who has used it before he can fight again. The enemies progress toward the companions' side of the battlefield at a constant pace. If they reach them, the battle is lost, and the player must try again. If instead the player manages to push them back off the far side of the field, the battle is won and the game progresses. Different enemies are more greatly affected by different weapon/character combinations, and immune against some.</p>"},{"name":"Yu-No: Kono Yo no Hate de Koi o Utau Shōjo","year":1997,"developer":"Elf Co., Ltd."},{"name":"Yūkyū Gensōkyoku (Genteiban!!)","year":1997,"developer":""},{"name":"Yūkyū Gensōkyoku Hozonban: Perpetual Collection","year":2000,"developer":"Starlight Marry Corporation"},{"name":"Yumimi Mix REMIX","year":1995,"developer":"Game Arts Co., Ltd.","url":"sega-saturn-champion-collection-updated/Y/Yumimi%20Mix%20Remix%20%28English%20Translated%2C%20Rev%201%29.zip","filesize":357360124,"score":"","genres":"Adventure > Anime / Manga > Full Motion Video (FMV)","desc":"<p>A seemingly ordinary Japanese high school student named Yumimi Yoshizawa sees a strange dream about a unicorn couple in a magical land. When one of the unicorns suddenly falls through a hole in the ground, Yumimi wakes up, realizing she has fallen out of the bed as well. The following day brings more strange occurrences, such as mysterious hopping blobs and a strange girl who professes her love to Yumimi. Eventually Yumimi and her friends realize that all these events are connected and that it lies in their power to protect our world from monsters.</p><p>Though not based on a manga or anime, <em>Yumimi Mix</em> has characteristic anime-style plot and visuals, and is built like an interactive cartoon movie with animation and voice-overs. The player is sometimes prompted to select an action or a response from a pop-up menu out of two or more available ones. These choices lead to different scenes, though the overall story remains the same. There is no possibility of a Game Over in the game.</p><p>Earlier versions of the game also feature a quiz that can be accessed from the main menu. Saturn and Windows versions also add a Shanghai-like tile-removing puzzle mini-game.</p>"},{"name":"Yuukyuu Gensoukyoku","year":1997,"developer":"Starlight Marry Corporation","url":"e#Yuukyuu%20Gensoukyoku%20%28Japan%29.zip","filesize":453115453,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Fantasy","desc":"<p>A young traveler finds himself working in a shop in the town of Enfield after being rescued by the shop's owner. One day, he's arrested on suspicion of stealing a work of art, and though he does not remember doing such a thing, several people claim to have seen him fleeing the scene of the crime. The shop's owner takes a loan to pay his bail, but if she is unable to pay the loan back within one year, she will lose the shop. A peculiar law in the town says that if he can gain the favor of the town, he can request a retrial, and so the young man and several of his friends in the town start taking odd jobs in order to gain the trust of the townsfolk.</p><p><em>Yūkyū Gensōkyoku</em> (Eternal Fantasy) is a traditional-style Japanese adventure game. You must interact with your companions and other people about the town, as well as plan jobs and leisure time for your group in order to build the trust of the town and pay back your debt.</p>"},{"name":"Yuukyuu Gensoukyoku 2nd Album","year":1998,"developer":"Starlight Marry Corporation","url":"e#Yuukyuu%20Gensoukyoku%202nd%20Album%20%28Japan%29.zip","filesize":451483301,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Fantasy","desc":"<p>The Third Division Vigilante Corps have earned the trust of the people of Enfield, and under the popular Commander Neumann, they have worked hard to earn this trust. However, Neumann is now gone, leaving the third division with low morale and little work, and eventually the main character from the previous game is the only member left. The third division is to be disbanded, but he appeals to the director, and is given one year to restore the third division to its former glory.</p><p><em>Yūkyū Gensōkyoku: 2nd Album</em> follows directly after the events of the first game, and is once more a traditional Japanese adventure game. You must gather your group to perform jobs for the people of Enfield, and interact with the various characters around town.</p>"},{"name":"Yuukyuu Gensoukyoku ensemble","year":1998,"developer":"Starlight Marry Corporation","url":"e#Yuukyuu%20Gensoukyoku%20ensemble%20%28Japan%29.zip","filesize":542366637,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Fantasy","desc":"<p><em>Yūkyū Gensōkyoku ensemble</em> is a fan disc for Yūkyū Gensōkyoku, featuring new stories involving the characters, several minigames, and an art gallery.</p>"},{"name":"Yuukyuu Gensoukyoku ensemble 2","year":1999,"developer":"Starlight Marry Corporation","url":"e#Yuukyuu%20Gensoukyoku%20ensemble%202%20%28Japan%29.zip","filesize":407062669,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Fantasy","desc":"<p><em>Yūkyū Gensōkyoku ensemble 2</em> is a fan disc for Yūkyū Gensōkyoku: 2nd Album, and like the previous one features a new side story, several minigames, and an art gallery.</p>"},{"name":"Yuukyuu no Kobako Official Collection","year":1997,"developer":"Starlight Marry Corporation","url":"e#Yuukyuu%20no%20Kobako%20Official%20Collection%20%28Japan%29.zip","filesize":247254742,"score":"","genres":"Adventure > Fixed / flip-screen > Anime / Manga > Game show / trivia / quiz > Menu structures > Fantasy","desc":"<p><em>Yūkyū no Kobako</em> is one of several Yūkyū Gensōkyoku fan discs. This one features a variety of high-quality videos and illustrations from the first game, as well as a many illustrations and information as a preview of the then-upcoming <em>Yūkyū Gensōkyoku: 2nd Album</em>. Also included is a quiz mode where you can test your knowledge of the characters and the world of the games.</p>"}]