[{"name":"Z","year":1998,"developer":"The Bitmap Brothers","url":"e#Z%20%28Europe%29.zip","filesize":283497944,"score":7.1,"genres":"Strategy > Top-down > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Sci-fi / futuristic","desc":"<p><em>Z</em> is a real-time strategy game in which you fight for control of the sectors, some of which contains manufactories that can gain you additional units. Touch the \"flag\" in the sector and it's yours. Capture the sector before the new unit comes out of the manufactory and the new unit is yours. With six different robots (different armaments, armor, and speed), multiple vehicles (from jeeps to tanks) the robots can utilize, your ultimate objective is to destroy the opponent's base, and prevent him from doing the same to you.</p><p>The game differs from many other RTSs by emphasizing territorial control (and the manufactories) instead of getting kills and gathering a big army. You have to finely balance defense and offense. If you wait too long, the enemy will grab all the manufactories first. If you go too fast, you'll get hammered for stretching yourself too thin. You can hijack enemy vehicles by shooting the driver off. If you send a group of soldiers toward an objective and they find a vehicle, one of them will split off to grab the vehicle; you don't really need to micromanage each soldier.</p>"},{"name":"Zeddas: Servant of Sheol","year":1996,"developer":"Caravan Interactive, Inc."},{"name":"Zen Nihon Pro Wres featuring Virtua (Japan)","year":1997,"developer":"Scarab","url":"e#Zen%20Nihon%20Pro%20Wres%20featuring%20Virtua%20%28Japan%29.zip","filesize":448568094,"score":"","genres":"Action > Sports > 3rd-person (Other) > Fighting > Wrestling > Licensed","desc":"<p>The title of the game is mostly self-explanatory, as it is wrestling game with an all-Japanese cast of fighters. The game is licensed title, based on the real \"All Japan Pro Wrestling\" (Zen Nihon Puroresu) wrestling promotion. The \"featuring Virtua\"-part of the title is related to the implementation of Wolf and Jeffrey from the game Virtua Fighter as playable characters.</p><p>Like Virtua Fighter, the graphics of the game are fully in 3D. The action is shown from changing perspectives. There is a large variety of moves available; apart from basic like attack or hold (which can also be modified with the D-pad) there are also taunts and counter moves available, for example. Furthermore, the game features a injury system: when a high amount of damage is inflicted, the game pauses shortly to show an X-ray picture and the increased damage of the corresponding section of the body.</p><p>Apart from single player mode, the game also features a multiplayer and a training mode.</p>"},{"name":"Zero4 Champ DooZy-J Type-R (Japan)","year":1997,"developer":"Media Rings Corporation","url":"e#Zero4%20Champ%20DooZy-J%20Type-R%20%28Japan%29.zip","filesize":430468151,"score":"","genres":"Racing / Driving > Behind view > Anime / Manga > Japanese-style adventure > Mini-games > Direct control > Automobile > Licensed","desc":"<p><em>Zero4 Champ: Doozy-J</em> is a racing game from <em>Zero4 Champ</em> series that comes with a full story mode with anime-style characters, and covers latest car models from six car manufacturers. Side from single-player story mode, the game includes VS two-player race where one can compete against a CPU or another player on the same screen, and time/speed attack mode. During the story mode there is an adventure style gameplay where player has options such as move somewhere, talk to other characters, look at something, or use an item.</p><p>Aside from the main game, there are several mini-games, such as cards, slot machine, RPG, which appear in the story mode, but can also be played as standalone. Some of not listed mini-games also include:</p><ul><li>Mezashi de Pon! - Platform game where you launch harpoon at various fish and underwater life from your boat. The player can only regular the angle of fire and time of launching the harpoon. The goal is to get as many fish within the allotted time.</li><li>Long Shoot - Basketball free kick mini-game where player can choose the angle at which to throw the ball at the net. This mini-game supports two players who throw the ball at the net in turns, first one who scores five nets wins. This mini-game uses side-view perspective.</li><li>The Storehouse - Top-down puzzle game where you need to properly stack boxes which come in various shapes in the allotted space before the time runs out.</li><li>Arm Champ - Arm wrestling mini-game from the first-person perspective showing only the player's and opponent's arm.</li></ul><p>| Car Data (for featured cars in the game) || Name | Engine | 0-100 km/h | Weight || --- | --- | --- | --- || Toyota Supra RZ-S | 2977 cc | 13.92 sec | 1490 kg || Toyota Celica GT-FOUR | 1998 cc | 13.55 sec | 1380 kg || Toyota MR2 GT-S | 1998 cc | 13.58 sec | 1260 kg || Nissan Skyline GT-R V-Spec | 2568 cc | 12.50 sec | 1540 kg || Nissan Silvia K's Aero | 1998 cc | 14.21 sec | 1250 kg || Nissan Fairlady Z 300ZX Twin Turbo | 2960 cc | 13.94 sec | 1570 kg || Nissan 180SX Type X | 1998 cc | 14.91 sec | 1220 kg || Mitsubishi GTO Twin Turbo | 2972 cc | 13.54 sec | 1710 kg || Mitsubishi Lancer GSR Evolution IV | 1997 cc | 13.30 sec | 1350 kg || Honda NSX | 2977 cc | 12.83 sec | 1350 kg || Honda Integra 3-door Coupe Type-R | 1797 cc | 14.27 sec | 1080 kg || Subaru Impreza WRX Type-RA Sti | 1994 cc | 13.29 sec | 1220 kg || Subaru Legacy Touring Sedan RS | 1994 cc | 14.53 sec | 1380 kg || Mazda RX-7 Type-RZ |  654 cc x2 |  13.61 sec |  1250 kg |</p>"},{"name":"Zoku Gussun Oyoyo Japan","year":1998,"developer":"Koga Game Factory","url":"e#Zoku%20Gussun%20Oyoyo%20Japan.zip","filesize":462486861,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga","desc":"<p><em>Zoku Hatsukoi Monogatari: Shūgaku Ryokō</em> is a mixture of adventure and \"love simulation\" - more specifically, first love. The player takes the role of a male student and can choose any time period between ground school to college. Every time period has four different girls that the hero can fall in love with. The player must choose one of those girls as the main love object. The setting is the same in every time period: the class goes on vacation to different places in Japan. Most of the game consists of traveling from place to place, trying to be at the right place the right time and make the right decision. The player must assemble a schedule for each location. It is possible to manage the player character's finances, as well as buy items that can be given to the girls.</p>"},{"name":"Zoop","year":1996,"developer":"Hookstone Ltd."},{"name":"Zork Collection","year":1998,"developer":""},{"name":"Zork I: The Great Underground Empire (Japan)","year":1996,"developer":"Arc System Works Co., Ltd.","url":"e#Zork%20I%20-%20The%20Great%20Underground%20Empire%20%28Japan%29.zip","filesize":557243085,"score":"","genres":"Adventure > 1st-person > Interactive fiction / text adventure > Puzzle elements > Fantasy","desc":"<p>A radical graphical remake of Zork: The Great Underground Empire made some 19 years after the series debut on a PDP-10 mainframe at MIT, this version boasts the incorporation of modern gameplay amenities undreamed of the first time around, such as automapping and, er, graphics.</p><p>Given ample time to drift wildly, the story and premise appear to have remained remarkably close to the source material -- the locations, layout and denizens of this fantastical subterranean treasure-hunt familiar to anyone with even a passing acquaintance with the original game. Where the biggest change lies, of course, is in the transition from the text parser to an interface controllable by a console's joystick. Adapting some sentence-construction conventions from the graphical adventure game genre (and the interfaces of Lucasfilm's and Legend's early entries in particular), menus selectable with a joystick pointer fill in for common \"action\" verbs while icons represent the inventory items the verbs influence; an expanded compass rose permits precise navigation of the Flatheadian ruins. (Alas! No secret joystick-button combination for \"xyzzy\"!)</p><p>In short: as faithful a reproduction of the original experience as you're going to find without employing a keyboard or voice-recognition software, plus \"modern\" graphics, sound and music!</p>"}]