[{"name":"007: Racing","year":2000,"developer":"Eutechnyx Limited","url":"psxchd1/007%20Racing%20%28Europe%29.chd","filesize":332977702,"score":5.9,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>In <em>007 Racing</em> you can get behind the wheel of James Bond's car.</p><p>You must complete missions which range from collecting an object and getting out alive, to much harder and more complicated things. Your car is armed with many weapons including mines, rockets, lasers, smokescreens, and more.</p><p>Then, if you get bored playing alone, you can eliminate your opponent in multiplayer missions where you have to destroy the other car, or a game mode called \"Pass the Bomb\", where you must pass the bomb to the other car by touching it before you blow up.</p>"},{"name":"007: The World is Not Enough","year":2000,"developer":"Black Ops Entertainment, LLC","url":"psxchd1/007%20-%20The%20World%20Is%20Not%20Enough%20%28Europe%29.chd","filesize":413227700,"score":6.7,"genres":"Action > 1st-person > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p><em>007: The World is Not Enough</em> is based off of the 1999 James Bond film of the same name. In it, Pierce Brosnan's Bond must investigate the murder of a British oil tycoon and attacks on his new pipeline, which leads to a larger sinister plot requiring gunplay and frequent flier miles to diffuse.</p><p>This version of the game has a few notable differences to its Nintendo 64 counterpart: it runs off a version of the Medal of Honor engine, and has 11 missions in contrast to the N64's 14; some of which are not shared between the two. The missions that are similar (usually those taken from the film) further tend to play out differently, and utilize completely different gadgets and weaponry. </p><p>This version does not feature additional objectives at higher difficulty modes, and only cheats are unlocked by beating specific missions at a specific difficulty. However, it does feature CD-quality music and voices, as well as video clips from the movie for cutscenes. It is single-player only, and features no multiplayer component.</p>"},{"name":"007: Tomorrow Never Dies","year":1999,"developer":"Black Ops Entertainment, LLC","url":"psxchd1/007%20-%20Tomorrow%20Never%20Dies%20%28Europe%29.chd","filesize":330945390,"score":6.8,"genres":"Action > Behind view > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>In <em>007: Tomorrow Never Dies</em>, which is based on the movie of the same name, the player takes the role of the famous James Bond who fights against Elliot Carver. Carver tries to increase his TV ratings by creating a war between the British and the Chinese. To achieve his goal he sunk a British ship with his stealth ship and made it look like the Chinese Air Force was the offender. Now it is Bond's responsibility to set things right...</p><p>Most of the ten levels are like traditional third-person-shooters where the player walks around the levels while killing numerous foes. While there is an option for a free aim most enemies can be dispatched with the auto-lock function. This means if the player gets close enough to an enemy while using an appropriate gun the game automatically shoots at him when the player faces the general direction. Bond also has gadgets to his disposal which are used to fulfill the mission goals. There are two missions which differ from this formula: in the driving sequence the player chases and shoots at enemy cars while avoiding obstacles; during the skiing part he is mainly concerned with dispatching other skiers which want to bring him out of balance.</p>"},{"name":"1 on 1","year":1998,"developer":"Jorudan Co., Ltd."},{"name":"2002 FIFA World Cup","year":2002,"developer":"Software Creations Ltd.","url":"psxchd1/2002%20FIFA%20World%20Cup%20%28Europe%29%20%28En%2CSv%29.chd","filesize":334551550,"score":7.3,"genres":"Sports > Diagonal-down > Direct control > Multiple units/characters control > Football (European) / Soccer > Asia > Japan (Modern/Futuristic) > Licensed","desc":"<p><em>2002 FIFA World Cup</em> is the official game of the 17th FIFA World Cup, held in Korea and Japan between May 31 and June 30. It is based on the engine of FIFA Soccer 2002, so experienced Fifa players can get used for it quite fast. </p><p>It is based on the 2002 World Cup - Korea and Japan and includes all of the countries who promoted to the World Cup, and a lot more. Small statistics are shown for every country - their last biggest win, appearances at the World Cup, etc.</p><p>The stadium and all players are really detailed. The player's texture's resolution is so high, you can easily recognize most of them. The stadium is big and impressive and full of colored crowd.</p><p>As in <em>FIFA Soccer 2002</em>, the animation was taken from real players, with motion sensors. Thus, some new animation was added - new sliding, falling, and more.</p><p>And the newest feature of <em>2002 FIFA World Cup</em>, is the air ball control model. You can take balls from the air, and have much more control with them - creating great goals from the air.</p>"},{"name":"2Xtreme","year":1996,"developer":"Sony Interactive Studios America","url":"psxchd1/2Xtreme%20%28Europe%29.chd","filesize":386631772,"score":6.3,"genres":"Racing / Driving > Sports > Behind view > Tricks / stunts > Skateboarding > Snowboarding / skiing > Bike / Bicycling > Licensed","desc":"<p><em>2Xtreme</em> is the sequel to ESPN Extreme Games where the player takes part in a series of extreme races with only one goal: to win at any cost.</p><p>There are four different kinds of racing: <em>snowboard</em>, <em>bike</em>, <em>inline skates</em> and <em>skateboards</em> and four different locations to choose from: Japan, Africa, Las Vegas, and Los Angeles, each with three different tracks to master.</p><p>The main goal of the game is to advance through the level, punching and kicking opponents and avoiding obstacles scattered throughout the stage. The player can also perform mid-air tricks to earn extra money to add to their race winnings to buy better parts for their various means of transportation. Players can also play in a season mode, single race against computer opponents, or go head to head with a friend.</p>"},{"name":"360: Three Sixty","year":1999,"developer":"Smart Dog","url":"psxchd1/360%20Three%20Sixty%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.chd","filesize":286298531,"score":"","genres":"Action > Racing / Driving > Behind view > Arcade > Shooter > Direct control > Hovercraft > Vehicular combat > Sci-fi / futuristic","desc":"<p><em>360: Three Sixty</em> is an arcade and futuristic racing game set in a submerged world. Players can choose from multiple hovercrafts with different statistics based on acceleration, agility, armour and speed. Races take place in different environments with multiple laps per race. In addition to racing the vehicles can shoot each other and there is also a first-person reverse view to keep back chasers. Tracks contain pick-ups with new weapons and other types of items such as a shield. A regular cannon is always available as a weapon. Next to racing levels there are arena levels where opponents shoot each other and do not race. Game modes include Tournament, Time Trial and a two-player split-screen multiplayer mode.</p>"},{"name":"3D Baseball","year":1996,"developer":"Crystal Dynamics, Inc.","url":"psxchd1/3D%20Baseball%20%28USA%29.chd","filesize":171017346,"score":7,"genres":"Sports > Behind view > Baseball > Licensed","desc":"<p><em>3D Baseball</em> is a 3-D polygon baseball game with over 700 actual Major League players and their previous years stats to choose from. There are over 50 real-life batter stances that were motion-captured through the actual players themselves with five different dynamic camera angles to choose.</p><p>The standard modes apply such as <em>Exhibition</em> and <em>Pennant</em> along with a <em>General Managers Mode</em> where players can trade and even alter the stats of their players to create the ultimate team. It feature realistic animation and the voice talents of Van Earl Wright with over 1,000 different commentary phrases.</p><p>Though it did feature the MLBPA (Major League Baseball Players Association) license, it did not however feature the actual MLB (Major League Baseball) team names and logos.</p>"},{"name":"3D Shooting Tsukuru","year":1996,"developer":"Success Corp."},{"name":"3x3 Eyes: Kyūsei Kōshu","year":1995,"developer":"Nihon Create"},{"name":"3x3 Eyes: Tenrin Ō Genmu","year":1998,"developer":"Nihon Create"},{"name":"3Xtreme","year":1999,"developer":"989 Studios","url":"psxchd1/3Xtreme%20%28USA%29.chd","filesize":212149626,"score":5.7,"genres":"Racing / Driving > Sports > Behind view > Tricks / stunts > Skateboarding > Bike / Bicycling > Licensed","desc":"<p>This extreme racing game comes with four different game modes. The modes are Season, Exhibition, Time Trial, and Freestyle. The main mode is the Season mode, which lets the player race through three circuits of a number of races each. The first circuit has six races, the second eight races, and the third has ten races. In these races the player is competing against five other racers in order to get in the top three positions for season standing points. The higher the position in the race, the more points the player will have to spend on better equipment. Also during the races the player can go through gates and perform various tricks (over 270 are doable in the game), which will also net the player some extra points to spend on better equipment. While racing, player are allowed to hit their opponents in order to get an advantage in the race.</p><p>The game features 13 different racers to use. Each racer has their own strength,stamina,freestyle,quickness, and agility ratings. Each racer also only specializes in one type of equipment to race with. The type of equipment they can specialize in is either skateboarding, in-line skates, or biking. </p><p>The equipment itself is licensed from real life, such as including the Redline Double X and FS 840. There are 70 different types of equipment in total. Each piece of equipment is rated on its top speed, freestyle ability, handling, and acceleration.</p><p>The game features 27 different courses to race on.</p>"},{"name":"4-4-2 Soccer","year":1997,"developer":"Arc Developments","url":"psxchd1/4-4-2%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":144435797,"score":"","genres":"Sports > Diagonal-down > Side view > 2D scrolling > Direct control > Football (European) / Soccer","desc":"<p><em>4-4-2 Soccer</em> is a football game with real teams and players. It features friendly games, a world cup, league and KO competitions. Two players are supported through regular multiplayer and up to four players simultaneously through multitap.</p>"},{"name":"40 Winks","year":1999,"developer":"Eurocom Developments Ltd","url":"psxchd1/40%20Winks%20%28Europe%29.chd","filesize":376852288,"score":6.3,"genres":"Action > Behind view > Platform > Fantasy","desc":"<p><em>40 Winks</em> is a 3D action-platform game in which you play as Ruff or Tumble, two children who must battle ghosts, goblins and other monsters in their dream-world. They must try to capture 40 winks scattered around the world in order to stop an evil old man named Nitekap. Nitekap wants to turn the winks into hood-winks, the things responsible for nightmares. You also have to find the 12 dream keys to unlock the boss level. A unique aspect of the game allows the players to temporarily morph into different costumes with special abilities. The costumes include a Prehistoric Man, Jester, Super Hero, and Ninja.</p>"},{"name":"4x4 World Trophy","year":1999,"developer":"Accolade, Inc.","url":"psxchd1/4x4%20World%20Trophy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":202119440,"score":5.5,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Vehicle simulator > Licensed","desc":"<p>Test Drive Off-Road 3 is a off-road racing game that features 27 fully-licensed sport utility vehicles to race in (from manufacturers like Jeep, Nissan and Ford), with different attributes such as top speed, handling, acceleration and suspension.</p><p>The vehicles are customizable: you can change color, engine, tires, suspension and some special upgrades (which are purchased with credits earned after championship races).</p><p>There are 11 off-road tracks in different environments (forests, mountains, etc.), which can be raced in two game modes: Arcade (single-race) and World Tour (championship).</p><p>There is no multiplayer mode in the PC version, while the PlayStation version supports 2 players.</p><p>The music is played by signed artists such as Blink 182 and Incubus.</p>"},{"name":"5 Star Racing","year":2003,"developer":"Kung Fu Games","url":"psxchd1/5%20Star%20Racing%20%28Europe%29.chd","filesize":244553811,"score":"","genres":"Racing / Driving > Behind view > Automobile > Track racing","desc":"<p><em>5 Star Racing</em> is budget car racing game featuring five game modes: Custom Car Derby, Speed Duel, Super Car Chase, Muscle Machines and Rally Rider. Each game mode features an easy track and a hard track, and two vehicle models in some color variations.</p><p>Gameplay has the player racing their vehicle against 5 opposing vehicles all competing for first place. During a race the game keeps track of the players lap time. Options include setting the difficulty level to either easy, medium or hard and setting the number of laps to either 3 or 15 total laps.</p>"},{"name":"70's Robot Anime: Geppy-X","year":1999,"developer":"Seven Computerized Creations"},{"name":"99 Kōshien","year":1999,"developer":"Magical Company Ltd."},{"name":"Élan","year":1999,"developer":"Visco Corporation"},{"name":"Élan Plus","year":2000,"developer":"Visco Corporation"}]