[{"name":"A Collection of Activision Classic Games for the Atari 2600","year":1998,"developer":"LTI Gray Matter","url":"psxchda/Activision%20Classics%20%28USA%29.chd","filesize":51018837,"score":5.8,"genres":"Compilation","desc":"<p>A collection of 30 classic Activision and Imagic titles originally published for the Atari 2600:</p><ul><li>Atlantis</li><li> Barnstorming</li><li>Boxing</li><li>Chopper Command</li><li>Cosmic Commuter</li><li>Crackpots</li><li>Dolphin</li><li>Dragster</li><li>Enduro</li><li>Fishing Derby</li><li>Freeway</li><li>Frostbite</li><li>Grand Prix</li><li>H.E.R.O.</li><li>Ice Hockey</li><li>Kaboom!</li><li>Keystone Kapers</li><li>Laser Blast</li><li>Megamania</li><li>Pitfall!</li><li>Plaque Attack</li><li>River Raid</li><li>River Raid II</li><li>Seaquest</li><li>Skiing</li><li>Sky Jinks</li><li>Spider Fighter</li><li>Stampede</li><li>Starmaster</li><li>Tennis</li></ul>"},{"name":"A Collection of Classic Games from the Intellivision","year":1999,"developer":"LTI Gray Matter"},{"name":"A IV Evolution: A Ressha de Ikou 4","year":1994,"developer":"Artdink Corporation"},{"name":"A Mars Moose Adventure: Cosmic Quest 1 - City Sights","year":1998,"developer":"Lightspan, Inc."},{"name":"A Mars Moose Adventure: Cosmic Quest 2 - Fairy Tale Island","year":1998,"developer":"Realtime Associates, Inc."},{"name":"A Mars Moose Adventure: Cosmic Quest 3 - Race Through France","year":1999,"developer":"Lightspan, Inc."},{"name":"A Mars Moose Adventure: WalkAbout 1 - The Natural History Museum","year":1999,"developer":"Lightspan, Inc."},{"name":"A Mars Moose Adventure: WalkAbout 2 - The Shakespeare Festival","year":1999,"developer":"Lightspan, Inc."},{"name":"A Mars Moose Adventure: WalkAbout 3 - World Sports Day","year":1998,"developer":"Lightspan, Inc."},{"name":"A-Train","year":1995,"developer":"Artdink Corporation","url":"psxchda/A-Train%20-%20Trains%2C%20Power%2C%20Money%20%28USA%29%20%28En%2CJa%2CFr%2CDe%29.chd","filesize":39270531,"score":7.1,"genres":"Simulation > Diagonal-down > Isometric > Managerial / business simulation > Train","desc":"<p>In the role as the head of a major transport company it is the player's goal to build up an efficient train and bus system. The player is also free to buy and sell land, build housings and try to make money on the stocks market. The game also features a spectator mode, in which players can enter one of your trains and enjoy the ride in a 3D perspective.</p><p><em>A-Train</em> is the international version of the Japanese PlayStation launch title A.IV. Evolution, itself a reworked port of Take the A-Train IV. It adds 15 new locations and a wide variety of new trains from multiple countries, as well as updated graphics and new music arrangements compared to the original release.</p>"},{"name":"A.IV. Evolution (Hatsubai Kinen Gentei Set)","year":1994,"developer":"Artdink Corporation","url":"psxchda/A.IV%20-%20Evolution%20Global%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%29.chd","filesize":46757665,"score":"","genres":"Simulation > Isometric > Managerial / business simulation > Train","desc":"<p>This is a special limited-edition release of A.IV. Evolution packaged in an oversize box. It includes the game itself, an official PlayStation mouse and memory card, memory card label stickers, and a mousepad featuring the game's logo.</p>"},{"name":"A2 Racer III: Europa Tour","year":2000,"developer":"Davilex Games B.V."},{"name":"Abalaburn","year":1998,"developer":"Tamsoft Corporation"},{"name":"Ace Combat 2","year":1997,"developer":"Namco Limited","url":"psxchda/Ace%20Combat%202%20%28Europe%29.chd","filesize":332561043,"score":7.9,"genres":"Action > 1st-person > Behind view > Shooter > Flight / aviation > Vehicular combat","desc":"<p><em>Ace Combat 2</em> is the sequel to Namco's PSX combat flight simulator Air Combat. Ace Combat 2 puts you back in the cockpit as a mercenary pilot out to foil a world-threatening terrorist plot. You'll proceed through 30 missions in which your success will allow you to buy weapon upgrades, parts and other gimmicks just like in the original. </p><p>The game offers sharper graphics and sounds, more planes and options, dual shock support as well as adding analog joystick support.</p>"},{"name":"Ace Combat 3: Electrosphere","year":1999,"developer":"Namco Limited","url":"psxchda/Ace%20Combat%203%20-%20Electrosphere%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":278464263,"score":7.3,"genres":"Action > 1st-person > Behind view > Shooter > Flight / aviation > Vehicle simulator > Regional differences","desc":"<p>In <em>Ace Combat 3: Electrosphere</em> the player takes the place of an ace fighter pilot who works for an organization called \"UPEO\" and has to accomplish various missions, e.g. taking out a special aircraft carrier or taking out enemy satellite systems in orbit around earth. The player can earn ratings from A to D: the higher the rating, the higher the chance that the player can acquire new kinds of planes. The game has many environments which range from normal aerial missions to stratospheric missions and even outer space missions. A special catch is that the player often has to make decisions during missions which influence the overall storyline. There is also an autopilot feature which can be used to land or reach a destination.</p>"},{"name":"Aces of the Air","year":2002,"developer":"Highwaystar Co., Ltd.","url":"psxchda/Aces%20of%20the%20Air%20%28USA%29.chd","filesize":357200454,"score":"","genres":"Action > Simulation > Behind view > Flight / aviation > Vehicular combat","desc":"<p><em>Aces of the Air</em> attempts to simulate combat aviation using planes from around the World War II era.</p><p>Missions involve destroying enemy aircraft and bases on the ground.Completed missions will earn the player a new plane to add to their hangar. Each plane has their own ratings in acceleration, max speed, turnability, durability, and gun equipment. Player's can also customize the color of their planes.</p><p>Planes can adjust their pitch, turn, throttle up and down, and can use guns, bombs, and rockets as weapons.</p>"},{"name":"Acid","year":1999,"developer":"Taki Corporation"},{"name":"Aconcagua","year":2000,"developer":"WACWAC!"},{"name":"Action Bass","year":1999,"developer":"Vingt et un Systems Corporation","url":"psxchda/Action%20Bass%20%28Europe%29.chd","filesize":75060994,"score":6.1,"genres":"Action > Sports > Arcade > Fishing","desc":"<p><em>Action Bass</em> is an arcade-type fishing game that emphasizes the action of trying to catch a big fish, and the struggle of reeling it in without it getting away. The game features two game modes, which are Challenge and Free mode.</p><p>In the challenge mode, players compete in a tournament where they are given three minutes to catch a fish large enough to meet the weight requirement, and this fish must also weigh enough to place within the top three of all the competitor fisherman's catches in order for the player to move on the next fishing area. The skilled fisherman who can complete the challenge mode, will be able to unlock new fishing lures and fishing areas.</p><p>In the free mode, players are free to choose from four different fishing areas to practice in, with no competition or time limit to worry about. The fishing areas include fishing by the boathouse, fishing in a jungle setting, fishing by a waterfall which makes the water cloudy, and fishing while the sun is setting.</p><p>When the player starts fishing, they must first choose a lure. Some of the lures include the minnow, popper, and pencil bait which each have their own characteristics.</p><p>Once the line is cast, a lure action meter appears and the player has to fill it in order to attract the fish. Once the fish gets attracted and gets caught on the line, a line tension meter appears. The player has to be careful while reeling in the fish, to not let this meter fill, or else the line will snap and the fish will be lost. </p><p>The player also gets to keep their 5 biggest catches alive in their aquarium.</p>"},{"name":"Action Man: Destruction X","year":2000,"developer":"Blitz Games Ltd.","url":"psxchda/Action%20Man%20-%20Destruction%20X%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":220431547,"score":5.9,"genres":"Action > Racing / Driving > Behind view > Diagonal-down > Shooter > Spy / espionage > Licensed","desc":"<p>The master criminal Dr. X is planning to steal scientific secrets in order to control the world. This is of course when Action Man steps in to thwart his plans.</p><p><em>Action Man: Destruction X</em> takes place over three different cities throughout the world for a total of 36 different missions. Missions include things such as infiltrating Dr. X's hidden jungle lab and taking out prehistoric monstrosities or driving in a King of the Streets race. Gameplay varies greatly such as the game having a behind view boomerang shooting portion and a bird's eye view racing section. Action Man gets to drive things like a Silver Speeder and a Polar Bike.</p><p>The game has both a story mode and an arcade mode.</p>"},{"name":"Action Man: Operation Extreme","year":1999,"developer":"Interactive Studios Ltd.","url":"psxchda/Action%20Man%20-%20Operation%20Extreme%20%28USA%29.chd","filesize":267894206,"score":5.7,"genres":"Action > Racing / Driving > Diagonal-down > Shooter > Spy / espionage > Licensed","desc":"<p>Action Man, hero of the TV animated series, is out to stop  Dr. X's latest plan for world conquest.  He'll travel through 26 action missions from burning deserts to the frozen North Pole fighting robot warriors, mutant plants and deadly insects among other enemies. </p><p>The game has two distinct types of levels - Action levels where the hero is on foot from a third-person view and Vehicle levels where various high speed cars, planes and boats are drivable from an isometric view.  The missions include rescuing a kidnapped scientist, preventing a satellite launch by criminals, and retrieving a top secret formula among others.</p>"},{"name":"Actua Golf","year":1996,"developer":"Gremlin Interactive Limited","url":"psxchda/Actua%20Golf%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":192195753,"score":7.8,"genres":"Simulation > Sports > 3rd-person (Other) > Golf","desc":"<p><em>Actua Golf</em> is a golf simulation with full 3D terrain and characters. It comes with two courses to play at (country and tropical), customizable characters and multi-view shot tracking and action replays.</p><p><em>Actua Golf</em> uses similar game controls as older golf titles did. With a swing meter, where you have to time correctly to hit the ball right.</p><p>The game features two difficulties and various game modes such as foursome, four ball challenge and skins. </p><p>Commentary in the game is provided by Tony Adamson, Pat O'Brien, and Peter Alliss.</p>"},{"name":"Actua Golf 2","year":1997,"developer":"Gremlin Interactive Limited","url":"psxchda/Actua%20Golf%202%20%28Europe%29.chd","filesize":196324543,"score":6.8,"genres":"Simulation > Sports > 3rd-person (Other) > Golf > Licensed","desc":"<p>An amateur golf sim featuring no PGA endorsed courses or players. The game uses the standard golf gameplay mechanics, with three types of swings, a two or three click swing bar system, or the \"Fox Sports Swing\" which is mouse-motion swing type.</p><p>The game's most prominent feature is the use of a 3d engine and a series of 3d accelerated effects like reflecting water, lighting effects, trees that move and sway with the wind and translucent objects. The game features 8 single player courses and multiplayer support for up to 4 players.</p>"},{"name":"Actua Golf 3","year":1998,"developer":"Gremlin Interactive Limited","url":"psxchda/Actua%20Golf%203%20%28Europe%29.chd","filesize":236544103,"score":7.1,"genres":"Sports > Behind view > Golf","desc":"<p><em>Actua Golf 3</em> is a golf simulation game featuring eight courses. You can completely customize your own character. With a new character you start with amateur tournaments until you have removed your handicap. Then you can participate in the pro tournaments.</p><p>To hit the ball in this game the player will have to use his analogue stick and swing that much like a real club.</p><p>The game features commentary by Peter Alliss and Alex Hay.</p>"},{"name":"Actua Ice Hockey","year":1998,"developer":"Gremlin Interactive Limited","url":"psxchda/Actua%20Ice%20Hockey%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%2CFi%29.chd","filesize":133446733,"score":6.5,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey","desc":"<p>Another sport was added to the Actua series in this license of the Ice Hockey component of the 1998 Winter Olympics. You can choose from any of the leading teams and attempt to lead them to glory, starting from the qualifiers, with friendly matches (surely a misnomer in the tough world of Ice Hockey) and a practice mode also on offer. Players are motion-captured, and the action can be viewed from multiple camera angles. Paul Ferguson provides a running commentary, and full replays are provided.</p>"},{"name":"Actua Ice Hockey 2","year":1999,"developer":"Gremlin Interactive Limited","url":"psxchda/Actua%20Ice%20Hockey%202%20%28Europe%29.chd","filesize":132564022,"score":6.6,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey","desc":"<p><em>Actua Ice Hockey 2</em> is the follow-up of the official game of the Nagano 1998 Winter Olympics ice hockey tournament, Actua Ice Hockey. Focused on a fictional North American league, with GHL (Gremlin Hockey League) club teams, the game enhances the graphics and gameplay of the previous version. While the game is unlicensed, all teams were inspired by their real NHL counterparts, from team logos to player names (using the classic trick of changing one letter from the name to other phonetically close). </p><p>Features include three speeds of play, a three-on-three arcade mode with smaller ring, network play and advanced body collision physics. Like NHL Championship (released around the same time), the game adds a coloured track to the puck named \"GremTrax\". Slower shots and passes are coloured green, and faster red (opposite to the blue/red combination used by Fox). Tactics were not forgotten, and the player is able to select the lines, select how and how fast teams build up the attack and are expected to shoot on goal and how to defend. If the player does not feel like controlling everything, tactical decisions can be left to the computer. It's also possible to trade players to balance or keep rosters up to date.</p>"},{"name":"Actua Pool","year":1999,"developer":"Mirage Technologies (Multimedia) Ltd.","url":"psxchda/Actua%20Pool%20%28Europe%29.chd","filesize":369472010,"score":6.9,"genres":"Sports > 1st-person > Pool / snooker","desc":"<p><em>Actua Pool</em> is a pool simulation game. Game modes include a two player match, hustle mode, trick shots, tournaments and an interactive tutorial. Winning tournaments unlocks new NPCs to play against. Each NPC opponent has its own unique playing style and difficulty. You can play on a variety of different tables.</p>"},{"name":"Actua Soccer","year":1996,"developer":"Gremlin Interactive Limited","url":"psxchda/Actua%20Soccer%20%28Europe%29%20%28En%2CFr%29.chd","filesize":149866199,"score":6.8,"genres":"Sports > Diagonal-down > Football (European) / Soccer","desc":"<p>In 1995 the increased power of the new wave of systems made 3D football games a possibility several companies investigated. Most of the features people later took for granted in football games were pioneered, or at least fairly fresh, when they appeared in the first of the Actua Sports titles.</p><p>Multiple camera angles were available to view the full-3D action, with 3 Sheffield Wednesday FC players providing motion capture. 44 international squads of 22 players, each with 8 individual skill attributes, were featured. BBC commentator Barry Davies provided a full flowing commentary over the top. A full range of customised tournaments were available, as well as multi-player options allowing for both same-system and networked play.</p>"},{"name":"Actua Soccer 2","year":1997,"developer":"Gremlin Interactive Limited","url":"psxchda/Actua%20Soccer%202%20%28Europe%29%20%28En%2CFr%29.chd","filesize":221432808,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p>Following the success of the first Actua Soccer game, a sequel was likely. The game is fast-paced with more of an action than simulation feel, and an emphasis on ground play rather than heading.</p><p>A young Michael Owen provides motion capture to produce realistic player motions and actions - the different builds and styles of players are taken into account. 64 top international teams are featured, as are 24 distinct stadiums, with weather conditions having both visible and noticeable playing effects.</p><p>This was one of the first games to feature 2-man commentary, with former England captain Trevor Brooking joining Barry Davies in the analytical role.</p>"},{"name":"Actua Soccer 3","year":1998,"developer":"Gremlin Interactive Limited","url":"psxchda/Actua%20Soccer%203%20%28Europe%29.chd","filesize":240852718,"score":7.3,"genres":"Sports > Diagonal-down > Football (European) / Soccer","desc":"<p>Arcade football action is recreated using motion captured graphics. As well as creating a custom tournament, you can play any of 25 leagues, with a total of 450 teams and 10,000 players featured. You can create your own squad, or customise the existing ones by trading and editing players. Tactics can be refined based on formation, defensive style and attacking approach. Realistic weather effects are incorporated into both appearance and gameplay. Barry Davies and former Celtic manager Martin O'Neill are the commentators.</p>"},{"name":"Actua Soccer: Club Edition","year":1997,"developer":"Gremlin Interactive Limited","url":"psxchda/Actua%20Soccer%20-%20Club%20Edition%20%28Europe%29.chd","filesize":135052284,"score":6,"genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p><em>Actua Soccer Club Edition</em> is a re-edition of Actua Soccer, released with the 20 teams of the English Premiership instead of international competitions. New commentary was recorded and some Premiership historical data was included. All remaining aspects of the game were unchanged or just tweaked.</p><p>The rest of the game is well known to fans of the genre - it was the first fully polygonal football game on the market, which allowed an unprecedented graphical realism and (technically) unlimited camera angles.</p>"},{"name":"Actua Tennis","year":2000,"developer":"Gremlin Interactive Limited","url":"psxchda/Actua%20Tennis%20%28Europe%29.chd","filesize":225856740,"score":6.2,"genres":"Sports > Diagonal-down > Tennis > Licensed","desc":"<p><em>Actua Tennis</em> features the Actua Sports concept of a fully 3D environment with multiple camera views for both the action and the replays, and motion captured player actions. You can design your player and then put him to the test in a series of tournaments around the world. Drop, lob and smash shots are all on offer, as are singles and doubles matches for up to 4 human players. The former Australian tennis player Pat Cash provides the commentary.</p>"},{"name":"Addiction Pinball","year":1999,"developer":"Team17 Software Limited"},{"name":"Addie no Okurimono: To Moze from Addie","year":2000,"developer":"addie software"},{"name":"Adiboo & Paziral's Secret","year":2003,"developer":"Neko Entertainment SARL","url":"psxchda/Adiboo%20%26%20Paziral%27s%20Secret%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":414989445,"score":"","genres":"Action > Side view > Arcade > Platform","desc":"<p><em>Adiboo &amp; Paziral's Secret</em> is a 3D action adventure game with 12 levels. Players will take control of Adiboo and help rescue the citizens of peaceful Tonies Island from the threat of mysterious island. The mysterious island has a leader named Paziral. To unveil his secret player must come across five levels: volcano, lagoon, forest, temple, and metal island. The game is divided into platform, racing, and arcade stages.</p>"},{"name":"Adidas Power Soccer","year":1996,"developer":"Psygnosis Limited","url":"psxchda/Adidas%20Power%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":273668988,"score":5.7,"genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p><em>adidas Power Soccer</em> is a sports game which simulates soccer. While it has the option to play in simulation mode, it is best remembered for the Arcade mode and the trademark move of the game - the Predator Shot (named after the most popular brand of boots manufactured by the German company). In this mode, all special moves are unlocked, and some of them allow to go way beyond what rules allow.</p><p>4 cameras allow to follow the motion-captured action in the best way possible. Commentary is available in English, German and French.</p>"},{"name":"Adidas Power Soccer 2","year":1997,"developer":"Shen Technologies SARL","url":"psxchda/Adidas%20Power%20Soccer%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":362388453,"score":"","genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p><em>adidas Power Soccer 2</em> is the second main game in the Psygnosis series and was made by a different development studio. Continuing the 3D gameplay from the first game, this title adds updated player and team databases for the 1997-1998 season, a new arcade mode where players can perform special moves, commentary by ITV's Brian Moore (UK), Yves Lecoq (France) and RTL's Marcel Reif (Germany), and eight new stadia fully rendered in 3D.</p><p>The title includes many real Premier League teams, in addition to 56 national teams and top clubs. Multiplayer is available for up to four players with a multitap.</p>"},{"name":"Adidas Power Soccer 98","year":1998,"developer":"Shen Technologies SARL","url":"psxchda/Adidas%20Power%20Soccer%2098%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":486376331,"score":6,"genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p><em>adidas Power Soccer 98</em> is the fourth and final title in the Psygnosis series. Offering the classic mix of arcade and simulated gameplay from the previous games, this edition updates the game twelve different types of tournaments and cups, eleven international leagues, 120 national teams and about 30 different stadia to play in.</p><p>Aside from the classic gameplay players have different moves such as flick-passes, short dribbles, and sliding tackles. In both (arcade modes and simulation), there is a speed button that makes players run at an extreme and somewhat unrealistic speed. It is not entirely an advantage as using it widens the gap between the ball and the foot, leaving players wide open for tackles. Unlike similar games, there also isn't a way to scroll through the available players - the game automatically selects the player nearest to the ball.</p><p>The camera is dynamic and smoothly zooms in and out to give the best overview of the pitch. Multiplayer is available for up to four players through multitap. It was released in June of 1998 to coincide with the 1998 World Cup played in France at that time.</p>"},{"name":"Adidas Power Soccer International '97","year":1997,"developer":"Psygnosis Limited","url":"psxchda/Adidas%20Power%20Soccer%20International%20%2797%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":212010759,"score":"","genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p>This sequel to the early PlayStation bestseller adidas Power Soccer expands on the number of available leagues (from 3 to 5, with Spain and Italy adding to the English, French and German leagues) and a \"Top 20\" division with top European Clubs, as well as 56 national teams. The usual game modes and options in the genre make a presence here, being possible to play cups, tournaments or leagues.</p><p>As with the previous game, the same fast-paced gameplay remains, while the regular mode isn't much different from the remaining sports game in the first years of the console, with the face buttons controlling the basic aspects of the game, such as passing, lobbing or kicking (or different kind of lunges on defence). However, the game gains a new dimension in the \"arcade mode\", where it's possible to bend the rules with infamous kicks to the head or unleash the trademark move of the series - the Predator Megakick, named after the then revolutionary boot models. However, doing those decrease the players' stamina meter, and after the bar is depleted, players not only no longer can make special moves, but also take longer to recover from a tackle, so longer games can be won (or lost) by the number of players that can't feel their legs no more.</p>"},{"name":"ADVAN Racing","year":1998,"developer":"Atlus Co., Ltd."},{"name":"Advanced V.G.","year":1996,"developer":"Technical Group Laboratory, Inc."},{"name":"Advanced V.G. 2","year":1998,"developer":"Technical Group Laboratory, Inc."},{"name":"Adventures of Lomax, The","year":1996,"developer":"Psygnosis Limited","url":"psxchda/Adventures%20of%20Lomax%2C%20The%20%28USA%29.chd","filesize":409208699,"score":7,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Cute, green-haired yet halfwitted creatures Lemmings this time appear in a platformgame. As the only survivor Lemming that managed to rescue himself from the evil spellof Evil Ed, you (Lomax) must stop Evil Ed's distracting effect over the LemmingLand.</p><p>In your quest most of your enemies will be Hench Lemmings which've been possessedby Evil Ed's evil spell. You will be mainly using your spin attack or -when grabbed-your magic helmet to free these imprisoned Lemmings from the spell.</p><p>You have also some special abilities like building a bridge, digging horizontally through certain obstacles (just like the other Lemmings games) or throwing a flaminghelmet that will help you to accomplish your goal.</p>"},{"name":"Adventures of Robin Lloyd, The","year":2000,"developer":"Gust Co., Ltd."},{"name":"Aeon Flux","year":2005,"developer":"Terminal Reality, Inc.","url":"psxchda/Aeon%20Flux%20%28USA%29%20%28Proto%29.chd","filesize":2510161,"score":6.7,"genres":"Action > Behind view > Arcade > Puzzle elements > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p><em>Aeon Flux</em> is a 3rd person action game inspired by the 2005 movie of the same name. The story takes place 400 years in the future after the majority of Earth's population has been wiped out by industrial disease. Only one city, Bregna, remains. The city is run by the group of scientists who had discovered the vaccine to prevent the disease, but a group of rebels known as the Monicans oppose their rule. </p><p>You control the main character of the story, Aeon Flux. Aeon is a skilled fighter, and can perform light and heavy strikes, combo attacks, and a variety of acrobatic attacks. When an enemy has only a small amount of health left, you also have the ability to perform a takedown attack; when successful this will award you a bonus, such as extra health. Aeon has a health meter and a style meter; when the health meter is depleted, the game is over. The style meter is filled by attacking or killing enemies; when you have earned enough style, you can charge up your combo attacks for extra damage. Aeon is also equipped with a gun called the FUG (Flux Universal Gun) as well as various gadgets. To use the gun you will need ammo which can be picked up at various locations on each level. The various gadgets and gizmos available need to be used to get past certain areas and solve some puzzles; intel capsules provide you with important data, small orbs can be controlled to disable alarms and activate doors, Aeon can hide in rollers to navigate through areas undetected, and more.</p>"},{"name":"AFL 99","year":1999,"developer":"The Creative Assembly Ltd.","url":"psxchda/AFL%2099%20%28Australia%29.chd","filesize":151713217,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Licensed","desc":"<p>The big game flies even higher. Spectacular marks, huge kicks and bone-crushing collisions.</p>"},{"name":"Afro Ken: The Puzzle","year":2001,"developer":"Axes Art Amuse","url":"psxchda/Agent%20Armstrong%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":398994041,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Tile matching puzzle > Direct control","desc":"<p><em>Afro Ken: The Puzzle</em> is a puzzle game where you control a dog who has to align afros by color and then stomp on them to make them disappear. You have to be quick though, since the water level rises constantly and there are spikes in the ceiling. The only way to keep it down is to constantly make afros disappear. If you manage to get combos, the water goes down even more.</p><p>You can move the afros around one square at the time, much like in a sliding puzzle by walking over them. You have to do this to align the afros in groups of at least four, so you can stomp them. There are also other obstacles to get in your way, such as bombs and big rocks that can't be destroyed very easily.</p><p>The game features the standard puzzle play modes; Timed, versus, endless puzzle and more.</p>"},{"name":"Agent Armstrong","year":1997,"developer":"King of the Jungle Ltd."},{"name":"Agile Warrior: F-111X","year":1995,"developer":"Black Ops Entertainment, LLC","url":"psxchda/Agile%20Warrior%20-%20F-111X%20%28Europe%29.chd","filesize":345264633,"score":5.8,"genres":"Action > Behind view > Arcade > Flight / aviation > Vehicle simulator","desc":"<p>Because of international conflicts and new dangers due to terrorist attacks the Air Force needed to construct a new warplane which can be uses for multiple roles like frontal attacks or stealth operations. The result: a mixture between the YF-23's (high performance airframe), the X- 31's (thrust-vectoring maneuverability), and the F-111's (superior terrain and weapon-guidance systems).</p><p>In <em>Agile Warrior: F-111X</em> the player pilots one of these aircraft to solve the mentioned issues in about six missions. To be successful he needs to utilize all of the aircraft's features, e.g. rockets, a radar which uncovers nearby enemies or the ability to cloak. The latter is important during the stealth missions in which the player needs to avoid hostile radars.</p>"},{"name":"AI Mahjong Selection","year":2002,"developer":"i4 Corporation"},{"name":"AI Shogi Selection","year":2002,"developer":"i4 Corporation"},{"name":"Ai to Yūjou no Neko Monogatari: Jingle Cats - Love Para Daisakusen no Maki","year":1998,"developer":"Vantan International Co., Ltd."},{"name":"Air Combat","year":1995,"developer":"Namco Limited","url":"psxchda/Air%20Combat%20%28Europe%29.chd","filesize":340902052,"score":6.9,"genres":"Action > 1st-person > Behind view > Direct control > Flight / aviation > Vehicular combat","desc":"<p>You play as a freelance mercenary hired by world governments to strike against terrorists.  The missions get harder as you proceed, but the money you earn for completing each mission makes it worthwhile. You can purchase additional aircraft and arms as you go along, as well as hire wingmen to make the going easier.</p><p>Combat flight simulator in which you play a mercenary pilot who hires his combat skills to several corporations, governments, etc. in order to get cash for weapons &amp; upgrades.</p><p>The game progresses through a series of linear missions, and has a 2 player split-screen deathmatch mode plus a series of extras like hidden planes, mini-games, etc.</p><p>An arcadish combat flight simulator for the Playstation. The game casts you as a mercenary that hires his piloting skills to a set of organizations, governments, etc. in order to receive cash to buy better weapons &amp; upgrades.</p><p>The game is played from either a first person or 3rd person perspective a la Afterburner, an has a standard single player mission-based campaign as well as a deathmatch-like 2 player mode. Also included are a series of hidden planes as well as some hidden mini-games. Plus, as in other Namco games, you can put in your own music cds to play as you fly the missions.</p>"},{"name":"Air Hockey","year":2000,"developer":"Success Corp.","url":"psxchda/Air%20Hockey%20%28Europe%29.chd","filesize":5693189,"score":"","genres":"Sports > 1st-person > Anime / Manga > Arcade > Hockey","desc":"<p><em>Air Hockey</em> is a budget air hockey game for the PlayStation. There are four characters available to either play as or to face off against. The aim is to have a higher score than your opponent when the timer hits zero, and to make that a little easier there are bonuses strewn across the table. Some are activated upon touch, while others are stored with the player until used.</p><p>The only two gameplay options are 1 player versus the computer or 2 players versus each other.</p>"},{"name":"Air Management '96","year":1996,"developer":"KOEI Co., Ltd."},{"name":"Air Race Championship","year":1999,"developer":"Metro Corporation","url":"psxchda/Air%20Race%20%28Europe%29.chd","filesize":480749763,"score":"","genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Flight / aviation","desc":"<p><em>Air Race Championship</em> is an arcade style racing game where you fly planes through imaginative tracks. The tracks lead you through cities, caves, rivers and even some underwater tunnels. You start with a choice of four tracks and three planes. There are more tracks and planes but you have to unlock them. You can play solo in grand prix mode or time attack, or race against a friend in split screen mode. It is a spiritual successor to Bravo Air Race.</p>"},{"name":"AirGrave","year":1996,"developer":"Santos Ltd."},{"name":"Aironauts","year":1999,"developer":"Red Lemon Studios","url":"psxchda/Aironauts%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":390550021,"score":6.4,"genres":"Action > Behind view > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>Aironauts</em> is a flying aerobatic stunt action game for up to two players, set in a dystopian future society where prisoners are pitted against one another in arena battles to the death.</p><p>Players choose from 8 characters, each with distinct weapons and looks, and take to the skies in a battle to the death for the viewing public on \"SKP-TV\". Every level, called battle area, consists of a series of challenges, e.g. destroying certain items or a checkpoint race, ended with a one-to-one boss fight. After every area the player can trade collected and earned angel wings for power-ups which improve his abilities, e.g. speed or armor.</p><p>The game features Deathmatch, Stunt and Battle Modes.</p>"},{"name":"Akagawa Jirō: Yasōkyoku","year":1998,"developer":"Open Sesame Inc."},{"name":"Akagi: Tōhaiden","year":1996,"developer":"Micronet Co. Ltd."},{"name":"Akuji: The Heartless","year":1998,"developer":"Crystal Dynamics, Inc.","url":"psxchda/Akuji%20the%20Heartless%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":388188337,"score":7,"genres":"Action > Behind view > Platform > Puzzle elements > Fantasy","desc":"<p>In <em>Akuji: The Heartless</em> the player takes the role of Akuji, a voodoo-priest. The title of the game is meant to be taken literally as Akuji's wedding day brought a problem with it: his brother kills him and rips out his heart. Now Akuji has to travel through the underworld to get back to the living and take his revenge.</p><p>This game is a typical third-person action: the player jumps and fights through the stages. The player can increase his health bar by collecting voodoo dolls which are lying around in the levels. The camera is set in the over-the-shoulder perspective but can be adjusted manually. The levels in the game are mostly horror-themed.</p>"},{"name":"Alex Ferguson's Player Manager 2001","year":2000,"developer":"Anco Software Ltd.","url":"psxchda/Alex%20Ferguson%27s%20Player%20Manager%202001%20%28Europe%29.chd","filesize":35667955,"score":"","genres":"Sports > Managerial / business simulation > Menu structures > Football (European) / Soccer > Licensed","desc":"<p>In this tactical football management game, you become the manager of a team in the English, French or Belgian league, with different subdivisions, starting in 2001. Your job includes setting out strategies, planning training sessions, keeping an eye on your players and attracting new talent, taking care of finances, and of course making sure that you win your matches. You will be given specific goals, such as qualifying for the champion's league, or defending the club's reputation. Games do not only include league matches, but friendlies and cup matches as well.</p><p>The actual games can be watched real-time in 3D, allowing for on-the-fly substitutions and tactical decisions, and a unique feature is you can both manage and play for a club, although there is no way to actually control players or actively participate. All players have different abilities and characteristics, which can be trained to create a well-balanced team. The French version portrays manager Guy Roux (famous of Auxerre), while the UK version has Alex Ferguson (Manchester United).</p>"},{"name":"Alex Ferguson's Player Manager 2002","year":2002,"developer":"Anco Software Ltd."},{"name":"Alexi Lalas International Soccer","year":1998,"developer":"Z-Axis, Ltd.","url":"psxchda/Alexi%20Lalas%20International%20Soccer%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":44736092,"score":6.4,"genres":"Sports > Side view > Football (European) / Soccer > Licensed","desc":"<p>In <em>Alexi Lalas International Soccer</em> there are 50 official teams to choose in two modes to play. Tournament (with official settings) and exhibition match. Teams and players are developed with attention to statistic detail and featuring a unique face for each player, rendered from their likeness.</p><p>Most soccer games since the introduction of CD-ROM try to capture the feeling of a TV broadcast with spoken commentary. This game goes into the opposite direction and simulates what the athletes hear on the field, e.g. players shouting at each other or defensemen complaining about the quality of the pitch.</p>"},{"name":"Alfred Chicken","year":2002,"developer":"Möbius Entertainment Ltd.","url":"psxchda/Alfred%20Chicken%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":246176650,"score":6.3,"genres":"Action > 3rd-person (Other) > Side view > Platform > Puzzle elements","desc":"<p>Oh no! Alfred's girlfriend Floella has been chicknapped by the malevolent MekaChicken! Navigate Alfred through worlds of cheese, playing cards, children's toy blocks and more weird locations as he pursues MekaChicken and defeats an army of psychotic snails along the way.</p><p><em>Alfred Chicken</em> is based on the 1993 game of the same name. It features updated polygonal graphics and a CD quality soundtrack, in addition to all-new levels. However, the basic gameplay is the same - guide Alfred through action-packed platform levels and snatch up as many gems as you can along the way.</p><p>Peck at the balloons strewn throughout the levels to release them - once you've released them all, you can progress to the next level. A watering can is also hidden in each level - collect these for Alfred's friend Mr. Peckles, who is (naturally) a gigantic smiling sunflower. Doing so will score Alfred a bonus for the level.</p>"},{"name":"Alice in Cyberland","year":1996,"developer":"Glams, Inc."},{"name":"Alien Trilogy","year":1996,"developer":"Probe Entertainment Ltd.","url":"psxchda/Alien%20Trilogy%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.chd","filesize":325643695,"score":7.3,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic > Licensed > Regional differences","desc":"<p><em>Alien Trilogy</em> is a first-person shooter based on the first three <em>Alien</em> movies. You control Lt. Ripley in three sections, each based on one film: The colony complex on LV426 (from <em>Aliens</em>), the prison planet (from <em>Alien³</em>) and the derelict spaceship (from <em>Alien</em>). Each section consists of about 10 missions. In every mission, certain goals must be accomplished to continue. These include killing a certain number of enemies, finding items or activating switches.</p><p>Enemies include everything the alien life cycle provides: facehuggers, chestbursters, warrior aliens, dog aliens (from <em>Alien³</em>) and alien queens, one of which waits in the final mission of every section. In addition to the Aliens, you also have to fight employees of the Company, who have either been infected by the aliens and are beyond saving or who actively want to obstruct your mission.</p><p>Weapons to be used include pistol, shotgun, pulse rifle, flame thrower and smart gun. Ammunition, health upgrades and other useful items are scattered throughout the levels. Hidden areas may be uncovered by using explosives like grenades and seismic charges. An auto mapping system helps in not getting lost, night goggles and shoulder lamps (running on battery power) allow you to see in the dark and the motion tracker tells you where your enemies are - but only if they are moving.</p>"},{"name":"Alien: Resurrection","year":2000,"developer":"Argonaut Software Ltd.","url":"psxchda/Alien%20Resurrection%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":334757401,"score":6.8,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic > Horror","desc":"<p>Two hundred years after the events of <em>Alien³</em>, Lieutenant Ellen Ripley is cloned by military scientists interested in the Alien Queen she had become a host for. Like the \"Company\" from the earlier films, the military intends to use the Queen to breed a force of bio-weapons. But then something goes wrong; the Aliens they are studying manage to escape, and swarm throughout the science ship. It's up to four stranded heroes - Ripley, Call, DiStephano and Christie - to wipe out the Aliens, and return the ship safely to Earth.</p><p>Gameplay is standard FPS action, with limited ammo and plenty of hazards to detour around or find the switch to deactivate. The player switches between the four main characters at each level change, each with a slightly different set of abilities (Call has a motion tracker, Christie has his twin pistols from the film). Levels are based around keeping the Auriga running, and making their way through the ship to escape.</p><p>The game uses a true 3-D engine, allowing for ladders, rooms over rooms, and the ability to look up and down. Aliens also make use of the 3-D space, and can crawl along walls and ceilings, or leap out from the shadows to attack. Scripting is also heavily used, to set up cinematic moments (such as an Alien chasing a fleeing guard) throughout the levels.</p>"},{"name":"Alive","year":1998,"developer":"General Entertainment Co., Ltd."},{"name":"All Star Action","year":2003,"developer":"Mere Mortals Ltd.","url":"psxchda/All%20Star%20Action%20%28Europe%29%20%28Disc%201%29.chd","filesize":293182253,"score":"","genres":"Compilation > Racing / Driving > Sports > 3rd-person (Other) > Behind view > Tricks / stunts > Direct control > Sailing / boating > Surfing > Automobile > Mecha / giant robot > Motorcycle > Naval / watercraft > Truck > Sci-fi / futuristic","desc":"<p><em>All Star Action</em> is a collections of budget games. The games are all on a single disc with a game selection menu. Most games are asset flips of the exact same engine but with different cars or character models.</p><ul><li>Top Sped Rally</li><li>Water Power Jet</li><li>Xtreme Boarders</li><li>Surfing Paradise</li><li>Battle Trucks</li><li>Power Riders</li><li>Turbo Race 2</li><li>Speed Demon</li><li>Superbike GP</li><li>Stock Car Race</li><li>Ride the Waves</li><li>Revs</li></ul><p><em>Power Riders</em> is a futuristic combat racing game, compete against other mechs for first place on futuristic tracks, while also being able to attack the robots with melee attacks. This is the most complete game in the compilation with a selection of several anime style characters and five different courses titled Falcon, Hawk, Condor, Eagle and Phoenix.</p><p>There are wave surfing games (Water Power Jet, Xtreme Boarders, Surfing Paradise, Ride the Wave) where the player has to perform stunts and jumps within a set time limit, all using the same bay area level except with different player characters on either a bodyboard, surfboard, wind surfing or a jet ski.</p><p>The rest are all racing games (Top Sped Rally, Battle Trucks, Superbike GP, Turbo Race 2, Speed Demon, Stock Car Race, Revs) which use the same two tracks but with different title screens and cars models. Finish the race to go back to the menu.</p>"},{"name":"All Star Boxing","year":2000,"developer":"Nekogumi","url":"psxchda/All%20Star%20Boxing%20%28Europe%29.chd","filesize":61726074,"score":"","genres":"Action > Sports > Side view > Boxing","desc":"<p>The aptly-title <em>Boxing</em> is a relatively simple budget boxing game. The game offers an arcade-style boxing experience with ten colorful characters to choose from. Three modes are available: Ranking Mode, which has you fighting to become the top ranked boxer in the world; Scout Mode, which has you seeking new talent in order to unlock characters; and Battle Mode, where two players can fight an exhibition match against each other.</p>"},{"name":"All Star Racing","year":2002,"developer":"Kung Fu Games","url":"psxchda/All%20Star%20Racing%20%28USA%29.chd","filesize":174369082,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile","desc":"<p><em>All Star Racing</em> is car racing game featuring four game modes: Supercar Challenge, Classic Cars, Stockcar Frenzy, and GT Racer.</p><p>The game features 12 vehicles such as the Pina 238, Fenzo 500, and Manelli 748. There are also 12 tracks to race on which include Garrett Hills, Forest Valley, and Murran Ridge. Each game mode itself features its own set of 3 vehicles and 3 tracks to choose from, which makes up the main difference between all the game modes.</p><p>Gameplay has the player racing their vehicle against 5 opposing vehicles all vying for first place. During a race the game keeps track of the players lap time.</p><p>Options include setting the difficulty level to either easy, medium or hard and setting the number of laps to either 3 or 15 total laps.</p>"},{"name":"All Star Racing 2","year":2003,"developer":"Kung Fu Games","url":"psxchda/All%20Star%20Racing%202%20%28Europe%29.chd","filesize":186608498,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Motorcycle > Track racing > Vehicle simulator","desc":"<p>This is the next installment of All Star Racing. The game features 4 different game modes with each mode featuring a different vehicle type to race. There's the Bike mode featuring superbikes, the Kart mode featuring kart racing, GP mode featuring open wheeled Grand Prix cars, and a Truck mode featuring tractor-trailer trucks to race. Each of these vehicles comes in a variety of colors. Each mode features 5 different tracks to race on. Each race has the player trying to beat 5 other racers to achieve 1st place.</p><p>Options include setting the number of laps (3,6,9,12 or 15), the difficulty level (easy, medium, or hard), and whether to turn vibration on or off.</p>"},{"name":"All Star Soccer","year":1997,"developer":"","url":"psxchda/All%20Star%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.chd","filesize":365492694,"score":"","genres":"Sports > Diagonal-down > Direct control > Football (European) / Soccer","desc":"<p>At last, the ultimate challenge for all soccer fans! Your chance to build your perfect dream team! Not only does All Star Soccer let you dictate the tactics, formation and playing style of your team, but actually lets you create custom players with just the right mix of skill, speed and intelligence. This fantastic mix of ultra realistic soccer with a radical twist is completed by a hilarious mix of commentaries by impressionist Alistair McGowan.</p>"},{"name":"All Star Tennis","year":2001,"developer":"Nekogumi","url":"psxchda/All%20Star%20Tennis%20%28Europe%29.chd","filesize":46232181,"score":"","genres":"Sports > Diagonal-down > Tennis","desc":"<p><em>Tennis</em> is a game where you play the sport of the same name. There are two modes in the game, Tournament Mode and Free Mode. In Tournament Mode, you face off in either singles or doubles, which get harder as you progress. You must get into the Top Seed in order to get into the Championships and win. In Free Mode, you can choose the settings, court, and either singles or doubles. There are 16 different characters, each with their own signature moves and skills. You can change the difficulty of the CPUs in both Tournament Mode and Free Mode.</p>"},{"name":"All Star Tennis '99","year":1998,"developer":"Smart Dog","url":"psxchda/All%20Star%20Tennis%20%2799%20%28Europe%29%20%28Demo%29.chd","filesize":146733328,"score":6.6,"genres":"Sports > Behind view > Diagonal-down > Tennis > Licensed","desc":"<p>Play as 8 world-class ATP/WTA tour players (including Michael Chang, Gustavo Kuerten, Mark Philippoussis, Richard Krajicek, Conchita Martínez and Jana Novotná) as well as 4 fictional players through a range of tournaments on grass, clay, hard court and rebound ace surfaces.</p><p>Strikes such as lobs, volleys, smashes are available. Multiplayer options are offered for singles and doubles: up to four players can enter the challenge in a 2-on-2 match.</p>"},{"name":"All Star Tennis 2000","year":2000,"developer":"Aqua Pacific Ltd.","url":"psxchda/All%20Star%20Tennis%202000%20%28Europe%29%20%28En%2CDe%2CEs%2CIt%29.chd","filesize":51072271,"score":5,"genres":"Sports > Behind view > Diagonal-down > Tennis","desc":"<p><em>All Star Tennis 2000</em> is a 3D Tennis simulation game. The game features Exhibition, Season and Tournament play. There are 10 different tournaments in which you can compete on eight different courts from all over the world. Seven actual tennis players have been digitalized and included with the game. Each of them has their own strengths and weaknesses. You can play the game in singles, doubles and mixed doubles. You can also choose the amount of sets in a game.</p>"},{"name":"All Star Watersports","year":2003,"developer":"TheyerGFX Pty Ltd","url":"psxchda/All%20Star%20Watersports%20%28Europe%29.chd","filesize":141702542,"score":"","genres":"Sports > 3rd-person (Other) > Sailing / boating > Surfing > Wakeboarding > Naval / watercraft","desc":"<p>All Star Watersports lets you 'Ride-the-Barrel' through the most realistic waves yet seen on PlayStation. Grab a surfboard, bodyboard, windsurfer or jet watercraft and carve up some of the most awesome surfing beaches along the coast.</p>"},{"name":"All-Star 1997 Featuring Frank Thomas","year":1997,"developer":"Iguana Entertainment Incorporated","url":"psxchda/All-Star%20Baseball%2097%20featuring%20Frank%20Thomas%20%28USA%29.chd","filesize":132041312,"score":6,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>This baseball game is the follow up to Frank Thomas Big Hurt Baseball. It features an Exhibition, Season, Playoff, All-Star, Batting Practice, and Home Run Derby modes. It also features all the 28 MLB teams plus the Tampa Bay and Arizona squads, the 2 new expansion teams of that era. The game includes the real players, stats, stadiums, and logos of each team. </p><p>During full season play, the game keeps track of stats in more than 27 different categories. The player can also trade players from their team during the season.</p><p>The play-by-play commentary is from sportscaster Jon Miller.</p>"},{"name":"All-Star Slammin' D-Ball","year":2001,"developer":"Access co., ltd.","url":"psxchda/All-Star%20Slammin%27%20D-Ball%20%28USA%29.chd","filesize":91514867,"score":"","genres":"Sports > Behind view > 2D scrolling > Real-time > Arcade > Dodgeball","desc":"<p>An arcade-style simulation of the famous P. E. game Dodgeball. Two teams face off; 4 players on each side in the infield, and another 3 from each team surround the field. Knock out all your opponent's infield players to win. You have the ability to catch thrown shots with a well-timed button press, and then return the favor with either a normal shot, or a high-powered shot, which are activated similarly to fighting-game moves.</p><p>The game includes a single game mode, either single-player, or two-player, as well as a tournament mode.</p>"},{"name":"Allied General","year":1997,"developer":"Strategic Simulations, Inc.","url":"psxchda/Allied%20General%20%28Europe%29.chd","filesize":405410377,"score":7.6,"genres":"Strategy > Turn-based > Turn-based strategy > Wargame > Point and select > Africa > Europe > Historical events > Middle East > World War II > War","desc":"<p><em>Allied General</em> is the sequel to Panzer General and uses the same turn-based gameplay mechanics. This time the player experiences World War II from the Allied point of view during two British, one U.S. and one Russian campaign. The settings are Europe, Russia and Northern Africa.</p><p>The most important thing to have are prestige points. These are earned by solving scenarios (more for less amount of turns used) and used to buy replacement units. But this is not the only reason to be concerned about the detailed mission results: surviving units are transferred to the next mission and receive experience points. The campaign is also not completely linear, and the next mission depends on the result of the last - this means a lost scenario does not necessarily result in a game over, and a scarce victory can have devastating results. Of course a great victory has positive effects on the next missions.</p><p>Every turn the player plans the actions of his units and tries to defeat his enemy. The complexity of the game mostly comes from the many different units and weapons - everything has their use and weaknesses. It is vital to use the resources in the correct order and combination. There are also other factors to think about, e.g. fuel. <em>Allied General</em> tries to be player friendly by giving feedback during turns, e.g. by showing the probable combat result before the player issues the attack. He can also undo a turn as long as no new enemy units are scouted. Other extras are historical film material and optional combat animations.</p>"},{"name":"Alnam no Kiba: Jūzoku Jūnishinto Densetsu","year":1996,"developer":"Right Stuff Corp."},{"name":"Alnam no Tsubasa: Shōjin no Sora no Kanata e","year":1997,"developer":"Right Stuff Corp."},{"name":"Alone in the Dark: Jack Is Back","year":1996,"developer":"Infogrames Europe SA","url":"psxchda/Alone%20in%20the%20Dark%20-%20Jack%20Is%20Back%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":213794340,"score":7.3,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Survival horror > Interwar > Detective / mystery > Horror","desc":"<p>In <em>Alone in the Dark 2</em>, you take the role of detective Edward Carnby, one of the two main characters in the original Alone in the Dark. Carnby is now called upon to investigate a bootlegger named One Eyed Jack after an old detective colleague named Stryker attributes Jack to the kidnapping of young Grace Saunders. Stryker attempts to infiltrate Jack's dilapidated mansion of Hell's Kitchen and rescue the girl, only to disappear himself. That's where Carnby comes in.</p><p>Carnby soon learns that Jack and his gangsters are really 15th-century pirates who gained immortality after Jack joined forces with Elizabeth Jarret, a Voodoo witch. However, the dark magic which keeps them immortal also requires Jack and his crew to regularly make human sacrifices (which explains Grace's kidnapping).</p><p>Now Carnby must battle his way through Hell's Kitchen and Jack's army of Tommy-gun-wielding gangsters, searching for a way to break the spell and make them stay dead. </p><p><em>Alone in the Dark 2</em> is an action-adventure game, similar to the original <em>Alone in the Dark</em>. Like its predecessor, the game uses hybrid 2D-3D graphics. Completing the game requires you to solve a lot of puzzles while fighting zombie pirates along the way. Some enemies can be killed with the numerous weapons at your disposal, while others need to be defeated via trickery. </p><p>Apart from Edward Carnby, the game also includes a short section (two sections in the CD-ROM version) where you play as the little Grace Saunders. Grace obviously cannot fight, and thus the sections featuring her are all about fast reflexes and wits to evade and outsmart the enemies.</p>"},{"name":"Alone in the Dark: The New Nightmare","year":2001,"developer":"Darkworks S.A.","url":"psxchda/Alone%20in%20the%20Dark%20-%20The%20New%20Nightmare%20%28Europe%29%20%28Disc%201%29.chd","filesize":375964833,"score":7.1,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Survival horror > Detective / mystery > Horror","desc":"<p>Edward Carnby, private eye of the paranormal, is back.</p><p>Carnby's best friend, Charles Fiske, has been found dead near Shadow Island, a mysterious island near Maine. It is your duty to take up the investigation and find out the secrets of Shadow Island. But you're not going alone... your companion will be a redhead by the name of Aline Cedrac who has her own reasons for tagging along. Aside from being a woman and inexperienced in the world of danger, she is the only one with the knowledge for translating the ancient Abkhani tabloids which may hold the secrets behind Carnby's friend's death and the disappearance of Aline's father.</p><p>Upon arriving on the island, your plane has been shot down by the things unknown, and the heroes have no other choice but to jump with a parachute, thus separating them on the island.</p><p>Now you choose the character to play with, either as Edward Carnby or Aline Cedrac, as they explore the mysterious and gloomy island with all its secrets and parallel stories that contain different locations and tasks for different characters, thus adding the level of replayability in a different experience - Carnby's story is more action oriented while Cedrac has more puzzles to solve. </p><p>Just like in the predecessors you move your characters through pre-rendered backgrounds while the camera perspective switches around. You collect various items and books which are used to solve puzzles. Many situations can only be solved with violence which means you'll have to use guns to get rid of your foes. Aiming is manual and especially when playing Cedrac ammo is scarce. Saving a game uses up a save medallion which can be found during the game.</p>"},{"name":"Alundra","year":1997,"developer":"Matrix Software","url":"psxchda/Alundra%20%28Europe%29.chd","filesize":307338137,"score":8.1,"genres":"Action > Diagonal-down > Puzzle elements > Fantasy","desc":"<p>Alundra is a boy who can step into other people's dreams. His own dreams tell him to go to the village Inoa. The ship on which Alundra is coming to the village goes down, but Alundra himself is washed up on a beach near the village. There, a blacksmith Jess takes care of him and treats him like his own son. But Alundra, stepping into the dreams of the village people, understands there's a danger somewhere. The people have horrible nightmares, and only Alundra can find out what they mean...</p><p><em>Alundra</em> is an action game with light RPG elements, somewhat similar to the Zelda series. It uses real-time combat and includes some platforming and environmental puzzles. A big part of the game is spent in dungeons (reached through an overhead map), where the player has to solve puzzles in order to proceed. During the course of the game, various new items, spells and special attacks are found which have to be used to solve new puzzles or get to previously unreachable places.</p>"},{"name":"Alundra 2: A New Legend Begins","year":1999,"developer":"Contrail Production","url":"psxchda/Alundra%202%20-%20A%20New%20Legend%20Begins%20%28Europe%29.chd","filesize":382460143,"score":7,"genres":"Action > Diagonal-down > Anime / Manga > Puzzle elements > Fantasy","desc":"<p>Story-wise, this title isn't really a sequel to Alundra. The hero of this game is the red-haired Flint, whose parents were killed by pirates. Flint engages himself on a journey to avenge his parents, but soon discovers that there is a bigger conspiracy - the evil Mephisto wants to turn all people into robots by putting magic keys into them. In contrast to the predecessor, this game's storyline and characters are humorous.</p><p><em>Alundra 2</em> is in 3D and uses polygonal graphics, unlike the first game of the series. The gameplay of <em>Alundra 2</em>, like the original <em>Alundra</em>, is very similar to the Legend Of Zelda series with emphasis being on puzzle solving and dungeon exploring. In said dungeons, reached from an overhead world map, the player finds new items and special attacks, which are required to solve the puzzles. But not all require thinking; some consist of platforming challenges. The western release features two difficulty levels.</p>"},{"name":"Amazing Learning Games with Rayman","year":2000,"developer":"Ubi Soft Entertainment Ltd."},{"name":"Amazing Virtual Sea-Monkeys, The","year":2002,"developer":"Creature Labs Ltd.","url":"psxchda/Amazing%20Virtual%20Sea-Monkeys%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.chd","filesize":165067457,"score":"","genres":"Action > Side view > Puzzle elements > Licensed","desc":"<p>The player controls Nautila, a \"babelfish\" which is used to indirectly influence the environment within a huge water tank. Nautila has to suck up dangerous fish, clear rocks, supply food etc. for brine shrimps resembling the Sea Monkeys brand. The Sea Monkeys try to reach a Venus Shell as soon as they are hatched. If Nautila is not fast enough to clear the puzzles preventing the Sea Monkeys from reaching their shell, they will perish... </p><p>The game features 70 levels in total, with increasingly difficult objectives.</p>"},{"name":"American Pool","year":2002,"developer":"DigiCube Co., Ltd.","url":"psxchda/American%20Pool%20%28Europe%29.chd","filesize":1138049,"score":"","genres":"Sports > 1st-person > Diagonal-down > Turn-based > Direct control > Pool / snooker","desc":"<p><em>American Pool</em> is a pool game featuring a Training mode, a Pocket Game mode, and a Pool Contest mode.</p><p>In Training mode, players are presented with 18 stages in which they are shown a sample of a shot done by the computer player that they then have to try to replicate.</p><p>The Pocket Game mode lets the player compete in various types of pool games such as 9-Ball, 8-Ball, Basic, Rotation, and 14-1 Ball. Players can set the number of sets to play and the difficulty level.</p><p>The Pool Contest mode lets the player create a character with their own name, gender, age, and face avatar (3 different choices for each gender), and compete in a 32 player tournament of 9-Ball. The players character can level up by winning matches which unlocks 6 different powerup techs and 3 special techs. Some techs include Easy Shot which slows down the speed of the shot power meter and Free Ball which allows the cue ball to be placed anywhere on the pool table.</p><p>Gameplay consists of the player lining up their shot, choosing where to hit the cue ball with the cue stick, and then determining the strength of their shot by use of a power meter.</p>"},{"name":"Amerzone: The Explorer's Legacy","year":1999,"developer":"Virtual Studio","url":"psxchda/Amerzone%20-%20The%20Explorer%27s%20Legacy%20%28Europe%29%20%28Disc%201%29.chd","filesize":377003226,"score":6.9,"genres":"Adventure > 1st-person > Graphic adventure > Puzzle elements > Point and select > Fantasy > Steampunk","desc":"<p>In 1932, Alexandre Valembois was a young explorer who, with his native friend Antonio Alverez, wanted to make a name for himself by exploring the mysterious Amerzone region. Befriended by the natives of the region, he witnessed a strange ritual involving a giant egg of the famed white birds. Wanting to prove that the white birds existed, Alexandre stole the mysterious egg and betrayed the natives' trust Returning to France, nobody believed Alexandre or his journals about the Amerzone. Sixty years have passed and the world has changed. World War 2 has come and gone, the Amerzone remains unexplored and closed off to outsiders by it's despotic leader, Antonio Alverez. Monsieur Alexandre Valembois is an old man at the end of his life, living alone in a lighthouse and wishing to fix his mistake. At this time, a young reporter comes to visit the old Alexandre Valembois regarding his adventures...</p><p>Amerzone is a first person adventure game, similar to Myst, taking place between different rooms and areas. The player assumes the role of the reporter and must unravel the clues left by Monsieur Valembois, travelling over several picturesque locations and eventually reaching the fictional Amerzone region. The adventure game takes place over a series of areas. The player can click on arrow icons to change the orientation or to move to different areas. Objects of interest change the cursor to a magnifying glass icon. Objects that can be interacted with or picked up change the cursor to a hand icon. An icon of gears represents a mechanism which must be manipulated before it can be properly used. The player's inventory can be accessed at any time.</p>"},{"name":"Anastasia","year":2000,"developer":"The Code Monkeys Ltd.","url":"psxchda/Anastasia%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.chd","filesize":348781340,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select > Europe","desc":"<p>A princess of the Russian royal family, Anastasia's life is changed forever when the traitor, Rasputin, takes her father's throne. Her memory lost, Anastasia must flee the palace with Alexander, a young soldier.</p>"},{"name":"Ancient Roman: Power of Dark Side","year":1998,"developer":"Nihon System Inc."},{"name":"Andretti Racing","year":1996,"developer":"Stormfront Studios","url":"psxchda/Andretti%20Racing%20%28Europe%29.chd","filesize":496541279,"score":7.5,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>For the first time ever in an arcade racer, take control of either NASCAR or Indy cars and cruise around 16 detailed tracks. There are 3 views available to drive from. As well as individual races, you can play a full career. Derek Daly and Bob Jenkins provide a running commentary. Outside factors such as pit-crew mistakes and mechanical failures can affect your races.</p>"},{"name":"Angel Devoid: Face of the Enemy","year":1996,"developer":"Electric Dreams Inc."},{"name":"Angel Graffiti: Anata e no Profile","year":1996,"developer":"Astrovision"},{"name":"Angelique","year":1996,"developer":"KOEI Co., Ltd."},{"name":"Angelique Duet","year":1998,"developer":"Ruby Party"},{"name":"Angelique Special 2","year":1997,"developer":"KOEI Co., Ltd."},{"name":"Angelique: Tenkū no Requiem","year":1999,"developer":"KOEI Co., Ltd."},{"name":"Animal Football","year":2003,"developer":"The Code Monkeys Ltd.","url":"psxchda/Animal%20Football%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":267898947,"score":"","genres":"Educational > Puzzle > 3rd-person (Other) > Mini-games > Graphics / art > Pre-school / toddler","desc":"<p><em>Animal Football</em> is a puzzle game featuring Dingo Pictures half-hour cartoon titled <em>Das unglaubliche Fussballspiel der Tiere</em> which is about two animal football teams playing a game against each other. Gameplay in the original PlayStation release consists of slide puzzles as well a colouring activity.</p><p>The game was re-released as <em>Animal Soccer World</em> on the PlayStation 2 three years later. Two more minigames were added for the PS2: a Concentration-like card-matching game and some jigsaw puzzles.</p>"},{"name":"Animal Snap: Rescue Them 2 by 2","year":2002,"developer":"Ignition Entertainment Ltd.","url":"psxchda/Animal%20Snap%20-%20Rescue%20Them%202%20by%202%20%28Europe%29.chd","filesize":29115318,"score":"","genres":"Action > Puzzle > Fixed / flip-screen > Cards / tiles > Tile matching puzzle > Direct control","desc":"<p><em>Animal Snap: Rescue Them 2 by 2</em> is a tile based puzzle game borrowing some elements from MahJong. Players need to clear groups of stacked titles by selecting two identical tiles, thus removing them. As matches make tiles disappear, new ones below are uncovered. This process is repeated until all tiles and removed. Tiles are selected by moving the cursor around and then a button to confirm or remove a selection. The game can be played in an Arcade Mode and as a Time Challenge. The gameplay is identical for both modes, but in Arcade the goal is to complete levels in the fastest time possible, while in Time Challenge a timer counts down. The tiles contain objects, animals and letters that spell the word BONUS.</p>"},{"name":"Animaniacs: Ten Pin Alley","year":1998,"developer":"Saffire, Inc","url":"psxchda/Animaniacs%20-%20Ten%20Pin%20Alley%20%28USA%29.chd","filesize":124894753,"score":7.5,"genres":"Sports > 3rd-person (Other) > Bowling > Licensed","desc":"<p><em>Animaniacs: Ten Pin Alley</em> is a bowling game, a sequel of sorts to Ten Pin Alley. The gameplay is basically the same: the player can choose from a selection of characters (this time from the <em>Animaniacs</em> cartoon) with varying statistics, or build a new character from the ground up. This character is then positioned facing the bowling lane and its pins.</p><p>After starting the ball launch the screen switches to a side view of the character holding the ball and three gauges appear: two tricolored ones for speed and accuracy and a smaller green one for putting a spin on the ball. Initially, the player can fill the spin gauge. After some seconds, a fast meter starts to move on the other gauges. The objective is to press a button when the meter reaches the yellow band on each gauge. If it misses this mark, the character fumbles and drops the ball.</p>"},{"name":"Animorphs: Shattered Reality","year":2000,"developer":"SingleTrac Entertainment Technologies, Inc.","url":"psxchda/Animorphs%20-%20Shattered%20Reality%20%28USA%29.chd","filesize":204659219,"score":5.9,"genres":"Action > 3rd-person (Other) > Side view > Platform > Licensed","desc":"<p><em>Animorphs: Shattered Reality</em> is a quasi-3D platformer based on the popular Scholastic book series. A quick back story: Earth is being secretly conquered by an alien race known as the Yeerks, small slug like creatures that enter a host’s ear, latch onto their brain, and completely control them. The only thing standing between the Yeerks and total domination is the Animorphs, a group of kids who have the power to morph into any animal form they can touch. </p><p>In this game, the leader of the Yeerk invasion, Visser 3, has a plan to finally take over the world. Using a device called “the Continuum Crystal”, Visser 3 plans to manipulate the space-time continuum in such as to change reality, making his invasion force the rulers of Earth, with no more Animorphs to fight against him. However, as he activates the continuum crystal, is misfires, shatters itself and the shards of the crystal become scattered. The Animorphs must collect all the shards of the shattered crystal to prevent Visser 3 from achieving his evil designs.</p><p>You then control the various members of the Animorphs crew, leading them through several differently themed levels (forests, swamps, urban, factories, underwater, subway tunnels, spacecraft, etc.) to collect the pieces of the crystal. Most of the gameplay is jumping around on platforms collecting coins, battling aliens (when you encounter an alien, you automatically morph from your human self into your “battle morph”, which is a unique animal for each character), defeating the occasional boss alien, and trying not to fall. A few levels are more of a 3rd person race, rather than platform based, as you navigate a dolphin, dragonfly, bat, or hawk (one of the Animorphs in another one of their animal forms) down a dangerous path. All the levels are quite linear in nature.</p>"},{"name":"Anna Kournikova's Smash Court Tennis","year":1998,"developer":"Now Production Co., Ltd.","url":"psxchda/Anna%20Kournikova%27s%20Smash%20Court%20Tennis%20%28Europe%29.chd","filesize":247494784,"score":6.6,"genres":"Sports > Diagonal-down > Tennis > Licensed","desc":"<p><em>Anna Kournikova's Smash Court Tennis</em> is the sequel to Smash Court Tennis and is an arcade-oriented tennis game starring Anna Kournikova.</p><p>The game features two practice modes, tournaments (grand slam or street tennis) or exhibition matches. Winning in tournaments rewards world ranking points which unlock new characters to use, each with different attributes and skills, and extra items to use. This includes unrealistic ones like the wave racket which floods the opponent's side. Sometimes the player finds himself paired up against characters from other Namco games, e.g. Pac Man or Heihachi Mishima from the Tekken series.</p><p>The four-player multiplayer modes doesn't only include regular matches, but also the bomb ball mode. Here players have to play with live bombs and try not be the nearest player when it goes off.</p>"},{"name":"Anokodokonoko","year":1998,"developer":"Success Corporation"},{"name":"Another Mind","year":1998,"developer":"Square Co., Ltd."},{"name":"Ape Escape","year":1999,"developer":"Sony Computer Entertainment Inc.","url":"psxchda/Ape%20Escape%20%28Europe%29.chd","filesize":115956343,"score":8.1,"genres":"Action > Behind view > Platform > Puzzle elements","desc":"<p>Specter, a popular attraction at the amusement park, has been transformed from a mild-mannered monkey into a scheming simian through the powers of the intelligence boosting Peak Point Helmet. Now he and his monkey army have taken over the Professor's time machine in order to to travel back in time and replace human civilization with a simian society. There's just one catch: Spike was caught in the time machine as well, and has been pulled back into the past with them. With the help of the Professor's numerous gadgets Spike will travel through prehistoric lands and capture Specter's army to prevent his evil scheme.</p><p>Because of the game's requirement of a Dual Shock controller, all of Spike's items are controlled through the right stick. Examples include a stun stick that can be slashed in any direction or spun in a circle, an RC Car that can drive alongside Spike as he runs, and a helicopter blade that can be spun rapidly to lift Spike or slow his descent. The goal in every level is to capture enough of Specter's monkeys to diminish their effect on history. Each monkey has different stats and personalities. Some will barely pay attention to you and will prefer to goof off or sleep, while others will attack you with machine guns, rocket launchers, and UFOs. Weapons will only stun a monkey, and they must be captured using the Time Net.</p><p>Finding every monkey in a level will unlock a time attack mode for the level, and collecting Specter Coins hidden in levels will unlock bonus games like boxing and skiing that use the dual stick controls.</p>"},{"name":"Apocalypse","year":1998,"developer":"Neversoft Entertainment, Inc."},{"name":"Aqua GT","year":2001,"developer":"Promethean Designs Ltd.","url":"psxchda/Aqua%20GT%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":167471118,"score":"","genres":"Action > Racing / Driving > Behind view > Arcade > Naval / watercraft","desc":"<p><em>Aqua GT</em> is powerboat racing game. It features three modes: Championship, Arcade and Two-player.</p><p>Championship mode is the main single player game, where you advance through the Bronze, Silver and Gold Championships. In the Arcade gameplay mode you have to beat the clock. In two-player split screen mode you go head to head against another player.</p><p>There are 5 boats to choose from, and you can unlock another 15 while progressing through the game. All boat vary in speed, acceleration and handling.</p><p>The tracks are set in canals of major cities, like London, Amsterdam and New York. Each track has a high or low tide, and you can race at day time or during the night time.</p>"},{"name":"Aquanaut no Kyūjitsu 2","year":1999,"developer":"Artdink Corporation"},{"name":"Aquanaut's Holiday","year":1995,"developer":"Artdink Corporation","url":"psxchda/Aquanaut%27s%20Holiday%20%28Europe%29.chd","filesize":110538101,"score":6.8,"genres":"Adventure > 1st-person > Meditative / Zen","desc":"<p>In this game, players are put into the role of a submersible to explore the ocean depths at their leisure. </p><p>Along the way, players can cruise the depths of the ocean from a first-person perspective, climbing or diving the waters as they see fit to discover the wonders of the ocean. Along the way, players can locate sunken ships, statues, and other aquatic treasures, or attempt to communicate with the various sea life through sonar, whether it's a whale, or one of the more bizarre creatures found within the darkest depths of the ocean.</p><p>Players can also leave underwater stations to mark points of interest for future study, or even assist in building a customizable coral reef that will continue to grow and attract marine life.</p><p><em>Aquanaut's Holiday</em> focuses on the subtleties of discovery over fast-paced action sequences or point accumulation.</p>"},{"name":"Aquarian Age: Tokyo Wars","year":2000,"developer":"Broccoli"},{"name":"Aquarium","year":1998,"developer":"Electronic Arts Square, K.K."},{"name":"Arc the Lad","year":1995,"developer":"G-Craft"},{"name":"Arc the Lad Collection","year":2002,"developer":"G-Craft","url":"psxchda/Arc%20the%20Lad%20Collection%20-%20Arc%20the%20Lad%20%28USA%29.chd","filesize":293894743,"score":8,"genres":"Compilation > Role-playing (RPG) > Top-down > Isometric > Anime / Manga > Turn-based","desc":"<p><em>Arc the Lad Collection</em> contains the following games:</p><ul><li>Arc the Lad</li><li>Arc the Lad II</li><li>Arc the Lad III</li><li>Arc Arena: Monster Tournament</li></ul>"},{"name":"Arc the Lad Collection - Arc Arena - Monster Tournament","year":1997,"developer":"UNiT Inc.","url":"psxchda/Arc%20the%20Lad%20Collection%20-%20Arc%20Arena%20-%20Monster%20Tournament%20%28USA%29.chd","filesize":67515147,"score":"","genres":"Gambling > Role-playing (RPG) > Strategy > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Arc the Lad Monster Game</em> is a spin-off from the Arc the Lad series and a bonus expansion to Arc the Lad II, as it uses the player's saves from the second game so the player can compete in the tournament with his monsters, visit shops, trade items etc. In addition there is a collection of casino mini-games that complete the package.</p>"},{"name":"Arc the Lad II","year":1996,"developer":"G-Craft","url":"psxchda/Arc%20the%20Lad%20Collection%20-%20Arc%20the%20Lad%20II%20%28USA%29.chd","filesize":326281806,"score":7.8,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>This direct sequel to Arc the Lad continues the unfinished story of the first game, but starts from a totally different perspective. You control a bounty-hunter named Elk, who suffers from amnesia. On his quest for his own true identity he discovers the powers hidden within him, and the destiny of his entire tribe. While pursuing his archenemy, Elk meets up with Arc, the hero of the first game, and then both realize they have been looking to destroy the very same evil.</p><p>The battle system of <em>Arc the Lad II</em> is similar to the one used in its predecessor: in battles you can move your characters on the battle field, and your proximity to the enemies plays an important role. You cause and take different amounts of damage depending on your position on the battle field. Unlike the first game, this one is a full-fledged RPG, without the \"strategy\" feel of the predecessor. You move through the game world on your own, visiting towns and exploring dungeons.</p>"},{"name":"Arc the Lad III","year":1999,"developer":"G-Craft","url":"psxchda/Arc%20the%20Lad%20Collection%20-%20Arc%20the%20Lad%20III%20%28USA%29%20%28Disc%201%29.chd","filesize":265557799,"score":6.9,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>The events of this game take place several years after Elk and Arc faced their ultimate enemy in Arc the Lad II. You control Alec, a teenager whose entire village was destroyed by an unknown evil - an event that was later called \"The Great Disaster\". He was saved by a mysterious Hunter. Since then, growing peacefully in a village he was brought to, which was like a new home for the survivors of the Great Disaster, Alec dreams about meeting the Hunter again, and becoming a Hunter himself. Together with his best friend Lutz he tries his luck in nearby towns, receiving small Hunter jobs, until the fate crosses the ways of the two young people with a mysterious organization called the Academy. And there their adventure really begins...</p><p>The gameplay of this third installment of Arc the Lad series is very similar to that of the predecessor. You fight enemies in turn-based battles, and can move freely on the battlefield, positioning your party members the way you like. You can upgrade your weapons by forging them with special materials, and have a variety of techniques and magic spells at your disposal.</p>"},{"name":"Arcade Party Pak","year":1999,"developer":"Digital Eclipse Software, Inc.","url":"psxchda/Arcade%20Party%20Pak%20%28USA%29.chd","filesize":397749908,"score":7.2,"genres":"Compilation","desc":"<p>A retro-collection of six classic Midway and Atari Games classics, along with FMV interviews with many of the game creators:</p><ul><li>720º</li><li>Smash T.V.</li><li>Klax</li><li>Rampage</li><li>Super Sprint</li><li>Toobin'</li></ul>"},{"name":"Arcade's Greatest Hits: The Atari Collection 1","year":1996,"developer":"Atari, Inc.","url":"psxchda/Arcade%27s%20Greatest%20Hits%20-%20The%20Atari%20Collection%201%20%28Europe%29.chd","filesize":398758027,"score":6.9,"genres":"Compilation","desc":"<p>Another in the series of Midway's retro arcade compilations, this is the first to feature early Atari titles (in addition to the usual FMV interview segments.)</p><p>The games included are:  </p><ul><li>Asteroids</li><li>Battlezone</li><li>Centipede</li><li>Missile Command</li><li>Super Breakout</li><li>Tempest</li></ul>"},{"name":"Arcade's Greatest Hits: The Atari Collection 2","year":1998,"developer":"Atari Corporation","url":"psxchda/Arcade%27s%20Greatest%20Hits%20-%20The%20Atari%20Collection%202%20%28Europe%29.chd","filesize":153024975,"score":6.8,"genres":"Action > Compilation > Racing / Driving > Sports > Diagonal-down > Side view > Top-down > Isometric > Arcade > Bike / Bicycling > Fantasy","desc":"<p><em>Arcade's Greatest Hits: The Atari Collection 2</em> is a compilation of six Atari arcade games:</p><ul><li> Paperboy  (code conversion)</li><li> Gauntlet  (code conversion)</li><li> RoadBlasters  (code conversion)</li><li> Marble Madness  (code conversion)</li><li> Crystal Castles  (emulation)</li><li> Millipede  (emulation)</li></ul>"},{"name":"Arcade's Greatest Hits: The Midway Collection 2","year":1997,"developer":"","url":"psxchda/Arcade%27s%20Greatest%20Hits%20-%20The%20Midway%20Collection%202%20%28Europe%29.chd","filesize":317636570,"score":6.3,"genres":"Compilation","desc":"<p>This is an emulation-based compilation of seven classic arcade games:</p><ul><li>Joust 2: Survival of the Fittest</li><li>Blaster</li><li>Moon Patrol</li><li>Root Beer Tapper</li><li>Spy Hunter* Burger Time</li></ul><p>Supplemented with a trivia quiz (with FMV interviews with the game designers) and a gallery of pictures when the trivia game is won.</p>"},{"name":"Archer Maclean's Pool","year":2003,"developer":"Ignition Entertainment Ltd.","url":"psxchda/Archer%20Maclean%27s%203D%20Pool%20%28Europe%29.chd","filesize":59022087,"score":8.1,"genres":"Sports > 1st-person > Pool / snooker","desc":"<p>Using the game engine from Jimmy White's Whirlwind Snooker, this game recreates pool in minute detail. A bold 3D graphics engine with realistic physics and millions of shot permutations (in terms of direction, speed and spin) is at the heart of it. Three versions of pool are offered - UK and US 8-ball as well as the fast-paced all-action 9-ball game.</p><p>There are 20 computer opponents, with the hardest of them being almost unbeatable, as well as two-player and trick-shot modes. Unlike the original release of <em>Whirlwind Snooker</em>, you can save more than one game on the disk at a time.</p>"},{"name":"Area 51","year":1996,"developer":"Mesa Logic, Inc.","url":"psxchda/Area%2051%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29%20%28Midway%20Classics%29.chd","filesize":386012360,"score":6.5,"genres":"Action > 1st-person > Video backdrop > Arcade > Rail shooter > Sci-fi / futuristic","desc":"<p>Using a light gun you blast your way through the secret base, Area 51, which has been taken over by mutant aliens. As you work your way to the secrets at the heart of Area 51, you'll need to destroy an increasingly dangerous line of aliens, upgrade your firearm, and cause as much collateral damage as possible. The game rewards the player for destroying windows, light fixtures, computers, explosive barrels, and even fire extinguishers. Each consecutive hit increases your streak rating (which adds to your score) and certain combinations of these collateral hits will open up secret bonus rooms.</p><p>The home version has special bonuses and additional secret levels not found in the arcade version and a mouse option is available.</p>"},{"name":"Ark of Time","year":1998,"developer":"Trecision S.p.A.","url":"psxchda/Ark%20of%20Time%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":381616283,"score":6.5,"genres":"Adventure > 3rd-person (Other) > Puzzle elements > Point and select > Detective / mystery","desc":"<p>In this third-person point-and-click adventure game you play the sports journalist Richard Kendall. In the summer of 1997, an expedition of four explorers have set out into the abysses of the Atlantic Ocean to find any traces of the mythical sunken city of Atlantis. They are the archeologist Professor Caldwell, the scientist Helen, the sponsor of the journey Mr. Blower and his nephew Simon.</p><p>When they suddenly stop communicating Richard is the one whose task it is to find them. He would much rather stay in London and cover football matches but his editor insists and he complies. His search takes him to several locations around the world including the Caribbean, Stonehenge, Easter Island and Atlantis itself. The puzzles are mostly inventory based.</p>"},{"name":"Arkanoid R 2000","year":1999,"developer":"Taito Corporation"},{"name":"Arkanoid Returns","year":1997,"developer":"Taito Corporation"},{"name":"Armored Core","year":1997,"developer":"FromSoftware, Inc.","url":"psxchda/Armored%20Core%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":241398033,"score":7.5,"genres":"Action > 3rd-person (Other) > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>You play the role of a Raven mercenary, piloting a powerful Mech called \"Armored Core\". You only work for profit, as the money you make goes towards upgrades and repaires to your mech.</p><p>Multi-national companies are lined up at your door, paying you to complete certain objectives, which mainly include the destruction of a certain target or another mech. The more you complete, the better the pay and job offers, therefore allowing you to build the ultimate Armored Core.</p><p>Apart from the single player campaign, you can take on a friend in a multiplayer battle. You each control a mech, and battle it out in a large war area (ranging from huge cities to desert planes).</p>"},{"name":"Armored Core: Machine Side Box","year":2006,"developer":""},{"name":"Armored Core: Master of Arena","year":1999,"developer":"FromSoftware, Inc.","url":"psxchda/Armored%20Core%20-%20Master%20of%20Arena%20%28USA%29%20%28Disc%201%29.chd","filesize":355789534,"score":7.1,"genres":"Action > Behind view > Shooter > Mecha / giant robot","desc":"<p>The third and final AC on Playstation has you continuing your custom mech building job, where companies contact you to complete objectives with a big pay load attached. </p><p>20 missions range from the usual destruction of structures and bases to battles against other mechs. Parts can be bought using the credits recieved from missions, allowing you to build up your mech. Players that have played the previous two Armored Core titles (Armored Core and AC: Project Phantasma) can load their previous mechs and build them up further thanks to 30 new parts available (as well as hidden parts scattered throughtout the levels).</p><p>Again, you can take on a friend in 2 player split screen and link cable mode (you can use two Playstations and TV's).</p>"},{"name":"Armored Core: Project Phantasma","year":1997,"developer":"FromSoftware, Inc.","url":"psxchda/Armored%20Core%20-%20Project%20Phantasma%20%28USA%29.chd","filesize":185937997,"score":7.5,"genres":"Action > 3rd-person (Other) > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Like the original, you pilot an Armored Core into battles ranging from the destruction of enemy structures to other mechs and tanks, all for the sake of money used to upgrade and repair your mech.</p><p>This semi-sequel to the original includes 17 new missions as well as a 2 player split screen mode and, using the Playstation link cable, a 2 player mode on two seperate TV screens.</p>"},{"name":"Armorines: Project S.W.A.R.M.","year":2000,"developer":"Acclaim Studios Limited","url":"psxchda/Armorines%20-%20Project%20S.W.A.R.M.%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.chd","filesize":261233765,"score":6.2,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic > Regional differences","desc":"<p>You have two Armorines to play as, each with their own selection of weapons. In a not distant future time, you strenuously fight against bugs of all sizes, as you attempt to impede the enemies from eliminating human civilization as we know it, and have to succeed within 120 hours. </p><p>This game uses the Turok 2 engine, and has similar themes and elements to the movie <em>Starship Troopers</em>.</p>"},{"name":"Army Men 3D","year":1999,"developer":"The 3DO Company","url":"psxchda/Army%20Men%203D%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":378823216,"score":7.1,"genres":"Action > 3rd-person (Other) > Shooter","desc":"<p>The Army Men jump into PS action in a fully 3D environment, allowing you to use all the weapons found in the original, but from a 3rd person perspective. You can also blast away with a mate in a multiplayer mode or two.</p>"},{"name":"Army Men: Air Attack","year":1999,"developer":"The 3DO Company","url":"psxchda/Army%20Men%20-%20Air%20Attack%20%28Europe%29%20%28En%2CEs%2CIt%29.chd","filesize":410644053,"score":7.2,"genres":"Action > Shooter > Flight / aviation","desc":"<p>This installment in the long-running Army Men series is the first to feature third-person aerial combat in full 3D. </p><p>Choosing a chopper among the Huey, Chinook, Super Stallion, or Apache, the player will have to rescue or provide air support to fellow Army Men, while shooting down anything that moves (including enemy helicopters and troops, as well as hordes of insects) across 16 different missions.</p><p>The game also features a multiplayer mode where players can either battle each other or join forces in co-op.</p>"},{"name":"Army Men: Air Attack 2","year":2000,"developer":"The 3DO Company","url":"psxchda/Army%20Men%20-%20Air%20Attack%202%20%28Europe%29.chd","filesize":414104641,"score":6.5,"genres":"Action > 3rd-person (Other) > Helicopter","desc":"<p><em>Army Men: Air Attack 2</em> and its predecessor are shooting games similar to the ones in EA's Strike series. The player controls a green toy helicopter through a suburban setting. The aircraft is equipped with weapons and a winch. At the start of each mission, the player can choose the helicopter model and its co-pilot, whose characteristics modify the behavior of the airship (for example, a specialist in guns will increase the accuracy of shots). The mission objectives vary: there are rescue missions, where the winch is used to collect a character or object, demolition missions, where something has to be destroyed, and escort missions, where something must be protected from enemy attacks.</p><p>The PlayStation version contains two additional missions.</p>"},{"name":"Army Men: Green Rogue","year":2001,"developer":"5000ft Inc.","url":"psxchda/Army%20Men%20-%20Green%20Rogue%20%28USA%29.chd","filesize":320746865,"score":5.2,"genres":"Action > 3rd-person (Other) > Side view > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The game takes the form of top-down, forward scrolling shoot 'em up in the vein of Commando or Ikari Warriors. Unlike those games it features a 3D environment with polygonal enemies, instead of 2D sprites, and the screen is constantly scrolling forward.</p>"},{"name":"Army Men: Sarge's Heroes","year":2000,"developer":"The 3DO Company","url":"psxchda/Army%20Men%20-%20Sarge%27s%20Heroes%20%28Europe%29.chd","filesize":465509311,"score":5.9,"genres":"Action > Behind view > Shooter > Direct control","desc":"<p>One morning Sarge is resting in his cot when the Tan launch a surprise attack on the Green base.  Sarge and the Colonel are forced to retreat just as the base is overrun.  But in the chaos, Sarge's entire team of elite soldiers, Bravo Company, has been captured by the Tan.  Worse yet, the Tan have made an amazing discovery: blue portals that lead to the real world!  They use these portals to take amazing weapons of war from the real world into the plastic world including magnifying glasses, deadly robot action figures, and fire crackers.  It's up to you, as Sarge, to rescue your team and put an end to the blue portals and Tan's evil schemes.</p><p>Control Sarge in this Army Men third-person shooter.  You will wage war across Tan-infested territories, both in the real and plastic world. Make Sarge proud as you battle the Tan army across 14 levels, utilizing 13 unique weapons like sky rockets and spray cans. Fight against not only infantrymen, tanks, and helicopters, but also killer toy robots and insects.  This third game in the Army Men series adds several new features, including 3DO's unique Plastosheen lighting effects, which give the army men a real-life plastic shine. </p><p>Also included is a multiplayer mode.  Choose your character and even your color and duke it out with your friends.  You can choose from many different weapons and battle each other in areas from the game or exclusive multiplayer levels.  Even incorporated is the portal system, by which you can enter blue portals and come out anywhere in the level.</p>"},{"name":"Army Men: Sarge's Heroes 2","year":2000,"developer":"The 3DO Company","url":"psxchda/Army%20Men%20-%20Sarge%27s%20Heroes%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":407630557,"score":5.9,"genres":"Action > 3rd-person (Other) > Shooter","desc":"<p>It seems those plastic men never lack any energy nor motivation to take each other out. Like in the other <em>Army Men</em> games, Sarge and the Green Army are at it again with the Tan Army. This time, General Plastro of the Tan Army has teamed up with members from the Blue side to wipe out the Green Army. As Sarge, you must fight your way through numerous missions with the backing of assorted weaponry ranging from crossbows to rocket launchers, in order to save Green Nation from the enemy invasion. Mission objectives vary from complete destruction of the other side to rescue missions.</p>"},{"name":"Army Men: World War","year":2000,"developer":"The 3DO Company","url":"psxchda/Army%20Men%20-%20World%20War%20%28USA%29.chd","filesize":343655989,"score":5.7,"genres":"Action > Behind view > Shooter > Tank > War","desc":"<p>16 missions await you and your green army as you wage war against the tan army through true world war environments including beaches, jungles, countrysides and war-torn cities.Each army man has a range of weapons to use, including pistols, flame throwers and the bazooka. You can also use heavy artillery such as tanks, jeeps and boats when normal attacks fail to breach the enemy line.</p>"},{"name":"Army Men: World War - Final Front","year":2001,"developer":"The 3DO Company","url":"psxchda/Army%20Men%20-%20World%20War%20-%20Final%20Front%20%28USA%29.chd","filesize":224752798,"score":5.6,"genres":"Strategy > 3rd-person (Other) > Shooter > Helicopter > Naval / watercraft > Tank","desc":"<p>The Tan army has secretly built a weapons factory, and are on the move against your green army. Using everything you have available to you, you must lead the green army against the tan enemy and destroy the weapons factory. </p><p>Included in this addition of Army Men is the ability to wage war underwater and underground in 15 single player missions and 16 multiplayer maps. New to the arsenal are submarines, motorbikes and assault rafts, a map editor to create mutliplayer maps for 2 players, new multiplayer modes such as grudge match and co-op plus a new training mode called Boot Camp, allowing you to train up on all of the combat controls with a firing range and a range of battle exercises.</p>"},{"name":"Army Men: World War - Land Sea Air","year":2000,"developer":"The 3DO Company","url":"psxchda/Army%20Men%20-%20World%20War%20-%20Land%2C%20Sea%2C%20Air%20%28USA%29.chd","filesize":185720309,"score":5.7,"genres":"Strategy > 3rd-person (Other) > Shooter > Helicopter > Tank","desc":"<p>The war continues between the green and tan armies, with air, sea and land vehicles increasing the range of attacks. </p><p>New additions to the gameplay include the ability to control not only Army Men, but land vehicles, ships and aircraft as well (for example helicopters, bombers, battleships and tanks). The Army Men themselves have a larger arsenal to choose from, including the howitzer and mortars, plus the usual machine guns, flamethrowers and grenades.</p><p>As a PlayStation exclusive, a two-player Capture the Flag mode has been included. The single-player campaigns all include multiple objectives, such as capturing an enemy base while destroying others or defending an area from intruders.</p>"},{"name":"Army Men: World War - Team Assault","year":2001,"developer":"5000ft Inc.","url":"psxchda/Army%20Men%20-%20World%20War%20-%20Team%20Assault%20%28USA%29.chd","filesize":151534623,"score":"","genres":"Action > Strategy > 3rd-person (Other) > Shooter > Tank","desc":"<p>The long ongoing war between the Tan and Green armies may finally be at an end. The Tan army is in the midst of creating weapons of mass destruction to finally put an end to the Green army and the war once and for all. It's now up to the player to guide a team of Green army commandos to put a stop to the Tan army's plans.</p><p>The game contains 16 stages that feature different objectives such as blowing up a bridge or escaping from a P.O.W. camp. Before starting each stage, players get to select 2 of the 6 different commandos to take into the field of battle. Each commando has their own ratings in speed, stealth, and hit points. Each also has two special skills. Skills can include being adept at demolition, linguistics, heavy weapons, sniper, mechanic, communications, or repair. Players can switch control between the 2 commandos during a stage. During some stages players also get a chance to maneuver assault vehicles and tanks, aim aircraft artillery, and pilot submarines.</p><p>The game also contains a Training mode and a 2 player multiplayer mode. Multiplayer modes consist of Capture the Flag and Grudge Match games.</p>"},{"name":"Art Camion Sugorokuden","year":2000,"developer":"Affect Co.,Ltd"},{"name":"Arthur to Astaroth no Nazo Makaimura: Incredible Toons","year":1996,"developer":"Capcom Co., Ltd."},{"name":"Arthur! Ready to Race","year":2000,"developer":"Runecraft Ltd.","url":"psxchda/Arthur%21%20Ready%20to%20Race%20%28USA%29.chd","filesize":113839629,"score":"","genres":"Educational > Puzzle > Racing / Driving > 3rd-person (Other) > Pre-school / toddler > Licensed","desc":"<p><em>Arthur! Ready to Race</em> is a racing game based on the Arthur Read aardvark character created by the American children's books writer Marc Tolon Brown. Arthur and his friends need to make the best race cart they can to participate in a big race. The gameplay is very easy and aimed at young children. They can race alone (against the computer) or with friends, and they can be able to solve problems that show up in the game. To create the cart Arthur needs to solve puzzles at the Sugar Bowl and the Pet Shop, and collect Bionic Bunny cards that can be traded in for racing accessories. There are cameo appearances by Arthur's younger sisters (D.W. and Kate Read) and his mother (Mrs. Jane Read) can also be seen.</p>"},{"name":"Assault","year":1998,"developer":"Namco Limited","url":"psxchda/Assault%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":107686904,"score":"","genres":"Action > Top-down > Arcade > Tank > Sci-fi / futuristic","desc":"<p>In <em>Assault</em>, the player's homeland is invaded by aliens. The next course of action is clear: manning a tank and blasting them away!</p><p>The goal of each of the eleven levels is to reach the end (occupied by a fortress) and killing the opposition while avoid being hit by their projectiles - at first the player only has to worry about ground forces, but in later stages the tank is also being shot at from above. The game is shown from an overhead perspective, but the tank is always the center of attention: the level rotates around the tank when it is moved. Because of this, it is possible to move in the wrong direction, but when that happens an arrow pops up and shows the right way.</p><p>The controls use two four-way joysticks and are similar to Battlezone: the tank moves forward when pulling both joysticks forward and it turns when moving one of them to the side. However, there are two additional moves available: a sideway roll (pushing both joysticks to the side) and a grenade attack (when pushing both joysticks apart, the tank stands on its rear and the player can unleash a powerful but slow attack with crosshairs). In each level there is also a jump pad which lifts the tank in the air which means the player gets a bigger view over the level. This is not only useful to get an overview, but it is also possible to shoot grenades while in the air. It can be used three times per level.</p>"},{"name":"Assault Rigs","year":1996,"developer":"Psygnosis Limited","url":"psxchda/Assault%20Rigs%20%28Europe%29.chd","filesize":349121553,"score":7.2,"genres":"Action > 1st-person > 3rd-person (Other) > Shooter > Tank > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In the future, physical sports will be replaced by a violent virtual contest, where a lot of gambling and corporate cash is involved.</p><p>Such is the setting for this action-packed game, where you act as a jockey for a virtual tank of massive firepower, called a Rig. Navigate through the maze-like arenas with jumps, elevators and movable blocks. Pick up power-ups to overcome other Rigs, or Gems to advance through more than 40 levels.</p><p>Graphics and ambiance are inspired, it seems, by Tron, and place the player in a \"wire framed\" virtual environment. The focus here, though, is not racing, but rather blowing your opponent to oblivion. For that purpose the game gives the player progressively more power and versatility. Mini guns, laser cannons and heat seeking missiles are pretty much standard gear, but it also has a couple of twists of its own: feed your guns bouncing or shattering ammo rounds for added firepower, or experiment with the fly-by-wire missiles, where you remote control it to your target of preference. Shields and turrets are also at your disposal.</p><p>Also, as the game progresses, you can choose different tanks (Rigs) to use in your struggle to survive the clash. The game features 3-D graphics with light sourcing and multiplayer features.</p>"},{"name":"Assault: Retribution","year":1998,"developer":"Candle Light Studios Ltd.","url":"psxchda/Assault%20-%20Retribution%20%28USA%29.chd","filesize":109705457,"score":6,"genres":"Action > Side view > Top-down > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p><em>Assault: Retribution</em> is a 3D run and gun platform game. Its story takes place in the year 2198. Arcadia, a world far away from Earth, is under attack by aliens. As members of the Arcadia Defense Force, the player takes part in the fight against the invaders.</p><p>Featuring 3D graphics, the game's perspective varies from side scrolling to top down. There are 4 weapons available to each character, though the differences are mostly cosmetic (a weak gun with wide spread, a stronger but slightly slower gun, a homing weapon, and a powerful BFG). As the character picks up a Gun item, the character's next tier gun slot is filled. Each gun can be upgraded three times, which increases the number of shots fired per trigger pull, but also increases energy drain. Energy can be recovered by picking up the appropriate item, as can health. It is also possible to store health or energy for later use (though each character has only one item slot). Other pick ups includes an invulnerable energy sphere (can't be stored), lighting barrier and bonus lives. Besides the usual movement and shooting, the characters can also aim up, down at various angles and have a 'strafe/ side step' move.</p><p>There are seven action packed levels. Multiplayer is possible in two-player co-op mode.</p>"},{"name":"Asterix","year":1993,"developer":"New Frontier","url":"psxchda/Asterix%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.chd","filesize":425274957,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The year is 50 BC. Gaul is entirely occupied by the Romans. Well, almost entirely... One small Gaulish village continues to defy the occupying forces, the villagers protected by a magic potion which makes them invincible. But now Obelix has vanished! The Romans have confirmed his capture and taken him to an unknown destination. </p><p>Astérix is a platform game based on the eponymous comic books, where the short and mustached Gaul has to progress through levels located all across Europe, fighting Romans and various aggressive animals along the way, to rescue his friend Obelix before Caesar throws him to the lions....  </p>"},{"name":"Astérix and Obélix Take on Caesar","year":1999,"developer":"Tek 5","url":"psxchda/Asterix%20%26%20Obelix%20Take%20On%20Caesar%20%28Europe%29.chd","filesize":277693832,"score":4.3,"genres":"Action > 3rd-person (Other) > Direct control > Licensed","desc":"<p><em>Asterix and Obelix Take on Caesar</em> is based on the film by Claude Zidi, which was in its turn adapted from the work and characters of René Goscinny and Albert Uderzo. Julius Caesar's dream is just a sword's reach away, but he needs more sesterces to pay the legions. As a result, all of Gaul is charged a tax... All? Well, not quite! A small village of invincible Gauls is still holding out against the invaders.</p><p>Meet all your favorite heroes and characters from the film Asterix &amp; Obelix take on Caesar. Run, jump and clout the Romans in the same scenes as the film. Get to the heart of the action and put your skills and reflexes to the test. Fight trap-door spiders in the circus arena, chase Roman soldiers under the orders of Caïus Bonus and set free the druid Getafix who has fallen into the hands of the terrible Detritus.</p>"},{"name":"Astérix: Mega Madness","year":2001,"developer":"Unique Development Studios AB","url":"psxchda/Asterix%20-%20Mega%20Madness%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":445135680,"score":6.8,"genres":"Action > Racing / Driving > Sports > 3rd-person (Other) > Behind view > Top-down > Fighting > Hunting > Mini-games > Party game > Direct control > Classical antiquity > Fantasy > Licensed","desc":"<p>The year is 50 B.C.. In the sole, well-known Gaulish village that stands against the Roman oppressors, Chief Vitalstatistix announces a contest to find out who is the bravest, boldest, and strongest Gaul. The volunteers for the contest are Astérix, Obélix, Cacofonix and Mrs. Geriatrix, who compete in a series of different mini-games, split in four days. These range from shooting various objects (and unfortunate pirates and Romans) at a marching Roman army, gathering ingredients for Getafix, eating fast at a feast table while avoiding rotten food items, hunting wild boars, racing with catapults, racing while carrying another Gaul on a shield, demolishing a Roman camp and more. Players can engage in practice mode (play each activity individually), Mega Madness mode (campaign mode with connected activities and cumulative ranking), and team play. Each mini-game can be played by one or two human players.</p>"},{"name":"Astérix: The Gallic War","year":1999,"developer":"Sourcery Development Ltd."},{"name":"Asteroids","year":1998,"developer":"Syrox Developments, Ltd.","url":"psxchda/Asteroids%20%28Europe%29.chd","filesize":58858903,"score":6.6,"genres":"Action > Top-down > Fixed / flip-screen > Video backdrop > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Unlike Activision's earlier remake of an Atari arcade classic, Battlezone, this one stays close to its namesake. Take the original, Atari coin-op game Asteroids, add in the features of the Atari 2600 cartridge, then give it 3-D graphics and a bunch of power-ups, and you've got Activision's Asteroids remake.</p><p>You are an employee of the Astro-Mining Corporation. Your mission is to simply go to an assigned area of space and clear the area of asteroids and the occassional debris. The game consists of five zones, each with a different background and some with special features. Each zone has 15 levels. In addition to the standard asteroids, there are also mined asteroids that explode; indestructible asteroids that are, well, indestructible; fireball comets; crystal asteroids that regenerate; alien egg asteroids containing deadly baby space worms; and ancient energy asteroids that shoot back! And there's plenty of enemies in addition to the asteroids, such as Standard and Super Saucers, Asteroids Tugs, Fuel Transports, Hexes, Nuke Drivers, and Vulturoids.</p><p>There are three types of ships to choose from, each with different strengths and weaknesses. There are also three skill levels. If you beat the game at Expert or higher, you gain access to a fourth type of ship. All ships features the standard laser, shield, flip (instantly flips your ship 180 degrees), and hyperspace. There are also limited power-ups you can pick up such as GunSat, Mines, Homing Missiles, Plasma Drill, and Trigger Bombs.</p><p>The game supports either one or two players. In two player mode, the object is to simply outscore your opponent in a random zone and level. You cannot directly kill your opponent by shooting him, but there are other ways....</p><p>Lastly, if you shoot the classic-style asteroid in level 15 of the first zone, you'll find the option of \"Classic Asteroids\" now appearing on the main menu.</p>"},{"name":"Astronōka","year":1998,"developer":"MuuMuu Co., Ltd."},{"name":"Asuka 120% Excellent: BURNING Fest.","year":1997,"developer":"Fill in Café Co., Ltd."},{"name":"Asuka 120% Final: BURNING Fest.","year":1999,"developer":""},{"name":"Asuka 120% Special: BURNING Fest.","year":1996,"developer":"Fill in Café Co., Ltd."},{"name":"Atari: Anniversary Edition","year":2002,"developer":"Digital Eclipse Software, Inc.","url":"psxchda/Atari%20Anniversary%20Edition%20Redux%20%28Europe%29.chd","filesize":356313747,"score":7,"genres":"Compilation","desc":"<p>The <em>Atari Anniversary Edition</em> features 12 classic Atari games, whereby two versions of this game exits. One for Dreamcast/Windows and the other one for PlayStation.</p><p>The Dreamcast/Windows version features the following games:</p><ul><li>Asteroids</li><li>Asteroids Deluxe</li><li>Battlezone</li><li>Centipede</li><li><strong>Crystal Castles</strong></li><li>Gravitar</li><li><strong>Millipede</strong></li><li>Missile Command</li><li>Pong</li><li>Super Breakout</li><li>Tempest</li><li>Warlords</li></ul><p>The PlayStation version features these games:</p><ul><li>Asteroids</li><li>Asteroids Deluxe</li><li>Battlezone</li><li><strong>Black Widow</strong></li><li>Centipede</li><li>Gravitar</li><li>Missile Command* Pong</li><li><strong>Space Duel</strong></li><li>Super Breakout</li><li>Tempest</li><li>Warlords</li></ul><p><em>Note: the bold games are those that are just in the one version, but not in the other one.</em></p><p>In addition to the pure emulation modes, there is an option to display the cabinet art surrounding the display of each game, intended to give the player a sense of actually playing a stand-up machine. </p><p>Each game also has a toggle for an \"enhanced\" graphical mode, which varies from game to game. For instance, \"enhanced\" asteroids merely has a static backdrop, whereas \"enhanced\" warlords is a complete graphical overhaul with new colors. It should be noted that the \"enhanced\" version of Tempest is none other than Tempest Tubes, a modification for Tempest made in 1982 by Duncan Brown.</p><p>Also included is a gallery of game memorabilia, video clips of an interview with Nolan Bushnell, and desktop themes for Windows.</p>"},{"name":"Atelier Elie: Salburg no Renkinjutsushi 2","year":1998,"developer":"Gust Co., Ltd."},{"name":"Atelier Marie Plus: Salburg no Renkinjutsushi","year":1998,"developer":"Gust Co., Ltd."},{"name":"Atelier Marie: Salburg no Renkinjutsushi","year":1997,"developer":"Gust Co., Ltd."},{"name":"Athena: Awakening from the Ordinary Life","year":1999,"developer":"Yumekobo Co., Ltd."},{"name":"Atlantis: The Lost Continent","year":2003,"developer":"The Code Monkeys Ltd.","url":"psxchda/Atlantis%20-%20The%20Lost%20Continent%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":391828440,"score":"","genres":"Puzzle > Top-down > Cards / tiles","desc":"<p>Rodrigo, the fisherman's son one day finds a letter in a bottle on the beach. With some help of his grandfather he understands that it tells him how to find the famous lost city of Atlantis. Now Rodrigo and his grandfather along with their dog Uzo sets out on a journey to find the long lost island. </p><p><em>Atlantis: The Lost Continent</em> is a game for children that consists of:</p><ul><li>a cartoon film (A Dingo Pictures film titled <em>Atlantis: Der verlorene Kontinent</em>)</li><li>a slide puzzle</li><li>a picture coloring game</li></ul><p>The game was later released on the PlayStation 2 as <em>Empire of Atlantis</em>. It's the same game as the PlayStation version but adds a jigsaw puzzle mode and a pair matching mini game.</p>"},{"name":"Atlantis: The Lost Tales","year":1998,"developer":"Cryo Interactive Entertainment","url":"psxchda/Atlantis%20-%20The%20Lost%20Tales%20%28Europe%29%20%28Disc%201%29.chd","filesize":327533257,"score":7,"genres":"Adventure > 1st-person > Puzzle elements","desc":"<p>The advanced city design of Atlantis shows that a fully-fledged society must've functioned there, and this adventure game brings it to life. Queen Rhea is the leader who is under threat, and young Seth is the character you control as he aims to save the day. How can he know who to trust, and who has their own agenda in this complex world?</p><p>The world of Atlantis is displayed in fully-rotational full-screen 3D comprising of millions of polygons and full lip-synching using a proprietary system. Listen out for sounds of danger - sometimes they are the first warning you get.</p><p>There are 5 different continents to explore, and each has its own cultures. In total there are 50 characters you will interact with, and puzzles using an inventory system. Save points are limited by the game.</p>"},{"name":"Attack of the Saucerman!","year":1999,"developer":"Fube Industries Ltd.","url":"psxchda/Attack%20of%20the%20Saucerman%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":381006504,"score":5.4,"genres":"Action > 1st-person > 3rd-person (Other) > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The \"NEDCO\" have plans to make earthlings their staple food group. It is up to you to make sure that doesn’t happen.</p><p>In this comedic science fiction 3D action game you play Ed, a blue-collar worker from the alien world of Grimloid.  In his flying saucer, fly through 28 arcade-like levels and devastate your enemies with a variety of weapons, including one called the \"Love Bomb\".</p><p>Besides the basic forward, back, left and right movements, strafe, jump and shoot the \"Neds\" for points.</p>"},{"name":"ATV Mania","year":2003,"developer":"Deibus Studios Ltd.","url":"psxchda/ATV%20Mania%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.chd","filesize":177055144,"score":"","genres":"Racing / Driving > Sports > Behind view > Shooter > Off-roading","desc":"<p><em>ATV Mania</em> is an all-terrain vehicle combat racing game. Modes include Championship, Single Race, and Time Attack.</p><p>The main mode is the Championship mode which lets the player compete in an underground ATV championship circuit which is being held amongst the French Alps. The player's goal is to win the races by any means necessary.</p><p>The player gets to choose to play as one of six different racers, with each racer having their own ATV to race with. Each vehicle has its own unique ratings in speed, grip, and armor. The player then races against 5 of the other racers on 6 different tracks. The higher the position the player gets in a race, the more points and cash they earn. The player with the most points after all 6 races are done wins the championship. Also, after each race, the racer is asked questions by another character, where they get to choose their answer from a list of responses. For example, an investigative news reporter trying to get a scoop on the illegal races, gives the player an interview, which can earn the player some extra cash depending on how cooperative they are. Any cash earned can then be spent on more weapon ammo for the player's vehicle. Examples of weapons included in the game are grenades, land mines and homing missiles. </p><p>Single race mode lets the player compete against another player or the computer A.I. on any of the six tracks in the game. Time Trial mode lets the player try to complete any of the tracks in as fast of a time as possible.</p><p>Options include setting the difficulty level, turning on or off weapons, and turning on or off the interview screens.</p>"},{"name":"ATV Racers","year":2003,"developer":"Miracle Designs","url":"psxchda/ATV%20Racers%20%28Europe%29.chd","filesize":43291705,"score":"","genres":"Racing / Driving > Behind view > Arcade > Direct control > Off-roading > Track racing","desc":"<p><em>ATV Racers</em> features a variety of animals who are out to win an ATV racing championship through means of vehicular combat racing. The game features a Tournament, Arcade, and Time Trial mode.</p><p>In tournament mode, players get to choose one of the 10 (8 are selectable from the start and 2 are unlockable) animal racers to race with. The tournament offers three different sets of trophy races; the cross cup, dune cup, and the rock cup. Each cup consists of 3 different racetracks; underground, red rock, and atlantis. These 3 racetracks get altered depending on what cup the player is competing for.</p><p>When racing, players attempt to beat the five opponents they are up against to the finish line. To help achieve this goal, players can shoot guided rockets, use speed boosts, and lay mines to hinder their opponents. The higher the position the player gets in a race, the more points they earn. The player with the most points after all the races are done wins the championship cup.</p><p>Arcade lets the player compete on any of the available tracks so they can practice racing on them. Time Trial lets the player race solo, trying to defeat a track in as little time as possible.</p><p>Options include setting the difficulty level (easy or medium), setting the number of laps (3, 5, 9 or 50), and whether to turn vibration on or off.</p>"},{"name":"ATV: Quad Power Racing","year":2000,"developer":"Climax Group Limited","url":"psxchda/ATV%20-%20Quad%20Power%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":125316168,"score":4.7,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Off-roading > Vehicle simulator","desc":"<p><em>ATV: Quad Power Racing</em> introduces to the PlayStation the slightly unusual sport of four-wheeled all-terrain vehicle racing. </p><p>The game includes three different terrain types (forest, desert and ice) with four tracks each. There are Amateur and Pro Championships for every terrain type, with Amateur and Pro tracks differing slightly. The Amateur trophy has to be won to unlock the respective Pro circuit. Players can select from six different riders and at the start there are two quads per terrain available to choose from. Winning each Amateur circuit unlocks two more per terrain and winning everything unlocks the best quad in the game.</p><p>Gameplay is seen from either 3rd (behind the quad) or 1st person perspectives and players can select from manual or automatic transmission. The quad and the rider are controlled independently from each other: the right analog stick steers the quad while the left stick is used for leaning the rider, which is important while cornering: incorrect leaning can lead to the rider being thrown off, losing valuable time.</p><p>Besides the Championship mode, there are Single Race, Time Trial and Two-Player modes. Tracks and quads to be used in those modes have to be unlocked via winning Championship races first.</p>"},{"name":"Austin Powers Pinball","year":2002,"developer":"Wildfire Studios Pty. Ltd.","url":"psxchda/Austin%20Powers%20Pinball%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":73309168,"score":5.6,"genres":"Action > Top-down > Arcade > Pinball > Licensed","desc":"<p><em>Austin Powers Pinball</em> is a based on the Austin Powers movie franchise.</p><p>Two tables are included - one based on International Man of Mystery and the other based on <em>The Spy Who Shagged Me</em>. Tables can be played in either full-screen or scrolling mode. Sound effects and dot-matrix animations are taken from the movies, while the music is merely in the same style. And here comes the obligatory tagline: \"Groovy baby, yeah!\"</p>"},{"name":"Auto Destruct","year":1997,"developer":"Neurostone","url":"psxchda/Auto%20Destruct%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CSv%29.chd","filesize":260013923,"score":6.9,"genres":"Action > Racing / Driving > 1st-person > 3rd-person (Other) > Shooter > Sci-fi / futuristic","desc":"<p><em>Auto Destruct</em> involves mission-based car combat. Unlike similar titles such as Destruction Derby and Twisted Metal, this doesn't focus on arena-type face-offs with multiple opponents.</p><p>Sometime in the near future, your family is killed by a mysterious cult. You join an underground organization dedicated to annihilating this cult, and are outfitted with an armed car (customizable to an extent). The 25 missions vary, from simple search-and-destroy rounds to escort missions and defense missions.</p>"},{"name":"Autobahn Raser II","year":2000,"developer":"Davilex Games B.V."},{"name":"Autumn-Christmas Releases '96","year":1996,"developer":"Sony PlayStation","url":"psxchda/Autumn-Christmas%20Releases%20%2796%20%28Europe%29.chd","filesize":159439989,"score":"","genres":"","desc":"<p>Autumn-Christmas Releases ’96 is an action game developed and published by Sony PlayStation in 1996.</p>"},{"name":"Ayakashi Ninden Kunoichiban","year":1997,"developer":"Zero System"},{"name":"Ayrton Senna Kart Duel","year":1996,"developer":"GAPS Inc.","url":"psxchda/Ayrton%20Senna%20Kart%20Duel%20%28Europe%29.chd","filesize":187405323,"score":6.9,"genres":"Racing / Driving > Simulation > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Ayrton Senna Kart Duel</em> is a 3D kart racing game named after Ayrton Senna. Playable modes presented in the game include: \"Race\", \"T.T\", \"VS\", and \"Beginner\".</p><p>The Race mode is divided into three different classes: S Stock, SS Stock, and A Stock. Each class has three races. Before every race there are four different karts to choose from, each of them with its own characteristic (different acceleration, grip, maximum speed, and handling). The number of race laps can also be chosen: three, five, or ten.</p><p>The player must win every single race in order to advance in the game, and therefore be promoted. Finishing below the first position only drives the player to the Game Over screen.</p><p>After finishing successfully all the nine races, the player will receive the final challenge: racing against the greatest Ayrton Senna. If the player wins it, Senna will give the car he drove as a reward.</p><p>The game also features a Senna Memorial Data where it is possible to view some of the Senna's career records and photos.</p>"},{"name":"Ayrton Senna Kart Duel 2","year":1997,"developer":"GAPS Inc.","url":"psxchda/Ayrton%20Senna%20Kart%20Duel%202%20%28Europe%29.chd","filesize":144597795,"score":"","genres":"Racing / Driving > Simulation > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Ayrton Senna Kart Duel 2</em> is a 3D karting game named after famous Brazilian kart and Formula One racer Ayrton Senna. The game features a Time Attack mode, VS Battle mode and a Grand Prix mode. The Grand Prix mode contains three classes. With good results you can promote to higher classes. There are 8 tracks that can be raced on and three different difficulty settings.</p><p>You race against seven opponents and you can adjust some of the settings of your kart. There are two camera viewpoints in single player, but only one in multi player.</p><p>The game also features a Senna Memorial album with pictures of the famous racer.</p>"},{"name":"Azito","year":1997,"developer":"Astec 21"},{"name":"Aztec: The Curse in the Heart of the City of Gold ","year":2000,"developer":"Cryo Interactive Entertainment","url":"psxchda/Aztec%20-%20The%20Curse%20in%20the%20Heart%20of%20the%20City%20of%20Gold%20%28Europe%29%20%28En%2CNl%29.chd","filesize":470718569,"score":6.1,"genres":"Adventure > 1st-person > Puzzle elements > History > Pre-Columbian Americas","desc":"<p>This 1st person adventure game is set in the time of the Aztecs. A nobleman has been murdered, and you've been blamed for it, you must run away and save yourself.  Is there a connection between his murder and the strange illness affecting the population? The sacred amulet you hold may be the key to it all.</p>"},{"name":"Azumanga Donjara Daioh","year":2002,"developer":"Ganbarion Co., Ltd."},{"name":"Azure Dreams","year":1997,"developer":"KCE Tokyo, Inc.","url":"psxchda/Azure%20Dreams%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":280207026,"score":6.6,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy > Regional differences","desc":"<p>The huge Monster Tower stands near the village Monsbaiya. It is populated by vicious monsters, and few dare enter it. But the monsters in the tower lay eggs, and whoever takes possession of such an egg, can tame a monster which will come out of it, and those monsters, called \"familiars\", will help their tamers in times of danger. Some brave adventurers dared to enter the tower and to take the eggs. One of them was called Guy. He was killed in the monster tower. Now his son Koh is fifteen, and he is allowed to try his luck in the tower.</p><p>The player controls Koh and his party of \"familiars\" in this dungeon crawling/monster taming RPG. Each floor of the tower is randomly generated when entered, including the layout, items, and traps within it, although the enemy monsters that appear are based on the current floor number. Movement and combat in the game is turn-based; first Koh moves, then allied familiars, then enemy monsters, but outside of combat enemy turns happen instantly. Because Koh's level is reset to 1 every time he enters the tower he has to depend on equipment, a sword and a buckler, and familiars. A familiar's MP will slowly deplete as it follows Koh, however, and they must be periodically fed with appropriate food or they will become unresponsive. As in most <em>Mysterious Dungeon</em> type games Koh will lose all items, even carefully upgraded equipment, if he is defeated in the tower, so fleeing the tower is always a valid strategy.</p><p>Once back in town the player can hatch any found monster eggs into permanent familiars and sell off loot from the tower. This money can then be reinvested in the town to add new buildings, decorate Koh's house, unlock minigames, and to show up Koh's rival Ghosh, a rich pretty-boy who never lifted a finger to help Monsbaiya. As Koh restores the town he also meets new female love interests, who over the course of several dungeon trips can be befriended and eventually become close confidants. Koh's familiars retain levels earned in the dungeon, and by carefully merging familiars they can be upgraded with skills they otherwise could never acquire.</p>"}]