[{"name":"B.L.U.E.: Legend of Water","year":1998,"developer":"CAProduction Co., Ltd.","url":"psx-chd-roms-b/B.%20L.%20U.%20E.%20-%20Legend%20of%20Water%20%28Japan%29.chd","filesize":265661077,"score":"","genres":"Adventure > 3rd-person (Other) > Puzzle elements > Direct control","desc":"<p><em>b.l.u.e.: Legend of Water</em> is a 3D game with many puzzles. Maia, a seventeen-year-old girl and main character of the game, travels to Northern Cross, a marine research station where her father is working. The team at Northern Cross is excavating ruins that are believed to be from an ancient temple of the Mu dynasty. After a dream, Maia visits the ruins and investigates the mystery of the temple with the dolphin Luka. Throughout the game they cooperate to solve puzzles. A large part of the game is spent underwater, exploring.</p>"},{"name":"Baby Felix Tennis","year":2002,"developer":"Spark Entertainment SARL","url":"psx-chd-roms-b/Baby%20Felix%20Tennis%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":49344686,"score":"","genres":"Sports > 3rd-person (Other) > Tennis > Licensed","desc":"<p>Felix The Cat is one of the oldest popular cartoon characters since 1919. <em>Baby Felix</em> was a kids animated television cartoon that ran in 2000 and featured infant character versions of Joe Oriolo's Felix television cartoon from the fifties. School has ended and summer vacation for Felix and his friends is going to be fun as they will be playing tennis. Players can choose to play as either Baby Felix, Kitty, or Tattoo, plus four others can be unlocked by achieving set challenges in-game. </p><p>It is a standard tennis game with an angled view so that the opponent's court is smaller than the opposing player's and as the character approaches the net, the camera view slightly follows it. There is a training mode and a progressive Championship mode. On different court surfaces, the ball moves differently. There is a meter for the serve where hitting it at a different point will give it a spin. Two players can also go multiplayer head-to-head against each other.</p>"},{"name":"Baby Universe","year":1997,"developer":"3D Kaleidoscope","url":"psx-chd-roms-b/Baby%20Universe%20%28Europe%29.chd","filesize":263112411,"score":5.2,"genres":"Simulation > Music / rhythm","desc":"<p><em>Baby Universe</em> in an experiment in visuals. It consists of different worlds with digital kaleidoscopes. One of them, a 3D Kaleidoscope, is floating in space. You create visual effects by pressing buttons on the controller, to turn the different axes, bend and reflect light, and change the angle, with different background patterns. All your actions can be recorded and saved.</p><p>In the jewel case, you select the objects to appear on the screen, and in the console, you can edit each individual item. This includes colour mapping of the surface, movement patterns and frame rate. Settings can be saved on a memory card. In the sound scape, you can insert your own CDs, and sound wave patterns will appear to accompany the music. There is also a traditional (electric) and a psychedelic kaleidoscope available.</p>"},{"name":"Backstreet Billiards","year":1998,"developer":"Agenda Co., Ltd.","url":"psx-chd-roms-b/Backstreet%20Billiards%20%28USA%29.chd","filesize":329300172,"score":7,"genres":"Sports > 1st-person > 3rd-person (Other) > Pool / snooker","desc":"<p>Backstreet Billiards is one of the most unique and full fledged pool simulations for Playstation. This game offers a wide variety of pool and carom games: 8-Ball, 9-Ball, Rotation, Basic Pool, 141 Continuous, Bowlliards, Cutthroat, 5-9 and One Pocket. Carom games include: 3-Ball, 4-Ball, Free, One Cushion, and Three Cushion. Adding to that are timed, trick shot and practice modes. The most unique aspect of the game though is a story-mode. This mode consists of a adventure game where you play as a character on the search for his father's famous pool cue. The story mode allows you to visit different locations and challenge opponents who get tougher along the way. Hidden items and ability upgrades help you along the way in this RPG like mode. Four player's are supported with or without multitap.</p>"},{"name":"Backyard Soccer","year":2001,"developer":"Runecraft Ltd.","url":"psx-chd-roms-b/Backyard%20Soccer%20%28USA%29.chd","filesize":226501325,"score":"","genres":"Action > Sports > Football (European) / Soccer","desc":"<p>A console version of <em>Backyard Soccer</em> based on the MLS Edition minus the MLS license, the game mechanics mostly follow that of the computer versions -- pick a field, pick a team name and colors, and choose who you want to be on your team. You may also play through a season. </p><p>Although it may sound like the same game, the ball physics and player movement is entirely different from the PC/Macintosh versions. It can be seen as less realistic; the players and ball move far more stiffly than in the computer versions.</p>"},{"name":"Bakushō!! All Yoshimoto Quiz-Ou Ketteisen DX","year":1995,"developer":"Tose Co., Ltd.","url":"psx-chd-roms-b/Bakushou%21%21%20All%20Yoshimoto%20Quiz-ou%20Kettei-sen%20DX%20%28Japan%29.chd","filesize":433286333,"score":"","genres":"Puzzle > 1st-person > Fixed / flip-screen > Live action > Turn-based > Game show / trivia / quiz > Menu structures > Fantasy > Japan (Modern/Futuristic) > Licensed","desc":"<p><em>Bakushō!! All Yoshimoto Quiz-Ou Ketteisen DX</em> is a quiz game based on the popular TV show Yoshimoto Club. There are two different modes. The first mode has the player going on a fantasy quest to rescue a princess and the player has to answer questions correctly to bypass monsters. The second mode is a classic game show in which the player must answer as many questions correctly as possible to get the highest number of points.</p>"},{"name":"Baldies","year":1998,"developer":"Creative Edge Software","url":"psx-chd-roms-b/Baldies%20%28Europe%29.chd","filesize":89587136,"score":7.1,"genres":"Strategy > Top-down > Free-roaming camera > Real-time > Real-time strategy > Multiple units/characters control > Point and select","desc":"<p>The premise of <em>Baldies</em> is similar to many real-time strategy games. You start with a limited number of Baldies with which you construct buildings, increase your population, and create the necessary instruments of war. There are four classes of Baldies--builders, scientists, soldiers, and workers/breeders. Structures include small, medium, large, and huge houses as well as science labs and barracks. Each building has specific properties that assist in your destruction of the enemy.</p>"},{"name":"Ball Breakers","year":2000,"developer":"Lost Toys Ltd","url":"psx-chd-roms-b/Ball%20Breakers%20%28USA%29.chd","filesize":264368509,"score":6.6,"genres":"Action > 3rd-person (Other) > Diagonal-down > Direct control > Sci-fi / futuristic","desc":"<p>The universe is made up of human and synthetic lifeforms. Synthetic lifeforms are considered second class citizens by their human counterparts. The story takes place on the prison planet Alpha Prime, a world completely designed for the holding of criminals. You are a synthetic lifeform sentenced for an eternity for a crime you didn't commit and in order to earn your freedom, you must compete against other prisoners in competitions in 10 different incarceration facilities. To compete in these competitions however, you must undergo a procedure that removes your legs and replaces it with a rolling sphere. </p><p>There are seven different events to compete in which are Pursuit, Last Man Rolling, Race, King of the Hill, Run the Gauntlet, Tag, and Powerball that pit you not only against your fellow inmates and guards, but against the levels themselves. Run the gauntlet charges you with making it to a goal point within a time limit, all the while avoiding other warriors and obstacles such as flame throwers, spikes, and gun turrets. Pursuit is identical, but it adds the challenge of the arena crumbling away. Powerball has you collecting balls throughout the arena and throwing them at a goalpost before time runs out. Tag has you collecting a set number of tokens that have been scattered throughout the arena within a set time limit.</p>"},{"name":"Ballblazer Champions","year":1997,"developer":"Factor 5 GmbH","url":"psx-chd-roms-b/BallBlazer%20Champions%20%28Europe%29.chd","filesize":286492096,"score":6.3,"genres":"Action > Sports > 3rd-person (Other) > Sci-fi / futuristic","desc":"<p>An updated version of the 1985 classic Ballblazer. The basic rules have stayed the same: two players in rotofoils compete to put the plasmorb into the enemy's goal. But the new version adds numerous power-ups including weapons into the game, so you can blast the enemy out of the way.</p><p>Choosing one of 8 different characters, each with a unique rotofoil, you compete in the Interstellar Ballblazer Championship to attain the title of Master Blazer. After a won game, you can upgrade your rotofoil with new equipment.</p><p>In addition to the tournament mode, there is also a practice option and a split-screen multiplayer mode.</p>"},{"name":"Ballerburg: Castle Siege","year":2003,"developer":"ASCARON Entertainment GmbH","url":"psx-chd-roms-b/Ballerburg%20-%20Castle%20Chaos%20%28USA%29.chd","filesize":421402589,"score":7.4,"genres":"Action > Strategy > Diagonal-down > Real-time > Artillery > Managerial / business simulation > Shooter > Fantasy","desc":"<p><em>Ballerburg: Castle Siege</em> is a real-time artillery strategy game influenced by an earlier game with the same name. The goal is to destroy the opponent's castle (or something else, as described in the mission briefing). To accomplish your mission, you have no armies to command - your only weapons are ballistic: cannons, catapults and the like. It is also possible to use a bomber airship and some magic effects.</p><p>Everything takes place in a 3D environment. You can build your own castle and its surroundings such as peasant huts and smithies,where weapons can be placed. These things cost gold, and you get gold by collecting taxes from the peasants. To destroy the opponent's castle, you use your guns and catapults. It is impossible to see in advance where the shot will land, so you need to shoot the target more than once to be more precise. You can have multiple guns and switch between them to bombard your enemy with heavy stones, cannonballs, etc. You can upgrade these weapons to become even more deadly. However, these weapons cannot be fired all the time - they need time to reload and every shot needs to be paid for.</p><p>Meanwhile, the opponent shoots at your settlement, trying to cut you short of peasants so you cannot buy anything. To hinder him, you can use wizards, which are able to summon sandstorms and rain, obstructing the opponent's sight and targeting. The game supports multiplayer and hot-seat mode up to four players at once.</p>"},{"name":"Ballistic","year":1999,"developer":"Mitchell Corporation","url":"psx-chd-roms-b/Ballistic%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":99946935,"score":7.7,"genres":"Puzzle > Top-down > Fixed / flip-screen > Real-time > Arcade > Tile matching puzzle","desc":"<p><em>Ballistic</em> is a puzzle game in which the player must place 3 patterned balls next to each other in order to clear them. It is somewhat similar to Puyo Puyo in this respect. However <em>Ballistic</em> places the player in the center of the screen shooting the balls outward. In Panic! mode, a constant string of balls appear and the player must keep destroying similar balls to keep the string short and prevent it from snaking around and reaching the middle of the screen. In Checkmate mode, a limited amount of balls are given to the player which they must use to destroy all the balls on the screen. Strategy is used here since the amount of balls destroyed must be maximized.</p><p><em>Ballistic</em> also features a versus mode in which players can challenge one another. Similar to other puzzle games versus modes, one player's success results in additional balls on the other player's screen which they then must clear.</p>"},{"name":"Bandit Kings of Ancient China","year":1996,"developer":"KOEI Co., Ltd."},{"name":"Banshee's Last Cry","year":1998,"developer":"Chunsoft Co., Ltd."},{"name":"Barbapapa","year":2001,"developer":"Sun Corporation"},{"name":"Barbie Explorer","year":2001,"developer":"Runecraft Ltd.","url":"psx-chd-roms-b/Barbie%20-%20Explorer%20%28Europe%29.chd","filesize":112316503,"score":"","genres":"Action > Behind view > Platform > Puzzle elements > Licensed","desc":"<p><em>Barbie Explorer</em> is a game much in the style of the Tomb Raider series. Barbie is a reporter doing a story about a local museum when she learns of a mystical mirror that is missing four shards. If it is reassembled, it will have great power. She sets out across the world to find them.</p><p>Barbie has a wide variety of moves, such as jumping, diving and rolling and she can collect new shoes to gain new abilities, like spring shoes for extra jumping height or hiking boots for better traction. After she jumps and climbs her way through the obstacles of a level, she must fight a boss for a piece of the mirror.</p><p>A two-player mode is included where Barbie competes with Theresa to complete levels, with the goal to lose the fewest number of lives and collect the most gems.</p>"},{"name":"Barbie: Groovy Games","year":2003,"developer":"Digital Illusions Canada, Inc."},{"name":"Barbie: Race & Ride","year":1999,"developer":"Runecraft Ltd.","url":"psx-chd-roms-b/Barbie%20-%20Race%20%26%20Ride%20%28Europe%29.chd","filesize":436600391,"score":5,"genres":"Sports > 3rd-person (Other) > Horse / derby > Licensed","desc":"<p>Barbie makes her first appearance on the PlayStation with 'Barbie: Race and Ride'.</p><p>Help Barbie take care of a stable of horses; groom the horses or feed them a variety of foods including apples, carrots, strawberries, and sugar cubes. After the steed is taken care of, go on a casual ride around Secret Valley. </p><p>Explore the beaches, meadows, mountains, and forests to discover new animal friends, mini-games, and puzzles. Find the pieces of the missing postcard and discover the secret of Secret Valley. For those with a more competitive streak, there are races and jumping contests.</p>"},{"name":"Barbie: Super Sports","year":1999,"developer":"Runecraft Ltd.","url":"psx-chd-roms-b/Barbie%20-%20Super%20Sports%20%28Europe%29.chd","filesize":148931663,"score":"","genres":"Sports > 3rd-person (Other) > Snowboarding / skiing > Licensed","desc":"<p>In <em>Barbie: Super Sports</em>, the blonde icon takes on the sports of Snowboarding and Rollerblading.</p><p>Both events have a practice area where Barbie gives advice on how to race and get better scores, which will earn tickets that can be traded in for better equipment. And you'll need better equipment if you want to beat Barbie and her friends. </p><p>After beating the computer-controlled opponents, challenge your friends to a race with the Two-Player mode, or see who can complete a course the fastest in the Time-Trial mode.</p>"},{"name":"Bardysh: Kromeford no Juunintachi","year":1999,"developer":"Infinity Co., Ltd.","url":"psx-chd-roms-b/Bardysh%20-%20Kromeford%20no%20Juunin%20%28Japan%29.chd","filesize":40726052,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Isometric > Action RPG > Roguelike > Direct control","desc":"<p>Bardysh is a roguelike RPG released by Imadio. Adventurers seeking a thrill came to Igis Island in search for the world's oldest heritage, a crystal that is said to make all wishes come true. Everybody is anxious to explore the labyrinth which nobody had reached the end of and the game offers 5 dungeons for the player to explore. Apart from exploring the dungeons, the island offers an arena to test one's strength. The main character can be chosen from 3 different types of species with male and female options. Each species can use different kinds of weapons.</p>"},{"name":"Baroque","year":1999,"developer":"Sting, Inc."},{"name":"Baroque Syndrome","year":2000,"developer":"Sting, Inc.","url":"psx-chd-roms-b/Baroque%20Syndrome%20%28Japan%29.chd","filesize":193372981,"score":"","genres":"Adventure > 1st-person > Visual novel > Detective / mystery > Horror","desc":"<p>A prequel to the post-apocalyptic RPG Baroque, Baroque Syndrome chronicles the events that precede the supernatural apocalypse of the original game, in which all of earth has been devastated by a massive heat wave.</p><p>You take the role of Kitsune Kanazawa, a Japanese student that becomes entangled in the investigation of a series of supernatural murders, which will slowly introduce key characters who will play a part in the upcoming apocalypse.</p><p>The game is played as an interactive novel, with 2D still pictures of settings and characters being the main graphic elements, and all actions being described via scrolling texts. At several intervals you will have to make a choice that branches the plot in different directions, but that's all the interaction you get to make.</p>"},{"name":"Baroque: Yuganda Mousou","year":1999,"developer":"Sting, Inc.","url":"psx-chd-roms-b/Baroque%20-%20Yuganda%20Mousou%20%28Japan%29.chd","filesize":414605707,"score":"","genres":"Special edition > Physical extras","desc":"<p>Limited Edition of <em>Baroque: Yuganda Mousou</em> contains:</p><ul><li>Baroque: Yuganda Mousou game</li><li>Keyholder figure: \"Shin Tenshimushi\"</li></ul>"},{"name":"Baseball Navigator","year":1997,"developer":"Ornith","url":"psx-chd-roms-b/Baseball%20Navigator%20%28Japan%29.chd","filesize":138519207,"score":"","genres":"Simulation > Sports > Managerial / business simulation > Baseball","desc":"<p>Where most baseball games have you controlling the players, <em>Baseball Navigator</em> is a little different in that it has you playing the part of a team manager. Set training schedules, draft and trade players, meet with the owner, and build the best team you can. During the games, you can act as the coach and give commands to your players. Coach your players well, and you'll have a winning team. You can even have your team play against a friend's team.</p>"},{"name":"Bases Loaded '96: Double Header","year":1995,"developer":"Jaleco Ltd.","url":"psx-chd-roms-b/Bases%20Loaded%20%2796%20-%20Double%20Header%20%28USA%29.chd","filesize":85481231,"score":"","genres":"Sports > Behind view > Diagonal-down > Direct control > Baseball > Licensed","desc":"<p>This baseball game features real MLBPA players from the 1994 baseball season. The teams they actually played for are only represented by the cities the actual teams are from. The game has an Exhibition mode, a Regular Season mode, and a Championship Game mode. The Regular Season mode lets the player choose to play either a 13, 26, 52, or 162 game season, while the Championship Game mode lets the player play either a 3, 5, or 7 game championship game series against an opposing team.</p><p>The game also allows baseball players to be traded to other teams, and it also allows the player to select to play in 1 of 7 different MLB ballparks, plus one extra ballpark designed by Jaleco. Gameplay options include turning automatic fielding on or off.</p><p>When on the field, batting makes use of a behind the batter view, while pitching makes use of a behind the pitcher view. Pitching is kept simple by the player being only able to control where the pitch goes, while batting only involves timing the swing to make contact with the pitched ball.</p>"},{"name":"Bass Landing","year":1999,"developer":"ASCII Corporation","url":"psx-chd-roms-b/Bass%20Landing%20%28USA%29.chd","filesize":199619279,"score":7,"genres":"Sports > Behind view > Direct control > Fishing","desc":"<p><em>Bass Landing</em> is a fishing game that has a tutorial mode, a free fishing mode, and a B.A.S (Bass Angler's Society) Pro-Tournament mode. In the tutorial mode, players go to fishing classes and learn and practice the basics of fishing starting with casting all the way down to bass ecology. At the end of all the classes the player is given an exam testing them on all they have previously learned. Free fishing mode let's the player fish at their leisure, letting them choose from 5 different lakes and setting its' conditions to their liking, and let's them attempt to catch any of the 14 species of fish that inhabit those lakes. The B.A.S Pro-Tournament mode has the player competing in 7 different tournaments by catching a set number of the most heaviest bass in a set amount of time.</p><p>Before heading out to fish the player can choose their type of rod, reel, lure, and line. When fishing the player chooses the way to cast their line, use a power meter to determine how far out the line is cast, and then hope to lure a fish on to their hook.</p><p>Options in the game let the player decide things such as the time scale, rod action, and indicator type. Their is also a record option that keeps track of all the data about the various fish that have been caught in the free fishing and tournament modes. The player can also save replays of the catches that they deem to be noteworthy.</p>"},{"name":"Bass Rise","year":1999,"developer":"BEC Co., Ltd.","url":"psx-chd-roms-b/Bass%20Rise%20%28USA%29.chd","filesize":39487819,"score":6.6,"genres":"Sports > Behind view > Direct control > Fishing > Licensed","desc":"<p>A fishing game with both a single and multiplayer VS. mode. In the single player game, players choose to play as either a man or a woman, choose the color of their clothes, and then choose an area they want to fish in. There are two lakes to choose from at the start of the game, but more can be unlocked by completing challenges. An example of a challenge would be trying to catch a set number of fish in five casts. These challenges are given to the player by fellow anglers, who also offer advice and tips to the player. Also, completing challenges may also earn the player new lures to use.</p><p>The VS. mode lets from 2 to 4 players take turns fishing against each other. Players can choose how many casts are allowed (from 1 to 5 casts), how many games the competition will last (from 1 to 5 rounds), and what event to compete in (length, most weight, or number of fish caught).</p><p>Once the player is ready to start fishing, they choose from a various amount of Megabass brand lures such as the Pop-X or V-Flat lures, to add to their tackle box. After they decide what lures they want in their tackle box, the player heads out to the lake and chooses their lure, line strength (8,12,or 16 pounds), and where they want to cast their line. Once they get a fish to bite, they have to reel it in while being careful not to snap their line by letting their line tension meter fill all the way.</p><p>The game keeps track of the players record weight and length catches of large mouth bass, small mouth bass, and blue gill.</p>"},{"name":"Batman & Robin","year":1998,"developer":"Probe Entertainment Ltd.","url":"psx-chd-roms-b/Batman%20%26%20Robin%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":313261531,"score":6.5,"genres":"Action > Racing / Driving > Behind view > Licensed","desc":"<p><em>Batman &amp; Robin</em> is based on the movie of the same name. Take control of Batman, Robin or Batgirl as you try to save Gotham City from the evil Mr Freeze and Poison Ivy. The game features a mixture of action and driving around a full 3D Gotham City.</p>"},{"name":"Batman Beyond: Return of the Joker","year":2000,"developer":"Kemco","url":"psx-chd-roms-b/Batman%20Beyond%20-%20Return%20of%20the%20Joker%20%28USA%29.chd","filesize":336004882,"score":4.2,"genres":"Action > Side view > Beat 'em up / brawler > Licensed","desc":"<p>Based on the animated movie of the same name, <em>Batman Beyond</em> is a 3D brawler that puts the player on the streets of Gotham (Beyond) to take out the ever-grinning Joker, but before that an obvious long line of evil minions of his —some of which are genetically engineered. </p><p>Scroll around, punch, kick, ply with bat-weapons, and avoid being on the receiving end of those attacks. There are multiple 'bat suits' that you can choose from, each with their own special abilities and purpose.</p>"},{"name":"Batman Forever","year":1996,"developer":"Iguana Entertainment Incorporated","url":"psx-chd-roms-b/Batman%20Forever%20-%20The%20Arcade%20Game%20%28Europe%29.chd","filesize":25800215,"score":5,"genres":"Action > Side view > Beat 'em up / brawler > Martial arts > Licensed","desc":"<p>A Final-Fight/Double-Dragon style game which features the Caped Crusader and his sidekick Robin in a traditional beat-em-up. Based on the Batman Forever movie, this side-scrolling beat-em-up features the plot, several memorable characters, and quotes from its movie counterpart.</p><p>The player gets to use batarangs, a bat grapple, and tons of other Batman-specific goodies in order to accomplish their goals. The player can create their own combos and collect power-ups to help them in their quest to rid the streets of Gotham from an everlasting flow of bad guys.</p>"},{"name":"Batman: Gotham City Racer","year":2001,"developer":"Sinister Games, Inc.","url":"psx-chd-roms-b/Batman%20-%20Gotham%20City%20Racer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":307430674,"score":"","genres":"Racing / Driving > Behind view > Licensed","desc":"<p>In this game you take on the role of Batman, Nightwing and Batgirl.  Throughout the game, you race around the streets of Gotham City in the Batmobile and other vehicles, running the assorted villains from Batman's rogues gallery off the road.</p>"},{"name":"Battle Arena NiToshinden","year":1996,"developer":"Tamsoft Corporation","url":"psx-chd-roms-b/Battle%20Arena%20Nitoushinden%20%28Japan%29.chd","filesize":440260351,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Fantasy","desc":"<p><em>Battle Arena NiToshinden</em> is a spin off of the main <em>Toshinden</em> series. </p><p>Set in a high school, NiToshinden is, like its parents, a versus fighting game. It features four fighters and a fifth hidden character from the first two Toshinden Playstation games; Eiji, Sofia, Ellis and Tracy along with four exclusive characters based off school stereotypes; Ryuji, Rika, Baifu and Shu.</p><p>As in the main series, the arenas are 3D and a sidestep manoeuvre exists for moving around them, but otherwise the gameplay is different from its parent series.</p><p>Each character has the same six attacks; hard, medium, light, low, special attack and desperation; the differences between the fighters are in the range, speed of and what the attacks do for each fighter. For instance, Eiji's special attack is to shoot a carrot from his sword, a play on his classic fireball attack, while Sofia's special attack is a variant on her classic Aurora Revolution attack.</p><p>The game features no standard combos or blocking. Instead a parry must be performed to block all non-low attacks. Low attacks are unblockable and have to be sidestepped. The characters also have the ability to dive under any non-low attack.</p><p>An unusual element of the game is its \"practice mode\", which, unlike other fighting games, is a series of short videos hosted by an enthusiastic Japanese lady and a small CGI version of Rika.</p><p>The art style heads further into the realms of anime than the other installments of the series, with cell-shaded textures and fighters with huge heads and small bodies.</p>"},{"name":"Battle Arena Toshinden","year":1995,"developer":"Tamsoft Corporation","url":"psx-chd-roms-b/Battle%20Arena%20Toshinden%20%28Europe%29.chd","filesize":283203993,"score":7.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Direct control > Fantasy","desc":"<p>In <em>Battle Arena Toshinden</em> eight world renown weapon fighters have been invited to a mysterious tournament. It is one of the first one-on-one beat-em-ups to feature the ability to sidestep a full 360 degrees around the opponent allowing one to strike from any angle. Aside from the 3D movement, <em>Toshinden's</em> game play can be considered similar to Street Fighter, but in 3d and with a little less depth to the moves.</p><p>Two versions of <em>Toshinden</em> were released; for the Sony PlayStation and later a lesser known version for DOS PC's. However the PC version is not a straight port of the PlayStation version and plays and looks notably different despite sharing the same characters, attacks and controls.</p><p>The U.S and E.U PlayStation versions of Toshinden feature redone voices in English and redone music using different instruments. </p><p>The lyrics on Sofia's stage music in the Japanese version, which were actually in English, were removed in the process, likely due to their suggestive nature. </p><p>Sofia's and Ellis' voices in the English translation are also notably adjusted, for presumably the same reason; while the other characters English voices generally match the tones of the original Japanese voice actors, Sofia is far less suggestive sounding, while Ellis sounds notably older.</p><p>The later DOS version of Toshinden however, uses the same audio as the Japanese PlayStation version in all regions, albeit recorded at a considerably lower quality than they were on PlayStation.</p>"},{"name":"Battle Arena Toshinden 2","year":1995,"developer":"Tamsoft Corporation","url":"psx-chd-roms-b/Battle%20Arena%20Toshinden%202%20%28Europe%29.chd","filesize":502329435,"score":6.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Fantasy","desc":"<p><em>Battle Arena Toshinden 2</em> is the first sequel to Battle Arena Toshinden.</p><p>It adds three new starting fighters; Tracy and Chaos with the original game's final boss, Gaia returning un-armoured and with a completely new move set. There are also three new bosses and hidden characters raising the total number of fighters to 15 (up from 10).</p><p><em>Toshinden 2</em>, on top of additional special attacks for every character, adds several running attacks to each character: the ability to strike a grounded opponent with new ground attacks and the powerful Overdrive attacks that one must fill up a bar by using other attacks to be able to use.</p><p><em>Toshinden 2</em> also does away with the free-form combo system of the original Toshinden replacing it with a simple combo system (i.e. light attack, hard attack, special or light attack, light attack, hard attack, special). The 3D movement in <em>Toshinden 2</em> has also been made notably slower to prevent the heavy abuse it could be used for in the original.</p><p>As a result, while the core game play is similar, this sequel is more tactical than the original game. Where as in the original Toshinden, one could throw normal attacks (i.e. light slashes) around with fairly reckless abandon and sidestep repeatedly without fear of their opponent being able to counter them easily, opponents in <em>Toshinden 2</em> are able to capitalize on individual missed attacks.</p><p>As a result, <em>Toshinden 2</em> is more balanced than its predecessor. This balance was further tweaked with a re-release called \"Toshinden 2 plus\" in Japan.</p><p>Unlike the Playstation release of the original Toshinden, <em>Toshinden 2</em> was not re-dubbed for releases outside of Japan.</p><p>Also unlike the original Toshinden, the PC release of <em>Toshinden 2</em> for Windows computers, is a straight port of the Playstation version and supports Direct3D rather than specific 3D cards.</p>"},{"name":"Battle Arena Toshinden 2 plus","year":1996,"developer":"Tamsoft Corporation","url":"psx-chd-roms-b/Battle%20Arena%20Toushinden%202%20Plus%20%28Japan%29.chd","filesize":501575711,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Fantasy > Martial arts","desc":"<p><em>Battle Arena Toshinden 2 plus</em> is an updated version of Battle Arena Toshinden 2 for the game's re-release on Japan's \"The Best\" range (equivalent to the \"Greatest Hits\" and \"Platinum\" ranges in the U.S and E.U).</p><p>It adds no new characters or attacks, rather it polishes and tweaks what is already there by enhancing the graphics (slightly sharper textures, particle effects replace sprite effects), tweaking character balance (with some attacks such as Fo's Mystic Sphere and Duke's Knight Strike having slightly new behaviour) and speed (the game runs notably faster than the Playstation version of the original game).</p><p>Finally, the ability to save unlocked characters, scores and control setups has also been added (this was present in the PC version of Toshinden 2, but not in the Playstation version).</p>"},{"name":"Battle Arena Toshinden 3","year":1996,"developer":"Tamsoft Corporation","url":"psx-chd-roms-b/Battle%20Arena%20Toshinden%203%20%28Europe%29.chd","filesize":406578412,"score":6.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Fantasy > Martial arts","desc":"<p><em>Battle Arena Toshinden 3</em> is the he third instalment of the Toshinden series.</p><p>After the defeat of the Secret Society in Battle Arena Toshinden 2, a new group of villains emerges. Known as the Organization, they wish to use the Toshinden fighters as blood sacrifices for a ritual to summon their dark god.</p><p>The number of fighters has been raised from the 15 characters of the previous game to a notably larger 32; 14 starting fighters, 14 Organization counterparts and 4 bosses. Though many of the Organization counterparts have near identical move lists to their equivalent starting character.</p><p>The arenas have been redesigned so that they are now enclosed allowing the ability to send the opponent flying into a wall or the ceiling, though the opponent can recover and use the wall for a counter attack.</p><p>The combo system has been redesigned again; now each character has a preset range of combo's, however multiple combo's and special moves can now be combined to juggle the opponent for multiple hits, though once again the opponent can recover and counter your combo. The game's physics have been greatly relaxed to accommodate the new arenas and game play; many attacks launch the opponent clean across the arena.</p><p>The North American and European versions of <em>Toshinden 3</em> feature a slightly different blocking setup compared to the Japanese version. In the Japanese version there are separate high and low blocks, whereas in the Western versions the high block has been altered to be an all purpose block and will block both high and low automatically. This small change has a notable impact on how the game plays .</p><p>The Western versions of <em>Toshinden 3</em> also feature new English voices for several characters and a couple of new game play modes; a comprehensive practice mode and a Survival mode.</p>"},{"name":"Battle Bugs","year":1997,"developer":"Epyx, Inc.","url":"psx-chd-roms-b/Battle%20Bugs%20%28Japan%29.chd","filesize":111094224,"score":7.7,"genres":"Strategy > Diagonal-down > Isometric > Real-time > Real-time strategy","desc":"<p>A very unique real-time strategy game. It's only semi-real-time, because it's possible to pause the action at any moment. The player commands 22 different insects in a long campaign (56 missions) against the computer-AI or a human opponent.</p>"},{"name":"Battle Hunter","year":1999,"developer":"Success Corp.","url":"psx-chd-roms-b/Battle%20Hunter%20%28USA%29.chd","filesize":29815442,"score":"","genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga > Fighting","desc":"<p>In <em>Battle Hunter</em>, play as a warrior that battles monsters and collects treasures from dungeons. To do this the player must go into a dungeon and find the target item that must be acquired. However, monsters are also lurking around plus the boss who will pop out if the game goes to long! The player may also fight other warriors to get their items (this is useful if someone else has the target item). </p><p>The game supports up to four players.</p>"},{"name":"Battle Stations","year":1997,"developer":"Realtime Associates, Inc.","url":"psx-chd-roms-b/Battle%20Stations%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":190416879,"score":6.4,"genres":"Action > Strategy > 3rd-person (Other) > Top-down > Isometric > Real-time > Arcade > Real-time strategy > Naval / watercraft","desc":"<p>This naval combat game feature a 1 and 2 player game. The 1 player game is split between either Arcade or Campaign mode. The 2 player game is split between Arcade or War Games mode.</p><p>The Campaign mode features 50 missions with objectives such as eliminating enemy supply convoys or carrying out a full scale assault on an opponent's homeland. The player then selects the admiral they want to fight in the battle. There are 5 opposing admirals and each admiral has their own set of skills on how they wage war.</p><p>The Arcade mode lets 1 or 2 players choose their ship and then have a 1 on 1 ship battle. Players earn points for sinking their opponent's ships which will allow them to climb 10 naval ranks all the way from Ensign to Fleet Admiral.</p><p>The War Games mode allows 2 players to play against each other in 26 different locations. Players can compete in these locations in three different ways. One way, is called war, with the objective to destroy every one of their opponent's ships. Another way, is to play capture the flag, which has the player trying to sink their opponent's flag ship and then return the flag back to their own harbor. The final way is called capture the harbor. This has the player attempt to drop marines, who are being carried inside a troop transport, off into their enemy's harbor, so the harbor can be attacked and captured. In this mode, players also get to choose between playing as one of several countries, or have a balanced or custom naval force. This choice affects the number of units of each type of ship the player starts the battle with.</p><p>The game features 8 types of ships which are aircraft carriers, destroyers, battleships, cruisers, patrol boats, mine layers, troop transports, and submarines. Each ship has different ratings in the categories of top speed, target range, hull strength, main guns, special weapon, and defensive weapon.</p><p>Gameplay has players moving their ships strategically on an overhead map. When two ships move close enough to each other, a battle can happen. In the battle, players try maneuvering a target reticule on their opponent ship to attack them, while also attempting to move out of the way of their opponents attacks. Once one of the ships health meters become empty from taking to much damage, they are sunk.</p>"},{"name":"Battlesport","year":1997,"developer":"The 3DO Company","url":"psx-chd-roms-b/Battle%20Stations%20%28USA%29.chd","filesize":190416991,"score":6.5,"genres":"Action > Sports > 1st-person","desc":"<p><em>Battlesport</em> simulates the sport of the future. Choose your vehicle and enter the arena to face your computer opponents to see who scores the most goals before the clock runs out.</p><p>Scoring isn't easy. The ball constantly bounces over the arena, retrieved by a player constantly bombarded by opponents. A variety of weapons are available to shoot your competitor, and anyone that takes a hit while carrying the ball loses possession, sending the ball bouncing across the arena. Taking too many shots results in a temporary inability to take part in the action while your opponent happily scores goals. </p><p>Winning matches increases standing in the rankings and the acquisition of cash to purchase a better vehicle and enhanced offensive or defensive items.</p>"},{"name":"BattleTanx: Global Assault","year":2000,"developer":"The 3DO Company","url":"psx-chd-roms-b/BattleTanx%20-%20Global%20Assault%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":388182681,"score":6.6,"genres":"Action > 1st-person > Behind view > Shooter > Tank > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>The year is 2049. A nuclear holocaust has caused 99.9% of the women in the entire world to die out, leaving mankind desperate to search for women for reproduction. Instinct has taken over, and the only rule is mob rule. There is no form of government, form of justice, and the only way to survive is lookout for yourself. Mobs and warlords have emerged trying to claim the world's last surviving women.</p><p>In the midst of the chaos, Griffin and Madison escape back to San Francisco with their new baby boy Brandon, where they hope to rebuild a better society. However, the evil QueenLord, Cassandra, captures him. Cassandra leads Griffin and Madison all across America and Europe in a frantic search for Brandon, who may have psychic abilities that can save the world.</p><p><em>Global Assault</em> is the sequel to the original BattleTanx. It features many new weapons, new vehicles, and new powers that were not available in the original. <em>Global Assault</em> now also features a destructible environment, allowing you to seize control of the environment and create ultimate destruction. <em>Global Assault</em> allows two players to play together in co-operative mode, or four players to go head-to-head as one of the dozens of tank gangs in all new maps and many more game modes.</p>"},{"name":"Bealphareth","year":2000,"developer":"Zealsoft","url":"psx-chd-roms-b/Bealphareth%20%28Japan%29.chd","filesize":382520220,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Isometric > Anime / Manga > Real-time > Action RPG > Fantasy > Medieval","desc":"<p>Bealphareth is classified as a \"new-thinking\" action RPG. It was released in 2000 and is now one of the PlayStation®Classics. The dialogue spoken and scenarios revealed will differ depending on your actions! A legendary underground city of long ago, known as \"Asla Faere\", has reappeared, and a group of young adventurers has set out to shed light on its mysteries. But soon the entire world is at stake, thus leading to a prologue in this story of destruction and creation. The world cannot be saved by sword alone.</p>"},{"name":"Beast Wars: Transformers","year":1997,"developer":"SCE Studio Cambridge","url":"psx-chd-roms-b/Beast%20Wars%20-%20Transformers%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":338393987,"score":5.3,"genres":"Action > Behind view > Shooter > Direct control > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>Based on the TV show, <em>Beast Wars: Transformers</em> puts you in control of one of several transformers, allied with either the Maximals or the Predacons. The game includes five original and one hidden transformers for each team, all from the show. You must make your way through a total of 24 missions, through desert or urban environments. Each transformer can transform into it's own unique animal, which is necessary when traveling through the game. When transformed, each transformer has an upgradable weapon to defend itself from machine enemies but must return to it's animal state to protect itself from harmful energon rays. You choose either the Maximals or Predacons to decide the fate of the galaxy.</p>"},{"name":"Beat Planet Music","year":2000,"developer":"Opus Corp.","url":"psx-chd-roms-b/Beat%20Planet%20Music%20%28Japan%29.chd","filesize":140354076,"score":"","genres":"Action > Music / rhythm","desc":"<p><em>Beat Planet Music</em> is, as the title would suggest, a rhythm action game. Each song represents a connection linking two cities; notes scroll down different lanes, and the the player must move their cursor from lane to lane and hit each note in order to play the music. As the player clears different songs, new samples are unlocked in the other mode: the song editor.</p><p>The meat of the game is the Song Editor mode, where the samples that make up the in-game music can be used to put together new tracks. Songs can be saved to the memory card, and played in the game's trial mode. You can even take samples from your own CDs and use them in your songs.</p>"},{"name":"Beatmania","year":2000,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-b/Beatmania%20%28Europe%29.chd","filesize":174528988,"score":6.6,"genres":"Action > Arcade > Music / rhythm","desc":"<p>This is the European edit of Konami's successful series Beatmania, a part of their BeMani franchise (DDR, DrumMania, Guitar Freaks and more). You get to play well known club tracks on a special controller that looks similar to the original arcade one, with 5 piano keys and a \"turntable\". Pieces of the song fall down the screen and you have to hit the right key or spin the turntable to nail the melody or drum piece falling. The better you get the higher your rating is, and you unlock more songs as you go.</p><p>In this version some of the songs featured are: \"Sing It Back\" by Moloko, \"Jacques Your Body\" by Les Rythmes Digitales, \"Dreaming\" by Ruffdriverz and many more.</p>"},{"name":"Beatmania 6thMIX + Core Remix","year":2002,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-b/Beatmania%206thMix%20%2B%20Core%20Remix%20%28Japan%29.chd","filesize":309542651,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p>The very last PlayStation release in Konami's long-running rhythm game series, <em>6th Mix + Core Remix</em> is a home port of what were the two latest arcade editions at the time, <em>6th Mix</em> and <em>Core Remix</em>. In addition to the arcade version tracks, there are also a half-dozen new remixes of tracks from the <em>Yebisu Mix</em> append disc included with the very first home edition of <em>beatmania</em>, making for a total of 62 tracks. This release can also be used to play the numerous <em>beatmania</em> \"append discs\" that Konami released.</p>"},{"name":"Beatmania Append 3rd Mix","year":1998,"developer":"","url":"psx-chd-roms-b/Beat%20Mania%20Append%203rdMix%20%28Japan%29.chd","filesize":122890605,"score":"","genres":"DLC / Add-on > Map / level","desc":"<p>This is the first of many append discs to be released in the long running Beatmania franchise for the Playstation. It features new songs, mostly taken directly from the arcade game, but also some exclusive for the Playstation release.</p><p>This game requires the first disc from Beatmania Arcade 2nd Mix in order to be played.</p>"},{"name":"Beatmania Append 3rd Mix Mini","year":1998,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-b/Beat%20Mania%203rd%20Mix%20Mini%20%28Japan%29.chd","filesize":33359933,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p>This append disc for Beatmania contains 5 songs from Beatmania Append 3rd Mix and came as a bonus disc with the purchase of the audio soundtrack CD for said game.</p><p>It was never released on its own, unlike the rest of the Beatmania Append discs. It still needs one of the key discs (like Beatmania Arcade 2nd Mix) to start up however.</p>"},{"name":"Beatmania Append 4th Mix: The Beat Goes On","year":1999,"developer":""},{"name":"Beatmania Append 5th Mix: Time to get Down","year":2000,"developer":"Konami Computer Entertainment Japan, Inc."},{"name":"Beatmania Append Club Mix","year":2000,"developer":""},{"name":"Beatmania Append Gottamix","year":1999,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-b/Beat%20Mania%20Append%20GottaMix%20%28Japan%29.chd","filesize":136875092,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p>This is one of the many append discs released for the long running Beatmania franchise. This disc contains 19 console unique songs not featured in any of the arcade games, but also 3 songs from Beatmania Append 4th Mix.</p><p>This game requires the first disc from Beatmania Arcade 2nd Mix (or any of the later \"key disc\" releases in the series) in order to be played.</p>"},{"name":"Beatmania Append Gottamix 2: Going Global","year":2000,"developer":"Konami Computer Entertainment Japan Co., Ltd.","url":"psx-chd-roms-b/Beat%20Mania%20Append%20GottaMix%202%20-%20Going%20Global%20%28Japan%29.chd","filesize":283128352,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p>This is one of the many append discs released for the long running Beatmania franchise. It includes all of the tracks from the European release of <em>beatmania</em>, as well as a dozen high-difficulty \"Bonus Edits\" originally featured in the arcade version <em>Complete Mix 2</em>. Including alternate difficulties, there are 42 tracks in total.</p><p>As this is an append disc, this game requires the the original beatmania or one of the later \"key disc\" releases in order to be played.</p>"},{"name":"Beatmania Best Hits","year":2000,"developer":"Konami Computer Entertainment Japan Co., Ltd."},{"name":"Beatmania featuring Dreams Come True","year":2000,"developer":"Konami Computer Entertainment Japan Co., Ltd."},{"name":"Beatmania: The Sound of Tokyo!","year":2001,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-b/Beat%20Mania%20-%20The%20Sound%20of%20Tokyo%20%28Japan%29.chd","filesize":128982476,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p>One of the many releases in Konami's long-running rhythm game series, <em>The Sound of Tokyo</em> features 13 songs selected by famous music producer Yasuharu Konishi of Readymade Records. This release can also be used to play the numerous <em>beatmania</em> \"append discs\" that Konami released.</p>"},{"name":"Bedlam","year":1997,"developer":"Mirage Technologies (Multimedia) Ltd.","url":"psx-chd-roms-b/Bedlam%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":208747739,"score":6.3,"genres":"Action > Diagonal-down > Isometric > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>A fast paced action game where you run around a machine-gun wielding robot destroying everything in your path.  There is a multitude of enemies and you can destroy almost every single thing on the map (buildings, vehicles, etc.).  The reason for all this destruction is a revolution led by the robots against their human masters.</p>"},{"name":"Beyblade","year":2001,"developer":"Wavedge Co., Ltd.","url":"psx-chd-roms-b/Beyblade%20%28USA%29.chd","filesize":135476522,"score":4.4,"genres":"Action > Simulation > Top-down > Anime / Manga > Licensed","desc":"<p>Based on the Japanese anime TV-show and line of toys, \"Beyblade\" lets the user battle customized spinning tops against other spinning tops.  Each top has its own \"Bit Beast,\" which can be summoned during the battle to perform a special move.</p><p>The game has both tournament and versus battle modes.  The player can also modify their top's parts and \"Bit Beast.\"</p>"},{"name":"Beyond the Beyond","year":1995,"developer":"Camelot Software Planning","url":"psx-chd-roms-b/Beyond%20the%20Beyond%20%28USA%29.chd","filesize":49078249,"score":5.8,"genres":"Role-playing (RPG) > Top-down > Isometric > Fantasy","desc":"<p>The hero of the game, an apprentice knight (named Finn by default), lives together with his father's friend in a village called Isla, located in the Kingdom of Marion. All of a sudden, the neighbor land Bandore Empire attacks the village. Finn manages to escapes and seeks shelter in the royal castle of Marion. But the castle has also fallen into the hands of the enemy. Followed by a group of loyal friends and servants, the young man sets on a long journey...</p><p>This game is a RPG with random encounters and turn-based combat with an extra feature: the player can press a random combination of buttons before attacking (or during enemy attack), and if the combination is guessed correctly, the party member will deal critical damage or will block the enemy's blow.</p>"},{"name":"Big Air","year":1998,"developer":"The Pitbull Syndicate Limited","url":"psx-chd-roms-b/Big%20Air%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%29.chd","filesize":244096801,"score":5.9,"genres":"Sports > Behind view > Snowboarding / skiing > Licensed","desc":"<p>Another snowboarding title...</p><p>Includes several snowboarding events- standard slalom-style, half pipes, races, and more.  Also features several licensed riders, 24 courses, and lots of licensed music.</p>"},{"name":"Big Bass Fishing","year":2002,"developer":"Coresoft, Inc.","url":"psx-chd-roms-b/Big%20Bass%20Fishing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":76403062,"score":5.2,"genres":"Action > Sports > Behind view > Arcade > Fishing","desc":"<p><em>Big Bass Fishing</em> is a simple action-oriented fishing simulation released at a budget price. The game modes include arcade, competition, and challenge. In the arcade mode, you have to catch five fish in five minutes, and if you succeed the time is extended. Completion mode offers specific tasks, such as catching the largest fish, the most fish, beating the clock. Challenge mode has you move across different locations with a focus on specific types of fish. There is a variety of freshwater fish to catch, and a bunch of different lures to use. You unlock a dozen locations as the game progresses.</p>"},{"name":"Big Bass World Championship","year":1997,"developer":"Starfish Inc.","url":"psx-chd-roms-b/Big%20Bass%20World%20Championship%20%28USA%29%20%28Rev%201%29.chd","filesize":212926558,"score":"","genres":"Simulation > Sports > 1st-person > 3rd-person (Other) > Fishing > Licensed","desc":"<p><em>Big Bass World Championship</em> is the standard fishing game with two different modes of play. There is a <em>Practice</em> mode where players can learn the basics of the game including casting, reeling and selection of rods and lures. In the <em>Tournament</em> mode, the player can choose from either a male or female angler and choose from one of four lakes with over 15 different fishing lures. It also features the personal endorsement of angler legend, Hank Parker.</p>"},{"name":"Big Challenge Golf: Tokyo Yomiuri County Club Hen","year":1997,"developer":"","url":"psx-chd-roms-b/Big%20Challenge%20Golf%20-%20Tokyo%20Yomiuri%20Country%20Club-hen%20%28Japan%29.chd","filesize":26017565,"score":"","genres":"Sports > 1st-person > Direct control > Menu structures > Golf > Licensed","desc":"<p><em>Big Challenge Golf</em> is a golf true to its name, adding a whole new level of gameplay which increases authenticity as much as difficulty. This golf games tries to faithfully reproduce the Tokyo Yomiuri Country Club. The gameplay is done entirely in 1st-person perspective where before swinging at the ball the player can choose the stance, position the golfer, rotate and move the club, selecting the power with which to swing, face the direction in which to strike the ball, and perform the action. Depending on the setup the ball may be hit or missed. The game uses 3D graphics and lets the player explore the golf field by literally walking around it with a player in first person perspective, rather than depending on aerial camera to check the hole. There are typical gameplay modes such as tournament and quick play to start with randomly generated golfer without pressure of competition. Aside from the actual game, player can create his own golfer, check the rules of the game and see various info on the actual Tokyo Yomiuri Country Club.</p>"},{"name":"Big League Slugger Baseball","year":2000,"developer":"Now Production Co., Ltd.","url":"psx-chd-roms-b/Big%20League%20Slugger%20Baseball%20%28USA%29.chd","filesize":1997069,"score":"","genres":"Sports > 3rd-person (Other) > Baseball","desc":"<p><em>Big League Slugger Baseball</em> is a cartoonish, big-head-anime-style baseball game. It uses the standard behind-the-catcher viewpoint for batting and pitching and switches to different views when the ball is hit.</p><p>One or two players can play a single exhibition game, or a single player can play a 10 or 30-game season, which can be saved to a memory card. After completing the season you can proceed to the Final Series.</p><p>The game is unlicensed and does not include any real teams, players, or stadiums, though you can create your own players and teams.</p>"},{"name":"Big Ol' Bass 2","year":2000,"developer":"Konami Computer Entertainment Nagoya Co., Ltd.","url":"psx-chd-roms-b/Big%20Ol%27%20Bass%202%20%28USA%29.chd","filesize":205982849,"score":"","genres":"Sports > 3rd-person (Other) > Fishing","desc":"<p><em>Big Ol' Bass 2</em> is the third part in the Fisherman's Bait series. The game is known as Fisherman's Bait 3 in Europe and Exciting Bass 3 in Japan. Again there are more than fifteen different types of fish, twenty holes and many different lures. Even more exotic fictional fish make their way in the World Monster Fishing mode. The new Surival mode allows you to partake in a knock-out system. Two player splitscreen is supported against a friend or AI.</p>"},{"name":"Big Strike Bowling","year":2003,"developer":"Coresoft, Inc.","url":"psx-chd-roms-b/Big%20Strike%20Bowling%20%28Europe%29%20%28En%2CDe%2CIt%29.chd","filesize":115101770,"score":"","genres":"Sports > 3rd-person (Other) > Bowling","desc":"<p><em>Big Strike Bowling</em> lets you hit the lanes as one of nine characters. All of these characters can be customized with unlockable clothes and accessories. You can access four lanes: Rockin' Lanes (classic), Hula Bowl (tropical), Starlight Bowl (space) and Alley Alley (back alley). You can play in four game modes: Open Bowl, Team Game, Tournament and Progressive Play.</p><p>The gameplay is very basic. You always play one-on-one against an opponent. To throw your ball, you first have to position your bowler towards the left or the right of the alley. Using the shoulder buttons you can adjust the aiming arrow. Once you have stopped both the power and accuracy meter using the X button, you hopefully haven't thrown in the gutter.</p>"},{"name":"Billiards","year":1999,"developer":"Success Corp.","url":"psx-chd-roms-b/Billiards%20%28USA%29.chd","filesize":83943585,"score":"","genres":"Sports > 1st-person > Top-down > Fixed / flip-screen > Turn-based > Pool / snooker","desc":"<p><em>Billiards</em>, as the title suggests, is a billiards game. The game features a Pocket Game mode and a Trick Shot Game mode. There is also a tutorial mode where the mechanics of the game are explained to the player.</p><p>Pocket Game mode lets the player play either a normal game of nine ball, eight ball, rotation, basic, 14.1 continuous, or bowlliards. Once a game type is selected, the player can set the number of sets to play, and whether to play against a human opponent or against one of seven computer controlled characters.</p><p>The Trick Shot Game mode lets the player attempt 18 different trick shots, including fancy bank shots and multi-pocket combinations. </p><p>When shooting billiards the player is able to select what direction to hit the cue ball, where to hit the cue ball with the cue stick, and the angle of the cue stick. The player is also able to change the angle the cue ball is viewed at and can zoom in and out on the table. When taking a shot, the power of the shot is determined by how filled a shot meter is.</p>"},{"name":"Bio F.R.E.A.K.S.","year":1998,"developer":"Saffire, Inc","url":"psx-chd-roms-b/Bio%20F.R.E.A.K.S.%20%28Europe%29.chd","filesize":185024353,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>This game is a 3D one-on-one fighter of extraordinary violence. Take control of one of many bionically-enhanced fighters, and fight in a dangerous interactive 3D environment.</p><p>Most of the characters rely on distance attacks, which centres the game on strategic fighting rather than a boxing match; interacting with the hazardous environment adds hardship to the gameplay: while avoiding an opponent's gunfire by jetting off with your jetpack, you may just slam right into a buzzsaw coming out of the wall.</p>"},{"name":"Biohazard: Director's Cut - Dual SHOCK Ver.","year":1998,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-b/Bio%20Hazard%20-%20Director%27s%20Cut%20-%20Dual%20Shock%20Ver.%20%28Japan%29.chd","filesize":309289525,"score":"","genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Survival horror > Direct control > Contemporary > North America > Horror","desc":"<p>This is a special re-release of Resident Evil: Director's Cut with added Dual Shock analog stick support. The disc also includes work in progress videos of the sequel, Resident Evil 2 (also known as <em>Resident Evil 1.5</em>), which shows a very different version of the game than was actually released.</p>"},{"name":"Bishi Bashi Special","year":1998,"developer":"Konami Computer Entertainment Sapporo Co., Ltd","url":"psx-chd-roms-b/Bishi%20Bashi%20Special%20%28Europe%29.chd","filesize":135409385,"score":"","genres":"Action > Compilation > Anime / Manga > Arcade > Board game > Music / rhythm > Puzzle elements","desc":"<p><em>Bishi Bashi Special</em> is a compilation (and conversion) of the Konami arcade titles Bishi Bashi Champ, Super Bishi Bashi Champ and Handle Champ.</p><p>Gameplay is made up of tons of mini games, all of which use a simple 3-button interface that mimics the arcade originals. The mini games encompass a wide variety of button-mashing, timing and button combination games. The games themselves can be anything from making hamburgers, throwing a pie down a church aisle to balancing a car on a floating narrow gravel road and much more.</p><p>The game can be played alone, vs a computer player or play up to eight people using a multi-tap and three controllers.</p>"},{"name":"Bishi Bashi Special 2","year":1999,"developer":"Konami Computer Entertainment Sapporo Co., Ltd","url":"psx-chd-roms-b/Bishi%20Bashi%20Special%202%20%28Japan%29.chd","filesize":118148239,"score":"","genres":"Action > Compilation > Anime / Manga > Arcade > Board game > Music / rhythm > Puzzle elements","desc":"<p><em>Bishi Bashi Special 2</em> brings more of the mini-games that are a staple of the series. This is a collection of the arcade games <em>Hyper Bishi Bashi Champ</em> and <em>Gachaga Champ</em> bundled into one game, which only saw a Japanese release.</p><p>The mini-games themselves are very straightforward and usually involve using only the Triangle, X, and O buttons. This is a direct holdover from the original layout of the arcade machines, which only featured a three button layout. In the console release there is sometimes the option to use the analog stick or the D-pad as well to increase the button-mashing even further. Examples of these types of games (timing vs. mashing): in one game the player has to fend off mobsters by pressing the button placed in the direction they're coming from and in another the player simply has to mash buttons as fast as possible to run towards a soccer goal while trying to time jumping over the opposing team's players.</p><p>The games can either be played alone, against a computer player, or with a friend.</p>"},{"name":"Bishi Bashi Special 3: Step Champ","year":2000,"developer":"Konami Computer Entertainment Sapporo Co., Ltd","url":"psx-chd-roms-b/Bishi%20Bashi%20Special%203%20-%20Step%20Champ%20%28Japan%29.chd","filesize":72329353,"score":"","genres":"Action > Anime / Manga > Arcade > Board game > Music / rhythm > Puzzle elements","desc":"<p><em>Bishi Bashi 3: Step Champ</em> is a conversion of the arcade with the same name. This time around dancing and feet coordination is key to success as this outing is specially made to be played with Konami's Dance Dance Revolution dance mat.</p><p>As usual with the <em>Bishi Bashi</em> games, it's full to the brim with random and rather off-beat mini-games that often times pokes fun at Konami's own franchises (such as Track &amp; Field and Beatmania). Most of the mini-games are either of the button mashing variety (such as the mini-game in which the player has to throw a tantrum faster than his siblings to get a toy by stomping his feet on the ground repeatedly), but there are also games where the player has to time which button to press (one such game is very similar to Dance Dance Revolution).</p><p>Up to three players can face off against one another to determine who is the ultimate Step Champ.</p>"},{"name":"Black / Matrix OO (Disc 1)","year":2004,"developer":"Flight-Plan Inc.","url":"psx-chd-roms-b/Black%20Matrix%2000%20%28Japan%29%20%28Disc%201%29.chd","filesize":393911466,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Black/Matrix OO</em> (\"Double O\") is a remake of Black/Matrix Zero featuring a heavily reworked and expanded story, numerous additional endings, New Game+ options, and several new mini-games. Basic gameplay and graphics are unchanged from the original Game Boy Advance release.</p>"},{"name":"Black / Matrix OO (Disc 2)","year":2004,"developer":"Flight-Plan Inc.","url":"psx-chd-roms-b/Black%20Matrix%2000%20%28Japan%29%20%28Disc%202%29.chd","filesize":348713937,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Black/Matrix OO</em> (\"Double O\") is a remake of Black/Matrix Zero featuring a heavily reworked and expanded story, numerous additional endings, New Game+ options, and several new mini-games. Basic gameplay and graphics are unchanged from the original Game Boy Advance release.</p>"},{"name":"Black / Matrix OO (Shokai Genteiban)","year":2004,"developer":""},{"name":"Black Bass with Blue Marlin","year":1999,"developer":"","url":"psx-chd-roms-b/Black%20Bass%20with%20Blue%20Marlin%20%28USA%29.chd","filesize":145512433,"score":"","genres":"Sports > Fishing","desc":"<p>REAL-TIME 3-D FISHING!<br>Black Bass and Blue Marlin together for the first time!<br>HOT-B delivers dynamic freshwater and saltwater tournament angling action in one game.<br>FEATURING FISHING LEGEND HANK PARKER<br>Two-player, split-screen, head-to-head mode<br>Four enormous, real-life tournament lakes feature 12 marinas, and each bass-packed lake contains thousands of fishes<br>Twelve exotic marlin fishing tournament locales<br>Realistic lures, reeling action, environmental factors and fishing spots.<p>"},{"name":"Black Dawn","year":1996,"developer":"Black Ops Entertainment, LLC","url":"psx-chd-roms-b/Black%20Dawn%20%28Europe%29.chd","filesize":370231862,"score":7.6,"genres":"Action > 1st-person > Behind view > Helicopter","desc":"<p><em>Black Dawn</em> fulfills a few childhood dreams by putting gamers in control of a military helicopter. Terrorists have grown powerful in the world and it is up to you to restore stability and peace throughout the lands. Assigned to a variety of campaigns, you must fly the AH-69 Mohawk (sounds like something Jan-Michael Vincent from AIRWOLF would pilot) as you battle through enemy territory across different global locales.</p>"},{"name":"Black Matrix + (Disc 1)","year":2000,"developer":"Flight-Plan Inc.","url":"psx-chd-roms-b/Black%20Matrix%20%2B%20%28Japan%29%20%28Disc%201%29.chd","filesize":301474123,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Black/Matrix +</em> (\"Cross\") is a modified port of the Saturn title Black/Matrix that includes some of the additional features of the Dreamcast version. The game is based on the expanded story from the Dreamcast version, but uses graphics similar to the original Saturn release. The animated cutscenes from the Dreamcast release have been replaced with in-engine sequences, and several story sequences have been cut.</p>"},{"name":"Black Matrix + (Disc 2)","year":2000,"developer":"Flight-Plan Inc.","url":"psx-chd-roms-b/Black%20Matrix%20%2B%20%28Japan%29%20%28Disc%202%29.chd","filesize":381709072,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Black/Matrix +</em> (\"Cross\") is a modified port of the Saturn title Black/Matrix that includes some of the additional features of the Dreamcast version. The game is based on the expanded story from the Dreamcast version, but uses graphics similar to the original Saturn release. The animated cutscenes from the Dreamcast release have been replaced with in-engine sequences, and several story sequences have been cut.</p>"},{"name":"Blade","year":2000,"developer":"HammerHead Ltd.","url":"psx-chd-roms-b/Blade%20%28Europe%29.chd","filesize":299858155,"score":5.8,"genres":"Action > Behind view > Shooter > Horror > Licensed","desc":"<p>Buffy, move out of the way. Activision brings the original vampire hunter with an attitude to the PlayStation. Based on the action-packed motion picture and Marvel comics, Blade is a 3D action/adventure game where you must save humanity from the threat of vampires. As Blade, you have an arsenal of projectile weapons and martial arts moves to battle your way through hordes of vicious, nightly creatures. </p>"},{"name":"Blade Arts: Tasogare no Miyako R'lyeh","year":2000,"developer":"Ea Inc.","url":"psx-chd-roms-b/Blade%20Arts%20-%20Tasogare%20no%20Miyako%20R%27lyeh%20%28Japan%29.chd","filesize":346518782,"score":"","genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Direct control > South America","desc":"<p><em>Blade Arts: Tasogare no Miyako R'lyeh</em> is an action-adventure game similar to <em>Tomb Raider</em> with platforming and puzzle-solving accompanying combat and featuring character designs by Nobuteru Yūki.</p><p>Players take control of an archeologist and treasure hunter Rei Shidoh, who is a part of a team dispatched to ruins on a mysterious island to investigate them and locate survivors of a strong earthquake there. As players complete the first level of the game, Rei will discover a mysterious tall and wide blade that can change its shape and will grow more powerful, gaining unique attacks and spells if special spheres are embedded into it and enough Nervus (experience points) are used to develop it. After picking up the sword, the game will let players test their new weapon on a boss battle.</p><p>In combat, players can lock on to specific enemies for melee and ranged attacks, similar to <em>The Legend of Zelda: Ocarina of Time</em>.</p>"},{"name":"Blast Chamber","year":1996,"developer":"Attention to Detail Limited","url":"psx-chd-roms-b/Blast%20Chamber%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":299098274,"score":7.2,"genres":"Action > 3rd-person (Other) > Puzzle elements > Sci-fi / futuristic","desc":"<p>A quite weird puzzle/actiongame in 3d, where you are a little guy in a chamber which is rotatable by pushing around the corners. Objects will fall down then and some other parts of the level get accesible.</p><p>The game also supports a 2 player competitive mode, where you have to pick up objects and put them in another one's crystal. Try to avoid the other to get to his crystal by moving around the chamber.</p>"},{"name":"Blast Lacrosse","year":2001,"developer":"Sandbox Studios, Inc.","url":"psx-chd-roms-b/Blast%20Lacrosse%20%28USA%29.chd","filesize":140329442,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Licensed","desc":"<p><em>Blast Lacrosse</em> is an indoor lacrosse game. It is officially licensed by and based on the National Lacrosse League and includes all nine teams of their 14th season, including mascots. It is also licensed by the Professional Lacrosse Players' Association. The game features in-game advertisements for Shamrock Lacrosse. The cover features an Ottawa Rebel player wearing #88.</p><p>The style of play is very similar to the arcade style of NBA JAM and NFL Blitz where, if a player scores a hat trick they become \"on fire\" and play better until stopped. The game is voiced by play-by-play man, and sports radio host, Scott Ferrall. Some of the game modes are Last Man Standing, Sudden Death and Survivor.</p>"},{"name":"Blast Radius","year":1998,"developer":"Psygnosis Camden Studio","url":"psx-chd-roms-b/Blast%20Radius%20%28Europe%29.chd","filesize":422031334,"score":6.9,"genres":"Action > Simulation > Behind view > Shooter > Direct control > Space flight > Sci-fi / futuristic","desc":"<p>Kayne, the sole survivor of the Wolf Squadron, is tasked with saving the Vorn which is being attacked from the nefarious Kotan-Kal. For offering to help the Vorn out,  Kayne is given his choice of the Vorn's most advanced spacecraft and weapons.</p><p>In this space combat game, Kayne has the choice of 1 of 9 different spacecrafts which differ in appearance, weaponry, and control. Kayne is tasked with completing 40 different missions while fighting 37 different types of enemy crafts, which include bounty hunters, crime spaceships and military ships. </p><p>The game also offers a 2 player death match mode.</p>"},{"name":"Blaster Master: Blasting Again","year":2000,"developer":"Art System","url":"psx-chd-roms-b/Blaster%20Master%20-%20Blasting%20Again%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":349453146,"score":6.5,"genres":"Action > Behind view > Anime / Manga > Shooter > Tank > Sci-fi / futuristic","desc":"<p>Years ago, the Earth was threatened by an evil being known as the Plutonium Boss. The Plutonium Boss and his minions were devouring the Earth from within, and if they had succeeded, Earth would've been destroyed.</p><p>He didn't count on a young man named Jason, a beautiful alien woman named Eve, and their battle tank, the Sofia MA-01...because of his underestimation, the Plutonium Boss was defeated.</p><p>Since then, Jason had been defending the Earth from any threat that arises, with Eve by his side. She even bore him two children, Roddy and Elfie. Jason trained Elfie in engineering, and Roddy in battling in Sofia. But now Jason and Eve have died, and Roddy must take his father's place as defender of the Earth.</p><p>And an old threat seems to be arising to challenge this new generation of heroes...</p>"},{"name":"Blasto","year":1998,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-b/Blasto%20%28USA%29.chd","filesize":198565708,"score":6.6,"genres":"Action > Behind view > Platform > Puzzle elements > Shooter > Sci-fi / futuristic","desc":"<p>The evil alien ruler Bosc has conquered the planet Uranus with the ultimate goal of destroying the Earth. His army is kidnapping and enslaving the Space Babes to ensure future world dominance. Captain Blasto, the not particularly bright but very muscular superhero, must travel to Uranus and free the Space Babes, while defeating Bosc's minions.</p><p><em>Blasto</em> is a third-person shooter with platforming elements. The protagonist can use various firearms to dispose of the alien enemies. Many fights are scripted, as aliens teleport around the hero when certain events are triggered. Different weapons must be used in different situations to gain the upper hand.</p>"},{"name":"Blaze & Blade Busters","year":1998,"developer":"T&E Soft, Inc.","url":"psx-chd-roms-b/Blaze%20%26%20Blade%20Busters%20%28Japan%29.chd","filesize":243897438,"score":"","genres":"DLC / Add-on > Role-playing (RPG) > Top-down > 2D scrolling > Anime / Manga > Real-time > Action RPG > Fantasy > Game mode > Map / level","desc":"<p><em>Blaze &amp; Blade Busters</em> is an expansion disc for Blaze &amp; Blade: Eternal Quest. Players can import their saves from the first game in order to continue with several new gameplay scenarios. It also features enhancements to a few of the original game's core mechanics, including streamlined item exchange and leader swapping. It also features one new mode: a multiplayer battle royale for up to four players.</p>"},{"name":"Blaze & Blade: Eternal Quest","year":1998,"developer":"T&E Soft, Inc.","url":"psx-chd-roms-b/Blaze%20%26%20Blade%20-%20Eternal%20Quest%20%28Europe%29.chd","filesize":375545170,"score":5.4,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Action RPG > Fantasy","desc":"<p><em>Blaze &amp; Blade: Eternal Quest</em> is an action RPG where you control a party of four. Character creation allows you to define a player's behaviour as well as their abilities. Your goal is to venture into The Forbidden Land, formerly known as Foresia, and deliver the land from evil. Foresia has been inhabited by monsters and demons since the time of the twelve Wisemen. These monsters and demons often transform into useful items once destroyed.</p>"},{"name":"Blazing Dragons","year":1996,"developer":"The Illusions Gaming Company","url":"psx-chd-roms-b/Blazing%20Dragons%20%28Europe%29.chd","filesize":137167120,"score":7.5,"genres":"Adventure > 3rd-person (Other) > 2D scrolling > Real-time > Arcade > Puzzle elements > Point and select > Fantasy > Licensed","desc":"<p><em>Blazing Dragons</em> is an adventure game based on the Nelvana cartoon of the same name. In this twist on the King Arthur legend, the player controls a young dragon named Flicker who lives in the kingdom of Camelhot. Flicker is an inventor who wants to become a knight and win a tournament. The prize is the hand in marriage of Princess Flame, Flicker's lifelong love interest. The player must solve puzzles to defeat the evil mechanical Black Dragon, the human race's entry into the tournament. The gameplay is mostly straight inventory-based point-and-click, but there are several arcade sequences that the player must successfully complete in order to progress.</p>"},{"name":"Block Buster","year":2000,"developer":"Tamsoft Corporation","url":"psx-chd-roms-b/Block%20Buster%20%28Europe%29.chd","filesize":62011177,"score":"","genres":"Action > Top-down > Fixed / flip-screen > Arcade > Paddle / Pong","desc":"<p>The ultimate evolution is here...<br>In addition to \"Squash\", \"Tray-swaying\", \"Item\" and \"Multi-mode\" in previous title, strategic aspect such as performance and stage strategies are also enhanced. <br>Heated multi-play battle and COM battle are available, and also a VS Mode in which victory or defeat is determined within a short period of time.<br>New tactics and strategies are necessary</p>"},{"name":"Block Kuzushi","year":2003,"developer":"Now Production Co., Ltd.","url":"psx-chd-roms-b/Block%20Kuzushi%20%28Japan%29.chd","filesize":144050186,"score":"","genres":"Action > Puzzle > Top-down > Arcade > Paddle / Pong","desc":"<p>BLOCK KUZUSHI, a long-time staple of the video game world, is here!<br>The rules are simple: Help the fairies trapped within the field area hit the ball. But watch out for the bosses that appear at the end of each stage! Keep hitting the ball in the right direction while dodging fierce attacks!<br> If you collect enough stars, you can use power shots for even more powerful balls simply by pressing a button the moment the ball hits your paddle. The game also features a wide assortment of items. And if you get the Warp item, you can teleport to the bonus Space stage where you can enjoy the thrill of endless shots!</p>"},{"name":"Block Kuzushi 2","year":2000,"developer":"Tamsoft Corporation","url":"psx-chd-roms-b/Block%20Kuzushi%202%20%28Japan%29.chd","filesize":85800779,"score":"","genres":"Action > Arcade > Paddle / Pong","desc":"<p><em>Block Kuzushi 2</em> is one of the seemingly infinite number of Breakout clones. As always, the player controls a paddle at the bottom and has to bounce balls to break and clear the screen of bricks. More unusual is the inclusion of a head-to-head multiplayer mode, where the playing field is split in the middle and each player has to clear their respective bricks to win the match.</p><p>Note, that this game should not be confused with Simple 1500 Series Vol. 45: The Block Kuzushi 2. While a similar titled Breakout-styled game, the block layouts in each level are completely different.</p>"},{"name":"Block Wars","year":2001,"developer":"Opera House Inc.","url":"psx-chd-roms-b/Block%20Wars%20%28Japan%29.chd","filesize":166519635,"score":"","genres":"Action > Strategy > Anime / Manga > Arcade > Paddle / Pong > Fantasy","desc":"<p>One of the countless games based on the classic Breakout formula, <em>Block Wars</em> turns the game on its side -- literally. Two players play opposing games facing toward the center of the screen, attempting to clear their blocks and push the board towards their opponent's paddle. The winner is whoever clears all their blocks first or pushes the opponent's blocks all the way toward their paddle. There are three game modes, including 2-player Versus Mode. The game features character designs by famed illustrator Go Nagai.</p>"},{"name":"Blockids","year":1996,"developer":"Athena Co., Ltd.","url":"psx-chd-roms-b/Blockids%20%28Europe%29.chd","filesize":448107859,"score":"","genres":"Action > Top-down > Isometric > Anime / Manga > Arcade > Paddle / Pong","desc":"<p><em>Blockids</em> is a Breakout variant whose unique feature is multiple camera angles. Instead of only including the typical top down camera angle, the game also utilizes a isometric camera angle, a behind the paddle camera angle, and a track the ball's movement camera angle.</p><p>The game contains an Adventure mode and a Challenge mode. In the Adventure mode players choose from one of six characters and go on a mission to reclaim 5 magic crystals. The accomplish this task, players must beat a series of stages and boss monsters at every 10th stage. Beating stages requires bouncing a ball off a paddle to break blocks, which get arranged in different formations depending on the stage. The player can also make the ball jump over the bricks and try to break them from the top down. Each character in the game has their own special power meter which is filled up by hitting several blocks in succession. Some examples of character's powers include Super-Extend which elongates the paddle, Ball Catcher which makes the ball stick onto the paddle, or Power Ball which makes ball that go through blocks instead of simply bouncing off them. Some broken blocks also unleash power-ups. Power-ups include either speeding up or slowing down the ball, a 1up which gives the player and extra life, and a power-up which instantly clears the stage. This game lets the player only have 2 lives and 3 continues before the game is over. The Challenge mode is similar to the Adventure mode except the player is now given infinite amount of continues throughout its 100 stages.</p>"},{"name":"Blood Lines","year":1999,"developer":"Radical Entertainment Inc.","url":"psx-chd-roms-b/Blood%20Lines%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":251176067,"score":6.1,"genres":"Action > Diagonal-down > 2D scrolling > Fighting > Platform > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Set in the future, competitive sport is outlawed and becomes the pursuit of an underground network of the world's greatest athletes. Inspired by the nations of old, they form clans and engage each other in tribal combat to protect the honour of their blood-lines. There can be only one winner.</p><p>Control one of the clans, and fight to the death in a last-man-standing battle against multiple opponents. The environments allow for roaming and hiding, allowing players to tactically attack and run away to evade attack. Weapons can be found, used and recharged across the arena.</p><p>The gameplay functions in the same way as Super Smash Bros.: Melee, and allows multiplayer matches or fighting against CPU opponents.</p>"},{"name":"Blood Omen: Legacy of Kain","year":1996,"developer":"Silicon Knights, Inc.","url":"psx-chd-roms-b/Blood%20Omen%20-%20Legacy%20of%20Kain%20%28Europe%29.chd","filesize":472744703,"score":7.7,"genres":"Action > Diagonal-down > Puzzle elements > Fantasy > Horror","desc":"<p>The nobleman Kain has been slain by a group of bandits and in his death, he is revived by the necromancer Mortanius for his own ends. Kain is returned in the form of a vampire and yearns to exact vengeance on those who killed him. Stronger and faster than a human being, coupled with a thirst for blood that must be satisfied regularly, he is able to dispatch his killers quickly. However, Mortanius and other forces seek to use him as a tool in a greater plot. Mortanius is of the Circle of Nine, the guardians of the Pillars of Nosgoth. These pillars, connected to the world and balancing the forces, have become corrupted and the Circle members been driven mad. At the Pillars, Kain meets Ariel - a former guardian of the Pillar of Balance, now a spirit after being murdered by an unseen assailant. She informs Kain of his relation to the Pillars and that the only way for him to restore the balance is to seek out each guardian and kill them. The fate of Nosgoth may hang on Kain decisions.</p><p><em>Blood Omen: Legacy of Kain</em> is an action game where the player controls the vampiric Kain. As a vampire, Kain is able to withstand sunlight, but is harmed by water. However, he is able to obtain several cursed abilities and spells such as being able to transform into a bat, wolf, and even a cloud mist respectively, as well as learning the ability to disguise himself from creatures of weaker mind. Kain is also fixated on murder and is a master of several ways to kill and destroy his opponents. As the enemies are slain in front of him, Kain may drink their blood to restore his health, which is always trickling away, representative of his insatiable craving. To aid in the slaughter of his enemies, Kain may equip different weapons and armor, each with its own unique properties.</p>"},{"name":"Bloody Roar","year":1997,"developer":"Raizing Co., Ltd.","url":"psx-chd-roms-b/Bloody%20Roar%20-%20Hyper%20Beast%20Duel%20%28Europe%29.chd","filesize":351483657,"score":7.2,"genres":"Action > Side view > Fighting","desc":"<p><em>Bloody Roar</em> is a fighting game with a twist. At the press of a button, the player character changes into a beast of unique strength and ability over the character's normal attacks. Each character has their own beast to transform into, and most battles come down to how the player uses this transformation to their advantage. </p><p>The game features over-the-top special moves and combos in a 3D-like atmosphere.</p>"},{"name":"Bloody Roar II","year":1999,"developer":"Raizing Co., Ltd.","url":"psx-chd-roms-b/Bloody%20Roar%202%20-%20Bringer%20of%20the%20New%20Age%20%28Europe%29.chd","filesize":323673289,"score":7.7,"genres":"Action > 3rd-person (Other) > Fighting > Shooter","desc":"<p><em>Bloody Roar II</em> is a 3D fighting game of the Tekken, or more accurately, Fighting Vipers school of gameplay. The hook of the Bloody Roar series is that your combatants can transform into animalistic versions of themselves -- human-animal hybrids with a thirst for violence. During each round you can fight as a person or transform into a beast when your meter fills up. As an animal you'll have more moves at your disposal with which to destroy your opponent.</p>"},{"name":"Blue Breaker Burst: Egao no Asu ni","year":1998,"developer":"HuneX Co., Ltd.","url":"psx-chd-roms-b/Blue%20Breaker%20Burst%20-%20Egao%20no%20Asu%20ni%20%28Japan%29%20%28Major%20Wave%29.chd","filesize":431143035,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting","desc":"<p><em>Egao no Asu ni</em> is the third and final title in the Blue Breaker series, and is a direct sequel to Hohoemi o Anata to. The game is once again a full-3D fighting game, and the story picks up directly after the previous title, with Chimena still searching for the holy sword. There are also once again several new side stories featuring other characters.</p><p>There are several new playable characters in this release, as well as a brand new Team Battle mode, which allows each player to select three characters to use in order. There is also an optional prologue that recaps the story of the previous title.</p>"},{"name":"Blue Breaker Burst: Hohoemi o Anata to","year":1998,"developer":"HuneX Co., Ltd.","url":"psx-chd-roms-b/Blue%20Breaker%20Burst%20-%20Hohoemi%20o%20Anata%20to%20%28Japan%29.chd","filesize":312516034,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting","desc":"<p>The Dark Lord has been sealed away, but peace has not yet come to this world. A young woman named Chimena is traveling the world, seeking an ancient holy sword...</p><p><em>Blue Breaker Burst</em> is a follow-up to Blue Breaker. However, instead of an RPG, this sequel is a full 3D 1-on-1 fighting game. The main story focuses on a new character named Chimena, though much of the first title's cast also return. The player moves Chimena around the world map to different locations, where visual novel-style events may occur with other characters, furthering the story and often leading to a fight. Apart from the main \"Chimena's Story\", additional stories focusing on other characters are unlocked as the game progresses.</p><p>There are also a number of other modes. Original Mode is an arcade-style mode that forgoes the story in favor of a string of opponents that must be defeated. Versus mode allows a free battle against the computer or another player, while Training mode lets the player practice moves and combos, and view a moves list for each character.</p>"},{"name":"Blue Breaker: Ken yori mo Hohoemi o","year":1997,"developer":"HuneX Co., Ltd."},{"name":"Blue Forest Story: Kaze no Fūin","year":1996,"developer":"Right Stuff Corp."},{"name":"Blue's Clues: Blue's Big Musical","year":2001,"developer":"TerraGlyph Interactive Studios, L.P.","url":"psx-chd-roms-b/Blue%27s%20Clues%20-%20Blue%27s%20Big%20Musical%20%28USA%29.chd","filesize":522886727,"score":"","genres":"Action > Adventure > Educational > 3rd-person (Other) > Puzzle elements > Pre-school / toddler > Licensed","desc":"<p>This game is heavily inspired by the movie of the same name.A big music show is being held by Blue and her friends. However, there's a lot to do to get prepared like setting up the stage, getting instruments to play, practice songs, get props for the stage, and inviting guests to the show.</p><p>Players take control of Blue and guide her to different areas around her house and neighborhood while trying to finish the preparations for the show. The main game is broken up into six different acts. Each act has the player searching for 3 different Blue's Clues. Finding all 3 Blue's Clues will then make the player solve a multiple choice question on the meaning of the clues. Some of the locations the player explores will have interactive items in the background which will usually cause a short animation to happen when interacted with. The player can also find and hold an item in their inventory which can be used when interacting with other characters. Also some locations have Skidoo minigames.</p><p>Some of the Skidoo minigames include sprinkler skipping, cupcake color matching, the birdsong sing-along, a red light/green light type game, and a rhythm-based drum game. </p><p>There is also a Parent Info mode that lets an adult select for their child any clue searching act to play or let's them play any song contained in the game. These songs are from Blue's Big Musical Movie.</p>"},{"name":"Bob the Builder: Can We Fix It?","year":2001,"developer":"Steel Monkeys","url":"psx-chd-roms-b/Bob%20the%20Builder%20-%20Can%20We%20Fix%20It%20%28Europe%29.chd","filesize":69287871,"score":"","genres":"Action > Educational > Racing / Driving > 3rd-person (Other) > Puzzle elements > Pre-school / toddler > Licensed","desc":"<p>A game inspired by the children's television program. Players help Bob the Builder and friends complete various activities. Players can select from 3 difficulty levels for each activity.</p><p>Can We Build It? activities include:</p><ul><li>Knock it down involves helping Lofty knock down an old bridge. Players swing a wrecking ball at a dilapidated bridge.</li><li>Build it up involves helping Lofty build a bridge one section at a time. Players control Lofty's hook and use it to pick up sections of a bridge off the ground and place them together so they form a bridge.</li><li>Where's Pilchard? has the player helping Wendy find where Pilchard is hiding. Players have to place a food bowl on top of the hiding Pilchard.</li></ul><p>Travis' Race Day activities include:</p><ul><li>The two activities Race with Scoop and Race with Dizzy involves the player playing as either Scoop or Dizzy and has them racing Travis in an overhead racing game to prove who is the fastest.</li></ul><p>Bubble Trouble activities include:</p><ul><li>Bubble Trouble involves helping Roley pop all the bubbles. Players control Roley and have to make him roll over bubbles in a limited amount of time.</li><li>Where's Pilchard? plays the same here, except it now takes place in a different location.</li></ul><p>Porcupine Rescue activities include:</p><ul><li>Tunnel Time involves helping porcupines cross a road by having Lofty build a tunnel under the road. Players use Lofty's hook to pick up sections of a tunnel and place them in the correct spot of an outline.</li><li>Where's Pilchard? also plays the same here, except it now takes place in another different location.</li></ul><p>Scary Spud activities include:</p><ul><li>Scary Spud involves helping Spud scare away hungry crows from eating all of the seeds. Players control Spud and make him scare the crows off the field in a limited amount of time by making him run at them.</li><li>Where's Pilchard? also plays the same here, except it now takes place in another different location.</li></ul><p>Plumbing Puzzle activities include:</p><ul><li>Radiator riddle involves fixing the central heating. Players control Bob and make him place pieces of the central heating to the correct outlined spots in a house.</li><li>Fix the leaks involves helping Bob fix leaks in a pipe. Players control Bob while he walks through a house searching for and fixing all the leaking pipes with his wrench in a limited amount of time.</li></ul><p>Wendy's Birthday activities include:</p><ul><li>Cake-tastic! involves helping Bob decorate a birthday cake for Wendy. Players decorate a cake for Wendy by choosing the type of chocolate chips, color of the candles and the icing, and the decorations.</li><li>Wild West Wendy involves Bob and Wendy square dancing. Players get to choose which dance moves to perform.</li></ul><p>Some activities contain cutscenes before they begin and after being completed.</p>"},{"name":"Bogey: Dead 6","year":1996,"developer":"Pegasus Japan Corp.","url":"psx-chd-roms-b/Bogey%20-%20Dead%206%20%28USA%29.chd","filesize":229754743,"score":6.7,"genres":"Action > Simulation > 1st-person > Shooter > Direct control > Flight / aviation","desc":"<p>The player takes the role of an air pilot who is part of an elite first strike air unit. This unit is tasked with putting a stop to an international crime organization that is building up a military sized force.</p><p>In this air combat game, players can choose to play in a training mode, play a mission mode, or have a VS. battle.</p><p>Training mode features 3 different missions with players attempting to get as high of a score as possible. VS. battle has 2 players linking up to play a head-to-head battle against each other.</p><p>The main mode is the mission mode. Players can choose from 6 different fighter jets which are the F-4E Phantom II, F-14D Tomcat, F/A-18 Hornet, F-15E Eagle, F-16C Falcon and the F-22 Raptor (AKA Superstar), each with their own ratings in max speed, endurance, maneuverability, and stability.  The game features 12 missions to play through, with objectives such as defending a weapons factory or shooting down a stolen F-16. Each mission completed successfully will reward the player a certain number of credits depending on the difficulty of that mission.</p><p>Gameplay involves flying a fighter with a cockpit view. The HUD includes a radar showing the enemy fighters locations plus the number of enemies left. Their is also a rear view mirror which lets the player see if their are any enemy fighters on their tail. Players can fire their air-to-air, air-to-surface, and air-to-ground missiles at enemy units.</p><p>Options let the player adjust the difficulty level and change the controls between easy or hard.</p>"},{"name":"Boku no Natsuyasumi","year":2000,"developer":"Millennium Kitchen Co., Ltd.","url":"psx-chd-roms-b/Boku%20no%20Natsuyasumi%20-%20Summer%20Holiday%2020th%20Century%20%28Japan%29.chd","filesize":423706540,"score":"","genres":"Simulation > 3rd-person (Other) > Cinematic camera > Fixed / flip-screen > Real-time > Life / social simulation > Sandbox / open world > Direct control > Contemporary > Japan (Modern/Futuristic)","desc":"<p>The year is 1975, and a nine-year-old city boy named Boku has been sent to his aunt and uncle's house in the countryside for a vacation. He is there for the entire month of August, and it is up to the player what he does each day. Possible activities include fishing, catching bugs, flying a kite, meeting new people, and more. Trying out different activities will open up new events as the days go by.</p><p>The later released PSP version has updated graphics and features several new characters.</p>"},{"name":"Bokujo Monogatari: Harvest Moon for Girl","year":2000,"developer":"Victor Interactive Software, Inc.","url":"psx-chd-roms-b/Bokujou%20Monogatari%20-%20Harvest%20Moon%20for%20Girl%20%28Japan%29.chd","filesize":92399323,"score":"","genres":"Role-playing (RPG) > Simulation > 3rd-person (Other) > Isometric > Anime / Manga > Managerial / business simulation","desc":"<p>As a young girl, you took a cruise aboard a luxury ship. However, your life was in peril when the ship crashed onto the coastline. Fortunately, a young boy saved your life. Now you want to find him and show him how much you care. </p><p>There are five boys in the town. It could be any one of them. You're welcome to stay in the town, under one condition. You have to make a name for yourself by tending to the run-down farm in town and making it the best there is. </p><p>Can you step up to the challenge? It'll all be worth it when you find the guy of your dreams...</p><p>Harvest Moon for Girls is based on Harvest Moon: Back to Nature. It was released only in Japan.</p>"},{"name":"Bomberman Fantasy Race","year":1998,"developer":"Hudson Soft Company, Ltd.","url":"psx-chd-roms-b/Bomberman%20Fantasy%20Race%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":144909902,"score":5.9,"genres":"Action > Racing / Driving > 1st-person > Behind view > Direct control","desc":"<p>The man with the big bombs is blowing up a completely different type of game in this strange and whimsical racing game. It sure isn't like your typical racer -- Bomberman Fantasy Race has players riding on big loping kangaroos and giant blue rabbitty-dinos as they hop and dash to the finish line with long, bounding gaits. It's a wild race, made even wilder with all the bombs and action of Bomberman. Two can challenge each other to a blast around the track, or run for it on your own in the single-player mode. Buy new bombs and better ride-a-long animals to give the competition something to blow its top over!</p>"},{"name":"Bomberman Land","year":2000,"developer":"Hudson Soft Company, Ltd.","url":"psx-chd-roms-b/Bomberman%20Land%20%28Japan%29%20%28Rev%202%29.chd","filesize":177194035,"score":"","genres":"Action > Puzzle > Top-down > Anime / Manga > Arcade > Mini-games > Direct control > Sci-fi / futuristic","desc":"<p><em>Bomberman Land</em> is a theme park filled with people and different attractions. As in top-down RPG games, the player controls a character who can interact with the NPCs and objects on the map. Various spots give access to the attractions, in the form of mini-games. In some games, the player must pick-up sheep and lock them out of the field, complete jigsaw puzzles, look at equations and answer if they are true or false, etc. Completing various tasks will reward the player with numbered coupons that give access to new areas of the theme park.</p><p>In addition to the solo play, some games can be played in up to four players battles, or in a tandem cooperative mode.</p>"},{"name":"Bomberman Wars","year":1998,"developer":"Metro Corporation"},{"name":"Bomberman World","year":1998,"developer":"Hudson Soft Company, Ltd.","url":"psx-chd-roms-b/Bomberman%20World%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":328701834,"score":7.3,"genres":"Action > Diagonal-down > Arcade > Direct control > Fantasy","desc":"<p>This is Bomberman's first appearance on the PlayStation in North America.  This version maintains the style of play of the 2D Bomberman games, but has a pseudo-3D look to it.  Bomberman World features the one player story mode as found in all Bomberman games, but it most importantly has a five player battle mode.  The multiplayer game has twelve different maps, along with three different modes of play.</p>"},{"name":"Bomberman: Party Edition","year":1998,"developer":"Metro Corporation","url":"psx-chd-roms-b/Bomberman%20-%20Party%20Edition%20%28USA%29.chd","filesize":278764321,"score":7.7,"genres":"Action > Top-down > Arcade > Party game > Direct control > Sci-fi / futuristic","desc":"<p>Bomberman returns to PlayStation for a bargain hurrah with Bomberman: Party Edition. This version of the seminal multiplayer game keeps it simple and classic.  The game features 2D backdrops, bombs, players, and that's about it.  Grab this game, a multi-tap, and some friends, and bomb away like the halcyon days of yore. You'll travel through the familiar grid-like levels, nabbing power-ups as you try and obliterate the competition.</p><p>The Single Player Mode is remake of the original Bomberman 50 levels, you can choose between two graphical style: Retro(basically the Nes version of Bomberman) or a Modern one that act as a remake </p>"},{"name":"Bombing Islands, The","year":1997,"developer":"Kotobuki System Co., Ltd.","url":"psx-chd-roms-b/Bombing%20Islands%2C%20The%20%28Europe%29.chd","filesize":171214105,"score":5.9,"genres":"Puzzle > Diagonal-down > Real-time","desc":"<p>After getting a message from King Clown that strange blue bombs have appeared on all six worlds, Kid Clown sets on a mission to clear away the threat. </p><p>You control a character whose purpose is to blow the blue bombs scattered on each island to smithereens. The gameplay is similar to Bombuzal. Each stage has a red bomb and blue bombs. The bombs that you blow are on a pre-designed spot but are movable and must be placed in a way that all of them will set off at once. To make certain that everything will blow you can check the number at the top of the blue bombs which equals the radius the blast will reach.</p><p>The stages are chessboard-like with little touches like trees and water for the first island, lava pits for the lava world and so on. The levels are rotatable with an isometric view (top-down if you hold down L2). There is also a time limit in which you must do the above.</p>"},{"name":"Bonogurashi","year":1996,"developer":"","url":"psx-chd-roms-b/Bonogurashi%20-%20Kore%20de%20Kanpeki%20Disu%20%28Japan%29.chd","filesize":35916257,"score":"","genres":"Adventure > Side view > Anime / Manga > Real-time > Graphic adventure > Point and select > Japan (Modern/Futuristic) > Comedy > Licensed","desc":"<p>Based on the \"Bonobono\" anime, the player controls a human who meets Bonobono and his friends on an adventure. The game involves a set of five actions to navigate the forest and progress through a series of conversations and solving puzzles.</p>"},{"name":"Book of Lulu, The","year":1996,"developer":"Dada Média"},{"name":"Book of Watermarks, The (Disc 1)","year":1999,"developer":"Watermarks","url":"psx-chd-roms-b/Book%20of%20Watermarks%2C%20The%20%28Japan%29%20%28Disc%201%29.chd","filesize":482479615,"score":"","genres":"Adventure > 1st-person > Puzzle elements > Direct control > Fantasy","desc":"<p><em>The Book of Watermarks</em> is an adventure game in the style of Myst, loosely based on Shakespeare's play <em>The Tempest</em>.</p><p>As in Shakespeare's play, the sorcerer Prospero is betrayed and and cast out of Milan, taking with him thirteen tomes of magic. Finally landing on an uninhabited island, he uses his magic to build a palace, temple and library and styles himself king of the island. One day, his tomes of magic vanish, except for one, the book of watermarks, which is a catalog of all the books in the world. Without his books, Prospero's magic is also lost, and his creations on the island are threatened.</p><p>Years later, the player arrives on the island in the role of Ferdinand, brought there by a tempest on the sea. Prospero tasks him with finding the lost books, with the help of the book of watermarks, to avoid disaster. The game plays out in a similar fashion to Myst, with the player moving around Prospero's palace in prerendered CGI sequences, solving puzzles to unlock the way to the twelve lost books. The book of watermarks contains hints on how to find these other books.</p><p>The only character shown in the game is Prospero, played by actor Jack Donner in FMV sequences in-between gameplay. The game is fully voice acted in English with Japanese subtitles.</p>"},{"name":"Book of Watermarks, The (Disc 2)","year":1999,"developer":"Watermarks","url":"psx-chd-roms-b/Book%20of%20Watermarks%2C%20The%20%28Japan%29%20%28Disc%202%29.chd","filesize":468267030,"score":"","genres":"Adventure > 1st-person > Puzzle elements > Direct control > Fantasy","desc":"<p><em>The Book of Watermarks</em> is an adventure game in the style of Myst, loosely based on Shakespeare's play <em>The Tempest</em>.</p><p>As in Shakespeare's play, the sorcerer Prospero is betrayed and and cast out of Milan, taking with him thirteen tomes of magic. Finally landing on an uninhabited island, he uses his magic to build a palace, temple and library and styles himself king of the island. One day, his tomes of magic vanish, except for one, the book of watermarks, which is a catalog of all the books in the world. Without his books, Prospero's magic is also lost, and his creations on the island are threatened.</p><p>Years later, the player arrives on the island in the role of Ferdinand, brought there by a tempest on the sea. Prospero tasks him with finding the lost books, with the help of the book of watermarks, to avoid disaster. The game plays out in a similar fashion to Myst, with the player moving around Prospero's palace in prerendered CGI sequences, solving puzzles to unlock the way to the twelve lost books. The book of watermarks contains hints on how to find these other books.</p><p>The only character shown in the game is Prospero, played by actor Jack Donner in FMV sequences in-between gameplay. The game is fully voice acted in English with Japanese subtitles.</p>"},{"name":"BoomBots","year":1999,"developer":"DreamWorks Interactive L.L.C."},{"name":"Bottom of the 9th","year":1996,"developer":"Konami Computer Entertainment Chicago, Inc.","url":"psx-chd-roms-b/Bottom%20of%20the%209th%20%28USA%29.chd","filesize":167630826,"score":7.4,"genres":"Simulation > Sports > Diagonal-down > 2D scrolling > Baseball","desc":"<p>One of the earliest in Konami's franchise, this version featured 300 actual MLB players at the time, but did not feature the MLB licensed teams. Players can choose to either play against a friend in <em>Exhibition</em>, <em>Season</em> or Playoffs. The gameplay is geared for more of a simulation style of play with the players stats determining on how well they hit, pitch and field.</p><p>Along with the standard modes for a baseball game, this one also featured the ability to customize their teams and choose any player to create their \"Dream Team\". It also had a variety of different camera angles to choose from and had meters to show their players progress such as a \"Streak Bar\" that showed a batters hitting ability and a \"Pitching Bar\" that showed whether a pitcher was fatigued.</p>"},{"name":"Bottom of the 9th '97","year":1996,"developer":"Konami Computer Entertainment Chicago, Inc.","url":"psx-chd-roms-b/Bottom%20of%20the%209th%20%2797%20%28USA%29.chd","filesize":291175568,"score":"","genres":"Simulation > Sports > Diagonal-down > 2D scrolling > Baseball","desc":"<p>The sequel to Bottom of the 9th, this version still continues to provide players with a full authentic MLB license including teams, their respective logos and over 700 of the major players of the time in 3D polygon graphics.</p><p>If also features the obligatory game modes such as <em>Exhibition</em>, <em>Season</em>, <em>Championship</em> and the like along with extensive stat tracking in numerous categories and the ability to trade players to build the ultimate \"dream team\". A new feature is the \"Scenario Mode\" that sets the player in a make or break situation to attempt to win a game on a full-count, bottom of the ninth situation, along with many other numerous scenarios.</p>"},{"name":"Bottom of the 9th '99","year":1998,"developer":"Konami Computer Entertainment Chicago, Inc.","url":"psx-chd-roms-b/Bottom%20of%20the%209th%20%2799%20%28USA%29.chd","filesize":274432600,"score":5.9,"genres":"Simulation > Sports > Diagonal-down > 2D scrolling > Direct control > Baseball","desc":"<p>This baseball game features the following game modes: exhibition, season, training, and scenario.</p><p>Exhibition mode lets the player play against the computer, another player, or just watch a game between 2 computer players. Training mode lets players practice their fielding, pitching, and batting skills. Scenario mode puts the player in a tight situation in 20 different  in-progress games to see if they can succeed in those situations. Season mode lets players play a season with anywhere from 15 to 162 games. The game can keep track of the season statistics, team standings, and any trades made during the season.</p><p>With only an MLBPA license, the game features the names of the real MLB players, but it doesn't include the real team's names or their logos, just the cities they play in. The game also offers 30 different stadiums to play in.</p><p>During the game, pitching involves selecting a type of pitch and aiming it into the batter's box by sliding around a cursor to where they want the pitch to go. To hit the ball, batters must move their own cursor to match where the ball will end up. If the batter decides to powerhit, the cursor becomes smaller, making it harder to make contact with the ball.</p><p>The game also features an announcer that calls the plays in real time.</p>"},{"name":"Boundary Gate: Daughter of Kingdom","year":1997,"developer":"Polestar Co., Ltd.","url":"psx-chd-roms-b/Boundary%20Gate%20-%20Daughter%20of%20Kingdom%20%28Japan%29.chd","filesize":164258113,"score":"","genres":"Role-playing (RPG) > 1st-person > Turn-based > Fantasy","desc":"<p>Long time ago, the First Mother created the world and blessed it with five magical symbols that would keep it in balance. The symbols were hidden deep in a sacred temple, to protect everything and everyone around them.</p><p>Many years later, an adventurer named Finn was looking for work in the city of Ambrose. There was indeed much work to do: monsters roamed the country, the threat of war was more real than ever. One night Finn was strolling through the city when he suddenly spotted a young girl attacked by a monster. Naturally, he defeated the monster and saved the girl, who turned out to be a princess hoping to restore her father's kingdom. The two decide to work together and venture to the nearby city, that lies in ruins, overrun by monsters...</p><p><em>Boundary Gate</em> is an old-fashioned RPG with dungeon-like 3D layout. The game is viewed from first-person perspective, with the exception of battles, where the heroes can be seen from an \"over-the-shoulder\" view. The attacks are animated. Enemies are random, and combat is turn-based, the party members using equipped weapons to attack or magical spells. Important locations are presented as 2D pictures. There is also voice acting for important conversations.</p>"},{"name":"Bounty Hunter Sara: Holy Mountain no Teiō","year":2001,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-b/Bounty%20Hunter%20Sara%20-%20Holy%20Mountain%20no%20Teiou%20%28Japan%29.chd","filesize":155929884,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Sci-fi / futuristic > Detective / mystery","desc":"<p>The year is 2060, and the huge city Neo Tokyo overflows with gangsters. The police is helpless - the criminals form well-organized group that are threatening to take power in the whole city. Only freelance bounty hunters, brave and reckless people who are willing to do a dangerous job to earn some money, dare to face the crime world of Neo Tokyo. You play as Sara Fitzgerald, one of such bounty hunters. The game plays as a digital novel, with still shots of real actors on an appropriate mystery/sci-fi background; you interact with the game world by making decisions for Sara. There are many different paths to take in the game, and in the end the player receives a \"detective rank\" according to the decisions he has taken.</p>"},{"name":"Bounty Sword: First","year":1997,"developer":"Pioneer LDC, Inc.","url":"psx-chd-roms-b/Bounty%20Sword%20First%20%28Japan%29.chd","filesize":450003866,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > 2D scrolling > Tactical RPG > Menu structures > Fantasy","desc":"<p><em>Bounty Sword</em> is a tactical strategy role-playing game set in a fictional futuristic world with a power struggle looming between Europea and the Kingdom of Rheinmetall. The game puts heavy focus on battle mode and offers a detailed tutorial one can go through before starting the story mode. During the battle your character can use close-combat weapons such as sword, initiate special devastating attacks, or use magic and items either to combat or as a remedy.</p><p>While traversing the world map you will encounter various cities which will let you visit stores to buy and sell items, or check the local inn to hear the gossips or save your game progress. While you start the game as a lone bounty hunter, you can have other characters join your party which in turn will participate in combat during the battle mode. The battle mode, however, does not let you control the characters directly. Instead, you can create trajectory paths which the characters will follow, and decide how they should act when encountering enemy combatants. Special attacks and magic spells can be initiated at any time, assuming you can perform them.</p><p>The game offers a variety of character classes, each with their pros and cons. Some of the character classes include bounty hunters, knights, ninjas, samurais, amazons, clerics, priests, sorcerers, wizards, snipers, and more. Each of your party characters has its own level and can level up by gathering experience points in combat. In town shops you can buy swords, bows and arrows, and other weapons, as well as protective armor and special items to equip your part characters with and increase their winning chance in combat.</p>"},{"name":"Bowling","year":1999,"developer":"Tamsoft Corporation","url":"psx-chd-roms-b/Bowling%20%28USA%29.chd","filesize":72864136,"score":"","genres":"Sports > 1st-person > Bowling","desc":"<p>A simulation of the classic game of the same name. As you can imagine from the name, this is a no-frills game, but it still comes with three modes, (normal, special, and quest) and multiplayer options. (1-4 players, with computer players as desired.)</p><p>Normal mode is the regular bowling game, but special mode sets up 45 pins instead of the usual 10. Quest mode, on the other hand, randomly places 3 pins in the lane, creating a more strategic play.</p>"},{"name":"Boxer's Road","year":1995,"developer":"NEW Corporation","url":"psx-chd-roms-b/Boxer%27s%20Road%20%28Japan%29%20%28Rev%201%29.chd","filesize":404167179,"score":"","genres":"Simulation > Sports > Managerial / business simulation > Boxing","desc":"<p><em>Boxer's Road</em> is an early boxing simulation game by NEW, who would later be responsible for the Victorious Boxers series. The game provides a detailed simulation of your boxer's professional career, including scheduling training and meals, monitoring a huge range of statistics on your boxer (which will affect your classification), and looking at your opponents' histories and information before each fight.</p><p>You also directly control your boxer during fights, and you have a sizable variety of different punches and other techniques. In addition to following your own career, you can also play an exhibition match against a friend's boxer on their own memory card. You can also save replays of your matches.</p>"},{"name":"BRAHMA Force: The Assault on Beltlogger 9","year":1996,"developer":"Genki Co., Ltd.","url":"psx-chd-roms-b/Brahma%20Force%20-%20The%20Assault%20on%20Beltlogger%209%20%28USA%29.chd","filesize":377335775,"score":7.3,"genres":"Action > 1st-person > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>A mech-based FPS; pilot your Bipedal Robotic Assault Heavy Mechanized Armor (built by Bronx Industries, of course) through the Beltlogger 9 excavation colony...</p><p>...discover what happened to the Beltlogger 9 colony- it may be related to the events on Probe Ship Mina 3, wherein a lone person apparently under the control of an outside intelligence slaughtered his shipmates.</p>"},{"name":"Brain Dead 13 (Disc 1)","year":1996,"developer":"ReadySoft Incorporated","url":"psx-chd-roms-b/BrainDead%2013%20%28USA%29%20%28Disc%201%29.chd","filesize":560285899,"score":6.2,"genres":"Action > Full Motion Video (FMV) > Quick Time Events (QTEs)","desc":"<p>In <em>Brain Dead 13</em>, the player takes on the role of a young computer expert who one day is called to fix a computer at some scary castle and in no time flat, finds himself in trouble.</p><p>It is up to the player to use the complex moves of an interactive movie to escape from the castle. This animated adventure is basically based on the player's judgment on which direction you think the character might go, and if the player guesses wrong, death.</p>"},{"name":"Brain Dead 13 (Disc 2)","year":1996,"developer":"ReadySoft Incorporated","url":"psx-chd-roms-b/BrainDead%2013%20%28USA%29%20%28Disc%202%29.chd","filesize":435669441,"score":6.2,"genres":"Action > Full Motion Video (FMV) > Quick Time Events (QTEs)","desc":"<p>In <em>Brain Dead 13</em>, the player takes on the role of a young computer expert who one day is called to fix a computer at some scary castle and in no time flat, finds himself in trouble.</p><p>It is up to the player to use the complex moves of an interactive movie to escape from the castle. This animated adventure is basically based on the player's judgment on which direction you think the character might go, and if the player guesses wrong, death.</p>"},{"name":"Bratz","year":2002,"developer":"DC Studios, Inc.","url":"psx-chd-roms-b/Bratz%20-%20Dress%20Up%2C%20Get%20Down%20and%20Be%20a%20Bratz%20Superstar%21%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":138287931,"score":5,"genres":"Action > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p>This is a dance game where you can be one of the 5 Bratz girls.  You can practice or make your way through the Bratz tournament.</p><p>There's a competitive dance mode and a copycat mode where you can have fun with your friends.</p>"},{"name":"Brave Fencer Musashi","year":1998,"developer":"Square Co., Ltd.","url":"psx-chd-roms-b/Brave%20Fencer%20Musashi%20%28USA%29.chd","filesize":210618433,"score":7.2,"genres":"Action > Role-playing (RPG) > Diagonal-down > Anime / Manga > Fantasy","desc":"<p>150 years ago, the legendary warrior known as the Brave Fencer Musashi saved the kingdom of Allucaneet from the evil Wizard of Darkness. Now, his spirit is reincarnated in a young, rather short-tempered boy. Fillet, the princess of Allucaneet, summons the reluctant hero to the palace and gives him the powerful sword Fusion, which he needs to defeat the evil Thirstquencher Empire. It soon turns out that the Empire is after another legendary sword, Lumina, so Musashi's first task is to get it before the bad guys do!..</p><p><em>Brave Fencer Musashi</em> is an action game with strong RPG elements. Controlling Musashi, the player explores the pre-rendered backgrounds from third person view (similarly to  Final Fantasy VII), visiting towns, talking to NPCs, etc. There is a day/night cycle in the game, which is manifested in the schedules of NPCs and/or monsters, as well as Musashi's fatigue level, which increases if he doesn't sleep enough. Musashi uses the two swords, Fusion and Lumina, to fight his enemies. The two swords have different properties: while Fusion behaves more or less like a traditional melee weapon, Lumina needs to be imbued with various elemental items in order to unleash powerful attacks.</p>"},{"name":"Brave Fencer Musashiden: Square Millennium Collection","year":2000,"developer":"","url":"psx-chd-roms-b/Brave%20Fencer%20Musashiden%20%28Japan%29.chd","filesize":223632350,"score":"","genres":"Special edition > Physical extras","desc":"<p>This Japan only re-release of Brave Fencer Musashi was part of the Square Millennium Collection, a collection of Square games packaged in a bigger box with several collectible items.</p><p>This release contained:- The game Brave Fencer Musashi.- A pouch designed to hold a Game Boy Colour or Wonderswan.- A set of five post cards.- A Minku wristband with a set of attachable Minkus.</p>"},{"name":"Brave Prove","year":1998,"developer":"Data West","url":"psx-chd-roms-b/Brave%20Prove%20%28Japan%29.chd","filesize":103265318,"score":"","genres":"Action > Role-playing (RPG) > Top-down > Anime / Manga > Action RPG > Direct control > Fantasy","desc":"<p>Arys is a young swordsman who is a member of the Wild Fangs, a peaceful mountain tribe searching for an ancient treasure called the Dark Crystal, which they believe has the power to bring peace to their troubled world. The tribe has recently found evidence that the Dark Crystal is hidden deep within a cave near their village, and the tribe's leader sends his only daughter, Sheena, the tribe's top swordsman, to retrieve it. Arys, a long-time friend of Sheena's, worries for her safety and sets off to help her.</p><p>The two of them find the Crystal, but when a strange creature appears, Sheena saves Arys' life at the cost of her own soul, which is stolen and whisked away by a mysterious figure. A fairy, claiming to be the Crystal's guardian, tells Arys that the balance has been destroyed, and unless he can find and seal the Light Crystal to restore the balance, his world will be doomed. Arys must now set out into the world seeking the other guardians and the Light Crystal in order to save Sheena and his very world!</p><p><em>Brave Prove</em> is a top-down action game much like The Legend of Zelda, but with a stronger emphasis on the RPG elements. As Arys defeats enemies, he gains experience and will level up, which brings increased abilities all around. He can also find many useful items including bombs, arrows, healing herbs, and a variety of equipment upgrades. Additionally, as Arys befriends each guardian, their elemental powers can be used to boost his sword attacks and provide various special abilities.</p>"},{"name":"Bravo Air Race","year":1997,"developer":"Metro Corporation","url":"psx-chd-roms-b/Bravo%20Air%20Race%20%28USA%29.chd","filesize":480403976,"score":6.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Flight / aviation","desc":"<p>In this air racing game, players race planes in an attempt to be first at the finish line. First they get to choose a plane, with each plane having their own ratings in max speed, acceleration, and mobility. The types of planes include a Lightning, Mustang, Thunderbolt, Corsair, Zero Fighter, Sinden, Messerschmitt, Spitfire, Gee Bee, Pitts, plus a few planes which have to be unlocked to use. They also can choose whether they want to fly the planes with automatic or manual transmission. They can choose to race in 4 different courses, which are the easy difficulty rated Mountain, the normal difficulty rated South City, or either of the hard difficulty rated Canyon or Snow Land course.</p><p>When the race starts, players compete against 11 other planes. Players can view the plane they're flying while racing or they can choose to view the race from inside their cockpit. Players can turn a guide option on or off, with the guide being on, it helps the player stay on course and not fly out of bound by placing a trail to follow. Players also have to get to each course's checkpoints before a timer counts down to zero. If the player makes it to a checkpoint on time, their time is extended so they can get to the next one. During a race, players may see an S icon that when touched will give the player's plane a temporary burst of speed. Planes also can perform aerobatic rolls to quickly get out of danger. If a plane crashes, the players starts where they crashed, but costs them precious amounts of time. If players don't make it to the checkpoint on time, the race is over.</p><p>The game also features a 2 player mode where 2 players race against each other while in split-screen. There is also a time attack mode where the player can fly the courses by themselves and try to complete laps as fast as possible and finish a course in as little time as possible.</p>"},{"name":"Break Point","year":1996,"developer":"Smart Dog","url":"psx-chd-roms-b/Break%20Point%20%28Europe%29%20%28En%2CFr%29.chd","filesize":85614683,"score":6.7,"genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p>Break Point is your basic tennis game. You can play on several different courts which differ in surroundings and style. There's a couple of fantasy courts as well as some real life courts. Player can choose between various motion captured players and game modes including practice, cup, tournament and so on.The speciality in this one is the fact that you can play with up to 8 players in tournament.</p>"},{"name":"Breakout","year":2000,"developer":"Supersonic Software Ltd.","url":"psx-chd-roms-b/Break%20Point%20%28Japan%29.chd","filesize":86993761,"score":6.4,"genres":"Action > Behind view > Paddle / Pong","desc":"<p>In this updated version of <em>Breakout</em>, players take the role of \"Bouncer\", whose main objective is to rescue both his friends and Daisy and defeat the evil Batnix. </p><p>Gameplay is similar to the original game from 1977, but with 3D graphics and multiplayer support. Play through exotic locations like a dark prison cell, a menacing dragon-owned castle, an animal infested farm, and outer space. The game also contains numerous challenging modes, secrets and bonuses.</p>"},{"name":"BreakThru!","year":1995,"developer":"ZOO Corporation","url":"psx-chd-roms-b/Break%20Thru%21%20%28Japan%29.chd","filesize":13130408,"score":6.1,"genres":"Puzzle > Fixed / flip-screen > Real-time > Tile matching puzzle > Point and select","desc":"<p>In the award-winning tradition of Tetris, comes BreakThru! This time, your goal is to make as many bricks disappear as you can before time runs out. Click on a group of same-colored bricks to remove bricks and make the wall come tumbling down.</p>"},{"name":"Breath of Fire III","year":1997,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-b/Breath%20of%20Fire%20III%20%28Europe%29.chd","filesize":152054134,"score":7.7,"genres":"Role-playing (RPG) > Diagonal-down > Isometric > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>Capcom's third installment of its epic RPG. <em>Breath of Fire III</em> is the first installment of the Breath of Fire Series to appear on the Playstation (And later ported to the PSP). </p><p>Set free by the the workers of Dauna Mine, Ryu of the Brood learns to both understand his power, and to understand the history of his extinct kind. By both utilizing Ryu's unique power and the abilities of those whom assist him, players will uncover the history of the Brood, learn more about the characters, and the very reason why the Brood were wiped out.</p><p>Players control Ryu and his allies on their journey, each of Ryu's friends have abilities only they can use, and they will have to work together to make their way through the obstacles and enemies that they encounter; creativity is key to your success in this game!</p><p>Ryu eventually is able to utilize his power of the Brood, allowing him to ascend into various dragon-like forms. This is done using a gene-splicing system that dictates what sort of form Ryu will take.</p><p>Breath of Fire III also includes a Master System, which permits Ryu and his allies to learn from various people to augment their abilities differently as they gain experience; these trainers can also teach abilities to those whom train hard under them.</p>"},{"name":"Breath of Fire IV","year":2000,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-b/Breath%20of%20Fire%20IV%20%28Europe%29.chd","filesize":211316144,"score":7.4,"genres":"Role-playing (RPG) > Diagonal-down > Isometric > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Regional differences","desc":"<p>Nina, the princess of Wyndia, and Cray, chieftain of the cat-like Woren tribe, are searching for Cray's relatives who disappeared under mysterious circumstances during a diplomatic mission. Flying through the sky on their sandflier, Nina and Cray are attacked by a worm shaped dragon. With their vehicle damaged, Nina returns to the city to find parts, bumping into a naked young boy named Ryu along the way, who is unsure of where he is. At the very same time, Nina is again attacked by a dragon. Confused by the strange events taking place, Nina agrees to help the young boy. Meanwhile, the ancient Emperor Fou Lu awakens from his slumber in his tomb. His plan is to return to the world of human, conquer it anew, and impose his iron rule on it...</p><p>This fourth installment of the  Breath of Fire series is a fairly traditional Japanese-style RPG, with turn-based combat, party management, linear story progression, and other characteristic elements of the genre. As in the  previous game, characters become stronger and learn new skills by performing tasks for \"masters\" living in different towns. Ryu, the main protagonist of the series, has retained the series' trademark gameplay element: the ability to turn into a dragon during combat. <em>Breath of Fire IV</em> is rich in mini-games of various types, including the popular fishing mini-game that was present in previous installments as well.</p>"},{"name":"Breeding Stud: Bokujou de Aimashou","year":1997,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"psx-chd-roms-b/Breeding%20Stud%20-%20Bokujou%20de%20Aimashou%20%28Japan%29.chd","filesize":216715086,"score":"","genres":"Simulation > Sports > Turn-based > Managerial / business simulation > Horse / derby > Japan (Modern/Futuristic)","desc":"<p><em>Breeding Stud: Bokujō de Aimashō</em> (literally translated as \"Breeding Stud: Let's Meet at the Pasture\") is a racehorse breeding simulation game. As the owner of a racehorse breeding pasture, players need to breed or purchase foals, then send them to other pastures for training and racing.</p>"},{"name":"Brian Lara Cricket","year":1998,"developer":"Codemasters","url":"psx-chd-roms-b/Brian%20Lara%20Cricket%20%28Europe%29.chd","filesize":230380822,"score":6.9,"genres":"Action > Sports > 1st-person > Behind view > Diagonal-down > Cricket > Licensed","desc":"<p>The classic game of cricket, updated for 1998 and endorsed by Brian Lara.  A more detailed description can be found in the advertising blurbs.</p>"},{"name":"Brigandine: Grand Edition (Disc 1)","year":2000,"developer":"Hearty Robin","url":"psx-chd-roms-b/Brigandine%20-%20Grand%20Edition%20%28Japan%29%20%28Disc%201%29.chd","filesize":441779848,"score":"","genres":"Role-playing (RPG) > Strategy > Top-down > Isometric > Anime / Manga > Fantasy","desc":"<p><em>Brigandine: Grand Edition</em> is the updated version of the PSX game Brigandine: The Legend of Forsena. The graphic has gone through many changes such as 2D animation cutscenes replacing some CG movies, redrawn art, and the 3D battle scenes changed to 2D animations. The music tracks have also been redone or revamped.</p><p>The game has new playable characters and items. One of the kingdom, Esgares Empire, is now playable from the start and has its own cutscenes and storyline. Some of the gameplay aspects (turn limits, attacks, etc.) have been balanced. The story has been completed by adding some events and a new ending, and some of the events now have full animation and voice acting. <em>Brigandine: Grand Edition</em> offers multiplayer, which was not available in the original game.</p>"},{"name":"Brigandine: Grand Edition (Disc 2)","year":2000,"developer":"Hearty Robin","url":"psx-chd-roms-b/Brigandine%20-%20Grand%20Edition%20%28Japan%29%20%28Disc%202%29.chd","filesize":424753323,"score":"","genres":"Role-playing (RPG) > Strategy > Top-down > Isometric > Anime / Manga > Fantasy","desc":"<p><em>Brigandine: Grand Edition</em> is the updated version of the PSX game Brigandine: The Legend of Forsena. The graphic has gone through many changes such as 2D animation cutscenes replacing some CG movies, redrawn art, and the 3D battle scenes changed to 2D animations. The music tracks have also been redone or revamped.</p><p>The game has new playable characters and items. One of the kingdom, Esgares Empire, is now playable from the start and has its own cutscenes and storyline. Some of the gameplay aspects (turn limits, attacks, etc.) have been balanced. The story has been completed by adding some events and a new ending, and some of the events now have full animation and voice acting. <em>Brigandine: Grand Edition</em> offers multiplayer, which was not available in the original game.</p>"},{"name":"Brigandine: The Legend of Forsena","year":1998,"developer":"Hearty Robin","url":"psx-chd-roms-b/Brigandine%20-%20The%20Legend%20of%20Forsena%20%28USA%29.chd","filesize":303850575,"score":7.1,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Isometric > Anime / Manga > Fantasy","desc":"<p><em>Brigandine</em> is a tactical role-playing game set in an active world where all of your army units and your enemy units fight and grow continuously.</p><p>The story takes place on the continent of Forsena where a coup d'etat has taken place in the kingdom of Almekia. You have a choice of selecting one of five characters from surrounding kingdoms to conquer the kingdom of Almekia and return peace to Forsena once again. </p><p>Gameplay is very much like other tactical games in that you first select the kingdom to attack, attack that country, organize your troops and repeat that process until victory. The gameplay is reminiscent of Ogre Battle in that when you invade a country you then select the towns or bases in which to attack to conquer that country. Your units will upgrade with experience from fighters to knights and barbarians to berserkers. Summon monsters like dragons and hydras to fight on your side which will grow with experience also. </p><p>As with Final Fantasy Tactics, the Zodiac plays a role in determining every units effectiveness against another. Elements (Fire, Nature, Water, Thunder) and Alignments (Neutral, Light, Dark) also figure into damage.</p><p>The progression of a battle involves sending three Rune Knights and their retinue of monsters to represent your side. Each Knight has a number of \"rune points\" calculated off of level, class, and particular attributes. Each monster requires a number of rune points to have in the party, ranging from a ghoul (15) to a Lucifer (125). Regardless of rune power a Knight can only have 6 units in his retinue.</p><p>Each castle/fort/town produces a set number of 'Rune Energy', which is set against the 'upkeep' cost of all alive units. In this way larger nations sustain more powerful fighters, smaller nations must sacrifice fighters who they can not upkeep, and saving up rune energy can allow a nation to quickly bolster forces after a defeat.</p><p>The majority of the game takes place in 2D sprites except for the battle scenes which take place in full 3D polygons.</p>"},{"name":"Brightis","year":1999,"developer":"Shade, Inc.","url":"psx-chd-roms-b/Brightis%20%28Japan%29.chd","filesize":68656277,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Free-roaming camera > Real-time > Action RPG > Direct control > Fantasy","desc":"<p><em>Brightis</em> is a 3D action-RPG where the player travel the land and head into dungeons as the sword-wielding Al Ted, searching for the four stones needed to reseal an evil gate that's unleashed demons into the world. </p><p>The player has to solve puzzles, fight enemies, jump across platforms, and navigate dungeons and traps much like other examples in this genre. This game's unique gimmick is that you are the embodiment of light, and can cast light down dark hallways in order to see enemies and traps. Light is represented through the pulsing blue orb just below your HP, functioning as an MP meter that slowly refills automatically.</p>"},{"name":"Broken Helix","year":1997,"developer":"Konami Computer Entertainment Chicago, Inc.","url":"psx-chd-roms-b/Broken%20Helix%20%28Europe%29.chd","filesize":487227314,"score":7.1,"genres":"Action > Behind view","desc":"<p><em>Broken Helix</em> puts you in the boots of an armed marine of a special forces team. You are sent in to a military base which has been taken over by terrorists for unknown reasons.</p><p>The main character is voiced by Bruce Campbell, star of the Evil Dead movies. Throughout the game, he makes wisecracks and one-liners, and dialogue with personnel is generally comical.</p><p>Broken Helix is considered a 4D game. For example, if you are on the third floor, you may have to make your way up to the fifth floor in order to defuse a bomb. There is no visible time limit, but if you do not make it up to that floor in time, the bomb will go off, and you will die.</p><p>There are various objectives to complete, such as disarming bombs and finding certain items, but the game is mostly action/adventure, searching for keys to open doors.</p><p>In order to be successful, you must sneak past cameras and other devices, in order to find out the truth behind the terrorist takeover.</p>"},{"name":"Broken Sword: The Smoking Mirror","year":1997,"developer":"Revolution Software Ltd."},{"name":"Brunswick Circuit Pro Bowling","year":1998,"developer":"Adrenalin Interactive, Inc.","url":"psx-chd-roms-b/Brunswick%20Circuit%20Pro%20Bowling%20%28Europe%29.chd","filesize":381445488,"score":6.9,"genres":"Sports > Behind view > Bowling > Licensed","desc":"<p>Choose from one of the 13 genuine tournament bowlers, with real lanes, real player animations, real lane conditions and changes, real bowling balls (genuine Brunswick!) each with its physical properties. All the tournament rules are available along six game modes (Exhibition, Skins —the Brunswick \"Skins\" game—, Tournament, Career, Practice, Cosmic). The playing character is picked from the Brunswick ProStaff or self-created by the player.</p>"},{"name":"Brunswick Circuit Pro Bowling 2","year":2000,"developer":"Adrenalin Interactive, Inc.","url":"psx-chd-roms-b/Brunswick%20Circuit%20Pro%20Bowling%202%20%28Europe%29.chd","filesize":427175230,"score":7.2,"genres":"Simulation > Sports > 3rd-person (Other) > Bowling > Licensed","desc":"<p><em>Brunswick Circuit Pro Bowling 2</em> is the second in the Brunswick Circuit series of bowling games. The game uses many aspects of the original game, improves them and adds new features.</p><p>The sound effects and music have been improved to give the player the feeling of being in a real bowling atmosphere. New characters have been added that include female bowlers, plus there are new tournaments, new modes of play and an easier throw system. Bowling balls can be selected based on weight, size and style. The multiplayer game has also been expanded.</p><p>Modes of play include: Amateur and Pro Career Mode, Cosmic Bowl, Skills Challenge, and Skins.</p>"},{"name":"Bubble Bobble also featuring Rainbow Islands","year":1996,"developer":"Probe Entertainment Ltd.","url":"psx-chd-roms-b/Bubble%20Bobble%20also%20featuring%20Rainbow%20Islands%20%28Europe%29.chd","filesize":51064923,"score":7.2,"genres":"Action > Compilation > Side view > Arcade > Platform","desc":"<p>Bubble Bobble: One or two players attempt to save their friends in this re-release of the 1987 classic puzzle/action game. Players blow bubbles to trap enemies. When they pop the bubbles, fruit comes out and the players compete for the points. If they don't pop the bubbles in time, the enemies escape and become faster.</p><p>Rainbow Islands: One or two players. Rainbow Islands is the sequel to Bubble Bobble. Instead of bubbles, you create rainbows. The highly versatile rainbow can be used as bridges, as platforms, or as a weapon. You can shoot a rainbow at an enemy, you can trap it inside, or you can drop a rainbow on an enemy from above.</p>"},{"name":"Bubsy 3D","year":1996,"developer":"Eidetic, Inc.","url":"psx-chd-roms-b/Bubsy%203D%20-%20Furbitten%20Planet%20%28Europe%29.chd","filesize":357714363,"score":5.2,"genres":"Action > Behind view > Platform > Direct control > Sci-fi / futuristic > Comedy","desc":"<p><em>Bubsy 3D</em> is a polygonal platformer, and one of the earlier games released domestically for the Sony PlayStation. It is a continuation of the Bubsy series, which debuted on the 16-bit platformers back in the early 1990s. The game's graphics are predominated by flat-shaded polygons. The gameplay is broken up into a series of stages. The typical goal is to find pieces of a broken spaceship. The game supports both password saves and the PlayStation Memory Card, but it does not feature analog support.</p>"},{"name":"BugRiders: The Race of Kings","year":1997,"developer":"n-Space, Inc.","url":"psx-chd-roms-b/Bugriders%20-%20The%20Race%20of%20Kings%20%28Europe%29.chd","filesize":461052547,"score":5.8,"genres":"Action > Racing / Driving > Behind view > Track racing > Fantasy","desc":"<p>Bug Riders tries to put a new twist on the racing genre. You choose a character and his or her bug and race through six tracks that make up the \"Great Race\". </p><p>Instead of having a normal accelerate button, you must crop your bug to make him go faster. But watch out, you don't want to overdo it because he will become angry and refuse to obey you. You can pull on the reins to slow down.</p><p>The six tracks are filled with shortcuts and power-up items, such as missiles and bombs to blast away your opponents.  You must fly through as many time rings as you can to add time to the clock or you won't be able to finish the race.</p>"},{"name":"Bugs Bunny & Taz: Time Busters","year":2000,"developer":"Artificial Mind & Movement","url":"psx-chd-roms-b/Bugs%20Bunny%20%26%20Taz%20-%20Time%20Busters%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":432785633,"score":7,"genres":"Action > Behind view > Direct control > Fantasy > Licensed","desc":"<p>In <em>Bugs Bunny &amp; Taz: Time Busters</em> Daffy Duck has ruined the Time Machine, and Granny asks Bugs and the Tazmanian Devil to collect all the parts of the machine.</p><p>The game is an action adventure using a dual-control system. Players control both Bugs and the Taz, switching between the two characters to solve various tasks and beat cartoon villains that stand in their way. The stages have various themes representing different times and eras, such as Viking, Arabia and Transylvania, and contain various mini games.</p>"},{"name":"Bugs Bunny: Lost in Time","year":1999,"developer":"Behaviour Interactive","url":"psx-chd-roms-b/Bugs%20Bunny%20-%20Lost%20in%20Time%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":294338448,"score":7.1,"genres":"Action > Behind view > Platform > Direct control > Fantasy > Licensed","desc":"<p>On his way to the beach, Bugs Bunny accidentally finds and activates a time machine. Bugs Bunny is immediately propelled through five different areas in time and must find his way back to the present.It won't be an easy task, because blocking his way back to the present are some of the wildest troublemakers (Stupid Villians) he has ever known like Elmer Fudd, Witch Haxel, Yosemite Sam, Rocky and Marvin.</p><p><em>Bugs Bunny: Lost in Time</em> is a 3D platformer. Stages do not succeed each other linearly, but can be accessed in different order by collecting clocks and golden carrots. Bugs Bunny must dispose of regular enemies and bosses along his way. There are also a few racing and chase segments.</p>"},{"name":"Builder's Block","year":1999,"developer":"Taito Corporation","url":"psx-chd-roms-b/Builder%27s%20Block%20%28USA%29.chd","filesize":338418527,"score":7.3,"genres":"Action > Puzzle > Top-down > Fixed / flip-screen > Isometric > Anime / Manga > Arcade > City building / construction simulation","desc":"<p>This action puzzle game features 3 different game modes. The game modes are Puzzle mode, Battle mode, and Arcade mode.</p><p>The objective of Puzzle mode is to increase the population of 12 different locales by creating buildings. Each locale is made up of six stages which have three levels each. These buildings can range in sizes from 3x3 up to 7x7. These buildings are created by shooting colored blocks at the same colored blocks that are already laid out in the playfield. The player only has a limited number of shots before the blocks on the playfield gets pushed down off the playfield. If the structure gets fully pushed off the playfield, the game ends. </p><p>Battle mode has 2 players competing against each other to see who can build and destroy the most buildings and earn the most points for doing so. To destroy a building that has been made, the player has to shoot a block onto the corner of it. Also, each building destroyed is worth a certain number of coins. The player must have 100 coins to win the battle. Both Puzzle and Battle mode allow the player to angle the camera upwards and downwards when viewing the playing field. </p><p>Arcade mode lets the player select one of eight available characters and has them battle against another player or the computer. Players try to form and destroy buildings as fast as possible, with some of those destroyed building blocks ending up going over to the opponent's side of the playfield. The goal is to get the opponents blocks pushed off the playfield.</p><p>The arcade mode is the only mode that contains the coin-op conversion, while the other two modes are Playstation exclusives.</p>"},{"name":"Building Crush!","year":1996,"developer":"Shoeisha Co., Ltd.","url":"psx-chd-roms-b/Building%20Crush%21%20%28Japan%29.chd","filesize":188126598,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Falling block puzzle > Tile matching puzzle > Direct control","desc":"<p><em>Building Crush!</em> is a puzzle game where you play the role of a demolitions expert and try to bring down buildings faster than your opponent. Place bombs in windowed blocks to clear connected blocks of the same color, and make chains with the falling blocks that match up. There are several bomb power-ups to increase their effectiveness, as well as assist characters to hinder your opponent. You can play against the CPU or a friend.</p>"},{"name":"Burning Road","year":1996,"developer":"Toka S.a.r.l.","url":"psx-chd-roms-b/Burning%20Road%20%28Europe%29.chd","filesize":163127190,"score":6.9,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Arcade > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p><em>Burning Road</em> is an arcade racing game, heavily influenced by Daytona USA. There are four types of cars to drive: two muscle cars, a drag car and a monster truck, each with their own strengths and weaknesses. There are three different courses to drive on (a wooded area, city streets and snow area) and also have a reverse track variation that can be unlocked. The object is not only to finish ahead of opponents, but also cross checkpoints in order to add more time to the ever depleting timer at the top of the screen.</p><p>There are three different difficulty levels and three different game modes: <em>Practice</em> lets the player choose a track and races several different opponents and <em>Career</em> where the player races in a series of multi-heat events. In these heat events, each time a lap is completed the driver that is last place is eliminated until only one car finishes the race. The final mode is a multiplayer that allows two friends to battle against each other utilizing the Playstation Link Cable.</p><p>There are also a multitude of camera angles including first and third person along with a full replay mode that shows the race in its entirety.</p>"},{"name":"BursTrick: Wake Boarding!!","year":2000,"developer":"Metro Corporation","url":"psx-chd-roms-b/BursTrick%20-%20Wake%20Boarding%21%21%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":157592154,"score":5.4,"genres":"Action > Sports > Behind view > Tricks / stunts > Wakeboarding > Licensed","desc":"<p><em>BursTrick: Wake Boarding!!</em> is an extreme-sports game using gameplay similar to Wave Race 64, the main difference being that, as you are pulled by a boat when wake boarding, it is almost like an auto-scroller and you do not have nearly as much freedom of movement. </p><p>There are two gameplay modes, Obstacle and Trick. In Obstacle mode, you race around a track and must complete the track in time and collect enough points by wake boarding through rings and over jumps. In Trick mode, you compete to score as many points as possible by performing tricks. There are over 45 tricks in total.</p><p>Other features include several different riders to choose from and unlockable boards and characters.</p>"},{"name":"Bushido Blade","year":1997,"developer":"LightWeight Co., Ltd.","url":"psx-chd-roms-b/Bushido%20Blade%20%28Europe%29.chd","filesize":281640927,"score":7.6,"genres":"Action > 1st-person > 3rd-person (Other) > Cinematic camera > Fighting > Japan (Ancient/Classical/Medieval) > Martial arts > Regional differences","desc":"<p>The Bushido code of honor governs the actions of the Samurai and sets a code of ethics for use in fighting. Sometime in the 20th century, a group of Narukagami ninja, each proficient in a different style, find themselves in a battle to regain their honor in the fighting ring.</p><p><em>Bushido Blade</em> is a versus fighting game with several unique features. It does away with health bars, special meters, and other traditional gimmicks and allows for battles to be won with a single hit. Players select from among six ninja, each of a different fighting style and attributes. Players also choose equipment from among eight weapons, including Japanese swords, European blades, naginata and a sledgehammer. </p><p>Battles take place in wide open areas in which combatants can run around as well as climb up and down. Some structures, like bamboo trees, can even be cut down. In the single player game, players can even run through the entire castle, picking a preferred fighting ground location. In addition to the single player story mode, there's a versus mode, a slash mode where you will be attacked by 100 generic ninja in one long corridor, a training, and a 'POV' mode, which allows players to play from first person, heightening the realism. The game's versus mode can also be played using two Playstations linked up.</p><p>Gameplay involves picking one of three stances, then attacking high, middle, or low. Directions while attacking change attacks, and attacks can be combo'd. Player damage is location based, with hits to arms often making them useless, hits to legs crippling, and hits to heads and clean across the torso being mortal. The use of stances and the easily achieved one hit kills make <em>Bushido Blade</em> one of the most deadly, and therefore realistic, weapon fighters around.</p>"},{"name":"Bushido Blade 2","year":1998,"developer":"LightWeight Co., Ltd.","url":"psx-chd-roms-b/Bushido%20Blade%202%20%28USA%29.chd","filesize":348825154,"score":7.2,"genres":"Action > 1st-person > Side view > Fighting > Martial arts","desc":"<p>Two samurai families who date back over eight hundred years have been feuding ever since the Gempei War, where the Kagami family sided with the Minamoto and ensured themselves a victory over their rivals, the Sue. Over the centuries since, the two families evolved into ninja clans, but their hatred of each other never faded. Now, in the 20th century, the Shainto, descendants of the Sue, are in a position to bring vengeance on the Narukagami. </p><p><em>Bushido Blade 2</em> takes place some time after the events in the original game, and is also a weapon fighting game without health bars, power displays, or over-the-top special maneuvers. The game features the Story Mode, Versus Mode and Slash mode present in the original game as well as a new tournament mode, where the two sides face each other with shinai and other bamboo weapons in a kendo like ring. Fighters have different styles (including some with two sword nito and iaijutsu styles) and there are many weapons to choose from (although the hammer has been replaced with the yari spear). The controls have changed somewhat, but stances are still in the game, as are one-hit kills if blows strike a sensitive part of the body.</p><p>Initially players can choose from six warriors, three from each clan. As progress is made in the story mode, supporting characters will be encountered. If beaten, those characters will become available for play in the game's other modes.</p>"},{"name":"Bust A Groove","year":1998,"developer":"Metro Corporation","url":"psx-chd-roms-b/Bust%20A%20Groove%20%28USA%29.chd","filesize":297659025,"score":7.7,"genres":"Action > 3rd-person (Other) > Arcade > Music / rhythm","desc":"<p>Match the moves shown on-screen in this Simon-like game to dance.  Keep up with the continuing commands and your persona will be able to do combos and other fancy moves.  Dance different styles as a disco throwback, a breakdancer, a robot, and others, either alone or with a partner.  When dancing with a partner, coordination is important so you can gain a clear lead on him.  When dancing together each character gets an opportunity for a dance solo.  Don't waste it as it's a great time to rack up points.</p>"},{"name":"Bust a Groove 2","year":1999,"developer":"Metro Corporation","url":"psx-chd-roms-b/Bust%20A%20Groove%202%20%28USA%29.chd","filesize":260272067,"score":7.8,"genres":"Action > 3rd-person (Other) > Arcade > Music / rhythm","desc":"<p>This sequel to Bust-a-Groove adds new characters and music to the dancing game. Other changes were made in the interface graphics, but the bulk of the gameplay is the same as the original.</p>"},{"name":"Bust-A-Move 3","year":1997,"developer":"Taito Corporation","url":"psx-chd-roms-b/Bust-A-Move%203%20DX%20%28Europe%29.chd","filesize":226380860,"score":7.8,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Arcade > Tile matching puzzle > Direct control > Fantasy","desc":"<p>One day, Dunk, the magic magician of Bubble World, releases a spell that transports eight characters from their home worlds to Bubble World. Now it is the player's turn to bring them back home!</p><p>In Bust-A-Move 3, you must try to remove all the bubbles in each stage by connecting three or more of the same color.</p><p>Five playing modes are available:</p><ul><li>Arcade mode.</li><li>Challenge mode: in this mode the player's performance is evaluated and the game adapts to it.</li><li>Win Contest mode: challenge all eight characters.</li><li>Collection mode: a collection of levels created by <em>Bust-A-Move</em> players. Each round carries the designer's name.</li><li>Edit mode: players can create and play their own puzzles.</li></ul><p>The Nintendo 64 version also includes two- and four-player modes.</p>"},{"name":"Bust-A-Move 4","year":1998,"developer":"Taito Corporation","url":"psx-chd-roms-b/Bust-A-Move%204%20%28Europe%29.chd","filesize":285346696,"score":7.3,"genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Tile matching puzzle","desc":"<p><em>Bust-A-Move 4</em> continues the gameplay tradition of the previous game in the series, focusing on releasing colored bubbles and matching them to make them disappear. This installment adds new characters to choose from, as well as a Story mode, where the player wins Tarot cards after each completed stage. In Story mode the player sees the story unfold as he defeats each CPU-controlled character (which change depending on the character the player starts with). </p><p>The Win Contest mode is a simple \"how many games can I win in a row\" against the computer. Finally, should the player complete the Challenge mode (where he must complete certain puzzles as fast as possible, and get judged on technique, speed etc.), the Edit mode will become available, which allows players put together their own puzzles, completing with each other.</p>"},{"name":"Bust-A-Move Again","year":1996,"developer":"Taito Corporation"},{"name":"Buster Bros. Collection","year":1997,"developer":"Mitchell Corporation","url":"psx-chd-roms-b/Buster%20Bros.%20Collection%20%28USA%29.chd","filesize":287975239,"score":7.3,"genres":"Action > Compilation > Side view > Puzzle elements > Shooter","desc":"<p>A collection of 3 classic Buster Bros. games:</p><ul><li>Buster Bros.</li><li>Super Buster Bros.</li><li>Buster Buddies</li></ul><p>Each game plays virtually the same- these are action-puzzle hybrids (akin to Bubble Bobble); maneuver your character along the bottom of the screen and fire your rope gun; your rope causes the bad evil bubbles to break into smaller bubbles until they finally are defeated (much like the asteroids in Asteroids). BBros and SBB both involve your world being attacked by the Bubble King (the funny synopsis of BBros in the instructions notes \"One day for no particular reason the Bubble King began a siege on Earth's cities with multi-sized breakable bubbles\"- Idi Amin he ain't.), while BBuddies involves precious art being guarded by bubbles- in a rare turn of events, you play as the thief looking to steal the art!</p>"},{"name":"Buttsubushi","year":2001,"developer":"Selen Ltd.","url":"psx-chd-roms-b/Buttsubushi%20%28Europe%2C%20Australia%29.chd","filesize":457077864,"score":"","genres":"Action > Puzzle > Diagonal-down > Fixed / flip-screen > Direct control","desc":"<p>The ultimate brain teaser puzzle game. Easy to learn, but very tough to master. Action puzzles with puzzling actions. Addictive and challenging gameplay. Crush them before they crush you! A mind-bending 100 levels to clear. Multiplayer mode for upto 4 players. Buttsubushi offers a real challenge even to the most experienced puzzle fan.</p>"}]