[{"name":"D (Disk 1)","year":1995,"developer":"Rozner Labs Software Group","url":"psx-chd-roms-d/D%20%28Europe%29%20%28Disc%201%29.chd","filesize":401743336,"score":6.4,"genres":"Adventure > 1st-person > Puzzle elements > Quick Time Events (QTEs) > Horror","desc":"<p>The story begins in 1997. It's the dead of night in the city of Los Angeles, and there has been a mass murder at a general hospital on the outskirts of downtown. The perpetrator is the director of the hospital, Richter Harris. He has shut himself up in the hospital and taken a number of patients as hostages, leaving the police helpless and unable to move in. After hearing the situation, Richter's only daughter, Laura Harris, rushes to Los Angeles from San Francisco to the tragic scene at the hospital. Upon entering, Laura finds herself transported to an old mansion, while the disembodied voice of her father pleads with her to leave. Nevertheless, she must press forward to save her father and herself.</p><p><em>D</em> is a puzzle game requiring Laura to solve esoteric inventory puzzles on a very strict time limit. Each of the game's four discs must be completed in about thirty minutes each, and saving is not an option. The time is kept track of using Laura's pocket watch. The pocket watch can also be used to supply hints for puzzles, but after three uses the glass will shatter and it will stop working. The game also has multiple endings.</p>"},{"name":"D (Disk 1)","year":1995,"developer":"Rozner Labs Software Group","url":"psx-chd-roms-d/D%20%28Europe%29%20%28Disc%202%29.chd","filesize":474351657,"score":6.4,"genres":"Adventure > 1st-person > Puzzle elements > Quick Time Events (QTEs) > Horror","desc":"<p>The story begins in 1997. It's the dead of night in the city of Los Angeles, and there has been a mass murder at a general hospital on the outskirts of downtown. The perpetrator is the director of the hospital, Richter Harris. He has shut himself up in the hospital and taken a number of patients as hostages, leaving the police helpless and unable to move in. After hearing the situation, Richter's only daughter, Laura Harris, rushes to Los Angeles from San Francisco to the tragic scene at the hospital. Upon entering, Laura finds herself transported to an old mansion, while the disembodied voice of her father pleads with her to leave. Nevertheless, she must press forward to save her father and herself.</p><p><em>D</em> is a puzzle game requiring Laura to solve esoteric inventory puzzles on a very strict time limit. Each of the game's four discs must be completed in about thirty minutes each, and saving is not an option. The time is kept track of using Laura's pocket watch. The pocket watch can also be used to supply hints for puzzles, but after three uses the glass will shatter and it will stop working. The game also has multiple endings.</p>"},{"name":"D (Disk 1)","year":1995,"developer":"Rozner Labs Software Group","url":"psx-chd-roms-d/D%20%28Europe%29%20%28Disc%203%29.chd","filesize":271994991,"score":6.4,"genres":"Adventure > 1st-person > Puzzle elements > Quick Time Events (QTEs) > Horror","desc":"<p>The story begins in 1997. It's the dead of night in the city of Los Angeles, and there has been a mass murder at a general hospital on the outskirts of downtown. The perpetrator is the director of the hospital, Richter Harris. He has shut himself up in the hospital and taken a number of patients as hostages, leaving the police helpless and unable to move in. After hearing the situation, Richter's only daughter, Laura Harris, rushes to Los Angeles from San Francisco to the tragic scene at the hospital. Upon entering, Laura finds herself transported to an old mansion, while the disembodied voice of her father pleads with her to leave. Nevertheless, she must press forward to save her father and herself.</p><p><em>D</em> is a puzzle game requiring Laura to solve esoteric inventory puzzles on a very strict time limit. Each of the game's four discs must be completed in about thirty minutes each, and saving is not an option. The time is kept track of using Laura's pocket watch. The pocket watch can also be used to supply hints for puzzles, but after three uses the glass will shatter and it will stop working. The game also has multiple endings.</p>"},{"name":"Dà Fùwēng Zhī Xiào Xiào Jiānghú","year":2000,"developer":"J&R Co., Ltd."},{"name":"Dai-2-ji Super Robot Taisen","year":1999,"developer":"Winky Soft Co., Ltd.","url":"psx-chd-roms-d/Dai-2-kai%21%20Quiz%20Darake%20no%20Jinsei%20Game%20%28Japan%29.chd","filesize":8203120,"score":"","genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga > Turn-based > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p><em>Dai-2-ji Super Robot Taisen</em> is the PlayStation remake of the Famicom game that was included in the Super Robot Wars Complete Box compilation. The game's graphics, sound and gameplay have been completely rehauled to fit the style of Super Robot Wars F and Super Robot Wars F Final.</p>"},{"name":"Dai-3-ji Super Robot Taisen","year":1999,"developer":"Winky Soft Co., Ltd.","url":"psx-chd-roms-d/Dai-3-Ji%20Super%20Robot%20Taisen%20%28Japan%29.chd","filesize":347355189,"score":"","genres":"Role-playing (RPG) > Strategy > Isometric > Anime / Manga > Turn-based > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p><em>Dai-3-ji Super Robot Taisen</em> is the PlayStation enhanced remake of the Super Famicom game that was part of the Super Robot Wars Complete Box compilation. Its graphics, sound and gameplay have been completely rehauled to fit the style of Super Robot Wars F and Super Robot Wars F Final.</p>"},{"name":"Dai-4-ji Super Robot Taisen","year":1996,"developer":"Winky Soft Co., Ltd.","url":"psx-chd-roms-d/Dai-4-Ji%20Super%20Robot%20Taisen%20S%20%28Japan%29%20%28Rev%201%29.chd","filesize":224756939,"score":"","genres":"Strategy > Top-down > Anime / Manga > Turn-based > Tactical RPG > Turn-based strategy > Mecha / giant robot > Sci-fi / futuristic > War > Licensed","desc":"<p>The proper sequel to the  third game and EX.</p><p>Three months have passed since the third game, where a race of extraterrestrials, known as the \"Inspectors\", attacked Earth Federation forces (Mobile Suit Gundam). The Earth Federation, economically exhausted from conflicts, decides to impose the hegemony of Earth and to neglect the Space Colonies. In the midst of these reforms, rear admiral Jamitov (Zeta Gundam) forms the Titans, a pro-Earth group with a goal to enforce the will of the Federation on the Colonies. Due to the neglect, a rebellion begins in the Colonies, with the formation of the AEUG (Anti-Earth Union Group, also from Zeta Gundam). Meanwhile, Hamarn Karn (Zeta and ZZ Gundam) forms the Neue DC, a new group of Divine Crusaders (the villains from the first game) on a large mining asteroid. On Mars, two mysterious, yet very powerful figures, rebuild the same group with enormous amount of resources and technology. The Londo Bell battalion (Char's Counterattack), declared missing in the wake of the \"La-Gias incident\" (EX), is stripped of its former titles and becomes a rogue military group. Despite these circumstances, the threat of extraterrestrials still exists, with the arrival of the Guests...</p><p><em>Dai-4-ji Super Robot Taisen</em> is the finale of the Classic timeline of the series (until F and F Final came), before the story elements were revamped into Alpha series. This game introduced a number of significant features that became the mainstay of the entire franchise, such as a customizable player characters (appearance, sex, birth date, personality, robot type), upgradable weapons and pilot skills. The birth date determines the \"spirit powers\" (精神 <em>seishin</em>), which gives the players advantage over the enemy. The story branches depend on the actions of the player throughout the campaign. Also, a number of new robot franchises were added, such as Mazinkaiser (designed by the creator of the Mazinger franchise himself, Go Nagai), L-Gaim and Go Shogun.</p>"},{"name":"Daikokai Jidai IV: Porto Estado","year":1999,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-d/Daikoukai%20Jidai%20IV%20-%20Porto%20Estado%20%28Japan%29.chd","filesize":260360445,"score":"","genres":"Role-playing (RPG) > Simulation > 3rd-person (Other) > Diagonal-down > 2D scrolling > Fixed / flip-screen > Real-time > Managerial / business simulation > Menu structures > Point and select > Naval / watercraft > Europe > Historical events > Romance","desc":"<p><em>Daikōkai Jidai IV: Porto Estado</em> is the fourth game in the <em>Uncharted Waters / Daikōkai Jidai</em> series about sailing and trading, themed around the Age of Discovery, mixing simulation with role-playing elements. This entry deepens the elements of the European colonial expansion and colonial trade at that time such as signing contracts, exclusive trading ports, establishing trade routes, exploring and discovering treasure products etc. and they all reflect the special historical background of that era. Players choose from four different characters from four countries to begin their adventures, interacting with various characters giving the game a more RPG-like feel. </p><p><em>Porto Estado</em> simplifies the adventure and discovery aspect, with only a few major cities having monuments, and auto-navigation greatly increases the pace of the game. On the other hand ships, seamen and battles are more complicated and refined. To travel all over the world with confidence, players need to hire NPC sailors and put them into different post on the ship in order to make fully use of their abilities. A vessel physician can reduce disease consumption, a gunner can increase the hit ratio, and a captain can do hand-to-hand combat with captain of enemy fleet to avoid dangerous sea battles.</p>"},{"name":"Daikokai Jidai IV: Porto Estado (Shokai Genteiban)","year":1999,"developer":"","url":"psx-chd-roms-d/Daikoukai%20Jidai%20IV%20-%20Porto%20Estado%20%28Japan%29%20%28Shokai%20Genteiban%29.chd","filesize":260360444,"score":"","genres":"Special edition > Physical extras","desc":"<p>Besides a game copy of Daikōkai Jidai IV: Porto Estado, this Shokai Genteiban (Limited First Edition) also contains following items as well:</p><ul><li><p>An extra CD-ROM that contains demo video of the PlayStation 2 game Kessen. The disc is not a Video Compact Disc (VCD); it is made to be played on a PlayStation console.</p></li><li><p>A raffle ticket which should be sent back to Koei by players before December 31, 1999. Among them, 200 randomly chosen winners were presented a T-shirt features <em>Kessen</em>.</p></li></ul>"},{"name":"Daikokai Jidai: Gaiden","year":1997,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-d/Daikoukai%20Jidai%20Gaiden%20%28Japan%29%20%28Rev%201%29.chd","filesize":69963146,"score":"","genres":"Role-playing (RPG) > Simulation > Diagonal-down > Real-time > Managerial / business simulation > Direct control > Naval / watercraft > Romance","desc":"<p><em>Daikōkai Jidai: Gaiden</em> is a spin-off game of New Horizons (also known as <em>Daikōkai Jidai II</em> or <em>Uncharted Waters II</em>). The in-game world and mechanics are similar to <em>New Horizons</em> along with some adjustments. In comparison with <em>New Horizons</em>, the game's story is much more fulfilling, at the cost of reducing number of playable protagonists to two compared with <em>New Horizons's</em> six.</p>"},{"name":"Dakar '97","year":1997,"developer":"Elcom Co., Ltd.","url":"psx-chd-roms-d/Dakar%20%2797%20%28Japan%29.chd","filesize":342717814,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Africa","desc":"<p><em>Dakar '97</em> is a rally game with obvious focus on Paris-Dakar racing. Being developed in co-operation with Mitsubishi Motors, the game lets player drive some of the authentic cars from Dakar race. The game offers both Rally mode where you go through a set of courses with a selected vehicle, and Test Run mode where you train a specific track in a selected racing vehicle.</p><p>There are only four available racing cars, which include:</p><ul><li>Mitsubishi Pajero Prototype</li><li>Mitsubishi Pajero</li><li>Mitsubishi RVR Prototype</li><li>Isuzu Bighorn</li></ul><p>There are six different courses in total which vary from racing on the mountain roads and savannah to beaches and raw desert with only checkpoints to guide your way. Gameplay customization is pretty basic and only lets you choose between manual and automatic transmission, and actual racing can be done in either back-camera view or first person hood camera.</p>"},{"name":"Dalmatians 2","year":2003,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-d/Dalmatians%202%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":396200958,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select","desc":"<p><em>Dalmatians 2</em> features a Dingo Pictures animated film titled <em>...noch mehr Dalmatiner</em>. Despite the striking similarity between the cover art and the Disney franchise 101 Dalmatians it does not have any official link or licensing agreement.</p><p>The game also features six different sliding picture puzzles with 4 difficulty options (9, 12, 25, or 36 squares). There is also a coloring book mode where players can color in six different pictures.</p><p>The game was later released on the PlayStation 2 as <em>Dalmatians 3</em>. It's the same game as the PlayStation version but adds a jigsaw puzzle mode and a pair matching mini game.</p>"},{"name":"Dalmatians, The","year":2000,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-d/Dalmatians%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.chd","filesize":342470350,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select","desc":"<p>Follow a cuddly Dalmatian puppy and his wild-dog friends in the search for his missing sister.<br>As well as a great half-hour cartoon video, Dalmatians features an easy-to-use virtual colouring book and a challenging puzzle game.<br>Dalmatians is a story that all children will treasure.</p>"},{"name":"Dance Dance Revolution","year":1999,"developer":"Konami Co., Ltd.","url":"psx-chd-roms-d/Dance%20Dance%20Revolution%20%28USA%29.chd","filesize":186891771,"score":7.7,"genres":"Action > 3rd-person (Other) > Music / rhythm > Regional differences","desc":"<p>Simon has been taken to the next level in this arcade dancing game.  The game cues you which direction to step.  You use a special floor mat to step out the moves in rhythm.  The more moves you step out keeping the beat, the better your character does on screen.  You get to choose from 28 different songs to dance to.  It's possible to dance alone or with a friend.</p>"},{"name":"Dance Dance Revolution: 2nd Mix","year":1999,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Dance%20Dance%20Revolution%202nd%20Remix%20%28Japan%29.chd","filesize":436265866,"score":"","genres":"Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p>This is the second rendition of the popular dance simulation.  You follow the arrows as you step on the appropriate direction along with the beat.  With a wide range of difficulty settings, the game is a challenge for veterans while being easy enough to enjoy for beginners.  2nd mix comes back with some new songs and some new remixes of old favorites.  Challenge your friends head on or work together.  For an added challenge try doing Double which puts you on both dance pads (provided you have two).</p>"},{"name":"Dance Dance Revolution: 3rd Mix","year":2000,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-d/Dance%20Dance%20Revolution%203rd%20Mix%20%28Japan%29.chd","filesize":345897048,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p>The 3rd edition of the popular arcade dance rhythm game.  Different arrows scroll up to the top of the screen along with the music and you must step on the appropriate directions with the right timing.  A wide range of difficulty settings and songs makes it good for beginners and veterans.  With a dancepad connected, you need quick eyes and feet to master this game.  This edition adds a few new things for the home user like Diet Mode, which measures the amount of calories used during the game, Edit Mode to create your own dance steps, a Pocket Station mode, and also a linkup feature with Konami's arcade game Dance Mania.</p>"},{"name":"Dance Dance Revolution: 4th Mix","year":2001,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-d/Dance%20Dance%20Revolution%204th%20Mix%20%28Japan%29.chd","filesize":305648529,"score":"","genres":"Action > Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p>This music rhythm game challenges your eyes and your feet, with the appropriate dancepad controller.  Arrows appear on the screen and you must step in the right direction at the right time.  A wide range of difficulty makes it easy to learn for beginners while having extremely difficult songs for veterans.  The arcade version had about 140 songs, the Playstation version cuts it down to 48 tracks, but with the several new tracks and some oldies, make it an added value to the DDR fanatic.  All the features from the previous home versions are here: link mode, edit mode, diet mode, and plenty of other extras.</p>"},{"name":"Dance Dance Revolution: 5th Mix","year":2001,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Dance%20Dance%20Revolution%205th%20Mix%20%28Japan%29.chd","filesize":288078309,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p>The 5th edition of the popular arcade dance music game comes home.  Watch the arrows as they appear and step in the right direction at the right time.  Difficulty ranges from beginner to insane.  Diet mode offers you a fun way to exercise and lose weight.  Edit mode allows you to create your own dance steps to your favorite songs, and there are plenty of extra songs and features to unlock.</p>"},{"name":"Dance Dance Revolution: Best Hits","year":2000,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Dance%20Dance%20Revolution%20-%20Best%20Hits%20%28Japan%29.chd","filesize":208601970,"score":"","genres":"Action > Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Dance Dance Revolution: Best Hits</em> is a little song compilation dancing game of the first Dance Dance Revolution game, Dance Dance Revolution: 2nd Mix and Dance Dance Revolution: 3rd Mix from Konami.</p><p>The gameplay consists in stepping in the arrows at the right timing along the music to score points with play modes such as game mode with three sub modes as beginner (to play easy steps with a demonstration), normal (normal gameplay that consists to reach the next stage by dancing good) and nonstop (play courses of 4 songs to clear the stage and enter your high score at the best ranking); the diet mode to reach your calorie burning goal or play time goal with three modes such as standard (select songs by stage), program 1 (play slow songs consecutively) and program 2 (play all songs consecutively); the lesson mode to learn the dancing skills; the training mode to practice tricky steps and the edit mode to edit your steps and store them in a memory card.</p>"},{"name":"Dance Dance Revolution: Disney Mix","year":2000,"developer":"KCE Tokyo, Inc.","url":"psx-chd-roms-d/Dance%20Dance%20Revolution%20-%20Disney%20Mix%20%28USA%29.chd","filesize":123557337,"score":7.2,"genres":"Sports > Music / rhythm > Licensed","desc":"<p>What do you get when you combine the dancing of Dance Dance Revolution with Disney music?  The follow-up to the craze hit Dance Dance Revolution that features several remixes of Disney songs for you to stomp along with.</p>"},{"name":"Dance Dance Revolution: Extra Mix","year":2001,"developer":"KCE Tokyo, Inc.","url":"psx-chd-roms-d/Dance%20Dance%20Revolution%20-%20Extra%20Mix%20%28Japan%29.chd","filesize":302762363,"score":"","genres":"Action > Simulation > 3rd-person (Other) > Music / rhythm","desc":"<p>This \"Extra Mix\" follows the tradition of other Dance Dance Revolution titles: players have to press (or dance to) the corresponding arrows that scroll across the screen.  A wide selection of techno and club music comes on this release: roughly fifty songs are available either from the start or by accomplishing specific challenges.</p><p>Dance Dance Revolution: Extra Mix features the standard Solo as well as Diet, Training, Challenge, Endless and \"Nonstop Order\" modes.</p>"},{"name":"Dance Dance Revolution: Konamix","year":2002,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Dance%20Dance%20Revolution%20Konamix%20%28USA%29.chd","filesize":289202899,"score":7.9,"genres":"Action > Arcade > Music / rhythm","desc":"<p>The hottest dancing craze continues with a brand new sequel to Dance Dance Revolution. Straight from the arcades, step into the spotlight and put your skills to the test as you move to the groove. Get ready to dance the night away with all-new songs and game modes.  Konamix even has the all-popular \"Workout\" mode for those who want to burn calories!</p>"},{"name":"Dance:UK","year":2003,"developer":"Broadsword Interactive Limited"},{"name":"Dance:UK: eXtra Trax","year":2004,"developer":"Broadsword Interactive Limited"},{"name":"Dancing Blade: Katte ni Momotenshi! (Disk 1)","year":1998,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Dancing%20Blade%20Katte%20ni%20Momotenshi%21%20%28Japan%29%20%28Disc%201%29.chd","filesize":398955229,"score":"","genres":"Adventure > 3rd-person (Other) > Anime / Manga > Full Motion Video (FMV)","desc":"<p>Momohime is a young girl who was found inside a giant peach as a child. She is traveling with her friends, hoping to learn more about where she came from. They have heard of another mysterious young girl named Nayotake who lives in the capital, and are heading there to see if there is any connection, but when they reach the capital they find it under attack by strange creatures! Just what is going on, and is there any connection between Momohime, Nayotake, and the mysterious creatures?</p><p><em>Dancing Blade</em> is an anime FMV game. The player simply watches each scene as it proceeds; the only interaction is occasionally selecting dialogue choices when prompted. Depending on the player's choices, they will reach one of four different endings. Once an ending is reached, the scenario leading to that ending can later be replayed without interruption. Any scene already viewed can also be freely revisited.</p>"},{"name":"Dancing Blade: Katte ni Momotenshi! (Disk 2)","year":1998,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Dancing%20Blade%20Katte%20ni%20Momotenshi%21%20%28Japan%29%20%28Disc%202%29.chd","filesize":438758825,"score":"","genres":"Adventure > 3rd-person (Other) > Anime / Manga > Full Motion Video (FMV)","desc":"<p>Momohime is a young girl who was found inside a giant peach as a child. She is traveling with her friends, hoping to learn more about where she came from. They have heard of another mysterious young girl named Nayotake who lives in the capital, and are heading there to see if there is any connection, but when they reach the capital they find it under attack by strange creatures! Just what is going on, and is there any connection between Momohime, Nayotake, and the mysterious creatures?</p><p><em>Dancing Blade</em> is an anime FMV game. The player simply watches each scene as it proceeds; the only interaction is occasionally selecting dialogue choices when prompted. Depending on the player's choices, they will reach one of four different endings. Once an ending is reached, the scenario leading to that ending can later be replayed without interruption. Any scene already viewed can also be freely revisited.</p>"},{"name":"Dancing Blade: Katte ni Momotenshi! (Disk 3)","year":1998,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Dancing%20Blade%20Katte%20ni%20Momotenshi%21%20%28Japan%29%20%28Disc%203%29.chd","filesize":306100493,"score":"","genres":"Adventure > 3rd-person (Other) > Anime / Manga > Full Motion Video (FMV)","desc":"<p>Momohime is a young girl who was found inside a giant peach as a child. She is traveling with her friends, hoping to learn more about where she came from. They have heard of another mysterious young girl named Nayotake who lives in the capital, and are heading there to see if there is any connection, but when they reach the capital they find it under attack by strange creatures! Just what is going on, and is there any connection between Momohime, Nayotake, and the mysterious creatures?</p><p><em>Dancing Blade</em> is an anime FMV game. The player simply watches each scene as it proceeds; the only interaction is occasionally selecting dialogue choices when prompted. Depending on the player's choices, they will reach one of four different endings. Once an ending is reached, the scenario leading to that ending can later be replayed without interruption. Any scene already viewed can also be freely revisited.</p>"},{"name":"Dancing Stage Euromix","year":2000,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Dancing%20Stage%20-%20Euromix%20%28Europe%29.chd","filesize":178137525,"score":7.4,"genres":"Simulation > Music / rhythm","desc":"<p>The European version of Dance Dance Revolution. This edition of the game features many well known artists and quite a few different song stylings as well. The gameplay is the same as in all the DDR/Dancing Stage games which means that one must tap different directions to the music with dancing mat or controller.</p><p>Songlist:</p><ul><li>So Good - Boyzone</li><li>Word Up - Cameo</li><li>More Than This '99 - Emmie</li><li>Video Killed The Radio Star - The Buggles</li><li>Make A Jam - Konami Original</li><li>Let Them Move - N. M. R</li><li>Silent Hill - Konami Original</li><li>Put Your Faith In Me . Uzi-lay</li><li>Keep On Movin' - Konami Original</li><li>Make It Better - Mitsu-O</li><li>Brilliant 2U - Naoki</li><li>La Senorita - Konami Original</li><li>End of the Century - Konami Original</li><li>Dynamite Rave - Konami Original</li><li>Afronova - Konami Original</li><li>Dead End - Konami Original</li><li>Paranoia - 180</li><li>Paranoia Rebirth - Konami Original</li><li>Trip Machine - De-Sire</li><li>Luv To Me - Konami Original</li><li>Magic Alex Presents Resonance - Magic Alex</li><li>(Mucho Mambo)Sway - Shaft</li><li>Rushing - Loni Clark</li><li>I Will Survive - Gloria Gaynor</li></ul>"},{"name":"Dancing Stage Fever","year":2003,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Dancing%20Stage%20Fever%20%28Europe%29.chd","filesize":105450100,"score":"","genres":"Action > Music / rhythm","desc":"<p>A unique dancing simulation game that uses your feet, get up and dance to such classics as \"All That She Wants\" - Ace Of Base, \"Wannabe\" - Spice Girls &amp; \"One Step Beyond\" - Madness.</p><p>You'll need quick reflexes and great timing to step on the correct arrows at the right time.  So take to the dance floor, get into the groove and show off your moves!</p><p>There are many different songs to dance to, multiple difficulty levels, lessons for beginners and a workout mode that tracks the number of calories you lose while playing.</p><p>Also features tracks from Squeeze and the Vbirds.</p>"},{"name":"Dancing Stage Fusion","year":2004,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Dancing%20Stage%20Fusion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":135257581,"score":"","genres":"Action > 1st-person > Music / rhythm","desc":"<p><em>Dancing Stage Fusion</em> is the third DS game on PS2.The object of the game is to \"dance\", which means that the player must hit the arrows that travel up the screen at the right time, thus scoring and unlocking more songs and burning some fat in the process.</p><p>The game features 54 songs from which 21 are licensed and the other 33 are made for the game. The licensed hits are:</p><ul><li>Chihuahua 2002 - DJ Bobo</li><li>Come Into My World - Kylie Minogue</li><li>Danger! High Voltage - Electric Six</li><li>Familiar Feeling - Moloko</li><li>Freak Like Me - Sugababes</li><li>Good Luck - Basement Jack feat. Lisa Kekaula</li><li>Gotta Get Thru This - Daniel Bedingsfield</li><li>Go West - Pet Shop Boys</li><li>Heaven &amp; Earth - POP!</li><li>I Believe In A Thing Called Love - The Darkness</li><li>It's Raining Men (Almighty Mix) - Geri Halliwell</li><li>Kids In America - Kim Wilde</li><li>Mickey - Toni Basil</li><li>Move Your Feet - Junior Senior</li><li>OK - Big Brovaz</li><li>Promises - Kylie Minogue</li><li>Rappers Delight - The Sugarhill Gang</li><li>Sexiest Man in Jamaica - Baker/Claxton/Prince Buster</li><li>Somebody Like You - Atomic Kitten</li><li>Sunlight</li><li>Superstar - Jamelia</li></ul>"},{"name":"Dancing Stage Party Edition","year":2002,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Dancing%20Stage%20-%20Party%20Edition%20%28Europe%29.chd","filesize":287560116,"score":"","genres":"Action > Music / rhythm","desc":"<p>Based on the Dance Dance Revolution 4th Mix engine, follow on-screen arrows to learn the steps or create your own original dance routine.</p><p>Features four gameplay modes - training, practice, arcade and workout (with calorie counter).</p><p>51 tracks including songs by Kylie, S-Club, Bloodhound Gang, The Cardigans and Chaka Khan.</p>"},{"name":"Dancing Stage: featuring Dreams Come True","year":2000,"developer":"KCE Tokyo, Inc.","url":"psx-chd-roms-d/Dancing%20Stage%20featuring%20Dreams%20Come%20True%20%28Japan%29.chd","filesize":80008866,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm > Timed input > Licensed","desc":"<p>Side story of the Dance Dance Revolution series featuring Japanese pop group Dreams Come True. As before, the player has to press the direction of the arrows as they come up the screen in true Dance Dance Revolution style.</p>"},{"name":"Dancing Stage: featuring True Kiss Destination","year":1999,"developer":"Konami Co., Ltd.","url":"psx-chd-roms-d/Dancing%20Stage%20featuring%20True%20Kiss%20Destination%20%28Japan%29.chd","filesize":135293924,"score":"","genres":"Action > 3rd-person (Other) > Arcade > Music / rhythm > Licensed","desc":"<p><em>Dancing Stage: featuring True Kiss Destination</em> is the first Dance Dance Revolution spin-off game released only in Japan from Konami with songs of the Japanese music group called True Kiss Destination and Konami original songs as well.</p><p>The gameplay consists in the same arrow stepping at right timing along the music as the original DDR games, the PlayStation version features game modes such as arcade (the original conversion of the arcade game), event mode (exclusive console version), free dance mode (to play as the workout/diet mode) and training/edit mode (to practice tricky steps and edit your custom steps and store them in a memory card).</p>"},{"name":"Dangan","year":2000,"developer":"Mediamuse","url":"psx-chd-roms-d/Dangan%20%28Japan%29.chd","filesize":205901930,"score":"","genres":"Action > Diagonal-down > Anime / Manga > Shooter > Contemporary","desc":"<p>This is the 3D action shooter that seeks \"realism\"!<br>The goal for Jack and Kate, who are player characters, is to beat the political secret society Eden in order to rescue the kidnapped Claire.<br>Fight with five types of firearms including machine guns and laser guns, sometimes even use physical combat.<br>The key to victory is how you can effectively use a limited means of attack and how to utilize the opportunities on the battlefield!</p>"},{"name":"Danger Girl","year":2000,"developer":"n-Space, Inc.","url":"psx-chd-roms-d/Danger%20Girl%20%28Europe%29.chd","filesize":372617798,"score":6,"genres":"Action > Behind view > Quick Time Events (QTEs) > Licensed","desc":"<p>3rd Person Action game based on the hit comic book from J.Scott Campbell.</p><p>In Danger Girl, you play as one of three sexy, adventurous, feminine agents with a wide array of weapons and spy gear. Choose between Abbey Chase, the blond team leader; Sydney, a sharpshooter from Australia; and a character who is new to the series. You'll travel all over the world in 14 levels and explore vast outdoor and indoor areas in six different environments. The game features a wide variety of play mechanics and numerous prerendered interstitial scenes that advance a story line that takes place between the first and second story arcs of the comic book.</p>"},{"name":"Dare Devil Derby 3D","year":1996,"developer":"Supersonic Software Ltd.","url":"psx-chd-roms-d/Dare%20Devil%20Derby%203D%20%28USA%29.chd","filesize":290625137,"score":7,"genres":"Action > Racing / Driving > Top-down > Arcade","desc":"<p><em>Dare Devil Derby 3D</em> is a cartoonish-type of destruction derby that lets the player take control of 8 unique characters and over 30 different tracks, ranging from jungles, canyons, city streets, underwater, outer space and various other three dimensionally rendered terrain. Power-ups can also be picked up and used to give more power and speed to a players car or even a weapon to knock out rivals.</p><p>There are a plethora of single player modes, ranging from single one on one races to Knockouts, which consisted of a demolition derby where the winner was the last car still operable. There is also a grand prix mode where the player races in a series of 10 races and required to finish in the top 3 in order to advance to the next. At the end of these 10 races, if a player meets a requirement of points they can then compete in a World Series of Racing to become champion.</p><p>Eight friends can also go against each other simultaneously utilizing the multi-tap adapter.</p>"},{"name":"Darius Gaiden","year":1996,"developer":"Taito Corporation","url":"psx-chd-roms-d/Darius%20Gaiden%20%28Japan%29.chd","filesize":292647544,"score":7.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Shooter > Sci-fi / futuristic","desc":"<p>Take command of your Silverhawk fighters once again as you battle to take back the planet Darius from the evil forces that had overpowered it! Converted from the Taito 1994 arcade game for the Windows platform (9x and NT).</p>"},{"name":"Dark Legend","year":1996,"developer":"Data East Corporation"},{"name":"Dark Seed","year":1995,"developer":"Cyberdreams, Inc.","url":"psx-chd-roms-d/Dark%20Seed%20%28Japan%29.chd","filesize":33954757,"score":6.9,"genres":"Adventure > 3rd-person (Other) > Fixed / flip-screen > Graphic adventure > Puzzle elements > Point and select > Horror","desc":"<p><em>Dark Seed</em> is an adventure game which capitalizes on the drawings of famous horror designer H. R. Giger as a source of background artwork and inspiration.</p><p>You play Mike Dawson, an ad company manager who, in pursuit of his goal in life to become a writer, purchases a solitary mansion in a small town called Woodland Hills. Although the low cost and hush-hush transactions when purchasing the house do raise your suspicion, the solitary environment and sheer beauty of the house crush common sense and you decide to buy the house. That's when trouble begin. Upon reaching the house, you suddenly feel tired. You find a bed and fall asleep...</p><p>... and wake up from a terrible dream, only to find out that your life has just become a worse nightmare: an unknown source has implanted a seed of darkness in your mind, and you only have three days to find a way to stop it.</p>"},{"name":"Dark Seed II","year":1997,"developer":"Destiny Software Productions, Inc.","url":"psx-chd-roms-d/Dark%20Seed%20II%20%28Japan%29.chd","filesize":285906410,"score":7,"genres":"Adventure > Side view > Full Motion Video (FMV) > Detective / mystery > Horror","desc":"<p><em>Dark Seed II</em> continues the nightmare of Mike Dawson as he recovers from a nervous breakdown from his earlier encounters with the Ancients. Back in his hometown, Mike's high school sweetheart, Rita, is found murdered after the high school reunion. Unfortunately, Mike cannot remember much about that night, even though others saw him with Rita. Now, as the prime suspect, he must find a way to prove his innocence.</p><p>The designs of H.R. Giger are pivotal in this horror-tinged point 'n click adventure. Players will be swapping between the Normal World and the Dark World, with 75 prerendered 3D locations in total. There are 40 characters to interact with. The goal is to overthrow the Behemoth of the Dark World and cut through the corruption of the Normal World.</p><p>Movement, action and dialogue interaction modes are toggled between using the right mouse button, with the full screen used for location display unless the game menu or inventory bars are called into use.</p>"},{"name":"Dark Tales: From the Lost Soul","year":1999,"developer":"","url":"psx-chd-roms-d/Dark%20Tales%20-%20From%20the%20Lost%20Soul%20%28Japan%29.chd","filesize":378091612,"score":"","genres":"Adventure > 1st-person > Cinematic camera > Full Motion Video (FMV) > Real-time > Quick Time Events (QTEs) > Shooter > Direct control > Horror","desc":"<p><em>Dark Tales: From the Lost Soul</em> is a Japanese exclusive horror Choose-Your-Own-Adventure game featuring 3 stories unrelated to each other. The game starts at a bar with strange guests and a creepy senior host who stars telling the stories to the guests.</p><p>The stories are as follows:<em> </em><em>Cat &amp; Mouse:</em>* A detective on the trail of a Christmas Eve serial killer is led to an abandoned amusement park, there he must go through all the traps and avoid the killer's sudden attacks to apprehend him.</p><ul><li><strong>Ghost Writer:</strong> Players take the role of a writer who has a deadline of 5 days to finish a new book. The writer receives a mysterious CD through the mail and after installing it, he starts getting nightmares and if he survives through them and wakes up, he finds a part of the story being written for him.</li><li><strong>The Honeymoon:</strong> A newlywed couple is being chased by a mysterious driver in a police car. Will they manage to survive and avoid the driver?</li></ul><p>The game features full motion videos with most games not featuring any people on screen. Gameplay involves making choices on what to use or where to go to at set periods of time, quick-time events where players dodge attacks from their stalkers and traps as well as shooting segments where players try to shoot their enemies with a limited amount of ammo.</p><p>Each story has multiple endings and successive playthroughs or game overs will allow players to skip the videos they've already seen.</p><p>The Honeymoon story has the most endings and after unlocking each ending features flashbacks which give hints to players how to unlock the endings they haven't seen yet.</p>"},{"name":"Darklight Conflict","year":1997,"developer":"Rage Games Ltd.","url":"psx-chd-roms-d/Darklight%20Conflict%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.chd","filesize":273161855,"score":6.8,"genres":"Action > Simulation > 3rd-person (Other) > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>A space combat game like Wing Commander; you control a space ship, as the lone man trying to save humanity from not one, but two alien races. It also has multiplayer modes like Race and Tag for IPX network users.</p>"},{"name":"Darkstalkers 3","year":1998,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-d/Darkstalkers%203%20%28Europe%29.chd","filesize":506504281,"score":7.7,"genres":"Action > Side view > Arcade > Fighting > Horror > Martial arts","desc":"<p>This is the 3rd in the Darkstalkers series. It plays much the same as the first, but features better animation, more playable characters, and a deeper storyline.</p><p>Jedah, the \"Lord of Vampire\", has summoned all of the Night Warriors to his realm to be assimilated into his being. Of course, this serves as a great excuse to have more one-on-one fights...</p><p>Play as Jedah, B. B. Hood, Q-Bee, Lilith, Demitri, Morrigan, Anakaris, Victor, L. Raptor, Hsien-Ko, J. Talbain, Felicia, Rikuo, Sasquatch, Bishamon, Donovan, Pyron or Huitzil, and conquer the enemy.</p>"},{"name":"Darkstalkers: The Night Warriors","year":1996,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-d/Darkstalkers%20-%20The%20Night%20Warriors%20%28Europe%29.chd","filesize":305347715,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Horror","desc":"<p><em>Darkstalkers: The Night Warriors</em> is a 2D one-on-one fighting game. Select one of the ten available fighters and two unlockable boss characters, each based on a classic monster (vampire, werewolf, golem, zombie, succubus, mummy, catwoman, oni, merman, sasquatch, robot, alien.) and fight it out in various horror-themed locations. Gameplay is mostly concentrated on special moves and combos.</p>"},{"name":"Darkstone","year":2001,"developer":"Delphine Software International","url":"psx-chd-roms-d/Darkstone%20%28USA%29.chd","filesize":393044462,"score":7.1,"genres":"Role-playing (RPG) > Diagonal-down > Action RPG > Fantasy","desc":"<p>Darkstone is a Diablo clone. But there is a difference one will recognize immediately: it is in 3D. But this is not the only \"improvement\"--the second most important thing is probably that the player is in control of two characters. The other character is computer controlled and the player can switch between them at any time. Also, Darkstone has lots of new spells and skills. The player will be walking through huge woods, have to solve a lot of riddles and descend into deep and dark dungeons.</p>"},{"name":"Dave Mirra Freestyle BMX","year":2000,"developer":"Z-Axis, Ltd.","url":"psx-chd-roms-d/Dave%20Mirra%20Freestyle%20BMX%20%28Europe%29.chd","filesize":180591971,"score":7.2,"genres":"Sports > Behind view > Tricks / stunts > Bike / bicycling > Licensed","desc":"<p>Tony Hawk proved the skating games can work to great effect. Now Dave Mirra is here to prove that BMX is here to stay, thanks to the developers at Z-Axis.</p><p>Choose from all of the current crop of BMX champs, including 10 times world champion Dave Mirra, Ryan Nyquist, Joey Garcia, Shaun Butler &amp; heaps more, and ride your way through 12 highly detailed environments, with vert ramps, huge jumps and track racing. Multiplayer gaming is also thrown in, allowing two players to go head-to-head in a game of B-M-X (a unique variation of the HORSE basketball game).</p><p>All this plus official sponsors clothing, bikes and advertising boards plus a huge soundtrack featuring Cypress Hill, Deftones and more.</p>"},{"name":"Dave Mirra Freestyle BMX: Maximum Remix","year":2001,"developer":"Z-Axis, Ltd.","url":"psx-chd-roms-d/Dave%20Mirra%20Freestyle%20BMX%20-%20Maximum%20Remix%20%28Europe%29.chd","filesize":220688682,"score":6.8,"genres":"Sports > 3rd-person (Other) > Tricks / stunts > Bike / bicycling","desc":"<p>This is the original Dave Mirra Freestyle BMX but it adds 8 new levels, new music, new challenges for the original 12 levels, new characters and a soundtrack to the game comes with it.</p><p>The basic play is as follows: Grind, jump, and pull tricks like never before in 20 free roaming levels across 5 environments: Hometown, Greenville, Woodward, Pro Tour, and the Acclaim Max Games. Some levels give you challenges, such as to jump something, pull a certain spin, etc. The other levels are \"competition runs\" where you have 2 minutes to perform a cool runs with the greatest of tricks up your sleeve. There are many, many secrets in this game.</p>"},{"name":"David Beckham Soccer","year":2002,"developer":"Rage Games Ltd.","url":"psx-chd-roms-d/David%20Beckham%20Soccer%20%28Europe%29.chd","filesize":129357020,"score":6.3,"genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p>Endorsed by the then England and Manchester United captain and international superstar, David Beckham Soccer is the last of Rage long tradition in developing soccer games.It includes both national and club teams (from England, France, Germany, Italy and Spain), plus the ability to create custom teams,  with details ranging from the usual name, strips and colours to the stadium. Other than Beckham himself, no player is licensed (likeness is preserved, but names are replaced with phonetic equivalents, such as “Owin” or “Zanetee”), but the editor also allows the player to customize each player and team.Game modes include friendly, club season, several international cups (including the defunct Home Championship), Classic Matches (some featuring the highlights of Beckham's career, others just classic matches), Beat Brazil, where the player starts with France, and tries to beat Brazil with a progressively weaker team, Survival, where the player face top international teams, with goals against carrying over, until the player loses a match, and Train With Beckham, a series of  drill minigames destined to teach the basics of the game and unlock “secrets”. </p><p>Gameplay is similar to previous titles developed by the company (most notably Microsoft Football 2000 and UEFA Striker), and not unlike Beckham, has its strong point during dead ball situations, where the player can choose either to use a set play to get the defense offguard, or take a direct shot or swerving pass using the traditional arrow indicator.In terms of options, the game doesn’t offer much to tweak, only bookings, offsides, injuries, match length and the decider (simple or golden goal overtime and penalty shootout)</p>"},{"name":"Davis Cup Complete Tennis","year":1996,"developer":"The Dome Software Developments","url":"psx-chd-roms-d/Davis%20Cup%20Complete%20Tennis%20%28Europe%29.chd","filesize":161994767,"score":5.8,"genres":"Sports > 3rd-person (Other) > Tennis > Licensed","desc":"<p>The Davis Cup is tennis' equivalent of soccer's World Cup - a competition between teams of men in their sport representing their countries.  16 countries qualify for the tournament and you can choose from among 48 players - all with different attributes and skills.  Locations for the matches vary from each of the 16 countries including the U.S., Sweden and Italy.  The courts also vary between grass, clay, concrete and wood and the ball will react differently on each.  </p><p>You can take to the practice court first to perfect your serves, lobs, smashes and volleys.  Then you can have a quick singles match against a random opponent, have a doubles match with a friend or even play a 4-player game using multitap.  There's also the option of playing a \"winner moves on\" series of games, play in a league, or join the Davis Cup tournament.</p>"},{"name":"DBZ: Dead Ball Zone","year":1998,"developer":"Rage Games Ltd.","url":"psx-chd-roms-d/DBZ%20-%20Dead%20Ball%20Zone%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":252799270,"score":6,"genres":"Action > Sports > Sci-fi / futuristic","desc":"<p><em>Savage Arena</em> is a futuristic handball game, funded by local crime lords for amusement. The game is violent, fast and with few rules.</p><p>There are three different weapons that are available in Savage Arena: Guns, Bombs and Chainsaws. Players are in teams and teams are fighting. As players take damage, they will begin to vomit on the arena floors, which means that they are nearing incapacitation.</p><p>The Savage Arena courts has three scoring zones, with more points being awarded for scoring goals from difficult play positions.</p><p>Each Savage Arena player has a default playing position in the game. There are six different playing positions; Goalkeeper, Defender, Sweeper, Winger, Forward, and Midfielder.</p>"},{"name":"Dead in the Water","year":1998,"developer":"Player 1","url":"psx-chd-roms-d/Dead%20in%20the%20Water%20%28USA%29.chd","filesize":339388585,"score":6.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Shooter > Naval / watercraft > Vehicular combat","desc":"<p>A 3D Battle game that pits the players in heavily armed boats in fully destructable arena's. This is a a Vehicular Combat Game similar in basic structure to Twisted Metal or Vigilante 8. There are many characters to choose from, each with their own unique boat and then is entered into an arena to race against other contestants while also trying to score points by shooting and destroying the other boats.</p>"},{"name":"Dead or Alive","year":1998,"developer":"Tecmo, Ltd.","url":"psx-chd-roms-d/Dead%20or%20Alive%20%28Europe%29.chd","filesize":369425906,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting","desc":"<p>The first in the Dead or Alive series, and features many of the same features that has made the DoA series so popular today; somewhat realistic combat, good character design, and scantily clad women whose breasts bounce a lot.</p><p>The game doesn't mess too much with a background story- it's a 3D one on one fighter that takes place within an arena of limited space.  Each character has their own unique way of fighting, their own abilities, and even their own hobbies and likes.  (For example, Ryu Hayabusa- yes, he of Ninja Gaiden fame- likes sushi, mountain climbing, and fishing.)</p>"},{"name":"Debut 21","year":1998,"developer":"ImageWorks","url":"psx-chd-roms-d/Debut%2021%20%28Japan%29.chd","filesize":188540582,"score":"","genres":"Simulation > Anime / Manga > Managerial / business simulation > Menu structures > Japan (Modern/Futuristic) > Sci-fi / futuristic","desc":"<p><em>Debut 21</em> is a futuristic spinoff/spiritual successor to Tanjō: Debut; as with that game, the player is tasked with raising an idol as they become popular and managing their stats, but the twist here is that the game is set in the year 2020, and the idol you are tasked with managing is an android, named Ai Kanzaki. The player is tasked with guiding her through an entire in-game year, raising her stats and keeping her stress level within reasonable limits. In contrast to its 2D predecessor, this game uses real-time 3D graphics.</p>"},{"name":"Deception III: Dark Delusion","year":1999,"developer":"Tecmo, Ltd.","url":"psx-chd-roms-d/Deception%20III%20-%20Dark%20Delusion%20%28USA%29.chd","filesize":422218616,"score":7.2,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Real-time > Real-time strategy > Fantasy > Horror","desc":"<p>In <em>Dark Delusion</em>, you play as Reina, a girl who was kidnapped with her family and taken away via ship to a far off kingdom and may be used for some unpleasant purposes. After escape, she must try to survive while helping the people that helped her. Her persecutors have interest in a mysterious gem brooch she owns, which gives her the power of controlling traps (pendulums, bombs, claws, arrows, and other lethal traps). </p><p>This is the third game in the Deception series. You control the character in a 3D environment in which you place traps to kill your persecutors (who have weapons). It's a real-time game with elements of strategy and role-playing, which allows you to use a system of timing and skill of activating traps through the rooms of a medieval castle as the opponents try to kill you. As you activate the traps, you can link them to activate each other, in way to increase the number of combos.</p><p>Depending on how you kill your opponents, and how many of them, determines how much \"Ark\" (money) you get to develop better traps. They can be created by using ancient black magic: emblems (fire, ice, thunder, poison, etc.), orbs (that improve the power of the trap) and rings (automatic, charge, damage, zero, etc.). </p><p>There are many other traps set over the environment, working automatically out of control of the player (spears, spikes, fans, etc.). They also can be used to increase the damage inflicted at the invaders. The game features over 2000 different traps, four modes of play (story, mission, training, license), trap element system (linking traps), and multiple endings that change according the choices you take through the story mode.</p>"},{"name":"Deep Freeze","year":1999,"developer":"Talon, Inc.","url":"psx-chd-roms-d/Deep%20Freeze%20%28Japan%29.chd","filesize":290160567,"score":"","genres":"Action > 3rd-person (Other) > Shooter > Sci-fi / futuristic > Spy / espionage","desc":"<p>In the year 2001, the world has changed, and terrorism has changed along with it. The terrorist organization Hephaestus has become extremely powerful, and in response, the INTER-ANTS (International Anti-Terrorist Service) has come into existence. As Jack Wired, commander of an ANTS squad, you and your teammates will go into battle to resolve hostage situations and remove the terrorist threats.</p><p><em>Deep Freeze</em> is a 3D action-shooting game with pre-rendered backgrounds, similar to such games as Resident Evil and Parasite Eve only with a stronger action focus. Choose a partner from your squad for each mission, then make your way through each situation to eliminate the threat. You can give your partner orders, as well as change formation.</p><p>The game features full voice acting completely in English, a rarity for a Japanese exclusive title.</p>"},{"name":"Defcon 5","year":1995,"developer":"Millennium Interactive Ltd.","url":"psx-chd-roms-d/Defcon%205%20%28Europe%29.chd","filesize":282331342,"score":6.3,"genres":"Action > Strategy > 1st-person > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In the far future, conflict is at an all-time low and outdated defence bases are being vacated and replaced with automated software. You play as an engineer sent to update one such base. Just after uploading the automating code, the base is suddenly invaded by unknown assailants from the air and ground. You must rely on your wits and the defence software to fend them off.</p><p>The main game takes place in a first-person view inside the complex. Trams connect the maze-like living areas to a handful of manned turrets outside. You must shuttle between shooting down waves of fighters in the turrets, and scouring the base levels for card keys during the downtime.</p><p>A third consideration is the \"Virtual Operating System\" controlling all major base functions. You use this interface to repair damage from attacks, monitor intruders, and place robot sentries to guard key passages. As you find more access keys, you can increase the software's efficiency to the point that you can command turrets remotely, or set them to auto-attack with a high degree of success. </p><p>As defending the base becomes more automated and efficient, you have more time to search the levels for keys. Your ultimate goal is to find the clearance to self-destruct the base, defend your escape shuttle, and get out alive.</p>"},{"name":"Delta Force: Urban Warfare","year":2002,"developer":"Rebellion Developments Ltd.","url":"psx-chd-roms-d/Delta%20Force%20Urban%20Warfare%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":113856049,"score":6.4,"genres":"Action > 1st-person > Shooter > Direct control > Contemporary > Regional differences","desc":"<p><em>Delta Force: Urban Warfare</em> is an urban-themed first-person shooter in the Delta Force series. Set in a variety of city locations, the player takes the role of an elite US army Special Forces soldier, using a variety of weapons to tackle missions as diverse as foiling a bank robbery, and rescuing hostages from terrorist forces.</p><p>The player must learn to use the full range of weapons at their disposal, and special equipment such as nightvision and heat-sensing goggles. Some tactical thinking is needed to get through, with good use of cover, and the subtle use of light and dark areas is essential.</p>"},{"name":"Demolition Racer","year":1999,"developer":"The Pitbull Syndicate Limited","url":"psx-chd-roms-d/Demolition%20Racer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":180481164,"score":6.7,"genres":"Action > Racing / Driving > 1st-person > Behind view > Top-down","desc":"<p>Demolition Racer is a racing game with a twist.  Rather than a game that just requires you to try and win the race, this game gives you points to destroy the other racers' cars.  The game has many styles of game play so you don't have to play the same style each game.</p><p>There are 5 game styles in the Single Race section of the game.  This section does not count towards unlocking cars or tracks.  It is for practice and just plain fun.  The main style is Demolition.</p><p>In Demolition, you race against other cars around the track and get points for hitting them, spinning them in circles and knocking them into the wall.  You also get a big bonus for landing on top of a car which will immediately destroy the car.  When you finish the race, your final position isfound by multiplying the points you got from hitting the other cars with the points that you got for the position you finished in.  So if you finish first, but never hit anyone, you won't win the race.</p><p>The next style is The Chase.  This style is your normal race game.  You can still take damage and so can the other cars, but you are only trying to win the race.  You don't get any points for hitting the other cars.</p><p>Chicken is another style.  It is the same as The Chase except that you drive in the opposite direction as everyone else.  This can slow you down when you run into the cars coming around from the other direction.</p><p>The next 2 game styles aren't done on race tracks.  They are done in an arena.  This is a circle area which may have hills in it where you just try to destroy cars.  The first of these is Last Man Standing.  In this style, you try to destroy every car without being destroyed yourself.  You can still win if youaren't the last car by making a lot of points by hitting other cars.  The scoring is calculated the same as the Demolition style.</p><p>The final Single Race style is Suicide.  In this style, you try to destroy yourself before any others are destroyed.  You don't get any points for hitting other cars in this style.</p><p>Besides the Single Race, there is also League Racing.  In League racing, you are trying to beat a set of tracks.  There are 4 leagues on tracks and one league in the arena.  In order to beat a track (or arena), you must place in a certain position.  The first league starts out easy; you can finish in 5th place and still beat the track and go on to the next one.  However, as you go up in difficulty of leagues, you will eventually have to place 1st on every track in the league to beat it.  A league will usually have 5-10 tracks to beat.</p><p>After you beat a league, you will unlock cars, tracks and other leagues.  There are 11 tracks, 3 arenas and 8 cars that you can get.  The cars can be customized with colors and logos.  You can also have portraits of the racers on top of the cars.</p>"},{"name":"Densha de Go!","year":1997,"developer":"Taito GM R&D Sect. #2","url":"psx-chd-roms-d/Densha%20de%20Go%21%20%28Japan%29.chd","filesize":405051635,"score":"","genres":"Simulation > 1st-person > Train","desc":"<p>Based on the 1996 arcade game, <em>Densha de Go!</em> was one of the first commercial train-driving simulation games, and went on to spawn numerous successors.</p><p>The player can choose from a variety of tracks and trains and will then have to drive the train to the designated stations while sticking to the tight schedule, stopping exactly at the marked positions, obeying all signs and signals, and ensuring passenger safety and comfort.</p><p>Whenever the player makes a mistake, points are deducted from a counter which at the start of each round is initialized to a value depending on the selected difficulty. If it reaches zero, the game is over.</p><p>The following lines are featured:<em> </em><em>Sagano Main Line</em>* (Sanin Line) from Kameoka to Kyoto</p><ul><li><strong>Keihin-Tōhoku Line</strong> from Shinagawa to Yokohama</li><li><strong>Tōkaidō Main Line</strong> (JR Kyoto Line) from Kyoto to Osaka</li><li><strong>Yamanote Line</strong> (Inner Circle) from Shibuya to Tokyo Station</li><li><strong>Tōkaidō Main Line EX</strong> from Takatsuki to Osaka, part of the rapid Tōkaidō Main Line from the original version, but this time with stops at every station (Windows only)</li><li><strong>Sagano Line EX</strong> from Kameoka to Kyoto, without the shortcut from Saga-Arashiyama to Tambaguchi from the original version (Windows only)</li></ul>"},{"name":"Densha de Go! 2","year":1999,"developer":"Taito GM R&D Sect. #2","url":"psx-chd-roms-d/Densha%20de%20Go%21%202%20%28Japan%29%20%28Rev%201%29.chd","filesize":421132632,"score":"","genres":"Simulation > 1st-person > Train","desc":"<p>The 1998 sequel of the popular Japanese train driving game by Taito has once again been ported to various home systems. For the first time on the PlayStation, it is possible to drive through the snow, and take a seat in the cockpit of a Shinkansen bullet train.</p><p>The gameplay is more arcade than simulation. The focus is on stopping at the stations at the perfect moment and position, keeping up with the schedule, obeying signals and speed limits, and ensuring the safety and comfort of the passengers. Mistakes result in points being deducted from a counter. If it reaches 0, the game is over.</p><p>The following routes are available:* Hokuhoku Line from Naoetsu to Uragawara</p><ul><li>Tōhoku Shinkansen from Morioka to Shin-Hanamaki</li><li>Akita Shinkansen from Akita to Ōmagari</li><li>Keihin-Tohoku Line from Shinagawa to Ueno</li><li>Osaka Loop Line from Osaka to Tennōji (not in the Arcade original)</li><li>Kagoshima Main Line from Hakata to Kokura (only in PlayStation and Windows versions)</li></ul>"},{"name":"Densha de Go! Nagoya Railroad","year":2000,"developer":"Taito Corporation","url":"psx-chd-roms-d/Densha%20de%20Go%21%20Nagoya%20Tetsudou%20Hen%20%28Japan%29.chd","filesize":408246563,"score":"","genres":"Simulation > Train","desc":"<p>You play as a train engineer which serve the Meitetsu Nagoya line in Japan. There are many kinds of trains that you can drive, from express trains to monorails. Some trains are locked until you finish a mission, for example you can only drive monorails until you've finished the commuter and express train missions. All of the game parts, except the menu and station names, are in Japanese.</p>"},{"name":"Derby Jockey R","year":1997,"developer":"Graphic Research Co., Ltd.","url":"psx-chd-roms-d/Derby%20Jockey%20R%20%28Japan%29.chd","filesize":21457805,"score":"","genres":"Sports > 3rd-person (Other) > Cinematic camera > Real-time > Horse / derby > Japan (Modern/Futuristic)","desc":"<p><em>Derby Jockey R</em> is a horse racing simulation game. The player plays the part of a horse rider who belongs to a horse stable. In order to achieve better results in various races, the player need to choose a suitable horse for the race and give appropriate commands to the horse during the race.</p>"},{"name":"Derby Stallion","year":1997,"developer":"ParityBit"},{"name":"Derby Stallion 99","year":1999,"developer":"ParityBit"},{"name":"Descent","year":1996,"developer":"Parallax Software Corp.","url":"psx-chd-roms-d/Descent%20%28Europe%29.chd","filesize":342333258,"score":8.1,"genres":"Action > 1st-person > Shooter > Direct control > Space flight > Sci-fi / futuristic","desc":"<p>The Post-Terran Minerals Corporation (PTMC) digs up minerals on all nine planets of the solar system, employing humans and robots to do its job. Unfortunately, the mining robots are now being controlled by a hacker, and have taken the human workers hostage. The PTMC has tried to get the robots back under their control, but communication with the mining stations has been lost. In desperation, the PTMC modifies a Pyro-GX ship for combat and hires a mercenary, codenamed \"Material Defender\", to fly it. The mission is to destroy the infected mines and rescue human hostages, destroying any hostile robot that gets in the way.</p><p><em>Descent</em> is a 3D first-person game that puts the player at the controls of the Pyro-GX spaceship. <em>Descent</em> is notable in that the player travels through various interior locations (mines) but can do so in 720 degrees of movement. The ship however only moves forward and backward in any of the directions it is facing. The ship is able to use a variety of weapons scattered as power-ups throughout each level. They include: standard lasers, the Vulcan Cannon (a chaingun-like weapon), the Spreadfire Cannon (a rapidly firing, shotgun-like energy weapon), the Plasma Cannon (a rapidly firing energy weapon more suited for medium-range combat), and the Fusion Cannon (fires a ball of energy that's more powerful the longer it is charged it up, but could destroy the ship). All of these weapons, except for the Vulcan Cannon, use the ship's energy supply. The Pyro-PX is also capable of firing regular concussion missiles, homing missiles, proximity bombs (sits in the sky, then explodes when something gets close to it), smart missiles (more powerful homing missiles that fire out homing energy balls upon impact with their target), and Mega Missiles (the ultimate weapons of mass destruction).</p><p>The goal of each level is to locate and destroy the mine's reactor. Once completed, there are only 45 seconds to find the escape hatch to get out of the mine before it explodes. As progress is made through the game, the AI will adapt to player's strategies and attempt to prevent the player from reaching the goals.</p>"},{"name":"Descent Maximum","year":1997,"developer":"Parallax Software Corp.","url":"psx-chd-roms-d/Descent%20Maximum%20%28USA%29.chd","filesize":301816832,"score":7.3,"genres":"Action > 1st-person > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>Descent Maximum</em> took the best parts of the original Descent and Descent II for the PC and adapted them to the Playstation game console.</p><p>In <em>Descent</em> the player takes control of the \"Material Defender\" a pilot sent into a series of interstellar mines to rid them of the crazed robots that have taken over them. The player has total 360-degree movement of the ship to navigate through the twisting mines and is equipped with over 20 specialized weapons.</p><p><em>Descent Maximum</em> was the second and final Descent game available for the PlaySation game console. Initially, the game was to be a direct port of <em>Descent II</em> to the Playstation, however at the time Sony were rejecting PC ports of games to the PS in the US, so the game was retooled, renamed and all the previous levels were scrapped in favor of 36 (!) new Playstation exclusive levels. </p><p>It was still released as \"Descent 2\" for the Playstation in foreign markets.</p>"},{"name":"Deserted Island","year":1996,"developer":"Mediamuse","url":"psx-chd-roms-d/Deserted%20Island%20%28Japan%29.chd","filesize":132624883,"score":"","genres":"Simulation > 1st-person > RPG elements > Survival","desc":"<p>This is a survival simulation game masterpiece!<br>Become the captain of an exploration team dispatched to an unknown island and find out the hidden \"truth\" on the island!<br>The player will need to investigate the island while working to grasp the characteristics of the members and managing their physical conditions.<br>Record various events occurred on the island in the \"Natural History\" and use the given points to develop the crew members.<br>Find out the truth by continue on with the dangerous investigations and associate various things that have occurred!</p>"},{"name":"Destrega","year":1998,"developer":"Omega Force","url":"psx-chd-roms-d/Destrega%20%28Europe%29.chd","filesize":308541918,"score":7.1,"genres":"Action > 3rd-person (Other) > Fighting > Direct control","desc":"<p><em>Destrega</em> is one of the first fighting games to focus more on long range attacks and use of interactive backgrounds than close-up fisticuffs.</p><p>The story revolves around a battle for control of relics left a millennia ago by the Strega - mysterious beings with benevolent gifts of powers to human beings.</p>"},{"name":"Destruction Derby","year":1995,"developer":"Reflections Interactive Limited","url":"psx-chd-roms-d/Destruction%20Derby%20%28Europe%29.chd","filesize":376733280,"score":7.3,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicular combat","desc":"<p>You probably feel like a crash test dummy when you're playing this game - it's not only a racing game, but you get points for wrecking your enemies! The amount of points you get depends on how you hit them ... e.g. you get more points for getting them do a 360 other than driving into their sides at high speed. The game has more to offer: a head to head mode with only two cars or the legendary destruction derby itself - a huge arena, every car starts at the edge of it, and then - have a nice crash!</p>"},{"name":"Destruction Derby 2","year":1996,"developer":"Reflections Interactive Limited","url":"psx-chd-roms-d/Destruction%20Derby%202%20%28Europe%29.chd","filesize":418561536,"score":7.3,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicular combat","desc":"<p>This sequel to the original Destruction Derby offers more of the same no-holds-barred action and mayhem with new tracks and a lot of technical improvements and features not seen in the original, such as a pit stop feature that allows car repairs!</p><p>Gameplay is identical to its predecessor -- the objective consists of gaining points by winning races or \"creatively\" crashing opponents and climbing to the top of the rankings.</p>"},{"name":"Destruction Derby: Raw","year":2000,"developer":"Studio 33 (UK) Ltd.","url":"psx-chd-roms-d/Destruction%20Derby%20Raw%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":459956034,"score":7.3,"genres":"Racing / Driving > Behind view > Direct control > Automobile > Vehicular combat","desc":"<p>The third <em>Destruction Derby</em> title on PSX brings all new action to the race track. A new 3D collision detection system allows for bigger crashes and larger pile-ups, while with new Destruction Combo moves, you can trash the enemy in many more ways.</p><p>Game modes include Wreckin' Racing, Smash 4 $, and Battle. Wreckin' Racing has you racing for survival through the usual set of racing tracks, each with obstacles and hidden shortcuts. Every race you win opens up a new track. Smash 4 $ has you using every trick in the book to take out the other cars on the track. The more you take out, and the way you do so, determines how much money you win. That money can be used to spend on new cars. Finally, Battle is a free-for-all destruction arena battle, where up to four players as well as heaps of CPU controlled cars smash it out to see who is the last man standing in the crush.</p>"},{"name":"Destructo 2","year":2000,"developer":"Axes Art Amuse","url":"psx-chd-roms-d/Destructo%202%20%28Europe%29.chd","filesize":109858881,"score":"","genres":"Strategy > Anime / Manga > Arcade > Platform","desc":"<p><em>Destructo 2</em> is a simple color-matching puzzle game similar to Mr. Driller, originally released as part of a budget series in Japan. The main objective is to guide a cartoon character moving through an ascending pile of multicolored tiles, pushing the available blocks to create clusters of the same color. Groups of four or more tiles of matching colors can be removed by punching one of the connected blocks, with the vacant space being occupied by the falling stacks on top. The descending tiles that end up rearranged in new color clusters are automatically eliminated and give combo points.</p><p>As the tiles accumulate on the screen, the water level at the bottom starts to proportionally rise, receding when enough blocks are destroyed. The health meter for the main character is displayed below the gamefield, decreasing when suffering injuries from bomb explosions or drowning. The character also dies after being crushed against the top by the blocks. Power-ups and other items can be found inside containers that randomly appear on the pile, that have to be broke open with three punches to reveal their contents. The blue items give bonus points, eliminate all the tiles of a particular color, lower the water level and help in other ways, while the red items do the opposite and have to be avoided.</p>"},{"name":"Detana!! Twinbee Yahoo! Deluxe Pack","year":1995,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-d/Detana%20Twinbee%20Yahoo%21%20Deluxe%20Pack%20%28Japan%29.chd","filesize":278757387,"score":"","genres":"Action > Compilation > Top-down > Anime / Manga > Arcade > Shooter","desc":"<p>Prepare to enter the bizarre side of Konami's creative mind with their <em>Twinbee</em> series! Take control of the fighter ships, Twinbee, Winbee, and Gwinbee, as you and a friend save some strange and bizarre worlds from even more bizarre enemies and freaks! This pack contains the arcade games Detana!! TwinBee (released in a home version for the PC Engine) and Twinbee Yahoo! (never released separately for home), in all their arcade glory!</p>"},{"name":"Detective Barbie: The Mystery Cruise","year":2000,"developer":"Runecraft Ltd.","url":"psx-chd-roms-d/Detective%20Barbie%20-%20The%20Mystery%20Cruise%20%28Europe%29.chd","filesize":189004613,"score":"","genres":"Action > Adventure > Racing / Driving > 3rd-person (Other) > Detective / mystery > Licensed","desc":"<p>Three pieces of valuable artwork have been stolen from a cruise ship's art gallery. Now it's up to Detective Barbie to catch the brazen art thief.</p><p>To catch the thief, Barbie will search for clues throughout the ship and also on three tropical islands equipped with gadgets, the most important being the infra-red lipstick. The infra-red lipstick reveals clues when Barbie looks through it. Barbie can also speak to the passengers of the cruise ship in an attempt to get information on the case.</p><p>Barbie can even take a break from her formidable detective work by racing her friend on jet skis in the water or air racers in the sky.The jet ski mini-game is the usual get to the finish line first competition, but the air race is decided by which competitor can fly through the most rings and fill a meter first. There is also a shuffle board mini-game. Each of these mini-games can have their difficulty settings changed from easy, medium and hard.</p>"},{"name":"Detective Mouse","year":2003,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-d/Detective%20Mouse%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":229606042,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select > Detective / mystery","desc":"<p><em>Detective Mouse</em> features a Dingo Pictures animated film titled <em>Ein Fall für die Mäusepolizei</em>. The game also features six different sliding picture puzzles with 4 difficulty options (9,12,25, or 36 squares). There is also a coloring book mode where players can color in six different pictures.</p><p>The game was later released on the PlayStation 2 as <em>The Mouse Police</em>. It's the same game as the PlayStation version but adds a jigsaw puzzle mode and a pair matching mini game.</p>"},{"name":"Devil Dice","year":1998,"developer":"Shift Inc.","url":"psx-chd-roms-d/Devil%20Dice%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":482832064,"score":7.6,"genres":"Puzzle > Diagonal-down","desc":"<p><em>Devil Dice</em> is a multi-player puzzle game. Use devils to wipe out rows of dice, play one-to-one challenges or take on four friends in a frenetic battle for survival.</p><p>There is a choice of four different game modes: race against the clock, attempt increasingly challenging puzzles, team up with a friend or battle to be the sole survivor.</p>"},{"name":"Devil Summoner: Soul Hackers (Disk 1)","year":1999,"developer":"Atlus Co., Ltd.","url":"psx-chd-roms-d/Devil%20Summoner%20-%20Soul%20Hackers%20%28Japan%29%20%28Disc%201%29.chd","filesize":247621209,"score":7.4,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Cyberpunk / dark sci-fi","desc":"<p>Amami City is a Japanese megalopolis of the near future. In this huge city, each house has a computer, and all computers are linked to one big network. The flow of information is being controlled by the government, and software companies create huge virtual locations-networks. An eighteen-year-old member of a hacker group called Spookies and his companions gain access to one of these networks - a virtual city called Paradigm-X, created by Algon Soft. However, an accident occurs during the hacking, and a mysterious demon who calls herself Nemissa emerges. The Spookies must find the true reason behind Nemissa's arrival, and confront a shadowy organization known as Phantom Society, which employs demon summoners.</p><p><em>Soul Hackers</em> is similar in its themes, structure and gameplay to its predecessor, as well as to the main Shin Megami Tensei series. Set in a futuristic cyberpunk environment, the game contains many characteristic elements such as two weapon types (swords and guns) for the main hero, a female companion who can learn and cast magic spells, and a party of six active combatants, of which four are demons. Like in many other <em>Megami Tensei</em> games, the player can communicate with randomly encountered demons and recruit them into the party by selecting appropriate dialogue choices. These demons can also be fused with each other to create more powerful ones.</p><p>The loyalty system from the previous game returns; however, this installment makes it easier to raise the loyalty level of a demon. By taking a demon into battles and repeatedly performing action it likes (indicated by its comments to the player's choices), the player can gradually make it fully controllable and obedient. Attack and magic power of the demons raises together with their loyalty levels.</p><p>New in this installment is a limited ability to fuse demons outside of specific fusion places, by using the protagonist's demon-summoning computer (COMP). The player can also purchase and install software on this computer, which has a variety of functions, from combat-aiding and mapping utilities to the possibility to save the game anywhere in the dungeon.</p>"},{"name":"Devil Summoner: Soul Hackers (Disk 2)","year":1999,"developer":"Atlus Co., Ltd.","url":"psx-chd-roms-d/Devil%20Summoner%20-%20Soul%20Hackers%20%28Japan%29%20%28Disc%202%29.chd","filesize":271954573,"score":7.4,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Cyberpunk / dark sci-fi","desc":"<p>Amami City is a Japanese megalopolis of the near future. In this huge city, each house has a computer, and all computers are linked to one big network. The flow of information is being controlled by the government, and software companies create huge virtual locations-networks. An eighteen-year-old member of a hacker group called Spookies and his companions gain access to one of these networks - a virtual city called Paradigm-X, created by Algon Soft. However, an accident occurs during the hacking, and a mysterious demon who calls herself Nemissa emerges. The Spookies must find the true reason behind Nemissa's arrival, and confront a shadowy organization known as Phantom Society, which employs demon summoners.</p><p><em>Soul Hackers</em> is similar in its themes, structure and gameplay to its predecessor, as well as to the main Shin Megami Tensei series. Set in a futuristic cyberpunk environment, the game contains many characteristic elements such as two weapon types (swords and guns) for the main hero, a female companion who can learn and cast magic spells, and a party of six active combatants, of which four are demons. Like in many other <em>Megami Tensei</em> games, the player can communicate with randomly encountered demons and recruit them into the party by selecting appropriate dialogue choices. These demons can also be fused with each other to create more powerful ones.</p><p>The loyalty system from the previous game returns; however, this installment makes it easier to raise the loyalty level of a demon. By taking a demon into battles and repeatedly performing action it likes (indicated by its comments to the player's choices), the player can gradually make it fully controllable and obedient. Attack and magic power of the demons raises together with their loyalty levels.</p><p>New in this installment is a limited ability to fuse demons outside of specific fusion places, by using the protagonist's demon-summoning computer (COMP). The player can also purchase and install software on this computer, which has a variety of functions, from combat-aiding and mapping utilities to the possibility to save the game anywhere in the dungeon.</p>"},{"name":"Dexter's Laboratory: Mandark's Lab?","year":2001,"developer":"Red Lemon Studios","url":"psx-chd-roms-d/Dexter%27s%20Laboratory%20-%20Mandark%27s%20Lab%20%28Europe%29.chd","filesize":197667773,"score":"","genres":"Action > 3rd-person (Other) > Board game > Music / rhythm > Licensed","desc":"<p>Based on the boy genius rivalry between Dexter and the scheming Mandark from the Cartoon Network show, the title is actually a collection of mini-games designed specifically for the PlayStation.</p><p>Game challenges are fashioned around a platform 'hub' and include variations on Dancing games ('Dee Dee’s Dance Class'), shooting gallery (Dexter’s Dodge Ball), racing game, ice hockey variant etc.</p>"},{"name":"Dezaemon Kids!","year":1998,"developer":"Athena Co., Ltd.","url":"psx-chd-roms-d/Dezaemon%20Kids%21%20%28Japan%29.chd","filesize":82026023,"score":"","genres":"Action > 3rd-person (Other) > Side view > Top-down > Arcade > Shooter > Flight / aviation","desc":"<p><em>Dezaemon Kids!</em> is a title in the <em>Dezaemon</em> series that allows players to create their own shoot-'em-up games. The players can design levels and enemies by themselves or choose from a number of presets, as well as compose musical themes for the levels. The game has a simplified colorful interface which makes it targeted for younger audience. It also boasts fully-voiced tutorial, a large amount of sample data, a horizontal scroll option, and 2-player simultaneous play option. The second game disc contains 102 sample games created in Dezaemon Plus.</p>"},{"name":"Dezaemon Plus","year":1996,"developer":"Athena Co., Ltd.","url":"psx-chd-roms-d/Dezaemon%20Plus%20%28Japan%29.chd","filesize":264902036,"score":"","genres":"Action > Top-down > Arcade > Shooter > Flight / aviation","desc":"<p><em>Dezaemon Plus</em> is an updated PlayStation release of Dezaemon on the Super Famicom. Both games allow players to create their own vertical shooters through use of an icon-driven tool set. Players can control enemy placement, behavior, weapons, powerups, boss firing points, and so on. A graphics editor allows players to draw backgrounds, along with sprites for players, enemies, and even explosions. A music editor, very similar to the one in Mario Paint allows players to construct background themes for each level. Players are limited to a maximum of five levels, and a limited amount of shared memory for all graphics.</p><p><em>Dezaemon Plus</em>'s changes primarily include parallax scrolling for enemy sprites and backgrounds, and a selection of new or altered instruments in the music editor. Players can save their creations to a memory card and share them with friends. The game also supports the PlayStation mouse, making graphics editing a little easier.</p><p><em>Dezaemon Plus</em> also contains an updated version of the Super Famicom's demo game <em>Daioh Gale</em> (which players can use as a template for editing), as well as submissions from two editing contests held by Athena. 13 winners and runner-ups are included, 9 of which are fully playable. The remaining submissions are included as gameplay videos. All submissions were created using the <em>Dezaemon</em> tools, giving players some ideas of what they can create with them.</p><p>The game was released on the PlayStation Network in Japan, and as a \"PSOne Classics Japanese import\" (so menus are untranslated) in the U.S. and Europe. The game does not feature USB mouse support or analogue controls, making image editing somewhat difficult. However, created games can be copied to PlayStation Memory Sticks and shared.</p>"},{"name":"Diablo","year":1998,"developer":"Blizzard Entertainment Inc.","url":"psx-chd-roms-d/Diablo%20%28USA%29%20%28En%2CFr%2CDe%2CSv%29.chd","filesize":373251001,"score":8,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Action RPG > Hack and slash > Point and select > Fantasy","desc":"<p>Long ago a secret war raged between Heaven and Hell, each using humanity as its pawns. While the Prime Evils of Hell were engaged in war their lesser lieutenants conspired to overthrow them. They mutinied suddenly with the combined forces of Hell, overwhelming the three Primes. Stripped of their power, they were banished to the mortal realm. Human agents of Heaven, upon discovering this, found the three Primes and sealed them within gemstone prisons, each of them sent to a different corner of the earth and kept under guard to prevent them from escaping.</p><p>As years turns to centuries, however, the power of Heaven's agents waned, until eventually not even the people of the town of Tristram knew that buried deep under their chapel was the soul of the Lord of Terror, Diablo. As the strength of his prison waned Diablo reached out into the world, corrupting the dreams of the land's good king, driving him to attack his neighbors. The nation of Khanduras fought wars with no intention of winning, desiring only slaughter and suffering. Now the lands lay scorched, home only to monsters and the dead. Rumors spread of a way to stop the demons, as well as rumors of great wealth, and both draw adventurers from far to the small town of Tristram.</p><p>Players start by choosing their avatar's class: either Warrior, Rogue, or Sorcerer. Warriors have the highest maximum strength and can repair weapons and armor inside the dungeon, but this will lower the item's maximum durability. The Rogue has the highest maximum dexterity and can both see and disarm traps on treasure chests. The Sorcerer has the highest maximum magic attribute and can recharge the charges on a spellcasting staff at the cost of his own mana.</p><p>Characters can equip armor, weapons, and accessories found in the chapel's shifting dungeons, but strong equipment will have minimum attribute requirements to be worn. Most equipment will have randomized stats, but some strong monsters will drop Unique weapons with set stats. Magic can be learned by finding magic tomes, and leveled up by finding multiples of the same spell tome, but advanced spell levels can not be learned if the character's magic stat is too low. Upon destroying enough monsters to level up the player is rewarded with additional attribute points to distribute to whichever attributes they wish. Occasionally the few people left in town will inform the player of a job they would like done, either an exceptionally strong monster that must be slain or a unique item found deep in the dungeon, and will reward the player in kind upon completion of the quest.</p><p><em>Diablo</em> can be played cooperatively with 1 to 3 other players over LAN or BattleNet with the PC versions, or with 1 player locally on the PlayStation. Players can team up to survive the depths of the dungeons, or turn on each other to steal one another's items from their corpse. The quest unique zones are removed from the online version of a dungeon, and instead quest monsters will be found wandering the level that would normally lead to their unique area.</p>"},{"name":"Die Hard Trilogy","year":1996,"developer":"Probe Entertainment Ltd.","url":"psx-chd-roms-d/Die%20Hard%20Trilogy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.chd","filesize":341511997,"score":7.2,"genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Rail shooter > Shooter > Direct control > North America > Crime > Licensed","desc":"<p><em>Die Hard Trilogy</em> lets players guide New York cop John McClane through three arcade-style games based on each of the three <em>Die Hard</em> movies. Each movie is represented through a totally different style, making this a \"3 games in 1\" style package. </p><p><strong>Die Hard</strong> is a third person action/adventure through thirty floors of the Nakatomi Tower high-rise. Terrorists have interrupted the company's Christmas party and taken hostages. As McClane, the player must search for hostages through computer, construction, maintenance, and executive levels. McClane's default pistol holds infinite ammo, and the player can collect limited-ammo machine guns and grenades inside the levels. Walls turn transparent when they intersect the camera, allowing players to follow McClane through hallways and rooms with ease. After all the hostages on a level have been rescued, the player has 30 seconds to locate a bomb sent down by elevator, then use that elevator to move to the next level. </p><p><strong>Die Hard 2: Die Harder</strong> is a first-person arcade gun game, nearly identical to Virtua Cop. Terrorists have attacked Washington/Dulles Airport. The player automatically moves through the airport and surrounding areas \"on rails,\" shooting bad guys that appear from behind the scenery. Weapon upgrade icons can be shot to be collected, and either use limited ammo, or are retained until the player is hit (identical to Lethal Enforcers). Players can also destroy parts of the environment by shooting it, which can be used to take out nearby terrorists (with explosions, or by shooting overhead items to drop on them). This game supports pad controls, or any of the PlayStation's gun controllers. </p><p><strong>Die Hard With A Vengeance</strong> has players racing through New York City streets in a variety of vehicles, trying to locate bombs before they explode. A strict timer ticks off the next explosion, and the player is guided only by a direction arrow and the vocal suggestions of their co-driver. Bombs are hidden inside everyday objects (like phone booths and benches) and are defused by ramming them, which activates the timer on the next bomb. Occasional \"bomb cars\" must be chased and rammed until their life bar is depleted. Powerups can be collected by running over icons in the streets, and include extra time, turbo boosts, and jumps to rocket over obstacles.</p><p>All three games are exaggeratedly bloody (players can run over pedestrians in Die Hard 3 and wipe the blood away with windshield wipers). Each of the three games also uses a combination of textured polygons and sprites to generate their worlds, resulting in warping textures and some quirky \"paper doll\" effects.</p>"},{"name":"Die Hard Trilogy 2: Viva Las Vegas","year":2000,"developer":"n-Space, Inc.","url":"psx-chd-roms-d/Die%20Hard%20Trilogy%202%20-%20Viva%20Las%20Vegas%20%28Europe%29.chd","filesize":402272104,"score":6.1,"genres":"Action > 1st-person > Behind view > Shooter > Licensed","desc":"<p>As in the first game, <em>Die Hard Trilogy 2</em> is broken up into three types of gameplay: shootin', drivin', and runnin' around. The game can be played either in Movie mode, which manages to tell what little story there is while alternating between gameplay types, or Arcade mode, which lets you pound through all of the shooting or driving levels at once (complete with extra bonus levels).</p>"},{"name":"Digimon Digital Card Battle","year":2000,"developer":"BEC Co., Ltd.","url":"psx-chd-roms-d/Digimon%20Digital%20Card%20Battle%20%28Europe%29.chd","filesize":95554710,"score":"","genres":"Strategy > Anime / Manga > Cards / tiles","desc":"<p>In this Cyber World, everything revolves around Digital Card Battles.  People from all over the world log-in to collect Cards and challenge each other to Card Battles.</p><p>To play, Card Tamers create Decks of 30 Cards, using Digimon and special Option Cards that match their personal strategies.  The winner of a Card Battle earns new Cards.</p><p>As a Card Tamer, you should create a Deck that suits your playing style and use it to challenge your friends.</p>"},{"name":"Digimon Rumble Arena","year":2001,"developer":"CA Production","url":"psx-chd-roms-d/Digimon%20Rumble%20Arena%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":175746649,"score":"","genres":"Action > Side view > Fighting > Licensed","desc":"<p>Digimon Rumble Arena features a cast of characters from all 3 seasons of the Fox Kids television series, Digimon: Digital Monsters.  Classic fighting action for 1 or 2 players.  Compete as one of your favorite Digimon characters, and employ his special powers and attacks to advance through multiple levels and past obstacles.  Gain points by playing through assorted mini games.  Win and use items to power-up your Digimon and get them ready for the ring.</p>"},{"name":"Digimon Tamers: Pocket Culumon","year":2001,"developer":"","url":"psx-chd-roms-d/DigimonTamers%20-%20PocketCulumon%20%28Japan%29.chd","filesize":57706749,"score":"","genres":"Role-playing (RPG) > Simulation > Side view > Fixed / flip-screen > Anime / Manga > Meditative / Zen > RPG elements > Direct control > Menu structures > Point and select > Licensed","desc":"<p>In this final entry of the Pocket Digimon sub-series, you can interact with Culumon, that little Digimon from Digimon Tamers anime series.Unlike in the previous Pocket Digimon games, you can only get Culumon to your PocketStation. Also, Culumon can not evole at all.This PocketStation game might be more to akin of Chocobo World gameplay-wise.</p>"},{"name":"Digimon World","year":1999,"developer":"Flying Tiger Development","url":"psx-chd-roms-d/DigimonWorld%20%28Japan%29%20%28Rev%201%29.chd","filesize":204301651,"score":6.4,"genres":"Action > Strategy > 1st-person > Licensed","desc":"<p>You're a young boy who loved playing with the Digimon virtual pet with his friends after school. One day after he came home, his virtual pet started to glow and then all of a sudden he gets sucked in. You land in a place called the Digital World and you meet the leader Jijimon and your Digimon partner (either Agumon or Gabumon). Then, Jijimon explains to you the crisis that a terrible force has disrupted the island and you have to stop it.You have to raise your Digimon by feeding it, training it, fighting, putting it to sleep, taking care of illness and exhaustion and going to the toilet.</p><p>You have to restore the island by fighting digimon and letting them join the city. Your main objective is to make it to Infinity Mountain and the real enemy, Machinedramon! Since you can only go to the Ultimate level you have to have strategy to win the fight. Do you have the strength and skill to defeat this almost foe?</p>"},{"name":"Digimon World 2","year":2000,"developer":"BEC Co., Ltd.","url":"psx-chd-roms-d/DigimonWorld%202%20%28Japan%29.chd","filesize":202348373,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other)","desc":"<p><em>Digimon World 2</em>the second game in the Digimon World series brings us to an all-new world in which we must raise digimon to fight off the evil trying to invade. In the previous Digimon World, you played as a young boy who was called to the Digital World in order to save the digimon from a terrible fate and had a partner digimon which needed your care. In this second game, your role is that of a new Guard Tamer who's destined to protect the Digital city, and the Digital world. Now you can fight in all new 3-on-3 battles. There is now a way for you to raise your digimon party to higher levels, and digivolve them to the new 'mega' level, unseen in the previous game (where 'ultimate' level was the limit). The new DNA-Digivolving gives you even further ways to gain new and more powerful digimon.</p>"},{"name":"Digimon World 3","year":2002,"developer":"Boom","url":"psx-chd-roms-d/DigimonWorld%203%20-%20Aratanaru%20Bouken%20no%20Tobira%20%28Japan%29.chd","filesize":410281708,"score":6.5,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Sci-fi / futuristic > Licensed","desc":"<p>One afternoon, three friends, Junior, Teddy and Ivy, enter a virtual game called Digimon Online - a game where digital monsters live. Soon soon there is a digital terrorist attack, trapping all players inside Digimon Online. The owners of Digimon Online, the MAGAMI Corporation, claim there is no major problem and it will be fixed soon. However, not all is as it seems as Junior, the main character, uncovers secret mysteries about the digimon, the game, and the corporation.</p><p><em>Digimon World 3</em> implements a free roam approach, and is not simply restricted to dungeons and mazes. Like other RPGs, Digimon World 3 has a turn-based battle system, and enemy digimon are fought by random encounters. During battle, it is one-on-one fighting, and thus you can only initially fight with just one digimon at a time. Digimon have many different attacks, skills, and digivolutions (the ability to evolve into a stronger digimon). The player gets to choose a pack of three digimon at the start, but through side-quests, is able to obtain all nine (plus one bonus digimon).</p>"},{"name":"Digitalglider Airman","year":1999,"developer":"Ornith","url":"psx-chd-roms-d/Digital%20Glider%20Airman%20%28Japan%29.chd","filesize":198477334,"score":"","genres":"Simulation > 1st-person > Behind view > Flight / aviation > Contemporary","desc":"<p>Challenge and see how far can the airplane designed by you fly in simulation game \"DIGITAL GLIDER AIRMAN\". The simulation flight of your plane is based on your design and aerodynamics. Test your knowledge of aviation theory and skills as a pilot!</p>"},{"name":"Dino Crisis","year":1999,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-d/Dino%20Crisis%20%28Europe%29.chd","filesize":237590193,"score":7.6,"genres":"Action > Strategy > 3rd-person (Other) > Cinematic camera > Survival horror","desc":"<p>Three years ago a brilliant scientist disappeared while researching a new form of energy. The government that funded his research wrote the whole affair off as a loss, which made it all the more upsetting when reports of Dr. Kirk's good health and nearly finished research came in. A special forces team is sent to the doctor's private island laboratory to extract him and his research, but they are totally unprepared for some of the side effects of his developments. Side effects that come from 100 million years in the past.</p><p><em>Dino Crisis</em> is a survival horror game that is very similar in both control and gameplay to its sister series, Resident Evil. As in that series, protagonist Regina will have limited supplies and ammo with which to fight deadly enemies while searching rooms for keys (some figurative, some literal) to open locked areas. Unlike <em>Resident Evil</em> games, Regina will find very few actual supplies laying around, and will instead find \"plugs\" that are used to open caches of emergency supplies located around the complex. There are only enough plugs to open some of these caches, however, so care must be taken to decide what items are really needed. In another change from <em>Resident Evil</em>, the game is rendered in 3D, allowing the camera to rotate or pan, although camera angles are still out of the control of the player. Even the dumbest dinosaur is smarter than the undead, and enemies can chase and disarm Regina, and even occasionally follow her through doors. Regina can use the force fields in the complex to block her enemies.</p>"},{"name":"Dino Crisis 2","year":2000,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-d/Dino%20Crisis%202%20%28Europe%29.chd","filesize":317734048,"score":7.3,"genres":"Action > 1st-person > 3rd-person (Other) > Survival horror","desc":"<p>The research on the mysterious Third Energy is being continued in secret, but then an entire island with the facility conducting this research and a neighbouring town has vanished, moving back in time to the dinosaur era. A military unit is sent to the past to save the survivors and retrieve the research data. But nearly all soldiers are massacred by dinosaurs. You take control of Regina and Dylan, who managed to escape this fate. Now you must find the survivors, retrieve the data, and get back to your own time. </p><p><em>Dino Crisis 2</em> is a survival horror game in which you control the characters Dylan and Regina (switching from one to another at various points in the storyline). You will collect items and use them to solve puzzles while fighting the hordes of dinosaurs that inhabit the island. Much like Alone in the Dark, the game uses 3D models for characters, enemies and items and static 2D backgrounds for their surroundings. </p><p>Initially, each character starts with a gun and a melee weapon, but more weapons, such as flamethrowers or rocket launchers, can be bought later in the game. The dinosaurs' attacks cause you to lose \"vitality\", which can be restored using healing items. Sometimes an attack will cause you to bleed and thus slowly lose health; specific health items stop the bleeding. </p><p>For each killed dinosaur you receive \"Extinction Points\". By killing a couple of dinos in quick succession, you activate a 'combo' and thus get more points. The points can be used in \"Save Shops\" throughout the game to buy weapons, ammo (and cartridge upgrades which allow you to store more ammo within the weapon), healing items and \"tools\" (such as armor, more powerful melee weapons, or \"cards\" which allow you to get bigger combos). You can also save the game at these points. </p><p>While wandering around the island, you'll find many documents and letters to read, including \"Dino Files\", which contain a flavor description of a dino species.</p>"},{"name":"Dino Crisis: 5th Anniversary","year":2004,"developer":""},{"name":"Dinomaster Party","year":2002,"developer":"Similis Software GmbH","url":"psx-chd-roms-d/Dinomaster%20Party%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":157440774,"score":"","genres":"Action > Diagonal-down > Fixed / flip-screen > Mini-games > Party game > Direct control > Prehistoric","desc":"<p>* 8 dinosaurs for you to choose from the Huge Diplodocus, the Mighty Triceratops, the Speedy Velociraptor, not to mention the Terrifying T-Rex and lots of others. * Challenge your friends in 4-player mode! * Cross 4 hostile worlds : jungle, mountains, volcanoes, the centre of the Earth; in an incredible graphic universe: living colour, Magna style - these are no ordinary dinosaurs ! * Test yourself with 12 mini-games, all with their own unique gameplay : Meteor Shower, Rock Push, DinoSquare...</p>"},{"name":"Dinosaurs","year":2003,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-d/Dinosaurs%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":387260196,"score":"","genres":"Puzzle > Mini-games","desc":"<p>After a volcanic eruption, a young dinosaur named Tio gets separated from his family and goes out searching for them.</p><p>While the disc contains a Dingo Pictures animated movie titled <em>Abenteuer im Land der Dinosaurier</em>, it also contains mini-games. The PlayStation version includes a coloring book and a sliding puzzle, while the PlayStation 2 version adds an additional matching pairs game and a jigsaw puzzle.</p>"},{"name":"Dioramos","year":2000,"developer":"PONOS","url":"psx-chd-roms-d/Dioramos%20%28Japan%29.chd","filesize":305421815,"score":"","genres":"Strategy > Isometric > Anime / Manga > Turn-based > Board game > RPG elements > Fantasy","desc":"<p>“DIORAMOS” is a swift, battle-type board game that tells winners from losers in no delay. In this exhilarating game, the playing order changes unlimitedly with the individualistic characters, while different character and weapon combinations unleash boundless and unique battle tactics including deadly combos, counters, dodges, magic, special attacks and plunder, all guaranteeing heated battles on the board.</p>"},{"name":"Dirt Jockey: Heavy Equipment Operator","year":2000,"developer":"DDL Corporation","url":"psx-chd-roms-d/Dirt%20Jockey%20-%20Heavy%20Equipment%20Operator%20%28USA%29.chd","filesize":233088438,"score":"","genres":"Simulation > 3rd-person (Other) > Managerial / business simulation","desc":"<p><em>Dirt Jockey</em> lets the players operate heavy machinery like dump trucks, wheel loaders, bulldozers and high-reaching cranes. There are four game modes: Qualification (play this to obtain licenses for operating specific machinery), Build (the goal is to build a huge Department store with the licensed machinery), Equipment Rodeo (challenge yourself to the events of Treasure hunt, Mountain maker, Overdrive and Spin touch), and Free-play (self-explanatory). The game boasts realistic machinery controls and authentic looks.</p>"},{"name":"Discworld","year":1995,"developer":"Teeny Weeny Games, Ltd."},{"name":"Discworld II: Mortality Bytes!","year":1997,"developer":"Perfect Entertainment, Ltd.","url":"psx-chd-roms-d/Discworld%20II%20-%20Mortality%20Bytes%21%20%28USA%29.chd","filesize":478118203,"score":7.8,"genres":"Adventure > 3rd-person (Other) > Graphic adventure > Puzzle elements > Point and select > Fantasy > Licensed","desc":"<p><em>Mortality Bytes</em> casts players again in the role of Rincewind, from the first game.</p><p>Death, the grim reaper, who normally ushers the Discworld inhabitants into the afterlife, is on an extended vacation. This means that those whose \"time is up\" are faltering around in limbo. Now it's up to Rincewind to bring him back or suffer the fate of immortality.</p><p>Gameplay is divided into 4 Acts. There are many locations to explore and a multitude of obstacles in Rincewind's path to overcome. Conversations with characters and interaction with inventory objects is necessary to move ahead.</p><p>The game features unique humour similar to the previous game.</p>"},{"name":"Discworld Noir","year":1999,"developer":"Perfect Entertainment, Ltd.","url":"psx-chd-roms-d/Discworld%20Noir%20%28Europe%29%20%28En%2CEs%2CIt%29.chd","filesize":516714987,"score":8,"genres":"Adventure > 3rd-person (Other) > Graphic adventure > Puzzle elements > Point and select > Fantasy > Detective / mystery > Licensed","desc":"<p>Ankh-Morpork is a city surrounded by darkness, where the cold river Ankh flows, where it always rains, and where dwarves and trolls co-exist with secret societies, religious fanatics, stupid police captains, and bar pianists. It is also where a bitterly sarcastic sharp-eyed private investigator named Lewton tries to earn a living solving bizarre cases. A mysterious woman named Carlotta hires him to find her lost lover. Wandering through the dark city and gathering evidence, Lewton has to solve the case, confront a sinister conspiracy, and once again become torn between love and despair.</p><p><em>Discworld Noir</em> differs from other <em>Discworld</em> adventure games not only thanks to its more serious tone and much darker \"film noir\" atmosphere, but also because of its gameplay. Instead of inventory-based puzzles there are clues, which Lewton writes down in his notebook and which should be then used whenever there is a connection between the clue and the situation in question. Most of the gameplay is thus dedicated to detective work in conversations; but the usage of the right clues at the right place is still comparable to inventory-based puzzle-solving of other adventures. Graphically, <em>Discword Noir</em> features three-dimensional character models and pre-rendered backgrounds.</p>"},{"name":"Disney's 101 Dalmatians II: Patch's London Adventure","year":2003,"developer":"Santa Cruz Games","url":"psx-chd-roms-d/Disney%27s%20101%20Dalmatians%20II%20-%20Patch%27s%20London%20Adventure%20%28USA%29.chd","filesize":285755183,"score":"","genres":"Action > Isometric > Platform > Licensed","desc":"<p>You are Patch, one of the famous 101 Dalmatians, and your family has accidentally abandoned you in London during a move to the countryside.  Roam through the streets and rooftops of London as well as the ponds and fields of the surrounding countryside in your quest to find them.  When your brothers and sisters are dognapped by Cruella De Vil, you team up with Patch's favorite TV star Thunderbolt in an effort to rescue them.</p><p>Gameplay is fairly basic for a 3-D platformer.  In each of the 29 levels you collect a set number of items (bones, snacks, apples, etc.), avoid enemies (cats, squirrels, bobbies, etc. + Horace, Jasper, &amp; Cruella herself), and rescue your siblings.  Patch is able to dig, roll, bark, and jump as he runs through London and the surrounding area.  There are some timed bonus rounds (i.e. collect all 60 bones in 45 seconds) every 4 or 5 levels that help give the game more variety.</p><p>After each bonus level is a cut scene that consists of a handful of still frames from the movie with accompanying text.  Due to these scenes' infrequency, the story can be difficult to understand if the game is not supplemented by watching the movie.</p>"},{"name":"Disney's 102 Dalmatians: Puppies to the Rescue","year":2000,"developer":"Crystal Dynamics, Inc.","url":"psx-chd-roms-d/Disney%27s%20102%20Dalmatians%20-%20Puppies%20to%20the%20Rescue%20%28Europe%29%20%28Rev%201%29.chd","filesize":79292128,"score":6.5,"genres":"Action > 3rd-person (Other) > Platform > Licensed","desc":"<p>102 Dalmatians is a 3D action adventure where you become a courageous Dalmatian puppy who must rescue your family and friends from the clutches of Cruella De Vil.Disney's 102 Dalmatians: Puppies to the Rescue features beloved characters from 101 Dalmatians and new characters based on the upcoming 102 Dalmatians live action movie.</p>"},{"name":"Disney's Activity Centre: Disney Pixar A Bug's Life","year":1999,"developer":"Disney Interactive, Inc."},{"name":"Disney's Aladdin in Nasira's Revenge","year":2000,"developer":"Argonaut Games PLC","url":"psx-chd-roms-d/Disney%27s%20Aladdin%20in%20Nasira%27s%20Revenge%20%28Europe%29.chd","filesize":396851556,"score":6.9,"genres":"Action > 3rd-person (Other) > Fantasy > Middle East > Licensed","desc":"<p>Take control of Aladdin and stop Nasira, the evil sister of Jafar (the bad guy from the Disney movie) and rescue the Sultan and Princess Jasmine. Based on the hit Disney movie and the animated TV series of the same name</p>"},{"name":"Disney's Animated Storybook: Mulan","year":1999,"developer":"Disney Interactive Victoria","url":"psx-chd-roms-d/Disney%27s%20Aventura%20Interactiva%20-%20Mulan%20%28Spain%29.chd","filesize":100607627,"score":7.1,"genres":"Adventure > Educational > 3rd-person (Other) > Fixed / flip-screen > Mini-games > Point and select > Reading / writing > Fantasy > Licensed","desc":"<p>Mushu is given the task to deliver the magical scrolls which contain the legend of Mulan to the emperor of ancient China. Mushu is warned not to drop the scrolls because the magic will fall out of them if he does. Mushu drops the scrolls anyway when Cri-Kee comes from behind and startles him. Now Mushu must regain the lost scrolls and place the magic back in them.</p><p>The game is basically an interactive storybook where the player  helps the story move forward by completing certain tasks. Some of these tasks include retrieving items requested by Grandma Fa, dressing up Mulan and Mushu with a variety of hats, tops, bottoms, shoes, and accessories, playing a mix and match puzzle to obtain armor, and figuring out the correct  order gongs should be hit in order to awake Mulan's ancestors. A sample of some of the other activities include playing Mahjong and  throwing snowballs at enemy soldiers. The game also lets the player have a sing along karaoke-style to three songs from the movie. There is also an activity that let's players place cut-outs of characters and locations experienced during the game onto a sheet of paper which can then be colored in using a paint set.</p>"},{"name":"Disney's Atlantis: The Lost Empire","year":2001,"developer":"Eurocom Developments Ltd","url":"psx-chd-roms-d/Disney%27s%20Atlantis%20-%20The%20Lost%20Empire%20%28Europe%29.chd","filesize":200298527,"score":7.5,"genres":"Action > Platform > Puzzle elements > Steampunk > Licensed","desc":"<p><em>Atlantis: The Lost Empire</em> is a 3D action game with puzzle-solving elements, based on Disney's film of the same name. The player can take control of one of six different characters (Milo Thatch, Gaetan Molière, Vincenzo Santorini, Audrey Ramirez, Wilhelmina Packard and Kidagakash), trying to reach the lost city of Atlantis and save it from destruction. </p><p>Each character possesses his or her own unique abilities and the player can switch between them using radio's found around the levels. The gameplay is reminiscent of Tomb Raider games, involving combat and predominantly physical and environmental puzzles. There is also a section where the player controls a submarine and has to take on the leviathan guarding the entry to Atlantis.</p>"},{"name":"Disney's Dinosaur","year":2000,"developer":"Sandbox Studios, Inc.","url":"psx-chd-roms-d/Disney%27s%20Dinosaur%20%28Europe%29%20%28En%2CNl%2CSv%2CNo%2CDa%2CFi%29.chd","filesize":340671503,"score":5.8,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Puzzle elements > Licensed","desc":"<p><em>Disney's Dinosaur</em> is a role-playing game based on the movie of the same name. Three characters are controlled: Flia the pteradon, Aladar the Iguanadon and Zini the lemur, each of whom has different abilities. Flia can fly, Aladar can wade through water and crush rocks and Zini can fit through small spaces and pick things up. The game is seen from a top-down perspective, with the player switching characters on the fly. As in the movie, they must work together to reach the sacred nesting grounds for water and food after the rest of world dries up.</p><p>Throughout the game, the characters' abilities are upgraded via an Intelligent Points System in an RPG-like addition. The game includes FMV clips from the movie and a dinosaur encyclopedia with information about real dinosaurs.</p><p>This PlayStation version of the game features different levels and more colourful and less realistic graphics than the PlayStation 2 and Dreamcast versions.</p>"},{"name":"Disney's Donald Duck: Goin' Quackers","year":2000,"developer":"Shanghai UBIsoft Computer Software Co., Ltd.","url":"psx-chd-roms-d/Disney%27s%20Donald%20Duck%20-%20Goin%27%20Quackers%20%28USA%29.chd","filesize":211841192,"score":6.8,"genres":"Action > 3rd-person (Other) > Side view > Platform > Licensed","desc":"<p><em>Donald Duck: Goin' Quackers</em> for PlayStation is based heavily on the version on Dreamcast/Nintendo 64, but features new graphics, redesigned levels and slightly different gameplay mechanics.</p><p>To save Daisy Duck from the evil sorcerer Merlock, Donald Duck must utilize Gyro Gearloose's teleporter. Due to a lack of power, the device can't teleport Donald to Merlock's temple (where Daisy is held) right away. Instead, Donald must successively install reflector dishes at high points at Duckie Mountain, Duckburg and the flying mansion of Magica De Spell before he can reach the temple.</p><p>The game is a platformer utilizing polygonal graphics, consisting of four worlds, each made up of four regular levels, one optional bonus level and one boss fight. In the regular levels the camera is either placed behind Donald as he runs forward, or at his side, thus emulating classical side-scrolling platform gameplay. In the bonus levels, Donald must flee from something (like a bear, a car, or a rolling boulder), with the camera placed in front of him and him running towards the screen.</p><p>In the regular levels, the main goal is simply to reach the exit. Doing so gives Donald a power orb: collecting all four of them per world is necessary before the boss fight level opens up. On his way to the exit, Donald must evade pits, traps and enemies. He can jump on top of or kick enemies to dispatch them. Scattered throughout the levels are stars in different colors: yellow stars are worth one, blue stars five, and red stars ten. Collecting 100 of them gains an extra life.</p><p>There are also several optional challenges: First, Merlock has stolen and enchanted the toys of Donald's nephews. In each regular level, Donald can find three toys. To pick them up, he first has to find one of Merlock's spell books. Picking one up starts a timer counting down the seconds Donald has to pick up the toy. Once all toys in a world are found, the nephews open up the bonus level. The second challenge involves Donald trying to beat his cousin Gladstone's time record. Once a level has been finished, Donald can try the level again, attempting to beat Gladstone's time. Beating the time challenges unlocks bonus costumes that Donald can wear.</p><p>At the end of each world lies a boss battle against the likes of the Beagle Boys, Magica De Spell and of course Merlock himself. Following the classic formula, each boss attacks in a specific pattern that must be evaded and opens up to counter-attack only for a short time.</p><p>Some of the game's levels are based closely, others only loosely on those from the Dreamcast/N64 version, with most of Duckburg, two of the boss fights and all of the bonus levels being mostly or entirely new.</p>"},{"name":"Disney's Goofy's Fun House","year":2001,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-d/Disney%27s%20Goofy%27s%20Fun%20House%20%28Europe%29.chd","filesize":461981002,"score":7.6,"genres":"Adventure > Sports > 3rd-person (Other) > Puzzle elements > Fishing > Golf > Snowboarding / skiing > Licensed","desc":"<p>Goofy stars in this 3D interactive adventure where he notices 5 photos in his home are missing three elements each. He must search his house and around his neighborhood for the missing items and place them back in the correct photos. Each fully restored photo will trigger a classic Goofy cartoon concerning the photo's topic such as \"Art of Skiing\" and \"The Blue Ribbon.\"  Finding a specific number of film canisters throughout the game will also trigger a sixth photo.  </p><p>There are 15 different environments such as the home's main floor, upstairs, basement, garage, attic, kitchen, Max's bedroom, recreation room, and back- and front yard. Objects that Goofy can interact with are highlighted, such as the furnace and refrigerator.  There are five additional sports-themed mini-games including golf, skiing, racing, and fishing that are triggered when certain items are found.  Also, there's a phone quiz in the foyer that gives players multiple choice trivia questions about Disney characters such as Mickey Mouse, Donald Duck, Pluto and others.</p>"},{"name":"Disney's Hercules","year":1997,"developer":"Eurocom Developments Ltd","url":"psx-chd-roms-d/Disney%27s%20Hercules%20Action%20Game%20%28USA%29%20%28Rerelease%29.chd","filesize":217131730,"score":7.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Fantasy > Licensed","desc":"<p>The game is based on Disney's animated cartoon movie. You take control of Hercules, son of the god Zeus and a mortal woman, the strongest man in the world and the legendary hero in the Greek mythology. Your goal is to prove yourself worthy of being admitted to Mount Olympus, the residence of gods, and to become a god yourself. You must commit heroic deeds and overcome various obstacles to show your strength and courage. Hades, the overlord of the dead, is making it even more difficult for you by sending fearsome Titans to stop you.</p><p>This is a 2D platform action game. Hercules can jump, grab ledges, swing on poles, and jump while running. He has a variety of attack moves at his disposal. He can execute a basic attack with his sword, or pull out different combo attacks. He can also Power Punch enemies, but he needs time to charge for this powerful attack. He can even slam the ground to reveal secret areas by performing a certain move while jumping. There are also different power-ups to collect, such as coins to grant bonus points at the end of the level, Hercules Action Figures to increase your hero rating, and upgrades to your sword - Sonic, Lightning, and Fireball swords.</p>"},{"name":"Disney's Lilo & Stitch: Trouble in Paradise","year":2002,"developer":"Blitz Games Ltd","url":"psx-chd-roms-d/Disney%27s%20Lilo%20%26%20Stitch%20-%20Trouble%20in%20Paradise%20%28Europe%29.chd","filesize":249864360,"score":6.6,"genres":"Action > Behind view > Platform > Licensed","desc":"<p>This is a 3D kids action-adventure based on the Disney animated movie. You take turns controlling Stitch, the cute alien experiment that can turn deadly, to avoid the bounty hunters looking for him and Lilo, the Hawaiian girl being raised by her older sister, to use her voodoo magic to scare enemies throughout levels in various parts of the island.  </p><p>There are varied enemies, ranging from a turtle to man-eating plants to alien bounty hunters.  There are three sections of five levels each and Lilo &amp; Stitch must navigate various moving platforms. Both characters can run, jump and butt-stomp, along with some unique moves of their own.  As they progress, 100 tokens and 4 special icons must be collected in each level as well as different power-ups, health and lives. The items will be found on the ground, in breakable pots or high in the air which require jumping around on platforms to get.  There's also a few mini-games like a timed race against an opponent.  Hidden photos and movie clips are bonuses to be revealed between levels.</p>"},{"name":"Disney's Pooh's Party Game: In Search of the Treasure","year":2001,"developer":"Doki Denki SA","url":"psx-chd-roms-d/Disney%27s%20Pooh%27s%20Party%20Game%20-%20In%20Search%20of%20the%20Treasure%20%28USA%29.chd","filesize":327547521,"score":"","genres":"Action > 3rd-person (Other) > Board game > Licensed","desc":"<p><em>Disney's Pooh's Party Game</em> is a board game for up to 4 players based on Disney's <em>The New Adventures of Winnie the Pooh</em> animated series. The game starts when Owl discovers a treasure map, but in unfortunate turn of events the map gets glued to Gopher's back while he is chased by the swarm of bees. To get the treasure map the player needs to follow Gopher across the game board. </p><p>The squares on the board contain mini-games, honey pots or other surprises. When the player's character lands on a square, he then must participate in a mini-game, and success or failure will determine how many steps he'll advance on the game board. It is also possible to buy the steps for a certain number of honey pots. The mini-games include kart racing, a pinball game, fruit collect-a-thon, a Bomberman-like game and so on. The players can choose to control one of their favorite characters: Pooh, Piglet, Rabbit, Roo, Owl or Tiger.</p><p>There's also Quick mode which lets up to 4 players play any unlocked mini-games against each other or AI straight from the menu.</p>"},{"name":"Disney's Tarzan","year":1999,"developer":"Eurocom Developments Ltd","url":"psx-chd-roms-d/Disney%27s%20Tarzan%20%28Europe%29.chd","filesize":296934061,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>We could call it a platform game if it wasn't 3D, but it still looks like a platform game. Much alike to \"Lion King\" only seeable made of polygons. This little arcade game puts you in a role of Tarzan, a soon-to-be king of the jungle, leads you to a bunch of quest levels where you can collect coins, map pieces, 'TARZAN' letters and other stuff, as well as call your monkey friend from time to time that'll give you a brief explanation of things flyin' around. After each completed level, there will be a brief animations that they've probably taken from Disney's cartoon.</p>"},{"name":"Disney's The Emperor's New Groove","year":2000,"developer":"Argonaut Games PLC","url":"psx-chd-roms-d/Disney%27s%20The%20Emperor%27s%20New%20Groove%20%28Europe%29.chd","filesize":376573526,"score":7.1,"genres":"Action > 3rd-person (Other) > Side view > Platform > Puzzle elements > Stealth > Licensed","desc":"<p><em>Disney's The Emperor's New Groove</em> is a 3D platform game based on the Disney animation movie with the same name. Like in the movie a selfish and cruel emperor is cursed and turned into a llama. You play as this former emperor and cynical llama in his search for a cure for his curse.</p><p>The game features various kinds of levels ranging from traditional 3D platform levels, to ''rollercoaster\"-style levels with a forward scrolling camera where you have to avoid obstacles. Other levels feature more 2D platform gameplay and even sneaking segments mimicking Metal Gear Solid. </p><p>The llama can walk and jump around and kick and spit at opponents. The game and the cutscenes all contain many humorous situations and dialogues. The game comes with short scenes from the actual movie with the actual voice actors.</p>"},{"name":"Disney's The Lion King: Simba's Mighty Adventure","year":2001,"developer":"Paradox Development","url":"psx-chd-roms-d/Disney%27s%20The%20Lion%20King%20-%20Simba%27s%20Mighty%20Adventure%20%28Europe%29.chd","filesize":425204376,"score":6.5,"genres":"Action > 3rd-person (Other) > Platform > Licensed","desc":"<p>Play along as Simba and watch him grow from the fearless cub into the king of the jungle. This game spans across both of Disney's movies - 'The Lion King' and its sequel 'Simba's Pride'.</p><p>Have Simba run around jumping, rolling, pouncing and roaring while collecting pickups and meeting various other familiar characters from the movie(s), in his now 3D world.</p>"},{"name":"Disney's The Little Mermaid II","year":2000,"developer":"Blitz Games Ltd","url":"psx-chd-roms-d/Disney%27s%20The%20Little%20Mermaid%20II%20%28Europe%29.chd","filesize":339974605,"score":"","genres":"Action > Side view > 2D scrolling > Direct control > Fantasy > Licensed","desc":"<p>Generally following along with the plot of The Little Mermaid I and II, the game is a 2D collectathon with 3D graphics.</p><p>The game features over 30 minutes of movie footage, 12 levels, and 3 bonus minigames. Following the source material, most of the levels take place underwater, allowing full freedom of movement. (Within the 2D plane, of course.) On land, movement is the standard run and jump type. In all levels, there are coins and pearls to collect.</p>"},{"name":"Disney's Treasure Planet","year":2002,"developer":"Magenta Software Ltd.","url":"psx-chd-roms-d/Disney%27s%20Treasure%20Planet%20%28Europe%29.chd","filesize":254943281,"score":6.2,"genres":"Action > Behind view > Mini-games > Puzzle elements > Steampunk > Licensed","desc":"<p><em>Disney's Treasure Planet</em> is a 3D action-adventure platform game for the PlayStation played from a behind view perspective that is based on the 2002 movie of the same name. The game follows Jim Hawkins and his search for the legendary treasure of pirate captain Flint.</p><p>In the game, the player takes control of Jim and has to navigate him through the different levels. The player has the ability to jump and fight enemies. Jims’s shape-shifting pet, Morph can be used as a glider to jump farther. In some sections of the game the player has to navigate Jim on his solar surf plank or a boat and avoid obstacles.</p><p>For the PlayStation 2, a different 3D game was released. The Game Boy Advance also received a different 2D game.</p>"},{"name":"Disney's Winnie the Pooh: Kindergarten","year":2002,"developer":"Creative Capers Entertainment, Inc.","url":"psx-chd-roms-d/Disney%27s%20Winnie%20the%20Pooh%20-%20Kindergarten%20%28USA%29.chd","filesize":122884327,"score":"","genres":"Educational > 1st-person > Top-down > Graphics / art > Math / logic > Music > Pre-school / toddler > Reading / writing > Licensed","desc":"<p><em>Disney's Winnie the Pooh: Kindergarten</em> is a children's educational title from Disney, it's part of a series which includes Disney's Winnie the Pooh: Toddler  and Disney's Winnie the Pooh Preschool. Some parts of all these titles, such as the introduction look the same.</p><p>The signing in post is also the place where players and other interested parties can see progress and print off certificates. The first time the player signs in they will see a scene showing Christopher Robin leaving for school, \"I Wish I could go to school\" says Pooh sadly, \"Well why don't we have a school in the hundred acre wood\" replies Piglet. Owl says he thinks it's a splendid idea and claims it as his own. After this the player is presented with a map of the hundred acre wood which will be their starting point on future sessions. The activities shown on the map are;  </p><ul><li><p>Printing: Here the player can print name tags, book marks and worksheets etc</p></li><li><p>Musical Mix &amp; Match: The player is presented with two groups of instruments. They select one from the four on the left and one from the four on the right. These combine in the centre to make a new instrument which the player can play by clicking on the keys/strings. There are icons along the bottom of the screen to play a backing track - just one available, record, playback, save and play a saved tune</p></li><li><p>Number Balloons: Roo's game resembles a fairground side show, it has a striped roof and at the top of the screen running left to right are the numbers one to twenty - one number per stripe. Roo releases a random number of balloons and the player must click on each balloon once until all are counted, the balloons can be clicked in any order but all of them must be clicked. Then the player selects the number from the awning that corresponds to the number of balloons displayed. When the get the answer correct they can/must pop all the balloons and the process repeats</p></li><li><p>Thoughtful Place: Pooh is in the woods, he's at a place that's not quite a Thoughtful Place yet so making it one is the player's task. To achieve this they use the icons along the bottom of the screen one changes the sky, another changes the scenery, one changes the season, another adds music - just the one track, then items such as logs, trees, ponds, flowers can be added while another button makes any selected object larger or smaller. There are also icons to delete an object, wipe the whole scene, plus save/load icons</p></li><li><p>Treasure Hunt: This gets the player familiar with maps and directions. On the right is a map with an overlaid grid, Tigger appears here usually somewhere near the middle. On the left is a smaller grid and beneath it is a compass, instructions appear in the small grid such as 'South to tree' and the player must click South on the compass to move Tigger around the map. This continues until he finds the treasure.</p></li><li><p>Word Shop: Owls library was disturbed by a strong wind and he needs help to put pages back into his book. On the easy setting the player is shown a book with, say, a 'K' on the left and across the top of the screen will be three pictures one of which will have the word 'King' and the picture of a King on it. These match so the player clicks on the picture, drags it to the right hand page of the book and continues. On the harder settings the book will have a picture of a king and across the top of the screen will be three pages one of which will just bear the word 'King'</p></li><li><p>Shape Sorting: This is Rabbit's game and it is basically two shelves with an assortment of three shapes, on the easy setting each shape is a different colour, on the top and three bottles below. The object is to put the right shape into the right bottle. If the player clicks on the bottle they will hear 'This is a rectangle' or whatever is appropriate</p></li></ul><p>All games have three difficulty settings and odd animations that pop up, apparently at random, to pique the player's interest. When the player completes a game they earn a star, there are fourteen stars in all and there's a certificate that can be printed out.</p>"},{"name":"Disney's Winnie the Pooh: Preschool","year":2002,"developer":"Disney Interactive Victoria","url":"psx-chd-roms-d/Disney%27s%20Winnie%20the%20Pooh%20-%20Preschool%20%28USA%29.chd","filesize":439753699,"score":"","genres":"Educational > Graphics / art > Math / logic > Pre-school / toddler > Reading / writing > Licensed","desc":"<p><em>Disney's Winnie the Pooh Preschool</em> is a point and click educational game based on characters and material created by the author/illustrator team of A.A. Milne and E.H. Shepard. It is a companion game to Disney's Winnie the Pooh Toddler and Disney's Winnie the Pooh Kindergarten.</p><p>Waking up from a nap in the Hundred Acre Wood, a puzzled Winnie the Pooh has the feeling he's forgotten something important and somehow arrives at the idea that it must be Eeyore's birthday. The player follows Pooh in his journey around the Wood to spread the news, dropping in on Kanga, Tigger, Owl, Piglet and Rabbit and helping them prepare a party through various activities and minigames.</p><ul><li>Kanga's Alphabet Soup - Kanga's soup is missing some letters; the player must match the letters from her cookbook and drop them into the soup</li><li>Pooh's Dream - helping Pooh sequence the pictures in his dream will allow him to rescue a stranded Tigger</li><li>Owl's Family Tree - the pictures in Owl's photo album are way out of order; the player must help by grouping similar photos</li><li>Rabbit's Canning Encounter - Rabbit has to finish his canning before he comes to the party; the player helps by attaching number labels and counting fruits &amp; vegetables</li><li>Tigger's Popcorn Calliope - the player matches sounds to help Tigger finish building his music machine (which also makes popcorn!)</li><li>Piglet's Pictures - the player follows Piglet's coloring guide to finish his pictures, and then adds collage materials. At higher levels he learns to mix colors</li></ul><p>As the player completes each minigame, party decorations and gifts from the characters appear in Christopher Robin's Party Place. Items there are a measure of the player's progress, or a parent can access the Progress Chart from the sign-in screen. The chart describes the skills covered by each activity, which include letter recognition, sequencing, same/different, auditory discrimination, color theory, number recognition and counting, among others.</p><p>From the map, players can also access Pooh's Print 'n' Learn which is a large collection of print projects - stickers, flash cards, bookmarks, ID cards, and an entire printable workbook that builds on the skills covered in the game.</p>"},{"name":"Disney Pixar A Bug's Life","year":1998,"developer":"Traveller's Tales (UK) Ltd.","url":"psx-chd-roms-d/Disney-Pixar%20A%20Bug%27s%20Life%20%28Europe%29.chd","filesize":472532391,"score":6.8,"genres":"Action > Behind view > Platform > Fantasy > Licensed","desc":"<p>Based on the Disney/Pixar 3D animated film, you must guide Flik as he sets out to find a group of warrior insects to help his colony of ants to fight off the hungry grasshoppers.</p><p>Travel through the 3D insect world, using the many elements of nature to fight the enemy, to get to the end of each stage, in turn saving fellow ants and knocking the grasshoppers quest for ant domination on the head.</p>"},{"name":"Disney Pixar Buzz Lightyear of Star Command","year":2000,"developer":"Traveller's Tales (UK) Ltd.","url":"psx-chd-roms-d/Disney-Pixar%20Buzz%20Lightyear%20of%20Star%20Command%20%28Europe%29.chd","filesize":324119130,"score":5.7,"genres":"Action > Behind view > Platform > Sci-fi / futuristic > Licensed","desc":"<p>Buzz Lightyear is based on an animated movie and television series of the same name. Buzz Lightyear is an elite space ranger, who travels from planet to planet hunting down supervillians.  </p><p>In this game, you control Buzz through 14 missions on eight different planets.  In each mission, your goal is to race to the end of the level before the bad guy does.  If you do so successfully, you face off against the villian, and hopefully capture them. In addition to capturing the villain, there are secondary objectives like collecting robot parts and getting the fastest time through the level.</p><p>Buzz Lightyear of Star Command is a spinoff of the Toy Story series of movies.</p>"},{"name":"Disney Pixar Toy Story 2: Buzz Lightyear to the Rescue!","year":1999,"developer":"Traveller's Tales (UK) Ltd.","url":"psx-chd-roms-d/Disney-Pixar%20Toy%20Story%202%20-%20Buzz%20Lightyear%20to%20the%20Rescue%21%20%28USA%29%20%28Rev%201%29.chd","filesize":412271311,"score":6.6,"genres":"Action > 1st-person > 3rd-person (Other) > Behind view > Cinematic camera > Real-time > Platform > Direct control > Contemporary > Licensed","desc":"<p>Woody has been stolen from the bedroom, ready to be sold to the highest bidder by an evil toy collector. It's up to good friend Buzz Lightyear to fight his way through from the bedroom to the outside world in order to save Woody from the toy market and bring him home.</p><p>All of the characters from the 3D animated movie appear through-out this 3D platform game to help Buzz get to where he is needed. Along with the use of his cannon, Buzz can jump to hard to reach places, also useful in collecting the hidden coins that open bonus levels.</p>"},{"name":"Disney Pixar Toy Story Racer","year":2001,"developer":"Traveller's Tales (UK) Ltd.","url":"psx-chd-roms-d/Disney-Pixar%20Toy%20Story%20Racer%20%28Europe%29.chd","filesize":139296699,"score":7,"genres":"Racing / Driving > 3rd-person (Other) > Licensed","desc":"<p><em>Toy Story Racer</em> is a kart racing game based on the movie <em>Toy Story</em>. Play as 12 of the Toy Story characters on 18 courses. The courses are based on locations featured in the movie.</p>"},{"name":"Disney Pixar's Monsters, Inc.: Scare Island","year":2001,"developer":"Artificial Mind & Movement","url":"psx-chd-roms-d/Disney-Pixar%20Monsters%2C%20Inc.%20-%20Scare%20Island%20%28Europe%29.chd","filesize":393612056,"score":6.8,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>This is the action game based on the movie from Disney/Pixar, \"Monsters Inc.\". You play as either James P. \"Sulley\" Sullivan (the big hairy monster) or Mike Wazowski (the small green \"walking eye\"). The goal of the game is to become Masters of Scare. The first level is training, where you learn movement and how to scare someone. Scaring is done by standing in front of the person to be scared and pressing a combo of buttons (your playing figure will then perform really funny moves and sounds). To be scary enough, you need to collect monster slime - some persons can only be scared with a special amount of monster slime.</p><p>The game is presented in 3D graphics and all of the voices are from the movie.</p>"},{"name":"Disruptor","year":1996,"developer":"Insomniac Games, Inc.","url":"psx-chd-roms-d/Disruptor%20%28Europe%29.chd","filesize":440466646,"score":7.6,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>Disruptor is a FPS with a few twists such as cut-scenes with actors, psionics as well as weapons and specific goals on your missions.  As a member of Earth's psionic troops you must perform missions for the security of the planet.  As you progress through the stages you get access to bigger weapons as well as more psionic implants that give you special abilities.</p>"},{"name":"Diver's Dream","year":1998,"developer":"Konami Computer Entertainment Sapporo Co., Ltd","url":"psx-chd-roms-d/Diver%27s%20Dream%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":353196308,"score":6.9,"genres":"Action > Simulation > 3rd-person (Other) > Real-time > Puzzle elements","desc":"<p><em>Diver's Dream</em> is a game inspired by Luc Besson's movie <em>The Big Blue</em>. The player meets an old man named Roberto Meyer, who's life long dream is to explore the wreck of the ship Gigantic Matilda. Together with him and his grand daughter Olivia, the player sets out to start exploring the vast sea bed and finally maybe even Gigantic Matilda...</p><p>The player starts out wearing just a pair of swim trunks, and in order to reach the great depths of the sea the equipment needs to be up to date. The game is mission based and the player will have collect treasures and valuables from the sea bed and with the money earned, upgrade the scuba gear and advance to more difficult missions with greater rewards.</p><p>The game is semi free roaming in nature, meaning that the player gets to explore a big area at the time. Options are to collect treasure, fight off aggressive underwater creatures or simply play around with the friendly dolphins.</p>"},{"name":"Divide, The: Enemies Within","year":1997,"developer":"Radical Entertainment Inc.","url":"psx-chd-roms-d/Divide%2C%20The%20-%20Enemies%20Within%20%28USA%29.chd","filesize":187595304,"score":6.8,"genres":"Action > 3rd-person (Other) > 2D scrolling > Metroidvania > Platform > Direct control > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In <em>The Divide: Enemies Within</em>, the player takes control of an explorer on an alien planet. After they land to investigate, they are attacked, where the player is frozen and their partner kidnapped. After being thawed, the player takes control of a mech and sets out to rescue their partner and destroy the alien menace.</p><p>The basic gameplay has the player explore through eight different worlds with a total of over 100 different stages in a 3-D environment. The player explores the levels, collecting new weapons and power-ups to fight out the 20 different enemies scattered throughout the level. At the end of each level, the player must fight off an enemy boss before fighting the final boss at the end of the game.</p>"},{"name":"Dodgem Arena","year":1998,"developer":"Formula Game Developments","url":"psx-chd-roms-d/Dodgem%20Arena%20%28Europe%29.chd","filesize":324694503,"score":6.8,"genres":"Action > Racing / Driving > Sports > Behind view > Shooter > Hovercraft > Sci-fi / futuristic","desc":"<p>Participate in the thrilling sport of the Dodgem Elite League.</p><p>Dodgem Arena is a futuristic racing game that takes place in 2049 AD. In this racing sport four players controlling so-called dodgems hover in huge bowl-shaped arenas, while trying to shoot an ice hockey puck into a goal at the top of the arena.</p><p>You can choose between various dodgems and during the match you can stockpile weapons, ammo and shields to improve your dodgem. There are six stadiums and each match has four rounds. The first round starts with four pucks, the second with three, until one is left in the final round.</p>"},{"name":"DoDonPachi","year":1998,"developer":"CAVE Co., Ltd.","url":"psx-chd-roms-d/DoDonPachi%20%28Japan%29%20%28Rev%201%29.chd","filesize":254424588,"score":8,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>DoDonPachi</em> is Cave's sequel to their 1995 arcade release DonPachi. Like its predecessor, <em>DoDonPachi</em> is a vertical-scrolling and military- and robot-themed manic shooter featuring a giant mecha bee for a final boss. The player's ship and the gameplay are virtually the same as in <em>DonPachi</em>, with one of three weapons selected at start then levelled-up by collecting dropped power-ups.</p>"},{"name":"DogDay","year":1998,"developer":"Eyst Pty Ltd."},{"name":"Doki Doki Poyatchio!!","year":1998,"developer":"Studio Saizensen Ltd.","url":"psx-chd-roms-d/Doki%20Doki%20Poyatchio%21%21%20%28Japan%29.chd","filesize":273022291,"score":"","genres":"Adventure > Simulation > Top-down > 2D scrolling > Anime / Manga > Real-time > Japanese-style adventure > Life / social simulation > Direct control > Fantasy","desc":"<p><em>Doki Doki Poyatchio</em> is a relaxed life simulation game. Players take control of a boy living out a month on his summer vacation. His main job is delivering bread for his cousin Marin, but beyond that players are free to spend their time as they please. They can befriend a large number of characters or explore areas outside the town. Each of the game's NPCs follows their own schedule throughout the days, and events can occur based on how they feel about the player.</p>"},{"name":"Doki Doki Pretty League: Nekketsu Otome Seishunki (Disk 1)","year":1998,"developer":"","url":"psx-chd-roms-d/Doki%20Doki%20Pretty%20League%20-%20Nekketsu%20Otome%20Seishunki%20%28Japan%29%20%28Disc%201%29.chd","filesize":486106771,"score":"","genres":"Simulation > Sports > Anime / Manga > Turn-based > Baseball","desc":"<p>In this game you play a coach for an all-girl baseball team. The game plays like a managerial game where you have to keep track of the schedule, add practice time for the girls and play games to advance in the series. But to keep the team happy you must also make sure they have a good social life as well as a well thought out training regime.</p>"},{"name":"Doki Doki Pretty League: Nekketsu Otome Seishunki (Disk 2)","year":1998,"developer":"","url":"psx-chd-roms-d/Doki%20Doki%20Pretty%20League%20-%20Nekketsu%20Otome%20Seishunki%20%28Japan%29%20%28Disc%202%29.chd","filesize":476329803,"score":"","genres":"Simulation > Sports > Anime / Manga > Turn-based > Baseball","desc":"<p>In this game you play a coach for an all-girl baseball team. The game plays like a managerial game where you have to keep track of the schedule, add practice time for the girls and play games to advance in the series. But to keep the team happy you must also make sure they have a good social life as well as a well thought out training regime.</p>"},{"name":"Doki Doki Pretty League: Nekketsu Otome Seishunki (Disk 3)","year":1998,"developer":"","url":"psx-chd-roms-d/Doki%20Doki%20Pretty%20League%20-%20Nekketsu%20Otome%20Seishunki%20%28Japan%29%20%28Disc%203%29.chd","filesize":136336375,"score":"","genres":"Simulation > Sports > Anime / Manga > Turn-based > Baseball","desc":"<p>In this game you play a coach for an all-girl baseball team. The game plays like a managerial game where you have to keep track of the schedule, add practice time for the girls and play games to advance in the series. But to keep the team happy you must also make sure they have a good social life as well as a well thought out training regime.</p>"},{"name":"Doko Demo Issyo","year":1999,"developer":"Bomber eXpress Co., Ltd.","url":"psx-chd-roms-d/Doko%20Demo%20Issho%20%28Japan%29%20%28Rev%201%29.chd","filesize":239552132,"score":"","genres":"Simulation > 1st-person > Menu structures > Contemporary > Comedy","desc":"<p>Doko Demo Issyo is a hybrid of virtual pet and chat toy. It features several characters collectively referred to as “Pokepi” (Pocket People), including a white cat named Toro Inoue, a rabbit named Jun Mihara, and a dog named Pierre Yamamoto. Toro went on to be a PlayStation mascot in Japan. The game revolves around the use of the PocketStation accessory to take your Pokepi around with you, where you can chat and interact with them.</p>"},{"name":"Dokonjō Gaeru: The Mahjong","year":2002,"developer":"Yuki Enterprise"},{"name":"Dōkyūsei 2","year":1997,"developer":"Elf Co., Ltd."},{"name":"DonPachi","year":1996,"developer":"CAVE Co., Ltd.","url":"psx-chd-roms-d/DonPachi%20%28Japan%29.chd","filesize":141748661,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>DonPachi</em> is a 1995 vertical manic shoot-'em-up originally in arcades and was the first game from the developer Cave. Settings are mainly woodland and enemies are military vehicles and robots, culminating in the final boss, a huge robotic bee. One of three weapon configurations is chosen at start and then levelled up through dropped power-ups. <em>DonPachi</em> was ported to the Sega Saturn and Sony Playstation in 1996.</p>"},{"name":"Doom","year":1995,"developer":"id Software, Inc.","url":"psx-chd-roms-d/Doom%20%28Europe%29.chd","filesize":182311390,"score":7,"genres":"Action > Compilation > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Horror","desc":"<p>This release of <em>Doom</em> is based on The Ultimate Doom and Doom II and contains most of the levels and enemies from both games as well as about half a dozen exclusive maps.</p><p>The Doom maps are based off the Jaguar version and hence feature the same simplifications as that release. The PC Ultimate Doom and Doom II maps were converted especially for this release and also feature some simplifications, though not to the degree of the Doom maps. Some Doom II enemies have been added to the Doom and Ultimate Doom maps.</p><p>The engine has been upgraded to a 32 bit renderer allowing for smoother distance shading and more notably, in the PS1 version, coloured lighting. This version of Doom features also entirely new sounds and music.</p>"},{"name":"Dora the Explorer: Barnyard Buddies","year":2003,"developer":"Santa Cruz Games"},{"name":"Doraemon 2: SOS! Otogi no Kuni","year":1997,"developer":"Pre-Stage Inc.","url":"psx-chd-roms-d/Doraemon%202%20-%20SOS%21%20Otogi%20no%20Kuni%20%28Japan%29.chd","filesize":297296285,"score":"","genres":"Action > Side view > Anime / Manga > Platform > Licensed","desc":"<p>Doraemon has brought a giant television from the future for Nobita and his friends to watch, but when they turn it on to watch some famous fairy tales, they find that all the heroes have been captured by an evil demon! Using another device, Doraemon transforms each of his friends into one of the famous heroes, and they enter the storybook world to rescue the captured heroes.</p><p><em>SOS! Otogi no Kuni</em> (\"SOS! Fairy Tale Kingdom\") is a side-scrolling platform action game based on the popular children's cartoon <em>Doraemon</em>. Each stage is based on a famous fairy tale, with one of the children taking the role of the lead character to rescue the story's hero. For example, Nobita's stage casts him as Momotaro, while Shizuka's has her playing Little Red Riding Hood.</p><p>There are five stages, with each one featuring a different playable character, that can be played in any order. Each stage is broken into multiple sections, and includes at least one boss battle. Once all five stages are cleared, a sixth stage opens up.</p>"},{"name":"Doraemon 3: Makai no Dungeon","year":2000,"developer":"KAN's Co., Ltd.","url":"psx-chd-roms-d/Doraemon%203%20-%20Makai%20no%20Dungeon%20%28Japan%29.chd","filesize":63163061,"score":"","genres":"Role-playing (RPG) > Top-down > Turn-based > Licensed","desc":"<p>Nobita can't take it any more! His teacher yells at him at school, his mom yells at him at home, his friends make fun of him, and the girl he likes is spending her time with someone else. He runs home to Doraemon, begging him to find a place where he can hide from the world.</p><p>Doraemon uses one of his famous tools from the future and finds a hidden cave, deep underground. However, they soon stumble on an ancient altar and wind up releasing a strange (but friendly) creature named Bit. Nobita's friends find out, but when they head back into the cave, an ancient demon appears and kidnaps everyone but Nobita. Now he must explore the cave and find a way to rescue his friends!</p><p><em>Makai no Dungeon</em> is a dungeon-crawling roguelike in the tradition of Chunsoft's Mysterious Dungeon series, and one of many games based on the popular children's cartoon <em>Doraemon</em>. It plays just like its better-known cousin, featuring randomly-generated dungeons, and a turn-based action system where each action the player takes is also an action for all enemies.</p><p>The goal is to explore each of the dungeons and rescue Nobita's friends, who will become playable as they are found. Each level of each dungeon is filled with various items, traps, and enemies. There is also a PocketStation mini-game included, where the player can earn extra items to help in the main game.</p>"},{"name":"Doraemon: Nobita to Fukkatsu no Hoshi","year":1996,"developer":"Epoch Co., Ltd.","url":"psx-chd-roms-d/Doraemon%20-%20Nobita%20to%20Fukkatsu%20no%20Hoshi%20%28Japan%29.chd","filesize":179001902,"score":"","genres":"Action > Side view > Anime / Manga > Platform > Sci-fi / futuristic > Licensed","desc":"<p>One winter, the robotic blue cat from the future, Doraemon, takes Nobita and his friends on a trip into outer space. However, while they're flying across the galaxy, they wind up making an emergency landing on a strange planet after a collision... and are attacked by strange robots as soon as they land! Now, Nobita and his friends must figure out what's happened on this strange planet, and find a way to repair their ship and get home!</p><p><em>Doraemon: Nobita to Fukkatsu no Hoshi</em> (\"Doraemon: Nobita and the Planet of Revival\") is a side-scrolling action platformer, and one of the many titles based on the long-running children's cartoon. The game is divided into short platform stages, each with a specific objective or goal that must be completed to move on. Between stages, there are voiced visual novel-style sequences which move the story forward. There are sometimes choices available in these sections, which can affect which stage the player reaches next.</p>"},{"name":"Dosukoi Densetsu","year":1999,"developer":"Natsume Co., Ltd.","url":"psx-chd-roms-d/Dosukoi%20Densetsu%20%28Japan%29.chd","filesize":103254299,"score":"","genres":"Simulation > Sports > Fixed / flip-screen > Anime / Manga > Managerial / business simulation > Wrestling > Contemporary","desc":"<p>Become a master of the sumo wrestler stable and manage the stable!<br>Scout new promising disciples and raise them to become strong wrestlers by managing their training, meals and rests.<br>As the parameter increases, you will be able to use more powerful techniques. Purchase items from the merchants when you have enough funds in order to train the wrestlers with more efficiency!<br>While training the wrestlers maintain your business and aim for the Yokozuna rank!</p>"},{"name":"Double Cast","year":1998,"developer":"Sugar & Rockets, Inc."},{"name":"Double Dragon","year":1996,"developer":"Technos Japan Corp.","url":"psx-chd-roms-d/Double%20Dragon%20%28Japan%29.chd","filesize":289307951,"score":6.8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Martial arts","desc":"<p>Released around the same time as the film of the same name and loosely based on its story, this installment in the Double Dragon series also moves away from the traditional roam-the-streets-fighting to a pure one-on-one fighter. There are ten characters to choose from, including Billy and Jimmy and the game has colorful interactive backgrounds, screen zooming, over-the-top special moves and with the inclusion of double jumps, combos, charges for the losing player and counter hits, there is plenty of room for advanced fighting strategies.</p>"},{"name":"Double Shooting, The: RayStorm x RayCrisis","year":2001,"developer":""},{"name":"Dracula: The Last Sanctuary (Disk 1)","year":2000,"developer":"Wanadoo Edition","url":"psx-chd-roms-d/Dracula%20-%20The%20Last%20Sanctuary%20%28USA%29%20%28Disc%201%29.chd","filesize":464269191,"score":6.7,"genres":"Adventure > 1st-person > Puzzle elements > Detective / mystery > Horror","desc":"<p>You are Jonathan Harker. You are in search of the Count himself... to save your wife Mina. Follow his trail from London all the way to Transylvania, decipher the scant clues available, and see if you can hunt down Dracula... or be hunted. </p><p><em>Dracula: The Last Sanctuary</em> is a 1st person adventure.</p>"},{"name":"Dracula: The Last Sanctuary (Disk 2)","year":2000,"developer":"Wanadoo Edition","url":"psx-chd-roms-d/Dracula%20-%20The%20Last%20Sanctuary%20%28USA%29%20%28Disc%202%29.chd","filesize":375248769,"score":6.7,"genres":"Adventure > 1st-person > Puzzle elements > Detective / mystery > Horror","desc":"<p>You are Jonathan Harker. You are in search of the Count himself... to save your wife Mina. Follow his trail from London all the way to Transylvania, decipher the scant clues available, and see if you can hunt down Dracula... or be hunted. </p><p><em>Dracula: The Last Sanctuary</em> is a 1st person adventure.</p>"},{"name":"Dracula: The Resurrection (Disk 1)","year":2000,"developer":"index+","url":"psx-chd-roms-d/Dracula%20-%20The%20Resurrection%20%28USA%29%20%28Disc%201%29.chd","filesize":429065550,"score":6.8,"genres":"Adventure > 1st-person > 3rd-person (Other) > Full Motion Video (FMV) > Puzzle elements > Horror","desc":"<p>You're a young man and Dracula has done his deed to your girl. Now, you must travel to Transylvania. Once there, you'll have to scour the countryside and find a way into the castle. Once there, now you must find and defeat the evil one himself. But, before you can do that, you must face his three friends and three demons.</p>"},{"name":"Dracula: The Resurrection (Disk 2)","year":2000,"developer":"index+","url":"psx-chd-roms-d/Dracula%20-%20The%20Resurrection%20%28USA%29%20%28Disc%202%29.chd","filesize":459632198,"score":6.8,"genres":"Adventure > 1st-person > 3rd-person (Other) > Full Motion Video (FMV) > Puzzle elements > Horror","desc":"<p>You're a young man and Dracula has done his deed to your girl. Now, you must travel to Transylvania. Once there, you'll have to scour the countryside and find a way into the castle. Once there, now you must find and defeat the evil one himself. But, before you can do that, you must face his three friends and three demons.</p>"},{"name":"Dragon Ball GT: Final Bout","year":1997,"developer":"Tose Co., Ltd.","url":"psx-chd-roms-d/Dragon%20Ball%20-%20Final%20Bout%20%28Europe%29.chd","filesize":68242939,"score":5.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Licensed","desc":"<p>Based on the popular anime series <em>Dragonball GT</em>, take control of Goku, Piccolo, Frieza, Cell, Buu and many other characters in full 3D battles. Game modes include Taisen mode (Battle mode), Tenkaichi Budoukai mode and Build Up mode (where you can increase your character's skills).</p>"},{"name":"Dragon Ball Z: Idainaru Dragon Ball Densetsu","year":1996,"developer":"BEC Co., Ltd.","url":"psx-chd-roms-d/Dragon%20Ball%20Z%20-%20Idainaru%20Dragon%20Ball%20Densetsu%20%28Japan%29.chd","filesize":172471499,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p><em>Idainaru Dragon Ball Densetsu</em> is a game that adds another <em>Dragon Ball</em> to the franchise of the same name and starts with the events of the Saiyan Saga and the fight with Vegeta and Nappa.</p><p>In <em>Idainaru Dragon Ball Densetsu</em> you don’t have your natural one on one fights. At the beginning of each fight you are given a total of 4 fighters (up to 6 later) from which you have to choose the 3 that you would like to participate in the battle that follows. Each fighter has 2 bars – a green and a yellow one. The green represents the life force and the yellow the power force which is depleted with every attack you do. At the bottom of the screen there is a blue bar and a red one that form a gauge called Power Balance. The reason for this gauge to be there is because your attacks don’t affect the enemies’ life bar directly. By continuously attacking the enemy the bar that represents your power (blue bar) increases while that of the enemy (red bar) decreases. When the blue bar covers all the gauge a random attack sequence, from the current character you’re controlling, is initiated and that’s how you can actually injure your opponents. The same can happen to you though if the enemy’s red bar covers all the gauge.</p>"},{"name":"Dragon Ball Z: Ultimate Battle 22","year":1995,"developer":"Tose Co., Ltd.","url":"psx-chd-roms-d/Dragon%20Ball%20Z%20-%20Ultimate%20Battle%2022%20%28Europe%29.chd","filesize":195128730,"score":4.9,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Licensed","desc":"<p><em>Dragon Ball Z: Ultimate Battle 22</em> is a 2D fighter that takes place in the Dragon Ball universe. Players choose between 22 characters (not including the secret ones) and fight in Story, Versus, Tournament and Power Battle modes.</p>"},{"name":"Dragon Beat: Legend of Pinball","year":1997,"developer":"Map Japan Co., Ltd."},{"name":"Dragon Knight 4","year":1997,"developer":"Elf Co., Ltd.","url":"psx-chd-roms-d/Dragon%20Knight%204%20%28Japan%29.chd","filesize":271893610,"score":7.5,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy > Adult","desc":"<p><em>Dragon Knight 4</em> is a sequel to Knights of Xentar. Years have passed after Takeru (a.k.a. Desmond, the hero of the previous Dragon Knight games) defeated the ultimate evil. He married his sweetheart Luna, and they had a son named Kakeru. This fifteen-year-old boy has one weakness: he likes naked female elves. But soon he learns that the evil wizard Lushifon wants to turn all people into stones and control the whole world while nobody is able to stop him. Together with the mysterious swordsman Eto and many other heroes, Kakeru must perform his ultimate quest and defeat Lushifon and his minions.</p><p>In this tactical role-playing game the player controls nine units in battles, assigned according to the class of the character who leads the unit. The opponents also form similar groups, and are also divided into classes. Each class has its own range, strengths, and weaknesses. There are many characters the players can recruit to the party, and they belong to different classes (barbarians, archers, magicians, etc.).</p><p>The adult content (scenes which include nudity) has been removed from the console releases. The PlayStation version has updated graphics and CG animations.</p>"},{"name":"Dragon Money","year":1999,"developer":"E.O. Imagination Inc."},{"name":"Dragon Quest IV: Michibikareshi Monotachi","year":2001,"developer":"Heart Beat","url":"psx-chd-roms-d/Dragon%20Quest%20IV%20-%20Michibikareshi%20Mono%20Tachi%20%28Japan%29.chd","filesize":221768819,"score":"","genres":"Role-playing (RPG) > 1st-person > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p><em>Dragon Quest IV: Michibikareshi Monotachi</em> is a remake of Dragon Warrior IV. </p><p>The remade version has received a complete graphical overhaul. It features fully 3D graphics and 2D sprites for characters; the visual style resembles that of Dragon Warrior VII. Battles now have backgrounds that represent the location the battle takes place in. Interaction with some of the environment is now physical, as the characters can visible raise, hold, and break barrels, pots, etc. The music has also been enhanced significantly, with orchestra-like quality. </p><p>The main gameplay change is the possibility to directly control characters who were AI-controlled in the original version. The AI system is still present, but the player can turn it off and command all the characters manually. A \"party talk\" feature is now available: it is possible to talk to the characters in the party at any time. The remake also features additional sub-quests and mini-games, such as building an immigrant town and monster collecting. A prologue as well as a post-game chapter were added to the game; the latter offers more insight into the game's story.</p>"},{"name":"Dragon Quest Monsters 1 - 2: Hoshiori no Yūsha to Bokujō no Nakama-tachi","year":2002,"developer":"","url":"psx-chd-roms-d/Dragon%20Quest%20Monsters%201%20%26%202%20-%20Hoshifuri%20no%20Yuusha%20to%20Bokujou%20no%20Nakamatachi%20%28Japan%29.chd","filesize":108997141,"score":"","genres":"Compilation > Role-playing (RPG) > 1st-person > Top-down > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Dragon Quest Monsters 1 - 2</em> is a compilation with updated graphics and interface of the following games:</p><ul><li>Dragon Warriors Monsters</li><li>Dragon Quest Monsters 2: Cobi's Journey</li><li>Dragon Quest Monsters 2: Tara's Adventure</li></ul>"},{"name":"Dragon Seeds","year":1998,"developer":"Jaleco Ltd.","url":"psx-chd-roms-d/Dragon%20Seeds%20%28USA%29.chd","filesize":165279633,"score":"","genres":"Strategy > 3rd-person (Other) > Fantasy","desc":"<p>Enter the world of Dragon Seeds!  As a Dragonsage you will need to genetically engineer, and train (essentially \"ranch\") your dragons for armed combat.  Plus, you can use memory card data from any game to create high powered dragons.  Dragon Seeds features a simple, RPG-like battle interface, tons of weapons and shields, and a two-player mode.</p>"},{"name":"Dragon Tales: Dragon Seek","year":2000,"developer":"Zed Two Game Design Studio","url":"psx-chd-roms-d/Dragon%20Tales%20-%20Dragonseek%20%28Europe%29.chd","filesize":226390611,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > Licensed","desc":"<p>Hide and Seek, The Dragon Tales Way!<br>Hide and seek is even more fun when played in Dragon Land. Help Max and Emmy search for Cassie, Ord, Zak and Wheezie... all over Dragon Land... be sure to search trees, caves, knucker holes and other secret places. You can also search for dragonberries and join a sing-along with your favorite friends from the TV Show, As you play, save your adventures on your memory card and share your very own storybook with friends.<br><br>* 4 engaging environments<br>* Play as Emmy or her brother Max<br>* Collect dragon berries for sing-along mode<br>* Create your own storybook<br>* Dragons hide in different places each time so you can play again and again<br>* 4 different skill levels</p>"},{"name":"Dragon Valor (Disk 1)","year":1999,"developer":"Now Production Co., Ltd.","url":"psx-chd-roms-d/Dragon%20Valor%20%28Europe%29%20%28Disc%201%29.chd","filesize":239052729,"score":6.2,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Isometric > Anime / Manga > Fantasy","desc":"<p><em>Dragon Valor</em> is a hack-and-slash medieval action game with some light rpg and puzzle-solving touches.</p><p>You control a series of generations of Dragon Valors, who are the wielders of the Dragon Valor sword, the only weapon that can kill the evil dragons plaguing your land. Using your sword and a series of magical spells, you'll progress through a plot that spans several generations in which you'll have to rid the land of dragons as a character, and then take on the role of his descendant whose skills depend on the actions and the power-up items you took in the earlier generation.</p><p>The game touts 2 different endings, as well as a character gallery as a bonus for finishing the game.</p>"},{"name":"Dragon Valor (Disk 2)","year":1999,"developer":"Now Production Co., Ltd.","url":"psx-chd-roms-d/Dragon%20Valor%20%28Europe%29%20%28Disc%202%29.chd","filesize":261303572,"score":6.2,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Isometric > Anime / Manga > Fantasy","desc":"<p><em>Dragon Valor</em> is a hack-and-slash medieval action game with some light rpg and puzzle-solving touches.</p><p>You control a series of generations of Dragon Valors, who are the wielders of the Dragon Valor sword, the only weapon that can kill the evil dragons plaguing your land. Using your sword and a series of magical spells, you'll progress through a plot that spans several generations in which you'll have to rid the land of dragons as a character, and then take on the role of his descendant whose skills depend on the actions and the power-up items you took in the earlier generation.</p><p>The game touts 2 different endings, as well as a character gallery as a bonus for finishing the game.</p>"},{"name":"Dragon Warrior VII (Disk 1)","year":2000,"developer":"Heart Beat","url":"psx-chd-roms-d/Dragon%20Warrior%20VII%20%28USA%29%20%28Disc%201%29.chd","filesize":473974629,"score":7.3,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>In \"Dragon Warrior VII\", you are a 16 year old son of a fisherman living on a small island called Estard. There is nothing else on the planet beside this island and the vast ocean surrounding it. One day, you and two friends make a discovery and realize the the world was once much more than Estard Island. So what caused it to disappear? In order to find that out, you travel to the past, where you hope to solve the mystery and to restore the present world the way it was before.</p><p>\"Dragon Warrior VII\" shares with its  predecessor the job system: you can assign character classes (\"jobs\") to your party members, and learn many different abilities, depending on the job you have chosen. The game maintains the traditional style of the series, including strictly medieval setting and first-person turn-based combat.</p>"},{"name":"Dragon Warrior VII (Disk 2)","year":2000,"developer":"Heart Beat","url":"psx-chd-roms-d/Dragon%20Warrior%20VII%20%28USA%29%20%28Disc%202%29.chd","filesize":473771400,"score":7.3,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>In \"Dragon Warrior VII\", you are a 16 year old son of a fisherman living on a small island called Estard. There is nothing else on the planet beside this island and the vast ocean surrounding it. One day, you and two friends make a discovery and realize the the world was once much more than Estard Island. So what caused it to disappear? In order to find that out, you travel to the past, where you hope to solve the mystery and to restore the present world the way it was before.</p><p>\"Dragon Warrior VII\" shares with its  predecessor the job system: you can assign character classes (\"jobs\") to your party members, and learn many different abilities, depending on the job you have chosen. The game maintains the traditional style of the series, including strictly medieval setting and first-person turn-based combat.</p>"},{"name":"DragonHeart: Fire & Steel","year":1996,"developer":"Funcom Oslo A/S","url":"psx-chd-roms-d/DragonHeart%20-%20Fire%20%26%20Steel%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":321941666,"score":4.9,"genres":"Action > Side view > 2D scrolling > Fantasy > Licensed","desc":"<p>This game is a tie-in for the movie directed by Rob Cohen starring Dennis Quaid and Sean Connery as the voice of Draco.</p><p>DragonHeart puts you in the sweaty medieval shoes of dragon hunter Bowen, as he faces the last dragons still surviving, and then ends up befriending one, Draco. With his help, he goes after King Einon, a former pupil of the dragon hunter, who has turned to evil.</p><p>Dragonheart's gameplay is quite similar to the Golden Axe series. Hack'n'slash your way through the nine levels of the game, killing dragons, befriending Draco and then going after Einon with Draco's help (who will toast everything in the way with his flame breath).</p>"},{"name":"Dragstars","year":2000,"developer":"JAM Co., Ltd.","url":"psx-chd-roms-d/Dragstars%20%28Europe%29.chd","filesize":71407550,"score":"","genres":"Racing / Driving > Behind view > Automobile > Street racing","desc":"<p>Dragstars puts you in the driving seat of one of 20 souped-up drag racers.<br>These cars are all about power, there's no sissy bends or corners just a mile of hot tarmac to cover as quickly as possible - and that's pretty quick!<br>Leave the rest blinking in the smoke of burnt rubber as you become a true Dragstar!</p>"},{"name":"Dreams","year":1998,"developer":"Cryo Interactive Entertainment","url":"psx-chd-roms-d/Dreams%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":216509366,"score":4.8,"genres":"Action > 3rd-person (Other)","desc":"<p>In this game you are Duncan - a man, who must save the worlds of Dream and Reality from dark force.</p><p>While in the PC version called Dreams to Reality you have a whole dream world to explore, progressing in a storyline, solving puzzles and having conversations with NPCs, the Playstation version is a simple arcade-style game: you're placed in a small area of floating isles where you must defeat all the monsters and collect all the objects in order for an exit to pop up. This exit will then lead to a new small area of floating isles. In this game you can choose between a variety of playable characters, all of which have a different skill and style of movement. Also, the intro video is completely different to that of the PC version.</p>"},{"name":"Driver","year":1999,"developer":"Reflections Interactive Limited","url":"psx-chd-roms-d/Driver%20%28Europe%29.chd","filesize":464357979,"score":7.6,"genres":"Racing / Driving > Simulation > Behind view > Automobile > Street racing > Vehicle simulator > Crime","desc":"<p>As Tanner, the player will go undercover to be the wheelman for a crime syndicate in order to break open a big case. On the way, they will have to eliminate competition, drive getaway cars, scare some people silly, evade plenty of police, dodge bad guys, smash through a few windows, save their love interest, and much more through four cities (Miami, San Francisco, Los Angeles, and New York). </p><p>The game gives a lot of freedom to navigate the streets of the various cities, allowing to cut through alleyways or across sidewalks and parks while smashing benches and driving over traffic cones, and provides a wide variety of vehicles to ride through the different missions, as well as the ability to perform various maneuvers such as donuts, 180 spins, or reverse spins.</p><p>Also includes several game modes such as Practice, Carnage (cause as much damage as possible), Dirt Track (time trials), Pursuit (the player chases after someone), Survival (four super cops chase after the player), Lose the Cop (the player must avoid a cop tailing on them), and Drive About (just drive about the city and admire the scenery). </p><p>There is also a full Director mode, allowing to place cameras to catch the best moments in the custom replay file.</p>"},{"name":"Driver 2 (Disk 1)","year":2000,"developer":"Reflections Interactive Limited","url":"psx-chd-roms-d/Driver%202%20%28USA%29%20%28Disc%201%29%20%28Rev%201%29.chd","filesize":403360596,"score":7.1,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Street racing > Vehicle simulator > Crime","desc":"<p>Tanner is back as an undercover driver, this time trying to survive amidst an international war between American and Brazilian gangs. The action takes the player to Chicago, Las Vegas, Rio and Havana, all of which depicted in detail. There are several improvements over the first game: the cities now also have curved roads instead of just right angles, some missions allow to exit the vehicle and move around on foot, and there is a multiplayer game mode.</p><p>As before, the gameplay involves driving a car around the streets of the four city locations to complete the 37 main story missions. New to this instalment, the player can now get out of their car and carjack another one in order to switch vehicles when their current one has taken too much damage.</p><p><em>Driver 2</em> also features some preset challenges and a Free Driving mode to explore the different cities at one's leisure. The new multiplayer split-screen feature includes four game modes: Take a Ride, Cops'n'Robbers, Checkpoint, and Capture the Flag.</p>"},{"name":"Driver 2 (Disk 2)","year":2000,"developer":"Reflections Interactive Limited","url":"psx-chd-roms-d/Driver%202%20%28USA%29%20%28Disc%202%29%20%28Rev%201%29.chd","filesize":342284032,"score":7.1,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Street racing > Vehicle simulator > Crime","desc":"<p>Tanner is back as an undercover driver, this time trying to survive amidst an international war between American and Brazilian gangs. The action takes the player to Chicago, Las Vegas, Rio and Havana, all of which depicted in detail. There are several improvements over the first game: the cities now also have curved roads instead of just right angles, some missions allow to exit the vehicle and move around on foot, and there is a multiplayer game mode.</p><p>As before, the gameplay involves driving a car around the streets of the four city locations to complete the 37 main story missions. New to this instalment, the player can now get out of their car and carjack another one in order to switch vehicles when their current one has taken too much damage.</p><p><em>Driver 2</em> also features some preset challenges and a Free Driving mode to explore the different cities at one's leisure. The new multiplayer split-screen feature includes four game modes: Take a Ride, Cops'n'Robbers, Checkpoint, and Capture the Flag.</p>"},{"name":"Drug Store, The: Matsumoto Kiyoshi de Okaimono!","year":1998,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-d/Drug%20Store%2C%20The%20-%20MatsumotoKiyoshi%20de%20Okaimono%21%20%28Japan%29.chd","filesize":33031241,"score":"","genres":"Simulation > 1st-person > Isometric > Anime / Manga > City building / construction simulation > Managerial / business simulation > Point and select","desc":"<p>This game is a drugstore management simulation. Your goal is to order lots of medicine and cosmetics to make your store profitable. Increase the number of stores to clear each map. The player starts by making a logo for the shop, and then choosing a location, an interior design, the number of shelves, prices, hours, and hiring employes. You can experience all the aspects of working. Make a drugstore that beats all your rivals. You can do it!</p>"},{"name":"Druid: Daemons of the Mind","year":1998,"developer":"Synthetic Dimensions PLC"},{"name":"Ducati World: Racing Challenge","year":2001,"developer":"Attention to Detail Limited","url":"psx-chd-roms-d/Ducati%20World%20-%20Racing%20Challenge%20%28USA%29.chd","filesize":383282797,"score":5.6,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Direct control > Motorcycle > Licensed","desc":"<p>In this Ducati brand-licensed motorcycle game, players can race a range of Ducati bikes ranging from the 1960's Daytona 350 to the 748 and 996. The game includes a career mode (Ducati Life) where players climb the ladder to earn four different licenses, buy better bikes and accessories such as helmets, leathers and bike customizations. Regular quick races feature and arcade mode, two player split-screen, time attack and regular races. New tracks can be unlocked and are stored in the Rewards menu.</p><p>The game is endorsed by world champion Carl Fogarty. Players can race him and win his bike.</p>"},{"name":"Duke Nukem 3D","year":1997,"developer":"3D Realms Entertainment, Inc."},{"name":"Duke Nukem: Land of the Babes","year":2000,"developer":"n-Space, Inc.","url":"psx-chd-roms-d/Duke%20Nukem%20-%20Land%20of%20the%20Babes%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":305365410,"score":6.7,"genres":"Action > Behind view > Shooter > Direct control > Sci-fi / futuristic > Comedy","desc":"<p>In the distant future, vicious aliens rule the Earth. Only bodacious babes survive, enslaved by the hostile alien overlords. The women and the world need a hero. And there's only one man big enough for the job! With a new arsenal of destructive weapons and a legion of sinister new enemies, <em>Duke Nukem: Land of the Babes</em> (formerly Planet of the Babes) is heart-pounding Duke action at its most savage. </p><p>Features 23 levels including 16 singleplayer levels, 4 challenging training areas, and 6 multiplayer levels; A.I. assisted Babes that fight alongside Duke; High-tech inventory items - X-Ray goggles, Jetpack, Teleporter, High-tech Duke shades; A new arsenal of weapons - Blaster, Flamer, RPG, and Grenade Launcher 'All new enemies - Mutant Gorillas, Hunter Killer Chicks, and Hoglodytes plus Pig Cops and the Cyberbrain;3 1st person split screen modes for two player Duke matches.</p>"},{"name":"Duke Nukem: Time to Kill","year":1998,"developer":"n-Space, Inc.","url":"psx-chd-roms-d/Duke%20Nukem%20-%20Time%20to%20Kill%20%28Europe%29%20%28Rerelease%29.chd","filesize":206367432,"score":7.3,"genres":"Action > Behind view > Shooter > Direct control > Sci-fi / futuristic > Comedy","desc":"<p>The game begins not a long time after Duke Nukem 3D. Duke is relaxing in Bootylicious with a few beers and some babes when suddenly Pig Cops start trashing the place and turn his 1968 custom hog into a chopper bike. Duke trashes all the Pig Cops and then finds out that the aliens are trying to get to the past in order to take over the world before Duke was there to stop them. </p><p>The game includes 28 levels in total, varying from L.A. in the present time, to the Ancient west, and the Colosseum. It also has a deathmatch mode that allows two players to wreak havoc against each other.</p>"},{"name":"Dukes of Hazzard II, The: Daisy Dukes It Out","year":2000,"developer":"Sinister Games, Inc.","url":"psx-chd-roms-d/Dukes%20of%20Hazzard%20II%2C%20The%20-%20Daisy%20Dukes%20It%20Out%20%28Europe%29.chd","filesize":487470167,"score":6,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Nearly identical gameplay to Dukes of Hazzard: Racing For Home, this game is 18 more levels of racing around the off-road areas of Hazzard county. From the title as you may imagine, the plot focuses on Daisy and a friend of hers, Missy who are knee-deep in trouble.</p><p>In addition to the single player plot missions, there is also Two-Player racing mode, a Scramble mode, a Joyride mode and a mode called Grab the Jug, where the players try to collect an evasive jug on or off the road before the other players.</p><p>Choice of vehicles includes the General Lee itself, Daisy's Jeep, Uncle Jesse's old truck, Missy's spider ride and a farm's chicken truck.</p>"},{"name":"Dukes of Hazzard, The: Racing for Home","year":1999,"developer":"Sinister Games, Inc.","url":"psx-chd-roms-d/Dukes%20of%20Hazzard%2C%20The%20-%20Racing%20for%20Home%20%28Europe%29.chd","filesize":460977711,"score":5.4,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Boss Hogg is foreclosing the farm. Bo and Luke are the prime suspects of the robbery of the County Bank. Then there's these strangers in town looking for trouble... Can Bo and Luke get themselves out of this mess? Three levels of difficulty, over 40 stunts you can perform, and a whole lot of racing going on! Features voices of the original crew. </p><p>DoH is a 3rd person arcade racer where you take the General Lee and drive all over the place, dodging Rosco P. Coltrane (the sheriff) and Dep. Enos Strate and advancing the plot.</p>"},{"name":"Dune 2000","year":1999,"developer":"Westwood Studios, Inc.","url":"psx-chd-roms-d/Dune%202000%20%28Europe%29.chd","filesize":465989282,"score":6.4,"genres":"Strategy > Diagonal-down > Free-roaming camera > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Sci-fi / futuristic > War > Licensed","desc":"<p>The PlayStation version of Dune 2000 had largely the same content in terms of storyline and gameplay. However, unlike the original, it was powered by a 3D engine. It also had incorporated cheats, as well as support for the link cable (required for local multiplayer) and the PlayStation mouse.</p>"},{"name":"Dynamite Soccer 98","year":1998,"developer":"A-Max","url":"psx-chd-roms-d/Dynamite%20Soccer%2098%20%28Japan%29.chd","filesize":145342740,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (European) / Soccer","desc":"<p><em>Dynamite Soccer 98</em> is a soccer/football game focusing on national teams and national team players of 1998. Aside from penalty kicks practice and training mode which includes free kicks, corner kicks, and other basics, there are four gameplay modes available. Exhibition mode is a quick play which lets 1 or 2 players start a quick match with selected teams. Tournament uses a typical tree structure and supports up to 16 teams, each of which can be set as player or CPU controller team. When two CPU teams play, only the result is displayed. A-Max Cup uses four groups of four teams after which it turns into a tree structure and elimination play, and All Star mode lets you assemble a team of top players from all available national teams. Basic setup such as selecting stadiums, changing strategies, replacing players, setting time duration for a full match, and other options are all available. The game supports 1 or 2 player matches, with up to 4 players using multi-tap.</p>"},{"name":"Dynasty Warriors","year":1997,"developer":"Omega Force","url":"psx-chd-roms-d/Dynasty%20Warriors%20%28Europe%29.chd","filesize":301108683,"score":7.3,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > China (Ancient / Imperial) > Historical events","desc":"<p><em>Dynasty Warriors</em> is a 3D fighting game steeped in traditional Chinese history and mythology, its characters being warriors from the Three Kingdoms era, a setting that was used by Koei before in their Romance of the Three Kingdoms series.</p><p>Over 2000 years ago, Guang-Wu revived the Han Dynasty in China. Wars and chaos follow for centuries after, because of regional conflicts, rival dynasties, and bureaucratic problems. An insurgent group, the Yellow Turban Rebels, roams China killing government officials. The current Emperor Shao is protected by troops raised by the nobles of the land - but each noble has their own plan to gain power.</p><p>The fighting is based on martial arts and weapons (and the tactics thereof) rather than focusing on combos, special moves, or other modern fighting-game embellishments. The characters can be chosen from four groups, each representing one of the main kingdoms - Shu, Wei, and Wu, as well as a miscellaneous-character 4th group.</p>"}]