[{"name":"G Darius","year":1998,"developer":"Taito Corporation","url":"psx-chd-roms-g/G%20Darius%20%28Japan%2C%20Asia%29.chd","filesize":433226660,"score":7.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Shooter > Sci-fi / futuristic","desc":"<p><em>G Darius</em> chronicles the story of the Darius star, and the heroes who protect it from evil. G. Darius features similar gameplay concepts to other titles in the series, but now plays in 2D/3D (a la Einhander/Thunder Force V/R-Type Delta).</p>"},{"name":"G-Police (Disc 1)","year":1997,"developer":"Psygnosis Limited","url":"psx-chd-roms-g/G-Police%20%28Europe%29%20%28Disc%201%29.chd","filesize":428028734,"score":7.6,"genres":"Action > Simulation > 1st-person > 3rd-person (Other) > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>After a violent interstellar resource war, mega-corporations seize power from the remnants of Earth's governments and lead humanity's way into the colonization of space. The last vestige of central authority is in the form of the G-Police (Government Police); an independent agency tasked with keeping order in the colonies. You play as rookie Jeff Slater - a former military pilot going undercover at the G-Police squadron on Callisto, in the hopes of finding the truth behind your sister's sudden death.</p><p><em>G-Police</em> is an arcade-style helicopter shooter set inside the colony domes on Callisto. You pilot a futuristic close-air-support gunship, and are tasked with engaging ground and air enemies as you uncover a sinister corporate plot. Your ship can hover and turn in a VTOL mode, fire weapons outfitted before each mission, and lock on to objects in the world to both track enemies and scan suspicious cargo. Missions require you to navigate through the skyscrapers and billboards of the various city districts, and complete a number of objectives updated through radio contact with headquarters. There are thirty-six missions to complete.</p>"},{"name":"G-Police (Disc 2)","year":1997,"developer":"Psygnosis Limited","url":"psx-chd-roms-g/G-Police%20%28Europe%29%20%28Disc%202%29.chd","filesize":420671432,"score":7.6,"genres":"Action > Simulation > 1st-person > 3rd-person (Other) > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>After a violent interstellar resource war, mega-corporations seize power from the remnants of Earth's governments and lead humanity's way into the colonization of space. The last vestige of central authority is in the form of the G-Police (Government Police); an independent agency tasked with keeping order in the colonies. You play as rookie Jeff Slater - a former military pilot going undercover at the G-Police squadron on Callisto, in the hopes of finding the truth behind your sister's sudden death.</p><p><em>G-Police</em> is an arcade-style helicopter shooter set inside the colony domes on Callisto. You pilot a futuristic close-air-support gunship, and are tasked with engaging ground and air enemies as you uncover a sinister corporate plot. Your ship can hover and turn in a VTOL mode, fire weapons outfitted before each mission, and lock on to objects in the world to both track enemies and scan suspicious cargo. Missions require you to navigate through the skyscrapers and billboards of the various city districts, and complete a number of objectives updated through radio contact with headquarters. There are thirty-six missions to complete.</p>"},{"name":"G-Police: Weapons of Justice","year":1999,"developer":"Psygnosis Limited","url":"psx-chd-roms-g/G-Police%20-%20Weapons%20of%20Justice%20%28Europe%29.chd","filesize":404128570,"score":7.6,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>Further adventures in the G-Police world - more flying around in a futuristic helicopter-style vehicle, shooting things.  Features some new environments (an outer space section) and different craft for some missions.  </p><p>G-Police 2 also features missions with battle, search and destroy objectives. It also has a cinematic full-motion video intro, created using motion capture. The game allows you to control 5 different vehicles, including the \"Raptor\" walking attack vehicle, and has additional secret missions.</p>"},{"name":"G.O.D. Pure","year":1998,"developer":"Infinity Co., Ltd.","url":"psx-chd-roms-g/G.O.D%20pure%20%28Japan%29.chd","filesize":243295666,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p><em>G·O·D Pure</em> is a remake of  G.O.D: Mezameyo to Yobu Koe ga Kikoe.</p><p>The story and the gameplay system remain the same; the changes in the remake mostly involve presentation. The game's graphical style remains rather faithful to the original in house interiors; however, cities and most dungeon-like areas have been re-designed as pre-rendered images. The perspective has become somewhat of a mix between the original top-down style and third-person perspective. Character graphics are very close to the original in style.</p><p>A few pre-rendered movie sequences were added during some of the key events of narrative. CD-quality music has been re-recorded for this release.</p>"},{"name":"Gaball Screen","year":1996,"developer":"System Sacom"},{"name":"Gadget: Invention, Travel & Adventure","year":1997,"developer":"Synergy Inc."},{"name":"Gaia Seed","year":1996,"developer":"Techno Soleil Corporation","url":"psx-chd-roms-g/GaiaSeed%20-%20Project%20Seed%20Trap%20%28Japan%29.chd","filesize":337457165,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>GaiaSeed is a horizontally scrolling shooter from Techno Soleil. The game has solid control, precise bullet collision, and a simple powerup system. With six stages, it’s not the longest game on the block, but the massively scaling 2D backgrounds and variable difficulty make up for that.</p>"},{"name":"Gakkou de atta Kowai Hanashi S","year":1996,"developer":"Pandora Box"},{"name":"Gakkou no Kowai Uwasa: Hanako-san ga Kita!!","year":1995,"developer":"WorkJam Co., Ltd.","url":"psx-chd-roms-g/Gakkou%20no%20Kowai%20Uwasa%20-%20Hanako-san%20ga%20Kita%21%21%20%28Japan%29.chd","filesize":314004440,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Graphic adventure > Mini-games > Point and select > Japan (Modern/Futuristic) > Detective / mystery > Licensed","desc":"<p><em>Gakkō no Kowai Uwasa: Hanako-San ga Kita!!</em> is based on the anime series of the same name. A group of curious children explore their school in the dead of night to check out the rumors of ghosts lurking about. They are rescued from certain dangers by the ghost girl Hanako. The game has the player move around in a 3D environment, navigating rooms and areas, solving puzzles, obtaining items and playing mini-games.</p>"},{"name":"Galaga: Destination Earth","year":2000,"developer":"King of the Jungle Ltd.","url":"psx-chd-roms-g/Galaga%20-%20Destination%20Earth%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.chd","filesize":347786784,"score":5.1,"genres":"Action > Behind view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The player chases the famous alien horde through space debris, asteroid fields and the rings of Saturn before orbiting the sun and moon. The stages proceed to Earth's upper atmosphere and, in the closing sequences, its cities. Players collect the aliens' weapons and use their fighters to defend against missiles and suicide runs through infinite levels. In a tribute to the arcade classic, there are special Challenge Stages during which the player can earn tons of bonus points. Players will even be able to retrieve captured fighters from the descending Galaga Commander to double their firepower. Features include 3D ships, enemies and landscapes as well as power-ups and special weapons.</p>"},{"name":"Galaxian 3","year":1996,"developer":"Namco Limited","url":"psx-chd-roms-g/Galaxian%5E3%20%28Europe%29.chd","filesize":382613010,"score":"","genres":"Action > 1st-person > Arcade > Rail shooter > Sci-fi / futuristic","desc":"<p>Welcome aboard the Starship Dragoon, gunners! From now on, you are no longer 'I', you are 'we'! We will fight together or we will fall together! The Cannon Seed has been discovered and it is aimed directly at Earth. The United Galaxy Space Force and Earth are counting on us!</p><p>In <em>Galaxian 3</em>, you, and multiple other players (28 in the GH-28 version, 16 in the GM-16 version, &amp; 6 in the Theatre 6: GT-6 version), man the guns on a starship called Dragoon. The piloting is handled elsewhere so all you're concerned with is gun-firing. As enemies approach, you must shoot them down. You are trying to make it through the enemy fighters to reach and destroy the Cannon Seed. Be advised that all players are on the same ship so you all share the same life meter. When that life meter reaches zero, everybody's game is over.</p>"},{"name":"Galaxy Fight: Universal Warriors","year":1996,"developer":"Sun Corporation","url":"psx-chd-roms-g/Galaxy%20Fight%20-%20Universal%20Warriors%20%28Japan%29.chd","filesize":262049661,"score":7,"genres":"Action > Side view > 2D scrolling > Fighting > Sci-fi / futuristic","desc":"<p>As the millennium nears in the far future, a being of ultimate power named Felden will make his appearance in the galaxy. It is unknown whether he comes to destroy all living beings or use his powers for good, but whatever the reason a group of skilled fighters from all corners of the universe have decided to beat each other up in order to face off against him and claim his power.</p><p>Enter <em>Galaxy Fight</em>, a one-on-one 2D fighter set in the far future and featuring sci-fi characters and settings. In the game itself, you have to select from 8 fighters, each with his unique moveset and stats, and then attempt to defeat the other character in 2 out of 3 matches using your special moves and attacks while avoiding your opponent's strikes.</p><p>Features single player and 2-player Vs. game modes, secret bosses and bonus rounds.</p>"},{"name":"Galerians (Disc 1)","year":1999,"developer":"Polygon Magic, Inc.","url":"psx-chd-roms-g/Galerians%20%28Europe%29%20%28Disc%201%29.chd","filesize":403325850,"score":7.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Puzzle elements > Survival horror > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>A young man named Rion wakes up in a hospital. He does not know who he is; he can hear a girl's voice in his mind, imploring him to save her. While trying to escape from the hospital, Rion is detained by guards, and discovers that he possesses devastating psychic powers. Trying to understand what has been done to him, Rion gradually uncovers the mystery behind the \"G Project\", a human experiment that involves unlocking the hidden potential of the human mind.</p><p><em>Galerians</em> is a survival horror game in which the player navigates a 3D character model over pre-rendered backgrounds, using character-related controls similar to those implemented in Alone in the Dark. Items must be collected to unlock new areas and advance the story. Unlike in most other games of the type, the protagonist is unable to use weapons. Rion fully relies on his psychic powers to combat enemies. These powers must be replenished by regularly taking drugs. In addition, Rion has a special meter that throws him into uncontrollable rage when full.</p>"},{"name":"Galerians (Disc 2)","year":1999,"developer":"Polygon Magic, Inc.","url":"psx-chd-roms-g/Galerians%20%28Europe%29%20%28Disc%202%29.chd","filesize":393704650,"score":7.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Puzzle elements > Survival horror > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>A young man named Rion wakes up in a hospital. He does not know who he is; he can hear a girl's voice in his mind, imploring him to save her. While trying to escape from the hospital, Rion is detained by guards, and discovers that he possesses devastating psychic powers. Trying to understand what has been done to him, Rion gradually uncovers the mystery behind the \"G Project\", a human experiment that involves unlocking the hidden potential of the human mind.</p><p><em>Galerians</em> is a survival horror game in which the player navigates a 3D character model over pre-rendered backgrounds, using character-related controls similar to those implemented in Alone in the Dark. Items must be collected to unlock new areas and advance the story. Unlike in most other games of the type, the protagonist is unable to use weapons. Rion fully relies on his psychic powers to combat enemies. These powers must be replenished by regularly taking drugs. In addition, Rion has a special meter that throws him into uncontrollable rage when full.</p>"},{"name":"Galerians (Disc 3)","year":1999,"developer":"Polygon Magic, Inc.","url":"psx-chd-roms-g/Galerians%20%28Europe%29%20%28Disc%203%29.chd","filesize":313116113,"score":7.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Puzzle elements > Survival horror > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>A young man named Rion wakes up in a hospital. He does not know who he is; he can hear a girl's voice in his mind, imploring him to save her. While trying to escape from the hospital, Rion is detained by guards, and discovers that he possesses devastating psychic powers. Trying to understand what has been done to him, Rion gradually uncovers the mystery behind the \"G Project\", a human experiment that involves unlocking the hidden potential of the human mind.</p><p><em>Galerians</em> is a survival horror game in which the player navigates a 3D character model over pre-rendered backgrounds, using character-related controls similar to those implemented in Alone in the Dark. Items must be collected to unlock new areas and advance the story. Unlike in most other games of the type, the protagonist is unable to use weapons. Rion fully relies on his psychic powers to combat enemies. These powers must be replenished by regularly taking drugs. In addition, Rion has a special meter that throws him into uncontrollable rage when full.</p>"},{"name":"Gallop Racer","year":1996,"developer":"Tecmo, Ltd.","url":"psx-chd-roms-g/Gallop%20Racer%20%28USA%29.chd","filesize":220790935,"score":"","genres":"Racing / Driving > Simulation > Sports > Horse / derby","desc":"<p><em>Gallop Racer</em> is a horse racing simulation. It has both a season and preseason mode. The game lets the player customize the color of their jockey's stripes. Players can spend their starting money to purchase horses (each with their own unique attributes) at the Horse Shop and can earn more money by doing well on the track. On the other hand, players can lose money by not placing in a high enough position during a race as entering races costs money.</p><p>While on the horse track running their horse, players can apply the whip to the horse and can also rotate the view of the race. The game tracks the players performance throughout their racing season.</p>"},{"name":"Game no Tatsujin","year":1995,"developer":"Success Corp.","url":"psx-chd-roms-g/Game%20no%20Tatsujin%20%28Japan%29%20%28Rev%201%29.chd","filesize":111534988,"score":"","genres":"Strategy > 1st-person > Top-down > Fixed / flip-screen > Turn-based > Board game > Point and select > Japan (Modern/Futuristic)","desc":"<p>Within <em>Game no Tatsujin</em> are four different classic Japanese board games made by different developers, which are Mahjong, Shogi, Go and Reversi. The board games can be played in three different modes including the Training Mode with five opponents, the Free Battle Mode with progressive levels of difficulty and World Mode with a total of 21 game masters to challenge with the ultimate goal beating them all and earning the award title \"Master of the Game\".</p>"},{"name":"Game of Life, The","year":1998,"developer":"Mass Media, Inc.","url":"psx-chd-roms-g/Game%20of%20Life%2C%20The%20%28USA%29.chd","filesize":337427928,"score":6.6,"genres":"Strategy > Board game > Licensed","desc":"<p>The classic board game comes to life (no pun intended) on the PC!</p><p>Play the Classic or Enhanced version of the classic game.  Spin the spinner, get a job, get married, buy a house, play the stock market, take revenge against other players and gain wealth.</p><p>Play up to 6 players either over a network or the internet.</p>"},{"name":"Gamera 2000","year":1997,"developer":"Surveyor Corp.","url":"psx-chd-roms-g/Gamera%202000%20%28Japan%29%20%28En%2CJa%29.chd","filesize":347371888,"score":"","genres":"Action > Behind view > Arcade > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>Alien monsters and other gigantic nightmares threaten earth. Fortunately for us a special force has been assigned to deal with them which includes the mighty Gamera as an ally.</p><p>The game puts you in the shoes of Jack, the star pilot behind the jet fighter designed to take out these nasties. Together with Dr. Mikanuki you take to the skies as swarms of monsters attack you mercilessly through several stages.</p><p>Gameplay-wise Gamera 2000 plays like Panzer Dragoon, as you don't have direct control of your jet, but instead try to aim at the incoming monsters from all directions and shoot them down while the jet follows a pre-set path. Facing bosses requires you to target specific weak points while your fighter circles around and at all times you can call Gamera to aid you by instructing it to shoot its homing attacks, as well as a charged attack that clears all enemies on screen.</p><p>Some stages switch the action to ground level, as you pilot a futuristic bike, but the gameplay remains the same. Features polygonal graphics and live action FMV sequences that advance the plot between each stage.</p>"},{"name":"Ganba no Bōken: The Puzzle Action","year":2003,"developer":"OOParts"},{"name":"Ganbare Goemon: Kuru Nara Koi! Ayashi Geikka no Kuroi Kage","year":1998,"developer":"Konami Computer Entertainment Nagoya Co., Ltd."},{"name":"Ganbare Goemon: Ooedo Daikaiten","year":2001,"developer":"Now Production Co., Ltd.","url":"psx-chd-roms-g/Ganbare%20Goemon%20-%20Ooedo%20Daikaiten%20%28Japan%29.chd","filesize":413963030,"score":"","genres":"Action > Side view > Anime / Manga > Arcade","desc":"<p>The Ganbare Goemon series returns to its 2D classic adventure / platformer roots with this entry, which brings back the classic gameplay of the series. Once again you take control of wily Goemon and his friends as he attempts to save feudal Japan from the evil King of Recycling, who is taking extreme measures to save the planet.</p><p>As in the classic games of the series, the game alternates between a top-down over-world that serves as a stage select and the side-scrolling stages proper in which you have to use each character's individual skills to complete specific objectives while defeating baddies and jumping through the obstacles thrown your way. Polygonal elements have been added to the backgrounds for a more next-gen feeling and the ability to switch characters while playing a stage means sometimes you must combine abilities in order to clear a level instead of just relying on your favorite character. Whenever facing a boss fight the game challenges you to a specific mini-game as traditional for the series, with the result determining the outcome of the fight and also providing bonus items and additional unlockable mini games.</p>"},{"name":"Ganbare Goemon: Uchū Kaizoku Akogingu","year":1996,"developer":"Konami Co., Ltd.","url":"psx-chd-roms-g/Ganbare%20Goemon%20-%20Uchuu%20Kaizoku%20Akogingu%20%28Japan%29%20%28Rev%201%29.chd","filesize":399347645,"score":"","genres":"Action > Side view > Top-down > Anime / Manga > Arcade","desc":"<p>First 32-bit title in the Ganbare Goemon series of platform/adventure games in which you take control of the heroic Goemon and his gang of buddies as he attempts to save feudal Japan and the world from evil. After the events of the previous game, Goemon and the gang return to Japan to defend it from an invasion from outer space with the help of a stranded alien that holds the key to save the world.</p><p>As in the other side-scrolling/adventure titles in the series, the game alternates between a top-down world map view in which your characters explore the game world and side-scrolling stages in which you have to use each character's individual skills to complete an objective to advance the game's plot. You can buy items in the world map and an experience-system has been added which increases each character's abilities as a reward. Between stages and in special locations you can also play several mini-games as customary for the series, which include controlling Goemon Impact, Goemon's giant mecha, and other unique challenges.</p><p>Two new characters join the gang with unique abilities and powers and for the first time you get to control the entire party when playing in the world map sections. The game also features fully animated cutscenes and CD music.</p>"},{"name":"Gate Keepers (Disc 1)","year":1999,"developer":"Gonzo Inc.","url":"psx-chd-roms-g/Gate%20Keepers%20%28Japan%29%20%28Disc%201%29.chd","filesize":341038884,"score":"","genres":"Role-playing (RPG) > Strategy > 1st-person > Diagonal-down > 2D scrolling > Fixed / flip-screen > Anime / Manga > Turn-based > Menu structures > Point and select > Sci-fi / futuristic > War","desc":"<p>Unlike many anime and manga-based games, <em>Gate Keepers</em> is a turn-based strategy role-playing game which spanned manga and anime TV series not long after its release. The game uses visual novel elements with static background and 2D anime-style characters during dialogues and switches to isometric bird's eye perspective during turn-based combat. The battlefield camera can be rotated by 90 degrees full circle, and while action camera occasionally kicks in there is no ability to zoom in/out of adjust camera angle which can result in some units being more difficult to see in urban warfare with tall buildings. The player characters can attack using their weapons or tap into powerful energy locked in dimensional gates to use special attacks.</p><p>The story takes place on Earth, a couple of decades after the end of World War II. Aliens are sending their agents to wreak havoc and turn people into soulless robotic creatures. In order to fight the alien menace that human population is oblivious to, and prevent the world from being taken over by the aliens who are commonly referred to as Invaders, the government set up and funded secret military organization designated A.E.G.I.S (Alien Extermination Global Intercept System). While the organizations spans across the globe, the game focuses on far east branch of the organization which is located beneath Tategami High School in Japan, which is where Shun, the protagonist, and others in his team were recruited from. Shun is one of a few who has the ability to tap onto energy from dimensional gates, the ability he inherited from his father.</p>"},{"name":"Gate Keepers (Disc 2)","year":1999,"developer":"Gonzo Inc.","url":"psx-chd-roms-g/Gate%20Keepers%20%28Japan%29%20%28Disc%202%29.chd","filesize":351806557,"score":"","genres":"Role-playing (RPG) > Strategy > 1st-person > Diagonal-down > 2D scrolling > Fixed / flip-screen > Anime / Manga > Turn-based > Menu structures > Point and select > Sci-fi / futuristic > War","desc":"<p>Unlike many anime and manga-based games, <em>Gate Keepers</em> is a turn-based strategy role-playing game which spanned manga and anime TV series not long after its release. The game uses visual novel elements with static background and 2D anime-style characters during dialogues and switches to isometric bird's eye perspective during turn-based combat. The battlefield camera can be rotated by 90 degrees full circle, and while action camera occasionally kicks in there is no ability to zoom in/out of adjust camera angle which can result in some units being more difficult to see in urban warfare with tall buildings. The player characters can attack using their weapons or tap into powerful energy locked in dimensional gates to use special attacks.</p><p>The story takes place on Earth, a couple of decades after the end of World War II. Aliens are sending their agents to wreak havoc and turn people into soulless robotic creatures. In order to fight the alien menace that human population is oblivious to, and prevent the world from being taken over by the aliens who are commonly referred to as Invaders, the government set up and funded secret military organization designated A.E.G.I.S (Alien Extermination Global Intercept System). While the organizations spans across the globe, the game focuses on far east branch of the organization which is located beneath Tategami High School in Japan, which is where Shun, the protagonist, and others in his team were recruited from. Shun is one of a few who has the ability to tap onto energy from dimensional gates, the ability he inherited from his father.</p>"},{"name":"Gauntlet: Legends","year":2000,"developer":"Atari Games Corporation","url":"psx-chd-roms-g/Gauntlet%20Legends%20%28Europe%29.chd","filesize":396147134,"score":6.9,"genres":"Action > Diagonal-down > Isometric > Arcade > Puzzle elements > Fantasy > Licensed","desc":"<p>As many as four (Expansion Pak required) can band together in an epic quest through seven magical worlds -- three of which are brand-new to the home version -- to defeat the vile Skorne. </p><p>The nonlinear action begins in a hub, which leads to the worlds, each with two to five levels. You can complete a level in one world, then move to another world, returning later to finish a new level in the first world. </p><p>Developer Atari Games has delivered four new characters in addition to the four in the arcade version. Each character will have unique special attacks. Controller Pak support will allow players to team their evolving characters. </p><p>Enemies, bosses, power-ups, music and sound effects are all getting radical makeovers. Atari is busily remapping carryover levels and cooking up devious new puzzles and hiding places for items, so don't even think of cribbing from the coin-op version. </p><p>Graphical updates include real-time lighting, which is nowhere to be found in the arcade version. The N64 Expansion Pak pushes plenty of polygon-based enemies onto the screen. </p><p>The essential action -- team up with others, find keys, magic, runes and other items, and beat the stuffing out of anyone in your way -- remains unchanged from the arcade hit. Atari has delivered a far meatier storyline, though, spiffed up by cinema cut-scenes at the successful conclusion of a world.</p>"},{"name":"Gear Senshi Dendoh","year":2001,"developer":"Natsume Co., Ltd."},{"name":"Gekido","year":2000,"developer":"Na.p.s. Team s.n.c.","url":"psx-chd-roms-g/Gekido%20-%20Urban%20Fighters%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":171274981,"score":7,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler","desc":"<p><em>Gekido: Urban Fighters</em> is one of the few 3D beat-em-up games of the 5th generation of consoles. The year is 2011 and a hackers' antivirus has evolved into an independent entity. Playing as one of the four characters: Travis the policeman, Michelle the military, Ushi the master or Tetsuo the school guy, you the player has to go after the hackers and find the virus.</p><p>The levels are filled with weapons and objects to vary the players attacks. Regular moves includes acrobatics, jumps, kicks and punches with combos that will unlock as the player progress through the stages. The player can also activate a short rage boost for additional damage. Next to the regular missions, there is an arena mode and co-operative multitap play with up to 4 players. </p><p>Marvel comic book artist Joe Mad contributed, and the artists Fatboy Slim and Apartment 26 were contracted for the music.</p>"},{"name":"Gekioh: Shooting King","year":1999,"developer":"Warashi Inc.","url":"psx-chd-roms-g/Gekioh%20-%20Shooting%20King%20%28Europe%29.chd","filesize":454062086,"score":"","genres":"Action > Top-down > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>Gekioh</em> is an enhanced port of Shienryu. This release adds the following game modes:</p><ul><li>Pocket Mode: imitates PocketStation graphics, with deliberately primitive visuals consisting of heart-shaped enemies and blocky ships.</li><li>Comical Mode: music and sound effects are replaced by laughter and applause (when the player reaches a high score).</li><li>Stingy Mode: the player has only one life and no continues; only two levels are playable.</li><li>No Mercy Mode: a harder difficulty level.</li><li>Slow Mode: darker graphics and sound effects reminiscent of horror themes (e.g. enemy and player-controlled ships scream when destroyed). All sprites on screen move slower, but the amount of bullets fired by enemies is increased.</li><li>Ancient Mode: the screen has a yellow tinge and displays \"cracks\"; music is changed to reflect a \"retro\" setting.</li></ul>"},{"name":"Gekisha Boy","year":2002,"developer":"Irem Software Engineering, Inc."},{"name":"Gekisou Tomarunner","year":1999,"developer":"Desert Productions Inc.","url":"psx-chd-roms-g/Gekisou%20Tomarunner%20%28Japan%29.chd","filesize":320903841,"score":"","genres":"Racing / Driving > Behind view > Anime / Manga","desc":"<p><em>Gekisō Tomarunner</em> is an on-foot racing game with various crazy/fantasy/fable/mythological characters where the aim is to navigate the various split path tracks to victory. The game puts heavy emphasis on using the terrain to gain the upper hand over the opponent, and on top of that there are several bonus items to pick up which either can aid the player or be used as weapons against the opponents. The characters all run at a set speed, but using the left and right arm as well as well timed jumps on poles, springboards and hurdles will give the player a speed boost. If enough momentum is gained, the character leans forward and starts dashing at a much faster speed. Some areas will even allow the player to be airborne for a certain amount of time if the right path is chosen and if enough speed is gained. Hitting obstacles, getting punched by opponents or having any of the \"weapon\" items used against the player will slow their speed down significantly, sometimes even resulting in the character falling over in a stunned state.</p><p>There are several modes in the game to choose from, including a single player tournament and a two players versus mode.</p>"},{"name":"Gekitotsu Toma L'Arc: Tomarunner vs L'Arc-en-Ciel","year":2000,"developer":"Desert Productions Inc.","url":"psx-chd-roms-g/Gekitotsu%20Toma%20L%27Arc%20-%20Tomarunner%20vs%20L%27Arc-en-Ciel%20%28Japan%29.chd","filesize":247554396,"score":"","genres":"Racing / Driving > 3rd-person (Other) > Anime / Manga > Licensed","desc":"<p><em>Gekitotsu Toma L'Arc: Tomarunner vs L'Arc-en-Ciel</em> is the sequel to Gekisō Tomarunner, but this time the focus is on the Japanese rock band L'Arc-en-Ciel. The game came to be for two main reasons; The lead singer of the band (Hyde) really loved the original game and the game served as good promotion for the band who were really popular at the time and had a new album in the works. The original game, as well as the band were both under Sony's roof at the time.</p><p>The gameplay is very similar to the game's predecessor, keeping the on-foot racing with heavy emphasis on using the terrain to gain the upper hand over the opponent. The characters all run at a set speed, but using the left and right arm as well as well timed jumps on poles, springboards and hurdles will give the player a speed boost. If enough momentum is gained, the character leans forward and starts dashing at a much faster speed. Some areas will even allow the player to be airborne for a certain amount of time if the right path is chosen and if enough speed is gained. Hitting obstacles, getting punched by opponents or having any of the \"weapon\" items used against the player will slow their speed down significantly, sometimes even resulting in the character falling over in a stunned state.</p><p>There are several modes in the game to choose from, including a single player tournament, two players versus each other and a series of tutorial levels where the player can practice the basics of the game (if a player fails enough times in any of the tournament levels, she/he is sent to the appropriate tutorial as a \"punishment\" as well).</p><p>The game is mostly cosmetically different from the original, and instead of the original characters the four band members have taken their place initially. Several of the original characters can be unlocked later through various means, such as beating them in races, completing certain objectives etc.</p>"},{"name":"Gen'ei Tougi - Shadow Struggle","year":1996,"developer":"Racdym","url":"psx-chd-roms-g/Gen%27ei%20Tougi%20-%20Shadow%20Struggle%20%28Japan%29.chd","filesize":283130509,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Martial arts","desc":"<p>The Phillips Foundation is sponsoring a grapple tournament, and the prize is ten million dollars. Eight warriors have gathered to take part in the tournament -- some for the money, some for the fame, and some for more personal reasons. The name of the tournament is...POWER OF SOLID.</p><p><em>Shadow Struggle</em> is a fast-paced 3D fighting game similar to its contemporary Toshinden. There are eight playable characters each with their own moves. During the fights, in addition to their health meter, each character has a \"Shadow Skill Gauge\" that fills up as blows are exchanged. When it fills up and starts flashing, they can unleash their \"Shadow Skill\", allowing them a short burst of increased attack speed and power.</p><p>The game features standard Arcade and Versus modes, as well as a mode called Arena game in which you fight to win credits, which can be used to buy new moves and customize your character. Saved characters can be used against each other in two-player bouts.</p>"},{"name":"Genghis Khan II: Clan of the Gray Wolf","year":1998,"developer":"KOEI Co., Ltd."},{"name":"Gensō no Altemis: Actress School Mystery Adventure","year":2000,"developer":"Astrovision"},{"name":"Genso Suiko Gaiden: Vol.1 - Harmonia no Kenshi","year":2000,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-g/Gensou%20Suiko%20Gaiden%20Vol.%201%20-%20Harmonia%20no%20Kenshi%20%28Japan%29.chd","filesize":330438580,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Fantasy","desc":"<p>This is the first volume of the side-story to Konami's RPG series Suikoden. </p><p>You play as Nash, a special agent of the Holy Kingdom of Harmonia's Southern Fringe Security Force. He was sent to the City States of Jowston with a mission: the Security Force has been informed that one of the 27 True Runes has appeared in Jowston. He has to verify the rumor and to bring back as much information as possible. On the way, Nash meets a mysterious woman named Sierra and soon gets involved in a large conflict featuring characters and events from the first and second Suikoden games.</p><p>Unlike the \"mainstream\" Suikoden games, this is not a RPG, but a \"digital novel\". You read text and watch background images, at some points making a decision and leading the story to different paths.</p>"},{"name":"Gensō Suiko Gaiden: Vol.2 - Crystal Valley no Kettō","year":2001,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-g/Gensou%20Suiko%20Gaiden%20Vol.%202%20-%20Crystal%20Valley%20no%20Kettou%20%28Japan%29.chd","filesize":293764350,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Fantasy","desc":"<p>This is a side story to Konami's RPG series  Suikoden. The events of the game take place between the second and the upcoming third game, and fill the story gap between them. The story centers on the rebellion that has taken place in the Grasslands. It has been three months since the end of the Dunan Unification Wars. A legend telling about the Fire Brigands lead by the mysterious Fire Champion who united the Grassland nations is being spread around. Is the legend true, and can the Fire Champion, a holder of one of the 27 True Runes, be found? Nash, a special agent of Holy Kingdom of Harmonia's Southern Fringe Security Force, is sent to investigate the matter.</p><p>You take control over Nash' actions in a fashion similar to the one implemented in Japanese \"dating sims\" or some hentai games: reading the text, looking at the background images, and sometimes interfering and choosing the path on which the story should proceed.</p>"},{"name":"Geom Cube","year":1994,"developer":"Technos Japan Corp.","url":"psx-chd-roms-g/Geom%20Cube%20%28Japan%29.chd","filesize":403920783,"score":"","genres":"Puzzle > Top-down > Real-time > Falling block puzzle","desc":"<p><em>Geom Cube</em> is a three-dimensional puzzle game based on Tetris concept. Blocks are dropped into a 4x4 pit where the object is to completely fill a level in the pit with blocks so it disappears. There are 24 different block shapes. If the blocks reach the top of the pit, the game is over. This game is for one or two players; the single-player mode has an option of playing against a series of eight computer opponents.</p><p>There are three game modes for one player: the fast, time-limited Finite mode, the slower Infinite mode, and a versus mode against computer-controlled fighters. Multiplayer is available as a head-to-head vertically split-screen mode for two players, where completed layers can be transported to the opponent's screen.</p>"},{"name":"Germs: Nerawareta Machi","year":1999,"developer":"KAJ Corporation","url":"psx-chd-roms-g/Germs%20-%20Nerawareta%20Machi%20%28Japan%29.chd","filesize":98426456,"score":"","genres":"Action > 1st-person > Sandbox / open world > Direct control > Automobile","desc":"<p><em>Germs: Nerawareta Machi</em> is a first person open-world exploration action-adventure game.</p><p>The game takes place in a town built around a coal mine. The player is an unnamed news reporter who comes back to the town after 20 years of leaving for work at a branch newspaper office after the city's decline. After some mysterious lights are seen falling on the nearby mountain and townsmen start acting mysteriously, the player starts to investigate the situation.</p><p>The game progresses six times faster than real time and the city changes around the player regardless. The player must find out what is changing the townsmen. Although the game is exploration based, the player must defend themselves against the invading forces, and can freely enter gun stores and places like hotels or restaurants to restore lost health and stamina.</p><p>The town the game takes place in is entirely handcrafted, featuring restaurants, warehouses, hotels, hospitals and other public services. The player can use their car or public trains to cover distances. Although the game is set in an open world, it features multiple pre-written NPCs that are integral to the storyline.</p>"},{"name":"Gex","year":1995,"developer":"Crystal Dynamics, Inc.","url":"psx-chd-roms-g/Gex%20%28Europe%29.chd","filesize":119923278,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Enter your television to defeat the evil Rez by collecting remotes to open worlds inside your tv. You are a gecko with all the usual platform hero skills such as jump, fire, and close-range attack, but also suction cups to help you scale walls, a tongue to pick up those tricky to get power-upsand plenty of wise-cracks to keep you amused. Use them all to make your way through TV land searching for the remotes, collecting pickups, power-ups, and killing TVs.</p>"},{"name":"Gex 3: Deep Cover Gecko","year":1999,"developer":"Crystal Dynamics, Inc.","url":"psx-chd-roms-g/Gex%203%20-%20Deep%20Cover%20Gecko%20%28USA%29.chd","filesize":285904586,"score":7.3,"genres":"Action > 1st-person > 3rd-person (Other) > Platform > Puzzle elements","desc":"<p>Gex must rescue Agent Xtra from the grips of the fiend, Rez. Gex goes undercover through many levels to try to find Agent Xtra. Each level parodies a certain aspect of television culture. Gex enters each level through a television set. He must collect remote controls to advance to the next level.</p>"},{"name":"Gex 3D: Enter the Gecko","year":1998,"developer":"Crystal Dynamics, Inc.","url":"psx-chd-roms-g/Gex%203D%20-%20Enter%20the%20Gecko%20%28Europe%29.chd","filesize":160098287,"score":7.5,"genres":"Action > Behind view > Platform > Direct control > Fantasy > Regional differences","desc":"<p><em>Gex 3D: Enter the Gecko</em> is a 3D platform game where the player controls a gecko who has to navigate several levels, all of which are parodies on well-known TV shows and movies, such as Looney Tunes, Gilligan's Island, or Friday the 13th.</p><p>Rez, the evil overlord of the television is back into the Media Dimension, and the government asks the TV addict gecko, Gex, to defeat him once again. He gets a lot of money and an agent suit for that. The game generally resolves around a James Bondish spy theme, but the story is not referenced later in the game.</p><p>Gex has to enter levels through TVs to collect three types of remote controls in order to unlock more of the Media Dimension, boss levels and secret TVs. Gex can tailwhip or karate-kick his enemies, climb certain walls and ceilings, eat bugs for power-ups, and spout one-liner wisecrack jokes. The gameplay is non-linear, the player can choose from multiple routes and goals on each level, and are replayable anytime after accomplished.</p>"},{"name":"Ghost in the Shell","year":1997,"developer":"Production I.G, Inc.","url":"psx-chd-roms-g/Ghost%20in%20the%20Shell%20%28Europe%29.chd","filesize":411576389,"score":7.4,"genres":"Action > 1st-person > Behind view > Shooter > Mecha / giant robot > Cyberpunk / dark sci-fi > Licensed","desc":"<p><em>Ghost in the Shell</em> is a 3D shooter based on the original comic by Masamune Shirow rather than Mamoru Oshi's film. The story is set in the future and focuses on a team of policemen led by the female cyborg Major Motoko Kusanagi, which fights technology-related crimes. The player takes the role of a new member in Kusanagi's anti-terrorist squad and gets to accomplish missions on the Fuchikoma, a spider-like AI equipped tank. During the course of the twelve missions a plot starts to surface concerning a giant skyscraper, the Aereopolis II.</p><p>The Fuchikoma can be controlled from either third- or first-person view. It is permanently equipped with a machine gun, homing missiles (which are activated by holding the attack button), and limited supplies of grenades; there are no other weapons or tools in the game. The Fuchikoma can also jump, strafe, stick to the walls, climb on them, and even move on the ceilings. Missions mostly take place in enclosed outdoor or indoor areas and often involve destroying specified targets. Two of the missions are rail-shooting sequences.</p>"},{"name":"Ghoul Panic","year":2000,"developer":"Raizing Co., Ltd.","url":"psx-chd-roms-g/Ghoul%20Panic%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":206792145,"score":6.9,"genres":"Action > 1st-person > Shooter > Horror","desc":"<p><em>Ghoul Panic</em> is a comedy adventure game, set in a haunted mansion. Using a PlayStation light-gun, take on the might of vampires, monsters, mummies, skeletons and spooks to open the locked doors and uncover hidden bonuses.</p><p>A conversion of the arcade game, with 3 difficulties and hidden game modes. There are also PlayStation exclusive game modes, including Survival, Adventure and Remix.</p>"},{"name":"Global Domination","year":1999,"developer":"Psygnosis Limited","url":"psx-chd-roms-g/Global%20Domination%20%28Europe%29.chd","filesize":425231990,"score":6.1,"genres":"Action > Strategy > Real-time > Shooter > Sci-fi / futuristic","desc":"<p>Global Domination is an action-based strategical wargame that is based on the fictional game James Bond plays against Maximillian Largo in the 1983 film Never Say Never again. Elements of this game are combined with the classical board game Risk.</p><p>In this game you play as an agent for a secret agency called ULTRA. You are hired by countries all over the world to protect them from their enemies.</p><p>Each of the twenty missions begins with a full motion video briefing. After that you are presented with a spinning hologram globe representing the earth. The world is divided into different countries, similar to risk. It is your job to defend your country from incoming attacks and strike against enemies.</p><p>With your keyboard you can switch between weapons and you can aim with your mouse for a target location for your rockets, aircraft and naval vessels. More and more weapons come available as you progress in the game.</p>"},{"name":"Global Force: New Battle Nation","year":1999,"developer":"Soliton Soft"},{"name":"Glocal Hexcite","year":1999,"developer":"Soliton Soft","url":"psx-chd-roms-g/Glocal%20Hexcite%20%28Japan%29.chd","filesize":266401466,"score":"","genres":"Puzzle > Strategy > Top-down > Fixed / flip-screen > Anime / Manga > Turn-based > Point and select","desc":"<p><em>Glocal Hexcite</em> is one of several conversions of the popular computer and board game. Players take turns placing shapes on a grid of triangles that make up seven hexagons. Any shapes placed on the board must touch the pieces already in play on at least one complete side; any outside hexagon completed will earn bonus points. If a player has any pieces left over at the end of the match that cannot be placed, they lose points for them. Matches are best two out of three.</p><p>The PlayStation version of <em>Glocal Hexcite</em> features a story mode with a cast of cute characters, as well as a two-player versus mode and an \"Official Game\" mode where the rules are slightly different from the normal game.</p>"},{"name":"Glover","year":1999,"developer":"Interactive Studios Ltd.","url":"psx-chd-roms-g/Glover%20%28USA%29.chd","filesize":214691361,"score":6.8,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements","desc":"<p>A wizard is mixing up a batch of magic potions, when an explosion sends the gloves off his hands flying into the air. One lands safetly outside the castle, but the other lands in an evil potion mixture. It's this evil glove that decides to take over the castle. Meanwhile, 7 crystals, which used to sit on top of the castle and gave the surrounding lands its life force, also fly off in all directions. Thankfully, though, the good Glove changes the crystals into rubber balls, so that they would land safely. </p><p>You must control the good glove (name Glover) and find the 7 crystals, putting them back into the castle to restore the life back into the land. But be careful, the bad glove is out to stop you and take the kingdom, and the wizards power, for his own.</p>"},{"name":"Goal Storm","year":1996,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-g/Goal%20Storm%20%28Europe%29.chd","filesize":97548768,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (European) / Soccer","desc":"<p><em>Goal Storm</em> is a soccer game featuring 3D polygonal motion-captured players. It features an Exhibition and a Hyper Cup mode. Exhibition mode lets the player play a game of soccer against the computer or another player. Hyper Cup mode lets the player pick a country (unfortunately one without licensed players), and lets them compete in a tournament against three other teams. </p><p>All the rules of soccer are present such as throw-ins, offsides, and penalties which can get players yellow and red carded. Offensive and defensive team strategies and line formations are also able to be set by the player. There's also an announcer who calls all the action on the field. </p><p>Options let the player choose the computer's difficulty level, the length of the halves, and the conditions of the playfield.</p>"},{"name":"Goal Storm '97","year":1997,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-g/Goal%20Storm%20%2797%20%28USA%29.chd","filesize":181800654,"score":7.5,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (European) / Soccer","desc":"<p>The first ISS Pro game for the Playstation, with<strong>32</strong> international teams, a choice of 4 stadia, 21 formations &amp; strategies.  With a choice of Exhibition Mode, International League, International Cup, and a Penalty Kick mode.</p>"},{"name":"Goemon: Shin Sedai Shuumei","year":2001,"developer":"Now Production Co., Ltd.","url":"psx-chd-roms-g/Goemon%20-%20Shin%20Sedai%20Shuumei%20%28Japan%29.chd","filesize":404299635,"score":"","genres":"Action > Side view > Anime / Manga > Arcade","desc":"<p>Yet another entry in the Ganbare Goemon action/platformer series, you once again step in the shoes of the wily adventurer Goemon and his gang of buddies as they fight evil wherever it rears its ugly head. However for this entry, the developers decided to shake things up a bit and gave Goemon and co. a complete makeover. The game takes place in a futuristic Japan, with the main character being a younger and less wacky Goemon who along with his elite squad of crime-fighters (based on the classic members of Goemon's posse) goes off in several missions in order to save the city from various evil-doers.</p><p>The gameplay is similar to other 2D side-scrollers in the series, with you controlling each character as they jump around the obstacles in each level and defeat the baddies within using unique weapons and abilities to each character. The non-linear \"world map\" sections have been removed and all of the power-up buying and upgrading now takes place in the platformer stages themselves. </p><p>While the gameplay is completely 2D, the game engine mixes polygonal elements and sprites to render specific bosses and background elements as well as bring to life the Goemon Impact sequences (in which you have to take control of Goemon's giant mecha in shooter sequences). The game also includes pre-rendered cutscenes and a cel-animated intro sequence.</p>"},{"name":"Goiken Muyou II","year":1998,"developer":"Mediamuse","url":"psx-chd-roms-g/Goiken%20Muyou%20II%20%28Japan%29%20%28En%2CJa%29.chd","filesize":335972411,"score":"","genres":"Action > Side view > Anime / Manga > Fighting","desc":"<p>Yankee, delinquent girls, gangsters, teachers, ninja and wrestler...<br>These unique characters will interact with each other using their fists on the street of the night!<br>Besides adding useful game modes such as the training mode and an accessible ranking,<br>these is also a mode for you to fight with an AI character to practice the skills that you have learned.<br>So work your way to become the strongest by overcome your weaknesses by practicing with the AI!</p>"},{"name":"Goku Densetsu: Magic Beast Warriors","year":1995,"developer":"Allumer, Ltd.","url":"psx-chd-roms-g/Gokuu%20Densetsu%20-%20Magic%20Beast%20Warriors%20%28Japan%29.chd","filesize":480764079,"score":"","genres":"Action > Side view > Full Motion Video (FMV) > Live action > Fighting > Direct control > Asia > China (Ancient / Imperial) > Martial arts","desc":"<p>Magic Beast Warriors (悟空伝説) is a 1v1 fighting game based on the traditional Chinese legend Journey to the West. The game offers a two player VS mode allowing to select between nine fighters representing the main characters of the legend, along with a story mode where the player starts as the monkey king Sun Wuhong (better known as Son Goku) armed with his iconic extensible sfaff and gradually unlocks the other fighters as they are defeated in turn throughout a heavily stylized version of the traditional story. Once a battle is lost against the computer, the character the player was using becomes unavailable, and upon continuing he or she has to choose between one of those available up to that point.</p><p>Gameplay features are reminiscent of Street Fighter, with similar movesets and impact feedback, while the presentation sees prerendered 3D sprites on static 2D backgrounds. The game includes about 30 minutes of full-motion video cutscenes featuring real actors in costumes varying from Chinese armor to rubber monster suits. These play in between battles as introduction for each new fighter. The whole production reminds of Japanese \"sentai\" TV serials, with exaggerated poses, extravagant martial arts flourishes and grotesque creature designs.</p>"},{"name":"Gold and Glory: The Road to El Dorado","year":2000,"developer":"Revolution Software Ltd.","url":"psx-chd-roms-g/Gold%20and%20Glory%20-%20The%20Road%20to%20El%20Dorado%20%28Europe%29.chd","filesize":329032108,"score":6.8,"genres":"Adventure > 3rd-person (Other) > Graphic adventure > Puzzle elements > Licensed","desc":"<p><em>Gold and Glory: The Road to El Dorado</em> is an adventure game very much similar to Monkey Island. This game is based on the Dreamworks cartoon with the same title and has quite the same story as the cartoon: Two lads from Spain are about to go into prison, but they don't want to, so they escape by going onto a ship and search for the legendary City of Gold, El Dorado.</p>"},{"name":"Golden Logres","year":1999,"developer":"LittleWing Co. Ltd."},{"name":"Golden Nugget (Disc 1)","year":1997,"developer":"Abalone Entertainment Software Development Inc.","url":"psx-chd-roms-g/Golden%20Nugget%20%28USA%29%20%28Disc%201%29.chd","filesize":377306673,"score":6.5,"genres":"Gambling > Strategy > 1st-person > Top-down > Fixed / flip-screen > Turn-based > Point and select > Licensed","desc":"<p>Immerse yourself in the Golden Nugget and you'll enjoy Las Vegas-style casino gaming in a four-star casino paradise with 16 games of chance to challenge and thrill you.  This is virtual nonstop casino action with all the authenticity and splendor of the real thing.</p>"},{"name":"Golden Nugget (Disc 2)","year":1997,"developer":"Abalone Entertainment Software Development Inc.","url":"psx-chd-roms-g/Golden%20Nugget%20%28USA%29%20%28Disc%202%29.chd","filesize":245208688,"score":6.5,"genres":"Gambling > Strategy > 1st-person > Top-down > Fixed / flip-screen > Turn-based > Point and select > Licensed","desc":"<p>Immerse yourself in the Golden Nugget and you'll enjoy Las Vegas-style casino gaming in a four-star casino paradise with 16 games of chance to challenge and thrill you.  This is virtual nonstop casino action with all the authenticity and splendor of the real thing.</p>"},{"name":"Goldie","year":2000,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-g/Goldie%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.chd","filesize":225672455,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select","desc":"<p>Join Goldie the deer and friends in a search for her missing mother. A strange bear may hold the key to the mystery.<br>As well as a great half-hour cartoon video, Goldie features an easy-to-use virtual colouring book and a challenging puzzle game.<br>Watch and see if Goldie will find her mother at last.</p>"},{"name":"Goryuzin Electro","year":1998,"developer":"ASK Co. Ltd.","url":"psx-chd-roms-g/Goryuujin%20Electro%20%28Japan%29.chd","filesize":160579811,"score":"","genres":"Strategy > Top-down > Board game > Puzzle elements","desc":"<p>\"GORYUZIN ELECTRO\" is a board game acknowledged for its quality by the Good Toy Committee in Japan in 1997. Based on the legend of the dragon, you have to compete connecting special frames and see to what extend can you proceed into your opponent's territory. No matter how many times you play, it is a fun game for everyone.</p>"},{"name":"GP Challenge","year":2001,"developer":"Interactive Entertainment Ltd.","url":"psx-chd-roms-g/GP%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.chd","filesize":80960049,"score":"","genres":"Racing / Driving > Behind view > Direct control > Automobile > Track racing","desc":"<p>GP Challenge puts you in the driver's seat of cars that can top 160mph!<br>Four exhilarating courses await you. Can you gain control over the opposition and record a race time that professional drivers would be proud of?<br>Fully 3D graphics and blistering Artificial Intelligence make for an exciting white-knuckle race for the finish line!</p>"},{"name":"Gradius Gaiden","year":1997,"developer":"KCE Tokyo, Inc.","url":"psx-chd-roms-g/Gradius%20Gaiden%20%28Japan%29%20%28Rev%201%29.chd","filesize":315403298,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Evil lurks out there in the universe - even after you defeated the Bacterian forces. It's 200 years into the future and Gradius is prospering. But one day, a science vessel disappeared into the Evil Range nebula. This started a domino effect which ended in the colonies around Gradius attacked and most of the planet's army in ruins. Desperately, the Gradius army launched an attack on the source with four ships in hot pursuit. Now only you, aboard your trusty Vic Viper starfighter, can put an end to the Dark Nebula in <em>Gradius Gaiden</em>, yet another shooter in the Gradius series.</p><p>Gameplay consists of moving your fighter across side-scrolling stages, shooting everything in sight and avoiding enemy fire, with your objective being to reach the end and defeat the stage boss to move on. You can collect power-ups which fills your power-up bar and which can then be triggered at any time for a specific effect depending on what bar is active at the moment. You can also power-up the Missile, Double, and Laser power-ups to become more powerful, select two new types of shield (Guard, which protects against physical barriers. and Limit, which renders you invincible for three seconds), and even re-arrange what's in your bar.</p><p>The game uses 2D graphics with some polygonal elements and features 2-player co-op gameplay as well as the option to select from four starfighters to take into battle.</p>"},{"name":"Gradius: Deluxe Pack","year":1996,"developer":"Konami Co., Ltd.","url":"psx-chd-roms-g/Gradius%20Deluxe%20Pack%20%28Japan%29.chd","filesize":259151706,"score":7.2,"genres":"Action > Compilation > Side view > Shooter","desc":"<p>This pack contains both the arcade classics Gradius I and II, ported to Windows 95, Sony Playstation and Sega Saturn.</p><p>Story: the Bacterians are attacking the planet Gradius, and in a state-of-the-art fighter ship you have to stop them. Both games have similar gameplay and graphics, with only different music and level layout setting them apart.</p><p>Each of these side-scrolling shooters has over a dozen levels each, all of which are completely unique. There are no enemy types that are re-used from level to level (except for the boss who is the same in every level). You can collect powerups that provide things like extra speed, laser shots, target-seeking missiles, shields, etc.</p><p>While there have been many small modernising touches made to the games, there is still no ability to save. Be prepared to set aside a considerable amount of time to finish in one go.</p>"},{"name":"Gran Turismo","year":1997,"developer":"Polyphony Digital Inc.","url":"psx-chd-roms-g/Gran%20Turismo%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28EDC%29.chd","filesize":415086319,"score":8.5,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing","desc":"<p>The first game in the Gran Turismo series of racing simulations.</p><p>You can choose between the arcade version (featuring classic cars such as Corvettes and Aston Martins) or the simulation, which is the true heart of the game. The simulation starts you on an entire racing career beginning with a cheap used car and second-rate tracks. You will find yourself longing for the Dodge Viper as your sad $10,000 starting fund puts you behind the wheel of a used Honda Prelude or Mazda RX-7. As you win races, acquire money, and earn advanced licenses, you are able to buy better cars and race in more competitive matches right up to the GT World Cup.</p><p>Features more than 140 cars.</p>"},{"name":"Gran Turismo 2","year":1999,"developer":"Polyphony Digital Inc.","url":"psx-chd-roms-g/Gran%20Turismo%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Disc%201%29%20%28Arcade%20Mode%29.chd","filesize":394730651,"score":8.3,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Street racing > Track racing > Vehicle simulator","desc":"<p><em>Gran Turismo 2</em> is the second game in the <em>Gran Turismo</em> series of racing games exclusively for the PlayStation. The racing game features 20 tracks and over 400 vehicles, an arcade mode and a simulation mode, and also supports two-player split screen racing. It's the first <em>GT</em> game to feature rally racing (even though it's like a time trial).</p>"},{"name":"Grand Slam","year":1997,"developer":"Burst","url":"psx-chd-roms-g/Grand%20Slam%20%28USA%29.chd","filesize":101767944,"score":6.7,"genres":"Sports > Baseball > Licensed","desc":"<p>Grand Slam Baseball was an innovative, albeit relatively low-key release from Virgin Interactive Entertainment in 1997.</p><p>Not known for sports games, VIE released Grand Slam for Windows, Sony Playstation and Sega Saturn as the second title in its attempt to establish a mainstream sports line. The first title in the short-lived line was Power Play Hockey in 1996. The sports line would last only one more title after Grand Slam's release, that being the sequel to the hockey game, also released in 1997.</p><p>Grand Slam was one of the early adopters of 3D accelerator card technology and also offered full 3D play in software alone. The Playstation and Saturn versions were 3D by default.</p><p>Grand Slam introduced a few play mechanics to video game baseball that would later prove to be fixtures in the genre. The most notable in this area was the introduction of a meter for pitching, used to control the velocity and accuracy of pitches, similar to the familiar swing meter in popular golf games. This meter was later borrowed and made popular by titles such as EA's MVP Baseball. On the batting side of things, a similar metered approach was used. This was inspired by older arcade baseball games that allowed the player to load up a swing's power with a control stick before releasing it as the pitch came in.</p><p>Other highlights amongst Grand Slam's feature set included:</p><ul><li><p>A trade AI engine that would examine the needs of a team and decide if a proposed trade was in its best interest.</p></li><li><p>Catcher AI and pitch signals, helping a player learn how to pitch to each batter's strengths and weaknesses.</p></li><li><p>Attention to details and baseball flavor, such as players that would blow bubble gum bubbles during an at bat, light- hearted commentary, an All Star Break during season play (complete with a working voting ballot), and an in-game JumboTron scoreboard that would show animations after home runs.</p></li></ul>"},{"name":"Grand Theft Auto","year":1997,"developer":"Tarantula Studios","url":"psx-chd-roms-g/Grand%20Theft%20Auto%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29%20%28EDC%29.chd","filesize":501470926,"score":7.2,"genres":"Action > Racing / Driving > Top-down > 2D scrolling > Direct control > Automobile > Contemporary > North America > Crime > Regional differences","desc":"<p>In <em>Grand Theft Auto</em>, the player takes the role of a small-time criminal trying to make it big with the mob. Stealing cars, doing jobs for the gangsters and behaving generally anti-social are the way to success.</p><p>The action moves through six levels spread over three different cities, each based on a real US city: Liberty City (based on New York City), San Andreas (based on San Francisco) and Vice City (based on Miami). To finish a level, a certain score must be reached. Stealing cars and crashing into traffic, driving over pedestrians and killing cops all raise the score, but the big points are made through jobs. Answering phones or entering special cars brings mission assignments, from simple \"ditch-a-hot-car\" jobs to supporting bank robberies or carrying out assassinations. Completing a mission will raise the score substantially and also increase the score multiplier, so that completing the next felony will gain even more points.</p><p>Criminal behavior comes with a price of course: if policemen witness a crime, the player's wanted level rises. At the lowest level, a single police car might give chase, whereas at the highest level whole car squads hunt the player, the police set up roadblocks and shoot to kill. The only way to evade the cops is to find a respray shop and get a new paint job with new license plates. This costs money which is deducted from the score, however. But even dying or being arrested are not the end. The player has several lives, and ending up in jail simply results in being stripped of all weapons and armor and the score multiplier being lowered.</p><p>The entire action is viewed from a top-down perspective, which zooms out while driving a car, for a better overview at high speeds. The cities are many screens large and can be freely explored. Crates are scattered over the cities, which might include weapons (from pistols to rocket launchers), armor or other bonus items: extra lives, police bribes (used to reduce the wanted level to zero) and get-out-of-jail-free cards (used to retain score multiplier and weapons when busted). Dozens of different vehicles are available for the taking, each with unique characteristics: a bus will handle very differently than a sports car.</p>"},{"name":"Grand Theft Auto 2","year":1999,"developer":"Tarantula Studios","url":"psx-chd-roms-g/Grand%20Theft%20Auto%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Rev%201%29.chd","filesize":380166364,"score":7.1,"genres":"Action > Racing / Driving > Top-down > 2D scrolling > Shooter > Direct control > Crime > Regional differences","desc":"<p>Lie, cheat, and steal your way through three districts of a huge city in the follow-up to Grand Theft Auto. Earn the respect of 7 different gangs as you demolish the town in your attempt to make lots of cash.</p><p>The game takes place at an undisclosed time in the near future. Unlike the first game which featured three different cities, <em>Grand Theft Auto 2</em> only features a single town, but it's divided in three districts which are unlocked one at a time: downtown, residential and industrial. Like in the original the player goes around answering phones to initiate various missions. The game uses an overhead camera in a 3D landscape and allows the player to freely explore the city and steal any vehicle the player sets his or her eyes on. To unlock new districts the player must reach a certain score which is done by committing crimes and finishing missions.</p><p>Because the game now features multiple criminal gangs, the player must choose allegiances. Performing missions for one gang, will decrease the player's reputation for another. When the player commits crimes he also becomes wanted by the local police, but as more crimes are committed without shaking the police, they will give way for first SWAT Teams, then Special Agents and finally the army.</p><p>New features include the ability to save at the church, when donating enough money, and various side missions, such as becoming a taxi driver to ear money. There are also many new cars with weapons attached such as a firetruck with a flamethrower and a car with machine guns.</p><p>On the PC version the player can change the time of day from noon to dusk to allow for more moody lighting. On the PlayStation the game can only be played at noon, and on the Dreamcast only at dusk.</p>"},{"name":"Grand Theft Auto: Director's Cut","year":1999,"developer":""},{"name":"Grand Theft Auto: London - Special Edition","year":2000,"developer":"Take-Two Interactive Software, Inc.","url":"psx-chd-roms-g/Grand%20Theft%20Auto%20-%20London%201969%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.chd","filesize":321744558,"score":"","genres":"Action > Racing / Driving > Top-down > 2D scrolling > Shooter > Crime","desc":"<p>The Special Edition of GTA London is a standalone version of Grand Theft Auto: Mission Pack #1 - London 1969 and as a result does not need a copy of the original Grand Theft Auto. It also comes with a GTA London poster.</p>"},{"name":"Grand Theft Auto: Mission Pack #1 - London 1969","year":1999,"developer":"Rockstar Canada","url":"psx-chd-roms-g/Grand%20Theft%20Auto%20-%20Mission%20Pack%201%20-%20London%201969%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29%20%28Rev%201%29.chd","filesize":330711648,"score":6.9,"genres":"DLC / Add-on > Other > Story / mission","desc":"<p><em>Grand Theft Auto: Mission Pack #1 - London 1969</em> is an official expansion pack to Grand Theft Auto. Instead of the fictional interpretations of New York, Miami and Los Angeles of the original, this game opens up the city of London to the player. The game features thirty new vehicles, new graphics and thirty-two new missions; all in a distinctly British theme. The new city contains many familiar landmarks from London in the late 60s as well as other cultural reference and Cockney slang. This time the player can choose the avatar's appearance, otherwise gameplay has not been changed from the original game. The player still is involved in organized crime and must perform a variety of criminal activities.</p>"},{"name":"Grandia (Disc 1)","year":1999,"developer":"Game Arts Co., Ltd.","url":"psx-chd-roms-g/Grandia%20%28Europe%29%20%28Disc%201%29.chd","filesize":430614383,"score":7.7,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy > Steampunk","desc":"<p>The ancient Angelou civilization has ceased to exist centuries ago, and technology in the world develops rapidly. General Baal, the head of the militaristic Garlyle Forces, organizes an excavation of ancient ruins, apparently for philanthropic reasons. Meanwhile, Justin, a young boy from the nearby town of Parm, decides to investigate the ruins in search of the Spirit Stone, an artefact that once belonged to his missing father. A mysterious holographic image tells him that he should travel to faraway lands to discover the stone's true power, and he embarks on the most dangerous adventure of his life without hesitation. </p><p><em>Grandia</em> is a Japanese-style role-playing game. The characters are represented by 2D sprites which are moved around over 3D backgrounds in towns and dungeons. The game makes use of anime-style cutscenes to advance the story. Combat is initiated by coming into contact with enemies on the screen, rather than through random battles. Battles occur in pseudo-real-time, using an 'IP Gauge' to determine when a character takes action. Striking at the right time or with the right ability can even delay or cancel an enemy's turn.</p><p>The characters in the game gradually advance in level as they gain experience points for killing monsters. Characters also gain experience based on the weapon (e.g. sword, mace, whip, etc.) or magic (e.g. fire, water, etc.) that they use, powering up their spells and learning new ones from continuous usage. There are a large number of spells, weapons, and other items to use throughout the game.</p>"},{"name":"Grandia (Disc 2)","year":1999,"developer":"Game Arts Co., Ltd.","url":"psx-chd-roms-g/Grandia%20%28Europe%29%20%28Disc%202%29.chd","filesize":412624240,"score":7.7,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy > Steampunk","desc":"<p>The ancient Angelou civilization has ceased to exist centuries ago, and technology in the world develops rapidly. General Baal, the head of the militaristic Garlyle Forces, organizes an excavation of ancient ruins, apparently for philanthropic reasons. Meanwhile, Justin, a young boy from the nearby town of Parm, decides to investigate the ruins in search of the Spirit Stone, an artefact that once belonged to his missing father. A mysterious holographic image tells him that he should travel to faraway lands to discover the stone's true power, and he embarks on the most dangerous adventure of his life without hesitation. </p><p><em>Grandia</em> is a Japanese-style role-playing game. The characters are represented by 2D sprites which are moved around over 3D backgrounds in towns and dungeons. The game makes use of anime-style cutscenes to advance the story. Combat is initiated by coming into contact with enemies on the screen, rather than through random battles. Battles occur in pseudo-real-time, using an 'IP Gauge' to determine when a character takes action. Striking at the right time or with the right ability can even delay or cancel an enemy's turn.</p><p>The characters in the game gradually advance in level as they gain experience points for killing monsters. Characters also gain experience based on the weapon (e.g. sword, mace, whip, etc.) or magic (e.g. fire, water, etc.) that they use, powering up their spells and learning new ones from continuous usage. There are a large number of spells, weapons, and other items to use throughout the game.</p>"},{"name":"Granstream Saga, The","year":1997,"developer":"Shade, Inc.","url":"psx-chd-roms-g/Granstream%20Saga%2C%20The%20%28Europe%29.chd","filesize":360089001,"score":6.8,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Action RPG > Sci-fi / futuristic","desc":"<p>Many years ago, the Allied Spirit Army fought the malevolent Imperial Wizardry in a prolonged war. Neither side could gain the upper hand until the Imperial Wizardry designed a weapon with too much destructive power. Causing the planet's axis to shift, the deployment of the weapon resulted in the melting of polar ice, which led to a world-wide flood. Four wise men designed a mechanism that allowed the planet's four continents to float above the water. For generations, the secrets of maintaining the mechanism have been passed from the wise men to their descendants. But now, the last of those are gone, and the planet begins to sink into the vast ocean.</p><p>Eon is a young man who lives on the continent of Shilf with his foster father. One day, he discovers the powers of a magical orb he found when he was a child. Seeing these powers, Eon's foster father realizes that he might be connected to the wise men of the past. Eon must find the only person who can fix the continent-raising mechanism, and prevent a terrible disaster.</p><p><em>The Granstream Saga</em> is an action game with strong RPG elements, and a spiritual successor to Gaia games. The player controls Eon as he explores overworld and dungeon locations, which are presented in overhead-viewed 3D. Battles are one-on-one; whenever an enemy is encountered, the view is zoomed on the combat participants who must fight each other until one of them emerges victorious. Eon can use swords, daggers, or axes against his enemies. He has a variety of attack moves at his disposal, including combos, shield-breaking abilities, etc.; he can also actively guard and cast magic spells. Leveling up, which increases Eon's attributes, occurs at set intervals throughout the game rather than from accumulating experience points.</p>"},{"name":"Grid Runner","year":1996,"developer":"Radical Entertainment Inc.","url":"psx-chd-roms-g/Grid%20Run%20%28Europe%29.chd","filesize":311112000,"score":6.5,"genres":"Action > Diagonal-down > Sci-fi / futuristic","desc":"<p>Aliens have captured you and you are forced to play a deadly game of what appears to be capture the flag combined with tag. Race your way around the area and capture the required number of flags before being touched by your opponent. If they do touch you, you must find and touch them before they capture the right number of flags. Who ever is \"it\" cannot capture flags until their opponent is tagged. There is a story and 2 player versus mode. Through the story, you face many different enemies with ranging speeds and firepower (gun fire only slows down the person shot, there is no health bar).</p>"},{"name":"Grinch, The","year":2000,"developer":"Artificial Mind & Movement","url":"psx-chd-roms-g/Grinch%2C%20The%20%28USA%29%20%28En%2CFr%2CEs%29.chd","filesize":277631014,"score":4.6,"genres":"Action > Puzzle elements > Licensed","desc":"<p>As the Grinch, you're going to make sure that Whoville will NOT celebrate Christmas this year... Your missions, should you choose to accept them, includes breaking presents, build some of your nasty gadgets (rotten egg launcher, slime shooter), messing with the mail... And more. Explore four large environments in search of your blueprints for your \"weapons\". Even summon your pal Max for a little assistance at times.</p>"},{"name":"Grind Session","year":2000,"developer":"Shaba Games LLC","url":"psx-chd-roms-g/Grind%20Session%20%28USA%29.chd","filesize":317951432,"score":7.5,"genres":"Sports > 3rd-person (Other) > Skateboarding > Licensed","desc":"<p>A pretender to the Tony Hawk's crown.</p><p>Get ready to ride the rails and ollie over fences in Grind Session. You can choose from six professional skaters: Willy Santos, Daewon Song, Cara-Beth Burnside, Ed Templeton, Pigpen, and John Cardiel. </p><p>If you can't find a skater that fits your style, you can create you own skater. After getting the boarder you want, go out and earn some respect in the games eight stages, which include some parks in the Van's Triple Crown of Skateboarding. </p><p>Each level has a number of objectives that earn you respect points after they are completed. With respect, new levels open up including several competitions, which are broken down into street, vert, and best trick events. </p><p>If your friends want to challenge you, take them on in a number of different 2 Player modes.</p>"},{"name":"Gritz: The Pyramid Adventure","year":1997,"developer":"","url":"psx-chd-roms-g/Gritz%20-%20The%20Pyramid%20Adventure%20%28Japan%29.chd","filesize":293999695,"score":"","genres":"Action > Top-down > Fixed / flip-screen > Direct control > Africa > Egypt (Ancient)","desc":"<p><em>Gritz: The Pyramid Adventure</em> is a game about adventurers from four different countries, Mexico, England, Israel and Zaire who travel to Egypt to find secrets and treasures in the pyramids. The game play is similar to Bomberman. Players try to avoid getting washed down drains in the maze and other players to to get their opponents to fall into traps they set. There is a VS mode, where up to 4 human players can play with the use of the Multitap. There is also a story mode where the player chooses one of the 4 main characters and goes through the 8 floors of the pyramid.</p>"},{"name":"Groove Adventure Rave: Yuukyuu no Kizuna","year":2002,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-g/Groove%20Adventure%20Rave%20-%20Yuukyuu%20no%20Kizuna%20%28Japan%29.chd","filesize":61924502,"score":"","genres":"Action > Role-playing (RPG) > Isometric > Anime / Manga > Real-time > Fantasy > Licensed","desc":"<p>Groove Adventure Rave is based on the manga and anime of the same name, written by Hiro Mashima. This action RPG puts the player in the shoes of Haru, the main protagonist of the manga. The game begins with a weird storm on the gang's ship where Haru is thrown overboard, along with Plue and, a little later, Elie. When Haru comes to the grand adventure starts. The only problem is, his sword (the Decaforce Sword) and Elie are both missing...</p><p>The game shares some similarities with Diablo or Shining Soul in that it is a hack'n'slash RPG seen from an isometric perspective. Haru can use normal attacks, but also charged attacks and has a small real-time inventory to aid him while in battle. Leveling up happens automatically when the experience meter is full, and doesn't interrupt gameplay with a statistics screen.</p>"},{"name":"Groove Jigoku V: SweepStation Version","year":1998,"developer":"Opus Corp.","url":"psx-chd-roms-g/Groove%20Jigoku%20V%20-%20SweepStation%20Version%20%28Japan%29.chd","filesize":165486400,"score":"","genres":"Action > Side view > Top-down > Fixed / flip-screen > Arcade > Mini-games","desc":"<p><em>Groove Jigoku Five</em> is one part a DJ mixing console and also a collection of mini-games.</p><p>The DJ mixer screen is a music editor where players can listen to music and alter it by changing the beat and applying various effects and sounds. Initially only a portion of sounds is available, and to unlock the rest of them the players need to play the other part of <em>Groove Jigoku Five</em>.</p><p>The other part of the game is a collection of mini-games, or hell part-time jobs. These games are usually short and visually simplistic. On the mini-game selection screen only three random mini-games are available at each time and the players need to play more to unlock more games. They include counting people in traffic, crossing a road collecting mushrooms along the way, chopping logs, racing to the cliff, remembering the right sequence, spotting ghosts, assembling ball pens, and more. For doing these jobs the players get some money, which they can spend at vending machines, which give out random prizes. It can be either sounds for the DJ mixing console, or just random collectible pictures.</p><p>Most of the mini-games were later reused in the PSP game WTF: work time fun (Baito Hell 2000) practically unchanged or with minor cosmetic iterations. The game's structure, except for the DJ mixing part, was also carried over to <em>WTF: work time fun</em>.</p>"},{"name":"Growlanser (Disc 1)","year":1999,"developer":"Career Soft","url":"psx-chd-roms-g/Growlanser%20%28Japan%29%20%28Disc%201%29.chd","filesize":432122170,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > Anime / Manga > Real-time > Turn-based > Fantasy","desc":"<p><em>Growlanser</em> is a fantasy SRPG (strategy role-playing game), and the first in the Growlanser series of games.</p><p>The main character is Carmaine, an orphan raised by the palace royal magician, Sandra. Prophesied as an infant to become either \"the darkness to destroy the world\" or \"the light which saves it\", Sandra carefully watches over him and never allows him to leave Rolandia's capital city, Rosaria, or have any contact with the outside world. However, throughout his childhood Carmaine experiences strange and vivid dreams of people and places he knows nothing about. When at last he becomes old enough, Sandra tells him it is time to go out and explore beyond the city gates. Accompanied by Tippi, his tiny fairy-like companion, he leaves the city to discover his destiny.</p><p>The game has a complex storyline with branching paths. During his travels Carmaine will discover different lands and peoples. Among them are the Growsians, humans who can wield ancient magic, and the Featherians, a winged race of people. As the story progresses, Carmaine discovers that there are conspiratorial enemies seeking to cause trouble for the land and people.</p><p>Carmaine's personality, stats and skills are determined by answering questions at the beginning of the game. Eventually other characters can join Carmine's party, some whose recruitment requires fulfilling certain conditions. Romance elements are possible with some party members.</p><p>Combat between enemies and the large party of controllable characters is a mixture of real-time and turn-based styles. Strategic battles occupy the entire location; depending upon where the battle occurs, non-party members nearby (such as townspeople, soldiers etc.) may help the party by joining in.</p><p>The 2001 Windows release of the game includes redrawn character portraits of a higher quality. The 2009 PSP port adds several new characters as well as a new story branch and ending.</p>"},{"name":"Growlanser (Disc 2)","year":1999,"developer":"Career Soft","url":"psx-chd-roms-g/Growlanser%20%28Japan%29%20%28Disc%202%29.chd","filesize":421730747,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > Anime / Manga > Real-time > Turn-based > Fantasy","desc":"<p><em>Growlanser</em> is a fantasy SRPG (strategy role-playing game), and the first in the Growlanser series of games.</p><p>The main character is Carmaine, an orphan raised by the palace royal magician, Sandra. Prophesied as an infant to become either \"the darkness to destroy the world\" or \"the light which saves it\", Sandra carefully watches over him and never allows him to leave Rolandia's capital city, Rosaria, or have any contact with the outside world. However, throughout his childhood Carmaine experiences strange and vivid dreams of people and places he knows nothing about. When at last he becomes old enough, Sandra tells him it is time to go out and explore beyond the city gates. Accompanied by Tippi, his tiny fairy-like companion, he leaves the city to discover his destiny.</p><p>The game has a complex storyline with branching paths. During his travels Carmaine will discover different lands and peoples. Among them are the Growsians, humans who can wield ancient magic, and the Featherians, a winged race of people. As the story progresses, Carmaine discovers that there are conspiratorial enemies seeking to cause trouble for the land and people.</p><p>Carmaine's personality, stats and skills are determined by answering questions at the beginning of the game. Eventually other characters can join Carmine's party, some whose recruitment requires fulfilling certain conditions. Romance elements are possible with some party members.</p><p>Combat between enemies and the large party of controllable characters is a mixture of real-time and turn-based styles. Strategic battles occupy the entire location; depending upon where the battle occurs, non-party members nearby (such as townspeople, soldiers etc.) may help the party by joining in.</p><p>The 2001 Windows release of the game includes redrawn character portraits of a higher quality. The 2009 PSP port adds several new characters as well as a new story branch and ending.</p>"},{"name":"Grudge Warriors","year":2000,"developer":"Tempest Software Ltd","url":"psx-chd-roms-g/Grudge%20Warriors%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":304273236,"score":6.1,"genres":"Action > Racing / Driving > 3rd-person (Other) > Shooter > Sci-fi / futuristic","desc":"<p>In the future, gang warfare is settled between gangs by using advanced armored vehicles. A mysterious figure called the Crimelord has set up a tournament on a secluded island dubbed \"The Death Ring\"  to get all the gangs to fight each other to earn his favor. It's up to the player to take their gang to the top by infiltrating all the opposing gang's bases of operation and take out their network of power generators which will effectively cripple those opposing factions.</p><p>Gameplay is centered around vehicular combat. Bases are defended by enemy vehicles, gun turrets, and mortars which harass the player while they are searching for the power generators to destroy. Players choose a vehicle (which represents a gang) with each coming with their own distinctive weapons such as shield draining bombs, energy megabolts, corrosive sulfur gas bombs and, mini-thermonuclear warheads. Each of the 23 missions contain power-ups such as invulnerability, invisibility, double damage, nitro boosts, and guided missile lock jammers. Powerups are earned after collecting a number of tokens scattered throughout each mission.</p><p>There is also a 2 player split screen combat mode where two players can fight against each other.</p>"},{"name":"Guardian of Darkness, The","year":1999,"developer":"Cryo Interactive Entertainment","url":"psx-chd-roms-g/Guardian%20of%20Darkness%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":512693010,"score":5.3,"genres":"Action > 3rd-person (Other) > Puzzle elements","desc":"<p><em>Guardian of Darkness</em> is an action game with puzzle-solving elements. Ekna is an exorcist monk from the \"The Gate\", an ultra-secret organization regularly sends him on the most perilous missions involving the paranormal. The first level starts with an investigation of an haunted museum. His assistant Edward Burnst will train him how to use his different spells. After each level, Ekna returns to his headquarters, the Tenebrans where he can get his orders from \"The Gate\" and get his specials weapons like grenades or energy power ups.</p>"},{"name":"Guardian's Crusade","year":1998,"developer":"Tamsoft Corporation","url":"psx-chd-roms-g/Guardian%27s%20Crusade%20%28Europe%29.chd","filesize":173782911,"score":6.7,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>A young boy named Knight is sent on a routine assignment by the mayor of his home town. His best friend, a fairy girl named Nehani, joins him. Together, they find a little pink monster whom they call <em>Baby</em>. Shortly afterwards, Knight has a vision: a mysterious voice tell him that they should go to a place called \"God's Tower\", where they can find Baby's mother. On their way, the three encounter people and groups with different agendas, and eventually begin to put the pieces of the puzzle together and discover the source of evil.</p><p><em>Guardian's Crusade</em> - or <em>Knight &amp; Baby</em>, as it was originally called - is a Japanese-style role-playing game with turn-based combat. A notable feature of the game is a seamless 3D world, without the transitions from \"world map\" to individual locations or hostile areas to towns, as it is the case in most comparable games. The game has no random battles: all the enemies are visible during exploration, and can be avoided or bypassed silently. Lower-level enemies will flee when they see the protagonist's party. </p><p>During his journey, Knight will find so-called <em>Living Toys</em>, mechanical creatures that can assist him in battles. There are many types of Living Toys - offensive, supportive, healing, and those that can be used outside of combat. Using a Living Toy drains Knight's special PP (psychic points) meter.</p>"},{"name":"Gubble","year":1998,"developer":"Actual Entertainment, Inc.","url":"psx-chd-roms-g/Gubble%20%28Europe%29.chd","filesize":395740828,"score":7,"genres":"Action > Side view > Arcade > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>An arcade game in which you have to break apart levels in order to free your planet from an enemy race.</p><p>You are Gubble D. Gleep, an alien who wakes up to find that his planet has been taken over by an enemy race, so you have to break apart areas using tools.</p>"},{"name":"Guilty Gear","year":1998,"developer":"Team Neo Blood","url":"psx-chd-roms-g/Guilty%20Gear%20%28Europe%29.chd","filesize":200768926,"score":6.8,"genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Fighting","desc":"<p>In 22th century, the scientists, learning the ancient ways of magic, discovered a new technique that made it possible to create artificial beings by mixing the DNA of humans and animals. Those new creatures were called \"gears\". They had no will of their own and were destined to obey the humans forever. However, a gear named Justice was, for a mysterious reason, capable of disobeying the humans and making decisions of his own. He organized a rebellion of gears, that was later repressed by the knights of the Sacred Order, who put him in a prison. But recently, Justice broke free, and the Order organized a tournament to find out who is capable of hunting him down again. Among the main contestant is a man with unclear past, Sol Badguy, and his rival Ky Kiske, one of the most skilled knights of the order. The conditions of the tournament are, however, very strange. It is allowed to spill blood, and the first prize is also not very usual: any wish of the winner will be fulfilled...</p><p><em>Guilty Gear</em> is a 2D fighting game, in which you can play as one of 10 very different kind of characters. There is a selection of fighters from Holy Order knights, Armed Air Force soldiers, Mafia members and mad scientists. Each character has his/her own storyline that will be fully revealed during the final showdown. In battles, you can charge up for special attacks, as well as perform Deathblow moves, which would kill the opponent instantly. You can either choose to finish the Arcade mode, challenge your friends to a Versus battle, or either train your skills out in the Training mode.</p>"},{"name":"Guitar Freaks","year":1999,"developer":"Konami Computer Entertainment Japan Co., Ltd.","url":"psx-chd-roms-g/Guitar%20Freaks%20%28Japan%29.chd","filesize":171294396,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>Guitar Freaks</em> is a rhythm action game ported from the 1998 arcade game of the same title. Long before Guitar Hero was ever conceived, Konami made the first inroads to a plastic guitar future with this spinoff of its popular Beatmania rhythm game series. Notes scroll up towards the top of the screen in three columns, and the player must hold the correct notes and strum the plastic guitar to play along with the music. The better the timing, the more points are earned, but miss enough notes and the song is failed.</p><p>The game includes all the songs from the original arcade game, as well as a number of additional new songs that can be unlocked. One or two players can play simultaneously, and there is of course support for a plastic guitar controller (sold separately). The game can also share data with the arcade release <em>Guitar Freaks Link Ver</em>.</p>"},{"name":"Guitar Freaks Append 2nd Mix","year":2000,"developer":"Konami Computer Entertainment Japan Co., Ltd.","url":"psx-chd-roms-g/Guitar%20Freaks%20Append%202nd%20Mix%20%28Japan%29.chd","filesize":326160677,"score":"","genres":"DLC / Add-on > Map / level","desc":"<p>This is a port of the arcade rhythm <em>Guitar Freaks 2nd Mix</em>, which is part of Konami's popular Bemani franchise. It includes all the new songs and modes from the arcade versions of <em>2nd Mix</em>, along with a handful of tracks from the first game. This release is a so-called \"append disc\", and requires the original Guitar Freaks to play. It is also possible to share data with the arcade version of <em>Guitar Freaks 3rd Mix</em> with a memory card.</p>"},{"name":"GUNbare! Game Tengoku: The Game Paradise 2","year":1998,"developer":"Jaleco Ltd.","url":"psx-chd-roms-g/Gunbare%21%20Game%20Tengoku%20-%20The%20Game%20Paradise%202%20%28Japan%29.chd","filesize":443953806,"score":"","genres":"Action > Top-down > 2D scrolling > Anime / Manga > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The evil scientist Genius Yamada is trying to take over the world of video games. Yuki Ito, part-time bunny girl at the \"You and Me\" arcade, enlists the help of a variety of Jaleco game characters to travel through the game world and put a stop to his nefarious plans.</p><p>The playable characters include:</p><ul><li>Jeynus Starmine, pilot of the Fighter-EX from Exerion</li><li>Seria, pilot of the ship from Plus Alpha</li><li>Pig, from Okkotoshi Puzzle Tonjan!?</li><li>Z-DYNE MK II, the successor to the mech from Formation Z</li><li>Miki and Misato, two young girls piloting the radar ship Genesis 3 from Field Combat</li><li>Sakura, the younger sister of Momoko from Momoko 120%</li><li>Clairs, a young girl driving the car from City Connection</li></ul><p>The game itself is a comical scrolling shooter reminiscent of Konami's Parodius series. The most unique aspect of the game is its two-player mode, in which one player uses a regular controller and plays the game as a regular shooter, and the other player uses a Guncon and plays the game as a light-gun shooter.</p>"},{"name":"Gunbird","year":1995,"developer":"Psikyo","url":"psx-chd-roms-g/Gunbird%20%28Japan%29.chd","filesize":439523774,"score":6.8,"genres":"Action > Top-down > 2D scrolling > Anime / Manga > Arcade > Shooter > Fantasy > Steampunk","desc":"<p>Gunbird is a vertically scrolling shoot 'em up developed by Psikyo. It hit the Japanese arcade in 1994 and was followed by a Japanese release to the Saturn and the Playstation in the following year.</p><p>The game is set in a fantasy setting with steampunk elements. Lush forests and medieval castles meet steam trains and mech robots. Instead of piloting the genre-traditional space ships, Gunbird lets the player chose between five different characters (Ash, Marion, Valnus, Yuan Nang and Tetsu) who traverse the game world on broomstick, jet packs and pedal-powered helicopters on a quest to find the pieces of a magic mirror across seven stages. </p><p>Unorthodox vehicles aside, the gameplay follows traditional genre standards. The main goal is to dodge all bullets that fill the screen while collecting power-ups to make the character stronger. Gunbird features one power-up that incrementally increases the firepower of the standard weapon (P-items) as well as additional ammo for the screen-clearing special ability (B-items). Standard weapon and special ability differ from character to character. Where some characters excel in high firepower in a straight line others allow for a wider spread of bullets or additional homing missiles.</p>"},{"name":"Gundam 0079: The War for Earth (Disc 1)","year":1997,"developer":"Presto Studios, Inc.","url":"psx-chd-roms-g/Gundam%200079%20-%20The%20War%20for%20Earth%20%28Japan%29%20%28Disc%201%29.chd","filesize":238958107,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Full Motion Video (FMV) > Puzzle elements > Mecha / giant robot > Licensed","desc":"<p>A simple puzzle oriented game based upon the popular Gundam robot warrior series.  Game has several FMV shots of fighting robots and live actors superimposed over bluescreens.  </p><p>You have a set of choices that are presented during each scene.  The choice you make decides if you progress through the game or not.</p>"},{"name":"Gundam 0079: The War for Earth (Disc 2)","year":1997,"developer":"Presto Studios, Inc.","url":"psx-chd-roms-g/Gundam%200079%20-%20The%20War%20for%20Earth%20%28Japan%29%20%28Disc%202%29.chd","filesize":211184765,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Full Motion Video (FMV) > Puzzle elements > Mecha / giant robot > Licensed","desc":"<p>A simple puzzle oriented game based upon the popular Gundam robot warrior series.  Game has several FMV shots of fighting robots and live actors superimposed over bluescreens.  </p><p>You have a set of choices that are presented during each scene.  The choice you make decides if you progress through the game or not.</p>"},{"name":"Gundam Battle Assault","year":2000,"developer":"Natsume Co., Ltd.","url":"psx-chd-roms-g/Gundam%20Battle%20Assault%20%28USA%29.chd","filesize":266178475,"score":6.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Arcade > Fighting > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>This game is the follow-up to Gundam: The Battle Master. Heero Yuy, the pilot of a Mobile Suit Wing Gundam is on a mission to destroy the remaining enemy Mobile Suits, who are under the command of Treize Khushrenada, in order to stop a war from starting. In the story mode, Heero can pilot any of the available mobile suits to do battle with his enemies. Each suit has its own set of special moves and a super attack. Some of the weapon based special attacks use ammunition which can eventually run out. The super attack can only be used 3 times during each fight. Each suit also has thrusters that can be used to fly in the air a bit. On the defensive side, players can dodge attacks by sidestepping and also can utilize a beam shield which can be used to protect the player from projectile attacks. Mobile suits come with 3 life bars total and fights are decided by trying to deplete all the life bars of an enemy mobile suit.</p><p>The game also contains a 2 player versus mode. </p><p>Options allow the player to choose their difficulty level and also let them set the timer during a match to either on or off.</p>"},{"name":"Gundam Battle Assault 2","year":2002,"developer":"Natsume Co., Ltd.","url":"psx-chd-roms-g/Gundam%20Battle%20Assault%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":141605761,"score":7.3,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Gundam Battle Assault 2</em> is an one-on-one fighting game, based on the popular anime series \"Mobile Suit Gundam\" and its various offshoots. You can play as the titular Gundams (giant walking robots) from a wide variety of series. The game features standard fighting game mechanics, with punches, kicks and a variety of combo moves that can be executed by each Gundam. Note that the Mobile Suits aren't as mobile as humans, and thus the fighters' movements are slower and their maneuverability is worse than in most fighting games. </p><p>The game has several playing modes, which must be unlocked by using different Mobile Suits on the various difficulty levels. The available modes are: street mode, story mode, versus (a single duel where you can choose your opponent), two time attack modes (where you must defeat either 8 regular enemies or 4 boss enemies as fast as possible) and survival (defeat as many enemies as possible; fight until you beat all of them, or until one of them beats you.)</p>"},{"name":"Gundam: The Battle Master","year":1997,"developer":"Natsume Co., Ltd."},{"name":"Gunfighter: The Legend of Jesse James","year":2001,"developer":"Rebellion Developments Ltd.","url":"psx-chd-roms-g/Gunfighter%20-%20The%20Legend%20of%20Jesse%20James%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":103210032,"score":6.6,"genres":"Action > 1st-person > Arcade > Shooter","desc":"<p>You play as Jesse James in this arcade-style gunfighting game. Both him and his partner, Cole Younger, ride into town to pick up Zee, Jesse's girlfriend, and ride out of town. But fate works against them - Zee is kidnapped by a posse of bandits, and Cole is slain.</p><p>It's up to you to rescue Zee and avenge your deceased partner by fighting your way through several levels filled with classic wild west action!</p><p>Gunfighter features gameplay similar to Time Crisis: You remain hidden behind cover, and must hold down a button (or a pedal, depending on your setup) in order to peek out and shoot at the enemy. But doing this leaves you vulnerable to attack, so you must be careful to not get hit.</p><p>The game features a full-fledged story mode, as well as a no-frills arcade mode and a series of mini-games to keep you interested in the game.</p>"},{"name":"Gungage","year":1999,"developer":"KCE Tokyo, Inc.","url":"psx-chd-roms-g/Gungage%20%28Europe%29.chd","filesize":150584257,"score":6.7,"genres":"Action > Behind view > Anime / Manga > Shooter > Sci-fi / futuristic","desc":"<p><em>Gungage</em> is a futuristic Third Person Shooter for the PlayStation. In the game, the world is threatened by strange creatures from an alternative world called Dark Moon, who want to take over the Earth.</p><p>You start the game with only one character available to play with, but three more can be unlocked. Each character has its own characteristics when it comes to the size of their gun, their speed, and their size. Each character also has their own special psychic powers. The story evolves differently with the various characters, but the same levels are used. During the game, special powers have to be collected.</p><p>Settings of the various levels in the game vary from deserts to laboratories. Enemies in the game vary from prehistoric looking beast to futuristic robots and tanks. Enemies can run around, pop out of the ground, fly in the air, and come out of the water. Levels are completed by confronting and defeating a giant level boss. The game can be played in easy, medium, and hard mode.</p>"},{"name":"Gunpey","year":1999,"developer":"Koto Laboratory","url":"psx-chd-roms-g/Gunpey%20%28Japan%29.chd","filesize":5004127,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Real-time > Point and select > Western","desc":"<p><em>Gunpey</em> is a puzzle game set in the wild west. Your goal is to connect pieces of fuses to get one long fuse going across the board, making it explode and disappear. There are several game modes in Gunpey, such as the classical puzzle game modes \"Endless mode\", where you can either play until you mess up or timed, either for 2 or 5 minutes. \"Stage mode\", where you have to clear a certain amount of tiles before advancing to the next stage. \"Puzzle mode\", where you have a set amount of fuse pieces and you need to make them all go away in one explosion. And finally \"Vs. mode\", where you can face off against a friend.</p>"},{"name":"Gunship","year":1996,"developer":"MicroProse Software, Inc.","url":"psx-chd-roms-g/Gunship%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":337284356,"score":7.1,"genres":"Simulation > 1st-person > 3rd-person (Other) > Helicopter > Vehicular combat","desc":"<p>An update to Gunship 2000. This updated game now includes full textures on all 3D objects. The game features two game modes. The Quick Fire game mode has the player piloting a helicopter, trying to take out as many enemy targets as they can.</p><p>There is also a campaign mode where players can tackle various day and night missions in either Central Europe or the Persian Gulf. Missions range from destroying enemy convoys to taking out enemy platoons. Players start out as a greenhorn and can only do training or single scenario missions at first. The player can eventually get promoted to campaign scenario missions where they can also get to control a complete squad of five copters.</p><p>The game features flyable versions of the AH-64A Apache, UH-60K Blackhawk, AH-66B Comanche and four other authentic U.S. Army attack helicopters. Copters can be equipped with unguided weapons like rockets and machine guns and guided weapons like Hellfire, Sidewinder, and Stinger missiles which are used to take out both air and ground targets. Copters can be flown from either a cockpit view or from a chase view. The game also has other camera views such as the remote view or the tactical view.</p>"},{"name":"Guntu Western Front June, 1944","year":1997,"developer":"","url":"psx-chd-roms-g/Guntu%20-%20Western%20Front%20June%2C%201944%20-%20Tetsu%20no%20Kioku%20%28Japan%29.chd","filesize":430060549,"score":"","genres":"Action > 1st-person > Arcade > Rail shooter > World War II","desc":"<p><em>Guntu Western Front June, 1944</em> is a first person rail shooter set during World War II. It takes place in occupied France just prior to the invasion of Normandy and the task in each of the game's six levels is to destroy a certain target, usually some sort of tank or other heavily armoured object.</p><p>Like in other rail shooters the movement through the levels are automatic and all the player has to do is move a crosshair and shoot down the various German soldiers and vehicles that attack him. Two weapons are available at any time: a rapidly firing machine gun and a far slower rocket launcher. Ammo is available in unlimited quantities but has to be reloaded which happens automatically when the player releases the trigger. The game is time based and lacks both hit points and lives. Instead taking damage leads to time being removed and when it reaches zero the game is over (although there is a continue option to restart the current level). But time is also added to the clock when enemies are shot down.</p>"},{"name":"Gute Zeiten - Schlechte Zeiten: Volume 2","year":1999,"developer":"Software 2000"},{"name":"Gute Zeiten - Schlechte Zeiten: Volume 3","year":2000,"developer":"Software 2000"}]