[{"name":"Hakaioh: King of Crusher","year":1998,"developer":"","url":"psx-chd-roms-h/Hakaiou%20-%20King%20of%20Crusher%20%28Japan%29.chd","filesize":305559913,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Sci-fi / futuristic","desc":"<p>You are a Japanese salary man, normal in every way... except that you've just been bitten by an evil space insect, turning you from a regular man into a rage-fueled monster. Destroy anything you can to fill your dopamine gauge, and reach the end of the stage to continue your transformation from a normal human into an enormous <em>kaijuu</em> monster, all the while avoiding the police and the military trying to stop you.</p>"},{"name":"Hamster Club-i","year":2002,"developer":"Jorudan Co., Ltd.","url":"psx-chd-roms-h/Hamster%20Club-i%20%28Japan%29.chd","filesize":26240693,"score":"","genres":"Action > Anime / Manga > Life / social simulation > Mini-games > Direct control","desc":"<p>Based on the <em>Hamster Club</em> manga, this virtual pet game has players raising dwarf hamsters. In the main raising mode, players take care of their pets and manage their stats. Actually growing their pets, though, requires taking part in the different minigame competitions. These action games, in genres as varied as 100 meter dash and one-on-one fighting, each feature different gameplay styles.</p><p>The <em>i</em> part of the title referred to its online features, using DoCoMo's i-mode cell phone service, which have since been discontinued.</p>"},{"name":"Hana to Ryuu: Hanafuda・Mah-jong","year":1998,"developer":"I'Max Corp.","url":"psx-chd-roms-h/Hana%20to%20Ryuu%20-%20Hanafuda%2C%20Mahjong%20%28Japan%29%20%28Major%20Wave%29.chd","filesize":193347083,"score":"","genres":"Strategy > 1st-person > Anime / Manga > Board game > Cards / tiles > Licensed","desc":"<p>Hana to Ryuu～Hanafuda・Mah-jong～ is an old-school table game that combines hanafuda game (a type of Japanese playing cards) and mah-jong game into one. Player can play Koi-Koi, Hana Awase and Mah-jong in this single title and spend hours enjoying the two game modes, free versus mode and story mode (gambler mode), at ease. In story mode, player will be given a chance to feel what it’s like to become a real wandering gambler and earn money by joining hanafuda and mah-jong matches in the gamble town. Player will be challenged by as many as 80 opponents, each of them has unique playing style and way of thinking. In free versus mode, player can choose from 80 opponents and set up the game with detailed rules and even local rules. Providing two game modes and loads of opponents, this game guarantees endless fun for every fan of table game.</p>"},{"name":"Hanabi Fantast","year":1998,"developer":"Magical Company Ltd.","url":"psx-chd-roms-h/Hanabi%20-%20Fantast%20%28Japan%29.chd","filesize":350062215,"score":"","genres":"Action > Behind view > Anime / Manga > Platform > RPG elements > Fantasy","desc":"<p>This is the fascinating firework simulation game!<br>Save the theme park \"Fireworks Land\" that is loved by everyone!<br>Gather firework materials at each stage and create specified or original fireworks for each area.<br>Launch your fireworks on the beautiful stage of the Fireworks Land that is brilliantly drawn in 3D!</p>"},{"name":"Hanafuda Graffiti Koikoi Monogatari","year":1996,"developer":"I'Max Corp.","url":"psx-chd-roms-h/Hanafuda%20Graffiti%20-%20Koi-Koi%20Monogatari%20%28Japan%29%20%28Major%20Wave%29.chd","filesize":16868540,"score":"","genres":"Simulation > 1st-person > Anime / Manga > Board game > Cards / tiles","desc":"<p>Hanafuda Graffiti Koikoi Monogatari is a hanafuda game (a type of Japanese playing cards) that features a story mode and a free versus mode. In story mode, the game starts with the main character taking on different challenges in order to become the successor of a prestigious school of hanafuda. Player can enjoy lots of typical gameplay features for adventure game, such as moving around in the town, searching the room for special items and triggering off love story events. In free versus mode, two hanafuda games, Koi-Koi and Hana Awase, are playable. Game instruction can be displayed anytime during gameplay so even beginners can easily enjoy the fun of hanafuda. To fuel up the game further, characters with plenty of personalities and unique reactions will be appearing in the game. Seasoned players can also maximize their hanafuda experience by customizing their game with detailed settings.</p>"},{"name":"Happy Salvage","year":2000,"developer":"Media Works Inc.","url":"psx-chd-roms-h/Happy%20Salvage%20%28Japan%29.chd","filesize":421451705,"score":"","genres":"Adventure > 1st-person > Diagonal-down > 2D scrolling > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Direct control","desc":"<p><em>Happy Salvage</em> is a treasure hunting romantic adventure game that uses 3rd-person perspective for exploring places and diving underwater to collect treasure, with visual novel style 1st-person perspective during dialogues featuring anime characters over static backgrounds. On your adventure you will meet many girls who will be able to go and dive with you, and while the game starts on a single island, over time you'll be able to sail to other islands and explore other places. The game comes on two discs, where second disc contains various bonus content, such as character profiles, game artwork and other game trailers and previews.</p>"},{"name":"Hard Boiled","year":1997,"developer":"Cryo Interactive Entertainment","url":"psx-chd-roms-h/Hard%20Boiled%20%28Europe%29.chd","filesize":339813854,"score":"","genres":"Action > Behind view > Shooter > Direct control > Hovercraft > Cyberpunk / dark sci-fi","desc":"<p><em>Hard Boiled</em> is a mix of futuristic hovercar action with a traditional, albeit 3D, shoot em up genre. It looks somewhat similar in concept to New York Race based on The Fifth Element movie. The car is always on the move, and while you can speed up or slow down - you can't stop it and also you can't go back, only maneuver across the screen - just like in a typical shmup title. Your vehicle is armed with some basic projectile type guns and you could pick up other types of weapons floating around the levels.</p><p>The game story is based on the same name comic book by Frank Miller and Geof Darrow that was published in the early 90s. Here you play as Nixon who thinks he's a regular tax collector in dystopian retro-futuristic Los Angeles, but actually a cyborg-assassin for one of the big corporations that gets his memory reformatted once in a while. The gameplay is centered around riding your hovercar and shooting your way through the various city locales destroying all sorts of vehicles, turrets, barriers and occasional boss in the process. There are five missions in total with their own sets of enemy units and level design.</p>"},{"name":"HardBall 5","year":1996,"developer":"MindSpan","url":"psx-chd-roms-h/HardBall%205%20%28USA%29.chd","filesize":60370591,"score":7.3,"genres":"Simulation > Sports > Behind view > Diagonal-down > 2D scrolling > Licensed","desc":"<p><em>HardBall 5</em> is mainly an update to HardBall 4, with the additions coming in the form of adjustable difficulty settings, sharper graphics, more comments by Al Michaels and improved league play, which comes with a full set of 1994 major leaguers, plus a bonus legends league. The game includes multiplayer support for up to two players.</p>"},{"name":"HardBall 99","year":1998,"developer":"MindSpan","url":"psx-chd-roms-h/HardBall%20%2799%20%28USA%29.chd","filesize":127445723,"score":"","genres":"Sports > Behind view > Direct control > Baseball > Licensed","desc":"<p>AS REAL AS IT GETS<br>The All-Time Best Simulation of Baseball ALL NEW 3D GAMEPLAY featuring motion captured polygonal players and sizzling on-the-field action.<br>FULLY LICENSED with Major League Baseball™, and MLBPA™ giving you all of the 1998 teams and players.<br>CUSTOM LEAGUE & SCHEDULE GENERATOR sets the number of games played and division alignments.<br>EXTENSIVE STAT TRACKING in over 100 categories for single game, full season, and entire careers.<br>DEEPEST SIMULATION featuring minor league system, free-agents, active and disabled lists.<br>ALL 30 MAJOR LEAGUE STADIUMS including Arizona and Tampa Bay.</p>"},{"name":"Harmful Park","year":1997,"developer":"Sky Think Systems Co. Ltd.","url":"psx-chd-roms-h/Harmful%20Park%20%28Japan%29.chd","filesize":147643319,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter","desc":"<p>A side-scrolling \"cute'em up\", Harmful Park puts you in the shoes of the two daughters of a well-meaning inventor that sends her daughters in weapon-loaded, flying hoverbikes to retake the \"Heartful Park\" which has been taken over by one of its creators and has turned all of its attractions into mechanical beasts.</p><p>As mentioned, the game uses a cute graphic design with colorful 2D artwork, gameplay involves shooting your way past 6 stages themed as park attractions. You have at your disposal 4 different weapons selectable at any moment and which can be individually powered-up by collecting the right items. Additionally each weapon has its \"super\" attack which has a limited number of uses.</p><p>Features 2-player cooperative gameplay in the main game as well as three different competitive mini-games, such as a Pong clone (with the bikes replacing the paddles) a racing game and a four-player tank combat game.</p>"},{"name":"Harry Potter and the Chamber of Secrets","year":2002,"developer":"Argonaut Games PLC","url":"psx-chd-roms-h/Harry%20Potter%20and%20the%20Chamber%20of%20Secrets%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":429433419,"score":6.7,"genres":"Action > 3rd-person (Other) > Fantasy > Licensed","desc":"<p>From Argonaut, developers of the first Harry Potter game for PlayStation, comes the sequel, with mostly the same gameplay style and mechanics. To master his second year at magic school Hogwarts and discover the mystery behind the Chamber of Secrets, Harry must make his way through a 3D action adventure.</p><p>The game is more varied than its predecessor. In addition to platforming and maze sections, where magic must be used to fight monsters and solve puzzles, there are a variety of mini-games, like de-gnoming a garden by throwing gnomes over a fence or catching falling pipes thrown by a ghoul. There are also some unique action sequences, including traveling by floo powder, which entails sliding down a narrow path at high speed, or fleeing from the Hogwarts Express in a flying car. As in the first game, there are also Quidditch matches.</p><p>Another big part of the game are wizarding duels: these take the form of a best-of-three bout, where the two wizards zap each other with magic while trying to evade the other's spells until one duelist's health is down.</p><p>Also returning from the first game are collectible Every Flavour Beans and Famous Wizard Cards. The beans act as currency to buy cards, while the cards themselves are required to access certain duels.</p>"},{"name":"Harry Potter and the Sorcerer's Stone","year":2001,"developer":"Argonaut Games PLC","url":"psx-chd-roms-h/Harry%20Potter%20and%20the%20Sorcerer%27s%20Stone%20%28USA%29%20%28En%2CFr%2CEs%29.chd","filesize":399405239,"score":6.3,"genres":"Action > 3rd-person (Other) > Puzzle elements > Fantasy > Licensed","desc":"<p>One of several different games based on the first Harry Potter book and movie, the version for the PlayStation is a three-dimensional action adventure.</p><p>To complete his first year of studies at Hogwarts School of Witchcraft and Wizardry and foil the evil Lord Voldemort's plans, Harry must complete a number of challenges. These include platform sequences, made easy because Harry jumps automatically when reaching edges. There are combat scenes, where Harry has to knock out or drive back enemies. Some challenges require the player to solve puzzles. Harry can use five different spells, which have to be learned in class first. Successful completion of the tasks often results in house points for Harry's house Gryffindor; failure in some deducts points, so the race for the House Cup can stay open until the end.</p><p>There is also broomstick flying in the game, both in Quidditch matches, where Harry has to catch the Golden Snitch by flying through rings that it leaves behind, and on other occasions, like chasing Draco Malfoy and knocking him off his broom.</p><p>Exploring Hogwarts is often rewarding, as many optional challenges and secret rooms await, often with rewards like a special item or collectibles like Famous Wizard cards and Every Flavor Beans. The beans can be traded for passwords that open up more hidden areas.</p>"},{"name":"Harukaze Sentai V-Force (Disc 1)","year":1996,"developer":"Ving Co., Ltd.","url":"psx-chd-roms-h/Harukaze%20Sentai%20V-Force%20%28Japan%29%20%28Disc%201%29.chd","filesize":458528981,"score":"","genres":"Strategy > Diagonal-down > 2D scrolling > Isometric > Anime / Manga > Turn-based > Point and select > Sci-fi / futuristic","desc":"<p>Long ago, civilization flourished on Venus. The environmental protection agency Goa Del maintained the planet. However, in the name of self-defense, Goa Del began to develop weaponry against the wishes of the house of lords, El Doral, and eventually war broke out between the two groups. The queen of El Doral sent her young daughter Rabis on a shuttle to Earth, but in an attack, the shuttle was separated from the convoy and made an emergency landing on the moon. In a last-ditch effort, El Doral brought the way to an end with the \"organic weapon\" HN-01, and the defeated Goa Del fled into the reaches of space.</p><p>Two thousand years later, the descendants of Goa Del, now calling themselves the Baskille Empire, are rapidly expanding their power. One day, a bright light appears near Venus, and the Baskille Empire has appeared, returning to take back their planet. And now, three sisters living on Earth, distant descendants of El Doral, have gotten caught up in the fight.</p><p><em>Harukaze Sentai V-Force</em> is an isometric strategy RPG similar to Front Mission or Super Robot Taisen. The game follows Natsuki, Mizuki, and Kagetsu, three sisters who are pilots in the Earth Defense Force. Each mission allows you to configure your character's weaponry, and as they fight, they will gain experience and level up. Before and after each mission, fully-animated cutscenes drive the plot forward, and sometimes they will appear at crucial points during a mission as well.</p>"},{"name":"Harukaze Sentai V-Force (Disc 2)","year":1996,"developer":"Ving Co., Ltd.","url":"psx-chd-roms-h/Harukaze%20Sentai%20V-Force%20%28Japan%29%20%28Disc%202%29.chd","filesize":448312982,"score":"","genres":"Strategy > Diagonal-down > 2D scrolling > Isometric > Anime / Manga > Turn-based > Point and select > Sci-fi / futuristic","desc":"<p>Long ago, civilization flourished on Venus. The environmental protection agency Goa Del maintained the planet. However, in the name of self-defense, Goa Del began to develop weaponry against the wishes of the house of lords, El Doral, and eventually war broke out between the two groups. The queen of El Doral sent her young daughter Rabis on a shuttle to Earth, but in an attack, the shuttle was separated from the convoy and made an emergency landing on the moon. In a last-ditch effort, El Doral brought the way to an end with the \"organic weapon\" HN-01, and the defeated Goa Del fled into the reaches of space.</p><p>Two thousand years later, the descendants of Goa Del, now calling themselves the Baskille Empire, are rapidly expanding their power. One day, a bright light appears near Venus, and the Baskille Empire has appeared, returning to take back their planet. And now, three sisters living on Earth, distant descendants of El Doral, have gotten caught up in the fight.</p><p><em>Harukaze Sentai V-Force</em> is an isometric strategy RPG similar to Front Mission or Super Robot Taisen. The game follows Natsuki, Mizuki, and Kagetsu, three sisters who are pilots in the Earth Defense Force. Each mission allows you to configure your character's weaponry, and as they fight, they will gain experience and level up. Before and after each mission, fully-animated cutscenes drive the plot forward, and sometimes they will appear at crucial points during a mission as well.</p>"},{"name":"Harukaze Sentai V-Force (Disc 3)","year":1996,"developer":"Ving Co., Ltd.","url":"psx-chd-roms-h/Harukaze%20Sentai%20V-Force%20%28Japan%29%20%28Disc%203%29.chd","filesize":479032226,"score":"","genres":"Strategy > Diagonal-down > 2D scrolling > Isometric > Anime / Manga > Turn-based > Point and select > Sci-fi / futuristic","desc":"<p>Long ago, civilization flourished on Venus. The environmental protection agency Goa Del maintained the planet. However, in the name of self-defense, Goa Del began to develop weaponry against the wishes of the house of lords, El Doral, and eventually war broke out between the two groups. The queen of El Doral sent her young daughter Rabis on a shuttle to Earth, but in an attack, the shuttle was separated from the convoy and made an emergency landing on the moon. In a last-ditch effort, El Doral brought the way to an end with the \"organic weapon\" HN-01, and the defeated Goa Del fled into the reaches of space.</p><p>Two thousand years later, the descendants of Goa Del, now calling themselves the Baskille Empire, are rapidly expanding their power. One day, a bright light appears near Venus, and the Baskille Empire has appeared, returning to take back their planet. And now, three sisters living on Earth, distant descendants of El Doral, have gotten caught up in the fight.</p><p><em>Harukaze Sentai V-Force</em> is an isometric strategy RPG similar to Front Mission or Super Robot Taisen. The game follows Natsuki, Mizuki, and Kagetsu, three sisters who are pilots in the Earth Defense Force. Each mission allows you to configure your character's weaponry, and as they fight, they will gain experience and level up. Before and after each mission, fully-animated cutscenes drive the plot forward, and sometimes they will appear at crucial points during a mission as well.</p>"},{"name":"Harvest Moon: Back to Nature","year":1999,"developer":"Victor Interactive Software, Inc.","url":"psx-chd-roms-h/Harvest%20Moon%20-%20Back%20to%20Nature%20%28Europe%29%20%28En%2CDe%29%20%28Rev%201%29.chd","filesize":81474311,"score":7.3,"genres":"Simulation > Diagonal-down > Isometric > Anime / Manga > Managerial / business simulation","desc":"<p>As a young boy, you visited your grandfather's farm one summer, which was one of the best there was. Now, some years later, your grandfather has passed away and you inherited his farm, which is now in a state of disrepair. The Mayor of the village has given you three years to turn things around, and bring the farm back to a state that your grandfather would be proud of. At the same time, you must also think about dating and getting married to secure a place in the village. Roll up your sleeves and get ready to get dirty, because that farm needs help and you're the only one who can make it the best farm anyone's seen.</p>"},{"name":"HBO Boxing","year":2000,"developer":"Osiris Software Design Studios, Inc.","url":"psx-chd-roms-h/HBO%20Boxing%20%28Europe%29%20%28En%2CDe%29.chd","filesize":259387114,"score":5.6,"genres":"Sports > Side view > 2D scrolling > Boxing > Licensed","desc":"<p><em>HBO Boxing</em> is a standard boxing game with the Home Box Office (HBO) license, known for their boxing broadcasts and events and over 35 real-life legendary fighters including Sugar Ray Robinson, George Foreman, Rocky Marciano, Hector \"Macho\" Camacho, Roy Jones Jr. among many others.</p><p>The standard modes apply such as <em>Exhibition</em>, <em>Career</em>, <em>Tournament</em> as well as a <em>Quickbout</em> which lets a player go into a quick match with the computer selecting the boxers, arenas, etc. Players can also create their own boxer with a variety of stats including speed, stamina, etc. along with the sex of the fighter. Using this fighter, the player can fight their way through the ranks of professional boxing from local arenas to big time Pay-Per-View events.</p><p>Jim Lampley, Larry Merchant, and Harold Lederman also lend their voice talents for in-game commentary.</p>"},{"name":"Heart of Darkness (Disc 1)","year":1998,"developer":"Amazing Studio","url":"psx-chd-roms-h/Heart%20of%20Darkness%20%28Europe%29%20%28Disc%201%29.chd","filesize":335766307,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>Andy is a child who likes playing with his dog Whiskey, doesn't particularly enjoy going to school, and has a knack for inventing complicated gadgets. One day Andy and Whiskey are strolling through the park, when suddenly a solar eclipse darkens the sky, and after a moment Andy realizes that his dog has been taken away. But science can solve everything, and Andy heads to his treehouse, which is home to his outstanding inventions, including a spaceship! If you thought it was just a toy, you thought wrong, because Andy boards the ship and pilots it into the heart of the Darklands, a world controlled by the evil Master of Darkness. Andy takes out his gun (another splendid invention of his) and prepares to fight the evil sorcerer's minions. Nothing will stop the boy from rescuing his beloved dog!</p><p><em>Heart of Darkness</em> is a cinematic 2D platformer designed by  Eric Chahi, the creator of one of the genre's progenitors,  Another World. Though the game has many fast and furious action sequences, including shooting hordes of dark creatures, it is built like a series of tasks, each requiring different approaches, from arcade-style shooting or jumping to interacting with the environment and solving puzzles. Like its spiritual predecessor, the game is linear; completing a section usually takes Andy to a different location, where another task awaits him.</p><p>Andy has several guns at his disposal, though in certain locations he will lose his weapons and will rely on the player's wit or quick reaction to survive. Andy will also gain magical energy, which can be used to grow or destroy trees. Similarly to <em>Another World</em>, many hazards are placed on the hero's path; despite the child-oriented premise, the game contains graphically explicit death scenes, which occur if the player is not careful or quick enough to save Andy from a gruesome demise.</p><p><em>Heart of Darkness</em> features orchestral music and pre-rendered animated cutscenes. It comes with a pair of 3D glasses, which allow the player to view certain scenes in the game in 3D.</p>"},{"name":"Heart of Darkness (Disc 2)","year":1998,"developer":"Amazing Studio","url":"psx-chd-roms-h/Heart%20of%20Darkness%20%28Europe%29%20%28Disc%202%29.chd","filesize":401987660,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>Andy is a child who likes playing with his dog Whiskey, doesn't particularly enjoy going to school, and has a knack for inventing complicated gadgets. One day Andy and Whiskey are strolling through the park, when suddenly a solar eclipse darkens the sky, and after a moment Andy realizes that his dog has been taken away. But science can solve everything, and Andy heads to his treehouse, which is home to his outstanding inventions, including a spaceship! If you thought it was just a toy, you thought wrong, because Andy boards the ship and pilots it into the heart of the Darklands, a world controlled by the evil Master of Darkness. Andy takes out his gun (another splendid invention of his) and prepares to fight the evil sorcerer's minions. Nothing will stop the boy from rescuing his beloved dog!</p><p><em>Heart of Darkness</em> is a cinematic 2D platformer designed by  Eric Chahi, the creator of one of the genre's progenitors,  Another World. Though the game has many fast and furious action sequences, including shooting hordes of dark creatures, it is built like a series of tasks, each requiring different approaches, from arcade-style shooting or jumping to interacting with the environment and solving puzzles. Like its spiritual predecessor, the game is linear; completing a section usually takes Andy to a different location, where another task awaits him.</p><p>Andy has several guns at his disposal, though in certain locations he will lose his weapons and will rely on the player's wit or quick reaction to survive. Andy will also gain magical energy, which can be used to grow or destroy trees. Similarly to <em>Another World</em>, many hazards are placed on the hero's path; despite the child-oriented premise, the game contains graphically explicit death scenes, which occur if the player is not careful or quick enough to save Andy from a gruesome demise.</p><p><em>Heart of Darkness</em> features orchestral music and pre-rendered animated cutscenes. It comes with a pair of 3D glasses, which allow the player to view certain scenes in the game in 3D.</p>"},{"name":"Hebereke's Popoitto","year":1996,"developer":"Success Corp.","url":"psx-chd-roms-h/Hebereke%20Station%20Popoitto%20%28Japan%29.chd","filesize":253814843,"score":6.4,"genres":"Puzzle > Anime / Manga > Real-time > Falling block puzzle","desc":"<p><em>Hebereke's Popoitto</em> is a Tetris variant. The goal in each level is to remove the blocks already on the playfield, representing characters from the franchise. Other blocks fall down from the top of the screen and have to be steered to the right place before touching the ground or another block. When four or more of the same blocks are together, they vanish. The catch of this variant is that the blocks which have to be removed move over the playfield. The player takes the role of the penguin Hebereke who wants to win a tournament against his friends.</p>"},{"name":"Heir of Zendor: The Legend and The Land","year":1996,"developer":"Micronet Co. Ltd."},{"name":"Hellboy: Dogs of the Night","year":2003,"developer":"Cryo Studios North America"},{"name":"Hellnight","year":1998,"developer":"Dennou Eizo Seisakusho Ltd.","url":"psx-chd-roms-h/Hellnight%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":380589713,"score":"","genres":"Action > Adventure > 1st-person > Survival horror > Sci-fi / futuristic","desc":"<p>The future Tokyo is a megapolis built on top of a huge system of underground tunnels and sewers. A rumor is heard that in this underground world hide the followers of a mysterious cult, known as the Dark Messiah. At the same time a symbiotic life form escapes from scientists and makes it's way into the sewer system. There it causes the crash of a subway train and starts devouring the passengers on board. A lone hero, along with a schoolgirl Naomi Sugiura are the only survivors of the crash.... and must flee from the creature in order to survive.</p><p><em>Hellnight</em> is a survival horror game at heart, although it has no combat gameplay. Controlling the nameless hero, the player must travel through the underground and protect Naomi. There is only one monster in the whole game, the \"creature\" itself, which is invulnerable and cannot be killed. Instead players are constantly on the run from it, making sure it does not catch them. The game is divided into large maze-like levels, each one usually populated by the creature who keeps pursuing the player (although he does change form after each level). At certain points there will be companions who can attack the monster and temporarily stun him. There are also people to talk to in the underground world, items to pick up, and puzzles to solve.</p>"},{"name":"Hello Kitty: Bowling","year":2001,"developer":"Tamsoft Corporation"},{"name":"Hello Kitty: Illust Puzzle","year":2001,"developer":"Tamsoft Corporation"},{"name":"Hello Kitty's Cube Frenzy","year":1998,"developer":"Culture Publishers Company"},{"name":"Help Charity Compilation","year":1996,"developer":""},{"name":"Herc's Adventures","year":1997,"developer":"LucasArts Entertainment Company LLC","url":"psx-chd-roms-h/Herc%27s%20Adventures%20%28Europe%29.chd","filesize":146932259,"score":7.5,"genres":"Action > Top-down","desc":"<p>Ahhh...ancient Greece. A fertile land, full of wine, women, and some of the best gyros you'll ever taste. Thanks to Persephone, the Greek goddess of spring and fertility, Greece is a wonderful paradise. But now the lord of the Underworld, Hades, has gone and kidnapped Persephone, causing the land to slowly wither away! Zeus, the King of the Gods, needs help in saving her, so who do you call? None other than three of the greatest warriors in the land!</p><p>You can choose from the big 'n' buff Herc, the super swift Atlanta, or the young and street-smart Jason, each of whom have their own weapons and strengths. The game's 40 levels include many further variations and pastiches of Greek mythology and legend.</p><p>It's all up to you to rescue Persephone and give Hades a beatdown he'll never forget!</p>"},{"name":"Herkules","year":2003,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-h/Herkules%20%28Europe%29%20%28En%2CDe%29.chd","filesize":405977171,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Meditative / Zen > Cards / tiles > Direct control > Classical antiquity","desc":"<p>Aimed at children, <em>Herkules</em> is a minigame-focused release. The game features a 45-minute animated movie, which features voice acting and forms the basis for the art used in the minigames. There is a colouring book, where you can select from six illustrations and a smorgasbord of colour to bring the scene to life. Sliding tile puzzles have the player recreate a scrambled picture by moving the pieces around.</p><p>The PlayStation 2 version of the game was released as <em>legend of Herkules</em> and added two additional minigames not present in the original PlayStation game. Jigsaw puzzle is a self-explanatory event with three sizes of difficulty available. And of course, the card game memory match, which also has multiple levels of difficulty.</p>"},{"name":"Hermie Hopperhead: Scrap Panic","year":1995,"developer":"Yuke's Co. Ltd.","url":"psx-chd-roms-h/Hermie%20Hopperhead%20-%20Scrap%20Panic%20%28Japan%29.chd","filesize":259518074,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Hermie Hopperhead: Scrap Panic</em> is a 2D platformer that takes inspiration from the classic  Sonic and Mario games. Hermie Hopperhead is a young city kid with weird-looking red hair that sticks out in all directions. While waiting for his girlfriend, Trish, he happens to spot an egg with arms and legs come leaping out of a nearby garbage can. The bipedal egg coaxes him to come with it, and Hermie is lead into another world called Egg World. The world's resident villain, Mad Migo, is trying to take over this world of innocent egg people. What's worse, the evil Migo has taken Hermie's girlfriend, Trish, hostage. It is now up to Hermie to put a stop to Mad Migo's plans and rescue his girlfriend.</p><p>The gameplay is very similar to that of Mario games: enemies are usually defeated by jumping over them. A notable feature is the assistance of the inhabitants of the Egg world. Some of them follow the protagonist around and may turn into platforms and other things to help his progress.</p>"},{"name":"Heroine Dream","year":1996,"developer":"Map Japan Co., Ltd.","url":"psx-chd-roms-h/Heroine%20Dream%20%28Japan%29.chd","filesize":245928156,"score":"","genres":"Simulation > Strategy > 1st-person > Anime / Manga","desc":"<p><em>Heroine Dream</em> is an idol simulation game in which the player takes a role of a producer whose goal is to help Shizuka Maiki enter the scene in style. But that doesn't happen over night, in fact, it requires many weeks of training. The heroine herself has many attributes that lack in quality and as her producer, you will have to balance her training (ballet, dancing, swimming etc.), but at the same time keep an eye on her stress level. The game features voice-acting, but without the ability to see subtitles, only the answers you can select during conversations with other characters. Depending on what kind of a star producer you turn out to be, the game may reach one of several different endings.</p>"},{"name":"Heroine Dream 2","year":1998,"developer":"Map Japan Co., Ltd.","url":"psx-chd-roms-h/Heroine%20Dream%202%20%28Japan%29.chd","filesize":447913339,"score":"","genres":"Simulation > Strategy > 1st-person > Anime / Manga > Managerial / business simulation","desc":"<p>Heroine Dream 2 is the sequel to the heroine management sim, Heroine Dream! Raise Shizuka Gozen to become the newest heroine!Enjoy the same fun character development and wide variety of in-game events, now with better graphics and gameplay. Are you ready to build the next great legendary heroine?</p>"},{"name":"Hexen: Beyond Heretic","year":1997,"developer":"Raven Software Corporation","url":"psx-chd-roms-h/Hexen%20-%20Beyond%20Heretic%20%28Japan%29.chd","filesize":346058850,"score":7.4,"genres":"Action > 1st-person > Shooter > Direct control > Fantasy","desc":"<p><em>Hexen</em> is the sequel to Heretic. While the Heretic was destroying D'Sparil, the other two Serpent Riders have come to your dimension and slaughtered everyone. Or so they thought. Three humans have managed to escape with their lives and now seek vengeance against the Serpent Rider Korax who remains in their world.</p><p>Like <em>Heretic</em>, <em>Hexen</em> is a fantasy game based on an enhanced DOOM engine. All of <em>Heretic</em>'s innovations like vertical looking, flying, and the inventory system have been carried over. The new major changes this time around are three characters for the player to choose from and the level hub system. The characters are the Fighter, the Cleric, and the Mage. Each one has four unique weapons and different levels of speed and armor.</p><p>The hub system steps away from the traditional \"single levels stringed along into episodes\" system which had been carried over into the FPS genre from sidescrollers and made popular by Wolfenstein 3D. In <em>Hexen</em>'s hub system each episode is still made up of interconnected levels, but most of the levels are connected to a single \"hub\" level through portals. There are also portals between some of the \"spoke\" levels. Many of the puzzles in <em>Hexen</em> require travel back and forth between different levels.</p><p>Other innovations in <em>Hexen</em> include weather effects, jumping, earth-quakes, and destructible objects such as trees and vases. The game also includes scripted sequences created with a language called ACS, allowing for much more complex puzzles and dramatic scenes.</p>"},{"name":"Hi-Octane","year":1995,"developer":"Bullfrog Productions, Ltd.","url":"psx-chd-roms-h/Hi-Octane%20%28Japan%29.chd","filesize":205443093,"score":7,"genres":"Racing / Driving > 1st-person > Behind view > Shooter > Hovercraft > Sci-fi / futuristic","desc":"<p>A futuristic racing game with hover cars, in the same line as Wipeout, using a modified version of the Magic Carpet 2 engine.</p><p>Gameplay takes a straightforward approach, with the directional keys controlling the steering and throttle, and three keys to fire the minigun, missiles or charge the booster. While the minigun has unlimited ammo, both fuel, armour and missiles must be replenished by passing through some marked areas or picking up powerups in the track or by left destroyed opponents. While the vehicles float on the track they are still influenced by the ground material: they slow down on dirt and even more on water. Each track has a number of shortcuts or alternate routes that offer powerups, and some tracks feature gates and ramps that open or close randomly.</p><p>Includes 9 tracks and several game modes (for Saturn owners and PC players with the 1.2 patch installed) such as single race mode (with option to change the number of laps), a Championship mode, Split Screen, Clone Race (beating the ghost of the best race time), Death Match (Where instead of finishing first what matters is finish alive and with the most kills) and Hot Seat, where up to eight players can compete in the same race by taking turns, with the computer taking control of the players' vehicles waiting for their turn. There are six hover cars to choose from: the fast Flexiwing and Outrider, the balanced KD-1 Speeder and Vampyr and the slow but armed to the teeth Berserker and Jugga. In addition to the natural capacity of each, their Minigun, Missle and Booster capacities can be upgraded by picking up powerups during the race. There are Eight teams to choose from, which change the colour of the vehicle: Mad Medicine (white), Bullfrog (aqua green), Storm Riders (purple), Fire Phreaks (orange), DethFest (blue), Foo Fighters (yellow), Gorehounds (red) and Assassins Anonymous (black).</p>"},{"name":"Hidden & Dangerous","year":2001,"developer":"Illusion Softworks, a.s.","url":"psx-chd-roms-h/Hidden%20%26%20Dangerous%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":47334133,"score":6.9,"genres":"Action > Strategy > 1st-person > 3rd-person (Other) > World War II > War","desc":"<p>In <em>Hidden &amp; Dangerous</em>, the player is in charge of four Allied commandos in operations during World War II. One of them in controlled directly in first-person perspective and the others in a tactics mode. The campaign is divided into many episodes, and each episode into missions. These vary from bomb planting to hostage rescue. It is also possible to drive tanks and other vehicles.</p>"},{"name":"High Heat Baseball 2000","year":1999,"developer":"Team .366","url":"psx-chd-roms-h/High%20Heat%20Baseball%202000%20%28USA%29.chd","filesize":161190266,"score":7,"genres":"Simulation > Sports > 3rd-person (Other) > Managerial / business simulation > Baseball > Licensed","desc":"<p><em>High Heat Baseball 2000</em> is a baseball game which focuses on the simulation aspect. In comparison to its predecessor High Heat Baseball it now has an official license for the 1998 MLB season and uses a 3D graphic engine.</p><p>Playing modes include exhibition matches, season (in varying lengths) , home run derby, play-off and a career mode over multiple seasons. In the season and league mode there is even a managerial option available in which the player doesn't play the games himself but constrains himself on tactics and team development.</p><p>The player can customize a big part of the rule set. The player editor allows to change attributes and appearance. With automatic functions for situations like defensive alignment or throwing the player can delegate unwanted tasks to the computer.</p>"},{"name":"High Heat Major League Baseball 2002","year":2001,"developer":"The 3DO Company","url":"psx-chd-roms-h/High%20Heat%20Major%20League%20Baseball%202002%20%28USA%29.chd","filesize":117931966,"score":7.5,"genres":"Sports > Baseball > Licensed","desc":"<p>High Heat 2002 is the 3rd game in the \"High Heat\" series. Gone from the previous two games is the Sammy Sosa title. Like the previous games HH2002 is a total baseball simulator. You can set back and just manage your team or you can get right on the field and play each game. You can configure the game in many different formats. </p><p><strong>You can:</strong>  </p><p>Lengthen or Shorten a season  </p><p>Create new teams  </p><p>Re-arrange the divisons  </p><p>move players from different teams before the game starts  </p><p>Change team settings  </p><p>Create custom made players  </p><p>...and generally do just about anything you want  </p><p>From the swing of the bat to making blockbuster trades you have all the controls.</p>"},{"name":"High School of Blitz","year":1999,"developer":"Japan Media Programming Inc.","url":"psx-chd-roms-h/High%20School%20of%20Blitz%20%28Japan%29.chd","filesize":194744902,"score":"","genres":"Adventure > Puzzle > 1st-person > Anime / Manga > Cards / tiles > Trading / collectible card > Visual novel > Contemporary > Fantasy > Comedy > Romance","desc":"<p>High School of Blitz is set in a contemporary high school setting with a twist— it's populated by a large variety of mythical creatures &amp; entities. You, the player, are the teacher of this school, and you are tasked with challenging other high schools to good old-fashioned card games. The story segments are told in the visual novel format.</p><p>There are over 170 unique cards to be found in the game, with artwork contributed from more than 40 illustrators.</p>"},{"name":"High School! Kimengumi: The Table Hockey","year":2001,"developer":"Break"},{"name":"Hikari no Shima: Seven Lithographs in Shining Island","year":1999,"developer":"Affect Co.,Ltd"},{"name":"Himiko-den: Renge (Disc 1)","year":1999,"developer":"Chime Corporation","url":"psx-chd-roms-h/Himiko-den%20-%20Renge%20%28Japan%29%20%28Disc%201%29.chd","filesize":308779797,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>Masahiko Kutani and Himiko Himejima are two teenagers living in modern-day Japan. One day, Himiko discovers a strange amulet. An immense power is unleashed from it, engulfing Kutani and teleporting him into another world. The young man finds himself in the ancient kingdom of Yamatai, where Himiko's \"alter ego\" is a divine queen. The queen election is just being held in Yamatai; but the evil general of the Kune empire sends his forces to conquer Yamatai and disrupt the ritual. Kutani has no choice but to offer his services to the kingdom, hoping to find a way to return to our world...</p><p><em>Himiko-den</em> is a strategy game with RPG elements. Kutani and other heroes are navigated on the \"world map\" in a linear fashion; selecting a location icon usually leads to a large-scale strategic battle between armies. The player has to position the troops and navigate them on the battle field.</p><p>Once a player-controlled and an enemy unit come into contact, a turn-based battle initiates. These battles are similar in style to those of \"regular\" RPGs, with small parties of characters exchanging attacks until one of them emerges victorious.</p><p>Cut-scenes advance the story between the battles; some of them are animated movies, while others are composed of still anime-style pictures. The battles are done in real-time 3D.</p>"},{"name":"Himiko-den: Renge (Disc 2)","year":1999,"developer":"Chime Corporation","url":"psx-chd-roms-h/Himiko-den%20-%20Renge%20%28Japan%29%20%28Disc%202%29.chd","filesize":448520071,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>Masahiko Kutani and Himiko Himejima are two teenagers living in modern-day Japan. One day, Himiko discovers a strange amulet. An immense power is unleashed from it, engulfing Kutani and teleporting him into another world. The young man finds himself in the ancient kingdom of Yamatai, where Himiko's \"alter ego\" is a divine queen. The queen election is just being held in Yamatai; but the evil general of the Kune empire sends his forces to conquer Yamatai and disrupt the ritual. Kutani has no choice but to offer his services to the kingdom, hoping to find a way to return to our world...</p><p><em>Himiko-den</em> is a strategy game with RPG elements. Kutani and other heroes are navigated on the \"world map\" in a linear fashion; selecting a location icon usually leads to a large-scale strategic battle between armies. The player has to position the troops and navigate them on the battle field.</p><p>Once a player-controlled and an enemy unit come into contact, a turn-based battle initiates. These battles are similar in style to those of \"regular\" RPGs, with small parties of characters exchanging attacks until one of them emerges victorious.</p><p>Cut-scenes advance the story between the battles; some of them are animated movies, while others are composed of still anime-style pictures. The battles are done in real-time 3D.</p>"},{"name":"Himiko-den: Renge (Disc 3)","year":1999,"developer":"Chime Corporation","url":"psx-chd-roms-h/Himiko-den%20-%20Renge%20%28Japan%29%20%28Disc%203%29.chd","filesize":462761516,"score":"","genres":"Role-playing (RPG) > Strategy > Diagonal-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>Masahiko Kutani and Himiko Himejima are two teenagers living in modern-day Japan. One day, Himiko discovers a strange amulet. An immense power is unleashed from it, engulfing Kutani and teleporting him into another world. The young man finds himself in the ancient kingdom of Yamatai, where Himiko's \"alter ego\" is a divine queen. The queen election is just being held in Yamatai; but the evil general of the Kune empire sends his forces to conquer Yamatai and disrupt the ritual. Kutani has no choice but to offer his services to the kingdom, hoping to find a way to return to our world...</p><p><em>Himiko-den</em> is a strategy game with RPG elements. Kutani and other heroes are navigated on the \"world map\" in a linear fashion; selecting a location icon usually leads to a large-scale strategic battle between armies. The player has to position the troops and navigate them on the battle field.</p><p>Once a player-controlled and an enemy unit come into contact, a turn-based battle initiates. These battles are similar in style to those of \"regular\" RPGs, with small parties of characters exchanging attacks until one of them emerges victorious.</p><p>Cut-scenes advance the story between the battles; some of them are animated movies, while others are composed of still anime-style pictures. The battles are done in real-time 3D.</p>"},{"name":"Hissatsu Pachinko Station Monster House Special","year":1998,"developer":"","url":"psx-chd-roms-h/Hissatsu%20Pachinko%20Station%20-%20Monster%20House%20Special%20%28Japan%29.chd","filesize":180913113,"score":"","genres":"Gambling","desc":"<p><em>Hissatsu Pachinko Station Monster House Special</em> is a single player pachinko simulation.</p><p>Pachinko is played in gaming halls called parlors and it is sometimes referred to as the number one pastime in Japan. Gambling for money is illegal in Japan so players purchase steel balls with which they play the game. At the end of their session they exchange their remaining balls for tokens which, in turn, can be exchanged for goods / prizes.</p>"},{"name":"Hissatsu Pachinko Station Now 3","year":2000,"developer":"","url":"psx-chd-roms-h/Hissatsu%20Pachinko%20Station%20Now%203%20-%20Youkai%20Engei%20%28Japan%29.chd","filesize":8338210,"score":"","genres":"Gambling","desc":"<p><em>Hissatsu Pachinko Station Now 3</em> is the third in a series of pachinko games from Japan. </p><p>Pachinko is sometimes referred to as the number one pastime in Japan, and it is played in gaming halls called parlors. Gambling for money is illegal in Japan so players purchase steel balls with which they play the game. At the end of their session they exchange their remaining balls for tokens which, in turn, can be exchanged for goods / prizes.</p>"},{"name":"Hive, The (Disc 1)","year":1997,"developer":"Rainbow America","url":"psx-chd-roms-h/Hive%2C%20The%20%28USA%29%20%28Disc%201%29.chd","filesize":428323194,"score":6.1,"genres":"Action > 3rd-person (Other) > Video backdrop > Arcade > Rail shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>The Hive</em> is an on-rails shooter similar to Rebel Assault within a sci-fi setting. All levels are pre-rendered, the player controls the cross-hair to fire at enemy ships and turrets. The levels are connected with cutscenes using the same visual style of the actual levels. The shooting happens both in space, within the atmosphere of different planets, and even indoors. Control alternates between spacecraft, turrets, ground based vehicles and on foot. In some cases such as when controlling a turret the player has camera control.</p>"},{"name":"Hive, The (Disc 2)","year":1997,"developer":"Rainbow America","url":"psx-chd-roms-h/Hive%2C%20The%20%28USA%29%20%28Disc%202%29.chd","filesize":387219746,"score":6.1,"genres":"Action > 3rd-person (Other) > Video backdrop > Arcade > Rail shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>The Hive</em> is an on-rails shooter similar to Rebel Assault within a sci-fi setting. All levels are pre-rendered, the player controls the cross-hair to fire at enemy ships and turrets. The levels are connected with cutscenes using the same visual style of the actual levels. The shooting happens both in space, within the atmosphere of different planets, and even indoors. Control alternates between spacecraft, turrets, ground based vehicles and on foot. In some cases such as when controlling a turret the player has camera control.</p>"},{"name":"Hogs of War","year":2000,"developer":"Infogrames Studios Limited","url":"psx-chd-roms-h/Hogs%20of%20War%20%28Europe%29.chd","filesize":238459761,"score":7.1,"genres":"Strategy > Behind view > Turn-based > Artillery > War","desc":"<p>Command a regiment of hogs through different battlefields - all with the same mission: eliminate the enemy. Gameplay is comparable to the Worms games, but <em>Hogs Of War</em> comes completely in 3D. There are many different types of weapons to choose from, as well as the possibility to assign special jobs such as sniper, medic, etc. to the hogs.</p>"},{"name":"Hokuto no Ken","year":1996,"developer":"Natsume Co., Ltd."},{"name":"Hokuto no Ken: Seikimatsu Kyuseisyu Densetsu","year":2000,"developer":"Natsume Co., Ltd.","url":"psx-chd-roms-h/Hokuto%20no%20Ken%20-%20Seikimatsu%20Kyuuseishu%20Densetsu%20%28Japan%29.chd","filesize":315803589,"score":"","genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Beat 'em up / brawler > Fighting > Post-apocalyptic > Martial arts","desc":"<p>3D beat 'em up game that follows the storyline of the first series of the anime.Playing as Kenshiro, you will travel trough deserts, cities, and the other anime's places facing hordes of baddies with the deadly Hokuto martial arts. Sometimes against some enemies the action freezes and the player is required to press a certain combination of buttons in order to perform a special technique and kill the antagonist. The action is divided in levels, divided in many sub-chapters. At the end of each level the player is allowed to save the progresses achieved on the memory card.The game is pretty gory and fast paced. It also follows very closely the anime's storyline and uses long cutscenes (done with the game engine) to describe the plot developments.A 2 player versus mode with all the main anime characters is available after beating the single player game.</p>"},{"name":"Hōma Hunter Lime: Special Collection Vol. 1","year":1994,"developer":"Copya System Ltd."},{"name":"Hōma Hunter Lime: Special Collection Vol. 2","year":1995,"developer":"Copya System Ltd."},{"name":"Honoo no Ryōrinin: Cooking Fighter Hao","year":1998,"developer":"Nippon Ichi Software, Inc."},{"name":"Hooters: Road Trip","year":2002,"developer":"Miracle Designs","url":"psx-chd-roms-h/Hooters%20Road%20Trip%20%28USA%29.chd","filesize":173150673,"score":4.4,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing > Licensed","desc":"<p>In <em>Hooters Road Trip</em>, the player takes control of a muscle car, competing in races and different skill tests sponsored by Hooters Restaurants, a popular food and bar franchise in the U.S. that employs well-endowed women, in locations such as California and Florida. The gameplay mostly consisted of racing against computer opponents while avoiding oncoming traffic, such as other cars and semi-trucks. </p><p>The winner of these races will get to meet a real Hooters Girl (video wise of course), chosen for the game for each state they actually live (i.e., if they player wins a race in Florida, the player will get to see a Hooters Girl from a restaurant in Florida). There are 12 different cars to choose from, some of which need to be unlocked by winning certain races. Players can also race against each other in two-player action while the graphics are reminiscent of Destruction Derby.</p>"},{"name":"Hoshigami: Ruining Blue Earth","year":2001,"developer":"MaxFive","url":"psx-chd-roms-h/Hoshigami%20-%20Ruining%20Blue%20Earth%20%28USA%29.chd","filesize":154928647,"score":6.2,"genres":"Role-playing (RPG) > Strategy > Isometric","desc":"<p>A fantasy tactical RPG set in a 3D world. The storyline will take you through 40 missions on the continent of Mardias. Command Fazz the hero and his band of mercenaries as they try to stop the Valaimian Empire from conquering Mardias and taking the Hoshigami.     Innovative gameplay system involves several systems. The devotion system in which you worship one of six elemental spirits. The coinfeigm system in which you collect coins that have magical properties and then raise their levels. The rap (ready for action point) system which allows you to move, fight and cast spells, but be careful the actions you take will affect you later. <br>    A tutorial if given to help you with the complex story driven battles as well as the history and current events.</p>"},{"name":"Hot Shot","year":2003,"developer":"Na.p.s. Team s.n.c.","url":"psx-chd-roms-h/Hot%20Shot%20%28Europe%29.chd","filesize":19341049,"score":"","genres":"Action > Behind view > Arcade > Shooter > Crime","desc":"<p><em>Hot Shot</em> is a single player 3D shooter game played from a third person. Dangerous prisoners have broken out of prison and have made themselves a home in an abandoned military complex. It’s now up to the player to gun them down. The game is very similar to the PS1 game Wanted from 2004.</p><p>The game offers several missions in which prisoners appear in the windows of building. The player starts the game with three lives and has the ability to doge enemy fire. As the player progresses he can pick up better guns and use these till they are empty and points boxes for the Hi score.</p>"},{"name":"Hot Shots Golf","year":1997,"developer":"Camelot Software Planning","url":"psx-chd-roms-h/Hot%20Shots%20Golf%20%28USA%29.chd","filesize":145880603,"score":7.9,"genres":"Sports > 3rd-person (Other) > Behind view > Free-roaming camera > Anime / Manga > Golf","desc":"<p>Fun cartoonish golf game. Features attractive graphics and is easy to pick up and play for both novices and pros. Choose from a variety of modes including training, stroke play, match play, tournament and vs modes. Plus some miniature golf as well! Features a plethora of characters including some hidden ones. You earn experience points for your character after every round. Each character has different strength and weaknesses. Includes 4 courses and a free moving game camera.</p>"},{"name":"Hot Shots Golf 2","year":1999,"developer":"Clap Hanz Ltd.","url":"psx-chd-roms-h/Hot%20Shots%20Golf%202%20%28USA%29.chd","filesize":148255382,"score":7.7,"genres":"Sports > 3rd-person (Other) > Golf","desc":"<p><em>Hot Shots Golf 2</em> is the sequel to PlayStation game Hot Shots Golf. While the sequel is in many respects similar to the original, it brings some improvements to the series. </p><p>Like the original there are several characters to choose from, and many more to be unlocked throughout the game. Each character has his or her own strengths and weaknesses, making character selection more than just choosing a skin. The character models themselves are of a more realistic style this time around, as opposed to the big-head anime style of the original <em>Hot Shots Golf</em>.</p><p>There are several different modes of play, from standards like stroke, match, and tournament, to the 'vs. mode', through which new characters can be unlocked. Gameplay itself is a version of the standard 'tap-tap-tap' variety used by the majority of golf games.</p>"},{"name":"Hot Wheels: Extreme Racing","year":2001,"developer":"Atod AB","url":"psx-chd-roms-h/Hot%20Wheels%20-%20Extreme%20Racing%20%28Europe%29.chd","filesize":412931418,"score":6.1,"genres":"Action > Racing / Driving > 1st-person > 3rd-person (Other) > Arcade > Licensed","desc":"<p>Based on the Hot Wheels toy car collection, this racing game takes you on a wild ride though various, rather filthy, environments, fighting opponents to finish first in each race.</p><p>The basic gameplay is similar to most racing games. The player controls a car and races around tracks as fast as possible. By collecting pick-ups new properties can be obtained, such as nitro boosts, oil slicks, projectiles and other weapons. The computer-controlled cars can also collect the pick-ups and use them.</p><p>Cars have the ability to transform into four different types of vehicles: racing, truck, plane and boat. While transforming the body of the car stays the same while the side of the car \"grows\" wheels, wings or fins. The stages are divided into different parts, each designed for a specific vehicle. The parts are separated by a \"transformation portal\". When the player drives though such a portal the car will change into another type.</p>"},{"name":"Hot Wheels: Turbo Racing","year":1999,"developer":"Stormfront Studios","url":"psx-chd-roms-h/Hot%20Wheels%20-%20Turbo%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":440054089,"score":6.7,"genres":"Racing / Driving > 1st-person > Behind view > Licensed","desc":"<p>In <em>Hot Wheels: Turbo Racing</em> you can race over 40 classic Hot Wheels cars, some looking sporty and some not. Race through 11 tracks filled with loops and danger chargers.</p><p>Cars and tracks are unlocked as you play, either by winning races or performing stunt flips, side rolls and combos. Two player races can either be pure head-to-head, or also feature the computer cars. The soundtrack is rock-based, including tracks by Metallica and Primus.</p>"},{"name":"Hugo","year":1998,"developer":"ITE Media ApS (Interactive Television Entertainment)","url":"psx-chd-roms-h/Hugo%20%28Europe%29.chd","filesize":250962911,"score":"","genres":"Action > 3rd-person (Other) > Behind view > Side view > 2D scrolling > Fixed / flip-screen > Persistent > Arcade > Mini-games > Platform > Direct control > Fantasy > Comedy > Licensed","desc":"<p>Hugo, the well known European TV troll makes his appearance on PlayStation.</p><p>Once upon a time, there was a troll family living in a forest. They were living happily in the forest, but little did they know about the danger looming nearby. Over in a short distance is a mountain on top of which is a skull-shaped cavern. This cave is a home to an evil witch Scylla, the villain of this game.</p><p>One day, Hugo's three kids and his wife Hugolina, were playing outside their house. That's when Scylla made her move and ambushed the troll kids. Hugolina heard this and ran outside only to be kidnapped along with the children. At the same time, Hugo was having a nap, only to awaken quickly to see what's happening outside. Sadly, he was too late and the witch was already heading back to home with Hugolina and the kids. Hugo immediately went after the witch to save his family...</p>"},{"name":"Hugo 2","year":1999,"developer":"ITE Media ApS (Interactive Television Entertainment)","url":"psx-chd-roms-h/Hugo%202%20%28Europe%29.chd","filesize":283889839,"score":"","genres":"Action > Puzzle > 3rd-person (Other) > Behind view > Side view > Top-down > 2D scrolling > Fixed / flip-screen > Persistent > Arcade > Mini-games > Platform > Direct control > Fantasy > Comedy > Licensed","desc":"<p>The Adventures of Hugo continues...</p><p>After saving his family from the evil witch in the first game, Hugo and his family are flying back home in Hugo's biplane. Little did they know, that they are in danger once again. The evil witch Scylla has somehow managed to get the possession of a very old magic book, once which allows the user to control the weather. She manages to summon a very ominously looking cloud.</p><p>Scylla sends the cloud after Hugo's biplane to re-capture Hugo's wife, Hugoline, laughing very evil-like while doing so. The cloud manages to catch up to biplane, unbeknown for Hugothat it is Scylla's old tricks at first. Hugo soon notices the cloud, but is too late to do anything about it. The cloud manages to nab Hugoline within itself and leaves back to Scylla.</p><p>Once Hugo notices that Hugoline is missing, he knows it was Scylla behind the cloud. But the kids are still on the backseat, which then Hugo gives them parachutes and tells them to jump off the plane. Right after the troll kids jump off the plane, Hugo fortunately manages to crash land at a snowy mountain. He then starts his quest to get the kids and his wife back.</p><p>The gameplay is little bit of a mix pack of an arcade-style action-puzzle elements. On one level you are in 2D side-scrolling view, on the another platforming on constantly appearingand disappearing ice pillars while also trying to avoid hazardous obstacles and death screens (even though those are humorously made) and solving small puzzles within the levels.</p>"},{"name":"Hugo: Black Diamond Fever","year":2001,"developer":"ITE Media ApS (Interactive Television Entertainment)","url":"psx-chd-roms-h/Hugo%20-%20Black%20Diamond%20Fever%20%28Europe%29%20%28En%2CSv%2CFi%29.chd","filesize":418347283,"score":"","genres":"Action > Behind view > Side view > Platform > Fantasy","desc":"<p><em>Hugo: Black Diamond Fever</em> is a 3D platform game starring Hugo the TV troll. Scylla the evil witch has enslaved the inhabitants of Volcano island with the help of Don Croco and his crocodiles. The Kikurians are put to work in the mines and have to delve rare black diamonds, which she requires for a formula for supreme evil. An imprisoned elder Kikurian sends a letter for help to Hugo. Now its up to you to stop Scylla.</p><p>Gameplay includes defeating enemies by hitting them with your tail. These include various jungle animals and Don Croco crocodiles. Along the way Kikurians can be freed and diamonds can be collected.</p>"},{"name":"Hugo: Frog Fighter","year":2002,"developer":"ITE Media ApS (Interactive Television Entertainment)","url":"psx-chd-roms-h/Hugo%20-%20Frog%20Fighter%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.chd","filesize":106040339,"score":"","genres":"Puzzle > Diagonal-down > Fixed / flip-screen > Platform > Fantasy","desc":"<p><em>Hugo: Frog Fighter</em> is a puzzle game starring Hugo the TV troll. The crocodiles of Don Croco are catching all the frogs. They plan to eat them at a big barbeque. Hugo is now off to save them from certain death.</p><p>The game is played from a birds eye perspective on a single screen per level. Hugo has to jump from floating tree trunks to gas bubbles and rocks to reach the end of the map. Usually, before the end of a map can be reached, a key has to be retrieved that opens a box. This holds another key that unlocks the end of the map. </p><p>Sometimes enemies like spiders and jumping fish have to be evaded. After completing a map a password is given that can be used to skip to this level when playing the game the next time.</p>"},{"name":"Hugo: The Evil Mirror","year":2002,"developer":"ITE Media ApS (Interactive Television Entertainment)","url":"psx-chd-roms-h/Hugo%20-%20The%20Evil%20Mirror%20%28Europe%29%20%28En%2CDa%2CPl%29.chd","filesize":501359674,"score":6.3,"genres":"Action > Behind view > Side view > Platform > Fantasy","desc":"<p><em>Hugo: The Evil Mirror</em> is a 3D platform game starring Hugo the TV trolls children, Trollerit, Trollerat, and Trollerut. Scylla the evil witch has captured Hugo in a magical mirror, before the eyes of his children. Afterwards the mirror is split in three pieces and scattered around Troll forest. Now each of the children has to recover a piece of the mirror to release their father from it.</p><p>Gameplay includes sled racing, platforming, defeating enemies and collecting diamonds. You play as each of the three children to retrieve a piece of the mirror. If all pieces are retrieved you enter the mirror where you play as Hugo who has to free himself by taking on Scyllas projection inside the mirror.</p>"},{"name":"Hugo: The Quest for the Sunstones","year":2000,"developer":"ITE Media ApS (Interactive Television Entertainment)","url":"psx-chd-roms-h/Hugo%20-%20The%20Quest%20for%20the%20Sunstones%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%2CSv%2CNo%2CDa%2CFi%29.chd","filesize":324755195,"score":"","genres":"Action > Behind view > Side view > Platform > Puzzle elements > Fantasy","desc":"<p><em>Hugo: The Quest for the Sunstones</em> is a 3D platform game similar to Crash Bandicoot both in graphics style and gameplay.</p><p>Scylla and Don Croco have placed a giant boulder in the crater of a volcano - this puts the Kikurians and their village in danger. To thwart this evil plan, Hugo has to collect three magic Sunstones and place them in the right way. With the sun shining through them, the boulder can be destroyed and the Kikurians and their village can be saved.</p><p>Gameplay includes defeating enemies by hitting them like Indiana Jones with your whip. These include various jungle animals, plants and mummies. Along the way diamonds can be collected.</p>"},{"name":"Hunchback of Notredame","year":2001,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-h/Hunchback%20of%20Notredame%20%28Europe%29.chd","filesize":460344084,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select > Europe > Medieval","desc":"<p>The ugliest man in Paris, bell-ringer Quasimodo is mocked or ignored by everyone in the city. Then, one day, Quasimodo falls in love with the dancer, Esmeralda, and his life changes forever. As well as a great 50 minutes cartoon video, Hunchback of Notredame features an easy-to-use virtual colouring book and a challenging puzzle game. Can the hunchback find love?</p>"},{"name":"Hybrid","year":1997,"developer":"Motivetime Ltd.","url":"psx-chd-roms-h/Hybrid%20%28Europe%29.chd","filesize":148553411,"score":"","genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p><em>Hybrid</em> is a 3D first-person shooter with a futuristic high-tech theme. Earth is on the the brink of collapse after years of fighting against an alien invasion, and you are among those who remain to fight. Your next mission is to strike a compound deep within the mountains. Choose from one of four characters: cybernetic commando George McKenzie, flame magic user Akiko Tyler, alien soldier Alien, or hard-boiled mercenary Bloodchaser Field. Use your guns and bombs to make your way through the complex and wipe out anything that moves.</p>"},{"name":"Hydro Thunder","year":2000,"developer":"Midway Home Entertainment, Inc.","url":"psx-chd-roms-h/Hydro%20Thunder%20%28Europe%29%20%28En%2CFr%29.chd","filesize":96239790,"score":7.6,"genres":"Racing / Driving > Behind view > Naval / watercraft > Track racing > Sci-fi / futuristic","desc":"<p>Port of Midway's arcade boat-racer. The premise is non-existent, you simply rev up the engines and go on 13 water courses set in Antarctica, the far east, the Greek isles, etc. on different types of futuristic boats. Races use the usual arcade checkpoint system and scattered across the courses you'll find an assortment of power-ups and upgrades like nitro boosters. </p><p>Graphics are entirely 3D with reflective water effects and realistic bouncing and bucking in the boats. Multiplayer competitions are supported for 2 players on the PlayStation version.</p>"},{"name":"Hyper 3-D Pinball","year":1997,"developer":"NMS Software Ltd.","url":"psx-chd-roms-h/Hyper%203D%20Pinball%20%28Japan%29.chd","filesize":134967964,"score":7.8,"genres":"Action > Arcade > Pinball","desc":"<p>Tilt! is a pinball game. The 6 pinballs you can play in the 3D full screen-modus or in the classic 2D scroll-modus. The themes of the pinballs are Science Fiction (Star Quest), Horror (Monster), Racing (Road King), Underworld (Gangster), Fantasy (Myst &amp; Majik) and Fair (Funfair). Every pinball has multi-ball gaming, animations (esp. ball-locks) during the game and intermezzos in the scoring field.</p>"},{"name":"Hyper Crazy Climber","year":1996,"developer":"Nihon Bussan Co., Ltd.","url":"psx-chd-roms-h/Hyper%20Crazy%20Climber%20%28Japan%29.chd","filesize":213844387,"score":"","genres":"Action > 3rd-person (Other) > Side view","desc":"<p><em>Hyper Crazy Climber</em> has similar gameplay to that of the original game, but it has a few differences. Besides updated graphics, you choose between three characters, each with their own strength/speed differences. You then select several buildings from a Bomberman-style map screen, and these spires include an underwater building, a medieval clock tower in which its hands are a hazard, a haunted skyscraper, and a beanstalk.</p><p>The object of the game is, as always, to reach the top of the building using the blueprints as a guide. While working your way to the top, you must dodge various obstacles that get in your way. More often than not, you do not fall off the building if one of the objects hits you, unless you try to dodge when you come in contact with them. Falling off a building will result in a loss of life. When you reach the top of a building, you have to hop onto some sort of vehicle that will take you to the next building. Coins are awarded at the completion of each standard level.</p><p>To increase your chances of reaching the top, power-ups can be obtained, and include a time-stopping clock and window-shattering sticks of dynamite. When you complete the second stage, the game unlocks the building at the center of the map. This building lets you gamble for extra lives and other items that lead you to a fast-paced bonus level.</p>"},{"name":"Hyper Formation Soccer","year":1995,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-h/Hyper%20Formation%20Soccer%20%28Japan%29.chd","filesize":170122981,"score":"","genres":"Sports > Diagonal-down > Direct control > Football (European) / Soccer","desc":"<p>Part of the Formation Soccer series and one of the first soccer titles released for the PlayStation.</p><p>In <em>Hyper Formation Soccer</em>, the player can choose one of the national teams from all around the world, and participate on exhibition matches, world cup and Human cup. The game features the usual options such as match length and draw rules, as well as define different weather effects, etc.</p>"},{"name":"Hyper Tennis: Final Match","year":1996,"developer":"Arc System Works Co., Ltd.","url":"psx-chd-roms-h/Hyper%20Tennis%20-%20Final%20Match%20%28Europe%29.chd","filesize":346183028,"score":"","genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p>Hear the grunts echo through the stadium as you control one of 12 (6 male &amp; 6 female) tennis players with different abilities.  Up to four players can compete in Exhibition singles and doubles or rack up points on a World Tour of six tournaments (the Australian Open in Melbourne, the French Open in Paris, the Human Open in Tokyo, Mixed Doubles in Montreal, the US Open in New York and Wimbledon in London).  Three different court surfaces (clay, grass, and hard court) affect the speed and bounce of balls hit.  </p><p>You get penalized for not connecting on your serve and must time your hits of returns as it will affect where the ball goes.  Your player's movements are motion-captured and you can lunge at a ball if you are caught out of position.  There's 9 different camera views to choose from.</p>"}]