[{"name":"Ian Livingstone's Deathtrap Dungeon","year":1998,"developer":"Asylum Studios","url":"psx-chd-roms-i/Ian%20Livingstone%27s%20Deathtrap%20Dungeon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":406097177,"score":6.6,"genres":"Action > Behind view > Direct control > Fantasy","desc":"<p>Fang was once a proud and rich city, until Baron Sukumvit took over. Under his rule, the city is known as the City of the Lost Souls. Deep inside the mountains surrounding the city, Baron Sukumvit built a labyrinth, named Deathtrap Dungeon, and used it to imprison his enemies. Filled with vulgarities, traps and disgusting monsters, the dungeon is a very dangerous place. With his enemies gone, the Baron now has opened up the dungeon to sport and sends willing heroes down into it's depths, betting on the likelihood of their survival. If anyone could survive all levels of the dungeon, and slay the red dragon Melkor, they would receive 10.000 gold pieces and Baron Sukumvit would renounce his rule over Fang. Two brave heroes: Red Lotus and Bandog, agree to these terms and enter the Deathtrap Dungeon...</p><p><em>Deathtrap Dungeon</em> is a 3rd person action game. Controlling either Red Lotus or Bandog, the player controls the character from behind with a camera mode like in Tomb Raider. To deal with the enemies encountered, there are three different kinds of attacks: melee weapons, range weapons and magic. The melee weapons include basic fists to normal swords to a magic enhanced war hammer. In the range weapons department are goodies like bombs or a flame-thrower. In terms of spells are magicks such as fireballs or rather crazy spells like the exploding pig. But the real challenge are of course the riddles, traps and abysses that are everywhere throughout the dungeon.</p><p>During the journey, players will encounter many locked doors, that require the finding of keys and devices. There are also potions that regenerate health or provide immunity against fire for a limited amount of time. There are also several treasures hidden in the dungeon, finding them will increase the player's score at the end of the level. The player can save this game during a level by finding the various save points.</p><p>The game also features the two multiplayer-modes: Deathmatch and Last Man Standing.</p>"},{"name":"Iblard: Laputa no Kaeru Machi","year":1997,"developer":"System Sacom","url":"psx-chd-roms-i/Iblard%20-%20Laputa%20no%20Kaeru%20Machi%20%28Japan%29.chd","filesize":368626392,"score":"","genres":"Adventure > 1st-person > Direct control > Fantasy > Licensed","desc":"<p><em>Iblard: Laputa no Kaeru Machi</em> is an adventure game. The main character is a boy who gets lost in the fictional world Iblard. He meets the wizard Niña and the animal-looking people Makinso and Scopello, and goes on an adventure to find a way back to his world through the floating island Laputa.</p><p>The game is based around the works of Naohisa Inoue, a contemporary artist. Most of the gameplay is about exploring the environment and locating items.</p>"},{"name":"Ide Yōsuke Meijin no Shinmi Sen Mahjong","year":1996,"developer":"Capcom Co., Ltd."},{"name":"Ide Yōsuke no Mahjong Kyōshitsu","year":1999,"developer":"Athena Co., Ltd.","url":"psx-chd-roms-i/Ide%20Yousuke%20no%20Mahjong%20Kyoushitsu%20%28Japan%29.chd","filesize":13388249,"score":"","genres":"Educational > Strategy > Top-down > Board game > Cards / tiles","desc":"<p><em>Ide Yōsuke no Mahjong Kyōshitsu</em> is a Mahjong learning and practice game featuring Mahjong professional Ide Yōsuke. The game has a number of lessons shown with a manga style drawn Ide Yōsuke explaining the rules of the Chinese classic board game of Mahjong, and allows the player to try what they have learn on Mahjong boards.</p>"},{"name":"Idol Janshi Suchie-Pai II (Disc 1)","year":1996,"developer":"Jaleco Entertainment, Inc.","url":"psx-chd-roms-i/Idol%20Janshi%20Suchie-Pai%20II%20Limited%20%28Japan%29%20%28Disc%201%29.chd","filesize":349957913,"score":"","genres":"Strategy > Top-down > Anime / Manga > Cards / tiles > Adult","desc":"<p>The third installment in the <em>Suchie-Pai</em> series of mahjong games. More beautiful girls are ready to be your opponent in a game of strip mahjong.</p><p>A girl named Shiho Katagiri has been kidnapped, and it's up to Suchie-Pai to save her. Suchie-Pai will need to beat several opponents in mahjong in order to progress. The strip scenes are animated this time. You are also joined by some of your opponents, who can transform into heroes themselves.</p><p>The PlayStation version is a censored port and doesn't feature the adult content.</p>"},{"name":"Idol Janshi Suchie-Pai II (Disc 2)","year":1996,"developer":"Jaleco Entertainment, Inc.","url":"psx-chd-roms-i/Idol%20Janshi%20Suchie-Pai%20II%20Limited%20%28Japan%29%20%28Disc%202%29%20%28Bonus%20Disc%20Part%201%29.chd","filesize":469154527,"score":"","genres":"Strategy > Top-down > Anime / Manga > Cards / tiles > Adult","desc":"<p>The third installment in the <em>Suchie-Pai</em> series of mahjong games. More beautiful girls are ready to be your opponent in a game of strip mahjong.</p><p>A girl named Shiho Katagiri has been kidnapped, and it's up to Suchie-Pai to save her. Suchie-Pai will need to beat several opponents in mahjong in order to progress. The strip scenes are animated this time. You are also joined by some of your opponents, who can transform into heroes themselves.</p><p>The PlayStation version is a censored port and doesn't feature the adult content.</p>"},{"name":"Idol Janshi Suchie-Pai II (Disc 3)","year":1996,"developer":"Jaleco Entertainment, Inc.","url":"psx-chd-roms-i/Idol%20Janshi%20Suchie-Pai%20II%20Limited%20%28Japan%29%20%28Disc%203%29%20%28Bonus%20Disc%20Part%202%29.chd","filesize":546129424,"score":"","genres":"Strategy > Top-down > Anime / Manga > Cards / tiles > Adult","desc":"<p>The third installment in the <em>Suchie-Pai</em> series of mahjong games. More beautiful girls are ready to be your opponent in a game of strip mahjong.</p><p>A girl named Shiho Katagiri has been kidnapped, and it's up to Suchie-Pai to save her. Suchie-Pai will need to beat several opponents in mahjong in order to progress. The strip scenes are animated this time. You are also joined by some of your opponents, who can transform into heroes themselves.</p><p>The PlayStation version is a censored port and doesn't feature the adult content.</p>"},{"name":"Idol Janshi Suchie-Pai Special","year":1995,"developer":"Jaleco Ltd."},{"name":"IHRA Motorsports Drag Racing","year":2001,"developer":"Digital Dialect","url":"psx-chd-roms-i/IHRA%20Drag%20Racing%20%28USA%29.chd","filesize":325378236,"score":"","genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Enjoy the power of Top Fuel, Pro Mod, Pro Stock, or Funny Car drag racing! Race on multiple tracks against some of the best drivers and cars of the IHRA. Start easy with a quick race, or modify any of the 70 different parts for optimum performance! Race on ten different tracks in different weather (day or night). Race friends or join tournaments online!</p>"},{"name":"Ikkyū-san: The Quiz","year":2002,"developer":"OOParts"},{"name":"Imadoki no Vampire: Bloody Bride","year":1996,"developer":"Jorudan Co., Ltd.","url":"psx-chd-roms-i/Imadoki%20no%20Vampire%20-%20Bloody%20Bride%20%28Japan%29.chd","filesize":462598899,"score":"","genres":"Role-playing (RPG) > Simulation > 1st-person > Top-down > Anime / Manga > Dating simulation > Menu structures > Romance","desc":"<p><em>Imadoki no Vampire: Bloody Bride</em> is a dating simulation game mixed with turn-based combat.</p><p>The game features a young vampire who reaches (vampire's) adulthood. But in order to become mature he must suck the blood of a girl with a \"Platinum Aura\". However, this task is harder than it may look because the girl must willingly let him suck her blood.</p><p>The young vampire is sent to the human world in order to find a girl with that aura, having 3 years to complete that task. In order to get consent though, the vampire must work on his appearance, manners, strength and other skills and schedule dates with the girls where he must choose appropriate responses to improve his relationship with them. </p><p>As a vampire, the boy can wander at night in order to find common girls and suck their blood. Successfully sucking a victim's blood will have the vampire level up which will give him 10 points to assign to any skill which players wish to improve. The vampire will also encounter monsters with whom he'll fight in order to help him reach his adulthood, gain experience, souls which can be used to purchase items, weapons and accessories and berries which he can give to his female demon servants to improve their skills and have them successfully spy on the girls the player wants the vampire to go for.</p>"},{"name":"Image Fight & X Multiply","year":1998,"developer":"Irem Corp."},{"name":"ImageGun & TFX (Flight Maniac Set)","year":1996,"developer":""},{"name":"Impact Racing","year":1996,"developer":"Funcom Dublin Ltd.","url":"psx-chd-roms-i/Impact%20Racing%20%28Europe%29.chd","filesize":333938851,"score":6.8,"genres":"Action > Racing / Driving > 1st-person > Behind view > Shooter","desc":"<p>With disregard for a background story, Funcom Dublin offers a Wipeout-esque mix of racing and driving at a very fast pace. Completing laps within the allotted time does not suffice, you also need to destroy a certain amount of vehicles. Contrary to the aforementioned title, you drive ordinary racing cars, if you count out the mounted weapons. These include mines, concussion missiles, smart bombs, heat-seeking missiles, lasers and firewalls. Some are provided by taking out enemies, but power-ups, time bonuses, energy, armor and a handicap that turns the screen upside-down, can also be collected.</p><p>Five cars are available, with different statistics and built-in weapons. The initially weak weapon is soon replaced when you collect upgrade icons. To activate these, you have to complete a bonus stage after which you can also save your game. To add to the game's length, each of the twelve tracks, based on the settings \"city\", \"mountain\" or \"space\", has three variations: reverse, at night or the combination of the two. Other features include a small diagram showing approaching cars to time your mines, and pumping electronic tracks to match the game's pace.</p>"},{"name":"In Cold Blood (Disc 1)","year":2000,"developer":"Revolution Software Ltd.","url":"psx-chd-roms-i/In%20Cold%20Blood%20%28Europe%29%20%28Disc%201%29.chd","filesize":318710908,"score":7.2,"genres":"Action > Adventure > 3rd-person (Other) > Puzzle elements > Shooter > Stealth > Spy / espionage","desc":"<p>In the near future, Cold War has reignited between USA and People's Republic of China. CIA has requested assistance of British MI6 to send an agent into Volgia, a fictional state under control of General Nagarov which he founded after the dissolution of the Soviet Union. The player takes control of John Cord, MI6 agent chosen for the assignment. His investigation turns out to be anything but simple.</p><p><em>In Cold Blood</em> has characteristics of an adventure game, a stealth game, and a shooter. It relies on puzzle-solving but also includes action segments. Progress in the game is mostly achieved by collecting items and talking to various characters to find clues. Many conversations consist of multiple-choice dialogues. At certain points it is necessary to use stealth to proceed undetected, or attempt to solve the situation violently. Combat is fairly simple and consists of melee fighting (punches) or shooting.</p>"},{"name":"In Cold Blood (Disc 2)","year":2000,"developer":"Revolution Software Ltd.","url":"psx-chd-roms-i/In%20Cold%20Blood%20%28Europe%29%20%28Disc%202%29.chd","filesize":387043645,"score":7.2,"genres":"Action > Adventure > 3rd-person (Other) > Puzzle elements > Shooter > Stealth > Spy / espionage","desc":"<p>In the near future, Cold War has reignited between USA and People's Republic of China. CIA has requested assistance of British MI6 to send an agent into Volgia, a fictional state under control of General Nagarov which he founded after the dissolution of the Soviet Union. The player takes control of John Cord, MI6 agent chosen for the assignment. His investigation turns out to be anything but simple.</p><p><em>In Cold Blood</em> has characteristics of an adventure game, a stealth game, and a shooter. It relies on puzzle-solving but also includes action segments. Progress in the game is mostly achieved by collecting items and talking to various characters to find clues. Many conversations consist of multiple-choice dialogues. At certain points it is necessary to use stealth to proceed undetected, or attempt to solve the situation violently. Combat is fairly simple and consists of melee fighting (punches) or shooting.</p>"},{"name":"In the Hunt","year":1995,"developer":"Irem Corp.","url":"psx-chd-roms-i/In%20the%20Hunt%20%28Europe%29.chd","filesize":375853702,"score":7.1,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Naval / watercraft > Sci-fi / futuristic","desc":"<p>A 2D side scrolling shooter in which you take control of a small attack submarine and engage in underwater combat. The Dark Anarchy Society's forces threaten to destroy the earth's most important cities  and only you can get past their defenses and destroy their secret underwater lair.</p><p>In the Hunt follows the classic template for 2D shooters, with the added feature of being able to control scrolling speed. Includes seven levels of underwater action (and keep an eye out for threats from above the surface), upgradeable weapons, and two player cooperative gameplay.</p>"},{"name":"Incredible Crisis","year":1999,"developer":"Polygon Magic, Inc.","url":"psx-chd-roms-i/Incredible%20Crisis%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":442414081,"score":6.9,"genres":"Action > 3rd-person (Other) > Arcade > Music / rhythm > Puzzle elements > Shooter","desc":"<p>Grandmother Hatsu has a birthday. She wants it to be a special day, and is eagerly waiting for her presents. However, father Taneo, mother Etsuko, son Tsuyoshi and daughter Ririka have all forgotten about that. They have to buy last-minute presents for the grandmother, and make it home in time for the party. Sounds simple? Not quite: each member of this completely ordinary, working-class family is delayed by inexplicable obstacles, which involve, among others, bank robbers, UFOs, miniaturization, and a giant teddy bear who is out to demolish Tokyo.</p><p><em>Incredible Crisis</em> is entirely composed out of 24 predominantly action-oriented mini-games. Most of them are unique, though a few are repeated throughout the course of the game. Among these mini-games are synchronized dancing, various driving sequences, simple obstacle-dodging, shooting, and others. A few mini-games deviate from the action style, e.g. a quiz or a puzzle that involves calculating an item's weight.</p><p>The mini-games must be first completed in a specific order, tied by an overarching story told by CG animated cutscenes. Afterwards, they can be accessed directly from the main menu.</p>"},{"name":"Incredible Hulk, The: The Pantheon Saga","year":1996,"developer":"Silicon Dreams Studio Ltd.","url":"psx-chd-roms-i/Incredible%20Hulk%2C%20The%20-%20The%20Pantheon%20Saga%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":443021578,"score":5.4,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Licensed","desc":"<p><em>The Incredible Hulk</em> is an isometric 3D action game.</p><p>The popular Marvel comic book hero <em>The Hulk</em> returns to the PC, Playstation and Saturn systems to battle tons of lowly enemies and the occasional monstrous super-villain. When the lawful Pantheon society of superheroes kidnaps the green giant, he joins forces with his abductors and smashes through 13+2 isometric 3D levels (in a look reminiscent of the Loaded series of games).</p><p>True to the comic books, the Hulk relies on no other weapons than his massive muscles to punch, kick and crush his enemies. When he has accumulated enough gamma energy, he may use powerful special moves like a Vortex Spin or the Floor Hammer. Rare bonus items also allow the Hulk to summon one of the four Pantheon team members Atalanta, Ulysses, Ajax and Hector to assist in the thick of battle. </p><p>Most levels include at least one arch-enemy, such as Piecemeal, Trauma &amp; Lazarus or the U-Foes. Luckily, the Hulk’s regenerative powers allow him to regain health slowly. Little seems to be left of the Hulk’s legendary leaping capacity, however, so the green meat ball is forced to hop from platform to platform every now and then. </p><p>You can find more information on <em>The Incredible Hulk</em> comic books in the trivia and links sections.</p>"},{"name":"Independence Day","year":1997,"developer":"Radical Entertainment Inc.","url":"psx-chd-roms-i/Independence%20Day%20-%20The%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.chd","filesize":275071345,"score":5,"genres":"Action > Simulation > 3rd-person (Other) > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic > Licensed","desc":"<p>This arcade game is based loosely on the 1996 blockbuster movie \"Independence Day.\" Interspersed with cutscenes lifted from the film, the game consists of flying a jet through various missions in order to take down the gargantuan, city-destroying spaceships. This entails flying around the 3D level and taking out targets such as: communication uplinks, shield generators, the occasional alien fighter craft, and ultimately bringing down the major alien ship via a strike on its main cannon. Powerups are plentiful, such as medical packs that heal your jetcraft, bonus weapons, bonus planes, and an item that freezes enemy planes for a brief time.</p><p>Mission settings include the Grand Canyon, Washington D.C., and New York City. There are other missions that are provided on a need-to-know basis (as stated in the manual). The game also features 2-player head-to-head action via a network or null modem link.</p>"},{"name":"Indy 500","year":1997,"developer":"Tose Co., Ltd.","url":"psx-chd-roms-i/Indy%20500%20%28Europe%29.chd","filesize":245580440,"score":6.4,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Indy 500</em> is an arcade 3D racing game. The players race on circuits in typical open wheel cars.</p><p>The game features a two player (horizontal split-screen) mode, time attack and Indy 500 mode.</p><p>In time attack the player just has to beat the clock in Indy 500 mode. The player has to race all the tracks including qualification rounds.</p>"},{"name":"Infestation","year":2000,"developer":"Frontier Developments Ltd.","url":"psx-chd-roms-i/Infestation%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":182067893,"score":6.3,"genres":"Action > Racing / Driving > 3rd-person (Other) > Real-time > Arcade > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In the game you drive an upgradeable buggy, an experimental vehicle, named ACAM. It can be transformed into six different shapes; you can turn it into an aircraft, or even a hovercraft. You have to shoot aliens with flashy weapons, collect resources such as Crystals, Energy Spheres and lost scientists. So you as single human hero must put evil aliens in their place and introduce them to his plasma cannon. </p>"},{"name":"Inspector Gadget: Gadget's Crazy Maze","year":2001,"developer":"Light & Shadow Production","url":"psx-chd-roms-i/Inspector%20Gadget%20-%20Gadget%27s%20Crazy%20Maze%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":270735905,"score":"","genres":"Action > Puzzle > Top-down > 2D scrolling > Platform > Direct control > Detective / mystery > Licensed","desc":"<p>According to the story of Gadget's Crazy Maze, Inspector Gadget's mysterious arch-nemesis is up to no good once again. This time, the MADD ringleader Dr. Claw has been creating mind-control crystals on his secret moon base, then tossing them down to Earth. If the crystals lay dormant for a short amount of time, they will activate, taking control of the consciousness of the whole world. To make sure no one disturbs them, Dr. Claw has spread them all around four different areas and inserted his vile henchmen to protect them.</p><p>This sets the scene for a game in which the player uses Inspector Gadget to find crystals that are scattered around the game area and neutralize them. He does so by arranging three or more crystals of the same colour in a straight line at which point they turn into coins that can be collected for points. Also in the game area are objects such as hammers which, when collected, can be fired on a spring from within his hat to daze the bad guys.</p>"},{"name":"Intelligent Qube","year":1997,"developer":"Sugar & Rockets, Inc."},{"name":"International Cricket Captain 2000","year":2000,"developer":"","url":"psx-chd-roms-i/International%20Cricket%20Captain%202000%20%28Europe%29.chd","filesize":85316892,"score":"","genres":"Sports > Diagonal-down > Direct control > Cricket","desc":"<p>As a Captain myself, I can say that the decision-making in the game is almost as tough as when you're out there on the pitch. If I'd been asked to write down all the things I would like to see in a cricket game, I'd have to say I couldn't have managed any better\"</p>"},{"name":"International Cricket Captain 2001: Ashes Edition","year":2001,"developer":"Empire Interactive, Inc.","url":"psx-chd-roms-i/International%20Cricket%20Captain%202001%20-%20Ashes%20Edition%20%28Europe%29.chd","filesize":79283831,"score":"","genres":"Sports > Diagonal-down > Direct control > Cricket","desc":"<p>Captain England or any country from the Test playing nations.<br>Captain any side in the two division county championship and play in all domestic tournaments including the National League and the Super Cup.<br>Historical scenarios featuring great players from the past.<br>Replay the '99 World Cup.<br>Pick your team, choose your bowlers, make declarations.<br>Prepare the pitch, sign new players and decide the match tactics.<br>Bowl around or over the wicket. Decide length and time. Set the field.<br>The decisions are yours.</p>"},{"name":"International Cricket Captain 2002","year":2002,"developer":"Empire Interactive Europe Ltd.","url":"psx-chd-roms-i/International%20Cricket%20Captain%202002%20%28Europe%29.chd","filesize":78207660,"score":"","genres":"Sports > 3rd-person (Other) > Turn-based > Cricket","desc":"<p><em>International Cricket Captain 2002</em> is one of a series of cricketing games from Empire Interactive. In the single-player mode the player can:* play the full game by leading any of the English county teams;</p><ul><li>take control of an English county team, manage them and earn the right to captain the national team;</li><li>play as a national team manager, the countries available are Australia, England, India, New Zealand, Pakistan, South Africa, Sri Lanka, West Indies and Zimbabwe.</li></ul><p>In the two-player mode each player selects a different international team, matches are either fifty overs of five day tests and the players compete in either a one, three or five match series. The batting side uses the keyboard to control their team</p><p>There are also some classic matches, or Scenarios as they are called in-game, where the player can relive or try to change an historic match. These matches are 1948 England v Australia, 1971 England v India, 1986 Australia v England, 1991 England v West Indies, 2002 Australia v England, and the 2003 World Cup. In these matches the player can control either side, set the difficulty level, and change the team, coaching skills etc before playing the match.</p><p>When bowling the player can adjust the way the ball is delivered, the degree of aggression and length of the delivery, which side of the wicket the bowler bowls from, and which stump the bowler aims for. When batting the player can adjust the degree of aggression the batsman uses. During an innings the player can optionally view animations of the action and here there are settings that allow the player to view every delivery or just specific events.</p>"},{"name":"International Moto X","year":1996,"developer":"Graftgold Ltd.","url":"psx-chd-roms-i/International%20Moto%20X%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":224696535,"score":5.4,"genres":"Racing / Driving > Sports > 1st-person > 3rd-person (Other) > Behind view > Motorcycle > Off-roading > Track racing > Vehicle simulator","desc":"<p><em>International Moto X</em> simulates off-road motorcycle races. The main part of the game is the championship mode in which the player controls a 125cc motorcycle. There are various different leagues on different continents.</p><p>At first the player creates his rider and sets the colour of his bike. More important is the tuning of the bike. It is possible to buy new dampers, tires or engines or update the ones already in use. Also there is a choice between three, four or five gears - inexperienced players can select automatic.</p><p>During the race the goal is obviously to be the fastest rider by using all the tricks in the book - including stunts like wheelies, risky jumps, sliding or forcing the competition out of the way. There are several shortcuts to use but when the player is caught doing so, he is penalized. Winning a race results in prize money which can be reinvested in better gear. After winning all races in a league the player is allowed to ride in the 500cc league.</p><p>Because the game is played in a 3rd person perspective there is no cockpit view - so all relevant data is shown in the upper left corner of the screen, including a mini map. Additionally there are two training modes, a time race and a training race against seven other riders on a course of choice. The game also features a scenery editor to create own courses but it not possible to save unfinished work. The competition editor allows the creation of new leagues with old or new courses.</p>"},{"name":"International Rally Championship","year":1998,"developer":"Europress Software Ltd."},{"name":"International Soccer Excite Stage 2000","year":2000,"developer":"Epoch Co., Ltd.","url":"psx-chd-roms-i/International%20Soccer%20-%20Excite%20Stage%202000%20%28Japan%29.chd","filesize":382164177,"score":"","genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p><em>International Soccer Excite Stage 2000</em> is a soccer game. It is the fifth game in the <em>Excite Stage</em> series and first for the PlayStation platform. Instead of Japanese club teams, this game features A (senior) and under-23 national teams from all around the world. The game is similar in gameplay to the previous three Super Famicom titles. The indoor and beach soccer are no longer available, however the training mode was kept.</p>"},{"name":"International Superstar Soccer 2000","year":2001,"developer":"Major A","url":"psx-chd-roms-i/International%20Superstar%20Soccer%20%28Europe%29%20%28En%2CDe%29.chd","filesize":151353343,"score":7.5,"genres":"Sports > Diagonal-down > Football (European) / Soccer","desc":"<p>The third ISS title on the N64 improves further in both gameplay and graphics.</p><p>As usual, you can play in a range of game modes, from 4 player exhibition, World League against every team in the world, and a collection of scenario games that have you completing certain elements of a game in order to complete it.</p><p>Also on offer are create-a-player modes, full gameplay options (subs, strategies and name editing) to expansion pak support for faster and more detailed graphics.</p>"},{"name":"International Superstar Soccer Deluxe","year":1997,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"psx-chd-roms-i/International%20Superstar%20Soccer%20Deluxe%20%28Europe%29.chd","filesize":175604597,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p>This is the sequel to International Superstar Soccer, Konami's saga of soccer games. This Deluxe version was published first to the SNES, then the Mega Drive and Playstation.</p><p>ISS Deluxe has realistic animations and player sprites. You can compete with 36 national teams with recognizable celebrity players (like Valderrama, Baggio, Ravanelli, Petkov...), but their names are fictitious. You can choose too from 16 formations and 8 strategies to win.</p><p>The competitions available are: International Cup, World Series (League), Scenario Mode and customizable mini-cups/leagues.</p>"},{"name":"International Superstar Soccer Pro '98","year":1998,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-i/International%20Superstar%20Soccer%20Pro%20%2798%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":275678702,"score":7.9,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (European) / Soccer","desc":"<p>GOOOAAAALLLL!!<br>New for the PlayStation game console. Now endorsed by Carlos Valderrama International Superstar and captain of Colombia's national soccer team.<br>Motion captured animations<br>5 unique soccer stadiums<br>8 preset strategies<br>5 different camera angles<br>Compete for 7 different int'l cups<br>36 international teams<br>Adjustable gameplay speed<br>Play-by-play commentary by U.K. sportscaster, Tony Gubba<br>6 exciting play modes including training, penalty kicks and league play</p>"},{"name":"International Track & Field","year":1996,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"psx-chd-roms-i/International%20Track%20%26%20Field%20%28Europe%29.chd","filesize":68250182,"score":7.6,"genres":"Sports > 3rd-person (Other) > Olympiad / mixed sports","desc":"<p>International Track &amp; Field continues with the button mashing of the NES games in 11 different sports, now in full 3D! The sports range from 100 meter sprint and 110 meter hurdles to javelin and discus.</p><p>The game features two game modes. One where you can practice each sport individually and the \"normal\" mode, where you can go at it with up to 4 people facing off in all the sports one after another.</p>"},{"name":"International Track & Field 2000","year":1999,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"psx-chd-roms-i/International%20Track%20%26%20Field%202000%20%28USA%29.chd","filesize":165803463,"score":7.2,"genres":"Sports > 3rd-person (Other) > Olympiad / mixed sports","desc":"<p>Track and Field sports over 12 different events that will test your gaming mojo.  From Weightlifting to gymnastics to the 100M dash, Track and Field is the successor to the Track and Field games from the 8 bit Nintendo.</p>"},{"name":"Interplay Sports Baseball 2000","year":1999,"developer":"Interplay Productions, Inc.","url":"psx-chd-roms-i/Interplay%20Sports%20Baseball%202000%20%28Europe%29.chd","filesize":60711234,"score":6,"genres":"Sports > 3rd-person (Other) > Baseball","desc":"<p>A baseball game featuring an Exhibition, Season, Playoff, Tournament, and a Home Run Derby mode. There is also a General Manager mode that lets the player create and trade players, and change team lineups. The game features the real MLB players and teams of that time.</p><p>In the Playstation version, batting and pitching are both done from a behind the batter's viewpoint, while in the Windows version, the camera is more dynamic and is able to switch to both viewpoints. The Windows version is able to do this because of the Messiah technology being used, which allows for high-res Direct3D accelerated polygonal graphics.</p><p>When batting the player can choose to either swing for contact or for power. The player can also choose a difficulty level for their batting. Rookie has the player timing their swing with the pitch, Pro adds the challenge of controlling the level of the swing, while selecting All-Star is basically the same as Pro, except the pitches come in at a faster rate of speed.</p><p>When pitching, players can select different pitch types to throw depending on the ability of their pitcher. Players also can view a pitch chart that tracks every pitch thrown to each batter in the game. </p><p>The game also features a play-by-play announcer and is able to keep track of the single season stats. </p><p>This game is an update of VR Baseball 2000.</p>"},{"name":"Inuyasha","year":2001,"developer":"Bandai Co., Ltd.","url":"psx-chd-roms-i/Inuyasha%20%28Japan%29%20%28Rev%201%29.chd","filesize":374883348,"score":"","genres":"Role-playing (RPG) > 1st-person > Diagonal-down > 2D scrolling > Fixed / flip-screen > Anime / Manga > Japanese-style RPG (JRPG) > Direct control > Menu structures > Fantasy > Japan (Ancient/Classical/Medieval) > Horror > Licensed","desc":"<p><em>Inuyasha</em> (犬夜叉) is a role-playing game which uses top-down view with bird's perspective presentation during exploration and conversation direct control gameplay while switching to 1st-person menu-based games during random battle encounters. The game follows the original anime and magna series and even includes some of the animated scenes from the first episode (such as fighting that giant centipede-like demon or when Kagome discovers and releases Inuyasha). The player controls Inuyasha and can talk to other NPCs, purchase items from the shops, and fight various demons with simple commands such as attack, defense, or use healing items.</p><p>Just as in the original animated series, Kagome Higurashi, a high-school female student finds herself magically transported back through time to Sengoku period Japan. There she meets Inuyasha, a half-demon dog who she frees from imprisonment after a monster tried to kill her in order to get a magical Shikon jewel embodied within her. Inuyasha too would like to get his hands on that, but the jewel ends up shattered into thousand pieces so Inuyasha and Kagome team up to find and retrieve all those pieces, but they'll have to to battle many many demons to collect them all and recreate the orb.</p>"},{"name":"Inuyasha (Shokai Genteiban)","year":2001,"developer":"","url":"psx-chd-roms-i/Inuyasha%20%28Japan%29%20%28Shokai%20Seisanban%29.chd","filesize":374825044,"score":"","genres":"Special edition > Physical extras","desc":"<p>This limited edition retail box release includes:</p><ul><li>Inuyasha game</li><li>Inuyasha notebook</li><li>Official guide book</li></ul>"},{"name":"InuYasha: A Feudal Fairy Tale","year":2002,"developer":"Dimps Corporation","url":"psx-chd-roms-i/Inuyasha%20-%20A%20Feudal%20Fairy%20Tale%20%28USA%29%20%28Rev%201%29.chd","filesize":278777481,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting","desc":"<p><em>InuYasha: A Feudal Fairy Tale</em> is mainly a 2D anime fighting game based on the anime TV series of the same name. </p><p>The game features a story mode, player vs. player/computer, team player vs team player/computer. The game also features the character/attacks, images, and animated cut scenes for the special attacks from the TV series. As you play the game you unlock more character/play modes (above what is listed above) as you go.</p><p>The plot is the same as the TV series. Kagome (high school student in modern day) fell down a well and found her self in Feudal Japan and brought with her the Sacred Jewel of the Four Souls (sought about by demons for its power). It gets interesting after releasing InuYasha, a ½ demon who was after the gem. Early on, the Sacred Jewel was shattered during a fight and Kagome &amp; InuYasha mission is to retrieve all the shards of the gem. During there journey they pick up some companions (human and demon) and come across many enemies.</p>"},{"name":"Invaders, The: Space Invaders 1500","year":2001,"developer":"Taito Corporation"},{"name":"Invasion","year":1999,"developer":"Microïds","url":"psx-chd-roms-i/Invasion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":258913647,"score":"","genres":"Action > 1st-person > Behind view > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>Invasion</em> is a vehicle themed Science fiction third and first-person shooter where you take on the role of a resistance fighter. </p><p>Earths defense forces are quickly defeated by an invading alien army called the Keseits. With the army and most resources gone it’s now up to the player to help the resistance against the alien invaders.</p><p>In the game the player will pilot his ship and takes on missions to destroy enemies structures and ships. Destroyed enemies yield points for a level score.</p>"},{"name":"Invasion from Beyond","year":1998,"developer":"King of the Jungle Ltd.","url":"psx-chd-roms-i/Invasion%20from%20Beyond%20%28USA%29.chd","filesize":233064132,"score":6.1,"genres":"Action > 3rd-person (Other) > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>Strange sights have been seen in the sky, crop circles appear on the ground. These can only be signs of an alien invasion. The people are scared and Area-51 is called up to defend the planet.</p><p>Invasion from Beyond is a 3D flight combat game. Choosing from a selection of different ships (more of which can be found during the course of the game), the player takes to the skies. Each ship contains a primary weapon, a secondary weapon and a Suk-O-Matic which can be used to retrieve items and people in order for them to reach safety.</p>"},{"name":"Iron & Blood: Warriors of Ravenloft","year":1996,"developer":"Take-Two Interactive Software, Inc.","url":"psxchda/Advanced%20Dungeons%20%26%20Dragons%20-%20Iron%20%26%20Blood%20-%20Warriors%20of%20Ravenloft%20%28Europe%29.chd","filesize":164100424,"score":5.7,"genres":"Action > 3rd-person (Other) > Fighting > Fantasy > Horror > Licensed","desc":"<p>In this fighting style game, the player assumes the personas of various character types from the <em>Ravenloft</em> setting of the <em>Advanced Dungeons &amp; Dragons</em> universe. The goal (besides winning each battle) involves a quest for artifacts that will determine whether the \"ranks of Chaos\" or the \"Lords of Law\" are triumphant.</p><p>Unique to this fighting game (at least at the time) was the introduction of cooperative campaign play for two players at once.</p>"},{"name":"Iron Man / X-O Manowar in Heavy Metal","year":1996,"developer":"Realtime Associates, Inc.","url":"psx-chd-roms-i/Iron%20Man%20%26%20X-O%20Manowar%20in%20Heavy%20Metal%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":335628677,"score":5.7,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>This game is a linear beat 'em up Final Fight type game with the choice to play as one of two comic book heroes: Iron Man or X-O Manowar. The game follows the pattern of sidescrolling action in each level with a comic book boss at the end of each.</p><p>Levels are as follows:1. Nuclear Plant Siege with bosses Mr. Hyde and the Melter.2. Stark Enterprises with bosses Titania, Yellowjacket and Goliath.3. Retake New York City with bosses Vizier and Mistress Crescendo.4. Dromak Base Assault with bosses Absorbing Man and Dromak Gladiator.5. Assault on Zola's Castle with bosses Arnim Zola and Mistress Crescendo.6. Alien Dig: The Cosmic Cube with bosses Baron Zemo and Mistress Crescendo.7. Board Dromak Ship with Final Boss General Krytos.</p>"},{"name":"Iron Soldier 3","year":2000,"developer":"Eclipse Software Design","url":"psx-chd-roms-i/Iron%20Soldier%203%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":511894676,"score":6.7,"genres":"Action > Simulation > 1st-person > Mecha / giant robot > Post-apocalyptic > Sci-fi / futuristic","desc":"<p><em>Iron Soldier 3</em> once again puts you in the driver's seat of a 42 foot tall killer robot. It is the not too distant future, and powerful corporations are beginning to use military force to overtake national governments. You are a pilot for the United Republic, and you must stop the onslaught of the powerful Penta Corporation.</p><p>At your disposal you will have a large array of weapons which you can attach to your Iron Soldier unit. There are machine guns, missiles, grenades, a flame thrower, and more. In addition to the standard Iron Soldier, you can pilot a smaller, faster chicken-walker type robot and a new slower, more heavily armed walker.</p><p>There are new game modes added since the Iron Soldier 2. There is still a single player mode, with 25 missions to complete. Now there is also an arcade mode, where your objective is to level every building in the area in the fastest time possible. Finally, for the first time there is a two player mode.</p><p>Iron Soldier 3 is the first in the series to appear on a platform other than the Atari Jaguar.</p>"},{"name":"Irritating Stick","year":1998,"developer":"Saurus Co., Ltd.","url":"psx-chd-roms-i/Irritating%20Stick%20%28USA%29.chd","filesize":28605974,"score":"","genres":"Action > Top-down > Arcade > Direct control > Licensed","desc":"<p>Ever played that thing at carnivals were you have to maneuver a metal rod through a maze without touching the sides? well, this is what this game is. Seriously! This game is based on a Japanese show in which you actually get shocks when you touch the sides of the maze. You control  the rod and have to maneuver it through several 3-D mazes without touching the sides. </p><p>Includes 1 or 2 players simultaneous play or 8 players tournament mode, 3 courses with 100 mazes in total plus a random maze generator and editor mode.</p>"},{"name":"iS: internal section","year":1999,"developer":"Positron Co., Ltd.","url":"psx-chd-roms-i/iS%20-%20Internal%20Section%20%28Japan%29.chd","filesize":171717456,"score":"","genres":"Action > Behind view > Arcade > Shooter","desc":"<p><em>iS: internal section</em> is a \"tube shooter\" in the tradition of Tempest and S.T.U.N. Runner. The game uses flat shaded, untextured polygons to keep a high frame rate in the PlayStation's high resolution mode. Players have access to twelve different weapons, each named after a sign of the Chinese zodiac. The in-game soundtrack is techno, and much like SCEI's Vib-Ribbon, <em>iS</em> can dynamically change the environments based off of music from inserted CDs in certain modes. The game is very similar in terms of gameplay and style to Rez, and actually was released nearly 3 years earlier.</p>"},{"name":"Ishin no Arashi","year":1997,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-i/Ishin%20no%20Arashi%20%28Japan%29.chd","filesize":104867096,"score":"","genres":"Strategy > Top-down > Anime / Manga > Turn-based > Historical events","desc":"<p><em>Ishin no Arashi</em> is set during Bakumatsu period (around 1850 until the Meiji Restoration of 1867), the final stretch of the Japanese Edo period, which was a turbulent time, a time of great struggle between the supporters of the feudal shoguns, the rulers of the country, and the adherents of the Emperor, which eventually won and carried through the Meiji Restoration, turning Japan into a modern, powerful state. In <em>Ishin no Arashi</em> the player can choose one of the three major battles of Bakumastu period, and decide which leader will eventually propel Japan towards the Meiji era.</p><p>This strategy game is somewhat similar to the better-known  Romance of the Three Kingdoms series and other  historical simulation games by  the same company, but also differs from them by having much less complex diplomacy options and focusing the gameplay on navigation and individual encounters. Before beginning, the player chooses a general and customizes his parameters (stamina, attack power, charisma, knowledge). The player then controls the general with soldiers of his choice, navigating him on grids representing towns and countryside of Japan in turn-based fashion. The grids can be occupied by shops, schools (to train the general), friendly and hostile characters and groups. Battles, as well as negotiations and diplomatic procedures, are carried out automatically, and their outcome depends on the characters' statistics.</p>"},{"name":"ISS Pro Evolution","year":1999,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-i/ISS%20Pro%20Evolution%20%28Europe%29%20%28En%2CFr%2CDe%29%20%28EDC%29.chd","filesize":388707521,"score":7.9,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p>Before the Pro Evolution Soccer series, \"Seabass\" Takatsuka produced International Superstar Soccer Pro Evolution for the Playstation. The game includes a Master League, a club league of 16 teams including Man U, Arsenal, etc. The game has what you would except of soccer simulation, including an International League, &amp; Cup, &amp; not forgetting the European, African, The America's, &amp; Asian cups. </p>"},{"name":"ISS Pro Evolution 2","year":2001,"developer":"KCE Tokyo, Inc.","url":"psx-chd-roms-i/ISS%20Pro%20Evolution%202%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":427087897,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p>The second installment of the <em>ISS Pro Evolution</em> series, and the first ISS Pro game with a proper license (some players now have real names, like Beckham instead of Deckham).The game has an extended Master League, with two divisions and more clubs, as well as more international teams. Gameplay has also been changed to be smoother and more realistic.</p>"},{"name":"Itadaki Street: Gorgeous King","year":1998,"developer":"Tomcat System","url":"psx-chd-roms-i/Itadaki%20Street%20-%20Gorgeous%20King%20%28Japan%29%20%28Rev%201%29.chd","filesize":46876727,"score":"","genres":"Strategy > Top-down > Turn-based > Board game","desc":"<p><em>Gourgeous King</em> is the third title in the Itadaki Street series, and is essentially an expanded remake of Itadaki Street 2. Most of the characters and maps from the previous release have returned, along with eight new maps and a dozen new characters. The main new feature is a story mode called <em>Sugoroku Town</em>, which is based on the board game minigame from the Super Famicom version of Dragon Quest III, and the Official and Tournament modes from the previous edition also return.</p>"},{"name":"Italian Job, The","year":2001,"developer":"Pixelogic Limited","url":"psx-chd-roms-i/Italian%20Job%2C%20The%20%28Europe%29.chd","filesize":246737329,"score":6.6,"genres":"Racing / Driving > Behind view > Street racing > Vehicle simulator > Crime > Licensed","desc":"<p>Based on the 1969 British film <em>The Italian Job</em> starring Michael Caine, this third-person mission-based racing game offers 16 missions, 50 levels, five game modes, two \"free ride\" levels, and an eight-player party mode. With a simple four-key control scheme, you'll race as Charlie Croker across London, Turin, and the Alps in the main event, unlocking missions as you go, with an eye on the prize of a four million dollar gold bullion heist at journey's end. Fifteen vehicles are available in the The Italian Job, including three classic Mini-Cooper S cars, 4x4s, and a motor coach.</p><p>Gameplay involves finding shortcuts and eluding police and Mafia heavies through sewers, around city streets, and across rooftops, thwarting capture by keeping your license plate number hidden from your pursuers as you follow onscreen arrow prompts.</p>"}]