[{"name":"J. League Jikkyou Winning Eleven","year":1995,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/J.%20League%20Jikkyou%20Winning%20Eleven%20%28Japan%29%20%28Rev%201%29.chd","filesize":110960705,"score":"","genres":"Sports > Diagonal-down > Direct control > Football (European) / Soccer","desc":"<p>This is the first title in the J-League Jikkyō Winning Eleven series. Choose a Japanese club team, and then hit the field in the Exhibition or Full J-League season. No matter what mode you play, all of the rules of soccer apply: throw-ins, offsides, and penalties. For those who like to control every aspect of play, you can choose team strategies and formations. There is also multiplayer so you can challenge your friends to see who is the master of the soccer pitch.</p>"},{"name":"J. League Jikkyou Winning Eleven 3","year":1997,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/J.%20League%20Jikkyou%20Winning%20Eleven%203%20%28Japan%29.chd","filesize":142672604,"score":"","genres":"Sports > 3rd-person (Other) > Diagonal-down > Cinematic camera > Direct control > Football (European) / Soccer > Licensed","desc":"<p>The third installment in the <em>J. League Jikkyou</em> football/soccer series. As with the other games in the series, the game focuses entirely on Japanese soccer leagues and lets you choose a team and try your luck at various available cups, quick exhibition matches or leagues. All the expected gameplay elements of a soccer game are there, from various player moves and rules of the game to setting team formations and choosing teams to control and stadiums to play on. Live commentator is present, but doesn't comment on everything but only on key elements as well as addressing players by their actual names. Camera isn't fixed and adjusts during gameplay to best show the current action, switches to back view for free kicks and penalties, zooms out if the ball is too high to show both the kicker and the ball, and otherwise works as an action camera slightly rotating angles and using zoom automatically instead of just scrolling over the soccer field. Before engaging in a match with another player or the CPU, player can also do training with a selected team where only your team players are on the field where one can test all the moves and learn the ropes. Penalty kicks are also available for practice, but it includes two teams aiming to score five goals first.</p>"},{"name":"J.B. Harold: Blue Chicago Blues (Disc 1)","year":1995,"developer":"Althi Inc.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/J.%20B.%20Harold%20-%20Blue%20Chicago%20Blues%20%28Japan%29%20%28Disc%201%29.chd","filesize":433102656,"score":7.6,"genres":"Adventure > 1st-person > Full Motion Video (FMV) > Detective / mystery","desc":"<p>Following  Murder Club, this is another detective story about the fearless private investigator J.B. Harold. This time, an unknown woman in a red dress was murdered in Chicago. A female detective who began investigating the murder was killed as well, and this time the killer made it look like a suicide. J.B. Harold arrives in Chicago and now has to work together with the local police to solve the mystery.</p><p><em>J.B. Harold: Blue Chicago Blues</em> is an interactive movie. Most of the player's time is spent watching movie footage (with real actors and scenery). At certain points, the movie freezes, and the player is presented with a screen with two or more choices. Each choice advances the clock, so it is necessary to plan well in order not to run out of time and to successfully solve the case.</p>"},{"name":"J.B. Harold: Blue Chicago Blues (Disc 2)","year":1995,"developer":"Althi Inc.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/J.%20B.%20Harold%20-%20Blue%20Chicago%20Blues%20%28Japan%29%20%28Disc%202%29.chd","filesize":444389138,"score":7.6,"genres":"Adventure > 1st-person > Full Motion Video (FMV) > Detective / mystery","desc":"<p>Following  Murder Club, this is another detective story about the fearless private investigator J.B. Harold. This time, an unknown woman in a red dress was murdered in Chicago. A female detective who began investigating the murder was killed as well, and this time the killer made it look like a suicide. J.B. Harold arrives in Chicago and now has to work together with the local police to solve the mystery.</p><p><em>J.B. Harold: Blue Chicago Blues</em> is an interactive movie. Most of the player's time is spent watching movie footage (with real actors and scenery). At certain points, the movie freezes, and the player is presented with a screen with two or more choices. Each choice advances the clock, so it is necessary to plan well in order not to run out of time and to successfully solve the case.</p>"},{"name":"Jackie Chan Stuntmaster","year":2000,"developer":"Radical Entertainment Inc.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jackie%20Chan%20Stuntmaster%20%28Europe%29.chd","filesize":411790919,"score":6.8,"genres":"Action > Diagonal-down > Beat 'em up / brawler > Direct control > Contemporary > Comedy > Martial arts > Licensed","desc":"<p>Jackie's grandfather has been kidnapped. To rescue his grandfather, Jackie must find and deliver a package to the kidnappers.</p><p>The player takes control of Jackie Chan as he fights his way through fifteen levels within five different areas filled with thugs and goons. Luckily, Jackie is a Kung Fu master and has no problem with punches and kicks. He can also perform signature moves like running up walls, cartwheel kicks and even Drunken Master Kung Fu style. All of the moves are authenticated, thanks to the motion-captured sessions with Jackie Chan himself.</p><p>In addition to punches and kicks, potent objects such as chairs and brooms can also be used as weapons, just like in Jackie Chan movies. Should Jackie start to run low on health he can grab some milk, rice and even Chinese take-out food scattered throughout the levels for some health recovery.</p>"},{"name":"Jade Cocoon: Story of the Tamamayu","year":1998,"developer":"Genki Co., Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jade%20Cocoon%20-%20Story%20of%20the%20Tamamayu%20%28Europe%29.chd","filesize":376978642,"score":7.6,"genres":"Role-playing (RPG) > 3rd-person (Other) > Turn-based","desc":"<p>Levant is a young boy from a village Syrus. Long time ago the country was cursed by a powerful spirit. Since then the forests around Syrus are populated by monsters. Levant's father was a Cocoon Master - a hunter who could capture those monsters, purge their corrupted souls through holy powers and make them serve the people. But Levant's father disappeared long ago in the woods, and now it's Levant's turn to be the new Cocoon Master. On the day of his initiation, which is also the day he marries his lovely girlfriend Mahbu, he receives his first dangerous mission.</p><p><em>Jade Cocoon</em> is, at its core, a Pokémon-like monster-breeding RPG. You must fight monsters and capture them once they become weak enough. Then you have to experiment and to cross different kinds of monsters with each other, to obtain more powerful species which you can later use in battles. The battles themselves are typical turn-based ones, with several menu choices, such as \"Attack\", \"Defend\",\"Catch\" or \"Item\". The monsters are all visible.</p>"},{"name":"JailBreaker (Disc 1)","year":1999,"developer":"Highwaystar Co., Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/JailBreaker%20%28Japan%29%20%28Disc%201%29.chd","filesize":313429195,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p><em>Jailbreaker</em> is set in a grim totalitarian futuristic society, and stars a rather physically well-endowed red-headed female thief named Shlla (<em>sic</em>, according to the game's manual and cover art), who is sought by the authorities and is the only \"dangerous criminal\" who hasn't been caught yet. One night she attempts a robbery and fails; shortly thereafter, she is captured by the guards and put in prison. Once there, communication with inmates convinces her that something worse than just prison awaits them all... and she is the only one who can find a way to escape.</p><p><em>Jailbreaker</em> is primarily an adventure game. The gameplay mostly consists of exploring the prison and its surroundings, picking up clues, talking to characters to gain information, etc. There are no real puzzles in the game; most of the time it is just necessary to initiate certain conversations to trigger events or pick up specific items for later usage. There are also some action-based segments in the game, including a few combat sequences, situations which require quick movement, and timed events.</p><p>The game is done in real-time 3D, and is played from first-person perspective; it is possible to rotate the camera up and down, as well as side-step.</p>"},{"name":"JailBreaker (Disc 2)","year":1999,"developer":"Highwaystar Co., Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/JailBreaker%20%28Japan%29%20%28Disc%202%29.chd","filesize":430918485,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p><em>Jailbreaker</em> is set in a grim totalitarian futuristic society, and stars a rather physically well-endowed red-headed female thief named Shlla (<em>sic</em>, according to the game's manual and cover art), who is sought by the authorities and is the only \"dangerous criminal\" who hasn't been caught yet. One night she attempts a robbery and fails; shortly thereafter, she is captured by the guards and put in prison. Once there, communication with inmates convinces her that something worse than just prison awaits them all... and she is the only one who can find a way to escape.</p><p><em>Jailbreaker</em> is primarily an adventure game. The gameplay mostly consists of exploring the prison and its surroundings, picking up clues, talking to characters to gain information, etc. There are no real puzzles in the game; most of the time it is just necessary to initiate certain conversations to trigger events or pick up specific items for later usage. There are also some action-based segments in the game, including a few combat sequences, situations which require quick movement, and timed events.</p><p>The game is done in real-time 3D, and is played from first-person perspective; it is possible to rotate the camera up and down, as well as side-step.</p>"},{"name":"Jaleco Collection Vol. 1","year":2003,"developer":"NMK Co. Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jaleco%20Collection%20Vol.%201%20%28Japan%29.chd","filesize":1168953,"score":"","genres":"Compilation","desc":"<p>The <em>Jaleco Collection</em> contains seven NES classics:</p><ul><li>Argus</li><li>City Connection</li><li>Exerion</li><li>Field Combat</li><li>Formation Z</li><li>Ninja Jajamaru-kun</li><li>Yousei Monogatari RodLand</li></ul>"},{"name":"James Pond 2: Codename: RoboCod","year":2003,"developer":"Vectordean Ltd."},{"name":"Jarinko Chie: The Hanafuda","year":2001,"developer":"Yuki Enterprise"},{"name":"Jarrett & Labonte Stock Car Racing","year":2000,"developer":"The Codemasters Software Company Limited","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jarrett%20%26%20Labonte%20Stock%20Car%20Racing%20%28USA%29.chd","filesize":166016607,"score":8.3,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>The 3rd game from the successful Touring Car series.This game is bigger &amp; better, with instead of just the British touring car series, they have expanded the game, so you can compete in touring car championships from across Europe,The America's, Asia &amp; Australia. You can race in an exhibition race or participate in a realistic championship mode, where you choose a scenario, first of all you have to complete the testing session, similar to Gran Turismo. After that you are set a target to reach before the end of season. If you complete the target you unlock secret cars.</p>"},{"name":"Jeff Wayne's The War of the Worlds","year":1999,"developer":"Pixelogic Limited","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jeff%20Wayne%27s%20The%20War%20of%20the%20Worlds%20%28Europe%29.chd","filesize":391045365,"score":6.5,"genres":"Action > Behind view > Shooter > Vehicular combat > Sci-fi / futuristic > Steampunk > Licensed","desc":"<p>Martians Heat Rays Vs Human Artillery<br>Systematic Destruction Vs Ingenuity & Cunning<br>Based on the award winning, internationally best selling album by Jeff Wayne and the classic science fiction story by H.G.Wells, The War of The Worlds is a superb combination of explosive action and challenging strategy.<br>14 pre-set missions over 10 fantastic landscapes.<br>Take control of a number of different vehicles including: Anti Aircraft Trucks, Armoured lorries, Mortar Bikes, Iron Clad Ships, Observation Balloons, Airships, Mine Fields, Mobile Repair Trucks and Turrets. The player can switch between control of ALL of these when needed.<br>Collect materials throughout the environments to build different vehicles.</p>"},{"name":"Jellyfish: The Healing Friend","year":2000,"developer":"Visit Co., Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jellyfish%20-%20The%20Healing%20Friend%20%28Japan%29.chd","filesize":220246839,"score":"","genres":"Simulation > 3rd-person (Other) > Meditative / Zen > Life / social simulation > Menu structures > Contemporary","desc":"<p>Players step into the role of one of a few different people who become involved in jellyfish breeding. After picking their character, players bring their new jellies home and get started taking care of them. Detailed 3D jellyfish float freely in their tank, presented at a gentle pace with relaxing (\"healing\") music by Japanese band Gontiti. Players are given a wide variety of different ways to take care of their jellyfish, including feeding and other standard care techniques, and are able to breed their jellyfish over a long period of time.</p>"},{"name":"Jeopardy!","year":1998,"developer":"Artech Digital Entertainment, Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jeopardy%21%20%28USA%29.chd","filesize":369590473,"score":7.3,"genres":"Puzzle > 1st-person > Fixed / flip-screen > Game show / trivia / quiz > Licensed","desc":"<p>Based on the well known game show of the same name. The basic idea behind the game is that you are given a choice of categories, each with an answer to a question behind the square. Your job is to figure out the question that corresponds to the given answer (for example, the answer is Star Wars. The question would be: George Lucas' Trilogy?, or something like that.)</p><p>There are over 3500 answers to find questions to, in different game types including Tournament, Speed Match and Single Round. And in every case, Alex Trebek (the host) is there to tell you if you are right or wrong.</p>"},{"name":"Jeopardy! 2nd Edition","year":2000,"developer":"Artech Digital Entertainment, Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jeopardy%21%202nd%20Edition%20%28USA%29.chd","filesize":505258373,"score":6.2,"genres":"Puzzle > Game show / trivia / quiz > Licensed","desc":"<p>The next edition of this version of Jeopardy!. </p><p>The Game modes include a Normal game, a Solo game, a Tournament of Champions, and a Contestant Exam.</p><p>In the normal game, 3 contestants compete against each other in a game show, trying to supply the question for answers in several different categories. Each correct answer the player gives earns them money, while giving an incorrect answer will cost them money. The player with the most money at the end of the game is deemed the winner. The solo game is the same as the normal game, except that it's just the player competing against no other contestants.</p><p>The Tournament of Champions is for players who've won five games or accumulated more than $75,000. In this mode, the answers and questions are more difficult.</p><p>The Contestant Exam gives the player a sample of the exams a contestant who wants to be on the real show has to take.</p><p>The game keeps track of the player's career statistics. Tracked stats include the number of games won and lost, the total winnings, the best and worst score, the player's best jeopardy, double jeopardy, &amp; final jeopardy amount, the number of tournament wins, and the number of right &amp; wrong answers.</p><p>The game also offers some behind the scenes videos for the player to view.</p><p>Options include setting the amount time to buzz-in, the amount of time to respond, setting the spelling accuracy to be either more strict or loose, and setting the computer opponent's IQ to either easy, medium, or hard.</p>"},{"name":"Jeremy McGrath Supercross 2000","year":2000,"developer":"Acclaim Studios Salt Lake City","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jeremy%20McGrath%20Supercross%202000%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":141364261,"score":5.4,"genres":"Racing / Driving > Sports > Behind view > Motorcycle > Off-roading > Licensed","desc":"<p>This edition of the licensed Supercross racing game features 8 indoor and 8 outdoor tracks. You can choose to do a single race on an individual track, or do a championship series on the indoor tracks, the outdoor tracks, or both. Additionally, there is a Time Trial mode, plus the Freestyle mode, where you can ride around in a skate-park like area performing tricks for points.</p><p>The game features at least 8 real riders (depending on platform), plus the ability to combine outfit, bike and riding number to create a Custom Rider. 125cc and 250cc classes of motorcycle are featured. Races and Freestyle mode can be played with two players, via a split screen. A Track Editor is also featured, allowing you to create your own custom designed tracks.</p>"},{"name":"Jeremy McGrath Supercross 98","year":1998,"developer":"Atod AB","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jeremy%20McGrath%20Supercross%2098%20%28Europe%29.chd","filesize":379522925,"score":6.9,"genres":"Racing / Driving > Sports > Behind view > Direct control > Motorcycle > Off-roading > Track racing > Licensed","desc":"<p>Jeremy McGrath lends his name to this Supercross racing game. Game modes include a Racing Season, Single Race, and a Ghost Racing mode.</p><p>The Racing Season mode involves the player racing against 5 opponent racers on a number of indoor or outdoor tracks trying to get first place. The higher the position the racer finishes the race, the more points that racer will earn (1st place = 5pts., 2nd = 4pts., etc...). Players have to earn a certain number of points in a series of races in order to move on to tougher competition. If the player becomes really proficient, they'll then be able to challenge Jeremy McGrath himself for the championship.</p><p>Getting far in this mode will also unlock more bikes. The various motorcycles available have different statistics in engine power, tire grip, and handling. Players can choose to race with either auto or manual transmission.</p><p>The Single Racing mode lets the player race alone, with opponents, or against another player. Players get to select from 7 different tracks and can also race on reversed versions of those tracks. Ghost Racing lets the player compete against a ghost racer who represents the player's best time on a track.</p><p>The game also includes a track editor. Players can place various jumps, hairpin turns, and other types of track features and create their own track to race on.</p>"},{"name":"Jersey Devil","year":1997,"developer":"Behaviour Interactive","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jersey%20Devil%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":430008651,"score":7.1,"genres":"Action > Behind view > Platform > Direct control > Fantasy","desc":"<p>Jersey City is in trouble when evil Dr. Knarf and his pumpkin headed-assistant Dennis, rule. Dr. Knarf creates evil mutant vegetables that run amok within the city. And only the famous devil can now save the city .</p><p>The game's theme is Halloween, and the objective is to catch Dr. Knarf. The player will need to open \"K\" Locks using color keys with letters \"K\" \"N\" \"A\" R\" and \"F\" (which makes Knarf). Every area in Jersey City has two levels, each with its own boss (or bosses). These areas include the Art Museum, the City Park, the Graveyard, the Factory, the Seaport and Knarf's own forest. </p><p>The player can also free the hostages that were captured by Knarf's army (including children). Nitro Crates can be picked up to enhance the devil's strength. For a 100% game completion the player needs to beat all areas, find and beat all secret levels, free all hostages, destroy all nitro crates in all levels, and collect the golden Knarf tokens from all levels.</p>"},{"name":"Jet Ace","year":2004,"developer":"Na.p.s. Team s.n.c.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jet%20Ace%20%28Europe%29.chd","filesize":13228627,"score":"","genres":"Action > Behind view > Flight / aviation > Contemporary","desc":"<p><em>Jet Ace</em> is a single player 3D shoot 'em up game where you take control of a Jetfighter trying to fight of enemy aircrafts. The game is very similar to Silent Iron.</p><p>The game offers thirteen missions in which you have to shoot down enemy aircrafts with either bullets or missiles while trying to avoid enemy fire. Both bullets and missiles will deplete as will your fuel. Fuel and ammunition can be replenished during missions by flying through a green ring saying fuel or bullets. You start the game with three lives and shooting down enemies earns you points for a high score, sometimes bonus points can be collected by flying through a green ring saying the number of points.</p>"},{"name":"Jet de GO!","year":2000,"developer":"Racdym","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jet%20de%20Go%21%20Let%27s%20Go%20by%20Airliner%20%28Japan%29.chd","filesize":421793684,"score":"","genres":"Simulation > 1st-person > 3rd-person (Other) > Flight / aviation","desc":"<p><em>Jet de GO!</em> is a spin-off from the famous Densha de GO! series by Taito. Instead of trains, this title focus exclusively on flying planes. Players can take off and land with a J-31 business jet, a mid-range Boeing 767 or a long haul Boeing 747. The game modes include Flight mode, Cruise mode and Lesson mode.</p>"},{"name":"Jet Moto","year":1996,"developer":"SingleTrac Entertainment Technologies, Inc.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jet%20Moto%20%28USA%29.chd","filesize":262958856,"score":6.9,"genres":"Racing / Driving > Behind view > Arcade > Sci-fi / futuristic","desc":"<p>In this arcadelike, futuristic racer, you pilot your moto/hoverbike against 19 other racers in a free-flying, chaotic race across diverse tracks to the finish line. Developed by SingleTrac and published by SCEA.</p>"},{"name":"Jet Moto 2","year":1998,"developer":"SingleTrac Entertainment Technologies, Inc.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jet%20Moto%202%20%28USA%29.chd","filesize":359410608,"score":"","genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Naval / watercraft > Sci-fi / futuristic","desc":"<p><em>Jet Moto 2</em> (seen in game as <em>Jet Moto 2: Championship Edition</em>) is an updated Greatest Hits re-release of the 1997 sequel. In this version, all tracks are unlocked from the start, the number of racers has been reduced from 10 to 4 and the frame rate has been increased to 30 frames per second.</p>"},{"name":"Jet Moto 3","year":1999,"developer":"Pacific Coast Power and Light","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jet%20Moto%203%20%28USA%29.chd","filesize":338817465,"score":6.9,"genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Naval / watercraft > Sci-fi / futuristic","desc":"<p>The third entry in the Jet Moto series once again places you in the driving seat of a futuristic hoverbike, racing at breakneck speed in a truly extreme sport. While a Jet Moto hoverbike might look like a jet ski, it is capable of far more: it travels across land as well as water and can use a magnetic grapple to make extremely tight turns. During a race, drivers must skillfully time jumps, dodge obstacles, and contend with some feisty opponents who won't hesitate to bump you into a tree or maybe even knock you off a cliff.</p><p>Jet Moto 3 offers ten different riders and 19 tracks across the wide open ocean, over mountainous terrain, and through cityscapes. As with the earlier games, two people can still race in a split-screen mode.</p>"},{"name":"Jetracer","year":2000,"developer":"TheyerGFX Pty Ltd","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jetracer%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":162438923,"score":"","genres":"Action > Sports > 3rd-person (Other) > Sailing / boating > Surfing","desc":"<p><em>Jetracer</em> is a one or two player game, four with multitap, in which players compete in performing tricks on jet skis.</p><p>There are three modes of play all of which are basically the same.  </p><p>Freeride - where the player(s) can practice in any location on any machine<br>Extreme Trick - where players compete in a match at any location on any machine  </p><p>Rider Championship - where players compete in a series of matches at different locations, this mode has a choice of skill settings.</p><p>The players can choose between eight riders, four machines, and four locations. There is no 'create your own rider' function nor can the machines be customised. <br>Matches are played against other riders, if there is only one human player then the game provides three other riders to play against otherwise it's a player v player game. The players take it in turns to catch a wave and perform tricks such as cutbacks, big 720°, barrel riding etc. These are scored on the degree of difficulty and the process is repeated as many times as possible during the match time with just the best three scores being totalled to find the winner. Match time can vary between ten and forty minutes</p>"},{"name":"Jewel BEM Hunter Lime with Paint Maker","year":1997,"developer":"Silence"},{"name":"Jewels of the Oracle","year":1996,"developer":"ELOI Productions"},{"name":"Jigsaw Island: Japan Graffiti","year":1996,"developer":"Nippon Ichi Software, Inc.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jigsaw%20Island%20-%20Japan%20Graffiti%20%28Japan%29.chd","filesize":212554228,"score":"","genres":"Puzzle > Anime / Manga > Real-time > Cards / tiles","desc":"<p><em>Jigsaw Island</em> is a jigsaw puzzle game, and the third title in Nippon Ichi's jigsaw series. As in <em>Jigsaw Party</em> and <em>Jigsaw World</em>, it combines the jigsaw puzzle with elements of arcade puzzle games, tasking two players (or a player and the computer) with solving a set of puzzles as quickly as possible. Pieces are supplied to each player in a specific order, and there are also power-ups that can be used to hinder the other player.</p><p>The main story mode follows two young girls from the Japonese Kingdom, Asuka and Akira, as they try to improve their rank at their school's Puzzle Association, battling against other students and eventually teachers. There are also two different battle modes for up to four players.</p><p>In addition to the battle modes, there is also a regular puzzle mode for one player. There are 150 puzzles total, including both photographs and illustrations, each of which can be played as either a 24, 96, or 150 piece puzzle.</p><p>The international release, Jigsaw Madness, removed the story mode, leaving only the battle and solo modes.</p>"},{"name":"Jigsaw Madness","year":2002,"developer":"Nippon Ichi Software, Inc.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jigsaw%20Madness%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":278234327,"score":"","genres":"Puzzle > Real-time > Cards / tiles","desc":"<p><em>Jigsaw Madness</em> is the international release of Jigsaw Island: Japan Graffiti. It includes all of the standard modes from the original game, including the 4-player battle and single-player free modes, but does not include the story mode from the original release.</p>"},{"name":"Jigsaw World","year":1995,"developer":"Nippon Ichi Software, Inc.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jigsaw%20World%20%28Japan%29.chd","filesize":13456938,"score":"","genres":"Puzzle > Real-time > Cards / tiles","desc":"<p><em>Jigsaw World</em> is a jigsaw puzzle game, and the sequel to Jigsaw Party. Much like its predecessor, it combines the jigsaw puzzle with elements of arcade puzzle games, tasking two players (or a player and the computer) with solving a set of puzzles as quickly as possible. Pieces are supplied to each player in a specific order, and there are also power-ups that can be used to hinder the other player.</p><p>The main attraction is the <em>Alice in Jigsaw Land</em> story mode, a parody of Lewis Carrol's famous novel, in which the player controls Alice as she competes against a variety of characters in jigsaw puzzle battles.</p><p>In addition to the battle modes, there is also a regular puzzle mode for one player. There are over 100 puzzles, including both photographs and illustrations, each of which can be played as either a 24, 96, or 150 piece puzzle.</p>"},{"name":"Jikkyō Oshaberi Parodius","year":1996,"developer":"Konami Co., Ltd."},{"name":"Jikū Tantei DD 2: Hangyaku no Apsalar (Disc 1)","year":1998,"developer":"System Sacom","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jikuu%20Tantei%20DD%202%20-%20Hangyaku%20no%20Apusararu%20%28Japan%29%20%28Disc%201%29.chd","filesize":307310183,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Fantasy > Sci-fi / futuristic > Detective / mystery","desc":"<p><em>Hangyaku no Apsalar</em> is a sequel to Maboroshi no Lorelei, but the gameplay and graphics style are completely different. While the first Dracula Detective game uses 3D pre-rendered graphics and plays as an interactive movie, this sequel uses 2D graphics, anime art, and one progresses by reading through the dialogues (of which not all are voice-acted) in a similar manner to visual novels.</p><p>The story takes place in the 23rd century where people can freely use time travel to go back to the past. But altering the past or smuggling long lost things back to the present can yield serious consequences, and for that purpose a special police task force has been created to enforce the law and protect the present timeline from criminals trying to alter or affect it in any way. The protagonist of the story is Raizou Narukami (鳴神 雷蔵), also known as Dracula Detective due to being a descendant of the legendary vampire Dracula from Transylvania. Those very genes give him certain special powers and help him in his task as a detective, no matter how difficult the cases that are waiting.</p>"},{"name":"Jikū Tantei DD 2: Hangyaku no Apsalar (Disc 2)","year":1998,"developer":"System Sacom","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jikuu%20Tantei%20DD%202%20-%20Hangyaku%20no%20Apusararu%20%28Japan%29%20%28Disc%202%29.chd","filesize":340931483,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Fantasy > Sci-fi / futuristic > Detective / mystery","desc":"<p><em>Hangyaku no Apsalar</em> is a sequel to Maboroshi no Lorelei, but the gameplay and graphics style are completely different. While the first Dracula Detective game uses 3D pre-rendered graphics and plays as an interactive movie, this sequel uses 2D graphics, anime art, and one progresses by reading through the dialogues (of which not all are voice-acted) in a similar manner to visual novels.</p><p>The story takes place in the 23rd century where people can freely use time travel to go back to the past. But altering the past or smuggling long lost things back to the present can yield serious consequences, and for that purpose a special police task force has been created to enforce the law and protect the present timeline from criminals trying to alter or affect it in any way. The protagonist of the story is Raizou Narukami (鳴神 雷蔵), also known as Dracula Detective due to being a descendant of the legendary vampire Dracula from Transylvania. Those very genes give him certain special powers and help him in his task as a detective, no matter how difficult the cases that are waiting.</p>"},{"name":"Jikū Tantei DD: Maboroshi no Lorelei (Disc 1)","year":1996,"developer":"System Sacom","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jikuu%20Tantei%20DD%20-%20Maboroshi%20no%20Lorelei%20%28Japan%29%20%28Disc%201%29%20%28Rev%201%29.chd","filesize":477180748,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Sci-fi / futuristic > Detective / mystery","desc":"<p><em>Jikuu Tantei DD</em> is a detective noir adventure game with a futuristic setting. The game is one big cinematic drama which plays as an interactive movie (think Cyberia). The story takes place aboard a zeppelin ship Lorelei. In 2238 human race got the freedom to use the ability to travel back in time, which eventually led to the emergence of crime. You are a Raizou Narukami, a detective who runs an agency that specializes in space-time crimes. Womanizer at first glance, you are very skilled at what you do, namely in power of observation, reasoning and deduction. You are known as DD (short for Dracula Detective) because your are a direct descendant of legendary Dracula. Due to your genes, you also exert some superhuman powers and abilities.</p>"},{"name":"Jikū Tantei DD: Maboroshi no Lorelei (Disc 2)","year":1996,"developer":"System Sacom","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jikuu%20Tantei%20DD%20-%20Maboroshi%20no%20Lorelei%20%28Japan%29%20%28Disc%202%29%20%28Rev%201%29.chd","filesize":508626139,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Sci-fi / futuristic > Detective / mystery","desc":"<p><em>Jikuu Tantei DD</em> is a detective noir adventure game with a futuristic setting. The game is one big cinematic drama which plays as an interactive movie (think Cyberia). The story takes place aboard a zeppelin ship Lorelei. In 2238 human race got the freedom to use the ability to travel back in time, which eventually led to the emergence of crime. You are a Raizou Narukami, a detective who runs an agency that specializes in space-time crimes. Womanizer at first glance, you are very skilled at what you do, namely in power of observation, reasoning and deduction. You are known as DD (short for Dracula Detective) because your are a direct descendant of legendary Dracula. Due to your genes, you also exert some superhuman powers and abilities.</p>"},{"name":"Jim Henson's Bear in the Big Blue House","year":2002,"developer":"DC Studios, Inc.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jim%20Henson%27s%20Bear%20in%20the%20Big%20Blue%20House%20%28Europe%29.chd","filesize":167726365,"score":"","genres":"Action > Licensed","desc":"<p>Based on the TV show of the same name, <em>Bear in the Big Blue House</em> invites players to Ojo's birthday party. The goal is to help Ojo find her presents. To do so, the player must participate in eleven mini-games, each having two difficulty levels. There are two ways to explore and play, Adventure Mode and Activity Mode. The game is aimed at younger players.</p>"},{"name":"Jim Henson's The Hoobs","year":2002,"developer":"Runecraft Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jim%20Henson%27s%20The%20Hoobs%20%28Europe%29.chd","filesize":143203417,"score":"","genres":"Action > Educational > Puzzle > 2D scrolling > Fixed / flip-screen > Arcade > Cards / tiles > Mini-games > Paddle / Pong > Direct control > Ecology / nature > Licensed","desc":"<p>HOOB! HOOB! HOORAY!THE HOOBS ARE HERE TO PLAY!!!<br>Hop aboard the Hoobmobile with Iver, Tula and Groove and set off on a journey of exploration and discovery, music, dance and FUN.<br>Visit the icy arctic, the wild jungle, the rugged mountains, the sandy beach and the Hoobygroovy barnyard.<br>Play fifteen mini-games including Hide and Seek, Matching Pairs and Feed the Chickens.<br>Interact with Hoobloads of Tiddlypeeps to help Hoobs discover the answer to the question of the day.<br>PARENTS (Peeps): this Hoobashious game is both entertaining and educational, and not just for you, but for your Tiddlypeeps too! Hoobletoodledoo!</p>"},{"name":"Jimmy Johnson's VR Football '98","year":1997,"developer":"Padded Cell Studios","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jimmy%20Johnson%27s%20VR%20Football%20%2798%20%28USA%29.chd","filesize":506899304,"score":"","genres":"Sports > Football (American) > Licensed","desc":"<p>Coach Jimmy Johnson lends his likeness and advice to this football simulation from VR sports.  Using official 1997 NFL rosters and play books, VR Football ’98 focuses on accessibility with one touch play calling and an original pass control system.  Play customization, season management and player creation are among the standard features you’ll find in VR Football.  Unique features include halftime motivational speeches and critiques of your performance from coach Johnson.</p>"},{"name":"Jimmy White's 2: Cueball","year":2000,"developer":"Awesome Studios","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jimmy%20White%27s%202%20-%20Cueball%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":137162255,"score":6.9,"genres":"Simulation > Sports > 1st-person > Pool / snooker > Licensed","desc":"<p>Licensed by snooker player Jimmy White, this game is a simulation of not only the British game of snooker, but also of the three main variations of pool.</p><p>The game is viewed in detailed 3D, allowing you to rotate the table at all angles, either from overhead or using the cue position as a base. Taking a shot involves setting the exact pace and spin of it, and considering what each contact will do to the position of the cue ball, and any balls you may wish to pot afterwards. In the snooker mode playing accurate 'safety' shots (to prevent your opponent scoring) becomes important as well.</p><p>In each mode there are 10 computer opponents, and matches can consist of up to 9 frames. A trick-shot editor is also included, allowing you to practice shots and set up challenges. Replays and an undo mode are also included.</p><p>Bonus games are included as well - darts, draughts, a fruit machine, and even a remake of Dropzone, a Commodore 64 game from the same programmer.</p>"},{"name":"Jinx","year":2003,"developer":"HammerHead Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jinx%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":78536937,"score":6.4,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements","desc":"<p>Jinx is a 3D platformer for the Playstation in the vein of other 3D platformers like  Spyro. The main character Jinx, a court jester, is tasked with finding and rescuing the royal family he works for since it has been kidnapped by Gripply the Pirate King, leaving the realm into a state of chaos. The player has to traverse various different worlds and locations in pursuit of Gripply, while facing a number of enemies, solving puzzles and collecting items. The graphics are notable for being very colorful.</p>"},{"name":"Johnny Bazookatone","year":1996,"developer":"Arc Developments","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Johnny%20Bazookatone%20%28Europe%29.chd","filesize":246392036,"score":6.5,"genres":"Action > Side view > 2D scrolling > Platform > Shooter","desc":"<p>The original guitar hero with the Elvis attitude and purple hair pompadour, Johnny Bazookatone, has been imprisoned in the year 2050 in Sin Sin Prison by El Diablo, the Lord of the Underworld, who is jealous of his talent and kidnaps other musical legends as well in this 3D side-scrolling platformer.  Johnny's guitar Anita has been taken from him and he sets out to escape and vanquish foes on his way to be reunited with Anita. </p><p>He can perform moves such as 360-degree spin jumps and hover jumps, among others, while using his bazooka guitar as a weapon.  When powered up, it can emit a special sonic blast that fries anything within hearing range. As you make your way through the demonic levels such as Hotel Demonique, Hell's Kitchen, and Mr. Diablo's fiery Penthouse, you can acquire more weapons, power-ups and find secret passages that lead to bonus levels. The game's soundtrack includes the title track contributed by Bon Jovi guitarist Richie Sambora and Tico Torres.</p>"},{"name":"JoJo's Bizarre Adventure","year":1999,"developer":"Capcom Co., Ltd."},{"name":"Jonah Lomu Rugby","year":1998,"developer":"Rage Games Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jonah%20Lomu%20Rugby%20%28Europe%29%20%28En%2CDe%2CEs%2CIt%29.chd","filesize":158497456,"score":7.4,"genres":"Sports > 3rd-person (Other) > Rugby > Licensed","desc":"<p>Based on the 1995 Rugby World Cup in South Africa and officially licenced by player of the tournament Jonah Lomu, this game plays as more of an arcade style of gameplay rather than a sports simulation. Players can compete in the full World Cup, a round-robin league, or a knock-out cup.</p><p>The 32 included teams range from the All Blacks of New Zealand and Springboks of South Africa to minnows such as Namibia and Hong Kong, neither of which qualified for the final stages.</p>"},{"name":"Judge Dredd","year":1997,"developer":"Gremlin Interactive Limited","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Judge%20Dredd%20%28Europe%29.chd","filesize":456897577,"score":6.1,"genres":"Action > 1st-person > Video backdrop > Arcade > Rail shooter > Shooter > Cyberpunk / dark sci-fi > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>Trouble in Mega-City One: An unidentified perpetrator has taken hostages, including the mayor. Attempts to apprehend him have already led to the loss of 17 Judges. He states that only one man is allowed to come near: Judge Dredd. There's obviously some history between them. It's time for the toughest lawman of them all to move in and dispense justice via his Lawgiver gun.</p><p>Gremlin's <em>Judge Dredd</em> is an 'on rails' lightgun shooter based on the original comics instead of the 1995 movie. The action moves through pre-rendered environments on a fixed path. 14 levels spread over 4 stages must be cleared of lawbreakers. </p><p>Most enemies are polygonal 3D models overlaid over the video backdrop, but the background can also be shot at: gun turrets and some bosses like hovertanks and other heavy machinery are pre-rendered objects. Powerups are hidden in the scenery as well: there are different ammunition types for the Lawgiver, including rapid fire and heat-seekers. Also available are medikits, extra lives and rockets which can clear the screen of enemies.</p><p>Not everything on the screen should be shot at, however: sometimes, innocent citizens will cross the scene. Hitting too many of them means a quick 'game over'.</p><p>The storyline of the game is told between levels via live-action cutscenes.</p>"},{"name":"Juggernaut (Disc 1)","year":1998,"developer":"Will Co., Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Juggernaut%20%28USA%29%20%28Disc%201%29.chd","filesize":499956042,"score":"","genres":"Adventure > 1st-person > Puzzle elements > Horror","desc":"<p><em>Juggernaut</em> is a 3-disc point-and-click adventure using pre-rendered CG movie clips and stills. Gameplay takes place inside the cursed soul of the main character's girlfriend, who must work to free her from demonic possession. The location of her psyche is license to create surreal environments and challenges.</p><p>Starting on an island and moving on to a mansion, each location (the Forest of Vengeance, Illusion Island, etc) represents a part of the girl's mind. Gameplay is focused on solving puzzles. In the mansion area for instance, the player must switch between forms as needed. In spirit form, the main character is able to travel through keyholes, but for every physical act, a different form or shell is needed. The player must choose which form to use at which time - the body of an adult can perform certain tasks, while the body of a child can get to places others can't. </p><p>It is possible to collect a number of items and use these on the environment, but the amount of items is always limited. Other puzzles are about memorizing sound and visual patterns.</p>"},{"name":"Juggernaut (Disc 2)","year":1998,"developer":"Will Co., Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Juggernaut%20%28USA%29%20%28Disc%202%29.chd","filesize":497097121,"score":"","genres":"Adventure > 1st-person > Puzzle elements > Horror","desc":"<p><em>Juggernaut</em> is a 3-disc point-and-click adventure using pre-rendered CG movie clips and stills. Gameplay takes place inside the cursed soul of the main character's girlfriend, who must work to free her from demonic possession. The location of her psyche is license to create surreal environments and challenges.</p><p>Starting on an island and moving on to a mansion, each location (the Forest of Vengeance, Illusion Island, etc) represents a part of the girl's mind. Gameplay is focused on solving puzzles. In the mansion area for instance, the player must switch between forms as needed. In spirit form, the main character is able to travel through keyholes, but for every physical act, a different form or shell is needed. The player must choose which form to use at which time - the body of an adult can perform certain tasks, while the body of a child can get to places others can't. </p><p>It is possible to collect a number of items and use these on the environment, but the amount of items is always limited. Other puzzles are about memorizing sound and visual patterns.</p>"},{"name":"Juggernaut (Disc 3)","year":1998,"developer":"Will Co., Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Juggernaut%20%28USA%29%20%28Disc%203%29.chd","filesize":486606960,"score":"","genres":"Adventure > 1st-person > Puzzle elements > Horror","desc":"<p><em>Juggernaut</em> is a 3-disc point-and-click adventure using pre-rendered CG movie clips and stills. Gameplay takes place inside the cursed soul of the main character's girlfriend, who must work to free her from demonic possession. The location of her psyche is license to create surreal environments and challenges.</p><p>Starting on an island and moving on to a mansion, each location (the Forest of Vengeance, Illusion Island, etc) represents a part of the girl's mind. Gameplay is focused on solving puzzles. In the mansion area for instance, the player must switch between forms as needed. In spirit form, the main character is able to travel through keyholes, but for every physical act, a different form or shell is needed. The player must choose which form to use at which time - the body of an adult can perform certain tasks, while the body of a child can get to places others can't. </p><p>It is possible to collect a number of items and use these on the environment, but the amount of items is always limited. Other puzzles are about memorizing sound and visual patterns.</p>"},{"name":"Jumping Flash!","year":1995,"developer":"Exact","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jumping%20Flash%21%20%28Europe%29.chd","filesize":272808833,"score":7.8,"genres":"Action > 1st-person > Anime / Manga > Platform > Shooter","desc":"<p><em>Jumping Flash</em> is a first-person 3D action platformer where the player must use their triple-jump and special weapons to defeat enemies.</p><p>The story goes like this: the evil Baron Aloha and his minions the Muu-Muus have stolen all of the Earth's greatest locations to use to construct his own private retreat. It's up to the player as Commander Robbit the robotic super-bunny to save the world and stop Baron Aloha.</p><p>The player begins with 3 lives and an additional life is given when 1 million points are achieved. There are 18 main levels to explore in 6 worlds. Boss fights take place in the final level of each world. There are also some hidden bonus worlds in the game. Once a level has been completed a time attack mode for it is unlocked.</p>"},{"name":"Jumping Flash! 2","year":1996,"developer":"MuuMuu Co., Ltd.","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jumping%20Flash%21%202%20%28Europe%29.chd","filesize":274164196,"score":7.5,"genres":"Action > 1st-person > Platform","desc":"<p>Just like in the predecessor you jump around a 3D scenery and try to find all the Muumuus hidden in each level.</p><p>You'll once again go through big levels with some huge structures reaching into the skies with floating platforms and loads of shooting enemies. Luckily you're armed too, so prepare for some really thrilling jump and run action along with a lot of shooting.</p>"},{"name":"JumpStart Wildlife Safari: Field Trip","year":2001,"developer":"Digital Illusions Canada, Inc."},{"name":"Jun Classic C.C. & Rope Club","year":1998,"developer":"T&E Soft, Inc."},{"name":"Jungle Park","year":1998,"developer":"Saru Brunei","url":"jikuu-tantei-dd-maboroshi-no-lorelei-japan-disc-2-rev-1/Jurassic%20Park%20-%20The%20Lost%20World%20%28USA%29%20%28Demo%29.chd","filesize":46926522,"score":"","genres":"Adventure > Full Motion Video (FMV) > Point and select","desc":"<p><em>Jungle Park</em> is a point and click adventure game that invites the player to explore the titular park. More a walking simulator than a traditional adventure game, it has few goals and instead lets the player discover the park and its surroundings at their own pace.</p>"}]