[{"name":"K-1 Grand Prix","year":1999,"developer":"Daft Co., Ltd.","url":"psx-chd-roms-k/K-1%20Grand%20Prix%20%28Europe%29.chd","filesize":357122521,"score":5.7,"genres":"Sports > Boxing > Martial arts > Licensed","desc":"<p><em>K-1 Grand Prix</em> is a kickboxing game featuring 32 real K-1 fighters.</p><p>The game features a 1 player K-1 Kings mode, where the player picks a fighter and faces off against a series of computer controlled fighters, and another mode which is the 2 player K-1 Hercules mode. There is also the K-1 Grand Prix mode which has 16 fighters competing in a tournament to be the K-1 champion.</p><p>The K-1 Challenge lets the player create a fighter. Players get to choose their fighters build type, skin color, color of their trunks, nationality, and a gym to train at which best reflects the fighting style they want. Players get to choose a trainer and 2 sub trainers to help condition them to become a fighting machine. To condition, the player selects a variety of exercises like jumping rope or using a medicine ball for their fighter to train in. Training builds up the fighters statistics and also earns them training points which can then be spent on moves such as uppercuts and hooks. Eventually after training for a while, the player will be challenged by a rival and they can choose to accept the challenge or decline if they feel they aren't ready yet and need more training. This mode takes the player's fighter through 8 years of his career trying to become a K-1 champion.</p><p>Training mode lets the player practice their moves with a sparring partner.Finally, the Ring Side mode lets the player observe a match between 2 computer controlled fighters.</p><p>Gameplay consists of two opponents in a boxing ring throwing punches and kicks at each other, trying to knock each other to the canvas.</p><p>Options include setting the number of rounds, the number of downs, how fast the rounds are, whether to have English or Japanese voice types, the difficulty level of the opponent fighters, and whether to turn vibration on or off.</p>"},{"name":"K-1 Revenge","year":1997,"developer":"Daft Co., Ltd.","url":"psx-chd-roms-k/K-1%20Revenge%20%28USA%29.chd","filesize":351730992,"score":"","genres":"Action > Sports > 3rd-person (Other) > Boxing > Martial arts > Licensed","desc":"<p><em>K-1 Revenge</em> brings together several practitioners of various martial arts such as kick boxing and karate and lets them fight each other to determine who the best fighter in the world is. The game contains 14 actual K-1 fighters and also 4 unlockable ones. In the game, each fighter's skills are rated by their speed, stamina, and power and each fighter also has two special arts; for example, an axe kick or a right hook.</p><p>The game contains a one player mode, a versus mode, a tournament mode, a team battle mode, and a training mode.</p><p>The one player mode has the player fight against several computer fighters, while the versus mode lets the player fight another player. The tournament mode lets the player set up a tournament between 8 fighters to determine the champion. The team battle mode lets the player choose three fighters to fight as a team against the computer's or another player's team. The training mode let's practice each fighter's moves.</p><p>The game also lets the player setup the computers artificial intelligence level.</p><p>Gameplay consists of two fighters inside a ring trying to knockout each other within three rounds by using various martial arts. If no one is knocked out by then, the fight is decided by a decision which is calculated by the score each fighter received. The score is derived from how well each fighter performed throughout the entire fight.</p><p>Players have to pay attention to three different meters while fighting.A life gauge for that measures physical strength; a stamina gauge that decreases as each fighter uses a move; and a knockdown gauge to show the amount of damage each fighter has received.</p>"},{"name":"K-1 The Arena Fighters","year":1996,"developer":"Daft Co., Ltd.","url":"psx-chd-roms-k/K-1%20The%20Arena%20Fighters%20%28Europe%29.chd","filesize":310560553,"score":6.1,"genres":"Sports > 3rd-person (Other) > Boxing > Martial arts > Licensed","desc":"<p><em>K-1 The Arena Fighters</em> is a kickboxing game featuring 8 real world K-1 fighters.</p><p>The game features a 1 player mode, a 2 player VS. mode, a Tournament mode featuring all 8 fighters, and a Team Battle mode.</p><p>The team battle has 2 teams made up of 3 fighters each facing off against each other in one on one fights. The first team to win 2 out of 3 matches wins the entire team battle.</p><p>Gameplay consists of two fighters in a boxing ring using high and low punches and kicks to down their opponent. Each fighter can also use their special signature move to hurt their opponent. Each fighter has two meters, one for strength and one for stamina. So the more punches and kicks that are thrown, the less amount of power they start to pack. This means the player is rewarded for timing their attacks because their attacks will be more effective. Also, a well placed hit on their opponent can lead to a flash knock down, which instantly drops the opponent to the canvas.</p>"},{"name":"K9.5 1: Live in Airedale","year":1998,"developer":"Lightspan, Inc.","url":"psx-chd-roms-k/K9.5%201%20-%20Live%20in%20Airedale%20%28USA%29.chd","filesize":157116759,"score":"","genres":"Educational > Fixed / flip-screen > Mini-games > Direct control > Point and select > Reading / writing","desc":"<p>Get ready to rock! Your child will gain essential reading and language arts skills while helping Ella and Gershwyn, founding members of the rock group K9.5, find their lost instruments.</p>"},{"name":"K9.5 2: We Are the Dogs","year":1997,"developer":"Lightspan, Inc.","url":"psx-chd-roms-k/K9.5%202%20-%20We%20Are%20the%20Dogs%21%20%28USA%29.chd","filesize":106882392,"score":"","genres":"Educational > Fixed / flip-screen > Point and select > Geography > Reading / writing","desc":"<p>Listen to that guitar! Check out that keyboard finger work! Dig the rhythm of those drums! Your child will learn valuable reading and language arts skills while helping Ella and Gershwyn beat the deadline to mix the tracks for their hot new CD.</p>"},{"name":"Kaettekita Cyborg Kuro-chan","year":2002,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-k/Kaette%20Kita%20Cyborg%20Kuro-chan%20%28Japan%29.chd","filesize":21693403,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Direct control > Contemporary > Sci-fi / futuristic > Licensed","desc":"<p><em>Kaettekita Cyborg Kuro-chan</em> is a platform shooter based on the <em>Cyborg Kuro-chan</em> manga and anime series. Players take control of the titular cat Kuro, a formerly normal housecat who survives being turned into a cyborg and sets out to take revenge on the mad scientist who did it to him with the help of his new cyborg weaponry. Gameplay is standard for the genre; its 2D sidescrolling levels are mostly linear, with players able to equip a variety of guns and melee weapons to take out enemies. Players can freely switch between their weapons over the course of a level. in addition to Kuro, players can also control the manga's other two protagonists, Mie and Matatabi.</p>"},{"name":"Kagaku Ninja Tai Gatchaman: The Shooting","year":2002,"developer":"Warashi Inc."},{"name":"Kagero: Deception II","year":1998,"developer":"Tecmo, Ltd.","url":"psx-chd-roms-k/Kagero%20-%20Deception%20II%20%28Europe%29.chd","filesize":278174574,"score":7.3,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Real-time > Horror","desc":"<p>The race of Timenoids was once human, but long time ago, they have traded their human souls for immortality. The humans perceive them as demons, and invade their country. Fearing that they might lose the war, the Timenoids brainwash a human girl named Millennia, effectively turning her into a tool to serve their purposes. They put her in charge of defending their castle by entrapping the human invaders. But Millennia has yet to choose whose side she will eventually be on...</p><p><em>Kagero: Deception II</em> is the sequel to Tecmo's Deception. It follows a similar, hard-to-classify gameplay style, which can be perhaps defined as a real-time strategy game with RPG elements. Instead of commanding troops and units, Millennia has to place traps and activate them to prevent the intruders from conquering the castle. Unlike the first game, <em>Kagero: Deception II</em> is played from a third-person perspective. A major addition to the gameplay is the introduction of \"trap combos\": traps can be positioned in such a way that they will trigger each other, leading to powerful combinations that would harm the invaders more. The game also allows to customize traps and use various materials to build new ones. As before, the main character and her traps grow in power in correspondence with the amount of enemies killed, lending the game a RPG flavor.</p><p>The morality system also present in this sequel, as the player can decide for Millennia whom to kill and whom to spare. Eventually, the player will be able to choose to join either the Timenoids or the humans.</p>"},{"name":"Kaitohranma Miyabi","year":1999,"developer":"","url":"psx-chd-roms-k/Kaitou%20Ranma%20Miyabi%20%28Japan%29.chd","filesize":333648563,"score":"","genres":"Adventure > Simulation > 1st-person > Diagonal-down > Side view > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Mini-games > RPG elements > Menu structures > Japan (Ancient/Classical/Medieval)","desc":"<p><em>Kaitouranma Miyabi</em> (快刀乱麻 雅) takes place in Japan during Edo period and takes course of a single year where the player is a student in a martial arts school. The game is a mix of visual novel style gameplay during dialogues and third-person perspective during training and fighting. During first-person perspective, the gameplay follows a typical static 2D anime character sprites over detailed graphical background art with smaller window showing current expression and disposition of a character talking. While the protagonist has no voice-acting, other character feature full voice-acting during dialogues. Training sequence consists of various actions that will boost player's skills and is displayed in isometric view from bird's perspective, while dueling is done from side view where player's skills and training it taken into consideration when performing various fencing moves. There are also several mini-games that become available as the story progresses.</p>"},{"name":"Kaitohranma Miyabi (Genteiban)","year":1999,"developer":""},{"name":"Kakinoki Shougi","year":1994,"developer":"ASCII Corporation","url":"psx-chd-roms-k/Kakinoki%20Shougi%20%28Japan%29.chd","filesize":1073275,"score":"","genres":"Strategy > Top-down > Fixed / flip-screen > Turn-based > Chess > Direct control > Japan (Modern/Futuristic)","desc":"<p>The player participates in a classic Shogi board game hosted by champion Yoshikazu Kakinoki. Each move made the player gets a voice announcement of the chosen move. Playing by the traditional rules the game, the player has to move different pieces across the 9x9 square board and put the opposing king in checkmate.</p>"},{"name":"Kakuge Yarou: Fighting Game Creator","year":2000,"developer":"D.A.S.T","url":"psx-chd-roms-k/Kakuge%20Yarou%20-%20Fighting%20Game%20Creator%20%28Japan%29.chd","filesize":89297610,"score":"","genres":"Action > Side view > Anime / Manga > Fighting > Martial arts","desc":"<p><em>Kakuge Yarō</em> is a fighting game construction set similar to Fighter Maker. Choose from one of seven characters, then change their attributes, moves, colors, face, and overall style as you see fit. Then, take your custom-made fighter and fight against the CPU or another player.</p><p>A variety of play background are available, and for those less design-minded, you can also use pre-made characters.</p>"},{"name":"Kamen Rider: Ryuki","year":2002,"developer":"Digifloyd Co., Ltd.","url":"psx-chd-roms-k/Kamen%20Rider%20Ryuuki%20%28Japan%29.chd","filesize":79078461,"score":"","genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>Kamen Rider: Ryuki</em> is a fighting game based on the Japanese tokusatsu television series of the same, and the twelfth installment in the <em>Kamen Rider</em> overall. It contains six game modes: the 1P Challenge Mode, 1P Battle Mode, 2P Battle Mode, Card Get Mode, Card Collection Mode, and Options Mode. </p><p>In 1P challenge mode, you play as Kamen Rider Ryuki and complete missions. Some of the missions tell you to use cards and defeat your opponent.</p><p>In 1P Battle Mode, you fight 8 characters. In this mode, you can play all of the 13 riders and 5 advent monsters. However, you start off with only 7 characters to play as. Because most characters are unlockable. Each rider has their own set of cards and if you use a card, you can use your weapon, shield, advent monster, or finisher. To use your finisher, you must hit the opponent many times. If you damage your opponent enough times, the music will change and you can use your finisher. If you play as a monster, you can't use any of the cards. 2P Battle Mode is multiplayer. And like 1P battle mode, you can play as all of the characters if you unlocked them. The characters that are still locked, are unplayable until you unlock them.</p><p>In Card Get Mode, you use 10 points and play the card get mode. The card that you want to get will hide at any spot. If you get the card, you unlock the card and it will go to your Card Collection. There are no duplicates in the Card Get Mode. If you go to the Card Collection Mode, you will see the cards that you unlocked.</p><p>And in Options, you can change the settings and change things like, loading auto save, changing the how many rounds you want, Turn on or turn off the rumble, and other things.</p>"},{"name":"Kamen Rider: The Bike Race","year":2001,"developer":"Highwaystar Co., Ltd."},{"name":"Karei Naru Casino Club: Double Draw","year":2000,"developer":"Affect Co.,Ltd"},{"name":"Karma: Curse of the 12 Caves","year":1996,"developer":"InterServ International Inc."},{"name":"Kart Challenge","year":2000,"developer":"Interactive Entertainment Ltd.","url":"psx-chd-roms-k/Kart%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.chd","filesize":81161056,"score":"","genres":"Racing / Driving > Behind view > Track racing","desc":"<p>Kart Challenge puts you in the hot seat of karts capable of over 120 mph! Racing around chicanes, through sand and gravel, and over the finish line, you will experience an intense kart racing experience against seven computer opponents across four international racing circuits.<br>With precision controls that allow for graded acceleration, braking and gear changes, and fierce competition throughout, Kart Challenge provides an exhilarating racing experience.</p>"},{"name":"Kartia: The Word of Fate","year":1998,"developer":"Atlus Co., Ltd.","url":"psx-chd-roms-k/Kartia%20-%20The%20Word%20of%20Fate%20%28USA%29.chd","filesize":242248218,"score":7.3,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Isometric > Anime / Manga > Turn-based > Cards / tiles > Managerial / business simulation > Fantasy","desc":"<p>A strategy role-playing game released during the height of the genre's popularity in 1998, when Final Fantasy Tactics and two Ogre Battle games were released. Kartia tells the story of the lives of two separate people during a chaotic chapter in a country's history.</p><p>Several unique additions to the genre hope to detach Kartia from the rest. First is the Kartia system, where cards can be imbued into weapons, armors, or spells or can create completely original apparatus along with monsters that fight alongside you. Secondly is the ability to burn down or destroy most of the battle field and surroundings.</p>"},{"name":"Kawa no Nushi Tsuri: Hikyō o Motomete","year":1998,"developer":"Access co., ltd.","url":"psx-chd-roms-k/Kawa%20no%20Nushi%20Tsuri%20-%20Hikyou%20wo%20Motomete%20%28Japan%29.chd","filesize":24264623,"score":"","genres":"Role-playing (RPG) > Sports > Diagonal-down > Anime / Manga > Fishing","desc":"<p>“Kawa No Nushi Zuri” is a title from the “Honoboro Zuri RPG” series that was born in 1990.<br>This title is the first in the series to be released on PlayStation®. Players can play with each of the 6 members of a family who want to fish the “Nushi” for their own purposes. Game system easy to learn even for beginners, a rich line-up of fishing poles and fishing methods as well as over 70 types of fishing guarantee a challenging fishing experience.</p>"},{"name":"Kaze no NOTAM","year":1997,"developer":"Artdink Corporation","url":"psx-chd-roms-k/Kaze%20no%20Notam%20-%20Notam%20of%20Wind%20%28Japan%29.chd","filesize":153606579,"score":"","genres":"Simulation > 1st-person > 3rd-person (Other) > Meditative / Zen > Flight / aviation > Fantasy > Sci-fi / futuristic","desc":"<p><em>Kaze no NOTAM - NOTAM of Wind</em> is a hot air balloon simulator in a fantasy setting. As a hot air balloon operator you'll be left mostly to the mercy of the winds having no control over your balloons movements on the X or Y axis. Only the Z is open to you by letting off your burner and ascending or releasing hot air and lowering yourself to earth. The wind changes at different altitudes, you'll be aware of the way it's blowing at every height thanks to a wind compass on the right side of the screen, so you'll have to make shrewd use of it to get where you're going.</p><p>You have green markers that can be used for a variety of things. The game enters a first-person gondola view whenever you prepare to throw a marker.</p><p>The game allows you to select the weather conditions and time of your outing as well as the locations. The three locations are <em>Drafty Valley</em>, a valley peppered with castles and other memories of a bygone time. <em>Windy City</em>, a modern metropolis with airports, stadiums and office buildings. <em>Breezy Earth</em> A mysterious presentation of the Earth's and mankind's future. All of these areas are peppered with strange things to see and explore, such as unusual dirigibles, mad auroras, sand drawings, and ancient ruins, to name a few.</p><p>The game has several \"Try Tasks\" which the player can set records on and then try to beat, or ignore and drift lazy as a cloud. The tasks are:<em> </em><em>Fly In</em>*: in this task you'll have the skillfully use the winds to get your craft to hover over a terrestrial target. Once their you'll try to throw a marker at it. The goal is to be as accurate as possible, a difficult thing as your balloon moves with the wind, and you can't stop the forces of nature.</p><ul><li><p><strong>Try Delta</strong>: a competition of flight distance. You'll have three markers, which once dropped will measure the area of the triangle they form. This shows the surface area covered in your journey, assuming you wisely used your markers, the larger it is the better your score.</p></li><li><p><strong>Wolf Hunt</strong>: this is a timed task in which you'll be hunting down whimsically shaped balloons, e.g. chickens, and marking them. The faster you can hunt down all six the better. These wolf balloons will appear in bright yellow on your map to help you hunt them.</p></li></ul><p>The game also features a \"Round Mode\" in which you have to try to beat nine specific goals or \"rounds\".</p>"},{"name":"Kaze no Oka Kouen nite","year":1998,"developer":"Technosoft Co., Ltd.","url":"psx-chd-roms-k/Kaze%20no%20Oka%20Kouen%20Nite%20%28Japan%29.chd","filesize":289494527,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga","desc":"<p><em>Kaze no Oka Kōen nite</em> is a visual novel dating simulation adventure game. It is a bit different from regular visual novel or other dating simulation games where you start the story and decide who to woo in the process, in this game you get to select the heroine at the very beginning of the story which then starts selected scenario. There are four heroines to select from: Koyomi Midzuki (a transfer student from Scotland), Miyuki Kawana (your cousin), Mizuho Natsuki (and old friend since junior high-school), and Yuu Shikimachi (a pianist).</p>"},{"name":"Keeper","year":2002,"developer":"Success Corp."},{"name":"Kendou, The: Ken no Hanamichi","year":2002,"developer":"Amedio Co., Ltd."},{"name":"Kensei: Sacred Fist","year":1998,"developer":"KCE Tokyo, Inc.","url":"psx-chd-roms-k/Kensei%20-%20Sacred%20Fist%20%28Europe%29.chd","filesize":213502255,"score":6.5,"genres":"Action > 3rd-person (Other) > Arcade > Fighting","desc":"<p>A 3D fighting game similar to Tekken or Dead or Alive. Choose from over 20 characters and fight in different modes, including \"Normal Mode\" (where secret characters can be unlocked), \"VS Mode\", \"Time Attack Mode\", \"Survival Mode\", \"Training Mode\", \"Watch Mode\" (watch two fighters controlled by the CPU) and an \"Extra Mode\", a racing mini-game that becomes available once all hidden characters are unlocked.</p><p>Four buttons are used to control the fighters, one for punches, one for kicks, one for grappling moves and one for blocking. Combinations and special attacks can be performed by pressing the punch, kick and directional buttons in various combinations. Defensive moves include blocks, sidesteps as well as counterattacks.</p>"},{"name":"Khamrai","year":2000,"developer":"TamTam Co., Ltd.","url":"psx-chd-roms-k/Khamrai%20%28Japan%29.chd","filesize":172562012,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Khamrai</em> is a Japanese RPG in which the player has two roles: that of Kagato, your everyday RPG-ish country boy who sets forth in search of adventures, and that of Fushi, the Immortal, a god whose ideal is to help humans not out of kindness, but in order to force the control of the race of the gods upon human race. The game shifts back and forth as the player must follow each of the protagonist's individual quests, which ultimately intertwine in a struggle between gods and humans.</p><p>One of the game's innovative concepts consists on keeping track of each of the party member's will towards the protagonists. The protagonists may be hated or liked, and trusted or mistrusted by each of the characters they constantly interact with. Such relations change based on choices the player performs, and based on his actions during battles (letting a character die, for instance, would make him trust the player less). The relationships between each character also have an influence on each one's growth, allowing different spells to be learnt, for instance.</p><p>Battles are by default carried automatically by the computer, and the player may only interfere by selecting a primary enemy target, commanding spell casting or changing between offensive and defensive behavior.</p>"},{"name":"Kick Off World","year":1998,"developer":"Anco Software Ltd.","url":"psx-chd-roms-k/Kick%20Off%20World%20%28Europe%29%20%28En%2CFr%29.chd","filesize":124982672,"score":6,"genres":"Sports > Football (European) / Soccer","desc":"<p>The first Kick Off game for PlayStation offers the ability to play with national or club teams. The game is not just about playing, coaching is equally important as you head for the Reebok DMX Super League. <em>Kick Off World</em> has four levels, and five modes which includes a practice mode as well as Friendly and Cup Competition modes. As the manager you can sell and buy players.</p>"},{"name":"Kickboxing","year":2001,"developer":"Jorudan Co., Ltd.","url":"psx-chd-roms-k/Kickboxing%20%28USA%29.chd","filesize":81889022,"score":"","genres":"Action > Sports > 3rd-person (Other) > Boxing > Martial arts","desc":"<p>A kickboxing game with a Ranking, Story, and a 2 player VS. mode.</p><p>Ranking mode has the player fighting through various opponents in order to become a champion kickboxer.</p><p>Story mode starts with the player either picking the kickboxer Red or Sang and taking them through a story which is told by dialogues between matches. Going through this mode will unlock characters by beating them. Each of the the kickboxers in the game have their own speed, accuracy, strength, and stamina ratings.</p><p>This game is very similar to Boxing sharing a lot of the same characters. It also features similar gameplay mechanics of that game, with the exception that this game allows the addition of being able to kick instead of just punch.</p>"},{"name":"Kid Klown in Crazy Chase 2: Love Love Hani Soudatsusen","year":1996,"developer":"Kemco","url":"psx-chd-roms-k/Kid%20Clown%20no%20Crazy%20Chase%202%20-%20Love%20Love%20Honey%20Soudatsusen%20%28Japan%29.chd","filesize":262037310,"score":"","genres":"Action > Diagonal-down > 2D scrolling > Direct control","desc":"<p><em>Kid Klown in Crazy Chase 2: Love Love Hani Soudatsusen</em>  is the sequel to the SNES title Kid Klown in Crazy Chase. It has same gameplay, but boasts three times as many stages: the first game had five, this one has sixteen.</p><p>Your goal is to run through the stage as quickly as possible to stop a rocket ship from taking off at the end. There are obstacles galore, from simple things like tacks on the ground to give you a temporary foot puncture and rolling barrels from behind to more complex events such as falling giant ice stalactites, dusty tornadoes, and lightning strikes. Or Dirty Joe could just chase after you on a skidoo. There are moving platforms as well.</p>"},{"name":"Kidō Keisatsu Patlabor: Game Edition","year":2000,"developer":"Production I.G, Inc."},{"name":"Kileak: The DNA Imperative","year":1995,"developer":"Genki Co., Ltd.","url":"psx-chd-roms-k/Kileak%20-%20The%20DNA%20Imperative%20%28USA%29.chd","filesize":373750253,"score":6.4,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>Scientist Dr. Kim has taken his experiments in genetic engineering one step too far. A strike team of the International Peace Keeping Forces is dispatched to his south pole base but is shot down before landing. As one of only two survivors it is your mission to enter the base, find Kim and stop his evil plans.</p><p>In first-person shooter manner you explore the levels of the base, destroy robotic enemies and search for the elevator to the next level. Your SJ107 assault suit features an automapping system and can be upgraded with better armor and weapons. It runs on battery energy which can be recharged at an energy station somewhere on each level. If doors are locked, they can be opened with a keycard or by solving a lever puzzle. The storyline is advanced through communications with your surviving comrade Carlos and through recordings found in the levels which can be watched at a computer station.</p>"},{"name":"Killer Loop","year":1999,"developer":"VCC Entertainment GmbH & Co. KG","url":"psx-chd-roms-k/Killer%20Loop%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":305636542,"score":6.6,"genres":"Action > Racing / Driving > 1st-person > 3rd-person (Other) > Sci-fi / futuristic","desc":"<p>If you need an adrenaline rush, Killer Loop might be just your thing: Step into your magnetic glider and race through lots of roller-coaster like tracks full of curves and loops, psyched up by pumping techno beats.</p><p>There are of course power-ups scattered on the track that may be picked up, including weapon systems to get rid of your enemies.</p><p>Similar to Wipeout, this is a game for speed freaks.</p>"},{"name":"Killing Zone","year":1996,"developer":"Scarab","url":"psx-chd-roms-k/Killing%20Zone%20%28Europe%29.chd","filesize":149147737,"score":5.4,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy","desc":"<p>Seven infamous monsters from Frankenstein to the Minotaur go head to head in this early PlayStation fighting game.</p><p>These initial seven monsters are all there is; there are no hidden characters to unlock or a final boss to beat.</p><p>Most of the characters are slow and un-manoeuvrable. This may be by design to represent the weight of the monsters; most of them are big and their fighting styles could be considered anything but skill based. For instance the Skeleton can jump on the opponent and stab them in the neck repeatedly with its sword while the Minotaur gores them with its horns. It must be said that the attacks in the game generally fit their respective monster.</p><p>There are only two game modes available with the main one being the standard \"Normal Mode\" where one player goes up against the six other monsters and finally a mirror match.  A second player can join in at any point (in fact it's the only way a second player can play as there is no Vs mode). If one completes this mode they are presented with a breakdown of their performance in each fight, though no ending in the real sense, as the game has no story at tall to explain why these monsters are fighting each other.</p><p>The second game mode is an innovative mode the game calls \"Auto Mode\" and devotes most of its manual to. In this mode the player functions as a side line trainer to train and guide an AI controlled monster (selectable from one of the same seven as the Normal Mode) through several tournaments. This is done by pressing various buttons on the controller to tell your monster to try to perform certain offensive or defensive plays.</p><p>The monster you are training start's of with little more than the ability to throw a punch and is slow to respond to your prompts, but will gain additional attacks and respond quicker and more intelligently to your prompts the more it fights, until it ultimately gains the full range of attacks it would have in the Normal Mode.</p><p>However the full potential of this mode is undermined by the games lack of any save feature.</p>"},{"name":"Kindaichi Shounen no Jikenbo - Hihoutou Aratanaru Sangeki","year":1997,"developer":"Digital Frontier","url":"psx-chd-roms-k/Kindaichi%20Shounen%20no%20Jikenbo%20-%20Hihoutou%20Aratanaru%20Sangeki%20%28Japan%29.chd","filesize":421603209,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Detective / mystery > Licensed","desc":"<p><em>Hihōtō: Arata Naru Sangeki</em> (悲報島 新たなる惨劇) is the first game in Kindaichi Case Files series to come on PlayStation platform. While the setting is the same as in TV anime, the game features an original story. The story protagonist is Hajime Kindaichi (金田一 一), a 16-year old sophomore who inherited a knack for solving mysteries from his grandfather, a legendary detective.</p><p>As the title implies, the game takes place on Hihoutou, an island that is rumored to hold a vast treasure. An island owner, Shi Mimasaka (美作 氏) was planning a treasure hunting tour, and Kindaichi found himself on the list of invited people. Along with his girlfriend, Miyuki, he went on the island only to find out that Mr. Mimasaka has been brutally murdered. There also has been a rumor that a monster is guarding the treasure on Hihoutou island, and as all the guests seem to have been unable to kill the island owner, the question of whether the island monster really exists became of utmost importance.</p><p>This murder mystery mainly plays as a visual novel, and focuses strongly on dialogues with other characters, but also allows the player to search each room and location, check info about suspects which he keeps track of in his notebook, and traverse the map, both in the mansion and all over the island. The game also features fully animated as well as pre-rendered cut-scenes. While the dialogue is no entirely present during conversations, animated cut-scenes feel just as the TV animated series.</p>"},{"name":"Kindaichi Shounen no Jikenbo 3 - Seiryuu Densetsu Satsujin Jiken (Disc 1)","year":1998,"developer":"Digital Frontier","url":"psx-chd-roms-k/Kindaichi%20Shounen%20no%20Jikenbo%203%20-%20Seiryuu%20Densetsu%20Satsujin%20Jiken%20%28Japan%29%20%28Disc%201%29.chd","filesize":365603486,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Detective / mystery > Licensed","desc":"<p><em>Jigoku Yuuen Satsujin Jiken</em> (地獄遊園殺人事件) is the second game from Kindaichi Case Files series for PlayStation console (overall third released game in the series), often referred to as <em>Kindaichi Shounen no Jikenbo 2</em>. The story protagonist is Hajime Kindaichi (金田一一), a high school student, and more importantly a grandson of a renowned private detective after whom he inherited a knack for solving crimes by using deduction and reasoning similar in style to Shinichi Kudou in <em>Detective Conan</em> series.</p><p>Miyuki Nanase (七瀬美雪), Hajime's childhood friend got tickets for Shell Park, which is a resort with a sea theme split in four areas: Fantasy World, Aqua World, Adventure World, and Visitor World. After waking up Haime from his rather romantic dream, she storms out towards the park. During his pursuit of her and constant quarrel along the road, they spot a police car with detective Kenmochi heading somewhere. Not too far away, they come upon a crime scene where the victim was found hanging from a tree. It doesn't take but a few good looks for Kindaichi to point that this is not a suicide but a homicide. As they arrive at the Shell Park, after a little wondering they stumble upon a dead body near the jet coaster, and a small explosion takes out the \"S\" letter from the park's sign turning what's left of it to look like a Hell Park.</p><p>With so many people and staff around, the culprit could be anybody, but Kindaichi isn't going home until he roots out the evil and find the murderer. The game plays in two different ways. Adventure part is done through a typical visual novel conversation where all the characters feature voice acting and every scene is animated. Characters on the scene are animated while talking or just standing idly, while characters who are talking but not visible on the scene get animated in a small window in front of the displayed dialogue text. Exploration mode uses 1st-person perspective where you can move freely in 3D world of Shell Park. Dialogues also use the very same 3D scene as a background images, while cut-scenes use fully anime-like.</p><p>The game includes a couple of bonus materials enclosed within the manual, namely, a map of Shell Park which is double in width and height to a jewel case manual, and stickers featuring game title and main two characters (Hajime and Miyuki) which are designed to work as a PSX memory card stickers.</p>"},{"name":"Kindaichi Shounen no Jikenbo 3 - Seiryuu Densetsu Satsujin Jiken (Disc 2)","year":1998,"developer":"Digital Frontier","url":"psx-chd-roms-k/Kindaichi%20Shounen%20no%20Jikenbo%203%20-%20Seiryuu%20Densetsu%20Satsujin%20Jiken%20%28Japan%29%20%28Disc%202%29.chd","filesize":347166019,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Detective / mystery > Licensed","desc":"<p><em>Jigoku Yuuen Satsujin Jiken</em> (地獄遊園殺人事件) is the second game from Kindaichi Case Files series for PlayStation console (overall third released game in the series), often referred to as <em>Kindaichi Shounen no Jikenbo 2</em>. The story protagonist is Hajime Kindaichi (金田一一), a high school student, and more importantly a grandson of a renowned private detective after whom he inherited a knack for solving crimes by using deduction and reasoning similar in style to Shinichi Kudou in <em>Detective Conan</em> series.</p><p>Miyuki Nanase (七瀬美雪), Hajime's childhood friend got tickets for Shell Park, which is a resort with a sea theme split in four areas: Fantasy World, Aqua World, Adventure World, and Visitor World. After waking up Haime from his rather romantic dream, she storms out towards the park. During his pursuit of her and constant quarrel along the road, they spot a police car with detective Kenmochi heading somewhere. Not too far away, they come upon a crime scene where the victim was found hanging from a tree. It doesn't take but a few good looks for Kindaichi to point that this is not a suicide but a homicide. As they arrive at the Shell Park, after a little wondering they stumble upon a dead body near the jet coaster, and a small explosion takes out the \"S\" letter from the park's sign turning what's left of it to look like a Hell Park.</p><p>With so many people and staff around, the culprit could be anybody, but Kindaichi isn't going home until he roots out the evil and find the murderer. The game plays in two different ways. Adventure part is done through a typical visual novel conversation where all the characters feature voice acting and every scene is animated. Characters on the scene are animated while talking or just standing idly, while characters who are talking but not visible on the scene get animated in a small window in front of the displayed dialogue text. Exploration mode uses 1st-person perspective where you can move freely in 3D world of Shell Park. Dialogues also use the very same 3D scene as a background images, while cut-scenes use fully anime-like.</p><p>The game includes a couple of bonus materials enclosed within the manual, namely, a map of Shell Park which is double in width and height to a jewel case manual, and stickers featuring game title and main two characters (Hajime and Miyuki) which are designed to work as a PSX memory card stickers.</p>"},{"name":"King of Bowling 2","year":1998,"developer":"Coconuts Japan Entertainment Co., Ltd.","url":"psx-chd-roms-k/King%20of%20Bowling%202%20%28Europe%29.chd","filesize":42427748,"score":"","genres":"Sports > 3rd-person (Other) > Direct control > Bowling","desc":"<p>Try for the perfect frame in a fully 3D alley!<br>Pit one of eight player-characters against bowling pro's who show no mercy.<br>Bowl high-speed curves and get as many strikes as you can. Success is vital in the game's many tournaments.</p>"},{"name":"King of Bowling 3","year":2002,"developer":"DigiCube Co., Ltd.","url":"psx-chd-roms-k/King%20of%20Bowling%203%20%28Europe%29.chd","filesize":1281961,"score":"","genres":"Sports > 1st-person > Direct control > Bowling","desc":"<p>Learn to control the path of your ball applying just the right amount of force and spin to knock down everyone of those pins so you can yell... Strike!<br>Play the extra challenges in the Quest Mode.<br>Aim for the Perfect Game in your quest to become the World Champion.</p>"},{"name":"King of Fighters '95, The","year":1996,"developer":"SNK Corporation","url":"psx-chd-roms-k/King%20of%20Fighters%20%2795%2C%20The%20%28Europe%29.chd","filesize":355036349,"score":7.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Direct control > Martial arts","desc":"<p>The first sequel in the <em>King of Fighters</em> series picks up a year after the end of the first tournament. Once again, fighters from all over the world receive a mysterious invitation to a team-based fighting tournament. And just like last year, it appears that the notorious criminal Rugal Bernstein is behind it, apparently returning from the dead to raise havok once again...</p><p><em>The King of Fighters '95</em> introduces Kyo Kusanagi's rival Iori Yagami, and firmly places Kyo as the main character for the rest of the series. The gameplay of <em>The King of Fighters '95</em> is essentially unchanged from the previous title, though it does introduce the \"team edit\" concept which would remain as a standard feature of the series. Using the \"team edit\" feature, it is possible to create a totally customized team using any of the available fighters, or use one of the default teams if you wish.</p>"},{"name":"King of Fighters '96, The","year":1997,"developer":"SNK Corporation","url":"psx-chd-roms-k/King%20of%20Fighters%20%2796%2C%20The%20%28Japan%29.chd","filesize":381178619,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting","desc":"<p>\"Violent fighting to come again!\"</p><p>SNK's flagship series returns for another year. Many of the changes in this year's KOF release come in the form of improved graphics, sound effects, music and totally redone character sprites. The gameplay of the system has been altered with the addition of \"Rush\" multi-hit combos and new moves for practically every character. The storyline of the series receives heavy focus in this release with the Orochi Saga swinging into high-gear.</p><p><em>The King of Fighters '96</em> has 27 regular characters plus 2 boss characters (who can be unlocked with the use of a code). Newcomers to the tournament include Mr. Big from the Art of Fighting series, the bosses from Fatal Fury (Wolfgang Krauser and Geese Howard), and completely original characters like Leona Heidern, Mature and Vice. Other features carried over from the previous year include the ability to choose between the default \"Team Fighting\" mode or the traditional \"Single Fighter\" style of gameplay, plus the \"Versus\" and \"Survival\" gameplay modes.</p>"},{"name":"King of Fighters '97, The","year":1998,"developer":"SNK Corporation","url":"psx-chd-roms-k/King%20of%20Fighters%20%2797%2C%20The%20%28Japan%29.chd","filesize":203756340,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Regional differences","desc":"<p>Another year, another KOF. Additions this year come in the form of slightly improved graphics and sounds, new moves and a new game mode. Gameplay is much more plot-driven, as you have middle-bosses that can change depending on what team you select. In addition, there are several special endings which are only shown when certain \"Edit Team\" combinations are selected.</p><p>As of <em>The King of Fighters '97</em>, you can play in either the Extra or Advanced game modes. Extra Mode is the typical AOF/KOF scheme, in which your power gauge fills up as you defend yourself or charge yourself up. The new Advanced Mode, on the other hand, only allows you to charge your gauge as you perform special moves and attacks, similar to the Street Fighter series. Extra allows one to sidestep attacks while Advanced allows the character to roll past and dodge attacks; Advanced also allow a character to perform a potent \"Super Desperation Move\" (or SDM) at any time provided the character has at least two full bars of charged energy stored. In contrast, SDMs can only be performed in Extra when a character has less than a quarter of their health left.</p><p>New characters include the New Face Team, the Fatal Fury Outlaw Team (featuring the KOF debut of \"Blue\" Mary Ryan and Ryuji Yamazaki, and the return of Billy Kane), and Kyo's pupil Shingo Yabuki. In total, <em>The King of Fighters '97</em> sports 29 separate characters (without counting the six Orochi-related boss characters, which are all accessible via a secret code).</p>"},{"name":"King of Fighters '98, The: The Slugfest","year":1999,"developer":"SNK Corporation","url":"psx-chd-roms-k/King%20of%20Fighters%20%2798%2C%20The%20-%20Dream%20Match%20Never%20Ends%20%28Japan%29%20%28Rev%201%29.chd","filesize":157627213,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting","desc":"<p><em>The King of Fighters '98</em> takes a break from the Orochi plot line and instead is presented as a \"Dream Match\" game where the KOF roster duke it out for the top spot (similar to Ultimate Mortal Kombat 3, but without the storyline component). Most of the characters from the past four years return, thus providing the player with a very large roster containing 38 characters. Many of the characters have been altered in an attempt to make the game balanced regardless of the player's choice of fighter. Rugal Bernstein is provided as a non-secret character for the first time in KOF '98, and several regular characters have hidden \"alternate\" versions that may also be used in-game. </p><p>KOF '98 uses the same gameplay system present in The King of Fighters '97, so players may still choose between Extra and Advanced modes. In addition to the Survival battle mode and the ability to choose between Single Play or Team Play, versions of the game on console systems that use CDs to contain their media (PSX, Neo-Geo CD) also include an Art Gallery one may look at.</p>"},{"name":"King of Fighters '99, The: Millennium Battle","year":2000,"developer":"SNK Corporation","url":"psx-chd-roms-k/King%20of%20Fighters%20%2799%2C%20The%20%28USA%29.chd","filesize":154809893,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting","desc":"<p>It's time once again for the famous KOF Tournament! New faces and old alike join together to participate in the latest KOF tournament, but something seems wrong. Why was this year's tournament announced without fanfare? What could be up? That's for you to find out! Featuring classic KOF gameplay with a new twist: The Striker Match!</p>"},{"name":"King of Fighters Kyo, The","year":1998,"developer":"Yumekobo Co., Ltd.","url":"psx-chd-roms-k/King%20of%20Fighters%20Kyo%2C%20The%20%28Japan%29.chd","filesize":357881035,"score":"","genres":"Role-playing (RPG) > 1st-person > 3rd-person (Other) > Anime / Manga > Turn-based > Fighting","desc":"<p><em>The King Fighters of Kyo</em> is a spin-off from SNK's successful fighting games that focuses on the series main character: Kyo Kusanagi. The game takes place 11 months after the '96 tournament, and covers the months prior to the '97 tournament and the tournament itself from an RPG-like point of view. You control Kyo, and go around the world (starting in your home, Osaka and eventually going to places like Mexico and California) advancing a plot line related to the Orochi storyline and your eternal enemy, Iori Yagami, by interacting with other characters from the series, solving subquests and winning fights viewed from a first-person perspective. </p><p>Fights are turn-based, with a menu-based system from which you select actions and moves to execute. The overall objective of the game is to explore and learn everything you can about the back stories and subplots revolving each character, and get a pair of teammates (anyone from the 31 available characters, not just the \"hero\" team) and enough experience to enter the '97 tournament. Also included is a battle mode, and a sound test mode.</p>"},{"name":"King Size: Army Men Air Attack 2 + Army Men Omega Soldier","year":2001,"developer":""},{"name":"King Size: Army Men Sarge's Heroes 2 + Army Men Lock 'n' Load","year":2001,"developer":""},{"name":"King Size: Driver 2 + Anstoß Premier Manager","year":2001,"developer":""},{"name":"King Size: TechnoMage + Anstoß Premier Manager","year":2001,"developer":""},{"name":"King Size: UEFA Challenge + Anstoß Premier Manager","year":2001,"developer":""},{"name":"King Size: WarJetz + Army Men Sarge's Heroes 2","year":2001,"developer":""},{"name":"King's Field","year":1995,"developer":"FromSoftware, Inc.","url":"psx-chd-roms-k/King%27s%20Field%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":169765968,"score":7.4,"genres":"Action > Role-playing (RPG) > 1st-person > Fantasy","desc":"<p>The powerful and holy Moonlight Sword was stolen from King Alfred of Verdite. Prince Alexander, one of the king's closest friends, embarks on a journey to retrieve the sword. During his voyage a terrible storm overcomes his ship, and it sinks to the bottom of the sea. Alexander miraculously survives and is washed ashore on the mysterious island of Melanat. He has to explore the island, aware of the monsters roaming it, and find the sword.</p><p><em>King's Field</em> (originally dubbed <em>King's Field II</em>) is the second game in the series, and the first one to become localized in Western countries. Like its predecessor, it is a first-person 3D action role-playing game with a heavy emphasis on dungeon crawling. The game takes place in world consisting of interconnected areas, which gradually open up as the player acquires keys and other means to enter them. Most of the time the player is free to explore large areas, though he may encounter powerful enemies he is yet unable to defeat.</p><p>The player character can attack physically with melee or ranged weapons (bows), as well as cast magic. Physical attacks and spells are each assigned to a different button. Character growth is handled by repeatedly executing the same types of attacks and applying certain items to raise attributes. New in this installment is the learning of magic from special crystals. Most of the creatures encountered in the game are hostile, with only a few offering help such as procuring different types of crystals needed to make healing potions. Every NPC in the game, whether hostile or friendly, can be killed by the player. Alexander can sprint now, though doing this depletes his hit and magic points and he must rest for a while to recover them. It is also possible to teleport between areas.</p>"},{"name":"King's Field II","year":1996,"developer":"FromSoftware, Inc.","url":"psx-chd-roms-k/King%27s%20Field%20II%20%28USA%29.chd","filesize":355804547,"score":7.6,"genres":"Action > Role-playing (RPG) > 1st-person > Fantasy","desc":"<p>A storm runs through the kingdom of Verdite, taking away the precious Moonlight Sword and spreading evil throughout the land. Players take on the role of Lyle, the king's son, in his quest to retrieve the Moonlight Sword and save the kingdom and his father. Unfortunately, the king fell victim to the ensuing corruption, and Lyle must acquire magical powers from the four greatest mages in the kingdom in order to complete his quest.</p><p><em>King's Field II</em> is a first-person action role-playing game. Despite the number in its Western release title, it is the third game in the series, originally entitled <em>King's Field III</em>. The events of the game take place fifteen years after those depicted in its predecessor. Gameplay-wise, it is similar to the previous installments, offering vast interconnected areas open for exploration and a variety of enemies to defeat with the help of weapons and magic. The game's world is larger than in the earlier games and has more open-air areas, including several towns with friendly NPCs. Magic is divided into disciplines and special crystals are required to become proficient in any of them.</p>"},{"name":"King's Field: Dark Side Box","year":2007,"developer":""},{"name":"Kingsley's Adventure","year":1999,"developer":"Psygnosis Camden Studio","url":"psx-chd-roms-k/Kingsley%27s%20Adventure%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%2CFi%29.chd","filesize":410221017,"score":7,"genres":"Action > Behind view > Platform > Puzzle elements > Fantasy","desc":"<p><em>Kingsley's Adventure</em> is a 3D action-adventure game for the PlayStation in a similar vein as The Legend of Zelda. In the game, you play an orphaned fox called Kingsley who was adopted by the king and queen of the Fruit Kingdom. For the most part of his life he, lived in the Carrot Castle where he was being tutored by an wise badger into the ways of a warrior and true knight.</p><p>When a former cook from the castle is fired after being accused of food poisoning, he takes a turn for the worse. He steals the queen's spellbook and enchants the king's soldiers so he can take over the castle and thus control of the Fruit Kingdom. Now it is up to the player as Kingsley to save the day. But before you can really save the day, the young Kingsley will have to prove his valor and honor as a knight.</p><p>Kingsley can collect items, talk to the inhabitants of the Fruit Kingdom and fight enemies with various weapons such as a sword, axe, knife and crossbow. He will have to dodge cannonballs, crushing blocks and buzzing saws. Activate switches and open locks, jump over dangerous terrain and collect power-ups and items.</p><p>Win the trust of villagers in the kingdom by helping them solving their troubles and clearing dungeons. Find a way into fortresses to defeat the dark knights in order to restore peace to the kingdom.</p>"},{"name":"Kinniku Banzuke: Road to Sasuke","year":2000,"developer":"Konami Co., Ltd.","url":"psx-chd-roms-k/Kinniku%20Banzuke%20-%20Road%20to%20Sasuke%20%28Japan%29.chd","filesize":78173989,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Cinematic camera > Licensed","desc":"<p>Sasuke (also known as Ninja Warrior outside of Japan) is an annual sports TV show where 100 competitors compete each year in 4 obstacle courses. The courses require both agility and strength and are increasing in difficulty. Courses do not dramatically change every year and are basically the same, although there are some alterations in parts of them every now and then.</p><p>The game lets you do the training on each of the courses with some of the pre-defined characters, or you can create your own character and enter the full competition. Sasuke is a sport where failure is not an option. No matter how far you've come, if you either make a mistake and fall into the water that is at the bottom of each of the first three courses, or run out of time, you lose and get disqualified. As courses are gradually increasing difficulty, in real life after the first course only a handful out of a 100 competitors remain to try the second course and so on. Sometimes none of the competitors even reaches the last course, and even rarely finishes it all.</p><p>Gameplay-wise, it's a button mashing game where you press specific button or repeat a button sequence in order to make your character run with occasional pause when you need to jump or perform a more unique action specific to the course. The first course is less muscle and more agility, meaning you'll have to run and jump a lot to make it in time to the end. Some of the obstacles consist of jumping over bodies of water, holding onto the rolling tree log without falling down, rope climbing, or balance walking. Second stage is more muscle focused and will require you to hold onto something or to lift heavy objects. Third stage tests your limits by having very few places to stand and rest, and you have to pass most of it by holding onto something or your body weight with just young fingertips. The final stage is direct rope climbing where you have to climb 15 meters high in 30 seconds flat. The game also features real-life commentators, Tsutomu Taruki (垂木 勉) and Ichirou Furutachi (伊知朗 古館).</p>"},{"name":"Kirikou","year":2001,"developer":"Étranges Libellules S.A.","url":"psx-chd-roms-k/Kirikou%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":352865391,"score":"","genres":"Action > 3rd-person (Other) > Side view > Platform > Licensed","desc":"<p><em>Kirikou</em> is an action game based on the animated film 'Kirikou et la Sorcière', or 'Kirikou and the Sorceress' as it is known in the USA. The African sorceress Karaba as turned the male villagers into fetishes, and even though he's still a newborn baby, Kirikou bravely sets off on his quest to stop her.Jump obstacles, collect life-giving bonuses and jump on your enemies in standard side-scrolling platformer fare, gaining stronger weapons and special abilities as you progress. Animated cutscenes relay the story.</p>"},{"name":"Kisetsu wo Dakishimete","year":1998,"developer":"Production I.G, Inc."},{"name":"Kisha de GO!","year":2000,"developer":"Taito Corporation","url":"psx-chd-roms-k/Kisha%20de%20Go%21%20%28Japan%29.chd","filesize":218115749,"score":"","genres":"Simulation > 1st-person > Train","desc":"<p>Kisha de GO! is part of the Densha de GO! series by Taito.</p><p>This game let's you drive steam locomotives through the Japanese countryside - the coverage included portions of the Keihin-Tōhoku Line, Shin'etsu Main Line and Ban'etsu-Sai Line.</p><p>Controls are somewhat more difficult than usual for the Densha de GO! series. This is to reflect the simulation of steam engines.</p>"},{"name":"Kiss Pinball","year":2001,"developer":"Tarantula Studios"},{"name":"Kitchen Panic","year":1998,"developer":"Panther Software Inc.","url":"psx-chd-roms-k/Kitchen%20Panic%20%28Japan%29.chd","filesize":435466434,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p><em>Kitchen Panic</em> is a whimsical 2D platformer starring a potato. An army of cans and other foodstuffs have taken over the kitchen, and Potato must stop them! Each sprawling level is designed for both exploration and speed, as in each stage there are ten kettles of special sauce hidden around, but the game also keeps track of your fastest time on each stage.</p><p>Potato has a unique special ability to aid him: he can spin in mid-air like a certain hedgehog, and use the force to launch himself further and faster than he can run. A forward spin will launch him forward, and a backspin will launch him straight upward. This greatly aids in exploration of each stage, allowing for very long or high jumps. There are also a number of power-ups to be found, including Ice Potato and Rocket Potato.</p><p>The game is made up of a number of zones, each with six stages. At the end of each zone, Potato must face off against a food-themed boss enemy, such as a stack of plates or a giant ice cream cone.</p>"},{"name":"Kizuna Toiu Na no Pendant with Toybox Stories (Disk 1)","year":2000,"developer":"Cocktail Soft","url":"psx-chd-roms-k/Kizuna%20toyuu%20Na%20no%20Pendant%20with%20Toybox%20Stories%20%28Japan%29%20%28Disc%201%29.chd","filesize":465613698,"score":"","genres":"Adventure > Compilation > 1st-person > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Visual novel > Romance","desc":"<p><em>Kizuna Toiu Na no Pendant with Toybox Stories</em> is an updated port of With You: Mitsumete Itai game containing base game and non-adult version of With You: Toybox fan disk released for PC.</p><p>After clearing the main game story, bonus features including music player, CG gallery and Toybox stories become available.</p>"},{"name":"Kizuna Toiu Na no Pendant with Toybox Stories (Disk 2)","year":2000,"developer":"Cocktail Soft","url":"psx-chd-roms-k/Kizuna%20toyuu%20Na%20no%20Pendant%20with%20Toybox%20Stories%20%28Japan%29%20%28Disc%202%29.chd","filesize":425959185,"score":"","genres":"Adventure > Compilation > 1st-person > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Visual novel > Romance","desc":"<p><em>Kizuna Toiu Na no Pendant with Toybox Stories</em> is an updated port of With You: Mitsumete Itai game containing base game and non-adult version of With You: Toybox fan disk released for PC.</p><p>After clearing the main game story, bonus features including music player, CG gallery and Toybox stories become available.</p>"},{"name":"KKND2: Krossfire","year":1999,"developer":"Melbourne House","url":"psx-chd-roms-k/KKND%20Krossfire%20%28Europe%29.chd","filesize":379516022,"score":7.4,"genres":"Strategy > Diagonal-down > Free-roaming camera > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Post-apocalyptic > Sci-fi / futuristic > War","desc":"<p>Finally, a formidable computer opponent to challenge the smartest cagey old vet. Battle an AI that probes your defenses, retreats, sets ambushes, and even attacks from multiple fronts. Add units that gain experience through combat, improving their damage potential and accuracy, and eventually the ability to heal themselves. Now you have a recipe to make any PC commander drool - welcome to the world of KRUSH, KILL 'n DESTROY!</p>"},{"name":"Klaymen Gun Hockey","year":1999,"developer":"KIDSMIND, Inc","url":"psx-chd-roms-k/Klaymen%20Gun-Hockey%20%28Japan%29.chd","filesize":9210929,"score":"","genres":"Action > Sports > 1st-person > Arcade > Hockey > Licensed","desc":"<p>An air hockey game based on the characters and settings of The Neverhood. Klaymen has suddenly decided that he needs to defeat all of the Neverhood's inhabitants in head-to-head gun hockey matches, a unique sport which plays basically as air hockey but with a mounted gun on each end that is used to shoot and push the puck in each direction. </p><p>The game is played from a first-person perspective from the end your side of the table. You can play against other characters in single player mode or go against another player in Vs mode, and the game also includes arcade elements like power-ups, popping obstacles and special shoots.</p>"},{"name":"Klonoa Beach Volleyball","year":2002,"developer":"Namco Limited","url":"psx-chd-roms-k/Klonoa%20Beach%20Volleyball%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":167704122,"score":"","genres":"Sports > Diagonal-down > Side view > Anime / Manga > Arcade > Volleyball","desc":"<p>An arcade volleyball game featuring the characters and likeness of the Klonoa franchise. You compete in 2-on-2 matches using a selection of characters from the franchise in hopes of winning the 5-match tournament, which is staged on several locations from each game.</p><p>The game plays from a 3d side-view, and you can block shots, counter them and release \"Super Shots\" with your selected character. Allows for 4-player gameplay and features a Championship, Exhibition and Training mode.</p>"},{"name":"Klonoa: Door to Phantomile","year":1997,"developer":"Namco Limited","url":"psx-chd-roms-k/Klonoa%20-%20Door%20to%20Phantomile%20%28Europe%29.chd","filesize":452228728,"score":7.8,"genres":"Action > Platform > Fantasy","desc":"<p>The energy from dreams is collected in the Moon Kingdom where it is given substance. This rule was broken when Klonoa, a cat-like creature with wings on his ears, dreams that an airship crashes violently into a hill and a mysterious shadow hangs over the wreckage. </p><p>When the dream comes true, Klonoa and his friend Huepow go to investigate. You take control of Klonoa as he travels through 12 levels of action.</p><p>Klonoa will encounter a number of enemies who want to stop him. Fortunately, Klona can grab enemies and use them as weapons to destroy other bad guys, or throw them to the ground and propel himself upward. Besides grabbing enemies, Klonoa can also pump up larger enemies and make them explode. Help Klonoa discover the reason for the dream.</p>"},{"name":"Knockout Kings","year":1998,"developer":"Press Start Inc","url":"psx-chd-roms-k/Knockout%20Kings%20%28USA%29.chd","filesize":169026943,"score":7.2,"genres":"Sports > 3rd-person (Other) > Boxing > Licensed","desc":"<p>Thirty eight of the sport's greatest boxers (including Muhammad Ali, Evander Holyfield, Sugar Ray Leonard, Oscar De La Hoya &amp; Lennox Lewis) are together for the first time in one game for you to compete as and against.</p><p>Compete for a collection of different belts (lightweight, heavyweight, etc.) through-out the world as the greatest names in the history of boxing, or create your own boxer and go all the way to the top.</p><p>Jimmy Lenno, Jr. adds his voice for ring announcements, Sean Ogrady and Al Albert commentate the play, and Mills Lane is your fighting instructor.</p>"},{"name":"Knockout Kings 2000","year":1999,"developer":"Electronic Arts, Inc.","url":"psx-chd-roms-k/Knockout%20Kings%202000%20%28Europe%29.chd","filesize":229854021,"score":7.3,"genres":"Sports > 3rd-person (Other) > Boxing > Licensed","desc":"<p>Play as some of the greatest names in boxing history through a full career, or create your own boxer and fight your way to the heavyweight championship.</p><p>Famous names include Muhammad Ali, \"Sugar\" Ray Leonard, Lennox Lewis, Oscar De La Hoya and Evander Holyfield, plus many more from a range of weight divisions.</p>"},{"name":"Knockout Kings 2001","year":2000,"developer":"Black Ops Entertainment, LLC","url":"psx-chd-roms-k/Knockout%20Kings%202001%20%28Europe%29.chd","filesize":376817032,"score":7.4,"genres":"Sports > Boxing > Licensed","desc":"<p>Fight as your favorite boxers including Sugar Ray Lewis, Muhammad Ali, Lennox Lewis, Oscar De La Hoya and plenty more past winners and current champions. There's also plenty of things to do, including a straight up arcade game (so you can beat your mates to the punch!) and a career mode, where you can take your chosen player from the rookie list to the world stage, all in one day.</p>"},{"name":"KohniShogun","year":2000,"developer":"Rythmics"},{"name":"Konami Antiques: MSX Collection Vol. 1","year":1997,"developer":"Konami Industry Co. Ltd.","url":"psx-chd-roms-k/Konami%20Antiques%20-%20MSX%20Collection%20Vol.%201%20%28Japan%29.chd","filesize":26901216,"score":"","genres":"Compilation","desc":"<p>This is the first of Konami's MSX Collections released on the PlayStation. Volume 1 has the following games:</p><ul><li>Antarctic Adventure</li><li>Gofer no yabō: Episode II</li><li>Gradius</li><li>Hyper Sports 2</li><li>Konami's Boxing</li><li>Mopiranger</li><li>Ping-Pong</li><li>Road Fighter</li><li>Sky Jaguar</li><li>Yie Ar Kung-Fu</li></ul>"},{"name":"Konami Antiques: MSX Collection Vol. 2","year":1998,"developer":"Konami Industry Co. Ltd.","url":"psx-chd-roms-k/Konami%20Antiques%20-%20MSX%20Collection%20Vol.%202%20%28Japan%29.chd","filesize":25569401,"score":"","genres":"Compilation","desc":"<p>This is the second of Konami's MSX Collections released on the Playstation. Volume 2 has the following games:</p><ul><li>Athletic Land</li><li>Gradius 2</li><li>Hyper Sports 3</li><li>Knightmare</li><li>Konami's Golf</li><li>Magical Tree</li><li>Super Cobra</li><li>Twin Bee</li><li>Yie Ar Kung-Fu 2: The Emperor Yie-Gah</li></ul>"},{"name":"Konami Antiques: MSX Collection Vol. 3","year":1998,"developer":"Konami Industry Co. Ltd.","url":"psx-chd-roms-k/Konami%20Antiques%20-%20MSX%20Collection%20Vol.%203%20%28Japan%2C%20Asia%29.chd","filesize":25103259,"score":"","genres":"Compilation","desc":"<p>This is the third of Konami's MSX Collections released on the Playstation. Volume 3 has the following games:</p><ul><li>Comic Bakery</li><li>King's Valley</li><li>Konami Rally (Hyper Rally)</li><li>Konami's Soccer</li><li>Konami's Tennis</li><li>Parodius</li><li>Penguin Adventure</li><li>Pippols</li><li>Salamander</li><li>Time Pilot</li></ul>"},{"name":"Konami Arcade Classics","year":1999,"developer":"Konami Computer Entertainment Sapporo Co., Ltd","url":"psx-chd-roms-k/Konami%20Arcade%20Classics%20%28USA%29.chd","filesize":73204057,"score":"","genres":"Compilation","desc":"<p>Ten of Konami's classic arcade games, originally released from 1981-1985, make their their Playstation debut in this compilation:</p><ul><li><strong>Pooyan</strong> - As your fellow pigs lower and raise you in an elevator for the perfect shot, you must defend them against the wolves. Shoot their balloons with arrows or make a bunch of them lose their grip by hitting them with meat. Time too many shots poorly and the wolves will inch their way up the tree towards you and the other pigs. The higher they get, the higher of an area you're restricted to for aiming.</li><li><strong>Circus Charlie</strong> - Six games of timing, reflex and patience in one, each more difficult than the last. Jump a lion through hoops and over flaming urns. Hurdle over monkeys on a tight rope. Bounce from trampoline to trampoline. Roll and leap from ball to ball. Avoid being knocked off your horse by jumping over or bouncing off of springboards. And at the most challenging level, fly from trapeze to trapeze.</li><li><strong>Shao-Lin's Road</strong> - Leap from level to level, kicking henchmen and their tougher bosses. Collect powerups like the roatating energy ball and the spiked ball.</li><li><strong>Roc 'N Rope</strong> - Cavemen and lizards impede your climb to reach the elusive Phoenix. Your only tools are a rope and flashlight. Throw your rope, climb up, and avoid your enemies or blind them with your flashlight.</li><li><strong>Yie Ar Kung-Fu</strong> - One of the granddaddies of one-on-one fighters. Start with the giant Buchu, working your way up through the ranks against armed opponents using only your punches and kicks. Each angle combined with either punch or kick provides a different attack.</li></ul><p><strong>Scramble</strong> - Fly your rocket through enemy territory, avoiding enemy missiles or taking them down with your blasters or bombs. If you run out of fuel, you're history, so remember to shoot the fuel tanks to refuel.</p><p><strong>Road Fighter</strong> - A high-speed top-down racer. Pass other racers to increase your score. Crashing results in fuel penalties. Run into the multi-colored fuel cars or run the risk of running out of gas.</p><p><strong>Super Cobra</strong> - The speedy sequel to Scramble. Pilot your helicopter through similar territory, once again taking out rockets and fuel tanks. But now, you'll have to contend with turrets and other new enemies.</p><p><strong>Gyruss</strong> - Wave-based shmup in which you move your ship around the screen in a 360 degree loop. Avoid the swooping enemies and their shots. Grabbing the double shot increases your chances of survival.</p><p><strong>Time Pilot</strong> Pilot your craft in every direction through borderless levels spread across time. Biplanes, blimps, and more will try to take you out before you can eliminate them. Catch parachuters for bonus points.</p><p>Each game, originally mated with a vertical monitor in the arcade, has been shrunk to fit the horizontal display common to most homes. Accomodating for the smaller playfield size, scores, lives and power meters for most games have been moved to the previously empty space on the righthand side.</p><p>Added features include the following:</p><p><strong>Saving</strong> - Retain all of your high scores.</p><p><strong>Difficulty and Life Counts</strong> - Adjust them to your liking.</p><p><strong>DualShock Compatibility</strong> - Use the analog stick and/or add vibration feedback to games.</p><p><strong>Histories</strong> - Simple history pages featuring release dates, screenshots and trivia.</p><p><strong>Pre-game Instructions and Tips</strong> - Don't know how to play? As the game loads, you are presented with a simple instruction set, similar to what would have been on the original machine. Hit left or right at that screen for more detailed gameplay tips.</p>"},{"name":"Koneko Mo Issyo","year":2000,"developer":"","url":"psx-chd-roms-k/Koneko%20mo%20Issho%20%28Japan%29.chd","filesize":323747651,"score":"","genres":"DLC / Add-on > NPC / enemy > Story / mission","desc":"<p>Koneko Mo Issyo is an add-on disc for 1999’s Doko Demo Issyo. The game is a hybrid of virtual pet and chat toy. This add-on stars a white cat named Toro Inoue, though unlike in <em>Doko Demo Issyo</em>, in <em>Koneko Mo Issyo</em> Toro is a kitten. The game revolves around the use of the PocketStation accessory to take Toro around with you, where you can chat and interact with them.</p>"},{"name":"Konohana: True Report","year":2001,"developer":"VRIDGE Inc.","url":"psx-chd-roms-k/Konohana%20-%20TrueReport%20%28Japan%29.chd","filesize":236677500,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Detective / mystery","desc":"<p><em>Konohana: True Report</em> is a murder mystery adventure game with a touch of supernatural. This is the first game in Konohana series and takes place in a high-school, featuring Meguru Momoi as a protagonist, a second year student who just moved to Konohana high-school. As things would have it, what you thought to be the peaceful period until the graduation turns into a suspense thriller. The teacher has been killed, and together with Miako Tachibana, a second year student who is part of a school's newspaper club, you end up entangled in trying to solve the mystery behind the series of murder and the \"Legend of Grim Reaper\".</p>"},{"name":"Koro Koro Post Nin","year":2002,"developer":"Media Entertainment Inc"},{"name":"Kōshien V","year":1997,"developer":"Magical Company Ltd."},{"name":"Kotobuki Grand Prix","year":1999,"developer":"Syscom Entertainment Inc.","url":"psx-chd-roms-k/Kotobuki%20Grand%20Prix%20%28Europe%29.chd","filesize":69474105,"score":"","genres":"Racing / Driving > Behind view > Anime / Manga > Direct control > Bike / Bicycling","desc":"<p>Choose from one of eight characters, each with their own unique bike and riding style, in this crazy race where anything goes! Use wacky power-ups against the opposition over single races or in the story mode. Alternatively, take on a friend in a two-player head to head battle for the finish line. Kotubuki Grand Prix is a colourful and action-packed two-wheeled racer for players of all abilities!</p>"},{"name":"Koudelka (DIsk 1)","year":1999,"developer":"Sacnoth","url":"psx-chd-roms-k/Koudelka%20%28Europe%29%20%28Disc%201%29.chd","filesize":219676573,"score":7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Cinematic camera > Turn-based > Survival horror > Detective / mystery > Horror","desc":"<p>The year is 1898. A young gypsy woman named Koudelka, who possesses unique spiritual abilities, is off to Wales, to investigate the mystery of the Nameton monastery. This monastery was once a regular place of worship, but later was bought by a mysterious man whose death circumstances are yet unclear. Rumors say that supernatural powers have appeared in the monastery since then. But when she begins to explore the monastery, Koudelka discovers she was not the only one who was interested in its past... </p><p><em>Koudelka</em> is a role-playing game with elements of survival horror. Players take the role of Koudelka as she explores the monastery, gathering clues and solving puzzles. This aspect of the gameplay is therefore similar to a survival horror game; however, the combat is strategic and turn-based. During battles, players can position and move the party members freely on the battle field. The amount of actions that can performed during a turn depends on the dexterity of the character. There are also various support and attack spells to cast.</p><p>The game features a refined weapon management, in which the damage that is inflicted with a particular kind of weapon (bare hands, guns, maces, etc.) increases the more that the weapon is used. Eventually weapons will break, but new ones can be found from defeated enemies. When one of the characters levels up, players can freely distribute experience points to increase and customize any of their statistics and parameters.</p>"},{"name":"Koudelka (DIsk 2)","year":1999,"developer":"Sacnoth","url":"psx-chd-roms-k/Koudelka%20%28Europe%29%20%28Disc%202%29.chd","filesize":224379795,"score":7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Cinematic camera > Turn-based > Survival horror > Detective / mystery > Horror","desc":"<p>The year is 1898. A young gypsy woman named Koudelka, who possesses unique spiritual abilities, is off to Wales, to investigate the mystery of the Nameton monastery. This monastery was once a regular place of worship, but later was bought by a mysterious man whose death circumstances are yet unclear. Rumors say that supernatural powers have appeared in the monastery since then. But when she begins to explore the monastery, Koudelka discovers she was not the only one who was interested in its past... </p><p><em>Koudelka</em> is a role-playing game with elements of survival horror. Players take the role of Koudelka as she explores the monastery, gathering clues and solving puzzles. This aspect of the gameplay is therefore similar to a survival horror game; however, the combat is strategic and turn-based. During battles, players can position and move the party members freely on the battle field. The amount of actions that can performed during a turn depends on the dexterity of the character. There are also various support and attack spells to cast.</p><p>The game features a refined weapon management, in which the damage that is inflicted with a particular kind of weapon (bare hands, guns, maces, etc.) increases the more that the weapon is used. Eventually weapons will break, but new ones can be found from defeated enemies. When one of the characters levels up, players can freely distribute experience points to increase and customize any of their statistics and parameters.</p>"},{"name":"Koudelka (DIsk 3)","year":1999,"developer":"Sacnoth","url":"psx-chd-roms-k/Koudelka%20%28Europe%29%20%28Disc%203%29.chd","filesize":261087533,"score":7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Cinematic camera > Turn-based > Survival horror > Detective / mystery > Horror","desc":"<p>The year is 1898. A young gypsy woman named Koudelka, who possesses unique spiritual abilities, is off to Wales, to investigate the mystery of the Nameton monastery. This monastery was once a regular place of worship, but later was bought by a mysterious man whose death circumstances are yet unclear. Rumors say that supernatural powers have appeared in the monastery since then. But when she begins to explore the monastery, Koudelka discovers she was not the only one who was interested in its past... </p><p><em>Koudelka</em> is a role-playing game with elements of survival horror. Players take the role of Koudelka as she explores the monastery, gathering clues and solving puzzles. This aspect of the gameplay is therefore similar to a survival horror game; however, the combat is strategic and turn-based. During battles, players can position and move the party members freely on the battle field. The amount of actions that can performed during a turn depends on the dexterity of the character. There are also various support and attack spells to cast.</p><p>The game features a refined weapon management, in which the damage that is inflicted with a particular kind of weapon (bare hands, guns, maces, etc.) increases the more that the weapon is used. Eventually weapons will break, but new ones can be found from defeated enemies. When one of the characters levels up, players can freely distribute experience points to increase and customize any of their statistics and parameters.</p>"},{"name":"Koudelka (DIsk 4)","year":1999,"developer":"Sacnoth","url":"psx-chd-roms-k/Koudelka%20%28Europe%29%20%28Disc%204%29.chd","filesize":281855975,"score":7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Cinematic camera > Turn-based > Survival horror > Detective / mystery > Horror","desc":"<p>The year is 1898. A young gypsy woman named Koudelka, who possesses unique spiritual abilities, is off to Wales, to investigate the mystery of the Nameton monastery. This monastery was once a regular place of worship, but later was bought by a mysterious man whose death circumstances are yet unclear. Rumors say that supernatural powers have appeared in the monastery since then. But when she begins to explore the monastery, Koudelka discovers she was not the only one who was interested in its past... </p><p><em>Koudelka</em> is a role-playing game with elements of survival horror. Players take the role of Koudelka as she explores the monastery, gathering clues and solving puzzles. This aspect of the gameplay is therefore similar to a survival horror game; however, the combat is strategic and turn-based. During battles, players can position and move the party members freely on the battle field. The amount of actions that can performed during a turn depends on the dexterity of the character. There are also various support and attack spells to cast.</p><p>The game features a refined weapon management, in which the damage that is inflicted with a particular kind of weapon (bare hands, guns, maces, etc.) increases the more that the weapon is used. Eventually weapons will break, but new ones can be found from defeated enemies. When one of the characters levels up, players can freely distribute experience points to increase and customize any of their statistics and parameters.</p>"},{"name":"Kowai Syasin: Shinrei Syasin Kitan","year":2002,"developer":"Media Entertainment Inc","url":"psx-chd-roms-k/Kowai%20Shashin%20-%20Shinrei%20Shashin%20Kitan%20%28Japan%29.chd","filesize":24345070,"score":"","genres":"Action > 1st-person > Anime / Manga > Live action > Quick Time Events (QTEs) > Direct control > Fantasy > Japan (Modern/Futuristic) > Horror","desc":"<p><em>Kowai Syasin: Shinrei Syasin Kitan</em> is an action game similar to the Fatal Frame series. Hiori is a girl who can see the spirits of the dead. She becomes an exorcist who specializes in expelling evil spirits that live in photographs. Through the game she receives various requests from people who send her haunted photographs and she then needs to expel them. All the photos are real, digitized photos.</p><p>While viewing a photo there is free zooming and movement to find the correct spots. A candle burns slowly, acting as a time limit. At certain points Quick Time Events need to be completed to expel the ghosts and complete the photo.</p>"},{"name":"Kowloon's Gate","year":1997,"developer":"Zeque"},{"name":"Kowloon's Gate: Jiǔlóng Fēngshuǐ Zhuàn (Shokai Genteiban)","year":1997,"developer":""},{"name":"Krazy Ivan","year":1996,"developer":"Psygnosis Limited","url":"psx-chd-roms-k/Krazy%20Ivan%20%28Europe%29.chd","filesize":434347472,"score":6.6,"genres":"Action > 1st-person > Arcade > Shooter > Mecha / giant robot > Europe > Middle East > Sci-fi / futuristic","desc":"<p>In the early 21st century, the Earth is under attack by aliens. In five areas of the planet, they have erected energy generators, creating a field that slowly encompasses the entire planet surface. They have also taken hundreds of humans prisoner. Someone has to stop them. Enter Russian Commander Ivan Popovich, nicknamed \"Krazy Ivan\". He is a paranoid schizophrenic, prone to burst out into violence at any time. In other words, he's perfect for the job.</p><p>The player controls Ivan's \"Steel Cossack\" power suit on the three-dimensional battlefields. In each of the five areas in the game, two kinds of enemies can be found: Drones and Sentients. Drones are smaller air and ground vehicles that often respawn. Sentients are mechs similar in size and capability to the Steel Cossack. Each of the Sentients must be eliminated before the energy field generator can be destroyed to complete the mission.</p><p>The Cossack is capable of carrying lots of weapons: projectile and energy guns, unguided and guided missiles, and other special weapons. Destroyed enemies reveal captured humans, to be rescued by Ivan, and power-ups, which recharge shields or rearm weapons.</p><p>After a successful mission, Ivan can upgrade the Cossack with more powerful weapons and replace the mech's armor.</p><p>Between the missions, rather humorous live-action cutscenes (starring English actors sporting thick Russian accents) continue the story.</p>"},{"name":"Kunoichi Torimonochou","year":1999,"developer":"Polestar Co., Ltd.","url":"psx-chd-roms-k/Kunoichi%20Torimonochou%20%28Japan%29.chd","filesize":360683868,"score":"","genres":"Adventure > 3rd-person (Other) > Anime / Manga > Fantasy","desc":"<p>Long ago, during the Edo period, those chosen to become ninja train in secrecy from youth, living in an isolated village to become a secret agent for the shogun. Here, a young girl is training to become such an agent; her name: Ran Sagajo. Along with her talking ninja squirrel companion Sasuke, she has begun a trip to Edo to continue her training.</p><p><em>Kunoichi Torimonochō</em> (Kunoichi Detective Story) is a Japanese-style adventure game. Take the role of Ran and travel around Edo, interact with a variety of colorful characters, play numerous minigames, and attempt to train Ran into a proper Kunoichi. There are multiple endings depending upon your choices and performance through the game.</p>"},{"name":"Kuro no Ken","year":1997,"developer":"Forest","url":"psx-chd-roms-k/Kuro%20no%20Ken%20-%20Blade%20of%20the%20Darkness%20%28Japan%29.chd","filesize":202356969,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>Long time ago, the Black Dragon was destroying human cities and devouring human beings. A sword imbued with magical powers was made in order to destroy the dragon. It was known as the Blade of Darkness. The dragon was defeated, and the sword disappeared after the battle. Now, unholy people attempt the resurrection of the Black Dragon. Shinobu Ryudo, a young girl from the Dark-Haired tribe, begins a long and perilous journey across the main continent to find the sword and prevent the dragon's resurrection. Meanwhile, the warrior Kayes is instructed by the oracle to look for the sword as well. Will the heroes join forces to defeat the evil?..</p><p><em>Kuro no Ken</em> is a rather standard Japanese-style RPG with all the familiar ingredients: top-down locations, navigation on the world map, random enemies, turn-based combat, automatic leveling up, etc. The battles are viewed from a third-person perspective, using much larger character sprites than during exploration. Shinobu and Kayes can use physical attacks or magic spells (learned automatically when leveling up), which deplete MP.</p>"},{"name":"Kuroi Hitomi no Noah: Cielgris Fantasm","year":1999,"developer":"Gust Co., Ltd.","url":"psx-chd-roms-k/Kuroi%20Hitomi%20no%20Noir%20-%20Cielgris%20Fantasm%20%28Japan%29.chd","filesize":150077181,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy","desc":"<p>Noah was quietly plying with her friend Disteen, but as they were exploring a cave they accidentally release a demon who had been sleeping for a thousand years. As Disteen tells Noah to escape, he gets turned to stone. The goddess Nil then appears before Noah and tells her that her friend can be saved. And thus, Noah embarks on a quest to undo the demon's curse, but she has to defeat him within three years. As the game progresses, time also passes, and different events occur at different times.</p><p><em>Kuroi Hitomi no Noah: Cielgris Fantasm</em> plays mostly like traditional Japanese-style RPGs such as Breath of Fire: the protagonist travels on the map and interacts with various people, and in her travels, also encounters monsters that she must fight. The encounters are typical turn-based battles in which the player assigns actions to be performed by the party members. However, Noah has the ability to befriend monsters and can recruit them when they have been weakened. They can then be summoned in battle to fight alongside the party members. At the end of battle, the participating members and monsters gain experience points to increase their level.</p><p>To gain money, rather than earn it from defeated foes, Noah has to fulfill requests that can be taken at the town tavern. These requests have her perform various tasks such as dish-washing, escort missions, deliveries and monster extermination.</p>"},{"name":"Kurt Warner's Arena Football Unleashed","year":2000,"developer":"Midway Games, Inc.","url":"psx-chd-roms-k/Kurt%20Warner%27s%20Arena%20Football%20Unleashed%20%28USA%29.chd","filesize":299201921,"score":"","genres":"Sports > Football (American) > Licensed","desc":"<p>Kurt Warner's Arena League Unleashed is a modified version of NFL Blitz set in the Arena Football League. Arena ball is a version of American football played indoors on a 50 yard field with nets behind each endzone and boards on the sidelines.</p><p>KWALU is a six on six game (real arena ball is eight on eight) with no penalties so post tackle stomping and dog piles are encouraged. All 16 teams from the 1999 season are represented including Kurt's former team, the Iowa Barnstormers.</p>"},{"name":"Kurukuru Marumaru","year":2001,"developer":"Japan Art Media Co., Ltd.","url":"psx-chd-roms-k/Kuru%20Kuru%20Maru%20Maru%20%28Japan%29.chd","filesize":271136826,"score":"","genres":"Racing / Driving > 1st-person > Anime / Manga > Real-time > Direct control > Automobile","desc":"<p>Teenager Wakaba is finally getting his driver's license, so he can go on a date with his girlfriend Clutch. He picked the cheapest driving school he could find, but the brochure is a bit odd: It says that he won't be able to go home for a while. They even send someone from their staff to fetch him, a person with a weird laugh and a tail! So Wakaba says his goodbyes to his girlfriend and leaves for the driving school.</p><p><em>Kurukuru Marumaru</em> is a cartoony driving game where your character is taking driving lessons. After each lesson you are scored for Travel Time, Traffic Rules and Driving Technique. The driving simulation is somewhat realistic, requiring you to use turn signals, look before turning and obey traffic rules. The 15+ lessons become rather unusual very quickly, like asking you to balance an egg on the dashboard, or dodging colorful fantasy animals on the road.</p>"},{"name":"Kururin Pa!","year":1995,"developer":"Sky Think Systems Co. Ltd.","url":"psx-chd-roms-k/Kururin%20Pa%21%20%28Japan%29.chd","filesize":270878000,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Anime / Manga > Real-time > Falling block puzzle","desc":"<p><em>Kururin Pa!</em> takes an explosive take on the falling block genre. Players drop pairs of blocks containing string; linking up different blocks of string can produce long lines that cross the playfield. Sometimes, the player will be given a spark of fire instead; lighting up one of the ends of a piece of string will set the entire piece on fire, destroying many pieces at once. In addition to the string, there are a few garbage blocks: snowmen, who melt when adjacent squares are comboed; and two different kinds of bombs, which expand the players' combo abilities.</p>"},{"name":"Kurushi Final: Mental Blocks","year":1998,"developer":"G-artists","url":"psx-chd-roms-k/Kurushi%20Final%20%28Europe%29.chd","filesize":313314659,"score":7.2,"genres":"Action > Puzzle > 3rd-person (Other) > Direct control","desc":"<p><em>Kurushi Final: Mental Blocks</em> is a puzzle game where your wits are pitted against a 'higher power'. It is the sequel to Kurushi.</p><p>Standing on an isolated platform, you must destroy blocks that are rolling towards you in order to survive. By destroying certain blocks, the size of the platform increases. If blocks fall off the edge of the platform, or you destroy the incorrect blocks, the platform becomes smaller.</p><p>There are four game modes: 100 Attack, Survival, Create and Final. It has nine player characters (1 Initial, 8 Hidden) and includes a facility to create custom levels.</p>"},{"name":"Kyoufu Shinbun","year":1997,"developer":"Atelier Double Co. Ltd.","url":"psx-chd-roms-k/Kyoufu%20Shinbun%20%28Japan%29.chd","filesize":263312565,"score":"","genres":"Adventure > 1st-person > 3rd-person (Other) > Anime / Manga > Detective / mystery > Horror","desc":"<p>In <em>Kyōfu Shinbun</em>, you play the game as a character who has begun to receive a subscription, well its thrown through the glass of your window, to a mysterious newspaper. This daily publication \"Horror Newspaper\" predicts disasters and deaths. A strange violent poltergeist, represented by an oddly elongated spectral face, follows you and seems to have a connection with the paper. You'll interact with a number of people mentioned in the paper and try to safely navigate the games story while trying to unravel the mystery of this \"Horror Newspaper\".</p>"},{"name":"Kyoro-chan no Purikura Daisakusen","year":1999,"developer":"KAN's Co., Ltd."},{"name":"Kyuiin","year":1996,"developer":"","url":"psx-chd-roms-k/Kyuiin%20%28Japan%29.chd","filesize":317170091,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Shooter > Fantasy","desc":"<p>Two kids are cleaning their room when they find a book of fairy tales. Suddenly a fairy pops out of the book and tells them about an evil wizard who is tampering the fairy tales. Hopping on the vacuum cleaner the kids travel to the fairy land to help the fairy. </p><p><em>Kyuiin</em> is a horizontal shoot-'em-up set in a fairy tale world. The players control a boy (and a girl in 2-player mode) who flies around on a vacuum cleaner fighting an array of fairy tale characters like Snow White, The Big Wolf, Frog Prince etc. In addition to a standard primary attack there is an ability to suck up certain enemies and projectiles into the vacuum thus building up a special power. Once activated this special power sends back all enemies that have been sucked in into a beam of energy and it grants a short period of invincibility. There is also a backfire cannon helpful against enemies attacking from the left side of the screen. If the boy is hit once he loses all his weapon upgrades, and a second hit destroys the boy.</p>"},{"name":"Kyuutenkai: Fantastic Pinball","year":1995,"developer":"Technosoft Co., Ltd.","url":"psx-chd-roms-k/Kyuutenkai%20%28Japan%29.chd","filesize":208634693,"score":"","genres":"Action > Simulation > 1st-person > Top-down > 2D scrolling > Anime / Manga > Pinball > Direct control > Fantasy","desc":"<p><em>Fantastic Pinball</em> plays very similar to the Alien Crush/Devil's Crush series of pinball games. This game also offers living bumpers, wandering enemies, and bonus rounds that take place outside of the main table. </p><p>The character art and background designs are of an anime style.</p><p>You can select from three different characters before the plunger is pulled. They each have their own attributes that affect how the game is played. The pinball can also be powered up, allowing it to hit enemies and obstacles for greater damage.</p>"}]