[{"name":"Land Before Time, The: Big Water Adventure","year":2002,"developer":"Digital Illusions Canada, Inc.","url":"psx-chd-roms-l/Land%20Before%20Time%2C%20The%20-%20Big%20Water%20Adventure%20%28Europe%29.chd","filesize":233332721,"score":"","genres":"Action > Platform > Licensed","desc":"<p><em>The Land Before Time: Big Water Adventure</em> is a single player platform game based on Universal Picture's film The Land Before Time IX: Journey to Big Water. The storyline is the same, Little Mo is stranded in the Great Valley after torrential rain and must return to the Big Water to rejoin his family. So Littlefoot, Ducky, Cera or Spike and Petrie all help him get there.</p><p>The game consists of a series of short levels in which the player runs across the landscape jumping over chasms and collecting tree stars. Every couple of levels there's a challenge such as a race which must be completed successfully in order to progress. These challenges can be completed as either Littlefoot, Ducky, Cera or Spike. Mo has his/her/its own game when the Big Water is reached and Peitrie has a picture puzzle game using pictures that are unlocked as the player progresses through the game collecting tree stars.</p><p>There are no lives in this game. The player may fail on any jump multiple times and they are still taken back to a point where they can restart and try it again.</p>"},{"name":"Land Before Time, The: Great Valley Racing Adventure","year":2001,"developer":"Vision Scape Interactive, Inc.","url":"psx-chd-roms-l/Land%20Before%20Time%2C%20The%20-%20Great%20Valley%20Racing%20Adventure%20%28USA%29.chd","filesize":128233761,"score":"","genres":"Racing / Driving > Behind view > Licensed","desc":"<p><em>The Land Before Time: Great Valley Racing Adventure</em> is a racing game from the Universal cartoon \"The Land Before Time\" with Littlefoot, Spike, Cera and Ducky.</p><p>The gameplay consists in Obstacle Courses and Racetracks, Obstacle Courses is an arcade style race against the time or score (depending the difficulty level) and Racetracks is a race between two competitors against the CPU or 2 player mode.</p>"},{"name":"Land Before Time, The: Return to the Great Valley","year":2000,"developer":"Realtime Associates, Inc.","url":"psx-chd-roms-l/Land%20Before%20Time%2C%20The%20-%20Return%20to%20the%20Great%20Valley%20%28Europe%29.chd","filesize":161945327,"score":"","genres":"Action > Behind view > Platform > Puzzle elements > Prehistoric > Licensed","desc":"<p><em>The Land Before Time: Return to the Great Valley</em> is a 3D platform game based on the animated film series of The Land Before Time. While playing hide and seek Littlefoot and Cera find a stolen sharptooth egg. Latter Ducky and Spike join them and decide they should return the egg. When delivering the egg to a nest the are chased away by a large sharptooth and get separated. Now they each have to find their way back home.</p><p>In the game the player take control of Littlefoot, Cera, Ducky and Spike. Petrie the flying dinosaur gives instructions while playing as one of the four playable characters that each have their own set of levels. Gameplay includes platforming, collecting leaves and solving simple puzzles. The game can be played on three levels of difficulty.</p>"},{"name":"Langrisser I & II","year":1997,"developer":"Career Soft","url":"psx-chd-roms-l/Langrisser%20I%20%26%20II%20%28Japan%29.chd","filesize":498495931,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>This is a remake of two games: Langrisser (known as <em>Warsong</em> in the USA) and its sequel, Langrisser II – or, better to say, the enhanced version of this sequel, known as Der Langrisser. </p><p>The remake features the Ultima-style character creation (you choose between various answers to morally provoking questions) introduced in <em>Der Langrisser</em>, and also offers a branching storyline (you can be good or side with the evil forces, if you wish). </p><p>The Sega Saturn port titled <em>Langrisser: Dramatic Edition</em> adds 2 new story lines to the <em>Langrisser II</em> part. One is \"true brilliant\" route which is the best ending that allows most characters to stay alive at the ending. The other one, \"downfall\" route, is a totally tragic ending as the name suggests.</p>"},{"name":"Langrisser IV & V: Final Edition (Disk 1)","year":1999,"developer":"NCS Corporation","url":"psx-chd-roms-l/Langrisser%20IV%20%26%20V%20-%20Final%20Edition%20%28Japan%29%20%28Disc%201%29%20%28Langrisser%20IV%20Disc%29.chd","filesize":380621294,"score":"","genres":"Compilation > Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Fantasy > Sci-fi / futuristic","desc":"<p>This is a Playstation release of two Saturn games bundled together: Langrisser IV and Langrisser V: The End of Legend. Both games form a separate sub-story within this strategy RPG series.</p>"},{"name":"Langrisser IV & V: Final Edition (Disk 2)","year":1999,"developer":"NCS Corporation","url":"psx-chd-roms-l/Langrisser%20IV%20%26%20V%20-%20Final%20Edition%20%28Japan%29%20%28Disc%202%29%20%28Langrisser%20V%20Disc%29.chd","filesize":379463508,"score":"","genres":"Compilation > Role-playing (RPG) > Strategy > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Fantasy > Sci-fi / futuristic","desc":"<p>This is a Playstation release of two Saturn games bundled together: Langrisser IV and Langrisser V: The End of Legend. Both games form a separate sub-story within this strategy RPG series.</p>"},{"name":"Largo Winch - Commando SAR","year":2002,"developer":"Rebellion Developments Ltd.","url":"psx-chd-roms-l/Largo%20Winch%20-%20Commando%20SAR%20%28Europe%29%20%28En%2CDe%2CEs%2CIt%29.chd","filesize":126083370,"score":"","genres":"Action > 3rd-person (Other) > Stealth > Spy / espionage > Licensed","desc":"<p>Largo Winch, playboy billionaire and international crime fighter, attends the opening of a new chemical factory in Venezuela when the complex is suddenly attacked by terrorists. They plant a bomb and take Tania Kournakova hostage, a journalist friend. Use a combination of stealth and hand-to-hand combat to infiltrate high tech offices, desert fortresses and a remote oil rig. Next to regular weapons, Largo can also use a brainwave scanner to scan the position and status of guards, a radio, and a toolbox to hack or modify electronic systems.</p><p>This third-person, stealth action game is based on the Belgian Largo Winch comic book series by Philippe Francq and Jean Van Hamme, edited by Dupuis.</p>"},{"name":"Las Vegas Dream 2","year":1997,"developer":"Dice Co., Ltd.","url":"psx-chd-roms-l/Las%20Vegas%20Dream%202%20%28Japan%29.chd","filesize":302794988,"score":"","genres":"Gambling > 1st-person > Fixed / flip-screen > Full Motion Video (FMV) > Menu structures > Sci-fi / futuristic","desc":"<p>With $1000 in your pocket, you enter a futuristic casino with the hope of becoming a high roller. At the casino, you have the option of trying your hand at slots, blackjack, craps, roulette, poker, or keno. The game also contains a practice mode for the games. You have eight days in total to become a VIP and win the game. Each game takes off a bit of time for each playthrough, and there is also an eight-hour sleep option.</p><p>Despite only being released in Japan, the game contains English voice acting and FMVs. The FMVs set up encounters that can cause the player to either win or lose money by pawning off jewelry or asking for a favor. They can also simply drain the eight day clock via going shopping or viewing fireworks with the fellow casino goers.</p>"},{"name":"Last Blade, The","year":1999,"developer":"SNK Corporation"},{"name":"Lattice","year":2000,"developer":"nousite, inc.","url":"psx-chd-roms-l/Lattice%20-%20200EC7%20%28Japan%29.chd","filesize":292000646,"score":"","genres":"Action > 1st-person > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Lattice</em> is a high-speed abstract rail-shooter. The player constantly moves forward at a rapid pace along straight square pathways connected by junctions. Enemies and obstacles swarm from all sides, attacking or obstructing the player, which must either shoot and destroy them or avoid them by either moving to other sides of the path or jumping over them. The player can change their path through the stage at various junctions, as well as turn around and head the opposite direction if necessary.</p><p>The goal of each stage is to locate and capture three \"key capsules\" within the time limit and without running out of life. As the stages progress, they become increasingly complex, introducing more branching paths and ways to traverse the paths such as the ability to jump to adjacent pathways. There are also a variety of special weapons that can be found.</p><p>At the end of each stage, the player is graded on several criteria and given a score. Progress is saved using passwords. There are three difficulty levels, and seven stages in total.</p>"},{"name":"Le Concert","year":2000,"developer":""},{"name":"Le Concert ff","year":1999,"developer":"SAME Creative Inc.","url":"psx-chd-roms-l/Le%20Concert%20-%20ff%20-%20Fortissimo%20%28Japan%29.chd","filesize":300467031,"score":"","genres":"Action > Music / rhythm","desc":"<p><em>Le Concert ff</em> (fortissimo) is a rhythm game in which the player takes the role of a young male classic orchestra conductor. Fortissimo is a term in music dynamics meaning \"to be played very loudly.\" It was released alongside Le Concert pp.</p><p>There are five open stages, plus a secret one which will appear only if good results were achieved. After beating the stage 5, a short ending will play. To see the \"real\" ending (plus credits), the stage 6 must be finished. Before and after each stage there will be dialogues between the protagonist and other characters.</p><p>Every level consists basically on directing the orchestra by making the right movements and hitting the buttons in proper time. \"Pieces\" of the music appear from the right of the screen, the better you get the higher your ranking will be.</p><p>There are two different game styles: gamers mode and musicians mode. In the latter one, \"musical dynamics\" will be displayed instead of regular buttons (those from the playstation controller).</p><p>Once a stage is finished, the music will be unlocked and can be listened in the \"listening room\". One of the music included in Fortissimo is \"Eine kleine Nachtmusik\" (composed by Wolfgang Amadeus Mozart).</p>"},{"name":"Le Concert: pp Pianissimo","year":1999,"developer":"SAME Creative Inc.","url":"psx-chd-roms-l/Le%20Concert%20-%20pp%20-%20Pianissimo%20%28Japan%29.chd","filesize":304333846,"score":"","genres":"Action > Music / rhythm","desc":"<p><em>Le Concert pp</em> (pianissimo) is a rhythm game in which the player takes the role of a young female classic orchestra conductor. \"Pianissimo\" refers to the volume of a soft sound or soft note. It was released alongside Le Concert ff.</p><p>There are five open stages, plus a secret one which will appear only if good results were achieved. After beating the stage five, a very short ending will play. To see the \"real\" ending (plus credits), the stage six must be finished. Before and after each stage there will be dialogues between the protagonist and other characters.</p><p>Every level consists basically on directing the orchestra by making the right movements and hitting the buttons in proper time. \"Pieces\" of the music appear from the right of the screen, the better you get the higher your ranking will be.</p><p>There are two different game styles: gamers mode and musicians mode. In the latter one, \"musical dynamics\" will be displayed instead of regular buttons (those from the PlayStation controller).</p><p>Once a stage is finished, the music will be unlocked and can be listened in the \"listening room\". One of the music included in Pianissimo is \"Radetzky March\" (composed by Johann Strauss Sr.).</p>"},{"name":"Legacy of Kain: Soul Reaver","year":1999,"developer":"Crystal Dynamics, Inc.","url":"psx-chd-roms-l/Legacy%20of%20Kain%20-%20Soul%20Reaver%20%28Europe%29.chd","filesize":399608306,"score":8,"genres":"Action > Behind view > Metroidvania > Puzzle elements > Fantasy > Horror > Regional differences","desc":"<p>One thousand five hundred years after the events of Blood Omen: Legacy of Kain, the vampire Kain's decision at the end of that game has finally defeated the human kingdoms and brought the world of Nosgoth under his control. Ruling from a castle built on the Pillars of Nosgoth, Kain has established an empire of six vampire clans, each ruled by a lieutenant, the sons of Kain. Raziel was one such lieutenant but lost his position through the insolence of receiving a new evolutionary \"dark gift\", the growth of feathery wings before his master had acquired it. Fearing that Raziel might one day surpass him, Kain tears off Raziel's wings in a fit of rage and banishes him into the Abyss. There, Raziel is lost in time, dead and his body consumed. The Elder God recovers Raziel's soul and rebuilds the broken body, not as a living vampire, but as a strange new creature of the underworld. Swearing revenge on Kain, Raziel now phases seamlessly between Nosgoth and its underworld, using his new powers to become a terrible reaver of souls...</p><p><em>Soul Reaver</em> is a third-person perspective action game with puzzle-solving and some platforming elements. The game follows Raziel on his quest to purge the land of vampires and take revenge on Kain and his brothers, leaders of the six clans. The player views the environment from behind Raziel's shoulder, moving him in any direction, climbing, attacking, jumping, and using specific abilities. Raziel can grip onto the edge of ledges and his torn wings allow him to glide gently downwards. He can also shift through the material world into the spectral realm at will but must find specific locations in order to shift back. The two realms mirror one another, with distortions which give access to new areas and platforms. Existing in the material world drains Raziel's life energy at a constant rate. </p><p>Throughout the game, energy is recovered by consuming the souls of defeated enemies. If Raziel is able to defeat one of his brothers, he will additionally gain a new ability (\"dark gift\") upon drinking his soul. Examples include: the ability to swim, file telekinetic projectiles, or the ability to phase through locked gates. Raziel can arm himself with a variety of weapons including spears, daggers, swords, axes, as well as attacking enemies barehanded. Eventually, he will also come across Kain's personal sword (named the Soul Reaver) and will use it to create a powerful energy blade weapon.</p><p>The world is left open to Raziel, he can return to areas previously completed and explore the world of Nosgoth at will. Access to certain areas however sometimes requires the use of gained specific abilities. Many of the puzzles the player will need to solve in this quest are block puzzles, requiring the placement of certain large structures (usually square blocks), either to activate switches or to build access to out-of-reach areas.</p>"},{"name":"Legend","year":1998,"developer":"Toka S.a.r.l.","url":"psx-chd-roms-l/Legend%20%28Europe%29.chd","filesize":273111407,"score":"","genres":"Action > 3rd-person (Other) > Side view > Beat 'em up / brawler > Hack and slash > Fantasy","desc":"<p><em>Legend</em> is the sequel to it's namesake for the SNES. Despite the conversion to 3D, the game still keeps all the action in a two dimensional plane.</p><p>The Kingdom of Tovakia is overtaken by chaos and despair. After several assassination attempts, the king's brother is sent into exile. During his exile, however, he learns the dark arts of sorcery. He summons a demon to support him in his quest to rule over Tovakia. When he manages to kidnap the king, it is up to the protagonists to save him, and Tovakia, from the evil brother.</p><p>You can choose to play one of three characters: Axel (all-round character), Tara (fast and good with light weapons) and Karo (slow but strong and good with heavy weapons).</p><p>You will find a wide array of weapons and enemies in this 3D Beat 'em Up. Besides the standard medieval weaponry there are various ranged spells you can use to hurt the enemy. There are five stages to play through and each stage ends with a level boss.</p><p>In multiplayer it is possible to play the game in two player co-op with increased difficulty.</p>"},{"name":"Legend of Dragoon, The (Disk 1)","year":1999,"developer":"Sony Computer Entertainment Inc.","url":"psx-chd-roms-l/Legend%20of%20Dragoon%2C%20The%20%28Europe%29%20%28Disc%201%29.chd","filesize":240296770,"score":6.9,"genres":"Role-playing (RPG) > Diagonal-down > Turn-based","desc":"<p>Dart, a brave and loyal warrior swordsman, has sworn to avenge the death of his parents by destroying the mysterious black monster. For unknown reasons, the Sandora Empire burns down his village and imprisons his childhood friend, Shana. Straight away Dart sets out on a journey to rescue her, but Shana's kidnapping is merely the tip of the iceberg of a much grander, more sinister plot about ancient spiritual powers and the destruction of the human race.</p><p><em>The Legend of Dragoon</em> is a Japanese-style RPG, visually reminiscent of  Final Fantasy VII (pre-rendered backgrounds, 3D characters and battle scenes, CG animations to advance the story). Battle mechanics follow the traditional turn-based prototype, with a few additions such as critical attacks dependent on precise timing, and \"dragoon\" transformations, which allow access to powerful techniques. Game progression is largely linear, with the \"world map\" replaced by locations represented as connected dots.</p>"},{"name":"Legend of Dragoon, The (Disk 2)","year":1999,"developer":"Sony Computer Entertainment Inc.","url":"psx-chd-roms-l/Legend%20of%20Dragoon%2C%20The%20%28Europe%29%20%28Disc%202%29.chd","filesize":270942808,"score":6.9,"genres":"Role-playing (RPG) > Diagonal-down > Turn-based","desc":"<p>Dart, a brave and loyal warrior swordsman, has sworn to avenge the death of his parents by destroying the mysterious black monster. For unknown reasons, the Sandora Empire burns down his village and imprisons his childhood friend, Shana. Straight away Dart sets out on a journey to rescue her, but Shana's kidnapping is merely the tip of the iceberg of a much grander, more sinister plot about ancient spiritual powers and the destruction of the human race.</p><p><em>The Legend of Dragoon</em> is a Japanese-style RPG, visually reminiscent of  Final Fantasy VII (pre-rendered backgrounds, 3D characters and battle scenes, CG animations to advance the story). Battle mechanics follow the traditional turn-based prototype, with a few additions such as critical attacks dependent on precise timing, and \"dragoon\" transformations, which allow access to powerful techniques. Game progression is largely linear, with the \"world map\" replaced by locations represented as connected dots.</p>"},{"name":"Legend of Dragoon, The (Disk 3)","year":1999,"developer":"Sony Computer Entertainment Inc.","url":"psx-chd-roms-l/Legend%20of%20Dragoon%2C%20The%20%28Europe%29%20%28Disc%203%29.chd","filesize":324994788,"score":6.9,"genres":"Role-playing (RPG) > Diagonal-down > Turn-based","desc":"<p>Dart, a brave and loyal warrior swordsman, has sworn to avenge the death of his parents by destroying the mysterious black monster. For unknown reasons, the Sandora Empire burns down his village and imprisons his childhood friend, Shana. Straight away Dart sets out on a journey to rescue her, but Shana's kidnapping is merely the tip of the iceberg of a much grander, more sinister plot about ancient spiritual powers and the destruction of the human race.</p><p><em>The Legend of Dragoon</em> is a Japanese-style RPG, visually reminiscent of  Final Fantasy VII (pre-rendered backgrounds, 3D characters and battle scenes, CG animations to advance the story). Battle mechanics follow the traditional turn-based prototype, with a few additions such as critical attacks dependent on precise timing, and \"dragoon\" transformations, which allow access to powerful techniques. Game progression is largely linear, with the \"world map\" replaced by locations represented as connected dots.</p>"},{"name":"Legend of Dragoon, The (Disk 4)","year":1999,"developer":"Sony Computer Entertainment Inc.","url":"psx-chd-roms-l/Legend%20of%20Dragoon%2C%20The%20%28Europe%29%20%28Disc%204%29.chd","filesize":385610716,"score":6.9,"genres":"Role-playing (RPG) > Diagonal-down > Turn-based","desc":"<p>Dart, a brave and loyal warrior swordsman, has sworn to avenge the death of his parents by destroying the mysterious black monster. For unknown reasons, the Sandora Empire burns down his village and imprisons his childhood friend, Shana. Straight away Dart sets out on a journey to rescue her, but Shana's kidnapping is merely the tip of the iceberg of a much grander, more sinister plot about ancient spiritual powers and the destruction of the human race.</p><p><em>The Legend of Dragoon</em> is a Japanese-style RPG, visually reminiscent of  Final Fantasy VII (pre-rendered backgrounds, 3D characters and battle scenes, CG animations to advance the story). Battle mechanics follow the traditional turn-based prototype, with a few additions such as critical attacks dependent on precise timing, and \"dragoon\" transformations, which allow access to powerful techniques. Game progression is largely linear, with the \"world map\" replaced by locations represented as connected dots.</p>"},{"name":"Legend of Heroes I & II, The","year":1998,"developer":"Nihon Falcom Corp.","url":"psx-chd-roms-l/Legend%20of%20Heroes%20I%20%26%20II%2C%20The%20-%20Eiyuu%20Densetsu%20%28Japan%29.chd","filesize":110522943,"score":"","genres":"Compilation > Role-playing (RPG) > Fantasy","desc":"<p><em>The Legend of Heroes I &amp; II</em> is a bundle composed of two games of the Legend of Heroes series:* The Legend of Heroes</p><ul><li>The Legend of Heroes II</li></ul><p>The bundle was only released in Japan.</p>"},{"name":"Legend of Legaia","year":1998,"developer":"Prokion","url":"psx-chd-roms-l/Legend%20of%20Legaia%20%28Europe%29.chd","filesize":276606106,"score":7.2,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based","desc":"<p><em>Legend of Legaia</em> is a Japanese-style RPG. Your initial party consists of three characters: Vahn, Noa, and Gala - two males and one female. You engage yourself on a quest of freeing your planet from a mysterious mist which is floating above the planet and which can turn anything it touches into a dreadful monster. In order to clean the planet from the horrible mist, you have to find so-called Genesis Trees which are scattered around on the planet. </p><p>The combat system is a bit similar to that of Xenogears, as it utilizes combo attacks. Your choices aren't just attack, defend or use special abilities: the attack option itself has many choices: high-attack, low-attack, kick etc. Apart from this system, the game is a typical Japanese-style RPG with 3D graphics, anime/manga aesthetics, world map exploration, etc.</p>"},{"name":"Legend of Mana","year":1999,"developer":"Square Co., Ltd.","url":"psx-chd-roms-l/Legend%20of%20Mana%20%28USA%29.chd","filesize":360989972,"score":7.8,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Anime / Manga > Action RPG > Fantasy","desc":"<p>A twinkling consciousness became a star that sparkled in the night and banished the darkness. The Mana Goddess acquired consciousness by gazing into the light of that sun. She made Fa'Diel, a great land, but so far an empty one.</p><p>In <em>Legend of Mana</em> the player controls a hero or heroine traveling over the land of Fa'Diel. The game features a land creation system, allowing the player to create new locations and story elements by placing mysterious artifacts. Those ancient artifacts are repositories of the land's long-forgotten memories and the many events that once took place there. As the game advances, the player will receive more artifacts and find out more about the land. It is also possible raise pet monsters and create powerful golems, forge mighty weapons or refine musical instruments. </p><p>The game is non-linear in terms of gameplay, allowing the player to visit areas in any order and play through 67 related scenarios. There is, however, no continuous world to explore, and each scenario is confined to a particular area. Like in the previous games in the series, combat is action-based, but in this installment it takes place on separate side-scrolling screens. AI-controlled characters can fight alongside the protagonist in some of the scenarios.</p>"},{"name":"Legend of Mulan","year":2004,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-l/Legend%20of%20Mulan%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":355543462,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select > China (Ancient / Imperial)","desc":"<p>Mulan is a young girl from a family of famous warriors. A large scale war rages in China and Mulan chooses to join Khan and his troops instead of her father.<br>The war lasts for 12 years and finally Mulan is captured and she is taken to the dungeons. Will she be able to escape...</p>"},{"name":"Legend of Pocahontas","year":2001,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-l/Legend%20of%20Pocahontas%20%28Europe%29%20%28En%2CDe%2CNl%29.chd","filesize":471282066,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select > North America","desc":"<p>When European settlers settle on her father's land, Pocahontas persuades the chief not to go to war, and talks begin with their strange new neighbours. As well as a great half-hour cartoon video, Pocahontas features an easy-to-use virtual colouring book and a challenging puzzle game. Pocahontas is a North-American legend.</p>"},{"name":"LEGO Island 2: The Brickster's Revenge","year":2001,"developer":"Silicon Dreams Studio Ltd.","url":"psx-chd-roms-l/LEGO%20Island%202%20-%20The%20Brickster%27s%20Revenge%20%28Europe%29.chd","filesize":155658846,"score":6.5,"genres":"Action > Racing / Driving > Sports > Behind view > Mini-games > Sandbox / open world > Tricks / stunts > Skateboarding > Automobile > Flight / aviation > Helicopter > Licensed","desc":"<p><em>Lego Island 2: Brickster's Revenge</em> is the sequel of Lego Island.</p><p>The game begins with the player traveling around Lego Island, delivering pizza and talking to fellow citizens until the event where Brickster escape from prison, and attempts to deconstruct all the buildings on Lego Island.</p><p>Varied gameplay, as the game is part flying game, part racing game, part sky-diving drill, and part astronaut training mission. The player will interact with around 50 or more different characters from Lego Island. Along the way, the player will have to fly bi-planes, race LEGO cars, command space shuttles, and skateboard through a plethora of areas based on LEGO' series of play themes, like LEGO Knight's Kingdom, and the LEGO Adventurers.</p><p>Also featured are 18 sub-games, as well as a LEGO-themed skate park where the player and Pepper can try a ton of skateboard tricks anytime.</p>"},{"name":"LEGO Racers","year":1999,"developer":"High Voltage Software, Inc.","url":"psx-chd-roms-l/LEGO%20Racers%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%2CFi%29.chd","filesize":208203151,"score":6.9,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>For the first time, build your favourite Lego carts on your PC using all of the blocks that are available in real life, thanks to the detailed Creation modes. You can then race your beast against other lego built characters in 12 special themed tracks, based on the Themed Lego kits (including Pirates &amp; Egypt and much more). Race your friend in split screen mode, or go straight on for the ultimate Lego racing trophy.</p>"},{"name":"LEGO Rock Raiders","year":1999,"developer":"Data Design Interactive Ltd","url":"psx-chd-roms-l/LEGO%20Rock%20Raiders%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%2CFi%29.chd","filesize":413320557,"score":"","genres":"Action > Diagonal-down > Direct control > Licensed","desc":"<p>Stranded in orbit around an uncharted planet, the crew of the LMS Explorer is faced with the challenge of establishing a base camp beneath the planet's surface.<br>Your mission is to rescue your fellow Rock Raiders by taking direct control of the team. You'll have to build 9 vehicles and then learn to fly, drive and sail them through Rock, Lava and Ice. Then there's a total of 21 one-player missions and 9 two-player missions to complete. But beware, in your quest to mine enough Energy Crystals to re-power the engines of the LMS Explorer, you'll have to defend yourselves against the alien slugs, scorpions, and the dreaded Rock Monsters.<br>Good luck!</p>"},{"name":"Leiji Matsumoto 999 ~ Story of Galaxy Express 999 ~","year":2001,"developer":"Polygon Magic, Inc."},{"name":"Lemmings & Oh No! More Lemmings","year":1998,"developer":"DMA Design Limited","url":"psx-chd-roms-l/Lemmings%20%26%20Oh%20No%21%20More%20Lemmings%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":244285594,"score":7.4,"genres":"Compilation > Puzzle > Side view > 2D scrolling > Real-time","desc":"<p>This port contains two complete games from the classic puzzle series.  There are 209 levels to work through, all featuring the classic Lemmings formula: the player must assign roles (digger, climber, etc.) to marching Lemmings in order to prevent them from meeting terrible fates.</p>"},{"name":"Lemmings 3D","year":1995,"developer":"Clockwork Games Limited","url":"psxchd1/3D%20Lemmings%20%28Europe%29.chd","filesize":355822495,"score":7.3,"genres":"Puzzle > Free-roaming camera > Real-time > Point and select","desc":"<p>You, as in all other Lemmings games, are responsible for leading hordes of lemmings to safety through hazardous environments. However, this installment goes just that little bit further by introducing the lemmings to 80 new 3-dimensional levels!</p>"},{"name":"Les Visiteurs: La relique de Sainte Rolande","year":2001,"developer":"Silmarils"},{"name":"Lethal Enforcers I & II","year":1997,"developer":"Konami Computer Entertainment Chicago, Inc.","url":"psx-chd-roms-l/Lethal%20Enforcers%20I%20%26%20II%20%28USA%29.chd","filesize":269628782,"score":6.2,"genres":"Action > Compilation > 1st-person > Arcade > Shooter > Point and select","desc":"<p>Lethal Enforcers I &amp; II contains the Konami coin-op shooters Lethal Enforcers &amp; Lethal Enforcers II: Gunfighters both on one disc.The games both share a similar gameplay structure with digitized enemy targets \"popping up\" on screen and simply needing to be shot down before they take a shot at you.The original game places you as a 1990s police officer fighting bank robbers, Chinese Mafia and drug dealers while in the sequel you are now a Sheriff up against more bank robbers and wrong doing but now set in the Old West. Lethal Enforcers can be played with either a standard game pad or for more of an authentic arcade experience, the Konami Hyperblaster light gun.</p>"},{"name":"LiberoGrande","year":1998,"developer":"Namco Limited","url":"psx-chd-roms-l/LiberoGrande%20%28Europe%29.chd","filesize":234470977,"score":6.6,"genres":"Sports > 1st-person > 3rd-person (Other) > Football (European) / Soccer","desc":"<p><em>LiberoGrande</em> is a football (soccer) game. The user designs his/her own character and can alter his attributes and skills, and control this one player during the match. The user can adjust strategies for the team, but plays each game as their own character.</p><p>The game features details stadia, with interactive crowd, and a selection of 32 national teams. It also supports two-player mode, via a unique split-screen mode not often seen in soccer games.</p>"},{"name":"Liberogrande International","year":2000,"developer":"Namco Limited","url":"psx-chd-roms-l/Liberogrande%20International%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":57371297,"score":"","genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p><em>Liberogrande International</em> (or <em>Liberogrande 2</em> in Japan) is the sequel to Libero Grande. Like its predecessor, it is an unconventional soccer game where instead of a complete team, only a single player is directly controlled, with the other 10 players being controlled by the AI, although with the option to influence their choice in plays. However, unlike the original title, <em>Liberogrande International</em> is a home console title, and along featuring a more realistic visual presentation, it's now possible to choose formation and pick any player (including goalkeeper and the title-mentioned <em>libero</em>) to control, instead of being limited to play as either right-wing or playmaker, depending on the predefined team formation.</p><p>Gameplay remains mostly unchanged; the camera follows the ball, circling around the controlled player. When the player is carrying the ball, he can do the usual actions (pass, shoot, cross, throw a long pass), while keeping an eye on other players asking the ball and running into space. With possession but without the ball the player can ask for either a low or an high pass. Without the ball, the player can either tackle or instruct other players when to attack the ball, if this option is enabled. At the end of the match, the player can see how well he performed, along a \"heat map\" on his positioning.</p><p>Since all players are now given equal billing, the player can now edit all 32 national team players' names, as well as creating his own superstar (which can be used on any national team). Game modes include exhibition (where you can play with or against a friend in split-screen mode), LiberoGrande Cup (straight elimination cup), International Cup (World Cup style tournament) and World League.</p><p>Unlike the Japanese version, the European one doesn't feature commentary.</p>"},{"name":"Lightning Legend - Daigo no Daibouken","year":1996,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"psx-chd-roms-l/Lightning%20Legend%20-%20Daigo%20no%20Daibouken%20%28Japan%29.chd","filesize":342460738,"score":"","genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Arcade > Fighting > Fantasy > Martial arts","desc":"<p>The ancient country of Japon has existed for millennia, through times of peace and war. However, long ago, an evil creature called Dragules was sealed away in what is now the capital city, Azumakyo. Even today, the descendants of the heroes who sealed that monster away still live in Japon. One such person is a young boy named Daigo Raioh, who was rescued by a mysterious stranger when he was only eight years old. Now 14, Daigo has set out to find the one who inspired him to become a hero. At the same time, an ancient evil has begun to stir once again...</p><p><em>Lightning Legend</em> is a 3D 1-on-1 fighting game with a strong focus on story elements. The single-player story mode allows the player to choose from one of eight characters who are each traveling around Japon for their own personal reasons. Extended dialogue sequences before and after each battle drive the story. There is also a two-player versus mode.</p><p>The fighting system is comparable to other contemporary fighting games, such as Super Street Fighter II and Dead or Alive. Each character has their own set of standard and special moves, executed by various button commands. Each character also has unique special moves that can be used when their power meter is filled. It is also of course possible to jump, dash, block, and throw opponents.</p>"},{"name":"Linda 3 Again","year":1997,"developer":"MARS Corporation","url":"psx-chd-roms-l/Linda%5E3%20Again%20%28Japan%29%20%28Rev%201%29.chd","filesize":494551576,"score":"","genres":"Role-playing (RPG) > 1st-person > Top-down > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p><em>Linda³ Again</em> is an enhanced remake of the PC Engine (TurboGrafx) CD game  Linda³.</p><p>The main story line in this version remains unchanged for the most part; however, many of the dialogues have been altered, and several characters modified and/or presented in a different way - which, naturally, also has an impact on the story. For example, a cut scene early in the game showed Linda and Ken kissing in the original version; in the remake, Linda punches him instead.</p><p>All the cut scenes have been re-done from scratch. Instead of the simple animated scenes of the original the remake features full-motion anime-style movies. The change is more than just technical, as illustrated by the example above.</p><p>In-game graphics have received a significant overhaul and are more detailed. Battle graphics in particular have been enhanced; in the original version, there were no backgrounds behind the enemy pictures; in this release, battle screens are accompanied by backgrounds reflecting the scenery the battle takes place in.</p><p>Gameplay changes were also made. In addition to mission objectives (which represented difficulty levels in the earlier version), <em>Linda³ Again</em> features four parallel levels of difficulty, involving battles against animals and their collection. Difficulty of the battles themselves was also re-done in many areas; different and/or additional enemies are seen wandering in places populated by other creatures in the original release.</p>"},{"name":"Lion and the King","year":2000,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-l/Lion%20and%20the%20King%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":308142548,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select > Africa > Fantasy","desc":"<p><em>Lion and the King</em> features a Dingo Pictures animated film titled <em>Der König der Tiere: das grosse Abenteuer</em>. The game also features six different sliding picture puzzles with 4 difficulty options (9, 12, 25, or 36 squares). There is also a coloring book mode where players can color in six different pictures.</p><p>The game is pretty much the same thing as Lion and the King 2 except the pictures in the puzzles and coloring book are different.</p>"},{"name":"Lion and the King 2","year":2003,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-l/Lion%20and%20the%20King%202%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":287984637,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select > Africa > Fantasy","desc":"<p><em>Lion and the King 2</em> features a Dingo Pictures animated film titled <em>Der König der Tiere: Das grosse Abenteuer</em>. The game also features six different sliding picture puzzles with 4 difficulty options (9,12,25, or 36 squares). There is also a coloring book mode where players can color in six different pictures.</p><p>The game was later released on the PlayStation 2 as <em>Son of the Lion King</em>. It's the same game as the PlayStation version but adds a jigsaw puzzle mode and a pair matching mini game.</p>"},{"name":"Little Princess - Marl Oukoku no Ningyouhime 2","year":1999,"developer":"Nippon Ichi Software, Inc.","url":"psx-chd-roms-l/Little%20Princess%20-%20Marl%20Oukoku%20no%20Ningyouhime%202%20%28Japan%29.chd","filesize":263735259,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy","desc":"<p><em>Little Princess: Marl Ōkoku no Ningyō Hime 2</em>, also known as <em>Little Princess: The Puppet Princess of Marl Kingdom 2</em>, is a sequel to Rhapsody: A Musical Adventure. Unlike its predecessor, Little Princess uses a more traditional RPG battle system, but it still contains many of the same themes of love and music.</p><p><em>Little Princess</em> takes place years after the events of <em>Rhapsody</em>, where the protagonists of the previous game have settled down as the rulers of Marl Kingdom and now have a daughter, Kururu. Kururu gets entangled in a dispute between two families of witches, and must track down the pieces of a shattered gem.</p><p>The battles follow a standard RPG battle system of enemies on the opposite side of the screen from the players and commands selected from a text menu. However, two of the characters have companion \"puppets\" that cast magic for them. The puppets level up along with the characters, and when a spell is cast, money is taken instead of magic points.</p><p>The game was released twice; the first included a bonus disc of illustrations and a sound test, the second was a budget release.</p>"},{"name":"Live Wire!","year":1999,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-l/Live%20Wire%21%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":366184738,"score":6.4,"genres":"Action > Strategy > Behind view > Arcade > Direct control","desc":"<p>A 3D puzzle game where you across a gridded landscape (Tron-cycle like) leaving a coloured trail behind you. Any square on the landcsape that you managed to colour on all sides gets claimed by you and earns you points. You're up against a varied number of opponents and the game covers about 50 levels, with the landscapes having different properties and shapes (e.g spherical world landscape). Add to this a bunch of pickups and bonus abilities, and you've got a retro- puzzle game that's a bit fun.</p>"},{"name":"LMA Manager","year":1999,"developer":"Codemasters","url":"psx-chd-roms-l/LMA%20Manager%20%28Europe%29.chd","filesize":310698010,"score":"","genres":"Sports > 3rd-person (Other) > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>Unlike other console football management games at the time which were ports of existing PC titles, <em>LMA Manager</em> was designed exclusively for the PlayStation. The game is notable for its intuitive control system, where the L1 and R1 shoulder buttons of the controller switch between different sections of the game (e.g. from the Transfers section to the Squad section), and L2 and R2 switch between sub-screens within a section (e.g. from the Select Team screen to Editing Tactics). As a full management sim, players can start an open-ended game, or face one of the ten challenges.</p><p>The data is based on the 1999/2000 season player and team statistics. The kits and teams are authentic, with 8,000 players and 294 clubs in 32 countries. As a manager, you control the club finances, take care of coaching, stadium development and player management. During the matches, shown in 3D, managers can make tactical changes and substitutions at any time. There is also an after-match TV show with results, highlights and commentary.</p>"},{"name":"LMA Manager 2001","year":2001,"developer":"Codemasters","url":"psx-chd-roms-l/LMA%20Manager%202001%20%28Europe%29.chd","filesize":228555670,"score":7,"genres":"Simulation > Sports > 3rd-person (Other) > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p><em>LMA Manager 2001</em> is the second game in the LMA Manager series of football management games. The main game involves a 15 year career managing an English Football team (Premier, 1st, 2nd or 3rd division). There are also 14 shorter challenges ranging from winning the treble with 3 games left to winning 3 successive promotions from division 3 to the Premier in 3 seasons. The player is responsible for selecting the team line-up and tactics, buying and selling players on the European transfer market, selecting training schedules and managing the club's finances.</p><p>Unlike other console football management games of the time which were ports of existing PC titles, the LMA Manager titles were designed exclusively for the PlayStation. The game is notable for its intuitive control system, where the L1 and R1 shoulder buttons of the controller switch between different sections of the game (e.g. from the Transfers section to the Squad section), and L2 and R2 switch between sub-screens within a section (e.g. from the Select Team screen to Editing Tactics). </p><p>The graphics of the first game, which had a rather retro look, have been improved to a more modern clean-looking design. The game provides a mini 3D match where the manager can make tactical changes during gameplay and 3D highlights afterwards commented by Alan Hansen (former Liverpool player turned BBC commenter).</p><p>International versions were sold under different localized titles: BDFL Manager in Germany (Bund Deutscher Fußball-Lehrer, basically the German equivalent of the LMA), Manager de Liga in Spain, Football Manager Campionato in Italy, and Roger Lemerre - La Sélection des Champions in France.</p><p>Only teams from the home country could be managed although all 294 teams were included in each game for use in the transfer market and European cup competitions.</p>"},{"name":"LMA Manager 2002","year":2001,"developer":"Hoodoo Studios","url":"psx-chd-roms-l/LMA%20Manager%202002%20%28Europe%29.chd","filesize":228697913,"score":7.4,"genres":"Simulation > Sports > Diagonal-down > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>LMA 2002 is the third in the Playstation football management series, and also the first to be released for Playstation 2. The PS1 version features 8,000 players in 302 clubs, whilst PS2 expands this to 17,000 players in 722 clubs across the European leagues. Both platforms offer the choice of playing a full career or taking on one of 10 challenges, such as taking over the bottom-placed team mid-season and attempting to avoid relegation. Regardless of game mode, managers have access to detailed tactics and training settings, allowing you to work on players' weaknesses and build on their strengths.</p><p>The PS2 version lets you watch the full match in 3D, and both versions have a comprehensive highlights section, voiced on PS2 by real-life BBC analysts Gary Lineker and Alan Hansen.</p>"},{"name":"Loaded","year":1995,"developer":"Gremlin Interactive Limited","url":"psx-chd-roms-l/Loaded%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":364572827,"score":7.8,"genres":"Action > Top-down > Shooter","desc":"<p>Loaded is a violent, bloody top-down shooter which places you in the boots of one of six characters, who are all strange and deformed, from a psychotic clown to a huge baby.</p><p>Loaded is a mission based game, where you have to complete various objectives, such as \"escape the prison.\" Throughout each mission, there are tons of enemies to kill.</p><p>You can choose to play through the single player campaign, or you can go head to head in two player.</p>"},{"name":"Lode Runner","year":1998,"developer":"Presage Software, Inc.","url":"psx-chd-roms-l/Lode%20Runner%20%28USA%29.chd","filesize":254953011,"score":"","genres":"Compilation","desc":"<p><em>Lode Runner</em> is the U.S. only compilation on one disc of the following games that were originally released separately for the Playstation only in Japan:</p><ul><li>Lode Runner: The Legend Returns* Lode Runner Extra</li></ul>"},{"name":"Lode Runner Extra","year":1997,"developer":"Presage Software, Inc.","url":"psx-chd-roms-l/Lode%20Runner%20Extra%20%28Japan%29.chd","filesize":285050249,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Platform > Direct control","desc":"<p><em>Lode Runner Extra</em> is a stand-alone expansion for Lode Runner: The Legend Returns, featuring 110 new levels for advanced players and an integrated level editor. The gameplay remains the same in this action-platformer, where the objective is to collect all the gold nuggets and bars scattered around each stage to activate a portal to the next level. Red monks chase the main character around the many platforms and ledges, killing the adventurer when finally reaching him. New tools and other helpful pieces of equipment are slowly introduced with cutscenes showing their usage.</p>"},{"name":"Lode Runner: The Legend Returns","year":1996,"developer":"Presage Software, Inc.","url":"psx-chd-roms-l/Lode%20Runner%20-%20The%20Legend%20Returns%20%28Japan%29.chd","filesize":284272516,"score":7.5,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Platform > Direct control","desc":"<p>A resurrection of the original classic platform game with a number of updates such as one and two player options, detailed graphics, character moves, a level editor, and music with sound effects. Besides running from some red-toga wearing \"Mad Monks\" that eat you (like in the \"Beast Master\" movie) if they catch you, you have a few things on hand to use: small bombs, big bombs (nothing will reappear when they destroy something), a drill (for stone floors), booby-traps, and a few other things up your sleeve.</p>"},{"name":"Logic Mahjong Soryu","year":2000,"developer":"Nippon Ichi Software, Inc.","url":"psx-chd-roms-l/Logic%20Mahjong%20Souryuu%20%28Japan%29.chd","filesize":64689400,"score":"","genres":"Puzzle > 1st-person > Fixed / flip-screen > Cards / tiles > Tile matching puzzle > Point and select","desc":"<p>Here's a traditional mahjong game with no cheaters. In addition to the typical four-person rules, you can play a speedier game of three-player mahjong, with bigger chances of bigger hands. You can change various rules, and even experience an adventure-game-like story mode. There's even a hidden mode where you can play a match against characters from the \"Marl Kingdom\" series of games. Casual controls and traditional gameplay--this game is enjoyable for all ages.</p>"},{"name":"Logic Pro Adventure","year":2001,"developer":"Deniam Corp.","url":"psx-chd-roms-l/Logic%20Pro%20Adventure%20%28Japan%29.chd","filesize":64962296,"score":"","genres":"Puzzle > Top-down > Anime / Manga > Point and select","desc":"<p><em>Logic Pro Adventure</em> is a nonogram puzzle game with a bright cartoony style, and the third title in Deniam's Logic Pro series. The player can move around a world map selecting different locations to play puzzles, each with a different background. Each space in the map is marked by a colored gem, which indicates the size and difficulty of the puzzle within. The ultimate goal is to collect 50 of each type of gem from the puzzles, then complete a 'boss' puzzle to bring peace back to the kingdom. The game features a total of 1000 puzzles in various sizes.</p><p>The PlayStation version adds a free puzzle mode and a save function.</p>"},{"name":"London Racer","year":2000,"developer":"Davilex Games B.V.","url":"psx-chd-roms-l/London%20Racer%20%28Europe%29.chd","filesize":60339093,"score":6.1,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing > Europe","desc":"<p>Arcade racing in and around London in a variety of cars. Compete in three leagues - small cars, luxury sports cars and GT racers on your way to winning the title and the ultimate car.</p><p>In this UK-customised racing game you drive on the left, knock down Gatsos (speed cameras), and get chased by police in Vauxhall Astras and much more.</p>"},{"name":"London Racer II","year":2002,"developer":"Davilex Games B.V.","url":"psx-chd-roms-l/London%20Racer%20II%20%28Europe%29.chd","filesize":93073867,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p><em>London Racer II</em> is another iteration in the prolific Racer series by Davilex. The races take place primarily in the streets of London and Edinburgh, with additional tracks in Las Vegas, New York and Chicago.</p><p>There are three single player modes available: Single Race, Tournament and Time Trial. In Single Race, the player is free to choose any of the 6 characters available, any of the tracks and any of the unlocked cars. In Tournament mode, the player races in a series of tracks while collecting money prizes and unlocking new cars. In both modes, players race against other racers while avoiding being caught by the police. In the Time Trial mode, players race against the clock trying to beat the best time for each track.</p><p>Each car (driven by a different character) has different stats in acceleration, top speed, handling, breaking and strength. The cars can also be upgraded using money collected from winning races and collecting money tokens during races. The cars also take damage when hit and can break into total loss if the damage bar is full. Repair tokens can be collected during races and if a car finishes a race damaged, it can be repaired before the next one using money. Nitro tokens can also be collected and bought, and the cars' colors can be changed.</p><p>There are also two split-screen two player modes: Duel and Cop vs. Driver. In the Duel mode, players race against each other in any given track. In Cop vs. Driver, one player is the cop and the other a regular racer, and the cop player must try to crash the driver within the time limit.</p><p>The game can be played from either first (hood camera) or third person (behind the car) perspective.</p>"},{"name":"Lone Soldier","year":1996,"developer":"Tempest Software Ltd","url":"psx-chd-roms-l/Lone%20Soldier%20%28Europe%29.chd","filesize":246476118,"score":"","genres":"Action > Behind view > Shooter > Direct control > Sci-fi / futuristic > War > Regional differences","desc":"<p>An alien force known as the Varinians have invaded Earth, and stolen an experimental \"super-missile\" in order to blackmail the world's governments into delivering further payloads of radioactive materials to them. Having further bolstered the defenses of their mothership by hiring on human mercenary forces and other ne'er-do-wells, there's only one man capable of wading through the enemy forces and defeating the alien menace: An ex-special ops unit by the name of Hank, who claims to \"pick his nose with a bayonet and wipes his arse with sandpaper.\"</p><p>Gameplay sees players taking direct control of Hank from a behind-the-back perspective, as you shoot your way through linear stages. Levels require you to kill a minimum percentage of enemies before proceeding to the next, lest you are made to repeat the same level again. Weapons include an Uzi submachine gun, bazookas, flamethrowers, and hand grenades.</p>"},{"name":"Looney Tunes Racing","year":2000,"developer":"Circus Freak Studios","url":"psx-chd-roms-l/Looney%20Tunes%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":450309612,"score":6.6,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Looney Tunes Racing</em> is a kart-racing game for the PlayStation. There are some definite similarities between this title and Crash Team Racing, both in game play mechanics and depth. Completely immersed in the humor and soul of the Looney Tunes license, the player starts the game with only a handful of characters and levels available, but as the game proceeds features become unlocked including new characters, levels, and challenges.</p><p>Each character has an unique vehicle themed just for them, and is accompanied by voice taunts, provided by Warner Bros. licensed voice actors, and character-specific animations that help bring these characters to life.</p><p>The weapons the player can unleash onto the opponents include cherry bombs, homing cream pies, thunder clouds with devastating lightning bolts, and giant anvils that drop out of the sky. In addition, each uniquely themed level has a series of amusing booby traps and obstacles that the player can unleash to slow down your foes. The player can make boulders fall, launch giant boxing gloves on springs, and trample the opponents with sheep in the red-rock canyons, get spacecraft to fire lasers in the Martian level, and activate a huge, fat, white horse in the Opera stage to come in and trounce on the enemies. Even Gossamer, the large monster make entirely of red hair (except for those big white eyes and white tennis shoes), makes a cameo in the Gossamer’s castle level, as he comes right out onto the track to take out any oncoming traffic.</p><p>Beyond the races, other noteworthy game modes include the Multi-player Battle Mode, where the players basically pummel each other with wacky weaponry, and the ACME Challenges, which include challenges such as Boss Races (against Porky Pig, for example), picking up key items in a certain order, and others.</p>"},{"name":"Looney Tunes: Sheep Raider","year":2001,"developer":"Infogrames Europe SA","url":"psx-chd-roms-l/Looney%20Tunes%20-%20Sheep%20Raider%20%28USA%29%20%28En%2CFr%2CEs%2CPt%29.chd","filesize":323646243,"score":7.3,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Stealth > Licensed","desc":"<p><em>Sheep Raider</em> is a 3D puzzle game, with gameplay mimicking the wacky contraptions and situations from the original cartoons. Players need to catapult themselves across a canyon, camouflage themselves as a bush to sneak past Ralph, lure sheep with sheep perfume etc.</p><p>The player takes on the role as starving Ralph Wolf and must help him steal one sheep from Sam Sheep Dog and get it to a certain goal location. With a wide arsenal of Acme gadgets at his disposal, Ralph is sure to concoct the perfect plan for keeping his stomach filled, or not! The game takes place across 15 various stages as well as 2 hidden stages, each with their own requirements and challenges, so the longevity of the game is notable.</p><p>The puzzles consist of finding items and using them at certain location or on certain characters. Items include lettuce to lure sheep and mines which can be defused. There also are mailboxes with which the player can order a wide arsenal of helpful Acme gadgets. Directly after ordering the product is air shipped instantaneously, with a crate falling from the sky. Gadgets include a rocket, dynamite, elastic band, a fan, a metal detector and many more. Some gadgets are level specific, like for example a time travel gadget with which Ralph can traveling back and forth in time to manipulate placement of rocks and trees.</p><p>There are checkpoints throughout each of the levels, although there are no visual clues as to where they are. For example, if the player reaches a certain area carrying the sheep and then falls off a cliff, the player plus sheep will be respawned near that area. Each level also has a punch clocks, usually in a hidden area, they acts just as an extra collectible.</p>"},{"name":"Lord Monarch: Shin Gaia Oukokuki","year":1998,"developer":"Nihon Falcom Corp.","url":"psx-chd-roms-l/Lord%20Monarch%20-%20Shin%20Gaia%20Oukokuki%20%28Japan%29.chd","filesize":171415199,"score":"","genres":"Strategy > Top-down > Anime / Manga > Real-time > Fantasy","desc":"<p>Lord Monarch was first released as a PC game in 1991 and became a hit not only in Japan but all over the world with its real-time simulation gameplay, an innovative game system ahead of its time. While the goal of this game is simply leading your nation and expand your territory as far as possible, players can at the same time enjoy the intricate tactic gameplay and an immersive story that unfolds along with the introduction of different characters. There are 100 stages in total and together with different game modes and systems, it is hard to get tired of the endless fun offered by this title!</p>"},{"name":"Lord of the Jungle","year":2000,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-l/Lord%20of%20the%20Jungle%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.chd","filesize":479534984,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select > Africa","desc":"<p>Lord was a tiny baby when he was taken into the the care of the apes.<br>Now, after 18 years in the jungle, Lord finally comes face-to-face with other people...<br>As well as a great half-hour cartoon video, Lord of the Jungle features an easy-to-use virtual colouring book and a challenging puzzle game, letting you join Lord in his adventures.</p>"},{"name":"Lost World, The: Jurassic Park","year":1997,"developer":"DreamWorks Interactive L.L.C.","url":"psx-chd-roms-l/Lost%20World%2C%20The%20-%20Jurassic%20Park%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.chd","filesize":398595132,"score":6.4,"genres":"Action > 1st-person > Side view > Sci-fi / futuristic > Licensed","desc":"<p>The dinosaurs are back in this monstrous sequel. Take a dinosaur-stomping adventure through 'Site B' as you try to reach a radiophone to call a helicopter to get you out of there. But your journey won't be easy, because along the way you'll run into fierce, menacing dinosaurs that'll try to catch and eat you.</p><p>Play as characters from the movie and use weapons such as the tranquilizer, rocket launcher, and the shotgun. Featuring music straight out of the movie, many levels and fast gameplay, JURASSIC PARK is back... with bite!</p><p>5 different playable characters, over 30 levels, 20 different dinosaurs, variety of secret paths and hidden areas, 3D rendered graphics.</p>"},{"name":"Love Game's WaiWai Tennis","year":1997,"developer":"Tears Ichikawa Software Co., Ltd.","url":"psx-chd-roms-l/Love%20Game%27s%20-%20Wai%20Wai%20Tennis%20%28Japan%29%20%28Major%20Wave%29.chd","filesize":329959968,"score":"","genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p><em>WaiWai Tennis</em> is a tennis game using behind-the-player angled camera view. The game is authorized by JPTA (Japanese Tennis Association) and tried to be realistic even though characters may look less so. You can play as one of pre-selected male or female tennis players, or you can create your own character. Each character has his own ups and down, the game features dozens of moves and character skills which can become better through practice and playing matches and tournaments. Characters also have their preferred hand which will decide whether they'll hit a ball using a backend or forehand. The ball will not be automatically hit if you're in its vicinity, instead, you'll have to be well positioned to hit the ball and time your swing as well as the direction in which you wish to hit the tennis ball. Whether you catch and hit or miss the ball may also be affected by your skill level to perform a certain type of moves.</p>"},{"name":"Love Game's WaiWai Tennis Plus","year":2002,"developer":"Tears Ichikawa Software Co., Ltd.","url":"psx-chd-roms-l/Love%20Game%27s%20-%20Wai%20Wai%20Tennis%202%20%28Japan%29.chd","filesize":169955468,"score":"","genres":"Sports > 3rd-person (Other) > Isometric > Tennis","desc":"<p>This <em>Plus</em> release of Love Game's Waiwai Tennis is a slightly different, yet updated version of the original game. It contains around 150 different character moves and around 70 different striking variations. The game also features improved graphics and additional gameplay modes (Tournament now supports both 4 and 8 players, and Quick Play mode has been added which lets you play 1-on-1 or 2-on-2 matches).</p>"},{"name":"Love Hina 2: Kotoba wa Konayuki no You ni","year":2000,"developer":"Konami Computer Entertainment Japan Co., Ltd.","url":"psx-chd-roms-l/Love%20Hina%202%20-%20Kotoba%20wa%20Konayuki%20no%20You%20ni%20%28Japan%29.chd","filesize":250966538,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Licensed","desc":"<p>Released only two months after the first game, Love Hina: Ai wa Kotoba no Naka ni, this game mimics everything from the first one, from gameplay to design. As in the prequel, the game's main focus is on collecting words for one of the five heroines from the series. You are Keitarou Urashima, the protagonist from the series, living together in a huge mansion with Naru Narusegawa, Shinobu Maehara, Kaolla Su, Motoko Aoyama, and Mitsune Konno. You can go to any one of their rooms and check the words you have unlocked for each of the characters, and by combining them start the event scenes which are similar to a visual novel in style with full voice-acting, for player character included. This game also requires PocketStation without which you cannot gather words necessary to play the game.</p>"},{"name":"Love Hina: Ai wa Kotoba no Naka ni","year":2000,"developer":"Konami Computer Entertainment Japan Co., Ltd.","url":"psx-chd-roms-l/Love%20Hina%20-%20Ai%20wa%20Kotoba%20no%20Naka%20ni%20%28Japan%29.chd","filesize":258419839,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Licensed","desc":"<p><em>Love Hina: Ai wa Kotoba no Naka ni</em> (Eng. \"Love Hina: Love Is in the Words\") is the first game based on a popular \"Love Hina\" manga and anime for PlayStation console. This adventure game's main focus is on collecting words for one of the five heroines from the series. You are Keitarou Urashima, the protagonist from the series, living together in a huge mansion with Naru Narusegawa, Shinobu Maehara, Kaolla Su, Motoko Aoyama, and Mitsune Konno. You can go to any one of their rooms and check the words you have unlocked for each of the characters, and by combining them start the event scenes which are similar to a visual novel in style with full voice-acting, for player character included. This game also requires PocketStation without which you cannot gather words necessary to play the game.</p>"},{"name":"LSD: Dream Emulator","year":1998,"developer":"OutSide Directors Company Co., Ltd.","url":"psx-chd-roms-l/LSD%20-%20Dream%20Emulator%20%28Japan%29.chd","filesize":414825719,"score":7.6,"genres":"Simulation > 1st-person > Meditative / Zen > Horror","desc":"<p>Inspired by a \"dream journal\" written by Hiroko Nishikawa, <em>LSD</em> is basically a simulation-based game themed around dreams and nightmares. The gameplay is simple, walking around various dreamscapes and occasionally discovering surreal visuals. Coming into contact with any object or wall in the dream can result in warping to another part of a dream, which can go on for very long (up to 10 minutes), or can be cut short by falling off cliffs or through floors. After the dream ends, it is displayed on a graph showing whether it is considered Upper, Downer, Static or Dynamic.</p><p>Gameplay takes place over various days, and after a long time passes, the counter resets, though the game can still be played. Textures can be completely randomized, and upon starting a new dream, you can not have the same one twice in a row, though dreams can be replayed using Flashback mode (unlocked after 20 days have passed), which is an option to revisit the same areas and allow you to choose different paths, though only for 3 to 5 minutes.</p><p>There is no goal in the game, except to emulate dreams, ranging from colorful and happy, to dark and unsettling. Occasionally, dreams may be invaded by an apparition called the Grey Man, who can appear out of nowhere and remove your ability to remember a dream in Flashback mode.</p>"},{"name":"Lucifer Ring","year":1998,"developer":"Soft Machine","url":"psx-chd-roms-l/Lucifer%20Ring%20%28Japan%29.chd","filesize":59126715,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Arcade > Beat 'em up / brawler > Fighting > Fantasy","desc":"<p>In true fairy tale style, evil is about to lay its dark shadow over the world. The only way to stop this from happening is to collect 4 magic rings. Cue Nash, generic hero. Equipped with a sword and a limited amount of magic he sets out to slash, hack and slice his way to the 4 rings and in the end, a much nicer world to live in.</p><p>The game plays much like Golden Axe but in full 3D, where Nash walks along a linear path and is constantly confronted by monsters who want nothing more than to end his life. Every now and then the player is given an opportunity to choose paths to get from point A to point B in several ways. At the end of every stage there is a boss waiting for Nash to make his day just a little less sunny and cheerful. In other words, they are usually evil and need plenty of killing.</p><p>Nash has two standard attacks, one harder (but slower) and one weaker (but faster). Nash also has the ability to jump to cross broken bridges, cliffs and other natural hazards. A meter at the top of the screen fills up as Nash kills enemies and when it is full the player will be able to unleash a very powerful attack, which usually kills all the enemies on the screen.</p>"},{"name":"Lucky Luke","year":1998,"developer":"Infogrames Europe SA","url":"psx-chd-roms-l/Lucky%20Luke%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":294400152,"score":6.4,"genres":"Action > 3rd-person (Other) > Side view > Arcade > Puzzle elements > Shooter > Western > Licensed","desc":"<p>This game is based on the well known comics series about the good cowboy named Lucky Luke. </p><p>Lucky Luke has to stop the Dalton gang from committing another crime. Walking around town, Luke will have to solve puzzles, shoot criminals and collect money. After finishing a level, an extra life can be bought with the money collected. Shooting often involves ricochetting shots to hit a target, and gameplay will sometimes shift from 2D sidescrolling to an over-the-shoulder camera. Levels offer a wide variety of challenges, including town exploring, bottle-shooting in a bar, freeing hostages on the roof of a train, and sneaking in Indian territory.</p>"},{"name":"Lucky Luke: Western Fever","year":2001,"developer":"Kalisto Entertainment SA","url":"psx-chd-roms-l/Lucky%20Luke%20-%20Western%20Fever%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":243143394,"score":5.7,"genres":"Action > Behind view > Puzzle elements > Shooter > Western > Licensed","desc":"<p>The game is based on the famous comics series about good cowboy Lucky Luke.</p><p>You as Lucky Luke have to walk around the fixed tracks on Mexican territory and sometimes shoot the bandits, moving the aim of your gun from one fixed position to another. Also you have to avoid their shooting and reload bullets in your gun.</p>"},{"name":"Lunar 2: Eternal Blue - Complete (Disk 1)","year":1999,"developer":"Game Arts Co., Ltd.","url":"psx-chd-roms-l/Lunar%202%20-%20Eternal%20Blue%20Complete%20%28USA%29%20%28Disc%201%29.chd","filesize":441707944,"score":7.9,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG)","desc":"<p><em>Lunar: Eternal Blue Complete</em> is a remake of the SEGA CD game Lunar: Eternal Blue. </p><p>Similarly to the remake of the first game in the series, this version features reworked, 32-bit graphics. The anime-style cutscenes of the original have turned into similarly styled movies. Some cutscenes have been removed from the remade version; however, many of the remaining scenes have been expanded.</p><p>A few dungeons are absent in the remake, while a few others were added. Dungeon design have been somewhat simplified compared to the original version. Some monsters (in particular a number of bosses) have a different visual design. </p><p>The most notable gameplay-related change in the remake is the absence of random battles. Enemies are now visibly walking on the screen and can be avoided. Enemy encounters on the world map have been eliminated completely.</p>"},{"name":"Lunar 2: Eternal Blue - Complete (Disk 2)","year":1999,"developer":"Game Arts Co., Ltd.","url":"psx-chd-roms-l/Lunar%202%20-%20Eternal%20Blue%20Complete%20%28USA%29%20%28Disc%202%29.chd","filesize":405632956,"score":7.9,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG)","desc":"<p><em>Lunar: Eternal Blue Complete</em> is a remake of the SEGA CD game Lunar: Eternal Blue. </p><p>Similarly to the remake of the first game in the series, this version features reworked, 32-bit graphics. The anime-style cutscenes of the original have turned into similarly styled movies. Some cutscenes have been removed from the remade version; however, many of the remaining scenes have been expanded.</p><p>A few dungeons are absent in the remake, while a few others were added. Dungeon design have been somewhat simplified compared to the original version. Some monsters (in particular a number of bosses) have a different visual design. </p><p>The most notable gameplay-related change in the remake is the absence of random battles. Enemies are now visibly walking on the screen and can be avoided. Enemy encounters on the world map have been eliminated completely.</p>"},{"name":"Lunar 2: Eternal Blue - Complete (Disk 3)","year":1999,"developer":"Game Arts Co., Ltd.","url":"psx-chd-roms-l/Lunar%202%20-%20Eternal%20Blue%20Complete%20%28USA%29%20%28Disc%203%29.chd","filesize":447515291,"score":7.9,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG)","desc":"<p><em>Lunar: Eternal Blue Complete</em> is a remake of the SEGA CD game Lunar: Eternal Blue. </p><p>Similarly to the remake of the first game in the series, this version features reworked, 32-bit graphics. The anime-style cutscenes of the original have turned into similarly styled movies. Some cutscenes have been removed from the remade version; however, many of the remaining scenes have been expanded.</p><p>A few dungeons are absent in the remake, while a few others were added. Dungeon design have been somewhat simplified compared to the original version. Some monsters (in particular a number of bosses) have a different visual design. </p><p>The most notable gameplay-related change in the remake is the absence of random battles. Enemies are now visibly walking on the screen and can be avoided. Enemy encounters on the world map have been eliminated completely.</p>"},{"name":"Lunar: Silver Star Story - Complete (Disk 1)","year":1998,"developer":"Game Arts Co., Ltd.","url":"psx-chd-roms-l/Lunar%20-%20Silver%20Star%20Story%20Complete%20%28USA%29%20%28Disc%201%29.chd","filesize":395598897,"score":8.4,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG)","desc":"<p><em>Lunar: Silver Star Story Complete</em> is an enhanced remake of Lunar: The Silver Star.</p><p>The remake features 32-bit graphics (as opposed to the 16-bit of the original); many of the locations and characters have been re-designed. The anime-style cutscenes from the original have turned into full-motion animated movies. Some scenes were added and/or prolonged.</p><p>While the main storyline remains the same in the remade version, changes were made to some of the quests, dialogue, and motivations of some of the characters. A few characters that play a role in the plot development were added. Some of these changes affect the gameplay as well: for example, a certain character accompanies the party during a major quest in the remake, while in the original that character remained at home.</p><p>Gameplay system also underwent significant changes. The most notable difference is the elimination of random battles; in the remake, enemies are visibly walking on the screen and can be avoided. Also, enemies no longer appear on the world map. The magic system of the game was altered to resemble the one from the original's  sequel. New items have been introduced, and the properties of some others changed. The protagonist Alex's side-kick Nall has now an active role in the battles: he would revive fallen characters, restoring them to 1 HP.</p>"},{"name":"Lunar: Silver Star Story - Complete (Disk 2)","year":1998,"developer":"Game Arts Co., Ltd.","url":"psx-chd-roms-l/Lunar%20-%20Silver%20Star%20Story%20Complete%20%28USA%29%20%28Disc%202%29.chd","filesize":476065710,"score":8.4,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG)","desc":"<p><em>Lunar: Silver Star Story Complete</em> is an enhanced remake of Lunar: The Silver Star.</p><p>The remake features 32-bit graphics (as opposed to the 16-bit of the original); many of the locations and characters have been re-designed. The anime-style cutscenes from the original have turned into full-motion animated movies. Some scenes were added and/or prolonged.</p><p>While the main storyline remains the same in the remade version, changes were made to some of the quests, dialogue, and motivations of some of the characters. A few characters that play a role in the plot development were added. Some of these changes affect the gameplay as well: for example, a certain character accompanies the party during a major quest in the remake, while in the original that character remained at home.</p><p>Gameplay system also underwent significant changes. The most notable difference is the elimination of random battles; in the remake, enemies are visibly walking on the screen and can be avoided. Also, enemies no longer appear on the world map. The magic system of the game was altered to resemble the one from the original's  sequel. New items have been introduced, and the properties of some others changed. The protagonist Alex's side-kick Nall has now an active role in the battles: he would revive fallen characters, restoring them to 1 HP.</p>"}]