[{"name":"M: Kimi wo Tsutaete","year":1996,"developer":"Nexus Interact, Ltd."},{"name":"M&M's: Shell Shocked","year":2001,"developer":"Boston Animation Ltd.","url":"psx-chd-roms-m/M%26M%27s%20-%20Shell%20Shocked%20%28Europe%29.chd","filesize":244787137,"score":5.8,"genres":"Action > Educational > 3rd-person (Other) > Math / logic > Licensed","desc":"<p>In <em>M&amp;Ms: The Lost Formulas</em>, the 2 lead candies are about to set off on a vacation until the red candy realizes that the yellow candy left the M&amp;Ms Minis in charge of the candy factory. The Minis promptly steal the secret M&amp;Ms formulas and cause havoc at the factory. It is up to the yellow candy to set the situation right.</p><p>The gameplay has been described as being similar to the Crash Bandicoot series. The action in the game takes place over 8 levels. The first 7 levels involve some kind of math skill (configurable at various skill levels to cover addition, subtraction, multiplication, and division). The first level depicts the yellow candy frantically driving back to the candy factory. Along the way are math formulas on the side of the road, followed closely by 3 crates on the road, each with a number. Striking the crate with the correct answer for the previous formula will allow passage, while the 2 wrong answers are steel crates that will end your vehicle. The same action is repeated in a later level involving a forklift.</p><p>Another type of level has the yellow candy jumping from number platform to number platform according to the math formulas that a disembodied female voice calls out. Another type of level is a 3D running/jumping action level in which the yellow candy will run down a hallway while observing clues about math formulas along the way. At the end of the hallway will be 3 doors, each with a possible answer. Choose wisely.</p><p>All along the way are M&amp;Ms candies to be collected in large quantities. Every 100 M&amp;Ms candies earns the player an extra life.</p><p>The PlayStation version is basically the same game but minus the Math mode.</p>"},{"name":"Maboroshi Tsukiyo (Disk 1)","year":2000,"developer":"SIMS Co., Ltd.","url":"psx-chd-roms-m/Maboroshi%20Tsukiyo%20-%20Tsukiyono%20Kitan%20%28Japan%29%20%28Disc%201%29.chd","filesize":347367525,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Fantasy > Romance","desc":"<p><em>Maboroshi Tsukiyo</em> is a visual novel adventure game that originated on Dreamcast and was ported to PlayStation platform half a year later. The game features fullscreen presentation with dialogue and description text displayed over dimmed background rather than utilizing dialogue windows. The story progresses one day at the time and takes place between June and September. The protagonists whose name can be entered by the player or left the default one, is a high-school student who one day meets Ayame, a ghost girl, who starts living with him. Ayame cannot do much in her ghost form, but she can possess someone else's body. Suddenly, our protagonist's peaceful life turns to mystery and adventure filled one. Based on player's actions as well as events in the past intertwined with present story, the game will branch in a certain direction and lead to one of several different endings.</p>"},{"name":"Maboroshi Tsukiyo (Disk 1)","year":2000,"developer":"SIMS Co., Ltd.","url":"psx-chd-roms-m/Maboroshi%20Tsukiyo%20-%20Tsukiyono%20Kitan%20%28Japan%29%20%28Disc%202%29.chd","filesize":351038746,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Fantasy > Romance","desc":"<p><em>Maboroshi Tsukiyo</em> is a visual novel adventure game that originated on Dreamcast and was ported to PlayStation platform half a year later. The game features fullscreen presentation with dialogue and description text displayed over dimmed background rather than utilizing dialogue windows. The story progresses one day at the time and takes place between June and September. The protagonists whose name can be entered by the player or left the default one, is a high-school student who one day meets Ayame, a ghost girl, who starts living with him. Ayame cannot do much in her ghost form, but she can possess someone else's body. Suddenly, our protagonist's peaceful life turns to mystery and adventure filled one. Based on player's actions as well as events in the past intertwined with present story, the game will branch in a certain direction and lead to one of several different endings.</p>"},{"name":"Machi","year":1999,"developer":"Chunsoft Co., Ltd."},{"name":"Machine Head","year":1996,"developer":"Core Design Ltd.","url":"psx-chd-roms-m/Machine%20Head%20%28USA%29.chd","filesize":386716886,"score":7.1,"genres":"Action > 1st-person > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Blam! Machinehead is basically a normal 3D shooter where you shoot enemies and explore the futuristic, barren wastelands and abandoned factories and such as you try to save the world. The player controls Kimberly Stride, who is a scientist.She has to save the world from bad DNA that is slowly \"eating\" everything away.</p><p>As a player, you control this hovercraft-thingy which was designed to be a safe vehicle to be in while travelling through this infested world. The game has nice 3D graphics and a very unique mood to it that separates it from the more common shooters.</p>"},{"name":"Machine Hunter","year":1997,"developer":"Eurocom Developments Ltd","url":"psx-chd-roms-m/Machine%20Hunter%20%28Europe%29.chd","filesize":335154967,"score":6.4,"genres":"Action > Strategy > 3rd-person (Other) > Shooter > Sci-fi / futuristic","desc":"<p>A classic shooter with a twist. Aliens have invaded the Martian Colonies and reprogrammed the mining robots into killers. Earth, fearing an invasion, creates the Machine Hunters. They wear special suits that allow them to reprogram and take over the robots on contact. The trick is learning to control 9 different types of robots to fight the other robots. There are many different worlds to explore as you locate and battle the robots. All of the worlds let you teleport to different locations on the planets.</p>"},{"name":"Mad Panic Coaster","year":1997,"developer":"Hakuhodo Inc.","url":"psx-chd-roms-m/Mad%20Panic%20Coaster%20%28Japan%29.chd","filesize":332192970,"score":"","genres":"Action > Racing / Driving > Behind view > Arcade > Direct control > Contemporary > Horror","desc":"<p>Batayan and Kyako, two elementary school students, are out on a skateboarding date, as a shadowy figure creeps up behind them. The next thing they know, they are suddenly on a coaster, abducted to Mad Land by the creepy Dr. Jones. He tells them about his son Masao, who loved roller coasters. For his son, he dedicated his life to build the best roller coaster in the world. One day however, a spark ignited the coaster under construction, burning it down and disfiguring the doctor. Still, he did not give up, and after many years, the coaster was completed. But Masao had already grown up, and did not care about coasters anymore.</p><p><em>Mad Panic Coaster</em> is a fast-paced roller coaster action game with a mix of punk/skating and horror/monster themes. While rushing along the roller coaster track at ludicrous speeds, try to avoid enemies, obstacles and falling off. There are five environments with three stages each, and a boss fight after every third stage. Survive three laps around the track to finish a stage. There is a health bar which depletes when you fall off the track or take hits; falling off with an empty health bar leads to a game over.</p><p>The game features a sizable soundtrack of punk rock and metal tracks. The music director of the game, credited as \"Kenny\", is said to be Ken Yokohama of the Japanese punk rock band <em>Hi-Standard</em>.</p>"},{"name":"Madden NFL 2000","year":1999,"developer":"EA Tiburon","url":"psx-chd-roms-m/Madden%20NFL%202000%20%28Europe%29.chd","filesize":454850875,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Multiple units/characters control > Football (American) > Licensed","desc":"<p>John Madden brings the best football back to PC, bigger than ever! All 31 NFL teams (including the new Cleveland Browns), all-star and classic teams, player-specific animations, and much more. Graphics are better than ever. Improved running and rush interface gives you the ultimate control over strategy and execution. Even a franchise mode to keep you busy for a while.</p>"},{"name":"Madden NFL 2001","year":2000,"developer":"EA Tiburon","url":"psx-chd-roms-m/Madden%20NFL%202001%20%28Europe%29.chd","filesize":202097190,"score":7.3,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>Madden NFL 2001</em> is another yearly update in the long-running football series. The version for PlayStation and Nintendo 64 comes with its own selection of teams, modes and options, refined from the previous year's iteration. Compared to other versions, it has the largest number of modes, but less graphical fidelity and a lower number of selectable teams.</p><p>Players can select from the 31 teams of the 2000 NFL season and the 1999 All-Madden team on both consoles. The PlayStation version adds 31 All-Time franchise teams and 101 Classic NFL teams, from 1960 to 1999. Available modes include exhibition games, season, franchise, custom league (four to eight players), tournament (for 4, 8 or 16 players in single or double elimination), practice, and situation (set up any possible game situation to play). A new addition is called Two-Minute Drill: up to ten players compete for points by trying to perform spectacular plays within a two-minute time limit. Exclusive to the PlayStation version is the Great Games mode, allowing players to relive classic matchups from NFL history. The Great Games must be taken on in order and winning one makes the involved teams available for selection in other modes. As usual, player creation, drafting and trading as well as custom play creation is included in the game as well.</p><p>The previous year's Madden Challenge reappears in a new form called Madden Cards, resembling a collectible card game. The game includes a list of 100 challenges organized in five different levels. These include making certain plays or play combinations, beating teams under certain conditions (e.g. at home and in the rain), avoiding fumbles, sacks and penalties, et cetera. Completing a challenge gains the player tokens (how many depends on the difficulty level played at) which can be spent to buy a number of randomized Madden Cards. There are a total of 296 cards in the game (differing in rarity) which are collected in the in-game card book. Unwanted cards can be sold to regain half the tokens paid. It is also possible to trade cards with other player profiles and it is even possible to wager cards in two-player games. The cards have a number of different effects: most unlock classic players as well as hidden teams and stadiums. Others can be activated for different gameplay effects: making the game harder or easier or enabling gags such as teleporting players or putting the camera inside the ball.</p>"},{"name":"Madden NFL 2002","year":2001,"developer":"Budcat Creations, LLC","url":"psx-chd-roms-m/Madden%20NFL%202002%20%28USA%29.chd","filesize":217091247,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>Madden NFL 2002</em> is another yearly update in the long-running football franchise. With main series developer Tiburon focusing their efforts on the new generation of consoles, it fell to developer Budcat to update the game for the new year on the veteran platforms PlayStation and Nintendo 64. The 2002 version is closely based on the previous year's game, with almost the same menus and many of the same modes and options, but also several new features, including a redesigned kick meter and mulligans, allowing one to take back and replay a limited number of plays per game.</p><p>The included teams have been updated for the 2001 NFL season and include the 31 regular teams plus the 2002 expansion team, the Houston Texans, NFC and AFC all-star teams and two All-Madden teams (2000 and Super Bowl). Exclusive to the PlayStation version are more than 90 classic NFL teams, 31 all-time franchise teams and the 6 NFL Europe teams.</p><p>The returning modes include Exhibition, Season, Franchise, Custom League, Tournament, Situation (Great Games is again only featured on PlayStation), and Two-Minute Drill (with an added Head-to-Head option, facing off two players with one playing offense and the other defense). The Practice mode has been expanded to the Coaches Corner mode: the team practice option is the same as the previous year's practice while the new training mode is a tutorial that guides players through various plays by explaining when to use and how best to perform them. A special mode exclusive to this version of the game is called Madden Classic. It is a fully featured game-within-a-game that goes back to the early days of the series: regarding visuals, options, and menus, it is based on Madden 92 for Genesis, but features the teams and rosters of the current season.</p><p>The Madden Cards feature returns from the previous game. Tokens to buy cards can be won by completing a number of challenges or through the training mode. The card roster has been expanded from the previous year and now includes cheerleader cards that hype up their team when used.</p>"},{"name":"Madden NFL 2003","year":2002,"developer":"Budcat Creations, LLC","url":"psx-chd-roms-m/Madden%20NFL%202003%20%28USA%29.chd","filesize":247878788,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>The Madden franchise returns for another year on the PlayStation with <em>Madden NFL 2003</em>. Changes compared to the previous year's outing are minimal. The game uses the same menus and all the previous game modes and features are reused. The major changes are updated teams and rosters and new music tracks.</p><p>The included teams have been updated for the 2002 NFL season (reorganized into the new divisions) and include the 32 regular teams, NFC and AFC all-star teams, two All-Madden teams (2000 and Super Bowl), more than 90 classic NFL teams, 31 all-time franchise teams and the 6 NFL Europe teams.</p><p>The returning modes include Exhibition, Season, Franchise, Custom League, Tournament, Coaches Corner, Situation (including Great Games), and Two-Minute Drill. The Madden Classic mode that puts the current teams into Madden 92 also returns, as does the card-collecting sub-game Madden Cards.</p>"},{"name":"Madden NFL 2004","year":2003,"developer":"Budcat Creations, LLC","url":"psx-chd-roms-m/Madden%20NFL%202004%20%28USA%29.chd","filesize":238898514,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p><em>Madden NFL 2004</em> marks another appearance of the football franchise on the PlayStation, with minimal changes compared to the 2003 version. The game uses the same menus and all the previous game modes and features are reused. The major changes are updated teams and rosters and new music tracks.</p><p>The included teams have been updated for the 2003 NFL season and include the 32 regular teams, NFC and AFC all-star teams, more than 100 classic NFL teams, 31 all-time franchise teams and the 6 NFL Europe teams.</p><p>The returning modes are Exhibition, Season, Franchise, Custom League, Tournament, Coaches Corner, Situation (including Great Games), and Two-Minute Drill. The Madden Classic mode that puts the current teams into Madden 92 also returns, as does the card-collecting sub-game Madden Cards (but with a reduced number of cards).</p>"},{"name":"Madden NFL 2005","year":2004,"developer":"Budcat Creations, LLC","url":"psx-chd-roms-m/Madden%20NFL%202005%20%28USA%29.chd","filesize":240455631,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>The Madden football series makes a final appearance on the PlayStation with <em>Madden NFL 2005</em>. Compared to its predecessor, it is little more than a roster update: it uses the same menus and offers the same playing modes and features. Besides updated teams, it also offers new music tracks.</p><p>The included teams have been updated for the 2004 NFL season and include the 32 regular teams, NFC and AFC all-star teams, more than 100 classic NFL teams, 31 all-time franchise teams and the 6 NFL Europe teams.</p><p>The returning modes are Exhibition, Season, Franchise, Custom League, Tournament, Coaches Corner, Situation (including Great Games), and Two-Minute Drill. The Madden Classic mode that puts the current teams into Madden 92 also returns, as does the card-collecting sub-game Madden Cards.</p>"},{"name":"Madden NFL 97","year":1996,"developer":"Tiburon Entertainment","url":"psx-chd-roms-m/Madden%20NFL%2097%20%28Europe%29.chd","filesize":398738365,"score":7.7,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>The Madden football series makes its debut on the 32-bit consoles with <em>Madden NFL 97</em>. Like the PC version, the game moves into the world of polygonal 3D graphics, but has a unique set of modes, teams and options.</p><p>The game includes the 30 teams of the 1996 NFL season, the 1996 All-Madden team plus 68 classic teams from NFL history. Playing modes include Exhibition, Season and Tournament. All scheduled games during a season can be either played or simulated. The tournament is for either 8 or 16 players in single elimination mode. The game also includes the 30 team's home stadiums plus one extra arena in Hawaii.</p><p>Many features introduced in previous titles are reused here: variable weather (including night games), injuries and substitutions, ten different penalties (all adjustable), two skill levels, a bluffing mode for play calling, color commentary by John Madden, instant replays, and team roster editing with player creation (stats are set from a point pool), trading, releasing and signing of free agents. Player records and season progress can be saved to memory card/backup RAM. A new feature is the possibility to change which team is controlled at any time during a game.</p><p>During a game, the stadiums are rendered in polygonal texture-mapped 3D, with only the players, referees and ball as bitmaps. The game allows to choose from eight different camera perspectives, including views from the end zones and sidelines, a diagonal view and a \"classic cam\" emulating the perspective of earlier titles in the series on Genesis and SNES.</p>"},{"name":"Madden NFL 98","year":1997,"developer":"Tiburon Entertainment","url":"psx-chd-roms-m/Madden%20NFL%2098%20%28Europe%29.chd","filesize":428483299,"score":7.5,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>Madden NFL 98</em> is the second game in the series to appear on PlayStation and Saturn. It is based closely on the previous year's edition, but with the usual updates, revisions and several new features. Compared to versions on other platforms, the 32-bit console version comes with its own graphics engine and selection of teams, modes and options.</p><p>The game includes the 30 teams of the 1997 NFL season, the 1997 All-Madden team and 85 classic teams from NFL history, spanning 1960 to 1996. All the team's home stadiums plus the Pro Bowl stadium in Hawaii and the Super Bowl stadium in San Diego are available. Further teams and stadiums can be unlocked via secret codes. Returning playing modes from the predecessor are Exhibition, Season (including Playoffs and Super Bowl, based on the 1997 NFL schedule) and Tournament (8 or 16 player single elimination). Added to these are the new Custom Season and Fantasy Draft. Custom Season allows players to customize the NFL divisions and thus the schedule with all available teams, including the classic teams. Fantasy Draft is a custom tournament mode for four or eight teams. Players create their own teams by giving them names and then drafting players. The tournament consists of a round-robin round followed by semi-finals and finals. The option of creating and trading players also returns, and can be made more realistic by employing salary caps and trading deadlines within a season.</p><p>During a game, the same graphics style employed by the previous year's game is used: polygonally-rendered 3D stadiums with players, ball and referees as 2D bitmaps. The camera can be toggled between several perspectives, with most returning from the predecessor, but some being replaced by new ones.</p>"},{"name":"Madden NFL 99","year":1998,"developer":"EA Tiburon","url":"psx-chd-roms-m/Madden%20NFL%2099%20%28Europe%29.chd","filesize":416196217,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>As with all yearly updates to the football series, <em>Madden NFL 99</em> features improved graphics and AI over its predecessors. Force feedback, 8-button controllers and online support are available. The team roster includes nearly 100 successful vintage NFL teams as well as the full up to date roster at the time. There is more commentary integrated than before.</p><p>This version features a new Franchise mode, which allows you to control a team through a number of seasons, taking into account free agents, retirement, drafts, and salary caps. Each team can have different playbooks.</p><p>Also added is a one-button mode, which simplifies controls for beginners. Tying in with this is the arcade mode, which removes some of the more complex rules and adds to the force of impacts.</p>"},{"name":"Magic Carpet","year":1996,"developer":"Bullfrog Productions, Ltd.","url":"psx-chd-roms-m/Magic%20Carpet%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CSv%29.chd","filesize":216503747,"score":7.6,"genres":"Action > Compilation > 1st-person > Shooter > Flight / aviation","desc":"<p>This compilation contains:</p><ul><li>Magic Carpet (base game)</li><li>Magic Carpet: Hidden Worlds (add-on)</li></ul><p>In Europe, this version was made available as a re-release of <em>Magic Carpet</em>, not using Plus in the title.</p>"},{"name":"Magic: The Gathering - Battlemage","year":1997,"developer":"Realtime Associates Seattle Division","url":"psx-chd-roms-m/Magic%20-%20The%20Gathering%20-%20BattleMage%20%28Europe%29.chd","filesize":257046222,"score":5.6,"genres":"Strategy > Top-down > Real-time > Managerial / business simulation > Fantasy > Licensed","desc":"<p>Another of the Magic: The Gathering series, where you are a battle mage trying to challenge the authority of the new ultimate planeswalker of the lands.</p><p>This game combined a strategy-based interface with a real-time action battle simulation, in an attempt to \"put to life\" the creatures of the cards in real-time battle.</p><p>The storyline has different possibilities for the hero to take, so the course of the game differs for every new game.</p>"},{"name":"Magical Drop","year":1996,"developer":"Russ, Ltd.","url":"psx-chd-roms-m/Magical%20Drop%20%28Japan%29.chd","filesize":244892082,"score":7.4,"genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Tile matching puzzle > Direct control","desc":"<p>This is the very first coin-op game (and home conversions) in the <em>Magical Drop series</em>. Similar to other titles in the series, the goal of the game is to clear the screen of constantly advancing objects called 'drops'. The player character, stuck at the bottom of the screen, has a grapple which can be used to pull down a single drop, change its colour and put it back in line. Drops disappear when a line of three or more drops of the same colour is created.</p><p>There are several game modes: endless mode, story mode, two-player mode, and puzzle mode.</p>"},{"name":"Magical Drop F","year":1999,"developer":"Sakata SAS Co., Ltd.","url":"psx-chd-roms-m/Magical%20Drop%20F%20-%20Daibouken%20mo%20Rakujanai%21%20%28Japan%29%20%28Major%20Wave%29.chd","filesize":301570994,"score":"","genres":"Puzzle > Role-playing (RPG) > Diagonal-down > Side view > Anime / Manga > Real-time > Arcade > Tile matching puzzle","desc":"<p>This is the first title in <em>Magical Drop</em> series developed exclusively for the home console. Basic gameplay is similar to other entries in the series: you need to clear the screen of falling drops of different color. This is done by grabbing a drop of any color and shooting it back on the board trying to connect 3 or more drops of the same color to make them disappear. </p><p>Aside from Battle mode and Endless mode <em>Magical Drop F</em> features an RPG mode entirely new to the series: the player controls Justice, a girl who's on the mission to find 7 Magical Drops scattered across the land. Justice travels around a village talking to other characters, challenging them for battles and obtaining items and power-ups. In battle mode the player can use rechargable special attacks which usually have some benefits for the player or make mischief for the opponent.</p>"},{"name":"Magical Drop III (Disk 1)","year":2000,"developer":"Data East Corporation","url":"psx-chd-roms-m/Magical%20Drop%20III%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29%20%28Disc%201%29%20%28Magical%20Drop%20III%29.chd","filesize":199291838,"score":6.7,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Tile matching puzzle > Licensed","desc":"<p>This is the third installment in the puzzle frenzy series Magical Drop. In the game you control a clown who throws marbles up on the screen into the cluster of multi-colored marbles, rocks and crystals. The goal is to get three or more of the same color to remove marbles, but you can also grab more than one at the time to create long chain combos and gain better \"special\" blocks at the top of the screen.</p><p>You can play the game in single player modes or versus a friend in versus mode. In versus mode you get to pick your character, much like in a fighting game, each with their own counter attacks and abilities.</p><p>For the PSX version, the first Magical Drop was included on a separate disc.</p>"},{"name":"Magical Drop III (Disk 2)","year":2000,"developer":"Data East Corporation","url":"psx-chd-roms-m/Magical%20Drop%20III%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29%20%28Disc%202%29%20%28Magical%20Drop%20%2B1%29.chd","filesize":182493833,"score":6.7,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Tile matching puzzle > Licensed","desc":"<p>This is the third installment in the puzzle frenzy series Magical Drop. In the game you control a clown who throws marbles up on the screen into the cluster of multi-colored marbles, rocks and crystals. The goal is to get three or more of the same color to remove marbles, but you can also grab more than one at the time to create long chain combos and gain better \"special\" blocks at the top of the screen.</p><p>You can play the game in single player modes or versus a friend in versus mode. In versus mode you get to pick your character, much like in a fighting game, each with their own counter attacks and abilities.</p><p>For the PSX version, the first Magical Drop was included on a separate disc.</p>"},{"name":"Magical Tetris Challenge","year":1999,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-m/Magical%20Tetris%20Challenge%20%28Europe%29.chd","filesize":93023570,"score":6.9,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control > Licensed","desc":"<p><em>Magical Tetris Challenge</em> is a Tetris game that combines the classic puzzler with the Disney license, and offers two original competitive Tetris variants: Magical Tetris and Updown Tetris.</p><p>Both follow the standard Tetris template: Tetris pieces fall onto the playing field from the top and must be arranged so they form horizontal lines which are then removed, with the player whose stack of pieces reaches the top first losing.</p><p>In Magical Tetris, clearing two or more lines at the same time sends a magical attack to the opponent, which puts a non-standard magical piece into their queue. Magical pieces consists of more than four blocks and are thus harder to place, but can theoretically clear more lines at once. Magical attacks can be countered by clearing lines while the piece is in the queue. This sends the piece back to the opponent, changing it to a 2x2 square piece. Countered pieces can again be countered, growing in size with each counter to a maximum of 5x5. Overflow to an already full queue turns existing pieces into ones marked with an exclamation mark. These can't be countered and are massive in size and come in pyramid or diamond shapes. A clock counts the time during Magical Tetris - each minute of game time raises the game level, up to a maximum of 4, with higher levels resulting in more magical pieces added to the opponent's queue per cleared line.</p><p>Updown Tetris is less complex. Attacks against the opponent are made by clearing two or more lines, which are then (minus one column) added to the bottom of the opponent's playing field, pushing their stack higher.</p><p>Both modes include another gameplay element: the magical gauge is filled by clearing single lines or through attacks made by the opponent. Filling the meter clears the entire playing field above a certain threshold and simplifies the block structure below it. The meter is then cleared and the threshold rises, requiring more moves to fill it a second time. The threshold can only be lowered by clearing all blocks off the field.</p><p>The two modes are available in story and two-player modes. In story mode, players select one of four Disney characters (Mickey, Donald, Goofy and Minnie) who each come with their own storylines. The game then consists of consecutive matches against the other characters and the bad guys (Pete, Big Bad Wolf and Weasel), with cutscenes between matches.</p><p>Only the home versions have an endless mode, which offers standard Tetris and Magical Tetris.</p>"},{"name":"Mahjong Gokuu Tenjiku","year":1994,"developer":"Terajima Joho Kikaku Co., Ltd.","url":"psx-chd-roms-m/Mahjong%20Gokuu%20Tenjiku%20%28Japan%29.chd","filesize":348745438,"score":"","genres":"Strategy > 1st-person > Cards / tiles","desc":"<p><em>Mahjong Gokū Tenjiku</em> is a mahjong tournament between characters from <em>Xi You Ji</em> (\"Journey to the West\"), the classic Chinese novel. The player can choose to play as either of the four \"good\" characters from Xi You Ji: the Buddhist monk Xuan Zang, the famous monkey Sun Wukong, the pig Bajie, and Xuan Zang's pupil Wujing. They compete against a variety of Xi You Ji villains. The player can choose a location to set the mahjong game in and can configure most of the mahjong rules to their own preference in a special menu.</p>"},{"name":"Mahjong Station: MAZIN","year":1994,"developer":"Chat Noir Co., Ltd.","url":"psx-chd-roms-m/Mahjong%20Station%20Mazin%20%28Japan%29.chd","filesize":141419339,"score":"","genres":"Strategy > 1st-person > Anime / Manga > Cards / tiles","desc":"<p><em>MAZIN</em> is an early full-3D mahjong game. Ten heroes from the past and present, including a Greek warrior, a wild-west gunman, a 15th-century Romanian vampire, and a retro-futuristic robot, have been gathered together by the gods for a mahjong tournament. The game faithfully reproduces the 4-player variation of the ancient tile game, mixed with a highly-animated anime style where every move is reason to shout.</p><p>The game includes two modes. In Campaign Mode, the player takes control of a young man named Katsuya Ibuki and must prove his worth to the God of Mahjong. There is also a Free Battle mode where the player can choose any character to play as. In addition to the featured 3D \"Virtual\" mode, there is also a \"Standard\" 2D mode that ditches the extra animations and voiceovers to streamline the gameplay.</p>"},{"name":"Mahjong Taikai II Special","year":1996,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-m/Mahjong%20Taikai%20II%20Special%20%28Japan%29%20%28Rev%201%29.chd","filesize":245824582,"score":"","genres":"Strategy > 1st-person > Turn-based > Cards / tiles","desc":"<p><em>Mahjong Taikai II Special</em> is an enhanced remake of Mahjong Taikai II. The game plays much the same as the original version, allowing you to play mahjong against 23 famous historical and fictional figures, including Toyotomi Hideyoshi, Abraham Lincoln, Joan of Arc, and Sherlock Holmes. This remake includes full 3D graphics and voice clips for each character.</p>"},{"name":"Mahjong Uranai Fortuna -Tsuki no Megami Tachi","year":2001,"developer":"Affect Co.,Ltd","url":"psx-chd-roms-m/Mahjong%20Uranai%20Fortuna%20-%20Tsuki%20no%20Megami-tachi%20%28Japan%29.chd","filesize":294477890,"score":"","genres":"Puzzle > Top-down > Anime / Manga > Board game > Cards / tiles","desc":"<p>If you have been seeking a way to play the ancient game of mahjong and possibly get your fortune read by an adorable girl, then Mahjong Uranai Fortuna ~Tsuki no Megami Tachi~ is just the groundbreaking game you are looking for.<br>Choose 3 opponents from the 6 charming choices and engage in the classic four-man match up mahjong play style. If you don't give it your best, you will end up losing everything!<br>Don't worry, if you lose, you still walk away with a fortune...</p>"},{"name":"Mahjong Yarōze!","year":1999,"developer":"Konami Computer Entertainment Tokyo, Inc."},{"name":"Mahjong, The","year":1998,"developer":"Chat Noir Co., Ltd."},{"name":"Mahou Shoujo Fancy CoCo","year":1996,"developer":"Planning Office WADA","url":"psx-chd-roms-m/Mahou%20Shoujo%20Fancy%20CoCo%20%28Japan%29.chd","filesize":203105804,"score":"","genres":"Simulation > 1st-person > Anime / Manga > Fantasy","desc":"<p>Coco is a young princess in a magical kingdom, which has a tradition of shape-shifting magic. Her father, the king, explains to her that she must study magic for three years, in order to prove herself worthy of being a true heiress to the throne. Whether Coco will succeed or not depends on the player!</p><p><em>Mahō Shōjo Fancy Coco</em> is similar in gameplay to  Princess Maker games: the main goal is to make schedules for the young princess, alternating between actually learning magic and having vacations. Every activity influences Coco's stats, which in their turn influence her advancement in magics. Unlike <em>Princess Maker</em>, there is no RPG element and no free movement in certain locations. It is possible to visit the capital town and its nearby surroundings and talk to people, though those activities are only shown as still images.</p>"},{"name":"Mahou Shoujo Pretty Samy - Part 1 - In the Earth (Disk 1)","year":1996,"developer":"TamTam Co., Ltd.","url":"psx-chd-roms-m/Mahou%20Shoujo%20Pretty%20Samy%20-%20Part%201%20-%20In%20the%20Earth%20%28Japan%29%20%28Disc%201%29%20%28Episode%2023%29.chd","filesize":154485413,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Fantasy > Licensed","desc":"<p><em>Mahō Shōjo Pretty Sammy: Part 1 - In the Earth</em> is based on Magical Girl Pretty Sammy (魔法少女プリティサミー) anime TV series which focus on magically transformed Sasami character from <em>Tenchi Muyo!</em> universe. This is a visual novel featuring Sasami as the protagonist. For reasons unknown, she has been chosen as a champion by Tsunami, the next queen of Juraihelm, to fight in her name. But there are people bent on seeing Sasami fail in her endeavors and her tasks will soon prove much more challenging as she fights her way with Misao, her best friend who was chosen as a magical girl by Tsunami's opponent, Ramia.</p>"},{"name":"Mahou Shoujo Pretty Samy - Part 1 - In the Earth (Disk 2)","year":1996,"developer":"TamTam Co., Ltd.","url":"psx-chd-roms-m/Mahou%20Shoujo%20Pretty%20Samy%20-%20Part%201%20-%20In%20the%20Earth%20%28Japan%29%20%28Disc%202%29%20%28Episode%2024%29.chd","filesize":151868892,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel > Fantasy > Licensed","desc":"<p><em>Mahō Shōjo Pretty Sammy: Part 1 - In the Earth</em> is based on Magical Girl Pretty Sammy (魔法少女プリティサミー) anime TV series which focus on magically transformed Sasami character from <em>Tenchi Muyo!</em> universe. This is a visual novel featuring Sasami as the protagonist. For reasons unknown, she has been chosen as a champion by Tsunami, the next queen of Juraihelm, to fight in her name. But there are people bent on seeing Sasami fail in her endeavors and her tasks will soon prove much more challenging as she fights her way with Misao, her best friend who was chosen as a magical girl by Tsunami's opponent, Ramia.</p>"},{"name":"Mahou Tsukai ni Naru Houhou","year":1999,"developer":"Technical Group Laboratory, Inc.","url":"psx-chd-roms-m/Mahoutsukai%20ni%20Naru%20Houhou%20%28Japan%29.chd","filesize":197916489,"score":"","genres":"Action > Role-playing (RPG) > Simulation > 1st-person > Top-down > Anime / Manga > Meditative / Zen > Real-time > Action RPG > Direct control > Point and select > Fantasy > Medieval","desc":"<p><em>Mahoutsukai ni Naru Houhou</em> is a Simulation/Action Role-playing game taking place on an island. Players take the role of a wizard's apprentice who's aspiring to become a mage and players are given 3 girls to choose from (Lime, Berry or Nut). To become a mage, players must study how they can make scrolls and collect the ingredients necessary to make them. The game features a first person perspective while players are at home and switches to a top-down 2D view when they go outside (The Saturn and Playstation releases render areas in 3D). There are 102 days in a year in this game and 5 seasons during which different materials can be found on the island. The game has 70 kinds of scrolls and around 150 kinds of materials to collect.</p>"},{"name":"Majokko Daisakusen: Little witching mischiefs","year":1999,"developer":"Toys for Bob Inc.","url":"psx-chd-roms-m/Majokko%20Daisakusen%20-%20Little%20Witching%20Mischiefs%20%28Japan%29.chd","filesize":123226829,"score":"","genres":"Action > Strategy > 3rd-person (Other) > Top-down > Anime / Manga > Arcade > Licensed","desc":"<p><em>Majokko Daisakusen</em> is a turn-based strategy game with action-style battles featuring characters from several famous magical girl anime series from the '60s, '70s, and '80s: <em>Mahō Tsukai Sally</em>, <em>Himitsu no Akko-chan</em>, <em>Mahō Tsukai Chappy</em>, <em>Cutey Honey</em>, <em>Majokko Megu-chan</em>, <em>Hana no Ko Lunlun</em>, and <em>Mahō Shōjo Lalabel</em>. It is in fact a reworked version of The Unholy War with all of the graphics, sound, and story completely replaced. The game itself, however, is essentially identical between the two releases.</p>"},{"name":"Makeruna! Makendou 2","year":1995,"developer":"Success Corp.","url":"psx-chd-roms-m/Makeruna%21%20Makendou%202%20%28Japan%29.chd","filesize":311968017,"score":"","genres":"Action > Side view > Anime / Manga > Fighting > Martial arts","desc":"<p>The Ghost Prime Minister is holding a fighting tournament, and 14-year-old Hikari Tsurugino, the second Mighty Makendo, must face off against all sort of strange apparitions. Characters from the first game make appearances, including Mai Tsurugino, Hikari's sister and the first Mighty Makendo.</p><p><em>Makeruna! Makendō 2</em> is a comical VS fighting game with an eclectic cast of characters including a soccer player, a zombie, a musclebound mer-man, and a giant robot. Bouts are best two-out-of-three, and each character has both a life bar and a \"Makendo\" meter, which lets each character perform a variety of special attacks. The game includes a story mode and a 2-player versus mode.</p>"},{"name":"Manic Game Girl","year":2002,"developer":"Joycast Entertainment Co."},{"name":"Manpuku!! Nabe Kazoku","year":2002,"developer":"Media Entertainment Inc"},{"name":"Marble Master","year":1998,"developer":"Software 2000","url":"psx-chd-roms-m/Marble%20Master%20%28USA%29.chd","filesize":258146661,"score":7.5,"genres":"Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Tile matching puzzle","desc":"<p>Swing is a Tetris inspired puzzle game:At the top of the screen you see two lines of eight balls (\"spheres\") in different colors and weights (shown as numbers). At the bottom are four scales. You can transport and put down one sphere at the same time through a grey device between the two parts described above. Three spheres of the same color side by side will disappear and give you points; all other same spheres in vertical or horizontal neighborhood to this three will also vanish (combos)!The clue are the scales because of imbalance they go up or down and can catapult the spheres over the whole area! And there can be highest only eight spheres on one scale pan - otherwise game over. Later in a game there will be more and more colors and special items.The multiplayer mode is even more funny because there you have to make big combos for better items which you can catapult into your opponents area!</p>"},{"name":"March Madness '98","year":1998,"developer":"Electronic Arts, Inc.","url":"psx-chd-roms-m/March%20Madness%20%2798%20%28USA%29.chd","filesize":300706591,"score":"","genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>March Madness '98</em> is a college basketball game. Its features include the NCAA Tournament, 107 division 1A teams, 9 women's teams, team specific fight songs and chants, plus authentic college uniforms and logos. The game also gives you the opportunity to win preseason and conference tournaments. Create your own player from scratch, or customize your own NCAA Tournament with up to 64 teams. The game also has a momentum meter which can go up when a team is doing well temporarily increasing the ability ratings of its players.</p>"},{"name":"Märchen Adventure Cotton 100%","year":2003,"developer":"Success Corp."},{"name":"Maria 2: Jutaikokuchi no Nazo (Disk 1)","year":1999,"developer":"Break","url":"psx-chd-roms-m/Maria%202%20-%20Jutai%20Kokuchi%20no%20Nazo%20%28Japan%29%20%28Disc%201%29.chd","filesize":321825167,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Detective / mystery","desc":"<p>The protagonist of the story is Maria Kunitomo (国友 真里亜), a rookie journalist working for Sakura TV station. One day she follows an interview with a renowned biologist, Dr. Amon, which captures her interest. Later that evening the news report that Dr. Amon has been killed in his laboratory, and his assistant, Jun Kageyama (景山 純), whom Maria have met during the interview, is the prime suspect. While on a search for the truth behind Amon's murder, she stumbles on a conspiracy of a huge proportions.</p><p>It has been two years since the events in Maria: Kimitachi ga Umareta Wake, and while the setting is the same as well as some recurring characters, the stories are anything but connected. The gameplay is similar to its predecessor, using text-only during dialogue with characters while emphasizing key scenes with voice-acting and pre-rendered CG videos. Aside from direct dialogues in a visual novel style, Maria can use her computer and check emails to gather information. The game features three different endings available during first playthrough, after which the save game can be used to start new game which will open additional scenario routes and unlock two more attainable endings.</p>"},{"name":"Maria 2: Jutaikokuchi no Nazo (Disk 2)","year":1999,"developer":"Break","url":"psx-chd-roms-m/Maria%202%20-%20Jutai%20Kokuchi%20no%20Nazo%20%28Japan%29%20%28Disc%202%29.chd","filesize":292475560,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Detective / mystery","desc":"<p>The protagonist of the story is Maria Kunitomo (国友 真里亜), a rookie journalist working for Sakura TV station. One day she follows an interview with a renowned biologist, Dr. Amon, which captures her interest. Later that evening the news report that Dr. Amon has been killed in his laboratory, and his assistant, Jun Kageyama (景山 純), whom Maria have met during the interview, is the prime suspect. While on a search for the truth behind Amon's murder, she stumbles on a conspiracy of a huge proportions.</p><p>It has been two years since the events in Maria: Kimitachi ga Umareta Wake, and while the setting is the same as well as some recurring characters, the stories are anything but connected. The gameplay is similar to its predecessor, using text-only during dialogue with characters while emphasizing key scenes with voice-acting and pre-rendered CG videos. Aside from direct dialogues in a visual novel style, Maria can use her computer and check emails to gather information. The game features three different endings available during first playthrough, after which the save game can be used to start new game which will open additional scenario routes and unlock two more attainable endings.</p>"},{"name":"Maria 2: Jutaikokuchi no Nazo (Disk 3)","year":1999,"developer":"Break","url":"psx-chd-roms-m/Maria%202%20-%20Jutai%20Kokuchi%20no%20Nazo%20%28Japan%29%20%28Disc%203%29.chd","filesize":419877550,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Detective / mystery","desc":"<p>The protagonist of the story is Maria Kunitomo (国友 真里亜), a rookie journalist working for Sakura TV station. One day she follows an interview with a renowned biologist, Dr. Amon, which captures her interest. Later that evening the news report that Dr. Amon has been killed in his laboratory, and his assistant, Jun Kageyama (景山 純), whom Maria have met during the interview, is the prime suspect. While on a search for the truth behind Amon's murder, she stumbles on a conspiracy of a huge proportions.</p><p>It has been two years since the events in Maria: Kimitachi ga Umareta Wake, and while the setting is the same as well as some recurring characters, the stories are anything but connected. The gameplay is similar to its predecessor, using text-only during dialogue with characters while emphasizing key scenes with voice-acting and pre-rendered CG videos. Aside from direct dialogues in a visual novel style, Maria can use her computer and check emails to gather information. The game features three different endings available during first playthrough, after which the save game can be used to start new game which will open additional scenario routes and unlock two more attainable endings.</p>"},{"name":"Maria: Kimitachi ga Umareta Wake (Disk 1)","year":1997,"developer":"Break","url":"psx-chd-roms-m/Maria%20-%20Kimitachi%20ga%20Umareta%20Wake%20%28Japan%29%20%28Disc%201%29.chd","filesize":149088205,"score":"","genres":"Adventure > 1st-person","desc":"<p>In this game, you play as a young psychiatrist named Takano. One day a new patient is brought into the hospital you work in - Maria, a young woman who has attempted suicide. She suffers from amnesia, and you try to find out more about her, visiting her and talking to her. Before long you discover that Maria has schizophrenia - a split personality. Her \"other self\" appears to be evil and threatens to take over her. The fight for Maria's sanity begins.</p><p>The game plays like an interactive novel or movie: you read text and from time to time make a choice from two or more available ones. Instead of the standard 2D animé-style graphics the game utilizes semi-realistic CG pre-rendered backgrounds and characters. There are also CG animated movies in the game.</p>"},{"name":"Maria: Kimitachi ga Umareta Wake (Disk 2)","year":1997,"developer":"Break","url":"psx-chd-roms-m/Maria%20-%20Kimitachi%20ga%20Umareta%20Wake%20%28Japan%29%20%28Disc%202%29.chd","filesize":349723065,"score":"","genres":"Adventure > 1st-person","desc":"<p>In this game, you play as a young psychiatrist named Takano. One day a new patient is brought into the hospital you work in - Maria, a young woman who has attempted suicide. She suffers from amnesia, and you try to find out more about her, visiting her and talking to her. Before long you discover that Maria has schizophrenia - a split personality. Her \"other self\" appears to be evil and threatens to take over her. The fight for Maria's sanity begins.</p><p>The game plays like an interactive novel or movie: you read text and from time to time make a choice from two or more available ones. Instead of the standard 2D animé-style graphics the game utilizes semi-realistic CG pre-rendered backgrounds and characters. There are also CG animated movies in the game.</p>"},{"name":"Maria: Kimitachi ga Umareta Wake (Disk 3)","year":1997,"developer":"Break","url":"psx-chd-roms-m/Maria%20-%20Kimitachi%20ga%20Umareta%20Wake%20%28Japan%29%20%28Disc%203%29.chd","filesize":356890191,"score":"","genres":"Adventure > 1st-person","desc":"<p>In this game, you play as a young psychiatrist named Takano. One day a new patient is brought into the hospital you work in - Maria, a young woman who has attempted suicide. She suffers from amnesia, and you try to find out more about her, visiting her and talking to her. Before long you discover that Maria has schizophrenia - a split personality. Her \"other self\" appears to be evil and threatens to take over her. The fight for Maria's sanity begins.</p><p>The game plays like an interactive novel or movie: you read text and from time to time make a choice from two or more available ones. Instead of the standard 2D animé-style graphics the game utilizes semi-realistic CG pre-rendered backgrounds and characters. There are also CG animated movies in the game.</p>"},{"name":"Marionette Company","year":1999,"developer":"Micro Cabin Corp.","url":"psx-chd-roms-m/Marionette%20Company%20%28Japan%29.chd","filesize":307731433,"score":"","genres":"Adventure > Simulation > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p>One day, you stumble upon a broken Marionette, an android girl. Crying for help from inside a box in a shady alley. You take upon yourself to repair her, but she seems far from being human yet. Even her smile seems emotionless. The goal of this Visual Novel is to repair the Marionette girl by interacting with her and changing her body parts, to ultimately fix not only her body, but her heart.</p>"},{"name":"Marionette Company 2","year":2000,"developer":"Micro Cabin Corp.","url":"psx-chd-roms-m/Marionette%20Company%202%20Chu%21%20%28Japan%29.chd","filesize":257250947,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga > Visual novel","desc":"<p><em>Marionette Company 2</em> is a direct sequel to Marionette Company and you play as a same high-school student from the original. One day, while reminiscing on the events from the past, you stumble upon a pair of abandoned marionettes, Marine and Maria. You take Marine under your care while your classmate Alessa takes the other one. While Alessa don't think of marionettes as anything more than a bunch of circuits pieced together, you experience tells you that's not true and you decide to prove her wrong by once again raising your marionette to a near-human form.</p><p>This visual novel comes with a typical interface for such adventure games, and also includes unlockable CG album, but aside from regular story dialogues your main focus in the game would be to construct and upgrade your marionette to act as close as humanly possible. You can teach her communication or you can focus on construction of her physique and functional processing. While you can change her appearance with different outfit or skin and hair color, that will not change her personality or the ability to reason or understand or act differently. For that you will need to acquire and install better CPU, mother board, cooler, generator and other such parts.</p>"},{"name":"Marl Oukoku no Ningyouhime: The Adventure of Puppet Princess (Japan)","year":1999,"developer":"Nippon Ichi Software, Inc.","url":"psx-chd-roms-m/Marl%20Oukoku%20no%20Ningyouhime%20-%20The%20Adventure%20of%20Puppet%20Princess%20%28Japan%29.chd","filesize":123630699,"score":"","genres":"Role-playing (RPG) > Isometric > Anime / Manga > Turn-based > Music / rhythm","desc":"<p>This is a budget-priced re-release of Marl Ōkoku no Ningyō Hime (<em>Rhapsody: A Musical Adventure</em>) that includes an extra bonus disc containing the following:</p><ul><li>A demo of Little Princess: Marl Ōkoku no Ningyō Hime 2</li><li>A music and illustration gallery</li></ul>"},{"name":"Marl Oukoku no Ningyouhime: The Adventure of Puppet Princess (Japan) (Omake Disc)","year":1999,"developer":"Nippon Ichi Software, Inc.","url":"psx-chd-roms-m/Marl%20Oukoku%20no%20Ningyouhime%20-%20The%20Adventure%20of%20Puppet%20Princess%20%28Japan%29%20%28Omake%20Disc%29.chd","filesize":118521339,"score":"","genres":"Role-playing (RPG) > Isometric > Anime / Manga > Turn-based > Music / rhythm","desc":"<p>This is a budget-priced re-release of Marl Ōkoku no Ningyō Hime (<em>Rhapsody: A Musical Adventure</em>) that includes an extra bonus disc containing the following:</p><ul><li>A demo of Little Princess: Marl Ōkoku no Ningyō Hime 2</li><li>A music and illustration gallery</li></ul>"},{"name":"Marl Oukoku no Ningyouhime: The Adventure of Puppet Princess (Japan) (PSone Books)","year":1999,"developer":"Nippon Ichi Software, Inc.","url":"psx-chd-roms-m/Marl%20Oukoku%20no%20Ningyouhime%20-%20The%20Adventure%20of%20Puppet%20Princess%20%28Japan%29%20%28PSone%20Books%29.chd","filesize":122692367,"score":"","genres":"Role-playing (RPG) > Isometric > Anime / Manga > Turn-based > Music / rhythm","desc":"<p>This is a budget-priced re-release of Marl Ōkoku no Ningyō Hime (<em>Rhapsody: A Musical Adventure</em>) that includes an extra bonus disc containing the following:</p><ul><li>A demo of Little Princess: Marl Ōkoku no Ningyō Hime 2</li><li>A music and illustration gallery</li></ul>"},{"name":"Marl Oukoku no Ningyouhime: The Adventure of Puppet Princess (Japan) (Taikenban)","year":1999,"developer":"Nippon Ichi Software, Inc.","url":"psx-chd-roms-m/Marl%20Oukoku%20no%20Ningyouhime%20-%20The%20Adventure%20of%20Puppet%20Princess%20%28Japan%29%20%28Taikenban%29.chd","filesize":31969580,"score":"","genres":"Role-playing (RPG) > Isometric > Anime / Manga > Turn-based > Music / rhythm","desc":"<p>This is a budget-priced re-release of Marl Ōkoku no Ningyō Hime (<em>Rhapsody: A Musical Adventure</em>) that includes an extra bonus disc containing the following:</p><ul><li>A demo of Little Princess: Marl Ōkoku no Ningyō Hime 2</li><li>A music and illustration gallery</li></ul>"},{"name":"Martian Gothic: Unification","year":2001,"developer":"Creative Reality","url":"psx-chd-roms-m/Martian%20Gothic%20-%20Unification%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.chd","filesize":261479549,"score":6.5,"genres":"Action > 3rd-person (Other) > Puzzle elements > Shooter > Sci-fi / futuristic > Horror","desc":"<p>It's the year 2017. The planet Earth sets up a research station, Vita Base, on Mars with the mission to discover if life did exist there. After a discovery there comes one last garbled message—danger, danger cliché approaching--“have opened Pandora’s box… all the evils of old Mars have flown out,” and a warning, “…if you do send a manned mission, warn the crew…Stay Alone, Stay Alive…” then nothing. So now it’s 2018, and your rescue mission to Mars crash lands. When you get to the base, the welcome wagon is made up of zombies and an alien virus that will make you look back fondly on the days of the Black Plague. </p><p>You control a team of three: Kenzo, Karne and Matlock. They enter the base from different airlocks and try to discover what happened. The reason for the whole \"Stay alone, stay alive\" warning is that if your team members come together they end up forming into a disgusting mass of flesh -- picture the thing from Leviathan -- called a Trimorph. </p><p>As you proceed though the base you find clues as to what occurred. In addition, you run into Trimorphs, some of the non zombiefied former base crew, that are bent on your destruction. They come in two sizes -- the small spidery kind which hack at your shins and jump on your face or the huge \"better run like hell\" monstrosities that will tear you to pieces.</p>"},{"name":"Marvel Super Heroes","year":1997,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-m/Marvel%20Super%20Heroes%20%28Europe%29.chd","filesize":314399750,"score":7.7,"genres":"Action > Side view > Fighting > Licensed","desc":"<p><em>Marvel Super Heroes</em> is a 2D fighting game and the second Capcom title to feature characters from the Marvel comic universe. The gameplay is very similar to X-Men: Children of the Atom, but with a simplified Super Combo gauge and the addition of infinity gems. Each character starts with a set of gems. These can be activated during a fight to improve speed, power and defence, or provide special abilities to create crushing stone walls, open up a rift in space, or reverse the opponent's controls. The use of the gems is inspired by the <em>The Infinity Gauntlet</em> comic book series.</p><p>There are ten playable characters. The heroes are Captain America, The Incredible Hulk, Iron Man, Psylocke, Spider-Man and Wolverine. The villains are Blackheart, Juggernaut, Magneto and Shuma-Gorath. Anita from the Darkstalkers series is a hidden character in the Japanese version. The bosses are Doctor Doom and Thanos. During the boss fight Thanos steals all the player's gems (except for mind) and uses them with new effects.</p>"},{"name":"Marvel Super Heroes vs. Street Fighter","year":1999,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-m/Marvel%20Super%20Heroes%20vs.%20Street%20Fighter%20%28Europe%29.chd","filesize":308639993,"score":7.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Martial arts > Licensed > Regional differences","desc":"<p><em>Marvel Super Heroes Vs. Street Fighter</em> is a 2D fighting game and the first to combine characters from Capcom's Street Fighter series with those of the Marvel comic universe. It is also the first in Capcom's games to introduce a tag team style of combat where the player can call for another character during a fight.</p><p>Matches consists of two-on-two battles where the player can only control one character at a time. The other character can be called in regularly or while doing an attack. The off-screen one also regains some health while waiting. Both opposing characters need to be defeated to win the match, and when one dies the other is called in automatically. The tag team options introduces Variable Attack, Variable Counter and Variable Combination where the two characters team up to attack, counter of perform a special move.</p><p>Most of the X-Men characters were already present in X-Men: Children of the Atom and Marvel Super Heroes: Cyclops, Storm, Juggernaut, Magneto and Wolverine, with the addition of Rogue, Gambit and Sabretooth. The Street Fighter characters are gathered from Street Fighter Alpha 2: Ryu, Ken, Cammy/Chun-Li, Charlie, Zangief, Dhalsim, M. Bison and Akuma. The final boss of the game is Apocalypse.</p><p>The PlayStation version does not include the tag team feature and relies on the more traditional best-two-of-three round setup.</p>"},{"name":"Marvel vs. Capcom: Clash of Super Heroes","year":1999,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-m/Marvel%20vs.%20Capcom%20-%20Clash%20of%20Super%20Heroes%20%28Europe%29.chd","filesize":270814473,"score":7.5,"genres":"Action > Side view > Fixed / flip-screen > Fighting > Licensed","desc":"<p><em>Marvel vs. Capcom: Clash of Super Heroes</em> is a 2D fighting game that combines characters from Capcom's videogames with characters from the Marvel comic universe, similar to Marvel Super Heroes Vs. Street Fighter. The game takes place in a Marvel universe where Professor Charles Xavier asks the heroes to help him before he merges with the consciousness of Magneto to form the being known as Onslaught, the final boss.</p><p>The game follows the standard fighting gameplay, but different from X-Men vs. Street Fighter you now have to make up a squad of three characters instead of two. The other characters can be summoned for assist attacks and there is also a duo team attack to control two characters for a brief time, along with the ability to perform super moves where the characters team up.</p><p>Options include a straight arcade battle, 4-player tag modes (Dreamcast version only), a survival mode (much like Street Fighter Alpha 3), and a training mode. The PlayStation version does not have the 4-player tag mode and also reduces the second character to an assist role, but in addition, introduces a \"crossover\" mode where tag-team play with identical teams is possible.</p><p>For Marvel, the cast of playable characters includes Spider-Man, Captain America, Venom, Hulk, Gambit, War Machine, Wolverine, Gold War Machine (secret character), Hyper Venom (secret character), Orange Hulk (secret character), and Onslaught (secret character). The Capcom side offers Chun-Li, Ryu, Zangief, Morrigan Aensland, Captain Commando, Megaman (Rockman in Asia), Strider Hiryu, Jin Saotome, Roll (secret character), Lilith-Mode Morrigan (secret character), and Shadow Lady (secret character). There is also a large number of special partners that can be summoned.</p>"},{"name":"Mary King's Riding Star","year":2000,"developer":"IR Gurus Interactive Pty Ltd.","url":"psx-chd-roms-m/Mary%20King%27s%20Riding%20Star%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.chd","filesize":136324090,"score":5.6,"genres":"Sports > Strategy > Diagonal-down > Isometric > Managerial / business simulation > Horse / derby","desc":"<p><em>Mary King's Riding Star</em> is a managerial simulation set in the equestrian sports business. The game focuses in the athletic part, this means there are no finances to manage and the goal of the game is to win as many championships as possible in the events dressage, cross country and showjumping. </p><p>To achieve this goal the player has to \"manage\" his horse by using the training grounds to improve the horses's skills. The player also has to manually clean the stall and feed and groom the horse. The championships are shown in a isometric perspective with spoken commentary. There are options to personalize the game, e.g. by naming the horse and choose its color.</p><p>The game is largely based on the original 1998 Riding Star and was created in cooperation with its developer Blue Tongue.</p>"},{"name":"Mary-Kate and Ashley: Crush Course","year":2001,"developer":"n-Space, Inc.","url":"psx-chd-roms-m/Mary-Kate%20and%20Ashley%20-%20Crush%20Course%20%28Europe%29.chd","filesize":273339608,"score":"","genres":"Action > 3rd-person (Other) > Arcade > Music / rhythm > Licensed","desc":"<p><em>Mary-Kate and Ashley: Crush Course</em> is a game for one or two players.</p><p>The girls learn that their arch enemy, Courtney, has been seen near their lockers. On investigation they find pieces of a torn up note, an invitation to a beach party no less, but they have no idea who it's from. This sets the scene for a series of challenges, the rewards for which are further pieces of the note which eventually reveal which of the cute guys has a crush on them. The challenges are:* Freshman Year: <br>The Physics Class where a game of mini-golf is used to explore gravity, velocity and friction. <br>The Cheerleading Tryouts where the player(s) have to match the moves made by the gym teacher</p><ul><li><p>Sophomore Hall: <br>The Marine Biology Class which is a timed game where the object is to collect creatures and litter, one goes into the bin and the other is returned to the sea.<br>Journalism Class where the player(s) must explore the school and take photographs of the people on their assignment list.</p></li><li><p>The Junior &amp; Senior Hall:<br>The Talent Show where the object is to follow the instructors moves and beat Courtney.<br>Journalism, again, but this time the player is taking pictures for the school year book.<br>Finally a series of seaside arcade games, Ball Toss, Treasure Hunt, and Hoops</p></li></ul><p>All the mini games can be played as a series in game-mode or individually. In game-mode the games are graded, a B or higher is needed to win a piece of the message, and initially the player(s) will only have access to the games in the Freshman year. <br>They are all one or two player games and are keyboard controlled.</p>"},{"name":"Mary-Kate and Ashley: Magical Mystery Mall","year":2000,"developer":"n-Space, Inc.","url":"psx-chd-roms-m/Mary-Kate%20and%20Ashley%20-%20Magical%20Mystery%20Mall%20%28Europe%2C%20Australia%29.chd","filesize":183681083,"score":"","genres":"Action > Racing / Driving > Sports > Music / rhythm > Stealth > Snowboarding / skiing > Licensed","desc":"<p>In <em>Mary-Kate and Ashley: Magical Mystery Mall</em>, the Olsen's favorite mall has been frozen in time. They must collect all the missing gems to end the spell or they'll never be able to leave. It is essentially a collection of minigames with the mall serving as a hub. There's an information booth which teaches how to play and get to the various games, then there are the stores with the games.</p><p>There is a fashion show segment, where you must first pick the number of outfits to model, which twin goes first, then all the pieces of each outfit. There are four pieces you can choose independently: hair, shirt, skirt/pants and shoes. For each part, you can choose color and style separately, making for a lot of possible outfits. Next, they model them on a runway. You must take a good picture of the outfit, which means proper camera position and zoom and catching them as they do a pose. You get points for each picture, which as used to earn a gem.</p><p>There is also a Lizzie's Lunch segment which has the girls working in a fast food court on roller skates. As either Mary-Kate or Ashley, you must take customer orders, then bring them their food before they get impatient. You earn money for each customer served and go through multiple rounds trying to get the minimum amount of money before time runs out. if you can earn $100 before the end of round five, you get another gem.</p><p>There is also a snowboard race game. You must win two out of three heats on each slope to earn your gem here. There are pairs of flags throughout the course that must must pass through to get a speed boost. There are also snowflake tokens to collect to earn extra boards.</p><p>In a record store segment, called Music Nation, you must film a music video for Mary-Kate and Ashley. First, you pick out a set of dance moves, then film the results. You must switch camera angles and use special effects to get a high enough score to win a gem. In this section, you can remove the game disc and insert any audio CD and choreograph moves to it instead of the included music.</p><p>In the next segment, Mary-Kate and Ashley must try to pose for photos with two lifeguard boys who are trying to avoid them. There are several rounds of situations where one sister holds the camera and the other tries to jump in a photo with them when they aren't looking. Take clear pictures showing their faces to get a gem.</p><p>Once you complete all the segments, you can use the points you earned at the bonus boutique to unlock additional options for the various games, such as extra fashion runways or a dancing DJ in the Music Nation segment.</p>"},{"name":"Mary-Kate and Ashley: Winners Circle","year":2001,"developer":"Tantalus Interactive Pty. Ltd.","url":"psx-chd-roms-m/Mary-Kate%20and%20Ashley%20-%20Winners%20Circle%20%28Europe%29.chd","filesize":121326766,"score":"","genres":"Sports > Behind view > Direct control > Horse / derby > Licensed","desc":"<p>Are you ready to ride?<br>Saddle up for some high-tailed adventure on horseback!<br>Enjoy the true experience of owning your very own horse! * Compete in EQUESTRIAN EVENTS like show jumping, cross-country and dressage! * EXPLORE EXCITING RIDING WORLDS and earn ribbons by solving puzzles! * Trade in ribbons to BUY FABULOUS OUTFITS! * Ride as Mary-Kate, Ashley or a CUSTOM CREATED PLAYER in 1 or 2 player riding mode. * Choose, name and TAKE CARE OF YOUR VERY OWN HORSE. It's a dream come true!</p>"},{"name":"Mass Destruction","year":1997,"developer":"NMS Software Ltd.","url":"psx-chd-roms-m/Mass%20Destruction%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":285812539,"score":7,"genres":"Action > Strategy > Top-down > Shooter > Tank","desc":"<p><em>Mass Destruction</em> puts players behind the controls of a one-man tank. The environments range from arctic to desert to urban. The player can blow up trees, buildings, walls - whatever you don't like the look. Enemies will come at you in tanks, planes, helicopters, and on foot. Each of the different weapons available to the player works best on a specific enemy. The player can use guided missiles for the helicopters and run over infantry men with the tank.</p>"},{"name":"Master of Magic","year":1997,"developer":"SimTex, Inc."},{"name":"Master of Monsters: Disciples of Gaia","year":1997,"developer":"SystemSoft","url":"psx-chd-roms-m/Master%20of%20Monsters%20-%20Disciples%20of%20Gaia%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":97420113,"score":5.8,"genres":"Strategy > 3rd-person (Other) > Isometric > Anime / Manga > Fantasy","desc":"<p>Masters of Monsters is an anime, turn bases strategy / combat game. You have the option of Story Mode, Single Map Mode, or VS Mode. You choose one of the Disciples of Gaia. The alignment of the Disciple (Law, Neutral, and Chaos) determines what type of creatures you can summon. The goal is to capture and control towers and to summon / build up / replace your monsters as you combat your opponent on a hex grid / turn based map. In Story mode you play as Iros and have the aid of one of the Disciples where you have to fight the other Disciples and your goal is to defeat Gaia, the once “protector” of the world turned evil.</p>"},{"name":"Master's Fighter, The","year":1997,"developer":"Unico Electronics Co., Ltd.","url":"psx-chd-roms-m/Masters%20Fighter%2C%20The%20%28Japan%29.chd","filesize":248700364,"score":"","genres":"Action > Side view > Anime / Manga > Arcade > Fighting > Direct control","desc":"<p>The Master's Fighter is a remake of the arcade 2D fighting game Master's Fury. The game features a Story mode, VS Mode and a Watch Mode where you can just watch fights without controlling the fighter. The game has both Japanese and English language options even though it was only ever release in Japan.</p>"},{"name":"Masters: Shin Harukanaru Augusta","year":1996,"developer":"T&E Soft, Inc."},{"name":"Mat Hoffman's Pro BMX","year":2001,"developer":"Runecraft Ltd.","url":"psx-chd-roms-m/Mat%20Hoffman%27s%20Pro%20BMX%20%28Europe%29.chd","filesize":449662708,"score":7,"genres":"Sports > 3rd-person (Other) > Bike / bicycling > Licensed","desc":"<p>Legendary BMX rider Mat Hoffman leads a cast of some of the best riders on the planet in this Tony Hawk's Pro Skater style title. Perform tricks and make the points to proceed through each level of Street, Vert, and Dirt courses, or take on a mate in 2 player split screen mode and see who has the best bike in town. Career mode allows you to build up your chosen character and make, as it mentions, a Career. And the BMX Course Editor allows you to build your own Street, Vert and Dirt courses for multiplayer action.</p>"},{"name":"Max Power Racing","year":1998,"developer":"Eutechnyx Limited","url":"psx-chd-roms-m/Max%20Power%20Racing%20%28Europe%29.chd","filesize":300827186,"score":7.2,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Licensed","desc":"<p><em>Max Power Racing</em> is a racing simulation game. It is licensed by the UK magazine Max Power. It features cars from various manufacturers. It features 30 tracks across 11 countries from all over the world, featuring cities, mountain roads as well as off-road tracks. You can play in arcade mode (to unlock tracks), player mode and championship mode. Player mode allows you to play against a friend or set personal records and in championship mode you play through all tracks. There are four difficulties to select from in the championship mode. You start with the lowest, but finishing first gains you points with which you can unlock the other difficulties and new and better cars to race with.</p><p>The game features various weather conditions and dynamic lighting during night races.</p>"},{"name":"Max Surfing 2nd","year":2000,"developer":"KSS","url":"psx-chd-roms-m/Max%20Surfing%202nd%20%28Japan%29.chd","filesize":373715643,"score":"","genres":"Sports > 3rd-person (Other) > Surfing","desc":"<p>This is the 2nd installment of the original surfing game!<br>More new boards will be added comparing to the previous game. Select a board suitable for techniques such as jump, turn, and accelerate to perform flashy techniques to earn points!<br>Height of the wave and the wave speed can be freely adjusted in the free mode, so you can keep polishing your technique until you are satisfied!<br>Practice your skills with the free mode and work your way to win the world championship!</p>"},{"name":"Maximum Force","year":1997,"developer":"Mesa Logic, Inc.","url":"psx-chd-roms-m/Maximum%20Force%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.chd","filesize":330786260,"score":5.3,"genres":"Action > 1st-person > Video backdrop > Arcade > Rail shooter","desc":"<p><em>Maximum Force</em> is the follow up to Area 51, however, this time around instead of shooting up aliens, the player goes up against a terrorist organization.</p><p>The gameplay is similar to other first-person shooter gun games where the player can use a light gun or a controller to shoot at bad guys popping up from behind objects or coming off from the side of the screen. If a player gets shot by a bad guy, they will loose a bar of health or can also loose health by accidentally shooting innocent bystanders.</p><p>There are also power-ups scattered throughout the stage that can restore health, upgrade their weapons power among many others. There are three levels in all and 35 secret rooms scattered throughout the stages. It also supports a second player simultaneously.</p>"},{"name":"MaxRacer","year":1997,"developer":"PD, Inc.","url":"psx-chd-roms-m/MaxRacer%20%28Japan%29.chd","filesize":257062687,"score":"","genres":"Racing / Driving > 3rd-person (Other) > Arcade > Sci-fi / futuristic","desc":"<p><em>MaxRacer</em> is a futuristic racing game similar to Wipeout. There are three courses and five different racers, each with their own abilities. The game runs on an arcade-style checkpoint system, ending the race if you don't reach each checkpoint quickly enough, and also gives each racer a shield meter to discourage hitting the walls. The game is only one-player, but best times can be saved with a memory card.</p>"},{"name":"Maze Heroes: Meikyuu Densetsu","year":2002,"developer":"Media Entertainment Inc","url":"psx-chd-roms-m/Maze%20Heroes%20-%20Meikyuu%20Densetsu%20%28Japan%29.chd","filesize":18065615,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Isometric > Turn-based > Board game > Fantasy","desc":"<p>This is a world where humans and monsters coexist. Legend has it that there are four treasures in the world that can grant any wish...but no one has ever found them, and most believe that they exist only in legend. One day, two young friends felt a strange power coming from a cave near their village. The power attracts monsters to the area, and they end up trapped in the cave...</p><p><em>Maze Heroes</em> is a hybrid RPG/board game. Players roll a number and move around on the paths, picking up items and encountering monsters and other players in turn-based battles. Players can choose to fight, cast magic, use items, or escape. The game features a single-player story mode as well as a multiplayer battle mode for up to four players.</p>"},{"name":"MDK","year":1997,"developer":"Shiny Entertainment, Inc.","url":"psx-chd-roms-m/MDK%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":348332486,"score":8.2,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Sci-fi / futuristic > Comedy > Regional differences","desc":"<p>In this 3D shoot 'em up,  you play Kurt, and your job is to save the world. Aliens have sent 8 giant fortresses to destroy earth. You run and jump through 6 missions of strange 3D worlds and kill the \"Stream Riders\" with your machine gun arm. Precise platform jumps are part of the challenge.</p><p>Kurt is equipped with a special battle suit with an included parachute and a sniper interface (allowing you to aim precise shooting while standing still) embedded in your helmet. Further weaponry enhancements are available as you progress through the game.</p>"},{"name":"MechWarrior 2: 31st Century Combat","year":1997,"developer":"Activision, Inc.","url":"psx-chd-roms-m/MechWarrior%202%20-%2031st%20Century%20Combat%20-%20Arcade%20Combat%20Edition%20%28Europe%29.chd","filesize":248636178,"score":8.1,"genres":"Action > Simulation > 1st-person > Behind view > Direct control > Mecha / giant robot > Vehicular combat > Sci-fi / futuristic > War > Licensed","desc":"<p>You are the genetically engineered Clan Mechwarrior. The Clans are invading the Inner Sphere. Join either the Wolf Clan or the Jade Falcon Clan as they pursue their own agenda against the Inner Sphere and other Clans. Take your advanced Omnimechs into battle against all comers. Win high warrior ratings (by using less mechs or smaller mechs than needed, completing secondary objectives, etc.) and you'll get chance at a promotion trial where you face superior odds in an arena. If you win, you advance in rank. If you are very successful, you can make it all the way up to Khan, leader of the Clan.</p><p><em>Mechwarrior II</em> was developed in-house by Activision as the successor to their original Mechwarrior. While this time there are no dynamic campaign and mercenary actions, the Clan culture is integrated into the two campaigns. Different clans have different mechs and different rules, even different weapons. You can customize your mechs in order to use less than the \"par\" force in order to get a higher rating. The game features full 3D environments. The addition of NetMech allowed users to fight each other online. </p><p>When 3D cards came along, special versions of the game were created to take advantage of 3D texturing.</p>"},{"name":"Medal of Honor","year":1999,"developer":"DreamWorks Interactive L.L.C.","url":"psx-chd-roms-m/Medal%20of%20Honor%20%28Europe%29.chd","filesize":466961094,"score":8,"genres":"Action > 1st-person > Shooter > Direct control > Europe > Historical events > World War II > Spy / espionage > War > Regional differences","desc":"<p><em>Medal of Honor</em> is the first in the long-running series of World War II shooters, originally created by Steven Spielberg. The play assumes the role of Lt. Patterson who has to complete different tasks in the OSS. The missions vary from securing a small French village from any Nazi forces, to taking out a Heavy armored German rail gun. The player has access to a wide selection of antique weapons such as P38 pistols, M1 Garand carabines, MP40's and more. The goals also include undercover missions. Split-screen multiplayer is supported for two players.</p>"},{"name":"Medal of Honor: Underground","year":2000,"developer":"DreamWorks Interactive L.L.C.","url":"psx-chd-roms-m/Medal%20of%20Honor%20-%20Underground%20%28Europe%29.chd","filesize":487084492,"score":7.2,"genres":"Action > 1st-person > Shooter > Direct control > Europe > Historical events > World War II > Spy / espionage > War > Regional differences","desc":"<p>The game is a prequel to Medal of Honor and it is set in the early stages of WWII. You play as Manon Batiste, who briefed the missions for you in the original Medal of Honor. She is a new member of a small band of French rebels who fight against the tyranny of the Germans.</p><p>There are 7 missions in total, featuring 12 different historical weapons. There are NPCs helping you out by cracking safes and driving. Not all enemies are on foot; expect to face tanks and bikes amongst other things. Enemy AI is responsive and sometimes surprising.</p>"},{"name":"Medarot R","year":1999,"developer":"Natsume Co., Ltd.","url":"psx-chd-roms-m/Medarot%20R%20-%20Parts%20Collection%20%28Japan%29.chd","filesize":66316266,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Real-time > Japanese-style RPG (JRPG) > Direct control > Sci-fi / futuristic","desc":"<p><em>Medarot R</em> is an RPG starring the characters of the <em>Medabots</em> franchise.</p><p>The battles take place on a separate field and they are turn-based. Each Medabot has separate health bars for the legs, arms and the head. Defeating a medabot is done by destroying the head part and each body part can have its own attack that players can use until the part has been destroyed. Up to 3 Medabots can take part in combat and some attacks have a limited ammo.</p><p>While sharing the characters from the Anime series, the story is loosely based on it and the story of the second Game Boy game. The game starts with Ikki waking up on his birthday to find a Medabot in his room - a present from his parents. Without a medal though, the Medabot is useless. After witnessing a customer at the store trying to sell his Medabot to the storekeeper, Ikki is engaged in a battle with the customer and receives a medal from the Phantom Renegade so he could confront the pesky salesman.</p><p>Players will gain experience to level up their medals, as well as win new parts for their Medabots after winning battles. Players can also spend money on parts if they want to.</p><p>A unique feature of the game is the Weather Forecast which is given by a Medabot and which offers hints on what would happen during the day.</p>"},{"name":"MediEvil","year":1998,"developer":"SCE Studio Cambridge","url":"psx-chd-roms-m/MediEvil%20%28Europe%29.chd","filesize":334296386,"score":8,"genres":"Action > Behind view > Puzzle elements > Fantasy > Horror","desc":"<p>In the year 1286, Sir Daniel Fortesque and his soldiers fought against the evil sorcerer Zarok, who raised an army of demons, intending to conquer the world. Sir Daniel was hailed as a hero after the battle, supposedly having been mortally wounded during it, taking Zarok with him. However, it looks like the sorcerer was not defeated in that battle. A hundred years later, he appears again, robbing people of their souls to build an army of undead. Unleashing waves of necromantic energy, Zarok inadvertently revives Sir Daniel as well. Now a skeletal corpse, the knight must correct the mistakes of the past and defeat Zarok once and for all.</p><p><em>MediEvil</em> is an action game in which the player controls Sir Daniel, exploring 3D environments and fighting many enemies that stand on his path towards the ultimate goal. The protagonist starts with his own detachable arm as the basic weapon; however, later he acquires swords and other melee weapons, as well as bows. Money can be collected and spent on items and equipment sold by gargoyle merchants. The hero must also find various rune stones that will allow him to access new areas.</p><p>Each level contains a chalice that can be filled with souls of defeated enemies. Sir Daniel may take a chalice only after having vanquished a sufficient amount of foes. Getting the chalice enables access to the Hall of Heroes, where the protagonist can receive new weapons. Collecting all the chalices in the game unlocks a special ending.</p>"},{"name":"MediEvil II","year":2000,"developer":"SCE Studio Cambridge","url":"psx-chd-roms-m/MediEvil%202%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":324411893,"score":7.5,"genres":"Action > 3rd-person (Other) > Puzzle elements > Horror","desc":"<p>After Sir Daniel Fortesque vanquished the evil sorcerer Zarok in the year 1386, he was finally admitted into the Hall of Heroes, resting in peace. However, five hundred years later Dan unexpectedly awakens in a Victorian museum in Kensington. A ghost named Winston tells him that the sorcerer Lord Palethorn has found Zarok's spell book, reanimating the dead as a result. The pages of the book have been scattered all over London, and it is the task of the valiant knight and his new companions to prevent the mad lord from collecting them and conquering the city.</p><p><em>MediEvil II</em> is an action game similar in concept and basic gameplay to its predecessor. The sequel is somewhat more linear than the first installment, having no world map and hence no possibility to choose the next level. As before, Dan relies on melee and ranged weapons to get rid of the enemies; however, the 19th century setting has replaced bows from the previous game with firearms such as pistols, shotguns, and portable gatling guns. </p><p>A new feature allows the player to equip two weapons on the protagonist and switch between them quickly during combat. Dan also gains the ability to split his own head off, sending it to explore areas he cannot access with his whole body. While in this mode, Dan can solve puzzles and find hidden treasures, but becomes more vulnerable to enemy attacks. The sequel also adds a rotatable camera during exploration.</p>"},{"name":"Mega Man 2","year":1999,"developer":"Capcom Co., Ltd."},{"name":"Mega Man 3","year":1999,"developer":"Capcom Co., Ltd."},{"name":"Mega Man 4","year":1999,"developer":"Capcom Co., Ltd."},{"name":"Mega Man 5","year":1999,"developer":"Capcom Co., Ltd."},{"name":"Mega Man 6","year":1999,"developer":"Capcom Co., Ltd."},{"name":"Mega Man 8: Anniversary Edition","year":1996,"developer":"Capcom Co., Ltd."},{"name":"Mega Man Battle & Chase","year":1997,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-m/Megaman%20-%20Battle%20%26%20Chase%20%28Europe%29.chd","filesize":171819552,"score":7,"genres":"Racing / Driving > Behind view > Anime / Manga > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p>It's robot mayhem at the Battle &amp; Chase tournament! Dr. Wily is trying to take over the tournament with his army of Robot Masters, and now Mega Man has to enter to try and save the races! Choose your racer and head out on the tracks, and if you win, you'll get to steal parts off your opponent's cars, and eventually, you'll race against the mad Dr. Wily himself!</p><p>This game was only released in Japan and Europe. A U.S version can be played via Mega Man X Collection.</p>"},{"name":"Mega Man Legends","year":1997,"developer":"Capcom Production Studio 2","url":"psx-chd-roms-m/Mega%20Man%20Legends%20%28Europe%29.chd","filesize":243956825,"score":6.5,"genres":"Action > Behind view > Anime / Manga > Arcade > Metroidvania > Shooter > Sci-fi / futuristic","desc":"<p>In a world covered almost entirely in water, there exist small islands that hide huge treasures. And where there's treasure, you can find treasure hunters called Diggers, who live for the thrill of the hunt...</p><p>Barrel Casket was once one of the greatest Diggers, but he has now retired. He now cares for his young granddaughter, Roll, whose parents disappeared while on a dig. He had also discovered a strange baby boy in some ruins one time, who he also took under his care alongside Roll. He named the baby boy Rock Voulnut, and Rock grew up to be an expert Digger, sometimes known by his nickname, MegaMan.</p><p>While out exploring one day, Rock, Roll, and Barrel's airship, the Flutter, crash lands on an island named Kattelox. As they explore Kattelox in hopes of fixing their ship, they hear word of a huge treasure, the legendary Mother Lode, that is buried somewhere on the island. Rock, Roll, and Barrel decide to look for the treasure, but at the same time, they're going to get a little competition from a pirate family named the Bonnes...</p><p><em>Mega Man Legends</em> is the first of the <em>Mega Man</em> series to take place in fully explorable 3D, and is paced more like an RPG than the previous stage-to-stage action games. Rock can explore the town and follow the story to find entrances to the underground ruins, where in he will find traps, feral Reaverbots, and large boss robots. Destroying enemies will reward Rock with health, sub-weapon energy, and the power cores of the robots, which people in his world use as currency. By searching through the town and ruins Rock will find items of dubious use and value, and they can be brought back to Roll to be assembled into useful items and upgradable sub-weapons, although not for free. Rock can run while shooting, go into first person mode for aimed shots, and also lock onto an enemy and circle around them to avoid their attacks.</p>"},{"name":"Mega Man Legends 2","year":2000,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-m/Mega%20Man%20Legends%202%20%28Europe%29.chd","filesize":265381764,"score":7.3,"genres":"Action > Role-playing (RPG) > Behind view > Anime / Manga > Arcade > Puzzle elements > Shooter","desc":"<p>Mega Man returns in this, his second 3D outing. The Blue bomber and his teammate, Roll, must journey to a distant island to recover The Mother Lode, an item that no-one really understands, but that they all believe may hold the key to make their dreams come true, and so everyone is after it. </p><p>Unlike past Mega Man titles, <em>Legends 2</em> also adds RPG elements into the mix, allowing players to talk to villagers and the like. Some may help in finding items, others aid the player with important information about The Mother Lode, and other areas on the island.</p>"},{"name":"Mega Man X3","year":1996,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-m/Mega%20Man%20X4%20%28Europe%29.chd","filesize":384545848,"score":7.5,"genres":"Action > Side view > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>A Reploid scientist named Dr. Doppler begins creation of a new city for Reploids, which will bring a new era of peace to the Reploids and humans. But something goes terribly wrong, and now Mavericks have begun to appear everywhere! It's up to X and Zero to find out who is behind this Maverick revolt and bring them down for good!</p><p>For the first time in the series, players can play use X's friend, Zero. However, he is pretty much restricted to only about one third of each level, and has only one life (i.e when he loses all his energy, he is put out of the fight for the rest of the game).</p>"},{"name":"Mega Man X4","year":1997,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-m/Mega%20Man%20X5%20%28Europe%29.chd","filesize":345308061,"score":7.3,"genres":"Action > Side view > Anime / Manga > Arcade > Platform > Shooter > Sci-fi / futuristic","desc":"<p>Mega Man X, the reploid leader of the 17th unit Maverick Hunters, and his best friend Zero have to stop a reploid rebellion. Each of them gets involved in a different way and you can play as either character through the  parallel stories.</p>"},{"name":"Mega Man X5","year":2000,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-m/Mega%20Man%20X6%20%28Europe%29.chd","filesize":370037325,"score":7.2,"genres":"Action > Anime / Manga > Arcade > Platform > Shooter > Sci-fi / futuristic","desc":"<p>Years after the Reploid Wars, all seems peaceful in the world. But peace was not meant to last forever. When the \"Eurasia\" space colony is attacked by an unknown virus, the call goes out! X and Zero are called back into action to help destroy the colony, which is now on a collision course with Earth, and is expected to collide into the planet in only 16 hours! At the same time, Sigma, the archenemy of the Maverick Hunters, shows up again...</p><p><em>Mega Man X5</em> retains the gameplay style of the previous games, adding new features such as advanced Maverick AI, bigger and more challenging stages, and new gameplay elements: ducking and swinging on vines and ropes.</p>"},{"name":"Mega Man X6","year":2001,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-m/Mega%20Man%208%20%28Europe%29.chd","filesize":254344131,"score":6.7,"genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>It's been 3 weeks since the space colony \"Eurasia\" crashed into the Earth. Since then, the Earth has become a deadly, barren wasteland, unfit for humans to inhabit the surface. The humans now live underground, while Reploids begin the task of attempting to recover from the deadly onslaught of the Sigma Virus.</p><p>For the Maverick Hunters, the task is difficult, especially for X. Zero was lost in the attack, and all X has left of him is his Beam Sabre. As the Maverick Hunters assist in the recovery operation, a young Reploid scientist, Gate, discovers a mysterious chip in the wastelands. He immediately sets out on a cause to discover the mysterious \"Nightmare Virus\", and sends 8 assistants out to search for answers. But when Gate's assistants suddenly vanish, the worst is feared: they've gone Maverick.</p><p>X is the only one now who can discover the answers needed to unravel the mystery of this deadly \"Nightmare Virus\", and perhaps find out what it is exactly Gate wants with it.</p><p>The sixth episode of Mega Man X begins...</p>"},{"name":"Megatudo 2096","year":1996,"developer":"General Support","url":"psx-chd-roms-m/Megatudo%202096%20%28Japan%29.chd","filesize":154311676,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Sci-fi / futuristic","desc":"<p>It is the year 2096, and the Megatudo Grand Prix is on! 12 pilots from 12 manufacturers, each with their own unique robot (dubbed Maneuver Wear), will fight to win the tournament.</p><p><em>Megatudo 2096</em> is a 3D fighting game, and features standard story and 2P VS modes. Each character has their own set of normal and special attacks, as well as the ability to dash and weave in different directions.</p>"},{"name":"Meitantei Conan","year":1998,"developer":"","url":"psx-chd-roms-m/Meitantei%20Conan%20%28Japan%29.chd","filesize":269784144,"score":"","genres":"Adventure > Diagonal-down > 2D scrolling > Anime / Manga > Mini-games > Direct control > Detective / mystery > Licensed","desc":"<p><em>Meitantei Conan</em> (名探偵コナン) also known as <em>Detective Conan</em> is an adventure game based on anime and manga with the same title. While this is not the first <em>Meitantei Conan</em> game to be released, it is the first of many such adventure games on consoles. The game contains two original new cases which can be played in any order and contains anime style opening movies for each of the cases. The game uses top-down perspective with artwork showing side view to achieve bird's perspective presentation. In both episodes, the player directly controls Conan which can move up, down, left, or right, and can talk to other characters or interact with current locations and on-screen objects. As the case story progresses, many puzzle oriented mini-games will also become available.</p><p><strong>Doukyuusei Satsujin Jiken (同級生殺人事件) case</strong>  </p><p>Conan, together with Ran Mouri and her father Kogorou Mouri, whom Conan had made a great detective, come to visit a girl student who received a threatening letter. While they were investigating the case, an actual murder has occurred. A seemingly unrelated to the threatening letter schoolgirl has been killed. Conan isn't wasting a minute on letting Kogorou try and solve it and is already looking for clues, questioning suspects, and trying to make the deduction that will uncover the motive behind the murder and the real culprit responsible for it.</p><p><strong>Kotou no Takaramono Jiken (孤島の宝物事件) case</strong>  </p><p>Boys detective club comprised of Conan Edogawa (whose real name is Shinichi Kudo), Ayumi Yoshida, Genta Kojima, and Mitsuhiko Tsuburaya, have come to visit Ayumi's uncle. As they were playing on a yacht at the pier, Ayumi's uncle was paid a visit by a suspicious looking woman that apparently riled him up so he left the kids to play alone for a while. Before long they find themselves riding a huge waves on a rough sea which caused Conan to fall overboard. When he woke up, he found himself on an isolated island with yacht debris covering the shore and his friends missing. This in turn will turn into a quest for a secret treasure, but the island will also test Conan's survival skills.</p>"},{"name":"Meitantei Conan: 3 Nin no Meisuiri","year":1998,"developer":"KID Corp.","url":"psx-chd-roms-m/Meitantei%20Conan%20-%203-nin%20no%20Meisuiri%20%28Japan%29.chd","filesize":376527656,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Japanese-style adventure > Detective / mystery > Licensed","desc":"<p>Written by the same scenario writer who wrote for the animated TV series, this story of Detective Conan brings three sharp-witted characters from the franchise through three separate cases together. Scenario 1 focuses on Ai Haibara, an adult shrank to the size of an elementary school student by the same drug as Conan. Scenario 2 focuses on Heiji Hattori, the great detective from the west who is also aware of Conan's true identity. And scenario 3 focuses on Conan Edogawa, whose real name is Shin'ichi Kudou. All three separate cases have one thing in common, though... the men in black organization who was behind Conan's mysterious transformation. The gameplay is that of a typical visual novel with adventure elements such as searching the scenes for clues, questioning suspects and uncover mysteries during the investigation.</p>"},{"name":"Meitantei Conan: Saikou no Partner","year":2002,"developer":"","url":"psx-chd-roms-m/Meitantei%20Conan%20-%20Saikou%20no%20Partner%20%28Japan%29.chd","filesize":431841338,"score":"","genres":"Adventure > 1st-person > 3rd-person (Other) > Anime / Manga > Detective / mystery","desc":"<p><em>Saikou no Partner</em> (最高の相棒) is the second Detective Conan game for PlayStation console. The game features three separate episodes (third one becomes available after clearing the first two which can be played in any order) where you play as Shinichi Kudou (aka Conan Edogawa) trying to uncover the mystery and use your deductive skills and reasoning to point to the perpetrator. The game features full voice acting and characters are moderately animated during dialogues, and all that is aided with actual anime cutscenes which feels like watching an actual episode from the series, only this time doing a bit more than just watching. Each of the episode also lets you select whether the subtitles should use kanji or only hiragana.</p><p>The basic gameplay boils down to:* Dialogues -- During key dialogues with other characters, text will turn blue when you have a chance to gain a clue. By pressing the right button, you can perform so-called \"detective action\" which will give you more information about your point of interest and provide you with a clue in your investigation. This will effectively raise your AP percentage bar which displays points of achievement for the current scenario. In turn, it will add reasoning chips to Reasoning Mode in the menu.* Movement -- Conan moves in 3rd-person perspective. You can go to check various locations in search for clues with mini-map showing your current location.* Examining -- By clicking next to the objects of interest, they will appear on the screen where you can use magnifying glass to look at suspicious elements in more detail.* Mini-games -- By successfully clearing mini-games you can obtain clues that will aid you in your investigation.* Reasoning -- With collected Reasoning Chips awarded by obtaining various clues during your investigation, you can try and put it all together and present a final solution to the case.</p><p>The story episodes are:* Rou Tejinashi to Tramp no Nazo (老手品師とトランプの謎) -- Accompanied by Conan's old friend who knows his true identity, the inventor Hiroshi Agasa, Conan and his classmates, Ayumi, Mitsuhiko and Genta, as well as Ai Haibara, the woman in same situation as Conan, arrive at the amusement park in order to see twin baby-pandas, just open to the public. While watching for their turn, they encounter an incident at the magician's performance where after a mysterious phone call, the cards fall out of magician's and into Conan's hands. Whatever rattled his cage and whoever was the person on the other side of the line is not going to go unnoticed and unquestioned by Conan and his league of junior school detectives.</p><ul><li><p>Kamen Kishi Satsujinjiken (仮面騎士殺人事件) -- Ran, Sonoko, and Conan arrive at the opening of a new theater. The musical program was playing a love story. However, second act never opened. Instead, a scream from backstage flew through the air. The stage actor was murdered, with a knife, no less. Conan is yet again to put his mind to the task and unmask the killer.</p></li><li><p>Saikou no Partner (最高の相棒) -- Participants of a TV show called \"Reasoning Colosseum: Snow Country Steam Murder Case\", along with the staff, were sharing express train to Aomori with none other than renowned private investigator Mouri Kogorou and his daughter (Shinichi's girlfriend) Ran. But on the location of the show, the actual murder was done on board the train. Now it's up to Mouri to use his reasoning and find out who the culprit is. This episode becomes available only after clearing the other two.</p></li></ul>"},{"name":"Meitantei Conan: Trick Trick - Vol.1","year":2003,"developer":"KID Corp.","url":"psx-chd-roms-m/Meitantei%20Conan%20-%20Trick%20Trick%20Vol.%201%20%28Japan%29.chd","filesize":54068515,"score":"","genres":"Puzzle > Fixed / flip-screen > Licensed","desc":"<p>While <em>Trick Trick</em> is a game featuring Detective Conan, it does not have any new storyline nor concrete scenario case to solve. Instead, the game features a 100 mini-game problems to solve varying from cryptography puzzles to closed-room murder mysteries. There are practice and detective modes available and solving a case is rated by the time it took to solve it.</p>"},{"name":"MeltyLancer: Re-inforce (Disk 1)","year":1997,"developer":"TENKY Co. Ltd.","url":"psx-chd-roms-m/MeltyLancer%20-%20Re-inforce%20%28Japan%29%20%28Disc%201%29.chd","filesize":434984504,"score":"","genres":"Role-playing (RPG) > Strategy > 1st-person > Diagonal-down > Fixed / flip-screen > Isometric > Turn-based > Dating simulation > Tactical RPG > Sci-fi / futuristic > Crime > Romance","desc":"<p><em>MeltyLancer: Re-inforce</em> is a sequel to MeltyLancer: Ginga Shoujo Keisatsu 2086 and takes place two years after, meaning in 2088. The core gameplay consists of isometric turn-based combat on one hand, and on visual novel and dating simulation style interaction with other characters. The player plays a young rookie transferred to a GPO (Galactic Police Organization) unit under Sylvie, the heroine from the previous game. The goal is to learn from the best and uphold the law.</p>"},{"name":"MeltyLancer: Re-inforce (Disk 2)","year":1997,"developer":"TENKY Co. Ltd.","url":"psx-chd-roms-m/MeltyLancer%20-%20Re-inforce%20%28Japan%29%20%28Disc%202%29.chd","filesize":474725128,"score":"","genres":"Role-playing (RPG) > Strategy > 1st-person > Diagonal-down > Fixed / flip-screen > Isometric > Turn-based > Dating simulation > Tactical RPG > Sci-fi / futuristic > Crime > Romance","desc":"<p><em>MeltyLancer: Re-inforce</em> is a sequel to MeltyLancer: Ginga Shoujo Keisatsu 2086 and takes place two years after, meaning in 2088. The core gameplay consists of isometric turn-based combat on one hand, and on visual novel and dating simulation style interaction with other characters. The player plays a young rookie transferred to a GPO (Galactic Police Organization) unit under Sylvie, the heroine from the previous game. The goal is to learn from the best and uphold the law.</p>"},{"name":"Memorial Series: Sunsoft Vol. 1","year":2001,"developer":"Sunsoft","url":"psx-chd-roms-m/Memorial%20Series%20-%20Sunsoft%20Vol.%201%20%28Japan%29.chd","filesize":5872130,"score":"","genres":"Compilation","desc":"<p><em>Memorial Series: Sunsoft Vol. 1</em> is a compilation featuring the following games:</p><ul><li>Ikki </li><li>Super Arabian</li></ul>"},{"name":"Memorial Series: Sunsoft Vol. 2","year":2001,"developer":"Sunsoft","url":"psx-chd-roms-m/Memorial%20Series%20-%20Sunsoft%20Vol.%202%20%28Japan%29.chd","filesize":6875106,"score":"","genres":"Compilation","desc":"<p><em>Memorial Series: Sunsoft Vol. 2</em> is a compilation featuring the following games:</p><ul><li>Atlantis no Nazo</li><li>Route-16 Turbo</li></ul>"},{"name":"Memorial Series: Sunsoft Vol. 3","year":2001,"developer":"Sunsoft","url":"psx-chd-roms-m/Memorial%20Series%20-%20Sunsoft%20Vol.%203%20%28Japan%29.chd","filesize":7561260,"score":"","genres":"Compilation","desc":"<p><em>Memorial Series: Sunsoft Vol. 3</em> is a compilation featuring the following games:</p><ul><li>Kanshakudama Nage Kantarō no Tōkaidō Gojūsan Tsugi</li><li>The Wing of Madoola</li></ul>"},{"name":"Memorial Series: Sunsoft Vol. 4","year":2002,"developer":"Sunsoft","url":"psx-chd-roms-m/Memorial%20Series%20-%20Sunsoft%20Vol.%204%20%28Japan%29.chd","filesize":9091787,"score":"","genres":"Compilation","desc":"<p><em>Memorial Series: Sunsoft Vol. 4</em> is a compilation featuring the following games:</p><ul><li>Blaster Master</li><li>Ripple Island</li></ul>"},{"name":"Memorial Series: Sunsoft Vol. 5","year":2002,"developer":"Sunsoft","url":"psx-chd-roms-m/Memorial%20Series%20-%20Sunsoft%20Vol.%205%20%28Japan%29.chd","filesize":9589350,"score":"","genres":"Compilation","desc":"<p><em>Memorial Series: Sunsoft Vol. 5</em> is a compilation featuring the following games:</p><ul><li>Journey to Silius</li><li>Ufouria: The Saga</li></ul>"},{"name":"Memorial Series: Sunsoft Vol. 6","year":2002,"developer":"Sunsoft"},{"name":"Memories Off","year":1999,"developer":"KID Corp."},{"name":"Memories Off 2nd (Disk 1)","year":2001,"developer":"KID Corp.","url":"psx-chd-roms-m/Memories%20Off%202nd%20%28Japan%29%20%28Disc%201%29.chd","filesize":481864373,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>The second installation in the <em>Memories Off</em> visual novel dating simulation series featuring whole new characters with similar gameplay.</p><p>The player plays as Ken Inami, a 17 year old junior high-school student. Ken has his dreams and aspirations and would want to go to a film school. His girlfriend, Hotaru Shirakawa, is more interested in music and would like to go to a music school. They've been dating for a while, and while they thought it may last forever, their relationship hit a bump and is hanging by a thread. As Ken, you can try and save your relationship, or break up and chase after another girl. Game features many different endings, depending on the girl you end up with... or if it's the bad ending, the girl you break up in the end.</p><p>The game consists of reading text and dialogues over the background images, similar to other visual novels, with occasional choices that may branch the story. For replays, gave features fast-forward option that lets you skipped through previously read events.</p>"},{"name":"Memories Off 2nd (Disk 2)","year":2001,"developer":"KID Corp.","url":"psx-chd-roms-m/Memories%20Off%202nd%20%28Japan%29%20%28Disc%202%29.chd","filesize":520360399,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>The second installation in the <em>Memories Off</em> visual novel dating simulation series featuring whole new characters with similar gameplay.</p><p>The player plays as Ken Inami, a 17 year old junior high-school student. Ken has his dreams and aspirations and would want to go to a film school. His girlfriend, Hotaru Shirakawa, is more interested in music and would like to go to a music school. They've been dating for a while, and while they thought it may last forever, their relationship hit a bump and is hanging by a thread. As Ken, you can try and save your relationship, or break up and chase after another girl. Game features many different endings, depending on the girl you end up with... or if it's the bad ending, the girl you break up in the end.</p><p>The game consists of reading text and dialogues over the background images, similar to other visual novels, with occasional choices that may branch the story. For replays, gave features fast-forward option that lets you skipped through previously read events.</p>"},{"name":"Memories Off 2nd (Disk 3)","year":2001,"developer":"KID Corp.","url":"psx-chd-roms-m/Memories%20Off%202nd%20%28Japan%29%20%28Disc%203%29%20%28Making%20Disc%29%20%28Shokai%20Genteiban%29.chd","filesize":486212341,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>The second installation in the <em>Memories Off</em> visual novel dating simulation series featuring whole new characters with similar gameplay.</p><p>The player plays as Ken Inami, a 17 year old junior high-school student. Ken has his dreams and aspirations and would want to go to a film school. His girlfriend, Hotaru Shirakawa, is more interested in music and would like to go to a music school. They've been dating for a while, and while they thought it may last forever, their relationship hit a bump and is hanging by a thread. As Ken, you can try and save your relationship, or break up and chase after another girl. Game features many different endings, depending on the girl you end up with... or if it's the bad ending, the girl you break up in the end.</p><p>The game consists of reading text and dialogues over the background images, similar to other visual novels, with occasional choices that may branch the story. For replays, gave features fast-forward option that lets you skipped through previously read events.</p>"},{"name":"Memories Off 2nd (Shokai Genteiban) (Disk 1)","year":2001,"developer":"KID Corp.","url":"psx-chd-roms-m/Memories%20Off%202nd%20%28Japan%29%20%28Disc%201%29%20%28Shokai%20Genteiban%29.chd","filesize":481864377,"score":"","genres":"Special edition > Physical extras","desc":"<p>First Print Limited Edition version of <em>Memories Off 2nd</em> contains:</p><ul><li>Memories Off 2nd game</li><li>Picture label package</li><li>Making-of disc</li><li>3 promotion trading cards</li></ul>"},{"name":"Memories Off 2nd (Shokai Genteiban) (Disk 2)","year":2001,"developer":"KID Corp.","url":"psx-chd-roms-m/Memories%20Off%202nd%20%28Japan%29%20%28Disc%202%29%20%28Shokai%20Genteiban%29.chd","filesize":520360398,"score":"","genres":"Special edition > Physical extras","desc":"<p>First Print Limited Edition version of <em>Memories Off 2nd</em> contains:</p><ul><li>Memories Off 2nd game</li><li>Picture label package</li><li>Making-of disc</li><li>3 promotion trading cards</li></ul>"},{"name":"Men in Black: The Game","year":1998,"developer":"Gigawatt Studios","url":"psx-chd-roms-m/Men%20in%20Black%20-%20The%20Game%20%28Europe%29.chd","filesize":272221908,"score":6.1,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Men in Black: The Game</em> loosely adapts the successful 1997 film into an action/adventure game akin to Resident Evil, with 3D characters moving through pre-rendered backgrounds with fixed camera perspectives.</p><p>In an introductory level, players control NYPD cop James Edwards (as played by Will Smith in the film) who investigates a possible robbery in a New York apartment building. After finding out an alien creature is behind it, he is recruited into the Men in Black, a secret organization that supervises alien life on Earth. Now known as Agent J, he, along with his colleagues K and L (Tommy Lee Jones' and Linda Fiorentino's film character, respectively), protect the Earth from malevolent aliens and prevent the public from learning about the existence of extraterrestrial life.</p><p>The main part of the game begins at MIB headquarters. Here, players are briefed on the next mission in the briefing room and can change their weapon and do target practice at the shooting gallery. Several different weapons are available, from realistic firearms to the futuristic guns seen in the film, including the small but powerful Noisy Cricket. Before a mission, players can choose to play as J, K or L. The three have different fighting styles and their dialogue also differs. The game includes three main missions, which send the agents to the Arctic, the Amazon and a remote island. Stylized comic-style cutscenes advance the story between levels.</p><p>Missions involve exploring the surroundings, combat with aliens (either hand-to-hand or with guns) and puzzle-solving: finding keycards to open doors, restarting the computer system, or distracting a dog for a way to pass. Ammunition is limited and thus should be conserved, but can be refilled from the supplies of fallen enemies or occasional caches found in the levels.</p>"},{"name":"Men in Black: The Series - Crashdown","year":2001,"developer":"Runecraft Ltd.","url":"psx-chd-roms-m/Men%20in%20Black%20-%20The%20Series%20-%20Crashdown%20%28Europe%29.chd","filesize":428534772,"score":"","genres":"Action > 1st-person > Puzzle elements > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Men in Black: Crashdown</em> is a first-person shooter based on the <em>Men in Black</em> animated series and aimed at younger teenagers. Players guide Agent Jay or Kay through 26 missions to rid Manhattan of the scum of the universe. Most of the focus is on blasting the fifteen alien enemies, but there are also minor puzzle-solving elements. The basic level goals are shown at the beginning of missions. The agents have access to 25 different weapons and gadgets to attack the aliens and solve problems.</p>"},{"name":"MerbyBabyStory","year":1999,"developer":"PONOS"},{"name":"Meremanoid","year":1999,"developer":"Shout!Designworks Co., Ltd.","url":"psx-chd-roms-m/Meremanoid%20%28Japan%29.chd","filesize":190435192,"score":"","genres":"Role-playing (RPG) > Behind view > Anime / Manga > Direct control > Menu structures > Fantasy","desc":"<p><em>Meremanoid</em> is a turn-based RPG in which orphaned merperson Arden journeys across the underwater world of Meremanoia. The player swims through environments in full 3D, pressing X to move forward, L1 and R1 to turn, and the directional buttons to move up and down on the Y axis.</p>"},{"name":"Mermaid no Kisetsu (Disk 1)","year":2001,"developer":"Netvillage Co., Ltd.","url":"psx-chd-roms-m/Mermaid%20no%20Kisetsu%20%28Japan%29%20%28Disc%201%29.chd","filesize":419398470,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p><em>Mermaid no Kisetsu</em> is a PlayStation port of the PC hentai visual novel with stripped adult content. The game follows Masato Takahata, a high-school sophomore, living alone, going to school classes and working a part-time at Aqua Rouge cafe. The setting is in the near future with technological advancements, but the living style didn't change that much. One day you find a strange note with an address of a home page. You check it out only to see the ominous warning text. While you're not trying to figure out the mystery behind it, you will traverse town meeting various people, mostly girls and women, with whom you'll work on relationship to become friends with, or something more.</p><p>The core of the game is a romance visual novel with dialogues and occasional reply choices with full voice-acting for all the heroines as well as other side-characters. An additional gameplay feature is that when you're home in your room, you can check the mysterious home page, as well as home pages of the girls you meet in town, reading info about them, checking their diaries and posts. The game progresses through the days, always showing the day of week and the time of day, with ability to select your next location on the town map to progress the time, but you can only select to visit the places where other characters are, even if you avoid talking to them.</p>"},{"name":"Mermaid no Kisetsu (Disk 2)","year":2001,"developer":"Netvillage Co., Ltd.","url":"psx-chd-roms-m/Mermaid%20no%20Kisetsu%20%28Japan%29%20%28Disc%202%29.chd","filesize":421003102,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p><em>Mermaid no Kisetsu</em> is a PlayStation port of the PC hentai visual novel with stripped adult content. The game follows Masato Takahata, a high-school sophomore, living alone, going to school classes and working a part-time at Aqua Rouge cafe. The setting is in the near future with technological advancements, but the living style didn't change that much. One day you find a strange note with an address of a home page. You check it out only to see the ominous warning text. While you're not trying to figure out the mystery behind it, you will traverse town meeting various people, mostly girls and women, with whom you'll work on relationship to become friends with, or something more.</p><p>The core of the game is a romance visual novel with dialogues and occasional reply choices with full voice-acting for all the heroines as well as other side-characters. An additional gameplay feature is that when you're home in your room, you can check the mysterious home page, as well as home pages of the girls you meet in town, reading info about them, checking their diaries and posts. The game progresses through the days, always showing the day of week and the time of day, with ability to select your next location on the town map to progress the time, but you can only select to visit the places where other characters are, even if you avoid talking to them.</p>"},{"name":"Mermaid no Kisetsu (Disk 3)","year":2001,"developer":"Netvillage Co., Ltd.","url":"psx-chd-roms-m/Mermaid%20no%20Kisetsu%20%28Japan%29%20%28Disc%203%29.chd","filesize":349468370,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p><em>Mermaid no Kisetsu</em> is a PlayStation port of the PC hentai visual novel with stripped adult content. The game follows Masato Takahata, a high-school sophomore, living alone, going to school classes and working a part-time at Aqua Rouge cafe. The setting is in the near future with technological advancements, but the living style didn't change that much. One day you find a strange note with an address of a home page. You check it out only to see the ominous warning text. While you're not trying to figure out the mystery behind it, you will traverse town meeting various people, mostly girls and women, with whom you'll work on relationship to become friends with, or something more.</p><p>The core of the game is a romance visual novel with dialogues and occasional reply choices with full voice-acting for all the heroines as well as other side-characters. An additional gameplay feature is that when you're home in your room, you can check the mysterious home page, as well as home pages of the girls you meet in town, reading info about them, checking their diaries and posts. The game progresses through the days, always showing the day of week and the time of day, with ability to select your next location on the town map to progress the time, but you can only select to visit the places where other characters are, even if you avoid talking to them.</p>"},{"name":"Mermaid no Kisetsu: Curtain Call (Disk 1)","year":2002,"developer":"Netvillage Co., Ltd.","url":"psx-chd-roms-m/Mermaid%20no%20Kisetsu%20-%20Curtain%20Call%20%28Japan%29%20%28Disc%201%29.chd","filesize":203422928,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p><em>Curtain Call</em> is a fan disc for the Mermaid no Kisetsu romance adventure visual novel. This fan disc includes many sub-scenarios as well as a prelude scenario that tells the story before the actual game happening, one week earlier to the events of the main game. In addition this game includes several voice dramas, a DJ mode with the main characters on air radio, a conversation mode where you can communicate with one of the four heroines, and a quiz mode with 900 questions related to the game in total. There is also a lot of bonus content including illustrations from various CG artists that worked on the game, CG modes showing event scenes from the main game, a bonus movie and scrollable artwork.</p>"},{"name":"Mermaid no Kisetsu: Curtain Call (Disk 2)","year":2002,"developer":"Netvillage Co., Ltd.","url":"psx-chd-roms-m/Mermaid%20no%20Kisetsu%20-%20Curtain%20Call%20%28Japan%29%20%28Disc%202%29.chd","filesize":143735764,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p><em>Curtain Call</em> is a fan disc for the Mermaid no Kisetsu romance adventure visual novel. This fan disc includes many sub-scenarios as well as a prelude scenario that tells the story before the actual game happening, one week earlier to the events of the main game. In addition this game includes several voice dramas, a DJ mode with the main characters on air radio, a conversation mode where you can communicate with one of the four heroines, and a quiz mode with 900 questions related to the game in total. There is also a lot of bonus content including illustrations from various CG artists that worked on the game, CG modes showing event scenes from the main game, a bonus movie and scrollable artwork.</p>"},{"name":"Meru Purana","year":1996,"developer":"Gust Co., Ltd.","url":"psx-chd-roms-m/Meru%20Purana%20%28Japan%29.chd","filesize":325012414,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Tactical RPG > Asia > Medieval","desc":"<p>Meru Purana is a simulation game set in Central Asia and based on Indian mythology, making it unique among games in its genre. It also features an epic story of 108 warriors vying for dominance of Mt. Mael and an expansive plain. With a refined system and simplified command groups, this title delivers an extremely player-friendly game environment! And its background music features famous works that are somehow melancholy. What will the warriors behold at the end of their seemingly eternal battle?</p>"},{"name":"Messenger, The","year":2000,"developer":"Arxel Tribe d.o.o."},{"name":"META-PH-LIST µ.X.2297","year":1997,"developer":"A.D.M Co."},{"name":"Metal Gear Solid (Disk 1)","year":1999,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-m/Metal%20Gear%20Solid%20%28Europe%29%20%28Disc%201%29.chd","filesize":402048764,"score":7.8,"genres":"Action > 1st-person > 3rd-person (Other) > Top-down > Shooter > Stealth > North America > Spy / espionage","desc":"<p>This special version of Metal Gear Solid adds first-person view, a level of difficulty for newcomers, bettered artificial intelligence for some enemies (including bosses) on higher difficulty settings, and, on the third disc Metal Gear Solid: VR Missions.</p>"},{"name":"Metal Gear Solid (Disk 1)","year":1999,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-m/Metal%20Gear%20Solid%20%28Europe%29%20%28Disc%202%29.chd","filesize":371280113,"score":7.8,"genres":"Action > 1st-person > 3rd-person (Other) > Top-down > Shooter > Stealth > North America > Spy / espionage","desc":"<p>This special version of Metal Gear Solid adds first-person view, a level of difficulty for newcomers, bettered artificial intelligence for some enemies (including bosses) on higher difficulty settings, and, on the third disc Metal Gear Solid: VR Missions.</p>"},{"name":"Metal Gear Solid: Special Missions","year":2000,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-m/Metal%20Gear%20Solid%20-%20Special%20Missions%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":309977674,"score":7.4,"genres":"DLC / Add-on > Story / mission","desc":"<p>Semi sequel to Metal Gear Solid for the Playstation, this \"add-on\" disk includes 300 missions, ranging from missions that are more advanced levels of the training missions in MGS, to solving mysteries.</p>"},{"name":"Metal Gear Solid: The Essential Collection","year":2008,"developer":""},{"name":"Metal Gear Solid: VR Missions","year":1999,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-m/Metal%20Gear%20Solid%20-%20VR%20Missions%20%28USA%29.chd","filesize":306498123,"score":7.4,"genres":"DLC / Add-on > Story / mission","desc":"<p>Semi sequel to Metal Gear Solid for the Playstation, this \"add-on\" disk includes 300 missions, ranging from missions that are more advanced levels of the training missions in MGS, to solving mysteries.</p>"},{"name":"Metal Gear: 20th Anniversary","year":2007,"developer":"Konami Computer Entertainment Japan, Inc."},{"name":"Metal Slug X","year":2001,"developer":"SNK Corporation","url":"psx-chd-roms-m/Metal%20Slug%20X%20%28Europe%29.chd","filesize":60203759,"score":8.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Platform > Shooter","desc":"<p><em>Metal Slug X</em> is an enhanced version of Metal Slug 2: Super Vehicle - 001/II. The main differences to the original release include:</p><ul><li>Additional weapons: Stones, Iron Lizard, Enemy Chaser, Super Grenade, and Drop Shot.</li><li>Additional power-ups, items, and prisoners in most of the levels.</li><li>Additional times of the day: stages can take place at twilight, sunset, or dusk.</li><li>Some of the locations and vehicles in the game have been altered.</li><li>Increased enemy count. Some of the enemies' placement has been changed.</li><li>Many weapons have a stronger explosive force. Explosions yield more unexpected results.</li><li>The soundtrack has been re-mixed.</li></ul>"},{"name":"Metal Slug: Super Vehicle - 001","year":1997,"developer":"Nazca Corporation","url":"psx-chd-roms-m/Metal%20Slug%20X%20-%20Super%20Vehicle-001%20%28Japan%29.chd","filesize":183932471,"score":8.2,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Tank > War","desc":"<p><em>Metal Slug</em>, originally released on the Neo Geo, is a side-scrolling shoot'em'up.</p><p>The player(s) takes the role of a soldier (or two) and fights a gigantic army. Every level consists of running forward blasting anything that moves, while collecting power-ups along the way (there's also a wide selection of weaponry in the game). In the end of each level the player goes up against one gigantic boss. </p><p>The PlayStation port introduces some extra features: there is a combat school where the player may fight with other players for the best time on each level and an art gallery.</p>"},{"name":"Michael Owen's World League Soccer '99","year":1998,"developer":"Silicon Dreams Studio Ltd.","url":"psx-chd-roms-m/Michael%20Owen%27s%20World%20League%20Soccer%20%2799%20%28Europe%29%20%28En%2CFr%2CIt%29.chd","filesize":334170683,"score":6.3,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p>Michael Owen was England's youngest ever goalscorer and biggest hero, until superseded on both counts by Wayne Rooney. He put his name to a game balanced between the action of an arcade game and the realism of a simulation.</p><p>The game incorporates the leading international teams along with some 200 domestic teams from Europe, Japan, and USA. Each player's abilities are rated out of 10 in several key areas. Statistics including shots (in total and on target), fouls, and possession are recorded. Set pieces are controlled by moving a line to direct the ball. While trying to play a pass, the player can switch control to the footballer hoping to receive the ball.</p><p>The player can choose from competition structures including leagues and Cup championships, a practice mode, and single friendly matches, with the World Cup perhaps as the ultimate prize. It is also possible for the player to design own competitions.</p>"},{"name":"Michael Schumacher Racing World Kart 2002","year":2002,"developer":"TerraTools GmbH","url":"psx-chd-roms-m/Michael%20Schumacher%20Racing%20World%20Kart%202002%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":225168870,"score":7.2,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>One of the few Kart games in the market.</p><p>Race through the beginnings of Michael Schumacher's career as a kart driver.</p><p>Advance through the different race classes and difficulty levels and win the world-wide championship on the Internet.</p><p>With 16 different tracks, three play modes and multiplayer options.</p><p>More features are real outdoor and indoor tracks, Ghost Kart and three Kart classes (FUN, ICA, FSA).</p><p>The game also includes a tutorial for first steps.</p>"},{"name":"Michelin Rally Masters: Race of Champions","year":2000,"developer":"Digital Illusions CE AB","url":"psx-chd-roms-m/Michelin%20Rally%20Masters%20-%20Race%20of%20Champions%20%28Europe%29%20%28En%2CDe%2CSv%29.chd","filesize":372061991,"score":7.4,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Off-roading > Licensed","desc":"<p>This is the OFFICIAL game of the real Race of Champions! Take the various authentic ROC cars (22 in all) through different tracks on head-to-head SuperSpecial challenge modes or traditional rally stages as you speed and slide through mud, gravel, snow, and more. Five levels of difficulty will let you learn at your own pace. Multiple game modes (RoC, Challenge Cup, Challenge Trophy, time attack, single race, single stage) keep you challenged. Run races online with other players through dedicated servers or setup your own.</p>"},{"name":"Mickey Mania","year":1996,"developer":"Traveller's Tales (UK) Ltd."},{"name":"Micro Machines V3","year":1997,"developer":"Toolbox Design Ltd.","url":"psx-chd-roms-m/Micro%20Machines%20V3%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28EDC%29.chd","filesize":225493205,"score":7.5,"genres":"Action > Racing / Driving > Top-down > Arcade > Licensed","desc":"<p>Micro Machines are now able to explore the third dimension. Gameplay still stays the same, but the whole new graphics now look more realistic. Also a lot of new multiplayer options were added.</p>"},{"name":"Midnight Run: Road Fighter 2","year":1997,"developer":"Konami Co., Ltd.","url":"psx-chd-roms-m/Midnight%20Run%20-%20Road%20Fighter%202%20%28Europe%29.chd","filesize":41003274,"score":"","genres":"Racing / Driving > 1st-person > Behind view","desc":"<p><em>Midnight Run: Road Fighter 2</em> is an arcade racer and a modern 3D sequel to Road Fighter.</p><p>Players can choose between four different colored cars and three different courses. The courses are the sunset trial (easy), the starlight heat (medium) or the midnight run (hard). You race on a single looped track against 3 rival cars competing for the first place. While racing the player must also reach check points for time extensions and pass as many cars as possible.</p>"},{"name":"Mighty Hits","year":1996,"developer":"Altron Corporation","url":"psx-chd-roms-m/Mighty%20Hits%20%28Japan%29.chd","filesize":136956073,"score":"","genres":"Action > 1st-person > Arcade > Shooter > Direct control > Western","desc":"<p><em>Mighty Hits</em> is a shooting gallery game and the gameplay and stages are very similar to Point Blank in theme and presentation. The game has a cartoony wild west theme throughout the cut scenes and menu screens.</p><p>One or two players compete in a series of mini games, which last about 20 or 30 seconds each. The rules of the mini games are displayed before each round. In general players have complete objectives and puzzles by shooting at targets. After each round a results screen shows if the objectives were completed or failed. Failing a round and the player loses a life feather, lose all feathers and the game is over.</p><p>There are 3 courses to select from, represented by a blue, green and yellow tin can. There is Easy (6 mini-games), Medium (9 mini-games) and Hard (15 mini-games) and completing hard mode unlocks a black tin can for Very Hard with 18 mini-games. The game is played in sets of 3 stages, the player has to shoot 3 cards to select the stages. The cards are quickly flipping randomly through mini-games. After 3 stages the player draws a bonus card and moves onto the next 3 stages. A bonus card might contain \"2 stage select\" where 2 of the stage cards will flip more slowly allowing the player to purposefully select a stage.</p><p>There are many mini games, including shooting away parts to complete a doll, a Three Shell type game, shoot ice to free a penguin, shoot colored bells to recreate a melody, throwing balls into cups, shoot the object in the room that has changed, and in general shooting at various targets like fish, bees, lights, eggs, floating lanterns, toppling pictures frames and other targets.</p>"},{"name":"Mighty Hits Special","year":1999,"developer":"Altron Corporation","url":"psx-chd-roms-m/Mighty%20Hits%20Special%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":138462655,"score":"","genres":"Action > 1st-person > Arcade > Shooter > Western","desc":"<p><em>Mighty Hits Special</em> is a shooting gallery game compatible with the Konami Justifier, and the gameplay and stages are very similar to Point Blank in theme and presentation. The game has a cartoony wild west theme throughout the cut scenes and menu screens. It is a follow-up to Mighty Hits although it is in large part exactly the same game.</p><p>One or two players compete in a series of mini games, which last about 20 or 30 seconds each. The rules of the mini games are displayed before each round. In general players have complete objectives and puzzles by shooting at targets. After each round a results screen shows if the objectives were completed or failed. Failing a round and the player loses a life feather, lose all feathers and the game is over.</p><p>There are 3 courses to select from, represented by a blue, green and yellow tin can. There is Easy (6 mini-games), Medium (9 mini-games) and Hard (15 mini-games) and completing hard mode unlocks a black tin can for Very Hard with 18 mini-games. The game is playing in sets of 3 stages, the player has to shoot 3 cards to select the stages. The cards are quickly flipping randomly through mini-games. After 3 stages the player draws a bonus card and moves onto the next 3 stages. A bonus card might contain \"2 stage select\" where 2 of the stage cards will flip more slowly allowing the player to purposefully select a stage.</p><p>There are many mini games, including shooting away parts to complete a doll, a Three Shell type game, shoot ice to free a penguin, shoot colored bells to recreate a melody, throwing balls into cups, shoot the object in the room that has changed, and in general shooting at various targets like fish, trains, bees, lights, eggs, floating lanterns, toppling pictures frames and other targets.</p>"},{"name":"Mikagura Shoujo Tanteidan (Disk 1)","year":1998,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-m/Mikagura%20Shoujo%20Tanteidan%20%28Japan%29%20%28Disc%201%29%20%28Honpen%20Disc%20Ichi%29.chd","filesize":432165299,"score":"","genres":"Adventure > 1st-person > Diagonal-down > Fixed / flip-screen > Anime / Manga > Visual novel > Detective / mystery","desc":"<p>Mikagura Shoujo Tanteidan makes use of an inference trigger system in which players have to detect points that need attention or are contradictory during conversations and look for suspicious spots in crime scenes to find out the truth.<br>Have fun playing detective with the Mikagura girl detectives today!</p>"},{"name":"Mikagura Shoujo Tanteidan (Disk 2)","year":1998,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-m/Mikagura%20Shoujo%20Tanteidan%20%28Japan%29%20%28Disc%202%29%20%28Honpen%20Disc%20Ni%29.chd","filesize":446640874,"score":"","genres":"Adventure > 1st-person > Diagonal-down > Fixed / flip-screen > Anime / Manga > Visual novel > Detective / mystery","desc":"<p>Mikagura Shoujo Tanteidan makes use of an inference trigger system in which players have to detect points that need attention or are contradictory during conversations and look for suspicious spots in crime scenes to find out the truth.<br>Have fun playing detective with the Mikagura girl detectives today!</p>"},{"name":"Mikagura Shoujo Tanteidan (Disk 3)","year":1998,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-m/Mikagura%20Shoujo%20Tanteidan%20%28Japan%29%20%28Disc%203%29%20%28Intermission%20Disc%29.chd","filesize":331843148,"score":"","genres":"Adventure > 1st-person > Diagonal-down > Fixed / flip-screen > Anime / Manga > Visual novel > Detective / mystery","desc":"<p>Mikagura Shoujo Tanteidan makes use of an inference trigger system in which players have to detect points that need attention or are contradictory during conversations and look for suspicious spots in crime scenes to find out the truth.<br>Have fun playing detective with the Mikagura girl detectives today!</p>"},{"name":"Mikagura Shoujo Tanteidan (Disk 4)","year":1998,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-m/Mikagura%20Shoujo%20Tanteidan%20%28Japan%29%20%28Disc%204%29%20%28Special%20Disc%29.chd","filesize":508648422,"score":"","genres":"Adventure > 1st-person > Diagonal-down > Fixed / flip-screen > Anime / Manga > Visual novel > Detective / mystery","desc":"<p>Mikagura Shoujo Tanteidan makes use of an inference trigger system in which players have to detect points that need attention or are contradictory during conversations and look for suspicious spots in crime scenes to find out the truth.<br>Have fun playing detective with the Mikagura girl detectives today!</p>"},{"name":"Mike Tyson Boxing","year":2000,"developer":"The Codemasters Software Company Limited","url":"psx-chd-roms-m/Mike%20Tyson%20Boxing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":228420310,"score":6.3,"genres":"Sports > 3rd-person (Other) > Boxing","desc":"<p>Based around the boxer Prince Naseem Hamed, Prince Naseem Boxing features three different game types:</p><p>Showcase takes place in 16 international locations, where the player faces each of the boxers in a world tournament league, winning a match against one unlocks another opponent to face.</p><p>Versus mode allows you to play head-to-head against human or computer opponents.</p><p>World Game features 90 boxers and is career-based, the long-term objective being to manage a chosen boxer through a successful career.</p><p>A practice option is also included set in Naz's personal training gym where you must learn various boxing skills, including defence, movement, punches and dodging and blocking.</p>"},{"name":"Milano no Arbeit Collection","year":1999,"developer":"Westone Co., Ltd."},{"name":"Milky Season","year":2002,"developer":"EJ Corp.","url":"psx-chd-roms-m/Milky%20Season%20%28Japan%29.chd","filesize":373785726,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel","desc":"<p>In <em>Milky Season</em>, the player controls a young student who got appointed as the head of the girls' dormitory. This, in turn, will put you into many awkward and romantic situations where you can select how the story will branch and which girl you may fall in love with, based on your choices during dialogues. <em>Milky Season</em> is a visual novel that originated on consoles (PlayStation and Dreamcast), and is not a PC port and as such had no adult elements to begin with, focusing more on the story and interaction with the characters in this slice-of-life sort of setting.</p><p>The game features twelve heroines, letting you check the affection of 8 possible love interests towards you at any point during the game. The game does not feature any animation and characters depict their attitude and disposition only in voice-acting and static poses. Typical visual novel elements are present during gameplay, such as the dialogue text can be toggled to see the clear background, or that your choices may lead you towards a certain path in the story. The twelve heroines you can interact with in the game are: Miki Ayase, Saori Nonohana, Marin Chiura, Chihaya Hoshinami, Yun Usami, Reika Ranzaki, Mio Ayase, Itsuki Fujiwara, Mashiro Tachibana, Urumi Morishita, Kasumi Shindou, and Sachie Tohyama.</p>"},{"name":"Mille Miglia","year":2000,"developer":"Kung Fu Games","url":"psx-chd-roms-m/Mille%20Miglia%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":270199961,"score":6.2,"genres":"Racing / Driving > Behind view > Automobile > Track racing","desc":"<p>A racing game set in the golden era of BMWs and Mercedes, Alfa Romeos and Bugattis, Enzo Ferrari and Sterling Moss, but with all the 3D rendering effects you would expect from a standard Playstation racer.</p><p>Putting you in the seat of some of the most well-known racing cars of the time, Mille Miglia lets you try out well well-honed Playstation 'driving' skills on some new, but old, tracks. Letting you take part in full championship mode, the game sets you about some idyllic countryside scenery in the hopes of obtaining that elusive victory.</p>"},{"name":"Millennium Soldier: Expendable","year":2000,"developer":"Rage Software Ltd.","url":"psx-chd-roms-m/Millennium%20Soldier%20-%20Expendable%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":352741135,"score":6.7,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Sci-fi / futuristic > Regional differences","desc":"<p>In 2463 a race of vicious aliens has invaded human planets, wiping out the population of Novocastria first. Only the Millennium Soldier can lead the human fightback. </p><p>In this sci-fi action game, reflex shooting dominates over planning or tactical play. Expect non-stop action from fighting and relentlessly killing off tons of bad guys across more than 20 levels of 3rd person 3D action, taking place inside and outside. Powering up your weaponry is crucial - there are 18 different ones to collect, from pulse cannons to particle accelerators and rockets to missiles. Two player cooperative and deathmatch modes are provided.</p>"},{"name":"Million Classic (Disk 1)","year":1999,"developer":"","url":"psx-chd-roms-m/Million%20Classic%20%28Japan%29%20%28Disc%201%29%20%28Honpen%20Game%20Sen%27you%29.chd","filesize":240351679,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Managerial / business simulation > Horse / derby","desc":"<p><em>Million Classic</em> (ミリオンクラシック) is a simulation game which focuses on breeding and creating the ultimate racing horses. Player starts by creating your protagonist, the horse owner, which consists of entering the player's name and selecting the portrait for your character. Also, you get to select an outfit for your jockey (just the jacket) which can be customized in look, patter and color. The rest of the game focuses on you tending to your horse(s), making sure they are well taken care of in paddocks, and trained to become a good racing horses. You can also name your horses using similar interface to that for naming your character. You can buy and sell horses, breed them (selectively based on DNA strain), present them, and use them in races (the player does not control the race itself, you are more in a role of a manager or horse owner in this case).</p><p>The game comes with both jewel-case size manual book and technical book. Technical book gives more details on DNA and inbreeding, as well as courses, styles and other technical info. Additionally it includes four stickers with game artwork.</p>"},{"name":"Million Classic (Disk 2)","year":1999,"developer":"","url":"psx-chd-roms-m/Million%20Classic%20%28Japan%29%20%28Disc%202%29%20%28Taisen%20Game%20Sen%27you%29.chd","filesize":240360935,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Managerial / business simulation > Horse / derby","desc":"<p><em>Million Classic</em> (ミリオンクラシック) is a simulation game which focuses on breeding and creating the ultimate racing horses. Player starts by creating your protagonist, the horse owner, which consists of entering the player's name and selecting the portrait for your character. Also, you get to select an outfit for your jockey (just the jacket) which can be customized in look, patter and color. The rest of the game focuses on you tending to your horse(s), making sure they are well taken care of in paddocks, and trained to become a good racing horses. You can also name your horses using similar interface to that for naming your character. You can buy and sell horses, breed them (selectively based on DNA strain), present them, and use them in races (the player does not control the race itself, you are more in a role of a manager or horse owner in this case).</p><p>The game comes with both jewel-case size manual book and technical book. Technical book gives more details on DNA and inbreeding, as well as courses, styles and other technical info. Additionally it includes four stickers with game artwork.</p>"},{"name":"Minna Atsumore! Igo Kyoushitsu","year":2003,"developer":"SilverStarJapan Co., Ltd."},{"name":"Miracle Space Race","year":2003,"developer":"Miracle Designs","url":"psx-chd-roms-m/Miracle%20Space%20Race%20%28Europe%29.chd","filesize":41478918,"score":"","genres":"Action > Racing / Driving > Behind view > Fantasy > Sci-fi / futuristic","desc":"<p>In <em>Miracle Space Race</em> you choose from one of eight different characters to try to win one of three available space kart championships. You have several weapons to choose from, including missiles, mines, turbo boosts and shields.</p><p>The game also features unlockable characters as you progress through the stages and levels. Included is an Arcade mode (play through any race level you've already unlocked), and Time Trial mode (try to beat your own race records!)</p>"},{"name":"Misadventures of Tron Bonne, The","year":1999,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-m/Misadventures%20of%20Tron%20Bonne%2C%20The%20%28Europe%29.chd","filesize":143209518,"score":7.6,"genres":"Action > 1st-person > Behind view > Anime / Manga > Puzzle elements > Shooter > Mecha / giant robot > Post-apocalyptic","desc":"<p>Things are looking up for the Bonne family. Having just finished getting their airship, the Gesellschaft, operational, Teisel Bonne sets out with younger brother Bon Bonne to explore an unexplored ruin. Unfortunately for Teisel the loan he took out to pay for the Gesellschaft just came due, and the two Bonne brothers are taken prisoner. Now it's up to Tron to save her siblings and pay off their debt the only way she knows how: Grand Larceny.</p><p>Most of the levels in <em>The Misadventures of Tron Bonne</em> are played similarly to Mega Man Legends, but with minor tweaks to controls. Tron's walking tank, the Gustaff, can't equip the wide range of alternate weapons like Mega Man, but it can pick up and hurl large objects like trees and cars. It can also launch beacon bombs which direct the Servbots following Tron to either attack or steal anything in the vicinity. Additional levels include a crate stacking puzzle minigame where Tron needs to steal selected crates of valuables in a limited number of moves, and a first person dungeon exploration section where Tron must depend on the Servbots alone to clear out traps and enemies. Despite the Servbots all looking alike, each one has unique stats and abilities. By taking them on missions, training them aboard the Gesellschaft, or using special items their stats can be raised, unlocking hidden talents.</p>"},{"name":"Miss Spider's Tea Party","year":2000,"developer":"Hypnotix, Inc.","url":"psx-chd-roms-m/Miss%20Spider%27s%20Tea%20Party%20%28USA%29.chd","filesize":120052061,"score":"","genres":"Adventure > Educational > 3rd-person (Other) > Puzzle elements > Math / logic > Licensed","desc":"<p>Miss Spider's Tea Party invites children 3 to 7 years old to enter children's book author David Kirk's world of color and wonder. Mini-games provide hours of fun with a healthy serving of age-appropriate basic skills practice. Miss Spider's friends want to attend her party, but they each have a problem that needs to be resolved. It's up to the child to play the games and help all the friends make it to the party. </p><p>When the child succeeds at all mini-games, Miss Spider thanks the player with an invitation of their own -- something to print and cherish. Each game has an easy, medium and difficult level. The game contains a lot of 3D images and animation that capture the unique look and feel of the book.</p><p>The mini games:</p><p> The Beetles River Cross Game The Beetles want to attend Miss Spider's party, but they have a wide river to cross. Help them get from shore to shore by jumping from rock to leaf to tadpole to branch without falling in the water. </p><p> The Crickets Band Game The Crickets want to attend Miss Spider's party, but they need to form a band. Player matches each musical sound with its instrument. Match the whole band and they'll play a tune.</p><p> The Bee Flower Matching Game The Bees want to attend Miss Spider's party, but they have to pollinate flowers. Each Bee has a flower in mind. Choose the ones they're thinking of so they can finish up and head to the party.</p><p> The Hiding Butterfly Game The Butterflies want to attend Miss Spider's party, but they must find all their friends. The colorful Butterflies are cleverly hiding in several scenes. Find them all so they can come to the party.</p>"},{"name":"Missile Command","year":1999,"developer":"Meyer Glass Interactive Ltd.","url":"psx-chd-roms-m/Missile%20Command%20%28Europe%29%20%28En%2CIt%29.chd","filesize":367798249,"score":6.2,"genres":"Action > Arcade > Sci-fi / futuristic","desc":"<p>Defend cities around the world from an airborne alien attack.  This is a remake of the '70s arcade game, and features 3d graphics, counter-strike capabilities, new enemies &amp; power-ups, and multiplayer functionality.  Play is available in a Classic mode, which has only minorly retouched gameplay.  Ultimate mode has new graphics, locations, and other caveats.</p>"},{"name":"Mission, The","year":2000,"developer":"EMG","url":"psx-chd-roms-m/Mission%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%29.chd","filesize":181419188,"score":"","genres":"Action > 3rd-person (Other) > Side view > Fighting > Football (European) / Soccer > Licensed","desc":"<p>The Mission’, offers gamers the opportunity to play as some of the greatest footballers in the world.The aim of the game is to rescue a 'Geo Merlin’' ball, which has been stolen by Ninjas who embody the forces of brutality and poor sportsmanship, to save the future of football in its purest form. Using a selected team of two footballers, the player must battle and puzzle his way through over 24 levels of action, dispensing with fire-spitting demons and innumerable Ninjas trained in the martial arts along the way.Contains a mix of elements from football, action and combat games.</p>"},{"name":"Mission: Impossible","year":1999,"developer":"Infogrames Europe SA","url":"psx-chd-roms-m/Mission%20-%20Impossible%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":371081737,"score":7,"genres":"Action > 1st-person > 3rd-person (Other) > Puzzle elements > Shooter > Stealth > Spy / espionage > Licensed","desc":"<p>Tie-in of the popular movie <em>Mission: Impossible</em>, this is a third-person action stealth game with 24 levels. Playing the secret agent Ethan Hunt, the player has to fight international terrorists. Assisted by his IMF team, he sneaks into enemy bases, blows up ammunition depots, retrieves stolen information and takes out the terrorists.</p><p>The plot is loosely based on the movie; Ethan Hunt is framed and has to prove his innocence which he is only able to do with the help of his good friends from the IMF team.</p>"},{"name":"Missland","year":1995,"developer":"Altron Corporation","url":"psx-chd-roms-m/Missland%20%28Japan%29.chd","filesize":420365771,"score":"","genres":"Puzzle > Real-time > Hidden object","desc":"<p><em>Missland</em> is a simple \"spot the differences\" game. The player is given two slightly different 3D objects, or placed inside two slightly difference scenes, and can freely rotate and zoom. Each puzzle has eight differences to spot, and there are 36 puzzles total.</p><p>The game can be played single-player against a timer, two-player competitive, or with up to eight players in a tournament mode.</p>"},{"name":"Missland 2","year":1998,"developer":"Altron Corporation","url":"psx-chd-roms-m/Missland%202%20%28Japan%29.chd","filesize":74525954,"score":"","genres":"Puzzle > 1st-person > Real-time > Hidden object","desc":"<p><em>Missland 2</em> is a simple \"spot the differences\" game. Just like the first title, the player is given a view of two slightly different 3D environments, and can freely look around and zoom the camera. The player must find all eight differences in the stage, randomized each time it is played, before the time runs out and without making too many mistakes. In the party mode, up to four players can play simultaneously.</p>"},{"name":"Mitsumete Knight","year":1998,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"psx-chd-roms-m/Mitsumete%20Knight%20%28Japan%29.chd","filesize":420795339,"score":"","genres":"Role-playing (RPG) > Simulation > 1st-person > Anime / Manga > Fantasy","desc":"<p>In <em>Mitsumete Knight</em>, you are a young man who is sent to the fictional medieval country of Dolphan, where you must train to become a Holy Knight and to defend the country from attacks by the neighboring state Valpha. But as you arrive at Dolphan, your interest is shifted towards the pretty local girls. Will you be valiant in your training, or will you spend your time trying to have a date?</p><p>This is essentially a \"dating-sim\" game with elements of RPG. You have a schedule and have to decide what to do in order to charm the girl of your dreams. Various activities increase your skills, and it's important to remember which girl will be impressed by a particular skill. In addition, you also have hit points and gain levels, just like in a traditional RPG. Sometimes you'll be attacked by the knights from Valpha or other enemies, which will result in battles. The outcome of such battles largely depends on your previous training.</p>"},{"name":"Mizzurna Falls","year":1998,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-m/Mizzurna%20Falls%20%28Japan%29.chd","filesize":213090291,"score":"","genres":"Action > Behind view > Direct control > North America > Detective / mystery","desc":"<p>This title is considered to be one of the first open world adventure games ever made. The game follows a teenager named Matthew on a quest to find his missing friend Emma in the fictional rural American town of Mizzurna Falls.</p>"},{"name":"MLB 2000","year":1999,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-m/MLB%202000%20%28USA%29.chd","filesize":300803638,"score":7.7,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>This game is basically an update to MLB 99 with a few new features. The game contains depictions of the real teams, stadiums, stats, and players that reflect their real life counterparts. The modes returning from the previous game include quick play, season, playoffs, spring training, and home run derby. One of the new modes is general manager mode. In this mode, players can draft, create, trade, call up, waive, release, and sign players. Another new mode is the manager mode. In this mode, players can check out scouting reports during the game, warm up relievers in the bullpen, and try to get their team to the World Series and hopefully win it.</p><p>Vin Scully makes a return from the last game to do the play by play commentary, and is aided by Dave Campbell who does the color commentary.</p>"},{"name":"MLB 2001","year":2000,"developer":"989 Studios","url":"psx-chd-roms-m/MLB%202001%20%28USA%29.chd","filesize":326503324,"score":7.5,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>This baseball game is an update to MLB 2000. The game contains depictions of the real teams, stadiums, stats, and players that reflect their real life counterparts. This game features Exhibition, All-Star Game, Season, Playoffs, Spring Training, and Home Run Derby modes. There is also a Franchise mode that let's the player build a team from scratch and try to turn it into a World Series caliber team. Another feature the game has is Manager mode which lets the player check out scouting reports during the game, warm up relievers in the bullpen, and try to get their team to the World Series and hopefully win it.</p><p>A unique feature of this game is the Total Control Fielding and Total Control Batting systems. The batting system effects how much control the player has on how the ball is hit, which direction it gets hit to, and the power of the batter's swing.The fielding system lets the player have more control over the fielders. There is also an Advanced Batting Cursor option where guessing the pitcher's pitch correctly let's the player lock on to the pitch for more power while guessing incorrectly will make the batting cursor shrink and make the ball harder to hit</p><p>The Artificial Intelligence used in the game was developed with consultation from Tony Gwynn, Trevor Hoffman and Davey Johnson. Vin Scully and Dave Campbell are on hand to supply commentary during the game.</p>"},{"name":"MLB 2002","year":2001,"developer":"989 Studios","url":"psx-chd-roms-m/MLB%202002%20%28USA%29.chd","filesize":371463000,"score":6.8,"genres":"Simulation > Sports > 3rd-person (Other) > Top-down > Baseball > Licensed","desc":"<p><em>MLB 2002</em> was the fifth entry in Sony's MLB franchise with the standard set-up as the previous versions. A 3-D polygon based look with real-life animations (300 total) and 250 authentic signature moves of top MLB players of the time and authentic MLB teams, logos and stadiums. To provide authenticity, MLB players and officials lent their expertise to the game in order to create a more realistic and life-like appearance and feel to it.</p><p>The standard game modes apply: <em>Exhibition</em>, <em>Season</em>, <em>Tournament</em>, <em>Home Run Derby</em>, etc., along with a two-player mode where friends can compete head-to-head. There is also a franchise mode where players can not only trade, but also manage finances and other front office decisions to run a baseball franchise. Vin Scully and Dave Campbell also lend their voices for in-game commentary.</p>"},{"name":"MLB 2003","year":2002,"developer":"989 Studios","url":"psx-chd-roms-m/MLB%202003%20%28USA%29.chd","filesize":308073131,"score":"","genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>The only baseball game with a Major League Baseball license released for the PlayStation in 2002, <em>MLB 2003</em> largely retains the featureset and game modes from its immediate predecessor, <em>MLB 2002</em>.</p><p>The usual exhibition, regular season, spring training, franchise, and home run derby modes are back, while rosters and statistics have been updated. Vin Scully and Dave Campbell return as in-game broadcasters with updated commentary.</p>"},{"name":"MLB 2004","year":2003,"developer":"989 Studios","url":"psx-chd-roms-m/MLB%202004%20%28USA%29.chd","filesize":324261387,"score":6.7,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p><em>MLB 2004</em> is the game of baseball brought home. This game strives for realism with total control batting, pitching, and fielding, as well as having every player's head accurately recreated with the use of a 3D scanner.</p><p>In addition to returning modes such as season play and home run derby, new in this year's edition of the game are career, spring training, and franchise modes. In spring training mode, you not only create a player, but also must earn your way onto the team by performing well in spring training.</p>"},{"name":"MLB 2005","year":2004,"developer":"989 Studios","url":"psx-chd-roms-m/MLB%202005%20%28USA%29.chd","filesize":355609154,"score":"","genres":"Sports > Behind view > Diagonal-down > Direct control > Baseball > Licensed","desc":"<p><em>MLB 2005</em> continues Sony's series of baseball games, this time featuring improved graphics, a more comprehensive franchise mode, and more precise controls relative to its immediate predecessor, <em>MLB 2004</em>.</p><p>The PlayStation 2 version of the game also adds online play to the series for the first time, as players can square off against one another in exhibition games or tournaments via the Network Adaptor. Also new to the PS2 version is the player editor's support of the EyeToy camera, allowing players to import their own faces onto custom players.</p><p>The game also retains its familiar set of modes: career, exhibition, All-Star Game, season, playoffs, Spring Training, and Home Run Derby.</p>"},{"name":"MLB 98","year":1997,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-m/MLB%2098%20%28USA%29.chd","filesize":167974532,"score":7.8,"genres":"Simulation > Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>One of the earliest in Sony's MLB franchise, MLB 98 features the standard set of many baseball games. It has all of the 30 MLB teams and many of the major players, rendered in 3D polygon graphics with complete up-to-date (for that time) rosters. Real stadiums are also included along with the updated rules including the Interleague play rule that was implemented at the time.</p><p>It also has the standard set of modes including <em>Exhibition</em>, <em>Season</em>, <em>Playoffs</em>, <em>Home Run Derby</em>, <em>All-Star Game</em> and <em>World Series</em>. Players can also create and save their own players and customize them to their liking as well as keep extensive track of stats. They also have the option to run a franchise at the same time and manage everything including trades and free agency.</p><p>The controls consist of using certain buttons to either run the bases, bat and throw specific pitches depending upon the pitcher and the D-pad to move outfielders. Also, to throw to bases the player uses the main buttons (Triangle, Square, Circle and X).</p>"},{"name":"MLB 99","year":1998,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-m/MLB%2099%20%28USA%29.chd","filesize":336489677,"score":7.1,"genres":"Sports > Baseball > Licensed","desc":"<p>A baseball sim updated for the 1999 season featuring Hall of Fame broadcaster Vin Scully calling each game. The game features various modes including exhibition, season, play-offs, and home-run derby.  Each MLB stadium is recreated faithfully, as are the players. A new feature for this year's edition of the game is Spring Training mode, which allows one to create a new player and put him in the Minors and see if he can make it to the Majors.</p>"},{"name":"MLB Pennant Race","year":1996,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-m/MLB%20Pennant%20Race%20%28USA%29.chd","filesize":255812733,"score":7.3,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p><em>MLB Pennant Race</em> is one of the many baseball games released on the platform. It features the MLB license with all 28 teams at the time as well as 700 different players. It has a simulation mode where the real rules apply and an arcade mode for players who are less into serious baseball. It also contains quick play, season and home run derby as well as the option to play playoff games or to go straight to the World Series.</p><p>As a fully licensed game, it contains the real uniforms, logo and players and statistics based on the actual characteristics. Despite being released late in 1996 however, when the baseball season was already over, all the information still refers to the 1995 season. Commentary is done by Jerry Coleman.</p><p>Players can create their own players or compose a dream team from the pool of available players.</p>"},{"name":"Mobil 1 Rally Championship","year":2000,"developer":"Magnetic Fields (Software Design) Ltd.","url":"psx-chd-roms-m/Mobil%201%20Rally%20Championship%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":251699345,"score":7.8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Off-roading > Track racing","desc":"<p>This is the third rally simulation from Magnetic Fields and Europress (now renamed Actualize). This is a very realistic and highly detailed simulation which accurately recreates the Mobil 1 British Rally Championship. 36 tracks are available, all of which have been created by mapping the real life locations to create a highly accurate racing experience. There are also 22 rally cars to race in which have also been created from their real life counterparts. Although the name of the game is Mobil 1 British Rally Championship, it simply says \"Rally Championship\" on the front of the box and the game manual. Ignoring this little problem this game is an excellent addition to Europress' rally series and possibly the most realistic racing game ever.</p>"},{"name":"Mobile Armor","year":2002,"developer":"Highwaystar Co., Ltd.","url":"psx-chd-roms-m/Mobile%20Armor%20%28USA%29.chd","filesize":301751407,"score":"","genres":"Action > Behind view > Shooter > Tank","desc":"<p><em>Mobile Armor</em> is a third person shooter game in which the player controls a WWII era tank. The player will take on missions and as the game progresses more tank models will come available.</p><p>The story mode can be played on different difficulty levels in which the player takes on enemy tanks and has to avoid landmines. Before each mission the player has to select a tank model each with different specifications. Part of the tank can be customized like the armor and engine. The game offers a co-op and a versus multiplayer mode for up to two players on split screen.</p>"},{"name":"Mobile Suit Gundam","year":1995,"developer":"BEC Co., Ltd.","url":"psx-chd-roms-m/Mobile%20Suit%20Gundam%20%28Japan%29.chd","filesize":290826855,"score":"","genres":"Action > 1st-person > Anime / Manga > Shooter > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p><em>Mobile Suit Gundam</em> is a first-person action game that puts you in the shoes of Amuro Ray, pilot of the RX-78 Gundam, and has you play through the events of the original 1979 animated television show. You view the game from the cockpit of the RX-78, which has a variety of displays to show the condition of your mobile suit. In each stage, you must eliminate all the enemies to clear the stage.</p>"},{"name":"Mobile Suit Gundam 2.0","year":1996,"developer":"BEC Co., Ltd."},{"name":"Mobile Tomodachi","year":2002,"developer":"Atelier Double Co. Ltd.","url":"psx-chd-roms-m/Mobile%20Tomodachi%20%28Japan%29.chd","filesize":26897612,"score":"","genres":"Simulation > Side view > Fixed / flip-screen > Anime / Manga > Life / social simulation > Menu structures","desc":"<p><em>Mobile Tomodachi</em> is a mobile life simulation game brings together virtual versions of the player's friends, with a twist: the in-game cast is synchronized from the contact list on the player's mobile phone, transferred over via the PS1's mobile phone connection cable. Once their friends are imported, players can interact with them via multiple-choice dialogue prompts, with different choices leading to different relationships. The game can display a ranking of friendships based on the outcome of the simulated conversations.</p>"},{"name":"Momotarou Densetsu","year":1998,"developer":"Make Software, Inc.","url":"psx-chd-roms-m/Momotarou%20Densetsu%20%28Japan%29.chd","filesize":51954059,"score":"","genres":"Role-playing (RPG) > 1st-person > 3rd-person (Other) > Turn-based > Fantasy","desc":"<p><em>Momotarō Densetsu</em> is an enhanced remake of the original Famicom game of the same name. The story is essentially the same, but the graphics have been completely redone, and several features from Momotarō Densetsu II have been added, including the ability to adventure with a party, rather than just as Momotarō alone.</p>"},{"name":"Monaco Grand Prix Racing Simulation 2","year":1999,"developer":"Ubi Soft Entertainment Software","url":"psx-chd-roms-m/Monaco%20Grand%20Prix%20Racing%20Simulation%202%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.chd","filesize":199257825,"score":7.3,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Automobile > Track racing > Oceania > Licensed","desc":"<p>The sequel to F1 Racing Simulation recreates the 1997 season, featuring 17 authentic tracks, 11 teams and cars with their 22 drivers. The Monaco license is used, although the teams themselves are not licensed. A total of 22 camera views are provided.</p><p>Telemetry is stored and analysed in a similar way to Grand Prix 2, and physics are modeled to be realistic. There are eight different modes to race, the new ones being a career mode in which you start with a poor team and must drive well enough to earn competitive rides, and scenarios recreating key races for particular drivers. Returning from the first game are Time Attack, a full championship, and a 50s retro mode. There is also a track editor to create your own tracks.</p>"},{"name":"Money Puzzle Exchanger","year":1998,"developer":"FACE"},{"name":"Monkey Hero","year":1999,"developer":"Blam!","url":"psx-chd-roms-m/Monkey%20Hero%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.chd","filesize":251264801,"score":6.2,"genres":"Action > Top-down > Puzzle elements > Fantasy","desc":"<p>In this game you play a monkey, a brave little monkey, who has been trained by another monkey called Master Sage. When the game begins, three worlds are fighting against each other. The Dream World, the Nightmare World and the Waking World. The Nightmare King has stolen a book, the Magic Story Book, which is keeping the peace in the three worlds, and you have to get it back. Make your way through the Waking World while fighting the Nightmare King's minions to get the book back. Travel through libraries, forests and mines.  </p><p>Make friends which will help you on your quest. Use your weapons to crush crates; these crates often contain fruits which increasee your health. If you don't have a weapon to crush the crates with, then you have to throw them. You will acquire two weapons throughout the game: a bamboo stick to hit your enemies with and small rockets or spears to shoot down enemies far away from you. Solve many puzzles, defeat bosses and explore a large world.</p>"},{"name":"Monkey Magic","year":1999,"developer":"M-Pen Inc.","url":"psx-chd-roms-m/Monkey%20Magic%20%28USA%29.chd","filesize":294844701,"score":"","genres":"Action > 3rd-person (Other) > Side view > Platform > Puzzle elements > Licensed","desc":"<p><em>Monkey Magic</em> is a platform game based upon a cartoon of the same name. The cartoon (and thus, the game) is based upon <em>Journey to the West</em> - a 16th century Chinese novel in which Monkey (renamed Kongo for <em>Monkey Magic</em>) defends his fellow simians, engages in adventures, and challenges the gods in heaven.</p><p>Kongo begins his journey with only his martial arts to defend himself, but soon he meets Master Subodeye, who teaches him the four elemental powers: Shrink, Grow, Fire, and Ice. Kongo learns to cast these spells on himself and on others for various effects. These magical powers form the basis for Monkey Magic's many puzzles.</p><p>At the outset, Kongo is assisted by Batty. Batty explains the mechanics of the game should the player get stuck. After the first half of the game, Batty is revealed to be working for the evil Derth Voyd. But Kongo will put an end to his evil plans!</p>"},{"name":"Monopoly","year":1997,"developer":"Gremlin Interactive Limited","url":"psx-chd-roms-m/Monopoly%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CNl%29%20%28Rev%201%29.chd","filesize":242243242,"score":5.7,"genres":"Strategy > 3rd-person (Other) > Board game > Licensed","desc":"<p>The adaptation of the classic board game <em>Monopoly</em> for PlayStation supports up to four players. Players can select from eight tokens known from the board game. Any non-human players can be controlled by the AI - ten different AI opponent profiles can be selected.</p><p>The game supports a variety of custom rules. These include popular house rules like collecting fines on free parking, double bonus on GO, and having to go around the board once before starting purchasing. Standard rules like auctions, the even-build rule or dealing from jail can be turned off. It is also possible to set the number of buildings in the bank to infinite. Various rules that vary in regional editions of the board game of the can be toggled as well, including higher luxury tax or the option of paying 10% income tax instead of a flat fee.</p><p>During a game, the board is seen in a perspective view, with the side where the current token is situated always at the front. Controls are cursor-based point-and-click (the PlayStation mouse is supported). Clicking on Mr. Monopoly makes him throw the dice onto the board, while deals and trades are made from a special sub-menu. When a token is moving, the game plays a matching pre-rendered animation. Each board square also has a special animation played when the player reaches it. For properties, these change from an abandoned scenery for unowned properties to scenes with lived-in houses and hotels for properties that are built out. Both kinds of animations can be turned off before a game.</p>"},{"name":"Monster Bass!","year":2000,"developer":"Magical Company Ltd.","url":"psx-chd-roms-m/Monster%20Bass%20%28USA%29.chd","filesize":328874843,"score":"","genres":"Sports > 1st-person > Fishing","desc":"<p><em>Monster Bass!</em> is a fishing simulator set in four locations. The player gets to control the bait to lure and catch several types of \"scientifically mutated gigantic monster bass\". As the game progresses special baits and tricks get unlocked.</p>"},{"name":"Monster Racer","year":2001,"developer":"Microïds","url":"psx-chd-roms-m/Monster%20Racer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.chd","filesize":199497704,"score":"","genres":"Racing / Driving > 1st-person > Fantasy","desc":"<p>Choose your favourite monster from 10 fantastic creatures, each with their own ghastly traits. Choose from Mummies, Vampires, Skeletons, Werewolves and more. Confront your competitors over 10 circuits and 10 battle arenas.</p><p>Help Jack O'Lantern, the pumpkin-headed man, to get his lanterns back thanks to which werewolf, witch, skeleton or vampire can find the unique way to Earth to celebrate Halloween with humans. Find the quickest champion of Halloween lands and defeat the forces of evil </p><ul><li><p>4 multi-player and 4 single player modes</p></li><li><p>12 creatures of famous tales to compete </p></li><li><p>Many traps, spells and animations make the game funny to play</p></li></ul>"},{"name":"Monster Rancher","year":1997,"developer":"Tecmo, Ltd.","url":"psx-chd-roms-m/Monster%20Rancher%20%28Europe%29.chd","filesize":175657848,"score":7.6,"genres":"Simulation > Strategy > 3rd-person (Other) > Managerial / business simulation > Fantasy","desc":"<p><em>Monster Rancher</em> is a \"monster raising\" simulation in which you raise your monsters in order to win fighting tournaments and become the greatest breeder ever.</p><p>A unique feature is the way you obtain your monsters: from every CD you own. That's right: every CD you own (including PC ones, musical and even 3D0 games) can be used to generate a different monster.</p>"},{"name":"Monster Rancher 2","year":1999,"developer":"Tecmo, Inc.","url":"psx-chd-roms-m/Monster%20Rancher%202%20%28USA%29.chd","filesize":176770656,"score":7.3,"genres":"Action > Strategy > Diagonal-down > Anime / Manga > Fighting > Managerial / business simulation","desc":"<p>Monster Rancher 2 is at heart an arena fighting game with a lot of ancillary game play thrown in. As a trainer of a fighting monster you have to train, reward, punish, cajole and bribe your minion to build up its statistics. You then take your monster into the arena where it battles with other monsters for cash prizes, prestige, and better stats.Like the original Monster Rancher, this game allows players to create a monster using an innovative technique: you can stick in any CD you own (PlayStation, audio, PC, or other) and the data that is read off the CD is used to generate the characteristics of the monster.</p>"},{"name":"Monster Rancher Battle Card Episode II","year":2000,"developer":"Tecmo, Ltd.","url":"psx-chd-roms-m/Monster%20Rancher%20Battle%20Card%20-%20Episode%20II%20%28USA%29.chd","filesize":81193512,"score":7.1,"genres":"Strategy > 1st-person > Anime / Manga > Cards / tiles > Trading / collectible card","desc":"<p><em>Monster Rancher Battle Card Episode II</em> is the sequel to Monster Rancher Battle Card GB. But it takes advantage of the PlayStation's superiority in graphics and processing power and adds more complex storyline quests, and expands the card game itself. No knowledge of other Monster Rancher games is needed, however, characters from prior games do play pivotal roles in the storyline. </p><p>For the first time, players can see into the personal lives of the characters in the Monster Rancher world, and interact with them while attempting to win matches of the collectible card game, to collect enough cards to complete quests. Along the way, the player is able to visit various locales and meet up with old friends and new acquaintances.</p><p>The card game itself features a tutorial mode, on screen help, and the option to turn animations on or off. It is easy enough at low levels for almost anyone to learn the basics, but offers options and higher levels of complexity to reward more patient, and older players.</p><p>Cards are acquired through defeating opponents, and via an in-game shrine where you can use music CDs, PlayStation games, or PC CD-ROMs to make cards. The CD shrining feature is unique to the Monster Rancher games.</p><p>The game also features a 2P mode designed for players who have played the game on their own and acquired their own cards (and tried and tested their skills) to play card games against each other. It is adequate, but unrelated to the in-game storyline.</p>"},{"name":"Monster Rancher Hop-A-Bout","year":2000,"developer":"Tecmo, Ltd.","url":"psx-chd-roms-m/Monster%20Rancher%20Hop-A-Bout%20%28USA%29.chd","filesize":102019539,"score":"","genres":"Action > Anime / Manga > Arcade > Platform > Licensed","desc":"<p>Monster Rancher Hop-A-Bout is a platform adventure game based on characters from the Monster Rancher video games and animated TV series. Hop-A-Bout is an addictive and easy-to-learn title that challenges players to hop their way through more than a hundred obstacle courses.</p><p>Designed to be 'fun for the whole family', Hop-A-Bout features arcade-style gameplay that is easy to learn and difficult to master.</p><p>Hop-A-Bout players can choose from a cast of colorful Monster Ranchercharacters to start their journey. Armed with the ability to bounce slow orfast and to the right or left, characters must move from one end of aplaying course to the other, avoiding dangerous obstacles and holes alongthe way. Hopping onto various panels in each course helps or hinders progress, depending on the panel (a heart panel increases life,while a skull decreases life).</p><p>Additional features of Monster Rancher Hop-A-Bout include one and two-player modes and a stage edit function that allows players to create up to four customized courses that can be saved.</p>"},{"name":"Monster Seed","year":1998,"developer":"NK System Co., Ltd.","url":"psx-chd-roms-m/MonsterSeed%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":139180499,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Fantasy","desc":"<p>Not much of a fighter? Like to work with exotic animals? Like helping people? Then start gathering your seeds today!</p><p>Monster Seed obviously takes influence from the popular animal raising/fighting genre; specifically games like Pokémon and Monster Rancher. Of course, it does do a few things differently. One major difference is the fantasy setting. No ranches or medical settings here, no sir. Another key difference is in the overall presentation; Monster Seed's gameplay and interface are a lot more simple than most other breeding games.</p><p>Similar to mother games in the genre, there's a brief tutorial of sorts, and then you're off to gather your own creatures, earning better seeds and other breeding components as you go. Just be careful with your critters, because if they die in battle, they're gone for good. Granted you can always breed more, but it can certainly set you back if your creature hatches at level five, but you lost a level twelve.</p><p>Combat itself uses a somewhat typical turn-based system, with a grid used to determine character locations, spell ranges and so on. Much like a normal RPG, you get to take turns giving commands to your main character and your monsters. Different monsters are better suited for different roles, with some better off hanging out in the back, attacking from a distance and others in the front lines, absorbing the damage and dishing out the hurt.</p><p>Monster Seed isn't the most innovative RPG/breeding game out there, but it is a decent game that will help any fan of the genre pass the time.</p>"},{"name":"Monte Carlo Games Compendium (Disk 1)","year":2002,"developer":"Mere Mortals Ltd.","url":"psx-chd-roms-m/Monte%20Carlo%20Games%20Compendium%20%28Europe%29%20%28Disc%201%29%20%28Rev%201%29.chd","filesize":205666040,"score":"","genres":"Compilation > Gambling > Strategy > Top-down > Cards / tiles","desc":"<p><em>Monte Carlo Games Compendium</em> features 17 casino and card games. Hence, the jewel case contains two discs. Disc #1 is named \"Casino Games\" and contains 7 games: Baccarat, Roulette, Let it Bet, Super Black Jack, Video Poker, Slot Machine and Keno. Disc #2 is named \"Card Games\" ans contains the other 10 games : Seven in a Row, Rich Man, Splash, Page One, Seven Bridges, Old Maid (Old Man), Speed, Poker, Black Jack (21) and Concentration.</p><p>There are two game modes : Free Mode, where you play against 4 computer-controlled players and Ranking Mode, where you play to with up to 10 players (including computer-controlled players). View is top down and Muti-Tap can be used to play to games such as Concentration.</p>"},{"name":"Monte Carlo Games Compendium (Disk 2)","year":2002,"developer":"Mere Mortals Ltd.","url":"psx-chd-roms-m/Monte%20Carlo%20Games%20Compendium%20%28Europe%29%20%28Disc%202%29%20%28Rev%201%29.chd","filesize":348933353,"score":"","genres":"Compilation > Gambling > Strategy > Top-down > Cards / tiles","desc":"<p><em>Monte Carlo Games Compendium</em> features 17 casino and card games. Hence, the jewel case contains two discs. Disc #1 is named \"Casino Games\" and contains 7 games: Baccarat, Roulette, Let it Bet, Super Black Jack, Video Poker, Slot Machine and Keno. Disc #2 is named \"Card Games\" ans contains the other 10 games : Seven in a Row, Rich Man, Splash, Page One, Seven Bridges, Old Maid (Old Man), Speed, Poker, Black Jack (21) and Concentration.</p><p>There are two game modes : Free Mode, where you play against 4 computer-controlled players and Ranking Mode, where you play to with up to 10 players (including computer-controlled players). View is top down and Muti-Tap can be used to play to games such as Concentration.</p>"},{"name":"Moon Cresta","year":2002,"developer":"Nihon Bussan Co., Ltd."},{"name":"Moon: Remix RPG Adventure","year":1997,"developer":"Love-de-Lic","url":"psx-chd-roms-m/Moon%20-%20Remix%20RPG%20Adventure%20%28Japan%29%20%28Rev%201%29.chd","filesize":377057029,"score":8.1,"genres":"Adventure > 3rd-person (Other) > Top-down > Fantasy > Sci-fi / futuristic > Comedy","desc":"<p>A little boy likes to play video games. Day and night he sits in front of his GameStation and plays a game called <em>Moon</em>: a typical Japanese RPG with a sword-wielding hero who kills monster after monster on his grand epic quest. Skipping through the boring, cliche story, the boy continues to play until his mother tells him to stop and go to bed. However, the TV on which he was just playing the game miraculously turns itself on, and the boy is sucked into the world of <em>Moon</em>, a fantasy land called Love-de-Gard. </p><p>It turns out that the hero of the game that the boy was playing is a troublesome individual, who does nothing else but slaughter various creatures populating the land, barge into people's houses bothering them with questions and taking their possessions without asking, and complain that he \"can't reach the final dungeon\". Souls of the animals the hero has killed find no rest, and the land's inhabitants are horrified. The boy realizes that there can only be one answer to that: love.</p><p><em>Moon: Remix RPG Adventure</em> is an adventure game with light role-playing elements that parodies the RPG genre by presenting a situation in which the player character must act in a way opposite to the usual behavior of typical RPG protagonists. There is no combat in the game. Core gameplay resembles that of adventure games: the player explores various locations, talks to characters and solves problems in a non-violent way. The game's world is open-ended, and story progression is non-linear. The world has a day and night cycle as well as an internal calendar, with people following their own schedules daily. </p><p>The main goal consists of raising the protagonist's \"love level\", which is achieved by fulfilling people's wishes. In many cases it is not immediately obvious what people really wish for, and the player has to gather clues and learn more about the game world's inhabitants in order to find a way to make a particular character happy. Some of these activities are timed. Soul-catching, i.e. resurrecting the animals killed by the hero of the game <em>Moon</em>, is one of the ways to increase the love level. Amassing love points raises the \"action limit\", which is the amount of time the boy can stay in Love-de-Gard. If the action limit falls to zero, the game is over.</p>"},{"name":"Moonlight Syndrome (Disk 1)","year":1997,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-m/Moonlight%20Syndrome%20%28Japan%29%20%28Disc%201%29.chd","filesize":218059659,"score":"","genres":"Adventure > 3rd-person (Other) > Horror","desc":"<p>A teenage girl named Mika meets a mysterious person on her way home, who warns her of horrifying events that are about to happen to her and her friends. More strange events are happening this evening: a cancelled meeting, a boy who seems to have followed her - but the next day, she almost forgets it... until she hears on the news that her schoolmate Kyoko was killed in a truck accident. Now Mika must find out what is truly happening around her. And so does Ryo, Kyoko's brother, who has been seeing strange dreams lately...</p><p>A sequel to the original two  Twilight Syndrome games, <em>Moonlight Syndrome</em> has a similarly text-heavy, low-interaction, linear gameplay with dialogue and/or action choices, which would sometimes influence the course of the narrative. Like <em>Twilight Syndrome</em> games (and unlike most Japanese-style adventure games), <em>Moonlight Syndrome</em> has physical character navigation in limited 3D areas. Some scenes - such as most full-screen dialogue portraits, etc. - are depicted as pre-rendered images. The player controls different characters, starting with Mika, then switching to Ryo; most of the gameplay consists of walking/running to the next screen, triggering the next dialogue/scene. There is no other interactivity in the game, and no items.</p>"},{"name":"Moonlight Syndrome (Disk 2)","year":1997,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-m/Moonlight%20Syndrome%20%28Japan%29%20%28Disc%202%29.chd","filesize":305862636,"score":"","genres":"Adventure > 3rd-person (Other) > Horror","desc":"<p>A teenage girl named Mika meets a mysterious person on her way home, who warns her of horrifying events that are about to happen to her and her friends. More strange events are happening this evening: a cancelled meeting, a boy who seems to have followed her - but the next day, she almost forgets it... until she hears on the news that her schoolmate Kyoko was killed in a truck accident. Now Mika must find out what is truly happening around her. And so does Ryo, Kyoko's brother, who has been seeing strange dreams lately...</p><p>A sequel to the original two  Twilight Syndrome games, <em>Moonlight Syndrome</em> has a similarly text-heavy, low-interaction, linear gameplay with dialogue and/or action choices, which would sometimes influence the course of the narrative. Like <em>Twilight Syndrome</em> games (and unlike most Japanese-style adventure games), <em>Moonlight Syndrome</em> has physical character navigation in limited 3D areas. Some scenes - such as most full-screen dialogue portraits, etc. - are depicted as pre-rendered images. The player controls different characters, starting with Mika, then switching to Ryo; most of the gameplay consists of walking/running to the next screen, triggering the next dialogue/scene. There is no other interactivity in the game, and no items.</p>"},{"name":"Moorhen 3 - Chicken Chase","year":2002,"developer":"Phenomedia AG","url":"psx-chd-roms-m/Moorhen%203%20-%20Chicken%20Chase%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":7913011,"score":5.8,"genres":"Action > 1st-person > Shooter","desc":"<p><em>Moorhen 3 ...Chicken Chase</em> is a shooter still in the same style as the first Moohrhuhn. The player has a gun and he shoots chickens which fly over the screen. If they are far away, they give more points. After six shots the player has to reload the weapon (which gives a time penalty). The time is limited, the screen can be scrolled left and right and the ultimate goal is to improve the own highscore.</p><p>In this game the only background is set at a sea. New features are more different animals to shoot, including the \"Lesshühner\" which give negative points. Two new ammo types are more powerful but limited and have to be earned by shooting certain things. There are multiple hidden extras to find, e.g. ways to extend the playing time. In the PC version there is an online highscore list.</p>"},{"name":"Moorhuhn 2","year":2000,"developer":"Phenomedia AG","url":"psx-chd-roms-m/Moorhuhn%202%20-%20Die%20Jagd%20geht%20weiter%20%28Germany%29.chd","filesize":14997967,"score":5.8,"genres":"Action > Sports > 1st-person > Hunting > Rail shooter > Shooter > Point and select","desc":"<p><em>Moorhuhn 2</em> is the sequel to the famous shooting game. Similarly to its predecessor, the player goes on a hunt for the eponymous birds. </p><p>The player can shoot the passing birds with his mouse, reloading the rifle with the right mouse button. Each round lasts 90 seconds, and the goal is to gain as many points as possible. Apart from scoring points by shooting the passing Moorhuhns, the player can also shoot other objects in the environment, such as spiders, rocks or passing planes--some of these give points when shot, others give the player a score penalty.</p>"},{"name":"Moorhuhn Kart","year":2002,"developer":"phenomedia publishing gmbh","url":"psx-chd-roms-m/Moorhuhn%20Kart%20%28Germany%29.chd","filesize":206813980,"score":5.5,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p>Moorhuhn's first venture into the racing genre. This kart racing game features a number of new characters that are to be introduced as members of the Moorhuhn-Family (known from the Moorhuhn shooters).</p><p>The game features comic-style 3D-graphics, 5 different drivers - each with its own driving style - and 3 different game modes. </p><p>The whole concept reminds one of the Mario Kart games. The player chooses a character, either Moorhuhn itself or Lesshuhn, Frog, Snowman or Pumpkinhead. The game's objective is to win the race, of course, but your opponent will try everything in their power to keep your chosen character from winning by sending you off the racetrack. To achieve this they resort to things like weights, water bombs, chewing gum, sudden holes in the road, boards larded with nails or even rockets. But the player can also find these so called power-ups, small packages that can be found at random order on the racetrack. Unfortunately, you do not know what is in the packages until they are opened which adds a little surprise to the action.</p><p>The kart is controlled using the arrow keys on the keyboard, but one can also use a Windows compatible gamepad.</p><p>The XL version lacks the Duel mode and two courses.</p>"},{"name":"Mort the Chicken","year":2000,"developer":"AndNow LLC","url":"psx-chd-roms-m/Mort%20the%20Chicken%20%28Europe%29.chd","filesize":417127830,"score":5.5,"genres":"Action > Behind view > Platform","desc":"<p>Cube shaped life forms from a parallel universe mistake bales of hay on a farm as captured cubes and Colonel Cubicles sends a demand to the chickens living there that all the cubes on the farm need to be freed. Failing to do this, the cube creatures kidnap all the baby chicks down a well which lead to their world. Now it's up to a chicken with superpowers, named Mort, to head down the well and rescue those baby chicks. </p><p>The game is broken up into stages in which Mort goes around searching for the baby chicks to rescue. Once he collects the chicks, he has to return them to the well at the start of each stage. He must be careful of the block shaped enemies that are trying to impede his efforts. To attack his enemies, Mort can peck and comb whip them. Mort can also crack open eggs to find power-ups such as springs, invincibility, or even an ability to launch baby chickens at any of the enemies. If an enemy does hit Mort he will lose some health. To restore health, Mort can eat corn and beans which are strewn among the ground of each stage. Mort can also collect stars and coins which will increase the player's score.</p><p>In between each stage, two newscasters, Chicken Little and Henny Penny, give up-to-date commentary on current happenings which help move the story along.</p>"},{"name":"Mortal Kombat 3","year":1995,"developer":"Midway Manufacturing Company","url":"psx-chd-roms-m/Mortal%20Kombat%203%20%28Europe%29.chd","filesize":214356657,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts","desc":"<p>Shao Kahn has won. The Earthrealm is no more. In order to revive his Queen Sindel, the emperor Shao Kahn used the Outworld Tournament from Mortal Kombat 2 as a diversion while his Shadow Priests revive his fallen Queen on Earth. Once enacted, the dimensional bridge between the two realms connects, allowing Kahn's extermination squads to invade and destroy Earth, and enslave the population's souls.</p><p>A small team of Raiden's \"Chosen Warriors\" survives the attack: Mortal Kombat champion Liu Kang and his ally Kung Lao, Special Forces agents Sonya Blade and Jax, the shaman Nightwolf, the riot cop Stryker, the nomadic Kabal, and former Lin Kuei warrior Sub-Zero, who has gone rogue from his clan. Facing the warriors are the mercenary Kano, cyber-ninjas Smoke, Sektor and Cyrax, Sheeva, a female Shokan, the sorcerer Shang Tsung, and Queen Sindel herself.</p><p><em>Mortal Kombat 3</em> brings new elements to the 2D fighting series: multi-level playfields, \"Dial-A-Combo\" attacks, a \"Run\" button to speed up the battles, and \"Vs.\" codes, which unlock new powers and abilities once both players enter a code sequence in pre-match-up screens. Also included are more stage fatalities and finishing moves as each warrior attempts to go one-on-one with the Centaurian enforcer Motaro, and Shao Kahn himself.</p><p>Mortal Kombat 3 is the last traditional one-on-one fighting game game in the series to feature motion-captured digitized graphics for its kombatants, and introduces online network play to the PC version.</p>"},{"name":"Mortal Kombat 4","year":1998,"developer":"Midway Games, Inc.","url":"psx-chd-roms-m/Mortal%20Kombat%204%20%28Europe%29.chd","filesize":357714300,"score":7,"genres":"Action > Side view > Arcade > Fighting","desc":"<p><em>Mortal Kombat 4</em> is 1 vs 1 fighting game, similar to the other Mortal Kombat games, but this is first game in series with 3D characters models. The player can choose from 15 different fighters at the start (and several unlockables later on). Many fighters from earlier games in the series make a comeback (like Scorpion, Sub Zero, Liu Kang, Sonya Blade, Johnny Cage etc.) while other new fighters join in, like Shinook (who is the main evil character in this game), Fujin, Jarek, and Kai. Goro returns as a boss</p><p>Gameplay is very typical for a <em>Mortal Kombat</em> game, but has several new features - for example characters can use weapons in a fight (not only as a special move) or avoid attacks in the 3D environment.</p>"},{"name":"Mortal Kombat II","year":1996,"developer":"Midway Manufacturing Company","url":"psx-chd-roms-m/Mortal%20Kombat%20II%20%28Japan%29.chd","filesize":27387272,"score":7.9,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts > Regional differences","desc":"<p>The Mortal Kombat fighters, plus several new ones, return for a tournament held by the evil Shang Tsung of the Outworld. The action is one-on-one as before, and famed for its high level of violence and blood (other than the sanitised Nintendo version). There are 5 difficulty levels and optional credits, as well as the usual two player mode including same character duels.</p><p>To win the main tournament, the player must beat each of the other human players, before taking on Shang Tsung, Kintaro and finally Shao Kahn. Players have a range of punches and kicks available, as well as flying kicks, uppercuts, roundhouses, and the special moves, which vary for each player. These include throws, uppercuts, long-distance bullets, bicycle kicks and a teleport feature.</p>"},{"name":"Mortal Kombat Mythologies: Sub-Zero","year":1997,"developer":"Avalanche Software LLC","url":"psx-chd-roms-m/Mortal%20Kombat%20Mythologies%20-%20Sub-Zero%20%28Europe%29.chd","filesize":322248073,"score":6.3,"genres":"Action > Side view > Arcade > Fighting > Platform > Sci-fi / futuristic","desc":"<p><em>Mortal Kombat Mythologies: Sub-Zero</em> is a story-driven fighting game that casts you in the shoes of Sub-Zero, and chronicles a series of events that occurred prior to Mortal Kombat 1.</p><p>In a storyline that is reminiscent of Looking Glass's Thief, the Lin Kuei assassin/thief is sent to steal an important document; this mission proves to be a test from a mysterious character (which turns out to be MK4's Quan Chi) and who charges you upon retrieval of this object to recover an ancient medallion of untold power. However once you retrieve the medallion, Quan Chi reveals that he actually tricked you, and the medallion is the key to awakening the demonic Shinnok (yup, the same baddie from MK4). You must now become a reluctant hero, as you pursue Quan Chi trough hell itself hoping you get to Shinnok before him.</p><p>Gameplay wise the game takes the Mortal Kombat familiar 2D fighting environment and turns it into a hybrid fighter/platformer game, where you must travel trough hazardous levels running and jumping around as well as fighting your way against both digitized and polygonal enemies. Sub-Zero's interface is the same as in every MK game, with the addition of a \"use\" and \"turn around\" buttons and additions such as an inventory, and a slight RPG twist in which you get exp. for defeating opponents, which translates into new techniques and moves to execute in the game.</p><p>Technically speaking this game represents the final evolutionary step in the MK's series 2D engines. New features include zooming, 3D lighting as well as 3D backgrounds and characters, etc.</p>"},{"name":"Mortal Kombat Trilogy","year":1996,"developer":"Midway Games, Inc.","url":"psx-chd-roms-m/Mortal%20Kombat%20Trilogy%20%28Europe%29.chd","filesize":315295167,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy > Martial arts","desc":"<p>All the characters from the first three Mortal Kombat games return for the ultimate battle. You can play as Kano, Reptile, Mileena, Kung Lao, Shang Tsung, Sindel, Sketor, Stryker, Nightwolf, Sheeva, Kitana, Scorpion, Sonya, Smoke (Cyber Ninja), Rain, Jade, Baraka, Johnny Cage, Ermac, Noob Saibot, Sub-Zero (Unmasked), Sub-Zero (Classic), Jax, Rayden, Cyrax, Liu Kang, Smoke (Human), Kabal, Goro, Kintaro, Motaro, or Shao Kahn.</p><p>This game is one-on-one martial arts fighting. The player can choose from over thirty different characters, all with their own fighting style and their own special moves. Trilogy differs from the other games in that you can play combinations of people that otherwise isn't possible, such as old Liu Kang vs. new Liu Kang, etc.</p><p>Mortal Kombat Trilogy also allows you to challenge a friend to a fight through a Windows IPX network connection.</p>"},{"name":"Mortal Kombat: Special Forces","year":2000,"developer":"Midway Games, Inc.","url":"psx-chd-roms-m/Mortal%20Kombat%20-%20Special%20Forces%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":175322864,"score":5.1,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Puzzle elements","desc":"<p>Take on the role of Mortal Kombat® character Jax, as you descend into the realm of Mortal Kombat in search of arch- villain, Kano. As you make your way through the game, you will delve deeper into one of the most interesting and enigmatic stories in the Mortal Kombat universe. Battle your way through complex 3D levels. Destroy your enemies using never-before-seen special moves and combos, all leading to an unforeseen climactic ending.</p>"},{"name":"Moses: Prince of Egypt","year":2000,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-m/Moses%20-%20Prince%20of%20Egypt%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.chd","filesize":354352906,"score":"","genres":"Puzzle > 3rd-person (Other) > Fixed / flip-screen > Full Motion Video (FMV) > Point and select > Egypt (Ancient)","desc":"<p>Found by the river, and adopted into the royal family of Egypt, Moses must start on a quest to save his true people, the Israelites, from misery at the hands of their cruel Pharaoh.<br>As well as a great half-hour cartoon video, Moses: Prince of Egypt features an easy-to-use virtual colouring book and a challenging puzzle game.<br>Can the Prince of Egypt fulfil his destiny?</p>"},{"name":"Moto Racer","year":1997,"developer":"Delphine Software International","url":"psx-chd-roms-m/Moto%20Racer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.chd","filesize":286331094,"score":8,"genres":"Racing / Driving > Sports > Behind view > Direct control > Motorcycle > Track racing > Vehicle simulator","desc":"<p>An arcade motorcycle racer in which both superbike and motocross events are available. Game modes include Practice, Time Attack, in which players race against their own replays, Single Races against computer-controlled opponents, and a Championship Circuit. Network or Internet play for up to 8 players is available as well.</p><p>Winning the championship unlocks additional courses out of the 4 road and 4 dirt tracks available, as well as the new game options Reverse and Pocket Bike. In Reverse mode the tracks are raced in the opposite direction, while in Pocket Bike mode every racer is given a miniature version of his motorcycle.</p><p>A free track add-on extends the game with one additional course for sportbikes and dirtbikes each.</p>"},{"name":"Moto Racer 2","year":1998,"developer":"Delphine Software International","url":"psx-chd-roms-m/Moto%20Racer%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.chd","filesize":340962607,"score":7.6,"genres":"Racing / Driving > Sports > Behind view > Direct control > Motorcycle > Off-roading > Track racing","desc":"<p>Delphine's sequel to their popular Moto Racer, MR2 features more tracks, several different \"championship\" modes, an enhanced Direct3D graphics engine, and a track editor for creating your own superbike and motocross tracks.</p>"},{"name":"Moto Racer World Tour","year":2000,"developer":"Delphine Software International","url":"psx-chd-roms-m/Moto%20Racer%20World%20Tour%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.chd","filesize":412891068,"score":7.3,"genres":"Racing / Driving > Sports > Behind view > Tricks / stunts > Direct control > Motorcycle","desc":"<p><em>Moto Racer World Tour</em> is the third part of the Moto Racer series for the PlayStation. The game offers you to race on 34 different bikes in both dirt and street bike category. Each bike's settings can be manually adjusted. The game features 18 real-life tracks. Besides normal races you can play a variety of different modes, such as obstacle course, drag race, freestyle race (where you have to perform tricks to score points) and Traffic Race (with normal traffic on the road). The game features two player multiplayer.</p>"},{"name":"Motocross Mania","year":2001,"developer":"Deibus Studios Ltd.","url":"psx-chd-roms-m/Motocross%20Mania%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":278635248,"score":5.5,"genres":"Racing / Driving > Simulation > Sports > 1st-person > Behind view > Direct control > Motorcycle > Off-roading > Track racing","desc":"<p>Motocross Mania is a motorcycle racing sim. It features tricks in the style of the Tony Hawk series of games, and includes Motocross, Supercross, Baja and Freestyle modes of play.</p><p>The game features realistic physics, although no damage modeling. It has 20 different venues, from arenas to outdoor tracks, covering 12km/sq of area. With the 3D engine, you get many of the camera angles used in flight sims, and it supports the top hat switch on joysticks. The game has a career mode, a straight racing mode, and a single player freestyle mode available.</p>"},{"name":"Motocross Mania 2","year":2003,"developer":"Alpine Studios, Inc.","url":"psx-chd-roms-m/Motocross%20Mania%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":92998596,"score":"","genres":"Racing / Driving > Sports > 1st-person > Behind view > Motorcycle","desc":"<p><em>Motocross Mania 2</em> is a motorcycle racing game for 1 or 2 players. The game contains an arcade mode (race and time attack practice), a career mode with three difficulty levels, and a track editor. Apart from winning races, the player may perform a variety of tricks. The game allows to choose the gender of the racer, and features five motorbikes and twelve race tracks. The player has the ability to change the specs of their motorcycle, such as suspension, exhaust or brakes. The gameplay is typical of arcade racing games, with a motorbike that can't be damaged although the player may fall down.  </p><p>The game features a multiplayer mode on a split screen - horizontal or vertical.</p>"},{"name":"Motor Mash","year":1997,"developer":"Eutechnyx Limited","url":"psx-chd-roms-m/Motor%20Mash%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":168009848,"score":7,"genres":"Action > Racing / Driving > Top-down > Automobile","desc":"<p><em>Motor Mash</em> is a top down cartoon racer for 1 to 4 players by using a multi-tap or by sharing the joypad similar to Micro Machines 2.</p><p>You can choose to play single player practice, Knockout Races, Single Player Tournaments, Multi Player Tournaments, Beat the Clock and Team Knockout. Players can select from 12 characters and race across level with different themes. There's jungle, aztec temples, inner city, wild west, nightmare, arctic themes. Each of the themes have unique hazards like bridges, crossing trains, oil wells, cyclones, snowmen and killer plants.</p><p>In each race the goal is to leave your opponents far behind so they go off screen. You can by pushing them off bridges or into hazards. When there is one player left, that player wins and all other players return to start again from that point. Each time credits are awarded depending on how long each player lasted on screen. Lose all credits and you're out of the game, last man standing wins the race.</p>"},{"name":"Motor Toon Grand Prix","year":1994,"developer":"Sony Computer Entertainment Inc.","url":"psx-chd-roms-m/Motor%20Toon%20Grand%20Prix%20%28USA%29.chd","filesize":262961947,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing","desc":"<p>If you've ever wanted to burn some cartoon rubber, now's your chance. Motor Toon GP is a slightly odd-ball racing game.</p><p>The tracks are quite innovative as well - with features such as giant loops going into and out of the sky, allowing the player to peer around and check on opponents behind and ahead. The game is filled with typical cartoon-style weapons, and cars can do that cartoon-like bends as they swerve from side to side.</p><p>The game has a 2 Player mode via link cable.</p>"},{"name":"Motor Toon Grand Prix 2","year":1996,"developer":"Sony Computer Entertainment Inc.","url":"psx-chd-roms-m/Motor%20Toon%20Grand%20Prix%202%20%28Europe%29.chd","filesize":262784795,"score":7.7,"genres":"Racing / Driving > Behind view > Direct control > Automobile > Track racing","desc":"<p>In <em>Motor Toon Grand Prix</em> (<em>Motor Toon Grand Prix 2</em> in Japan), all the familiar characters are back in Sony's sequel to Motor Toon Grand Prix. Very much like Mario Kart this game offers multiple worlds and tracks along with crazy characters and plenty of power-ups for some wild racing.</p><p>The available characters are Captain Rock, Princess Jean, Bolbox, Raptor&amp;Raptor, Penguin Bros., Vanity, Billy the Tough and Ching Tong Shang. The colorful worlds are Toon Village, Toon Island 2, Crazy Coaster, Gulliver House 2 and the Haunted Castle.</p><p>The Championship mode takes you through all five tracks. For practice you can select from a single race, time attack and free run. You can even play back your races in the Replay Theater. </p><p>The game includes a second disc for a two-player mode where you can link two separate playstations together. While racing, there are 17 power-ups to take out the competition: Bomb, FireBall, Jump, Missile, Crazy Mushroom, Dynamite, 32t Weight, Stealth Field, Turbo, Big Bigger Biggest, Tiny Tiny Tiny, Oil Can, Pandora's Box, Wonder Clock, Magic Hand, Power Up, Super Shield.</p>"},{"name":"Motorhead","year":1998,"developer":"Digital Illusions CE AB","url":"psx-chd-roms-m/Motorhead%20%28Europe%29.chd","filesize":444374100,"score":7.1,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Sci-fi / futuristic","desc":"<p><em>Motorhead</em> is a racing game set in the near future. Despite it's semi-futuristic setting, the cars require realistic handling. There are 10 different cars and 8 different tracks. They are not all available from the start however; the player has to earn them by winning championships in the Transatlantic Speed League.</p>"},{"name":"Motto Trump Shiyou yo! i-Mode de Grand Prix","year":2002,"developer":"PURE SOUND Inc.","url":"psx-chd-roms-m/Motto%20Trump%20Shiyou%20yo%21%20i-Mode%20de%20Grand%20Prix%20%28Japan%29.chd","filesize":173675485,"score":"","genres":"Simulation > Top-down > Board game > Cards / tiles","desc":"<p>Enjoy the new and improved Trump Shiyouo!<br>This version includes 12 card games and a regional setting that lets you play by specific local rules.<br>Available games include: Daifugo, Shichinarabe, Seven Bridge, Dobon, Page One, Shinkeisuijyaku, Poker, Blackjack, Napoleon, Klondike, Free Cell, and Speed.</p>"},{"name":"Moujya","year":1997,"developer":"Four Winds Inc.","url":"psx-chd-roms-m/Mouja%20%28Japan%29.chd","filesize":119925664,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Falling block puzzle","desc":"<p>Take Money Puzzle Exchanger, sprinkle on some Puyo Puyo, and what do you get? Hey presto, it's Moujya! Players control falling pairs of yen coins, in assorted denominations from 1 through 500. Making change by combining coins into the amount of a higher denominations combines the set of coins into one coin of the larger size, and combining two 500 yen coins makes them disappear. Efficient coin placement can lead to making large combos by letting transformed coins fall into place to make change for a higher denomination.</p><p>This rendition of <em>Moujya</em> gives the original game a bright and colourful makeover and replaces the cast with cute cats.</p>"},{"name":"Mr. Driller","year":2000,"developer":"Namco Limited","url":"psx-chd-roms-m/Mr.%20Driller%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":191716405,"score":7,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>Mr. Driller's world has been covered with mysterious blocks. Armed with only a mighty drill, you'll have to dig your way down to safety before his air supply runs out!</p><p><em>Mr. Driller</em> is a real-time puzzle game that relies solely on quick-thinking and a bit of planning. The gameplay is a combination of Tetris and Boulder Dash: You have to drill down through multi-colored blocks to reach the bottom while avoiding the consequences of reckless drilling; blocks left without a foundation will drop down after a while, potentially crushing Mr. Driller. As the hero's air supply is depleted with time, the player must regularly grab oxygen pick-ups. Some of the blocks are \"X-Blocks\", which take a few tries to drill through and take away a large chunk of the player's air if destroyed. If four or more X-Blocks come in contact with each other, they vanish and leave behind a small blue creature \"Chisokojin\", which grants 765 points when picked up. </p><p>There are two scenarios in the game, the \"2500ft\" and \"5000ft challenge\" (called \"500m\" and \"1000m\" in the Japanese version), which are five and ten levels long respectively.</p>"},{"name":"Mr. Driller G","year":2001,"developer":"Namco Limited","url":"psx-chd-roms-m/Mr.%20Driller%20G%20%28Japan%29.chd","filesize":409821438,"score":"","genres":"Action > Puzzle > Side view > 2D scrolling > Anime / Manga > Arcade > Falling block puzzle > Platform > Direct control","desc":"<p><em>Mr. Driller G</em> is a another entry in Namco's series of arcade puzzle games. As in the previous titles, the main objective is to control a miner character and dig through layers of multi-colored blocks to reach the deeper levels of a shaft and score points. As sections are removed, the whole structure becomes unstable and dangerous. When large pieces of the same color fall on top of each other, they automatically disappear. The miner can be squished by the crumbling stones, or suffocate by lack of oxygen. Air pills and power-ups are found scattered throughout the level, and must be collected to refill the supply, shown as a meter at the right side of the screen. Special brown blocks act as a barrier and have to be drilled several times to break, removing a portion of the remaining air after being destroyed.</p><p>The single player game has three modes. In mission mode, the objective is to reach a specific depth and make as many points as possible, with several levels available to play right from the beginning. In scenario mode, cutscenes play between a linear succession of levels, where each shaft has to be completed to move the plot forwards. In time attack mode, the air pills are replaced with clocks that add a few seconds to the time remaining to reach the bottom of the mine.</p><p>The normal arcade mode has multiplayer variations that can be played locally with two controllers, where the screen is split vertically in the middle showing two separate mine shafts for each player. In Driller Race, the objective is to reach the deep end of a randomly generated shaft as fast as possible, while in Driller Survival the players try to outlast each other in bottomless mines.</p><p>There is an option called Net Driller, that generates passwords to be used on the official site for competitions and global rankings. Support for it was discontinued on January 30th, 2003.</p>"},{"name":"Ms. Pac-Man Maze Madness","year":2000,"developer":"Namco Hometek Inc.","url":"psx-chd-roms-m/Ms.%20Pac-Man%20Maze%20Madness%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":220890456,"score":7.3,"genres":"Action > Diagonal-down > Top-down > Puzzle elements","desc":"<p><em>Ms. Pac-Man Maze Madness</em> is a combination of classic Pac-Man (or in this case, Ms. Pac-Man) action, maze exploration and Sokoban-like puzzle elements. Players take on the role of Ms. Pac-Man and have to save Pac-Land once again. Although the game is in full 3D, players can only move along designated paths.</p><p>The four Wonders, mystical regions separated from the rest of Pac-Land by force fields, contains four Gems of Virtue: Generosity, Truth, Wisdom and Courage, each holding enough power to help keep Pac-Land safe from evil. However, an unknown enemy has transformed the Enchanted Castle into a haunted house, in turn starting a chain reaction of evil all around Pac-Land and the four Wonders. It is up to Ms. Pac-Man to enter the 3D designed worlds of the four Wonders and put the evil to rest for good.</p>"},{"name":"MTV Celebrity Deathmatch","year":2003,"developer":"Coresoft, Inc.","url":"psx-chd-roms-m/MTV%20Celebrity%20Deathmatch%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":29451579,"score":4.6,"genres":"Action > Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>Based on MTV's claymation animation show Celebrity Deathmatch. You play a series of wrestling matches, much in the style of other wrestling games. The twist being, that you play one of various celebrities, such as Marilyn Manson and Carmen Electra. Various weapons appear in the ring during play, such as a chainsaw and crossbow. The game is set out in 6 \"episodes\" of 3 matches each, and you can play either of the celebrities in each match.</p>"},{"name":"MTV Sports: Pure Ride","year":2000,"developer":"Radical Entertainment Inc.","url":"psx-chd-roms-m/MTV%20Sports%20-%20Pure%20Ride%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":281844235,"score":7.1,"genres":"Racing / Driving > Sports > Tricks / stunts > Snowboarding / skiing > Licensed","desc":"<p><em>MTV Sports: Pure Ride</em> is an snowboarding game that features both tricks, stunts and downhill racing. You can choose from a variety of fictional characters and boards to play with which each have their own statistics. The game comes with six game modes: free ride, tour challenge, specialist, stunt, two-player mode and a slope editor. Free Ride lets you be free to do whatever you want without any constraints. Tour challenge allows you to play up to 12 unique events to unlock new levels. Specialist mode focuses on one discipline (half-pipe, big air or slopestyle) each level. In stunt mode there are 18 stages in which you need to perform a variety of tricks to advance. You can challenge a friend in two-player mode and create your own slopes in the editor.</p>"},{"name":"MTV Sports: Skateboarding","year":2000,"developer":"Darkblack Ltd","url":"psx-chd-roms-m/MTV%20Sports%20-%20Skateboarding%20featuring%20Andy%20Macdonald%20%28Europe%29.chd","filesize":293895958,"score":5.8,"genres":"Action > Sports > 3rd-person (Other) > Tricks / stunts > Skateboarding > Licensed","desc":"<p>Take control of Andy Macdonald and other famous skateboarders (total of 30) from MTV Sports as you tear through the skateboard park in full 3D doing tricks with authentic boards and even boarder clothing. Maneuver for the maximum number of tricks in the limited time available. With 60 different tricks to perform, and multiple game modes (including scavenger hunt, stunt moves, and more)</p>"},{"name":"MTV Sports: T.J. Lavin's Ultimate BMX","year":2001,"developer":"Blue Shift, Inc.","url":"psx-chd-roms-m/MTV%20Sports%20-%20T.J.%20Lavin%27s%20Ultimate%20BMX%20%28Europe%29.chd","filesize":244010853,"score":6.1,"genres":"Sports > 3rd-person (Other) > Tricks / stunts > Direct control > Bike / bicycling > Licensed","desc":"<p><em>MTV Sports: T.J. Lavin's Ultimate BMX</em> is an extreme sports game in the style of Tony Hawk's Pro Skater. You ride around on your BMX bike while you pull of the most amazing jumps, grinds and verts.The game comes with a practice mode, two-player challenges and Pro circuit. The challenge mode allows you to play any level to hone your skills. Pro circuit allows you to perform challenges in each level to unlock the next. Two Player challenges include getting the highest score within a time limit and \"turf war\" in which you have to take control of areas of the map. The levels come in three basic types, Street, vert and dirt. Each type requires you to perform different tricks to get some decent scores.</p>"},{"name":"MTV: Music Generator","year":1999,"developer":"Jester Interactive Publishing","url":"psx-chd-roms-m/MTV%20Music%20Generator%20%28USA%29.chd","filesize":265522743,"score":8,"genres":"Simulation > Music / rhythm","desc":"<p>In this game you basically have fun making music. There are modes like music jam and music generator where you can record what you do and even make videos. Never get bored, because there are so many templates for your music.</p>"},{"name":"MTV's Beavis and Butt-Head in Virtual Stupidity","year":1998,"developer":"Viacom New Media"},{"name":"Mujintō Monogatari 4","year":1999,"developer":"Mediamuse"},{"name":"Mummy, The","year":2000,"developer":"Rebellion Developments Ltd.","url":"psx-chd-roms-m/Mummy%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":282769308,"score":5.8,"genres":"Action > Behind view > Egypt (Ancient) > Interwar > Licensed","desc":"<p>Based on the blockbuster movie of the same name. You play the hero, Rick O'Connell, who mistakenly reads from the ancient book of the dead while on an expedition in Egypt, which releases Imhotep from the slumber deep underground. Now you must fix your mistake before time runs out, Egypt gets destroyed by the dead, and you lose your girlfriend.</p>"},{"name":"Muppet Monster Adventure","year":2000,"developer":"Magenta Software Ltd.","url":"psx-chd-roms-m/Muppet%20Monster%20Adventure%20%28Europe%29.chd","filesize":338618164,"score":6.7,"genres":"Action > 3rd-person (Other) > Puzzle elements","desc":"<p><em>Muppet Monster Adventure</em> is a action platform game, best compared with Spyro but with Muppet characters and a Halloween or ghost house setting.</p><p>The story starts with the Muppets attending the reading of Dr. Honeydew recently deceased uncle's will. Instead of going on a holiday to a tropical resort, Robin and the others find themselves at a rundown, creepy castle. Upon arriving Kermit, Miss Piggy, Fozzy and others are captured and now it's up to young Robin (Kermit's nephew) to save the day.</p><p>The gameplay is best described as a collect-and-explore-em-up. You have to explore all the vast areas and collect gems and tokens. The HUD displays how much you have collected in a certain level. To get 100% you really have to find every corner and figure out how to get onto the hard to reach platforms.</p><p>In the first few levels, Robin gains four special powers by collecting special Muppet coins. When all coins of a group are collected, Robin can morph into different types of monsters at certain places. An icon will appear in the top right-hand corner, indicating that you can use this special ability. You can fly or float, climb certain walls, do a karate chop to break obstacles, or gain extra strength to push objects.</p><p>There are lots of large areas to explore. After every few levels the setting is changed. You go from the castle courtyards to large underwater sections, from Arabian nights setting to icy snow levels. During the game, Pepe the King Prawn appears in lots of places to give you gameplay advice. In each level, there also are a lot of mini games to be found, such as a race against an computer opponent to get to a certain location.</p>"},{"name":"Muppet RaceMania","year":2000,"developer":"Traveller's Tales (UK) Ltd.","url":"psx-chd-roms-m/Muppet%20RaceMania%20%28Europe%29.chd","filesize":323288076,"score":7,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Muppet Race Mania</em> lets you race go-karts with the Jim Henson critters, in a game with nods to Super Mario Kart.</p><p>The tracks are based on locations from all six movies, so gamers can expect to find familiar areas; ranging from the skyline of Manhattan, to the cold reaches of Outer Space. Each Muppet movie, 'The Muppet Movie', 'The Great Muppet Caper', 'Muppets Take Manhattan', 'The Muppet Christmas Carol', 'Muppet Treasure Island', and 'Muppets From Space', has 4 related tracks. Therefore, 24 courses in total.</p><p>At the outset there are 8 Muppet drivers available: Kermit, Miss Piggy, Fozzie, Rizzo, Gonzo, Beaker, Rowlf, and Animal. As a reward for winning races more characters are unlocked - with 17 other Muppet stars made available.</p><p>Also included are FMV scenes taken from each movie.</p>"},{"name":"Mushi Tarou","year":2000,"developer":"Victor Interactive Software, Inc.","url":"psx-chd-roms-m/Mushitarou%20%28Japan%29.chd","filesize":399443643,"score":"","genres":"Action > Simulation > 1st-person > Diagonal-down > Fixed / flip-screen > Direct control","desc":"<p><em>Mushi Tarō</em> is best described as a “bug-catcher simulator” – the player basically takes control of a young boy who’s goal is to catch as many different bug species as possible (there are 165 different species total, to be exact).</p><p>After the initial screen, we are presented with a 2D world map, depicting the surroundings in a third person perspective. From here on out, the player controls the young boy by moving him up, down, left or right, trying to find bug icons across the map.</p><p>Once the character reaches one of these icons a certain mini-game ensues, which involves catching the bugs in several distinct fashions: using one of the boy’s hands to clap them against a tree, using both hands to trap them in, having another insect used as bait, using a net to catch flying insects passing by, among several others. Whenever you catch one, it is immediately put into storage, so you never lose insects once they are caught. Every time one of the mini-games is completed, the player will return to the world map and be able to check out information about the species he’s just caught. Also, a balloon will appear next to the icon representing the stage that was just completed, so the player can distinguish between finished and new stages.</p><p>All the mini-games have a certain time limit, and if the depicted number of insects is not caught within that time frame, one of the available 3 attempts will be lost. When all 3 are gone, it’s game over.</p><p>These mini-games comprise the majority of the game per se, and it is by finishing them off one by one that new ones are revealed (by having new bug icons appear on the world map), until all different species are collected. Even though there are 165 different species to collect, during each different trial the player will catch several insects of the same species, thus providing the game with more content by extending gameplay time.</p><p>Speaking of gameplay, while some of the mini-games are quite feasible, others require a certain degree of luck, since in those you have a very limited field of vision (you can’t see the bugs before you execute the commands to catch them), essentially making your moves blind ones.</p><p>The graphics are standard 2D PSX-era graphics, and while there is no music in the game, the sound effects play the role of a fully-fledged soundtrack – from cicada noise to water running down a stream, all sound effects manage to convey the feeling of being surrounded by nature.</p>"},{"name":"Music - Music Creation for the PlayStation","year":1998,"developer":"Jester Interactive Publishing","url":"psx-chd-roms-m/Music%20-%20Music%20Creation%20for%20the%20PlayStation%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":88921226,"score":7.7,"genres":"Simulation > Side view > Music / rhythm","desc":"<p>Music lets the player create complete songs from a library of 850 pre-recorded riffs by pasting them onto a set of tracks. It is similar in some ways to audio editing software on a computer and is surprisingly deep, including controls for panning, volume, and all sorts of effects such as phase, reverb and vibrato.</p><p>Also included in Music is a video effect editor, which can be tweaked to accompany your own masterpieces or bump along in time with any audio CD of your own. Again, a lot of variation can be found in the video editor with controls for text, particle effects, cameras, etc.</p>"},{"name":"My Disney Kitchen","year":2002,"developer":"Disney Interactive, Inc.","url":"psx-chd-roms-m/My%20Disney%20Kitchen%20%28USA%29.chd","filesize":166852952,"score":"","genres":"Simulation > 3rd-person (Other) > Licensed","desc":"<p><em>My Disney Kitchen</em> is a cooking game where you are neighbors with Mickey and Minnie. They will come to your house to eat food, comment on the radio station, look at the decorated kitchen etc. There are many tools you can use to make food and lots of food to work with. You simply cook and decorate your own kitchen with Mickey and Minnie helping you. You can call them and sometimes they will give you tips on how to make things like applesauce and smoothies. They will also give you ingredients if you run out. There are real life recipes from Family Fun magazine that you can make in your own kitchen.</p><p>Mickey and Minnie won't eat everything you make. There are two stars on the oven and counter in your kitchen to make cake and breakfast for the two of them. In the Good Morning Griddle section, you can make eggs, bacon, and pancakes for Mickey and Minnie. You have to put them on the griddle and flip them over when needed. You can also put maple syrup and butter on them for flavor. In Bake-A-Cake, you can bake, mix, frost, and decorate a cake for Mickey and Minnie. You can save the game on your memory card or on your computer depending on what version you are playing. You can also watch demos, where you can learn to make meals.</p>"},{"name":"My Dream: On Air ga Matenakute (Disk 1)","year":1997,"developer":"Nihon Create","url":"psx-chd-roms-m/My%20Dream%20-%20On%20Air%20ga%20Matenakute%20%28Japan%29%20%28Disc%201%29.chd","filesize":311776721,"score":"","genres":"Adventure > Simulation > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel","desc":"<p><em>My Dream</em> is an simulation game focusing on the world of voice-actors. There are eight different heroines in the game, and each has been voiced by three different actresses. Voice actress for each heroine can be set up at the beginning of a new game, right after entering the player's name. The game doesn't feature default name for the player, and other characters will address you by the name you enter (both Japanese and Latin letters are available during name creation). The player focuses on a single heroine and by setting up a weekly schedule for her, the game advances as a visual novel with selectable dialogue and action choices at certain locations and during certain conversations. The weekly schedule is set by selecting locations on the map you wish to visit, one location per day. Different location offer different actions and participation in various events and meeting and talking to other characters. Each heroine has a default set of attributes which change over time, such as physical strength, self-confidence, stress, speaking skill, and other. During gameplay, static character images with mild animations such as talking, are glued over blurred real-life photos which are used as backgrounds.</p><p>Heroines with selectable voice-actresses include:</p><ul><li>Nao Utsumi (voiced by Naoko Takano, Nao, or Miki Nagasawa)</li><li>Haruka Kudou (voiced by Tarako, Rika Matsumoto, or Kotono Mitsuishi)</li><li>Izumi Watanabe (voiced by Mayumi Tanaka, Noriko Hidaka, or Chisa Yokoyama)</li><li>Reika Shirouchi (voiced by Ai Orikasa, Naoko Matsui, or Rika Matsumoto)</li><li>Miyuki Yoshizawa (voiced by Kikuko Inoue, Miwako Hatayama, or Yuriko Fuchizaki)</li><li>Aya Takai (voiced by Mayumi Tanaka, Aya Hisakawa, or Akiko Hiramatsu)</li><li>Kurumi Kawai (voiced by Tarako, Yuriko Fuchizaki, or Yuuko Miyamura)</li><li>Erina Saitoh (voiced by Mika Nakai, Manami Komori, or Naoko Matsui)</li></ul>"},{"name":"My Dream: On Air ga Matenakute (Disk 2)","year":1997,"developer":"Nihon Create","url":"psx-chd-roms-m/My%20Dream%20-%20On%20Air%20ga%20Matenakute%20%28Japan%29%20%28Disc%202%29.chd","filesize":364858752,"score":"","genres":"Adventure > Simulation > 1st-person > Fixed / flip-screen > Anime / Manga > Visual novel","desc":"<p><em>My Dream</em> is an simulation game focusing on the world of voice-actors. There are eight different heroines in the game, and each has been voiced by three different actresses. Voice actress for each heroine can be set up at the beginning of a new game, right after entering the player's name. The game doesn't feature default name for the player, and other characters will address you by the name you enter (both Japanese and Latin letters are available during name creation). The player focuses on a single heroine and by setting up a weekly schedule for her, the game advances as a visual novel with selectable dialogue and action choices at certain locations and during certain conversations. The weekly schedule is set by selecting locations on the map you wish to visit, one location per day. Different location offer different actions and participation in various events and meeting and talking to other characters. Each heroine has a default set of attributes which change over time, such as physical strength, self-confidence, stress, speaking skill, and other. During gameplay, static character images with mild animations such as talking, are glued over blurred real-life photos which are used as backgrounds.</p><p>Heroines with selectable voice-actresses include:</p><ul><li>Nao Utsumi (voiced by Naoko Takano, Nao, or Miki Nagasawa)</li><li>Haruka Kudou (voiced by Tarako, Rika Matsumoto, or Kotono Mitsuishi)</li><li>Izumi Watanabe (voiced by Mayumi Tanaka, Noriko Hidaka, or Chisa Yokoyama)</li><li>Reika Shirouchi (voiced by Ai Orikasa, Naoko Matsui, or Rika Matsumoto)</li><li>Miyuki Yoshizawa (voiced by Kikuko Inoue, Miwako Hatayama, or Yuriko Fuchizaki)</li><li>Aya Takai (voiced by Mayumi Tanaka, Aya Hisakawa, or Akiko Hiramatsu)</li><li>Kurumi Kawai (voiced by Tarako, Yuriko Fuchizaki, or Yuuko Miyamura)</li><li>Erina Saitoh (voiced by Mika Nakai, Manami Komori, or Naoko Matsui)</li></ul>"},{"name":"My Garden","year":1999,"developer":"Technosoft Co., Ltd.","url":"psx-chd-roms-m/My%20Garden%20%28Japan%29.chd","filesize":161468969,"score":"","genres":"Simulation > 3rd-person (Other) > Isometric > Anime / Manga > Meditative / Zen > Life / social simulation > Direct control","desc":"<p><em>My Garden</em> is, just like it says on the tin, a game about gardening.</p><p>You are a young girl who is sent off to your grandmother's home to help her out with her gardening, as her age is making it more difficult for her to tend to it herself. Much of the gameplay is very reminiscent of Harvest Moon; time passes in days &amp; hours, and players have a life gauge which limits the amount of work they can do in the course of one game day, but it can be slightly replenished by eating sweets or resting on benches. The player character can also interact with other people in the neighborhood, who occasionally come to visit the garden. Indoor sequences are presented in an isometric viewpoint, while outdoor gardening sequences are shown from a top-down angle.</p>"},{"name":"Myst","year":1995,"developer":"Cyan Productions","url":"psx-chd-roms-m/Myst%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":360297576,"score":6.9,"genres":"Adventure > 1st-person > Graphic adventure > Puzzle elements > Point and select > Fantasy","desc":"<p>You have just stumbled upon a most intriguing book, a book titled Myst. You have no idea where it came from, who wrote it, or how old it is. Reading through its pages provides you with only a description of an island world. But it's just a book, isn't it? As you reach the end of the book, you lay your hand on a page. Suddenly your own world dissolves into blackness, replaced with the island world the pages described. Now you're here, wherever here is, with no option but to explore.</p><p><em>Myst</em> is a first-person point-and-click adventure where the player controls a character known as The Stranger. Magically transported into the world described in the book, he needs to explore Myst Island and solve its mysteries. The game is presented as a series of static scenes where the player acts with the environment by clicking and manipulating objects. There are no enemies and it is not possible to die. Through Myst Island, the game is further divided into mini-worlds set in different ages accessed through different books. </p><p>The game's interface is reduced to a single cursor for navigation and interaction. Rather than collecting items and using them to solve puzzles, the player must gather subtly placed clues and manipulate complex mechanical devices in order to advance in the game. The world of <em>Myst</em> is mostly uninhabited, and the game has very few live-action scenes with characters and dialogue.</p>"},{"name":"Mystic Ark - Maboroshi Gekijou","year":1999,"developer":"Produce Co., Ltd.","url":"psx-chd-roms-m/Mystic%20Ark%20-%20Maboroshi%20Gekijou%20%28Japan%29.chd","filesize":28932405,"score":"","genres":"Adventure > 3rd-person (Other) > Graphic adventure > Puzzle elements > Direct control > Fantasy","desc":"<p><em>Mystic Ark: Maboroshi Gekijo</em> is an adventure game where you choose from one of two protagonists, Alice and Remeer, who suddenly find that all the people of the town have disappeared. They are then greeted by a mysterious scarecrow named Mr. Silverfingertips who entrusts the player to find the 7 Arks spread across several storybook inspired worlds. There, they must solve challenges and best monsters to collect the Arks and return the people to the town.</p><p>Each protagonist sports their own unique abilities and playstyles. Remeer excels in combat and often solves challenges more directly while Alice, who is more friendly, can sway characters to help her. There is also a third playable protagonist that you can unlock in the game.</p>"},{"name":"Mystic Mind: Yureru Omoi (Disk 1)","year":1998,"developer":"Family Soft Co., Ltd.","url":"psx-chd-roms-m/Mystic%20Mind%20-%20Yureru%20Omoi%20%28Japan%29%20%28Disc%201%29.chd","filesize":455683955,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Dating simulation > Visual novel > Romance","desc":"<p><em>Mystic Mind: Yureru Omoi</em> is a love simulation visual novel adventure game taking place in a private high school. The player, who can be a male or a female student, will meet different characters based on the selected protagonist. The game uses the calendar days to progress time in the story and features multiple endings and paths based on player's actions and dialogue choices.</p>"},{"name":"Mystic Mind: Yureru Omoi (Disk 2)","year":1998,"developer":"Family Soft Co., Ltd.","url":"psx-chd-roms-m/Mystic%20Mind%20-%20Yureru%20Omoi%20%28Japan%29%20%28Disc%202%29.chd","filesize":486189665,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Dating simulation > Visual novel > Romance","desc":"<p><em>Mystic Mind: Yureru Omoi</em> is a love simulation visual novel adventure game taking place in a private high school. The player, who can be a male or a female student, will meet different characters based on the selected protagonist. The game uses the calendar days to progress time in the story and features multiple endings and paths based on player's actions and dialogue choices.</p>"}]