[{"name":"N.GEN Racing","year":2000,"developer":"Curly Monsters Ltd","url":"psx-chd-roms-n/N-Gen%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":397864183,"score":7.1,"genres":"Action > Racing / Driving > 1st-person > 3rd-person (Other) > Flight / aviation","desc":"<p><em>N.GEN Racing</em> is a racing game for the Playstation. Instead of a car, like in most racing games, you control a Fighter Jet Plane.</p><p>The game features two game modes: arcade and N.GEN. In the arcade mode you play a series of championships. Winning a championship grants you access to a higher one. In N.GEN mode you start with a poor plane and have to earn money to upgrade it so you can participate in more challenging and more rewarding races. You can choose between arcade or professional controls.</p><p>The planes can shoot various weapons, such as missiles, rockets and guns at the opponents. There are 38 jets to fly in on 14 different tracks.</p><p>In Two player mode you can play Powerball. Here each player has to try and pick up the ball and score points by flying through drones.</p>"},{"name":"N2O Nitrous Oxide","year":1998,"developer":"Gremlin Interactive Limited","url":"psx-chd-roms-n/N2O%20-%20Nitrous%20Oxide%20%28USA%29.chd","filesize":196964375,"score":7.1,"genres":"Action > 3rd-person (Other) > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>N2O Nitrous Oxide's</em> gameplay is in many ways similar to the arcade classic Tempest. The game involves flying a ship down a tunnel. You can move left and right along the tunnel's walls, and fire into the tunnel. You have a standard blaster, and can pick up a range of special weapons along the way. You also can pick up a 'smart bomb' type weapon, that launches a firewall down the tunnel.</p><p>Enemies are all based on real world insects, and range from flies, though to mosquitos, scorpions and spiders. Each tunnel introduces one new enemy. After each tunnel has been cleared you have to defeat a larger version of that tunnel's new enemy before you can leave.</p><p>Mushrooms can be collected off the tunnel walls. Once you have collected the required amount, you can enter a bonus level. These consist of open tunnels, containing two items: eggs, and spinning blades. The objective is to avoid the blades, and shoot as many eggs as you can. When you shoot an egg you get points, however the ship also speeds up making it harder to avoid the blades.</p><p>At the end of the game there is a final mutant boss insect to defeat.</p>"},{"name":"Nagano Winter Olympics '98","year":1997,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"psx-chd-roms-n/Nagano%20Winter%20Olympics%20%2798%20%28Europe%29.chd","filesize":161174391,"score":6.4,"genres":"Sports > Behind view > Tricks / stunts > Olympiad / mixed sports > Snowboarding / skiing > Licensed","desc":"<p>The official game of the XVIII Olympic Winter Games held in Nagano, Japan, including 12 events such as Downhill, Giant Slalom, K-90 and K-120 Ski Jumping, Freestyle Aerials, Snowboard Halfpipe (only in the N64 version) and Slalom (in their Olympic debut), 500m and 1500m Speed Skating, Bobsleigh, Luge and Curling. Up to four players can choose one of 16 nations and compete in Olympic (play for the medals) or Championship mode (for the points, in a Decathlon-style competition).</p>"},{"name":"Namco Museum Encore","year":1997,"developer":"Namco Limited","url":"psx-chd-roms-n/Namco%20Museum%20Encore%20%28Japan%29.chd","filesize":311807022,"score":"","genres":"Compilation","desc":"<p>This is the final PlayStation installment of the <em>Namco Museum</em> series and probably the most eclectic selection of Namco arcade games from the early eighties to the nineties.</p><ul><li>King &amp; Balloon (1981): man a cannon on a castle wall and prevent a horde of balloons (Galaxian style) from kidnapping your king.</li><li>Motos (1985): top-down bumper car game in which you have to push your opponents off the game board.</li><li>Sky Kid (1985): a side-scrolling flying shooter starring the Red Baron</li><li>Rolling Thunder (1986): the arcade version of the side-scrolling espionage shooter.</li><li>Wonder Momo (1987): a platformer with the girl Momo, who has to fight back an alien invasion.</li><li>Rompers (1989): collect keys in different mazes while avoiding cute monsters (similar to Pacman)</li><li>Dragon Saber (1990): a vertical shooting game with a dragon instead of a plane.</li></ul><p>Additionally, instruction cards, character sketches and various advertising info have been included. The package also contains a set of memory card labels with the Namco logo and drawings from the games. It has only been released in Japan.</p>"},{"name":"Namco Museum Vol. 1","year":1995,"developer":"Namco Limited","url":"psx-chd-roms-n/Namco%20Museum%20Vol.%201%20%28Europe%29.chd","filesize":109386660,"score":7.5,"genres":"Compilation","desc":"<p>Included in this package are:</p><ul><li>Bosconian</li><li>Galaga</li><li>New Rally-X</li><li>Pac-Man</li><li>Pole Position</li><li>Rally-X</li><li>Toy Pop</li></ul><p>Not only can you play these games, but you can also learn about them in the virtual museum mode included on the disc, including their history, art and the original arcade cabinets.</p>"},{"name":"Namco Museum Vol. 2","year":1996,"developer":"Namco Limited","url":"psx-chd-roms-n/Namco%20Museum%20Vol.%202%20%28Europe%29.chd","filesize":190489563,"score":6.9,"genres":"Compilation","desc":"<p>The second in <em>Namco's Museum</em> series brings together the following games:</p><ul><li>Super Pac-Man</li><li>Xevious</li><li>Mappy</li><li>Grobda</li><li>Dragon Buster</li><li>Gaplus</li></ul><p>There are also some extras in the museum section, including never before seen pictures and text of the development of each title.</p>"},{"name":"Namco Museum Vol. 3","year":1996,"developer":"Namco Limited","url":"psx-chd-roms-n/Namco%20Museum%20Vol.%203%20%28Europe%29.chd","filesize":199335616,"score":6.5,"genres":"Compilation","desc":"<p>Namco included the following games in part three:</p><ul><li>Ms. Pacman</li><li>Galaxian</li><li>Dig Dug</li><li>Pole Position 2</li><li>Phozon</li><li>The Tower of Druaga</li></ul><p>Once again you can also check out info and pics of each game in the museum.</p>"},{"name":"Namco Museum Vol. 4","year":1996,"developer":"Namco Limited","url":"psx-chd-roms-n/Namco%20Museum%20Vol.%204%20%28Europe%29.chd","filesize":412947639,"score":6.3,"genres":"Compilation","desc":"<p>This compilation includes the following games:</p><ul><li>Assault</li><li>Genpei Tōma Den</li><li>Ordyne</li><li>Pac-Land</li><li>The Return of Ishtar</li></ul>"},{"name":"Namco Museum Vol. 5","year":1997,"developer":"Namco Limited","url":"psx-chd-roms-n/Namco%20Museum%20Vol.%205%20%28Europe%29.chd","filesize":250241316,"score":6.5,"genres":"Action > Compilation > Side view > Top-down > Isometric > Platform > Shooter > Fantasy > Sci-fi / futuristic","desc":"<p>This Namco Museum series member combines Pac-Mania, Dragon Spirit (which is a combination of 1942 and Xevious), Metro-Cross (a type of skateboarding action game), Baraduke (where you control the hero through many caverns filled with monsters) and Legend of Valkyrie, which combined classic gameplay with improved scaling effects.</p><p>And as usual, you can find some great info on each title in the museum.</p>"},{"name":"Namco Soccer: Prime Goal","year":1995,"developer":"Namco Limited","url":"psx-chd-roms-n/Namco%20Soccer%20Prime%20Goal%20%28Europe%29.chd","filesize":90807790,"score":"","genres":"Sports > 3rd-person (Other) > Isometric > Football (European) / Soccer > Licensed","desc":"<p><em>J-League Prime Goal EX</em> is one of the first football games in Sony's console, following previous appearances in the SNES, <em>Prime Goal</em> is a straightforward action game with simple arcade controls. While the Japanese version features all 14 JLeague teams and fully licensed players, the European version features the same number of national teams with fictional players, all from Europe. Game modes include friendly match, league and cup knockout modes, as well as an all-star game where the player chooses his stars from the best in the selected zone.</p><p>Graphically, the game uses a polygonal playing field, while players are represented using sprites, and gameplay features a combination of the face buttons to perform actions (passing, lobbing, shooting, tackling and so on) with shoulder buttons to add swerve to the ball, change team tactics on the fly or pushing the camera backwards to find an open team mate.</p><p>While gameplay is fast and simple, it has three quirks: first, unlike most modern offerings, the AI does not set up the target players for passes and crosses, making the player control the target player as soon as the ball is released in order to place them in the best position to complete the play, and also unlike most other games, the players are able to run freely off-bounds, allowing the player to capture a free ball close to the touchlines without risking touching it for a throw-in. The final main gameplay feature can be seen when the ball carrier faces a defender, as the camera quickly changes to behind the forward, as he tries to trick the defender into going the wrong way as the defender tries to steal the ball by predicting where will the forward move, with the winner of the challenge being able to run a few meters unopposed.</p>"},{"name":"Namco: Anthology 1","year":1998,"developer":"Tose Co., Ltd.","url":"psx-chd-roms-n/Namco%20Anthology%201%20%28Japan%29.chd","filesize":154363397,"score":"","genres":"Compilation","desc":"<p><em>Namco Anthology 1</em> is a compilation of arcade and console games by Namco, which differs from the Museum releases in that it contains arranged versions of all the games included, with redone graphics, sounds and features.</p><p>This edition includes:</p><ul><li>Babel</li><li>Haō no Tairiku</li><li>Star Luster</li><li>Wrestleball</li></ul>"},{"name":"Namco: Anthology 2","year":1998,"developer":"Tose Co., Ltd.","url":"psx-chd-roms-n/Namco%20Anthology%202%20%28Japan%29.chd","filesize":235748251,"score":"","genres":"Compilation > Falling block puzzle","desc":"<p><em>Namco Anthology 2</em> is a compilation of arcade and console games by Namco, which differs from the Museum releases in that it contains arranged versions of all the games included, with redone graphics, sounds and features.</p><p>This edition includes:</p><ul><li>King of Kings</li><li>Pac-Attack</li><li>Power Golf 2</li><li>Valkyrie no Bōken: Toki no Kagi Densetsu</li></ul>"},{"name":"Nanatsu no Hikan (Disc 1)","year":1996,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-n/Nanatsu%20no%20Hikan%20%28Japan%29%20%28Disc%201%29.chd","filesize":359143284,"score":"","genres":"Adventure > 1st-person > Contemporary > Detective / mystery","desc":"<p>In this mystery adventure game, a young man called Ippei has been given the key to the seven mansions his uncle wants to restore and turn into a resort. But these mansions were never fully explored and his uncle suspects a great treasure to be hiding somewhere on the premise, and Ippei is tasked to look into it. However, he is warned that there may be dangerous people lurking around. The game uses 3D graphics and a first-person perspective to let the player full explore the mansion up close. The more Ippei explores the mansion, the more he will find out about his family's history. Ippei can pick up and use various items, talk to other characters or simply think out loud to give clues to the player. While there are no action elements, the protagonist has a health bar which can be decreased if he is not careful and activates various traps that lie hidden throughout the mansions.</p>"},{"name":"Nanatsu no Hikan (Disc 2)","year":1996,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-n/Nanatsu%20no%20Hikan%20%28Japan%29%20%28Disc%202%29.chd","filesize":336110221,"score":"","genres":"Adventure > 1st-person > Contemporary > Detective / mystery","desc":"<p>In this mystery adventure game, a young man called Ippei has been given the key to the seven mansions his uncle wants to restore and turn into a resort. But these mansions were never fully explored and his uncle suspects a great treasure to be hiding somewhere on the premise, and Ippei is tasked to look into it. However, he is warned that there may be dangerous people lurking around. The game uses 3D graphics and a first-person perspective to let the player full explore the mansion up close. The more Ippei explores the mansion, the more he will find out about his family's history. Ippei can pick up and use various items, talk to other characters or simply think out loud to give clues to the player. While there are no action elements, the protagonist has a health bar which can be decreased if he is not careful and activates various traps that lie hidden throughout the mansions.</p>"},{"name":"Nanatsu no Hikan (Disc 3)","year":1996,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-n/Nanatsu%20no%20Hikan%20%28Japan%29%20%28Disc%203%29.chd","filesize":392195065,"score":"","genres":"Adventure > 1st-person > Contemporary > Detective / mystery","desc":"<p>In this mystery adventure game, a young man called Ippei has been given the key to the seven mansions his uncle wants to restore and turn into a resort. But these mansions were never fully explored and his uncle suspects a great treasure to be hiding somewhere on the premise, and Ippei is tasked to look into it. However, he is warned that there may be dangerous people lurking around. The game uses 3D graphics and a first-person perspective to let the player full explore the mansion up close. The more Ippei explores the mansion, the more he will find out about his family's history. Ippei can pick up and use various items, talk to other characters or simply think out loud to give clues to the player. While there are no action elements, the protagonist has a health bar which can be decreased if he is not careful and activates various traps that lie hidden throughout the mansions.</p>"},{"name":"Naniwa Wangan Battle","year":1998,"developer":"MTO Co., Ltd.","url":"psx-chd-roms-n/Naniwa%20Wangan%20Battle%20-%20Tarzan%20Yamada%20%26%20AutoSelect%20Sawa%20Kyoudai%20%28Japan%29.chd","filesize":164472227,"score":"","genres":"Racing / Driving > Behind view > Anime / Manga > Direct control > Automobile > Street racing > Contemporary > Japan (Modern/Futuristic)","desc":"<p><em>Naniwa Wangan Battle</em> is a street racing game set in Osaka, Japan. The game features a variety of the usual poster cars of Japanese street racing of the mid 1990s, albeit without their real names or badges. The game contains a main “scenario” mode which features a light story between races, and your winnings can be spent on upgrades to your car. The game boasts the supervision of both Eiji “Tarzan” Yamada, a popular Japanese racing driver, as well as of Auto Select, a tuning and racing company from Osaka. As if that’s not enough star power, the game also presents real-life Kansai radio station FM802, along with the voice of Nakajima Hiroto, one of the station’s DJs.</p>"},{"name":"NanoTek Warrior","year":1997,"developer":"Tetragon","url":"psx-chd-roms-n/NanoTek%20Warrior%20%28Europe%29.chd","filesize":415708744,"score":6.7,"genres":"Action > 3rd-person (Other) > Shooter > Sci-fi / futuristic","desc":"<p>In the 23rd century, nanotechnology does man’s bidding. Anything from curing disease to feeding the worlds population has been taken care of by these tiny wondrous nanobots. But what happens when they become self-aware and decided to destroy their oppressors? To save the human race from extinction by its own creation, you are put in control of a new breed of nano war machine designed to fight – and win – this war. Enter NanoTek Warrior.</p><p>A ground-based shoot-em-up by design, the game employs the use of jumping, banking, and strafing as you move forward through 3D tube-like levels. The game is seem from a third-person perspective behind the ship. Some areas place you outside and some inside, but the majority of the game takes place rotating around tubes. This gameplay only differs slightly in boss levels, that allow you to rotate around a central point with no forward motion.</p><p>You can obtain different power-ups including special weapons, health bonuses and extra lives as you play through the game’s 9 levels. Each level is divided into 2 stages, one on tubes and a boss fight afterwards.</p>"},{"name":"Nante! Tantei Idol: The Jigsaw Puzzle","year":2002,"developer":""},{"name":"NASCAR 2000","year":1999,"developer":"Stormfront Studios","url":"psx-chd-roms-n/NASCAR%202000%20%28USA%29.chd","filesize":419306503,"score":6.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>This NASCAR stock car racing simulation is a sequel of sorts to NASCAR Revolution. The game features 18 real world tracks plus several fantasy road courses, and 30 active NASCAR drivers plus some \"legend\" drivers.</p><p>Game modes include quick races, full weekend events, a full or abridged championship series, a Race Against the King mode where you race against Richard Petty in a series of events, and multiplayer support for up to 4 players. Updated physics and AI help the game aim for more realism.</p>"},{"name":"NASCAR 2001","year":2000,"developer":"Black Box Games","url":"psx-chd-roms-n/NASCAR%202001%20%28USA%29.chd","filesize":203323309,"score":7.3,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Stunning 3D graphics and visual effects, and real Nascar cars, tracks and lifestyle put you in the driver's seat.  </p><p>Key FeaturesUses a game engine designed for the PS2 with enhanced graphics, car physics, and challenging computer AI model. </p><p>Stunning Damage Physics and Effects.</p><p>Race at Daytona: For the first time, the world center of racing appears in a Nascar Playstation 2 videogame.  Race against the pact in the Daytona 500!</p><p>Authentic Nascar Racing:  The real drivers, cars, teams, tracks, sponsers, and rules.  </p><p>Top Drivers: Over 30 drivers including Jeff Gordon, Dale Earnhardt, Tony Stewart, Dale Jarrett, Bobby Labonte, Mark Martin, Dale Earnhardt Jr and Bobby Hamilton.</p><p>More Tracks: Daytona and 13 other Nascar tracks with both day and night racing.</p><p>Full or \"Track Pack\" Season: Race a full or half Nascar season or choose to compete on track packs: race just on short tracks, road courses, speedways or superspeedways.</p>"},{"name":"NASCAR 98","year":1997,"developer":"Stormfront Studios","url":"psx-chd-roms-n/NASCAR%2098%20%28USA%29.chd","filesize":303660238,"score":7.4,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>With top-of-the-line racing simulation NASCAR 98 allows you to race with 24 drivers including legend Dale Earnhardt and 10 official tracks and extra 6 fantasy tracks. This NASCAR game allows you to hear all screeching burnouts, oiled skids, and emergency vehicles, or listen to provided music. This includes the modes season, Arcade, and new custom racing(control opponents,laps,gas gauge, and just about anything.).</p>"},{"name":"NASCAR 98 (Collector's Edition)","year":1997,"developer":"Stormfront Studios","url":"psx-chd-roms-n/NASCAR%2098%20Collector%27s%20Edition%20%28USA%29.chd","filesize":299700239,"score":"","genres":"Racing / Driving > Simulation > Special edition > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Extra content / game > Physical extras > Licensed","desc":"<p>This collector's edition celebrates the 50th anniversary of NASCAR. The game is completely identical to NASCAR 98, except that Darlington has been added to the list of tracks and the racing legend Richard Petty has been added to the driver's roster, along with the obvious cover art changes. The game also comes with a NASCAR 50th anniversary key chain.</p>"},{"name":"NASCAR 99","year":1998,"developer":"Stormfront Studios","url":"psx-chd-roms-n/NASCAR%2099%20%28USA%29.chd","filesize":373375520,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>NASCAR 99</em>, the arcade-style racing game from EA and Stormfront Studios. In addition to 2-player simultaneous racing the game featured 37 officially licensed cars and 17 tracks, as well as the voices of Bob Jenkins and Benny Parsons commentary.</p><p>Using the Andretti Racing engine, NASCAR 99 was EAs first entry into NASCAR racing for the Nintendo 64 and PlayStation.</p>"},{"name":"NASCAR 99: Legacy","year":1999,"developer":"Stormfront Studios","url":"psx-chd-roms-n/NASCAR%2099%20Legacy%20%28USA%29.chd","filesize":378582399,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>THE LEGACY IS IN OUR BLOOD<br>Features * Dale Earnhardt, Jr. joins the field of 37 NASCAR® Drivers * 18 Licensed NASCAR tracks–now including Miami-Homestead Speedway * Authentic head-to-head NASCAR Racing * 2 Player Split-Screen Racing–Race Father Vs. Son * Championship Season mode * Exclusive Two-Man Booth Featuring Bob Jenkins and Benny Parsons * 24 Hi-Res Cars on the Track</p>"},{"name":"NASCAR Heat","year":2000,"developer":"Monster Games, Inc.","url":"psx-chd-roms-n/NASCAR%20Heat%20%28USA%29.chd","filesize":489730487,"score":7.3,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>NASCAR HEAT has four different modes of play to choose from, based on the 2000 NASCAR Winston Cup Season. The game offers Single Race and Championship Season. These modes allow the player to choose their favorite driver and race against a full field of cars at one or all of the NASCAR tracks. Race the Pro and Beat the Heat Challenge are two modes of play that separate this product from the competition. Beat the Heat provides the player with a number of challenges designed around scenarios that actually occur in NASCAR. These challenges deal with everything from the best way to pass at a particular track, to pit strategy for tire changes. Race the Pro offers the player the opportunity to race against Laps actually driven by some of NASCAR's biggest stars.</p>"},{"name":"NASCAR Racing","year":1996,"developer":"Papyrus Design Group, Inc.","url":"psx-chd-roms-n/NASCAR%20Racing%20%28USA%29.chd","filesize":302858746,"score":6.8,"genres":"Racing / Driving > Simulation > Sports > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Sierra and Papyrus bring over their NASCAR series to the Playstation.</p><p>The game presents three different game modes: Arcade Race, Simulation Race, and Simulation Testing. While the Arcade Race mode let's the player jump right into the fray after choosing their difficulty level (either rookie,veteran, or ace), the Simulation Race mode features a lot more customization options for the player to take into consideration.</p><p>Simulation Race mode lets the player tweak their vehicles fuel usage, cross weights, tire pressure, the alignment of the camber and stagger of the wheels, the aerodynamics (air dam and spoiler), the shocks, and the gear ratios. The game also offers a Simulation Testing mode to let the player test these settings on the race track without the interference of other drivers.</p><p>Both Arcade and Simulation Race modes let the player compete in a full 31-race championship season. After each race, players earn points depending on which position they placed in, which then affects their place in the season standings.</p><p>The game features 16 licensed NASCAR tracks such as the Red Rock Raceway and the Bull Run Raceway. 3 of these tracks also have a nighttime version. There is also 2 fantasy tracks available to race on. The game also features 20 real NASCAR drivers from the 1996 season, and their respective car details.</p><p>Options include having either automatic or manual shifting, setting the race length (either 2, 5, 10, 25, 50 or 100% of the laps depending on the track), setting the opponents' strength (between 80% and 120%), setting the car damage to either arcade, full, or off, and turning on or off braking help, yellow flags, and the pace lap.</p>"},{"name":"NASCAR Rumble","year":2000,"developer":"Electronic Arts Redwood Shores Studio","url":"psx-chd-roms-n/NASCAR%20Rumble%20%28USA%29.chd","filesize":141375049,"score":7.5,"genres":"Racing / Driving > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>NASCAR Rumble is an arcade style racing game. 18 unique on and off- road race courses are set in 6 areas. Indestructible cars and trucks compete to win using power-ups and lots of rough contact. </p><p>A variety of special cars such as: the chicken truck, bulldozer, golf cart, jet engine car, hot rod, are unlocked as the game progresses. Every car has three versions, adding more power and style. Numerous power ups include: The Twister, Rain Cloud, Nitro, Big Hammer, Invincible, Freeze Steering, Oil, and Bad Gas.</p><p>The difficulty of the game ranges from \"Kid Mode\" to very difficult. Powerups can be disabled, few, normal, or many. Team racing is available in both single and two player split screen. </p>"},{"name":"NASCAR Thunder 2002","year":2001,"developer":"Black Box Games","url":"psx-chd-roms-n/NASCAR%20Thunder%202002%20%28USA%29.chd","filesize":144994079,"score":"","genres":"Racing / Driving > Simulation > Sports > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>THE MOST CARS, STARS, AND TRACKS * RACE THE ORIGINAL DAYTONA BEACH Exclusive to EA SPORTS, blast along the beach that started it all. * 23 NASCAR WINSTON CUP SERIES TRACHS & 13 FANTASY ROAD COURSES DAYTONA to Sears Point--For the first time in history, only EA SPORTS delivers every track on the circuit * OVER 30 NASCAR STARS Gordon, Earnhardt Jr., Waltrip, Labonte, Stewart, Marlin, Jarrett, Petty, and more. * EARN THUNDER CARDS Unlock tracks and offensive and defensive power-ups like better fuel mileage, horsepower, tire durability, and braking power. * CHAMPIONSHIP CAREER Create a driver and a legendary career-See if you can triumph as NASCAR Winston Cup Series Champion and defend your title over multiple seasons.</p>"},{"name":"NASCAR Thunder 2003","year":2002,"developer":"Image Space Inc.","url":"psx-chd-roms-n/NASCAR%20Thunder%202003%20%28USA%29.chd","filesize":156546241,"score":7.8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>NASCAR Thunder 2003 simulates the NASCAR driver experience.  Dozens of locations are available, each with several alternate tracks.  All the big-name drivers of the present, and a few of the past, are available to choose from, or you can create your own driver and car.  Simulate a season, or even a full 20-year career complete with sponsorship deals and car improvements along the way.  Moments of the Race places you in real-life racing situations, asking you to either duplicate reality's outcome, or improve upon it.  Or you can race against up to three people.  The choice is yours.</p>"},{"name":"NASCAR Thunder 2004","year":2003,"developer":"EA Tiburon","url":"psx-chd-roms-n/NASCAR%20Thunder%202004%20%28USA%29.chd","filesize":275162203,"score":7.2,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>You can race on a variety of courses, from twenty three real world Winston Cup courses, twelve road courses and eleven fantasy courses, including a costal town and a busy city. There are sixty challenges in all.</p><p>When racing, what you do on the circuit affects future races. Ram someone into the wall or cause someone to spin out, and they'll remember. They'll try to get back at you in a future race. Help someone out, by clearing a path or sharing the draft, and they'll return the favor to you. Grudges and alliances are tracked throughout your career, so the more you piss someone off, the more likely they'll try to harm you.</p><p>Like the Football Camp mode in Madden NFL 2004, the Speed Zone is comprised of different many games that will earn you points and increase your skill, such as passing and drafting, blocking and drifting.</p><p>With the Career mode, you can go through a full twenty seasons before having to retire. You manage everything, from your pit crew and car parts to your sponsors and research and development.</p><p>There are seventy officially licensed drivers and over 180 vehicle skins. If nothing suits you, create your own driver and car and see how you do.</p><p>As in every 2004 edition of EA Sports console games, you'll find the EA Sports Bio, which is a career tracker that tracks your stats over every EA Sports game. The more games you play and the longer you play, the higher your level and the more rewards you can unlock.</p><p>Tune your car right and drive like a pro, and you may just make it to the finish line.</p>"},{"name":"Natsuiro Celebration","year":2000,"developer":"HuneX Co., Ltd."},{"name":"Natsuiro Kenjutsu Komachi (Disc 1)","year":2000,"developer":"NEC Interchannel, Ltd.","url":"psx-chd-roms-n/Natsuiro%20Kenjutsu%20Komachi%20%28Japan%29%20%28Disc%201%29.chd","filesize":367616698,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Dating simulation > Japanese-style adventure > Visual novel","desc":"<p><em>Natsuiro Kenjutsu Komachi</em> is a mix of visual novel and simulation adventure game where the player takes on a role of a captain of the high school athletic team. The game cycles through weeks, letting the player decide training activities to perform which in turn will increase his skills and character stats. As in other dating simulation games, player's stats may affect his conversation with girls he meets and how well they fit or get along together. Beside skill boosting activities, bulk of the gameplay is done using 1st-person visual novel style with static 2D anime characters over background with dialogue windows during conversations and dialogue options.</p>"},{"name":"Natsuiro Kenjutsu Komachi (Disc 2)","year":2000,"developer":"NEC Interchannel, Ltd.","url":"psx-chd-roms-n/Natsuiro%20Kenjutsu%20Komachi%20%28Japan%29%20%28Disc%202%29%20%28Special%20Disc%29.chd","filesize":151531252,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Dating simulation > Japanese-style adventure > Visual novel","desc":"<p><em>Natsuiro Kenjutsu Komachi</em> is a mix of visual novel and simulation adventure game where the player takes on a role of a captain of the high school athletic team. The game cycles through weeks, letting the player decide training activities to perform which in turn will increase his skills and character stats. As in other dating simulation games, player's stats may affect his conversation with girls he meets and how well they fit or get along together. Beside skill boosting activities, bulk of the gameplay is done using 1st-person visual novel style with static 2D anime characters over background with dialogue windows during conversations and dialogue options.</p>"},{"name":"NBA 2 Ball","year":1998,"developer":"Iguana Entertainment Incorporated"},{"name":"NBA Action 98","year":1997,"developer":"Visual Concepts Entertainment, Inc."},{"name":"NBA Basketball 2000","year":1999,"developer":"Radical Entertainment Inc.","url":"psx-chd-roms-n/NBA%20Basketball%202000%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":170875206,"score":6.8,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>NBA Basketball 2000 is an officially licensed NBA basketball game for the PlayStation and Windows. It features 340 actual NBA players with authentic faces, and 33 NBA all-star and rookie teams. Each player has a complete set of statistics and record history in the game.</p><p>Game modes include: season modes, all-star games, and exhibition. On the PC network play allows for up to 10 players simultaneously. On the PlayStation, using Multi Tap adapters you can play with up to eight players in a single game.</p><p>The game also comes with a selection of coaching options, including player substitutions, trades, injuries, rosters, and a create-a-player feature.</p><p>In game commentating is performed by Greg Papa and Doc Rivers.</p>"},{"name":"NBA Hangtime","year":1997,"developer":"Midway Manufacturing Company","url":"psx-chd-roms-n/NBA%20Hangtime%20%28USA%29.chd","filesize":32651099,"score":7.2,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Basketball > Licensed","desc":"<p><em>NBA Hangtime</em> is a 2-on-2 arcade basketball action game following in the footsteps of NBA Jam. All NBA teams, each featuring 4 players to choose from, are included along with fast paced, over-the-top basketball, disregarding the normal rules of the game but including fouls and out of bounds. You can also create your own player, with a collection of body parts and clothing to choose from.</p>"},{"name":"NBA Hoopz","year":2001,"developer":"Eurocom Developments Ltd","url":"psx-chd-roms-n/NBA%20Hoopz%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":112938228,"score":6.6,"genres":"Action > Sports > 3rd-person (Other) > Arcade > Basketball","desc":"<p>Play three-on-three basketball in the arcade style of older Midway games, such as NBA Jam and NBA Showtime. Besides playing regular games, you can also play mini-games like Around the World and 21.</p>"},{"name":"NBA in the Zone","year":1995,"developer":"Konami Co., Ltd."},{"name":"NBA in the Zone '98","year":1998,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"psx-chd-roms-n/NBA%20in%20the%20Zone%20%2798%20%28USA%29%20%28Rev%201%29.chd","filesize":294292388,"score":6.8,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p>This fully licensed NBA title features all teams and players from the NBA for the 97/98 season, allowing Exhibition, Season, Playoff and All-Star modes for 1-4 players.</p><p>Full teams stats, info and schedules are included, along with a complete list of options to create the game you want (from the length of each match, rules, control schemes, difficulty and more).</p>"},{"name":"NBA in the Zone '99","year":1999,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"psx-chd-roms-n/NBA%20in%20the%20Zone%20%2799%20%28USA%29.chd","filesize":345522271,"score":6.3,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p>Konami's second attempt of NBA basketball features all the options from the '98 title plus new motion captured moves, an icon passing system, on the fly play calling and up-to-date rosters and stats for the 98/99 NBA season.</p><p>A new three point contest is included to go with the Exhibition, Season, Playoff and All-Star modes.</p><p>All this and the voice of Chicago Bull public announcer Ray Clay.</p>"},{"name":"NBA in the Zone 2","year":1996,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-n/NBA%20in%20the%20Zone%202%20%28USA%29.chd","filesize":148035549,"score":7.7,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>This is the sequel to its predecessor which features more of the same gameplay and updated rosters including Dennis Rodman and Cliff Robinson. It also features all 29 fully licensed NBA teams and their respective logos and the standard <em>Exhibition</em> and <em>Season</em> modes including the ability to trade and build their ultimate dream team.</p><p>The players are rendered in 3D polygon graphics and even features small details such as sweat bands and tattoos and even realistic player animations and dunks. Eight friends can also play simultaneously utilizing multi-tap.</p>"},{"name":"NBA in the Zone 2000","year":2000,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"psx-chd-roms-n/NBA%20in%20the%20Zone%202000%20%28USA%29.chd","filesize":139609695,"score":6.2,"genres":"Sports > Basketball > Licensed","desc":"<p>The third in the In the Zone titles features all the usual options you come to expect from an NBA simulation title, including Season, Exhibition, Playoff, All-Star, Slam Dunk and three point shoot-out contests.</p><p>Fully licensed, the game features all the latest players, stats and teams from the NBA 99/2000 season, plus the icon-passing and on the fly play calling for a complete basketball game. Commentary again features the voice of Ray Clay.</p>"},{"name":"NBA Jam Extreme","year":1996,"developer":"Sculptured Software, Inc.","url":"psx-chd-roms-n/NBA%20Jam%20Extreme%20%28Europe%29.chd","filesize":55840302,"score":6.4,"genres":"Sports > Diagonal-down > Arcade > Direct control > Basketball","desc":"<p>\"Takes the NBA Jam game and puts into an all new 3d engine with lifelike player movement. All the real basketball action is bundled with extreme moves. Zany sound fx, commentary and victory dances by the players.\"</p><p>Basketball with altered gameplay. Features two players on each team with a huge number of special dunks and moves. There is an inclusion of a new extreme button for added excitement. Commentary by Marv Albert.</p>"},{"name":"NBA Jam Tournament Edition","year":1995,"developer":"Midway Manufacturing Company","url":"psx-chd-roms-n/NBA%20Jam%20-%20Tournament%20Edition%20%28Europe%29.chd","filesize":273887899,"score":7.6,"genres":"Action > Sports > Side view > 2D scrolling > Arcade > Direct control > Basketball > Licensed","desc":"<p>This game lets you play two-on-two arcade basketball with players from all the NBA teams. Gameplay is fast and action-packed, with few rules, no fouls, and deliberately unrealistic jamming. Players are rated on eight ability categories, from steals and blocks, to dunks and 3-pointers.</p><p>Up to four human players can take part, each always controlling a single player for their team, and AI for missing players. This allows for four players to face each other in teams of two, or for two players to team up against a third player with a CPU team-mate.</p><p>The <em>Tournament Edition</em> ups each team's roster to three players, and allows for substitutions between quarters. Shoving players now results in injuries, which lower a player's stats; encouraging you to sub them out and let them recover. Aside from the usual secret characters and cheat modes, the T.E. also includes four new additions you can individually enable from the special options menu:* \"Hot Spots\" are randomized zones on the court that reward extra points (up to a 9-point shot!) for making a basket while standing within them.</p><ul><li><p>Powerup icons appear randomly, and convey temporary arcade-like benefits when picked up. Some examples are instant \"on-fire,\" enhanced 3-point accuracy, monster dunks from anywhere on the court, or a bomb that knocks all other players to the ground.</p></li><li><p>\"Juice Mode\" increases the speed of the game up to 4x.</p></li><li><p>\"Tournament Mode\" disables all other modes, special characters, and cheats, and challenges you to defeat all the NBA teams to unlock extra players (2 extra players for almost every team). Winning Tournament Mode also unlocks a higher CPU difficulty level.</p></li></ul>"},{"name":"NBA Live 2000","year":1999,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/NBA%20Live%202000%20%28USA%29.chd","filesize":438521454,"score":7.8,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>Basketball.  Michael Jordan. Facial Animations and speech. Jordan. All the players from the 1999 - 2000 NBA season, including rookies. Plus All-Stars teams from past and present. Oh, and Jordan's back. </p><p>Like its predecessors in the long-running  series, <em>NBA Live 2000</em> strives for realistic basketball simulation rather than arcade-like gameplay. New moves have been added in this installments, and opponent AI has been tweaked to make victory more dependent on executing the right moves at the right times. As in the previous <em>NBA Live</em> games, it is possible to edit and create basketball players, as well as create and build an own team. This time, it is also possible to use any picture to serve as a player photo.</p><p>New to this installment (beside Jordan) is a one-on-one street basketball mode, and a mode that allows management of a team for several seasons, including trading players.</p>"},{"name":"NBA Live 2001","year":2000,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/NBA%20Live%202001%20%28USA%29.chd","filesize":271472393,"score":7.4,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p><em>NBA Live</em> is back! Enhanced Chat &amp; Match-up with the fast, easy-to-use Match-up System. Improved trade system can involve up to 3 teams and 15 players. Improved \"player personality\" means you'll see players argue calls, celebrate a key basket, encourage their teammates, and much more. Also, play the legends such as Michael Jordan in 1-on-1 or 5-on-5 games.</p>"},{"name":"NBA Live 2002","year":2001,"developer":"NuFX, Inc.","url":"psx-chd-roms-n/NBA%20Live%202002%20%28USA%29.chd","filesize":279917465,"score":7,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>The NBA Live series' second attempt on the PS2 brings the following updates:</p><p>Yes he has been in it since Live 2000, but this is first game to have Jordan with his new team, the Washington Wizards.</p><p>Cut scenes evolve the focus on player vs player interaction during stops in play and arguments between player and referee.</p><p>An improved interface allowing you to get into the games quicker, and an improved control system for better defensive and offensive moves.</p><p>New player moves, plays and celebration animations.</p><p>The Franchise Mode lets you control your team for 10 years, trading players and keeping an eye on rookies.</p><p>Legendary players list so you can see who really is the greatest.</p>"},{"name":"NBA Live 2003","year":2002,"developer":"NuFX, Inc.","url":"psx-chd-roms-n/NBA%20Live%202003%20%28USA%29.chd","filesize":271175551,"score":"","genres":"Simulation > Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>FEATURES * RUN THE FLOOR: Push the ball and exploit the mismatches. * UPDATED ROSTERS FOR THE 2002-2003 SEASON: Featuring trades, free agents, and draft signings. * THE NBA'S NEWEST FRANCHISE: Take the court as the New Orleans Hornets. * CLEAN THE GLASS WITH AUTHORITY: Own the paint and dominate the boards. * NEW EA SPORTS™ MUSIC: Featuring hot new releases from Fabolous, Flipmode Squad featuring Busta Rhymes, Hot Karl and Snoop Dogg.</p>"},{"name":"NBA Live 96","year":1996,"developer":"Electronic Arts, Inc.","url":"psx-chd-roms-n/NBA%20Live%2096%20%28USA%29.chd","filesize":335205686,"score":8,"genres":"Sports > Diagonal-down > Isometric > Direct control > Basketball > Licensed","desc":"<p>As with all games in the NBA Live series you can draft, trade and edit players.  Play a full season, exhibition or just the playoffs.  96 includes 29 teams including the expansion Toronto and Vancouver teams.</p>"},{"name":"NBA Live 97","year":1996,"developer":"NuFX, Inc.","url":"psx-chd-roms-n/NBA%20Live%2097%20%28USA%29.chd","filesize":474052528,"score":7.1,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p><em>NBA Live 97</em> is a basketball game with an emphasis on realism. You can choose from all of the NBA teams, create a team with players you create yourself, or choose a team formed by the All-Star players of the east or West coasts. When you create a player yourself you can customize the player to a high degree. There are over 60 offensive and 10 defensive set-ups. Match options include an exhibition match, a whole season or the playoffs.</p>"},{"name":"NBA Live 98","year":1997,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/NBA%20Live%2098%20%28USA%29.chd","filesize":381546142,"score":7.7,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p><em>NBA Live 98</em> offers the player all teams, players and stadiums of the 1998 NBA season. More than 350 faces got scanned to improve realism. Also some new moves like crossover or fade-aways are implemented. You can play single games, whole seasons, the playoffs or new things like manager career or 3-point-shootout in the style of an all-star-game.</p>"},{"name":"NBA Live 99","year":1998,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/NBA%20Live%2099%20%28USA%29.chd","filesize":359864404,"score":8.1,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>Play through the 98/99 NBA season or multiple seasons to build up your team over time. Or just jump straight to the playoffs. Trade, release or pick up free agents to add to your team. Have a bit of fun with the 3 point shootout mode. And a host of new player animations, including facial animations, and player moves.</p>"},{"name":"NBA ShootOut","year":1996,"developer":"Team SOHO","url":"psx-chd-roms-n/NBA%20Shoot%20Out%20%28USA%29.chd","filesize":267268512,"score":7.6,"genres":"Sports > 3rd-person (Other) > Top-down > Basketball > Licensed","desc":"<p>This is the first entry of Sony's basketball franchise that has all 29 NBA teams and their respective logos of that time as well as updated rosters with 300 major players. The players animations were motion captured and represented by 3D polygons.</p><p>It has the standard modes: <em>Exhibition</em>, <em>Season</em> and <em>Playoffs</em> as well as the ability to have eight friends play simultaneously. It has three different skill levels along with several camera angles and various plays that can be chosen from as well as slam dunks and pick &amp; rolls.</p>"},{"name":"NBA ShootOut '97","year":1997,"developer":"Team SOHO","url":"psx-chd-roms-n/NBA%20Shoot%20Out%20%2797%20%28USA%29.chd","filesize":194551591,"score":7.8,"genres":"Sports > Side view > Basketball > Licensed","desc":"<p>One of the first few games to be developed by SCEE's internal studio, this official basketball simulation is endorsed by the NBA, and features all of the teams from the '97 season. The game features real player likenesses, names and stats. There is also the facility to create customised players.</p><p>The usual range of Season play, Tournaments and Exhibition modes can be found. A host of tactical options can be set-up, and 'special moves' are there to discover. The game supports multiplayer modes of up to 8 players.</p>"},{"name":"NBA ShootOut 2000","year":1999,"developer":"989 Studios","url":"psx-chd-roms-n/NBA%20ShootOut%202000%20%28USA%29.chd","filesize":235280697,"score":7.3,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>This game features all 29 NBA teams from the 1999-2000 NBA season. The game modes included are Exhibition, Season (28, 56, or 82 games), and Playoffs (either the 5-7-7-7 game series or single elimination format). There is also a Create Dunk mode which lets players create signature dunks by positioning the limbs of the basketball players in all sorts of different ways.</p><p>Game options let the player choose whether to play a sim or arcade type of game, set the difficulty level (rookie, veteran, all-star, or hall of fame), set the quarter length, and whether to turn fatigue, touch shooting, auto replays, and close scores on or off. The game also contains player and league leader stat tracking. Rosters can also be managed with the player being able to edit, trade, sign, and draft basketball players.</p><p>During the game, if players choose to use touch shooting, they will see ameter every time they take a shot at the basket. Depending on what color the meter is when the shot is released will greatly effect the chances of the basket being made. Icon Passing and Icon Cutting make a return from the previous entry of the series. Icon Passing lets the player select which team member they want to get open for a pass while Icon Cutting lets the player select which team member they want to cut towards the basket.</p>"},{"name":"NBA ShootOut 2001","year":2000,"developer":"989 Studios","url":"psx-chd-roms-n/NBA%20ShootOut%202001%20%28USA%29.chd","filesize":221168473,"score":6.6,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>NBA Shootout 2001</em> is an officially licensed basketball game that features all the current NBA teams at the time including top players such as Shaquille O'Neal, Alonzo Mourning and many others. It has the standard set of modes that included exhibition, playoff and season mode. Players also had a choice of either playing a more fast paced game with Arcade or a more realistic experience with Simulation.</p><p>It features over 400 different plays to choose from including team specific plays and also has awards such as Defensive Player of the Year, Rookie of the Year and MVP that is handed out in season mode. Players can also play against each other in a versus mode.</p>"},{"name":"NBA ShootOut 2002","year":2001,"developer":"Killer Game","url":"psx-chd-roms-n/NBA%20ShootOut%202002%20%28USA%29.chd","filesize":232394256,"score":6.4,"genres":"Simulation > Sports > 3rd-person (Other) > Top-down > Basketball > Licensed","desc":"<p><em>NBA Shootout 2002</em> is another iteration of the Shootout series with the obligatory roster change for the 2000-2001 season including the standard game modes such as exhibition, season, tournament and multiplayer options. It features a full NBA license with all the teams with their respective names and logos and boasts an authentic feel with motion-capture animation and texture mapping of the top NBA players of the time. It also features a create-a-player function with 28 different attributes that can be assigned including a create-a-dunk option. Ian Eagle lends his voice talents to the game for play-by-play commentary.</p>"},{"name":"NBA ShootOut 2003","year":2002,"developer":"Killer Game","url":"psx-chd-roms-n/NBA%20ShootOut%202003%20%28USA%29.chd","filesize":196896869,"score":"","genres":"Sports > 3rd-person (Other) > Real-time > Direct control > Basketball > Licensed","desc":"<p>IF IT'S NOT FROM THE NBA, IT'S NOT THE NBA - Signature jams, animations, A.I. and plays from the NBA elite.<br>NBA HOOPS THE WAY IT SHOULD BE PLAYED - Run the court with Total Control: Passing, Screening & Shooting.<br>IT'S NBA. TRUE. NOW MAKE IT ALL ABOUT YOU - Customize Create Player & Create Dunk to become the next MVP.<br>GET YOUR HEAD OUT OF THE MANUAL AND IN THE GAME - Go to the hole with 18 one-touch player controls and no homework.</p>"},{"name":"NBA ShootOut 2004","year":2003,"developer":"Killer Game","url":"psx-chd-roms-n/NBA%20ShootOut%202004%20%28USA%29.chd","filesize":224203847,"score":6.3,"genres":"Sports > 3rd-person (Other) > Direct control > Basketball > Licensed","desc":"<p>NBA Shootout 2004 lets you play either a full season or exhibition matches of fully licensed NBA basketball with your favorite teams and players. Fully textured 3d players with faces of the top NBA players are mapped into the game. Listen to commentary by Ian Eagle and Bill Walton as they call the games right as you play.</p><p>While there is no franchise mode like other more traditional sports games, there is a career mode where you create a character who tries to make his way up through the summer leagues and the NBDL. You'll be given challenges that you'll need to meet so that you can ultimately make your way to the NBA and get an actual contract to join a NBA team. Once in the NBA, you'll need to work even harder to win championships and titles so you can eventually be inducted into the NBA Hall of Fame.</p><p>You can also unlock the 50 greatest players of all time by completing challenges in exhibition games like scoring a certain number of points or using a certain person to get a number of assists.</p><p>Use a USB microphone to give your teammates commands to help. Give them commands on offense or defense about where to move so you can use your teammates effectively.</p><p>Take your game online and play against the rest of the world. Look at leaderboards to see who the best person is, chat on message boards, participate in polls, read news, and even play in online tournaments.</p>"},{"name":"NBA ShootOut 98","year":1998,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-n/NBA%20ShootOut%2098%20%28USA%29.chd","filesize":301824041,"score":7,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>This game features all 29 NBA teams from the 1998 season. The game modes included are Exhibition, Season, and Playoffs. The game also features a draft mode and a player creation option. The game also contains player and league leader stat tracking.</p><p>Game options let the player choose whether to play a sim or arcade type of game, set the difficulty level, set the quarter length, and whether to turn turbo on or off.</p><p>During the game, players can use the Total Control Dunking which lets the player perform various types of slam dunks. Also featured during the game is Icon Passing and Icon Cutting. These let the player select which team member they want to get open for a pass or to cut towards the basket.</p>"},{"name":"NBA Showtime: NBA on NBC","year":1999,"developer":"Midway Games, Inc.","url":"psx-chd-roms-n/NBA%20Showtime%20-%20NBA%20on%20NBC%20%28USA%29.chd","filesize":69005444,"score":6.9,"genres":"Sports > 3rd-person (Other) > Direct control > Basketball > Licensed","desc":"<p><em>NBA Showtime: NBA on NBC</em> is a descendant of the original NBA Jam, and is created by some of the key team members. The game follows in the footsteps of NFL Blitz, featuring the option to save personal records and a cheat code system operated by pressing a sequence of buttons. It also features unlock-able characters, including NBA team mascots, and the \"On-Fire\" option that defines Midway's sports games. Players are able to perform special moves such as the alley-oop, the spin move, and the double dunk. The game also features a Create-a-Player mode that allows custom players to have tweaked abilities by winning matches.</p><p>NBA Showtime debuted as an arcade game featuring rosters from the 1998-99 NBA season as well as secret characters based on the Universal Monsters. The later home console ports of the game use updated rosters for the 1999-2000 season and lacks the Universal Monsters characters. An arcade update was released in 2000 with refreshed rosters as <em>NBA Showtime: NBA on NBC - Gold Edition</em>.</p>"},{"name":"NCAA Basketball Final Four '97","year":1997,"developer":"High Voltage Software, Inc.","url":"psx-chd-roms-n/NCAA%20Basketball%20Final%20Four%2097%20%28USA%29.chd","filesize":282064549,"score":6.6,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>Shoot and block your way through a full college season working your way up to the final four. Comes with replicas (the NCAA didn't allow real players to be used in this game) of 64 major college basketball teams. There are basic coaching options that can be used, a few plays to cover the basics but nothing too detailed.</p>"},{"name":"NCAA Final Four 2000","year":1999,"developer":"Killer Game","url":"psx-chd-roms-n/NCAA%20Final%20Four%202000%20%28USA%29.chd","filesize":219908423,"score":6.4,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>NCAA Final Four 2000</em> allows you to control one of 300 Division One basketball teams (the game uses real licensed teams), in either a single game, just the tournament, or though an entire season. One of the new features for this release is \"touch shooting\". When making a shot, a meter comes up. Leave the meter in the right spot, and you're more likely to make the shot. The game engine has also been improved and in-game commentary is provided by Quinn Buckner.</p><p>Other enhancements include playbooks and AI focused on scrambles and team play typical of college games. The player models have been created using motion capture.</p>"},{"name":"NCAA Final Four 2001","year":2000,"developer":"Killer Game","url":"psx-chd-roms-n/NCAA%20Final%20Four%202001%20%28USA%29.chd","filesize":193976104,"score":5.4,"genres":"Simulation > Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>The continuation of 989 Sports long running NCAA basketball franchise and the first for the PS2, once again returns with 31 NCAA Division 1-A schools along with over 300 of the top teams of the time.</p><p>Once again the obligatory game modes apply such as <em>Exhibition</em>, <em>Season</em>, <em>Playoffs</em>, etc. It also features authentic motion capturing and 3D rendered character models of the top stars of the time to give it a more realistic feel. A shooting meter has also been added to give players a better chance at both shooting and free-throws.</p><p>Quinn Buckner also makes an appearance to lend his voice for play-by-play commentary.</p>"},{"name":"NCAA Final Four 99","year":1999,"developer":"Killer Game","url":"psx-chd-roms-n/NCAA%20Final%20Four%2099%20%28USA%29.chd","filesize":143939253,"score":6.9,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>This college basketball game features over 250 Division 1 teams and four different game modes. The game modes are Quick Start, Exhibition, New Season, and New Tournament (which lets the player set up a NCAA 64-team tournament). </p><p>Options let the player choose the length of the game, the speed of the game, the difficulty level, and whether to have injuries, fatigue, and fouls turned on or off.</p><p>During the game, the play-by-play commentary is done by Quinn Buckner. The game features icon passing and cutting, which let the player select which team member they want to get open for a pass or to cut towards the basket. Also optional to have on while playing is the optional shot meter. With it on, the player can see a meter indicating at what point they should release the shooting button in order to make an accurate shot. Another feature is the 6th man meter. This will rile up crowds for home teams and have them taunt the away teams.</p><p>During the season mode, the game features team stats, polls, standings, and award stats, as well as an injury report. The game also keeps track of 32 different statistical categories for the team and its' players.</p>"},{"name":"NCAA Football 2000","year":1999,"developer":"EA Tiburon","url":"psx-chd-roms-n/NCAA%20Football%202000%20%28USA%29%20%28Rev%201%29.chd","filesize":279028861,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>NCAA Football 2000</em> is a continuation of EA Sports' NCAA Football series, about college American football games. This version has polygon-rendered graphics, which were absent from previous NCAA Football offerings on the PlayStation.</p><p>All 23 bowl games and the Heisman Trophy are featured in Dynasty Mode. It contains 114 Division I-A schools and 26 from Division I-AA along with the option to create a custom team, along with logos and fight songs. There are also 23 bowls (for more than the previous game) and the ability to edit new plays. The game offers the Nokia Sugar Bowl as a unique stadium.</p>"},{"name":"NCAA Football 2001","year":2000,"developer":"Sennari Interactive, LLC","url":"psx-chd-roms-n/NCAA%20Football%202001%20%28USA%29.chd","filesize":281951155,"score":"","genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p><em>NCAA Football 2001</em> is a continuation of EA Sports' NCAA Football series. Just like the previous title NCAA Football 2000 it is exclusive to the PlayStation platform.</p><p><em>NCAA Football 2001</em> simulates college football down-to-earth, now adding an official BCS rating system. Also new to this version are a create-a-player and create-a-team mode, the all-time top 25 college football teams ever, and a situation mode, putting you in any combination of football situations. It also has a more comprehensive Dynasty mode, improved player control, more receiver patterns and improved defensive AI. There is support for up to eight players and exclusive to this game is the FedEx Orange Bowl.</p>"},{"name":"NCAA Football 98","year":1997,"developer":"EA Tiburon","url":"psx-chd-roms-n/NCAA%20Football%2098%20%28USA%29.chd","filesize":219496088,"score":7.2,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>\"We have created a football game that stays true to the feel of a Saturday afternoon college event,\" said Rob Martyn, executive producer, EA SPORTS. \"You'll hear the voice of Rose Bowl announcer Chuck White during the game. We worked with former UCLA coach Terry Donahue to make sure the playbook for each team was authentic and reflects the style of play that team actually uses. You play this game and you feel like you are on the field and part of the college football experience. The emotion, tradition, rivalries and enthusiasm that surround the college game is very intense and EA SPORTS has captured that feeling in NCAA Football 98.\"</p>"},{"name":"NCAA Football 99","year":1998,"developer":"FarSight Technologies Inc.","url":"psx-chd-roms-n/NCAA%20Football%2099%20%28USA%29.chd","filesize":295425194,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>The 1999 installment of EA Sports college football game.  NCAA 99 features the 1998 rosters of over a hundred division 1A teams with accurate stadiums, uniforms, and (in some cases) fight songs.  There are also 80 \"historical\" teams that allow you to recreate great college football games of the past.  The featured exhibition game is a match up between the 1997 national champion Michigan Wolverines and the champion pretender Nebraska Cornhuskers.</p>"},{"name":"NCAA Gamebreaker","year":1996,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-n/NCAA%20Football%20GameBreaker%20%28USA%29.chd","filesize":98640882,"score":7.1,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>This is Sony's first entry in its NCAA Gamebreaker series which features over 100 Division 1-A, 1-AA and historical teams, including their respective logos and nicknames. It also features real-life stats of each team's players and their jersey numbers, but not their names. Authentic stadiums for the major teams are also present as well as crowd chants and fight songs.</p><p>The standard game modes apply including <em>Championship</em>, <em>Season</em> (either with tournament championships or bowl championships) and <em>Exhibition</em> which also includes multiplayer capabilities that can include up to eight simultaneous human players. There are also 20 authentic bowl games to choose from, over 12 categories of stats that the player can track and authentic awards including the coveted <em>Heisman</em> trophy.</p>"},{"name":"NCAA GameBreaker 2000","year":1999,"developer":"RedZone Interactive, Inc.","url":"psx-chd-roms-n/NCAA%20GameBreaker%202000%20%28USA%29.chd","filesize":250495961,"score":7.2,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>NCAA GameBreaker 2000</em> is the college football counterpart to 989 Studio's NFL GameDay 2000. It features over 150 division 1-A teams (including classics), accurately modeled stadiums, season and career modes, and the ability to export players to a GameDay 2000 draft.</p><p><em>GameBreaker 2000</em> also includes voice commentary by broadcaster Keith Jackson and a playbook designed by then UCLA coach Bob Toledo.</p>"},{"name":"NCAA GameBreaker 2001","year":2000,"developer":"RedZone Interactive, Inc.","url":"psx-chd-roms-n/NCAA%20GameBreaker%202001%20%28USA%29.chd","filesize":249410993,"score":6.6,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>Like previous games in 989 Studios' GameBreaker series, NCAA GameBreaker 2001 is a counterpart to their NFL GameDay series. You start out as a bottom-rung coach at one of the 115 division 1-A college teams and as your performance increases, you obtain promotions and offers from other schools. At the end of the season, you're able to export your players to NFL GameDay. As with the previous games, broadcaster Keith Jackson returns to provide voice commentary.</p>"},{"name":"NCAA GameBreaker 98","year":1997,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-n/NCAA%20GameBreaker%2098%20%28USA%29.chd","filesize":219858169,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>A college football game with three different game styles (simulation, total control, and fantasy league) and three different game types (scrimmage, tournament, and bowl season).</p><p>The game contains all 112 Division 1A Teams with their team specific playbooks along with 130 different NCAA stadiums. The game also contains over 40 classic teams to play as.</p><p>There is also a Create Play mode which lets the player draw up their own plays to use on the gridiron. Players can also create a walk on athlete to play as.</p><p>Gameplay is similar to what is found in NFL GameDay '98, but with more emphasis on college plays and rules. Players select their plays, try to gain yards on a vertical field, and hopefully score by getting into the end zone. On offense, players can use Total Control Passing which enables a player to under or over throw to a receiver.</p><p>Options include adjusting the difficulty level and the length of each quarter, setting the likelihood of penalties being called, setting the speed of the game, what type of weather to play in, and whether to turn on or off the announcer, music, or injuries.</p>"},{"name":"NCAA GameBreaker 99","year":1998,"developer":"989 Studios","url":"psx-chd-roms-n/NCAA%20GameBreaker%2099%20%28USA%29.chd","filesize":127110055,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>GameBreaker 99 is the NCAA counterpart to NFL GameDay 99. This second installment in 989's college football series features 162 division 1-A teams (including historical teams), 18 bowl games, accurately modeled stadiums, custom play design, and team management functions (including blue chip recruiting). Broadcaster Keith Jackson also makes his videogame debut in GB99 as the color commentator.</p>"},{"name":"NCAA March Madness 2000","year":1999,"developer":"Black Ops Entertainment, LLC","url":"psx-chd-roms-n/NCAA%20March%20Madness%202000%20%28USA%29.chd","filesize":335154182,"score":7.9,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>March Madness 2000 is the third title in EA Sports' college basketball franchise. This time, there are over 200 teams to choose from, including 16 top women's programs. The teams have unique playbooks, play styles and fight songs. Game options include exhibition games and tournaments. The Dynasty mode allows one to lead a team over several seasons, with recruiting and \"red-shirting\" of players included. \"Rivalry Mode\" allows the automatic selection of a team's arch-nemesis as the opponent. There are new motion captured moves (including several flashy dunks), and the new \"Dynamic Ball Control\" feature allows for more precise control of moves like crossovers and spins. The game features commentary by Dick Vitale.</p>"},{"name":"NCAA March Madness 2001","year":2000,"developer":"Black Ops Entertainment, LLC","url":"psx-chd-roms-n/NCAA%20March%20Madness%202001%20%28USA%29.chd","filesize":325761749,"score":"","genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>This is the fourth in Electronic Arts' college basketball franchise. The game has most of the features from the 2000 edition like exhibition and tournament games, women's teams and Dynasty Mode. New features for the 2001 edition include Coach Mode, where you build your career until you land a job with a Division I team by achieving certain goals like finishing a season with a winning record or defeating several ranked teams. There's also a Dream Tournament, featuring the 64 greatest teams of all time. You can also earn new Dynamic Ball Control moves, like crossovers and dunks, by unlocking them as your skills progress. The game features design input from legendary Blue Devils coach Mike \"Coach K\" Krzyzewski.</p>"},{"name":"NCAA March Madness 99","year":1998,"developer":"Electronic Arts, Inc.","url":"psx-chd-roms-n/NCAA%20March%20Madness%2099%20%28USA%29.chd","filesize":440685561,"score":5.9,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>This basketball game lets the player choose from 107 Division 1 men's teams, 16 Division 1 women's teams (the top 16 from the 1998 season), and 20 of the all-time great men's teams from the past. The license from the NCAA allows for the team's names to be real, but no player's names are allowed, although the players on the teams mimic the real jersey number's and skills of their real life counterparts.</p><p>The game features six game modes which are: Exhibition, Tournament, Practice, Women's Sweet Sixteen, Three-Point Shootout, and Dynasty. </p><p>Exhibition let's the player pick any team to play against any other team in the game. Tournament mode lets the player fully customize a 64 team NCAA tournament. Practice mode let's the player practice their skills on the court. Women's Sweet Sixteen let's the player set up a tournament for the 16 women's teams in the game. Three-Point Shootout let's the player compete in a three-point shooting contest. Dynasty mode let's the player take a college team through multiple seasons and allows the player to recruit new talent to improve their team.</p>"},{"name":"Necronomicon: The Dawning of Darkness (Disc 1)","year":2001,"developer":"Wanadoo Edition","url":"psx-chd-roms-n/Necronomicon%20-%20The%20Dawning%20of%20Darkness%20%28Europe%29%20%28Disc%201%29.chd","filesize":474127315,"score":5.2,"genres":"Adventure > 1st-person > Graphic adventure > Puzzle elements > Interwar > Detective / mystery > Horror","desc":"<p>New England ... 1927 - William Stanton is visited by a friend from his childhood, Edgar Wycherley, who hands him a strange pyramid shaped object and begs him not to show it to anyone, not even him if he asks for it.  As William delves into the mysteries of this object and the reasons why his friend gave it to him, he discovers that Edgar was somehow involved in the occult and that the entire world may be at risk.</p>"},{"name":"Necronomicon: The Dawning of Darkness (Disc 2)","year":2001,"developer":"Wanadoo Edition","url":"psx-chd-roms-n/Necronomicon%20-%20The%20Dawning%20of%20Darkness%20%28Europe%29%20%28Disc%202%29.chd","filesize":508035283,"score":5.2,"genres":"Adventure > 1st-person > Graphic adventure > Puzzle elements > Interwar > Detective / mystery > Horror","desc":"<p>New England ... 1927 - William Stanton is visited by a friend from his childhood, Edgar Wycherley, who hands him a strange pyramid shaped object and begs him not to show it to anyone, not even him if he asks for it.  As William delves into the mysteries of this object and the reasons why his friend gave it to him, he discovers that Edgar was somehow involved in the occult and that the entire world may be at risk.</p>"},{"name":"Nectaris: Military Madness","year":1998,"developer":"Matrix Software","url":"psx-chd-roms-n/Nectaris%20-%20Military%20Madness%20%28USA%29.chd","filesize":265806291,"score":"","genres":"Strategy > 3rd-person (Other) > Top-down > Turn-based > Sci-fi / futuristic","desc":"<p>An updated version of Military Madness.</p><p>The game modes featured include Main Campaign, Original Campaign, Mini-Campaigns, and Single Scenario.</p><p>The main campaign involves the story of how in the 21st century mankind has colonized the moon. In 2089, an invading Xenon empire destroys several lunar outposts. The base Nectaris, the largest of the lunar outposts wasn't fully destroyed and a few units escaped alive and now are planning a counter attack on the Xenon empire. Now it's up to the player who is put into the role as the Union forces commander to defeat the enemy Xenon forces. </p><p>The main campaign goes through a series of over 30 different battlefields. Gameplay involves moving various units on an overhead map of the battlefield. Units movement are done on hexagonal grids. Once the players units make their moves, it is then their opponents turn to move their units. Players can use their various units to attack the opposing forces. Battles sequences are turn based. The outcome of a battle can be affected by the terrain, any support fire present, an encirclement effect, plus the individual strengths and weaknesses of the unit types that are involved in the skirmish. Since both the player and the enemy forces have access to the same unit types, the game emphasizes knowing each units strengths and weaknesses, and the strategic placement of units. Also on the battlefield, players will have access to their factories which allows for additional units to be deployed and gives the player the ability to repair their weakened forces.</p><p>This Main Campaign mode brings to the table an all new campaign, while the Original Campaign consists of the entire original campaign from the 1989 game.</p><p>The game also features Mini-Campaigns, over 40 individual maps ranging in 4 different map sizes (1x1,1x2, 2x1, and 2x2) that were created by fans of the game.</p><p>The Single Scenario mode is locked at first and can be accessed only when the player completes all the campaigns. This mode offers support for 2 players to do battle with each other.</p><p>The game has the options of having the battle animations be in 3D, 2D, or turning them off all together, plus altering which buttons confirm and cancel orders given in the game.</p><p>There is also a scenario editor where players can create their own scenarios.</p>"},{"name":"Need for Speed II","year":1997,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/Need%20for%20Speed%20II%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.chd","filesize":379025029,"score":7.1,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing > Oceania","desc":"<p>In <em>Need For Speed II</em> the player takes control of eight Super Cars and races his or her way through six different tracks from Australia to Nepal. Much like the first in the series, the sequel has plenty of high performance cars to choose from, including the McLaren F1, Ferrari F50, Lotus GT1, Jaguar XJ220, Ford GT90, Isdera Commendatore 112i, Italdesign Cala and Lotus Esprit V8, each handling differently.</p><p>Once the player has beaten the six tracks, a new track is made available. It's a fast paced racing game which is intended to play more like an arcade racer than a true simulation, though the player can select which driving style suits him or her best: arcade or simulation. </p><p>There are three game modes: single race, tournament (in which the player must get the highest score in order to win) and knock out (in which the player has to outrun at least one car at the end of each track to avoid elimination). Car settings such as gear ratio, downforce, break bias and color can be customized. The opponents' skill can also be chosen, as well as the presence of civilian traffic in the tracks. The game offers four options of camera views: heli-cam, tail-cam, in-car and road cam. A replay mode with eight cinematic cameras is also available.</p><p>The main difference between this and the previous <em>Need for Speed</em> game is in the tracks, with less open road tracks in this sequel. Also, there are no cops to chase the player. However, the tracks available are have a range of detail, and some have changing weather conditions while the player races.</p>"},{"name":"Need for Speed III: Hot Pursuit","year":1998,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/Need%20for%20Speed%20III%20-%20Hot%20Pursuit%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.chd","filesize":355878356,"score":7.9,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing","desc":"<p>In the third major installment of Electronic Arts'Arcade racing series, there are several modes of play available. You have the standard race, with one big difference - now there are traffic cops out to ticket you for your excessive speed. Alternatively, you can take your turn with the radar gun and attempt to pull over speeding computer or human racers. </p><p>Returning to the flavour of the original Need for Speed, this adds a new Pursuit mode, where you must out run the cops through fast, open area tracks, while also out-lasting the rest of the pack. Another new mode is knockout, where you race through all the tracks, and whoever is last after each race is knocked out. The winner is, of course, the one that lasts the distance. Almost every course in the game has one or more shortcuts. </p><p>The cars include Ferrari 550 Maranello, Ferrari 355 F1 Spider, Italdesign Scighera, Lamborghini Diablo SV, Lamborghini Countach, Jaguar XJR-15, Jaguar XK8, Aston Martin DB7, '98 Corvette C5, Mercedes SL600 and the Mercedes CLK GTR.</p>"},{"name":"Need for Speed, The","year":1996,"developer":"Electronic Arts, Inc."},{"name":"Need for Speed: High Stakes","year":1999,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/Need%20for%20Speed%20-%20High%20Stakes%20%28USA%29.chd","filesize":494569412,"score":7.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Arcade > Direct control > Automobile > Street racing > Vehicle simulator","desc":"<p>Just like its predecessors <em>Need for Speed: High Stakes</em> is an action racing game with a wide selection of exotic sports cars and many different types of tracks. The trademark Hot Pursuit mode game mode from the first game in the series is still present, where players race opponents on tracks filled with regular traffic and police cars that chase the racers. The classic pursuit mode is extended with two additional modes: Getaway and Time Trap. In Getaway the player needs to shake off the police in a set amount of time, or playing as the police trap a speeder before time runs out. In Time Trap an entire race needs to be completed before time runs out, or as the police all speeders need to be arrested. There are minor differences between the two platforms for this game mode, regarding spike strips, road blocks, and back-up. The latter for instance is unique to the PlayStation version. The Pursuit mode is available in multiplayer as well and players can take different sides or race together.</p><p>It is the first game in the series to introduce a Career mode with a set of challenges. Beating these is rewarded with trophies for unlocks, and money to spend on new cars, repairs and upgrades. In the PlayStation version the Career mode is split up into two different sets of challenges: Tournament (required races) and Special Event (optional races). <em>High Stakes</em> in the title refers to races where players bet their cars. In the PC version these are a part of the Career mode when the player owns more than two cars. In the PlayStation version two players can insert their memory cards and race against each other. The winner immediately receives the opponent's car and it is deleted from the loser's memory card right away.</p><p>In addition to the new game modes it is also the first game in the series to have a detailed physics models. Damage now affects both the appearance and the performance of the car for the first time.</p>"},{"name":"Need for Speed: Porsche Unleashed","year":2000,"developer":"Eden Studios","url":"psx-chd-roms-n/Need%20for%20Speed%20-%20Porsche%20Unleashed%20%28USA%29.chd","filesize":412328224,"score":6.7,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Street racing > Track racing > Vehicle simulator","desc":"<p>You've pushed yourself to the edge - now drive over it!<br>Need for Speed Porsche 2000 lets you experience the adrenaline rush of high-speed driving with 74 different Porsche models dating from 1948 to 2000. Roar down the roadways in classic models such as the 1948 356 No.1, or push the state-of-the-art 2000 996 Porsche Turbo to its absolute limit. The choice is yours.<br>Grid-based tracks feature 20 open road segments, and with the capacity for 4 people to play, this game lets you take part in a thrills 'n' spills journey through Porsche's fast-paced 50-year history. Fasten your seat belt!</p>"},{"name":"Need for Speed: V-Rally","year":1997,"developer":"Eden Studios","url":"psx-chd-roms-n/Need%20for%20Speed%20-%20V-Rally%20%28USA%29.chd","filesize":176006923,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Off-roading > Track racing","desc":"<p>Test your driving skills in this rally game. You can compete in three different game modes: Arcade, Championship and Time Trial. In the Championship mode you race against three other cars in various countries. Gain points in order to win the Championship. In the Arcade mode you still race against three other cars, but also against the clock. Finish each race before the time runs out, and come in first to win the Arcade mode. You can choose between Easy (4 races), Medium (6 races) and Difficult (8 races). If you just want to race by yourself you can try the Time Trial mode. </p><p>There are 11 different cars available. They are divided into two groups: 2W and 4W drive. The 4W cars are a little bit faster than the normal cars.</p>"},{"name":"Need for Speed: V-Rally 2","year":1999,"developer":"Eden Studios","url":"psx-chd-roms-n/Need%20for%20Speed%20-%20V-Rally%202%20%28USA%29.chd","filesize":365110750,"score":7.6,"genres":"Racing / Driving > Simulation > Sports > 1st-person > Behind view > Arcade > Direct control > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p><em>Need for Speed</em> returns to dirt racing again in this sequel to <em>Need for Speed: V-Rally</em>. The most significant differences are the track editor, improved graphics, and new game modes. There are 84 tracks and the game supports multiplayer with up to four players. This second installment comes with four game modes: an arcade mode for casual rally fans, a championship mode for people who want to compete against other rally cars for a title, a trophy mode, and a time trial mode.</p><p>It features 16 different cars in three categories: World Rally Cars (Peugeot 206, Hyundai Coupe, Mitsubishi Lancer, Toyota Corolla, Subaru Impreza, Ford Focus, SEAT Córdoba, Škoda Octavia), 2L kit-cars (Peugeot 306, Citroën Xsara, SEAT Ibiza, Renault Megane, Vauxhall Astra) and 1.6L kit-cars (Citroën Saxo, Peugeot 106, Nissan Micra). A number of bonus cars can be unlocked as well by completing certain modes, such as winning the European or the World Championship.</p><p>In the arcade mode you race against three opponents on the race track; whoever reaches the finish line first after a series of laps wins the stage. However, the main goal in a stage is to reach the next checkpoint before the countdown timer stops. Several stages form a level, for which you receive a total of three credits. Every time you fail to reach a checkpoint before the time runs out the race stops and you can use a credit to restart that particular stage. If there are no credits left, the entire level must be restarted. The trophy mode is a bit different. While winning a stage is still done by beating three opponents directly on the race track, to claim the trophy you have to register the best overall result, calculated by summing up all the stages' times.</p><p>The championship mode is designed after the FIA World Rally Championship, where drivers compete for points. The European championship is divided into eight rounds, while the World and the Expert championships each have twelve. Every round has two (European, World) or three stages (Expert). This is the only mode where the car gets damaged if handled badly, but it can be repaired at the service park between stages in the following areas: engine, gear box, brakes, steering and suspensions. You only have 30 minutes, so if your car is seriously messed up you will not be able to restore it to a 100% condition for the next stage. At the end of the round the total time for all stages is compared between racers and the first six positions in the standings get a number of points based on their performance (for example the fastest gets 10 points, 2nd place gets 6 points, and so on). Whoever has the most points after all the rounds becomes the new champion.</p><p>In the track editor the track is represented by a single line or ribbon. You can edit the curves and change the inclines or declines of each track piece. The only restriction is that trackpieces cannot overlap, so for example you cannot make an 8-shaped track. When playing the track, scenery is added procedurally depending on the curves and inclines and which country is selected. The 84 default tracks make use of the same engine.</p>"},{"name":"Nekketsu Oyako","year":1994,"developer":"Technosoft Co., Ltd.","url":"psx-chd-roms-n/Nekketsu%20Oyako%20%28Japan%29.chd","filesize":7818459,"score":"","genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Arcade > Beat 'em up / brawler","desc":"<p>Middle-aged housewife Saeko Hibino has a secret: she's actually a Nobel laureate theoretical physicist who devised a completely new type of antimatter fusion reactor at only 17 years old. But when a band of no-good bad guys calling themselves the Haraguro-dan find out, they figure she's perfect to help them complete their ultimate secret doomsday weapon and kidnap her. Her family aren't going to take this lying down, though, and immediately take up arms, setting out to free her by whatever means necessary!</p><p><em>Nekketsu Oyako</em> (\"Hot-Blooded Family\") is a side-scrolling beat-'em-up in the tradition of Final Fight with a particular focus on finding and picking up weapons in each stage. There are three characters to choose from: Saeko's husband, former pro-wrestler Rando, their fighting prodigy daughter Rio, and Saeko's freeloading research assistant, Torataro Minowa. Each character has their own stats and special abilities, and two players can also play simultaneously.</p>"},{"name":"Neko na Kankei","year":1998,"developer":"Octagon Entertainment Inc.","url":"psx-chd-roms-n/Neko%20na%20Ka-N-Ke-I%20%28Japan%29.chd","filesize":284830029,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Dating simulation > Japanese-style adventure > Visual novel > Fantasy > Romance","desc":"<p><em>Neko na Kankei</em> is a visual novel adventure game focusing on a player who is a regular high school student who one day stumbles upon a special stone that grants him the ability to turn into a cat at will. Using it for evil things or stopping to use it at all will invite bad luck into his life, so he decides to use for getting to know girls he would be too shy to approach as a regular boy. Which girl wouldn't find a little kitty cute and not want to pet it or hold it close to her breasts. It's a win-win situation for our hero, and he is resolved to put it to best use... for him. The game is split into 10 weeks time and plays as a regular dating simulation visual novel romance adventure.</p>"},{"name":"Neko-Zamurai (Disc 1)","year":1999,"developer":"Aim at Entertainment, Inc.","url":"psx-chd-roms-n/Neko%20Zamurai%20%28Japan%29%20%28Disc%201%29.chd","filesize":446421192,"score":"","genres":"Action > Top-down > Anime / Manga > RPG elements > Fantasy > Japan (Ancient/Classical/Medieval) > Martial arts","desc":"<p>NEKOZAMURAI places players in an old Japanese town set in the Edo period to enjoy multi story plots consisting of over 150 scenarios and featuring over 100 characters.<br>In the conversation screen that forms the main part of gameplay, real time mime motion is adopted with the use of face tracker to give detailed and rich facial expressions to characters.</p>"},{"name":"Neko-Zamurai (Disc 2)","year":1999,"developer":"Aim at Entertainment, Inc.","url":"psx-chd-roms-n/Neko%20Zamurai%20%28Japan%29%20%28Disc%202%29.chd","filesize":460181928,"score":"","genres":"Action > Top-down > Anime / Manga > RPG elements > Fantasy > Japan (Ancient/Classical/Medieval) > Martial arts","desc":"<p>NEKOZAMURAI places players in an old Japanese town set in the Edo period to enjoy multi story plots consisting of over 150 scenarios and featuring over 100 characters.<br>In the conversation screen that forms the main part of gameplay, real time mime motion is adopted with the use of face tracker to give detailed and rich facial expressions to characters.</p>"},{"name":"Neko-Zamurai (Disc 3)","year":1999,"developer":"Aim at Entertainment, Inc.","url":"psx-chd-roms-n/Neko%20Zamurai%20%28Japan%29%20%28Disc%203%29.chd","filesize":452880513,"score":"","genres":"Action > Top-down > Anime / Manga > RPG elements > Fantasy > Japan (Ancient/Classical/Medieval) > Martial arts","desc":"<p>NEKOZAMURAI places players in an old Japanese town set in the Edo period to enjoy multi story plots consisting of over 150 scenarios and featuring over 100 characters.<br>In the conversation screen that forms the main part of gameplay, real time mime motion is adopted with the use of face tracker to give detailed and rich facial expressions to characters.</p>"},{"name":"Nemuru Mayu","year":2000,"developer":"Dual Corporation","url":"psx-chd-roms-n/Nemuru%20Mayu%20%28Japan%29.chd","filesize":483948725,"score":"","genres":"Role-playing (RPG) > 1st-person > Direct control > Menu structures > Fantasy","desc":"<p><em>Nemu Lu Mayu</em> is a first-person dungeon crawler role-playing game similar to the King's Field series. You are known as The Accursed One, and have been sucked into a demonic tome hidden in Tuscany, Italy. You must free the four other trapped souls of knights within the tome.</p><p>The player can pick the order of the four knights to rescue. The game features voice clips, pre-rendered characters, 3D environments, and surreal visuals/presentation. The battle system is not turn-based. Enemies are visible when walking around the lengthy dungeons. You and the enemies can move forward and backward to hit, and cast spells by pressing buttons in a specific rhythm with a stroke on-screen.</p>"},{"name":"Neo ATLAS","year":1998,"developer":"FlipFlop Productions","url":"psx-chd-roms-n/Neo%20Atlas%20%28Japan%29.chd","filesize":121885288,"score":"","genres":"Adventure > Simulation > Diagonal-down > 2D scrolling > Real-time > Managerial / business simulation > Sandbox / open world > Direct control > Menu structures > Naval / watercraft > Africa > Asia > Europe > Fantasy > Historical events > North America > Oceania > South America > Comedy > Detective / mystery","desc":"<p>Neo ATLAS is a reimagining of Artdink's home computer Atlas series, with 32-bit era upgrades to graphics and gameplay.</p><p>As the manager of a trading company in 15th century Portugal, you're charged with making a profit while also exploring the mysterious remainder of the world, currently shrouded in mysterious clouds. As you explore the map, you make calls on whether you believe or disbelieve the reports of your sailors, and this act goes on to influence the shape of the world itself, and in turn, the resources and challenges placed around it. You can discover mysterious plots, cities, ruins, creatures, pirates, monsters and additional background music on your journeys.</p><p>Whilst your admirals are out exploring, you are also charged with establishing trade routes to distribute the resources they've uncovered, enable the production of goods, and ultimately make yourself a tidy profit.</p>"},{"name":"Neo ATLAS II","year":1999,"developer":"FlipFlop Productions","url":"psx-chd-roms-n/Neo%20Atlas%20II%20%28Japan%29.chd","filesize":184326980,"score":"","genres":"Adventure > Simulation > Diagonal-down > 2D scrolling > Real-time > Managerial / business simulation > Sandbox / open world > Direct control > Menu structures > Naval / watercraft > Africa > Asia > Europe > Fantasy > Historical events > North America > Oceania > South America > Comedy > Detective / mystery","desc":"<p>A second, expanded PlayStation iteration of Artdink's Atlas series. You are once again in charge of a trading company headquartered in Lisbon, and tasked by the king with exploring the rest of the world and bringing home the spoils.</p><p>In addition to the exploration, trading and map creation of the prior game, it adds an \"episode\" system which is effectively a quest log, as well as changes and updates to the story and quests. Additionally, it improves on the trading system, adding the \"trading post\" function, which allows the player to choose which product to make in some cities, which allows for more streamlined trading.</p><p>Just like the prior games, the shape of the world is determined by the player's belief or disbelief in the reports brought in by their admirals, and ultimately influences what is found on the map, and the routes that are available.</p>"},{"name":"Neo Planet","year":1996,"developer":"Map Japan Co., Ltd.","url":"psx-chd-roms-n/Neo%20Planet%20%28Japan%29.chd","filesize":259158784,"score":"","genres":"Simulation > Text-based / Spreadsheet > City building / construction simulation > Managerial / business simulation > Sci-fi / futuristic","desc":"<p>NEO PLANET is an original world-development simulation game.<br>The goal is to develop a planet to become the “second Earth” in which humans can safely dwell.<br>Through exploration and development, foster the growth and progression of the planet while preserving its fragile ecosystem.<br>Depending on the player’s actions, the game will unfold with different endings.</p>"},{"name":"Neon Genesis Evangelion","year":1998,"developer":"Gainax Co., Ltd.","url":"psx-chd-roms-n/Neon%20Genesis%20Evangelion%20-%20Original%20Screen%20Saver%20%28Japan%29.chd","filesize":2248329,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Sci-fi / futuristic > Licensed","desc":"<p>This is a Japanese-style adventure game based on the popular TV anime series <em>Neon Genesis Evangelion</em>. A girl named Mana Kirishima arrives at Tokyo-3 and studies in the same class with Shinji Ikari, the series' main hero. About the same time, a giant robot attacks the city. Is there a connection between the new student and the sudden assault?</p><p>Unlike the two previous <em>Neon Genesis Evangelion</em> games, <em>Kōtetsu no Girlfriend</em> is not an interactive movie. The player controls Shinji by selecting locations to travel to, looking at people, and talking to them. The locations are graphically represented as anime-style still screens.</p>"},{"name":"Neverhood, The","year":1998,"developer":"The Neverhood, Inc."},{"name":"New Horizons","year":1996,"developer":"KOEI Co., Ltd."},{"name":"Newman Haas Racing","year":1998,"developer":"Studio 33 (UK) Ltd.","url":"psx-chd-roms-n/Newman%20Haas%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.chd","filesize":375600910,"score":7,"genres":"Racing / Driving > Sports > 1st-person > 3rd-person (Other) > Licensed","desc":"<p><em>Newman Haas Racing</em> is a racing game developed in conjunction with the real-life Newman/Haas racing team. The game features 16 official drivers, cars and 11 tracks from the Indy Car series. The tracks include Houston (introduced in 1998), Laguna Seca Raceway, The Milwaukee Mile, Long Beach and more. The graphics engine is based upon Psygnosis' Formula One game. Commentary is provided by Indy car champion Danny Sullivan and Bob Varsha (ESPN).</p><p>There are 4 difficulty levels and 3 main game modes: Single Race, Challenge (the AI is adjusted according to your results) and a full season of racing. In multiplayer, players can go head-to-head in a split-screen mode.</p>"},{"name":"Next Tetris, The","year":1999,"developer":"Blue Planet Software, Inc.","url":"psx-chd-roms-n/Next%20Tetris%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":268935402,"score":6.5,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p>It's Tetris, only... new.  The Tetris series returns to its roots, eschewing the Disney characters, 3D pieces, hats, and letters that have been tacked on previous entries.</p><p>Contains the standard Tetris game, as well as some variants.  Some of the new features are puzzle pieces made of individual parts- after a piece lands, some parts may be able to break off and continue down; \"wiggly\" pieces that not only provide trippy eye-candy, but may allow you to squeeze a big piece through a tight spot; challenge modes where you must clear a cluttered playfield with limited time/pieces.</p><p>Allows for solo or competitive simultaneous play.  Also links to a global board via the Internet to compare scores and times.</p>"},{"name":"NFL Blitz","year":1998,"developer":"Midway Games, Inc.","url":"psx-chd-roms-n/NFL%20Blitz%20%28USA%29.chd","filesize":212471316,"score":7.7,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>NFL Blitz</em> gives the National Football League the same over-the-top treatment that Midway had used so effectively with NBA Jam. Features include exaggerated muscle-bound player models, \"turbo\" buttons, fast action, and some pretty wild rules changes (like 30 yards for a first down!). Blitz is nothing if not a unique football gaming experience.</p><p>Player taunts (\"This is MY HOUSE!\"), unpenalized late hits, and amusing running commentary from the announcers (\"That was totally uncalled for -- but awfully fun to watch!\") all add to the game's violent charm.</p>"},{"name":"NFL Blitz 2000","year":1999,"developer":"Midway Games, Inc.","url":"psx-chd-roms-n/NFL%20Blitz%202000%20%28Europe%29.chd","filesize":181451539,"score":7.4,"genres":"Action > Sports > Diagonal-down > Arcade > Football (American) > Licensed","desc":"<p>New edition of Midway's \"NFL Jam\" action/sports game where the emphasis is on bone-crushing action rather than sport simulation.</p><p>Additions this year come in the form of a season mode, a simpler passing system based on preset buttons (gone is the \"aiming\" mechanism) as well as a limited yet functional play-book editor.</p><p>Also included are new audible calls and voice-overs, smoother animations and new stadiums to play in.</p><p>Supports multiplayer gameplay of up to 4 players in one single machine! (two on keyboard, two on gamepads).</p>"},{"name":"NFL Blitz 2001","year":2000,"developer":"Midway Games, Inc.","url":"psx-chd-roms-n/NFL%20Blitz%202001%20%28USA%29.chd","filesize":132741569,"score":7,"genres":"Action > Sports > 3rd-person (Other) > Real-time > Arcade > Football (American) > Licensed","desc":"<p>No refs... No rules... Just 'classic' gridiron. Late hits, pass interferences, and other penalties are encouraged (though you can't run offside). Cheerleaders in, well, cheerleading uniforms liven up the end of the first and third quarter and there's enough stats to make the mathematically inclined happy. However, the teams features are not entirely based on real life (Indy was at the top), and it is not as addictive as the old-fashioned PC games of the early 1990's, but still a good game for someone who doesn't mind not-so-classic, almost XFL style football.</p>"},{"name":"NFL Full Contact","year":1996,"developer":"Robin Antonick Games, L.L.C.","url":"psx-chd-roms-n/NFL%20Full%20Contact%20%28USA%29.chd","filesize":76435321,"score":"","genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>The American football game contains all the licensed NFL teams, all the players (over 1500 of them) and schedules. Players choose between multiplayer mode or single player mode versus computer AI. Games can be played individually, or players can compete against a series of randomly chosen opponents in the Playoff games. Camera angles can be changed to numerous 3D views that simulate the looks of real television coverage, with a special first-person view also included. Adding to the realism is a simulated voice announcer. The player animations are motion-captured.</p>"},{"name":"NFL GameDay","year":1996,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-n/NFL%20GameDay%20%28Europe%29.chd","filesize":97735559,"score":8,"genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p>This is the first installment in the NFL GameDay series, and has all the players, teams, stadiums, stats, and injuries.  There is a variety of offensive and defensive moves you can use including dives, spins, and stiff arms on offense; and dives, jumps, forearm bashes, and swim moves on defense.</p>"},{"name":"NFL GameDay '97","year":1996,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-n/NFL%20GameDay%2097%20%28USA%29.chd","filesize":217369863,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>In addition to all the features on the previous edition of the series, <em>NFL GameDay '97</em> includes new options like season-ending injuries, a draft, more stats, and the ability to create players. The player also has expanded camera control.</p>"},{"name":"NFL GameDay 2000","year":1999,"developer":"989 Studios","url":"psx-chd-roms-n/NFL%20GameDay%202000%20%28USA%29.chd","filesize":350746399,"score":7.6,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>In addition to all the features you expect from this series, this version of GameDay includes one-handed grabs, diving into the end zone, and running out of bounds and slamming into the coach.  With a multitap controller, seven players can play at the same time. Also new in this edition of the series is the addition of a play editor and general manager mode.  With the play editor you can select patterns for your receivers and running backs as if you were the offensive coordinator.  In general manager mode, you can play through multiple seasons with one team, cut players, sign free agents, make trades, and even draft players.  Also new this year is the ability to play through an entire game as a player other than the quarterback.</p>"},{"name":"NFL GameDay 2001","year":2000,"developer":"RedZone Interactive, Inc.","url":"psx-chd-roms-n/NFL%20GameDay%202001%20%28USA%29.chd","filesize":261548223,"score":6.6,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>This edition features lifelike player specific graphics that make players look like their real life counterparts. Also new is commentary by Dick Enberg and Phil Simms.  Another feature is total-control passing and running. Total-control passing lets you lead, overthrow, and underthrow your receivers so that you can throw more completions and prevent defenders from intercepting your passes.  The play editor has been improved making it easier to make new patterns for your receivers and running backs. The general manager mode has also been changed, mostly to help you with the draft so you can easily see what areas of your team need improvement.</p>"},{"name":"NFL GameDay 2002","year":2001,"developer":"989 Studios","url":"psx-chd-roms-n/NFL%20GameDay%202002%20%28USA%29.chd","filesize":302191080,"score":6.7,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>This year's edition features motion-capture animation and commentary by Dan Fouts and Dick Enberg.</p><p>There are four primary modes of play, including season, arcade, franchise, and exhibition. The franchise mode keeps track of full individual player and team statistics over multiple seasons. Players will be drafted, improve throughout the course of their career, and retire into the game's hall of fame. The franchise mode also keeps track of statistics for the coach and the franchise. Career win/loss records, playoff appearances, and Super Bowl wins are tracked.  Season mode allows players to compete for one individual season, while exhibition mode allows for a single game to be played.  Arcade mode features simplified controls for those players looking to simply mix it up.</p>"},{"name":"NFL GameDay 2003","year":2002,"developer":"RedZone Interactive, Inc.","url":"psx-chd-roms-n/NFL%20GameDay%202003%20%28USA%29.chd","filesize":317173343,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (American) > Licensed","desc":"<p>Updated Rosters, Stadiums and Past Super Bowl Teams * ENJOY EVERY GAME MODE IMAGINABLE<br>Training Camp, Season, General Manager and More! * ULTRA RESPONSIVE GAMEPLAY PUTS YOU IN CONTROL<br>Run Over Defenders and Make One Handed Grabs! * THE MOST ADVANCE ARTIFICIAL INTELLIGENCE<br>Mix Up Your Playcalling or Failure Will Be The Result!</p>"},{"name":"NFL GameDay 2004","year":2003,"developer":"989 Studios","url":"psx-chd-roms-n/NFL%20GameDay%202004%20%28USA%29.chd","filesize":329114657,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (American) > Licensed","desc":"<p>Total Control Tackling™ means you decide if you want to take a calculated risk and go for the big hit to jar the ball loose or make a sure wrap tackle on a slippery ball carrier. Total Control Passing™ allows you to lead your speedy wideout or under throw receivers in any direction by simply pressing the directional pad.</p>"},{"name":"NFL GameDay 2005","year":2004,"developer":"SCEA Sports Studio - Red Zone","url":"psx-chd-roms-n/NFL%20GameDay%202005%20%28USA%29.chd","filesize":291177487,"score":"","genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p><em>NFL GameDay 2005</em> is the final game in the long-running series of American football games. The most important update includes the teams, uniforms, statistics and rosters of the 2003-2004 season. The main game modes are Exhibition, Season, Practice, Tournament and General Manager. In the last modes players can be traded and new talent can be recruited. It also contains enhanced graphics. Tackling is improved with a new system.</p>"},{"name":"NFL GameDay 98","year":1997,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-n/NFL%20GameDay%2098%20%28USA%29.chd","filesize":347189277,"score":7.7,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>NFL GameDay '98 has new and previous features like Preseason, Season, and Training Camp modes. You can also choose to play as a skill player, like wide receiver or fullback instead of mostly being in control of the quarterback. You also get a play editor, a create-a-player feature, and over 100 touchdown dances.</p>"},{"name":"NFL GameDay 99","year":1998,"developer":"989 Studios","url":"psx-chd-roms-n/NFL%20GameDay%2099%20%28USA%29%20%28Rev%201%29.chd","filesize":176468694,"score":7.5,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>A port of a Playstation title that offers a more action-oriented aproach to american football. You can only play the 1998 season with your choice of NFL licensed teams (tough all with the same playbook) in either the standard game mode or a pseudo coaching mode were you call the plays and watch the computer develop the action.</p><p>Additions for the pc version include expanded multiplayer support (over modem/internet/lan) and Direct3D accelerated graphics which show off the game's animations and real-time weather conditions. Also in the sound department you get in-game comment by Dick Enberg and Phil Simms.</p>"},{"name":"NFL Quarterback Club 97","year":1996,"developer":"Iguana Entertainment Incorporated","url":"psx-chd-roms-n/NFL%20Quarterback%20Club%2097%20%28Europe%29.chd","filesize":65044038,"score":6.5,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p><em>NFL Quarterback Club 97</em> utilizes many of the same gameplay elements seen in Madden NFL 97 - including the kicking T-meter, the three-quarter overhead primary camera angle, and the button assignments and controls. Player animations are fluid and realistic, and the player sprites have clearly visible jersey numbers and names. </p><p>The game also boasts a historic simulation mode. Players can choose among 50 different classic NFL game situations and try to rewrite history. Imagine...it's December 23, 1973. The Dallas Cowboys are down 28-13 to the 49ers. With under a minute remaining, the Boys score a touchdown and recover an onside kick. Can you complete one of the greatest comebacks in NFL history?</p>"},{"name":"NFL Xtreme","year":1998,"developer":"989 Studios","url":"psx-chd-roms-n/NFL%20Xtreme%20%28Europe%29.chd","filesize":170224781,"score":6.6,"genres":"Action > Sports > 3rd-person (Other) > Arcade > Football (American) > Licensed","desc":"<p><em>NFL Xtreme</em> is a licensed NFL game with 30 official teams and stadiums. Loosely simulating American football, games are played on a five-on-five format and an arcade approach is taken, with complete disregard for the official rules. Quarterbacks can easily throw 90-yard passes, defenders have hard-hitting tackling moves, and attackers can use spin or turbo to evade opponents, or flip over them. Late hits and pass interference are no problem, and you can even taunt and trash talk. To promote aggressiveness, opponents, when properly injured, can be out for an entire season.</p><p>The game modes includes exhibition matches, a regular season and play-offs. There are detailed statistics, and you can sign, release or even create new players to build your team. Highlights can be reviewed in the instant replay mode, and you can alter the weather type, difficulty level and player size in the options.</p>"},{"name":"NFL Xtreme 2","year":1999,"developer":"989 Studios","url":"psx-chd-roms-n/NFL%20Xtreme%202%20%28USA%29.chd","filesize":208647492,"score":6.5,"genres":"Action > Sports > 3rd-person (Other) > Arcade > Football (American) > Licensed","desc":"<p>This football game is a followup to NFL Xtreme. The game contains both an NFL and NFLPA license and features over 125 taunts made by 23 real NFL players and over 150 different player celebrations. Game modes include an Exhibition, Season, Playoff and Tournament mode. Other features include trades, free-agent acquisitions, a draft, the ability to create a player, three difficulty levels, adjustable weather, adjustable quarter lengths, and three different game speeds.</p><p>The game is similar to NFL Blitz. It features arcade-style five-on-five football that emphasizes speed of play and hard hits and tackles. Streamlined play calling and the fact that there are no penalties helps to encourage this fast paced type of gameplay.</p><p>The game also has two passing interfaces, an icon-based passing method and a one-button method where the computer makes the pass for the player. </p><p>Some offensive moves players can perform include power shoulder charges, double spins, super jukes, stiff arms, and clothesline tackles.</p>"},{"name":"NHL 2000","year":1999,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/NHL%202000%20%28Europe%29%20%28En%2CSv%2CFi%29.chd","filesize":478415855,"score":8.2,"genres":"Sports > Behind view > Diagonal-down > Side view > Top-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>The millennium installment in the NHL series brought as usual updated rosters, featuring for the first time the Atlanta Thrashers, plus enhanced graphics and sound.</p><p>The two main features of the game are the new Dynasty mode, allowing a player to lead a team to success for 10 straight seasons, while keeping an eye on the new talent on the yearly drafts and trading with other teams, and the face import feature, which gives the chance to assign each custom player their own face based on a photo. To do so, a photo must be placed in a folder, imported and then hotspots (head shape, eyes, nose and mouth) must be set, to define how the texture will be mapped into the face model. </p><p>Gameplay became a lot faster and tougher, and two new moves were included: \"Big Hit\", to flatten the oppositions' golden boy, and \"Special Movement\", to go around those tough defenders with ease. Other new features include individual player and goalie boost (to give an handicap for a team), jersey selection, including classic throwback jerseys.</p><p>One of the most important changes done to the game was how the game timer worked: before, the period length on the clock <em>matched</em> the time set by the player, but starting with NHL 2000, every period has 20 minutes which are <em>compressed</em> into the time set by the player. This makes penalties a lot shorter (a minor elapses in just 30 seconds in a five minute period setting) thus reducing the powerplay percentage, which experienced players could keep in the high 90's in previous games, but also fixes the handicap of goaltenders in played games (a goaltender that suffered a single goal would have his GAA a lot higher than a goalie that suffered more goals in a simulated game).</p><p>The rest of the game remains as usual: 28 teams can play in a season (with the ability to choose between a short, medium or long season length), setting the then new NHL overtime loss point, playoffs (with best of 1, 3, 5 or 7 matches), international tournament and shootout. The beginner mode continues to be featured, and allowing players to feel the ice for the first time without having to deal with complicated controls, penalties or tough opponents. </p><p>Bill Clement replaced Daryl \"Razor\" Reaugh in colour commentary, and Jim Hughson remains in play by play. Alternative rock band Garbage provided the lead track (<em>Push it!</em>, from their <em>Version 2.0</em> album).</p>"},{"name":"NHL 2001","year":2000,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/NHL%202001%20%28Europe%29%20%28En%2CSv%2CFi%29.chd","filesize":473166612,"score":8,"genres":"Sports > Behind view > Diagonal-down > Side view > Top-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>Lace up the skates and play with or against all 30 NHL teams including the new expansion Columbus Blue Jackets and Minnesota Wild. NHL 2001 invites the world to play with the addition of 20 international teams including Ukraine and Latvia. Feel the full hockey flavor by building a custom team with the jersey editor, logo importer, and customizable city and team names. EA SPORTS puts you in the game with the \"Face in the Game\" feature -- witness fans throw their hats on the ice in your honor after a hat trick. With a variety of game modes including Quick Game, Season Play, Career Mode, Playoffs and Tournaments, all the goals are just a slap shot away. </p>"},{"name":"NHL 97","year":1996,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/NHL%2097%20%28Europe%29.chd","filesize":430339869,"score":7.8,"genres":"Sports > Diagonal-down > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>1997 edition of EA's NHL sport simulation series. Improvements in this edition come mostly in the graphical arena, with a refined version of the \"virtual stadium\" system that adds new camera angles (including the classical top-down one strangely missing from NHL 96), and polygonal players instead of the bitmap-based ones with motion-captured animations.</p><p>Other extras include multiplayer support for up to 8 players through network or Gravis's GrIP system, the option to create new players and trade them around, and the usual amount of EA sports licensed multimedia flair, including an interesting \"Goalie Mask Viewer\" which lets you observe the elaboratedly decorated helmets of 30 goalies.</p>"},{"name":"NHL 98","year":1997,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/NHL%2098%20%28Europe%29%20%28En%2CSv%2CFi%29.chd","filesize":450638307,"score":8,"genres":"Sports > Diagonal-down > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>NHL 98 features much faster and refined gameplay (now using four action keys instead of two, removing the need to double-tap to perform some actions), along other new features such as \"in-the-fly\" tactics developed by Marc Crawford, then manager of the Colorado Avalanche and new commentary lines from Jim Hughson and Darryl Reaugh and a re-worked interface.Graphics are improved from the previous version with the players being less angular, and thanks to 3Dfx support, with less pixels showing in the textures. The in-game presentation follows a TV-style script, zooming in players while displaying stats during clock stoppages.</p><p>As far as game modes go, in the year of the first Olympic Tournament with professional players, NHL 98 introduced the first real international competition, with 18 International teams to choose from. Other game modes include Season (option to pick between 25 or 82 games) and Playoff (best of 1, 3, 5 or 7 matches) and a Penalty Shootout mode.</p>"},{"name":"NHL 99","year":1998,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/NHL%2099%20%28Europe%29%20%28En%2CFr%2CSv%2CFi%29.chd","filesize":479573157,"score":8.2,"genres":"Sports > Diagonal-down > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>After the award-winning NHL 98, EA worked to improve what was considered to be one of the most complete ice hockey games in the market. Along the usual and almost obligatory NHL roster updates, the International mode first featured in the previous version was expanded, allowing players to choose IIHF rules and rink size.</p><p>Graphically, the arena is more detailed with more rinkside features, and ice reflections, player faces were improved and stand more seamlessly into the model, enhanced motion capture result in better animated hits (with the ability to break the glass with a well-placed body check making a return), shots and saves, and finally an higher polygon count complete the graphic enhancements to the game.</p><p>As graphic changes aren't enough to make a game better, gameplay was also tweaked, with computer players being smarter, both in offense and defense. Shooting was tweaked (slap shots are easier to pull, players no longer skate in circles to do some backhand shots and must be facing the goal to shoot, particularly in one timers) and a new special move brings dekes, spin-o-ramas and the kind of moves Jágr, Fedorov and Selänne pull when one-on-one with the goalie. However, if the player gets too close to the crease, the referee might want to review the play in the new video goal judge, so the player must think twice before trying to pull a \"Brett Hull\". For newcomers to the sport, a new Beginner mode allows players to get used to the ice without having to concern with penalties or an overly strong opponent.</p><p>The season mode was also improved, with the players now having streaks that affect either positively or negatively his abilities. Debuting the Nashville Predators, players can either choose to play with their initial roster, or do a fantasy expansion draft.</p><p>Like in the previous year, Jim Hughson and Darryl Reaugh liven up matches with play by play and colour commentary.</p>"},{"name":"NHL Blades of Steel 2000","year":2000,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-n/NHL%20Blades%20of%20Steel%202000%20%28Europe%29.chd","filesize":200725031,"score":6.1,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>This hockey game is a followup to NHL Blades of Steel '99. It features real NHL teams and players.</p><p>The game modes featured include an Exhibition mode, Season, and Playoffs. Options include setting the difficulty level ( either Rookie, Pro, or All-Star) of the computer opponent and another option specifically for the difficulty of the opposing goalie, length of each period (5,10, or 20 minutes), length of the overtime period (either 5 minutes or sudden death), turning on or off penalties, off-sides, icing, two line passes, fighting, fatigue, and injuries. Referees can be set to either be lenient, normal, or strict when officiating the game. Also line changes and control of the goalie can be set to either be automatic or manual. Finally their is an option to either have the game be a 4-on-4 or a 5-on-5 contest during the overtime period. </p><p>Some moves during the game that players can perform is that they can pass, steal, take wrist shots, slap shots, and throw body checks. Also, the game offers several different camera viewpoints (TV, Chase, Move, Top, On Ice, Normal 1, 2, and 3, Active 1 and 2, plus Scoreboard 1 and 2) when viewing the action. </p><p>In the season mode, players can set the number of games to be played to either be 7, 41 or 82 games. Playoffs can be set to either be a one game affair, or expanded to either be a best-of-three, five or seven game series. During the season, team and free-agent players also can be traded. Also, this mode features full statistical tracking.</p><p>Randy Hahn is on hand to deliver the play-by-play commentary.</p>"},{"name":"NHL Breakaway 98","year":1997,"developer":"Sculptured Software, Inc.","url":"psx-chd-roms-n/NHL%20Breakaway%2098%20%28Europe%29.chd","filesize":81172601,"score":7.3,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>This ice hockey game has a playbook-based AI system based on the teams' actual playbooks allowing for specific teams to play their actual styles, with variable player size, from big defensemen to small speedy wingers. There is a total team management system to make trades, improve coaching, create draft picks and send players through training camps, or even send injured athletes for therapy.</p><p>The inclusion of all the marquee players such as Lemieux, Gretzky, Messier, Sakic, Hull, and others is mostly mandatory in sports games. Also, the hints about how to play each team from NHL player Keith Tkachuk are a useful resource.</p>"},{"name":"NHL Championship 2000","year":1999,"developer":"Radical Entertainment Inc.","url":"psx-chd-roms-n/NHL%20Championship%202000%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%29.chd","filesize":218972749,"score":6.8,"genres":"Sports > 3rd-person (Other) > Hockey > Licensed","desc":"<p>NHL Championship 2000 is a hockey game licensed by the NHL, NHLPA and the FOX Sports channel, which allowed the developers to use not only the likeness of their broadcasting graphics and the Fox Trax technology, but also the voice support of game broadcasters John Davidson and Kenny Albert.</p><p>One of the key aspects of the game are the passing indicators, which always show which players are open for a pass, allowing a quick, smooth passing play. Advanced puck physics allow for realistic offensive play.</p><p>Using 1999/2000 rosters, NHL Championship 2000 includes all NHL teams (including the expansion team Atlanta Trashers and All-Star teams) and 18 international teams. The season length can be defined, ranging from the bare minimum (27 games) to a full 82 games season. Player creation and trade is also possible, as well as multiplayer games.</p>"},{"name":"NHL FaceOff","year":1996,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-n/NHL%20Face%20Off%20%28Europe%29.chd","filesize":49745921,"score":8,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>The first in the NHL FaceOff series.  You'll find one-timers, a wide selection of checks, slap shots, drop passes, every NHL player and team, and statistics.</p><p>Also found in FaceOff includes pretty good AI for the time of the game's release. In terms of sound, FaceOff really tries to recreate an in the arena hockey sound, with the announcer's voice echoing combined with organ music and cheering from the crowd.</p><p>There are also multiple camera angles that can put you in the middle of the ice.</p>"},{"name":"NHL FaceOff '97","year":1996,"developer":"Killer Game","url":"psx-chd-roms-n/NHL%20Face%20Off%20%2797%20%28Europe%29.chd","filesize":169465761,"score":7.1,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>1997 NHL Hockey game that departed from the incremental year-to-year improvements to ice-hockey games.  Offers new AI for play against the computer that is \"All-Star\" level and the default game that offers honest hockey, pure and simple, crisp and satisfying.</p><p>Other features include, team management, new moves previously unseen such as hip checks, fake shots, backwards skating and more.  All 26 NHL arenas are playable with realistic player abilities based on their real NHL statistics.</p>"},{"name":"NHL FaceOff '98","year":1997,"developer":"Killer Game","url":"psx-chd-roms-n/NHL%20FaceOff%2098%20%28Europe%29.chd","filesize":141781829,"score":7,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>In this edition, you can trade players, release players, create a player, and sign free agents. The modes of play include the usual season, exhibition, and quick start.  One new feature is multi-team play, which lets more than one user play within the same season.</p>"},{"name":"NHL FaceOff '99","year":1998,"developer":"Killer Game","url":"psx-chd-roms-n/NHL%20FaceOff%2099%20%28Europe%29.chd","filesize":245151095,"score":6.8,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>This has all the features you would expect from a licensed hockey game. It gives you all of the authentic NHL teams and players including the expansion teams. You can trade and release players, create your own players, and sign free agents. The ice can be viewed from five camera angles, allowing you to watch the game play out in a variety of different ways. Up to eight human players can play via the multitap.</p>"},{"name":"NHL FaceOff 2000","year":1999,"developer":"989 Studios","url":"psx-chd-roms-n/NHL%20FaceOff%202000%20%28Europe%29.chd","filesize":275062325,"score":7,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>Red Wings Coach Scotty Bowman helped improve NHL FaceOff 2000. More than 150 motion captured animations. Mike Emrick and Darren Pang do commentary. The new puck halo also improves gameplay.</p>"},{"name":"NHL FaceOff 2001","year":2000,"developer":"SolWorks","url":"psx-chd-roms-n/NHL%20FaceOff%202001%20%28USA%29.chd","filesize":291075064,"score":7,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>This year's edition allows you to compete against legendary players including Gordie Howe, Bobby Hull, Phil Esposito, and Marcel Dionne.  New Jersey Devils announcers Mike Emrick &amp; Darren Pang call the games.</p><p>There is an exhibition mode for up to eight players with the Multitap, a season mode for multiple players, playoff mode, tournament mode, a practice option, and shoot-out mode, that helps to sharpen your breakaway and deke moves.</p><p>Also new this year are the updated rosters of all NHL teams including expansion teams Columbus BlueJackets and Minnesota Wild.</p>"},{"name":"NHL Open Ice: 2 On 2 Challenge","year":1996,"developer":"Midway Manufacturing Company","url":"psx-chd-roms-n/NHL%20Open%20Ice%20-%202%20on%202%20Challenge%20%28USA%29.chd","filesize":54565132,"score":5.8,"genres":"Sports > Side view > Arcade > Hockey > Licensed","desc":"<p><em>NHL Open Ice</em> is the NBA Jam for ice hockey, with a 2 on 2 arcade action featuring a full NHL license including actual team names and logos and 120 actual NHLPA players with reflective stats for the 1995-96 season.</p><p>The game features power-ups that will aid the players along during a game including the \"Hot Meter\" which is filled with every score, body check and steals. Once the meter is full, the player will literally catch fire and their stats will max out for a brief period of time, allowing the player to score goals better, steal the puck more often, etc.</p><p>There is five difficulty settings and adjustable options such as period time times and cheat options such as \"Big Head\" mode and multiplayer capabilities for either head-to-head action or co-op play. <em>Chicago Blackhawks</em> announcer, Pat Foley, lends his voice talents to the game for in-game commentary.</p>"},{"name":"NHL Powerplay '96","year":1996,"developer":"Radical Entertainment Inc.","url":"psx-chd-roms-n/NHL%20Powerplay%20%2796%20%28USA%29.chd","filesize":130258898,"score":7.8,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>An early competitor to the EA Sports NHL series, <em>NHL Powerplay '96</em> features motion-captured players, an NHL Player’s Association license, a variety of managerial options, and the ability to play seasons and tournaments.</p><p>It is the first NHL game to include a World Tournament mode in which the NHL players can compete against each other on their respective national teams.</p><p>In a time where developers tried to get the most from 32-bit consoles, leading to the \"unlimited camera angles\" blurb on many games, NHL Powerplay stuck with the one most people used, the overhead \"behind the goal\" view, popularized by EA's NHL series - and it was one of first full 3D sports games on the market.</p>"},{"name":"NHL Powerplay 98","year":1997,"developer":"Radical Entertainment Inc.","url":"psx-chd-roms-n/NHL%20Powerplay%2098%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":231110255,"score":7.3,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p><em>NHL Powerplay 98</em> is a hockey game where the player can control a team of his choice to bring it to victory and glory. The game modes are the typical genre choices: Either a whole NHL season, the NHL playoffs or a league with 15 national teams. The team logos and player names are official licensed but in contrast to NHL 98 it uses the data from 1996/1997.</p><p>The gameplay itself is more action oriented than a simulation and uses several shooting and pass variations which are activated with more or less complicated key combinations. Six camera angles and a instant replay feature complement the TV atmosphere. </p><p>The game also features several tactical possibilities. For eight game situations the player can choose between three behaviours, e.g. how the players set up shots in the offensive zone. During the season there is a option to trade players with other teams. Extensive mid-season statistics, which can be shown for every team in the league, help planning transfers and tactics.</p>"},{"name":"NHL Rock the Rink","year":2000,"developer":"Electronic Arts Canada","url":"psx-chd-roms-n/NHL%20Rock%20the%20Rink%20%28Europe%29.chd","filesize":333748790,"score":7.2,"genres":"Sports > 3rd-person (Other) > Fighting > Hockey > Wrestling > Licensed","desc":"<p>Madness on ice!  EA tries to reproduce the success of NFL Blitz with this crossover 3 on 3 Hockey / wrestling title.  Includes all of the teams and key players from the NHL as well as created teams and over the top checking, fighting and power-up skating.  Includes many unlockables and cheats, special game modes (first to 10, old time hockey) and 10 totally new arenas.</p>"},{"name":"Nibiiro no Koubou - 32 Nin no Senshachou","year":1997,"developer":"Shangri-La","url":"psx-chd-roms-n/Nibiiro%20no%20Koubou%20-%2032%20Nin%20no%20Senshachou%20%28Japan%29.chd","filesize":197839199,"score":"","genres":"Adventure > Strategy > 1st-person > Top-down > Wargame > Direct control > Menu structures > Tank > War","desc":"<p><em>Nibiiro no Koubou: 32-nin no Senshachou</em> is a tank-themed strategy game which takes place in 1929 in Eurodyell Republic. While the name of the country is fictional, it is set on a region that resembles Europe on a globe which is shaped to look like Earth. Furthermore, tanks featured in the game, which are several dozen, are all modeled on actual known World War II tanks such as Panther or Tiger II. The coup suddenly takes place in Eurodyell Republic and the player, whose name is entered before starting the campaign, finds himself as one of the tank commanders of an experimental tank model. The game consists of adventure element which mostly entail on-screen dialogues over pre-rendered backgrounds, and action strategy where player actually controls the tank from 1st-person and fires at the enemy tanks. During tank simulation mode, the screen can be switched to top-down overview which serves as a map and shows both allied and enemy tanks, while during controlling a tank the player moves the turret and fires at the enemy. The story is split into chapters and game progresses after destroying all enemy tanks on each map as the story unfolds.</p>"},{"name":"Nice Cats","year":2000,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-n/Nice%20Cats%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.chd","filesize":295693219,"score":"","genres":"Puzzle","desc":"<p><em>Nice Cats</em> is a budget priced game for children. It has four activities on it's main menu, one of which just adjusts the sound levels. The other three activities are:* A Cartoon: When selected this plays a cartoon about the happy cats and the nice lady they live with</p><ul><li>Colouring: Here there are six pictures taken from the cartoon that the player can colour on screen.</li><li>A sliding block puzzle: Six pictures from the cartoon can be made into sliding block puzzles with varying degrees of complexity</li></ul>"},{"name":"Nichibutsu Arcade Classics","year":1995,"developer":"","url":"psx-chd-roms-n/Nichibutsu%20Arcade%20Classics%20%28Japan%29.chd","filesize":68518641,"score":"","genres":"Compilation > Arcade","desc":"<p><em>Nichibutsu Arcade Classics</em> contains four classic Nichibutsu games in emulated form:</p><ul><li>Moon Cresta</li><li>Crazy Climber</li><li>Frisky Tom</li><li>SF-X</li><li><em>Crazy Climber '85</em>, a version of Crazy Climber with enhanced graphics, original to this release</li><li><em>Tom's Strikes Back</em>, a version of Frisky Tom with modified gameplay, where instead of picking up the pipe pieces that are dropped by the mice, you rotate pipe joints, also original to this release.</li></ul><p>Game settings can be configured per game before you begin to play. You can also see their instruction card in the options screen. Additionally, a gallery of posters for their earlier games, including their release dates, is accessible from the title screen.</p>"},{"name":"Nicktoons Racing","year":2001,"developer":"Software Creations Ltd.","url":"psx-chd-roms-n/Nicktoons%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.chd","filesize":202112435,"score":6.7,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Nicktoons Racing</em> is another Mario Kart clone using cartoon characters from Nickelodeon. The gameplay follows the standards closely: the player controls one of the characters to win races on tracks filled with scattered power-ups and ramps. A meter at the top of the screen shows the current position and the amount of nitro fuel available. Extra fuel can be collected as shiny orbs on the road. The gift boxes contain random power-ups, like coconuts to throw at the other racers, flash lights to temporally blind them, and traps like baby powder, trash cans and green goo to slow down the competition.</p><p>The game has four modes for single player. The main cups mode is the championship, where the objective is to arrive at least in third place to qualify for the next race. In time trial mode, the goal is to complete laps as fast as possible, with a ghost car showing the fastest performance to be surpassed. Race for fun is a practice mode, where any of the tracks can be explored without the pressure to win. In relay mode, the player switches characters after each lap.</p><p>There are three modes for multiplayer. The cups and relay modes are similar to their solo counterparts, but splitting the screen horizontally in the middle to show the two players. The versus mode is the \"one on one\" mode, where two players compete directly against each other without any other racers.</p>"},{"name":"Night Head: The Labyrinth","year":1995,"developer":"Scitron & Art Inc.","url":"psx-chd-roms-n/Night%20Head%20-%20The%20Labyrinth%20%28Japan%29.chd","filesize":299377262,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Live action > Fantasy > Horror > Licensed","desc":"<p><em>Night Head: The Labyrinth</em> is a mystery adventure game based on the <em>Night Head</em> TV show that tells the original story parallel to the TV series. The general premise focuses on two brothers, Naoto Kirihara and Naoya Kirihara who have supernatural abilities. Naoto is an older brother who can use psychokinesis, the ability to control objects and people with his mind. His younger brother, Naoya, possesses a psychic ability of reading people's minds and hearts. Both have trouble fully controlling their abilities, especially when becoming emotional. Both brothers were locked inside a research institute hidden deep in the mountains and controlled by a figure of a tremendous supernatural power. The barrier held them inside, until one day it disappeared and they managed to escape.</p><p>The game tells another story of the Kirihara brothers. The entire story takes place in a secluded mansion in the forest and game plays as a 1st-person horror adventure with pre-rendered backgrounds and live actors. Moving from one location to another is animated, but gameplay is otherwise tied to a static screen where you either interact with objects on the screen or talk to other characters. Similar to visual novel storytelling, game features choices that affect the story and lead to multiple different endings.</p>"},{"name":"Night Raid","year":2002,"developer":"Takumi Corporation","url":"psx-chd-roms-n/Night%20Raid%20%28Japan%29.chd","filesize":179300581,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>In the year 3309, humanity has been taken over by computers. The planet was mechanized by the main computer Batinbo at the south pole, and it was thought that all organic life on the planet had been wiped out. Humanity's fight, however, was not yet over. 87 years later, a computer in the desert that was once Asia began a program -- a program called \"Vector\", left by humans just before their extinction, created to restore life to the world. Vector must invade the computer Batinbo, and complete this final mission to revive humanity.</p><p><em>Night Raid</em> is a conversion of the 2001 vertical arcade shoot-em-up from Takumi, and has a similar feel to their earlier game Mars Matrix. Like in <em>Mars Matrix</em>, destroyed enemies release pickups, but rather than powering up your weapons they now affect your score multiplier. The multiplier is always slowly counting back to zero, but picking up the Score Items released by enemies will increase it. If a Score Item falls out the bottom of the screen, the multiplier is reduced, and can in fact go into negative, at which point the player will actually lose points for destroying enemies. The score can even go negative, and this is actually a viable method of play as the game will also track the lowest scores in addition to the highest ones.</p><p>You have a standard shot (upgradable through pickups), bombs (which can also be picked up), and an attack called the \"hagu launcher\" which makes your ship crash into enemy ships to destroy them, and must be recharged after use. The game has six stages, and includes the original arcade mode as well as a score attack mode.</p>"},{"name":"Night Striker","year":1995,"developer":"Taito Corporation","url":"psx-chd-roms-n/Night%20Striker%20%28Japan%29.chd","filesize":244684227,"score":5.1,"genres":"Action > Racing / Driving > Behind view > Arcade > Shooter > Flight / aviation > Cyberpunk / dark sci-fi","desc":"<p><em>Night Striker</em> is a third-person shooter reminiscent of Space Harrier. Laser optics expert Dr. Lindvery Maska and his daughter have been kidnapped by a terrorist group, and Dick Dagras, head of the Special Service Agency, is mobilizing a group of elite soldiers experienced in the use of special armored flying cars, in order to rescue Dr. Maska and destroy this terrorist group.</p><p>The player flies through each stage, controlling their armored car and shooting down waves of enemies. A boss appears at the end of each stage, and after this the player must choose what path to take in the next stage, as in Darius. Instead of lives, the player has a shield that takes damage from each hit, but is recharged at the end of each stage.</p><p>The Sega CD version of the game features remixed CD-audio, and the Saturn version features a set of exclusive bonus levels.</p>"},{"name":"Nightmare Creatures","year":1997,"developer":"Kalisto Entertainment SA","url":"psx-chd-roms-n/Nightmare%20Creatures%20%28Europe%29.chd","filesize":368516252,"score":7.2,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > Horror > Regional differences","desc":"<p>Adam Crowley, a once-respected scientist, now turned to black magic, has released a demonic contagion onto the streets of 1834 London. Based on the long-lost work of the Brotherhood of Hecate, it mutates its victim's bodies into grotesque nightmare creatures, and changes their minds into those of murderous brutes. When Dr. Jean F. began investigating, he was murdered. Now, as either his friend Ignatius Blackward, a priest and expert on the occult, or his daughter Nadia, a biologist and gymnast, fight against the creatures that roam the streets of London, the revived Brotherhood of Hectate, and the man behind it all, Adam Crowley.</p><p>Gameplay is 3rd-person action, with an emphasis on melee combat. Ignatius and Nadia have different fighting styles and special moves. To keep things moving, an adrenaline meter depletes, killing the hero if it ever runs out. Kill monsters to top it up again. Gather special items to use on enemies, or just kill them using basic weapons.</p>"},{"name":"Nightmare Creatures II","year":2000,"developer":"Kalisto Entertainment SA","url":"psx-chd-roms-n/Nightmare%20Creatures%20II%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":356992837,"score":6.6,"genres":"Action > 3rd-person (Other) > Puzzle elements > Horror","desc":"<p>Adam Crowley, from the original Nightmare Creatures, is back to unleashing creatures in London. As Wallace, you must fight the monsters, rescue your lover Rachel, and travel across nine levels in search of Crowley and the final battle.</p>"},{"name":"Nijiiro Dodgeball: Otome-tachi no Seishun","year":2002,"developer":"Will Co., Ltd.","url":"psx-chd-roms-n/Nijiiro%20Dodgeball%20-%20Otome-tachi%20no%20Seishun%20%28Japan%29.chd","filesize":231436916,"score":"","genres":"Action > Sports > Side view > Anime / Manga > Arcade > Managerial / business simulation > Dodgeball","desc":"<p>In the near future, the sport of dodgeball has grown in popularity to rival soccer and baseball, and an international professional league has been established. Youth teams from across the country play and compete for a chance to join the pros. Ten girl's teams have been selected for a tournament, and the winning team will be allowed to join the professional league.</p><p><em>Nijiiro Dodgeball</em> is a dodgeball game in the tradition of Super Dodge Ball featuring an all-female cast. Each team of four, plus three support players on each side, must use a variety of techniques including dashes, jumps, and numerous special moves, to knock out the other team by draining their stamina. If all four players on a team are knocked out, they lose.</p><p>There are two game modes available. Venus League mode is a story mode in which the player selects a manager and a team, and must lead them to league victory while training their players' attributes. As the story proceeds, various events happen which may effect specific players' abilities and relationships with each other, and it is up to the player as the manager to keep their team competitive. Spot Match mode is a free versus mode for one or two players where any two teams can square off. There are ten different teams to choose from, each with characters designed by popular illustrators.</p>"},{"name":"Ninja Jajamaru-kun: Onigiri Ninpōchō","year":1997,"developer":"Infinity Co., Ltd."},{"name":"Ninja: Shadow of Darkness","year":1998,"developer":"Core Design Ltd.","url":"psx-chd-roms-n/Ninja%20-%20Shadow%20of%20Darkness%20%28Europe%29.chd","filesize":367255288,"score":6.3,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Martial arts","desc":"<p>Enter the mystical world of Kurosawa, the young ninja, as he fights his way through 11 levels of puzzles, baddies and bosses with dozens of fighting moves, weapons and magic spells in this third person action arcade game.</p><p><em>Ninja: Shadow of Darkness</em> was originally developed for the Sega Saturn and then moved over to the PlayStation. The game is an action/arcade style game similar to Fighting Force, with some additional platformer elements.</p>"},{"name":"No Fear Downhill Mountain Bike Racing","year":1999,"developer":"Unique Development Studios AB","url":"psx-chd-roms-n/No%20Fear%20Downhill%20Mountain%20Biking%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.chd","filesize":265863233,"score":7.1,"genres":"Racing / Driving > Sports > 1st-person > 3rd-person (Other) > Bike / bicycling > Licensed","desc":"<p>No Fear Downhill Mountain Biking is the first dedicated video game of the sport downhill mountain biking.</p><p>Compete in eleven locations all over the world against computer opponents or against a friend. Upgrade your bike in the shop between the races.</p>"},{"name":"No One Can Stop Mr. Domino","year":1998,"developer":"Artdink Corporation","url":"psx-chd-roms-n/No%20One%20Can%20Stop%20Mr.%20Domino%20%28Europe%29.chd","filesize":109231773,"score":7,"genres":"Action > Puzzle > Racing / Driving > Diagonal-down > 2D scrolling > Falling block puzzle > Direct control","desc":"<p>Most dominoes wait forever, just waiting to be toppled over. But no one can stop Mr. Domino - he has to run around everywhere, causing mayhem everywhere he goes. Help Mr. Domino use the domino effect to trigger tricks and traps on unsuspecting objects and people!</p><p><em>No One Can Stop Mr. Domino</em> is a puzzle game which sees you controlling the titular Mr. Domino (or one of his friends, if you prefer) as he zips around levels which can be best described as a racetrack. As the title suggests, you can't actually <em>stop</em> Mr. Domino - however, you can guide him around the track, speed him up and slow him down. He'll need to dodge obstacles as he aims to activate \"tricks\" which are placed around the board.</p><p>By holding down X, Circle, Triangle or Square as he runs, players can lay a trail of dominoes behind Mr. Domino. When he reaches the dominoes you've placed, guide him into them to make them topple and start a chain reaction. Make dominoes fall onto the \"trick switches\" to activate them. If you're clever, you can set off a chain reaction of dominoes by placing the next set of dominoes from the Hint Tile (a red circle) to the next trick switch, and so on, until all the level's tricks are completed. As Mr. Domino runs, he loses stamina - lose all his stamina, and it's Game Over. You can prevent this by running over Stamina Tiles, which replenish all his stamina.</p><p>Mr. Domino can cause chaos in a variety of places - topple cards and shoot billiards at the casino; heat popcorn and crash toy cars in the supermarket; or crush a grandfather with a gigantic bell and indirectly cause a father to get punched in the genitals in the family home. As the title says: No One Can Stop Mr. Domino.</p>"},{"name":"Nobunaga no Yabou - Haouden","year":1995,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-n/Nobunaga%20no%20Yabou%20-%20Haouden%20%28Japan%29.chd","filesize":362866789,"score":"","genres":"Strategy > Top-down > Turn-based > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p><em>Haōden</em> is the fifth game in Koei's <em>Nobunaga's Ambition</em> series, and once more is a historic war simulation set in 16th century Japan. Up to eight players can participate in one of three different scenarios with the ultimate goal of unifying the whole of Japan. Nearly 60 different real-life warlords and their territories are represented and available to play as. The three scenarios available are Nobunaga's rise to prominence in 1551, the Tenka Fubu campaign towards Kyoto in 1568, and Nobunaga's death in 1582.</p>"},{"name":"Nobunaga no Yabou - Reppuuden","year":1999,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-n/Nobunaga%20no%20Yabou%20-%20Reppuuden%20%28Japan%29.chd","filesize":92189239,"score":"","genres":"Strategy > Diagonal-down > Free-roaming camera > Isometric > Turn-based > Turn-based strategy > Menu structures > Japan (Ancient/Classical/Medieval) > War","desc":"<p><em>Nobunaga no Yabō: Reppūden</em> is the eighth title in the <em>Nobunaga's Ambition</em> series. This edition is a strategy-class game that simulates soldiers' experiences during the chaotic Warring States period. Internal affairs is a section of the castle where you can view the progress of various facilities developed beneath. The soldiers participate in combat where the size of the battlefield fluctuates based on how many troops are involved. There is a concept known as \"Daimyo prestige,\" which signifies the Sengoku daimyo's authority and power. From Ezo in the north to Satsuma in the south, the player assumes the role of a Sengoku daimyo with the goal of conquering all 40 castles in Japan.</p><p>The console versions are not completely identical as some content has been cut.</p>"},{"name":"Nobunaga no Yabou - Shouseiroku","year":1997,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-n/Nobunaga%20no%20Yabou%20-%20Shouseiroku%20%28Japan%29%20%28Rev%201%29.chd","filesize":439663416,"score":"","genres":"Strategy > Diagonal-down > Isometric > Turn-based > Historical events > Japan (Ancient/Classical/Medieval) > War","desc":"<p><em>Nobunaga no Yabō: Shōseiroku</em> is a turn-based tactical strategy game set in 16th century feudal Japan. It is the seventh title in the <em>Nobunaga's Ambition</em> series.</p>"},{"name":"Nobunaga no Yabou - Tenshouki","year":1996,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-n/Nobunaga%20no%20Yabou%20-%20Tenshouki%20%28Japan%29.chd","filesize":372402503,"score":"","genres":"Strategy > Diagonal-down > Isometric > Turn-based > Historical events > Japan (Ancient/Classical/Medieval) > War","desc":"<p><em>Nobunaga no Yabō: Tenshōki</em> is a tactical strategy game set in 16th century feudal Japan. It is the sixth game in the <em>Nobunaga's Ambition</em> war simulation series. The player can educate warlords and increase their fighting power. He/she can let them go into battle and check their statuses in the meantime. It is possible to have dozens of opponents fighting alone in a given scenario.</p>"},{"name":"Nobunaga no Yabou - Tenshouki with Power Up Kit","year":1997,"developer":"Koei Tecmo Games Co., Ltd.","url":"psx-chd-roms-n/Nobunaga%20no%20Yabou%20-%20Tenshouki%20with%20Power%20Up%20Kit%20%28Japan%29.chd","filesize":372674771,"score":"","genres":"Compilation > Strategy > Diagonal-down > Wargame > Historical events > Japan (Ancient/Classical/Medieval) > War","desc":"<p>A compilation of Nobunaga no Yabō: Tenshōki and Nobunaga no Yabō: Tenshōki - Power Up Kit.</p>"},{"name":"Nobunaga's Ambition","year":1998,"developer":"Tecmo Koei Games Co., Ltd."},{"name":"Nobunaga's Ambition II","year":1998,"developer":"Koei Tecmo Games Co., Ltd."},{"name":"Nobunaga's Ambition: Lord of Darkness","year":1999,"developer":"Koei Tecmo Games Co., Ltd."},{"name":"Nobunaga's Ambition: Reppuden with Power Up Kit","year":2000,"developer":"Koei Tecmo Games Co., Ltd."},{"name":"Nobunaga's Ambition: Shouseiroku with Power Up Kit","year":1999,"developer":"KOEI Co., Ltd."},{"name":"Noddy's Magic Adventure","year":2000,"developer":"Minds Eye Productions","url":"psx-chd-roms-n/Noddy%27s%20Magic%20Adventure%20%28Europe%29%20%28En%2CFr%29.chd","filesize":376392113,"score":"","genres":"Action > Educational > Racing / Driving > Behind view > Diagonal-down > Mini-games > Direct control > Pre-school / toddler > Licensed","desc":"<p><em>Noddy's Magic Adventure</em> is an educational game that sees the player complete a number of tasks in the world of Toyland, such as collecting items or racing computer-controlled characters.</p>"},{"name":"NOeL - La Neige (Disc 1)","year":1998,"developer":"Flight-Plan Inc.","url":"psx-chd-roms-n/NOeL%20-%20La%20Neige%20%28Japan%29%20%28Disc%201%29.chd","filesize":344873274,"score":"","genres":"Simulation > 1st-person > Anime / Manga > Dating simulation","desc":"<p>In simulation game \"NOel～La neige～\", you have to communicate with the three girls you met and get acquainted with them.<br>Talk to them with video phone and create a future for you and them.<br>You decide your own future!</p>"},{"name":"NOeL - La Neige (Disc 2)","year":1998,"developer":"Flight-Plan Inc.","url":"psx-chd-roms-n/NOeL%20-%20La%20Neige%20%28Japan%29%20%28Disc%202%29.chd","filesize":391240613,"score":"","genres":"Simulation > 1st-person > Anime / Manga > Dating simulation","desc":"<p>In simulation game \"NOel～La neige～\", you have to communicate with the three girls you met and get acquainted with them.<br>Talk to them with video phone and create a future for you and them.<br>You decide your own future!</p>"},{"name":"NOeL - La Neige (Disc 3)","year":1998,"developer":"Flight-Plan Inc.","url":"psx-chd-roms-n/NOeL%20-%20La%20Neige%20%28Japan%29%20%28Disc%203%29.chd","filesize":385859855,"score":"","genres":"Simulation > 1st-person > Anime / Manga > Dating simulation","desc":"<p>In simulation game \"NOel～La neige～\", you have to communicate with the three girls you met and get acquainted with them.<br>Talk to them with video phone and create a future for you and them.<br>You decide your own future!</p>"},{"name":"NOeL - La Neige Special","year":1998,"developer":"Flight-Plan Inc.","url":"psx-chd-roms-n/NOeL%20-%20La%20Neige%20Special%20%28Japan%29.chd","filesize":528636031,"score":"","genres":"Simulation > 1st-person > Anime / Manga > Dating simulation","desc":"<p>A sequel to \"NOel～La neige\", this title takes place during the heroines' last two weeks in Kamakura, before they enter University after graduating from High School. Communicate with them with visual phone and pave your future.</p>"},{"name":"NOeL - Not Digital (Disc 1)","year":1996,"developer":"Pioneer LDC, Inc.","url":"psx-chd-roms-n/NOeL%20-%20Not%20Digital%20%28Japan%29%20%28Disc%201%29.chd","filesize":451620489,"score":"","genres":"Simulation > 1st-person > Anime / Manga > Dating simulation","desc":"<p>NOëL NOT DiGITAL is a simulation game in which player is given four months’ time to communicate with girls met in a beach resort during summer. Enjoy communicating with the girls and write the future with them today.</p>"},{"name":"NOeL - Not Digital (Disc 2)","year":1996,"developer":"Pioneer LDC, Inc.","url":"psx-chd-roms-n/NOeL%20-%20Not%20Digital%20%28Japan%29%20%28Disc%202%29.chd","filesize":395383782,"score":"","genres":"Simulation > 1st-person > Anime / Manga > Dating simulation","desc":"<p>NOëL NOT DiGITAL is a simulation game in which player is given four months’ time to communicate with girls met in a beach resort during summer. Enjoy communicating with the girls and write the future with them today.</p>"},{"name":"NOeL 3 - Mission on the Line (Disc 1)","year":1999,"developer":"Flight-Plan Inc.","url":"psx-chd-roms-n/NOeL%203%20-%20Mission%20on%20the%20Line%20%28Japan%29%20%28Disc%201%29.chd","filesize":463684182,"score":"","genres":"Adventure > Strategy > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p>Save the students snatched away by terrorists in adventure game \"Noel3 MISSION ON THE LINE\". In addition to mystery-solving elements, a thrilling storyline and wealth of animation deliver an enhanced gameplay.</p>"},{"name":"NOeL 3 - Mission on the Line (Disc 2)","year":1999,"developer":"Flight-Plan Inc.","url":"psx-chd-roms-n/NOeL%203%20-%20Mission%20on%20the%20Line%20%28Japan%29%20%28Disc%202%29.chd","filesize":444207686,"score":"","genres":"Adventure > Strategy > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p>Save the students snatched away by terrorists in adventure game \"Noel3 MISSION ON THE LINE\". In addition to mystery-solving elements, a thrilling storyline and wealth of animation deliver an enhanced gameplay.</p>"},{"name":"NOeL 3 - Mission on the Line (Disc 3)","year":1999,"developer":"Flight-Plan Inc.","url":"psx-chd-roms-n/NOeL%203%20-%20Mission%20on%20the%20Line%20%28Japan%29%20%28Disc%203%29.chd","filesize":442126249,"score":"","genres":"Adventure > Strategy > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p>Save the students snatched away by terrorists in adventure game \"Noel3 MISSION ON THE LINE\". In addition to mystery-solving elements, a thrilling storyline and wealth of animation deliver an enhanced gameplay.</p>"},{"name":"NOON: New Type Action Game","year":1998,"developer":"Micro Cabin Corp."},{"name":"Norse by Norse West: The Return of the Lost Vikings","year":1997,"developer":"Blizzard Entertainment Inc.","url":"psx-chd-roms-n/Norse%20by%20Norsewest%20-%20The%20Return%20of%20the%20Lost%20Vikings%20%28USA%29.chd","filesize":152210752,"score":7.2,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Fantasy > Sci-fi / futuristic > Comedy","desc":"<p>Get ready for more nights of masochistic puzzle goodness, because the Lost Vikings need your help once again! The brothers (Erik the Swift, Baleog the Fierce and Olaf the Stout) are trying to get back home and you need to guide them through. Two brand new characters (Fang the Werewolf and Scorch the Dragon) also join the fray. Each character has their own special talents and they must be used in concert if you are to win.</p>"},{"name":"Not Treasure Hunter","year":1996,"developer":"Acti-Art Corporation","url":"psx-chd-roms-n/Not%20Treasure%20Hunter%20%28Japan%29.chd","filesize":115049326,"score":"","genres":"Action > 3rd-person (Other) > Contemporary > Thriller","desc":"<p>British archaologist James Arklight receives a note with a clue to the location of an ancient civilization. Pursuing the treasure, though, will bring him in contact with a dying adventurer with a dire warning, a girl in need of rescuing, and countless deadly traps and creatures.</p><p><em>Not Treasure Hunter</em> is a linear action-adventure game following a preset plot. Each action scene follows the player through different caves or other classic adventure movie tropes. Death lurks around every corner, and the slightest wrong move will doom the player to a quick death, requiring them to start the game over. The protagonist is equipped with a gun, giving the player some modicum of defense agains the lizard people and giant spiders that inhabit the caves they're exploring, and they can also kick enemies. Aside from simple combat, players will also sometimes be faced with multiple-choice options of how to proceed. Rather than branching story paths, it's a simple choice between life or death: the right option lets the player continue with the story, and the wrong option instantly kills them in one of many different ways.</p>"},{"name":"Note, The","year":1997,"developer":"NK System Co., Ltd.","url":"psx-chd-roms-n/Note%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":193883934,"score":6.2,"genres":"Action > 1st-person > Puzzle elements > Survival horror > Detective / mystery","desc":"<p>Linda, Toshi and Dave, three members of an occult group of a senior high school end up missing while investigating a mansion in a town in southern Europe. Linda, one of the group sent her mother photos of spirits she captured inside the mansion before she disappeared.</p><p>You are Akira, a freelance journalist. Linda's mother hired you and your assistant Angela to find the whereabouts of her daughter and the two other kids she was with.</p><p><em>The Note</em> is an action adventure survival horror title, you move around the levels in a first person view and can interact with almost everything in the rooms. Curtains can be opened, fireplaces can be lit (granted, if you have any wood) and items such as paintings can be examined for additional info.</p><p>The game allows binding functions such as Check, Open or item-based functions such as Shotgun or Match to the shoulder-buttons, so you can use doors and weapons without going through the menu every single time.</p><p>In the general fashion of survival horror games, you must lit torches or open curtains in order to access dark corners, ie. to use a key to a nearby door or to examine a painting closely. You must also conserve your ammunition since nightly creatures such as rats, bats, werewolves and zombies roam the levels.</p><p>You can exit the levels and visit the city where you can buy and sell supplies, rest or save your game. These parts work much like menu based role playing games.</p>"},{"name":"Novastorm (Disc 1)","year":1995,"developer":"Psygnosis Limited","url":"psx-chd-roms-n/Novastorm%20%28Europe%29%20%28Disc%201%29.chd","filesize":345145349,"score":6.6,"genres":"Action > Behind view > Video backdrop > Arcade > Rail shooter > Sci-fi / futuristic","desc":"<p>In the distant future, humans have left Earth, carrying its ecosystem with them. However, the journey to the stars lasted longer than they had thought. Computers took control of navigation, and humans had nothing else to do but sleep, dreaming of a new paradise. When the mysterious Scarab-X forces attacked, the Scavenger 4 squadron became humanity's only hope for survival.</p><p><em>Novastorm</em> is a rail shooter in which players blast enemies against a cinematic backdrop, trying to kill the computer-controlled fighters before they take over the world. Unlike first-generation interactive movies with action, the game has hooks into the environment: if the player-controlled fighter moves into the path of a pre-rendered obstacle, there is a collision and the craft takes damage.</p>"},{"name":"Novastorm (Disc 2)","year":1995,"developer":"Psygnosis Limited","url":"psx-chd-roms-n/Novastorm%20%28Europe%29%20%28Disc%202%29.chd","filesize":402274250,"score":6.6,"genres":"Action > Behind view > Video backdrop > Arcade > Rail shooter > Sci-fi / futuristic","desc":"<p>In the distant future, humans have left Earth, carrying its ecosystem with them. However, the journey to the stars lasted longer than they had thought. Computers took control of navigation, and humans had nothing else to do but sleep, dreaming of a new paradise. When the mysterious Scarab-X forces attacked, the Scavenger 4 squadron became humanity's only hope for survival.</p><p><em>Novastorm</em> is a rail shooter in which players blast enemies against a cinematic backdrop, trying to kill the computer-controlled fighters before they take over the world. Unlike first-generation interactive movies with action, the game has hooks into the environment: if the player-controlled fighter moves into the path of a pre-rendered obstacle, there is a collision and the craft takes damage.</p>"},{"name":"Nuclear Strike","year":1997,"developer":"Tiburon Entertainment","url":"psx-chd-roms-n/Nuclear%20Strike%20%28Europe%29.chd","filesize":504787747,"score":7.3,"genres":"Action > Diagonal-down > Shooter > Helicopter","desc":"<p>After the Middle East, South America, the United States, and the former U.S.S.R, this fifth installment of the Strike takes the action to the heart of Asia, following the trail of Colonel LeMonde, who has terrorized South East Asia. LeMonde is armed with one prototype nuclear missile warhead, modified to catalyze a chain reaction that can completely destroy the ozone layer and thus irradiate the Earth. The hunt for LeMonde will take the player from Indocine (intended to suggest Indochina, the mainland of South East Asia), to the South China Sea to combat Napoleon Hwong, then to the heart of North Korea to uncover the nuclear schemes of Kym Zung-Lee (intended to suggest Kim Jong Il), and finally to Siberia for a final battle. </p><p>With the aid of fellow operatives, the player pilots the Super Apache, a fictional helicopter variant that is armed with Hellfire and Sidewinder missiles as well as Hydra cannons. Various other vehicles are also available during the course of the game, including tanks and jet fighters.</p>"},{"name":"Nukumori no Naka de","year":2001,"developer":"Assemblage Corporation","url":"psx-chd-roms-n/Nukumori%20no%20Naka%20de%20-%20In%20the%20Warmth%20%28Japan%29.chd","filesize":355338976,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Visual novel > Romance","desc":"<p><em>Nukumori no Naka de</em> (ぬくもりの中で) is a romantic visual novel ported from PC (Windows) / Macintosh game Suki da yo! which was released a year earlier and included adult content. This console release removes the adult scenes and changes the game title. The story remains the same otherwise, where protagonist is one of the more popular guys on the campus who encounters many girls, looking for a relationship that isn't all about sex (which scenes are removed from this console version). Female heroines include: Mina Shinbashi (新橋 美奈), protagonist's classmate with happy disposition, but constantly switches between love and hate towards you, Reina Shinbashi (新橋 玲奈), Mina's older sister, tender and kind, Rina Shinbashi (新橋 梨奈), youngest Shinbashi sister who often gets in a fight with the protagonist, Hijiri Mejiro (目白 聖), protagonist's classmate and part of the same club, Mina's closest friend, very smart but has an evil streak and can become very dangerous and unpredictable once angry, and Asagi Tabata (田端 あさぎ). As with most visual novels, based on player's choices and preferences, a path will lead to one of the multiple endings.</p>"},{"name":"Nurse Story","year":1999,"developer":"","url":"psx-chd-roms-n/Nurse%20Story%20%28Japan%29.chd","filesize":326951494,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga > Visual novel > Healthcare > Romance","desc":"<p><em>Nurse Story</em> is a mix of love simulation and visual novel adventure. The protagonist of the story is hospitalized and needs to stay for three months in a hospital. What to do during all that time, worry about getting better? Nope, walk all over the hospital and try to woo the nurses and hospital staff. First part of the game centers on your trying to win the heart of the woman of your choice in a typical love simulation style. Second part then turns into a romantic visual novel story.</p>"}]