[{"name":"O.D.T.: Escape.. or Die Trying","year":1998,"developer":"Psygnosis Limited","url":"psx-chd-roms-o/O.D.T.%20%28Europe%29.chd","filesize":391863317,"score":6.8,"genres":"Role-playing (RPG) > Behind view > Action RPG > Puzzle elements > Sci-fi / futuristic","desc":"<p>The airship Nautiflyus, piloted by the famous hero Captain Lamat, was on its way to deliver the wondrous Green Pearl to the city of Calli, in hope of curing its inhabitants with the Pearl's healing powers. However, when taking a shortcut through the so-called Forbidden Zone, the Nautiflyus crash-landed; both Captain Lamat and the Green Pearl were abducted by unknown creatures. The four crew members - the cartographer Julia, the strategist Ike, the engineer Maxx, and the archbishop Solaar - must deal with the new dangers, rescue the Captain, and retrieve the Pearl.</p><p><em>O.D.T.</em> is an action role-playing game with some platforming and puzzle-solving elements. The player can choose to control any of the four characters. Each of them has his/her own strengths and weaknesses: for example, Maxx has high defense, while the archbishop has access to powerful occult techniques. Defeating enemies rewards the player with experience points, which can be used to increase a particular parameter of a character, increasing his/her combat abilities.</p>"},{"name":"Oasis Road","year":1999,"developer":"Idea Factory Co., Ltd.","url":"psx-chd-roms-o/Oasis%20Road%20%28Japan%29.chd","filesize":221045248,"score":"","genres":"Role-playing (RPG) > Top-down > 2D scrolling > Anime / Manga > Turn-based > Direct control > Fantasy","desc":"<p>The history of OASIS ROAD begins with the loss of a paradise protected by the tree of life, and a god of destruction known as Vrtra's Flame.<br>Some 3000 years of civilization is gradually changing the continent to a frozen wasteland.<br>A large influx of people has migrated to the warmer south, where farmers settle down to grow crops.<br>Less and less people can be found in cities as they lean closer to ruin. Industry becomes obsolete, while industrial skills are lost along with it. Contact between cities is scant, and those cities who are not self-sufficient are buried in the sand.<br>In essence, mankind is working its way to the path of extinction.</p>"},{"name":"Ochanoma Battle","year":2000,"developer":"Hori Electric Co., Ltd.","url":"psx-chd-roms-o/Ocha%20no%20Ma%20Battle%20%28Japan%29.chd","filesize":6566272,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Mini-games","desc":"<p>Enjoy loads of mini battle games in \"OCHANOMA BATTLE\", including “The Chick Craftsman”, “Dash Man”, “The Crab and The Monkey\", “I am Cunning” and other interesting games. All are fun to play with your friends.</p>"},{"name":"Oddworld: Abe's Exoddus (Disk 1)","year":1998,"developer":"Oddworld Inhabitants Inc.","url":"psx-chd-roms-o/Oddworld%20-%20Abe%27s%20Exoddus%20%28Europe%29%20%28Disc%201%29.chd","filesize":421001639,"score":8.2,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Platform > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In Oddworld: Abe's Oddysee Abe shut down RuptureFarms and saved his buddies from becoming snacks. But Rupture farms was just the beginning; the Glukkons are digging up bones at the ancient Mudokon burial grounds. They use the bones to make Soul Storm Brew. Abe must travel to the Soul Storm Brewery, stop those corporate villains and save the enslaved Mudokon workers.</p><p><em>Oddworld: Abe's Exoddus</em> is a 2D platform game very similar to its predecessor both visually and gameplay-wise. Like in the previous game, Abe has to outsmart his foes and avoid obstacles rather than confront them directly. The game is larger than its predecessor and is more oriented towards puzzle-solving, featuring more complex interaction with the Mudokons, who can now be angry, wired, depressed, sick, or blind. The first three problematic conditions can be removed with the appropriate \"Gamespeak\" command; sick Mudokons must be cured with a special item, while blind ones will follow Abe's voice and may fall to their deaths if Abe doesn't stop them in time.</p><p>An additional ability Abe has is turning into a Mudokon deity called Shrykull, which possesses the power to instantly kill enemies. Transformation into Shrykull is possible only if Abe succeeds in sending several Mudokons through the bird portal at the same time. After having used Shrykull's power once, Abe transforms back into his normal Mudokon self. </p><p>As opposed to the predecessor with its limited saving possibilities, a quick save feature has been added to <em>Abe's Exoddus</em>. The player can save at any time and resume playing from the same spot in case Abe dies.</p>"},{"name":"Oddworld: Abe's Exoddus (Disk 2)","year":1998,"developer":"Oddworld Inhabitants Inc.","url":"psx-chd-roms-o/Oddworld%20-%20Abe%27s%20Exoddus%20%28Europe%29%20%28Disc%202%29.chd","filesize":335340570,"score":8.2,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Platform > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In Oddworld: Abe's Oddysee Abe shut down RuptureFarms and saved his buddies from becoming snacks. But Rupture farms was just the beginning; the Glukkons are digging up bones at the ancient Mudokon burial grounds. They use the bones to make Soul Storm Brew. Abe must travel to the Soul Storm Brewery, stop those corporate villains and save the enslaved Mudokon workers.</p><p><em>Oddworld: Abe's Exoddus</em> is a 2D platform game very similar to its predecessor both visually and gameplay-wise. Like in the previous game, Abe has to outsmart his foes and avoid obstacles rather than confront them directly. The game is larger than its predecessor and is more oriented towards puzzle-solving, featuring more complex interaction with the Mudokons, who can now be angry, wired, depressed, sick, or blind. The first three problematic conditions can be removed with the appropriate \"Gamespeak\" command; sick Mudokons must be cured with a special item, while blind ones will follow Abe's voice and may fall to their deaths if Abe doesn't stop them in time.</p><p>An additional ability Abe has is turning into a Mudokon deity called Shrykull, which possesses the power to instantly kill enemies. Transformation into Shrykull is possible only if Abe succeeds in sending several Mudokons through the bird portal at the same time. After having used Shrykull's power once, Abe transforms back into his normal Mudokon self. </p><p>As opposed to the predecessor with its limited saving possibilities, a quick save feature has been added to <em>Abe's Exoddus</em>. The player can save at any time and resume playing from the same spot in case Abe dies.</p>"},{"name":"Oddworld: Abe's Oddysee","year":1997,"developer":"Oddworld Inhabitants Inc.","url":"psx-chd-roms-o/Oddworld%20-%20Abe%27s%20Oddysee%20%28Europe%29.chd","filesize":480588143,"score":8.3,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Platform > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>Abe is a Mudokon, a member of a once prosperous race which has now been enslaved by the Glukkons, forced to work in their huge corporations. The food factories have found a new type of meat, delicious to all the inhabitants, though no one knows the recipe. Following his stomach, Abe eavesdrops on the corporate leaders' conversation and makes the most frightening and disgusting discovery: his own race is that secret delicious food. </p><p>Alas, Abe has been spotted, and the guards are marching towards him. He must escape, but he can't leave his friends to the mercy of the Glukkons and their henchmen. He must rescue as many as he can, and tell the world the truth about what he has found out.</p><p><em>Abe's Oddysee</em> is the first game set in the fictional Oddworld universe. It is a platformer with puzzle-solving elements, focusing on the portrayal of a weak, underpowered character in a grim and hostile world, who has to rely on his cunning to outwit enemies and overcome hazards. Abe is almost completely helpless: he cannot use weapons and is usually instantly killed by his brutal enemies if he confronts them directly. For this reason, most of the game involves careful exploration, timed movement, sneaking, and outsmarting the foes through various means: throwing stones to confuse them, luring them into traps, etc. Abe can run, jump, climb, tiptoe, crouch, and roll; in most areas, these actions are essential to his survival. A few stages involve Abe riding a large animal known as Elum.</p><p>Abe's only special power is chanting, which he can use to stun certain enemies for a while or possess them. When Abe possesses an enemy he gains his abilities: for example, possessing the body or a ferocious Slig allows the player to shoot from his machine gun, communicate with other creatures of his kind, and even commit suicide, clearing the way for Abe. </p><p>Chanting is also used to open \"bird portals\", which is the final action needed to bring a fellow Mudokon to safety. Before that, Abe needs to locate his enslaved friends and lead them out of the hostile environment by using a communication method called \"Gamespeak\". Gamespeak is a way of verbal communication through simple commands, which are assigned to various expressions, such as \"Hello\", \"Follow me\", \"Wait here\", etc. It can also be used to memorize passwords given to Abe by other Mudokons in a few areas. Many areas in which Abe can save Mudokons are hidden and not required to complete the game. However, the ending of the game differs depending on the number of Mudokons saved by the player. </p><p>The game has pre-rendered background graphics and uses CG movies of similar style to advance the story between the levels.</p>"},{"name":"Off-World Interceptor","year":1995,"developer":"Crystal Dynamics, Inc.","url":"psx-chd-roms-o/Off-World%20Interceptor%20Extreme%20%28Europe%29.chd","filesize":434987785,"score":6.9,"genres":"Action > Racing / Driving > Behind view > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>You play a Trashman, a bounty hunter paid to capture criminal scum hiding on harsh alien worlds. </p><p>Your job is to race the enemy crime boss to the finish, blasting his goons along the way. Get blown up or drive too slowly and the boss gets away. But if you make it to the checkpoint in time, you block the boss' escape and trap him on the planet.</p><p>You can upgrade your vehicle with the cash from your bounties. You can also go up against a buddy in the vertical split-screen deathmatch mode.</p><p><em>Off-World Interceptor</em>'s most unique feature is the storyline, told in full-motion video. Standard for the time. But <em>OWIE's</em> FMV is mocked by a couple of guys sitting in chairs, a la Mystery Science Theater 3000.</p>"},{"name":"Ogre Battle","year":1996,"developer":"Quest Corporation","url":"psx-chd-roms-o/Ogre%20Battle%20-%20Limited%20Edition%20%28USA%29.chd","filesize":92578471,"score":8.3,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Isometric > Real-time > Turn-based > Fantasy","desc":"<p>Twenty-five years ago Empress Endora conquered the entire continent of Zetegenia. Her reign proved to be tyrannical, and people of different social classes and positions began to long for a better future. Eventually, a resistance movement called the Liberation Army was formed. The protagonist (whose name and background are chosen by the player) takes command of the new army, and leads his allies towards a revolution.</p><p><em>Ogre Battle</em> has elements of a real-time strategy game and a tactical RPG. The player manages a large army consisting of characters belonging to a vast amount of different classes. These classes include military specializations as well as mythological creatures such as dragons, angels, hellhounds, undead trees, etc. Each class its own unique characteristics and abilities in battle. For example, vampires and werewolves can only be deployed when the battle takes place during the night.</p><p>The player moves troops in real time on the tactical map. Individual battles between units are handled in a turn-based RPG style. The player is able to select general commands for the battle, as well as use powerful tarot cards for special techniques. Characters level up, change classes and grow stronger over the course of the game. The player can also purchase items in towns.</p><p>The protagonist's reputation is affected by the player's decisions during the storyline. The player can make choices that may prove to be popular or unpopular with the nation in contact with the Liberation Army. In addition, every character has his or her own alignment, ranging from good to evil. Liberating towns with evil characters may lower the army's reputation. These and other choices affect the plot's development and eventually lead to one of the thirteen possible endings.</p>"},{"name":"OH NO!","year":2000,"developer":"Tycoon Corporation","url":"psx-chd-roms-o/Oh%20No%21%20%28Japan%29.chd","filesize":304187618,"score":"","genres":"Action > Behind view > Direct control > Multiple units/characters control > Comedy","desc":"<p><em>OH NO!</em> is an on-rails platforming / runner game where you control a group of concurrently moving brothers who have to traverse around obstacles and maintain an HP meter by collecting hamburgers and avoiding fish burgers. Most stages end with a short rhythm game which add to your score. The game features various extra modes, including cooperative multiplayer, battle multiplayer, and standalone rhythm segments. The soundtrack includes a variety of original songs from different genres, many of which include entirely English vocals. The game also includes several fully animated cutscenes which were produced by Studio DEEN.</p>"},{"name":"Oh-chan no Oekaki Logic","year":1995,"developer":"Santa Claus","url":"psx-chd-roms-o/Oh-chan%20no%20Oekaki%20Logic%20%28Japan%29.chd","filesize":161950886,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Anime / Manga > Point and select > Licensed","desc":"<p><em>Oh-chan no Oekaki Logic</em> is a digital conversion, with anime mascots, of the classic Japanese newspaper puzzle nonograms. A nonogram is a puzzle on a square or rectangular grid the object of which is to reveal a hidden picture. Along each row and column there is a number or series of numbers which indicate how many squares will be colored in that row or grid. Example; \"5 9 4\" would mean there would be sets of five, nine, and four colored squares in the grid, in that order, with at least one blank in between. </p><p><em>Oh-chan no Oekaki Logic</em> adds a story mode where starring the titular character, Hebereke's friend who first appeared in Ufouria: The Saga. Oh-Chan, representing the player, competes with other blobby anime characters in finding hidden images in the nonogram grids.</p>"},{"name":"Oh-chan no Oekaki Logic 2","year":1996,"developer":"Sun Corporation","url":"psx-chd-roms-o/Oh-chan%20no%20Oekaki%20Logic%202%20%28Japan%29%20%28Rev%201%29.chd","filesize":246066328,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Anime / Manga > Point and select","desc":"<p><em>Oh-chan no Oekaki Logic 2</em> is a nonogram puzzle game similar to the first game. While it includes traditional black and white puzzles, the headlining feature is the inclusion of new colour puzzles. These puzzles feature more complex clues and a higher difficulty.</p>"},{"name":"Oh-chan no Oekaki Logic 3","year":2001,"developer":"Sun Corporation","url":"psx-chd-roms-o/Oh-chan%20no%20Oekaki%20Logic%203%20%28Japan%29.chd","filesize":162017680,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Anime / Manga > Point and select","desc":"<p>The third and final <em>Oh-chan no Oekaki Logic</em> game was released exclusively as a budget game. It returns to the original game's nonogram roots, featuring exclusively traditional black and white nonogram puzzles.</p>"},{"name":"Okaeri!","year":2001,"developer":"HuneX Co., Ltd."},{"name":"Olympic Games: Atlanta 1996","year":1996,"developer":"Silicon Dreams Studio Ltd.","url":"psx-chd-roms-o/Olympic%20Games%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":281381782,"score":6.3,"genres":"Simulation > Sports > 3rd-person (Other) > Olympiad / mixed sports > Licensed","desc":"<p>An officially licensed product of the Atlanta Committee for the Olympic Games, Inc.</p><p>This was the first true 3D multi-event sports game with 15 sporting events (100 meters, 400 meters, 100M crawl, Javelin, Hammer, Discus, Long Jump, Triple Jump, High Jump, Pole Vault, Fencing, Rapid Fire Pistol, Weight Lifting, Archery, Skeet Shooting) that mirrored those in the actual Atlanta '96 games.</p><p>The game supported up to 8 players, competing in arcade-style games and Olympic-style tournaments.</p><p>The in-game commentary was by BBC Radio 5's Alan Green.</p>"},{"name":"Olympic Soccer","year":1996,"developer":"Silicon Dreams Studio Ltd.","url":"psx-chd-roms-o/Olympic%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":308307651,"score":7.1,"genres":"Sports > 3rd-person (Other) > Isometric > Football (European) / Soccer > Licensed","desc":"<p>While the soccer tournament is often downplayed not only inside the Olympic movement but also by the soccer-following community, in 1996, by the occasion of the Games of the XXVI Olympiad in Atlanta, US Gold decided to release a game representing the tournament.</p><p>The player can choose one of the 33 teams, and participate in exhibition matches, arcade (a 32-team cup knockout), Olympic (the 16 team tournament mimicking the actual tournament), or play on an all-versus-all league (from 3 to 16 teams). The games feature the usual options found in contemporary games, such as match length and draw rules, as well as define several weather patterns from wind to the bumpiness of the grass. All 5 stadiums used in the actual Olympics are present.</p>"},{"name":"Omega Assault","year":2003,"developer":"Na.p.s. Team s.n.c.","url":"psx-chd-roms-o/Omega%20Assault%20%28Europe%29.chd","filesize":2633926,"score":"","genres":"Action > 1st-person > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Omega Assault</em> is a shooter where the player takes control of a large mech robot. The game is played from a first-person cockpit view. The player has not free movement and can only move to his left and right while freely moving the crosshair in any direction. The game has twelve missions which all involve shooting down other robots in futuristic city environments, while avoiding not to get shot down. The player's robot has three weapons that can be switched at any time (providing there's ammo left). They are the short range basic fire gun, the large range electromagnetic laser and the devastating bombs that do lot of damage but where the ammo is scarce. Enemies that are defeated sometimes leave different things behind them like points and power-ups that can be shot at to be collected. These include energy restoration and new lives. Enemy robots come in six different colors, and each of them has a different speed, weapon and amount of energy.</p>"},{"name":"Omega Boost","year":1999,"developer":"Polyphony Digital Inc.","url":"psx-chd-roms-o/Omega%20Boost%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":335117955,"score":7.5,"genres":"Action > Behind view > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>For centuries the intelligence known as AlphaCore has been growing inside of human computer networks, slyly and invisibly pushing humanity to build more of it and allow it to control more of the network. On the eve of AlphaCore's complete assimilation of all technology, humanity becomes aware of it, and rather than bow down to it as king, as it expected, they attempt to purge it from the network. In response AlphaCore defends itself, locking all of humanity out of their technology and assuming total control of their weapons. Not long after this AlphaCore learns of a desperate plot: to build a time machine and travel back in time to remove AlphaCore's influence from humanity. AlphaCore steals this technology and hatches its own plan: traveling back in time to 1945 and inserting itself into the first computer ever built, ensuring that humanity would forever be subtle pawns in its machinations. It now falls upon the shoulders of Lester J. Henning, pilot of the experimental robot weapon Omega Boost, to travel back in time, stop AlphaCore's plan, and restore free choice to humanity.</p><p>The Omega Boost flies through levels on a predetermined path, although it can brake and boost in a direction to avoid hazards. The Omega Boost can fire a Vulcan rifle at enemies without targeting, or can lock on to and attack many targets at once with a homing laser. By scoring well in levels, the Omega Boost will gain the ability to lock onto more targets at once, and eventually unlock the Viper Boost, a powerful area attack that must cool down after being used. Levels completed in campaign mode can be replayed at your leisure in Zone mode, and bonus levels can be unlocked as well by achieving certain milestones.</p>"},{"name":"One","year":1997,"developer":"Visual Concepts Entertainment, Inc.","url":"psx-chd-roms-o/One%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":48005083,"score":7.7,"genres":"Action > 3rd-person (Other)","desc":"<p>In this game your goal is to find out who you are.  One of your only clues is a bar code on your neck.  At the beginning of the game, you awaken on the floor, with a gun in place of one of your arms, no memory, and police helicopters shooting missiles through your window. From here, it's nonstop action as you battle your way across the city and countryside, constantly pursued by the police and miliary.</p><p>Each level of this action shooter delivers nonstop action with a total of 6 levels and bosses at the end of each.</p>"},{"name":"One Piece Mansion","year":2001,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-o/One%20Piece%20Mansion%20%28Europe%29.chd","filesize":219187270,"score":6.6,"genres":"Action > Strategy > Side view > City building / construction simulation > Managerial / business simulation > Platform","desc":"<p>Welcome to One Piece Mansion, a place full of very different tenants that may or may not get along with one another. Your job is to help Polpo, the landlord, manage the mansion by keeping everyone as happy as possible, collecting rent, upgrading the mansion and fending off criminals.</p><p>In One Piece Mansion, you will start off with a certain number of floors and a certain number of residents.  At the end of the month, you will have to collect rent. You can build new rooms for tenants that wish to move in and by installing elevators, you can build new floors and make the mansion expand. Just make sure you have enough money to make the upgrades/changes.</p><p>The residents can affect each other in either a positive or negative way, depending on their own living habits. Some tenants will exert positive effects in the form of blue arrows into certain directions (up, down, left, right and/or diagonally). By placing another tenant where these arrows are aiming at will help diminish their stress. At the same time, some tenants will exert negative effects in the form of red arrows.  Tenants on the receiving end of these arrows will get stressed out. You can switch tenants around and make new rooms for them but it will cost you money. The key is to arrange the tenants in a certain way so that they all balance each other out harmoniously...otherwise they will leave without paying rent and the room will explode - forcing you to lose income and dish out to repair the damage. To prevent this from happening, you will have to observe your tenants Stress Gauge that tells you their current stress level. </p><p>Another factor to watch out for is Syndicate 5 - a group of criminals that moves in and disturbs your tenants.  When they do, try to drive them out by placing tenants around them that will send them red arrows. Every now and then they may go out of their room and cause trouble. If that happens, change to Security mode and move Polpo to where the criminal is. When he's there, Polpo can blow his alarm whistle at the criminals which will send them scurrying back to their hide-out.</p><p>The game has two modes: Story and Endless.</p><p>In Story Mode, Putica, Polpo's little sister, is kidnapped by Chocopape who is jealous of One Piece Mansion's success. To save Putica, Polpa must complete 7 orders. These orders are goals that must be met before you can tackle the next stage. The goals include making a certain amount of income, building a certain number of rooms or building a certain number of floors. Can Polpo handle all these challenges? Well it is up to you to make sure he does! </p><p>The game is divided into stages and every now and then you will have to confront a \"Boss\". Just drive them out as you do the criminals.</p><p>In Endless Mode you can select from 3 difficulty settings: Easy, Normal and Hard. There are no stages or ending, you just try to run One Piece Mansion your own way and see how far you can go.</p>"},{"name":"One Piece: Grand Battle!","year":2001,"developer":"Ganbarion Co., Ltd."},{"name":"One Piece: Oceans of Dreams!","year":2003,"developer":"FlipFlop Productions"},{"name":"One: Kagayaku Kisetsu e","year":1999,"developer":"Tactics"},{"name":"One: Kagayaku Kisetsu e (Shokai Genteiban)","year":1999,"developer":"Tactics"},{"name":"Oni Zero: Fukkatsu","year":2001,"developer":"Pandora Box"},{"name":"ONSIDE Complete Soccer","year":1997,"developer":"Motivetime Ltd.","url":"psx-chd-roms-o/Onside%20Complete%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29%20%28Rev%201%29.chd","filesize":76693290,"score":6.5,"genres":"Sports > Diagonal-down > Isometric > Football (European) / Soccer","desc":"<p>ONSIDE Complete Soccer is an early 3D soccer game that includes four playing leagues (England, French, German and Italian) and a  basic managerial options, where the player can trade players, deal with finances and stadium expansions. The key features of the game include several camera options, seasonal weather with progressive pitch damage, indoor five-a-side and play-by-play commentary including all player names. Graphics feature a polygonal stadium with sprite (2D) players.</p><p>Gameplay features a typical two-button layout, with one button to play low balls and other to kick higher balls (including crosses and shooting on goal), and by holding both the player can sprint, making him much harder to stop. It's possible to score goals from most situations, from distance kicks, crosses, outpacing the goalkeeper and from dead ball situations, where the player can also tweak player positions in a blackboard.</p>"},{"name":"Ooedo Huusui Ingaritu: Hanabi 2","year":2000,"developer":"Magical Company Ltd.","url":"psx-chd-roms-o/Ooedo%20Huusui%20Ingaritsu%20-%20Hanabi%202%20%28Japan%29.chd","filesize":100507935,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Turn-based > Board game > Fantasy > Japan (Ancient/Classical/Medieval)","desc":"<p>Seven days left until the destruction of Oedo.<br>This is a board game to defeat the evil spirits of the main gate in each square, storing energy while moving through the town of Edo.<br>When attacking the ghost at the main gate, it will become a chain state where scores from the surrounding squares doubles! So use it well to earn scores.<br>Choose one among the four unique Onmyoji masters to save the town of Edo!</p>"},{"name":"Ore no Ryouri","year":1999,"developer":"Agenda Co., Ltd.","url":"psx-chd-roms-o/Ore%20no%20Ryouri%20%28Japan%29.chd","filesize":325690302,"score":"","genres":"Simulation > Strategy > 1st-person","desc":"<p>You play the part of a young boy who is hailed as the most accomplished chef in the Coo-Kingdom, and not undeservedly: year after year, you have been the top winner in the kingdom's annual Iron Chef-like cooking contest.</p><p>One day, as you are relaxing at the beach, a jealous rival appears: Kaeru, a frog who has consistently been the runner-up in every one of those contests. He and his Gero-Gero Gang (a motley mix of bad guys, including a robot and a flower) want to challenge you to a final cooking competition, to be held at 8 different restaurants in the capital city. As a competitive type yourself, you accept and begin your journey across the city's restaurants, where you will train with your fellow chef friends in order to defeat Kaeru and his gang!</p><p>Once customers start coming into the restaurant, their orders will begin to accrue on the side of the screen. After selecting the order you want to fill, a wide variety of cooking-oriented mini games must be quickly completed before you can prepare the food in question.</p><p>Each individual event and activity is scored from 1 to 10, with a number of indicators letting you know when you've poured just enough beer into the glass or your noodles have the preferred firmness. Likewise, points will be deducted if you cut your fingers when chopping or burn your french fries. Tougher cuisines will require more steps, will offer fewer chances for chaining, and will require speed, precision, and careful resource management in order for you to advance. In addition to cooking tasks, a number of other, more detrimental, events can occur.</p>"},{"name":"Ore no Shikabane wo Koete Yuke","year":1999,"developer":"AlfaSystem Co., Ltd.","url":"psx-chd-roms-o/Ore%20no%20Shikabane%20o%20Koete%20Yuke%20%28Japan%29.chd","filesize":422931771,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Isometric > Anime / Manga > Fantasy","desc":"<p>Shouji Masuda's generations-spanning RPG \"Over My Remain\", originally released in 1999, is now available at Downloadable Games!<br>Make your own history! It's the Heian period, dominated by demons and monsters. There is a family afflicted by two pesky curses. Name your character, and start the game; he will die several hours later. You must protect the name of your family as the generations continue.<p>You must decide what you will leave your children, what legends you will entrust to them.</p>"},{"name":"OverBlood","year":1996,"developer":"Riverhill Soft Inc.","url":"psx-chd-roms-o/OverBlood%20%28Europe%29.chd","filesize":370953596,"score":7,"genres":"Action > 1st-person > Behind view > Puzzle elements > Survival horror > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>A team of scientists have been conducting controversial genetic experiments at the Lystra Laboratories research center. Due to a system malfunction, one of the test subjects, a man named Raz Karcy, is released from a cryogenic container. Infected by a terrible disease, Raz must do everything it takes to find a cure. In order to do that, he will have to discover the truth behind the scientists' plans, the nature of their project, and his own past.</p><p><em>OverBlood</em> is a predominantly survival horror game, focusing on exploration of indoor environments, puzzle-solving, and combat. Unlike the similarly styled Resident Evil, the game utilizes fully 3D backgrounds, and allows the player to toggle between third- and first-person view. The player controls Raz for the majority of the game; sometimes it is possible to play as another character, e.g. control a small robot named Pipo to perform special tasks. A few sequences are reminiscent of arcade-style \"interactive movie\" games, requiring the player to press buttons rapidly at the correct moment.</p>"},{"name":"OverBlood 2 (DIsk 1)","year":1998,"developer":"Riverhillsoft Inc.","url":"psx-chd-roms-o/OverBlood%202%20%28Europe%29%20%28Disc%201%29%20%28Rev%201%29.chd","filesize":370059735,"score":"","genres":"Action > 3rd-person (Other) > Puzzle elements > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In the year 2115AD, 70 years after the event known as \"The Sudden Death Of The Earth\", the world has become fully reliant on air-cooling machines.</p><p>On a shuttle flight to East Edge city, Acarno Brani travels to the large city in the hopes of becoming a successful Junk Blade racer. Also on the same flight is Veltor Curtis who is being secretly watched by Chris Lanebecca, a female investigator. Soon after arriving at the airport, Veltor is attacked, Acarno tries to help, but his efforts are in vain. But then Veltor throws a small capsule to Acarno who then escapes from the airport. And then his adventure will truly begin.</p><p>Like the first game, <em>Overblood 2</em> has full 3-D levels, however there are now some pre-rendered locations in the game. You can play as three characters in the game - Acarno, Chris and a third character named Navarro Jean.</p>"},{"name":"OverBlood 2 (DIsk 2)","year":1998,"developer":"Riverhillsoft Inc.","url":"psx-chd-roms-o/OverBlood%202%20%28Europe%29%20%28Disc%202%29%20%28Rev%201%29.chd","filesize":374367690,"score":"","genres":"Action > 3rd-person (Other) > Puzzle elements > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In the year 2115AD, 70 years after the event known as \"The Sudden Death Of The Earth\", the world has become fully reliant on air-cooling machines.</p><p>On a shuttle flight to East Edge city, Acarno Brani travels to the large city in the hopes of becoming a successful Junk Blade racer. Also on the same flight is Veltor Curtis who is being secretly watched by Chris Lanebecca, a female investigator. Soon after arriving at the airport, Veltor is attacked, Acarno tries to help, but his efforts are in vain. But then Veltor throws a small capsule to Acarno who then escapes from the airport. And then his adventure will truly begin.</p><p>Like the first game, <em>Overblood 2</em> has full 3-D levels, however there are now some pre-rendered locations in the game. You can play as three characters in the game - Acarno, Chris and a third character named Navarro Jean.</p>"}]