[{"name":"P.T.O.: Pacific Theater of Operations II","year":1996,"developer":"KOEI Co., Ltd."},{"name":"Pac-Man World 20th Anniversary","year":1999,"developer":"Namco Hometek Inc.","url":"psx-chd-roms-p/Pac-Man%20World%2020th%20Anniversary%20%28Europe%29.chd","filesize":364963988,"score":7.4,"genres":"Action > Arcade > Platform > Puzzle elements","desc":"<p>Twenty years after Pac-Man's first adventure in Pac-Land, Pac-Man returns one day to his house only to find it deserted.  Toc-Man and his ghosts have kidnapped Pac-Man's friends, Ms. Pac-Man, Pac Jr., Baby Pac, Professor Pac, Pooka, and Chomp-Chomp the dog!  Pac-Man must venture to Toc-Man's lair on Ghost Island to rescue his friends!</p><p>Hidden through this 3D adventure game, Pac-Man faces challenging puzzles and games that have appeared in Pac-Man's previous games.  Many things in this game are a tribute to original games and even Inky, Blinky, Pinky, and Clyde are back for another chance to get Pac-Man.</p><p>There are several kinds of gameplay modes available.  The newest is Quest mode.  Pac-Man can maneuver up/down and left/right on the screen, but the camera is fixed on the side and scrolls along as Pac-Man searches through all the stages of Ghost Island.  The player must collect Pac-Dots, Fruit, Keys, etc to advance through the level all the while defeating ghosts (by bouncing on them) and solving puzzles.  An adventure game, the story progresses as the levels do with switches to be found and chests to be opened.  There is also a scoring system that encourages the player to collect as much as possible. </p><p>The other two types of modes are Classic mode and Maze mode.  Classic mode is a 100% faithful conversion of Pac-Man's original game.  Maze Mode is the gameplay from Classic Pac-Man translated into a 3D environment.  All the Pac-Pellets, Ghosts, Walls, and Pac-Man are displayed in 3D.</p>"},{"name":"Paca Paca Passion","year":1999,"developer":"Produce Co., Ltd.","url":"psx-chd-roms-p/Paca%20Paca%20Passion%20%28Japan%29.chd","filesize":174381456,"score":"","genres":"Action > Anime / Manga > Music / rhythm","desc":"<p><em>Paca Paca Passion</em> is the first title in the rhythm game series from Produce, and is a conversion of the 1998 coin-op title of the same name. Choose from one of four members of band: keyboard and brass-playing bunny girl Purika, guitar-shredder-with-blue-hair Coke, sun-loving pianist Miruka, or afroed drum machine Geroppa, and battle against one of your bandmates to see who can jam better. Each person plays a different instrument on each track, and different instruments correspond to different difficulties on each song.</p><p>Each player has a column divided into 32 sections. Each section can either be gray (indicating no note), or one of four colors (each assigned to a button). A marker scrolls down the column in time with the music, and you must press the buttons for the markers to play each note. Play better than your opponent and you'll win the song and continue to the next one, where you once more pick a band member and instrument.</p><p>The game includes Original and Arcade modes, as well as 2-player Battle and Cooperative play.</p>"},{"name":"Paca Paca Passion 2","year":2000,"developer":"Produce Co., Ltd.","url":"psx-chd-roms-p/Paca%20Paca%20Passion%202%20%28Japan%29.chd","filesize":119109379,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Music / rhythm > Direct control","desc":"<p>\"PACAPACA PASSION™ 2\" is a rhythm and action game that competes by using music!<br>Besides 4 additional new characters there will be more excitements!<br>In addition to all 9 songs including the arcade version hidden songs, new songs & new stages are included!<br>Various game modes such as tournament mode and new functions are available too!</p>"},{"name":"Paca Paca Passion Special","year":2000,"developer":"Produce Co., Ltd.","url":"psx-chd-roms-p/Paca%20Paca%20Passion%20Special%20%28Japan%29.chd","filesize":133884462,"score":"","genres":"Action > 3rd-person (Other) > Fixed / flip-screen > Anime / Manga > Music / rhythm","desc":"<p>\"PACAPACA PASSION™ Special\" which everybody knows is now here on PlayStation®!<br>There will be popular mix songs and new song JET! All will be available in this PACA!!<br>There will be a contest mode which is popular in the game center!<br>You can also play the popular private extra remix too!<br>This will be the extreme of PACAPACA!</p>"},{"name":"Pachi-Slot Aruze Oukoku","year":1999,"developer":"Aruze Corp.","url":"psx-chd-roms-p/Pachi-Slot%20Aruze%20Oukoku%20%28Japan%29.chd","filesize":247475403,"score":"","genres":"Gambling > Licensed","desc":"<p><em>Pachi-Slot Aruze Ōkoku</em> is the first in a series of slot machine simulators from Japan. This game features three machines manufactured by the Aruze Corporation, Jirokichi, EDOnoNezumi, and AREX.   </p><p>Gameplay for each is identical, the triangle sets the number of lines to play and the down button spins the reels. The reels spin for forty seconds, while the reels are spinning the player can choose to wait until the time expires or stop individual reels with the square, cross and circle buttons.</p>"},{"name":"Pajama Sam 3: You Are What You Eat From Your Head To Your Feet","year":2001,"developer":"Humongous Entertainment, Inc.","url":"psx-chd-roms-p/Pajama%20Sam%20-%20You%20Are%20What%20You%20Eat%20from%20Your%20Head%20to%20Your%20Feet%20%28Europe%29.chd","filesize":167520495,"score":7.5,"genres":"Adventure > Educational > Health / nutrition > Pre-school / toddler","desc":"<p>The third game in the Pajama Sam Series, part of the Humongous' popular \"Junior Adventure\" titles designed for children ages three to eight. </p><p>You're playing Sam who once again assumes the role of Pajama Sam at times when he needsfacing his fears. This time you suddenly find yourself in the midst of a food squabble when you try to chase down some snickering cookies! And you are called to find the 4 missing delegates of MopTop Island's emergency peace conference that has to be made to calm the island population after the incident of the fats and the sweets. They are both forcing the healthy foods off of the island.</p><p>Pajama Sam 3 takes place in front of beautifully hand-drawn interactive backgrounds where each screen has a multitude of fun things to click on like Humongous' other adventures.There are also some mini-games within the main game to catch more of the player's attention.The main mini-game is to collect 20 tops from Sam's favorite Chocamok cookie boxes so thathe could get a \"Pajama Man Action Figure with Titanic Elbow Thrust\"! You usually comeacross these boxes since they could be hidden anywhere around the island.</p><p>Children are invited to learn healthful food awareness, listening and decision-making skills and other educational concepts and lessons in the game. Along their journey, they can interact more than 20 different comic-style characters, like a gentle doughnut who can help Sam find the way on the water or a professional entertainer called MickeyHollandaise who can get the audience into hysterics with his big shoes!</p>"},{"name":"PAL: Shinken Densetsu","year":1997,"developer":"Fill in Café Co., Ltd.","url":"psx-chd-roms-p/Pal%20-%20Shinken%20Densetsu%20%28Japan%29.chd","filesize":88207044,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>One rainy day, a shy young girl named Kaoru was walking home from school. Near her house, she found a puppy abandoned in a box. She rescued the puppy, naming him \"Pal\", and cared for him dearly. However, not long after, the prophet Nostradamus, having waited hundreds of years searching for the one who will finally make his predictions come true, has finally found the one he's been seeking.</p><p>It just so happens that this person is none other than Pal's owner, Kaoru. Nostradamus sends his servants, who kidnap Kaoru, leaving Pal all alone. The Seven Gods of Luck, taking pity on Pal, grant him a rare gift: a Fruit of Evolution. Eating it, Pal transforms into a human. Together with Kaoru's boyfriend Yukito and two lesser gods who work for the Seven Gods of Luck, Pal sets out to rescue Kaoru and stop Nostradamus!</p><p><em>PAL</em> is in most ways a traditional Japanese-style role-playing game. The player orders each character in battle, choosing attacks, items, and techniques. Equipment upgrades are represented as scrolls, and techniques can be upgraded as they are used. Kaoru's boyfriend, Yukito is also an excellent cook and can learn a wide variety of recipes to create recovery and assist items for use in and out of battle.</p>"},{"name":"Pandemonium 2","year":1997,"developer":"Crystal Dynamics, Inc.","url":"psx-chd-roms-p/Pandemonium%202%20%28Europe%29.chd","filesize":221948253,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>In this sequel to  Pandemonium, the player once again controls the young aspiring sorceress Nikki and the court jester Fargus with his puppet buddy Sid. It is the year of Cheese, and the advent of the Comet of Infinite Possibilities is foretold by the great prophet Nosewasinit. Naturally, Nikki and Fargus are interested in this comet; but they are not the only ones. The evil Goon Queen Zorrscha wants to use the comet for her own plans, so our heroes have to reach it first...</p><p>The gameplay is similar to that of the first game; despite the 3D graphics, the gameplay mechanics are those of 2D platformers. The player can select Nikki or Fargus for each level. Each of the two has different abilities. For example, Nikki can jump higher, while Fargus can use his puppet Sid for a variety of attacks. The characters can also acquire power-ups, such as fire and lightning ranged attacks for Nikki or various Sid enhancements for Fargus. There are also level-specific items and vehicles the heroes will encounter on their way.</p>"},{"name":"Pandemonium!","year":1996,"developer":"Toys for Bob Inc.","url":"psx-chd-roms-p/Pandemonium%21%20%28Europe%29.chd","filesize":79747617,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>The young sorceress Nikki, the court jester Fargus, and his side-kick Sid the puppet are the three main protagonists of this 3D platform game. While attending a \"Wizards in Training\" seminar, Nikki accidentally casts a powerful magic spell, which results in a giant monster swallowing the whole village. The three friends must now travel to a place called \"Wishing Engine\", and be granted a wish to revert the world back to normal.</p><p>The characters each have a special movement to kill enemies with. The game uses floating camera angles through a vast Prince of Persia-style world. The goal of the game is to clear the various levels, avoiding spikes and enemies and collecting coins for extra lives.</p><p>Unlike most 3D platformers, <em>Pandemonium</em> offers only two-dimensional movement, rather than complete freedom of movement. The characters move along a curving 2D course within a 3D environment.</p>"},{"name":"Panekit - Infinitive Crafting Toy Case","year":1999,"developer":"Susami","url":"psx-chd-roms-p/Panekit%20-%20Infinitive%20Crafting%20Toy%20Case%20%28Japan%29.chd","filesize":67698131,"score":"","genres":"Action > Educational > Simulation > Behind view > Free-roaming camera > Real-time > City building / construction simulation > Mini-games > Puzzle elements > Sandbox / open world > Tricks / stunts > Direct control > Menu structures > Automobile > Flight / aviation > Helicopter > Hovercraft > Mecha / giant robot > Motorcycle > Off-roading > Space flight > Tank > Train > Truck > Vehicle simulator","desc":"<p><em>Panekit</em> is a sandbox open world exploration, collection and (optional) construction game. Make your own models and vehicles by combining 8 kinds of panel shaped parts and then drive them around an open world. Each vehicle has different capabilities that can be used to discover new land.</p><p>It's possible to build machines capable of walking, driving, flying and even transforming between forms. New parts and equipment can be found by driving around the open world and there are mini games - also discoverable in the open world - including: one on one tank shooting battle, sports car race, dragster race, rally race and even an aircraft competition. Two player mini games and demos of various vehicles are both accessible from the main menu.</p>"},{"name":"Pangaea","year":1999,"developer":"Success Corp."},{"name":"Panzer Bandit","year":1997,"developer":"Fill in Café Co., Ltd.","url":"psx-chd-roms-p/Panzer%20Bandit%20%28Japan%29.chd","filesize":121669866,"score":"","genres":"Action > Side view > Anime / Manga > Arcade > Beat 'em up / brawler > Fighting > Sci-fi / futuristic","desc":"<p>An evil robotic army invades city after city and nothing seems to stop them, that is until fighting hero Kou and his band of heroes decide to put the hurt on the invading forces and set off in a quest to liberate each city and finally destroy their flying robotic whale HQ. (Yeah, robotic whale HQ). </p><p>The game prompts you to select from four different characters, each with his/her unique moveset and sends you off for eight enemy-infested stages in which you must use your attacks to pummel everything that crosses your path. You only have two planes of vertical motion, which are mainly used to avoid enemy fire, and the game includes a power-bar that increases with your attacks and allows you to unleash super moves. These moves also increase an overheat gauge which renders you useless for a while, so as to avoid abusing the super moves.</p><p>Features an anime intro and cutscenes, and the game uses 2D sprites with some polygonal elements for background elements.</p>"},{"name":"Panzer Front","year":1999,"developer":"ASCII Corporation","url":"psx-chd-roms-p/Panzer%20Front%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":106113562,"score":6.6,"genres":"Action > Simulation > 1st-person > Behind view > Tank > Historical events > World War II","desc":"<p><em>Panzer Front</em> is a realistic World War II tank combat simulation spanning the summer offensive into Russia of 1941 to the fall of Berlin in 1945. Nearly 25 historical missions are provided in which the player can control American, German, or Russian forces. Nearly 30 realistically modeled tanks are playable along with 7 fictional ones and dozens of other vehicles that make up friendly and enemy forces.</p>"},{"name":"Panzer General","year":1996,"developer":"Strategic Simulations, Inc.","url":"psx-chd-roms-p/Panzer%20General%20%28Europe%29.chd","filesize":233760204,"score":7.7,"genres":"Strategy > Top-down > Turn-based > Turn-based strategy > Wargame > Point and select > Africa > Europe > Historical events > Middle East > World War II > War","desc":"<p>The time for resurrecting historical events has come. <em>Panzer General</em> was one of the first games (if not the first) that actually gave you the ability to play for the Nazis, and yet succeed where Hitler failed. Having total and complete control over land, sea, and air units, you must defeat the Allied dogs as fast as you can (to get a major victory), or slower than in history (to get a minor victory).</p><p>The game's quality lies in the number of units. There are basically hundreds of Axis and Allied units from World War II, accompanied with \"circled\" animations and battle sounds, as well as marching or moving sounds. The Main menu is always located on the right side of the screen, with plenty of options and selections you can change to suit your preferences.</p><p>A turn-based hexagon strategy game that will actually go faster if you have a faster computer, but will always be playable (speed doesn't go up to infinity). The first and original Panzer General, this installment would be followed by sequels and many other games in the series using the \"General\" name.</p>"},{"name":"Paradise Casino","year":2002,"developer":"DigiCube Co., Ltd.","url":"psx-chd-roms-p/Paradise%20Casino%20%28Europe%29.chd","filesize":3533020,"score":"","genres":"Gambling > Strategy > Cards / tiles","desc":"<p>Black Jack • Slot Machines • Roulette • Super Poker<br>Paradise Casino brings the excitement and entertainment of Las Vegas to your home with very addictive gambling games.<br>Learn and practice the most popular casino games at your own pace without risk.</p>"},{"name":"PaRappa the Rapper","year":1996,"developer":"NanaOn-Sha Co., Ltd.","url":"psx-chd-roms-p/PaRappa%20the%20Rapper%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":396249285,"score":7.2,"genres":"Action > 3rd-person (Other) > Music / rhythm > Comedy","desc":"<p>The rapping pup, PaRappa, dreams of impressing his friend, the beautiful Sunny Funny, and going out on a date with her. But what he lacks is confidence - help PaRappa rap his way through learning Kung Fu, a driving test, cooking and more, all in order to get the girl. And remember - You Gotta Believe!</p><p><em>PaRappa the Rapper</em> is a game based on lyrics, music and rhythm. The game itself is very basic - each stage has a 'teacher', that PaRappa must follow. You'll see the teacher say some lyrics, and then PaRappa must copy the teacher by pressing the appropriate buttons to repeat those lyrics back. Rap well, and you'll be able to continue; fudge up the lyrics, and the music will start to distort and the teacher will become displeased. Continue to mess up and you'll fail the stage.</p><p>Of course, the goal is not to copy the teacher, but instead to <em>outperform</em> them - you can do this by improvising in the song's gaps. Listen to how the song goes, and improvise in time to the music; if you perform well enough, the teacher will step aside, leaving you to freestyle on your own!</p><p>The PSP version of the game is a remake of the PlayStation original. However, it includes a few upgrades, such as a 16:9 display, sharper graphics, game sharing, multiplayer support of up to four players, and the addition of song remixes, which can be downloaded via the internet onto your Memory Stick Duo.</p>"},{"name":"Parasite Eve (Disc 1)","year":1998,"developer":"Square Co., Ltd.","url":"psx-chd-roms-p/Parasite%20Eve%20%28USA%29%20%28Disc%201%29.chd","filesize":269067397,"score":8,"genres":"Role-playing (RPG) > Diagonal-down > Real-time > Detective / mystery > Licensed","desc":"<p>An ordinary day in New York for rookie police officer Aya Brea. Christmas Eve is the present day, and you've decided to visit the opera theater. Now this is where the fireworks begin. Suddenly audience members are set on fire, toasted completely, and it appears that the lead vocal is the source of this burning terror. Yet you appear to be immune, and as a police officer you're always on duty, so you must confront the danger.</p><p>There has to be some connection between the two of you, as that seems the only rational explanation. What if mitochondria are a species on its own, more advanced then humankind, and using them only to create environments and civilization for themselves? What if humankind are just hosts? What if mitochondria are the natural enemy of humankind? That would make Aya their natural enemy, so the battle for survival and uncovering the truth has already started.</p><p>The game is played over six days, each day bringing its own quest. Environments range from Central Park and the American Museum of Natural History to a police office and hospital, all of them modeled like realistic places and most of them crawling with bloodthirsty mutant animals. Combat is different from traditional RPGs, as while you still take turns attacking and/or using parasite powers, you'll be able to run across the battlefield and dodge enemy fire or even strike from a better angle or behind. As Aya levels up she will gain access to parasite powers, such as healing or supercharging a bullet with energy. These powers will deplete a recharging energy bar, although the bar will recharge slower the longer combat drags on. Aya will find many guns of various types throughout the game, and every gun can be modified with extra stats, either with special items, or by breaking down another gun to move over its bonus stats or special effects. The same is true for armor Aya finds.</p>"},{"name":"Parasite Eve (Disc 2)","year":1998,"developer":"Square Co., Ltd.","url":"psx-chd-roms-p/Parasite%20Eve%20%28USA%29%20%28Disc%202%29.chd","filesize":296746991,"score":8,"genres":"Role-playing (RPG) > Diagonal-down > Real-time > Detective / mystery > Licensed","desc":"<p>An ordinary day in New York for rookie police officer Aya Brea. Christmas Eve is the present day, and you've decided to visit the opera theater. Now this is where the fireworks begin. Suddenly audience members are set on fire, toasted completely, and it appears that the lead vocal is the source of this burning terror. Yet you appear to be immune, and as a police officer you're always on duty, so you must confront the danger.</p><p>There has to be some connection between the two of you, as that seems the only rational explanation. What if mitochondria are a species on its own, more advanced then humankind, and using them only to create environments and civilization for themselves? What if humankind are just hosts? What if mitochondria are the natural enemy of humankind? That would make Aya their natural enemy, so the battle for survival and uncovering the truth has already started.</p><p>The game is played over six days, each day bringing its own quest. Environments range from Central Park and the American Museum of Natural History to a police office and hospital, all of them modeled like realistic places and most of them crawling with bloodthirsty mutant animals. Combat is different from traditional RPGs, as while you still take turns attacking and/or using parasite powers, you'll be able to run across the battlefield and dodge enemy fire or even strike from a better angle or behind. As Aya levels up she will gain access to parasite powers, such as healing or supercharging a bullet with energy. These powers will deplete a recharging energy bar, although the bar will recharge slower the longer combat drags on. Aya will find many guns of various types throughout the game, and every gun can be modified with extra stats, either with special items, or by breaking down another gun to move over its bonus stats or special effects. The same is true for armor Aya finds.</p>"},{"name":"Parasite Eve II (Disc 1)","year":1999,"developer":"Square Co., Ltd.","url":"psx-chd-roms-p/Parasite%20Eve%20II%20%28USA%29%20%28Disc%201%29.chd","filesize":383140253,"score":7.5,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Survival horror > Sci-fi / futuristic > Licensed","desc":"<p>Aya Brea is back in a new game. This time there are fewer RPG elements than the first game, and the game plays more like Resident Evil. Battles are now entirely action-oriented, and a new range of weapons is available. Defeating enemies rewards money as well as points used to revive and power-up Aya's suppressed Parasite powers, like healing and igniting foes. Weapons and armor now have fixed stats, but attachments can be swapped in and out of them to modify their properties.</p><p>After surviving the events of <em>Parasite Eve</em> Aya left her job as a cop and became a member of MIST (Mitochondrion Investigation and Suppression Agency) in order to hunt down the remnant mutants spawned by Eve's awakening. In the year 2000 a new breed of Neo Mitochondrion takes over the Akropolis Tower in downtown LA. Aya is called in and uncovers a secret organization that threatens all humanity.</p>"},{"name":"Parasite Eve II (Disc 2)","year":1999,"developer":"Square Co., Ltd.","url":"psx-chd-roms-p/Parasite%20Eve%20II%20%28USA%29%20%28Disc%202%29.chd","filesize":410604787,"score":7.5,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Survival horror > Sci-fi / futuristic > Licensed","desc":"<p>Aya Brea is back in a new game. This time there are fewer RPG elements than the first game, and the game plays more like Resident Evil. Battles are now entirely action-oriented, and a new range of weapons is available. Defeating enemies rewards money as well as points used to revive and power-up Aya's suppressed Parasite powers, like healing and igniting foes. Weapons and armor now have fixed stats, but attachments can be swapped in and out of them to modify their properties.</p><p>After surviving the events of <em>Parasite Eve</em> Aya left her job as a cop and became a member of MIST (Mitochondrion Investigation and Suppression Agency) in order to hunt down the remnant mutants spawned by Eve's awakening. In the year 2000 a new breed of Neo Mitochondrion takes over the Akropolis Tower in downtown LA. Aya is called in and uncovers a secret organization that threatens all humanity.</p>"},{"name":"Paris-Marseille Racing","year":2000,"developer":"Davilex Games B.V.","url":"psx-chd-roms-p/Paris-Marseille%20Racing%20%28France%29.chd","filesize":31630705,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>Take control of your DeLorian, police car, Mini or Beetle and race through some of France's most famous (and busiest) roads and cities. With tournament, time attack and single race modes, the game allows you to race within three classes, in each of which you must place first. Your reward is cash to upgrade the numerous cars available with enhanced engines, tires and even a nitro boost.</p><p>Paris-Marseille is France's entry in Davilex's \"Racer\" series, alongside Autobahn Raser II in Germany, A2 Racer in Holland and London Racer in the UK.</p>"},{"name":"Paris-Marseille Racing II","year":2002,"developer":"Davilex Games B.V.","url":"psx-chd-roms-p/Paris-Marseille%20Racing%20II%20%28France%29.chd","filesize":105439585,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>Almost two years after the first Paris-Marseille Racing, Davilex Games decided to continue the story and make a series.</p><p>In this follow-up, the player can choose between six drivers (one female) with unique driving skills, and two game modes, one or two players. In the single player mode, you will have to choose between the three classic sub-modes : tournament, time attack and single race. New with this release are the two 2-players modes : Duel and Driver Vs Police. In the Duel mode, race head to head against a friend. In the Driver Vs Police mode, one choose to play a police man, the other must try to drive as fast as possible to escape.</p><p>The game also features three skill levels, repairing and fine-tuning options in the tournament mode, and of course new and enhanced graphics to race through France and its famous cities such as Marseilles, Paris or Lyon. Three bonus races can also be played in London, Edinburgh or Las Vegas!</p>"},{"name":"Parlor! Pro 2","year":1997,"developer":"","url":"psx-chd-roms-p/Parlor%21%20Pro%202%20%28Japan%29%20%28Rev%201%29.chd","filesize":35040729,"score":"","genres":"Gambling","desc":"<p><em>Parlor! Pro 2</em> is the second in a series of pachinko simulator games from Japan.Pachinko is sometimes referred to as the number one pastime in Japan, and it is played in gaming halls called parlors. Gambling for money is illegal in Japan so players purchase steel balls with which they play the game. At the end of their session they exchange their remaining balls for tokens which, in turn, can be exchanged for goods / prizes. </p><p>This game features two pachinko machines, 'Hana Mizuki' and 'New Road Star', three gaming modes 'Simulator', 'Story', and a third that shows scenes from each game.</p>"},{"name":"Paro Wars","year":1997,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-p/Paro%20Wars%20%28Japan%29.chd","filesize":268147578,"score":"","genres":"Strategy > Isometric > Anime / Manga > Turn-based","desc":"<p>A turn-based strategy game based on the characters of the Parodius shooter series. You take your pick out of 8 classic characters from the Parodius games and pit their unique armies against the other character's in several scenarios in an all-out battle for total supremacy.</p><p>Gameplay is divided between strategic phases played in a \"world map\" from which you build up your army and attempt to take control of several factories that provide the resources needed for unit creation, and tactical turn-based battles in which you deploy your army in hopes of taking over a control zone or similar objective from an opposing player (either human or AI-controlled).</p><p>The game uses a combination of 3D backgrounds and 2D sprites for units and characters. As usual for games in the series, the game is filled with bizarre humor and parodies many other Konami franchises.</p>"},{"name":"Parodius","year":1994,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-p/Parodius%20%28Europe%29.chd","filesize":267873646,"score":8,"genres":"Action > Compilation > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter","desc":"<p>This compilation collects the first two arcade incarnations of Konami's shoot'em'up parody series on one disc: Parodius Da! and Gokujō Parodius.</p>"},{"name":"Pastel Muses","year":1997,"developer":"Soft Office","url":"psx-chd-roms-p/Pastel%20Muses%20%28Japan%29.chd","filesize":73281742,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Tile matching puzzle > Direct control","desc":"<p><em>Pastel Muse</em> is a puzzle game where you shoot colored balls down a slope to match them up with the pile of balls at the bottom. The premise is similar to such games as Puzzle Bobble, but with a difference. Here you not only control the aim, but also how hard you shoot the ball, making it go in an arc across the playing field and down the slope. Also, when you make balls disappear the remaining balls fall further down the slope using somewhat good physics.</p><p>You can play the game in the usual Story Mode, vs Mode and Endless Mode varieties usually found in this kind of puzzler.</p>"},{"name":"Patriotic Pinball","year":2003,"developer":"Wildfire Studios Pty. Ltd.","url":"psx-chd-roms-p/Patriotic%20Pinball%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.chd","filesize":108411024,"score":"","genres":"Action > 1st-person > Diagonal-down > 2D scrolling > Pinball > Direct control","desc":"<p><em>Patriotic Pinball</em> accurately describes the theme of the game. There are two tables in all, each with their own different theme and different \"missions\" the players to accomplish for each table.</p><p>There is <em>Road Trip Coast to Coast</em>, where the table mostly consists of American landmarks like the Hoover Dam and The Golden Gate Bridge. The other board is called <em>America on Duty</em>, where the underlining themes of this table mostly consists of the U.S. Military along with classic background battles like Gettysburg. There is also a three multi-ball games in each table.</p><p>It also features patriotic themes such as notes from \"Anchors Aweigh\" and even \"Taps\" when the player loses their ball. The game is rendered with 3D graphics and has animated backgrounds.</p>"},{"name":"Pax Corpus","year":1997,"developer":"Cryo Interactive Entertainment","url":"psx-chd-roms-p/Pax%20Corpus%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":451805497,"score":5.1,"genres":"Action > 3rd-person (Other) > Shooter > Cyberpunk / dark sci-fi","desc":"<p>In the game you play an attractive female mercenary who knows little about her own past. You've been hired to discover the secrets surrounding Corporation Alcyon's Pax Corpus Project, and eliminate any threat it poses to the free world.</p><p>The gameplay of <em>Pax Corpus</em> revolves around shooting, weapon upgrades, and level progression through the acquisition of keycards. Rave-style music accompanies the player throughout the futuristic world of violence.</p>"},{"name":"PD Ultraman Invaders","year":1995,"developer":"Lay-Up KK"},{"name":"Peak Performance","year":1997,"developer":"CAVE Co., Ltd.","url":"psx-chd-roms-p/Peak%20Performance%20%28Europe%29.chd","filesize":429975132,"score":6.6,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Arcade > Licensed","desc":"<p><em>Peak Performance</em> is an arcade-style racing game similar to Cruis'n USA with over 20 vehicles ranging from normal street cars to high-end performance race cars and even buses and scooters. There are five different tracks to choose from: Seven Tight Corners, Uptown Driveway, Northern Country, Bay Area, and Pikes Peak Hill Climb along with the ability to change weather conditions to add more challenge.</p><p>Not only can players compete against 11 other A.I. drivers, they can also face off against a friend using a split-screen of their choosing (either vertical or horizontal) which will merge into one screen when the players come into close contact. There is also a Time-Trial mode where players race against the clock in an attempt to unlock certain vehicles by either beating certain times or finding them hidden on the track.</p><p>A Course Edit mode is also present that allows players to create their own Time Trial tracks and place time interval markers anywhere on the course. Also featured on the cover is Robby Unser, an eight-time winner of the Pikes Peak Hill Climb.</p>"},{"name":"Pebble Beach no Hatou Plus","year":1996,"developer":"T&E Soft, Inc.","url":"psx-chd-roms-p/Pebble%20Beach%20no%20Hatou%20Plus%20%28Japan%29.chd","filesize":246376366,"score":"","genres":"Sports > Behind view > Cinematic camera > Turn-based > Golf > Licensed","desc":"<p><em>Pebble Beach no Hatō Plus</em> features the same Pebble Beach Golf Links course as the previous <em>Pebble Beach Golf Links</em> games by T&amp;E SOFT, but this is a totally new and updated game with a full 3D engine and free roaming camera. It is very similar to the other T&amp;E SOFT golf games released at the same time. It was a Japanese exclusive, but the commentary is in U.S. English.</p>"},{"name":"Pepsiman","year":1999,"developer":"KID Corp.","url":"psx-chd-roms-p/Pepsiman%20%28Japan%29.chd","filesize":114964502,"score":"","genres":"Action > Behind view > Arcade > Direct control > North America > Licensed","desc":"<p>This game is based on the Japanese Pepsi mascot who appeared in different commercials in Japan. In these he appeared where people were thirsty, quenched the people's thirst, then injured himself most of the time.</p><p>The game more or less follows this series of events as you run along stages collecting Pepsi cans, while trying your best to avoid injury or public humiliation. The goal of every stage is to run along a set course, jumping or sliding out of harm's way and in the end reach a vending machine with... you guessed it! Pepsi of course!</p>"},{"name":"Perfect Assassin","year":1998,"developer":"Synthetic Dimensions PLC","url":"psx-chd-roms-p/Perfect%20Assassin%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":281316163,"score":6,"genres":"Action > Adventure > 3rd-person (Other) > Graphic adventure > Puzzle elements > Point and select > Sci-fi / futuristic","desc":"<p>In <em>Perfect Assassin</em>, the main character is an interplanetary assassin named Charon who has lost his memory somehow. Charon is contacted by a shadowy character named Ul D-Grak, who claims to have a mission for him, and asks the assassin to meet them on the planet Kar-Naq. Charon lands on the planet near a city and proceeds to search for his mysterious client. </p><p>The gameplay is from a third-person view, but the camera is always located at a set place on a map. As the player walks between different places, the camera fluidly moves from one set viewpoint to another. </p><p>The gameplay has some action in it, but mostly it is adventure-style solving of puzzles or talking to people. During conversations, Charon can ask people a question about any subject he has heard about (a character, location or item), and he can assume one of three stances: meek, normal or aggressive. This is sometimes necessary to progress in a dialogue: for example, certain characters won't give Charon necessary items unless threatened.</p><p>At other times Charon needs to use violent force to proceed. Charon can shoot his gun anytime, aiming at any spot visible on the screen. The gun can be used to kill enemies, or to shoot at specific parts of the environment to solve puzzles.</p>"},{"name":"Perfect Golf, The","year":1995,"developer":"Nasa Corporation, Ltd.","url":"psx-chd-roms-p/Perfect%20Golf%2C%20The%20%28Japan%29.chd","filesize":496813408,"score":"","genres":"Sports > Behind view > Golf > Licensed","desc":"<p><em>The Perfect Golf</em> is a 3D polygon golf in which the word perfect refers to all the minutiae the game covers which is uncommon in golf games, sort of like a perfect guide. Besides the actual game mode, there are many extras included in the game, such as simulation mode which lets you enter your data and simulate the strategy of around 480 golf courses with detailed info on each of the course, its tracks, contact info and more. Advice mode contains live-action videos and comments by Hiroshi Tahara (田原 紘), a professional golfer, as well as a detailed list of rules and manners with explanations and comic art representation.</p><p>The game mode covers around 200 actual golf courses in Japan, letting the player go through any of them in 1, 9, or 18 holes play. Several existing pre-defined characters modeled after professional golfers are available to play as, or you can generate your own golfer. The game uses behind camera but offers many options through the menu before each hit, some of which lets you move around the golf terrain like focus on the flag in the distance, or check your position by displaying the top-down representation of a hole you're at. Before hitting the ball you can select the club, where and how strong you wish to hit the ball, or change your stance. After all is set for a hit, the red circle on the ball will blip in a loop becoming smaller which requires timing to hit it perfectly, while the strength of the hit is set at ease before and doesn't require you to dictate it at the gauge bar as most other golf games do.</p>"},{"name":"Perfect Weapon","year":1996,"developer":"Gray Matter Inc.","url":"psx-chd-roms-p/Perfect%20Weapon%20%28Europe%29.chd","filesize":236677743,"score":5.2,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Sci-fi / futuristic > Martial arts","desc":"<p>You find yourself on a alien planet and must kick ass and take names using guns and kung fu. You move your 3d character around static 2d screens (a sort of Alone in the Dark-esque game).</p>"},{"name":"Persona","year":1996,"developer":"Atlus Co., Ltd.","url":"psx-chd-roms-p/Persona%20%28USA%29.chd","filesize":380748155,"score":6.7,"genres":"Role-playing (RPG) > 1st-person > Diagonal-down > Isometric > Anime / Manga > Turn-based","desc":"<p>A group of high-school students decide to play a ritual-like game called \"Persona\". Unexpectedly, they are knocked unconscious and have a vision of a mysterious being called Philemon, who bestows upon them the ability to call powerful creatures known as Personae. Afterwards, the students go to visit their sick friend, Mary. Once they exit the girl's room in the hospital, they see their home town has changed. They can't leave it, and it is infested by demons. At first, it seems that the giant Sebec corporation and its manager are the ones responsible for the terrible accident. But this corporation is not the only enemy the young heroes have to confront - they must look deep into their hearts, and perhaps find the truth there...</p><p><em>Persona</em> is the beginning of a sub-series within the <em>Megami Tensei</em> universe, and one of the first Megaten titles to be released in the West. While overworld locations and battle screens in the game are isometric, the maze-like 3D dungeons are explored from a first-person perspective. Player-controlled characters fight randomly encountered demons in round-based combat, using melee weapons, firearms, or spells. As opposed to most other Megaten games, player-controlled party (up to five active combatants) consists entirely of human characters. Verbal communication with demons, however, still plays an important role in the game.</p><p>Each character possesses a unique set of four communication styles, e.g. insult, flattery, etc. The player may select combinations of various characters and their approaches during conversation with the demon. Depending on the player's choices, as well as the current Moon Phase, the demon may end up responding in one of the four emotional ways: anger, fear, joy, and interest. The last two types responses are beneficial to the player: the demon may give the party a useful item or a spell card.</p><p>If the player combines various types of spell cards, more powerful creatures (Personae) can be fused in a special location called Velvet Room. Personae act like equipment sets and can be attached to player characters, modifying their parameters, strengths and weaknesses, and teaching them new spells.</p>"},{"name":"Persona 2: Eternal Punishment (Disc 1)","year":2000,"developer":"Atlus Co., Ltd.","url":"psx-chd-roms-p/Persona%202%20-%20Batsu%20-%20Eternal%20Punishment%20%28Japan%29%20%28Disc%201%29%20%28Deluxe%20Pack%29.chd","filesize":435973865,"score":7.6,"genres":"Role-playing (RPG) > Diagonal-down > Isometric > Anime / Manga > Turn-based","desc":"<p>Maya Amano is a young journalist who lives and works in the modern-day Japanese city Sumaru. A series of mysterious murders have been troubling the city lately. Maya has to make a report and goes to a high school where the murders have taken place, together with the fortune-teller Ulala and the detective Katsuya. When they arrive at the school, they find the principal murdered. A man with a bag on his head appears, calling himself \"The Joker\". He says Maya and her friends will never defeat him unless they call upon their Personae - their other selves who can appear as mythical figures and help them in battles. The investigation continues, but now the young people have to face real demons, and perhaps also the demons that live within their own hearts.</p><p><em>Eternal Punishment</em> is a direct sequel to  Persona 2: Innocent Sin. It can be considered its \"mirror image\", since its story deals with many of the same characters, but is told from a different perspective. The gameplay system is nearly identical to that of the previous chapter. The player navigates a party of up to five active combatants on a city map, accessing maze-like dungeons and fighting randomly appearing demons in round-based combat. Like in the predecessor, successful verbal communication with a demon grants the party Tarot cards, which can then be used in a Velvet Room to summon Personae and equip them on characters. </p><p>The demon conversation system has been slightly simplified, with characters having less behavior modes when attempting to talk to a demon. The Personae-fusion interface has been streamlined, automatically lining up available characters. The rumor-spreading system from the previous game is featured as well, playing a somewhat more prominent role. A new spell registration service allows the player to teach Personae certain spells they were not equipped with. There are also more Personae to choose from in this installment.</p><p>At a certain moment during the course of the plot the player is able to choose one of the two available characters to join the party, which branches the storyline for a short while. If the player completes the game two times with these two different paths, a secret dungeon becomes available for exploration.</p>"},{"name":"Persona 2: Eternal Punishment (Disc 2)","year":2000,"developer":"Atlus Co., Ltd.","url":"psx-chd-roms-p/Persona%202%20-%20Batsu%20-%20Eternal%20Punishment%20%28Japan%29%20%28Disc%202%29%20%28Sumaru%20TV%20Special%20Preview%20Disc%29%20%28Deluxe%20Pack%29.chd","filesize":425524598,"score":7.6,"genres":"Role-playing (RPG) > Diagonal-down > Isometric > Anime / Manga > Turn-based","desc":"<p>Maya Amano is a young journalist who lives and works in the modern-day Japanese city Sumaru. A series of mysterious murders have been troubling the city lately. Maya has to make a report and goes to a high school where the murders have taken place, together with the fortune-teller Ulala and the detective Katsuya. When they arrive at the school, they find the principal murdered. A man with a bag on his head appears, calling himself \"The Joker\". He says Maya and her friends will never defeat him unless they call upon their Personae - their other selves who can appear as mythical figures and help them in battles. The investigation continues, but now the young people have to face real demons, and perhaps also the demons that live within their own hearts.</p><p><em>Eternal Punishment</em> is a direct sequel to  Persona 2: Innocent Sin. It can be considered its \"mirror image\", since its story deals with many of the same characters, but is told from a different perspective. The gameplay system is nearly identical to that of the previous chapter. The player navigates a party of up to five active combatants on a city map, accessing maze-like dungeons and fighting randomly appearing demons in round-based combat. Like in the predecessor, successful verbal communication with a demon grants the party Tarot cards, which can then be used in a Velvet Room to summon Personae and equip them on characters. </p><p>The demon conversation system has been slightly simplified, with characters having less behavior modes when attempting to talk to a demon. The Personae-fusion interface has been streamlined, automatically lining up available characters. The rumor-spreading system from the previous game is featured as well, playing a somewhat more prominent role. A new spell registration service allows the player to teach Personae certain spells they were not equipped with. There are also more Personae to choose from in this installment.</p><p>At a certain moment during the course of the plot the player is able to choose one of the two available characters to join the party, which branches the storyline for a short while. If the player completes the game two times with these two different paths, a secret dungeon becomes available for exploration.</p>"},{"name":"Persona 2: Tsumi - Innocent Sin","year":1999,"developer":"Atlus Co., Ltd.","url":"psx-chd-roms-p/Persona%202%20-%20Tsumi%20-%20Innocent%20Sin%20%28Japan%29%20%28Rev%201%29.chd","filesize":408619106,"score":7.1,"genres":"Role-playing (RPG) > Diagonal-down > Isometric > Anime / Manga > Turn-based","desc":"<p>A few years after the events described in Persona, a curse has befallen Sumaru City, a town in modern-day Japan. The curse is placed by a mysterious person who calls himself the Joker. Rumors say that he can fulfill people's wishes, but also does something horrible to those who for some reason fail to express a wish. A group of high school students decides to investigate the matter. However, when they confront the Joker, he tells them that they have hurt him in the past, and that he is out for revenge now. The young people realize that the Joker's appearance is just the beginning of a sinister chain of events, and will have to look for answers within their own souls.</p><p><em>Persona 2: Innocent Sin</em> is similar in structure and basic gameplay to its predecessor. Much of the game consists of navigating a party of up to five active combatants through locations in the large city, exploring complex dungeons, and fighting randomly appearing demons in round-based style. Unlike the first game, dungeons are viewed from an angled overhead perspective with rotatable camera. Rather than having the option of using either a melee weapon or a gun, each character is equipped with his or her own specific weapon.</p><p>Like in the previous game, communication with demons plays a significant role. The demon conversation system has been refined: it is now possible to choose more specific and accurate dialogue lines, and the effects of the player's responses are less random. Tarot cards of a specific Persona type are collected from the demons following a successful conversation. They can be later used in a special location called Velvet Room to acquire new Personae, which can be equipped on playable characters, enhancing their parameters and teaching them different spells and abilities. In the beginning each Persona is only capable of a basic ability; new ones are gradually learned by repeatedly using the powers of said Persona in combat. Powerful fusion attacks can be performed by combining two or more spells in the same round.</p><p>The game introduces a \"rumor system\", which allows the player to acquire and spread rumors through rumormongers inhabiting the city. Due to the curse placed on the city, rumors become reality once they are spread. This predicament can be used to the player's advantage, for example by spreading a rumor about powerful black market weapons.</p>"},{"name":"Pet in TV","year":1997,"developer":"MuuMuu Co., Ltd.","url":"psx-chd-roms-p/Pet%20in%20TV%20%28Europe%29.chd","filesize":17921517,"score":6.9,"genres":"Adventure > Simulation > 3rd-person (Other) > Managerial / business simulation > Puzzle elements","desc":"<p>In <em>Pet in TV</em> the player takes control of a virtual pet, which resembles a more complex version of the Tamagotchi. The player can choose from a selection of PiTs and name it.</p><p>It is then up to the player to nurture their PiT and allow it to explore the 3D world, learning from its encounters with scenery and objects through trial-and-error. Once these behaviours are learn, the PiT will know how to respond to those objects in the future (such as a Flower, or a Spike). Whenever the PiT becomes injured, or tired, returning it to its home will allow Dr. Y to fix it. The objective then becomes for your PiT to solve puzzles on its own - for which it will be rewarded with AI upgrade chips.</p>"},{"name":"Pet Pet Pet","year":1999,"developer":"Magical Company Ltd.","url":"psx-chd-roms-p/Pet%20Pet%20Pet%20%28Japan%29.chd","filesize":128711103,"score":"","genres":"Simulation > 3rd-person (Other) > Life / social simulation > Managerial / business simulation","desc":"<p>Give happiness to the town with adorable pets!<br>The game combines cute graphics drawn in 3D with full-fledged business simulation!<br>Players will become pet shop managers to restock pets and goods in order to respond to the needs of customers in the city.<br>Management is in a severe situation! If the deficit continues the store will be closed! Let's continue to work hard and being gently healed as you visit the pets sold to the customers!</p>"},{"name":"Pete Sampras Tennis 97","year":1996,"developer":"The Codemasters Software Company Limited"},{"name":"Peter Jacobsen's Golden Tee Golf","year":2000,"developer":"Incredible Technologies, Inc.","url":"psx-chd-roms-p/Peter%20Jacobsen%27s%20Golden%20Tee%20Golf%20%28USA%29.chd","filesize":137347034,"score":6.8,"genres":"Sports > Behind view > Direct control > Golf > Licensed","desc":"<p><em>Peter Jacobsen's Golden Tee Golf</em> is a golf game based on the arcade game Peter Jacobsen's Golden Tee '97, but with some differences such as three additional courses for the PlayStation version. The PlayStation version also contains extra modes and an overview of the holes. The trackball support is replaced by holding down the D-Pad to adjust the power of the backswing. On the PC the mouse is moved backwards and then forwards to determine the swing. The PC version introduces tournaments and contests through online multiplayer, and games over LAN are supported as well. The PC version also contains Shadow Games where you can save and share your performance to play against that shadow player.</p>"},{"name":"Peter Pan in Disney's Return to Never Land","year":2002,"developer":"Doki Denki SA","url":"psx-chd-roms-p/Peter%20Pan%20in%20Disney%27s%20Return%20to%20Never%20Land%20%28USA%29.chd","filesize":345549482,"score":6.7,"genres":"Action > 3rd-person (Other) > Side view > Licensed","desc":"<p>The nefarious pirate Captain Hook found a map to Neverland's hidden treasure and intends to plunder it. Since he now knows where the treasure is located he hacks up the treasure map to pieces and scatters the pieces  throughout Neverland so no one else will be able to locate the treasure. Meanwhile, the fairy Tinkerbell informs Peter Pan that there is a treasure somewhere in Neverland. So now Peter Pan and Tinkerbell are on a quest to locate the hidden treasure too by finding and putting back together the pieces of the sliced up treasure map.</p><p>Players take the role of Peter Pan and occasionally as Tinker Bell throughout 20 different stages. Some of the stages include Hangman's Tree, the Mermaid Lagoon, Pirate's Cove, Indian village, and Skull Rock. </p><p>Peter's has the ability to fly and he can use a knife, as well as bombs, against his enemies such as seagulls and pirates, not to mention boss enemies such as Hook's first mate, Mr. Smee, and of course Captain Hook himself. Throughout these stages players can collect items such as feathers and film reels.</p><p>In stages where players take control of Tinkerbell, they have to fly throughout the stage keeping a torch lit while avoiding obstacles that would put the torch out.</p><p>In between stages players can visit the Indian shop where they can spend their feathers and buy things such as pixie dust, tips, and a health boost.Also players can use the film reels they found  and view the actual clips from the animated feature film the game is named after.</p>"},{"name":"PGA European Tour Golf","year":1999,"developer":"Infogrames Entertainment SA","url":"psx-chd-roms-p/PGA%20European%20Tour%20Golf%20%28Europe%29%20%28En%2CDe%29.chd","filesize":208593025,"score":"","genres":"Sports > 3rd-person (Other) > Direct control > Golf > Licensed","desc":"<p>You played on every FAIRWAY, beat every CHAMPION. Now discover the European touch: PGA European Tour Golf...<br><br>* Official game supported by the EUROPEAN TOUR<br>* 6 authentic courses, 5 fun games types including a NIGHT GOLF session<br>* Live and authentic commentary from BBC's famous double act Peter Alliss and Alex Hay<br>* Music by Mogwai and Fuxa</p>"},{"name":"PGA Tour 96","year":1995,"developer":"Hitmen Productions","url":"psx-chd-roms-p/PGA%20Tour%2096%20%28Europe%29.chd","filesize":433949537,"score":7.9,"genres":"Sports > Behind view > Direct control > Golf > Licensed","desc":"<p><em>PGA Tour 96</em> was the last of the series released for Sega's 16-bit console, and technologically the most advanced one. Instead of offering several generic courses, the three available (Spyglass Hill, Sawgrass and River Highlands) are in 3D, with height differences visible (as well as the limited 3D abilities of the console allow).</p><p>The player can either chose to play as one of the 10 PGA Pros (whose swings were digitized), or go Pro - the game keeps track of statistics (longest drive, driving accuracy, best round, etc), a game (Tournament, Strokeplay, Skins, Match and Shootout), as well as a replay.</p><p>Gameplaywise, PGA 96 uses the tried-and-proved triple click system - one to start the swing, other to set strength and a final one for accuracy. It's possible to fade or draw the ball (to bend the trajectory), add backspin and pitch or chip the ball (for some medium range attempts at the hole or go above a bush).The difficulty level affects mostly the leniency of the triple click hit areas - while at novice it is possible to let the accuracy a bit off-center, in pro levels the ball goes where your swing took it - no excuses taken. However, only in Pro it is possible to make the longest drives, as the amateur and novice levels take a few yards from the total capacity of the club.</p>"},{"name":"PGA Tour 97","year":1996,"developer":"Electronic Arts, Inc.","url":"psx-chd-roms-p/PGA%20Tour%2097%20%28Europe%29.chd","filesize":312728499,"score":6.7,"genres":"Sports > 3rd-person (Other) > Golf > Licensed","desc":"<p>This golf game is another entry in the Electronic Arts PGA Tour Golf series.</p><p>Players can choose to play as one of fourteen professional golfers such as Fuzzy Zoeller and Jim Gallagher Jr. or choose to create their own golfer by giving them a name and choosing what their golfer looks like from the few portraits that are available.</p><p>Players are then able to select what type of game mode they want to play. Game modes include letting the player practice a round of golf, compete in a tournament, have a shoot-out, or compete in a Skins game.</p><p>The game features two 18 hole golf courses to play at. Both platform versions of this game include the Sawgrass golf course, with each also including a unique golf course of their own. The Playstation version includes the Spanish Bay links, while the Saturn version includes the Spyglass Hill course.</p><p>When on the course, player select what club they want to use. They also can set the angle, pitch and backspin of the ball before taking a swing.They then have to aim where they want their shot to go. When shooting, players have to contend with the \"Target Arc\" power bar interface which effects the velocity and accuracy of each shot. This meter also factors the players risk in their shot by determining the degree of difficulty it would be to make the shot. Bold shots get rewarded while risky shots are not.</p><p>The game also features TV style commentary and several different camera angles, including a picture in picture view.</p>"},{"name":"PGA Tour 98","year":1997,"developer":"NuFX, Inc.","url":"psx-chd-roms-p/PGA%20Tour%2098%20%28Europe%29.chd","filesize":249981842,"score":7.2,"genres":"Sports > 3rd-person (Other) > Golf > Licensed","desc":"<p>EA's highly customizable golf series moves to the Sony Playstation with PGA Tour 98.  Players can choose course conditions, whether to use special rules like mulligans, and even how much your caddy will assist with setting up a shot.  With commentary by Ernie Johnson Jr., up to four players can play various play modes such as Skins games, Four-ball match play, and Skills Challenge on five real locales.  The power and accuracy of ones shot is determined with a timed meter, which can be represented with a traditional vertical bar or a more realistic arcing meter.</p>"},{"name":"Philosoma","year":1995,"developer":"G-artists","url":"psx-chd-roms-p/Philosoma%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":348832820,"score":6.8,"genres":"Action > 3rd-person (Other) > Side view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>In Philosoma, you blast through 18 vertical scrolling deep space environments in search of the mysterious distress call, destroying enemies and obstacles in your path. </p><p>Go up against a variety of vehicles including the \"Hover Carrier,\" the \"Makkon,\" and the \"Missile Walker\" as you clear your way with one of four main weapons such as the Vulcan, Laser, A-Break, or Ray-B. Each weapon can be upgraded up to three times when specific power-up icons are collected. A secondary weapon such as Buster grenades, MRMs, and SRMs are equipped at the beginning of a level or acquired through a power-up.</p><p>Enemies include other space ships and large insect like aliens.</p>"},{"name":"Phix: The Adventure","year":2000,"developer":"Affect Co.,Ltd","url":"psx-chd-roms-p/Phix%20-%20The%20Adventure%20%28USA%29.chd","filesize":339534696,"score":"","genres":"Action > Behind view > Platform","desc":"<p><em>The Magnia Stone, the sacred stone of the Magnetic World is knocked off its floating altar in the sky and falls towards a slumbering creature called Phix. He swallows it and starts to attract metallic objects and creatures. This upsets the balance of the world, and evil creatures start to appear throughout the land. Phix must travel to five realms in order to bring the stone to its original place and return peace.</em><em>Phix: The Adventure</em> is a 3D platform with a magnetic element similar to the earlier Super Magnetic Neo. The main character attracts or repels objects and enemies by switching polarity (between north and south with the <strong>▲</strong> button). Touching the enemy decreases the number of hearts at the left bottom of the screen. Falling on pits or water kills Phix instantaneously. The <strong>●</strong> button shoots magnetic particles (enemies can be killed by particles of opposite polarity: north enemies are affected by south particles, and vice-versa). Pressing and holding the <strong>■</strong> activates a neutral field that lasts some seconds and shields Phix from the magnetic activity around him. The <strong>X</strong> button makes the character jump. To reach higher places, Phix first must connect to magnetic spots on the ground by selecting the opposite polarity and then switch to the same polarity. Activating the neutral field at this exact moment makes him jump even higher.</p><p>The game has five worlds, each with three regular levels and a boss stage. It starts with two lives and a timer for each level (the character dies when it runs out), and allows progress to be saved to the memory card.</p>"},{"name":"Pinball Fantasies","year":1996,"developer":"Spidersoft Limited","url":"psx-chd-roms-p/Pinball%20Fantasies%20Deluxe%20%28Japan%29.chd","filesize":52649804,"score":7.6,"genres":"Action > Top-down > Pinball","desc":"<p>After the success of Pinball Dreams on several systems, a sequel featuring four new tables was created. The gameplay is much the same as the first game, with realistic physics, multi-player options and a high score table to aim for. The tables are Partyland, Speed Devils, Billion Dollar Gameshow and Stones 'n' Bones, taking in a funfair, racing cars, a tacky game-show, and a graveyard. Each one has a range of ramps, combos, light sequences and targets to shoot, as well as general themes which are less influenced by real tables than those in Pinball Dreams.</p>"},{"name":"Pinball, The","year":1999,"developer":"Nekogumi"},{"name":"Pink Panther: Pinkadelic Pursuit","year":2002,"developer":"Étranges Libellules S.A.","url":"psx-chd-roms-p/Pink%20Panther%20-%20Pinkadelic%20Pursuit%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":349034421,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy > Licensed","desc":"<p>One Christmas day,  Pink Panther is heading toward the mansion of his late uncle. It is said that there is a treasure hidden somewhere in the mansion. As the inheritor of the mansion, Pink set out to find the treasure as soon as he steps into the mansion. He soon finds out that the treasure is locked inside a safe; the keys of which can be obtained by exploring the \"rooms\" (probably the places/enemies that Uncle Pink previously explored/defeated) in the mansion. Now it up to Pink Panther to retrieve all the keys to the treasure!</p><p>The main objective of all the levels in the game (except the final level) is to collect the key hidden in each level and get to the goal to proceed to the next level. There are a total of 12 \"rooms\" (levels) within 3 game modes: platform, race and boss fight. Most levels are in platform mode. In platform mode, the key is guarded by a certain character in a certain place. The way to that place is not straightforward: there are plenty more characters blocking the ways each time players proceed. The only way to proceed is to do the suitable exchanges with these characters (what they need will be displayed in the thought bubbles when players come near them). Very often the object a character needs is also the one another has, so stealing and chasing are essential parts of this mode. Hiding spots are provided for players for convenience during chase sequences. </p><p>In race mode, Pink's controls are restricted: he cannot freely walk; he can only accelerate or decelerate while moving forward. The key will be obtained once players get to the goal. In boss fight mode, players' only objective is to defeat the boss to get the key. </p><p>Various enemies are presented in platform mode and race mode, but only in platform mode can players beat the enemies. At the beginning of the game, players is provided with a key to open the first \"room\". The higher the level is, the greater number of keys is needed. Coins are presented in all levels. Players can collect coins to unlock artworks in the gallery opposite the mansion There are some question mark signs which will summon Uncle Pink to explain new things for players when players stand near them.</p><p>The graphics are in 3D. Players have a choice among English, France, German, Spanish and Italian. The game is automatically saved when a level is completed or manually by pressing the certain button (can be set in the option section). After completing a level, players can freely choose to replay that level or the lower levels.</p>"},{"name":"Pinobee: Wings of Adventure","year":2002,"developer":"Artoon Co., Ltd.","url":"psx-chd-roms-p/Pinobee%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":329476996,"score":6.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>Grandpa Bee has kidnapped before finishing you, Pinobee - a robotic bee made to defend the world. The player must go through 9 worlds in order to find and rescue your creator. There are multiple storylines with multiple endings. Pinobee can take out most enemies by jumping on top of then, but the most important means of attack is a dash, which can be executed in any direction (also diagonal). The amount of consecutive dashes can be upgraded when meeting a certain character. Pinobee collects flower and question mark bubbles provide power-ups, enhancing the dashes, providing temporary shields or other bonuses. Players can use the Game Link to collect and trade items with friends for power-ups.</p>"},{"name":"Pipe Dreams 3D","year":2000,"developer":"Sick Puppies Studio","url":"psx-chd-roms-p/Pipe%20Dreams%203D%20%28USA%29.chd","filesize":143144827,"score":"","genres":"Puzzle > Diagonal-down > Fixed / flip-screen > Real-time > Point and select","desc":"<p>The planet Pipe was a peaceful place until one evil Pipe decided she was not happy. She didn't like the other Pipes and their ways so she took off in her flying saucer and covered the planet and all its inhabitants in foul smelling, toxic Green Flooze.One brave Pipe stepped forward to challenge this evil, vowing not to stop until he had cleared the planet of the foul Flooze and defeated the Evil Pipe Queen.</p><p>You must use different shaped pieces of pipe to form a longer pipe which controls the flow of the Flooze around the screen, which you will eventually lead to a plug hole.</p><p>The game features 18 continents, each with 3 levels. Each continent has its own characters and hazards. There are power-ups to be collected in the form of jewels and coins.</p>"},{"name":"Pitball","year":1996,"developer":"Warner Interactive Entertainment Ltd.","url":"psx-chd-roms-p/Pitball%20%28USA%29.chd","filesize":397408487,"score":6.9,"genres":"Action > Sports > 3rd-person (Other) > Managerial / business simulation > Sci-fi / futuristic","desc":"<p><em>Pitball</em> is a 2-on-2 futuristic sports game. The gameplay is a cross between Rollerball and Basketball. Players 'fight' within an enclosed arena, over control of a floating orb, which they then pick up and throw into the opponents goal. </p><p>Various power-ups are dropped into the arena during play, that offer advantages to the player, such as extra speed, more accurate shooting, more power and various bombs and landmines that can be used against the opponent.</p><p>In addition, special orbs can be picked up, that can be built up and then used to execute a 'special moves'.</p><p>The game also allows the player to 'manage' a team. The management portion offers the player a wealth of options including a full transfer market, to trade for better players, and an equipment shop to buy upgrades. Wins earn cash, but the player can also gamble on the outcome of games to further increase earnings. The player can also use cash to bribe opponents before a big game, and they will not try as hard when they face you.</p><p>The game supports up to 4 players and is compatible with the Multi-Tap.</p>"},{"name":"Pitfall 3D: Beyond the Jungle","year":1998,"developer":"Activision, Inc.","url":"psx-chd-roms-p/Pitfall%203D%20-%20Beyond%20the%20Jungle%20%28Europe%29.chd","filesize":335789172,"score":7.4,"genres":"Action > 3rd-person (Other) > Platform","desc":"<p><em>Pitfall 3D</em> is a remake of Pitfall!. Once again, take on the role of Pitfall Harry and swing across pits and battle scorpions, but this time in 3D. As you try to complete each level and solve the puzzles that will allow you to progress through the jungle ruins, your main objective is to gather crystals.</p>"},{"name":"Planet Laika","year":1999,"developer":"Quintet Co., Ltd.","url":"psx-chd-roms-p/Planet%20Laika%20%28Japan%29.chd","filesize":395350915,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Cinematic camera > Sci-fi / futuristic > Thriller","desc":"<p><em>Planet Laika</em> is a role-playing game where the player controls the titular character, Laika, who is part of an expedition to Mars, in order to discover the truth about rumors that have been going around, concerning the end of the world and the existence of a certain supernatural creature.</p><p>Laika has multiple-personality disorder, and when talking to other characters, the player will see an aura around them in one of three colors, each of which is associated with a personality type: yellow, for those who wish to attain physical beauty; red for people who are strong and violent; and finally blue, who are psychotic but very crafty individuals.</p><p>Laika can absorb these auras, and therefore take on different personalities. This happens by filling up a gauge each time the player absorbs one of the auras, and allowing transformation into one of the three types by visiting a mirror.The game then uses these transformations to solve puzzles throughout, such as having Laika become “red” in order to lift heavy objects.</p><p>The battle system is somewhat akin to Pong, in that the player has to deflect enemy projectiles in order inflict damage himself, by using something called a Mind Core.Battles only occur when Laika is transformed into one of the alter egos.</p><p>Like many RPGs of its day, <em>Planet Laika</em> uses 3D polygonal characters with 2D pre-rendered backgrounds, along with CG cutscenes.</p>"},{"name":"Planet of the Apes","year":2002,"developer":"Visiware","url":"psx-chd-roms-p/Planet%20of%20the%20Apes%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":340579324,"score":5.6,"genres":"Action > Behind view > Puzzle elements > Post-apocalyptic > Licensed","desc":"<p>Released around the same time as the remake (2001 Tim Burton) of the original film (1968 Franklin J. Schaffner), yet follows its own story in that setting. You are Ulysses, a human whose spacecraft crashed on an ape-ruled planet. When you are captured and readied for 'examination' you want to save your skin, and thankfully a merciful ape gives you a chance to do so. As a human you have no tools, only your intelligence and some loincloth to prevent staring eyes.The game is played from a third-person viewpoint, and you can meet certain characters and talk to them to get information. Hand-to-hand combat ensues when you encounter an unfriendly ape, obstacles need to be overcome by thinking and some acrobatics.</p>"},{"name":"Play with the Teletubbies","year":1999,"developer":"Asylum Entertainment Ltd.","url":"psx-chd-roms-p/Play%20with%20the%20Teletubbies%20%28Europe%29.chd","filesize":508659592,"score":6.5,"genres":"Action > Puzzle > 3rd-person (Other) > Licensed","desc":"<p><em>Play with the Teletubbies</em> is the first video game based on the popular kids TV series <em>Teletubbies</em>. Players get to choose one of the four Teletubbies, Tinky Winky, Po, Laa-Laa or Dipsy, and have to explore Teletubbyland to find objects. There's the Magic Windmill, a magic drum, a hide and seek tree, and others. There are more mini-games if you head down to the Teletubbies' super dome, where you can play with the Tubby Custard machine, the control panel, the Tubby Toaster and others.</p>"},{"name":"Player Manager","year":1995,"developer":"Anco Software Ltd.","url":"psx-chd-roms-p/Player%20Manager%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%2CNo%29.chd","filesize":67493202,"score":"","genres":"Simulation > Sports > Strategy > Text-based / Spreadsheet > Top-down > Fixed / flip-screen > Managerial / business simulation > Football (European) / Soccer","desc":"<p>Player Manager is a football management simulation of unparalelled depth. Featuring all four divisions, promotion and relegation, domestic and European cup competitions, it is the perfect introduction to the world of soccer management. Together with its volatile transfer market, fickle fans and temperamental players it contains all the pressures of sport's toughest profession. This is the definitive management experience.</p>"},{"name":"Player Manager 2000","year":2000,"developer":"Anco Software Ltd.","url":"psx-chd-roms-p/Player%20Manager%202000%20%28Europe%29.chd","filesize":37301866,"score":6.7,"genres":"Sports > Diagonal-down > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>A football management game from the creators of the Kick Off series. <em>Player Manager 2000</em> lets the player coach any team from England, Scotland, Italy, and Germany, and there is totally more than 30,000 players. Tactical options are diverse and the game features both pre- and post-match analysis.</p><p>What makes the game relatively unique is players are able to put themselves in the team. There are three ways to play the matches. The first is the commentary mode, which works almost the same way as the Championship Manager games. The second is the scanner mode, where the player can watch the matches from a 2D, top-down view. The third is to play these matches in full 3D, similar to the FIFA games.</p>"},{"name":"Player Manager 98/99","year":1998,"developer":"Anco Software Ltd.","url":"psx-chd-roms-p/Player%20Manager%20-%20Epoca%2098-99%20%28Portugal%29.chd","filesize":50055445,"score":5.5,"genres":"Sports > Diagonal-down > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>Like its ancestors, this title marks a return to the popular managing game where the player not only is a starting manager, but also a footballer close to retirement age (the player, however, does not control his footballing avatar directly in the field). Players are rated in 18 attributes (plus some hidden attributes), and eight formations. Several tactics give the manager a lot of depth to change into the style more suitable for the footballers available. As there isn't a stat to display the overall value of a player (other than his market value), the player has to choose the starting eleven according to the desired playing style by their individual strengths: defenders with strong heading should be placed in the middle, fast dribblers in the flanks and so on, as well as using the post-match analysis statistics to see how well they performed.</p><p>Like the older titles, the game uses the Kick Off engine to simulate games, in this case Kick Off 97. Other match simulation options include a 2D radar (which can quickly change to the 3D engine in key parts of the game such as goals and cards) and a CM-like text mode. </p><p>If two players want to discover who has the strongest team, they can do so by choosing the \"Friendly\" mode. This allows to import team data from the floppy drive, and play a dream match between them.</p>"},{"name":"Plue no Daibouken from Groove Adventure Rave","year":2002,"developer":"Aspect Co., Ltd.","url":"psx-chd-roms-p/Plue%20no%20Daibouken%20from%20Groove%20Adventure%20Rave%20%28Japan%29.chd","filesize":6883205,"score":"","genres":"Action > Side view > Anime / Manga > Platform > Licensed","desc":"<p>In this game you play Plue, a character from the Rave Master / Groove Adventure Rave manga and anime series written by Hiro Mashima.</p><p>The game is a side scrolling platformer where the goal in each stage is to locate the exit to the next area. Plue can defeat his enemies by jumping on them (much in the same style as several games in the genre). And to aid him in his quest there are tons of various lollipops for him to eat, either for points, but also to give him various attributes to help him along. One lollipop will make a little arrow appear over his head to show him where to go, while another one might make give him some health back. There are over 100 types of candy in the game to be found.</p><p>Plue will occasionally run across various boss battles as well while he travels through the lands (and underwater in some cases).</p>"},{"name":"PO'ed","year":1996,"developer":"Any Channel","url":"psx-chd-roms-p/PO%27ed%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":52379594,"score":7.3,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p><em>PO'ed</em> is an action game similar to DOOM.You are a cook who has to escape an alien world. With such weapons as a frying pan or a drill, you must bash your way through levels full of monsters, one of them being a walking arse (yes, not kidding).One of the most useful items in-game is a jetpack which you must use frequently to explore levels and get to places where no space-cook has gone before.</p>"},{"name":"Pocket Digimon World","year":2000,"developer":"","url":"psx-chd-roms-p/Pocket%20DigimonWorld%20%28Japan%29.chd","filesize":138510083,"score":"","genres":"Simulation > Side view > Text-based / Spreadsheet > 2D scrolling > Managerial / business simulation > RPG elements > Menu structures > Licensed","desc":"<p>A Museum was opened in the Digimon World. It preserved some ancient history and artifacts of the Digital World within. But one night, some evil Digimon decided to brake in and steal all the items, scattering them all around File Island.</p><p>Jijimon, the owner of the museum and eldest in the File City, decides to enlist some help from a Digimon Tamer (the player) to retrieve all the lost exhibits. These exhibits consist of art, music, information of Digimons, history of Digital World and video clips, which can be reviewed in the console game after collecting them. The actual main game primarily happens in a PlayStation accessory device known as PocketStation!</p><p>You can only get 3 different Digimons from the PS1 game to download to PocketStation. These are Agumon, Biyomon and Veemon. You can only use one at a time on the PocketStation game, though.</p><p>In the PocketStation, you can raise your Digimon and battle it either with in-game Digimon or a friend's PocketStation wirelessly over IR connection. You can also connect it to other Bandai Digimon games and products.</p>"},{"name":"Pocket Digimon World: Cool & Nature Battle Disc","year":2001,"developer":"","url":"psx-chd-roms-p/Pocket%20DigimonWorld%20-%20Cool%20%26%20Nature%20Battle%20Disc%20%28Japan%29.chd","filesize":157260463,"score":"","genres":"Simulation > Side view > Text-based / Spreadsheet > 2D scrolling > Anime / Manga > Managerial / business simulation > RPG elements > Menu structures > Licensed","desc":"<p>A Museum was opened in the Digimon World. It preserved some ancient history and artifacts of the Digital World within. But one night, some evil Digimon decided to brake in and steal all the items, scattering them all around File Island.</p><p>Jijimon, the owner of the museum and eldest in the File City, decides to enlist some help from a Digimon Tamer (the player) to retrieve all the lost exhibits. These exhibits consist of art, music, information of Digimons, history of Digital World and video clips, which can be reviewed in the console game after collecting them. The actual main game primarily happens in a PlayStation accessory device known as PocketStation!</p><p>You can only get 4 different Digimons from the PS1 game to download to PocketStation. Gabumon and Gomamon (Cool version), Tentomon and Palmon (Nature version). You can only use one at a time on the PocketStation game, though.</p><p>In the PocketStation, you can raise your Digimon and battle it either with in-game Digimon or a friend's PocketStation wirelessly over IR connection. You can also connect it to other Bandai Digimon games and products.</p>"},{"name":"Pocket Digimon World: Wind Battle Disc","year":2000,"developer":"","url":"psx-chd-roms-p/Pocket%20DigimonWorld%20-%20Wind%20Battle%20Disc%20%28Japan%29.chd","filesize":134881805,"score":"","genres":"Simulation > Side view > Text-based / Spreadsheet > 2D scrolling > Anime / Manga > Managerial / business simulation > RPG elements > Menu structures > Licensed","desc":"<p>A Museum was opened in the Digimon World. It preserved some ancient history and artifacts of the Digital World within. But one night, some evil Digimon decided to brake in and steal all the items, scattering them all around File Island.</p><p>Jijimon, the owner of the museum and eldest in the File City, decides to enlist some help from a Digimon Tamer (the player) to retrieve all the lost exhibits. These exhibits consist of art, music, information of Digimons, history of Digital World and video clips, which can be reviewed in the console game after collecting them. The actual main game primarily happens in a PlayStation accessory device known as PocketStation!</p><p>You can only get 3 different Digimons from the PS1 game to download to PocketStation. These are Patamon, Kunemon and Salamon. You can only use one at a time on the PocketStation game, though.</p><p>In the PocketStation, you can raise your Digimon and battle it either with in-game Digimon or a friend's PocketStation wirelessly over IR connection. You can also connect it to other Bandai Digimon games and products.</p>"},{"name":"Pocket Dungeon","year":1999,"developer":"Liquid","url":"psx-chd-roms-p/Pocket%20Dungeon%20%28Japan%29.chd","filesize":92340019,"score":"","genres":"Role-playing (RPG) > 1st-person > Anime / Manga > Turn-based","desc":"<p>Pocket Dungeon is a dungeon crawling role-playing game which is played entirely on PocketStation, Sony’s PDA crossed with a memory card. The PlayStation disc is used entirely for transferring data to the PocketStation, and the rest of the game takes place entirely on the tiny LCD of the PocketStation. The game has you exploring dungeons, levelling up, talking to NPCs and fighting monsters in classic RPG style. It also features a multiplayer mode, in which two players can battle using the monsters they've defeated in their dungeon adventures.</p>"},{"name":"Pocket Fighter","year":1998,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-p/Pocket%20Fighter%20%28Europe%29.chd","filesize":157369706,"score":7.6,"genres":"Action > Side view > Anime / Manga > Fighting","desc":"<p>What happens when you take several signature Capcom fighters, squish them down into chibi (small or SD) versions of themselves, and give them a whole collection of wacky moves and over-the-top costumes? You get Pocket Fighter! Take on one of several pint-sized Capcom characters in this wacky, colorful fighting game.</p>"},{"name":"Pocket Jiman","year":2000,"developer":"Sugar & Rockets, Inc.","url":"psx-chd-roms-p/Pocket%20Jiman%20%28Japan%29.chd","filesize":83068002,"score":"","genres":"Compilation","desc":"<p><em>Pocket Jiman</em> is a game maker tool for the PlayStation's PocketStation PDA accessory. Players take control of a game editing suite which allows creating text, images, dungeons, monsters and more from the comfort of your PlayStation. Games are then downloaded to a PocketStation and played or shared with others, though provision to play on the TV via a built-in PocketStation emulator is also provided. It also features an IrDA chat program and the ability to transmit your games to others' PocketStation devices, as well as an extensive collection of more than 50 pre-built games.</p>"},{"name":"Point Blank","year":1997,"developer":"Tose Co., Ltd.","url":"psx-chd-roms-p/Point%20Blank%20%28Europe%29%20%28En%2CFr%2CDe%29%20%28Rev%201%29.chd","filesize":170492528,"score":7.7,"genres":"Action > Shooter","desc":"<p>Point Blank is a light gun arcade game, in which players shoots targets in a wide variety of stages. The Playstation version uses the G-Con gun, for action similar to Time Crisis, also by Namco.</p><p>The game has a distinct cartoon theme and is non-violent, making it suitable for all ages. Each stage has a different objective, explained at the start of each stage. This varies from simple target shooting (and avoid to shoot bomb), shooting cardboard villains (avoid shooting cardboard civilians), shooting own color targets (avoid shooting opposing players color), protecting the iconic Dr.Don and Dr. Dan, and many miscellaneous challenges such as the Galaxian stage where lightgun is used in place of spaceships to shoot aliens.</p><p>The stages are presented in groups of 4 and the player or players can choose in which order to play them. You lose a life-heart when you shoot an incorrect target or bomb, or when you fail to complete a mission within the time limit.</p><p>As well as converting the arcade game in its entirety, this conversion also offers a new Quest mode, a Party Play system and more.</p>"},{"name":"Point Blank 2","year":1998,"developer":"Tose Co., Ltd.","url":"psx-chd-roms-p/Point%20Blank%202%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":252784286,"score":7.4,"genres":"Action > Shooter","desc":"<p>Dan and Don return for another round of shooting action. This time there are heaps of new mini games, as well as a few that improve on what was available in the first title in the series. </p><p>The PlayStation version supports the GunCon (or G-Con), but the player can also use normal controllers.</p>"},{"name":"Point Blank 3","year":2000,"developer":"Tose Co., Ltd.","url":"psx-chd-roms-p/Point%20Blank%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":174511051,"score":7.2,"genres":"Action > Shooter","desc":"<p>The third episode in the Point Blank series now has up to 8 players playing it out in the new Team Battle mode, where you take turns to fight it out, and win as many games as possible. </p><p>Also new is the Endurance mode for 1 player, where you simply have to win as many games as possible before you use up all of your credits.</p>"},{"name":"Poketan","year":1999,"developer":"HI Corporation","url":"psx-chd-roms-p/PokeTan%20%28Japan%29.chd","filesize":34992149,"score":"","genres":"Educational > Foreign language","desc":"<p>Poketan is a game focused on helping Japanese speakers improve their English vocabulary. This game was designed almost exclusively for the Pocketstation. Poketan can download hundreds of words onto a Pocketstation-style memory card for reviewing on the go. </p><p>With the Specter the scholastic ghost, who hails from England, as you mentor you will progress through sixteen levels worth of vocabulary. Each level packs one hundred words, giving this game a total of sixteen hundred vocabulary words.</p><p>The game has two modes, card mode, and test mode. In card mode one can chose to receive flash cards going from either Japanese to English, of English to Japanese. You will first see either a Kanji or English word then after you've made you guess as to its counterpart in the opposing language, you can find out exactly what that word is with the touch of a button. </p><p>Particularly difficult to pronounce, or easily confused words (i.e. ear, air), have an option that will allow one to hear a sound clip giving the appropriate pronunciation.</p><p>Test Mode will test the knowledge of what one has learned from card mode. You will be faced with Kanji and have to input the correct corresponding English word. A wrong letter will be corrected. As one wins one will be rewarded by \"Transformations\" of Specter. As one progress through the provided vocabulary, Specter transforms into various shape, car, dog, rain, etc., and will use the words learned in a variety of sentences.</p><p>While playing on a Playstation you will essentially play on a giant simulated Pocketstation. If playing on a Pocketstation you can upload the results of our tests to the Playstation, from where Specters Transformations can be watched.</p>"},{"name":"Polaris SnoCross","year":2000,"developer":"Vicarious Visions, Inc.","url":"psx-chd-roms-p/Polaris%20SnoCross%20%28USA%29.chd","filesize":141041316,"score":6,"genres":"Racing / Driving > Sports > 1st-person > 3rd-person (Other) > Tricks / stunts > Snowmobile > Licensed","desc":"<p>As the title implies, <em>Polaris SnoCross</em> is a game based on the sport of snowmobile racing. It has 3 available modes (Single Event, Instant Action, and Tournament) and supports up to 4 players.* In <em>Single Event</em>, the player can select any of the 5 sleds available for racing. The player can also select the rider suit and the race’s difficulty. Tricks and stunts can also be performed while in-game. The current mode supports up to 4 human players.</p><ul><li><p><em>Instant Action</em> instantly lets you in on the game by randomly selecting the sled, track, time of day and weather conditions.</p></li><li><p>In <em>Tournament</em>, the player can select to play in a new one or continue from a previously saved game. There are 7 events in the Tournament mode and each one consists of a 3 day race (3 races basically). Only one is available at first but each time the player successfully complete an event another of higher difficulty is unlocked.</p></li></ul>"},{"name":"Policenauts (Disc 1)","year":1996,"developer":"Konami Co., Ltd.","url":"psx-chd-roms-p/Policenauts%20%28Japan%29%20%28Disc%201%29.chd","filesize":524646365,"score":7.8,"genres":"Adventure > 1st-person > Anime / Manga > Shooter > Sci-fi / futuristic","desc":"<p>In the year 2010 mankind has built its first space colony, Beyond Coast. Three years later the founders of the colony felt it needed to be protected, and chose five best policemen from Earth to do that: Gates Becker from Scotland Yard, the Japanese Sadaoki Tokugawa, Salvatore Toscanini from New York, and two policemen from Los Angeles: Jonathan Ingram and his best friend Ed Brown. During a routine patrol on Beyond Coast, something happened to Jonathan's spacesuit. He was sucked into space and presumed dead. Twenty-five years later, he is miraculously discovered in his life pod, alive. He still looks like a young man, but in reality, he is fifty-five years old.</p><p>Trying to forget his past, Jonathan opens an investigation agency on Earth. One day, his ex-wife unexpectedly pays him a visit. She has re-married during Jonathan's prolonged absence and asks him to find her missing husband. When she leaves the office, her car explodes, and she dies. Determined to fulfill her final request, Jonathan prepares to re-visit Beyond Coast.</p><p><em>Policenauts</em> is a Japanese-style adventure with action elements, similar in many ways to Snatcher. The player interacts with the environment in a point-and-click fashion: positioning a cursor over an object allows the player character to examine it or perform other context-dependent actions. There are a few puzzles in the game, but most of the time the story is advanced by visiting various locations, examining objects, and talking to characters. Conversations usually include a selection of topics. </p><p>Action sequences are similar to those of <em>Snatcher</em>, but are more numerous and varied. The player must rapidly shoot enemies moving within a one-screen area viewed from a first-person perspective, reloading the gun manually and trying to eliminate the enemy before Jonathan's health bar is depleted.</p>"},{"name":"Policenauts (Disc 2)","year":1996,"developer":"Konami Co., Ltd.","url":"psx-chd-roms-p/Policenauts%20%28Japan%29%20%28Disc%202%29.chd","filesize":407550978,"score":7.8,"genres":"Adventure > 1st-person > Anime / Manga > Shooter > Sci-fi / futuristic","desc":"<p>In the year 2010 mankind has built its first space colony, Beyond Coast. Three years later the founders of the colony felt it needed to be protected, and chose five best policemen from Earth to do that: Gates Becker from Scotland Yard, the Japanese Sadaoki Tokugawa, Salvatore Toscanini from New York, and two policemen from Los Angeles: Jonathan Ingram and his best friend Ed Brown. During a routine patrol on Beyond Coast, something happened to Jonathan's spacesuit. He was sucked into space and presumed dead. Twenty-five years later, he is miraculously discovered in his life pod, alive. He still looks like a young man, but in reality, he is fifty-five years old.</p><p>Trying to forget his past, Jonathan opens an investigation agency on Earth. One day, his ex-wife unexpectedly pays him a visit. She has re-married during Jonathan's prolonged absence and asks him to find her missing husband. When she leaves the office, her car explodes, and she dies. Determined to fulfill her final request, Jonathan prepares to re-visit Beyond Coast.</p><p><em>Policenauts</em> is a Japanese-style adventure with action elements, similar in many ways to Snatcher. The player interacts with the environment in a point-and-click fashion: positioning a cursor over an object allows the player character to examine it or perform other context-dependent actions. There are a few puzzles in the game, but most of the time the story is advanced by visiting various locations, examining objects, and talking to characters. Conversations usually include a selection of topics. </p><p>Action sequences are similar to those of <em>Snatcher</em>, but are more numerous and varied. The player must rapidly shoot enemies moving within a one-screen area viewed from a first-person perspective, reloading the gun manually and trying to eliminate the enemy before Jonathan's health bar is depleted.</p>"},{"name":"Pong: The Next Level","year":1999,"developer":"Eastridge Technology","url":"psx-chd-roms-p/Pong%20-%20The%20Next%20Level%20%28USA%29.chd","filesize":158175470,"score":6.5,"genres":"Action > Arcade > Paddle / Pong > Puzzle elements > Licensed","desc":"<p>After years of game gulping cash left, right and center at the old arcade machine, Pong has returned in an all new 3D title on the PC. But it isn't just your simple Pong any more. Now you can play Jungle Pong, Football Pong, Ice Hockey Pong and 4 player Pong. All this plus 3D graphics. Not to mention animated Penguins (!?!?!).</p>"},{"name":"Pool Academy","year":2000,"developer":"Sunsoft","url":"psx-chd-roms-p/Pool%20Academy%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":356724467,"score":"","genres":"Sports > 1st-person > Direct control > Pool / snooker","desc":"<p>Put on your bow tie and black waistcoat and prepare for an evening of Pool ! * 4 game modes including a trickshot section 8 players to compete against Help from the pro to improve your techniques and skills<br><br>Join the Academy... and discover all the secrets of Pool</p>"},{"name":"Pool Hustler","year":1998,"developer":"Ornith","url":"psx-chd-roms-p/Pool%20Hustler%20%28Europe%29.chd","filesize":297701976,"score":"","genres":"Sports > 1st-person > Top-down > Direct control > Pool / snooker > Contemporary","desc":"<p>there's no such thing as a friendly game.<br><br>hustling is the name of the game<br><br>Shoot in six shady pool halls with unique tables, cuesticks and local pros. Select from single and two-player modes, plus, 8-Ball, 9-Ball, 14-1, and Rotation rules.<br><br>swim with the sharks<br><br>Wager, win, and move on to tougher opponents in your quest to hustle all 12 underground champs - each with unique skills, playing abilities, taunts, and betting strategies.<br><br>learn the ropes and be a pro<br><br>Learn everything from the basics to authentic pool techniques like English, draw and jumping. Align your shot with the realistic top-down camera. Then, view slow-motion instant replays.</p>"},{"name":"pop'n music","year":1999,"developer":"Konami Computer Entertainment Studios Yokohama","url":"psx-chd-roms-p/Pop%27n%20Music%20%28Japan%29.chd","filesize":87227657,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>pop'n music</em> is the first title in Konami's long-running rhythm game series, and the second Bemani series after the original beatmania. Very similar to its sister game beatmania, <em>pop'n music</em> ditches the turntable and keyboard in favor of nine large candy-colored buttons, but otherwise plays much the same. Notes scroll toward the bottom of the screen, and the player must tap the correct buttons in time with the music to play along. Play well, and the \"groove meter\" increases, but play poorly and it will drop. If the groove meter is high enough at the end of the song, the player can move on to the next song.</p><p>This first release includes all of the music from the original arcade release, along with several new original tracks. There is also the standard arcade mode, along with a training mode and a beginner's mode that only uses 5 or 7 of the 9 buttons.</p>"},{"name":"pop'n music 2","year":1999,"developer":"Konami Computer Entertainment Studios Yokohama","url":"psx-chd-roms-p/Pop%27n%20Music%202%20%28Japan%29.chd","filesize":200619535,"score":"","genres":"Action > Arcade > Music / rhythm","desc":"<p><em>pop'n music 2</em> is one of the many titles in Konami's long-running rhythm game franchise. Notes scroll toward the bottom of the screen along nine tracks, and the player must tap the correct buttons in time with the music to play along. Play well, and the \"groove meter\" increases, but play poorly and it will drop. If the groove meter is high enough at the end of the song, the player can move on to the next song.</p><p>This release includes all of the tracks from the first game, along with the new tracks from the arcade release for a total of over 40 songs to play. Several new high-difficulty modes for advanced players have been added, and there is also support for a miniaturized 5-button version of the game called <em>Dokodemo pop'n music</em> that can be played on the PocketStation or Dreamcast VMU. It also functions as a Key Disc for latter Append Disc releases in the series, much like Konami's other Bemani franchises.</p>"},{"name":"pop'n music 3 Append Disc","year":2000,"developer":"Konami Computer Entertainment Studios Yokohama","url":"psx-chd-roms-p/Pop%27n%20Music%203%20-%20Append%20Disc%20%28Japan%29.chd","filesize":184560108,"score":"","genres":"Action > DLC / Add-on > Arcade > Music / rhythm","desc":"<p><em>pop'n music 3</em> is one of the many titles in Konami's long-running rhythm game franchise, and the first of two \"Append Discs\" that require either pop'n music 2 or another Key Disc in the series in order to play. This particular release includes new music from the arcade version, and also includes many of the secret unlockable songs and modes from the previous releases available from the outset, in addition to new high-difficulty options such as Hi-Speed and Turbo settings in Survival mode.</p>"},{"name":"pop'n music 4 Append Disc","year":2000,"developer":"Konami Computer Entertainment Studios, Inc.","url":"psx-chd-roms-p/Pop%27n%20Music%204%20-%20Append%20Disc%20%28Japan%29.chd","filesize":183982562,"score":"","genres":"Action > DLC / Add-on > Arcade > Music / rhythm","desc":"<p><em>pop'n music 4</em> is one of the many titles in Konami's long-running rhythm game franchise, and the second of two \"Append Discs\" that require either pop'n music 2 or another Key Disc in the series in order to play. This particular release includes new music from the arcade version, and also restores the Beginner mode that has been previously removed from the home releases.</p>"},{"name":"pop'n music 5","year":2001,"developer":"Konami Corporation","url":"psx-chd-roms-p/Pop%27n%20Music%205%20%28Japan%29.chd","filesize":334389391,"score":"","genres":"Action > Anime / Manga > Music / rhythm","desc":"<p><em>pop'n music 5</em> is one of the many titles in Konami's long-running rhythm game franchise. Notes scroll toward the bottom of the screen along nine tracks, and the player must tap the correct buttons in time with the music to play along. Play well, and the \"groove meter\" increases, but play poorly and it will drop. If the groove meter is high enough at the end of the song, the player can move on to the next song.</p><p>This release includes all of the music from the arcade version, along with several tracks and modes from the arcade version of pop'n music 6, which had already been released. It also functions as a Key Disc for the Append Disc releases in the series, much like Konami's other Bemani franchises.</p>"},{"name":"pop'n music 6","year":2002,"developer":"Konami Corporation","url":"psx-chd-roms-p/Pop%27n%20Music%206%20%28Japan%29.chd","filesize":461090455,"score":"","genres":"Action > Anime / Manga > Music / rhythm","desc":"<p><em>pop'n music 6</em> is one of the many titles in Konami's long-running rhythm game franchise, and the last to appear on the original PlayStation. Notes scroll toward the bottom of the screen along nine tracks, and the player must tap the correct buttons in time with the music to play along. Play well, and the \"groove meter\" increases, but play poorly and it will drop. If the groove meter is high enough at the end of the song, the player can move on to the next song.</p><p>This release includes all of the music from the arcade version, along with an extensive collection of tracks from previous releases, for a total of over 100 songs available to play. It also included support for an online high-score ranking service, though this has since been closed. It also functions as a Key Disc for the Append Disc releases in the series, much like Konami's other Bemani franchises.</p>"},{"name":"pop'n music: Animation Melody","year":2000,"developer":"Konami Computer Entertainment Studios Yokohama","url":"psx-chd-roms-p/Pop%27n%20Music%20-%20Animation%20Melody%20%28Japan%29.chd","filesize":122596009,"score":"","genres":"Action > Anime / Manga > Arcade > Music / rhythm > Licensed","desc":"<p><em>Animation Melody</em> is one of the many titles in Konami's long-running <em>pop'n music</em> rhythm game franchise. Notes scroll toward the bottom of the screen along nine tracks, and the player must tap the correct buttons in time with the music to play along. Play well, and the \"groove meter\" increases, but play poorly and it will drop. If the groove meter is high enough at the end of the song, the player can move on to the next song.</p><p>This release is a straight port of the arcade version <em>Animelo</em>, and includes a selection of popular anime theme songs from shows such as <em>Dragon Ball Z</em>, <em>Cutey Honey</em>, <em>Kinnikuman</em>, and <em>Galaxy Express 999</em>. The game itself is built off of pop'n music 4, and features the same selection of game modes.</p>"},{"name":"pop'n music: Disney Tunes","year":2000,"developer":"Konami Co., Ltd.","url":"psx-chd-roms-p/Pop%27n%20Music%20-%20Disney%20Tunes%20%28Japan%29.chd","filesize":112208524,"score":"","genres":"Action > Arcade > Music / rhythm > Licensed","desc":"<p><em>Disney Tunes</em> is one of the many titles in Konami's long-running <em>pop'n music</em> rhythm game franchise. Notes scroll toward the bottom of the screen along nine tracks, and the player must tap the correct buttons in time with the music to play along. Play well, and the \"groove meter\" increases, but play poorly and it will drop. If the groove meter is high enough at the end of the song, the player can move on to the next song.</p><p>This release is a straight port of the arcade version <em>Mickey Tunes</em>, and includes a selection of popular songs from Disney's vast catalog of animated films. The game itself is built off of pop'n music 4, and features the same selection of game modes.</p>"},{"name":"Pop'n Pop","year":1998,"developer":"Dreams Co., Ltd.","url":"psx-chd-roms-p/Pop%20n%27%20Pop%20%28Europe%29.chd","filesize":142178671,"score":6.7,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Tile matching puzzle","desc":"<p><em>Pop'n Pop</em> is a puzzle game similar to Puzzle Bobble; the player's goal is to release colored bubbles from the bottom on the screen within a limited amount of time, trying to match three or more bubbles of the same color. The difference in this version is that bubbles cannot bounce on the walls; the player can only release them vertically. The game features characters from various Taito games, such as Bub and Bob from the Bubble Bobble series, Tiki from The New Zealand Story, the dwarves from Doko Doko Don, and others.</p>"},{"name":"PoPoLoCrois","year":1996,"developer":"G-artists","url":"psx-chd-roms-p/PoPoLoCrois%20Monogatari%20%28Japan%29%20%28Rev%201%29.chd","filesize":248795089,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Isometric > Anime / Manga > Turn-based > Fantasy","desc":"<p>POPOLOCROIS, which was released in 1996 and became one of the hit RPGs on the PlayStation®, is now available! Enjoy cinematic-quality animation and a game system in which events, movement, and battles all unfold in the exact same size! Packed with over 400 events that play out in isometric view! We hope you'll be touched by the unforgettable emotional journey of this RPG driven by epic love and friendship.</p>"},{"name":"Popstar Maker","year":2001,"developer":"Teque Software Development Ltd.","url":"psx-chd-roms-p/Popstar%20Maker%20%28Europe%29.chd","filesize":12476277,"score":"","genres":"Simulation > 3rd-person (Other) > Managerial / business simulation","desc":"<p>Look at the charts today, inundated with manufactured bands. The music business is in need of some fresh talent. Well here's your opportunity to show the Nasty Nigels of the World how it's really done!</p><p>As a pop star manager you get to choose your band members and manage them on a day-to-day basis. Treat them well, plan their time and they will be happy and give their best performance. Mismanage them, don't pay them enough and they could walk.</p><p>This is not just a game about management, you get to create great music tracks and watch your band perform live on stage. The success of the band all depends on you, are you the person to make the next super band that will take the World by storm?</p>"},{"name":"Populous: The Beginning","year":1999,"developer":"Bullfrog Productions, Ltd.","url":"psx-chd-roms-p/Populous%20-%20The%20Beginning%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.chd","filesize":255192637,"score":7.9,"genres":"Strategy > Diagonal-down > Free-roaming camera > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Fantasy","desc":"<p><em>Populous: The Beginning</em> is the third part of the Populous series originally created by Peter Molyneux. This is the first part with 3D graphics. Gameplay also received a major overhaul; the player no longer simply has to lower and raise land to gain bigger houses which can defend themselves stronger. Now the player has to chop trees to build huts. Depending on how many men are in the house, the faster its population and the house itself grows. It's possible to train men as fighters, priests, etc. New spells can be added to the shaman's spell inventory through the act of prayer at shrines scattered all over the world. Most spells take the form of natural disasters such as tornadoes and volcanic eruptions.</p><p>Each level is represented by a tiny planet that the player can scroll around freely. Aside from the single player campaign it's also possible to challenge other players online.</p>"},{"name":"Porsche Challenge","year":1997,"developer":"Team SOHO","url":"psx-chd-roms-p/Porsche%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":314723576,"score":7.3,"genres":"Racing / Driving > 1st-person > Behind view > Cinematic camera > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Porsche Challenge is a racing game exclusively dedicated to Porsche's awesome new roadster called Boxster. </p><p>The game was developed in collaboration with Porsche. As a result of this collaboration the game features only Porsche Boxsters as cars and focuses more on realistic look and feel of these Boxsters than on fast and furious action and spectacular crashes.</p><p>The game features interactive tracks, driver personalities, and a range of different game modes, including multiplayer.  There are 4 different tracks available: USA, Japan, Alpine, and Stuttgart.  Each track can be played in 3 different modes: classic, long mode (which features extra shortcuts and extensions to the tracks) and interactive mode (which remixes and extends the tracks).  The action can be viewed by three different camera angles.</p>"},{"name":"Power Dolls 2","year":1997,"developer":"Kogado Studio, Inc.","url":"psx-chd-roms-p/Power%20Dolls%202%20-%20Detachment%20of%20Limited%20Line%20Service%20%28Japan%29.chd","filesize":394290688,"score":"","genres":"Strategy > Top-down > Anime / Manga > Turn-based > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Power Dolls 2</em> is a turn-based mecha-themed tactical game set in a futuristic scenario of the 26th century. Like its predecessor, the game focuses on the war between the planets Omni and Earth. The player commands the all-female Detachment Of Limited Line Service (\"Dolls\") squad and can opt for going through the campaign in a linear fashion or directly select specific missions from the main menu.</p><p>The gameplay is very similar to that of the previous game, with some interface-related and customization additions (such as more detailed ways to outfit mechas). The player must build a team out of several available pilots, assigning a mecha or another type of craft (plane, mobile rocket-launcher, etc.) depending on the type of mission and its requirements. The player then proceeds to the actual mission, navigating squad members in turn-based fashion through a top-down area. Like in the first game, tactical considerations (pre-mission choices, positioning of team members, etc.) sometimes carry more weight than actual armed confrontations with the enemy.</p>"},{"name":"Power Instinct 2","year":1995,"developer":"Atlus Co., Ltd."},{"name":"Power Move Pro Wrestling","year":1996,"developer":"Yuke's Co. Ltd.","url":"psx-chd-roms-p/Power%20Move%20Pro%20Wrestling%20%28Europe%29.chd","filesize":146633133,"score":6.7,"genres":"Sports > Wrestling","desc":"<p>In Power Move Pro Wrestling, you can choose from one of 11 fictional wrestlers to duke it out.  At your disposal is Agent Orange, Malibu Mike, and Chaingang, to name a few.</p><p>When in the ring, you have a wide array of moves to pull off, from body slams and piledrivers to head butts and shoulder breakers.</p><p>You can compete in various matches, such as 1-on-1, 2-on1, Royal Rumble, or King Of The Ring.</p><p>There are two main camera modes; one from ringside, the other from the second floor, giving you a higher view.  You can also rotate the ring 90 degrees, so you can see the action from any side.</p>"},{"name":"Power Play Sports Trivia","year":2002,"developer":"Starsphere Interactive, Inc.","url":"psx-chd-roms-p/Power%20Play%20-%20Sports%20Trivia%20%28USA%29.chd","filesize":6363955,"score":"","genres":"Strategy > Text-based / Spreadsheet > Game show / trivia / quiz > Menu structures","desc":"<p>Think You Got Game?<br>Time to put up or shut up with Power Play Sports Trivia! * Climb the ranking leader, reach the Hall of Fame, and become a Trivia Legend<br><br>* Take on 4,000 brain-bruising questions from the wide, wide world of football, basketball, baseball, and hockey.<br>* 2 Tenacious Trivia Modes:<br><br>TOURNAMENT: Up to 4 players face off to decide who's got the fastest fingers and the maddest skills.<br>LAST MAN STANDING: Avoid the 5 wrong answers and go for the longest winning streak in history.</p>"},{"name":"Power Serve 3D Tennis","year":1995,"developer":"SPS","url":"psx-chd-roms-p/Power%20Serve%203D%20Tennis%20%28USA%29.chd","filesize":170764949,"score":5.7,"genres":"Sports > 3rd-person (Other) > Top-down > Tennis","desc":"<p>Will you dominate the field as world #1 Steve Edwars? Or perhaps you'd prefer to challenge the top players as the up and coming Andy Legacy? <em>Power Serve 3D Tennis</em> is the first tennis game released for the PSX console and as the players' names show, it was not licensed.</p><p>Choose from eight different players and challenge the computer or a friend in this fully 3D tennis game. The player can determine the length of match, playing surface, and camera angle to suit the playing style. There is also an option of teaming up with a partner in doubles action. Full match statistics are available after each match.</p>"},{"name":"Power Shovel","year":2000,"developer":"Taito Corporation","url":"psx-chd-roms-p/Power%20Shovel%20%28USA%29.chd","filesize":169168381,"score":"","genres":"Simulation > 3rd-person (Other) > Real-time > Arcade > Agricultural / industrial","desc":"<p><em>Power Shovel</em> is an arcade/simulation where you get to drive excavators of various sizes to do more or less realistic tasks. These include; digging holes, loading sand on trucks, tearing down old buildings, destroying abandoned cars and serving soup in a restaurant (using the scoop as a soup ladle), and many more.</p><p>There are a few different modes in the game you can choose from, like \"License king\" where you earn your driver's license. \"Arcade king\" is where you do will spend most of the time, since it's where most of the games are. As you progress through the many timed games you earn money, which you use to unlock special features like extra credits, photo galleries and sound effects.</p>"},{"name":"Power Spike: Pro Beach Volleyball","year":2000,"developer":"Carapace","url":"psx-chd-roms-p/Power%20Spike%20-%20Pro%20Beach%20Volleyball%20%28USA%29.chd","filesize":211737183,"score":5.6,"genres":"Sports > 3rd-person (Other) > Volleyball > Licensed","desc":"<p><em>Power Spike Pro Beach Volleyball</em> is a beach volley game with an official Federation of International Volleyball license. There are 40 real players to play with on 14 different courts located all over the world. Game modes include exhibition, world tour and practice mode. The player editor allows you to create your own players. The game features a targeting rectangle to aid the player in placing his balls.</p>"},{"name":"Powerpuff Girls, The: Chemical X-Traction","year":2001,"developer":"VIS Entertainment Limited","url":"psx-chd-roms-p/Powerpuff%20Girls%2C%20The%20-%20Chemical%20X-Traction%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":407408691,"score":5.7,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > Licensed","desc":"<p>The Powerpuff Girls must battle enemies in a variety of settings in order to reclaim Chemical X and track down Mojo Jojo.  </p><p>In the story mode, players can pick up objects and throw them at an enemy to decrease their opponents health meter. They can use superpowered attacks by collecting vials of Chemical X.  If the player successfully defeats the enemy in two out of three rounds, they move to the next enemy location.</p><p>Players can play the story mode or can battle against a friend in a head-to-head battle.</p>"},{"name":"Powerslave","year":1997,"developer":"Lobotomy Software, Inc.","url":"psx-chd-roms-p/Powerslave%20%28USA%29.chd","filesize":229890679,"score":8.1,"genres":"Action > 1st-person > Metroidvania > Shooter > Direct control > Africa > Sci-fi / futuristic","desc":"<p>In this First person shooter, you're an armed forces specialist sent to investigate strange happenings at the ancient Egyptian city of Karnak. Soon you learn that alien invaders with a penchant for mummifying humans alive have taken over the place.You have to fight your way through increasingly difficult levels with an unbelievable cast in order to finish it.</p>"},{"name":"Poy Poy","year":1997,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"psx-chd-roms-p/Poy%20Poy%20%28Europe%29.chd","filesize":155225957,"score":7.2,"genres":"Action > Isometric > Board game","desc":"<p>In <em>Poy Poy</em>, contestants from all over the land come together to compete for big cash prizes and the honor of being crowned the Poy Poy Cup champion. To become champion you have to beat three rounds on each of the six stages. You can choose from a variety of characters each with different attributes.</p><p><em>Poy Poy</em> is a multiplayer party/action-game in which four players battle it out by throwing rocks, bombs, logs, wooden boxes, etc. at each other on varying battle arenas for a set amount of time. At the end players are awarded points based on their remaining health, how many times they were able to hit others with objects and how many white hearts they were able to collect from the arena. Players can also choose from a number of psyche-gloves, that give them various special-abilities when used. There is also the Channel Poy Poy studio's lobby area that has a glove shop, a glove tune-up shop, and a memory card access terminal.</p>"},{"name":"Poy Poy 2","year":1998,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"psx-chd-roms-p/Poy%20Poy%202%20%28Europe%29.chd","filesize":180473073,"score":6.8,"genres":"Action > Isometric > Board game","desc":"<p>Poy Poy 2, the sequel to Poy Poy, is a multiplayer party/action-game in which four players battle it out by throwing rocks, bombs, logs, etc. at each other on varying battle arenas. The time limit for each round is 90 seconds and at the end players are awarded points based on their remaining health, how many times they were able to hit others with objects and how many \"lucky hearts\" they were able to collect from the arena. Players can also choose from a number of psycho-gloves, that give them various special-abilities when used.</p>"},{"name":"Premier Manager 2000","year":2000,"developer":"Infogrames Studios Limited","url":"psx-chd-roms-p/Premier%20Manager%202000%20%28Europe%29.chd","filesize":225953730,"score":6.7,"genres":"Sports > Managerial / business simulation > Football (European) / Soccer","desc":"<p>Continuing the Premier Manager series Premier Manager 2000 brings football management back with more features. Allowing four players to go up against each other with their favorite team and with the use of the multi-tap.Take part in the transfer market involving teams and players from England, Italy, Germany, France and Spain. Take your team into domestic and European competitions to become the best team in Europe.As well as team management you control all aspects of your stadium including ticket pricing, expansions, scouts and finances with the bank.With 3D match play you can see your changes and formations in action accompanied by commentary from Barry Davies.</p>"},{"name":"Premier Manager 98","year":1998,"developer":"Dinamic Multimedia, S.A.","url":"psx-chd-roms-p/Premier%20Manager%2098%20%28Europe%29.chd","filesize":84341582,"score":6.9,"genres":"Sports > 3rd-person (Other) > Managerial / business simulation > Football (European) / Soccer","desc":"<p><em>Premier Manager 98</em> is a team data update of Premier Manager 97. All 92 teams from the nationwide leagues and international teams were updated for the 1997-98 season, keeping all the features from the previous title (online English league database, 3D match engine) untouched.</p><p>Although only the English league is available, it is still possible to play in pre-season friendlies or international competitions against most first division teams in Europe and South America or scout and sign their players.</p><p>There are two game modes: Manager and Pro-Manager. Manager allows the player to start in any team. Pro-Manager, on the other hand, requires the player to build his career from the Conference, promoting the club from the lower divisions or getting promoted himself to better ranked teams. It's possible to tweak options such as the level of control (\"trainer\" leaves the player only in control of player tactics and squad selection, \"accountant\" is the exact opposite, giving the player control over transfers, contracts, staff, finance, board room options and ground expansions, but no limited control over the squad, \"Manager\" gives control in all but contract deals and \"total\" gives full executive control) or if players age and eventually retire, or play forever.</p><p>Up to 20 players can play in Manager mode, 8 in Pro-Manager.</p>"},{"name":"Premier Manager Ninety Nine","year":1999,"developer":"Dinamic Multimedia, S.A.","url":"psx-chd-roms-p/Premier%20Manager%20Ninety%20Nine%20%28Europe%29.chd","filesize":251096015,"score":7.1,"genres":"Sports > 3rd-person (Other) > Managerial / business simulation > Football (European) / Soccer","desc":"<p>Unlike the data update that is PM98, Ninety Nine (the actual title of the game) uses Dinamics' PC Fútbol 6 engine to go along the obligatory 1998-99 squad updates. Among the new features, it is now possible to make more than one player bid at the same time, more frequent and detailed staff messages, player history to track down previous seasons, a full 3D match engine and a 2D radar view (replacing the old text mode) and finally merchandising and catering, and individual adboard management. The detailed database is still there, and so are the Manager and Pro-Manager modes. Only the English leagues are playable still and Kevin Keegan, Fulham and then soon-to-be England manager, endorsed the title.</p><p>The manager modes and options remain the same: Manager allows the player to start in any team, Pro-Manager requires building a career from the Conference, promoting the club from the lower divisions or getting promoted himself to better ranked teams. The difficulty level can be further tweaked by changing areas where the staff takes control, and you can determine if players age and retire with time.</p><p>Again, up to 20 players can play in Manager mode and 8 in Pro-Manager.</p>"},{"name":"Primal Rage","year":1995,"developer":"Atari Games Corporation","url":"psx-chd-roms-p/Primal%20Rage%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.chd","filesize":233178608,"score":6.7,"genres":"Action > Side view > Arcade > Fighting > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>A meteor struck the Earth and caused great chaos. Seven gods from ancient times awoke, and are now attempting to take control of the post-apocalyptic world.</p><p><em>Primal Rage</em> is a one-on-one fighting game featuring dinosaurs and giant apes as the fighters. The graphics are done with digitized stop-motion animation. Gameplay is similar to Mortal Kombat in that it is viewed from a side perspective, and features deadly finishing moves at the end of the match.</p>"},{"name":"Princess Maker - Yumemiru Yousei","year":1997,"developer":"Ninelives","url":"psx-chd-roms-p/Princess%20Maker%20-%20Yumemiru%20Yousei%20%28Japan%29.chd","filesize":195236819,"score":"","genres":"Role-playing (RPG) > Simulation > 1st-person > Anime / Manga","desc":"<p>The third main installment (and fourth game in all) in Gainax' Princess Maker simulation series. A young fairy wants to become a human princess. The fairy Queen first refuses to fulfill her wish, but the fairy becomes so upset that the Queen finally decides to make her reborn as a princess, and entrusts her future to you. You are the one responsible for what the little princess will become. You can give her a good education, let her study a lot, fight, develop her sense for arts, etc. The princess will go to school and make friends and rivals, and live her life to the full according to your plans.</p>"},{"name":"Prismaticallization","year":1999,"developer":"Arc System Works Co., Ltd.","url":"psx-chd-roms-p/Prismaticallization%20%28Japan%29.chd","filesize":73702478,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Visual novel > Fantasy > Romance","desc":"<p><em>Prismaticallization</em> is a romantic visual novel adventure game keeping the player trapped in the same that constantly repeats itself. While the goal is to get close to various girls and get together with the girl you like, unless you find a way to break the time loop, after the day resets you will have to do the wooing all over again, which may be play if you decide to go for a different girl. The game is a typical visual novel game which uses static 2D anime style characters over background which is comprised in small portion of an artwork showing the location while majority is the window frame itself with dialogue window pasted over the character you are talking to.</p>"},{"name":"Prisoner of Ice","year":1997,"developer":"Infogrames Europe SA","url":"psx-chd-roms-p/Prisoner%20of%20Ice%20-%20Jashin%20Kourin%20%28Japan%29.chd","filesize":358487995,"score":7.2,"genres":"Adventure > 3rd-person (Other) > Cinematic camera > Graphic adventure > Puzzle elements > Interwar > Horror > Licensed","desc":"<p>Another game in Infogrames' line of H. P. Lovecraft inspired games started by Alone In the Dark, <em>Prisoner of Ice</em> puts you in the role of Lt. Ryan, an American agent stationed aboard the submarine H.M.S. Victoria on a rescue mission to the Antarctic. The Victoria picks up two mysterious crates during the course of the rescue. Before you know it the Captain is eaten alive by the cargo, a horrific monster with whom you are trapped aboard the submarine. And that's just the start of your problems.</p><p><em>Prisoner of Ice</em> features a very simplified version of the classic adventure game interface, where you can left click with the cursor to operate an object or right click to look at it. The program won't let you do anything with these objects, other than the few appropriate actions needed to advance the game.</p>"},{"name":"Pro 18 World Tour Golf","year":1999,"developer":"Intelligent Games Ltd","url":"psx-chd-roms-p/Pro%2018%20-%20World%20Tour%20Golf%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%29.chd","filesize":326246892,"score":6.3,"genres":"Sports > Behind view > Golf","desc":"<p>This golf game has TV-style presentation, with commentary by Peter Alliss and Bobby Clampett. Courses and players are photo-realistic, with course layouts accurate to within 3 centimetres. There are no fly-bys, although you can pan around the course to give some clues as to its layout. Four button presses are used to take a shot; draw and fade are set by how long the appropriate press is held down for.</p><p>Several leading players are featured, including Colin Montgomerie and Vijay Singh as well as female and amateur players. There are three courses - Royal County Down, The Lost City and Couer D'Alene (plus Royal Birkdale on the North American edition).</p>"},{"name":"Pro Backgammon","year":1999,"developer":"Mere Mortals Ltd.","url":"psx-chd-roms-p/Pro%20Backgammon%20%28Europe%29.chd","filesize":193817665,"score":"","genres":"Strategy > Top-down > Fixed / flip-screen > Turn-based > Board game > Point and select","desc":"<p>Each game offers a different challenge, and depends on both strategy and luck.<br>A tutorial mode that allows beginners to learn about the movement of the pieces and other rules.<br>With 7 levels of difficulty, caters for beginner to professional!<br>A variety of game modes, including \"Tournament\", \"Free For All\" and \"2 Player\".</p>"},{"name":"Pro Body Boarding","year":2001,"developer":"TheyerGFX Pty Ltd","url":"psx-chd-roms-p/Pro%20Body%20Boarding%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":162419110,"score":"","genres":"Sports > 3rd-person (Other) > Tricks / stunts > Direct control > Surfing","desc":"<p>Pro Bodyboarding lets you decide which waves to ride as you attempt to beat the opposition and perform the wildest tricks, with stunts allowing you to somersault, spin and corkscrew through the barrel of a wave.<br><br>The only limit to the stunts you perform is your own courage! With four different beaches to play through, each with their own wave patters and scenery, will you be crazy enough to beat the other boarders?</p>"},{"name":"Pro Evolution Soccer","year":2002,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-p/Pro%20Evolution%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":465928630,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p><em>Pro Evolution Soccer</em> has more than 50 international soccer sides and 16 of the best club teams from around the world - ranging from Manchester United and AC Milan to Leeds United, who were briefly a top side at this time.</p><p>The player also has a large array of options. The player can play single matches as well as league or cup tournaments, and there is also a training mode. There are 5 difficulty levels, different weather conditions, and injuries are optional, as are extra time and penalty shoot-outs. Players can be designed with a range of physical and mental attributes, as well as different appearances.</p><p>Gameplay is not as end-to-end as the contemporary FIFA titles, and finishing is more of a matter of precise timing and skill. Players and officials make mistakes on occasion as well.</p>"},{"name":"Pro Pinball: Big Race USA","year":1998,"developer":"Cunning Developments","url":"psx-chd-roms-p/Pro%20Pinball%20-%20Big%20Race%20USA%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":203870738,"score":7.2,"genres":"Action > 1st-person > Pinball","desc":"<p>The table included in this pinball game has a taxi theme attached to it. As you slam the ball around the screen, you can pick up passengers, drive around USA, and get bonus points through mini games, all related to taxi driving. Even the dot matrix screen gets a say in the action, where you must crash into as many cars as possible as you drive your passenger to his/her destination, all in the name of points of course.</p>"},{"name":"Pro Pinball: Fantastic Journey","year":2000,"developer":"Cunning Developments","url":"psx-chd-roms-p/Pro%20Pinball%20-%20Fantastic%20Journey%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":176343602,"score":7.1,"genres":"Action > Pinball > Steampunk","desc":"<p>The fourth in the Pro Pinball series, this game once again features only one table. The theme is Victorian technology - by building such machines as an airship and submarine and performing various tasks (such as completing 'adventures' by shooting ramps), the goal is to defeat the evil General Yagov. A multi coloured dot panel is the main new feature compared to other Pro Pinball games.</p>"},{"name":"Pro Pinball: The Web","year":1996,"developer":"Cunning Developments","url":"psx-chd-roms-p/Pro%20Pinball%20-%20The%20Web%20%28Europe%29.chd","filesize":192440420,"score":7.5,"genres":"Action > Pinball","desc":"<p>In this pinball simulation, you play on a table called \"The Web\". With the help of three flippers, you must send the ball into the various openings, trapdoors, and ramps. You can gain various bonuses (such as several balls to knock at the same time) if you play particularly well. Some of the targets activate special missions when you hit them with a ball. Those missions vary from aiming at specific targets to playing mini-games, such as shooting asteroids. After you have completed five missions, you'll be able to face the Dark Queen, the off-screen antagonist of the game.</p><p>Unlike many other pinball games, \"The Web\" aims for realistic simulation of pinball. The game implements real table physics, and doesn't feature any unrealistic gadgets or living enemies.</p>"},{"name":"Pro Pinball: Timeshock!","year":1998,"developer":"Cunning Developments","url":"psx-chd-roms-p/Pro%20Pinball%20-%20Timeshock%21%20%28USA%29.chd","filesize":277011362,"score":7.9,"genres":"Action > Pinball","desc":"<p>The follow-up to The Web features a single but a very complex table. You have a 3D view of the table, with 4 different viewpoints. Your ultimate point-scoring goal is to travel through time by collecting crystals. The game takes in Roman, Prehistoric and Futuristic settings, as well as the present-day world.</p><p>There is a lot of secret stuff to discover. Many videos are shown in the dot matrix display above the table. The developers also included a preview mode, that lets you zoom into special areas of the table.</p>"},{"name":"Pro Wrestling Sengokuden 2: Kakutou Emaki","year":1998,"developer":"Dream Japan","url":"psx-chd-roms-p/Pro%20Wrestling%20Sengokuden%202%20-%20Kakutou%20Emaki%20%28Japan%29.chd","filesize":65707414,"score":"","genres":"Simulation > Sports > 1st-person > Real-time > Managerial / business simulation > Wrestling > Asia","desc":"<p>Become the professional wrestler of your dream and start managing a professional wrestling organization!<br>Whether it is training each body part such as the neck or the arms, or polishing various skills such as punching, throwing or the joint-locking technique, the practical training menu will allow you to freely train each wrestler!<br>Last but not least, there will be a variety of costume parts available including hair styles, gloves, shoes and paints.<br>While training newcomers, scout for other influential leading athletes from other groups in order to emerge as the best professional wrestling organization!</p>"},{"name":"Pro Wrestling Sengokuden: Hyper Tag Match","year":1997,"developer":"Dream Japan","url":"psx-chd-roms-p/Pro%20Wres%20Sengokuden%20-%20Hyper%20Tag%20Match%20%28Japan%29.chd","filesize":101563628,"score":"","genres":"Sports > 3rd-person (Other) > Wrestling > Asia","desc":"<p>This is the pro wrestling game with a variety of modes such as the single match, tag match, group match, 100 group gang and more!<br>More than 250 wrestling techniques can be enjoyed from more than 20 wrestlers, and there will be techniques ranging from bold moves to maniac skills.<br>Moreover, with live voice by the real voice you can enjoy the hot and intense fight with a powerful feeling with presence.<br>Let's form the strongest tag team and aim for the top in the pro wrestling world! !</p>"},{"name":"Professional Underground League of Pain","year":1997,"developer":"Beyond Reality","url":"psx-chd-roms-p/Professional%20Underground%20League%20of%20Pain%20%28USA%29.chd","filesize":144302875,"score":6.1,"genres":"Action > Sports > Diagonal-down > Top-down > Cinematic camera > Sci-fi / futuristic","desc":"<p><em>Riot</em> is a futuristic sports game. The court is a hall similar to a basketball field but the basket is in the middle. The goal is to throw a charged energy ball into the basket. It is charged in energy fields that are placed in the opponent's half. There are three areas which give a different amount of points. The team which has the most points when the game is over wins. </p><p>Every team consists of six players which have different scores in condition, speed, power and accuracy. Occasionally appearing power ups give a boost to one ability. There are no rules against attacking the opponent's players. 23 camera angles, including top down and directly behind the used player, can be used during the game.</p><p>There are three playing modes: Exhibition matches are a single game between two of the 16 teams. In the second mode, there is a playoff tournament where several player-controlled teams can participate. Only one team can be controlled in the league mode.</p>"},{"name":"Project Overkill","year":1996,"developer":"Konami Computer Entertainment Chicago, Inc.","url":"psx-chd-roms-p/Project%20Overkill%20%28Europe%29.chd","filesize":315045253,"score":7.1,"genres":"Action > Isometric > Puzzle elements > Shooter > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>In the distant future, mega-corporation Terracom has authorized its Off-World Colonization Division to expand to new planets through whatever means necessary.  Since worlds that have any kind of development are off limits for corporate planetary development, Terracom is hiring Terran and alien soldiers through a directive known as \"Project Overkill\" to \"unpopulate\" desirable locations.In response, a corporate leak has hired mercs to fight against the injustice of Terracom with the ultimate goal: destroy \"Project Overkill.\"</p><p>Take on the role of four ruthless mercs as you rack up the body count through over 50 different missions with multiple paths.  One of the earlier releases for the Playstation, Project Overkill uses a 3D rendered, 3/4 perspective to deliver loads of blood-drenched mayhem.</p>"},{"name":"Project: Horned Owl","year":1995,"developer":"AlfaSystem Co., Ltd.","url":"psx-chd-roms-p/Project%20-%20Horned%20Owl%20%28USA%29.chd","filesize":200515333,"score":6.3,"genres":"Action > 1st-person > Anime / Manga > Rail shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Horned Owl</em> is a rail-shooter that can take advantage of the PlayStation mouse or the Konami light gun. Three main characters are available. The levels are all city-based with multiple mech style enemies to dispatch. The game plays pretty quick as there are only five levels. Masamune Shirow, famous for the anime <em>Ghost In The Shell</em>, was involved with the character design.</p>"},{"name":"Psybadek","year":1998,"developer":"Psygnosis Limited","url":"psx-chd-roms-p/Psybadek%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":426485800,"score":5.9,"genres":"Action > Sports > Behind view > Direct control > Snowboarding / skiing","desc":"<p>In <em>Psybadek</em>, you maneuver a hoverboard through jungle, desert, underworld and ice levels as Xako or Mia to save your friends trapped by an evil overlord. While more action oriented than racing, the game encourages you to pull off tricks and speed, all the while collecting stars and solving the odd puzzle.</p>"},{"name":"Psychic Detective (Disc 1)","year":1996,"developer":"Electronic Arts, Inc.","url":"psx-chd-roms-p/Psychic%20Detective%20%28Europe%29%20%28Disc%201%29.chd","filesize":595438432,"score":6.1,"genres":"Adventure > 1st-person > Full Motion Video (FMV) > Adult > Detective / mystery > Horror","desc":"<p>Eric Fox is a psychic who lives in San Francisco and earns his living performing magic shows in seedy nightclubs. This changes when Eric meets Laina, a mysterious woman who trains him to venture inside other people's minds. Laina then hires Eric as a private detective to travel into the minds of the people who attend a wake held in honor of her father, which has died under unclear circumstances.</p><p><em>Psychic Detective</em> is an interactive movie with adventure elements. The player can choose people whose minds Eric is able to read, and also interact with objects for further insight into the storyline. Many of these decisions and interaction choices branch the storyline, leading it to different endings; one of these endings is reached if the player chooses not to interact at all and lets the movie unfold by itself.</p>"},{"name":"Psychic Detective (Disc 2)","year":1996,"developer":"Electronic Arts, Inc.","url":"psx-chd-roms-p/Psychic%20Detective%20%28Europe%29%20%28Disc%202%29.chd","filesize":430157327,"score":6.1,"genres":"Adventure > 1st-person > Full Motion Video (FMV) > Adult > Detective / mystery > Horror","desc":"<p>Eric Fox is a psychic who lives in San Francisco and earns his living performing magic shows in seedy nightclubs. This changes when Eric meets Laina, a mysterious woman who trains him to venture inside other people's minds. Laina then hires Eric as a private detective to travel into the minds of the people who attend a wake held in honor of her father, which has died under unclear circumstances.</p><p><em>Psychic Detective</em> is an interactive movie with adventure elements. The player can choose people whose minds Eric is able to read, and also interact with objects for further insight into the storyline. Many of these decisions and interaction choices branch the storyline, leading it to different endings; one of these endings is reached if the player chooses not to interact at all and lets the movie unfold by itself.</p>"},{"name":"Psychic Detective (Disc 3)","year":1996,"developer":"Electronic Arts, Inc.","url":"psx-chd-roms-p/Psychic%20Detective%20%28Europe%29%20%28Disc%203%29.chd","filesize":538622599,"score":6.1,"genres":"Adventure > 1st-person > Full Motion Video (FMV) > Adult > Detective / mystery > Horror","desc":"<p>Eric Fox is a psychic who lives in San Francisco and earns his living performing magic shows in seedy nightclubs. This changes when Eric meets Laina, a mysterious woman who trains him to venture inside other people's minds. Laina then hires Eric as a private detective to travel into the minds of the people who attend a wake held in honor of her father, which has died under unclear circumstances.</p><p><em>Psychic Detective</em> is an interactive movie with adventure elements. The player can choose people whose minds Eric is able to read, and also interact with objects for further insight into the storyline. Many of these decisions and interaction choices branch the storyline, leading it to different endings; one of these endings is reached if the player chooses not to interact at all and lets the movie unfold by itself.</p>"},{"name":"Psychic Force","year":1996,"developer":"Taito Corporation","url":"psx-chd-roms-p/Psychic%20Force%20%28Europe%29.chd","filesize":320951580,"score":6.6,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Cyberpunk / dark sci-fi","desc":"<p>The year is 2010, and people are being born with special powerful abilities, such as the power to control the elements. These people are deemed \"Psychics\". A large group of underground Psychics are plotting something mysterious, which may endanger everyone, and this group is called \"Noa\". Psychic Force follows the intertwined adventures of a group of Psychics as they each struggle to reach their goal, and ultimately defeat the threat of Noa.</p><p><em>Psychic Force</em> is a one-on-one fighting game and battles take place in a flying, floating cube on a 2D plane. The characters use a combination of Psi powers and combat techniques, with each player having his/her own special abilities. Each Psychic character has attacks relevant to the element they control (fire, ice, thunder, wind, gravity, etc.), while Gates (the only non-Psychic character) has a built-in weapons system. Every character has two light attacks, two heavy attacks, one ultimate attack, a charge and the ability to block attacks. There is a Training mode, where players can learn and test out Psi powers, the regular Arcade mode, and a Story mode in which the main characters fulfil their quests.</p>"},{"name":"Psychic Force 2","year":1999,"developer":"Taito Corporation","url":"psx-chd-roms-p/Psychic%20Force%202%20%28Europe%29.chd","filesize":390741297,"score":6.4,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Cyberpunk / dark sci-fi","desc":"<p><em>Psychic Force 2012</em>, the sequel to Psychic Force, is a one-on-one fighting game with a twist. The matches take place inside a giant floating cube. You are able to fly, using your psychic abilities, around a 3D arena with six walls. Each of the ten available characters, Might, Regina, Wendy, Emilio, Setsuna, Patty, Gudeath, Genshin, Carlo, and Gates, are controlled with three buttons: guard, weak attack and strong attack. The effect varies with the distance. Next to the regular life meter, there is also a power meter. By using special moves, the meter is drained and your moves are limited. It is possible to recharge, and the capacity of the power meter expands when you lose a lot of health.</p><p>Additionally, each fighter has its own unique moves, energy attacks and a weapon, which they use, mid-flight, to pummel their opponent. There are three main game modes: training, versus and a story mode using static anime-inspired images and in-engine cut scenes to tell the story. The story centers around two groups of psychics with differing ideals about co-existence with humans. In the middle of this are several neutral psychics with ties to members in either group.</p><p>The later PlayStation port, renamed to <em>Psychic Force 2</em>, adds the 3 missing characters from the first game (Genma, Brad and Sonia), the psy-expand mode where the player can play a series of special battles to learn other character attacks, and an anime intro video replacing the original in-game intro. It also lowers the overall difficulty of the CPU fighters and makes some control adjustments (for instance the shield can now optionally be enabled with a single button). Of course, the graphics were notably degraded.</p>"},{"name":"Pu-Li-Ru-La","year":1997,"developer":"Taito Corporation"},{"name":"Puchi Carat","year":1998,"developer":"ITL Co., Ltd.","url":"psx-chd-roms-p/Puchi%20Carat%20%28Europe%29.chd","filesize":265140743,"score":"","genres":"Action > Side view > Fixed / flip-screen > Anime / Manga > Arcade > Paddle / Pong","desc":"<p>In the world of <em>Puchi Carat</em>, thieves stole the twelve gems that made the people's dreams come true. They sold them to evil sorcerers who used them to suppress the people. Now, a long time after these events, the gems came into the possession of twelve mysterious characters. Each one of them tries to get a hold of the remaining jewels to fulfill their dreams - some of them seek peace while others want to satisfy their hunger for power.</p><p>Puchi Carat takes its inspiration from the video game classic Breakout. The player has to clear rows of gems with a ball launched from a cursor that can only move horizontally on the bottom of the screen. In regular intervals, the stones will move one row towards the bottom. Once they reach a line just above the cursor, the game is over. New rows of jewels also appear if the player is unable to catch the ball and it bounces off the floor on the very bottom of the screen.</p><p>The single player mode has four different variations. In trial mode, the player has to destroy a certain amount of rows to advance to the next level. Story mode pits the player against the computer in a split screen fashion. It is possible to send rows of stones to the other player in three different modes, depending on the attack pattern the player selected. The third mode is time attack: here the player competes for the fastest time destroying 50 rows of gems. The final mode is called rapid mode where the player competes for the highest number of rows they destroyed.</p><p>It is also possible to play against a human opponent. In this mode, difficulty and handicaps can be selected by the players. The player who wins the most rounds is the winner of the multiplayer match.</p>"},{"name":"Puma Street Soccer","year":1999,"developer":"Trecision S.p.A.","url":"psx-chd-roms-p/Puma%20Street%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.chd","filesize":177134689,"score":5.8,"genres":"Simulation > Sports > 3rd-person (Other) > Side view > Football (European) / Soccer > Licensed","desc":"<p><em>Puma Street Soccer</em> is a 4-on-4 football game, based on Puma's own version of indoor football. The field is small, surrounded by a hip-height that board players can use to bounce the ball. The rules are simple: the game starts like in basketball, with the ball being dropped between the two forwards in midfield. The rest of the game is very freeform, with fouls being awarded for awkward challenges (penalties are given if the attacking player is on the break) and throw-ins (scored with the feet) if the ball goes above the boards. The player can select the tactics - with the three field players (the goalkeeper can't leave the goal area), it's possible to play more offensively (with two in front and one in the back) or defensively (two in the back and one in front). While the real tournament was traditionally played on public parks and car lots, the game version includes these and more exotic settings, such as an airport, a ship's deck, or in the middle of a city crossroad. The grand finals are always played inside an indoor arena.</p><p>After a team manages a number of shots, they are entitled to three \"supershots\", which are much more powerful and swerve a lot more than regular shots. The three shots, if well used, can turn a game upside down in a matter of seconds, or mean the team will have to do a lot to make up for them if spoiled. While building up the Supershot gauge, the player has to rely on well-placed shots, headers, volleys, bicycle kicks, or moving the ball in attack very quickly to score. </p><p>By winning competitions, players can unlock Puma-sponsored stars, such as JJ Okocha, Lothar Matthaus, Angelo Peruzzi, or Gianluca Pagliuca, and compete with them in their national teams.</p>"},{"name":"Punky Skunk","year":1996,"developer":"Ukiyotei Company, Ltd.","url":"psx-chd-roms-p/Punky%20Skunk%20%28USA%29.chd","filesize":349670561,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p><em>Punky Skunk</em> is a side scrolling platformer where the titular skunk has to rescue his friends from a mad wolf who is threatening to take control of the world. Like in other games of its kind the player has to make his way through the levels by running left and right, jumping and using a spray attack to take out the various enemies that stand in his way. To complete a level the player has to reach a flagpole and attack it. When hit by an enemy the skunk loses one of his green orbs (which acts as hitpoints) and when all out of these a life is lost. More orbs can be earned by taking out enemies. Collectable stars can be found all around the levels and by getting a hundred of these an extra life is earned.</p><p>The player will come across various extreme gears that allow him to progress through the levels. Once a gear is equipped the regular spray attack can not be used. There are six gears but only one can be equipped at a time. These include the diggers which allow the player to dig through earth in a Dig-Dug fashion, the paraglider which allows him to use air currents to his advantage, the pogo stick that allows him to jump higher, the skates which allows him to move really fast and the snowboard which allows him to gain speed on downhill slopes. There is also a jetpack that is only available towards the end of the game.</p>"},{"name":"Puppet Zoo Pilomy","year":1996,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-p/Puppet%20Zoo%20Pilomy%20%28Japan%29%20%28En%2CJa%29.chd","filesize":354770062,"score":"","genres":"Simulation > 1st-person > City building / construction simulation > Managerial / business simulation","desc":"<p>PUPPET ZOO PILOMY is a simulation game that plays like toy blocks. Build up different kinds of animals with the parts by manipulating the simple controls, and explore the nature with your animals today.</p>"},{"name":"Purumui Purumui","year":1999,"developer":"F2 Company","url":"psx-chd-roms-p/Purumui%20Purumui%20%28Japan%29.chd","filesize":398527815,"score":"","genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Real-time","desc":"<p>One day in the peaceful village of Puru in the world of Fillip Side, Mui and Popuri were playing in the forest. They happened upon a strange shrine, and suddenly from the sky came a young girl. Her name is Madoka, but other than that, she doesn't remember anything about who she is or where she's from. Not knowing what else to do, she decides to stay with Mui and his family, helping out with errands around the village...</p><p><em>Purumui Purumui</em> is a self-described \"morphing RPG\", an action RPG which includes elements of A Boy and His Blob and cooking games like Cooking Mama. Madoka can find or purchase different ingredients, then use them to prepare different dishes, which when fed to Mui result in different transformations including bridges and ladders, as well as different types of weapons for use in the dungeons.</p>"},{"name":"Putter Golf","year":2001,"developer":"Amedio Co., Ltd.","url":"psx-chd-roms-p/Putter%20Golf%20%28USA%29.chd","filesize":101173934,"score":"","genres":"Sports > 3rd-person (Other) > Golf","desc":"<p>Putter Golf is a 3D miniature golf simulation. It features both a \"normal\" 9-hole course, with realistic courses, as well as a \"trick\" 9-hole course, with somewhat more unusual features, such as warp zones and conveyor belts. Rounding out the package is a mix mode, with randomly selected holes from both courses, and a practice mode that both allows you to practice hitting on various slopes, and try out the features from the trick mode.</p><p>You can compete both against the CPU, on multiple difficulty levels, and against up to three other players.</p>"},{"name":"Puyo Puyo 2","year":1996,"developer":"Compile"},{"name":"Puyo Puyo Box","year":2000,"developer":"Compile","url":"psx-chd-roms-p/Puyo%20Puyo%20Box%20%28Japan%29.chd","filesize":53747487,"score":"","genres":"Compilation > Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Falling block puzzle > Direct control","desc":"<p>A compilation package featuring the classic arcade puzzle games Puyo Puyo and Puyo Puyo 2 for the Playstation.</p><p>Gameplay involves stacking and ordering color-coded blobs or \"puyos\" as they fall into your play area and arranging them in groups of the same color to clear them off the screen before you get flooded with falling pieces a la Tetris. The twist in Puyo Puyo is that you must also select a character and then face-off against a series of opponents in vs matches in which every time you clear groups of puyos you send \"garbage\" puyos to your opponent (and vice versa) in hopes of stopping his advance and outlasting your opponent.</p><p>The compilation comes with both full games and several choices of gameplay modes, as well as also including a completely independent \"quest\" mode in which you play an rpg as series heroine Arle as she explores the world in search for 6 magical seals. You can equip items that enhance your stats and roam the game world in a top-down world map view, interacting with npcs and exploring dungeons, with all fights taking the form of Puyo Puyo duels.</p>"},{"name":"Puyo Puyo Sun","year":1997,"developer":"Compile","url":"psx-chd-roms-p/Puyo%20Puyo%20Sun%20-%20Ketteiban%20%28Japan%29%20%28Rerelease%29.chd","filesize":200062378,"score":8.2,"genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Arcade > Falling block puzzle > Direct control","desc":"<p><em>Puyo Puyo Sun</em> is the third entry in the main Puyo Puyo series of real-time puzzle games, its title being a pun involving the Japanese word for \"three\". The evil Dark Prince has caused the sun to augment its size and power to dangerous levels, and thus the Puyo Puyo world is on the verge of being scorched unless you prevent it.</p><p>The game features three distinct story campaigns, each pitting you against a different set of enemies which you must battle in classic Puyo Puyo fashion: In each stage you face off against an opponent in two different play areas, one for you and one for your opponent. As the blob-like \"puyos\" start falling in your play area, you must align them and create groups of the same color in order to clear the screen before you get flooded with puyos. Chaining puyos of different colors allows you to send several \"garbage\" puyos to the opposing player's play area in hopes of either flooding it, or slowing his advance, and whoever defeats the opposing player moves on to the next challenger.</p><p>New for <em>Puyo Puyo Sun</em> are the Sun Puyos, which can be added to combos for extra damage. Also includes 2P vs gameplay, challenge modes and galleries and other bonus features.</p>"},{"name":"Puyo Puyo~n","year":1999,"developer":"Compile"},{"name":"Puzzle Arena Toshinden","year":1997,"developer":"Electronics Application Co., Ltd.","url":"psx-chd-roms-p/Puzzle%20Arena%20Toushinden%20%28Japan%29.chd","filesize":176592666,"score":"","genres":"Puzzle > Anime / Manga > Real-time > Falling block puzzle > Fantasy","desc":"<p>Puzzle Arena Toshinden takes the furious fighters right out of the ring and into the world of puzzle games! The game plays out much like the Puyo Puyo series by Sega. Connect 3 balloons of the same color to make them disappear. Get combos to have black pieces fall on the opponent's side that are harder to get rid of.</p><p>You can play standard 1-on-1 games, knock out competition where you (and your opponent) each pick 4 characters to see who'll be the last man/woman standing.</p>"},{"name":"Puzzle Mania","year":1999,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-p/Puzzle%20Mania%20%28Japan%29%20%28Major%20Wave%29.chd","filesize":4279682,"score":"","genres":"Puzzle > Text-based / Spreadsheet > Fixed / flip-screen > Word construction","desc":"<p>Simple enough for anyone to learn, yet difficult to master. The thrill of solving each puzzle. This collection of puzzle games has all the necessary elements of a great puzzle -- and it's available now!</p>"},{"name":"Puzzle Mania 2","year":1999,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-p/Puzzle%20Mania%202%20%28Japan%29%20%28Major%20Wave%29.chd","filesize":2283383,"score":"","genres":"Puzzle > Text-based / Spreadsheet > Top-down > Fixed / flip-screen > Word construction","desc":"<p>Presenting the second game in the \"PUZZLE MANIA\" series! Like the previous game, it's basically a collection of puzzle games with simple rules. But one significant change is, in addition to the 3 puzzle types in the former game (Skeleton, Number Place, and Number Crossword), Logic Puzzles have been added! Logic Puzzles allow you to use horizontal and vertical numbers in the spaces as hints to fill in the background and complete a hidden picture. Be a puzzle maniac and master all 320 puzzles!</p>"},{"name":"Puzzle Star Sweep","year":1997,"developer":"Axela","url":"psx-chd-roms-p/Puzzle%20Star%20Sweep%20%28USA%29.chd","filesize":89484570,"score":"","genres":"Action > Puzzle > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p>In this vaguely Tetris-like game, players score points by eliminating \"star blocks.\"  A star block is a colored rectangle with a star on one end of it, and blocks are eliminated when the stars of two like-colored blocks touch each other.  While the game is being played, star blocks and obstacles rise from the bottom of the screen while the player moves and rotates a cursor which determines where additional star blocks will be thrown into play from off-screen.  The game features single-player and competitive play as well as a story mode featuring boss creatures and a bizarre plot -- apparently the whole game is actually a sport in which children poke a creature known as a star pig with sticks in order to make it vomit star blocks.</p>"},{"name":"Puzznic","year":2001,"developer":"Taito Corporation","url":"psx-chd-roms-p/Puzznic%20%28Europe%29.chd","filesize":115318459,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Tile matching puzzle > Point and select","desc":"<p>Fast-paced puzzle fun!<br>* Simple but addictive puzzle experience.<br>* Increased difficulty levels challenge players of all ages and skill levels.<br>* Puzznic takes minutes to learn and years to master.</p>"}]