[{"name":"Q*bert","year":1999,"developer":"Artech Studios Ltd.","url":"psx-chd-roms-q/Q-bert%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":146976818,"score":6,"genres":"Action > Diagonal-down > Fixed / flip-screen > Isometric > Arcade > Puzzle elements > Licensed","desc":"<p>The hip character from the 1980's returns in a new, 3D puzzle adventure. This time, you must help Q*bert save his friends, while solving all of the detailed 3D level that are part of 4 unique worlds, while avoiding the bad guys at the same time. And that's no easy task. Powerups litter the levels, while warp points can get you out of all those sticky situations.</p>"},{"name":"QIX Neo","year":2001,"developer":"Taito Corporation","url":"psx-chd-roms-q/Qix%20Neo%20%28USA%29.chd","filesize":31523489,"score":"","genres":"Action > Puzzle > Top-down > Fixed / flip-screen > Arcade","desc":"<p><em>QIX Neo</em> is a remake of Volfied, Taito's arcade game from 1989. The graphics and sounds were upgraded, but the basic gameplay remains the same, with the player controlling a tiny ship moving over a green contour line. The thin line is drawn over the edges of the screen, framing the game field. The ship acts as a cursor and has to be used to draw a square or rectangular extension into the field, thus removing it and slowly decreasing the size of the available space. Enemies roam each level, moving in random patterns around the screen but always following the movements of the cursor. The ship has a force-field shield around it, and only becomes vulnerable when drawing new lines.</p><p>The player has to quickly close the sections, timing it correctly to avoid collision with any of the foes or their projectiles. The enemies can be eliminated by connecting a section where they are standing, or by using one of the power-ups. The power-ups are stored inside boxes, that in some levels keep appearing and disappearing, and can be collected by removing a section with one of them inside. Most of the powers are temporary, giving lasers to destroy the smaller aliens, freezing the enemies for a few seconds, increasing the speed of the ship and helping in other ways. Each level is finished after removing at least 70% of the field, or if the large boss monster that shoots at random intervals is killed in some way. A port of the original game is also included, using the old assets but with a horizontal orientation.</p>"},{"name":"Quake II","year":1999,"developer":"id Software, Inc.","url":"psx-chd-roms-q/Quake%20II%20%28Europe%29.chd","filesize":207288312,"score":7.9,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>A sequel in name only, this follow up to id’s 1996 Quake, is a first-person shooter revolving around the Earth-Strogg war. The Strogg alien race threatens the Earth, but Earth has launched a counter-offensive, Operation Alien Overlord. Overlord takes the battle to the Strogg homeworld with the ultimate objective of securing their capital city and killing their ruler.</p><p>As a FPS, <em>Quake II</em> contains a variety of weapons including the fall back Blaster, the Railgun, and the secret BFG10K. Health, armor, and ammunition pick-ups can be found during levels, as can the classic <em>Quake</em>’s Quad Damage power-up. Game play involves mowing down alien opponents as the player progresses through levels, completing in-game objectives. <em>Quake II</em> also comes with multiplayer support for Deathmatches.</p>"},{"name":"Quantum Gate","year":1997,"developer":"Hyperbole Studios","url":"psx-chd-roms-q/Quantum%20Gate%20I%20-%20Akumu%20no%20Joshou%20%28Japan%29.chd","filesize":447019205,"score":5.7,"genres":"Action > Adventure > 1st-person > Shooter > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p><em>Quantum Gate</em> is an adventure game set on a distant planet, in which you are sent out to fight in a war with an alien race. Most of the game is played in a first person perspective, as you travel around your base and talk to other people. There are also fighting segments, done in FPS mode, in which you and your computer allies must battle alien soldiers.</p>"},{"name":"Quarantine","year":1996,"developer":"Imagexcel"},{"name":"Quest for Fame (Disc 1)","year":1997,"developer":"Virtual Music Entertainment, Inc","url":"psx-chd-roms-q/Quest%20for%20Fame%20-%20Be%20a%20Virtual%20Rock%20Legend%20%28Japan%29%20%28Disc%201%29.chd","filesize":413446080,"score":7.7,"genres":"Simulation > Board game > Music / rhythm","desc":"<p>As the game itself comes shipped with some kind of electronic plectron you can connect to your parallel-port (it's called the \"V-Pic\" in the game) it's your mission to become a virtual guitar-hero.</p><p>After a few training lessons in your private room to get used to the game's interface (at the bottom of the screen is some kind of rhythm indicator that's similar to karaoke-systems. There's a red bar constantly moving from the left to the right end of the screen while in the background is a \"rhythm-scale\" - When the bar is moving over a peak from that scale you got to use your plectron on e.g. your tennis-racket so that virtually a guitar-riff is generated. the better and more exactly you can match the predrawn rhythm scale the better your guitar playing will sound and the higher your score is to proceed to further levels of the game).</p><p>The ultimate goal of the game is to reach the final level. To finally start a virtual concert with Aerosmith in a crowded football-stadium.</p><p>Although the above description might sound a bit complicated the game soon catches even unmusical people's attention by its very own and unique gameplay.</p>"},{"name":"Quest for Fame (Disc 2)","year":1997,"developer":"Virtual Music Entertainment, Inc","url":"psx-chd-roms-q/Quest%20for%20Fame%20-%20Be%20a%20Virtual%20Rock%20Legend%20%28Japan%29%20%28Disc%202%29.chd","filesize":384673668,"score":7.7,"genres":"Simulation > Board game > Music / rhythm","desc":"<p>As the game itself comes shipped with some kind of electronic plectron you can connect to your parallel-port (it's called the \"V-Pic\" in the game) it's your mission to become a virtual guitar-hero.</p><p>After a few training lessons in your private room to get used to the game's interface (at the bottom of the screen is some kind of rhythm indicator that's similar to karaoke-systems. There's a red bar constantly moving from the left to the right end of the screen while in the background is a \"rhythm-scale\" - When the bar is moving over a peak from that scale you got to use your plectron on e.g. your tennis-racket so that virtually a guitar-riff is generated. the better and more exactly you can match the predrawn rhythm scale the better your guitar playing will sound and the higher your score is to proceed to further levels of the game).</p><p>The ultimate goal of the game is to reach the final level. To finally start a virtual concert with Aerosmith in a crowded football-stadium.</p><p>Although the above description might sound a bit complicated the game soon catches even unmusical people's attention by its very own and unique gameplay.</p>"},{"name":"Quiz Show (Disc 1)","year":2001,"developer":"Einstein Multimedia s.r.l","url":"psx-chd-roms-q/Quiz%20Show%20%28Italy%29%20%28Disc%201%29.chd","filesize":254982739,"score":"","genres":"Strategy > Game show / trivia / quiz > Licensed","desc":"<p>The game based on the Italian TV game show of the same name. Players on the PC or PlayStation play against the show's host Amadeus to win up to 512 million virtual Lira. Features audio and video clips of hosts Amadeus and Donna Fortuna and additionally contains a backstage area with views of the hosts dressing rooms and clips from the real TV show.</p>"},{"name":"Quiz Show (Disc 2)","year":2001,"developer":"Einstein Multimedia s.r.l","url":"psx-chd-roms-q/Quiz%20Show%20%28Italy%29%20%28Disc%202%29.chd","filesize":367620936,"score":"","genres":"Strategy > Game show / trivia / quiz > Licensed","desc":"<p>The game based on the Italian TV game show of the same name. Players on the PC or PlayStation play against the show's host Amadeus to win up to 512 million virtual Lira. Features audio and video clips of hosts Amadeus and Donna Fortuna and additionally contains a backstage area with views of the hosts dressing rooms and clips from the real TV show.</p>"}]