[{"name":"R-Type Delta","year":1998,"developer":"Irem Software Engineering, Inc.","url":"psx-chd-roms-r/R-Type%20Delta%20%28Europe%29.chd","filesize":220943349,"score":7.8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The Bydo Empire has returned to Earth with a vengeance. This time, they will not accept defeat so easily. Earth however, is ready for them...</p><p>Three R-Class ships: the R-9, the R-13, and the prototype R-X, are your weapons in this war. Choose your ship according to your liking, blast off, and strike the Bydo Empire!</p><p><em>R-Type Delta</em> is the first 2D/3D R-Type game (à la Einhänder and Thunder Force V).</p>"},{"name":"R-Types","year":1998,"developer":"Racjin Co., Ltd.","url":"psx-chd-roms-r/R-Types%20%28Europe%29.chd","filesize":247039520,"score":7,"genres":"Action > Compilation > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p><em>R-Types</em> is a compilation of R-Type and R-Type II ported pixel-for-pixel from the coin-op to the PlayStation.</p><p>A couple of handy features have been added to lower the original difficulty level. First, your progress through the game is saved at the start of each level, so you don't have to start from scratch every time. Second, you now have unlimited continues.</p><p><em>R-Types</em> also contains a small library section which describes some of the story behind the R-Type universe, and lets you browse some of the in-game graphics. Other bonuses include an FMV intro movie and ending movies.</p>"},{"name":"R/C Stunt Copter","year":1999,"developer":"Shiny Entertainment, Inc.","url":"psx-chd-roms-r/R-C%20Stunt%20Copter%20%28Europe%29.chd","filesize":266786386,"score":7,"genres":"Simulation > 3rd-person (Other) > Behind view > Cinematic camera > Real-time > Tricks / stunts > Direct control > Helicopter > Vehicle simulator > Vehicular combat","desc":"<p><em>R/C Stunt Copter</em> is described by developer Shiny as more of a \"software toy\" than a video game. It's a Radio Controlled model flight simulation that fully utilizes the PlayStation analog controller. The player view is selectable as either stationary (as with a real R/C helicopter), walking or flying behind the helicopter.  </p><p>You can do training, stunts, complete mission objectives, multiplayer head-to-head, or free flight, using one of five different models of tiny helicopters in 3rd person view.  </p><p>The game starts a new player with an obligatory training section to teach you how the helicopter flies, in which you use a helicopter with a frame attached to prevent crashes and with limited maneuverability - no looping/rolls. Using this beginner model you are graded and may qualify for flying other more capable models than the trainer. Only after completing the training, you can fly stunts or do missions. Stunts include for example shooting at targets, flying through hoops, doing rolls and loops, and flying inverted.  </p><p>In the two-player competition mode you can shoot at your opponent's helicopter, and cause it to crash.  </p><p>All your flights are graded and also commented upon by an instructor, who will either over-enthusiastically applaud your success or sarcastically ridicule you for the often spectacular failures.  </p>"},{"name":"R4: Ridge Racer Type 4","year":1998,"developer":"Namco Limited","url":"psx-chd-roms-r/R4%20-%20Ridge%20Racer%20Type%204%20%28USA%29.chd","filesize":357680101,"score":8.3,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>Developed exclusively for the Sony Playstation, this fourth title in the <em>Ridge Racer</em> series features new visuals, powered by goraud-shaded polygons, giving each car and track a more refined appearance, while keeping the same arcade gameplay popularized by the first game of the series.</p><p>While it includes the usual time attack and a new split-screen versus mode, the focus of the game is the <em>Real Racing Roots '99</em>, Ridge City's three heat, seven race championship, with the grand finale in a speedway during New Year's Eve.</p><p>The player starts by choosing one of the four teams available (from easiest to harder): <em>Micro Mouse Mappy</em>, directed by the lovely Sophie Chevalier who hopes to win the first title in many years for the French team to honour her ill grandfather, <em>Pac Racing Team</em>, a recently created Japanese team directed by Shinji Yazaki who expects to create an immediate splash in the Ridge City racing scene, from Italy the RRR champions <em>Racing Team Solvalou</em>, with the demanding Enki Gilbert at the helm, and the American team <em>Dig Racing Team</em>, who has fallen into financial difficulties, with team director Robert Chrisman struggling to provide the driver with a car capable of out-handling opponents.</p><p>After picking a team, the player can choose one of the four car makers available: <em>Lizard</em> and <em>Assoluto</em> keep the old RR tradition of cars drifting wildly on corners, but <em>Age Solo</em> and <em>Terrazi</em> offer a new experience with their \"Grip\" cars that require more breaking and careful trajectories, but are easier to control during turns.</p><p>The player earns (and so, unlocks for free play) cars by completing races; however, final placement defines how good the car will be. By scraping through the first two heats (the Final GP accepts nothing but a victory), sponsors will be unwilling to invest in the team and instead of a new car, the mechanics will only upgrade the current vehicle. But winning all races allows the driver to reach the <em>Shooting Hoops</em> speedway with the fastest car. By combining all qualifying placements, 320 cars are waiting to be unlocked.</p><p><em>R4 Ridge Racer Type 4</em> also includes an extra disk, featuring the original Ridge Racer in higher resolution. For a time, the game was also sold as a bundle along Namco's innovative Jogcon controller.</p>"},{"name":"Race Drivin' a Go! Go!","year":1996,"developer":"K.K. Time Warner Interactive","url":"psx-chd-roms-r/Race%20Drivin%27%20a%20Go%21%20Go%21%20%28Japan%29%20%28Rev%201%29.chd","filesize":310464085,"score":"","genres":"Racing / Driving > 1st-person > Arcade > Tricks / stunts > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Race Drivin'</em> is an updated remake of the 1990 coin-op racing game of the same title. It features the original <em>Hard Drivin'</em> course, the courses added in the original <em>Race Drivin'</em>, and three brand new courses only found in this new version. The number of available vehicles has also increased from 3 to 8. The game includes both a single-player championship mode and an arcade time attack mode.</p>"},{"name":"Racing","year":1999,"developer":"Tamsoft Corporation","url":"psx-chd-roms-r/Racing%20%28USA%29%20%28En%2CFr%2CEs%29.chd","filesize":69796689,"score":"","genres":"Action > Racing / Driving > Sports > 1st-person > Behind view","desc":"<p><em>Racing</em> as the title suggests is a simple racing game. It features both a short and a long distance race course, a mirrored version of the long course, plus different skill levels. Before a race begins, players select a car (out of 6 total), and then set whether they want automatic or manual transmission, and whether they want a drift or grip setting. </p><p>Races have the player racing against 3 opponent racers. Players try to attain the fastest lap times and the fastest total race time while trying to defeat their opponents. The players fastest times can then be saved.</p><p>The game also contains a brief tutorial that explains the controls and some techniques of racing.</p>"},{"name":"Racing Lagoon","year":1999,"developer":"Square Co., Ltd.","url":"psx-chd-roms-r/Racing%20Lagoon%20%28Japan%2C%20Asia%29.chd","filesize":478836679,"score":"","genres":"Racing / Driving > Role-playing (RPG) > 3rd-person (Other)","desc":"<p><em>Racing Lagoon</em> is a racing RPG. Your earn experience for your various car parts and racing points by challenging other cars on streets modeled after the actual roadmaps of Yokohama, Japan. After winning a race, you'll get a certain amount of \"Reward Points\" which you can then use to take a part from your opponent's car, anything from the engine to the paint scheme. The game is broken up into 10 nights of racing, with main character Sho Akasaki trying to become the king of the underground racing scene.</p>"},{"name":"Radikal Bikers","year":1999,"developer":"Gaelco, S.A.","url":"psx-chd-roms-r/Radikal%20Bikers%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":87904953,"score":6.1,"genres":"Racing / Driving > Behind view > Arcade > Motorcycle > Street racing > Vehicle simulator","desc":"<p><em>Radikal Bikers</em> is a game set in a Mediterranean environment in which players show off their motorbike skills while delivering pizzas.</p><p>The game places two players in direct, head-to-head competition to deliver pizzas as fast as possible.</p>"},{"name":"Rage Racer","year":1996,"developer":"Namco Limited","url":"psx-chd-roms-r/Rage%20Racer%20%28Europe%29.chd","filesize":493315160,"score":8.2,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>The third Ridge Racer game again features three tracks, with each of the courses beginning with the same starting line to emerge into a completely distinctive course. Each of the courses take you through a multitude of ancient landmarks, cities, natural wonders such as light houses, tunnels, waterfalls, ruins, European styled villages etc. The graphics however have transformed from bubble gum like unrealistic environments, to drab and very realistic racing courses. On top of the three available tracks available from the onset, another bonus track is earnable as are all courses in reverse.</p>"},{"name":"Rageball","year":2002,"developer":"Na.p.s. Team s.n.c.","url":"psx-chd-roms-r/Rageball%20%28Europe%29.chd","filesize":34102670,"score":"","genres":"Action > Sports > 3rd-person (Other) > Fighting > Managerial / business simulation > Sci-fi / futuristic","desc":"<p>The futuristic sport of Rageball, inspired by Speedball 2, is fast, violent and deadly, and played by teams of exiled convicts who have nothing to lose. The year is 2612 and sports hit an all-time low. Therefore, prisoners are sent to the planet IS-326, nicknamed \"The Hell\", where they are forced to compete in a violent sport with no rules.</p><p>In the single player mode, you take on the role of the manager of an up-and-coming Rageball squad, as you coach the players to victory, with strategical decisions and tactics. Up to four competitors can battle against each other through multitap.</p>"},{"name":"Raiden","year":2002,"developer":"Seibu Kaihatsu Inc."},{"name":"Raiden DX","year":1997,"developer":"Seibu Kaihatsu Inc.","url":"psx-chd-roms-r/Raiden%20DX%20%28Japan%29.chd","filesize":64769711,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter","desc":"<p><em>Raiden DX</em> is an arcade shoot'em up. The game features similar vertically scrolling shooter gameplay as in its predecessors Raiden and Raiden II. The player controls a jet fighter and blasts his way through various stages which are divided into levels.</p><p>When destroying buildings and enemies the player can collect power-ups to gain better weapons, bombs, missiles and score extra points. There are three stages, Practice, Novice and Expert. Practice features one level only. Novice features 5 levels and Expert features 8 levels, including remixed versions of the Novice and Practice levels. At the end of each level the player has to defeat a level boss.</p>"},{"name":"Raiden Project, The","year":1995,"developer":"Seibu Kaihatsu Inc.","url":"psx-chd-roms-r/Raiden%20Project%2C%20The%20%28Europe%29.chd","filesize":16338089,"score":7.6,"genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p><em>The Raiden Project</em> contains two games:</p><ul><li>Raiden</li><li>Raiden II</li></ul><p>This release features difficulty settings, credit limits, remixed music, on-screen text positioning and the ability to save high scores with a memory card.</p>"},{"name":"Railroad Tycoon II","year":1999,"developer":"PopTop Software Inc.","url":"psx-chd-roms-r/Railroad%20Tycoon%20II%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":293398061,"score":7.8,"genres":"Simulation > Strategy > Diagonal-down > Free-roaming camera > Isometric > Real-time > Managerial / business simulation > Train","desc":"<p>Establish yourself as a mogul to be reckoned with as you work your way up the ranks of the railway industry in this strategy game. Expand your domain across continents and a changing global marketplace.</p><p>Build the Transcontinental Railway or the Orient Express. Run Steam train through the jungles of Africa, or electric trains through the Swiss Alps. Run your competitors out of town on a rail.</p><p>An 18 scenario campaign lets you re-create history's greatest railroading feats and failures.</p><p>Your wealth can be built up with a sophisticated stock market with margin buying, short selling, and hostile takeovers.</p>"},{"name":"Raku Jongg","year":2000,"developer":"Enterbrain, Inc."},{"name":"Rakugaki Showtime","year":1999,"developer":"Treasure Co., Ltd.","url":"psx-chd-roms-r/Rakugaki%20Showtime%20%28Japan%29.chd","filesize":342329872,"score":"","genres":"Action > Side view > Fighting","desc":"<p>Somewhere out there, there lies an imaginary game world called Rakugaki. Many characters inhabit this strange land, like the hero team of Yukiwo, Sasami, Pitan, and Tsubohachi, and an army of enemies led by the infamous Daddy who wants to see them dead. They are all controlled by Rakugaki's creator, the mysterious God Hand, and follow their predetermined fates. Today, the final battle is beginning - but Rakugaki's characters don't want to go just yet! Can they escape the grasp of God Hand and take back their lives?</p><p><em>Rakugaki Showtime</em> is a fighting game in which the player, a character rendered as a pencil drawing, fights through a series of 3D arenas in order to defeat God Hand and restore happiness to Rakugaki. Enemies are attacked by the throwing of missiles, rocks, grenades, land mines, black holes, or smiley balls. In addition, players have a series of moves that they can also use to attack, and a series of Super Smiley Attacks, which are activated by grabbing Smiley Balls that have been completely charged up with attacks. Each of the characters have various strengths and weaknesses that can either help - or hinder - the player.</p><p>The player begins the game with four characters to choose from, but can unlock other characters each time they defeat God Hand. There are a maximum of 16 characters for players to unlock. In addition, a training mode is available, allowing players to practice their moves. Up to four players can also compete in a Versus battle for bragging rights.</p>"},{"name":"Rally Cross","year":1997,"developer":"Sony Interactive Studios America","url":"psx-chd-roms-r/Rally%20Cross%20%28Europe%29.chd","filesize":350634523,"score":7.5,"genres":"Racing / Driving > Sports > Off-roading","desc":"<p>A chaotic, and bouncy rally racing game.  One of the aspects of this game that set it aside from other games at this time was the variety of the terrain.  Not only is it off-road, but the course is filled with jumps, dips, hairpins, and off camber turns.   Consequently, it is very common for the car to flip upside down.  By pressing the shoulder buttons, the player can rock the car left or right.  To get back on the tires, the user must time the rocking of the car to flip it back upright.  </p><p>Any of the course can be raced forwards or backwards, and there is a season mode as well as the single race mode.  In order to increase the chaos, there is a suicide-mode where you race the course in the opposite direction of the other cars.  Up to 4 players can play the game in split screen mode.  Tracks include a tight Stadium course, an abandoned mine, jungle, and desert.  </p><p>One trick to increase performance is that the buttons that rock the car upright, can also be used to prevent flipping in tight corners. Mud, dirt, snow, and water are kicked up behind the car to add some graphical flair.  The cars in the game are not licensed vehicles.</p>"},{"name":"Rally Cross 2","year":1998,"developer":"Idol Minds, LLC","url":"psx-chd-roms-r/Rally%20Cross%202%20%28Europe%29.chd","filesize":387255362,"score":6.9,"genres":"Racing / Driving > Sports > Off-roading","desc":"<p>The sequel to the chaotic off-road rally racing game, Rally Cross. The lead programmer, Mark Lyons, and the lead artist, Scott Atkins, from Rally Cross had left Sony and formed a new company, Idol Minds. <em>Rally Cross 2</em> was one of the first two games developed by Idol Minds. It was an attempt to build on the original, while creating a game with a simpler learning curve. </p><p><em>Rally Cross 2</em> retains the rough terrain of the original, with even more jumps and crashes. Multi-tap and 4 player split screen were not included in the sequel, but 2 player split screen remained. The ability to control attributes such as suspension, tires, and steering was added, as well as the ability to paint your car with a primary and detail color that can be picked from a large palette.</p><p>Once again the courses can be raced forwards or backwards, and in suicide mode (cars racing in opposite directions at the same time). The multi-race season mode still exists. One of the biggest additions is the track editor. There are a dozen or so different pieces that can be rotated and dropped into a 2D grid to create completely new tracks. </p><p>The cars are still flipped upright with the shoulder buttons, but it now requires only a single button press instead of the multiple rocking motions in the original. Handling has changed significantly since cars tend to fishtail around the corners instead of flip, but high speed crashes will still result in an upside down car.</p>"},{"name":"Rally de Africa","year":1998,"developer":"Prism Arts","url":"psx-chd-roms-r/Rally%20de%20Africa%20%28Japan%29.chd","filesize":113250370,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Off-roading > Track racing > Africa","desc":"<p><em>Rally de Africa</em> is an arcade rally racing game which plays similarly to Sega Rally Championship. The game features four game modes: Championship, where the player plays through a series of races; Spot Entry, where the player can play a singe race; 2 Player Battle, where two players can race against each other; and Memory Battle, where the player can race against the replay of another player which is stored on the memory card. In each race you begin in the twelfth position behind eleven computer opponents, the goal is to pass all the opponents to get into the first place position before you reach the end of the stage. The game features a total of five different stages set across the continent of Africa and a selection of unlicensed vehicles to race with.</p>"},{"name":"Rally de Europe","year":2000,"developer":"Prism Arts","url":"psx-chd-roms-r/Rally%20de%20Europe%20%28Japan%29.chd","filesize":142984686,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Off-roading > Track racing > Europe","desc":"<p><em>Rally de Europe</em> is an arcade rally racing game and sequel to Prism Arts' previous game Rally de Africa. The game features four game modes: Championship, where the player plays through a series of races; Spot Entry, where the player can play a singe race; 2 Player Battle, where two players can race against each other; and Memory Battle, where the player can race against the replay of another player which is stored on the memory card. In each race you begin in the tenth position behind nine computer opponents, the goal is to pass all the opponents to get into the first place position before you reach the end of the stage. The game features a total of five different stages set across the continent of Europe and a selection of unlicensed vehicles to race with.</p>"},{"name":"Rama","year":1998,"developer":"Dynamix, Inc."},{"name":"Rampage 2: Universal Tour","year":1998,"developer":"Digital Eclipse Software, Inc.","url":"psx-chd-roms-r/Rampage%202%20-%20Universal%20Tour%20%28Europe%29.chd","filesize":235764302,"score":5.4,"genres":"Action > Side view > 2D scrolling > Arcade","desc":"<p>While technology may improve graphics and sound, some things never change. <em>Rampage 2: Universal Tour</em> is very much in tune with its history, barely deviating from the original city-stomping arcade game appearing in the 1980s. Like its predecessor, Rampage World Tour, <em>Rampage 2</em> retains the original 2D worlds, but improves the graphics, completely re-rendering the characters. The premise remains the same: stomp out cities and wreck things in general. Some new features in <em>Rampage 2</em> include four new characters (in addition to the original three), new attacks and combos, a power meter, and bonus rounds. Up to three people can play at once and there are plenty of new cities to destroy.</p>"},{"name":"Rampage Through Time","year":2000,"developer":"Avalanche Software LLC","url":"psx-chd-roms-r/Rampage%20-%20Through%20Time%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":279142467,"score":4.8,"genres":"Action > Side view > Arcade > Fighting > Sci-fi / futuristic","desc":"<p>Rampage was a simple arcade game. There were three monsters and one goal: Smash stuff. <em>Rampage Through Time</em>, the fourth installment, is played in a similar fashion to the previous games with a few new features. </p><p>As the title implies, <em>Rampage Through Time</em> adds a time-travel element. Your oversized mutants travel to time periods such as the Old West and Medieval times, as well as other, more general historical periods, like \"war zone,\" \"alien,\" and \"gangster.\"</p>"},{"name":"Rampage World Tour","year":1997,"developer":"Game Refuge Inc.","url":"psx-chd-roms-r/Rampage%20-%20World%20Tour%20%28Europe%29.chd","filesize":143378451,"score":5.9,"genres":"Action > Side view > 2D scrolling > Arcade","desc":"<p><em>Rampage World Tour</em> is an updated version of the classic Rampage. Rampage World Tour starts off at Scumlabs International where three lab technicians, George, Lizzy, and Ralph have mutated in an accident involving toxic waste. George has turned into a gigantic ape, Lizzy a gigantic lizard or dinosaur, and Ralph some sort of gigantic wolf. The three destroy the lab they previously worked at and then embark on a path of destruction encompassing the entire globe.</p><p>The player chooses one of these three characters and begins destroying buildings, eating civilians, knocking planes out of the sky, and stepping on tanks. The ultimate goal of the game is to rid the world of Scumlabs by traveling to the cities where they are located. Being creatures of such massive size, there are many cities that must be destroyed along the way. Scumlabs and the various militaries make it a priority to destroy you and optionally another player that can play simultaneously.</p><p>The graphics are worth noting as they are of a unique, colorful \"cartoon\" flavor. Gameplay includes players climbing buildings while punching, kicking, and eating their inhabitants to destroy them. Once all the buildings for a particular stage have been destroyed, the stage is clear and players proceed to the next stage. Players can get many different kinds of power-ups that make them more powerful or restore health.</p>"},{"name":"Ranma 1/2: Battle Renaissance","year":1996,"developer":"Atelier Double Co. Ltd.","url":"psx-chd-roms-r/Ranma%201-2%20-%20Battle%20Renaissance%20%28Japan%29.chd","filesize":261682771,"score":"","genres":"Action > Anime / Manga > Fighting > Martial arts","desc":"<p><em>Ranma 1/2: Battle Renaissance</em> is a 3D fighting game. There is a Story Mode, a Battle Mode, and a VS Mode. The changing weather causes the cursed characters to change into their cursed forms when they get soaked in cold water, and back to their normal forms when they get soaked in hot water, affecting the players' fighting strategy. Throughout the game there will be rain squalls and geysers causing players and opponents to transform back and forth. This is the only Ranma 1/2 fighting game in which Ryu Kumon and Rouge appear.</p>"},{"name":"Rapid Angel","year":1998,"developer":"Techno Soleil Corporation"},{"name":"Rapid Reload","year":1995,"developer":"Media.Vision Entertainment Inc.","url":"psx-chd-roms-r/Rapid%20Reload%20%28Europe%29.chd","filesize":198382203,"score":7.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The object of interest in this game is the mysterious Valkiry Stone. Two treasure hunters, Axel and Ruka, set out to find the stone, but the evil gang known as the Pumpkin Heads wants to find the stone first.</p><p>As either Axel or Ruka, blast your way through six side-scrolling levels against hordes of enemies, facing off against several bosses in each level. You can select from four different weapon effects (normal, bouncing, homing and flamethrower), use smartbombs and a grappling hook.</p>"},{"name":"Rascal","year":1998,"developer":"Traveller's Tales (UK) Ltd.","url":"psx-chd-roms-r/Rascal%20%28Europe%29.chd","filesize":187167493,"score":6,"genres":"Action > 3rd-person (Other) > Platform > Direct control","desc":"<p>In <em>Rascal</em> you must rescue your kidnapped father, a professor, from the clutches of the evil Chronon. Chronon is using Rascal's father to perfect time travel for his evil plans and it's up to you to stop him. You are armed with a bubble-blowing gun to take on Chronon minions as you travel through time. There are six worlds to explore which include a medieval castle, the Wild West, Atlantis, a pirate ship, prehistoric times and the Time Dimension. Each world has three time zones covering the past, the present and the future. In each of those levels you assemble an hourglass of six pieces, which teleports you back home.</p>"},{"name":"Rascal Racers","year":2004,"developer":"Miracle Designs","url":"psx-chd-roms-r/Rascal%20Racers%20%28Europe%29.chd","filesize":43811666,"score":"","genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing","desc":"<p>In Rascal Racers, you choose from one of ten different characters to try to win one of three available race kart tournaments. You have several weapons to choose from, including missiles, mines, turbo boosts and shields.</p><p>The game also features unlockable characters as you progress through the stages and levels. Also included are an Arcade mode (play through any race level you've already unlocked), and Time Trial mode (try to beat your own race records!)</p>"},{"name":"Rat Attack!","year":1999,"developer":"Pure Entertainment Games Plc","url":"psx-chd-roms-r/Rat%20Attack%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":289775368,"score":5.9,"genres":"Action > Top-down > Puzzle elements","desc":"<p>Play as one of the Scratch Cats, an elite superhero team, who are out to save the world from Washington and Jefferson, two evil mutant space rats who wish to enslave the world in rats.</p><p>Explore each puzzle level and wipe out the rat threat. First you need to catch the rat, using the Eraticator. Then you must find the Destructor pad in each level in order for the rat to be taken out. Each level has a quota of rats you must remove, and if you fail to do so within the time limit (which, in this case, is when the rats destroy everything in the level), you lose.</p>"},{"name":"Raven Project, The (Disc 1)","year":1996,"developer":"Cryo Interactive Entertainment","url":"psx-chd-roms-r/Raven%20Project%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%29%20%28Disc%201%29.chd","filesize":388368861,"score":5.8,"genres":"Action > 1st-person > Video backdrop > Shooter > Sci-fi / futuristic","desc":"<p>Sci-fi shooter with gameplay similar to the Rebel Assault series. Divided into missions, you get to play in ship-to-ship combat, mechanised warrior battles, surface-planetary warfare and tail-gunning, according to the developers. The game also features a complex story with live-action video sequences.</p>"},{"name":"Raven Project, The (Disc 2)","year":1996,"developer":"Cryo Interactive Entertainment","url":"psx-chd-roms-r/Raven%20Project%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%29%20%28Disc%202%29.chd","filesize":453852153,"score":5.8,"genres":"Action > 1st-person > Video backdrop > Shooter > Sci-fi / futuristic","desc":"<p>Sci-fi shooter with gameplay similar to the Rebel Assault series. Divided into missions, you get to play in ship-to-ship combat, mechanised warrior battles, surface-planetary warfare and tail-gunning, according to the developers. The game also features a complex story with live-action video sequences.</p>"},{"name":"Ray Tracers","year":1997,"developer":"Taito Corporation","url":"psx-chd-roms-r/Ray%20Tracers%20%28Europe%29.chd","filesize":340219823,"score":6.9,"genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Automobile","desc":"<p><em>Ray Tracers</em> is an arcade racing game where you have crash into others cars to destroy them. It is a spiritual successor to Chase H.Q. with some differences like a nitro boost system, four cars to choose from and more variety in end bosses.</p><p>You can choose Chase or Time Attack mode. Chase is arcade mode, where you have to go through several missions, ram into other traffic for extra points and fight end bosses. The bosses include high speed dual tanks, a helicopter and other military vehicles. In Time Attack mode you try to set the best lap time on one of four selectable courses, with or without a computer controlled rival.</p><p>You can choose from 4 cars, Spanker (no joke), Buffalo, Lynx, Hawk. Each of the cars vary in attack power, top speed, acceleration and steering agility.</p>"},{"name":"RayCrisis: Series Termination","year":2000,"developer":"Taito Corporation","url":"psx-chd-roms-r/RayCrisis%20%28Europe%29.chd","filesize":295252358,"score":6.8,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>RayCrisis is the third part of a series of \"Ray\" shooting games. In the story it is considered a prequel to the first game's plot, RayForce. It is the only game without a two-player mode in the ported PlayStation version, even though the arcade does have 2 player mode.</p><p>You have 2 weapons at you disposal, a vulcan gun and a lock-on missile attack. You can also do special attacks if you use the lock-on system to the max. The graphics are all in 3D, but the gameplay mechanics are in 2D.</p><p>The players ship is a Waverider computer virus, which must get inside the Con-Human supercomputer's system. All enemies you encounter are antibodies, programmed to terminate any virus.</p><p>Following this virus-infiltrate-in-body theme, the levels are called Self-Area, Emotion, Consciousness, Intelligence, Memory, and Consideration, each reflecting Con-Human's details of sentience. Finally the player must fight against the Dis-Human Antibody, and Infinity, Con-Human's heart.</p>"},{"name":"Rayman","year":1995,"developer":"Ubi Soft Paris Studios","url":"psx-chd-roms-r/Rayman%20%28Europe%29%20%28En%2CFr%2CDe%29%20%28EDC%29.chd","filesize":383301768,"score":7.9,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>When a villain known only as Mr. Dark appears, trouble brews in Rayman's world. Mr. Dark captures the Toons - source of light and Rayman's friends. With no more light, evil creatures begin to roam, making the world unsafe for everyone. It’s up to you, as Rayman, to free your friends and put an end to Mr. Dark's dastardly schemes!</p><p><em>Rayman</em> is a side-scrolling platformer starring the titular Rayman, a big-nosed chap with no arms or legs. Rayman can jump and use his hair to hover for a short period of time. He can also attack by throwing his fists, or winding up his fists for a more powerful punch. He can occasionally find special power ups that grant him unlimited flying power, giving him the ability to navigate through tricky mazes.</p>"},{"name":"Rayman 2: The Great Escape","year":2000,"developer":"Ubisoft Entertainment SA","url":"psx-chd-roms-r/Rayman%202%20-%20The%20Great%20Escape%20%28Europe%29%20%28En%2CEs%2CIt%29.chd","filesize":400208837,"score":8,"genres":"Action > Behind view > Platform > Direct control > Fantasy","desc":"<p>Admiral Razorbeard and his gang of robot pirates have enslaved all the creatures in Rayman's world, including the peaceful Teensies and the Lums, which give life to the earth. Rayman has been captured by the pirates as well and is lamenting his troubles in his prison cell when he meets his good friend, Globox. Globox has smuggled in a silver Lum, given to him by the great fairy, Ly. With the power of the silver Lum, Rayman is able to once more shoot his fists. With his power restored, the pair escape the flying prison ship and embark on another adventure to save the entire world!</p><p><em>Rayman 2: The Great Escape</em> is the sequel to Rayman, a 2D side-scrolling platform game. Unlike the previous game, <em>Rayman 2</em> is entirely in free-roaming 3D environments, similar to Super Mario 64. Rayman has many unique abilities that can help him get around the world. In addition to being able to shoot his fists, he can use his hair to hover like a helicopter, and even glide on air currents in certain places. He can climb certain walls and ceilings and can even use his fists to swing from special purple Lums which are shaped like rings. Rayman also has many unique items at his disposal, such as powder kegs which can be carried or fly like jets, strange warheads with legs that he can ride and steer like bucking mules, and gigantic plums that can be thrown into the water to create new paths.</p><p>Rayman's goal is to find the four masks of the world, which allow the owner to reawaken Polokus, the spirit of the world. These masks are scattered far and wide, and are well hidden and guarded, so it is not an easy task. By gathering the yellow Lums, Rayman will gain access to new worlds, which will take him to the locations of new masks. Collecting yellow Lums also rewards him with new powers and life meter extensions.</p><p>The Nintendo 64 and Windows platforms are the original versions of the game. The Nintendo DS version sticks closest to this version.</p><p>The Dreamcast version adds a new area to the original version called Globox Village which contains exclusive mini-games. The mini-games are unlocked by collecting six hidden Globox crystals. Also, other changes include The Hall of Doors being changed into a new place called The Isle of Doors and more Robo-Pirates to contend with, including a new type not seen in the original version. The iOS and Nintendo 3DS versions are based on this version but don't include the Globox Village section. However, the 3DS version features a dynamic difficulty curve, with the game getting easier if too many lums are missed.</p><p>The PlayStation version features a heavy alteration of the levels with some being merged and some being removed altogether, although there are also some new areas as well. This includes a new unlockable bonus area that was from the originally planned 2D version of the game that was scrapped. The amount of collectible Lums was reduced from 1,000 to 800. In this version characters are also voiced with actual real languages instead of the whisper speak of the other versions. </p><p>The PlayStation 2 version adds minigames, exclusive items like the Lumz Radar, and offers more abilities for Rayman to purchase and use.Along with some expanded level revisions with lums being placed in different locations, there are three new bosses to contend with. The Hall of Doors has become hub locations, The Minisaurus Plain, Globox's House, and The Rainbow Creek. Bonus challenges can also be played by freeing caged Familiar Spirits. These prisoners are exclusive to this version of the game. The game also gives the option to use either the real language voice-overs or the older version's style and lets players save mid-level.</p>"},{"name":"Rayman Junior: Level 1","year":2000,"developer":"Aqua Pacific Ltd.","url":"psx-chd-roms-r/Rayman%20Junior%20-%20Level%201%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":278760554,"score":"","genres":"Platformer  > Educational","desc":"<p>Leap & learn with Rayman!<br>Read, count and spell your way through 60 action-packed levels in 6 amazing worlds. Run, jump and discover with educational exercises on your quest to rescue the Magic Book of Knowledge from the evil Mr. Dark. Learning has never been so much fun!</p>"},{"name":"Rayman Junior: Level 2","year":2000,"developer":"Aqua Pacific Ltd.","url":"psx-chd-roms-r/Rayman%20Junior%20-%20Level%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":279167377,"score":"","genres":"Action > Educational > Side view > 2D scrolling > Platform > Direct control > Math / logic > Reading / writing","desc":"<p>RAYMAN junior: Level 2<br>The RAYMAN Revision Action Game, adapted from the legendary RAYMAN platform game, uses an original educational approach based on game playing. To get on in this action game, you have to answer questions drawn from the school curriculum. This DISC has been developed with teachers and tested by pupils.<br><br>BECOME UNBEATABLE IN MATHS AND READING! In line with the current curriculum<br><br>* 600 questions<br>* 60 game stages to go through<br>* 12 maths and reading activities</p>"},{"name":"Rayman Junior: Level 3","year":2000,"developer":"Aqua Pacific Ltd.","url":"psx-chd-roms-r/Rayman%20Junior%20-%20Level%203%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.chd","filesize":255678829,"score":"","genres":"Action > Educational > Side view > 2D scrolling > Platform > Direct control > Math / logic > Reading / writing","desc":"<p>RAYMAN junior: Level 3<br>The RAYMAN Revision Action Game, adapted from the legendary RAYMAN platform game, uses an original educational approach based on game playing. To get on in this action game, you have to answer questions drawn from the school curriculum. This DISC has been developed with teachers and tested by pupils.<br><br>BECOME UNBEATABLE IN MATHS AND READING! In line with the current curriculum<br><br>* 600 questions<br>* 60 game stages to go through<br>* 12 maths and reading activities</p>"},{"name":"Rayman Rush","year":2002,"developer":"Shanghai UBIsoft Computer Software Co., Ltd.","url":"psx-chd-roms-r/Rayman%20Rush%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":279571320,"score":6.6,"genres":"Action > Racing / Driving > Behind view > Fighting > Platform","desc":"<p>Featuring the cast of characters from the 3D platform title, Rayman 2: The Great Escape, <em>Rayman Rush</em> is a racing game where two contestants battle it out to the finish line in five game modes across 12 different race tracks. The game is based on the racing portion of Rayman Arena, but only features two-player multiplayer instead of four.</p>"},{"name":"RayStorm","year":1997,"developer":"Taito Corporation","url":"psx-chd-roms-r/RayStorm%20%28Europe%29.chd","filesize":398428111,"score":7.3,"genres":"Action > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>RayStorm</em> is a shoot'em-up game created for the arcades, later ported to the Playstation and Saturn home consoles. Although there is no story connection, it is often thought of as the spiritual successor to RayForce, which had similar gameplay.</p><p>You have 2 weapons at you disposal, a vulcan gun and a lock-on missile attack. You can also do 2 special attacks by using the lock-on system in a special way. The graphics are all in 3D, but the gameplay mechanics are in 2D. There are 7 stages, each ending with a giant end boss.</p>"},{"name":"Razor Freestyle Scooter","year":2000,"developer":"Shaba Games LLC","url":"psx-chd-roms-r/Razor%20Freestyle%20Scooter%20%28USA%29.chd","filesize":388394980,"score":6,"genres":"Action > Behind view > Tricks / stunts > Licensed","desc":"<p><em>Razor Freestyle Scooter</em> is an extreme-sports style action game modeled around small, nimble scooters. In contrast to most games of this type, there is a story. A crazed giant robot has kidnapped your skating buddies. By completing skating challenges at the robot's sky fortress, you must rescue your friends.</p><p>You skate around 3 large areas and attempt to perform wild tricks, collect scooter wheels, and earn bonus time. By completing an objective on all 3 areas, you unlock a sky fortress level in which you can rescue a new skater to control.</p><p>Gameplay is based heavily on the Tony Hawk series of games. Tricks consist of button and direction presses, and can be strung together with grinds to create high-scoring combos.</p>"},{"name":"Razor Racing","year":2001,"developer":"Vision Scape Interactive, Inc.","url":"psx-chd-roms-r/Razor%20Racing%20%28USA%29.chd","filesize":87850515,"score":"","genres":"Racing / Driving > Sports > Behind view > Tricks / stunts > Licensed","desc":"<p>The sequel to Razor Freestyle Scooter, <em>Razor Racing</em> has the same Tony Hawk-inspired gameplay but more of a focus on racing the small scooters carrying the Razor brand. The game includes 13 different characters to play and six areas in three cities. Each city has a track and a park. Once you successfully win the track race, you then have to beat a specified score in the freestyle park, which will then unlock the next city. Players can also collect token, to make available new characters.</p><p>By performing tricks and adding to the score, players can unlock new tricks and upgraded abilities such as better and increased speed. The multiplayer modes include Time Trial, Trick Parks, Freestyle Race and Circuit.</p>"},{"name":"RC de GO!","year":2000,"developer":"Taito Corporation","url":"psx-chd-roms-r/RC%20de%20Go%21%20%28Europe%29.chd","filesize":152942582,"score":6.6,"genres":"Action > Racing / Driving > Diagonal-down > 2D scrolling > Arcade > Automobile > Track racing","desc":"<p><em>RC de GO!</em> is a take on the Densha de Go! series, however this time the focus is on remote controlled rally cars. The player can choose from three unique RC cars, each with their own strengths and weaknesses and over 80 different customizable options to choose from including new chassis that can be used to either make a car faster or turn better, among many other unique attributes.</p><p>Players can race on fourteen different courses and have four different race modes to choose from: <em>Practice</em> lets the player learn the basics elements and controls of the car. <em>Quick Race</em> allows the player to choose from any cars and tracks available for an exhibition race. <em>Time Attack</em> has the player complete a course in a set amount of time and <em>Championship</em> puts the player on twelve different off-road and road courses in an attempt to win the championship. If a player is able to win this mode, they will have the chance to test their skills on three special unlockable tracks. Additionally, players unlock many of the parts, upgrades, tracks and cars from the championship mode.</p>"},{"name":"RC Helicopter","year":2000,"developer":"Tomcat System","url":"psx-chd-roms-r/RC%20Helicopter%20%28USA%29.chd","filesize":9288968,"score":"","genres":"Action > Simulation > 3rd-person (Other) > Behind view > Anime / Manga > Real-time > Helicopter > Vehicle simulator","desc":"<p>Your Dad just got you an RC Helicopter. Play with it, or take it outside to complete various missions for friends and family. The missions range from cutting the grass in your backyard, to filming ghosts. With each mission, you earn points to upgrade your helicopter, (or even get new helicopters) and unlock more missions. Just be careful; your helicopter is somewhat fragile, and has a limited battery life.</p><p><em>RC Helicopter</em> is a flight simulator of radio-controlled toy helicopters originally released as part of the <em>Simple 1500</em> budget line in Japan. The helicopter is maneuvered with the analog sticks of the DualShock controller. The left stick controls the movement while the right stick makes the aircraft go up and down. A battery meter and a hit counter at the top right corner show the remaining energy left and the number of bumps that the helicopter can sustain. When the battery is drained or the machine received too many hits, the game is over and the mission has to be restarted.</p><p>The main objective is to complete all the missions available from the city map screen. At the beginning of each one, a character asks the player to perform a specific task with the helicopter. In some cases, the toy is equipped with special tools to complete the mission, like a squirt gun and a claw that can be activated by pressing the R1 shoulder button. In the first missions, the aircraft has to be used to transport soda cans to a garbage pail, cut grass with its blades, splash birds with the water gun, blow baseballs from a roof, recover document folders from train tracks and other challenges.</p><p>After completing a mission the characters give money as a reward, that can used to repair any damage to the helicopter and recharge its batteries. The mission money can also be spent on items from the RC shop. The player can purchase new helicopter models and upgrades, like a more resilient body for the machine, and more durable batteries.</p>"},{"name":"RC Revenge","year":2000,"developer":"Acclaim Studios Cheltenham","url":"psx-chd-roms-r/RC%20Revenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":306121084,"score":6.5,"genres":"Action > Racing / Driving > Behind view > Arcade > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p>Players take control of a range of remote controlled cars and boats in an action packed racing game for the Sony PlayStation.</p><p>Based around an enchanting movie Theme world, players take their cars through a number of genre styled levels, including horror, sci-fi and cartoons.</p><p>Multiplayer split screen racing available in all modes of the game and a unique track editor allows you to create your own tracks to save on memory card and challenge your friends.</p>"},{"name":"Re-Loaded","year":1996,"developer":"Gremlin Interactive Limited","url":"psx-chd-roms-r/Re-Loaded%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":454616144,"score":5.6,"genres":"Action > Isometric > Shooter","desc":"<p>This is the sequel to 1995's Loaded, with an improved graphics engine, and just as much violence and blood. <em>Re-Loaded</em> puts you in the shoes of a number of characters, such as Sister Magpie or Butch. Each character is weird, deformed, and generally strange.</p><p>It is a mission based game, where you must complete various objectives to successfully win in each of the 12 worlds. Throughout each mission, you must kill lots of people, with a variety of weapons such as plasma cannons, lasers and ultra bombs.</p>"},{"name":"Re-Volt","year":1999,"developer":"Probe Entertainment Ltd.","url":"psx-chd-roms-r/Re-Volt%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":352641406,"score":7.5,"genres":"Action > Racing / Driving > Behind view > Arcade > Direct control > Automobile > Track racing > Vehicle simulator","desc":"<p>For years, the Toy-Volt company has been producing toys and games for children all over the world. Within months of introducing their first products, Toy-Volt shot to the top! No one could put their finger on exactly what it was that made the toys so popular. Sure, they employed the best designers and marketers in the world, but there was something else about Toy-Volt toys, something almost.... magic. Now, their newest R/C cars really start to live! </p><p><em>Re-Volt</em> is a racing game where you take control over one of more than 28 R/C cars and drive on one of the 13 tracks. The tracks are varied, and include a toy shop, a supermarket, a luxury liner and more. It is possible to play a \"reversed\" (backwards) or \"mirror\" (reversed left and right) variety of each track. There are also 4 levels of realism to choose from. </p><p>There are a couple of single- and multiplayer game modes to choose from. There's a Single Race, where you complete a single track while competing with several computer-controlled opponents; a Championship, where you try to complete a series of races in hopes of finishing on the top; and Multiplayer, where you play with live opponents. There's also a Time Trial, where you're alone on the track, and simply try to get as best a time as possible; a Practice mode, where you're free to drive around a track to learn its structure and shortcuts; and the Stunt Arena, where you drive around a special arena and try to collect stars situated in hard-to-reach places. </p><p>In Single Race, Championship and Multiplayer there are power-ups scattered throughout the track; picking them up gives you a one-use random power, such as missiles to launch at pesky opponents, a star to temporarily freeze competitors in place or a lightning bolt, which makes your car shock opponents nearby to make them stop.</p>"},{"name":"Ready 2 Rumble Boxing","year":1999,"developer":"Midway Home Entertainment, Inc.","url":"psx-chd-roms-r/Ready%202%20Rumble%20Boxing%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":128374435,"score":7.7,"genres":"Sports > 3rd-person (Other) > Boxing > Licensed","desc":"<p><em>Ready 2 Rumble Boxing</em> is a cartoon style boxing beat 'em up with plenty of strange looking characters to choose from and beat the hell out of them. You can train your character up to the best of his/her ability and then fight the best in the world for the championship belt.</p>"},{"name":"Ready 2 Rumble Boxing: Round 2","year":2000,"developer":"Midway Games, Inc.","url":"psx-chd-roms-r/Ready%202%20Rumble%20Boxing%20-%20Round%202%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":223000021,"score":7.5,"genres":"Sports > 3rd-person (Other) > Boxing > Licensed","desc":"<p><em>Ready 2 Rumble: Round 2</em> is a cartoon style boxing beat 'em up with plenty of strange looking characters to choose from and beat the hell out of. You can train your character up to the best of his/her ability and then fight the best in the world for the championship belt. </p><p>Round 2 adds some new play modes and characters into the mix of previous fighters. In this round, there are now 3 levels to the RUMBLE combo gauge (much like a Street Fighter game). Once you reach the third level, you can hit your enemy for six, out of the ring and into the crowd.</p>"},{"name":"Ready Maid","year":2002,"developer":"Zero System"},{"name":"Real Bout Fatal Fury","year":1997,"developer":"SNK Corporation","url":"psx-chd-roms-r/Real%20Bout%20Fatal%20Fury%20%28Europe%29.chd","filesize":247862044,"score":7.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>The fourth title of fighting Fatal Fury series. Now, you can destroy fight scene objects and the \"Fatal Fury 2\" fighters are back forming this list: Terry Bogard, Andy Bogard, Joe Higashi, Franco Bash, Mai Shiranui, Bob Wilson, Geese Howard, Billy Kane, Hon-Fu, Ryuji Yamazaki, Sokaku Mochizuki, Blue Mary, Kim Kaphwan, Jin Chonrei, Jin Chonshu and Duck King.</p>"},{"name":"Real Bout Garou Densetsu Special - Dominated Mind","year":1998,"developer":"Yumekobo Co., Ltd.","url":"psx-chd-roms-r/Real%20Bout%20Garou%20Densetsu%20Special%20-%20Dominated%20Mind%20%28Japan%29.chd","filesize":449303284,"score":"","genres":"Action > Side view > Anime / Manga > Arcade > Fighting","desc":"<p>A PSX-only Fatal Fury released as a conversion of sorts to Real Bout Fatal Fury Special. The game uses the same engine and general mechanics of said arcade game, but takes place outside of the main storyline a la Street Fighter Alpha 3 and includes brand new and exclusive characters like a back from the dead Geese and a new end-game boss: White.</p><p>The gameplay is virtually identical to <em>Real Bout Fatal Fury Special</em>, except that the action is much faster, the super-combo system is somewhat simplified and the foreground/background system has been ditched. New to the series is the addition of cel-animated cutscenes that play during key moments, and the game also offers a 2 player mode and a series of extra features like galleries, a Fatal Fury encyclopedia and new moves when you complete the game under certain circumstances.</p>"},{"name":"ReBoot","year":1998,"developer":"Electronic Arts Canada","url":"psx-chd-roms-r/ReBoot%20%28Europe%29.chd","filesize":446337087,"score":6.9,"genres":"Action > 3rd-person (Other) > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>This 3D action game is based on the computer animated cartoon <em>ReBoot</em>. It's an over-the-shoulder perspective shooter comprised of 19 complex levels filled with diverse enemies. The story in the game is conveyed through the linear video: an original episode of ReBoot created just for the game and positioned as episode 0 of the TV series (i.e. a prequel).</p>"},{"name":"Red Asphalt","year":1998,"developer":"Interplay Productions, Inc.","url":"psx-chd-roms-r/Red%20Asphalt%20%28USA%29.chd","filesize":468687231,"score":6.4,"genres":"Action > Racing / Driving > 3rd-person (Other)","desc":"<p><em>Red Asphalt</em> is a racing and combat game with a post-apocalyptic futuristic theme.</p><p>There are a total of 24 tracks and players can choose from 6 characters. Each character has different driving skills, tactical skills and aggression skills. Players start out with a sum of money and can win additional cash by winning the races. Use the money to buy vehicles, 6 to choose from, and upgrade them with better engines, armor, tires, suspension and weapons.</p><p>It is a direct sequel to Rock'n Roll Racing, although it features a very different style and gameplay.</p>"},{"name":"Reel Fishing","year":1996,"developer":"Victor Interactive Software, Inc.","url":"psx-chd-roms-r/Reel%20Fishing%20%28Europe%29.chd","filesize":136767408,"score":6.3,"genres":"Sports > 3rd-person (Other) > Fishing","desc":"<p><em>Reel Fishing</em> is a fishing simulation game. All the fishing spots are displayed with Full Motion Videos with the fish and line superimposed on them. Once you have bait, you see the fish and the end of your line and have to make sure he doesn't get away. Using the right bait you can catch fish, which can be held in your own personal aquarium, where they need to be taken proper care off. You have to refresh the water and feed them regularly. </p><p>The game is divided in stages. For each stage you need to catch a certain number of fish before you advance to the next location.</p>"},{"name":"Reel Fishing II","year":2000,"developer":"Team Craze","url":"psx-chd-roms-r/Reel%20Fishing%20II%20%28Europe%29%20%28En%2CDe%29.chd","filesize":254635382,"score":"","genres":"Sports > 1st-person > Fishing","desc":"<p><em>Reel Fishing II</em> is a fishing game which uses full motion video as backgrounds. Within the different fishing grounds, the player can't move freely but is restricted to certain hot spots. Then the waiting game starts until a fish bites and the camera goes underwater to show the fish and fishing line from the side. The player needs to balance giving lure, baiting and setting the hook to be able to get the fish out of the water. The player can choose between different fishing tools.</p><p>The main playing mode involves unlocking new areas by fulfilling requirements for the available fishing grounds within a time limit. Between the fishing sequences, time and seasons advance which has an impact to the areas. Besides this, there is also a free playing mode.</p>"},{"name":"Refrain Love 2 (Disc 1)","year":1999,"developer":"Riverhillsoft Inc.","url":"psx-chd-roms-r/Refrain%20Love%202%20%28Japan%29%20%28Disc%201%29.chd","filesize":513812852,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Visual novel > Romance","desc":"<p><em>Refrain Love 2</em> is a sequel to Refrain Love: Anata ni Aitai and while there are some differences in gameplay, and this sequel features new protagonist, the premise is somewhat similar since it is also romantic visual novel adventure game focused on meeting and dating various girls. A typical visual novel style gameplay features 2D anime style characters over static backgrounds with dialogue window during conversations. The game features many different girls the player can try to woo and depending on the dialogue choices the story branches into many possible endings.</p>"},{"name":"Refrain Love 2 (Disc 2)","year":1999,"developer":"Riverhillsoft Inc.","url":"psx-chd-roms-r/Refrain%20Love%202%20%28Japan%29%20%28Disc%202%29.chd","filesize":528107978,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Japanese-style adventure > Visual novel > Romance","desc":"<p><em>Refrain Love 2</em> is a sequel to Refrain Love: Anata ni Aitai and while there are some differences in gameplay, and this sequel features new protagonist, the premise is somewhat similar since it is also romantic visual novel adventure game focused on meeting and dating various girls. A typical visual novel style gameplay features 2D anime style characters over static backgrounds with dialogue window during conversations. The game features many different girls the player can try to woo and depending on the dialogue choices the story branches into many possible endings.</p>"},{"name":"Refrain Love: Anata ni Aitai","year":1997,"developer":"Riverhillsoft Inc.","url":"psx-chd-roms-r/Refrain%20Love%20-%20Anata%20ni%20Aitai%20%28Japan%29.chd","filesize":451129575,"score":"","genres":"Adventure > Simulation > 1st-person > 3rd-person (Other) > Anime / Manga","desc":"<p><em>Refrain Love</em> is a dating simulation adventure game and a story of seven men and women, including the player. The protagonist is a male college student (character's name is not pre-defined, but entered by the player) who made a vow with couple of his friends, Tetsuya Yamo, Kousuke Satou, and Taizou Sakaki, to find a woman by next Christmas. One day, you meet a girl that looks like a dead ringer of the mysterious woman that's been plaguing your dreams recently. Chance, fate, or just dumb luck, it makes you feel like you just might have a chance to make your wish come true.</p><p>The game's story follows the events in the year and ends on the Christmas Eve, hopefully with the girl of your dreams right by your side. Two main gameplay modes in the game are simulation and adventure mode. Adventure mode is similar to visual novels but with much more choices to select during conversations with your buddies or the girl you're on a date with. Additionally, you can use the city map to visit various different locations. The simulation mode consists of part-time job where you get to earn some money, spending time alone with a hobby of your choice, playing with your friends, or taking a girl to a date. The obvious girl of your choice features Tomomi Sakura, the girl from your campus, Ran Yuuki, your childhood friend, and Shouko Takamiya, a working woman.</p>"},{"name":"Relentless: Twinsen's Adventure","year":1996,"developer":"Adeline Software International"},{"name":"Renegade Racers","year":1999,"developer":"Promethean Designs Ltd.","url":"psx-chd-roms-r/Renegade%20Racers%20%28Europe%29.chd","filesize":296617327,"score":6,"genres":"Action > Racing / Driving > 3rd-person (Other) > Arcade","desc":"<p>A cart racer whose premise is to win a tournament sponsored by millionaire Buck Billionaire. The player selects from a series of <em>renegades</em> and goes at it.</p><p>Gameplay modes available include two player vs. gameplay, the mission-based tournament which has over 40 races that take place in 6 tracks, and have different objectives such as jump over a certain number of obstacles, win in a certain time bracket, etc., as well as the time-honored battle races we have come to expect from Kart racers with all manner of power-ups and wacky weapons.</p><p>Vehicles are all hovercrafts, so the control is the same no matter if the player races on ice, grass, etc., and graphics-wise the game uses Direct 3D accelerated polygonal graphics .</p>"},{"name":"Rescue Copter","year":2001,"developer":"Aqua System Co., Ltd.","url":"psx-chd-roms-r/Rescue%20Copter%20%28USA%29.chd","filesize":124385730,"score":"","genres":"Simulation > 3rd-person (Other) > Helicopter > Vehicle simulator","desc":"<p>Jet CopterX is a helicopter action game that provides the realest thrill of controlling a helicopter. Choose from five types of helicopter and save lives by flying the helicopter among narrow valleys and over stiff cliffs. Jump into the helicopter and get ready for the challenging missions today!</p>"},{"name":"Rescue Heroes: Molten Menace","year":2001,"developer":"Asylum Entertainment Ltd.","url":"psx-chd-roms-r/Rescue%20Heroes%20-%20Molten%20Menace%20%28Europe%29.chd","filesize":271467916,"score":"","genres":"Action > Behind view > Direct control > Flight / aviation > Motorcycle > Naval / watercraft > Truck > Contemporary > Licensed","desc":"<p>Save the Day and Be a Hero!<br>Kaboom! A volcano erupted near the quiet town of Misty Peaks! Spring into action with the Rescue Heroes™ Team and help save the town! Race against a river of lava with Jake Justice™, and soar above rooftops with Ariel Flyer™ in search of stranded people and pets. Use your quick wits and problem-solving skills to complete each rescue mission and save the day!<br><br>* 6 missions with multiple levels provide hours of excitement<br>* 5 cool rescue vehicles, including Gil Gripper's™ jet ski and Air Rescue Specialist's hang glider<br>* Awesome 3-D graphics and special effects<br>* Fun with learning–builds problem-solving and thinking skills</p>"},{"name":"Rescue Shot","year":2000,"developer":"Now Production Co., Ltd.","url":"psx-chd-roms-r/Rescue%20Shot%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":453228440,"score":6.7,"genres":"Action > 1st-person > Shooter","desc":"<p><em>Rescue Shot</em> is a shooter developed and published by Namco. On one side, it differences from the famous Point Blank series. The game, in fact, looks more like Time Crisis, which doesn't rely on accuracy less very much, thus letting you enjoying the fast-pace of the game dynamic. On the other side, the variety in <em>Rescue Shot</em> is similar to the Point Blank series.</p><p>The game takes place on a lot of different scenarios, full of traps to avoid and dangers to overcome: from a manufacturing industry to a tube, from a Japanese market district to a country village.The main character in the game is Bow, a dog who wanders through a fairytale-esque land where all sorts of minions try to hamper his progress. The aim of the adventure is to help Bow regain his memory after he fell off a cliff. He needs to collect all 5 dream fragments to be able to make a wish, so he can remember where he came from.</p><p>Each of the 10 scenarios (grouped in 4 stages) has got its unique inhabitants (robots, birds, porcupines, bats, ...) and boss (a tiger, a wolf, a machine...). Tons of items in the background, from mushrooms to spiders and flowers (and even windows), can be shot to reveal power-ups of all sorts. Occasionally you have to shoot Bow in the derriere to get him to jump over obstacles, or a timely shot to the head will cause him to duck flying objects.</p>"},{"name":"Resident Evil","year":1996,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-r/Resident%20Evil%20%28Europe%29%20%28EDC%29.chd","filesize":319021573,"score":8,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Survival horror > Direct control > Contemporary > North America > Horror > Regional differences","desc":"<p>A team of S.T.A.R.S (Special Tactics And Rescue Squad) members are called to investigate a series of murders near Raccoon City.While searching the woods near the city, the team is attacked by bloodthirsty dogs and they have to retreat to a nearby mansion. </p><p>The player chooses between Jill Valentine or Chris Redfield and starts to explore the mansion. It soon becomes very clear that it isn't just any mansion, but a hellish place where the undead walk the corridors, and other horrors are lurking in the darkness, waiting to eat some heads. While solving puzzles, collecting keys, and shooting monsters, the player has to unravel the mystery behind this mansion and, if possible, get out alive.</p><p>Exclusive to the SEGA Saturn version is a Battle Mode bonus mode, where, with limited ammo and under the threat of limited time, the player must survive a series of rooms filled with monsters.</p>"},{"name":"Resident Evil 2 - Dual Shock Ver. (Disc 1)","year":1998,"developer":"Capcom Production Studio 3","url":"psx-chd-roms-r/Resident%20Evil%202%20-%20Dual%20Shock%20Ver.%20%28USA%29%20%28Disc%201%29.chd","filesize":385142437,"score":8,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Survival horror > Direct control > Contemporary > North America > Horror > Regional differences","desc":"<p>An update of Resident Evil 2, this time with Dual Shock support, a few new extras, and an added battle mode upon completion of the game.</p>"},{"name":"Resident Evil 2 - Dual Shock Ver. (Disc 2)","year":1998,"developer":"Capcom Production Studio 4","url":"psx-chd-roms-r/Resident%20Evil%202%20-%20Dual%20Shock%20Ver.%20%28USA%29%20%28Disc%202%29.chd","filesize":387137535,"score":8,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Survival horror > Direct control > Contemporary > North America > Horror > Regional differences","desc":"<p>An update of Resident Evil 2, this time with Dual Shock support, a few new extras, and an added battle mode upon completion of the game.</p>"},{"name":"Resident Evil 2 (Disc 1)","year":1998,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-r/Resident%20Evil%202%20%28Europe%29%20%28Disc%201%29.chd","filesize":341588331,"score":8.4,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Survival horror > Direct control > Contemporary > North America > Horror > Regional differences","desc":"<p>Even though Chris Redfield and Jill Valentine were able to destroy the Umbrella corporation's undead monsters in the original Resident Evil, Umbrella's experiments with the T-virus continued unhindered. Claire Redfield, the younger sister of Chris, and Leon Kennedy, a rookie cop on his first day of the job, arrive in the sleepy midwestern town of Raccoon City only to find the city in flaming ruins due to the inhabitants having been transformed into mindless flesh-eating freaks. Although Claire and Leon team up, they are soon separated and trapped inside the city by a car crash. Seeking refuge within the Raccoon City police station, each character must find a way to escape from the nightmare while solving the mystery of what happened to Raccoon City. </p><p>Besides the zombie population (which is much more diverse than the original, including teenage girl zombies, maniac cop zombies, and even melting naked zombies), Claire and Leon will also have to deal with a variety of freakish mutants including giant poisonous spiders, walking venus-fly-traps, and speedy wall-crawling Lickers. Each character will also be pursued by one seemingly unstoppable foe: a horrific and constantly evolving man-monster known as the \"G-Type\" (Leon's Scenario), or a taciturn but inhumanly powerful Umbrella agent who is nonetheless saddled with the rather quaint name of Mr. X (Claire's Scenario). </p><p>Like the previous game in the series, <em>Resident Evil 2</em> is a 3D action-adventure using three-dimensional polygon characters over two-dimensional pre-rendered backgrounds, with the action viewed through a variety of cinematic fixed camera angles in each room. Just like the original <em>Resident Evil</em>, players can choose to play as one of two possible characters. Each character goes through the same initial scenario, but with differences in the type of weaponry they find and the people they meet along the way. Leon will team up with a mysterious woman calling herself Ada Wong, while Claire will find herself charged with protecting a little girl named Sherry Birkin. </p><p>Unlike the original <em>Resident Evil</em>, beating the game for the first time unlocks a second scenario to be played with the character you didn't choose, with new locations, maps, enemies, a longer and more climactic ending. Your actions in the first scenario can also affect the outcome of certain events in the second scenario. Additionally, ammo and healing items are more plentiful than in the original game, although you still aren't given enough bullets to kill every enemy you meet.</p>"},{"name":"Resident Evil 2 (Disc 2)","year":1998,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-r/Resident%20Evil%202%20%28Europe%29%20%28Disc%202%29.chd","filesize":345837288,"score":8.4,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Survival horror > Direct control > Contemporary > North America > Horror > Regional differences","desc":"<p>Even though Chris Redfield and Jill Valentine were able to destroy the Umbrella corporation's undead monsters in the original Resident Evil, Umbrella's experiments with the T-virus continued unhindered. Claire Redfield, the younger sister of Chris, and Leon Kennedy, a rookie cop on his first day of the job, arrive in the sleepy midwestern town of Raccoon City only to find the city in flaming ruins due to the inhabitants having been transformed into mindless flesh-eating freaks. Although Claire and Leon team up, they are soon separated and trapped inside the city by a car crash. Seeking refuge within the Raccoon City police station, each character must find a way to escape from the nightmare while solving the mystery of what happened to Raccoon City. </p><p>Besides the zombie population (which is much more diverse than the original, including teenage girl zombies, maniac cop zombies, and even melting naked zombies), Claire and Leon will also have to deal with a variety of freakish mutants including giant poisonous spiders, walking venus-fly-traps, and speedy wall-crawling Lickers. Each character will also be pursued by one seemingly unstoppable foe: a horrific and constantly evolving man-monster known as the \"G-Type\" (Leon's Scenario), or a taciturn but inhumanly powerful Umbrella agent who is nonetheless saddled with the rather quaint name of Mr. X (Claire's Scenario). </p><p>Like the previous game in the series, <em>Resident Evil 2</em> is a 3D action-adventure using three-dimensional polygon characters over two-dimensional pre-rendered backgrounds, with the action viewed through a variety of cinematic fixed camera angles in each room. Just like the original <em>Resident Evil</em>, players can choose to play as one of two possible characters. Each character goes through the same initial scenario, but with differences in the type of weaponry they find and the people they meet along the way. Leon will team up with a mysterious woman calling herself Ada Wong, while Claire will find herself charged with protecting a little girl named Sherry Birkin. </p><p>Unlike the original <em>Resident Evil</em>, beating the game for the first time unlocks a second scenario to be played with the character you didn't choose, with new locations, maps, enemies, a longer and more climactic ending. Your actions in the first scenario can also affect the outcome of certain events in the second scenario. Additionally, ammo and healing items are more plentiful than in the original game, although you still aren't given enough bullets to kill every enemy you meet.</p>"},{"name":"Resident Evil 3: Nemesis","year":1999,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-r/Resident%20Evil%203%20-%20Nemesis%20%28Europe%29.chd","filesize":368394977,"score":7.8,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Survival horror > Direct control > Contemporary > North America > Horror > Regional differences","desc":"<p><em>Resident Evil 3</em> takes place during the events of Resident Evil 2. The midwestern town of Raccoon City is in ruins, having been overrun with the undead creating T-virus thanks to the wacky hijinks of William Birkin and Umbrella Inc. The player must guide Jill \"master of unlocking\" Valentine (one of the two main protagonists of the original Resident Evil) out of the city alive. Along the way, Jill will interact with and receive help from (or be hindered by) three Umbrella mercenaries who are also stranded in Raccoon City. Standing in the way of your group's last escape are a horde of flesh-eating zombified citizens, homicidal mutants, and a relentless killing machine known only as Nemesis who is determined to hunt down and kill the survivors of the original <em>Resident Evil</em>, including Jill.</p><p>A dramatic improvement over Tyrant/Mr. X/G from the previous games, Nemesis can run (faster than Jill, in fact), use firearms (a rocket launcher), dodge attacks, and even move through doors and from room to room in pursuit of Jill. On top of that he still possesses the nigh indestructibility we've come to know from Umbrella's ultimate bio-weapons. </p><p>Like its two predecessors <em>Resident Evil 3</em> is a third-person action-adventure game with polygonal characters on pre-rendered backgrounds with cinematic camera angles, a technique originally pioneered by Alone in the Dark. Although the game uses the same basic engine and gameplay as the previous games, the gameplay is improved by features such as auto-targeting, a 180 degree spin, and a new dodge move that allows Jill to avoid enemy attacks. Another addition is Jill's ability to create different kinds of ammunition by mixing together three different types of gunpowder found throughout the game. The game include a randomization feature, which changes the location of certain key items and ammo. Another noteworthy feature is that at certain points in the game, Jill is faced with two choices for a situation, each will affect later story, and even the game ending. The zombies have also been made more diverse.</p><p>The number of polygons in the character models has also been increased, along with the possible screen resolution and color depth for the PC version (up to 1600 X 1200 at 32 bits, from a maximum of 640 X 480 at 16 bits for <em>Resident Evil 2</em>). Another addition in the PC version is the ability to skip cutscenes as well as the door loading animation.</p><p>The PC and Dreamcast versions includes all eight of Jill's possible costumes, as well as the mercenary mini-game Operation Mad Jackal which allows you to play as one of the three Umbrella soldiers. On the Playstation version, these special features must be unlocked by beating the game with a high score.</p>"},{"name":"Resident Evil: Director's Cut","year":1997,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-r/Resident%20Evil%20-%20Director%27s%20Cut%20%28USA%29.chd","filesize":330852427,"score":7.9,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Survival horror > Direct control > Contemporary > North America > Horror > Regional differences","desc":"<p><em>Resident Evil: Director's Cut</em> is a reissue of the original Resident Evil. Unlike Resident Evil for the GameCube, it is not a remake of the original game, instead, it is more of a slight remix.</p><p>There are three gameplay modes available. \"Original\" contains the original game with no changes or additions. \"Beginner\" features double the amount of ammunition and save ribbons, plus increased health for the player, increased damage for their weapons, and an auto-target feature.</p><p>\"Arrange\" mode is the \"Director's Cut\" version of the original. The default outfits for Jill, Chris, and Rebecca are changed, new camera angles are introduced, and the placement of key items is changed. Most of these changes are designed to play against the expectations of veteran players of the first <em>Resident Evil</em> - so zombie dogs may smash through new windows, or keys will not be where they were, forcing players to hunt for them anew. The default Beretta pistol is also changed to a chromed version with a randomized chance to kill standard zombies in one shot.</p><p>The original release of the <em>Director's Cut</em> advertised an uncut version of the opening cinema, in full color, and never-before seen. Notable aspects of this video include shots of a corpse with bites taken out of the face, close-ups of zombie dogs bleeding when shot, and graphic quick-cuts of Joseph being bitten by these dogs. Chris is also shown smoking in his introduction, which was cut from Western releases. However, only the French and German releases contained this footage. U.S. and UK versions retained the censored black-and-white video shipped with the original release. This has never been corrected, either in the Greatest Hits reissue, or with the PSOne Classics downloads on the Playstation Network.</p><p>The original issue of the <em>Director's Cut</em> contained a demo of Resident Evil 2 on a second disc. The \"Greatest Hits\" re-release added Dual Shock support for the controller (left \"movement\" stick only).</p>"},{"name":"Resident Evil: Survivor","year":2000,"developer":"Tose Co., Ltd.","url":"psx-chd-roms-r/Resident%20Evil%20-%20Survivor%20%28Europe%29.chd","filesize":177611219,"score":5.5,"genres":"Action > 1st-person > Puzzle elements > Shooter > Survival horror > Horror > Regional differences","desc":"<p>A man wearing white, a crashed helicopter, a pair of dog tags with the name 'Ark Thompson', and a pistol. These are the only clues a young man finds to his identity as he awakes on Sheena Island. On his journey through the island he will encounter many monsters as well as discover the terrible secrets of Umbrella's biological weapons programs.</p><p><em>Resident Evil: Survivor</em> is set several months after <em>Resident Evil 2</em> &amp; <em>3</em> and is the first <em>Resident Evil</em> title to be rendered in real time as opposed to making use of pre-rendered backdrops. Levels are explored in first person, and when enemies are encountered the press of a button will bring up a targeting reticule for shooting. As with most light-gun games there is infinite pistol ammunition available, but limited ammunition for more powerful weapons. At the end of each level two doors are presented which both lead to different levels, although all paths eventually lead to the same ending.</p>"},{"name":"Retro Force","year":1999,"developer":"Psygnosis Limited","url":"psx-chd-roms-r/Retro%20Force%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":155012882,"score":6.2,"genres":"Action > Top-down > Arcade > Shooter","desc":"<p>3D scrolling shoot-em-up. Take control of one of four characters and pilot their fighter craft through a number of enemy infested levels.</p>"},{"name":"Return Fire","year":1996,"developer":"Silent Software Incorporated","url":"psx-chd-roms-r/Return%20Fire%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%2CPt%2CKo%2CRu%2CAr%29.chd","filesize":227166464,"score":7.2,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Helicopter > Tank","desc":"<p><em>Return Fire</em> is the spiritual successor to Fire Power and it fits in both the strategy and action genres. You can take control of one of 4 vehicles, a jeep, helicopter, tank, and a missile launching vehicle (but actually called The Armoured Support Vehicle (ASV).</p><p>There are two ways to win, the easier one would be to capture the enemy's flag by bringing it to your bunker with the frail Jeep. This is the main objective. The other way to win is to destroy your enemy, a secondary objective.</p>"},{"name":"Return to Zork (Disc 1)","year":1996,"developer":"Activision, Inc.","url":"psx-chd-roms-r/Return%20to%20Zork%20%28Japan%29%20%28Disc%201%29.chd","filesize":417947412,"score":6.8,"genres":"Adventure > 1st-person > Graphic adventure > Puzzle elements > Point and select","desc":"<p>You are standing behind the white house. There is something in the mailbox. A video message from a wizard informing you that you are the sweepstakes winner to the Valley of the Sparrows... right now, by magic flight. Upon arriving at this mysterious place however, not everything is as it should be. There's nobody to meet you and those who you do come across don't seem to have any knowledge about a sweepstakes. It looks like this is a private vacation and you'll need to find your own way through this land.</p><p><em>Return to Zork</em> is a first-person adventure game using live actors and video sequences. The game is similar to Myst in interface; the player is also able to rotate the viewpoint to discover new areas and uncover items that can be used or picked up. Various characters will be met along the way and spoken to via a system of dialog choices. The game allows the player to experiment with items in various ways, including discharging them; however, this often leads to \"dead ends\", rendering it impossible to complete the game.</p>"},{"name":"Return to Zork (Disc 2)","year":1996,"developer":"Activision, Inc.","url":"psx-chd-roms-r/Return%20to%20Zork%20%28Japan%29%20%28Disc%202%29.chd","filesize":451337977,"score":6.8,"genres":"Adventure > 1st-person > Graphic adventure > Puzzle elements > Point and select","desc":"<p>You are standing behind the white house. There is something in the mailbox. A video message from a wizard informing you that you are the sweepstakes winner to the Valley of the Sparrows... right now, by magic flight. Upon arriving at this mysterious place however, not everything is as it should be. There's nobody to meet you and those who you do come across don't seem to have any knowledge about a sweepstakes. It looks like this is a private vacation and you'll need to find your own way through this land.</p><p><em>Return to Zork</em> is a first-person adventure game using live actors and video sequences. The game is similar to Myst in interface; the player is also able to rotate the viewpoint to discover new areas and uncover items that can be used or picked up. Various characters will be met along the way and spoken to via a system of dialog choices. The game allows the player to experiment with items in various ways, including discharging them; however, this often leads to \"dead ends\", rendering it impossible to complete the game.</p>"},{"name":"Revolution X","year":1996,"developer":"Midway Manufacturing Company","url":"psx-chd-roms-r/Revolution%20X%20-%20Music%20Is%20the%20Weapon%20%28Europe%29.chd","filesize":414539232,"score":5.1,"genres":"Action > 1st-person > Rail shooter > Sci-fi / futuristic > Regional differences","desc":"<p>Revolution X is about the ol' Rock &amp; Roll.</p><p>There is an evil nation putting the youth down and banning our beloved rock music. Who you gonna call? Aerosmith!With the help of Aerosmith, the player must shoot his/her way through enemy infested levels, (light) guns blazing, collecting power-ups and releasing hostages.</p><p>Almost all of the graphics are digitized and Aerosmith themselves are too! There are also lots of fmv videos. </p>"},{"name":"Rhapsody: A Musical Adventure","year":1998,"developer":"Nippon Ichi Software, Inc.","url":"psx-chd-roms-r/Rhapsody%20-%20A%20Musical%20Adventure%20%28USA%29.chd","filesize":235870152,"score":6.4,"genres":"Role-playing (RPG) > Isometric > Anime / Manga > Turn-based","desc":"<p>In this game the player controls Cornet, a young orphaned girl who can animate lifeless puppets by playing on her trumpet. One day, Cornet meets prince Ferdinand and falls in love with him. She joins a contest, the winner of which will have the privilege to marry the prince. But in the middle of the contest, an evil sorceress bursts in and kidnaps the prince. Now Cornet and her friends must defeat the sorceress and rescue the prince.</p><p><em>Rhapsody: A Musical Adventure</em> is a Japanese-style role-playing game with humorous elements. Cornet's party includes animated puppets and can also contain enemies who may be willing to join it after battles. All the combatants level up automatically after having accumulated a sufficient amount of experience points. Enemy encounters are random, and battles take place on a tactical screen, requiring the player to move characters in a turn-based fashion and attack enemies in range of the characters' weapons. </p><p>Characters also learn magic and can equip up to four different accessories instead of the traditional weapons and armor. The world map consists of dots the player can travel to automatically, and only a small portion of it is accessible in the beginning. Story progression is linear. Musical performances are sometimes used as story-advancing cutscenes.</p>"},{"name":"Rhythm Beat","year":2004,"developer":"","url":"psx-chd-roms-r/Rhythm%20Beat%20%28Europe%29.chd","filesize":123737354,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm > Timed input","desc":"<p>Keep in time with the music and follow the on screen arrows as you groove to the beat.<br>Challenging dance routines make it a fun way to improve your dance skills and a great way to keep fit.<br>Use either a controller or a special dance mat accessory (available seperately). 1 or 2 player mode available.</p>"},{"name":"Ridegear Guybrave","year":1997,"developer":"Avit, Inc.","url":"psx-chd-roms-r/Ridegear%20Guybrave%20%28Japan%29.chd","filesize":293494298,"score":"","genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Side view > Anime / Manga > Fighting > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Colonel Dahar, leader of the Mars Imperial Army, has brought his forces to attack Earth, seeking to take the remains of an ancient civilization by force. A young girl named Momolita, living with an old inventor and a group of machine pilots in a small Earth city, seems to have some kind of connection to this mysterious ancient civilization. When Momolita is captured by the Mars Imperial Army, it's up to Ridegear pilot Ken and his friends to rescue her, and bring the fist of justice crashing down on Colonel Dahar!</p><p><em>Ridegear Guybrave</em> is a side-scrolling action game with RPG elements. One or two players select from the four available characters, hop into their Ridegear mechs, and head out to fight for justice. Each character pilots their own unique Ridegear, and it is possible to buy a variety of different upgrades for each, including main and sub weapons, shields, and engines. Defeating enemies will also earn experience, and leveling up will increase each character's life meter and unlock new moves.</p><p>In addition to the main story mode, there is also a 1-on-1 Coliseum mode for one or two players. It is possible to use upgraded machines from the story mode, and new machines are unlocked for use as the story progresses.</p>"},{"name":"Ridge Racer","year":1994,"developer":"Namco Limited","url":"psx-chd-roms-r/Ridge%20Racer%20%28Europe%29.chd","filesize":310364083,"score":8,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p>Ridge Racer is an arcade racer that puts the emphasis on speed and fun rather than on realistic driving simulation. Choose from 4 fantasy cars (plus 9 more that you must unlock yourself) and go race in a series of equally fantastical tracks against a series of computer controlled oponents as well as the clock itself.</p><p>Other additions to the game come in the form of a hidden \"extra\" mode, and a music player that allows you to play any of the 6 included cd tracks as well as your own music cds.</p>"},{"name":"Ridge Racer Revolution","year":1995,"developer":"Namco Limited","url":"psx-chd-roms-r/Ridge%20Racer%20Revolution%20%28Europe%29%20%28EDC%29.chd","filesize":530097842,"score":7.9,"genres":"Racing / Driving > Behind view > Real-time > Direct control > Automobile > Street racing","desc":"<p>This new version of the classic arcade racer now adds new cars, new tracks and some remixes of the in-game music</p>"},{"name":"Rise 2: Resurrection","year":1996,"developer":"Mirage Technologies (Multimedia) Ltd.","url":"psx-chd-roms-r/Rise%202%20-%20Resurrection%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":379172003,"score":6.2,"genres":"Action > Side view > 2D scrolling > Fighting > Cyberpunk / dark sci-fi","desc":"<p>In the sequel new troubles in ElectroCorp have begun. As we remember, this corporation made robots for civilian jobs, but one Supervisor decided to make robot-killers. Human brains were implanted on some of them. But this time, one hacker has infected the ElectroCorp's network with a virus, so Supervisor lost control over robots and they began to kill each other. You are one of them.</p>"},{"name":"Rise of the Phoenix","year":1998,"developer":"KOEI Co., Ltd."},{"name":"Rising Zan: The Samurai Gunman","year":1999,"developer":"UEP Systems Inc.","url":"psx-chd-roms-r/Rising%20Zan%20-%20The%20Samurai%20Gunman%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":508012774,"score":7.2,"genres":"Action > 1st-person > Behind view","desc":"<p>In the pioneering days of America, Young Johnny was a sheriff, a boy who had grown up in the West with dreams of being a cowboy and bringing law and order to his town. Until one day, he met something and someone who he couldn't beat. A group of ninja assassins, the Jackal Organization, were harassing the town and Johnny brave as he was, got shot down. Johnny though, he didn't die... he refused to die... and sought the help of his father's friend Suzuki, who was a master of the legendary Zipang arts...</p><p>Johnny went away then... to learn the skills that would help him win and train hard to beat his opponents. It was long. It was hard... but Johnny's back now to save the town and defeat the ninja clan... no wait, he's Johnny No More... now he calls himself Zan... The Super-Ultra-Sexy-Hero Zan!</p><p>Rising Zan is a 3rd person action game with plenty of oddball humor and interesting situations. Zan, the main character wields the weapons of both of his trades... the Sword of a Samurai master, and the six-shooter pistol of an American cowboy. He'll need a variety of techniques to defeat the Jackal Clan and avenge his own lost battle. Zan proceeds through enemies and challenges in each level to eventually reach the boss who he then battles in some form of specialized combat or pattern. Once the boss is defeated, Zan gets the chance to unleash as much punishment on his foe in 30 seconds as he can; higher damage values will change the finishing move he uses to slay his foe.</p>"},{"name":"Risk: The Game of Global Domination","year":1997,"developer":"NMS Software Ltd.","url":"psx-chd-roms-r/Risk%20-%20The%20Game%20of%20Global%20Domination%20%28USA%29.chd","filesize":199049963,"score":6.9,"genres":"Strategy > Top-down > Turn-based > Board game > Licensed","desc":"<p><em>RISK: The Game of Global Domination</em> is a conversion of the classic board game <em>Risk</em>. Your aim is to wipe out your opponents and conquer the world by placing your armies and attacking neighbouring territories. The CD-ROM version of the game features an exact conversion of the Classic board game against human or AI opponents, as well as Ultimate Risk, a more complex game where a completely new strategy is needed, involving Generals, forts and different terrain types.</p><p>Other features include new maps, the challenging Blind Risk, fully animated battle scenes and a second CD to allow easy network gaming.</p>"},{"name":"Rival Schools (Disc 1)","year":1998,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-r/Rival%20Schools%20-%20United%20by%20Fate%20%28Europe%29%20%28Disc%201%29%20%28Evolution%20Disc%29.chd","filesize":215816168,"score":7.7,"genres":"Action > Side view > Fighting > Regional differences","desc":"<p>What do you get when you cross Street Fighter with a bunch of school kids? You get another classic Capcom beat 'em up. </p><p>Featuring plenty of new faces, and heaps of new moves to work with, this is a full conversion of the arcade game, with the added bonus of a second disk. In this second disk, you get new modes including Lesson (teach yourself new moves), Group (select two to four characters for a group battle), League (choose two to six characters and then fight in a league battle), Tournament (tournament battle with up to eight characters), Cooperate (four-player simultaneous player), one-player game, and a specialized versus mode.</p>"},{"name":"Rival Schools (Disc 2)","year":1998,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-r/Rival%20Schools%20-%20United%20by%20Fate%20%28Europe%29%20%28Disc%202%29%20%28Arcade%20Disc%29.chd","filesize":393549896,"score":7.7,"genres":"Action > Side view > Fighting > Regional differences","desc":"<p>What do you get when you cross Street Fighter with a bunch of school kids? You get another classic Capcom beat 'em up. </p><p>Featuring plenty of new faces, and heaps of new moves to work with, this is a full conversion of the arcade game, with the added bonus of a second disk. In this second disk, you get new modes including Lesson (teach yourself new moves), Group (select two to four characters for a group battle), League (choose two to six characters and then fight in a league battle), Tournament (tournament battle with up to eight characters), Cooperate (four-player simultaneous player), one-player game, and a specialized versus mode.</p>"},{"name":"Riven: The Sequel to Myst (Disc 1)","year":1997,"developer":"Cyan Worlds, Inc.","url":"psx-chd-roms-r/Riven%20-%20The%20Sequel%20to%20Myst%20%28Europe%29%20%28Disc%201%29.chd","filesize":452018834,"score":8.1,"genres":"Adventure > 1st-person > Puzzle elements > Fantasy > Steampunk","desc":"<p>After the Stranger has rescued Atrus, the master of \"linking books\", from the imprisonment caused by his sons, a new task awaits the hero. Atrus's wife, Catherine, has been taken by Gehn, his own father. Gehn has appointed himself as the one to rule the Age of Riven, and has driven his world to collapse. Now he holds Catherine hostage on Riven, hoping that his son will restore the book link to the Age and free him from there. The Stranger is requested by Atrus to travel to Riven and find a way to rescue Catherine.</p><p><em>Riven</em> is a sequel to  Myst, and is very similar to its predecessor in gameplay style, controls, and visual presentation. The game world is presented as a series of computer-generated still screens; the player explores it in a point-and-click fashion. Interaction with the environment is possible only when said environment is highlighted as a \"hot spot\", and is also performed by simple clicking. Like its predecessor, <em>Riven</em> is heavy on puzzles, which rarely include using inventory items, but usually involve understanding and manipulating the complex environments and machinery of the game world.</p>"},{"name":"Riven: The Sequel to Myst (Disc 2)","year":1997,"developer":"Cyan Worlds, Inc.","url":"psx-chd-roms-r/Riven%20-%20The%20Sequel%20to%20Myst%20%28Europe%29%20%28Disc%202%29.chd","filesize":493674034,"score":8.1,"genres":"Adventure > 1st-person > Puzzle elements > Fantasy > Steampunk","desc":"<p>After the Stranger has rescued Atrus, the master of \"linking books\", from the imprisonment caused by his sons, a new task awaits the hero. Atrus's wife, Catherine, has been taken by Gehn, his own father. Gehn has appointed himself as the one to rule the Age of Riven, and has driven his world to collapse. Now he holds Catherine hostage on Riven, hoping that his son will restore the book link to the Age and free him from there. The Stranger is requested by Atrus to travel to Riven and find a way to rescue Catherine.</p><p><em>Riven</em> is a sequel to  Myst, and is very similar to its predecessor in gameplay style, controls, and visual presentation. The game world is presented as a series of computer-generated still screens; the player explores it in a point-and-click fashion. Interaction with the environment is possible only when said environment is highlighted as a \"hot spot\", and is also performed by simple clicking. Like its predecessor, <em>Riven</em> is heavy on puzzles, which rarely include using inventory items, but usually involve understanding and manipulating the complex environments and machinery of the game world.</p>"},{"name":"Riven: The Sequel to Myst (Disc 3)","year":1997,"developer":"Cyan Worlds, Inc.","url":"psx-chd-roms-r/Riven%20-%20The%20Sequel%20to%20Myst%20%28Europe%29%20%28Disc%203%29.chd","filesize":436992357,"score":8.1,"genres":"Adventure > 1st-person > Puzzle elements > Fantasy > Steampunk","desc":"<p>After the Stranger has rescued Atrus, the master of \"linking books\", from the imprisonment caused by his sons, a new task awaits the hero. Atrus's wife, Catherine, has been taken by Gehn, his own father. Gehn has appointed himself as the one to rule the Age of Riven, and has driven his world to collapse. Now he holds Catherine hostage on Riven, hoping that his son will restore the book link to the Age and free him from there. The Stranger is requested by Atrus to travel to Riven and find a way to rescue Catherine.</p><p><em>Riven</em> is a sequel to  Myst, and is very similar to its predecessor in gameplay style, controls, and visual presentation. The game world is presented as a series of computer-generated still screens; the player explores it in a point-and-click fashion. Interaction with the environment is possible only when said environment is highlighted as a \"hot spot\", and is also performed by simple clicking. Like its predecessor, <em>Riven</em> is heavy on puzzles, which rarely include using inventory items, but usually involve understanding and manipulating the complex environments and machinery of the game world.</p>"},{"name":"Riven: The Sequel to Myst (Disc 4)","year":1997,"developer":"Cyan Worlds, Inc.","url":"psx-chd-roms-r/Riven%20-%20The%20Sequel%20to%20Myst%20%28Europe%29%20%28Disc%204%29.chd","filesize":482305454,"score":8.1,"genres":"Adventure > 1st-person > Puzzle elements > Fantasy > Steampunk","desc":"<p>After the Stranger has rescued Atrus, the master of \"linking books\", from the imprisonment caused by his sons, a new task awaits the hero. Atrus's wife, Catherine, has been taken by Gehn, his own father. Gehn has appointed himself as the one to rule the Age of Riven, and has driven his world to collapse. Now he holds Catherine hostage on Riven, hoping that his son will restore the book link to the Age and free him from there. The Stranger is requested by Atrus to travel to Riven and find a way to rescue Catherine.</p><p><em>Riven</em> is a sequel to  Myst, and is very similar to its predecessor in gameplay style, controls, and visual presentation. The game world is presented as a series of computer-generated still screens; the player explores it in a point-and-click fashion. Interaction with the environment is possible only when said environment is highlighted as a \"hot spot\", and is also performed by simple clicking. Like its predecessor, <em>Riven</em> is heavy on puzzles, which rarely include using inventory items, but usually involve understanding and manipulating the complex environments and machinery of the game world.</p>"},{"name":"Riven: The Sequel to Myst (Disc 5)","year":1997,"developer":"Cyan Worlds, Inc.","url":"psx-chd-roms-r/Riven%20-%20The%20Sequel%20to%20Myst%20%28Europe%29%20%28Disc%205%29.chd","filesize":557738180,"score":8.1,"genres":"Adventure > 1st-person > Puzzle elements > Fantasy > Steampunk","desc":"<p>After the Stranger has rescued Atrus, the master of \"linking books\", from the imprisonment caused by his sons, a new task awaits the hero. Atrus's wife, Catherine, has been taken by Gehn, his own father. Gehn has appointed himself as the one to rule the Age of Riven, and has driven his world to collapse. Now he holds Catherine hostage on Riven, hoping that his son will restore the book link to the Age and free him from there. The Stranger is requested by Atrus to travel to Riven and find a way to rescue Catherine.</p><p><em>Riven</em> is a sequel to  Myst, and is very similar to its predecessor in gameplay style, controls, and visual presentation. The game world is presented as a series of computer-generated still screens; the player explores it in a point-and-click fashion. Interaction with the environment is possible only when said environment is highlighted as a \"hot spot\", and is also performed by simple clicking. Like its predecessor, <em>Riven</em> is heavy on puzzles, which rarely include using inventory items, but usually involve understanding and manipulating the complex environments and machinery of the game world.</p>"},{"name":"RMJ: The Mystery Hospital (Disc 1)","year":1997,"developer":"System Sacom","url":"psx-chd-roms-r/RMJ%20-%20The%20Mystery%20Hospital%20%28Japan%29%20%28Disc%201%29%20%28What%27s%20Going%20On%29.chd","filesize":409470311,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Sci-fi / futuristic > Detective / mystery > Horror","desc":"<p><em>R?MJ</em> is an interactive movie horror adventure game with full voice-acting and without subtitles to feel more like a movie. The story takes place in a summer of 1999, as a large explosion occurred in a General Hospital. Due to a deadly virus being released, the hospital is on lockdown, and you are left with no way out. The player assumes the role of Hajime, who after going to visit his best friend, finds himself trapped in a hospital along with two friends, Ryou and Tomowo, and a rookie nurse, Aya. The gameplay consists of exploring locations in the hospital by moving in a certain direction (forward, turn left or right, or turn back) which uses pre-rendered animation for every movement from one point to another. Certain locations can be zoomed in to give you more details or to pick up an item. Your companions will often give you some comments while you explore, most of which may seem a selection of five sentences that are randomly selected. The game also features the use of player's senses (sight, hearing, touch, smell and taste) which must be used at key locations and events in order to progress the game.</p>"},{"name":"RMJ: The Mystery Hospital (Disc 2)","year":1997,"developer":"System Sacom","url":"psx-chd-roms-r/RMJ%20-%20The%20Mystery%20Hospital%20%28Japan%29%20%28Disc%202%29%20%28Fears%20Behind%29.chd","filesize":416937066,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Sci-fi / futuristic > Detective / mystery > Horror","desc":"<p><em>R?MJ</em> is an interactive movie horror adventure game with full voice-acting and without subtitles to feel more like a movie. The story takes place in a summer of 1999, as a large explosion occurred in a General Hospital. Due to a deadly virus being released, the hospital is on lockdown, and you are left with no way out. The player assumes the role of Hajime, who after going to visit his best friend, finds himself trapped in a hospital along with two friends, Ryou and Tomowo, and a rookie nurse, Aya. The gameplay consists of exploring locations in the hospital by moving in a certain direction (forward, turn left or right, or turn back) which uses pre-rendered animation for every movement from one point to another. Certain locations can be zoomed in to give you more details or to pick up an item. Your companions will often give you some comments while you explore, most of which may seem a selection of five sentences that are randomly selected. The game also features the use of player's senses (sight, hearing, touch, smell and taste) which must be used at key locations and events in order to progress the game.</p>"},{"name":"RMJ: The Mystery Hospital (Disc 3)","year":1997,"developer":"System Sacom","url":"psx-chd-roms-r/RMJ%20-%20The%20Mystery%20Hospital%20-%20Second%20Attack%20Sample%20CD-ROM%20%28Japan%29.chd","filesize":97983346,"score":"","genres":"Adventure > 1st-person > Full Motion Video (FMV) > Sci-fi / futuristic > Detective / mystery > Horror","desc":"<p><em>R?MJ</em> is an interactive movie horror adventure game with full voice-acting and without subtitles to feel more like a movie. The story takes place in a summer of 1999, as a large explosion occurred in a General Hospital. Due to a deadly virus being released, the hospital is on lockdown, and you are left with no way out. The player assumes the role of Hajime, who after going to visit his best friend, finds himself trapped in a hospital along with two friends, Ryou and Tomowo, and a rookie nurse, Aya. The gameplay consists of exploring locations in the hospital by moving in a certain direction (forward, turn left or right, or turn back) which uses pre-rendered animation for every movement from one point to another. Certain locations can be zoomed in to give you more details or to pick up an item. Your companions will often give you some comments while you explore, most of which may seem a selection of five sentences that are randomly selected. The game also features the use of player's senses (sight, hearing, touch, smell and taste) which must be used at key locations and events in order to progress the game.</p>"},{"name":"Road Rage","year":1996,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"psx-chd-roms-r/Road%20Rage%20%28Europe%29.chd","filesize":302861973,"score":"","genres":"Racing / Driving > Behind view > Direct control > Hovercraft > Sci-fi / futuristic","desc":"<p>ROAD RAGE<br>Become a real speed king....<br><br>Imagine the incredible feeling of floating on air in a state-of-the-art hovercraft. Now imagine travelling at the speed of sound, manoeuvring through challenging race courses, and experiencing all this action in unbelievable 3D environments. Do you have what it takes to race against the best? To push your body and your machine to their limits? To become the speed king? Road Rage offers PlayStation™ owners eight vehicles, four unique tracks, and four speed classes plus the option to save your best race on a Memory Card then race against yourself.</p>"},{"name":"Road Rash","year":1995,"developer":"Papyrus Design Group, Inc.","url":"psx-chd-roms-r/Road%20Rash%20%28Europe%29.chd","filesize":439822068,"score":7.7,"genres":"Action > Racing / Driving > Behind view > Motorcycle > Street racing","desc":"<p>Road Rash is a remake of the original from the early nineties. For those who've not played the original, you're competing against thirteen other \"Road Rashers\" who will stop at nothing to win. During the race, you have two options available: you can either do your best to cross the finish line or use your weapon to bring the Rashers to the ground if they give you trouble. Do the latter, and your opponents will do the same to you during the next race.</p><p>There are five circuits to race: The City, The Peninsula, Pacific Highway, Sierra Nevada, and Napa Valley. Some of these circuits are dangerous. In addition to the obstacles and traffic you encounter along the way, there are also police motorcycle units that will arrest you if you happen to crash or stop near them. Get caught, and you'll have to pay a fine to get in any more races. If you crash too often, your bike will be wrecked, forcing you to pay for damages. The amount you have to pay depends on the bike you are riding. Once you have completed the first five circuits, you have to race them again another four times - but at a much higher difficulty. Manage to win all five circuits on all levels, and you win the Road Rash cup!</p><p>There are about five bikes to choose from, divided into three groups; Rat, Sport, and Super. You start the first level with a Rat bike. As you progress through the levels it will become increasingly important to pick bikes from different classes.</p><p>If you have no plans to win the Road Rash cup, you can choose the game's Thrash mode. The difference between this and the other mode is that there is no money involved (i.e., you are not allowed to buy bikes), and you're competing against fourteen opponents. And if you wreck your bike or get busted, you have to start all over again. Regardless of the mode you pick, you will always start in the last place.</p><p>The remake also contains FMV movies that usually depict the outcome of the races, as well as limited songs performed by various recording artists, including Soundgarden, Therapy?, Monster Magnet, and Swervedriver. These songs can be changed on-the-fly via the game's options menu.</p>"},{"name":"Road Rash 3-D","year":1998,"developer":"Electronic Arts, Inc.","url":"psx-chd-roms-r/Road%20Rash%203D%20%28Europe%29.chd","filesize":384282680,"score":6.9,"genres":"Action > Racing / Driving > Behind view > Direct control > Motorcycle > Street racing","desc":"<p><em>Road Rash 3-D</em> is a 3D installment of the motorcycle racing game in which participants utilize violent tactics to win. The gameplay is quite similar to that of the previous games: the player-controlled racer must avoid oncoming cars and obstacles on the road, beating opponents with metal pipes, crowbars, and other assorted damage-inflicting tools. The player wins money upon the completion of the race, and eventually can afford to buy better bikes. The courses are formed from connecting points in an environmental grid, which means that the player can utilize different stretches of courses to advance.</p>"},{"name":"Road Rash: Jailbreak","year":2000,"developer":"Electronic Arts, Inc.","url":"psx-chd-roms-r/Road%20Rash%20-%20Jailbreak%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":332765395,"score":7,"genres":"Action > Racing / Driving > Behind view > Motorcycle > Street racing","desc":"<p>Spaz, the greatest rasher ever, is in prision and you need to get him out!. Once again Road Rash the game that mixes fast paced motorbike racing with hardcore fighting is back (and once again in full 3-D!)</p>"},{"name":"Roadsters","year":2000,"developer":"Titus Interactive, S.A.","url":"psx-chd-roms-r/Roadsters%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":234217762,"score":6.3,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Licensed","desc":"<p><em>Roadsters</em> is a car racing game that features both licensed cars from manufacturers like Mitsubishi, Alfa Romeo, Lotus, etc., and unlicensed cars from imaginary manufacturers that are based and bear great resemblance to their equivalent, real car models. The game has 8 racers and 34 cars from which you can choose from and 4 modes in total:* <strong>Roadster Trophy</strong> – The player starts by selecting one of the available racers and is given a sum of money that must be used to acquire a car. There are 3 divisions in which the player can compete on with the 3rd being of the easiest difficulty and requiring less money to participate; the 1st being the most difficult one and needing a higher amount of money in order to participate. More money can be earned by winning the races and that in turn allows to buy new cars or upgrade the ones that are already in possession.</p><ul><li><p><strong>Multi-Player</strong> – Multi-player mode supports up to 2 human players that can compete in any of the available circuits with 4 more CPU controlled racers. The mode allows for either vertical or horizontal split screen. </p></li><li><p><strong>Quick Race</strong> – In Quick Race the player can select the racer, car, circuit and weather conditions, and race against 7 more CPU controlled players.</p></li><li><p><strong>Time Trial</strong> – Like Quick Race mode, the player can also select here the racer, car, circuit and weather conditions but without the competition of the other modes, the player races against time for as many laps as the player wants.</p></li></ul>"},{"name":"Robbit Mon Dieu","year":1999,"developer":"Sugar & Rockets, Inc.","url":"psx-chd-roms-r/Robbit%20mon%20Dieu%20%28Japan%29.chd","filesize":359256936,"score":"","genres":"Action > 1st-person > Platform","desc":"<p><em>Robbit Mon Dieu</em>, sometimes unofficially called \"Jumping Flash! 3\", is the third game in the <em>Jumping Flash</em> series. It is a 3D platform game where you control Robbit, a jumping robot rabbit.</p><p>Instead of finding all the hidden Muumuus like in the previous games, each level now requires you to complete a certain task, explained at the start of the level. You have to bring a guy to his house, jump through hoops, catch frogs, run obstacle courses etc. Each of the levels take significantly less time to complete when compared to the previous Jumping Flash games.</p>"},{"name":"Robin Hood: The Siege","year":2004,"developer":"Ivolgamus UAB","url":"psx-chd-roms-r/Robin%20Hood%20-%20The%20Siege%20%28Europe%29.chd","filesize":106459720,"score":"","genres":"Action > 1st-person > Shooter > Medieval","desc":"<p><em>Robin Hood: The Siege</em> is a single player shooter game played from a first person perspective. The player will take on the role of Robin Hood whose house has been burnt down by the Normans and now hides in Sherwood forest. It’s now up to the player to fight the men of the sheriff of Nottingham.</p><p>The game offers several levels in which soldiers of the sheriff run across the screen and have to be shot with arrows by moving the cursor across the screen. Some of the soldiers shoot back at the player with arrows. Levels take place on open fields, in the town and inside the castle.</p>"},{"name":"Robo Pit","year":1996,"developer":"Altron Corporation","url":"psx-chd-roms-r/Robo%20Pit%20%28USA%29.chd","filesize":218860010,"score":6.4,"genres":"Action > Side view > Fighting > Sci-fi / futuristic","desc":"<p>Robo Pit is an arena fighter, plain and simple. Well, maybe not so simple. When you start your game, you have to build your mechanical gladiator; choosing the color, body, eyes and legs. While most of your starting choices are purely cosmetic, the legs you choose do slightly affect your game by changing the speed and mobility of your fighter, as well as its special attack.</p><p>Once you've created your robotic brawler, it's time to start climbing the ranks. To progress, you have to fight the robot that's occupying the rank above yours. Once you beat them, you get to take an arm and then move up. The game continues on in this fashion until you've bested all of the other combatants. However, a few curve-balls are thrown your way as you climb the ladder. For starters, there are several different arms you can acquire; from swords and shields to cannons and lasers, and the more you use them, the faster and more effective (i.e. damaging) they are. On top of that, even so often a sort of \"boss\" robot is put in your way. These \"bosses\" use special weapons that only they have access to. Until you pound them into scrap and take them, that is. These weapons can be incredibly powerful if you stick with them, making the rest of the fighters, save number one, a breeze. As an added bonus, you can even save your cyber-combatant to a memory card and bring it to a friend's house for some one-on-one let's-see-who-has-the-best-robot fighting goodness!</p><p>The arenas themselves are fairly basic, but they are varied, offering up different layout and obstacles to take cover behind or use to get the drop on your opponent. They also have ledges, and like most fighting games a ring-out means an instant loss. As for the fighting, it's simple, but effective. Square and circle attack with the left and right arms, X jumps and triangle triggers your special (which has to charge of course). Of course different weapons have different ranges and timing, which will also improve the more you use them.</p>"},{"name":"Robo-Pit 2","year":1997,"developer":"Altron Corporation","url":"psx-chd-roms-r/Robo%20Pit%202%20%28USA%29.chd","filesize":74522496,"score":"","genres":"Action > Behind view > Fighting > Sci-fi / futuristic","desc":"<p><em>Robo-Pit 2</em> is, like its predecessor, a fighting game where robots battle it out in an arena. The game starts with the player creating his own robot. The player can use 146 different parts and 72 colours to create a robot of his own taste. The different body parts that can be customized are head, body, arms and legs. Each body part has its own attack and durability ratings that determines how the robot will fare in combat. </p><p>The battles takes place in the Coliseum. The Coliseum consists of a number of rooms each hosting an enemy robot that the player has to defeat to unlock more rooms. Defeating an enemy can also grant the player new body parts as well as experience and skill points. The player can move around his robot from a third person perspective and launch different attacks such as jabs, straight, hook and upper attacks. With good timing it's also possible to link attacks together. A special attack can be executed when the SP gauge is full. There's also a guard impact command which allows the player to repel the enemy attack. The player has a booster which allows the robot to fly as long as the boost gauge lasts. A battle ends when one of the combatants has his energy reduced to zero.</p>"},{"name":"Robotron X","year":1996,"developer":"Player 1","url":"psx-chd-roms-r/Robotron%20X%20%28Europe%29.chd","filesize":435361151,"score":6.8,"genres":"Action > Isometric > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The arcade classic is taken to the next level, this time in 3D.  The super-enhanced hero Ugene is once again called into action to save the last human family against the hordes of relentless Robotrons.  Battle through 100 different levels, gaining new power-ups and abilities as Ugene survives wave after wave of the unrelenting hordes.  While Ugene may face the familiar Robotrons, there will be new additions and tricks that the killer robots will use against the last surviving human family.  Ugene must protect them at all cost while racking up the highest possible score!</p>"},{"name":"Rock 'em Sock 'em Robots Arena","year":2000,"developer":"Paradox Development","url":"psx-chd-roms-r/Rock%20%27Em%20Sock%20%27Em%20Robots%20Arena%20%28USA%29.chd","filesize":274448159,"score":"","genres":"Action > 3rd-person (Other) > Side view > Fighting > Mecha / giant robot > Licensed","desc":"<p>With the revival of the old toyline comes a fighting game bearing the same name. Rock 'em Sock 'em Robots features the ability to change the left and right arms, legs and torso of your robot in order to advance your fighter to the championship leagues. </p><p>Win prize money by defeating other robots and buy new parts as well as unlock new parts and secret characters.</p>"},{"name":"Rock'n Riders","year":1999,"developer":"PIXY Corporation"},{"name":"Rock'n Riders (Limited Edition)","year":1999,"developer":""},{"name":"Rocket Power: Team Rocket Rescue","year":2001,"developer":"Darkblack Ltd"},{"name":"Rockman Complete Works: Rockman","year":1999,"developer":"Capcom Co., Ltd."},{"name":"Rogue Trip: Vacation 2012","year":1998,"developer":"SingleTrac Entertainment Technologies, Inc.","url":"psx-chd-roms-r/Rogue%20Trip%20-%20Vacation%202012%20%28Europe%29.chd","filesize":515734310,"score":7.5,"genres":"Action > Racing / Driving > 3rd-person (Other) > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Self billed as the spiritual successor to \"Car Combat\", Rogue Trip puts the player in the role of a post-apocalyptic cab driver competing to take a tourist to \"photo-op\" locations.  Drivers use one of 16 custom cars and a variety of weapons to battle for a single passenger who (when driven to specific points on the map) provides money for more weapons and repairs.  Each level is filled with hazards to avoid (such as 747 airplanes landing around you), power ups, and hostile opponents trying to steal your fare.  Supporting the vehicular mayhem is a pulse pounding soundtrack by The Mighty Mighty BossTones and Nashville Pussy.</p>"},{"name":"Rohga: Armor Force","year":1996,"developer":"Data East Corporation"},{"name":"Roland Garros French Open 2001","year":2001,"developer":"Spark Entertainment SARL","url":"psx-chd-roms-r/Roland%20Garros%20French%20Open%202001%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":49544177,"score":5.7,"genres":"Sports > 3rd-person (Other) > Tennis > Licensed","desc":"<p>3D tennis Simulation game based on the Roland Garros franchise. Featuring: - Multiplayer mode up to 4 player on the same PC. - Full motion captured animations. - 4 tournaments including the Official Roland Garros French Open and the Official Us Open tournament, - 16 courts, 4 for each tournament with its particular surface (clay, grass, synthetic, cement)- A Training mode - An exibition mode to battle against the cpu or human opponents in the configuration you like (courts, number of games and sets).- 32 players and 32 racquets - Single and double play, with all possible combinations of human and CPU players.- Included an encyclopedia on the history of the Roland Garros French Open Tournament. (PC Only)- New IA, with strong opponent. - New replay with special visual effect- new particle system with dust, glows, ball trails and motion blur.</p>"},{"name":"Roll Away","year":1998,"developer":"Game Design Sweden AB","url":"psx-chd-roms-r/Roll%20Away%20%28USA%29.chd","filesize":144567373,"score":8,"genres":"Action > Puzzle > Behind view > Platform > Direct control","desc":"<p>In <em>Roll Away</em>, the player controls a beach ball navigating a series of cubic-grid labyrinths suspended high above various locales. The objective of each level is to collect all of the keys scattered throughout to unlock the exit. The player can also collect coins and gems which increase their score.</p><p>The direction of gravity relative to an object is always downward towards the surface which the object is rested on or the ball is jumping towards. When the ball reaches a point where the surface tilts upward or downward, such as the end of a pier or on a single block, the ball can move along this change in direction and relative gravity will shift accordingly, meaning that the beach ball is always on the surface facing up and objects do not fall from their positions on the other surfaces.</p><p>There are also obstacles in many of the levels, such as spikes protruding from the floor, Captivators which move around a plane and capture the ball on contact, as well as ice blocks, which propel the ball forward uncontrollably, and blocks which collapse when the ball rolls over them to leave empty space where they stood. There is a fixed time limit which is constant across every level, which the player can reverse by collecting an hourglass. Red and yellow pills speed up the timer for a few seconds while slowing the balls movement, while blue and purple pills make the ball bounce uncontrollably and stop it from shifting gravity. The player can also fail a level by making the ball jump into empty space.</p><p>In addition to coins and gems, each of the main levels contains a fruit, which changes depending on how many the player has collected. When the player collects five fruits, they are transported to a bonus level where ball must touch every block, their score only counting if they succeed. There also bonus levels in secret exits on some levels which function as normal levels but once again do not count a failed score.</p><p>The single player portion of the game consists of Arcade mode, which involves racking up a high score and saving progress every 5 levels, and Time Trial mode, where the player must complete each level in a certain amount of time and save points come every 15 levels and there are no bonus levels. The player's score/time for a level is added to the total on completing the level, and taken away on failure. If the players score in Arcade mode falls below zero, or above zero in Time Trial, then they have to retry from their last save.</p><p>The multiplayer modes consist of Copycat, where each player must copy exactly the other players movements and adding a new step each turn, and Time Trial, where the two players compete for faster completion times.</p>"},{"name":"Rollcage","year":1999,"developer":"Attention to Detail Limited","url":"psx-chd-roms-r/Rollcage%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":441498481,"score":7.6,"genres":"Action > Racing / Driving > 3rd-person (Other) > Arcade > Shooter","desc":"<p>Rollcage is a fast, furious 3D racing game from Psygnosis, combining elements from Death Rally with elements from Bullfrog's classic Hi Octane: Race five other drivers in an immersive 3D environment while shooting at your peers and avoiding their retaliation.</p><p>You have a wide selection of tracks and cars, along with options for multiplayer gaming and a vast array of configuration options. Cars can drive up walls, flip over, and continue driving. This makes for a very quick and fluid gameplay unlike any other at the time of this game's release.</p>"},{"name":"Rollcage Stage II","year":2000,"developer":"ATD","url":"psx-chd-roms-r/Rollcage%20Stage%20II%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":374318285,"score":7.6,"genres":"Racing / Driving > Behind view > Shooter > Direct control > Track racing > Vehicular combat > Sci-fi / futuristic","desc":"<p>This sequel to <em>Rollcage</em> can be considered as <em>Wipeout</em> on wheels. The game allows you to power your vehicle down tunnels at blistering speeds, riding upside down on the roof if need be, and blast your fellow competitors to smithereens!</p><p>There are new and improved weapons - including the ability to double up your arsenal; picking up the same weapon twice improves its power/abilities. There are 12 racing modes - not all of which are available at the start - and many hidden bonuses, all of which can be unlocked throughout the game. The game has new physics and vehicle handling, and uses shorter tracks than its predecessor.</p>"},{"name":"Romance of the Three Kingdoms II","year":1998,"developer":"KOEI Co., Ltd."},{"name":"Romance of the Three Kingdoms III: Dragon of Destiny","year":2001,"developer":"KOEI Co., Ltd."},{"name":"Romance of the Three Kingdoms IV with Power Up Kit","year":1997,"developer":"KOEI Co., Ltd."},{"name":"Romance of the Three Kingdoms IV: Wall of Fire","year":1995,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-r/Romance%20of%20the%20Three%20Kingdoms%20IV%20-%20Wall%20of%20Fire%20%28USA%29.chd","filesize":421884941,"score":7,"genres":"Strategy > Top-down > Isometric > Turn-based > China (Ancient / Imperial) > Historical events","desc":"<p>The Three Kingdoms era of Chinese history is the setting for this strategic war game. Select one of 38 leaders and guide your people to power by military or diplomatic means in an isometrically viewed world. Military tactics such as well-placed taunts and deliberate enemy confusion are on offer. Weaponry includes catapults and automatic-firing crossbows.</p>"},{"name":"Romance of the Three Kingdoms V with Power Up Kit","year":1998,"developer":"KOEI Co., Ltd."},{"name":"Romance of the Three Kingdoms VI with Power Up Kit","year":1999,"developer":"KOEI Co., Ltd."},{"name":"Romance of the Three Kingdoms VI: Awakening of the Dragon","year":1998,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-r/Romance%20of%20the%20Three%20Kingdoms%20VI%20-%20Awakening%20of%20the%20Dragon%20%28USA%29.chd","filesize":123232184,"score":7.5,"genres":"Strategy > Top-down > Isometric > Turn-based > China (Ancient / Imperial) > Historical events","desc":"<p>The <em>Romance of the Three Kingdoms</em> series returns for its sixth installment. As the leader of your own nation in war torn ancient China, it is up to you to unify the whole land. To do this, you'll need to build, manage and control your cities while interacting with and directing the actions of hundreds of different characters. Through military and domestic management, you can unify China and be the Emperor!</p>"},{"name":"Romance of the Three Kingdoms VII","year":2001,"developer":"Koei Tecmo Games Co., Ltd."},{"name":"Romance wa Tsurugi no Kagayaki II: Gin no Niji o Sagashite (Disc 1)","year":2002,"developer":"FairyTale","url":"psx-chd-roms-r/Romance%20wa%20Tsurugi%20no%20Kagayaki%20II%20-%20Gin%20no%20Niji%20o%20Sagashite%20%28Japan%29%20%28Disc%201%29%20%28Shokai%20Genteiban%29.chd","filesize":473376064,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>The events of this game take place a few years after those described in the  first game. The new hero is Keith, a young owner of a restaurant in the capital city of Barran. However, he also has a second profession: thief. He only steals from evil people, following the Robin Hood-like tradition of his father, who dedicated years of his life to uncover the secret of a mysterious dungeon known as the Tower of Daidalos. Keith wants to follow in his father's footsteps and to unravel the mystery of the tower. One day he accidentally meets a beautiful young girl who has lost a precious gem. The charmed hero swears he would find it and bring it back. But he doesn't know that the disappearance of the gem is closely connected to the mystery of the Tower of Daidalos...</p><p><em>Romance wa Tsurugi no Kagayaki II</em> shares many elements with its predecessor. While the exploration in the game is done in traditional Japanese RPG fashion, the battles resemble those of a turn-based strategy game, since the characters can move on the battle screen and can only attack when enemy is within the range of their weapons. There are no random battles in the game; all the enemies are visible on screen.</p><p>Like in the first game, the player is able to control the growth of characters, similarly to a Western RPG. Experience points can be accumulated, and leveling up is done manually by the player. Different character classes require different amount of XP to raise a corresponding attribute (for example, it costs less to raise a mage's magic power than stamina).</p><p>It is possible to imbue weapons with magical items to increase their powers and learn special weapon-related skills. There is also a dating system present in the game. The player can buy items for the female party members to increase their affection, and take them on specific sub-quests. This also influences the ending of the game.</p><p>Unlike the first game, <em>Romance wa Tsurugi no Kagayaki II</em> contains no nudity or sexual scenes, even though there is plenty of sexual innuendo in conversations and events.</p>"},{"name":"Romance wa Tsurugi no Kagayaki II: Gin no Niji o Sagashite (Disc 2)","year":2002,"developer":"FairyTale","url":"psx-chd-roms-r/Romance%20wa%20Tsurugi%20no%20Kagayaki%20II%20-%20Gin%20no%20Niji%20o%20Sagashite%20%28Japan%29%20%28Disc%202%29%20%28Shokai%20Genteiban%29.chd","filesize":476675887,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>The events of this game take place a few years after those described in the  first game. The new hero is Keith, a young owner of a restaurant in the capital city of Barran. However, he also has a second profession: thief. He only steals from evil people, following the Robin Hood-like tradition of his father, who dedicated years of his life to uncover the secret of a mysterious dungeon known as the Tower of Daidalos. Keith wants to follow in his father's footsteps and to unravel the mystery of the tower. One day he accidentally meets a beautiful young girl who has lost a precious gem. The charmed hero swears he would find it and bring it back. But he doesn't know that the disappearance of the gem is closely connected to the mystery of the Tower of Daidalos...</p><p><em>Romance wa Tsurugi no Kagayaki II</em> shares many elements with its predecessor. While the exploration in the game is done in traditional Japanese RPG fashion, the battles resemble those of a turn-based strategy game, since the characters can move on the battle screen and can only attack when enemy is within the range of their weapons. There are no random battles in the game; all the enemies are visible on screen.</p><p>Like in the first game, the player is able to control the growth of characters, similarly to a Western RPG. Experience points can be accumulated, and leveling up is done manually by the player. Different character classes require different amount of XP to raise a corresponding attribute (for example, it costs less to raise a mage's magic power than stamina).</p><p>It is possible to imbue weapons with magical items to increase their powers and learn special weapon-related skills. There is also a dating system present in the game. The player can buy items for the female party members to increase their affection, and take them on specific sub-quests. This also influences the ending of the game.</p><p>Unlike the first game, <em>Romance wa Tsurugi no Kagayaki II</em> contains no nudity or sexual scenes, even though there is plenty of sexual innuendo in conversations and events.</p>"},{"name":"Ronaldo V-Football","year":2000,"developer":"Power and Magic Development","url":"psx-chd-roms-r/Ronaldo%20V-Football%20%28Europe%29%20%28En%2CFr%2CNl%2CSv%29.chd","filesize":407736518,"score":7.1,"genres":"Simulation > Sports > Diagonal-down > Arcade > Football (European) / Soccer > Licensed","desc":"<p>In this football game endorsed by the Brazilian superstar Ronaldo Nazário de Lima, 64 International teams (some featuring real names, others not) are available to play in game modes: Exhibition, Arcade Cup (a 16 team knockout where the player has three chances to beat all teams, with no option to save between games), Resistance (a five division challenge where players must beat 8 other teams to climb to the next rank, Tournaments (continental championships, available in both tournament and league models, if the player wins faces national teams in a FIFA Confederations Cup styled competition) and the V-Football Cup, the World Cup of this game. As a bonus of winning competitions, all-star teams are unlocked. 15 stadiums (some based on real locations) are available to play in, with setting for day and night, as well as clear, rainy or foggy.</p><p>Gameplay is simple and works mostly around the four face buttons: Triangle sprints, Cross makes a low pass and a regular tackle on defense, Square lobs and crosses the ball (depending on the position) and makes a strong tackle on defense and circle shoots on goal and makes a sliding tackle on the player. The first row of shoulder buttons allow complex passes, such as the through-pass (R1) and the one-two (L1 + pass). There are three pad configurations to choose from.The player also acts as the manager, with options to change the formation, and to call several sets in-play, such as offside traps and the number of players in a free-kick wall.</p>"},{"name":"Rosco McQueen: Firefighter Extreme","year":1997,"developer":"Slippery Snake","url":"psx-chd-roms-r/Rosco%20McQueen%20Firefighter%20Extreme%20%28USA%29.chd","filesize":47371952,"score":6.9,"genres":"Action > 3rd-person (Other) > Puzzle elements > Sci-fi / futuristic","desc":"<p>The world's tallest building is burning down, and it's up to Rosco to save the day! It seems that the evil Sylvester T. Square and his robotic minions are responsible not only for the fire, but they've taken hostages as well.</p><p>Guide Rosco through the towering inferno as you rescue the innocent, squelch the fire, knock off the robots, and stop old Square once and for all. There are 15 blazing levels of action to work through, each more terrifying than the last. You'll need to watch out for a host of hazards including backdrafts, dangerous smoke, and electrical fires. With a dozen unique hazards in all, the robots are only the beginning of your problems!</p><p>Of course, you'll have your share of special weapons and power-ups to help give you a boost: Water canisters, a Super Hose, food items, and CO2 cartridges are just a few of the items you'll have on hand. Just like any fire fighter worth his salt, Rosco always has his axe on hand too, which comes in handy against menacing robots. Make sure to keep an eye on the temperature, too; if the heat gets too high, your game is over.</p>"},{"name":"Roswell Conspiracies: Aliens, Myths & Legends","year":2001,"developer":"Red Lemon Studios","url":"psx-chd-roms-r/Roswell%20Conspiracies%20-%20Aliens%2C%20Myths%20%26%20Legends%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":250553503,"score":6.4,"genres":"Action > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p><em>Roswell Conspiracies: Aliens, Myths &amp; Legends</em> is a game based on the animated TV series of the same name, basically <em>X-Files</em> for kids. The player takes the role of Nick Logan who has the unique ability to see through alien disguises and accompanies him during his work: catching aliens to save the world. The gameplay principle is simple: the player walks through 15 levels with a fixed camera perspective and shoots everything he sees, e.g. werewolves or vampires. To do this he uses one of the many weapons he finds - all of them have unlimited ammo but have to regenerate energy during pauses of fire. But the player doesn't kill his enemies for good: He has to catch them with his alien trap (which is a matter of pressing one button) or they regenerate.</p><p>Besides the shooting the game also features its share of puzzles, e.g. activating a mechanism, and bosses. There is also a mini game which comes into place whenever Logan has to disable a bomb or open a lock: basically a series of quick time events where the player has to press the correct button with the right timing. The levels are divided into five areas: London, Ireland, San Francisco, a Maya temple and Roswell.</p>"},{"name":"Rox","year":1998,"developer":"Altron Corporation","url":"psx-chd-roms-r/Rox%20%28Europe%29.chd","filesize":31522396,"score":"","genres":"Puzzle > Falling block puzzle","desc":"<p>Rox is a falling block/matching game, but with a twist. Each of the blocks is a dice which has a number on it. Instead of only matching colors, in this game both the colors and numbers matter.</p><p>In order to remove dice two end numbers must be the same, with that amount of other dice in between them. For instance if two dice are ones, there must be one die in between them. If both of the end dice are the same color, all of the dice in between will also be erased, however if they are two different colors than only the end dice will be erased.</p>"},{"name":"RPG Maker","year":1997,"developer":"Kuusoukagaku Corp.","url":"psx-chd-roms-r/RPG%20Maker%20%28USA%29.chd","filesize":41853583,"score":7.4,"genres":"Role-playing (RPG) > Top-down > Anime / Manga","desc":"<p><em>RPG Maker</em> is a game that lets you create role-playing games (RPGs). You control everything from creating the maps/levels, character, abilities, spells, plot, events, monsters, etc. Once you create your game, you can save it to a memory card(s). Anyone who has <em>RPG Maker</em> can play your game. Also included is a sample game to show the variety of things you can do in your game.</p>"},{"name":"RTL Skispringen 2002","year":2001,"developer":"VCC Entertainment GmbH & Co. KG","url":"psx-chd-roms-r/RTL%20Skispringen%202002%20%28Germany%29%20%28En%2CDe%29.chd","filesize":75027578,"score":7,"genres":"Sports > 3rd-person (Other) > Snowboarding / skiing > Licensed","desc":"<p>A Skijumping game in license with a german broadcasting station. You have to train and manage your jumper through the skijumping season 2001/2002. The game is a sequel in a series of skijumping games.</p>"},{"name":"Rugrats in Paris: The Movie","year":2000,"developer":"Avalanche Software LLC"},{"name":"Rugrats: Search for Reptar","year":1998,"developer":"n-Space, Inc."},{"name":"Rugrats: Studio Tour","year":1999,"developer":"n-Space, Inc."},{"name":"Rugrats: Totally Angelica","year":2001,"developer":"ART Co.,Ltd."},{"name":"Runabout 2","year":1999,"developer":"Graphic Research Co., Ltd.","url":"psx-chd-roms-r/Runabout%202%20%28Europe%29.chd","filesize":167589180,"score":"","genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade","desc":"<p>In the sequel to Felony 11-79, you are hired by a secret organization which asks you to do certain tasks in a variety of environments, ranging from a downtown city to a desert. Like the original, you can drive around like a maniac and smash into everything you see. You receive e-mail from various contacts, who give out advice on how to do the mission. There are a total of 31 vehicles ranging from a pickup truck to a motorcycle, and many of objects to unlock.</p>"},{"name":"Rung Rung: The Wonderful Wizard of Oz - Another World","year":2000,"developer":"Affect Co.,Ltd"},{"name":"Running High","year":1997,"developer":"System Sacom","url":"psx-chd-roms-r/Running%20High%20%28Japan%29.chd","filesize":410723842,"score":"","genres":"Action > Racing / Driving > Behind view > Anime / Manga > Sci-fi / futuristic","desc":"<p>In the distant future of the year 2001, the mind-machine interface has become a reality and the ability to control machines through the power of thought is now possible. Many types of machines were created using this technology, including powered suits called \"component muscle\" that give the wearer incredible running speed. However, because of misuse of this technology, it was outlawed for general use and is now reserved only for military purposes...and for a famous sports tournament called Running High.</p><p><em>Running High</em> is a high-speed futuristic foot-race game for one player. There are six racers to choose from, and three tracks (with a fourth unlocked after clearing the first three). Each racer has different abilities, and all of them will play dirty in trying to be the first to the finish. You can attack the other racers with punches, knock them down, and vault over them.</p>"},{"name":"Running Wild","year":1998,"developer":"Blue Shift, Inc.","url":"psx-chd-roms-r/Running%20Wild%20%28Europe%29.chd","filesize":43800934,"score":6.2,"genres":"Racing / Driving > 1st-person > Behind view > Fantasy","desc":"<p>This original take on racing sets you up as a bipedal animal, jumping over all sorts of obstacles in an attempt to speed past your wild competition. </p><p>Each of the game's six tracks is set in a vastly different locale, presenting unique challenges for every animal on the roster. </p><p>Choose from six beastly characters, each with a different skill set: The elephant is the strongest, the bull is the most agile, and the zebra is the fastest. Hidden boss characters can be unlocked in the game's Challenge mode, while Time Trial allows you to race against your own best time.</p><p>There's a wide variety of speed-ups and power-ups out there, and you'll need them to get faster, bigger, or more powerful. Who needs combat cars when you can race jungle animals?</p>"},{"name":"Rupupu Cube: Lup Salad","year":1996,"developer":"Fupac"},{"name":"Rurouni Kenshin - Meiji Kenkaku Romantan - Ishin Gekitou Hen","year":1996,"developer":"Zoom, Inc.","url":"psx-chd-roms-r/Rurouni%20Kenshin%20-%20Meiji%20Kenkaku%20Romantan%20-%20Ishin%20Gekitou%20Hen%20%28Japan%29.chd","filesize":361906175,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Martial arts > Licensed","desc":"<p><em>Rurouni Kenshin: Ishin Gekitōhen</em> is a 3D fighting game (with a similar action timing to that of Tekken 1 &amp; 2) which reproduces the first story arc of the Rurouni Kenshin anime series. Here your fighting possibilities will depend of 4 buttons, two working for either high or low attacks (which pushed together will execute a special move) and the resting two for different kinds of blockings.</p><p>Game modes are history and VS. History mode begins with the battle against Sanosuke, who will join you once you defeat him until the end of the game, being an alternative character to Kenshin. After that point, your rivals are: Jine, Hyottoko, Hannya, Shikijou and Aoshi. VS Mode includes all the characters above mentioned as playable, with the option of unlocking a secret one (see Trivia).</p>"},{"name":"Rurouni Kenshin - Meiji Kenkaku Romantan - Juuyuushi Inbou Hen","year":1997,"developer":"Pandora Box","url":"psx-chd-roms-r/Rurouni%20Kenshin%20-%20Meiji%20Kenkaku%20Romantan%20-%20Juuyuushi%20Inbou%20Hen%20%28Japan%29%20%28Rev%201%29.chd","filesize":332440609,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p>This is an RPG with an alternative plot to the original Rurouni Kenshin series in which the main protagonist isn't Kenshin, but two characters created specially for that game: Hikaru (a young girl) and Hiziri (a young boy), both of them with a lost past, which key resides in the hands of Saitou and Aoshi, respectively. When starting the game you must choose which of the two you want to play with, having into account that according to your selection, the events and the people that will join your group would be different, as well as the main villains.</p><p>The story is quite simple, it focuses in the new Meiji Era after Shishio's saga, once we start playing we get in a fight that we can't win, but Kenshin will appear to save us. Then Kaoru will take us to the Dojo Kamiya, and there the adventure will begin. We must then recruit Kaoru and Yoshi, and start the search of Kenshin. The Meiji government is facing a serious threat and we must reunite 9 seals that will make new zones accessible; for that we must defeat 10 enemies. In that way Kenshin, Sanosuke, Aoshi and Saitou will join us to battle.</p>"},{"name":"Rush Hour","year":1997,"developer":"Clockwork Games Limited","url":"psx-chd-roms-r/Rush%20Hour%20%28USA%29.chd","filesize":409595185,"score":6,"genres":"Racing / Driving > Top-down > Arcade","desc":"<p><i>Rush Hour</i> is a racing game in the style of Ignition. The landscape as well the cars are in 3D, but the perspective is top down. There are no weapons in this game, just racing. You can drive 16 different sport cars and choose from 8 different tracks.</p>"},{"name":"Rushdown","year":1999,"developer":"Virtual Studio","url":"psx-chd-roms-r/Rushdown%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":314105275,"score":"","genres":"Racing / Driving > Sports > Snowboarding / skiing > Bike / bicycling > Naval / watercraft > Africa > Contemporary > Europe > Japan (Modern/Futuristic) > North America > South America","desc":"<p>Rushdown(TM) for the PlayStation is an exhilarating, high-speed, downhill racing game that challenges players in three extreme sports: mountain biking, kayaking and snowboarding.Set in real-time 3-D environments, Rushdown(TM) features white-knuckle action in authentic worldwide locales such as Africa, Europe, North and South America, Southeast Asia, and Japan.<br><br>Rushdown(TM) offers three different modes of play: Arcade, Championship, and Multiplayer. Players race against the clock in the Arcade mode to hone their skills for the ultimate showdown. On each continent, players race against the local champion in all three sports - victory must be achieved to advance. Challenge a friend in the Multiplayer modes, in which you can compete in either the arcade or championship events. Make sure to select your gear wisely, as having the right equipment for each situation may make the difference between glory and defeat.</p>"},{"name":"Ryuki Densyo: Dragoon","year":1997,"developer":"KSS","url":"psx-chd-roms-r/Ryuuki%20Denshou%20-%20Dragoon%20%28Japan%29.chd","filesize":185137742,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Fantasy","desc":"<p>After meeting the mysterious girl named Miu what is the fate for Sedon, a young man who sets out on a journey around the world to search for her hometown...<br>This is a dramatic simulation RPG consisted of unique characters!<br>The battle scenes place importance on smoothness by having a tactics sharing system that emphasizes on the effects!<br>There are many beautiful visual scenes that color the story, so you can fully enjoy the world of Ryuuki Densyou.</p>"}]