[{"name":"U.P.P.","year":1998,"developer":"Panther Software Inc.","url":"um-jammer-lammy-europe-en-fr-de-es-it/U.P.P.%20%28Japan%29.chd","filesize":192314442,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Arcade > Falling block puzzle > Tile matching puzzle > Direct control","desc":"<p>The Soul Fight International Championship has begun. Eight fighters have gathered to put their skills to the test. Defeat the best fighters, and become the king of the Soul Fight world.</p><p><em>U.P.P.</em> is a puzzle game that plays like an upside-down version of Columns with a twist. Groups of various-colored gems appear from the bottom of the screen and rise toward the top. Match three in a row vertically, horizontally, or diagonally of the same color to clear them. Every clear and combo earns charge for your Soul Gauge, which when enough charge is gathered allows you to unleash special attacks that can either hinder your opponent or give yourself an advantage. Each character has three different attacks, which require different amounts of energy charge.</p>"},{"name":"U.S. Navy Fighters","year":1997,"developer":"Electronic Arts, Inc.","url":"um-jammer-lammy-europe-en-fr-de-es-it/U.S.%20Navy%20Fighters%20%28Japan%29.chd","filesize":452337239,"score":7.9,"genres":"Simulation > 1st-person > 3rd-person (Other) > Direct control > Flight / aviation > Vehicular combat > Contemporary > Europe > War","desc":"<p><em>U.S. Navy Fighters</em> allows players to fly US naval aircraft over Ukraine in a war against Russia. The game features a campaign, single missions, an in-game single mission creator, and a quick mission creator. The game offers not typical cockpit view where instead of myriad of indicators, gauges and buttons, the player receives information in the corners of the screen in order to interact.</p>"},{"name":"Ubik","year":2000,"developer":"Cryo Interactive Entertainment","url":"um-jammer-lammy-europe-en-fr-de-es-it/Ubik%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":314108472,"score":7,"genres":"Action > Strategy > 3rd-person (Other) > Cinematic camera > Real-time strategy > Multiple units/characters control > Point and select > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Detective / mystery > Licensed","desc":"<p>The game is based on the novel <em>UBIK</em> by  Philip K. Dick. The player controls the main character from the book, called Joe Chip. He is working for a company called Runciter Associates in Los Angeles (in the year 2019), and his job is to protect companies against industrial spying from other companies. With genetic engineering and the development of replicants both sides have PSI-powers at hand to reach their targets.</p><p>In the game you lead, train and equip a squad of selected individuals (with various abilities, be it several kinds of weapon skills or PSI) through 3D-realtime rendered maps, where you sometimes can interact with your environment or even talk to some individuals. Connecting those missions are many rendered cinematic cutscenes.</p>"},{"name":"Uchuu Goushouden - Bakuretsu Akindo","year":1996,"developer":"Astec 21","url":"um-jammer-lammy-europe-en-fr-de-es-it/Uchuu%20Goushouden%20-%20Bakuretsu%20Akindo%20%28Japan%29.chd","filesize":275556742,"score":"","genres":"Strategy > Anime / Manga > Board game > Sci-fi / futuristic","desc":"<p>Bakuretsu Akindo Uchuu Goushouden is a sugoroku game (Japanese backgammon) that takes its players to the universe. Gameplay offers a high degree of freedom. Player can choose to make money slowly by taking up ordinary jobs, or take a risk and make a fortune at one stroke.</p>"},{"name":"Uchuu Seibutsu Furopon-kun P!","year":1995,"developer":"Warp Inc.","url":"um-jammer-lammy-europe-en-fr-de-es-it/Uchuu%20Seibutsu%20Furopon-kun%20P%21%20%28Japan%29.chd","filesize":43433884,"score":"","genres":"Puzzle > Real-time > Falling block puzzle > Sci-fi / futuristic","desc":"<p><em>Uchuu Seibutsu Flopon-kun P!</em> is an enhanced rerelease of the 3DO game Trip'd. It feature revamped presentation, with all of the artwork redone, and tweaked game rules.</p>"},{"name":"UEFA Challenge","year":2001,"developer":"Infogrames Studios Limited","url":"um-jammer-lammy-europe-en-fr-de-es-it/UEFA%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.chd","filesize":265460304,"score":6.3,"genres":"Sports > 3rd-person (Other) > Top-down > Football (European) / Soccer > Licensed","desc":"<p><em>UEFA Challenge</em> is European football with an official UEFA license.</p><p>The game features the biggest football star players and their teams on 30 authentic stadiums including Old Trafford, Highbury, Anfield, and Nou Camp. Each player has their own playing style.</p><p>There are more than 125 national and club teams to choose from including Manchester United, Real Madrid, Arsenal, Juventus, and Chelsea.</p><p>A multi-season mode is also included.</p>"},{"name":"UEFA Champions League Season 1998/99","year":1999,"developer":"Silicon Dreams Studio Ltd.","url":"um-jammer-lammy-europe-en-fr-de-es-it/UEFA%20Champions%20League%20-%20Season%201998-99%20%28Europe%29.chd","filesize":385215857,"score":6.6,"genres":"Sports > Football (European) / Soccer","desc":"<p>Soccer sim featuring the current team line-ups in this prestigious European club competition. There are 32 clubs included. Game options include full season, exhibition matches, scenario and a multi-player option. In scenario mode you can replay any of the finals in the competition's history from 1970 onwards. Another notable inclusion is the custom tournament mode that allows you to define your own tournament perimeters and fixtures.</p>"},{"name":"UEFA Champions League Season 1999/2000","year":2000,"developer":"Silicon Dreams Studio Ltd.","url":"um-jammer-lammy-europe-en-fr-de-es-it/UEFA%20Champions%20League%20-%20Season%201999-2000%20%28Europe%29.chd","filesize":452841728,"score":7.2,"genres":"Sports > Football (European) / Soccer","desc":"<p><em>UEFA Champions League Season 1999/2000</em> is a soccer sim featuring the 1999/2000 season team line-ups in this prestigious European club competition. There are 32 clubs included. Game options include full season, exhibition matches, scenario and a multi-player option. In scenario mode you can replay any of the finals in the competition's history from 1970 onwards. Another notable inclusion is the custom tournament mode that allows you to define your own tournament perimeters and fixtures.</p>"},{"name":"UEFA Champions League Season 2000/2001","year":2000,"developer":"Silicon Dreams Studio Ltd.","url":"um-jammer-lammy-europe-en-fr-de-es-it/UEFA%20Champions%20League%20-%20Season%202000-2001%20%28Europe%29.chd","filesize":358948336,"score":6.5,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p><em>UEFA Champions League Season 2000/2001</em> is a soccer game with an official UEFA license for the 2000/2001 season. It includes all the 32 official teams of that season, plus all champions since the sixties and some custom for more than eighty teams total. Game modes include Training, Quick Match, And a variety of cups and championships with the available teams. Interesting options in the game is to have teams play of earlier incarnations of themselves or arrange a cup between all UEFA Champions League winners.</p>"},{"name":"UEFA Euro 2000","year":2000,"developer":"Software Creations Ltd.","url":"um-jammer-lammy-europe-en-fr-de-es-it/UEFA%20Euro%202000%20%28Europe%29.chd","filesize":291435924,"score":7.2,"genres":"Sports > Diagonal-down > Direct control > Football (European) / Soccer > Europe > Licensed","desc":"<p>This is a specially released FIFA football game that coincided with the Euro 2000 European Cup.You can take charge of a team and playall the qualifying phases for the cup or play for the cup itself. </p>"},{"name":"UFO: A Day in the Life","year":1999,"developer":"Love-de-Lic","url":"um-jammer-lammy-europe-en-fr-de-es-it/UFO%20-%20A%20Day%20in%20the%20Life%20%28Japan%29.chd","filesize":149870554,"score":"","genres":"Adventure > Top-down > Puzzle elements > Sci-fi / futuristic","desc":"<p>In <em>UFO: A Day in the Life</em>, the player takes control of a little alien, who is sent by his superior (a creature known as \"Mother\") to retrieve over fifty aliens who were stranded in a regular apartment building on the Earth after a UFO crash. There is, however, one big problem: these aliens are invisible! The little hero must use a device named \"Cosmic\" in order to locate them; but even then, it is necessary to take a full picture of the alien so that the rescue team will know where to search.</p><p>So, how is it possible to take pictures of invisible beings?.. By carefully observing the environments and the behavior of humans and other animals. For example, if an animal appears to be afraid of something, there might be a chance an alien is nearby. Or, if something has changed in the scenery, perhaps an alien was at work there.</p><p><em>UFO</em> is essentially a puzzle game with adventure elements (navigating a character). The hero must travel to different rooms in the apartment building at different times, trying to snap the perfect picture of the invisible alien. The player is given a time limit and a picture limit (ten pictures per visit). Afterwards, the hero has to return to Mother, who will eat the negatives (really), produce pictures, and then decide whether they are suitable or not. Each successfully taken photo opens a new area and/or a new time of the day in the apartment block.</p><p><em>UFO</em> is  Love-de-lic's second game (after  Moon: Remix RPG Adventure). It shares a few stylistic traits and gameplay elements with its predecessor, such as the eccentric character design, the \"gibberish\" language with sub-titles, and the day/night cycle with character schedules as an important gameplay element.</p>"},{"name":"Ugetsu Kitan","year":1996,"developer":"Will Co., Ltd.","url":"um-jammer-lammy-europe-en-fr-de-es-it/Ugetsu%20Kitan%20%28Japan%29.chd","filesize":319128714,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Turn-based > Japanese-style adventure > Point and select > Japan (Ancient/Classical/Medieval) > Horror","desc":"<p><em>Ugetsu Kitan</em> is an adventure game in Japanese. It is a collection of loosely connected mystery/horror stories, based on the old book of supernatural tales <em>Ugetsu Monogatari</em>.</p><p>In the PC-98 version, a young girl guides the player from a busy street to a tent containing a labyrinth occupied by Japanese mythical creatures, in which the player experiences several stories based on the Ugetsu Monogatari, with vignettes from the original scenario in-between.</p><p>The PlayStation version, which was released several years later, changes the introduction and other aspects, like the order of the stories. In this version the player wakes up in a hospital, and after jumping from the building's roof, is guided to the same tent and labyrinth as in the PC-98 version. The PlayStation version also changes many graphical assets from the typical PC-98 pixel art style to digitized photographs and prerendered 3D CGI.</p>"},{"name":"Ultima Underworld: The Stygian Abyss","year":1997,"developer":"Blue Sky Productions","url":"um-jammer-lammy-europe-en-fr-de-es-it/Ultima%20Underworld%20-%20The%20Stygian%20Abyss%20%28Japan%29.chd","filesize":200525855,"score":8.1,"genres":"Role-playing (RPG) > 1st-person > Action RPG > Direct control > Fantasy","desc":"<p>After having brought peace to Britannia during his previous journey there, the Avatar returns to our world. However, he is haunted by ghostly dreams that warn him of great danger in Britannia. The Avatar decides to travel there once again. Upon his arrival, he witnesses the kidnapping of Baron Almric's daughter. Found guilty of the crime, the Avatar is thrown into the Great Stygian Abyss with the choice of either finding the girl or rotting in the dungeon. On his journey, he will have to get along with the many inhabitants of the dungeon, who are survivors of a failed colony, and eventually find out that there's much more to this kidnapping than meets the eye.</p><p><em>Ultima Underworld: The Stygian Abyss</em> is commonly considered the first role-playing game with fluid first-person movement in a real 3D environment. Unlike earlier first-person RPGs such as Dungeon Master or Eye of the Beholder, the player can move in every direction and the graphics are updated continually. The player is also able to look up and down with the press of a key, jump, and swim. The dungeon is not made entirely of corridors and rooms arranged in a rectangular fashion but has a lot of variety: slopes, stairs, bridges, underground rivers, and more.</p><p>The game's combat system is action-oriented. The player has to draw his weapon, aim at his opponent, and hold the cursor over the game screen to inflict damage; the longer the player holds it, the stronger is the attack. Some weapons have different types of attacks, depending on where the cursor is held: for example, jabs are executed when the cursor is near the bottom of the screen, while slashes are performed with the cursor in the middle.</p><p>At the beginning of the game, the player chooses the gender, the class, and the initial skills for the Avatar. Skills include various weapon proficiencies, lockpicking, bartering, and others. They can be increased by reciting mantras at special shrines after having accumulated a sufficient amount of experience points. Leveling up also increases the Avatar's hit points and mana. The magic system is based on runes that can be found in the Abyss. If combined in the right order, they produce a magical effect. </p><p>As the Abyss is populated by more than just monsters, there are various conversations the Avatar can conduct with non-playable characters. The player can also make choices regarding the Avatar's behavior towards these characters. Game progression is largely non-linear: the player is able to explore most of the Abyss in any order, though several specific tasks must be accomplished in order to complete the story. An auto-map displays all the locations the player has explored previously, and also allows the player to make notes on it.</p>"},{"name":"Ultimate Brain Games","year":2003,"developer":"cosmigo GmbH","url":"um-jammer-lammy-europe-en-fr-de-es-it/Ultimate%20Brain%20Games%20%28Europe%29.chd","filesize":281880350,"score":"","genres":"Compilation > Puzzle > Strategy > Diagonal-down > Fixed / flip-screen > Turn-based > Board game > Cards / tiles > Chess > Tile matching puzzle > Point and select","desc":"<p>Ultimate Brain Games is a collection of 8 games you can play against the computer or a friend.  The games include Sink Ships (aka Battleship), Mahjong, Backgammon, Chess, Checkers, Reversi, Dominoes, and Four in a Row (aka Connect Four).</p><p>You start out by designing how your character looks.  You can modify 9 areas of your character, from eyes to clothes.  After doing so, decide to play single or multiplayer.</p><p>Each game follows the rules and gameplay seen in the original games.</p>"},{"name":"Ultimate Fighting Championship","year":2000,"developer":"Anchor, Inc.","url":"um-jammer-lammy-europe-en-fr-de-es-it/Ultimate%20Fighting%20Championship%20%28Europe%29.chd","filesize":295039487,"score":6.7,"genres":"Action > Sports > 3rd-person (Other) > Fighting > Boxing > Wrestling > Licensed","desc":"<p>Ultimate Fighting Championship is based on the no-holds-barred martial art tournament of the same name. What makes the game (and the real-life counterpart) distinct from wrestling, boxing, and other fights is the variety of fighting styles in use; it is perfectly possible to end up with a judo master facing a kickboxer.</p><p>The actual gameplay is simple enough. You have various basic moves, combos, holds, and so on. The complications come in the form of the huge list of moves, featuring many different styles. Hit your opponent until he gets knocked out, or force him to tap out early.</p><p>There are multiple game modes included. Among them are a survival mode, that has you face a string of enemies with minimal recovery, and career mode, which allows you to customize and improve your fighting style as you win fights.</p>"},{"name":"Ultraman: Fighting Evolution","year":1998,"developer":"Metro Corporation","url":"um-jammer-lammy-europe-en-fr-de-es-it/Ultraman%20-%20Fighting%20Evolution%20%28Japan%29.chd","filesize":241421852,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control > Fantasy > Licensed","desc":"<p><em>Ultraman Fighting Evolution</em> is a fighting game based on the <em>Ultra</em> series, a tokusatsu superhero series by Tsuburaya. The characters in the game are some of the characters that appeared in the original <em>Ultraman</em> TV show, Ultraseven, and Ultraman Taro. It is the first game in the <em>Ultraman Fighting Evolution</em> series.</p><p>There are four game modes that is available in the game. In arcade mode, the player, who must play as one of the Ultramen, will battle several kaijus. In versus mode, the player can choose which character he want to play as and which character to fight against. Players are able to choose whether to fight against the CPU or against another player. In survival mode, the player will go up against a barrage of enemies until the player loses his health. There is also the training mode where the player is able to train their skills with the characters.</p>"},{"name":"Um Jammer Lammy","year":1999,"developer":"NanaOn-Sha Co., Ltd.","url":"um-jammer-lammy-europe-en-fr-de-es-it/Um%20Jammer%20Lammy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":520291161,"score":8,"genres":"Action > 3rd-person (Other) > Cinematic camera > Music / rhythm > Direct control","desc":"<p>Introducing Lammy, a totally rockin' guitarist. In day-to-day life, she's quite timid, shy, and wimpy - but put a guitar in her hands, and she'll blow you away! Help Lammy get to her latest gig on time, and face obstacles such as flaming buildings, out-of-control airplanes, and even getting trapped in Hell.</p><p>In this sequel to PaRappa The Rapper you play as Lammy, a guitarist for MilkCan - the coolest, hippest band ever! While <em>PaRappa</em> focused on lyrics, with each button controlling a different word; Lammy is a guitar player, so naturally, each button controls a different note on the guitar. Lammy will encounter seven different teachers on her travels to the big gig, so either follow their lessons accurately, or do even better - improvise and blow them all away with your axe. The teacher will then step away for you to go it solo for an even better performance.</p><p><em>Lammy</em> improves over <em>PaRappa</em> in a multitude of ways. Rather than just being a single player experience, you can now play the game with a friend. Any stages that you unlock can be played either co-operatively or competitively. If you don't have a friend to play co-operatively with, you can also get the computer to take on the role of your partner. After finishing the initial game, PaRappa also makes a return, allowing you to play through the game again with raps instead of Lammy's guitar.</p>"},{"name":"Umihara Kawase: Shun","year":1997,"developer":"Jackpot","url":"um-jammer-lammy-europe-en-fr-de-es-it/Umihara%20Kawase%20Shun%20%28Japan%29.chd","filesize":23273669,"score":"","genres":"Action > Side view > Anime / Manga > Platform > Puzzle elements","desc":"<p>In this slightly out of the ordinary platformer you play as a girl equipped with a fishing (and grappling) hook and a backpack, who has to maneuver her way through an aquatic world and fight off the mutated sea creatures within it.</p><p>In a somewhat similar manner to Bionic Commando the player has to use a lot of planning and his grappling hook to get around the stages in a successful way. There are no power ups in the game, so skill is of the essence.</p>"},{"name":"Umihara Kawase: Shun - Second Edition","year":2000,"developer":"Studio Saizensen Ltd.","url":"um-jammer-lammy-europe-en-fr-de-es-it/Umihara%20Kawase%20Shun%20-%20Second%20Edition%20%28Japan%29.chd","filesize":23154824,"score":"","genres":"Action > Side view > Anime / Manga > Platform > Puzzle elements","desc":"<p>This game is a plaformer with a twist: you play a girl in an aquatic world, and the only way to fight against your enemies are your brain and a grappling hook, which you have to master if you plan on finishing this game. Because there are no power-ups. </p><p>Your enemies are all sea creatures, but some of them have grown legs and now they can attack and chase you on land.</p><p>One of the exceptional things about this game is its replay value, absent in most platformers: you can finish the game and then play against your best time, try to find hidden paths or exits, or even record your best replays on the memory card.</p><p>This edition is a re-release of the original Umihara Kawase: Shun, also for the Sony PlayStation, released back in 1997. In terms of new content, new levels have been added, as well as several bugfixes, but it is essentially the same game as the first edition.</p>"},{"name":"Ungra Walker","year":2002,"developer":"Success Corporation","url":"um-jammer-lammy-europe-en-fr-de-es-it/UnGro%20Walker%20%28Japan%29.chd","filesize":145364164,"score":"","genres":"Action > 3rd-person (Other) > Anime / Manga > RPG elements > Fantasy > Medieval","desc":"<p>UNGRA WALKER is an exploration action game. The dungeons are renewed under the\"Automatic Dungeon Generation System\" as you play your way through. In a fantasy world of the Medieval ages, fight against monsters that get in your way and collect numerous items in the dungeons.</p>"},{"name":"Unholy War, The","year":1998,"developer":"Toys for Bob Inc.","url":"um-jammer-lammy-europe-en-fr-de-es-it/Unholy%20War%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":138742803,"score":7.1,"genres":"Action > Strategy > 3rd-person (Other) > Top-down > Arcade > Sci-fi / futuristic","desc":"<p>Two powerful forces are about to clash and you must decide which side you are on.  The Arcanes are the natives on the planet Xsarra.  The Teknos crash land on Xsarra and decide to conquer the planet in this unholy war of flesh vs. metal.</p><p>The Teknos are cybernetic conquerors who want the resources of Xsarra for themselves.  The Arcanes have coexisted peacefully for thousands of years but now band together to destroy the machine invaders.  Each side is compromised of seven different types of warriors for a total of 14 playable warriors.  Each warrior has three separate types of moves or attacks that can be performed against their opponent.  Each warrior also has a strategy skill that can be used when playing that mode of gameplay.</p><p>There are two types of gameplay, Mayhem mode and Strategy Mode.  Mayhem mode consists of choosing seven warriors and facing off against seven opposing warriors controlled by the computer or another player.  Action is fast, furious, and different each time depending on one of the several \"terrains\" that can be chosen to fight the battles within.  Random power-ups also appear to help which ever warrior can get to them first.  All the warriors and environments are rendered in full 3D with the camera centering on the middle point above the two warriors.  The warriors dance around each other, hurling their attacks and avoiding traps.</p><p>Strategy Mode consists of a three-dimensional map where the player moves his warriors across it with the ultimate goal to destroy the opposing warriors or destroy their fortresses.  When two warriors meet on the map, gameplay switches to Mayhem mode and the two warriors fight to the death with the winning one returning to the map to fight another day.  To create new warriors, a special type of energy called \"Aur\" must be mined.  Warriors in strategy mode can perform two types of actions.  These include moving, attacking, or using their special power.  There is a underlying story that is never fully developed but, is revealed as the player progresses through each of the 12 regions of the Strategy mode for both the Arcanes and Teknos.</p><p>A great deal of strategy is required to win in Mayhem mode and Strategy mode.  Primarily, it involves figuring out which warrior to use to destroy another.  Each warrior has at least one fatal weakness when matched with the appropriate opposing warrior.</p>"},{"name":"Universal Nuts","year":1998,"developer":"Lay-Up KK","url":"um-jammer-lammy-europe-en-fr-de-es-it/Universal%20Nuts%20%28Japan%29.chd","filesize":190692997,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Visual novel > Sci-fi / futuristic","desc":"<p><em>Universal Nuts</em> is a sci-fi visual novel featuring two protagonists, Yui and Ai, which get involved in an incident onboard a space station. As the story progresses, the mystery of events that have occurred start to unfold. The game plays in a typical visual novel style by reading through on-screen text and dialogues to progress the story. Character icons are present during dialogues beside the character art over the background image, and the game features both animated cut-scenes and voice-acting.</p>"},{"name":"Unsolved, The - Hyper Science Adventure (Disc 1)","year":1997,"developer":"Japan Media Programming Inc.","url":"um-jammer-lammy-europe-en-fr-de-es-it/Unsolved%2C%20The%20-%20Hyper%20Science%20Adventure%20%28Japan%29%20%28Disc%201%29.chd","filesize":305564353,"score":"","genres":"Adventure > 1st-person > Live action > Detective / mystery","desc":"<p><em>The Unsolved</em> is an adventure game in style of The X Files that uses real-actors and real photo backdrops. The player assumes a role of a police detective who is trying to solve the series of murders in downtown Los Angeles, where all the victims are women. All the victims seem to be missing organs and depleted of their blood, and modus operandi of the perpetrator is unknown. Police is tapping in the dark, and the closer you get to the truth, the story mixes science fiction and supernatural, much like <em>The X Files</em>.</p><p>While actors use English, this game is not released outside of Japan, and subtitles as well as any other in-game text are in Japanese.</p>"},{"name":"Unsolved, The - Hyper Science Adventure (Disc 2)","year":1997,"developer":"Japan Media Programming Inc.","url":"um-jammer-lammy-europe-en-fr-de-es-it/Unsolved%2C%20The%20-%20Hyper%20Science%20Adventure%20%28Japan%29%20%28Disc%202%29.chd","filesize":365959329,"score":"","genres":"Adventure > 1st-person > Live action > Detective / mystery","desc":"<p><em>The Unsolved</em> is an adventure game in style of The X Files that uses real-actors and real photo backdrops. The player assumes a role of a police detective who is trying to solve the series of murders in downtown Los Angeles, where all the victims are women. All the victims seem to be missing organs and depleted of their blood, and modus operandi of the perpetrator is unknown. Police is tapping in the dark, and the closer you get to the truth, the story mixes science fiction and supernatural, much like <em>The X Files</em>.</p><p>While actors use English, this game is not released outside of Japan, and subtitles as well as any other in-game text are in Japanese.</p>"},{"name":"Unsolved, The - Hyper Science Adventure (Disc 3)","year":1997,"developer":"Japan Media Programming Inc.","url":"um-jammer-lammy-europe-en-fr-de-es-it/Unsolved%2C%20The%20-%20Hyper%20Science%20Adventure%20%28Japan%29%20%28Disc%203%29.chd","filesize":405995847,"score":"","genres":"Adventure > 1st-person > Live action > Detective / mystery","desc":"<p><em>The Unsolved</em> is an adventure game in style of The X Files that uses real-actors and real photo backdrops. The player assumes a role of a police detective who is trying to solve the series of murders in downtown Los Angeles, where all the victims are women. All the victims seem to be missing organs and depleted of their blood, and modus operandi of the perpetrator is unknown. Police is tapping in the dark, and the closer you get to the truth, the story mixes science fiction and supernatural, much like <em>The X Files</em>.</p><p>While actors use English, this game is not released outside of Japan, and subtitles as well as any other in-game text are in Japanese.</p>"},{"name":"Uprising X","year":1998,"developer":"Cyclone Studios","url":"um-jammer-lammy-europe-en-fr-de-es-it/Uprising%20X%20%28USA%29.chd","filesize":346405722,"score":7.2,"genres":"Action > Strategy > 1st-person > Shooter > Tank > Sci-fi / futuristic","desc":"<p><em>Uprising X</em> is a PlayStation-exclusive entry in Cyclone Studios' series of tank simulators, combining the gameplay of real time strategy games with first-person combat. The player controls a tank named \"Wraith\" with both analog sticks, using the left one to aim and the right stick for movement. The minimal plot is developed through mission briefings and cutscenes, telling the struggle between a rebel faction against imperial forces for the dominance of planets.</p><p>As one of the rebels, the player has to maneuver the tank on a battlefield, searching for suitable places to construct reinforcements buildings. After entering a piece of terrain marked with four glowing orbs, a large structure topped by a turret called \"The Citadel\" appears on a nearby spot. The player can enter it by pressing both L1 and R1 buttons, assuming the role of the turret operator. Besides handling the weapons, the player can access the build menu, from where unit factories can be erected on the surrounding terrain. Extra turrets can also be placed around the perimeter to protect the base. The structures can be recycled to be replaced with new ones.</p><p>The tank is equipped with several weapons, from laser beams to guided missiles, that can be used against enemy troops. From the inside, friendly units can be summoned when available to fight alongside in battle. Infantry, tanks and aircraft can be called into action from the interface menu. A tactical map showing an overhead view of the terrain can be activated with the select button.</p><p>There are three split-screen modes for two players: challenge, deathmatch and siege. The first two have the players fighting directly against each other, while the last one is more strategic, where the objective is to defend the base from incoming enemy assaults.</p>"},{"name":"Urban Chaos","year":2000,"developer":"Mucky Foot Productions Limited","url":"um-jammer-lammy-europe-en-fr-de-es-it/Urban%20Chaos%20%28Europe%29%20%28En%2CEs%2CIt%29.chd","filesize":311624648,"score":7.1,"genres":"Action > Behind view > Fighting > Shooter","desc":"<p>As the 2nd millennium ends, the cities are over-ran with Apocalyptic violence. Is this down to urban frustrations, or a sinister cult controlling everybody? You are either cop D'Arcy Stern or former soldier Roper McIntyre, and have to find the answers, but more importantly put a stop to the carnage. </p><p>This involves a succession of action-packed non-linear missions. The environment incorporates shadows, rain, fog and a day/night cycle. Police cars, motorcycles and ambulances must be controlled during some missions. There are many ways to 'settle' the enemies - car chases, hand-to-hand combats and action movie-style shoot outs for example.</p>"},{"name":"USA Racer","year":2002,"developer":"Davilex Games B.V.","url":"um-jammer-lammy-europe-en-fr-de-es-it/US%20Racer%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.chd","filesize":207998102,"score":6.6,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator","desc":"<p>A clandestine group has been organizing illegal street races in the USA for more than 50 years. What started as a fun event has grown into an annual contest for cash and glory. Only six are given a chance to prove their worth.</p><p><em>USA Racer</em> contains 11 tracks in different locations across the USA. Players can race in cities such as Los Angeles, New York or Washington DC or can take part in a race through the Grand Canyon or Yellowstone. Next to Time Trial and Single Race, the Tournament is the main event. It has been split up in three sections: Park Trial, City Trial and US Race. After completing a section, the next one is opened up.</p><p>The tracks contain obstacles and jumps. Enemies will try to push other cars off the road, and the police also make an appearance. Scattered around the tracks are power-ups that repair the car, provide boost or cash. The money can be used to upgrade the car, repair it or buy boost prior to the race. After completing an entire tournament with a certain car, an alternate vehicle becomes available for that character.</p><p>In the Windows version two-player duels are available over LAN or TCP/IP. Players can either go head-to-head or play a game of Cop vs. Racer.</p>"}]