[{"name":"V Tennis","year":1995,"developer":"Tonkinhouse","url":"psx-chd-roms-u-z/V-Tennis%20%28Europe%29.chd","filesize":138063642,"score":"","genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p><em>V-Tennis</em> is a three dimensional tennis games played from a third person perspective with ten different camera angles to choose from. It plays like other games of its kind and allows the player do a number of different shots, including slices, lobs, top spins, drop shots, and smashes. It's possible to play individual matches against human or AI controlled opponents or in a tournament. Individual matches can be singles or doubles and in multiplayer it's possible for players to both compete against each other or to cooperate against the computer. There are 16 tennis players to choose from and they have different stats in five categories: service, forehand, backhand, footwork and sprint. Six different courts can be chosen from: stadium, indoor, N.Y., Fiji, Kilauea and Japan. It's also possible to chose the surface type: hard, clay or lawn. The game also has an edit mode where the abilities and look of the tennis players can be modified.</p>"},{"name":"V-Ball: Beach Volley Heroes","year":1998,"developer":"Avit, Inc.","url":"psx-chd-roms-u-z/V-Ball%20-%20Beach%20Volley%20Heroes%20%28Europe%29.chd","filesize":268241775,"score":6.8,"genres":"Sports > 3rd-person (Other) > Arcade > Volleyball","desc":"<p><em>V-Ball: Beach Volley Heroes</em> is the sequel to the NES game Super Spike V'Ball, an arcade game that deals with beach volleyball in a very special way.</p><p>There are several teams you can choose from, such as Soldiers, Ninjas, Soccer players and so on, and each of them has got its own moves and special effects. There are commands for both heavy shots and for light ones, making you choose the strength to hit and throw the ball. There are no power bars and once hit, the ball flies to the opposing side automatically.</p><p>The special moves can be triggered whenever you push certain button combinations (triangle and circle, circle and cross, etc) at the right moment. If it is a defense move, for instance, you must do it in response to others attacks.</p><p>There is a Tournament mode, which is the main solo entertainment (although you can also play single matches vs the AI), but this game is clearly designed around player-vs-player mode, for arcade matches against human opponents.</p>"},{"name":"V2000","year":1998,"developer":"Frontier Developments Ltd.","url":"psx-chd-roms-u-z/V2000%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":203287804,"score":6.8,"genres":"Action > 3rd-person (Other) > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>V2000</em> is a 3D space shooter based on the '80s game Virus. </p><p>Aliens are using a virus to corrupt and possess many creatures from different worlds by opening up links between the worlds they are trying to conquer. From many of these links emerged the hives. </p><p>The usual mission objectives in the game are to destroy the mutated creatures and the hives, rescue local inhabitants, while \"beaming up\" weapon upgrades along the way. Players are then awarded \"trophies\" for each world saved or if it is saved quickly. These trophies allow the player to receive new ships.</p>"},{"name":"Vagrant Story","year":2000,"developer":"Square Co., Ltd.","url":"psx-chd-roms-u-z/Vagrant%20Story%20%28Europe%29.chd","filesize":94633149,"score":8.5,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Real-time > Puzzle elements > Direct control > Menu structures > Fantasy","desc":"<p>Valendia is a land that had undergone civil war, the end of which had birthed the parliament and several organizations to control the balance of power. Ashley Riot is a Riskbreaker, an elite agent for the Valendia Knights of Peace (VKP) who is investigating some strange occurrences. A cult of religious fanatics known as Müllenkamp and their leader Sydney Losstarot have seized the manor of Duke Bardorba of Valendia Kingdom. The events at the manor have sent Ashley on a quest to get to the bottom of events, and travel into the catacombs that lead to the destroyed, yet magical city of Leá Monde. However Ashley is not the only person interested in the city, and other factions of the government, including parliament assigned Knights of the Crimson Blade and other VKP agents are pursuing their own agenda. </p><p><em>Vagrant Story</em> is a role-playing game with several distinguishing characteristics. The entire game (including the numerous cutscenes that advance the plot) is rendered in 3D. The game focuses on exploration of large, complex dungeon-like areas and combat; there are no \"friendly\" areas, NPC interaction, or monetary system. Dungeons contain many optional rooms and environmental puzzles that mostly involve pushing, destroying, and re-arranging different types of crates to access higher areas. Ashley can also jump and grab ledges of higher platforms during exploration.</p><p>The game runs in real time, with visible enemies and no separate battle screens. When entering combat and attacking an enemy, the game is paused, allowing the player to choose targets and access the menu for other actions. A wireframe sphere displays the range of the currently selected weapon and detailed statistics on different body parts of the enemies within range.</p><p>Ashley does not receive experience points from defeating regular enemies; he randomly gains bonuses to his attributes after defeating bosses, but in general the focus of the customization in the game is on weapons. Ashley can equip a wide variety of weapons and armor made out of different materials. Each weapon possesses, besides detailed damage statistics, parameters in one of the three categories (edged, blunt, and piercing), as well as affinity to any of the six enemy types encountered in the game. Damage in battle is calculated according to the weapon's and the enemy's particular strengths and weaknesses in any of these categories. Weapons used constantly against the same type of enemy improve in power against them. Each weapon can also be disassembled in workshops scattered throughout the game, and new weapons can be forged by combining blades with grips. Gems can be attached to some grips, usually increasing the weapon's affinity with an enemy category.</p><p>Ashley can also make use of Magic, Chain Abilities and Break Arts. Magic is broken into four groups, namely defense, combat, healing and status. Chain Abilities allow Ashley to \"chain together\" consecutive hits against enemies. The player can assign various offensive and defensive effects to buttons that need to be pressed at the right time to execute a chain. These effects include inflicting status ailments on the enemy, reflecting damage, etc. Using chains, however, raises Ashley's Risk Meter, making his attacks less precise and himself more vulnerable. Break Arts are special skills learnt after repetitive use of a weapon type. Sacrificing some of the player's health, Break Arts can perform a high damage attack on an enemy.</p>"},{"name":"Valkyrie Profile (Disc 1)","year":1999,"developer":"tri-Ace Inc.","url":"psx-chd-roms-u-z/Valkyrie%20Profile%20%28Japan%29%20%28Disc%201%29%20%28Rev%201%29.chd","filesize":479838159,"score":8.1,"genres":"Role-playing (RPG) > 3rd-person (Other) > Side view > Turn-based","desc":"<p>In preparation for Ragnarok, the final battle between the gods, Odin has commanded Lenneth the Valkyrie to descend to the lower world and gather the souls of fallen heroes to serve as soldiers in the approaching conflict. The player controls Lenneth, gathering soldiers and training them to be transferred to the battlefields of the gods.</p><p>The gameplay mainly consists of exploring various locations (dungeons, mansions, swamps) from a 2D perspective. Lenneth can run, jump, shoot ice crystals (useful for anything from freezing enemies to building ledges), push and pull objects to solve simple puzzles, etc. All of the enemies are on-screen and can usually be avoided, in the style of games like Chrono Cross and SaGaFrontier 2. The battle system is turn-based. Each of the characters (up to three can fight alongside Lenneth at a time) is assigned to one of the four main keys. The player and the enemy take turns attacking, but with the right timing, the player can execute combos that leave enemies defenseless. Long combos can result in substantial experience bonuses, although it is possible to defeat most enemies without them.</p><p>The rest of the game consists of Lenneth using \"spiritual concentration\" to discover the locations of dungeons and fallen heroes, ingame-engine cutscenes that give the history of these characters, and reports about the war's progress that come at the end of each \"chapter\". The chapter system is one of the game's most original features. Each chapter (there are about 8) is made up of a preset number of periods. Each action, such as a successful use of spiritual concentration, or entering a town/dungeon, uses a number of periods that varies with the difficulty level. When all of the periods have passed, the chapter is over. The player must transfer heroes to Valhalla in the course of each chapter (permanently losing them), but has only a limited amount of time to improve their statistics.</p>"},{"name":"Valkyrie Profile (Disc 2)","year":1999,"developer":"tri-Ace Inc.","url":"psx-chd-roms-u-z/Valkyrie%20Profile%20%28Japan%29%20%28Disc%202%29%20%28Rev%201%29.chd","filesize":495965500,"score":8.1,"genres":"Role-playing (RPG) > 3rd-person (Other) > Side view > Turn-based","desc":"<p>In preparation for Ragnarok, the final battle between the gods, Odin has commanded Lenneth the Valkyrie to descend to the lower world and gather the souls of fallen heroes to serve as soldiers in the approaching conflict. The player controls Lenneth, gathering soldiers and training them to be transferred to the battlefields of the gods.</p><p>The gameplay mainly consists of exploring various locations (dungeons, mansions, swamps) from a 2D perspective. Lenneth can run, jump, shoot ice crystals (useful for anything from freezing enemies to building ledges), push and pull objects to solve simple puzzles, etc. All of the enemies are on-screen and can usually be avoided, in the style of games like Chrono Cross and SaGaFrontier 2. The battle system is turn-based. Each of the characters (up to three can fight alongside Lenneth at a time) is assigned to one of the four main keys. The player and the enemy take turns attacking, but with the right timing, the player can execute combos that leave enemies defenseless. Long combos can result in substantial experience bonuses, although it is possible to defeat most enemies without them.</p><p>The rest of the game consists of Lenneth using \"spiritual concentration\" to discover the locations of dungeons and fallen heroes, ingame-engine cutscenes that give the history of these characters, and reports about the war's progress that come at the end of each \"chapter\". The chapter system is one of the game's most original features. Each chapter (there are about 8) is made up of a preset number of periods. Each action, such as a successful use of spiritual concentration, or entering a town/dungeon, uses a number of periods that varies with the difficulty level. When all of the periods have passed, the chapter is over. The player must transfer heroes to Valhalla in the course of each chapter (permanently losing them), but has only a limited amount of time to improve their statistics.</p>"},{"name":"Vampire Hunter D","year":1999,"developer":"Victor Interactive Software, Inc.","url":"psx-chd-roms-u-z/Vampire%20Hunter%20D%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":241039501,"score":6.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Puzzle elements > Survival horror > Fantasy > Licensed","desc":"<p><em>Vampire Hunter D</em> is based on the anime titled <em>Vampire Hunter D: Bloodlust</em>, which, in its turn, is based on the novel <em>Vampire Hunter D: Demon Deathchase</em> by Hideyuki Kikuchi. You play as D, the half-human / half-vampire whose sole mission in life is to hunt down and kill vampires. The setting is not the distant medieval past, nor is it the mid-19th century, instead D's adventures are set in the far distant future, when humanity has nearly killed itself off by endless wars. Rising from the scorched earth and assuming power in this desolate era are the timeless vampires. They established a feudal system where they ruled over humans as nobles in Europe ruled over their peasants. But after thousands of years the Vampires' power waned and humans revolted against their lords, and thus the class of Vampire Hunters were born.</p><p>In this particular story, D is employed by a rich family to retrieve their daughter from the vampire who kidnapped her. He is not the only one trying to free her; a rival group of vampire hunters, the Marcus Brothers, are after the daughter and the bounty, regarding D as a rival. The Vampire Hunter D must enter Castle Chaith, battle the Vampire Lord, the minions that inhabit the castle, and a hidden evil, to save the girl and collect his bounty.</p><p>The action in <em>Vampire Hunter D</em> plays like the early Resident Evil games. There are pre-rendered backgrounds and all the characters are animated in 3D. Players utilize D's signature weapon, his massive long sword, as well as his special vampire powers, (which comprise healing, offensive, and defensive powers), to battle the hordes of evil creatures that live in the hallways and chambers of the daemonic Castle Chaith. You must solve puzzles, unlock doors, and retrieve key items to progress into the depths and heights of the castle, ultimately reaching and revealing the true evil power pulling the strings of this macabre story.</p>"},{"name":"Vampire: The Recurrence of The Vampire's Nightmare","year":1999,"developer":"Artdink Corporation"},{"name":"Vanark","year":1999,"developer":"Bit Town Inc.","url":"psx-chd-roms-u-z/Vanark%20%28USA%29.chd","filesize":429130436,"score":6.7,"genres":"Action > 3rd-person (Other) > Arcade > Rail shooter > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>Evil alien forces threaten Mars with their deadly \"Zero Field\". Its now up to you to join the forces of the Vanark troopers and save the day before its too late.</p><p><em>Vanark</em> is a 3D action game which plays mostly as a rail-shooter. You fly aboard your state-of-the-art Vanark fighter in a fixed path on several missions controlling your guns and missiles and trying to defeat all the waves of enemy ships and creatures that try to come at you. Every now and then you also get to play free-flight stages in deep space where you have full control of your ship, turning the game into a more traditional 3rd-person space sim.</p><p>Additionally, between each stage you get to roam freely aboard your carrier ship using 3D characters over pre-rendered backgrounds. In these sequences you'll get to chat with fellow pilots and move the plot along, which includes triggering cut-scenes as well solving mini-games such as disarming a saboteur's bomb and other similar activities.</p>"},{"name":"Vandal Hearts","year":1996,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"psx-chd-roms-u-z/Vandal%20Hearts%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":415523568,"score":7.7,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Turn-based > Tactical RPG > Fantasy","desc":"<p><em>Vandal Hearts</em> is a turn-based strategy RPG. It follows a fixed plot-line with set battles, focusing more on strategic elements than adventure elements. </p><p>The combat takes place in a series of 3D grid based maps and each character in the party has a certain amount of movements they can perform each turn. As the game progresses, other characters join and leave the party and as they increase in level they can progress along different paths of development. Between each battle there is a cut scene that develops the plot using the same 3D engine as the combat (and often the same areas).</p><p>In between battles you have the opportunity to talk to people in cities as well as purchase different equipment for the up coming battles.</p>"},{"name":"Vandal-Hearts II","year":1999,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"psx-chd-roms-u-z/Vandal%20Hearts%20II%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":125133994,"score":7.2,"genres":"Role-playing (RPG) > Strategy > Isometric > Turn-based > Tactical RPG > Fantasy","desc":"<p>Vandal Hearts II is a turn based strategic RPG which is comparable to the more famous Fire Emblem series.</p><p>Most of the gameplay consists of moving your party on 3D grid based maps in a way that will give you a strategic advantage over your enemies. The main difference between Vandal Hearts II and its predecessor is the change of the battle system. Unlike in Vandal Hearts you and your enemies issue the commands at the same time and then move simultaneously. That results in completely new strategies and gives the game a unique touch.</p><p>The story takes place in the already collapsed church state of Nirvadia, that was once formed by the religious leader St Nirvath, but eventually ceased to exist, because of several conflicts between unbelievers and local rulers. Caused by a chain of coincidences, the young boy Joshua, from a small and unimportant village in the east, eventually finds himself within a complex political scheme set in motion by power-hungry aristocrats and religious fanatics.</p>"},{"name":"Vanguard Bandits","year":1998,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-u-z/Vanguard%20Bandits%20%28USA%29.chd","filesize":371066051,"score":6.8,"genres":"Role-playing (RPG) > Strategy > Top-down > Isometric > Anime / Manga > Real-time > Mecha / giant robot","desc":"<p><em>Vanguard Bandits</em> is a tactical RPG that takes place on the continent of Eptina, which has been at war with itself for years until the kingdom of Pharastia discovers ancient mechanical giants created by a lost civilization. With the new found mecha's called ATAC (All Terrain Armored Combatant) Pharastia once again brings peace to Eptina until civil wars and coup d' etat's took place and thus began the Second Eptina Wars. Take control of Bastion as he wages war against the Junaris Empire to regain control of the continent. </p><p>Gameplay consists of controlling a group of ATAC on missions on a 2D sprite map where players take turns moving and attacking. Once a fight between two ATAC's starts the game is switched to a 3D side view and the battle between the two continues. Use the terrain to your advantage like attacking from above or behind your enemy. </p><p>Follow the story of Bastion and his friends on 56 missions to regain peace on the continent. Your actions before battles and as the results of battles will decide your outcome - with 5 different endings along three separate story lines.</p>"},{"name":"Vanishing Point","year":2001,"developer":"Clockwork Games Limited","url":"psx-chd-roms-u-z/Vanishing%20Point%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":363778932,"score":7.1,"genres":"Racing / Driving > 1st-person > Behind view","desc":"<p><em>Vanishing Point</em> is an arcade style racer featuring real cars and road course style tracks. The main difference between Vanishing Point and countless other racers is that you are never racing directly against other cars, but rather are racing against the clock. Your position at the end of the race depends solely on your time, not on your finishing position relative to other cars. What's more, there are loads of computer controlled cars that are there simply to slow you down.</p><p>The standard racing game modes are here: Tournament, Time Trial, and Single Race. One unique feature, however, is the stunt competition. You can compete in a series of events that test various driving skills in timed events. Some example events are the long jump and the slalom.</p><p>The selection of cars is quite diverse. You can race vehicles that range from low performance, like a VW Microbus, to high performance, like a Dodge Viper.</p>"},{"name":"Vegas Casino","year":1996,"developer":"Coconuts Japan Entertainment Co., Ltd.","url":"psx-chd-roms-u-z/Vegas%20Casino%20%28Europe%29.chd","filesize":209679511,"score":"","genres":"Gambling > Strategy > 1st-person > Cards / tiles","desc":"<p><em>Vegas Casino</em> is a game for up to four players via multitap comprising Baccarat, Roulette, Let It Be, Black Jack, Video Poker, Keno and Slot Machines.</p><p>It can be played in two modes, Ranking play or Free Play.  </p><p>In Ranking mode the player enters a target amount to be reached and then plays against their opponents to see who can reach that amount. If a single player plays in this mode the game provides three opponents but the game caters for up to ten players with the game providing the additional AI opponents. Roulette,Video Poker, and Slot Machines in this game mode are played within a split screen.  </p><p>In Free mode there are no computer opponents and the games are the same as the games played in Ranking mode though there are minor differences, such as selecting which slot machine to play, because in this mode the split screen mode is not used at all.</p><p>There are three kinds of slot machine which can be played for different stakes. Keno is the odd game here because it does not appear on the game menu, instead during any game other than Video Poker a casino hostess pops up in her own little window inviting the player to a game of Keno. If the player accepts they are shown a Keno card on which they mark their numbers after which their current game of Baccarat, Roulette or whatever resumes. A short while later the hostess window opens up again and the hostess gives the good, or more usually bad, news on how good their selections were.</p>"},{"name":"Vegas Games 2000","year":2000,"developer":"The 3DO Company","url":"psx-chd-roms-u-z/Vegas%20Games%202000%20%28USA%29.chd","filesize":165053813,"score":"","genres":"Gambling > 1st-person > Top-down > Cards / tiles","desc":"<p><em>Midnight in Vegas</em> features 7 classic games : Black Jack, Craps, Poker, Video Poker, Roulette, Baccarat and Slot Machine. Depending on the game, view is top down (Craps) or first person (Roulette). Muti-Tap can be used to play to games against 4 players. The PlayStation case also includes a CDA with 8 audio tracks.</p>"},{"name":"Vehicle Cavalier","year":1996,"developer":"Vanguard Works","url":"psx-chd-roms-u-z/Vehicle%20Cavalier%20%28Japan%29.chd","filesize":89564915,"score":"","genres":"Action > Behind view > Anime / Manga > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Fast-paced gun-blazing action awaits in this classic mecha deathmatch. Blast your way through the arena as you wield over 300 types of weapons. You can even create your own weapons for custom carnage! Explore the madness as 8 unique characters are locked in a mobile-suite melee. Conquer all challenges and build the most powerful Vehicle Cavalier ever!</p>"},{"name":"Velldeselba Senki: Tsubasa no Kunshou","year":1997,"developer":"TENKY Co. Ltd.","url":"psx-chd-roms-u-z/Velldeselba%20Senki%20-%20Tsubasa%20no%20Kunshou%20%28Japan%29.chd","filesize":279311914,"score":"","genres":"Action > Role-playing (RPG) > Behind view > Diagonal-down > Anime / Manga > Real-time > Flight / aviation","desc":"<p>The planet Velldeselba has long been in a state of turmoil, with fighting continuing between the Kingdom of Gidan, the Munogi Federation, and the independent state of Noipask. Misaki, a young space pilot, had to make an emergency crash landing on Velldeselba, and washed up on the shore of Noipask. Sensing his potential, he was quickly recruited to join the Noipask army and help the country in their struggle to remain independent.</p><p><em>Velldeselba Senki</em> is a combination of a traditional Japanese-style RPG and an arcade-style flight sim. Story events, as well as on-foot exploration and equipment setup, take place in a 2D overhead view, while battles take place as full-3D flight sequences. It is necessary to purchase upgrades and repairs outside of battle, and it is also possible to recruit additional crew members and obtain multiple distinct types of ships, each with their own abilities and weapon systems.</p>"},{"name":"Versailles - A Game of Intrigue","year":1998,"developer":"Cryo Interactive Entertainment","url":"psx-chd-roms-u-z/Versailles%20-%20A%20Game%20of%20Intrigue%20%28Europe%29.chd","filesize":522017143,"score":6.8,"genres":"Adventure > Educational > 1st-person > Puzzle elements > History > Europe > Detective / mystery","desc":"<p>In this historical game you are some sort of security guard at the court of Louis XIV. You have to prevent a destruction of such a lovely place as Versailles, where you search for bomb and the person, who want to activate it. Talking with characters, searching for clues and studying the Versailles, which is museum at present, you have to serve your King in the name of France.</p><p>The game is made with Omni-3D technology, which allows you to turn yourself in 360 degrees.</p>"},{"name":"Vib-Ribbon","year":1999,"developer":"NanaOn-Sha Co., Ltd.","url":"psx-chd-roms-u-z/Vib-Ribbon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":124908104,"score":7,"genres":"Action > Side view > 2D scrolling > Music / rhythm > Direct control > Fantasy","desc":"<p>Your rabbity character, Vibri, is composed of some fairly basic geometric shapes.  Vibri skips around along the eponymous vib ribbon and you have to control Vibri until the end, dodging obstacles to rack up as many points as you can.</p><p>The game is a music/party game.   Japanese band Laugh and Peace provides this game with some of it's soundtrack.  The soundtrack is used to generate the game levels.  By analyzing the music being played, the game creates the level you are playing in real-time and forces you to navigate that level.  Then once you have mastered the songs that come with Vib Ribbon, you can then put in your own music CD's to see what wild challenges you can create.</p>"},{"name":"Victory Zone: Real Pachinko Simulator","year":1995,"developer":"UNiT Inc.","url":"psx-chd-roms-u-z/Victory%20Zone%20-%20Real%20Pachinko%20Simulator%20%28Japan%29.chd","filesize":105022099,"score":"","genres":"Gambling > 1st-person > Real-time > Licensed","desc":"<p>As the name states, <em>Victory Zone</em> is a Pachinko simulator. Pachinko is a gambling device resembling a pinball machine without flippers. Balls are launched into the play field, to hopefully land in an area that gives bonus balls. The player can control the launch speed of the ball, but nothing else. The tables feature a slot machine mechanism in the center, that if landed on, will spin, with the largest payouts coming from here.</p><p><em>Victory Zone</em> includes 10 modern electronic tables, and 10 mechanical tables from Sankyo. Tables can be customized in various ways, including changing the background graphics and music, as well as gameplay changes. In addition, a two-player mode (called Attack Mode) is included, where one player has a certain amount of time on a table, then player 2 has to beat their score.</p><p>In-game, the table can be panned, zoomed, and rotated to examine it more closely. The player's wins and losses over time are recorded and can be viewed as a graph.</p>"},{"name":"Viewpoint","year":1996,"developer":"Sammy Corporation","url":"psx-chd-roms-u-z/Viewpoint%20%28Europe%29.chd","filesize":351934368,"score":7.4,"genres":"Action > Diagonal-down > 2D scrolling > Isometric > Arcade > Shooter","desc":"<p><em>Viewpoint</em> is a top-down orthographic perspective game in the tradition of Zaxxon. The PlayStation and Saturn versions feature 3D rendered graphics with texture maps, unlike the other versions which primarily feature shaded polygons.</p><p>One or two players (in hot-seat or cooperative mode) control a spaceship equipped with a laser cannon which can be charged (by holding the shooting button down) for a stronger blast. Besides the main weapon, three special weapons are available: a wall of fire which wipes the screen up in a wave, a nova-like blast and a circle of spherical-green homing missiles.</p>"},{"name":"Vigilante 8","year":1998,"developer":"Luxoflux Corp.","url":"psx-chd-roms-u-z/Vigilante%208%20%28Europe%29.chd","filesize":373342291,"score":7.7,"genres":"Racing / Driving > 1st-person > Behind view > Real-time > Arcade > Direct control > Automobile > Vehicular combat > Contemporary > North America","desc":"<p>The game takes place in the Western United States during a time of world-wide oil shortage in 1976. An organization known as OMAR (Oil Monopoly Alliance Regime) was making money off the shortage everywhere except in the United States. OMAR hires the best terrorist that $100 million could buy: Sid Burn. His job, aided by five hired Coyotes, is to destroy all gas refineries in the southwest of the U.S. so OMAR can bring the country to its knees. When gas prices went wild, six civilians who called themselves Vigilantes, led by the truck driver Convoy, began fighting against the Coyotes in different areas to keep OMAR from succeeding.</p><p><em>Vigilante 8</em> is a vehicular combat game similar to Twisted Metal in concept. Players can choose from eight characters with different agendas, and select vehicles ranging from classic 1970's muscle cars to a school bus, each stacked high with various kinds of weapons. Unlockables include two hidden levels (three in the Nintendo 64 version) and five hidden characters and cars. Multiplayer is also included: the PlayStation version allows two players (four in the Nintendo 64 version) to go head-to-head.</p>"},{"name":"Vigilante 8: 2nd Offense","year":1999,"developer":"Luxoflux Corp.","url":"psx-chd-roms-u-z/Vigilante%208%20-%202nd%20Offense%20%28Europe%29.chd","filesize":494277023,"score":7.4,"genres":"Racing / Driving > Behind view > Arcade > Shooter > Automobile > Vehicular combat","desc":"<p>More drivin' &amp; blastin' fun in this sequel to Vigilante 8. The Coyotes gang returns with a shocking new leader to seek revenge on OMAR, and the Vigilantes gang. </p><p>New cars, weapons and landscapes add new excitement to the game. There are 18 charcters with storylines to walk through, which in turn affects the other characters in the game, and how well you do in the single player missions will determine what happens in the later levels.</p><p>The Dreamcast and N64 versions both have 4 player modes, while the PSX sticks with 2 player gaming.</p>"},{"name":"VIP","year":2001,"developer":"Shanghai UBIsoft Computer Software Co., Ltd.","url":"psx-chd-roms-u-z/V.I.P.%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":433679830,"score":5.1,"genres":"Action > 3rd-person (Other) > Fighting > Mini-games > Shooter > Licensed","desc":"<p><em>V.I.P.</em> is based on the TV series of the same name. V.I.P. is a bodyguard agency that protects its clients in Hollywood, Beverly Hills, and Los Angeles. Pamela Anderson stars as Vallery Irons, the boss of the Vallery Irons Protection bodyguard agency.</p><p>In the game, the player controls one of the V.I.P. bodyguards (Vallery Irons, Tasha Dexter, Nikki Franco, Quick Williams, Johnny Loh), in a mission to rescue a plastic surgeon from LA's most famous mobster. In addition to the main story, the game includes more than 10 minigames.</p><p>The player controls his character simply by pressing the number 1-4 keys (in the Windows version) in correct order; this will control the character to kick or hit opponents. Sometimes the player can use the mouse for shooting enemies. After completing a mission, the player can unlock video clips or photos in the photo gallery. The game can be saved only after completing each mission.</p>"},{"name":"Viper","year":1998,"developer":"X-ample Architectures","url":"psx-chd-roms-u-z/Viper%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":388223096,"score":6.5,"genres":"Action > Behind view > Arcade > Shooter > Helicopter > Sci-fi / futuristic","desc":"<p>Aliens are trying to take over the world. It's your job to stop them - so you climb into your trusty chopper, the Viper, and fight your way through many alien-infested levels to the base of the enemy.</p><p>Viper is a fast-paced non-stop shoot 'em up action game. You fly through the levels with your chopper on a pre-set route with only a few junctions where you may choose the path to go; the entire screen will (especially in the later levels) be filled with bullets and explosions. Lots of add-on weapons may be picked up to improve your firepower.</p>"},{"name":"Virtual Kasparov","year":2001,"developer":"Titus Interactive, S.A.","url":"psx-chd-roms-u-z/Virtual%20Kasparov%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":447883007,"score":7,"genres":"Simulation > Strategy > Top-down > Isometric > Chess > Licensed","desc":"<p><em>Virtual Kasparov</em> is a chess game with thirty-one opponents of varying difficulty to face in a story mode. Victory over this multi-cultural group of chess players will lead to Garry Kasparov himself.</p><p>Various styles of boards are included along with several 3D boards. Multiplayer is supported via link-cable or on a single system.</p>"},{"name":"Virtual Pool","year":1997,"developer":"Celeris Inc.","url":"psx-chd-roms-u-z/Virtual%20Pool%20%28Europe%29.chd","filesize":459903905,"score":7.4,"genres":"Educational > Sports > Strategy > 1st-person > Top-down > Pool / snooker > Math / logic > Science","desc":"<p>Virtual Pool is the definitive pool simulation game that actually teaches novice players how to play and even promises to improve the game of the pool shark. Developed by a team of physicists and professional pool players, Virtual Pool brings the game to life with the highest degree of accuracy. Balls roll, skid, collide and move on a fully rendered 3D controlled pool table that mirrors reality. </p><p>Virtual Pool has revolutionary features that allow players to actually 'walk' around the table to check out their next shot, take a closer look, back away, look left or right and then line-up the shot like they would in a real game with a real table. This title also allows players to take an overhead view from above, something unavailable in a real pool game! </p><p>Taking game tips from World Champion pool player \"Machine Gun\" Lou Butera is guaranteed to improve the player's game. \"Machine Gun\" Lou will teach players over 30 famous trick shots the player can practice on their computer screen and then implement on a real table.</p>"},{"name":"Virtual Pool 3","year":2003,"developer":"Digital Mayhem","url":"psx-chd-roms-u-z/Virtual%20Pool%203%20%28USA%29.chd","filesize":121729579,"score":7.8,"genres":"Sports > 1st-person > Pool / snooker > Licensed","desc":"<p>Pool simulator which uses an entirely 3d enviroment and physics fine-tested by pro players. Following the tradition set in previous Virtual Pool games you get a pro host, this time Jeanette \"Black Widow\" Lee, who teaches you the basics of the game via some videos and also plays against you as the \"boss\" of the career mode. You can also play in tournaments or single games with 21 game variations to choose from, 8 venues and several tables ranging from amateur to championship which you can also customize by selecting their speed, pocket cut, etc.Includes multiplayer support for up to 4 players.</p>"},{"name":"Virus: It Is Aware","year":1999,"developer":"Cryo Interactive Entertainment","url":"psx-chd-roms-u-z/Virus%20-%20It%20Is%20Aware%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":258290541,"score":"","genres":"Action > 3rd-person (Other) > Puzzle elements > Survival horror > Cyberpunk / dark sci-fi > Detective / mystery > Licensed","desc":"<p><em>Virus: It Is Aware</em> is a loose spin-off of the 1999 horror film <em>Virus</em>, and also the Dark Horse comic which the film is based on. Despite the fact that the game's opening and closing cinematics are set on a boat and space station like the film and comic series, the game itself is totally disconnected from both the source material and the game's own prologue and epilogue, instead being set in a high-tech hotel. </p><p>In this survival horror game, the player controls the female police officer Joan, who, along with her partner Sutter, investigates numerous murders of the hotel's inhabitants, only to discover that an alien electronic virus uses mechanical items to create robots, who in turn are built into the human corpses, creating zombie-type cyborgs. The game features light puzzle elements along with weapon-based combat, utilizing weapons such as pistols, Uzis and tazers; while the ballistic weapons are replenished by ammunition pickups, the tazer utilizes a depletion-recharge system.</p>"},{"name":"Viva Soccer","year":1999,"developer":"Crimson","url":"psx-chd-roms-u-z/Viva%20Soccer%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.chd","filesize":447656510,"score":7.1,"genres":"Sports > Diagonal-down > Direct control > Multiple units/characters control > Football (European) / Soccer","desc":"<p><em>Viva Soccer</em> is the first game to allow a player to take part and re-write history in all Football World Cups (including the qualifying stage) from 1958 until 1998. Deal with players retiring, new talent emerging and the geopolitical changes of the 90s as the Iron Curtain opens and several new national teams emerge.</p><p>Instead of using commentators, Viva relies on PlayerChat, which means only the sounds of the stadium - players and crowd - will be audible. 1035 squads (some with individual shirts) and 16554 players with different attributes (and some with personalized textures and models) are included in the game.</p>"},{"name":"VMX Racing","year":1997,"developer":"Studio e","url":"psx-chd-roms-u-z/VMX%20Racing%20%28Europe%29.chd","filesize":361026361,"score":5.3,"genres":"Racing / Driving > Behind view > Motorcycle > Vehicle simulator","desc":"<p><em>VMX racing</em> is a 3D dirt bike racing simulation.</p><p>The game features four bikes, six different tracks, both outdoor and in stadiums. You can unlock bonus tracks (including one that takes place on the moon) trough performing tricks during the races. You can choose from individual races or a championship in which you play all tracks. Each time you race against seven opponents. One of them can be a friend in two player split-screen mode.</p>"},{"name":"Voice Fantasia S: Ushinawareta Voice Power","year":1997,"developer":"Pre-Stage Inc.","url":"psx-chd-roms-u-z/Voice%20Fantasia%20-%20Ushinawareta%20Voice%20Power%20%28Japan%29.chd","filesize":451649207,"score":"","genres":"Adventure > Top-down > Anime / Manga > Fantasy","desc":"<p>The hero of this game is a young man who enjoys playing video games (don't we all?..). One fine day, he rents a new game; after firing it up, a princess appears on the screen, calling for help. A moment later, a demonic hand reaches to the hero and pulls him into the TV! The hero is teleported into an alternate world, a kingdom that is a mixture of medieval and modern day-like environment. This world is in danger, and only those who have the magical \"voice power\" can save it! The hero meets the young female magician named Whip and the princess of the country, Fret; together, they must stop the evil and figure out a way for the hero to go back to his world.</p><p><em>Voice Fantasia</em> might look like an RPG, but in reality its gameplay is much closer to the adventure variety, the RPG elements reducing to a mini game-like status. Most of the gameplay here is dedicated to exploring the world, talking to characters, and acquiring and using items needed to advance the story. The infrequent turn-based battles are dictated by the story. Three girls join the party, and are able to use \"voice powers\", which are in effect attacks of various properties. There is no experience system of any kind.</p><p>There is also a mild \"dating simulation\" element in the game. The player is able to buy presents for the girls, invite them for dinner, etc. When staying at the hotel, those anime-style fantasy characters are replaced by video footage of real voice actresses. The player is able to talk to them and ask a variety of questions.</p>"},{"name":"Voltage Fighter Gowcaizer","year":1997,"developer":"Technos Japan Corp."},{"name":"VR Baseball '97","year":1997,"developer":"VR Sports","url":"psx-chd-roms-u-z/VR%20Baseball%20%2797%20%28Europe%29.chd","filesize":209467433,"score":6.6,"genres":"Sports > Baseball > Licensed","desc":"<p><em>VR Baseball '97</em> is a baseball game. It prides itself on being the first fully 3D baseball game. You also have complete control over your camera to view the action from any angle. </p><p>The game comes with a Major League Baseball license and thus features over 700 Major League Baseball players, 28 official stadiums, and all the statistics from the 1997 season. </p><p>Game modes include Exhibition Game and Home Run Derby. Both can be played in multi-player mode.</p>"},{"name":"VR Baseball '99","year":1998,"developer":"VR Sports","url":"psx-chd-roms-u-z/VR%20Baseball%2099%20%28Europe%29.chd","filesize":223176115,"score":7.2,"genres":"Sports > Baseball > Licensed","desc":"<p><em>VR Baseball '99</em> is the sequel to VR Baseball '97. In this simulation you can play any of the 30 Major League Baseball teams in their authentic stadiums. Over 750 real players are included in the game.Gameplay modes include: exhibition, season and home run derby. All available in three difficulty levels.</p><p>The developer has aimed to make the pitching and batting more action based, and thus they do not include menu options, but are performed solely with button combos.</p>"},{"name":"VR Sports Powerboat Racing","year":1998,"developer":"Promethean Designs Ltd.","url":"psx-chd-roms-u-z/VR%20Sports%20Powerboat%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":421327644,"score":6,"genres":"Racing / Driving > Sports > 1st-person > 3rd-person (Other) > Arcade > Sailing / boating","desc":"<p>This game represents an arcade-style approach to powerboat racing.  Races take place on enclosed circular waterways in easily recognizable locations around the world. There are several types of races, including the standard championship, time trial, practice, and multiplayer modes.</p><p>The boats you can choose to drive vary slightly in type and ability.  You start off with only monohull boats, but you can unlock catamaran boats by winning championships.</p><p>The tracks are equipped with shortcuts and lots of animated background objects to enhance the racing action.</p>"},{"name":"Vs.","year":1997,"developer":"Polygon Magic, Inc.","url":"psx-chd-roms-u-z/Vs.%20%28Europe%29.chd","filesize":141793134,"score":"","genres":"Action > Side view > Arcade > Fighting > Direct control > Contemporary","desc":"<p><em>Vs.</em> is a Western adaptation of Polygon Magic's fighting game Fighters' Impact. It features the same basic gameplay but a brand-new cast of 16 characters (plus four bosses). These new characters have a 90s alternative look and were designed by American comic book artist Kurtis Fujita. It also replaces the original game's soundtrack with licensed alternative rock.</p>"}]