[{"name":"Wacky Races","year":2000,"developer":"Appaloosa Interactive Corporation","url":"psx-chd-roms-u-z/Wacky%20Races%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.chd","filesize":284553940,"score":6.3,"genres":"Racing / Driving > Behind view > Direct control > Licensed","desc":"<p>For those who can remember the cartoon series, this will be a blast from the past. Choose from all your favourite characters including Peter Perfect, Penelope Pitstop and, of course, Dick Dastardly and Muttley, and wind your way through cartoon like environments in the familiar vehicles of each character. Simply get to the end of the race first to open up new tracks, and use weapons to pick off the rest of the cast, and aid your progress.</p>"},{"name":"WaiWai Kart","year":2003,"developer":"Now Production Co., Ltd."},{"name":"Waiwai Sannin Uchi Mahjong","year":2000,"developer":"Hori Electric Co., Ltd."},{"name":"Waku Waku Derby","year":1997,"developer":"Dream Japan","url":"psx-chd-roms-u-z/Waku%20Waku%20Derby%20%28Japan%29.chd","filesize":24265531,"score":"","genres":"Simulation > Sports > Side view > Text-based / Spreadsheet > Anime / Manga > Horse / derby","desc":"<p>A new sensational horse racing simulation game as a result of combining board game and racing game together!<br>Raise your horse during the board phase and win the race with your favorite horse during the racing phase to earn the prize money.<br>The trick for wining the race is to plan your strategy by utilizing the characteristics of the horse and make use of information such as the racing distance and courses on the turf or dirt.<br>So work your way to keep winning with your favorite horse!</p>"},{"name":"Wakusei Koukitai - Little Cats","year":1998,"developer":"Family Soft Co., Ltd.","url":"psx-chd-roms-u-z/Wakusei%20Koukitai%20-%20Little%20Cats%20%28Japan%29.chd","filesize":268559557,"score":"","genres":"Simulation > Strategy > 1st-person > Top-down > Anime / Manga > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>The galaxy is threatened by robotic enemies from a remote space. In order to stop them, giant combat robots were deployed to a space station under the command of Colonel Goofy Reagan. The combat robots are navigated by the best pilots, which happen to be cute teenage girls. Since the Colonel is very busy, he needs somebody to watch over the girls and train them. This somebody would be Major David Lowe, the protagonist of the game...</p><p><em>Little Cats</em> is somewhat similar to  Sakura Taisen games, with adventure and dating elements reduced, and simulation elements added. David has to make schedules for the girls and decide how much and what exactly they should train. Running competitions, shooting range, robot navigation - everything can be trained, but at the expense of the girls' stamina, which means they will need to rest as well. During the simulation mode, it is also possible to wander around the space station and spend time with the girls.</p><p>The strategy part consists of navigating the robots over a battle field in turn-based fashion. The robots have a wide range of attacks, and it is possible to change their weapons and use items in combat. Once the robots attack each other, an automatic attack sequence is shown.</p>"},{"name":"Walt Disney World Quest: Magical Racing Tour","year":2000,"developer":"Silent Software Incorporated","url":"psx-chd-roms-u-z/Walt%20Disney%20World%20Quest%20-%20Magical%20Racing%20Tour%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%29.chd","filesize":431023355,"score":6.7,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>A cart racing game featuring Disney Characters  Starring Jiminy Cricket, Chip, and Dale, and a few characters created specifically for the game.  The catch is that all of the tracks are actually based on rides at all of the four Walt Disney World Parks (Haunted Mansion, Splash Mountain, Space Mountain, Rock'n'Rollercoaster, Typhoon Lagoon, etc...).</p>"},{"name":"Walt Disney's The Jungle Book: Rhythm n' Groove","year":2000,"developer":"Ubi Soft Entertainment Inc.","url":"psx-chd-roms-u-z/Walt%20Disney%27s%20The%20Jungle%20Book%20-%20Rhythm%20n%27%20Groove%20%28USA%29.chd","filesize":531996148,"score":6.6,"genres":"Action > 3rd-person (Other) > Music / rhythm > Licensed","desc":"<p>Rhythm n' Groove is a dancing game very much modeled after Dance Dance Revolution.  Arrows travel across the screen, and when they reach the right spot, you hit the necessary button on either your controller or dance pad.</p><p>The game follows the story of Disney's The Jungle Book cartoon.  Some songs are remixes of the cartoon's music, while others are original.</p>"},{"name":"Wanted","year":2004,"developer":"Na.p.s. Team s.n.c.","url":"psx-chd-roms-u-z/Wanted%20%28Europe%29.chd","filesize":9730346,"score":"","genres":"Action > Behind view > Arcade > Shooter > Western","desc":"<p><em>Wanted</em> is a Western themed single player 3D shooter game played from a third person perspective. The James gang has overrun the town of Dodge, robbing banks and shooting the innocent, and it’s now up to the player to rid the town of this scum.</p><p>The game offers several missions in which gang members appear in the windows of town buildings. The player starts the game with three lives and has the ability to dodge enemy fire. As the player progresses they can pick up better guns and use these till they are empty.</p>"},{"name":"War Gods","year":1997,"developer":"Midway Games, Inc.","url":"psx-chd-roms-u-z/War%20Gods%20%28Europe%29.chd","filesize":147078606,"score":5.1,"genres":"Action > 3rd-person (Other) > Arcade > Fighting","desc":"<p>War Gods is a one-on-one fighting game that takes place in 3D environments. The fighter under your control can perform many different moves, and string those moves together to perform \"combos.\"  Furthermore, the fighters all have special \"finishing moves\" that eliminate your opponent in some gruesome manner at the end of a match.  There are 10 different fighters to choose from, all based on different ancient civilizations.</p><p>The graphics in War Gods are fairly unique. They were created by texture-mapping 3D character models with digitized photos of people.  This gives them a reasonably lifelike look.</p>"},{"name":"WarCraft II: The Dark Saga","year":1997,"developer":"Blizzard Entertainment Inc.","url":"psx-chd-roms-u-z/WarCraft%20II%20-%20The%20Dark%20Saga%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":447144611,"score":7.5,"genres":"Strategy > Top-down > Free-roaming camera > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Fantasy > Steampunk > War","desc":"<p>This port of <em>Warcraft II</em> includes all the missions from Warcraft II: Tides of Darkness and its expansion pack, Beyond the Dark Portal, into one package. </p><p>New features for the console release include an auto-build option, where the player can set a queue of units to be produced and the ability to select sixteen units at a time instead of the PC's nine.</p>"},{"name":"WarGames: DEFCON 1","year":1998,"developer":"Interactive Studios Ltd.","url":"psx-chd-roms-u-z/WarGames%20-%20Defcon%201%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":288996376,"score":7.6,"genres":"Action > Strategy > Behind view > Cold War > Sci-fi / futuristic > Licensed","desc":"<p>Inspired by the 1980s movie about a computer trying to take over the world, this action/strategy game allows you to field either the tanks of human NORAD or the walkers of AI-controlled WOPR, in warzones across the world.</p><p>You control one vehicle and can cycle through all the units in your current army at any time, and there are limited commands you can issue to the rest of your army. For example, you can tell all the units in your army to follow your vehicle. However this can be unreliable due to poor pathfinding.</p><p>There is a huge range of vehicles available for each army, from reconnaissance jeeps and bikes through heavy tanks and walkers all the way to the really special toys, laser and stealth tanks. There are air and sea assault troops available as well.</p><p>You receive your mission objectives in e-mails sent from mission control (or WOPR itself) which update as you fulfill briefs. These can be as simple as 'go there, kill that' but sometimes require more complex tasks such as picking up a spy from behind enemy lines, crippling a base's SAM sites to allow an attack from the air, and so on.</p><p>One major draw of the game is an enjoyable two-player co-operative mode. Using a unique split-screen view (split diagonally instead of vertical/horizontal) both players control a vehicle each, and can cycle through the rest. This can be interesting as one player lends air support while the other storms the AA sites with a tank, for example.</p><p>In addition to co-operative mode, there is a head-to-head multiplayer mode available and about 30 levels in the single player mode.</p>"},{"name":"Warhammer: Dark Omen","year":1998,"developer":"Mindscape International Ltd.","url":"psx-chd-roms-u-z/Warhammer%20-%20Dark%20Omen%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":400914490,"score":7.6,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Real-time > Fantasy > Licensed","desc":"<p>This sequel to Warhammer: Shadow Of The Horned Rat is an overhead role playing game in which you play Morgan Bernhardt. The game consists of a series of battles where you view the battle from overhead via a rotatable view. You go through the game managing your army, deciding whether to fight in optional battles, and advancing through a deep and engrossing storyline via a series of conversations played out by talking portraits.</p>"},{"name":"Warhammer: Shadow of the Horned Rat","year":1996,"developer":"Mindscape International Ltd.","url":"psx-chd-roms-u-z/Warhammer%20-%20Shadow%20of%20the%20Horned%20Rat%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":492675176,"score":7.2,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Isometric > Real-time > Fantasy > Licensed","desc":"<p><em>Warhammer: Shadow of the Horned Rat</em> is one of the first 3D real-time strategy games. The game is based on the medieval fantasy world from <em>Games Workshop Warhammer Fantasy Battle</em> tabletop game. The player takes on the role of mercenary commander Morgan Bernhardt, with the Skavens (humanoid, intelligent rats) as the main villains. <em>Warhammer: Shadow of the Horned Rat</em> is non-linear, the player can choose alternative missions to progress. Troops are transferred from mission to mission - as is their loss. The player commands whole groups, not single units (similar to the games in the Total War series. Soldiers themselves belongs to various groups (cavalry, infantry, machinery, archers, etc.).</p>"},{"name":"Warhawk: The Red Mercury Missions","year":1995,"developer":"SingleTrac Entertainment Technologies, Inc.","url":"psx-chd-roms-u-z/Warhawk%20-%20The%20Red%20Mercury%20Missions%20%28Europe%29.chd","filesize":376759114,"score":8.1,"genres":"Action > Simulation > Behind view > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>Warhawk</em> is an action/simulation game built around a futuristic VTOL craft. The player maneuvers with 360 degrees of flight control through 6 unique levels.</p><p>3D weapons include fire off lock-ons, rockets, multi-fire swarmers, and plasma cannons. The player will need all of these when deadly air and ground forces surround him in desert and volcanic wastelands, castle hallways and chambers, and gothic tower airships.</p><p>There are no saving or loading features. Instead, a password is presented each time a level is completed. In 2007 Incognito Entertainment remade the title as a multiplayer-only PlayStation 3 game.</p>"},{"name":"WarJetz","year":2001,"developer":"The 3DO Company","url":"psx-chd-roms-u-z/World%20Destruction%20League%20-%20WarJetz%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":305080971,"score":5.5,"genres":"Action > 3rd-person (Other) > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>War Jetz is the much-anticipated sequel to 3DO's World Destruction League: Thunder Tanks. Instead of cruising around 3-D landscapes in your tank looking for your opponents you can now think in 4 dimensions. You now have the ability to hop into the cockpit of several futuristic air combat machines in this next step in WDL history.</p>"},{"name":"Warm Up!","year":2000,"developer":"Lankhor","url":"psx-chd-roms-u-z/Warm%20Up%21%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.chd","filesize":142625096,"score":6.8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator","desc":"<p>A Formula 1 game without the official license, with a simulation mode and a very arcade mode. This is the sequel of F1 World Grand Prix. 22 cars racing on 17 tracks, against computer or even online. It also has a ghost mode to challenge you against your best time on each track. A replay also allows you to review your best laps.</p><p>The game features some original camera (like the helmet view), and offers the possibility to fine-tune your car in simulation mode, so the immersion is total. However, it is focusing more on fun than on realism, and thus it is not the most accurate F1 simulation available.</p><p>The game features a fast-paced arcade mode, dedicated to speed and fun.</p>"},{"name":"Warpath: Jurassic Park","year":1999,"developer":"Black Ops Entertainment, LLC","url":"psx-chd-roms-u-z/Warpath%20-%20Jurassic%20Park%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":360340727,"score":5.9,"genres":"Action > 3rd-person (Other) > Fighting > Licensed","desc":"<p>Using the many dinosaurs from the two Jurassic Park movies, you choose your type and fight it out one-on-one with other dinos to become the supreme dino in the park.</p><p>Each arena represents a place in the two Jurassic Park movies, and there is a museum to visit, with info on all of the dinosaurs that are in the game.</p><p>As usual, the more you complete, the more that becomes available, with new dino's to play with, new arenas and some new play modes.</p>"},{"name":"Warriors of Fate","year":1996,"developer":"Capcom Co., Ltd."},{"name":"Warriors of Might and Magic","year":2000,"developer":"The 3DO Company","url":"psx-chd-roms-u-z/Warriors%20of%20Might%20and%20Magic%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":424058380,"score":6,"genres":"Role-playing (RPG) > Behind view > Real-time > Action RPG > Fantasy","desc":"<p>Step into the shoes of a warrior by the name of Alleron. Framed for a crime in which he did not commit he is branded with a painful mask and banished into the depths of the dungeon. Here he must fight his way out and discover the truth behind this crime. Will he save the world from destruction or will he fall at the feet of his nemesis?</p><p><em>Warriors of Might and Magic</em> is an action game with RPG elements set in the Might and Magic universe. The gameplay style is similar to that of Crusaders of Might and Magic. The player navigates Alleron through predominantly dungeon-like environments, fighting enemies in action-based combat, executing various melee moves (including blocking), and casting spells.</p>"},{"name":"Warzone 2100","year":1999,"developer":"Pumpkin Studios","url":"psx-chd-roms-u-z/Warzone%202100%20%28Europe%29%20%28En%2CEs%2CIt%29.chd","filesize":427641646,"score":7.7,"genres":"Strategy > Diagonal-down > Free-roaming camera > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Post-apocalyptic > Sci-fi / futuristic > War","desc":"<p>Earth's defense satellites accidentally launch nuclear warheads due to computer malfunction.  Our planet is destroyed, except for a few factions that rebuild their strength and attempt to dominate the brave new world.  As you make your way across the wasteland, hunting down artifacts and destroying hostile forces, you find out that the satellite's unexpected nuclear launch may not have been entirely accidental after all...</p><p>You are in charge of searching the land for technological artifacts held by the other fellows.  These artifacts are then researched to create new weapons, chasses, and propulsion types, all of which are interchangable, meaning there are over 2000 units for you to blow stuff up with.  You can build tanks, hovercraft, Vertical Take Off/Landing (VTOL) vehicles, as well as cyborg units.  There are machine guns, missile launchers, flame throwers, mortars, etc.  Since all your technology comes from artifacts you swipe from your enemies, you are almost always fighting with weapons a step below what the other guy has, meaning you have to rely on your strategic prowess instead of sheer military superiority.  The battlefield is fully 3D, the camera is rotatable and zoomable, and all units are 3D as well, except for humans, which are sprites, but they aren't too plentiful, so it's a minor point.</p>"},{"name":"Wayne Gretzky's 3D Hockey '98","year":1997,"developer":"Software Creations Ltd.","url":"psx-chd-roms-u-z/Wayne%20Gretzky%27s%203D%20Hockey%20%2798%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.chd","filesize":11595975,"score":7,"genres":"Sports > 3rd-person (Other) > Hockey > Licensed","desc":"<p><em>Wayne Gretzky's 3D Hockey '98</em> is basically the same game as its predecessor with only a few minor changes such a updated teams and new statistics.</p><p>The game offers two basic playing options: simulation and arcade. While simulation tries to be relatively realistic (but still relatively fast-paced in comparison to similar games), the arcade mode ignores penalties and features a power shot. The player may either participate in exhibition matches, a whole season, play-offs or practice. Thanks to the official NHL and NHLPA licenses, there are 26 teams with real-life athletes available.</p>"},{"name":"WCW Backstage Assault","year":2000,"developer":"Kodiak Interactive Software Studios, Inc.","url":"psx-chd-roms-u-z/WCW%20Backstage%20Assault%20%28Europe%29.chd","filesize":452558658,"score":5.2,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>Moving away from the usual in-ring wrestling action, <em>WCW Backstage Assault</em> is just that, one-on-one battles in locker rooms, bathrooms, outdoor arenas and much more. Each wrestler has his/her usual set of moves, plus the ability to use the surroundings and any items (chairs, tables, etc.) they can find.</p><p>You can create your own wrestler, modify an existing wrestler, or choose from a large collection of WCW talent, competing for special championship belts, or hardcore matches where every win opens up hidden secrets.</p>"},{"name":"WCW Mayhem","year":1999,"developer":"Kodiak Interactive Software Studios, Inc.","url":"psx-chd-roms-u-z/WCW%20Mayhem%20%28Europe%29.chd","filesize":295551609,"score":7.1,"genres":"Action > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>In <em>WCW Mayhem</em> you can wrestle as more than 50 of your favorite WCW wrestlers in all 12 of the company's pay-per-view sets and their three major television programs, \"Nitro\", \"Thunder\" and \"Saturday Night\". Fights can occur in the ring, or you can take the match out to the backstage area.</p><p>The game also includes a create a wrestler mode to bring your own grapplers to the ring and a feature to unlock pay-per view events with the use of special codes (this feature was dropped after only three months). Running commentary by WCW's main announcer Tony Schiavone and (PlayStation version only) Bobby \"The Brain\" Heenan lend an air of authenticity to the presentation of the game.</p>"},{"name":"WCW Nitro","year":1998,"developer":"Inland Productions, Inc.","url":"psx-chd-roms-u-z/WCW%20Nitro%20%28Europe%29.chd","filesize":394927151,"score":5.4,"genres":"Sports > 3rd-person (Other) > Arcade > Wrestling > Licensed","desc":"<p>Take control of your favourite WCW wrestler and battle it out in the ring. The 16 wrestlers (to start) in the game include such greats as Kevin Nash, Buff Bagwell and Hollywood Hulk Hogan.</p><p>Based on WCW's flagship television program, \"WCW Monday Nitro\", this arcade-style game puts you (or a partner) in a button-mashing brawl featuring many of WCW's most popular stars and their signature maneuvers. There are single and tag match options for one or two players and a single-player tournament mode, where the player must battle through a series of matches to become a champion.</p><p>As you progress, you can unlock new characters to take to the ring, including more WCW wrestlers and personnel, as well as fictional characters and THQ staff members.</p>"},{"name":"WCW vs. the World","year":1997,"developer":"The Man Breeze, Inc.","url":"psx-chd-roms-u-z/WCW%20vs.%20the%20World%20%28Europe%29.chd","filesize":357648338,"score":6.9,"genres":"Sports > 3rd-person (Other) > Direct control > Wrestling > Licensed","desc":"<p>Wrestle the world's toughest WCW wrestlers. Control non-stop 3D action in and out of the ring!</p><p>You can play as one of 15 WCW wrestlers, including Chris Benoit, Lex Luger, Dean Malenko, Ric Flair, Eddie Guerrero, Hollywood Hulk Hogan, and many more!</p><p>Choose from 60 wrestlers from 6 different organizations each with 30 to 40 moves per wrestler and play in over 10 hot 3D arenas!</p>"},{"name":"WCW-nWo Thunder","year":1998,"developer":"Inland Productions, Inc.","url":"psx-chd-roms-u-z/WCW-nWo%20Thunder%20%28Europe%29.chd","filesize":392113960,"score":6.2,"genres":"Action > Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>The follow up to WCW Nitro, which features real entrance videos used on WCW Thunder on TBS. Modes included: Battle Royal, Tournament, Tag Team and Single Player. This game also introduced the cage match, and weapons close to ringside. The game features over 50 WCW superstars and personalities, and action commentary by Tony Schivone and Mike Tenay.</p>"},{"name":"Weakest Link","year":2001,"developer":"Traveller's Tales (UK) Ltd.","url":"psx-chd-roms-u-z/Weakest%20Link%2C%20The%20%28Europe%29.chd","filesize":381666251,"score":5.7,"genres":"Simulation > 3rd-person (Other) > Game show / trivia / quiz > Licensed","desc":"<p>A home version of the popular TV show, where playing as one of the 24 selectable characters you will have to answer questions, bank prize money and vote tactically to become the winner.  </p><p>Questions are presented in a multiple choice format with only the first letter of the answers displayed. Difficulty settings can be changed so that all the answers are shown fully, or for the Junior setting there is only a choice of 2 answers.</p><p>The game supports single and multiplayer options for the main game plus there is a longer single player championship mode where you must play and win 4 shows to succeed. </p><p>The game faithfully creates the TV studio setting and features video and sound clips of host Anne Robinson for an authentic Weakest Link experience.</p>"},{"name":"Welcome House","year":1996,"developer":"Gust Co., Ltd.","url":"psx-chd-roms-u-z/Welcome%20House%20%28Japan%29.chd","filesize":132204035,"score":"","genres":"Adventure > 3rd-person (Other) > Cinematic camera > Full Motion Video (FMV) > Direct control > Comedy","desc":"<p><em>Welcome House</em> is an adventure game which has players take the role of Keaton Paxman who is visiting his rich uncle Parkinson on April Fools. When Keaton got to his uncle's estate, his car broke down and, on top of that, when he entered the mansion, the door got jammed trapping him inside the mansion. Now, players must help Keaton find a way out of the mansion. </p><p>The game never takes itself seriously, featuring a lot of slapstick humor and a laugh track when Keaton uses an item in the wrong place or gets into a trap. There are no enemies, Keaton can't die in the game and the traps that are scattered across the mansion are mainly for comic relief making it kid friendly. Players will need to locate keys, books, food and other objects and use them in the right place to get to the locked rooms and progress through the game.</p>"},{"name":"Welcome House 2: Keaton & His Uncle","year":1996,"developer":"Gust Co., Ltd.","url":"psx-chd-roms-u-z/Welcome%20House%202%20-%20Keaton%20and%20His%20Uncle%20%28Japan%29.chd","filesize":154744581,"score":"","genres":"Adventure > 3rd-person (Other) > Cinematic camera > Full Motion Video (FMV) > Direct control > Comedy","desc":"<p><em>Welcome House 2: Keaton &amp; His Uncle</em> is a sequel to the Welcome House adventure game. The game starts on the 4th of July with Keaton sleeping in bed when his prankster uncle Parkinson gives him a bombing wake-up call. Confused and angry, Keaton goes through all the traps he had set for him to find his uncle, give him a piece of his mind and leave the mansion for good.</p><p>Players once again navigate Keaton through the mansion. The gameplay can be described as playing Resident Evil but without the monsters. The slapstick humor is still intact with more explosions, trapdoors, shower scenes and a laugh track when Keaton gets into any of these traps. The game also adds voice acting for the dialogues. None of the traps are lethal so players can enjoy seeing how Keaton gets squished, smashed, trips and falls and can't progress to a new area without pulling the necessary levers. Players will still need to locate keys and other items and use them to progress through the game.</p>"},{"name":"Weltorv Estleia","year":1999,"developer":"Hudson Soft Company, Ltd.","url":"psx-chd-roms-u-z/Weltorv%20Estleia%20%28Japan%29.chd","filesize":150806209,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Turn-based > Fantasy","desc":"<p><em>Weltorv Estleia</em> is a non-linear role-playing game set in a medieval fantasy world with its own mythical history and lore. The background story involves a battle between seven legendary warriors, led by the young magician Ten, against an evil dragon. The player assumes the role of a nameless adventurer, male or female, who ventures to the city of Farbell. There, he or she is instructed to join the the Adventurers Guild, and eventually becomes involved in the grand struggle against dark forces threatening Estleia.</p><p>In the beginning of the game the player has to create a customized character, modifying his or her age, hair color, clothes, height, and weight. Character class can not be assigned, but the player character can eventually specialize as either a monk, a magician, or a thief, by completing missions for the respective guilds. The protagonist has three main attributes - spirit, technique, and vitality, which can be manually increased whenever he or she levels up. Other attributes include various aspects of physical preparation and conditions, which act as requirements for equipping weapons and armor. Experience points in the game are awarded for defeating enemies as well as for completing quests.</p><p>Despite its Japanese origins, <em>Weltorv Estleia</em> is a free-form RPG that is closer to Western templates. The game's world consists of interconnected areas and contains several towns, wilderness areas, and dungeons. The player is free to explore the game world and undertake any quests from the onset. The game's scenario system allows players to pursue as many quests as they wish at the same time. By interacting with the various non-player characters, the player gets key words or key phrases indicating details and giving clues about the currently selected active scenario. The scenarios will then trigger when the player, having followed the clues, reaches the scenario point. By fulfilling the requirements for each scenario, the player progresses through the game. There are over a hundred scenarios, ranging in length and difficulty, sometimes having different possible outcomes.</p><p>Interaction with NPCs also allows the player to express emotions by having the player character smile, cry, or become angry. These emotional responses during conversations may influence the way NPCs react to the hero. The player can also have the main character draw his weapon at any time. </p><p>Combat in the game is turn-based. Battles are fairly sporadic and occur either in a scripted manner, dictated by the scenario, or by approaching hostile creatures that may be encountered in the wilderness. The player navigates the main character on the battle screen in a tactical fashion, attacking enemies when they are within the range of the equipped weapon. Over the course of the game, several characters may join the hero's party, usually as a possible scenario outcome. These characters are controlled by the AI during combat.</p><p>The game's outdoor areas (including towns), dungeons, as well as all the characters and enemies, are rendered in 3D. Only smaller indoor locations such as shops, guilds, bars, people's houses, etc., are presented as pre-rendered backgrounds. There are no character portraits and the game generally eschews anime-style aesthetics usually associated with RPGs of Japanese origin.</p>"},{"name":"Westlife Fan-O-Mania","year":2002,"developer":"Runecraft Ltd.","url":"psx-chd-roms-u-z/Westlife%20-%20Fan-O-Mania%20%28Europe%29.chd","filesize":425227239,"score":"","genres":"Puzzle > Text-based / Spreadsheet > Game show / trivia / quiz > Contemporary > Licensed","desc":"<p><em>Westlife Fan-O-Mania</em> is a quiz game aimed at fans of the Irish boy-group Westlife. The game consists of 500 questions centered around the band members and their lives. If the player correctly answers all questions in one level, a video interview with one of the boys is shown. There are five levels in total presented by a hostess named Tara. A multiplayer mode lets players compete against each other to see who knows the most about the band. The game also features video snippets, a photo gallery and audio recordings of the band members.</p>"},{"name":"Wheel of Fortune","year":1998,"developer":"Artech Digital Entertainment, Ltd.","url":"psx-chd-roms-u-z/Wheel%20of%20Fortune%20%28USA%29.chd","filesize":362637494,"score":6.7,"genres":"Puzzle > Game show / trivia / quiz > Word construction > Licensed","desc":"<p>The long running game show hits the PC. All the areas of the show are here to play, including all of the prizes, 2000 puzzles and plenty of FMV of lovely hostess Vanna White. </p><p>There is a new version of the game also available, where you are given a certain amount of free spin disks. If you choose the wrong letter, or land on 'lose a turn' or 'bankrupt', you lose one of the disks. Once you run out, the game is over.</p>"},{"name":"Wheel of Fortune: 2nd Edition","year":2000,"developer":"Artech Digital Entertainment, Ltd.","url":"psx-chd-roms-u-z/Wheel%20of%20Fortune%20-%202nd%20Edition%20%28USA%29.chd","filesize":454340360,"score":6.6,"genres":"Puzzle > Game show / trivia / quiz > Word construction > Licensed","desc":"<p>This was Hasbro's second attempt at recreating the popular game show <em>Wheel of Fortune</em> on home computers. There are 2500 puzzles to work through, and a full roster of prizes. Against-the-clock bonus rounds are also included. You can also attempt an equivalent of the exam given to would-be contestants. Backstage video clips are included, and successful players will unlock interviews with glamorous hostess Vanna White.</p>"},{"name":"Whizz","year":1997,"developer":"Flair Software Ltd.","url":"psx-chd-roms-u-z/Whizz%20%28Europe%29.chd","filesize":56687147,"score":6.4,"genres":"Action > Isometric > Platform","desc":"<p><em>Whizz</em> is one of the few 3D platformers to use an isometric viewpoint. The controls reflect this, with moving the controller to the right actually moving the character down and right, moving it down and right moving the character down directly, and so on. Each level is played out against a time limit, and the paths through the level aren’t always clear-cut. There are four different types of doors, each of which needs a particular icon to pass (the icons represent the door type, such as ice or bricks, rather than hot water or a key, or anything you’d logically expect to clear the path). You can avoid the baddies, which may be the best option, as killing them costs you some energy –this reduces the significance of the points system.</p>"},{"name":"Who Wants to Be a Millionaire","year":2000,"developer":"Hothouse Creations Ltd.","url":"psx-chd-roms-u-z/Who%20Wants%20to%20Be%20a%20Millionaire%20%28Europe%29.chd","filesize":191617299,"score":6.2,"genres":"Puzzle > Game show / trivia / quiz > Licensed","desc":"<p>The game is based on the hit TV quiz show Who Wants to be a Millionaire? PC and Console games players can now experience for themselves the excitement and tension of the TV show as they try and win one million virtual pounds. The UK version of the game features audio clips of the TV show's host Chris Tarrant, who will be asking the questions, giving the answers, and of course, uttering the famous line, \"Is that your final answer?\"; other localized versions have different hosts/voices, in addition to using questions suitable for each country.</p>"},{"name":"Who Wants to Be a Millionaire: 2nd Edition","year":2000,"developer":"Revolution Software Ltd.","url":"psx-chd-roms-u-z/Who%20Wants%20to%20Be%20a%20Millionaire%20-%202nd%20Edition%20%28Europe%29.chd","filesize":248951583,"score":5.7,"genres":"Puzzle > Game show / trivia / quiz > Licensed","desc":"<p><em>Who Wants to Be a Millionaire Second Edition</em> is the second game based on the hit TV gameshow. You have to answer fifteen questions, slowly going up to the one million mark. If you have trouble, there are three lifeline you can use to help you: Phone a friend, 50/50 and ask the audience.</p>"},{"name":"Who Wants to Be a Millionaire: 3rd Edition","year":2001,"developer":"ImageBuilder Software, Inc.","url":"psx-chd-roms-u-z/Who%20Wants%20to%20Be%20a%20Millionaire%20-%203rd%20Edition%20%28USA%29.chd","filesize":255749942,"score":6.4,"genres":"Puzzle > 1st-person > Game show / trivia / quiz > Licensed","desc":"<p><em>Who Wants To Be A Millionaire: 3rd Edition</em> is the third game based on the successful TV show. Not surprisingly the game itself is unchanged with the exception of new questions. The player takes the role of a candidate and has to answer 15 questions by choosing the correct answer out of four given possibilities. </p><p>For every right answer he receives money but he also loses money when choosing poorly (there are two \"guarantee points\" where he falls back to so he doesn't lose all). There are also three jokers: eliminating two false answers, asking the viewers in the studio per poll and phoning a friend. In the game the latter is a prerecorded conversation.</p><p>The multiplayer mode is restricted to \"Fastest Finger\" competition where the next candidate is chosen. Here the players have to bring the four given answers into the right order and the fastest one wins. More questions are downloadable through the internet.</p>"},{"name":"Who Wants to Be a Millionaire: Junior","year":2001,"developer":"Hothouse Creations Ltd.","url":"psx-chd-roms-u-z/Who%20Wants%20to%20Be%20a%20Millionaire%20-%20Junior%20%28Europe%29.chd","filesize":154763051,"score":"","genres":"Puzzle > Text-based / Spreadsheet > Board game > Game show / trivia / quiz > Licensed","desc":"<p><em>Who Wants to Be a Millionaire: Junior</em> is a quiz game based on the successful TV show for one to four players.The basic rules are still the same: The player takes the role of a candidate and has to answer 15 questions by choosing the correct answer out of four given possibilities. For every right answer they receive money with the amount doubling with each correct answer. There are also the same three help options as in the televised game: 50:50 which eliminates two false answers, asking the studio 'audience' and phoning a friend, in the game the latter is a prerecorded conversion.</p><p>There are four modes of play, the straightforward quiz, Head to Head, a Team game, or the Fastest Finger game with the last three options becoming available only when multiple players are participating. </p><p>In this game there is no animated audience and no animated player characters. The game is played with the mouse but can also be played via the keyboard.</p>"},{"name":"Wild 9","year":1998,"developer":"Shiny Entertainment, Inc.","url":"psx-chd-roms-u-z/Wild%209%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":333740928,"score":7.4,"genres":"Action > Side view > Platform > Shooter > Sci-fi / futuristic","desc":"<p>Wex Major is a teenager from Earth whose parents were kidnapped by aliens. Traveling through space, Wex comes into contact with a powerful weapon system known as The Rig. Apparently the young boy is the only one who can harness the power of The Rig, and he is proclaimed The Great Champion, a legendary leader who can rid the oppressed people of the Andromeda Galaxy from the tyranny of the evil gigantic monster named Karn. Wex recruits other teenage mutants and becomes the leader of Wild 9, an organization that aims to overthrow Karn and liberate the galaxy.</p><p><em>Wild 9</em> is a 2D platformer with 3D graphics, featuring gameplay similar in vein to the company's Earthworm Jim games. Unique to the game is the The Rig, a weapon the protagonist wields. The Rig functions like an electronic lasso, capable of moving objects as well as carry around and smash enemies, which is often needed to solve puzzles and progress through the game's ten levels. A few stages focus on avoiding obstacles and taking on boss enemies.</p>"},{"name":"Wild Arms","year":1996,"developer":"Media.Vision Entertainment Inc.","url":"psx-chd-roms-u-z/Wild%20Arms%20%28Europe%29.chd","filesize":317875562,"score":7.5,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>Rudy is a fifteen-year-old orphan who discovers that he has been endowed with the ability of using powerful forbidden weapons called ARMs (Ancient Relic Machines); forced to use an ARMs technique when fighting a demon, he is cast out of his home village. Jack is a treasure hunter who is seeking for an ancient device that would help him to deal with his troubled past. Cecilia is a young princess who has been studying magic at an abbey; on her seventeenth birthday, she is contacted by a mysterious voice who tells her that she can serve as a medium between the worlds of humans and spirits. The paths of these three heroes converge, and they team up to embark on a long journey, eager to understand their roles in a grand scheme of events that go back a thousand years into the past.</p><p><em>Wild Arms</em> is a Japanese-style role-playing game set in Filgaia, a fictional world that has elements of American Old West setting and medieval fantasy. The game's prologue consists of three chapters, each dedicated to one of its three main characters; afterwards, the player controls them as a party. Like most representatives of the genre, the game features turn-based battles against randomly appearing regular enemies and bosses. Besides attacking physically, the characters possess unique abilities - ARMs for Rudy, sword techniques for Jack, and magic for Cecilia. Characters can also equip special accessories (runes), which conjure powerful creatures known as the Guardians during battles, to attack enemies or assist the party by casting supportive spells.</p><p>The game has a stronger inclination towards puzzle-solving than most other Japanese RPG. Each of the three playable characters possesses a set of non-combat abilities called \"Tools\"; for example, Rudy starts with an ability to blow up obstacles, Jack can send his talking mouse Hanpan to manipulate objects out of his reach, and Cecilia can rewind time to ensure another attempt at solving a puzzle. The game's dungeons contain puzzles, many of which must be solved by using these abilities. During the course of the game, the three heroes will gradually learn additional Tools.</p><p>Various mini-games are also available. Characters and backgrounds in the game are done with 2D graphics during exploration; conversely, battles utilize a fully 3D environment with cinematic camera angles.</p>"},{"name":"Wild Arms 2 (Disc 1)","year":1999,"developer":"Media.Vision Entertainment Inc.","url":"psx-chd-roms-u-z/Wild%20Arms%202%20%28USA%29%20%28Disc%201%29.chd","filesize":298860428,"score":7.1,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Puzzle elements","desc":"<p>A soldier named Ashley Winchester witnesses a demon-summoning experiment, which turns his comrades into horrifying monsters. Having been forced to kill them, Ashley discovers that he had been tainted by a demonic essence as well. Looking for answers, he encounters a man who offers him to join ARMs, a team of fighters trying to overthrow a terrorist organization known as Odessa, whose goal is to conquer the world. Once there, Ashley meets Brad, a war veteran who has turned to criminal ways, and Lilka, a young girl training to become a Crest Sorceress. Aided by their new friends, the three heroes are determined to defeat Odessa and save the world.</p><p><em>Wild Arms 2</em> is not a direct sequel to the first Wild Arms, although it is set in the same fictional world Filgaia, which combines elements of Old West, steampunk, and fantasy. The turn-based combat system against randomly appearing enemies resembles that of the predecessor, featuring techniques unique to each character, as well as the Guardian system, which allows the characters to summon powerful creatures to assist them in battles. Three combatants can be used actively in battles; the player can also switch any of them with a reserve character, up to six altogether.</p><p>The puzzle-solving element is further emphasized in this sequel. Each character possesses three unique field abilities (called \"Tools\") in the game, which are used for accessing certain areas, discover secrets, and solve puzzles. These abilities range from jumping to hurling knives, pulling switches from afar, kicking large objects, and others. The game utilizes 3D graphics with limited camera rotation for both exploration and combat sequences.</p>"},{"name":"Wild Arms 2 (Disc 2)","year":1999,"developer":"Media.Vision Entertainment Inc.","url":"psx-chd-roms-u-z/Wild%20Arms%202%20%28USA%29%20%28Disc%202%29.chd","filesize":327296822,"score":7.1,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Puzzle elements","desc":"<p>A soldier named Ashley Winchester witnesses a demon-summoning experiment, which turns his comrades into horrifying monsters. Having been forced to kill them, Ashley discovers that he had been tainted by a demonic essence as well. Looking for answers, he encounters a man who offers him to join ARMs, a team of fighters trying to overthrow a terrorist organization known as Odessa, whose goal is to conquer the world. Once there, Ashley meets Brad, a war veteran who has turned to criminal ways, and Lilka, a young girl training to become a Crest Sorceress. Aided by their new friends, the three heroes are determined to defeat Odessa and save the world.</p><p><em>Wild Arms 2</em> is not a direct sequel to the first Wild Arms, although it is set in the same fictional world Filgaia, which combines elements of Old West, steampunk, and fantasy. The turn-based combat system against randomly appearing enemies resembles that of the predecessor, featuring techniques unique to each character, as well as the Guardian system, which allows the characters to summon powerful creatures to assist them in battles. Three combatants can be used actively in battles; the player can also switch any of them with a reserve character, up to six altogether.</p><p>The puzzle-solving element is further emphasized in this sequel. Each character possesses three unique field abilities (called \"Tools\") in the game, which are used for accessing certain areas, discover secrets, and solve puzzles. These abilities range from jumping to hurling knives, pulling switches from afar, kicking large objects, and others. The game utilizes 3D graphics with limited camera rotation for both exploration and combat sequences.</p>"},{"name":"Wild Rapids","year":2000,"developer":"Fujimic, Inc.","url":"psx-chd-roms-u-z/Wild%20Rapids%20%28Europe%29.chd","filesize":104390853,"score":"","genres":"Racing / Driving > Sports > Behind view > Direct control > Sailing / boating","desc":"<p>Experience the extreme thrill of white water rafting in this, the first EVER Kayak experience for the PlayStation.<br><br>Use skill, judgement and become utterly fearless as you negotiate the volcanic landscapes of Japan, the alligator infested waters of the US and deadly icebergs in Northern Europe.<br><br>Risk your life to become the ultimate Wild Rapids champ either on your own or against the skills of your friends, but remember – once in the water, nothing can stop the raw terror of nature.</p>"},{"name":"Wild Thornberrys Animal Adventures, The","year":2000,"developer":"KnowWonder, Inc.","url":"psx-chd-roms-u-z/Wild%20Thornberrys%2C%20The%20-%20Animal%20Adventures%20%28USA%29.chd","filesize":461815179,"score":"","genres":"Action > Mini-games > Licensed","desc":"<p>Explore the world of animals with characters from Nickelodeon's The Wild Thornberrys TV show. Investigate habitats, avoid traps, and solve puzzles with Eliza and the rest of the gang in seven adventure games. Use her \"gift of gab\" to obtain animal power-ups. The original voices from the TV show are featured throughout. Fourteen levels of difficulty make it challenging for even the most experienced players.</p>"},{"name":"Williams Arcade Classics","year":1996,"developer":"Digital Eclipse Software, Inc.","url":"psx-chd-roms-u-z/Williams%20Arcade%27s%20Greatest%20Hits%20%28Europe%29.chd","filesize":266493001,"score":6.9,"genres":"Action > Compilation > Side view > Top-down > Arcade > Shooter","desc":"<p><em>Williams Arcade Classics</em> is a compilation that includes the following games:</p><ul><li>Defender</li><li>Defender II</li><li>Joust</li><li>Robotron: 2084</li><li>Sinistar</li></ul><p>The PC, PlayStation, and Dreamcast versions also contain Bubbles. The PC and Playstation versions contain FMV supplements, including interviews with the original programmers.</p>"},{"name":"Windsurfers Paradise","year":2001,"developer":"TheyerGFX Pty Ltd","url":"psx-chd-roms-u-z/Windsurfers%20Paradise%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":162448196,"score":"","genres":"Sports > 3rd-person (Other) > Tricks / stunts > Direct control > Surfing","desc":"<p>Sail over the waves of four of the world's most beautiful beaches. It's down to you to master your own lightweight windsurfer, before you dive in to challenge the computer or your friends in a competition to see who can execute the perfect stunt, or jump the highest wave.<br><br>You will have to be able to read the wind if you want to succeed. In Windsurfers Paradise only losers fall off!</p>"},{"name":"Wing Commander III: Heart of the Tiger (Disc 1)","year":1996,"developer":"ORIGIN Systems, Inc.","url":"psx-chd-roms-u-z/Wing%20Commander%20III%20-%20Heart%20of%20the%20Tiger%20%28Europe%29%20%28Disc%201%29.chd","filesize":584394201,"score":8,"genres":"Simulation > 1st-person > Shooter > Space flight > Sci-fi / futuristic > War","desc":"<p>The war against the Kilrathi is going badly for the Confederation. Its flagship, the Concordia, has been destroyed, battles are lost on all fronts. War hero Colonel Christopher Blair is transferred to the old carrier Victory. Take the role of Blair and ensure the success of the Confederation's last-ditch attempt for victory: the destruction of the Kilrathi homeworld.</p><p><em>Wing Commander III</em> has the usual mix of space battles and cinematic storytelling. Changes from the first two games include SVGA graphics, the use of texture-mapped polygons instead of bitmaps for spaceflight sequences, and real Hollywood actors appearing in the cinematic scenes.</p>"},{"name":"Wing Commander III: Heart of the Tiger (Disc 2)","year":1996,"developer":"ORIGIN Systems, Inc.","url":"psx-chd-roms-u-z/Wing%20Commander%20III%20-%20Heart%20of%20the%20Tiger%20%28Europe%29%20%28Disc%202%29.chd","filesize":601959290,"score":8,"genres":"Simulation > 1st-person > Shooter > Space flight > Sci-fi / futuristic > War","desc":"<p>The war against the Kilrathi is going badly for the Confederation. Its flagship, the Concordia, has been destroyed, battles are lost on all fronts. War hero Colonel Christopher Blair is transferred to the old carrier Victory. Take the role of Blair and ensure the success of the Confederation's last-ditch attempt for victory: the destruction of the Kilrathi homeworld.</p><p><em>Wing Commander III</em> has the usual mix of space battles and cinematic storytelling. Changes from the first two games include SVGA graphics, the use of texture-mapped polygons instead of bitmaps for spaceflight sequences, and real Hollywood actors appearing in the cinematic scenes.</p>"},{"name":"Wing Commander III: Heart of the Tiger (Disc 3)","year":1996,"developer":"ORIGIN Systems, Inc.","url":"psx-chd-roms-u-z/Wing%20Commander%20III%20-%20Heart%20of%20the%20Tiger%20%28Europe%29%20%28Disc%203%29.chd","filesize":596985716,"score":8,"genres":"Simulation > 1st-person > Shooter > Space flight > Sci-fi / futuristic > War","desc":"<p>The war against the Kilrathi is going badly for the Confederation. Its flagship, the Concordia, has been destroyed, battles are lost on all fronts. War hero Colonel Christopher Blair is transferred to the old carrier Victory. Take the role of Blair and ensure the success of the Confederation's last-ditch attempt for victory: the destruction of the Kilrathi homeworld.</p><p><em>Wing Commander III</em> has the usual mix of space battles and cinematic storytelling. Changes from the first two games include SVGA graphics, the use of texture-mapped polygons instead of bitmaps for spaceflight sequences, and real Hollywood actors appearing in the cinematic scenes.</p>"},{"name":"Wing Commander III: Heart of the Tiger (Disc 4)","year":1996,"developer":"ORIGIN Systems, Inc.","url":"psx-chd-roms-u-z/Wing%20Commander%20III%20-%20Heart%20of%20the%20Tiger%20%28Europe%29%20%28Disc%204%29.chd","filesize":580795915,"score":8,"genres":"Simulation > 1st-person > Shooter > Space flight > Sci-fi / futuristic > War","desc":"<p>The war against the Kilrathi is going badly for the Confederation. Its flagship, the Concordia, has been destroyed, battles are lost on all fronts. War hero Colonel Christopher Blair is transferred to the old carrier Victory. Take the role of Blair and ensure the success of the Confederation's last-ditch attempt for victory: the destruction of the Kilrathi homeworld.</p><p><em>Wing Commander III</em> has the usual mix of space battles and cinematic storytelling. Changes from the first two games include SVGA graphics, the use of texture-mapped polygons instead of bitmaps for spaceflight sequences, and real Hollywood actors appearing in the cinematic scenes.</p>"},{"name":"Wing Commander IV: The Price of Freedom (Disc 1)","year":1997,"developer":"ORIGIN Systems, Inc.","url":"psx-chd-roms-u-z/Wing%20Commander%20IV%20-%20The%20Price%20of%20Freedom%20%28Europe%29%20%28Disc%201%29.chd","filesize":599911105,"score":7.9,"genres":"Action > Simulation > 1st-person > Shooter > Space flight > Sci-fi / futuristic > Regional differences","desc":"<p>Christopher Blair, \"Heart of the Tiger\" had retired to a farming planet after the war, content with retirement, so he says... In the depths of space, a new menace has surfaced. Some unknown attackers are killing civilian ships. The tension between the Confederation and the Border Worlds is at an all time high, as both sides accuse the other of staging the attacks. Admiral Tolwyn has recalled Blair back to service, where he will make the most difficult choice of all... And contemplate action he had never dared before, in the name of justice...</p><p><em>Wing Commander IV: The Price of Freedom</em> is a mix of interactive movie and space sim. The game has a dynamic mission tree, which means the player's behaviour will determine the next mission. The videos feature real actors, like Mark Hamill, Tom Wilson, John Rhys-Davies and Malcolm McDowell. Before the start of each mission, the space craft can be equipped with different weapons. Sometimes the mission objectives change during flight, and the player has to make decisions what he wants to do next, e.g. help out his friend or destroy an enemy fighter.</p>"},{"name":"Wing Commander IV: The Price of Freedom (Disc 2)","year":1997,"developer":"ORIGIN Systems, Inc.","url":"psx-chd-roms-u-z/Wing%20Commander%20IV%20-%20The%20Price%20of%20Freedom%20%28Europe%29%20%28Disc%202%29.chd","filesize":577921195,"score":7.9,"genres":"Action > Simulation > 1st-person > Shooter > Space flight > Sci-fi / futuristic > Regional differences","desc":"<p>Christopher Blair, \"Heart of the Tiger\" had retired to a farming planet after the war, content with retirement, so he says... In the depths of space, a new menace has surfaced. Some unknown attackers are killing civilian ships. The tension between the Confederation and the Border Worlds is at an all time high, as both sides accuse the other of staging the attacks. Admiral Tolwyn has recalled Blair back to service, where he will make the most difficult choice of all... And contemplate action he had never dared before, in the name of justice...</p><p><em>Wing Commander IV: The Price of Freedom</em> is a mix of interactive movie and space sim. The game has a dynamic mission tree, which means the player's behaviour will determine the next mission. The videos feature real actors, like Mark Hamill, Tom Wilson, John Rhys-Davies and Malcolm McDowell. Before the start of each mission, the space craft can be equipped with different weapons. Sometimes the mission objectives change during flight, and the player has to make decisions what he wants to do next, e.g. help out his friend or destroy an enemy fighter.</p>"},{"name":"Wing Commander IV: The Price of Freedom (Disc 3)","year":1997,"developer":"ORIGIN Systems, Inc.","url":"psx-chd-roms-u-z/Wing%20Commander%20IV%20-%20The%20Price%20of%20Freedom%20%28Europe%29%20%28Disc%203%29.chd","filesize":604308230,"score":7.9,"genres":"Action > Simulation > 1st-person > Shooter > Space flight > Sci-fi / futuristic > Regional differences","desc":"<p>Christopher Blair, \"Heart of the Tiger\" had retired to a farming planet after the war, content with retirement, so he says... In the depths of space, a new menace has surfaced. Some unknown attackers are killing civilian ships. The tension between the Confederation and the Border Worlds is at an all time high, as both sides accuse the other of staging the attacks. Admiral Tolwyn has recalled Blair back to service, where he will make the most difficult choice of all... And contemplate action he had never dared before, in the name of justice...</p><p><em>Wing Commander IV: The Price of Freedom</em> is a mix of interactive movie and space sim. The game has a dynamic mission tree, which means the player's behaviour will determine the next mission. The videos feature real actors, like Mark Hamill, Tom Wilson, John Rhys-Davies and Malcolm McDowell. Before the start of each mission, the space craft can be equipped with different weapons. Sometimes the mission objectives change during flight, and the player has to make decisions what he wants to do next, e.g. help out his friend or destroy an enemy fighter.</p>"},{"name":"Wing Commander IV: The Price of Freedom (Disc 4)","year":1997,"developer":"ORIGIN Systems, Inc.","url":"psx-chd-roms-u-z/Wing%20Commander%20IV%20-%20The%20Price%20of%20Freedom%20%28Europe%29%20%28Disc%204%29.chd","filesize":561633096,"score":7.9,"genres":"Action > Simulation > 1st-person > Shooter > Space flight > Sci-fi / futuristic > Regional differences","desc":"<p>Christopher Blair, \"Heart of the Tiger\" had retired to a farming planet after the war, content with retirement, so he says... In the depths of space, a new menace has surfaced. Some unknown attackers are killing civilian ships. The tension between the Confederation and the Border Worlds is at an all time high, as both sides accuse the other of staging the attacks. Admiral Tolwyn has recalled Blair back to service, where he will make the most difficult choice of all... And contemplate action he had never dared before, in the name of justice...</p><p><em>Wing Commander IV: The Price of Freedom</em> is a mix of interactive movie and space sim. The game has a dynamic mission tree, which means the player's behaviour will determine the next mission. The videos feature real actors, like Mark Hamill, Tom Wilson, John Rhys-Davies and Malcolm McDowell. Before the start of each mission, the space craft can be equipped with different weapons. Sometimes the mission objectives change during flight, and the player has to make decisions what he wants to do next, e.g. help out his friend or destroy an enemy fighter.</p>"},{"name":"Wing Over","year":1997,"developer":"Victor Interactive Software, Inc.","url":"psx-chd-roms-u-z/Wing%20Over%20%28Europe%29.chd","filesize":91516861,"score":"","genres":"Action > Simulation > 1st-person > Behind view > Flight / aviation > Vehicular combat","desc":"<p><em>Wing Over</em> is a combat flight simulator game for the PlayStation. It features 30 realistic fighter planes from various eras such as World War 1 and the Gulf War. There are four game modes: tournament, free play, survival, and vs. mode., and three different camera modes: first person, panoramic and trailing.</p>"},{"name":"Wing Over 2","year":1998,"developer":"Beluga Computer","url":"psx-chd-roms-u-z/Wing%20Over%202%20%28Europe%29.chd","filesize":59084278,"score":5.8,"genres":"Action > Simulation > 1st-person > 3rd-person (Other) > Flight / aviation > Vehicular combat","desc":"<p><em>Wing Over 2</em> is a combat flight simulator game for the PlayStation. In the game you start without any flight training. You have to find a job first to earn enough money for flight lessons, once you have achieved that and taken your lessons and exams, you can start flying simple missions which will earn you credits. The more missions you complete the more credits you achieve with which planes and more missions will become available to you and the more dangerous missions as well.</p>"},{"name":"Winky the Little Bear","year":2003,"developer":"The Code Monkeys Ltd.","url":"psx-chd-roms-u-z/Winky%20the%20Little%20Bear%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":414147944,"score":"","genres":"Educational > Puzzle elements > Graphics / art","desc":"<p><em>Winky the Little Bear</em> is a single player game aimed at younger children. There is a big storm in the forest. Teddy and Mi are swept up into the air and land in a very high tree and get stuck in it's branches. Their friends come to rescue them but can they succeed?</p><p>The game consists of a a Dingo Pictures animated film titled <em>Winkie der kleine Bär</em>, six paintings that can be coloured in and six scenes that can be turned into sliding block puzzles</p><p>The game was later released on the PlayStation 2 as <em>Countryside Bears</em>. It's the same game as the PlayStation version but adds a jigsaw puzzle mode and a pair matching mini game.</p>"},{"name":"Winning Lure","year":2000,"developer":"Hori Electric Co., Ltd.","url":"psx-chd-roms-u-z/Winning%20Lure%20%28Japan%29.chd","filesize":3746830,"score":"","genres":"Action > Sports > 3rd-person (Other) > Behind view > 2D scrolling > Direct control > Fishing","desc":"<p>Enjoy the fun of Lure Fishing in “WINNING LURE”. Join bass fishing tournaments in the Tournament Mode, which are available in amateur, professional and master level for you to fish for victory. Fish the way you like in “Free Fishing Mode” in which no time limit is on you!</p>"},{"name":"Winning Post 3","year":1998,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-u-z/Winning%20Post%203%20%28Japan%29.chd","filesize":352802587,"score":"","genres":"Simulation > Sports > Fixed / flip-screen > Turn-based > Managerial / business simulation > Menu structures > Horse / derby > Japan (Modern/Futuristic)","desc":"<p><em>Winning Post 3</em> is the third entry in the <em>Winning Post</em> series. The objective of the game is breeding horses with good bloodlines. Compared to its direct predecessor Winning Post 2, the 30-year time limitation is removed, making players able to breed horses at their pleasure.</p>"},{"name":"Winning Post EX","year":1995,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-u-z/Winning%20Post%20EX%20%28Japan%29.chd","filesize":95443374,"score":"","genres":"Simulation > Sports > Cinematic camera > Horse / derby","desc":"<p><em>Winning Post</em> lets the player take control of a stable of horses, breeding and training them for the ultimate goal, to win the French Grand Prix.</p><p>The player can hire breeders, trainers, and jockeys and race in over 240 different races to earn more money. That money can then be used to buy even better personnel and breed faster, stronger horses as well as to keep their horses healthy. Players can also bet on races.</p><p>The gameplay consists of choosing options before races, such as choosing which horses to train and what regiment they undertake, viewing stats, hiring personnel, and placing bets. However, the player has no control over races, cannot participate, and is only viewable as a spectator.</p>"},{"name":"WipEout","year":1995,"developer":"Psygnosis Limited","url":"psx-chd-roms-u-z/WipEout%20%28Europe%29%20%28Rev%201%29.chd","filesize":427200377,"score":7.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p><em>WipEout</em> is a futuristic racing game set in the year 2052. Racing for one of four teams, the player competes in the F3600 Anti-Gravity Racing League on six tracks. Each team's hovercraft racer has different ratings in speed, acceleration and turning. In addition to high-speed racing, there is also shooting in the game, with different weapon pickups like rockets and mines available, useful for slowing one's opponents down. Shields can also be picked up and can block the weapons' effects.</p><p>There are championship, single race and time trial modes. Winning the championship in the regular Venom class unlocks the Rapier class, where the craft are faster and the tracks have slightly different looks.</p><p>There is also a two-player mode where two opponents can race and shoot at each other.</p>"},{"name":"WipEout 3","year":1999,"developer":"Psygnosis Limited","url":"psx-chd-roms-u-z/Wip3out%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":489136748,"score":8.4,"genres":"Action > Racing / Driving > 1st-person > Behind view > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p><em>WipEout 3</em> is a futuristic racing game where the player pilots a high speed hover craft around a series of themed circuits, competing against a number of aggressive opponents. Enhancements for this version include full frame rate hi-res graphics, split-screen multiplayer, improved opponent AI, additional game modes including challenge and eliminator and a more accessible difficulty curve.</p>"},{"name":"WipEout XL","year":1996,"developer":"Psygnosis Limited","url":"psx-chd-roms-u-z/Wipeout%20XL%20%28USA%29.chd","filesize":438441786,"score":7.8,"genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p><em>WipEout XL</em> is set in the year 2097, around four decades after its predecessor. Instead of the F3600 anti-gravity racing competition, the game features an even faster and more dangerous tournament: the F5000 AG league. The gameplay system is similar to that of the previous game: players race against each other or computer in high-speed futuristic environments, liberally picking up weapons scattered around the stages and using them against the opponents to finish the race in the highest position.</p><p>Each vehicle is provided with a shield; once this shield is breached (by weapons or other kinds of damage), the craft explodes. As in the first game, the vehicles move at very high speeds. The game's four difficulty levels are used to crank the speed up and down, with the highest setting corresponding to the highest speed. In addition to the main championship mode, there are also challenge modes, winning in which rewards the player with faster game settings, new tracks, and new vehicles.</p>"},{"name":"Wizard's Harmony","year":1995,"developer":"Arc System Works Co., Ltd.","url":"psx-chd-roms-u-z/Wizard%27s%20Harmony%20%28Japan%29.chd","filesize":215447763,"score":"","genres":"Simulation > Strategy > 1st-person > Fixed / flip-screen > Anime / Manga > Fantasy > Medieval","desc":"<p>Rather than science, swords and sorcery flourish in this world. Our story takes place at the school of \"Skill & Wisdom,\" founded for youngsters who long for adventure.</p><p>The hero of our story, \"Rufus Craoun\" (you), is an active young man who participates in club activities at the Wizard Academy. But this Wizard Academy is suffering from a major problem...</p><p>The former head master carried out a number of misdeeds, and you're the only member of faculty. You've got to hire more faculty members to keep the academy going, but also make sure to pass the exams presented three times a year! Study and go on adventures with faculty members on the weekdays! Even enjoy school life with a charming member of staff from time to time! Think you can keep the academy up and running? Give it your best shot!</p>"},{"name":"Wizard's Harmony 2","year":1997,"developer":"Arc System Works Co., Ltd.","url":"psx-chd-roms-u-z/Wizard%27s%20Harmony%202%20%28Japan%2C%20Asia%29.chd","filesize":200873190,"score":"","genres":"Simulation > Strategy > 1st-person > Fixed / flip-screen > Anime / Manga > Fantasy > Medieval","desc":"<p>Rather than science, swords and sorcery flourish in this world. Our story takes place at the school of “Skill & Wisdom”, founded for youngsters who long for adventure.</p><p>In this game, you will play as an energetic young man who participates in club activities at the “Wizard’s Academy”. But all of a sudden all the other members quitted because of a big mistake made by you in an experiment! The student council, which has never been fond of the club, takes this chance and plans to abolish the club unless you can complete the tasks listed out by them. Now it is up to you to recruit more members to keep the academy going, and at the same time make sure to pass the exam that comes three times a year! Can you save the club and hold it up this time?</p>"},{"name":"Wizard's Harmony R","year":1998,"developer":"Arc System Works Co., Ltd.","url":"psx-chd-roms-u-z/Wizard%27s%20Harmony%20R%20%28Japan%29.chd","filesize":299638777,"score":"","genres":"Strategy > 1st-person > Top-down > Isometric > Anime / Manga > Turn-based > Life / social simulation > Menu structures > Fantasy","desc":"<p>This Wizard's Harmony spinoff features a new protagonist, Tians. As in the previous games, the player goes about their daily life at a magic school, managing their time and interacting with fellow students.</p>"},{"name":"Wizardry: Crusaders of the Dark Savant","year":1995,"developer":"Sir-tech Software, Inc."},{"name":"Wizardry: Llylgamyn Saga","year":1998,"developer":"Soliton Soft","url":"psx-chd-roms-u-z/Wizardry%20-%20Llylgamyn%20Saga%20%28Japan%29%20%28En%2CJa%29.chd","filesize":222238292,"score":"","genres":"Role-playing (RPG) > 1st-person > Turn-based > Fantasy","desc":"<p><em>Wizardry: Llylgamyn Saga</em> is a remake of the first three <em>Wizardry</em> games: Proving Grounds of the Mad Overlord, Knight of Diamonds, and Legacy of Llylgamyn.</p><p>As in the original games, the player can create characters choosing from five races and eight classes, and level them up by exploring the maze and fighting monsters, finding and buying items in process.</p><p>Monster graphics have been updated, and dungeons have been given textures, but the player can also opt for original graphics with wireframe dungeons. An auto-mapping feature has been added. The player can also transfer characters between the three scenarios.</p>"},{"name":"Wonder Trek","year":1998,"developer":"Zest Works","url":"psx-chd-roms-u-z/Wonder%20Trek%20%28Japan%29.chd","filesize":190154285,"score":"","genres":"Action > Educational > 3rd-person (Other) > Platform > Direct control > Ecology / nature","desc":"<p><em>Wonder Trek</em> is an action game with puzzle elements about two zoologists: professor Fable and Nick his reliable assistant. They are stranded on a mysterious island and have to find the giant phoenix egg. Most of the gameplay is based around platform sections and dodging enemies. Other actions include inspecting items.</p><p>Nick is the main character and the professor just tags along, controlled by the AI and invincible. He sometimes needs to be pulled on ledges as he cannot jump highly and he is also required to solve certain puzzles. The game is endorsed by the World Wide Fund for Nature. The professor provides background informations about certain items and artifacts. Enemies cannot be killed directly, but they are stunned using a hammer.</p>"},{"name":"Woody Woodpecker Racing","year":2000,"developer":"Syrox Developments, Ltd.","url":"psx-chd-roms-u-z/Woody%20Woodpecker%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":43046701,"score":5.2,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Woody Woodpecker Racing</em> is a go-kart racing game based on the popular cartoon character Woody Woodpecker.</p><p>The player selects one of the six starting characters from the series (including three differently styled Woodys, Wally Walrus and others) and races in a style reminiscent of Super Mario Kart (including \"jump turns\" for sharper angles). The player can collect items from boxes and try to slow down the opponents while driving through a 3D environment, with slopes, ramps and jumps, on tarmac or mud. Quest, championship, time trial and single race modes are available, as players try to hone their skills and unlock new characters and tracks.</p>"},{"name":"World Championship Snooker","year":2000,"developer":"Blade Interactive Studios Ltd.","url":"psx-chd-roms-u-z/World%20Championship%20Snooker%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":177153022,"score":7,"genres":"Sports > 1st-person > 3rd-person (Other) > Pool / snooker > Licensed","desc":"<p><em>World Championship Snooker</em> is a snooker simulation game. The game allows you to train in master classes, play a single match, and partake in official tournaments, and the world championship. You can play against many professional snooker players. Each of the players such as Mark Williams and Stephen Hendry plays with his own style and qualities. To aid the player it is possible to active certain helping lines to aid you in aiming you cue.</p>"},{"name":"World Cup 98","year":1998,"developer":"Electronic Arts Seattle","url":"psx-chd-roms-u-z/World%20Cup%2098%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CNl%2CSv%2CDa%29.chd","filesize":503149155,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Europe > Licensed","desc":"<p>The licensed game of the 1998 Football World Cup held in France from June 10 to July 12 and the first World Cup licensed game distributed and developed by Electronic Arts features a tweaked FIFA 98 engine, with all 10 stadiums accurately designed and all 32 teams (plus 8 teams that failed to qualify but still deemed too important to leave out) featuring real names and close \"look-a-like\" kits. Changes done to the 3D engine feature include on the fly in-game management with better player positioning AI (including the goalkeeper), and faster gameplay. An editor to change all player information is included, which affects simulated data: the team with higher ratings has a better chance of progressing through the next stage regardless if it is Brazil or China.</p><p>It's possible to play with the groups as determined by the real draw, randomize or customize them to the players' likings, mixing both qualified and additional teams. Once the player wins a trophy, the first of the <em>Classics</em> matches is unlocked. These are eight final matches in the competition's history which are unlocked as the player beats them one by one. Friendlies, training matches and practice penalty shootouts close the modes available.</p>"},{"name":"World Cup Golf: Hyatt Dorado Beach","year":1996,"developer":"Arc Developments","url":"psx-chd-roms-u-z/World%20Cup%20Golf%20-%20In%20Hyatt%20Dorado%20Beach%20%28Japan%29.chd","filesize":521746877,"score":6.5,"genres":"Sports > 1st-person > Behind view > Golf > Licensed","desc":"<p><em>World Cup Golf</em> takes the player to Puerto Rico's own Hyatt Dorado Beach Golf Course as they can choose from a bevy of fictional golfers or create their own in 18 rounds of golf. There are 15 types of tournaments to choose from including skins, medals, and Stableford to name a few. Players can also practice their swing on the driving range.</p><p>Players can also customize weather conditions as well as choose from a plethora of camera shots including the \"Ball Cam\" that follows the ball to its location. Like many golf games, a meter is used to determine the accuracy and the power of the player's swing and also features in-game commentary.</p>"},{"name":"World Destruction League: Thunder Tanks","year":2000,"developer":"The 3DO Company","url":"psx-chd-roms-u-z/World%20Destruction%20League%20-%20Thunder%20Tanks%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":390710918,"score":5.9,"genres":"Action > Behind view > Shooter > Tank","desc":"<p>In a grim, dystopian future, the World Destruction League has become the prime source of entertainment. Television crew is following the participants as they travel across the world, competing in just what the league's name implies: destruction. With their heavily armed tanks, the combatants do not just destroy each other: they lay waste to everything around them...</p><p><em>World Destruction League: Thunder Tanks</em> is a tank combat game that has similarities with BattleTanx games, as well as vehicular combat titles in the vein of Twisted Metal. Single-player gameplay consists of a tournament mode, in which the player selects a tank and takes it through a series of combat matches. The game's focus, however, is on the multiplayer, which includes different modes: deathmatch, capture-the-flag, frenzy, (a capture-the-flag variant with randomly appearing flags), as well as a so-called \"domination mode\", in which players must capture several tank generators scattered across the arena. Up to four players can compete in each of the multiplayer modes. </p><p>Various power-ups can be picked up on the arenas. These include turbo boosts, shields, fire missiles, grenades, mines, artillery and satellite strike (which allow players to target a specific spot on the arena and bombard it with missiles or a focused ion cannon blast), as well as guided missiles, which can be steered through the arena.</p>"},{"name":"World League Basketball","year":1997,"developer":"High Voltage Software, Inc.","url":"psx-chd-roms-u-z/World%20League%20Basketball%20%28Europe%29.chd","filesize":118464862,"score":"","genres":"Sports > Diagonal-down > Basketball","desc":"<p><em>World League Basketball</em>, part of the Mindscape Sports Advantage series, is a realistic basketball game developed using motion capture and physics of real players.</p><p>Change the rules of play for arcade, custom or simulation game with control over the difficulty level to time length of actual play from 5 minutes (10-minute default) to a maximum 25 minutes.</p><p>Players can choose \"exhibition play\" for practice matches between teams, before committing to one team for a 30-game \"season play\" or six-round \"tournament play\" in prearranged series of scheduled games against 36 different countries of various abilities. The latter two allows for simulated games to skip matches - if desired with results automatically calculated by the computer.</p><p>View statistics of your team before embarking in a match to determine the best on-court positions from point guard to centre of talented team members according to their performance and capabilities. Freely adjust player attributes from height, weight, strength, endurance to ball handling skills.</p><p>On-court play includes live commentary by Chris Smith.</p>"},{"name":"World League Soccer '98","year":1998,"developer":"Silicon Dreams Studio Ltd.","url":"psx-chd-roms-u-z/World%20League%20Soccer%20%2798%20%28Europe%29%20%28En%2CEs%2CIt%29.chd","filesize":313119101,"score":7,"genres":"Sports > Football (European) / Soccer","desc":"<p>In <em>World League Soccer '98</em> the player is able to move, kick, chip, volley and perform advanced passing techniques, including one-twos, chip returns and swerved long-balls. Players can also chest and head the ball with total control. Also, it is possible to alter pitch type, weather conditions, and stadium design.</p><p>There are eight major European leagues plus the US and Japanese leagues, with 145 teams available to choose from, as well as international competitions which can be custom-designed. Live commentary is provided by Peter Brackley and Ray Wilkins, and motion capture by Les Ferdinand.</p>"},{"name":"World of Dragon Warrior: Torneko - The Last Hope","year":1999,"developer":"Chunsoft Co., Ltd.","url":"psx-chd-roms-u-z/World%20of%20Dragon%20Warrior%20-%20Torneko%20-%20The%20Last%20Hope%20%28USA%29.chd","filesize":413861847,"score":6.2,"genres":"Role-playing (RPG) > Top-down > Turn-based > Fantasy","desc":"<p><em>Torneko: The Last Hope</em> is the sequel to Torneko no Daibōken: Fushigi no Dungeon and like that game, stars Torneko (akaTaloon), the merchant from Dragon Warrior IV. Having become rich and prosperous in the previous game by collecting treasures, Torneko eventually recovered the \"Joy Chest\" from the very bottom of the dungeon and had it enshrined at his shop. Peace had returned to the town for some time. After awhile, a mysterious stranger arrived and seemed concerned about the Joy Chest being outside the dungeon. At the same time, monsters started reappearing and different parts of the kingdom began turning into \"mysterious dungeons\". It will be up to middle-aged Torneko, to fight through these strange places and help the king discover what has broken the peace.</p><p>Like other <em>Fushigi no Dungeon</em> games, <em>Torneko: The Last Hope</em> is a dungeon crawler viewed from the overhead. The dungeons are randomly generated. When venturing into dungeons, Torneko will find many items and fight monsters. He can freely move through the dungeons, but each movement or action of his is countered by those of the monsters (if they are present on screen). All actions are made in turns, so despite the illusion of walking and fighting in real time, the game is turn-based. There are all kinds of items in the dungeons including herbs which can be eaten or thrown, magic scrolls which can be read, swords and shields that can be equipped and staffs which can be waved until their charges are depleted. Players must also keep an eye on Torneko's hunger meter and eat regularly, otherwise Torneko will go into starvation and start losing hitpoints at a great rate.</p><p>There are several ways to leave a dungeon including death, an Outside Scroll, donating to a Priest or reaching the very bottom floor. When leaving the dungeon areas, Torneko's experience points and stats are lost. To make money, he must sell items he has collected from the dungeon, but may keep a couple of his items in the Storage Room for later use. Torneko's village initially starts small, but as progress in made in the game more and more services and shops will be attracted to it. Some examples of services include a Bread Baker, a Witch, a Blacksmith, a Builder and a Meldersmith.</p>"},{"name":"World Soccer Winning Eleven 2002","year":2002,"developer":"Digitalware, Inc.","url":"psx-chd-roms-u-z/World%20Soccer%20Winning%20Eleven%202002%20%28Japan%29.chd","filesize":279436283,"score":7.9,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p>This is Konami's second soccer (European football) simulation for the Playstation 2. Choose one of the 54 international or 16 leagues teams (plus 7 hidden ones), to participate basically in any kind of tournament you wish, from friendship games to world cup, with a vast choice of customizable tournaments. You can create your own players with personal statistics, and then put them into any team. You can also play legendary teams, for example, Brazil with Pele, Argentina with Maradona, etc.</p>"},{"name":"World Tennis Stars","year":2003,"developer":"Ignition Entertainment Ltd.","url":"psx-chd-roms-u-z/World%20Tennis%20Stars%20%28Europe%29.chd","filesize":24271060,"score":"","genres":"Sports > Diagonal-down > Fixed / flip-screen > Direct control > Tennis","desc":"<p>BEAT THE REST TO BE THE BEST! Ever wanted to be a Tennis Star? Well here's your chance. Choose from an exciting selection of courts: Grass, Beach, Stone, Courtyard, Disco, Mayan Temple or even a New York street!</p>"},{"name":"World's Scariest Police Chases","year":2001,"developer":"Unique Development Studios AB","url":"psx-chd-roms-u-z/World%27s%20Scariest%20Police%20Chases%20%28Europe%29.chd","filesize":238271623,"score":6.7,"genres":"Action > Racing / Driving > 3rd-person (Other) > Shooter > Licensed","desc":"<p><em>World's Scariest Police Chases</em> is an open world driving game similar to Driver 2. The player joins Sheriff Jon Bunnell in high speed police chases, inconspicuously tailing criminals and high way shoot outs.</p><p>The game takes place in a fictional city called Ashland. Players can freely patrol the vast city environment or take on a series of twenty missions. The first four missions tutorial levels, the rest of the missions involve taking on increasingly difficult criminals. Criminals range from a simple DUI or car thief to drug dealers, bank robbers and even a runaway tank.</p><p>Once you reach a criminal you must either pursue them long enough until they give up, or ram or shoot them until they are forced to stop. A blue and red bar at the bottom of the screen show the status of the criminal vehicle. The blue bar indicates how long you've been chasing a vehicle, the red bar is the damage indicator of the criminal vehicle.</p><p>A two-player co-operative mode exists, in which one player drives and the other shoots. There are hidden areas of the city to unlock, such as an airport and a church. Hidden came modes include a Halloween re-depiction and a low-gravity mode.</p>"},{"name":"Worms","year":1995,"developer":"Team17 Software Limited","url":"psx-chd-roms-u-z/Worms%20%28Europe%29.chd","filesize":256469302,"score":7.6,"genres":"Strategy > Side view > 2D scrolling > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p><em>Worms</em> is a turn-based strategy game. It features up to 4 teams of 4 worms, aiming to destroy the others on a generated terrain. Each worm has 100 hitpoints and dies when his hit points fall to 0. Upon death, a worm explodes, causing damage to everyone around.</p><p>Gameplay is turn-based. Each turn, the player can control one specific worm from his team. The worm can crawl left and right or jump. However, there is a time limit to make a move; also, if the worm falls from a great height, it loses health and the turn ends immediately; and if a worm falls into water or offscreen, it dies. Each turn, a worm can also make a single attack: the player can aim up and down, choose a weapon and then fire it. After attacking, the turn ends. </p><p>There are a lot of weapons available - the standard ones as bazookas (which are affected by the (random) wind settings and gravity) and grenades. The others include a Fire Punch, dynamite, airstrikes, and utilities such as ropes and girders.</p><p>There are 10 styles of terrain, ranging from forests and deserts to Candy land and the moon (complete with affected gravity). Shots leave craters in the ground, and complex tunnels can be formed.</p>"},{"name":"Worms World Party","year":2001,"developer":"Team17 Software Limited","url":"psx-chd-roms-u-z/Worms%20World%20Party%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CDa%29.chd","filesize":287182938,"score":7.6,"genres":"Strategy > Side view > 2D scrolling > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p><em>Worms World Party</em> is a game which shares the bulk of its gameplay with Worms: Armageddon. It introduces the following:</p><ul><li>the Wormpot, a mechanic which allows the use of up to 3 modifiers to change the gameplay for the next match (e.g. automatically rising water levels, blood effects, slippery terrain...)</li><li>new campaign missions</li><li>co-operative campaigns</li><li>forts game mode</li><li>new predefined maps</li><li>all schemes available from the start</li></ul><p>The Game Boy Advance version of the game includes two weapons which were removed from <em>Worms: Armageddon</em> but were present in Worms 2 - the Homing Cluster Bomb and the Homing Airstrike, as well as a weapon absent from all other <em>Worms</em> games - the Chainsaw.</p>"},{"name":"Worms: Armageddon","year":1999,"developer":"Team17 Digital Limited","url":"psx-chd-roms-u-z/Worms%20Armageddon%20%28Europe%29%20%28Fr%2CNl%2CSv%2CNo%2CDa%29.chd","filesize":285256212,"score":7.9,"genres":"Strategy > Side view > 2D scrolling > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p><em>Worms: Armageddon</em> is a standalone expansion to Worms 2, introducing extensive improvements and additions over the original game, among which are:</p><ul><li>16 new weapons and 6 new utilities, with some existing ones changed or rebalanced (3 were removed entirely)</li><li>new singleplayer campaigns and challenges</li><li>new gameplay schemes, some of which have to be unlocked through campaign missions (certain weapons are only available in some of these schemes)</li><li>new menu interface, sounds, voice banks, and music</li><li>new predefined maps</li><li>expanded map editor, included voice bank editor (the latter is a separate application)</li><li>teams can now have custom representative flags, victory anthems, and gravestones</li><li>each team is assigned a special weapon of choice - Holy Hand Grenade, Flamethrower, Mad Cows, or Old Lady</li><li>AI-controlled teams now have one of five difficulty settings</li><li>jumping controls updated so worms can jump backwards and do backflips</li><li>instead of selecting a worm at the start of each turn, this option is now regarded as a utility and usually has a limited number of uses</li><li>new multiplayer options, including a more elaborate WormNET lobby</li></ul><p>Like the previous <em>Worms</em> installments, the game is an artillery variant. The player give an artillery piece a shot angle and shot power, and try to hit the opponent, taking into account wind effects. The player and the opponent exchange these shots in a turn-based fashion. The game puts the player in command of a team of up to eight worms, which can move around the landscape (one at a time), using many types of weapons to try to dispatch the enemy, from bazookas to mini-guns to exploding sheep. In some situations, the worms can also jump, swing by rope, and descend with a parachute.</p><p>As of 2002, updates have been handled by an authorized community member named Deadcode, who was joined in 2006 by CyberShadow. The two have removed many bugs and glitches, improved game stability and compatibility for Windows operating systems that have been released along the way, added new features (more resolutions, expanded options and settings, auto-recorded match replays, full PNG support for map importing...) and integrated WormKit, an extension framework for the game which allows for easier modding. These updates have been available from Team17's servers and are included by default in subsequent digital releases.</p>"},{"name":"WRC: FIA World Rally Championship Arcade","year":2002,"developer":"Unique Development Studios AB","url":"psx-chd-roms-u-z/WRC%20-%20FIA%20World%20Rally%20Championship%20Arcade%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%2CNo%2CDa%2CFi%29.chd","filesize":100459604,"score":"","genres":"Racing / Driving > Sports > 1st-person > Behind view > Direct control > Automobile > Off-roading > Africa > Europe > Oceania > Licensed","desc":"<p><em>WRC: FIA World Rally Championship Arcade</em> is an arcade rally game, specifically aimed at younger players with its forgiving handling and arcade-style gameplay. The player races in one of the seven cars, and 14 different official WRC locations are present in the game. Tracks include Australia, Cyprus, Spain, Greece, Sweden, and many more.</p><p>The game has several different gameplay modes, including the super special, standard championship, time trial and two-player versus modes. The \"super special\" mode is the single player campaign mode, where the player-controlled character challenges other drivers across a series of tracks. The player starts out in the last position and tries to finish in first place by overtaking all other vehicles.</p>"},{"name":"Wreckin Crew","year":1998,"developer":"Quickdraw Developments Ltd.","url":"psx-chd-roms-u-z/Wreckin%20Crew%20-%20Drive%20Dangerously%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":171206575,"score":6,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Wrecking Crew</em> is a racing game similar to Mario Kart. Players take control of unorthodox characters such as a pair of Siamese twins, a circus trainer and a mad scientist, and race their hot-rods across ten tracks using unusual weapons such as lighting bolts, body bags and chickens.</p><p>A two-player mode is available, and there are many funny unlockable characters. The tracks are sprawling, with teleports, secret routes and hidden areas to find.</p>"},{"name":"Wu-Tang: Shaolin Style","year":1999,"developer":"Paradox Development","url":"psx-chd-roms-u-z/Wu-Tang%20-%20Shaolin%20Style%20%28USA%29.chd","filesize":424978970,"score":6.9,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > Martial arts > Licensed","desc":"<p>Martial arts Master Xin is the guardian of the secrets of the Wu-Tang kung fu. The evil Mong Zhu grows jealous and decides to steal the Wu-Tang secrets, by torturing Master Xin. Members of the rap group Wu-Tang Clan receive information of Master Xin's plight and set out to rescue him.</p><p><em>Wu-Tang: Shaolin Style</em> is a 3D fighting game that takes place in different arenas around the world. Up to 4 players can fight at once, with a variety of punches, kicks and super moves. In Story Mode, players can only choose members of the Wu-Tang Clan, but in versus mode, more characters are available. In addition to the standard fighting, players must solve the challenges of the 36 chambers in order to unlock secrets and the final boss.</p><p>The game has a parental lock feature which prevents the game showing mature content, the locked game will still play but it's an edited version of the game. The unlock code is on the back of the manual.</p>"},{"name":"WWF Attitude","year":1999,"developer":"Acclaim Studios Salt Lake City","url":"psx-chd-roms-u-z/WWF%20Attitude%20%28Europe%29.chd","filesize":432005804,"score":6.9,"genres":"Action > Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWF Attitude</em> is a follow-up to WWF War Zone. The gameplay is similar to that of its predecessor, including a variety of game modes and specialty matches, such as Royal Rumble, Survivor Series, Tornado matches, and others. The Create-A-Wrestler mode has been slightly enhanced, adding commentary and crowd chants responding to the superstars' nicknames. The Challenge Mode of the previous game is replaced by the Career Mode, allowing the player-controlled wrestler to participate in house shows, winning matches to work his way up to the prestigious Raw show, pay-per-view events, and eventually compete for the title. A few new match types and fall superstar entrances have also been added. </p><p>New game modes include Create-A-Stable and a Pay-Per-View mode, which allows the player to set up an own wrestling event. The game includes an option to customize arenas, editing the color of lights, ropes, turnbuckles, logos etc.</p>"},{"name":"WWF in Your House","year":1996,"developer":"Sculptured Software, Inc.","url":"psx-chd-roms-u-z/WWF%20In%20Your%20House%20%28Europe%29.chd","filesize":131769116,"score":5.9,"genres":"Sports > Side view > 2D scrolling > Arcade > Fighting > Wrestling > Licensed","desc":"<p><em>WWF In Your House</em> is a successor to WWF WrestleMania: The Arcade Game. Like its predecessor, it is a hybrid of wrestling game and arcade versus fighter, with over-the-top, unrealistic moves. Concept and presentation are similar to Mortal Kombat games: digitized sprites are used to represent the wrestlers, and the game features finished moves that are performed before the final pin. There are a total of ten WWF wrestlers in the game: The British Bulldog, Goldust, Bret Hart, Owen Hart, Hunter Hearst Helmsley, Ahmed Johnson, Shawn Michaels, The Ultimate Warrior, The Undertaker, and Vader. A new four-player mode is available.</p>"},{"name":"WWF Smackdown!","year":2000,"developer":"Yuke's Co. Ltd.","url":"psx-chd-roms-u-z/WWF%20SmackDown%21%20%28Europe%29.chd","filesize":411344116,"score":7.5,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWF Smackdown</em> is a professional wrestling game where the player can choose from up to 36 wrestlers to wrestle in single matches, tag-team, backstage areas, hardcore matches, etc.</p><p>Aside from the default WWF wrestlers, the player may also choose to create a new wrestlers with their own unique abilities and personalities.</p>"},{"name":"WWF Smackdown! 2: Know Your Role","year":2000,"developer":"Yuke's Co. Ltd.","url":"psx-chd-roms-u-z/WWF%20SmackDown%21%202%20-%20Know%20Your%20Role%20%28Europe%29.chd","filesize":506433185,"score":7.6,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWF Smackdown! 2: Know Your Role</em> is a wrestling game using the World Wrestling Federation (WWF) license, and a sequel to WWF Smackdown!. The game mostly follows the gameplay template of its predecessor, while expanding some of its features.</p><p>The sequel features a larger arsenal of moves, which not only includes signature moves of WWF wrestlers, but also those of other wrestling promotions, such as WCW, Japanese associations, etc. The game also adds striking moves in one-on-one matches and special double team moves.</p><p>The Season Mode from the previous game returns, adding more scenes depicting wrestlers preparing for a match, and featuring multiplayer support, with up to four players participating in a tournament. Create-A-Superstar mode has been enhanced, allowing the player to customize facial features and outfits of their wrestlers. A new Create-A-Taunt feature, in which the player can create a new taunt for a custom wrestler, has been added.</p>"},{"name":"WWF War Zone","year":1998,"developer":"Iguana West","url":"psx-chd-roms-u-z/WWF%20War%20Zone%20%28USA%29%20%28Rev%201%29.chd","filesize":476190412,"score":7.5,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWF War Zone</em> is the first WWF-based wrestling game to use fully 3D character and environment graphics. The wrestlers can execute traditional punch and kicks, as well as various grapple moves, which the player can perform by pressing a button assigned to initial grapple in a combination with different direction buttons. Commentary, wrestler introductions (with short voice clips), crowd reactions, and full-motion sequences (in the PlayStation version only) are included.</p><p>The game features seven basic gameplay modes, allowing configurations of one to four players. These include training mode, one-on-one, tag team, cage match, weapons match, tornado tag team, and war (elimination free for all). Two additional modes, Royal Rumble and gauntlet, are exclusive to the Nintendo 64 version. The player can also create and customize his own wrestler, taking him through the WWF challenge. The new wrestler finds himself at the bottom of a pyramid, and has to challenge wrestlers situated immediately above him, gradually working his way through to the title. Sometimes previously defeated wrestlers will challenge the player to a \"grudge match\", which usually consists of special encounters, such as battles with weapons or cage matches.</p>"},{"name":"WWF WrestleMania","year":1995,"developer":"Midway Manufacturing Company","url":"psx-chd-roms-u-z/WWF%20WrestleMania%20-%20The%20Arcade%20Game%20%28Europe%29.chd","filesize":41619117,"score":7.4,"genres":"Action > Sports > Side view > 2D scrolling > Arcade > Wrestling > Licensed","desc":"<p><em>WWF WrestleMania: The Arcade Game</em> merges the personalities and action of the WWF TV show characters with a Mortal Kombat-style fighting game. This title features digitized graphics of 8 WWF superstars: Doink, Razor Ramon, Bret \"Hit Man\" Hart, Shawn Michaels, The Undertaker, Yokozuna, Bam Bam Bigelow, and Lex Luger.</p><p>Although presented as a wrestling title, this game is structured like a one-on-one fighter, features over-the-top special moves characteristic of WWF. Each match is divided into a series of rounds, much like a fighting game. Instead of each round ending in a KO, it simply ends when the player forces the other wrestler(s) to fall by reducing their energy meter. Game modes include single player arcade mode, tournament mode, and versus mode for one-on-one multiplayer.</p>"}]