[{"name":"X-Bladez: Inline Skater","year":2002,"developer":"Vision Scape Interactive, Inc.","url":"psx-chd-roms-u-z/X-Bladez%20-%20Inline%20Skater%20%28Europe%29.chd","filesize":333955365,"score":"","genres":"Sports > Behind view","desc":"<p><em>X-Bladez: Inline Skater</em> is a racing game dedicated to the inline skating extreme sport. The game allows the player to control and race skaters through 3D levels, performing tricks such as back-flips, flat spins, heel grabs, and others. Racers are able to jump over trash cans, mailboxes, and road signs. It is also possible to grab speed boosts to increase the velocity of the skateboard, as well as collect tokens scattered throughout each level to unlock secrets. Additional levels can be unlocked by gathering qualifying points, which are awarded for trying particularly daring stunts.</p>"},{"name":"X-COM: Terror from the Deep","year":1996,"developer":"MicroProse Ltd.","url":"psx-chd-roms-u-z/X-COM%20-%20Terror%20from%20the%20Deep%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":186562643,"score":8.2,"genres":"Strategy > Diagonal-down > Isometric > Turn-based > Turn-based strategy > Multiple units/characters control > Sci-fi / futuristic > War","desc":"<p><em>X-COM: Terror from the Deep</em> is the follow-up to the resource management and tactical combat game X-COM: Enemy Unknown.</p><p>It has been 40 years since X-COM last defeated the aliens. Now, in the year of 2040, aliens begin to appear on the Earth again. This time the threat to humanity is coming from the depths of oceans.</p><p>The game is almost identical to the original X-COM game. The user interface, weapons, and aliens are all the same. The only difference is the adaptation of the aliens and weapons (e.g. new hand-to-hand weapons) to the ocean environment. The game features both undersea and on-land missions, and is significantly harder than its predecessor.</p>"},{"name":"X-COM: UFO Defense","year":1995,"developer":"Mythos Games Ltd.","url":"psx-chd-roms-u-z/X-COM%20-%20UFO%20Defense%20%28USA%29.chd","filesize":307950312,"score":8.1,"genres":"Strategy > Diagonal-down > Isometric > Turn-based > RPG elements > Turn-based strategy > Sci-fi / futuristic","desc":"<p>In the year 1998, the amount of reports of UFO sightings has been drastically increased. Stories about abductions and alien attacks became more and more widespread. Finally, after various nations of the world have failed to intercept the UFOs, their representatives met in a conference of global importance in Geneva, Switzerland. It was eventually decided to organize a secret paramilitary group, dubbed Extraterrestrial Combat Unit (X-COM). Starting with one base, two fighters, one transport, and a few soldiers, X-COM must locate the aliens, learn about their origins and technology, find out where their base is, and destroy it.</p><p><em>X-COM: UFO Defense</em> is a strategy game featuring separate but interlinked elements. On the strategic side, called GeoScape, you get a rotating view of the globe, where you see all visible UFOs (those that are within your detection range) as well as major cities and your base(s). You order movements from here, such as sending out fighters to intercept UFOs, transports with soldiers to assault/recover UFOs, and perhaps assaults on alien bases (if you find any). You also control your research, as you must invent better weapons (the Terran weapons are just no match against the alien weapons) quickly, not to mention all the other cool tech you can recover from the aliens. You also need to control your budget, as you can't afford to overextend your reach. Researchers need to be paid, engineers (who build the new toys) need to be paid, base(s) need to be be built/expanded, planes need to be bought/maintained, supplies need to be replenished, and so on.</p><p>You can earn money by selling unneeded stuff, and you receive funding from the nations of the world; however, a nation can decrease its funding if it decides you aren't operating efficiently enough within its region. It's even possible that a nation gets so fed up with you that it signs a pact with the aliens and ceases funding altogether. </p><p>Once you join a ground battle, the game switches to Battlescape, which is an isometric view of the battlefield with realistic line-of-sight calculations and turn-based combat. Your mission is usually extermination of all aliens on the battlefield, though if you can capture a few it would surely help your research efforts. If you win, you also recover any alien artifacts left on the field, which can then be researched.</p><p>In combat, each of your soldiers has a specific number of Time Units. Doing anything (moving, shooting, turning around, rearranging objects in the inventory etc.) costs a number of TUs. Once a soldier is out of TUs, he cannot act any more this turn (he gets all his TUs back on the next turn, though).</p>"},{"name":"X-Files Game, The (Disc 1)","year":1999,"developer":"Hyperbole Studios","url":"psx-chd-roms-u-z/X-Files%2C%20The%20%28Europe%29%20%28Disc%201%29.chd","filesize":437968652,"score":7.1,"genres":"Adventure > 1st-person > Live action > Sci-fi / futuristic > Detective / mystery > Licensed","desc":"<p>As an extension of one of the most long-running television series of all time, <em>The X-Files</em>, play through the eyes of Special Agent Craig Willmore, a new FBI field investigator brought in to locate missing agents Fox Mulder and Dana Scully whose last location was the Everett, Washington, area. In this \"movie quality\" video production, characters are played by the actors and actresses from the show, including Gillian Anderson (Scully) and David Duchovny (Mulder).</p><p>As the game begins, you are given a briefing of your mission. Gather up all state-of-the-art spy tools (night vision goggles, a digital camera, PDA, lock picks, evidence kit, a standard issue revolver, handcuffs and badge) and then head out to follow their trail. As you explore the various locations, take photographs, pick up pieces of evidence and talk with people. Use your Newton PDA to access the navigational map, to make notes and send/receive e-mail. Trace telephone numbers, run background checks and license plate ids and even post an All Points Bulletin on missing persons using the computer network at your home or office. By using photo viewer software, download field photographs to the computer where they can be enlarged and studied more closely for clues.</p><p>Features include emotion icons for interjecting different tones during conversations (mean, humorous or technical) which effect the answer given. An in-game hint system, Artificial Intelligence, can be set on or off. In addition, there are multiple endings as a direct result of actions you take.</p>"},{"name":"X-Files Game, The (Disc 2)","year":1999,"developer":"Hyperbole Studios","url":"psx-chd-roms-u-z/X-Files%2C%20The%20%28Europe%29%20%28Disc%202%29.chd","filesize":513574142,"score":7.1,"genres":"Adventure > 1st-person > Live action > Sci-fi / futuristic > Detective / mystery > Licensed","desc":"<p>As an extension of one of the most long-running television series of all time, <em>The X-Files</em>, play through the eyes of Special Agent Craig Willmore, a new FBI field investigator brought in to locate missing agents Fox Mulder and Dana Scully whose last location was the Everett, Washington, area. In this \"movie quality\" video production, characters are played by the actors and actresses from the show, including Gillian Anderson (Scully) and David Duchovny (Mulder).</p><p>As the game begins, you are given a briefing of your mission. Gather up all state-of-the-art spy tools (night vision goggles, a digital camera, PDA, lock picks, evidence kit, a standard issue revolver, handcuffs and badge) and then head out to follow their trail. As you explore the various locations, take photographs, pick up pieces of evidence and talk with people. Use your Newton PDA to access the navigational map, to make notes and send/receive e-mail. Trace telephone numbers, run background checks and license plate ids and even post an All Points Bulletin on missing persons using the computer network at your home or office. By using photo viewer software, download field photographs to the computer where they can be enlarged and studied more closely for clues.</p><p>Features include emotion icons for interjecting different tones during conversations (mean, humorous or technical) which effect the answer given. An in-game hint system, Artificial Intelligence, can be set on or off. In addition, there are multiple endings as a direct result of actions you take.</p>"},{"name":"X-Files Game, The (Disc 3)","year":1999,"developer":"Hyperbole Studios","url":"psx-chd-roms-u-z/X-Files%2C%20The%20%28Europe%29%20%28Disc%203%29.chd","filesize":424242396,"score":7.1,"genres":"Adventure > 1st-person > Live action > Sci-fi / futuristic > Detective / mystery > Licensed","desc":"<p>As an extension of one of the most long-running television series of all time, <em>The X-Files</em>, play through the eyes of Special Agent Craig Willmore, a new FBI field investigator brought in to locate missing agents Fox Mulder and Dana Scully whose last location was the Everett, Washington, area. In this \"movie quality\" video production, characters are played by the actors and actresses from the show, including Gillian Anderson (Scully) and David Duchovny (Mulder).</p><p>As the game begins, you are given a briefing of your mission. Gather up all state-of-the-art spy tools (night vision goggles, a digital camera, PDA, lock picks, evidence kit, a standard issue revolver, handcuffs and badge) and then head out to follow their trail. As you explore the various locations, take photographs, pick up pieces of evidence and talk with people. Use your Newton PDA to access the navigational map, to make notes and send/receive e-mail. Trace telephone numbers, run background checks and license plate ids and even post an All Points Bulletin on missing persons using the computer network at your home or office. By using photo viewer software, download field photographs to the computer where they can be enlarged and studied more closely for clues.</p><p>Features include emotion icons for interjecting different tones during conversations (mean, humorous or technical) which effect the answer given. An in-game hint system, Artificial Intelligence, can be set on or off. In addition, there are multiple endings as a direct result of actions you take.</p>"},{"name":"X-Files Game, The (Disc 4)","year":1999,"developer":"Hyperbole Studios","url":"psx-chd-roms-u-z/X-Files%2C%20The%20%28Europe%29%20%28Disc%204%29.chd","filesize":520883952,"score":7.1,"genres":"Adventure > 1st-person > Live action > Sci-fi / futuristic > Detective / mystery > Licensed","desc":"<p>As an extension of one of the most long-running television series of all time, <em>The X-Files</em>, play through the eyes of Special Agent Craig Willmore, a new FBI field investigator brought in to locate missing agents Fox Mulder and Dana Scully whose last location was the Everett, Washington, area. In this \"movie quality\" video production, characters are played by the actors and actresses from the show, including Gillian Anderson (Scully) and David Duchovny (Mulder).</p><p>As the game begins, you are given a briefing of your mission. Gather up all state-of-the-art spy tools (night vision goggles, a digital camera, PDA, lock picks, evidence kit, a standard issue revolver, handcuffs and badge) and then head out to follow their trail. As you explore the various locations, take photographs, pick up pieces of evidence and talk with people. Use your Newton PDA to access the navigational map, to make notes and send/receive e-mail. Trace telephone numbers, run background checks and license plate ids and even post an All Points Bulletin on missing persons using the computer network at your home or office. By using photo viewer software, download field photographs to the computer where they can be enlarged and studied more closely for clues.</p><p>Features include emotion icons for interjecting different tones during conversations (mean, humorous or technical) which effect the answer given. An in-game hint system, Artificial Intelligence, can be set on or off. In addition, there are multiple endings as a direct result of actions you take.</p>"},{"name":"X-Games: Pro Boarder","year":1998,"developer":"Radical Entertainment Inc.","url":"psx-chd-roms-u-z/X%20Games%20Pro%20Boarder%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CSv%2CNo%29%20%28Rev%201%29.chd","filesize":466552045,"score":6.8,"genres":"Sports > 3rd-person (Other) > Tricks / stunts > Snowboarding / skiing > Licensed","desc":"<p><em>X-Games: Pro Boarder</em> is a snowboarding game with several game modes including downhill and half pipe. </p><p>In downhill mode the player's mission is to get down as quickly as possible, also grinding on several objects like cars and airplanes that have been placed in the scenery.</p><p>In half pipe mode the player must travel from the beginning to the end of the pipe doing stunts on the left and the right, finishing before the time reaches zero having as many points as possible.</p><p>Multiplayer over Internet and Network is supported, as well as 3D acceleration cards.</p>"},{"name":"X-Men vs. Street Fighter","year":1998,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-u-z/X-Men%20vs.%20Street%20Fighter%20%28Europe%29.chd","filesize":227488383,"score":7.8,"genres":"Action > Side view > 2D scrolling > Fighting > Licensed","desc":"<p><em>X-Men vs. Street Fighter</em> is a fighting game, the first in which characters from the Marvel Comics universe (in this case, the X-Men) compete against Capcom's own creations, the heroes of the <em>Street Fighter</em> series.</p><p>The X-Men characters are mostly the same as in X-Men: Children of the Atom and Marvel Super Heroes; three new characters are Rogue, Gambit and Sabretooth. The <em>Street Fighter</em> cast is based on that of Street Fighter Alpha 2; however, the appearance and combat styles of some of them have been altered, to match the abilities of the X-Men heroes.</p><p>The gameplay system is similar to that of the aforementioned games, adding a tag-team gameplay feature. The player controls one character at a time, while the other awaits off-screen. The starting character can tag the waiting one in at any time by hitting specific buttons; the tag partner will jump in with an attack and taunt the enemy. Resting character gradually recuperate their health. The two partners can execute the so-called \"variable attacks\", which depend on the combination of buttons pressed.</p><p>The tag team feature has been omitted from the PlayStation version due to memory limitations.</p>"},{"name":"X-Men: Children of the Atom","year":1998,"developer":"Capcom Co., Ltd.","url":"psx-chd-roms-u-z/X-Men%20-%20Children%20of%20the%20Atom%20%28Europe%29.chd","filesize":345661507,"score":7.8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Licensed","desc":"<p><em>X-Men: Children of the Atom</em> is a 2D fighting game and the first Capcom title to use licensed characters from the Marvel comic universe. It has six main characters and four of their enemies that are playable. The X-Men are Colossus, Cyclops, Iceman, Psylocke, Storm and Wolverine. The villains are Omega Red, Sentinel, Silver Samurai and Spiral. The two main bosses are Juggernaut and Magneto, and Akuma is available as a secret character.</p><p>Fighting is done one-on-one with a traditional best-two-out-of-three match setup, with automatic or manual blocking. Similar to the Super Combo gauge in Super Street Fighter II Turbo there is an X-Power gauge of different levels, filled up when the player performs moves. When it is maxed out an X-Ability or Hyper X special move can be performed. Other general features are the abilities to super jump, roll away and aiming projectiles.</p>"},{"name":"X-Men: Mutant Academy","year":2000,"developer":"Paradox Development","url":"psx-chd-roms-u-z/X-Men%20-%20Mutant%20Academy%20%28Europe%29.chd","filesize":363570242,"score":6.7,"genres":"Action > Fighting > Licensed","desc":"<p><em>X-Men: Mutant Academy</em> is a fighting game featuring three-dimensional stages, but largely adhering to the rules of 2D fighters. The protagonists are a combination of the classic Marvel comics characters and the <em>X-Men</em> movie. Nearly every X-Men character is available, each with their normal moves (much like Street Fighter in terms of the buttons pressed on the control pad), and plenty of super moves to spice things up.</p><p>The CD also contains various bonus materials, ranging from movie clips of a fighter after the player has completed the game with him/her, new costumes (each fighter starts with costumes from the comics; the new ones, when unlocked, are much like the ones in the movie), and a movie story unlocked when the player completes the game with all of the fighters.</p><p>Also included is a movie trailer for <em>X-Men</em>, and comic art by Marvel designers Joe Maduera, Adam and Andy Kubert, and more.</p>"},{"name":"X-Men: Mutant Academy 2","year":2001,"developer":"Paradox Development","url":"psx-chd-roms-u-z/X-Men%20-%20Mutant%20Academy%202%20%28Europe%29.chd","filesize":430727970,"score":6.7,"genres":"Action > Fighting > Licensed","desc":"<p><em>X-Men: Mutant Academy 2</em> is a fighting game featuring characters from the <em>X-Men</em> universe. In this sequel to X-Men: Mutant Academy, six new X-Men characters join the ranks, including Rogue, Forge, Nightcrawler, Havok, and two secret fighters. Six new arenas - the X-Mansion, Muir Island, an eerily lit church and Asteroid M (Magneto's Stage), plus two secret levels, have been added. </p><p>The sequel also introduces a so-called \"Cerebro mode\", where the player can check out behind-the-scenes character sketches, costume designs and movie set sketches from the <em>X-Men</em> movie. Professor X himself teaches the player the many moves available to the character in the Academy Training mode.</p>"},{"name":"X'treme Roller","year":2001,"developer":"Neko Entertainment SARL","url":"psx-chd-roms-u-z/X%27treme%20Roller%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.chd","filesize":186750368,"score":"","genres":"Sports > Behind view > Tricks / stunts > Direct control > Contemporary","desc":"<p>X'TREME Roller<br><br>* A roller show-time that's 100% adrenaline : speed, acrobatics, and combat are all on the program!<br>* Awesome game modes : Extreme Race, Stunt Contest, Time Attack...<br>* Compete on 33 levels over 9 circuits<br>* Totally original environments and a crazy manga atmosphere<br>* Tournament mode for 2 players</p>"},{"name":"X2: No Relief","year":1996,"developer":"Team17 Software Limited","url":"psx-chd-roms-u-z/X2%20-%20No%20Relief%20%28Europe%29.chd","filesize":265447935,"score":6.5,"genres":"Action > Side view > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>X2: No Relief</em> is the sequel to Project-X for up to two players. Like its predecessor, it's a horizontal (and sometimes vertical) scrolling shoot em up. The manual instructs the player that this game doesn't need a story, and they should simply get rid of the attacking aliens.</p><p>To do so, the player has a choice between three types of space ship, each of them differs in terms of firepower and speed. The game has two different difficulty modes and a password system to resume the fight for the first five levels. During gameplay, the player has the possibility to pick up a wide variety of power-ups for their ship. Next to the main gun, side weapons and anti-gravity orbs with their own firepower can be obtained as well as mega-bombs, among other things.</p><p>The game is over once all lives or continues are used up. The player is then taken to a high-score screen to enter their initials.</p>"},{"name":"Xena: Warrior Princess","year":1999,"developer":"Universal Digital Arts, Inc.","url":"psx-chd-roms-u-z/Xena%20-%20Warrior%20Princess%20%28Europe%29.chd","filesize":173755383,"score":6.9,"genres":"Action > Behind view > Fantasy > Licensed","desc":"<p><em>Xena: Warrior Princess</em> is an action game based on the TV series of the same name. As Xena, the Warrior Princess, the player has to stop the evil sorceress Kalabrax, who seeks world domination which she could gain by sacrificing Xena's friend, the mortal queen Gabrielle.</p><p>Xena must make her way through many large levels, hacking, kicking, slashing, and cutting everything that gets in her way. Items can be found and upgraded as she proceeds through the levels. Apart from a variety of moves, the game also features little gimmicks such as a \"Karma Meter\", which gives Xena benefits if she saves hostages or defeats enemies without killing them.</p>"},{"name":"Xenocracy","year":1998,"developer":"Simis Limited","url":"psx-chd-roms-u-z/Xenocracy%20-%20The%20Ultimate%20Solar%20War%20%28Europe%29.chd","filesize":499726570,"score":6,"genres":"Action > Simulation > Strategy > 1st-person > Shooter > Space flight > Vehicular combat > Sci-fi / futuristic","desc":"<p><em>Xenocracy</em> is a cross between a space combat action sim and a political strategy game. In the far future, four planetary superpowers (the Earth Dominion, the Mercury League, the Venus Alliance and the Mars Combine) are vying for control of the solar system and on the brink of all-out \"thermostellar war\". As commander of the United Planet Nations peacekeeping fighter squadron, your role is to maintain the balance and prevent cold war and localized conflicts from escalating into open interplanetary hostilities. Further complicating the matter, you must deal with pirates and a looming alien threat.</p><p>As each planetary superpower launches low-intensity strikes (as opposed to open warfare) against the colonies and outposts of the other three, you are presented with the choice, via a strategic solar system map showing flaring geopolitical hotspots, of which to aid. If you aid one superpower too much at the expense of the others, as one is first tempted to do, you upset the balance and cause the war you sought to prevent. Whichever you choose, afterward you are realistically presented with complaints and political propaganda from the other three superpowers, and receive news broadcasts concerning the interplanetary geopolitical wrangling.</p><p>In addition to keeping the peace, you also manage research and development of newer and more powerful technologies, which will eventually prove crucial. Several fighter and weapon types are available, and the scenery varies from asteroid belts and dust clouds to planetary surfaces. You may choose from several wingmen, each with a personal description and personality type, whom you must do your best to keep alive. Missions include such tasks as defending mine complexes from attack (or attacking them) and protecting convoys (or destroying them).</p><p>The game also allows Arcade Mode, in which you simply fly missions without regard to the strategic aspects of the game, and multiplayer games of up to 8 players over TCP/IP or serial connections.</p>"},{"name":"Xenogears (Disc 1)","year":1998,"developer":"Square Co., Ltd.","url":"psx-chd-roms-u-z/Xenogears%20%28USA%29%20%28Disc%201%29.chd","filesize":357651775,"score":8.2,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Direct control > Menu structures > Multiple units/characters control > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>A war has been raging on the continent of Ignas between the Kislev Empire to the north and the kingdom of Aveh in the south. It has gone for so long that people have forgotten the cause. As a mysterious organization known as \"Ethos\" introduces an ancient technology in the form of huge mega-robots, the tides are turning. Gebler, a military organization with an unknown agenda, is pulling the strings and supports Aveh to regain its authority over Kislev. </p><p>A failed attempt to steal one of Kislev's new Gears, a giant robot named \"Weltall\", leads to a fight between a group of Gebler and Kislev guards in the remote town of Lahan in the outskirts of Aveh. One of the villagers, Fei Fong Wong, impulsively takes possession of \"Weltall\" and steers it to fight. As Fei's best friend Timothy is killed during the battle, he releases a massive wave of energy and destroys the whole village together with one of his close friends, Alice.</p><p>After this tragedy, Fei is blamed for the destruction of the village and the death of his friends. Pursued by military governments and mysterious forces, Fei sets out on an epic quest for answers and his own forgotten past.</p><p><em>Xenogears</em> is a Japanese-style RPG with a few distinguishing features. The characters have the ability to jump, which must be used on several occasions to access specific locations. There are two types of combat in the game: standard and gear. In standard combat, the characters fight with equipped weapons, learning and performing different combos that can be executed in one turn. But often the heroes will have to explore dungeons while piloting giant robots called \"gears\". Gear combat follows different rules: they are able to perform actions until they run out of fuel, therefore the player must concentrate on finishing the enemy quickly. It is possible to equip various accessories on the gears, including those that will let them partially restore fuel. Gears cannot level up, but can be upgraded in workshops.</p>"},{"name":"Xenogears (Disc 2)","year":1998,"developer":"Square Co., Ltd.","url":"psx-chd-roms-u-z/Xenogears%20%28USA%29%20%28Disc%202%29.chd","filesize":380024950,"score":8.2,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Turn-based > Direct control > Menu structures > Multiple units/characters control > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>A war has been raging on the continent of Ignas between the Kislev Empire to the north and the kingdom of Aveh in the south. It has gone for so long that people have forgotten the cause. As a mysterious organization known as \"Ethos\" introduces an ancient technology in the form of huge mega-robots, the tides are turning. Gebler, a military organization with an unknown agenda, is pulling the strings and supports Aveh to regain its authority over Kislev. </p><p>A failed attempt to steal one of Kislev's new Gears, a giant robot named \"Weltall\", leads to a fight between a group of Gebler and Kislev guards in the remote town of Lahan in the outskirts of Aveh. One of the villagers, Fei Fong Wong, impulsively takes possession of \"Weltall\" and steers it to fight. As Fei's best friend Timothy is killed during the battle, he releases a massive wave of energy and destroys the whole village together with one of his close friends, Alice.</p><p>After this tragedy, Fei is blamed for the destruction of the village and the death of his friends. Pursued by military governments and mysterious forces, Fei sets out on an epic quest for answers and his own forgotten past.</p><p><em>Xenogears</em> is a Japanese-style RPG with a few distinguishing features. The characters have the ability to jump, which must be used on several occasions to access specific locations. There are two types of combat in the game: standard and gear. In standard combat, the characters fight with equipped weapons, learning and performing different combos that can be executed in one turn. But often the heroes will have to explore dungeons while piloting giant robots called \"gears\". Gear combat follows different rules: they are able to perform actions until they run out of fuel, therefore the player must concentrate on finishing the enemy quickly. It is possible to equip various accessories on the gears, including those that will let them partially restore fuel. Gears cannot level up, but can be upgraded in workshops.</p>"},{"name":"Xevious 3D/G+","year":1997,"developer":"Namco Limited","url":"psx-chd-roms-u-z/Xevious%203D-G%2B%20%28Europe%29.chd","filesize":418894845,"score":7,"genres":"Action > Top-down > 2D scrolling > Isometric > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Xevious 3D/G+</em> is a compilation of four titles: Xevious 3D/G (main game), Xevious (Arcade version), Super Xevious (Arcade version) and Xevious Arrangement.</p><p>A fighter pilot flying the Solvalou space ship is the last hope for the Earth. Invaders from the planet Xevious have arrived; being descendants of our planet's original inhabitants, they wish to reclaim it for themselves. The Xevians started to build huge ground structures, and it is the hero's job to destroy them while shooting at their space ships and detonating the treacherous SOL bases.</p><p><em>Xevious 3D/G+</em> puts the classic arcade vertical shoot 'm up Xevious game in a third-person 3D perspective. The game brings some new weapon systems to the player-controlled fighter jet and contains many new enemies, some of which are quite large and pose new challenges to the player. During the game the player can collect three types of power-ups: bullets, lasers and plasma beams.</p>"},{"name":"XI [sai] Jumbo","year":1999,"developer":"Shift Inc.","url":"psx-chd-roms-u-z/XI%20%5Bsai%5D%20Jumbo%20%28Japan%29.chd","filesize":410798010,"score":"","genres":"Puzzle > Diagonal-down > Fixed / flip-screen > Isometric","desc":"<p>Ultimately exhilarating! XI [sai] is back and bigger than ever! This time, the Aquis are a bit different. Now they can jump, lift, and create reserved chains! New types of actions are possible with simple controls! Three completely redesigned, full-featured modes are included! There's even your own private Aqui room where fights, events, and dancing await. With all the new features and modes, this game can only be described as JUMBO! Gigantic jumbo dice appear to make your life miserable!<br>* New types of actions are possible with simple controls!<br>Jump and lift with a single press of a button. Get those bothersome dice out of the way in no time!<br>* Three completely new, full-featured modes!<br>The Battle Mode has been completely redesigned. A two-field battle where opponents rain dice down upon each other is now used. Use your brain and vicious nature to defeat your opponent by snatching dice or hurling dice at them!<br>* Your own private Aqui room!<br>Fights, events, and dancing awaits. What sort of events could possible be in store?</p>"},{"name":"XS Airboat Racing","year":2003,"developer":"Miracle Designs","url":"psx-chd-roms-u-z/XS%20Airboat%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":38481639,"score":"","genres":"Racing / Driving > Sports > Behind view > Sailing / boating","desc":"<p>This is a 3D arcade-style airboat racing game. The player can choose a protagonist from a roster of 10 cartoon-like characters and race on a number of waterway circuits in 5 different settings. Game modes include \"arcade\", \"tournament\" and \"time trial\".</p>"},{"name":"XS Junior League Dodgeball","year":1998,"developer":"Four Winds Software Inc.","url":"psx-chd-roms-u-z/XS%20Junior%20League%20Dodgeball%20%28USA%29.chd","filesize":249352478,"score":"","genres":"Action > Sports > 3rd-person (Other) > Dodgeball","desc":"<p><em>XS Junior League Dodgeball</em> is a team Dodgeball game featuring school teens as playable characters. The player can choose from a number of characters, each with special abilities, and participate in a tournament or in a versus battle. The goal of the game is to knock out the members of the opposing team and win the match. </p><p>All characters in the original Japanese version are girls, however for the US release several characters were replaced with boys.</p>"},{"name":"XS Junior League Football","year":2003,"developer":"Wahoo Studios, Inc.","url":"psx-chd-roms-u-z/XS%20Junior%20League%20Football%20%28USA%29.chd","filesize":30333869,"score":"","genres":"Sports > 3rd-person (Other) > Football (American)","desc":"<p>This is a sports game with cartoon-style graphics for the whole family. The game boasts 16 different characters (XS Kids) with different skills, and \"real world\" play fields - a yard, a parking lot etc. The player's team of 5 characters will participate in \"Schoolyard Tournaments\" to become the Football champion.</p>"},{"name":"XS Junior League Soccer","year":2004,"developer":"Wahoo Studios, Inc.","url":"psx-chd-roms-u-z/XS%20Junior%20League%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":42868015,"score":"","genres":"Sports > 3rd-person (Other) > Football (European) / Soccer","desc":"<p>This is a game of street soccer with cartoon-style graphics. The player can choose from 16 characters (XS Kids) to create a team of 5 and participate in a street tournament. The game is played on \"real world\" locations: the yard, a parking, a clearing at the construction site and by the baseball field.</p>"},{"name":"XS Moto","year":2003,"developer":"Interactive Entertainment Ltd.","url":"psx-chd-roms-u-z/XS%20Moto%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":245830547,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Motorcycle > Track racing > Vehicle simulator","desc":"<p><em>XS Moto</em> is a 3D motorbike racing game with 22 racing tracks located around the world. The game modes include Single Race, Championship, Two-Player Race, and Two-Player Championship. The game features real-time weather effects and conditions. While racing no map of the track is shown, but yellow icons appear on the left or right to signal the direction of the upcoming turn.</p>"}]