[{"name":"Yakata: Nightmare Project","year":1998,"developer":"Chime Corporation"},{"name":"Yakiniku Bugyou","year":2001,"developer":"Media Entertainment Inc","url":"psx-chd-roms-u-z/Yakiniku%20Bugyou%20%28Japan%29.chd","filesize":47963115,"score":"","genres":"Simulation > Top-down > Real-time > Arcade > Puzzle elements > Licensed","desc":"<p>If you think it's a hassle to clean out the grill, marinate meat, watch it slowly get burned on the grill as it starts to rain outside... this might be the game for you. <em>Yakinikubugyō</em> puts you in the role of a BBQ chef, and it's your job to make sure the customers leave happy and full from your restaurant.</p><p>The goal of each stage in the game is to make sure you keep all 3 customers happy when the timer runs out by handing out the right food to the right person, while making sure it's not undercooked or burned to a black piece of coal. The customers each have a food they like and one they hate, and they can suddenly change their minds in the middle of a stage, so figuring out what they want to eat and when is the key to success. You can also earn combos by feeding the same customer several times in a row with food they like.</p><p>You use chop sticks to maneuver around a 3x4 squares big grill where you have to put down pieces of meat and vegetables and grill them to perfection. The closer to the middle of the grill you put the food, the faster it cooks, so if you have a customer yelling at you to hand him/her something, you can put the food there.</p><p>If you're too slow or forget about a piece of food, it slowly turns to coal and you have to tap it to clean the grate. Otherwise you won't be able to use that square again.</p><p>You can either play alone or against a friend. The game is sponsored by Gyu-Kaku, a chain of Japanese BBQ restaurants.</p>"},{"name":"Yaku: Yuujou Dangi","year":1996,"developer":"Axes Art Amuse","url":"psx-chd-roms-u-z/Yaku%20-%20Yuujou%20Dangi%20%28Japan%29.chd","filesize":95117657,"score":"","genres":"Action > 1st-person > Detective / mystery > Horror","desc":"<p>This is the story of the terrible fear experienced by a group of friends who met in an abandoned elementary school. Unique visuals and extreme plot twists will test the player.<br>...You can still make it... This cult game might rub you the wrong way. It's dangerous! Not recommended for beginners!</p>"},{"name":"Yakutsu Noroi Game, The","year":1997,"developer":"Axes Art Amuse","url":"psx-chd-roms-u-z/Yaku%20Tsuu%20-%20Noroi%20no%20Game%20%28Japan%29.chd","filesize":223558308,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Horror","desc":"<p>High school students, Misuzu and Shogo, who have been friends from early in their childhood, starts a part-time job at a game company. After awfully busy days, the game development is completed and the title that was produced was a game which the company president also had confidence. But a very unfavorable assessment comes from a game magazine publisher that reviews the game. Almost at the same time, the company president disappears. Then he meets a mysterious death. While passing each day with an indescribable sense of unease, Misuzu receives a phone call from the deceased. In an unconventional adventure in the manner of PlayStation® software \"YAKU\" a world with new fears is brought forth.</p>"},{"name":"Yeh Yeh Tennis","year":1999,"developer":"Sunsoft","url":"psx-chd-roms-u-z/Yeh%20Yeh%20Tennis%20%28Europe%29%20%28En%2CFr%2CDe%29.chd","filesize":169950474,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Tennis","desc":"<p>Following the pattern and gameplay style of its predecessor, <em>WaiWai Tennis 2</em> features even more tennis courts to choose from with a strong player character customization which lets the player set not only the character portrait and outfit appearance, but also the dominant hand, footwork skills, and the terrain type he or she excels at.</p><p>Gameplay modes include:</p><ul><li>Practice - where player can hone his skills by learning different ways to hit the ball and knocking down targets placed on the court</li><li>Versus - which provides quick 1-on-1 or 2-on-2 match on one of a 33 different tennis courts</li><li>Circuit - where player can create his character that will undergo a series of competitions and tournaments</li></ul>"},{"name":"Yellow Brick Road","year":1996,"developer":"Synergy Inc.","url":"psx-chd-roms-u-z/Yellow%20Brick%20Road%20%28Japan%29.chd","filesize":235413481,"score":"","genres":"Adventure > Strategy > 1st-person > Isometric > Real-time > Fantasy","desc":"<p>Inspired by the <em>Oz</em> Books by L. Frank Baum, <em>Yellow Brick Road</em> concerns the player's attempt to thwart an invasion of the Emerald City by the Gnome King. Along the way s/he teams up with the tin man, lion, and eventually the scarecrow. Besides these, other recognizable figures from the books include Jack Pumpkinhead, the little Wizard of Oz, and Glinda, who, in the game, is queen of Oz. </p><p>The game's structure is reminiscent of first-person adventures: the player interacts with the environment and manipulates inventory items to proceed. The puzzles, however, are kept to a minimum, since combat occupies a significant portion of the game, effectively turning it into a hybrid of adventure and small-scale real-time strategy.</p><p>Battles usually occur as dictated by the plot. The player does not fight directly, but instead acts as a general to his/her companions. Each character has a quick but weak base attack or can use one of the items found throughout the game. Many of the items act differently depending on who uses them. For instance, the flute calls field mice into battle for the Tin Woodman, while it calls crows into battle for the Scarecrow. The more powerful the item, the longer the downtime for the character who has used it before he can fight again. The enemies progress toward the companions' side of the battlefield at a constant pace. If they reach them, the battle is lost, and the player must try again. If instead the player manages to push them back off the far side of the field, the battle is won and the game progresses. Different enemies are more greatly affected by different weapon/character combinations, and immune against some.</p>"},{"name":"Yetisports Deluxe","year":2004,"developer":"Edelweiss Medienwerkstatt GmbH","url":"psx-chd-roms-u-z/Yetisports%20Deluxe%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":16791287,"score":4.5,"genres":"Action > 3rd-person (Other) > Arcade","desc":"<p><em>Yetisports Deluxe</em> is collection of two mini games based on the Yetisports browser games:* Super Pingo Throw: Based on Yetisports Part 1: Pingu Throw. The player takes the part of a polar bear with a baseball bat. A penguin falls from a mountain and the player has to hit him with a timed mouse click. The goal is to time this perfectly so the penguin flies a long range. In comparison to the browser game this version adds additional obstacles which stop the penguin, wales which give a speed boost when the penguin lands on it and wind. There is also an additional playing mode where the player has to strike other ice bears which are standing on the runway.</p><ul><li>Orca Slap: Based on Yetisports Part 2: Orca Slap. Here the player stands in front of a big dart board. Then penguins fly into the screen (on at a time) and the player has to throw a snowball at them. Then the penguin gets deflected and flies to the dart board and the player scores. The goal is to get a high score. In comparison to the browser game this version adds a slot machine between rounds where the player can get additional penguins or snowballs. There is also an additional playing mode where the player has to hit specific fields on the dart board.</li></ul><p>Both games feature improved graphics and a multiplayer mode.</p>"},{"name":"Yetisports: World Tour","year":2004,"developer":"Similis Software GmbH","url":"psx-chd-roms-u-z/Yetisports%20World%20Tour%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.chd","filesize":31722366,"score":"","genres":"Action > Mini-games > Direct control > Fantasy","desc":"<p><em>Yetisports: World Tour</em> contains 10 mini games that can be played alone or in multiplayer. The games are: Pingu Throw, Orca Slap, Seal Bounce, Albatross Overload, Flamingo Drive, Ice Bear Attack, Pingu Dart, Pelican Crossfire, Hill Side Rocket Ride and Pingu Breakthrough.</p>"},{"name":"Yopaz IceStar","year":2013,"developer":"OrionSoft"},{"name":"You Don't Know Jack (Disc 1)","year":1999,"developer":"Starsphere Interactive, Inc.","url":"psx-chd-roms-u-z/You%20Don%27t%20Know%20Jack%20%28USA%29%20%28Disc%201%29.chd","filesize":428087879,"score":7.8,"genres":"Strategy > Game show / trivia / quiz","desc":"<p><em>You Don't Know Jack</em> is a humorous trivia game for up to three players. The players take part in a quiz game, which partly parodies television shows such as Jeopardy. The players do need to answer serious questions, and knowledge of various topics (ranging from classical literature to modern pop culture) is required; however, the show's host is distinguished by his sense of sarcasm, sometimes offering humorous wordings for questions, and sardonically addressing the participants.</p>"},{"name":"You Don't Know Jack (Disc 2)","year":1999,"developer":"Starsphere Interactive, Inc.","url":"psx-chd-roms-u-z/You%20Don%27t%20Know%20Jack%20%28USA%29%20%28Disc%202%29.chd","filesize":411096719,"score":7.8,"genres":"Strategy > Game show / trivia / quiz","desc":"<p><em>You Don't Know Jack</em> is a humorous trivia game for up to three players. The players take part in a quiz game, which partly parodies television shows such as Jeopardy. The players do need to answer serious questions, and knowledge of various topics (ranging from classical literature to modern pop culture) is required; however, the show's host is distinguished by his sense of sarcasm, sometimes offering humorous wordings for questions, and sardonically addressing the participants.</p>"},{"name":"You Don't Know Jack: Mock 2","year":2000,"developer":"Jellyvision Games, Inc.","url":"psx-chd-roms-u-z/You%20Don%27t%20Know%20Jack%20-%20Mock%202%20%28USA%29.chd","filesize":421240824,"score":7.5,"genres":"Strategy > Game show / trivia / quiz","desc":"<p>This version of <em>You Don't Know Jack</em> is a follow-up on You Don't Know Jack, only released on the PlayStation, and different from other versions. It features over a 1,000 questions and the capability of allowing three different friends to compete against each other in a fast pace trivia game.</p><p>The gameplay is still the same as its predecessor, where players buzz in on various trivia questions in order to receive points in order to advance and ultimately win the game. It features 3D polygon graphics and a quick witted, abrasive TV-type announcer that can insult players when they answer a question wrong.</p>"},{"name":"YoYo's Puzzle Park","year":1996,"developer":"Irem Software Engineering, Inc.","url":"psx-chd-roms-u-z/YoYo%27s%20Puzzle%20Park%20%28Europe%29.chd","filesize":136197908,"score":6.7,"genres":"Action > Platform > Puzzle elements","desc":"<p>At the opening ceremony of the Gussan Paradise theme park, a creature known as YoYo invades it. He takes hostages from the crowd and manages to elude the police and take control of the park. It's up to Guss and Yodie, two innocent bystanders, to take back the park.</p><p><em>YoYo's Puzzle Park</em> is a puzzle platform game featuring some sixty platform-filled levels similar to Bubble Bobble. The player (as Guss or Yodie) can hop around on them, while avoiding the enemies that crowd the platforms. The enemies hurt the player by touching them, and some have ranged attacks like lasers. The players can strike back at the enemies with bombs that scatter the level, throwing or jumping on them activates their two second fuse. The goal is to kill all the enemies in a level within the time limit.</p><p>To aid the protagonists there are several collectibles such as vehicles. Guss and Yodie can also stun enemies with their Yo-yos. In the multi-player mode, you can fight against your friends in a two-player deathmatch game.</p>"},{"name":"Yu-Gi-Oh!: Forbidden Memories","year":1999,"developer":"Konami Computer Entertainment Japan, Inc.","url":"psx-chd-roms-u-z/Yu-Gi-Oh%21%20Forbidden%20Memories%20%28Europe%29.chd","filesize":167848268,"score":6.7,"genres":"Strategy > Top-down > Anime / Manga > Turn-based > Cards / tiles > Trading / collectible card > Licensed","desc":"<p>Based on the popular anime series, <em>Yu-Gi-Oh!: Forbidden Memories</em> casts you as on of Yugi's ancestors who must travel to ancient Egypt and solve the mysteries of the Shadow Game and the seven magical totems. You must travel throughout the land talking to townspeople, performing tasks and of course, duel several opponents in order to gather up knowledge of impending doom threatening your kingdom.</p><p>The game follows the rules of the Duel Monsters card game, the player battling AI-controlled opponents. Each player possesses a 40-card deck, filled with cards that represent creatures, items, spells, and powers. The players take turns drawing a hand of five cards. Cards can be fused together and player in different combinations, which allow more powerful moves. Depending on the player's performance, special star chip points are acquired, which can be used to purchase real-world <em>Yu-Gi-Oh!</em> cards, and use them in the game by inputting their code numbers and a password.</p>"},{"name":"Yusha: Heaven's Gate","year":1996,"developer":"Racdym","url":"psx-chd-roms-u-z/Yusha%20-%20Heaven%27s%20Gate%20%28Europe%29.chd","filesize":323989250,"score":6.3,"genres":"Action > 3rd-person (Other) > Arcade > Fighting","desc":"<p><em>Yusha: Heaven's Gate</em> is a 3D fighting game with an arcade and Vs. mode. The player can choose from one of the eight combatants that are available at the start, with a few more characters being available once their unlocked. Each character has a different nationality, specialty, and lineage. Each character represents either a good or an evil alignment and depending on the character chosen, it affects which final boss the player will have to fight against. </p><p>Defending, punching and kicking are on three separate buttons. There are variations of each of these moves depending on how quick the button is pressed.</p><p>Consistently damaging or taking damage from an opponent will add to a sol or lunar (depending on the character the player is playing as) power gauge. When this gauge is filled, the player is temporarily invincible and allows the player to use strong power assault moves.</p>"},{"name":"Yuukyuu Gensoukyoku","year":1997,"developer":"Starlight Marry Corporation","url":"psx-chd-roms-u-z/Yuukyuu%20Gensoukyoku%20%28Japan%29.chd","filesize":464140279,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Fantasy","desc":"<p>A young traveler finds himself working in a shop in the town of Enfield after being rescued by the shop's owner. One day, he's arrested on suspicion of stealing a work of art, and though he does not remember doing such a thing, several people claim to have seen him fleeing the scene of the crime. The shop's owner takes a loan to pay his bail, but if she is unable to pay the loan back within one year, she will lose the shop. A peculiar law in the town says that if he can gain the favor of the town, he can request a retrial, and so the young man and several of his friends in the town start taking odd jobs in order to gain the trust of the townsfolk.</p><p><em>Yūkyū Gensōkyoku</em> (Eternal Fantasy) is a traditional-style Japanese adventure game. You must interact with your companions and other people about the town, as well as plan jobs and leisure time for your group in order to build the trust of the town and pay back your debt.</p>"},{"name":"Yuukyuu Gensoukyoku 3 - Perpetual Blue","year":1999,"developer":"Starlight Marry Corporation","url":"psx-chd-roms-u-z/Yuukyuu%20Gensoukyoku%203%20-%20Perpetual%20Blue%20%28Japan%29.chd","filesize":420446242,"score":"","genres":"Adventure > Compilation > 1st-person > Anime / Manga > Fantasy","desc":"<p><em>Perpetual Collection</em> is a compilation of the Yūkyū Gensōkyoku series, and includes:</p><ul><li>Yūkyū Gensōkyoku</li><li>Yūkyū Gensōkyoku: 2nd Album</li><li>Yūkyū Gensōkyoku ensemble</li><li>Yūkyū Gensōkyoku ensemble 2</li></ul><p>Also included is a preview disc for Yūkyū Gensōkyoku 3: Perpetual Blue, which was not included with the Saturn version of this collection. The packaging, however, is not as extravagant as the Saturn release and does not include the extra bonus items.</p>"},{"name":"Yuukyuu Gensoukyoku Ensemble","year":1998,"developer":"Starlight Marry Corporation","url":"psx-chd-roms-u-z/Yuukyuu%20Gensoukyoku%20Ensemble%20%28Japan%29.chd","filesize":494233601,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Fantasy","desc":"<p><em>Yūkyū Gensōkyoku ensemble</em> is a fan disc for Yūkyū Gensōkyoku, featuring new stories involving the characters, several minigames, and an art gallery.</p>"},{"name":"Yuukyuu Gensoukyoku Ensemble 2","year":1999,"developer":"Starlight Marry Corporation","url":"psx-chd-roms-u-z/Yuukyuu%20Gensoukyoku%20Ensemble%202%20%28Japan%29.chd","filesize":381289028,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Fantasy","desc":"<p><em>Yūkyū Gensōkyoku ensemble 2</em> is a fan disc for Yūkyū Gensōkyoku: 2nd Album, and like the previous one features a new side story, several minigames, and an art gallery.</p>"},{"name":"Yuukyuu Gensoukyoku: 2nd Album","year":1998,"developer":"Starlight Marry Corporation","url":"psx-chd-roms-u-z/Yuukyuu%20Gensoukyoku%202nd%20Album%20%28Japan%29.chd","filesize":415674860,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Fantasy","desc":"<p>The Third Division Vigilante Corps have earned the trust of the people of Enfield, and under the popular Commander Neumann, they have worked hard to earn this trust. However, Neumann is now gone, leaving the third division with low morale and little work, and eventually the main character from the previous game is the only member left. The third division is to be disbanded, but he appeals to the director, and is given one year to restore the third division to its former glory.</p><p><em>Yūkyū Gensōkyoku: 2nd Album</em> follows directly after the events of the first game, and is once more a traditional Japanese adventure game. You must gather your group to perform jobs for the people of Enfield, and interact with the various characters around town.</p>"},{"name":"Yuukyuu Kumikyoku - All Star Project","year":2000,"developer":"Starlight Marry Corporation","url":"psx-chd-roms-u-z/Yuukyuu%20Kumikyoku%20-%20All%20Star%20Project%20%28Japan%29.chd","filesize":349953992,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Fantasy","desc":"<p><em>Yūkyū Kumikyoku</em> (Eternal Suite) is the final title in the Yūkyū Gensōkyoku series, and is once again a traditional Japanese adventure game. The story takes place in an alternate continuity where the characters from the previous games are all students at the same school. The player chooses a character from the series history, and then must become friends with another character while also keeping on top of their studies.</p>"},{"name":"Yuuyami Doori Tankentai ","year":1999,"developer":"Team Yura","url":"psx-chd-roms-u-z/Yuuyami%20Doori%20Tankentai%20%28Japan%29.chd","filesize":232944744,"score":"","genres":"Adventure > 3rd-person (Other) > Contemporary > Detective / mystery > Horror","desc":"<p><em>Yuuyami Doori Tankentai</em> is an adventure game in the vein of the Twilight Syndrome franchise. The game takes place in Hirumi City, a fictitious Japanese suburb containing commercial areas, hospitals, construction sites, and parks, in the late 1990s. Despite the fact that it is never mentioned, it is hinted that the city sprang from Japan's economic boom in the 1980s and has since fallen into ruin. The narrative follows three junior high school students as they investigate local urban legends, most of which have a paranormal component. A kid named Nao and his dog Meros, as well as two girls named Kurumi and Sango, are among the students.</p>"}]