[{"name":"Z","year":1997,"developer":"The Bitmap Brothers","url":"psx-chd-roms-u-z/Z%20%28Europe%29.chd","filesize":363472493,"score":7.1,"genres":"Strategy > Top-down > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Sci-fi / futuristic","desc":"<p><em>Z</em> is a real-time strategy game in which you fight for control of the sectors, some of which contains manufactories that can gain you additional units. Touch the \"flag\" in the sector and it's yours. Capture the sector before the new unit comes out of the manufactory and the new unit is yours. With six different robots (different armaments, armor, and speed), multiple vehicles (from jeeps to tanks) the robots can utilize, your ultimate objective is to destroy the opponent's base, and prevent him from doing the same to you.</p><p>The game differs from many other RTSs by emphasizing territorial control (and the manufactories) instead of getting kills and gathering a big army. You have to finely balance defense and offense. If you wait too long, the enemy will grab all the manufactories first. If you go too fast, you'll get hammered for stretching yourself too thin. You can hijack enemy vehicles by shooting the driver off. If you send a group of soldiers toward an objective and they find a vehicle, one of them will split off to grab the vehicle; you don't really need to micromanage each soldier.</p>"},{"name":"Zanac X Zanac","year":2001,"developer":"Compile","url":"psx-chd-roms-u-z/Zanac%20x%20Zanac%20%28Japan%29.chd","filesize":209209516,"score":"","genres":"Action > Compilation > Top-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Celebrating the 15th anniversary of Compile's top-down shooter Zanac A.I. comes this remake. Alongside the original, the CD includes <em>Zanac Neo</em>, which is a complete remake that aims to take advantage of 32-bit technology. It uses polygonal graphics and other special effects, as well as adding a more comprehensive storyline with cutscenes, different ships to play in (each with their own upgradable arsenal) and (for the first time in Compile's history) support for two-player co-op gameplay.</p>"},{"name":"Zeitgeist","year":1995,"developer":"Taito Corporation","url":"psx-chd-roms-u-z/Zeitgeist%20%28Japan%29.chd","filesize":217066032,"score":5.6,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p><em>Zeitgeist</em> is a 3D shooter in which the player controls a futuristic fighter jet flying through space. The lone hero must battle multiple waves of aliens and asteroids, fly across planets and inside space stations, as well as combat large mother ships and other boss enemies. The game only allows limited movement of the jet, prompting the player to focus on targeting and destroying as much as he can on his path. The jet that has two main weapons, and a laser sub-weapon that homes into targets. Unlike most other shooters, this game does not have any power-ups.</p>"},{"name":"Zerachan Puzzle Pitatto Pair","year":2001,"developer":"Affect Co.,Ltd"},{"name":"Zero Divide","year":1995,"developer":"Zoom, Inc.","url":"psx-chd-roms-u-z/Zero%20Divide%20%28Europe%29.chd","filesize":236212816,"score":7.2,"genres":"Action > 3rd-person (Other) > Fighting > Sci-fi / futuristic","desc":"<p>On one fateful day in the near future, an online database known as XTAL Tower has surfaced. The hackers who were running it claimed that the database contained the national security secrets of every country in the world. Governments have received an invitation from the mysterious XTAL: if they can create robots who are strong enough to defeat XTAL security units, the database will not be made public. The most powerful robots are dispatched on the dangerous mission: take down the units, and eventually destroy XTAL itself...</p><p><em>Zero Divide</em> is a 3D robot fighting game. You play one of eight robotic fighters and must battle your way through multiple levels in single player, or go head to head with an opponent in two-player mode. There is various unlockable content: mini-games, (e.g. a side-scrolling shoot 'em up), easter eggs, etc.</p>"},{"name":"Zero Divide 2: The Secret Wish","year":1997,"developer":"Zoom, Inc.","url":"psx-chd-roms-u-z/Zero%20Divide%202%20-%20The%20Secret%20Wish%20%28Europe%29.chd","filesize":326310262,"score":6.7,"genres":"Action > 3rd-person (Other) > Fighting > Sci-fi / futuristic","desc":"<p>XTAL has been defeated and the hackers responsible rounded up. However, the leader of the hackers reveals that the group have also unleashed a second artificial intelligence into the data library, known as EVE. The player must take control of one of EVE's attack programs and use them to destroy the other guard programs and then EVE herself.</p><p><em>Zero Divide 2: The Secret Wish</em> is a sequel to the robot fighting game Zero Divide. The game features higher resolution graphics and more detailed character models. It adds two new robots, the nurse-like Pixel and the crab-like Cancer, along with a few new bosses and hidden characters. It also adds various new arena types of different shapes (the original game only had standard square arenas), including completely walled-in ones, as well as arenas with low barriers that the opponent can be juggled over to lead to a ring out. Rounds are now considerably shorter, and the robot's armour easier to knock off.</p>"},{"name":"Zero Kara no Mahjong: Mahjong Youchien Tamago-gumi","year":1998,"developer":"Affect Co.,Ltd"},{"name":"Zero Kara no Mahjong: Mahjong Youchien Tamago-gumi 2","year":2000,"developer":"Affect Co.,Ltd"},{"name":"Zero Kara No Shogi: Shogi Youchien Ayumi-gumi","year":1999,"developer":"Affect Co.,Ltd"},{"name":"Zero Pilot: Ginyoku no Senshi","year":1998,"developer":"Soliton Soft","url":"psx-chd-roms-u-z/Zero%20Pilot%20-%20Gin%27yoku%20no%20Senshi%20%28Japan%29%20%28Rev%201%29.chd","filesize":296539317,"score":"","genres":"Simulation > 1st-person > 3rd-person (Other) > Direct control > Flight / aviation > Historical events > World War II","desc":"<p><em>Zero Pilot: Fighter of Silver Wing</em> is a combat flight simulator taking place during World War II. The game is based on the PC game Pacific Strike but has completely different content. The most notable difference is that the game is played from a Japanese perspective and not the American. There are a total of 25 Japanese planes such as the Kyūshū J7W1 Shinden which can be flown from both a first person view (with or without cockpit) as well as different third person camera views. Between missions the player returns to the base where it is possible to interact with various NPCs. There are a total of 19 missions which involve both dogfights, reconnaissance and bombings. There is also a VS. Battle mode for one-on-one fights.</p>"},{"name":"Zero4 Champ: Doozy-J","year":1997,"developer":"Media Rings Corporation","url":"psx-chd-roms-u-z/Zero4%20Champ%20DooZy-J%20%28Japan%29.chd","filesize":304352879,"score":"","genres":"Racing / Driving > Behind view > Anime / Manga > Japanese-style adventure > Mini-games > Direct control > Automobile > Licensed","desc":"<p><em>Zero4 Champ: Doozy-J</em> is a racing game from <em>Zero4 Champ</em> series that comes with a full story mode with anime-style characters, and covers latest car models from six car manufacturers. Side from single-player story mode, the game includes VS two-player race where one can compete against a CPU or another player on the same screen, and time/speed attack mode. During the story mode there is an adventure style gameplay where player has options such as move somewhere, talk to other characters, look at something, or use an item.</p><p>Aside from the main game, there are several mini-games, such as cards, slot machine, RPG, which appear in the story mode, but can also be played as standalone. Some of not listed mini-games also include:</p><ul><li>Mezashi de Pon! - Platform game where you launch harpoon at various fish and underwater life from your boat. The player can only regular the angle of fire and time of launching the harpoon. The goal is to get as many fish within the allotted time.</li><li>Long Shoot - Basketball free kick mini-game where player can choose the angle at which to throw the ball at the net. This mini-game supports two players who throw the ball at the net in turns, first one who scores five nets wins. This mini-game uses side-view perspective.</li><li>The Storehouse - Top-down puzzle game where you need to properly stack boxes which come in various shapes in the allotted space before the time runs out.</li><li>Arm Champ - Arm wrestling mini-game from the first-person perspective showing only the player's and opponent's arm.</li></ul><p>| Car Data (for featured cars in the game) || Name | Engine | 0-100 km/h | Weight || --- | --- | --- | --- || Toyota Supra RZ-S | 2977 cc | 13.92 sec | 1490 kg || Toyota Celica GT-FOUR | 1998 cc | 13.55 sec | 1380 kg || Toyota MR2 GT-S | 1998 cc | 13.58 sec | 1260 kg || Nissan Skyline GT-R V-Spec | 2568 cc | 12.50 sec | 1540 kg || Nissan Silvia K's Aero | 1998 cc | 14.21 sec | 1250 kg || Nissan Fairlady Z 300ZX Twin Turbo | 2960 cc | 13.94 sec | 1570 kg || Nissan 180SX Type X | 1998 cc | 14.91 sec | 1220 kg || Mitsubishi GTO Twin Turbo | 2972 cc | 13.54 sec | 1710 kg || Mitsubishi Lancer GSR Evolution IV | 1997 cc | 13.30 sec | 1350 kg || Honda NSX | 2977 cc | 12.83 sec | 1350 kg || Honda Integra 3-door Coupe Type-R | 1797 cc | 14.27 sec | 1080 kg || Subaru Impreza WRX Type-RA Sti | 1994 cc | 13.29 sec | 1220 kg || Subaru Legacy Touring Sedan RS | 1994 cc | 14.53 sec | 1380 kg || Mazda RX-7 Type-RZ |  654 cc x2 |  13.61 sec |  1250 kg |</p>"},{"name":"Zia and the Goddesses of Magic","year":2016,"developer":"OrionSoft"},{"name":"ZigZagBall","year":1998,"developer":"Lay-Up KK","url":"psx-chd-roms-u-z/ZigZagBall%20%28Japan%29.chd","filesize":140653128,"score":"","genres":"Action > Behind view > Platform","desc":"<p>\"ZIG ZAG BALL\" is a simple ball action game based on Putting Golf, Billard and Pin ball.<br>Enjoy this fantastic and comical game starred by unique characters and ball characters with your family!</p>"},{"name":"Zill O'll","year":1999,"developer":"KOEI Co., Ltd.","url":"psx-chd-roms-u-z/Zill%20O%27ll%20%28Japan%29%20%28Rev%201%29.chd","filesize":235326839,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Turn-based > Fantasy","desc":"<p>It is the year 1200 in the timeline of the Vyashion continent. The evil Emperor Balor, ruler of the Dyneskal Empire, has been defeated, and an era of relatively peaceful co-existence between the continent's various races began. However, a new threat arises when the sleeping Dragon King awakens beneath his secluded island. Supervising the life of humans, the Dragon King prefers to keep them in a state of perpetual war, so that no faction would gain the upper hand, believing that is the only way to uphold balance. An adventurer who possesses the unique gift of the Infinite Soul, granting him or her the greatest power of choice, rises to the challenge of shaping the fate of humanity.</p><p><em>Zill O'll</em> is a Japanese role-playing game with several distinguishing characteristics. The basic mechanics follow the convention of the genre, with simple turn-based combat (against enemies visibly walking on-screen during exploration) and semi-automatic leveling. Player-controlled character can also learn various skills and raise elemental affinities which play a role in combat. Defeating enemies quickly bestows benefits on the party. </p><p>The game's unusual features lie in its scenario system. The player creates the main character by choosing his or her gender, answering a few moral questions, and choosing the initial location. Depending on these combinations the initial quest will be different, though after a while all the prologues merge into a single main plot. Despite being largely linear, this plot can be affected to a degree by decisions made by the player. Locations can be visited by selecting a destination on the world map. Each trip takes a certain amount of time, which must be taken into consideration in conjunction with the events of the main plot.</p><p>The player is also free to complete quests in any order. Plot-dictated events (e.g. outbreak of a war) will normally occur regardless of the player's input. Important characters may stay alive or die depending on the player's choices and level of involvement in their personal quests. In addition, towns offer guild quests coming in five varieties - delivery, escort, discovery, slay, and rescue. These quests may open new areas and grant the party experience as well as special Soul points, which are used to steer a character in a direction corresponding to a certain class.</p><p>The lead character also has unique attributes such as bravery, kindness, etc. These attributes may be affected by the player's choices and also influence the hero's relationships with other characters. These relationships are measured according to the emotion of the character in question, ranging from hatred to adoration, and eventually determine the character's fate during the story's conclusion.</p>"},{"name":"Zipangujima: Unmei wa Saikoro ga Kimeru!?","year":1999,"developer":"Act Studio"},{"name":"Zoboomafoo: Leapin' Lemurs!","year":2001,"developer":"Big Grub","url":"psx-chd-roms-u-z/Zoboomafoo%20-%20Leapin%27%20Lemurs%21%20%28USA%29.chd","filesize":338666391,"score":"","genres":"Action > 3rd-person (Other) > Licensed","desc":"<p><em>Zoboomafoo: Leapin' Lemurs!</em> is a game based on the Kratt Brothers TV series <em>Zoboomafoo</em>. It's Lemur Day for Zoboo, and he's inviting all of his animal friends to his party, but there are no snacks for the party! With the help of his Zobooland friends, he travels to different lands in search of the snacks needed for the party, as well as his animal friends. He can also ride on the animal friends to collect unreachable snacks. In each level there is also an object that looks like a swirl. If Zoboo collects it and brings it to the exit, he can go to the Zobooland bonus level, where he must collect as many goobleberries as he can on the tall mountain and then feed the berries to Gooble.</p>"},{"name":"Zoku Hatsukoi Monogatari - Shuugaku Ryokou (Disc 1)","year":1998,"developer":"Koga Game Factory","url":"psx-chd-roms-u-z/Zoku%20Hatsukoi%20Monogatari%20-%20Shuugaku%20Ryokou%20%28Japan%29%20%28Disc%201%29.chd","filesize":411592723,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga","desc":"<p><em>Zoku Hatsukoi Monogatari: Shūgaku Ryokō</em> is a mixture of adventure and \"love simulation\" - more specifically, first love. The player takes the role of a male student and can choose any time period between ground school to college. Every time period has four different girls that the hero can fall in love with. The player must choose one of those girls as the main love object. The setting is the same in every time period: the class goes on vacation to different places in Japan. Most of the game consists of traveling from place to place, trying to be at the right place the right time and make the right decision. The player must assemble a schedule for each location. It is possible to manage the player character's finances, as well as buy items that can be given to the girls.</p>"},{"name":"Zoku Hatsukoi Monogatari - Shuugaku Ryokou (Disc 2)","year":1998,"developer":"Koga Game Factory","url":"psx-chd-roms-u-z/Zoku%20Hatsukoi%20Monogatari%20-%20Shuugaku%20Ryokou%20%28Japan%29%20%28Disc%202%29.chd","filesize":423517016,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga","desc":"<p><em>Zoku Hatsukoi Monogatari: Shūgaku Ryokō</em> is a mixture of adventure and \"love simulation\" - more specifically, first love. The player takes the role of a male student and can choose any time period between ground school to college. Every time period has four different girls that the hero can fall in love with. The player must choose one of those girls as the main love object. The setting is the same in every time period: the class goes on vacation to different places in Japan. Most of the game consists of traveling from place to place, trying to be at the right place the right time and make the right decision. The player must assemble a schedule for each location. It is possible to manage the player character's finances, as well as buy items that can be given to the girls.</p>"},{"name":"Zoku Hatsukoi Monogatari - Shuugaku Ryokou (Disc 3)","year":1998,"developer":"Koga Game Factory","url":"psx-chd-roms-u-z/Zoku%20Hatsukoi%20Monogatari%20-%20Shuugaku%20Ryokou%20%28Japan%29%20%28Disc%203%29.chd","filesize":477380944,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga","desc":"<p><em>Zoku Hatsukoi Monogatari: Shūgaku Ryokō</em> is a mixture of adventure and \"love simulation\" - more specifically, first love. The player takes the role of a male student and can choose any time period between ground school to college. Every time period has four different girls that the hero can fall in love with. The player must choose one of those girls as the main love object. The setting is the same in every time period: the class goes on vacation to different places in Japan. Most of the game consists of traveling from place to place, trying to be at the right place the right time and make the right decision. The player must assemble a schedule for each location. It is possible to manage the player character's finances, as well as buy items that can be given to the girls.</p>"},{"name":"Zoku Hatsukoi Monogatari - Shuugaku Ryokou (Disc 4)","year":1998,"developer":"Koga Game Factory","url":"psx-chd-roms-u-z/Zoku%20Hatsukoi%20Monogatari%20-%20Shuugaku%20Ryokou%20%28Japan%29%20%28Disc%204%29.chd","filesize":440119160,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga","desc":"<p><em>Zoku Hatsukoi Monogatari: Shūgaku Ryokō</em> is a mixture of adventure and \"love simulation\" - more specifically, first love. The player takes the role of a male student and can choose any time period between ground school to college. Every time period has four different girls that the hero can fall in love with. The player must choose one of those girls as the main love object. The setting is the same in every time period: the class goes on vacation to different places in Japan. Most of the game consists of traveling from place to place, trying to be at the right place the right time and make the right decision. The player must assemble a schedule for each location. It is possible to manage the player character's finances, as well as buy items that can be given to the girls.</p>"},{"name":"Zoku Mikagura Shoujo Tanteidan - Kanketsuhen (Disc 1)","year":1999,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-u-z/Zoku%20Mikagura%20Shoujo%20Tanteidan%20-%20Kanketsuhen%20%28Japan%29%20%28Disc%201%29.chd","filesize":409669905,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Detective / mystery","desc":"<p>Zoku Mikagura Shoujo Tanteidan～Kanketsu Hen～ is an adventure game that lets players enter into the mystic Taisho and early Showa periods and find out the truth behind each case.<br>The number of scenarios has been increased largely and the “inference trigger” feature is kept intact to deliver the most enjoyable detective game experience.</p>"},{"name":"Zoku Mikagura Shoujo Tanteidan - Kanketsuhen (Disc 2)","year":1999,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-u-z/Zoku%20Mikagura%20Shoujo%20Tanteidan%20-%20Kanketsuhen%20%28Japan%29%20%28Disc%202%29.chd","filesize":326760373,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Detective / mystery","desc":"<p>Zoku Mikagura Shoujo Tanteidan～Kanketsu Hen～ is an adventure game that lets players enter into the mystic Taisho and early Showa periods and find out the truth behind each case.<br>The number of scenarios has been increased largely and the “inference trigger” feature is kept intact to deliver the most enjoyable detective game experience.</p>"},{"name":"Zoku Mikagura Shoujo Tanteidan - Kanketsuhen (Disc 3)","year":1999,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-u-z/Zoku%20Mikagura%20Shoujo%20Tanteidan%20-%20Kanketsuhen%20%28Japan%29%20%28Disc%203%29.chd","filesize":305955517,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Detective / mystery","desc":"<p>Zoku Mikagura Shoujo Tanteidan～Kanketsu Hen～ is an adventure game that lets players enter into the mystic Taisho and early Showa periods and find out the truth behind each case.<br>The number of scenarios has been increased largely and the “inference trigger” feature is kept intact to deliver the most enjoyable detective game experience.</p>"},{"name":"Zoku Mikagura Shoujo Tanteidan - Kanketsuhen (Disc 4)","year":1999,"developer":"Human Entertainment, Inc.","url":"psx-chd-roms-u-z/Zoku%20Mikagura%20Shoujo%20Tanteidan%20-%20Kanketsuhen%20%28Japan%29%20%28Disc%204%29.chd","filesize":381086465,"score":"","genres":"Adventure > 1st-person > Fixed / flip-screen > Anime / Manga > Detective / mystery","desc":"<p>Zoku Mikagura Shoujo Tanteidan～Kanketsu Hen～ is an adventure game that lets players enter into the mystic Taisho and early Showa periods and find out the truth behind each case.<br>The number of scenarios has been increased largely and the “inference trigger” feature is kept intact to deliver the most enjoyable detective game experience.</p>"},{"name":"Zoop","year":1995,"developer":"Hookstone Ltd.","url":"psx-chd-roms-u-z/Zoop%20%28Japan%29.chd","filesize":87427021,"score":6.9,"genres":"Action > Puzzle > Top-down > Fixed / flip-screen > Tile matching puzzle > Direct control > Licensed","desc":"<p><em>Zoop</em> is a fast-paced puzzle game in which the player eliminates colored shapes that are approaching his alter ego, another colored shape, before they reach the top, somewhat similarly to Tetris.</p><p>In order to eliminate the other shapes, you must point your piece at it and 'fire'. If the shape is the same color as your piece, the shape is eliminated, as well as all of the shapes of the same color behind it, until your piece hits a piece of a different color. If the shape is of a different color, or it is hit when collecting a line of similar shapes, your piece exchanges colors with the shape.</p>"},{"name":"Zork I: The Great Underground Empire","year":1996,"developer":"Arc System Works Co., Ltd.","url":"psx-chd-roms-u-z/Zork%20I%20-%20The%20Great%20Underground%20Empire%20%28Japan%29.chd","filesize":343518787,"score":"","genres":"Adventure > 1st-person > Interactive fiction / text adventure > Puzzle elements > Fantasy","desc":"<p>A radical graphical remake of Zork: The Great Underground Empire made some 19 years after the series debut on a PDP-10 mainframe at MIT, this version boasts the incorporation of modern gameplay amenities undreamed of the first time around, such as automapping and, er, graphics.</p><p>Given ample time to drift wildly, the story and premise appear to have remained remarkably close to the source material -- the locations, layout and denizens of this fantastical subterranean treasure-hunt familiar to anyone with even a passing acquaintance with the original game. Where the biggest change lies, of course, is in the transition from the text parser to an interface controllable by a console's joystick. Adapting some sentence-construction conventions from the graphical adventure game genre (and the interfaces of Lucasfilm's and Legend's early entries in particular), menus selectable with a joystick pointer fill in for common \"action\" verbs while icons represent the inventory items the verbs influence; an expanded compass rose permits precise navigation of the Flatheadian ruins. (Alas! No secret joystick-button combination for \"xyzzy\"!)</p><p>In short: as faithful a reproduction of the original experience as you're going to find without employing a keyboard or voice-recognition software, plus \"modern\" graphics, sound and music!</p>"}]