[{"name":"007: GoldenEye","year":1997,"developer":"Rare Limited","url":":007 - GoldenEye (USA)","filesize":10777021,"score":8.4,"genres":"Action > 1st-person > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>The name is Bond. James Bond. The famous hero of Ian Fleming's novels returns in this first-person shooter, which is based on the movie of the same name. Agent 007 and his friend Alec Trevalyan (a.k.a. Agent 006) were sent to the Soviet Union on a secret mission. But everything goes wrong, James Bond barely escapes, and his friend is presumed dead.</p><p>Ten years later, a mysterious organization named \"Janus\" appeared. Commanding a new satellite called \"GoldenEye\", the organization attempts to steal money electronically from banks, deleting all evidence of transfer. It's up to our Agent 007 to venture to the Soviet Union once again and to put an end to Janus' ambitions.</p><p>In this 3D action game, the player controls James Bond from a first-person perspective, using a variety of weapons (from knuckles to grenade launcher) to eliminate his foes. However, many parts require the player to be careful, to stay unnoticed, or to snipe guards from distance, since they will react to his presence and alarm their comrades. The game is divided into missions, and in most of them Bond will have to perform other tasks besides killing his enemies: disarm bombs, take pictures of important evidence, or avoid killing scientists. The game features a multiplayer mode with a variety of options and three difficulty levels. Higher difficulty means, besides having to deal with tougher enemies, additional objectives needed to be fulfilled in order to successfully complete the level.</p>"},{"name":"007: The World Is Not Enough","year":2000,"developer":"Eurocom Developments Ltd","url":":007 - The World Is Not Enough (USA)","filesize":26593639,"score":7.7,"genres":"Action > 1st-person > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p><em>007: The World is Not Enough</em> is a James Bond game based on the 1999 movie of the same name. Both game and film follow Bond's investigation of attacks on a British oil tycoon's new pipeline, while the game introduces new areas and a backstory not seen in the film. James Bond is a MI5 agent that employs gadgets and gunplay, with each mission requiring the player to complete specific objectives outlined in a pre-mission briefing.</p><p>In contrast to the PlayStation title of the same name, this version is structured more like a successor to Rare's GoldenEye 007. There are 14 missions with three difficulty settings (Agent, Special Agent, 00 Agent), and higher difficulty settings add increasingly complicated objectives to each mission. An \"awards\" system encourages replay by granting new multiplayer skins, maps, and modes for beating target times for single-player levels.</p><p>The game includes a local, split-screen multiplayer mode for up to four players or a combination of computer-controlled bots. Some levels are taken from single-player mode, while others are exclusive to multiplayer. New game modes include King of the Hill, Capture The Briefcase, and Last Agent Standing. The notorious Golden Gun also returns from <em>GoldenEye 007</em>, and retains its one-shot-kill power. Weapon groups and victory conditions can be tweaked at the start of a multiplayer match.</p>"},{"name":"1080° TenEighty Snowboarding","year":1998,"developer":"Nintendo EAD","url":":1080 TenEighty Snowboarding (Japan, USA) (En,Ja)","filesize":11873369,"score":8,"genres":"Sports > 1st-person > Behind view > Snowboarding / skiing","desc":"<p><em>1080° Snowboarding</em> is a snowboard racing game. The player will find 6 downhill slopes and a half-pipe as courses, several characters to choose from, and be able to perform more than 25 tricks. After choosing a character and a board among the available eight, the player can compete in a variety of events:</p><ul><li>Match Race: Race head-to-head against a computer controlled opponent.</li><li>Time Attack: Try to beat the best time down a slope.</li><li>Trick Attack: Try to get the best trick score on a slope.</li><li>Contest: Race for the best time down a slalom route.</li><li>2P Vs.: Race against a friend.</li><li>Practice: Practice tricks in a half-pipe or jump slope.</li></ul>"},{"name":"40 Winks","year":2019,"developer":"Eurocom Developments Ltd"},{"name":"64 Ōzumō","year":1997,"developer":"Bottom Up Interactive"}]