[{"name":"AeroFighters Assault","year":1997,"developer":"Paradigm Entertainment Inc.","url":":AeroFighters Assault (USA)","filesize":5003100,"score":6,"genres":"Action > Simulation > Behind view > Shooter > Flight / aviation","desc":"<p>In <em>AeroFighters Assault</em> a terrorist organisation named Phutta Morgana has melted the Antarctic and is using the water to flood Earth's cities. The player takes part in the Project Blue unit which has to stop these terrorist acts.</p><p>Regarding gameplay, the game is a mix between a regular shooter like Star Fox 64 and a simulation like Pilotwings 64: the player observes the action from behind the aircraft and uses the analog stick to dodge and the other buttons to shoot enemies. Each of the eight planes (six regular and two bonus) features four different weapons: two have unlimited ammo, air mines and the special weapon are restricted to respectively ten and two uses per round. Before every of the eight regular and four bonus missions the player can choose between one of four characters and his aircraft (the other ones become his wingmen).</p>"},{"name":"AeroGauge","year":1997,"developer":"Locomotive","url":":AeroGauge (USA)","filesize":3019721,"score":6,"genres":"Action > Racing / Driving > Behind view > Sci-fi / futuristic","desc":"<p>In the tradition of F-Zero and Wipeout, <em>AeroGauge</em> is a sci-fi racer that pits you and a friend in a fast-paced race to the finish through futuristic tracks, riding and competing with crafts that act more like planes than racing machines as they skim many metres above the ground. Play solo through the grand prix, or beat down your best times in the time trial mode. </p><p>Each track features a number of twists and turns, whether it be racing upside down or vertically, with a number of obstacles in your path. There's no weapons, though, it's just you and the open road ahead.</p>"},{"name":"Aidyn Chronicles: The First Mage","year":2000,"developer":"H2O Entertainment Ltd.","url":":Aidyn Chronicles - The First Mage (USA) (Rev 1)","filesize":30281107,"score":6,"genres":"Role-playing (RPG) > Behind view > Fantasy","desc":"<p><em>Aidyn Chronicles: The First Mage</em> follows the story of Alaron, poisoned by mysterious goblins while out on patrol in the grounds of King Loyd's kingdom. Without an ordinary cure for his illness, Alaron must set out on a journey with a selection of companions in search of the antidote. Little does Alaron know that the journey is even more dangerous then firstly thought, with a mysterious evil force brewing in the distance.</p><p>In this 3D fantasy role-playing game, you must complete a set of quests, through the use of items and magic, while following a slightly non-linear storyline, choosing the order in what to embark tasks on. The game features two distinctive different modes: exploring and fighting. Alaron explores the game world freely, discovers special places and talks to the inhabitants. There are no random encounters but if he meets an enemy the game switches to the combat screen. Combat is basically turn-based but not in the way common in console RPGs: during a character's turn he can be moved in real-time in a circular way — the characters move constantly towards each other. When two rings intersect the characters can launch a regular or magic attack. The party selection (up to four characters) is pre-defined by the story.</p>"},{"name":"Air Boarder 64","year":1998,"developer":"Human Entertainment, Inc.","url":":Airboarder 64 (Europe)","filesize":6834317,"score":5.8,"genres":"Action > Sports > Behind view > Tricks / stunts > Direct control","desc":"<p><em>Air Boarder 64</em> is a game that resembles skateboarding games like Tony Hawk's Pro Skater but with a certain aspect of it being quite different. Instead of the usual skateboards the game features hover boards.</p><p>The single-player option features the following modes:</p><ul><li><p>Lecture: the mode where you can learn the controls and the terms the game uses.</p></li><li><p>Street Work: the main mode of the game. At the beginning there are 4 available characters (others become available later), 5 stages and 4 boards (with more available later) from which you can choose. In each stage you are given a time limit in which you must perform as many tricks as possible with your board. There are also yellow circles lying around that you must pass through. Each time you pass through one the timer resets back and, if you pass through all them, the game ends regardless of how much time is left. When the game ends you get a rank depending on the points you accumulated and if the rank is high enough a level of higher difficulty is unlocked (with a total of 3 difficulty levels per stage).</p></li><li><p>Time Attack: you must pass through all the coloured circles in a designated order and within the littlest time possible. The spots where the circles are can be seen in a map that appears onscreen.</p></li><li><p>Coin: mode in which you must get all the coins that are scattered in the stage within the time limit.</p></li><li><p>Free Run: this mode is free of challenges (no time limit or points) and mostly serves as a means of getting you acquainted with stages.</p></li></ul><p>Two-players option features the following modes:</p><ul><li><p>Vs. Race: a race where the one that passes through all of the yellow circles in the order that is specified wins.</p></li><li><p>Vs. Coin: a mode where the player who gets all the coins or has more of them when the time ends wins.</p></li></ul>"},{"name":"All Star Tennis '99","year":1999,"developer":"Smart Dog","url":":All Star Tennis 99 (USA)","filesize":3515126,"score":6.6,"genres":"Sports > Behind view > Diagonal-down > Tennis > Licensed","desc":"<p>Play as 8 world-class ATP/WTA tour players (including Michael Chang, Gustavo Kuerten, Mark Philippoussis, Richard Krajicek, Conchita Martínez and Jana Novotná) as well as 4 fictional players through a range of tournaments on grass, clay, hard court and rebound ace surfaces.</p><p>Strikes such as lobs, volleys, smashes are available. Multiplayer options are offered for singles and doubles: up to four players can enter the challenge in a 2-on-2 match.</p>"},{"name":"All-Star Baseball 2000","year":1999,"developer":"Iguana Entertainment Incorporated","url":":All-Star Baseball 2000 (USA)","filesize":15439239,"score":8.1,"genres":"Sports > Baseball > Licensed","desc":"<p>Second in the <em>All-Star Baseball</em> series, <em>All-Star Baseball 2000</em> includes a range of improvements and new features over All-Star Baseball '99:</p><ul><li>Motion captured technology allows for a realistic representation of player movements, swings, throws and catches.</li><li>Improved roster management includes the ability to sign players from the minor league, as well as create new players with new stats.</li><li>Play a 162 game inter-league season or the complete 1999 MLB scheduled season.</li></ul><p>The 30 teams in the game, home stadiums, home and away jerseys and players' faces sizes and play styles coincide with the real ones, since the game is licensed. Longer replays are possible through use of the Expansion Pak.</p>"},{"name":"All-Star Baseball 2001","year":2000,"developer":"High Voltage Software, Inc.","url":":All-Star Baseball 2001 (USA)","filesize":15439406,"score":7.8,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>The last <em>All-Star Baseball</em> on the N64 once again includes some new features as well as improvements to previous play modes and options. For 2001, a new team is included, The Coopertown Legends, featuring a selection of some of the finest players to ever grace the MLB, including Yogi Berra, Willie Stargell and Reggie Jackson.</p><p>Along with the legends team, you can choose from every player, team and stadium from the real 2000 MLB season. Each player includes facial expressions and looks inspired to realism, plus motion-captured player movements, batting stances and reactions to key events during play.</p>"},{"name":"All-Star Baseball 99","year":1998,"developer":"Iguana Entertainment Incorporated","url":":All-Star Baseball 99 (USA)","filesize":11758463,"score":7.6,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>All 30 Major League Baseball teams feature in the first <em>All-Star Baseball</em> title by Acclaim. Game modes include Training, Season, Playoff, World Series, plus an All-Star Match, Home Run Derby, and MLB trivia. 100 different batting styles are featured, as well as motions such as sliding catches, base collisions, kneeling throws and broken bats.</p><p>You can release, sign up and trade players from all around the league, creating your own team from the entire 700-player roster, which includes minor league players ready to be discovered. If a player fitting your demands doesn't exist, you can use the Create a Player mode for further versatility. There are action and simulation modes, plus 3 skill levels. John Sterling and Michael Kaye provide the commentary.</p>"},{"name":"Animal Crossing","year":2001,"developer":"Nintendo","url":":Animal Crossing","filesize":12385010,"score":8,"genres":"Simulation > Diagonal-down > Meditative / Zen > Persistent > Life / social simulation > Direct control > Regional differences","desc":"<p><em>Animal Crossing</em> is an enhanced rerelease of Dōbutsu no Mori +, designed specifically for Western audiences. As such, it replaces all Japanese cultural references and celebrations with ones that would be more familiar to the American, European, and Australian audiences it was released for. This includes such holidays as a Harvest Festival in November, April Fool's Day, and Mother's Day and Father's Day. New items and events were also added.</p>"},{"name":"Armorines: Project S.W.A.R.M.","year":1999,"developer":"Acclaim Studios Limited","url":":Armorines - Project S.W.A.R.M. (USA)","filesize":13754476,"score":6.2,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic > Regional differences","desc":"<p>You have two Armorines to play as, each with their own selection of weapons. In a not distant future time, you strenuously fight against bugs of all sizes, as you attempt to impede the enemies from eliminating human civilization as we know it, and have to succeed within 120 hours. </p><p>This game uses the Turok 2 engine, and has similar themes and elements to the movie <em>Starship Troopers</em>.</p>"},{"name":"Army Men: Air Combat","year":2000,"developer":"The 3DO Company","url":":Army Men - Air Combat (USA)","filesize":5146360,"score":7.2,"genres":"Action > Shooter > Flight / aviation","desc":"<p>This installment in the long-running Army Men series is the first to feature third-person aerial combat in full 3D. </p><p>Choosing a chopper among the Huey, Chinook, Super Stallion, or Apache, the player will have to rescue or provide air support to fellow Army Men, while shooting down anything that moves (including enemy helicopters and troops, as well as hordes of insects) across 16 different missions.</p><p>The game also features a multiplayer mode where players can either battle each other or join forces in co-op.</p>"},{"name":"Army Men: Sarge's Heroes","year":1999,"developer":"The 3DO Company","url":":Army Men - Sarge's Heroes (USA)","filesize":5360832,"score":5.9,"genres":"Action > Behind view > Shooter > Direct control","desc":"<p>One morning Sarge is resting in his cot when the Tan launch a surprise attack on the Green base.  Sarge and the Colonel are forced to retreat just as the base is overrun.  But in the chaos, Sarge's entire team of elite soldiers, Bravo Company, has been captured by the Tan.  Worse yet, the Tan have made an amazing discovery: blue portals that lead to the real world!  They use these portals to take amazing weapons of war from the real world into the plastic world including magnifying glasses, deadly robot action figures, and fire crackers.  It's up to you, as Sarge, to rescue your team and put an end to the blue portals and Tan's evil schemes.</p><p>Control Sarge in this Army Men third-person shooter.  You will wage war across Tan-infested territories, both in the real and plastic world. Make Sarge proud as you battle the Tan army across 14 levels, utilizing 13 unique weapons like sky rockets and spray cans. Fight against not only infantrymen, tanks, and helicopters, but also killer toy robots and insects.  This third game in the Army Men series adds several new features, including 3DO's unique Plastosheen lighting effects, which give the army men a real-life plastic shine. </p><p>Also included is a multiplayer mode.  Choose your character and even your color and duke it out with your friends.  You can choose from many different weapons and battle each other in areas from the game or exclusive multiplayer levels.  Even incorporated is the portal system, by which you can enter blue portals and come out anywhere in the level.</p>"},{"name":"Army Men: Sarge's Heroes 2","year":2000,"developer":"The 3DO Company","url":":Army Men - Sarge's Heroes 2 (USA)","filesize":4994837,"score":5.9,"genres":"Action > 3rd-person (Other) > Shooter","desc":"<p>It seems those plastic men never lack any energy nor motivation to take each other out. Like in the other <em>Army Men</em> games, Sarge and the Green Army are at it again with the Tan Army. This time, General Plastro of the Tan Army has teamed up with members from the Blue side to wipe out the Green Army. As Sarge, you must fight your way through numerous missions with the backing of assorted weaponry ranging from crossbows to rocket launchers, in order to save Green Nation from the enemy invasion. Mission objectives vary from complete destruction of the other side to rescue missions.</p>"},{"name":"Asteroids Hyper 64","year":1999,"developer":"Syrox Developments, Ltd.","url":":Asteroids Hyper 64 (USA)","filesize":2884908,"score":5.5,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>An updated version of the classic arcade blast 'em up, this game features full 3D environments, all-new weapons and defense systems and a 2-player split-screen mode. The gameplay is exactly the same. Pilot a spacecraft and destroy the oncoming asteroids, each of different sizes, defeating the enemy boss at the end of each level. Alien ships and black holes are also out there, along with ship upgrades that update your ship's weapons and defense systems.Multiplayer options comprise cooperative and competitive options.</p>"},{"name":"Augusta Masters '98: National Golf Club","year":1997,"developer":"T&E Soft","url":":Augusta Masters '98 - National Golf Club (Japan) (En)","filesize":13384427,"score":"","genres":"Sports > Golf","desc":"<p>Japan-only T&amp;E SOFT golf game for N64. Once again featuring the August golf course, but this time with a full 3D dynamic camera. As with all golf games from T&amp;E it plays a very good game of golf, though the menu interface is not as straightforward as other games in the series. The engine was later used for one additional golf game on N64.</p>"},{"name":"Automobili Lamborghini","year":1997,"developer":"Titus France SA","url":":Automobili Lamborghini (USA)","filesize":2817604,"score":6.9,"genres":"Racing / Driving > Behind view > Automobile > Street racing > Vehicle simulator","desc":"<p>One of the earlier racing games for the Nintendo 64 developed by Titus. 8 cars are included in this game were the Lamborghini Diablo, Porsche 959, Ferrari F50 and some hidden ones. The courses are detailed including special effects like lens flares. Races take you through six circuits in exotic areas around the world. There are 4 modes in Single Player including Arcade Mode, Championship Mode, Single Race and Time Trials. The game also includes 4 player support.</p>"}]