[{"name":"Bakushō Jinsei 64: Mezase! Resort Ō","year":1998,"developer":"Taito Corporation"},{"name":"Bangai-O","year":2000,"developer":"Treasure Co., Ltd."},{"name":"Banjo-Kazooie","year":1998,"developer":"4J Studios Ltd.","url":":Banjo-Kazooie (USA) (Rev 1)","filesize":16347487,"score":8.3,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p><em>Banjo-Kazooie</em>'s fairy tale back story is reminiscent of Snow White's. A gnarled, ugly witch named Gruntilda asks her magical cauldron who is the fairest of them all. Of course, the pot's answer doesn't please the hag: he singles out Banjo's sister, Tooty. When Tooty turns up missing, Banjo and his birdie buddy Kazooie set out to find her. </p><p>The worlds in <em>Banjo-Kazooie</em> are vast, and contain a variety of items to collect. Musical Notes, Puzzle Pieces (\"Jiggies\"), Mumbo Tokens, and Jinjoes are just some of the swag that Banjo must stuff in his backpack to complete his adventure. While some of the necessary items are simply stashed off the beaten path, others will require puzzle solving skills to turn up.</p>"},{"name":"Banjo-Tooie","year":2000,"developer":"Rare Limited","url":":Banjo-Tooie (USA)","filesize":32758228,"score":8.2,"genres":"Action > Behind view > Metroidvania > Platform > Puzzle elements","desc":"<p>After two years under the rock, Gruntilda is finally set free from her death bed by her two sisters. As nothing but a skeleton, Grunty and her sisters plan a way of curing her looks by sucking life out of the land so as to restore her body to its old self. On hearing this news, our two champs Banjo and Kazooie, with the aid of Mumbo, set out to stop the evil plan and seek revenge for the passing away of Bottles the mole.</p><p>In this sequel to Banjo-Kazooie, you can play as the two main characters (as well as Mumbo) just like before, although they can now separate, helping them get to even harder areas of the land. You must collect jiggies to open new areas (like in the original game) as well as learn 40 new moves to help you get along.</p><p>Similarly with another Rareware title, Donkey Kong 64, you can play four-player mini-games that range from first-person shooters to bumper cars, battle for points etc.</p>"},{"name":"BassMasters 2000","year":1999,"developer":"Mass Media, Inc.","url":":Bassmasters 2000 (USA)","filesize":9628968,"score":6.3,"genres":"Simulation > 1st-person > 3rd-person (Other) > Licensed","desc":"<p><em>BassMasters 2000</em> is a fishing simulation game which counts a total of 4 modes and has a variety of customizable options. You can create and save up to 7 anglers through the “Create Angler” option, customising characteristics such as sex, hair, face, clothes, etc. Other customisable options include “Lake Conditions” (lake location, season, weather, time, etc.), “Boat” (boat model, engine, etc.) and “Tackle” (rod/reel, line, lure, etc.). These following are the modes of play:* Exhibition —the only mode where every customisation option is available. The objective is to catch up to a certain number of fish and the sum of their weight to equal or surpass the weight that is mentioned in the beginning of the game.</p><ul><li><p>Tournament —there are 6 tournaments you must compete in and each tournament lasts for 3 days. Fishing lasts until the day is over, when the total weight of fish caught is counted and depending on how well you did you get the equivalent rank. If at the end of the last tournament you manage to rank 5th or better new equipment or boats are unlocked.</p></li><li><p>Speed Fishing —in this mode you’re given a time limit of 3 minutes and must catch as more of the fish mentioned in the overview as possible. Time is extended by one or more seconds depending on how much the fish weighs and the objective is to fish for as long as you can.</p></li><li><p>Casting Game —you must cast the line at certain spots on the lake which are specified by coloured circles, within the time limit. For each target you manage to hit you receive points and if the earned score is high enough you get additional time and the patterns in which the targets appear change.</p></li></ul>"},{"name":"Batman Beyond: Return of the Joker","year":2000,"developer":"Kemco","url":":Batman Beyond - Return of the Joker (USA)","filesize":2834050,"score":4.2,"genres":"Action > Side view > Beat 'em up / brawler > Licensed","desc":"<p>Based on the animated movie of the same name, <em>Batman Beyond</em> is a 3D brawler that puts the player on the streets of Gotham (Beyond) to take out the ever-grinning Joker, but before that an obvious long line of evil minions of his —some of which are genetically engineered. </p><p>Scroll around, punch, kick, ply with bat-weapons, and avoid being on the receiving end of those attacks. There are multiple 'bat suits' that you can choose from, each with their own special abilities and purpose.</p>"},{"name":"BattleTanx","year":1998,"developer":"The 3DO Company","url":":BattleTanx (USA)","filesize":5164426,"score":6.8,"genres":"Action > 1st-person > Behind view > Shooter > Tank > Post-apocalyptic > Sci-fi / futuristic","desc":"<p><em>BattleTanx</em> is a mission-based tank shooter game set in the post-apocalyptic future. The player can fight through single-player campaign levels based in U.S. cities against multitudes of gangs with their own tanks and heavy firepower.</p><p>The game has a large multiplayer component, allowing up to four players at once, with or without teams, AI opponents, and in several gameplay styles, including a standard deathmatch and a capture-the-flag style game.</p>"},{"name":"BattleTanx: Global Assault","year":1999,"developer":"The 3DO Company","url":":BattleTanx - Global Assault (USA)","filesize":4778197,"score":6.6,"genres":"Action > 1st-person > Behind view > Shooter > Tank > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>The year is 2049. A nuclear holocaust has caused 99.9% of the women in the entire world to die out, leaving mankind desperate to search for women for reproduction. Instinct has taken over, and the only rule is mob rule. There is no form of government, form of justice, and the only way to survive is lookout for yourself. Mobs and warlords have emerged trying to claim the world's last surviving women.</p><p>In the midst of the chaos, Griffin and Madison escape back to San Francisco with their new baby boy Brandon, where they hope to rebuild a better society. However, the evil QueenLord, Cassandra, captures him. Cassandra leads Griffin and Madison all across America and Europe in a frantic search for Brandon, who may have psychic abilities that can save the world.</p><p><em>Global Assault</em> is the sequel to the original BattleTanx. It features many new weapons, new vehicles, and new powers that were not available in the original. <em>Global Assault</em> now also features a destructible environment, allowing you to seize control of the environment and create ultimate destruction. <em>Global Assault</em> allows two players to play together in co-operative mode, or four players to go head-to-head as one of the dozens of tank gangs in all new maps and many more game modes.</p>"},{"name":"Battlezone: Rise of the Black Dogs","year":2000,"developer":"Climax","url":":Battlezone - Rise of the Black Dogs (USA)","filesize":11481451,"score":6.2,"genres":"Action > Strategy > 1st-person > Managerial / business simulation > Shooter > Tank","desc":"<p>Climb into a hover tank, and battle Soviets and aliens on the moon. The premise of the game: The Soviets and Americans are actually fighting on the moon during the cold war, unbeknownst to the public. Your job is to command fleets of tanks against the Soviets and the Americans and win the war.</p><p>There are 3 completely different game modes in the game. An arcade mode in which you fight ever increasingly difficult waves of enemies. A story mode, in which you are simply a pilot, where you are told exactly what your orders are. A strategy mode, in which you can build units and send them off to do battle for you.</p><p>In addition to containing all the missions available in the PC version of this game, there are also additional missions that continue the story where the PC game left off.</p>"},{"name":"Beetle Adventure Racing!","year":1999,"developer":"Paradigm Entertainment Inc.","url":":Beetle Adventure Racing! (USA) (En,Fr,De)","filesize":12841950,"score":8.1,"genres":"Action > Racing / Driving > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>Take control of a collection of the latest Volkswagen \"Beetle 2.0\" models (from street type to off-road designs) and race across varying road types that will test your speed and endurance (each track taking up to 4 minutes from one end to the other).</p><p>Find shortcuts or use nitro boosts to get to the end first in order to move on to the next track. If the computer AI is too easy for you, you can race against a friend in two-player race mode. Up to 4 people can also play a special Battle Mode challenge, with added abilities including weapons (from mines and rockets to magical elements) while trying to collect the flag and reach the exit.</p>"},{"name":"Big Mountain 2000","year":1998,"developer":"Natsume Co., Ltd.","url":":Big Mountain 2000 (USA)","filesize":5768263,"score":6.2,"genres":"Sports > Behind view > Snowboarding / skiing > Licensed","desc":"<p><em>Big Mountain 2000</em> is a sports game where you can choose to race with either a snowboard or a pair of skis. There are six characters (plus three unlockable) to choose from, each with different skills and three modes in total —two of them are single-player and the other one is a multiplayer one.* Championship: in Championship you can select one of the available players and choose the style you want —ski or snowboard. You can also change each player’s equipment which includes ski/snowboard and clothes. The game also lets you choose in which stage you want to compete and the race type you want to play. Race Type includes three options —Free Ride, Slalom and Giant Slalom. In Free Ride you compete against 3 CPU-controlled players, you must finish first and before time, which is increased at every checkpoint, runs out. In Slalom and Giant Slalom you must pass through the flags that are scattered throughout the course and again like in Free Ride finish first. The differences between Slalom and Giant Slalom are the latter's course being wider and presenting less flags. By successfully completing any of the above your character's skills — like cornering, acceleration, etc. — are increased.</p><ul><li><p>2P Battle: in 2P Battle two human players can compete in any of the Free Ride/Slalom/Giant Slalom races. It is possible to either choose a player from the game or load a previously saved player data from a Controller Pak. There are also no restrictions on the style each player will choose. For example one may choose to play with a skier and the other with a snowboarder.</p></li><li><p>Time Attack: there is no other competition in this mode than between you and time.</p></li></ul>"},{"name":"Bio Freaks","year":1998,"developer":"Saffire, Inc","url":":Bio F.R.E.A.K.S. (USA)","filesize":12663794,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>This game is a 3D one-on-one fighter of extraordinary violence. Take control of one of many bionically-enhanced fighters, and fight in a dangerous interactive 3D environment.</p><p>Most of the characters rely on distance attacks, which centres the game on strategic fighting rather than a boxing match; interacting with the hazardous environment adds hardship to the gameplay: while avoiding an opponent's gunfire by jetting off with your jetpack, you may just slam right into a buzzsaw coming out of the wall.</p>"},{"name":"Blast Corps","year":1997,"developer":"Rare Limited","url":":Blast Corps (USA) (Rev 1)","filesize":7240661,"score":7.9,"genres":"Action > Racing / Driving > 3rd-person (Other) > Puzzle elements","desc":"<p>Get out of the way! A nuclear missile carrier is out of control on a one way-set path, and unless that path is cleared, it will explode as soon as it makes contact with anything, destroying the world. It is up to you to clear the path so that nothing gets in the way of the Carrier.</p><p><em>Blast Corps</em> is a mix of an action and a puzzle game where destruction is key. At the start of each level the player is given a certain vehicle (ranging from robotic suits to trucks or bulldozers), and are told to clear the path for the Carrier. Players need to use their heavy-duty equipment to destroy any buildings, structures, or monuments that stand in the path of the Carrier. The difficulty increases as progress is made, though. Smaller vehicles don't affect certain buildings, and sometimes it's not even a building that's in the way. The player must use the resources around them to clear the path. Players may need a train flatbed to fill a gap, or a crane to move boxes out of the way. The Carrier is always moving, so once the player is done destroying one obstruction, they must get to the next one quickly. While players pursue their mission they must also find six scientists scattered throughout the globe to form a think-tank to solve the problem. The Carrier has to leave Earth, and it's your job to ensure that it will!</p><p><em>Blast Corps</em> features secrets to find. Besides clearing each path for the Carrier, players can go back to a level once it has been completed to take their time and explore. To fully complete a level, players must also find RDUs (Radiation Dispersal Units), which light up on the ground when the player is in close proximity to them, as well as destroy all of the buildings, rescue all of the homeless civilians, which is done by the T-chopper that accompanies the player on every mission. There are also dozens of secret time trial levels that can be found by activating special satellite dishes hidden throughout the levels. If the player manages to get all of the secrets in a level they receive a second medal, and once all of the gold medals are found the developers have a tiny message for them...</p>"},{"name":"Blues Brothers 2000","year":2000,"developer":"Player 1","url":":Blues Brothers 2000 (USA)","filesize":14929842,"score":6.1,"genres":"Action > 3rd-person (Other) > Music / rhythm > Platform > Licensed","desc":"<p>This platformer with a <em>Blues Brothers</em> theme loosely follows the plot of the film. You have to escape the prison and get the band back together in order to participate to the \"Battle of the Bands\" competition.</p><p>You can accomplish that by jumping over obstacles, beating a lot of people and collecting coins, notes, wrenches, keys and what not in four levels: Prison, Chicago, Graveyard &amp; Swamp. After each level you will free one member of the band. Additionally, the game designers threw in some rhythm-based action: sometimes you have to press the right buttons at the right time in order to proceed. The game features multiplayer, but you only get to play the rhythm mini-game.</p>"},{"name":"Body Harvest","year":1998,"developer":"DMA Design Limited","url":":Body Harvest (USA)","filesize":7164086,"score":7.3,"genres":"Action > Racing / Driving > Behind view > Sci-fi / futuristic > Regional differences","desc":"<p>The year is 2016. Humanity has been reduced to a few survivors inhabiting the orbital space station Omega. Over the course of the history, aliens visited the Earth every twenty-five years, \"harvesting\" humans as an organic material. Eventually, they launch an assault on the last remnants of the human race. But Adam Drake, a genetically engineered soldier, comes into possession of a time-traveling device. He uses it to travel to the time periods of human history when aliens performed their deadly attacks. The fate of humanity is in his hands.</p><p><em>Body Harvest</em> is an action and driving game with a mission-based structure. The protagonist travels to various locations and eras (e.g. Greece during World War II, Siberia in the 1990s, etc.) with the goal of stopping alien invasions. Missions can be accessed by traveling to specified areas on the map. Adam can move on foot and use his weapons to kill aliens; however, vehicles usually prove to be a more reliable way of tackling most missions. Adam can use most of his weapons while in a vehicle; in addition, some vehicles are outfitted with their own weapons.</p><p>Each vehicle has its own speed, armor, and fuel capacity attributes. Controllable vehicles range from armored cars and tanks to boats, helicopters, planes, and even a space ship during a few missions. Buildings scattered around levels may contain useful items, ammunition, and fuel. The player has to avoid killing innocent people; too many casualties result in a premature end of the game. Typically, the main goals in each area are to destroy the alien Shield Generator, defeat a boss enemy, and proceed to the next stage.</p>"},{"name":"Bomberman 64","year":1997,"developer":"Hudson Soft Company, Ltd.","url":":Bomberman 64 (USA)","filesize":5347207,"score":6.9,"genres":"Action > Diagonal-down > 2D scrolling > Anime / Manga > Arcade > Platform > Direct control > Sci-fi / futuristic","desc":"<p><em>Bomberman 64</em> is a 3D action platformer. In the game's one-player Adventure mode, marauders have set their sights on Bomberman's peaceful planet. You'll explore labyrinthine levels by dropping bombs, solving puzzles and finding hidden items. The action takes place across five brightly colored worlds: a smoldering volcano, ruined castle, icy mountain range, orbiting space station and storybook village. Find all 100 Gold Cards in the first five worlds and you can access a sixth world. To maximize your score, you'll need to finish each of the 20 levels as quickly as possible. Deadlines are tighter on the Hard difficulty setting. </p><p>The game's multiplayer mode comes in two variations: in Single Battle mode, players dash about arenas, trying to blow each other to pieces. Team Battle mode is a highly explosive version of capture-the-flag. Your goal here is to destroy the enemy team's gems while protecting your own. You can choose the number and duration of battles. You can also choose from three levels of artificial intelligence for CPU-controlled bombers. </p><p>When the Ghost option is selected, your little guy will return as a wispy double of his old self after he's gone boom. Ghosts can control a normal Bomberman, but they cannot deploy bombs. Other features include the possibility to toss or kick your bombs diagonally, the ability to pump up bombs, knock foes unconscious and then grab and toss them.</p>"},{"name":"Bomberman 64: The Second Attack","year":1999,"developer":"Hudson Soft Company, Ltd.","url":":Bomberman 64 - The Second Attack! (USA)","filesize":11488186,"score":7.1,"genres":"Action > Diagonal-down > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>While taking a well earned break from bombing, Bomberman finds himself being sucked into a black hole, created by Rukifellth's gravity generators. It seems the evildoer uses the gravity generators to enslave planets, while hoping to find one of seven powerful stones by which he plans to rule the planet with.</p><p>Combining puzzle solving with the classic <em>Bomberman</em> bomb-and-run gameplay, the game gives you control on Bomberman with the mission of destroying the gravity generators ending Rukifellth's plans.</p>"},{"name":"Bomberman Hero","year":1998,"developer":"A.I Co., Ltd.","url":":Bomberman Hero (USA)","filesize":9825462,"score":6.6,"genres":"Action > Diagonal-down > Platform > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>This is another game in the <em>Bomberman</em> series. Now you have to prevent the demolishing of Planet Bomber by evil Nitros and to acquire a computer disk from the robot Pibot. As always you have to place bombs in the right locations to destroy enemies, break walls, etc. Here are five different planets, 71 levels, 20 useful items, several special vehicles and your bombs.</p>"},{"name":"Bottom of the 9th","year":1999,"developer":"Konami Computer Entertainment Chicago, Inc.","url":":Bottom of the 9th (USA)","filesize":13208384,"score":5.6,"genres":"Sports > Diagonal-down > 2D scrolling > Baseball","desc":"<p>Play Exhibition and Season modes as your favorite team from the Major League Baseball. 300 real-life players, complete with a full list of stats, are included in this combination of simulation and arcade-style baseball.</p><p>Along with the usual assortment of playing options, you can also play some scenario simulations: each scenario is based on a real situation occured in the MLB. For example, hit a home run with the last ball of the match, or stop a team from scoring in the final inning to complete a scenario. Traning and support for 2-player gaming are also available.</p>"},{"name":"Brunswick Circuit Pro Bowling","year":1998,"developer":"Point of View, Inc.","url":":Brunswick Circuit Pro Bowling (USA)","filesize":7566148,"score":6.9,"genres":"Sports > Behind view > Bowling > Licensed","desc":"<p>Choose from one of the 13 genuine tournament bowlers, with real lanes, real player animations, real lane conditions and changes, real bowling balls (genuine Brunswick!) each with its physical properties. All the tournament rules are available along six game modes (Exhibition, Skins —the Brunswick \"Skins\" game—, Tournament, Career, Practice, Cosmic). The playing character is picked from the Brunswick ProStaff or self-created by the player.</p>"},{"name":"Buck Bumble","year":1998,"developer":"Argonaut Software Ltd.","url":":Buck Bumble (USA)","filesize":5311040,"score":7.4,"genres":"Action > Behind view > Shooter > Flight / aviation","desc":"<p>A chemical spill somewhere in rural England has mutated an army of bees into deadly insects. Led by their queen, they are out to destroy every living thing on the planet, including all insects that dare to stop them.</p><p>Only Buck Bumble, the only bee not to be turned evil by the ways of the queen, can save the world, and his fellow insects, from total destruction.</p><p>Using Buck's weapons, you must shoot down the many swarms of enemy bees, while staying above ground avoiding the hazards below. At times you may have to land on the ground and attack on foot, while certain enemies can only be destroyed by certain weapons.</p><p>Also included is a handful of two-player split-screen modes, including Buzz Ball, a soccer-style game where each player controls a Bee while attempting to kick the slightly larger-than-the-bee ball into the other's goal.</p>"},{"name":"Bust-A-Move '99","year":1999,"developer":"Taito Corporation","url":":Bust-A-Move '99 (USA)","filesize":7060974,"score":7.8,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Arcade > Tile matching puzzle > Direct control > Fantasy","desc":"<p>One day, Dunk, the magic magician of Bubble World, releases a spell that transports eight characters from their home worlds to Bubble World. Now it is the player's turn to bring them back home!</p><p>In Bust-A-Move 3, you must try to remove all the bubbles in each stage by connecting three or more of the same color.</p><p>Five playing modes are available:</p><ul><li>Arcade mode.</li><li>Challenge mode: in this mode the player's performance is evaluated and the game adapts to it.</li><li>Win Contest mode: challenge all eight characters.</li><li>Collection mode: a collection of levels created by <em>Bust-A-Move</em> players. Each round carries the designer's name.</li><li>Edit mode: players can create and play their own puzzles.</li></ul><p>The Nintendo 64 version also includes two- and four-player modes.</p>"},{"name":"Bust-A-Move 2: Arcade Edition","year":1998,"developer":"Taito Corporation","url":":Bust-A-Move 2 - Arcade Edition (USA)","filesize":6541167,"score":7.6,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Arcade > Tile matching puzzle > Direct control > Fantasy","desc":"<p>Bub and Bob are back! Like in Tetris in reverse, you shoot bubbles at an array of different-colored bubbles stuck in an ever descending ceiling, attempting to match them up three by three to make them disappear.</p><p>This edition contains both puzzle challenges, multiplayer and normal progressive stages.</p>"}]