[{"name":"California Speed","year":1999,"developer":"Atari Games Corporation","url":":California Speed (USA)","filesize":14711530,"score":5.5,"genres":"Racing / Driving > Behind view > Automobile","desc":"<p><em>California Speed</em> has you racing through, of course, California, with a range of different tracks based on the real maps of the state, with short-cuts and branching roads adding choice and variety. Cars include a collection of fast cars, as well as F1 cars and golf-carts, and you can customize your car's paint to suit your style. Split-screen two-player racing is supported.</p>"},{"name":"Carmageddon 2: Carpocalypse Now","year":1999,"developer":"Software Creations Ltd."},{"name":"Carmageddon 64","year":1999,"developer":"Aqua Pacific Ltd.","url":":Carmageddon 64 (USA)","filesize":12194610,"score":5.4,"genres":"Action > Racing / Driving > Diagonal-down > 2D scrolling > Automobile > Off-roading > Regional differences","desc":"<p><em>Carmageddon</em> on the Game Boy Color is, really, Carmageddon 2: Carpocalypse Now but in a three-quarter, top-down perspective. It is, however, still much the same. You are driving your car, trying to destroy other cars, run over zombies and win within the time limit.</p>"},{"name":"Castlevania","year":1999,"developer":"Konami Computer Entertainment Kobe, Inc.","url":":Castlevania (USA) (Rev 2)","filesize":9814730,"score":6.9,"genres":"Action > Behind view > Platform > Puzzle elements > Direct control > Fantasy > Horror","desc":"<p>Konami's long-running series of Castlevania games makes its debut on the N64. The traditional 2D graphics have been left behind; this is the first <em>Castlevania</em> game in 3D. However, the goal of the game remains the same: kick some vampire butt as you battle the evil Count Dracula and his minions in this platformer.</p><p>The player can either choose to be Reinhardt Schneider (for traditional \"whip action\") or Carrie Fernandez (who uses magical powers). Both characters are given an own story line. A new feature is the presence of an in-game clock that switches the game time from day to night.</p>"},{"name":"Castlevania: Legacy of Darkness","year":1999,"developer":"Konami Computer Entertainment Kobe, Inc.","url":":Castlevania - Legacy of Darkness (USA)","filesize":13740547,"score":6.7,"genres":"Action > Behind view > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p><em>Castlevania: Legacy of Darkness</em> is the sequel to the first Castlevania Nintendo 64 adventure. Although at war with the same enemy in the same castle, the player must fight as 4 different characters, with improved graphics and a new look to certain areas that appeared in the original.</p><p>To begin with, set 8 years before the events that took place in <em>Castlevania</em>, the count has kidnapped the young sister of Cornell, a powerful werewolf. As Cornell, the player must battle through the castle and defeat Dracula to save Cornell's sister.</p><p>Once completing the game as Cornell, the player may take up the role of Henry, a demon-hating hero who must save captured children from the hands of Dracula within a set time limit. The player may then take on Dracula once again as the original heroes of <em>Castlevania 64</em>, Reinhardt Schneider and Carrie Fernandez, and re-live the events of the previous game through new and improved surroundings.</p>"},{"name":"Centre Court Tennis","year":1998,"developer":"Hudson Soft Company, Ltd.","url":":Centre Court Tennis (Europe)","filesize":8455038,"score":7.2,"genres":"Sports > Behind view > Tennis","desc":"<p><em>Centre Court Tennis</em> is a tennis game that does not take itself too seriously. After creating your Lego-like character, you are set to go.</p><p>The basic game features a multiplayer mode (up to 4 players), a tournament mode and an exhibition mode. You also have four mini-games, \"Tennis Court Bingo\", \"Burning Barrels\", \"Run and Gun\" &amp; \"Knock'em Down\", where your goal is to hit certain objects in the tennis field. You can win special prices for getting enough points.</p><p>Additionally, you have a special challenge mode where you have to play against your opponent in odd conditions: your tennis field might be rotating, made of ice or be about to explode, to name a few. Beat your foe and you will be rewarded with a piece clothing or item of your choice from your opponent's dressing room. Lose and you lose the item that your opponent picks. Keep on losing and you will have to play your games wearing nothing but your underwear, which makes the game like a sort of family-friendly strip tennis.</p>"},{"name":"Chameleon Twist","year":1997,"developer":"Japan System Supply","url":":Chameleon Twist (USA) (Rev 1)","filesize":5383059,"score":6.4,"genres":"Action > 3rd-person (Other) > Platform > Direct control > Fantasy","desc":"<p>Davy the chameleon is minding his own business, when a rabbit catches his eye. Following the rabbit into its hole, he soon finds himself transformed into a super, alien chameleon, with an extra long tongue. Stuck in an unknown world, he must use his new strength to find his way out back to his home.</p><p>Using the analog stick, you can control Davy's tongue to catch enemies and throw them back as bullets, grab onto distant poles and ledges for a quick way through the land, or perform tricks like tongue-pole vault, in which he can reach even higher distances by using his tongue as a pole vault.</p>"},{"name":"Chameleon Twist 2","year":1998,"developer":"Japan System Supply","url":":Chameleon Twist 2 (USA)","filesize":5423579,"score":6.1,"genres":"Action > 3rd-person (Other) > Platform > Direct control > Fantasy","desc":"<p>After finding his way back home from his first adventure, Davy decides to relax with his friends. However, while playing on the see-saw, a huge rabbit falls from the sky, sending Davy's head long into the sky. So once again, using his long tounge to attack enemies and grab on to distant ledges, Davy must find his way home from the land in the sky.</p><p>For this second adventure, you can choose from 4 different Chameleons, Davy and friends Linda, Fred and Jack. And as well as using his tongue, Davy can also use a parasol to float across large gaps.</p>"},{"name":"Charlie Blast's Territory","year":1999,"developer":"Realtime Associates, Inc.","url":":Charlie Blast's Territory (USA)","filesize":1140224,"score":6.6,"genres":"Puzzle > Diagonal-down > Real-time > Direct control","desc":"<p>Charlie Blast is a construction worker, but quite different than his more famous colleague. Charlie has a convincing beer belly, he has trouble keeping his jeans up (yup, you will get a nice view of his crack quite frequently) and his chest hair make David Hasselhoff feel ashamed about himself. He is not trying to save a princess either; his mission is to blow islands up with TNT!</p><p>With 3D graphics and some platform elements, <em>Charlie Blast's Territory</em>, a remake of Kablooey, is a modernization of one of the classic puzzle genres where your goal is to push crates into the correct spots. </p><p>Every level is an island. On every island you have at least one bomb and one TNT box. Your goal is to push all of them next to each others and then blow everything up in a huge chain reaction. When you do that, you advance by a level. You cannot pull the crates but you can climb over them.</p>"},{"name":"Chōkūkan Night: Pro Yakyū King","year":1996,"developer":"Genki Co., Ltd."},{"name":"Chopper Attack","year":1997,"developer":"SETA Corporation","url":":Chopper Attack (USA)","filesize":5798014,"score":6.2,"genres":"Action > Behind view > Helicopter","desc":"<p>In <em>Chopper Attack</em>, you take a chopper and.. well.. attack! You get to choose between eight different attack choppers, each having its own strengths and weaknesses. </p><p>After the briefing from your XO, you are set to destroy something —tanks, other helicopters, planes, radars, buildings etc. While the mission only requires you to do something specific, destroying everything gives you bonuses and money, which you can then use to buy more heavy-duty missiles between the missions.</p><p>If you look at the screenshots, you might think that Chopper Attack is a helicopter simulation. It's not. Your elevation is fixed. There are no physics. You have boss fights against giant choppers. The game is pure and plain 3D action.</p>"},{"name":"Clay Fighter 63 1/3","year":1997,"developer":"Interplay Entertainment Corp.","url":":Clay Fighter 63 1-3 (USA)","filesize":10330597,"score":6,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy > Comedy","desc":"<p>In this zany beat 'em up, clay animated fighters clash in a fight to the clay death. Characters such as Bad Mr. Frosty (a snowman gone terribly bad), Blob (a green pile of slime), Bonker the nightmare clown and a host more are available to choose from, each with a range of moves that no clay animated character has ever attempted before (such as throwing chickens, clay, and plenty of other objects, including themselves).</p><p>Graphics are a combination of 2D clay animated characters and 3D designed foregrounds/backgrounds.</p>"},{"name":"Clay Fighter: Sculptor's Cut","year":1998,"developer":"Interplay Entertainment Corp.","url":":Clay Fighter - Sculptor's Cut (USA)","filesize":14211203,"score":5.7,"genres":"Action > Side view > 2D scrolling > Fighting > Fantasy > Comedy","desc":"<p><em>Clay Fighter: Sculptor's Cut</em> is a parody of one-on-one fighting games and features sixteen playable clay fighters, including Sumo Santa, Statue of Liberty, Booger Man and Earthworm Jim. It is the sequel to Clay Fighter 63 1/3.</p><p>Like the title suggests, it is not an entirely new game but rather a different version of it. The most notable differences are the four extra playable characters and betterments in the 2D-style camera angle. You cannot perform unlimited combos anymore either.</p><p>Moves are a mix of standard punches and kicks (although not all of the contestants have hands or legs) and a large number of special moves specific to each and combos. You can sometimes interact with your environment by kicking your opponent through a door or window and continue on the other side. You can also end the fights with Mortal Kombat-style \"Claytalities\".</p>"},{"name":"Command & Conquer","year":1999,"developer":"Westwood Studios, Inc.","url":":Command & Conquer (USA)","filesize":13634064,"score":7.3,"genres":"Strategy > Diagonal-down > Free-roaming camera > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Africa > Europe > Sci-fi / futuristic > War","desc":"<p>The Nintendo 64 version of Command &amp; Conquer includes all of the content from the DOS original and introduces an engine with 3D terrain, buildings and vehicles, while infantry still uses adapted 2D sprites. There are new 3D cutscenes exclusive to this version, as well as four Special Ops missions (two for GDI and two for Nod) which are not present in the original, and are different from the missions of the same name from the PlayStation port.</p>"},{"name":"Conker's Bad Fur Day","year":2001,"developer":"Rare Limited","url":":Conker's Bad Fur Day (USA)","filesize":61305950,"score":8.4,"genres":"Action > Diagonal-down > Platform > Puzzle elements > Shooter > Direct control > Sci-fi / futuristic > Comedy","desc":"<p>Conker the Squirrel has had a really bad day. Too much partying, too much booze - and the result is predictable: a terrible hangover. What is less predictable, however, is the fact that Conker has no idea where he is. All he wants is to go home to his girlfriend Berri, but it seems that an unknown force has thrown him into another world. The ruler of said world, the dumb, but vicious Panther King, is having a serious problem: he has been just drinking milk when he discovered that the table in his throne room is missing one of its legs. Unable to solve the problem by himself, the enraged monarch sends for the mad weasel scientist, Professor Von Kriplespac, who suggests a red squirrel as a replacement for the table's lost leg. The Panther King sends his minions after Conker, who has to explore the bizarre world, deal with its eccentric characters, stay alive, and find a way to return home.</p><p><em>Conker's Bad Fur Day</em> is a grotesque counterpart to Rare's own cheerful, child-oriented 3D action platformers (such as for example Banjo-Kazooie). Intense swearing, violence, and instances of \"toilet humor\" co-exist with cute animals and a brightly colorful fantasy world. The game also contains segments that parody famous movies, such as  The Matrix,  Terminator, and others.</p><p>The core of the gameplay is 3D platform action. Conker can jump, climb, swim, and attack enemies with various weapons (the default one being a frying pan). Conker can also collect money, which is sometimes needed to advance to a new area. The game world is reasonably open, containing an overworld from which the player can access large levels that take a while to explore. Talking to characters and performing tasks offered by them is one of the main devices used to advance the plot and unlock a different area.</p><p>A multiplayer mode is also included, allowing 4 players to battle it out in many different styles of multiplayer gameplay, including a deathmatch, a race, a \"capture the flag\"-like mini-game, etc.</p>"},{"name":"Cruis'n Exotica","year":2000,"developer":"Midway Games, Inc.","url":":Cruis'n Exotica (USA)","filesize":14338106,"score":6.3,"genres":"Racing / Driving > Behind view > Arcade > Automobile","desc":"<p>The sequel to Cruis'n World both in the arcades and on Nintendo 64, <em>Cruis'n Exotica</em> lets you race against the computer or up to three other opponents in a variety of cars and locales. Game mechanics follow arcade rules, with turbos to accelerate to (and raise) maximum speed, and any deviation off of the track bumping you right back on it.</p><p>Cars range from sportcars to more esoteric vehicles such as trucks, minis, and police vehicles. Tracks model real localities (Alaska, India, Korea, etc.) and eventually branch out into fantasy worlds (Atlantis, Amazon, Mars).</p>"},{"name":"Cruis'n USA","year":1996,"developer":"Midway Manufacturing Company","url":":Cruis'n USA (USA) (Rev 2)","filesize":4599778,"score":5.9,"genres":"Action > Racing / Driving > 1st-person > Behind view > Automobile > Street racing","desc":"<p>Originally an arcade machine, <em>Cruis'n USA</em> was then released for the Nintendo 64. The game asks players to choose from four vehicles to race in a variety of courses throughout the USA —based on real locations, their names are: Golden Gate Park, US 101, LA Freeway, Arizona (easy mode); Beverly Hills, Death Valley, Iowa, Indiana, Appalachia (medium difficulty mode); San Francisco, Redwood Forest, Grand Canyon, Chicago, Washington, D.C. (expert mode). Various pre-race options included are the choice of automatic or manual transmission, various controller configurations, as well as background music selection option.</p><p>Players take control of the vehicle from a third-person perspective, and while avoiding various hazards along the way, must beat the clock as well as the CPU-controlled rivals to achieve first place.</p>"},{"name":"Cruis'n World","year":1997,"developer":"Midway Games, Inc.","url":":Cruis'n World (USA)","filesize":11135430,"score":7.1,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Off-roading","desc":"<p>While Cruis'n USA takes the player on a trip across the highways of America, <em>Cruis'n World</em> leads them to race all around the world. Courses, taken from the coin-op version, are located in: Egypt, Florida, Germany, Hawaii, Russia (in easy mode); England, France, Kenya, New York (in medium mode); Australia, China, Italy, Mexico (in expert mode).</p><p>The gameplay is not intended to be realistic. It is for instance possible to ride across the Great Wall of China, leap-frog over a semi truck with a police car, or perform a back flip with a military ATV, or take part in a race on the moon.</p><p>Principal variations from the arcade game to the console version consist in that:* In the arcade version, introductory voice clips are present in some stages; animals explode into bloody chunks when colliding with the player's vehicle (in the N64 version they cross the road swiftly enough most of the times, and the vehicle goes across them as if they were immaterial in the infrequent other occasions).</p><ul><li>The N64 version offers two-player and tournament modes, a special course on the Moon, the possibility to enhance cars with custom boosts and alter its appearance by paintworks, and does not use the sound effects from the previous game.</li></ul>"},{"name":"Custom Robo V2","year":2000,"developer":"Noise, Inc."},{"name":"CyberTiger","year":2000,"developer":"Electronic Arts, Inc.","url":":CyberTiger (USA)","filesize":13908981,"score":6.7,"genres":"Action > Sports > Golf > Licensed","desc":"<p>A step back from the Tiger Woods PGA's simulation style, <em>Cyber Tiger Woods</em> has more of an arcade feel to it, with cartoony-style animations, fast gameplay and elements added to make the game of golf more lively than the real-life counterpart.</p><p>Although realistic elements are there, including full motion capture of Tiger Woods himself, recreations of five PGA tour courses, and the full range of moves (putting, chipping, driving, etc.), arcade elements —such as 2-player battle mode, zany characters including Little Tiger, and game modes that have you aiming to knock down the opposing character from his platform above a pool of lava turn— are central to gameplay.</p><p>Game modes include a full practise range, skins tournaments and stroke play. Plus there are hidden characters to unlock, equipment upgrades and power-ups, as well as trick shots you just won't see on the PGA tour.</p>"}]