[{"name":"Dance Dance Revolution: Disney Dancing Museum","year":2000,"developer":"Konami Computer Entertainment Kobe, Inc."},{"name":"Dark Rift","year":1997,"developer":"Kronos Digital Entertainment","url":":Dark Rift (USA)","filesize":7627934,"score":5.9,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p>The cosmos is controlled by two Prime Elements, known as \"Core\" and \"Dark\". Each is possessed by a tyrant who is in perpetual search of the third element, the Light, which would grant its owner tremendous power. Sonork Nezom, the carrier of Core Element, has organized a fighting tournament, with Core Element itself being the prize. He hopes that the carrier of the Light Element will be among the participants. He plans then to strike and gain possession of all the elements at once. But Lord Demon Demitron, the carrier of the Dark Element, has other plans...</p><p>In this one-on-one fighting game, the player can take any of the eight playable participants through the tournament mode. Once the selected hero has defeated his opponents, he will have to face battles against Sonork and Demitron. A practice mode is also available. During the fights the player can use standard attacks common for all the characters - vertical and horizontal punches, kicks, running jumps, etc. Each character also possesses an arsenal of special techniques, which can be executed by pressing different buttons in rapid succession.</p>"},{"name":"Deadly Arts","year":1998,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":":Deadly Arts (USA)","filesize":8854053,"score":5.9,"genres":"Action > 3rd-person (Other) > Side view > Fighting > Martial arts","desc":"<p>In <em>Deadly Arts</em> the player can fight as a range of characters from around the globe in training, one-on-one and tournament modes. The goal for the player is to defeat each fighter, to progress through the ranks until everyone has been beaten. Each fighter has a set of basic moves and special moves to use.</p><p>Along with two-player options, it is also possible to create a new fighter and train him or her up to the elite level.</p>"},{"name":"Derby Stallion 64","year":2001,"developer":"ParityBit"},{"name":"Destruction Derby 64","year":1999,"developer":"Looking Glass Studios, Inc.","url":":Destruction Derby 64 (USA)","filesize":10322327,"score":6.5,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Vehicular combat","desc":"<p>Much like other Destruction Derby titles, the aim of the game is to race through to the finish, while taking out the other cars for points and not crashing out yourself. </p><p>In this addition, up to 4 players can play, with options including a straight out Derby, Capture the Flag, arena battles and much more. </p><p>There are 12 single player tracks to go through, and plenty of cars to use, including a taxi car (which you must complete the game to unlock).</p>"},{"name":"Dezaemon 3D","year":1998,"developer":"Athena Co., Ltd."},{"name":"Diddy Kong Racing","year":1997,"developer":"Rare Limited","url":":Diddy Kong Racing (USA) (En,Fr) (Rev 1)","filesize":10288521,"score":8.2,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p>It's an island takeover when the evil space wizard, Wizpig, discovers Tiger Island! After the islands prized racetracks become sealed up, Timber Tiger contacts his friend Diddy Kong to help him reclaim the racetracks and save the island before his parents return. Along for the ride are the Kremling spy Krunch, Bumper Badger, Banjo (prior to meeting Kazooie in Banjo-Kazooie), pre-sweary Conker, Tiptup Turtle, and Pipsy Mouse.</p><p><em>Diddy Kong Racing</em> is a racing game with similarities to Mario Kart 64, in that you race with a variety of cheery racers while using weapons. However, the similarities end there. DKR includes an adventure mode, which features bosses, an overworld to explore, <strong>many</strong> hidden secrets, the addition of hovercrafts and planes, and a unique way of racing called the \"Silver Coin Challenge\". In this mode, in addition to coming first, you must also find the eight Silver Coins deviously hidden throughout the courses (some in alternate paths).</p><p>The game also features a strategic method of using weapons. Each colored balloon on the track matches a specific weapon, and collecting the same type of balloon multiple times in a row powers it up (to a maximum of three times). This gives the player the choice of snatching every balloon available and using it immediately, or storing the existing weapon, and using a more powerful version of it later.</p><p>Up to four players can compete in the races, but in order to play new tracks, they must first be unlocked in the single player game. There are also four battle modes of play - two standard deathmatch maps, a capture-the-flag style battle where you must nab eggs and hatch three of them in your home nest, and another where you must be the first to return ten bananas to your treasure chest (with the limitation of only being able to hold two at any one time).</p>"},{"name":"Disney Pixar A Bug's Life","year":1999,"developer":"Traveller's Tales (UK) Ltd."},{"name":"Disney Pixar Toy Story 2: Buzz Lightyear to the Rescue!","year":1999,"developer":"Traveller's Tales (UK) Ltd.","url":":Disney Pixar Toy Story 2 - Buzz Lightyear to the Rescue! (USA) (Rev 1)","filesize":10047259,"score":6.6,"genres":"Action > 1st-person > 3rd-person (Other) > Behind view > Cinematic camera > Real-time > Platform > Direct control > Contemporary > Licensed","desc":"<p>Woody has been stolen from the bedroom, ready to be sold to the highest bidder by an evil toy collector. It's up to good friend Buzz Lightyear to fight his way through from the bedroom to the outside world in order to save Woody from the toy market and bring him home.</p><p>All of the characters from the 3D animated movie appear through-out this 3D platform game to help Buzz get to where he is needed. Along with the use of his cannon, Buzz can jump to hard to reach places, also useful in collecting the hidden coins that open bonus levels.</p>"},{"name":"Disney's Donald Duck: Goin' Quackers","year":2000,"developer":"Ubi Soft SARL","url":":Donald Duck - Goin' Quackers (USA) (En,Fr,De,Es,It)","filesize":11803262,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>You play as Donald in this 3d platform action game.  Donald's girlfriend, Daisy is a reporter for a television station in Duckberg.  While doing a story on the secret temple of Merlock, a terrible magician, Daisy is kidnapped.  Now, it is up to Donald to get her back.  Along the way he will have help from his nephews, Huey, Dewey, and Louie, and the inventor Gyro Gearloose.  He will also have competition from Gladstone Gander, who is also trying to save Daisy.</p><p>Game play alternates between side-scrolling running and jumping and 3d running and jumping. The side scrolling levels play a lot like the Super Mario Bros. games.  The 3d levels play a lot like the Crash Bandicoot series of games.  All in all, there are 20 levels, spread out through areas.</p>"},{"name":"Disney's Tarzan","year":2000,"developer":"Eurocom Developments Ltd","url":":Disney's Tarzan (USA)","filesize":14749304,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Licensed","desc":"<p>We could call it a platform game if it wasn't 3D, but it still looks like a platform game. Much alike to \"Lion King\" only seeable made of polygons. This little arcade game puts you in a role of Tarzan, a soon-to-be king of the jungle, leads you to a bunch of quest levels where you can collect coins, map pieces, 'TARZAN' letters and other stuff, as well as call your monkey friend from time to time that'll give you a brief explanation of things flyin' around. After each completed level, there will be a brief animations that they've probably taken from Disney's cartoon.</p>"},{"name":"Dobutsu no Mori","year":2001,"developer":"Nintendo EAD","url":":Doubutsu no Mori (Japan)","filesize":11344425,"score":"","genres":"Simulation > Diagonal-down > Persistent > Life / social simulation","desc":"<p>In <em>Dōbutsu no Mori</em>, the player arrives at a new town, which they name, and play as a singular character whose name they also choose. The game has no set goal; instead, it is more of a The Sims type of game, in which the player can do what they want, when they want, without rules, goals or time limit.</p><p>When the player first arrives, they will be given a house to live in. Unfortunately, they have no money, so they must pay off their home loan by earning \"bells\", the game's form of currency. Bells can be earned by performing various tasks for the other citizens of the town, catching and selling fish and insects, selling items, finding money in trees, and more. In addition to paying off the loan, money can be used to buy furniture and clothing. The player's home can see further expansions once the loan is paid.</p><p>One of the other main features of the game is the multitude of literally colorful characters that populate the town, all of whom are anthropomorphic animals; the player is the only human in sight. The town starts with a randomized selection of animal villagers, and more can move in and out as the game progresses. The player is able to talk to and befriend their animal neighbors.</p><p>The game uses an internal clock in the game pak to keep track of the date and time. Season changes and special holidays will occur in the town as time passes.</p>"},{"name":"Donkey Kong 64","year":1999,"developer":"Rare Limited","url":":Donkey Kong 64 (USA)","filesize":27706041,"score":8,"genres":"Action > Behind view > Platform > Puzzle elements > Fantasy","desc":"<p><em>Donkey Kong 64</em> is similar to Rareware's other Nintendo 64 platformer series, Banjo Kazooie, but starring Donkey Kong and his friends from the Donkey Kong Country games. Several new features have been added to the game, like being able to change between different characters with different weapons and abilities.</p><p>As with many platformer games players will run around the various levels, jumping, swimming, and climbing where needed. Each level has multiple objectives, such as collecting DK's stolen golden bananas, collecting bananas color coded to each of the five characters, and miscellaneous other objects that need to be found to eventually complete 100% of the game. The player starts only being able to choose Donkey Kong, and must rescue the other four characters from the early levels before they can be used. By visiting Cranky Kong in each level more moves can be learned for each character, allowing them to complete challenges and reach sections in levels that were previously inaccessible.</p>"},{"name":"Donkey Kong 64 Set","year":1999,"developer":""},{"name":"Doom 64","year":1997,"developer":"Midway Home Entertainment, Inc.","url":":Doom 64 (USA) (Rev 1)","filesize":7317583,"score":7.9,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Horror > Regional differences","desc":"<p><em>DOOM 64</em> picks up where all the other DOOM games left off. After tearing through space, hell, and wherever else in the previous games, the Space Marine thought that the threat of the demons was finally past. Of course, one survived, and it is currently reanimating all of the fallen monsters in a last-ditch attempt to revitalize their evil mission. The player's task is to finally rid the universe of all the crazy hellions, from the dead guy with the pistol to the rocket-spewing Cyberdemon.</p><p>The game is very different from the original DOOM; it has entirely new sprites for the monsters, new textures, pseudo-3D effects (such as bridges), colored lighting, scrolling skies, and custom scripting which allows for effects such as morphing environments and spawning items. The levels are completely new. There are 32 levels in total, including several challenging \"fun levels\" which cannot be accessed in normal gameplay. </p><p>The enemy roster is similar to Doom II. Though several enemies from <em>Doom II</em> are not included, a new monster has been added: the \"nightmare imp\", which moves and attacks twice as fast as a regular imp. The end boss of the game is also new. The game features a new weapon, the Unmaker, which can be upgraded with \"demon keys\" found in secret levels. </p><p>The atmosphere of the game is even more grim than the original <em>Doom</em> games, in part due to the new soundtrack: instead of rockin' metal tunes, the music consists of creepy ambient sounds and drones. </p><p>The 2020 re-release adds seven new levels, including a six-level episode \"The Lost Levels\".</p>"},{"name":"Doraemon: Nobita to 3-tsu no Seireiseki","year":1997,"developer":"Epoch Co., Ltd."},{"name":"Dr. Mario 64","year":2001,"developer":"Newcom Co., Ltd.","url":":Dr. Mario 64 (USA)","filesize":3045570,"score":6.6,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Falling block puzzle > Tile matching puzzle > Direct control > Healthcare","desc":"<p>What does Mario do in his spare time? Kill viruses of course. <em>Dr. Mario 64</em> continues the Tetris style gameplay from the previous versions, as well as adding a 4 player mode.</p>"},{"name":"Dragon Sword 64","year":1997,"developer":"Interactive Studios Ltd.","url":":Dragon Sword 64 (USA)","filesize":9721785,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Fantasy","desc":"<p><em>Dragon Sword</em> is an action game without a story. The player has to keep moving forward and defeat the enemies they encounter. Players can use a longsword and fire magic. <em>Dragon Sword</em> is the earliest release of the games that would later shape the Yan Loong Legend series.</p>"},{"name":"Dual Heroes","year":1997,"developer":"Produce Co., Ltd.","url":":Dual Heroes (USA)","filesize":8057708,"score":4.9,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Fantasy > Sci-fi / futuristic","desc":"<p>Battle to be the ultimate hero against as one of eight fighters, each with unique fighting style.</p><p>Train a robot with your style for use against the opposing fighters in Robot Mode, or select five virtual enemies who will train a fighter and become your rival. Single and 2 player multiplayer options included.</p>"},{"name":"Duke Nukem 64","year":1997,"developer":"3D Realms Entertainment, Inc.","url":":Duke Nukem 64 (USA)","filesize":7479219,"score":7.4,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Adult > Comedy","desc":"<p>Duke Nukem 3D makes its way to the N64 for the first time, with plenty of new additions:</p><p>Weapons: New weapons include two sub-machine guns (one in each hand), the Expander (the bad guys just go pop!) a plasma cannon (which is chargeable) and a grenade launcher. Sadly, there are a few missing from the original PC version, including the Ripper Chaingun, the Devastator, and the Freeze-Ray.</p><p>Presentation: The biggest changes come here, as there are new areas to explore, some improved environments, and the same wise cracks that have made Duke famous. There are also some jokes hidden away based on classic movies (Clockwork Orange, 12 Monkeys, Mars Attacks and Apocalypse Now).</p><p>However, there have been plenty of restrictions in this version of Duke 3D. Nintendo have replaced some areas (the porn mag shop has turned into a gun store, the bar is now a burger joint, and the nude women aren't nude anymore), and there is an option available to turn the blood off.</p><p>A 4 player mode has also been included, where you can take on your mates as well as Duke Bots, and a 2 player co-op mode, so two players can tackle the single player missions.</p>"},{"name":"Duke Nukem: Zero Hour","year":1999,"developer":"Eurocom Developments Ltd","url":":Duke Nukem - Zero Hour (USA)","filesize":24968268,"score":7.6,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Post-apocalyptic > Sci-fi / futuristic > Comedy","desc":"<p><em>Duke Nukem</em> starts his second third-person-adventure, after Duke Nukem: Time to Kill for Playstation, he now kicks alien asses on the Nintendo 64.</p><p>Similar to the movie Terminator, the aliens want to take over the world before Duke was even born and travel through time. Duke follows them and tries to stop their evil plan, chasing them through the wild west, the dark ages, victiorian London and finally the post apocalyptic world of the future.</p>"}]