[{"name":"Earthworm Jim 3D","year":1999,"developer":"VIS Entertainment Limited","url":"0#Earthworm%20Jim%203D%20%28USA%29.zip","filesize":11264096,"score":6.7,"genres":"Action > Behind view > Direct control > Fantasy > Comedy","desc":"<p>Earthworm Jim gets squashed by a cow, leaving him dazed and confused. In the aftermath, his marbles go missing, so he must travel into his brain to find them and put everything right again. The gameplay is similar to that of the previous titles but takes place in a 3D environment.</p>"},{"name":"ECW Hardcore Revolution","year":2000,"developer":"Acclaim Studios Salt Lake City","url":"0#ECW%20Hardcore%20Revolution%20%28USA%29.zip","filesize":31738365,"score":5.7,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>ECW Hardcore Revolution</em> is a wrestling title developed by Acclaim based on the wrestling promotion Extreme Championship Wrestling. Players can use up to 33 ECW wrestlers including Rob Van Dam, Tazz, Sandman, and many others.</p><p>The game itself runs on a modified WWF Attitude engine and includes several game modes including Tag Matches, Death Match, Barbed Wire Ring Match, and others. Up to 4 players can play simultaneously.</p>"},{"name":"Excitebike 64","year":2000,"developer":"Left Field Productions, Inc.","url":"0#Excitebike%2064%20%28USA%29%20%28Rev%201%29.zip","filesize":15746694,"score":8,"genres":"Racing / Driving > 3rd-person (Other) > Behind view > Motorcycle > Off-roading > Track racing > Vehicle simulator","desc":"<p><em>Excitebike 64</em> is an update to the original Excitebike, for the NES. The outrageous jumps and precision timing required in the original have been translated into a modern 3D racing game.</p><p>There are several game modes to choose from. First, there is a season mode with multiple skill levels. Completing a 5-race season in first place unlocks special tracks and more difficult classes. Second, there is a exhibition mode which allows you and up to 3 other people to choose a single track to race on. Third, there is a time trial mode in which you try to get the best times on the 20 tracks.</p><p>Finally, there are multiple special tracks. Some of the special tracks include a point-to-point race through the desert, a hill-climb competition, motocross soccer, and a pixel-perfect conversion of the original <em>Excitebike</em>. <em>Excitebike 64</em> also includes a track editor for building your own competitions.</p>"},{"name":"Extreme-G","year":1997,"developer":"Probe Entertainment Ltd.","url":"0#Extreme-G%20%28USA%29.zip","filesize":7989209,"score":7.7,"genres":"Action > Racing / Driving > 1st-person > Behind view > Direct control > Sci-fi / futuristic","desc":"<p>Blazingly fast futuristic motor cycle racing. Blast your opponents off the track with laser cannons, homing missiles and an assortment of other weapons, such as mines, bombs and tripwires - all at 300 MPH. Includes championship and multiplayer modes, with a tournament mode for 16 players, over a host of tracks set in four different worlds.</p>"},{"name":"Extreme-G: XG2","year":1998,"developer":"Probe Entertainment Ltd.","url":"0#Extreme-G%20XG2%20%28USA%29.zip","filesize":12006677,"score":6.7,"genres":"Racing / Driving > 1st-person > Behind view > Shooter > Sci-fi / futuristic","desc":"<p>In this second installment of Extreme-G, you once again will race with and against the incredible capabilities of G-bikes (they closely resemble of the ones in <em>Tron</em>)through several surreal, twisting tracks. Be hell on wheels blasting your challengerswith an arsenal of vicious weapons and even break the sound barrier!</p><p>The game is expanded on its predecessor by many ways; however, while being convertedfrom the original N64 version for the PC, it loses some of its features like themultiplayer support (and its enhanced multiplayer options).</p>"}]