[{"name":"F-1 World Grand Prix","year":1998,"developer":"Paradigm Entertainment Inc.","url":"0#F-1%20World%20Grand%20Prix%20%28USA%29.zip","filesize":9430342,"score":7.8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>The 1997 Formula One World Championship, won by Canadian Jacques Villeneuve in dramatic fashion after a final-race collision with Germany's Michael Schumacher, is recreated in this racing simulation. You have the chance to set up the car to perfect the handling for each of the 17 diverse circuits. Wet racing is incorporated, with gradual weather chances, as well as tyre wear requiring pitstops.</p><p>In total there are five distinct gameplay modes. A solo player can play through the entire championship, with practice and qualifying as well as the race against 21 other cars. A Challenge mode including key situations allows you to try to alter the course of history. There is also a 2-player head-to-head mode, Time Attack and one-off races of any length.</p>"},{"name":"F-1 World Grand Prix II","year":1999,"developer":"Paradigm Entertainment Inc.","url":"0#F-1%20World%20Grand%20Prix%20II%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":9833963,"score":7.7,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>The second F1 experience from Paradigm, the direct sequel to F-1 World Grand Prix, has more of the same high speed antics around the Formula 1 circuit.</p><p>Following the 1998 season, you'll experience all the drivers, tracks and teams and compete in a number of different racing modes, from the usual Grand Prix and Training to Challenge mode, where you'll attempt to complete a range of critical events based on the deal.</p>"},{"name":"F-Zero X","year":1998,"developer":"Nintendo EAD","url":"0#F-Zero%20X%20%28USA%29.zip","filesize":12945812,"score":8.1,"genres":"Racing / Driving > Behind view > Anime / Manga > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p>Famed SNES racer F-Zero gets a 64-bit update. Gameplay remains essentially unchanged, race in a futuristic racing tournament on tracks levitated miles up in the air, against a selection of devious opponents.</p><p>While the original had 4 cars to choose from and race against, F-Zero X has no fewer than 30 vehicles all with their own unique strengths and weaknesses, a choice of colours, and customisable power/acceleration ratios for each track. At the beginning you are limited to choosing from 6 cars and 3 tournaments (each featuring 6 tracks each), but in true Nintendo fashion, more cars and tracks are unlocked as you progress through the game. As well as the cups, you can also race in time trial mode, against a 'ghost car' recording of your best previous lap, a lá Mario Kart 64.</p><p>Gone are the entirely flat tracks of the original, having been replaced with tracks that twist, turn, loop, rotate and basically contort into the most crazy shapes you could imagine. One unique feature amongst almost all other racing games is the \"X\" tournament, where courses are totally randomly generated each time you start.</p><p>One of the most important changes to the format is the inclusion of multiplayer support for up to 4 players. The various combat moves are especially important against aggressive human play.</p>"},{"name":"F1 Pole Position 64","year":1997,"developer":"Human Entertainment, Inc.","url":"0#F1%20Pole%20Position%2064%20%28USA%29%20%28En%2CFr%2CDe%29.zip","filesize":6163515,"score":6.3,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>A Formula 1 racing game, officially acknowledged by the FIA F1 World Championship, containing the 16 World championship circuits of the day, ranging from Monza and the old Hockenheim to Monaco and the Hungaroring. </p><p>Car setup is highly detailed, reflecting real Formula One and the game's simulation basis. You will have to race in the wet, which means further setup modification to cope with the reduced grip. You can also edit the level of car damage, the pit-car radio, and whether the CPU cars can collide. There are also Battle and Time Trial modes, with your best laptimes recorded.</p>"},{"name":"F1 Racing Championship","year":2000,"developer":"Ubisoft Paris Studios SARL","url":"0#F1%20Racing%20Championship%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":14354291,"score":7.9,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Automobile > Track racing > Licensed","desc":"<p><em>F1 Racing Championship</em> is the third Ubi Soft F1 racing simulation game, published with the FIA license by Video System. It features official tracks, drivers and cars of the 1999 F1 season.</p><p>The game is based on a new engine bringing a real technological step compared to the two first titles (F1 Racing Simulation and Monaco Grand Prix Racing Simulation 2).</p><p>Available game modes are Single Race, Grand Prix, Championship, Private Trials and Time Attack. The tracks were modelled in 3D from GPS data sampled on the real roads. There are realistic physics, a telemetry system to analyse behaviour of your car and to tune its settings, complex driving AI, recordable replays, strategy management with animated pit sequences, weather simulation, and LAN support for multiplayer games.</p>"},{"name":"Famista 64","year":1997,"developer":"Namco Limited"},{"name":"FIFA 99","year":1998,"developer":"Electronic Arts Canada","url":"0#FIFA%2099%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CPt%2CSv%29.zip","filesize":14062054,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>This was the third <em>FIFA</em> title in a little over a year. It incorporates 42 national sides, as well as 250 club teams from 12 different leagues, to play a complete true-to-life season, the preset Super League, or a league or cup of your own design. Formations and tactics can be set, and players can be moved between teams. </p><p>Gameplay can be viewed from multiple angles. Players have more animation than ever before, with new moves including sliding challenges and close-control trapping. Goalkeepers now have a level of human control.</p>"},{"name":"FIFA Soccer 64","year":1997,"developer":"Extended Play Productions","url":"0#FIFA%20Soccer%2064%20%28USA%29%20%28En%2CFr%2CDe%29.zip","filesize":6543395,"score":5.9,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>The FIFA series introduces itself to the Nintendo 64, with all the football/soccer action one can expect from an EA Sports title. Choose your team, whether it be Manchester Utd or Real Madrid, or even a lowly ranked team, and take them through the ranks of the professional sport right up to the crowned kings of their tournament. You can stick with the local leagues (five in all) or take your team onto the International circuit and compete against every team available.</p><p><em>FIFA Soccer 64</em> can be played by up to 4 players at a time.</p>"},{"name":"FIFA: Road to World Cup 98","year":1997,"developer":"Electronic Arts Canada","url":"0#FIFA%20-%20Road%20to%20World%20Cup%2098%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":10417445,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>The late-1997 edition of <em>FIFA</em> was heavily tied in with the qualifying procedure for the 1998 World Cup. In the <em>Road to the World Cup</em> mode, you take a team from first qualification through to the main tournament, using the varying systems in different parts of the world. The game features 16 distinct outdoor stadia. The League play features 189 clubs and 11 leagues. Each team has specific crowd chants incorporated into the ambient sound.</p><p>The action is faster than in previous versions, and AI has been expanded. Players have distinct facial feature and hair styles. Each match is introduced by Des Lynam and commentated on by John Motson and former Scotland international Andy Gray.</p>"},{"name":"Fighter Destiny 2","year":1999,"developer":"Opus Corp.","url":"0#Fighter%20Destiny%202%20%28USA%29.zip","filesize":11710579,"score":6.3,"genres":"Action > Fighting > Martial arts","desc":"<p>The sequel to Fighters Destiny (the title now without the s in 'Fighters') has you again taking your created fighter up the ranks by competing in a number of challenging 1 on 1 battles.</p><p>As with the first title, the aim is to hit a number of targets on the opposition's body to gain points, as well as knockouts, ring-outs, time expiry and so forth. In total there are over 30 moves to be used. The winner is the one with the most points at the end, which will not necessarily be the one with the most energy left.</p>"},{"name":"Fighters Destiny","year":1998,"developer":"Genki Co., Ltd.","url":"0#Fighters%20Destiny%20%28USA%29.zip","filesize":8933309,"score":7.3,"genres":"Action > Side view > Fighting > Martial arts","desc":"<p>Take a collection of fist-fighters, wrestlers and martial arts experts, and combine them into one tournament. But instead of relying on simply depleting the health bar, you must win points depending on how you defeat an opponent (for example, ring-outs are 1 point, special moves 4 points and countering a special move is 2 points). </p><p>Game modes include the standard VS. mode, simply defeat everyone you see. VS. Battle allows you to defeat the enemy, then acquire their moves for the next round. The Master Challenge has you spinning a wheel to determine who you fight. Spin up a Master, and you get a tough challenge in which you can win new moves. Spin a Joker, and you simply have a challenge, with nothing to gain, but everything to lose.</p>"},{"name":"Fighting Force 64","year":1999,"developer":"Core Design Ltd.","url":"0#Fighting%20Force%2064%20%28USA%29.zip","filesize":10290057,"score":6.5,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler","desc":"<p><em>Fighting Force</em> is a 3D fighting \"beat-em-up\" in which the player can choose to control one of the four available characters. Each of the characters has his or her own advantages and weaknesses (e.g. superior strength but slow movement), and each possesses a powerful special move that depletes their health. Besides fists, they can use objects such as chairs, trash cans, and car tires, and weapons such as knives to fight the minions of the evil criminal mastermind Dr. Zeng who aspires to control the city.</p>"},{"name":"Flappy Bird","year":2017,"developer":""},{"name":"Flying Dragon","year":1997,"developer":"Culture Brain Inc.","url":"0#Flying%20Dragon%20%28USA%29.zip","filesize":9325325,"score":6.4,"genres":"Action > 3rd-person (Other) > Fighting > Martial arts","desc":"<p><em>Flying Dragon</em> is a side-view battle game reminiscent of 16-bit titles. It features eight characters to choose from with two main modes of play, \"SD\" (super deformed) and \"Virtual\" (ala 'Virtua Fighter' style).</p><p>SD mode is sort of RPG'ish with treasures you gain from winning battles and becoming a stronger fighter. it has the usual circuit, tournament and practice modes plus a 'treasure box' where you check your existing items, buy new items or trade items you already have for something else.</p><p>Virtual mode is the more familiar format of a battle game with game modes such as circuit, tournament and practice. It also has 2D and 3D \"rules\" for how the game is played. 2D is 16-bit arcade style and 3D is more realistic.</p>"},{"name":"Forsaken 64","year":1998,"developer":"Iguana UK","url":"0#Forsaken%2064%20%28USA%29.zip","filesize":7006069,"score":7.6,"genres":"Action > 1st-person > Shooter > Direct control > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Forsaken is a 3D first-person shooter in the style of Descent (1995), featuring similar weapons, power-ups, having missiles and mines being labeled \"secondary weapons\", and involving 3D movement of a vehicle through several tunnels. It is set on a futuristic Earth that, in 2113, had all of its life destroyed as a result of a shockwave from a science accident. The goal of the game differs between formats.</p>"},{"name":"Fox Sports College Hoops '99","year":1998,"developer":"Z-Axis, Ltd.","url":"0#Fox%20Sports%20College%20Hoops%20%2799%20%28USA%29.zip","filesize":9805259,"score":5.5,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>Fox Sports College Hoops '99</em> features 120 authentic NCAA teams and their respective logos including all the major conferences at the time and preseason and conference tournaments and updated rosters for that season. It also had the obligatory game modes: <em>Exhibition</em>, <em>Season</em> and <em>Tournament</em> including the ability to skip ahead and compete in the <em>Sweet 16</em> or the <em>Final Four</em>.</p><p>The gameplay is geared towards the style of Courtside with a TV style presentation in association with Fox Sport. It also has three different skill levels along with multiple camera angles and stat tracking throughout an entire season. Classic teams are also available to be played and the ability to customize lineups to their liking. Friends can also go head-to-head in multiplayer mode.</p>"},{"name":"Frogger 2: Swampy's Revenge","year":2000,"developer":"Blitz Games Ltd","url":"0#Frogger%202%20%28USA%29%20%28Proto%202%29.zip","filesize":3182854,"score":6.6,"genres":"Action > 3rd-person (Other) > Platform","desc":"<p>The sequel to the Original classic (and the so-so 1997 release) changes the way you look at frogs! The stage is set for a totally new adventure where Frogger and his female friend Lillie Frog will need to leap over, dive under, hop through and climb above endless new obstacles and challenges to save the Frog Babies from Frogger's new arch enemy, the dastardly Swampy the Crocodile.</p>"},{"name":"Fushigi no Dungeon: Fūrai no Shiren 2: Oni Shūrai! Shiren-jō!","year":2000,"developer":"Chunsoft Co., Ltd."}]