[{"name":"Gauntlet: Legends","year":1999,"developer":"Atari Games Corporation","url":":Gauntlet Legends (USA)","filesize":14677723,"score":6.9,"genres":"Action > Diagonal-down > Isometric > Arcade > Puzzle elements > Fantasy > Licensed","desc":"<p>As many as four (Expansion Pak required) can band together in an epic quest through seven magical worlds -- three of which are brand-new to the home version -- to defeat the vile Skorne. </p><p>The nonlinear action begins in a hub, which leads to the worlds, each with two to five levels. You can complete a level in one world, then move to another world, returning later to finish a new level in the first world. </p><p>Developer Atari Games has delivered four new characters in addition to the four in the arcade version. Each character will have unique special attacks. Controller Pak support will allow players to team their evolving characters. </p><p>Enemies, bosses, power-ups, music and sound effects are all getting radical makeovers. Atari is busily remapping carryover levels and cooking up devious new puzzles and hiding places for items, so don't even think of cribbing from the coin-op version. </p><p>Graphical updates include real-time lighting, which is nowhere to be found in the arcade version. The N64 Expansion Pak pushes plenty of polygon-based enemies onto the screen. </p><p>The essential action -- team up with others, find keys, magic, runes and other items, and beat the stuffing out of anyone in your way -- remains unchanged from the arcade hit. Atari has delivered a far meatier storyline, though, spiffed up by cinema cut-scenes at the successful conclusion of a world.</p>"},{"name":"Getter Love!! Panda Love Unit","year":1998,"developer":"Hudson Soft Company, Ltd."},{"name":"Gex 3: Deep Cover Gecko","year":1999,"developer":"Crystal Dynamics, Inc.","url":":Gex 3 - Deep Cover Gecko (USA)","filesize":26563786,"score":7.3,"genres":"Action > 1st-person > 3rd-person (Other) > Platform > Puzzle elements","desc":"<p>Gex must rescue Agent Xtra from the grips of the fiend, Rez. Gex goes undercover through many levels to try to find Agent Xtra. Each level parodies a certain aspect of television culture. Gex enters each level through a television set. He must collect remote controls to advance to the next level.</p>"},{"name":"Gex 64: Enter the Gecko","year":1998,"developer":"Crystal Dynamics, Inc.","url":":Gex 64 - Enter the Gecko (USA)","filesize":15224126,"score":7.5,"genres":"Action > Behind view > Platform > Direct control > Fantasy > Regional differences","desc":"<p><em>Gex 3D: Enter the Gecko</em> is a 3D platform game where the player controls a gecko who has to navigate several levels, all of which are parodies on well-known TV shows and movies, such as Looney Tunes, Gilligan's Island, or Friday the 13th.</p><p>Rez, the evil overlord of the television is back into the Media Dimension, and the government asks the TV addict gecko, Gex, to defeat him once again. He gets a lot of money and an agent suit for that. The game generally resolves around a James Bondish spy theme, but the story is not referenced later in the game.</p><p>Gex has to enter levels through TVs to collect three types of remote controls in order to unlock more of the Media Dimension, boss levels and secret TVs. Gex can tailwhip or karate-kick his enemies, climb certain walls and ceilings, eat bugs for power-ups, and spout one-liner wisecrack jokes. The gameplay is non-linear, the player can choose from multiple routes and goals on each level, and are replayable anytime after accomplished.</p>"},{"name":"Glover","year":1998,"developer":"Interactive Studios Ltd.","url":":Glover (USA)","filesize":5857224,"score":6.8,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements","desc":"<p>A wizard is mixing up a batch of magic potions, when an explosion sends the gloves off his hands flying into the air. One lands safetly outside the castle, but the other lands in an evil potion mixture. It's this evil glove that decides to take over the castle. Meanwhile, 7 crystals, which used to sit on top of the castle and gave the surrounding lands its life force, also fly off in all directions. Thankfully, though, the good Glove changes the crystals into rubber balls, so that they would land safely. </p><p>You must control the good glove (name Glover) and find the 7 crystals, putting them back into the castle to restore the life back into the land. But be careful, the bad glove is out to stop you and take the kingdom, and the wizards power, for his own.</p>"},{"name":"Glover 2","year":1998,"developer":"Interactive Studios Ltd.","url":":Glover 2 (USA)","filesize":18247008,"score":3.35,"genres":"Plattformer","desc":"<p>Hasbro Interactive had planned to release a sequel to Glover which had a boxing glove character and was to be released in 2000 named Glover 2 but the idea was scrapped, though gameplay videos and pictures about the game surfaced on nesworld.com, which discovered a work-in-progress version of the game. Just when you thought it was safe to go back... Unique glove & ball gameplay. Real world dynamics. Full environmental interaction. Progressive intergrated plot. Amusing original characters. Fun multiplayer game.</p>"},{"name":"Goemon: Mononoke Sugoroku","year":1999,"developer":"Konami Computer Entertainment Kobe, Inc."},{"name":"Goemon's Great Adventure","year":1998,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":":Goemon's Great Adventure (USA)","filesize":14712659,"score":7.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Puzzle elements","desc":"<p>Goemon and his friends return in this side-scrolling sequel to Mystical Ninja Starring Goemon. Bismaru, who looks like Goemon's friend Ebisumaru dressed up as a nun, has swiped a freshly-invented Ghost Returning Machine! With it, he's using planning nothing less than world domination. All Ebisumaru wanted to do with it was meet his ancestor, James Dean! Help Goemon and his friends retrieve the Machine, and bust some ghosts on the way.</p><p><em>Mystical Ninja 2</em> reverts back to the traditional side-scrolling 2D platforming style of the SNES games. However, due to to the Nintendo 64's 3D capabilities, you'll encounter massive bosses and detailed worlds as you make your way through Japan. To attack, you can either hurl coins, or use each character's specific weapon, such as Goemon's trademark pipe. Two players can also play simultaneously and work together to beat foes, and you can even ride piggy-back onto your friend.</p><p>There are also towns to explore, where you chat with villagers and explore various shops and houses for information and clues. Goemon Impact, the giant singing robot wearing rollerskates, also makes a return as you battle enemy mechs from inside its cockpit in a first-person view.</p>"},{"name":"Golden Nugget 64","year":1998,"developer":"Westwood Pacific","url":":Golden Nugget 64 (USA)","filesize":5977748,"score":6.5,"genres":"Gambling > 1st-person > Top-down > Real-time > Board game > Cards / tiles > Licensed","desc":"<p>Real-time 3D casino play on the Nintendo 64, set inside the famous Golden Nugget casino in Las Vegas.</p><p>Features include a fast and simple interface, 15 classic games of chance and 4-player simultaneous play. </p><p>Try your hand at Black Jack, Craps, 5-Card Draw, 7-Card Stud, Texas Hold 'em, Mini Baccarat, Big Six, Roulette, Video Poker, and an array Slot Machines.</p>"},{"name":"GT 64: Championship Edition","year":1998,"developer":"Media Design & Art, Ltd.","url":":GT 64 - Championship Edition (USA)","filesize":4483016,"score":6.4,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Licensed","desc":"<p><em>GT 64</em>, short for Grand Tour 64, is a 3D racing game for the Nintendo 64. It features cars and drivers from the All-Japan GT Championship season of 1997 as it is an officially licensed game.</p><p>There are three stages with each a long and a short version counting six tracks in total situated in Japan, the USA and Europe, all located in urban settings. You can opt to race three, six, twelve or 24 laps on each track. There are fourteen cars available to race in and they can be manually tweaked to improve performance.</p><p>The Japanese re-release of the game includes two new tracks based on the 1998 season.</p>"}]