[{"name":"Harukanaru Augusta Masters '98","year":1997,"developer":"T&E Soft, Inc."},{"name":"Harvest Moon 64","year":1999,"developer":"Pack-In-Video Co., Ltd","url":"0#Harvest%20Moon%2064%20%28USA%29.zip","filesize":6580984,"score":7.6,"genres":"Simulation > Diagonal-down > Isometric > Managerial / business simulation","desc":"<p>In <em>Harvest Moon 64</em>, your objective is to restore a run-down farm that you've inherited from your grandfather, who has died recently. In the village many people help you out on your long journey. During this time you can attend festivals, race in horse races, farm, tend to your livestock, add to your house, get married, or maybe even have a child. There are 5 beautiful women to be chosen from, each having their own jobs and personalities. At the end the player's parents come by and rate them after 2 and a half years of performance. The option then exists either to keep going or stop there. The real question is if you're up for the challenge.</p>"},{"name":"Hercules: The Legendary Journeys","year":2000,"developer":"Player 1","url":"0#Hercules%20-%20The%20Legendary%20Journeys%20%28USA%29.zip","filesize":15260239,"score":5.9,"genres":"Action > Behind view > Puzzle elements > Fantasy > Licensed","desc":"<p>Ares, Hercules' brother, forms a plan to dethrone Zeus with the help of Hera. Zeus mysteriously disappears, and a struggle for power corrupts the immortal realm. The Gods, unaware of the true nature of the disturbance, flee to the mortal realm in a search to find the reason for the turmoil.</p><p>Hercules, a man whose strength is like nothing ever seen, is the only one who can save the world, both mortal and immortal, and his father from certain doom.</p><p>Take control of the legendary hero as you travel around the land in search of Zeus, and to stop Ares from completing his plan. Based on the TV series of the same name, you can also take control of fellow heroes Iolaus and Serena, each with abilities that aid Hercules' task.</p>"},{"name":"Hexen","year":1997,"developer":"Raven Software Corporation","url":"0#Hexen%20%28USA%29.zip","filesize":7831389,"score":7.4,"genres":"Action > 1st-person > Shooter > Direct control > Fantasy","desc":"<p><em>Hexen</em> is the sequel to Heretic. While the Heretic was destroying D'Sparil, the other two Serpent Riders have come to your dimension and slaughtered everyone. Or so they thought. Three humans have managed to escape with their lives and now seek vengeance against the Serpent Rider Korax who remains in their world.</p><p>Like <em>Heretic</em>, <em>Hexen</em> is a fantasy game based on an enhanced DOOM engine. All of <em>Heretic</em>'s innovations like vertical looking, flying, and the inventory system have been carried over. The new major changes this time around are three characters for the player to choose from and the level hub system. The characters are the Fighter, the Cleric, and the Mage. Each one has four unique weapons and different levels of speed and armor.</p><p>The hub system steps away from the traditional \"single levels stringed along into episodes\" system which had been carried over into the FPS genre from sidescrollers and made popular by Wolfenstein 3D. In <em>Hexen</em>'s hub system each episode is still made up of interconnected levels, but most of the levels are connected to a single \"hub\" level through portals. There are also portals between some of the \"spoke\" levels. Many of the puzzles in <em>Hexen</em> require travel back and forth between different levels.</p><p>Other innovations in <em>Hexen</em> include weather effects, jumping, earth-quakes, and destructible objects such as trees and vases. The game also includes scripted sequences created with a language called ACS, allowing for much more complex puzzles and dramatic scenes.</p>"},{"name":"Hey You, Pikachu!","year":1998,"developer":"Ambrella","url":"0#Hey%20You%2C%20Pikachu%21%20%28USA%29.zip","filesize":9004520,"score":5.6,"genres":"Action > 1st-person > Anime / Manga > Puzzle elements > Licensed","desc":"<p><em>Hey You, Pikachu!</em> is a Pokémon adventure game. The game allows you to speak directly to Pikachu via the Voice Recognition Unit (VRU) included with the game, in order to tell Pikachu what to do and help direct the adventures the two of you embark on.</p><p>The game features 20 different minigames which you and Pikachu play together. Some involve you catching water Pokémon, while another might send you search for ingredients for stew. When the minigame is over, you go back home and sleep, waking up the next day to play another game. As the game progresses more of the features and minigames are unlocked, and Pikachu's friendship meter will grow.</p><p>Pikachu will understand around 200 different words or simple phrases like \"come here\", \"stop that\", and \"eat it\". Voice communication is the primary method of interacting with the game, though the analog stick is used for navigation.</p>"},{"name":"Hot Wheels: Turbo Racing","year":1999,"developer":"Stormfront Studios","url":"0#Hot%20Wheels%20-%20Turbo%20Racing%20%28USA%29.zip","filesize":11333552,"score":6.7,"genres":"Racing / Driving > 1st-person > Behind view > Licensed","desc":"<p>In <em>Hot Wheels: Turbo Racing</em> you can race over 40 classic Hot Wheels cars, some looking sporty and some not. Race through 11 tracks filled with loops and danger chargers.</p><p>Cars and tracks are unlocked as you play, either by winning races or performing stunt flips, side rolls and combos. Two player races can either be pure head-to-head, or also feature the computer cars. The soundtrack is rock-based, including tracks by Metallica and Primus.</p>"},{"name":"Hybrid Heaven","year":1999,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"0#Hybrid%20Heaven%20%28USA%29.zip","filesize":11688606,"score":6.8,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Puzzle elements > Sci-fi / futuristic","desc":"<p>Aliens are trying to take over the US by eventually replacing the President with a clone. To do this, they begin by replacing advisors and Secret Service operatives with clones. One of these clones is scheduled to meet with a collaborator named Diaz in a Manhattan Subway, to get weapons for the Presidential Replacement.</p><p>The clone arrives at the meeting, and sees Diaz with two Men in Black. As the clone approaches, Diaz starts hearing voices, and shoots the clone. He gets taken down an elevator, where, in his struggles to escape the Men in Black, he falls off the elevator. His fall is slowed by the anti-gravity device that powers the elevator, and he begins his journey into the underground facility.</p><p>Gameplay:  </p><p>Two styles of gameplay: Overworld and Battle.</p><p>Overworld:  </p><ul><li>Control Diaz in third person perspective.</li><li>Have a defuser that can only affect robotics, namely the laser-emitting sentries.</li><li>Explore the world, get items, and increase your security card's rank.</li></ul><p>Battle:* Same controls.* Have an energy meter that determines the power of your attack.* Learn new attacks by having them done to you.* Level up individual body parts, as well as attacks.</p>"},{"name":"Hydro Thunder","year":2000,"developer":"Midway Home Entertainment, Inc.","url":"0#Hydro%20Thunder%20%28USA%29.zip","filesize":19659310,"score":7.6,"genres":"Racing / Driving > Behind view > Naval / watercraft > Track racing > Sci-fi / futuristic","desc":"<p>Port of Midway's arcade boat-racer. The premise is non-existent, you simply rev up the engines and go on 13 water courses set in Antarctica, the far east, the Greek isles, etc. on different types of futuristic boats. Races use the usual arcade checkpoint system and scattered across the courses you'll find an assortment of power-ups and upgrades like nitro boosters. </p><p>Graphics are entirely 3D with reflective water effects and realistic bouncing and bucking in the boats. Multiplayer competitions are supported for 2 players on the PlayStation version.</p>"}]