[{"name":"Iggy's Reckin' Balls","year":1998,"developer":"Iguana Entertainment Incorporated","url":"0#Iggy%27s%20Reckin%27%20Balls%20%28USA%29.zip","filesize":3879737,"score":7.2,"genres":"Action > Side view > Platform > Puzzle elements","desc":"<p>It's a race to the top of the tower, as you control a collection of ball like characters up spiral platforms, with the aim to be the first to the very top.</p><p>A whole range of items are on offer to aid your progress, including jumps, grappling hooks, conveyor belts, springs and more. And as well as competing against the other characters, there are also enemy characters that litter the platforms, attempting to stop you from getting to the top.</p>"},{"name":"In-Fisherman Bass Hunter 64","year":1999,"developer":"GearHead Entertainment","url":"0#In-Fisherman%20-%20Bass%20Hunter%2064%20%28USA%29.zip","filesize":3026894,"score":6.6,"genres":"Sports > 3rd-person (Other) > Fishing","desc":"<p><em>In-Fisherman Bass Hunter 64</em> is a bass fishing simulation game for the Nintendo 64. The game offers three playing modes: fish for fun, championship, and Custom Tournament. The first lets you choose a lake and fish there at your leisure. The second adds a competitive element. You pick one of two characters and participate in contests, where you have to catch a certain number of bass within a time limit. You start with simple gear, but every time you end up in the top 3 you gain points with which you can upgrade your gear (rods, boats, bait).</p>"},{"name":"Indiana Jones and the Infernal Machine","year":2000,"developer":"LucasArts Entertainment Company LLC","url":"0#Indiana%20Jones%20and%20the%20Infernal%20Machine%20%28USA%29.zip","filesize":27540076,"score":7.1,"genres":"Action > Behind view > Puzzle elements > Licensed","desc":"<p>The year is 1947. Dr. Jones Jr is on a retirement from adventuring, living the life of a scholar and an archaeologist. But soon he meets his old flame ...and new enemies. Soviets are tracking parts of a mysterious, powerful machine from ancient Babylon, hoping to use it as a weapon. They must be stopped from unleashing unspeakable danger from another world.</p><p>Are you ready to lead Indy into adventures in lost temples, under mountains and through unexplored mines, for tales of missing artifacts, snake encounters and other things?</p><p><em>Indiana Jones and the Infernal Machine</em> combined action and adventure in a way the older Indy games did not do. The gameplay is inspired by Tomb Raider, as Indy moves through 3D representations of 17 locations around the world. The game engine is modified from Jedi Knight.</p><p>Puzzles based around switches &amp; items; precise jumping must be negotiated on regular basis. You must use ladders, ropes and dinghies as well as moving on foot. You will also find yourself aboard a jeep and a mine cart. Replacements for your standard whip can be collected en route (from Soviet army arsenal), including grenades, sub-machine guns and bazookas. The valuable treasures you find can be used to buy extra ammo (between the levels). After each level you get your score (Indy Quotient) - you must reach all the treasure items cleverly hidden in secret places to get all the points.</p>"},{"name":"Indy Racing 2000","year":2000,"developer":"Paradigm Entertainment Inc.","url":"0#Indy%20Racing%202000%20%28USA%29.zip","filesize":10635383,"score":"","genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Indy Racing 2000</em> is an officially licensed product of that year's Indy Racing League. At this point it purely raced on oval tracks, and featuring Indianapolis-style race cars - open wheel, open cockpit.</p><p>All 20 drivers and their cars and teams are authentic with fully licensed IRL tracks including night time tracks at Texas and Charlotte. Two player mode is supported and there is a unique draft meter to aid in making sling-shot moves for passing.</p><p>Top drivers are represented with detailed replicas of their cars. It is a racing simulation rather than a pure action game, letting you choose the angles of the front wing, rear wing, set the tire pressure, gear ratios and transmission type.</p>"},{"name":"International Superstar Soccer '98","year":1998,"developer":"Major A","url":"0#International%20Superstar%20Soccer%20%2798%20%28USA%29.zip","filesize":9347035,"score":8.2,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (European) / Soccer","desc":"<p>ISS returns to the N64 with improvements to the six previous game modes found in ISS64. </p><p>New scenarios and updated player rosters (although not FIFA licensed) are included, along with new stadiums from around the world (including three based on those used in the France World Cup '98), create-a-player options, multiple gaming strategies (offside traps, offensive plays, etc.), multiple weather conditions and under lights nightime play, plus commentary from Tony Gubba and surround sound.</p>"},{"name":"International Superstar Soccer 2000","year":2000,"developer":"Konami OSA Ltd.","url":"0#International%20Superstar%20Soccer%202000%20%28USA%29%20%28En%2CEs%29%20%28Rev%201%29.zip","filesize":11585849,"score":7.5,"genres":"Sports > Diagonal-down > Football (European) / Soccer","desc":"<p>The third ISS title on the N64 improves further in both gameplay and graphics.</p><p>As usual, you can play in a range of game modes, from 4 player exhibition, World League against every team in the world, and a collection of scenario games that have you completing certain elements of a game in order to complete it.</p><p>Also on offer are create-a-player modes, full gameplay options (subs, strategies and name editing) to expansion pak support for faster and more detailed graphics.</p>"},{"name":"International Superstar Soccer 64","year":1997,"developer":"Major A","url":"0#International%20Superstar%20Soccer%2064%20%28USA%29.zip","filesize":6529900,"score":8.4,"genres":"Sports > Football (European) / Soccer","desc":"<p><em>International Superstar Soccer 64</em> is a football (European)/soccer simulation game that lets players experience the excitement and drama of professional soccer. The Japanese release is specific to Japan's J-League.</p><p>Players can choose from a variety of national and club teams from around the world and compete in matches against other teams for the International Cup; World League is a series of 70 matches against every team from around the world. There are six game modes to play, including a 1-4 player Exhibition, League, Cup, and Training - each with its own unique challenges and objectives.</p><p>You can also play a penalty shoot-out competition with up to 4 players, or attempt to complete certain scenario games (where each game is set up with a specific goal, for example scoring a goal within a given time limit or stopping the opposing team from scoring, etc.).</p><p>In Exhibition mode, players can choose to play a single match against any team in the game. The League mode allows players to participate in a full season of matches, competing against other teams to win the championship. In Cup mode, players can participate in a tournament-style competition, competing against multiple teams to become the champion.</p><p>The game's Training mode is a great way for players to practice their skills and improve their performance. It allows players to practice different soccer techniques and hone their gameplay skills.</p><p>One of the most notable features of <em>International Superstar Soccer 64</em> is its AI, which provides a challenging and dynamic gameplay experience. The game also includes multiple camera angles, allowing players to see the action from various perspectives.</p>"},{"name":"International Track & Field 2000","year":1999,"developer":"Konami Computer Entertainment Tokyo Co., Ltd.","url":"0#International%20Track%20%26%20Field%202000%20%28USA%29.zip","filesize":9195911,"score":7.2,"genres":"Sports > 3rd-person (Other) > Olympiad / mixed sports","desc":"<p>Track and Field sports over 12 different events that will test your gaming mojo.  From Weightlifting to gymnastics to the 100M dash, Track and Field is the successor to the Track and Field games from the 8 bit Nintendo.</p>"}]