[{"name":"Ken Griffey Jr.'s Slugfest","year":1999,"developer":"Angel Studios, Inc.","url":"0#Ken%20Griffey%20Jr.%27s%20Slugfest%20%28USA%29.zip","filesize":14157988,"score":7.2,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>Aiming for further realism, <em>Slugfest</em> removes many arcade elements from the original Ken Griffey N64 title, replaced with more simulation style elements.</p><p>For the second time around, new inclusions feature updated team rosters and stats, a new behind the pitcher camera perspective, and a new create-a-player mode.</p><p>Full support is also included for 4 players in home run derby mode, and 2 player exhibition, while the expansion pak allows for higher resolutions for players and stadiums.</p>"},{"name":"Killer Instinct Gold","year":1996,"developer":"Rare Limited","url":"0#Killer%20Instinct%20Gold%20%28USA%29%20%28Rev%202%29.zip","filesize":12075211,"score":7.4,"genres":"Action > Side view > 2D scrolling > Fighting > Fantasy","desc":"<p><em>Killer Instinct Gold</em> is an updated version of Killer Instinct 2.</p><p>The gameplay includes all of the fighters, moves (and new ones such as auto doubles to gain free hits in combos) and stages (including the three newest inclusions to the fighter line-up, Maya, Kim Wu and Tusk) plus new game modes in the Nintendo 64 version such as Team, Team Elimination, 5 speed levels and a complete training mode helping you to learn the many moves, combos and special attacks for each fighter.</p>"},{"name":"Kirby 64: The Crystal Shards","year":2000,"developer":"HAL Laboratory, Inc.","url":"0#Kirby%2064%20-%20The%20Crystal%20Shards%20%28USA%29.zip","filesize":12286454,"score":7.3,"genres":"Action > Diagonal-down > Side view > Platform > Puzzle elements","desc":"<p>Kirby's adventure for the Nintendo 64 is a polygonal side-scroller similar to Klonoa - however, unlike Klonoa, the game only follows one set path instead of multiple branching paths. In this game, Kirby can still copy the abilities of his foes - but in addition to this, he can combine these abilities with others to make unique combinations (For one example, combining electricity and ice will turn Kirby into a fridge that spits out food).</p><p>The story begins with Dark Matter assaulting a faraway land for their special crystal. A young fairy called Ribbon takes the crystal and escapes to save it. She lands in Dream Land, but pieces of the crystal have shattered and landed all across the world. Kirby volunteers to help and together they go to find all the missing pieces.</p><p>Kirby will encounter his friends, who have been controlled by Dark Matter. He'll have to battle them to rescue them. From there, they travel together to other different worlds, including Rock Star, Water Star, and Ripple Star, Ribbon's home world, where Dark Matter is lurking. To properly finish the game, players must find all the hidden crystal shards tucked away in the various levels. Only then will Kirby and his friends truly save Ripple Star.</p>"},{"name":"Knife Edge: Nose Gunner","year":1998,"developer":"Kotobuki System Co., Ltd.","url":"0#Knife%20Edge%20-%20Nose%20Gunner%20%28USA%29.zip","filesize":4893308,"score":5.5,"genres":"Action > 3rd-person (Other) > Rail shooter > Sci-fi / futuristic","desc":"<p>Battle your way through level after level of intense air and ground attacks, as you take control of a powerful airship, with the simple aim of defeating the enemy. Take out other airships and defense installations through areas from tunnels to martian like landscapes.</p><p>Unlike most shooters of this type, <em>Knife Edge</em> uses a unique camera perspective that automatically moves through the environment in front of you in order for quick target locks. And you don't control the ship itself, letting you concentrate on moving the target onto enemies ahead.</p><p>You can play the story mode by yourself or with 3 friends, each controlling a separate ship for the battle ahead. A battle mode for 4 players is also included.</p>"},{"name":"Knockout Kings 2000","year":1999,"developer":"Electronic Arts, Inc.","url":"0#Knockout%20Kings%202000%20%28USA%29.zip","filesize":13701930,"score":7.3,"genres":"Sports > 3rd-person (Other) > Boxing > Licensed","desc":"<p>Play as some of the greatest names in boxing history through a full career, or create your own boxer and fight your way to the heavyweight championship.</p><p>Famous names include Muhammad Ali, \"Sugar\" Ray Leonard, Lennox Lewis, Oscar De La Hoya and Evander Holyfield, plus many more from a range of weight divisions.</p>"},{"name":"Kobe Bryant in NBA Courtside","year":1998,"developer":"Left Field Productions, Inc.","url":"0#Kobe%20Bryant%20in%20NBA%20Courtside%20%28USA%29.zip","filesize":11232806,"score":7.7,"genres":"Sports > Basketball > Licensed","desc":"<p>Fully endorsed and featuring motion captured moves of the man himself, Kobe Bryant, <em>NBA Courtside</em> has all the teams and players from the 1998 NBA Season.</p><p>Play modes include the usual 82 game regular season, playoffs, exhibition and the ability to create your own player in the create-a-player mode. </p><p>The players themselves, using the motion captured moves of Kobe, use a range of different basketball moves for the full-on experience, including many different dunk, dribbling and passing techniques, as well as a high range of artificial intelligence.</p>"},{"name":"Kyojin no Doshin 1","year":1999,"developer":"Param"},{"name":"Kyojin no Doshin Kaihō Sensen Chibikko Chikko Daishūgou","year":2000,"developer":""}]