[{"name":"Last Legion UX","year":1999,"developer":"Yuke's Co. Ltd.","url":"0#Last%20Legion%20UX%20%28Japan%29.zip","filesize":7389110,"score":"","genres":"Action > Behind view > Anime / Manga > Fighting > Direct control > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In the far-flung future, UNION IV and Light Raid fight for control of the Earth using mechanized battle suits known as Legions. Light Raid attempts a coup by sending eight Legions 4500 years into the past to win the war before it begins, but a single UNION IV Legion is quick to follow.</p><p><em>Last Legion UX</em> is a 3D arena fighter with full freedom of movement. Twelve playable mechs can be outfitted with a wide variety of weapons and shields for different capabilities in battle. Go head-to-head against the computer in Story Mode or 1 Player, or fight against a friend in 2 Player.</p>"},{"name":"Legend of Zelda, The: Majora's Mask","year":2000,"developer":"Nintendo EAD","url":"0#The%20Legend%20of%20Zelda%20-%20Majora%27s%20Mask%20%28USA%29.zip","filesize":27619323,"score":8.5,"genres":"Action > 1st-person > Behind view > Metroidvania > Puzzle elements > Direct control > Fantasy","desc":"<p>After having fulfilled Princess Zelda's request and saved the land of Hyrule from grave danger, Link departs on his horse Epona. In the Lost Woods he is ambushed by Skull Kid, an imp who dons a mysterious mask, accompanied by the fairies Tael and Tatl. Skull Kid turns Link into a small plant-like creature known as Deku Scrub and takes away his horse and his magical ocarina. Shortly afterward Tatl joins Link and agrees to help him revert to his native form. A meeting with a wandering mask salesman reveals that the Skull Kid is wearing Majora's Mask, an ancient item used in hexing rituals, which calls forth a menacing moon hovering over the land of Termina. Link has exactly three days to find a way to prevent this from happening.</p><p><em>Majora's Mask</em> is a direct sequel to Ocarina of Time. It utilizes the same engine and visual style, and virtually identical interface. The game retains the traditional elements of Zelda games (dungeon exploration, sword fighting, bows, bombs, heart containers, etc.) as well as those introduced in its immediate predecessor, such as active blocking with a shield, various throwing items, and the usage of melodies played on the ocarina to solve puzzles. Compared to the previous Zelda games, this installment is more oriented towards interaction with NPCs and has a larger variety of items, optional quests, and mini-games.</p><p>Also unique to this entry is its time system. The game has an internal clock, with one hour roughly corresponding to one real-life minute. If the player hasn't completed all the objectives within three in-game days, the moon falls on Termina, annihilating everyone and ending the game. However, the player can return to the first day at any time by playing a song on the ocarina, saving all quest-related progress and inventory but losing other items such as ammunition or money (unless stored in a bank). It is also possible to learn melodies that slow the time passage significantly or advance the clock instantly to the next day. Some events happen only at specific times, and many characters follow their own schedules throughout the three days. Owl statues scattered across the land provide quick-save points and serve as teleporters between areas when discovered.</p><p>Collection and usage of masks play an important role in the game. Most of the twenty-four masks that can be found in the game are optional, and usually serve to solve side quests or enhance Link's abilities, allowing him, for example, to run faster or to become invisible. Transformation masks can be used to turn Link into a Deku Scrub, a Goron, or a Zora. Each of these forms has access to unique abilities, many of which are essential to the completion of the game. Among other skills, Deku Link can shoot bubbles from his mouth and float between flowers; Goron Link can operate heavy switches and walk through lava without taking damage, and weigh down heavy switches; Zora Link can swim fast and generate force fields.</p>"},{"name":"Legend of Zelda, The: Ocarina of Time","year":1998,"developer":"Nintendo EAD","url":"0#The%20Legend%20of%20Zelda%20-%20Ocarina%20of%20Time%20%28USA%29%20%28Rev%202%29.zip","filesize":26624637,"score":8.6,"genres":"Action > 1st-person > Behind view > Metroidvania > Puzzle elements > Direct control > Fantasy > Medieval","desc":"<p>A young boy named Link was raised in the village of the elf-like Kokiri people. One day a fairy named Navi introduces him to the village's guardian, the Great Deku Tree. It appears that a mysterious man has cursed the tree, and Link is sent to the Hyrule Castle to find out more. Princess Zelda tells Link that Ganondorf, the leader of the Gerudo tribe, seeks to obtain the Triforce, a holy relic that grants immense power to the one who possesses it. Link must do everything in his power to obtain the Triforce before Ganondorf does, and save Hyrule.</p><p><em>Ocarina of Time</em> is the first 3D installment of the Legend of Zelda series. Like most of its predecessors, it is an action game with puzzle-solving and light role-playing elements. Gameplay is similar to the previous games, allowing Link to explore the world and complete dungeons to obtain key items and advance the plot. Sword combat as well as many familiar items such as boomerang, bombs, the series' currency (rupees) of various values, heart containers, and their collectible fragments permanently increasing Link's health, etc., return in this installment. Link can now lock on enemies for melee and ranged combat, actively use a shield to deflect projectiles, as well as use various magic items. Dungeon exploration is somewhat more puzzle-oriented than in earlier games. Link can climb certain surfaces, dive underwater, as well as automatically jump.</p><p>The game begins with the player controlling the child Link, but later on, an adult Link becomes a playable character as well. Each of them has certain unique abilities: for example, only adult Link can use a bow and arrows, but only the child Link can crawl through narrow spaces. During the course of the game, the player obtains the Ocarina of Time. Learning and playing melodies on that ocarina is needed to advance the plot, complete certain side quests, or travel in time, switching between the two versions of Link. It is also possible to befriend and ride a horse named Epona to facilitate travel between areas.</p>"},{"name":"LEGO Racers","year":1999,"developer":"High Voltage Software, Inc.","url":"0#LEGO%20Racers%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":10543585,"score":6.9,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>For the first time, build your favourite Lego carts on your PC using all of the blocks that are available in real life, thanks to the detailed Creation modes. You can then race your beast against other lego built characters in 12 special themed tracks, based on the Themed Lego kits (including Pirates &amp; Egypt and much more). Race your friend in split screen mode, or go straight on for the ultimate Lego racing trophy.</p>"},{"name":"Lode Runner 3-D","year":1999,"developer":"Big Bang Software, Inc.","url":"0#Lode%20Runner%203-D%20%28USA%29.zip","filesize":6781556,"score":7,"genres":"Action > Puzzle > Diagonal-down > Platform > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>The Emperor Monk of Pandora has begun raiding the Out-Sector Colonies, stealing vital gold supplies from the free systems. The Federated Hegemonies have no choice but to ask the Lode Runners to stop the raids and put an end to the Emperor's rule.</p><p>Unable to use the full fleet on the Emperor's defenses, which would cause mass casualties, they decide that a lone Lode Runner should enter the enemy base to recover any gold found and destroy the Emperor.</p><p>From an isometric style perspective, you must guide Lode Runner through each of the levels, dodging defensive blocks and enemies by either placing bombs and blowing holes in the ground to finding another way around. By finding all of the gold on the level, you can then progress to the next level.</p>"},{"name":"Looney Tunes: Duck Dodgers - Starring Daffy Duck","year":2000,"developer":"Paradigm Entertainment Inc.","url":"0#Duck%20Dodgers%20Starring%20Daffy%20Duck%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":13322524,"score":7,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements","desc":"<p>Marvin the Martian has devised a plan to destroy the Earth and has built the Ultimate Weapon to do it. This weapon needs energy atoms to function, so Marvin has sent out his five minions to five different worlds to collect the energy atoms. Duck Dodgers, the brave space adventurer and the defender of Earth, must get to the atoms before Marvin's goons do, with the help of his side-kick Porky Pig. </p><p><em>Duck Dodgers</em> is a 3D platformer based on the Warner Bros. cartoons starring the titular hero. Dodgers travels to various planets, each reflecting the theme of the corresponding Looney Tunes boss characters (e.g. an Arabian Nights-themed planet ruled by the evil dictator Hassan). The gameplay is similar to Super Mario 64. Dodgers explores three-dimensional levels, jumps and double-jumps to avoid obstacles and reach higher areas, and defeats enemies by punching or butt-stomping them. Special items (such as ACME rockets or boxing gloves) can be picked up and used in combat. The player also participates in several mini-games, including a Pong variant and a first-person shooter section.</p>"}]