[{"name":"Mace: The Dark Age","year":1997,"developer":"Atari Games Corporation","url":"0#Mace%20-%20The%20Dark%20Age%20%28USA%29.zip","filesize":10643616,"score":7.5,"genres":"Action > 3rd-person (Other) > Fighting > Fantasy","desc":"<p><em>Mace: The Dark Age</em> is a 3D fighting game set in a dark fantasy setting. Players can choose between 18 characters from all over the world equipped with swords, daggers, maces, katanas and other weapons. Basic moves include: a quick and a strong attack with weapons, kicks, sidesteps, and throws. Additional attacks can be performed by pressing the standard attack buttons in different positions or combined with directional buttons. Counter attacks are also possible, but require more complicated button combinations and good timing. Standard moves can be linked to combos and each character has a number of individual special moves that require specific button combinations to be used. </p><p>Battle arenas feature multiple levels and usually contain hazards like acid pools or swinging axes that deal damage when touched. Some arenas also contain interactive objects like plant pots or torches that can be thrown at opponents.</p><p>The game is fairly bloody (the gore can be turned off in the options menu) and all characters have their own finishing moves(called executions) - particularly brutal ways of killing an opponent.</p>"},{"name":"Madden Football 64","year":1997,"developer":"Tiburon Entertainment","url":"0#Madden%20Football%2064%20%28USA%29.zip","filesize":11252360,"score":7,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>Madden Football 64</em> is the first in Electronic Arts' Madden series to appear on the Nintendo 64. In terms of features, it is based closely on the PlayStation/Saturn version of Madden 98 (with the same playing modes and even menus) but there are two important differences: The N64 version does not have an NFL license, so there are generic team names without logos (there is an NFLPA license for real player names), and it is the first game in the series to feature fully polygonal graphics, for both stadiums and players.</p><p>Consequently, <em>Madden 64</em> was the most graphically advanced Madden game at the time of release. Visual features include 5000 frames of animation and a first-person HelmetCam view. AI adjusts during the game to the player's style. Creating, drafting and trading a full roster of players is possible.</p>"},{"name":"Madden NFL 2000","year":1999,"developer":"EA Tiburon","url":"0#Madden%20NFL%202000%20%28USA%29.zip","filesize":11397619,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Multiple units/characters control > Football (American) > Licensed","desc":"<p>John Madden brings the best football back to PC, bigger than ever! All 31 NFL teams (including the new Cleveland Browns), all-star and classic teams, player-specific animations, and much more. Graphics are better than ever. Improved running and rush interface gives you the ultimate control over strategy and execution. Even a franchise mode to keep you busy for a while.</p>"},{"name":"Madden NFL 2001","year":2000,"developer":"EA Tiburon","url":"0#Madden%20NFL%202001%20%28USA%29.zip","filesize":11085715,"score":7.3,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>Madden NFL 2001</em> is another yearly update in the long-running football series. The version for PlayStation and Nintendo 64 comes with its own selection of teams, modes and options, refined from the previous year's iteration. Compared to other versions, it has the largest number of modes, but less graphical fidelity and a lower number of selectable teams.</p><p>Players can select from the 31 teams of the 2000 NFL season and the 1999 All-Madden team on both consoles. The PlayStation version adds 31 All-Time franchise teams and 101 Classic NFL teams, from 1960 to 1999. Available modes include exhibition games, season, franchise, custom league (four to eight players), tournament (for 4, 8 or 16 players in single or double elimination), practice, and situation (set up any possible game situation to play). A new addition is called Two-Minute Drill: up to ten players compete for points by trying to perform spectacular plays within a two-minute time limit. Exclusive to the PlayStation version is the Great Games mode, allowing players to relive classic matchups from NFL history. The Great Games must be taken on in order and winning one makes the involved teams available for selection in other modes. As usual, player creation, drafting and trading as well as custom play creation is included in the game as well.</p><p>The previous year's Madden Challenge reappears in a new form called Madden Cards, resembling a collectible card game. The game includes a list of 100 challenges organized in five different levels. These include making certain plays or play combinations, beating teams under certain conditions (e.g. at home and in the rain), avoiding fumbles, sacks and penalties, et cetera. Completing a challenge gains the player tokens (how many depends on the difficulty level played at) which can be spent to buy a number of randomized Madden Cards. There are a total of 296 cards in the game (differing in rarity) which are collected in the in-game card book. Unwanted cards can be sold to regain half the tokens paid. It is also possible to trade cards with other player profiles and it is even possible to wager cards in two-player games. The cards have a number of different effects: most unlock classic players as well as hidden teams and stadiums. Others can be activated for different gameplay effects: making the game harder or easier or enabling gags such as teleporting players or putting the camera inside the ball.</p>"},{"name":"Madden NFL 2002","year":2001,"developer":"Budcat Creations, LLC","url":"0#Madden%20NFL%202002%20%28USA%29.zip","filesize":10943791,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>Madden NFL 2002</em> is another yearly update in the long-running football franchise. With main series developer Tiburon focusing their efforts on the new generation of consoles, it fell to developer Budcat to update the game for the new year on the veteran platforms PlayStation and Nintendo 64. The 2002 version is closely based on the previous year's game, with almost the same menus and many of the same modes and options, but also several new features, including a redesigned kick meter and mulligans, allowing one to take back and replay a limited number of plays per game.</p><p>The included teams have been updated for the 2001 NFL season and include the 31 regular teams plus the 2002 expansion team, the Houston Texans, NFC and AFC all-star teams and two All-Madden teams (2000 and Super Bowl). Exclusive to the PlayStation version are more than 90 classic NFL teams, 31 all-time franchise teams and the 6 NFL Europe teams.</p><p>The returning modes include Exhibition, Season, Franchise, Custom League, Tournament, Situation (Great Games is again only featured on PlayStation), and Two-Minute Drill (with an added Head-to-Head option, facing off two players with one playing offense and the other defense). The Practice mode has been expanded to the Coaches Corner mode: the team practice option is the same as the previous year's practice while the new training mode is a tutorial that guides players through various plays by explaining when to use and how best to perform them. A special mode exclusive to this version of the game is called Madden Classic. It is a fully featured game-within-a-game that goes back to the early days of the series: regarding visuals, options, and menus, it is based on Madden 92 for Genesis, but features the teams and rosters of the current season.</p><p>The Madden Cards feature returns from the previous game. Tokens to buy cards can be won by completing a number of challenges or through the training mode. The card roster has been expanded from the previous year and now includes cheerleader cards that hype up their team when used.</p>"},{"name":"Madden NFL 99","year":1998,"developer":"EA Tiburon","url":"0#Madden%20NFL%2099%20%28USA%29%20%28Rev%201%29.zip","filesize":10726134,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>As with all yearly updates to the football series, <em>Madden NFL 99</em> features improved graphics and AI over its predecessors. Force feedback, 8-button controllers and online support are available. The team roster includes nearly 100 successful vintage NFL teams as well as the full up to date roster at the time. There is more commentary integrated than before.</p><p>This version features a new Franchise mode, which allows you to control a team through a number of seasons, taking into account free agents, retirement, drafts, and salary caps. Each team can have different playbooks.</p><p>Also added is a one-button mode, which simplifies controls for beginners. Tying in with this is the arcade mode, which removes some of the more complex rules and adds to the force of impacts.</p>"},{"name":"Magical Tetris Challenge","year":1998,"developer":"Capcom Co., Ltd.","url":"0#Magical%20Tetris%20Challenge%20%28USA%29.zip","filesize":11440588,"score":6.9,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control > Licensed","desc":"<p><em>Magical Tetris Challenge</em> is a Tetris game that combines the classic puzzler with the Disney license, and offers two original competitive Tetris variants: Magical Tetris and Updown Tetris.</p><p>Both follow the standard Tetris template: Tetris pieces fall onto the playing field from the top and must be arranged so they form horizontal lines which are then removed, with the player whose stack of pieces reaches the top first losing.</p><p>In Magical Tetris, clearing two or more lines at the same time sends a magical attack to the opponent, which puts a non-standard magical piece into their queue. Magical pieces consists of more than four blocks and are thus harder to place, but can theoretically clear more lines at once. Magical attacks can be countered by clearing lines while the piece is in the queue. This sends the piece back to the opponent, changing it to a 2x2 square piece. Countered pieces can again be countered, growing in size with each counter to a maximum of 5x5. Overflow to an already full queue turns existing pieces into ones marked with an exclamation mark. These can't be countered and are massive in size and come in pyramid or diamond shapes. A clock counts the time during Magical Tetris - each minute of game time raises the game level, up to a maximum of 4, with higher levels resulting in more magical pieces added to the opponent's queue per cleared line.</p><p>Updown Tetris is less complex. Attacks against the opponent are made by clearing two or more lines, which are then (minus one column) added to the bottom of the opponent's playing field, pushing their stack higher.</p><p>Both modes include another gameplay element: the magical gauge is filled by clearing single lines or through attacks made by the opponent. Filling the meter clears the entire playing field above a certain threshold and simplifies the block structure below it. The meter is then cleared and the threshold rises, requiring more moves to fill it a second time. The threshold can only be lowered by clearing all blocks off the field.</p><p>The two modes are available in story and two-player modes. In story mode, players select one of four Disney characters (Mickey, Donald, Goofy and Minnie) who each come with their own storylines. The game then consists of consecutive matches against the other characters and the bad guys (Pete, Big Bad Wolf and Weasel), with cutscenes between matches.</p><p>Only the home versions have an endless mode, which offers standard Tetris and Magical Tetris.</p>"},{"name":"Major League Baseball Featuring Ken Griffey Jr","year":1998,"developer":"Angel Studios, Inc.","url":"0#Major%20League%20Baseball%20featuring%20Ken%20Griffey%20Jr.%20%28USA%29.zip","filesize":13681849,"score":7.2,"genres":"Sports > Arcade > Baseball > Licensed","desc":"<p>The full Major League Baseball is on display in this mainly arcade style baseball title. All teams and players are available for exhibition, season and world series modes. Up to two players can play through these modes, with a further two for 4 player home run derby, where the winner is determined by the amount of balls you can whack out of the park.</p><p>Ken Griffey Jr. supplies his motion captured moves and voice to the game, along with team stats tracking through-out the season.</p>"},{"name":"Mario Artist: Communication Kit","year":2000,"developer":"Nintendo EAD"},{"name":"Mario Artist: Paint Studio","year":1999,"developer":"Software Creations Ltd."},{"name":"Mario Artist: Polygon Studio","year":2000,"developer":"Nintendo R&D1"},{"name":"Mario Artist: Talent Studio","year":2000,"developer":"Nintendo EAD"},{"name":"Mario Golf","year":1999,"developer":"Camelot Software Planning","url":"0#Mario%20Golf%20%28USA%29.zip","filesize":17346665,"score":7.8,"genres":"Sports > Behind view > Golf > Math / logic > Licensed","desc":"<p>Since Mario rescued Princess Peach in Super Mario 64, he's been thoroughly enjoying his free time. Bowser hasn't been causing too much trouble, so Mario and his friends have decided to take a trip to the golf course. Waialae Country Club wouldn't allow a couple of underdressed plumbers to become members, so they've come up with their own golf game for Nintendo 64. </p><p><em>Mario Golf 64</em> features an all-star line up of 10 golfers from Nintendo's cast of video game celebrities, including Mario, Luigi, and Princess Peach. Each golfer has an individual set of strengths and weaknesses. A highlight of Mario Golf 64 is a special \"Time Attack Mode,\" where players must compete to finish a round of golf as quickly as possible. </p><p>Mario Golf 64 features an impressive line-up of six courses, which means you'll have to master a total of 108 holes. An optional \"Club Handicap Mode\" ensures that you stay close to the competition, so Luigi won't get too frustrated if he falls behind. Even though the golfers are cartoons, the physics are as realistic as possible. The CPU calculates the exact ball movement based on wind direction, the strength of the strike, and any spin you may choose to place on the ball.</p>"},{"name":"Mario Kart 64","year":1996,"developer":"Nintendo EAD","url":"0#Mario%20Kart%2064%20%28USA%29.zip","filesize":9019374,"score":8.1,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Track racing > Fantasy","desc":"<p><em>Mario Kart 64</em> races eight familiar faces, including Mario, Bowser and Yoshi, on four progressively tougher four-track circuits. Wide curves and gentle banks mark the Mushroom Cup tracks. Your commute gets notably tougher on the Flower Cup, though. The player will have to dodge semis rumbling on Toad's Turnpike and bounding boulders on fogbound Choco Mountain! Star Cup tracks range from the icy surfaces of Sherbet Land to the lava lakes of Bowser's Castle. The true test of karting competence, though, comes on the four tracks in Special Cup. Zip through the dark caves and green hillsides of Donkey Kong's Jungle Parkway, cling to the sheer cliffs of Yoshi Valley and hustle over haunted Banshee Boardwalk before tackling the longest track in the game: neon-lit Rainbow Road. </p><p>The game offers two camera angles and three engine sizes: 50cc, 100cc and 150cc. You can gain even more speed by mastering the power slide technique or grabbing Super Star power-ups. Each kart has distinctive handling, acceleration and top speed capabilities. Light karts like Princess's smoothly steer through tight corners, but run the constant risk of getting flattened by heavy karts, like Donkey Kong's. Shells that you fire at rival racers, Bananas that make them skid out and Lightning Bolts that make them small and very slow are just a few of the game's unique power-ups.</p>"},{"name":"Mario no Photopi","year":1998,"developer":"DATT Japan Inc."},{"name":"Mario Party","year":1998,"developer":"Hudson Soft Company, Ltd.","url":"0#Mario%20Party%20%28USA%29.zip","filesize":21604435,"score":7.7,"genres":"Action > Strategy > Diagonal-down > Side view > Top-down > 2D scrolling > Turn-based > Board game > Mini-games > Party game > Direct control > Boxing > Fishing > Football (European) / Soccer > Fantasy > Licensed","desc":"<p><em>Mario Party</em> is a party game for 1 to 4 players. The festivities are based on a board game format, right down to the fact that players must roll a die to determine how many spaces to move. Players land on different squares, each space holding one of more than fifty different mini-games. These quick competitions determine who will earn coins and stars, and who will go home empty handed. </p><p>The mini-games are spread over eight different game boards, all of which are not immediately available. Some of the games pit every man or princess against the others, some are two-on-two, and others are even three against one. One challenge is loosely based on \"Simon Says\", another involves a two-on-two bobsled race, and one game makes one player attempt to cross a rope while the other three do their best to shake the player off. There are skill games, racing games, puzzle games, and other types.</p><p>A good portion of the actual game boards are animated, with hidden dangers and special challenges scattered everywhere. Mario, Luigi, Princess Peach, Donkey Kong, Bowser, Yoshi, and Wario are all invited to the party, and each character has his or her own game board.</p>"},{"name":"Mario Party 2","year":1999,"developer":"Hudson Soft Company, Ltd.","url":"0#Mario%20Party%202%20%28USA%29.zip","filesize":25021664,"score":7.7,"genres":"Action > Strategy > Diagonal-down > Top-down > 2D scrolling > Turn-based > Board game > Mini-games > Party game > Direct control > Fantasy","desc":"<p>Mario and a range of well known Nintendo characters, including Yoshi, Bowser, Luigi, and Wario return for some more party action. </p><p>The second edition includes 5 new boards, each with a specific theme, such as Space Land, Western Land, Horror Land, and Mystery Land. Each board includes unique attributes in relation to the theme, but the main goal is the same: complete the board game over a certain amount of moves and be the player to have the most coins and/or stars at the end. </p><p>The single player story mode allows one person and 3 CPU controlled players to play each board. Once you play a specific mini-game (64 in all), they become available to purchase using the coins you collected in your games to play anytime. Multiplayer allows 2 to 4 people to play the game.</p>"},{"name":"Mario Party 3","year":2000,"developer":"Hudson Soft Company, Ltd.","url":"0#Mario%20Party%203%20%28USA%29.zip","filesize":25556881,"score":7.4,"genres":"Action > Strategy > Diagonal-down > Top-down > 2D scrolling > Turn-based > Board game > Mini-games > Party game > Direct control > Fantasy","desc":"<p>The series continues with a set of 70 new mini-games.  Play in the new single-player Story mode, or bring in some friends for Party mode.  Four player games and a new two player mode are also available for play.</p><p>In Battle Royale mode (four player), you race around different boards to earn the most stars and coins.  At the end of each round, you face it off in one of the mini-games, which can be chicken chases, snowball fights, or various other competitions.</p><p>Duel mode allows play between just two people.  You still race around the board, but mini-games are only played when you land on a specific square.  Another play change is the addition of another character for your team, allowing tag team-style action in the game.</p><p>Story mode is essentially the same as a Battle Royale, except your opponents are played by the computer.</p>"},{"name":"Mario Tennis","year":2000,"developer":"Camelot Software Planning","url":"0#Mario%20Tennis%20%28USA%29.zip","filesize":14795174,"score":7.9,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Tennis","desc":"<p>Choose your favourite Nintendo character and take to the world of tennis. Game types include ring shot (where you must shoot the ball through golden hoops that are suspended above the play area, gaining bonus points as you play), bomb tennis (simply put Tennis with Bombs) and Piranha Challenge (much like the tennis machines which chuck balls at you, but in this case they are replaced with Piranha plants). Of course, there is your normal tournament mode, with up to 4 players in on the action, and some crazy arenas, especially Bowser's Castle, which is suspended above a lava pit!</p>"},{"name":"Mega Man 64","year":2000,"developer":"Capcom Co., Ltd.","url":"0#Mega%20Man%2064%20%28USA%29.zip","filesize":28152593,"score":6.5,"genres":"Action > Behind view > Anime / Manga > Arcade > Metroidvania > Shooter > Sci-fi / futuristic","desc":"<p>In a world covered almost entirely in water, there exist small islands that hide huge treasures. And where there's treasure, you can find treasure hunters called Diggers, who live for the thrill of the hunt...</p><p>Barrel Casket was once one of the greatest Diggers, but he has now retired. He now cares for his young granddaughter, Roll, whose parents disappeared while on a dig. He had also discovered a strange baby boy in some ruins one time, who he also took under his care alongside Roll. He named the baby boy Rock Voulnut, and Rock grew up to be an expert Digger, sometimes known by his nickname, MegaMan.</p><p>While out exploring one day, Rock, Roll, and Barrel's airship, the Flutter, crash lands on an island named Kattelox. As they explore Kattelox in hopes of fixing their ship, they hear word of a huge treasure, the legendary Mother Lode, that is buried somewhere on the island. Rock, Roll, and Barrel decide to look for the treasure, but at the same time, they're going to get a little competition from a pirate family named the Bonnes...</p><p><em>Mega Man Legends</em> is the first of the <em>Mega Man</em> series to take place in fully explorable 3D, and is paced more like an RPG than the previous stage-to-stage action games. Rock can explore the town and follow the story to find entrances to the underground ruins, where in he will find traps, feral Reaverbots, and large boss robots. Destroying enemies will reward Rock with health, sub-weapon energy, and the power cores of the robots, which people in his world use as currency. By searching through the town and ruins Rock will find items of dubious use and value, and they can be brought back to Roll to be assembled into useful items and upgradable sub-weapons, although not for free. Rock can run while shooting, go into first person mode for aimed shots, and also lock onto an enemy and circle around them to avoid their attacks.</p>"},{"name":"Mia Hamm Soccer 64","year":1999,"developer":"DC Studios, Inc.","url":"0#Mia%20Hamm%20Soccer%2064%20%28USA%29%20%28En%2CEs%29.zip","filesize":12468396,"score":6.3,"genres":"Sports > Diagonal-down > Football (European) / Soccer > Licensed","desc":"<p><em>Michael Owen's WLS 2000: World League Soccer</em> is a soccer game for the Nintendo 64. In the game you can choose to play one of over 200 teams from various countries in custom cups.</p><p>The game features two modes of control: easy and professional. The latter allows you to perform a wide array of over 23 different special moves and maneuvers. Controls allow you to shoot, pass and sprint. Unlike other soccer games you cannot choose which player you want to control when on the defense, the decision is made for you.</p><p>The later released US version of the game, named <em>Mia Hamm Soccer 64</em>, had all the player models replaced with female versions and all team names changed.</p>"},{"name":"Mickey's Speedway USA","year":2000,"developer":"Rare Limited","url":"0#Mickey%27s%20Speedway%20USA%20%28USA%29.zip","filesize":22632092,"score":7.3,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>The Weasels have kidnapped Pluto while he was wearing his diamond collar! All that was left of him was a ransom note showing the Weasels driving him away in a van. Mickey rounds up all of his friends (and even Pete wants to get in on the action!), and Professor Von Drake soups up their race cars so that they can catch up with the Weasels as they go on a cross-country tour of the United States. The Weasels have also stolen four parts of the Professor's top-secret racer, and hidden them in four of the tracks. Once players find all these pieces, they can catch up with the Weasels in the final showdown.</p><p><em>Mickey's Speedway USA</em> is a kart racer from Rare based on the Diddy Kong Racing game engine. Players compete in circuits of four races, grand prix style, and the player with the most points at the end of all four races wins the gold trophy. There are six initial racers, but only three sets of stats shared between them. Minnie and Daisy are lightweight and good for beginners, Mickey and Donald are both all-around characters, while Pete and Goofy are the slow but fast heavyweights.</p><p>The game has an assortment of pickups - there's the Carbo Spritzer, a soda-powered turbo; the Paint Splotcher, which launches a slippery blob of paint onto the track; the Baseball Chucker, which launches an explosive baseball onto the track; and the Magno Flyer, which sends a remote control plane to seek the nearest opponent, to name a few. There are also 'Oomph Tokens' scattered on the track - the first ten of these tokens increase your racer's maximum speed a little.</p><p>As well as the main game, Mickey's Speedway USA also features a Time Trial mode (where you race against the clock), a Practice mode (where you can drive all around a farmyard course to practice your skills), and Contest mode (which functions like the famous Battle Mode in Mario Kart 64 - players must pop their opponents' three balloons before they lose all of their own). The game is also Transfer Pak compatible with the Game Boy Color version of Mickey's Speedway USA.</p>"},{"name":"Micro Machines 64 Turbo","year":1999,"developer":"The Codemasters Software Company Limited","url":"0#Micro%20Machines%2064%20Turbo%20%28USA%29.zip","filesize":5862569,"score":7.5,"genres":"Racing / Driving > Top-down > Licensed","desc":"<p>Conversion of Micro Machines V3, with added extras exclusive to the N64 version.</p><p>Race a selection of tiny toy vehicles (racing cars, tanks, boats and more) across the beach, garden and areas of the house, just like you would with the real Micro Machines toys.</p><p>Although in full 3D, the game is played from the top down perspective to allow the player to view more of the track as well as showing how small the Micro Machines really are. </p><p>And although only four controllers are allowed on an N64, up to 8 people can play at any one time using what's called Pad Share (where one person uses one side of the controller, stearing with the Directional pad, while the other player uses the four C-buttons).</p>"},{"name":"Midway's Greatest Arcade Hits","year":2000,"developer":"Digital Eclipse Software, Inc.","url":"0#Midway%27s%20Greatest%20Arcade%20Hits%20-%20Volume%201%20%28USA%29.zip","filesize":1846874,"score":6.5,"genres":"Compilation","desc":"<p>A collection of classic Arcade titles:</p><ul><li><strong>Spy Hunter</strong> - Weapons-based racer where as a spy you must chase the bad guys through the never ending streets of the city, using rockets, guns, oil slicks and smoke screens to take out the many enemies along the road.</li><li><strong>Joust</strong> - While riding an ostrich, you must knock out the other players on the field to advance to the next level.</li><li><strong>Defender</strong> - Much like Space Invaders, you fly a spacecraft out to stop an invasion of aliens on Earth. Unlike Space Invaders, you move up and down as well as left and right while the enemy fly down to grab humans of the planets surface.</li><li><strong>Robotron</strong> - Out to save the last human family, move your way through the play field while taking out the many robots that lay in your path before you.</li><li><strong>Sinistar</strong> - Mankind's last hope, you must shoot down asteroids while picking up items to increase your ships power before the battle with the Sinistar.</li><li><strong>Rootbeer Tapper</strong> - The only non-shooter title, prepare drinks for waiting customers, then slide them across the tables to them to clear the area.</li></ul>"},{"name":"Mike Piazza's Strike Zone","year":1998,"developer":"Devil's Thumb Entertainment","url":"0#Mike%20Piazza%27s%20Strike%20Zone%20%28USA%29.zip","filesize":5435975,"score":"","genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p><em>Mike Piazza's Strike Zone</em> is a baseball simulator released exclusively for the Nintendo 64. Showcasing then-New York Mets catcher Mike Piazza on the cover and in the aforementioned title, it features the ability to play exhibition games as well a season mode that offers season lengths of 15, 81, or 162 games. A World Series mode, All-Star Game mode, and Home Run Derby mode are also among the offerings. The game has many customizable features (including the ability to change team names and logos).</p>"},{"name":"Milo's Astro Lanes","year":1998,"developer":"Player 1","url":"0#Milo%27s%20Astro%20Lanes%20%28USA%29.zip","filesize":3395198,"score":5.7,"genres":"Simulation > Sports > 1st-person > Behind view > Bowling > Sci-fi / futuristic","desc":"<p>Futuristic space bowling simulation, with nuclear balls, lots of power-ups and wacky characters. Robots, aliens and funky courses, and a multiplayer mode where you can ruin your friends' opportunities with different special weapons.</p>"},{"name":"Mini Racers","year":1999,"developer":"Looking Glass Studios, Inc.","url":"0#Mini%20Racers%20%28USA%29%20%28Ja%29%20%28Proto%29.zip","filesize":4920214,"score":"","genres":"Racing","desc":"<p>Mini Racers, also known as Surikka Rajikka is a cancelled game for Nintendo 64. Additionally, a similar game and tech demo was in development (possibly related to this game), known as Tamiya Racing (Tamiya is a remote-control car producer).</p>"},{"name":"Mischief Makers","year":1997,"developer":"Treasure Co., Ltd.","url":"0#Mischief%20Makers%20%28USA%29%20%28Rev%201%29.zip","filesize":5942439,"score":7.6,"genres":"Action > 3rd-person (Other) > Side view > Anime / Manga > Platform > Sci-fi / futuristic","desc":"<p><em>Mischief Makers</em> is a 2D side-scrolling platform game in which the protagonist uses her hands to grab, shake, and throw objects. There are five \"worlds\" in the game, each with about ten levels.</p><p>You are Marina Liteyears, assistant to professor Theo. The professor has been kidnapped, and some of King Aster's troops have defected. It is up to Marina, with some help from the troops still loyal to the king, to save the professor and defeat the evil empire.</p>"},{"name":"Mission: Impossible","year":1998,"developer":"Infogrames Europe SA","url":"0#Mission%20-%20Impossible%20%28USA%29.zip","filesize":11797963,"score":7,"genres":"Action > 1st-person > 3rd-person (Other) > Puzzle elements > Shooter > Stealth > Spy / espionage > Licensed","desc":"<p>Tie-in of the popular movie <em>Mission: Impossible</em>, this is a third-person action stealth game with 24 levels. Playing the secret agent Ethan Hunt, the player has to fight international terrorists. Assisted by his IMF team, he sneaks into enemy bases, blows up ammunition depots, retrieves stolen information and takes out the terrorists.</p><p>The plot is loosely based on the movie; Ethan Hunt is framed and has to prove his innocence which he is only able to do with the help of his good friends from the IMF team.</p>"},{"name":"Monaco Grand Prix","year":1999,"developer":"Ubi Soft Paris Studios","url":"0#Monaco%20Grand%20Prix%20%28USA%29.zip","filesize":14490291,"score":7.3,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Automobile > Track racing > Oceania > Licensed","desc":"<p>The sequel to F1 Racing Simulation recreates the 1997 season, featuring 17 authentic tracks, 11 teams and cars with their 22 drivers. The Monaco license is used, although the teams themselves are not licensed. A total of 22 camera views are provided.</p><p>Telemetry is stored and analysed in a similar way to Grand Prix 2, and physics are modeled to be realistic. There are eight different modes to race, the new ones being a career mode in which you start with a poor team and must drive well enough to earn competitive rides, and scenarios recreating key races for particular drivers. Returning from the first game are Time Attack, a full championship, and a 50s retro mode. There is also a track editor to create your own tracks.</p>"},{"name":"Monopoly","year":1999,"developer":"Minds Eye Productions","url":"0#Monopoly%20%28USA%29.zip","filesize":2879003,"score":6.5,"genres":"Strategy > 3rd-person (Other) > Board game > Licensed","desc":"<p>The Nintendo 64 received its own adaptation of the classic board game of ruthless capitalism, featuring fully polygonal 3D graphics.</p><p>The game includes US and UK board versions and three varieties of game: standard, short and timed. In each, various rule options can be set, including popular house rules like the free parking pot, double money for landing on GO and having to go around once before starting buying, while standard rules like the even build rule, the auctioning of unsold properties and rent immunity in trading can be switched off. Players can be set between two and four, with the computer filling out any number of positions. The personality of the computer opponents can be set in four levels, from cautious to intelligent. Eleven tokens are available, including the money bag, introduced to the game in 1998 by popular vote.</p><p>Gameplay is seen in 3D, with an animated roll of the dice, the tokens moving around the board (the walking animations can be turned off), and Mr. Monopoly holding up Chance and Community cards. The camera can be set to five different positions during token movement, and there is a free camera mode for inspecting assets. The game can be saved between turns.</p>"},{"name":"Monster Truck Madness 64","year":1999,"developer":"Edge of Reality, Ltd.","url":"0#Monster%20Truck%20Madness%2064%20%28USA%29.zip","filesize":7073993,"score":6.2,"genres":"Action > Racing / Driving > Sports > 1st-person > Behind view > Direct control > Off-roading","desc":"<p><em>Monster Truck Madness 64</em> is a monster truck racing game for the Nintendo 64. The game features 20 trucks to ride in and 10 tracks to race on.</p><p>Single player game modes the game offers are exhibition and circuit race. During the races you have to drive to check points to set your time. You can pick up a variety of power-ups such as invisibility, homing missiles, oil slicks, shrink bombs, hover modes, nitro, super jumps and shields.</p><p>In multi-player the game offers various game modes such as hockey, soccer, police chase, summit rumble (king of the hill) and tag.</p><p>You can play the tracks during various types of weather and different times of the day.</p>"},{"name":"Mortal Kombat 4","year":1998,"developer":"Midway Games, Inc.","url":"0#Mortal%20Kombat%204%20%28USA%29.zip","filesize":13671637,"score":7,"genres":"Action > Side view > Arcade > Fighting","desc":"<p><em>Mortal Kombat 4</em> is 1 vs 1 fighting game, similar to the other Mortal Kombat games, but this is first game in series with 3D characters models. The player can choose from 15 different fighters at the start (and several unlockables later on). Many fighters from earlier games in the series make a comeback (like Scorpion, Sub Zero, Liu Kang, Sonya Blade, Johnny Cage etc.) while other new fighters join in, like Shinook (who is the main evil character in this game), Fujin, Jarek, and Kai. Goro returns as a boss</p><p>Gameplay is very typical for a <em>Mortal Kombat</em> game, but has several new features - for example characters can use weapons in a fight (not only as a special move) or avoid attacks in the 3D environment.</p>"},{"name":"Mortal Kombat Mythologies: Sub-Zero","year":1997,"developer":"Midway Games, Inc.","url":"0#Mortal%20Kombat%20Mythologies%20-%20Sub-Zero%20%28USA%29.zip","filesize":13769782,"score":6.3,"genres":"Action > Side view > Arcade > Fighting > Platform > Sci-fi / futuristic","desc":"<p><em>Mortal Kombat Mythologies: Sub-Zero</em> is a story-driven fighting game that casts you in the shoes of Sub-Zero, and chronicles a series of events that occurred prior to Mortal Kombat 1.</p><p>In a storyline that is reminiscent of Looking Glass's Thief, the Lin Kuei assassin/thief is sent to steal an important document; this mission proves to be a test from a mysterious character (which turns out to be MK4's Quan Chi) and who charges you upon retrieval of this object to recover an ancient medallion of untold power. However once you retrieve the medallion, Quan Chi reveals that he actually tricked you, and the medallion is the key to awakening the demonic Shinnok (yup, the same baddie from MK4). You must now become a reluctant hero, as you pursue Quan Chi trough hell itself hoping you get to Shinnok before him.</p><p>Gameplay wise the game takes the Mortal Kombat familiar 2D fighting environment and turns it into a hybrid fighter/platformer game, where you must travel trough hazardous levels running and jumping around as well as fighting your way against both digitized and polygonal enemies. Sub-Zero's interface is the same as in every MK game, with the addition of a \"use\" and \"turn around\" buttons and additions such as an inventory, and a slight RPG twist in which you get exp. for defeating opponents, which translates into new techniques and moves to execute in the game.</p><p>Technically speaking this game represents the final evolutionary step in the MK's series 2D engines. New features include zooming, 3D lighting as well as 3D backgrounds and characters, etc.</p>"},{"name":"Mortal Kombat Trilogy","year":1996,"developer":"Midway Games, Inc.","url":"0#Mortal%20Kombat%20Trilogy%20%28USA%29%20%28Rev%202%29.zip","filesize":10690801,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy > Martial arts","desc":"<p>All the characters from the first three Mortal Kombat games return for the ultimate battle. You can play as Kano, Reptile, Mileena, Kung Lao, Shang Tsung, Sindel, Sketor, Stryker, Nightwolf, Sheeva, Kitana, Scorpion, Sonya, Smoke (Cyber Ninja), Rain, Jade, Baraka, Johnny Cage, Ermac, Noob Saibot, Sub-Zero (Unmasked), Sub-Zero (Classic), Jax, Rayden, Cyrax, Liu Kang, Smoke (Human), Kabal, Goro, Kintaro, Motaro, or Shao Kahn.</p><p>This game is one-on-one martial arts fighting. The player can choose from over thirty different characters, all with their own fighting style and their own special moves. Trilogy differs from the other games in that you can play combinations of people that otherwise isn't possible, such as old Liu Kang vs. new Liu Kang, etc.</p><p>Mortal Kombat Trilogy also allows you to challenge a friend to a fight through a Windows IPX network connection.</p>"},{"name":"MRC: Multi-Racing Championship","year":1997,"developer":"Genki Co., Ltd.","url":"0#MRC%20-%20Multi-Racing%20Championship%20%28USA%29.zip","filesize":8705080,"score":7,"genres":"Racing / Driving > 3rd-person (Other)","desc":"<p><em>MRC Multi Racing Championship</em> is a rally car racing game. </p><p>Five race modes are available. These include: Championship, Time Trial, Free Run, VS Race and Match Race. </p><p>2-player racing is handled with a horizontal split screen.</p><p>All of the cars can be customized. Individual settings that can be modified for the cars are: Tire, Brake, Suspension, Steering, Transmission, Gear and Aerodynamics.</p><p>None of the eight cars in the game are licensed or real models but they do seem very similar to actual models.</p><p>Almost all of the option and game screens are in English.</p><p>The course variety is pretty varied. There are three separate tracks with some minor route variations in each. Each course has 2-4 alternate segments that are turned on and off similar to Ridge Racer.</p><p>The graphics have some variety as well. The courses are: Sea Side (Easy), Mountain (Normal), and Down Town (Hard). The look and handling of each changes as well with weather variations such as rain and snow.</p>"},{"name":"Ms. Pac-Man Maze Madness","year":2000,"developer":"Namco Hometek Inc.","url":"0#Ms.%20Pac-Man%20-%20Maze%20Madness%20%28USA%29.zip","filesize":10429058,"score":7.3,"genres":"Action > Diagonal-down > Top-down > Puzzle elements","desc":"<p><em>Ms. Pac-Man Maze Madness</em> is a combination of classic Pac-Man (or in this case, Ms. Pac-Man) action, maze exploration and Sokoban-like puzzle elements. Players take on the role of Ms. Pac-Man and have to save Pac-Land once again. Although the game is in full 3D, players can only move along designated paths.</p><p>The four Wonders, mystical regions separated from the rest of Pac-Land by force fields, contains four Gems of Virtue: Generosity, Truth, Wisdom and Courage, each holding enough power to help keep Pac-Land safe from evil. However, an unknown enemy has transformed the Enchanted Castle into a haunted house, in turn starting a chain reaction of evil all around Pac-Land and the four Wonders. It is up to Ms. Pac-Man to enter the 3D designed worlds of the four Wonders and put the evil to rest for good.</p>"},{"name":"Mystical Ninja Starring Goemon","year":1997,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"0#Mystical%20Ninja%20Starring%20Goemon%20%28USA%29.zip","filesize":13332782,"score":7.9,"genres":"Action > 3rd-person (Other) > Anime / Manga > Platform > Puzzle elements","desc":"<p>The people of Oedo Town are in a panic! A gigantic UFO shaped like a peach has arrived, and the Peach Mountain Shoguns have turned Oedo Castle into one big stage for themselves to perform on! Everyone's relying on Goemon to save the day, but he hasn't even noticed what's happening! Can our hero stop the Shoguns before they do any more damage?</p><p><em>Mystical Ninja Starring Goemon</em> is an action game with light RPG elements, similar in style to The Legend of Zelda: The Ocarina of Time. It is also the first localized Goemon game since The Legend of the Mystical Ninja for the SNES. Players control Goemon and his friends as they make their way through Ancient Japan to stop the Peach Mountain Shoguns. You can talk to characters, whack enemies with your pipe (or hurl coins at them), visit a deranged fortune teller who shrieks out \"PLASMA!\" at random intervals for no reason, and more.</p><p>Each member of the Goemon team can also learn a special ability to access new areas as players progress through the game. Goemon earns the \"Sudden Impact\" power, which lets him move blocks he normally couldn't, Ebisumaru can shrink to small sizes so he can pass through tiny cracks, Sasuke earns an extra high jump, and Yae gets the ability to transform into a Mermaid so that she can swim underwater.</p><p>As usual, the gigantic roller-skating robot, Impact, makes an appearance. Players get to use him to trample down buildings and duke it out in first-person mode against gigantic mecha boss characters in a Punch-Out!! style game.</p>"}]