[{"name":"Nagano Winter Olympics '98","year":1997,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"0#Nagano%20Winter%20Olympics%20%2798%20%28USA%29.zip","filesize":9899396,"score":6.4,"genres":"Sports > Behind view > Tricks / stunts > Olympiad / mixed sports > Snowboarding / skiing > Licensed","desc":"<p>The official game of the XVIII Olympic Winter Games held in Nagano, Japan, including 12 events such as Downhill, Giant Slalom, K-90 and K-120 Ski Jumping, Freestyle Aerials, Snowboard Halfpipe (only in the N64 version) and Slalom (in their Olympic debut), 500m and 1500m Speed Skating, Bobsleigh, Luge and Curling. Up to four players can choose one of 16 nations and compete in Olympic (play for the medals) or Championship mode (for the points, in a Decathlon-style competition).</p>"},{"name":"Namco Museum 64","year":1999,"developer":"Mass Media, Inc.","url":"0#Namco%20Museum%2064%20%28USA%29.zip","filesize":3069440,"score":6.9,"genres":"Compilation","desc":"<p>This compilation contains:</p><ul><li>Pac-Man</li><li>Ms Pac-Man</li><li>Dig Dug</li><li>Pole Position</li><li>Galaga</li><li>Galaxian</li></ul><p>Information, sketches and pictures for each title are available.</p>"},{"name":"NASCAR 2000","year":1999,"developer":"Stormfront Studios","url":"0#NASCAR%202000%20%28USA%29.zip","filesize":9672576,"score":6.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>This NASCAR stock car racing simulation is a sequel of sorts to NASCAR Revolution. The game features 18 real world tracks plus several fantasy road courses, and 30 active NASCAR drivers plus some \"legend\" drivers.</p><p>Game modes include quick races, full weekend events, a full or abridged championship series, a Race Against the King mode where you race against Richard Petty in a series of events, and multiplayer support for up to 4 players. Updated physics and AI help the game aim for more realism.</p>"},{"name":"NASCAR 99","year":1998,"developer":"Stormfront Studios","url":"0#NASCAR%2099%20%28USA%29.zip","filesize":10260939,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>NASCAR 99</em>, the arcade-style racing game from EA and Stormfront Studios. In addition to 2-player simultaneous racing the game featured 37 officially licensed cars and 17 tracks, as well as the voices of Bob Jenkins and Benny Parsons commentary.</p><p>Using the Andretti Racing engine, NASCAR 99 was EAs first entry into NASCAR racing for the Nintendo 64 and PlayStation.</p>"},{"name":"NBA Courtside 2: Featuring Kobe Bryant","year":1999,"developer":"Left Field Productions, Inc.","url":"0#NBA%20Courtside%202%20featuring%20Kobe%20Bryant%20%28USA%29.zip","filesize":14235321,"score":7.9,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>Kobe Bryant teams up with Nintendo for a second time. For this update to NBA Courtside, all the team and player statistics, moves and jersey changes have been added to the available roster, etc. </p><p>There are now more options available for each play mode, such as the ability to play multiple seasons in the regular season mode, play a Three-point contest, as well as more options when creating your own player in create-a-player mode.</p><p>Further improvements to the player movement, AI and animation have been made, including new moves such as the no-look pass and new dunk styles, once again motion captured from Kobe Bryant.</p>"},{"name":"NBA Hangtime","year":1996,"developer":"Midway Manufacturing Company","url":"0#NBA%20Hangtime%20%28USA%29.zip","filesize":10505437,"score":7.2,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Basketball > Licensed","desc":"<p><em>NBA Hangtime</em> is a 2-on-2 arcade basketball action game following in the footsteps of NBA Jam. All NBA teams, each featuring 4 players to choose from, are included along with fast paced, over-the-top basketball, disregarding the normal rules of the game but including fouls and out of bounds. You can also create your own player, with a collection of body parts and clothing to choose from.</p>"},{"name":"NBA in the Zone '98","year":1998,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"0#NBA%20in%20the%20Zone%20%2798%20%28USA%29.zip","filesize":9981234,"score":6.8,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p>This fully licensed NBA title features all teams and players from the NBA for the 97/98 season, allowing Exhibition, Season, Playoff and All-Star modes for 1-4 players.</p><p>Full teams stats, info and schedules are included, along with a complete list of options to create the game you want (from the length of each match, rules, control schemes, difficulty and more).</p>"},{"name":"NBA in the Zone '99","year":1999,"developer":"Konami OSA Ltd.","url":"0#NBA%20in%20the%20Zone%20%2799%20%28USA%29.zip","filesize":10340642,"score":6.3,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p>Konami's second attempt of NBA basketball features all the options from the '98 title plus new motion captured moves, an icon passing system, on the fly play calling and up-to-date rosters and stats for the 98/99 NBA season.</p><p>A new three point contest is included to go with the Exhibition, Season, Playoff and All-Star modes.</p><p>All this and the voice of Chicago Bull public announcer Ray Clay.</p>"},{"name":"NBA in the Zone 2000","year":2000,"developer":"Konami OSA Ltd.","url":"0#NBA%20in%20the%20Zone%202000%20%28USA%29.zip","filesize":14118953,"score":6.2,"genres":"Sports > Basketball > Licensed","desc":"<p>The third in the In the Zone titles features all the usual options you come to expect from an NBA simulation title, including Season, Exhibition, Playoff, All-Star, Slam Dunk and three point shoot-out contests.</p><p>Fully licensed, the game features all the latest players, stats and teams from the NBA 99/2000 season, plus the icon-passing and on the fly play calling for a complete basketball game. Commentary again features the voice of Ray Clay.</p>"},{"name":"NBA Jam 2000","year":1999,"developer":"Acclaim Studios Salt Lake City","url":"0#NBA%20Jam%202000%20%28USA%29.zip","filesize":14839736,"score":7.1,"genres":"Sports > Diagonal-down > Arcade > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p><em>NBA Jam 2000</em> is a basketball game with the official NBA license. Besides the updated teams and graphics, the main addition to its predecessor is the new action-oriented Jam mode. It makes away with all the rules and has two-on-two matches. After three strikes in a row, the ball is set on fire and can be used to perform special moves.</p><p>The simulation mode is mostly the same as before and allows to play a whole season (optionally with basic management options which concentrate on trading athletes), a custom season, play-offs, shoot-out or exhibition matches. Other options are a basic editor to create a new athlete and training. During the matches, the player directly controls the athletes.</p>"},{"name":"NBA Jam 99","year":1998,"developer":"Iguana West","url":"0#NBA%20Jam%2099%20%28USA%29.zip","filesize":11174477,"score":6.8,"genres":"Sports > Diagonal-down > Arcade > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p>NBA Jam returns, this time removed of its flashy jams and flaming basketballs, replaced with a full simulation of basketball complete with all teams and players of the 99 season, full create-a-player and create-a-team modes, season, exhibition and shoot out modes.</p><p>Total team management is also included, with the ability to trade, release and sign new players as well as scouting reports. 4 player multiplayer is also supported.</p>"},{"name":"NBA Live 2000","year":1999,"developer":"Electronic Arts Canada","url":"0#NBA%20Live%202000%20%28USA%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":13085105,"score":7.8,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>Basketball.  Michael Jordan. Facial Animations and speech. Jordan. All the players from the 1999 - 2000 NBA season, including rookies. Plus All-Stars teams from past and present. Oh, and Jordan's back. </p><p>Like its predecessors in the long-running  series, <em>NBA Live 2000</em> strives for realistic basketball simulation rather than arcade-like gameplay. New moves have been added in this installments, and opponent AI has been tweaked to make victory more dependent on executing the right moves at the right times. As in the previous <em>NBA Live</em> games, it is possible to edit and create basketball players, as well as create and build an own team. This time, it is also possible to use any picture to serve as a player photo.</p><p>New to this installment (beside Jordan) is a one-on-one street basketball mode, and a mode that allows management of a team for several seasons, including trading players.</p>"},{"name":"NBA Live 99","year":1998,"developer":"NuFX, Inc.","url":"0#NBA%20Live%2099%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":12297075,"score":7.8,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>Play through the 98/99 NBA season to build up your team over time. Or just jump straight to the playoffs. Trade, release or pick up free agents to add to your team. Have a bit of fun with the 3 point shootout mode. And a host of new player animations, including facial animations, and player moves.</p>"},{"name":"NBA Showtime: NBA on NBC","year":1999,"developer":"Midway Games, Inc.","url":"0#NBA%20Showtime%20-%20NBA%20on%20NBC%20%28USA%29.zip","filesize":14839032,"score":6.9,"genres":"Sports > 3rd-person (Other) > Direct control > Basketball > Licensed","desc":"<p><em>NBA Showtime: NBA on NBC</em> is a descendant of the original NBA Jam, and is created by some of the key team members. The game follows in the footsteps of NFL Blitz, featuring the option to save personal records and a cheat code system operated by pressing a sequence of buttons. It also features unlock-able characters, including NBA team mascots, and the \"On-Fire\" option that defines Midway's sports games. Players are able to perform special moves such as the alley-oop, the spin move, and the double dunk. The game also features a Create-a-Player mode that allows custom players to have tweaked abilities by winning matches.</p><p>NBA Showtime debuted as an arcade game featuring rosters from the 1998-99 NBA season as well as secret characters based on the Universal Monsters. The later home console ports of the game use updated rosters for the 1999-2000 season and lacks the Universal Monsters characters. An arcade update was released in 2000 with refreshed rosters as <em>NBA Showtime: NBA on NBC - Gold Edition</em>.</p>"},{"name":"Neon Genesis Evangelion","year":1999,"developer":"BEC Co., Ltd."},{"name":"New Tetris, The","year":1999,"developer":"H2O Entertainment Ltd.","url":"0#The%20New%20Tetris%20%28USA%29.zip","filesize":10228231,"score":7.9,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p>In this new version Tetris, from the same people that brought Tetris into the 3D sphere world, you can now play a 4 player game, and dump your cleared lines to another player using 'garbage'.</p><p>In the single player mode, the total lines cleared in every match that you play are added up, and once you reach a certain amount, a famous monument will be unlocked, and you can view them from all angles in full 3D.</p>"},{"name":"NFL Blitz","year":1998,"developer":"Midway Games, Inc.","url":"0#NFL%20Blitz%20%28USA%29.zip","filesize":13761531,"score":7.7,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>NFL Blitz</em> gives the National Football League the same over-the-top treatment that Midway had used so effectively with NBA Jam. Features include exaggerated muscle-bound player models, \"turbo\" buttons, fast action, and some pretty wild rules changes (like 30 yards for a first down!). Blitz is nothing if not a unique football gaming experience.</p><p>Player taunts (\"This is MY HOUSE!\"), unpenalized late hits, and amusing running commentary from the announcers (\"That was totally uncalled for -- but awfully fun to watch!\") all add to the game's violent charm.</p>"},{"name":"NFL Blitz 2000","year":1999,"developer":"Midway Games, Inc.","url":"0#NFL%20Blitz%202000%20%28USA%29%20%28Rev%201%29.zip","filesize":14410602,"score":7.4,"genres":"Action > Sports > Diagonal-down > Arcade > Football (American) > Licensed","desc":"<p>New edition of Midway's \"NFL Jam\" action/sports game where the emphasis is on bone-crushing action rather than sport simulation.</p><p>Additions this year come in the form of a season mode, a simpler passing system based on preset buttons (gone is the \"aiming\" mechanism) as well as a limited yet functional play-book editor.</p><p>Also included are new audible calls and voice-overs, smoother animations and new stadiums to play in.</p><p>Supports multiplayer gameplay of up to 4 players in one single machine! (two on keyboard, two on gamepads).</p>"},{"name":"NFL Blitz 2001","year":2000,"developer":"Midway Games, Inc.","url":"0#NFL%20Blitz%202001%20%28USA%29.zip","filesize":14498151,"score":7,"genres":"Action > Sports > 3rd-person (Other) > Real-time > Arcade > Football (American) > Licensed","desc":"<p>No refs... No rules... Just 'classic' gridiron. Late hits, pass interferences, and other penalties are encouraged (though you can't run offside). Cheerleaders in, well, cheerleading uniforms liven up the end of the first and third quarter and there's enough stats to make the mathematically inclined happy. However, the teams features are not entirely based on real life (Indy was at the top), and it is not as addictive as the old-fashioned PC games of the early 1990's, but still a good game for someone who doesn't mind not-so-classic, almost XFL style football.</p>"},{"name":"NFL QB Club 2001","year":2000,"developer":"High Voltage Software, Inc.","url":"0#NFL%20QB%20Club%202001%20%28USA%29.zip","filesize":10873127,"score":5.9,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>The final QC title on N64 follows in the similar footsteps of the previous three titles on the console, with a full on NFL football simulation with all the teams, players and stats.</p><p>Modes include Exhibition, Season, Practice &amp; Pro Bowl, with the option to play past NFL Super Bowl games or create your own custom simulation.</p><p>You can also create your own team and players, a full play book, and sign or trade players pre-season. Up to 4 players are supported.</p>"},{"name":"NFL Quarterback Club 2000","year":1999,"developer":"Acclaim Studios Austin","url":"0#NFL%20Quarterback%20Club%202000%20%28USA%29.zip","filesize":11248302,"score":5.7,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>QC returns for another season. For the third time around, improvements over the previous titles include far more player detail and animations during plays (thanks to 1200 motion captured moves) and more moves and strategies.</p><p>In terms of gameplay, the usual assortment of options are included, from full team management (trades, drafting, etc.) to create a player and create a team modes. Play with 4 people in Tournament, Season, Playoffs, Pro Bowl and Exhibition games, along with the chance to re-live past Super Bowls.</p>"},{"name":"NFL Quarterback Club 98","year":1997,"developer":"Iguana Entertainment Incorporated","url":"0#NFL%20Quarterback%20Club%2098%20%28USA%29.zip","filesize":7888974,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>Acclaim and Iguana come together for a full-on NFL football title. QC98 features full season, exhibition and playoff modes right through the the Super Bowl, with every team, player and stat from the 1998 season.</p><p>You can also play historic Super Bowl games from past years, where you play as a specific team at a point in one of the many games, and attempt to re-create history. And if that isn't enough, you can also read full profiles on every player in the league.</p>"},{"name":"NFL Quarterback Club 99","year":1998,"developer":"Iguana Entertainment Incorporated","url":"0#NFL%20Quarterback%20Club%2099%20%28USA%29.zip","filesize":11581742,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>Plenty of new additions have been made to this, the second Acclaim NFL title on the N64.</p><p>Updates to every team, from player stats to team records, are included, along with 6 European NFL clubs, while team plays and AI strategy features the mind of New York Jets offensive coordinator Charlie Weis, and all 32 Super Bowls can be re-written to your style.</p><p>Also included is a create a player mode; weekly, game and season awards; total team management options including trading, drafting and releasing players; 30 play books based on real team designs; Play-by-play from Mike Patrick, color calls from Randy Cross and referee calls from NFL's head of officials, Jerry Markbreit.</p>"},{"name":"NHL 99","year":1998,"developer":"Electronic Arts Canada","url":"0#NHL%2099%20%28USA%29.zip","filesize":11547598,"score":8.2,"genres":"Sports > Diagonal-down > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>After the award-winning NHL 98, EA worked to improve what was considered to be one of the most complete ice hockey games in the market. Along the usual and almost obligatory NHL roster updates, the International mode first featured in the previous version was expanded, allowing players to choose IIHF rules and rink size.</p><p>Graphically, the arena is more detailed with more rinkside features, and ice reflections, player faces were improved and stand more seamlessly into the model, enhanced motion capture result in better animated hits (with the ability to break the glass with a well-placed body check making a return), shots and saves, and finally an higher polygon count complete the graphic enhancements to the game.</p><p>As graphic changes aren't enough to make a game better, gameplay was also tweaked, with computer players being smarter, both in offense and defense. Shooting was tweaked (slap shots are easier to pull, players no longer skate in circles to do some backhand shots and must be facing the goal to shoot, particularly in one timers) and a new special move brings dekes, spin-o-ramas and the kind of moves Jágr, Fedorov and Selänne pull when one-on-one with the goalie. However, if the player gets too close to the crease, the referee might want to review the play in the new video goal judge, so the player must think twice before trying to pull a \"Brett Hull\". For newcomers to the sport, a new Beginner mode allows players to get used to the ice without having to concern with penalties or an overly strong opponent.</p><p>The season mode was also improved, with the players now having streaks that affect either positively or negatively his abilities. Debuting the Nashville Predators, players can either choose to play with their initial roster, or do a fantasy expansion draft.</p><p>Like in the previous year, Jim Hughson and Darryl Reaugh liven up matches with play by play and colour commentary.</p>"},{"name":"NHL Blades of Steel '99","year":1999,"developer":"Konami OSA Ltd.","url":"0#NHL%20Blades%20of%20Steel%20%2799%20%28USA%29.zip","filesize":9297168,"score":6.5,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>Konami returns to the ice rink, in this updated version of the NES classic, Blades of Steel.</p><p>On this occasion, all 27 NHL teams (featuring every player from the 98/99 season) are supported, along with the ability to create your own player.</p><p>Play modes include Exhibition, Season and Playoff, with up to 4 player support in Exhibition mode. Season and Playoff modes include the option to record all the stats made by each player in each game. You can also play as either All-Star teams.</p>"},{"name":"NHL Breakaway 98","year":1998,"developer":"Sculptured Software, Inc.","url":"0#NHL%20Breakaway%2098%20%28USA%29.zip","filesize":11378381,"score":7.3,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p>This ice hockey game has a playbook-based AI system based on the teams' actual playbooks allowing for specific teams to play their actual styles, with variable player size, from big defensemen to small speedy wingers. There is a total team management system to make trades, improve coaching, create draft picks and send players through training camps, or even send injured athletes for therapy.</p><p>The inclusion of all the marquee players such as Lemieux, Gretzky, Messier, Sakic, Hull, and others is mostly mandatory in sports games. Also, the hints about how to play each team from NHL player Keith Tkachuk are a useful resource.</p>"},{"name":"NHL Breakaway 99","year":1998,"developer":"Iguana West","url":"0#NHL%20Breakaway%2099%20%28USA%29.zip","filesize":9825037,"score":7.1,"genres":"Sports > Diagonal-down > Direct control > Hockey > Licensed","desc":"<p><em>NHL Breakaway 99</em> is the sequel to NHL Breakaway 98. It is the second and last part in Acclaim's NHL series for the Nintendo 64.</p><p>This new version includes new and updated rosters, teams and schedules. All 27 NHL team feature up to date stats and ratings from the 97-98 season. There are five game modes: exhibition, practice, season, shootout, and playoffs. A wide variety of settings can be set for each game including, injuries, fatigue, fighting and penalty options. </p><p>Winning a season gains you points that you can invest to decrease injury time, develop your players' skills and trade players.</p><p>In-game advice is provided by Steve Yzerman.</p>"},{"name":"Nightmare Creatures","year":1998,"developer":"Kalisto Entertainment SA","url":"0#Nightmare%20Creatures%20%28USA%29.zip","filesize":11626294,"score":7.2,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > Horror > Regional differences","desc":"<p>Adam Crowley, a once-respected scientist, now turned to black magic, has released a demonic contagion onto the streets of 1834 London. Based on the long-lost work of the Brotherhood of Hecate, it mutates its victim's bodies into grotesque nightmare creatures, and changes their minds into those of murderous brutes. When Dr. Jean F. began investigating, he was murdered. Now, as either his friend Ignatius Blackward, a priest and expert on the occult, or his daughter Nadia, a biologist and gymnast, fight against the creatures that roam the streets of London, the revived Brotherhood of Hectate, and the man behind it all, Adam Crowley.</p><p>Gameplay is 3rd-person action, with an emphasis on melee combat. Ignatius and Nadia have different fighting styles and special moves. To keep things moving, an adrenaline meter depletes, killing the hero if it ever runs out. Kill monsters to top it up again. Gather special items to use on enemies, or just kill them using basic weapons.</p>"},{"name":"Nuclear Strike 64","year":1999,"developer":"Tiburon Entertainment","url":"0#Nuclear%20Strike%2064%20%28USA%29.zip","filesize":18324565,"score":7.3,"genres":"Action > Diagonal-down > Shooter > Helicopter","desc":"<p>After the Middle East, South America, the United States, and the former U.S.S.R, this fifth installment of the Strike takes the action to the heart of Asia, following the trail of Colonel LeMonde, who has terrorized South East Asia. LeMonde is armed with one prototype nuclear missile warhead, modified to catalyze a chain reaction that can completely destroy the ozone layer and thus irradiate the Earth. The hunt for LeMonde will take the player from Indocine (intended to suggest Indochina, the mainland of South East Asia), to the South China Sea to combat Napoleon Hwong, then to the heart of North Korea to uncover the nuclear schemes of Kym Zung-Lee (intended to suggest Kim Jong Il), and finally to Siberia for a final battle. </p><p>With the aid of fellow operatives, the player pilots the Super Apache, a fictional helicopter variant that is armed with Hellfire and Sidewinder missiles as well as Hydra cannons. Various other vehicles are also available during the course of the game, including tanks and jet fighters.</p>"},{"name":"Nushi Tsuri 64","year":1998,"developer":"DDL Corporation"}]