[{"name":"O.D.T.","year":1998,"developer":"FDI","url":":O.D.T. (USA) (En,Fr,Es)","filesize":13692805,"score":"","genres":"Adventure","desc":"<p>O.D.T. is an action role-playing game with some platforming and puzzle-solving elements. The player can choose to control any of the four characters. Each of them has his/her own strengths and weaknesses: for example, Maxx has high defense, while the archbishop has access to powerful occult techniques. Defeating enemies rewards the player with experience points, which can be used to increase a particular parameter of a character, increasing his/her combat abilities.</p>"},{"name":"Off Road Challenge","year":1998,"developer":"Midway Home Entertainment, Inc.","url":":Off Road Challenge (USA)","filesize":8042920,"score":6,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p><em>Off Road Challenge</em> is an off-road truck racing game for the Nintendo 64. Like Cruis'n USA, it was also an arcade game ported over to the N64. Gameplay is similar to that of its predecessor, Super Off Road: The Baja. The player races against other off-road vehicles across various landscapes, while collecting nitros and gold along the way. Gold picked up on the course or earned from racing can be used to upgrade the vehicle. Once the player has completed the circuit, they move up to the next difficulty level and go through it again, keeping the upgraded truck.</p>"},{"name":"Ogre Battle 64: Person of Lordly Caliber","year":1999,"developer":"Quest Corporation","url":":Ogre Battle 64 - Person of Lordly Caliber (USA) (Rev 1)","filesize":35278454,"score":8.6,"genres":"Role-playing (RPG) > Strategy > Top-down > Turn-based > Fantasy","desc":"<p>Magnus Gallant leads the revolution for the kingdom of Palatinus. The kingdom's Lord, Holy Lodis Empire, is rumored to be planning the domination of the entire continent of Zeteginia. This creates concern among the people, and it is up to Magnus to rid the people of the Lord and free them from slavery forever.</p><p><em>Ogre Battle 64</em> is a semi-sequel to the original Ogre Battle, and is the third game in the series. Like its predecessors, the game is a tactical RPG. The main character, Magnus, leads many troops into each battle, and the player must control how each group attacks or defends, and whether straightforward attacks or magic shall be used.</p><p>Depending on the player's choices, there are branching levels, each with their own difficulty levels. The more battles the player faces and completes, the more experience each warrior in the team gathers.</p>"},{"name":"Olympic Hockey 98","year":1998,"developer":"Treyarch Invention, LLC","url":":Olympic Hockey 98 (USA)","filesize":5840489,"score":7,"genres":"Sports > 3rd-person (Other) > Hockey > Licensed","desc":"<p><em>Olympic Hockey 98</em> is a hockey game with the official IOC license of the Olympic Winter Games 1998 in Nagano. However, this game is identical to Wayne Gretzky's 3D Hockey; the only changes are swapped teams (14 national teams instead of 26 NHL teams) and the implementation of the Olympic tournament. The license does not cover the athlete's names, i.e. all athletes employed outside the NHL are replaced by generic ones.</p>"}]