[{"name":"Pachinko 365 Nichi","year":1998,"developer":"SETA Corporation"},{"name":"Paper Mario","year":2000,"developer":"Intelligent Systems Co., Ltd.","url":"0#Paper%20Mario%20%28USA%29.zip","filesize":22767904,"score":8.2,"genres":"Role-playing (RPG) > Side view > Turn-based > Japanese-style RPG (JRPG) > Platform","desc":"<p>Up in Star Haven, there exists a Star Wand that allows the stars to grant wishes to those who are pure of heart. The Star Wand is looked over by the Seven Star Spirits, who protect it in its sanctuary. However, Bowser attacks Star Haven, steals the Star Wand, and locks up the Star Spirits so that they cannot challenge his power. With his new powers, Bowser defeats Mario and lifts Princess Peach's castle into the air, taking her and all her guests as prisoners. Now, the only way to challenge Bowser's unbridled power is to rescue all seven Star Spirits, which have been imprisoned all over the land.</p><p><em>Paper Mario</em> is the follow-up to Super Mario RPG: Legend Of The Seven Stars. Basically, this is an RPG set in the Mario universe. Mario has the ability to gain experience and grow levels by defeating enemies and bosses. Mario also has the ability to recruit teammates to help him out in turn-based battles. As well, Mario can collect badges that will help his combat abilities, star pieces that he can trade for badges, and more items that he can use throughout the game. The Star Spirits will also aid him in his quest.</p><p>All the characters in the game are 2D within a fully 3D world. This gives the feeling that each character is made out of \"paper\".</p>"},{"name":"Paperboy","year":1999,"developer":"High Voltage Software, Inc.","url":"0#Paperboy%20%28USA%29.zip","filesize":6818205,"score":5.4,"genres":"Action > Isometric > Bike / Bicycling","desc":"<p><em>Paperboy</em> returns in this game with the same objectives as last time but with a new retro-3D look. As the paperboy the player must deliver a newspaper to each of their subscribers. The more papers the player delivers in the least amount of time, the better the chances of signing more subscribers. For each street, the player has a maximum number of subscribers that they need to sign-up before they can move onto the next, more challenging street (aka, the next level).</p><p>Each street includes objects that will get in the player's way (such as dogs, fire hydrants, etc.) as well as bonus objectives. Collecting three coins by knocking down people and items on the street will take the player to bonus levels, for instance, ranging from obstacle courses to catching fire flies. The player can win extra subscribers by completing these bonus levels.</p>"},{"name":"Penny Racers","year":1998,"developer":"Locomotive","url":"0#Penny%20Racers%20%28USA%29.zip","filesize":2535552,"score":6,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Vehicle simulator > Licensed","desc":"<p><em>Penny Racers</em> is a racing game with cartoonish, made-of-paper-like cars. There are thirteen cars which you can choose from and nine tracks in total – all available right from the start. It features two playable modes, Race Series and Time Trial, and a mode that allows you to create your own track. The game also supports up to four human players. </p><p>In <em>Race Series</em> you can select one of the thirteen cars and race in any of the nine tracks with five more competitors. You can only compete in Class C (lower difficulty) races at first but can unlock more if you finish within the first three positions. At the beginning of each race you are given the option to customize your car’s parts – parts like the car’s body, engine, tires, etc. – but only if you have more than one in stock for each category. New parts can be taken from the other cars at the end of each race but only if you are among the first three racers that cross the finish line. Also, each part has points and the sum of these points must not exceed the point limit for each difficulty. For example a basic brake part may add one point to the total sum (better parts add more points). If with all the other parts the sum of points exceeds a lets say point limit of six then you are not allowed to enter the race. The current mode supports up to two human players.</p><p><em>Time Trial</em> is the basic mode where you run against time. You can also load a previously saved ghost to race against.</p><p><em>VS Race</em> mode can be accessed only if three or four human players are selected. It has 8 tracks that are different from the ones of the other modes and these tracks have more obstacles. </p><p><em>New Track</em> lets you create your own custom made track. You can select the road type (on road/off road) and track type (circuit/stage). After the basic layout is selected you are taken on the “map” where you can choose from the available layers to make the track. You can also adjust the road’s height.</p>"},{"name":"Perfect Dark","year":2000,"developer":"Rare Limited","url":"0#Perfect%20Dark%20%28USA%29%20%28Rev%201%29.zip","filesize":30019233,"score":8.4,"genres":"Action > 1st-person > Shooter > Stealth > Direct control > Sci-fi / futuristic","desc":"<p>Joanna Dark is an agent for the Carrington Institute, a secret organization funded by anonymous sources and dedicated to protecting the world. Through their highly trained operatives and special devices (gadgets), Carrington keeps an eye on terrorists, world powers, and strange happenings. The speed at which the dataDyne corporation has established itself through the development of new technologies is starting to worry the institute. So when Carrington receives a message from Dr. Caroll, a scientist wishing to escape dataDyne, they send their best agent, Joanna, to infiltrate the company headquarters.</p><p><em>Perfect Dark</em> is a 3D first-person shooter similar to Rare's earlier GoldenEye 007, though with more of an emphasis on stealth. Joanna can pick up and use a variety of firearms, including shotguns, submachine guns, sniper rifles, various explosives, and others. In addition, she carries quite a few spy gadgets such as IR scanners, night vision, probes, and a deadly laptop. Most weapons have secondary fire modes and reloading them is displayed in an on-screen animation. </p><p>Shields are scattered through the stages and can be picked up for additional protection. There are no health-restoring items and Joanna cannot jump. Like <em>GoldenEye 007</em>, the game has three difficulty levels, with the higher ones featuring more accurate enemies, less ammo, and more objectives for the player to complete within each mission. Cutscenes with voice acting advance the story between missions.</p><p>The game also features a training mode set in the Carrington Institute. Completing the firing range challenge there unlocks the classic weapons from <em>GoldenEye 007</em>. In addition, the campaign can be played in a co-operative mode for two human players or one human player and up to three computer-controlled teammates (in split-screen mode), as well as in a \"Counter Operative\" mode, where one of the players takes control of an enemy and tries to stop Joanna from fulfilling her mission. </p><p>Multiplayer includes a variety of modes. Among those are the traditional deathmatch as well as the objective-based Capture the Flag and King of the Hill modes. Other scenarios and objectives include surviving as long as possible while carrying a briefcase, hacking computer systems with randomly placed data uplinks, and hunting down a single player as a team. Stages, teams, and weapon placement can be customized by players.</p><p>The Xbox 360 port has redone graphics to support a 1080p full HD resolution at 60 frames per second. It also incorporates full multiplayer support over Xbox LIVE.</p>"},{"name":"PGA European Tour Golf","year":2000,"developer":"Infogrames Studios Limited","url":"0#PGA%20European%20Tour%20%28USA%29.zip","filesize":14056960,"score":6.5,"genres":"Sports > 3rd-person (Other) > Golf > Licensed","desc":"<p><em>PGA European Tour</em> is a golf game that makes use of the official European Tour license. It offers only four courses, specifically Quinta do Lago in Portugal, Kungsängen in Sweden, Druids Glen and the K Club in Ireland. Players can choose to play a quick match, a non-tour golf game or participate in the real tour. The non-tour option includes several modes: in Strokeplay players need to get the least number of strokes in order to win, in Matchplay the goal is to win more holes, while in Skins holes are played for money (winners of holes one to six get 100 euros, seven to twelve - 200 euros, thirteen to eighteen - 300 euros). Up to four players can play non-tour games, and some options allow teams of two to face each other.</p><p>Participation in the tour itself is a simulation of the real thing. Players start as amateurs, and can select to play as one of 64 European golfers like Nick Faldo and Jose Maria Olazabal, or create their own custom character. To reach professional status it's necessary to reduce the handicap to zero and finish in the top 8 of the Amateur Challenge Tour. Reaching the top 8 of the Professional Challenge Tour guarantees an entry to the European Tour Qualifying School, the final hurdle before advancing to the European Tour. In order to keep playing there one must not fall out of the top 32 golfers in the rankings.</p>"},{"name":"Pilot Wings 64","year":1996,"developer":"Paradigm Entertainment Inc.","url":"0#Pilotwings%2064%20%28USA%29.zip","filesize":5104190,"score":8,"genres":"Action > Racing / Driving > Simulation > 1st-person > Behind view > Puzzle elements > Direct control > Flight / aviation > Helicopter > Vehicle simulator","desc":"<p><em>PilotWings 64</em> is the update to the original PilotWings for SNES. The gameplay is somewhere between a flight simulation and an action/arcade experience. Players start with a limited number of craft and earn access to other craft and bonuses upon successful completion of set criteria.</p>"},{"name":"Pocket Monsters Stadium","year":1998,"developer":"Nintendo Co., Ltd."},{"name":"Pokemon Puzzle League","year":2000,"developer":"Intelligent Systems Co., Ltd.","url":"0#Pokemon%20Puzzle%20League%20%28USA%29.zip","filesize":22673779,"score":7.8,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Tile matching puzzle","desc":"<p>Welcome to <em>Pokémon Puzzle League</em>! Being selected to participate in the Official Puzzle League Tournament is one of the greatest honors a Pokémon Trainer can earn. In this brand new type of Pokémon battle, you'll have to use your strongest Pokémon to compete against the very best Trainers in Puzzle League Village. </p><p>To succeed in Pokémon Puzzle League, your fingers have to be fast and your brain has to work even faster. True Pokémon Puzzle Masters will discover many ways to play the game, but the basic idea is to destroy puzzle pieces by matching up three or more blocks of the same color. </p><p>The more puzzle pieces you eliminate at the same time, the more points you'll score. If you're battling another Trainer, you can send powerful attacks to their puzzle board by completing big Combos and Skill Chains. If you can't clear your stack of puzzle pieces before they reach the top of the screen, you're doomed. </p><p>You'll discover many challenges as you travel through Puzzle League Village, from the exciting 3D Puzzle Mode to the brain-bruising exercises at Pokémon Puzzle University. The best way to experience Pokémon Puzzle League is to bring a friend along on your adventure. Heated two-player Pokémon battles are so intense and action-packed that you just might forget to breathe! </p><p>Are you ready for this new type of Pokémon Battle?</p>"},{"name":"Pokemon Snap","year":1999,"developer":"Nintendo Co., Ltd.","url":"0#Pokemon%20Snap%20%28USA%29.zip","filesize":9127090,"score":7.1,"genres":"1st-person > Rail shooter > Shooter > Fantasy","desc":"<p>As Todd Snap, an aspiring Pokémon photographer, you must travel through different environment types in order to photograph as many Pokémon as you can find. With the help of Professor Oak, you will discover new places to photograph Pokémon, ranging from those such as a volcano which houses Fire Pokémon to a jungle housing Grass Pokémon. The game features 63 of the original 151 Pokémon, including favorites such as Pikachu and Charizard.</p><p>Throughout your journey as a Pokémon photographer you will obtain new items from Professor Oak to help snap a photo of those Pokémon whose attention you just can't seem to attract. At first you are equipped with only an apple, but by taking great photos of various species you will get access to items such as a Pester Ball or a Poké Flute. Gameplay is similar to that of a rail-shooter, in which you move across a linear route and are only able to look around to take pictures. At the end of each route you receive a score from Oak depending on things such as the position of the Pokémon in the frame shot, the size of the Pokémon in the picture, or how many of that Pokémon are together in the shot. Up to 60 photos can be taken during each course and you choose the one to submit to Oak. All the photos you take can later be accessed in your own Pokémon album. The game features six different courses, but a seventh one can be unlocked by taking a picture of a mysterious Pokémon sign in each of the other courses. The seventh course known as Rainbow Cloud offers the only opportunity to snap a photo of the rare and elusive psychic Pokémon, Mew.</p><p>When released for Virtual Console on the Wii, a couple changes were made to the game. First, Jynx's skin color was changed from black to purple to match its current design and avoid the controversy its original design had caused due to its resemblance of the blackface caricature. Second, in order to mimic the functionality of the Pokémon Snap Stations found in stores that let players bring in their cartridges and print their pictures, a feature was added that let players upload one picture each day to the Wii Message Board to share with people on their friend list.</p>"},{"name":"Pokemon Stadium","year":1999,"developer":"Nintendo EAD","url":"0#Pokemon%20Stadium%20%28USA%29%20%28Rev%202%29.zip","filesize":27788694,"score":7.3,"genres":"Role-playing (RPG) > 3rd-person (Other) > Turn-based > Fantasy","desc":"<p>The Nintendo Pokemon creations make their way to full 3D battles in a recreation of the Pokemon battle sequences seen in the cartoon series. All 151 original Pokemon appear in some way or form, either for you to battle with, against or for use on the Game Boy Pokemon series.</p><p>Using the Transfer Pak (plugged into the slot in the N64 controller) and a copy of any Game Boy Pokemon title, you can upload your Pokemon for battle in full 3D in either a full-on tournament (where you can win badges, money, items and pokemon), play mini-games or battle against friends.</p><p>And after the battle, any experience, pokemon or items gained can be transfered back to the Game Boy version.</p>"},{"name":"Pokemon Stadium 2","year":2000,"developer":"Nintendo Co., Ltd.","url":"0#Pokemon%20Stadium%20%28USA%29%20%28Rev%202%29.zip","filesize":27788694,"score":7.6,"genres":"Strategy > 3rd-person (Other) > Turn-based","desc":"<p>Battles are the aim of the game here, as the crazy critters, more commonly known as Pokémon, return to the N64.</p><p>Once again, you have the option of building a team of battle ready warriors for a range of battles against other Pokémon trainers. Along the way, you will get the chance to fight for a range of Poké-cups, or take your Pokémon for a ride to a collection of mini-games for bonus prizes (or just for the fun of it).</p><p>4 players can compete in the one tournament, while the transfer pak allows you to upload your Pokémon that you have from the range of Pokémon Game Boy Games (including the original Pokémon Red and Blue, and the GBC Gold/Silver series). If you don't have the Game Boy games, you can choose from a selection of Pokémon straight out of the box to get into the fight without mucking around.</p>"},{"name":"Pokemon Stadium Battle Set","year":2000,"developer":""},{"name":"Polaris SnoCross","year":2000,"developer":"Vicarious Visions, Inc.","url":"0#Polaris%20SnoCross%20%28USA%29.zip","filesize":8840372,"score":6,"genres":"Racing / Driving > Sports > 1st-person > 3rd-person (Other) > Tricks / stunts > Snowmobile > Licensed","desc":"<p>As the title implies, <em>Polaris SnoCross</em> is a game based on the sport of snowmobile racing. It has 3 available modes (Single Event, Instant Action, and Tournament) and supports up to 4 players.* In <em>Single Event</em>, the player can select any of the 5 sleds available for racing. The player can also select the rider suit and the race’s difficulty. Tricks and stunts can also be performed while in-game. The current mode supports up to 4 human players.</p><ul><li><p><em>Instant Action</em> instantly lets you in on the game by randomly selecting the sled, track, time of day and weather conditions.</p></li><li><p>In <em>Tournament</em>, the player can select to play in a new one or continue from a previously saved game. There are 7 events in the Tournament mode and each one consists of a 3 day race (3 races basically). Only one is available at first but each time the player successfully complete an event another of higher difficulty is unlocked.</p></li></ul>"},{"name":"Powerpuff Girls, The: Chemical X-Traction","year":2001,"developer":"VIS Entertainment Limited","url":"0#The%20Powerpuff%20Girls%20-%20Chemical%20X-Traction%20%28USA%29.zip","filesize":3880996,"score":5.7,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > Licensed","desc":"<p>The Powerpuff Girls must battle enemies in a variety of settings in order to reclaim Chemical X and track down Mojo Jojo.  </p><p>In the story mode, players can pick up objects and throw them at an enemy to decrease their opponents health meter. They can use superpowered attacks by collecting vials of Chemical X.  If the player successfully defeats the enemy in two out of three rounds, they move to the next enemy location.</p><p>Players can play the story mode or can battle against a friend in a head-to-head battle.</p>"},{"name":"Premier Manager 64","year":1999,"developer":"Dinamic Multimedia, S.A.","url":"0#Premier%20Manager%2064%20%28Europe%29.zip","filesize":11721976,"score":7.1,"genres":"Sports > 3rd-person (Other) > Managerial / business simulation > Football (European) / Soccer","desc":"<p>Unlike the data update that is PM98, Ninety Nine (the actual title of the game) uses Dinamics' PC Fútbol 6 engine to go along the obligatory 1998-99 squad updates. Among the new features, it is now possible to make more than one player bid at the same time, more frequent and detailed staff messages, player history to track down previous seasons, a full 3D match engine and a 2D radar view (replacing the old text mode) and finally merchandising and catering, and individual adboard management. The detailed database is still there, and so are the Manager and Pro-Manager modes. Only the English leagues are playable still and Kevin Keegan, Fulham and then soon-to-be England manager, endorsed the title.</p><p>The manager modes and options remain the same: Manager allows the player to start in any team, Pro-Manager requires building a career from the Conference, promoting the club from the lower divisions or getting promoted himself to better ranked teams. The difficulty level can be further tweaked by changing areas where the staff takes control, and you can determine if players age and retire with time.</p><p>Again, up to 20 players can play in Manager mode and 8 in Pro-Manager.</p>"},{"name":"Puyo Puyo Sun","year":1997,"developer":"Compile"},{"name":"Puyo Puyo~n","year":1999,"developer":"Compile"}]