[{"name":"Quake","year":1998,"developer":"id Software, Inc.","url":":Quake (USA)","filesize":11579496,"score":8.1,"genres":"Action > 1st-person > Shooter > Direct control > Fantasy","desc":"<p>An enemy with the codename ''Quake'', which is believed to come from another dimension, is using teleporter gates to invade Earth. The player takes the role of a nameless soldier who arrives at his base only to find out Quake has overrun it and killed everyone. Somewhere in the base, there must be a teleporter to Quake's realm. The mission is clear: take the fight to the enemy, overcome countless hordes of monsters, and exact revenge.</p><p>id Software's follow-up to Doom and Doom II, <em>Quake</em> is a first-person shooter. Its main technological innovation is the use of a true 3D engine - the levels themselves, as well as the enemies, are polygonal. This not only allows for more natural level-designs and character animations, but also for more realistic lighting and the inclusion of simulated physics that have an effect on gameplay: grenades can bounce off walls and around corners, for example.</p><p>In single-player mode, gameplay consists mainly of proceeding through the levels (spread over four distinct episodes) in search of an exit, killing everything that moves. Interaction with the game world is reduced to a minimum: since there is no use key, buttons are pressed by running into or shooting at them. As in id's earlier games, many secrets are waiting to be discovered, including a few hidden levels.</p><p>Unlike Doom's rather straightforward design that couples futuristic environments with demonic imagery, the theme of Quake's levels, enemies, and weapons is not so easily pinpointed. While each episode begins in a futuristic military base (with a technological 'slipgate' as the level exit), later levels take place in environments inspired by medieval fantasy and gothic horror (castles, dungeons, and caverns) and the player passes through magical portals to advance. In a departure from Doom's colorful environments, all Quake levels are dominated by earth colors.</p><p>The enemies conform to the mishmash of designs: there are human opponents armed with shotguns and energy weapons in the early levels, while the later levels include medieval knights, ghosts, zombies, ogres (armed with grenade launchers and chainsaws), and some more unearthly beasts. The player's weapons, while relatively modern, all have a low-tech feel. Besides a (bloodstained) axe, there are shotguns, nailguns, rocket and grenade launchers, and the Thunderbolt, which discharges electrical energy.</p><p><em>Quake</em> was one of the first games playable natively over the Internet in addition to LANs. The single-player levels can be played cooperatively, but the game is most famous for its deathmatch mode. One-on-one duels, team play, and free-for-all competition are possible. The emphasis is on fast reaction and skillful maneuvering through the levels. All of the single-player maps can be used as arenas, but the game also comes with six maps specially designed for deathmatch.</p>"},{"name":"Quake II","year":1999,"developer":"Raster Productions L.L.C.","url":":Quake II (USA)","filesize":11788260,"score":7.2,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>This version of Quake II differs from the other releases by replacing most of the levels with new ones. Some of the levels have familiar themes or even re-create the original ones closely; however, new stages are dominant, tending to be significantly shorter than those of the PC version. This release also features additional graphical effects, such as lighting during gunfire. Multiplayer for up to four participants is included.</p>"},{"name":"Quest 64","year":1998,"developer":"Imagineer Co., Ltd.","url":":Quest 64 (USA)","filesize":7044557,"score":6.3,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Fantasy","desc":"<p>The young hero Brian is tasked with a quest to save the land of Celtland. Brian's father, Lord Bartholomy, has mysteriously disappeared. The Eletale Book has also been stolen, which preserves harmony in Celtland. Brian must find his father and bring back the Eletale Book. In his journey he will travel linearly through the land, passing through towns, dungeons, and paths filled with monsters.</p><p><em>Quest 64's</em> combat exists in a mixture of turn-based and real-time inputs. In combat Brian and his opponents take turns moving and selecting spells to attack each other with. With luck and diligence attacks can sometimes be avoided manually. Brian has four schools of magic he can draw from; Air, Earth, Water, and Fire, and each can be strengthened with mana points gained from leveling or found in the world. Strengthening a school of magic makes it more powerful and unlocks new spells. Brian can carry items to heal or temporarily boost his stats, but there is no equipment in the game. The North American version of the game also has no in-game currency; some villagers will offer items, and free replacements if they are used, but items found in dungeons are used once and can never be replaced.</p>"}]