[{"name":"Rakugakids","year":1998,"developer":"Konami Computer Entertainment Kobe, Inc.","url":":Rakugakids (Europe)","filesize":11108459,"score":6.6,"genres":"Action > Side view > Anime / Manga > Fighting","desc":"<p>It was school holidays, and the Twinkle gang of schoolkids sailed to an island where they found a cave with crayons hidden inside. They split them among the group, but before they had finished, a bully came and stole the pack along with the last two crayons! He drew a mischievous-looking character, who came to life and said \"Let's cause trouble!\" Twinkle Town was terrified of the bully and his crayon character, so the Twinkle gang decided to draw their own superheroes to stop the bully!</p><p><em>Rakugakids</em> is a 2D fighting game, similar to Marvel Vs. Capcom. You select from a variety of hand-drawn cartoon characters, and fight using low, middle and high punches and kicks. As you'd expect with this type of game, special button combinations yield special, more powerful moves. There is also a 'crayon meter' that fills the more you attack your opponent - when it is completely filled, you can pull off a devastating special move.</p><p>The kids' characters are a lively bunch, full of an assortment of crazy moves. There's Robot C.H.O., who is a robot that turns into different metal objects on the fly, such as a car, garbage can, rocket, and more. There's BearTank, which is a green teddy bear with gun turrets on it. Captain.Cat.Kit is a DJ cat with slick basketball moves who also attacks with a variety of musical instruments.</p><p>An interesting feature of Rakugakids is that Story Mode can be played by using \"Training Mode\". In this mode, you select a character, and train them up by playing matches against any character you like. It is beneficial to train more, because you can choose to play Story Mode in 'Battle Mode'. This mode automatically plays the game for you using your trained up character. If you've trained enough, your character will react to opponent attacks in the same way that you yourself would.</p>"},{"name":"Rally Challenge 2000","year":2000,"developer":"Genki Co., Ltd.","url":":Rally Challenge 2000 (USA)","filesize":9909352,"score":6,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Licensed","desc":"<p><em>Rally Challenge 2000</em> is a racing game for the N64 and features 9 courses in different countries around the world, licensed cars including Subaru Impreza, Mitsubishi Lancer Evolution, Toyota Corolla, etc. and with each car having its own strengths and weaknesses, car damage, various weather conditions and 4 modes.* Arcade - you must simply select one of the 3 difficulty settings, one of the available cars and compete with the other 8 CPU players for the first place. Each difficulty setting has 3 races and the place you manage to get at the end of each race is carried on to the next one. Car damage does not apply in this mode.</p><ul><li>Championship - you race in a total of 9 rounds with 3 laps per round. In each round you get points depending on what position you finished in and in the end these points are accumulated to decide your final ranking. In this mode you can see the damage inflicted on the car, not on the car itself but on an icon on the left part of the screen. Effects from the damage include lesser top speed, slower acceleration and bad steering. It is also possible to customize certain options like tires, steering, etc., to get the best possible performance depending on the weather condition on each course.</li><li>Practice - mode where you can learn the controls and get acquainted with the various courses of the game.</li><li>Vs Race - allows up to 4 players to play simultaneously in any of the game’s courses.</li></ul>"},{"name":"Rampage 2: Universal Tour","year":1999,"developer":"Avalanche Software LLC","url":":Rampage 2 - Universal Tour (USA)","filesize":10992173,"score":5.4,"genres":"Action > Side view > 2D scrolling > Arcade","desc":"<p>While technology may improve graphics and sound, some things never change. <em>Rampage 2: Universal Tour</em> is very much in tune with its history, barely deviating from the original city-stomping arcade game appearing in the 1980s. Like its predecessor, Rampage World Tour, <em>Rampage 2</em> retains the original 2D worlds, but improves the graphics, completely re-rendering the characters. The premise remains the same: stomp out cities and wreck things in general. Some new features in <em>Rampage 2</em> include four new characters (in addition to the original three), new attacks and combos, a power meter, and bonus rounds. Up to three people can play at once and there are plenty of new cities to destroy.</p>"},{"name":"Rampage World Tour","year":1998,"developer":"Game Refuge Inc.","url":":Rampage - World Tour (USA)","filesize":10428966,"score":5.9,"genres":"Action > Side view > 2D scrolling > Arcade","desc":"<p><em>Rampage World Tour</em> is an updated version of the classic Rampage. Rampage World Tour starts off at Scumlabs International where three lab technicians, George, Lizzy, and Ralph have mutated in an accident involving toxic waste. George has turned into a gigantic ape, Lizzy a gigantic lizard or dinosaur, and Ralph some sort of gigantic wolf. The three destroy the lab they previously worked at and then embark on a path of destruction encompassing the entire globe.</p><p>The player chooses one of these three characters and begins destroying buildings, eating civilians, knocking planes out of the sky, and stepping on tanks. The ultimate goal of the game is to rid the world of Scumlabs by traveling to the cities where they are located. Being creatures of such massive size, there are many cities that must be destroyed along the way. Scumlabs and the various militaries make it a priority to destroy you and optionally another player that can play simultaneously.</p><p>The graphics are worth noting as they are of a unique, colorful \"cartoon\" flavor. Gameplay includes players climbing buildings while punching, kicking, and eating their inhabitants to destroy them. Once all the buildings for a particular stage have been destroyed, the stage is clear and players proceed to the next stage. Players can get many different kinds of power-ups that make them more powerful or restore health.</p>"},{"name":"Rat Attack!","year":2000,"developer":"Pure Entertainment Games Plc","url":":Rat Attack! (USA) (En,Fr,De,Es,It,Nl)","filesize":4849614,"score":5.9,"genres":"Action > Top-down > Puzzle elements","desc":"<p>Play as one of the Scratch Cats, an elite superhero team, who are out to save the world from Washington and Jefferson, two evil mutant space rats who wish to enslave the world in rats.</p><p>Explore each puzzle level and wipe out the rat threat. First you need to catch the rat, using the Eraticator. Then you must find the Destructor pad in each level in order for the rat to be taken out. Each level has a quota of rats you must remove, and if you fail to do so within the time limit (which, in this case, is when the rats destroy everything in the level), you lose.</p>"},{"name":"Rayman 2: The Great Escape","year":1999,"developer":"Ubi Soft Entertainment Software","url":":Rayman 2 - The Great Escape (USA) (En,Fr,De,Es,It)","filesize":19095848,"score":8,"genres":"Action > Behind view > Platform > Direct control > Fantasy","desc":"<p>Admiral Razorbeard and his gang of robot pirates have enslaved all the creatures in Rayman's world, including the peaceful Teensies and the Lums, which give life to the earth. Rayman has been captured by the pirates as well and is lamenting his troubles in his prison cell when he meets his good friend, Globox. Globox has smuggled in a silver Lum, given to him by the great fairy, Ly. With the power of the silver Lum, Rayman is able to once more shoot his fists. With his power restored, the pair escape the flying prison ship and embark on another adventure to save the entire world!</p><p><em>Rayman 2: The Great Escape</em> is the sequel to Rayman, a 2D side-scrolling platform game. Unlike the previous game, <em>Rayman 2</em> is entirely in free-roaming 3D environments, similar to Super Mario 64. Rayman has many unique abilities that can help him get around the world. In addition to being able to shoot his fists, he can use his hair to hover like a helicopter, and even glide on air currents in certain places. He can climb certain walls and ceilings and can even use his fists to swing from special purple Lums which are shaped like rings. Rayman also has many unique items at his disposal, such as powder kegs which can be carried or fly like jets, strange warheads with legs that he can ride and steer like bucking mules, and gigantic plums that can be thrown into the water to create new paths.</p><p>Rayman's goal is to find the four masks of the world, which allow the owner to reawaken Polokus, the spirit of the world. These masks are scattered far and wide, and are well hidden and guarded, so it is not an easy task. By gathering the yellow Lums, Rayman will gain access to new worlds, which will take him to the locations of new masks. Collecting yellow Lums also rewards him with new powers and life meter extensions.</p><p>The Nintendo 64 and Windows platforms are the original versions of the game. The Nintendo DS version sticks closest to this version.</p><p>The Dreamcast version adds a new area to the original version called Globox Village which contains exclusive mini-games. The mini-games are unlocked by collecting six hidden Globox crystals. Also, other changes include The Hall of Doors being changed into a new place called The Isle of Doors and more Robo-Pirates to contend with, including a new type not seen in the original version. The iOS and Nintendo 3DS versions are based on this version but don't include the Globox Village section. However, the 3DS version features a dynamic difficulty curve, with the game getting easier if too many lums are missed.</p><p>The PlayStation version features a heavy alteration of the levels with some being merged and some being removed altogether, although there are also some new areas as well. This includes a new unlockable bonus area that was from the originally planned 2D version of the game that was scrapped. The amount of collectible Lums was reduced from 1,000 to 800. In this version characters are also voiced with actual real languages instead of the whisper speak of the other versions. </p><p>The PlayStation 2 version adds minigames, exclusive items like the Lumz Radar, and offers more abilities for Rayman to purchase and use.Along with some expanded level revisions with lums being placed in different locations, there are three new bosses to contend with. The Hall of Doors has become hub locations, The Minisaurus Plain, Globox's House, and The Rainbow Creek. Bonus challenges can also be played by freeing caged Familiar Spirits. These prisoners are exclusive to this version of the game. The game also gives the option to use either the real language voice-overs or the older version's style and lets players save mid-level.</p>"},{"name":"Razor Freestyle Scooter","year":2001,"developer":"Shaba Games LLC","url":":Razor Freestyle Scooter (USA)","filesize":7196877,"score":6,"genres":"Action > Behind view > Tricks / stunts > Licensed","desc":"<p><em>Razor Freestyle Scooter</em> is an extreme-sports style action game modeled around small, nimble scooters. In contrast to most games of this type, there is a story. A crazed giant robot has kidnapped your skating buddies. By completing skating challenges at the robot's sky fortress, you must rescue your friends.</p><p>You skate around 3 large areas and attempt to perform wild tricks, collect scooter wheels, and earn bonus time. By completing an objective on all 3 areas, you unlock a sky fortress level in which you can rescue a new skater to control.</p><p>Gameplay is based heavily on the Tony Hawk series of games. Tricks consist of button and direction presses, and can be strung together with grinds to create high-scoring combos.</p>"},{"name":"Re-Volt","year":1999,"developer":"Probe Entertainment Ltd.","url":":Re-Volt (USA)","filesize":10335976,"score":7.5,"genres":"Action > Racing / Driving > Behind view > Arcade > Direct control > Automobile > Track racing > Vehicle simulator","desc":"<p>For years, the Toy-Volt company has been producing toys and games for children all over the world. Within months of introducing their first products, Toy-Volt shot to the top! No one could put their finger on exactly what it was that made the toys so popular. Sure, they employed the best designers and marketers in the world, but there was something else about Toy-Volt toys, something almost.... magic. Now, their newest R/C cars really start to live! </p><p><em>Re-Volt</em> is a racing game where you take control over one of more than 28 R/C cars and drive on one of the 13 tracks. The tracks are varied, and include a toy shop, a supermarket, a luxury liner and more. It is possible to play a \"reversed\" (backwards) or \"mirror\" (reversed left and right) variety of each track. There are also 4 levels of realism to choose from. </p><p>There are a couple of single- and multiplayer game modes to choose from. There's a Single Race, where you complete a single track while competing with several computer-controlled opponents; a Championship, where you try to complete a series of races in hopes of finishing on the top; and Multiplayer, where you play with live opponents. There's also a Time Trial, where you're alone on the track, and simply try to get as best a time as possible; a Practice mode, where you're free to drive around a track to learn its structure and shortcuts; and the Stunt Arena, where you drive around a special arena and try to collect stars situated in hard-to-reach places. </p><p>In Single Race, Championship and Multiplayer there are power-ups scattered throughout the track; picking them up gives you a one-use random power, such as missiles to launch at pesky opponents, a star to temporarily freeze competitors in place or a lightning bolt, which makes your car shock opponents nearby to make them stop.</p>"},{"name":"Ready 2 Rumble Boxing","year":1999,"developer":"Midway Home Entertainment, Inc.","url":":Ready 2 Rumble Boxing (USA)","filesize":30184059,"score":7.7,"genres":"Sports > 3rd-person (Other) > Boxing > Licensed","desc":"<p><em>Ready 2 Rumble Boxing</em> is a cartoon style boxing beat 'em up with plenty of strange looking characters to choose from and beat the hell out of them. You can train your character up to the best of his/her ability and then fight the best in the world for the championship belt.</p>"},{"name":"Ready 2 Rumble Boxing: Round 2","year":2000,"developer":"Midway Games, Inc.","url":":Ready 2 Rumble Boxing - Round 2 (USA)","filesize":28775362,"score":7.5,"genres":"Sports > 3rd-person (Other) > Boxing > Licensed","desc":"<p><em>Ready 2 Rumble: Round 2</em> is a cartoon style boxing beat 'em up with plenty of strange looking characters to choose from and beat the hell out of. You can train your character up to the best of his/her ability and then fight the best in the world for the championship belt. </p><p>Round 2 adds some new play modes and characters into the mix of previous fighters. In this round, there are now 3 levels to the RUMBLE combo gauge (much like a Street Fighter game). Once you reach the third level, you can hit your enemy for six, out of the ring and into the crowd.</p>"},{"name":"Resident Evil 2","year":1999,"developer":"Capcom Production Studio 3","url":":Resident Evil 2 (USA) (Rev 1)","filesize":65096907,"score":8,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Shooter > Survival horror > Direct control > Contemporary > North America > Horror > Regional differences","desc":"<p>An update of Resident Evil 2, this time with Dual Shock support, a few new extras, and an added battle mode upon completion of the game.</p>"},{"name":"Ridge Racer 64","year":2000,"developer":"Namco Limited","url":":RR64 - Ridge Racer 64 (USA)","filesize":18786669,"score":8,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>Ridge Racer makes its first appearance on a Nintendo console, including all of the fast, pick up and play action previously seen in the series on Playstation and in arcades.</p><p><em>RR64</em> includes three tracks, each with three variations, making a total of nine tracks to get through. 25 cars are on offer, each with different power and speed abilities.</p><p>Single player and multiplayer modes are included. Beat the clock and get to the finish line first to win.</p>"},{"name":"Road Rash 64","year":1999,"developer":"Pacific Coast Power and Light","url":":Road Rash 64 (USA)","filesize":19102250,"score":6.3,"genres":"Action > Racing / Driving > Behind view > Motorcycle > Street racing","desc":"<p>The first version of Road Rash for any Nintendo console. The game was originally supposed to be a port of Road Rash 3D but ended up being an original product. Like other Road Rash titles, it featured motorcycle racing and combat, although <em>Road Rash 64</em> had more of an emphasis on combat than on racing.</p>"},{"name":"Roadsters","year":1999,"developer":"Titus Interactive, S.A.","url":":Roadsters (USA) (En,Fr,Es)","filesize":9039488,"score":6.3,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Licensed","desc":"<p><em>Roadsters</em> is a car racing game that features both licensed cars from manufacturers like Mitsubishi, Alfa Romeo, Lotus, etc., and unlicensed cars from imaginary manufacturers that are based and bear great resemblance to their equivalent, real car models. The game has 8 racers and 34 cars from which you can choose from and 4 modes in total:* <strong>Roadster Trophy</strong> – The player starts by selecting one of the available racers and is given a sum of money that must be used to acquire a car. There are 3 divisions in which the player can compete on with the 3rd being of the easiest difficulty and requiring less money to participate; the 1st being the most difficult one and needing a higher amount of money in order to participate. More money can be earned by winning the races and that in turn allows to buy new cars or upgrade the ones that are already in possession.</p><ul><li><p><strong>Multi-Player</strong> – Multi-player mode supports up to 2 human players that can compete in any of the available circuits with 4 more CPU controlled racers. The mode allows for either vertical or horizontal split screen. </p></li><li><p><strong>Quick Race</strong> – In Quick Race the player can select the racer, car, circuit and weather conditions, and race against 7 more CPU controlled players.</p></li><li><p><strong>Time Trial</strong> – Like Quick Race mode, the player can also select here the racer, car, circuit and weather conditions but without the competition of the other modes, the player races against time for as many laps as the player wants.</p></li></ul>"},{"name":"Robotech: Crystal Dreams","year":1995,"developer":"GameTek","url":":Robotech - Crystal Dreams (USA) (Proto 2)","filesize":7743390,"score":"","genres":"Flight > Action","desc":"<p>Crystal Dreams follows the adventures of Kyle Bartley, a disgraced Robotech Defense Force veritech mecha pilot turned mercenary who fights to protect the Earth and the SDF-3 from new Zentraedi enemies.</p>"},{"name":"Robotron 64","year":1998,"developer":"Player 1","url":":Robotron 64 (USA)","filesize":2471266,"score":6.8,"genres":"Action > Diagonal-down > Arcade > Platform > Shooter > Sci-fi / futuristic","desc":"<p>The retro shooter returns with the same addictive gameplay of the original arcade game, but now with the added power of the Nintendo 64.</p><p>The aim of the game is simple. Shoot all the enemies on each grid while saving the humans from certain death. Power-ups and items can be picked up to increase your shooting and speed ability, and the further you go in the game, the more enemies attack and the more difficult it gets to save the humans.</p><p>Options include the ability to plug in a second N64 controller for added control of the character on the game screen (i.e. two analog sticks). The brand new 3D engine, while sporting similar styled graphics that hark back to the 80's classic, also boasts fuller textures and greater mobility for the character.</p>"},{"name":"Rocket: Robot on Wheels","year":1999,"developer":"Sucker Punch Productions LLC","url":":Rocket - Robot on Wheels (USA)","filesize":8410327,"score":7.4,"genres":"Action > 3rd-person (Other) > Platform > Flight / aviation > Sci-fi / futuristic","desc":"<p>Whoopy World was finished. The high-tech theme-park would be opening tomorrow. How much Rocket, the maintenance robot, wanted to go and see it he could not even tell, but the professor barely noticed. Then it happened. Jojo the raccoon, sick of playing second banana to the insipid Whoopy the walrus, stole all of the tokens, tickets, and Whoopy. There was no time to tell anybody, Rocket had to go and stop Jojo alone.</p><p><em>Rocket: Robot on Wheels</em> is a 3D platformer like no other. It features 8 vehicles in 6 worlds all in unscripted, realtime physics. As Rocket you have to go through the worlds collecting (suddenly a dirty word) tokens and tickets and fixing machines to get the park up and running again. The vehicles are everything from a customizable roller-coaster to a paintball tank that allows you to paint the town red, or any other color you choose. In standard platformer fashion, tickets are hidden in out-of reach places or held by characters who give them to you, after you beat them at their own game. The realtime physics engine makes it even more interesting with objects actually tumbling and falling like they would in real life.</p>"},{"name":"Rugrats in Paris: The Movie","year":2000,"developer":"Avalanche Software LLC","url":":Rugrats in Paris - The Movie (USA)","filesize":11428681,"score":6.2,"genres":"Action > 3rd-person (Other) > Arcade > Platform > Licensed","desc":"<p><em>Rugrats in Paris: The Movie</em> is based on the 2000 Movie of the same name, which in turn is based on the Daytime Emmy-award winning animated television series.</p><p>Unlike the PC and Game Boy Color spin-offs from the movie, the Nintendo 64 and PlayStation games are 3D platform games.</p><p>Tommy Pickle's father has been sent to Europe for maintenance work at Euroreptarland. The Rugrats join him on his travel to Europe. There are 16 levels and hidden bonus level to play through.</p><p>The game consists of various mini-games that have to be completed in order to earn enough tickets to beat the game. Most tickets, however, can just be collected by running around the park and picking them up. Tickets can be used to buy prizes. There are ten mini games including whack-a-ninja, bumper cars and mini-golf.</p>"},{"name":"Rugrats: Scavenger Hunt","year":1999,"developer":"Realtime Associates Seattle Division","url":":Rugrats - Scavenger Hunt (USA)","filesize":13040756,"score":5.6,"genres":"Action > 3rd-person (Other) > Board game > Licensed","desc":"<p><em>Rugrats: Scavenger Hunt</em> is a party game based on the Daytime Emmy-award winning animated television series <em>Rugrats</em>. The game features three distinct board games that are represented in 3D similar to Mario Party. On each board the objective is to find a missing item.</p><p>In Angelica's Temple of Gloom you have to beat Angelica in reaching various pieces of an Aztec statue. The Pirate Treasure hunt requires the Rugrats to travel underwater to find buried treasure. The Reptar Rally lets them collect candy on Candy Island.</p><p>The game can be played with up to four players (or NPC players). Each turn you can move as many paces as you got on the spinner (a replacement for dice). Some tiles have special actions attached to them that let you move further or gain or lose cookies. Each Rugrat also has limited energy, when they move a lot they get tired and have to take a nap to regain energy. You can collect Toy Cards to open doors or use against friends to gain an edge.</p>"},{"name":"Rush 2: Extreme Racing USA","year":1998,"developer":"Atari Games Corporation","url":":Rush 2 - Extreme Racing USA (USA)","filesize":11376505,"score":7.1,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile","desc":"<p>Performance... adrenaline... speed! These are the ingredients in the next generation of Rush Mania! Feel the Rush once again as you blast through some of the hottest spots in America!</p><p>You want death-defying jumps and treacherous shortcuts? You'll find 'em, along with much more, in 11 selectable tracks, including Seattle, Alcatraz, and Las Vegas.</p><p>Choose your racing machine from over 15 new vehicles. And while you're there, cruise into the body shop, and choose your car's colour, suspension, even hubcaps!</p>"}]