[{"name":"S.C.A.R.S.","year":1998,"developer":"Vivid Image","url":":S.C.A.R.S. (USA)","filesize":3839532,"score":7,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Shooter > Automobile > Track racing > Vehicle simulator > Sci-fi / futuristic","desc":"<p>In the world of 3000 AD, the world is run by 9 different supercomputers, who are horribly bored, so they created this virtual reality simulation to race each other. The cars are based on the attributes of extinct Terran animals. Race nine different cars (some need to be unlocked) on nine different tracks. You can race, or you can shoot your opponents with the nine different weapons. Plenty of multiplayer options (including split screen on PC).</p>"},{"name":"Saban's Power Rangers: Lightspeed Rescue","year":2000,"developer":"Mass Media, Inc.","url":":Saban's Power Rangers - Lightspeed Rescue (USA)","filesize":9826621,"score":4.7,"genres":"Action > 1st-person > Diagonal-down > Sci-fi / futuristic > Licensed","desc":"<p><em>Power Rangers: Lightspeed Rescue</em> is one of several different games based on the 2000 incarnation of the franchise. This time, the Power Rangers are recruited to protect the city of Mariner Bay against the evil Diabolico and his minions.</p><p>The game's main story mode is called Titanium Quest and consists of three episodes that have to be taken on in order, each consisting of a number of missions, for over 30 missions in total. The missions are of one of four different types.</p><p>The Ranger levels are seen from an angled top-down perspective. A pre-determined Ranger is tasked with either rescuing a number of innocents or removing dangerous obstacles within a time limit. A radar map shows the way to the next objective. Enemy goons that stand in the way can be taken out by shooting an energy burst. Power-ups can be collected that enable more powerful shots, short-time invisibility or enhanced armor, health upgrades and more. Occasionally, the Ranger levels feature boss fights against more powerful enemies.</p><p>The driving levels are seen from the side. A Ranger-controlled vehicle drives from left to right and must put out fires, rescue civilians or clean up radioactive spills while avoiding traffic and shooting at enemy vehicles. There is a time limit and power-ups can be collected to restore health lost through attacks or crashes.</p><p>The Megazord levels are one-on-one battles that pit the Ranger's Megazord mech against one powerful boss enemy. Perspective can be switched between first- and third-person. The goal is to destroy the enemy with missiles or, if close enough, with melee attacks. Blocking is possible and power-ups can be picked up to restore health or increase firepower.</p><p>The final type of level are flying levels in which players control the Green Ranger's hovercraft. In these, the goal is once more to rescue innocents or alternatively, collect a number of items. The hovercraft is seen from behind and can freely move through a 3D environment. As in the Ranger levels, there is a radar map that shows the way to the next objective and a time limit.</p><p>A two-player mode is also available, which consists of a split-screen variant of the Megazord battles. Characters to use in this mode must be unlocked by progressing in the single-player game.</p><p>Comic-style illustrations advance the storyline between levels.</p>"},{"name":"Saikyo Habu Shogi","year":1996,"developer":"SETA Corporation","url":":Saikyou Habu Shougi (Japan)","filesize":6181046,"score":"","genres":"Simulation > Top-down > Fixed / flip-screen > Turn-based > Board game > Menu structures","desc":"<p><em>Saikyō Habu Shōgi</em> is a simulation of the Japanese board game shōgi, released as one of the N64's three Japanese launch titles. It features the likeness of Yoshiharu Habu, then a prominent tournament player. Its board and game pieces are rendered in 3D, and the player can adjust the camera as they prefer.</p>"},{"name":"San Francisco Rush 2049","year":2000,"developer":"Atari Games Corporation","url":":San Francisco Rush 2049 (USA)","filesize":11403871,"score":7.6,"genres":"Action > Racing / Driving > Behind view > Automobile > Sci-fi / futuristic","desc":"<p>Unlike the previous San Francisco Rush titles, this racing game is set in the future. The same rules apply though, get to the finish before everyone else while avoiding massive crashes and taking as many shortcuts as possible.</p><p>Along with the usual race style, you now have the ability to fly, allowing you even more speed, stunts and shortcuts to the finish line. While the tracks themselves include moving ramps and switches to other shortcuts.</p><p>Modes include time trials, stunt mode including unique track designs to get the most out of your stunts, and a four player 'Battlematch' mode that adds weapons to the action.</p>"},{"name":"San Francisco Rush: Extreme Racing","year":1997,"developer":"Atari Games Corporation","url":":San Francisco Rush - Extreme Racing (USA) (En,Fr,De) (Rev 1)","filesize":7958211,"score":6.7,"genres":"Racing / Driving > 1st-person > Behind view > Real-time > Direct control > Automobile > Track racing","desc":"<p>For the N64 version of the arcade hit, Midway added all-new courses and shortcuts. All six courses can be run in reverse, mirrored, or mirrored and reversed. There's even two hidden stunt courses! Graphically, the game sacrifices detail in favor of blindingly fast screen redraws.  </p><p>The gameplay is very arcade-like: You fly through the air with the greatest of ease, and when you hit a wall your car bursts into flames.  You can customize your car with different colors, racing stripes, tire rims and much more.</p>"},{"name":"Scooby-Doo!: Classic Creep Capers","year":2000,"developer":"TerraGlyph Interactive Studios, L.P.","url":":Scooby-Doo! - Classic Creep Capers (USA) (Rev 1)","filesize":10285356,"score":6.4,"genres":"Action > 3rd-person (Other) > Puzzle elements > Detective / mystery > Licensed","desc":"<p>Join Scooby and the gang in the hunt for clues to solve some of their greatest mysteries, against some of their more weirder and deadlier foes. All the cast are here, as you control Shaggy through dangerous environments. Escape the puzzles unscathed by collecting clues and trap pieces while avoiding numerous creatures out to scare you. If they do manage to freak out Shaggy and Scooby, you'll drop courage points. Drop too many and you'll run away back to your previous save point, but you can regain courage points by finding Scooby Snacks, or the nearest kitchen to make a well earned sandwich if you're running low.</p><p>Once you discover all the clues to the perfect crime, you must lure the bad guy back to the rest of the Scooby Gang to solve the mystery and put evil in its place.</p>"},{"name":"Sesame Street: Elmo's Letter Adventure","year":1999,"developer":"Children's Television Workshop","url":":Sesame Street - Elmo's Letter Adventure (USA)","filesize":5615770,"score":"","genres":"Educational > 3rd-person (Other) > Pre-school / toddler > Licensed","desc":"<p><em>Sesame Street: Elmo's Letter Adventure</em> is an educational game for preschooler kids. Characters from Sesame Street help young children to learn the alphabet through a series of mini games. Players are given spoken instructions about every mini game by Sesame Street characters. The player controls Elmo in several mini games, ranging from scuba diving to vehicle driving, with the objective of collecting assigned letters in each level. Each time the player collects a letter, this letter will be uttered by a character, helping children to associate the written form of each letter to its spoken form. Players are encouraged to explore different settings, from outer space to underwater worlds.</p>"},{"name":"Sesame Street: Elmo's Number Journey","year":1999,"developer":"Realtime Associates, Inc.","url":":Sesame Street - Elmo's Number Journey (USA)","filesize":6184300,"score":"","genres":"Educational > 3rd-person (Other) > Mini-games > Math / logic > Pre-school / toddler > Fantasy > Licensed","desc":"<p><em>Sesame Street: Elmo's Number Journey</em> is an educational game for preschoolers aged three to six. Players control Elmo as he takes part in activities that involve number recognition and basic math skills. The game's difficulty can be adjusted with three skill levels. Elmo can walk around Sesame Street in a 3D environment and talk to characters such as Big Bird, Count, Cookie Monster and Ernie to see what they are doing while there is a parade going on.</p><p>For the Count you need to walk around in the castle garden's linear maze or the castle itself and pick out a specific number as provided by him, or a group such as bats with that number. The bottom of the screen shows how many numbers there are left to be found. At the courtyard addition is practised by picking up and throwing the requirement number of balls to solve exercises. For Ernie the mechanics are identical, but the environment is the carnival and there is a section involving bumper cars. For Cookie Monster the concept is identical as well, but using a jet ski and snowboarding. It can also be practised in Elmo's playroom.</p><p>The characters are voiced by the same actors as in the TV series.</p>"},{"name":"Shadow Man","year":1999,"developer":"Acclaim Studios Teesside","url":":Shadow Man (USA)","filesize":30140103,"score":7.6,"genres":"Action > Behind view > Direct control > Horror > Licensed > Regional differences","desc":"<p>You're the Shadow Man, a person who can switch between the world of the dead and of the living. In <em>Shadow Man</em> your mission is to prevent five serial killers from bringing the total Armageddon. In the world of the living, you're mortal and have conventional weapons. When you die, you are transported to the world of the dead and you become Shadow Man once again. Which means you're not really mortal. In the world of the dead you can't use normal weapons, your gun shoots ghosts which kill the zombies and the other ugly creatures which live there. You also have different voodoo powers and weapons. And you're carrying a large inventory around.</p>"},{"name":"Shadowgate 64: Trials of the Four Towers","year":1999,"developer":"TNS Co., Ltd.","url":":Shadowgate 64 - Trials of the Four Towers (USA) (En,Es)","filesize":13468838,"score":6.7,"genres":"Adventure > 1st-person > Puzzle elements > Fantasy","desc":"<p>In this 3D first-person adventure game, Castle Shadowgate is filled with thieves and other scum and, on top of it all, there's an evil wizard who intends to release the Warlock lord!</p><p>You assume the role of Del Cottonwood, a halfling adventurer. He becomes a prisoner of Castle Shadowgate after a raid on the caravan he was traveling with.</p><p>At first, he will only try to escape Shadowgate, but as the story evolves, he learns that the great Wizard Lakmir has a far more noble quest for him. He will be the one to prevent Belzar from releasing the Warlock Lord!</p>"},{"name":"Shiren the Wanderer 2: Oni Invasion! Shiren Castle","year":2000,"developer":"Chunsoft","url":":Shiren the Wanderer 2 - Oni Invasion! Shiren Castle! (Japan)","filesize":22320053,"score":"","genres":"Role-playing (RPG)","desc":"<p>The game follows Shiren, a boy who aims to defend a village from attacking demons by building a castle; he finds building materials and other items by exploring dungeons. The game was the first in the series to use 3D graphics, which was done as a way to evolve the series; the development team focused on creating original features, and used the 3D engine to enable free roaming through open environments. It was originally planned for release on the 64DD, but development was later moved to the regular Nintendo 64 instead.</p>"},{"name":"SimCity 2000","year":1998,"developer":"Maxis Software Inc."},{"name":"SimCity 64","year":2000,"developer":"HAL Laboratory, Inc."},{"name":"Sin and Punishment","year":2000,"developer":"Treasure Co., Ltd."},{"name":"Snowboard Kids","year":1997,"developer":"Racdym","url":":Snowboard Kids (USA)","filesize":4804480,"score":7.3,"genres":"Racing / Driving > Sports > Behind view > Direct control > Snowboarding / skiing","desc":"<p>A racing game where you control one of five cutesy snowboarders competing against each other. Being a snowboarding game, each track is a downhill slalom with a ski lift at the bottom which takes you back to the start for however many laps a track has.</p><p>The tracks are varied, the first few taking place on snowy mountainsides, while the latter taking you to wackier locales such as grassy countryside, a desert and a theme park. The money collected on the course or won at the end of the race can be spent to buy better boards, which differ in stats, or to collect items/weapons while racing. There are also stunts that can be performed while racing which earn money as well, and certain parts of each course encourage the player to do so.</p><p>Other modes include stunt mode, shoot mode and speed mode, all focusing on a particular part of the gameplay from the main game, and a multiplayer mode where up to 4 players can race each other. There are also unlockables for dedicated players.</p>"},{"name":"Snowboard Kids 2","year":1999,"developer":"Racdym","url":":Snowboard Kids 2 (USA)","filesize":11033287,"score":7.1,"genres":"Racing / Driving > Sports > Behind view > Direct control > Snowboarding / skiing","desc":"<p>The sequel to the famous snowboard simulation Snowboard Kids is a fun family sports game. It combines a trick-oriented snowboard simulator with shooting/arcade elements. </p><p>Player can choose from various characters with different look and skills. There are different gaming modes, including a story mode with very light and entertaining plot. The storyline is actually quite basic, sometimes similar to the Kirby series concepts. Hence, there is no rush for saving the world, just some funny little fellas entertaining themselves. </p><p>Winning a race or performing tricks provides the player with some credit which can be spent on improved equipment. Shooting elements are based on but not limited to throwing strange objects (like parachutes or snow-men) against other snowboard kids in order to slow them down. There are great power-ups during the gameplay. Courses are rarely covered with snow - most of the races are held in freakish regions like jungles, space stations, castles etc.</p>"},{"name":"South Park","year":1998,"developer":"Iguana Entertainment Incorporated","url":":South Park (USA)","filesize":14064972,"score":5.8,"genres":"Action > 1st-person > Shooter > Direct control > North America > Sci-fi / futuristic > Comedy > Licensed","desc":"<p>A comet is heading toward South Park, causing many of the enemies from early seasons of the shows (including cows, aliens, and clones) to rise up and attack.  The player takes control of Kyle, Cartman, Kenny and Stan to fight through the town in a first-person perspective.  Features new dialogue from the original voice actors on the show.</p><p>Single player takes the form of a \"Story\" mode divided into five episodes and fifteen linear levels.  The player will face weak minions (which change based on the episode), plus occasional sub-bosses which will try to escape into town. The final level is devoted to a unique boss fight.  Players use quirky weapons ranging from infinite yellow snowballs to cow launchers and toxic Terrance and Phillip dolls.  Every weapon has a secondary fire, and players switch between the four main characters when they switch weapons - each of the four kids shares a single life bar because of this.  The kids will comment on game actions as they occur, with heavier profanity censored with bleeps.  The kids will get angrier (and fouler) as their health depletes, until they finally give up on saving the town and go home.</p><p>A multiplayer mode lets players take characters and weapons they unlock in Story mode into small deathmatch arenas. The PlayStation version supports 2 players, the N64 does 4, and the PC version allows players to go online to search for opponents through GameSpy.  Players can set standard victory options like knockouts or time limits.  Voice samples for multiplayer are also included, so the characters will make comments and taunts when hit.</p><p>Graphics are rendered in 3D, in a style approximating that of the show.  Draw distance is limited by a heavy fog, with varying severity based on the platform.  None of the environments are interactive, and only enemies respond to weapon hits.  The N64 version supports the Expansion Pak.</p>"},{"name":"South Park Rally","year":2000,"developer":"Tantalus Interactive Pty. Ltd.","url":":South Park Rally (USA)","filesize":14114910,"score":5.5,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Licensed","desc":"<p>Choose your character from the cast of the popular 'mature' cartoon South Park, and tear through the streets in this racing game. Your character's vehicle may be a little cart, trike, or box, for example. Weapons include rockets, Salty Balls, Cheesy Poofs, the beloved Cow and even an Anal probe. All of the voices are also included, making it feel more like the real cartoon than a rally game. You can also play an all-on-all 4 player mode.</p>"},{"name":"South Park: Chef's Luv Shack","year":1999,"developer":"Acclaim Studios Austin","url":":South Park - Chef's Luv Shack (USA)","filesize":14207390,"score":5.4,"genres":"Action > Arcade > Game show / trivia / quiz > Licensed","desc":"<p>Chef hosts <em>South Park: Chef's Luv Shack</em>, which mixes South Park trivia with over 20 mini games in the mold of Mario Party. Most of the mini games are parodies of classic arcade games. The player chooses a South Park character (Kyle, Kenny, Stan, or Cartman) and answers the questions based on episodes from the cartoon series. If the player gets it right, they then spin a wheel, and get either cash, lose it all, or play a mini game (either by themselves, against the AI, or against other players if playing in multiplayer mode). The person who has the highest score (or the most correct answers) after a chosen amount of rounds wins.</p>"},{"name":"Space Invaders","year":1999,"developer":"Torus Games Pty. Ltd.","url":":Space Invaders (USA)","filesize":6157640,"score":6.3,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>In 1978, Earth successfully repulsed an invasion from outer space thanks to \"the Tank.\" The Tank was based on alien technology found when a scout ship had crashed years earlier. Now, over 20 years later, a new Tank has been created based on the technology recovered during the 1978 invasion. And none too soon, because the Invaders are back!</p><p>Space Invaders is yet another classic arcade game remake by Activision (see Battlezone  and Asteroids). But this time, Activision licensed a game from Taito instead of Atari. The game stays close to its roots while adding many power-ups and enemies.</p><p>You can play either one or two players against the Invaders, who march down the screen in orderly rows and columns, at one of three skill levels. You'll start at Pluto and work your way through the Solar System to Mars, then Venus, and finally Earth. There are four common aliens (red, green, blue, and yellow), plus seven more less common ones. You receive special one shot power-ups by shooting four of the same type of Invaders in a row. As in the original game, there are also Mother Ships that fly above the action, but in this version if you hit them you can pick up other useful power-ups like shields or double shots. Plus, after fighting off several waves on each planet, you'll face a unique boss. If you manage to finish the game, you'll be able to play a reproduction of the original coin-op.</p>"},{"name":"Space Station Silicon Valley","year":1998,"developer":"DMA Design Limited","url":":SpaceStation Silicon Valley (USA) (Rev 1)","filesize":6394006,"score":7.6,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Sci-fi / futuristic","desc":"<p>Long ago, scientists created a living space station, full of animals. After its launch into space, the station vanished, never to be seen again.</p><p>Until now.</p><p>The station has reappeared out of no-where, many years after its first launch, and is on a collision course with Earth. Two unlikely heroes (pilot and all-round ugly looking guy Dan and robot Evo) are now thrust with the mission to stop the station, and find out where it has been all this time.</p><p>Sadly, not everything goes to plan, with their ship crashing into the station. Evo, the unlucky robot that he is, is thrown out of the ship and smashed into pieces. His only hope for survival is to attach his microchip into another host robot. Thankfully, underneath the wrecked ship is the remains of another robot, and with a quick fix Evo is now a robotic dog.</p><p>As you enter the valley, you must contend with a host of other robots much like the dog, of all shapes and animal sizes. You can move Evo's chip from one animal to another to gain attributes and abilities, improving your chance of success to get past the killer penguins and rocket launching tigers.</p><p>Aims of the game include the basic destruction of enemy robots, to sheep herding, controlling Evo the rat through a mini maze, and plenty more through 35 levels of insane 3rd person action.</p><p>When the game was ported to PlayStation some of the bugs from the Nintendo 64 version were fixed.</p>"},{"name":"Spider-Man","year":2000,"developer":"Neversoft Entertainment, Inc.","url":":Spider-Man (USA)","filesize":28782878,"score":7.7,"genres":"Action > Behind view > Licensed","desc":"<p><em>Spider-Man</em> is the first 3D game to star the popular web-slinger. It is loosely based on <em>Spider-Man: The Animated Series</em> and <em>Spider-Man Unlimited</em> and features some of the voice cast from each and similar character designs.</p><p>Peter Parker is attending a demonstration of the reformed Dr. Otto Octavius's new invention when an imposter Spider-Man steals the device. Spider-Man must work to clear his name and uncover the sinister motives behind the device's theft.</p><p>This game features appearances not only by most major Spider-Man characters, but cameos by numerous other characters from the Marvel Universe, such as the Human Torch, Punisher, Daredevil and Captain America.</p><p>Spider-Man's webs are greatly emphasized. He can use them both for navigational purposes, like swinging or ziplining, and for offensive and defensive combat, such as tying up a villain, coating his fists with web for extra oomph, or building a protective shield. His web supply is limited though and he must find new cartridges or risk running out. The wall-crawling powers are also prominently features. Spider-Man can cling to any wall or ceiling. This is used for basic environmental navigation and for stealth as there are many sequences where you crawl over the heads of unsuspecting thugs, or drop down and catch them off-guard.</p><p>Combat is based around Spider-Man's ability to jump, kick, punch and web. By combining these with direction and in various combinations, Spider-Man is able to throw objects such as furniture, hurl web balls, yank enemies into melee range and follow up with a flurry of hits, among other things. There are a number of boss-battles as well, all of which are puzzle-based.</p><p>Missions vary from the fairly common fight-your way-to-the-goal or find-the-key-that-unlocks-the-door types to races to catch some or evade them or just trying to avoid the police.</p><p>There are several side goals in addition to the main mission including multiple unlockable Spider-Man costumes and numerous hidden comic book covers to find.</p>"},{"name":"Star Fox 64","year":1997,"developer":"Nintendo EAD","url":":Star Fox 64 (USA) (Rev 1)","filesize":10638819,"score":8.2,"genres":"Action > 1st-person > Behind view > Rail shooter > Shooter > Direct control > Flight / aviation > Space flight > Sci-fi / futuristic","desc":"<p>Fox McCloud returns to once again rid evil from the Lylat System in this 64-bit remake of the SNES hit. </p><p>The main aim of the game is to fly your Arwing through many levels of deadly enemies and huge end bosses with three wingmen (Slippy Toad, Peppy Hare, and Falco Lombardi) following to help you out. Every once in a while, you will also use the Blue Marine submarine and the Landmaster tank.</p><p>The 15 levels range from forward scrolling levels (much like Panzer Dragoon or some elements of Star Wars Arcade) to full 3D arenas, each with a certain goal to achieve or boss to destroy. The bigger your frags are at the end of each level determines which direction you take on the universe tree, which is split into three levels: easy, medium, and hard. All three link back to the end for the final level.</p><p>Multiplayer modes are also included, allowing four people to battle in Arwings, or if you complete every objective in the single player missions, they can battle on-foot, where the four main characters run around with laser cannons.</p>"},{"name":"Star Soldier: Vanishing Earth","year":1998,"developer":"Hudson Soft Company, Ltd.","url":":Star Soldier - Vanishing Earth (USA)","filesize":8968002,"score":6.1,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p><em>Star Soldier: Vanishing Earth</em> takes place in the far future, where you are the last hope for Earth, which is being attacked by an alien race. The game features a top-down 3D scroller, similar to that of the arcade games 1943 or  Raiden. You can take control of different space crafts, each with different advantages and disadvantages, and different weapons. The rule is 1 hit-kill. After 3 lives, you have to restart the level. There is no saving feature, however a lengthy password is provided to you at the end of each level, so long you have the patience to put it in each time you turn off the game.</p><p>Each level is about 3-5 minutes long, each with it's own tough boss at the end. Each level has its own secret path to take, depending on what you shoot (ex. shoot wall, reveal secret path). All levels lead up to a final boss in the end.</p>"},{"name":"Star Wars: Episode I - Battle for Naboo","year":2000,"developer":"LucasArts Entertainment Company LLC","url":":Star Wars Episode I - Battle for Naboo (USA)","filesize":26842315,"score":7,"genres":"Action > Behind view > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>Take part in the Battle to save the planet Naboo, with a total of 15 land and air missions, using hovercrafts, the now famous Naboo cruiser, and all the crafts seen in the movie. </p><p>Plus, cut scenes help guide the storyline, and everyones favourite music score is thrown in to add to the atmosphere of destroying the Trade Federations plans of taking over Naboo.</p>"},{"name":"Star Wars: Episode I - Racer","year":1999,"developer":"LucasArts Entertainment Company LLC","url":":Star Wars Episode I - Racer (USA)","filesize":25540754,"score":7.6,"genres":"Racing / Driving > Behind view > Hovercraft > Track racing > Vehicle simulator > Sci-fi / futuristic > Licensed","desc":"<p>Based upon the Pod Racing scenes of Star Wars: Episode I - The Phantom Menace, your mission as young Anakin Skywalker or as one of a collection of strange characters from around the Galaxy is to compete, survive and win in the high speed challenge of Pod Racing.</p><p>Each character has a unique Pod that can be upgraded with the credits you win after each race. Finish first to gain the most prestige and compete in greater and more challenging tracks, including the now famous race along the sand dunes of Tatooine that determined the destiny of many lives.</p>"},{"name":"Star Wars: Rogue Squadron 3D","year":1998,"developer":"Factor 5 GmbH","url":":Star Wars - Rogue Squadron (USA) (Rev 1)","filesize":14450071,"score":7.9,"genres":"Action > 1st-person > Behind view > Shooter > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>Take on the Empire as Luke Skywalker in one of the N64's first Star Wars games. Fly through 15 levels as well as discovering 3 hidden levels. Craft include: X-Wing and Snowspeeder, also the Millennium Falcon makes an appearance and is flyable.</p>"},{"name":"Star Wars: Shadows of the Empire","year":1996,"developer":"LucasArts Entertainment Company LLC","url":":Star Wars - Shadows of the Empire (USA) (Rev 2)","filesize":11817554,"score":7.5,"genres":"Action > 3rd-person (Other) > Behind view > Sci-fi / futuristic > Licensed","desc":"<p>Set between <em>The Empire Strikes Back</em> and <em>Return of the Jedi</em>, <em>Star Wars: Shadows of the Empire</em> tells the story of Prince Xizor's quest to replace Darth Vader as the leader of the Sith, and wipe out the Rebels' chances of victory. The only man that can stop him is the interstellar bounty hunter Dash Rendar. The game is based on the novel of the same name, with locations including ice planet Hoth, Mos Eisley and the sewers of Imperial City, all in full 3D.</p><p>Levels each have very different objectives, ranging from piloting snowspeeders on Hoth and racing speeder bikes on Tatooine to shooting stormtroopers and droids on foot throughout the galaxy. Dash primarily uses a blaster with unlimited ammo, but can also find more powerful weapons with limited ammunition. Each level has optional \"challenge points\" that are hidden throughout the level, and finding all of them will unlock a cheat dependent on which difficulty setting the save file is on.</p>"},{"name":"StarCraft 64","year":2000,"developer":"Blizzard Entertainment Inc.","url":":StarCraft 64 (USA)","filesize":27031425,"score":7.9,"genres":"Strategy > Top-down > Free-roaming camera > Real-time > Real-time strategy > Multiple units/characters control > Point and select > Sci-fi / futuristic > War","desc":"<p>In the distant future, a small group of human exiles have been doomed to fight for survival on the edge of the galaxy. Through military strength, espionage, and deceit, a unified Terran government has maintained an uneasy peace. But as resources and fuel run short, the Confederate nations find themselves looking towards the rich worlds of their alien neighbors, the enigmatic Protoss. To further complicate matters, it seems that a previously unknown species-- the Zerg-- has entered Protoss space and is destroying everything in its path. The time for war has come.</p><p>The N64 port of StarCraft is a real-time strategy game featuring three distinct races - Terrans, Protoss and Zerg. Controls have been adjusted for the gamepad, with several Hot-Key menus available, and resource gathering has been automated to limit the required number of options. However, it lacks the cutscenes and map editor of the original game.</p><p>If the player has the Expansion Pack for the N64, the entire Brood War expansion is also available. One player can play with up to 7 bots on a random map, or 2 players can team up in co-operative mode (with the N64 Expansion Pack) or go head to head with up to 6 other bots for total mayhem.</p>"},{"name":"Starshot: Space Circus Fever","year":1999,"developer":"Infogrames Europe SA","url":":Starshot - Space Circus Fever (USA) (En,Fr,Es)","filesize":11430978,"score":6.7,"genres":"Action > 3rd-person (Other) > Platform","desc":"<p>The space circus is heavily in debt, and it's up to Starshot to get the circus going, before the entire place is blown sky high by Wolfgang von Ravel and his robot clan. There are seven large levels in total to go through, with Starshot's many different skills needed to complete each task.</p>"},{"name":"Stunt Racer 64","year":2000,"developer":"Boss Game Studios Inc.","url":":Stunt Racer 64 (USA)","filesize":10861503,"score":"","genres":"Racing / Driving > 1st-person > Behind view > Automobile > Sci-fi / futuristic","desc":"<p>This futuristic racer has you flying along specially built tracks, jumping through rings, pulling off aerial stunts and getting up to insane speeds.</p><p>The main aim of the game, as with all racers, is to get to the finish line first. But by getting some air and landing through rings, or pulling off stunts, you'll also pick up coins that will go towards upgrading your car.</p><p>The cars themselves are a mix of the future and the past, with a hot rod style outside with a powerful new age engine inside. That power will go towards getting you over the line, with the use of speed boosts as well as shortcuts on the tracks helping you greatly.</p><p>A 4 player split screen mode is also included, while you can compete in practice, quick race and the competitive League mode, as well as stunt modes that will test your stunt making skills on half pipes and large open tracks.</p>"},{"name":"SudoQ","year":2016,"developer":"BoMbErGaMeS"},{"name":"Super B-Daman: Battle Phoenix 64","year":1998,"developer":"Hudson Soft Company, Ltd."},{"name":"Super Bowling","year":1999,"developer":"Athena Co., Ltd.","url":":Super Bowling (USA)","filesize":5284370,"score":"","genres":"Sports > 3rd-person (Other) > Bowling","desc":"<p><em>Super Bowling</em> is a third-person bowling game. Players may bowl in several different environments, which range from ice ponds to neon-lit Chinese temples. Players can face-off against characters in their home stages, much like a fighting game. If the player wins they can then play on these stages in other play modes.</p><p>Multi-player modes are also available, with a number of different variations.</p>"},{"name":"Super Mario 64","year":1996,"developer":"Nintendo EAD","url":":Super Mario 64 (USA)","filesize":6277255,"score":8.5,"genres":"Action > 3rd-person (Other) > Platform > Direct control > Fantasy","desc":"<p>Mario is invited to Peach's castle, but when he arrives Peach is nowhere to be seen. He soon learns from Toad that Bowser has once again kidnapped her. The Koopa King has also put a spell on her castle, imprisoning her subjects. So it is up to Mario to break the spell and rescue Peach.</p><p><em>Super Mario 64</em> is the first Mario game done entirely with 3D graphics. The core gameplay is similar to previous platform installments, focusing on jumping, avoiding obstacles, and defeating enemies. Levels can be explored without time limits. Stars must be collected in order to unlock new areas, eventually gaining access to various parts of Bowser's castle. Defeating Bowser on each floor procures keys necessary to unlock big doors and enter other floors, which contain more areas. </p><p>Mario has more moves at his disposal in this installment. Besides running and jumping, he can now walk, crouch, crawl, climb, and punch enemies. Double and triple jumps, long jumps, wall jumps, and backflips can be executed as well. Swimming underwater now depletes Mario's oxygen level. Items must be picked up and carried in some instances in order to solve puzzles.</p><p>Power-ups include the Wing Cap, which allows Mario to fly; the Metal Cap, which protects him from damage (including environmental hazards such as poisonous gas); and the Vanish Cap, which makes Mario ethereal, allowing him to walk through certain obstacles (such as wire mesh). Mario can also enter cannons and be shot from them; combining this with the flying ability grants access to high areas.</p>"},{"name":"Super Robot Spirits","year":1998,"developer":"Banpresoft Co., Ltd."},{"name":"Super Robot Taisen 64","year":1999,"developer":"Monegi, Inc."},{"name":"Super Smash Bros.","year":1999,"developer":"HAL Laboratory, Inc.","url":":Super Smash Bros. (USA)","filesize":12552510,"score":7.6,"genres":"Action > Side view > 2D scrolling > Fighting > Platform > Direct control > Fantasy","desc":"<p><em>Super Smash Bros.</em> takes familiar Nintendo characters such as Mario, Kirby and Donkey Kong, and gets them to fight to the death. There are 8 fully-interactive landscapes, with one for each character, with noticeable links to their games. Controls are analogue-based, with different moves executed depending on the direction and how firmly the stick is pressed. Items like baseball bats, Bob-ombs, and healing items drop into the arenas at random, aiding any nearby characters than can make use of them. The game uses a fixed viewpoint which scrolls, although characters are rendered in 3D.</p><p>The one-player mode has 14 stages to work through. Up to 4 human players can do battle at once, with team play as well as all-against-all action. Hidden characters are thrown in for good measure, as are bonus rounds, and a battle to the end with a giant hand (you read right).</p><p>Playable characters include:</p><ul><li>Captain Falcon* (F-Zero series)<em> Donkey Kong (Donkey Kong games)</em> Fox (Star Fox series)<em> Kirby (Kirby games)</em> Jigglypuff* (Pokémon universe)<em> Link (Legend of Zelda series)</em> Luigi* (Mario games)<em> Mario (Mario games)</em> Ness* (Mother/EarthBound series)<em> Pikachu (Pokémon universe)</em> Samus (Metroid series)* Yoshi (Mario games)</li></ul><p>* denotes any characters that need to be unlocked under special conditions first.</p>"},{"name":"Supercross 2000","year":1999,"developer":"Electronic Arts, Inc.","url":":Supercross 2000 (USA)","filesize":14597177,"score":6.5,"genres":"Racing / Driving > Sports > 1st-person > 3rd-person (Other) > Motorcycle > Licensed","desc":"<p>This is a Supercross motorcycle simulation game, officially licensed by the AMA.  It features racing through 16 real stadium tracks, with professional commentary, and a freestyle tricks mode with special tracks.  The bikes have realistic physics and AI.  2 players can race split-screen and replay mode lets you fly anywhere. </p>"},{"name":"Superman","year":1999,"developer":"Titus France SA","url":":Superman - The New Superman Aventures (USA) (En,Fr,Es)","filesize":5205599,"score":2.7,"genres":"Action > Behind view > Direct control > Licensed","desc":"<p>Lex Luthor pulls off another stunt, this time he and Braniac have developed a virtual reality version of Metropolis to trick the people of the fair city. And Lois Lane and Jimmy Olsen are the first to be tricked.</p><p>It's all to pull in Superman, the world's strongest hero, in order to take him down. But as the man himself, your job is to destroy any and all hopes of the bad guys chances.</p><p>Using all of his many powers (including heat vision, flight and x-ray vision), you must fight your way through air, sea, underground and indoor levels of bad guys, bosses and puzzle elements in order to reach Lois and destroy Lex's mission.</p><p>4 player multiplayer modes are also included as you take control of the many characters for some beat 'em up action.</p><p>The United States release contained an <em>exclusive collector's edition</em> Superman comic book inside the package.</p>"},{"name":"Susume! Taisen Puzzle Dama: Tōkon! Marutama Chō","year":1998,"developer":"Konami Computer Entertainment Kobe, Inc."},{"name":"Sydney 2000","year":2000,"developer":"Attention to Detail Limited","url":":Sydney 2000 (USA)","filesize":25404901,"score":5.9,"genres":"Sports > 3rd-person (Other) > Olympiad / mixed sports > Oceania > Licensed","desc":"<p>The official video game of the Games of the XXVII Olympiad held in 2000 in Sydney. It includes 32 nations, going for gold in 12 events divided by 6 sports: Athletics (100m dash, 110m hurdles, hammer and javelin throw, triple jump and high jump), Aquatics (200m freestyle and 10m platform diving), Kayak K1 Slalom, Super Heavyweight Weight Lifting, Skeet Shooting and Three-man track cycling pursuit. All events feature 3D graphics with cameras that mimic the ones used in TV broadcasts.</p><p>Gameplay is the usual found in games of the genre - button mashing the two power buttons is required in most events to build up strength/speed, with an additional third button setting the actions, such as jumping or throwing angle. Other events feature alternate control methods, such as Slalom (where it's possible to press certain buttons to dodge the rower between the gates if the Kayak is going to hit one or place the paddle to force into a certain direction), Diving (following a \"click-along\" sequence of keys) and Skeet (the direction keys controlling the aim, one button to start and other to shoot).</p><p>Along an arcade and 8-player action, the Olympic mode gives the player the option to build their athlete from the national open trials to the Olympics. By completing training drills in the Cyber Gym, the athlete increases his athletic abilities: <em>Citius, Altius, Fortius</em>, as told by the Olympic Motto. Before joining the competition, the player must beat national, continental and international opponents.</p>"}]