[{"name":"Tamiya Racing 64","year":1999,"developer":"Looking Glass Studios","url":"0#Tamiya%20Racing%2064%20%28USA%29%20%28Proto%29.zip","filesize":7897359,"score":"","genres":"Racing","desc":"<p>Tamiya Racing 64 is a tech demo for a racing game (presumably the similarly unreleased Mini Racers) with licensed remote-controlled cars, featuring very sensitive controls and vacuum cleaner engine sounds. It was developed by Intermetrics, associated with Looking Glass Studios.</p>"},{"name":"Taz Express","year":2000,"developer":"Zed Two Game Design Studio","url":"0#Taz%20Express%20%28USA%29%20%28Proto%29%20%282000-05-15%29.zip","filesize":13914468,"score":6.4,"genres":"Action > Diagonal-down > 2D scrolling > Platform > Puzzle elements > Fantasy > Licensed","desc":"<p>Taz the Tasmanian Devil is a well-known Warner Bros. character which this game expands on. This 3D platform game sees Taz delivering crates across twenty-five levels and five game worlds including Mars, the Bushlands, Monument Valley and the Wild West. Spin, run, jump onto skyscrapers, jump with various springy devices, swim, and fly with a jetpack through levels to complete tasks and puzzles in the bright coloured cartoon environments. Complete the game four times to unlock all the secrets and discover what is in the crate Taz is delivering.</p>"},{"name":"Tetris 64 (Japan)","year":1998,"developer":"Amtex","url":"0#Tetris%2064%20%28Japan%29%20%28En%29.zip","filesize":6748479,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p><em>Tetris 64</em> is a falling block puzzle which offers the traditional <em>Tetris</em> experience: Blocks enter the screen from the top of the screen and can be moved and rotated as long as they are falling. The goal is to create full lines which then disappear, reward points and cause the game to become more difficult over time. The game is lost when the appearing stone can't be moved anymore because the screen is full. B-Type is similar but the screen gets filled with random block combinations from the ground.</p><p>In addition to this standard mode, the game features two unique variants: In \"Giga Tetris\" the player occasionally has to deal with huge blocks which break up when touching the ground. \"Bio Tetris\" makes use of the bio sensor accessory which was included with the game: it is clipped into the user's ear and measures the heart rate. It can be set if the game slows down or speeds up when the heart rate rises.</p>"},{"name":"Tetrisphere","year":1997,"developer":"H2O Entertainment Ltd.","url":"0#Tetrisphere%20%28USA%29.zip","filesize":6665569,"score":7.4,"genres":"Puzzle > Real-time > Falling block puzzle","desc":"<p><em>Tetrisphere</em> adds a new dimension to the classic Tetris gameplay.</p><p>As usual, you drop pieces into the playing field to eliminate the blocks and clear the field. This time, however, the playing field is a sphere, and you must turn the sphere around to find a place to drop the pieces, and eventually get to the core to win. As you clear the field, certain moves may reveal magic items to help get to the core (rockets, dynamite, etc.).</p>"},{"name":"Tigger's Honey Hunt","year":2000,"developer":"Doki Denki SA","url":"0#Tigger%27s%20Honey%20Hunt%20%28USA%29.zip","filesize":12393897,"score":7,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Winnie the Pooh plans a party and therefore he needs honey. His friend Tigger promises to help him and starts searching for honey pots.</p><p><em>Tigger's Honey Hunt</em> is a platform action game in which the player guides Tigger through nine levels. In six levels the goal is to collect a predetermined minimum amount of honey pots in order to get access to the next level. In the other three levels there are mini-games like Rock-Paper-Scissors, to play against other characters from Winnie the Pooh's world.</p><p>Tigger is able to jump horizontally and vertically (even higher after he has learned special skills), use spider webs to jump to higher areas or to cross water or chasms with the help of turtles or levitating leaves. Beginning with three lives, Tigger needs to avoid being touched by dangerous creatures like bees or falling into chasms. When there are no lives left, Tigger restarts at the last checkpoint that has been passed.</p><p>Additionally you can find secret areas with even more honey pots, collect pictures which you can later look at in your photo album and meet other characters who talk to you or need your help (e.g. finding Eeyore's lost tail).</p>"},{"name":"Tom and Jerry in Fists of Furry","year":2000,"developer":"VIS Entertainment Limited","url":"0#Tom%20and%20Jerry%20in%20Fists%20of%20Furry%20%28USA%29.zip","filesize":8168345,"score":6.5,"genres":"Action > 3rd-person (Other) > Arcade > Fighting > Platform > Licensed","desc":"<p>They've been fighting for years in on our TV screens, and now you can join in on the fight.</p><p>Tom &amp; Jerry, plus a collection of well known supporting characters from the cartoon show, are part of this all-on-all brawl, where the best use of usual household appliances and furniture can win you the game.</p><p>Each level (including the Kitchen, a deck of a sailing ship and a lounge room decked out in Christmas decorations) includes a range of platforms to use to get out of the way of the firing line, and a heap of items to use in order to bash the living furball out of the enemy. Things like eggs, frying pans, chairs, bottles, roasted turkeys are all available for use in more ways then one.</p>"},{"name":"Tom Clancy's Rainbow Six","year":1999,"developer":"Rebellion Developments Ltd.","url":"0#Tom%20Clancy%27s%20Rainbow%20Six%20%28USA%29.zip","filesize":14048576,"score":7.7,"genres":"Action > Simulation > 1st-person > Behind view > Shooter > Tactical shooter > Licensed > Regional differences","desc":"<p>You have been recruited by John Clark to be a member of Rainbow, the most elite counter-terror team in the world, with members from various countries of the world. You start out rescuing hostages from the terrorists, but as you go on, you discover there are bigger things at stake - such as the entire world.</p><p><em>Rainbow Six</em> is a first-person shooter with an emphasis on realistic weapons and tactics. You must use existing intelligence like floor plan layouts to plan your assault. You can use up to four teams, with a variety of equipment from simple body armor to biosuits, breaching kit and more. There are many different weapons available, from pistols to machine guns to shotguns to grenades. You can switch between different teams as needed, or leave them under AI control. It is possible to coordinate different teams with go codes, engage a variety of terrorists or perform stealth missions. The game also features multiplayer with a variety of maps and mission types to choose from.</p>"},{"name":"Tommy Thunder","year":1998,"developer":"Player 1","url":"0#Tommy%20Thunder%20%28USA%29%20%28Proto%29.zip","filesize":2216807,"score":"","genres":"Shoot-em-up","desc":"<p>Tommy Thunder is a third-person shooter that was to be published by ASC Games. It was originally developed for the Nintendo 64 in 1997 before moving over to PlayStation by the end of February 1998, only to end up not being released anywhere.</p>"},{"name":"Tonic Trouble","year":1999,"developer":"Ubi Soft Entertainment Software","url":"0#Tonic%20Trouble%20%28USA%29%20%28Rev%201%29.zip","filesize":10584296,"score":6.9,"genres":"Action > Behind view > Platform","desc":"<p>In the tradition of Rayman (a platform jumper) comes another whacky adventure from Ubisoft!</p><p>Ed, the friendly alien space janitor, accidentally dropped a can of \"tonic\" on Earth, causing a great ecological disaster. Everything started mutating! Ed is ordered to clean up the place and retrieve the tonic, but someone got hold of it first... And he declared himself Master of Earth! Can Ed survive attack of the killer vegetables, find the six items he needs to fix Earth, and retrieve the Tonic can from Grogh the Hellish, and finally get out from Tonic Trouble?</p>"},{"name":"Tony Hawk's Pro Skater","year":2000,"developer":"Neversoft Entertainment, Inc.","url":"0#Tony%20Hawk%27s%20Pro%20Skater%20%28USA%29%20%28Rev%201%29.zip","filesize":12043955,"score":8.3,"genres":"Sports > Behind view > Tricks / stunts > Direct control > Skateboarding","desc":"<p><em>Tony Hawk's Pro Skater</em> is a skateboarding simulation in which you control a famous skate star around 3D environments. Each game area contains a plethora of objects like ramps, rails, and half-pipes which can be used to perform tricks. Each trick you perform earns you more points for your score.</p><p>The game is divided into two types of levels. In the first, you skate around locations like a mall, a city street, or a warehouse. In each of these areas, there are 5 goals to complete. Some goals involve obtaining a high score, others smashing objects and some collecting objects. For every goal you complete, you earn a videotape. By collecting enough videotapes, you unlock levels and skateboards for you to use. There are 6 levels like this. The second type of level is competition. You get to make 3 timed runs through a skate park and attempt to get the highest score possible. If you do well enough, you will beat the scores of the computer-controlled skaters and win a medal. There are 3 levels like this.</p><p>There are nine real-life pro skaters you can choose to play as, including Tony Hawk himself. Each skater has their own signature moves that earn you big points if pulled off successfully.</p>"},{"name":"Tony Hawk's Pro Skater 2","year":2001,"developer":"Neversoft Entertainment, Inc.","url":"0#Tony%20Hawk%27s%20Pro%20Skater%202%20%28USA%29.zip","filesize":15359641,"score":8.4,"genres":"Sports > Behind view > Tricks / stunts > Direct control > Skateboarding > Licensed","desc":"<p>The sequel to Tony Hawk's Pro Skater adds many new tricks, while retaining those from the original, and a complete roster of the greatest skaters worldwide. Among the new tricks is the \"manual\", which allows the player character to balance on two wheels. There are also more options for scoring high-trick combos. Trick combinations can also be edited and customized. It is possible to visit some of the most popular skate parks in the world, or create own areas and share them with other players. Players can also create their own skaters, with a choice of clothing and official skateboards.</p>"},{"name":"Tony Hawk's Pro Skater 3","year":2002,"developer":"Neversoft Entertainment, Inc.","url":"0#Tony%20Hawk%27s%20Pro%20Skater%203%20%28USA%29.zip","filesize":15114777,"score":7.9,"genres":"Sports > Behind view > Tricks / stunts > Skateboarding > Licensed","desc":"<p>Tony Hawk returns with an all new line-up of skaters, an all new line-up of parks to crash through, and a whole new level of graphics.</p><p>The line-up of street and vert riders include Elissa Steamer, Jamie Thomas, Steve Caballero, Rune Glifberg, Geoff Rowley, Andrew Reynolds, Rodney Mullen, Eric Koston, Chad Muska, Bucky Lasek and Bam Margera from MTV's Jackass (and Tony Hawk, of course).</p><p>The create a skater mode returns, allowing for even further levels of options for your character, like adding glasses and tatoos to changing the colour of the knee and elbow pads or even the hair.</p><p>And the levels themselves that you must skate through are now more interactive, with cars and humans blocking paths and making noise as you race around to make as many points as possible. Use items around the streets or the park to jump from or over to increase your score, and pull of as many wild and wacky tricks as you can.</p>"},{"name":"Top Gear Hyper-Bike","year":2000,"developer":"Snowblind Studios, Inc.","url":"0#Top%20Gear%20Hyper-Bike%20%28USA%29.zip","filesize":15495983,"score":7.3,"genres":"Racing / Driving > Sports > Behind view > Real-time > Direct control > Motorcycle > Off-roading","desc":"<p>Race along both street and dirt circuits with a collection of top flight dirt-bikes and street bikes. Dirt-bike racing allows you to pull off tricks during racing to increase the amount of turbo boost available to use, while alternating between the different bikes available for each circuit. Compete for points to improve your bikes overall performance or purchase a better overall motorbike.</p><p>Trick attack mode allows you to simply concentrate on pulling off as many crazy tricks as possible, while you can create your own special track, with jumps and sharp turns, with the track editor.</p>"},{"name":"Top Gear Rally","year":1997,"developer":"Boss Game Studios Inc.","url":"0#Top%20Gear%20Rally%20%28USA%29.zip","filesize":5534178,"score":7.5,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Automobile > Off-roading","desc":"<p>Top Gear Rally has you racing around a collection of high speed tracks, both on-road and off, with varying weather conditions and shortcuts to improve your times.</p><p>The cars available to race vary in speed, braking, acceleration and top speed rankings, and the more you complete in Championship mode, the better cars that are unlocked for you to race. You can also edit the cars paint scheme, including text and icons.</p><p>Single player and split screen multiplayer is supported.</p>"},{"name":"Top Gear Rally 2","year":1999,"developer":"Saffire, Inc","url":"0#Top%20Gear%20Rally%202%20%28USA%29.zip","filesize":10708460,"score":7.2,"genres":"Racing / Driving > Sports > Off-roading > Licensed","desc":"<p>The second rally racer from Kemco on the N64 provides a vastly different style of rally racing to the original Top Gear Rally.</p><p>Along with the new option to join a rally racing team, who supports you through-out each championship cup you take part in. Money raised by each vistory or top place in the cups goes towards improving your car, or reparing any problems. If you take a wrong turn and damage a part of your car (which can be anything from tyres to a full engine), the repairs come out of your pocket, so driving carefully is important.New sponsership deals and bigger team call ups will also come into play the better you race, allowing the chance to drive the more powerful rally cars and play for big money.</p><p>Much like the real rally championship, you don't race against other cars in the cups. Instead, you must race the clock. Whoever clocks the best time for each stage will win the points and move on to the next stage and the bigger cup challenges.</p><p>You can also take part in the usual arcade rally style against 4 other cars, with the first to get to the finish taking the points. 2 players can play as part of one team during a championship campaign, as well up to four players split screen in the arcade mode.</p>"},{"name":"Top Gear: Overdrive","year":1998,"developer":"Snowblind Studios, Inc.","url":"0#Top%20Gear%20Overdrive%20%28USA%29.zip","filesize":11889146,"score":7.4,"genres":"Racing / Driving > Behind view > Direct control > Automobile > Licensed","desc":"<p>Race across six open tracks with many of the modern day high speed racing cars. The better you do in each race, the more money you have to spend to buy the faster cars, or to improve the car you have. Shortcuts litter the tracks, while nitro boosts help you to really fly down the main straights.</p><p>Up to 4 players can compete together against the computer controlled racers in the championship modes, as well as against each other seperatly</p>"},{"name":"Transformers: Beast Wars Transmetals","year":2000,"developer":"TAKARA Co., Ltd.","url":"0#Transformers%20-%20Beast%20Wars%20Transmetals%20%28USA%29.zip","filesize":8941420,"score":5.1,"genres":"Action > 3rd-person (Other) > Fighting > Shooter > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p>Transformers, robots in animal styled disguises, battle for supremacy (and peace, depending on which side your on) in the universe.</p><p>Megatron and Optimus Primal lead their teams of elite robots against each other, but its up to you to decide who is the winner. Choose from eight characters and battle against the computer AI or a friend in one-on-one battles, featuring transformations from animal, to robot, to vehicle and special moves.</p>"},{"name":"Triple Play 2000","year":1999,"developer":"Electronic Arts Canada","url":"0#Triple%20Play%202000%20%28USA%29.zip","filesize":13628740,"score":7.5,"genres":"Sports > 1st-person > Behind view > Baseball > Licensed","desc":"<p>This iteration of Electronic Arts' baseball lineage has real players and teams up to date at the time of production. You can play single matches, a full season, the playoffs, or an all-out action Home Run Derby. Team selection and transfers come under player control. Jim Hughson and Buck Martinez provide the commentary. This was the first version to support Internet play on the PC.</p>"},{"name":"True Golf Classics: Waialae Country Club","year":1998,"developer":"T&E Soft, Inc.","url":"0#Waialae%20Country%20Club%20-%20True%20Golf%20Classics%20%28USA%29%20%28Rev%201%29.zip","filesize":14645930,"score":6.3,"genres":"Sports > 3rd-person (Other) > Golf","desc":"<p>This golf simulation game features one course with 18 holes: the Waialae Country Club in Hawaii. This course has been completely recreated in 3D. There are six gameplay modes: Waialae Open, tournament play, stroke play, match play, skins play and practice mode. You can play with up to four friends (not simultaneously).</p>"},{"name":"Turok 2: Seeds of Evil","year":1998,"developer":"Iguana Entertainment Incorporated","url":"0#Turok%202%20-%20Seeds%20of%20Evil%20%28USA%29%20%28Rev%201%29.zip","filesize":29567666,"score":7.5,"genres":"Action > 1st-person > Shooter > Regional differences","desc":"<p><em>Turok 2: Seeds of Evil</em> is the sequel to Turok: Dinosaur Hunter.Having defeated the Campaigner, Turok throws the Chronocepter into a waiting volcano to destroy it. Unfortunately the blast awakens an even deadlier force - The Primagen - who lays in wait for his freedom from a wrecked space craft, buried at the core of the Lost Land. Once again a Turok is tasked with restoring peace to the land and stopping the Primagen from merging Earth with the nether world.</p><p>The game features an armory twice as large as its predecessor, and many weapons will even have a later update that makes them even more devastating. New weapons include the lethal discus Razor Wind, a proximity mine layer, and the Cerebral Bore, a flying grenade that homes in on an enemy's head, drills through their skull, and then explodes. Enemies have damage models now, allowing limbs to be torn off or bloody holes to be blasted through torsos. Turok won't be facing any human opponents this time, but will find himself under attack by plenty of dinosaur/human hybrids, brutish giants, and man-sized insectoids.</p><p>The goal of each level is to reach the end and defend one of the five totems that keeps the Primagen captive in its ship as well as finding keys to unlock the portals that lead to later levels. In each level Turok can also find a special spiritual power, such as immunity to lava or a long jump. After finding a power, he will need to return to an earlier level to use that power to find one of the five keys that opens the portal to the Primagen itself. While searching for spiritual powers Turok will occasionally find portals that transport him to a strange place full of deadly creatures who appear to be unaffiliated with the Primagen, but discovering their true purpose is the job for another Turok.</p><p>A multiplayer game is included as well, with options for between 2 and 4 players and game-types like deathmatch and capture-the-flag. This multiplayer mode would later be expanded into a full game with Turok: Rage Wars.</p>"},{"name":"Turok 3: Shadow of Oblivion","year":2000,"developer":"Acclaim Studios Austin","url":"0#Turok%203%20-%20Shadow%20of%20Oblivion%20%28USA%29.zip","filesize":27981312,"score":7.6,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p>When the Primagen's Lightship was destroyed in Turok 2: Seeds of Evil the resulting explosion created a shockwave throughout the universe. This effect nearly ended the life of Oblivion, a 'thing' that drifts through space, consuming anything that ends up in its way. Also during this explosion, a new world was created. In this world lies the Turok family tree, and Oblivion knows that the only way the pain the lies within can be stopped is to destroy the Turok line. </p><p>The third title in the <em>Turok</em> series allows you to choose who will become the successor of the Turok lineage, either Danielle Fireseed or her brother Joseph. Each has unique paths through the same levels, as Joseph's small size allows him to fit into air ducts to take the low road, while Danielle's magnetic grappling hook allows her to take the high road. Each also has unique upgrades to basic weapons. While Danielle's shotgun upgrade coats the shrapnel in napalm to immolate anything they touch, Joseph's instead charges them with electricity, causing them to ricochet off of walls and floors. The story is told through in-game cutscenes with highly detailed models. There are no keys to collect this time around, as each level leads linearly into the next.</p><p><em>Turok 2</em>'s multiplayer mode returns, and includes the ability to add computer controlled bots. Each playable character in multiplayer mode has a unique set of weapons they can use.</p>"},{"name":"Turok: Dinosaur Hunter","year":1997,"developer":"Iguana Entertainment Incorporated","url":"0#Turok%20-%20Dinosaur%20Hunter%20%28USA%29%20%28Rev%202%29.zip","filesize":7592982,"score":7.8,"genres":"Action > 1st-person > Shooter > Regional differences","desc":"<p>The Earth is separated by an invisible barrier from the Lost Land, a realm in which time has no meaning, and which is inhabited by ferocious dinosaurs and aliens. For many generations, the mantle of Turok has been bestowed upon those who saw the protection of the barrier as their sacred duty. But an evil lord named Campaigner is seeking for an artifact that is capable of destroying the barrier, striving to dominate the entire universe. This artifact, known as the Chronoscepter, was broken into pieces which were then hidden away. Tal'Set, a Native American and the last Turok, must find the scattered pieces of the Chronoscepter, and stop the Campaigner from obtaining them.</p><p><em>Turok: Dinosaur Hunter</em> is a first-person shooter with platforming and light puzzle-solving elements. Much of the game is set in outdoor environments, and requires the player to explore them by finding various paths, jumping, swimming, and climbing. The game's most notable enemies are dinosaurs of various sizes, though the levels also include human and demonic enemies, as well as wildlife. The player gradually gains access to thirteen weapons (plus the Chronoscepter, assembling which is the game's main objective); these include a knife, a bow, as well as high-tech firearms such as a rocket launcher and an atomic fusion cannon.</p>"},{"name":"Turok: Rage Wars","year":1999,"developer":"Acclaim Studios Austin","url":"0#Turok%20-%20Rage%20Wars%20%28USA%29%20%28Rev%201%29.zip","filesize":5651897,"score":7.4,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic > Regional differences","desc":"<p>If you enjoyed the multiplayer modes in Turok 2, then this is for you.</p><p>Instead of the usual Turok single player missions, you must control your character and complete certain missions (from getting the most frags in a time limit, finding an item, or lasting the distance). Before a match you also get to choose which weapons to use, and you can unlock heaps of more weapons and character skins as you complete the objectives.</p><p>Multiplayer is the main aim of this game, and there are plenty of 4 player game modes to choose from (frag and tag, capture the flag, Bloodlust, etc.) as well as a 2 player co-op Trial mode (much like the single player missions) time trials and frag fests.</p>"},{"name":"Twisted Edge: Extreme Snowboarding","year":1998,"developer":"Boss Game Studios Inc.","url":"0#Twisted%20Edge%20-%20Extreme%20Snowboarding%20%28USA%29.zip","filesize":10385642,"score":6.6,"genres":"Action > Sports > 1st-person > 3rd-person (Other) > Snowboarding / skiing","desc":"<p>This downhill snowboarding game includes seven tracks, multiple characters and boards, and many trick moves.  It can be played in Competition Mode, Stunt Challenge, two-player VS. Race, and Practice Mode, which includes a ghost of your best race.  Hidden features include new characters and boards, secret shortcuts on tracks, and mirrored mode.</p>"}]