[{"name":"V-Rally: Edition 99","year":1998,"developer":"Eden Studios","url":":V-Rally Edition 99 (USA)","filesize":7178098,"score":6.6,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p>V-Rally was the first Rally game to be published on the PlayStation. This \"Edition 99\" is the Nintendo 64 port of the original game, with slightly improved graphics and menus.</p><p>This game offers you to race through 8 countries using one of the 12 official cars from the World Rally Championship. Each track has its own course conditions, so you will eventually have to use your skills in snow, mud, rain, gravel...</p>"},{"name":"Vigilante 8","year":1999,"developer":"Luxoflux Corp.","url":":Vigilante 8 (USA)","filesize":7457503,"score":7.7,"genres":"Racing / Driving > 1st-person > Behind view > Real-time > Arcade > Direct control > Automobile > Vehicular combat > Contemporary > North America","desc":"<p>The game takes place in the Western United States during a time of world-wide oil shortage in 1976. An organization known as OMAR (Oil Monopoly Alliance Regime) was making money off the shortage everywhere except in the United States. OMAR hires the best terrorist that $100 million could buy: Sid Burn. His job, aided by five hired Coyotes, is to destroy all gas refineries in the southwest of the U.S. so OMAR can bring the country to its knees. When gas prices went wild, six civilians who called themselves Vigilantes, led by the truck driver Convoy, began fighting against the Coyotes in different areas to keep OMAR from succeeding.</p><p><em>Vigilante 8</em> is a vehicular combat game similar to Twisted Metal in concept. Players can choose from eight characters with different agendas, and select vehicles ranging from classic 1970's muscle cars to a school bus, each stacked high with various kinds of weapons. Unlockables include two hidden levels (three in the Nintendo 64 version) and five hidden characters and cars. Multiplayer is also included: the PlayStation version allows two players (four in the Nintendo 64 version) to go head-to-head.</p>"},{"name":"Vigilante 8: 2nd Offense","year":1999,"developer":"Luxoflux Corp.","url":":Vigilante 8 - 2nd Offense (USA)","filesize":11225033,"score":7.4,"genres":"Racing / Driving > Behind view > Arcade > Shooter > Automobile > Vehicular combat","desc":"<p>More drivin' &amp; blastin' fun in this sequel to Vigilante 8. The Coyotes gang returns with a shocking new leader to seek revenge on OMAR, and the Vigilantes gang. </p><p>New cars, weapons and landscapes add new excitement to the game. There are 18 charcters with storylines to walk through, which in turn affects the other characters in the game, and how well you do in the single player missions will determine what happens in the later levels.</p><p>The Dreamcast and N64 versions both have 4 player modes, while the PSX sticks with 2 player gaming.</p>"},{"name":"Virtual Chess 64","year":1998,"developer":"Titus France SA","url":":Virtual Chess 64 (USA) (En,Fr,Es)","filesize":2883982,"score":6.9,"genres":"Strategy > Chess","desc":"<p>Virtual Chess 64 is probably the only chess game that was created for the Nintendo 64 console. It features both 2D and 3D graphics that the player can choose according to his/her own preference. It also features mini cut scenes when a pawn loses to another where cartoon - like characters that represent the pawn that attacks and the pawn that loses fight each other. The AI of the game though is extremely high even in the easy levels.</p>"},{"name":"Virtual Pool 64","year":1998,"developer":"Celeris Inc.","url":":Virtual Pool 64 (USA)","filesize":2489767,"score":7.5,"genres":"Simulation > Sports > 1st-person > Pool / snooker","desc":"<p><em>Virtual Pool 64</em> is a pool simulation game and is a continuation of the <em>Virtual Pool</em> series. It has nine different pool games to play. They are eight-ball, nine-ball, three-ball, six-ball, ten-ball, straight pool, one-pocket, bank pool and rotation. In addition, eight ball has three separate rules you can play under, American bar rules, British rules and APA league rules.</p><p>You can choose to play in a standard match, a tournament of up to 16 players, freestyle, which allows you to play without rules or Shark Skins, which is a combination of three-ball, six-ball and nine-ball.</p>"}]