[{"name":"War Gods","year":1997,"developer":"Midway Manufacturing Company","url":"0#War%20Gods%20%28USA%29.zip","filesize":10806878,"score":5.1,"genres":"Action > 3rd-person (Other) > Arcade > Fighting","desc":"<p>War Gods is a one-on-one fighting game that takes place in 3D environments. The fighter under your control can perform many different moves, and string those moves together to perform \"combos.\"  Furthermore, the fighters all have special \"finishing moves\" that eliminate your opponent in some gruesome manner at the end of a match.  There are 10 different fighters to choose from, all based on different ancient civilizations.</p><p>The graphics in War Gods are fairly unique. They were created by texture-mapping 3D character models with digitized photos of people.  This gives them a reasonably lifelike look.</p>"},{"name":"Wave Race 64: Kawasaki Jet Ski","year":1996,"developer":"Nintendo EAD","url":"0#Wave%20Race%2064%20-%20Kawasaki%20Jet%20Ski%20%28USA%29%20%28Rev%201%29.zip","filesize":6172890,"score":8.3,"genres":"Action > Racing / Driving > Sports > 1st-person > Behind view > Direct control > Sailing / boating > Licensed","desc":"<p><em>Wave Race 64</em> is a jet-ski racing game. The goal is to beat the other participants in the race by successfully navigating the jet-ski through courses marked by colored buoys. Red and yellow buoys must be passed on right and left side, respectively, in order to gain speed and ensure advantage in the race. Failure to pass the buoys, on the other hand, leads to decrease in speed and eventually disqualification.</p><p>Game modes include Warm Up (basically a training session in a course known as Dolphin Park); Time Trials, in which players race against time; Championship, in which players compete in a tournament, choosing one of the four available difficulty levels; and Stunt Mode, where performing various stunts awards players with point. A two-player split-screen versus mode is available as well. Players can customize their racers, modifying their parameters, which include grip, handling, acceleration, top speed and collision stability.</p>"},{"name":"Wayne Gretzky's 3D Hockey","year":1996,"developer":"Atari Games Corporation","url":"0#Wayne%20Gretzky%27s%203D%20Hockey%20%28USA%29%20%28Rev%201%29.zip","filesize":7123504,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>This Midway title comes with all official NHL hockey teams and players with the ability to play a full season with complete stats. It also lets you play either three-on-three, four-on-four or five-on-five teams in either arcade style arenas or official regulation arenas. Carrying the NHLPA and NHL licenses, 26 teams are included with their real names, logos and uniforms.</p><p>The game has several different camera angles in a full 3D environment. As apparent through the title, it is personally endorsed by player Wayne Gretzky.</p>"},{"name":"Wayne Gretzky's 3D Hockey '98","year":1997,"developer":"Software Creations Ltd."},{"name":"WCW Backstage Assault","year":2000,"developer":"Kodiak Interactive Software Studios, Inc.","url":"0#WCW%20Backstage%20Assault%20%28USA%29.zip","filesize":26885310,"score":5.2,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>Moving away from the usual in-ring wrestling action, <em>WCW Backstage Assault</em> is just that, one-on-one battles in locker rooms, bathrooms, outdoor arenas and much more. Each wrestler has his/her usual set of moves, plus the ability to use the surroundings and any items (chairs, tables, etc.) they can find.</p><p>You can create your own wrestler, modify an existing wrestler, or choose from a large collection of WCW talent, competing for special championship belts, or hardcore matches where every win opens up hidden secrets.</p>"},{"name":"WCW Mayhem","year":1999,"developer":"Kodiak Interactive Software Studios, Inc.","url":"0#WCW%20Mayhem%20%28USA%29.zip","filesize":13281757,"score":7.1,"genres":"Action > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>In <em>WCW Mayhem</em> you can wrestle as more than 50 of your favorite WCW wrestlers in all 12 of the company's pay-per-view sets and their three major television programs, \"Nitro\", \"Thunder\" and \"Saturday Night\". Fights can occur in the ring, or you can take the match out to the backstage area.</p><p>The game also includes a create a wrestler mode to bring your own grapplers to the ring and a feature to unlock pay-per view events with the use of special codes (this feature was dropped after only three months). Running commentary by WCW's main announcer Tony Schiavone and (PlayStation version only) Bobby \"The Brain\" Heenan lend an air of authenticity to the presentation of the game.</p>"},{"name":"WCW Nitro","year":1999,"developer":"Inland Productions, Inc.","url":"0#WCW%20Nitro%20%28USA%29.zip","filesize":7788764,"score":5.4,"genres":"Sports > 3rd-person (Other) > Arcade > Wrestling > Licensed","desc":"<p>Take control of your favourite WCW wrestler and battle it out in the ring. The 16 wrestlers (to start) in the game include such greats as Kevin Nash, Buff Bagwell and Hollywood Hulk Hogan.</p><p>Based on WCW's flagship television program, \"WCW Monday Nitro\", this arcade-style game puts you (or a partner) in a button-mashing brawl featuring many of WCW's most popular stars and their signature maneuvers. There are single and tag match options for one or two players and a single-player tournament mode, where the player must battle through a series of matches to become a champion.</p><p>As you progress, you can unlock new characters to take to the ring, including more WCW wrestlers and personnel, as well as fictional characters and THQ staff members.</p>"},{"name":"WCW vs. nWO: World Tour","year":1997,"developer":"AKI Corporation","url":"0#WCW%20vs.%20nWo%20-%20World%20Tour%20%28USA%29%20%28Rev%201%29.zip","filesize":8151214,"score":7.6,"genres":"Action > Sports > 3rd-person (Other) > Direct control > Wrestling > Licensed","desc":"<p>More than 40 wrestlers from the WCW/NWO series are up to take the world wrestling title in a range of different play modes including Exhibition, League Challenge, Tournament and WCW vs NWO. You can play four player battle royal, two-on-two tag teams, or the simple one-on-one wrestling match. Each wrestler also has a collection of different moves, and players can be thrown out of the ring, and objects can be picked up out of the crowd for deadly use.</p>"},{"name":"WCW-nWO Revenge","year":1998,"developer":"AKI Corporation","url":"0#WCW-nWo%20Revenge%20%28USA%29.zip","filesize":12081352,"score":7.3,"genres":"Sports > 3rd-person (Other) > Wrestling","desc":"<p>WCW/NWO Revenge puts the power of the biggest, baddest and meanest wrestlers around the world in the hands of the player. There are more than 60 real and fictional wrestlers - including then-superstars Hollywood Hogan, Kevin Nash, Raven and Goldberg - to choose from to square off in the ring in any of several modes of play. </p><p>Each wrestler has an extensive list of moves they are able to perform, although certain physical attributes can affect the availability of certain actions - such as a heavyweight not being able to perform a moonsault from the top ropes, or a cruiserweight not being able to power bomb a larger opponent. The engine is based upon a B-button strike and A-button grapple system. Holding the respective button results in a 'heavy' strike or grapple. Finishing off an opponent generally involves performing your wrestler's special move on them, which can be executed with the flick of the control stick once the wrestler has filled his Spirit Meter, and will be followed with a TV-style instant replay. Depending on the match settings set beforehand, a player can find hidden weapons from the crowd, be assisted or double-teamed by a run-in interference or make his opponent tap out with a submission hold.</p><p>There are several match types and game modes, all of which can take place in a number of arenas designed after the current WCW pay-per-view events of the time. New to the series is a 40-man battle royal, allowing for 4 players or computer-controlled wrestlers to square off in the ring at a time until one is pinned or submitted; at which point they are replaced by a new entrant, continuing on and on until up to 40 wrestlers have entered. The main focus of single-player wrestling revolved around the championship mode, in which a player chooses a wrestler and a championship belt to compete for - beginning with the TV Title on up to the WCW World Championship. After defeating a successive series of opponents, the player then goes toe-to-toe with the current holder of the belt for possession of the championship; upon victory a new wrestler and new championship is unlocked. 1-4 player exhibition matches can be set to play out with an assortment of various settings and rules - such as 2 vs. 1 handicaps, no-disqualifications and tag team battles.</p><p>The game automatically tracks and saves to the battery the stats and arcade-style scores accrued across the various game modes. Also available to the player is a costume editing feature, allowing for quick color changes to full-on wardrobe conversions for each wrestler.</p><p>Revenge was a refinement of the engine seminal wrestling house AKI developed for WCW/NWO World Tour. It would be their final WCW game, as the developer moved on and converted their engine to the WWF license with their next release.</p>"},{"name":"Wetrix","year":1998,"developer":"Zed Two Game Design Studio","url":"0#Wetrix%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":5313996,"score":7.3,"genres":"Puzzle > Diagonal-down > Real-time > Falling block puzzle","desc":"<p>In <em>Wetrix</em> the player must build barriers on the arena to stop the water from leaking out. As time progresses, rain starts to fall onto the arena, so the player must try to keep the walls as high as possible to catch the water. Too much on the screen will start an earthquake. Ice blocks fall to freeze the water. Bombs drop, leaving holes in walls, and fireballs vaporize the water. The aim is to get as high a score as possible. There is a practice mode available, and the game can be played in multiplayer against a friend.</p>"},{"name":"Wheel of Fortune","year":1997,"developer":"GameTek, Inc.","url":"0#Wheel%20of%20Fortune%20%28USA%29.zip","filesize":2240797,"score":5.8,"genres":"Puzzle > Game show / trivia / quiz > Word construction > Licensed","desc":"<p>This game is an interactive version of the popular U.S. quiz show Wheel of Fortune complete with hostess Vanna White.</p><p>The game is played by trying to find a hidden word with only a few guesses allowed for the letters which is very similar to the pen and paper game Hangman. The other round which features the Wheel of Fortune involves you spinning the wheel which has various prizes both good and bad and whatever the pointer stops on when it stops revolving is what the player wins. This can be cash, a free spin or if you're very unlucky Bankruptcy which means you lose all the money you've earned up to that point.</p><p>Up to 3 Players can play together in multiplayer mode</p>"},{"name":"Wildwaters","year":1999,"developer":"Looking Glass Studios","url":"0#Wildwaters%20%28USA%29%20%28Proto%29.zip","filesize":10538905,"score":"","genres":"Action > Sports > Top-down > Sailing / boating","desc":"<p><em>Wildwater</em> simulates rowing on a narrow strip of river, with half the screen used for each of 2 available players (either human or computer). Both must clear 8 gates in order, with the first 7 randomly placed on each game, within a 5 minute time limit. Lots of backtracking is require to clear them in order, which puts a premium on careful boat control. Controls aim to realistically simulate the steering and navigation of a raft, requiring repeat pressing of a single key to turn, with variable speed and reverse rowing possible. Left and right oars look different to ensure that the player remains orientated. River currents are incorporated, mostly from east to west, complete with whirlpools, weirs and eddies, and visible splashes.</p>"},{"name":"WinBack: Covert Operations","year":1999,"developer":"KOEI Co., Ltd.","url":"0#Operation%20WinBack%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":11096435,"score":7.1,"genres":"Action > Strategy > Behind view > Shooter","desc":"<p>A combination of Metal Gear Solid and Syphon Filter, <em>WinBack</em> has you as part of the Strategic Covert Actions Team (SCAT), who have been called upon to stop a terrorist group called the Crying Lions. Already the enemy has destroyed the Center for Space Research, and have taken over a high-security complex that houses the GULF Strategic Weapons System. You have three hours to take back the complex, before the system lets loose on the world.</p>"},{"name":"WipEout 64","year":1998,"developer":"Psygnosis Limited","url":"0#Wipeout%2064%20%28USA%29.zip","filesize":6057222,"score":7.7,"genres":"Action > Racing / Driving > 1st-person > Behind view > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p><em>WipEout 64</em> is a follow-up to WipEout XL, taking place one year later (2098). Like other installments in the series, it is a futuristic racing game in which players control hovercrafts and use weapons to damage the opponents' vehicles, trying to finish the race in the first position. The gameplay is similar to its predecessor in many aspects, such selection of hovercrafts, handling system, visuals, etc. The main differences include:</p><ul><li>Split-screen multiplayer gameplay (up to four players) is introduced</li><li>Challenge mode includes: Race, Time Trial, Weapon, and Super Combo Challenges</li><li>Each team has a special weapon of its own </li><li>New racing tracks</li><li>The Piranha vehicle is now capable of using weapons</li></ul>"},{"name":"Wonder Project J2","year":1996,"developer":"Givro"},{"name":"World Cup 98","year":1998,"developer":"Electronic Arts Canada","url":"0#World%20Cup%2098%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CDa%29.zip","filesize":11132118,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Europe > Licensed","desc":"<p>The licensed game of the 1998 Football World Cup held in France from June 10 to July 12 and the first World Cup licensed game distributed and developed by Electronic Arts features a tweaked FIFA 98 engine, with all 10 stadiums accurately designed and all 32 teams (plus 8 teams that failed to qualify but still deemed too important to leave out) featuring real names and close \"look-a-like\" kits. Changes done to the 3D engine feature include on the fly in-game management with better player positioning AI (including the goalkeeper), and faster gameplay. An editor to change all player information is included, which affects simulated data: the team with higher ratings has a better chance of progressing through the next stage regardless if it is Brazil or China.</p><p>It's possible to play with the groups as determined by the real draw, randomize or customize them to the players' likings, mixing both qualified and additional teams. Once the player wins a trophy, the first of the <em>Classics</em> matches is unlocked. These are eight final matches in the competition's history which are unlocked as the player beats them one by one. Friendlies, training matches and practice penalty shootouts close the modes available.</p>"},{"name":"World Driver Championship","year":1999,"developer":"Boss Game Studios Inc.","url":"0#World%20Driver%20Championship%20%28USA%29.zip","filesize":14594412,"score":7.6,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing","desc":"<p><em>World Driver Championship</em> allows players to develop a racing career as they compete for job offers with each of the 15 World Driver Teams. The game features 10 tracks (Sydney, Kyoto, Rome, and others), 20 challenging events spread across two different levels of competition, and over 30 exotic cars. The game strives to imitate realistic physics and car handling.</p>"},{"name":"Worms: Armageddon","year":1999,"developer":"Infogrames Europe SA","url":"0#Worms%20Armageddon%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":9590235,"score":7.9,"genres":"Strategy > Side view > 2D scrolling > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p><em>Worms: Armageddon</em> is a standalone expansion to Worms 2, introducing extensive improvements and additions over the original game, among which are:</p><ul><li>16 new weapons and 6 new utilities, with some existing ones changed or rebalanced (3 were removed entirely)</li><li>new singleplayer campaigns and challenges</li><li>new gameplay schemes, some of which have to be unlocked through campaign missions (certain weapons are only available in some of these schemes)</li><li>new menu interface, sounds, voice banks, and music</li><li>new predefined maps</li><li>expanded map editor, included voice bank editor (the latter is a separate application)</li><li>teams can now have custom representative flags, victory anthems, and gravestones</li><li>each team is assigned a special weapon of choice - Holy Hand Grenade, Flamethrower, Mad Cows, or Old Lady</li><li>AI-controlled teams now have one of five difficulty settings</li><li>jumping controls updated so worms can jump backwards and do backflips</li><li>instead of selecting a worm at the start of each turn, this option is now regarded as a utility and usually has a limited number of uses</li><li>new multiplayer options, including a more elaborate WormNET lobby</li></ul><p>Like the previous <em>Worms</em> installments, the game is an artillery variant. The player give an artillery piece a shot angle and shot power, and try to hit the opponent, taking into account wind effects. The player and the opponent exchange these shots in a turn-based fashion. The game puts the player in command of a team of up to eight worms, which can move around the landscape (one at a time), using many types of weapons to try to dispatch the enemy, from bazookas to mini-guns to exploding sheep. In some situations, the worms can also jump, swing by rope, and descend with a parachute.</p><p>As of 2002, updates have been handled by an authorized community member named Deadcode, who was joined in 2006 by CyberShadow. The two have removed many bugs and glitches, improved game stability and compatibility for Windows operating systems that have been released along the way, added new features (more resolutions, expanded options and settings, auto-recorded match replays, full PNG support for map importing...) and integrated WormKit, an extension framework for the game which allows for easier modding. These updates have been available from Team17's servers and are included by default in subsequent digital releases.</p>"},{"name":"WWF Attitude","year":1999,"developer":"Iguana Entertainment Incorporated","url":"0#WWF%20Attitude%20%28USA%29.zip","filesize":30735779,"score":6.9,"genres":"Action > Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWF Attitude</em> is a follow-up to WWF War Zone. The gameplay is similar to that of its predecessor, including a variety of game modes and specialty matches, such as Royal Rumble, Survivor Series, Tornado matches, and others. The Create-A-Wrestler mode has been slightly enhanced, adding commentary and crowd chants responding to the superstars' nicknames. The Challenge Mode of the previous game is replaced by the Career Mode, allowing the player-controlled wrestler to participate in house shows, winning matches to work his way up to the prestigious Raw show, pay-per-view events, and eventually compete for the title. A few new match types and fall superstar entrances have also been added. </p><p>New game modes include Create-A-Stable and a Pay-Per-View mode, which allows the player to set up an own wrestling event. The game includes an option to customize arenas, editing the color of lights, ropes, turnbuckles, logos etc.</p>"},{"name":"WWF No Mercy","year":2000,"developer":"Asmik Ace Entertainment, Inc.","url":"0#WWF%20No%20Mercy%20%28USA%29%20%28Rev%201%29.zip","filesize":25926944,"score":8.2,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWF No Mercy</em> allows players to compete for seven different WWF titles, with each belt getting its own unique story. Stories can be replayed, allowing players to defend their title in a storyline. Upon successful completion of a story mode, players will unlock the title they were competing for in the Exhibition mode, where titles can be won and defended as the players see fit.</p><p>A maximum of four players can compete in a range of modes, including caged and ladder contests and pay-per-view events. The player can also create an own event and compete for WWF titles unlocked in Championship mode. Certain matches are held outside the ring, in four different backstage locations.</p>"},{"name":"WWF War Zone","year":1998,"developer":"Iguana West","url":"0#WWF%20War%20Zone%20%28USA%29.zip","filesize":11350612,"score":7.5,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWF War Zone</em> is the first WWF-based wrestling game to use fully 3D character and environment graphics. The wrestlers can execute traditional punch and kicks, as well as various grapple moves, which the player can perform by pressing a button assigned to initial grapple in a combination with different direction buttons. Commentary, wrestler introductions (with short voice clips), crowd reactions, and full-motion sequences (in the PlayStation version only) are included.</p><p>The game features seven basic gameplay modes, allowing configurations of one to four players. These include training mode, one-on-one, tag team, cage match, weapons match, tornado tag team, and war (elimination free for all). Two additional modes, Royal Rumble and gauntlet, are exclusive to the Nintendo 64 version. The player can also create and customize his own wrestler, taking him through the WWF challenge. The new wrestler finds himself at the bottom of a pyramid, and has to challenge wrestlers situated immediately above him, gradually working his way through to the title. Sometimes previously defeated wrestlers will challenge the player to a \"grudge match\", which usually consists of special encounters, such as battles with weapons or cage matches.</p>"},{"name":"WWF Wrestlemania 2000","year":1999,"developer":"AKI Corporation","url":"0#WWF%20WrestleMania%202000%20%28USA%29.zip","filesize":22373607,"score":7.6,"genres":"Sports > Diagonal-down > Wrestling > Licensed","desc":"<p><em>WWF Wrestlemania 2000</em> is THQ's first WWF licensed game after making two games based on WCW. The gameplay is similar to that of WCW/NWO Revenge, adding new features such as cage matches, custom entrances, and the possibility to create and customize player's own wrestlers.</p><p>The game features more than fifty real WWF stars, as well as the option for sixteen custom wrestlers. All the wrestlers come with their real-life theme music, entrance videos (made into slide shows) and entrance performances. Another addition is the \"Road to Wrestlemania\" mode, an enhanced tournament where players can challenge for any number of belts and be challenged by other wrestlers in a twelve-month journey that finally leads to Wrestlemania 2000 itself.</p>"}]