[{"name":"Zool: Maju Tsukai Densetsu (Japan)","year":1999,"developer":"Pandora Box","url":"0#Zool%20-%20Majuu%20Tsukai%20Densetsu%20%28Japan%29.zip","filesize":8143668,"score":"","genres":"Role-playing (RPG) > Behind view > Diagonal-down > Anime / Manga > Real-time > Turn-based > Japanese-style RPG (JRPG) > Direct control > Menu structures > Fantasy","desc":"<p><em>Zool</em> is a JRPG based around Monster collecting, taking clear influences popular series like Dragon Quest and Pokémon. The word Zool is meant to be a combination of Zoo and School.</p><p>The story opens with the orhan 10 year old main character, named Leo by default, finding a hatched baby monster of a rare breed in the forest. It follows him home so he keeps it and and names it バーニィ(Bānyi or Bernie) by default. Monsters and humans generally live together, but there are friendly competitions held each year to decide the best monster battler, with these competitions drawing in more legendary rare monsters which are desirable for the villains. The first plotline conflict is Leo is pursued by Roche, a rare monster collector and his 2 henchmen Matt &amp; Mitt who try to steal his new friend, with more characters and villains showing up throughout the game.</p><p>The game is split into two main sections, towns and the overworlds/dungeons segments. Inside towns players move a cursor around to select which building they want to visit, there is no free roam in these sections. Towns consist of the many homes and taverns of villagers who must often be talked to in order to progress the storyline, shops for buying and selling items, various houses and inns to save progress and heal, and monster daycares for players to store monsters they collect. Exiting a town brings players to the overworld where random battles occur and new towns, dungeons, and other landmarks that can be reached by foot. At certain points players enter labyrinthine 3D dungeons where the players can walk up to doors, treasure items, and must find their way to the end. Keys must be found in item bags, desk drawers, or chests. </p><p>Battles are automatic with monsters making their own choices after a small period of time passes. Players can only blow their whistle to directly order a monster, which costs musical notes on the bottom of the screen which regenerate over time.</p><p>Players have 4 commands via the 4 C-buttons: C-Up=Attack, C-Left=Magic, C-Right=Defend, C-Down=Attempt to flee battle. Each monster only has 1 attack and 1 magic move, and since items can't be used in battles most attacks happen slowly in real time so players have opportunities to defend.</p><p>Players can have 4 monsters in a party and hold 8 monsters total in their inventory. The blue Bagny however cannot be removed from the players party. Other monsters must be taken to the monster storage establishments where they can be kept or deleted. Each monster can also have up to 2 pieces of equipment placed on them.</p><p>At the end of every battle players earns experience points for themselves and each monster used. Also dropped by enemies is Pom which is money, items, etc. After being defeated players must view the opponents stats, and choose if they want to try and recruit them for their team which is based on the monsters negotiation stat &amp; level. This mirrors the recruitment mechanics popularized by Dragon Quest V in 1992. Later on players get a journal for keeping a catalog of the 168 monsters in the game, though it's only about 50 with most monsters just having 3 color variations.</p><p>Storywise Zool is extremely text heavy and can be difficult to enjoy because of the Japanese text, though its gameplay is seemingly balanced for children as it is extremely easy and barebones with its combat.</p>"}]