[{"name":"Aaahh!!! Real Monsters","year":1995,"developer":"Realtime Associates, Inc.","url":"5#A/Aaahh%21%21%21%20Real%20Monsters%20%28NA%29.sfc","filesize":2097152,"score":6.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>In this game, based on the popular Nickelodeon animated series, you control three monsters: Ickis, Oblina, and Krumm. The Gromble, a headmaster in monster school, needs you to perform the final test - monster Midterm Exam - in order to prove yourselves to be <em>real</em> monsters. You should collect trash, throw it on people, and scare them!</p><p>This is a platform game, where you control three characters. Each one of them has a special move that is often used to solve puzzles and overcome obstacles: Ickis can fly for a short time, Oblina can reach high ledges, and Krumm can scan off-screen areas. They can also collect monster books, that will teach them to scare people. Help the three monsters to graduate!</p>"},{"name":"ABC Monday Night Football","year":1993,"developer":"Data East Corporation","url":"5#A/ABC%20Monday%20Night%20Football%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p><em>ABC Monday Night Football</em> is a football game licensed from the television presentation of the same name. It features the likeness of broadcaster Frank Gifford and the logo of a popular sports drink, but has no league license, so features generic team names with made-up logos and player names.</p><p>The two main playing modes are pre-season exhibition games and a full season. 28 teams are available, and it is possible to rename teams and players and even create custom teams. A two-player mode for versus games is also available.</p><p>During games, a standard behind-the-quarterback view of the field is used. The playbook consists of 10 plays. Controls differ from the norm established by other games in that button-tapping increases the power of kicks and running speed during rushing and defense. The game automatically saves impressive plays as replays that can later be watched from the menu.</p>"},{"name":"Accele Brid","year":1993,"developer":"Genki Co., Ltd."},{"name":"ACME Animation Factory","year":1994,"developer":"Probe Software Ltd.","url":"5#A/ACME%20Animation%20Factory%20%28NA%29.sfc","filesize":1048576,"score":6.7,"genres":"Educational > Cards / tiles > Graphics / art > Music > Licensed","desc":"<p><em>ACME Animation Factory</em> is essentially Mario Paint with a Looney Tunes license. The player can choose from 18 pre-set animations of their favorite cartoon characters and super impose them over a scene to create their very own cartoon. Much like <em>Mario Paint</em>, they can also color blank drawings, create their own music and even play games like Solitaire and Mix 'n' Match. Players can also save their own creations for later viewing.</p>"},{"name":"Acrobat Mission","year":1992,"developer":"UPL Co., Ltd"},{"name":"ActRaiser","year":1990,"developer":"Quintet Co., Ltd.","url":"6#ActRaiser%20%28USA%29.sfc","filesize":1048576,"score":8,"genres":"Action > Strategy > Diagonal-down > Side view > 2D scrolling > Platform > RPG elements > Fantasy > Regional differences","desc":"<p><em>ActRaiser</em> was one of the early SNES games, drawing upon the success of side-scrolling platform action titles and the building model of Sim City. You play \"The Master\" (essentially God), and must save the world from evil. </p><p>First you purge the land by sending your spirit into a warrior with a big sword and magic powers. This side scrolling portion puts you in many different locales, from swamps and forests, to pyramids and snowy mountaintops. </p><p>As you eliminate evil from different parts of the land, you allow villagers to return and build their towns. You then control an angel who helps guide the villagers in their town building, and can send down miracles to aid them in their needs.</p>"},{"name":"ActRaiser 2","year":1993,"developer":"Quintet Co., Ltd.","url":"6#ActRaiser%202%20%28USA%29.sfc","filesize":1572864,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p>Players control \"The Master,\" a god-like spirit sent down from the heavens, and fight to eradicate evil from the land. This sequel to ActRaiser focuses entirely on the side-scrolling action of the original, and has 14 levels with new monsters, new abilities, and new super powers.</p><p>You still control a \"Cloud Palace\" across a zoomable map of the world, choosing your next area of battle. In addition, many of the sound effects from the original game make their reappearance, as well as some hidden RPG elements. </p><p>Changes from the original <em>ActRaiser</em> include the elimination of the village-building mode, a move from a battery-save to password-save system, and a new musical score.</p>"},{"name":"Addams Family Values","year":1995,"developer":"Ocean Software Ltd.","url":"5#A/Addams%20Family%20Values%20%28NA%29.sfc","filesize":2097152,"score":6.6,"genres":"Action > Top-down > RPG elements > Licensed","desc":"<p>The evil Debbie Jelinksi is harming the Addams family once again... She has kidnapped Baby Pubert, and Uncle Fester is the one who must find him and to bring him back to his loving family. The game is based on the live-action movie of the same name.</p><p><em>Addams Family Values</em> is an action adventure game with slight RPG elements (you gain more hit points while proceeding in the game, can upgrade your equipment and special attacks). You control Fester, by moving him around, fighting regular enemies and bosses, talking to members of Addams household, and occasionally solving puzzles. The combat is pure action,  Zelda-style.</p>"},{"name":"Addams Family, The","year":1992,"developer":"Ocean Software Ltd.","url":"5#T/The%20Addams%20Family%20%28NA%29.sfc","filesize":1048576,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Addams Family is a platform game based on the characters and settings from the movie (which, in turn, is based on the famous 1960's television series, which in turn is based on Charles Addams cartoon of the same name, which was featured in the magazine, The New Yorker, in the 1930s).</p><p>The game takes place towards the end of the movie: the Addams Family has been evicted from their home by a court order issued by a backstabbing attorney (there's one for the books), Tully Alford. Even worse, the other Addamses: Morticia, Pugsley, Wednesday, Granny, and Lurch have gone missing.</p><p>As Gomez, you must tour the Addams mansion in search of your lost family, battling out mysterious monsters and evading traps, and eventually face your nemesis, Tully.</p>"},{"name":"Addams Family, The: Pugsley's Scavenger Hunt","year":1993,"developer":"Ocean Software Ltd.","url":"5#T/The%20Addams%20Family%20-%20Pugsley%27s%20Scavenger%20Hunt%20%28NA%29.sfc","filesize":1048576,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Addams Family: Pugsley's Scavenger Hunt</em> is a side-scrolling platformer based on the second animated TV series <em>The Addams Family</em> (1992). The player takes the role of Pugsley who gets challenged to a scavenger hunt by his sister Wednesday. He has to retrieve six items which are of course hidden in six levels which can be accessed in any order. The gameplay follows the usual platforming standards: Pugsley moves from left to right while jumping a lot, avoiding enemies and sometimes solving switch puzzles. Pugsley can take three hits before dying but if he collects enough dollar symbols he can replenish his health.</p>"},{"name":"Advanced V.G.","year":1995,"developer":"Technical Group Laboratory, Inc."},{"name":"Adventures of Batman & Robin, The","year":1994,"developer":"Konami Co., Ltd.","url":"6#Adventures%20of%20Batman%20%26%20Robin%2C%20The%20%28USA%29.sfc","filesize":2097152,"score":7.7,"genres":"Action > Side view > Top-down > 2D scrolling > Platform > Licensed","desc":"<p>Konami's game based on the 90s animated series starring the Caped Crusader sends him against his most famous enemies in a platforming/beat'em'up title.</p><p>Each of the game's eight levels (or episodes) sends Batman against one particular villain. Most levels present Batman with a large number of henchmen to take out and environmental dangers to avoid on his way to one or more boss battles, but some deviate from the norm. For instance, Catwoman's stage is a large chase over Gotham City's rooftops with no enemies besides Catwoman herself. In the Penguin's level, Batman must navigate the dark corridors of Gotham City's museum, rescuing the staff. Two-Face's level is a driving sequence, seen from a top-down perspective.</p><p>Besides kicks, throws and punches, Batman can use a variety of equipment against the enemies. Always available are Batarangs and the grappling hook. Before each mission, Batman can also select additional equipment, like knockout gas spray, throwing stars, smoke bombs and plastic explosives, all with limited ammunition. Special equipment required for certain levels include a flashlight, gas mask and X-ray goggles. If some necessary equipment is missing, it is always possible to return to the Batcave to change the gear and then restart the current level.</p><p>Many of the situations and environments of the levels are based on episodes from the series and the game's graphics emulate the animation and drawing style of the show.</p>"},{"name":"Adventures of Dr. Franken, The","year":1993,"developer":"Motivetime Ltd.","url":"5#T/The%20Adventures%20of%20Dr.%20Franken%20%28NA%29.sfc","filesize":1048576,"score":6.6,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Horror","desc":"<p>Franky and his girlfriend Bitsy are planning a vacation to New York. There's just one problem: Bitsy doesn't have a passport. Our protagonist comes up with a brilliant idea: He takes Bitsy apart and mails her to New York in different packages, where he will put her back together. Unfortunately for the couple, Bitsy has been lost in the mail. It is up to Franky to find her parts and put her back together.</p><p><em>The Adventures of Dr. Franken</em> is a standard platformer where the player navigates platforms and avoids enemies. Touching too many enemies result in death. To defeat himself Franky has the ability to kick foes. The goal of every level is to find a package which is hidden in it. To reach it Franky also has to solve switch puzzles. There are overall 20 levels including four bonus levels.</p>"},{"name":"Adventures of Mighty Max, The","year":1994,"developer":"WJS Design","url":"5#T/The%20Adventures%20of%20Mighty%20Max%20%28NTSC%20Conversion%29.sfc","filesize":1048576,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>The Adventures of Mighty Max</em> is based on the TV cartoon <em>Mighty Max</em> which in turn is based on a series of toys.Max is a kid who possesses a magic cap that allows you to travel across different world and to save people who get in trouble in other dimensions. But his archenemy, the demonic Skull Master, has recently locked all the portals Max was using for inter-dimensional travel. However, the Skull Master has kept some of the portals for himself, keeping there some of his destructive weapons. It's time to destroy those weapons and to stop Skull Master!</p><p>This is a platform game in which you control Max himself or one of his two side-kicks (that doesn't influence the gameplay). You travel through several different worlds. Your goal is to find Skull Master's weapons, which are scattered around the level, and to destroy them. The levels are timed, and there are also plenty of enemies who will disturb you on your way to the goal.</p>"},{"name":"Adventures of Rocky and Bullwinkle and Friends, The","year":1993,"developer":"Absolute Entertainment, Inc.","url":"5#T/The%20Adventures%20of%20Rocky%20and%20Bullwinkle%20and%20Friends%20%28NA%29.sfc","filesize":1048576,"score":5.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Adventures of Rocky and Bullwinkle</em> is the video game adaptation of the 60's cartoon series staring Bullwinkle, a moose, and Rocky, a flying squirrel. The game plays out much like an episode of the show. The story begins at the dedication of the Frostbite Falls Rocky and Bullwinkle museum. Unfortunately, the not-so-nice Boris and Natasha have disguised themselves as security guards for the museum and managed to steal some of the priceless artifacts.</p><p>Bullwinkle and Rocky must track down the stolen artifacts and return order to Frostbite Falls. Most of the action is of the side-scrolling platformer variety, but along the way, you will get to play lots of mini-games involving characters from the show. During the platforming sections you can switch instantly between the two protagonists. Both play differently: Bullwinkle can throw bombs at enemies and Rocky can fly for short instances.</p>"},{"name":"Adventures of Tintin, The: Prisoners of the Sun","year":1996,"developer":"Infogrames Europe SA","url":"5#T/The%20Adventures%20of%20Tintin%20-%20Prisoners%20of%20the%20Sun%20%28EU%29.sfc","filesize":2097152,"score":7.7,"genres":"Action > Side view > Platform > Licensed","desc":"<p><em>The Adventures of Tintin: Prisoners of the Sun</em> is based on the Belgian comic book of the same name. The basic plotline is the same: Professor Cuthbert Calculus gets kidnapped and the player, in the role of Tintin, needs to rescue him. The rest is more loosely adapted: in contrast to the comic, which is mostly based in Peru, this game offers many different locations all over the world.</p><p>The gameplay itself is a typical platforming action: Tintin walks through the levels while avoiding the enemies. Pretty much everyone, e.g. little girls and security guards, is out to hurt Tintin who has no means of defending himself. This means the most important aspect is learning enemy placements, their patterns and how to avoid them. But he has to hurry because of the time limit. Required for success is the usage of the two playing plains: from the player's perspective in the foreground and further towards the background. Tintin can switch between the two at any time.</p>"},{"name":"Adventures of Yogi Bear","year":1994,"developer":"Blue Turtle"},{"name":"Aero Fighters","year":1993,"developer":"Video System Co., Ltd.","url":"6#Aero%20Fighters%20%28USA%29.sfc","filesize":1310720,"score":7,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Flight / aviation","desc":"<p><em>Aero Fighters</em> is a vertical scrolling shooter. There are four pilots from four countries (Japan, Sweden, United Kingdom and United States) involved in a war. Each country has their own plane: F18, FSX, AJ-37 or AV-8. Every plane has a different upgradeable primary and special weapon. The game features overall seven levels and a few of them are presented in a random order.</p>"},{"name":"Aero the Acro-Bat","year":1993,"developer":"Iguana Entertainment Incorporated","url":"5#A/Aero%20the%20Acro-Bat%20%28NA%29.sfc","filesize":1048576,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>You play as bat Aero, who have to stop the mad scientist Edgar Ektor, who is trying to rid the world of amusement and fun. So you jump through the circus-style levels, using different kinds of machines such as catapults, cannons, bubble machines, platforms, etc., collecting various power-ups such as cheese, soda, keys, clocks, etc. and avoiding lethal obstacles.</p>"},{"name":"Aero the Acro-Bat 2","year":1994,"developer":"Iguana Entertainment Incorporated","url":"5#A/Aero%20the%20Acro-Bat%202%20%28NA%29.sfc","filesize":2097152,"score":7.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>In the sequel to Aero the Acro-Bat you have to defeat evil industrialist Edgar Ektor once again. He is back and again with bad ideas, so you - in the role of Aero - have to find and destroy him before he carries out his diabolical \"Plan B\". Like in the last installment, you have to jump, escape lethal obstacles and progress in time. This game features more moves for Aero, more mechanisms to use and more items to collect.</p>"},{"name":"Aerobiz","year":1992,"developer":"KOEI Co., Ltd.","url":"5#A/Aerobiz%20%28NA%29.sfc","filesize":1048576,"score":7,"genres":"Strategy > Top-down > Managerial / business simulation > Flight / aviation","desc":"<p>You are the CEO of an airline company. Your goal is to become the most successful airline in the world by connecting all 22 cities with air routes, maintain a profit, and meet the required quota of passengers. If you cannot turn a profit for a year or meet the victory conditions in 32 years you lose. Some strategic decisions you must make include negotiating for open air routes, purchasing or selling aircraft, invest in branch offices and hotels, advertise your airline and set budgets. You must also pay attention to statistics like quarterly and annual sales reports, as well as city data. World events also affect your airline, from natural disasters to war and even the Olympic games, all of which will affect how many passengers you get. All the planes in the game are based on real-life aircraft, such as the Boeing 747 and the Concorde.</p>"},{"name":"Aerobiz Supersonic","year":1993,"developer":"KOEI Co., Ltd."},{"name":"Air Cavalry","year":1995,"developer":"Synergistic Software, Inc.","url":"5#A/Air%20Cavalry%20%28NA%29.sfc","filesize":1048576,"score":6,"genres":"Action > Behind view > Shooter > Helicopter","desc":"<p>A standard helicopter war-game, featuring the Air Cavalry division. The game is played in a third person view using mode 7 graphics, with the cockpit displayed in splitscreen. There are three campaign areas to fly in: Middle East, Indonesia, and Central America. There are also 2 player versus and co-op split-screen modes.</p>"},{"name":"Air Strike Patrol","year":1994,"developer":"Opus Corp.","url":"7#A.S.P.%20Air%20Strike%20Patrol%20%28USA%29.sfc","filesize":1048576,"score":7.1,"genres":"Action > Isometric > Shooter > Flight / aviation","desc":"<p>Playing as a jet pilot of the \"Coalition\" force, players take control of either an F-15 Eagle, or an A-10 Tankbuster jet. The mission is to neutralise the offensive forces of the Zarak army, who have recently invaded a smaller neighbouring country. The Zarak army has many ground units, including tanks, stinger-missile launchers, SCUD missiles and armored vehicles.</p><p>To accomplish the ultimate goal of defeating the Zarak army, players venture out on numerous missions (called \"sorties\") that have varied and specific objectives. Typically, various installations such as radar sites, air bases or ground units are the target. Other missions include disabling an oil-pipeline and destroying SCUD launchers before they fire. </p><p>Pre-mission screens ask the player to select from the two planes. Then,  the player can specify the armament to carry into the sortie. Air-to-ground and air-to-air missiles are available for each of the planes. Here, a strategic choice between countering either air units or ground units has to be made, as each area (of which there are eight) is patrolled by opposing enemy F-15 jets.</p><p>The game is played through the isometric-perspective, and the plane's speed and direction can be be adjusted in real-time. Altitude however, is fixed. A missile/bomb-target is constantly shown on the ground before the plane, allowing players to aim at units, or, with the F-15, a lock-on targeting system is available.</p><p>The game also makes use of a briefing before each mission, and also a further briefing by an animated colonel on the tarmac just before take-off. Various debriefing screens are shown also, and, if the player attains a certain strike rate, a \"GNN\" news story may play out. For each mission, a time-limit and minimum destruction-rate must be met. You can take-off as often as need be to attain this.</p>"},{"name":"Al Unser Jr.'s Road to the Top","year":1994,"developer":"Radical Entertainment Inc.","url":"5#A/Al%20Unser%20Jr.%27s%20Road%20to%20the%20Top%20%28NA%29.sfc","filesize":1048576,"score":5.8,"genres":"Action > Racing / Driving > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>This racing game features both a practice and a Road to the Top mode. </p><p>In the Road to the Top mode, four different racing events are held with three courses for each event. Each event features a different vehicle to use. The player can choose from one of three vehicles which feature different attributes for handling, top speed, braking, and acceleration. The player begins by racing go-karts, then moves up to snow mobiles, then IROC racing cars, and then finally Indy racing cars. If the player places high enough in all the races, then the final challenge is to take on Al Unser, Jr. in the finals in Vancouver. </p><p>In the practice mode, the player can practice every course in the game except for the final race.</p>"},{"name":"Albert Odyssey","year":1993,"developer":"Tokai Engineering"},{"name":"Alcahest","year":1993,"developer":"HAL Laboratory, Inc.","url":"5#A/Alcahest%20%28English%20Translated%2C%20Rev%201%20With%20Stage%20Titles%20Fix%29.sfc","filesize":1179648,"score":7.2,"genres":"Action > Role-playing (RPG) > Top-down > Fantasy","desc":"<p>Past and future are connected in a way mortals do not understand...  A star was glowing up in the sky, and the demon god Alcahest appeared, bringing chaos and destruction to the world. A single swordsman stood in defiance. The four powers that protect the world, the Guardians, gave him their power, and with it the swordsman slew the demon and restored peace in the world. </p><p>Thousand years have passed. And a new battle is already on the way. A cruel emperor leads his troops towards conquest. The kingdom of Panakeia is defending itself with the aid of its knights. Once again, the ominous star shines in the sky, indicating the demon's revival. With the help of Alcahest's power, the evil emperor wants to conquer the world. But the new generation also brings the new hero - the brave swordsman Alen. Aided by the Guardians, Alen must stop the Empire's evil plans and to destroy Alcahest once again.</p><p>This is an action game with RPG elements. You wander around slaying enemies in real time combat, gathering treasure on the way, and occasionally participating in boss battles. When you gather enough experience from fighting, you gain extra hit points. You can also upgrade your weapons. On the way you'll meet some characters who will join your party for short time, and you'll be able to use their special attacks and magic.</p>"},{"name":"Alien 3","year":1993,"developer":"Probe Software Ltd.","url":"7#Alien%203%20%28Europe%29.sfc","filesize":1048576,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Sci-fi / futuristic > Horror > Licensed","desc":"<p>Lt. Ellen Ripley is sleeping in the cryogenic chamber aboard the spaceship Sulaco. A fire breaks out in the chamber, causing Ripley to be placed in an E.E.V. (Emergency Escape Vehicle) which is jettisoned into space. It crash lands on the planet Florina \"Fury\" 161, a planet that houses a maximum security prison. She finds out that the prison is overrun by aliens.</p><p><em>Alien³</em> for the Super Nintendo is very different from the <em>Alien³</em> adaptions for other systems. The game consists of six stages, and in each, you are given a series of missions to complete that include rescuing prisoners; repairing pipes, fuses, and junction boxes; welding doors shut; and destroying alien eggs, as well as the mother alien. Once you have accomplished all missions in a stage, you move on to the next stage where you will receive new mission objectives. Missions are outlined via a terminal, and a series of blueprints help you navigate your way through the complex.</p><p>Making your job difficult are several types of aliens, which can be killed by using pulse rifles, grenade launchers, and flamethrowers (which comes in three flavors). Med-kits can be picked up that will increase your health.</p>"},{"name":"Alien Vs Predator","year":1993,"developer":"Jordan Information Service Co., Ltd.","url":"7#Alien%20vs%20Predator%20%28Europe%29.sfc","filesize":1048576,"score":5.2,"genres":"Action > Side view > Arcade > Beat 'em up / brawler > Sci-fi / futuristic","desc":"<p>Based on the <em>Alien versus Predator</em> comic book series. During the 25th century, mankind has colonized many planets. On one of these, New Shanghai, strange creatures have been discovered. These aliens cause much havoc. New Shanghai initiates a distress call to other planets in the galaxy. A cloaked ship belonging to hunting creatures known as predators intercepts the message. The predators on board decide that these strange alien creatures might make worthy trophies for the collection. The player takes the role of one of the predators. </p><p>The predator will fight through several levels of alien creatures in aside scrolling manner. The predator's abilities includes attacking,jumping, sliding and firing bolts from it's shoulder cannon. Additionally, the shoulder cannon can be charged up to unleash adevastating attack that also harms the Predator. Most aliens willdrop power-ups which include health, trophy skulls, a double edgedthrowing weapon, throwing spears and active camouflage. Boss aliens wait at the end of most levels.</p>"},{"name":"All-American Championship Football","year":1994,"developer":"Malibu Interactive"},{"name":"Amazing Spider-Man, The: Lethal Foes","year":1995,"developer":"Argent"},{"name":"American Gladiators","year":1993,"developer":"Incredible Technologies, Inc.","url":"5#A/American%20Gladiators%20%28NA%29.sfc","filesize":1048576,"score":4.3,"genres":"Action > Simulation > Side view > Top-down > Fighting > Game show / trivia / quiz > Platform > Licensed","desc":"<p><em>American Gladiators</em> is licensed from the popular TV show of the same name. It features a series of events testing players' strength, speed and skill against a trained team of ten 'Gladiators', five male and five female. The female characters are Ice, Gold, Lace, Blaze and Zap, most of whom are known for their bodybuilding achievements. Main male characters are Turbo, Nitro (who was featured in several television commercials for American television), Gemini, Thunder and Laser (Mr. Montana of 1986).</p><p>In total there are seven events, all viewed from third-person views. The final one is the Eliminator assault course, in which you compete directly against an opponent.</p>"},{"name":"American Tail, An: Fievel Goes West","year":1994,"developer":"Shimada Kikaku","url":"7#An%20American%20Tail%3B%20Fievel%20Goes%20West%20%28Europe%29.sfc","filesize":1048576,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>Based on the movie by the same name, <em>An American Tail: Fievel Goes West</em> is a platform game featuring the young mouse Fievel Mousekewitz. After immigrating to overseas to America in the beginning of the 20th century, the Mousekewitz family has moved out onto the open frontier of the wild west. With dreams of being a cowboy, Fievel soon makes friends and plays on the dusty streets imagining himself a great gunslinger. But all is not well as the villainous Cat R. Waul and his gang of cats (as well as other creatures) has plans to turn this place into an all-you-can-eat mouse buffet. It's up to Fievel to get in the way of Cat's plans with the help of the canine sheriff, Wylie Burp and his non-mouse eating cat pal, Tiger</p><p>The game is a traditional action platformer. Fievel can jump and fire a pop-gun as he ventures through each level, collecting coins. The pop-gun can be powered-up to fire more powerful projectiles.</p>"},{"name":"Andre Agassi Tennis","year":1993,"developer":"TecMagik Entertainment Ltd."},{"name":"Angelique","year":1994,"developer":"KOEI Co., Ltd."},{"name":"Animaniacs","year":1994,"developer":"Konami Co., Ltd.","url":"5#A/Animaniacs%20%28NA%29.sfc","filesize":1048576,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Puzzle elements > Multiple units/characters control > Licensed","desc":"<p>Those lab mice bent on world domination, Pinky and The Brain, have hatched a new scheme to try to take over the world! Their latest plan is to steal a prized script from Warner Bros. Studios, which they will produce to earn them enough money to take over the world. The CEO of Warner Bros. asks Yakko, Wakko and Dot to recover all 24 scenes of the film's script.</p><p><em>Animaniacs</em> is a platform game where you control the three Animaniacs, Yakko, Wakko and Dot. Players can cycle between their current Animaniac by using R Button, and in addition to jumping, the player can stack the Animaniacs on top of each other to reach places they couldn't on their own. The Animaniacs can pick up and throw small objects to attack, as well as dash to break objects and dodge enemies. Larger objects can be pushed, to access higher areas, or sometimes to reveal secrets.</p><p>If a Warner is captured by Ralph, Warner Bros.' security guard (which is equivalent to \"death\"), the player has a chance to rescue all the Warners lost by entering the Water Tower stage from the map. After negotiating this small stage and reaching the top of the tower, it opens and all the Warners are rescued.</p><p>Script scenes are key to finishing the game completely. A few are given to players for finishing the level, but others are hidden in secret places and players must perform special tasks to locate them all. The other collectable aside from script scenes are coins. These coins are used to start a slot machine that is at the bottom of the screen. Depending on the way the reels land, players may get an extra continue, invincibility, all of the Warners returned, more coins, or lose some of their coins.</p>"},{"name":"Appleseed","year":1994,"developer":"KAN's Co., Ltd."},{"name":"Arabian Nights: Sabaku no Seirei-ō","year":1996,"developer":"Pandora Box"},{"name":"Araiguma Rascal","year":1994,"developer":"J-Force"},{"name":"Arcade's Greatest Hits: The Atari Collection 1","year":1997,"developer":"Atari, Inc.","url":"5#A/Arcade%27s%20Greatest%20Hits%20-%20The%20Atari%20Collection%201%20%28NA%29.sfc","filesize":524288,"score":6.9,"genres":"Compilation","desc":"<p>Another in the series of Midway's retro arcade compilations, this is the first to feature early Atari titles (in addition to the usual FMV interview segments.)<br>The games included are:<br>* Asteroids<br>* Battlezone<br>* Centipede<br>* Missile Command<br>* Super Breakout<br>* Tempest</p>"},{"name":"Arcana","year":1992,"developer":"HAL Laboratory, Inc.","url":"6#Arcana%20%28USA%29.sfc","filesize":1048576,"score":7.2,"genres":"Role-playing (RPG) > 1st-person > Anime / Manga > Turn-based > Cards / tiles > Japanese-style RPG (JRPG) > Direct control > Fantasy","desc":"<p>In this game you play as a young boy named Rooks. He's the only one that can save the world from the evil Galneon. With the power of the cards he begins his adventure.</p><p><em>Arcana</em> is a first-person RPG which focuses on the exploration of varied dungeon settings. A village serves as hub in which Rooks can visit places like a fortune teller or shops to buy items and equipment. On the world map, which does not offer free movement, he chooses his next destination where the dungeon crawl begins. The battles occur randomly and are turn-based: during each turn, the player chooses the next action of a character from a list of actions, e.g. attack or magic.Eventually the characters advance their experience level and therefore their stats.</p><p>The main visual characteristic of the game is the display of monsters and characters: everything is represented with cards. They can have an elemental attribute or not. Rooks is able to summon an elemental to aid him. He can only summon one type at a time, and he must find them before being able to summon them. Two more characters can join the party.</p>"},{"name":"Arcus Odyssey","year":1993,"developer":"Wolf Team"},{"name":"Ardy Lightfoot","year":1993,"developer":"ASCII Corporation","url":"5#A/Ardy%20Lightfoot%20%28NA%29.sfc","filesize":1048576,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Regional differences","desc":"<p>In this 2D platform game, you play as Ardy Lightfoot - a cat-like creature - with your friend Pec, a blue penguin that can be used to defeat the enemies.Your goal is to find the Seven Pieces of the Sacred Rainbow. Each piece is widespread in various colorful worlds with strange and funny enemies and bosses. You'll have to find all the pieces in order to face a terrible enemy in the last stage.At some parts of the game, you will receive a little help from your friends, such as Nina and a mysterious adventurer named Don Jacoby.</p>"},{"name":"Aretha","year":1993,"developer":"Japan Art Media Co., Ltd."},{"name":"Aretha II: Ariel no Fushigi na Tabi","year":1994,"developer":"Japan Art Media Co., Ltd."},{"name":"Arkanoid: Doh It Again","year":1997,"developer":"Taito Corporation","url":"7#Arkanoid%3B%20Doh%20It%20Again%20%28Europe%29.sfc","filesize":524288,"score":7,"genres":"Action > Fixed / flip-screen > Arcade > Paddle / Pong","desc":"<p>A sequel to the arcade game Arkanoid. Use your paddle to move the ball around and hit bricks to clear the level. Once all the bricks are gone in the current level, you go on to the next level. Power-ups, like lasers and paddle lengthening will help you during the levels. Unlike the arcade version, the sequel has boss battles and somewhat of a storyline.</p>"},{"name":"Art of Fighting","year":1993,"developer":"SNK Corporation","url":"5#A/Art%20of%20Fighting%20%28NA%29.sfc","filesize":2097152,"score":6.7,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Martial arts","desc":"<p>Yuri Sakazaki has been kidnapped! Her big brother Ryo Sakazaki and Robert Garcia, his best friend, go search for her on the streets of South Town. As they go deeper and deeper they will find clues as to who ordered the kidnapping, the Sakazaki family's relation to the mob, and a person from their past.</p><p>The gameplay differs from most fighting games. In this game, you have a Spirit meter. A Spirit meter is in the game and will decrease as you perform special moves. It can be recharged, but doing so leaves you open to attack. When your health is almost gone, you can perform a secret combination that will unleash a deadly attack on your opponent - provided you have a full Spirit meter.</p><p>The arcade version doesn't allow you to play as Mr. Big and the elusive Mr. Karate.</p>"},{"name":"Art of Fighting 2","year":1994,"developer":"SNK Corporation"},{"name":"Asameshimae Nyanko","year":1994,"developer":"J-Force"},{"name":"Ashita no Joe","year":1992,"developer":"Wave Corp."},{"name":"Asterix","year":1993,"developer":"Infogrames Europe SA","url":"5#A/Asterix%20%28NTSC%20Conversion%29.sfc","filesize":524288,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The year is 50 BC. Gaul is entirely occupied by the Romans. Well, almost entirely... One small Gaulish village continues to defy the occupying forces, the villagers protected by a magic potion which makes them invincible. But now Obelix has vanished! The Romans have confirmed his capture and taken him to an unknown destination. </p><p>Astérix is a platform game based on the eponymous comic books, where the short and mustached Gaul has to progress through levels located all across Europe, fighting Romans and various aggressive animals along the way, to rescue his friend Obelix before Caesar throws him to the lions....  </p>"},{"name":"Asterix and Obelix","year":1996,"developer":"Infogrames Europe SA","url":"5#A/Asterix%20%26%20Obelix%20%28NTSC%20Conversion%29.sfc","filesize":1572864,"score":7.5,"genres":"Action > Side view > Platform > Direct control > Licensed","desc":"<p><em>Astérix &amp; Obélix</em> is a platform game where one player can choose to control either Astérix or Obélix or two players can play simultaneously. The mission of the two Gauls is to acquire artifacts from all across Europe. </p><p>The game, like the comics, is set around 50 BC. It includes some bonus levels like a rugby match and the Olympic Games in Greece. Codes are used to save the player's progress.</p>"},{"name":"Astral Bout","year":1992,"developer":"A Wave, Inc."},{"name":"Astro Go! Go!","year":1995,"developer":"KAZe Co., Ltd."},{"name":"AstroHawk","year":2013,"developer":"Playsoft.co"},{"name":"Atlas","year":1995,"developer":"Artdink Corporation"},{"name":"Axelay","year":1992,"developer":"Konami Co., Ltd.","url":"7#Axelay%20%28Europe%29.sfc","filesize":1048576,"score":7.9,"genres":"Action > Diagonal-down > Side view > 2D scrolling > Anime / Manga > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>This planet was once a quiet, peaceful place to live, until...they came...</p><p>An unknown alien race came to this planet and promptly laid waste to it. The remaining defense force has been sent out to try and defeat them. One lucky person gets to fly the latest line of defense ships made: the AX-77 Axelay. However, these ships are still in the prototype stage, and as such, only one exists.</p><p>So get out there and head to the alien's homeworld. With some luck, you may just be able to take them out at the source...</p><p><em>Axelay</em> is a scrolling shoot-'em-up where some levels scroll vertically and others horizontally. The game is notable for its use of Super Nintendo's Mode 7. In vertically scrolling levels, the backgrounds are made entirely of Mode 7 graphics giving the playfield the illusion of depth.</p>"}]