[{"name":"B.O.B.","year":1993,"developer":"Gray Matter Inc.","url":":B.O.B. (USA)","filesize":752350,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic","desc":"<p>You are a teenage ant-like robot, who is going out for a date...However, you take your dad's car and he warns you; if you make a scratch on the car, you will never drive it again...</p><p>Of course, you make a scratch and crash on a unknown planet!What to do now?</p><p>Guide B.O.B through a colorful game with the strangest enemies you ever seen, to find a new car to get home with...</p>"},{"name":"Bahamut Lagoon","year":1996,"developer":"Square Co., Ltd.","url":":Bahamut Lagoon (Rev 1.2)","filesize":3514965,"score":7.6,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Side view > Turn-based > Fantasy","desc":"<p>The kingdom of Kahna is in great danger. The evil Emperor Sauzer, obsessed by his world domination ideas, is preparing to invade the kingdom. The king sends his best troops of knights and wizards to face the enemy, but in vain - the kingdom is conquered by Sauzer, the king is murdered, and his lovely daughter is kidnapped. The brave leader of the Dragon Squad remembers the promise he gave the princess a long time ago: always be at her side. Supported by his friends and his faithful dragons, he must now free the princess and the kingdom from the enemy's hands. If only the strongest of the dragons, Bahamut, could be awakened...</p><p><em>Bahamut Lagoon</em> is a tactical role-playing game. The player controls several parties of four characters each, and commands different dragons at once. The battles start on a top-down screen typical for strategy games, but often switch to a dynamic side view, such as often used in Japanese-style RPGs. The outcome of some battles can also be affected by other tactical decisions, such as, for example, setting a whole forest on fire to prevent enemies from coming through it.</p>"},{"name":"Bakumatsu Kōrinden: Oni","year":1996,"developer":"Pandora Box"},{"name":"Ballz 3D: Fighting at its Ballziest","year":1994,"developer":"PF Magic","url":":Ballz 3D - Fighting at Its Ballziest (USA)","filesize":694918,"score":6.3,"genres":"Action > Side view > Fixed / flip-screen > Fighting","desc":"<p>Ballz is a fighting game, but what makes it unique is the fact that your player is made out of balls. The game has a detailed 3D engine with a fixed camera. The game plays like your normal beat 'em up game. This game supports 2 players, 3 difficulties, and up to 21 matches.</p>"},{"name":"Barbie Super Model","year":1993,"developer":"Bonsai Entertainment, Inc."},{"name":"Barbie Vacation Adventure","year":1994,"developer":"Software Creations Ltd."},{"name":"Barkley: Shut Up and Jam!","year":1994,"developer":"Accolade, Inc.","url":":Barkley Shut Up and Jam! (USA)","filesize":684010,"score":6,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p>In the game you play street basketball two-on-two with your friends on with computer. So there are no referees, no fouls, and no shot clock, but the teams called by the names of cities such as Phoenix or Chicago. You can choose your player from 16 available players, including Barkley himself.</p>"},{"name":"Bass Masters Classic","year":1995,"developer":"Black Pearl Software","url":":Bass Masters Classic (USA)","filesize":1176686,"score":"","genres":"Simulation > Sports > Top-down > 2D scrolling > Direct control > Fishing > Licensed","desc":"<p>This game consists of five 3-day tournaments at four lakes. The mission is to catch as much large bass as possible. Once the day of the fishing tournament is over, the five largest bass that were caught get weighed and are compared to the other fisherman's catches. The one with the heaviest catch is the winner.</p><p>The player starts off choosing an angler. Then the player can either go to the bait shop, practice pond, or start in the tournament. In the bait shop, choices of baits, lines, rods, reels, fish finders, and boat engines are available for purchase. The practice pond mode is just where the player can cut his teeth on the game mechanics without consequence.</p><p>The tournament mode is the main part of the game. Players start out in a fishing boat. Some of the factors that can affect your fishing are temperature, wind speed, water clarity and time of day. After casting the line, the game goes from an above the lake view to a side view of the lake water depths. Then it's just up to the player to attract the fish with the bait, and after the fish is caught on the hook, reel it in.</p>"},{"name":"Bass Masters Classic: Pro Edition","year":1996,"developer":"Black Pearl Software","url":":Bass Masters Classic - Pro Edition (USA)","filesize":1513523,"score":"","genres":"Simulation > Sports > Top-down > 2D scrolling > Direct control > Fishing > Licensed","desc":"<p>This game is basically an update to Bass Masters Classic. Updates involve adding 6 pro fishermen, five different lakes instead of four, an expanded lineup of different fishing equipment, 2 difficulty level settings, a zoom function, larger lakes, and new music tracks.</p>"},{"name":"Bassin's Black Bass","year":1994,"developer":"Starfish Inc.","url":":Bassin's Black Bass (USA)","filesize":1115628,"score":"","genres":"Simulation > Sports > Top-down > Fishing","desc":"<p><em>Bassin's Black Bass</em> is a fishing game endorsed by the professional fishing champion Hank Parker. It is another entry in Hot-B's long line of fishing games. Players aim to become a professional fisherman and can travel by themselves or along with Hank.</p><p>There are four different fishing areas players advance to as they win each round of the tournament. Players travel by boat on the water, select a fishing spot and then select lure and cast fish. Certain types of fish are only available at specific spots. There is also a fish radar that makes a sound when there is fish nearby. Players need to select the correct type of lure (there are about 20), keep track of weather conditions and the limited time available in tournaments. Some fish fight back hard and need to be reeled in with careful timing.</p><p>The four tournaments are Local Amateur Tournament, Amateur Bass Championship, Pro Bass Tournament and Bassin' World Championship. About eight types of fish can be caught.</p>"},{"name":"Batman Forever","year":1995,"developer":"Acclaim Studios Limited","url":":Batman Forever (USA)","filesize":2155537,"score":5.9,"genres":"Action > Side view > Beat 'em up / brawler > Platform > Martial arts > Licensed","desc":"<p>Batman Forever is the officially licensed game based on the 1995 movie. The bad guys this time around are The Riddler and Two-Face.</p><p>This game is an usual hybrid of side-scrolling platformer and one-on-one fighter. You make your way through levels that include some platform jumping elements, but you typically take on opponents one at a time like in a fighting game. You arsenal includes a lot of nifty bat-gadgets, and a collection of fighting moves that are unleashed with special button combinations.</p><p>The graphics were rendered completely with digitized actors and objects, but none of the actors from the movie make an appearance in the game.</p>"},{"name":"Batman Returns","year":1993,"developer":"Konami Co., Ltd.","url":":Batman Returns (USA)","filesize":762771,"score":8.2,"genres":"Action > Racing / Driving > Behind view > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Shooter > Licensed","desc":"<p>The successful movie sequel Batman Returns spawned many different game adaptations. The SNES version presents the story of Batman's encounter with the Penguin and Catwoman as a side-scrolling beat 'em up, with one Batmobile driving sequence thrown in.</p><p>There are two varieties of beat 'em up levels. One plays like Final Fight and similar games: Batman can move in two dimensions, beating up his enemies with various punches, kicks, combos, and special moves.Special gadgets to be used include the famous Batarang to take out enemies from a distance and \"Test Tubes\" filled with chemical explosives which will damage all enemies on the screen.</p><p>In the second type of side-scrolling level, Batman can only move in one dimension, left or right. The Batarang is the standard weapon here, with punches only being used when the enemy gets close. Also in these levels, Batman can use a grappling hook to cross dangerous areas unharmed.</p><p>Enemies in the beat 'em up levels usually belong to the Penguin's Red Triangle Circus Gang - clowns in all varieties: thin clowns, fat clowns, clowns on bikes, clowns armed with bazookas, and more. At the end of each level, there is a boss fight, including several encounters with Catwoman and the Penguin.</p><p>In the Batmobile driving level, the action is viewed from behind. Batman has to evade clowns on bikes and shoot them down when he gets the chance. At the end of the road, another boss fight awaits.</p><p>Digitized images from the film illustrate the storyline.</p>"},{"name":"Battle Blaze","year":1992,"developer":"Electronics Application Co., Ltd.","url":":Battle Blaze (USA)","filesize":612546,"score":"","genres":"Action > Side view > Fighting > Fantasy","desc":"<p>In the land of Virg, it is custom to select the King at the Tournament of Champions. Aspiring to rule the human world, a zealous demon from the Netherworld sends out five phantoms to posses each contender, so that the last survivor will be able to murder the king. However, one of the contenders, Durill manages to defeat the phantom that tries to take control of him, but dies from exhaustion. His son Kerrel takes Durill's place in the Tournament to avenge his father and kill the demon.</p><p>Battle Blaze is a one on one fighting game seen from a side-scrolling perspective. A jump and an attack button is all that is needed to control the six different characters. Each character uses a different weapon and has a few unique special attacks.</p><p>There are two modes of play: In \"Hero\"-mode, the player can only control of Kerrel and must follow the game's story. In \"Battle\"-mode, all characters are available and two-player fights are possible.</p>"},{"name":"Battle Cars","year":1993,"developer":"Malibu Interactive","url":":Battle Cars (USA)","filesize":776282,"score":6.4,"genres":"Racing / Driving > Behind view > Top-down > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Battle Cars takes place in the 22nd century. In the century beforehand, the Greenhouse Effect has taken a toll on the world, the polar ice caps have melted, causing countries to begin to go underwater, as a result, battles for territory become more fierce, causing confrontations to become nuclear, forever altering the landscape.</p><p>You are a rookie driver, in the new blood sport known as Battle Cars, held by the IBCA (International Battle Cars Association) and your goal is to qualify for each race then take out your rivals and eventually face the top driver of that circuit in a final fight for supremacy.</p><p>There are nine levels in all, each with their own unique boss and the ability to upgrade your car and weapons. The game resembles F-Zero in a way of gameplay, but the cars are more modeled after Formula One cars.</p>"},{"name":"Battle Clash","year":1992,"developer":"Intelligent Systems Co., Ltd.","url":":Battle Clash (Europe)","filesize":688791,"score":7.3,"genres":"Action > 1st-person > Rail shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Battle Clash</em> is a game that uses the Super Scope light gun peripheral. In this game, you fight in a futuristic version of the world as a warrior named Michael Anderson, who takes part in a competition simply known as the \"Battle Game\". Contestants in the Battle Game fight using mobile Standing Tanks (or STs for short), that come with a variety of weapon systems and forms.</p><p>To defeat the enemies in each stage, you must shot at weak spots on their armor to cause damage to them. The game scrolls automatically along with the opponent, so you cannot manually dodge bullets. You will have to play defensively by shooting them down.</p>"},{"name":"Battle Grand Prix","year":1992,"developer":"KID Corp.","url":":Battle Grand Prix (USA)","filesize":388313,"score":6.6,"genres":"Racing / Driving > Top-down > 2D scrolling > Arcade > Automobile > Track racing","desc":"<p><em>Battle Grand Prix</em> is a Formula One racing game in which one or two players can pit themselves in 3 Grand Prix races. The players can pick from 40 fictional drivers and 24 teams to play with. The game is always shown in split-screen mode, even when the player is playing on his own, in this case the opponent directly behind or ahead of the player is shown in the other window. Car settings can be adjusted in the garage. Pit-stops can be used to repair the car during a race. Crashing the car can also force the player to retire from the race early.</p><p>In the game the player can choose from four game modes:* Survival - Finish at or lower than a certain position (determined by your difficulty) to continue to the next race</p><ul><li>Champion</li><li>VS</li><li>Slot - In this game mode steering happens automatically. The only thing the players need to concern themselves with is the gas and break pedals.</li></ul><p>The game features three difficulty levels: Beginner, Pro and Expert.</p>"},{"name":"Battle Master: Kyūkyoku no Senshi-tachi","year":1993,"developer":"System Vision"},{"name":"Battle Tycoon","year":1995,"developer":"Right Stuff Corp."},{"name":"Battle Zeque Den","year":1994,"developer":"Arsys Software, Inc."},{"name":"BattleTech: A Game of Armored Combat","year":1995,"developer":"Malibu Interactive"},{"name":"Battletoads / Double Dragon","year":1993,"developer":"Rare Limited","url":":Battletoads-Double Dragon (USA)","filesize":697609,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Platform > Sci-fi / futuristic > Licensed","desc":"<p>Earth is under fire by Colossus, a battleship the size of a city. Using powerful laser cannons, it has destroyed most of Earth's defence forces, while its many troops clean up the rest of the planet. All expect for 5 warriors.</p><p>The Battletoads, who are well aware of evil forces in the galaxy, join forces with Billy and Jimmy Lee from Double Dragon to defend Earth from the deadly ship and its troops. Using a range of special moves you must fight your way through the streets into the heart of the ship and destroy it.</p>"},{"name":"Battletoads in Battlemaniacs","year":1993,"developer":"Rare Limited","url":":Battletoads in Battlemaniacs (USA)","filesize":670147,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Platform","desc":"<p>The three battletoads Zitz, Rash and Pimple are in Tibet to witness the presentation of the Psicone Gamescape, a virtual reality machine. All of a sudden a monster jumps out of the gameworld, captures both the Psicone CEO's daughter &amp; Zitz and takes them back into the Gamescape. Of course Rash and Pimple will have to enter the Gamescape and rescue them.</p><p><em>Battletoads in Battlemaniacs</em> is another game in the Battletoads series by Rare. Much like its predecessor, it blends fighting game elements (in the style of Double Dragon) with other kinds of gameplay, like racing levels, \"snake riding\" levels and such. There are some bonus levels between some of the regular ones, where the player can collect extra lives.</p><p>Buddies can team up and defeat the opposition together in the two coop-modes available. In mode A, players can hit each other while in mode B, they can't.</p>"},{"name":"Bazooka Blitzkrieg","year":1992,"developer":"Tose Co., Ltd.","url":":Bazooka Blitzkrieg (USA)","filesize":325869,"score":"","genres":"Action > 1st-person > Rail shooter > Sci-fi / futuristic","desc":"<p>Sylon Corporation's robots, the XT7 Cyborg-Commando Fighting Machines, have gotten out of control and threaten the city. The citizens are in danger and the only way to stop them is to destroy them.</p><p><em>Bazooka Blitzkrieg</em> is a first person shooter game that uses the Super Scope light gun. Players begin the game in either Blitzkreig mode or Boot Camp (Training for each of the levels). Upon starting the game, the screen slowly moved from left to right. The player fires his weapon at the different robots to destroy them. The scope's fire has a regular \"machine gun\" firing, as well as a more powerful charged-up shot. There are three levels in all and bosses at the end of each level which must be destroyed in sections.</p>"},{"name":"Bebe's Kids","year":1994,"developer":"Radical Entertainment Inc.","url":":Bebe's Kids (USA)","filesize":577287,"score":"","genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p>This side-scrolling beat em' up game is based on a 1992 Paramount Pictures animated movie which was the first ever to feature an all-Black main cast. The characters were originally from comedian Robin Harris' \"Bébé's Kids\" (pronounced Bay-Bay) stand-up comedy act. They're described as little hellions and bad-ass troublemaker kids.  In this game, someone has taken control of the Fun World amusement park, and you've got to help Kahlil, LaShawn, and PeeWee make things right. </p><p>You can play as either Kahlil or LaShawn and can use each character's different special attacks. Kahlil uses a spin-tuck to take out almost any enemy you meet and LaShawn uses powerful cartwheels. Enemies such as animatronic robots and security guards must be taken out in the first time-limited level.  Some items can also be picked up and thrown at enemies.   The second level has the baby PeeWee in a china shop knocking glasses off shelves and you must break 10 before they hit you or the ground or are grabbed by your caretaker Robin.  There is also a haunted house maze level where you must keep trying different doors until you find the exitwhile avoiding mummies along the way. Then there's a pirate ship beat em' up level and eventually you make your way to the underground control center and the Big Boss.</p>"},{"name":"Beethoven's 2nd","year":1993,"developer":"Rozner Labs Software Group"},{"name":"Best of the Best Championship Karate","year":1993,"developer":"Loriciels","url":":Best of the Best - Championship Karate (USA)","filesize":603852,"score":6.8,"genres":"Sports > Side view > Fixed / flip-screen > Fighting > Boxing > Martial arts","desc":"<p><em>Best of the Best Championship Karate</em> is a realistic fighting game.After you choose your fighter for his parameters (strength, stamina and resistance), you can choose from 55 different moves.You can now train your fighter at a gym before the real fights.To master the game, one must alternate training and fights, as training improves stamina, strength and resistance.Be careful, losing a fight reduces those parameters, so you have to be ready before getting in the ring!</p>"},{"name":"Big Sky Trooper","year":1995,"developer":"LucasArts","url":":Big Sky Trooper (USA)","filesize":557905,"score":7.1,"genres":"Action > Top-down > Puzzle elements > Shooter > Sci-fi / futuristic","desc":"<p>On day an alien race of slugs is out patrolling space, when they encounter the Lucasarts logo. The logo, as we all know looks like a statue of a person with his hands extending towards the sky. Seeing this logo, the slugs determine that ours is a race made up of BONES and of ADVERTISING, two things the slugs simply hate. So they attack.</p><p>With the slug invasion in full swing, earth is quite simply outnumbered by the gooey slugs. It must recruit special super soldiers, Big Sky Troopers, armed with a special heavily armored suit to combat the menace. So urgent is the need for qualified Big Sky Troopers, that recruiting and rank are petty things. It is not unknown for example for a brand new trooper to start as a 21-star general in the army.</p><p>Once selected, it is up to your Big Sky Trooper, piloting a FIDO class starship, to engage the slugs in space and in planetfall and thwart their plans to destroy mythical galactic devices and conquer humanity.</p>"},{"name":"Bike Daisuki! Hashiriya Tamashī: Rider's-Spirits","year":1994,"developer":"Genki Co., Ltd."},{"name":"Biker Mice from Mars","year":1994,"developer":"Konami Co., Ltd.","url":":Biker Mice from Mars (USA)","filesize":752675,"score":7.2,"genres":"Racing / Driving > Isometric > Sci-fi / futuristic > Licensed","desc":"<p>Based on the cartoon of the same name, <em>Biker Mice From Mars</em> is a racing game very similar to Rock 'n Roll Racing. Races are shown from an isometric perspective and you can choose between six different drivers that differ in acceleration, top speed and grip. During the races, you can use weapons such as mines or missiles to slow down your opponents and pick up random bonuses ranging from money to making you temporarily invincible. After each race, you will receive money that can be spent on better tires, armor, engines or weapons. There's also a two-player mode that lets you play the main race with a friend or compete in a one on one race.</p>"},{"name":"Bill Laimbeer's Combat Basketball","year":1991,"developer":"Hudson Soft Company, Ltd.","url":":Bill Laimbeer's Combat Basketball (USA)","filesize":201654,"score":"","genres":"Sports > Top-down > Basketball > Sci-fi / futuristic > Licensed","desc":"<p>This futuristic basketball game is endorsed by none other than Bill Laimbeer of the Bad Boys Detroit Pistons.  The game is 5-on-5 with no rules except for out-of-bound and backcourt.  The storyline is that in the year 2023 Bill Laimbeer, the most physical player to ever play in the NBA, becomes the new commisioner of the NBA.  As new commisioner of the League he throws away all the old rules and make the game plays more to his liking which means basketball is to be an extremely physical game.  The new League is only for those who aren't scare of contact and are tough enough to endure constant physical pain.  The new NBA is extreme enough for players to wear armor to protect themselves from the new style of basketball that include hitting, shoving, punching and tackling.  It's an all-new basketball game that plays like the style of extreme football.  This game is contact basketball to the max.  There are even  weapons on the court such as bombs and saw blades that make this game one of the most violent basketball games of all time.</p>"},{"name":"Bill Walsh College Football","year":1994,"developer":"High Score Productions","url":":Bill Walsh College Football (USA)","filesize":766177,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>The game features 24 college football teams from the 1993 season and 24 of the all-time college teams since 1978. Play modes include exhibition, playoffs and all-time playoffs and the SNES version also has an eleven week season mode with the National Championship as the ultimate goal. </p><p>The playbook consists of 56 offensive plays and 52 defensive plays.On offense, running backs can dive, spin and hurdle. Also, passing is dealt with by having the receivers in their own windowed boxes. When on defense, defenders can dive at the ball carrier, and raise hands to block kicks or intercept passes.</p><p>The game also features four weather conditions (fair, windy, rain and snow), and three different quarter lengths (20, 40 and 60 minutes).</p>"},{"name":"BioMetal","year":1993,"developer":"Athena Co., Ltd.","url":":BioMetal (Europe)","filesize":463561,"score":6.3,"genres":"Action > Side view > 2D scrolling > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>BioMetal</em> is a fast-paced, side-scrolling shooter game. The war that divided the galaxy and used all its resources has ended. A fleet was sent on a mission to find more natural resources. They never returned. Their last transmission reveals that the enemy created one last experiment - a combination of the aggressive nature of animals and the efficiency of machines named BioMetal.</p><p>The MF-92GX Halbard mothership has been assigned to destroy the threat. The player is piloting the MF-92GX Halbard fighter that is equipped with the experimental Gel Analog Mutant weapon. The GAM's power is charged up while not in use, and can be used to surround the ship as a protective shield or be thrown at the enemy forces. It slowly drains charge energy, and the pilot must balance being protected by the shield with recharging. Their are three choices each for primary and secondary weaponry, including plasma shots, lasers, and missiles. The enemies become larger, more aggressive, and more plentiful as the game progresses.</p>"},{"name":"Bishōjo Janshi Suchie-Pai","year":1993,"developer":""},{"name":"Bishoujo Senshi Sailor Moon","year":1993,"developer":""},{"name":"Bishoujo Senshi Sailor Moon R","year":1993,"developer":""},{"name":"Bishoujo Senshi Sailor Moon S: Jogai Ranto!? Shuyaku Sodatsusen","year":1994,"developer":""},{"name":"Bishoujo Senshi Sailor Moon S: Kondo wa Puzzle de Oshioki yo!!","year":1994,"developer":"Tom Create Co., Ltd."},{"name":"Bishoujo Senshi Sailor Moon S: Kurukkurin","year":1995,"developer":"Tom Create Co., Ltd."},{"name":"Bishoujo Senshi Sailor Moon Super S: Fuwa Fuwa Panic","year":1995,"developer":"Tom Create Co., Ltd."},{"name":"Bishoujo Senshi Sailor Moon Super S: Zenin Sanka!! Shuyaku Sodatsusen","year":1996,"developer":"Make Software, Inc."},{"name":"Bishoujo Senshi Sailor Moon: Another Story","year":1995,"developer":"","url":":Bishoujo Senshi Sailor Moon - Another Story","filesize":2410282,"score":"","genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Anime / Manga > Turn-based > Sci-fi / futuristic > Licensed","desc":"<p>The game is based on the Japanese manga and anime series <em>Sailor Moon</em>. It is set in the 30th century, in a futuristic city Crystal Tokyo. In this city lives a totally ordinary (at first) fourteen-year old girl Usagi. When she meets a magical cat named Luna, she finds out that she is in fact a princess sent to the future in order to fight the minions of Darkness. She discovers within herself the power to transform into the hero of darkness, Sailor Moon, meets other warriors who help her on her quest, and fights the evil Queen Beryl, hostile aliens, and other foes.</p><p>The events of this game take place shortly after <em>Bishōjo Senshi Sailor Moon S</em>, the fourth volume of the long-running series. A global peace is established in the universe, but lately suspicious things are happening. A strange meteorite is seen approaching the Earth. Street gangs and spies who work for a mysterious person called Apsu are seen in Crystal Tokyo. And the Mystic Silver Crystal, the Ginzuishou, which protects the city, is shaking! Usagi and her friends must now investigate the strange events and face the forces of Darkness once again.</p><p>The game is a Japanese-style RPG in Final Fantasy style (battles with your party to the right and the enemies to the left), with a battle system somewhat similar to that of Chrono Trigger: you must form a party out of several available characters, make them participate in battles together, and learn powerful combo attacks.</p>"},{"name":"Blackthorne","year":1994,"developer":"Blizzard Entertainment Inc.","url":":Blackthorne (USA)","filesize":708339,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Direct control > Fantasy","desc":"<p>The planet Tuul was a peaceful place, until the evil warrior Sarlac used the power of the Darkstone to take control. Kyle Blackthorne's father, the good King Vlaros, sent him to Earth just as his kingdom crumbled around him. Now, twenty years later, Kyle is grown and must return to Tuul to free it from the clutches of Sarlac.</p><p><em>Blackthorne</em> is a platform action game played from a side-view with non-scrolling backgrounds. It has certain similarities to Prince of Persia, being set in maze-like environments and focusing on exploration and occasional puzzle-solving. Kyle Blackthorne fights enemies by shooting at them. His default weapon, a pump action shotgun, can be upgraded throughout the course of the game. Various types of bombs can be used to damage enemies, blow open doors, or destroy generators. Keys must be found to gain access to new areas.</p>"},{"name":"BlaZeon","year":1992,"developer":"A.I Co., Ltd.","url":":BlaZeon - The Bio-Cyborg Challenge (USA)","filesize":512442,"score":5.6,"genres":"Action > Side view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>BlaZeon</em> is a space shooter arcade game. The player travels in a spaceship from the left side of the screen to the right while swarms of enemy spaceships appear. The player is able to fire at them with his cannon (which can be fired normally or rapid fire) and special missile weapon. After the defeat of certain enemies they will leave behind their husk. Touching this former enemy will allow the player to upgrade their spaceship into more powerful forms.</p>"},{"name":"Blitzkrieg: Tōbu Sensen 1941~45","year":1992,"developer":"SystemSoft"},{"name":"Blues Brothers, The: Jukebox Adventure","year":1993,"developer":"Titus France SA","url":":Blues Brothers, The (USA)","filesize":308146,"score":6.4,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Jukebox Adventure</em> is the sequel to The Blues Brothers. Once again, the player has to choose a favourite Blues Brother and take him through different side-scrolling platform levels. He needs to collect records and use them as defence by throwing them towards enemies. There are also power-ups that can be gathered until the jukebox to progress to the next level is found.</p>"},{"name":"Bomberman: B-Daman","year":1996,"developer":"A.I Co., Ltd."},{"name":"Bombuzal","year":1990,"developer":""},{"name":"Boogerman: A Pick and Flick Adventure","year":1995,"developer":"Interplay Entertainment Corp.","url":":Boogerman - A Pick and Flick Adventure (USA)","filesize":1972545,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Comedy","desc":"<p><em>Boogerman</em> is a jump-and-run game where the protagonist flicks boogers and farts at enemies in order to stand a chance against the evil Boogermeister. The game features about 20 levels of dirt, slime and bad taste in worlds like \"Mucous Mountains\", \"The Pits\" and \"Flatulent Swamps\".</p>"},{"name":"Boxing Legends of the Ring","year":1993,"developer":"Sculptured Software, Inc.","url":":Boxing - Legends of the Ring (USA)","filesize":761801,"score":6.9,"genres":"Sports > Behind view > Boxing > Licensed","desc":"<p><em>Boxing Legends of the Ring</em> lets you take control of eight middleweight legends of boxing, Roberto Duran, Tommy \"Hitman\" Duran, Jake \"Raging Bull\" La Motta, Rocky Graziano, \"Sugar\" Ray Robinson, \"Sugar\" Ray Leonard, \"Marveleous\" Marvin Hagler and James Toney. You can either compete in an exhibition mode or play in career mode and become the greatest of all time.</p><p>The set of punches in the game is pretty much standard, jab, hook, uppercut, even the ever popular but illegal low blow. Also, for each round and every knockdown you score on an opponent, you get a super punch, a straight shot to the face and is almost unstoppable and connected right could knock out your opponent, but if you miss, you lose your punch for the round.</p><p>There are two main displays during a fight, a damage inflict meter in the form of two boxing gloves, one on each side and as a player connects a punch, the glove will show a black area of where the glove connected and a damage meter that show's the two fighters faces. As the round progresses, the fighter shows more bruises and cuts and starts to flash red when the fighter is getting tired and is the best time to land your super punch.</p><p>Another feature is from round to round, your view will alternate, from looking over your shoulder to the next round and looking at yourself over your opponents shoulder.</p>"},{"name":"Brain Lord","year":1994,"developer":"Produce Co., Ltd.","url":":Brain Lord (USA)","filesize":706719,"score":7.1,"genres":"Action > Role-playing (RPG) > Top-down > Puzzle elements > Fantasy","desc":"<p>In <em>Brain Lord</em>, you play a young traveler and warrior who is searching for his long lost father. Long ago, when you were a mere child, your father told you about the great legacy of your village. Once your people were Dragon Warriors, who could control and fly on dragons. But the dragons had disappeared, and your father was determined to find the legendary Tower of Light, where, according to rumors, the last dragons might be hiding. You father went to search the Tower of Light and never came back. Years have passed, and now you finally found the Tower of Light. But your adventure doesn't end there, as you had thought - it begins there...</p><p><em>Brain Lord</em> is an action RPG with a heavy emphasis on dungeon exploring. You fight enemies in real time, using various weapons with different ranges - swords, axes, etc. You can equip different kinds of armor and shields. On your quest you will find magical jades that summon fairies who would fight at your side. The fairies have special attacks and level up after fighting just like you, but are controlled by the AI. There are also puzzles to solve in the dungeons, and the hero has the ability to jump.</p>"},{"name":"Brainies, The","year":1994,"developer":"Atreid Concept SA"},{"name":"Bram Stoker's Dracula","year":1993,"developer":"Psygnosis Limited","url":":Bram Stoker's Dracula (USA)","filesize":767064,"score":5.9,"genres":"Action > Side view > 2D scrolling > Horror > Licensed","desc":"<p><em>Bram Stoker's Dracula</em> is the title given to a number of games based on the 1992 film of the same name. Gameplay for each game varies greatly from platform to platform, but they all retain a similar plot based on the movie. The 16-bit console versions are side-scrolling hack-and-slash games.</p><p>The player controls a young lawyer named Jonathan Harker. Harker must free himself from Dracula's capture, follow him to London, and end his reign of terror.</p>"},{"name":"Brandish","year":1994,"developer":"Nihon Falcom Corp.","url":":Brandish (USA)","filesize":990360,"score":7.1,"genres":"Action > Role-playing (RPG) > Top-down > Fantasy","desc":"<p>Once there was a prosperous kingdom, which was protected by a tower, where a mighty dragon was living. The people of the kingdom were secure with such a guardian. But one man wanted the dragon's power for something else, and this man was the king. He went to the tower and tried to kill the dragon, in order to rob his power. But the dragon's fury turned the king into a horrible creature, a demon, and his evil essence made his entire kingdom sink deep under the earth. </p><p>Many years have passed, and now you take control of a traveler named Varik (<em>Ares</em> in the Japanese version). A young woman accuses him of killing her teacher, and in a desperate fight they both fall underground, to where the lost kingdom was buried. You must guide Varik through underground mazes and help him to escape the wrath of his adversary and the demonic inhabitants of the lost kingdom.</p><p>The game is an action RPG, a dungeon crawler with plenty of creatures to defeat and many weapons, armor, and other treasure to collect. You can also use magic spells. The camera rotates automatically according to your movements. You also have the ability to jump forwards.</p>"},{"name":"Brandish 2: The Planet Buster","year":1995,"developer":"Nihon Falcom Corp.","url":":Brandish 2 - The Planet Buster (Rev 1)","filesize":1950753,"score":"","genres":"Action > Role-playing (RPG) > Top-down > Fantasy","desc":"<p><em>The Planet Buster</em> continues the story that was told in the first Brandish, depicting the events that happened three years after the evil demonic king was defeated in his lost kingdom, sunken deep underground. The player takes control of a young warrior named Ares, who wields a magical weapon - a powerful sword called the Planet Buster. One day, while traveling through a desert, Ares is captured by a warlock named Karl, who is after the powers hidden within the magical sword. Suspecting Ares might have some valuable information, Karl doesn't execute him, but takes away the Planet Buster and throws Ares into his underground prison. Now the primary goal is to guide Ares out of the huge prison full of various dangers, and get the mighty weapon back.</p><p>The game is an action RPG with a heavy emphasis on dungeon crawling. The player guides Ares through rotating dungeons, fighting enemies in real-time combat, casting spells, and solving an occasional puzzle. The protagonist has the ability to jump forwards and attack inanimate objects (such as doors) to cause damage and eventually break them.</p>"},{"name":"Brawl Brothers","year":1992,"developer":"Jaleco Ltd.","url":":Brawl Brothers; Rival Turf! 2 (Europe)","filesize":940501,"score":6.7,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Crime > Regional differences","desc":"<p>The Brawl Brothers are two guys, not actually brothers, named Rick and Doug (or, Hack and Slash, respectively) who run a self-defense gym in Bayside City. Three of the gym's best fighters are also characters in this game: there is Lord J., a karate and judo master; Kazan, a ninja; and Wendy, a pro wrestler. You choose which two characters you want to control, and Dieter, the psycho bad guy who's got his secret Air Fortress outside the city, kidnaps the other three. Dieter wants these fighters so he can clone them and develop his own army for evil purposes, and it is up to whatever two characters you choose to fight your way through these clones to reach Dieter.</p>"},{"name":"BreakThru!","year":1994,"developer":"ZOO Corporation","url":":BreakThru! (USA)","filesize":234269,"score":6.1,"genres":"Puzzle > Fixed / flip-screen > Real-time > Tile matching puzzle > Point and select","desc":"<p>In the award-winning tradition of Tetris, comes BreakThru! This time, your goal is to make as many bricks disappear as you can before time runs out. Click on a group of same-colored bricks to remove bricks and make the wall come tumbling down.</p>"},{"name":"Breath of Fire","year":1993,"developer":"Capcom Co., Ltd.","url":":Breath of Fire (USA)","filesize":1080663,"score":7.2,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>Long ago in the days of darkness and magic, a young wanderer comes face to face with his destiny.  You control the fate of Ryu, a young warrior and descendant of the Light Dragon Clan.  Together, with your mystical friend, Nina, you must search for magic spells and mysterious secrets.  Along the way, gain experience and skill as you battle against strange monsters.  Uncover valuable secrets that will help you on your adventure and unlock the secrets of the Dragon Clan.</p>"},{"name":"Breath of Fire II","year":1994,"developer":"Capcom Co., Ltd.","url":":Breath of Fire II (USA)","filesize":1747520,"score":7.8,"genres":"Role-playing (RPG) > Isometric > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>Ryu was a young boy who has memories of a strange village far away and a magical doorway which sucked him through. However those are only distant memories. Ryu and his best friend Bow are apprentices in the Ranger's Guild. As adventurers they take on posted jobs needed by the townspeople. However it isn't long before one job goes awry and Bow is accused of stealing a valuable item. In order to clear his friend's name and find the meaning of his dreams, Ryu will explore the world, eventually discovering the meaning of his dreams and hidden abilities inside himself.</p><p><em>Breath of Fire II</em> is a role playing game. The majority of game is played from a top-down map, however battles are seen from an isometric view. Ryu will form parties from among 8 other characters, each with their own set of skills and powers that will help him discover the truth behind the mystery. </p><p>In the GBA version, you can use a link-cable to link to friends and exchange weapons and items to defeat the higher evils. And with the inclusion of the community system, you can build and maintain your own city while you are fed up of exploring.</p>"},{"name":"Brett Hull Hockey","year":1994,"developer":"Radical Entertainment Inc.","url":":Brett Hull Hockey (USA)","filesize":1285168,"score":6.9,"genres":"Sports > Top-down > Hockey > Licensed","desc":"<p><em>Brett Hull Hockey</em> lets the player take control of NHL great Brett Hull along with 600 NHLPA players and all of the NHL teams of the time including their respective names and logos. The player can choose to play in an <em>Exhibition</em> mode either against the computer A.I. or a friend, <em>Playoffs</em> or in <em>Season</em> mode with three different length options (a full season, half a season or an 11-game season). The game simulates hockey action including slap shots, body checks, hat tricks among many other real-life hockey moves. Al Michaels also lends his voice talents to the game for in-game commentary.</p>"},{"name":"Brett Hull Hockey 95","year":1994,"developer":"Radical Entertainment Inc.","url":":Brett Hull Hockey '95 (USA)","filesize":1160450,"score":6.2,"genres":"Sports > Diagonal-down > Isometric > Hockey > Licensed","desc":"<p>Motion-captured graphics made their first appearance in a hockey game with this Brett Hull license. Al Michaels provides a full running commentary, while a mode allowing the player to improve their game with Brett's help is also included. The game is viewed isometrically, with all the realistic fouls and gameplay situations included. Full pre-match analysis and forecasting is provided, as are post match statistics.</p>"},{"name":"Bronkie The Bronchiasaurus","year":1994,"developer":"WaveQuest Inc.","url":":Bronkie the Bronchiasaurus (USA)","filesize":461535,"score":"","genres":"Action > Educational > Platform > Health / nutrition","desc":"<p>Years ago, meteors struck San Saurian, filling the air with thick and filthy dust. So a mighty wind machine was made to help everyone breathe. But Mr. Rexo has stolen the parts for the machine, forcing other dinosaurs to guard the pieces!</p><p>You must help Bronkie and Rexo find the lost machine pieces by blowing away dust with your lungs, and hitting enemies with your dusters, before the dust returns and everyone chokes on the dust! But don't run into cigarrette smoke or dust storms, otherwise your vision will get darker, and you'll have a hard time finding out where to go, running into enemies all around!</p><p>Along the way you'll learn about asthma and how to prevent it, as well as how to react if you're suffering from an asthma attack.</p>"},{"name":"Brunswick World: Tournament of Champions","year":1997,"developer":"Tiertex Design Studios","url":":Brunswick World Tournament of Champions (USA)","filesize":748515,"score":"","genres":"Sports > Behind view > Direct control > Bowling > Licensed","desc":"<p>In this bowling game, players create a bowler in order to play against eleven professional bowlers. Players can choose their bowler's clothes, what hand they use to bowl, the spare ball and primary ball they want to use, and also the weight of the balls.</p><p>The game offers practice, tournament, and league modes. Practice mode is just a quick game of bowling by yourself. In league mode, players can either compete by themselves or as a team against other bowlers. Finally, the tournament mode features six different tournaments to compete in. A short or long tournament determines the number of players that will be involved in the tourney.</p><p>Before hitting the lanes, the player will be informed of the oil pattern of the lane which tells the player how the ball will react to that lane. Bowling is performed by choosing where to stand, then using the two meters that determine the amount of power and spin the ball will have when it's finally released down the lane.</p>"},{"name":"Brutal: Paws of Fury","year":1994,"developer":"GameTek, Inc.","url":":Brutal - Paws of Fury (USA)","filesize":1330388,"score":6.6,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p>The Dalai Llama has organised a martial arts contest for animals of all species to prove their skills, and you are competing in it. There are a wide variety of furry creatures to take on, and finally the Dalai Llama himself. </p><p><em>Brutal: Paws of Fury</em> is a one-on-one fighting game across a variety of levels, with mostly outdoor terrain. You can choose of the many characters. Throughout the game, your character travels across Dalai Llama's island, fighting a series of duels before getting to the final showdown. </p><p>During a duel, you can punch and kick your opponent, try to use special attacks on him/her, or use a \"taunt\" that restores a bit of your health. Each battle lasts a number of rounds (how many - that is determined in the options menu); once one combatant has won that number of times during the battle, he wins. If the computer-controlled player won, it's game over (but you can still use a continue to start the fight anew); if you won, you move on to the next opponent. Once you have defeated them, you can watch an ending animation, different depending on the character you have chosen. </p><p>Instead of beginning a whole new game, you can fight a single duel, choosing the opponent and terrain. You can choose to fight either a computer-controlled opponent or another human player. </p><p>The visuals lean towards cutesiness, which makes a change from the gore of Mortal Kombat and the metal of Rise of the Robots.</p><p>In the console versions, you start the game without special moves, but get a new one after each successful best-of-three bout. The computer versions drop this feature, though.</p>"},{"name":"BS Fire Emblem Akaneia Senki","year":1997,"developer":"Intelligent Systems Co., Ltd."},{"name":"BS Super Famicom Wars","year":1998,"developer":"Intelligent Systems Co., Ltd."},{"name":"BS Super Mario Collection","year":1997,"developer":"Nintendo EAD"},{"name":"BS Super Mario USA","year":1996,"developer":"Nintendo Co., Ltd."},{"name":"BS Zelda no Densetsu","year":1995,"developer":"Nintendo Co., Ltd."},{"name":"BS Zelda no Densetsu: Inishie no Sekiban","year":1997,"developer":"Nintendo R&D2"},{"name":"Bubsy II","year":1994,"developer":"Images Software Ltd.","url":":Bubsy II (USA)","filesize":1165658,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p>Bubsy is back! After defeating the evil Woolies in the first game, Bubsy, the brave bob-cat, has to participate in an even more dangerous adventure: to explore a mysterious hyperdimensional mansion, inside of which there are portals that lead to different area in different locations and times. </p><p>Similarly to  Sonic games, Bubsy moves very fast and can also jump very high. Bubsy kills the enemies by jumping on their heads. The levels are large and can be accessed right from the beginning of the game (except the ultimate level), starting in either west or east wing. There are five types of regular levels: Egyptian pyramid, sci-fi space-like environment, a world filled with musical instruments and notes, a \"green\" level with trees and hills, and a side-scrolling group of levels where Bubsy has to navigate an airplane.</p>"},{"name":"Bubsy in: Claws Encounters of the Furred Kind","year":1993,"developer":"Accolade, Inc.","url":":Bubsy in Claws Encounters of the Furred Kind (USA)","filesize":1169152,"score":7.4,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p>In this 15-level action game the player is Bubsy the bobcat, who has to defeat the Woolies the aliens, which steal balls of yarn. There are five different locations such as jungle, wild west, etc., where the player has to jump and land on their enemies to kill them. Each time to finish the level the player has to defeat the boss, who sits in an alien ship.</p>"},{"name":"Bugs Bunny Rabbit Rampage","year":1994,"developer":"Viacom New Media","url":":Bugs Bunny - Rabbit Rampage (USA)","filesize":894762,"score":7.6,"genres":"Action > Side view > Platform > Licensed","desc":"<p>A fiendish animator has gone crazy and has started painting Bugs Bunny into all sorts of messes across reused cartoon landscapes. Bugs is getting into trouble from all kinds of characters including Elmer Fudd, Marvin the Martian, Crusher the wrestler, Yosamite Sam, the three little pigs. Bugs will need to use his experience, wit, and arsenal of wacky ACME weapons in order to defeat the challenges of each location.</p><p><em>Bugs Bunny Rabbit Rampage</em> is a side-scrolling platform game. The player, controlling Bugs Bunny, is able to jump (and squash), high-kick, throw cream pies and use ACME weapons. These weapons are scattered all over the landscape and include such cartoon favorites as bone-shaped dynamite sticks, anvils to drop on heads, Shrink Rays, portable holes and many more. Players will encounter a variety of familiar Looney Tunes characters as enemies and level bosses. At the end of each level (10 in all). players are given a rating based on their gameplay style, which includes how many of these ACME weapons they were willing to use.</p>"},{"name":"Bulls vs. Blazers and the NBA Playoffs","year":1992,"developer":"Electronic Arts, Inc.","url":":Bulls Vs. Blazers and the NBA Playoffs (USA)","filesize":505399,"score":6.5,"genres":"Sports > Side view > Basketball > Licensed","desc":"<p>Another update in Electronic Arts' basketball series, this time featuring the teams and players from the 1992 NBA playoffs plus the East and West All-Stars.</p><p>Features unchanged from the previous games include detailed stats, instant replay, substitutions, free throw T-meter and signature moves, some of which are new.</p><p>Exclusive to the Genesis version is the ability to create your own All-Star teams and to call defensive plays.</p>"},{"name":"Burai: Hachigyoku no Yūshi Densetsu","year":1993,"developer":"Riverhill Soft Inc."},{"name":"Bushi Seiryūden: Futari no Yūsha","year":1997,"developer":"Game Freak, Inc."},{"name":"Bust-A-Move","year":1995,"developer":"Taito Corporation","url":":Bust-A-Move (USA)","filesize":274338,"score":7.4,"genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Arcade > Tile matching puzzle > Direct control > Fantasy","desc":"<p>The home version of Bust-A-Move is not a straight adaptation of the arcade game. It greatly increases the number of levels, has new gameplay features, and introduces new modes.</p><p>The general concept remains the same: the player controls a catapult at the bottom of the screen that shoots bubbles of random colors. When three or more bubbles of the same color touch on the playfield, they are removed, with any bubbles falling away that are not attached to the ceiling, sidewall, or another bubble. The ceiling periodically descends, pushing the bubbles downward. The game is lost if any bubbles touch the bottom.</p><p>In single-player mode, the goal is to clear pre-set bubble patterns. The game consists of 100 levels, more than tripling the number from the arcade game. Some arcade levels are reused, but most are entirely new. Also new are gameplay elements in the form of special bubbles: explosive bubbles destroy bubbles in a small radius around them if hit. Lightning bubbles move sideways if hit, clearing a horizontal line. Water bubbles burst, with the downward stream recoloring all bubbles it touches. Another new element is a boss fight in the final level.</p><p>The two-player mode from the arcade version also reappears, but optionally adds a series of ten computer opponents with different playing strategies. In two-player mode, the goal is to make the other player fail. Instead of the ceiling descending, new bubbles are added from the top. Removing more than the required three bubbles at a time sends bubbles to the opponent's field.</p><p>The final mode is Challenge mode: it is an endless unwinnable mode where new bubbles are continuously added from the top. It is played for the high score: both the score and the number of bubbles popped are counted.</p>"}]