[{"name":"Cacoma Knight in Bizyland","year":1992,"developer":"Affect Co.,Ltd","url":"5#C/Cacoma%20Knight%20in%20Bizyland%20%28NA%29.sfc","filesize":524288,"score":6.1,"genres":"Action > Puzzle > Top-down > Fixed / flip-screen > Arcade > Direct control > Fantasy","desc":"<p>The people of Bizyland were hard-working and prosperous. However, Wagamama, the queen of Lasyland was jealous and used the power of her magic mirror. The spell that was cast would switch the realms of Bizyland and Lasyland around. The only people left unaffected by the spell were those who were not hard-working: notably the king of Bizyland as well as two children and a robot who were playing that day. Using the king's magic chalk, they must travel over Lasyland and restore enough of a percentage of each area so as to break the spell over each region.</p><p>Cacoma Knight is a puzzle-painting game. Choosing one of the three characters, the player will begin each level only able to move around the edges. The player can start using the chalk to move away from the edges and draw a line over the darkened area and reach another edge. Once a section (always the smaller) is \"chalked off\" from the rest, it will be restored. Any treasure chests revealed will be opened for points bonuses. Different enemies will walk along the chalk lines or fly in between them. They can be destroyed by being in a section of the screen when it is restored.</p>"},{"name":"Cal Ripken Jr. Baseball","year":1992,"developer":"Beam Software Pty., Ltd.","url":"5#C/Cal%20Ripken%20Jr.%20Baseball%20%28NA%29.sfc","filesize":1048576,"score":5.8,"genres":"Sports > Top-down > Baseball > Licensed","desc":"<p>This baseball game is your basic SNES baseball game, play as one of 16 teams, along with two special teams, the All-Stars and the MVP's. Cal Ripken, the featured player is the only real player to appear in this game.</p>"},{"name":"California Games II","year":1992,"developer":"Epyx, Inc.","url":"5#C/California%20Games%20II%20%28NA%29.sfc","filesize":1048576,"score":5.7,"genres":"Sports > Behind view > Side view > 2D scrolling > Olympiad / mixed sports > Skateboarding > Snowboarding / skiing > Surfing","desc":"<p>California Games II is the sequel to the smash hit 1988 game.</p><p>This time you compete in: hang-gliding, jetski, skateboarding, body boarding and snow boarding.</p>"},{"name":"Cannon Fodder","year":1994,"developer":"Sensible Software"},{"name":"Cannondale Cup","year":1994,"developer":"Radical Entertainment Inc.","url":"5#C/Cannondale%20Cup%20%28NA%29.sfc","filesize":1572864,"score":"","genres":"Sports > Behind view > Direct control > Bike / Bicycling > Licensed","desc":"<p>Choose from 1 of 8 different racers who compete on 8 different bicycle race courses. The game splits the courses into different stages, with each stage having a requirement to move on to the next stage. The requirements are based on completing a set number of laps or attaining a certain score, except for the final race where the player must come in 1st place in 30 laps. </p><p>There are also a number of selectable mountain bikes which are rated in the categories of turning, speed, tires, acceleration, and shocks. During a race, players can punch opposing cyclists and also jump ramps. The higher the position the player comes in at the end of a race, the higher the score the player will receive.</p><p>It was also re-released as a part of the SNES game Exertainment Mountain Bike Rally / Speed Racer as the Mountain Bike part of it, along with another game. It contains the same gameplay with only a few minor graphical changes.</p>"},{"name":"Capcom's MVP Football","year":1992,"developer":"Equilibrium, Inc.","url":"5#C/Capcom%27s%20MVP%20Football%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (American) > Licensed","desc":"<p>This is an American Football game which features four different game modes. </p><p>There is the Custom mode which let's the player set up an exhibition game between two teams. The player can either choose to directly control the football players on the field or choose to just coach the team by selecting plays and letting the computer control the on field action. Other parameters that can be adjusted are the quarter length, the field conditions, and the difficulty of the computer opponent.</p><p>There is also a Tournament mode where the player tries to take a team through a playoff bracket in order to get to the Super Bowl.</p><p>MVP mode puts the player in game situations in which the player has to try to overcome.</p><p>Demo mode lets the player watch the computer play against itself.</p>"},{"name":"Capcom's Soccer Shootout","year":1994,"developer":"A-Max"},{"name":"Captain America and the Avengers","year":1993,"developer":"Data East Corporation","url":"5#C/Captain%20America%20and%20the%20Avengers%20%28NA%29.sfc","filesize":1048576,"score":5.8,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Shooter > Licensed","desc":"<p><em>Captain America and the Avengers</em> is a one- to four-player (simultaneous) side-scrolling beat 'em up in which four Marvel Comics licensed heroes (Captain America, Iron Man, Hawkeye and Vision) take on the evil Red Skull, who, by assembling a team of super-villains, seeks to conquer the world.</p><p>The game consists of five stages, primarily focusing on side-scrolling brawler gameplay, but some of the levels also feature side-scrolling shooting stages, where the heroes battle menaces in the air (Stage 2), under the sea (Stage 3), and in space (Stage 5). Boss villains in the game consist of Living Laser and Klaw, Whirlwind, Grim Reaper, Wizard, Mandarin, Juggernaut, Ultron, Controller, Crossbones, and the Red Skull. In addition to the four playable Avengers, Quicksilver makes brief appearances to drop energy replenishments, and the Wasp can add protection and firepower in the shooting areas.</p>"},{"name":"Captain Commando","year":1995,"developer":"Capcom Co., Ltd.","url":"7#Captain%20Commando%20%28Europe%29.sfc","filesize":2097152,"score":6.8,"genres":"Action > Side view > Fixed / flip-screen > Beat 'em up / brawler > Sci-fi / futuristic","desc":"<p>Metro City, 2026. A corrupt mutant group by the name of \"Scumocide\" plot to control the universe. The hero, Captain Commando assembles a team of three renegades; Ginzu the Ninja, Baby Head, and Mack the Knife; to help him foil Scumocide's plans. This task will not be easy as many of Earh's institutions are infested with Scumocides minions, but strength and persistence runs the team into the crusade.</p><p>The player chooses one of these four characters, who must fight their way through an army of genetically engineered super-criminal, traveling through a series of locations such as the bank, museum, circus, aquarium, and several others, right through to a planet called \"Callisto\", where the evil behind \"Scumocide\" awaits. All four characters have their own special attacks. Captain Commando can use the power of his suit to shoot electricity through his palms. Baby Head rides around in a mech suit which does more damage. Mack can use short knives. Each location ends with the character defeating a boss before proceeding to the next one.</p>"},{"name":"Captain Novolin","year":1992,"developer":"Sculptured Software, Inc.","url":"5#C/Captain%20Novolin%20%28NA%29.sfc","filesize":524288,"score":"","genres":"Action > Educational > Side view > Platform > Health / nutrition","desc":"<p>Some Superheroes possess incredible strength, others can fly or make themselves invisible; Captain Novolin has the power of ... diabetes! And he is going to need that power when aliens (appropriately disguised as sugary junk food) come to take over the earth under command of their leader Blubberman.The first action the aliens take to pursue their evil plan is to kidnap the mayor of Pineville, who has only enough diabetes supplies for 48 hours!</p><p>On his quest to save the mayor and defeat the aliens, Captain Novolin has to complete several Jump 'n Run levels while dodging attacking aliens and managing his diabetes. Before every level he has to take the right dose of insulin, and he shouldn't pick up more food items than he is advised to.</p>"},{"name":"Captain Tsubasa V: Hasha no Shōgō Campione","year":1994,"developer":"Tecmo, Ltd."},{"name":"Caravan Shooting Collection","year":1995,"developer":""},{"name":"Carrier Aces","year":1995,"developer":"Synergistic Software, Inc.","url":"5#C/Carrier%20Aces%20%28NA%29.sfc","filesize":2097152,"score":6.5,"genres":"Action > Simulation > Behind view > Arcade > Flight / aviation > Historical events > World War II","desc":"<p><em>Carrier Aces</em> is a 3rd person flight simulator that takes place during World War II. The game is also entirely split screen, with a second player or the computer opponent taking the controls on the second half of the secreen. Players control an aircraft pilot of either the United States or Japanese Empire. Based aboard an aircraft carrier, the player can engage in the following missions: 1vs1 dogfights, strafing runs on enemy ships, dive bombing on enemy ships, torpedo runs on enemy ships and carrier landings. All missions are made up of these elements, however campaign missions also feature the ability to decide which aircraft to bring into battle, each with it's own statistics, and keep track of progress on an area map. When two forces engage each other on this map, players can choose which plane to bring into battle and it will close in a 1vs1 battle with the enemy. In dogfights, both players control an aircraft whereas during ship combat, one player controls an aircraft and the other will control the ship's turret gun. Aircraft controls include being able to tilt left and right, climb, dive, increase speed, decrease speed, fire guns, release bombs/torpedoes (if present) and do a 180 degree loop. Turret controls are more limited, only allowing the player to aim left and right, fire the gun and zoom.</p>"},{"name":"Casper","year":1997,"developer":"Natsume Co., Ltd.","url":"5#C/Casper%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Action > Diagonal-down > Isometric > Direct control > Licensed","desc":"<p>You are Kat Harvey, the daughter of a paranormal expert. You've just met a friendly ghost named Casper, and you're getting to like him. But a pair of government agents are hot on both your tails! And if they catch you, who knows what they'll do to ghosts like him? You can't dwell on this much longer - you've got to protect him, and quick!</p><p>Based on the movie of the same name, \"Casper\" has you as Kat collecting items (especially coins and gems) while trying to protect your namesake ghostly friend from the wrath of government agents. Kat can use baseballs to stun the agents for a while, but she better use them wisely or she'll get caught ending the game. Luckily Kat can save the game at any time by activating a series of mechanical contraptions. Saving the game keeps track of the coins and gems Kat has collected, and that total determines how much of the game you have completed. Kat can also call on Casper to see through walls and locked doors and see what lies ahead, but he can only do this for a brief time before control returns to Kat.</p>"},{"name":"Casper","year":1996,"developer":"Absolute Entertainment, Inc."},{"name":"Castlevania: Dracula X","year":1995,"developer":"Konami Co., Ltd.","url":"7#Castlevania%3B%20Dracula%20X%20%28USA%29.sfc","filesize":2097152,"score":7.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Fantasy > Horror > Regional differences","desc":"<p>In Transylvania, people lived in fear of the evil Count Dracula. The ultimate embodiment of evil, Dracula swept his dark hand over the land, making the people mere sheep for his thirst for blood. But when a young woman named Sonia Belmont came forth to confront him, he made a horrible mistake: he underestimated her. Thus, the battle between Dracula and the Belmont family began.</p><p>Now, in the late 18th century, the battle still rages on...</p><p>Dracula has been resurrected by a cult of black magic to cast his shadow of fear and terror over the land once again. But now, Dracula takes his fight to those the Belmonts are close to. He kidnaps two girls, Annette and Maria Renard, to bring forth the latest Belmont, so that he may destroy the bloodline for good.</p><p>Richter Belmont, Annette's lover, has no choice now, but to take up the legendary Vampire Killer and follow his destiny: to battle Dracula and save Annette and Maria.</p>"},{"name":"Castlevania: Vampire's Kiss","year":1995,"developer":"Konami","url":"7#Castlevania%3B%20Vampire%27s%20Kiss%20%28Europe%29.sfc","filesize":2097152,"score":"","genres":"Plattformer","desc":"<p>Castlevania: Dracula X is a 1995 platform game developed and published by Konami for the Super Nintendo Entertainment System. It is the second and final Castlevania installment to be released for the Super NES.</p>"},{"name":"Champions World Class Soccer","year":1994,"developer":"Park Place Productions","url":"5#C/Champions%20-%20World%20Class%20Soccer%20%28NA%29.sfc","filesize":1048576,"score":6.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p>This soccer game offers 32 national teams to play, with none of the players' names shown. Shown from a slightly tilted 3rd-person side perspective, players can do an exhibition match, full tournament or go against a human player in the 2-player exhibition mode. The different teams are ranked by speed, offense and defence, and different team formations can be selected.</p><p>The gameplay is very basic: players can pass, shoot, tackle with a third button used to switch between players. In the options menu, fouls and offside can be disabled, the amount of time per half can be determined and there is a radar and mini-map to track the other players. The European edition is endorsed by Ryan Giggs and the game uses a password system to continue tournaments.</p>"},{"name":"Championship Pool","year":1993,"developer":"Bitmasters, Inc.","url":"5#C/Championship%20Pool%20%28NA%29.sfc","filesize":1048576,"score":6.3,"genres":"Sports > Top-down > Pool / snooker","desc":"<p><em>Championship Pool</em> is a pool game where players can 8-ball or 9-ball pool tournament that starts off with the BCA Regional Championship where the player must defeat 32 opponents in a first to four games match. If the player loses against any of the 32 opponents, they are then eliminated from the tournament. The winner of that then goes onto the World Championship.</p><p>All of the gameplay is done from a top down view of the table. The player moves an icon to indicate location they want to hit the ball too. To aid in the aiming, a ghost of the cue ball and the first ball that is hit is repetitively played out to show the path of the hit ball. With the all the shots there is a very small margin of error, but this is only notable when a long shot is played or a shot from a sharp angle and the ghost balls will randomly play out all the possible occurrences. The player can also change the power and spin of the played shot with the ghost balls will updating to show the outcome of those changes. </p><p>There are 4 different game modes that can be chosen, each with a different set of pool games. The different game modes and there games are:</p><p><strong>1. Tournament:</strong> The player must defeat 32 different players in a first to four knockout tournament in 8-ball or 9-ball pool before going on to the World Championship. During the tournament the opponent is never actually is seen playing there shots. Instead, when it is the opponents turn, it cuts to an image of the player with a caption and then returns the control to the player with some balls removed and moved. This way the opponent can finish the game within 4 turns regardless of if they where snookered or not.</p><p><strong>2. Challenge</strong>: It has many different pool games that are played, all with one player without an opponent. The games are:<em> </em><em>14.1 Challenge</em>* – After the break the ball is placed anywhere at the top of the table behind the line. At that point, the player can hit any ball but once the fails to hit a ball in a hole the game is over. If there is only one ball left on the table the rest of the balls are re-racked and play continues. At the end score is given based on the number of balls that where hit in the holes. The score are tallied up over 5 games to get the total score.</p><ul><li><p><strong>Eight Ball</strong> - After the break the ball is placed anywhere at the top of the table behind the line. The player must hit all the chosen set of balls (stripes or solids) and the 8-ball in one turn. The score is based on how many balls where hit in.</p></li><li><p><strong>Nine Ball</strong> - After the break the ball is placed anywhere at the top of the table behind the line. The player must hit the 9 ball in one turn. The score is based on how many balls where hit in.</p></li><li><p><strong>Equal Offence</strong> – Same as 14.1 Challenge but there is only one game played.</p></li><li><p><strong>Three Pool</strong> – Only have 3 balls on the table. Score is based on how many shots it takes to get all three balls in with lower been better.</p></li><li><p><strong>Speed Pool</strong> – Objective is to hit all the balls in as quickly as possible as a timer is timing how long the game takes. Any ball can be hit at any time and the player can miss the shot and not be penalised (other than taking longer).</p></li></ul><p><strong>3. Party:</strong>  It has many different multiplayer pool games that are played with ether just 2 or 2 to 8 human players. The games are:<em> </em><em>Eight Ball (2 Players)</em>*  – A standard eight ball game with the players taking turns to play.</p><ul><li><p><strong>Nine Ball (2-8 Players)</strong>  – A standard nine ball game with up to 8 players taking turns. First player to get the 9-ball in wins.</p></li><li><p><strong>14.1 Continuous (2 Players)</strong>  – Players can hit any ball in for a point. If a shot is missed then other player plays. If there is only one ball on the table the pocketed balls are re-racked. Play continues until one of the players reaches the score chosen at the start of the game.</p></li><li><p><strong>Ten Ball (2-8 Players)</strong>  – Same as Nine Ball except with 10 balls.</p></li><li><p><strong>Rotation (2-8 Players)</strong>  – Only the lowest ball can be hit and the score for getting a ball in is the value of the ball (e.g. 8-ball is 8 points). Player with the highest score at the end of the game wins.</p></li><li><p><strong>Straight Pool (2 Players)</strong>  – Same as 14.1 Continuous but the player with the highest score after one game wins.</p></li><li><p><strong>Equal Offence (2-8 Players)</strong>  – Same as Equal Offence in challenge mode but players can take turns to beat each others score.</p></li><li><p><strong>Fifteen Ball (2-8 Players)</strong>  – Same as Rotation except that any ball can be hit not just the lowest.</p></li><li><p><strong>One Pocket (2 Players)</strong>  – The two players are given one of the two pockets at the end of the table. The player must hit all the balls in there nominated pocket with the one with the most balls wins.</p></li><li><p><strong>Three Ball (2-8 Players)</strong>  – Same as Three Ball in challenge mode but players can take turns to beat each other’s score.</p></li><li><p><strong>Speed Ball (2-8 Players)</strong>  – Same as Speed Ball in challenge mode but players can take turns to beat each other’s score.</p></li></ul><p><strong>4. Freestyle:</strong> Lets the player practice with no opponent, no penalties, the ability to move any ball to the desired location (or remove by throwing the ball in the pocket), and the ability to place potted balls back on the table.</p>"},{"name":"Championship Soccer '94","year":1993,"developer":"Sensible Software","url":"5#C/Championship%20Soccer%20%2794%20%28NA%29.sfc","filesize":524288,"score":7.3,"genres":"Sports > Top-down > 2D scrolling > Real-time > Direct control > Football (European) / Soccer","desc":"<p><em>Championship Soccer '94</em> is based on the computer game Sensible Soccer: European Champions. The gameplay is identical: a fast-paced, top-down soccer game with emphasis on fast passes and simple control system.</p><p>Players can choose between 40 national, 64 club or 64 custom (fantasy) teams and can assemble their own tournaments (cup or league) with them. The number of participating teams and some of the rules can be customized. The main difference to the original is the reduced number of pre-set tournaments: for national teams World cup qualifiers and the new Maastricht Cup (a knockout tournament) and for club teams the European Superleague and EUFA Cup. Custom teams only have the Booby League and Turkey Tournament available anymore. Another important difference is that the athletes and tournaments no longer use original names, e.g. EUFA instead of UEFA.</p><p>The SEGA CD version uses its increased storage capacity for additional sound and some rendered movies, e.g. a flight over a stadium before starting a match.</p>"},{"name":"Championship Soccer '94","year":1994,"developer":"Sensible Software"},{"name":"Chaos Seed: Fūsui Kairōki","year":1996,"developer":"Neverland Co., Ltd."},{"name":"Chavez","year":1993,"developer":"Malibu Interactive","url":"sport-games-gba-snes-roms/Chavez%20%28USA%29.sfc","filesize":524288,"score":"","genres":"Sports > Side view > Boxing > Licensed","desc":"<p><em>Chavez</em> is a standard boxing game that is considered the Spanish version of Riddick Bowe Boxing with Spanish only in-game menus and 24 professional boxers including Speedo Garcia, Ron Ronaldo and the game's namesake, Julio Cesar Chavez, among many other latino boxers each with their own strengths and weaknesses</p><p>Standard modes like <em>Exhibition</em> and <em>Career</em> are present including the ability to create seven custom-made boxers and save them to a battery backup. The game screen is shown in side-scrolling fashion with a miniature ring at the top of the screen to show players their position in the ring and the \"power\" and \"health\" meters at the bottom of the screen.</p>"},{"name":"Chavez II","year":1994,"developer":"Sculptured Software, Inc.","url":"sport-games-gba-snes-roms/Chavez%20II%20%28USA%29.sfc","filesize":1048576,"score":"","genres":"Sports > Behind view > Boxing > Licensed","desc":"<p><em>Chavez II</em> is the sequel to Chavez, where once again the player can choose from nine fictional boxers including the game's namesake, Julio Cesar Chavez. They can choose either to partake in an <em>Exhibition</em> where they can choose any fighter or in <em>Career</em> and fight their way to the top of the rankings to take on Chavez to become World Champion.</p><p>The gameplay is a behind-the-back perspective with the player utilizing a variety of punches ranging from regular jabs to \"Super Punches\" that require will drain the fighter's stamina, but will be more devastating to opponents. Players can create their own boxer as well and the game's language is Spanish-only including in-game commentary.</p>"},{"name":"Chessmaster, The","year":1992,"developer":"The Software Toolworks, Inc.","url":"5#T/The%20Chessmaster%20%28NA%29.sfc","filesize":524288,"score":7.7,"genres":"Strategy > Diagonal-down > Top-down > Chess","desc":"<p><em>The Chessmaster</em> is a game where the player has the chance to play against the CPU controlled Chessmaster at a standard game of chess. </p><p>To play the game, the player must pick up the chess pieces with their hand cursor and place it in the desired location, within the rules of a standard chess game. There are 16 different difficulty levels, including 2 beginner levels, 13 standard levels (ranging from an average of 5 seconds to 4.5 minutes per shot depending on level), and an infinite level that will keep thinking of a shot until a perfect shot can be made or it is forced to make a move. There is also a teaching mode that shows the player all the possible moves with the selected piece. Two players can play against each other with two controllers and there is also an option for letting the Chessmaster play against itself.</p>"},{"name":"Chester Cheetah: Too Cool to Fool","year":1992,"developer":"System Vision"},{"name":"Chester Cheetah: Wild Wild Quest","year":1994,"developer":"Kaneko USA, Ltd.","url":"5#C/Chester%20Cheetah%20-%20Wild%2C%20Wild%20Quest%20%28NA%29.sfc","filesize":1310720,"score":"","genres":"Action > Arcade > Platform > Licensed","desc":"<p><em>Chester Cheetah: Wild Wild Quest</em> is the sequel to Chester Cheetah: Too Cool to Fool in the series based on the Frito-Lay mascot: Chester Cheetah.</p><p>Chester the cheetah lives in the Four Corners Zoo together with other animals. One day he decides to leave the zoo and to search for the legendary Hip City. Riding his trusty motor scooter, with a map in the paws, Chester encountered the nasty brute Mean Eugene. True to his habit of stealing and destroying things, Mean Eugene took the map from Chester, tore it to pieces, and scattered them all across United States of America. Chester must now visit various locations in the country to retrieve the map pieces and to find a way to Hip City.</p><p>The player may explore the game world in a non-linear fashion. At any time, there are three levels available and the player may tackle them in any order. Each solved level leads to additional two. On each level, the player must find the missing map piece, proceed to the exit, and defeat the level boss. Chester can dash and kill enemies by jumping on their heads. He dies from one hit, unless he has a pack of the cheetahs snack at his disposal. In this case, he'll recover full health.</p>"},{"name":"Chibi Maruko-chan: Mezase! Minami no Island!!","year":1995,"developer":"Konami Co., Ltd."},{"name":"Chip's Challenge","year":2021,"developer":"Epyx, Inc."},{"name":"Chō Aniki: Bakuretsu Rantōden","year":1995,"developer":"NCS Corporation"},{"name":"Chō Jikū Yōsai Macross: Scrambled Valkyrie","year":1993,"developer":"Winky Soft Co., Ltd."},{"name":"Chō Mahō Tairiku Wozz","year":1995,"developer":"Red Company Corporation"},{"name":"Choplifter III: Rescue Survive","year":1994,"developer":"Beam Software Pty., Ltd.","url":"7#Choplifter%20III%20%28Europe%29.sfc","filesize":524288,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Helicopter","desc":"<p>Choplifter III for the SNES features entirely different levels from the Game Gear and GameBoy versions, and plays slightly different than other Choplifter games. While the controls and basic gameplay haven't changed significantly, and the main goal of each level is still rescuing a certain number of hostages, Choplifter III is faster and more action-oriented than earlier Choplifter games.</p><p>Enemies appear in larger variety and numbers now. They reappear more often and some levels feature fights against large bosses. To compensate for this, there are more power-ups (such as missiles, bombs, invisibility, etc.) available, and it is possible to have the helicopter repaired at certain points in a level.</p>"},{"name":"Chrono Trigger","year":1995,"developer":"Square Co., Ltd.","url":"6#Chrono%20Trigger%20%28USA%29.sfc","filesize":4194304,"score":8.4,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Sci-fi / futuristic > Steampunk","desc":"<p>A young man named Crono is about to enjoy a carefree day: he plans to go to the Millennial Fair, where his friend Lucca intends to demonstrate her newest scientific invention: a teleporter. Upon his arrival, Crono meets a young girl named Marle, who volunteers to be the first to test Lucca's new device. However, Marle's pendant affects the teleporter's mechanism in a mysterious way, and as a result, she is teleported four hundred years into the past. Crono and Lucca quickly recreate the time portal and follow Marle. They find out that her unexpected appearance has created some confusion, and proceed to fix the error, which in turn leads to unforeseen consequences, eventually compelling the heroes to travel to different time periods and change the history of the world.</p><p><em>Chrono Trigger</em> is a Japanese-style role-playing game in which the player takes control of a party consisting of up to seven characters, developing the combat skills of its members and managing their equipment. There are no random encounters in the game: all the enemies are either visibly walking on the field maps and can be avoided by the player, or are waiting to ambush the party. No enemy encounters occur when the player navigates characters over the world map.</p><p>The game utilizes the ATB (active time battle) combat system from  Final Fantasy games as one of the combat style selections offered to the player in the beginning. The other selectable battle mechanic pauses combat whenever the player accesses the menu, effectively removing the real-time element and rendering the battles fully turn-based.</p><p>As the characters grow in power, their parameters increase, and they learn new \"techs\" - special powerful attacks and maneuvers which cost them magic points to use in battle. Techs may target a specific formation of enemies (e.g. a line) and can be used tactically depending on the enemies' positioning in combat. Characters may execute techs individually or perform double or triple techs, where each character contributes a tech which is combined with one or two others to unleash a powerful attack.</p><p>Once player-controlled characters acquire the ability to travel freely between time periods, the game's plot develops in a non-linear fashion. From that point on the player may opt to face the game's final adversary in combat and complete the story, or perform other plot-related quests. Depending on the moment of the story when the player decides to proceed to the final battle, the game may be concluded with thirteen different endings. The New Game+ option allows the player to start the game anew after having previously completed it, carrying over levels, techs, and equipment of the characters. </p><p>The PlayStation version features an anime-style introduction movie and cutscenes, a \"movie theater\" mode which allows the player to re-watch these movies and listen to the game's songs, as well as an unlockable bestiary, dungeon maps, and art gallery. The Nintendo DS version retains these changes and adds two new dungeons and a new possible ending that foreshadows the events of Chrono Cross.</p>"},{"name":"Chuck Rock","year":1992,"developer":"Core Design Ltd.","url":"5#C/Chuck%20Rock%20%28NA%29.sfc","filesize":1048576,"score":7.5,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Chuck Rock is your typical average caveman. He likes to spend his Sunday afternoons watching football and drinking beer. Unfortunately, his peaceful existence is interrupted one day when his wife, Ophelia Rock, is kidnapped by the village weirdo, Gary Gritter. So, Chuck is rather upset about this whole situation and you have to help him make things right.</p><p>The game is a side-scrolling platformer. Chuck fights a variety of dinosaurs using his belly-buster attack and a jump kick. Occasionally he has to pick up and throw rocks to defeat enemies and allow him to jump to greater heights.</p>"},{"name":"Clay Fighter","year":1993,"developer":"Visual Concepts Entertainment, Inc."},{"name":"Clay Fighter 2: Judgement Clay","year":1994,"developer":"Interplay Entertainment Corp.","url":"5#C/Clay%20Fighter%202%20-%20Judgment%20Clay%20%28NA%29.sfc","filesize":3145728,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p><em>Clay Fighter 2</em>, just like its predecessor, is a Street Fighter-like fighting game for 1 or 2 players.</p><p>The characters were made out of clay and then renderized, which provides the game some individuality in the enormous mass of Super NES fighting games.</p>"},{"name":"Clay Fighter: Tournament Edition","year":1994,"developer":"Visual Concepts Entertainment, Inc.","url":"5#C/Clay%20Fighter%20-%20Tournament%20Edition%20%28NA%29.sfc","filesize":3145728,"score":6.8,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p>The <em>Tournament Edition</em> of Clay Fighter fixes some glitches and adds new features to the original 2D fighting game. Most scenarios were changed or redone, the graphics are brighter and the gameplay is faster. The characters can now perform three and four-hit combos. More voice-overs and a new introduction cut-scene were added.</p><p>Three kinds of tournaments are now available: double elimination, single elimination and sudden death. One, four or eight players can join the tournaments, with the option of renaming their characters for customization.</p>"},{"name":"Claymates","year":1993,"developer":"Visual Concepts Entertainment, Inc.","url":"5#C/Claymates%20%28NA%29.sfc","filesize":1048576,"score":6.9,"genres":"Action > Side view > Platform > Puzzle elements","desc":"<p>From the creators of Clay Fighter comes a game about a shape-shifting ball of clay. You play as a boy named Clayton, whose father has developed a serum to turn humans into animals. However, an evil shaman desires this serum, and when he is denied ownership of it, he kidnaps Clayton's father and turns Clayton into a ball of clay. It's up to the unlikely hero to rescue his father, the serum, and the world!</p><p>The game is a side-scrolling platformer where you gain power-ups that let you transform into various forms to help you reach the end of the level. After each level, you are placed on the world map and given several robots who blindly walk forward until they hit an obstacle, then turn at a right angle and continue on their way. It's up to you to manipulate them to help you clear a way to the next level, where more challenges await.</p>"},{"name":"Cliffhanger","year":1993,"developer":"Malibu Interactive","url":"5#C/Cliffhanger%20%28NA%29.sfc","filesize":1048576,"score":5.3,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Platform > Licensed","desc":"<p>Standard side-scrolling beat'em up based off of the Stallone film of the same name. Sly must fight thugs and the elements as he tracks down suitcases of stolen cash dropped around the peaks of the Rockies. Combat follows the Final Fight standard, broken up by some mountain climbing and running (or 3-D snowboarding on the Sega CD) from avalanches. </p><p>Enemies are the standard brawler crooks, occasionally carrying guns and knives the player can pick up. The game tends to follow a pattern of having you deal with a natural hazard (scaling a cliff, leaping over gaps), then locking the screen down for a fighting segment, nature again, fighting again, etc. The available fighting moves is limited, compared to other games of this type, and the ability to hit an enemy character is noticeably less accurate.</p><p>The plot is identical to the film, with levels based off of, or inspired by, scenes in the movie. Animated cutscenes move the story along on the cartridge systems, while brief clips from the film play between levels on the Sega CD.</p>"},{"name":"Clock Tower","year":1995,"developer":"Human Entertainment, Inc."},{"name":"ClockWerx","year":1995,"developer":"Hect Co. Ltd."},{"name":"Clue","year":1992,"developer":"Sculptured Software, Inc.","url":"5#C/Clue%20%28NA%29.sfc","filesize":524288,"score":6.4,"genres":"Puzzle > Strategy > Top-down > Board game > Detective / mystery > Licensed","desc":"<p>Based on the board game Clue. A murder has taken place in a mansion. You play as one of the 6 suspects in this case. You have to find out who committed the crime, and with what weapon and where in the mansion it took place in. There are 5 levels of difficulty which basically give you less information the harder up the level.</p>"},{"name":"College Football USA 97","year":1996,"developer":"Ceris Software","url":"5#C/College%20Football%20USA%20%2797%20%28NA%29.sfc","filesize":2097152,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>College Football USA 97</em> is a college football game featuring 111 Division 1-A teams. The game has exhibition, season, tournament, and tiebreaker modes. It also contains a create a player feature. Basically it is an updated version of College Football USA 96 with similar gameplay.</p>"},{"name":"College Slam","year":1996,"developer":"Iguana UK","url":"5#C/College%20Slam%20%28NA%29.sfc","filesize":3145728,"score":6.7,"genres":"Sports > Diagonal-down > 2D scrolling > Arcade > Basketball > Licensed","desc":"<p>Part of the NBA Jam series of basketball games, College Slam allows you to choose from over 40 real college teams and take part in head-to-head games, tournament games, and season-long play. The gameplay is arcade-style two-on-two fast action featuring backboard shattering wild dunks, power-ups and other crazy moves. The game also features fight songs from all the available teams.</p>"},{"name":"Columns","year":1999,"developer":"SEGA Enterprises Ltd."},{"name":"Combatribes, The","year":1992,"developer":"Technos Japan Corp.","url":"5#T/The%20Combatribes%20%28NA%29.sfc","filesize":1572864,"score":5.8,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Sci-fi / futuristic > Regional differences","desc":"<p>A 2D side-scrolling brawler, <em>The Combatribes</em> puts you and a friend in the shoes of combat cyborgs Berzeker, Bullova and Blitz (yes those are their real names) as they attempt to defeat the evil crime ring \"Ground Zero\", led by the cybernetically enhanced Martha Splatterhead and her minions.</p><p>The game is set around simple stages in which wave after wave of baddies attack you from all directions. Once you defeat enough of them with your basic attacks and special moves a boss character appears which you'll need to defeat before moving on to the next stage.</p><p>Besides the arcade mode, a Vs one-on-one mode is available with the inclusion of all boss characters as selectable fighters.</p>"},{"name":"Congo's Caper","year":1992,"developer":"DE Act Team","url":"6#Congo%27s%20Caper%20%28USA%29.sfc","filesize":524288,"score":7.1,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>Congo and Congette were a pair of monkeys happily living in the jungle. One day a magic ruby fell out of the sky and turned both Congo and Congette into half-humans. The ruby also brought forth a demon-kid who prompty kidnaps Congette. It will be up to the newly evolved Congo to travel across the jungles and rescue her.</p><p><em>Congo's Caper</em> is a side-scrolling platform action game. Being the second Tatakae Genshijin game, it is the sequel to Joe &amp; Mac and controls very similar to that game. Players move Congo to different locations on a map, each representing one level. Controlling Congo, the player can move left, right, jump, duck, swim, climb ladders, roll down hills and swing his club to attack enemies. If Congo is damaged or hit by enemies, he reverts to a monkey form. Another hit as a monkey will kill him and use up one of his lives. To return to human form, Congo can collect a ruby or if he collects rubies while already human he can turn into an invincible Super Congo for a short while. Collecting 100 diamonds or 1 big diamond will give Congo and extra life while collecting sapphires will spin the slot machine (and possibilities of bonuses).</p>"},{"name":"Contra III: The Alien Wars","year":1992,"developer":"Konami Co., Ltd.","url":"7#Contra%20III%3B%20The%20Alien%20Wars%20%28USA%29.sfc","filesize":1048576,"score":8.1,"genres":"Action > Side view > Top-down > 2D scrolling > Platform > Shooter > Sci-fi / futuristic > Regional differences","desc":"<p>The hideous Red Falcon, thought to have been destroyed long ago by the Earth's greatest commandos, Mad Dog and Scorpion, has risen again, this time very angry and thirsty for revenge. His armies are marching through the cities, across the lands, with the intention of exterminating the human race like a bad case of fleas. Two commandos, Jimbo and Sully, have come forth now to defeat Red Falcon and save what remains of the world from his hideous plans.</p><p><em>The Alien War</em> is the third entry in the Contra series. Like its predecessors, it is a predominantly side-scrolling shooter with a heavy emphasis on action. The protagonist can carry two weapons (as opposed to one in the previous entries), and fire in eight directions when standing still. New abilities include climbing on walls, grabbing poles and navigating tanks. Parts of scenery can be destroyed.</p><p>In a few instances the protagonist will also participate in motorcycle changes. Two stages have a top-down view and are played differently than the side-scrolling levels, with more freedom of exploration and the necessity to complete mission objectives rather than simply advance in one direction and kill all the enemies.</p>"},{"name":"Cool Spot","year":1993,"developer":"The Global Team","url":"5#C/Cool%20Spot%20%28NA%29.sfc","filesize":1048576,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p><em>Cool Spot</em> is a colorful 2D platform game featuring the 7-Up mascot as the main protagonist. The game objective is fairly simple and straightforward. The player character has to collect enough number of cool points throughout each level in order to find and rescue his captured uncool Spot buddies and complete the game.</p>"},{"name":"Cool World","year":1992,"developer":"Painting by Numbers, Ltd.","url":"7#Cool%20World%20%28USA%29.sfc","filesize":1048576,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Cool World exists as an alternate dimension to this world where cartoon doodles are alive. An object called the Golden Spike of Power keeps both dimensions balanced in harmony. It was placed on top of the Ocean Hotel in Las Vegas for safekeeping. However a doodle named Holli Would want the power of the Golden Spike so she can become a real human, but in doing so may cause both worlds to come to ruin. A prisoner in the real world, Jack Deebs, is transported into the Cool World by Holli Would as she is interested in him. Now Jack has to stop Holli from getting her hands on the Golden Spike so the real world he wants to return to isn't destroyed. </p><p><em>Cool World</em> consists of eight levels. with six being platforming action levels and two being side-scrolling driving platforming levels. In the game Jack can jump, collect objects like nickels and sweets, suck doodles into a pen, and use a stretch punch to deal with foes. As Jack explores the levels he should try to avoid getting arrested by the Cool World Popper Police force. If Jack does get arrested he can either get chewed out by Detective Frank Harris or will have to pay bail money using the aforementioned nickels.</p>"},{"name":"Cooly Skunk: Demo","year":1996,"developer":"Ukiyotei Company, Ltd."},{"name":"Cosmo Gang: The Puzzle","year":1993,"developer":"Namco Limited"},{"name":"Cosmo Gang: The Video","year":1992,"developer":"Namco Limited"},{"name":"Cosmo Police Galivan II: Arrow of Justice","year":1993,"developer":"Cream"},{"name":"Crayon Shin-chan: Arashi o Yobu Enji","year":1993,"developer":""},{"name":"Crystal Beans from Dungeon Explorer","year":1995,"developer":"Birthday"},{"name":"Cu-On-Pa SFC","year":1996,"developer":"T&E Soft, Inc."},{"name":"Cutthroat Island","year":1996,"developer":"Software Creations Ltd.","url":"5#C/CutThroat%20Island%20%28NA%29.sfc","filesize":2097152,"score":5.1,"genres":"Action > Side view > 2D scrolling > Fighting > Licensed","desc":"<p>In this game you play the role of a pirate lady called Morgan who was given a piece of a map by her father before he died. In the game you set out to find more pieces of the map so that you can find the hidden treasure buried on Cutthroat Island. The gameplay involves you scrolling along the screen and sword fighting pirates and other scoundrels one on one with various different attacks. As you progress you unlock more combos. This game is based on the film by the same name.</p>"},{"name":"Cyber Knight","year":1992,"developer":"Advance Communication Company"},{"name":"Cyber Knight II: Chikyū Teikoku no Yabō","year":1994,"developer":"Atelier Double Co. Ltd."},{"name":"Cyber Spin","year":1992,"developer":"Arc Co., Ltd.","url":"5#C/Cyber%20Spin%20%28NA%29.sfc","filesize":524288,"score":"","genres":"Racing / Driving > Top-down > Sci-fi / futuristic > Licensed > Regional differences","desc":"<p><em>Cyber Spin</em> is a top down racing game. The player takes on the role of Chuck Davis, superstar teenage racer, driving in the Cyber Car. Chuck faces seven opponents in Grands Prix across ten nations. The main obstacle in <em>Cyber Spin</em> is the power supply. Power is depleted when turbo is used and also when damage is taken. When there is no power left, the race is over for Chuck.</p>"},{"name":"Cybernator","year":1992,"developer":"NCS Corporation","url":"4#snes/Cybernator.zip","filesize":791409,"score":8,"genres":"Action > Side view > Anime / Manga > Platform > Shooter > Mecha / giant robot > Sci-fi / futuristic > Regional differences","desc":"<p>In a future where fossil fuels are limited, major countries and forces of the world are at war with one another over territory. Alliances are made, forming two major sides: The Axis and The Federation. The elite units in these wars are Assault Suits, man-piloted combat mechs called Assault Suits. Jake is one such pilot, drafted into the Pacific States' Marine Corp under the Federation. During his training, the war has grown substantially and upon being assigned to a platoon, he is immediately thrown into combat.</p><p><em>Cybernator</em> is a side scrolling mech combat game and platform game. The player controls Jake as he moves his assault suit left and right on the battlefield. The assault suit can jump and use a jetpack for a short time to increase altitude. The assault suit begins with a Shot machine gun weapon that spreads out fire in front, and a Punch weapon for close melee. Additional weapons can be found during the course of the game and existing weapons improved by the gathering of \"P\" power-ups left by defeated enemies. </p><p>Each level contains a variety of enemies and an end boss which must be destroyed to reach the next level. Some levels take place as horizontally scrolling shooters, in which the Assault suit can move up, down, left and right on the screen, but is constantly advancing towards new threats.</p><p>The PlayStation 2 version is not a straight port or emulation of the original SNES game. It has altered visuals and balance tweaks, as well as a brief new stage at the beginning.</p>"},{"name":"Cyborg 009","year":1994,"developer":"BEC Co., Ltd."}]