[{"name":"D-Force","year":1991,"developer":"Cream","url":":D-Force (USA)","filesize":465090,"score":5.2,"genres":"Action > Top-down > Arcade > Shooter > Helicopter","desc":"<p>A top-down scrolling shooter. Players control a helicopter and must fight their way through several levels, shooting everything that moves. Defeated enemies sometimes drop power-ups that improve the helicopter's standard weapon or equip it with homing missiles as secondary weapon. In addition to the standard \"shooting mode\" D-Force also features an \"exploration mode\". In exploration mode, the player's helicopter is attacked by animals instead of warplanes or other helicopters. In this mode, the shoulder buttons can be used to change the helicopters altitude and attack (or dodge) enemies at different heights.</p>"},{"name":"Daffy Duck: The Marvin Missions","year":1993,"developer":"ICOM Simulations, Inc.","url":":Daffy Duck - The Marvin Missions (USA)","filesize":590708,"score":6.9,"genres":"Action > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>Based on Chuck Jones' Looney Tunes character, Daffy Duck, <em>Daffy Duck: The Marvin Missions</em> sees Daffy in his quirky \"Duck Dodgers\" spin-off persona, also known as \"Duck Dodgers in the 24th and 1/2 Century!\".</p><p>In this game, Duck Dodgers sets out to stop Marvin the Martian from performing various notorious deeds, including destroying his beloved home-planet, Earth. There seems to be only one way to stop Marvin - and that's to destroy all five of his deadly machines!</p><p>Gameplay-wise, this is a standard platforming affair. However, you can also shoot at your enemies using an array of weapons, fly around with your jet-pack and defend enemy fire with your shield.</p>"},{"name":"Dai-3-ji Super Robot Taisen","year":1993,"developer":"Winky Soft Co., Ltd."},{"name":"Dai-4-ji Super Robot Taisen","year":1995,"developer":"Winky Soft Co., Ltd."},{"name":"Daikaijū Monogatari","year":1994,"developer":"Hudson Soft Company, Ltd."},{"name":"Darius Twin","year":1991,"developer":"Taito Corporation","url":":Darius Twin (USA)","filesize":411540,"score":6.4,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The evil alliance under the leadership of Belser is attacking your world; as pilot of a Silver Hawk fighter, your goal is to stop them! <em>Darius Twin</em> is a side scrolling shooter similar to other games in the Darius series. You'll fly through a series of different stages, each with numerous enemies and ending with a large boss. You begin the game with a limited amount of fire power, but after shooting certain enemies power ups are left behind to increase your capabilities. Unlike many of the Darius games, if your ship is destroyed you don't lose all of the weapons you've collected; likewise you also continue on at the same point rather than being sent back to a checkpoint. Similar to many of the Darius games there are different routes that can be taken towards the final stage. At the end of each stage, you are shown a map and can select the next stage you would like to complete.</p>"},{"name":"Dark Half","year":1996,"developer":"Westone Co., Ltd."},{"name":"Dark Kingdom","year":1994,"developer":"Telenet Japan Co., Ltd."},{"name":"Dark Law: Meaning of Death","year":1997,"developer":"Sakata SAS Co., Ltd."},{"name":"Data East Classic Collection","year":2017,"developer":""},{"name":"David Crane's Amazing Tennis","year":1992,"developer":"Imagineering Inc.","url":":David Crane's Amazing Tennis (USA)","filesize":523548,"score":6.9,"genres":"Sports > Behind view > 2D scrolling > Tennis > Licensed","desc":"<p>A tennis game featuring both an exhibition and a tournament mode. In the head to head exhibition mode, the player can choose their opponent (with the higher ranked opponents being better than the lower ranked ones). The tournament mode allows for 16 different players to compete to become the champion. Both of these modes can be played on either grass, hard, or a clay court. The player can also choose whether to be either a left or right handed tennis player.</p><p>During the game, whoever is serving the ball will be closer to the screen. Players will be able to use topspin, execute drop shots, perform volleys, lobs, slices and overhead smashes, and decide on either a hard or soft serve to keep the opponent off balance.</p><p>Although the game features fictional players, it is endorsed by Footlocker.</p>"},{"name":"Davis Cup Tennis","year":1993,"developer":"Loriciel SA"},{"name":"Daze Before Christmas","year":1994,"developer":"Funcom Oslo A/S"},{"name":"Deadly Moves","year":1992,"developer":"System Vision"},{"name":"Death and Return of Superman, The","year":1994,"developer":"Blizzard Entertainment Inc.","url":":Death and Return of Superman, The (USA) (Rev 1)","filesize":1330172,"score":6.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p>\"Doomsday\" is here and only Superman can stop him. Unfortunately in doing so he gets killed himself. Now four other characters emerge, each claiming to be the real hero. The story starts you off with Superman, then Steel, the Eradicator, the Cyborg, and Superboy. Each character has slightly varied moves so different strategies apply when playing as them.</p><p>The gameplay is basically that of a standard beat-em-up, with the punches, throws and specials moves.</p>"},{"name":"Demolition Man","year":1995,"developer":"Alexandria, Inc.","url":":Demolition Man (Europe)","filesize":995501,"score":7.4,"genres":"Action > Diagonal-down > Side view > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Demolition Man</em> is a game based on the 1993 movie by the same name. As with the movie, the game takes place in a dystopian Los Angeles, in 1996. John Spartan is the country´s most fearsome cop and hunts his nemesis, Simon Phoenix. However in doing so, he kills several innocent civilians and both characters are sentenced to cryostasis rehabilitation where they will be brainwashed for 30 years. However the brainwashing does not go as planned and upon waking up, Phoenix goes on a new crime spree. However in 30 years the world has also changed and Los Angeles has become San Angeles, a utopian and violence-free society. As a remnant of a more violent past, police officer John Spartan is once again sent to capture Phoenix.</p><p><em>Demolition Man</em> is a fast-paced platform game, with some levels taking place in an overhead perspective (similar to Smash TV). As John Spartan, the player will spend most of his time shooting endless waves of \"cryocons\" released upon the antiseptic world of the future. The standard weapon can be upgraded with a shotgun and magnum, both with limited ammo. Additionally, various types of grenades can be collected, which are thrown independently of the firearm. Simon Phoenix appears as a boss character at the end of every level that is directly tied in with the movie.</p><p>The Sega CD version of the game retains identical levels and gameplay, but adds digitized clips from the film to introduce levels and advance the plot.</p>"},{"name":"Demon's Crest","year":1994,"developer":"Capcom Co., Ltd.","url":":Demon's Crest (USA)","filesize":1415221,"score":8.1,"genres":"Action > Side view > 2D scrolling > Arcade > Metroidvania > Platform > Direct control > Fantasy","desc":"<p><em>Demon's Crest</em> is a sequel to Gargoyle's Quest. Once, the world of demons and the world of humans co-existed in harmony. But then six mysterious crests fell from the sky onto the earth, crests of six elements: fire, water, air, earth, time, and heaven. The demons became obsessed with the crests and with the power hidden in them, and so a civil war started. Finally, the Red Demon named Firebrand got all the crests but one - the crest of heaven. The Dragon Demon possessed this crest, so Firebrand decided to confront him. He defeated the Dragon Demon but was himself severely wounded in battle. While flying back, he was knocked down by a mysterious enemy and lost his crests.</p><p>You control Firebrand, a flying red demon, and your mission is to help him to gain his crests, and to defeat everybody who stands in his way. This is a platform action game: you fight the enemies in real-time (using magical attacks), avoid obstacles, collect healing potions on the way, etc. Firebrand can also fly for a short time.</p>"},{"name":"Denjinmakai","year":1994,"developer":"Winky Soft Co., Ltd."},{"name":"Dennis the Menace","year":1993,"developer":"Ocean Software Ltd.","url":":Dennis the Menace (USA)","filesize":705504,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>This game brings the US cartoon character Dennis the Menace's menacing treatment of poor old Mr. Wilson to the computer screen, around the time of the film also released in 1993. </p><p><em>Dennis</em> is a platform game across settings such as Sewers, the Park, and Mr. Wilson’s house, each of which has an end-of-level bad guy. The in-level opposition follows standard attack patterns and can usually be avoided. The enemies regenerate as you move on, although you generally only progress from bottom-left to top-right anyway. </p><p>Some of the holes in the ground are deadly while others lead to secret rooms. Fortunately, you are given up to 9 lives at the start, and lots of extra lives are on offer throughout the game, so these are well worth checking out. A choice between music and sound effects is offered.</p>"},{"name":"Der Langrisser","year":1995,"developer":"Crosstalk Inc."},{"name":"Desert Strike: Return to the Gulf","year":1992,"developer":"Electronic Arts, Inc.","url":":Desert Strike; Return to the Gulf (Europe)","filesize":675551,"score":7.8,"genres":"Action > Diagonal-down > Isometric > Shooter > Helicopter > Contemporary > Middle East > War","desc":"<p>The first game in the Strike series. A year after the Gulf War, a self-styled general named Kilbaba (Muababa in the GBA version) takes over an Arab Emirate and threatens to start World War III against his western enemy, the United States. The whole world holds its breath as the President has chosen you to destroy Kilbaba and his terrorist army before he launches a nuclear attack on the world!</p><p>You must fly a specially designed AH-64A Apache on a series of missions to rescue missing-in-action characters, destroy power plants, blow apart SCUD missiles, etc. to take out the enemy defense while trying to find out Kilbaba's plans.</p><p>The player controls the helicopter from an overhead, isometric perspective. The Apache is equipped with three weapon types: a machine gun and two types of missiles of different strength. During the missions, the player must beware anti-aircraft guns, missile launchers and tanks, outmaneuvering enemy fire or destroying the enemy weaponry. The Apache is destroyed if its fuel runs out, or if the armor (functioning as health) is completely depleted. However, armor can be replenished by bringing back MIA soldiers and prisoners of war back to the landing zone. There are also fuel, ammo and armor pickups available on the field.</p>"},{"name":"Dharma Dōjō","year":1995,"developer":"Metro Corporation"},{"name":"Dig & Spike Volleyball","year":1992,"developer":"Tose Co., Ltd.","url":":Dig & Spike Volleyball (USA)","filesize":518016,"score":"","genres":"Sports > Side view > Top-down > Volleyball","desc":"<p><em>Dig &amp; Spike Volleyball</em> is a volleyball game where the player can choose from two different venues, each with their own rules. They can either choose an indoor event, where they can choose from International teams and compete in a 6 v. 6 person squad with rules and regulations, giving it an authentic feel. There is also a 2 vs. 2 beach game where the gameplay is more relaxed which is ideal for beginners to the game, letting them learn the basic's such as serving, spiking and blocking.</p><p>There is also a practice mode that shows players the controls of the game and helps get them started. The game also contains two-player action that allows friends to compete head-to-head.</p>"},{"name":"Dino Dini's Soccer","year":1994,"developer":"Dini & Dini Productions"},{"name":"DinoCity","year":1992,"developer":"Irem Software Engineering, Inc.","url":":DinoCity (Rev 2)","filesize":436599,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>Timmy and his friend, Jaime go into Timmy's father's lab to watch a movie on the big screen. Little do they know that the big screen is actually a time machine. When Timmy touches the remote they are both sucked into prehistoric times. Now in order to return home they must reclaim a time machine fuse that was stolen by some Neanderthals who go by the name of \"The Rockies\". The Rockies are also looking to destroy DinoCity, so two dinosaurs named Rex and Tops decide to help out the two human children in their fight against the Neanderthals.</p><p>Gameplay involves one of the humans riding one of the dinosaurs throughout six stages, To defeat the enemies, the player can jump on top of them, punch them, or throw projectiles at them. Defeated enemies may drop eggs. It is also possible for the human to dismount the dinosaur. The human will now be able to jump and reach higher places. </p><p>The player can only take three hits before losing a life. Energy can be refilled by finding hearts throughout a level. Time is of the essence as all stages are timed.</p>"},{"name":"Dirt Racer","year":1995,"developer":"Motivetime Ltd."},{"name":"Dirt Trax FX","year":1995,"developer":"Sculptured Software, Inc.","url":":Dirt Trax FX (USA)","filesize":326047,"score":7.2,"genres":"Racing / Driving > Behind view > Arcade > Motorcycle > Off-roading > Track racing > Vehicle simulator","desc":"<p>Dirt Trax Fx is a Motocross racing game in which players can choose between 8 drivers, differing in top speed, acceleration, turning and braking, to compete on 22 different tracks. The tracks feature lots of mounds, ramps, pits and other similar obstacles. Parts of a track might also be covered in water mud or ice. To successfully navigate the motorbike through these obstacles, the shoulder buttons can be used to lean the bike, while pressing up or down changes the angle of the bike. Before the game begins, players can choose between four different bikes ranging from 50cc to 500cc (the last bike needs to be unlocked first). The choice of the bike greatly affects the game's speed as well as the overall difficulty.</p><p>Apart from the main race, there is also a \"Rad Tag\" mode. In this mode, a timer ticks down that can only be stopped by hitting the opponent. The driver whose timer reaches zero first loses.</p>"},{"name":"Disney's Aladdin","year":1993,"developer":"Capcom Co., Ltd.","url":":Disney's Aladdin (USA)","filesize":826262,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>Disney's Aladdin</em> is based on the 1992 Disney animated film. For the GBA and the SNES editions development was handled by Capcom. Like other versions, the game is a side-scrolling platformer where the player controls Aladdin through locations from the movie like the city of Agrabah, the Cave of Wonders, and Jafar's palace. Some locations not appearing in the film include a trippy, candy-colored world inside the Genie's lamp and an ancient pyramid. Enemies standing in Aladdin's way include the Sultan's guards, animals and various magical creatures. They can be dispatched by jumping on top of them or by throwing apples at them. Besides jumping and throwing, another one of Aladdin's abilities consists of him pulling out a blanket and using it to slow his fall.</p><p>Besides the platform levels, the game also includes magic carpet rides as well as a bonus game played between levels: if Aladdin collects a golden scarab in a level, he can play a wheel of fortune for extra health, lives or continues.</p>"},{"name":"Disney's Beauty and the Beast","year":1994,"developer":"Probe Software Ltd.","url":":Disney's Beauty and the Beast (USA)","filesize":735762,"score":5.8,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy > Licensed","desc":"<p><em>Disney's Beauty and the Beast</em> begins with a narrative that parallels the 1991 animated film-- an enchantress transforms a mean prince into a beast until such time that he could learn to love. One day, a woman named Belle happens into his castle. The Beast must pursue her through his own deadly castle for both their safety.</p><p>This is a side-scrolling action platformer. The Beast is rather slow but with a powerful claw strike and jump-stomp attack. He can also scale certain types of walls and can catch the edges of platforms. He also has a special roar that allows him to stun certain enemies. This becomes necessary in some sections in order to freeze bats so the Beast can use them as stepping stones to higher platforms.</p><p>The game has a time limit in the form of the magical rose. The Beast must battle through such levels as the dungeon and the main hall battling giant spiders, rats, rogue candle monsters, live gargoyle statues, and enchanted brooms, while collecting books for points (since Belle likes books) and magic mirrors that allow the Beast to see further into the current level to anticipate what challenges await.</p>"},{"name":"Disney's Bonkers","year":1994,"developer":"Sun L","url":":Disney's Bonkers (USA)","filesize":735658,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The game is based on the Disney TV show of the same name. Bonkers is a bob-cat police officer who lives in \"toondom\", a cartoony land where people co-exist with various creatures from cartoon movies. </p><p>One day, Bonkers and his partner Lucky hear about a shocking robbery: Hollywood's most valuable treasures - Sorcerer's Hat, Mermaid's Voice, and Magic Lamp - were stolen! Now it is up to Bonkers to capture the thieves and to take back the stolen treasures.</p><p>This is an action platform game. Bonkers can jump and dash, throwing enemies aside and even destroying some obstacles. Enemies can be killed by jumping on their heads. You can also collect various items such as bombs to throw at the enemies, cakes to refill your health, or hyper juice to make you dash continuously.</p><p>Besides the common license, this game is totally different from the Genesis game  Bonkers.</p>"},{"name":"Disney's Goof Troop","year":1993,"developer":"Capcom Co., Ltd.","url":":Disney's Goof Troop (USA)","filesize":345087,"score":7.4,"genres":"Action > Top-down > Puzzle elements > Licensed","desc":"<p>Goofy and his son Max were enjoying a peaceful day of fishing, when Keelhaul Pete absconds with Pete and PJ. </p><p>Now it's up to Goofy and Max to travel to Spoonerville Island and venture through the jungle to rescue their friends. As either character, you'll take on an army of surly swashbucklers as you dodge exploding cannon balls and search dank dungeons on your way to the final showdown with Keelhaul Pete.</p><p>Along the way, you'll have to dig for treasure and solve puzzles to find the keys that will allow you to enter the pirate's hideout and face Pete.</p>"},{"name":"Disney's Magical Quest 3 starring Mickey & Donald","year":1995,"developer":"Capcom Co., Ltd."},{"name":"Disney's The Jungle Book","year":1994,"developer":"Virgin Interactive Entertainment, Inc.","url":":Disney's The Jungle Book (USA)","filesize":1300544,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Like the other adaptations of the 1967 Disney animated film <em>The Jungle Book</em>, the SNES version is a side-scrolling platformer starring Mowgli, the young boy raised by wolves in the jungle. Running, jumping, climbing, and swinging on vines, he must make his way through 11 levels. These includes the jungle by day and by night, a village high in the trees, a waterfall, ape King Louie's realm and the wasteland charred by a fire.</p><p>The jungle is full of dangerous animals, like bugs, snakes, anteaters and monkeys, which Mowgli can defeat by jumping on their heads or throwing bananas (from an unlimited supply) at them. Some jungle fruit like mangoes and coconuts can also be collected and used as weapons. Other power-ups include hearts (some of them hidden in fruit) that refill Mowgli's health bar, extra lives, masks that trigger invincibility and two kinds of gems: red gems count towards extra continues at the end of a level, while green gems count toward a special ending of the game.</p><p>Some variety from the standard platforming comes into play in two automatically scrolling levels: once when Mowgli rides a parrot and once when he escapes from the collapsing ruins of Louie's castle. Several levels end in boss fights, featuring Kaa the snake, King Louie the orangutan and Shere Khan the tiger.</p>"},{"name":"Disney's Timon & Pumbaa's Jungle Games","year":1997,"developer":"7th Level, Inc."},{"name":"Disney's Toy Story","year":1995,"developer":"Tiertex Design Studios","url":":Disney's Toy Story (USA)","filesize":2924010,"score":7.1,"genres":"Action > 1st-person > Behind view > Side view > 2D scrolling > Platform > Licensed","desc":"<p>This game is based on the movie \"Toy Story\". It sets you as the character of Woody as you jump, swing, and drive to the end of each level. Each level contains familar scenes from the movie. The gameplay consists of the platform\\sidescrolling kind. You use Woody's pullstring to defeat enemies like sharks, Mr. Potatohead, and Ham. After each level, you are treated to still images from the movie.</p>"},{"name":"Do Re Mi Fantasy: Milon no DokiDoki Daibōken","year":1996,"developer":"Hudson Soft Company, Ltd."},{"name":"Dōkyūsei 2","year":1997,"developer":"Elf Co., Ltd."},{"name":"Donkey Kong Country","year":1994,"developer":"Rare Limited","url":":Donkey Kong Country (USA) (Rev 2)","filesize":2549790,"score":8.1,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>King K. Rool has stolen Donkey Kong's banana stash, and Donkey Kong needs your help to get them back. In search of K. Rool, the Kremling horde impedes your progress. Kremlings, crocodile-like creatures, include Kritters (they succumb to a simple jump on the head), Krushas (they are virtually indestructible), and others. There are also other enemies that block your path, such as beavers, snakes, vultures. Leading them are dastardly bosses, including Very Gnawty, Necky, Queen B., and Dumb Drum, and they all bar the way with their own special blend of villainy.</p><p>Donkey Kong is joined by Diddy Kong: these two primates differ significantly. For example, Donkey Kong is generally stronger; he can destroy most enemies with a single jump and can lift barrels straight over his head to throw them farther. On the other hand, Diddy is faster and not as strong as Donkey; he can run really fast and do cartwheels. Diddy carries barrels in front of him, creating a shield against frontal attacks.</p><p>The game is split into different worlds, which are split into different levels. Each level contains bonus areas, where one can collect bananas, medallions, and lives. At the end of each world is a boss, which is usually a larger version of a minor enemy.</p><p>The original Super Nintendo game was later released for Nintendo's handheld systems. The Game Boy Color version has an exclusive level (Necky Nutmare) and additional bonus games, Funky's Fishing and five Crosshair Cranky minigames. There was also the addition of collectible DK sticker packs scattered throughout the levels. These sticker packs could be printed out using the Game Boy Printer. The game also has two more difficulty options that become available after beating the game.Beating the game once lets the player turn off DK barrels and beating the game a second time will let the player turn off checkpoint barrels.</p><p>The Game Boy Advance version also had additional bonus games. It to has a version of Funky's Fishing but instead of the crosshair themed games, there is now Candy's Dance Studio, which hosts six dance games. There is also the additions of a time attack mode called DK Attack, a harder difficulty mode called Hero Mode (can only play as Diddy Kong and the game no longer offers Donkey Kong barrels and checkpoints throughout the levels), and the sticker book idea from the Gameboy Color version was replaced with collecting scrapbook pictures instead.</p>"},{"name":"Donkey Kong Country 2: Diddy's Kong Quest","year":1995,"developer":"Rare Limited","url":":Donkey Kong Country 2 - Diddy's Kong Quest (USA) (En,Fr) (Rev 1)","filesize":2989294,"score":8.2,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Fantasy","desc":"<p>Donkey Kong has been \"kongnapped\" by the nasty K. Rool and the Kremlings, and it is up to Diddy Kong and his girlfriend Dixie Kong to save him.</p><p>All the familiar enemies and helpful friends return, along with some new characters, including the wise Wrinkly Kong who will teach you some important lessons in gameplay. Again the emphasis is on banana collecting, whereas every one hundred bananas make one extra life. Apart from beating K. Rool and rescuing Donkey Kong, there are extra missions that can be completed. Collect enough K. Rool Kremkoins to open up the routes to the Lost World, while every level has a hidden Hero Coin to collect.</p><p>The Game Boy Advance version also includes a bonus game mode with three minigames (Expresso's Racing, Funky's Flights, and Bag a Bug) plus a time attack mode called Diddy's Dash (complete levels as fast as possible as Diddy Kong). This version of the game also includes an additional boss (Kerozene) and two more collectibles (Golden Feathers that increase Expresso's stats in the Expresso's Racing bonus game and photographs that fill out a scrapbook). Due to the addition of the bonus games and the scrapbook 28 more  Hero Coins were also added.</p>"},{"name":"Donkey Kong Country 3: Dixie Kong's Double Trouble!","year":1996,"developer":"Rare Limited","url":":Donkey Kong Country 3 - Dixie Kong's Double Trouble! (USA) (En,Fr)","filesize":3196004,"score":8,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>This time both Donkey Kong and Diddy Kong have been kong-napped by a mysterious new leader of the Kremlings, and it's up to Dixie and new team mate Kiddy Kong to save the day.</p><p>New elements to the series includes the Brother Bears, thirteen Bears who, if you pay them with Bear Coins found in each level, will aid you in your quest by building certain items. Also, new bonus mission have you playing a 1st/3rd person shooter style party game. Plus a host of new enemies, the usual huge end of world bosses and a collection of the Kong family who will help you out as best they can.</p><p>The Game Boy Advance version adds a new world Pacifica, which is made up of six stages and a boss level. Also, a new boss called Kroctopuss and a new Brothers Bear named Bachelor has also been added. Swanky's sideshow.got turned into a virtual reality mini-game and Funky Kong also offers his own mini-games to play. Also, five more Banana Birds have been added to the game, increasing the total to 20.</p>"},{"name":"Donkey Kong Country: Blockbuster World Video Game Championship II","year":1994,"developer":"Rare Limited"},{"name":"Doom","year":1995,"developer":"id Software, Inc.","url":":Doom (USA)","filesize":1352495,"score":7.5,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Horror","desc":"<p>The Union Aerospace Corporation has been experimenting with teleportation technology on Mars' moons Phobos and Deimos. After early successes, something goes wrong. It seems the scientists have opened a gateway straight to Hell. Phobos base is overrun with demonic creatures, and the whole of Deimos simply vanishes. A squad of marines is sent to Phobos, but all except one are quickly slaughtered. It falls to the surviving marine to grab some guns and strike back at the demons.</p><p>id Software's follow-up to their genre-defining Wolfenstein 3D, <em>Doom</em> is another first-person 3D shooter: full-on action as seen from the space marine's perspective. Like Wolfenstein, the game consists of distinct episodes, playable in any order. The first episode, <em>Knee-Deep in the Dead</em>, takes place in the Phobos base and is freely available as shareware. The full game continues on Deimos in <em>The Shores of Hell</em> and culminates in <em>Inferno</em>, the final episode which takes place in Hell itself (the Sega 32x version lacks this episode).</p><p>The basic objective in each level is simply to reach the exit. Since dozens of enemies stand in the way, the only way to get there is by killing them. Switches and buttons must be pressed to advance at certain points and often color-coded locked doors will block the way - matching keycards or skull keys must be found to pass.</p><p>The game's engine technology is more advanced than Wolfenstein's, and thus the levels are more varied and complex. The engine simulates different heights (stairs and lifts appear frequently) and different lighting conditions (some rooms are pitch black, others only barely illuminated). There are outdoor areas, pools of radioactive waste that hurt the player, ceilings that come down and crush him, and unlike Wolfenstein's orthogonally aligned corridors, the walls in <em>Doom</em> can be in any angle to each other. An automap helps in navigating the levels.</p><p>Stylistically, the levels begin with a futuristic theme in the military base on Phobos and gradually change to a hellish environment, complete with satanic symbols (pentagrams, upside-down-crosses, and portraits of horned demons), hung-up mutilated corpses, and the distorted faces of the damned.</p><p><em>Doom</em> features a large weapon arsenal, with most weapons having both advantages and drawbacks. The starting weapons are the fists and a simple pistol. Also available are a shotgun (high damage, slow reload, not good at distances), a chaingun (high firing rate, but slightly inaccurate in longer bursts), and a plasma rifle (combining a high firing rate and large damage). The rocket launcher also deals out lots of damage, but the explosion causes blast damage and must be used with care in confined areas or it might prove deadly to the player as well as the enemies. Two further weapons in the game are the chainsaw for close-quarter carnage, and the BFG9000 energy gun, which while taking some practice to fire correctly, can destroy most enemies in a single burst. The different weapons use four different ammunition types (bullets, shells, rockets, and energy cells), so collecting the right type for a certain gun is important.</p><p>The game drops some of Wolfenstein's arcade-inspired aspects, so there are no extra lives or treasures to be collected for points, but many other power-ups are still available. Medpacks heal damage while armor protects from receiving it in the first place. Backpacks allow more ammunition to be carried, a computer map reveals the whole layout of the level on the automap (including any secret areas), light amplification visors illuminate dark areas and radiation suits allow travel over waste without taking damage. Also available are berserk packs (which radically increase the damage inflicted by the fists) as well as short-time invisibility and invulnerability power-ups.</p><p>The enemies to be destroyed include former humans corrupted during the invasion, plus demons in all shapes and sizes: fireball-throwing imps, floating skulls, pink-skinned demons with powerful bite attacks, and large one-eyed flying monstrosities called Cacodemons. Each episode ends with a boss battle against one or two, particularly powerful creatures.</p><p><em>Doom</em> popularized multiplayer in the genre with two different modes: Cooperative allows players to move through the single-player game together, while Deathmatch is a competitive game type where players blast at each other to collect 'frag' points for a kill and re-spawn in a random location after being killed.</p><p>The 3DO and Sega32x ports lack any multiplayer modes, though the other ports retain the DOS versions multiplayer to varying degrees. The various console ports all feature simplified levels and omit some levels, enemies, and features from the original DOS release. The SNES and Gameboy Advance versions of the game actually use different engines and hence feature numerous small gameplay differences.</p>"},{"name":"Doom Troopers: Mutant Chronicles","year":1995,"developer":"Adrenalin Entertainment","url":":Doom Troopers (USA)","filesize":1332801,"score":6.1,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Based on the popular role-playing and card game, <em>Doom Troopers: Mutant Chronicles</em> casts you as a fearless commando who has been commissioned to save the world from an invading force of mutants. </p><p>Play as either Mitch Hunter or Max Steiner as you embark on the most important mission of your life--the complete annihilation of the Dark Legion. Work your way through eight detailed levels filled with all kinds of evil and dangerous mutants, as you unload with a barrage of high-powered weapons that are readily available. If the pressure is a little too much for you to handle alone, recruit a friend and try to eliminate the Dark Legion together. The world is in grave danger and only the Doom Troopers can make things right.</p>"},{"name":"Doomsday Warrior","year":1992,"developer":"Shin-Nihon Laser Soft Co., Ltd.","url":":Doomsday Warrior (USA)","filesize":798932,"score":6.2,"genres":"Action > Side view > Arcade > Fighting > Post-apocalyptic","desc":"<p>The Doom Squad is a group of fighters under the control of an evil wizard. They threaten earth and bring destruction. One of the Doom Squad members betrays his group and becomes the Doomsday Warrior. This warrior must then defeat the other members of the Squad and finally the wizard controlling it all.</p><p><em>Doomsday Warrior</em> is a fighting game. Choosing one of the Doom Squad members to become to the Doomsday Warriors, you must defeat your opponents. Each character has the ability to punch, kick, jump and unleash a special move (usually by being close to the enemy and using either jump, kick or punch). The better the skill in fighting, the more ability points are earned. These ability points can be used to improve various areas of the fighter after battle.</p>"},{"name":"Doraemon 2: Nobita no Toys Land Daibōken","year":1993,"developer":"Sakata SAS Co., Ltd."},{"name":"Doraemon 3: Nobita to Toki no Hōgyoku","year":1994,"developer":"AIM"},{"name":"Doraemon 4: Nobita to Tsuki no Ōkoku","year":1995,"developer":"Agenda Co., Ltd."},{"name":"Doraemon: Nobita to Yōsei no Kuni","year":1993,"developer":"Sakata SAS Co., Ltd."},{"name":"Dorke & Ymp","year":2015,"developer":"Piko Interactive LLC"},{"name":"Dossun! Ganseki Battle","year":1994,"developer":"I'Max Corp."},{"name":"Double Dragon V: The Shadow Falls","year":1994,"developer":"Leland Interactive Media","url":":Double Dragon V - The Shadow Falls (USA)","filesize":1906079,"score":4.4,"genres":"Action > Side view > 2D scrolling > Fighting > Martial arts > Licensed","desc":"<p><em>Double Dragon</em> returns, this time as a VS. fighter, in the same mold as Street Fighter. It does not continue the series' storyline, but is based on the <em>Double Dragon</em> animated series, which is loosely based on the original arcade game, Jimmy and Billy and a host of other characters fight it out in a tournament fighter. </p><p>The Shadow Master, who has created a deadly virus which he plans to destroy the world with, is waiting for you at the end of the path to victory. You'll have to fight your way through many evil characters before you face the Shadow Master. Beat him, and the world is saved for another day.</p>"},{"name":"Downtown Nekketsu Baseball Monogatari","year":1993,"developer":"Technos Japan Corp."},{"name":"Dr. Mario","year":1998,"developer":"Nintendo R&D1"},{"name":"Dragon Ball Z: Hyper Dimension","year":1996,"developer":"Tose Co., Ltd.","url":":Dragon Ball Z - Hyper Dimension (Rev 1)","filesize":1890693,"score":7.7,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Licensed","desc":"<p><em>Dragon Ball Z: Hyper Dimension</em> is a fighting game based on the Dragon Ball Z series. Players select one of ten fighters: Freeza, Gotenks, Kid Buu, Majin Buu, Majin Vegeta, Perfect Cell, Piccolo, Son Goku, Ultimate Gohan and Vegetto.</p><p>Hyper Dimension includes a Story Mode, which starts in the Freeza saga and ends in the Buu saga. In this mode you have to fight one on one against several enemies.</p><p>In addition to the Story Mode, this game also contains a Versus Mode, Tournament Mode and Practice Mode.</p>"},{"name":"Dragon Ball Z: Super Butōden","year":1993,"developer":"d&d Corp."},{"name":"Dragon Ball Z: Super Butōden 2","year":1993,"developer":"d&d Corp."},{"name":"Dragon Ball Z: Super Butōden 3","year":1994,"developer":"Tose Co., Ltd."},{"name":"Dragon Ball Z: Super Gokūden - Kakusei-hen","year":1995,"developer":"d&d Corp."},{"name":"Dragon Ball Z: Super Gokuden - Totsugeki-hen","year":1995,"developer":"Tose Co., Ltd.","url":":Dragon Ball Z - Super Gokuu Den - Kakusei Hen (Rev 1)","filesize":1074120,"score":"","genres":"Action > 1st-person > Isometric > Anime / Manga > Full Motion Video (FMV) > Fighting","desc":"<p>The first of the two \"interactive fighters\" for SNES based on the famous manga series <em>Dragon Ball</em>. \"Totsugeki Hen\" tells the story of the hero, Son Goku, following the first volume of the manga. The boy Son Goku meets a mysterious girl named Bulma, and she sends him on a mission to obtain the magical Dragon Balls. Naturally, Bulma is not the only one needing those Balls, so that the young hero will soon have to face and defeat some bad guys, including his first true rival Piccolo.</p><p>The game puts you in control of Son Goku only during battles or when there is a possibility to make a choice and to influence the storyline. There is no other gameplay in the game except fighting and picking answers from menu. The fights are one-on-one: you pause them by pressing the start button, and then program Son Goku, making him execute various moves: dash, kick, special attack, etc. Every attack can be countered by an enemy attack, and you have to follow the enemy's move pattern in order to attack and defend successfully.</p>"},{"name":"Dragon Ball Z: Super Saiya Densetsu","year":1992,"developer":"Tose Co., Ltd.","url":":Dragon Ball Z - Super Saiya Densetsu (Rev 1.02)","filesize":709458,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Sci-fi / futuristic > Licensed","desc":"<p><em>Super Saiya Densetsu</em> is based on the popular manga/animé series <em>Dragon Ball</em>. It follows the events described in the beginning of Dragon Ball Z, the second story block, which tells about the connection of the hero Son Goku with a powerful alien race, and new mighty foes from far away planets. The game starts just where the tale of Dragon Ball begins. Son Goku goes to meet his friends, but is stopped by a mysterious stranger named Raditz who tells Son Goku they are relatives. Raditz demands from him to destroy humanity, and as Son Goku refuses, takes his son Son Gohan hostage. To rescue his son, Son Goku joins forces with his arch-rival, the Demon King Piccolo, who obviously has his own plans concerning Raditz. And thus begins the story during which Son Goku will learn of his true origin...</p><p>The game is a RPG similar to the card-based Dragon Ball Z RPGs for NES. During battles, you choose cards from your card inventory, which determine the nature and the strength of your characters' attacks. You can also train your characters in training houses and upgrade their special Ki power. Unlike early DBZ RPGs, you can move around freely in <em>Super Saiya Densetsu</em>, and your movements are not determined by cards. You can also fly around the world and use your special Dragon Radar to discover location of magical Dragon Balls.</p>"},{"name":"Dragon Knight 4","year":1996,"developer":"Elf Co., Ltd."},{"name":"Dragon Quest I & II","year":1993,"developer":"Chunsoft Co., Ltd.","url":":Dragon Quest I & II (Rev 2)","filesize":931369,"score":"","genres":"Compilation > Role-playing (RPG) > 1st-person > Top-down > Turn-based > Fantasy","desc":"<p>This is a remake of two first Dragon Quest titles, the second version of both Dragon Quest and Dragon Quest II, preceding the Game Boy Color compilation of Dragon Warrior I &amp; II.</p><p>This remake includes updated graphics that retain the original look, sound of higher quality, and some changes in the gameplay and in the game world: certain locations are larger, some menu commands (such as \"Stairs\") are omitted, and there is a larger variety of items.</p>"},{"name":"Dragon Quest V: Tenku no Hanayome","year":1992,"developer":"Chunsoft Co., Ltd.","url":":Dragon Quest V - Tenkuu no Hanayome (Rev 2.1)","filesize":1352742,"score":7.8,"genres":"Role-playing (RPG) > 1st-person > 3rd-person (Other) > Top-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>The hero of this game is the son of a brave warrior named Papas. It appears that his mother died just after giving birth to him, and his father took him on a long journey when he was a little baby, searching for something. Now the boy is six years old, and Papas brings him to his hometown. After some time, they learn that Henry, the prince of Reinhart, was kidnapped by bandits. Papas and his son attempt to rescue him, but this only leads to a tragic event and the boy's imprisonment. Only many years later will the hero discover who or what his father was searching for, and come to realize his own role in the events that dictate the fate of the world.</p><p><em>Dragon Quest V</em> is a Japanese-style role-playing game with random enemy encounters and turn-based combat viewed from first-person perspective. Though the party only includes three active human combatants, the game allows the player to recruit monsters into it. Some of the enemies will randomly request to join the party. The player can then add them to the roster and use them in battles, where they behave just like any other combatant, using their own abilities and even leveling up.</p><p>The game follows the story of Papas' son stretched over many years, from his childhood to adulthood. The player will be able to choose a wife for the main character from two available female characters. This decision influences some of the subsequent events and features. The hero eventually becomes a parent, and his new family plays a pivotal role in the plot.</p>"},{"name":"Dragon Quest VI: Maboroshi no Daichi","year":1995,"developer":"Heart Beat","url":":Dragon Quest VI - Maboroshi no Daichi (Rev 0.90b2)","filesize":2639967,"score":7.2,"genres":"Role-playing (RPG) > 1st-person > 3rd-person (Other) > Top-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>You and two of your friends decide to attack the Archenemy - the evil Mudo - in his castle. But as you reach his throne, he attacks you and send the three friends into three different places...</p><p>Was this just a dream? You have just fallen out of your bed dreaming! It's time to go to the village elder, to get a seemingly simple assignment - to sell some goods at a bazaar in the nearest town. But soon the hero will discover his dream was not so far away from reality...</p><p><em>Dragon Quest VI</em> is the last Super Famicom/SNES game of the <em>Dragon Quest</em> series. It is a party RPG with turn-based combat and battles viewed from first person perspective. Gameplay style, setting, and even menu layout are very similar to those of the previous games in the series. The game utilizes an enhanced \"class system\" from the third game. Characters can choose different classes to belong to, and switch between them. The more a character fights while belonging to a certain class, the more proficient he/she becomes in it. Once two or three starting classes have been mastered, the character gains access to powerful hybrid classes, which grant the characters new abilities and various upgrades.</p>"},{"name":"Dragon Slayer: The Legend of Heroes","year":1992,"developer":"Nihon Falcom Corp."},{"name":"Dragon Slayer: The Legend of Heroes II","year":1993,"developer":"Nihon Falcom Corp."},{"name":"Dragon View","year":1994,"developer":"Kotobuki System Co., Ltd.","url":":Dragon View (USA)","filesize":1285251,"score":7.2,"genres":"Role-playing (RPG) > 1st-person > Side view > 2D scrolling > Real-time > Action RPG > Direct control > Fantasy","desc":"<p>Many years ago, four brave warriors have reclaimed the magical Drakkhen tears for humanity, liberating it from the yoke of powerful dragons. Alex, a descendant of one of those heroes, enjoys a peaceful life in the town of Rysis ans is about to marry his sweetheart Katarina. However, a mysterious wizard interferes and kidnaps the young woman. Alex embarks on a quest to locate and defeat him, unraveling an even more nefarious scheme in the process.</p><p><em>Dragon View</em> is an action role-playing game and a follow-up to Drakkhen. Like its predecessor, it features a 3D overworld navigated from a first-person perspective. Towns and dungeons, however, are presented as side-scrolling areas. Alex can jump and fight enemies appearing in the dungeons with a sword or other weapons he can later acquire, such as a boomerang and a bow. Experience points are awarded for vanquishing enemies, and Alex's strength and defense parameters increase when leveling up. HP and magic points increase by finding specific items. It is also possible to find magical rings and weapon upgrades.</p>"},{"name":"Dragon Warrior III","year":1996,"developer":"Matrix Software"},{"name":"Dragon: The Bruce Lee Story","year":1993,"developer":"Virgin Interactive Entertainment (Europe) Ltd.","url":":Dragon - The Bruce Lee Story (USA)","filesize":1611403,"score":6.5,"genres":"Action > Side view > Fighting > Martial arts > Licensed","desc":"<p><em>Dragon: The Bruce Lee Story</em>  is a action/fighting game in which you play Bruce Lee, the infamous martial arts master.</p><p>As you go through the different levels, the game follows the format of the 1993 Universal movie of the same name, but is not identical to it.</p><p>As Bruce Lee, you can perform a wide variety of high-flying martial arts moves, roundhouse kicks, flying kicks, flying chops and throws. Defeat a multitude of new opponents and build up your <em>Chi</em> in order to gain special abilities and weapons.</p>"},{"name":"Dragon's Lair","year":1992,"developer":"Motivetime Ltd.","url":":Dragon's Lair (USA)","filesize":358638,"score":6.6,"genres":"Action > Side view > Platform > Fantasy > Licensed","desc":"<p>This version of Dragon's Lair is a departure from the earlier arcade titles of the same name. Instead of recreating the original arcade experience, the game now focuses on action/platforming elements, not dissimilar to Konami's Castlevania games. </p><p>The story begins with our hero, Dirk the Daring, on a quest to rescue the Princess Daphne from the evil dragon, Singe. However, before he can rescue the princess, he must first overcome 24 levels filled with enemies and obstacles. Fortunately, Dirk has both his trusty sword and the ability to used ranged weapons (axes, knives, &amp; shuriken) at his disposal. </p>"},{"name":"Drakkhen","year":1991,"developer":"Infogrames Europe SA","url":":Drakkhen (USA)","filesize":637824,"score":6.9,"genres":"Role-playing (RPG) > 1st-person > Side view > Fixed / flip-screen > Real-time > Fantasy","desc":"<p>The prophecy has been fulfilled. The world shall be ruled by the dragons. On an island far away, their lords prepare for the conquest of the lands. There is only one hope for mankind. The emperor sends out four heroes -- warriors and magicians -- to solve the puzzle of tears and prevent the invasion of the Drakkhen.</p><p><em>Drakkhen</em> is a role-playing game with a visual presentation that combines 3D landscapes and 2D interiors. The player's party will travel overland on a flat terrain made up of vectors, on which 2D objects are zoomed (The same type of engine was later used in Eternam). The player will encounter monsters and fight them in real-time combat, and discover the palaces of the dragon lords. Indoors, the player has to find a way through the maze of chambers, solving puzzles and defeating the minions of the Drakkhen. Party members are depicted in four status windows on the left side of the screen, thus allowing to see their current status and equipment at once.</p>"},{"name":"Dream TV","year":1992,"developer":"Rollogame Ltd.","url":":Dream T.V. (USA)","filesize":358360,"score":"","genres":"Action > Side view > Platform > Fantasy","desc":"<p>A mystical television has challenged 2 kids to complete quests on various worlds. The first world is the Medieval World, land of castles, dungeons, undead skeleton warriors, malicious knights, and lots of keys and doors. The goal is to collect a number of puzzle pieces and get out of the world. Other world themes include Egyptian, Prehistoric, and Futuristic.</p><p>Dream TV is a 2-player action/adventure game with only a single player. The player must alternately control both kids throughout the game. The player can either adopt a split-screen view showing both kids, or a fullscreen view that focuses on one kid. The game includes challenges that require the player to use both kids simultaneously, such as a see-saw where both kids need to bounce on either end in order to propel one up onto a higher platform.</p>"},{"name":"Dual Orb II","year":1994,"developer":"Prism Kikaku Ltd."},{"name":"Dual Orb: Seireiju Densetsu","year":1993,"developer":"Prism Kikaku Ltd."},{"name":"Duel, The: Test Drive II","year":1992,"developer":"Distinctive Software, Inc."},{"name":"Dungeon Master","year":1991,"developer":"FTL Games","url":":Dungeon Master (USA)","filesize":648778,"score":7.8,"genres":"Role-playing (RPG) > 1st-person > Real-time > Puzzle elements > Fantasy","desc":"<p><em>Dungeon Master</em> is a role-playing game where the player selects four adventurers and descend into the depths of the dungeon. The gameplay is reminiscent of the 3D dungeon crawl type of role-playing games popularized by Wizardry and The Bard's Tale. However, unlike these games, <em>Dungeon Master</em> features real-time combat, which requires the player to click on the opponent in order to execute an attack. Another notable aspect of the game is its growth system: instead of gathering experience points and leveling up, characters improve by repeatedly using the same action. Spellcasting involves selecting and combining symbols, which can be arranged as rune sequences. The game also allows the player to directly interact with objects in the game world through a point-and-click interface.</p>"}]