[{"name":"E.V.O.: Search for Eden","year":1992,"developer":"Almanic Corp.","url":":E.V.O. - Search for Eden (USA)","filesize":1210712,"score":7.1,"genres":"Action > Side view > 2D scrolling > Action RPG > Fantasy","desc":"<p>The storyline of <em>E.V.O.: Search for Eden</em> follows the same patterns as modern Evolution theories. The players first controls a prehistoric sea organism, and fights to gain evolution points with which he can improve his fish's body parts and upgrade his attack/defense abilities. The gameplay is not completely linear, which means that certain choices of paths and stages will affect the player's success.</p><p>The game is composed of a series of stages, in which the sea organism slowly evolves into an amphibian, and later a land-only creature. The physical changes are fairly scientifically accurate which gives the game a semi-educational purpose as well.</p><p><em>E.V.O.: Search for Eden</em> is based on the Japan-only computer game  46 Okunen Monogatari: The Shinkaron. While the basic premise of the game is the same, there are significant changes in gameplay and the layout of the game world.</p><p>In the computer release, the battles against other creatures were turn-based; here, the combat is real time, which effectively turns this version into an action RPG. The stages, while retaining similar themes, have a completely different layout. Side-scrolling view prevails over the original's top-down perspective. There are also boss battles that were absent in the original version.</p><p>Character building (\"evolution\") is also different. Instead of distributing evolution points into four parameters, the player now basically \"buys\" upgrades, which have a fixed \"price\". The player is able to acquire such upgrades for the creature's body parts (jaws, neck, body, etc.), raising their parameters and becoming stronger.</p><p>Story elements, friendly characters (NPCs), and quest-based structure that characterized the original game have been reduced and/or omitted in this release.</p>"},{"name":"Earth Defense Force","year":1991,"developer":"Jaleco Ltd.","url":":Earth Defense Force (USA)","filesize":556434,"score":6.3,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>An evil organization, named AGYMA, threatens the 200 years of peace the galaxy has enjoyed.  From their base on the far side of the moon they have infiltrated many important locations on Earth.  Working for the Earth Defense Force, you are the lone pilot of a special craft designed to fight off AGYMA: the XA-1.</p><p>The game is a side-scrolling shoot 'em up with 6 levels, and a total of 8 state of the art weapons with which to fend off the attacks and thwart AGYMA's plot to destroy Earth and disrupt peace throughout the cosmos.</p>"},{"name":"EarthBound","year":1994,"developer":"HAL Laboratory, Inc.","url":":EarthBound (USA)","filesize":2065313,"score":8.5,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Sci-fi / futuristic > Comedy > Regional differences","desc":"<p>In the year 199X, in the village of Onett, on the continent of Eagleland...</p><p>Young Ness was asleep one night when a loud crashing noise awoke him suddenly. As he rushes out of bed and up to a nearby hill, he encounters a strange meteor, carrying a single passenger: a mysterious insect-like being named Buzz Buzz. Buzz Buzz tells him that in the future, an evil alien being known as Giygas has conquered the world, and the only ones who can stop him are four young kids: three boys and a girl. Ness, of course, is one of the chosen ones, and he must find the other three children: Paula, a young girl with remarkable psychic powers, Jeff, a mechanical genius, and Poo, the young Prince of Dahlaam. Together, these four friends have the power to defeat Giygas and save the world from his chaotic reign!</p><p><em>EarthBound</em> is a sequel to Mother. It is a top-down role-playing game in which the heroes travel around Eagleland and various other, exotic countries, trying to end Giygas' evil influence. </p><p>On the way, Ness and his friends will encounter a lot of enemies and battle them in turn-based combat. Unlike in the previous game, enemies are visibly walking on the screen. Each turn, each of the characters in the party can attack with their weapons, use a special ability (some characters have powerful psychic powers that can hurt enemies, heal comrades, and more; some also have some other, unique special powers), use an item or try and escape. </p><p>The game features \"rolling HP meters\" - when a character is dealt damage, it's not all taken away from his HP right away, but instead his HP decreases slowly; if the combat is ended quickly, even a massively damaging attack can leave a character with only minor injuries. By winning battles, characters receive experience and thus become stronger. If the player-controlled characters are strong enough, weak enemies will escape from them instead of trying to attack; when chased down, they will be defeated instantly.</p><p>Saving the game is done by finding a telephone and calling Ness' father. When the heroes defeat enemies, Ness' bank account receives money, which can be then retrieved from ATM machines throughout the game and spent in shops to buy better equipment or useful items.</p>"},{"name":"Earthworm Jim","year":1994,"developer":"Shiny Entertainment, Inc.","url":":Earthworm Jim (USA)","filesize":1969225,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Comedy","desc":"<p>A crow is chasing a worm named Jim, while in outer space Psy-Crow is chasing a renegade ship. The ship's captain has stolen an ultra-high-tech-indestructible-super-space-cyber-suit and Queen Slug-for-a-Butt has ordered Psy-Crow to get it, since it can make her more beautiful than Princess-What's-Her-Name. Psy-Crow blasts the captain and the suit falls to Planet Earth.</p><p>Back on Earth, Jim wonders if he is finally safe when an ultra-high-tech-indestructible-super-space-cyber-suit lands on him. Luckily Jim rests in the neck ring of the suit. The space particles then begin interacting with Jim, causing a light-speed evolution. Jim soon realizes he is in control of the suit.</p><p>Jim overhears the Queen's plans for the suit and decides to meet this Princess...</p><p><em>Earthworm Jim</em> is a 2D side-scrolling platformer with action elements where the player takes control of Jim, a worm wearing a spacesuit. Jim can shoot enemies with his gun or use his body (the spacesuit's \"head\") in a variety of ways to overcome obstacles, such as whipping it at enemies, grappling hooks to swing from them, or making it spin very fast like a rotor to hover for a short time.</p><p>While most of the game is made of standard platforming levels with a boss waiting at the end, some of the levels introduce different conditions than just reaching the end to complete them, like escorting a computer-controlled character and making sure they don't get hurt. Platforming levels are interspersed with some variations in gameplay as well, such as several space racing sequences or a bungie-jumping competition.</p>"},{"name":"Earthworm Jim 2","year":1995,"developer":"Shiny Entertainment, Inc.","url":":Earthworm Jim 2 (USA)","filesize":2177040,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Comedy","desc":"<p>An ordinary average earthworm named Jim goes about his normal daily life, cruising around avoiding crows and doing other general worm-like things. Until one day, Jim is suddenly struck by a very large Ultra-high-tech-indestructible-super-space-cyber-suit. Through sheer luck, Jim rests safely in the neck ring of the suit. Suddenly, the ultra-high-tech space particles of the suit begin interacting with Jim's soft wormy flesh. A radical light-speed evolution takes place. Jim soon realizes that he is now in control of the suit.</p><p><em>Earthworm Jim 2</em>'s gameplay is similar to the first game, with Jim running and jumping through the levels. There are five weapons more than in the original game to collect. Characters like Princess What's-Her-Name and Psy-Crow also appear.</p>"},{"name":"Edo no Kiba","year":1993,"developer":"Riot"},{"name":"Eek! the Cat","year":1994,"developer":"CTA Developments","url":":Eek! the Cat (USA)","filesize":839346,"score":6,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Platform game based on the cartoon series Eek the Cat.  Eek must help his friends through 6 huge levels of hazards. This platformer has a novel approach that the player (Eek) can take as much damage as possible, but must keep his protectee safe from harm using various skills. Situations reflect the cartoon. For example, his master the granny is out sleepwalking in the zoo and he must prevent the animals waking her up. In the second level, his girlfriend has been abducted by aliens and he must help her get to the end of the level so the aliens can use her as a battery safely.</p>"},{"name":"Elite Soccer","year":1994,"developer":"Denton Designs","url":":Elite Soccer (USA)","filesize":681593,"score":7.5,"genres":"Simulation > Sports > 3rd-person (Other) > Top-down > Football (European) / Soccer > Licensed","desc":"<p><em>Elite Soccer</em> lets the player choose from 24 National teams including the U.S., England, France, Brazil among others, in a chance to play in the World Cup tournament and win the coveted trophy. Players can also choose to play in a Knockout-style tournament where instead of a round robin type of play like in World Cup, they instead play one game and advance to the next like a regular tournament. There is also a two-player mode that allows friends to compete head-to-head.</p><p>The main gameplay is the same as others with an overhead view with a third-person perspective for penalty kicks. The rules and regulations are up to date and can actually be changed to suit the players style of choice. They can also choose weather conditions, skills of goalies or even the choice to play either indoors or outdoors. Players can also edit their players including appearance and stats wise to suit their liking.</p>"},{"name":"Emerald Dragon","year":1995,"developer":"Glodia"},{"name":"Emit: Value Pack","year":1995,"developer":"KOEI Co., Ltd."},{"name":"Emit: Vol. 1 - Toki no Maigo","year":1995,"developer":"KOEI Co., Ltd."},{"name":"Emit: Vol. 2 - Inochigake no Tabi","year":1995,"developer":"KOEI Co., Ltd."},{"name":"Emit: Vol. 3 - Watashi ni Sayonara o","year":1995,"developer":"KOEI Co., Ltd."},{"name":"Emmitt Smith Football","year":1995,"developer":"NCM Entertainment","url":":Emmitt Smith Football (USA)","filesize":632795,"score":"","genres":"Sports > 3rd-person (Other) > Top-down > Football (American) > Licensed","desc":"<p>A generic football game, among the many back in the day, <em>Emmitt Smith Football</em> has the standard <em>Exhibition</em> and <em>Season</em> modes along with multiple camera angles. It also features a 360 degree TV-style instant replay for bone-crunching and ground-breaking plays that are performed.</p><p>The one thing that sets it apart from others is the ability to create and save (using battery back-up) 64 unique plays that can be accessed at any time during a game along with the standard pre-set plays. While it does not have NFL or NFLPA licenses, it does feature then former Dallas Cowboys running back star Emmitt Smith, who is also on the front cover of the box.</p>"},{"name":"Energy Breaker","year":1996,"developer":"Neverland Co., Ltd."},{"name":"Equinox","year":1993,"developer":"Software Creations Ltd.","url":":Equinox (USA)","filesize":638695,"score":7.8,"genres":"Action > Diagonal-down > Isometric > Platform > Puzzle elements > Fantasy","desc":"<p><em>Equinox</em> is the sequel to Solstice. It is presented in a 3D isometric view with colourful graphics. The game is based upon solving puzzles to progress to the next dungeon. In the game you play the son of the hero in the first game, Shadax. Shadax has been kidnapped by an evil witch and it is up to you to rescue him. </p><p>There is a wide range of weapons and powerful magic spells you can use throughout your quest, some of which are required to solve puzzles. In the game you can travel on the above-ground map as well as the underworld, although all the action except for some battles will still happen underground. Basic gameplay concept is reminiscent of Zelda games: you must search for keys, blasting or avoiding monsters, solving physical puzzles on your way to the meeting with an end-level guardian whom you must defeat to progress.</p>"},{"name":"ESPN Baseball Tonight","year":1994,"developer":"Stormfront Studios","url":":ESPN Baseball Tonight (USA)","filesize":1027470,"score":6.2,"genres":"Sports > Behind view > Baseball > Licensed","desc":"<p><em>ESPN Baseball Tonight</em> is a baseball game with both exhibition and playoff modes. Other modes included are both practice (both pitching and batting) and Home Run Derby modes. The game contains 28 real MLB teams but no actual players. Gameplay options include being able to turn errors on or off and to have assisted fielding on or off.</p><p>Gameplay has the behind the batter viewpoint, whether pitching or batting. One thing to note when fielding, the player must manually throw the ball back to the pitcher for the game to continue.</p><p>The Sega CD version is an update which includes the option for an 162 game season and has over 10 minutes of video highlights.</p>"},{"name":"ESPN National Hockey Night","year":1994,"developer":"Park Place Productions","url":":ESPN National Hockey Night (USA)","filesize":1044121,"score":6.2,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p><em>ESPN National Hockey Night</em> was one of the many hockey games released back in the day. This one featured all the NHL teams for its time, but lacked an official players license.</p><p>It had four game modes to choose from: <em>Exhibition</em>, <em>Challenge</em>, <em>Playoff</em>, and <em>Season</em>. The game also features both a horizontal and vertical perspective of the ice, battery backup to save progress and also featured the voice of Bill Clement for play-by-play commentary.</p>"},{"name":"ESPN Speed World","year":1994,"developer":"Park Place Productions","url":":ESPN Speedworld (USA)","filesize":1125060,"score":5.6,"genres":"Racing / Driving > Simulation > Behind view > Automobile > Licensed","desc":"<p><em>ESPN Speed World</em> is a generic racing game that is made to resemble NASCAR. The player is given a stock car and can tune the car from the angle of the spoiler, to the setting of the shocks, and up to the pressure of the tires.</p><p>There are three different types of speedways to race on: <em>Super Speedway</em>, <em>Short Track</em> and <em>Road Courses</em> with 5 different tracks for each to choose from. Players can choose to race against the computer that has all 23 other stock cars on the track at once or play head-to-head on a split screen against a friend.</p><p>It also featured realistic driving physics. While it didn't have a NASCAR license, it did have ESPN which broadcasted the races and had NASCAR analyst, Dr. Jerry Punch, who lent his voice to the game for the color commentary.</p>"},{"name":"ESPN Sunday Night NFL","year":1994,"developer":"Ringler Studios","url":":ESPN Sunday Night NFL (USA)","filesize":999130,"score":5.9,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p><em>ESPN Sunday Night NFL</em> was one of the many football games released back in the day. It features all 28 official NFL teams and their respective logos, but doesn't feature a license from the NFLPA, so there are no actual players names in the game.</p><p>There are four different game modes to choose from: <em>Playoffs</em>, <em>Single Game</em>, <em>Season</em> and another season mode that lets the player act out the 1994 NFL season schedule. It also had variable weather conditions that the players on the field would react to and a battery back-up to save games. It also featured Chris Berman, who not only graced the front cover but also gives commentary as well.</p>"},{"name":"Excitebike: BunBun Mario Battle Stadium","year":1997,"developer":"Nintendo EAD"},{"name":"Extra Innings","year":1991,"developer":"Sting, Inc.","url":":Extra Innings (USA)","filesize":515250,"score":"","genres":"Sports > 3rd-person (Other) > Anime / Manga > Baseball","desc":"<p>This is a baseball game featuring 12 fictional teams, plus the player can also create 2 custom teams. Game modes include an Exhibition mode, an All Star game, a Pennant Race, and a Watch mode.</p><p>While Exhibition mode can be either a one or two player affair, the All Star game is strictly for two players to compete in. When playing, batting and pitching are both done from a behind the batter viewpoint.</p><p>The pennant race involves 6 teams playing each other throughout a season consisting of a number of games chosen by the player.</p><p>Watch mode lets the player watch two computer controlled teams play each other.</p><p>Options include either having automatic or manual fielding, having errors and/or wind on or off, and being able to either skip or watch opponents pennant games. There is also the Cold Game option, which lets a baseball game end when a team is winning by the  chosen amount of runs.</p>"},{"name":"Eye of the Beholder","year":1994,"developer":"Westwood Associates","url":":Eye of the Beholder (USA)","filesize":589989,"score":7.6,"genres":"Role-playing (RPG) > 1st-person > Real-time > Puzzle elements > Point and select > Fantasy > Licensed","desc":"<p>Something evil is lurking below the city of Waterdeep. The Lords of Waterdeep summon a group of heroes to investigate, but someone or something has been watching the proceedings. After the heroes enter the sewers, the ceiling collapses behind them. The only way out is the way down, into a dungeon filled with monsters, traps and puzzles.</p><p><em>Eye of the Beholder</em> is a dungeon crawler RPG with a first-person perspective based on the 2nd Edition AD&amp;D rules. The starting party consists of four characters and up to two NPCs can join later. Combat and magic happen in real time, similarly to Dungeon Master. There is a variety of monsters to fight and spells to cast. The game features a point-and-click interface for fighting, spellcasting and handling objects.</p>"}]