[{"name":"F-1 Grand Prix","year":1992,"developer":"Video System Co., Ltd."},{"name":"F-1 Grand Prix Part II","year":1993,"developer":"Video System Co., Ltd."},{"name":"F-1 Grand Prix Part III","year":1994,"developer":"Video System Co., Ltd."},{"name":"F-Zero","year":1990,"developer":"Nintendo Co., Ltd.","url":":F-Zero (USA)","filesize":290796,"score":7.9,"genres":"Racing / Driving > Behind view > Hovercraft > Track racing > Sci-fi / futuristic","desc":"<p><em>F-Zero</em> is a futuristic racing game, set in the year 2560. The player chooses one of the four available hovercars and then can race with other hovercars in one of the gameplay modes - \"Practice\" or \"Grand Prix\". </p><p>In \"Practice\" mode, the player chooses one track where he competes with one other hovercar to win the race (or there can be no rival at all, if you so wish). In \"Grand Prix\", the player must complete a series of races with several competitors. Each race consists of five laps. </p><p>The hovercar has a limited Power meter, which represents the machine's health and decreases when the hovercar collides with the track boundaries and other players. If power runs out, the hovercar explodes and the player loses the race. There are repair areas near the start line, which restore power to the player's hovercar if he drives into them. The tracks contain many more or less dangerous traps, such as icefields or landmines. </p><p>Completing a lap awards the player a \"Super Jet\" which can be activated at any time to give a short speed boost. The hovercar can keep up to three Super Jets and use them when necessary. </p><p>Completing a lap also gives points, which give the player a life when enough are accumulated. The player can lose a life in the Grand Prix mode if his hovercar explodes, if his hovercar somehow falls out of the track or if he ends up too far behind the other racers.</p>"},{"name":"F1 Pole Position","year":1992,"developer":"Human Entertainment, Inc.","url":":F1 Pole Position (USA)","filesize":582729,"score":7.7,"genres":"Racing / Driving > Simulation > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>This Formula 1 racing game features 3 game modes and 16 tracks to race on. The game modes included are Battle, World Grand Prix, and Test Run.</p><p>Battle mode allows for an exhibition race where the player can choose any course and its condition plus how many laps the race will be. The player can also choose to race up to 13 other opposing racers,</p><p>World Grand Prix mode lets the player compete in a season of F1 races. The higher a position a racer finishes in a race, the more points will be awarded to increase their place in the total season standings.</p><p>Test Run lets the player practice any track without the interference of other racers,</p><p>Players can fine-tune their car using a variety of settings. Settings include adjusting the steering, tires, gears, brakes, wings, and the suspension. Players can also choose the type of pit work, tachometer (digital or analog), and whether to have either manual or automatic gear shifting.</p>"},{"name":"F1 Pole Position 2","year":1993,"developer":"Human Entertainment, Inc."},{"name":"F1 ROC: Race of Champions","year":1992,"developer":"SETA Corporation","url":":F1 ROC - Race of Champions (USA)","filesize":525080,"score":7.2,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Oceania","desc":"<p>In F1ROC you drive in race car and compete in a series of sixteen races on tracks from around the world. You will earn money for each race depending on how you placed (for instance, first place nets you $7000) which you can use to purchase upgrades for your car. You need to find a good balance between the parts. To test the effectiveness of your parts you can run a test race to see how the car works before you buy. Data can be saved on the cartridge so you will not lose your parts or your race statistics. The goal is simply to complete all sixteen tracks; you will get a bonus at the end depending on how well you do so there is an incentive to play again and do better.</p>"},{"name":"F1-ROC II: Race of Champions","year":1993,"developer":"SETA Corporation","url":":F1-ROC II - Race of Champions (USA)","filesize":714008,"score":7.4,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Licensed","desc":"<p><em>F1ROC II: Race of Champions</em> is the follow-up sequel to F1ROC: Race of Champions where the player can race to become a legend in Formula One racing, but first must have to go through three different tiers of racing in order to do so.</p><p>The player starts out in \"Group C\" in the lowest tier with less powerful cars and novice drivers. After winning the eight races of \"Group C\", the player is then transferred to F-3000 with more advance drivers and powerful cars. The player must win another eight tracks in this division to advance to the final division, the F-1 Grand Prix itself, with the most advanced cars and the most talented drivers and to win this series the player must compete in 16 tracks. If the player does well enough, they can return to the Grand Prix division the following year with the ability to choose a new car and sponsor.</p><p>The main gameplay is a basic racing game, but does not involve oval tracks such as NASCAR, but twisting and turning tracks where the player must use caution when turning on winding roads. Players can also qualify before races for a better starting spot and must make pit stops during races to replace fuel, tires and repair damage. The player can also win prize money for doing well in races to buy better parts and upgrades for their car to race better in future races. They must be careful, however, when combining parts to try and make a perfect handling car. If the player uses the wrong combination, they can have a car that handles well in turns, but is slow on long straightaways. Likewise, they can also become to fast and dangerous in turns, causing disastrous accidents.</p><p>It features a battery back-up to save games and stats and also features authentic Formula One cars such as the FW14B Williams, the McLaren MP4, the Benettion B192, the F92 Ferrari among many others and also has the entire 1992 F-1 racing season.</p>"},{"name":"F1: World Championship Edition","year":1995,"developer":"Peakstar Software"},{"name":"Faceball 2000","year":1992,"developer":"Xanth Software F/X, Inc."},{"name":"Famicom Bunko: Hajimari no Mori","year":1999,"developer":"Nintendo R&D1"},{"name":"Famicom Tantei Club Part II: Ushiro ni Tatsu Shōjo","year":1998,"developer":"Nintendo R&D1"},{"name":"Family Dog","year":1993,"developer":"Absolute Entertainment, Inc.","url":":Family Dog (USA)","filesize":335110,"score":5.3,"genres":"Action > Side view > Arcade > Licensed","desc":"<p>Based on a short-lived animated prime-time television series created by Steven Spielberg and Tim Burton, you play as the title dog through three levels. The young boy in your family likes to target you for his mischief.  He sets up volleys of tennis balls and lets loose a vacuum cleaner on you which you must avoid.  The cat and other obstacles await you in your house while you collect bones for power.   </p><p>After all the trouble you cause in the home, you are sent to the Kennel of Love and you have to run a gauntlet of gung-ho guard dogs and ferocious Dobermans in the heavily-guarded compound.  If successful at escaping, you reach a forest filled with wild animals.</p><p>You can use flips, spins and barks to make your way through the various obstacles.  A special ball when found will trigger a bonus game that will also teach you how to fetch.</p>"},{"name":"Family Feud","year":1993,"developer":"Imagineering Inc.","url":":Family Feud (USA)(Rev 1)","filesize":330811,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Turn-based > Game show / trivia / quiz > Licensed","desc":"<p>This version differs from others, with over 4,000 survey questions. The rules conforms to the shows, divided into rounds until a family reaches 300 points and the \"Three Strikes\" rule.  It also featured the new \"Bulls Eye Round\" that was introduced to the show at the time.</p><p>To answer questions, the player uses the D-pad to move a cursor and pressing the required button in order to select that letter and spell out their answer.  Players can also battle each other as well as customize their family to their liking, from their appearance, hobbies, intelligence and occupations and customize the rules to suit the player.</p>"},{"name":"Fantastic Journey","year":1994,"developer":"Konami Co., Ltd."},{"name":"Farland Story","year":1995,"developer":"Technical Group Laboratory, Inc."},{"name":"Farland Story 2","year":1995,"developer":"Technical Group Laboratory, Inc."},{"name":"Fatal Fury","year":1992,"developer":"SNK Corporation","url":":Fatal Fury (USA)","filesize":1118582,"score":6.9,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p>Southtown City plays host to the King of Fighters Tournament. Andy &amp; Terry Bogard take part in the tournament cause winning the tournament is the only way they can defeat Geese Howard. Geese Howard controls Southtown City and killed their father several years ago. Also taking part is Joe Higashi, a Japanese kickboxer. Select either Joe, Andy or Terry, visit several locations in Southtown City and win that tournament!  </p><p><em>Fatal Fury</em> is a 2D fighter and is the first game in a series of one-on-one fighting games by SNK. It's a conversion of the original <em>Fatal Fury</em> arcade game. This first game does not yet feature the series' trademark pseudo 3D mode (which allows you to move between the foreground &amp; background while fighting). Includes a two-player vs. mode.</p>"},{"name":"Fatal Fury 2","year":1993,"developer":"SNK Corporation","url":":Fatal Fury 2 (USA)","filesize":1998730,"score":7.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Martial arts","desc":"<p>Again, the Lone Wolves return! </p><p>Geese Howard may have been defeated, but that doesn't mean all is peaceful. A new opponent, Wolfgang Krauser, has come forth to begin a new Fatal Fury tournament. The Lone Wolves return, with new faces amongst them. Only one can be declared the winner though. </p><p>The player can choose one from eight playable characters: Terry Bogard, Andy Bogard, Joe Higashi, Big Bear, Jubei Yamada, Cheng Sinzan, Kim Kaphwan, and Mai Shiranui. The game has four bosses. The combat system is more complex than in the first game, supporting four keys to attack. The two-plane (foreground and background) battle system has been retained, but now, the player can move freely to the adjacent plane - just by pressing the Light Punch and Light Kick buttons simultaneously. The main principle remains the same - beat your opponent in a duel with fists and kicks.</p>"},{"name":"Fatal Fury Special","year":1994,"developer":"SNK Corporation","url":":Fatal Fury Special (USA)","filesize":3053664,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting","desc":"<p><em>Fatal Fury Special</em> is an improved version of <strong>SNK</strong>'s 2D one-on-one fighter Fatal Fury 2. The objective is to win the tournament by defeating all other fighters including end boss Wolfgang Krauser. <em>Fatal Fury Special</em> features a fairly large selection of fighters that includes:<em> The eight regular fighters from Fatal Fury 2: Terry Bogard, Andy Bogard, Joe Higashi, Kim Kaphwan, Jubei Yamada, Cheng Sinzan, Mai Shiranui and Big Bear.</em> The four bosses from Fatal Fury 2: Billy Kane, Axel Hawk, Lawrence Blood and Wolfgang Krauser (this time they're all immediately playable).* Three characters returning from the first Fatal Fury: Duck King, Tung Fu Rue and Geese Howard (the end boss from Fatal Fury).</p><p>Other improvements include:<em> A new Count Down mode (defeat as many opponents as possible in 3 minutes).</em> Extra color schemes for every character.<em> New &amp; improved background graphics.</em> Dolby Surround Sound support.</p><p><em>Fatal Fury Special</em> still features the series' trademark pseudo-3D movement along two planes.</p>"},{"name":"FEDA: The Emblem of Justice","year":1994,"developer":"Max Entertainment"},{"name":"FIFA International Soccer","year":1994,"developer":"Extended Play Productions","url":":FIFA International Soccer (USA)","filesize":647267,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Isometric > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>The game that started the best-selling series licensed by football's world governing body, this first installment in the long running series used a dimetric (colloquially known as \"isometric\") viewpoint, previously unusual in football games but quickly imitated by several titles. The televisual presentation, one of the unique points of the early EA Sports titles, with hosts introducing the matches, was another thing making the game stand out from a market dominated by <em>Sensible Soccer</em> and <em>Kick Off</em> games.</p><p>Based on international teams (with fictional player names), their abilities in each skill area rated out of 10 to give the player an overall impression of how good they are. The options available follow the standard set: fouls and offsides can be toggled on and off, the match length can be set, and if the timer operates continuously, or only while the ball is in play. Gameplay privileges quick runs, short passes and blistering shots outside the penalty box, and set pieces are controlled by moving a box into the target area for the ball, and then passed, lobbed or kicked directly. On the tactical side, formations can be selected, with 5 different strategies also available (although not all of these combinations make sense) as can the team Coverage - the areas which defenders, midfielders and strikers cover.</p>"},{"name":"FIFA Soccer 96","year":1995,"developer":"Extended Play Productions","url":":FIFA Soccer '96 (USA)","filesize":912525,"score":7.6,"genres":"Simulation > Sports > Diagonal-down > 2D scrolling > Isometric > Managerial / business simulation > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p><em>FIFA Soccer 96</em> is a football (soccer) simulation. The game includes eleven leagues from all around the world, ranging from the unknown players of the Malaysian league to the celebrated stars of the English and Italian leagues. 59 International teams are also featured, and it's possible to match the teams you want to against each other through friendlies, or you can also choose to play domestic tournaments or International ones such as the World Cup. If you're not satisfied with the composition of the various teams, you can create your own dream team through the custom team creator.</p><p>British commentator John Motson comments all the incidents and happenings on the pitch in real-time. The ambient commentary is varied, and systems with more than the minimum memory level get extra commentary phrases. The Virtual Stadium technology has numerous pre-defined camera angles.</p>"},{"name":"FIFA Soccer 97","year":1996,"developer":"XYZ Productions","url":":FIFA Soccer '97 (USA)","filesize":1125910,"score":7.3,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>This iteration of the <em>FIFA</em> lineage includes commentary from John Motson with summaries from Andy Gray, with the between-match sections covered by Des Lynam. All player moves are from David Ginola using the MotionBlending technology. Full interactive replays are included.</p><p>You can play a league or cup tournament, and practice your skills before playing. The game can be tailored to action or simulation style, with fouls, injuries and offsides available to toggle on or off. This version also includes a 6 vs 6 indoor play mode, and various multiplayer options</p>"},{"name":"FIFA: Road to World Cup 98","year":1997,"developer":"Electronic Arts Canada"},{"name":"Fighter's History","year":1994,"developer":"Data East Corporation","url":":Fighter's History (USA)(Rev 1)","filesize":1852727,"score":6.3,"genres":"Action > Side view > Fighting","desc":"<p><em>Fighter's History</em> is a traditional 2D fighter along the lines of the Street Fighter series. The player can choose between 9 different characters to play as: Ray, Feilin, Ryoko, Matlok, Samchay, Lee, Mizoguchi, Jean and Marstorius. Two hidden characters, Clown and Karnov, the bosses of the game, are also playable. Each of the fighters have a number of unique moves, once again, fashioned in the image of Street Fighter II.</p><p>There are three different gameplay modes are available. CPU Battle is the traditional arcade mode, where the player select a character and try to complete the game by beating all of the other fighters. In survival mode, the player select a team of five characters to go up against another team. And finally versus mode, where the player can go up against his friends.</p>"},{"name":"Final Fantasy II","year":1991,"developer":"Square Co., Ltd.","url":":Final Fantasy II (USA) (Rev 1)","filesize":674070,"score":7.6,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Real-time > Turn-based > Japanese-style RPG (JRPG) > Direct control > Menu structures > Fantasy","desc":"<p>The military country of Baron is one of the strongest in the land, with a proud army and a majestic air force known as the Red Wings. However, the recent actions of the king make even the most loyal of his subordinates doubt his judgment. The captain of the Red Wings, Cecil, is ordered to attack the city of Mysidia and take the Water Crystal from innocent magicians who protect it. When Cecil questions the king's orders, he is immediately thrown out of the country and sent off to deliver a package to the village of Mist, accompanied by his best friend Kain, the captain of the dragoons. Little does he realize that the king's inexplicable behavior is but a part of a much larger picture, which he is yet to reveal.</p><p>The fourth entry in the <em>Final Fantasy</em> series was released as <em>Final Fantasy II</em> in the West, because the second and the third games were not released there at the time. The game is a Japanese-style RPG with top-down world map navigation, automatic leveling up, and random enemy encounters.</p><p>The game introduces a system called ATB (active-time battle). While combat is turn-based in its core, the game does not pause when the player accesses the battle menu. Enemies continue to act in real time regardless of the actions of the player-controlled party. The turns of the participants are calculated depending on their agility rating. Each player-controlled character has a special bar that gradually refills itself; said character may act when the bar is full.</p><p>Unlike all the previous <em>Final Fantasy</em> games, the fourth installment does not allow the player to customize the characters' abilities and classes. Each character belongs to a specific, clearly defined class: dragoon, white mage, black mage, summoner, ninja, etc. Each of these classes has distinct special abilities or magic spells. New abilities are learned automatically when a character reaches a pre-determined level. Characters join and leave the party as dictated by the game's plot events. The active party includes up to five combatants.</p><p>The PlayStation version adds a new rendered intro and ending.</p>"},{"name":"Final Fantasy III","year":1994,"developer":"Square Co., Ltd.","url":":Final Fantasy III (USA) (Rev 1)","filesize":2247457,"score":8.3,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Anime / Manga > Real-time > Turn-based > Japanese-style RPG (JRPG) > Direct control > Menu structures > Fantasy > Sci-fi / futuristic > Steampunk > Regional differences","desc":"<p>A thousand years ago, the War of the Magi occurred. People remember it as one of the most horrible tragedies in history. Since the War of the Magi, magic has been all but forgotten, technology began to grow, and people returned to seemingly normal lives. The only true worry people have is the Empire, whose leaders are looking to revive the great force once known as \"magic\". </p><p>The Empire had heard word of the remains of a mystical being, known as \"Esper\", being found in the mining town of Narshe. Quickly, three soldiers were dispatched to find this Esper and bring it to the Emperor. One of the soldiers, a young girl, triggers a power in the Esper that initiates a dangerous series of events. The only ones who can help her are a rag-tag band of rebels and heroes, who offer their very hearts and souls to save the world from the mad plans of the Empire.</p><p>The sixth entry in the <em>Final Fantasy</em> series was dubbed <em>Final Fantasy III</em> in the West because three out of the five previous installments of the series had not been released there at the time. Similar to its predecessors, this is a role-playing game where the player controls a party of characters, traveling between various locales in the world, fighting randomly appearing regular enemies and bosses, and making the characters stronger by improving their skills and getting better equipment for them. The game maintains the ATB (active time battle) system of the two previous installments in the series, spicing traditional turn-based combat engine with a real-time element. </p><p>In battle, every character can fight using weaponry and items, and each has a special combat skill as well. It is also possible for nearly every character to learn magic spells. By finding various Espers and equipping them on characters, the player can improve their parameters in different ways and choose the magic spells the characters should learn.</p><p>Unlike most other Japanese RPGs, the game does not have a single main character. Rather, the player-controlled party can be considered the game's collective protagonist. The first part of the game develops linearly, with one of the characters playing a central role; however, during the second part, the player is associated with a different character initially, exploring the game world, recruiting characters, and completing sub-quests in a non-linear fashion.</p><p>PlayStation re-release of the game includes new FMV cutscenes, bestiary, and artwork galleries. Game Boy Advance version and later Android, iOS, and PC releases remove FMVs but instead include two new bonus dungeons (the Dragons' Den and the Soul Shrine), new bosses, espers, weapons, and gear, as well as many other minor additions and changes.</p>"},{"name":"Final Fantasy V","year":1992,"developer":"Square Co., Ltd.","url":":Final Fantasy V (Rev 2.1 - Legend of the Crystals Version)","filesize":1509861,"score":7.7,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Real-time > Turn-based > Fantasy","desc":"<p>The Elemental Crystals are the life source of the planet. With them, gentle winds blow, the seas are active, fire burns bright, and the earth is full of life. All seems well in the world, until the wind suddenly stops, the sea begin to grow stagnant, the heat of fire becomes scarce, and the earth begins to wither. King Tycoon, sensing a premonition of evil, hurries off to check on the Wind Crystal, only to witness it destroy itself.</p><p>Meanwhile, a young traveler named Bartz is camping in a field when a giant meteor strikes the planet. When he heads out to examine the meteor, he is shocked to find a young girl named Lenna, who is the princess of Tycoon, and an old man named Galuf, who is on a critical mission. Later, joined by Faris, a pirate captain, the foursome must travel the land in search of the destroyer of the Crystals, and save the planet at any cost.</p><p><em>Final Fantasy V</em> is a role-playing game that uses the Active Time Battle system first introduced in Final Fantasy IV. It also incorporates the Job/Ability system from Final Fantasy III, which keeps the core gameplay centered on four main characters and allows the player to change their classes, or 'jobs'. A new feature lets the player assign an ability from one job to a character who has another job.</p><p>An updated version with additional content has been released on Game Boy Advance.</p>"},{"name":"Final Fantasy: Mystic Quest","year":1992,"developer":"Square Co., Ltd.","url":":Final Fantasy - Mystic Quest (USA)(Rev 1)","filesize":358382,"score":6.4,"genres":"Role-playing (RPG) > 3rd-person (Other) > Top-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy","desc":"<p>Focus Tower is the center of the world and balances the forces of the world. However 4 monsters have taken the 4 elemental crystals (Earth, Water, Fire, Wind) for their own use, and also taken the 4 keys that for doors inside of Focus Tower. With the balance disrupted, disasters befall the world. A young boy by the name of Benjamin finds his home village destroyed. Meeting a mysterious old man while trying to escape from earthquakes, he soon learns that he is the prophesized hero and the only one who can save the world. Benjamin must recover the 4 crystals, unlock Focus Tower and defeat the ultimate monster before the 5th crystal, the Crystal of Life is corrupted.</p><p><em>Final Fantasy: Mystic Quest</em> is an RPG game, shown from an overhead view for movement within areas and using a 3rd person view for battles. The game is divided into \"areas\" on the world map between which the player can freely jump. These areas are divided into Towns, Dungeons and Battle Areas. Towns feature characters to interact and talk to, Dungeons are mazes filled with monsters and Battle Areas are instant battles with specific monsters, completion of which sometimes awards special items. Inside a Dungeon or Town, the player moves from an overhead view, with he ability to jump, use weapon at whatever is in front of the character, interact with NPCs and attack monsters.</p><p>Unlike other Final Fantasy games, there are no random battles, all the enemies are visible to the player (or in specific \"Battle Areas\"). During battle, the game features turn-based combat (but not the \"ATB battle system\" used in other Final Fantasy games) where the player chooses from battle commands such as Attack, Defend, Item and Spells.</p><p>Also unlike other Final Fantasy games, the player's party only ever consists of two characters: Benjamin and another character who can either by controlled manually or automatically by the AI. Benjamin can collect armor for 4 different parts of the body as well as 4 different kinds of weapons, however the other party member cannot have their equipment changed.</p><p>Players can save at any point in the game. If the player is defeated in a battle, the game will let the battle be retried, but any items used will be lost.</p>"},{"name":"Final Fight","year":1990,"developer":"Capcom Co., Ltd.","url":":Final Fight","filesize":645275,"score":7.7,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Regional differences","desc":"<p>The SNES version of Final Fight some significant differences to the original: there is one less level (the factory level is gone), one less character to choose from (only Haggar and Cody are available) and no multiplayer. There is also a sprite restriction of three enemies at the same time in place.</p><p>There are also some minor differences in the US release such as different enemies (all female ones were replaced with males), different boss names (Damnd became Thrasher and Sodom became Katana), a removed power-up (Whiskey) and the outcry \"Oh My God!\" was changed to \"Oh My Car!\". </p><p>The later released <em>Final Fight Guy</em> is essentially the same game, but the second playable character is Guy instead of Cody. There is also a small change in the intro: Guy says that Cody is still in Japan training his martial arts skills so it is up to him to save Jessica. Also, this version of the game has less slowdown, increases the number of difficulty level options from two to four, plus adds extra life and invincibility pickups.</p>"},{"name":"Final Fight 2","year":1993,"developer":"Capcom Co., Ltd.","url":":Final Fight 2 (USA)","filesize":803222,"score":7.1,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Martial arts > Regional differences","desc":"<p>Final Fight 2 is the SNES exclusive sequel to Final Fight which was released on the same platform. Like the original outing, this game is a sidescrolling fighter (i.e. Double Dragon).</p><p>The MAD GEAR gang is back. They have kidnapped Guy's fiancee (Guy was one of the main characters in the original game), her father and Guy's martial arts master Genryusai. The younger sister of Guy's fiancee, Maki, teams up with Mike Haggar and Carlos Miyamoto to take out the MAD GEAR gang once and for all. The game is set in various stages around the world.</p>"},{"name":"Final Fight 3","year":1995,"developer":"Capcom Co., Ltd.","url":":Final Fight 3 (USA)","filesize":1842431,"score":7.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Beat 'em up / brawler","desc":"<p><em>Final Fight 3</em> is almost identical to the previous two SNES installments. The Mad Gear gang has been destroyed and, because of this, the Skull Cross gang has gone rampant in Metro City. Now, it is up to mayor Mike Haggar and Guy (along with newcomers Dean and Lucia) to stop them once and for all.</p><p>Like the previous games, this game is a side-scrolling fighting game similar in style to the Double Dragon and Streets of Rage series. In addition to using various punches, kicks, and special attacks, players can also pick up and use various melee weapons lying on the streets, such as bottles, lampposts, metal pipes, barrels, etc.</p>"},{"name":"Final Stretch","year":1993,"developer":"Genki Co., Ltd."},{"name":"Fire Emblem: Monsho no Nazo","year":1994,"developer":"Intelligent Systems Co., Ltd.","url":":Fire Emblem - Monshou no Nazo (Rev 0.22)","filesize":1771138,"score":"","genres":"Role-playing (RPG) > Strategy > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>A remake and expansion of the first NES/Famicom Fire Emblem, Marth must face the betrayal if Hardin and an old enemy he thought long vanquished, the Dragon King Medeus.</p><p>Book 1 of the game is essentially a remake of the first NES game. Book 2 continues the story with the same characters.</p><p>This game expands the series, however it drops explorable towns and the navigation through a world map which was introduced in Fire Emblem: Gaiden. New features include the ability to dismount the horse and pegasus mounted units, to allow the riders to fight indoors if needed.</p>"},{"name":"Fire Emblem: Seisen no Keifu","year":1996,"developer":"Intelligent Systems Co., Ltd.","url":":Fire Emblem - Seisen no Keifu (Rev 0.87g)","filesize":2978896,"score":"","genres":"Role-playing (RPG) > Strategy > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>The fourth installment in the popular strategy series, set in the continent of Jugdral, southeast of Akaneia. The game's first fifth chapters follow the Prince of Chalphy, Sigurd -- from there, his son Celis becomes the protagonist. The game uses the same turn-based strategy gameplay as its predecessors, but changes up the promotion system by making it entirely level-based, adds RPG-style status effects, and introduces the concept of the weapons triangle, in that a sword is strong against an axe, spear against the sword, and axe against the spear. Seisen no Keifu also featured much larger maps than previous titles (though a lower number of them -- 12 in all) and a handful of new units, such as the Troubadour, Dragon Master, and Falcon Knight. The game was released late in the Super Famicom's lifecycle in Japan and never published internationally.</p>"},{"name":"Fire Emblem: Thracia 776","year":1999,"developer":"Intelligent Systems Co., Ltd."},{"name":"Fire Emblem: Thracia 776 (Deluxe Pack)","year":1999,"developer":"Intelligent Systems Co., Ltd."},{"name":"Firemen, The","year":1994,"developer":"Human Entertainment, Inc.","url":":Firemen, The (Europe) (En,Fr,De)","filesize":794779,"score":7.2,"genres":"Action > Top-down","desc":"<p>You play as a firefighter, together, you and your squad are sent in into a big building which is on fire. Your mission is to rescue the people inside the building and also put out the fire. Use your watercannon to put out fire or use your waterbomb to put out bigger flames. Be sure to listen to every word your squadmate tells you, or you may be toast.</p>"},{"name":"Firepower 2000","year":1992,"developer":"The Sales Curve Ltd."},{"name":"Firestriker","year":1993,"developer":"Hect Co. Ltd.","url":":FireStriker (USA)","filesize":424120,"score":7,"genres":"Action > Top-down > Pinball > Fantasy","desc":"<p>A long time ago the kingdoms of wind, fire, earth and watercompeted for the Trialight, a weapon created by the Arch Mage Wylde that can only be used by a Firestriker. The kingdom of wind won and united the four kingdoms. Wylde however, was not satisfied with peace and conjured four monsters to overthrow the united world. Now, only the kingdom of wind remains and the player takes control over the last Firestriker to free the other kingdoms and defeat the monsters.</p><p>Even though Firestriker looks like a typical SNES RPG, it is in fact an action game that has more in common with a pinball-game than with any other genre. The Trialight is a ball of fire that basically behaves like a pinball. The player controls the Firestriker who can freely walk across the screen and strike at the Trialight to control its movement. Levels are filled with obstacles, destroyable block and monsters. Monsters and blocks can only be destroyed by the Trialight. The goal of each level is to maneuver the Trialight towards the exit of the screen. The exit is usually blocked by destroyable obstacles and sometimes certain conditions (such as killing all monsters or destroying certain objects) have to be fulfilled before a level can be completed. If the Firestriker is killed or the Trialight falls off the screen, the player loses a life. Additionally to the Firestriker, the player can use the shoulder buttons to control a magician who (in single player mode) stays at the bottom of the screen. The levels consist of several screens and are entered from a world map. As the game progresses, the player will also fight several bosses and free other Firestrikers whose special abilities are necessary to complete the game.</p><p>Firestriker also features a two-player cooperative mode as well as a duel-mode for up to four players.</p>"},{"name":"First Queen: Ornic Senki","year":1994,"developer":"Culture Brain Inc."},{"name":"First Samurai","year":1993,"developer":"Vivid Image","url":":First Samurai (USA)","filesize":363908,"score":7.7,"genres":"Action > Side view > Real-time > Arcade > Fighting > Platform > Fantasy > Martial arts","desc":"<p><em>\"The Demon King descends from his mountain domain to you, the First Samurai and your master. Defenceless against the Demon's magic, you succumb to his powers, leaving your Master to fight the Demon King alone. Your master falls in combat, dying. But, with his last breath, he summons the Wizard Mage. The Demon King fearing defeat, escapes to the future. Tormented, the young samurai seeks the teachings of the Wizard Mage in the ways of magic. Boiled with revenge and armed with a magical sword, the young samurai follows the Demon King into the future and the unknown...\"</em></p><p>The First Samurai is a platform action game very much similar to other platform games, but with a medieval oriental touch to it in addition to various unique features.</p><p>Arriving in the new unknown land, you are defenceless hence your fists and kicks. But as you journey forth, you'll find your trusty magical sword as well as throwing weapons such as knives and axes. With your martial art skills, your enemy best beware with those sudden moves that may prove fatal!</p><p>The First Samurai offers a wide array of weapons, special items and other objects. Combat is usually melee, either relying on your punch or kicks or using the magical sword to slash some pretty skillful blows in whatever direction possible.</p><p>Monsters are forever regenerating but food for health is plentiful. It actually takes an effort to be killed...</p>"},{"name":"Flashback: The Quest for Identity","year":1993,"developer":"Delphine Software International","url":":Flashback - The Quest for Identity (USA) (En,Fr,De)","filesize":1195751,"score":8.1,"genres":"Action > Side view > Fixed / flip-screen > Platform > Puzzle elements > Shooter > Cyberpunk / dark sci-fi","desc":"<p>The year is 2142. The player takes control of Conrad B. Hart, a man who has lost his memory. After barely escaping from hostile aliens, Conrad's bike crashes on an unknown planet. Conrad finds himself in the jungle, and from that moment on his quest for survival and his lost identity begins.</p><p><em>Flashback: The Quest for Identity</em> incorporates elements of platforming, shooting, and problem-solving. The game can be described as a \"cinematic platformer\" (commonly referred to as  Prince of Persia-style), following a design philosophy that was also manifested in Delphine Software's previous work,  Another World. Compared to that game, <em>Flashback</em> focuses more on platforming and exploration of large levels.</p><p>While a large bulk of the gameplay is dedicated to running, jumping, and shooting enemies, there is also a considerable exploration element in the game, as well as some puzzle-solving. The player navigates Conrad through platform structures, performing various moves. It is possible to simply jump or do a longer run-and-jump, run, climb, hang off ledges, and pick up objects lying on the ground. </p><p>To defend himself, Conrad can shoot enemies with his gun and also use various objects (such as stones) to harm or distract them. Crouching and rolling are possible (and often essential) moves that can be executed during combat. The gun has unlimited ammunition; however, shields that Conrad uses to protect himself from attacks are depleted when he is hit and can be recharged at special stations. Though most environments in the game are hostile, there are a few locations that are devoid of enemies. The player is usually required to talk to characters, gather information, and complete tasks in an adventure-like fashion in these areas. </p><p>Most of the versions utilize cutscenes with polygonal vector graphics. The CD versions replace those with pre-rendered 3D animations. The Sega CD version also features voice-overs.</p>"},{"name":"Flintstones, The","year":1995,"developer":"Ocean of America, Inc.","url":":Flintstones, The (USA)","filesize":1284632,"score":6.4,"genres":"Action > Side view > 2D scrolling > Arcade > Prehistoric > Licensed","desc":"<p><em>The Flintstones</em> is based on the live-action motion picture but the levels and controls differ from the Game Boy version.</p><p>You still play as Fred in this side-scrolling platform game and you must get home from the Quarry, rescue Pebbles and Bam-Bam, Barney and Wilma from the evil Cliff Vandercave. In addition to the differing levels, the game has three weapons. You can still jump but that is not how you defeat enemies. Instead, you have a club and a limited supply of bowling balls to roll and rocks to throw.</p>"},{"name":"Flintstones, The: The Treasure of Sierra Madrock","year":1994,"developer":"Taito Corporation","url":":Flintstones, The - The Treasure of Sierra Madrock (USA)","filesize":849962,"score":7,"genres":"Action > Behind view > Diagonal-down > Side view > Top-down > 2D scrolling > Board game > Platform > Prehistoric > Licensed","desc":"<p>The Great Poobah has retired and is looking for a successor. Since there are so many candidates, it is decided that the person who finds the Great Treasure of Sierra Madrock will become the new Great Poobah.The player takes control over Fred and Barney who also participate in the treasure hunt in order to make Fred the New Great Poobah.</p><p><em>The Flintstones: The Treasure of Sierra Madrock</em> is a side-scrolling platformer that includes several board game elements. On a world map, Fred and Barney throw dices to determine how many fields they can move. </p><p>There are different fields that hold different challenges.</p><p>Most fields require you to finish a side-scrolling platforming level. Fred and Barney can jump, club their enemies and climb trees or stone pillars. Holding down the jump button lets them hover in the air for a short moment. Throughout the levels, different power-ups and items can be found: clamps are used as money, apples replenish some health, 100 stars grant an extra life to Barney or Fred and an empty Heart frame increases their life bar.</p><p>On fields marked with a skull, a boss has to be defeated. </p><p>Heart fields hold bonus games in which you have to collect as many items as possible within the time limit.</p><p>At amusement parks, several mini-games can be played to win items or extra lives. Mini-games include: Memory; Balls O' Fun\", where you can win items by throwing a ball at them; a mini-game in which you have to stop monkeys from climbing down trees and stealing your items by hitting them with coconuts and others.</p><p>In Cafes you can buy food to replenish your health.</p><p>In stadiums you can participate in special challenges (3D cart races for example), in order to gain new abilities such as double jumps.</p><p>While stadiums, cafes and amusement parks can be revisited, all other levels only need to be finished once.</p><p>Fred and Barney are not the only characters that move about the playing field. You will also run into their wives Betty and Wilma as well as other characters that are also looking for the treasure. When Fred or Barney encounter their wives, they are dragged a few fields back. Other characters give them useful items if you can beat them at a challenge (usually a race).</p><p>Other notable features are a password system and a competitive 2-player mode.</p>"},{"name":"Football Fury","year":1992,"developer":"Sammy Corporation","url":":Football Fury (USA)","filesize":650234,"score":"","genres":"Sports > Football (American)","desc":"<p>An American Football game featuring fictional teams. Even though, the teams are fictional, they are based on the real NFL team cities and the division setup of that time period. </p><p>Gameplay involves the usual football fare of choosing a play and attempting to execute it. On offense, when throwing the football, a meter appears which measures the strength of the passer's throw. On defense, the player controls a defensive player and tries to tackle the opposing ball carrier or attempt to break up a pass play.</p><p>There is an option to either play with the background music on or off.</p>"},{"name":"Foreman for Real","year":1995,"developer":"Software Creations of America","url":":Foreman for Real (USA)","filesize":1827770,"score":5.7,"genres":"Sports > Behind view > Boxing > Licensed","desc":"<p>Before marketing fat-reducing grills, boxing legend George Foreman endorsed this boxing game with a 3rd-person view similar to Punch Out. A full range of punches and jabs are available, with full round-by-round scoring from the judges. You can choose from 3-12 rounds, and there are 2 camera views as well as an automatic switch option.</p><p>You can play simple exhibition matches or tournaments, or launch into a career mode. In this you start at the bottom of the world rankings, and must reach the top by beating the game's players, who other than George are all fictitious boxers with varying strengths and weaknesses. The coach gives advice before each fight to help highlight weaknesses in your play. There are passwords for each round.</p>"},{"name":"Fork Parker's Crunch Out","year":2019,"developer":"Mega Cat Studios"},{"name":"Frank Thomas Big Hurt Baseball","year":1995,"developer":"Iguana UK","url":":Frank Thomas Big Hurt Baseball (USA)","filesize":1983436,"score":6.5,"genres":"Simulation > Sports > Behind view > Diagonal-down > 2D scrolling > Baseball > Licensed","desc":"<p>Baseball player Frank Thomas licensed one of the first baseball games to use motion-captured 3D graphics and multiple camera angles. 28 stadia have been rendered in 3D, and each has its own visible and significant differences. </p><p>There are 6 distinct game modes, allowing for single exhibition matches as well as full seasons on the playoffs. There is also a Home Run Derby mode, allowing the player to pelt the ball out of the ground for points. </p><p>You can choose pitchers and batters, based on their statistics and form. Bowling options are set to define the delivery, with fastballs and curveballs as well as more precise setting of pace and height. Fielding is optional - it's best to leave this to the computer at first You can always alter the infield and outfield depth and shift.</p>"},{"name":"Frantic Flea","year":1996,"developer":"Häus Teknikka","url":":Frantic Flea (USA)","filesize":1257261,"score":6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p><em>Frantic Flea</em> has the player take control of a flea warrior out to protect his Flea World from an evil race of bugs called the Insideos who are enslaving his friends and family.</p><p>The gameplay is a side-scroller with six different levels, where the player explores each stage, freeing fellow captive fleas and utilizing weapons and devices to aid in their missions such as the Hoverpod which enables flight and the Stikko which can give the player the ability to climb walls. The graphics are done up in a cartoon-style with over 100 animation frames to give sprites a more fluid life-like feel.</p>"},{"name":"Frog Feast","year":2006,"developer":"Rastersoft"},{"name":"Frogger","year":1998,"developer":"Konami Industry Co. Ltd."},{"name":"Front Mission","year":1995,"developer":"G-Craft","url":":Front Mission (Rev 1b)","filesize":2283007,"score":7.8,"genres":"Role-playing (RPG) > Strategy > 1st-person > Diagonal-down > Isometric > Turn-based > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In the future, many military forces are dependent on huge mech robots, called Wanzers (Walking Panzers) for combat. At Huffman Island, located in the the pacific ocean, wanzers are deployed by both the USN (United States of the New Continent) and the OCU (Oceana Community Union), who dispute ownership over the island. One night, the OCU forces stage a covert recon mission on a facility located in Larcus, a USN-held territory and weapons facility. Lead by a soldier named Roid, this mission was entirely unofficial and violated the peace treaty. During the mission, USN forces lead by Commander Driscoll appeared and ambushed the OCU soldiers. During the combat, Roid's fiance, Karen is killed and the USN facility is blown up; placing the blame on the OCU. This became known as the \"Larcus Incident\" and the OCU denied all knowledge of it's soldiers actions. Ultimately it would be a leading cause to the second Huffman War. </p><p>One year later, the war is underway and Huffman island is under provisional control of the OCU, but with a weakened military unable to defend against USN attacks. The soldiers involved in the Larcus Incident have all been discharged and disgraced. Roid spends his time fighting as a gladiator in the Wanzer fighting arena before being approached by a mysterious man. Colonel Olson has found out about Roid's history and wants him to command a mercenary unit he is assembling on behalf of the OCU, dubbed \"Carrion Crow\". Convincing Roid that Driscoll is still out there on the island, Roid agrees.</p><p><em>Front Mission</em> is a turn-based strategy RPG played from an isometric perspective. Players progress in the story through large strategic battles involving multiple units and cutscenes between them. At certain places, usually towns, the player can visit multiple locations including bars and shops, and talk to people. Shops are also found to purchase new weaponry, parts and make repairs. In combat, each Wanzer robot is a separate unit that has a large variety of weapons and attack styles depending on what's equipped. Units get experience for defeating enemies and also for using various techniques. The more an attack is used, the more powerful it becomes.</p>"},{"name":"Front Mission: Gun Hazard","year":1996,"developer":"Cobra Team","url":":Front Mission Series - Gun Hazard (Rev 1.01)","filesize":2510293,"score":7.5,"genres":"Action > Role-playing (RPG) > Side view > Platform > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>The year is 2064, when the great solar power satellite, ATLAS is overshadowed by the invention of fusion power. The government alliance that had supported the building of ATLAS now find themselves facing economic crisis as the balance of power shifts. In this world of conflict and change, the Walking Panzer, or Wanzer, (a form of mecha) becomes the standard armored unit for wars and petty battles across the globe. For the small nation of Bergen, a coup d'etat is underway, staged by Colonel Ark. Seeking to establish complete control over the government and the NORAD units stationed there, Ark's first step involves the capture of President Orwen. Tipped off to the rebellion, Orwen seeks to flee from Bergen, looking for safe passage out of the seaport of Port Ertothal. A young Wanzer pilot, Albert Grabner, is assigned escort duty to the president by loyal elements of the army stationed there...</p><p><em>Gun Hazard</em> is a side-scrolling shooter with strong RPG elements, and a spin-off of the Front Mission series. Gameplay is more than a little similar to Cybernator or Metal Warriors. The player moves between different stages on an area map. Once inside a stage, the player controls Albert and his wanzer as it moves left, right across the screen. The wanzer is able to jump, and attack with a primary and a special weapon. At any time during a stage, Albert can eject from his heavily armed wanzer to explore. Although vulnerable when outside, Albert is able to reach areas the wanzer cannot, in addition to being a smaller target and being able to jetpack indefinitely.</p><p>Money and experience are earned through the completion of mission objectives as well as the kill count of enemy wanzers. Additionally, Albert can recruit other characters through the normal course of the story, some of whom can be designated to support roles. These support characters when set can provide a variety of different cover fire abilities for Albert during his missions. They too gain experience and levels. Different weapons and armor can be found or bought. Essential components include the Booster ability which allows the wanzer to hover and increase its jumps, as well as the Dash ability which allows quick left-right movement by the wanzer.</p>"},{"name":"Full Throttle: All-American Racing","year":1994,"developer":"Gremlin Graphics Software Limited","url":":Full Throttle - All-American Racing (USA)","filesize":704872,"score":5.5,"genres":"Action > Racing / Driving > Behind view > Arcade > Motorcycle","desc":"<p><em>Full Throttle Racing</em> takes in chaotic, violent and no-holds-barred racing across America. The racing takes place on both land and water, with motorbikes and boats featured.</p><p>There are 6 racers in the game, each with their own short profile, including a guy newly out of jail, a token woman and a token African-American. You can race one or both disciplines, racing either an individual weekend or a full championship.</p><p>As you play the game you can upgrade your vehicle, with faster engines, better tyres and more nitros. As in Road Rash, throwing your legs out at the other riders is potentially advantageous.</p>"},{"name":"Fun 'N Games","year":1994,"developer":"Leland Interactive Media","url":":Fun 'n Games (USA)","filesize":690345,"score":5.6,"genres":"Action > 1st-person > Top-down > Shooter > Sci-fi / futuristic","desc":"<p><em>Fun 'N Games</em> presents a mixture of games and applications. The main menu is divided into four sections:* <strong>Paint</strong>  </p><p>A paint program that offers different tools and brushes, a few pre-made backgrounds and objects as well as the option to import figures that were created in the sub-games Stylin' Stuff and mix 'n match.</p><ul><li><p><strong>Games</strong>  </p><ul><li>Mouse Maze: A Pac-Man-clone in which the player guides a mouse through a top-down labyrinth. To complete a level, all cheese symbol have to be collected while cats have to be avoided. Collecting a bone temporarily transforms the mouse into a dog that can kill the cats.</li><li>Space Lazer: A shooter seen from the cockpit of a space-ship. The player controls a crosshair and has to shoot increasingly difficult enemies.</li><li>Whack a Clown: This game is exclusive to the Genesis Version and plays like 'Whac-a-Mole' only with clowns instead of moles.  </li><li><strong>Music</strong>  </li></ul></li></ul><p>Songs can be composed by choosing from several instruments and putting notes onto a stave. It is also possible to add sound effects (animal noises and others) or edit provided songs.</p><ul><li><strong>Style</strong>  </li></ul><p>This section contains two mini-games:    + Stylin' Stuff: Here, the player can edit the sprite of a woman by selecting different clothes, hats or haircuts.    + Mix 'n match: Sprites can be created by putting together different heads, torso, and legs.</p>"}]