[{"name":"G.O.D: Mezameyo to Yobu Koe ga Kikoe","year":1996,"developer":"Infinity Co., Ltd."},{"name":"Gakkou de atta Kowai Hanashi","year":1995,"developer":"Pandora Box"},{"name":"Galaxy Wars","year":1995,"developer":"Universal Co., Ltd."},{"name":"Game no Tatsujin","year":1995,"developer":"Success Corp."},{"name":"Ganbare Daiku no Gensan","year":1993,"developer":"Irem Corp."},{"name":"Ganbare Goemon 2: Kiteretsu Shogun Magginesu","year":1993,"developer":"Konami Co., Ltd.","url":"5#G/Ganbare%20Goemon%202%20-%20Kiteretsu%20Shougun%20Magginesu%20%28English%20Translated%2C%20Rev%203%20With%20Ganbare%20Title%20Screen%20Patch%29.sfc","filesize":4194304,"score":8.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga","desc":"<p>As you may have guessed from the number 2 in the title, this is the second SNES game in the popular blend of the adventure and jump and run genres which is the Goemon series. Again, you (and your partner, in 2 player mode) control Goemon, his friend Ebisu-Maru and, new to the bunch, robot Sasuke, through loads of action stages and villages. Another new feature comes with 3D boss fights, featuring the giant mech type robot called \"Goemon Impact\".</p>"},{"name":"Ganbare Goemon 3: Shishi Jurokubee no Karakuri Manji-gatame","year":1994,"developer":"Konami Co., Ltd.","url":"5#G/Ganbare%20Goemon%203%20-%20Shishi%20Juurokubee%20no%20Karakuri%20Manjigatame%20%28English%20Translated%2C%20Rev%204%20With%20Ganbare%20Title%20Screen%20Patch%29.sfc","filesize":4194304,"score":"","genres":"Action > Side view > Top-down > Anime / Manga > Arcade","desc":"<p>Third title in the Ganbare Goemon series of platform/adventure games which cast you as the heroic Goemon as he attempts to save feudal Japan from all sorts of wacky evildoers. This time around, a time-travelling machine threatens all of Japan and thus Goemon and co. must jump into the future to stop the machine.</p><p>The game alternates between a top-down world map view in which your characters explore the gameworld and side-scrolling stages in which the main action lies. As in most games of the series there are also loads of mini-games and unique gameplay sequences such as maneuvering Goemon's giant mecha.</p><p>The game continues the tradition of bizarre humor unique to the series, you can play as either Goemon or any of his 3 companions, Ebisumaru, Sasuke or Yae with each sporting unique weapons and abilities and also with their own dialogue options and cutscenes, which feature sitcom-like pre-recorded laughs for added wackiness.</p>"},{"name":"Ganbare Goemon Kirakira Dochu: Boku ga Dancer ni Natta Wake","year":1995,"developer":"Konami Co., Ltd.","url":"5#G/Ganbare%20Goemon%204%20-%20Boku%20ga%20Dancer%20ni%20Natta%20Riyuu%20-%20Kirakira%20Douchuu%20%28English%20Translated%2C%20Rev%203%20With%20Ganbare%20Title%20Screen%20Patch%29.sfc","filesize":4194304,"score":"","genres":"Action > Side view > Anime / Manga > Arcade","desc":"<p>Fourth title in the Ganbare Goemon series of platform/adventure games which cast you as the heroic Goemon and his gang of wacky adventurers as he fights evil all over Japan. This sequel however, takes the action to outer space as the gang attempts to rescue Goemon Impact (Goemon's giant mecha) from a strange planet.</p><p>The game is based around a stage-select hub from which you select which character you want to play as and then attempt to clear the game's many side scrolling stages in standard action platformer fashion, navigating the obstacles and defeating all enemies you run into with your weapons. Since each one of Goemon's allies got stranded on a different planet, you must take control of each one of them in order to clear the stages and recover the special ability unique to each character that must be later put to use to release Goemon Impact. As in other games of the series there are also loads of mini-games and unique gameplay sequences triggered in boss fights, bonus stages and special situations. These involve shooter sequences, racing &amp; sport games and other assorted diversions.</p>"},{"name":"Ganpuru: Gunman's Proof","year":1997,"developer":"Lenar Co., Ltd."},{"name":"Garry Kitchen's Super Battletank: War in the Gulf","year":1992,"developer":"Imagineering Inc.","url":"7#Garry%20Kitchen%27s%20Super%20Battletank%3B%20War%20in%20the%20Gulf%20%28Europe%29.sfc","filesize":524288,"score":6.3,"genres":"Action > Simulation > 1st-person > Tank > War","desc":"<p>In February 1991, The United States of America sent troops into Kuwait and fought in armed combat against the forces of Iraq. Operation Desert Storm featured many different types of units including mobile armor. The M1 Abrams tank division is deployed in a variety of missions to destroy marked Iraqi targets.</p><p><em>Super Battletank: War in the Gulf</em> is a 1st person tank simulation. Players sit in the cockpit of a M1 Abrams tank. Controls allow the player to accelerate forward, decelerate, rotate the tank's trajectory left and right, move the tank's cannon left and right, fire the weapon and check the map. The goal of the player is to travel to the location of enemy targets, line them up with the Abrams cannon and fire upon them until destroyed. Each mission covers a large area of land and the player will need to consult the real-time map to travel appropriately to target locations. The M1 Abrams tank also features 2 special weapons: The laser which is more powerful than regular cannon, and the smoke screen which allows the player to escape.</p>"},{"name":"Gdleen","year":1991,"developer":"Jorudan Co., Ltd."},{"name":"Gekisō Sentai Carranger: Zenkai! Racer Senshi","year":1996,"developer":"Natsume Co., Ltd."},{"name":"Gekitotsu Dangan Jidōsha Kessen: Battle Mobile","year":1993,"developer":"System Sacom"},{"name":"Gemfire","year":1992,"developer":"KOEI Co., Ltd.","url":"5#G/Gemfire%20%28NA%29.sfc","filesize":1048576,"score":6.6,"genres":"Strategy > Diagonal-down > Turn-based > Fantasy","desc":"<p>Koei made an incursion into the fantasy worlds of magic with this game.</p><p>Six magicians, each trapped inside a magical gem, are liberated from the crown Gemfire by Princess Robyn, daughter of the tyrannical ruler of Ishmeria, King Eselred. Fleeing across the length and breadth of the island nation, they each choose a leader from the greatest noble houses as their champion to topple Eselred and bring peace to Ishmeria. </p><p>Players select one of these noblemen and seek to unite all the provinces under their banner through a combination of warfare and diplomacy.</p>"},{"name":"Genghis Khan II: Clan of the Gray Wolf","year":1993,"developer":"KOEI Co., Ltd.","url":"5#G/Genghis%20Khan%20II%20-%20Clan%20of%20the%20Gray%20Wolf%20%28NA%29.sfc","filesize":1048576,"score":6.6,"genres":"Strategy > Diagonal-down > Turn-based > Turn-based strategy > Asia > Historical events","desc":"<p><em>Genghis Khan II: Clan of the Gray Wolf</em> is a 2D turn-based grand strategy game, based on the life of the historical Mongol leader Temujin, better known as Genghis Khan. The gameplay is similar to other grand strategy games from Koei, like Romance of the Three Kingdoms or Nobunaga's Ambition. The game has various scenarios from the Conquest of Mongolia (the unification of Mongol tribes) to World Conquest (with up to six playable factions). On the world/country map (divided into smaller provinces) the player develops his own provinces, gives orders to his subordinates, establishes alliances and recruits armies. The battles are presented in a separate mode, where the player directs troops using commands.</p>"},{"name":"Genocide 2","year":1994,"developer":"Bits Corporation"},{"name":"George Foreman's KO Boxing","year":1992,"developer":"Beam Software Pty., Ltd."},{"name":"Ghoul Patrol","year":1994,"developer":"LucasArts Entertainment Company LLC","url":"5#G/Ghoul%20Patrol%20%28NA%29.sfc","filesize":1048576,"score":7,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Direct control > Horror","desc":"<p>In the sequel to Zombie Ate My Neighbors players control the kids Zeke and/or Julie, who travel to different worlds and fight skeletons, ghouls, ghosts, and other demonic creatures in order to save their town from a horror exhibit that came to life.</p><p>Shooting enemies with weapons like Plasma Gun or Lobbing Smash Gun, the heroes need to rescue ten trapped victims on each level and fight the boss at the end, all the whole conserving the limited ammunition.</p>"},{"name":"Go Go Ackman","year":1994,"developer":"","url":"5#G/Go%20Go%20Ackman%20%28English%20Translated%2C%20Rev%201%29.sfc","filesize":1310720,"score":"","genres":"Action > Side view > Anime / Manga > Platform > Fantasy > Licensed","desc":"<p>Ackman is not what one would call a good person. His job is to murder and steal souls for the Demon Lord. The angel Tenshi has taken it upon himself to put an end to Ackman's nefarious ways, and sends an army of angels and hired assassins to take out Ackman for good. It's just as well, because Ackman was getting bored without anyone to kill.</p><p><em>Go Go Ackman</em> is a scrolling platformer starring the titular Ackman. Ackman can punch and charge up a ranged wave of energy, and he can also jump on some enemies to stun them before running into them and turning them into a sliding projectile. Ackman can hold up to three bombs that can clear the screen of enemies, and can also hold a weapon, either a sword, boomerang, or pistol, but it will be lost if Ackman is hit. Levels are linear, but do allow some exploration to find weapons and items hidden off the beaten road.</p>"},{"name":"Go Go Ackman 2","year":1995,"developer":"Aspect Co., Ltd."},{"name":"Go Go Ackman 3","year":1995,"developer":"Aspect Co., Ltd."},{"name":"Goal!","year":1992,"developer":"Tose Co., Ltd.","url":"5#G/Goal%21%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p><em>Goal!</em> is a soccer game featuring an Exhibition mode and a Super Cup mode. In the Exhibition mode the player gets to choose from 24 different international teams and play the computer or another player in a single soccer match. The Super Cup mode lets the player select a team and play against the three other teams in the group on their road to winning the Super Cup.</p><p>Before a soccer game starts, players get to choose a formation and set the game options. Options include turning on or off offsides, fouls, radar (a minimap showing where the players are positioned on the field), and whether to make the goal kick automatic or not. Players can also set the amount of time the each half of the game will last from as low as 1 minute to all the way up to 45 minutes.</p><p>During the game, players play on a horizontal field trying to move close to their opponent's goal ,and then try to kick in a goal to score a point. The team with the most points scored when the time expires wins the game.</p>"},{"name":"Gods","year":1992,"developer":"The Bitmap Brothers","url":"5#G/Gods%20%28NA%29.sfc","filesize":1048576,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Direct control > Classical antiquity > Fantasy","desc":"<p>Hercules is aiming to achieve immortality by completing the task the Gods have set him. His task is presented as a  platform adventure set in ancient Greece, featuring a variety of enemies as you play it through.</p><p>Of more significance, however, is the game's Artificial Intelligence system, in which creatures monitor how you play, and try to find safer positions. Also, the game offers more bonuses and power-ups if you're struggling to progress. Even without those, there are lots of bonus sections to find and unlock.</p>"},{"name":"Gon","year":1994,"developer":""},{"name":"Gourmet Warriors","year":1995,"developer":"Winds Co., Ltd."},{"name":"GP-1","year":1993,"developer":"Genki Co., Ltd.","url":"5#G/GP-1%20%28NA%29.sfc","filesize":1048576,"score":6.9,"genres":"Action > Racing / Driving > Behind view > Arcade > Motorcycle > Track racing > Oceania","desc":"<p><em>GP-1</em> is a racing game with motorcycles. The player races against 15 opponents on 13 tracks located in 12 different countries. There is an <em>Exhibition</em> mode that can support two players and the <em>Season</em> mode where the player can choose from six different bikes. Once the player starts to do well in the career mode, they can purchase upgrades and parts for their bike. The player can also choose a mechanic to fix their bikes.</p>"},{"name":"GP-1 Part II","year":1994,"developer":"Genki Co., Ltd.","url":"5#G/GP-1%20-%20Part%20II%20%28NA%29.sfc","filesize":1572864,"score":"","genres":"Racing / Driving > Behind view > Arcade > Motorcycle > Track racing > Vehicle simulator","desc":"<p>The sequel to GP-1, the player once again can race with motorcycles on 17 different tracks located across 14 different countries. The player also has six different bikes to choose from. Players can also upgrade their bikes by winning races and earn points, earning enough points will let the player obtain better parts for their bike.</p><p>The season mode, otherwise known as the <em>Grand Prix</em> is present along with a <em>Practice</em> and <em>Race</em> mode, but there is also a <em>Battle</em> mode that allows two friends to duke it out head-to-head on the track of their choice. A password feature is also present to allow players to pick up and play at their leisure.</p>"},{"name":"Gradius III","year":1990,"developer":"Konami Industry Co. Ltd.","url":"7#Gradius%20III%20%28USA%29.sfc","filesize":524288,"score":7.5,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Gradius III</em> is the third game in Konami's long-running space shooter series, which also includes Life Force and Nemesis. As with most Gradius titles, you control the highly advanced Vic Viper space fighter against hordes of foes. Weapons can be selected from pre-arranged loadouts or you can create your own custom loadout. The game can be played by a single player, or by two players in alternating turns. The game offers three levels of difficulty.</p>"},{"name":"Granhistoria: Genshi Sekaiki","year":1995,"developer":"J-Force"},{"name":"Great Circus Mystery starring Mickey & Minnie, The","year":1994,"developer":"Capcom Co., Ltd.","url":"6#Great%20Circus%20Mystery%20Starring%20Mickey%20%26%20Minnie%2C%20The%20%28USA%29.sfc","filesize":1572864,"score":6.9,"genres":"Action > Side view > 2D scrolling > Puzzle elements > Licensed","desc":"<p>Starring Mickey and Minnie Mouse, the two plan to spend the day at the Circus only to find that it's deserted. Believing that someone is responsible, you must dress up in different outfits such as Safari and Western, as you try to find clues to solve the mystery behind the disappereance of the performers, including your pals Donald Duck and Pluto.</p>"},{"name":"Great Waldo Search, The","year":1993,"developer":"Radiance Software","url":"5#T/The%20Great%20Waldo%20Search%20%28NA%29.sfc","filesize":524288,"score":4.3,"genres":"Action > Puzzle > Side view > Top-down > Hidden object > Licensed","desc":"<p>Based on the popular <em>Where's Waldo</em> series of books, the player's goal is to find Waldo, who is hidden in various pictures, before the time on the clock runs out. The player controls a magnifying glass and must click on various items for different effects. Finding a clock adds more time to the search, clicking on a 150 icon adds 150 points to the score, etc.</p><p>Each picture consists of 6 adjacent screens containing a continuous theme. The themes are The Carpet Flyers, The Underground Hunters, The Battling Monks, The Unfriendly Giants and The Land of Waldos. Players are given the option of playing on Normal difficulty, Expert difficulty, or playing the Land of Waldos stage. The only difference between the difficulties is that on expert there are no clock items to provide players with extra time.</p><p>In all of the stages the player must find both Waldo and a scroll to complete the stage. Waldo must be found before the scroll in order to complete the stage. Waldo's dog Woof is also in each of these stages (except for the Land of Waldos) and by finding him players get to play a small bonus stage where they collect points as they control the dog on a flying carpet.</p>"},{"name":"GS Mikami: Joreishi wa Nice Body","year":1993,"developer":"Natsume Co., Ltd."},{"name":"GunForce: Battle Fire Engulfed Terror Island","year":1992,"developer":"Irem Corp.","url":"7#GunForce%20%28USA%29.sfc","filesize":524288,"score":6.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter","desc":"<p><em>Gun Force</em> is a 2D side-scrolling run and gun game. The player takes control of a soldier who is dropped off onto an island and must fight his way through hordes of enemy soldiers until he gets to the final showdown in order to protect Mother Earth from the invaders.</p><p>Gameplay consists of moving forward and blasting all the enemies who get in the way. The player starts out with a normal gun, but can find other weapons throughout a level, such as a flamethrower or a laser gun. While the normal gun has an infinite amount of bullets, the other types of weapons will eventually run out of ammo. With these weapons, the player can shoot either straight, up, or on a diagonal. The player will also have the opportunity to commandeer a vehicle, which they can also fire bullets from.</p><p>The player starts with 5 lives and 3 continues. Each of the stages must be defeated in a certain amount of time or the player loses one of those lives.</p>"}]