[{"name":"Hagane: The Final Conflict","year":1994,"developer":"CAProduction Co., Ltd.","url":":Hagane - The Final Conflict (USA)","filesize":1209980,"score":7.9,"genres":"Action > Side view > Anime / Manga > Platform > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>The Fuma clan protects the Holy Grail which is said to possess the power to destroy the world. When the Koma clan attacks and steals the Holy Grail, only one ninja survives. Transformed into a cyborg, it is his task to retrieve the Holy Grail and save the world.</p><p><em>Hagane</em> is an action-oriented platformer, featuring five stages, divided into several sub-stages, filled with lots of enemies, jumping puzzles, mid- and endbosses. The titular main character can perform double jumps, jump off walls, use four different weapons, slide over the ground, somersault to dodge attacks and use several different special attacks.</p><p>Weapons include: a short sword, a chain, small bombs and throwing knives. Bombs and knives have limited ammunition that can be restored by picking up the right items dropped by defeated enemies.</p><p>Pressing and holding the shoulder buttons will cause Hagane to somersault and jump across the screen. This movement goes through three phases, pressing the jump or attack button during any of these phases lets Hagane perform different special attacks, such as flaming punches, kicks or backflips.</p>"},{"name":"Hameln no Violin Hiki","year":1995,"developer":"Daft Co., Ltd."},{"name":"Hammerlock Wrestling","year":1994,"developer":"Jaleco Ltd.","url":":Hammerlock Wrestling","filesize":1120270,"score":"","genres":"Sports > Side view > Fixed / flip-screen > Arcade > Fighting > Wrestling","desc":"<p><em>Hammerlock Wrestling</em> is Jaleco's take on wrestling with a style geared towards Saturday Night Slam Masters. The player can choose from 12 fictional wrestlers and compete in four different modes of play. There is also 60 different moves to choose from as well as unique finishers for each wrestler.</p><p>The <em>Exhibition</em> mode allows up to four different players to compete either against each other in singles match or in tag team format. <em>Champion League Match</em> is a round robin-type tournament with six different wrestlers competing for the league championship. <em>Tournament</em> is the standard tournament format with eight different wrestlers involved and <em>Top Ranking Match</em> where the player must battle through the other eleven wrestlers and defeat each one to become champion.</p><p>The game is divided into three different screens at times. The middle part shows the current action happening in the ring while the top and bottom parts of the screen are used for close-ups of action sequences such as power moves, illegal moves and finishing maneuvers.</p>"},{"name":"Hana no Keiji: Kumo no Kanata ni","year":1994,"developer":"Tose Co., Ltd."},{"name":"Hanjuku Eiyū: Aa Sekai Yo Hanjuku Nare","year":1992,"developer":"Square Co., Ltd."},{"name":"Haō Taikei Ryū Knight: Lord of Paladin","year":1994,"developer":"Japan Art Media Co., Ltd."},{"name":"HardBall III","year":1994,"developer":"MindSpan","url":":HardBall III (USA)","filesize":972080,"score":7.2,"genres":"Sports > Behind view > Diagonal-down > Baseball","desc":"<p>The third game in the Hardball baseball series.  This revision features 256 colour VGA graphics, and announcer Al Michaels provides running commentary while you play.</p>"},{"name":"Harley's Humongous Adventure","year":1993,"developer":"Visual Concepts Entertainment, Inc."},{"name":"Harukanaru Augusta","year":1991,"developer":"T&E Soft, Inc."},{"name":"Harukanaru Augusta 3: Masters - New","year":1995,"developer":"T&E Soft, Inc."},{"name":"Harvest Moon","year":1996,"developer":"Amccus","url":":Harvest Moon (USA)","filesize":928053,"score":7.7,"genres":"Simulation > Diagonal-down > Anime / Manga > Managerial / business simulation","desc":"<p>Ever wanted to live life on a farm, with nothing but the sun, the fresh scent of your crops, the muddy fields underneath, and cows and chickens to keep you company? Well, you're in luck, because you have just inherited your grandfather's ranch, but it's in a terrible state of disrepair! What ever can you do?</p><p>You're going to do like the farmers do; roll up your sleeves, get down in that dirt, fix that farm up and make it the best farm anyone has ever seen! It sure gets lonely on that farm...but not to worry! There are plenty of girls in the village, and if you treat them right and manage to win their love, you've got yourself a wife!</p><p>So let's go, farmer! You've got 2 years to make a name for yourself on that farm! Work hard, and the rewards will be great!</p>"},{"name":"Hat Trick Hero 2","year":1994,"developer":"Neverland Co., Ltd."},{"name":"Head-On Soccer","year":1995,"developer":"U.S. Gold Ltd.","url":":Head-On Soccer (USA)","filesize":832680,"score":7.3,"genres":"Sports > Diagonal-down > Isometric > Football (European) / Soccer","desc":"<p>In this isometric football game, 51 national teams are represented to play in two game modes: Exhibition and Tournament (a series of seven games on four continents, with a final against the World All-Stars), with the ability to set time, difficulty level, see cutscenes after goals and if players are free to kick each other around without (many) fouls.</p><p>While the game seems short-featured for 1995 standards, the tournament mode includes a twist: depending on how well the player defeats his opponents, he can trade his \"standard players\", who won't do anything spectacular (but at least fill up the ranks) for star players, who not only look different, are able to cross and backheel the ball but also have a unique ability at the disposal of the player:<em> </em><em>The Marker:</em>* can latch on an opposing player, stopping him from running away with the ball;</p><ul><li><p><strong>Goalkeeper 1:</strong> more capable of stopping shots than the regular goalkeeper;</p></li><li><p><strong>Barger:</strong> this large, muscular player is able to shove everyone in his path;</p></li><li><p><strong>Tricky:</strong> capable of jumping (or bunny-hopping, to be more precise) with the ball tucked between his feet, avoiding tackles;</p></li><li><p><strong>The Cheat:</strong> while it's hard to talk about fair play in a game where kicking a defenders' leg to gain a corner is (mostly) a legitimate play, this player takes the whole thing into the next level, being able to dig fouls out of nowhere, at the expense of the ball (if he's carrying it or the referee waves play on) or just some stains in his shirt (if he's trying to pull an offensive foul), with the odds of 50/50 (25% for penalties);</p></li><li><p><strong>Passer:</strong> capable of feeding forwards with laser-precision passes;</p></li><li><p><strong>Striker 1:</strong> capable of unleashing impossibly-sliced shots, scoring from virtually any position in the offensive area;</p></li><li><p><strong>Striker 2:</strong> best used from positions directly in front of goal, this striker features a shot that is so powerful the ball ignites as it approaches the goal;</p></li><li><p><strong>Goalkeeper 2:</strong> features a better chance of stopping special shots from both Strikers;</p></li></ul><p>In Exhibition games teams start with their own setup of start players, from none to a full team. The playing surface also affects gameplay - playing in wet grass removes all ball bounce, the opposite occurring with sand, and the most dramatic change, a rocky field where the ball can change direction after hitting the ground, turning throw-ins into corners, poor attempts on goals and vice-versa.</p>"},{"name":"Hebereke's Popoitto","year":1995,"developer":"Sun Corporation"},{"name":"Hebereke's Popoon","year":1993,"developer":"Sun Electronics Corp."},{"name":"Heisei Shin Onigashima: Kōhen","year":1997,"developer":"Pax Softnica"},{"name":"Heisei Shin Onigashima: Zenpen","year":1997,"developer":"Pax Softnica"},{"name":"Herakles no Eikō 3: Kamigami no Chinmoku","year":1992,"developer":"Data East Corporation"},{"name":"Herakles no Eikō 4: Kamigami no Okurimono","year":1994,"developer":"Data East Corporation"},{"name":"Hey Punk! Are You Tuff E Nuff?","year":1993,"developer":"Jaleco Ltd."},{"name":"Hiryū No Ken S: Golden Fighter","year":1992,"developer":""},{"name":"Hit the Ice: The Video Hockey League","year":1993,"developer":"Taito Corporation"},{"name":"Hokuto no Ken 5: Tenmaryūseiden: Ai * Zesshō","year":1992,"developer":"Toei Animation Co., Ltd."},{"name":"Hokuto no Ken 6: Gekitō Denshōken Haō e no Michi","year":1992,"developer":"Toei Animation Co., Ltd."},{"name":"Hokuto no Ken 7: Seiken Retsuden - Denshōsha e no Michi","year":1993,"developer":"Toei Animation Co., Ltd."},{"name":"Hole in One","year":1991,"developer":"HAL Laboratory, Inc."},{"name":"Holy Umbrella: Dondera no Mubo","year":1995,"developer":"Earthly Soft"},{"name":"Home Alone","year":1991,"developer":"Imagineering Inc.","url":":Home Alone (USA)","filesize":272930,"score":6,"genres":"Action > Side view > Platform > Survival horror > Licensed","desc":"<p>Kevin is left alone at home while his family is celebrating the holidays elsewhere. Unfortunately for him, two burglars have entered the house to keep him company. Kevin must avoid being caught by the burglars while he gathers all the family belongings and bring them to safety. To aid him in his quest, Kevin has a slingshot and a water pistol, but equally important is proper handling of the environment - a banana skid placed in the right spot or a bowling ball on top of a cupboard will help Kevin in his cause against the robbers.</p>"},{"name":"Home Alone 2: Lost in New York","year":1992,"developer":"Imagineering Inc.","url":":Home Alone 2 - Lost in New York (USA)","filesize":330193,"score":5,"genres":"Action > Side view > Arcade > Licensed","desc":"<p>Loosely based on the film of the same name, Kevin McAllister has arrived in New York City without his parents. However he checks himself into a hotel and begins to have fun. It isn't long before the hotel  discovers he's using stolen credit cards and begin to chase him around! On top of that, Harry and Marv the burglars he once defeated, are in town and looking for revenge.</p><p>Home Alone 2 is a side scroller. Controlling Kevin McAllister, the player will need to jump over enemies and obstacles while collecting items. These items include health bonuses and a variety of weapons. Losing all of Kevin's health or being \"caught\" will cost a life. The player starts with three lives for play.</p>"},{"name":"Home Improvement: Power Tool Pursuit","year":1994,"developer":"Absolute Entertainment, Inc.","url":":Home Improvement - Power Tool Pursuit! (USA)","filesize":814581,"score":5.7,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Based off the hit sitcom, Tim \"The Tool Man\" Taylor's name has been put Binford's new line of power tools and he goes on a quest to retrieve the missing tools when he discovers that they are missing when he is about to present them on Tool Time.  It is a race against time as you must collect various metal nuts to stay alive and collect a few wooden boxes of tool parts to proceed to the next part of the one of the four sound stages you are in.  Defend yourself with your various common tools, take out weak walls and floors with your sledgehammer and jackhammer, and use your grappling tool to swing, lower, and raise yourself to distant areas.</p>"},{"name":"Hong Kong 97","year":1995,"developer":"HappySoft"},{"name":"Hook","year":1992,"developer":"Ukiyotei Company, Ltd.","url":":Hook (USA)","filesize":497607,"score":6.5,"genres":"Action > Side view > 2D scrolling > Fighting > Platform > Licensed","desc":"<p>In this video game adaption of the Steven Spielberg film <em>Hook</em>, the player takes the role of a grown-up Peter Pan, whose kids have been kidnapped by Captain Hook. Tinker Bell takes Peter back to Neverland where he must again become Pan and reclaim his children.</p><p>This particular interpretation is a side-scrolling action game, in which players must hack their way past Hook's denizens through 11 levels. These include forests, icy regions, and towns which Peter will have to jump, climb, and swim through. Magic items such as apples and pixie dust can be collected for special powers. When enemies are attacked, they simply put their hands up in surrender rather than dying, so as to make the game more child-friendly.</p>"},{"name":"Human Grand Prix III: F1 Triple Battle","year":1994,"developer":"Human Entertainment, Inc."},{"name":"Human Grand Prix IV: F1 Dream Battle","year":1995,"developer":"Human Entertainment, Inc."},{"name":"Humans, The","year":1993,"developer":"Imagitec Design Inc.","url":":Humans, The","filesize":825257,"score":7.2,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Prehistoric","desc":"<p>The gameplay of <em>The Humans</em> has similarities to Lode Runner and Lemmings. Your job in this action puzzler is to help prehistoric man to evolve by helping them discover tools, the wheel, weapons, or even fire. Each level in the game will have a given task to help in this, and you are allotted a number of characters who must accomplish the task. The player can switch from person to person while moving the characters around each scrolling puzzle, and teamwork is essential to success. </p><p>Tasks can include finding objects (like a spear) on the screen, or trying to reach a specific destination which may require the use of objects you have discovered so far. Each level has a time limit, when time runs out the level can be restarted.</p>"},{"name":"Hungry Dinosaurs","year":1994,"developer":"Magical Company Ltd."},{"name":"Hunt for Red October, The","year":1993,"developer":"RSP, Inc.","url":":Hunt for Red October, The (Europe)","filesize":369174,"score":4.9,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Naval / watercraft > Cold War > Licensed","desc":"<p>The Hunt Goes On! You are Captain Marko Ramius, commander of the most advanced nuclear submarine ever created - the Red October. In a desperate attempt to defect to the United States, you must evade detection from an onslaught of enemy forces, both underwater and on the surface. Danger comes at you from all sides - even from within. It's destroy or be destroyed!</p><p>And that's just for starters. Even more perilous missions await you as the Red October takes to the sea against illegal arms, merchants, nuclear terrorists and environmental outlaws. Each mission is an incredible challenge to your skill, reflexes and command abilities. All together, it's the greatest submarine adventure of all time!</p>"},{"name":"Hurricanes","year":1994,"developer":"Probe Software Ltd.","url":":Hurricanes (USA)","filesize":684218,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The Garkos Gorgons have challenged the Hurricanes to a charity soccer match to see which team is the best in the world. The game follows the traversals of the Hurricanes, from their homeland to the Gorgons's stadium located on the far away Garkos Island. The Hurricanes must arrive at the foreign stadium on time or the Gorgons will automatically win the match.</p><p>The game consists of 15 levels that each must be completed within a certain time limit. Players control either Cal Casey  or Napper Thompson. They go throughout each stage dribbling a soccer ball.The ball can be used as a makeshift weapon as it can be kicked at enemies and also can be used to open boxes scattered throughout each level.The crates contain items like medals and trophies that can be collected. Those collected items get totaled at the end of each stage and get added as bonus points to the players score.</p><p>The game features an easy, medium, and hard difficulty level option.</p>"},{"name":"Hyper Iria","year":1995,"developer":"TamTam Co., Ltd."},{"name":"Hyper V-Ball","year":1992,"developer":"Video System Co., Ltd.","url":":Hyper V-Ball (USA)","filesize":599209,"score":6.4,"genres":"Sports > Side view > 2D scrolling > Direct control > Volleyball","desc":"<p><em>Hyper V-Ball</em> is a volleyball simulation based on the 1991 arcade game Power Spikes. All action is seen from a side-view perspective, meaning it is only possible to move players to the left or right. The player can choose between three different leagues: Men's League, Woman's League and Hyper League, which is a league for robots. Two buttons are used to control the ball, one for normal actions and one for Hyper Plays, special attacks that can only be learned and used in the Hyper League. How a player will block or attack depends on the ball's speed and the players position. Team members who aren't under the player's direct control will also act on their own by positioning themselves or preparing spikes. They will, however, not block spikes on their own but it is possible to let players not under direct control block spikes by pressing one of the action buttons at the right moment.</p>"},{"name":"HyperZone","year":1991,"developer":"HAL Laboratory, Inc.","url":":HyperZone (Europe)","filesize":321052,"score":5.7,"genres":"Action > Behind view > Arcade > Rail shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>A 3D shooter similar to Space Harrier. Control different futuristic flying vehicles and blast your way through numerous enemies and obstacles. If your ship is getting too fast, you can use the brakes, however flying too slow damages your ship. Apart from the standard weapons, most ships have a special attack that can be charged by holding down the fire button. The action takes place on set tracks; leaving those tacks will cause heavy damage to your ship. You can repair your ship by flying over certain areas. At the end of end of each level, a boss has to be defeated.</p>"}]