[{"name":"Ignition Factor, The","year":1994,"developer":"Jaleco Ltd.","url":":Ignition Factor, The (USA)","filesize":633744,"score":7,"genres":"Action > Puzzle > Top-down > Arcade","desc":"<p><em>The Ignition Factor</em> has the player take control of one of the most dangerous jobs, a firefighter, as they progress through several stages including a museum, a mine and a variety of buildings including a skyscraper. Before each mission, the player can look at a map and learn of trapped victims and dangerous hot spots and choose their equipment that include a chemical &amp; electrical fire extinguisher, an oxygen tank, a rope and an axe among others. However, the more equipment that the player is carrying, they will not be able to run or kick, limiting the firefighter to just merely walking.</p><p>The goal of each mission is the same, traverse the building while avoiding fires or extinguishing them, save victims and keep from being burned. Along the way the fire fighters will encounter obstacles that will stop or kill the player including collapsing floors and explosive barrels. There are no power-ups to replenish their health or fire extinguishers so the player must be cautious. Points are awarded after each stage for saving victims, the time left on the meter as well as \"Event\" points. If the player receives a certain amount of points at the end of the game, they will be treated to a special bonus stage.</p>"},{"name":"Ihatovo Monogatari","year":1993,"developer":"Hect Co. Ltd."},{"name":"Illusion of Gaia","year":1993,"developer":"Quintet Co., Ltd.","url":":Illusion of Gaia (USA)","filesize":1646650,"score":7.7,"genres":"Role-playing (RPG) > Top-down > 2D scrolling > Action RPG > Fantasy > Regional differences","desc":"<p>Will is a young boy whose father disappeared long time ago. Now Will lives in a small town with his grandparents. He possesses unusual abilities of pushing and pulling things without touching them. One day, he finds in his house a girl, who soon turns out to be the princess Kara. Kara's father, king Edward, wants her to marry a mysterious person called the Jackal. Kara asks Will to help her to escape the palace, and soon they both get involved in a string of mystery and conspiracies.</p><p><em>Illusion of Gaia</em> is an action role-playing game set in a fantasy version of Earth reminiscent of the age of exploration (16th century) and featuring famous real-world locations such as the Egyptian pyramids, the Great Wall of China, etc. The player controls Will, who can either fight in his regular form or transform into any of the two alter egos: the dark knight Freedan and Shadow, a manifestation of energy. Each character has different attributes and fights with his own weapon. The player receives special jewels upon clearing a room of enemies, which acts like experience points and is used to improve the protagonist's attributes. There is no monetary system or equipment in the game.</p>"},{"name":"Imperium","year":1992,"developer":"Jorudan Co., Ltd.","url":":Imperium (USA)","filesize":549841,"score":6.3,"genres":"Action > Top-down > Shooter > Sci-fi / futuristic","desc":"<p>In 2027 AD, there is a distant planet where high-tech robots have enslaved a class of mechanized creatures. These slave robots have formed an underground resistance movement and developed a suit of body armor that may hold the key to victory over the high-tech robots. The only thing holding back these robots, is that the body armor can only be worn by a human. The player takes control of that human.</p><p>This game is a vertical scrolling shooter. The player start with one life and 5 energy units for that life. The player also starts with a Vulcan weapon and a limited amount of missiles, which when used will hit everything on the screen. Extra missiles can be had by collecting icons from certain defeated enemies. Each enemy the player shoots down earns the player experience points. When the player reaches a certain amount of experience, they are rewarded with a new weapon, such as a wave or a laser.</p><p>The game has 3 difficulty levels.</p>"},{"name":"Incantation","year":1996,"developer":"Titus France SA","url":":Incantation (USA)","filesize":405966,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p>In <em>Incantation</em> you are controlling a young wizard who has to complete several jump'n'run levels. Enemies are defeated by using different spells that can be found throughout the levels. Spells have different ranges and attack power. Before a level can be completed, a certain number of items has to be collected, and at the end of some levels, a boss-fight awaits the wizard.</p>"},{"name":"Incredible Crash Dummies, The","year":1993,"developer":"Gray Matter Inc.","url":":Incredible Crash Dummies, The (Europe)","filesize":755363,"score":5.5,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>At a time when computer games were being blamed for violence, bad language, epilepsy and everything else the ‘moral majority’ needed a scapegoat for, Virgin gave us: The Road Safety Game. Or not, as this is a standard platform game with a twist of questionable taste and purpose. </p><p>You play a crash test dummy, trying to progress through levels filled with hazards such as cars and fireballs, within the time limits. Contact with each of these loses you a limb, and once you have none left, contact means game over. Since the character isn’t handicapped by missing limbs in any way, in practical terms you can think of these as hit points  especially as there are screwdrivers to pick up which restore one limb.</p>"},{"name":"Incredible Hulk, The","year":1994,"developer":"Probe Entertainment Ltd.","url":":Incredible Hulk, The (USA)","filesize":1004703,"score":6.1,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p>In this side-scrolling action game you fight against your arch-enemy The Leader and his forces (Rhino, Absorbing Man, Abomination and Tyrannus).</p><p>Take control of the Hulk/Dr. Banner through five levels of action. City and Construction Site, Tyrannus' Labyrinth, Leader's Fortress, Leader's Interior, and the Final Confrontation.</p>"},{"name":"Indiana Jones' Greatest Adventures","year":1994,"developer":"Factor 5 GmbH","url":":Indiana Jones' Greatest Adventures (USA)","filesize":1672574,"score":7.8,"genres":"Action > Behind view > Side view > 2D scrolling > Arcade > Platform > Interwar > Licensed","desc":"<p>Indiana Jones gets the Super Star Wars treatment for SNES. The title consists of platform levels from the first three Indy films: Raiders of the Lost Ark, Temple of Doom, and Last Crusade. Players get to use Indy's trademark whip, as well as guns, grenades, and his fists to get through the game. </p><p><em>Indiana Jones Greatest Adventures</em> also features special levels such as running from the giant boulder (Raiders), the Mine Cart chase (Temple of Doom), flying a biplane (Last Crusade), and fighting a Nazi commander on a tank heading off a cliff (Last Crusade). </p><p>The game is highlighted by selections from the John Williams score, and includes sound effects, digitized speech, and image captures during cutscenes.</p>"},{"name":"Inindo: Way of the Ninja","year":1992,"developer":"KOEI Co., Ltd.","url":":Inindo - Way of the Ninja (USA)","filesize":574509,"score":7.1,"genres":"Role-playing (RPG) > Top-down > Turn-based > Fantasy","desc":"<p>1581, Japan. Fearing a rebellion and striving to conquer the entire country, the warlock Nobunaga orders to attack the Iga ninja clan. The ninjas bravely defend their village, but, being vastly outnumbered, are mercilessly slain by Nobunaga's men. Only one survived: you, the hero of the game. Shortly before the assault you were sent to a nearby village to warn the elder of Nobunaga's attack. However, the other village is also destroyed by Nobunaga's army. You swear to avenge his crime. But for now, you are just an inexperienced young men, and are \"wanted\" by Nobunaga's men and ruthless bounty hunters. Will you be able to unite Japan in the ultimate struggle against Nobunaga?</p><p><em>Inindo: Way of the Ninja</em> is a Japanese-style RPG with a touch of strategy. You navigate your hero on the world map, visit towns, and descend into dungeons. The battles are turn-based and are viewed from a third-person perspective, like in <em>Final Fantasy</em> games. You can move on the battle field and use melee or long-ranged attacks. You'll be able to recruit characters of various classes to your party, who will join you for profit or for other reasons. After you gain enough experience, you'll also be able to talk to daimyos (feudal rulers) of various castles and to convince them to work together against Nobunaga. You can also perform various tasks for the daimyos, such as spying.</p>"},{"name":"Inspector Gadget","year":1993,"developer":"AIM","url":":Inspector Gadget (USA)","filesize":488137,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Inspector Gadget is on yet another mission against the evil Doctor Claw and his army of M.A.D. (Mean And Dirty) agents. This time it's personal because Doctor Claw has captured Gadget's niece, Penny. With the help of his trusty dog, Brain, and his suit full of special gadgets, Inspector Gadget must save Penny and defeat Doctor Claw and his minions!</p><p>Gadget will start in a haunted castle in England, and from there, he will travel to many places around the world while pursuing Doctor Claw. On the way, he will be confronted by Doctor Claw's agents, and the only way to get by them is to use his gadgets and items against them.</p><p>Gadget can attack his enemies by using his punch (up, left right) and kicks which he is already equipped with. </p><p>Several items he picked up can be used as weapons: Bombs - throw at enemies</p><p>Red Propellers - to be used against aerial enemies </p><p>Offensive Arrow - shoot at enemies </p><p>Little Inspector Gadgets - little robots that will run at and damage enemies.</p><p>If Gadget gets hit, he will lose his overcoat, leaving him in his boxers! In this state, he will lose a life if he gets hit again. To prevent this from happening, pick up an extra overcoat that he can change into.</p><p>Other items include: Hands - comes up from Gadget's hat and will grasp onto rings</p><p>Suction cups - shoot at walls and have Gadget climb up them</p><p>Hats - used as energy source for certain gadgets</p>"},{"name":"International Superstar Soccer","year":1994,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":":International Superstar Soccer (USA)","filesize":698791,"score":8.1,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer","desc":"<p><em>International Superstar Soccer</em> is a soccer game for the SNES and the first in the ISS series. The game features a number of game modes: Open Game (with 0, 1, or 2 players), International Cup, World Series, Training, Scenario, and Penalty Kick.</p><p>The Game features 26 national teams from all over the world which include line-ups as seen in the 1994 FIFA World Cup.</p><p>The Scenario mode lets you play the second half of a match with specific goals, usually winning the game. Some of the scenarios are based on real matches played in the 1994 World Cup.</p>"},{"name":"International Superstar Soccer Deluxe","year":1995,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":":International Superstar Soccer Deluxe (USA)","filesize":1499938,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p>This is the sequel to International Superstar Soccer, Konami's saga of soccer games. This Deluxe version was published first to the SNES, then the Mega Drive and Playstation.</p><p>ISS Deluxe has realistic animations and player sprites. You can compete with 36 national teams with recognizable celebrity players (like Valderrama, Baggio, Ravanelli, Petkov...), but their names are fictitious. You can choose too from 16 formations and 8 strategies to win.</p><p>The competitions available are: International Cup, World Series (League), Scenario Mode and customizable mini-cups/leagues.</p>"},{"name":"Irem Skins Game, The","year":1992,"developer":"Irem Corp."},{"name":"Iron Commando: Kōtetsu no Senshi","year":1995,"developer":"Arcade Zone Ltd."},{"name":"Itadaki Street 2: Neon Sign wa Bara-iro ni","year":1994,"developer":"Tomcat System"},{"name":"Itchy & Scratchy Game, The","year":1994,"developer":"Bits Corporation"},{"name":"Ivan 'Ironman' Stewart's Super Off Road","year":1992,"developer":"Leland Corporation"},{"name":"Izzy's Quest for the Olympic Rings","year":1996,"developer":"Alexandria, Inc.","url":":Izzy's Quest for the Olympic Rings (USA)","filesize":1081729,"score":6.5,"genres":"Action > Side view > 2D scrolling > Licensed","desc":"<p>Izzy's Quest for the Olympic Rings is the official game of the mascot of the 1996 Olympic Games in Atlanta. As the name suggests, Izzy must find the five Olympic rings, hidden by the guardians so that Izzy does not take them to his world.</p><p>The game plays a lot like Mario games; to eliminate an opponent Izzy must jump over his head. There are two jumps available, the ball jump suitable for height and the hurdle jump, suitable for distance. Both allow Izzy to clear an enemy, but the second harms  him.If Izzy is hit, then he must find three medals, or at the next hit he loses a life. There are some extra objects, like Olympic torches, and eggs that hatch either objects for bonus points, trampolines or  morph points to reach otherwise inaccessible areas or traps. Izzy can also morph into a glider, a baseball player, an archer or a rocket, among others, to overcome some sections of the levels.</p><p>Graphics and sound remain faithful to the cartoony origins of the mascot.</p>"}]