[{"name":"J.R.R. Tolkien's Lord of the Rings: Volume One","year":1994,"developer":"Interplay Productions, Inc.","url":"5#J/J.R.R.%20Tolkien%27s%20The%20Lord%20of%20the%20Rings%20-%20Volume%201%20%28NA%29.sfc","filesize":1048576,"score":5.6,"genres":"Action > Role-playing (RPG) > Diagonal-down > Fantasy > Licensed","desc":"<p><em>J.R.R Tolkien's Lord of the Rings - Volume One</em> is a video game adaptation of the famous book, which is quite different from the  computer game of the same name.</p><p>The events that occur in the game roughly correspond to those depicted in the first volume of the <em>Lord of the Rings</em> trilogy, though the game ends before the final chapters of the first book. The player takes control of Frodo Baggins, who must find companions for his quest. The game's locations, individual objectives, missions, and quests are structured quite differently from those of the computer release. Most of the quests involve retrieving items for various NPCs, thus advancing the narrative.</p><p>The gameplay is also different from the computer version, being less heavy on character development (role-playing), and more oriented towards combat, which is action-based in this release. Though up to three characters join Frodo on his quest, one player can control only one character at a time. Multiplayer has been therefore added to the game, with up to four players controlling the characters in the party simultaneously.</p><p>The game cartridge does not contain any RAM/battery; games can only be saved by remembering a code. The code must later be entered into the game to continue.</p>"},{"name":"Jack Nicklaus' Unlimited Golf & Course Design","year":1992,"developer":"Sculptured Software, Inc.","url":"5#J/Jack%20Nicklaus%20Golf%20%28NA%29.sfc","filesize":524288,"score":6.8,"genres":"Sports > Golf","desc":"<p>Another golf game, featuring an extensive course designer as a value-added feature. Similar to Links or PGA Tour Golf, both of which came out around the same time.</p>"},{"name":"Jaki Crush","year":1992,"developer":"Compile"},{"name":"Jaleco Brawler's Pack","year":2017,"developer":""},{"name":"Jaleco Rally: Big Run - The Supreme 4WD Challenge","year":1991,"developer":"Jaleco Ltd."},{"name":"James Bond Jr.","year":1992,"developer":"Gray Matter Inc.","url":"5#J/James%20Bond%20Jr.%20%28NA%29.sfc","filesize":524288,"score":6.1,"genres":"Action > Side view > Arcade > Shooter > Licensed","desc":"<p>This adaptation of the animated TV series differs significantly from its NES namesake. The nephew of Agent 007 must foil the plans of malevolent S.C.U.M. agents, who are hunting for rare artifacts that would allow them to dominate the world. Unlike the NES game, this version is a more action-oriented side-scrolling game without detailed mission objectives or puzzle-solving.</p><p>The game consists of three levels, each beginning with a section in which Bond pilots a helicopter, a boat, and a jet, respectively. These are controlled in arcade-like fashion, similarly to side-scrolling shooters. Enemies must be dealt with using weapons mounted on the craft. Various hazards are scattered through the stages, requiring the player to react quickly in order to stay alive.</p>"},{"name":"James Pond 2: Codename: RoboCod","year":1993,"developer":"Vectordean Ltd."},{"name":"James Pond 3","year":1994,"developer":"Millennium Interactive Ltd."},{"name":"Jammit","year":1994,"developer":"GTE Vantage Inc."},{"name":"Jelly Boy","year":1994,"developer":"Probe Software Ltd."},{"name":"Jeopardy!","year":1992,"developer":"Park Place Productions"},{"name":"Jeopardy! Deluxe Edition","year":1994,"developer":"Park Place Productions","url":"5#J/Jeopardy%21%20-%20Deluxe%20Edition%20%28NA%29.sfc","filesize":524288,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Game show / trivia / quiz > Menu structures > Licensed","desc":"<p><em>Jeopardy! Deluxe Edition</em> is an updated version of it's Jeopardy! predecessor which features over 3,500 different new questions along with the standard features of Jeopardy such as Daily Doubles, a digitized likeness of the host, Alex Trebek and even the theme music.</p><p>Like it's previous version, the player uses the buttons to buzz in and using the d-pad to highlight letters and spelling out their answers. The player can also play against two friends or play against the computer A.I. instead.</p>"},{"name":"Jeopardy! Sports Edition","year":1994,"developer":"Park Place Productions","url":"5#J/Jeopardy%21%20-%20Sports%20Edition%20%28NA%29.sfc","filesize":524288,"score":6.6,"genres":"Puzzle > Side view > Fixed / flip-screen > Game show / trivia / quiz > Menu structures > Licensed","desc":"<p>This version of Jeopardy! focuses more on sports related themes with 700 different categories and 3,500 questions to answer related to sports such as baseball, football, hockey, etc., along with many other sub-categories such as players, sports equipment and the like.</p><p>The rules are still the same as the others, there are three rounds where the player buzzes in to answer and spells out the answers using the D-pad. It features digitized photography of sports-themed clad contestants such as baseball, football, volleyball and the like along with authentic digitized studio surroundings and the likeness and voice of long time Jeopardy! host, Alex Trebek.</p>"},{"name":"Jetsons, The: Invasion of the Planet Pirates","year":1994,"developer":"Sting, Inc.","url":"6#Jetsons%2C%20The%20-%20Invasion%20of%20the%20Planet%20Pirates%20%28USA%29.sfc","filesize":1048576,"score":6.7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Puzzle elements > Licensed > Regional differences","desc":"<p>George Jetson was about to run out to work when his pal Captain Zoom appears out of thin air. Zoom tells him that Zora, the leader of SPREE (\"Space Pirates Revelling in Evil Enterprises\"), is planning on looting this solar system of all its resource! Unfortunately, in his last encounter with Zora, Zoom has used up all his strength and now he is powerless so he asks George to take over. He gives George his Pneumo Osmatic Precipitator (or P.O.P.) and bids him good luck.  Can George save his family and this galaxy?</p><p>Guide George through 9 stages of intergalactic action armed with only his wits and the P.O.P....which is like a super vacuum. The P.O.P. can be used as a traveling tool by sucking onto walls and ceilings, it will enable George to climb up and across platforms.  As a weapon, the P.O.P. can be used to suck up blocks or enemies and spit out at other enemies. George can also use the P.O.P. to breathe under water! Talk about multi-functional!</p><p>George's conditions are indicated by the number of hearts he has at the top of the screen.  By collecting more hearts, it will refill George's health. Food items will increase your score and by getting a high enough score in each stage, you may get to play a bonus game.</p>"},{"name":"Jikkyō Oshaberi Parodius","year":1995,"developer":"Konami Co., Ltd."},{"name":"Jikkyō Power Pro Wrestling '96: Max Voltage","year":1996,"developer":"Konami Co., Ltd."},{"name":"Jim Lee's WildC.A.T.S: Covert Action Teams","year":1995,"developer":"Beam Software Pty., Ltd."},{"name":"Jim Power: The Lost Dimension in 3D","year":1993,"developer":"Loriciel SA","url":"5#J/Jim%20Power%20-%20The%20Lost%20Dimension%20in%203D%20%28NA%20-%20Enhanced%20Version%29.sfc","filesize":2097152,"score":7.2,"genres":"Action > Side view > Top-down > Platform > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>In in this altered and expanded port of the original Amiga title,  Earth has always blocked \"The Lost Dimension\" and now its alien guardian, Vaprak, threatens to annihilate Earth to free its brethren in the dimension.  Special Agent Jim Power has been sent in alone to send Vaprak back into \"The Lost Dimension\".</p><p>Armed with your upgradeable blaster, space ship, and jet pack, you will blast and jump you way across \"The Lost Dimension\" taking down its inhabitants before any contact from them takes your life.</p>"},{"name":"Jimmy Connors Pro Tennis Tour","year":1992,"developer":"Blue Byte Software GmbH"},{"name":"Jimmy Houston's Bass Tournament U.S.A.","year":1995,"developer":"Nexus Interact, Ltd."},{"name":"Joe & Mac 2: Lost in the Tropics","year":1994,"developer":"Data East Corporation","url":"8#Nintendo%20-%20SNES.zip/Joe%20%26%20Mac%202%20-%20Lost%20in%20the%20Tropics%20%28USA%29.zip","filesize":1,"score":7.3,"genres":"Action > Side view > Top-down","desc":"<p>This sequel puts you back into the roles of the cavemen, Joe and Mac. This time, a caveman named Gork has stolen the crown belonging to the Chief of Kali Village, and it's up to you to retrieve it by using the 7 Rainbow Stones you will collect on your journey.</p><p>Along the way, you will fight dinosaurs, cavemen, and other prehistoric enemies as your travel through the jungle, or through the ice and snow, or even through a volcanic wasteland. Along the way, you can pick up upgrades for your club, or pick up projectiles from eating certain health-recovery items. In some levels, you'll ride in a stone cart, trying to hope over gaps and avoid enemies as you try to reach the end.</p><p>The sequel to the first Joe &amp; Mac adds several new features to the predecessor's formula. You can now collect coins in the levels to purchase items from Tiki Village, such as meat to recover your health, or even remodel your hut back at your home village. The game also uses a password system to track your progress. The game also shifts to an overhead map so you can wander to whichever level you wish, and return to completed levels to earn more money or power-ups.</p>"},{"name":"Joe & Mac: Caveman Ninja","year":1991,"developer":"Data East Corporation","url":"6#Joe%20%26%20Mac%20%28USA%29.sfc","filesize":1048576,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Joe &amp; Mac: Caveman Ninja</em> features the characters Joe and Mac as cavemen ninjas in a multi-level platform area where the player has to jump and club incoming enemies. They can also throw at them from distance using such weapons as boomerangs, bones, fire, flints, electricity and stone wheels. The objective of the game is to rescue a group of girls who were kidnapped by a rival tribe.</p>"},{"name":"Joe & Mac: Ultimate Caveman Collection","year":2017,"developer":""},{"name":"John Madden Football","year":1991,"developer":"Park Place Productions","url":"5#J/John%20Madden%20Football%20%28NA%29.sfc","filesize":524288,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>This update of the John Madden football series offers several new features over its predecessor: instant replays, different weather conditions, player injuries and the ability to review and overturn pass interference calls.</p><p>Play modes include Pre-Season, Regular Season, Playoffs and Sudden Death. There are 28 teams plus one All-Madden team.</p>"},{"name":"John Madden Football '93","year":1992,"developer":"Looking Glass Technologies, Inc.","url":"5#J/John%20Madden%20Football%20%2793%20%28NA%2C%20Rev%201%29.sfc","filesize":1048576,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>Another update in the Madden football series. New this time are some graphics and animations, including an animated coin toss and some player moves. New gameplay features are no-huddle offense and a stop clock play.</p><p>There are 28 teams from the '92-'93 season, two All Madden teams and 8 Greatest Ever teams.</p><p>Game modes are the usual pre-season, regular season, sudden death and playoffs. A special playoff mode for the 8 greatest teams is also available.</p><p>The Genesis version features John Madden's digitized commentary speech and a battery-backed RAM for saving playoff results and player stats.</p>"},{"name":"Jojo no Kimyou na Bouken","year":1993,"developer":"Winky Soft Co., Ltd.","url":"5#J/Jojo%20no%20Kimyou%20na%20Bouken%20%28English%20Translated%2C%20Rev%201%29.sfc","filesize":1572864,"score":"","genres":"Role-playing (RPG) > 1st-person > 3rd-person (Other) > Anime / Manga > Turn-based > Sci-fi / futuristic","desc":"<p>In a futuristic world, there lives a young man named Jojo who holds a terrible power within: the power to drain life from enemies. This power is somehow connected to the evil vampire Dio who is terrorizing the world. Jojo must find faithful companions on his quest to restore peace and to master the power within himself.</p><p>One of the earliest titles based on the anime series <em>Jojo's Bizarre Adventures</em>, this is a role-playing game with somewhat simplified mechanics and navigation system reminiscent of Japanese adventures. Combat is turn-based and is viewed from first-person perspective. Jojo and his party members possess the so-called \"stands\", super-powerful creatures they can summon during fights. Before each fight, the player has to choose one of five available tarot cards to determine the amount of luck and compatibility of the stands in the battle. Equipment and items can be bought in stores.</p>"},{"name":"Judge Dredd","year":1995,"developer":"Probe Entertainment Ltd.","url":"7#Judge%20Dredd%20%28Europe%29.sfc","filesize":2097152,"score":6.5,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>Judge Dredd</em> is a platform action game based on the British comic book character of the same name and the 1995 movie that tarnished that name. The game was a multi system release so it fits the standard console jump/shoot/duck formula although it does add some unique twists such as wounding enemies so that they surrender and can be arrested.</p><p>The initial levels follow the plot of the movie with futuristic lawman Judge Dredd framed and sent to the Aspen penal colony from which he must escape and prove his innocence. Following the fight at the top of the Statue of Liberty that ended the film, the game continues on with levels and characters inspired by the comic book culminating with a battle against the Dark Judges on Deadworld.</p>"},{"name":"Jungle no Oja Tar-chan","year":1994,"developer":"Kuusoukagaku Corp.","url":"5#J/Jungle%20no%20Ouja%20Tar-chan%20-%20Sekaimanyuu%20Daikakutou%20no%20Maki%20%28JP%29.sfc","filesize":1048576,"score":"","genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Platform > Licensed","desc":"<p><em>Jungle no Ōja Tar-chan</em> is a 2D platform game, similar to the Super Mario Bros. series. Here you also have to collect some fruits (100 nuts, to be more accurate) to earn a extra life. The sprites of the characters are in the anime style, giving emphasis on the main character and the bosses. During the game you be able to swing on the jungle vines, fight evil army soldiers - with kicks and punches - and battle a boss at the end of each level. Sometimes you will get some help from your friends, like Cheetah, and some other jungle animals.</p>"},{"name":"Jungle Strike","year":1993,"developer":"Electronic Arts, Inc.","url":"7#Jungle%20Strike%20%28Europe%29.sfc","filesize":2097152,"score":7.9,"genres":"Action > Diagonal-down > Isometric > Flight / aviation > Helicopter > Hovercraft > Motorcycle","desc":"<p>Some time after Operation Desert Strike, Ibn Kilbaba, son of Kilbaba Sr., threatens to annihilate America. After his father was killed, the people who were under his control sent his son running off, along with his father's money and nuclear weapons program. Kilbaba, more ruthless than his father, longs for revenge for his father's death and decides to shed the blood of those who killed him, the Americans. Already armed, Kilbaba hires Carlos Ortega to help him set up his nuclear weapons program, deep in South America. Carlos Ortega, the world's most notorious drug lord, also yearns to seek revenge. With his own private army, armed with the most hi-tech weapons, he's ready to fight America at all costs. </p><p>Because of this threat, the player is hired again to battle these two characters, following their trail in the jungles of South America. Armed with the Comanche, numerous other vehicles, and destructive weapons, they will have to take out their private army, blowing up the enemy with Hellfire missiles, Hydra rockets, or chain guns, using watercraft to launch mines at enemy ships, or pulling off a drive-by on the enemy with guns on the side.</p>"},{"name":"Jungle Wars 2: Kodai Mahō Atimos no Nazo","year":1993,"developer":"Atelier Double Co. Ltd."},{"name":"Jurassic Park","year":1993,"developer":"Ocean of America, Inc.","url":"5#J/Jurassic%20Park%20%28NA%20-%20SRAM%20Patch%29.sfc","filesize":2097664,"score":7.1,"genres":"Action > 1st-person > Diagonal-down > 2D scrolling > Licensed","desc":"<p>The SNES game based on the film <em>Jurassic Park</em> is an action title that combines top-down and first-person perspectives.</p><p>Playing as Dr. Alan Grant, the player's ultimate goal is to escape the Jurassic Park island. To reach that goal, several other tasks must be completed, including restoring power to the park and destroying a Velociraptor nest. </p><p>The large game world is seen from a top-down view and can be freely explored. Some areas are not accessible from the beginning, however. To enter them, keycards must be found or some special goal be completed, like rebooting the computer system and using it to open certain gates. Dr. Grant can defend himself against the many free-roaming dinosaurs with a variety of weapons, including an electroshock gun, a shotgun, rocket launcher, gas grenade launcher and bola gun. All weapons except the electro gun require ammo to work. A radar at the bottom of the screen helps in detecting approaching dinosaurs, but will only work once the park's motion detectors have been activated.</p><p>Upon entering one of the park's buildings, the game view switches to a scrolling first person perspective, reminiscent of early first person shooters like Wolfenstein 3D. Just like outside, dinosaurs lurk in the corridors, and the same guns as in the overworld map can be used to destroy them. Many buildings consist of several floors, with elevators connecting them. Some rooms are pitch black and can only be entered when in possession of night vision goggles.</p><p>The game supports the SNES mouse for the first-person sections and the computer system interface.</p>"},{"name":"Jurassic Park Part 2: The Chaos Continues","year":1994,"developer":"Ocean Software Ltd.","url":"5#J/Jurassic%20Park%20Part%202%20-%20The%20Chaos%20Continues%20%28NA%29.sfc","filesize":2097152,"score":6.6,"genres":"Action > Side view > Platform > Shooter > Licensed","desc":"<p>One year after the events of the Jurassic Park, John Hammond wants to bring Jurassic Park back and he sends Dr. Alan Grant to aid a team of heavy armed men down to the former park to restore order.  Meanwhile, Biosyn Corp has sent men down the former park so the company can gain control of the park for themselves.</p><p>In this 2D shooter, Player 1 controls Dr. Alan Grant and Player 2 controls Tactical Sergeant Michael Wolfskin and alone or together you face off against the free roaming dinosaurs of the once known Jurassic Park along with the members of the Biosyn Corp.  Your player always has six weapons.  Your primary machine gun and cattle prod are unlimited and most take down both the humans and dinosaurs but some only work the dinosaurs such as the cattle prod.  Most of the levels are non linear so you must explore different pathways to complete the mission you have selected once you have once you selected either one or two player mode.</p>"},{"name":"Justice League: Task Force","year":1995,"developer":"Sun Corporation of America","url":"5#J/Justice%20League%20Task%20Force%20%28NA%29.sfc","filesize":2621440,"score":6.3,"genres":"Action > Side view > 2D scrolling > Fighting > Licensed","desc":"<p>The comic-book superhero team of the Justice League consists of Superman, Batman, Wonder Woman, The Flash, Aquaman, and Green Arrow. They must defeat the evil Darkseid and his henchmen, Despero and Cheetah. But before they can reach Darkseid, the members of the Justice League must battle each other. You can follow this storyline in Story Mode, or if you prefer to just hold exhibition fights you can choose Battle Mode which allows you to use the villian characters as well.</p>"},{"name":"Jutei Senki","year":1993,"developer":"TamTam Co., Ltd."}]