[{"name":"Kai: Tsukikomori","year":1996,"developer":"Pandora Box"},{"name":"Kaite Tsukutte Asoberu: Dezaemon","year":1994,"developer":"Athena Co., Ltd."},{"name":"Kaizō Chōjin Shubibinman Zero","year":1997,"developer":"NCS Corporation"},{"name":"Kakinoki Shōgi","year":1995,"developer":"ASCII Corporation"},{"name":"Kamaitachi no Yoru","year":1994,"developer":"Chunsoft Co., Ltd."},{"name":"Kamen Rider","year":1993,"developer":"Sun L"},{"name":"Kamen Rider SD: Shutsugeki!! Rider Machine","year":1993,"developer":""},{"name":"Kat's Run: Zen-Nippon K Car Senshuken","year":1995,"developer":"Varie Corporation"},{"name":"Kawa no Nushi Tsuri 2","year":1995,"developer":""},{"name":"Kawasaki Caribbean Challenge","year":1993,"developer":"Park Place Productions","url":"5#K/Kawasaki%20Caribbean%20Challenge%20%28NA%29.sfc","filesize":1572864,"score":5.3,"genres":"Racing / Driving > Top-down > 2D scrolling > Direct control > Motorcycle > Naval / watercraft > Licensed","desc":"<p>Race a Kawasaki Ninja Motorcycle or Jet Ski over 3 different islands in the Caribbean. When you're ready, take the Challenge to see how good you really are! Look down at your vehicle from a bird's eye view and cross bridges, make sharp turns, knock other opponent's off the road (or ocean) and get first place, if you can! You get to choose from a selection of 3 Motorcycles and 3 Jet Ski's when you race. You must complete 5 laps on each level and try to get first place!</p>"},{"name":"Kawasaki Superbike Challenge","year":1995,"developer":"Lankhor","url":"5#K/Kawasaki%20Superbike%20Challenge%20%28NA%29.sfc","filesize":1048576,"score":6.5,"genres":"Racing / Driving > 1st-person > Motorcycle > Licensed","desc":"<p><em>Kawasaki Superbike Challenge</em> is a motorcycle racing game that uses the same engine as F1. It includes 14 standard-length race tracks, plus the Suzuka 8 Hours endurance race, available in both training and Championship modes. The game is unlicensed (except by Kawasaki), so all riders and teams are fictional.</p><p>The game now has more polygonal roadside objects than <em>F1</em>, and there is still a Turbo mode, allowing for faster racing at the expense of some of the detail. You have the ability to turn on or off weather (during rainy days the graphics are darker and the bike has less traction). The number of laps on each course can be 5, 10 or 15, and there are 4 skill levels. Some changes have been made to how the vehicle handles, to emphasize the switch from cars to bikes.</p>"},{"name":"Keeper","year":1994,"developer":"Success Corp."},{"name":"Ken Griffey Jr Presents Major League Baseball","year":1994,"developer":"Software Creations Ltd.","url":"5#K/Ken%20Griffey%20Jr.%20Presents%20Major%20League%20Baseball%20%28NA%2C%20Rev%201%29.sfc","filesize":2097152,"score":7.6,"genres":"Simulation > Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p><em>Ken Griffey Jr Presents Major League Baseball</em> is a baseball simulation featuring Ken Griffey Jr. of the \"Nintendo Owned\" Seattle Mariners. This licensed game allows you to play with all 28 Major League Teams in their own stadiums and over 700 player names (not likenesses). You control your pitcher or batter as well your fielders. The game allows you to play and save a 26, 78 or 162 game season.</p>"},{"name":"Ken Griffey Jr.'s Winning Run","year":1996,"developer":"Rare Limited","url":"8#Nintendo%20-%20SNES.zip/Ken%20Griffey%20Jr.%27s%20Winning%20Run%20%28USA%29.zip","filesize":1,"score":7.3,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p><em>Ken Griffey Jr.'s Winning Run</em> is a licensed arcade baseball game featuring MLB's own Ken Griffey Jr. Released in 1996, it contains all 28 MLB teams and logos from that time, with rosters containing fictitious names for the players (Ken Griffey Jr being the only real player in the game).</p><p>Next to exhibition games, there are different game modes to compete in. In the MLB Challenge, players start with a weak team and go against every major MLB club to go up the rankings. There is also a complete World Series, All-Star games and the MLB League. In the league modes up to eight players can choose a team and play a season of 26, 52 or 162 games. Between matches players can change the line-up and rotation, and trade away players.</p><p>Gameplay is fairly tradition, with fielding, pitching, batting and baserunning. Next to fastball and curveballs, there are six different pitches such as Super Fast, Screwball, Super Curve, Slider, Change Up and Knuckleball.</p>"},{"name":"Kendo Rage","year":1993,"developer":"Affect Co.,Ltd","url":"5#K/Kendo%20Rage%20%28NA%29.sfc","filesize":1048576,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Platform","desc":"<p>Josephine is a teenage girl who is currently attending <em>Honest Osaki's Kendo School and Used Car Sales</em> to learn Kendo swordsmanship. The old man Osaki teaches his students the art of psychic powers so they can better defeat the forces of evildoers. Josephine is given the Zopikki Talisman; a powerful artifact which transforms Josephine's normal self into a battle warrior. Gripping the bamboo sword and focusing her psychic powers, Josephine must defeat ghosts, pandas and all kinds of other strange creatures which look to cause trouble.</p><p>In <em>Kendo Rage</em>, the player takes control of Josephine. She can move left and right, jump, duck and attack with her bamboo sword. Josephine's psychic powers are shown on a bar and recharge gradually at a steady pace, changing color as they do. Depending on the color, an attack done will use up the current psychic energy and let loose a stronger attack, usually a projectile. Additionally, Josephine can summon flames around herself during a rush attack, at the cost of some energy. The game lasts seven levels, with a boss finishing off each level.</p>"},{"name":"Kenyū Densetsu Yaiba","year":1994,"developer":""},{"name":"Kero Kero Keroppi no Bōken Nikki: Nemureru Mori no Keroleen","year":1994,"developer":""},{"name":"Kevin Keegan's Player Manager","year":1993,"developer":"Anco Software Ltd."},{"name":"Kick Off 2","year":1991,"developer":"Anco Software Ltd."},{"name":"Kick Off 3: European Challenge","year":1994,"developer":"Anco Software Ltd."},{"name":"Kid Klown in Crazy Chase","year":1994,"developer":""},{"name":"Kidō Butōden G Gundam","year":1994,"developer":"Pandora Box"},{"name":"Kidō Keisatsu Patlabor","year":1994,"developer":"BEC Co., Ltd."},{"name":"Kidō Senshi Gundam F91: Senki 0122","year":1991,"developer":"Nova Games Ltd."},{"name":"Kidō Senshi V Gundam","year":1994,"developer":"Tose Co., Ltd."},{"name":"Kikou Keisatsu Metal Jack","year":1992,"developer":"Atlus Co., Ltd."},{"name":"Killer Instinct","year":1995,"developer":"Rare Limited","url":"6#Killer%20Instinct%20%28USA%29%20%28Rev%201%29.sfc","filesize":4194304,"score":7.7,"genres":"Action > Side view > 2D scrolling > Fighting > Fantasy > Sci-fi / futuristic","desc":"<p>In the distant future, a monopolistic and technological corporation called Ultratech organizes a fighting tournament known as \"Killer Instinct\". Many fighters answer the challenge to participate, including several of Ultratech's experimental warriors. To increase the tournament's challenge, Ultratech utilizes a technology that can create bridges between alternate dimensions, releasing a creature known as Eyedol. Eyedol is a two-headed ancient warrior that was imprisoned along with his bitter rival, Gargos. Some warriors enter the tournament to seek glory or escape. Other fighters are attempting to bring an end to Ultratech's corruption. </p><p><em>Killer Instinct</em> is a 2D versus fighting game that features 3D rendered sprite based graphics. Players choose from ten characters: Orchid, Cinder, Jago, Glacius, Fulgore, Riptor, Sabrewulf, Spinal, T.J. Combo, and Thunder. The game is known for its heavy combo-based fighting system, allowing players to pull off moves that land a high number of hits on their opponent, the highest being the \"Ultra Combo\". The game also features combo breakers, finishing moves and stage fatalities, double energy bars, and a dance-music inspired techno soundtrack.</p>"},{"name":"King Arthur & the Knights of Justice","year":1994,"developer":"Manley & Associates, Inc.","url":"5#K/King%20Arthur%20%26%20The%20Knights%20of%20Justice%20%28NA%29.sfc","filesize":2621440,"score":"","genres":"Action > Top-down > Arcade > Fantasy > Licensed","desc":"<p>Based on the cartoon series of the same name, King Arthur and the knights of Camelot have been encased inside glass by Morgana Le Faye. Only the Spell of Spells would be able to free them. Merlin, knowing that the world would come to ruin without King Arthur uses his magic to search all of space and time for replacements. Finding the New York Knights football team and their quarterback, Arthur King, Merlin transports them back to Camelot and gives them magical armor. Transformed into; Sir Arthur, Sir Breeze, Sir Brick, Sir Darren, Sir Gallop, Sir Lancelot, Sir Lug, Sir Phil, Sir Tone, Sir Trunk, Sir Wally and Sir Zeke, they must rescue the real Knights of the Round Table. In order to do so, the Arthur must recover the 12 keys of truth from Morgana's lieutenants each of which can only by touched by a specific knight. However in order to be able to defeat them, Arthur must first recover Excalibur and overcome other tasks.</p><p><em>King Arthur &amp; the Knights of Justice</em> is a top-down action game. It might be mistaken for an RPG, however the abilities of characters do not change over the course of the game. Players control Arthur King and can recruit two additional party members from the knights. Each knight has his own statistics in various areas including: Life Force, Defense, Strength and Speed. These party members are computer controlled with their own energy bars. Arthur can move up, down, left and right, block with his shield and parry with his shield. Arthur can swing his sword at any time but the damage inflicted depends on how much strength bar he has. The strength bar replenishes itself naturally over time, but is depleted every time Arthur swings his sword. Each knight including Arthur has a health bar, when this bar runs out, the knight is defeated. It can be restored by returning to Camelot or using items such as healing herbs. Arthur can carry a variety of different items accessible from the menu. Other menu functions include looking at the map, changing preferences and reviewing the statistics of the knights.</p>"},{"name":"King Arthur's World","year":1992,"developer":"Argonaut Software Ltd.","url":"6#King%20Arthur%27s%20World%20%28USA%29.sfc","filesize":524288,"score":7.3,"genres":"Strategy > Side view > Real-time > Fantasy","desc":"<p>This is a 2D side scrolling strategy game.  You take the role of King Arthur and lead your army into battle against evil.  You'll travel to many worlds including fighting dark knights, underworld orcs, and cloud giants.  One of the few games that is Super NES Mouse capable.</p><p>You are given a certain amount of troops each level.  Passwords are used to save your progress between levels.  The levels have enemies you must thwart, traps you should avoid, and gold to be won.</p>"},{"name":"King of Dragons, The","year":1994,"developer":"Capcom Co., Ltd.","url":"5#K/King%20of%20Dragons%20%28NA%29.sfc","filesize":2097152,"score":6.9,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Fantasy","desc":"<p><em>The King of Dragons</em> is a fantasy themed side-scrolling beat'em up. There are five different characters to choose from: a fighter, a cleric, an elf, a wizard and a dwarf. All characters have different strengths and weaknesses in speed, attack power and magic. After choosing an appropriate character, the player has to fight his way through numerous short levels guarded by an equally high number of bosses; gaining better weapons and shields/magic in the process.</p>"},{"name":"King of the Monsters","year":1992,"developer":"SNK Corporation"},{"name":"King of the Monsters 2: The Next Thing","year":1993,"developer":"SNK Corporation","url":"5#K/King%20of%20the%20Monsters%202%20%28NA%29.sfc","filesize":2097152,"score":6.6,"genres":"Action > Side view > Beat 'em up / brawler > Fighting","desc":"<p>The object of <em>King of the Monsters 2</em> is similar to its predecessor. Choose from three monsters which include a large lizard, a large robotic ape, and a huge mutant human. Then walk through each city, making sure to destroy everything in site, including planes, buildings, and other creatures. When smashed, some buildings reveal power-ups that make your character more powerful. At the end of each city, you go head-to-head with the boss creature. There are small stages in between where you fight a second monster for bonus points, or you fall from the sky and land underwater where you try to collect points and power-ups while falling.</p>"},{"name":"Kinnikuman: Dirty Challenger","year":1992,"developer":""},{"name":"Kirby Super Star","year":1996,"developer":"HAL Laboratory, Inc.","url":"8#Nintendo%20-%20SNES.zip/Kirby%20Super%20Star%20%28USA%29.zip","filesize":1,"score":8.2,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy","desc":"<p><em>Kirby Super Star</em> is a platformer in the Kirby series, distinguished by having an unusually versatile character, who can fly and gain the abilities of his foes.</p><p>The game is actually a set of seven main games: Spring Breeze, Dynablade, Gourmet Race, The Great Cave Offensive are unlocked at first, and later Metaknight's Revenge, Milky Way Wishes and The Arena become available, as well as a couple of minor minigames.</p><p>These are all typical Kirby platformers, each one with its own set of levels and different gameplay. In most of them Kirby can consume monsters and learn their special abilities, but in Milky Way Wishes abilities are instead collected in a manner similar to Metroid games. Offensive Cave features levels with various obstacles, hidden treasures and some elementary lever-pulling kind of puzzle solving. Metaknight's Revenge is the only game on the cartridge with a (fairly strict) timer. The Arena is a \"boss rush\" mode, asking players to defeat every boss in the game with limited health refills and on one life.</p><p>The game also has a two-player cooperative play option, which has given it a reputation of a party game.</p>"},{"name":"Kirby's Avalanche","year":1995,"developer":"HAL Laboratory, Inc.","url":"6#Kirby%27s%20Avalanche%20%28USA%29.sfc","filesize":1048576,"score":7.4,"genres":"Puzzle > Side view > Fixed / flip-screen > Real-time > Falling block puzzle > Licensed","desc":"<p>The First Annual Dream Land's Avalanche Competition is about to get under way, and as Kirby and a host of characters from the Kirby series, you can join the tournament and become Avalanche king.</p><p><em>Kirby's Avalanche</em> is a Puyo Puyo variant, and has you stacking colored blobs similar in a way to Tetris. When a certain amount of one color is stacked, an explosion occurs and the screen clears of those blobs, which then appear in the other players screen (either the CPU or a second player). When the other player's screen is so full of blobs that they can't make another move, you move onto the next round, and so on until the final boss. The winner of that match is then crowned the Avalanche king.</p>"},{"name":"Kirby's Dream Course","year":1994,"developer":"HAL Laboratory, Inc.","url":"8#Nintendo%20-%20SNES.zip/Kirby%27s%20Dream%20Course%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Sports > Diagonal-down > 2D scrolling > Isometric > Arcade > Golf","desc":"<p><em>Kirby's Dream Course</em> is a mini-golf game featuring the pink blob Kirby. After his adventures in Dream Land Kirby himself becomes the ball, and you must guide him around each hole using the sort of bar system that you see in most golf games. Where this game differs, however, is in the fact that you need to eliminate all on-screen enemies before you can guide Kirby into the hole and complete it. As per usual in golf games, the more strokes it takes you to complete the whole, the lower your score - so make sure you aim Kirby just right!</p><p>You'll find eight courses and a total of sixty-four holes in the game, not including the final showdown with King Dedede, as well as an action-packed two-player mode.</p>"},{"name":"Kirby's Dream Land 3","year":1997,"developer":"HAL Laboratory, Inc.","url":"8#Nintendo%20-%20SNES.zip/Kirby%27s%20Dream%20Land%203%20%28USA%29.zip","filesize":1,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Platform","desc":"<p>That mean old King Dedede is at it again! He's causing his mischief and Dreamland's in trouble! Kirby, the resident hero of Dreamland, sets out to teach Dedede a lesson, this time with the help of many of his good friends!</p><p>But wait! Something's wrong! Dedede doesn't seem to be himself...</p><p>Looks like Kirby has to stop Dedede and find out what is wrong with him! It almost seems like something's controlling him...</p>"},{"name":"Kirby's Star Stacker","year":1998,"developer":"HAL Laboratory, Inc."},{"name":"Kishin Dōji ZENKI: Battle Raiden","year":1995,"developer":"CA Production"},{"name":"Knights of the Round","year":1994,"developer":"Capcom Co., Ltd.","url":"5#K/Knights%20of%20the%20Round%20%28NA%29.sfc","filesize":1572864,"score":7.1,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Europe > Fantasy","desc":"<p>In <em>Knights of the Round</em>, play the role of one of three knights from the Arthurian legends. The three characters are Sir Lancelot, Sir Percival, and of course King Arthur. </p><p>The story tells of a man who pulled the mighty sword Excalibur from a rock which no one else could achieve. This feat signified that he should be king of the Britons and lead them to peace. The trouble is there is mass chaos in the land and the only way Arthur can stop it is to find the holy grail which has been hidden for over a thousand years. Aurthur is joined by Percival and Lancelot on his quest to find the grail. </p><p>The gameplay involves the player to scroll along the screen fighting of enemies with a sword or axe depending on the character. The player can also block and parry with opponents which is done by a simple button press. There are also character development elements in the game where collecting points by killing enemies and picking up gold increase the character's attack and speed. Character's armour and weapons also change when they gain experience.</p>"},{"name":"Kōryu Densetsu Villgust: Kieta Shōjo","year":1992,"developer":"Winky Soft Co., Ltd."},{"name":"Kōryū no Mimi","year":1995,"developer":"Vap Inc."},{"name":"Kōshien 2","year":1992,"developer":"K. Amusement Leasing Co."},{"name":"Kōshien 3","year":1994,"developer":"Magical Company Ltd."},{"name":"Kōshien 4","year":1995,"developer":"Magical Company Ltd."},{"name":"Krusty's Super Fun House","year":1992,"developer":"Audiogenic Software Ltd.","url":"5#K/Krusty%27s%20Super%20Fun%20House%20%28NA%2C%20Rev%201%29.sfc","filesize":524288,"score":6.6,"genres":"Action > Side view > 2D scrolling > Puzzle elements > Licensed","desc":"<p>Krusty the Clown's Fun House has been overrun by rats.  You must help him to herd the rats into trap machines to clear them out.  In order to do so, Krusty must manipulate his environment to set up pathways so that the rats are headed in the right direction.  Objects that Krusty move around include blocks, fans, and pipe pieces.</p><p>The trap machines are operated by other recognizable Simpsons characters:  Bart, Homer, Sideshow Mel, and Corporal Punishment.</p>"},{"name":"Kunio no Oden","year":1994,"developer":"Technos Japan Corp."},{"name":"Kunio-kun no Dodge Ball da yo: Zenin Shūgo","year":1993,"developer":"Technos Japan Corp."},{"name":"Kūsō Kagaku Sekai Gulliver Boy","year":1996,"developer":"Amble Ltd."},{"name":"Kyle Petty's No Fear Racing","year":1995,"developer":"Leland Interactive Media","url":"5#K/Kyle%20Petty%27s%20No%20Fear%20Racing%20%28NA%29.sfc","filesize":3145728,"score":6.8,"genres":"Racing / Driving > Behind view > Automobile > Track racing > Licensed","desc":"<p><em>Kyle Petty's No Fear Racing</em> lets the player race on 28 different stock car tracks and choose from a bevy of customizable cars, each with their own appearances, strengths and weaknesses. There are three different modes to play. A <em>Single Race</em> where the player can choose a car and a track and race one time against a slew of computer opponents. <em>Season</em> lets the player compete in an entire season on all the tracks, earning prize money to buy parts to upgrade their car. They can change parts to maximize performance or even tweak the car such as change gear ratios, spoiler height, tire pressure, etc. </p><p>There is also an option that allows for a two-player head-to-head battle that utilizes a split screen.</p><p>It also features a track editor that lets the player build their own dream track and race on it against computer opponents or against a friend. </p><p>While the game does gear itself in appearances and style towards NASCAR, it doesn't feature any full license from them. It does, however, feature the likeness and endorsement of NASCAR driver Kyle Petty, son of NASCAR legend Richard Petty and grandson of NASCAR pioneer Lee Petty.</p>"},{"name":"Kyūyaku Megami Tensei: Megami Tensei I ・II","year":1995,"developer":"Atlus Co., Ltd."}]