[{"name":"Lady Stalker: Kako kara no Chōsen","year":1995,"developer":"Climax Entertainment"},{"name":"Lagoon","year":1991,"developer":"Zoom, Inc.","url":"5#L/Lagoon%20%28NA%29.sfc","filesize":1048576,"score":6.5,"genres":"Action > Role-playing (RPG) > Top-down > Fantasy","desc":"<p>In the far off world of Lakeland, all was peaceful. This was until an evil being known as Zerah came and polluted all of the water, making people very sick. You play as Nasir, 'The Champion of Light', and are sent into the world to destroy the demons that seem to be linked to the muddy waters. On your quest of good you'll come across people in need and help them. </p><p><em>Lagoon</em> is an action role-playing game. The hero is able to attack, jump, and cast magic. Defeating enemies in action-based combat grants the player character experience points, eventually leading to leveling up. The hero can also equip weapons and armor of various kinds.</p>"},{"name":"Lamborghini: American Challenge","year":1993,"developer":"Titus France SA","url":"5#L/Lamborghini%20American%20Challenge%20%28NA%29.sfc","filesize":524288,"score":7.2,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p>Starting out with just a basic Lamborghini and $6000, your aim is to rise to the top of the 4 divisions of racing through success on 60 race tracks across The United States. In each division there are 20 rival racers, up to 3 of which compete in each race at a time.</p><p>The races also feature lots of local drivers (who can take crucial positions away from you and the other championship drivers), Sunday drivers going at normal speed, and police. Before each race you will be told of the quality of the locals and the likelihood of police presence.</p><p>When police are in the area, speeding beyond 110 km/h could see you branded as an offender, at which point the police will try to ram you off the road, Chase H.Q.-style. You can attempt to reach the end of the race despite this damage (which eventually hampers your speed) or simply pull over and accept a fine and the loss of race points. If the police subsequently stop you, the fine is heavier.</p><p>Each race costs money to enter and your earnings can be boosted by betting on the results with the other championship drivers. If one of you wins, each driver gives you either the amount they bet or the amount you bet, whichever is lower. If a local wins you get your stake back.</p><p>Lots of power-ups can be bought along the way, including tires, radar jammers, engine improvements and nitro boosts. To move up a division you must take the Divisional Challenge, a one-off trek through a tough section within the time limit. You buy a set of 3 passes for this, each allowing one attempt.</p>"},{"name":"Laplace no Ma","year":1995,"developer":"Humming Bird Soft"},{"name":"Last Action Hero","year":1993,"developer":"Bits Studios Ltd.","url":"5#L/Last%20Action%20Hero%20%28NA%29.sfc","filesize":1048576,"score":4.7,"genres":"Action > Racing / Driving > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p>The 16-bit console version of the movie license <em>Last Action Hero</em> combines side-scrolling beat'em up levels with driving sequences.</p><p>Players control action hero Jack Slater through four beat'em up levels. The first two are inspired by the beginning sequence of the movie (the finale of \"Jack Slater III\"), the third by the hotel funeral inside the movie world, and the last by the premiere of \"Jack Slater IV\" in the real world. Slater must move to the level exit before the timer or his energy runs out. Various goons stand in his way and must be defeated through kicks or punches. There are four varieties of enemies in the game, wielding either knives, baseball bats, Molotov cocktails or guns. Spent life energy can be refilled by collecting movie tickets that sometimes fall from the sky. The Genesis version adds an additional twist in the first level: a crosshair will follow Slater around and randomly shoot bullets at him. All except the first stage end with a boss fight. Bosses include The Ripper, a helicopter and main villain Benedict.</p><p>The driving sequences are also seen from the side. Slater's car must avoid hitting cars and trucks parked on the road while trying to destroy enemy cars by jumping over a ramp and then landing on top of them.</p><p>Cutscenes tell the story of the film between levels, following the original plot only loosely.</p>"},{"name":"Last Battle, The","year":1994,"developer":"Atelier Double Co. Ltd."},{"name":"Lawnmower Man, The","year":1993,"developer":"The Sales Curve Ltd.","url":"5#T/The%20Lawnmower%20Man%20%28NA%29.sfc","filesize":1048576,"score":6.2,"genres":"Action > 1st-person > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p><em>The Lawnmower Man</em> is the game based on the 1992 movie of the same name (itself loosely based on a Stephen King short story) starring pre-Bond fame Pierce Brosnan as Dr. Lawrence Angelo, a scientist working for Virtual Space Industries in \"Project 5\", a secret research that attempts to increase the intelligence of primates using psychotropic drugs and VR training. </p><p>With his reluctance to aim the research to military purpose, after one of the chimps escapes and shoots a guard in the process he is given a forced vacation, and while taking notes on the need for experiment with a human subject, he notices Jobe Smith (Jeff Fahey), a simpleton who makes his living on odd jobs such as mowing the grass (hence, the title role). The first experiments quickly increase Jobe's intelligence, and while after an accident Angelo stopped the experiments, The Shop, a secret agency overviewing Project 5, reinserted the drugs responsible for violent behaviour into the program and sped up the treatment. As Jobe starts to develop telekinetic powers, he starts to take revenge on those who abused him before he started the treatments, and plots to take over all computers in the world.</p><p>While the CD version of the game (PC, Mega CD) is an interactive movie, both cartridge versions are platformers, the player taking control of Dr. Angelo or Carla Parkette (mother of Jobe's best friend) in typical side-scrolling shooting action. The player can collect better weapons or data discs, which after collecting a number of them allow to morph into the Virtual Suit, which gives protection against a first hit. The player visits several locations seen in the movie, such as the gas pump and the VSI headquarters. </p><p>The twists of the game are true-3D level connectors, based on the CG sequences of the movie, usually all involving avoiding obstacles (and the occasional shooting) at high speed in the VR world. There are four different (Virtual World, Cyber War, Cyber Run and Cyber Tube), each taking a slightly different approach (Virtual World is seen in first person, the objective being dodging obstacles such as trees and archs and reach the exit, Cyber War similar to Virtual World but with some shooting stops, Cyber Run is seen in third person and requires occasional shooting of obstacles, while Cyber Tube is a fast travel with plenty of enemies in a VR tunnel).</p>"},{"name":"Legend","year":1993,"developer":"Arcade Zone Ltd.","url":"5#L/Legend%20%28NA%29.sfc","filesize":1048576,"score":6.9,"genres":"Action > Side view > Beat 'em up / brawler > Fantasy","desc":"<p><em>Legend</em> is a side-scrolling beat' em up set in a fantasy world. You have to rid the kingdom of Sellech of the king's evil son Clovius, who wants to conquer the kingdom by harnessing the power of the imprisoned soul of Beldor, who once ruled over Sellech as a despot.</p><p>To complete your quest, you must fight your way through numerous enemies using different combinations of slashes and kicks. You cannot perform any throws, but there are different magic attacks and a special attack. The special attack is a ranged attack that consumes a certain amount of energy, whereas the different spells use up magic bags that can be found throughout the game and damage every enemy on screen. Defeated enemies drop different kinds of items such as magic bags , food to replenish your health, money and keys that are used to open treasure chests in some of the bonus-games that take place in-between battles. Naturally, at the end of each stage, a powerful boss is waiting to be defeated.</p>"},{"name":"Legend of the Mystical Ninja, The","year":1991,"developer":"Konami Industry Co. Ltd.","url":"6#Legend%20of%20the%20Mystical%20Ninja%2C%20The%20%28USA%29.sfc","filesize":1048576,"score":8.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Turn-based > Platform","desc":"<p>Goemon (Kid Ying) and Ebisu-Maru (Dr. Yang) are enjoying themselves at home, when they hear about strange spirits sighted at the temple and taking control of the other villagers. Concerned, that a new evil has appeared, the two set out to confront it at the temple. This is just the beginning of a new adventure that will take them Goemon and his partner all across Japan; into moutain villages, amusement parks, castle fortresses and more!</p><p>Players control either Goemon or his partner Ebisu-Maru (or both, in 2 player mode). They sequentially travel through adventure-type villages and side-scrolling jump and run action stages. In the overhead-view villages, enemies must be defeated in order to earn money and other items (which include a weapon-enhancing lucky cat and mystical scrolls). The player is able to attack with their primary weapon and jump. Throwing weapons can also be used, which consume money for each one thrown. Attacking innocent villagers will cause the player to lose money. Money can also be gained (or lost) by visiting one of the numerous mini games, often in houses: which include mazes, whack-a-mole, the lottery, dice, a 3D labyrinth and a game trivia quiz show. Other businesses such as shops, resturants, inns and judo training can also be visited.</p><p>At the end of each village is an \"action area\" which changes the game in a complete side-scroller. One or both players can enter this place, filled with obstacles, traps, enemies and a boss creature. In addition to the regular moves used in town, players also gain the ability to unleash one of four special attacks for each character (if bought beforehand at the judo training center). These consume the scrolls collected in order to use. Additionally, in a 2 player game, characters can ride piggy-back on one another, to avoid getting stuck by a scrolling screen.</p>"},{"name":"Legend of Zelda, The: A Link to the Past","year":1991,"developer":"Nintendo EAD","url":"6#Legend%20of%20Zelda%2C%20The%20-%20A%20Link%20to%20the%20Past%20%28USA%29.sfc","filesize":1048576,"score":8.4,"genres":"Action > Diagonal-down > Anime / Manga > Metroidvania > Puzzle elements > Direct control > Fantasy > Regional differences","desc":"<p>Recently, famine and drought have plagued Hyrule. When all seemed lost, a mysterious wizard, Agahnim, appeared and stopped these strange happenings from occurring. But there is talk that Agahnim now rules the country with his magic, behind the scenes. And then, one night, the Princess of Hyrule, Zelda, calls out for help - and the one who hears her pleas is a young lad named Link.</p><p><em>The Legend of Zelda: A Link to the Past</em> is a top-down action game with puzzle-solving elements (similar to the original Legend of Zelda). Players assume the role of Link, and their goal is to rescue Princess Zelda and save the land of Hyrule. All combat in the game is action-oriented - the player can make the protagonist swing the sword at enemies with a press of a button, or spin the sword around for a more powerful attack by holding down the button until it is charged.</p><p>Progression through the game is done by conquering a series of dungeons - each dungeon has its own special item associated with it, such as the hookshot (which latches onto a far-off object and pulls Link across) or the hammer (which can be used to flatten objects in your way). Most of these dungeons are rendered impassable until the dungeon's particular item is acquired; from there, the rest of the dungeon becomes accessible due to Link's latest new ability. The bosses of each dungeon are also themed to that level's particular item.</p><p>Link starts out with only three units of health; however, these can be increased by defeating dungeon bosses, which give one additional heart container, or by finding four 'pieces of heart'; which can be given for anything from passing a small trial to winning a mini-game. Some of Link's items also use magic - this can be refilled with collectible green magic pots. After defeating the initial three dungeons, Link gains access to the Dark World - many puzzles and difficulties come from alternating between the Light World (Hyrule) and the Dark World to make his way past previously impassable obstacles.</p>"},{"name":"Lemmings","year":1991,"developer":"DMA Design Limited","url":"5#L/Lemmings%20%28NA%2C%20Rev%201%29.sfc","filesize":1048576,"score":7.8,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Point and select > Fantasy","desc":"<p>Your task is to rescue the Lemmings across 120 levels of fast-paced puzzling. These creatures simply walk blindly through the world in the hope of reaching safety at the end of the level - unfortunately, these levels include steep drops, gaps in the ground, barriers, and rivers amongst other hazards.</p><p>You are in control not of any individual Lemming, but of a cross-hair, which can be moved over any of the Lemmings. Along the bottom is a selection of functions that can be assigned to a Lemming, including climbing, floating, and bashing. You must click to select the appropriate function, then click on the Lemming to activate it. Each level has a different range of skills on offer, a different amount of Lemmings, and a different percentage target in order to progress.</p>"},{"name":"Lemmings 2: The Tribes","year":1994,"developer":"DMA Design Limited","url":"5#L/Lemmings%202%20-%20The%20Tribes%20%28NA%29.sfc","filesize":2097152,"score":7.9,"genres":"Puzzle > Side view > 2D scrolling > Real-time > Platform > Multiple units/characters control > Point and select","desc":"<p>The sequel to Lemmings has a plot describing how the Lemmings have split into 12 distinct tribes. Each tribe has its own landscape and cultural identity - they include Egyptian, Circus, and Highland. However, Lemming Island is now in danger, and you must complete 10 levels for each tribe in order for them to reunite and reassemble the Talisman from the 12 pieces.</p><p>Across the 120 levels, there are over 60 skills, although no more than 10 are in use on each screen. The Classic tribe has the ones from the original and is perhaps the best option for first-time players. </p><p>The others range from digging methods such as a scooper (diagonally downwards) and club basher (horizontal), building skills such as a planter (takes time to produce the desired raise to the landscape) and a sand pourer, and various methods of movement including a Pole-Vaulter and a Skater (the only Lemmings who can cross ice). Some of these are only subtly different from others, and their exact uses are unclear, but there are 4 Trainer levels where you can select any combination of skills and experiment.</p><p>Unlike the first game, the player is rewarded for saving as many Lemmings as possible, rather than simply passing or failing. The ultimate aim is to save all 60 Lemmings through all levels, thereby earning a Gold Medal for that tribe - Silver and Bronze are also on offer. The player can also go back over levels in the hope of saving more Lems. </p><p>Because there are 12 tribes, and the player can switch between them at any point, you have to be stuck 12 times to be unable to progress. The game saves progress rather than using passwords as in the first game.</p>"},{"name":"Lennus II: Fūin no Shito","year":1996,"developer":"Fill in Café Co., Ltd."},{"name":"Lester the Unlikely","year":1994,"developer":"Visual Concepts Entertainment, Inc.","url":"5#L/Lester%20the%20Unlikely%20%28NA%29.sfc","filesize":1048576,"score":5.8,"genres":"Action > Side view > Platform","desc":"<p>One day Lester was walking through Seaport City's loading docks reading the new issue of his favorite comic, \"Super Duper Hero Squad.\"  Feeling a little tired from playing video games late the night before, he looked around for a comfortable place to finish his comic.</p><p>Without thinking, Lester stretched out on a pallet that was ready for loading onto a nearby freighter.  And fell asleep.</p><p>Boy, did he pick a bad place to take  a nap.  Several hours out of port he woke up and found himself in deep trouble (and more than a little seasick).  The ship's captain believed his story about being an accidental stowaway.  But... only in cases of extreme medical emergency could the ship return to port.  And Lester wasn't that seasick.  Yet...</p><p>So, he was along for the ride...  until the first port of call.  But as chance would have it, pirates hijacked and scuttled the freighter.  Luckily enough, Lester found a life vest before the ship sank and swam for the nearest tropical island.</p><p>Just before reaching the beach Lester passed out from sheer exhaustion.  Now, his real adventure begins...</p><p>It is up to you to help Lester get back home.</p><p>You'll face such things as giant seagulls, panthers, pirates, and the spirits of the underworld.</p>"},{"name":"Lethal Enforcers","year":1994,"developer":"Konami Co., Ltd.","url":"5#L/Lethal%20Enforcers%20%28NA%29.sfc","filesize":2097152,"score":7.3,"genres":"Action > 1st-person > Arcade > Rail shooter","desc":"<p>Pick up your pistol and be the cop you need to be in order to rid the streets of the criminals out to make your day hell. Aim wisely and quickly, otherwise your lives will be lost quickly in this 1st person arcade shooter, cleaning up the streets. The higher the difficulty level, the more crimes there will be to eliminate, but watch out for the other weapons that can help you along the way. Go straight into the mayhem, practice in the targeting range or have a friend back you up in two player mode. </p><p>The Arcade version has two game modes that can be selected by the operator: Arcade mode (the stages are played in strict order) and Street mode (a desired stage can be selected by players).</p><p>Home console version can be played with either a standard gamepad or light gun accessory.</p>"},{"name":"Lethal Weapon","year":1992,"developer":"Ocean Software Ltd.","url":"5#L/Lethal%20Weapon%20%28NA%29.sfc","filesize":1048576,"score":6,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>The movie license <em>Lethal Weapon</em> on the SNES is broadly similar to the game on computers, but features unique levels and different gameplay mechanics.</p><p>Playing as either Riggs (who has a faster rate of fire) or Murtaugh (who can jump higher), the player selects a mission from police headquarters. The first four missions can be tackled in any order before the final mission opens up. Each mission consists of a large number of interconnected levels consisting of ladders and platforms, which must be navigated to the mission goal, all within a tight time limit. Featured locations are the docks, the sewers and subway, a shopping mall, an office complex, and a police station.</p><p>Many enemy goons stand in the player's way and can be dispatched via karate kicks or gunshots. Ammunition is limited and clips must be collected to keep up the supply. Also available are bullet-proof vests functioning as health power-ups as well as clocks, which add one minute to the time limit. Most missions end with boss fights.</p>"},{"name":"Libble Rabble","year":1994,"developer":"Namco Limited"},{"name":"Liberty or Death","year":1994,"developer":"KOEI Co., Ltd.","url":"5#L/Liberty%20or%20Death%20%28NA%29.sfc","filesize":1310720,"score":6.6,"genres":"Strategy > Top-down > Turn-based > Historical events > North America > War","desc":"<p><strong>STORY</strong>  </p><p>The European Wars against Spain and France have been costly to the British Empire. In order to gain additional funds for the war effort, the Crown raise taxes from the New World colonies without representation. This act compels the New World colonies to protest and boycott against British rule. By 1775, the Crown alarmed by the protests, boycotts and politically instability in the New World sends troops to subdue any rebellious efforts by the New World colonists. This threatening approach provokes the Thirteen Colonies to revolt. Thus starts the War for Independence in the New World (American Revolutionary War).</p><p><strong>GAMEPLAY</strong>  </p><p><strong>Choosing Sides</strong>  </p><p>In Liberty or Death, you partake in the American Revolutionary War, either as the \"rebels\" - the American Continental Army or as the \"Crown\" - the British Royal Army.</p><p>Choosing either one of the nations will prompt you to choose the leading Commander-in-Chief:</p><ul><li>The Continental Army: Charles Lee, Artemas Ward or George Washington.</li><li>The British Royal Army: Henry Clinton, Thomas Gage or William Howe.</li></ul><p><strong>Revolutionary Politics</strong>  </p><p>Each turn you will have to balance your treasury for the war effort. Money is provided by each state. The more states that support your cause, the more money will flow in your coffers. Money is spent in paying wages, strengthening the fleet and recruiting new regiments.</p><p>Here, if you have a sufficient fleet, you can also command your Navy officer to \"control the seas\" which is conducting a blockade and privateering against enemy ships. This may result in seized goods that will be added to your treasury. </p><p>The American Revolutionary War in Liberty or Death included everyone except the American Indians: [1] Revolutionary Militia: American supporters but not yet fully supportive of Continental Army (not under your full control) [2] Loyalist Militia: Militia supportive to the Crown [3] French Army: The French will support the American cause after a formal alliance is held. [4] Spanish Army: The Spaniards will support the American cause after a formal alliance is held.</p><p><strong>Revolutionary Combat</strong>  </p><p>The top-down turn-based combat introduces units available in the Revolutionary War: Infantry, Guerrilla, Cavalry and Artillery (Engineers). Combat near shores may also be joined by Naval units: Fleet and Fires Ships.</p>"},{"name":"Lion King, The","year":1994,"developer":"Westwood Studios, Inc.","url":"8#Nintendo%20-%20SNES.zip/Lion%20King%2C%20The%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Africa > Fantasy > Licensed","desc":"<p>Young Simba just can't wait to be king. His father is the current King of the Savannah and the young prince is able to frolic the lands at will; jumping on and around other subjects of this animal kingdom. When Simba's father, King Mufasa, is killed and his evil brother Scar takes over the kingdom, Simba is banished from the lands of his birthright and has to grow up fast, honing his skills, for the day of his return.</p><p><em>The Lion King</em>, based on the famous Disney movie, is a platform game where you control Simba - initially as a young cub, and later as an adult lion. The plot of the game follows the plot of the movie. Each of the levels represents a part of the movie. </p><p>As young Simba, you can fight various beasts, such as lizards, by jumping on them. You can also roar to scare some creatures into submission, though every time you roar, you have to wait for your \"roar meter\" to charge. </p><p>As an adult lion, you can still roar and jump, but now you fight enemies by slashing at them with your claws (if you're skillful enough, you can also grab them and toss them off the screen). </p><p>The game features no in-game save function, and it needs to be replayed from the beginning every time.</p>"},{"name":"Little Magic","year":1993,"developer":"Altron Corporation"},{"name":"Little Medusa","year":2018,"developer":"Mega Cat Studios"},{"name":"Live a Live","year":1994,"developer":"Square Co., Ltd.","url":"5#L/Live%20a%20Live%20%28English%20Translated%2C%20Rev%202%20-%20Deluxe%20Version%29.sfc","filesize":2621440,"score":7.4,"genres":"Role-playing (RPG) > Top-down > Turn-based > Fantasy > Sci-fi / futuristic","desc":"<p>In <em>Live a Live</em>, the player controls seven main characters and plays through seven different chapters set in seven different time periods: prehistoric age, old China, feudal Japan, American Old West, modern-day environment, near future on the Earth, and a sci-fi space scenario. </p><p>These stories appear to have no common points at first; each one has its own protagonists and goals: the prehistoric chapter is dedicated to love and friendship that existed before humans invented language; the Chinese chapter is a tale of an old master who must choose a perfect apprentice; the Japanese (Bakumatsu period) episode stars a ninja that infiltrates a warlord's castle; the Old West scenario is a classic tale of rivalry and revenge; modern-day story is a simple recounting of a fighting tournament; near future chapter deals with urban life and psychic abilities; finally, the space episode is a horror story in which a robot must investigate mysterious deaths of the crew members. </p><p>The player can choose to play the scenarios in any order, but must complete them all in order to unlock the eighth scenario, and eventually the final chapter - both of which explain the connections between the separate stories and deliver the grand finale.</p><p>The main gameplay system in <em>Live a Live</em> is that of a Japanese-style role-playing game with turn-based battles. Unlike most games of its kind, the battles take place on a single-screen field, on which the player can freely navigate the characters. Positioning the characters is crucial in many battles, as enemy attacks often have area effects; weapon range also plays a role in combat. </p><p>The chapters may vary drastically in gameplay. For example, the ninja chapter is mostly based on stealth; finding ways to avoid the enemies is preferable to engaging them in battles. The near future chapter features mind-reading and other puzzle-solving elements. The sci-fi chapter is unique gameplay-wise, having no battles at all, the gameplay focusing entirely on exploration and gradually solving the mystery.</p>"},{"name":"Lode Runner Twin: Justy to Liberty no Daibōken","year":1994,"developer":"T&E Soft, Inc."},{"name":"Looney Tunes B-Ball","year":1994,"developer":"Sculptured Software, Inc.","url":"5#L/Looney%20Tunes%20B-Ball%20%28NA%29.sfc","filesize":2097152,"score":7.5,"genres":"Sports > Side view > Arcade > Basketball > Licensed","desc":"<p>The Looney Tunes work hard at Warner Bros. studios acting in cartoons for all to enjoy. It's tough work, and afterwards they just want to relax and maybe shoot a few hoops in the parking lot. Of course they can't entirely leave their wild antics inside the studio, and will certainly bring some kind of zany onto the basketball court.</p><p>Looney Tunes B-Ball is a 2-on-2 Basketball game, similar to the more well known NBA Jam. However, Looney Tunes is much more informal and silly, though this level of silliness is set by the player via the Wackiness Meter on the main menu. Players choose their teams from the likes of: Bugs Bunny, Daffy Duck, Elmer Fudd, Wile E. Coyote, Tasmanian Devil, Sylvester, Yosemite Sam and Marvin Martian. Each player has unique statistics for their shooting, 3-pointers, defense, stamina and speed.</p><p>Once on the court, the player can pass the ball, shoot the ball, grab a burst of speed or unleash a special defensive ability or a special offensive ability.. These abilities include cream pies, time bombs, sticks of dynamite and other fun toys from the ACME Corporation. Offensive Abilities must be \"bought\" by collecting gems and other items which occasionally show up on the basketball court.</p>"},{"name":"Lord Monarch","year":1992,"developer":"Nihon Falcom Corp."},{"name":"Lost Vikings 2, The","year":1997,"developer":"Blizzard Entertainment Inc.","url":"6#Lost%20Vikings%202%20%28USA%29.sfc","filesize":1048576,"score":7.2,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Fantasy > Sci-fi / futuristic > Comedy","desc":"<p>Get ready for more nights of masochistic puzzle goodness, because the Lost Vikings need your help once again! The brothers (Erik the Swift, Baleog the Fierce and Olaf the Stout) are trying to get back home and you need to guide them through. Two brand new characters (Fang the Werewolf and Scorch the Dragon) also join the fray. Each character has their own special talents and they must be used in concert if you are to win.</p>"},{"name":"Lost Vikings, The","year":1993,"developer":"Blizzard Entertainment Inc.","url":"6#Lost%20Vikings%2C%20The%20%28USA%29.sfc","filesize":1048576,"score":7.9,"genres":"Action > Puzzle > Side view > 2D scrolling > Platform > Fantasy > Sci-fi / futuristic > Comedy","desc":"<p>Three Vikings, Eric the Swift, Olaf the Stout, and Baleog the Fierce, were kidnapped by the alien Tomator, the evil Croutonian ruler, who is collecting unique life forms to display in his gallery. The three Vikings will have to combine their unique skills to defeat Tomator, as well as a vast array of aliens, robots, giant snails, big lizards, and more.</p><p><em>The Lost Vikings</em> is a side-scrolling platform puzzle game with a twist. Instead of one character who can jump, run, shoot, collect items, flip switches, and so on, there are three different characters, each with his own skills. Eric the Swift can jump, run and bash through walls with his tough helmet. Olaf the Stout has a shield which can block attacks, function as an air glider or as a step to stand on. Baleog the Fierce can shoot things with his arrows (including switches) or kill things with his sword. The player has to use the three Vikings as a team if he wants to get past the increasingly difficult levels and puzzles.</p><p>The player controls one Viking at a time but can switch between them at any point. The Vikings have limited space in their inventory which they can use to keep various items. Each Viking has three health points, and if he loses them all from confrontations with dangers, he dies (some threats kill instantly), and the level must be restarted.</p>"},{"name":"Love Quest","year":1995,"developer":"Tokuma Shoten Publishing Co., Ltd."},{"name":"Lucky Luke","year":1997,"developer":"Infogrames Multimedia SA","url":"7#Lucky%20Luke%20%28Europe%29.sfc","filesize":1572864,"score":7.4,"genres":"Action > 1st-person > Side view > 2D scrolling > Arcade > Puzzle elements > Shooter > Western > Licensed","desc":"<p>Based on the famous comics series about good cowboy Lucky Luke.</p><p>In this game, Lucky Luke has to arrest the four Dalton brothers – Averell, William, Jack, and Joe. Gameplay involves progressing from level to level, shooting enemies  (bad cowboys, jailbreakers, and hostile Indians) with Luke's revolver, collecting various items like bullets, dynamites or sheriff stars, running, jumping, ducking, and climbing. Locations vary from forts, towns and jails, to mines, a train, and a haunted saloon. On every level, Luke will have to complete different side objectives to progress, like freeing a bank director, collecting gold nuggets for a miner in exchange of some nitroglycerine, or building a totem for the Apache. Some levels end with a boss battle, usually against one of the Dalton brothers.</p><p>Different arcade sequences between levels involve chasing the Dalton brothers, riding Luke's faithful horse Jolly Jumper, running away from a tornado, or navigating a raft, among other things. Bonus level arcade sequences include a wrestling challenge with Jolly, bottle shooting, or a revolver barrel roulette.</p><p>The game uses a password system to start directly from certain points in the game.It was made in French, English, German and Spanish.</p>"},{"name":"Lufia & the Fortress of Doom","year":1993,"developer":"Neverland Co., Ltd.","url":"5#L/Lufia%20%26%20The%20Fortress%20of%20Doom%20%28NA%20-%20Uncensored%20and%20Restored%20Features%2C%20Rev%202.4.6%20With%20L2Font%20Patch%29.sfc","filesize":1572864,"score":7.3,"genres":"Role-playing (RPG) > Top-down > Turn-based > Japanese-style RPG (JRPG) > Puzzle elements > Fantasy","desc":"<p>The hero Maxim and his group defeat the Sinistrals on Mt. Doom (as portrayed in Lufia II), and all is peaceful.  With such a great peace, the defense forces of the world become lax.  One hundred years later attacks begin taking place, supposedly by the Sinistrals.  It's up to the descendant of the hero, and his childhood friend Lufia, to form a new band of champions to save the world.     Gameplay is fairly standard for RPGs, with turn-based battling by way of a menu of icons, and random battles.  There's also a higher-than-normal emphasis on puzzles within dungeons.</p>"},{"name":"Lufia II: Rise of the Sinistrals","year":1995,"developer":"Neverland Co., Ltd.","url":"6#Lufia%20II%20-%20Rise%20of%20the%20Sinistrals%20%28USA%29.sfc","filesize":2621440,"score":7.9,"genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Puzzle elements > Regional differences","desc":"<p><em>Lufia II: Rise of the Sinistrals</em> is a prequel to  Lufia &amp; the Fortress of Doom. Its events take place ninety-nine years prior to it, and it explains the origin of the series' antagonists, the group of super-humans known as the Sinistrals. The player controls the ancestor of the first game's protagonist, the swordsman Maxim. After having encountered a mysterious woman named Iris, Maxim goes on a journey to find other heroes who would help him to stop the Sinistrals from destroying the world.</p><p>Like the first game, <em>Rise of the Sinistrals</em> is a Japanese-style turn-based RPG with many puzzle elements thrown in. The game makes extensive use of puzzles in its dungeon layouts; various items and accessories must be used to solve them. It also features a \"Capsule Monsters\" system; monsters can be summoned to fight alongside the party in battles. They would evolve when fed weapons, armor, or special fruits. Unlike in the first game, there are no random battles in the dungeons: all the enemies are visibly moving on-screen.</p>"}]