[{"name":"Madden NFL 94","year":1993,"developer":"Visual Concepts Entertainment, Inc.","url":":Madden NFL '94 (USA)","filesize":784525,"score":7.5,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>Madden NFL '94 is the third in the Madden series of football games for the SNES. It features 80 teams -- 28 teams from the 1993 season, 38 Super Bowl teams from 1966-1991, 12 All Star franchise teams since 1950, and two \"All-Madden\" teams: one for the 1993 season and one from a 20-year time span. You can play these teams in a regular exhibition game or sudden death overtime game, or take the 1993 teams through an entire season. You can also enter the playoffs with the 1993 teams, the Super Bowl champions, or the All Star franchise teams. Unlike many other sports games, saving a season is done by password rather than by storing the data into a saved game.</p>"},{"name":"Madden NFL 95","year":1994,"developer":"Visual Concepts Entertainment, Inc.","url":":Madden NFL '95 (USA)","filesize":738032,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>John Madden's back in the 1995 version of Madden NFL.</p><p>Play exhibition, Super Bowl, playoffs or full season with any of the 1994 teams or all Madden teams.</p><p>This time around, you can select whether or not to include weather conditions, new player animations (high steppin', QB slides), a bigger field and over 100 injuries.</p><p>Also includes windowless passing, all new Madden-designed strategies and team match-up that shows how your players stack up to the other team in their position.</p>"},{"name":"Madden NFL 96","year":1995,"developer":"High Score Productions","url":":Madden NFL '96 (USA)","filesize":1093234,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>John Madden returns for the '96 season of Madden NFL.</p><p>Play exhibition, Super Bowl, playoffs or full season with any of the 1995 teams or all Madden teams.</p><p>While you can still select weather and there are over 100 injuries, this version adds voice-overs and the ability to draft and create players and see if they get drafted.</p><p>Still includes windowless passing, all new Madden-designed strategies and team match-up that shows how your players stack up to the other team in their position.</p>"},{"name":"Madden NFL 97","year":1996,"developer":"Tiburon Entertainment","url":":Madden NFL '97 (USA)","filesize":1134966,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>With the versions for PC and 32-bit consoles having moved into the realm of real 3D graphics, <em>Madden NFL 97</em> on Super Nintendo retains the classic view of the series, updating it with different features and options compared to the Genesis release.</p><p>The game features the 30 regular NFL teams of the 1996 season and the 1996 All-Madden team. Further teams are available as unlocks - winning the Super Bowl with a regular team gives a code for a classic team of the same franchise, and some special hidden teams also exist.</p><p>Playing modes are exhibition, a full season and playoffs including the Super Bowl. In seasons and playoffs, any game can be either played or simulated (with the exception of the Super Bowl, which must be played). Quarter length can be set from 3 to 15 minutes. All 30 team's stadiums are available for selection, with changeable weather conditions for the open fields, including fair weather, wind, rain, snow and even night games. Further options are two skill levels (Pro and All Madden), freely definable audibles, eight different penalties that can be set to different levels, player fatigue, injuries and substitutions. Play calling mode can be set to a bluff mode, offense and pass catching can be set to manual or automatic, and there is an instant replay feature. Player records and season/playoff progress are saved via battery.</p><p>The game also features player creation and trading. Player creation features tryout mini-games. 13 events in all must be accomplished to determine a player's stats, including running, an obstacle course, following coaching directions, passing, tackling, etc. All events can be practiced individually.</p><p>Multiplayer is available via multitap for up to five players, who can play against each other or on the same team. The player using the first controller always calls plays and controls the quarterback, while the remaining players control other players on the field.</p>"},{"name":"Madden NFL 98","year":1997,"developer":"Tiertex Design Studios","url":":Madden NFL '98 (USA)","filesize":1206691,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>The Madden football series makes a final appearance on the SNES with <em>Madden NFL 98</em>. With PC and next-gen console versions having moved to 3D graphics, the SNES version retains the classic view of the series. Most of the playing modes are the same as on the Genesis, but the SNES version has its own selection of teams and gameplay options.</p><p>Players can select from the 30 teams of the 1997 NFL season, the 1997 All-Madden team, an EA Sports and a THQ team, a Players, Inc. (NFLPA) team, plus 28 classic NFL teams - one per franchise minus the 1995 expansion teams and the 86 Browns for the Ravens. Playing modes include exhibition games (now optionally as a best-of-three or best-of-five series), seasons and playoffs. There is also an option to replay all Super Bowls since 1988. The game tracks records in 7 categories, pre-filled at the start with records to beat. A new feature are hot and cold streaks for teams, in which their recent playing history influences their current stats. Player creation and trading returns from the predecessors. As in Madden 97 (but unlike in the Genesis version), players are created by performing a number of tryout mini-games, all of which can be practiced individually and for which records are tracked. During a season, there is detailed stats tracking, for the overall league, conference, or individual team. There are options for salary caps and trading deadlines in seasons and playoffs. Exclusive SNES features include stadium selection and optional windy weather.</p>"},{"name":"Madō Monogatari: Hanamaru Daiyōchienji","year":1996,"developer":"Compile"},{"name":"Magic Boy","year":1993,"developer":"Blue Turtle","url":":Magic Boy (USA)","filesize":313198,"score":6.7,"genres":"Action > Side view > Platform > Puzzle elements","desc":"<p>Join Magic Boy as he attempts to become a master wizard, and he does this by shooting enemies, putting them in a bag, and throwing them away. He also must get through four areas: Sand Land, Wet World, Plastic Place, and Future Zone. There are also several power-ups that help him on his quest.</p>"},{"name":"Magic Knight Rayearth","year":1995,"developer":"Pandora Box"},{"name":"Magic Sword","year":1992,"developer":"Capcom Co., Ltd.","url":":Magic Sword (USA)","filesize":543937,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Platform > Fantasy","desc":"<p>As the hero, you must climb up a monster-ridden tower to defeat Drokkmar, master of the Blackorb. To do this, you must defeat his army that stands in your way with whatever weapon you are carrying. Health is decreased by coming into contact with various monsters, attacks, traps, and the passage of time. It is increased by finding food. Every certain amount of points, a \"Food Fairy\" appears and drops off food as well.</p><p>Throughout your journey, you can smash open chests to find treasure and artifacts. Some of these artifacts can be recovered that alter gameplay, such as providing more damage or increased magical power. Also throughout your journey, you can collect keys, which are used to free imprisoned allies, who not only help you defeat monsters, but also leave you an item that will help you on your quest. Only one person can join you at a time.</p><p>As you progress through the tower, you will be granted new magical weapons after each boss you defeat. The weapons are affected by a \"magic bar\" that charges over time. When this bar is fully charged, the weapon has a powerful ranged attack, but when not charged only a close attack is produced. A magical staff will grant increased range attack ability. A magical blast may be generated by jumping and attacking, but doing this costs health.</p><p>There are multiple paths in the game, and two separate endings. Hidden doors can be used to skip levels when found - usually by attacking a wall or a particular spot.</p>"},{"name":"Magical Drop","year":1995,"developer":"Data East Corporation"},{"name":"Magical Drop II","year":1996,"developer":"Data East Corporation"},{"name":"Magical Pop'n","year":1995,"developer":"Polestar Co., Ltd."},{"name":"Magical Quest Starring Mickey Mouse, The","year":1992,"developer":"Capcom Co., Ltd.","url":":Magical Quest Starring Mickey Mouse, The (USA)","filesize":680975,"score":8.1,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Licensed","desc":"<p>This was the first Mickey Mouse game for Super NES, featuring a traditional platform gameplay and colorful Disney-like graphics.</p><p>Mickey's mission is to save his dog Pluto, who's been kidnapped and kept inside emperor Pete's castle, in a magical land, guarded by mysterious creatures. </p><p>The originality of the game lies on the possibility of wearing different costumes to incorporate different characters, all taken from old Disney cartoons. Each one has a special ability. As a wizard, Mickey has magical powers; as a fireman, the mouse can deal with fire; and, as a climber, he can reach the top of high platforms.</p>"},{"name":"Magical Tarurūto-kun: Magic Adventure","year":1992,"developer":"Tose Co., Ltd."},{"name":"Magna Braban: Henreki no Yūsha","year":1994,"developer":"ASK Kodansha Co., Ltd."},{"name":"Mahjong Gokū Tenjiku","year":1994,"developer":"Terajima Joho Kikaku Co., Ltd."},{"name":"Mahjong Taikai II","year":1994,"developer":"KOEI Co., Ltd."},{"name":"Mahjong Tōhaiden, The","year":1993,"developer":"Khaos"},{"name":"Mahōjin GuruGuru 2","year":1996,"developer":"TamTam Co., Ltd."},{"name":"Majin Tensei","year":1994,"developer":"Atlus Co., Ltd."},{"name":"Majin Tensei II: Spiral Nemesis","year":1995,"developer":"Atlus Co., Ltd."},{"name":"Majūō","year":1995,"developer":"Eleven Co., Ltd."},{"name":"Makeruna! Makendō 2","year":1995,"developer":"Success Corp."},{"name":"Manchester United Championship Soccer","year":1995,"developer":"Krisalis Software Ltd."},{"name":"Marchen Adventure Cotton 100%","year":1994,"developer":"Success Corp.","url":":Maerchen Adventure Cotton 100% (Rev 1.1)","filesize":867066,"score":7.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter","desc":"<p>This is the sequel to the original side-scrolling shooter Cotton, and it continues the adventures of the cute young witch and her quest for candy.</p><p>The game features new levels and enemies, all rendered in a much lighter family-friendly tone. Gameplay remains the same as in the original, with the addition of being able to collect different magical spells additionally there are now 3 different difficulty settings to choose from.</p>"},{"name":"Mario & Wario","year":1993,"developer":"Game Freak, Inc.","url":":Mario & Wario (Japan)","filesize":454546,"score":"","genres":"Puzzle > Side view > 2D scrolling > Real-time > Platform > Point and select","desc":"<p><em>Mario &amp; Wario</em> is a puzzle game that is compatible with the SNES Mouse. The player chooses Princess Peach (low speed), Mario (medium speed), or Yoshi (high speed), and Wario proceeds to drop a bucket on their head (the object changes in later levels) The player controls Wanda the fairy to guide the now-blinded character through an obstacle course, to reach Luigi waiting at the end. Advancement is continuous and automatic: the object on their head may be tapped to make them turn around, otherwise they'll turn after hitting a wall. Hitting a dangerous obstacle (spikes or enemies) results in losing a life. Items, such as Coins, Stars, Mushrooms, and 1-Up Mushrooms can grant 1-Ups and more time. At the end of every world, a bonus level is played where Wanda hits Wario in his plane to earn coins.</p>"},{"name":"Mario is Missing!","year":1992,"developer":"Radical Entertainment Inc.","url":":Mario is Missing! (USA)","filesize":926698,"score":5.7,"genres":"Educational > Side view > Geography","desc":"<p>Bowser, the token bad guy from the Mario Bros. series, is up to no good again in this educational game designed to teach children geography. This time he's set up his headquarters in Antarctica and created portals to 25 famous cities around the world, so that his Koopas can wreak havoc in our own world. He's also kidnapped Mario, hence the title of this game. You play as Luigi who must foil Bowser's plans by entering through each of the portals, tracking down the Koopas who have stolen famous artifacts, and looking for clues about your location. Once you've set everything right and determined where you are, you call Yoshi on your Globulator so he can track you down. You need Yoshi's help to eat the Pokey (a cactus-like creature) that's guarding the return portal, and when Luigi returns he can close the portal forever.</p><p>By exploring these 25 cities, children can familiarize themselves with the landmarks and artifacts that each city has. When Luigi returns the stolen artifacts to the proper places he can even take photographs of them. There is also an add-on disk you can purchase that adds ten additional cities to the game.</p>"},{"name":"Mario no Super Picross","year":1995,"developer":"Ape","url":":Mario no Super Picross (Rev 1.5)","filesize":388901,"score":7.7,"genres":"Puzzle > Top-down > Fixed / flip-screen > Point and select","desc":"<p>A sequel to Mario's Picross on the GameBoy, <em>Mario's Super Picross</em> features the same gameplay as its predecessor. The game is played slab of stone with a grid on it. Above of every column and next to every row are numbers that acts as clues as to where a filled square is located along that column or row. The point of the game is to find all the filled squares on the grid by using your hammer and chiseling out squares that you think are filled and marking those that aren't with X.</p><p>There are two different sets of puzzles available but you start off with only one, Mario's Picross, and when you completed the first level, Wario will pop in and offer you his set of puzzles. The difference between the two is that Mario's Picross have to be completed within a certain time. Every time you chisel out the wrong square, it will deduct time. If time runs out before you can solve the puzzle, it's game over. Wario's Picross are timed to see how long it will take you to complete it, but will not run out. The catch here is that you will not be notified of a wrong square.</p><p>Other features includes game-saves, hints and tutorials.</p>"},{"name":"Mario Paint","year":1992,"developer":"Nintendo Co., Ltd.","url":":Mario Paint (USA)","filesize":466430,"score":7.3,"genres":"Educational > Graphics / art > Music","desc":"<p><em>Mario Paint</em> is an educational game that allows anyone to create simple pictures, paint over black and white pictures, or free draw their own using the specially developed SNES Mouse. The player can also create their own piece of music using a selection of notes and themes, create greeting cards and animations, or play a game of \"Gnat Attack\", where they use the mouse to control a swatter to swat flies.</p>"},{"name":"Mario's Early Years: Fun With Letters","year":1994,"developer":"The Software Toolworks, Inc.","url":":Mario's Early Years - Fun With Letters (USA)","filesize":856069,"score":"","genres":"Educational > Side view > Pre-school / toddler > Reading / writing > Licensed","desc":"<p><em>Mario's Early Years: Fun With Letters</em> is a collection of letter-related activities for kids ages 3 to 6 hosted by Mario and Co. Playing with either Mario or Princess Toadstool, you select from 10 different activity \"worlds\" each filled with different activities that range from letter recognition to sentence fill-in, letter-sound recognition, vowel recognition, etc. Each activity can be played in either Discovery mode, where you are free to do what you wish, or in Learning mode, where Luigi guides you through the activities.</p><p>The game also includes a Parent's Information Center, which explains what each of the activities does and how to complement them. Options to configure the activities to each parent's wishes are also provided.</p>"},{"name":"Mario's Early Years: Fun with Numbers","year":1994,"developer":"The Software Toolworks, Inc."},{"name":"Mario's Early Years: Preschool Fun","year":1994,"developer":"The Software Toolworks, Inc."},{"name":"Mario's Time Machine","year":1993,"developer":"The Software Toolworks, Inc.","url":":Mario's Time Machine (USA)","filesize":934338,"score":6,"genres":"Educational > Side view > Puzzle elements > History","desc":"<p>Bowser is at it again!  He's using a time machine, called a Timulator, to loot historical artifacts from the past, in order to stock his museum.  He plans to destroy the time machine after, and therefore change the course of history forever.  It's up to Mario to stop Bowser and return all the stolen artifacts to their rightful place in history!</p>"},{"name":"Mark Davis' The Fishing Master","year":1995,"developer":"Natsume Co., Ltd.","url":":Mark Davis' The Fishing Master (USA)","filesize":1017044,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Fishing > Licensed","desc":"<p>In <em>Mark Davis' The Fishing Master</em>, the player can take control of fishing legend Mark Davis and fish in five different lakes and even compete in a fishing tournament to win a trophy.</p><p>The gameplay is reminiscent of Super Black Bass. The player picks a location to fish using an overhead map where the player is then taken to a behind the person perspective to cast their reel. Once the player casts their line, the view will change to a split screen with the original view on the top with a underwater view on the bottom to view the bait and an approaching fish.</p><p>Each lake has a different criteria to meet such as a weight limit, time limit, etc., to advance to the next lake and ultimately compete in the major tournament. Players can also assemble their own set of authentic fishing gear including rods, reels, bait and various equipment. The game also boasts that the fish in the game act realistically to their real-life counterparts.</p>"},{"name":"Marko","year":1995,"developer":"The Cartoon Mavericks"},{"name":"Marvel Super Heroes in War of the Gems","year":1996,"developer":"Capcom Co., Ltd.","url":":Marvel Super Heroes; War of the Gems (Europe)","filesize":1315714,"score":7.2,"genres":"Action > Side view > Beat 'em up / brawler > Fighting > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>Marvel Super Heroes in War of the Gems</em> is a side-scrolling platformer/beat 'em up based on the <em>Infinity Gauntlet</em> storyline from the comics. Adam Warlock calls on the heroes to recover the 6 Infinity Gems before they are used for evil.</p><p>You may choose ones of five heroes: Spider-Man, Hulk, Captain America, Iron Man and Wolverine. Each one has different stats and abilities. (i.e. Spider-Man is agile. Hulk is strong, Iron Man can double-jump with his rocket boots, etc.) Initially you can choose a training area in Avenger headquarters or four levels. As you complete levels, most open up. Each hero can be equipped with gems to boost their abilities in each section. These must be obtained by finding them in the levels.</p><p>Gameplay is fairly similar to X-Men-Mutant Apocalypse. Combat is all on a 2D plane. Each hero has basic jumps and attacks and special moves that can be executed with button combinations like quarter-rolls. Enemies include various villains from the Marvel Universe and evil doubles of various Marvel heroes.</p>"},{"name":"Marvelous","year":1996,"developer":"Nintendo R&D2","url":":Marvelous - Mouhitotsu no Takarajima (Rev 1.07)","filesize":2042445,"score":"","genres":"Adventure > Top-down > 2D scrolling > Anime / Manga > Action RPG","desc":"<p>In <em>Marvelous: Mōhitotsu no Takarajima</em>, the famous pirate Captain Maverick is said to have left behind a great treasure known as the \"Marvelous.\" The treasure is said to be protected by unsolvable puzzles and bizarre creatures. While many have gone looking for this treasure, none have ever returned. Now, a group of children on a field trip have landed on the island rumored to house the treasure, as did a group of pirates trying to get the treasure at all costs.</p><p>The game focuses on a group of three 12-year-old boys, Dion, Max, and Jack. Their teacher, Ms. Gina, helps them by giving them items to help organize their group. The game, influenced by The Legend of Zelda: A Link to the Past, is played by interacting with other characters and things. When the player encounters someone or something, a command window shows up with choices of how the player wants to interact with them.</p>"},{"name":"Mary Shelley's Frankenstein","year":1994,"developer":"Bits Corporation","url":":Mary Shelley's Frankenstein (USA)","filesize":1111513,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Licensed","desc":"<p>Based of the 1994 movie remake of <em>Frankenstein</em>, the player is the artificial man created by Victor Frankenstein. After Victor rejects his creation due to its hideous appearance, the creation flees from Victor and swears revenge on him.</p><p>The player goes through a number of levels, battling anything that attacks with a wooden stick. It's possible to set the tip of the stick on fire, by swinging it at the fire torches located on the walls. The player can also use a special attack: a blue ball coming out of the hands of the creation, which takes some of the player's life away. There are also some simple puzzles to be solved in order to get through the levels.</p>"},{"name":"Mask, The","year":1995,"developer":"Black Pearl Software","url":":Mask, The (USA)","filesize":1354831,"score":6.6,"genres":"Action > Side view > Licensed","desc":"<p><em>The Mask</em> is based on the movie with the same name. The story follows poor guy Stanley Ipkiss who finds a mysterious mask and is given mysterious powers from it..</p><p>As in the movie, Stanley (aka The Mask) has some funny weapons, like the Guns, the Horn, the Hammer and the ability to transform into a big Tornado. He battles through levels inspired by the movie, including his apartment, the city streets, the bank, the park, the jail, and the night club for the final showdown.</p>"},{"name":"Masters: Harukanaru Augusta 2","year":1993,"developer":"T&E Soft, Inc."},{"name":"Maten Densetsu: Senritsu no Ooparts","year":1995,"developer":"Thinking Rabbit"},{"name":"Math Blaster: Episode One - In Search of Spot","year":1994,"developer":"Western Technologies Inc.","url":":Math Blaster - Episode 1 (USA)","filesize":479456,"score":"","genres":"Educational > 1st-person > Side view > Mini-games > Platform > Math / logic > Sci-fi / futuristic","desc":"<p>A follow-up to the original Math Blaster! games, <em>Math Blaster: In Search of Spot</em> is an educational title with arcade elements designed to help students learn maths while having fun.</p><p>The game allows students to practice basic addition, subtraction, multiplication, and division skills in addition to fractions, decimals, percents, estimation, and number patterns. The subjects can be practiced separately or together in review. Six levels of difficulty are provided. Like the previous titles, the game also includes an editor to create new problem sets (present in the PC version only).</p><p>Math Blaster's friend and assistant, Spot, is kidnapped by the evil Trash Alien at the beginning of the game. The Galactic Commander gives Math Blaster the mission to follow the Trash Alien to his home planet and rescue Spot.</p><p>The game starts with a complete mission (story mode). The mission consists of a series of four (three in the console versions) math activities (mini-games) strung together with cut-scenes. The activities can also be played separately, for practice or for score.</p><p>The activities are as follows:* Trash Zapper - Solve equations to gain tractor beam power, then use the tractor beam to collect space trash.</p><ul><li><p>Number Recycler (PC version only) - Create equations by pushing around columns of numbers and operators. Correct equations allow you to turn the trash you collected into fuel.</p></li><li><p>Cave Runner - Use Math Blaster's jet pack to fly through a cave. He has a number on his chest, and it must be arithmetically between the numbers on each side of an opening in order for him to pass through. Droplets of water falling from above can change this number by performing an operation on it. There are also gems which can be collected for bonus points, and in higher levels, monsters appear that can knock Math Blaster down.</p></li><li><p>Math Blaster - The Trash Alien's spaceship displays an equation, and the four portholes serve as multiple-choice answers. Use the jet pack to fly into the correct portholes while avoiding floating trash and energy blasts from the ship. Bonus gems also appear at random, and after five problems a bonus round occurs where players get a chance to collect as many gems as they can within a time limit.</p></li></ul><p>Upon finishing the complete mission, the player is presented with a certificate that can be printed out (PC version only). Their final score is also added to a high score board for their account.</p>"},{"name":"Maui Mallard in Cold Shadow","year":1996,"developer":"Disney Interactive, Inc.","url":":Maui Mallard in Cold Shadow (USA)","filesize":2158581,"score":7.5,"genres":"Action > Side view > 2D scrolling > Platform > Martial arts > Licensed","desc":"<p>Disney's Donald Duck takes the starring role in this sidescrolling platform game.  As the detective Maui Mallard, he's on the trail of a long lost Idol, which has recently vanished.  Early on, Maui can also switch between his normal self and Ninja Maui, and with all the creepy voodoo enemies he'll encounter throughout his adventure, he's going to need all the help he can get.</p><p>As previously mentioned, there are two personalities to Maui, and as a result, two different sets of controls.  Normal Maui carries a bug gun, which can fire a variety of different insect ammo, from basic bugs, to the more powerful lightning and fire bugs.  It's also possible for Maui to combine bugs to pack a more powerful blast at his enemies.</p><p>Once Maui starts to find Yin-Yang coins, he'll be able to transform into Ninja Maui.  Ninja Maui has lightning-quick reflexes, and wields a bo staff.  In addition to being handy for whacking enemies, Ninja Maui can also climb between walls by jumping and propping the staff between the walls at the height of his jump.  He can also hook onto duck heads and swing from them to reach areas he normally couldn't.  You'll need to constantly find Yin-Yang coins to fuel your Ninja persona, otherwise you'll run out and transform back to Maui Mallard.</p><p>The level layout in the Game Boy version is slightly different with less secrets to be found.</p>"},{"name":"MazezaM Challenge","year":2013,"developer":"PortableDev"},{"name":"Mazinger Z","year":1993,"developer":"Winky Soft Co., Ltd."},{"name":"Mecarobot Golf","year":1993,"developer":"Advance Communication Company","url":":Mecarobot Golf (USA)","filesize":439713,"score":5.3,"genres":"Sports > 3rd-person (Other) > Golf > Sci-fi / futuristic","desc":"<p>In <em>Mecarobot Golf</em>, a mechanical golfer by the name of Eagle was banned from competing in professional human tournaments when it was determined that his mechanical brain that can determine the right angles was an unfair advantage. Instead, the engineers that built Eagle have built him his very own course and the player has taken up the challenge against the mechanical golfer.</p><p>The player doesn't get to play as the robot, instead they attempt to beat the robot in a standard 18 rounds of regular golf including weather conditions and obstacles such as sand traps, bunkers, water hazards and trees. Players can also practice their swing on the Driving Range to learn the basics of the game.</p>"},{"name":"MechWarrior","year":1993,"developer":"Beam Software Pty., Ltd.","url":":MechWarrior (Europe)","filesize":725295,"score":7.8,"genres":"Action > 1st-person > Mecha / giant robot > Vehicular combat > Sci-fi / futuristic > Licensed","desc":"<p>In 3017, when Herras Ragen was 12, his father Colonel Joseph T. Ragen, a soldier in the House Davion army, was working to infiltrate and destroy a renegade mercenary cartel called the Dark Wing Lance. However, he was discovered, and the Dark Wing took their revenge: somehow, they had learned the location of the Ragen family's residence. Under cover of night they attacked, killing everyone. Only young Herras, who was at a friend's house at the time of the massacre, survived. Unbeknownst to him, the Dark Wing made an agreement that after the strike, they would separate for ten years and maintain an absolute code of secrecy before regrouping again to continue their nefarious operations.</p><p>Now, in 3027, that time is up. Herras, who has become a young man, has waited the last decade for his chance to take revenge. As a mercenary MechWarrior operating from the planet Galatea, with a light 'Mech in the hangar and 50.000 C-Bills in the bank, he will accept any mission that will lead him closer to finding the murderers of his family.</p><p><em>MechWarrior</em> on the SNES, while broadly similar to the PC game of the same name, puts the player into the BattleTech universe with a new story, and gameplay and controls suited to the console. </p><p>The central hub in the game is Galatea. Here, Herras can visit Club Zero-Zero (for the latest news, rumors and gossip), General HeadQuarters (for mission assignments) and the 'Mech Complex (for buying, selling, repairing and customizing 'Mechs). In the club, bartender Cearle usually has some helpful advice, and other characters may also offer tips and give pointers to certain assignments that will lead Herras further in his quest. He can also view Holovids left to him by other characters as well as check out bulletins from NewsNet.</p><p>At GHQ, several missions will be available at any point in the game, not all of which advance the storyline: many are entirely optional. Before accepting an assignment, the mission parameters can be studied: they include the mission type, the size of expected resistance as well as environmental conditions, like planet climate and gravity. The possible mission types are Garrison and Riot Duty (destroy all enemy 'Mechs), Recon and Objective Raids (locate and collect a specific item carried by an enemy 'Mech), Planetary Assault and Offensive Campaign (stop the enemy from entering a friendly base), Security Duty (protect a base from being overrun - from inside the site) and Siege Campaign (locate and destroy an enemy base). Before each mission, the reward for successful completion can be negotiated - often something higher than the basic offer can be reached, but asking for too much might also offend House Davion.</p><p>During an actual mission, gameplay is seen from a first-person cockpit perspective, with the SNES' Mode 7 employed for a pseudo-3d effect. Specific parts of enemy 'Mechs (torso, arms and legs) can be targeted, with expected effects: losing arms also loses weapons, while damaged legs hinder movement.</p><p>Earned C-Bills can be spent in the 'Mech Complex for repairs or new acquisitions. Eight different BattleMechs are available to buy and sell: four light, two medium, one heavy and one assault 'Mech, all entirely new designs not seen in the BattleTech tabletop games. The machines can be equipped with loads of different weapons: guided and unguided missiles, machine guns, lasers, and the mighty particle cannon. Missiles and energy guns build up heat with every shot: to prevent overheating, heat sinks should be installed - the problem is less pronounced on colder planets, naturally. Also available are more than a dozen different engines, as well as armor plates and jump jets (which have a much stronger effect on low-gravity planets).</p><p>There are various paths through the game, depending on choices taken by the player on which assignments to handle. All in all, more than 50 storyline missions plus many optional ones await.</p>"},{"name":"MechWarrior 3050","year":1995,"developer":"Activision, Inc.","url":":MechWarrior 3050 (Europe)","filesize":963524,"score":"","genres":"Sci-fi mech simulation","desc":"<p>MechWarrior 3050, also known as BattleTech in its original Sega Genesis release and in Japan as BattleTech 3050 (バトルテック3050), is a 1994 mech-based video game developed by Malibu. The first BattleTech based game to be released for the Sega Genesis, it was later ported to the Super Nintendo by Activision as MechWarrior 3050. The Super Nintendo game was localized and published in Japan by Ask Group.</p><p>The story takes place during the events of the Clan Invasion in the 3050 era. Players are assigned the role of a Clan Wolf Mechwarrior, who is sent to eliminate several Inner Sphere assets which threaten to destroy the Clan's dominance on the battlefield, and given Timber Wolf/MadCat mech.</p><p>This video game is viewed in an isometric view as opposed to the first person view of the previous game. The game also features a two-player mode where one player controls the bottom half of the mech to navigate it around the map while the second player controls the gun turret</p>"},{"name":"Mega lo Mania","year":1993,"developer":"Sensible Software"},{"name":"Mega Man & Bass","year":1998,"developer":"Lay-Up KK"},{"name":"Mega Man 7","year":1995,"developer":"Capcom Co., Ltd.","url":":Mega Man 7 (USA)","filesize":1401605,"score":7.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>At long last, Mega Man had finally managed to beat the evil Dr. Wily! With this defeat, Wily was thrown in jail, seemingly for good. The world would no longer be subjected to his madness.</p><p>But remember, Dr. Wily is mad, but he's not stupid. He had a backup plan...and all he had to do was just wait...</p><p>6 months had passed, and somewhere from deep within Wily's abandoned lab, 4 hidden capsules activated and opened. His backup plan was in action...he had hidden 4 new Wily Robots that would spring him out of jail so he could continue his mad reign.</p><p>When Mega Man hears the word that Wily was busting out of prison, he rushes onto the scene, only to encounter a strange robot he had never seen before named Bass. Bass tells Mega Man to back off, that he would stop Wily, and that Mega Man was no longer needed.</p><p>Think that's gonna stop Mega Man? No way! Mega Man takes off to put a stop to Dr. Wily and find out exactly whose side Bass is on...</p>"},{"name":"Mega Man Soccer","year":1994,"developer":"Nova Co., Ltd.","url":":Mega Man Soccer (USA)","filesize":641603,"score":5.9,"genres":"Sports > Top-down > Football (European) / Soccer > Sci-fi / futuristic","desc":"<p>Dr. Wily, angered at being foiled once again decides to send his robots to the soccer field. Dr. Light immediately responds by forming a soccer team of Mega Mans to counter Dr. Wily's latest scheme.</p><p><em>Mega Man Soccer</em> is an overhead view soccer game featuring characters from the Mega Man series. Players begin by selecting either Exhibition, Tournament, League or Capcom Championship modes. Depending on the mode, a team must be formed using either all of one type of robot, or a mixture of different types assigned to different positions on the field. In any case, each soccer team has 8 players on the field including the goalie. The goal of each team is to score on the net of the opposing team, earning points to win the game. The action follows the ball as it is tossed around the field from player to player. Once a player's team member has the ball they can choose to pass it to another teammate, shoot the ball straight ahead or perform a clearing kick (if the goalie). If the player does not have the ball, they are given control of the nearest player to the ball and can slide tackles or shoulder tackles to try to gain possession. Each type of robot has a special move that can be initiated.</p>"},{"name":"Mega Man X","year":1993,"developer":"Capcom Co., Ltd.","url":":Mega Man X (USA) (Rev 1)","filesize":938405,"score":8.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Platform > Shooter > Sci-fi / futuristic","desc":"<p><em>Mega Man X</em> is a robot designed by Dr. Light to choose his own path in life. Years after he is created, Dr. Cain finds X and mimics his design to create a race of such robots called reploids. When the sigma virus infects these reploids, causing them to commit acts of evil, it is up to Mega Man X and his partner Zero (who is quite powerful, contrary to what his name implies) to stop it.</p>"},{"name":"Mega Man X2","year":1994,"developer":"Capcom Co., Ltd.","url":":Mega Man X2 (USA)","filesize":1002188,"score":8.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>Sigma, the leader of the Maverick army, was destroyed when he underestimated his opponent: a lone warrior, awakened into a time he never knew...X.</p><p>6 months had passed, and X rose to the rank of leader of the Maverick Hunters. His first task was to eliminate the last of the Mavericks. But as he began his assignment, a mysterious group of Reploids calling themselves the X-Hunters appeared with a message to X: the remains of his fallen comrade, Zero, were in the hands of the X-Hunters, and they planned on resurrecting Zero to fight alongside them and for their fallen leader, Sigma.</p><p>X must now stop the X-Hunters and rescue Zero, and once again prevent Sigma from rising back into ultimate power.</p>"},{"name":"Mega Man X3","year":1995,"developer":"Capcom Co., Ltd.","url":":Mega Man X3 (USA)","filesize":1296531,"score":7.5,"genres":"Action > Side view > Anime / Manga > Platform > Shooter > Sci-fi / futuristic","desc":"<p>A Reploid scientist named Dr. Doppler begins creation of a new city for Reploids, which will bring a new era of peace to the Reploids and humans. But something goes terribly wrong, and now Mavericks have begun to appear everywhere! It's up to X and Zero to find out who is behind this Maverick revolt and bring them down for good!</p><p>For the first time in the series, players can play use X's friend, Zero. However, he is pretty much restricted to only about one third of each level, and has only one life (i.e when he loses all his energy, he is put out of the fight for the rest of the game).</p>"},{"name":"Megami Tensei Gaiden: Last Bible III","year":1995,"developer":"Multimedia Intelligence Transfer Co., Ltd."},{"name":"Metal Combat: Falcon's Revenge","year":1993,"developer":"Intelligent Systems Co., Ltd.","url":":Metal Combat - Falcon's Revenge (USA)","filesize":1309322,"score":7.3,"genres":"Action > 1st-person > Rail shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>Following the events of Battle Clash, the Battle Game Chiefs had been defeated. But the world did not return to peace and instead new Chiefs and new machines rose up to rule the world. Like before, the Chiefs use giant robots known as Standing Tanks (STs). Seeing the world in trouble, the hero pilots who had defeated the Battle Chiefs decide to once again enter the Battle Game using an improved version of their ST, the Falcon. The truth behind the Battle Game will take the Falcon deep into space...</p><p><em>Metal Combat: Falcon's Revenge</em> is a first person shooter designed for the Super Scope Light Gun. Gameplay is identical to Battle Clash. The player takes the role of the gunner of the giant robot, movement is handled automatically by the game, scrolling the screen. Players must keep the enemy robot in the gunsights and blast away at different parts of it, while also intercepting enemy missiles and counter-attacks. All robots have a weak point that will increase the damage done to them. Power-ups such as Neutron Beams and Plasma Bombs can be picked up following the completion of certain stages, and equipped at the beginning of combat.</p>"},{"name":"Metal Marines","year":1993,"developer":"Namco Limited","url":":Metal Marines (USA)","filesize":839298,"score":7.1,"genres":"Strategy > Isometric > Managerial / business simulation > Mecha / giant robot > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>The Antimatter Cold War has left Earth ruined as the stockpiled AM weapons of various nations were triggered in a chain effect, vaporizing large portions of the Earth. The once great continents have been drastically changed into thousands of tiny islands and various cities have washed into the oceans. During this turmoil, Zorgeuf the Great rushes to conquer the bewildered world along with a troop of commanders and declares the Earth Empire. The only hope to defeat him lies from without Earth, as the Colonial Forces send a command carrier from the major orbital base. With so many armies gone, the ground infantry unit has been replaced by the Metal Marine, a fifty foot armored robot that can be sent into battle for attack or defense. From their respective Command Center, each side in the conflict will need to direct the placement of facilities on the ground to defend against enemy attack, manage resources and successfully strike the enemy.</p><p><em>Metal Marines</em> is an isometric strategy game. Controlling one side of a conflict, the player must wage a campaign across several islands to defeat Zorgeuf and his lieutenants. The player controls logistics of the base to ensure that there are the necessary assets to wage war. On each map, the player places three underground command bases, if all of these are destroyed the battle is lost. The player must manage the resources of their money to construct new buildings or upgrade existing facilities on the map. Different buildings include Energy Plants, Factories, Economic Centers, Radar systems, Anti-Aircraft missiles, fake buildings and fake HQ bases, mine fields, gun pods, missile launchers, metal marine hangers and even ICBMs. At any time, the player may order an attack and choose which assets to fire at the opponent. Missiles, Metal Marines carriers and ICBMs all use different levels of fuel. Metal Marines once deployed in an area will automatically fire rifles at nearby targets or engage even closer targets in melee attacks. Gunpods, while stationary, will also fire on nearby enemies. Metal Marines are largely autonomous but can be manually controlled to a minor degree (directional) by the player.</p>"},{"name":"Metal Max 2","year":1993,"developer":"Crea-Tech Inc.","url":":Metal Max 2","filesize":867862,"score":"","genres":"Role-playing (RPG) > Top-down > Turn-based > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>This is a sequel to Metal Max. The game is set in a futuristic world. An evil organization known as the Grapplers terrorizes the world, destroying entire cities if they notice a sign of resistance. The elders of Mado City invited four famous monster hunters to defend the city against the Grapplers. One of the hunters, Maria, brought a friend with her - this friend is you, the hero of the game. But even the hunters can't withstand the Grapplers' assault. Their leader, the giant machine-like Ted Broiler, kills Maria. You are left on your own, and you decide to fight the Grapplers and to become a hunter yourself.</p><p>The game is a Japanese-style RPG with random encounters and turn-based combat viewed from third-person perspective, like in Final Fantasy games. There are two kinds of combat in the game: standard character-to-character combat, and vehicle battles. vehicles can be purchased, equipped, and modified just like the characters themselves. Various vehicles have different special attacks, and there are plenty of items to collect that will upgrade and repair your vehicles. As a hunter, you can also hunt down various giant monsters that populate the world, and kill them for a reward.</p><p>The Game Boy Advance port has a few extra bounties and tanks added.</p>"},{"name":"Metal Max Returns","year":1995,"developer":"Crea-Tech Inc.","url":":Metal Max Returns (Rev 1)","filesize":2412791,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Turn-based > Sci-fi / futuristic","desc":"<p>This is a remake of the game Metal Max.</p><p>The storyline and the gameplay basics remained unchanged. The remake features enhanced graphics and sound, background pictures for battles (they were black in the original), slightly different locations (more houses in towns, sometimes different layout of the towns and of the world map), and reduced difficulty levels.</p>"},{"name":"Metal Morph","year":1994,"developer":"ORIGIN Systems, Inc.","url":":Metal Morph (USA)","filesize":1113646,"score":"","genres":"Action > Behind view > Side view > 2D scrolling > Flight / aviation > Sci-fi / futuristic","desc":"<p>In the year 2214, Earth has made contact with another dimension, known as Otherside. As their ambassador, they choose to send the Metal Morph, a being made from living metal, as he is the only being that can survive the inter-dimensional travel. The people of Earth have created a Hypergate, which links the two galaxies together. Upon arriving at the alien destination, the Metal Morph is quickly ambushed and is taken to an alien lab for study so that they can travel through the Hypergate themselves. The Metal Morph quickly escapes and begins to get back to his sabotaged ship...</p><p><em>Metal Morph</em> is a side-scrolling platformer. As the Metal Morph, you can jump, duck and shoot, as well as transform into an invulnerable liquid blob of metal. While as a blob, you can also travel through pipes to get to areas you couldn't normally. Power ups such as triple shots and homing missiles make battle easier for you.</p><p>The game also has sections where you fly your spaceship to track down your stolen pods. In flight mode, you can move the ship up, down, left and right while shooting enemies and dodging their incoming shots. Power ups such as speed up (which makes the ship travel faster to its destination) and shields (which prevent instant death) can also be found.</p>"},{"name":"Metal Slader Glory: Director's Cut","year":2000,"developer":"HAL Laboratory, Inc.","url":":Metal Slader Glory - Director's Cut (Japan)","filesize":1737012,"score":"","genres":"Adventure > Fixed / flip-screen > Anime / Manga > Real-time > Japanese-style adventure > Visual novel > Menu structures","desc":"<p><em>Metal Slader Glory: Director's Cut</em> is an enhanced remake of the Family Computer game Metal Slader Glory. It features improved audio and redrawn graphics, additional scenes omitted from the original game due to lack of cartridge space, different background music due to rights issues, and new artwork for the ending.</p>"},{"name":"Metal Warriors","year":1995,"developer":"LucasArts Entertainment Company LLC","url":":Metal Warriors (USA)","filesize":999379,"score":8,"genres":"Action > Side view > Platform > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In the year 2102 the United Government of Earth is under attack by an organization known as Dark Axis, led by a man named Venkar Amon. The Metal Warriors are mecha pilots whose goal is to defend the planet and eventually expel the enemies. At first, they need to complete a few rescue and intelligence-gathering missions in space before the government can clear the path for a return to Earth and an assault on enemy bases.</p><p><em>Metal Warriors</em> is a battlemech action game with platforming elements, similar to Cybernator in concept. The game's distinctive feature is the ability to pilot six different mechs, which vary considerably in gameplay style. Each of these mechs is equipped with its own melee weapons, firearms, and shields. Most of the mechs can only walk, but one of them is able to fly while the other rolls. </p><p>The player character can leave the mech and explore the stages on foot, and also change mechs in the middle of the exploration. Power-ups can be found in special containers and include weapon upgrades (up to four levels), bouncing and heat-seeking shots, as well as heavy shoulder weapons such as a grenade launcher. </p><p>Beside the single-player mode, the game also includes a two-player versus mode, in which two players try to exploit the strengths of the various mech types and their equipment to defeat each other in combat.</p>"},{"name":"Michael Andretti's Indy Car Challenge","year":1994,"developer":"Genki Co., Ltd."},{"name":"Michael Jordan: Chaos in the Windy City","year":1994,"developer":"Electronic Arts, Inc.","url":":Michael Jordan - Chaos in the Windy City (USA)","filesize":933908,"score":7.1,"genres":"Action > Platform > Licensed","desc":"<p>In this game the player controls the famous basketball player Michael Jordan. The time is near for an All-Star Charity Game so Michael decides to go to the gym for some training. When he arrives, he finds out that his buddies' stuff is there but not his buddies. Suddenly a basketball flies in from nowhere with a note attached.</p><p>The note says something about a kidnapping and that Michael should visit a person in the Egyptian room in the city's museum. Michael has to descend into an underground prison and fight enemies with his basketball, which can be upgraded to a homing-ball, flame-ball, bounce-ball and other forms.</p>"},{"name":"Mickey Mania: The Timeless Adventures of Mickey Mouse","year":1994,"developer":"Traveller's Tales (UK) Ltd.","url":":Mickey Mania - The Timeless Adventures of Mickey Mouse (USA)","filesize":1474439,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Mickey Mouse gets a chance to go down memory lane and walk through the timeless adventures he has lived. <em>Mickey Mania</em> is a platformer where all the levels are based on Mickey's most famous cartoons. The levels range about 75 years, starting off with \"Steamboat Willie\" and going all the way to \"The Prince and the Pauper\".</p><p>The gameplay consists mostly of jumping and marble throwing at enemies, with an occasional puzzle element.</p>"},{"name":"Mickey no Tokyo Disneyland Daibōken","year":1994,"developer":"Graphic Research Co., Ltd."},{"name":"Mickey's Ultimate Challenge","year":1994,"developer":"Designer Software"},{"name":"Micro Machines","year":1994,"developer":"The Big Red Software Company Ltd."},{"name":"Micro Machines 2: Turbo Tournament","year":1995,"developer":"The Codemasters Software Company Limited"},{"name":"Might and Magic II: Gates to Another World","year":1993,"developer":"New World Computing, Inc.","url":":Might and Magic II","filesize":531646,"score":7.3,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Direct control > Multiple units/characters control > Fantasy","desc":"<p>The space traveler and rogue guardian Sheltem has left the world VARN, where he was pursued by the relentless Corak the Mysterious and a party of local adventurers helping him. The Gates to Another World eventually takes all of them to another world, known as CRON. There, a great turmoil is caused by Sheltem's actions, and the heroes must stop his madness, preventing him from casting the planet into its own sun. </p><p><em>Gates to Another World</em> is the second installment in the Might and Magic series, and a sequel to Secret of the Inner Sanctum. Core gameplay is similar to predecessor, with the player creating a party of six characters and exploring vast first-person 3D environments, while fighting enemies in turn-based combat and leveling up. Unlike the first game, enemy encounters occur at set points rather than spawning randomly, though enemy type selection is still random.</p><p>Like in the previous game, character classes rely each on a particular attribute to be effective. Knight, Paladin, Archer, Cleric, Sorcerer and Robber return, with the addition of two new classes, Ninja and Barbarian. Race selection features humans, elves, dwarves, gnomes, and half-orcs. There are several locations and items that are restricted to certain genders, alignments, or races. A new feature is the possibility to hire two non-player characters to travel with the party and participate in battles. A new skill system is introduced as well, allowing characters to learn such abilities as mountaineering (necessary to traverse mountains), linguist (for reading certain messages), cartographer (for creating an auto-map), and others.</p><p>Compared to the first game, the sequel is more quest-oriented, with various characters in towns giving quests to the party, as opposed to purely exploration-based traveling in the predecessor. Time also plays a large role in this game, with some instances requiring the party to travel to different time periods. Characters also age as the game goes on; If the player waits too long, the characters' statistics will change to reflect their aging, and they will eventually die.</p>"},{"name":"Might and Magic III: Isles of Terra","year":1995,"developer":"New World Computing, Inc.","url":":Might and Magic III - Isles of Terra (USA)","filesize":1027092,"score":8,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Direct control > Multiple units/characters control > Fantasy","desc":"<p>A party of brave heroes managed to defeat the corrupted guardian Sheltem as he attempted to destroy the world of CRON. However, the great battle between the guardians Corak and Sheltem continued in another place - the world of Terra, where Sheltem was originally appointed as a guardian. Revolting against the powerful race of the Ancients, Sheltem takes possession of their space-traveling nacelles, hurling them at the suns of other planets. It is now up to a group of local adventurers to help Corak and vanquish Sheltem once and for all.</p><p><em>Isles of Terra</em> is the third installment in the Might and Magic series, and a sequel to Gates to Another World. Like its predecessors, it is a role-playing game focusing on first-person exploration of vast pseudo-3D environments, character building, and turn-based combat. The five selectable races remain the same as in the previous games, as well as the eight character classes with the addition of two new ones: Druid and Ranger. Like in the second game, characters may learn unique skills such as thievery, swimming, merchant, and others.</p><p>This installment does away with random or pre-set enemy encounters, featuring instead enemies dynamically roaming the game world, allowing to initiate combat from a distance (for example with ranged attacks or spells). There is no option to bribe or surrender to enemies, and escaping combat can be accomplished simply by moving away, unless the enemies have already locked on the party. An automap feature is available at all times, and the player is also allowed to save the game at any time.</p>"},{"name":"Mighty Morphin Power Rangers","year":1994,"developer":"Natsume Co., Ltd.","url":":Mighty Morphin' Power Rangers (USA)","filesize":1092463,"score":6.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Licensed","desc":"<p>In <em>Mighty Morphin Power Rangers</em> the player gets to play as any of the rangers (Jason, Trini, Billy, Kimberly, and Zack) through 7 levels. Except for the last few, all the other levels let the player pick whatever ranger wanted. Each has their own unique \"super move\". At the end, whoever the player choses to play as will automatically morph and at the end of each level the player gets to fight the boss.</p>"},{"name":"Mighty Morphin Power Rangers: The Fighting Edition","year":1995,"developer":"Natsume Co., Ltd.","url":":Mighty Morphin Power Rangers - The Fighting Edition (USA)","filesize":942320,"score":"","genres":"Action > Side view > Fighting > Licensed","desc":"<p><em>Mighty Morphin Power Rangers: The Fighting Edition</em> is a game directly based on the world-known television series. In this game, you can choice among 8 playable characters: the Power Rangers' Zords (Thunder Megazord, Mega Tigerzord, Ninja Megazord, Shogun Megazord) or some of their known villains (Lipsyncher, Silver Horns, Goldar, Lord Zedd). The title offers 3 game modes: Story Mode (1-Player only), Fighting Mode (2-Player) and Trial Mode (a survival mode for 1-Player only).</p><p>During Story Mode, the goal is to defeat all the 4 Zords, the 4 villains up to Lord Zedd and last, but not least, Ivan Ooze. In this mode, you can opt by the Thunder Megazord (formed by the 5 original Rangers) or by the Mega Tigerzord (formed in conjunction with the White Ranger). The Fighting Mode is a traditional 2-Player head-to-head combat, where you can choose any of the 4 Zords or even the 4 villains. Trial Mode is an Endurance-like option, and the main goal is to win as many battles as possible using only 1 health bar (that will be partially replenished after each battle).</p><p>As well as many fighting games, you can take advantage of a Power Bar (here, it fills automatically): if you execute a Super Move when this bar is flashing, it will cause more damage, besides increasing 1 level. Once you have reached its maximum status, it's possible to execute power-up versions of Special Moves or even unleash high-damage blows (Super Moves).</p>"},{"name":"Mighty Morphin Power Rangers: The Movie","year":1995,"developer":"Natsume Co., Ltd.","url":":Mighty Morphin' Power Rangers - The Movie (USA)","filesize":948731,"score":6.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Sci-fi / futuristic > Licensed","desc":"<p>The SNES game based on <em>Mighty Morphin Power Rangers: The Movie</em> is a side-scrolling beat'em up in the vein of Final Fight and similar titles.</p><p>To stop the evil Ivan Ooze, the Power Rangers must brawl their way through seven large stages, featuring city streets, an aircraft carrier, a ski resort (complete with downhill snowboarding), a moving freight train, and more. The rangers must face off against Lord Zedd's Putty Patrol (whose troops come in more than a dozen varieties), several small and one large boss per stage. Six different rangers (Red, Yellow, Blue, Pink, Black and White) are available for selection before every level. In the two-player mode, two rangers can play at the same time.</p><p>The rangers begin each level in their civilian outfits and must collect power-ups from defeated enemies to slowly fill a power bar. Once that bar is full, they can transform into their ranger outfit at the press of a button, making them more resilient to damage and their attacks more powerful. Filling the power bar again allows them to use a signature weapon unique to each ranger for a limited time or perform an extra powerful special attack.</p><p>The game takes place on two lanes, and at most points in the game it is possible to jump between foreground and background to get to enemies or evade obstacles. In two-player mode it is of course possible to keep each ranger on their dedicated lane and only switch if absolutely necessary.</p>"},{"name":"Miracle Girls: Tomomi to Mikage no Miracle World Adventure","year":1993,"developer":"Now Production Co., Ltd."},{"name":"Miracle Piano Teaching System, The","year":1991,"developer":"The Software Toolworks, Inc."},{"name":"MLBPA Baseball","year":1994,"developer":"High Score Productions","url":":MLBPA Baseball (USA)","filesize":695280,"score":7,"genres":"Sports > Baseball > Licensed","desc":"<p>The strategy of baseball is merged with a fast-paced arcade game in MLBPA Baseball from Electronic Arts. Details designed to appeal to the die-hard fan include: real players with statistics based on the 1993 season; a full 162 game season mode; stadium music; animated scoreboards; defensive alignments; cut-off plays; run-downs; and even the double switch. Features meant to appeal to the casual fan include: large colorful arcade graphics; one stadium with animated crowds; a simplified pitching interface allowing players to steer the ball; and a batting interface that relies on timing instead of aiming cursors. Secret power-up play modes await so step up to the plate and take some hacks! Season play can be continued using passwords provided at the end of each game.</p>"},{"name":"Mo Hawk & Headphone Jack","year":1995,"developer":"Black Pearl Software"},{"name":"Monopoly","year":1992,"developer":"Sculptured Software, Inc.","url":":Monopoly (USA) (Rev 1)","filesize":308189,"score":7.3,"genres":"Strategy > Top-down > Board game > Licensed","desc":"<p>From Sculptured Software comes an adaptation of the classic board game <em>Monopoly</em> for the dominating console systems of the early 90s (later also ported to Game Boy Color).</p><p>The game can be played by up to eight players (only four in the Game Boy versions). Any number of positions can be taken over by computer opponents. The game comes with eight different opponents, which are selected from a portrait gallery (8- and 16-bit versions feature different names and portraits).</p><p>It is possible to set up a time limit for a game, and also to customize the game. Amount of starting money, owned properties, houses and hotels can be set for any player before starting. The game also comes with a number of preset scenarios with varied starting parameters. The 8-bit versions have eight scenarios, the 16-bit versions add another four. The Game Boy versions also feature the scenarios, but don't have the customization option.</p><p>During gameplay, the board is seen from the top. Moving tokens are displayed in a special animation in the center of the board, as is a hand throwing the dice. Auctions and trades take place on special screens, with the 16-bit versions being more elaborately animated and illustrated.</p>"},{"name":"Monstania","year":1996,"developer":"Bits Laboratory"},{"name":"Morph","year":1993,"developer":"Millennium Interactive Ltd."},{"name":"Mortal Kombat","year":1993,"developer":"Midway Games, Inc.","url":":Mortal Kombat (USA)","filesize":1699784,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy > Martial arts","desc":"<p>Five hundred years ago, an ancient and well respected Shaolin fighting tournament, held every 50 years, was corrupted by an evil and elderly sorcerer by the name of Shang Tsung. Shang was accompanied by Prince Goro, a warrior of the Shokan race (a four-armed half-human / half-dragon). Knowing that if ten tournaments in a row were won by the Outworld champion, the Earth Realm would be conquered by evil and fall into darkness, Shang entered Goro in the tournament and had him defeat the great Kung Lao. Goro has been reigning supreme as the undefeated fighting champion for five hundred years now. As the last tournament required draws near, Raiden, Thunder God and protector of the Earth Realm, enacts a plan to tip the scales in the humans' favor, Seven fighters step into the arena on Shang Tsung's mysterious island: Shaolin warrior Liu Kang, Special Forces operative Sonya Blade, the mercenary thug Kano, fame-seeking actor Johnny Cage, the ice-wielding Lin Kuei warrior Sub-Zero and his undead adversary Scorpion, and Raiden himself.</p><p><em>Mortal Kombat</em> is a side-scrolling fighting game. Fighting is set as one-on-one combat, allowing each player to perform a variety of punches, kicks, and special moves in order to defeat their opponent. When the opponent faces their second round loss, the winner can perform a finishing move called a \"Fatality\" on the loser. The Fatality is a move unique to each fighter that graphically kills the loser in a blood-soaked finale.</p><p>Mortal Kombat began its life as a 2-player arcade title. It is notable for its use of digitized actors to represent the game's fighters, as well as its use of copious amounts of blood during gameplay.</p>"},{"name":"Mortal Kombat II","year":1994,"developer":"Midway Manufacturing Company","url":":Mortal Kombat II (USA) (Rev 1)","filesize":2648442,"score":7.9,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts > Regional differences","desc":"<p>The Mortal Kombat fighters, plus several new ones, return for a tournament held by the evil Shang Tsung of the Outworld. The action is one-on-one as before, and famed for its high level of violence and blood (other than the sanitised Nintendo version). There are 5 difficulty levels and optional credits, as well as the usual two player mode including same character duels.</p><p>To win the main tournament, the player must beat each of the other human players, before taking on Shang Tsung, Kintaro and finally Shao Kahn. Players have a range of punches and kicks available, as well as flying kicks, uppercuts, roundhouses, and the special moves, which vary for each player. These include throws, uppercuts, long-distance bullets, bicycle kicks and a teleport feature.</p>"},{"name":"Mortal Kombat 3","year":1995,"developer":"Midway Manufacturing Company","url":":Mortal Kombat 3 (USA)","filesize":3507821,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Martial arts","desc":"<p>Shao Kahn has won. The Earthrealm is no more. In order to revive his Queen Sindel, the emperor Shao Kahn used the Outworld Tournament from Mortal Kombat 2 as a diversion while his Shadow Priests revive his fallen Queen on Earth. Once enacted, the dimensional bridge between the two realms connects, allowing Kahn's extermination squads to invade and destroy Earth, and enslave the population's souls.</p><p>A small team of Raiden's \"Chosen Warriors\" survives the attack: Mortal Kombat champion Liu Kang and his ally Kung Lao, Special Forces agents Sonya Blade and Jax, the shaman Nightwolf, the riot cop Stryker, the nomadic Kabal, and former Lin Kuei warrior Sub-Zero, who has gone rogue from his clan. Facing the warriors are the mercenary Kano, cyber-ninjas Smoke, Sektor and Cyrax, Sheeva, a female Shokan, the sorcerer Shang Tsung, and Queen Sindel herself.</p><p><em>Mortal Kombat 3</em> brings new elements to the 2D fighting series: multi-level playfields, \"Dial-A-Combo\" attacks, a \"Run\" button to speed up the battles, and \"Vs.\" codes, which unlock new powers and abilities once both players enter a code sequence in pre-match-up screens. Also included are more stage fatalities and finishing moves as each warrior attempts to go one-on-one with the Centaurian enforcer Motaro, and Shao Kahn himself.</p><p>Mortal Kombat 3 is the last traditional one-on-one fighting game game in the series to feature motion-captured digitized graphics for its kombatants, and introduces online network play to the PC version.</p>"},{"name":"Mōryō Senki Madara 2","year":1993,"developer":"Konami Corporation"},{"name":"Motoko-chan no Wonder Kitchen","year":1993,"developer":""},{"name":"Mr. Do!","year":1995,"developer":"Universal Co., Ltd."},{"name":"Mr. Nutz","year":1994,"developer":""},{"name":"Ms. Pac-Man","year":1996,"developer":"General Computer Corporation","url":":Ms. Pac-Man (USA)","filesize":148163,"score":7,"genres":"Action > Top-down > Fixed / flip-screen > Arcade","desc":"<p>In 1981, a sequel to Pac-Man was introduced in the form of his girlfriend, <em>Ms. Pac-Man</em>. This sequel continued on the \"eat the dots/avoid the ghosts\" gameplay of the original game, but added new features to keep the title fresh.</p><p>Like her boyfriend, Ms. Pac-Man attempts to clear four various and challenging mazes filled with dots and ever-moving bouncing fruit while avoiding Inky, Blinky, Pinky, and Sue, each with their own personalities and tactics. One touch from any of these ghosts means a loss of life for Ms. Pac-Man.</p><p>Ms. Pac-Man can turn the tables on her pursuers by eating one of the four Energizers located within the maze. During this time, the ghosts turn blue, and Ms. Pac-Man can eat them for bonus points (ranging from 200, 400, 800, and 1600, progressively). The Energizer power only lasts for a limited amount of time, as the ghost's eyes float back to their center box, and regenerate to chase after Ms. Pac-Man again.</p><p>Survive a few rounds of gameplay, and the player will be treated to humorous intermissions showing the growing romantic relationship between Pac-Man and Ms. Pac-Man, leading all the way up to the arrival of \"Junior\".</p>"},{"name":"MTV's Beavis and Butt-Head","year":1994,"developer":"Realtime Associates, Inc."},{"name":"Mujintō Monogatari","year":1996,"developer":"Mediamuse"},{"name":"Musya: The Classic Japanese Tale of Horror","year":1992,"developer":"Jorudan Co., Ltd.","url":":Musya - The Classic Japanese Tale of Horror (USA)","filesize":412467,"score":6.1,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Horror","desc":"<p>Shizuka holds a talisman that has locked away the Evil One in the Abyss. Recently, a guard of the Evil One has taken Shizuka away from her village along with her talisman. Now it is up to the pikeman, Imoto, to save her and seal away the Evil One.</p><p>Gameplay has Imoto going through various stages defeating enemies and stage bosses with his spear. Imoto can both thrust and spin his spear to attack enemies. He can also use 5 different magic spells, such as Thunder and Flame, which kill all the enemies on the screen.  Imoto may hold up to four scrolls of each of the five spells. Used spells can be replenished by finding items throughout each stage.</p><p>The stages included are Tengumura Cavern, Catacombs, Palace of Hate, Cave of Darkness, Catacombs of Akuma, Cursed Palace, and the Watery Prison.</p>"},{"name":"Mutant Fighter","year":1993,"developer":"Data East Corporation"},{"name":"Mystery Circle","year":1992,"developer":"Wave Corp."},{"name":"Mystery Dungeon: Shiren the Wanderer","year":1995,"developer":"Spike Chunsoft Co., Ltd."},{"name":"Mystic Ark","year":1995,"developer":"Produce Co., Ltd."}]