[{"name":"Natsume Championship Wrestling","year":1994,"developer":"Natsume Co., Ltd.","url":"5#N/Natsume%20Championship%20Wrestling%20%28NA%29.sfc","filesize":2097152,"score":6.7,"genres":"Sports > 3rd-person (Other) > Side view > Wrestling","desc":"<p><em>Natsume Championship Wrestling</em> is one of the many unlicensed professional wrestling games released in its heyday. It contains 12 fictional wrestlers (Asteroid, The Viper, Spike, Python, M. Roach, The Phantom, Big Ape, K-Bruto, H. Snake, Fangz, J. Kraze and Conan). The game modes include 1P v. CPU, 1P v. 2P, a regular and a tag team tournament or a round robin tournament to compete in. Each wrestlers has a very extensive set of moves, where different moves can be performed based on the ring situation (grappling, holds, dashes, on the ground, from ropes...) but in the end every fighter basically has the same set of moves, punch, kick, bodyslam, with a few unique ones like piledrivers and powerbombs. Each one also has his own devastating finisher.</p>"},{"name":"NBA All-Star Challenge","year":1992,"developer":"Beam Software Pty., Ltd.","url":"5#N/NBA%20All-Star%20Challenge%20%28NA%29.sfc","filesize":1048576,"score":5.4,"genres":"Sports > Diagonal-down > Basketball > Licensed","desc":"<p>NBA All-Star Challenge offers one-on-one basketball featuring NBA players from the 1991-1992 season. Five different playing modes are available: a single one-on-one match, a free throw competition, a 3 point shootout, a H.O.R.S.E. competition and a one-on-one tournament.You can choose from 27 players (one from every NBA team), including Michael Jordan, Larry Bird, Patrick Ewing, Karl Malone and David Robinson.Each mode can also be played by two players.</p>"},{"name":"NBA Give 'n Go","year":1995,"developer":"Konami Co., Ltd.","url":"5#N/NBA%20Give%20%27n%20Go%20%28NA%29.sfc","filesize":2097152,"score":7.1,"genres":"Sports > 3rd-person (Other) > Arcade > Basketball > Licensed","desc":"<p><em>NBA Give 'N Go</em> is different from usual basketball games of the era because it is played at court level with the player with the ball. Most basketball games previously had a side scrolling or isometric view. Building upon this technique, the game features large player sprites and graphics. The game features the NBA roster from 1995 complete with player ratings. Gameplay consists of true 5 on 5 basketball but in a more arcade like style with alley-oops and high flying dunks. The audio includes action oriented commentary, in the style of NBA Jam.</p>"},{"name":"NBA Hangtime","year":1996,"developer":"Midway Manufacturing Company"},{"name":"NBA Jam","year":1994,"developer":"Midway Manufacturing Company","url":"5#N/NBA%20Jam%20%28NA%2C%20Rev%201%29.sfc","filesize":2097152,"score":7.8,"genres":"Action > Sports > Side view > 2D scrolling > Arcade > Direct control > Basketball > Licensed","desc":"<p><em>NBA Jam</em> is a two-on-two basketball game You can play any NBA team, and you can play as players like Barkley, Starks, Pippen, and Grant. Each human player controls a single player, so choose your squad wisely to take team-mate skill into account. The game is action-oriented, and players can perform unrealistic slam-dunks. Full performance statistics are automatically recorded. The play clock and 3-point line apply, but other rules are largely overlooked.</p>"},{"name":"NBA Jam Tournament Edition","year":1995,"developer":"Midway Manufacturing Company","url":"8#Nintendo%20-%20SNES.zip/NBA%20Jam%20-%20Tournament%20Edition%20%28USA%29.zip","filesize":1,"score":7.6,"genres":"Action > Sports > Side view > 2D scrolling > Arcade > Direct control > Basketball > Licensed","desc":"<p>This game lets you play two-on-two arcade basketball with players from all the NBA teams. Gameplay is fast and action-packed, with few rules, no fouls, and deliberately unrealistic jamming. Players are rated on eight ability categories, from steals and blocks, to dunks and 3-pointers.</p><p>Up to four human players can take part, each always controlling a single player for their team, and AI for missing players. This allows for four players to face each other in teams of two, or for two players to team up against a third player with a CPU team-mate.</p><p>The <em>Tournament Edition</em> ups each team's roster to three players, and allows for substitutions between quarters. Shoving players now results in injuries, which lower a player's stats; encouraging you to sub them out and let them recover. Aside from the usual secret characters and cheat modes, the T.E. also includes four new additions you can individually enable from the special options menu:* \"Hot Spots\" are randomized zones on the court that reward extra points (up to a 9-point shot!) for making a basket while standing within them.</p><ul><li><p>Powerup icons appear randomly, and convey temporary arcade-like benefits when picked up. Some examples are instant \"on-fire,\" enhanced 3-point accuracy, monster dunks from anywhere on the court, or a bomb that knocks all other players to the ground.</p></li><li><p>\"Juice Mode\" increases the speed of the game up to 4x.</p></li><li><p>\"Tournament Mode\" disables all other modes, special characters, and cheats, and challenges you to defeat all the NBA teams to unlock extra players (2 extra players for almost every team). Winning Tournament Mode also unlocks a higher CPU difficulty level.</p></li></ul>"},{"name":"NBA Live 95","year":1994,"developer":"Hitmen Productions","url":"5#N/NBA%20Live%20%2795%20%28NA%29.sfc","filesize":1572864,"score":8.2,"genres":"Sports > Diagonal-down > Isometric > Direct control > Basketball > Licensed","desc":"<p>The first of the NBA Live titles on the PC, <em>NBA Live 95</em> includes all of the basketball players from the '94 - '95 season as well as the All-Star teams from the East and West.</p><p>Manage over 300 players using the General Manager feature, new in this edition. Statistics for each player and team are saved. View players and teams side-by-side to compare stats and other information. You can trade any player in the league.</p><p>Multiple in-game settings let you choose the mode of play, the style, and even the length of a quarter or session. Full motion videos bring your plays to life onscreen. Listen to the crowd roar, the noises of the court and hoop, and voices of the players. There is also a soundtrack of modern music.</p><p>The DOS version includes support for 2 graphics resolutions: Normal mode (low res) 320x200 or Wide Angle (high res) 640x480. Gameplay can be controlled using the keyboard, mouse or joystick.</p>"},{"name":"NBA Live 96","year":1996,"developer":"Hitmen Productions"},{"name":"NBA Live 97","year":1996,"developer":"Electronic Arts, Inc."},{"name":"NBA Live 98","year":1997,"developer":"Realtime Associates Seattle Division"},{"name":"NBA Showdown","year":1993,"developer":"Electronic Arts, Inc.","url":"5#N/NBA%20Showdown%20%28NA%29.sfc","filesize":1048576,"score":7,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>The final entry in Electronic Arts' basketball series based on the old NBA playoffs engine before the NBA Live series took over.</p><p>For the first time, the game features all 27 NBA teams from the 1993-1994 season. You can now play a full season with 82 games in addition to playoffs and exhibition games.</p><p>Back from the old versions are instant replays, signature moves (some of them new) and free throw T-meter. Game speed has been sped up.</p>"},{"name":"NCAA Basketball","year":1992,"developer":"Sculptured Software, Inc.","url":"5#N/NCAA%20Basketball%20%28NA%2C%20Rev%201%29.sfc","filesize":1048576,"score":7.2,"genres":"Sports > Basketball > Licensed","desc":"<p>NCAA Basketball models a college basketball season, including March Madness (if your team qualifies!) and the Final Four (if you make it that far!). Teams represented are from the Big East, Big 8, ACC, SEC, and SWC conferences (some are missing because rights could not be secured). If season play is not for you, you can play exhibition games, but if you make it to the Final Four, you can save your game and have the option of using any team you like.</p>"},{"name":"NCAA Final Four Basketball","year":1995,"developer":"Bitmasters, Inc.","url":"5#N/NCAA%20Final%20Four%20Basketball%20%28NA%29.sfc","filesize":1572864,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p><em>NCAA Final Four Basketball</em> is a standard basketball-sim with a full NCAA license with 64 of the top Division 1-A teams including North Carolina, Florida State, Boston College, and Maryland to name a few.</p><p>There are three modes of play to choose from: two <em>Practice</em> modes, one which shows the player the basic in's and outs of the game and another for free throw shooting, <em>Exhibition</em> and <em>Tournament</em>. Along with these modes are the ability to change around options to play a game to the player's liking including changing the length of the game. A battery-backup lets the player save their games, stats and rosters.</p>"},{"name":"NCAA Football","year":1994,"developer":"The Software Toolworks, Inc.","url":"5#N/NCAA%20Football%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Sports > Top-down > 2D scrolling > Football (American) > Licensed","desc":"<p>NCAA Football lets you play as one of sixteen college football teams in either an exhibition game or in tournament play. The tournament pits you against all the other teams which you must win in order to proceed; the game will automatically save after each game won so you can pick up the tournament where you left off. Team rosters are unique in that you can choose players from different decades from the 60's up to the 90's, and you can mix players from different decades if you want.</p>"},{"name":"Nekketsu Tairiku: Burning Heroes","year":1995,"developer":"J-Force"},{"name":"Neugier: Umi to Kaze no Kōdō","year":1993,"developer":"Wolf Team"},{"name":"New Horizons","year":1994,"developer":"KOEI Co., Ltd.","url":"5#N/New%20Horizons%20%28NA%29.sfc","filesize":2097152,"score":7.3,"genres":"Simulation > Strategy > Diagonal-down > Naval / watercraft","desc":"<p>In the first Uncharted Waters game, it was the 15th century and the New World was discovered. Now in <em>New Horizons</em>, it is the early 16th century and the age of exploration and sea trade is underway. Players choose from any one of six adventurers (scenarios), each with their own distinctive but intertwining plot, to embark on a quest of sailing, seamanship and exploration. The six characters are:<em> </em><em>João Franco</em>* is the son of Duke Leon Franco, the hero of the first Uncharted Waters game and an influential man in Portugal. His father wants to make him into a strong man and so decides to send him out to sea. Young Joao is tasked with learning the skills of the sailor (he is the only character who starts at level one) and embarking on a quest of discovery; reaching the far east and eventually looking for the secret of Atlantis.</p><ul><li><p><strong>Catalina Erantzo</strong> is a Spanish naval officer who believes her beloved and her brother were both murdered by the Portuguese armada. Vowing revenge she turns to a life of piracy and soon becomes a red haired scourge of the seas.</p></li><li><p><strong>Pietro Conti</strong> is a indebted man, having inherited the financial woes of the Conti family. When the Duchess Franco hires him to spy on her son, he accepts the job and obtains a ship. Pietro hopes to use these resources to seek out valuable treasure and clear up his family's debt.</p></li><li><p><strong>Ernst Von Bohr</strong> is a geographer who is teaching classes in Holland. He yearns to leave the classroom and sail the high seas, living a life of adventure that he has only read about in books. When his friend, Mercator offers to finance his initial voyage in exchange for cartography information about the world, Ernst is given the opportunity to live out his dream.</p></li><li><p><strong>Ali Vezas</strong> is a poor orphaned child living in Istanbul and serving others. He dreams of becoming his own master and making his own fortune across foreign lands. A twist of fate aides in providing him with small loans, with which he is able to afford his first ship and sail out with a cargo hold full of goods...</p></li><li><p><strong>Otto Baynes</strong> styles himself a Royal Knight of the British Empire, in the service of his majesty the king. Promoted to Admiral of the British fleet, the kingdom is worried about the increased naval power of Spanish fleets. Otto is given a letter of marque by the king and ordered to terrorize the Spanish Fleet. Equipping himself simply at first, Otto strives to become a great privateer in the name of king and country.</p></li></ul><p>Regardless of the character chosen, <em>Uncharted Waters: New Horizons</em> is a top-down sailing simulation. At sea, players control the direction of their ship, where speed is affected by the number/health of the crew, the wind and the currents. Players can navigate anywhere there is water (though some ships are not ocean worthy) and discover interesting landmarks and new ports. Upon landing at a port, the view is also top-down and the player can enter different buildings, each with unique services and goods. These include: the Inn, the Item Shop, the Shipyard, the Tavern, the Castle, the Guild Hall, the Church, the Merchant and the Harbor. It's up to the player to earn enough gold to keep the crew fed and financed and keep the fleet repaired. Primary methods of earning money are through sea trade, accepting jobs from the guild, gambling and battle with other ships.</p><p>During naval combat, the game becomes a turn-based top-down strategy game, with the player moving ships in order to obtain trajectories needed to fire cannons at enemy ships, or run alongside enemy vessels in order to board them. If the player's flagship attacks the flagship of the enemy fleet, they can challenge the opponent to a duel. If accepted, the game changes to a side-view of the two captains engaged in a fight. During this sequence, the player can only choose which fighting maneuver (strike, thrust, parry, lash) they wish to engage in.</p>"},{"name":"Newman / Haas IndyCar featuring Nigel Mansell","year":1994,"developer":"Gremlin Graphics Software Limited","url":"5#N/Newman-Haas%20IndyCar%2C%20Featuring%20Nigel%20Mansell%20%28NA%29.sfc","filesize":2097152,"score":6.5,"genres":"Racing / Driving > Simulation > 1st-person > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Newman Haas Indy Car is, as the name shows, a racing game endorsed by the CART racing team of the same name and their top driver at the time, Englishman Nigel Mansell. </p><p>The player has the option to drive a single race (where the option to practice is hidden) or go for the crown against 12 other drivers in 15 tracks (with some variety, not only ovals) across North America, with the season opener in Queensland, Australia. It is possible play solo, with a friend in split screen or with split screen against the computer, and if music or engine sounds are played in the race.A key choice in the game is selecting between Arcade and Simulation mode - in the later, the car can take a lot less damage before giving up, fine-tuning must be done by the driver and rules are enforced, under the risk of a disqualification.</p><p>Graphically, the game is less sterile than most driving games of the platform (and in 16-bit consoles, generally), thanks to the inclusion of several polygonal buildings scattered around the circuits.</p>"},{"name":"NFL Football","year":1993,"developer":"Park Place Productions","url":"5#N/NFL%20Football%20%28NA%29.sfc","filesize":1048576,"score":5.9,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>A football game featuring both an exhibition mode and a playoff mode. The game features all the real team names and logos of that era.</p><p>Exhibition mode lets the player select a team and play either another player or the computer. The player can also select a demo mode where two computer controlled teams will face off against each other. The playoff mode features 12 teams competing for a chance to win the Super Bowl.</p><p>During the game, the field is mainly viewed from a horizontal perspective. Players select their plays (pass, run, or kick) and try to outscore their opponents by the time the clock runs out. After every quarter, the game updates the player to the current game statistics.</p><p>Options include choosing whether to use standard or team specific playbooks, setting the quarter length (5, 10, or 15 minutes), and setting the weather conditions. The game also features a voice that announces key events like first downs and timeouts that can be turned off if the player desires it so.</p>"},{"name":"NFL Quarterback Club","year":1994,"developer":"Iguana Entertainment Incorporated","url":"5#N/NFL%20Quarterback%20Club%20%28NA%29.sfc","filesize":3145728,"score":7.7,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American) > Licensed","desc":"<p>One of the earliest in the series which features all 28 NFL teams including their respective nicknames and logos and many of the top players of the day including John Elway, Joe Montana, Brett Farve and Troy Aikman, just to name a few.</p><p>There are a variety of game modes to choose from including <em>NFL Play</em> which includes preseason, season and playoff modes along with the <em>Simulation</em> mode that allows players to relive past moments of NFL history and lets the player recreate these moments or change history all together.</p><p>Also included is the <em>Quarterback Challenge</em> which would become a staple in the series. In the QB Challenge, the player chooses from one of nineteen different NFL quarterbacks to compete in a series of challenges that will test their accuracy, speed, power and knowledge. Players can also create their own custom quarterback and throw them into the competition.</p><p>Players can also customize their options including quarter lengths, weather conditions, rules, etc. The game also contains a battery backup to save games and created characters.</p>"},{"name":"NFL Quarterback Club 96","year":1995,"developer":"Iguana Entertainment Incorporated","url":"5#N/NFL%20Quarterback%20Club%20%2796%20%28NA%29.sfc","filesize":3145728,"score":7.5,"genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p>Another game in <em>NFL Quarterback series</em>.Every team from the 1996 NFL season is shown here, with real player numbers and stats. 32 offensive plays and 16 defensive plays are available as you play. Options include setting quarter lengths, from one to 15 minutes, and selecting your mode of play: Preseason, Playoffs, or a full Season, in which you play 18 games towards the goal of the Super Bowl.</p>"},{"name":"NHL 94","year":1993,"developer":"High Score Productions","url":"8#Nintendo%20-%20SNES.zip/NHL%20%2794%20%28USA%29.zip","filesize":1,"score":8.1,"genres":"Sports > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>After establishing themselves in the virtual rinks, EA combined both NHL and NHLPA licenses in <em>NHL '94</em>, allowing them to feature all 26 real teams (including both expansion teams) and players of the new NHL season for the first time in the series.</p><p>Aside from the licenses, the gameplay for this edition sees for the first time the inclusion of the devastating one-timer shot, but to keep forwards (literally) in check, defenders also feature harder body checks, with new animations. For an additional challenge, players can also choose to control the goalkeeper manually. A popular feature in previous editions, fighting is completely removed from the game. Game modes include exhibition games (or \"regular season\" in-game), playoffs (best of one or best of seven) and an all new shoot-out mode. The main options remain basically the same couple since the establishment of the series - period length (5, 10 or 20 minutes), line changes (off, manual or the new automatic mode) and penalties (off, on, on but no offsides). </p><p>While there are some minor differences between platforms (Genesis features record keeping for users and the MegaCD version has more stat screens, CD quality audio backdrops and the usual highlight clips here and there), only the PC version released at the same time features complete season action.</p>"},{"name":"NHL 95","year":1994,"developer":"Park Place Productions","url":"5#N/NHL%20%2795%20%28NA%29.sfc","filesize":1048576,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p><em>NHL 95</em> was EA Sports' third licensed ice hockey game, promising the fastest action in the series to date. The action is viewed top-down, and can be played with or without realistic penalties. There is a full season mode, allowing you to guide a team through all 84 matches, with the option of injuries potentially putting players out of a sequence of matches. You have full control over trading and creating players for your squad. New in-game moves include dummy shots and lie-down blocks.</p>"},{"name":"NHL 96","year":1995,"developer":"Tiburon Entertainment","url":"5#N/NHL%20%2796%20%28NA%29.sfc","filesize":1572864,"score":7.6,"genres":"Sports > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>Strap on your helmet and cinch up your skates because this is ice hockey, not nice hockey, a fast and furious all-out assault on your senses, where the five hole looks more like a buttonhole, breakaways are met with bone-quaking body checks and the price you pay for passing across the crease is watching the other guys dance to a loud siren and a bright red light.</p>"},{"name":"NHL 97","year":1996,"developer":"Ceris Software","url":"5#N/NHL%20%2797%20%28NA%2C%20Rev%201%29.sfc","filesize":1572864,"score":7.8,"genres":"Sports > Diagonal-down > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>1997 edition of EA's NHL sport simulation series. Improvements in this edition come mostly in the graphical arena, with a refined version of the \"virtual stadium\" system that adds new camera angles (including the classical top-down one strangely missing from NHL 96), and polygonal players instead of the bitmap-based ones with motion-captured animations.</p><p>Other extras include multiplayer support for up to 8 players through network or Gravis's GrIP system, the option to create new players and trade them around, and the usual amount of EA sports licensed multimedia flair, including an interesting \"Goalie Mask Viewer\" which lets you observe the elaboratedly decorated helmets of 30 goalies.</p>"},{"name":"NHL 98","year":1997,"developer":"Electronic Arts Canada","url":"5#N/NHL%20%2798%20%28NA%29.sfc","filesize":2097152,"score":8,"genres":"Sports > Diagonal-down > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>NHL 98 features much faster and refined gameplay (now using four action keys instead of two, removing the need to double-tap to perform some actions), along other new features such as \"in-the-fly\" tactics developed by Marc Crawford, then manager of the Colorado Avalanche and new commentary lines from Jim Hughson and Darryl Reaugh and a re-worked interface.Graphics are improved from the previous version with the players being less angular, and thanks to 3Dfx support, with less pixels showing in the textures. The in-game presentation follows a TV-style script, zooming in players while displaying stats during clock stoppages.</p><p>As far as game modes go, in the year of the first Olympic Tournament with professional players, NHL 98 introduced the first real international competition, with 18 International teams to choose from. Other game modes include Season (option to pick between 25 or 82 games) and Playoff (best of 1, 3, 5 or 7 matches) and a Penalty Shootout mode.</p>"},{"name":"NHL Stanley Cup","year":1993,"developer":"Sculptured Software, Inc.","url":"5#N/NHL%20Stanley%20Cup%20%28NA%29.sfc","filesize":1048576,"score":6.2,"genres":"Sports > 3rd-person (Other) > Hockey > Licensed","desc":"<p>This early SNES title is one of the first hockey titles to simulate 3 dimensions by using the SNES mode 7 SNES technology. It contains all 26 NHL teams at the time with varying strengths and weaknesses. It doesn't have the players association license, but all of the player numbers and abilities were true to their real-life counterparts. You can take your favorite team from the regular season all the way through the titular Stanley Cup. It even has a menu option in the North American version to change the between English and French languages.</p>"},{"name":"NHLPA Hockey '93","year":1992,"developer":"Electronic Arts, Inc.","url":"5#N/NHLPA%20Hockey%20%2793%20%28NA%2C%20Rev%201%29.sfc","filesize":524288,"score":7.8,"genres":"Sports > Top-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p>The second part in Electronic Arts' hockey series. It features the NHLPA license (so it has real player names), but not the NHL license (so it doesn't have NHL team names).</p><p>Gameplay is altered only slightly over the predecessor. Regular season and Playoff modes are available. Goalies have improved AI, there are more foul play options and the game now features detailed statistics.</p>"},{"name":"Nichibutsu Arcade Classics","year":1995,"developer":""},{"name":"Nichibutsu Arcade Classics 2: Heiankyo Alien","year":1995,"developer":""},{"name":"Nickelodeon GUTS","year":1994,"developer":"Viacom New Media","url":"5#N/Nickelodeon%20GUTS%20%28NA%29.sfc","filesize":1572864,"score":"","genres":"Sports > Side view > 2D scrolling > Fixed / flip-screen > Arcade > Game show / trivia / quiz > Basketball > Football (American) > Licensed","desc":"<p><em>Nickelodeon GUTS</em> is based off of the Nickelodeon TV show in the late 90's that is basically American Gladiators for kids. The events in the game are based off of the actual game show events with the main goal being to score as many points as possible while trying to beat the clock.</p><p>In <strong>Elastic Sports</strong>, the player is strapped onto a long bungee cord and is bounced around. There are three events: <em>Slam Dunk</em> is a basketball game, <em>Attack</em> is lacrosse and <em>Spiral</em> where the objective is to throw a football through a hanging tire.</p><p><strong>Action Sports</strong> is an obstacle course which someone would find at a boot camp and is divided into two events: <em>Basic Training</em> involves poles, swinging ropes and punching bags and <em>Tornado Run</em> which adds water jets and moving platforms. Players can also pick up bonus items that will add time or replenish health and a chance at the bonus round.</p><p>The final event is the <strong>Aggro Crag</strong> which is a giant indoor mountain the player must climb while avoiding various obstacles such as confetti cannons, moving platforms and smoke vents. The goal of this event is to navigate the mountain and activate five different sensors located on the mountain before being able to activate the last one at the very top of the mountain.</p><p>There is also an option for two friends to compete either head-to-head or alternating depending upon the event. Elastic lets the players compete against each other on a split-screen while Action Sports and the Aggro Crag has to be played through alternating play.</p>"},{"name":"Nigel Mansell's World Championship Racing","year":1993,"developer":"Gremlin Graphics Software Limited","url":"5#N/Nigel%20Mansell%27s%20World%20Championship%20Racing%20%28NA%29.sfc","filesize":1048576,"score":6.9,"genres":"Racing / Driving > Simulation > 1st-person > Automobile > Track racing > Vehicle simulator > Oceania > Licensed","desc":"<p>Timing smiled on Gremlin with this licensed Formula 1 simulation, as Nigel's long quest for a championship had finally come good. The game was pitched somewhere in between a full-blown simulation like F1 GP and action games like Continental Circus. Only 12 cars were in each race, which could last from between 3 and 20 laps.</p><p>Before each race you can customize wing downforce, gear ratio, tyre selection and fuel load choices – pitstops are a standard feature of the longer races. The 16-bit versions include a unique 'Improve With Mansell' mode, in which a digitized version of Nigel's head appears in the top corner of the screen, offering instructions and praise.</p>"},{"name":"Nightmare Busters","year":2013,"developer":"Arcade Zone Ltd."},{"name":"Ninja Gaiden Trilogy","year":1995,"developer":"Tecmo, Ltd.","url":"5#N/Ninja%20Gaiden%20Trilogy%20%28NA%29.sfc","filesize":1572864,"score":7.5,"genres":"Compilation","desc":"<p>Ninja Gaiden Trilogy is a compilation of the three games in the series previously released for the NES:</p><ul><li>Ninja Gaiden</li><li>Ninja Gaiden II: The Dark Sword of Chaos</li><li>Ninja Gaiden III: The Ancient Ship of Doom</li></ul><p>All three games tell the story of ninja Ryu Hayabusa through alternating cinematic cutscenes and levels of 2D side-scrolling action. The graphics and sound are essentially the same as in the originals, but enhanced for the SNES.</p>"},{"name":"Ninja Warriors, The","year":1994,"developer":"Natsume Co., Ltd.","url":"6#Ninjawarriors%20%28USA%29.sfc","filesize":1572864,"score":7.6,"genres":"Action > Side view > Beat 'em up / brawler > Sci-fi / futuristic > Regional differences","desc":"<p>The land is under the grip of a tyrant named Benglar, who is able to brainwash those he captures. Using this ability he has taken over the military forces and now appears unstoppable. However, resistance forces lead by Mulk have been developing a new weapon: Cybernetic Special Forces with the ability to think, dubbed the Ninja Warriors. Untested, these machines are given the orders to assassinate Benglar...</p><p>Ninja Warriors plays as a side scrolling beat 'em up, and is a single player adaptation of The Ninja Warriors arcade game. Players can choose from 3 different Ninja Warriors: Ninja, Kunoichi or Kamaitachi. The characters play differently, but share some common controls. Each can attack, jump, grab the enemy, block attacks or unleash a special attack on the entire screen. This special attack charges up gradually and can be reset by being knocked to the ground.</p>"},{"name":"Nintendo Campus Challenge","year":1992,"developer":""},{"name":"Nintendo PowerFest '94","year":1994,"developer":""},{"name":"No Escape","year":1994,"developer":"Bits Corporation","url":"5#N/No%20Escape%20%28NA%29.sfc","filesize":2097152,"score":"","genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p>Based on the 1994 movie of the same name starring Ray Liotta, the player takes control of Liotta's character, Capt. J.T. Robbins, whose only objective of the game is to escape an island. After shooting his commanding officer, Robbins is imprisoned and eventually sent to the island Absolom as a war criminal, from where there is no escape possible. To do this still, the player must explore the island with side-scrolling platform gameplay for clues, finding items and combining them to make weapons and traps.  </p><p>Robbins can talk to some prisoners to help him in his quest, but he must also avoid violent prisoners, either by attacking them with punches or kicks or using traps and stealth to bypass them. The graphics are based off of rotoscopes of the actual actors from the movie.</p>"},{"name":"Nobunaga no Yabō: Haōden","year":1993,"developer":"KOEI Co., Ltd."},{"name":"Nobunaga's Ambition","year":1993,"developer":"KOEI Co., Ltd.","url":"5#N/Nobunaga%27s%20Ambition%20%28NA%29.sfc","filesize":524288,"score":7,"genres":"Strategy > Top-down > Turn-based > Turn-based strategy > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p>In the 16th century, Japan's Sengoku (\"Warring States\") period divided the nation into numerous feudal states, each ruled by a daimyo. These daimyos would often go to war with each other. Many dreamt of conquering the land, becoming the Shogun and ruling the entire country. One of those daimyos was the ambitious Nobunaga Oda, a merciless ruler and a renowned strategist. Players take on the role of Nobunaga Oda or one of many other daimyos to try to conquer Japan. </p><p><em>Nobunaga's Ambition</em> is a turn-based strategy game which can be played in different modes. Gameplay is similar to Koei's better known Romance of the Three Kingdoms game. Players begin by selecting either a 17 regions scenario or a larger 50 scenario. Then, the player must select a daimyo, each of which is rated attributes in several categories; Age, Health, Ambition, Luck, Charm and IQ. As the game progresses, these values change depending on events in the game. The age value represents a time limit of sorts, as an elderly daimyo becomes increasingly likely to die of old age or sickness.</p><p>During each of turn (one per season), players can issue one of several commands from a menu. They include: Recruiting new soldiers, Training the army, Buying Weapons, Increasing Peasant morale, Forming alliances or Hiring Ninjas to bribe &amp; assassinate. When one player attacks another, there is a war fought over the defender's region. Battles are fought in an overhead-view hex battle map. Each player takes turn moving units and issuing orders, which include attack, move, bribe and surrender. The goal is to defeat all of the enemy units (or force them into surrender). Army units each have a certain weakness against other types of enemies, and are also affected by the terrain.</p>"},{"name":"Nobunaga's Ambition: Lord of Darkness","year":1991,"developer":"Koei Tecmo Games Co., Ltd."},{"name":"Nolan Ryan's Baseball","year":1991,"developer":"Affect Co.,Ltd"},{"name":"Nontan to Issho: Kuru Kuru Puzzle","year":1994,"developer":"Game Freak, Inc."},{"name":"Nosferatu","year":1994,"developer":"SETA Corporation","url":"6#Nosferatu%20%28USA%29.sfc","filesize":2097152,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Horror","desc":"<p>Nosferatu, a feared vampire; no one has ever seen him and survived to tell. At night, he awakens to suck blood from his poor victims. The evil has to be stopped! A young man rides to the dungeon to kill Nosferatu and rescue his loved one.</p><p><em>Nosferatu</em> is a platform game similar to Prince of Persia in gameplay and presentation. The protagonist travels on platform structures and relies on acrobatics moves to overcome traps. He fights enemies with his bare fists. Like in <em>Prince of Persia</em>, there is a time limit (which can be extended by picking up the hourglass power-up). Other power-ups include colored crystals that heal the protagonist or increase his life energy.</p>"}]