[{"name":"Obitus","year":1994,"developer":"Scenario Developments","url":":Obitus (USA)","filesize":672731,"score":7,"genres":"Action > Role-playing (RPG) > 1st-person > Side view > Fantasy","desc":"<p>A medieval history lecturer named Wil Mason has been transported to the fantasy world of Middlemere, which is ruled by four rival brothers. Wil's aim is to find the secret to how he was transported here and discover a way back.</p><p><em>Obitus</em> is a role-playing game with action elements. It utilizes a first-person view for exploration, similarly to Dungeon Master and Eye of the Beholder. One of the more remarkable features is in the first-person mode: rather than having just 4 directs to face and flicking between them, there are 8 directions and the view scrolls smoothly as you turn. This smooth scrolling continues when you move forward, giving the game more of a 3D feel.</p><p>The action elements consist of horizontal scrolling areas where you fight enemies with your bow while avoiding their attacks. Later you encounter a similar type of gameplay that involves exploring castles and adds 4 directional movement.</p>"},{"name":"Ogre Battle: The March of the Black Queen","year":1993,"developer":"Quest Corporation","url":":Ogre Battle - The March of the Black Queen (USA)","filesize":1249198,"score":8.3,"genres":"Role-playing (RPG) > Strategy > Diagonal-down > Isometric > Real-time > Turn-based > Fantasy","desc":"<p>Twenty-five years ago Empress Endora conquered the entire continent of Zetegenia. Her reign proved to be tyrannical, and people of different social classes and positions began to long for a better future. Eventually, a resistance movement called the Liberation Army was formed. The protagonist (whose name and background are chosen by the player) takes command of the new army, and leads his allies towards a revolution.</p><p><em>Ogre Battle</em> has elements of a real-time strategy game and a tactical RPG. The player manages a large army consisting of characters belonging to a vast amount of different classes. These classes include military specializations as well as mythological creatures such as dragons, angels, hellhounds, undead trees, etc. Each class its own unique characteristics and abilities in battle. For example, vampires and werewolves can only be deployed when the battle takes place during the night.</p><p>The player moves troops in real time on the tactical map. Individual battles between units are handled in a turn-based RPG style. The player is able to select general commands for the battle, as well as use powerful tarot cards for special techniques. Characters level up, change classes and grow stronger over the course of the game. The player can also purchase items in towns.</p><p>The protagonist's reputation is affected by the player's decisions during the storyline. The player can make choices that may prove to be popular or unpopular with the nation in contact with the Liberation Army. In addition, every character has his or her own alignment, ranging from good to evil. Liberating towns with evil characters may lower the army's reputation. These and other choices affect the plot's development and eventually lead to one of the thirteen possible endings.</p>"},{"name":"Oh-chan no Oekaki Logic","year":1995,"developer":"Santa Claus"},{"name":"Oishii Puzzle wa Irimasen ka","year":1994,"developer":"Kuusoukagaku Corp."},{"name":"Olympic Summer Games","year":1996,"developer":"Tiertex Ltd.","url":":Olympic Summer Games (USA)","filesize":883130,"score":5.9,"genres":"Sports > 1st-person > Diagonal-down > Side view > Isometric > Olympiad / mixed sports > Licensed","desc":"<p>Olympic Summer Games is the 16-bit official videogame of the 1996 Olympic Games held in Atlanta, the third and the last IOC official title to be released on the console. A typical button masher, includes 10 events (100m sprint, 110m hurdles, pole vault, long jump, triple jump, javelin, high jump, discus, skeet and archery) and 32 countries around the world compete in custom or full Olympics, or just practice. Two players can compete head to head in the sprinting events, and a total of eight can play in the same game. Three difficulty levels allow competitive events for both rookies to veterans in the genre.</p><p>Sprinting events are a short and straight button mashing frenzy. 4 athletes compete simultaneously, the first winner advancing to the next round (two qualifiers and then the medal run). Only fast fingers and quick shotgun reaction can earn world record times. </p><p>Jumping events are a mix of shorter button mashing bursts combined with timely pressed jumps. From the straight forward high and long jump events (run and then set the jump angle) to the more elaborate triple jump (as the name suggests, three jumps must be carefully measured for world class results) and the complex pole vault, where a strong run must be followed by a sharp pole fixation and good a release upwards. Both long jump and triple jump have a first round composed by three jumps, the better eight progress into the second round, where they are given three more jumps. In the high jump and pole vault the competition continues until all athletes miss three consecutive jumps.</p><p>The throwing events (discus and javelin) work in the same fashion as the jumping events, although trickier to pull, as the setting of the angle must be followed by a timely release. Each player is entitled to three throws, the top eight allowed three more attempts.</p><p>Finally, the shooting events. Archery is a three-round competition where the goal is to amass as many points as possible by shooting at the inner rings of the target. With six arrows per round, each shot must be calculated according to the wind, choosing between steady aim and lower tension (must be aimed upwards and compensating the wind) or higher tension but a jumpy aim (can be aimed directly at the \"gold\" points). Skeet is a five round competition where the goal is to hit five clay pigeons before they disappear off-screen with two slugs for each.</p>"},{"name":"On the Ball","year":1992,"developer":"Taito Corporation","url":":On the Ball (USA)","filesize":414970,"score":7.1,"genres":"Puzzle > Racing / Driving > Top-down > 2D scrolling > Arcade > Direct control","desc":"<p>There's a kind of knick-knack you may find in dusty games rooms, a maze through which you navigate a marble by subtly tilting the board, dancing with gravity and momentum, deftly rolling your sphere out of dead ends and around the obstacles posed by holes in the board. Marble Madness explores this theme in a fudged 3-D perspective, Cloud Kingdoms in a flat 2-D one -- both by directly influencing the actions of the ball. The game takes a different approach toward a similar end; instead of moving the ball around the board, you move the board around the ball.</p><p>That's right; from the get-go, gravity pulls ever down, down, down on your ball toward the bottom of your screen regardless of board orientation; the task of the player is to rotate the board now clockwise, now counter-clockwise, to further a timely and unobstructed path beneath the ball in its progress toward each level's goal before the timer ticks down to zero. The game might as well have been named \"inertia.\" Many obstacles can be avoided, but some must be engaged head-on: a certain momentum, if not terminal velocity, must be achieved to break through crumbling brick barriers; other obstacles toggle on and off like traffic lights, demanding not only speed but timing. Some influence the ball's direction, and in addition to merely delaying the ball's progress, touching some impediments incurs an additional time penalty -- conversely, some blocks bestow time bonuses, if you can afford the ever-diminishing time needed to take the scenic detour and collect them.</p>"},{"name":"Operation Europe: Path to Victory 1939-45","year":1993,"developer":"KOEI Co., Ltd.","url":":Operation Europe; Path to Victory 1939-45 (USA)","filesize":665331,"score":6.6,"genres":"Simulation > Strategy > Top-down > Isometric > Africa > Europe > Historical events > World War II","desc":"<p>The game is an historical simulation of the European and North African theaters of World War II. The game allows up to two players to role-play as Army commanders for either the Axis or Allied forces. This game emphasizes the military aspects of the war and leaves diplomacy to the politicians.</p>"},{"name":"Operation Logic Bomb: The Ultimate Search & Destroy","year":1993,"developer":"Jaleco Ltd.","url":":Operation Logic Bomb; The Ultimate Search & Destroy (Europe)","filesize":529728,"score":7.3,"genres":"Action > Top-down > Arcade > Shooter > Sci-fi / futuristic > Horror","desc":"<p>At a secret lab developing technology in interdimensional physics, some kind of accident has occurred. Suddenly all contact is lost with the facility and the power shut down. The dimensional fabric surrounding the facility seems weak and strange monsters have been sighted. Concerned, an unknown agency preps a cybernetic soldier and his weapons to investigate...</p><p>Playing as the bionic soldier, this game is a top-down shooter. The player must blast their way through enemy forces and the activate various switches to progress. Accessing computer memory banks throughout the facility will reveal footage of the accident and give some idea of all it happened. Additionally, dimensional holes have opened up all around the levels allowing monsters to appear and making certain paths, walls and technologies inaccessible until the area has been stabilized.</p><p>The soldier uses a main weapon and a secondary weapon to progress, both of which can be cycled at any time and upgraded to new weapons found in the area.</p>"},{"name":"Operation Thunderbolt","year":1994,"developer":"Taito Corporation","url":":Operation Thunderbolt (USA)","filesize":822881,"score":7.3,"genres":"Action > 1st-person > Side view > Arcade > Rail shooter","desc":"<p><em>Operation Thunderbolt</em> is the exciting sequel to Operation Wolf. An airliner is hijacked by terrorists en-route from Paris to Boston, who threaten to kill all hostages on board if their mates aren't released from jail. Instead of reaching its destination, the airliner makes a landing in Kalubya, Africa, and all the hostages are hidden in various locations. The authorities have asked the hero from <em>Operation Wolf</em> to rescue the hostages, but only this time, the hero brings his friend along for the ride.</p><p>There are eight missions to complete in <em>Operation Thunderbolt</em>, and each one has you shooting down soldiers, choppers, and tanks. The gameplay varies every one or two missions. In some missions, you are driving a jeep or controlling a boat, while in others, you are walking while you're shooting. You have a limited supply of ammo, and a limited supply of rocket bombs, but you can always stock up by shooting down crates falling from the sky, or by killing a cat or dog that get in the line of fire. Also from crates, you can get special items like bulletproof vests, rocket bombs, and different weapons.</p><p>You also have a life bar to worry about. If you're shot at by soldiers, or if rocket bombs or grenades are thrown at you, you 'll lose energy, and once you're energy is depleted, you lose one of your three lives. You can lose a lot of energy by killing hostages on purpose, and you can't easily avoid killing them if you decide to use rocket bombs to wipe out enemies. The eighth mission, the mission that involves you fighting terrorists on a plane, proves to be difficult because a woman in a blue dress stands up and gets in the line of fire, and you have to very careful when you're going to use rocket bombs.</p><p>There are two endings to this game, and which ending you can watch will depend on the number of hostages you've saved, and whether or not you shot the pilot instead of the mission eight boss. </p>"},{"name":"Oscar","year":1996,"developer":"Flair Software Ltd."},{"name":"Osu!! Karate Bu","year":1994,"developer":"Culture Brain Inc."},{"name":"Othello World","year":1992,"developer":"Dice Co., Ltd."},{"name":"OtogirisÅ","year":1992,"developer":"Chunsoft Co., Ltd."},{"name":"Out of This World","year":1992,"developer":"Delphine Software International","url":":Out of This World (USA)","filesize":648881,"score":7.6,"genres":"Action > Side view > Fixed / flip-screen > Platform > Puzzle elements > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>A young physics professor named Lester conducts a particle experiment. Suddenly, something goes wrong, lightning strikes, and in a moment Lester finds himself in a strange alien world. Now he must fight for his life, first with his bare hands, then with a gun he finds. But what gives him courage is that he is not alone. One of the aliens who escapes from the prison together with him helps him on his dangerous quest. Friendship can overcome all obstacles.</p><p><em>Out of This World</em> combines shooting, platforming, and puzzle-solving elements. The game is divided into stages; some of them are straightforward and can only be accessed one time, while others are connected to each other, constituting a larger environment. Exploration and problem-solving are emphasized. Many levels include challenges not seen in the previous ones. Tasks may involve environmental puzzles, timed sequences, precise jumping, and combat.</p><p>Typically, enemies are defeated by using an energy gun found in an early stage. The gun's regular function is shooting energy projectiles. By pressing down and holding the fire button the player can activate an energy shield that protects Lester from regular attacks, allowing him to fire from relative safety until it evaporates. Finally, by holding the fire button even longer the gun creates powerful blasts which can disrupt shields. Most enemies are equipped with similar guns and are able to perform the same actions as Lester. Fighting enemies, therefore, requires tactical usage of regular attacks, shields, and bombs, as well as learning enemy patterns.</p><p>Each level can be accessed by typing a code the player learns after having completed the level. If Lester dies, the level must be restarted. There is no on-screen interface and no in-game dialogue in the game. Vector graphics are used for creating the game's environments and animated cutscenes.</p>"},{"name":"Out to Lunch","year":1993,"developer":"Mindscape International Ltd.","url":":Out to Lunch (USA)","filesize":587732,"score":7.3,"genres":"Action > Side view > Platform","desc":"<p>Pierre Le Chef is famed worldwide for his mouth-watering recipes involving the freshest ingredients. So, when the vegetables start attempting to run away from him, he has no choice but to chase after them.</p><p><em>Out to Lunch</em> is a platform game set across 6 countries, starting off in Switzerland and finishing in Paris. To recollect the vegetables he must first stun them, either by firing at them or jumping on them, then walk over them, in a manner similar to Fire &amp; Ice. Unusually, the game was converted from the SNES to the Amiga, not the other way around.</p>"},{"name":"Outlander","year":1993,"developer":"Mindscape International Ltd.","url":":Outlander (USA)","filesize":559258,"score":6.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Side view > 2D scrolling > Automobile > Post-apocalyptic","desc":"<p>The game's setting and style closely resemble the movie <em>The Road Warrior</em> (\"Mad Max 2\"). Your objective is to drive your car through the wasteland, trying to survive motorcycle gang members' attacks and to avoid running out of gas.</p><p>The gameplay is a split of two genres: racing and side-scrolling. In the racing parts you have to destroy enemies like motorcycle gang members, gyro-copter captains, red trucks, etc. Your car has a machine-gun installed in its front, and if some guy drives along side of you, a little window pops up, allowing you to shoot them with your shotgun.</p><p>Along the road there are several towns, and every time you pass through one of them, an alarm will warn you. As your gas run low, you have to stop on these towns and refuel your reserves of gas and ammo. When doing so, the game turns to a side-scrolling perspective, as you get out of your car, dealing with your enemies in hand-to-hand combats. In the cities you'll also find new equipment to your car, such as missile launchers, nitro, etc.</p>"}]